{"word":"Unparceling","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(物を)小分けにされた状態から元に戻す、梱包を解く、分配をやめる","english_definition":"The act of taking something that has been divided into parcels or portions and returning it to its original, undivided state; to unwrap or unpack something.","examples":[{"sentence":"The company is unparceling its assets to streamline operations.","translation":"会社は運営を合理化するために資産の小分け状態を解消している。"},{"sentence":"After receiving the package, he began unparceling the contents with excitement.","translation":"荷物を受け取った後、彼は興奮して中身の梱包を解き始めた。"}],"collocations":["unparceling assets (資産の小分け状態の解消)","unparceling a package (荷物の梱包を解く)","unparceling land (土地の区画整理の解消)"],"synonyms":["unpacking","unwrapping","consolidating","recombining"],"antonyms":["parceling","dividing","distributing","separating"]}],"etymology":{"value":"The word 'unparceling' is derived from 'un-' (a prefix meaning 'not' or 'opposite of'), combined with 'parceling' (the act of dividing something into parcels). 'Parcel' itself comes from the Old French 'parcelle,' meaning a small piece or part.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈpɑːrsəlɪŋ/","syllables":"Un-par-cel-ing"},"inflection":{"verb_forms":{"present_simple":["unparcels"],"past_simple":"unparceled","past_participle":"unparceled","present_participle":"unparceling"}},"usage_notes":{"explanation":"'Unparceling' is the process of reversing the act of parceling. It can refer to physically unwrapping or unpacking something, or metaphorically consolidating or recombining elements that were previously separated. It is less commonly used than 'unpacking' or 'unwrapping' in everyday contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is unparceling the information to her friends.","correct":"✓ She is sharing the information with her friends.","note":"'Unparceling' is less commonly used to describe sharing information. 'Sharing' or 'disseminating' are more appropriate. "},{"incorrect":"✗ The unparceling of the land was a simple task.","correct":"✓ The consolidation of the land was a simple task.","note":"When referring to land, 'consolidation' might be a more precise term than 'unparceling.'"}],"priority":"★★☆"},"related_words":{"derivatives":["unparcel (verb: to undo the division into parcels)","parcel (noun: a package; verb: to divide into portions)","parceling (noun: the act of dividing into parcels)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency (relatively uncommon word)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unparceling' is a relatively uncommon and specialized term. It refers to the process of reversing the act of dividing something into parcels or portions. This word is more likely to be encountered in technical or business contexts where the consolidation or recombination of assets or items is discussed. Due to its infrequent use, it is considered a higher-level vocabulary word."},"example_sentences":[{"sentence":"The government decided on unparceling the land to allow for larger-scale farming.","translation":"政府は、大規模農業を可能にするために土地の区画整理を解消することを決定した。","type":"verb","meaning_category":"土地の区画整理の解消"},{"sentence":"The archaeologist carefully began unparceling the ancient artifact from its protective layers.","translation":"考古学者は慎重に古代の工芸品を保護層から解き始めた。","type":"verb","meaning_category":"梱包を解く"},{"sentence":"The company announced the unparceling of its subsidiaries to focus on its core business.","translation":"会社は中核事業に集中するために子会社の小分け状態を解消すると発表した。","type":"verb","meaning_category":"資産の小分け状態の解消"}]}