{"word":"Frontenac","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"フロンテナック (カナダのケベック・シティーにある有名なシャトー・フロンテナック・ホテル、またはフランスの地名、人名)","english_definition":"A name referring to various places, people, or things, most notably the Château Frontenac hotel in Quebec City, Canada, or related to Louis de Buade de Frontenac, a governor of New France.","examples":[{"sentence":"We stayed at the Château Frontenac during our visit to Quebec City.","translation":"ケベック・シティー訪問中、シャトー・フロンテナックに宿泊しました。"},{"sentence":"Frontenac was an influential figure in the history of New France.","translation":"フロンテナックはヌーベルフランスの歴史において影響力のある人物でした。"}],"collocations":["Château Frontenac","Count Frontenac","Fort Frontenac"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Louis de Buade de Frontenac, a French courtier and Governor General of New France (Canada).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfrɒntənæk/","syllables":"Fron-te-nac"},"inflection":{},"usage_notes":{"explanation":"'Frontenac' is primarily a proper noun. It can refer to specific places, buildings (like the hotel), or historical figures. When referring to the hotel, it's usually 'Château Frontenac'. When referring to the historical figure, it's often 'Count Frontenac' or 'Louis de Buade de Frontenac'.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["Château","Quebec","Canada","Governor"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"N/A","text":"Since 'Frontenac' is a proper noun, its readability depends on the context. Understanding its historical and geographical significance is key to comprehending its usage."},"example_sentences":[{"sentence":"The iconic Château Frontenac dominates the Quebec City skyline.","translation":"象徴的なシャトー・フロンテナックはケベック・シティーのスカイラインでひときわ目立っている。","type":"noun","meaning_category":"Place/Building"},{"sentence":"History books often mention Frontenac's role in the French and Indian War.","translation":"歴史書では、フロンテナックのフレンチ・インディアン戦争における役割がよく言及される。","type":"noun","meaning_category":"Person"}]}