{"word":"Argynnis","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ヒョウモンチョウ属","english_definition":"A genus of butterflies in the family Nymphalidae, known as fritillaries.","examples":[{"sentence":"The Argynnis genus includes many beautiful orange and brown butterflies.","translation":"ヒョウモンチョウ属には、多くの美しいオレンジ色と茶色の蝶が含まれています。"}],"collocations":["Argynnis butterfly","Argynnis species"],"synonyms":["fritillary (common name)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'Argynnis', a name associated with beauty and butterflies in mythology.","priority":"★★☆"},"pronunciation":{"ipa":"/ɑːrˈɡɪnɪs/","syllables":"Ar-gyn-nis"},"inflection":{"noun_plural":"Argynnis (often used as a collective noun, so plural form is less common)"},"usage_notes":{"explanation":"'Argynnis' is a scientific term used in biology, specifically in entomology, to classify a group of butterflies. It is not commonly used in everyday language.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an Argynnis in my garden, it was a beautiful.","correct":"✓ I saw an Argynnis butterfly in my garden; it was beautiful.","note":"'Argynnis' refers to the genus, so it's more accurate to specify 'Argynnis butterfly' or 'an Argynnis species' when referring to a specific butterfly. Also, the sentence needed grammatical correction."}],"priority":"★★☆"},"related_words":{"derivatives":["Argynnini (a tribe within the Nymphalidae family)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Low frequency (scientific literature)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Argynnis' is a scientific term used exclusively in the field of entomology to refer to a specific genus of butterflies. Its usage is limited to scientific contexts and is not part of general vocabulary. Understanding this term requires a background in biology or entomology."},"example_sentences":[{"sentence":"Argynnis butterflies are known for their intricate wing patterns.","translation":"ヒョウモンチョウ属の蝶は、複雑な翅の模様で知られています。","type":"noun","meaning_category":"butterfly genus"},{"sentence":"Several species of Argynnis are found in Europe and Asia.","translation":"ヒョウモンチョウ属のいくつかの種は、ヨーロッパとアジアで見られます。","type":"noun","meaning_category":"butterfly genus"}]}