{"word":"lyric-oriented","meanings":[{"part_of_speech":"adjective","definition":"歌詞重視の、歌詞に重点を置いた","english_definition":"Focusing on or emphasizing the lyrics of a song or musical piece.","examples":[{"sentence":"This band is known for their lyric-oriented songs that tell compelling stories.","translation":"このバンドは、説得力のある物語を語る歌詞重視の曲で知られています。"},{"sentence":"He prefers lyric-oriented music to purely instrumental pieces.","translation":"彼は純粋なインストゥルメンタル作品よりも歌詞重視の音楽を好みます。"},{"sentence":"The album is a departure from their previous work, becoming more lyric-oriented and less focused on the beat.","translation":"このアルバムは以前の作品からの脱却であり、ビートよりも歌詞に重点を置くようになっています。"}],"collocations":["lyric-oriented music","lyric-oriented song","lyric-oriented album","lyric-oriented artist"],"synonyms":["lyrically focused","lyrically driven","text-based","word-centered"],"antonyms":["instrumental","melody-focused","rhythm-driven"],"related_words":["lyric","lyrics","lyricist","songwriting"],"notes":"Often used to describe music where the lyrical content is considered more important than other elements such as melody or rhythm.","level_frequency":{"frequency_google_ngram":"Relatively low frequency, but commonly used in music criticism and discussion.","priority":"★☆☆"}}],"etymology":{"value":"Combination of 'lyric' (referring to the words of a song) and 'oriented' (directed or focused towards).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪrɪk ˌɔːriˌɛntɪd/","syllables":"ly-ric-o-ri-ent-ed"},"usage_notes":{"explanation":"'Lyric-oriented' is used to describe music where the lyrics are a central and important aspect of the song. It suggests that the songwriter or band places a high value on the meaning and impact of the words.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The song was very lyric oriented.","correct":"The song was very lyric-oriented.","note":"Hyphen is needed to connect the words into a compound adjective."}],"priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Lyric-oriented' describes music where the words (lyrics) are very important. It means the song focuses on telling a story or expressing a message through its words, rather than just having a catchy tune. If a song is 'lyric-oriented,' pay attention to what the singer is saying!","priority":"★★★"},"example_sentences":[{"sentence":"Her solo work is more lyric-oriented than the band's earlier recordings.","translation":"彼女のソロ作品は、バンドの初期のレコーディングよりも歌詞重視です。","type":"general"},{"sentence":"Many fans appreciate his lyric-oriented approach to songwriting.","translation":"多くのファンは、彼の歌詞重視の作曲アプローチを高く評価しています。","type":"general"},{"sentence":"The critic described the album as a collection of beautifully crafted, lyric-oriented ballads.","translation":"評論家はそのアルバムを、美しく作られた歌詞重視のバラード集だと評しました。","type":"general"}]}