{"word":"armyworms","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヨトウムシ（夜盗虫）類","english_definition":"The larvae of several species of moths in the family Noctuidae that feed on grasses and crops, often appearing in large numbers and moving together like an army.","examples":[{"sentence":"Armyworms can cause significant damage to crops.","translation":"ヨトウムシ類は作物に大きな被害をもたらす可能性がある。"},{"sentence":"The farmer sprayed insecticide to control the armyworms in his field.","translation":"農家は畑のヨトウムシ類を駆除するために殺虫剤を散布した。"}],"collocations":["armyworm infestation (ヨトウムシの発生)","control armyworms (ヨトウムシを駆除する)","armyworm damage (ヨトウムシによる被害)"],"synonyms":["cutworms","caterpillars"],"antonyms":[]}],"etymology":{"value":"The name 'armyworm' comes from the behavior of the larvae, which often appear in large numbers and move together across fields like an army, consuming vegetation as they go.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɑːrmiˌwɜːrmz/","syllables":"ar-my-worms"},"inflection":{"noun_plural":"armyworms (always plural in common usage)"},"usage_notes":{"explanation":"'Armyworms' refers to a group of moth larvae known for their destructive feeding habits on crops and grasses. They are called 'armyworms' because they often appear in large numbers and move together across fields, consuming vegetation in their path. The term is usually used in the plural because they are rarely encountered as single individuals during infestations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an armyworm in my garden.","correct":"✓ I saw armyworms in my garden.","note":"Because they are typically found in groups, it's more common to refer to them in the plural, even if you only see one or a few."}],"priority":"★★☆"},"related_words":{"derivatives":["armyworm (singular form, less common)"],"phrasal_verbs":[],"related_species":["fall armyworm (Spodoptera frugiperda)","true armyworm (Mythimna unipuncta)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in agricultural contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Armyworms' are moth larvae that are known for eating crops and grasses. They are called 'armyworms' because they often appear in large numbers and move together like an army. This word is often used when talking about farming or gardening problems. It is more common to use the plural form 'armyworms' because they are usually seen in groups."},"example_sentences":[{"sentence":"The **armyworms** devastated the cornfields.","translation":"ヨトウムシ類はトウモロコシ畑を荒廃させた。","type":"noun","meaning_category":"pest"},{"sentence":"Farmers are struggling to control the spread of **armyworms**.","translation":"農家はヨトウムシ類の蔓延を抑えるのに苦労している。","type":"noun","meaning_category":"pest control"}]}