{"word":"unevangelized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"福音を伝えられていない、未伝道の","english_definition":"Not having been evangelized; not having had the Christian gospel preached to them.","examples":[{"sentence":"The unevangelized peoples of the remote islands still practice their traditional religions.","translation":"その遠隔地の島々の未伝道の民は、今もなお伝統的な宗教を信仰している。"},{"sentence":"Missionaries are working to reach the unevangelized areas of the world.","translation":"宣教師たちは、世界の未伝道の地域に到達するために活動している。"}],"collocations":["unevangelized people","unevangelized areas","unevangelized regions","unevangelized populations"],"synonyms":["unconverted","unchristianized","pagan","heathen"],"antonyms":["evangelized","Christianized","converted"]}],"etymology":{"value":"Formed from the prefix 'un-' (not) and the past participle 'evangelized' of the verb 'evangelize'. 'Evangelize' comes from the Greek 'euangelizō', meaning 'to bring good news'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪˈvændʒəlaɪzd/","syllables":"un-e-van-ge-lized"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Unevangelized' is primarily used in religious contexts, specifically within Christianity, to describe people or regions that have not yet been exposed to the Christian gospel. It often carries a sense of missionary purpose or a call to action to spread the Christian faith. The term can sometimes be considered insensitive or outdated depending on the context and the audience, as it implies a value judgment on other belief systems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unevangelized culture was fascinating.","correct":"✓ The unevangelized people were fascinating.","note":"'Unevangelized' refers to people or groups of people, not cultures themselves. While a culture might be associated with unevangelized people, the adjective directly describes the people."}],"priority":"★☆☆"},"related_words":{"derivatives":["evangelize (verb)","evangelization (noun)","evangelical (adjective, noun)"],"phrasal_verbs":[],"related_concepts":["missionary","evangelism","gospel","conversion","faith","religion","Christianity"]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unevangelized' is a specialized term primarily used within Christian contexts. It describes people or regions that have not yet been exposed to the Christian gospel or teachings. Due to its specific religious connotation and relatively low frequency in general usage, it's considered an advanced vocabulary word. Understanding its meaning requires familiarity with the concept of evangelism and the Christian faith."},"example_sentences":[{"sentence":"The missionary dedicated his life to reaching the unevangelized tribes in the Amazon.","translation":"その宣教師は、アマゾンの未伝道の部族に到達するために生涯を捧げた。","type":"adjective","meaning_category":"describing people"},{"sentence":"Many organizations focus on providing aid to unevangelized communities.","translation":"多くの団体が、未伝道のコミュニティへの援助提供に焦点を当てている。","type":"adjective","meaning_category":"describing communities"},{"sentence":"The map highlighted the unevangelized regions of the continent.","translation":"その地図は、大陸の未伝道の地域を強調表示していた。","type":"adjective","meaning_category":"describing regions"}]}