{"word":"LGBO","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Initialism of Lesbian, Gay, Bisexual, and Others. A more inclusive initialism than LGBT, LGBTQ, etc., that seeks to include other sexual orientations and gender identities.","english_definition":"An initialism representing lesbian, gay, bisexual, and other sexual orientations and gender identities. It is intended to be more inclusive than LGBT, LGBTQ, etc.","examples":[{"sentence":"The organization supports LGBO rights.","translation":"その団体はLGBOの権利を支援しています。"},{"sentence":"The LGBO community is diverse and vibrant.","translation":"LGBOコミュニティは多様で活気に満ちています。"}],"collocations":["LGBO community","LGBO rights","LGBO issues","support LGBO"],"synonyms":["LGBT","LGBTQ","LGBTQIA+"],"antonyms":[]}],"etymology":{"value":"Acronym formed from the initial letters of Lesbian, Gay, Bisexual, and Others.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛlˌdʒiːˌbiːˈoʊ/","syllables":"el-jee-bee-oh"},"inflection":{"noun_plural":"LGBOs"},"usage_notes":{"explanation":"LGBO is used to represent a broader range of sexual orientations and gender identities than the more common LGBT. The 'O' stands for 'Others' and is meant to include identities that are not explicitly listed in LGBT or LGBTQ. However, the term is not as widely used as LGBT or LGBTQ.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ LGBO is a person.","correct":"✓ LGBO is a group of people.","note":"LGBO refers to a group of people with different sexual orientations and gender identities, not a single person."}],"priority":"★★☆"},"related_words":{"derivatives":[],"acronyms":["LGBT","LGBTQ","LGBTQIA+"]},"level_frequency":{"frequency_google_ngram":"Low frequency - less common than LGBT or LGBTQ.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"LGBO is an initialism that stands for Lesbian, Gay, Bisexual, and Others. It is used to refer to a diverse group of people with different sexual orientations and gender identities. The 'O' in LGBO is intended to be inclusive of other identities that are not explicitly mentioned in other acronyms such as LGBT or LGBTQ. While it aims to be more inclusive, it is not as widely recognized or used as LGBT or LGBTQ."},"example_sentences":[{"sentence":"The university has an LGBO student organization.","translation":"その大学にはLGBOの学生団体があります。","type":"noun","meaning_category":"Group of people"},{"sentence":"The conference will address issues facing the LGBO community.","translation":"その会議では、LGBOコミュニティが直面している問題について取り上げます。","type":"noun","meaning_category":"Group of people"}]}