{"word":"Neomorphism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(UIデザインにおける)ニューモーフィズム：現実世界のオブジェクトを模倣した、ソフトで押し出しやへこみがあるように見えるインターフェースデザインスタイル。","english_definition":"(In UI design) a user interface design style characterized by soft, extruded or indented shapes that mimic real-world objects.","examples":[{"sentence":"Neomorphism gained popularity for its clean and modern aesthetic, but accessibility concerns limited its widespread adoption.","translation":"ニューモーフィズムはそのクリーンでモダンな美学で人気を博しましたが、アクセシビリティの問題から広範な採用は限定的でした。"},{"sentence":"The design team explored neomorphism to give the app a more tactile and engaging feel.","translation":"デザインチームは、アプリに触覚的で魅力的な雰囲気を与えるためにニューモーフィズムを検討しました。"},{"sentence":"While visually appealing, neomorphism can sometimes make it difficult to distinguish interactive elements from static ones.","translation":"視覚的には魅力的ですが、ニューモーフィズムはインタラクティブな要素と静的な要素の区別を難しくすることがあります。"}],"collocations":["UI neomorphism (UIニューモーフィズム)","neomorphic design (ニューモーフィックデザイン)","neomorphic button (ニューモーフィックボタン)","soft UI (ソフトUI - ニューモーフィズムの別名)"],"synonyms":["Soft UI","Extruded UI","Skeuomorphism (関連するが異なるデザインスタイル)"],"antonyms":["Flat design","Material design"]},{"part_of_speech":"noun","definition":"(一般的な意味)新しい形態の創造、または既存の形態の修正。","english_definition":"(In a general sense) the creation of a new form or the modification of an existing form.","examples":[{"sentence":"The artist's work represents a neomorphism in sculpture, blending traditional techniques with modern materials.","translation":"そのアーティストの作品は、伝統的な技術と現代的な素材を融合させた、彫刻におけるニューモーフィズムを表現しています。"}],"collocations":[],"synonyms":["innovation","transformation","modification"],"antonyms":["preservation","conservation"]}],"etymology":{"value":"\"Neo-\" (新しい) + \"-morphism\" (形態) からなる造語。UIデザインの文脈では、2019年頃から使われ始めた比較的新しい用語。","priority":"★★★"},"pronunciation":{"ipa":"/ˌniːoʊˈmɔːrfɪzəm/","syllables":"ne-o-mor-phism"},"inflection":{"notes":"名詞なので、複数形は \"neomorphisms\" となります。"},"usage_notes":{"explanation":"「**Neomorphism**」は、主にUIデザインの分野で使用される用語で、現実世界のオブジェクトを模倣した、ソフトで立体的な外観を持つインターフェースデザインスタイルを指します。影とハイライトを巧みに使用して、要素が押し出されているか、へこんでいるかのような錯覚を作り出します。アクセシビリティの問題から、フラットデザインやマテリアルデザインほど普及していませんが、特定のデザインプロジェクトで意図的に使用されることがあります。より一般的な意味としては、新しい形態の創造や既存の形態の修正を指すこともあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The interface was designed with neomorphism, making it very easy to see.","correct":"✓ The interface was designed with neomorphism, but it was difficult to see due to low contrast.","note":"ニューモーフィズムは視覚的に魅力的ですが、コントラストが低いため、アクセシビリティの問題を引き起こす可能性があります。"},{"incorrect":"✗ Neomorphism is the same as flat design.","correct":"✓ Neomorphism is the opposite of flat design.","note":"ニューモーフィズムは立体的な外観を特徴とするため、平坦なデザインであるフラットデザインとは対照的です。"}],"priority":"★★☆"},"related_words":{"derivatives":["neomorphic (形容詞: ニューモーフィズムの、ニューモーフィックな)"],"related_concepts":["Skeuomorphism (スキュアモーフィズム - 現実世界のオブジェクトを模倣するデザイン全般)","Flat design (フラットデザイン - シンプルで平面的なデザイン)","Material design (マテリアルデザイン - Googleが提唱するデザインシステム)","UI design (UIデザイン - ユーザーインターフェースデザイン)","UX design (UXデザイン - ユーザーエクスペリエンスデザイン)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2 (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - UI/UXデザイン分野の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Neomorphism**」は、主にUIデザインの分野で使われる専門用語です。現実のオブジェクトを模倣した、ソフトで立体的な外観を持つデザインスタイルを指します。影とハイライトを使って、ボタンやカードなどの要素が押し出されているか、へこんでいるかのように見せます。視覚的には魅力的ですが、コントラストが低いため、アクセシビリティの問題を引き起こすことがあります。デザインに関わる人以外には馴染みのない言葉かもしれません。"},"example_sentences":[{"sentence":"The new app features a neomorphism design with subtle shadows and highlights.","translation":"新しいアプリは、微妙な影とハイライトを備えたニューモーフィズムデザインを採用しています。","type":"noun","meaning_category":"UIデザインスタイル"},{"sentence":"Neomorphism aims to create a more tactile and intuitive user experience.","translation":"ニューモーフィズムは、より触覚的で直感的なユーザーエクスペリエンスの創造を目指しています。","type":"noun","meaning_category":"UIデザインスタイル"},{"sentence":"The designer experimented with neomorphic buttons to see if they improved user engagement.","translation":"デザイナーは、ニューモーフィックボタンがユーザーエンゲージメントを向上させるかどうかを試しました。","type":"adjective (neomorphic)","meaning_category":"UIデザインスタイル"},{"sentence":"Some critics argue that neomorphism sacrifices usability for aesthetics.","translation":"一部の批評家は、ニューモーフィズムはユーザビリティを犠牲にして美学を追求していると主張しています。","type":"noun","meaning_category":"UIデザインスタイル"}]}