{"word":"parapophysis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(解剖学)椎骨の横突起","english_definition":"(anatomy) A lateral process of a vertebra, especially one that articulates with a rib.","examples":[{"sentence":"The parapophysis is a key feature in identifying certain types of vertebrae.","translation":"傍突起は、特定の種類の椎骨を識別する上で重要な特徴です。"}],"collocations":[],"synonyms":["transverse process","diapophysis"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'para' (beside, near) and 'apophysis' (outgrowth).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpærəˈpɒfɪsɪs/","syllables":"pa-ra-po-phy-sis"},"inflection":{"noun_plural":"parapophyses"},"usage_notes":{"explanation":"The term 'parapophysis' is primarily used in the context of vertebrate anatomy, specifically when describing the vertebral column. It refers to a specific type of lateral projection found on vertebrae, often serving as an articulation point for ribs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The parapophysis is part of the spinal cord.","correct":"✓ The parapophysis is part of the vertebra.","note":"The parapophysis is a bony projection of the vertebra, not part of the spinal cord itself."}],"priority":"★★☆"},"related_words":{"derivatives":["apophysis","diapophysis","vertebra"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Parapophysis' is a highly specialized anatomical term used in vertebrate zoology and comparative anatomy. It refers to a specific process on a vertebra. Due to its technical nature, it is rarely encountered outside of specialized scientific contexts."},"example_sentences":[{"sentence":"In some fish species, the parapophysis is fused to the centrum of the vertebra.","translation":"一部の魚類では、傍突起は椎骨の椎体と融合しています。","type":"noun","meaning_category":"anatomy"},{"sentence":"The size and shape of the parapophysis can vary greatly between different vertebrate groups.","translation":"傍突起のサイズと形状は、異なる脊椎動物群間で大きく異なる場合があります。","type":"noun","meaning_category":"anatomy"}]}