{"word":"wage-plug","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(slang, derogatory) A person who works for wages, especially one who is perceived as being easily exploited or lacking ambition.","english_definition":"(slang, derogatory) A person who works for wages, especially one who is perceived as being easily exploited or lacking ambition.","examples":[{"sentence":"He dismissed them as wage-plugs, content to work their nine-to-five jobs without striving for anything more.","translation":"彼は彼らを、それ以上のものを目指すことなく9時から5時までの仕事に満足している賃金労働者だと見下した。"}],"collocations":[],"synonyms":["wage slave","salaryman","white-collar worker (sometimes, depending on context)"],"antonyms":["entrepreneur","business owner"]}],"etymology":{"value":"Likely a combination of 'wage' (referring to earnings) and 'plug' (implying someone who fills a role without much individual thought or initiative). The term is relatively recent and likely originated in online forums or communities with anti-work or anti-capitalist sentiments.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈweɪdʒˌplʌɡ/","syllables":"wage-plug"},"inflection":{"noun_plural":"wage-plugs"},"usage_notes":{"explanation":"'Wage-plug' is a derogatory term used to describe someone who works for wages, often implying that they are uninspired, easily replaceable, and lack ambition. It's a highly negative term and should be used with extreme caution, if at all. The term carries a strong connotation of contempt and is often used in online discussions about work, capitalism, and social class.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. This is a slang term and not commonly found in formal writing.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Wage-plug' is a highly informal and derogatory term, meaning its use is restricted to specific contexts and audiences. It's important to understand the negative connotations associated with this word before using it. It's not appropriate for formal writing or polite conversation."},"example_sentences":[{"sentence":"Don't be a wage-plug, take some risks and start your own business.","translation":"賃金労働者になるな、リスクを冒して自分のビジネスを始めろ。","type":"noun","meaning_category":"derogatory"}]}