{"word":"lymphography","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"リンパ管造影（法）","english_definition":"radiographic visualization of the lymphatic vessels and lymph nodes after injection of a contrast medium","examples":[{"sentence":"Lymphography is used to detect abnormalities in the lymphatic system.","translation":"リンパ管造影は、リンパ系の異常を検出するために使用されます。"},{"sentence":"The doctor recommended lymphography to stage the patient's cancer.","translation":"医師は、患者の癌の病期を決定するためにリンパ管造影を推奨しました。"}],"collocations":["perform lymphography","undergo lymphography","lymphography procedure","lymphography results"],"synonyms":["lymphangiography"],"antonyms":[]}],"etymology":{"value":"The word \"lymphography\" is derived from the following Greek roots: \"lympha\" (clear fluid), \"-o-\" (connecting vowel), and \"-graphy\" (writing, recording, or imaging).","priority":"★★★"},"pronunciation":{"ipa":"/lɪmˈfɒɡrəfi/","syllables":"lym-pho-gra-phy"},"inflection":{"noun_plural":"lymphographies"},"usage_notes":{"explanation":"Lymphography is a medical imaging technique used to visualize the lymphatic system. It involves injecting a contrast dye into the lymphatic vessels, usually in the foot, and then taking X-rays or other images to track the flow of the dye and identify any abnormalities, such as blockages or enlarged lymph nodes. This procedure is less commonly used now due to the availability of other imaging techniques like CT scans and MRI, but it can still be valuable in certain situations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ lymphography is a treatment for lymphedema.","correct":"✓ lymphography is a diagnostic tool for assessing the lymphatic system, not a treatment for lymphedema.","note":"Lymphography is a diagnostic procedure, not a treatment. Lymphedema has other treatments."},{"incorrect":"✗ lymphography is always the first choice for imaging lymph nodes.","correct":"✓ CT scans and MRI are often preferred over lymphography for initial lymph node imaging due to being less invasive.","note":"CT and MRI are often preferred due to being less invasive and more readily available."}],"priority":"★★☆"},"related_words":{"derivatives":["lymphographic (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Lymphography is a specialized medical term referring to the process of imaging the lymphatic system using a contrast dye and X-rays. It's a technique used to diagnose abnormalities within the lymphatic vessels and nodes. Due to its specific medical context, it's not a commonly encountered word outside of healthcare settings."},"example_sentences":[{"sentence":"The patient underwent lymphography to determine the extent of the lymphatic involvement.","translation":"患者はリンパ系の関与の程度を判断するためにリンパ管造影を受けた。","type":"general","meaning_category":"medical procedure"},{"sentence":"Lymphography revealed a blockage in the inguinal lymph nodes.","translation":"リンパ管造影により、鼠径リンパ節の閉塞が明らかになった。","type":"general","meaning_category":"medical finding"}]}