{"word":"worthinesses","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"(複数形)価値、立派さ、ふさわしさ","english_definition":"(plural form of worthiness) the qualities that make someone or something deserving of respect, admiration, or support.","examples":[{"sentence":"The committee considered the worthinesses of each candidate before making a decision.","translation":"委員会は決定を下す前に、各候補者の価値を検討しました。"},{"sentence":"The worthinesses of the charity's mission were clear to all who attended the fundraising event.","translation":"その慈善団体の使命の価値は、募金イベントに参加したすべての人にとって明らかでした。"}],"collocations":["assess the worthinesses","consider the worthinesses","evaluate the worthinesses"],"synonyms":["merits","virtues","deservingness","excellence","value","qualities","attributes"],"antonyms":["unworthiness","inadequacy","defects","faults"]}],"etymology":{"value":"Derived from 'worthy' (Old English 'weorþig', meaning 'valuable, esteemed') + '-ness' (suffix denoting a state or quality). 'Worthiness' is the state or quality of being worthy. The plural 'worthinesses' is less common and suggests a consideration of multiple aspects of worth or merit.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːrðinəsɪz/","syllables":"wor-thi-ness-es"},"inflection":{"noun_plural":"worthinesses"},"usage_notes":{"explanation":"'Worthiness' is a noun that refers to the quality of being worthy or deserving of something, such as respect, praise, or reward. The plural form, 'worthinesses,' is less frequently used and typically appears in contexts where multiple aspects or qualities of worth are being considered or compared. It is more common in formal or academic writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The worthiness of the project are obvious.","correct":"✓ The worthiness of the project is obvious.","note":"'Worthiness' is a singular noun, so it takes a singular verb ('is')."},{"incorrect":"✗ He demonstrated many worthiness during the interview.","correct":"✓ He demonstrated much worthiness during the interview. / ✓ He demonstrated many worthy qualities during the interview.","note":"'Worthiness' is an uncountable noun in this context, so use 'much' rather than 'many'. Alternatively, use the plural 'qualities' with 'worthy' as an adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":["worthy (adjective)","worthily (adverb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'worthinesses' is the plural form of 'worthiness,' which refers to the state or quality of being worthy or deserving of something. This term is not commonly used in everyday conversation and is more likely to appear in formal writing or academic contexts where multiple aspects of worth or merit are being discussed. Understanding this word requires a strong vocabulary and familiarity with abstract concepts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The judge evaluated the worthinesses of the arguments presented by both sides.","translation":"裁判官は両側から提示された議論の価値を評価しました。","type":"noun","meaning_category":"value/merit"},{"sentence":"The scholarship committee carefully considered the worthinesses of each applicant's academic record and extracurricular activities.","translation":"奨学金委員会は、各申請者の学業成績と課外活動の価値を注意深く検討しました。","type":"noun","meaning_category":"deservingness"},{"sentence":"The museum's collection highlights the worthinesses of preserving cultural heritage for future generations.","translation":"博物館のコレクションは、将来の世代のために文化遺産を保存することの価値を強調しています。","type":"noun","meaning_category":"importance"}]}