{"word":"Cucoloris","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(映画や写真撮影で使う)光を遮ったり、影を作ったりするための道具。通常、木製や金属製のフレームに様々な形に切り抜かれた素材（合板、段ボール、布など）が張られている。","english_definition":"A screen or scrim used in photography or filmmaking to create patterned illumination or shadows. It is typically a frame (wood or metal) holding a panel of material (plywood, cardboard, fabric, etc.) with cutouts of various shapes.","examples":[{"sentence":"The cinematographer used a cucoloris to break up the light coming through the window, creating a more interesting pattern on the actor's face.","translation":"撮影監督は、窓から差し込む光を遮るためにクコロリスを使用し、俳優の顔に面白い模様を作り出した。"},{"sentence":"By placing a cucoloris between the light source and the subject, the photographer was able to simulate the effect of light filtering through trees.","translation":"光源と被写体の間にクコロリスを置くことで、写真家は木漏れ日の効果をシミュレートすることができた。"}],"collocations":["use a cucoloris","place a cucoloris","cucoloris pattern","wooden cucoloris","metal cucoloris"],"synonyms":["gobo","flag","screen","scrim"],"antonyms":[]}],"etymology":{"value":"語源ははっきりしていませんが、俗説では、初期の映画撮影技師が「クック・ローリス」（Cook, Lorrys）という名前の2人の大工に道具を作らせたことに由来するとされています。また、ギリシャ語の「kuklos」（円）と「iris」（虹）を組み合わせた造語であるという説もありますが、これは可能性が低いと考えられています。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌkuːkoʊˈlɔːrɪs/","syllables":"Cu-co-lo-ris"},"inflection":{"noun_plural":"cucoloris or cucolorises"},"usage_notes":{"explanation":"クコロリスは、映画や写真撮影において、光の形や質をコントロールするために使用される特殊な道具です。ゴボ（gobo）と似た目的で使用されますが、ゴボが通常、ライトの前面に取り付けて光を遮るのに対し、クコロリスはライトと被写体の間に置いて、影やパターンを作り出すことが多いです。クコロリスは、自然な光の効果をシミュレートしたり、背景にテクスチャを加えたりするのに役立ちます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The director asked for a cookie to be placed in front of the light.","correct":"✓ The director asked for a cucoloris to be placed in front of the light.","note":"「cookie」はクコロリスの愛称として使われることもありますが、正式な名称は「cucoloris」です。"},{"incorrect":"✗ The key grip is responsible for setting up the gobo.","correct":"✓ The key grip is responsible for setting up the cucoloris.","note":"ゴボ（gobo）とクコロリス（cucoloris）は似た目的で使用されますが、異なる道具です。ゴボは通常ライトに取り付けられ、クコロリスはライトと被写体の間に置かれます。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["gobo","flag","scrim","lighting","cinematography","photography"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 映画/写真撮影の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Cucoloris**」は、映画や写真撮影で光を操るために使われる専門的な道具の名前です。これは、光を遮ったり、影の模様を作ったりするために、光源と被写体の間に置かれるスクリーンのようなものです。さまざまな形に切り抜かれた素材でできており、光がどのように被写体に当たるかをコントロールします。この用語は、映画や写真の専門家以外にはあまり知られていません。"},"example_sentences":[{"sentence":"The lighting technician adjusted the **cucoloris** to create a more dramatic shadow on the wall.","translation":"照明技師は、壁に劇的な影を作るためにクコロリスを調整した。","type":"noun","meaning_category":"道具"},{"sentence":"Using a **cucoloris** with leaf patterns, they simulated the effect of sunlight filtering through a forest canopy.","translation":"葉の模様のクコロリスを使って、彼らは森林のキャノピーから差し込む太陽光の効果をシミュレートした。","type":"noun","meaning_category":"道具"},{"sentence":"The **cucoloris** helped to add depth and texture to the otherwise plain background.","translation":"クコロリスは、単調な背景に奥行きとテクスチャを加えるのに役立った。","type":"noun","meaning_category":"道具"}]}