{"word":"Gram-positive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"グラム陽性の","english_definition":"(of bacteria) retaining the Gram stain and typically having a thick cell wall containing peptidoglycan.","examples":[{"sentence":"Staphylococcus aureus is a Gram-positive bacterium.","translation":"黄色ブドウ球菌はグラム陽性細菌です。"},{"sentence":"Gram-positive bacteria are often susceptible to penicillin.","translation":"グラム陽性細菌はしばしばペニシリンに感受性があります。"}],"collocations":["Gram-positive bacteria","Gram-positive cocci","Gram-positive cell wall"],"synonyms":["Gram+","Gram positive"],"antonyms":["Gram-negative"]},{"part_of_speech":"noun","definition":"グラム陽性菌","english_definition":"a Gram-positive bacterium.","examples":[{"sentence":"Gram-positives are characterized by their thick peptidoglycan layer.","translation":"グラム陽性菌は、厚いペプチドグリカン層によって特徴づけられます。"}],"collocations":["Gram-positives and Gram-negatives"],"synonyms":["Gram+ bacteria","Gram positive bacteria"],"antonyms":["Gram-negatives"]}],"etymology":{"value":"Named after Hans Christian Gram, the Danish bacteriologist who developed the Gram stain in 1884.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɡræm ˈpɒzətɪv/","syllables":"Gram-pos-i-tive"},"inflection":{"notes":"The word is an adjective and a noun. Adjective form does not inflect. Noun form pluralizes to Gram-positives."},"usage_notes":{"explanation":"Gram-positive bacteria retain the crystal violet stain during Gram staining, appearing purple under a microscope. This is due to their thick peptidoglycan layer in the cell wall. Gram-positive bacteria are a major group of bacteria, including many that are important in medicine and industry.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Gram-positive bacteria have a thin cell wall.","correct":"✓ Gram-positive bacteria have a thick cell wall.","note":"Gram-positive bacteria are characterized by their thick cell walls."},{"incorrect":"✗ Gram-positive is a type of virus.","correct":"✓ Gram-positive is a type of bacteria.","note":"Gram-positive refers to a classification of bacteria, not viruses."}],"priority":"★★☆"},"related_words":{"derivatives":["Gram stain","Gram-negative","bacteria","peptidoglycan"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gram-positive' is a technical term used in microbiology to classify bacteria based on their cell wall structure and reaction to the Gram stain. It indicates that the bacteria retain the crystal violet stain due to a thick peptidoglycan layer in their cell wall. This term is primarily encountered in scientific literature, medical reports, and advanced biology courses. Understanding requires knowledge of basic microbiology concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The culture revealed the presence of Gram-positive cocci.","translation":"培養の結果、グラム陽性球菌の存在が明らかになった。","type":"adjective","meaning_category":"describing bacteria"},{"sentence":"Treatment with penicillin is often effective against Gram-positives.","translation":"ペニシリンによる治療は、しばしばグラム陽性菌に効果的です。","type":"noun","meaning_category":"referring to bacteria"},{"sentence":"The thick peptidoglycan layer is characteristic of Gram-positive organisms.","translation":"厚いペプチドグリカン層は、グラム陽性生物の特徴です。","type":"adjective","meaning_category":"describing organisms"}]}