{"word":"above-water","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"水面上の、水上に現れた","english_definition":"Located or occurring above the surface of the water.","examples":[{"sentence":"The above-water parts of the ship were heavily damaged.","translation":"その船の水上部分はひどく損傷していた。"},{"sentence":"We could see the above-water portion of the reef.","translation":"私たちはその岩礁の水上に現れた部分を見ることができた。"}],"collocations":["above-water hull","above-water structure","above-water vegetation"],"synonyms":["emerged","surfaced","afloat"],"antonyms":["submerged","underwater"]},{"part_of_speech":"adjective","definition":"（経済的に）破綻していない、支払い能力がある","english_definition":"(Of a business or person) solvent; not bankrupt or in financial difficulty.","examples":[{"sentence":"The company managed to stay above-water despite the economic downturn.","translation":"その会社は景気後退にもかかわらず、なんとか破綻せずに済んだ。"},{"sentence":"He worked hard to keep his business above-water.","translation":"彼は事業を破綻させないように懸命に働いた。"}],"collocations":["stay above-water","keep above-water","remain above-water"],"synonyms":["solvent","financially stable","out of debt"],"antonyms":["bankrupt","insolvent","in debt"]}],"etymology":{"value":"Combination of 'above' and 'water'. The financial sense is a metaphorical extension of the literal sense, suggesting staying afloat financially.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈbʌvˌwɔːtər/","syllables":"a-bove-wa-ter"},"inflection":{"notes":"This word does not have typical inflectional forms as it is an adjective."},"usage_notes":{"explanation":"The term 'above-water' has two main meanings. Literally, it refers to something that is physically above the surface of water. Figuratively, it describes a situation where a business or person is managing to avoid financial ruin or bankruptcy. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The above-water of the iceberg was small.","correct":"✓ The above-water part of the iceberg was small.","note":"When referring to a portion of something above water, use 'part' or 'portion' to clarify. 'The above-water' alone is less common."},{"incorrect":"✗ The company was above-water with debt.","correct":"✓ The company was above-water despite the debt.","note":"When used in the financial sense, 'above-water' implies avoiding financial difficulty, so it's usually used with 'despite' or a similar phrase indicating a challenge."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["underwater","waterline","solvent","bankruptcy"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"above-water\" has two main uses. One is literal, describing something that is physically above the surface of water, like the part of a ship you can see. The other is figurative, describing a business or person that is financially stable and not in danger of going bankrupt. It's important to understand the context to know which meaning is being used. The financial meaning is more abstract and less common than the literal one."},"example_sentences":[{"sentence":"Only the very top of the submarine was **above-water**.","translation":"潜水艦のほんの先端だけが水上に現れていた。","type":"adjective","meaning_category":"水面上の"},{"sentence":"The small business struggled to stay **above-water** during the recession.","translation":"その中小企業は不況の間、なんとか破綻せずにいようと奮闘した。","type":"adjective","meaning_category":"支払い能力がある"}]}