{"word":"wagon-vaulted","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"かまぼこ型天井の、半円筒ヴォールト構造の","english_definition":"Having a ceiling or roof in the form of a half-cylinder; constructed with a wagon vault.","examples":[{"sentence":"The church featured a wagon-vaulted ceiling that amplified the sound of the choir.","translation":"その教会は、聖歌隊の音を増幅する半円筒ヴォールト構造の天井を特徴としていた。"},{"sentence":"The ancient Roman baths were renowned for their impressive wagon-vaulted halls.","translation":"古代ローマの浴場は、印象的なかまぼこ型天井のホールで有名だった。"}],"collocations":["wagon-vaulted ceiling","wagon-vaulted hall","wagon-vaulted structure"],"synonyms":["barrel-vaulted","tunnel-vaulted","cylindrical-vaulted"],"antonyms":["flat-roofed","gabled"]},{"part_of_speech":"verb","definition":"(過去分詞形で)かまぼこ型天井で覆われた","english_definition":"(past participle) Covered with a wagon vault.","examples":[{"sentence":"The crypt was wagon-vaulted, creating a sense of solemnity.","translation":"地下室はかまぼこ型天井で覆われており、厳粛な雰囲気を醸し出していた。"}],"collocations":["be wagon-vaulted"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Wagon' (referring to the shape of a wagon cover) + 'vaulted' (having a vaulted or arched roof). The term describes a type of vault resembling a wagon cover or barrel.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwæɡənˌvɔltɪd/","syllables":"wag-on-vault-ed"},"inflection":{"notes":"Adjective and past participle form of a verb (to wagon-vault)."},"usage_notes":{"explanation":"The term 'wagon-vaulted' is primarily used in architectural contexts to describe a specific type of ceiling or roof construction. It refers to a simple semi-cylindrical arch, resembling the cover of a wagon. It's less commonly used as a verb, but can describe the action of constructing such a vault.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The room was wagon-vaulting.","correct":"✓ The room was wagon-vaulted.","note":"'Wagon-vaulting' (present participle) would imply the room is in the process of being constructed with a wagon vault, which is less common than describing the completed structure as 'wagon-vaulted' (past participle/adjective)."},{"incorrect":"✗ The wagon-vaulted was impressive.","correct":"✓ The wagon-vaulted ceiling was impressive.","note":"'Wagon-vaulted' functions as an adjective, so it needs to modify a noun, such as 'ceiling', 'hall', or 'structure'."}],"priority":"★★☆"},"related_words":{"derivatives":["wagon vault (noun): A semi-cylindrical arch used as a roof or ceiling.","vault (noun): An arched roof or ceiling; a secure room for storage."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Specialized architectural term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Wagon-vaulted' is a technical term primarily used in architecture and art history. It describes a type of ceiling or roof that is shaped like a half-cylinder, similar to the cover of a wagon. Understanding this term requires familiarity with architectural vocabulary and vaulting techniques. It is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The medieval chapel was distinguished by its simple, yet elegant, wagon-vaulted roof.","translation":"中世の礼拝堂は、シンプルながらもエレガントな半円筒ヴォールト構造の屋根が特徴だった。","type":"adjective","meaning_category":"Description of architecture"},{"sentence":"Many Romanesque churches feature wagon-vaulted naves.","translation":"多くのロマネスク様式の教会は、かまぼこ型天井の本堂を備えている。","type":"adjective","meaning_category":"Architectural feature"},{"sentence":"The tunnel was wagon-vaulted to provide structural support.","translation":"トンネルは構造的な支持を提供するためにかまぼこ型天井で覆われていた。","type":"verb (past participle)","meaning_category":"Construction technique"}]}