{"word":"Prestabilism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"予定調和説：ライプニッツが提唱した、神が創造の時点で宇宙のすべての事象を調和するように予め定めたという哲学的な説。","english_definition":"The philosophical doctrine, especially associated with Leibniz, that God has pre-established harmony among all things in the universe from the moment of creation.","examples":[{"sentence":"Leibniz's theory of prestabilism suggests that the mind and body do not causally interact, but rather operate in parallel due to a pre-ordained harmony.","translation":"ライプニッツの予定調和説は、心と体は因果的に相互作用するのではなく、予め定められた調和によって並行して作用することを示唆している。"}],"collocations":["Leibnizian prestabilism","pre-established harmony","philosophical prestabilism"],"synonyms":["pre-established harmony","occasionalism (related, but distinct)"],"antonyms":["interactionism","emergentism"]}],"etymology":{"value":"\"Pre-\" (before) + \"establish\" + \"-ism\" (doctrine, belief).  Coined to describe Leibniz's theory of pre-established harmony.","priority":"★★★"},"pronunciation":{"ipa":"/priːˈstæbəlɪzəm/","syllables":"pre-stab-il-is-m"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"Prestabilism is a specific philosophical concept primarily associated with Gottfried Wilhelm Leibniz. It posits that God, at the time of creation, arranged the universe so that all events occur in harmony without requiring subsequent intervention. This is often contrasted with occasionalism, which suggests that God intervenes directly in each event, and interactionism, which proposes direct causal interaction between mind and body.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Prestabilism is a scientific theory.","correct":"✓ Prestabilism is a philosophical doctrine.","note":"Prestabilism is a philosophical concept, not a scientific one."},{"incorrect":"✗ Prestabilism means that events happen randomly.","correct":"✓ Prestabilism means that events are pre-ordained to happen in harmony.","note":"Prestabilism implies a pre-ordained order, not randomness."}],"priority":"★★☆"},"related_words":{"derivatives":["pre-established (adjective)"],"related_concepts":["monadology (Leibniz's theory of monads)","occasionalism","determinism","free will"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Very specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Prestabilism\" is a complex philosophical term referring to the belief that God created the universe with a pre-established harmony, so that all events occur in a coordinated manner without requiring further intervention. It's mainly discussed in the context of Leibniz's philosophy and is relevant to understanding theories of mind-body interaction and causality.","priority":"★★☆"},"example_sentences":[{"sentence":"Leibniz developed the theory of prestabilism to explain the apparent coordination between mind and body without requiring direct interaction.","translation":"ライプニッツは、心と体の明らかな協調を、直接的な相互作用を必要とせずに説明するために、予定調和説を展開した。","type":"definition","meaning_category":"philosophical concept"},{"sentence":"The concept of prestabilism is often contrasted with occasionalism and interactionism in discussions of causality.","translation":"予定調和説の概念は、因果関係の議論において、時々原因説や相互作用説と対比されることが多い。","type":"comparison","meaning_category":"philosophical context"}]}