{"word":"uremia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"尿毒症","english_definition":"a condition involving abnormally high levels of waste products in the blood.","examples":[{"sentence":"Uremia is a serious complication of kidney failure.","translation":"尿毒症は腎不全の深刻な合併症です。"},{"sentence":"Symptoms of uremia include fatigue, nausea, and confusion.","translation":"尿毒症の症状には、倦怠感、吐き気、錯乱などがあります。"}],"collocations":["chronic uremia","acute uremia","uremic syndrome","end-stage uremia"],"synonyms":["azotemia","kidney failure","renal failure"],"antonyms":[]}],"etymology":{"value":"From Greek 'ouron' (urine) + 'haima' (blood) + '-ia' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/jʊˈriːmiə/","syllables":"u-re-mi-a"},"inflection":{"noun_plural":"uremias (less common)"},"usage_notes":{"explanation":"Uremia is a clinical syndrome associated with end-stage kidney disease. It reflects the buildup of toxins normally filtered by the kidneys. It is often used interchangeably with azotemia, although azotemia refers specifically to the elevation of nitrogenous waste products in the blood, while uremia encompasses a broader range of symptoms and signs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has uremia, so he needs dialysis every day.","correct":"✓ He has end-stage renal disease with uremia, so he needs dialysis every day.","note":"Uremia is a consequence of kidney disease, not the disease itself. It's more accurate to specify the underlying kidney condition."}],"priority":"★★☆"},"related_words":{"derivatives":["uremic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Uremia' is a technical medical term referring to a serious condition resulting from kidney failure. It signifies that the kidneys are no longer able to effectively filter waste products from the blood, leading to a buildup of toxins. This term is primarily used in medical contexts and is not commonly encountered in everyday language. Understanding this term is important for healthcare professionals and those studying medicine.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient presented with severe uremia and required immediate dialysis.","translation":"患者は重度の尿毒症を呈しており、直ちに透析が必要でした。","type":"medical","meaning_category":"condition"},{"sentence":"Early diagnosis and treatment of kidney disease can prevent the development of uremia.","translation":"腎臓病の早期診断と治療は、尿毒症の発症を防ぐことができます。","type":"medical","meaning_category":"prevention"}]}