{"word":"Lingulidae","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A family of inarticulate brachiopods (lamp shells) with a long, fleshy pedicle, known for being among the oldest living animal genera.","english_definition":"A family of inarticulate brachiopods (lamp shells) characterized by their long, fleshy pedicle, and notable for being one of the oldest living animal genera.","examples":[{"sentence":"Lingulidae are considered living fossils due to their long evolutionary history.","translation":"Lingulidaeは、その長い進化の歴史から生きた化石と考えられています。"},{"sentence":"Fossil records show that Lingulidae have existed for over 500 million years.","translation":"化石記録は、Lingulidaeが5億年以上前から存在していたことを示しています。"}],"collocations":["living fossil","brachiopod fossil","inarticulate brachiopod"],"synonyms":["lamp shell","brachiopod"],"antonyms":[]}],"etymology":{"value":"The name 'Lingulidae' is derived from 'Lingula,' the genus name, which comes from the Latin word 'lingula,' meaning 'little tongue,' referring to the tongue-like shape of the shell.","priority":"★★☆"},"pronunciation":{"ipa":"/lɪŋˈɡjʊlɪdiː/","syllables":"Lin-gu-li-dae"},"inflection":{"noun_plural":"Lingulidae (plural form is the same as the singular)"},"usage_notes":{"explanation":"'Lingulidae' refers specifically to the family of brachiopods. When discussing a single member, it's common to refer to it as a 'Lingulid' or a 'Lingula' (the genus). They are often used as examples in evolutionary biology due to their remarkable persistence through geological time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Lingulidae is a type of mollusk.","correct":"✓ Lingulidae is a type of brachiopod.","note":"Lingulidae are brachiopods, not mollusks. Brachiopods have a different body plan and evolutionary history from mollusks."}],"priority":"★★☆"},"related_words":{"derivatives":["Lingula (genus)","brachiopod","inarticulate"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lingulidae' is a scientific term used in biology and paleontology to refer to a specific family of brachiopods. The term is primarily encountered in academic papers, textbooks, and scientific discussions related to evolutionary biology, paleontology, and marine biology. Understanding this term requires familiarity with biological classification and evolutionary concepts."},"example_sentences":[{"sentence":"The study focused on the evolutionary history of Lingulidae.","translation":"その研究はLingulidaeの進化の歴史に焦点を当てました。","type":"noun","meaning_category":"scientific classification"},{"sentence":"Lingulidae are often cited as examples of living fossils.","translation":"Lingulidaeは、生きた化石の例としてよく引用されます。","type":"noun","meaning_category":"evolutionary biology"},{"sentence":"The fossil record indicates that Lingulidae have changed very little over millions of years.","translation":"化石記録は、Lingulidaeが数百万年にわたってほとんど変化していないことを示しています。","type":"noun","meaning_category":"paleontology"}]}