{"word":"interhybridizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"異種交配する、異種間で交雑する","english_definition":"To cross or hybridize between different species or varieties.","examples":[{"sentence":"Scientists are interhybridizing different types of rice to create more resilient crops.","translation":"科学者たちは、より回復力のある作物を作り出すために、さまざまな種類の米を異種交配させています。"},{"sentence":"The interhybridizing of these plants has resulted in some unique and beautiful flowers.","translation":"これらの植物の異種交配は、ユニークで美しい花をもたらしました。"}],"collocations":["interhybridize plants","interhybridize species"],"synonyms":["crossbreed","hybridize","cross-pollinate"],"antonyms":[]}],"etymology":{"value":"The word is formed by combining \"inter-\" (meaning between or among) with \"hybridizing\" (the process of creating hybrids).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪntərˈhaɪbrɪdaɪzɪŋ","syllables":"in-ter-hy-brid-iz-ing"},"inflection":{"verb_forms":{"present_simple":["interhybridize","interhybridizes"],"past_simple":"interhybridized","past_participle":"interhybridized","present_participle":"interhybridizing"}},"usage_notes":{"explanation":"'Interhybridizing' refers specifically to the process of creating hybrids between different species or varieties, often in the context of botany or zoology. It implies a deliberate effort to combine genetic traits from different sources.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The animals are interhybridizing naturally, without any human intervention.","correct":"✓ The animals are hybridizing naturally, without any human intervention.","note":"If the hybridization is not between different species, simply use 'hybridizing' instead of 'interhybridizing'."}],"priority":"★☆☆"},"related_words":{"derivatives":["interhybridization (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Interhybridizing' is a technical term used in biology, specifically in genetics and botany. It refers to the process of crossing or hybridizing different species or varieties. This term is not commonly used in everyday language and is typically found in scientific or academic contexts."},"example_sentences":[{"sentence":"The researcher is interhybridizing two species of orchids to study their genetic compatibility.","translation":"研究者は、遺伝的適合性を研究するために、2種類のランを異種交配させています。","type":"verb","meaning_category":"異種交配する"},{"sentence":"Interhybridizing can lead to new varieties with improved traits.","translation":"異種交配は、改善された特性を持つ新しい品種につながる可能性があります。","type":"verb","meaning_category":"異種交配する"}]}