{"word":"bestially","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"獣のように、獣的な方法で","english_definition":"In a manner resembling a beast; in a brutal or savage way.","examples":[{"sentence":"The prisoners were treated bestially by the guards.","translation":"囚人たちは看守によって獣のように扱われた。"},{"sentence":"The crime was committed bestially, showing a complete lack of empathy.","translation":"その犯罪は獣的に行われ、共感の欠如を完全に示していた。"}],"collocations":["treat someone bestially","commit a crime bestially"],"synonyms":["brutally","savagely","inhumanly","viciously","ferociously"],"antonyms":["humanely","kindly","gently","compassionately"]}],"etymology":{"value":"From 'bestial' + '-ly'. 'Bestial' comes from Latin 'bestialis', from 'bestia' meaning 'beast'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɛstiəli/","syllables":"bes-tial-ly"},"inflection":{"notes":"Adverb, does not inflect."},"usage_notes":{"explanation":"'Bestially' describes actions or behaviors that are cruel, savage, and lacking in human compassion, resembling the behavior of a wild animal. It is often used to emphasize the extreme brutality or inhumanity of an act.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted bestially because he was bestial.","correct":"✓ He acted bestially because he had bestial tendencies.","note":"'Bestial' is an adjective describing a quality or nature, while 'bestially' is an adverb describing how an action is performed. The first sentence incorrectly uses 'bestial' as a reason for acting 'bestially'. The corrected sentence uses 'bestial tendencies' to correctly describe the nature of the person."}],"priority":"★★☆"},"related_words":{"derivatives":["bestial (adjective)","bestiality (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bestially' is an advanced word used to describe actions performed in an extremely brutal, savage, or inhuman manner, resembling the behavior of a wild animal. It is not commonly used in everyday conversation and is more frequently found in literature, historical accounts, or legal contexts to emphasize the severity and inhumanity of an action. Understanding its meaning requires a strong vocabulary and comprehension of abstract concepts related to cruelty and savagery."},"example_sentences":[{"sentence":"The soldiers behaved bestially towards the civilian population.","translation":"兵士たちは一般市民に対して獣のように振る舞った。","type":"adverb","meaning_category":"獣のように"},{"sentence":"The torture was carried out bestially, leaving the victim permanently scarred.","translation":"拷問は獣的に行われ、被害者に生涯消えない傷跡を残した。","type":"adverb","meaning_category":"獣的な方法で"}]}