{"word":"autoxidizability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己酸化されやすさ、自動酸化性","english_definition":"The ability or tendency of a substance to undergo autoxidation (spontaneous oxidation in air).","examples":[{"sentence":"The autoxidizability of unsaturated fatty acids is a key factor in food spoilage.","translation":"不飽和脂肪酸の自己酸化されやすさは、食品の腐敗における重要な要素です。"},{"sentence":"The autoxidizability of the oil was tested to determine its shelf life.","translation":"その油の自己酸化されやすさを試験して、保存期間を決定しました。"}],"collocations":["high autoxidizability (高い自己酸化性)","low autoxidizability (低い自己酸化性)","measure autoxidizability (自己酸化性を測定する)","influence autoxidizability (自己酸化性に影響を与える)"],"synonyms":["oxidizability","susceptibility to autoxidation","auto-oxidation potential"],"antonyms":["antioxidant properties","oxidation resistance","stability to oxidation"]}],"etymology":{"value":"Derived from 'autoxidation' (spontaneous oxidation in air) and the suffix '-ability' (denoting capability or tendency).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɔːtɒkˌsɪdaɪzəˈbɪlɪti","syllables":"au-tox-i-di-za-bil-i-ty"},"inflection":{"noun_plural":"autoxidizabilities"},"usage_notes":{"explanation":"'Autoxidizability' is a technical term primarily used in chemistry, food science, and related fields. It refers to the inherent property of a substance to undergo autoxidation, which is a spontaneous oxidation reaction in the presence of air or oxygen. This term is often used when discussing the stability and shelf life of materials, particularly those containing unsaturated fats or oils.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The autoxidizability is high, so it's a good antioxidant.","correct":"✓ The autoxidizability is high, so it's prone to spoilage. / ✓ The antioxidant properties are high, so it's resistant to oxidation.","note":"High autoxidizability means the substance is easily oxidized, not that it's a good antioxidant. Antioxidants have low autoxidizability or high oxidation resistance."}],"priority":"★★☆"},"related_words":{"derivatives":["autoxidize (verb)","autoxidation (noun)","oxidizability (noun)","oxidation (noun)","antioxidant (noun/adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Autoxidizability' is a complex term used in scientific contexts, specifically relating to chemistry and food science. It describes how easily a substance undergoes spontaneous oxidation in air. Understanding this term requires a solid foundation in chemistry and a familiarity with oxidation processes. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The **autoxidizability** of linoleic acid is higher than that of oleic acid.","translation":"リノール酸の自己酸化されやすさは、オレイン酸よりも高いです。","type":"noun","meaning_category":"自己酸化されやすさ"},{"sentence":"The study investigated the relationship between molecular structure and **autoxidizability**.","translation":"その研究では、分子構造と自己酸化されやすさの関係を調査しました。","type":"noun","meaning_category":"自己酸化されやすさ"}]}