{"word":"Suttapitaka","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"経蔵（きょうぞう）：仏教の三蔵（さんぞう）の一つで、釈迦の教えをまとめた経典を集めたもの。パーリ語経典においては、五つのニカーヤ（相応部、中部、長部、増支部、小部）から構成される。","english_definition":"The Suttapitaka (Pali; Sanskrit: Sutrapitaka) is the second of the three pitakas (collections) constituting the Pali Canon, the scriptural collection of Theravada Buddhism. The Suttapitaka contains the discourses (suttas) of the Buddha and some of his close disciples. It is divided into five collections (nikayas).","examples":[{"sentence":"スッタピタカには、仏陀の教えが詳細に記録されている。","translation":"The Suttapitaka contains detailed records of the Buddha's teachings."},{"sentence":"経蔵（スッタピタカ）は、仏教研究において重要な資料である。","translation":"The Suttapitaka is an important source in Buddhist studies."}],"collocations":["五つのニカーヤ (Five Nikayas)","パーリ語経典 (Pali Canon)","三蔵 (Tipitaka)","律蔵 (Vinayapitaka)","論蔵 (Abhidhammapitaka)"],"synonyms":["経蔵","経","スッタ蔵","説蔵"],"antonyms":[]},{"part_of_speech":"noun","definition":"スッタピタカ：テーラワーダ仏教のパーリ語経典における三蔵の一つ。","english_definition":"The Suttapitaka: the second of the three pitakas in the Pali Canon of Theravada Buddhism.","examples":[{"sentence":"スッタピタカは、仏教の根本教義を理解するための鍵となる。","translation":"The Suttapitaka is key to understanding the fundamental doctrines of Buddhism."}],"collocations":["テーラワーダ仏教 (Theravada Buddhism)","パーリ語経典 (Pali Canon)","三蔵 (Tipitaka)"],"synonyms":["経蔵","経","スッタ蔵","説蔵"],"antonyms":[]}],"etymology":{"value":"「スッタ (Sutta)」はパーリ語で「経」を意味し、「ピタカ (Pitaka)」は「籠」または「蔵」を意味する。したがって、「スッタピタカ」は文字通り「経の籠」または「経の蔵」を意味する。これは、経典を収集し、体系化したものを指す。","priority":"★★☆"},"pronunciation":{"ipa":"/sɯtta̠pitaka/","syllables":"sut-ta-pi-ta-ka"},"inflection":{"notes":"固有名詞のため、複数形や活用形は存在しない。"},"usage_notes":{"explanation":"「スッタピタカ」は仏教用語であり、一般的には仏教の研究者や実践者によって使用される。日常会話で使われることは稀である。経蔵は、仏教の教えを理解する上で非常に重要な位置を占めており、その内容や構成を理解することは、仏教研究において不可欠である。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ スッタピタカは仏教の法律をまとめたものである。","correct":"✓ スッタピタカは仏教の教えをまとめたものである。","note":"スッタピタカは教え（経）をまとめたものであり、法律（律）をまとめたものではない。法律は律蔵にまとめられている。"},{"incorrect":"✗ スッタピタカはチベット仏教にのみ存在する。","correct":"✓ スッタピタカはテーラワーダ仏教に存在する。","note":"スッタピタカは、特にテーラワーダ仏教のパーリ語経典において重要な位置を占める。チベット仏教には、別の経典体系が存在する。"}],"priority":"★☆☆"},"related_words":{"derivatives":["スッタ (Sutta)","ピタカ (Pitaka)","ニカーヤ (Nikaya)","律蔵 (Vinayapitaka)","論蔵 (Abhidhammapitaka)","三蔵 (Tipitaka)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 仏教研究や専門分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「スッタピタカ」は仏教用語であり、特にテーラワーダ仏教のパーリ語経典における「経蔵」を指します。これは、仏陀の教えや説法を集めたもので、五つの「ニカーヤ」と呼ばれる部分に分かれています。仏教の研究や実践に関わる文脈でのみ使用される専門的な言葉であり、日常会話ではほとんど使われません。関連語として、「律蔵（Vinayapitaka）」や「論蔵（Abhidhammapitaka）」と共に「三蔵（Tipitaka）」を構成することを覚えておくと良いでしょう。"},"example_sentences":[{"sentence":"スッタピタカの研究を通じて、初期仏教の思想を深く理解することができる。","translation":"Through the study of the Suttapitaka, one can deeply understand the thought of early Buddhism.","type":"general","meaning_category":"仏教経典"},{"sentence":"パーリ語で書かれたスッタピタカは、仏教研究者にとって貴重な資料である。","translation":"The Suttapitaka, written in Pali, is a valuable resource for Buddhist scholars.","type":"general","meaning_category":"仏教経典"},{"sentence":"スッタピタカには、仏陀の生涯や教えに関する様々な物語が収録されている。","translation":"The Suttapitaka contains various stories about the life and teachings of the Buddha.","type":"general","meaning_category":"仏教経典"}]}