{"word":"polydispersity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"多分散性：高分子試料における分子量の分布の広がりを示す尺度","english_definition":"The degree of non-uniformity of a size distribution of molecules or particles in a sample; especially, the ratio of the weight average molecular weight to the number average molecular weight.","examples":[{"sentence":"The polydispersity index (PDI) is a measure of the distribution of molecular masses in a given polymer sample.","translation":"多分散指数（PDI）は、特定のポリマーサンプルにおける分子量分布の尺度です。"},{"sentence":"A lower polydispersity indicates a more uniform sample.","translation":"低い多分散性は、より均一なサンプルを示します。"},{"sentence":"The polymer showed a high polydispersity, indicating a broad distribution of chain lengths.","translation":"そのポリマーは高い多分散性を示し、鎖長の広い分布を示していました。"}],"collocations":["polydispersity index (PDI)","high polydispersity","low polydispersity","molecular weight distribution","polymer sample"],"synonyms":["non-uniformity","heterogeneity"],"antonyms":["monodispersity","uniformity"]}],"etymology":{"value":"'Poly-' (many) + 'dispersity' (dispersion, referring to the spread of molecular weights).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒlɪdɪˈspɜːrsɪti/","syllables":"pol-y-di-sper-si-ty"},"inflection":{"noun_plural":"polydispersities"},"usage_notes":{"explanation":"'Polydispersity' is primarily used in the context of polymer chemistry and materials science. It quantifies the heterogeneity of a polymer sample with respect to molecular weight. A monodisperse sample has a PDI of 1, indicating all molecules have the same molecular weight. Higher PDI values indicate a broader distribution of molecular weights.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The polydispersity are high.","correct":"✓ The polydispersity is high.","note":"'Polydispersity' is an uncountable noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["polydisperse (adjective)"],"related_terms":["monodispersity","molecular weight","polymer","PDI (polydispersity index)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Polydispersity' is a technical term used in chemistry and materials science to describe the range of molecular weights within a polymer sample. It is a measure of how uniform or non-uniform the sample is. A high polydispersity means there is a wide range of different sized molecules, while a low polydispersity means the molecules are more similar in size. The polydispersity index (PDI) is a numerical value that represents this distribution, with 1 indicating a perfectly uniform sample (monodisperse)."},"example_sentences":[{"sentence":"The synthesized polymer exhibited a high polydispersity, suggesting uncontrolled polymerization.","translation":"合成されたポリマーは高い多分散性を示し、制御されていない重合を示唆していました。","type":"general","meaning_category":"general"},{"sentence":"Gel permeation chromatography was used to determine the polydispersity of the sample.","translation":"ゲル浸透クロマトグラフィーを用いて、サンプルの多分散性を測定しました。","type":"technical","meaning_category":"technical"},{"sentence":"Controlling the polydispersity is crucial for achieving desired material properties.","translation":"多分散性を制御することは、望ましい材料特性を達成するために重要です。","type":"technical","meaning_category":"technical"}]}