{"word":"hydrotechny","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"水利技術、水工技術","english_definition":"The technology of utilizing water resources, including irrigation, drainage, flood control, and hydroelectric power.","examples":[{"sentence":"The development of hydrotechny has allowed for increased agricultural productivity in arid regions.","translation":"水利技術の発展により、乾燥地域での農業生産性が向上しました。"},{"sentence":"Modern hydrotechny incorporates sustainable practices to minimize environmental impact.","translation":"現代の水工技術は、環境への影響を最小限に抑えるための持続可能な慣行を取り入れています。"}],"collocations":["hydrotechny development","sustainable hydrotechny","modern hydrotechny"],"synonyms":["water engineering","hydraulic engineering","water resources technology"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hydro' (water) and 'techne' (art, skill, craft).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌhaɪdroʊˈtɛkni/","syllables":"hy-dro-tech-ny"},"inflection":{"noun_plural":"hydrotechnies"},"usage_notes":{"explanation":"'Hydrotechny' refers to the practical application of scientific and engineering principles to manage and utilize water resources. It encompasses a wide range of activities, from the construction of dams and canals to the implementation of water conservation measures.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["hydrotechnical (adjective)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Hydrotechny' is a specialized term related to water management and engineering. It's not commonly used in everyday conversation but is relevant in technical and academic contexts concerning water resources. Understanding this term requires familiarity with engineering and environmental science concepts."},"example_sentences":[{"sentence":"The ancient Romans were masters of hydrotechny, building aqueducts to supply water to their cities.","translation":"古代ローマ人は水利技術の達人であり、都市に水を供給するために水道橋を建設しました。","type":"general","meaning_category":"水利技術"},{"sentence":"The course covers various aspects of hydrotechny, including dam construction and irrigation techniques.","translation":"このコースでは、ダム建設や灌漑技術など、水利技術のさまざまな側面を扱います。","type":"academic","meaning_category":"水利技術"}]}