{"word":"inflation-hedged","meanings":[{"part_of_speech":"adjective","definition":"インフレヘッジされた、インフレ対策が施された","english_definition":"Protected against the negative effects of inflation; designed to maintain its value or increase in value during periods of inflation.","examples":[{"sentence":"The company's portfolio includes several inflation-hedged assets, such as real estate and commodities.","translation":"その会社のポートフォリオには、不動産や商品などのインフレヘッジされた資産がいくつか含まれています。"},{"sentence":"Investing in inflation-hedged bonds can help preserve your purchasing power.","translation":"インフレヘッジされた債券に投資することは、購買力を維持するのに役立ちます。"},{"sentence":"Gold is often considered an inflation-hedged investment.","translation":"金はしばしばインフレヘッジされた投資とみなされます。"}],"collocations":["inflation-hedged assets","inflation-hedged bonds","inflation-hedged investment","inflation-hedged strategy"],"synonyms":["inflation-resistant","inflation-protected"],"antonyms":["inflation-vulnerable","inflation-sensitive"],"related_words":["inflation","hedge","hedging","deflation","stagflation"],"notes":"This term is commonly used in finance and economics to describe investments or strategies that are designed to protect against the erosion of purchasing power caused by inflation.","level_frequency":{"frequency_google_ngram":"Relatively low frequency, but common in financial contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'inflation-hedged' describes something that is protected from the negative effects of inflation. Inflation reduces the purchasing power of money, so an 'inflation-hedged' asset or strategy is one that is designed to maintain or increase its value during periods of rising prices. This term is often used in the context of investments, finance, and economics."},"example_sentences":[{"sentence":"Real estate is often considered an **inflation-hedged** asset because property values tend to rise with inflation.","translation":"不動産は、物件の価値がインフレとともに上昇する傾向があるため、インフレヘッジされた資産と見なされることがよくあります。","type":"adjective","meaning_category":"インフレ対策が施された"},{"sentence":"The fund manager recommended investing in **inflation-hedged** securities to protect against potential losses.","translation":"ファンドマネージャーは、潜在的な損失から保護するために、インフレヘッジされた証券への投資を推奨しました。","type":"adjective","meaning_category":"インフレ対策が施された"}]}],"etymology":{"value":"Derived from 'inflation' (a general increase in prices and fall in the purchasing value of money) and 'hedged' (protected against loss, typically through offsetting investments).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈfleɪʃən hedʒd/","syllables":"in-fla-tion-hedged"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns."}}