{"word":"Asclepiadean","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"アスクレピアデス詩型の、アスクレピアデス詩に関連する","english_definition":"Relating to Asclepiades or to the Asclepiadean verse.","examples":[{"sentence":"The Asclepiadean meter is named after the Greek poet Asclepiades of Samos.","translation":"アスクレピアデス詩型は、ギリシャの詩人サモスのアスクレピアデスにちなんで名付けられました。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"アスクレピアデス詩型","english_definition":"A verse in the Asclepiadean meter.","examples":[{"sentence":"He wrote an Asclepiadean in honor of the king.","translation":"彼は王を称えるアスクレピアデス詩型で詩を書いた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin Asclepiadeus, from Ancient Greek Ἀσκληπιάδειος (Asklēpiádeios), from Ἀσκληπιάδης (Asklēpiádēs, “Asclepiades”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæsklɪpiˈdiːən/","syllables":"As-cle-pi-de-an"},"inflection":{},"usage_notes":{"explanation":"The term 'Asclepiadean' primarily refers to a specific type of verse meter used in ancient Greek and Latin poetry. It is named after the Greek poet Asclepiades of Samos, who is credited with its development or popularization.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["Asclepiades"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'Asclepiadean' is highly specialized and primarily used in the context of classical literature and poetry. It refers to a specific metrical pattern in ancient Greek and Latin verse, named after the poet Asclepiades of Samos. Due to its niche usage, it is unlikely to be encountered outside academic or specialized literary contexts."},"example_sentences":[{"sentence":"The poem was composed in Asclepiadean meter.","translation":"その詩はアスクレピアデス詩型で書かれた。","type":"adjective","meaning_category":"アスクレピアデス詩型"},{"sentence":"The use of the Asclepiadean gives the verse a distinctive rhythm.","translation":"アスクレピアデス詩型の使用は、その詩に独特のリズムを与えます。","type":"noun","meaning_category":"アスクレピアデス詩型"}]}