{"word":"moonling","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A person who is dreamy, eccentric, or otherworldly.","english_definition":"(rare) A person who is dreamy, eccentric, or otherworldly.","examples":[{"sentence":"She was often called a moonling because of her tendency to daydream and her unusual artistic style.","translation":"彼女は空想癖があり、独特な芸術スタイルを持っていたため、よくムーンリングと呼ばれていた。"},{"sentence":"The author described his main character as a moonling, lost in his own world of imagination.","translation":"その作家は、主人公を想像の世界に迷い込んだムーンリングとして描写した。"}],"collocations":["dreamy moonling","eccentric moonling","artistic moonling"],"synonyms":["dreamer","eccentric","visionary","space cadet"],"antonyms":["realist","pragmatist","conventionalist"]}],"etymology":{"value":"Likely a blend of 'moon' (referring to the moon's association with dreams, fantasy, and madness) and '-ling' (a suffix often used to denote a person or thing associated with something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmuːnlɪŋ/","syllables":"moon-ling"},"inflection":{"noun_plural":"moonlings"},"usage_notes":{"explanation":"The term 'moonling' is relatively rare and not widely recognized. It carries a slightly whimsical or fantastical connotation, suggesting someone who is out of touch with reality or has a strong connection to the realm of imagination. It can sometimes be used affectionately, but also carries a hint of otherness or strangeness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a moonling because he is very happy.","correct":"✓ He is a moonling because he is lost in his imagination.","note":"'Moonling' is not directly related to happiness. It describes someone who is dreamy, eccentric, or otherworldly."}],"priority":"★☆☆"},"related_words":{"derivatives":["moonstruck (adjective: affected by the moon; romantically or sentimentally inspired)","moonshine (noun: illegally distilled liquor; nonsense)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Moonling' is a rare and somewhat poetic term for a person who is dreamy, eccentric, or otherworldly. It's not commonly used in everyday conversation, but might appear in literature or creative writing. Understanding the word requires familiarity with the symbolic associations of the moon (dreams, imagination, madness) and the suffix '-ling' (small or belonging to)."},"example_sentences":[{"sentence":"The poet was considered a moonling by his peers, often lost in thought and oblivious to the world around him.","translation":"その詩人は、同業者からムーンリングと見なされていた。しばしば考えにふけり、周りの世界に無頓着だった。","type":"noun","meaning_category":"Dreamy/Eccentric Person"},{"sentence":"Her paintings were filled with fantastical creatures and dreamlike landscapes, leading many to describe her as a moonling.","translation":"彼女の絵は、空想的な生き物と夢のような風景で満たされており、多くの人が彼女をムーンリングと表現した。","type":"noun","meaning_category":"Dreamy/Eccentric Person"}]}