{"word":"institorial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"設立の、創立の、制度の","english_definition":"Relating to the establishment or founding of something; pertaining to an institution or its organization.","examples":[{"sentence":"The institorial documents outlined the goals of the new organization.","translation":"設立に関する文書は、新しい組織の目標を概説した。"},{"sentence":"Institorial reforms were necessary to modernize the system.","translation":"制度改革は、システムを近代化するために必要だった。"}],"collocations":["institorial documents","institorial reforms","institorial framework"],"synonyms":["foundational","organizational","structural","systemic"],"antonyms":["ad hoc","informal","unstructured"]}],"etymology":{"value":"Derived from the Latin word \"instituere,\" meaning \"to establish, found, or set up.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnstɪˈtɔːriəl/","syllables":"in-sti-to-ri-al"},"inflection":{"notes":"Adjective, no specific inflections beyond comparative/superlative forms (more institorial, most institorial), which are rarely used."},"usage_notes":{"explanation":"The term \"institorial\" is relatively uncommon and is primarily used in formal or academic contexts. It emphasizes the act of establishing or organizing something according to a set of rules or principles. It is often used to describe documents, reforms, or frameworks related to the founding or structuring of institutions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The institorial person was very helpful.","correct":"✓ The institutional representative was very helpful.","note":"Use \"institutional\" to describe a person representing an institution, not \"institorial.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["institute (noun/verb)","institution (noun)","institutional (adjective)","institutionally (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"institorial\" is a formal term related to the establishment or organization of institutions. It's not commonly used in everyday language, but you might encounter it in academic papers, legal documents, or formal reports discussing the founding principles or structural reforms of an organization or system. Understanding its connection to words like \"institution\" and \"institute\" can help clarify its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The institorial framework provided a clear structure for the new department.","translation":"設立の枠組みは、新しい部門に明確な構造を提供した。","type":"adjective","meaning_category":"設立の"},{"sentence":"The institorial act defined the powers of the newly formed council.","translation":"設立法は、新しく設立された評議会の権限を定義した。","type":"adjective","meaning_category":"創立の"},{"sentence":"Institorial changes were implemented to improve the efficiency of the organization.","translation":"組織の効率を改善するために、制度改革が実施された。","type":"adjective","meaning_category":"制度の"}]}