{"word":"Colectomies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"結腸切除術（複数形）","english_definition":"plural of colectomy: surgical removal of all or part of the colon","examples":[{"sentence":"Colectomies are performed to treat various colon diseases.","translation":"結腸切除術は、さまざまな結腸疾患を治療するために行われます。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Colectomy' is derived from the Greek words 'colon' (κόλον) meaning large intestine, and 'ektome' (ἐκτομή) meaning excision. The plural form 'colectomies' simply indicates multiple instances of this surgical procedure.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɒlɪˈktəmiz/","syllables":"co-lec-to-mies"},"inflection":{"noun_plural":"Colectomies"},"usage_notes":{"explanation":"'Colectomies' refers to multiple instances of the surgical procedure known as a colectomy. A colectomy involves the removal of all or part of the colon (large intestine). This procedure is typically performed to treat conditions such as colon cancer, inflammatory bowel disease (IBD), diverticulitis, or other severe colon-related issues. The plural form is used when discussing multiple surgeries or a general category of such procedures.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["colectomy","hemicolectomy","proctocolectomy"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Colectomies' is the plural form of 'colectomy,' a medical term referring to the surgical removal of all or part of the colon. This term is typically encountered in medical contexts or discussions related to gastrointestinal health. Understanding this term requires familiarity with medical terminology and surgical procedures. The plural form simply indicates multiple instances of this surgery.","priority":"★★★"},"example_sentences":[{"sentence":"The hospital performed several colectomies last year.","translation":"その病院では昨年、いくつかの結腸切除術が行われました。","type":"general","meaning_category":"surgical procedures"},{"sentence":"Colectomies can significantly improve the quality of life for patients with severe ulcerative colitis.","translation":"結腸切除術は、重度の潰瘍性大腸炎患者の生活の質を大幅に改善することができます。","type":"medical","meaning_category":"medical treatment"}]}