{"word":"resin-saturated","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"含浸された樹脂、樹脂が染み込んだ、樹脂が飽和した","english_definition":"Thoroughly permeated or impregnated with resin; saturated with resin.","examples":[{"sentence":"The resin-saturated fiberglass cloth is then molded and cured.","translation":"樹脂が染み込んだグラスファイバークロスは、その後成形され硬化される。"},{"sentence":"The core of the composite material was resin-saturated to improve its strength.","translation":"複合材料のコアは、強度を向上させるために樹脂が飽和状態にされた。"}],"collocations":["resin-saturated cloth","resin-saturated composite","resin-saturated material"],"synonyms":["resin-impregnated","resin-infused"],"antonyms":["resin-free","uncoated"],"notes":"Typically used in the context of composite materials, manufacturing, and chemical processes."}],"etymology":{"value":"Combination of 'resin' and 'saturated'. 'Resin' refers to a viscous substance of plant or synthetic origin that is capable of hardening. 'Saturated' means holding as much water or solution as can be absorbed.","priority":"low"},"pronunciation":{"ipa":"ˈrɛzɪn ˈsætʃəˌreɪtɪd","syllables":"res-in-sat-u-rat-ed"},"inflection":{"notes":"Adjectives do not inflect in English"},"usage_notes":{"explanation":"This term is primarily used in technical contexts, particularly when describing materials used in construction, manufacturing, or engineering. It indicates that a base material has been thoroughly infused with resin to enhance its properties, such as strength, durability, or resistance to environmental factors.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The material was resin saturate.","correct":"The material was resin-saturated.","note":"The correct form is 'resin-saturated', using the past participle as an adjective."}],"priority":"low"},"related_words":{"derivatives":["saturation","resin","unsaturated","saturated"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'resin-saturated' is technical and specific to fields involving composite materials, chemical processes, or manufacturing. It implies a high degree of impregnation, where the resin has fully permeated the base material. Understanding the term requires familiarity with both 'resin' and 'saturation' in a material science context."},"example_sentences":[{"sentence":"The resin-saturated carbon fiber provides exceptional strength and lightweight properties.","translation":"樹脂が染み込んだ炭素繊維は、優れた強度と軽量特性を提供する。","type":"general","meaning_category":"material properties"},{"sentence":"Inspect the laminate for any signs of incomplete resin saturation.","translation":"ラミネートに樹脂の飽和が不完全な兆候がないか検査する。","type":"technical","meaning_category":"quality control"},{"sentence":"Proper curing of the resin-saturated matrix is crucial for optimal performance.","translation":"樹脂が飽和したマトリックスの適切な硬化は、最適な性能のために重要である。","type":"technical","meaning_category":"manufacturing process"}]}