{"word":"tortiously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"不法行為によって、不法行為的に","english_definition":"In a manner that constitutes a tort; involving a tort.","examples":[{"sentence":"The defendant acted tortiously when he misrepresented the product's safety.","translation":"被告は製品の安全性を偽って表示した際に、不法行為を行った。"},{"sentence":"The company was found to have tortiously interfered with the contract between the two suppliers.","translation":"その会社は、2つのサプライヤー間の契約を不法に妨害したと判断された。"}],"collocations":["tortiously interfere","tortiously act","tortiously cause damage"],"synonyms":["wrongfully","illegally","unlawfully","negligently"],"antonyms":["lawfully","legally","rightfully"]}],"etymology":{"value":"Derived from the adjective 'tortious', which comes from the Old French 'tort', meaning 'wrong'. The suffix '-ly' is added to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɔːrʃəsli/","syllables":"tor-tious-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Tortiously' is an adverb used in legal contexts to describe actions that constitute a tort. A tort is a civil wrong that causes someone else to suffer loss or harm, resulting in legal liability for the person who commits the tortious act. The adverb emphasizes that the action was not merely wrong but specifically met the criteria to be considered a tort under the law.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He tortiously apologized for his mistake.","correct":"✓ He apologized for his tortious act.","note":"'Tortiously' describes the manner of the action, not the apology. The apology itself isn't tortious, but the original action was."},{"incorrect":"✗ The contract was tortiously signed.","correct":"✓ The contract was wrongfully signed.","note":"If the signing of the contract itself was improper or illegal, 'wrongfully' or 'illegally' might be more appropriate. 'Tortiously' implies that the signing caused harm that constitutes a tort."}],"priority":"★★☆"},"related_words":{"derivatives":["tort (noun): A civil wrong that causes someone else to suffer loss or harm.","tortious (adjective): Constituting a tort.","tortfeasor (noun): A person who commits a tort."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'tortiously' is a highly specialized term used in legal contexts. It describes actions that constitute a tort, which is a civil wrong that causes harm or loss. Understanding this word requires familiarity with legal terminology and concepts. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The company tortiously misrepresented the safety of its product, leading to numerous injuries.","translation":"その会社は製品の安全性を不法に偽って表示し、多数の負傷者を出した。","type":"general"},{"sentence":"The defendant tortiously interfered with the plaintiff's business relationships.","translation":"被告は原告の事業関係を不法に妨害した。","type":"legal"},{"sentence":"The journalist was accused of tortiously publishing false information about the celebrity.","translation":"そのジャーナリストは、有名人に関する虚偽の情報を不法に公開したとして告発された。","type":"media"}]}