{"word":"vocationally-focused","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"職業に焦点を当てた、職業訓練に特化した","english_definition":"Primarily concerned with providing skills and knowledge directly applicable to a specific job or career.","examples":[{"sentence":"The college offers several vocationally-focused courses in areas like healthcare and technology.","translation":"その大学では、医療やテクノロジーなどの分野で、職業に焦点を当てたコースをいくつか提供しています。"},{"sentence":"A vocationally-focused education can lead to quicker employment after graduation.","translation":"職業に焦点を当てた教育は、卒業後のより早い就職につながる可能性があります。"},{"sentence":"Unlike traditional academic programs, this is a vocationally-focused training program designed to equip students with practical skills.","translation":"従来の学術プログラムとは異なり、これは学生に実践的なスキルを身につけさせるように設計された、職業に焦点を当てたトレーニングプログラムです。"}],"collocations":["vocationally-focused training","vocationally-focused education","vocationally-focused course","vocationally-focused program"],"synonyms":["career-oriented","job-specific","skills-based","practical","applied"],"antonyms":["academic","theoretical","general","liberal arts"]},{"part_of_speech":"adjective","definition":"職業訓練を重視する、実務的な能力開発を目的とする","english_definition":"Emphasizing or prioritizing vocational training and the development of practical skills for employment.","examples":[{"sentence":"The government is investing in vocationally-focused initiatives to address the skills gap in the workforce.","translation":"政府は、労働力におけるスキルギャップに対処するために、職業訓練を重視したイニシアチブに投資しています。"},{"sentence":"The school's curriculum is increasingly vocationally-focused, reflecting the demands of local industries.","translation":"その学校のカリキュラムは、地元の産業の需要を反映して、ますます職業訓練を重視したものになっています。"},{"sentence":"There is a growing demand for vocationally-focused graduates who can immediately contribute to the workplace.","translation":"職場にすぐに貢献できる、職業訓練を重視した卒業生に対する需要が高まっています。"}],"collocations":["vocationally-focused initiatives","vocationally-focused curriculum","vocationally-focused graduates","vocationally-focused approach"],"synonyms":["practical skills-oriented","career-driven","employment-focused","work-related","industry-aligned"],"antonyms":["theoretical-based","academically-driven","abstract","conceptual"]}],"etymology":{"value":"Combination of 'vocationally' (relating to a vocation or occupation) and 'focused' (having one's attention or interest directed).","priority":"☆☆☆"},"pronunciation":{"ipa":"/voʊˈkeɪʃənəli ˈfoʊkəst/","syllables":"vo-ca-tion-al-ly fo-cused"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"'Vocationally-focused' describes something that is designed or oriented towards providing specific job skills and knowledge. It emphasizes practical training and preparation for a particular career rather than general academic knowledge. It's often used in the context of education, training programs, and career development.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ vocationally focuseded","correct":"✓ vocationally focused","note":"Avoid adding an extra 'ed' at the end."},{"incorrect":"✗ vocationally focus","correct":"✓ vocationally focused","note":"Use the past participle 'focused' as an adjective."}],"priority":"☆☆☆"},"related_words":{"derivatives":["vocation","vocational","vocationally","focus","focused"],"related_terms":["career-technical education (CTE)","workforce development","apprenticeship","on-the-job training"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Vocationally-focused' is a relatively specialized term used in the context of education and career training. It indicates a strong emphasis on practical skills and direct preparation for specific jobs or careers. Understanding this term requires familiarity with discussions about education policy, workforce development, and the alignment of education with industry needs."},"example_sentences":[{"sentence":"The new program is designed to be highly vocationally-focused, ensuring students gain the skills employers need.","translation":"新しいプログラムは、学生が雇用主が必要とするスキルを確実に習得できるように、高度に職業に焦点を当てて設計されています。","type":"general","meaning_category":"職業に焦点を当てた"},{"sentence":"We need more vocationally-focused training opportunities for young people who are not pursuing a traditional university education.","translation":"従来の大学教育を追求していない若者のために、より多くの職業訓練に焦点を当てた機会が必要です。","type":"general","meaning_category":"職業訓練を重視する"},{"sentence":"The vocationally-focused curriculum includes hands-on experience in local businesses.","translation":"職業に焦点を当てたカリキュラムには、地元の企業での実践的な経験が含まれています。","type":"general","meaning_category":"職業に焦点を当てた"}]}