{"word":"world-argued","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"世界中で議論された、世界的に議論の余地がある","english_definition":"Debated or disputed throughout the world; subject to global argument or controversy.","examples":[{"sentence":"The ethical implications of artificial intelligence are a world-argued topic.","translation":"人工知能の倫理的な影響は、世界中で議論されている話題です。"},{"sentence":"Climate change is a world-argued issue with significant global consequences.","translation":"気候変動は、世界的な影響を伴う、世界中で議論されている問題です。"}],"collocations":["world-argued topic","world-argued issue","world-argued debate"],"synonyms":["globally debated","internationally disputed","widely contested","universally argued","contentious worldwide"],"antonyms":["uncontested","undisputed","universally accepted","unquestioned"],"notes":"This term is relatively rare, but it effectively conveys the idea of a topic being debated on a global scale."}],"etymology":{"value":"Formed by combining 'world' (referring to the entire planet or its people) with 'argued' (meaning debated or disputed). The combination suggests that the argument or debate is occurring on a global scale.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːrld ˌɑːrɡjuːd/","syllables":"world-ar-gued"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms."},"usage_notes":{"explanation":"The adjective 'world-argued' is used to describe a topic or issue that is the subject of extensive debate or disagreement on a global scale. It implies that the issue is not just locally or nationally controversial, but that it generates discussion and disagreement across different countries and cultures. It is often used to emphasize the widespread nature and importance of the debate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The world-argued is about politics.","correct":"✓ The world-argued topic is about politics.","note":"'world-argued' is an adjective and needs to modify a noun."},{"incorrect":"✗ This is a world argue problem.","correct":"✓ This is a world-argued problem.","note":"The correct form is 'world-argued', not 'world argue'."}],"priority":"★★☆"},"related_words":{"derivatives":["argue (verb)","argument (noun)","arguable (adjective)","world (noun)","worldwide (adjective, adverb)"],"related_terms":["global debate","international controversy","worldwide discussion","global issue","contentious issue"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The term 'world-argued' is not commonly found in general text.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'World-argued' is an adjective used to describe a topic or issue that is debated or argued about extensively on a global scale. It suggests that the issue is not just locally or nationally controversial, but that it generates discussion and disagreement across different countries and cultures. It is a relatively sophisticated term, suitable for describing complex global issues. Understanding the meaning requires familiarity with the individual words 'world' and 'argued', and the ability to understand how they combine to create a more nuanced meaning."},"example_sentences":[{"sentence":"The effectiveness of international aid is a world-argued subject.","translation":"国際援助の有効性は、世界中で議論されているテーマです。","type":"adjective","meaning_category":"globally debated"},{"sentence":"Whether globalization benefits all countries equally is a world-argued question.","translation":"グローバリゼーションがすべての国に平等に利益をもたらすかどうかは、世界中で議論されている問題です。","type":"adjective","meaning_category":"internationally disputed"}]}