{"word":"higher-priced","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"より高価な、より高価格の","english_definition":"costing more money than other similar items; more expensive.","examples":[{"sentence":"This restaurant is known for its higher-priced menu.","translation":"このレストランは、より高価なメニューで知られています。"},{"sentence":"They offer both standard and higher-priced models of the car.","translation":"彼らはその車の標準モデルとより高価格のモデルの両方を提供しています。"},{"sentence":"The higher-priced items are usually of better quality.","translation":"より高価格の品物は通常、品質が良いです。"}],"collocations":["higher-priced items (より高価な品物)","higher-priced goods (より高価な商品)","higher-priced services (より高価なサービス)","higher-priced options (より高価な選択肢)","relatively higher-priced (比較的より高価な)"],"synonyms":["more expensive","premium-priced","upmarket","costlier"],"antonyms":["lower-priced","cheaper","budget-friendly","affordable"],"notes":"Often used in comparative contexts to distinguish between different price points of similar products or services."}],"etymology":{"value":"Combination of 'higher' (comparative of 'high') and 'priced' (having a price). Indicates a price that is greater than a standard or average price.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪər ˈpraɪst/","syllables":"high-er-priced"},"inflection":{"notes":"Adjective, does not inflect for gender or number."},"usage_notes":{"explanation":"'Higher-priced' is used to describe something that costs more than other similar things. It's often used in marketing and retail to differentiate products or services based on their price point. It implies a comparison, suggesting that there are also lower-priced alternatives available.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The higher price item.","correct":"✓ The higher-priced item.","note":"'Higher-priced' is a compound adjective and should be used before the noun it modifies."},{"incorrect":"✗ This is more higher-priced than that.","correct":"✓ This is higher-priced than that.","note":"Avoid using 'more' with 'higher-priced' as it is already a comparative form."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_adjectives":["high-priced","low-priced","mid-priced"],"related_nouns":["price","pricing"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Higher-priced' is a compound adjective that means 'more expensive than other similar things'. It is used to compare the cost of items and is commonly found in marketing and business contexts. Understanding this term helps in comprehending discussions about product differentiation and pricing strategies."},"example_sentences":[{"sentence":"The hotel offers both standard rooms and higher-priced suites with ocean views.","translation":"そのホテルは、標準的な部屋と、より高価なオーシャンビューのスイートの両方を提供しています。","type":"general"},{"sentence":"Consumers often assume that higher-priced brands offer superior quality.","translation":"消費者はしばしば、より高価格のブランドが優れた品質を提供すると考えています。","type":"general"},{"sentence":"The company decided to focus on selling higher-priced, premium products.","translation":"その会社は、より高価格のプレミアム製品の販売に注力することを決定しました。","type":"business"}]}