{"word":"love-maker","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"恋人、愛人","english_definition":"A person who is skilled at or enjoys making love; a lover.","examples":[{"sentence":"He was known as a great love-maker.","translation":"彼は素晴らしい愛人として知られていた。"},{"sentence":"She described him as a passionate love-maker.","translation":"彼女は彼を情熱的な恋人と表現した。"}],"collocations":["skilled love-maker","passionate love-maker","great love-maker"],"synonyms":["lover","paramour","beau","sweetheart"],"antonyms":["celibate","prude"]}],"etymology":{"value":"The term is a compound word formed by combining 'love' and 'maker'. It implies someone who 'makes' or creates love, suggesting skill and passion in the act of lovemaking.","priority":"★★☆"},"pronunciation":{"ipa":"ˈlʌvˌmeɪkər","syllables":"love-ma-ker"},"inflection":{"noun_plural":"love-makers"},"usage_notes":{"explanation":"The term 'love-maker' often carries connotations of skill, passion, and artistry in the act of lovemaking. It can be used in a positive or admiring way, but also sometimes in a humorous or slightly derogatory way, depending on the context. It is not a very common term in modern usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a love maker, so he is very kind.","correct":"✓ He is a good lover, so he is very kind.","note":"While 'love-maker' refers to skill in lovemaking, it doesn't directly imply general kindness. 'Lover' is a more appropriate term for describing a romantic partner."}],"priority":"★☆☆"},"related_words":{"derivatives":["lovemaking (noun: the act of sexual intercourse)"],"phrases":["make love (to have sexual intercourse)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Love-maker' is a relatively uncommon term that refers to someone who is skilled or passionate in lovemaking. It is often used to describe someone who is a good lover or who is particularly adept at the art of seduction and intimacy. The term can have both positive and slightly humorous or suggestive connotations, depending on the context. It is generally not used in formal settings.","priority":"★☆☆"},"example_sentences":[{"sentence":"She considered him a talented love-maker, always attentive to her needs.","translation":"彼女は彼を才能のある恋人だと考えており、常に彼女のニーズに気を配っていた。","type":"noun","meaning_category":"恋人"},{"sentence":"The novel described him as a legendary love-maker, captivating women with his charm and skill.","translation":"その小説は、彼を魅力と技術で女性を魅了する伝説的な愛人として描いていた。","type":"noun","meaning_category":"恋人"},{"sentence":"His reputation as a love-maker preceded him, making him highly sought after.","translation":"彼の恋人としての評判が先行し、彼は非常に人気があった。","type":"noun","meaning_category":"恋人"}]}