{"word":"Cheremissian","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(歴史的) チェレミス人（現マリ人）の、チェレミス語（現マリ語）の","english_definition":"(historical) Of or relating to the Cheremiss people (now known as the Mari), or their language (now known as Mari).","examples":[{"sentence":"The Cheremissian language belongs to the Finno-Ugric language family.","translation":"チェレミス語（現マリ語）は、フィン・ウゴル語族に属する。"},{"sentence":"Cheremissian folklore is rich in pagan traditions.","translation":"チェレミス人（現マリ人）の民俗は、異教の伝統が豊かである。"}],"collocations":["Cheremissian language","Cheremissian folklore","Cheremissian people"],"synonyms":["Mari","Mari language"],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史的) チェレミス語（現マリ語）","english_definition":"(historical) The Cheremiss language (now known as Mari).","examples":[{"sentence":"Cheremissian has two main dialects: Hill Mari and Meadow Mari.","translation":"チェレミス語（現マリ語）には、主な方言として山地マリ語と草原マリ語がある。"}],"collocations":["Hill Cheremissian","Meadow Cheremissian"],"synonyms":["Mari language"],"antonyms":[]}],"etymology":{"value":"Derived from 'Cheremiss', the former name for the Mari people, plus the suffix '-ian'. The name 'Cheremiss' is of uncertain origin, possibly from a Turkic language.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtʃɛrəˈmɪsiən/","syllables":"Che-re-mis-si-an"},"inflection":{"notes":"Adjective and noun forms exist. Noun is usually uncountable when referring to the language in general."},"usage_notes":{"explanation":"The term 'Cheremissian' is now considered outdated and replaced by 'Mari'. It's primarily used in historical contexts or when referring to older linguistic classifications. Using 'Mari' is generally preferred in contemporary usage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I speak Cheremiss.","correct":"✓ I speak Mari.","note":"'Mari' is the preferred term for the language today."},{"incorrect":"✗ The Cheremissians are a Russian tribe.","correct":"✓ The Mari are a Finno-Ugric people of Russia.","note":"The Mari are a Finno-Ugric people, not a Russian tribe. Also, use 'Mari' instead of 'Cheremissians'."}],"priority":"★★☆"},"related_words":{"derivatives":["Cheremiss (noun: the former name for the Mari people)","Mari (noun/adjective: the current name for the people and language)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily in historical or linguistic texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Cheremissian' is relatively rare and primarily encountered in historical or linguistic contexts. Understanding its connection to the modern term 'Mari' is key to interpreting its meaning. The word's etymology and historical usage are important for accurate comprehension.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Cheremissian** people, now known as the Mari, have a rich cultural heritage.","translation":"チェレミス人（現マリ人）は、豊かな文化遺産を持っている。","type":"adjective","meaning_category":"Relating to the Mari people"},{"sentence":"Old texts refer to the **Cheremissian** language, which is now called Mari.","translation":"古い文献ではチェレミス語（現マリ語）と呼ばれている。","type":"noun","meaning_category":"The Mari language"}]}