{"word":"leucophyllous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物が)白い葉を持つ","english_definition":"Having white or grayish-white foliage.","examples":[{"sentence":"The leucophyllous shrubs are well-adapted to arid environments.","translation":"白い葉を持つ低木は、乾燥した環境によく適応している。"}],"collocations":["leucophyllous shrub (白い葉を持つ低木)","leucophyllous vegetation (白い葉を持つ植生)"],"synonyms":["glaucous","hoary","white-leaved"],"antonyms":["chlorophyllous","green-leaved"]}],"etymology":{"value":"Derived from the Greek words 'leuco-' (λευκός) meaning 'white' and 'phyllon' (φύλλον) meaning 'leaf'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌljuːkəˈfɪləs/","syllables":"leu-co-phyl-lous"},"inflection":{"notes":"Comparative and superlative forms are typically formed using 'more leucophyllous' and 'most leucophyllous' respectively, as it is not a commonly inflected adjective."},"usage_notes":{"explanation":"The term 'leucophyllous' is primarily used in botany and ecology to describe plants with foliage that appears white or grayish-white due to the presence of waxes, hairs, or other surface features that reflect light. This adaptation is often found in plants that grow in arid or sunny environments, as the white foliage helps to reduce heat absorption and water loss.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The leucophyllous animal was spotted in the forest.","correct":"✓ The leucophyllous plant was spotted in the desert.","note":"'Leucophyllous' specifically describes plants, not animals. Animals with white coloration are described using terms like 'leucistic' or 'albino'."}],"priority":"★★☆"},"related_words":{"derivatives":["leucophyllum (genus of plants with white foliage)","leucophylly (the characteristic of having white foliage)"],"related_terms":["glaucous (having a powdery or waxy coating giving a greyish-blue or green appearance)","xerophyte (a plant adapted to dry conditions)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Leucophyllous' is a technical term used in botany to describe plants with white or grayish-white leaves. This characteristic is often an adaptation to dry or sunny environments, helping the plant to reflect sunlight and conserve water. The word is formed from Greek roots, 'leuco-' meaning 'white' and 'phyllon' meaning 'leaf'. While not commonly used in everyday language, understanding this term can be helpful in the context of plant biology and ecology."},"example_sentences":[{"sentence":"Many desert plants are leucophyllous to reflect sunlight and reduce water loss.","translation":"多くの砂漠植物は、日光を反射して水分損失を減らすために白い葉を持っている。","type":"general","meaning_category":"botany"},{"sentence":"The silvery appearance of the leucophyllous foliage creates a striking contrast in the garden.","translation":"白い葉の銀色の外観は、庭で印象的なコントラストを生み出す。","type":"descriptive","meaning_category":"horticulture"}]}