{"word":"phyllomorph","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A shape or form resembling a leaf.","english_definition":"A shape or form that resembles a leaf, often used in decorative arts or in describing certain biological structures.","examples":[{"sentence":"The decorative panel featured a repeating phyllomorph pattern.","translation":"その装飾パネルは、繰り返しの葉状模様が特徴でした。"},{"sentence":"The fossil showed a clear phyllomorph of an ancient plant.","translation":"その化石は、古代植物の明確な葉状形態を示していました。"}],"collocations":["phyllomorph pattern","phyllomorph design","fossil phyllomorph"],"synonyms":["leaf-like shape","foliate form","leaf motif"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'phyllo' (leaf) and 'morph' (form).","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɪləˌmɔrf/","syllables":"phyl-lo-morph"},"inflection":{"noun_plural":"phyllomorphs"},"usage_notes":{"explanation":"The term 'phyllomorph' is relatively uncommon but is used in botany, paleontology, and decorative arts to describe something that has the shape or appearance of a leaf. It is often used to describe patterns or designs that are inspired by leaves.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The phyllomorph was green because it was a leaf.","correct":"✓ The phyllomorph was green because it resembled a leaf.","note":"'Phyllomorph' describes a shape, not necessarily an actual leaf."}],"priority":"★★☆"},"related_words":{"derivatives":["phyllomorphic (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Phyllomorph' is a technical term used to describe something that has the shape or form of a leaf. It is most commonly encountered in specialized fields such as botany, paleontology, and decorative arts. Understanding this term requires a strong vocabulary and familiarity with scientific terminology."},"example_sentences":[{"sentence":"The architectural detail incorporated a delicate phyllomorph.","translation":"その建築のディテールには、繊細な葉状形態が組み込まれていました。","type":"noun","meaning_category":"leaf-like shape"},{"sentence":"Researchers analyzed the phyllomorph of the fossilized fern.","translation":"研究者たちは、化石化したシダの葉状形態を分析しました。","type":"noun","meaning_category":"leaf-like shape"}]}