{"word":"tragicomedies","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"喜悲劇（きひげき）：悲劇的要素と喜劇的要素を併せ持つ演劇作品、またはそのような性質を持つ文学作品。深刻な状況の中にユーモアやハッピーエンドが含まれることが多い。","english_definition":"Plays or literary works that combine elements of both tragedy and comedy. They often feature serious situations with humor or happy endings.","examples":[{"sentence":"Shakespeare's later plays are often considered tragicomedies because they blend serious themes with comedic elements.","translation":"シェイクスピアの後期の戯曲は、深刻なテーマと喜劇的な要素を組み合わせているため、しばしば喜悲劇と見なされる。"},{"sentence":"The film is a tragicomedy about a family dealing with loss and finding humor in unexpected places.","translation":"その映画は、喪失に対処し、予期せぬ場所にユーモアを見出す家族を描いた喜悲劇である。"},{"sentence":"Many modern plays explore the complexities of life through the lens of tragicomedy.","translation":"現代劇の多くは、喜悲劇のレンズを通して人生の複雑さを探求している。"}],"collocations":["blend of tragedy and comedy (悲劇と喜劇の融合)","elements of tragicomedy (喜悲劇の要素)","modern tragicomedy (現代喜悲劇)","Shakespearean tragicomedy (シェイクスピアの喜悲劇)"],"synonyms":["dramedy (ドラマとコメディの混合)","dark comedy (ブラックコメディ)","bittersweet drama (ほろ苦いドラマ)"],"antonyms":["tragedy (悲劇)","comedy (喜劇)"]}],"etymology":{"value":"「tragedy（悲劇）」と「comedy（喜劇）」を組み合わせた造語。演劇のジャンルとして、17世紀頃から使われるようになった。","priority":"★★★"},"pronunciation":{"ipa":"/ˌtrædʒɪˈkɒmədiːz/","syllables":"tra-gi-com-e-dies"},"inflection":{"noun_plural":"tragicomedies","noun_singular":"tragicomedy"},"usage_notes":{"explanation":"喜悲劇は、悲劇と喜劇の要素を混ぜ合わせた作品を指します。深刻なテーマを扱いながらも、ユーモアや明るい結末を取り入れることで、人生の複雑さや矛盾を表現します。シェイクスピアの『尺には尺を』や『冬物語』などが代表的な例として挙げられます。現代では、映画やテレビドラマなど、様々なメディアで喜悲劇的な作品が見られます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The play was a tragediecomedy.","correct":"✓ The play was a tragicomedy.","note":"スペルミスに注意。「tragediecomedy」ではなく「tragicomedy」が正しい。"},{"incorrect":"✗ It's a tragicomedy so it must be funny.","correct":"✓ It's a tragicomedy so it has both funny and sad moments.","note":"喜悲劇は必ずしも「面白い」だけではない。悲しい要素と面白い要素が混ざり合っている。"}],"priority":"★★☆"},"related_words":{"derivatives":["tragicomic (形容詞: 喜悲劇的な)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**tragicomedies**」は、悲劇と喜劇の要素を組み合わせた演劇や文学作品を指す言葉です。深刻な状況やテーマを扱いながらも、ユーモアや明るい結末を取り入れることで、人生の複雑さや矛盾を表現します。シェイクスピアの作品など、古典的な作品から現代の映画やドラマまで、幅広い作品がこのジャンルに含まれます。この単語を理解することで、作品の多様な表現や深いテーマをより深く理解することができます。"},"example_sentences":[{"sentence":"The play is a tragicomedy that explores the themes of love, loss, and redemption.","translation":"その劇は、愛、喪失、そして救済というテーマを探求する喜悲劇である。","type":"general"},{"sentence":"Many of Chekhov's plays are considered tragicomedies due to their blend of humor and pathos.","translation":"チェーホフの戯曲の多くは、ユーモアと哀愁が混ざり合っているため、喜悲劇と見なされている。","type":"literature"},{"sentence":"The film's tragicomic tone allows it to address serious issues with a light touch.","translation":"その映画の喜悲劇的なトーンは、深刻な問題を軽いタッチで扱うことを可能にしている。","type":"film"}]}