{"word":"Jacobitic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ジャコバイト党の、ジャコバイト主義の","english_definition":"Relating to the Jacobites or Jacobitism.","examples":[{"sentence":"The Jacobitic rebellions aimed to restore the Stuart monarchy.","translation":"ジャコバイトの反乱は、スチュアート朝の王政復古を目指した。"},{"sentence":"Jacobitic songs often lamented the defeat at Culloden.","translation":"ジャコバイトの歌は、しばしばカロデンの戦いでの敗北を嘆いた。"}],"collocations":["Jacobitic rebellion","Jacobitic song","Jacobitic sympathies"],"synonyms":["Stuart","Royalist"],"antonyms":["Hanoverian","Whig"]},{"part_of_speech":"noun","definition":"ジャコバイト党員、ジャコバイト主義者","english_definition":"A supporter of the Jacobites or Jacobitism.","examples":[{"sentence":"He was a staunch Jacobitic, loyal to the Stuart cause.","translation":"彼はスチュアート家の主張に忠実な、筋金入りのジャコバイト党員だった。"}],"collocations":["staunch Jacobitic","Jacobitic sympathizer"],"synonyms":["Stuart supporter","Royalist"],"antonyms":["Hanoverian","Whig"]}],"etymology":{"value":"From 'Jacobite', derived from 'Jacobus', the Latin form of James, referring to King James II of England (James VII of Scotland) and his descendants. The suffix '-ic' indicates 'relating to'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒækəˈbɪtɪk/","syllables":"Ja-co-bi-tic"},"inflection":{"notes":"The word can function as both an adjective and a noun. The plural form of the noun is 'Jacobitics'."},"usage_notes":{"explanation":"'Jacobitic' refers to anything associated with the Jacobites, a political movement that supported the restoration of the Stuart dynasty to the thrones of England, Scotland, and Ireland. It is often used in historical contexts when discussing the Jacobite rebellions and related cultural or political aspects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Jacobitic supporter of the current government.","correct":"✓ He was a Jacobite supporter of the Stuart cause.","note":"Jacobites opposed the government that replaced the Stuarts, so they wouldn't support the current government."}],"priority":"★★☆"},"related_words":{"derivatives":["Jacobite","Jacobitism"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'Jacobitic' is specific to historical contexts, particularly relating to the Jacobite movement in Britain and Ireland during the 17th and 18th centuries. It is used to describe people, events, or cultural artifacts associated with the supporters of King James II and his descendants. Understanding this term requires knowledge of British history and the Stuart dynasty."},"example_sentences":[{"sentence":"The museum displayed several Jacobitic artifacts from the 18th century.","translation":"その博物館は18世紀のジャコバイト関連の工芸品をいくつか展示していた。","type":"adjective","meaning_category":"Relating to Jacobites"},{"sentence":"Many Scots remained Jacobitic in their sympathies long after the rebellions ended.","translation":"反乱が終わってからも、多くのスコットランド人はジャコバイトの心情を持ち続けた。","type":"adjective","meaning_category":"Relating to Jacobites"},{"sentence":"The local historian specialized in the study of Jacobitic families in the region.","translation":"地元の歴史家は、その地域のジャコバイト家系の研究を専門としていた。","type":"adjective","meaning_category":"Relating to Jacobites"}]}