{"word":"preenumeration","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"事前の列挙、事前列挙","english_definition":"The act of enumerating or listing items in advance.","examples":[{"sentence":"The preenumeration of potential risks allowed the team to prepare mitigation strategies.","translation":"潜在的なリスクの事前列挙により、チームは軽減戦略を準備することができました。"},{"sentence":"A preenumeration of available resources is crucial for effective project planning.","translation":"利用可能なリソースの事前列挙は、効果的なプロジェクト計画に不可欠です。"}],"collocations":["risk preenumeration","resource preenumeration","item preenumeration"],"synonyms":["prelisting","advance enumeration","prior listing"],"antonyms":["postenumeration"]}],"etymology":{"value":"\"Pre-\" (before) + \"enumeration\" (the act of counting or listing).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːɪˌnjuːməˈreɪʃən/","syllables":"pre-i-nu-me-ra-tion"},"inflection":{"noun_plural":"preenumerations"},"usage_notes":{"explanation":"\"Preenumeration\" refers to the process of creating a list or count of items before a specific event or action takes place. It is often used in the context of planning, risk management, or resource allocation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The preenumeration was done after the project started.","correct":"✓ The preenumeration was done before the project started.","note":"Preenumeration must occur before the event or action it is preparing for."}],"priority":"★★☆"},"related_words":{"derivatives":["enumerate","enumeration","preenumerate"],"related_terms":["listing","inventory","cataloging"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Preenumeration\" is a technical term referring to the act of listing or counting items in advance of a specific event or action. It is often used in formal or professional contexts where planning and preparation are crucial. The word is formed by adding the prefix \"pre-\" to \"enumeration,\" indicating that the enumeration occurs beforehand."},"example_sentences":[{"sentence":"The project manager insisted on a thorough preenumeration of all tasks involved.","translation":"プロジェクトマネージャーは、関連するすべてのタスクの徹底的な事前列挙を主張しました。","type":"noun","meaning_category":"事前列挙"},{"sentence":"A detailed preenumeration of potential customers helped the company tailor its marketing strategy.","translation":"潜在的な顧客の詳細な事前列挙は、会社がマーケティング戦略を調整するのに役立ちました。","type":"noun","meaning_category":"事前列挙"}]}