{"word":"decathlons","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"十種競技（デカスロン）","english_definition":"A track and field contest comprising ten different events and contested by men.","examples":[{"sentence":"He competed in decathlons at the national level.","translation":"彼は国内レベルの十種競技に出場した。"},{"sentence":"The decathlons is a true test of athletic ability.","translation":"十種競技は運動能力の真の試練である。"}],"collocations":["compete in decathlons","win the decathlons"],"synonyms":["pentathlon","heptathlon"],"antonyms":[]}],"etymology":{"value":"The word \"decathlon\" comes from the Greek words δέκα (déka, meaning \"ten\") and ἆθλος (áthlos, meaning \"contest\" or \"feat\").","priority":"★★★"},"pronunciation":{"ipa":"/dɪˈkæθlənz/","syllables":"de-cath-lons"},"inflection":{"noun_plural":"decathlons"},"usage_notes":{"explanation":"\"Decathlons\" is the plural form of \"decathlon,\" which refers to a specific athletic event. It is used when referring to multiple instances of the event or multiple competitions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He won the decathlon last year. Now he is preparing for decathlons.","correct":"✓ He won the decathlon last year. Now he is preparing for more decathlon competitions.","note":"Using 'decathlons' implies multiple separate events, not just training for the same event again."}],"priority":"★★☆"},"related_words":{"derivatives":["decathlete"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'decathlons' is the plural form of 'decathlon,' which is a specialized term in athletics. It refers to multiple instances of the ten-event track and field competition. Understanding requires familiarity with sports terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The Olympic Games always feature exciting decathlons.","translation":"オリンピック競技大会では常にエキサイティングな十種競技が行われる。","type":"general","meaning_category":"general"},{"sentence":"Several athletes are training rigorously for the upcoming decathlons season.","translation":"数人の選手が、近づく十種競技シーズンに向けて厳しくトレーニングしている。","type":"sports context","meaning_category":"sports"}]}