{"word":"Telokinesis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"テレキネシス、念力","english_definition":"The supposed ability to move or deform objects at a distance by thought or other nonphysical influence.","examples":[{"sentence":"She claimed to have telokinesis and could bend spoons with her mind.","translation":"彼女はテレキネシスの能力があると主張し、念力でスプーンを曲げることができた。"},{"sentence":"Telokinesis is often depicted in science fiction movies.","translation":"テレキネシスはSF映画でよく描かれる。"}],"collocations":["demonstrate telokinesis","possess telokinesis","use telokinesis","real telokinesis","mental telokinesis"],"synonyms":["telekinesis","psychokinesis","mind over matter"],"antonyms":["physical force","mechanical force"]}],"etymology":{"value":"The word \"telokinesis\" is a blend of \"tele-\" (from Greek τῆλε (têle) meaning 'far off, at a distance') and \"kinesis\" (from Greek κίνησις (kínēsis) meaning 'movement, motion').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɛləkɪˈniːsɪs/","syllables":"te-lo-ki-ne-sis"},"inflection":{"noun_plural":"telokineses (rare)"},"usage_notes":{"explanation":"\"Telokinesis\" is often used interchangeably with \"telekinesis\" and \"psychokinesis\", although some people may make distinctions based on the specific type of mental influence involved. It is generally considered a pseudoscience.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used telokenesis to open the door.","correct":"✓ He used telokinesis to open the door.","note":"Correct spelling is important as it is a less common word."}],"priority":"★☆☆"},"related_words":{"derivatives":["telekinesis","psychokinesis","telekinetic","psychokinetic"],"phrases":["mind over matter"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not in common language learning frameworks)","frequency_google_ngram":"Very low frequency - Primarily used in discussions of parapsychology and science fiction.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Telokinesis\" is a specialized term primarily used in discussions of parapsychology and science fiction. It refers to the supposed ability to move objects with the mind. Due to its limited usage, it is not typically encountered in general language learning contexts. Understanding its etymology can aid in remembering its meaning."},"example_sentences":[{"sentence":"The superhero's signature move was telokinesis, allowing him to control objects from afar.","translation":"そのスーパーヒーローの必殺技はテレキネシスで、遠くから物体を操ることができた。","type":"noun","meaning_category":"ability"},{"sentence":"Scientists have not found any credible evidence to support the existence of telokinesis.","translation":"科学者たちはテレキネシスの存在を裏付ける信頼できる証拠を何も見つけていない。","type":"noun","meaning_category":"pseudoscience"}]}