{"word":"red-plowed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(農業)赤土を耕した、赤土が耕された","english_definition":"(agriculture) Having red soil that has been plowed.","examples":[{"sentence":"The red-plowed fields stretched out before them.","translation":"彼らの目の前には、赤土を耕された畑が広がっていた。"},{"sentence":"The rich, red-plowed earth promised a bountiful harvest.","translation":"肥沃な赤土を耕された大地は、豊かな収穫を約束した。"}],"collocations":["red-plowed field","red-plowed earth","freshly red-plowed"],"synonyms":["tilled red soil","cultivated red earth"],"antonyms":["unplowed","uncultivated"]}],"etymology":{"value":"The term \"red-plowed\" is a compound adjective formed by combining \"red\" (referring to the color of the soil) and \"plowed\" (indicating that the soil has been turned over by a plow).","priority":"★★★"},"pronunciation":{"ipa":"/ˌrɛd ˈplaʊd/","syllables":"red-plowed"},"inflection":{"notes":"This is an adjective, so it doesn't inflect for tense or number. It can be used in comparative and superlative forms (more red-plowed, most red-plowed), but this is uncommon."},"usage_notes":{"explanation":"\"Red-plowed\" is a descriptive adjective, typically used to evoke a visual image of farmland with reddish soil that has been prepared for planting. It suggests fertility and agricultural activity. The term is relatively uncommon in everyday speech but may be found in literature or agricultural contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The red plowed field.","correct":"✓ The red-plowed field.","note":"When used as a compound adjective before a noun, it is hyphenated. Without the hyphen, 'red' could be interpreted as simply modifying 'plowed field' rather than forming a single descriptive adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["red soil","plowed field","tilled land","cultivated land"],"related_terms":["agriculture","farming","soil","plow","harvest"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"red-plowed\" is a relatively uncommon compound adjective used to describe land that has been plowed and has a reddish color due to the soil composition. It is most likely to be encountered in descriptive writing about agriculture or rural landscapes. Understanding the term requires knowledge of both \"red soil\" and the process of plowing. Due to its specificity, it is not considered a basic vocabulary word.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist painted a landscape of rolling hills and red-plowed fields.","translation":"その画家は、なだらかな丘と赤土を耕された畑の風景を描いた。","type":"descriptive","meaning_category":"landscape description"},{"sentence":"After the rain, the red-plowed earth looked even more vibrant.","translation":"雨上がり、赤土を耕された大地はさらに鮮やかに見えた。","type":"descriptive","meaning_category":"visual description"},{"sentence":"The farmer surveyed his red-plowed land, anticipating a good yield.","translation":"農夫は、良い収穫を期待して、赤土を耕された自分の土地を眺めた。","type":"contextual","meaning_category":"agricultural context"}]}