{"word":"postapostolic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"使徒時代の後の、使徒以後の","english_definition":"Relating to the period after the time of the original Apostles of Jesus Christ.","examples":[{"sentence":"The postapostolic church faced new challenges.","translation":"使徒以後の教会は新たな課題に直面した。"},{"sentence":"Postapostolic writings provide insights into early Christian beliefs.","translation":"使徒以後の著作は初期キリスト教の信仰に対する洞察を提供する。"}],"collocations":["postapostolic age","postapostolic period","postapostolic writings","postapostolic fathers"],"synonyms":["after the apostles","sub-apostolic"],"antonyms":["apostolic","pre-apostolic"]}],"etymology":{"value":"'Post-' (after) + 'apostolic' (relating to the Apostles).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpoʊstəˌpɑːstəˈlɪk/","syllables":"post-a-pos-tol-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'postapostolic' is primarily used in theological and historical contexts to describe the time and developments within Christianity after the death of the original Apostles. It is used to differentiate between the time of direct apostolic leadership and the subsequent era of the early Church Fathers and evolving doctrines.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The post-apostolic era was a time of no change.","correct":"✓ The postapostolic era was a time of significant doctrinal development.","note":"The postapostolic era was characterized by the development and consolidation of Christian doctrine, not a lack of change."}],"priority":"★★☆"},"related_words":{"derivatives":["postapostolicity (noun)"],"related_terms":["Apostolic Fathers","Early Church Fathers","Patristic Era","Apostles","Apostolic Succession"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized term used in theological and historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'postapostolic' is a specialized term used in theological and historical discussions. It refers to the period following the death of the original Apostles of Jesus Christ. Understanding this term requires familiarity with Christian history and theology. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The writings of the Apostolic Fathers provide valuable insights into the beliefs and practices of the postapostolic church.","translation":"使徒教父たちの著作は、使徒時代の後の教会の信仰と実践に関する貴重な洞察を提供します。","type":"adjective","meaning_category":"使徒時代の後の"},{"sentence":"The development of early Christian doctrine occurred largely during the postapostolic period.","translation":"初期キリスト教の教義の発展は、主に使徒時代の後の時代に起こりました。","type":"adjective","meaning_category":"使徒以後の"}]}