{"word":"subjectability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality or state of being subjectable; the degree to which something is capable of being subjected to something else.","english_definition":"The quality or state of being subjectable; the degree to which something is capable of being subjected to something else.","examples":[{"sentence":"The subjectability of the material to high temperatures was tested.","translation":"その材料が高温に耐えうるかどうかの試験が行われた。"},{"sentence":"The subjectability of the population to propaganda was a concern for the government.","translation":"国民がプロパガンダに影響されやすいことが政府の懸念事項であった。"}],"collocations":[],"synonyms":["vulnerability","susceptibility","openness","receptiveness"],"antonyms":["insusceptibility","immunity","resistance"]}],"etymology":{"value":"Formed from 'subjectable' (capable of being subjected) + '-ity' (a suffix denoting a state or quality).","priority":"☆☆☆"},"pronunciation":{"ipa":"/sʌbˌdʒɛktəˈbɪləti/","syllables":"sub-ject-a-bil-i-ty"},"inflection":{"noun_plural":"subjectabilities"},"usage_notes":{"explanation":"'Subjectability' is a relatively uncommon noun that describes the extent to which something can be subjected to an external influence, force, or condition. It is often used in scientific or technical contexts to describe the properties of materials or systems. It can also be used in social or political contexts to describe the vulnerability of populations to manipulation or control.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["subjectable","subject","subjection"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Subjectability' is a complex and rare word. It refers to the degree to which something can be influenced or controlled by an external force or condition. Understanding this word requires a strong grasp of abstract concepts and is typically encountered in specialized academic or technical contexts."},"example_sentences":[{"sentence":"The experiment measured the subjectability of the compound to oxidation.","translation":"その実験では、化合物の酸化されやすさを測定した。","type":"noun","meaning_category":"Susceptibility to a process"},{"sentence":"The high subjectability of the community to misinformation made them vulnerable.","translation":"地域社会が誤った情報に影響されやすいため、脆弱な状態になった。","type":"noun","meaning_category":"Vulnerability to influence"}]}