{"word":"Subconjunto","priority":"☆☆☆","meanings":[{"part_of_speech":"名詞","definition":"部分集合","english_definition":"A set whose elements are all contained in another set.","examples":[{"sentence":"El conjunto A es un subconjunto del conjunto B si todos los elementos de A también están en B.","translation":"集合Aのすべての要素がBにも含まれている場合、集合Aは集合Bの部分集合です。"}],"collocations":["Subconjunto propio (真部分集合)","Subconjunto impropio (仮部分集合)"],"synonyms":["Parte","Sección"],"antonyms":["Superconjunto (上位集合)"],"related_terms":["Conjunto (集合)","Elemento (要素)"]}],"etymology":{"value":"El término proviene de la combinación de 'sub' (debajo, inferior) y 'conjunto' (grupo, colección).","priority":"★★★"},"pronunciation":{"ipa":"/suβ.konˈxun.to/","syllables":"Sub-con-jun-to"},"inflection":{"noun_gender":"masculine","noun_plural":"Subconjuntos"},"usage_notes":{"explanation":"Un subconjunto es una parte de un conjunto mayor. Si todos los elementos de un conjunto A están también en un conjunto B, entonces A es un subconjunto de B.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Un subconjunto debe contener todos los elementos del conjunto original.","correct":"Un subconjunto puede contener algunos o todos los elementos del conjunto original.","note":"Un subconjunto no necesariamente contiene todos los elementos del conjunto original, puede contener solo algunos o ninguno."}],"priority":"★★☆"},"level_frequency":{"level":"大学レベル","frequency_google_ngram":"Baja","priority":"★☆☆"},"readability_explanation":{"level":"Difícil","text":"El término 'subconjunto' se utiliza en matemáticas, específicamente en la teoría de conjuntos. Se refiere a un conjunto que está contenido dentro de otro conjunto más grande. Para entenderlo, es necesario comprender la definición de 'conjunto' y 'elemento'."},"example_sentences":[{"sentence":"El conjunto de números pares menores que 10 es un subconjunto del conjunto de números enteros menores que 10.","translation":"10未満の偶数の集合は、10未満の整数の集合の部分集合です。","type":"general","meaning_category":"Definición"},{"sentence":"Para encontrar todos los subconjuntos de un conjunto dado, se debe considerar el conjunto vacío y todas las posibles combinaciones de elementos.","translation":"与えられた集合のすべての部分集合を見つけるには、空集合と要素の可能なすべての組み合わせを考慮する必要があります。","type":"mathematical","meaning_category":"Aplicación"}]}