{"word":"subsidiarity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"補完性原理、補充性の原則（より上位の権限を持つ機関は、下位の機関が十分に行える場合には、その任務を代行すべきではないという原則）","english_definition":"the principle that a central authority should have a subsidiary function, performing only those tasks which cannot be performed effectively at a more immediate or local level.","examples":[{"sentence":"The principle of subsidiarity ensures that decisions are taken as closely as possible to the citizen.","translation":"補完性原理は、決定が市民にできる限り近いところで行われることを保証する。"},{"sentence":"Subsidiarity is a key element in the governance of the European Union.","translation":"補完性原理は、欧州連合の統治における重要な要素である。"}],"collocations":["principle of subsidiarity","apply subsidiarity","respect subsidiarity","exercise subsidiarity"],"synonyms":["decentralization","devolution","localism"],"antonyms":["centralization","federalism"]},{"part_of_speech":"adjective","definition":"補助的な、補完的な","english_definition":"serving to assist or supplement; subsidiary.","examples":[{"sentence":"The subsidiar functions were carried out by the local branch.","translation":"補助的な機能は、地方支店によって実行された。"}],"collocations":["subsidiar function","subsidiar role"],"synonyms":["auxiliary","supplementary","secondary"],"antonyms":["primary","principal"]}],"etymology":{"value":"Late 19th century; earliest use found in Henry Sidgwick (1838–1900), philosopher. From post-classical Latin subsidiarius serving to assist, auxiliary, from Latin subsidium assistance, aid, support from sub- + sedēre to sit.","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˌsɪdiˈærɪti/","syllables":"sub-sid-i-ar-i-ty"},"inflection":{"noun_plural":"subsidiarities"},"usage_notes":{"explanation":"The principle of subsidiarity is often invoked in discussions about the appropriate level of government intervention. It suggests that decisions should be made at the lowest possible level of government that is capable of effectively addressing the issue. This principle is particularly relevant in federal systems and international organizations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subsidiarity was applied without considering the local context.","correct":"✓ The principle of subsidiarity was applied without considering the local context.","note":"'Subsidiarity' is a principle, so it's best to specify 'the principle of subsidiarity' for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["subsidiary (noun, adjective)","subsidize (verb)","subsidy (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'subsidiarity' refers to the principle that decisions should be made at the lowest appropriate level. This is often discussed in the context of politics, governance, and the European Union. It's a complex concept, so understanding the context in which it's used is important."},"example_sentences":[{"sentence":"The European Union operates on the principle of **subsidiarity**, ensuring that decisions are taken at the most appropriate level.","translation":"欧州連合は**補完性原理**に基づいて運営されており、決定が最も適切なレベルで行われるようにしている。","type":"noun","meaning_category":"補完性原理"},{"sentence":"The local council played a **subsidiar** role in the implementation of the national policy.","translation":"地方議会は、国家政策の実施において**補助的な**役割を果たした。","type":"adjective","meaning_category":"補助的な"}]}