{"word":"Ourali","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of curare used as an arrow poison by indigenous peoples of South America, particularly in the Amazon basin.","english_definition":"A type of curare used as an arrow poison.","examples":[{"sentence":"The hunter dipped his arrow in the ourali before heading into the jungle.","translation":"狩人はジャングルに向かう前に、矢をウーラリに浸した。"},{"sentence":"Ourali contains potent alkaloids that cause paralysis.","translation":"ウーラリには麻痺を引き起こす強力なアルカロイドが含まれている。"}],"collocations":["arrow poison","curare","Amazon basin","muscle relaxant"],"synonyms":["curare","tube-curare"],"antonyms":[]}],"etymology":{"value":"Derived from a native South American language, likely from the Amazon region. The exact origin and language are often debated among ethnobotanists and linguists.","priority":"★★☆"},"pronunciation":{"ipa":"/uˈrɑːli/","syllables":"Ou-ra-li"},"inflection":{"noun_plural":"Ouralis"},"usage_notes":{"explanation":"\"Ourali\" specifically refers to a type of curare traditionally used by indigenous tribes in South America for hunting. It's important to note the cultural and historical context of this substance, as it plays a significant role in the survival and traditions of these communities. In modern medicine, similar compounds derived from curare are used as muscle relaxants during surgical procedures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used ourali to cure the disease.","correct":"✓ He used a muscle relaxant derived from curare to treat the muscle spasm.","note":"Ourali is a poison, not a medicine for curing diseases. It's used as an arrow poison to paralyze animals."}],"priority":"★☆☆"},"related_words":{"derivatives":["curare","tubocurarine"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Ourali\" is a specialized term referring to a specific type of arrow poison used by indigenous peoples in South America. Understanding this word requires knowledge of ethnobotany, South American cultures, and the history of traditional hunting practices. It is not a commonly used word in general English conversation."},"example_sentences":[{"sentence":"The ethnobotanist studied the preparation methods of ourali among the Yanomami people.","translation":"民族植物学者は、ヤノマミ族におけるウーラリの調合法を研究した。","type":"noun","meaning_category":"arrow poison"},{"sentence":"The effects of ourali on the nervous system have been extensively researched.","translation":"神経系に対するウーラリの効果は広範囲に研究されてきた。","type":"noun","meaning_category":"arrow poison"}]}