{"word":"Albertina","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アルベルティーナ美術館 (ウィーンにある美術館)","english_definition":"A museum in Vienna, Austria, housing one of the largest and most important print rooms in the world.","examples":[{"sentence":"We visited the Albertina Museum during our trip to Vienna.","translation":"ウィーンへの旅行中にアルベルティーナ美術館を訪れました。"},{"sentence":"The Albertina is famous for its collection of graphic art.","translation":"アルベルティーナ美術館は、版画コレクションで有名です。"}],"collocations":["Albertina Museum","visit the Albertina","Albertina's collection"],"synonyms":["art museum","museum in Vienna"],"antonyms":[]}],"etymology":{"value":"The museum is named after Archduke Albert Casimir of Saxe-Teschen, who founded the collection in 1776.","priority":"★★★"},"pronunciation":{"ipa":"/ˌælbərˈtiːnə/","syllables":"Al-ber-ti-na"},"inflection":{"notes":"Proper noun, does not have plural form."},"usage_notes":{"explanation":"'Albertina' primarily refers to the Albertina Museum in Vienna. It is renowned for its extensive collection of graphic arts, including drawings, prints, and photographs. When used, it almost always refers to the museum itself.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I want to go to Albertina in Paris.","correct":"✓ I want to go to the Albertina in Vienna.","note":"The Albertina is located in Vienna, not Paris."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_places":["Vienna","Austria"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (depending on context of art history or travel)","frequency_google_ngram":"Relatively low frequency, mainly in contexts related to art and Vienna.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Albertina' is a proper noun referring to a specific museum, the Albertina Museum in Vienna. Understanding its meaning requires some knowledge of art history or Viennese culture. It's not a commonly used word outside of these contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The Albertina's collection includes works by Dürer and Michelangelo.","translation":"アルベルティーナ美術館のコレクションには、デューラーやミケランジェロの作品が含まれています。","type":"noun","meaning_category":"Museum"},{"sentence":"We spent the afternoon exploring the Albertina.","translation":"午後をアルベルティーナ美術館の探索に費やしました。","type":"noun","meaning_category":"Museum"},{"sentence":"The Albertina is a must-see for art lovers visiting Vienna.","translation":"アルベルティーナ美術館は、ウィーンを訪れるアート愛好家にとって必見の場所です。","type":"noun","meaning_category":"Museum"}]}