{"word":"supernegligently","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"極めて不注意に、非常に怠慢に","english_definition":"In an extremely negligent or careless manner.","examples":[{"sentence":"The employee supernegligently handled the hazardous materials, leading to a dangerous spill.","translation":"その従業員は極めて不注意に有害物質を取り扱い、危険な流出事故を引き起こした。"},{"sentence":"The company was found to have acted supernegligently in its safety procedures.","translation":"その会社は安全手順において非常に怠慢な行為をしていたことが判明した。"}],"collocations":["act supernegligently","handle something supernegligently"],"synonyms":["extremely carelessly","grossly negligently","highly neglectfully"],"antonyms":["carefully","attentively","diligently"]}],"etymology":{"value":"Formed by adding the prefix 'super-' to 'negligently' to intensify the degree of negligence.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌsuːpərˈnɛɡlɪdʒəntli/","syllables":"su-per-neg-li-gent-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Supernegligently' is used to emphasize an extreme degree of negligence. It suggests a level of carelessness that goes beyond ordinary negligence, often implying a reckless disregard for safety or responsibility.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He drove supernegligent.","correct":"✓ He drove supernegligently.","note":"'Supernegligently' is an adverb and should be used to modify a verb, adjective, or another adverb. 'Supernegligent' is an adjective, and using it in place of the adverb is incorrect."}],"priority":"☆☆☆"},"related_words":{"derivatives":["negligent","negligence","negligently","supernegligence"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Supernegligently' is a rare and advanced word used to describe an extremely careless or negligent action. It is formed by adding 'super-' to 'negligently' to emphasize the high degree of carelessness. This word is not commonly used in everyday conversation and is more likely to appear in legal or formal contexts where the severity of negligence needs to be highlighted."},"example_sentences":[{"sentence":"The technician supernegligently bypassed several safety protocols, resulting in a major system failure.","translation":"技術者は極めて不注意にいくつかの安全プロトコルを無視し、その結果、大規模なシステム障害が発生した。","type":"adverb","meaning_category":"carelessly"},{"sentence":"The investigation revealed that the construction company had acted supernegligently in its handling of asbestos.","translation":"調査により、建設会社がアスベストの取り扱いにおいて非常に怠慢な行為をしていたことが明らかになった。","type":"adverb","meaning_category":"negligently"}]}