{"word":"Dysthyroidism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"甲状腺機能不全","english_definition":"A condition in which the thyroid gland does not function properly, resulting in either an overproduction (hyperthyroidism) or underproduction (hypothyroidism) of thyroid hormones.","examples":[{"sentence":"Dysthyroidism can lead to a variety of symptoms, including fatigue, weight changes, and mood disturbances.","translation":"甲状腺機能不全は、疲労、体重の変化、気分のむらなど、さまざまな症状を引き起こす可能性があります。"},{"sentence":"Diagnosis of dysthyroidism typically involves blood tests to measure thyroid hormone levels.","translation":"甲状腺機能不全の診断には通常、甲状腺ホルモン値を測定するための血液検査が含まれます。"}],"collocations":["thyroid function","hormone levels","hyperthyroidism","hypothyroidism","blood tests","diagnosis","treatment"],"synonyms":["thyroid dysfunction","thyroid disorder","thyroid imbalance"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek prefix 'dys-' meaning 'bad' or 'abnormal', combined with 'thyroid', and the suffix '-ism' indicating a condition or state.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈθaɪˌrɔɪdɪzəm/","syllables":"dis-thy-roid-is-m"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Dysthyroidism' is a general term referring to any abnormality in thyroid function. It encompasses both hyperthyroidism (overactive thyroid) and hypothyroidism (underactive thyroid). The term is often used when the specific type of thyroid dysfunction is not yet determined or when discussing thyroid disorders in general.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Dysthyroidism is always hyperthyroidism.","correct":"✓ Dysthyroidism can be either hyperthyroidism or hypothyroidism.","note":"Dysthyroidism includes both overactive and underactive thyroid conditions."},{"incorrect":"✗ Dysthyroidism can be diagnosed with a physical exam alone.","correct":"✓ Dysthyroidism is diagnosed with blood tests to measure thyroid hormone levels.","note":"While a physical exam can provide clues, blood tests are necessary for diagnosis."}],"priority":"★★☆"},"related_words":{"derivatives":["hyperthyroidism","hypothyroidism","thyroiditis","thyroxine","triiodothyronine"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dysthyroidism' is a medical term referring to any condition where the thyroid gland isn't working correctly. This means it could be making too many hormones (hyperthyroidism) or not enough (hypothyroidism). It's a broad term used by doctors and in medical contexts. Diagnosis requires blood tests to check hormone levels.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient was diagnosed with dysthyroidism after experiencing unexplained weight gain and fatigue.","translation":"患者は原因不明の体重増加と疲労を経験した後、甲状腺機能不全と診断されました。","type":"general","meaning_category":"General"},{"sentence":"Treatment for dysthyroidism depends on whether the patient has hyperthyroidism or hypothyroidism.","translation":"甲状腺機能不全の治療は、患者が甲状腺機能亢進症か甲状腺機能低下症のどちらであるかによって異なります。","type":"treatment","meaning_category":"Treatment"},{"sentence":"Regular monitoring of thyroid hormone levels is crucial for managing dysthyroidism.","translation":"甲状腺機能不全の管理には、甲状腺ホルモン値の定期的なモニタリングが不可欠です。","type":"monitoring","meaning_category":"Monitoring"}]}