{"word":"silene","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"シレネ属の植物","english_definition":"any plant of the genus Silene, typically having white or pink flowers with inflated calyxes","examples":[{"sentence":"The Silene uniflora is a beautiful wildflower found near the coast.","translation":"シレネ・ユニフローラは海岸近くで見られる美しい野草です。"}],"collocations":["Silene dioica","Silene vulgaris","Silene uniflora"],"synonyms":["catchfly","campion"],"antonyms":[]}],"etymology":{"value":"The name 'Silene' comes from the Greek word 'Seilenos', a companion of Dionysus, who was often depicted as being covered in foam, which some species of Silene resemble due to their sticky secretions.","priority":"★★☆"},"pronunciation":{"ipa":"/saɪˈliːniː/","syllables":"Si-le-ne"},"inflection":{"noun_plural":"Silenes"},"usage_notes":{"explanation":"'Silene' refers to a genus of flowering plants in the family Caryophyllaceae, commonly known as catchflies or campions. These plants are found in various habitats around the world and are characterized by their often inflated calyxes and white or pink flowers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a silene flower, it was very siline.","correct":"✓ I saw a silene flower, it was very beautiful.","note":"'Silene' is a noun referring to the plant. There is no adjective form 'siline'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Silene' is a botanical term referring to a specific genus of flowering plants. It is not commonly used in everyday conversation and is more likely to be encountered in scientific or horticultural contexts. Understanding this term requires some familiarity with botanical nomenclature."},"example_sentences":[{"sentence":"The meadow was filled with various species of Silene.","translation":"その牧草地は様々な種類のシレネでいっぱいでした。","type":"noun","meaning_category":"plant genus"},{"sentence":"Silene vulgaris, also known as bladder campion, is edible.","translation":"シレネ・ブルガリス、別名ブラダーキャンピオンは食用可能です。","type":"noun","meaning_category":"plant species"}]}