{"word":"nonabstemiously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"節制せずに、自制せずに、度が過ぎるほどに","english_definition":"In a manner that is not abstemious; without moderation or restraint, especially in the consumption of food or alcohol.","examples":[{"sentence":"He ate nonabstemiously at the buffet, piling his plate high with food.","translation":"彼はビュッフェで節制せずに食べ、皿に山盛りの料理を盛った。"},{"sentence":"They drank nonabstemiously throughout the evening, becoming increasingly boisterous.","translation":"彼らは夕方を通して自制せずに飲み、ますます騒々しくなった。"}],"collocations":["eat nonabstemiously","drink nonabstemiously","live nonabstemiously"],"synonyms":["intemperately","immoderately","excessively","gluttonously","voraciously","indulgently"],"antonyms":["abstemiously","moderately","temperately","sparingly","restrainedly"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (not) to the adverb 'abstemiously'. 'Abstemiously' comes from 'abstemious', which is derived from the Latin 'abstemius' (temperate, abstaining from wine), from 'abs-' (away from) + 'temetum' (strong drink).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnəbˈstiːmiəsli/","syllables":"non-ab-stee-mi-ous-ly"},"inflection":{"notes":"Adverbs do not typically inflect. This word does not have different forms based on tense, number, or gender."},"usage_notes":{"explanation":"'Nonabstemiously' is a relatively rare word, primarily used in formal or literary contexts to describe a lack of self-restraint, particularly with regard to food and drink. It emphasizes the absence of temperance and moderation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She lived a nonabstemiously life.","correct":"✓ She lived nonabstemiously.","note":"'Nonabstemiously' is an adverb and modifies verbs, adjectives, or other adverbs, not nouns. To modify the noun 'life', use the adjective 'nonabstemious' (e.g., 'She lived a nonabstemious life')."},{"incorrect":"✗ He nonabstemiously ate a little bit.","correct":"✓ He ate nonabstemiously.","note":"The word implies excess, so using it with phrases like 'a little bit' creates a contradiction. It describes eating immoderately, not in small portions."}],"priority":"★★☆"},"related_words":{"derivatives":["abstemious (adjective: moderate, temperate, especially in diet)","abstemiousness (noun: the quality of being abstemious)","abstemiously (adverb: in an abstemious manner)"],"antonyms":["abstemiousness (noun: the practice of abstaining from excess)","abstemious (adjective: practicing self-restraint)"],"synonyms":["intemperance (noun: lack of moderation or self-control)","immoderation (noun: lack of moderation)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nonabstemiously' is a sophisticated and rare word, indicating a high level of language proficiency. It is used to describe behavior that lacks moderation or self-restraint, particularly in the consumption of food or alcohol. Because of its rarity, it is more likely to be encountered in formal writing or specialized texts rather than everyday conversation. Understanding this word demonstrates an advanced vocabulary and the ability to comprehend nuanced expressions."},"example_sentences":[{"sentence":"The wealthy aristocrats dined nonabstemiously, indulging in every delicacy the chef presented.","translation":"裕福な貴族たちは節制せずに食事をし、シェフが提供するあらゆる珍味にふけった。","type":"adverb","meaning_category":"lack of moderation"},{"sentence":"He lived nonabstemiously, enjoying lavish parties and extravagant spending.","translation":"彼は節制せずに暮らし、贅沢なパーティーと浪費を楽しんだ。","type":"adverb","meaning_category":"lack of restraint"}]}