{"word":"subentendido","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"暗黙の了解、言外の意味、含み","english_definition":"something that is understood although not directly expressed; an implicit understanding; an unspoken assumption.","examples":[{"sentence":"Hubo un subentendido entre ellos de que no hablarían del tema.","translation":"彼らの間には、その話題について話さないという暗黙の了解があった。"},{"sentence":"El comentario tenía un subentendido que pocos captaron.","translation":"そのコメントには、ほとんどの人が気づかなかった含みがあった。"},{"sentence":"En la negociación, había varios subentendidos que dificultaban el acuerdo.","translation":"交渉では、いくつかの暗黙の了解があり、合意を困難にしていた。"}],"collocations":["dejar algo subentendido (to leave something unsaid, to imply something)","haber un subentendido (to be an implicit understanding)","captar el subentendido (to grasp the unspoken meaning)"],"synonyms":["implicación","suposición","inferencia","sobreentendido"],"antonyms":["explícito","expreso","declarado"]}],"etymology":{"value":"Formed from the prefix 'sub-' (under) and the participle 'entendido' (understood) of the verb 'entender' (to understand). Literally, 'understood underneath' or 'understood implicitly'.","priority":"N/A"},"pronunciation":{"ipa":"/su.βen.tenˈdi.do/","syllables":"su-ben-ten-di-do"},"inflection":{"gender":"masculine","number":"singular"},"usage_notes":{"explanation":"'Subentendido' refers to something that is understood or implied without being explicitly stated. It is often used to describe unspoken agreements, assumptions, or implications in communication or situations. It's important to be aware of 'subentendidos' in order to fully understand the context and avoid misunderstandings.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"*El subentendido fue muy obvio.*","correct":"El subentendido era sutil.","note":"'Subentendidos' are, by definition, not obvious. If something is obvious, it is not a 'subentendido'."}],"priority":"N/A"},"related_words":{"derivatives":["entender (verb: to understand)","entendimiento (noun: understanding)"],"phrases":["a buen entendedor, pocas palabras (a word to the wise is enough)"],"priority":"N/A"},"level_frequency":{"level":"B2-C1","frequency_google_ngram":"Moderate","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Subentendido' is a term used to describe an implicit understanding or unspoken assumption. It is often used in situations where communication is indirect or where certain information is taken for granted. Understanding 'subentendidos' is crucial for effective communication and avoiding misunderstandings, particularly in complex or nuanced contexts."},"example_sentences":[{"sentence":"Existía un subentendido tácito entre los socios.","translation":"There was a tacit understanding between the partners.","type":"general","meaning_category":"implicit understanding"},{"sentence":"No me gusta que haya subentendidos en las relaciones.","translation":"I don't like there to be unspoken assumptions in relationships.","type":"general","meaning_category":"unspoken assumption"},{"sentence":"El subentendido era que debíamos mantener el secreto.","translation":"The unspoken agreement was that we should keep the secret.","type":"general","meaning_category":"unspoken agreement"}]}