{"word":"concealingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"隠蔽するように、隠すように、覆い隠すように","english_definition":"in a way that hides or covers something up; in a manner intended to prevent something from being known or noticed.","examples":[{"sentence":"She smiled concealingly, hoping he wouldn't notice her nervousness.","translation":"彼女は、彼に自分の緊張が気づかれないように、隠すように微笑んだ。"},{"sentence":"He spoke concealingly about his past, avoiding specific details.","translation":"彼は過去について、具体的な詳細を避け、隠蔽するように話した。"},{"sentence":"The painting was hung concealingly in a dark corner of the room.","translation":"その絵は、部屋の暗い隅に、覆い隠すように掛けられていた。"}],"collocations":["smile concealingly","speak concealingly","act concealingly","hide concealingly","place concealingly","arrange concealingly"],"synonyms":["secretly","covertly","furtively","stealthily","disguisedly","obscurely"],"antonyms":["openly","frankly","candidly","transparently","overtly"]}],"etymology":{"value":"The word 'concealingly' is formed by adding the suffix '-ly' to the adjective 'concealing'. 'Concealing' is the present participle of the verb 'conceal', which comes from the Latin word 'concelare', meaning 'to hide thoroughly'. 'Con-' means 'completely' and 'celare' means 'to hide'.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈsiːlɪŋli/","syllables":"con-ceal-ing-ly"},"inflection":{"notes":"As an adverb, 'concealingly' does not have different forms for tense or number."},"usage_notes":{"explanation":"'Concealingly' describes the manner in which an action is performed, emphasizing the intent to hide or keep something secret. It suggests a deliberate effort to prevent information from being known or noticed. It is often used to describe actions that are intended to deceive or mislead. The word is relatively formal and not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He concealingly his feelings.","correct":"✓ He concealed his feelings. / ✓ He expressed his feelings concealingly.","note":"'Concealingly' is an adverb and modifies a verb or adjective. It should not be used as a verb itself. The correct verb form is 'conceal'. Alternatively, the adverb can modify how the verb is expressed."},{"incorrect":"✗ The house was concealingly from the road.","correct":"✓ The house was concealed from the road. / ✓ The house was located concealingly.","note":"'Concealed' is the correct adjective to describe something that is hidden. 'Concealingly' describes the manner in which something is hidden or located."}],"priority":"★★☆"},"related_words":{"derivatives":["conceal (verb)","concealment (noun)","concealable (adjective)","concealing (adjective)"],"phrasal_verbs":["N/A"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'concealingly' is an adverb that describes an action done in a way that hides something. It is not a common word and is typically used in more formal or literary contexts. Understanding the root verb 'conceal' (to hide) is helpful in understanding the meaning of 'concealingly'."},"example_sentences":[{"sentence":"She watched him concealingly from behind the curtains.","translation":"彼女はカーテンの陰から、彼を隠蔽するように見ていた。","type":"adverb","meaning_category":"hiding"},{"sentence":"He answered the question concealingly, giving only vague details.","translation":"彼は質問に、曖昧な詳細だけを与え、隠蔽するように答えた。","type":"adverb","meaning_category":"evasive"},{"sentence":"The treasure was buried concealingly beneath a large rock.","translation":"宝は大きな岩の下に、覆い隠すように埋められていた。","type":"adverb","meaning_category":"secretive"}]}