{"word":"uncoffined","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"棺桶に入れられていない、棺なしの","english_definition":"Not placed in a coffin.","examples":[{"sentence":"The body was buried uncoffined.","translation":"その遺体は棺なしで埋葬された。"},{"sentence":"An uncoffined corpse lay on the battlefield.","translation":"棺桶に入れられていない死体が戦場に横たわっていた。"}],"collocations":["uncoffined burial","uncoffined corpse"],"synonyms":["without a coffin","unburied"],"antonyms":["coffined","buried"],"notes":"Often used in historical or literary contexts to describe burials that were not performed with the traditional use of a coffin."}],"etymology":{"value":"Formed from the prefix 'un-' (not) and the word 'coffined' (placed in a coffin).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈkɒfɪnd/","syllables":"un-cof-fined"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Uncoffined' is a descriptive adjective indicating that a deceased person or body has not been placed inside a coffin, typically before burial or other final disposition. It is often used to highlight a departure from traditional burial practices, whether due to poverty, religious customs, or other specific circumstances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The uncoffined body was buried with a coffin.","correct":"✓ The uncoffined body was buried without a coffin.","note":"The term 'uncoffined' implies the absence of a coffin, so it's contradictory to say it was buried 'with a coffin'."}],"priority":"★★☆"},"related_words":{"derivatives":["coffin (noun)","coffining (verb - to place in a coffin)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'uncoffined' is a relatively rare and specialized term, primarily used in formal or literary contexts to describe a burial or the state of a deceased body not placed in a coffin. Its meaning is straightforward, being the opposite of 'coffined,' but its usage is limited to situations where the absence of a coffin is a significant or noteworthy detail."},"example_sentences":[{"sentence":"The pauper's grave was marked only by a simple stone, the body buried uncoffined in the cold earth.","translation":"貧者の墓は簡素な石でしか印されておらず、遺体は冷たい土の中に棺なしで埋葬された。","type":"general","meaning_category":"descriptive"},{"sentence":"In some ancient cultures, it was customary to bury the dead uncoffined, wrapped only in simple shrouds.","translation":"古代文化の中には、死者を棺桶に入れず、簡素な経帷子のみに包んで埋葬することが慣習であったものもある。","type":"cultural","meaning_category":"customs"}]}