{"word":"Radburn","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ラドバーン (アメリカ合衆国ニュージャージー州の都市名。また、その都市計画の様式)","english_definition":"A town in New Jersey, USA, planned in the 1920s, or a style of town planning based on its design.","examples":[{"sentence":"Radburn was designed with superblocks and separate pedestrian and vehicle routes.","translation":"ラドバーンは、スーパーブロックと歩行者と車両の分離された経路で設計されました。"},{"sentence":"The Radburn layout has influenced many subsequent town planning projects.","translation":"ラドバーンのレイアウトは、その後の多くの都市計画プロジェクトに影響を与えました。"}],"collocations":["Radburn layout","Radburn design","Radburn system","New Town","Garden City"],"synonyms":["New Town","Garden City"],"antonyms":[]}],"etymology":{"value":"Named after Radburn, New Jersey, the town where this planning concept was first implemented.","priority":"★★★"},"pronunciation":{"ipa":"/ˈrædbɜːrn/","syllables":"Rad-burn"},"inflection":{},"usage_notes":{"explanation":"Radburn is significant in urban planning history for its innovative approach to separating pedestrian and vehicular traffic, creating safer and more livable communities. The design features superblocks with houses facing onto pedestrian greenways and cul-de-sacs for vehicular access.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I live in a radburn.","correct":"✓ I live in a Radburn-style community.","note":"'Radburn' refers to a specific town or a style of planning, not a general type of dwelling."}],"priority":"★★☆"},"related_words":{"derivatives":["Radburn layout","Radburn system"],"related_concepts":["New Urbanism","Garden City movement","superblock"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'Radburn' is specific to urban planning and architecture. Understanding requires familiarity with concepts like superblocks, pedestrianization, and the history of town planning. It is not a commonly used word outside of these contexts."},"example_sentences":[{"sentence":"The principles of Radburn planning are still relevant in modern urban design.","translation":"ラドバーン計画の原則は、現代の都市設計においても依然として重要です。","type":"noun","meaning_category":"Town planning style"},{"sentence":"Radburn, New Jersey, is a notable example of a planned community.","translation":"ニュージャージー州のラドバーンは、計画されたコミュニティの注目すべき例です。","type":"noun","meaning_category":"Town name"}]}