{"word":"Papaveraceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ケシ科","english_definition":"The poppy family of flowering plants, characterized by milky or colored latex and often showy flowers.","examples":[{"sentence":"The Papaveraceae family includes poppies, celandines, and bloodroots.","translation":"ケシ科には、ケシ、クサノオウ、ヒメエンゴサクなどが含まれます。"}],"collocations":["Papaveraceae family","members of Papaveraceae"],"synonyms":["poppy family"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Papaver' (poppy) and the suffix '-aceae', which is used to denote a plant family. 'Papaver' itself comes from Latin, possibly related to 'pappa' (food), referring to the milky latex found in many species.","priority":"★★☆"},"pronunciation":{"ipa":"/pəˌpævəˈreɪsiːˌaɪ/","syllables":"Pa-pav-er-a-ce-ae"},"inflection":{"noun_plural":"Papaveraceae"},"usage_notes":{"explanation":"'Papaveraceae' is a botanical term used in scientific contexts to refer to the poppy family. It is not commonly used in everyday language. When discussing plants from this family in a general context, it's more common to use the common names of the specific plants (e.g., poppies).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Papaveraceae is a type of animal.","correct":"✓ Papaveraceae is a family of plants.","note":"Papaveraceae refers to a plant family, not an animal. "},{"incorrect":"✗ The plural of Papaveraceae is Papaveraceaes.","correct":"✓ The plural of Papaveraceae is Papaveraceae.","note":"Botanical family names ending in -aceae do not typically change in the plural."}],"priority":"★★☆"},"related_words":{"derivatives":["papaveraceous (adjective: relating to the Papaveraceae family)"],"other_related_terms":["Papaver (genus of poppies)","Eschscholzia (genus of California poppies)","Chelidonium (genus of celandines)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency - primarily used in botanical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Papaveraceae' is a technical term used in botany to classify a specific family of flowering plants known as the poppy family. This term is primarily encountered in scientific literature, botanical studies, or specialized discussions about plant taxonomy. Understanding this term requires familiarity with botanical nomenclature and plant classification systems. In general conversation, it's more common to refer to specific plants within this family, such as poppies or celandines, rather than using the family name itself."},"example_sentences":[{"sentence":"The botanical garden features a diverse collection of plants from the Papaveraceae family.","translation":"その植物園には、ケシ科の多様な植物が集められています。","type":"general"},{"sentence":"Researchers are studying the chemical compounds found in various species of Papaveraceae for their medicinal properties.","translation":"研究者たちは、薬効を求めて様々なケシ科植物に含まれる化学物質を研究しています。","type":"scientific"},{"sentence":"Many members of the Papaveraceae family are known for their vibrant and colorful flowers.","translation":"ケシ科の多くの植物は、鮮やかでカラフルな花で知られています。","type":"general"}]}