{"word":"focalization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"焦点化、焦点を当てること、焦点が当てられること","english_definition":"The perspective through which a narrative is presented; the act of focusing or being focused.","examples":[{"sentence":"The novel employs internal focalization, presenting the story through the eyes of the protagonist.","translation":"その小説は内的焦点化を採用しており、主人公の視点を通して物語を提示している。"},{"sentence":"The focalization shifts between different characters, providing a multifaceted view of the events.","translation":"焦点化は異なるキャラクターの間で移行し、出来事の多面的な見方を提供する。"},{"sentence":"The use of external focalization creates a sense of distance between the reader and the characters.","translation":"外的焦点化の使用は、読者とキャラクターの間に距離感を生み出す。"}],"collocations":["internal focalization (内的焦点化)","external focalization (外的焦点化)","zero focalization (ゼロ焦点化)","shift in focalization (焦点化の移行)","narrative focalization (物語の焦点化)"],"synonyms":["perspective","point of view","viewpoint","focus","angle","lens"],"antonyms":[]}],"etymology":{"value":"Derived from 'focalize,' which comes from 'focal,' ultimately from Latin 'focus' meaning 'hearth, fireplace' and later 'point of convergence.' The suffix '-ation' turns the verb into a noun.","priority":"★★★"},"pronunciation":{"ipa":"/ˌfoʊkəlaɪˈzeɪʃən/","syllables":"fo-cal-i-za-tion"},"inflection":{"noun_plural":"focalizations"},"usage_notes":{"explanation":"'Focalization' is primarily a literary term used in narratology to describe the perspective or point of view through which a story is narrated. It answers the question, 'Who sees?' or 'Who perceives?' rather than 'Who speaks?' (which is related to narration). There are three main types: internal (narrative is filtered through a character's consciousness), external (narrative presents events without access to characters' thoughts or feelings), and zero (omniscient narrator with access to all characters' thoughts and feelings).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The focalization of the camera was off.","correct":"✓ The focus of the camera was off.","note":"In the context of photography or optics, use 'focus' instead of 'focalization.' 'Focalization' is primarily used in literary analysis. "},{"incorrect":"✗ The focalization of the meeting was on marketing.","correct":"✓ The focus of the meeting was on marketing.","note":"When referring to the main topic or subject of a discussion, use 'focus' instead of 'focalization.'"}],"priority":"★★☆"},"related_words":{"derivatives":["focalize (verb)","focal (adjective)","focus (noun/verb)"],"related_terms":["narratology","narrative","point of view","perspective","narrator"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Focalization' is a specialized term primarily used in literary studies and narratology. It refers to the perspective through which a story is presented, essentially answering the question of who is seeing or perceiving the events. It's not a common word in everyday conversation, but understanding it is crucial for analyzing narrative structure and point of view in literature. The concept is more important than the word itself; you might understand the idea without knowing the specific term.","priority":"★★☆"},"example_sentences":[{"sentence":"The author's choice of internal **focalization** allows readers to deeply empathize with the protagonist's struggles.","translation":"作者が内的**焦点化**を選択したことで、読者は主人公の苦悩に深く共感できるようになった。","type":"noun","meaning_category":"narrative perspective"},{"sentence":"The film's use of external **focalization** creates a detached and objective portrayal of the events.","translation":"その映画における外的**焦点化**の使用は、出来事の客観的で冷静な描写を生み出している。","type":"noun","meaning_category":"narrative perspective"},{"sentence":"A close analysis of the **focalization** reveals the narrator's biases and limitations.","translation":"**焦点化**の綿密な分析は、語り手の偏見と限界を明らかにする。","type":"noun","meaning_category":"narrative perspective"}]}