{"word":"deglutinate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(糊などを)取り除く、脱膠する","english_definition":"To remove gluten or glue from.","examples":[{"sentence":"The process of deglutinating the flour makes it suitable for people with celiac disease.","translation":"小麦粉からグルテンを取り除く工程は、セリアック病の人々に適したものにします。"},{"sentence":"The archaeologist carefully deglutinated the ancient pottery fragments before attempting to reassemble them.","translation":"考古学者は古代の陶器の破片を再構築する前に、慎重に糊を取り除いた。"}],"collocations":["deglutinate flour","deglutinate pottery","deglutinate a substance"],"synonyms":["unglue","remove gluten","delaminate"],"antonyms":["glutinate","glue","adhere"]}],"etymology":{"value":"From Latin 'de-' (removing, reversing) + 'glutinatus', past participle of 'glutinare' (to glue, cement), from 'gluten' (glue).","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈɡluːtɪneɪt/","syllables":"de-glu-ti-nate"},"inflection":{"verb_forms":{"present_simple":["deglutinate","deglutinates"],"past_simple":"deglutinated","past_participle":"deglutinated","present_participle":"deglutinating"}},"usage_notes":{"explanation":"'Deglutinate' is a relatively rare term, primarily used in technical or scientific contexts. It specifically refers to the process of removing gluten (a protein found in wheat and other grains) or glue (an adhesive substance) from something. The term is most often encountered when discussing food processing for gluten-free products or in conservation efforts involving delicate historical artifacts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to deglutinate my computer screen.","correct":"✓ I need to clean my computer screen.","note":"'Deglutinate' refers specifically to removing gluten or glue. For general cleaning, use 'clean' or 'wipe'."},{"incorrect":"✗ The chef deglutinated the soup to make it thicker.","correct":"✓ The chef thickened the soup with cornstarch.","note":"Deglutinating removes gluten or glue; it does not thicken. Use a thickening agent like cornstarch or flour to thicken soup."}],"priority":"★☆☆"},"related_words":{"derivatives":["deglutination (noun: the act of deglutinating)","gluten (noun: a protein found in wheat)","glutinous (adjective: having the properties of glue)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Deglutinate' is a specialized term with limited application. It describes the action of removing gluten or glue from a substance. Due to its technical nature and infrequent use, it is typically encountered in scientific or industrial contexts. Understanding the etymology (de- + glutinate) can aid in deciphering its meaning when encountered."},"example_sentences":[{"sentence":"The scientist used a special solvent to deglutinate the sample.","translation":"科学者は特殊な溶剤を使ってサンプルから糊を取り除いた。","type":"verb","meaning_category":"remove glue"},{"sentence":"Modern food processing techniques allow manufacturers to deglutinate various grains.","translation":"現代の食品加工技術により、製造業者は様々な穀物からグルテンを取り除くことができる。","type":"verb","meaning_category":"remove gluten"}]}