{"word":"ultrasonography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"超音波検査、超音波診断法","english_definition":"a diagnostic imaging technique that uses ultrasound to visualize internal body structures such as tendons, muscles, joints, vessels and internal organs.","examples":[{"sentence":"Ultrasonography is used to monitor the development of a fetus during pregnancy.","translation":"超音波検査は妊娠中の胎児の発育を観察するために用いられる。"},{"sentence":"The doctor recommended ultrasonography to examine the patient's liver.","translation":"医師は患者の肝臓を検査するために超音波検査を勧めた。"},{"sentence":"Ultrasonography can help detect abnormalities in the thyroid gland.","translation":"超音波検査は甲状腺の異常を発見するのに役立つ。"}],"collocations":["abdominal ultrasonography (腹部超音波検査)","obstetric ultrasonography (産科超音波検査)","transvaginal ultrasonography (経膣超音波検査)","intraoperative ultrasonography (術中超音波検査)","point-of-care ultrasonography (POC超音波検査)"],"synonyms":["ultrasound","sonography","echography"],"antonyms":[]}],"etymology":{"value":"The word \"ultrasonography\" is derived from \"ultrasound\" (meaning sound waves with frequencies higher than the upper limit of human hearing) and \"-graphy\" (meaning a process or method of writing, recording, or imaging).","priority":"★★☆"},"pronunciation":{"ipa":"ˌʌltrəsəˈnɒɡrəfi","syllables":"ul-tra-so-nog-ra-phy"},"inflection":{"noun_plural":"ultrasonographies"},"usage_notes":{"explanation":"\"Ultrasonography\" is a medical imaging technique that uses ultrasound. It is often used interchangeably with the term \"ultrasound,\" although \"ultrasonography\" specifically refers to the process or technique, while \"ultrasound\" can also refer to the sound waves themselves or the device used to perform the procedure. It is a non-invasive and relatively inexpensive imaging method.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ultrasonography was painless and quick.","correct":"✓ The ultrasonography procedure was painless and quick.","note":"While technically correct, it's more common to specify the procedure when describing the experience. Alternatively, \"The ultrasound was painless and quick\" is also acceptable."},{"incorrect":"✗ Ultrasonography are used for diagnosis.","correct":"✓ Ultrasonography is used for diagnosis.","note":"\"Ultrasonography\" is a singular noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["ultrasonographic (adjective)","ultrasonographer (noun: a person who performs ultrasonography)"],"phrasal_verbs":[],"related_medical_terms":["echocardiography (心エコー検査)","Doppler ultrasonography (ドプラ超音波検査)","elastography (エラストグラフィー)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"ultrasonography\" is a technical term used in the medical field. It refers to the use of ultrasound waves to create images of internal body structures for diagnostic purposes. It's a more formal and specific term than \"ultrasound,\" which is also commonly used to describe the same procedure. Understanding this term is essential for anyone working in healthcare or studying medical imaging techniques."},"example_sentences":[{"sentence":"The doctor used **ultrasonography** to assess the condition of the patient's kidneys.","translation":"医師は患者の腎臓の状態を評価するために超音波検査を用いた。","type":"noun","meaning_category":"超音波検査"},{"sentence":"**Ultrasonography** is a valuable tool for diagnosing various medical conditions.","translation":"超音波検査は様々な病状を診断するための貴重なツールである。","type":"noun","meaning_category":"超音波検査"},{"sentence":"The hospital has invested in new **ultrasonography** equipment.","translation":"病院は新しい超音波検査装置に投資した。","type":"noun","meaning_category":"超音波検査"}]}