{"word":"integrationism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"統合主義（言語学における理論）","english_definition":"A theory of language which holds that meaning arises from the integration of linguistic signs with their context of use, rejecting the idea that language has an autonomous structure independent of its users and their social environment.","examples":[{"sentence":"Integrationism challenges the traditional structuralist view of language.","translation":"統合主義は、言語の伝統的な構造主義的見方に異議を唱える。"},{"sentence":"According to integrationism, meaning is not inherent in words but is constructed in the act of communication.","translation":"統合主義によれば、意味は言葉に内在するものではなく、コミュニケーション行為の中で構築される。"}],"collocations":["linguistic integrationism","integrational linguistics"],"synonyms":["contextualism (in linguistics)"],"antonyms":["structuralism (in linguistics)","formalism (in linguistics)"],"notes":"Integrationism is associated with the work of Roy Harris."}],"etymology":{"value":"From 'integration' + '-ism'. Reflects the central role of integration in the theory's account of meaning.","priority":"中"},"pronunciation":{"ipa":"ɪntɪˈɡreɪʃənɪzəm","syllables":"in-te-gra-tion-ism"},"inflection":{"notes":"Uncountable noun."},"usage_notes":{"explanation":"Integrationism is a radical theory of language that rejects the Saussurean idea of language as an autonomous system of signs. It emphasizes the role of context, individual speakers, and social practices in the creation of meaning. It is a relatively niche theory within linguistics.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"Integrationism believes that language is innate.","correct":"Integrationism believes that language is shaped by context and use.","note":"Integrationism explicitly rejects the idea of innate language structures."}],"priority":"低"},"related_words":{"derivatives":["integrationist (noun, adjective)","integrational (adjective)"],"priority":"中"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in academic discourse on linguistics.","priority":"低"},"readability_explanation":{"level":"C2","text":"'Integrationism' is a specialized term within linguistics, referring to a theoretical approach that emphasizes the role of context and social interaction in the creation of meaning. It is typically discussed in advanced academic settings. Understanding requires familiarity with linguistic theory and philosophy of language."},"example_sentences":[{"sentence":"Integrationism provides a framework for analyzing how language is used in specific social situations.","translation":"統合主義は、特定の社会状況で言語がどのように使用されるかを分析するための枠組みを提供する。","type":"general","meaning_category":"theory"},{"sentence":"Critics of integrationism argue that it neglects the systematic aspects of language.","translation":"統合主義の批判者は、それが言語の体系的な側面を無視していると主張する。","type":"criticism","meaning_category":"theory"}]}