{"word":"pure-smelling","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"having a clean, fresh, and untainted scent; smelling of purity and cleanliness.","english_definition":"possessing an odor that is clean, fresh, and free from any unpleasant or artificial scents; evocative of purity and cleanliness.","examples":[{"sentence":"The pure-smelling air of the mountains refreshed her senses.","translation":"山の清らかな香りの空気が彼女の感覚をリフレッシュさせた。"},{"sentence":"She preferred pure-smelling soaps without added perfumes.","translation":"彼女は香料の入っていない、純粋な香りの石鹸を好んだ。"},{"sentence":"The laundry room had a pure-smelling aroma after the clothes were washed.","translation":"洗濯室は洗濯後、清らかな香りに包まれていた。"}],"collocations":["pure-smelling soap","pure-smelling air","pure-smelling water","pure-smelling flowers","pure-smelling linen"],"synonyms":["clean-smelling","fresh-smelling","untainted","natural-smelling","clear-scented","crisp-smelling"],"antonyms":["foul-smelling","stinky","pungent","artificial-smelling","contaminated"],"notes":"This word is often used to describe natural environments, cleaning products, or personal care items that have a pleasant and natural scent. It implies a lack of artificial fragrances or pollutants."}],"etymology":{"value":"Combination of 'pure' (free from contaminants, clean) and 'smelling' (emitting an odor).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈpjʊər ˈsmɛlɪŋ/","syllables":"pure-smell-ing"},"inflection":{"notes":"Adjective; does not have typical inflections like comparative or superlative forms, though 'more pure-smelling' and 'most pure-smelling' are grammatically possible but less common."},"usage_notes":{"explanation":"'Pure-smelling' is used to describe something that has a scent that is clean, fresh, and natural, without any artificial or unpleasant odors. It often evokes a sense of cleanliness, health, and natural beauty. It is not as common as 'clean-smelling' or 'fresh-smelling' but provides a more specific and evocative description.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The pure smelling flower.","correct":"The pure-smelling flower.","note":"Hyphenation is important to combine 'pure' and 'smelling' into a single adjective modifying the noun."}],"priority":"☆☆☆"},"related_words":{"derivatives":["purely","smell","smelly","smelling salts"],"related_adjectives":["clean","fresh","natural","unscented"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Not a commonly used term, but understandable.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pure-smelling' is a compound adjective used to describe something with a scent that is clean, fresh, and untainted. It is not a common term, so its use may require a higher level of vocabulary understanding. The word combines the concepts of 'purity' and 'smell' to create a specific sensory description."},"example_sentences":[{"sentence":"The mountain air was so pure-smelling that it felt invigorating.","translation":"山の空気はとても清らかな香りがして、元気づけられるようだった。","type":"descriptive","meaning_category":"clean scent"},{"sentence":"She chose a pure-smelling detergent for her baby's clothes.","translation":"彼女は赤ちゃんの服のために、純粋な香りの洗剤を選んだ。","type":"product description","meaning_category":"natural fragrance"},{"sentence":"The spa used only pure-smelling essential oils to create a relaxing atmosphere.","translation":"そのスパはリラックスできる雰囲気を作り出すために、純粋な香りのエッセンシャルオイルのみを使用した。","type":"sensory experience","meaning_category":"cleanliness"}]}