{"word":"walker-on","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"通行人、歩行者","english_definition":"A person who walks past or along something; a pedestrian.","examples":[{"sentence":"The police interviewed several walkers-on who might have witnessed the accident.","translation":"警察は事故を目撃した可能性のある数人の通行人に聞き込みを行った。"},{"sentence":"The street was crowded with walkers-on enjoying the evening air.","translation":"通りは夕涼みを楽しむ通行人で混雑していた。"}],"collocations":["busy walker-on","casual walker-on"],"synonyms":["passerby","pedestrian","wayfarer"],"antonyms":[]},{"part_of_speech":"noun","definition":"傍観者、傍聴者","english_definition":"A person who is present but not actively involved; an observer.","examples":[{"sentence":"He remained a walker-on in the political debate, never expressing his own opinion.","translation":"彼は政治討論の傍観者に終始し、決して自分の意見を表明しなかった。"},{"sentence":"She felt like a walker-on in her own life, watching events unfold without any control.","translation":"彼女は自分の人生の傍観者のように感じ、何もコントロールできずに出来事が展開するのを見ていた。"}],"collocations":["passive walker-on","uninvolved walker-on"],"synonyms":["observer","spectator","bystander"],"antonyms":["participant","contributor"]}],"etymology":{"value":"Derived from the verb phrase \"walk on,\" referring to someone who walks past or is simply present.","priority":"★★☆"},"pronunciation":{"ipa":"ˈwɔːkərˌɒn","syllables":"walk-er-on"},"inflection":{"noun_plural":"walkers-on"},"usage_notes":{"explanation":"The term \"walker-on\" is relatively uncommon. It can refer to someone who is simply walking by, or it can have a more figurative meaning, referring to someone who is present but not actively participating in something. The context usually makes the meaning clear.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The walker-on helped the actor remember his lines.","correct":"✓ The extra helped the actor remember his lines.","note":"If referring to someone hired to be in the background of a scene, use 'extra' rather than 'walker-on'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":["walk on (continue walking; abandon)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"walker-on\" is not commonly used. It can refer to someone who is simply walking by, or it can have a more figurative meaning, referring to someone who is present but not actively participating in something. The context usually makes the meaning clear. It is more common to use \"passerby\" or \"bystander\" for the literal meaning, and \"observer\" or \"spectator\" for the figurative meaning."},"example_sentences":[{"sentence":"The director needed a few more walkers-on to fill the street scene.","translation":"監督は街のシーンを埋めるためにもう少し通行人が必要だった。","type":"noun","meaning_category":"通行人"},{"sentence":"He felt like a walker-on in the conversation, unable to contribute.","translation":"彼は会話に貢献できず、傍観者のように感じた。","type":"noun","meaning_category":"傍観者"}]}