{"word":"leisure-related","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"余暇に関連する、レジャーに関連する","english_definition":"connected with or relating to leisure activities.","examples":[{"sentence":"The town offers a wide range of leisure-related activities.","translation":"その町は幅広いレジャー関連のアクティビティを提供しています。"},{"sentence":"The government is investing in leisure-related facilities.","translation":"政府はレジャー関連の施設に投資しています。"},{"sentence":"We discussed the impact of technology on leisure-related industries.","translation":"私たちはテクノロジーがレジャー関連産業に与える影響について議論しました。"}],"collocations":["leisure-related activities (レジャー関連のアクティビティ)","leisure-related facilities (レジャー関連の施設)","leisure-related industry (レジャー関連産業)","leisure-related products (レジャー関連製品)","leisure-related services (レジャー関連サービス)"],"synonyms":["recreational","hobby-related","relaxation-based"],"antonyms":["work-related","business-related","professional"],"notes":"Often used to describe industries, activities, products, or services connected to how people spend their free time."}],"etymology":{"value":"Combination of \"leisure\" (free time) and \"related\" (connected to).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈleʒər rɪˌleɪtɪd/","syllables":"lei-sure-re-la-ted"},"inflection":{"notes":"Adjective, does not inflect"},"usage_notes":{"explanation":"'Leisure-related' is used to describe things that are associated with free time and activities done for enjoyment. It is commonly used in business, tourism, and government contexts when discussing industries or policies that cater to people's leisure time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ leisure related activity","correct":"✓ leisure-related activity","note":"The compound adjective is usually hyphenated."}],"priority":"☆☆☆"},"related_words":{"derivatives":["leisure (noun)","related (adjective)"],"related_terms":["recreation","tourism","entertainment","hobby"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, used in specific contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The term 'leisure-related' is a compound adjective used to describe things connected to free time and recreational activities. It is commonly found in formal writing, such as reports, articles, and business documents, where the focus is on industries, services, or policies associated with how people spend their leisure time. Understanding this term is helpful for comprehending discussions about tourism, recreation, and the economic impact of leisure activities."},"example_sentences":[{"sentence":"The city council is promoting leisure-related tourism to boost the local economy.","translation":"市議会は地域経済を活性化させるためにレジャー関連の観光を推進しています。","type":"general","meaning_category":"tourism"},{"sentence":"The company specializes in leisure-related products for outdoor enthusiasts.","translation":"その会社はアウトドア愛好家向けのレジャー関連製品を専門としています。","type":"business","meaning_category":"business"},{"sentence":"Many people are seeking leisure-related activities to reduce stress.","translation":"多くの人々がストレスを軽減するためにレジャー関連のアクティビティを探しています。","type":"general","meaning_category":"general"}]}