{"word":"pronymph","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ギリシア・ローマの)花嫁の付き添い人、花嫁介添人","english_definition":"A bridesmaid or attendant of a bride, especially in ancient Greece and Rome.","examples":[{"sentence":"The pronymph assisted the bride with her wedding preparations.","translation":"花嫁介添人は花嫁の結婚式の準備を手伝った。"},{"sentence":"In ancient Rome, the pronymph played an important role in the wedding ceremony.","translation":"古代ローマでは、花嫁介添人は結婚式で重要な役割を果たした。"}],"collocations":["wedding pronymph","ancient pronymph"],"synonyms":["bridesmaid","maid of honor","attendant"],"antonyms":[]}],"etymology":{"value":"Derived from Greek πρόνυμφος (pronumphos), from πρό (pro, \"before\") + νύμφη (numphē, \"bride\").","priority":"★★★"},"pronunciation":{"ipa":"/ˈproʊnɪmf/","syllables":"pro-nymph"},"inflection":{"noun_plural":"pronymphs"},"usage_notes":{"explanation":"The term \"pronymph\" is primarily used in historical contexts, specifically when referring to the role of bridesmaids or attendants in ancient Greek and Roman weddings. It is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was the pronymph at her friend's wedding last week.","correct":"✓ She was a bridesmaid at her friend's wedding last week.","note":"In modern contexts, \"bridesmaid\" is the more appropriate and commonly used term."}],"priority":"★★☆"},"related_words":{"derivatives":["nymphaeum (a building or room decorated with statues of nymphs)","nymph (a mythological spirit of nature imagined as a beautiful maiden)"],"phrases":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency; primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pronymph\" is a highly specialized term primarily encountered in historical or academic contexts when discussing ancient Greek and Roman wedding customs. It refers to a bridesmaid or attendant of the bride. Due to its rarity and specific usage, it is not part of common vocabulary. Understanding its etymology (Greek origin) can aid in comprehension when encountered in relevant texts."},"example_sentences":[{"sentence":"The historical records detailed the duties of the pronymph during the Roman wedding ceremony.","translation":"歴史的記録は、ローマの結婚式における花嫁介添人の義務を詳述していた。","type":"noun","meaning_category":"花嫁の付き添い人"},{"sentence":"As a pronymph, she helped the bride prepare for the sacred rituals.","translation":"花嫁介添人として、彼女は花嫁が神聖な儀式の準備をするのを手伝った。","type":"noun","meaning_category":"花嫁の付き添い人"}]}