{"word":"Thermits","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"テルミット (アルミニウムと金属酸化物の混合物で、高温反応を起こし溶接などに使用される)","english_definition":"A mixture of aluminum powder and a metal oxide, which produces an exothermic reaction when ignited, used for welding and in incendiary devices.","examples":[{"sentence":"Thermits are used in welding railroad rails.","translation":"テルミットは鉄道のレールを溶接するのに使われます。"},{"sentence":"The thermit reaction produces extremely high temperatures.","translation":"テルミット反応は非常に高い温度を生成します。"}],"collocations":["thermit welding (テルミット溶接)","thermit reaction (テルミット反応)"],"synonyms":["thermite"],"antonyms":[]}],"etymology":{"value":"Thermit is derived from the German word 'Thermit', which was coined by Hans Goldschmidt, who patented the process in 1895. The term is a combination of 'thermo-' (referring to heat) and '-ite' (a suffix used for chemical compounds).","priority":"★★☆"},"pronunciation":{"ipa":"ˈθɜːrmaɪts","syllables":"Ther-mits"},"inflection":{"noun_plural":"Thermits"},"usage_notes":{"explanation":"\"Thermits\" is the plural form of \"thermit,\" referring to multiple instances or types of thermit mixtures. The term is often used in the context of welding, demolition, or pyrotechnics due to the high temperatures generated by the thermit reaction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a thermit for welding.","correct":"✓ He used thermite for welding.","note":"\"Thermite\" is the more common term for the mixture itself. \"Thermits\" is used when referring to multiple instances or types of the mixture."}],"priority":"★★☆"},"related_words":{"derivatives":["thermite (テルミット)","thermic (熱の、熱的な)","exothermic (発熱性の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Thermits\" refers to a mixture of metal powder and metal oxide that produces a lot of heat when it burns. It's often used for welding or in certain types of explosives. This word is technical and not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The engineers used thermits to weld the broken pipeline.","translation":"エンジニアたちは壊れたパイプラインを溶接するためにテルミットを使用した。","type":"noun","meaning_category":"テルミット混合物"},{"sentence":"Thermits are sometimes employed in controlled demolitions.","translation":"テルミットは、時々、制御された解体で使用されます。","type":"noun","meaning_category":"テルミット混合物"}]}