{"word":"feudalizable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"封建化可能な、封建制度を導入できる","english_definition":"Capable of being made feudal; able to have a feudal system imposed or developed.","examples":[{"sentence":"The land was feudalizable due to its dispersed population and lack of central authority.","translation":"その土地は、人口が分散しており、中央の権力がなかったため、封建化可能であった。"}],"collocations":["highly feudalizable","easily feudalizable"],"synonyms":["susceptible to feudalism","liable to feudalization"],"antonyms":["non-feudalizable","resistant to feudalism"]}],"etymology":{"value":"Derived from 'feudalize' (to make feudal) + '-able' (capable of being). 'Feudalize' comes from 'feudal', referring to the feudal system.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfjuːdəlaɪˈzɑːbəl/","syllables":"feu-dal-i-za-ble"},"inflection":{"notes":"Adjective, so it can be modified by adverbs like 'very', 'easily', etc. It doesn't have plural forms."},"usage_notes":{"explanation":"'Feudalizable' is a relatively rare word, primarily used in historical or sociological contexts when discussing the potential for a society or region to develop or adopt a feudal system. It implies that certain conditions or characteristics make it suitable for feudalism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The feudalizable country was already a strong centralized state.","correct":"✓ The country was not feudalizable because it was already a strong centralized state.","note":"Feudalizable implies a lack of central authority. A strong centralized state would be the opposite of a feudalizable condition."}],"priority":"★★☆"},"related_words":{"derivatives":["feudalize (verb)","feudalization (noun)","feudal (adjective)","feudalism (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (very specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Feudalizable' is a specialized term used in historical and sociological contexts. It describes a situation or region that has the characteristics or conditions that would allow a feudal system to develop or be imposed. Understanding this word requires knowledge of what a feudal system entails (decentralized power, land ownership in exchange for service, etc.)."},"example_sentences":[{"sentence":"Historians debated whether the region was truly feudalizable given the existing tribal structures.","translation":"歴史家たちは、既存の部族構造を考えると、その地域が本当に封建化可能であったかどうかについて議論した。","type":"adjective","meaning_category":"封建化可能"},{"sentence":"The lack of strong infrastructure made the area feudalizable, as local lords became the primary authority.","translation":"強力なインフラの欠如は、地方の領主が主要な権力となるにつれて、その地域を封建化可能にした。","type":"adjective","meaning_category":"封建化可能"}]}