{"word":"outskirmish","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(軍事) 小競り合いで相手を出し抜く、打ち負かす","english_definition":"To surpass or defeat in a skirmish or series of skirmishes.","examples":[{"sentence":"Our troops managed to outskirmish the enemy forces along the border.","translation":"我が軍は国境沿いの小競り合いで敵軍を出し抜くことができた。"},{"sentence":"The rebels were able to outskirmish the government forces in the initial stages of the conflict.","translation":"反乱軍は紛争の初期段階で政府軍を小競り合いで打ち負かすことができた。"}],"collocations":["outskirmish the enemy","outskirmish government forces"],"synonyms":["defeat in a skirmish","outmaneuver in a skirmish","rout in a skirmish"],"antonyms":["be outskirmished"],"notes":"This word implies a series of small battles or encounters rather than a single, decisive battle."}],"etymology":{"value":"Formed by adding the prefix 'out-' to 'skirmish'. 'Out-' means 'more than' or 'to surpass', and 'skirmish' refers to a minor fight or battle.","priority":"★★★"},"pronunciation":{"ipa":"/ˌaʊtˈskɜːrmɪʃ/","syllables":"out-skir-mish"},"inflection":{"verb_forms":{"present_simple":["outskirmish","outskirmishes"],"past_simple":"outskirmished","past_participle":"outskirmished","present_participle":"outskirmishing"}},"usage_notes":{"explanation":"'Outskirmish' is primarily used in military contexts to describe a situation where one side gains an advantage over the other through a series of smaller engagements. It suggests tactical superiority in these minor battles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The general planned to outskirmish the entire war.","correct":"✓ The general planned to win the war through a series of outskirmishes.","note":"'Outskirmish' refers to winning individual skirmishes, not an entire war. A series of skirmishes might contribute to winning a war, but the word itself doesn't encompass the whole conflict."}],"priority":"★☆☆"},"related_words":{"derivatives":["skirmish (noun, verb)","outmaneuver (verb)","outwit (verb)"],"related_concepts":["guerilla warfare","tactical advantage","military strategy"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. This word is not commonly used in general conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Outskirmish' is a relatively rare and specialized term, primarily used in military or historical contexts. Understanding its meaning requires familiarity with the concept of 'skirmishes' as minor, often indecisive battles. The prefix 'out-' indicates surpassing or defeating, so 'outskirmish' means to gain an advantage or victory in such engagements. Due to its specific context and infrequent use, it is considered a more advanced vocabulary word."},"example_sentences":[{"sentence":"The smaller, more agile forces were able to consistently outskirmish the larger, less mobile army.","translation":"より小規模で機敏な部隊は、より大規模で機動性の低い軍隊を常に小競り合いで打ち負かすことができた。","type":"verb","meaning_category":"military tactics"},{"sentence":"By carefully planning each encounter, the rebels hoped to outskirmish the better-equipped government troops.","translation":"各遭遇を注意深く計画することで、反乱軍はより装備の整った政府軍を小競り合いで出し抜くことを望んだ。","type":"verb","meaning_category":"military strategy"}]}