{"word":"Indicter","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(law) A person or entity that indicts; one who formally accuses someone of a crime.","english_definition":"A person or body that formally accuses someone of a crime.","examples":[{"sentence":"The grand jury acted as the indicter in the case, bringing charges against the defendant.","translation":"大陪審はその事件において起訴者として機能し、被告に対して告発を行った。"},{"sentence":"As the indicter, the prosecutor presented evidence to support the charges.","translation":"起訴者として、検察官は告発を裏付ける証拠を提示した。"}],"collocations":["grand jury as indicter","prosecutor as indicter","chief indicter","state indicter","federal indicter"],"synonyms":["accuser","prosecutor","arraigner","charger"],"antonyms":["defender","exonerator","acquitter"]}],"etymology":{"value":"Derived from the verb 'indict', which comes from Anglo-French 'enditer' (to accuse formally), from Latin 'indicere' (to announce publicly, proclaim), from 'in-' (in, at, on) + 'dicere' (to say, declare). The suffix '-er' is added to form a noun denoting the person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈdaɪtər/","syllables":"in-dict-er"},"inflection":{"noun_plural":"indicters"},"usage_notes":{"explanation":"'Indicter' is a relatively rare term, typically used in legal contexts. It refers specifically to the party responsible for formally accusing someone of a crime, usually a grand jury or a prosecuting attorney. It emphasizes the act of indictment rather than simply accusing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The victim was the indicter of the crime.","correct":"✓ The victim was the complainant in the case.","note":"The victim is usually the complainant, while the indicter is the entity that brings the formal charges (e.g., a grand jury or prosecutor)."},{"incorrect":"✗ The indicter defended the accused.","correct":"✓ The defense attorney defended the accused.","note":"The indicter is responsible for accusing, not defending. The defense attorney defends the accused."}],"priority":"★★☆"},"related_words":{"derivatives":["indict (verb)","indictment (noun)","indictee (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'indicter' is a specialized legal term referring to the person or body that formally accuses someone of a crime. It is not commonly used in everyday language and is primarily found in legal documents and discussions. Understanding its meaning requires familiarity with legal procedures and terminology. It is closely related to the verb 'indict' and the noun 'indictment.'"},"example_sentences":[{"sentence":"The grand jury served as the indicter, formally accusing the corporation of fraud.","translation":"大陪審は起訴者として機能し、その企業を詐欺罪で正式に告発した。","type":"noun","meaning_category":"legal"},{"sentence":"The chief indicter presented a compelling case to the court, outlining the evidence against the defendant.","translation":"主任起訴者は、被告に対する証拠を概説し、説得力のある事例を裁判所に提示した。","type":"noun","meaning_category":"legal"},{"sentence":"As the indicter, the special prosecutor had the authority to bring charges against high-ranking officials.","translation":"起訴者として、特別検察官は高官に対して告発を行う権限を持っていた。","type":"noun","meaning_category":"legal"}]}