{"word":"Warrenne","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A surname of Norman origin, particularly associated with the Earls of Surrey.","english_definition":"A surname of Norman origin, historically associated with the Earls of Surrey.","examples":[{"sentence":"The Warrenne family played a significant role in English history.","translation":"ウォーレンヌ家はイングランドの歴史において重要な役割を果たした。"},{"sentence":"John de Warrenne was a prominent figure in the 13th century.","translation":"ジョン・ド・ウォーレンヌは13世紀の著名な人物だった。"}],"collocations":["Earl of Warrenne","John de Warrenne","Warrenne family"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Warrenne' originates from a place name in Normandy, France, likely Varenne, meaning 'sandy or gravelly soil'. It was brought to England by the Norman nobility following the Norman Conquest in 1066.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɒrən/","syllables":"Wo-rren"},"inflection":{},"usage_notes":{"explanation":"'Warrenne' is primarily encountered as a historical surname. It is closely linked to the Earls of Surrey, a prominent noble family in medieval England. The name itself is not commonly used in modern contexts outside of historical references.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_names":["Varenne (French place name)"],"historical_titles":["Earl of Surrey"]},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The name 'Warrenne' is primarily encountered in historical contexts, specifically relating to the Earls of Surrey and Norman nobility. Understanding its significance requires familiarity with English medieval history and genealogy. It's not a commonly used name in modern English.","priority":"★☆☆"},"example_sentences":[{"sentence":"William de Warrenne was granted lands by William the Conqueror.","translation":"ウィリアム・ド・ウォーレンヌはウィリアム征服王から土地を授与された。","type":"historical context","meaning_category":"Surname"},{"sentence":"The Warrenne family held considerable power in the north of England.","translation":"ウォーレンヌ家はイングランド北部でかなりの権力を持っていた。","type":"historical context","meaning_category":"Surname"}]}