{"word":"pre-stroke","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"脳卒中前の、脳卒中の兆候がある","english_definition":"relating to the period before a stroke, or exhibiting signs indicative of an impending stroke.","examples":[{"sentence":"The patient exhibited several pre-stroke symptoms, including sudden weakness and slurred speech.","translation":"その患者は、突然の脱力感やろれつが回らないなど、脳卒中の前兆症状をいくつか示していました。"},{"sentence":"Early detection of pre-stroke conditions is crucial for preventing severe damage.","translation":"脳卒中前の状態の早期発見は、重度の損傷を防ぐために非常に重要です。"},{"sentence":"The study focused on identifying pre-stroke biomarkers in blood samples.","translation":"その研究は、血液サンプル中の脳卒中前のバイオマーカーの特定に焦点を当てました。"}],"collocations":["pre-stroke symptoms (脳卒中前の症状)","pre-stroke condition (脳卒中前の状態)","pre-stroke diagnosis (脳卒中前の診断)","pre-stroke treatment (脳卒中前の治療)","pre-stroke care (脳卒中前のケア)","pre-stroke risk factors (脳卒中前の危険因子)"],"synonyms":["prodromal stroke","impending stroke","early-stage stroke","preclinical stroke"],"antonyms":["post-stroke","recovery phase","stroke-free"]},{"part_of_speech":"noun","definition":"脳卒中の前兆、脳卒中発症前の状態","english_definition":"the period or state before a stroke occurs, often characterized by subtle or transient symptoms.","examples":[{"sentence":"Recognizing the pre-stroke is vital for timely intervention.","translation":"脳卒中の前兆を認識することは、タイムリーな介入のために不可欠です。"},{"sentence":"Many patients ignore the pre-stroke, mistaking it for something less serious.","translation":"多くの患者は脳卒中の前兆を無視し、それほど深刻ではないものと勘違いしています。"},{"sentence":"Research aims to improve the identification and management of the pre-stroke.","translation":"研究は、脳卒中の前兆の特定と管理を改善することを目的としています。"}],"collocations":["experience a pre-stroke (脳卒中の前兆を経験する)","recognize a pre-stroke (脳卒中の前兆を認識する)","ignore a pre-stroke (脳卒中の前兆を無視する)","treat a pre-stroke (脳卒中の前兆を治療する)","manage a pre-stroke (脳卒中の前兆を管理する)"],"synonyms":["prodromal phase","early stages of stroke","impending stroke state","preclinical phase"],"antonyms":["post-stroke phase","stroke recovery","stroke-free state"]}],"etymology":{"value":"'Pre-' (before) + 'stroke' (a sudden interruption of the blood supply to the brain).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpriːˌstroʊk/","syllables":"pre-stroke"},"inflection":{"notes":"The term 'pre-stroke' can function as both an adjective and a noun. As an adjective, it modifies nouns related to the period or state before a stroke. As a noun, it refers to the pre-stroke period or state itself. Plural form is 'pre-strokes' when referring to multiple instances or types of pre-stroke conditions."},"usage_notes":{"explanation":"'Pre-stroke' refers to the period or condition preceding a full-blown stroke. Recognizing and addressing pre-stroke symptoms is crucial for preventing or mitigating the severity of a stroke. The term is commonly used in medical contexts, research, and patient education.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a pre stroke last week.","correct":"✓ He had a pre-stroke condition last week. / ✓ He experienced pre-stroke symptoms last week.","note":"'Pre-stroke' is a state or condition, not an event. Use 'pre-stroke condition' or 'pre-stroke symptoms' to describe the experience. Alternatively, one could say 'He had signs of a pre-stroke last week.'"},{"incorrect":"✗ The pre stroke patient was monitored closely.","correct":"✓ The pre-stroke patient was monitored closely. / ✓ The patient with pre-stroke symptoms was monitored closely.","note":"While 'pre-stroke patient' is understandable, it's more precise to say 'patient with pre-stroke symptoms' or 'patient in a pre-stroke state' to avoid implying the patient has already had a stroke."}],"priority":"★★☆"},"related_words":{"derivatives":["prestroke (less common, hyphenated form is preferred)"],"phrasal_verbs":[],"related_terms":["TIA (Transient Ischemic Attack)","stroke","ischemia","hemorrhage","cerebrovascular disease","risk factors for stroke","stroke prevention","FAST (Face, Arm, Speech, Time) - stroke recognition acronym"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pre-stroke' is a medical term referring to the period or condition preceding a full stroke. It is crucial in medical contexts for early detection and intervention to prevent severe damage. Understanding this term requires a good grasp of medical terminology and concepts related to cerebrovascular diseases. It is typically used by healthcare professionals and in medical literature.","priority":"★★☆"},"example_sentences":[{"sentence":"The goal of the intervention is to prevent the pre-stroke from progressing to a full stroke.","translation":"介入の目的は、脳卒中の前兆が本格的な脳卒中に進行するのを防ぐことです。","type":"noun","meaning_category":"condition"},{"sentence":"The doctors are studying pre-stroke indicators to improve early diagnosis.","translation":"医師たちは、早期診断を改善するために脳卒中前の指標を研究しています。","type":"adjective","meaning_category":"relating to"},{"sentence":"If you suspect a pre-stroke, seek immediate medical attention.","translation":"脳卒中の前兆が疑われる場合は、直ちに医療機関を受診してください。","type":"noun","meaning_category":"condition"},{"sentence":"Lifestyle changes can significantly reduce pre-stroke risk factors.","translation":"ライフスタイルの変化は、脳卒中前の危険因子を大幅に減らすことができます。","type":"adjective","meaning_category":"relating to"}]}