{"word":"pasture-raised","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"放牧で育てられた、牧草地飼育の","english_definition":"(of livestock) raised on pasture, allowing them to roam and graze freely.","examples":[{"sentence":"Pasture-raised beef is often considered to be healthier than grain-fed beef.","translation":"放牧で育てられた牛肉は、穀物飼育の牛肉よりも健康的であると考えられがちです。"},{"sentence":"We only buy pasture-raised eggs because the chickens are treated more humanely.","translation":"私たちは放牧卵しか買いません。なぜなら、鶏がより人道的に扱われているからです。"},{"sentence":"The farm specializes in pasture-raised lamb.","translation":"その農場は放牧ラムに特化しています。"}],"collocations":["pasture-raised beef (放牧牛肉)","pasture-raised chicken (放牧鶏)","pasture-raised eggs (放牧卵)","pasture-raised pork (放牧豚肉)","pasture-raised lamb (放牧ラム)","pasture-raised dairy (放牧乳製品)"],"synonyms":["grass-fed","free-range","pastured","outdoor-reared"],"antonyms":["grain-fed","factory-farmed","confined"],"notes":"The term 'pasture-raised' implies that animals have access to pasture and are allowed to graze naturally, which is often associated with better animal welfare and potentially healthier products."}],"etymology":{"value":"A compound word formed by combining 'pasture' (a field covered with grass or other plants used for grazing by livestock) and 'raised' (brought up or reared).","priority":"★★★"},"pronunciation":{"ipa":"/ˈpæstʃərˌreɪzd/","syllables":"pas-ture-raised"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms like verbs or nouns."},"usage_notes":{"explanation":"'Pasture-raised' is a term used to describe livestock that are raised on pasture, where they can roam freely and graze on grass and other vegetation. This method of farming is often contrasted with concentrated animal feeding operations (CAFOs), where animals are confined to small spaces and fed grain-based diets. The term is often used in marketing to appeal to consumers who are concerned about animal welfare and the environmental impact of food production.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The meat is raised pasture.","correct":"✓ The meat is pasture-raised.","note":"'Pasture-raised' is a compound adjective. The correct construction is 'pasture-raised meat' or 'the meat is pasture-raised'."},{"incorrect":"✗ Pasture raised is the same as organic.","correct":"✓ Pasture-raised is not necessarily the same as organic.","note":"While pasture-raised animals may be raised organically, the terms are not interchangeable. 'Organic' refers to specific farming practices, while 'pasture-raised' refers to the animals' access to pasture."}],"priority":"★★☆"},"related_words":{"derivatives":["pasture (noun)","raised (verb)"],"related_terms":["grass-fed","free-range","organic","sustainable agriculture","regenerative agriculture"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but increasing in usage due to growing interest in sustainable and ethical food production.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'pasture-raised' describes a specific method of raising livestock where animals are allowed to graze freely on pasture. This contrasts with more intensive farming methods where animals are confined. The term is often used in the context of food labeling and marketing, appealing to consumers interested in animal welfare and sustainable agriculture. Understanding this term requires familiarity with different farming practices and consumer trends related to food production."},"example_sentences":[{"sentence":"Consumers are increasingly seeking out **pasture-raised** chicken due to concerns about animal welfare.","translation":"消費者は、動物福祉への懸念から、放牧鶏肉を求めるようになっています。","type":"adjective","meaning_category":"放牧飼育"},{"sentence":"The **pasture-raised** eggs had richer yolks and a more intense flavor.","translation":"放牧卵は、濃厚な黄身とより強い風味を持っていました。","type":"adjective","meaning_category":"放牧飼育"},{"sentence":"The farmer explained the benefits of **pasture-raised** farming for the environment.","translation":"農家は、環境に対する放牧飼育の利点を説明しました。","type":"adjective","meaning_category":"放牧飼育"}]}