{"word":"Parian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"パロス島産の、パロス島風の","english_definition":"Of or relating to Paros, a Greek island in the Aegean Sea, or to its inhabitants or culture.","examples":[{"sentence":"Parian marble is known for its fine grain and pure white color.","translation":"パロス産の大理石は、そのきめ細かさと純粋な白色で知られています。"},{"sentence":"The sculptor used Parian marble to create the statue.","translation":"彫刻家はパロス産の大理石を使って彫像を作りました。"}],"collocations":["Parian marble","Parian ware"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"パロス島産の大理石","english_definition":"A fine white marble from the island of Paros, used for sculpture.","examples":[{"sentence":"The Venus de Milo is made of Parian marble.","translation":"ミロのヴィーナスはパロス産の大理石でできています。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"パロス焼：パロス島産の大理石に似せて作った磁器","english_definition":"A type of fine, unglazed porcelain resembling Parian marble.","examples":[{"sentence":"She collected Parian ware figurines.","translation":"彼女はパロス焼の置物を集めていました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Paros, a Greek island in the Aegean Sea, famous for its fine white marble.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɛəriən/","syllables":"Pa-ri-an"},"inflection":{},"usage_notes":{"explanation":"'Parian' primarily refers to things originating from or resembling the island of Paros, especially its marble. It can be used as an adjective or a noun. When used as a noun, it can refer to the marble itself or to a type of porcelain that imitates the marble's appearance.","priority":"★★☆"},"common_mistakes":{},"related_words":["Paros"],"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Parian' is a relatively uncommon word, mainly used in contexts related to art, sculpture, and classical history. It refers to the island of Paros and, more specifically, to the fine white marble quarried there. It can also refer to a type of porcelain that imitates this marble. Understanding its meaning requires some familiarity with classical art and materials."},"example_sentences":[{"sentence":"The museum displayed several sculptures crafted from **Parian** marble.","translation":"博物館には、パロス産の大理石で作られた彫刻がいくつか展示されていました。","type":"adjective","meaning_category":"パロス島産の"},{"sentence":"Many classical statues are made of **Parian**.","translation":"多くの古典的な彫像はパロス産の大理石でできています。","type":"noun","meaning_category":"パロス産の大理石"},{"sentence":"She admired the delicate detail of the **Parian** figurine.","translation":"彼女はパロス焼の置物の繊細なディテールに感心しました。","type":"noun","meaning_category":"パロス焼"}]}