{"word":"conditotoria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A place for preserving and seasoning food, especially fruit.","english_definition":"A place or room used for preserving and seasoning food, particularly fruit; a type of pantry or storage area.","examples":[{"sentence":"The conditotoria was filled with jars of pickled peaches and spiced apples.","translation":"保存室は、桃のピクルスやスパイスで味付けされたリンゴの瓶でいっぱいでした。","notes":"Illustrates the use of the conditotoria for storing preserved fruits."},{"sentence":"In medieval castles, the conditotoria was essential for preparing food for the winter months.","translation":"中世の城では、冬の数ヶ月のために食料を準備するために保存室が不可欠でした。","notes":"Highlights the historical significance of the conditotoria."}],"collocations":["fruit conditotoria","medieval conditotoria","castle conditotoria","preserve in the conditotoria","store in the conditotoria"],"synonyms":["pantry","larder","storehouse","cellar","fruitery"],"antonyms":[]}],"etymology":{"value":"Derived from Late Latin 'conditorium,' meaning 'a place for preserving,' which comes from 'condire,' meaning 'to season, pickle, or preserve.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒndɪtəˈtɔːriə/","syllables":"con-di-to-to-ri-a"},"inflection":{"noun_plural":"conditotoriae (rarely used)"},"usage_notes":{"explanation":"The term 'conditotoria' is primarily historical and refers to a specific type of food storage area used in the past, particularly for preserving fruits and other foods through methods like pickling and spicing. It is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She put the milk in the conditotoria.","correct":"✓ She put the milk in the refrigerator / pantry.","note":"Use 'refrigerator' or 'pantry' for modern food storage."}],"priority":"★☆☆"},"related_words":{"derivatives":["conditory (related to confectionery)","condiment (something used to season food)"],"phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency; primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'conditotoria' is a rare and specialized term, primarily encountered in historical contexts relating to food preservation. It refers to a specific type of storage area, akin to a pantry or cellar, used for preserving and seasoning food, especially fruits. Due to its limited usage, it is unlikely to be familiar to most modern English speakers."},"example_sentences":[{"sentence":"The archaeologist discovered the remains of a conditotoria during the excavation of the medieval castle.","translation":"考古学者は、中世の城の発掘中に保存室の遺跡を発見しました。","type":"noun","meaning_category":"historical food storage"},{"sentence":"Historical texts describe the conditotoria as a cool, dark room perfect for preserving fruits and vegetables.","translation":"歴史的な文献では、保存室は果物や野菜を保存するのに最適な涼しく暗い部屋として説明されています。","type":"noun","meaning_category":"historical food storage"}]}