{"word":"Macau","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"マカオ (中華人民共和国の特別行政区)","english_definition":"A Special Administrative Region of the People's Republic of China, located on the western side of the Pearl River estuary.","examples":[{"sentence":"Macau is known for its casinos and luxury hotels.","translation":"マカオはカジノや高級ホテルで知られています。"},{"sentence":"I visited Macau last year and enjoyed the blend of Portuguese and Chinese cultures.","translation":"昨年マカオを訪れ、ポルトガルと中国の文化が混ざり合っているのを楽しんだ。"}],"collocations":["visit Macau","travel to Macau","Macau casino","Macau economy","Macau government"],"synonyms":["Aomen (pinyin)"],"antonyms":[]},{"part_of_speech":"proper noun","definition":"マカオ (都市)","english_definition":"The name of the city located within the Macau Special Administrative Region.","examples":[{"sentence":"The old city of Macau is a UNESCO World Heritage Site.","translation":"マカオの旧市街はユネスコの世界遺産に登録されています。"},{"sentence":"Macau is a vibrant city with a rich history.","translation":"マカオは豊かな歴史を持つ活気のある都市です。"}],"collocations":["Macau city","Macau peninsula","Macau tourism"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'A-Ma-Gao' (媽閣), the name of a temple dedicated to the sea goddess Mazu. The Portuguese, upon arriving in the area, inquired about the place name and were given this name, which they then adopted as 'Macau'.","priority":"★★★"},"pronunciation":{"ipa":"/məˈkaʊ/","syllables":"Ma-cau"},"inflection":{"notes":"It is a proper noun, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Macau' refers to both the Special Administrative Region (SAR) of China and the city within it. When discussing the region's government, economy, or overall statistics, 'Macau' refers to the SAR. When discussing specific places, attractions, or the city's atmosphere, 'Macau' refers to the city itself.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Macau is a country.","correct":"✓ Macau is a Special Administrative Region of China.","note":"Macau is not an independent country but a Special Administrative Region of China."},{"incorrect":"✗ Macao","correct":"✓ Macau","note":"The correct spelling is 'Macau', although 'Macao' is sometimes seen."}],"priority":"★★☆"},"related_words":{"derivatives":["Macanese (adjective/noun: relating to Macau or its people)"],"phrases":["Macau SAR (Macau Special Administrative Region)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively frequent, especially in travel and business contexts.","priority":"★★☆"},"readability_explanation":{"level":"B1","text":"'Macau' is a proper noun referring to a region and city in China. It's known for its unique blend of Portuguese and Chinese cultures, as well as its casinos. When you read about 'Macau', it usually means the place itself, its history, or its attractions. It's important to remember that Macau is a Special Administrative Region of China, not an independent country."},"example_sentences":[{"sentence":"Many tourists visit **Macau** to gamble.","translation":"多くの観光客がギャンブルをするためにマカオを訪れます。","type":"noun","meaning_category":"place"},{"sentence":"The economy of **Macau** relies heavily on tourism.","translation":"マカオの経済は観光に大きく依存しています。","type":"noun","meaning_category":"region"},{"sentence":"I enjoyed exploring the historic center of **Macau**.","translation":"マカオの歴史的中心部を探索するのを楽しんだ。","type":"noun","meaning_category":"city"},{"sentence":"The **Macanese** cuisine is a unique fusion of Portuguese and Chinese flavors.","translation":"マカオ料理は、ポルトガルと中国の味が融合した独特の料理です。","type":"adjective","meaning_category":"related"}]}