{"word":"Banting","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"バンティング：19世紀にウィリアム・バンティングが提唱した、炭水化物の摂取を制限するダイエット法。また、そのダイエット法を実践すること。","english_definition":"A low-carbohydrate, high-fat diet popularized in the 19th century by William Banting; the practice of following this diet.","examples":[{"sentence":"She's been on the Banting diet for three months and has lost a significant amount of weight.","translation":"彼女はバンティングダイエットを3ヶ月続けており、かなりの体重を減らしました。"},{"sentence":"Banting involves cutting out sugary and starchy foods.","translation":"バンティングは、砂糖やデンプン質の食品を排除することを含みます。"}],"collocations":["Banting diet","on the Banting diet","Banting recipes"],"synonyms":["low-carb diet","ketogenic diet"],"antonyms":["high-carb diet"]},{"part_of_speech":"proper noun","definition":"バンティング：姓。","english_definition":"A surname.","examples":[{"sentence":"Sir Frederick Banting was a Canadian medical scientist and Nobel laureate known for co-discovering insulin.","translation":"フレデリック・バンティング卿は、インスリンの共同発見者として知られるカナダの医学者であり、ノーベル賞受賞者でした。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after William Banting (1796–1878), a British undertaker who popularized the diet in his \"Letter on Corpulence, Addressed to the Public\" (1863).","priority":"★★★"},"pronunciation":{"ipa":"/ˈbæntɪŋ/","syllables":"Ban-ting"},"inflection":{},"usage_notes":{"explanation":"The term \"Banting\" can refer to the diet itself or the act of following the diet. It is often used interchangeably with \"low-carb diet,\" although Banting specifically refers to the principles outlined by William Banting in the 19th century.","priority":"★★☆"},"common_mistakes":{},"related_words":["Bant (verb, obsolete): to fatten (animals)"],"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term \"Banting\" refers to a specific historical low-carbohydrate diet. Understanding its origin and context requires familiarity with 19th-century dietary trends and the figure of William Banting. The term is not commonly used in everyday conversation, but may appear in discussions about dieting or historical medical practices."},"example_sentences":[{"sentence":"Many people have found success with the Banting diet for weight loss.","translation":"多くの人が、減量のためにバンティングダイエットで成功を収めています。","type":"noun","meaning_category":"Diet"},{"sentence":"The Banting method emphasizes whole, unprocessed foods.","translation":"バンティング法は、未加工の全食品を重視します。","type":"noun","meaning_category":"Diet"},{"sentence":"Dr. Banting's discovery revolutionized diabetes treatment.","translation":"バンティング博士の発見は、糖尿病治療に革命をもたらしました。","type":"proper noun","meaning_category":"Surname"}]}