{"word":"Skystone","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"ターコイズ（トルコ石）のネイティブアメリカンによる呼び名。特に、神聖な意味合いを持つ場合に用いられる。","english_definition":"A Native American term for turquoise, especially when referring to its sacred or spiritual significance.","examples":[{"sentence":"The Navajo silversmith carefully set the skystone into the intricate design.","translation":"ナバホ族の銀細工職人は、複雑なデザインの中に慎重にスカイストーンをはめ込んだ。"},{"sentence":"For many tribes, the skystone represents a connection to the heavens and the earth.","translation":"多くの部族にとって、スカイストーンは天と地とのつながりを表している。"},{"sentence":"The elder shared stories of how the skystone was used in ancient ceremonies.","translation":"長老は、スカイストーンが古代の儀式でどのように使われていたかの物語を語った。"}],"collocations":["sacred skystone (神聖なスカイストーン)","Navajo skystone (ナバホのスカイストーン)","skystone jewelry (スカイストーンの宝石)","skystone mine (スカイストーンの鉱山)"],"synonyms":["turquoise"],"antonyms":[]}],"etymology":{"value":"「sky（空）」と「stone（石）」の組み合わせ。ターコイズの色が空の色に似ていることから、ネイティブアメリカンによって名付けられた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskaɪˌstoʊn/","syllables":"sky-stone"},"inflection":{"noun_plural":"skystones"},"usage_notes":{"explanation":"「**Skystone**」は、主にアメリカ南西部のネイティブアメリカン文化において、ターコイズ（トルコ石）を指す言葉として用いられます。単に鉱物としてのターコイズを指すだけでなく、その石が持つ神聖な意味合いや、文化的な重要性を強調する際に使われることが多いです。部族によっては、ターコイズは天と地を結ぶ象徴とされ、儀式や装飾品に用いられてきました。そのため、「skystone」という言葉は、単なる宝石名を超えた、深い文化的背景を持つ言葉として理解する必要があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a skystone ring at the museum, but it was made of plastic.","correct":"✓ I bought a turquoise ring at the museum, but it was made of plastic.","note":"「Skystone」はターコイズ（トルコ石）を指す言葉であり、プラスチックのような模造品には使いません。模造品の場合は「turquoise-colored ring」などと表現します。"},{"incorrect":"✗ All blue stones are skystones.","correct":"✓ Not all blue stones are skystones. Skystone specifically refers to turquoise.","note":"すべての青い石がスカイストーン（ターコイズ）であるわけではありません。スカイストーンは特定の鉱物であるターコイズのみを指します。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["turquoise","Navajo","Zuni","Native American jewelry","sacred stone","spiritual stone"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 特定の文化圏や文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Skystone**」は、ネイティブアメリカンの文化においてターコイズ（トルコ石）を指す言葉で、特にその石が持つ神聖な意味合いを強調する際に使われます。一般的な英語の語彙ではなく、特定の文化的な背景を持つ専門用語であるため、ネイティブアメリカンの文化や宝石、鉱物に関する知識がないと理解が難しい場合があります。この言葉は、単なる石の名前を超えて、文化的な価値観や精神性を象徴する言葉として使われていることを理解することが重要です。"},"example_sentences":[{"sentence":"The medicine man wore a necklace adorned with skystones.","translation":"呪術医はスカイストーンで飾られたネックレスを身に着けていた。","type":"noun","meaning_category":"ターコイズ（トルコ石）"},{"sentence":"The Hopi people believe the skystone brings rain and prosperity.","translation":"ホピ族は、スカイストーンが雨と繁栄をもたらすと信じている。","type":"noun","meaning_category":"ターコイズ（トルコ石）"},{"sentence":"She learned about the significance of the skystone in Navajo art.","translation":"彼女はナバホ族の芸術におけるスカイストーンの重要性について学んだ。","type":"noun","meaning_category":"ターコイズ（トルコ石）"}]}