{"word":"tufa","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"石灰華、石灰質凝灰岩","english_definition":"A porous rock composed of calcium carbonate, formed by precipitation from solution in ground and surface waters at ambient temperature.","examples":[{"sentence":"The Mono Lake tufa towers are a unique geological formation.","translation":"モノ湖の石灰華の塔は、独特な地質学的構造である。"},{"sentence":"Tufa is often found near hot springs and alkaline lakes.","translation":"石灰華は、温泉やアルカリ性湖の近くでよく見られる。"}],"collocations":["tufa tower","calcareous tufa","Mono Lake tufa"],"synonyms":["calcareous sinter","travertine (related, but denser)"],"antonyms":[]}],"etymology":{"value":"イタリア語の'tufo'（凝灰岩、石灰華）から。ラテン語の'tophus'（多孔質の石）に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtuːfə/","syllables":"tu-fa"},"inflection":{"noun_plural":"tufas"},"usage_notes":{"explanation":"Tufa is a specific type of limestone that forms in relatively low-temperature environments, often where calcium-rich spring water emerges into a lake or stream. It is characterized by its porous and often irregular structure. It is distinct from travertine, which is also a form of calcium carbonate but is denser and forms in hot spring environments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The walls were made of tuffa.","correct":"✓ The walls were made of tufa.","note":"'Tufa' and 'tuff' are different rocks. Tufa is a form of limestone, while tuff is a volcanic rock."}],"priority":"★★☆"},"related_words":{"derivatives":["tufaceous (adjective: 石灰華質の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"低頻度 (Low frequency) - 地質学や地理学の文脈で使われる専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tufa' is a geological term referring to a porous rock made of calcium carbonate. It forms when calcium-rich water precipitates, often around springs or lakes. Understanding this term requires some familiarity with geological processes and vocabulary. It's not commonly used outside of scientific or geographical contexts."},"example_sentences":[{"sentence":"The strange formations at the lake shore were identified as **tufa**.","translation":"湖岸の奇妙な地形は石灰華であると特定された。","type":"noun","meaning_category":"石灰華"},{"sentence":"The chemical composition of the **tufa** provides clues about the lake's past environment.","translation":"石灰華の化学組成は、湖の過去の環境に関する手がかりを提供する。","type":"noun","meaning_category":"石灰華"}]}