{"word":"suably","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"In a manner that is liable to be sued; in a way that makes one subject to legal action.","english_definition":"In a manner that is liable to be sued; in a way that makes one subject to legal action.","examples":[{"sentence":"The company acted suably when it knowingly released a defective product.","translation":"その会社は、欠陥のある製品を故意に発売したため、訴えられるような行動をとった。"},{"sentence":"He behaved suably by making defamatory statements about his competitor.","translation":"彼は競争相手について中傷的な発言をしたため、訴えられるような振る舞いをした。"}],"collocations":[],"synonyms":["legally vulnerable","actionably","indictably"],"antonyms":["legally safe","unimpeachably"]}],"etymology":{"value":"Derived from 'suable,' meaning 'liable to be sued,' with the addition of the adverbial suffix '-ly.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsuːəbli/","syllables":"su-a-bly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Suably' is used to describe actions or behaviors that create a legal risk or liability for the person or entity performing them. It implies that the actions could reasonably lead to a lawsuit.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The situation was suable for the company.","correct":"✓ The company acted suably in that situation.","note":"'Suably' is an adverb and modifies a verb, not a noun. Use it to describe how someone acted, not to describe a situation."}],"priority":"★★☆"},"related_words":{"derivatives":["sue","suable","suability"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Not commonly used in everyday conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Suably' is a relatively uncommon adverb used in legal or formal contexts. It describes actions that are likely to result in a lawsuit. Understanding its meaning requires familiarity with legal concepts."},"example_sentences":[{"sentence":"The contractor behaved suably by failing to meet the safety standards outlined in the contract.","translation":"請負業者は契約に定められた安全基準を満たさなかったため、訴えられるような行動をとった。","type":"adverb","meaning_category":"Liable to be sued"},{"sentence":"The advertisement was worded so suably that the company quickly retracted it to avoid legal repercussions.","translation":"その広告は訴えられるような言葉遣いだったので、会社は法的影響を避けるためにすぐに取り下げた。","type":"adverb","meaning_category":"Liable to be sued"}]}