{"word":"Unisonance","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(音楽)完全な一致、ユニゾン、斉唱","english_definition":"A state of perfect consonance or agreement; a condition of sounding or singing the same note or melody at the same time.","examples":[{"sentence":"The choir sang in unisonance, creating a powerful sound.","translation":"聖歌隊はユニゾンで歌い、力強いサウンドを作り出した。"},{"sentence":"The dancers moved in perfect unisonance.","translation":"ダンサーたちは完璧なユニゾンで動いた。"},{"sentence":"The orchestra achieved a beautiful unisonance in the final chord.","translation":"オーケストラは最後の和音で美しいユニゾンを達成した。"}],"collocations":["perfect unisonance","achieve unisonance","sing in unisonance","dance in unisonance"],"synonyms":["unison","harmony","agreement","concord","accord"],"antonyms":["dissonance","discord","disharmony"]}],"etymology":{"value":"Derived from 'unison,' with an added suffix to denote a state or condition. 'Unison' comes from Latin 'unisonus,' meaning 'having the same sound,' from 'unus' (one) + 'sonus' (sound).","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈnɪsənəns/","syllables":"u-ni-so-nance"},"inflection":{"noun_plural":"unisonances"},"usage_notes":{"explanation":"'Unisonance' specifically refers to the state or quality of being in unison. While 'unison' can refer to the act or instance of singing or playing the same note, 'unisonance' emphasizes the resulting harmony or agreement. It is less commonly used than 'unison' but highlights the harmonious effect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The team worked in unison, showing great unisonance.","correct":"✓ The team worked in unison, showing great unity.","note":"While 'unison' describes the manner of working together, 'unity' better describes the overall state of agreement and cooperation."},{"incorrect":"✗ The unisonance of their voices was dissonant.","correct":"✓ The sound of their voices was dissonant.","note":"'Unisonance' implies harmony, so it cannot be dissonant. Dissonance is the opposite of unisonance."}],"priority":"★★☆"},"related_words":{"derivatives":["unison (noun)","unisonous (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unisonance' is a relatively uncommon word that describes the state of being in perfect agreement or harmony, particularly in music. It's related to the more common word 'unison,' but emphasizes the quality or state of harmonious agreement rather than the act itself. Understanding this word requires a strong vocabulary and familiarity with musical terms."},"example_sentences":[{"sentence":"The **unisonance** of their voices created a powerful and moving effect.","translation":"彼らの声のユニゾンは、力強く感動的な効果を生み出した。","type":"noun","meaning_category":"音楽"},{"sentence":"The dancers moved with such precision that their performance was a study in **unisonance**.","translation":"ダンサーたちは非常に正確に動き、彼らのパフォーマンスはユニゾンの研究となった。","type":"noun","meaning_category":"一般的な調和"}]}