{"word":"trepanningly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"In a manner relating to or involving trepanning (also known as trepanation or burr holing), which is a surgical intervention in which a hole is drilled or scraped into the human skull.","english_definition":"In a manner relating to or involving trepanning.","examples":[{"sentence":"The surgeon described the procedure, explaining how the skull was trepanningly accessed.","translation":"外科医は手術の手順を説明し、頭蓋骨にどのように穿頭的にアクセスするかを説明した。"},{"sentence":"The ancient remains showed evidence of a skull that had been trepanningly treated.","translation":"古代の遺跡は、頭蓋骨が穿頭的に治療された証拠を示していた。"}],"collocations":["trepanningly accessed","trepanningly treated","trepanningly performed"],"synonyms":["surgically","cranially","perforatively"],"antonyms":[]}],"etymology":{"value":"Derived from 'trepanning' (the act of performing trepanation) + '-ly' (suffix forming adverbs). 'Trepanning' comes from 'trepan,' a surgical instrument used in the procedure, which ultimately comes from Greek 'trypanon' (borer).","priority":"★★☆"},"pronunciation":{"ipa":"/trɪˈpænɪŋli/","syllables":"tre-pan-ning-ly"},"inflection":{"notes":"Adverb, so no plural forms or conjugations."},"usage_notes":{"explanation":"The adverb 'trepanningly' is quite rare and specific. It is used to describe actions or processes that are done in a way that involves trepanning. Because trepanning is a specific surgical procedure, the use of 'trepanningly' is limited to medical or historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist created a trepanningly beautiful sculpture.","correct":"✓ The artist created a strikingly beautiful sculpture.","note":"'Trepanningly' should not be used metaphorically to describe something striking or surprising. It is strictly related to the surgical procedure of trepanning."}],"priority":"★★☆"},"related_words":{"derivatives":["trepan (noun, verb)","trepanation (noun)","trepanned (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'trepanningly' is highly specialized and technical, related to a specific surgical procedure. It is unlikely to be encountered outside of medical or historical texts, and its use requires a solid understanding of the procedure of trepanning itself."},"example_sentences":[{"sentence":"The skull was trepanningly opened to relieve pressure on the brain.","translation":"脳への圧力を軽減するために、頭蓋骨は穿頭的に開けられた。","type":"adverb","meaning_category":"surgical procedure"},{"sentence":"Archaeological evidence suggests that some ancient cultures trepanningly modified skulls for ritualistic purposes.","translation":"考古学的証拠は、古代文化の中には儀式的な目的のために頭蓋骨を穿頭的に修正したものが存在することを示唆している。","type":"adverb","meaning_category":"historical practice"}]}