{"word":"Joint-stockism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"株式会社制度","english_definition":"An economic system or theory that advocates for the organization of businesses as joint-stock companies, where ownership is divided into shares of stock.","examples":[{"sentence":"Joint-stockism allowed for the accumulation of capital necessary for large-scale enterprises.","translation":"株式会社制度は、大規模な企業に必要な資本の蓄積を可能にした。"},{"sentence":"The rise of joint-stockism transformed the landscape of global trade.","translation":"株式会社制度の台頭は、グローバル貿易の様相を一変させた。"}],"collocations":["promote joint-stockism","the principles of joint-stockism","the benefits of joint-stockism"],"synonyms":["corporate capitalism","shareholder capitalism"],"antonyms":["sole proprietorship","partnership"]}],"etymology":{"value":"Derived from 'joint-stock' (referring to the combined capital of multiple investors) + '-ism' (denoting a system or ideology).","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʒɔɪntˌstɒkˌɪzəm/","syllables":"joint-stock-i-sm"},"inflection":{"noun_plural":"None (typically used as an uncountable noun)"},"usage_notes":{"explanation":"'Joint-stockism' is primarily used in historical or theoretical contexts to discuss the development and impact of the joint-stock company as a form of business organization. It emphasizes the economic and social implications of this system, particularly its role in facilitating investment and economic growth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The government is planning to joint-stockism the industry.","correct":"✓ The government is planning to promote joint-stockism in the industry.","note":"'Joint-stockism' is a noun, referring to the system itself. Use verbs like 'promote', 'encourage', or 'implement' to describe actions related to it."}],"priority":"★★☆"},"related_words":{"derivatives":["joint-stock (adjective)","stockholder","shareholder","corporation"],"related_concepts":["capitalism","free market","investment","economic growth"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in academic or specialized discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Joint-stockism' is a term used to describe the economic system based on joint-stock companies. This system allows many investors to pool their resources by buying shares of a company, enabling large-scale projects. Understanding this term requires knowledge of economics and business history."},"example_sentences":[{"sentence":"The advent of joint-stockism in the 17th century spurred colonial expansion.","translation":"17世紀における株式会社制度の出現は、植民地拡大を促進した。","type":"general","meaning_category":"historical context"},{"sentence":"Critics of joint-stockism often point to the potential for corporate greed and exploitation.","translation":"株式会社制度の批判者は、しばしば企業の強欲と搾取の可能性を指摘する。","type":"critical analysis","meaning_category":"economic theory"},{"sentence":"Joint-stockism facilitated the development of railroads and other infrastructure projects.","translation":"株式会社制度は、鉄道やその他のインフラプロジェクトの開発を促進した。","type":"economic impact","meaning_category":"economic development"}]}