{"word":"nonrigid","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"剛性でない、非剛体の、柔軟な、変形可能な","english_definition":"Not rigid; capable of being bent or deformed; flexible.","examples":[{"sentence":"The nonrigid structure allowed for some movement without breaking.","translation":"その非剛体構造は、破損することなくある程度の動きを可能にした。"},{"sentence":"Nonrigid materials are often used in clothing to provide comfort and flexibility.","translation":"非剛体材料は、快適さと柔軟性を提供するために、衣類によく使用される。"},{"sentence":"The model used nonrigid registration to align the images.","translation":"そのモデルは、画像を整列させるために非剛体レジストレーションを使用した。"}],"collocations":["nonrigid body (非剛体)","nonrigid material (非剛体材料)","nonrigid transformation (非剛体変換)","nonrigid registration (非剛体レジストレーション)"],"synonyms":["flexible","pliable","malleable","deformable","elastic"],"antonyms":["rigid","stiff","inflexible"]}],"etymology":{"value":"'Non-' (否定の接頭辞) + 'rigid'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈrɪdʒɪd/","syllables":"non-ri-gid"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Nonrigid' is primarily used in scientific and technical contexts to describe objects or systems that are not stiff or fixed in shape. It is often used in contrast to 'rigid' to highlight the ability of something to change shape or bend. In computer science, it is often used in the context of image processing and computer vision.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonrigid decision was made by the committee.","correct":"✓ The flexible decision was made by the committee.","note":"'Nonrigid' refers to physical properties, not abstract concepts like decisions. Use 'flexible' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["nonrigidity (noun): the state of being nonrigid"],"antonyms":["rigid"],"related_terms":["rigid body","elasticity","deformation"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonrigid\" is a technical term primarily used in scientific and engineering contexts. It describes something that is not stiff or fixed in shape, meaning it can bend, deform, or change its form. It is the opposite of \"rigid.\" Understanding this word requires a familiarity with technical or scientific vocabulary related to material properties and mechanics."},"example_sentences":[{"sentence":"The robot's **nonrigid** arm allowed it to navigate the complex terrain.","translation":"そのロボットの非剛体アームは、複雑な地形を移動することを可能にした。","type":"adjective","meaning_category":"flexible"},{"sentence":"**Nonrigid** image registration is essential for medical imaging analysis.","translation":"非剛体画像レジストレーションは、医用画像解析に不可欠である。","type":"adjective","meaning_category":"deformable"},{"sentence":"The **nonrigid** nature of the material made it suitable for absorbing shocks.","translation":"その材料の非剛体性は、衝撃を吸収するのに適していた。","type":"adjective","meaning_category":"pliable"}]}