{"word":"moveability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"可動性、移動性、動きやすさ","english_definition":"The quality or state of being movable; the capacity or degree to which something can be moved.","examples":[{"sentence":"The moveability of the furniture made rearranging the room easy.","translation":"家具の可動性のおかげで、部屋の模様替えが簡単だった。"},{"sentence":"The design of the robot focused on maximizing its moveability in complex environments.","translation":"そのロボットの設計は、複雑な環境での可動性を最大限に高めることに重点を置いていた。"},{"sentence":"The moveability of the new prosthetic limb greatly improved the patient's quality of life.","translation":"新しい義肢の可動性により、患者の生活の質が大幅に向上した。"}],"collocations":["improve moveability (可動性を改善する)","increase moveability (可動性を高める)","enhance moveability (可動性を強化する)","limited moveability (制限された可動性)","high moveability (高い可動性)"],"synonyms":["mobility","portability","maneuverability","transportability","flexibility","agility"],"antonyms":["immobility","fixity","stability","immovability","stillness"]},{"part_of_speech":"noun","definition":"（感情などの）動きやすさ、影響を受けやすさ","english_definition":"The susceptibility to emotional influence; the ease with which someone's feelings can be affected.","examples":[{"sentence":"The moveability of the audience was evident in their emotional reactions to the play.","translation":"観客の感情の動きやすさは、劇に対する感情的な反応に明らかだった。"},{"sentence":"The therapist assessed the patient's moveability to determine the best course of treatment.","translation":"セラピストは、最適な治療法を決定するために、患者の感情の動きやすさを評価した。"}],"collocations":["emotional moveability (感情的な動きやすさ)","assess moveability (動きやすさを評価する)","high moveability (高い動きやすさ)","low moveability (低い動きやすさ)"],"synonyms":["susceptibility","sensitivity","affectability","impressionability","vulnerability"],"antonyms":["insensitivity","apathy","emotional stability","imperturbability"]}],"etymology":{"value":"\"Move\" + \"-able\" + \"-ity\". \"Move\" comes from Middle English *moven*, from Old French *moveir* \"to move\", from Latin *movere* \"to set in motion, stir, agitate, affect, excite\". \"-able\" is a suffix denoting capability or fitness. \"-ity\" is a suffix used to form nouns expressing state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmuːvəˈbɪləti/","syllables":"moo-va-bi-li-ty"},"inflection":{"noun_plural":"moveabilities"},"usage_notes":{"explanation":"\"Moveability\" refers to the quality of being able to be moved, either physically or emotionally. It is often used in technical contexts to describe the ease with which an object can be transported or manipulated. It can also describe the emotional responsiveness of a person or group. The word is relatively uncommon, with \"mobility\" being a more frequent synonym for physical moveability and \"susceptibility\" or \"sensitivity\" for emotional moveability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The moveability of the idea made it easily adaptable.","correct":"✓ The adaptability of the idea made it easily adaptable.","note":"When referring to the ease with which an idea can be changed, \"adaptability\" is more appropriate than \"moveability.\" Moveability is better suited for physical objects or emotional states."},{"incorrect":"✗ The moveability of the car was excellent on the highway.","correct":"✓ The handling of the car was excellent on the highway.","note":"When describing how a car drives, \"handling\" is a more common and idiomatic choice than \"moveability.\""}],"priority":"★★☆"},"related_words":{"derivatives":["move (verb, noun)","movable (adjective)","immovable (adjective)","movement (noun)","mobility (noun)"],"related_terms":["portability","maneuverability","transportability","flexibility","agility","susceptibility","sensitivity","affectability","impressionability","vulnerability"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"moveability\" is a relatively uncommon term that describes the capacity or degree to which something can be moved, either physically or emotionally. It is formed by combining \"move,\" \"-able,\" and \"-ity.\" In physical contexts, it relates to how easily an object can be transported or manipulated. In emotional contexts, it describes the susceptibility to emotional influence. Due to its relative rarity, it is more commonly found in technical or specialized writing. Synonyms like \"mobility\" (for physical contexts) and \"susceptibility\" or \"sensitivity\" (for emotional contexts) are more frequently used in everyday language."},"example_sentences":[{"sentence":"The enhanced moveability of the robotic arm allowed for more precise surgical procedures.","translation":"ロボットアームの可動性が向上したことで、より精密な外科手術が可能になった。","type":"noun","meaning_category":"physical moveability"},{"sentence":"The moveability of the population during the crisis was hampered by the damaged infrastructure.","translation":"危機時の住民の移動性は、損傷したインフラによって妨げられた。","type":"noun","meaning_category":"physical moveability"},{"sentence":"The therapist worked to increase the patient's emotional moveability, helping them to express their feelings more openly.","translation":"セラピストは、患者の感情的な動きやすさを高めるために働き、よりオープンに感情を表現できるように支援した。","type":"noun","meaning_category":"emotional moveability"}]}