{"word":"cowpock","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"牛痘","english_definition":"A disease of cows, the virus of which, when inoculated into humans, protects them from smallpox.","examples":[{"sentence":"The discovery of cowpock's protective effect against smallpox revolutionized medicine.","translation":"牛痘が天然痘に対して持つ防御効果の発見は、医学に革命をもたらした。"}],"collocations":["cowpock virus","vaccination with cowpock"],"synonyms":["vaccinia","vaccine (historical usage)"],"antonyms":[]},{"part_of_speech":"noun","definition":"牛痘ウイルス","english_definition":"The virus that causes cowpox.","examples":[{"sentence":"The cowpock virus is closely related to the variola virus, which causes smallpox.","translation":"牛痘ウイルスは、天然痘を引き起こす痘瘡ウイルスと密接に関連している。"}],"collocations":["cowpock infection","cowpock lesion"],"synonyms":["vaccinia virus"],"antonyms":[]}],"etymology":{"value":"From 'cow' + 'pock' (referring to the pustules). The term arose from the observation that milkmaids who contracted cowpox were immune to smallpox.","priority":"★★☆"},"pronunciation":{"ipa":"ˈkaʊˌpɒk","syllables":"cow-pock"},"inflection":{"noun_plural":"cowpocks"},"usage_notes":{"explanation":"'Cowpock' is a somewhat archaic term, with 'vaccinia' being the more common modern term for the disease and the virus. It is primarily of historical significance due to its role in the development of vaccination against smallpox by Edward Jenner.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["vaccination","vaccine","vaccinia"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in historical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cowpock' is a specialized term primarily encountered in historical or medical contexts when discussing the history of vaccination. It refers to the disease in cows that provided the basis for the smallpox vaccine. Understanding this term requires knowledge of medical history.","priority":"★★☆"},"example_sentences":[{"sentence":"Edward Jenner famously used cowpock to inoculate against smallpox.","translation":"エドワード・ジェンナーは、天然痘に対する予防接種に牛痘を使用したことで有名である。","type":"noun","meaning_category":"牛痘"},{"sentence":"The lesions caused by cowpock are typically mild in humans.","translation":"牛痘によって引き起こされる病変は、通常、人間では軽度である。","type":"noun","meaning_category":"牛痘"}]}