{"word":"Laparothoracoscopy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"腹腔鏡下胸腔鏡検査","english_definition":"A surgical procedure that combines laparoscopy and thoracoscopy to examine the abdominal and thoracic cavities.","examples":[{"sentence":"Laparothoracoscopy was performed to diagnose the cause of the patient's abdominal and chest pain.","translation":"患者の腹部と胸部の痛みの原因を診断するために、腹腔鏡下胸腔鏡検査が行われた。"}],"collocations":["perform laparothoracoscopy","undergo laparothoracoscopy"],"synonyms":["VATS-laparoscopy","thoraco-laparoscopy"],"antonyms":[]}],"etymology":{"value":"Combination of 'laparo-' (referring to the abdomen), 'thoraco-' (referring to the thorax or chest), and '-scopy' (referring to visual examination using a scope).","priority":"★★★"},"pronunciation":{"ipa":"/ˌlæpərəˌθɔːrəkəˈskɒpi/","syllables":"lap-a-ro-tho-ra-co-sco-py"},"inflection":{"noun_plural":"laparothoracoscopies"},"usage_notes":{"explanation":"Laparothoracoscopy is a minimally invasive surgical technique used for diagnostic and therapeutic purposes involving both the abdominal and thoracic cavities. It allows surgeons to visualize and operate in these areas with smaller incisions, potentially leading to reduced pain and faster recovery times compared to traditional open surgery.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Laparothoracoscopy are a type of surgery.","correct":"✓ Laparothoracoscopy is a type of surgery.","note":"Laparothoracoscopy is a singular noun, so it takes a singular verb."}],"priority":"★☆☆"},"related_words":{"derivatives":["laparoscope","thoracoscope","laparoscopy","thoracoscopy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Laparothoracoscopy is a highly specialized medical term referring to a surgical procedure. It involves the use of both laparoscopy (abdominal) and thoracoscopy (thoracic) techniques to examine and operate on the abdominal and thoracic cavities. Due to its highly technical nature, it is primarily used within medical contexts and is not commonly encountered in general language use."},"example_sentences":[{"sentence":"The surgeon recommended laparothoracoscopy to assess the extent of the tumor.","translation":"外科医は腫瘍の範囲を評価するために腹腔鏡下胸腔鏡検査を推奨した。","type":"medical","meaning_category":"surgical procedure"}]}