{"word":"gray-crowned","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(鳥などが)灰色の冠羽を持つ","english_definition":"Having gray feathers on the crown of the head (typically used to describe birds).","examples":[{"sentence":"The gray-crowned rosy-finch is a beautiful bird found in the mountains.","translation":"ハイガシラコウヨウチョウは山で見られる美しい鳥です。"},{"sentence":"We spotted a gray-crowned crane at the zoo.","translation":"動物園でカンムリヅルを見つけました。"}],"collocations":["gray-crowned rosy-finch","gray-crowned crane"],"synonyms":["grey-crowned"],"antonyms":[]}],"etymology":{"value":"A compound adjective formed from \"gray\" (or \"grey\") and \"crowned\", describing the physical appearance of having gray feathers on the crown (top) of the head.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡreɪ ˈkraʊnd/","syllables":"gray-crowned"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more gray-crowned, most gray-crowned)."},"usage_notes":{"explanation":"This adjective is primarily used in ornithology (the study of birds) to describe bird species that have a distinctive gray patch of feathers on the top of their head. It is a descriptive term rather than a common everyday word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bird had a gray crown. It was gray-crowned.","correct":"✓ The bird had a gray crown. Therefore, it was gray-crowned.","note":"While technically correct, the second sentence is more descriptive and emphasizes the characteristic feature. The first sentence is grammatically sound, but lacks the specific descriptive emphasis of the compound adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["crowned","gray","grey","ornithology","bird identification"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Specialized vocabulary related to ornithology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"gray-crowned\" is a specialized adjective used in ornithology to describe birds with gray feathers on the crown of their head. Due to its specific usage and technical context, it is not a common word and is more likely to be encountered in scientific or descriptive texts about birds. Understanding this term requires familiarity with basic bird anatomy and descriptive vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **gray-crowned** babbler is endemic to the island.","translation":"そのハイガシラモズチメドリはその島固有の種です。","type":"adjective","meaning_category":"description"},{"sentence":"We identified the bird as a **gray-crowned** finch based on its markings.","translation":"その鳥の模様から、ハイガシラフィンチだと特定しました。","type":"adjective","meaning_category":"identification"}]}