{"word":"discreated","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(神などが)創造したものを破壊する、無に帰す","english_definition":"To uncreate; to annihilate or destroy that which has been created, especially by divine power.","examples":[{"sentence":"The sorcerer threatened to discreate the entire world if his demands were not met.","translation":"その魔法使いは、要求が満たされなければ全世界を破壊すると脅した。"},{"sentence":"Some philosophical viewpoints suggest that the universe will eventually be discreated.","translation":"一部の哲学的見解では、宇宙は最終的に無に帰されると示唆されている。"}],"collocations":["discreate the world (世界を破壊する)","discreate the universe (宇宙を破壊する)"],"synonyms":["annihilate","destroy","obliterate","unmake","abolish"],"antonyms":["create","generate","construct","build","form"]}],"etymology":{"value":"From the prefix 'dis-' (meaning 'opposite of' or 'undoing') combined with 'created'. The word suggests the reversal of the act of creation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪskriˈeɪtɪd/","syllables":"dis-cre-a-ted"},"inflection":{"verb_forms":{"present_simple":["discreate","discreates"],"past_simple":"discreated","past_participle":"discreated","present_participle":"discreating"}},"usage_notes":{"explanation":"'Discreated' is a relatively rare word, often used in philosophical, theological, or fantasy contexts to describe the undoing or destruction of something that was originally created, especially by a divine or powerful entity. It implies a reversal of the creative process, returning something to a state of non-existence or chaos.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist discreated his painting because he didn't like it.","correct":"✓ The artist destroyed his painting because he didn't like it.","note":"'Discreate' implies a more profound and often supernatural act of undoing creation, rather than simply destroying something. 'Destroyed' is more appropriate for ordinary acts of destruction."}],"priority":"★☆☆"},"related_words":{"derivatives":["discreation (noun: the act of discreating)"],"antonyms":["creation"]},"level_frequency":{"CEFR":"N/A (very rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Discreated' is a rare and advanced word, primarily used in philosophical or fantasy contexts. It describes the act of undoing or destroying something that has been created, often implying a divine or supernatural power. This term is not commonly used in everyday language and requires a high level of vocabulary comprehension to understand its nuanced meaning. It is the opposite of 'created' and suggests a reversal of the creative process, returning something to a state of non-existence or chaos."},"example_sentences":[{"sentence":"The ancient texts spoke of a god capable of discreating entire galaxies with a single thought.","translation":"古代の文献には、たった一つの思考で銀河全体を破壊できる神について書かれていた。","type":"verb","meaning_category":"destroy"},{"sentence":"The concept of being discreated terrified the characters in the science fiction novel.","translation":"そのSF小説の登場人物たちは、無に帰されるという概念に恐怖を感じていた。","type":"verb","meaning_category":"annihilate"}]}