{"word":"half-reversed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"半分逆転した、部分的に反転した","english_definition":"Partially or incompletely reversed; having undergone a reversal to approximately half of its original state or position.","examples":[{"sentence":"The car was found half-reversed on the shoulder of the road, suggesting the driver had tried to turn around.","translation":"その車は道路の肩の部分で半分逆向きになっているのが発見され、運転手がUターンしようとしたことを示唆していた。"},{"sentence":"The image in the mirror was half-reversed, showing a distorted reflection.","translation":"鏡の中の像は半分逆転しており、歪んだ反射を示していた。"},{"sentence":"The process resulted in a half-reversed magnetic field within the sample.","translation":"そのプロセスは、サンプル内の磁場を半分逆転させる結果となった。"}],"collocations":["half-reversed image","half-reversed position","half-reversed state","half-reversed direction"],"synonyms":["partially reversed","semi-reversed","part-inverted"],"antonyms":["fully reversed","completely reversed","unreversed"]}],"etymology":{"value":"The word is formed by combining 'half' (meaning one of two equal parts) with 'reversed' (meaning turned the other way around or in the opposite direction).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhæf rɪˈvɜːrst/","syllables":"half-re-versed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not inflect for number or gender."},"usage_notes":{"explanation":"'Half-reversed' describes something that has been turned or altered to approximately 180 degrees from its original orientation, but not fully. It implies an incomplete or partial reversal. It is often used in technical or descriptive contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The car was half-reverse.","correct":"✓ The car was half-reversed.","note":"'Reversed' is the past participle form of the verb 'reverse', and it's used as an adjective here. 'Reverse' is the verb or noun form."},{"incorrect":"✗ The image was half reverse.","correct":"✓ The image was half-reversed.","note":"Again, use the past participle form 'reversed' as an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["reverse (verb, noun, adjective)","reversal (noun)","half (adjective, noun, adverb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'half-reversed' is relatively uncommon and is typically used in technical or descriptive contexts. It implies a partial or incomplete reversal, where something is turned or altered to approximately 180 degrees from its original orientation. Understanding this term requires a good grasp of both 'half' and 'reversed' and the ability to combine them to form a specific meaning."},"example_sentences":[{"sentence":"The propeller was found in a half-reversed position after the accident.","translation":"事故後、プロペラは半分逆転した状態で発見された。","type":"adjective","meaning_category":"Position/Orientation"},{"sentence":"The magnetic domains in the material were half-reversed due to the applied field.","translation":"材料中の磁区は、印加された磁場によって半分逆転した。","type":"adjective","meaning_category":"Technical/Scientific"},{"sentence":"The flag was hung half-reversed as a sign of distress.","translation":"旗は遭難のサインとして半分逆さまに掲げられていた。","type":"adjective","meaning_category":"Symbolic/Distress"}]}