{"word":"Excardination","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(カトリック教会の)聖職者が、ある教区から別の教区に移籍すること。","english_definition":"(in the Catholic Church) the formal release of a cleric from the jurisdiction of one diocese so that he may be accepted into another.","examples":[{"sentence":"The priest requested excardination from his current diocese to serve in a missionary territory.","translation":"その司祭は、宣教地域で奉仕するために、現在の教区からの移籍を要請した。"}],"collocations":["request excardination","grant excardination","obtain excardination"],"synonyms":["transfer","release","dismissal"],"antonyms":["incardination"]},{"part_of_speech":"noun","definition":"(一般的に)組織や団体からの正式な離脱、または除名。","english_definition":"(generally) the formal release or removal from an organization or group.","examples":[{"sentence":"The member's excardination from the club was due to repeated violations of the rules.","translation":"その会員のクラブからの除名は、度重なる規則違反が原因だった。"}],"collocations":["formal excardination","official excardination"],"synonyms":["expulsion","exclusion","removal","discharge"],"antonyms":["admission","acceptance","inclusion"]}],"etymology":{"value":"Derived from the Latin words 'ex' (out of, from) and 'cardinatus' (hinged, belonging to a cardinal point), referring to being released from a diocese.","priority":"★★☆"},"pronunciation":{"ipa":"/ɛkskɑːrdɪˈneɪʃən/","syllables":"ex-car-di-na-tion"},"inflection":{"noun_plural":"excardinations"},"usage_notes":{"explanation":"'Excardination' is primarily used within the context of the Catholic Church to describe the process by which a member of the clergy is formally released from service in one diocese to be able to serve in another. It can also be used more broadly to describe a formal removal or release from other organizations, but this usage is less common. It is often paired with 'incardination', which is the process of being formally accepted into a new diocese or organization.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was excardinated to the new church.","correct":"✓ He was granted excardination from his previous diocese.","note":"Excardination is something that is granted or requested, not a destination. It's the act of being released, not being transferred."}],"priority":"★☆☆"},"related_words":{"derivatives":["excardinate (verb)"],"phrasal_verbs":[],"related_concepts":["Incardination","Diocese","Clergy","Canon Law"]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Excardination' is a highly specialized term primarily used in the context of Catholic canon law. It refers to the formal process by which a member of the clergy is released from the jurisdiction of one diocese to be accepted into another. Understanding this term requires familiarity with the structure and processes of the Catholic Church. While it can be used more broadly to describe formal removal from other organizations, this usage is rare."},"example_sentences":[{"sentence":"The bishop approved the priest's request for excardination, allowing him to serve in the foreign mission.","translation":"司教は司祭の移籍の要請を承認し、彼が海外の宣教で奉仕することを許可した。","type":"noun","meaning_category":"移籍"},{"sentence":"His excardination from the organization was a result of his controversial statements.","translation":"彼の組織からの除名は、彼の物議を醸す発言の結果だった。","type":"noun","meaning_category":"除名"}]}