{"word":"copetitioner","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"共同請願者、共同申請者","english_definition":"A person who joins with another or others in making a petition or application.","examples":[{"sentence":"The two companies acted as copetitioners in the antitrust lawsuit.","translation":"その2社は、独占禁止法訴訟において共同請願者として行動した。"},{"sentence":"She was listed as a copetitioner on the divorce papers.","translation":"彼女は離婚届に共同申請者として記載されていた。"}],"collocations":["file as copetitioner","joint copetitioner","lead copetitioner"],"synonyms":["co-applicant","joint petitioner","co-mover"],"antonyms":["respondent","defendant"]},{"part_of_speech":"noun","definition":"(法律)共同原告","english_definition":"(Law) A party who joins with another in presenting a petition to a court.","examples":[{"sentence":"The copetitioners argued that the lower court's decision was flawed.","translation":"共同原告らは、下級裁判所の判決には欠陥があると主張した。"}],"collocations":["legal copetitioner","main copetitioner"],"synonyms":["co-plaintiff","co-claimant"],"antonyms":["defendant","respondent"]}],"etymology":{"value":"The word \"copetitioner\" is formed by combining the prefix \"co-\" (meaning \"together\" or \"jointly\") with the word \"petitioner\" (a person who makes a formal request to an authority).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊpəˈtɪʃənər/","syllables":"co-pe-ti-tion-er"},"inflection":{"noun_plural":"copetitioners"},"usage_notes":{"explanation":"The term \"copetitioner\" is typically used in legal or formal contexts where multiple parties are jointly submitting a request or petition. It indicates a shared responsibility and interest in the outcome of the petition. It is often used in lawsuits, divorce proceedings, and other legal applications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a co-petitioner for the job.","correct":"✓ He is a co-applicant for the job.","note":"While \"copetitioner\" is technically correct, \"co-applicant\" is more commonly used in the context of job applications."}],"priority":"★☆☆"},"related_words":{"derivatives":["petition","petitioner","petitioning"],"phrasal_verbs":[],"related_legal_terms":["affidavit","motion","pleading","summary judgement"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'copetitioner' is a formal term, mainly used in legal contexts. It refers to someone who joins with one or more other people to make a formal request, known as a petition, to an authority, often a court. The 'co-' prefix indicates that the person is acting jointly with others. Due to its specific and formal usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The two siblings acted as copetitioners in the inheritance dispute.","translation":"その二人の兄弟姉妹は、遺産相続の紛争において共同請願者として行動した。","type":"noun","meaning_category":"共同請願者(相続)"},{"sentence":"As copetitioners, they jointly filed the appeal with the Supreme Court.","translation":"共同原告として、彼らは最高裁判所に共同で上訴を提出した。","type":"noun","meaning_category":"共同原告(上訴)"}]}