{"word":"prosaically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"散文的に、平凡に、退屈に、面白みのないやり方で","english_definition":"in a prosaic manner; commonplace or dull; matter-of-fact or unimaginative.","examples":[{"sentence":"He described the event prosaically, focusing on the facts and figures.","translation":"彼はその出来事を散文的に描写し、事実と数字に焦点を当てた。"},{"sentence":"She explained the complex theory prosaically, making it easy to understand.","translation":"彼女はその複雑な理論を平凡に説明し、理解しやすくした。"},{"sentence":"The meeting was conducted prosaically, with little room for creativity or innovation.","translation":"会議は退屈に進められ、創造性や革新の余地はほとんどなかった。"}],"collocations":["describe something prosaically (何かを散文的に描写する)","explain something prosaically (何かを平凡に説明する)","conduct something prosaically (何かを退屈に進める)","live prosaically (平凡に生きる)"],"synonyms":["banally","mundanely","ordinarily","unimaginatively","matter-of-factly","pedestrianly","drably","colorlessly"],"antonyms":["poetically","imaginatively","creatively","interestingly","vividly","lyrically"]}],"etymology":{"value":"Derived from 'prosaic,' meaning 'having the style or diction of prose; lacking poetic beauty; commonplace; dull.' 'Prosaic' comes from the Latin 'prosa,' meaning 'straightforward discourse; prose,' from 'prorsus,' meaning 'straightforward, directly forward.' The suffix '-ally' turns the adjective into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈzeɪɪkli/","syllables":"pro-sa-i-cal-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Prosaically' describes something done in a plain, straightforward, and often uninspired or dull manner. It suggests a lack of imagination, creativity, or excitement in the way something is expressed or done. The term is often used to contrast with more artistic, poetic, or imaginative approaches.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist painted prosaically.","correct":"✓ The artist painted realistically.","note":"'Prosaically' is more about the manner of expression or description, not necessarily the style of art. 'Realistically' would be a better fit if the painting is simply very true to life."},{"incorrect":"✗ He lived prosaically, always seeking adventure.","correct":"✓ He lived a prosaic life, lacking adventure.","note":"Living 'prosaically' means living a dull, ordinary life, not seeking adventure. The sentence implies the opposite."}],"priority":"★★☆"},"related_words":{"derivatives":["prosaic (adjective)","prosaism (noun)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Prosaically' means doing something in a plain, uninspired, and somewhat dull way. It's used to describe actions or descriptions that lack imagination or excitement. Think of it as the opposite of doing something creatively or poetically. It's not a common word, so you'll mostly find it in more advanced texts or discussions."},"example_sentences":[{"sentence":"The report described the company's financial situation prosaically, with no attempt to sugarcoat the bad news.","translation":"その報告書は、会社の財政状況を散文的に記述し、悪いニュースを甘く見せようとはしなかった。","type":"general","meaning_category":"散文的に、平凡に"},{"sentence":"She prosaically recounted the events of the day, omitting any personal feelings or opinions.","translation":"彼女はその日の出来事を散文的に語り、個人的な感情や意見は一切省いた。","type":"general","meaning_category":"退屈に"}]}