{"word":"Paleogene","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"古第三紀（約6600万年前から2303万年前までの地質時代）","english_definition":"The first period of the Cenozoic Era, lasting from about 66 to 23 million years ago.","examples":[{"sentence":"The Paleogene period followed the Cretaceous period.","translation":"古第三紀は白亜紀の後に続いた。"},{"sentence":"Many mammal species evolved during the Paleogene.","translation":"多くの哺乳類が古第三紀に進化しました。"}],"collocations":["Paleogene period","Early Paleogene","Late Paleogene"],"synonyms":["Early Tertiary"],"antonyms":["Neogene"]},{"part_of_speech":"adjective","definition":"古第三紀の","english_definition":"Relating to the Paleogene period.","examples":[{"sentence":"Paleogene rocks are found in this region.","translation":"この地域では古第三紀の岩石が見つかります。"},{"sentence":"The Paleogene climate was generally warmer than today's.","translation":"古第三紀の気候は一般的に現在よりも暖かかった。"}],"collocations":["Paleogene rocks","Paleogene climate","Paleogene fossils"],"synonyms":["Early Tertiary"],"antonyms":["Neogene"]}],"etymology":{"value":"Derived from the Greek words 'palaios' (ancient) and 'genos' (birth, origin, kind).","priority":"★★★"},"pronunciation":{"ipa":"/ˈpeɪliːəˌdʒiːn/","syllables":"Pa-le-o-gene"},"inflection":{"noun_plural":"Paleogenes"},"usage_notes":{"explanation":"'Paleogene' is a term used in geology and paleontology to refer to a specific period of time in Earth's history. It is often used in discussions about the evolution of mammals and the climate of that era. It is important to note that the term 'Tertiary' was formerly used to describe the Paleogene and Neogene periods together, but this usage is now outdated.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Paleogene era was before the Mesozoic era.","correct":"✓ The Paleogene era was after the Mesozoic era.","note":"The Paleogene era followed the Mesozoic era (which includes the Triassic, Jurassic, and Cretaceous periods)."},{"incorrect":"✗ Paleogene is a type of dinosaur.","correct":"✓ Paleogene is a geological period when mammals evolved.","note":"Paleogene is a geological period, not a type of dinosaur. Dinosaurs lived primarily during the Mesozoic Era."}],"priority":"★★☆"},"related_words":{"derivatives":["Paleocene","Eocene","Oligocene","Neogene","Cenozoic"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Paleogene' is specialized vocabulary primarily used within the fields of geology, paleontology, and related earth sciences. It refers to a specific geological period, and understanding its place within the geological timescale requires some background knowledge of Earth's history. Therefore, it is typically encountered in advanced academic or technical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Fossil evidence suggests that the first primates appeared during the Paleogene period.","translation":"化石の証拠は、最初の霊長類が古第三紀に出現したことを示唆している。","type":"noun","meaning_category":"Geological Period"},{"sentence":"The Paleogene landscape was characterized by dense forests and warm temperatures.","translation":"古第三紀の景観は、密な森林と温暖な気温によって特徴付けられていた。","type":"adjective","meaning_category":"Relating to the period"}]}