{"word":"Haematoxylin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘマトキシリン（組織学で用いられる染色剤）","english_definition":"A compound extracted from heartwood of the logwood tree (Haematoxylum campechianum) that is used as a nuclear stain in histology.","examples":[{"sentence":"Haematoxylin is a commonly used stain in histology to visualize cell nuclei.","translation":"ヘマトキシリンは、組織学において細胞核を可視化するために一般的に使用される染色剤です。"}],"collocations":["Haematoxylin and eosin (H&E) staining","Haematoxylin solution","Nuclear staining with haematoxylin"],"synonyms":["hematoxylin"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'haima' (blood) and 'xylon' (wood), referring to the reddish color of the logwood extract.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːməˈtɒksɪlɪn/","syllables":"hee-ma-tox-i-lin"},"inflection":{"noun_plural":"haematoxylins"},"usage_notes":{"explanation":"Haematoxylin is primarily used in histology to stain cell nuclei a blue-purple color. It is often used in conjunction with eosin, which stains the cytoplasm and other structures pink, in a technique called H&E staining. H&E staining is one of the most commonly used staining methods in histology and pathology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ hematoxilin","correct":"✓ haematoxylin / hematoxylin","note":"The correct spelling is 'haematoxylin' (British English) or 'hematoxylin' (American English)."},{"incorrect":"✗ Haematoxylin is a basic stain.","correct":"✓ Haematoxylin is a dye that behaves like a basic stain.","note":"Haematoxylin itself is not a basic dye, but it mordants with metal ions (usually aluminum) to form a complex that behaves like a basic dye, staining acidic structures (like DNA in the nucleus)."}],"priority":"★★☆"},"related_words":{"derivatives":["haematoxylinophilic (adj.)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Haematoxylin' is a technical term used in the fields of histology and pathology. It refers to a specific type of stain used to visualize cell nuclei under a microscope. Understanding this term requires knowledge of biological staining techniques and cellular structures. It is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"The pathologist examined the tissue sample after haematoxylin and eosin staining.","translation":"病理医はヘマトキシリン・エオシン染色後の組織サンプルを検査した。","type":"general","meaning_category":"histology"},{"sentence":"The intensity of haematoxylin staining can indicate the level of cellular activity.","translation":"ヘマトキシリン染色の強度は、細胞活動のレベルを示すことがある。","type":"general","meaning_category":"histology"}]}