{"word":"hand-filled","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"手で詰められた、手作業で充填された","english_definition":"filled by hand, rather than by machine.","examples":[{"sentence":"These chocolates are hand-filled with a rich caramel.","translation":"これらのチョコレートは、濃厚なキャラメルを手作業で詰めています。"},{"sentence":"The company prides itself on its hand-filled pastries.","translation":"その会社は、手作業で充填されたペストリーを誇りに思っています。"}],"collocations":["hand-filled chocolates","hand-filled pastries","hand-filled cigars","hand-filled bags"],"synonyms":["manually filled","handmade","artisan"],"antonyms":["machine-filled","automated"],"notes":"Often used to emphasize the quality and care taken in the production process."}],"etymology":{"value":"A compound adjective formed from 'hand' and 'filled', indicating that the filling process is done manually.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhænd fɪld/","syllables":"hand-filled"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Hand-filled' is used to describe products where the filling or stuffing process is done by a person rather than a machine. This often implies a higher level of craftsmanship and attention to detail. It is commonly used in the context of food products (e.g., chocolates, pastries) and other items like cigars or bags.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The hand filled the jar.","correct":"✓ The worker hand-filled the jar.","note":"'Hand-filled' is an adjective describing the product, not the action of filling. To describe the action, use 'hand-fill' as a verb or rephrase the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["hand-made","handcrafted","artisan"],"related_terms":["filled","stuffing","packing"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Hand-filled' is a descriptive adjective used to indicate that a product has been filled manually, rather than by automated machinery. This term is often used in marketing to suggest a higher quality or artisanal nature of the product. It implies that more care and attention has been given to the filling process, which might appeal to consumers looking for premium or handcrafted items."},"example_sentences":[{"sentence":"The dumplings are carefully hand-filled with a savory pork mixture.","translation":"その餃子は、風味豊かな豚肉の詰め物を丁寧に手作業で詰めています。","type":"descriptive","meaning_category":"food"},{"sentence":"Each of these teddy bears is hand-filled with soft, hypoallergenic stuffing.","translation":"これらのテディベアはそれぞれ、柔らかく低アレルギー性の詰め物を手作業で詰めています。","type":"descriptive","meaning_category":"toys"},{"sentence":"The company's hand-filled chocolates are a popular gift during the holidays.","translation":"その会社の手作業で詰められたチョコレートは、ホリデーシーズンに人気の贈り物です。","type":"descriptive","meaning_category":"gifts"}]}