{"word":"toller","priority":"1","meanings":[{"part_of_speech":"noun","definition":"A Nova Scotia Duck Tolling Retriever.","english_definition":"A medium-sized breed of dog developed in Nova Scotia, Canada, to lure waterfowl within gunshot range.","examples":[{"sentence":"The hunter used his toller to attract ducks closer to the shore.","translation":"猟師は、岸の近くにカモを引き寄せるために、彼のトローラーを使った。"},{"sentence":"Tollers are known for their intelligence and playful nature.","translation":"トローラーは、その知性と遊び心のある性格で知られている。"}],"collocations":["Nova Scotia Duck Tolling Retriever","duck tolling","dog breed"],"synonyms":["Nova Scotia Duck Tolling Retriever"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'toll', meaning to entice or lure, referring to the dog's method of attracting waterfowl.","priority":"2"},"pronunciation":{"ipa":"/ˈtoʊlər/","syllables":"tol-ler"},"inflection":{"noun_plural":"tollers"},"usage_notes":{"explanation":"The term 'toller' specifically refers to the Nova Scotia Duck Tolling Retriever. It is important to use the full name of the breed for clarity, especially when communicating with those unfamiliar with the breed.","priority":"2"},"common_mistakes":{"examples":[{"incorrect":"The dog is a type of retriever, a toller.","correct":"The dog is a Nova Scotia Duck Tolling Retriever, a type of retriever."}],"priority":"3"},"related_words":{"derivatives":[],"related_breeds":["Retriever","Spaniel"]},"level_frequency":{"frequency_google_ngram":"Low frequency; primarily used within the context of dog breeds.","priority":"3"},"readability_explanation":{"level":"B2","text":"The word 'toller' is relatively uncommon outside of contexts involving dog breeds, specifically the Nova Scotia Duck Tolling Retriever. Understanding this term requires familiarity with different dog breeds and their specific characteristics."},"example_sentences":[{"sentence":"The breeder specializes in tollers and golden retrievers.","translation":"そのブリーダーは、トローラーとゴールデンレトリバーを専門に扱っている。","type":"noun","meaning_category":"Dog Breed"},{"sentence":"Training a toller requires patience and consistency.","translation":"トローラーを訓練するには、忍耐と一貫性が必要だ。","type":"noun","meaning_category":"Dog Breed"}]}