{"word":"Returnees","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"帰国子女、海外からの帰国者","english_definition":"People who have returned to their country of origin after living abroad, especially for an extended period. Often refers to children who have lived and studied abroad with their parents.","examples":[{"sentence":"The school has a special program for returnees to help them adjust.","translation":"その学校には、帰国子女が学校生活に慣れるのを助けるための特別なプログラムがあります。"},{"sentence":"Returnees often have a unique perspective on both their home country and the country they lived in.","translation":"帰国子女は、自国と居住していた国の両方に対して独自の視点を持っていることが多いです。"},{"sentence":"Many companies actively recruit returnees for their international experience and language skills.","translation":"多くの企業が、国際的な経験と語学力を持つ帰国子女を積極的に採用しています。"}],"collocations":["support for returnees (帰国子女への支援)","returnee students (帰国子女の学生)","adjusting to life back home (帰国後の生活への適応)","cultural adjustment (文化的な適応)"],"synonyms":["repatriates","returning residents","expatriate returnees"],"antonyms":["expatriates","immigrants","foreign residents"]},{"part_of_speech":"noun","definition":"(歴史的な文脈で) 引き揚げ者","english_definition":"(Historical context) People who were repatriated to their home country after a war or other major event, often involving displacement.","examples":[{"sentence":"After the war, there was a massive influx of returnees from overseas territories.","translation":"戦後、海外領土から多くの引き揚げ者が流入しました。"},{"sentence":"The government provided assistance to returnees to help them rebuild their lives.","translation":"政府は、引き揚げ者が生活を再建できるよう支援を提供しました。"}],"collocations":["post-war returnees (戦後の引き揚げ者)","repatriation efforts (帰還事業)","resettlement programs (再定住プログラム)"],"synonyms":["repatriates","displaced persons","refugees (in some contexts)"],"antonyms":["emigrants","displaced persons (remaining in the host country)"]}],"etymology":{"value":"The word 'returnee' is formed by adding the suffix '-ee' to 'return'. The suffix '-ee' generally denotes a person who is the recipient or object of an action. Therefore, a 'returnee' is someone who has returned.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˌtɜːrˈniːz/","syllables":"re-turn-ees"},"inflection":{"noun_plural":"returnees (already plural)"},"usage_notes":{"explanation":"The term 'returnees' most commonly refers to individuals, especially children, who have lived and studied abroad and then returned to their home country. It often implies a period of adjustment and potential cultural differences. In a historical context, particularly in discussions of post-war periods, it can refer to people repatriated after displacement. The term often carries connotations of cultural adaptation, language proficiency, and unique perspectives.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a returnee from USA.","correct":"✓ He is a returnee from the USA.","note":"When specifying the country, use 'the' before the country name if it's part of the official name (e.g., the USA, the UK)."},{"incorrect":"✗ She is a returnee child.","correct":"✓ She is a returnee. / ✓ She is a returnee student. / ✓ She is a returning child.","note":"'Returnee' already implies someone who has returned, so adding 'child' is redundant. Use 'returnee student' or 'returning child' for clarity if needed."},{"incorrect":"✗ The returnees are facing many adaptation problems.","correct":"✓ The returnees are facing many adjustment problems.","note":"While 'adaptation' is related, 'adjustment' is more commonly used to describe the process of getting used to a new environment or situation."}],"priority":"★★☆"},"related_words":{"derivatives":["return (verb, noun)","returning (adjective)","repatriate (verb, noun)","repatriation (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2-C1 (specialized vocabulary)","frequency_google_ngram":"Moderately frequent, especially in educational and international contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"returnees\" refers to people who have lived in another country and then come back to their home country. This word is often used when talking about students who studied abroad and then returned to their original schools. It's also used in historical contexts to describe people who were sent back to their country after a war or other major event. Because it's often used in specific situations, it's a more advanced word than basic terms like \"immigrants\" or \"travelers.\""},"example_sentences":[{"sentence":"The university offers counseling services specifically for **returnees**.","translation":"その大学は、特に帰国子女のためのカウンセリングサービスを提供しています。","type":"noun","meaning_category":"帰国子女"},{"sentence":"Many **returnees** struggle with reverse culture shock upon returning home.","translation":"多くの帰国子女は、帰国後に逆カルチャーショックに苦しんでいます。","type":"noun","meaning_category":"帰国子女"},{"sentence":"The government provided support for the **returnees** after the war.","translation":"政府は戦後、引き揚げ者への支援を提供しました。","type":"noun","meaning_category":"引き揚げ者 (historical)"}]}