{"word":"Scripturist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"聖書主義者、聖書を唯一の権威とみなす人","english_definition":"A person who adheres strictly to the scriptures, especially the Bible, as the sole source of religious authority.","examples":[{"sentence":"The Scripturists in the community often debated the interpretation of certain passages.","translation":"そのコミュニティの聖書主義者たちは、特定の聖句の解釈についてしばしば議論した。"},{"sentence":"As a Scripturist, he believed that all religious doctrine should be based solely on the Bible.","translation":"聖書主義者として、彼はすべての宗教的教義は聖書のみに基づいていなければならないと信じていた。"}],"collocations":["strict Scripturist","Bible-believing Scripturist"],"synonyms":["Biblicist","literalist","fundamentalist"],"antonyms":["liberal theologian"],"notes":"Often used in discussions about religious interpretation and authority.","etymology_notes":"Derived from 'scripture' + '-ist', indicating someone who adheres to scripture.","related_terms":["scripture","biblical","theology"]}],"etymology":{"value":"From 'scripture' + '-ist'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈskrɪptʃərɪst/","syllables":"Scrip-tur-ist"},"inflection":{"noun_plural":"Scripturists"},"usage_notes":{"explanation":"The term 'Scripturist' is used to describe someone who places primary emphasis on scripture, often to the exclusion of other sources of religious authority such as tradition or reason. It can sometimes carry connotations of fundamentalism or literal interpretation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Scripturist, so he never reads any other books.","correct":"✓ He is a Scripturist, so he relies heavily on the Bible for his beliefs.","note":"While Scripturists prioritize scripture, it doesn't necessarily mean they avoid all other books, but rather that they base their beliefs primarily on scripture."}],"priority":"★☆☆"},"related_words":{"derivatives":["Scriptural","Scripturally"],"related_terms":["Bible","Scripture","Biblicist","Fundamentalist"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Scripturist' is relatively uncommon and is typically encountered in theological or religious contexts. It refers to someone who strictly adheres to scripture as the primary source of religious authority. Understanding this term requires familiarity with religious discourse and concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The Scripturist approach to theology emphasizes the literal interpretation of biblical texts.","translation":"神学への聖書主義的アプローチは、聖書の文字通りの解釈を強調する。","type":"general","meaning_category":"Definition"},{"sentence":"Some critics argue that a purely Scripturist perspective can lead to narrow-mindedness.","translation":"批評家の中には、純粋な聖書主義的視点は偏狭さにつながる可能性があると主張する者もいる。","type":"opinion","meaning_category":"Critique"}]}