{"word":"self-consistent","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"自己矛盾のない、首尾一貫した、自家撞着のない","english_definition":"internally consistent; not containing any logical contradictions.","examples":[{"sentence":"His argument was self-consistent and persuasive.","translation":"彼の議論は首尾一貫していて説得力があった。"},{"sentence":"The theory needs to be self-consistent to be valid.","translation":"その理論が有効であるためには、自己矛盾がない必要がある。"},{"sentence":"The model is self-consistent, but it may not accurately reflect reality.","translation":"そのモデルは自己矛盾がないが、現実を正確に反映しているとは限らない。"}],"collocations":["self-consistent theory (自己矛盾のない理論)","self-consistent model (自己矛盾のないモデル)","self-consistent system (自己矛盾のないシステム)","logically self-consistent (論理的に自己矛盾がない)"],"synonyms":["coherent","consistent","logical","harmonious","integrated","unified"],"antonyms":["inconsistent","contradictory","paradoxical","self-contradictory"]},{"part_of_speech":"adjective","definition":"(物理学で) 自己無撞着な、自己整合的な","english_definition":"(in physics) describing a solution to a problem that is consistent with the assumptions used to derive it.","examples":[{"sentence":"The self-consistent solution to the Schrödinger equation gives the energy levels of the atom.","translation":"シュレーディンガー方程式の自己無撞着な解は、原子のエネルギー準位を与える。"},{"sentence":"A self-consistent field is one where the potential used to calculate the field is the same as the potential produced by the field.","translation":"自己無撞着な場とは、場を計算するために使用されるポテンシャルが、その場によって生成されるポテンシャルと同じものであるような場のことである。"}],"collocations":["self-consistent field (自己無撞着な場)","self-consistent solution (自己無撞着な解)","self-consistent calculation (自己無撞着な計算)"],"synonyms":["self-sustaining","equilibrium"],"antonyms":[]}],"etymology":{"value":"'Self-' + 'consistent'.  The idea is that something is consistent within itself, without external dependencies or contradictions.","priority":"★★★"},"pronunciation":{"ipa":"/ˌself kənˈsɪstənt/","syllables":"self-con-sis-tent"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more self-consistent' and 'most self-consistent' respectively."},"usage_notes":{"explanation":"'Self-consistent' implies an internal harmony and lack of contradiction. It's often used in academic or technical contexts, especially in discussions of theories, models, or systems. In physics, it has a specific technical meaning related to solutions that align with the initial assumptions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The data was self-consistent to the hypothesis.","correct":"✓ The data was self-consistent with the hypothesis.","note":"Use 'with' to indicate what something is consistent with."},{"incorrect":"✗ He is a very self-consistent person.","correct":"✓ He is a very consistent person.","note":"While technically correct, 'self-consistent' is more often applied to arguments, theories, or systems rather than people. 'Consistent' is a more common and natural way to describe a person."}],"priority":"★★☆"},"related_words":{"derivatives":["self-consistency (noun)"],"phrasal_verbs":[],"related_terms":["consistent","coherent","logical","valid","sound"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in academic and technical writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-consistent' means that something doesn't have any contradictions within itself. It's often used when talking about ideas, arguments, or theories. If something is 'self-consistent', it means all its parts fit together logically and there are no conflicting statements or ideas. In physics, it has a more specific meaning related to solutions that agree with the starting assumptions. It's a more advanced term, so you'll typically see it in higher-level discussions or writing."},"example_sentences":[{"sentence":"The detective needed a self-consistent account of the events to solve the mystery.","translation":"探偵は謎を解くために、事件の自己矛盾のない説明を必要とした。","type":"adjective","meaning_category":"General consistency"},{"sentence":"The economist built a self-consistent model to predict market behavior.","translation":"経済学者は市場の動向を予測するために、自己矛盾のないモデルを構築した。","type":"adjective","meaning_category":"Model/Theory consistency"},{"sentence":"The physicist sought a self-consistent solution to the quantum mechanical problem.","translation":"物理学者は量子力学的な問題に対する自己無撞着な解を求めた。","type":"adjective","meaning_category":"Physics (technical)"}]}