{"word":"stone-axe","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"石斧","english_definition":"An axe with a stone head, typically from the Stone Age.","examples":[{"sentence":"The archaeologist discovered a stone-axe at the excavation site.","translation":"考古学者は発掘現場で石斧を発見した。"},{"sentence":"Stone-axes were essential tools for early humans.","translation":"石斧は初期の人類にとって不可欠な道具だった。"}],"collocations":["stone-axe head","polished stone-axe"],"synonyms":["lithic axe"],"antonyms":[]}],"etymology":{"value":"From the combination of 'stone' (referring to the material) and 'axe' (the tool).","priority":"★★★"},"pronunciation":{"ipa":"/ˈstoʊnˌæks/","syllables":"stone-axe"},"inflection":{"noun_plural":"stone-axes"},"usage_notes":{"explanation":"'Stone-axe' refers specifically to an axe made with a stone head, typically associated with prehistoric cultures. It is distinct from metal axes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a stone-axe to cut the tree down yesterday.","correct":"✓ He used a chainsaw to cut the tree down yesterday.","note":"Stone-axes are not typically used in modern times; chainsaws or metal axes are more common."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'stone-axe' is relatively straightforward, referring to an axe made from stone. It is most commonly encountered in contexts related to archaeology, anthropology, or historical studies of the Stone Age. Understanding of the term assumes familiarity with basic tool types and prehistoric technology."},"example_sentences":[{"sentence":"The museum displayed a collection of stone-axes from various periods of the Stone Age.","translation":"博物館には、石器時代のさまざまな時代の石斧のコレクションが展示されていた。","type":"noun","meaning_category":"tool"},{"sentence":"Researchers are studying the manufacturing techniques used to create stone-axes.","translation":"研究者たちは、石斧を作るために使用された製造技術を研究している。","type":"noun","meaning_category":"tool"}]}