{"word":"Thjatsi","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にインドのラジャスタン地方で使われる)伝統的な男性用スカートのような衣服","english_definition":"(Primarily used in the Rajasthan region of India) A traditional skirt-like garment for men.","examples":[{"sentence":"In the folk dance, the men wore colorful Thjatsis.","translation":"民俗舞踊では、男性たちはカラフルなThjatsiを着用していました。"}],"collocations":["wear a Thjatsi","colorful Thjatsi","traditional Thjatsi"],"synonyms":["dhoti","lungi"],"antonyms":[]}],"etymology":{"value":"Originates from the local dialects of Rajasthan, India. The exact etymology is not widely documented in standard English etymological resources.","priority":"★☆☆"},"pronunciation":{"ipa":"/θjɑːtsi/","syllables":"Thjat-si"},"inflection":{"noun_plural":"Thjatsis"},"usage_notes":{"explanation":"\"Thjatsi\" refers to a specific cultural garment primarily worn by men in the Rajasthan region of India. It is less commonly known outside of this region and cultural context. When using this word, it's important to provide context to ensure understanding.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a Thjatsi to the office.","correct":"✓ He wore a Thjatsi during the traditional festival.","note":"Wearing a Thjatsi is typically reserved for cultural or traditional events rather than everyday office wear."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_cultural_terms":["dhoti","kurta","safa","pagri"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly used in general English)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Thjatsi\" is a culturally specific term referring to a traditional garment worn by men in the Rajasthan region of India. Due to its limited usage outside of this specific cultural context, it is not typically encountered in general English. Understanding and using this word requires cultural awareness and sensitivity."},"example_sentences":[{"sentence":"The groom looked regal in his silk Thjatsi and embroidered kurta.","translation":"花婿は絹のThjatsiと刺繍のクルタを着て、威厳があるように見えました。","type":"noun","meaning_category":"traditional garment"},{"sentence":"During the Rajasthan festival, many men could be seen wearing vibrantly colored Thjatsis.","translation":"ラジャスタンの祭りの間、多くの男性が鮮やかな色のThjatsiを着ているのが見られました。","type":"noun","meaning_category":"traditional garment"}]}