{"word":"building-oriented","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"建物指向の、建物中心の","english_definition":"Designed or focused primarily on buildings or the construction of buildings.","examples":[{"sentence":"The curriculum is building-oriented, focusing on architectural design and construction techniques.","translation":"そのカリキュラムは建物指向で、建築設計と建設技術に焦点を当てています。"},{"sentence":"The company's strategy is building-oriented, aiming to develop innovative construction materials.","translation":"その会社の戦略は建物指向で、革新的な建設資材の開発を目指しています。"},{"sentence":"The software is building-oriented, providing tools for architectural modeling and structural analysis.","translation":"そのソフトウェアは建物指向で、建築モデリングと構造解析のためのツールを提供します。"}],"collocations":["building-oriented design (建物指向のデザイン)","building-oriented software (建物指向のソフトウェア)","building-oriented approach (建物指向のアプローチ)","building-oriented curriculum (建物指向のカリキュラム)","building-oriented strategy (建物指向の戦略)"],"synonyms":["architecture-focused","construction-centered","structure-based","architectural"],"antonyms":["landscape-oriented","nature-focused","environment-centered"]}],"etymology":{"value":"The term 'building-oriented' is formed by combining the noun 'building' with the suffix '-oriented', which indicates a focus or direction towards something.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈbɪldɪŋ ˌɔːriˌentɪd/","syllables":"build-ing-o-ri-ent-ed"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Building-oriented' is used to describe things that are specifically designed or focused on buildings. This can include software, curricula, strategies, or designs. It implies a primary emphasis on the construction, design, or maintenance of buildings.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building is oriented to the sun.","correct":"✓ The building is oriented towards the sun.","note":"When describing the direction a building faces, use 'oriented towards' or 'facing'. 'Building-oriented' describes the nature or focus of something, not its physical direction."}],"priority":"☆☆☆"},"related_words":{"derivatives":["orientation (名詞: 方向付け、志向)"],"related_terms":["architecture","construction","building design","structural engineering"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Building-oriented' is a specialized term used to describe something that is focused on buildings. It is commonly used in fields such as architecture, construction, and software development to indicate that a particular product, service, or approach is primarily concerned with buildings and their construction or design. This term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The university offers a building-oriented degree program in civil engineering.","translation":"その大学は、土木工学における建物指向の学位プログラムを提供しています。","type":"general","meaning_category":"建物指向の教育プログラム"},{"sentence":"The company developed a building-oriented simulation tool for energy efficiency.","translation":"その会社は、エネルギー効率のための建物指向のシミュレーションツールを開発しました。","type":"technical","meaning_category":"建物指向のソフトウェア"},{"sentence":"The city's urban planning strategy is building-oriented, prioritizing high-rise developments.","translation":"その都市の都市計画戦略は建物指向で、高層ビル開発を優先しています。","type":"urban planning","meaning_category":"建物指向の都市計画"}]}