{"word":"Luddite","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ラッダイト運動家、機械打ち壊し主義者","english_definition":"a member of any of the bands of English workers who destroyed machinery, especially in cotton and woolen mills, that they believed was threatening their jobs (1811–16); one who is opposed to technological change.","examples":[{"sentence":"The original Luddites were textile workers who destroyed machines in factories.","translation":"元々のラッダイト運動家は、工場で機械を破壊した繊維労働者でした。"},{"sentence":"He was labeled a Luddite because he refused to use a computer.","translation":"彼はコンピュータの使用を拒否したため、機械打ち壊し主義者というレッテルを貼られた。"}],"collocations":["be labeled a Luddite (ラッダイトというレッテルを貼られる)","Luddite movement (ラッダイト運動)","Neo-Luddite (ネオ・ラッダイト)"],"synonyms":["technophobe","anti-technology activist","reactionary"],"antonyms":["technophile","early adopter","innovator"]},{"part_of_speech":"adjective","definition":"機械打ち壊し主義の、技術革新に反対する","english_definition":"opposed to new technology or ways of working.","examples":[{"sentence":"The company's Luddite approach to innovation has hindered its growth.","translation":"その会社の技術革新に対する機械打ち壊し主義的なアプローチは、成長を妨げてきた。"},{"sentence":"Some see environmental activists as having a Luddite attitude towards progress.","translation":"環境保護活動家の中には、進歩に対して機械打ち壊し主義的な態度をとっていると見なす人もいる。"}],"collocations":["Luddite approach (機械打ち壊し主義的なアプローチ)","Luddite attitude (機械打ち壊し主義的な態度)"],"synonyms":["anti-technology","technophobic","reactionary"],"antonyms":["pro-technology","technophilic","progressive"]}],"etymology":{"value":"1811年に始まったイギリスの労働者による機械破壊運動（ラッダイト運動）に由来する。この運動は、伝説的な人物ネッド・ラッド（Ned Ludd）またはキング・ラッド（King Ludd）に率いられたとされたが、ネッド・ラッドが実在の人物であったかどうかは不明である。","priority":"★★★"},"pronunciation":{"ipa":"/ˈlʌdaɪt/","syllables":"Lud-dite"},"inflection":{"noun_plural":"Luddites","notes":"形容詞形は変化しません。"},"usage_notes":{"explanation":"「**Luddite**」は、元々は19世紀初頭のイギリスで産業革命期の機械化に反対し、機械を破壊した労働者を指す言葉でした。現在では、技術革新や新しいテクノロジー全般に反対する人を指す言葉として使われます。必ずしも機械を破壊するような暴力的な行動を伴うとは限りませんが、新しい技術に対する強い抵抗感や懐疑的な態度を表す際に用いられます。しばしば、変化を恐れる保守的な人、進歩に抵抗する人という否定的なニュアンスを含みます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Luddite because he doesn't know how to use a smartphone.","correct":"✓ He is a Luddite because he is against the use of smartphones.","note":"単に技術を知らない、使えないというだけでは Luddite とは言えません。技術の使用に反対する、あるいは技術が社会に与える影響を懸念している場合に Luddite と言えます。"},{"incorrect":"✗ The Luddites are always right.","correct":"✓ The Luddites have valid concerns about the impact of technology on jobs.","note":"Luddite という言葉は、しばしば否定的な意味合いで使われますが、技術革新がもたらす負の側面（失業、格差の拡大など）に対する正当な懸念を表明している場合もあります。一方的に Luddites を否定するのではなく、彼らの主張に耳を傾けることも重要です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Luddism (名詞: ラッダイト主義)","Neo-Luddism (名詞: ネオ・ラッダイト主義)","Neo-Luddite (名詞/形容詞: ネオ・ラッダイト)"],"phrases":["Luddite fallacy (ラッダイトの誤謬) - 技術革新が雇用を減少させるという誤った考え方"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低い頻度 (Relatively low frequency) - 一般的な会話ではあまり使われないが、テクノロジー、経済、社会に関する議論では用いられることがある。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Luddite**」は、歴史的な背景を持つ単語で、現代では技術革新に反対する人を指す言葉として使われます。この言葉は、19世紀初頭のイギリスで機械化に反対した労働者たち（ラッダイト運動）に由来します。現代では、新しいテクノロジーに対する抵抗感や、それが社会や雇用に与える影響を懸念する人々を指す際に用いられます。ただし、単に技術を使えない人ではなく、技術そのものに反対する姿勢を持つ人を指す点に注意が必要です。テクノロジー関連の記事や議論で時折見かける言葉です。"},"example_sentences":[{"sentence":"The professor was accused of being a **Luddite** because of his skepticism towards online learning.","translation":"その教授は、オンライン学習に対する懐疑的な姿勢から、機械打ち壊し主義者だと非難された。","type":"noun","meaning_category":"機械打ち壊し主義者"},{"sentence":"The company's **Luddite** policies stifled innovation and made it difficult to compete in the market.","translation":"その会社の機械打ち壊し主義的な政策は、技術革新を阻害し、市場での競争を困難にした。","type":"adjective","meaning_category":"技術革新に反対する"},{"sentence":"Some argue that the rise of artificial intelligence will lead to a new wave of **Luddism**.","translation":"人工知能の台頭は、新たなラッダイト運動の波を引き起こすと主張する人もいる。","type":"noun","meaning_category":"機械打ち壊し主義者"},{"sentence":"He is not a **Luddite**; he simply believes that technology should be used responsibly.","translation":"彼は機械打ち壊し主義者ではない。彼は単にテクノロジーは責任を持って使用されるべきだと信じているだけだ。","type":"noun","meaning_category":"機械打ち壊し主義者"}]}