{"word":"Emergents","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)創発論者、創発主義者","english_definition":"Plural form of 'emergentist': proponents of emergentism, a philosophical doctrine that novel properties arise when simple entities operate in an environment, forming more complex systems. These properties are 'emergent' in that they are not explicitly present in the simpler entities.","examples":[{"sentence":"The Emergents believe that consciousness cannot be reduced to mere neural activity.","translation":"創発論者たちは、意識は単なる神経活動に還元できないと考えている。"}],"collocations":["emergent property","emergent behavior","emergent system"],"synonyms":["emergentists"],"antonyms":["reductionists"]},{"part_of_speech":"noun","definition":"(複数形, 生物学)羽化直後の昆虫","english_definition":"Plural form of 'emergent': newly hatched or newly metamorphosed insects, especially aquatic insects like mayflies, dragonflies, and midges, that have just emerged from their larval or pupal stage.","examples":[{"sentence":"The river was teeming with Emergents, providing a feast for the trout.","translation":"川は羽化直後の昆虫で溢れ、マスにとってごちそうだった。"}],"collocations":["aquatic Emergents","mayfly Emergents"],"synonyms":["newly emerged insects"],"antonyms":[]}],"etymology":{"value":"Derived from 'emergent', which comes from the Latin 'emergere' (to bring forth, arise, come out), from 'e-' (out) + 'mergere' (to dip, plunge).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈmɜːrdʒənts/","syllables":"e-mer-gents"},"inflection":{"noun_plural":"Emergents"},"usage_notes":{"explanation":"'Emergents' has two main contexts: philosophical and biological. In philosophy, it refers to those who advocate for emergentism. In biology, particularly in aquatic entomology and fly fishing, it refers to the stage of an insect's life cycle immediately after it emerges from its pupal or nymphal stage but before it becomes a fully mature adult. The philosophical use is capitalized more often than the biological use.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The emergent are studying consciousness.","correct":"✓ The emergents are studying consciousness.","note":"When referring to multiple people who are emergentists, use the plural form 'emergents'."}],"priority":"★☆☆"},"related_words":{"derivatives":["emergent (adjective, noun)","emergentism (noun)","emerge (verb)","emergence (noun)"],"phrases":["emergent strategy","emergent curriculum"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Emergents' is a plural noun that can refer to either people who subscribe to the philosophical theory of emergentism, or to newly emerged insects, especially those that live in water during their larval stages. The context usually clarifies which meaning is intended. The philosophical meaning is more abstract and less common in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The philosophical debates among the Emergents centered on the nature of consciousness.","translation":"創発論者たちの哲学的な議論は、意識の本質を中心に行われた。","type":"noun","meaning_category":"創発論者"},{"sentence":"Fly fishermen often try to imitate the appearance of Emergents to attract fish.","translation":"フライフィッシャーマンは、魚を引き寄せるために、羽化直後の昆虫の外観を模倣しようとすることがよくある。","type":"noun","meaning_category":"羽化直後の昆虫"}]}