{"word":"Drafters","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(複数形)起草者、立案者、製図工","english_definition":"Plural form of 'drafter'. A person who drafts documents or designs; specifically, one who makes technical drawings.","examples":[{"sentence":"The drafters of the constitution aimed to create a fair and just society.","translation":"憲法の起草者たちは、公正で正義のある社会を創造することを目指した。"},{"sentence":"The drafters worked tirelessly to meet the deadline.","translation":"起草者たちは締め切りに間に合うように、休むことなく働いた。"},{"sentence":"The architectural firm hired several new drafters.","translation":"その建築事務所は数名の新しい製図工を雇った。"}],"collocations":["constitutional drafters (憲法起草者)","legal drafters (法律起草者)","technical drafters (技術製図工)","architectural drafters (建築製図工)"],"synonyms":["draftsman","designer","planner","formulator","originator"],"antonyms":[]}],"etymology":{"value":"'Drafter' is derived from 'draft', meaning to draw or outline. The suffix '-er' indicates a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdræftərz/","syllables":"draft-ers"},"inflection":{"noun_plural":"Drafters"},"usage_notes":{"explanation":"'Drafters' is the plural form of 'drafter', referring to multiple individuals involved in the process of drafting documents, plans, or technical drawings. The term can apply to those who create legal documents, such as contracts or legislation, or to those who produce detailed technical drawings for engineering or architectural projects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The drafters is working on the project.","correct":"✓ The drafters are working on the project.","note":"'Drafters' is plural, so it requires the plural verb 'are'."},{"incorrect":"✗ The drafters made a great draft.","correct":"✓ The drafters made a great draft. / ✓ The drafters produced a great draft.","note":"The sentence is grammatically correct, but using 'draft' as both the actor and the object can be repetitive. Consider using a synonym for 'made', such as 'produced'."}],"priority":"★★☆"},"related_words":{"derivatives":["draft (noun, verb)","drafting (noun)","draftsmanship (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Drafters' refers to multiple individuals who are engaged in the creation of initial versions of documents, plans, or drawings. This term is commonly used in legal, architectural, and engineering contexts. Understanding the term requires familiarity with formal language and professional roles within these fields."},"example_sentences":[{"sentence":"The team of drafters meticulously reviewed the contract before its finalization.","translation":"起草者チームは契約書の最終決定前に細心の注意を払って見直した。","type":"noun","meaning_category":"起草者"},{"sentence":"Many skilled drafters are employed in the engineering sector.","translation":"多くの熟練した製図工がエンジニアリング部門で雇用されている。","type":"noun","meaning_category":"製図工"},{"sentence":"The drafters of the bill worked late into the night.","translation":"その法案の起草者たちは夜遅くまで作業した。","type":"noun","meaning_category":"立案者"}]}