{"word":"Areopagite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アレオパゴス会議の議員、アレオパゴス会議のメンバー","english_definition":"A member of the Areopagus council in ancient Athens.","examples":[{"sentence":"Dionysius the Areopagite was converted to Christianity by Paul the Apostle.","translation":"アレオパゴス会議の議員であったディオニシウスは、使徒パウロによってキリスト教に改宗した。"}],"collocations":["Dionysius the Areopagite"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Late Latin *Areopagita*, from Ancient Greek *Ἀρεοπαγίτης* (Areopagítēs), from *Ἄρειος Πάγος* (Áreios Págos, “Ares' Hill”), the location of the council.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæriˈɒpəˌɡaɪt/","syllables":"A-re-o-pa-gite"},"inflection":{"noun_plural":"Areopagites"},"usage_notes":{"explanation":"The term *Areopagite* specifically refers to a member of the ancient Athenian council known as the Areopagus. It is most often encountered in historical or religious contexts, particularly when discussing the conversion of Dionysius the Areopagite in the New Testament.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":["Areopagus"],"related_terms":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word *Areopagite* is a specialized term used to describe a member of the ancient Athenian council, the Areopagus. It is primarily encountered in historical or religious texts, specifically those concerning ancient Athens or the New Testament. Due to its limited usage and specific context, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The apostle Paul debated with the philosophers and converted some, including Dionysius the Areopagite.","translation":"使徒パウロは哲学者たちと議論し、何人かを改宗させた。その中にはアレオパゴス会議の議員であったディオニシウスも含まれていた。","type":"noun","meaning_category":"Member of the Areopagus council"},{"sentence":"The writings attributed to Dionysius the Areopagite had a profound influence on medieval Christian theology.","translation":"アレオパゴス会議の議員ディオニシウスに帰せられる著作は、中世キリスト教神学に深い影響を与えた。","type":"noun","meaning_category":"Member of the Areopagus council"}]}