{"word":"mesoappendicitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"虫垂間膜炎","english_definition":"Inflammation of the mesoappendix (the peritoneal fold connecting the appendix to the mesentery).","examples":[{"sentence":"Mesoappendicitis can cause abdominal pain similar to appendicitis.","translation":"虫垂間膜炎は、虫垂炎と同様の腹痛を引き起こすことがある。"},{"sentence":"Diagnosis of mesoappendicitis often requires surgical exploration.","translation":"虫垂間膜炎の診断には、しばしば外科的検査が必要となる。"}],"collocations":["acute mesoappendicitis (急性虫垂間膜炎)","chronic mesoappendicitis (慢性虫垂間膜炎)"],"synonyms":["mesenteritis","appendiceal mesenteritis"],"antonyms":[]}],"etymology":{"value":"Derived from 'meso-' (referring to the mesentery or a connecting tissue), 'append-' (referring to the appendix), and '-itis' (denoting inflammation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɛzoʊˌæpɛndɪˈsaɪtɪs/","syllables":"me-so-ap-pen-di-ci-tis"},"inflection":{"noun_plural":"mesoappendicitides"},"usage_notes":{"explanation":"Mesoappendicitis is a relatively rare condition that can mimic the symptoms of appendicitis, making diagnosis challenging. It involves inflammation of the mesoappendix, the fold of tissue that attaches the appendix to the mesentery.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient had mesoappendicitis but the appendix was normal.","correct":"✓ The patient had mesoappendicitis, meaning the mesoappendix was inflamed while the appendix itself may have been normal.","note":"It is important to understand that mesoappendicitis specifically refers to inflammation of the mesoappendix, not necessarily the appendix itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["mesoappendix (虫垂間膜)","appendicitis (虫垂炎)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Mesoappendicitis is a medical term referring to the inflammation of the mesoappendix. This condition is relatively rare and can be difficult to diagnose, as its symptoms often resemble those of appendicitis. Understanding this term is primarily relevant in medical contexts.","note":"This term is specific to medical professionals and those studying related fields."},"example_sentences":[{"sentence":"The surgeon suspected mesoappendicitis based on the patient's symptoms and imaging results.","translation":"外科医は患者の症状と画像検査の結果から虫垂間膜炎を疑った。","type":"medical","meaning_category":"inflammation"},{"sentence":"In cases of mesoappendicitis, the mesoappendix appears swollen and inflamed during surgery.","translation":"虫垂間膜炎の場合、手術中に虫垂間膜が腫れて炎症を起こしているように見える。","type":"medical","meaning_category":"inflammation"}]}