{"word":"matronism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"女性上位主義、女性優越主義 (特に、女性が男性よりも道徳的に優れていると信じること)","english_definition":"The belief that women are superior to men, especially morally.","examples":[{"sentence":"Some critics argue that certain feminist ideologies can sometimes veer into matronism.","translation":"批評家の中には、特定のフェミニストイデオロギーが時として女性上位主義に傾倒することがあると主張する者もいる。"},{"sentence":"The novel explores the dangers of matronism and its impact on gender relations.","translation":"その小説は、女性上位主義の危険性とそれがジェンダー関係に与える影響を探求している。"}],"collocations":["moral matronism (道徳的女性上位主義)"],"synonyms":["gynocentrism","female chauvinism"],"antonyms":["misogyny","patriarchy"]},{"part_of_speech":"noun","definition":"(古風) 既婚女性の尊厳、既婚女性らしさ","english_definition":"(archaic) The dignity or character of a married woman; matronly qualities.","examples":[{"sentence":"The portrait captured the matronism of the subject, a respected figure in the community.","translation":"その肖像画は、地域社会で尊敬される人物である被写体の既婚女性らしさを捉えていた。"}],"collocations":[],"synonyms":["matronliness","womanliness"],"antonyms":[]}],"etymology":{"value":"\"Matron\"（既婚女性、婦人）に接尾辞 \"-ism\"（主義、傾向）が付いたもの。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmeɪtrənɪzəm/","syllables":"may-tron-ism"},"inflection":{"noun_plural":"matronisms"},"usage_notes":{"explanation":"「**matronism**」は、主に2つの意味で使用されます。1つ目は、女性が男性よりも道徳的に優れているという信念を指す、女性上位主義または女性優越主義です。この意味では、ジェンダーに関する議論やフェミニズムの文脈で用いられることがあります。2つ目の意味は古風な用法で、既婚女性の尊厳や品格、既婚女性らしさを指します。現代ではあまり使われません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He advocated for matronism in the workplace.","correct":"✓ He advocated for gender equality in the workplace.","note":"「matronism」は女性上位主義を意味するため、職場における公平性を提唱する文脈では「gender equality（男女平等）」を使う方が適切です。"},{"incorrect":"✗ The politician's matronism was well-received by the public.","correct":"✓ The politician's policies regarding women's rights were well-received by the public.","note":"政治家の政策が女性に好意的な場合、「matronism」を使うと女性上位主義を支持していると誤解される可能性があるため、「policies regarding women's rights（女性の権利に関する政策）」のような表現を使う方が適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":["matron (名詞: 既婚女性、婦長)","matronly (形容詞: 既婚女性らしい、年配の女性らしい)"],"phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**matronism**」は、あまり一般的ではない単語で、主に2つの意味があります。1つは、女性が男性よりも道徳的に優れているという信念を指す、女性上位主義または女性優越主義です。この意味は、ジェンダーに関する議論やフェミニズムの文脈で使われることがあります。もう1つは、古風な用法で、既婚女性の尊厳や品格を指します。現代ではほとんど使われません。この単語を使う際は、文脈を考慮し、意図する意味が明確に伝わるように注意する必要があります。"},"example_sentences":[{"sentence":"The play satirizes the idea of matronism, portraying women as overly sentimental and controlling.","translation":"その劇は女性上位主義の考えを風刺し、女性を過度に感傷的で支配的な存在として描いている。","type":"noun","meaning_category":"女性上位主義"},{"sentence":"The old photograph evoked a sense of matronism, showing the woman in a dignified and respectable pose.","translation":"その古い写真は、女性が威厳のある立派な姿勢で写っており、既婚女性らしさを感じさせた。","type":"noun","meaning_category":"既婚女性の尊厳 (古風)"}]}