{"word":"magpied","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"過去形・過去分詞: カササギのように集めた、盗んだ、またはカササギのように装飾した","english_definition":"Past tense and past participle of the verb 'to magpie': To collect or steal things in the manner of a magpie; to adorn or decorate something in a showy, often gaudy, way.","examples":[{"sentence":"The design was magpied from various sources without attribution.","translation":"そのデザインは、出典を明示せずに様々なソースから盗用された。"},{"sentence":"She had magpied bits of fabric and beads to create a unique dress.","translation":"彼女はユニークなドレスを作るために、生地やビーズの断片をカササギのように集めた。"},{"sentence":"The room was magpied with shiny trinkets and colorful decorations.","translation":"部屋は光沢のある装身具やカラフルな装飾で、カササギのように飾り立てられていた。"}],"collocations":["magpied design","magpied collection","magpied style"],"synonyms":["plagiarized","borrowed","appropriated","decorated","adorned","embellished"],"antonyms":["original","authentic","plain","understated"]}],"etymology":{"value":"Derived from the verb 'magpie,' which comes from the noun 'magpie,' a bird known for collecting shiny objects. The verb form developed to describe the act of collecting or stealing in a similar manner.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmæɡpaɪd/","syllables":"mag-pied"},"inflection":{"verb_forms":{"present_simple":["magpie","magpies"],"past_simple":"magpied","past_participle":"magpied","present_participle":"magpieing"}},"usage_notes":{"explanation":"'Magpied' is primarily used as the past tense and past participle of the verb 'magpie.' The verb describes the act of collecting or stealing things, often shiny or attractive objects, in a manner reminiscent of a magpie bird. It can also refer to decorating something in a showy or gaudy way, similar to how a magpie might collect and display shiny items. The term often carries a negative connotation, implying a lack of originality or ethical behavior, especially when used in the context of design or creative work.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He magpied the information from the internet.","correct":"✓ He magpied the information from the internet without attribution.","note":"While 'magpie' can imply stealing, it's often used to describe taking without giving credit. Adding 'without attribution' clarifies the meaning. Alternatively, one could use 'plagiarized' for a more direct accusation of stealing intellectual property."},{"incorrect":"✗ The room was magpied with simplicity.","correct":"✓ The room was magpied with gaudy decorations.","note":"'Magpied' implies a showy or gaudy style of decoration. Using it with 'simplicity' creates a contradiction. Use words like 'decorated' or 'arranged' if the intention is to describe a simple style."}],"priority":"★★☆"},"related_words":{"derivatives":["magpie (noun: カササギ)","magpie (verb: カササギのように集める、盗む、またはカササギのように装飾する)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Magpied' is a relatively uncommon word, primarily used in its past tense and past participle form. It describes the act of collecting or stealing things in the manner of a magpie, often implying a lack of originality or ethical behavior. It can also refer to decorating something in a showy or gaudy way. Understanding the behavior of magpies (birds known for collecting shiny objects) is helpful for grasping the meaning of this word. It's more likely to be encountered in writing or discussions about design, art, or intellectual property.","priority":"★★☆"},"example_sentences":[{"sentence":"Her style was magpied from various fashion magazines.","translation":"彼女のスタイルは様々なファッション雑誌から盗用されたものだった。","type":"verb (past participle)","meaning_category":"盗用された"},{"sentence":"The interior designer magpied elements from different eras to create an eclectic look.","translation":"インテリアデザイナーは折衷的な外観を作り出すために、異なる時代の要素をカササギのように集めた。","type":"verb (past simple)","meaning_category":"集めた"},{"sentence":"The presentation was magpied with flashy graphics and animations.","translation":"プレゼンテーションは派手なグラフィックとアニメーションで飾り立てられていた。","type":"verb (past participle)","meaning_category":"飾り立てられた"}]}