{"word":"Twice-infected","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"二度感染した、二回感染した","english_definition":"Having been infected with a disease or pathogen on two separate occasions.","examples":[{"sentence":"The patient was twice-infected with the flu this winter.","translation":"その患者は今冬、インフルエンザに二度感染した。"},{"sentence":"Studies show that being twice-infected with COVID-19 can increase the risk of long-term health problems.","translation":"研究によると、COVID-19に二度感染すると、長期的な健康問題のリスクが高まる可能性があることが示されている。"}],"collocations":["twice-infected with COVID-19","twice-infected with the flu","risk of being twice-infected"],"synonyms":["reinfected","double-infected"],"antonyms":["never infected","uninfected"]}],"etymology":{"value":"The word is formed by combining \"twice\" (meaning two times) with \"infected\" (meaning affected by a disease-causing organism).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈtwaɪs ɪnˈfɛktɪd/","syllables":"twice-in-fect-ed"},"inflection":{"notes":"This is an adjective, so it doesn't have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Twice-infected\" is used to describe someone who has experienced an infection, recovered, and then contracted the same or a similar infection again at a later time. It's often used in the context of viral or bacterial infections, such as influenza or COVID-19.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is twice infect.","correct":"✓ He is twice-infected.","note":"The correct form is the adjective \"twice-infected,\" not the verb \"infect.\""},{"incorrect":"✗ She was infected twice from the virus.","correct":"✓ She was twice-infected with the virus.","note":"The correct preposition to use is \"with.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["infection","infected","reinfection"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, typically used in medical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Twice-infected\" is a compound adjective used to describe someone who has been infected with a disease or pathogen on two separate occasions. It is commonly used in medical and scientific contexts, particularly when discussing viral or bacterial infections. The term implies that the person has recovered from the initial infection before contracting it again. Understanding this term requires a basic understanding of medical terminology and the concept of reinfection."},"example_sentences":[{"sentence":"The study focused on the health outcomes of patients who were twice-infected with the same strain of influenza.","translation":"その研究は、同じ型のインフルエンザに二度感染した患者の健康状態に焦点を当てた。","type":"adjective","meaning_category":"Medical"},{"sentence":"Being twice-infected with COVID-19 can lead to a higher risk of hospitalization.","translation":"COVID-19に二度感染すると、入院のリスクが高まる可能性がある。","type":"adjective","meaning_category":"Health"}]}