{"word":"inflation-loving","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"インフレを好む、インフレを歓迎する","english_definition":"Describing someone or something that benefits from or thrives in an inflationary environment. This could be due to holding assets that increase in value with inflation, or having debts that become easier to pay off.","examples":[{"sentence":"Some investors are inflation-loving because their real estate holdings tend to appreciate during periods of high inflation.","translation":"不動産を保有している投資家の中には、高インフレの時期に不動産の価値が上昇する傾向があるため、インフレを好む人もいます。"},{"sentence":"The government's policies, while not explicitly inflation-loving, have inadvertently created conditions where inflation is tolerated.","translation":"政府の政策は、明示的にインフレを好むものではないものの、意図せずインフレが容認される状況を作り出してしまっている。"}],"collocations":["inflation-loving investor","inflation-loving policy","inflation-loving asset"],"synonyms":["inflation-tolerant","inflation-benefiting","inflation-profiting"],"antonyms":["inflation-averse","inflation-hating","inflation-resistant"]}],"etymology":{"value":"A compound word formed by combining 'inflation' (a general increase in prices and fall in the purchasing value of money) with 'loving' (having an affection for).","priority":"medium"},"pronunciation":{"ipa":"/ɪnˈfleɪʃənˌlʌvɪŋ/","syllables":"in-fla-tion-luv-ing"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'inflation-loving' is often used in economic and financial contexts to describe entities (individuals, companies, or even governments) that, for various reasons, are not negatively affected by inflation and may even benefit from it. It's important to note that this is not necessarily a positive attribute from a societal perspective, as high inflation can have detrimental effects on the overall economy.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"The inflation-loving economy.","correct":"An economy that benefits from inflation.","note":"It's more accurate to describe the economy's condition rather than personifying it as 'inflation-loving'."}],"priority":"medium"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"'Inflation-loving' is a compound adjective used to describe something that benefits from inflation. Inflation is a general increase in prices and a decrease in the purchasing power of money. Therefore, something 'inflation-loving' is not harmed by this process and may even gain value or advantage from it. This term is often used in financial discussions."},"example_sentences":[{"sentence":"Real estate can be an inflation-loving investment, as property values tend to rise with the general price level.","translation":"不動産はインフレを好む投資となり得る。不動産の価値は一般的な物価水準の上昇とともに上昇する傾向があるからだ。","type":"adjective","meaning_category":"benefiting from inflation"},{"sentence":"Commodities are often considered inflation-loving assets.","translation":"コモディティはしばしばインフレを好む資産とみなされる。","type":"adjective","meaning_category":"benefiting from inflation"}]}