{"word":"administrativize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(組織・活動などを)管理化する、行政化する、官僚化する","english_definition":"to subject something to administrative control or procedures; to bureaucratize.","examples":[{"sentence":"The government sought to administrativize the healthcare system.","translation":"政府は医療制度を管理化しようとした。"},{"sentence":"The company's decision to administrativize the project slowed down progress.","translation":"会社がプロジェクトを管理化したことで、進捗が遅れた。"}],"collocations":["administrativize a system (システムを管理化する)","administrativize a process (プロセスを管理化する)","administrativize an organization (組織を管理化する)"],"synonyms":["bureaucratize","regulate","manage","control","govern"],"antonyms":["deregulate","decentralize","privatize"]}],"etymology":{"value":"\"Administrativize\" is formed by combining \"administrative\" with the suffix \"-ize,\" which means \"to make or become.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ədˈmɪnɪstreɪtɪvaɪz/","syllables":"ad-min-is-tra-ti-vize"},"inflection":{"verb_forms":{"present_simple":["administrativize","administrativizes"],"past_simple":"administrativized","past_participle":"administrativized","present_participle":"administrativizing"}},"usage_notes":{"explanation":"\"Administrativize\" is a relatively rare verb that describes the process of making something more administrative, often implying an increase in bureaucracy or regulation. It is often used critically to suggest that something has become overly controlled or inefficient due to administrative processes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The administrativized system was very efficient.","correct":"✓ The administratively managed system was very efficient.","note":"While \"administrativized\" can be used, it often carries a negative connotation of excessive bureaucracy. Using \"administratively managed\" might be more neutral."}],"priority":"★☆☆"},"related_words":{"derivatives":["administrative (adjective)","administration (noun)","administratively (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"administrativize\" is a complex term indicating the act of subjecting something to administrative processes, often implying increased bureaucracy and regulation. It is a relatively rare word, typically used in formal or critical contexts to describe the transformation of a system or organization into a more administratively controlled entity. Understanding the negative connotations associated with excessive bureaucracy is crucial when interpreting this word."},"example_sentences":[{"sentence":"The university decided to administrativize the research grant application process.","translation":"大学は研究助成金の申請プロセスを管理化することを決定した。","type":"verb","meaning_category":"管理化する"},{"sentence":"Many felt that administrativizing the small business would stifle its creativity.","translation":"多くの人は、中小企業を管理化することで、その創造性が阻害されると感じた。","type":"verb","meaning_category":"管理化する"}]}