{"word":"fatteners","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"太らせるもの、肥育剤、肥育業者","english_definition":"Substances or agents that promote weight gain; animals or people involved in fattening livestock.","examples":[{"sentence":"The farmer uses special fatteners to get his cattle ready for market.","translation":"その農家は、牛を市場に出す準備のために、特別な肥育剤を使用しています。"},{"sentence":"Be careful of hidden fatteners in processed foods.","translation":"加工食品に隠された太らせるものに注意してください。"},{"sentence":"These supplements are marketed as muscle builders, but they are really just fatteners.","translation":"これらのサプリメントは筋肉増強剤として販売されていますが、実際にはただの肥育剤です。"}],"collocations":["animal fatteners","hidden fatteners","natural fatteners","chemical fatteners"],"synonyms":["weight gain supplements","fattening agents","bulking agents"],"antonyms":["weight loss supplements","dietary aids","appetite suppressants"]}],"etymology":{"value":"From the verb 'fatten,' meaning to make fat or fleshy, plus the suffix '-er' (denoting an agent or thing that performs the action) and '-s' to make it plural.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfætənərz/","syllables":"fat-ten-ers"},"inflection":{"noun_plural":"fatteners"},"usage_notes":{"explanation":"'Fatteners' generally refers to substances or practices used to increase the weight of animals, especially livestock, for commercial purposes. It can also refer to foods or ingredients that contribute to weight gain in humans, often with a negative connotation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The fatteners are making me healthy.","correct":"✓ The fatteners are making me gain weight.","note":"'Fatteners' primarily cause weight gain, not necessarily health. Overconsumption can lead to health issues."},{"incorrect":"✗ Fatteners are good for losing weight.","correct":"✓ Fatteners are good for gaining weight.","note":"'Fatteners' are used to gain weight, not lose it."}],"priority":"★★★"},"related_words":{"derivatives":["fatten (verb)","fat (noun, adjective)","fattening (adjective)"],"phrases":["high-calorie foods","weight-gain diet","bulking phase"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'fatteners' is used to describe things that cause weight gain. It's often used in the context of farming, where animals are given special food to make them heavier before being sold. It can also be used to talk about foods that make people gain weight, but this is often seen as negative. It's not a very common word, so you're more likely to see it in specific situations like farming or discussions about diet."},"example_sentences":[{"sentence":"The farmer added protein supplements as fatteners to the cattle's diet.","translation":"農家は、牛の飼料に肥育剤としてタンパク質サプリメントを加えました。","type":"general"},{"sentence":"Many processed foods contain hidden fatteners that contribute to weight gain.","translation":"多くの加工食品には、体重増加に寄与する隠れた肥育剤が含まれています。","type":"diet"},{"sentence":"These fatteners can help livestock reach their target weight more quickly.","translation":"これらの肥育剤は、家畜がより早く目標体重に達するのに役立ちます。","type":"farming"}]}