{"word":"slack-bake","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(主に料理) 完全に焼き切らない、半焼きにする","english_definition":"(primarily cooking) To partially bake something; to not fully bake.","examples":[{"sentence":"The recipe calls for slack-baking the pie crust before adding the filling.","translation":"そのレシピでは、フィリングを加える前にパイ生地を半焼きにすることが求められています。"},{"sentence":"Slack-baking the bread dough allows it to be finished later.","translation":"パン生地を半焼きにすることで、後で焼き上げることができます。"}],"collocations":["slack-bake pie crust","slack-bake bread","slack-bake dough"],"synonyms":["parbake","partially bake"],"antonyms":["fully bake","overbake"]}],"etymology":{"value":"A compound word formed by combining \"slack\" (meaning loose or not tight) and \"bake.\" The term suggests a baking process that is intentionally incomplete.","priority":"★★★"},"pronunciation":{"ipa":"/ˈslækˌbeɪk/","syllables":"slack-bake"},"inflection":{"verb_forms":{"present_simple":["slack-bake","slack-bakes"],"past_simple":"slack-baked","past_participle":"slack-baked","present_participle":"slack-baking"}},"usage_notes":{"explanation":"\"Slack-bake\" is primarily used in culinary contexts to describe the process of partially baking food items, especially doughs and crusts. This technique is often used to prevent soggy bottoms in pies or to prepare doughs in advance for later finishing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I slack-baked the cake too much and it was dry.","correct":"✓ I overbaked the cake and it was dry.","note":"If the item is too dry, it was likely overbaked, not slack-baked."},{"incorrect":"✗ Slack-bake the meat for safety.","correct":"✓ Cook the meat to a safe internal temperature.","note":"Slack-baking is not a method for ensuring food safety with meats; they need to be cooked thoroughly."}],"priority":"★★☆"},"related_words":{"derivatives":["slack-baked (adjective)"],"phrasal_verbs":[],"related_terms":["blind bake","parboil","precook"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"slack-bake\" is a specialized culinary term, indicating a partial baking process. Understanding requires familiarity with baking techniques and terminology. It is not a common word in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"To avoid a soggy crust, slack-bake the pie shell for about 15 minutes.","translation":"生地が水っぽくならないように、パイ生地を約15分間半焼きにします。","type":"verb","meaning_category":"cooking"},{"sentence":"The slack-baked rolls can be frozen and finished later.","translation":"半焼きのロールパンは冷凍して、後で焼き上げることができます。","type":"adjective","meaning_category":"cooking"}]}