{"word":"sooty-planed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having a surface or texture that appears to be smoothed or flattened by soot, or resembling something that has been smoothed by soot.","english_definition":"Describing a surface or texture that looks smoothed or flattened by soot. This is a niche descriptor, likely used in specific contexts such as describing objects affected by smoke or fire.","examples":[{"sentence":"The sooty-planed table revealed the intricate wood grain beneath years of accumulated grime.","translation":"すすで平らになったように見えるテーブルは、長年蓄積された汚れの下に隠されていた複雑な木目を明らかにした。"},{"sentence":"The artist used a sooty-planed effect to create a sense of age and history in the painting.","translation":"アーティストは、絵画に古さと歴史の感覚を作り出すために、すすで平らになったような効果を使用した。"}],"collocations":["sooty-planed surface","sooty-planed texture","sooty-planed wood","sooty-planed metal"],"synonyms":["smoked","blackened","grimed","charred","smoothed","flattened"],"antonyms":["clean","polished","untouched"]}],"etymology":{"value":"The word is a compound of 'sooty' (covered with or resembling soot) and 'planed' (smoothed or flattened as if by a plane). It suggests a surface that has been both blackened by soot and smoothed in appearance.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈsʊtiˌpleɪnd/","syllables":"soo-ty-planed"},"inflection":{"notes":"This is an adjective and does not inflect further."},"usage_notes":{"explanation":"The term 'sooty-planed' is highly descriptive and not commonly used. It evokes a specific image of something that has been affected by soot and appears smoothed or flattened as a result. Its use is likely limited to literary or artistic contexts where precise and evocative language is valued.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sooty-planed sky indicated rain.","correct":"✓ The sooty sky indicated rain.","note":"'Sooty-planed' refers to a surface that is both blackened by soot and appears smoothed. It's not appropriate for describing the sky. 'Sooty' alone is sufficient."},{"incorrect":"✗ He used a sooty-planed to smooth the wood.","correct":"✓ He used a plane to smooth the wood.","note":"'Sooty-planed' is an adjective, not a noun. A plane is a tool used for smoothing wood."}],"priority":"★☆☆"},"related_words":{"derivatives":["soot","sooty","plane","planed"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sooty-planed' is a highly specialized and descriptive term, unlikely to be encountered outside of literary or artistic contexts. Understanding requires a strong vocabulary and the ability to interpret nuanced descriptions. The term combines the visual image of soot with the texture of a planed surface, creating a specific and evocative effect."},"example_sentences":[{"sentence":"The archaeologist carefully brushed away the dust to reveal the sooty-planed surface of the ancient artifact.","translation":"考古学者は慎重にほこりを払い、古代の工芸品のすすで平らになったように見える表面を明らかにした。","type":"adjective","meaning_category":"Descriptive"}]}