{"word":"Morea","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"モレア半島 (ギリシャのペロポネソス半島の旧称)","english_definition":"A peninsula in southern Greece, forming the part of the country south of the Gulf of Corinth; also known as the Peloponnese.","examples":[{"sentence":"The Morea is a region rich in ancient history.","translation":"モレア半島は古代の歴史が豊かな地域です。"},{"sentence":"We visited several historical sites in the Morea.","translation":"私たちはモレア半島にあるいくつかの史跡を訪れました。"}],"collocations":["Visit Morea","Explore the Morea","History of Morea"],"synonyms":["Peloponnese","Peloponnesus"],"antonyms":[]}],"etymology":{"value":"The name Morea is of uncertain origin. One theory suggests it derives from the mulberry tree (Greek: 'morea'), which was abundant in the region. Another theory suggests it comes from the Slavic word for 'sea'. The name was used during the Middle Ages and the Ottoman period.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈriːə/","syllables":"Mo-re-a"},"inflection":{"notes":"単数形のみ。地名のため複数形は通常ありません。"},"usage_notes":{"explanation":"'Morea' is primarily a historical and geographical term. While 'Peloponnese' is the modern and more commonly used name for the peninsula, 'Morea' is still encountered in historical contexts, literature, and sometimes in informal usage. When referring to the region in a contemporary setting, 'Peloponnese' is generally preferred.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to Morea this summer.","correct":"✓ I am going to the Peloponnese this summer.","note":"In modern context, Peloponnese is more common."},{"incorrect":"✗ Morea is an island.","correct":"✓ Morea is a peninsula.","note":"Morea is a peninsula, not an island."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2 (historical context)","frequency_google_ngram":"Relatively low frequency. More common in historical texts than in modern usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Morea' is a historical name for the Peloponnese peninsula in Greece. It's less commonly used today, with 'Peloponnese' being the standard term. You'll likely encounter 'Morea' in historical texts or when discussing the region's past. It's important to know that it refers to the same geographical area as the modern Peloponnese.","priority":"★★★"},"example_sentences":[{"sentence":"The Byzantine Empire controlled the Morea for several centuries.","translation":"ビザンツ帝国は何世紀にもわたってモレア半島を支配していました。","type":"historical context","meaning_category":"歴史的文脈"},{"sentence":"Many battles were fought in the Morea during the Greek War of Independence.","translation":"ギリシャ独立戦争中、モレア半島では多くの戦いが繰り広げられました。","type":"historical context","meaning_category":"歴史的文脈"},{"sentence":"The Venetians held several fortresses in the Morea.","translation":"ベネチア人はモレア半島にいくつかの要塞を所有していました。","type":"historical context","meaning_category":"歴史的文脈"}]}