{"word":"Pipistrellus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヒナコウモリ属","english_definition":"A genus of small bats within the family Vespertilionidae (the vesper bats).","examples":[{"sentence":"The common pipistrelle (Pipistrellus pipistrellus) is one of the most frequently observed bat species in Europe.","translation":"ヨーロッパで最も頻繁に観察されるコウモリの一種は、アブラコウモリ（Pipistrellus pipistrellus）です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Italian word 'pipistrello' meaning bat, which is itself likely onomatopoeic, imitating the bat's high-pitched calls.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɪpɪˈstrɛləs/","syllables":"Pi-pi-strel-lus"},"inflection":{"noun_plural":"Pipistrellus (used as a genus name, plural is rarely used)"},"usage_notes":{"explanation":"'Pipistrellus' is a scientific term used in biology and zoology to refer specifically to bats belonging to this genus. It is typically used in formal contexts, such as scientific publications, field guides, and educational materials.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["pipistrelle (common name for bats in this genus)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (scientific vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pipistrellus' is a scientific term used to classify a specific genus of bats. It is primarily encountered in scientific or technical contexts related to zoology, biology, or wildlife conservation. Understanding this term requires a familiarity with scientific nomenclature and the classification of living organisms."},"example_sentences":[{"sentence":"Several species of Pipistrellus are known to exhibit unique echolocation calls.","translation":"ヒナコウモリ属のいくつかの種は、独特のエコーロケーションコールを示すことが知られています。","type":"noun","meaning_category":"Genus of bats"},{"sentence":"Conservation efforts are crucial to protect Pipistrellus habitats from deforestation.","translation":"森林破壊からヒナコウモリ属の生息地を保護するためには、保全活動が不可欠です。","type":"noun","meaning_category":"Genus of bats"}]}