{"word":"legpulling","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"冗談、からかい、おふざけ","english_definition":"an act of teasing or joking with someone, often in a playful or mischievous way.","examples":[{"sentence":"Don't take him seriously; he's just legpulling.","translation":"彼を真剣に受け止めないで。彼はただ冗談を言っているだけだよ。"},{"sentence":"The politician accused the journalist of legpulling when asked about the controversial issue.","translation":"政治家は、物議を醸している問題について質問された際、ジャーナリストがからかっていると非難した。"},{"sentence":"Their relationship was built on good-natured legpulling.","translation":"彼らの関係は、悪意のない冗談に基づいていた。"}],"collocations":["good-natured legpulling (悪意のない冗談)","playful legpulling (ふざけた冗談)","mischievous legpulling (いたずらっぽい冗談)"],"synonyms":["teasing","joking","banter","ribbing","kidding","joshing"],"antonyms":["serious conversation","earnest discussion"]}],"etymology":{"value":"'Leg' + 'pulling'. Originally referred to the act of physically pulling someone's leg to make them fall, but the meaning evolved to mean deceiving or teasing someone.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛɡˌpʊlɪŋ/","syllables":"leg-pull-ing"},"inflection":{"noun_plural":"legpullings"},"usage_notes":{"explanation":"'Legpulling' is typically used to describe lighthearted teasing or joking, often intended to be humorous rather than malicious. It implies a playful deception or exaggeration. The phrase is more common in British English.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was legpulling me with a serious face.","correct":"✓ He was teasing me with a serious face.","note":"While 'legpulling' implies teasing, it's less common to use it to describe the manner in which someone is teasing. 'Teasing' is more versatile in this context."},{"incorrect":"✗ The legpulling was very hurtful.","correct":"✓ The teasing was very hurtful.","note":"If the teasing is genuinely hurtful or malicious, words like 'bullying' or 'harassment' might be more appropriate. 'Legpulling' usually implies a lighter, more playful form of teasing."}],"priority":"★★☆"},"related_words":{"derivatives":["legpuller (名詞: からかう人、冗談を言う人)"],"phrasal_verbs":[],"idioms_phrases":["to pull someone's leg (人をからかう、人をだます)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Legpulling' is a noun that describes the act of playfully teasing or joking with someone. It implies a lighthearted attempt to deceive or trick someone, often for amusement. The term is somewhat informal and more commonly used in British English. It's important to note that while 'legpulling' is generally harmless, it can sometimes be misinterpreted if the recipient doesn't understand the intent behind the teasing."},"example_sentences":[{"sentence":"The comedian's act was full of legpulling and witty remarks.","translation":"コメディアンの演技は、冗談と機知に富んだ発言でいっぱいだった。","type":"noun","meaning_category":"冗談、からかい"},{"sentence":"He's always legpulling his friends, but they know he doesn't mean any harm.","translation":"彼はいつも友達をからかっているが、彼らは彼に悪意がないことを知っている。","type":"verb (implied)","meaning_category":"からかう"},{"sentence":"The manager's legpulling helped to lighten the mood during the stressful meeting.","translation":"マネージャーの冗談は、ストレスの多い会議中の雰囲気を和らげるのに役立った。","type":"noun","meaning_category":"冗談、おふざけ"}]}