{"word":"subconservator","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)後見人の下位に位置する後見人、または保護観察官の下位に位置する保護観察官","english_definition":"(law) A conservator who is subordinate to another conservator; or a sub-official in a conservatorship.","examples":[{"sentence":"The court appointed a subconservator to assist the primary conservator in managing the estate.","translation":"裁判所は、遺産の管理において主要な後見人を支援するために、下位後見人を任命した。"},{"sentence":"As a subconservator, he reported directly to the lead conservator on all financial matters.","translation":"下位後見人として、彼はすべての財務事項について主任後見人に直接報告した。"}],"collocations":["appoint a subconservator","assist the conservator","report to the lead conservator"],"synonyms":["assistant conservator","deputy conservator"],"antonyms":["conservator"]}],"etymology":{"value":"The word 'subconservator' is formed by combining the prefix 'sub-' (meaning 'under' or 'below') with the word 'conservator'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsʌbkənˈsɜːrvətər/","syllables":"sub-con-ser-va-tor"},"inflection":{"noun_plural":"subconservators"},"usage_notes":{"explanation":"The term 'subconservator' is primarily used in legal contexts to describe an individual who assists or acts under the authority of a primary conservator. The subconservator's responsibilities are typically delegated by the conservator and may include managing finances, healthcare decisions, or other aspects of the conservatee's well-being.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a sub-conservator of energy.","correct":"✓ He is involved in energy subconservation.","note":"'Subconservator' specifically refers to a legal role. For other contexts, use related terms like 'subconservation' or 'assistant'. "},{"incorrect":"✗ The subconservator has full authority.","correct":"✓ The conservator has full authority; the subconservator assists.","note":"The subconservator's authority is always derived from the primary conservator."}],"priority":"★★☆"},"related_words":{"derivatives":["conservator","conservatorship","sub-","assistant","deputy"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'subconservator' is a specialized legal term. Understanding requires familiarity with legal concepts like conservatorship and delegation of authority. The word's meaning is directly derived from its components, 'sub-' indicating a subordinate role to the 'conservator'. Usage is primarily limited to legal and administrative contexts. "},"example_sentences":[{"sentence":"The subconservator was responsible for managing the daily expenses of the ward.","translation":"下位後見人は、被後見人の日々の出費の管理を担当した。","type":"example","meaning_category":"legal"},{"sentence":"Due to the conservator's illness, the subconservator temporarily assumed full responsibilities.","translation":"後見人の病気のため、下位後見人が一時的にすべての責任を引き継いだ。","type":"example","meaning_category":"legal"}]}