{"word":"pregolfing","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Activities or preparations undertaken before playing a round of golf.","english_definition":"Activities or preparations undertaken before playing a round of golf, such as warming up, practicing on the putting green, or socializing with other players.","examples":[{"sentence":"His pregolfing routine includes stretching and hitting a few balls at the driving range.","translation":"彼のプレゴルフのルーティンには、ストレッチと打ちっぱなしでの数球の打ち込みが含まれています。"},{"sentence":"The pregolfing chatter was all about who had the best chance of winning the tournament.","translation":"プレゴルフのおしゃべりは、誰がトーナメントで優勝する可能性が最も高いかということばかりだった。"}],"collocations":["pregolfing routine","pregolfing activities","pregolfing preparations","pregolfing warm-up","pregolfing rituals"],"synonyms":["warm-up","practice","preparation"],"antonyms":["postgolfing"]},{"part_of_speech":"verb","transitivity":"vi","definition":"To engage in activities or preparations before playing a round of golf.","english_definition":"To engage in activities or preparations before playing a round of golf, such as warming up, practicing on the putting green, or socializing with other players.","examples":[{"sentence":"We pregolfed for about an hour before our tee time.","translation":"私たちはティータイムの約1時間前にプレゴルフをした。"},{"sentence":"They pregolfed extensively, hoping to improve their performance.","translation":"彼らはパフォーマンスを向上させることを期待して、集中的にプレゴルフをした。"}],"collocations":["pregolf before a round","pregolf to warm up","pregolf to practice","pregolf with friends"],"synonyms":["warm up","practice","prepare"],"antonyms":["postgolf"]}],"etymology":{"value":"Formed by adding the prefix 'pre-' (meaning 'before') to the word 'golfing.'","priority":"★★★"},"pronunciation":{"ipa":"/priːˈɡɒlfɪŋ/","syllables":"pre-golf-ing"},"inflection":{"verb_forms":{"present_simple":["pregolfs"],"past_simple":"pregolfed","past_participle":"pregolfed","present_participle":"pregolfing"}},"usage_notes":{"explanation":"'Pregolfing' is a relatively new term used to describe the activities and preparations that golfers undertake before beginning a round of golf. It can refer to physical activities like stretching and practicing swings, as well as social activities like chatting with fellow players. The term is becoming more common as golfers increasingly focus on optimizing their performance and enjoyment of the game.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to pre-golf.","correct":"✓ I am going pregolfing.","note":"When used as a verb, 'pregolf' is often used in the present participle form ('pregolfing') to describe the activity. Using 'pre-golf' as a verb requires careful phrasing to sound natural."}],"priority":"★★☆"},"related_words":{"derivatives":["pregame","warm-up","practice"],"related_sports_terms":["golf","tee time","driving range","putting green","fairway","green"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Pregolfing' refers to the activities you do before playing golf, like practicing your swing or putting. It's a combination of 'pre-' (meaning before) and 'golfing'. Think of it as the warm-up or preparation phase before you start your actual golf game. It's not a super common word, but golfers will understand what you mean.","priority":"★★☆"},"example_sentences":[{"sentence":"The players were pregolfing on the practice range, getting ready for the tournament.","translation":"選手たちはトーナメントに備えて、練習場でプレゴルフをしていた。","type":"verb","meaning_category":"Preparing for golf"},{"sentence":"Proper stretching is an important part of any pregolfing routine.","translation":"適切なストレッチは、あらゆるプレゴルフのルーティンにおいて重要な部分である。","type":"noun","meaning_category":"Routine before golf"},{"sentence":"He spent an hour pregolfing, hitting balls and practicing his putting.","translation":"彼は1時間プレゴルフをして、ボールを打ち、パッティングの練習をした。","type":"verb","meaning_category":"Practicing before golf"}]}