{"word":"anti-Israelism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"反イスラエル主義：イスラエル国家、またはその特定の政策やイデオロギーに反対する立場や運動。","english_definition":"Opposition to the State of Israel, or to specific policies or ideologies of the Israeli government.","examples":[{"sentence":"Some critics argue that certain forms of anti-Israelism can border on antisemitism.","translation":"一部の批評家は、特定の形態の反イスラエル主義は反ユダヤ主義に隣接する可能性があると主張している。"},{"sentence":"The protests were organized to express anti-Israelism and support for Palestinian rights.","translation":"その抗議活動は、反イスラエル主義を表明し、パレスチナ人の権利を支持するために組織された。"},{"sentence":"It's important to distinguish between legitimate criticism of Israeli policies and anti-Israelism rooted in prejudice.","translation":"イスラエルの政策に対する正当な批判と、偏見に根ざした反イスラエル主義を区別することが重要である。"}],"collocations":["express anti-Israelism (反イスラエル主義を表明する)","criticize anti-Israelism (反イスラエル主義を批判する)","anti-Israelism movement (反イスラエル主義運動)","anti-Israelism rhetoric (反イスラエル主義的なレトリック)"],"synonyms":["opposition to Israel","criticism of Israeli policies"],"antonyms":["pro-Israelism","Zionism"]},{"part_of_speech":"noun","definition":"（より広義には）イスラエル国家の存在そのものに反対するイデオロギー。","english_definition":"(More broadly) The ideology that opposes the existence of the State of Israel.","examples":[{"sentence":"His anti-Israelism is based on the belief that Israel is an illegitimate colonial entity.","translation":"彼の反イスラエル主義は、イスラエルが不当な植民地主義的実体であるという信念に基づいている。"}],"collocations":["radical anti-Israelism (過激な反イスラエル主義)","ideological anti-Israelism (イデオロギー的な反イスラエル主義)"],"synonyms":["anti-Zionism"],"antonyms":["Zionism"]}],"etymology":{"value":"'Anti-' (反対) + 'Israel' (イスラエル) + '-ism' (主義) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈɪzriːəˌlɪzəm/","syllables":"an-ti-Is-ra-el-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Anti-Israelism' は、イスラエル国家に対する反対意見を指す言葉ですが、その範囲や根拠は様々です。イスラエルの特定の政策に対する批判から、イスラエル国家の存在そのものを否定するイデオロギーまで、幅広い立場を含みます。この言葉の使用は、議論の的となることが多く、反ユダヤ主義との関連性が指摘されることもあります。そのため、使用する際には注意が必要です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is anti-Israel, so he must be anti-Semitic.","correct":"While some forms of anti-Israelism can be associated with antisemitism, it's important not to assume that all critics of Israel are anti-Semitic.","note":"反イスラエル主義者であるからといって、必ずしも反ユダヤ主義者であるとは限りません。両者を混同しないように注意が必要です。"},{"incorrect":"The government supports anti-Israelism.","correct":"The government opposes anti-Israelism.","note":"政府が反イスラエル主義を支持することは稀です。通常は反対の立場を取ります。"}],"priority":"★★☆"},"related_words":{"derivatives":["anti-Israel (形容詞: 反イスラエルの)"],"phrases":["criticism of Israel","opposition to Israeli policies","boycott, divestment, and sanctions (BDS) movement"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anti-Israelism' は、イスラエル国家に対する反対意見を指す、やや専門的な用語です。イスラエルの政策に対する批判、イスラエル国家の正当性に対する疑問、あるいはイスラエル国家の存在そのものへの反対など、様々な立場を含みます。この用語は、政治的、社会的な議論において頻繁に登場し、関連する用語（反ユダヤ主義、シオニズムなど）との関係性を理解することが重要です。"},"example_sentences":[{"sentence":"The debate centered on whether the speaker's remarks constituted legitimate criticism of Israeli policies or crossed the line into anti-Israelism.","translation":"その討論は、講演者の発言がイスラエルの政策に対する正当な批判を構成するのか、それとも反イスラエル主義の域を超えているのかを中心に展開された。","type":"noun","meaning_category":"反イスラエル主義"},{"sentence":"Some argue that certain forms of anti-Israelism are a modern manifestation of antisemitism.","translation":"一部の人は、特定の形態の反イスラエル主義は、現代における反ユダヤ主義の表れであると主張している。","type":"noun","meaning_category":"反イスラエル主義"},{"sentence":"The university campus has become a battleground for competing views on Israel and anti-Israelism.","translation":"その大学のキャンパスは、イスラエルと反イスラエル主義に関する対立する見解の戦場となっている。","type":"noun","meaning_category":"反イスラエル主義"}]}