{"word":"Dermatozoonosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"皮膚病妄想、寄生虫妄想：実際には皮膚に寄生虫がいないにもかかわらず、寄生虫が皮膚にいると強く信じる精神疾患","english_definition":"A delusional belief that one is infested with parasites, insects, or other organisms on the skin, when no such infestation exists.","examples":[{"sentence":"The patient presented with classic symptoms of dermatozoonosis, including persistent scratching and reports of insects crawling on their skin.","translation":"その患者は、持続的な掻痒や皮膚を這う虫の報告など、皮膚病妄想の典型的な症状を示した。"},{"sentence":"Dermatozoonosis can be a challenging condition to treat, often requiring a combination of psychological and dermatological interventions.","translation":"皮膚病妄想は治療が難しい病状であり、心理的および皮膚科学的介入の組み合わせが必要となることが多い。"}],"collocations":["parasitophobia","delusional parasitosis","Ekbom syndrome"],"synonyms":["delusional parasitosis","Ekbom syndrome","parasitophobia"],"antonyms":[]}],"etymology":{"value":"「derma-」（皮膚）+「zoon」（動物）+「-osis」（病気の状態）に由来。皮膚に動物（寄生虫）がいるという妄想を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɜːrmətoʊzoʊˈɒnəsɪs/","syllables":"Der-ma-to-zo-o-no-sis"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Dermatozoonosisは、皮膚に寄生虫や虫がいるという誤った信念を持つ精神疾患を指します。患者はしばしば、掻痒、刺痛、皮膚を這う感覚などの症状を訴えますが、医学的な検査では寄生虫の存在は確認されません。この状態は、しばしば不安、うつ病、または他の精神疾患と関連しています。治療には、抗精神病薬や心理療法が含まれることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor diagnosed the patient with dermatozoonosis after finding parasites on their skin.","correct":"✓ The doctor suspected dermatozoonosis because the patient believed they had parasites, but no parasites were found.","note":"Dermatozoonosisは、実際には寄生虫がいない場合に診断される精神疾患です。"},{"incorrect":"✗ Dermatozoonosis is easily treated with antibiotics.","correct":"✓ Dermatozoonosis is typically treated with antipsychotic medications and/or psychotherapy.","note":"Dermatozoonosisは、感染症ではないため、抗生物質では治療できません。"}],"priority":"★★☆"},"related_words":{"derivatives":["dermatophobia (皮膚病恐怖症)","zoophobia (動物恐怖症)","psychosis (精神病)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Dermatozoonosis**」は、皮膚に寄生虫や虫がいるという妄想を抱く精神疾患を指す専門用語です。患者は、実際には寄生虫が存在しないにもかかわらず、皮膚に虫が這うような感覚や強い掻痒感を訴えます。この状態は、しばしば精神的な問題やストレスと関連しており、抗精神病薬や心理療法による治療が必要となる場合があります。医学や精神医学の分野で使用される高度な語彙です。"},"example_sentences":[{"sentence":"Patients with dermatozoonosis often present with excoriations from excessive scratching.","translation":"皮膚病妄想の患者は、過度の掻痒による皮膚剥離を伴うことが多い。","type":"general","meaning_category":"症状"},{"sentence":"The differential diagnosis for dermatozoonosis includes scabies and other parasitic infestations.","translation":"皮膚病妄想の鑑別診断には、疥癬やその他の寄生虫感染が含まれる。","type":"medical","meaning_category":"診断"},{"sentence":"Cognitive behavioral therapy can be an effective treatment for dermatozoonosis.","translation":"認知行動療法は、皮膚病妄想の効果的な治療法となり得る。","type":"treatment","meaning_category":"治療"}]}