{"word":"gentleman-tradesman","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的)紳士的な商人、紳士階級に属する商人","english_definition":"(historical) A tradesman who also possesses the qualities or status of a gentleman.","examples":[{"sentence":"In the 18th century, the gentleman-tradesman was a rising figure in British society, combining commercial success with social respectability.","translation":"18世紀には、紳士的な商人はイギリス社会で台頭する人物であり、商業的な成功と社会的な体面を兼ね備えていました。"}],"collocations":["a successful gentleman-tradesman","the ideal of the gentleman-tradesman"],"synonyms":["merchant","tradesman","shopkeeper","entrepreneur"],"antonyms":[]}],"etymology":{"value":"The term combines \"gentleman,\" denoting a man of good social standing, with \"tradesman,\" referring to someone engaged in commerce or trade.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒentlmən ˈtreɪdzmən/","syllables":"gen-tle-man-trades-man"},"inflection":{"noun_plural":"gentleman-tradesmen"},"usage_notes":{"explanation":"The term \"gentleman-tradesman\" refers to a historical figure, particularly prominent in the 18th and 19th centuries, who combined the characteristics of a gentleman (good manners, education, social standing) with the occupation of a tradesman (merchant, shopkeeper). This figure represented a blurring of traditional social class boundaries, as trade was historically seen as less respectable than land ownership or the professions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a gentleman, but not a gentleman-tradesman.","correct":"✓ He was a gentleman, but not necessarily involved in trade.","note":"The term specifically refers to someone who is both a gentleman and a tradesman. If someone is a gentleman but not involved in trade, they are simply a gentleman."}],"priority":"★☆☆"},"related_words":{"derivatives":["gentleman","tradesman"],"phrases":["self-made man","nouveau riche"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"gentleman-tradesman\" is a historical term referring to a tradesman who also possesses the qualities and social standing of a gentleman. It's a concept that reflects the changing social dynamics of the 18th and 19th centuries, where traditional class boundaries were becoming more fluid. Understanding this term requires some knowledge of historical social structures."},"example_sentences":[{"sentence":"The rise of the gentleman-tradesman challenged traditional notions of social hierarchy.","translation":"紳士的な商人の台頭は、社会階層の伝統的な概念に挑戦しました。","type":"general","meaning_category":"historical context"},{"sentence":"Daniel Defoe's novels often featured characters who could be described as gentleman-tradesmen.","translation":"ダニエル・デフォーの小説には、紳士的な商人と言える登場人物がよく登場しました。","type":"literature","meaning_category":"historical context"}]}