{"word":"homecomer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"帰郷者、帰国者","english_definition":"a person who returns to a place (such as a country or region) after a long absence.","examples":[{"sentence":"The town welcomed the homecomers with open arms.","translation":"町は帰郷者を両手を広げて歓迎した。"},{"sentence":"Many homecomers are bringing new skills and ideas to the region.","translation":"多くの帰郷者が新しいスキルやアイデアを地域にもたらしている。"},{"sentence":"The homecomer was eager to see their family and friends.","translation":"帰郷者は家族や友人に会うのを心待ちにしていた。"}],"collocations":["welcome homecomers (帰郷者を歓迎する)","returning homecomer (帰郷する人)","local homecomer (地元の帰郷者)"],"synonyms":["returnee","repatriate","expatriate returning home"],"antonyms":["emigrant","immigrant","expat"]},{"part_of_speech":"noun","definition":"（特にアメリカ英語で）同窓会参加者、帰省客","english_definition":"(especially in American English) a person who returns to their old school or college for a homecoming celebration.","examples":[{"sentence":"The homecomers enjoyed the football game and the parade.","translation":"同窓会参加者たちは、フットボールの試合とパレードを楽しんだ。"},{"sentence":"The college organized a special event for the homecomers.","translation":"大学は同窓会参加者のために特別なイベントを企画した。"},{"sentence":"Many homecomers reconnected with old classmates.","translation":"多くの同窓会参加者が昔のクラスメートと再会した。"}],"collocations":["homecoming game (同窓会試合)","homecoming weekend (同窓会週末)","alumni homecomer (卒業生の同窓会参加者)"],"synonyms":["alumnus/alumna returning for homecoming","reunion attendee"],"antonyms":[]}],"etymology":{"value":"\"Home\" + \"comer\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈhoʊmˌkʌmər/","syllables":"home-com-er"},"inflection":{"noun_plural":"homecomers"},"usage_notes":{"explanation":"\"Homecomer\" refers to someone returning to a place they once lived, especially after a long time. It can refer to someone returning to their hometown, country, or school. In the context of a school or college, it specifically refers to alumni returning for a homecoming event.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a home coming.","correct":"✓ He is a homecomer.","note":"\"Homecoming\" is a noun referring to the event, while \"homecomer\" is a noun referring to the person returning home."}],"priority":"★★☆"},"related_words":{"derivatives":["homecoming (noun: 帰郷、帰国、同窓会)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Homecomer\" is a noun that refers to a person who is returning to a place they used to live, usually after a long time away. This could be their hometown, their country, or even their old school. The word is often used in the context of welcoming people back to a community or celebrating their return. It's a fairly straightforward word, but it's not as common as some other words for people who are returning, like \"returnee\" or \"repatriate.\" In American English, it can also specifically refer to alumni returning for a college or high school homecoming event."},"example_sentences":[{"sentence":"The small village celebrated the return of its homecomers after the war.","translation":"その小さな村は、戦後、帰郷者たちの帰還を祝った。","type":"noun","meaning_category":"帰郷者"},{"sentence":"The university held a special reception for the alumni homecomers.","translation":"大学は卒業生の同窓会参加者のために特別な歓迎会を開催した。","type":"noun","meaning_category":"同窓会参加者"},{"sentence":"Many homecomers are choosing to invest in their local communities.","translation":"多くの帰郷者が地元のコミュニティへの投資を選んでいる。","type":"noun","meaning_category":"帰郷者"}]}