{"word":"athenaeums","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(特にアメリカ合衆国において) 図書館、読書室、文芸クラブ","english_definition":"libraries or reading rooms, especially in the United States; literary or scientific associations or clubs.","examples":[{"sentence":"Many cities in the US established athenaeums in the 19th century to promote learning.","translation":"アメリカの多くの都市は、学問を奨励するために19世紀にアテネウムを設立しました。"},{"sentence":"The Boston Athenaeum is a famous example of a private library and cultural institution.","translation":"ボストン・アテネウムは、私立図書館と文化施設の有名な例です。"}],"collocations":["found an athenaeum","join an athenaeum","visit an athenaeum"],"synonyms":["library","reading room","literary society","cultural institution"],"antonyms":[]}],"etymology":{"value":"古代ギリシャ語の 'Ἀθήναιον' (Athēnaion) に由来し、これは知恵、工芸、戦争の女神アテーナー (Athena) に捧げられた神殿または場所を指す。古代ローマでは、皇帝ハドリアヌスがローマにアテネウムを設立し、学術研究の場所とした。この意味が中世以降に、図書館や文芸クラブを指す言葉として広まった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæθəˈniːəmz/","syllables":"ath-e-nae-ums"},"inflection":{"noun_plural":"athenaeums"},"usage_notes":{"explanation":"'Athenaeum' (複数形: 'athenaeums') は、主にアメリカ合衆国で使用される言葉で、図書館、読書室、または文芸クラブを指します。これらの施設は、知識の普及と文化的な交流を目的として設立されることが多いです。語源は古代ギリシャに由来し、知恵の女神アテーナーに捧げられた場所を意味します。現代では、特に歴史的な背景を持つ図書館や文化施設を指す場合に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the athenaeum to borrow a book, but it was a museum.","correct":"✓ I went to the athenaeum to borrow a book.","note":"アテネウムは図書館や読書室であり、博物館ではありません。博物館に行きたい場合は、'museum'と言うべきです。"},{"incorrect":"✗ The athenaeum is a place for sports.","correct":"✓ The athenaeum is a place for reading and learning.","note":"アテネウムはスポーツをする場所ではなく、読書や学習をする場所です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["athenaeum (singular form)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Athenaeums' are libraries or literary clubs, often with a historical connection to promoting knowledge. This word is not commonly used in everyday conversation, and is more likely to be found in academic or historical contexts. It refers to a specific type of institution focused on learning and culture."},"example_sentences":[{"sentence":"The city's athenaeum houses a vast collection of rare books and manuscripts.","translation":"その都市のアテネウムには、貴重な書籍や写本が豊富に収蔵されています。","type":"noun","meaning_category":"図書館"},{"sentence":"Members of the athenaeum gathered for a lecture on classical literature.","translation":"アテネウムの会員たちは、古典文学に関する講演のために集まりました。","type":"noun","meaning_category":"文芸クラブ"}]}