{"word":"Skyriding","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(まれ) スカイライディング、空中遊泳、空中散歩","english_definition":"(rare) The activity of riding through the air, often involving aerial stunts or travel.","examples":[{"sentence":"The circus act featured daring feats of skyriding.","translation":"そのサーカスの出し物は、大胆なスカイライディングの妙技を特色としていた。"},{"sentence":"He dreamed of skyriding across the continents.","translation":"彼は大陸をスカイライディングで横断することを夢見ていた。"}],"collocations":["aerial skyriding","extreme skyriding","dream of skyriding"],"synonyms":["aerial stunt","air travel","flight","parachuting","wingsuit flying"],"antonyms":["ground travel","walking"],"notes":"This term is not widely used, and its precise meaning can vary depending on context. It may refer to activities such as parachuting, wingsuit flying, or other forms of aerial acrobatics or travel."}],"etymology":{"value":"Combination of 'sky' and 'riding', suggesting movement through the air.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskaɪˌraɪdɪŋ/","syllables":"sky-rid-ing"},"inflection":{"noun_plural":"Skyridings (rarely used)"},"usage_notes":{"explanation":"'Skyriding' is a relatively uncommon term. When used, it generally implies a form of aerial activity that involves skill, daring, or a sense of adventure. It can encompass various activities where a person is 'riding' through the sky, such as wingsuit flying or performing stunts in the air.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I went skyriding yesterday with my car.","correct":"✓ I went skydiving yesterday.","note":"'Skyriding' is not a common term for skydiving. Use 'skydiving' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["skyrider (noun): A person who engages in skyriding."],"related_terms":["skydiving","wingsuit flying","parachuting","aerial acrobatics"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Skyriding' is a rare term that describes the act of 'riding' through the sky. It is not a commonly used word, so it is important to understand the context in which it is used. It typically refers to activities such as wingsuit flying, aerial acrobatics, or other forms of aerial travel that involve skill and daring. Because it is not a standard term, it is often better to use more specific terms like 'skydiving' or 'wingsuit flying' to avoid confusion."},"example_sentences":[{"sentence":"The annual airshow featured a spectacular skyriding display.","translation":"毎年恒例の航空ショーでは、壮大なスカイライディングの展示が呼び物だった。","type":"noun","meaning_category":"空中遊泳・空中散歩"},{"sentence":"He envisioned a future where skyriding was a common mode of transportation.","translation":"彼はスカイライディングが一般的な交通手段となる未来を思い描いた。","type":"noun","meaning_category":"空中遊泳・空中散歩"}]}