{"word":"extradosed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(橋梁について)エクストラドーズド橋の、エクストラドーズド構造の","english_definition":"(of a bridge) having a design that combines features of both a prestressed box girder bridge and a cable-stayed bridge.","examples":[{"sentence":"The bridge is an extradosed structure, combining the best aspects of different bridge designs.","translation":"その橋はエクストラドーズド構造で、様々な橋のデザインの最も良い点を組み合わせている。"}],"collocations":["extradosed bridge","extradosed structure"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Extradosed' is a relatively modern term in bridge engineering. It's derived from 'extrados', referring to the upper, convex surface of an arch, combined with the idea of prestressing or post-tensioning techniques used in bridge construction.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛkstrəˈdoʊzd/","syllables":"ex-tra-dozed"},"inflection":{},"usage_notes":{"explanation":"The term 'extradosed' specifically refers to a type of bridge design. These bridges have relatively short towers (compared to cable-stayed bridges) and use prestressed concrete box girders. The cables are anchored to the top of the girders, providing additional support.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["extrados (noun: the exterior curve or surface of an arch)"],"related_terms":["cable-stayed bridge","suspension bridge","box girder bridge","prestressed concrete"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized term in engineering.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Extradosed' is a highly specialized term used in civil engineering, specifically in the context of bridge design. It describes a type of bridge that combines elements of both prestressed concrete girder bridges and cable-stayed bridges. Understanding this term requires familiarity with bridge engineering concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The new extradosed bridge significantly reduced traffic congestion in the area.","translation":"新しいエクストラドーズド橋は、その地域の交通渋滞を大幅に緩和した。","type":"adjective","meaning_category":"bridge design"},{"sentence":"Engineers chose an extradosed design due to its cost-effectiveness and structural efficiency.","translation":"エンジニアたちは、その費用対効果と構造効率の高さから、エクストラドーズド設計を選んだ。","type":"adjective","meaning_category":"bridge design"}]}