{"word":"osmolality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"浸透重量濃度：溶液中の溶媒1 kgあたりの溶質のモル浸透圧濃度の尺度。通常、mOsm/kg (ミリオスモル/kg) または Osm/kg (オスモル/kg) で表される。","english_definition":"The concentration of a solution expressed as the total number of solute particles (in osmoles) per kilogram of solvent. It is typically expressed in mOsm/kg (milliosmoles per kilogram) or Osm/kg (osmoles per kilogram).","examples":[{"sentence":"The osmolality of the blood is tightly regulated by the kidneys.","translation":"血液の浸透重量濃度は腎臓によって厳密に調節されている。"},{"sentence":"High osmolality can indicate dehydration.","translation":"高い浸透重量濃度は脱水症状を示唆することがある。"},{"sentence":"Osmolality is an important factor in maintaining fluid balance in the body.","translation":"浸透重量濃度は体内の水分バランスを維持する上で重要な要素である。"}],"collocations":["serum osmolality (血清浸透重量濃度)","urine osmolality (尿浸透重量濃度)","plasma osmolality (血漿浸透重量濃度)","increased osmolality (浸透重量濃度の上昇)","decreased osmolality (浸透重量濃度の低下)","measure osmolality (浸透重量濃度を測定する)","regulate osmolality (浸透重量濃度を調節する)"],"synonyms":["osmotic concentration","osmotic pressure (関連概念)"],"antonyms":["osmolarity (浸透圧濃度 - 溶媒1リットルあたり)"],"notes":"Osmolality is different from osmolarity, which is the number of osmoles of solute per liter of solution. Osmo**lality** is per kilogram of solvent, while osmo**larity** is per liter of solution. In dilute aqueous solutions, the values are similar, but the difference becomes significant in more concentrated solutions."}],"etymology":{"value":"Derived from 'osmole' (a unit of osmotic pressure) + '-ality' (a suffix indicating a state or quality). The term reflects the 'quality' or 'state' of a solution related to its osmotic concentration measured in osmoles per kilogram.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒzməˈlæləti/","syllables":"oz-mo-lal-i-ty"},"inflection":{"notes":"Plural form is 'osmolalities'."},"usage_notes":{"explanation":"Osmolality is a measure of solute concentration that takes into account the dissociation of molecules in solution. For example, NaCl dissociates into Na+ and Cl- ions, so 1 mole of NaCl contributes 2 osmoles of particles. It is a colligative property, meaning it depends on the number of particles, not their chemical nature. It is crucial in physiology for understanding fluid balance, kidney function, and intravenous fluid therapy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The osmolarity of the blood was measured in kg/L.","correct":"✓ The osmolality of the blood was measured in mOsm/kg.","note":"Osmolality is measured per kilogram of solvent (kg), while osmolarity is measured per liter of solution (L)."},{"incorrect":"✗ Osmolality is the same as molarity.","correct":"✓ Osmolality is related to osmotic pressure, not molarity.","note":"Osmolality reflects the osmotic activity of a solution, which depends on the number of particles, while molarity is the number of moles of solute per liter of solution."}],"priority":"★★☆"},"related_words":{"derivatives":["osmole (オスモル - 浸透圧の単位)","osmotic (浸透圧の)","osmolarity (浸透圧濃度)","tonicity (張度)","osmometer (浸透圧計)"],"related_terms":["colligative properties (束一的性質)","hypertonic (高張)","hypotonic (低張)","isotonic (等張)","diffusion (拡散)","osmosis (浸透)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門的な語彙)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 医学・生物学分野で使われる専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Osmolality' is a scientific term used to describe how concentrated a solution is, specifically by measuring the number of particles dissolved in a kilogram of solvent (like water). It's important in medicine because it helps doctors understand things like dehydration, kidney function, and how to give fluids to patients. It's different from 'osmolarity,' which measures the particles in a liter of solution. The difference matters more when solutions are very concentrated.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor ordered a serum osmolality test to check for dehydration.","translation":"医師は脱水症状を確認するために血清浸透重量濃度検査を指示した。","type":"general","meaning_category":"medical test"},{"sentence":"Changes in osmolality can affect cell volume.","translation":"浸透重量濃度の変化は細胞の体積に影響を与える可能性がある。","type":"general","meaning_category":"physiology"},{"sentence":"The normal range for plasma osmolality is 275-295 mOsm/kg.","translation":"血漿浸透重量濃度の正常範囲は275〜295 mOsm/kgである。","type":"general","meaning_category":"reference value"},{"sentence":"The kidneys regulate osmolality by controlling water reabsorption.","translation":"腎臓は水の再吸収を制御することによって浸透重量濃度を調節する。","type":"general","meaning_category":"kidney function"}]}