{"word":"Contractionist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(経済)緊縮財政主義者、景気収縮政策支持者","english_definition":"An advocate of contractionary economic policies, such as reducing government spending or raising interest rates, to combat inflation or reduce budget deficits.","examples":[{"sentence":"The contractionists argued that the only way to restore long-term economic health was to cut government spending.","translation":"緊縮財政主義者たちは、長期的な経済の健全性を取り戻す唯一の方法は政府支出を削減することだと主張した。"},{"sentence":"The debate between contractionists and expansionists continues to shape economic policy.","translation":"緊縮財政主義者と拡張主義者の間の議論は、経済政策を形成し続けている。"}],"collocations":["fiscal contractionist (財政緊縮主義者)","monetary contractionist (金融引き締め主義者)"],"synonyms":["austerity advocate","deflationist"],"antonyms":["expansionist","Keynesian"]},{"part_of_speech":"noun","definition":"(言語学)短縮形支持者","english_definition":"Someone who favors the use of contractions in language.","examples":[{"sentence":"The professor, a self-described contractionist, encouraged students to use contractions in their writing to make it sound more natural.","translation":"その教授は、自称短縮形支持者で、学生たちに文章をより自然に聞こえるように短縮形を使うよう勧めた。"}],"collocations":[],"synonyms":["contraction advocate"],"antonyms":["formalist","purist"]}],"etymology":{"value":"The term 'contractionist' is derived from 'contraction,' referring to the act of reducing or shrinking something. In economics, it refers to policies aimed at shrinking the economy (or its growth rate). In linguistics, it refers to the shortening of words.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈtrækʃənɪst/","syllables":"con-trac-tion-ist"},"inflection":{"noun_plural":"contractionists"},"usage_notes":{"explanation":"The term 'contractionist' has two primary meanings, one in economics and one in linguistics. In economics, it refers to someone who advocates for contractionary policies, such as reducing government spending or raising interest rates, often to combat inflation or reduce budget deficits. In linguistics, it refers to someone who favors the use of contractions (e.g., 'can't' for 'cannot') in language. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The contractionist policies led to economic expansion.","correct":"✓ The contractionist policies led to economic recession.","note":"Contractionist policies are intended to slow down or shrink the economy, not expand it. Therefore, they typically lead to recession or slower growth."}],"priority":"★☆☆"},"related_words":{"derivatives":["contraction (noun)","contractionary (adjective)"],"related_concepts":["austerity","fiscal policy","monetary policy","linguistics","grammar"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'contractionist' is a specialized term primarily used in the fields of economics and linguistics. In economics, it describes someone who supports policies aimed at reducing government spending or increasing interest rates to control inflation or reduce deficits. In linguistics, it refers to someone who favors the use of contractions in language. Due to its specialized nature, it is not commonly encountered in everyday language and is more likely to appear in academic or professional contexts. Understanding the context is crucial to interpreting the intended meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"As a fiscal contractionist, she believed in balancing the budget through spending cuts.","translation":"財政緊縮主義者として、彼女は支出削減を通じて予算の均衡を取ることを信じていた。","type":"noun","meaning_category":"economics"},{"sentence":"The contractionist argued that the government was spending too much money.","translation":"その緊縮財政主義者は、政府が多額の資金を費やしすぎていると主張した。","type":"noun","meaning_category":"economics"},{"sentence":"The editor, a known contractionist, marked down all instances of 'cannot' to 'can't'.","translation":"編集者は、知られている短縮形支持者であり、「cannot」のすべての例を「can't」に修正した。","type":"noun","meaning_category":"linguistics"}]}