{"word":"unstrip","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(はぎ取られたものを)元に戻す、取り去ったものを再び取り付ける","english_definition":"To restore something that has been stripped; to reattach something that has been removed.","examples":[{"sentence":"After the renovations, they had to unstrip the wallpaper in certain areas to correct mistakes.","translation":"改修後、彼らは間違いを修正するために、特定の場所の壁紙を元に戻さなければならなかった。"},{"sentence":"The mechanic had to unstrip the engine parts to reassemble them correctly.","translation":"整備士はエンジン部品を正しく再組み立てするために、取り外した部品を元に戻す必要があった。"}],"collocations":["unstrip wallpaper","unstrip engine parts"],"synonyms":["reattach","restore","reinstall"],"antonyms":["strip","remove","detach"]}],"etymology":{"value":"The word 'unstrip' is formed by adding the prefix 'un-' to the word 'strip'. The prefix 'un-' generally indicates the reversal of an action or state. Therefore, 'unstrip' means to reverse the action of stripping something.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈstrɪp/","syllables":"un-strip"},"inflection":{"verb_forms":{"present_simple":["unstrip","unstrips"],"past_simple":"unstripped","past_participle":"unstripped","present_participle":"unstripping"}},"usage_notes":{"explanation":"'Unstrip' is a relatively rare word, used to describe the action of restoring something that has been stripped or removed. It is the opposite of 'strip'. The use of this word is often found in technical or restoration contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unstript the paint from the wall.","correct":"✓ He unstripped the wallpaper from the wall.","note":"'Unstrip' is usually used when something has been intentionally stripped and then restored. Using it for paint removal is less common; 'remove' is more appropriate in that context."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'unstrip' is a less common word. It is generally used in technical or restoration contexts. It means to reverse the action of stripping something, or to restore something that has been stripped. Because of its limited use, it is considered a word for advanced learners."},"example_sentences":[{"sentence":"The restorer carefully unstripped the layers of varnish to reveal the original painting.","translation":"修復家はオリジナルの絵を明らかにするために、注意深くニスのはぎ取られた層を元に戻した。","type":"verb","meaning_category":"元に戻す"},{"sentence":"After realizing his mistake, he had to unstrip the wires to reconnect them properly.","translation":"彼は自分の間違いに気づいた後、ワイヤーを正しく再接続するために、はぎ取られたワイヤーを元に戻す必要があった。","type":"verb","meaning_category":"再び取り付ける"}]}