{"word":"Non-gothic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非ゴシック様式の、ゴシック様式でない","english_definition":"Not in the Gothic style; not relating to or characteristic of Gothic architecture, literature, or art.","examples":[{"sentence":"The building's design is decidedly Non-gothic, favoring clean lines and modern materials.","translation":"その建物のデザインは明らかに非ゴシック様式で、クリーンなラインと現代的な素材を好んでいます。"},{"sentence":"She preferred Non-gothic novels, finding them more relatable to contemporary life.","translation":"彼女は非ゴシック小説を好み、現代生活との関連性が高いと感じていました。"}],"collocations":["Non-gothic architecture","Non-gothic art","Non-gothic literature","Non-gothic design"],"synonyms":["anti-Gothic","un-Gothic","modern","contemporary"],"antonyms":["Gothic","Gothic-style"]},{"part_of_speech":"noun","definition":"非ゴシック様式の作品、ゴシック様式でないもの","english_definition":"Something that is not in the Gothic style.","examples":[{"sentence":"The museum featured both Gothic and Non-gothic pieces in its collection.","translation":"その美術館のコレクションには、ゴシック様式と非ゴシック様式の作品の両方が展示されていました。"},{"sentence":"He argued that the shift from Gothic to Non-gothic represented a move towards greater realism.","translation":"彼は、ゴシックから非ゴシックへの移行は、より大きなリアリズムへの移行を表していると主張しました。"}],"collocations":["collection of Non-gothic art","examples of Non-gothic architecture"],"synonyms":["modern piece","contemporary work"],"antonyms":["Gothic piece"]}],"etymology":{"value":"Formed by adding the prefix 'non-' to 'Gothic'. 'Gothic' refers to a style of architecture, art, and literature prevalent in Europe from the 12th to 16th centuries, characterized by pointed arches, ribbed vaults, and flying buttresses. The prefix 'non-' indicates negation or absence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈɡɒθɪk/","syllables":"Non-goth-ic"},"inflection":{"notes":"As an adjective, it can be used to modify nouns. As a noun, it can be pluralized (Non-gothics)."},"usage_notes":{"explanation":"'Non-gothic' is used to describe something that does not adhere to or resemble the characteristics of the Gothic style. It is often used in discussions of art, architecture, and literature to differentiate works that do not fit within the Gothic tradition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-gothic building was very gothic.","correct":"✓ The non-gothic building was very modern.","note":"'Non-gothic' and 'Gothic' are antonyms, so something cannot be both at the same time."},{"incorrect":"✗ He liked non-gothic music.","correct":"✓ He liked music that was not gothic.","note":"While 'Non-gothic' is primarily used for architecture, art, and literature, you can use 'music that was not gothic' to describe music that doesn't fit the Gothic style."}],"priority":"★★☆"},"related_words":{"derivatives":["Gothic","Neo-Gothic","Gothicism"],"related_terms":["Romanesque","Renaissance","Modernism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Non-gothic' is relatively specialized, primarily used in the context of art, architecture, and literature to describe styles that deviate from the Gothic tradition. Understanding this term requires familiarity with the characteristics of Gothic style and its historical context. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The cathedral's Non-gothic facade was a stark contrast to the traditional Gothic architecture of the surrounding buildings.","translation":"その大聖堂の非ゴシック様式のファサードは、周囲の建物の伝統的なゴシック建築とは対照的でした。","type":"adjective","meaning_category":"Architecture"},{"sentence":"The exhibition showcased a range of Non-gothic sculptures from the early 20th century.","translation":"その展覧会では、20世紀初頭のさまざまな非ゴシック様式の彫刻が展示されていました。","type":"adjective","meaning_category":"Art"},{"sentence":"She found Non-gothic literature to be more aligned with her contemporary sensibilities.","translation":"彼女は、非ゴシック文学の方が現代的な感性に合っていると感じました。","type":"adjective","meaning_category":"Literature"}]}