{"word":"Extensionist","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A person who promotes or advocates for extension, expansion, or outreach, especially in agricultural or educational contexts.","english_definition":"A person involved in extension work, typically in agriculture or education, who provides information and assistance to people in rural communities.","examples":[{"sentence":"The extensionist visited the farm to advise on new irrigation techniques.","translation":"普及員は新しい灌漑技術について助言するために農場を訪れた。"},{"sentence":"She worked as an extensionist, helping farmers improve their crop yields.","translation":"彼女は普及員として働き、農家が収穫量を改善するのを支援した。"},{"sentence":"Extensionists play a crucial role in disseminating research findings to the public.","translation":"普及員は研究結果を一般に広める上で重要な役割を果たしている。"}],"collocations":["agricultural extensionist","community extensionist","rural extensionist","extensionist program","extensionist services"],"synonyms":["outreach worker","community educator","field agent","advisor","consultant"],"antonyms":["N/A"]}],"etymology":{"value":"Derived from 'extension' (the act of extending or expanding) and the suffix '-ist' (denoting a person who practices or is concerned with something).","priority":"N/A"},"pronunciation":{"ipa":"/ɪkˈstɛnʃənɪst/","syllables":"ex-ten-sion-ist"},"inflection":{"noun_plural":"Extensionists"},"usage_notes":{"explanation":"The term 'extensionist' is primarily used in agricultural and educational contexts to describe professionals who bridge the gap between research and practical application. They often work for universities, government agencies, or non-profit organizations.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The extensionist extended the deadline.","correct":"✓ The extensionist advised on the deadline.","note":"'Extensionist' refers to a person, not the act of extending something."}],"priority":"N/A"},"related_words":{"derivatives":["extension (noun)","extend (verb)","extensionism (noun)"],"phrasal_verbs":["N/A"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'extensionist' is a specialized term primarily used in the fields of agriculture and education. It refers to a professional who works to extend knowledge and practices from research institutions to the wider community, often in rural areas. Understanding this term requires familiarity with the concept of 'extension services' and the role of outreach in these fields."},"example_sentences":[{"sentence":"The agricultural extensionist demonstrated new farming methods to the villagers.","translation":"農業普及員は村人に新しい農法を実演した。","type":"noun","meaning_category":"Person promoting extension"},{"sentence":"Extensionists often provide training and resources to help communities thrive.","translation":"普及員は地域社会が発展するための研修や資源を提供することが多い。","type":"noun","meaning_category":"Person involved in outreach"}]}