{"word":"Ecclesiastes","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"伝道の書 (旧約聖書の一書)","english_definition":"A book of the Old Testament, also known as Qoheleth, which contains reflections on the meaning of life.","examples":[{"sentence":"Ecclesiastes explores themes of wisdom, mortality, and the search for meaning.","translation":"伝道の書は、知恵、死すべき運命、そして意味の探求というテーマを探求している。"},{"sentence":"Many find the pessimistic tone of Ecclesiastes challenging but ultimately insightful.","translation":"多くの人が伝道の書の悲観的なトーンを難しく感じながらも、最終的には洞察に満ちていると感じている。"}],"collocations":["Book of Ecclesiastes","Read Ecclesiastes","Study Ecclesiastes","The wisdom of Ecclesiastes","Themes in Ecclesiastes"],"synonyms":["Qoheleth"],"antonyms":[]},{"part_of_speech":"noun","definition":"伝道の書を書いたとされる人物、コヘレト","english_definition":"The purported author of the Book of Ecclesiastes, also known as Qoheleth.","examples":[{"sentence":"Ecclesiastes, traditionally attributed to King Solomon, reflects on the vanity of earthly pursuits.","translation":"伝統的にソロモン王に帰せられる伝道の書（コヘレト）は、地上の追求の虚しさについて考察している。"}],"collocations":["The author of Ecclesiastes","Qoheleth in Ecclesiastes"],"synonyms":["Qoheleth"],"antonyms":[]}],"etymology":{"value":"From Late Latin *Ecclesiastes*, from Ancient Greek *Ἐκκλησιαστής* (Ekklēsiastḗs), from Hebrew *קֹהֶלֶת*‎ (qōheleṯ, “one who convenes or addresses an assembly”).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌkliːziˈæstiːz/","syllables":"Ec-cle-si-as-tes"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"*Ecclesiastes* is a book in the Old Testament known for its philosophical and often pessimistic reflections on the meaning of life. It emphasizes the futility of earthly pursuits and the inevitability of death, often using the phrase \"vanity of vanities, all is vanity.\" The book is traditionally attributed to King Solomon, although this is debated by scholars. The author refers to himself as \"Qoheleth,\" which means \"teacher\" or \"preacher.\"","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I read Ecclesiastes yesterday, it was very depressing.","correct":"✓ I read Ecclesiastes yesterday; it was very depressing.","note":"When combining two independent clauses, use either a semicolon or separate sentences."},{"incorrect":"✗ Ecclesiastes are a book in the Bible.","correct":"✓ Ecclesiastes is a book in the Bible.","note":"Ecclesiastes is singular, referring to a single book."}],"priority":"★★☆"},"related_words":{"derivatives":["Ecclesiastical (adjective: relating to the Christian Church or its clergy)"],"phrases":["Vanity of vanities, all is vanity."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"*Ecclesiastes* is a book from the Old Testament. It's known for being philosophical and a bit pessimistic about life. The book talks about how things like wealth and pleasure don't really make you happy in the long run. It's often studied in religion and philosophy classes. The author is sometimes called *Qoheleth*."},"example_sentences":[{"sentence":"The preacher quoted from **Ecclesiastes** during his sermon.","translation":"牧師は説教中に伝道の書から引用した。","type":"noun","meaning_category":"Book of the Bible"},{"sentence":"**Ecclesiastes** challenges the reader to consider what truly matters in life.","translation":"伝道の書は、読者に人生で本当に重要なことは何かを考えるように促す。","type":"noun","meaning_category":"Book of the Bible"},{"sentence":"The phrase 'vanity of vanities' is a famous quote from **Ecclesiastes**.","translation":"「空の空、すべては空」という言葉は、伝道の書からの有名な引用である。","type":"noun","meaning_category":"Book of the Bible"}]}