{"word":"ancientism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"古代趣味、古代主義","english_definition":"An affection for or adherence to ancient things or customs.","examples":[{"sentence":"His writings reflect a strong ancientism, drawing heavily on classical literature.","translation":"彼の著作は強い古代趣味を反映しており、古典文学に大きく依拠している。"},{"sentence":"The museum's collection showcases the ancientism prevalent during the Renaissance.","translation":"博物館のコレクションは、ルネサンス期に流行した古代趣味を紹介している。"}],"collocations":["literary ancientism","historical ancientism","cultural ancientism"],"synonyms":["classicism","archaism","antiquarianism"],"antonyms":["modernism","futurism"]}],"etymology":{"value":"'Ancient' + '-ism'. From the tendency or preference for ancient things or ideas.","priority":"★★★"},"pronunciation":{"ipa":"/ˈeɪnʃəntɪzəm/","syllables":"an-cient-ism"},"inflection":{"noun_plural":"ancientisms"},"usage_notes":{"explanation":"'Ancientism' refers to a fondness for or imitation of ancient styles, customs, or beliefs. It's often used in the context of art, literature, and philosophy. It can also describe a general interest in history and archaeology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ancientism of the building was very modern.","correct":"✓ The building's design reflected ancientism, but with modern materials.","note":"Ancientism refers to the *preference* for ancient styles, not the ancient thing itself. Describe the design or influence, not the object."}],"priority":"★★☆"},"related_words":{"derivatives":["ancientist (noun: a person who studies or is fond of ancient things)","ancient (adjective: belonging to the distant past)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ancientism' is a relatively uncommon term referring to a preference for ancient things or customs. It is often used in academic or specialized contexts when discussing historical or artistic movements that draw inspiration from the past. Understanding its meaning requires a good vocabulary and familiarity with historical and cultural concepts."},"example_sentences":[{"sentence":"The architectural style of the building shows a strong influence of ancientism.","translation":"その建物の建築様式は、古代趣味の強い影響を示している。","type":"general","meaning_category":"general"},{"sentence":"The author's ancientism is evident in his constant references to Greek mythology.","translation":"著者の古代趣味は、彼のギリシャ神話への絶え間ない言及に明らかである。","type":"literary","meaning_category":"literary"},{"sentence":"The revival of classical art during the Renaissance was a form of ancientism.","translation":"ルネサンス期の古典芸術の復興は、古代趣味の一形態であった。","type":"historical","meaning_category":"historical"}]}