{"word":"vernacularly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"地方語で、方言で、日常会話で、共通語でなく","english_definition":"in the vernacular; using the language or dialect native to a region or group, especially as distinct from a literary, cultured, or foreign language.","examples":[{"sentence":"The story was told vernacularly, using the local dialect.","translation":"その物語は地方語で、地元の方言を使って語られた。"},{"sentence":"He translated the poem vernacularly to make it accessible to a wider audience.","translation":"彼はより多くの読者が読めるように、その詩を共通語に翻訳した。"},{"sentence":"The guide explained the historical events vernacularly, avoiding technical jargon.","translation":"ガイドは専門用語を避け、平易な言葉で歴史的出来事を説明した。"}],"collocations":["speak vernacularly","write vernacularly","translate vernacularly","explain vernacularly"],"synonyms":["colloquially","dialectally","idiomatically","natively","popularly"],"antonyms":["formally","literarily","scholarly","technically"]}],"etymology":{"value":"From 'vernacular' + '-ly'. 'Vernacular' comes from the Latin 'vernaculus', meaning 'domestic, native', derived from 'verna' meaning 'native slave' or 'home-born slave'. The adverbial suffix '-ly' indicates manner.","priority":"★★☆"},"pronunciation":{"ipa":"/vərˈnækjʊlərli/","syllables":"ver-nac-u-lar-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Vernacularly' describes something done using the everyday language of a particular region or group. It emphasizes the use of common, informal language rather than formal or literary language. It is often used to describe translations, explanations, or storytelling that aims to be accessible to a broad audience. The word highlights the contrast between specialized or formal language and the language used in daily life.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke very vernacularly, so I didn't understand him.","correct":"✓ He spoke in a very strong dialect, so I didn't understand him. / ✓ He used a lot of slang, so I didn't understand him.","note":"While 'vernacularly' means 'in the vernacular', saying someone 'spoke vernacularly' can be awkward. It's better to specify that they spoke in a dialect or used slang. The focus is on the language itself, not the act of speaking. "},{"incorrect":"✗ The instructions were written vernacularly, making them difficult to follow.","correct":"✓ The instructions were written in simple language, making them easy to follow.","note":"'Vernacularly' implies the use of a local or regional language, which might not be universally understood. If the intention is to convey simplicity and clarity, using phrases like 'in simple language' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["vernacular (noun, adjective)","vernacularism (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vernacularly' means using the common, everyday language of a particular group or region, as opposed to formal or technical language. It's often used when something is translated or explained in a way that's easy for ordinary people to understand. For example, a complex legal document might be explained vernacularly to someone who isn't a lawyer. It's a somewhat uncommon word, so you'll mostly encounter it in more academic or specialized contexts. The key is to remember it emphasizes the use of informal, accessible language specific to a certain group or area."},"example_sentences":[{"sentence":"The professor explained the complex scientific theory vernacularly, using everyday examples.","translation":"教授は複雑な科学理論を、日常的な例を使ってわかりやすく説明した。","type":"adverb","meaning_category":"in everyday language"},{"sentence":"The play was performed vernacularly, incorporating local customs and dialects.","translation":"その劇は、地元の習慣や方言を取り入れ、地方色豊かに上演された。","type":"adverb","meaning_category":"using local dialect"},{"sentence":"The story of the historical event was passed down vernacularly through generations.","translation":"その歴史的出来事の物語は、世代を超えて口頭で伝えられてきた。","type":"adverb","meaning_category":"orally, in common language"}]}