{"word":"shillelagh","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"シレイリー、シャララ: アイルランドの伝統的なこん棒。樫またはニレの木の根または太い枝から作られ、頭部が大きく、握りの部分が細くなっている。武器または杖として使用される。","english_definition":"An Irish walking stick or club, typically made of blackthorn or oak, with a large knob at the head and a tapering handle; used as a weapon or walking aid.","examples":[{"sentence":"He carried a shillelagh on his hikes through the Irish countryside.","translation":"彼はアイルランドの田園地帯をハイキングする際にシレイリーを携行していた。"},{"sentence":"The stage Irishman was often depicted carrying a shillelagh.","translation":"舞台に登場するアイルランド人は、しばしばシレイリーを携えている姿で描かれた。"}],"collocations":["carry a shillelagh","swing a shillelagh","blackthorn shillelagh","oak shillelagh"],"synonyms":["club","cudgel","walking stick","staff","baton"],"antonyms":[]}],"etymology":{"value":"アイルランドのキルデア州にある Shillelagh という村の名前に由来する。この地域はかつて樫の木で有名であり、シレイリーの材料となる木材の産地であった。","priority":"★★☆"},"pronunciation":{"ipa":"/ʃɪˈleɪlə/","syllables":"shi-lle-lagh (three syllables)"},"inflection":{"noun_plural":"shillelaghs"},"usage_notes":{"explanation":"「**shillelagh**」は、アイルランド文化に深く根ざした伝統的な武器であり、同時に杖としても使用される道具です。アイルランドの象徴として、文学や映画などにも登場します。現代では、実用的な道具としてよりも、お土産品や装飾品として見かけることが多いです。アイルランドの歴史や文化に触れる際に知っておくと良い単語です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a shillelagh to chop wood.","correct":"✓ He used an axe to chop wood.","note":"シレイリーは木を切る道具ではなく、武器または杖として使われます。木を切るには斧（axe）が適切です。"},{"incorrect":"✗ She bought a shillelagh made of plastic.","correct":"✓ She bought a shillelagh made of wood.","note":"伝統的なシレイリーは、樫またはニレの木で作られます。プラスチック製のものは、伝統的なシレイリーとは言えません。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Not typically included in CEFR vocabulary lists.","frequency_google_ngram":"低頻度 (Low frequency) - 特定の文脈（アイルランド文化、歴史）でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**shillelagh**」は、アイルランドの伝統的な杖または棍棒を指す専門的な単語です。アイルランドの歴史や文化、特に武器や民俗学に関連する文脈で現れることがあります。この単語は、アイルランド文化に特有であり、一般的な英語の語彙には含まれていません。したがって、この単語を理解するには、アイルランドの文化や歴史に関するある程度の知識が必要です。"},"example_sentences":[{"sentence":"The old man leaned heavily on his shillelagh as he walked.","translation":"老人は歩きながらシレイリーに大きく寄りかかった。","type":"noun","meaning_category":"杖として"},{"sentence":"He defended himself with his shillelagh when attacked.","translation":"彼は攻撃されたとき、シレイリーで身を守った。","type":"noun","meaning_category":"武器として"},{"sentence":"Shillelaghs are often made from blackthorn wood.","translation":"シレイリーはしばしばブラックソーンの木で作られる。","type":"noun","meaning_category":"材料"}]}