{"word":"terundur","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(インドネシア語) 地質学において、ある地域の地形、地質構造、水文、植生、土壌、気候、および人間の活動を含む、物理的、化学的、生物学的、社会経済的要因の相互作用によって形成される複合的な環境単位。","english_definition":"(Indonesian) In geology, a complex environmental unit formed by the interaction of physical, chemical, biological, socio-economic factors, including the topography, geological structure, hydrology, vegetation, soil, climate, and human activities of a region.","examples":[{"sentence":"Terundur suatu wilayah memengaruhi potensi sumber daya alamnya.","translation":"The terundur of a region influences its natural resource potential."},{"sentence":"Perubahan iklim dapat mengubah terundur suatu ekosistem.","translation":"Climate change can alter the terundur of an ecosystem."}],"collocations":["analisis terundur (terundur analysis)","pemetaan terundur (terundur mapping)","konservasi terundur (terundur conservation)"],"synonyms":["lingkungan","bentang alam","ekosistem"],"antonyms":[]}],"etymology":{"value":"インドネシア語の専門用語で、特定の語源は不明だが、'terrain'（地形）や 'environment'（環境）といった概念に関連する要素を組み合わせた造語である可能性がある。","priority":"★☆☆"},"pronunciation":{"ipa":"te.run.dur","syllables":"te-run-dur"},"inflection":{"notes":"名詞なので、複数形は通常ありません。"},"usage_notes":{"explanation":"「Terundur」は、インドネシア語で、ある地域の地理的、地質学的、生物学的、社会経済的特性が相互作用して形成される複合的な環境単位を指す専門用語です。地形、地質構造、水文、植生、土壌、気候、および人間の活動を含む、さまざまな要因の相互作用を考慮に入れます。この用語は、環境科学、地理学、地質学、および関連分野で使用されます。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Terundur itu indah.","correct":"✓ Pemandangan itu indah.","note":"「Terundur」は専門用語であり、日常会話で「美しい」という意味では使用されません。代わりに、「pemandangan」（景色）のような単語を使用します。"},{"incorrect":"✗ Terundur adalah cuaca.","correct":"✓ Cuaca adalah bagian dari terundur.","note":"「Terundur」は気候そのものではなく、気候を含むより広範な環境単位を指します。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Terundur」は、インドネシア語の専門用語であり、自然科学、特に地理学、地質学、環境科学の分野で使用されます。この単語は、ある地域の地形、地質構造、水文、植生、土壌、気候、および人間の活動を含む、物理的、化学的、生物学的、社会経済的要因の相互作用によって形成される複合的な環境単位を指します。この用語は、特定の地域の環境特性を包括的に理解するために使用されます。日常会話では一般的に使用されません。"},"example_sentences":[{"sentence":"Penelitian ini bertujuan untuk menganalisis terundur di kawasan hutan tersebut.","translation":"This research aims to analyze the terundur in the forest area.","type":"noun","meaning_category":"複合的な環境単位"},{"sentence":"Terundur yang unik di pulau ini mendukung keanekaragaman hayati yang tinggi.","translation":"The unique terundur on this island supports high biodiversity.","type":"noun","meaning_category":"複合的な環境単位"}]}