{"word":"Triplopia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"複像視、三重視：一つの物体が三つに見える視覚障害","english_definition":"A visual defect in which a single object is seen as three.","examples":[{"sentence":"Triplopia is a rare condition that can be caused by various neurological issues.","translation":"三重視は、さまざまな神経学的問題によって引き起こされる可能性があるまれな状態です。"},{"sentence":"The patient reported experiencing triplopia after a head injury.","translation":"患者は頭部外傷後、三重視を経験したと報告しました。"}],"collocations":["experience triplopia","cause triplopia","report triplopia"],"synonyms":["multiple vision","polyopia"],"antonyms":["diplopia (double vision)","monopia (single vision)"]},{"part_of_speech":"noun","definition":"(より一般的に) 多像視、複数の像が見える状態を指すことがある","english_definition":"More generally, the condition of seeing multiple images of a single object.","examples":[{"sentence":"While triplopia specifically refers to seeing three images, the term polyopia can encompass seeing any number of multiple images.","translation":"三重視は特に3つの像が見えることを指しますが、多像視という用語は、任意の数の複数の像が見えることを包含できます。"}],"collocations":["diagnose polyopia","treat polyopia"],"synonyms":["polyopia","multiple vision"],"antonyms":["single vision"]}],"etymology":{"value":"From 'triplo-' (threefold) + '-opia' (condition of vision). Derived from Greek 'triplous' (threefold) and 'ops' (eye, vision).","priority":"★★☆"},"pronunciation":{"ipa":"/trɪˈploʊpiə/","syllables":"trip-lo-pi-a"},"inflection":{"noun_plural":"triplopias"},"usage_notes":{"explanation":"'Triplopia' is a relatively rare and specific term in ophthalmology. It is important to differentiate it from diplopia (double vision) and polyopia (general multiple vision). Diagnosis requires careful examination by an eye specialist or neurologist.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has triplopia, so they see double.","correct":"✓ The patient has triplopia, so they see triple.","note":"Triplopia means seeing three images, not two (which is diplopia)."},{"incorrect":"✗ Triplopia is treated with simple glasses.","correct":"✓ Triplopia treatment varies depending on the cause and may include eye patching, prisms, or surgery.","note":"Treatment for triplopia is not always simple and depends on the underlying cause."}],"priority":"★★☆"},"related_words":{"derivatives":["polyopia","diplopia","opia"],"medical_terms":["ophthalmology","neurology","visual field","eye examination"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Triplopia' is a specialized medical term referring to the condition of seeing three images of a single object. Understanding this term requires a background in medical terminology, specifically ophthalmology or neurology. It's crucial to distinguish it from similar terms like 'diplopia' (double vision) and 'polyopia' (multiple vision). The causes and treatments for triplopia are complex and require professional medical evaluation."},"example_sentences":[{"sentence":"The neurologist suspected triplopia after the patient described seeing three distinct images of the same object.","translation":"神経科医は、患者が同じ物体を3つの異なる像で見ていると説明した後、三重視を疑った。","type":"medical","meaning_category":"visual impairment"},{"sentence":"Persistent triplopia can significantly impact a person's ability to perform daily tasks such as reading and driving.","translation":"持続的な三重視は、人の読書や運転などの日常的なタスクを実行する能力に大きな影響を与える可能性がある。","type":"medical","meaning_category":"visual impairment"}]}