{"word":"impregnatory","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"受胎させる、妊娠させる、含浸させる、浸透させる","english_definition":"Serving to impregnate; having the quality of impregnating; adapted for impregnating; tending to saturate or permeate.","examples":[{"sentence":"The impregnatory power of the male seed is essential for procreation.","translation":"男性の種の受胎能力は、生殖に不可欠である。"},{"sentence":"The impregnatory fluids are used to preserve the wood.","translation":"含浸液は木材を保存するために使用される。"}],"collocations":["impregnatory power","impregnatory fluids","impregnatory substance"],"synonyms":["fertilizing","saturating","permeating","inseminating","infusing"],"antonyms":["sterile","barren","dry","unproductive"]}],"etymology":{"value":"From the word 'impregnate' + '-ory'. 'Impregnate' comes from Latin 'impraegnare', meaning 'to make pregnant'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˈprɛɡnəˌtɔːri/","syllables":"im-preg-na-to-ry"},"inflection":{"notes":"Comparative and superlative forms are possible, but rare: more impregnatory, most impregnatory."},"usage_notes":{"explanation":"'Impregnatory' is a relatively rare adjective, primarily used in technical or scientific contexts. It describes something that has the ability or function of impregnating, whether in the biological sense of causing pregnancy or in the material science sense of saturating or permeating a substance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The impregnatory design of the building allowed for natural light.","correct":"✓ The design of the building allowed for ample natural light.","note":"'Impregnatory' is not typically used to describe general design features. Use a more appropriate adjective like 'permeable' or 'light-filled' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["impregnate (verb)","impregnation (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Impregnatory' is a highly specialized term. It is primarily encountered in scientific or technical contexts related to biology (reproduction) or material science (saturation). Due to its limited use, it is not part of common vocabulary. Understanding the root word 'impregnate' is essential for deciphering its meaning. It is rarely used in everyday conversation or writing."},"example_sentences":[{"sentence":"The study examined the impregnatory effects of certain chemicals on plant growth.","translation":"その研究では、特定の化学物質が植物の成長に与える受精効果を調べた。","type":"adjective","meaning_category":"fertilizing"},{"sentence":"The impregnatory treatment of the fabric made it waterproof.","translation":"生地への含浸処理により、防水性を持たせた。","type":"adjective","meaning_category":"saturating"}]}