{"word":"Thermidor","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"テルミドール (フランス革命暦の11番目の月。グレゴリオ暦の7月19日/20日～8月17日/18日に相当)","english_definition":"Thermidor (the eleventh month of the French Republican Calendar, corresponding to the period from July 19/20 to August 17/18 in the Gregorian Calendar).","examples":[{"sentence":"The Thermidorian Reaction marked a turning point in the French Revolution.","translation":"テルミドール反動はフランス革命における転換点となった。"}],"collocations":["Thermidorian Reaction (テルミドール反動)"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"テルミドール (ロブスターなどの甲殻類をクリームソースとチーズでオーブン焼きにした料理)","english_definition":"Thermidor (a dish consisting of lobster or other shellfish cooked in a creamy sauce, stuffed back into the shell, and browned).","examples":[{"sentence":"She ordered lobster Thermidor at the fancy restaurant.","translation":"彼女は高級レストランでロブスターテルミドールを注文した。"}],"collocations":["lobster Thermidor (ロブスターテルミドール)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"フランス革命暦の月名「Thermidor」は、フランス語の「therme」（熱）に由来し、夏の暑い時期を意味する。料理の「Thermidor」は、1894年にパリのレストランでこの料理が初めて提供された際に、テルミドール月（7月）にちなんで名付けられた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈθɜːrmɪdɔːr/","syllables":"Ther-mi-dor"},"inflection":{"notes":"名詞なので、複数形は Thermidors"},"usage_notes":{"explanation":"「**Thermidor**」は、文脈によって意味が異なります。フランス革命史においては、革命暦の月名として使われ、特に「テルミドール反動」という歴史的事件を指すことが多いです。料理名としては、「ロブスターテルミドール」のように、特定の調理法で作られた甲殻類料理を指します。どちらの意味で使われているか、文脈から判断する必要があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was born in Thermidor 1794 during the French Revolution.","correct":"✓ He was born in July 1794 during the French Revolution.","note":"フランス革命暦は現代では一般的ではないため、日付をグレゴリオ暦で示す方が分かりやすい場合があります。ただし、歴史的な文脈でフランス革命暦を使用する場合は問題ありません。"},{"incorrect":"✗ I had a delicious Thermidor for dessert.","correct":"✓ I had a delicious lobster Thermidor for dinner.","note":"「Thermidor」は通常、メインディッシュとして提供される料理であり、デザートではありません。料理の種類を明示するとより正確です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Thermidorian (テルミドールの、テルミドール反動の)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (歴史的文脈)、B2 (料理名)","frequency_google_ngram":"低頻度 (Low frequency) - 特定の分野でのみ使用される語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Thermidor**」は、フランス革命の歴史と高級料理に関連する専門的な単語です。歴史的な文脈では、フランス革命暦の11番目の月を指し、特に「テルミドール反動」という歴史的事件を指すことがあります。料理としては、ロブスターなどの甲殻類をクリームソースとチーズでオーブン焼きにした料理を指します。どちらの意味で使われているかは、文脈から判断する必要があります。日常会話ではあまり使われません。"},"example_sentences":[{"sentence":"The execution of Robespierre marked the end of the Reign of Terror and the beginning of the **Thermidor**ian Reaction.","translation":"ロベスピエールの処刑は恐怖政治の終焉とテルミドール反動の始まりを告げた。","type":"noun","meaning_category":"フランス革命暦の月名、歴史的事件"},{"sentence":"For a special occasion, we decided to splurge on lobster **Thermidor**.","translation":"特別な機会なので、奮発してロブスターテルミドールを食べることにした。","type":"noun","meaning_category":"料理名"}]}