{"word":"Transbaikalian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"トランスバイカル地方の、バイカル湖以東の","english_definition":"Of or relating to Transbaikalia, the region east of Lake Baikal.","examples":[{"sentence":"The Transbaikalian climate is characterized by cold winters and short, warm summers.","translation":"トランスバイカル地方の気候は、寒冷な冬と短く温暖な夏が特徴です。"},{"sentence":"Transbaikalian flora and fauna are diverse due to the region's unique geographical location.","translation":"トランスバイカル地方の動植物相は、その地域の独特な地理的位置のために多様です。"}],"collocations":["Transbaikalian Railway","Transbaikalian Oblast","Transbaikalian landscape"],"synonyms":["Baikal-Transbaikal","East Baikal","Eastern Transbaikalia"],"antonyms":[]},{"part_of_speech":"noun","definition":"トランスバイカル地方の住民","english_definition":"A native or inhabitant of Transbaikalia.","examples":[{"sentence":"The Transbaikalians have a rich cultural heritage influenced by both Russian and Mongolian traditions.","translation":"トランスバイカル地方の住民は、ロシアとモンゴルの両方の伝統の影響を受けた豊かな文化遺産を持っています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From \"Transbaikalia\" (the region east of Lake Baikal in Russia) + \"-an\" (suffix indicating origin or relation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtrænzbaɪˈkeɪliən/","syllables":"trans-bai-ka-li-an"},"inflection":{"noun_plural":"Transbaikalians"},"usage_notes":{"explanation":"\"Transbaikalian\" is primarily used in geographical and historical contexts to describe things related to the Transbaikalia region. It's not a commonly used word outside of specialized discussions about this area of Russia.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is from Transbaikalia, so he is Transbaikalianian.","correct":"✓ He is from Transbaikalia, so he is Transbaikalian.","note":"Avoid adding an extra \"-ian\" suffix. The correct form is simply \"Transbaikalian.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["Transbaikalia (noun: the region east of Lake Baikal)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Transbaikalian\" is a relatively rare and specialized term used to describe something originating from or related to the Transbaikalia region of Russia, which is located east of Lake Baikal. It is most likely to be encountered in geographical, historical, or scientific contexts when discussing this specific area. Due to its limited use, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The Transbaikalian region is known for its mineral resources.","translation":"トランスバイカル地方は鉱物資源で知られています。","type":"adjective","meaning_category":"geographical"},{"sentence":"The Transbaikalian Cossacks played a significant role in the Russian expansion eastward.","translation":"トランスバイカル・コサックは、ロシアの東方拡大において重要な役割を果たしました。","type":"adjective","meaning_category":"historical"},{"sentence":"Studies are being conducted on the unique Transbaikalian ecosystem.","translation":"トランスバイカル地方のユニークな生態系に関する研究が行われています。","type":"adjective","meaning_category":"scientific"},{"sentence":"Many Transbaikalians are involved in agriculture and mining.","translation":"多くのトランスバイカル地方の住民は、農業と鉱業に従事しています。","type":"noun","meaning_category":"people"}]}