{"word":"unetymologic","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not etymologic; not following the principles or rules of etymology.","english_definition":"Not relating to or following the principles of etymology.","examples":[{"sentence":"The proposed derivation of the word is unetymologic and unlikely.","translation":"その単語の提案された語源は語源学的に正しくなく、ありそうもない。"}],"collocations":["unetymologic derivation","unetymologic explanation"],"synonyms":["nonetymological","false etymology"],"antonyms":["etymologic","etymological"]}],"etymology":{"value":"Formed from the prefix \"un-\" (not) + \"etymologic\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnˌɛtɪməˈlɒdʒɪk/","syllables":"un-et-y-mo-lo-gic"},"inflection":{"notes":"As an adjective, it does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Unetymologic\" is used to describe something that does not adhere to the principles of etymology, the study of the origin and historical development of words. It often implies that a proposed explanation or derivation of a word is incorrect or unsupported by linguistic evidence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The etymology was unetymologic.","correct":"The derivation was unetymologic."}],"priority":"★★☆"},"related_words":{"derivatives":["etymology","etymological","etymologist"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unetymologic\" is a technical term used in linguistics, specifically in the field of etymology. It describes something that is not in accordance with the principles of etymology, meaning it does not follow the correct historical development of a word. This term is not commonly used in everyday language and is more likely to be encountered in academic or specialized contexts."},"example_sentences":[{"sentence":"The amateur linguist's explanation for the word's origin was completely unetymologic.","translation":"そのアマチュア言語学者の単語の起源に関する説明は、完全に語源学的に誤っていた。","type":"adjective","meaning_category":"Not etymologic"}]}