{"word":"Calathea","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"カラテア (クズウコン科の植物の属名)","english_definition":"A genus of flowering plants belonging to the family Marantaceae, native to tropical America. They are popular as houseplants due to their decorative leaves.","examples":[{"sentence":"The Calathea ornata is known for its pink-striped leaves.","translation":"カラテア・オルナタはピンクの縞模様の葉で知られています。"},{"sentence":"I have a Calathea in my living room.","translation":"私のリビングにはカラテアがあります。"}],"collocations":["Calathea plant (カラテアの植物)","Calathea care (カラテアの世話)","Calathea varieties (カラテアの種類)","Calathea leaves (カラテアの葉)"],"synonyms":["prayer plant (一般的にクテナンテ属やマランタ属も含む)"],"antonyms":[]}],"etymology":{"value":"The name 'Calathea' comes from the Greek word 'kalathos', meaning 'basket', referring to the use of their leaves for basket-making.","priority":"★★★"},"pronunciation":{"ipa":"/kəˈlæθiə/","syllables":"Ca-la-the-a"},"inflection":{"noun_plural":"Calatheas"},"usage_notes":{"explanation":"'Calathea' refers to a specific genus of plants, so it is always capitalized. They are known for their vibrant and patterned leaves, and many species fold their leaves up at night, resembling praying hands, hence the common name 'prayer plant' (though this term can also refer to other genera in the Marantaceae family).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ calathea is easy to grow.","correct":"✓ Calathea is easy to grow.","note":"The genus name should always be capitalized."},{"incorrect":"✗ I have many calathea in my house.","correct":"✓ I have many Calatheas in my house.","note":"To refer to multiple plants, use the plural form 'Calatheas'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_genera":["Maranta (マランタ属)","Ctenanthe (クテナンテ属)","Stromanthe (ストロマンテ属)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in gardening and botany contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'Calathea' is a botanical term referring to a specific genus of plants known for their decorative leaves. It is most commonly encountered in gardening contexts, plant care guides, or botanical discussions. Understanding this term is helpful for those interested in houseplants or botany.","priority":"★★★"},"example_sentences":[{"sentence":"The Calathea 'Medallion' has stunning circular patterns on its leaves.","translation":"カラテア・メダリオンは、葉に素晴らしい円形の模様があります。","type":"example","meaning_category":"Plant Variety"},{"sentence":"Proper Calathea care involves maintaining high humidity.","translation":"適切なカラテアの世話には、高い湿度を維持することが含まれます。","type":"example","meaning_category":"Plant Care"},{"sentence":"Many people admire Calatheas for their unique foliage.","translation":"多くの人々が、カラテアのユニークな葉を称賛しています。","type":"example","meaning_category":"General Description"}]}