{"word":"cineangiography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"シネアンギオグラフィー、血管造影映画撮影法","english_definition":"Radiological visualization of blood vessels by means of injecting a contrast medium and making a series of X-ray films.","examples":[{"sentence":"Cineangiography is used to diagnose heart conditions.","translation":"シネアンギオグラフィーは心臓の状態を診断するために用いられる。"},{"sentence":"The doctor recommended a cineangiography to check for blockages.","translation":"医師は閉塞がないか確認するためにシネアンギオグラフィーを勧めた。"}],"collocations":["coronary cineangiography (冠動脈シネアンギオグラフィー)","digital subtraction cineangiography (デジタルサブトラクションシネアンギオグラフィー)"],"synonyms":["angiography","angiocardiography","arteriography","venography"],"antonyms":[]}],"etymology":{"value":"The word 'cineangiography' is derived from 'cine-' (related to cinema or motion pictures), 'angio-' (related to blood vessels), and '-graphy' (the process of recording or imaging).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪniˌændʒiˈɒɡrəfi/","syllables":"ci-ne-an-gi-o-gra-phy"},"inflection":{"noun_plural":"cineangiographies"},"usage_notes":{"explanation":"Cineangiography is a medical imaging technique used to visualize blood vessels and heart chambers. It involves injecting a contrast dye into the bloodstream and then taking a rapid sequence of X-ray images, creating a moving picture of the blood flow. This allows doctors to identify blockages, narrowing, or other abnormalities in the blood vessels. It is commonly used in cardiology to diagnose and assess coronary artery disease.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ cineangiography is a treatment.","correct":"✓ cineangiography is a diagnostic procedure.","note":"Cineangiography is a diagnostic tool, not a treatment. It helps doctors identify problems, but it doesn't directly treat them."}],"priority":"★★☆"},"related_words":{"derivatives":["angiogram (血管造影写真)","angiology (血管学)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Cineangiography is a specialized medical term referring to a diagnostic imaging procedure. It involves using X-rays to visualize blood vessels after injecting a contrast dye. The procedure is primarily used to detect blockages or abnormalities in blood vessels, especially in the heart. Due to its technical nature, the term is primarily encountered in medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The **cineangiography** revealed a significant blockage in the left anterior descending artery.","translation":"シネアンギオグラフィーで、左前下行枝の重大な閉塞が明らかになった。","type":"noun","meaning_category":"診断"},{"sentence":"The cardiologist reviewed the **cineangiography** results with the patient.","translation":"循環器専門医は患者とシネアンギオグラフィーの結果を検討した。","type":"noun","meaning_category":"診断"}]}