{"word":"Bossisms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ボスがよく使う、またはボス特有の言い回しや行動。権威主義的な態度や、部下を軽視するような言動を指すことが多い。","english_definition":"Characteristic expressions, behaviors, or attitudes of a boss, often implying an authoritarian or condescending demeanor.","examples":[{"sentence":"The manager's constant use of jargon was seen as a form of bossisms, alienating the team.","translation":"そのマネージャーが頻繁に専門用語を使うことは、チームを疎外するボス特有の言動と見なされた。"},{"sentence":"The CEO's insistence on being addressed by his full title was just one example of his many bossisms.","translation":"CEOがフルタイトルで呼ばれることを主張するのは、彼の多くのボス特有の言動の一例に過ぎなかった。"},{"sentence":"The employees rolled their eyes at the boss's predictable bossisms during the meeting.","translation":"従業員たちは会議中、ボスが予想通りのボス特有の言動をするたびに白目をむいた。"}],"collocations":["corporate bossisms (企業におけるボス特有の言動)","management bossisms (経営陣のボス特有の言動)","workplace bossisms (職場のボス特有の言動)","petty bossisms (ささいなボス特有の言動)"],"synonyms":["authoritarianism","domineering behavior","condescension","patronizing attitude"],"antonyms":["egalitarianism","democratic leadership","collaborative approach","servant leadership"]}],"etymology":{"value":"「Boss」に、主義や特徴を表す接尾辞「-ism」を付けた造語。","priority":"★★★"},"pronunciation":{"ipa":"/ˈbɔːsɪzəmz/","syllables":"Boss-is-ms"},"inflection":{"noun_plural":"Bossisms"},"usage_notes":{"explanation":"「Bossisms」は、通常、否定的な意味合いで使用され、権力を持つ者がその地位を利用して不当な影響力を行使したり、部下を尊重しない態度を示したりすることを批判的に表現する際に用いられる。単数形はあまり使われず、複数形で使われることが多い。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The boss showed a bossism by helping the employee.","correct":"✓ The boss showed bossisms by micromanaging and taking credit for the team's work.","note":"「Bossisms」は通常、権威主義的または軽蔑的な行動の集合を指すため、単一の親切な行為を指すのには適していません。"},{"incorrect":"✗ We need to increase bossism in the company.","correct":"✓ We need to reduce bossisms in the company and promote a more collaborative environment.","note":"「Bossisms」は通常、否定的な意味合いで使用されるため、増やすことを推奨する文脈では不適切です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Bossy (形容詞: 威張り散らす、指図したがる)","Boss (名詞: 上司、ボス)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Bossisms」は、ビジネスや組織論の文脈で使われるやや専門的な言葉です。これは、上司や管理職が示す権威主義的、支配的、または軽蔑的な行動や態度を指します。この言葉は通常、批判的な意味合いで使用され、組織内の不健全な権力関係を指摘するために用いられます。日常会話で頻繁に使われる言葉ではありませんが、職場環境やリーダーシップについて議論する際に役立ちます。"},"example_sentences":[{"sentence":"The new manager's constant micromanaging was quickly labeled as a series of annoying bossisms.","translation":"新しいマネージャーの絶え間ないマイクロマネジメントは、すぐに迷惑なボス特有の言動の連続だとレッテルを貼られた。","type":"noun","meaning_category":"権威主義的な行動"},{"sentence":"The employees complained about the CEO's outdated bossisms, such as demanding absolute obedience.","translation":"従業員たちは、絶対服従を要求するなど、CEOの時代遅れのボス特有の言動について不満を述べた。","type":"noun","meaning_category":"部下を軽視する言動"},{"sentence":"To improve morale, the company decided to address the issue of bossisms and promote a more collaborative leadership style.","translation":"士気を向上させるため、会社はボス特有の言動の問題に取り組み、より協調的なリーダーシップスタイルを促進することを決定した。","type":"noun","meaning_category":"権威主義的な態度"}]}