{"word":"Croatan","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) クロアタン族：16世紀にノースカロライナ州のロスト・コロニー（ローノク植民地）の入植者と接触した、アルゴンキン語族のネイティブアメリカン部族。","english_definition":"(historical) A Native American tribe of Algonquian linguistic stock who lived in the area of the Lost Colony of Roanoke Island in the 16th century.","examples":[{"sentence":"The fate of the Lost Colony is often linked to the Croatan tribe.","translation":"ロスト・コロニーの運命は、しばしばクロアタン族と関連付けられる。"}],"collocations":["Lost Colony","Roanoke","Native American tribe"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(地名) クロアタン島：ノースカロライナ州デア郡に存在した、ローノク島南部の島。現在のハッテラス島の南部にあたる。","english_definition":"(place name) Croatan Island: A former island south of Roanoke Island in Dare County, North Carolina; now the southern part of Hatteras Island.","examples":[{"sentence":"Croatan Island is now part of Hatteras Island.","translation":"クロアタン島は現在、ハッテラス島の一部である。"}],"collocations":["Hatteras Island","Dare County","North Carolina"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"部族の名前は、彼らが居住していた島の名前から来ている可能性がある。","priority":"★★★"},"pronunciation":{"ipa":"/ˈkroʊəˌtæn/","syllables":"Cro-a-tan"},"inflection":{"notes":"名詞なので複数形は通常ありませんが、部族を指す場合は複数形 Croatans が使われることがあります。"},"usage_notes":{"explanation":"「**Croatan**」は、主に歴史的な文脈で使用される単語です。ロスト・コロニー（ローノク植民地）の謎を語る上で重要な部族であり、その消失との関連性が議論されています。地名としては、現在のハッテラス島の南部を指します。現代では、部族としてのクロアタン族は消滅したと考えられていますが、その血を引く人々は存在するとされています。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Croatan are a modern tribe in North Carolina.","correct":"✓ The Croatan were a historical tribe in North Carolina.","note":"クロアタン族は歴史的な部族であり、現代の部族ではありません。"},{"incorrect":"✗ Croatan is a language.","correct":"✓ Croatan was a tribe.","note":"クロアタンは言語の名前ではなく、部族の名前です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Croatoan (スペル違い。歴史的な文献ではこちらが使われることもあります。)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (歴史的な固有名詞のため、CEFRレベルは該当しません。)","frequency_google_ngram":"低頻度 (Low frequency) - 特定の歴史的文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Croatan**」は、アメリカ史、特にロスト・コロニー（ローノク植民地）の文脈でのみ登場する、専門的な単語です。この部族は、16世紀にローノク島の入植者と接触したネイティブアメリカンであり、入植者の消失の謎に関連しています。現代では、この単語は歴史的な研究や文献でのみ見られます。一般的には、歴史や人類学に興味のある読者層を対象としたテキストで使われるでしょう。"},"example_sentences":[{"sentence":"The word \"Croatoan\" was found carved on a post at the Roanoke settlement.","translation":"「クロアタン」という言葉が、ローノク植民地の柱に刻まれているのが発見された。","type":"noun","meaning_category":"部族名"},{"sentence":"Some historians believe the colonists integrated with the Croatan people.","translation":"一部の歴史家は、入植者たちがクロアタン族と融合したと考えている。","type":"noun","meaning_category":"部族名"},{"sentence":"The southern part of Hatteras Island was once known as Croatan Island.","translation":"ハッテラス島の南部は、かつてクロアタン島として知られていた。","type":"noun","meaning_category":"地名"}]}