{"word":"regionalist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"地域主義者、地方主義者","english_definition":"An advocate of regionalism; someone who supports or promotes the interests of a particular region or regions.","examples":[{"sentence":"He is a strong regionalist, advocating for greater autonomy for the provinces.","translation":"彼は強い地域主義者で、各地方のより大きな自治を提唱している。"},{"sentence":"The regionalists in the party pushed for policies that would benefit their specific areas.","translation":"党内の地域主義者たちは、自分たちの特定の地域に利益をもたらす政策を推進した。"}],"collocations":["strong regionalist (強い地域主義者)","local regionalist (地元の地域主義者)","political regionalist (政治的な地域主義者)"],"synonyms":["provincialist","localist"],"antonyms":["globalist","cosmopolitan"]},{"part_of_speech":"adjective","definition":"地域主義の、地方主義の","english_definition":"Relating to or supporting regionalism; characterized by a focus on the interests of a particular region or regions.","examples":[{"sentence":"The government's regionalist policies aimed to decentralize power.","translation":"政府の地域主義的な政策は、権力の分散を目的としていた。"},{"sentence":"The election saw a surge in support for regionalist parties.","translation":"選挙では、地域主義政党への支持が急増した。"}],"collocations":["regionalist policies (地域主義的な政策)","regionalist movement (地域主義運動)","regionalist agenda (地域主義的な課題)"],"synonyms":["provincial","local"],"antonyms":["global","cosmopolitan"]}],"etymology":{"value":"'Regional' + '-ist'. 'Regional' comes from 'region', ultimately from Latin 'regio' (district, area). The suffix '-ist' denotes a person who advocates or practices something.","priority":"★★★"},"pronunciation":{"ipa":"/ˈriːdʒənəlɪst/","syllables":"re-gion-al-ist"},"inflection":{"noun_plural":"regionalists","adjective_forms":[]},"usage_notes":{"explanation":"'Regionalist' refers to someone who believes in or supports regionalism, which is the theory or practice of emphasizing the regional level of administration or economic activity. It can also refer to policies or movements that prioritize regional interests over national or global ones. The term can have both positive and negative connotations, depending on the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a regionist.","correct":"✓ He is a regionalist.","note":"The correct term is 'regionalist', not 'regionist'."},{"incorrect":"✗ The regionalist economy.","correct":"✓ The regionalist economy/regional economy.","note":"While 'regionalist' can be used as an adjective, it's often more natural to use 'regional' to describe things related to a region."}],"priority":"★★☆"},"related_words":{"derivatives":["regionalism (地域主義)","region (地域)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'regionalist' is used to describe someone who supports the idea of regionalism, which means focusing on the interests and unique aspects of a specific region. This can involve promoting the region's culture, economy, or political autonomy. The term is often used in discussions about politics, economics, and cultural identity. Understanding the concept of 'regionalism' is key to understanding the meaning of 'regionalist'."},"example_sentences":[{"sentence":"The rise of regionalist sentiment has led to increased calls for decentralization.","translation":"地域主義的な感情の高まりは、地方分権化を求める声の増加につながっている。","type":"noun","meaning_category":"地域主義者"},{"sentence":"The government's regionalist approach to development has been criticized for neglecting certain areas.","translation":"政府の地域主義的な開発アプローチは、特定の地域を無視しているとして批判されている。","type":"adjective","meaning_category":"地域主義の"}]}