{"word":"lastage-free","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Exempt from lastage.","english_definition":"Not subject to lastage; exempt from the charge or duty levied on ships for the right to carry goods from a port.","examples":[{"sentence":"The ship was granted lastage-free status due to a special trade agreement.","translation":"その船は、特別な貿易協定により、ラスト料金が免除される地位を与えられました。"}],"collocations":["lastage-free port","lastage-free status"],"synonyms":["exempt from lastage","duty-free (in some contexts)"],"antonyms":["subject to lastage","taxable"],"notes":"Lastage is an obsolete term referring to a tax or duty on ships for the privilege of carrying goods from a port. The term 'lastage-free' is therefore rare in modern usage."}],"etymology":{"value":"Combination of 'lastage' (a tax on ships) and 'free' (exempt).","priority":"N/A"},"pronunciation":{"ipa":"/ˈlæstɪdʒˌfriː/","syllables":"las-tage-free"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"The term 'lastage-free' is historical and rarely used in contemporary English. It refers to a situation where a ship is exempt from paying lastage, a tax levied on ships for the right to carry goods from a port. This exemption could be granted for various reasons, such as trade agreements or special privileges.  Because lastage is no longer a common tax, the term 'lastage-free' is largely obsolete.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["lastage"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'lastage-free' is highly specialized and archaic, relating to historical maritime trade practices. Understanding it requires knowledge of obsolete taxation systems. It is unlikely to be encountered outside of historical texts or specialized academic discussions."},"example_sentences":[{"sentence":"Historically, certain vessels were declared lastage-free to encourage trade and commerce.","translation":"歴史的に、特定の船舶は貿易と商業を促進するためにラスト料金免除と宣言されました。","type":"adjective","meaning_category":"Exempt from lastage"}]}