{"word":"calendarist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"暦学者、暦作成者、暦に関する専門家","english_definition":"A person who studies or creates calendars; an expert in calendars.","examples":[{"sentence":"The calendarist meticulously calculated the dates for the upcoming year's lunar cycles.","translation":"その暦学者は、来年の太陰周期の日付を綿密に計算した。"},{"sentence":"Consult a calendarist to understand the intricacies of ancient timekeeping systems.","translation":"古代の暦法の複雑さを理解するには、暦学者に相談してください。"}],"collocations":["consult a calendarist","ancient calendarist","expert calendarist"],"synonyms":["chronologist","timekeeper","annalist"],"antonyms":[]}],"etymology":{"value":"\"Calendar\" + \"-ist\".  \"Calendar\" comes from Latin \"calendarium\" (account book, from \"kalendae\" - the first day of the Roman month, when accounts were due). \"-ist\" is a suffix denoting a person who practices or is concerned with something.","priority":"★★★"},"pronunciation":{"ipa":"/kəˈlɛndərɪst/","syllables":"ca-len-dar-ist"},"inflection":{"noun_plural":"calendarists"},"usage_notes":{"explanation":"The term \"calendarist\" is relatively uncommon in modern usage.  It refers specifically to someone with expertise in the design, study, or history of calendars.  It is more formal than simply saying someone \"knows a lot about calendars.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The calendarist predicted the weather.","correct":"✓ The calendarist calculated the equinox.","note":"Calendarists deal with dates and timekeeping, not weather prediction. That would be a meteorologist."}],"priority":"★☆☆"},"related_words":{"derivatives":["calendar","calendrical"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very rare)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'calendarist' is a niche term, primarily used in academic or historical contexts when discussing the intricacies of calendar systems and their development. Understanding requires familiarity with the etymology and the specific role such individuals played in societies reliant on accurate timekeeping."},"example_sentences":[{"sentence":"The ancient Egyptian calendarist played a crucial role in predicting the Nile's annual floods.","translation":"古代エジプトの暦学者は、ナイル川の毎年の洪水を予測する上で重要な役割を果たした。","type":"noun","meaning_category":"暦学者"},{"sentence":"Modern calendarists use sophisticated software to create and analyze complex calendar systems.","translation":"現代の暦学者は、高度なソフトウェアを使用して、複雑な暦システムを作成および分析する。","type":"noun","meaning_category":"暦学者"}]}