{"word":"tea-planter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"茶栽培者、茶園経営者","english_definition":"a person who owns or manages a tea plantation.","examples":[{"sentence":"The tea-planter lived in a large bungalow on the estate.","translation":"その茶栽培者は、農園の大きなバンガローに住んでいた。"},{"sentence":"Tea-planters in Assam faced many challenges during the colonial era.","translation":"アッサムの茶園経営者たちは、植民地時代に多くの困難に直面した。"}],"collocations":["tea plantation","tea estate","tea garden"],"synonyms":["tea grower","tea farmer","tea estate owner"],"antonyms":[]}],"etymology":{"value":"'tea' + 'planter'. 'Tea' is from Chinese (Min Nan) 茶 (tê). 'Planter' refers to someone who plants or cultivates, especially on a large scale.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtiːˌplɑːntər/","syllables":"tea-plan-ter"},"inflection":{"noun_plural":"tea-planters"},"usage_notes":{"explanation":"The term 'tea-planter' typically refers to someone involved in the large-scale cultivation of tea, often in regions with a history of tea production like India, Sri Lanka, and East Africa. It can also imply a certain social status or historical context, particularly in relation to colonial-era tea estates.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a tea planter of a small garden.","correct":"✓ He is a tea grower of a small garden.","note":"'Tea-planter' usually suggests a large-scale operation. For a small garden, 'tea grower' or 'tea farmer' might be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["tea plantation","tea estate","tea garden"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'tea-planter' is relatively uncommon and specific, referring to someone who owns or manages a tea plantation. Understanding requires knowledge of tea cultivation and potentially historical context related to tea-producing regions. The term is more likely to be encountered in literature, historical texts, or discussions about agriculture and trade. "},"example_sentences":[{"sentence":"The old **tea-planter** recounted stories of his family's history in Ceylon.","translation":"年老いた茶栽培者は、セイロンでの彼の家族の歴史について語った。","type":"noun","meaning_category":"茶栽培者"}]}