{"word":"unkemptly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"だらしなく、身なりを構わず、不精に","english_definition":"In an unkempt manner; with a neglected or disheveled appearance.","examples":[{"sentence":"He was dressed unkemptly, as if he hadn't slept in days.","translation":"彼は何日も寝ていないかのように、だらしなく身なりをしていた。"},{"sentence":"The garden grew unkemptly after the gardener left.","translation":"庭師がいなくなってから、庭はだらしなく荒れ放題になった。"}],"collocations":["dressed unkemptly","grew unkemptly"],"synonyms":["slovenly","untidily","disheveledly","messily"],"antonyms":["neatly","tidily","smartly","immaculately"]}],"etymology":{"value":"Formed from the adjective \"unkempt\" by adding the suffix \"-ly\". \"Unkempt\" itself comes from \"un-\" (not) + \"kempt\" (well-groomed), with \"kempt\" being an archaic past participle of \"to comb\".","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈkemptli/","syllables":"un-kempt-ly"},"inflection":{"notes":"Adverbs do not typically inflect. This word is formed by adding -ly to the adjective unkempt."},"usage_notes":{"explanation":"\"Unkemptly\" is an adverb that describes the manner in which something is done or appears. It suggests a lack of care or attention to grooming or order. It is less common than the adjective \"unkempt\", but it is used to modify verbs, indicating how an action is performed in a disheveled or neglected way.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He looked unkemptly.","correct":"✓ He looked unkempt.","note":"\"Unkempt\" is an adjective, so it should be used to describe a noun (e.g., \"He looked unkempt\"). \"Unkemptly\" is an adverb, and it should be used to describe a verb (e.g., \"He dressed unkemptly\")."},{"incorrect":"✗ The room was unkemptly.","correct":"✓ The room was unkempt.","note":"Similar to the previous example, use the adjective \"unkempt\" to describe the state of the room."}],"priority":"★★☆"},"related_words":{"derivatives":["unkempt (adjective: not combed; disheveled; having an untidy appearance)"],"phrases":[],"related_concepts":["slovenliness","dishevelment","untidiness"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unkemptly\" is an adverb describing something done in a disheveled or untidy manner. It's derived from the more common adjective \"unkempt,\" meaning not properly groomed or maintained. The adverb is used to modify verbs, indicating the way in which an action is performed with a lack of care for appearance. It's a relatively rare word, typically found in more descriptive or literary contexts."},"example_sentences":[{"sentence":"The children, left to their own devices, played unkemptly in the mud.","translation":"子供たちは放っておかれたので、泥の中でだらしなく遊んだ。","type":"adverb","meaning_category":"身なりを構わず"},{"sentence":"The hair on his head stuck out every which way, and he was dressed unkemptly in mismatched clothes.","translation":"彼の頭の髪はあちこち跳ねており、彼はちぐはぐな服をだらしなく着ていた。","type":"adverb","meaning_category":"だらしなく"}]}