{"word":"lunatically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"狂ったように、ばかげたやり方で","english_definition":"in a manner characteristic of a lunatic; insanely or wildly irrationally.","examples":[{"sentence":"He drove lunatically down the street, ignoring all traffic laws.","translation":"彼は交通法規を無視して、狂ったように通りを走り抜けた。"},{"sentence":"She laughed lunatically at the absurd situation.","translation":"彼女はそのばかげた状況を狂ったように笑った。"},{"sentence":"The project was lunatically ambitious, with no chance of success.","translation":"そのプロジェクトはばかげたほど野心的で、成功の可能性はなかった。"}],"collocations":["drive lunatically","laugh lunatically","ambitious lunatically"],"synonyms":["insanely","madly","crazily","irrationally","foolishly","absurdly"],"antonyms":["rationally","sensibly","logically","prudently"]}],"etymology":{"value":"'Lunatic' (狂人) + '-ally' (〜のように)","priority":"★★☆"},"pronunciation":{"ipa":"/ˈluːnətɪkli/","syllables":"lu-na-ti-cal-ly"},"inflection":{"notes":"This word is an adverb and does not have different inflections."},"usage_notes":{"explanation":"'Lunatically' implies behavior that is not only irrational but also suggests a degree of wildness or madness. It is often used to describe actions that are reckless, foolish, or completely out of touch with reality. The word carries a strong negative connotation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He worked lunatically hard.","correct":"✓ He worked incredibly/extremely hard.","note":"While 'lunatically' implies intensity, it also suggests irrationality. Use 'incredibly' or 'extremely' to simply indicate a high degree of effort without implying madness."},{"incorrect":"✗ She was acting lunatically because she was happy.","correct":"✓ She was acting excitedly/euphorically because she was happy.","note":"'Lunatically' suggests mental instability. Use words like 'excitedly' or 'euphorically' to describe someone behaving energetically due to happiness."}],"priority":"★★☆"},"related_words":{"derivatives":["lunatic (noun, adjective)","lunacy (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'lunatically' is used to describe something done in a crazy or irrational way, similar to how a 'lunatic' (a person who is mentally ill) might act. It's a strong word that suggests a lack of reason or control. Because of its strong and somewhat outdated association with mental illness, it's not used very often and can sometimes be considered offensive if used carelessly. It's more common to use words like 'insanely' or 'madly' to describe similar behavior without the negative connotations."},"example_sentences":[{"sentence":"The stock market rose lunatically, defying all expert predictions.","translation":"株式市場は専門家の予測をすべて無視して、狂ったように上昇した。","type":"adverb","meaning_category":"irrational manner"},{"sentence":"He spent money lunatically, buying things he didn't need.","translation":"彼は必要のないものを買って、狂ったように金を使った。","type":"adverb","meaning_category":"foolish manner"},{"sentence":"The crowd cheered lunatically as the team scored the winning goal.","translation":"チームが決勝点を挙げると、群衆は狂ったように歓声を上げた。","type":"adverb","meaning_category":"wildly"}]}