{"word":"macrography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"拡大写真術、低倍率の顕微鏡写真術","english_definition":"The production of photographs of small objects at magnifications up to about 50 times actual size.","examples":[{"sentence":"Macrography is often used in forensic science to examine small details on evidence.","translation":"拡大写真術は、しばしば法医学において証拠品の細部を調べるために用いられる。"},{"sentence":"The macrography revealed the intricate structure of the insect's eye.","translation":"拡大写真術によって、その昆虫の目の複雑な構造が明らかになった。"}],"collocations":["use macrography","macrography reveals","macrography technique"],"synonyms":["photomacrography","close-up photography"],"antonyms":["microscopy","photomicrography"]}],"etymology":{"value":"'Macro-' (large) + '-graphy' (writing or representation).","priority":"★★☆"},"pronunciation":{"ipa":"/mækˈrɒɡrəfi/","syllables":"mac-rog-ra-phy"},"inflection":{"noun_plural":"macrographies"},"usage_notes":{"explanation":"Macrography is a photographic technique used to produce images of small objects at magnifications up to about 50x. It differs from photomicrography, which uses higher magnifications achieved with a microscope. Macrography is often used in fields such as forensic science, materials science, and biology to examine details that are not easily visible to the naked eye.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used microscopy to take a picture of the coin.","correct":"✓ I used macrography to take a picture of the coin.","note":"Microscopy is for much higher magnifications than macrography."}],"priority":"★★☆"},"related_words":{"derivatives":["macrographic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Macrography is a specialized term related to photography. It refers to the process of creating enlarged photographs of small objects, typically at magnifications up to around 50 times their actual size. This technique is used to reveal details that are not easily visible with the naked eye. It is distinct from microscopy, which involves much higher levels of magnification using a microscope."},"example_sentences":[{"sentence":"The jeweler used macrography to inspect the diamond for flaws.","translation":"宝石商は、ダイヤモンドの欠陥を検査するために拡大写真術を使用した。","type":"general","meaning_category":"definition"},{"sentence":"Macrography is a valuable tool for documenting the condition of artifacts.","translation":"拡大写真術は、工芸品の状態を記録するための貴重なツールである。","type":"general","meaning_category":"definition"}]}