{"word":"homesteader","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"自作農地取得者、ホームステッド法に基づく入植者","english_definition":"A person who settles on public land under the provisions of the Homestead Act or similar laws, typically to acquire ownership by living on it and cultivating it.","examples":[{"sentence":"The homesteader built a small cabin and began to cultivate the land.","translation":"自作農地取得者は小さな小屋を建て、土地の耕作を始めた。"},{"sentence":"Many homesteaders faced hardship and isolation in the American West.","translation":"多くのアメリカ西部の自作農地取得者は苦難と孤立に直面した。"},{"sentence":"The government encouraged homesteaders to settle the frontier.","translation":"政府は自作農地取得者たちにフロンティアへの入植を奨励した。"}],"collocations":["become a homesteader (自作農地取得者になる)","homesteader family (自作農地取得者の家族)","homesteader cabin (自作農地取得者の小屋)","homesteader life (自作農地取得者の生活)"],"synonyms":["settler","pioneer","colonist","farmer","rancher"],"antonyms":[]}],"etymology":{"value":"The word 'homesteader' is derived from 'homestead,' referring to a dwelling with its land and buildings, especially a farm. It combines 'home' (dwelling) with 'stead' (place, farm). The suffix '-er' indicates a person associated with or engaged in something.","priority":"★★☆"},"pronunciation":{"ipa":"ˈhoʊmˌstɛdər/","syllables":"home-stead-er"},"inflection":{"noun_plural":"homesteaders"},"usage_notes":{"explanation":"A 'homesteader' specifically refers to someone who acquired land through the Homestead Act or similar legislation. This act, particularly in the United States, allowed individuals to claim public land and gain ownership by living on it for a certain period and making improvements, such as building a home and cultivating the land. The term evokes images of pioneering life, self-sufficiency, and the challenges of settling undeveloped territories.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a homesteader in the city.","correct":"✓ He was a farmer in the city.","note":"'Homesteader' specifically refers to someone who claimed land in rural areas under the Homestead Act or similar laws. It is not used for urban farmers. Use 'farmer' instead."},{"incorrect":"✗ She homesteaded the land without living on it.","correct":"✓ She claimed the land, but did not fulfill the requirements of homesteading.","note":"Living on the land and making improvements were essential requirements for homesteading. Simply claiming the land without fulfilling these requirements does not make someone a homesteader."}],"priority":"★★☆"},"related_words":{"derivatives":["homestead (noun: 家屋敷、自作農地)","homesteading (noun: 自作農地取得)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'homesteader' refers to someone who settled on public land, especially in the United States, under the Homestead Act. This act allowed people to gain ownership of land by living on it and farming it. The word is often used in discussions about the history of the American West and the challenges faced by early settlers. It implies a sense of self-sufficiency, hard work, and pioneering spirit.","priority":"★★☆"},"example_sentences":[{"sentence":"The **homesteader** cleared the land and planted crops.","translation":"その自作農地取得者は土地を開墾し、作物を植えた。","type":"noun","meaning_category":"自作農地取得者"},{"sentence":"Life as a **homesteader** was difficult, but rewarding.","translation":"自作農地取得者としての生活は困難だったが、やりがいがあった。","type":"noun","meaning_category":"自作農地取得者"},{"sentence":"The **homesteaders** built their homes from logs and sod.","translation":"自作農地取得者たちは丸太とソッド（草の根がついた土）で家を建てた。","type":"noun","meaning_category":"自作農地取得者"}]}