{"word":"summary-oriented","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"概要を重視する、要約に重点を置く","english_definition":"Focused on or prioritizing summaries; designed or inclined to provide or understand information in a summarized form.","examples":[{"sentence":"The report is summary-oriented, providing only the key findings.","translation":"その報告書は概要を重視しており、主要な調査結果のみを提供している。"},{"sentence":"He prefers summary-oriented presentations rather than detailed explanations.","translation":"彼は詳細な説明よりも、要約に重点を置いたプレゼンテーションを好む。"},{"sentence":"The software offers a summary-oriented view of the data.","translation":"そのソフトウェアは、データの概要を重視した表示を提供する。"}],"collocations":["summary-oriented report","summary-oriented presentation","summary-oriented approach","summary-oriented overview","summary-oriented dashboard"],"synonyms":["concise","abridged","brief","synoptic","overview-focused"],"antonyms":["detailed","comprehensive","exhaustive","in-depth","elaborate"]}],"etymology":{"value":"The word is formed by combining 'summary' (a brief account of the main points of something) with 'oriented' (directed toward or interested in something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌməri ˌɔːriɛnˌtɪd/","syllables":"sum-ma-ry-o-ri-en-ted"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than forming comparative and superlative degrees (which are rare for compound adjectives like this)."},"usage_notes":{"explanation":"'Summary-oriented' describes something that is designed or intended to provide information in a condensed, easily digestible format. It is often used in the context of reports, presentations, or software interfaces where the user needs to quickly grasp the main points without getting bogged down in details.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The summary-oriented of the book was excellent.","correct":"✓ The summary-oriented approach of the book was excellent.","note":"'Summary-oriented' is an adjective, so it needs to modify a noun. Using it as a noun is incorrect."},{"incorrect":"✗ He is a summary-oriented person.","correct":"✓ He prefers summary-oriented information.","note":"While grammatically correct, saying someone is a 'summary-oriented person' is less common. It's more typical to say they 'prefer summary-oriented information' or 'have a summary-oriented approach'."}],"priority":"★★☆"},"related_words":{"derivatives":["summary","oriented"],"phrasal_verbs":[],"related_terms":["executive summary","abstract","synopsis","overview","precis"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency (relatively uncommon, but understandable in context)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Summary-oriented' is a term used to describe something that focuses on providing a brief overview or the main points of a topic. It's often used in professional or academic settings to describe reports, presentations, or documents that prioritize conciseness and efficiency in conveying information. Understanding this term helps in recognizing and creating content that is designed for quick comprehension."},"example_sentences":[{"sentence":"The training program includes a summary-oriented module for busy managers.","translation":"その研修プログラムには、多忙なマネージャー向けの概要重視のモジュールが含まれている。","type":"adjective","meaning_category":"概要を重視する"},{"sentence":"We need a summary-oriented dashboard to monitor key performance indicators.","translation":"主要業績評価指標を監視するための、概要を重視したダッシュボードが必要だ。","type":"adjective","meaning_category":"概要を重視する"},{"sentence":"The course offers a summary-oriented review of the main concepts.","translation":"そのコースは、主要な概念の概要を重視したレビューを提供する。","type":"adjective","meaning_category":"概要を重視する"}]}