{"word":"tannogen","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"タンノゲン：タンニン酸誘導体の一種で、収斂剤、止瀉薬として用いられる","english_definition":"A type of tannic acid derivative used as an astringent and antidiarrheal.","examples":[{"sentence":"Tannogen is used to treat diarrhea in children.","translation":"タンノゲンは子供の下痢の治療に用いられる。"}],"collocations":["tannogen powder","tannogen treatment"],"synonyms":["tannin albuminate"],"antonyms":[]}],"etymology":{"value":"Derived from \"tannin\" (referring to tannic acid) and \"-gen\" (a suffix indicating a precursor or substance that produces something).","priority":"★★★"},"pronunciation":{"ipa":"/ˈtænoʊdʒən/","syllables":"tan-no-gen"},"inflection":{"noun_plural":"tannogens"},"usage_notes":{"explanation":"Tannogen is a specific chemical compound, a tannic acid derivative. It's primarily known for its use in medicine, particularly as an astringent to reduce inflammation and as an antidiarrheal to treat diarrhea. Its use has become less common with the advent of more modern pharmaceuticals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Tannogen is a type of antibiotic.","correct":"✓ Tannogen is a type of astringent.","note":"Tannogen is an astringent, not an antibiotic."}],"priority":"★★☆"},"related_words":{"derivatives":["tannic acid","tannin"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - a specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Tannogen\" is a specialized term primarily encountered in medical or pharmaceutical contexts. It refers to a specific tannic acid derivative used for its astringent and antidiarrheal properties. Understanding this term requires familiarity with basic chemistry and medical terminology."},"example_sentences":[{"sentence":"The doctor prescribed tannogen for the patient's persistent diarrhea.","translation":"医師は患者の持続的な下痢に対してタンノゲンを処方した。","type":"noun","meaning_category":"medicine"},{"sentence":"Tannogen acts as an astringent, helping to reduce inflammation in the digestive tract.","translation":"タンノゲンは収斂剤として作用し、消化管の炎症を抑えるのに役立つ。","type":"noun","meaning_category":"medicine"}]}