{"word":"benefice","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"聖職禄、教会禄","english_definition":"an ecclesiastical office to which revenues are attached","examples":[{"sentence":"He was appointed to a benefice in the countryside.","translation":"彼は田舎の聖職禄に任命された。"},{"sentence":"The income from the benefice supported the priest's work.","translation":"聖職禄からの収入が司祭の活動を支えた。"}],"collocations":["hold a benefice","be appointed to a benefice","receive a benefice"],"synonyms":["living","cure","vicarage","rectory","prebend"],"antonyms":[]}],"etymology":{"value":"Middle English, from Old French, from Latin beneficium 'benefit, favour', from bene facere 'do well'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɛnɪfɪs/","syllables":"ben-e-fice"},"inflection":{"noun_plural":"benefices"},"usage_notes":{"explanation":"A 'benefice' is a specific term related to the Church of England and other Anglican churches, as well as the Roman Catholic Church. It refers to a position within the church that provides income to its holder. It's a somewhat archaic term and not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He received a benefit from the church.","correct":"✓ He received a benefice from the church.","note":"'Benefit' is a general term for an advantage or profit, while 'benefice' specifically refers to a church office with revenue."}],"priority":"★☆☆"},"related_words":{"derivatives":["beneficial","beneficiary","benefit"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'benefice' is a specialized term primarily used in historical or religious contexts, specifically related to the Church of England or the Roman Catholic Church. It refers to an ecclesiastical office that provides income to its holder. Due to its limited usage and specific context, it's considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The new vicar was granted a benefice that included a small parish church and its associated lands.","translation":"新しい牧師には、小さな教区教会とそれに付随する土地を含む聖職禄が与えられた。","type":"noun","meaning_category":"聖職禄"},{"sentence":"Many sought a benefice as a means of securing a stable income and social standing within the community.","translation":"多くの人々が、安定した収入と地域社会における社会的地位を確保する手段として聖職禄を求めた。","type":"noun","meaning_category":"聖職禄"}]}