{"word":"Katholikoses","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(主に正教会で)カトリコス、総主教","english_definition":"(chiefly in the Eastern Orthodox Church) a catholicos; a supreme patriarch.","examples":[{"sentence":"The Katholikoses of the Armenian Apostolic Church resides in Etchmiadzin.","translation":"アルメニア使徒教会のカトリコスはエチミアジンに居住している。"}],"collocations":[],"synonyms":["patriarch","supreme head"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'καθολικός' (katholikos), meaning 'universal' or 'general'. The term was adopted to denote the head of certain autocephalous churches within Eastern Christianity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkæθəˈlɪkoʊˌsiːz/","syllables":"ka-tho-li-ko-ses"},"inflection":{"noun_plural":"Katholikoses"},"usage_notes":{"explanation":"The term 'Katholikoses' refers to the title given to the supreme patriarch or head of certain independent (autocephalous) churches within Eastern Christianity, particularly in the Armenian Apostolic Church, the Georgian Orthodox Church, and the Assyrian Church of the East. The term emphasizes the universal or catholic nature of the church under their leadership. It is not a commonly used word outside of theological or historical contexts related to these specific churches.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["catholicos (singular form)","catholic (related to the general concept of universality)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Katholikoses' is a highly specialized term primarily used in the context of Eastern Christian churches, specifically referring to the supreme patriarch or head of certain autocephalous churches like the Armenian Apostolic Church or the Georgian Orthodox Church. Understanding requires familiarity with Eastern Christian ecclesiastical structures and terminology. The word's etymology connects to the Greek term 'katholikos,' meaning 'universal,' reflecting the comprehensive authority of the office within its church. Due to its limited usage and specific religious context, it's not part of general vocabulary and is encountered mainly in theological or historical discussions."},"example_sentences":[{"sentence":"The enthronement of the new Katholikoses was a significant event for the entire nation.","translation":"新しいカトリコスの即位は、国全体にとって重要な出来事でした。","type":"noun","meaning_category":"religious leader"},{"sentence":"Delegates from various Orthodox churches attended the Katholikoses's anniversary celebration.","translation":"様々な正教会からの代表者が、カトリコスの記念式典に出席しました。","type":"noun","meaning_category":"religious leader"}]}