{"word":"scirrhus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"硬性癌、スキルス癌","english_definition":"A hard, cancerous tumor, especially one that is rich in fibrous connective tissue; a scirrhous carcinoma.","examples":[{"sentence":"The biopsy revealed a scirrhus in the breast tissue.","translation":"生検の結果、乳房組織にスキルス癌が認められた。"},{"sentence":"Scirrhus is characterized by its slow growth and dense consistency.","translation":"スキルス癌は、その緩慢な成長と緻密な硬さが特徴である。"}],"collocations":["scirrhus carcinoma","breast scirrhus","gastric scirrhus"],"synonyms":["scirrhous carcinoma","fibrous carcinoma"],"antonyms":[]}],"etymology":{"value":"From the Ancient Greek word \"skirrhos\" (σκίρρος), meaning \"hard swelling, hard tumor\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈskɪrəs/","syllables":"scir-rhus"},"inflection":{"noun_plural":"scirruses or scirrhi"},"usage_notes":{"explanation":"'Scirrhus' refers specifically to a type of cancer characterized by its hardness and abundance of fibrous tissue. It's a medical term primarily used in pathology and oncology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said it was just a scirrhus.","correct":"✓ The doctor said it was just a benign tumor.","note":"'Scirrhus' always refers to a cancerous tumor, so it's incorrect to use it in a context implying it's benign."}],"priority":"★★☆"},"related_words":{"derivatives":["scirrhous (adjective: 硬性癌の、スキルス性の)","scirrhosity (noun: 硬性)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Scirrhus' is a highly specialized medical term used to describe a specific type of hard, cancerous tumor. It is primarily encountered in medical contexts, such as pathology reports or oncology discussions. Due to its technical nature, understanding this term requires advanced knowledge of medical terminology. It is not part of general vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The patient was diagnosed with scirrhus of the stomach.","translation":"患者は胃のスキルス癌と診断された。","type":"noun","meaning_category":"硬性癌"},{"sentence":"Scirrhus is often difficult to detect in early stages.","translation":"スキルス癌は初期段階での発見が難しいことが多い。","type":"noun","meaning_category":"硬性癌"}]}