{"word":"sphaerolitic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"球顆状組織の、球状集晶質の","english_definition":"(of a rock texture) consisting of or characterized by spherulites.","examples":[{"sentence":"The rhyolite has a sphaerolitic texture.","translation":"その流紋岩は球顆状組織を持つ。"},{"sentence":"Sphaerolitic structures are common in rapidly cooled volcanic rocks.","translation":"球顆状組織は急速に冷却された火山岩によく見られる。"}],"collocations":["sphaerolitic texture","sphaerolitic structure"],"synonyms":["spherulitic"],"antonyms":[]}],"etymology":{"value":"Derived from 'spherulite' (球顆) + '-ic' (～の、～に関する). 'Spherulite' comes from the Greek 'sphaira' (sphere, ball) + '-lite' (stone).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsfɪərəlɪˈtɪk/","syllables":"sphae-ro-li-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than forming comparative and superlative degrees (more sphaerolitic, most sphaerolitic)."},"usage_notes":{"explanation":"'Sphaerolitic' describes a specific texture found in some igneous rocks, particularly volcanic rocks that have cooled rapidly. This texture is characterized by the presence of spherulites, which are radial aggregates of fibrous crystals. The term is primarily used in geology and materials science.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock was spherical.","correct":"✓ The rock had a sphaerolitic texture.","note":"'Spherical' means shaped like a sphere. 'Sphaerolitic' describes a specific texture composed of radial aggregates, not simply a spherical shape."}],"priority":"★★☆"},"related_words":{"derivatives":["spherulite (noun): A radial aggregate of fibrous crystals, typically found in glassy volcanic rocks.","spherulitic texture (noun): The texture of a rock containing spherulites."],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sphaerolitic' is a technical term used in geology and materials science to describe a specific rock texture. Understanding the term requires knowledge of petrology and rock formation processes. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"Microscopic analysis revealed a distinct sphaerolitic texture within the obsidian sample.","translation":"顕微鏡分析により、その黒曜石のサンプルの中に明確な球顆状組織が認められた。","type":"general","meaning_category":"texture"},{"sentence":"The rapid cooling of the lava flow resulted in the formation of sphaerolitic structures.","translation":"溶岩流の急速な冷却は、球顆状組織の形成をもたらした。","type":"geology","meaning_category":"formation"}]}