{"word":"commercial-grade","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"業務用、商業用、プロ仕様","english_definition":"of a quality suitable for use in a business or commercial setting; designed for or used in commerce.","examples":[{"sentence":"We need to buy a commercial-grade refrigerator for the restaurant.","translation":"レストラン用に業務用冷蔵庫を買う必要があります。"},{"sentence":"This is a commercial-grade vacuum cleaner, much more powerful than a household model.","translation":"これは業務用掃除機で、家庭用モデルよりもはるかに強力です。"},{"sentence":"The bakery uses commercial-grade ovens to bake large quantities of bread.","translation":"そのパン屋は、大量のパンを焼くために業務用オーブンを使用しています。"}],"collocations":["commercial-grade equipment (業務用機器)","commercial-grade appliances (業務用電化製品)","commercial-grade materials (業務用材料)","commercial-grade kitchen (業務用厨房)","commercial-grade software (業務用ソフトウェア)"],"synonyms":["industrial-grade","heavy-duty","professional-grade"],"antonyms":["residential-grade","household-grade","consumer-grade"]}],"etymology":{"value":"Combination of 'commercial' (relating to commerce or business) and 'grade' (a level of quality).","priority":"★★★"},"pronunciation":{"ipa":"/kəˈmɜːrʃəl ɡreɪd/","syllables":"co-mer-cial-grade"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Commercial-grade' indicates a product or material is built to withstand the demands of a business environment. This typically means higher durability, performance, and lifespan compared to items designed for home use. It often implies a higher price point as well.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a commercial-grade toy for my child.","correct":"✓ I bought a durable toy for my child.","note":"Using 'commercial-grade' for a toy is unusual, as toys are rarely subjected to the same demands as commercial equipment. 'Durable' is a more appropriate term."},{"incorrect":"✗ This is a commercial-grade house.","correct":"✓ This is a well-built house.","note":"'Commercial-grade' typically refers to equipment or materials, not entire structures. Use 'well-built', 'sturdy', or similar terms to describe a house."}],"priority":"★★☆"},"related_words":{"derivatives":["commercial (adjective, noun)","grade (noun, verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but common in specific contexts (e.g., business, construction).","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Commercial-grade' means something is made to be used in a business, so it is usually stronger and lasts longer than things made for homes. Think of a restaurant's oven versus the one in your kitchen. It's used in situations where things are used a lot or need to be very reliable."},"example_sentences":[{"sentence":"The hotel uses commercial-grade laundry machines to wash all the linens.","translation":"ホテルでは、すべてのリネンを洗うために業務用洗濯機を使用しています。","type":"example","meaning_category":"業務用"},{"sentence":"For the new office building, they specified commercial-grade carpeting.","translation":"新しいオフィスビルには、業務用カーペットが指定されました。","type":"example","meaning_category":"商業用"},{"sentence":"We invested in commercial-grade security cameras for the store.","translation":"店舗用に業務用防犯カメラに投資しました。","type":"example","meaning_category":"プロ仕様"}]}