{"word":"Passiflora","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トケイソウ属","english_definition":"A genus of about 550 species of flowering plants, the type genus of the family Passifloraceae. They are mostly vines, with some being shrubs or trees. They can be tendril climbers or non-climbing.","examples":[{"sentence":"Passiflora edulis is cultivated for its fruit.","translation":"Passiflora edulis（クダモノトケイソウ）はその果実のために栽培されています。"},{"sentence":"Many species of Passiflora are known for their intricate and beautiful flowers.","translation":"トケイソウ属の多くの種は、その複雑で美しい花で知られています。"}],"collocations":["Passiflora caerulea","Passiflora edulis","Passiflora incarnata","Passiflora flower","Passiflora vine"],"synonyms":["passion flower","passionfruit"],"antonyms":[]}],"etymology":{"value":"From Latin passio (\"passion\") and flos (\"flower\"), from the resemblance of the flower parts to the instruments of the Passion of Christ.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæsɪˈflɔːrə/","syllables":"Pas-si-flo-ra"},"inflection":{"notes":"Plural: Passifloras"},"usage_notes":{"explanation":"Passiflora refers to the genus of flowering plants commonly known as passion flowers or passionfruits. These plants are known for their distinctive and often intricate flowers, as well as for producing edible fruits in some species. The name originates from the symbolic interpretation of the flower parts as representing elements of the Passion of Christ.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Passiflora is a type of animal.","correct":"✓ Passiflora is a type of plant.","note":"Passiflora is a genus of flowering plants, not animals."},{"incorrect":"✗ All Passiflora species produce edible fruit.","correct":"✓ Not all Passiflora species produce edible fruit.","note":"While some Passiflora species are cultivated for their edible fruits (passionfruit), not all species produce edible fruit."}],"priority":"★★☆"},"related_words":{"derivatives":["Passifloraceae (family)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Passiflora' is a botanical term referring to a genus of flowering plants, commonly known as passion flowers or passionfruits. The term is generally used in scientific or horticultural contexts. Understanding requires familiarity with botanical nomenclature and plant classification. The word's etymology is rooted in Latin, reflecting the symbolic association of the flower's parts with the Passion of Christ."},"example_sentences":[{"sentence":"The vibrant colors of the **Passiflora** flower attract many pollinators.","translation":"トケイソウの花の鮮やかな色彩は、多くの送粉者を魅了します。","type":"noun","meaning_category":"トケイソウ属"},{"sentence":"**Passiflora edulis** is widely grown in tropical and subtropical regions for its delicious fruit.","translation":"クダモノトケイソウは、その美味しい果実のために熱帯および亜熱帯地域で広く栽培されています。","type":"noun","meaning_category":"トケイソウ属"}]}