{"word":"lastage","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(船舶の)バラスト、船底積荷","english_definition":"Ballast for a ship; materials used to keep a ship steady when it has little or no cargo.","examples":[{"sentence":"The ship needed lastage to maintain stability on its voyage.","translation":"その船は航海中の安定を保つためにバラストを必要とした。"},{"sentence":"They loaded lastage into the hold before setting sail.","translation":"彼らは出航前に船倉にバラストを積み込んだ。"}],"collocations":["ship's lastage","loading lastage","remove lastage"],"synonyms":["ballast","cargo","weight"],"antonyms":["cargo","freight"]},{"part_of_speech":"noun","definition":"(歴史的な意味合いで)船舶が港で使用する場所に対する料金","english_definition":"(historical) A charge or duty levied on ships for the use of a port.","examples":[{"sentence":"The lastage fees were collected by the port authority.","translation":"港湾当局がラストエイジ料金を徴収した。"},{"sentence":"Merchants complained about the high lastage imposed on their vessels.","translation":"商人は船に課せられる高いラストエイジに不満を述べた。"}],"collocations":["port lastage","lastage fees","impose lastage"],"synonyms":["port dues","harbor fees","tonnage"],"antonyms":[]}],"etymology":{"value":"Derived from 'last', referring to the burden or load of a ship, and the suffix '-age', indicating a charge or duty.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlæstɪdʒ/","syllables":"las-tage"},"inflection":{"noun_plural":"lastages"},"usage_notes":{"explanation":"'Lastage' refers primarily to the ballast of a ship, the material used to stabilize it when not fully loaded with cargo. It can also refer to a historical fee charged to ships for using a port. The term is not commonly used in modern contexts, with 'ballast' being the more prevalent term for the ship's stabilizing material.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ship was filled with lastage of goods.","correct":"✓ The ship was filled with a cargo of goods.","note":"'Lastage' refers to the ballast, not the cargo itself."},{"incorrect":"✗ They paid the lastage for their goods.","correct":"✓ They paid the freight for their goods.","note":"'Lastage' refers to port fees or ballast, not the cost of transporting goods."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lastage' is a relatively obscure term with two primary meanings: the ballast of a ship and a historical port fee. It is not commonly encountered in modern English, and its usage is largely confined to historical or nautical contexts. Understanding the term requires familiarity with maritime terminology and historical trade practices."},"example_sentences":[{"sentence":"The captain ordered the crew to adjust the lastage to correct the ship's list.","translation":"船長は船の傾きを修正するために、乗組員にバラストの調整を命じた。","type":"noun","meaning_category":"Ballast"},{"sentence":"The historical records detailed the amount of lastage collected by the city each year.","translation":"歴史的な記録には、市が毎年徴収したラストエイジの金額が詳細に記されていた。","type":"noun","meaning_category":"Port fee"}]}