{"word":"Anythingarianism","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"（哲学）何でもあり主義、あらゆる意見や信念を許容する立場。特定の教義や原則に固執せず、多様性を尊重する考え方。","english_definition":"(philosophy) The belief that anything goes; the acceptance of any and all opinions or beliefs without adherence to specific doctrines or principles; a philosophy that values diversity and tolerance above all else.","examples":[{"sentence":"Anythingarianism can lead to a lack of critical thinking and the acceptance of harmful ideas.","translation":"何でもあり主義は、批判的思考の欠如や有害な考えを受け入れることにつながる可能性がある。"},{"sentence":"Some critics argue that postmodernism promotes anythingarianism by rejecting objective truth.","translation":"一部の批評家は、ポストモダニズムが客観的真実を拒否することで、何でもあり主義を助長していると主張している。"},{"sentence":"The professor warned against the dangers of anythingarianism in ethical decision-making.","translation":"教授は、倫理的な意思決定における何でもあり主義の危険性について警告した。"}],"collocations":["embrace anythingarianism (何でもあり主義を受け入れる)","criticize anythingarianism (何でもあり主義を批判する)","dangers of anythingarianism (何でもあり主義の危険性)","ethical anythingarianism (倫理的な何でもあり主義)"],"synonyms":["relativism","pluralism","tolerance","permissiveness","laissez-faire"],"antonyms":["dogmatism","authoritarianism","fundamentalism","absolutism","orthodoxy"]}],"etymology":{"value":"\"anything\" + \"-arian\" (支持者) + \"-ism\" (主義) から派生。あらゆるものを許容する主義を表す。","priority":"中"},"pronunciation":{"ipa":"/ˌɛnɪθɪŋˈɛəriənɪzəm/","syllables":"en-i-thing-air-i-an-i-zem"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Anythingarianismは、特定の信念体系や価値観を持たず、あらゆる意見や行動を許容する立場を指す哲学的な概念です。この用語は通常、批判的な意味合いで使用され、客観的な真実や道徳的基準の欠如を指摘するために用いられます。Anythingarianismは、相対主義や多元主義と関連付けられることがありますが、道徳的な指針や批判的思考を欠いているという点で、より否定的な意味合いを持ちます。","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"Anythingarianism is the same as tolerance.","correct":"Anythingarianism is a form of extreme tolerance that can lead to the acceptance of harmful ideas, while tolerance involves respecting different views within reasonable boundaries.","note":"Anythingarianismは、あらゆる意見を無条件に許容する極端な寛容さであり、有害な考えを受け入れることにつながる可能性があります。一方、通常の寛容は、合理的な境界内で異なる意見を尊重することを含みます。"},{"incorrect":"Anythingarianism provides a strong foundation for ethical decision-making.","correct":"Anythingarianism can undermine ethical decision-making by rejecting objective moral standards.","note":"Anythingarianismは、客観的な道徳基準を拒否するため、倫理的な意思決定を弱体化させる可能性があります。"}],"priority":"低"},"related_words":{"derivatives":["anythingarian (何でもあり主義者)"],"phrases":["moral relativism","cultural relativism","ethical subjectivism"],"priority":"低"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"高","text":"Anythingarianismは、哲学や社会学の文脈で使用される専門用語であり、日常会話ではほとんど使用されません。この用語は、特定の信念や原則を持たず、あらゆる意見や行動を許容する立場を指します。この概念は、客観的な真実や道徳的基準の欠如を批判的に議論する際に用いられることが多いです。"},"example_sentences":[{"sentence":"The professor argued that the university's emphasis on diversity had inadvertently led to a form of anythingarianism, where all viewpoints were considered equally valid, regardless of their factual basis.","translation":"教授は、大学の多様性重視が、事実に基づいているかどうかに関わらず、すべての視点が等しく有効と見なされる、意図せぬ何でもあり主義につながったと主張した。","type":"説明","meaning_category":"哲学"},{"sentence":"Critics of the new educational policy claimed it promoted anythingarianism by allowing students to choose their own curriculum without any guidance from teachers.","translation":"新しい教育政策の批評家たちは、教師からの指導なしに生徒が自分でカリキュラムを選択できるため、何でもあり主義を助長していると主張した。","type":"批判","meaning_category":"哲学"},{"sentence":"The artist's exhibition was seen by some as a celebration of anythingarianism, with its chaotic mix of styles and themes that seemed to defy any coherent interpretation.","translation":"そのアーティストの展覧会は、一貫した解釈を拒否するようなスタイルとテーマの混沌とした混合により、何でもあり主義の祭典として見られた。","type":"解釈","meaning_category":"哲学"}]}