{"word":"leptosome","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"やせ型の人、細身の人","english_definition":"A person with a slender, lean body build.","examples":[{"sentence":"The doctor noted the patient's leptosome physique.","translation":"医者は患者のやせ型の体格に注目した。"},{"sentence":"Leptosomes are often associated with ectomorphic body types.","translation":"やせ型の人はしばしば外胚葉型の体型と関連付けられる。"}],"collocations":["leptosome physique","leptosome build","ectomorphic leptosome"],"synonyms":["ectomorph","asthenic type","slender build"],"antonyms":["pyknic","endomorph","mesomorph"]}],"etymology":{"value":"Derived from the Greek words 'leptos' (λεπτός) meaning 'thin' or 'slender' and 'soma' (σῶμα) meaning 'body'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈlɛptəˌsoʊm/","syllables":"lep-to-some"},"inflection":{"noun_plural":"leptosomes"},"usage_notes":{"explanation":"The term 'leptosome' is primarily used in the context of somatotyping, a system for classifying body types. It refers to individuals with a predominantly linear and fragile build, characterized by long limbs, narrow chest, and minimal muscle mass. It's a relatively technical term, not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a leptosome of a man.","correct":"✓ He is a leptosome.","note":"'Leptosome' is a noun referring to a person, so it doesn't need 'of a man' after it."},{"incorrect":"✗ The leptosome body is very strong.","correct":"✓ The leptosome body is typically not very strong.","note":"Leptosomes are generally characterized by a lack of muscle mass and are therefore not typically associated with strength."}],"priority":"★★☆"},"related_words":{"derivatives":["leptosomatic (adjective)"],"related_terms":["somatotype","ectomorphy","asthenic"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. It's a technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Leptosome' is a specialized term used in the field of somatotyping, which is a system for classifying body types based on physical characteristics. It describes a person with a slender, lean build, often associated with the ectomorphic body type. Due to its technical nature, it is not a commonly used word in everyday language. Understanding the term requires familiarity with concepts in human anatomy and typology."},"example_sentences":[{"sentence":"The study focused on the health risks associated with the leptosome body type.","translation":"その研究は、やせ型の体型に関連する健康リスクに焦点を当てた。","type":"noun","meaning_category":"体型"},{"sentence":"He was identified as a leptosome based on his long limbs and narrow frame.","translation":"彼は、手足が長く、骨格が細いことから、やせ型であると判断された。","type":"noun","meaning_category":"体型"}]}