{"word":"archiepiscopate","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"大司教の職、大司教の任期、大司教管区","english_definition":"The office, term, or district of an archbishop.","examples":[{"sentence":"During his archiepiscopate, many reforms were initiated.","translation":"彼の大司教在任期間中、多くの改革が開始された。"},{"sentence":"The archiepiscopate includes several dioceses.","translation":"大司教管区にはいくつかの司教区が含まれている。"}],"collocations":["begin an archiepiscopate","end an archiepiscopate","within the archiepiscopate"],"synonyms":["archbishopric","see"],"antonyms":[]}],"etymology":{"value":"From \"archiepiscopal\" (pertaining to an archbishop) + \"-ate\" (suffix denoting office, rank, or territory).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɑːrtʃiːɪˈpɪskəpət/","syllables":"ar-chi-e-pis-co-pate"},"inflection":{"noun_plural":"archiepiscopates"},"usage_notes":{"explanation":"The term \"archiepiscopate\" is relatively formal and specific, primarily used in religious or historical contexts related to the governance and administration within the Christian church. It refers to the position, period of service, or geographical jurisdiction of an archbishop.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was the archiepiscopate of Canterbury.","correct":"✓ He was the archbishop of Canterbury.","note":"\"Archiepiscopate\" refers to the office or period, not the person holding it. Use \"archbishop\" to refer to the individual. "},{"incorrect":"✗ She visited the archiepiscopate.","correct":"✓ She visited the archiepiscopal see.","note":"If referring to the physical location or headquarters, use \"archiepiscopal see\" or \"archbishop's residence\" instead of just \"archiepiscopate.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["archiepiscopal (adjective: relating to an archbishop)","archbishop (noun: a chief bishop)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"archiepiscopate\" is a formal term used in religious contexts, specifically within certain Christian denominations. It refers to the office, the time period of service, or the geographical area governed by an archbishop. It's not a commonly used word in everyday conversation and is more likely to be encountered in historical texts, theological discussions, or news reports concerning church leadership. Understanding the word requires familiarity with religious hierarchies and terminology."},"example_sentences":[{"sentence":"The new archbishop assumed his archiepiscopate with a formal ceremony.","translation":"新しい大司教は正式な式典で大司教の職に就任した。","type":"noun","meaning_category":"大司教の職"},{"sentence":"During the long archiepiscopate of Cardinal Newman, the diocese flourished.","translation":"ニューマン枢機卿の長きにわたる大司教在任期間中、その教区は繁栄した。","type":"noun","meaning_category":"大司教の任期"},{"sentence":"The boundaries of the archiepiscopate were clearly defined in the treaty.","translation":"大司教管区の境界線は条約で明確に定められた。","type":"noun","meaning_category":"大司教管区"}]}