{"word":"Overliterarily","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"過度に文学的に、文学的すぎるほど","english_definition":"In an excessively literary manner; in a way that is too concerned with literary style or conventions.","examples":[{"sentence":"The passage was overliterarily written, making it difficult to understand.","translation":"その一節は過度に文学的に書かれており、理解するのが難しかった。"},{"sentence":"He spoke overliterarily, using elaborate metaphors that confused his audience.","translation":"彼は文学的すぎるほどに話し、聴衆を混乱させる手の込んだ比喩を使った。"}],"collocations":["overliterarily written","overliterarily expressed","overliterarily inclined"],"synonyms":["pedantically","didactically","bookishly","academically","pretentiously"],"antonyms":["simply","plainly","directly","concisely"]}],"etymology":{"value":"Formed by combining \"over-\" (excessively) with \"literarily\" (in a literary manner).","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərˈlɪtərəˌrɪli/","syllables":"o-ver-lit-er-ar-i-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"The adverb 'overliterarily' describes writing or speech that is excessively concerned with literary style, often to the point of being pretentious or difficult to understand. It suggests a focus on form over substance, where the language is more elaborate than necessary.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The author overliterarily his book.","correct":"The author wrote his book overliterarily.","note":"'Overliterarily' is an adverb and should modify a verb, not be used as a verb itself."}]},"related_words":{"derivatives":["literary","literarily","overliterary"],"related_terms":["pedantic","pretentious","bombastic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★★☆"},"readability_explanation":{"level":"C2","text":"'Overliterarily' is a rare and complex word used to describe something done in an excessively literary way, often implying pretentiousness or obscurity. It is not commonly used in everyday conversation and is more likely to be found in academic or critical writing."},"example_sentences":[{"sentence":"The novel was criticized for being overliterarily, with too much focus on stylistic flourishes and not enough on plot.","translation":"その小説は、文体の装飾に重点が置かれすぎて、プロットが疎かになっているとして、過度に文学的であると批判された。","type":"adverb","meaning_category":"excessively literary"}]}