{"word":"Teutonicism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ドイツ民族主義、ドイツ至上主義","english_definition":"German nationalism or the belief in the superiority of German culture or people.","examples":[{"sentence":"The rise of Teutonicism in the early 20th century led to increased tensions in Europe.","translation":"20世紀初頭におけるドイツ民族主義の高まりは、ヨーロッパにおける緊張の高まりにつながった。"},{"sentence":"Some critics argue that certain historical interpretations are influenced by Teutonicism.","translation":"一部の批評家は、特定の歴史解釈がドイツ民族主義の影響を受けていると主張している。"}],"collocations":["extreme Teutonicism (極端なドイツ民族主義)","historical Teutonicism (歴史的なドイツ民族主義)"],"synonyms":["Germanocentrism","Germanophilia","Pan-Germanism"],"antonyms":["Anti-Germanism"],"notes":"Often associated with historical and political contexts, particularly the period leading up to and during World War II."},{"part_of_speech":"noun","definition":"ドイツ語特有の表現、ドイツ語からの借用語","english_definition":"A linguistic feature or idiom peculiar to the German language; a borrowing from German.","examples":[{"sentence":"The sentence structure in his writing shows a clear Teutonicism.","translation":"彼の文章の文構造には、明らかなドイツ語特有の表現が見られる。"},{"sentence":"'Kindergarten' is a common Teutonicism in English.","translation":"「幼稚園」は英語における一般的なドイツ語からの借用語である。"}],"collocations":["linguistic Teutonicism (言語的なドイツ語特有の表現)","grammatical Teutonicism (文法的なドイツ語特有の表現)"],"synonyms":["Germanism","Germanicism"],"antonyms":[]}],"etymology":{"value":"From 'Teutonic' (relating to the ancient Teutons or the German people) + '-ism' (denoting a belief, principle, or practice).","priority":"★★☆"},"pronunciation":{"ipa":"/tjuːˈtɒnɪsɪzəm/","syllables":"Tu-ton-i-ci-sm"},"inflection":{"notes":"Plural: Teutonicisms"},"usage_notes":{"explanation":"'Teutonicism' can refer to either German nationalism or a linguistic feature borrowed from German. The specific meaning depends on the context. When discussing history or politics, it usually refers to German nationalism. In linguistic contexts, it refers to German loanwords or grammatical structures present in another language.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He expressed his Teutonicism by wearing lederhosen.","correct":"✓ He expressed his Teutonicism through his belief in German cultural superiority.","note":"Wearing traditional German clothing is not necessarily an expression of Teutonicism. The term refers to a belief in German superiority or nationalism."},{"incorrect":"✗ The word 'angst' is an example of Teutonicism in French.","correct":"✓ The word 'angst' is an example of Teutonicism in English.","note":"'Angst' is a German word borrowed into English, not French."}],"priority":"★★☆"},"related_words":{"derivatives":["Teutonic (adjective: relating to the ancient Teutons or the German people)","Teutonist (noun: a supporter of Teutonicism)"],"phrases":["Blood and Soil (Blut und Boden) - A key concept in Nazi Teutonicism, emphasizing the connection between race and land."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Teutonicism' is a term that can refer to two different concepts: German nationalism or a linguistic borrowing from German. In a historical or political context, it describes the belief in the superiority of German culture or people, often associated with the rise of nationalism in the 19th and 20th centuries. In a linguistic context, it refers to words, idioms, or grammatical structures in another language that are derived from German. The specific meaning is determined by the context in which it is used. It is important to understand both meanings to correctly interpret the term.","note":"This word has specialized usage and is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The ideology of Teutonicism played a significant role in shaping German foreign policy in the early 20th century.","translation":"ドイツ民族主義のイデオロギーは、20世紀初頭のドイツの外交政策を形成する上で重要な役割を果たした。","type":"noun","meaning_category":"German nationalism"},{"sentence":"The use of compound nouns is a common Teutonicism in the English language.","translation":"複合名詞の使用は、英語における一般的なドイツ語特有の表現である。","type":"noun","meaning_category":"Linguistic feature"}]}