{"word":"firecoat","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"耐火服、消防服","english_definition":"A protective coat worn by firefighters, designed to resist heat and flames.","examples":[{"sentence":"The firefighter donned his firecoat before entering the burning building.","translation":"消防士は燃えている建物に入る前に耐火服を着た。"},{"sentence":"The firecoat protected him from the intense heat of the flames.","translation":"耐火服は彼を炎の強烈な熱から守った。"}],"collocations":["wear a firecoat","put on a firecoat","protective firecoat","insulated firecoat"],"synonyms":["fire suit","fire proximity suit","turnout coat"],"antonyms":["None (as it is a specific protective garment)"]}],"etymology":{"value":"Combination of 'fire' and 'coat', indicating a coat designed for protection against fire.","priority":"★★★"},"pronunciation":{"ipa":"ˈfaɪərˌkoʊt","syllables":"fire-coat"},"inflection":{"noun_plural":"firecoats"},"usage_notes":{"explanation":"A firecoat is a specialized piece of personal protective equipment (PPE) used by firefighters. It is designed to provide thermal protection and resistance to flames, heat, and water. It is an essential part of a firefighter's gear.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a fire coat to the beach.","correct":"✓ He wore a regular coat to the beach.","note":"Firecoats are only for firefighting or hazardous situations involving extreme heat."}],"priority":"★★☆"},"related_words":{"derivatives":["fireproof","fire-resistant","fireman","firefighting"],"phrasal_verbs":["None (not typically used in phrasal verbs)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (specialized vocabulary)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"firecoat\" refers to a specialized protective garment worn by firefighters. It is designed to withstand high temperatures and flames, providing crucial protection in hazardous environments. Understanding this term requires familiarity with firefighting equipment and safety protocols."},"example_sentences":[{"sentence":"The new firecoat design incorporates advanced heat-resistant materials.","translation":"新しい耐火服のデザインは、高度な耐熱素材を取り入れている。","type":"noun","meaning_category":"耐火服"},{"sentence":"Regular inspection of the firecoat is essential for ensuring its protective capabilities.","translation":"耐火服の定期的な検査は、その保護能力を保証するために不可欠である。","type":"noun","meaning_category":"耐火服"}]}