{"word":"epanisognathism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"上顎と下顎の幅の不均衡、特に上顎が下顎よりも著しく狭い状態","english_definition":"A condition in which the maxilla (upper jaw) is significantly narrower than the mandible (lower jaw).","examples":[{"sentence":"Epanisognathism can lead to dental malocclusion and temporomandibular joint disorders.","translation":"上顎劣幅は、不正咬合や顎関節症を引き起こす可能性があります。"}],"collocations":["dental epanisognathism","severe epanisognathism","treat epanisognathism"],"synonyms":["maxillary deficiency","narrow maxilla"],"antonyms":["mandibular deficiency","prognathism"]}],"etymology":{"value":"ギリシャ語の要素から構成されています: \"epi-\" (上に), \"aniso-\" (不均等な), \"gnathos\" (顎), \"-ism\" (状態)。つまり、「顎の不均等な状態」を意味します。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌɛpænɪˌsɒɡˈnæθɪzəm/","syllables":"e-pan-i-sog-na-thism"},"inflection":{"noun_plural":"epanisognathisms"},"usage_notes":{"explanation":"\"Epanisognathism\"は、歯科矯正や口腔外科の分野で使用される専門用語です。一般的には、上顎の成長が不十分で、下顎との間に大きなサイズの差がある状態を指します。診断には、臨床検査や画像診断が用いられます。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has epanisognathism in the leg.","correct":"✓ The patient has epanisognathism in the jaw.","note":"Epanisognathismは顎の不均衡を指すため、体の他の部位には適用されません。"},{"incorrect":"✗ Epanisognathism is when the upper jaw is wider than the lower jaw.","correct":"✓ Epanisognathism is when the upper jaw is narrower than the lower jaw.","note":"Epanisognathismは上顎が下顎よりも狭い状態です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["epanisognathic (形容詞: 上顎劣幅の)"],"related_medical_terms":["malocclusion (不正咬合)","TMJ disorder (顎関節症)","orthodontics (歯科矯正学)","maxilla (上顎)","mandible (下顎)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な医学用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Epanisognathism\" is a highly specialized term used in dentistry and orthodontics to describe a specific type of jaw discrepancy. It refers to the condition where the upper jaw (maxilla) is significantly narrower than the lower jaw (mandible). Understanding this term requires a background in dental anatomy and terminology. It is not commonly used outside of professional medical contexts.","translation":"「Epanisognathism」は、歯科および矯正歯科で使用される非常に専門的な用語であり、特定の種類の顎の不一致を説明するために使用されます。 これは、上顎（上顎骨）が下顎（下顎骨）よりも著しく狭い状態を指します。 この用語を理解するには、歯科解剖学と用語の背景が必要です。 専門的な医療現場以外では一般的に使用されていません。"},"example_sentences":[{"sentence":"Treatment for epanisognathism often involves orthodontic appliances to expand the upper jaw.","translation":"上顎劣幅の治療には、上顎を拡大するための矯正装置が用いられることが多い。","type":"general"},{"sentence":"Severe epanisognathism may require surgical intervention to correct the jaw discrepancy.","translation":"重度の上顎劣幅は、顎の不均衡を矯正するために外科的介入が必要になることがある。","type":"clinical"},{"sentence":"The dentist diagnosed epanisognathism based on cephalometric analysis.","translation":"歯科医は頭部X線規格写真分析に基づいて上顎劣幅と診断した。","type":"diagnostic"}]}