{"word":"sub-constable","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にインド、パキスタン、バングラデシュなどの警察組織における)巡査補","english_definition":"A police officer of a rank below that of a constable, primarily used in police forces of India, Pakistan, Bangladesh, and other South Asian countries.","examples":[{"sentence":"The sub-constable was responsible for maintaining order in the local market.","translation":"その巡査補は地元の市場の秩序を維持する責任があった。"},{"sentence":"A complaint was filed against the sub-constable for alleged misconduct.","translation":"その巡査補に対し、不正行為の疑いで苦情が申し立てられた。"}],"collocations":["police sub-constable","appointed as sub-constable","sub-constable in charge"],"synonyms":["police officer","junior constable","deputy constable"],"antonyms":["superintendent","inspector"]},{"part_of_speech":"noun","definition":"(歴史的な用法)下級の治安維持官","english_definition":"(historical) A subordinate officer assisting a constable.","examples":[{"sentence":"In the 19th century, the sub-constable assisted the parish constable with his duties.","translation":"19世紀には、巡査補は教区の巡査の職務を補佐した。"}],"collocations":["parish sub-constable"],"synonyms":["assistant constable","deputy constable"],"antonyms":["chief constable"]}],"etymology":{"value":"The term is a combination of 'sub-' (meaning below or subordinate) and 'constable' (a police officer).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌbˌkɒnstəbəl/","syllables":"sub-con-sta-ble"},"inflection":{"noun_plural":"sub-constables"},"usage_notes":{"explanation":"The term 'sub-constable' is primarily used in the context of law enforcement in South Asian countries, particularly India, Pakistan, and Bangladesh. It refers to a specific rank within the police hierarchy, typically below that of a constable but above that of a head constable or other lower ranks. Outside of these regions, the term is less common and may not be recognized. In historical contexts, it referred to an assistant to a constable.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a sub-constable of the army.","correct":"✓ He is a sub-constable in the police force.","note":"Sub-constables are part of the police force, not the army."},{"incorrect":"✗ Sub-constable is the highest rank in the police.","correct":"✓ Sub-constable is a lower rank in the police.","note":"Sub-constable is a junior rank, not the highest."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["constable","police","law enforcement","inspector","superintendent"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specific to certain regions)","frequency_google_ngram":"Low frequency (primarily in South Asian contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sub-constable' refers to a specific rank in the police force, primarily in South Asian countries like India, Pakistan, and Bangladesh. It is a rank below 'constable' and denotes a junior officer responsible for maintaining law and order at a local level. The term is not commonly used in Western countries, where equivalent ranks may have different names. Understanding the term requires knowledge of the specific police structures in these regions."},"example_sentences":[{"sentence":"The newly appointed sub-constable reported for duty at the local police station.","translation":"新しく任命された巡査補は、地元の警察署に勤務報告をした。","type":"noun","meaning_category":"巡査補"},{"sentence":"The sub-constable patrolled the area to prevent petty crimes.","translation":"その巡査補は、軽犯罪を防ぐために地域を巡回した。","type":"noun","meaning_category":"巡査補"}]}