{"word":"agentship","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"代理店業務、代理権、代理店の地位","english_definition":"The position or function of an agent; the state of being an agent; the authority to act for another.","examples":[{"sentence":"He secured the agentship for a major car manufacturer.","translation":"彼は大手自動車メーカーの代理権を獲得した。"},{"sentence":"The company is seeking an agentship to expand its market reach.","translation":"その会社は市場範囲を拡大するために代理店業務を探している。"},{"sentence":"The agentship agreement outlines the responsibilities of both parties.","translation":"代理店契約には、両当事者の責任が明記されている。"}],"collocations":["secure an agentship (代理権を獲得する)","hold an agentship (代理権を保持する)","agentship agreement (代理店契約)","exclusive agentship (独占代理権)","sole agentship (単独代理権)"],"synonyms":["agency","representation","deputyship","mandate","brokerage"],"antonyms":["principalship (本人であること)","directorship (直接経営)"]},{"part_of_speech":"noun","definition":"代理店、特約店","english_definition":"A business or organization acting as an agent for another.","examples":[{"sentence":"Our agentship handles sales and distribution for several foreign companies.","translation":"当社の代理店は、いくつかの外国企業の販売と流通を扱っています。"},{"sentence":"The agentship is responsible for marketing the product in this region.","translation":"その代理店は、この地域での製品のマーケティングを担当しています。"}],"collocations":["local agentship (地元の代理店)","regional agentship (地方の代理店)","foreign agentship (海外の代理店)","sales agentship (販売代理店)"],"synonyms":["agency","dealership","franchise","distributorship"],"antonyms":["head office (本社)","branch office (支店)"]}],"etymology":{"value":"'Agent' + '-ship'. The suffix '-ship' denotes a state, condition, office, or function. Thus, 'agentship' signifies the state or function of being an agent.","priority":"★★★"},"pronunciation":{"ipa":"/ˈeɪdʒəntʃɪp/","syllables":"a-gent-ship"},"inflection":{"noun_plural":"agentships"},"usage_notes":{"explanation":"'Agentship' refers to both the role/authority of an agent and the business entity acting as an agent. It often implies a formal agreement or contract defining the scope and responsibilities of the agent. The term is commonly used in business and legal contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a good agency.","correct":"✓ He has a good agentship.","note":"'Agency' is a more general term, while 'agentship' specifically refers to the role or position of being an agent, or the business acting as an agent. 'Agentship' is more appropriate when referring to a formal arrangement or contract."},{"incorrect":"✗ The agentship's responsibilities are to sell the product.","correct":"✓ The agentship's responsibility is to sell the product.","note":"'Responsibility' is singular in this context, as it refers to the overall duty of the agentship."}],"priority":"★★☆"},"related_words":{"derivatives":["agent","agency","agentive"],"phrasal_verbs":[],"related_concepts":["representation","distribution","marketing","sales","contract","agreement"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Agentship' is a formal term used in business and legal contexts to describe the role, function, or position of an agent, or the business entity acting as an agent. It implies a formal agreement or contract defining the scope and responsibilities of the agent. This term is less common in everyday conversation and more likely to be found in professional or legal documents."},"example_sentences":[{"sentence":"The company offered him the agentship for the entire European market.","translation":"会社は彼にヨーロッパ市場全体の代理権を提供した。","type":"noun","meaning_category":"代理権"},{"sentence":"Our agentship specializes in importing and distributing high-end electronics.","translation":"当社の代理店は、高級電子機器の輸入と販売を専門としています。","type":"noun","meaning_category":"代理店"},{"sentence":"The agentship agreement specified the commission rate for each sale.","translation":"代理店契約では、各販売に対する手数料率が明記されていた。","type":"noun","meaning_category":"代理店業務"}]}