{"word":"arraignments","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法)罪状認否手続き、起訴状朗読手続き","english_definition":"The act of bringing a defendant before a court to answer a criminal charge; the formal reading of a criminal charging document in the presence of the defendant, to inform the defendant of the charges against them and to allow the defendant to enter a plea.","examples":[{"sentence":"The arraignments are scheduled for next week.","translation":"罪状認否手続きは来週予定されています。"},{"sentence":"He attended the arraignments of his alleged accomplices.","translation":"彼は、共犯者とされている人たちの罪状認否手続きに出席しました。"},{"sentence":"At the arraignments, the defendant pleaded not guilty.","translation":"罪状認否手続きで、被告は無罪を主張しました."}],"collocations":["initial arraignments (最初の罪状認否手続き)","arraignments hearing (罪状認否公判)","attend arraignments (罪状認否手続きに出席する)","during arraignments (罪状認否手続きの間)"],"synonyms":["indictment","charge","prosecution","trial"],"antonyms":["acquittal","dismissal"]}],"etymology":{"value":"Derived from the Middle English word 'arainen,' meaning 'to call to account,' which comes from the Old French word 'araisnier,' meaning 'to reason with, to speak to.'","priority":"★★☆"},"pronunciation":{"ipa":"/əˈreɪnmənts/","syllables":"ar-raign-ments"},"inflection":{"noun_plural":"arraignments"},"usage_notes":{"explanation":"'Arraignments' refers specifically to a legal procedure. It is not used in everyday conversation. It is a formal legal term. It is the plural form of 'arraignment'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The arraignments was held yesterday.","correct":"✓ The arraignments were held yesterday.","note":"'Arraignments' is a plural noun, so it requires a plural verb ('were')."},{"incorrect":"✗ He went to the arraignment. (when referring to multiple proceedings)","correct":"✓ He went to the arraignments. (when referring to multiple proceedings)","note":"If referring to multiple instances of the procedure, use the plural form."}],"priority":"★★☆"},"related_words":{"derivatives":["arraign (verb: to bring someone before a court to face charges)"],"phrasal_verbs":[],"legal_terms":["indictment","plea","defendant","prosecutor","court"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Arraignments' is a legal term referring to a formal court procedure where a defendant is informed of the charges against them and asked to enter a plea. It's generally used in legal and journalistic contexts when discussing criminal proceedings. Understanding this word is important for comprehending legal news and documents.","priority":"★★☆"},"example_sentences":[{"sentence":"The suspect's arraignments are scheduled for Monday morning.","translation":"容疑者の罪状認否手続きは月曜日の朝に予定されています。","type":"noun","meaning_category":"Legal Procedure"},{"sentence":"Several defendants had their arraignments postponed due to the court's backlog.","translation":"裁判所の未処理事件が多いため、数人の被告の罪状認否手続きが延期されました。","type":"noun","meaning_category":"Legal Procedure"},{"sentence":"The arraignments took place in a packed courtroom.","translation":"罪状認否手続きは満員の法廷で行われました。","type":"noun","meaning_category":"Legal Procedure"}]}