{"word":"community-specific","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"特定のコミュニティに特有の、コミュニティに固有の","english_definition":"Relating to or characteristic of a particular community.","examples":[{"sentence":"The organization provides community-specific programs tailored to the needs of local residents.","translation":"その組織は、地域住民のニーズに合わせた、地域固有のプログラムを提供しています。"},{"sentence":"Community-specific knowledge is essential for effective local governance.","translation":"効果的な地域統治には、地域固有の知識が不可欠です。"},{"sentence":"The project aims to address community-specific issues related to environmental sustainability.","translation":"そのプロジェクトは、環境の持続可能性に関連する地域固有の問題に取り組むことを目的としています。"}],"collocations":["community-specific needs","community-specific resources","community-specific programs","community-specific knowledge","community-specific solutions","community-specific challenges"],"synonyms":["localized","regional","local","area-specific","place-based"],"antonyms":["general","universal","global","widespread"]}],"etymology":{"value":"Formed by combining 'community' and 'specific', indicating something that is particular to a certain community.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˌmjuːnɪti spəˈsɪfɪk/","syllables":"com-mu-ni-ty spe-cif-ic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'community-specific' emphasizes that something is designed for, relevant to, or originating from a particular community. It highlights the importance of considering the unique characteristics and needs of a specific group of people living in a particular area or sharing common interests.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is specific to all communities.","correct":"✓ The program is community-specific, tailored to each community's needs.","note":"The term implies a focus on a particular community, not all communities."}],"priority":"★★☆"},"related_words":{"derivatives":["community","specific","specificity"],"phrases":["community-based","community involvement","community development"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but used in academic and professional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'community-specific' is used to describe something that is designed for or related to a particular community. It implies that the thing being described is not general or universal, but rather tailored to the unique characteristics and needs of a specific group of people. This term is often used in fields such as social work, public health, and urban planning."},"example_sentences":[{"sentence":"The survey collected community-specific data on health behaviors.","translation":"その調査では、健康行動に関する地域固有のデータが収集されました。","type":"adjective","meaning_category":"relating to a particular community"},{"sentence":"The training program was designed to address community-specific challenges.","translation":"その研修プログラムは、地域固有の課題に対処するように設計されました。","type":"adjective","meaning_category":"relating to a particular community"},{"sentence":"We need community-specific strategies to promote sustainable agriculture.","translation":"持続可能な農業を促進するためには、地域固有の戦略が必要です。","type":"adjective","meaning_category":"relating to a particular community"}]}