{"word":"millipede","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ヤスデ","english_definition":"A myriapod invertebrate of the class Diplopoda, having a cylindrical body composed of numerous segments, each bearing two pairs of legs.","examples":[{"sentence":"Millipedes are often found in damp places.","translation":"ヤスデは湿った場所にいることが多い。"},{"sentence":"The millipede crawled slowly across the forest floor.","translation":"ヤスデはゆっくりと森の地面を這っていた。"}],"collocations":["garden millipede","black millipede","giant African millipede"],"synonyms":["myriapod"],"antonyms":[]}],"etymology":{"value":"From Latin 'mille' (thousand) + 'pes, pedis' (foot), though millipedes do not actually have a thousand legs.","priority":"★★☆"},"pronunciation":{"ipa":"ˈmɪlɪpiːd","syllables":"mil-li-pede"},"inflection":{"noun_plural":"millipedes"},"usage_notes":{"explanation":"Millipedes are often confused with centipedes, but millipedes have two pairs of legs per segment, while centipedes have only one pair. Millipedes are generally detritivores, feeding on decaying plant matter, while centipedes are predators.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a centipede with many legs, it must be a millipede.","correct":"✓ I saw a creature with many legs, it might be a millipede or a centipede.","note":"Millipedes and centipedes are easily confused. Check for two pairs of legs per segment to identify a millipede."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'millipede' refers to a specific type of invertebrate. Understanding the difference between millipedes and centipedes requires some biological knowledge. The word itself is not commonly used in everyday conversation but is more likely to appear in scientific or nature-related contexts."},"example_sentences":[{"sentence":"The gardener found a **millipede** under a rock.","translation":"庭師は岩の下でヤスデを見つけた。","type":"noun","meaning_category":"animal"},{"sentence":"Some **millipedes** secrete a defensive fluid when threatened.","translation":"脅かされると防御液を分泌するヤスデもいる。","type":"noun","meaning_category":"animal behavior"}]}