{"word":"viricidal","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"殺ウイルス性の、ウイルスを不活性化する","english_definition":"Capable of destroying or inactivating viruses.","examples":[{"sentence":"The disinfectant has viricidal properties.","translation":"その消毒剤は殺ウイルス性を持つ。"},{"sentence":"We need a viricidal agent to combat the spread of the virus.","translation":"ウイルスの蔓延を防ぐために、殺ウイルス剤が必要だ。"}],"collocations":["viricidal agent (殺ウイルス剤)","viricidal activity (殺ウイルス活性)","viricidal effect (殺ウイルス効果)","viricidal disinfectant (殺ウイルス消毒剤)"],"synonyms":["antiviral","germicidal","disinfectant"],"antonyms":["viristatic"],"notes":"Viricidal agents kill viruses, whereas viristatic agents only inhibit their replication."}],"etymology":{"value":"Formed from 'virus' + '-cidal' (killing). '-cidal' comes from Latin '-cida' (killer), from caedere (to kill).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvaɪrɪˈsaɪdl/","syllables":"vi-ri-ci-dal"},"inflection":{"notes":"Does not inflect; it is an adjective."},"usage_notes":{"explanation":"'Viricidal' describes substances or processes that are able to destroy or inactivate viruses, rendering them non-infectious. It's commonly used in the context of disinfectants, cleaning products, and medical treatments. It is important to distinguish from 'viristatic', which only inhibits viral replication without necessarily killing the virus.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The medicine is viristatic, so it will kill the virus.","correct":"✓ The medicine is viricidal, so it will kill the virus.","note":"Viristatic agents only inhibit viral replication, while viricidal agents kill the virus."}],"priority":"★★☆"},"related_words":{"derivatives":["viricide (noun): a substance that kills viruses.","bactericidal (adjective): capable of killing bacteria.","fungicidal (adjective): capable of killing fungi."],"related_terms":["antiviral (adjective): acting against viruses.","disinfectant (noun): a chemical liquid that destroys bacteria.","sterilization (noun): the process of making something free from bacteria or other living microorganisms."],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. Used primarily in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Viricidal' is a technical term used to describe something that can kill viruses. It is often found in scientific, medical, or public health contexts. Understanding this word is important for comprehending information about disinfection and disease control. It's more specialized than 'antiviral', which simply means 'acting against viruses' without necessarily killing them."},"example_sentences":[{"sentence":"The hospital uses a viricidal cleaner to prevent the spread of infections.","translation":"その病院は感染拡大を防ぐために殺ウイルス性の洗剤を使用している。","type":"general","meaning_category":"general"},{"sentence":"Testing confirmed the product's viricidal efficacy against several strains of the influenza virus.","translation":"試験により、その製品がいくつかのインフルエンザウイルス株に対して殺ウイルス効果があることが確認された。","type":"scientific","meaning_category":"scientific"},{"sentence":"Proper handwashing with soap and water can have a viricidal effect.","translation":"石鹸と水で適切に手を洗うことは、殺ウイルス効果がある。","type":"public health","meaning_category":"public health"}]}