{"word":"anti-Judaistic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"反ユダヤ教的な","english_definition":"Opposed to or hostile toward the religion, practices, or teachings of Judaism.","examples":[{"sentence":"Some scholars argue that certain passages in the New Testament are anti-Judaistic.","translation":"一部の学者は、新約聖書の特定の箇所が反ユダヤ教的であると主張している。"},{"sentence":"The rhetoric used by the group was considered anti-Judaistic because it attacked core Jewish beliefs.","translation":"その団体が用いたレトリックは、ユダヤ教の中核的な信仰を攻撃しているため、反ユダヤ教的であると見なされた。"}],"collocations":["anti-Judaistic sentiment","anti-Judaistic rhetoric","anti-Judaistic interpretation"],"synonyms":["anti-Jewish (often used more broadly)","opposed to Judaism","hostile to Judaism"],"antonyms":["pro-Judaistic","Judeophilic"],"related_terms":["anti-Semitism (more general term for hostility to Jews)","Judaism","Jew","religious discrimination"]}],"etymology":{"value":"Formed from \"anti-\" (against) + \"Judaistic\" (relating to Judaism).","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˌdʒuːdeɪˈɪstɪk/","syllables":"an-ti-Ju-da-is-tic"},"inflection":{},"usage_notes":{"explanation":"\"Anti-Judaistic\" specifically refers to opposition to the religion of Judaism, its practices, and teachings. It is distinct from \"anti-Semitic,\" which is a broader term encompassing prejudice, discrimination, or hostility towards Jewish people as an ethnic or racial group, regardless of their religious beliefs or practices. While the terms can overlap, \"anti-Judaistic\" is more precise when referring to theological or religious opposition to Judaism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The policy was anti-Judaistic because it targeted all Jewish people.","correct":"✓ The policy was anti-Semitic because it targeted all Jewish people.","note":"If the policy targets Jewish people as a group, regardless of their religious beliefs, \"anti-Semitic\" is more appropriate. \"Anti-Judaistic\" is better used when the policy specifically targets Jewish religious practices or beliefs."}],"priority":"★★☆"},"related_words":{"derivatives":["anti-Judaism (opposition to Judaism)"],"related_terms":["Judaism","Jew","anti-Semitism","religious discrimination","religious intolerance"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"anti-Judaistic\" is a formal and specific term used to describe opposition to the religion of Judaism. It's important to understand that this term is distinct from \"anti-Semitic,\" which refers to prejudice or discrimination against Jewish people more broadly. \"Anti-Judaistic\" is used when the opposition is specifically directed at the religious beliefs, practices, or teachings of Judaism. This term is more commonly found in academic or scholarly discussions about religion, history, and interfaith relations."},"example_sentences":[{"sentence":"The article presented an anti-Judaistic interpretation of the Hebrew Bible.","translation":"その記事は、ヘブライ聖書に対する反ユダヤ教的な解釈を示していた。","type":"general","meaning_category":"Opposition to Judaism"},{"sentence":"Some early Christian writings contain what are now considered anti-Judaistic sentiments.","translation":"初期キリスト教の著作の中には、現在では反ユダヤ教的な感情とみなされるものが含まれている。","type":"historical","meaning_category":"Historical Context"},{"sentence":"The speaker's comments were criticized for being anti-Judaistic and promoting religious intolerance.","translation":"講演者の発言は、反ユダヤ教的であり、宗教的不寛容を助長しているとして批判された。","type":"contemporary","meaning_category":"Contemporary Issues"}]}