{"word":"Spacewalkers","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"宇宙遊泳者たち、宇宙空間を歩く人たち","english_definition":"plural of spacewalker: astronauts who perform activities outside a spacecraft in outer space.","examples":[{"sentence":"The Spacewalkers completed the repairs on the Hubble telescope.","translation":"宇宙遊泳者たちはハッブル望遠鏡の修理を完了した。"},{"sentence":"Spacewalkers face many dangers when working outside the International Space Station.","translation":"宇宙遊泳者たちは国際宇宙ステーションの外で作業するとき、多くの危険に直面する。"}],"collocations":["perform a spacewalk","work as spacewalkers","a team of spacewalkers"],"synonyms":["astronauts","cosmonauts","extravehicular activity specialists"],"antonyms":[]}],"etymology":{"value":"'Spacewalker' is a compound word formed by combining 'space' and 'walker.' It refers to individuals who walk or perform activities in outer space during a spacewalk (extravehicular activity).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspeɪsˌwɔːkərz/","syllables":"space-walk-ers"},"inflection":{"noun_plural":"Spacewalkers"},"usage_notes":{"explanation":"'Spacewalkers' is the plural form of 'spacewalker,' referring to multiple astronauts or cosmonauts engaged in extravehicular activities (EVAs) outside a spacecraft. The term emphasizes the activity of walking or moving in space, even though they are often tethered or using maneuvering units.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The spacewalkers was working on the satellite.","correct":"✓ The spacewalkers were working on the satellite.","note":"'Spacewalkers' is a plural noun, so it requires the plural verb 'were'."},{"incorrect":"✗ Spacewalkers is a dangerous job.","correct":"✓ Spacewalking is a dangerous job.","note":"When referring to the activity in general, use 'spacewalking' (gerund/noun) instead of the plural noun 'spacewalkers'."}],"priority":"★★☆"},"related_words":{"derivatives":["spacewalk (noun: extravehicular activity)","spacewalking (noun: the act of performing a spacewalk)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing with space exploration advancements.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'Spacewalkers' is a relatively straightforward term for astronauts who perform tasks outside of a spacecraft. It combines the words 'space' and 'walkers' to describe individuals who move and work in the vacuum of space. While the concept is not overly complex, understanding the context of space exploration and extravehicular activities (EVAs) is helpful. The term is commonly used in news reports and documentaries about space missions.","priority":"★★★"},"example_sentences":[{"sentence":"The team of Spacewalkers successfully installed the new solar panels.","translation":"宇宙遊泳者のチームは新しいソーラーパネルの設置に成功した。","type":"noun","meaning_category":"宇宙遊泳者たち"},{"sentence":"Spacewalkers often undergo extensive training to prepare for the harsh conditions of outer space.","translation":"宇宙遊泳者たちは宇宙の過酷な環境に備えるために、しばしば広範囲にわたる訓練を受ける。","type":"noun","meaning_category":"宇宙遊泳者たち"},{"sentence":"The Spacewalkers' mission was crucial for the continued operation of the space station.","translation":"宇宙遊泳者たちのミッションは宇宙ステーションの継続的な運用にとって非常に重要だった。","type":"noun","meaning_category":"宇宙遊泳者たち"}]}