{"word":"script-focused","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"台本に重点を置いた、脚本中心の","english_definition":"Emphasizing or prioritizing the script or screenplay in a creative work, such as a film, play, or television show.","examples":[{"sentence":"The director took a script-focused approach, ensuring every line of dialogue was delivered perfectly.","translation":"監督は脚本中心のアプローチを取り、すべてのセリフが完璧に伝えられるように徹底した。"},{"sentence":"The course is script-focused, teaching students how to write compelling screenplays.","translation":"この講座は脚本中心で、学生に魅力的な脚本の書き方を教える。"},{"sentence":"Unlike some improvisational theater groups, this one is very script-focused.","translation":"即興劇団もあるが、この劇団は非常に脚本中心だ。"}],"collocations":["script-focused approach","script-focused course","script-focused production","script-focused analysis"],"synonyms":["screenplay-driven","dialogue-heavy","plot-oriented"],"antonyms":["improvisational","character-driven","visually-oriented"]}],"etymology":{"value":"A compound word formed by combining 'script' (referring to a screenplay or written text for a performance) and 'focused' (meaning having a central point of attention or emphasis).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskrɪpt ˌfoʊkəst/","syllables":"script-fo-cused"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Script-focused' is used to describe creative projects or educational programs where the written script is considered the most important element. It suggests a strong emphasis on dialogue, plot structure, and adherence to the written word. This contrasts with approaches that prioritize improvisation, visual elements, or character development over the script.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was script focused.","correct":"✓ The movie was script-focused.","note":"Hyphenate the compound adjective 'script-focused' when it precedes the noun it modifies."},{"incorrect":"✗ The play is focus on the script.","correct":"✓ The play is focused on the script.","note":"Use the correct past participle form 'focused' instead of 'focus'."}],"priority":"★★☆"},"related_words":{"derivatives":["scriptwriter","screenwriter","screenplay","scripted"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Script-focused' is a term used in the context of film, theater, and creative writing. It means that the script or screenplay is the most important part of the project. If something is 'script-focused,' it means that a lot of attention is paid to the words and story written in the script. This is different from projects where the actors make up their own lines or where the visual style is more important than the story."},"example_sentences":[{"sentence":"The film school's curriculum is highly script-focused, with an emphasis on writing strong narratives.","translation":"その映画学校のカリキュラムは非常に脚本中心で、強力な物語を書くことに重点を置いている。","type":"general","meaning_category":"general"},{"sentence":"The actors appreciated the script-focused rehearsals, which allowed them to fully understand their characters' motivations.","translation":"俳優たちは脚本中心のリハーサルを高く評価し、それによってキャラクターの動機を完全に理解することができた。","type":"general","meaning_category":"general"}]}