{"word":"Anteport","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築)前門、前庭、前廊","english_definition":"An outer gate or door; a vestibule or outer porch.","examples":[{"sentence":"The anteport provided an extra layer of security for the castle.","translation":"前門は城にさらなるセキュリティを提供した。"},{"sentence":"Guests waited in the anteport before being admitted to the main hall.","translation":"客はメインホールに通される前に前庭で待った。"}],"collocations":["castle anteport (城の前門)","mansion anteport (邸宅の前庭)"],"synonyms":["vestibule","porch","outer gate","entrance hall"],"antonyms":["rear exit","back door"]}],"etymology":{"value":"From Latin 'ante' (before) and 'porta' (gate or door).","priority":"★★★"},"pronunciation":{"ipa":"/ˈæntiˌpɔːrt/","syllables":"An-te-port"},"inflection":{"noun_plural":"Anteports"},"usage_notes":{"explanation":"'Anteport' is a relatively uncommon architectural term referring to an outer entrance area, such as a gate, door, or porch, that precedes the main entrance. It is often associated with historical buildings like castles or large estates.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The anteport was filled with furniture.","correct":"✓ The anteport was a small, open area.","note":"Anteports are typically open areas, not rooms for furniture. A vestibule might contain furniture, but an anteport is more of an entranceway."}],"priority":"★☆☆"},"related_words":{"derivatives":["anteportal (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'anteport' is a specialized architectural term, not commonly used in everyday language. It refers to an outer entrance or gate that precedes the main entrance of a building, often found in historical contexts such as castles or large estates. Understanding this term requires a familiarity with architectural vocabulary."},"example_sentences":[{"sentence":"The defensive structure included a fortified anteport to repel invaders.","translation":"その防御構造には、侵略者を撃退するための要塞化された前門が含まれていた。","type":"noun","meaning_category":"前門"},{"sentence":"The grand mansion featured a spacious anteport where visitors could alight from their carriages.","translation":"その壮大な邸宅には、訪問者が馬車から降りることができる広々とした前庭があった。","type":"noun","meaning_category":"前庭"}]}