{"word":"Eupatory","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A plant of the genus Eupatorium, typically having heads of white or purple flowers.","english_definition":"A plant of the genus Eupatorium, typically having heads of white or purple flowers.","examples":[{"sentence":"The garden was filled with various types of Eupatory, attracting many butterflies.","translation":"庭は様々な種類のユーパトリウムでいっぱいになり、多くの蝶を引き寄せていました。"}],"collocations":["Eupatorium cannabinum","Eupatorium perfoliatum"],"synonyms":["boneset","thoroughwort"],"antonyms":[]}],"etymology":{"value":"From the genus name Eupatorium, which is named after Mithridates VI Eupator, a king of Pontus, who supposedly used a species of this plant medicinally.","priority":"Medium"},"pronunciation":{"ipa":"/juːˈpætəri/","syllables":"Eu-pa-to-ry"},"inflection":{"noun_plural":"Eupatories"},"usage_notes":{"explanation":"The term \"Eupatory\" typically refers to plants within the genus Eupatorium, known for their medicinal uses and attractive flowers. It's important to specify the species when discussing particular properties or characteristics.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Eupatoriums in the field.","correct":"✓ I saw some Eupatorium in the field.","note":"Since 'Eupatorium' can refer to the genus, it's often used in the singular to describe plants of that genus collectively. If referring to multiple individual plants, use 'Eupatories' or rephrase."}],"priority":"Low"},"related_words":{"derivatives":["Eupatorium (genus)","Eupatoriinae (subtribe)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"NA","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Eupatory' is a botanical term referring to plants of the genus Eupatorium. These plants are known for their clusters of white or purple flowers and historical medicinal uses. The term is primarily encountered in botanical contexts or discussions of herbal medicine."},"example_sentences":[{"sentence":"The herbalist recommended Eupatory for its traditional use in treating fevers.","translation":"その薬草医は、ユーパトリウムが伝統的に熱の治療に使われてきたことから、それを勧めた。","type":"noun","meaning_category":"Medicinal Plant"},{"sentence":"Butterflies are often attracted to the nectar-rich flowers of the Eupatory.","translation":"蝶はしばしば、蜜が豊富なユーパトリウムの花に引き寄せられる。","type":"noun","meaning_category":"Plant Attracting Insects"}]}