{"word":"Co-optation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(権力構造への)取り込み、抱き込み","english_definition":"The process of assimilating or taking something into a larger or established group.","examples":[{"sentence":"The government used co-optation to neutralize opposition groups.","translation":"政府は反対勢力を中立化するために抱き込みを利用した。"},{"sentence":"The company's co-optation of the activist's ideas helped improve their public image.","translation":"会社が活動家のアイデアを取り込んだことで、世間からのイメージ向上に繋がった。"}],"collocations":["political co-optation","cultural co-optation","corporate co-optation"],"synonyms":["assimilation","integration","incorporation","appropriation"],"antonyms":["alienation","marginalization","exclusion"]},{"part_of_speech":"noun","definition":"(委員会などへの)補充選任","english_definition":"The act of adding members to a committee or other body by the choice of the existing members.","examples":[{"sentence":"The committee decided on co-optation to fill the vacant position.","translation":"委員会は欠員を補充するために補充選任を決定した。"},{"sentence":"Co-optation is often used to bring in individuals with specific expertise.","translation":"補充選任は特定の専門知識を持つ人材を招き入れるためによく用いられる。"}],"collocations":["committee co-optation","board co-optation"],"synonyms":["selection","appointment","election","nomination"],"antonyms":["removal","dismissal"]}],"etymology":{"value":"Derived from 'co-opt', which comes from the Latin 'co-optare', meaning 'to choose together, elect'.","priority":"★★☆"},"pronunciation":{"ipa":"/koʊˌɒpˈteɪʃən/","syllables":"co-op-ta-tion"},"inflection":{"noun_plural":"co-optations"},"usage_notes":{"explanation":"'Co-optation' refers to two main concepts: 1) the process of incorporating or assimilating elements (like ideas or people) into a larger group, often to neutralize opposition or gain legitimacy; and 2) the act of adding new members to a group (like a committee) by the existing members. The first sense often carries a negative connotation, implying manipulation or strategic absorption, while the second sense is more neutral, referring to a method of selection.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The co-optation of the culture was offensive.","correct":"✓ The cultural appropriation was offensive.","note":"'Co-optation' refers to the act of incorporating into a group or system. If you mean taking something from a culture without permission or respect, use 'appropriation' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["co-opt (verb)","co-opted (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Co-optation' is a term used in political science, sociology, and business to describe the process of incorporating individuals or groups into a system, often to neutralize opposition or gain legitimacy. It can also refer to the act of adding members to a committee by the existing members. Understanding the context is crucial to interpreting its meaning correctly, as it can imply either strategic manipulation or a simple method of selection."},"example_sentences":[{"sentence":"The regime used co-optation to bring dissidents into the government, thereby weakening the opposition.","translation":"政権は反体制派を政府に取り込むことで、反対勢力を弱体化させるために抱き込みを利用した。","type":"noun","meaning_category":"取り込み (権力構造)"},{"sentence":"The board decided to use co-optation to fill the vacancy left by the retiring director.","translation":"取締役会は退任した取締役の後任を補充選任で埋めることを決定した。","type":"noun","meaning_category":"補充選任"}]}