{"word":"grammar-dependent","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"文法に依存する、文法によって決まる","english_definition":"Relies on or is determined by grammatical rules or structures.","examples":[{"sentence":"The meaning of this sentence is grammar-dependent.","translation":"この文の意味は文法に依存する。"},{"sentence":"Some programming languages are more grammar-dependent than others.","translation":"一部のプログラミング言語は、他の言語よりも文法への依存度が高い。"},{"sentence":"The correct interpretation of the phrase is grammar-dependent and requires careful analysis.","translation":"その句の正しい解釈は文法に依存しており、注意深い分析が必要です。"}],"collocations":["grammar-dependent analysis","grammar-dependent language","grammar-dependent structure","grammar-dependent interpretation"],"synonyms":["syntax-sensitive","syntax-dependent","grammar-sensitive","structure-dependent"],"antonyms":["grammar-independent","grammar-free","context-dependent"]}],"etymology":{"value":"Derived from 'grammar' (the system and structure of a language) and 'dependent' (relying on or determined by something else).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡræmər dɪˈpɛndənt/","syllables":"gram-mar-di-pen-dent"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with this word."},"usage_notes":{"explanation":"'Grammar-dependent' is used to describe something whose meaning or function is determined by the grammatical rules of a language. It is often used in linguistics, computer science (especially in the context of programming languages and parsing), and education.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The software is grammar dependent.","correct":"✓ The software is grammar-dependent.","note":"Hyphenate the compound adjective for clarity."},{"incorrect":"✗ Grammar dependance is high in this language.","correct":"✓ Grammar dependence is high in this language.","note":"The correct noun form is 'dependence,' not 'dependance'."}],"priority":"★★☆"},"related_words":{"derivatives":["grammar","dependence","dependent"],"related_terms":["context-free grammar","parsing","syntax","semantics","lexical analysis"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Technical term used in specific fields.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Grammar-dependent' is a technical term primarily used in linguistics and computer science. It describes something that relies on the rules of grammar for its meaning or function. Understanding this term requires familiarity with grammatical concepts and potentially some background in formal language theory or computational linguistics."},"example_sentences":[{"sentence":"The ambiguity of the sentence arises because its interpretation is grammar-dependent.","translation":"その文の曖昧さは、その解釈が文法に依存するために生じる。","type":"general","meaning_category":"General Use"},{"sentence":"Compiler design often involves creating grammar-dependent parsers.","translation":"コンパイラの設計には、文法に依存するパーサーの作成がよく含まれる。","type":"technical","meaning_category":"Computer Science"},{"sentence":"The effectiveness of the teaching method relies on a grammar-dependent approach to language learning.","translation":"その教育方法の有効性は、文法に依存した言語学習へのアプローチに依存する。","type":"educational","meaning_category":"Education"}]}