{"word":"tribuneship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ローマの)護民官の職、護民官の地位","english_definition":"The office or position of a tribune, especially in ancient Rome.","examples":[{"sentence":"He sought the tribuneship to advance his political career.","translation":"彼は政治的なキャリアを向上させるために護民官の職を求めた。"},{"sentence":"The tribuneship was a powerful position in the Roman Republic.","translation":"護民官の職はローマ共和国において強力な地位だった。"}],"collocations":["seek the tribuneship (護民官の職を求める)","hold the tribuneship (護民官の職を持つ)","resign from the tribuneship (護民官の職を辞任する)"],"synonyms":["tribunate","tribune's office","tribune's position"],"antonyms":[]}],"etymology":{"value":"From 'tribune' (護民官) + '-ship' (状態、地位を示す接尾辞). The word 'tribune' comes from Latin 'tribunus', referring to an official representing a tribe or group of citizens.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrɪbjuːnʃɪp/","syllables":"tri-bune-ship"},"inflection":{"noun_plural":"tribuneships"},"usage_notes":{"explanation":"'Tribuneship' specifically refers to the office or position held by a tribune, particularly in the context of ancient Rome. It denotes the power and responsibilities associated with that role. The term is relatively rare in modern English, primarily used in historical contexts when discussing Roman politics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was elected as a tribune, so he had a good tribuneship.","correct":"✓ He was elected as a tribune, and his tribuneship was marked by significant reforms.","note":"'Tribuneship' refers to the office itself, not the quality of the person holding it. Focus on the actions or characteristics of the office, not the person."}],"priority":"★☆☆"},"related_words":{"derivatives":["tribune (護民官)","tribunician (護民官の、護民官に関する)","tribunate (護民官の職、護民官の任期)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な歴史用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tribuneship' is a specialized term relating to ancient Roman history and politics. It refers to the office or position held by a tribune, who was an official elected to protect the interests of the plebeians (common citizens). Understanding this word requires knowledge of Roman political structures. It is not commonly used in modern English outside of historical or academic contexts."},"example_sentences":[{"sentence":"The power of the tribuneship was often used to veto senatorial decrees.","translation":"護民官の職権は、しばしば元老院の布告を拒否するために使われた。","type":"noun","meaning_category":"護民官の職"},{"sentence":"His year in the tribuneship was marked by his advocacy for land reform.","translation":"彼の護民官としての1年間は、土地改革の提唱によって特徴づけられた。","type":"noun","meaning_category":"護民官の職"}]}