{"word":"oenocyte","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(昆虫学) 昆虫の血リンパ中に見られる特殊な細胞で、脂肪体と関連し、脂質や炭化水素の合成に関与する","english_definition":"A specialized cell found in the hemolymph of insects, associated with the fat body, and involved in the synthesis of lipids and hydrocarbons.","examples":[{"sentence":"Oenocytes play a crucial role in the production of cuticular hydrocarbons in insects.","translation":"油細胞は昆虫のクチクラ炭化水素の生成に重要な役割を果たします。"},{"sentence":"The size and number of oenocytes can vary depending on the developmental stage of the insect.","translation":"油細胞のサイズと数は、昆虫の発生段階によって異なります。"}],"collocations":["cuticular hydrocarbons","fat body","hemolymph","lipid synthesis","hydrocarbon synthesis"],"synonyms":["none (highly specialized cell type)"],"antonyms":["none (highly specialized cell type)"]}],"etymology":{"value":"Derived from the Greek words 'oinos' (wine) and 'kytos' (cell), reflecting early observations of these cells in relation to metabolic processes. The name suggests a historical association with the metabolism of substances similar to those found in wine, although their actual function is broader.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈiːnəˌsaɪt/","syllables":"ee-no-cyte"},"inflection":{"noun_plural":"oenocytes"},"usage_notes":{"explanation":"Oenocytes are specialized cells found primarily in insects, although similar cells exist in other arthropods. They are characterized by their large size, polyploidy, and abundant smooth endoplasmic reticulum, reflecting their role in lipid and hydrocarbon metabolism. These cells are essential for the synthesis of cuticular hydrocarbons, which provide waterproofing and pheromonal communication. They are also involved in other metabolic processes, such as the detoxification of xenobiotics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Oenocytes are found in vertebrate blood.","correct":"✓ Oenocytes are found in insect hemolymph.","note":"Oenocytes are specific to insects and some other arthropods, not vertebrates."},{"incorrect":"✗ Oenocytes are involved in protein synthesis.","correct":"✓ Oenocytes are involved in lipid and hydrocarbon synthesis.","note":"Oenocytes are primarily involved in lipid and hydrocarbon metabolism, not protein synthesis."}],"priority":"★☆☆"},"related_words":{"derivatives":["oenocytic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized scientific term)","frequency_google_ngram":"Very low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Oenocyte' is a highly specialized term used in entomology and related fields. It refers to a specific type of cell found in insects that plays a crucial role in lipid and hydrocarbon metabolism. Understanding this term requires a background in biology, particularly insect physiology. It is not a commonly used word outside of scientific contexts."},"example_sentences":[{"sentence":"The researchers studied the role of oenocytes in the production of cuticular waxes.","translation":"研究者たちは、クチクラワックスの生成における油細胞の役割を研究しました。","type":"scientific","meaning_category":"lipid synthesis"},{"sentence":"Oenocyte differentiation is regulated by specific transcription factors during insect development.","translation":"油細胞の分化は、昆虫の発生中に特定の転写因子によって調節されます。","type":"scientific","meaning_category":"cell development"}]}