{"word":"Urinometry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"検尿法、尿比重測定","english_definition":"The process of measuring the specific gravity of urine.","examples":[{"sentence":"Urinometry is a simple test used to assess kidney function.","translation":"検尿法は腎機能を評価するために用いられる簡単な検査です。"},{"sentence":"The urinometry results indicated a high specific gravity.","translation":"検尿の結果は高い尿比重を示しました。"}],"collocations":["specific gravity of urine","kidney function","urine sample"],"synonyms":["urogravimetry","urine specific gravity measurement"],"antonyms":[]}],"etymology":{"value":"Derived from 'urino-' (referring to urine) and '-metry' (referring to measurement).","priority":"★★★"},"pronunciation":{"ipa":"ˌjʊərɪˈnɒmɪtri","syllables":"u-ri-nom-e-try"},"inflection":{"noun_plural":"urinometries"},"usage_notes":{"explanation":"Urinometry is a medical test used to determine the concentration of dissolved particles in urine. It is a basic diagnostic tool, often used as part of a routine physical examination or to assess kidney function. The specific gravity of urine provides information about the body's hydration status and the ability of the kidneys to concentrate urine.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor did a urinometer on me.","correct":"✓ The doctor performed urinometry on me.","note":"'Urinometer' is the instrument, 'urinometry' is the process."},{"incorrect":"✗ Urinometry is used to test for diabetes directly.","correct":"✓ Urinometry can provide clues, but further tests are needed to diagnose diabetes.","note":"Urinometry provides indirect information. Further tests are needed for a definitive diagnosis."}],"priority":"★★☆"},"related_words":{"derivatives":["urinometer (noun: an instrument for measuring the specific gravity of urine)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Urinometry is a specialized term used in the medical field to describe the measurement of the specific gravity of urine. This test is important for assessing kidney function and hydration levels. While not commonly used in everyday conversation, it is a standard procedure in clinical settings. Understanding this term is essential for those in healthcare professions.","priority":"★★★"},"example_sentences":[{"sentence":"The nurse used urinometry to check the patient's hydration levels.","translation":"看護師は検尿法を用いて患者の水分補給状態を確認しました。","type":"noun","meaning_category":"medical testing"},{"sentence":"Abnormal urinometry results may indicate a kidney problem.","translation":"異常な検尿結果は腎臓の問題を示唆する可能性があります。","type":"noun","meaning_category":"medical condition"}]}