{"word":"meta-universal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"普遍的なもの（ユニバーサル）を超えた、より高次の普遍性を持つこと。メタ的な視点から普遍性を捉えること。","english_definition":"Transcending the universal; possessing a higher-order universality; relating to a meta-perspective on universality.","examples":[{"sentence":"The concept of human rights, while often considered universal, may be seen as meta-universal when viewed through the lens of cultural relativism.","translation":"人権の概念は、しばしば普遍的であると考えられていますが、文化相対主義のレンズを通して見ると、メタ普遍的であると見なされるかもしれません。"},{"sentence":"A meta-universal ethical principle would be one that accounts for the limitations and biases inherent in any specific ethical system.","translation":"メタ普遍的な倫理原則とは、特定の倫理体系に内在する限界や偏見を考慮したものです。"}],"collocations":["meta-universal principle","meta-universal concept","meta-universal framework"],"synonyms":["transuniversal","hyperuniversal"],"antonyms":["universal","particular","specific"],"notes":"This term is often used in philosophical, ethical, and theoretical contexts to describe concepts that attempt to reconcile or transcend traditional notions of universality."}],"etymology":{"value":"The term is formed by combining the prefix 'meta-' (meaning 'beyond' or 'about') with 'universal'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɛtə juːnɪˈvɜːrsəl/","syllables":"met-a-u-ni-ver-sal"},"inflection":{"notes":"Since it is an adjective, it has comparative (more meta-universal) and superlative (most meta-universal) forms, though these are rarely used."},"usage_notes":{"explanation":"'Meta-universal' is used to describe something that goes beyond the ordinary understanding of 'universal'. It often implies a critical examination or re-evaluation of what is considered universally true or applicable. It suggests a level of abstraction or analysis that considers the limitations or biases inherent in any given universal claim.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The law is meta-universal and applies to everyone without exception.","correct":"✓ The law is universal and applies to everyone without exception.","note":"Use 'universal' when referring to something that applies to everyone without exception in a straightforward manner. 'Meta-universal' implies a more complex or nuanced understanding of universality."}],"priority":"★☆☆"},"related_words":{"derivatives":["meta (prefix)","universal","universality","meta-analysis","metaphysics"],"related_concepts":["cultural relativism","ethical relativism","philosophical universalism","transcendentalism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. This is a specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'meta-universal' is a high-level abstraction used in philosophical and theoretical discussions. It refers to a concept that transcends or critically examines the traditional idea of 'universal'. It's often used to discuss the limitations or biases inherent in claims of universality, suggesting a more nuanced and reflective understanding. This term is not commonly used in everyday language."},"example_sentences":[{"sentence":"The search for meta-universal values requires a deep understanding of diverse cultural perspectives.","translation":"メタ普遍的な価値の探求には、多様な文化的視点の深い理解が必要です。","type":"general","meaning_category":"philosophical concept"},{"sentence":"A meta-universal approach to ethics seeks to identify principles that are applicable across different moral frameworks, while acknowledging their limitations.","translation":"倫理学へのメタ普遍的なアプローチは、異なる道徳的枠組みに適用可能でありながら、その限界を認識する原則を特定しようとします。","type":"general","meaning_category":"philosophical concept"}]}