{"word":"onderbouwen","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(argument, theory, etc.) to substantiate, to support, to underpin","english_definition":"to provide a basis or foundation for; to support with evidence or reasoning","examples":[{"sentence":"De stelling is goed onderbouwd met feiten.","translation":"The claim is well substantiated with facts."},{"sentence":"Het rapport onderbouwt de noodzaak voor verdere investeringen.","translation":"The report supports the need for further investments."}],"collocations":["een stelling onderbouwen (to substantiate a claim)","een theorie onderbouwen (to support a theory)","met bewijs onderbouwen (to substantiate with evidence)"],"synonyms":["staven","bevestigen","fundamenteren","ondersteunen"],"antonyms":["weerleggen","ontkrachten"]}],"etymology":{"value":"From 'onder' (under) + 'bouwen' (to build). Literally, 'to build under', meaning to provide a foundation or support.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɔndərˌbɑu̯ə(n)/","syllables":"on-der-bou-wen"},"inflection":{"verb_forms":{"infinitive":"onderbouwen","present_simple":["onderbouw","onderbouwt","onderbouwen"],"past_simple":"onderbouwde","past_participle":"onderbouwd","imperative":"onderbouw"}},"usage_notes":{"explanation":"The verb 'onderbouwen' is used to describe the act of providing a solid foundation or support for an argument, theory, or claim. It implies providing evidence, reasoning, or facts to make something more credible or convincing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Hij onderbouwde de muur.","correct":"Hij verstevigde de muur.","note":"'Onderbouwen' is primarily used for arguments and theories, not physical structures. For physical structures, use 'verstevigen' (to reinforce)."},{"incorrect":"De stelling is niet onderbouwd. Daarom is het waar.","correct":"De stelling is niet onderbouwd. Daarom is het onwaarschijnlijk.","note":"Lack of substantiation weakens a claim, it doesn't make it true."}],"priority":"★★☆"},"related_words":{"derivatives":["onderbouwing (substantiation, support)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent in academic and formal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Onderbouwen' means to provide a solid base or support for something, usually an idea or argument. Think of it as building a strong foundation under a house. You use facts, evidence, or logical reasons to make your idea more convincing. It's a common word in discussions and writing where you need to prove your point.","example_sentences":[]}}