{"word":"hurkaru","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A messenger or spy in India, particularly during the British colonial period.","english_definition":"(historical) A messenger or spy in India, particularly during the British colonial period.","examples":[{"sentence":"The East India Company employed hurkarus to gather intelligence.","translation":"東インド会社は、情報を収集するためにハルカルを雇った。"},{"sentence":"The hurkaru delivered the secret message under the cover of darkness.","translation":"ハルカルは闇に紛れて秘密のメッセージを届けた。"}],"collocations":["employ a hurkaru","send a hurkaru","hurkaru system"],"synonyms":["spy","messenger","informant","scout"],"antonyms":[]}],"etymology":{"value":"Derived from Persian and Urdu, ultimately from the Arabic word for 'messenger' or 'courier'.","priority":"★★☆"},"pronunciation":{"ipa":"/hərˈkɑːruː/","syllables":"hur-ka-ru"},"inflection":{"noun_plural":"hurkarus"},"usage_notes":{"explanation":"The term 'hurkaru' is primarily used in historical contexts when discussing British India. It refers to individuals who served as messengers, spies, or scouts, often employed by the British East India Company or other entities to gather information or deliver messages. The word is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He works as a hurkaru for the government today.","correct":"✓ He works as an intelligence officer for the government today.","note":"'Hurkaru' is an outdated term. Use 'intelligence officer,' 'messenger,' or 'spy' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency; primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'hurkaru' is a historical term rarely used in modern English. It refers to a specific role in British India, making it relevant primarily to those studying that period. Understanding requires knowledge of historical context rather than general English proficiency."},"example_sentences":[{"sentence":"The British relied on a network of hurkarus to monitor the movements of local rulers.","translation":"イギリスは、地元の支配者の動きを監視するために、ハルカルのネットワークに依存していた。","type":"noun","meaning_category":"messenger/spy"},{"sentence":"As a hurkaru, he had to be discreet and observant.","translation":"ハルカルとして、彼は慎重かつ観察力に優れている必要があった。","type":"noun","meaning_category":"messenger/spy"}]}