{"word":"Dinarchy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"二頭政治：二人の支配者による政府形態","english_definition":"A form of government in which two individuals are joint rulers.","examples":[{"sentence":"The Roman Republic, in its later years, sometimes resembled a dinarchy with two powerful figures dominating politics.","translation":"ローマ共和国は、末期には、二人の有力者が政治を支配する二頭政治の様相を呈することがあった。"},{"sentence":"The ancient city-state experimented with dinarchy to balance power between two rival factions.","translation":"古代都市国家は、二つの対立する派閥間の権力を均衡させるために、二頭政治を試みた。"}],"collocations":["joint rule","dual leadership","co-rulership"],"synonyms":["duumvirate","dyarchy"],"antonyms":["monarchy","anarchy","oligarchy"],"notes":"Often used in political science and historical contexts."}],"etymology":{"value":"Derived from the Greek words 'di-' (meaning 'two') and '-archy' (meaning 'rule' or 'government').","priority":"★★★"},"pronunciation":{"ipa":"/ˈdaɪnɑːrki/","syllables":"di-nar-chy"},"inflection":{"noun_plural":"dinarchies"},"usage_notes":{"explanation":"'Dinarchy' is a relatively uncommon term, but it is useful for describing historical or fictional governments where power is shared equally between two individuals. It is distinct from a diarchy, which may involve two entities (not necessarily individuals) sharing power.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was under a dinarchy of three leaders.","correct":"✓ The country was under a triumvirate.","note":"Dinarchy specifically refers to rule by two individuals; rule by three is a triumvirate."},{"incorrect":"✗ The dinarchy was very quiet.","correct":"✓ The dinarchy was stable.","note":"Dinarchy refers to a form of government, not a state of being quiet."}],"priority":"★★☆"},"related_words":{"derivatives":["diarchic (adjective)"],"related_terms":["dyarchy","duumvirate","triumvirate","monarchy","oligarchy"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dinarchy' is a specialized term used in political science and history to describe a government ruled by two individuals. It is not commonly used in everyday language. Understanding this term requires familiarity with basic concepts of political systems and etymology of related words.","priority":"★★☆"},"example_sentences":[{"sentence":"The island nation was governed by a dinarchy, with power split between the king and queen.","translation":"その島国は、王と女王の間で権力が分割された二頭政治によって統治されていた。","type":"example","meaning_category":"Government structure"},{"sentence":"Historians debated whether the late Roman Republic was a true dinarchy or an oligarchy.","translation":"歴史家たちは、末期のローマ共和国が真の二頭政治であったのか、寡頭政治であったのかを議論した。","type":"example","meaning_category":"Historical context"}]}