{"word":"carbonatization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"炭酸化、炭酸塩化","english_definition":"The process of dissolving carbon dioxide in a liquid, or the reaction of a substance with carbon dioxide to form a carbonate.","examples":[{"sentence":"The carbonatization of the beverage gives it a fizzy texture.","translation":"飲料の炭酸化が、シュワシュワした食感を与えます。"},{"sentence":"Carbonatization of concrete can lead to corrosion of the reinforcing steel.","translation":"コンクリートの炭酸化は、内部の鉄筋の腐食につながる可能性があります。"}],"collocations":["accelerated carbonatization (促進炭酸化)","surface carbonatization (表面炭酸化)","carbonatization depth (炭酸化深さ)"],"synonyms":["carbonation"],"antonyms":["decarbonation"]},{"part_of_speech":"noun","definition":"(地質学)炭酸塩化作用","english_definition":"(Geology) A process of chemical weathering by which minerals react with carbonic acid.","examples":[{"sentence":"The carbonatization of the rock formations created unique landscapes.","translation":"岩石層の炭酸塩化作用が、独特な景観を作り出しました。"}],"collocations":["carbonate weathering (炭酸塩風化)"],"synonyms":[]}],"etymology":{"value":"Derived from 'carbonate' (a salt of carbonic acid) + '-ization' (the process of becoming).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɑːr.bə.nə.taɪˈzeɪ.ʃən/","syllables":"car-bo-na-ti-za-tion"},"inflection":{"noun_plural":"carbonatizations"},"usage_notes":{"explanation":"'Carbonatization' refers to two main processes: the dissolving of carbon dioxide in a liquid (like in soda) and the chemical reaction where a substance reacts with carbon dioxide to form a carbonate. In geology, it specifically refers to the weathering process where minerals react with carbonic acid. The term is often used in the context of food science (carbonated beverages), chemistry, geology, and civil engineering (carbonatization of concrete).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The carbonation process is also called carbonatize.","correct":"✓ The carbonatization process is also called carbonation.","note":"'Carbonatize' is a verb meaning 'to carbonate,' while 'carbonatization' is the noun describing the process itself. 'Carbonation' is a synonym for the noun 'carbonatization'."},{"incorrect":"✗ Carbonation is the reverse of carbonatization.","correct":"✓ Decarbonation is the reverse of carbonatization.","note":"'Decarbonation' is the reverse process of carbonatization, involving the removal of carbon dioxide."}],"priority":"★★☆"},"related_words":{"derivatives":["carbonate (noun, verb)","carbonated (adjective)","carbonating (verb)","carbonation (noun)"],"related_terms":["carbonic acid (炭酸)","carbon dioxide (二酸化炭素)","weathering (風化)","mineral (鉱物)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Carbonatization' is a technical term primarily used in scientific and engineering contexts. It describes the process of adding carbon dioxide to a substance, either by dissolving it in a liquid or through a chemical reaction that forms a carbonate compound. This term is often encountered in discussions about carbonated beverages, geological processes, or the durability of concrete structures. Understanding this term requires a background in chemistry, geology, or related fields."},"example_sentences":[{"sentence":"The rate of carbonatization in concrete is influenced by environmental factors.","translation":"コンクリートの炭酸化速度は、環境要因に影響されます。","type":"general","meaning_category":"炭酸化 (コンクリート)"},{"sentence":"Artificial carbonatization can be used to enhance the properties of certain materials.","translation":"人工的な炭酸化は、特定の材料の特性を向上させるために使用できます。","type":"technical","meaning_category":"炭酸化 (材料)"},{"sentence":"The natural carbonatization of groundwater contributes to the formation of limestone caves.","translation":"地下水の自然な炭酸塩化作用は、石灰岩の洞窟の形成に寄与します。","type":"geological","meaning_category":"炭酸塩化作用 (地質学)"}]}