{"word":"healthy-weight-related","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"健康体重に関連する、健康的な体重に関連する","english_definition":"Relating to or associated with a healthy weight or weight management.","examples":[{"sentence":"The study focused on healthy-weight-related behaviors in adolescents.","translation":"その研究は、青年期の健康体重に関連する行動に焦点を当てた。"},{"sentence":"Doctors recommend a combination of diet and exercise for healthy-weight-related outcomes.","translation":"医師たちは、健康体重に関連する結果のために、食事と運動の組み合わせを推奨している。"},{"sentence":"This article provides information on healthy-weight-related lifestyle changes.","translation":"この記事は、健康体重に関連するライフスタイルの変化に関する情報を提供する。"}],"collocations":["healthy-weight-related behaviors (健康体重に関連する行動)","healthy-weight-related outcomes (健康体重に関連する結果)","healthy-weight-related lifestyle (健康体重に関連するライフスタイル)","healthy-weight-related advice (健康体重に関連するアドバイス)","healthy-weight-related goals (健康体重に関連する目標)"],"synonyms":["weight-management-related","weight-related (in a positive context)","healthful-weight-related"],"antonyms":["unhealthy-weight-related","obesity-related","underweight-related"]}],"etymology":{"value":"A compound adjective formed by combining 'healthy-weight' (describing a desirable weight range) with 'related' (meaning connected or associated).","priority":"★★★"},"pronunciation":{"ipa":"/ˈhɛlθi ˈweɪt rɪˈleɪtɪd/","syllables":"health-y weight re-lat-ed"},"inflection":{"notes":"Adjectives do not inflect in English, but can be modified by adverbs (e.g., 'very healthy-weight-related')."},"usage_notes":{"explanation":"'Healthy-weight-related' is used to describe things that have a connection to maintaining a healthy weight. It is often used in the context of health, nutrition, and fitness discussions. It implies a focus on achieving or maintaining a weight that is considered beneficial for overall health.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ healthy weight related","correct":"✓ healthy-weight-related","note":"Hyphenation is important when using multiple words as a single adjective before a noun. Without the hyphens, 'healthy' might be misinterpreted as modifying 'weight' alone, rather than the entire phrase modifying the noun that follows."},{"incorrect":"✗ healthy weighted related","correct":"✓ healthy-weight-related","note":"'Weight' is a noun, not a verb in this context. 'Weighted' is the past participle of 'weigh,' which is not appropriate here."}],"priority":"★★☆"},"related_words":{"derivatives":["healthy weight (健康体重)","weight-related (体重に関連する)","health-related (健康に関連する)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Primarily used in medical or health-related contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'healthy-weight-related' is a specialized adjective used in health and medical contexts. It describes something that is connected to or associated with maintaining a weight that is considered healthy for an individual. This term is more commonly found in academic papers, medical journals, or health-related articles rather than everyday conversation. Understanding this term requires a good grasp of health vocabulary and the concept of a healthy weight.","priority":"★★☆"},"example_sentences":[{"sentence":"The campaign promotes healthy-weight-related eating habits among children.","translation":"そのキャンペーンは、子供たちの健康体重に関連する食習慣を促進している。","type":"general","meaning_category":"health"},{"sentence":"Regular physical activity is crucial for healthy-weight-related cardiovascular health.","translation":"定期的な身体活動は、健康体重に関連する心血管の健康にとって重要である。","type":"medical","meaning_category":"health"},{"sentence":"The study examined the effects of a new drug on healthy-weight-related metabolic markers.","translation":"その研究は、新しい薬が健康体重に関連する代謝マーカーに及ぼす影響を調査した。","type":"scientific","meaning_category":"scientific"}]}