{"word":"protanomalous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学) 第一色弱の、赤色弱の","english_definition":"(medicine) exhibiting protanomaly; having a mild form of red-green color blindness in which red appears less bright than normal.","examples":[{"sentence":"He was diagnosed as protanomalous after failing the color vision test.","translation":"彼は色覚検査で不合格となり、第一色弱と診断された。"},{"sentence":"Protanomalous vision can make it difficult to distinguish between certain shades of red and green.","translation":"第一色弱の視覚では、特定の色合いの赤と緑を区別するのが難しいことがある。"}],"collocations":["protanomalous vision","protanomalous observer"],"synonyms":["red-weak","red-blind (in severe cases)"],"antonyms":["normal color vision","deuteranomalous","tritanomalous"]}],"etymology":{"value":"Derived from 'protanomaly,' which combines 'proto-' (meaning 'first' or 'primary'), 'an-' (meaning 'not' or 'without'), and 'omaly' (short for 'anomaly,' meaning 'irregularity'). It refers to an anomaly in the 'proto' (red) color perception.","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊtəˈnɒmələs/","syllables":"pro-ta-nom-a-lous"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Protanomalous' specifically describes a mild form of protanopia (red color blindness). People with protanomalous vision have a reduced sensitivity to red light, causing red colors to appear less bright and making it difficult to distinguish between reds, greens, and yellows. This condition is usually genetic and affects males more frequently than females.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is protanopia.","correct":"✓ He is protanomalous. / ✓ He has protanopia.","note":"'Protanopia' is a noun (the condition itself), while 'protanomalous' is an adjective (describing someone with the condition)."},{"incorrect":"✗ Protanomalous is a severe form of color blindness.","correct":"✓ Protanomalous is a mild form of color blindness.","note":"Protanomaly is a milder form compared to protanopia."}],"priority":"★★☆"},"related_words":{"derivatives":["protanomaly (noun)","protanope (noun)"],"related_medical_terms":["deuteranomaly","deuteranopia","tritanomaly","tritanopia","color blindness","color vision deficiency"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency - specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Protanomalous' is a technical term used in the field of ophthalmology and vision science. It describes a specific type of color vision deficiency where the perception of red light is altered, making red colors appear less vibrant. Understanding this term requires some background knowledge in color vision and genetics. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The protanomalous individual struggled to differentiate between certain shades of brown and green.","translation":"その第一色弱の人は、特定の色合いの茶色と緑を区別するのに苦労した。","type":"adjective","meaning_category":"color vision deficiency"},{"sentence":"His protanomalous vision was diagnosed during a routine eye exam.","translation":"彼の第一色弱は、定期的な眼科検診で診断された。","type":"adjective","meaning_category":"color vision deficiency"}]}