{"word":"Listerellosis","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"リステリア症：リステリア菌によって引き起こされる感染症","english_definition":"An infection caused by the bacterium Listeria monocytogenes.","examples":[{"sentence":"Listerellosis can be particularly dangerous for pregnant women, newborns, and individuals with weakened immune systems.","translation":"リステリア症は、特に妊婦、新生児、および免疫力が低下している人にとって危険な場合があります。"}],"synonyms":["Listeria infection"],"antonyms":[]}],"etymology":{"value":"リステリア菌（Listeria monocytogenes）に由来。リステリア菌は、アメリカの細菌学者ジョセフ・リスター（Joseph Lister）にちなんで命名された。接尾辞「-osis」は病気を意味する。","priority":"Medium"},"pronunciation":{"ipa":"/lɪˌstɛrəˈloʊsɪs/","syllables":"Lis-ter-el-lo-sis"},"inflection":{"noun_plural":"Listerelloses"},"usage_notes":{"explanation":"Listerellosis is a relatively rare but serious infection. It is typically contracted by eating food contaminated with Listeria bacteria, such as unpasteurized milk products, soft cheeses, and processed meats. Symptoms can include fever, muscle aches, nausea, and diarrhea. In severe cases, it can lead to meningitis or septicemia.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"Listeriosis is a viral infection.","correct":"Listeriosis is a bacterial infection.","note":"Listeriosis is caused by bacteria, not a virus."}],"priority":"Low"},"related_words":{"derivatives":["Listeria","Listeriosis"],"phrasal_verbs":[]},"level_frequency":{"frequency_google_ngram":"Very low frequency","priority":"Low"},"readability_explanation":{"level":"C1","text":"Listerellosis is a medical term referring to an infection caused by Listeria bacteria. It's important to understand that this is a bacterial infection, often contracted through contaminated food. The term is primarily used in medical contexts and might not be commonly encountered in everyday conversation."},"example_sentences":[{"sentence":"The public health agency issued a warning about a listerellosis outbreak linked to contaminated produce.","translation":"公衆衛生機関は、汚染された農産物に関連するリステリア症の発生について警告を発しました。","type":"general","meaning_category":"infection"},{"sentence":"Early diagnosis and treatment with antibiotics are crucial for managing listerellosis effectively.","translation":"リステリア症を効果的に管理するには、早期の診断と抗生物質による治療が不可欠です。","type":"medical","meaning_category":"treatment"}]}