{"word":"overpersuasion","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"過剰な説得、説得のしすぎ","english_definition":"The act of persuading someone excessively or to an unreasonable degree.","examples":[{"sentence":"The company's marketing tactics were criticized for using overpersuasion to sell their products.","translation":"その会社のマーケティング戦術は、製品を販売するために過剰な説得を用いているとして批判された。"},{"sentence":"The lawyer argued that his client was a victim of overpersuasion and did not fully understand the contract.","translation":"弁護士は、依頼人が過剰な説得の犠牲者であり、契約を完全に理解していなかったと主張した。"},{"sentence":"Be wary of salespeople who use overpersuasion; they may not have your best interests at heart.","translation":"過剰な説得を使う販売員には注意してください。彼らはあなたの最善の利益を考えていないかもしれません。"}],"collocations":["use overpersuasion","victim of overpersuasion","avoid overpersuasion","resist overpersuasion"],"synonyms":["coercion","manipulation","undue influence","high-pressure tactics"],"antonyms":["reasoning","logic","rational argument","fair persuasion"]}],"etymology":{"value":"\"Over-\" (過剰な) + \"persuasion\" (説得)","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvər.pərˈsweɪ.ʒən/","syllables":"o-ver-per-sua-sion"},"inflection":{"noun_plural":"overpersuasions"},"usage_notes":{"explanation":"\"Overpersuasion\" refers to a situation where someone is persuaded to do something against their better judgment, often through aggressive or manipulative tactics. It implies that the persuasion goes beyond reasonable or ethical boundaries. The term is often used in legal or ethical contexts to describe situations where someone's free will is compromised.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The overpersuasion of the argument led to a quick decision.","correct":"✓ The strength of the argument led to a quick decision.","note":"Overpersuasion implies manipulation, so if the argument was simply strong, use a word like 'strength' instead."},{"incorrect":"✗ He suffered from overpersuasion after the accident.","correct":"✓ He suffered from manipulation after the accident.","note":"Overpersuasion is the act of persuading, not a state of suffering. Use a word like 'manipulation' to describe the state of being influenced."}],"priority":"★★☆"},"related_words":{"derivatives":["overpersuade (verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"overpersuasion\" is a relatively uncommon term that describes the act of convincing someone to do something through excessive or manipulative means. It implies that the persuasion is so strong that it overrides the person's own judgment or free will. This word is often used in legal or ethical discussions where the fairness or voluntariness of a decision is being questioned. Understanding this word requires a good grasp of the nuances of persuasion and influence.","priority":"★★☆"},"example_sentences":[{"sentence":"The contract was deemed invalid due to the overpersuasion used by the sales representative.","translation":"その契約は、営業担当者が用いた過剰な説得により無効とみなされた。","type":"noun","meaning_category":"過剰な説得"},{"sentence":"She felt like she had been a victim of overpersuasion when she agreed to the deal.","translation":"彼女はその取引に合意したとき、過剰な説得の犠牲者になったように感じた。","type":"noun","meaning_category":"過剰な説得"},{"sentence":"The company was accused of using overpersuasion tactics to target vulnerable customers.","translation":"その会社は、脆弱な顧客をターゲットにするために過剰な説得戦術を用いたとして非難された。","type":"noun","meaning_category":"過剰な説得"}]}