{"word":"Nabatean","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ナバテア人の、ナバテアの","english_definition":"Relating to the Nabataeans, their culture, or their language.","examples":[{"sentence":"Nabatean pottery is known for its thin walls and delicate decorations.","translation":"ナバテアの陶器は、薄い壁と繊細な装飾で知られています。"},{"sentence":"The Nabatean kingdom flourished in the area of modern-day Jordan.","translation":"ナバテア王国は、現在のヨルダンにあたる地域で繁栄しました。"}],"collocations":["Nabatean architecture","Nabatean kingdom","Nabatean pottery"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ナバテア人、ナバテア語","english_definition":"A member of an ancient Arab people inhabiting northern Arabia and the Negev, or their language.","examples":[{"sentence":"The Nabateans were skilled traders and engineers.","translation":"ナバテア人は熟練した貿易商であり、エンジニアでした。"},{"sentence":"Nabatean is an Aramaic dialect with some Arabic influences.","translation":"ナバテア語は、アラビア語の影響を受けたアラム語の方言です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin *Nabataeus*, from Ancient Greek *Ναβαταῖος* (Nabataîos), from Aramaic *נבט*‎ (n-b-ṭ /⁠nabaṭ⁠/, “to look, watch over”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnæbəˈtiːən/","syllables":"Na-ba-te-an"},"inflection":{"noun_plural":"Nabataeans"},"usage_notes":{"explanation":"'Nabatean' refers to the Nabataeans, an ancient Arab people who inhabited parts of the Middle East, particularly the area around modern-day Jordan. They are famous for their rock-cut architecture, especially in Petra. The term can be used as an adjective to describe things related to them or their culture, or as a noun to refer to a Nabatean person or their language.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low Frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Nabatean' is a relatively uncommon term that refers to an ancient Arab people and their culture. It is most often encountered in historical or archaeological contexts, particularly when discussing the city of Petra. Understanding the term requires some familiarity with ancient Middle Eastern history."},"example_sentences":[{"sentence":"The intricate water systems built by the **Nabatean** engineers allowed them to thrive in the desert.","translation":"ナバテアの技術者によって建設された複雑な水システムにより、彼らは砂漠で繁栄することができました。","type":"adjective","meaning_category":"Relating to the Nabataeans"},{"sentence":"The **Nabateans** controlled important trade routes, which contributed to their wealth and power.","translation":"ナバテア人は重要な交易路を支配し、それが彼らの富と権力に貢献しました。","type":"noun","meaning_category":"A member of an ancient Arab people"}]}