{"word":"DES","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Data Encryption Standard) データ暗号化標準","english_definition":"(Data Encryption Standard) A symmetric-key block cipher algorithm and U.S. Federal Information Processing Standard (FIPS) for encrypting sensitive but unclassified, non-critical data.","examples":[{"sentence":"DES was once widely used for securing electronic data.","translation":"DESはかつて、電子データの保護に広く使用されていました。"},{"sentence":"The vulnerability of DES to brute-force attacks led to its replacement by more secure algorithms.","translation":"DESが総当たり攻撃に対して脆弱であったため、より安全なアルゴリズムに置き換えられました。"}],"collocations":["triple DES","DES encryption","DES algorithm"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Acronym of Data Encryption Standard.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdiːˌiːˈɛs/","syllables":"DE-ES"},"inflection":{},"usage_notes":{"explanation":"DES is a symmetric-key algorithm, meaning the same key is used for both encryption and decryption. Due to its relatively short key length (56 bits), it is now considered insecure for many applications and has been superseded by algorithms like AES (Advanced Encryption Standard).","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["3DES (Triple DES)","AES (Advanced Encryption Standard)"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"DES (Data Encryption Standard) is a cryptographic algorithm used to encrypt data. It's an older standard, and due to its short key length, it's no longer considered secure for most applications. You'll typically encounter it in discussions about the history of cryptography or when dealing with legacy systems. It's important to know that more secure algorithms like AES are now preferred.","priority":"★★★"},"example_sentences":[{"sentence":"Many older systems still rely on DES for data encryption.","translation":"多くの古いシステムは、依然としてデータ暗号化にDESを使用しています。","type":"noun","meaning_category":"Data Encryption Standard"},{"sentence":"The transition from DES to AES was a significant step in improving data security.","translation":"DESからAESへの移行は、データセキュリティを向上させるための重要なステップでした。","type":"noun","meaning_category":"Data Encryption Standard"}]}