{"word":"brachyskelic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"短脚の、短い脚を持つ","english_definition":"Having short legs in proportion to the body.","examples":[{"sentence":"The brachyskelic build is more common in some dog breeds.","translation":"短脚の体格は、一部の犬種でより一般的です。"},{"sentence":"He was described as brachyskelic, with a long torso and short legs.","translation":"彼は胴が長く、脚が短い、短脚であると描写されました。"}],"collocations":["brachyskelic build","brachyskelic physique"],"synonyms":["short-legged"],"antonyms":["macroscelic","long-legged"]}],"etymology":{"value":"From the Greek words 'brachys' (short) and 'skelos' (leg).","priority":"★★★"},"pronunciation":{"ipa":"/ˌbrækɪˈskɛlɪk/","syllables":"bra-chy-ske-lic"},"inflection":{"notes":"Comparative and superlative forms are possible but rare: more brachyskelic, most brachyskelic."},"usage_notes":{"explanation":"'Brachyskelic' is a relatively uncommon term, primarily used in scientific or descriptive contexts, particularly in anthropology, zoology, and sometimes in medical descriptions. It is used to describe the physical characteristic of having legs that are short in proportion to the length of the torso.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The brachyskelic dog was very tall.","correct":"✓ The brachyskelic dog had short legs.","note":"Brachyskelic refers to short legs, so it is contradictory to say a brachyskelic animal is tall."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_terms":["macroscelic (long-legged)","skelos (Greek for leg)","brachy- (prefix meaning short)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Brachyskelic' is a highly specialized term primarily encountered in academic or technical contexts, specifically within fields like anthropology or zoology. Its meaning is straightforward—describing the condition of having short legs relative to the body—but its limited usage makes it unlikely to appear in general conversation or writing. Understanding this term is more relevant for those studying related scientific disciplines."},"example_sentences":[{"sentence":"Anthropologists noted the brachyskelic proportions of the skeletal remains.","translation":"人類学者は、骨格の遺体の短脚の比率に注目しました。","type":"general","meaning_category":"descriptive"},{"sentence":"The dachshund is a well-known example of a brachyskelic dog breed.","translation":"ダックスフントは、短脚の犬種としてよく知られています。","type":"specific","meaning_category":"zoology"}]}