{"word":"recursing","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"再帰処理を行う、再帰する","english_definition":"Performing recursion; applying a function or procedure repeatedly, with each application using the result of the previous one.","examples":[{"sentence":"The function is recursing to calculate the factorial.","translation":"その関数は階乗を計算するために再帰処理を行っています。"},{"sentence":"Be careful not to create an infinite loop when recursing.","translation":"再帰処理を行う際には、無限ループを作らないように注意してください。"}],"collocations":["recursing function","recursing algorithm"],"synonyms":["repeating","iterating","looping"],"antonyms":["terminating","ending"]}],"etymology":{"value":"The term 'recursing' is the present participle of the verb 'to recurse,' which comes from 'recursion.' 'Recursion' itself originates from the Latin word 'recurrere,' meaning 'to run back.'","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈkɜːrsɪŋ/","syllables":"re-curs-ing"},"inflection":{"verb_form":"present participle of 'recurse'"},"usage_notes":{"explanation":"'Recursing' specifically refers to the act of a function or algorithm calling itself within its own definition. It's a common technique in computer science for solving problems that can be broken down into smaller, self-similar subproblems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is recursing on the data.","correct":"✓ The program is recursing to process the data.","note":"'Recursing' is an action performed by a function or algorithm, not directly on data. It recurses *to* achieve something."},{"incorrect":"✗ Recursing is easy.","correct":"✓ Recursion is easy.","note":"'Recursing' (verb form) describes the *act* of performing recursion. 'Recursion' (noun) is the concept or technique itself."}],"priority":"★★☆"},"related_words":{"derivatives":["recursion (noun)","recursive (adjective)","recurse (verb)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Recursing' is a technical term primarily used in computer science and mathematics. It describes the process of a function or algorithm calling itself repeatedly to solve a problem. This concept is more advanced and typically encountered in higher-level programming courses or discussions about algorithms and data structures."},"example_sentences":[{"sentence":"The algorithm is currently recursing through the tree structure.","translation":"そのアルゴリズムは現在、木構造を再帰的に処理しています。","type":"verb","meaning_category":"再帰処理を行う"},{"sentence":"While recursing, the function maintains a stack of previous states.","translation":"再帰処理中、関数は以前の状態のスタックを保持します。","type":"verb","meaning_category":"再帰処理を行う"},{"sentence":"The program spent a long time recursing before finding a solution.","translation":"そのプログラムは、解決策を見つけるまでに長い時間再帰処理を行いました。","type":"verb","meaning_category":"再帰処理を行う"}]}