{"word":"epitomist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"要約者、概要作成者、縮図、典型","english_definition":"A person who makes an epitome; one who abridges or summarizes; one who is representative of a larger group or idea.","examples":[{"sentence":"He was an epitomist of the Victorian era.","translation":"彼はヴィクトリア朝時代の典型だった。"},{"sentence":"She is an epitomist of hard work and dedication.","translation":"彼女は勤勉と献身の典型だ。"},{"sentence":"The epitomist skillfully condensed the lengthy report into a concise summary.","translation":"要約者は、その長大な報告書を巧みに簡潔な要約にまとめた。"}],"collocations":["epitomist of virtue (美徳の典型)","epitomist of elegance (優雅さの典型)","skilled epitomist (熟練した要約者)"],"synonyms":["summarizer","abridger","abstractor","representative","embodiment","quintessence","example","model"],"antonyms":["expander","amplifier","elongator"]},{"part_of_speech":"noun","definition":"（古用法）短い服を着る人","english_definition":"(archaic) One who wears short clothes.","examples":[{"sentence":"The epitomists of the time were known for their practical, shorter garments.","translation":"当時の短い服を着る人々は、実用的な短い衣服で知られていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'epitome' (a summary or abstract) + '-ist' (a suffix denoting a person who does or is associated with something). The term evolved from meaning someone who creates summaries to someone who embodies or represents something.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈpɪtəmɪst/","syllables":"e-pit-o-mist"},"inflection":{"noun_plural":"epitomists"},"usage_notes":{"explanation":"The word 'epitomist' can refer to someone who creates summaries or abridgements, but it is more commonly used to describe someone who perfectly represents or embodies a particular quality, type, or idea. The archaic meaning referring to someone wearing short clothes is rarely used today.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a good epitomist because she is very long-winded.","correct":"✓ She is a good epitomist because she is very concise.","note":"An epitomist should be concise, not long-winded."},{"incorrect":"✗ He was the epitomist of all the students.","correct":"✓ He was the epitome of all the students.","note":"'Epitome' (the perfect example) is more commonly used than 'epitomist' in this context."}],"priority":"★★★"},"related_words":{"derivatives":["epitome (名詞: 概要、要約、典型)","epitomize (動詞: 要約する、～の典型である)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'epitomist' is relatively rare and sophisticated. It primarily refers to someone who creates summaries or, more commonly, someone who perfectly represents a particular quality or type. Understanding the word requires a good vocabulary and an understanding of abstract concepts. The archaic meaning is rarely encountered.","priority":"★★☆"},"example_sentences":[{"sentence":"As an epitomist of modern art, she challenged traditional norms.","translation":"現代アートの典型として、彼女は伝統的な規範に挑戦した。","type":"noun","meaning_category":"典型"},{"sentence":"The editor hired an epitomist to condense the novel for a younger audience.","translation":"編集者は、若い読者向けに小説を要約するために要約者を雇った。","type":"noun","meaning_category":"要約者"},{"sentence":"He was considered an epitomist of bravery for his actions during the war.","translation":"彼は、戦時中の行動から、勇敢さの典型と見なされた。","type":"noun","meaning_category":"典型"},{"sentence":"The professor was a skilled epitomist, able to summarize complex theories effectively.","translation":"その教授は熟練した要約者で、複雑な理論を効果的に要約することができた。","type":"noun","meaning_category":"要約者"}]}