{"word":"promazine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"プロマジン（フェノチアジン系の抗精神病薬）","english_definition":"A phenothiazine antipsychotic drug used to treat psychotic disorders.","examples":[{"sentence":"Promazine is used to treat schizophrenia.","translation":"プロマジンは統合失調症の治療に使用されます。"},{"sentence":"The doctor prescribed promazine to help manage the patient's agitation.","translation":"医師は患者の興奮を抑えるためにプロマジンを処方しました。"}],"collocations":["promazine hydrochloride","administer promazine","prescribe promazine"],"synonyms":["Sparine (brand name)"],"antonyms":[]}],"etymology":{"value":"Derived from the chemical structure of the compound, related to other phenothiazine drugs. The 'pro-' prefix indicates its relationship to other similar compounds, and '-azine' is a common suffix for drugs in this class.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈproʊməziːn/","syllables":"pro-ma-zine"},"inflection":{"notes":"Noun, plural: promazines"},"usage_notes":{"explanation":"Promazine is a typical antipsychotic medication, belonging to the phenothiazine class. It is primarily used to treat psychotic disorders such as schizophrenia. It works by blocking dopamine receptors in the brain. Due to the availability of newer antipsychotics with fewer side effects, promazine is not as commonly prescribed as it once was.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Promazine is a antibiotic.","correct":"✓ Promazine is an antipsychotic.","note":"Promazine is an antipsychotic, not an antibiotic. It treats mental disorders, not bacterial infections."},{"incorrect":"✗ Promazine has no side effects.","correct":"✓ Promazine can have side effects, such as drowsiness.","note":"Like all medications, promazine can have side effects, including drowsiness, dry mouth, and movement disorders."}],"priority":"★★☆"},"related_words":{"derivatives":["chlorpromazine","triflupromazine"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Promazine is a specialized term related to medicine and pharmacology. It is used by healthcare professionals when discussing or prescribing this specific antipsychotic medication. Understanding this term requires knowledge of medical terminology and the classification of drugs. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The patient was given promazine to alleviate symptoms of psychosis.","translation":"その患者は精神病の症状を緩和するためにプロマジンを投与された。","type":"general","meaning_category":"medical use"},{"sentence":"Promazine can cause drowsiness as a side effect.","translation":"プロマジンは副作用として眠気を引き起こすことがある。","type":"general","meaning_category":"side effects"},{"sentence":"The psychiatrist decided to switch the patient from haloperidol to promazine.","translation":"精神科医は患者をハロペリドールからプロマジンに切り替えることを決定した。","type":"general","meaning_category":"medical treatment"}]}