{"word":"thumb-worn","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"（本などが）使い古されて親指でめくった跡がついている、読み込まれて使い込まれた","english_definition":"(of a book or other object) showing signs of wear from being frequently handled, especially from turning pages with the thumb.","examples":[{"sentence":"He picked up a thumb-worn copy of 'Moby Dick'.","translation":"彼は使い古されて親指でめくった跡がついた『白鯨』を手にとった。"},{"sentence":"The old dictionary was thumb-worn and well-loved.","translation":"その古い辞書は使い込まれていて、とても大切にされていた。"},{"sentence":"She cherished the thumb-worn book of fairy tales her grandmother had given her.","translation":"彼女は祖母からもらった、使い古されたおとぎ話の本を大切にしていた。"}],"collocations":["thumb-worn book","thumb-worn copy","thumb-worn edition","thumb-worn pages"],"synonyms":["well-used","dog-eared","worn","handled","used","old","tattered"],"antonyms":["new","unused","pristine","untouched","immaculate"]},{"part_of_speech":"adjective","definition":"（比喩的に）使い古された、ありふれた、陳腐な","english_definition":"(figuratively) hackneyed, trite, or overused.","examples":[{"sentence":"The plot of the movie was thumb-worn and predictable.","translation":"その映画のプロットは使い古されていて、予測可能だった。"},{"sentence":"His arguments were thumb-worn and lacked originality.","translation":"彼の議論はありふれていて、独創性に欠けていた。"}],"collocations":["thumb-worn plot","thumb-worn argument","thumb-worn idea","thumb-worn phrase"],"synonyms":["hackneyed","trite","clichéd","banal","stale","overused"],"antonyms":["original","fresh","novel","innovative"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'thumb' (referring to the digit used to turn pages) and 'worn' (past participle of 'wear', indicating damage or deterioration through use). The combination suggests the specific type of wear caused by frequent handling with the thumb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈθʌm wɔːrn/","syllables":"thumb-worn"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Thumb-worn' is most commonly used to describe books or other printed materials that show signs of frequent use, particularly on the edges of pages where they have been turned with the thumb. It can also be used figuratively to describe ideas or plots that are overused or unoriginal. The term evokes a sense of familiarity and history, suggesting that the object has been read and enjoyed many times.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The thumb-worn chair was comfortable.","correct":"✓ The worn chair was comfortable.","note":"'Thumb-worn' specifically refers to wear caused by handling with the thumb, typically on books or similar items. It's not appropriate for describing general wear on furniture. Use 'worn' instead."},{"incorrect":"✗ He had a thumb-worn feeling about the situation.","correct":"✓ He had a bad feeling about the situation.","note":"'Thumb-worn' is usually used to describe physical objects or ideas. Use other adjectives like 'bad', 'uneasy', or 'suspicious' to describe feelings."}],"priority":"★★☆"},"related_words":{"derivatives":["thumb (noun)","worn (adjective)","wear (verb)"],"related_terms":["dog-eared (similar meaning, referring to the turned-down corners of pages)","well-loved (implies affection and frequent use)","secondhand (used, but not necessarily worn in a specific way)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (The word is not common enough to be included in CEFR vocabulary lists.)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thumb-worn' is a relatively uncommon adjective that describes an object, usually a book, that shows signs of wear from being frequently handled, specifically from turning pages with the thumb. The term suggests that the object has been read and enjoyed many times. It can also be used figuratively to describe ideas or plots that are overused or unoriginal. Understanding this word requires a good vocabulary and the ability to understand figurative language."},"example_sentences":[{"sentence":"The librarian carefully restored the thumb-worn manuscript.","translation":"図書館員は使い古された写本を丁寧に修復した。","type":"adjective","meaning_category":"使い古されて親指でめくった跡がついている"},{"sentence":"The thumb-worn paperback was his constant companion.","translation":"その使い古されたペーパーバックは彼のいつも持ち歩くものだった。","type":"adjective","meaning_category":"使い古されて親指でめくった跡がついている"},{"sentence":"The critic dismissed the play as thumb-worn and uninspired.","translation":"批評家はその劇を使い古されていて、独創性がないと酷評した。","type":"adjective","meaning_category":"（比喩的に）使い古された、ありふれた、陳腐な"}]}