{"word":"ovationary","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"喝采の、称賛の、熱烈な歓迎の","english_definition":"relating to or characterized by ovations; expressing or eliciting enthusiastic applause or praise.","examples":[{"sentence":"The singer received an ovationary welcome from the audience.","translation":"その歌手は聴衆から喝采をもって迎えられた。"},{"sentence":"Her performance was met with an ovationary response.","translation":"彼女の演技は熱烈な歓迎を受けた。"}],"collocations":["ovationary welcome","ovationary applause","ovationary response","ovationary reception"],"synonyms":["acclamatory","laudatory","approving","enthusiastic","rapturous"],"antonyms":["critical","disapproving","unenthusiastic"]}],"etymology":{"value":"The word \"ovationary\" is derived from \"ovation,\" which comes from the Latin word \"ovatio,\" a lesser form of triumphal procession awarded to a military commander. The suffix \"-ary\" indicates relating to or characterized by.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊˈveɪʃənəri/","syllables":"o-va-tion-a-ry"},"inflection":{"notes":"Adjectives do not typically inflect in English, though comparative and superlative forms can be created using 'more' and 'most' or '-er' and '-est' (though this is rare for 'ovationary')."},"usage_notes":{"explanation":"\"Ovationary\" is used to describe something that involves or elicits an ovation, which is a sustained and enthusiastic show of applause. It is often used to describe the reception or welcome given to a performer or speaker. The word is relatively uncommon compared to \"ovation\" itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ovationary was long and loud.","correct":"✓ The ovation was long and loud.","note":"\"Ovationary\" is an adjective, so it should modify a noun. \"Ovation\" is the noun referring to the applause itself."},{"incorrect":"✗ He gave an ovationary speech.","correct":"✓ He gave a speech that received an ovation.","note":"While technically correct, it's more common to say the speech *received* an ovation, rather than describing the speech itself as 'ovationary'."}],"priority":"★★☆"},"related_words":{"derivatives":["ovation (noun): a sustained and enthusiastic show of applause","ovation (verb): to give an ovation"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"ovationary\" describes something related to a strong and enthusiastic display of applause. It's not a commonly used word, so it's more likely to be found in formal writing or speech when describing a performance or event that received a very positive reaction from the audience. It's an adjective, so it modifies a noun, such as 'ovationary welcome' or 'ovationary response.'"},"example_sentences":[{"sentence":"The returning astronaut received an ovationary greeting from the crowd.","translation":"帰還した宇宙飛行士は群衆から喝采の歓迎を受けた。","type":"adjective","meaning_category":"熱烈な歓迎の"},{"sentence":"The play's final scene drew an ovationary reaction from the theatergoers.","translation":"その劇の最後の場面は劇場にいた観客から喝采の反応を引き出した。","type":"adjective","meaning_category":"称賛の"},{"sentence":"The team's victory was met with an ovationary celebration.","translation":"チームの勝利は喝采の祝賀で迎えられた。","type":"adjective","meaning_category":"熱烈な歓迎の"}]}