{"word":"mamba","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"マンバ (毒ヘビの一種)","english_definition":"A highly venomous snake of the genus Dendroaspis, native to sub-Saharan Africa.","examples":[{"sentence":"The black mamba is one of the deadliest snakes in the world.","translation":"ブラックマンバは世界で最も危険なヘビの一種です。"},{"sentence":"Mambas are known for their speed and aggression.","translation":"マンバは、その速度と攻撃性で知られています。"}],"collocations":["black mamba","green mamba","deadly mamba","mamba bite","mamba venom"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(俗語)マリファナ、大麻","english_definition":"(Slang) Marijuana, cannabis.","examples":[{"sentence":"He was caught smoking mamba in the park.","translation":"彼は公園でマンバを吸っているところを捕まりました。"}],"collocations":["smoke mamba","mamba joint"],"synonyms":["weed","pot","ganja","cannabis"],"antonyms":[]}],"etymology":{"value":"The name 'mamba' is believed to be derived from a Zulu word for the snake.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɑːmbə/","syllables":"mam-ba"},"inflection":{"noun_plural":"mambas"},"usage_notes":{"explanation":"The word 'mamba' primarily refers to a venomous snake found in Africa. However, in some slang usage, particularly in certain regions, it can also refer to marijuana. It's important to be aware of the context to understand the intended meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a mamba in my garden, it was so cute!","correct":"✓ I saw a snake in my garden.","note":"Mambas are highly venomous and dangerous. It's unlikely someone would describe seeing one as 'cute.' If you see a snake, especially in a region where mambas are found, it's best to keep a safe distance and contact local authorities or wildlife experts."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":null,"priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'mamba' has two main meanings. Primarily, it refers to a highly venomous snake found in Africa. The black mamba is particularly well-known for its speed and potent venom. However, in some slang contexts, 'mamba' can also refer to marijuana. Therefore, it's crucial to understand the context in which the word is used to determine its intended meaning. If you are discussing wildlife or African fauna, 'mamba' likely refers to the snake. If you are in a context involving drug use, it may refer to marijuana."},"example_sentences":[{"sentence":"The **mamba** struck its prey with incredible speed.","translation":"マンバは信じられないほどの速さで獲物を襲った。","type":"noun","meaning_category":"snake"},{"sentence":"(Slang) He got arrested for possession of **mamba**.","translation":"（俗語）彼はマンバ（マリファナ）所持で逮捕された。","type":"noun","meaning_category":"marijuana"}]}