{"word":"microspectrophotometry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"微小分光測光法","english_definition":"A technique that combines microscopy and spectrophotometry to measure the spectral properties of microscopic samples or regions.","examples":[{"sentence":"Microspectrophotometry is used to analyze the color and composition of individual paint layers in art conservation.","translation":"微小分光測光法は、美術品の保存において、個々の絵具層の色と組成を分析するために使用されます。"},{"sentence":"Microspectrophotometry can be applied to identify pigments in historical textiles.","translation":"微小分光測光法は、歴史的な織物中の顔料を特定するために応用できます。"},{"sentence":"Researchers used microspectrophotometry to study the optical properties of single cells.","translation":"研究者たちは、単一細胞の光学特性を研究するために微小分光測光法を使用しました。"}],"collocations":["UV-Vis microspectrophotometry","Raman microspectrophotometry","Fourier transform infrared (FTIR) microspectrophotometry"],"synonyms":["microspectroscopy","spectral microscopy"],"antonyms":[]}],"etymology":{"value":"The word is formed by combining \"micro-\" (referring to small size), \"spectro-\" (referring to spectrum or spectral analysis), \"photo-\" (referring to light), and \"-metry\" (referring to measurement).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪkroʊˌspektrəʊfoʊˈtɒmətri/","syllables":"mi-cro-spec-tro-pho-tom-e-try"},"inflection":{"noun_plural":"microspectrophotometries"},"usage_notes":{"explanation":"Microspectrophotometry is a specialized analytical technique used in various fields, including materials science, chemistry, biology, and art conservation. It allows for the non-destructive analysis of microscopic samples by measuring the absorption, reflection, or transmission of light as a function of wavelength. The resulting spectra can provide information about the sample's composition, structure, and optical properties.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Microspectrophotometry are used for...","correct":"✓ Microspectrophotometry is used for...","note":"Microspectrophotometry is a singular noun, so it takes a singular verb."}],"priority":"★☆☆"},"related_words":{"derivatives":["microspectrophotometer (noun): An instrument used for microspectrophotometry.","spectrophotometry (noun): The general technique of measuring light absorption and transmission as a function of wavelength."],"related_terms":["microscopy","spectroscopy","spectrometry","absorption spectroscopy","reflection spectroscopy","transmission spectroscopy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Microspectrophotometry is a highly specialized technique used to analyze the spectral properties of very small samples. It combines the principles of microscopy and spectrophotometry, allowing researchers to obtain detailed information about the composition and structure of materials at a microscopic level. This technique is commonly used in fields such as materials science, art conservation, and biology to identify and characterize substances based on their interaction with light. Understanding the term requires knowledge of microscopy and spectrophotometry.","priority":"★★☆"},"example_sentences":[{"sentence":"Microspectrophotometry revealed the presence of a rare pigment in the ancient manuscript.","translation":"微小分光測光法により、古代写本中に希少な顔料の存在が明らかになった。","type":"general","meaning_category":"analysis"},{"sentence":"The researchers used microspectrophotometry to quantify the concentration of chlorophyll in individual plant cells.","translation":"研究者たちは、個々の植物細胞中のクロロフィル濃度を定量化するために微小分光測光法を使用した。","type":"biological","meaning_category":"quantification"},{"sentence":"Microspectrophotometry is a valuable tool for the non-destructive analysis of historical artifacts.","translation":"微小分光測光法は、歴史的遺物の非破壊分析のための貴重なツールです。","type":"art conservation","meaning_category":"preservation"}]}