{"word":"zoophiles","priority":"低","meanings":[{"part_of_speech":"noun","definition":"動物愛好家 (通常は動物との性的関係を持つ人々を指す婉曲表現)","english_definition":"People who are sexually attracted to animals (often a euphemism for people who engage in sexual activity with animals).","examples":[{"sentence":"The term 'zoophiles' is often used to describe individuals who are sexually attracted to animals.","translation":"「zoophiles」という用語は、動物に性的に惹かれる個人を指すためによく使用されます。"},{"sentence":"It is important to distinguish between zoophiles and people who simply love animals.","translation":"zoophilesと単に動物を愛する人々を区別することが重要です。"}],"collocations":["zoophile community","zoophilic attraction","zoophilic behavior"],"synonyms":["bestialist"],"antonyms":[],"notes":"This term is often associated with illegal and harmful activities. The term is controversial and its use can be offensive."}],"etymology":{"value":"'Zoo-' (動物) + '-phile' (愛好家)","priority":"中"},"pronunciation":{"ipa":"/ˈzoʊəˌfaɪlz/","syllables":"zo-o-philes"},"inflection":{"noun_plural":"zoophiles"},"usage_notes":{"explanation":"The term 'zoophiles' is often used in a clinical or academic context to describe individuals who experience sexual attraction to animals. However, it is also used more broadly, sometimes as a pejorative term, to refer to individuals who engage in sexual acts with animals. It is important to note that engaging in sexual acts with animals is illegal and considered animal abuse in many jurisdictions.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"It is okay to be a zoophile if the animal consents.","correct":"Engaging in sexual acts with animals is illegal and harmful, regardless of perceived consent.","note":"Animals cannot give consent, and such acts constitute abuse."}],"priority":"高"},"related_words":{"derivatives":["zoophilia (名詞: 動物への性的嗜好)","zoophilic (形容詞: 動物愛好的な)"],"related_terms":["bestiality (名詞: 動物との性行為)","animal abuse (名詞: 動物虐待)"],"priority":"中"},"level_frequency":{"frequency_google_ngram":"低","priority":"低"},"readability_explanation":{"level":"C2","text":"This term is highly sensitive and should be used with extreme caution. It refers to individuals who are sexually attracted to animals, and is often associated with illegal and harmful behavior. It is important to understand the negative connotations and ethical implications before using this term."},"example_sentences":[{"sentence":"The study examined the psychological profiles of individuals identified as zoophiles.","translation":"その研究は、zoophilesと特定された個人の心理的プロファイルを調査しました。","type":"academic","meaning_category":"animal attraction"},{"sentence":"The discussion around zoophiles often raises ethical concerns about animal welfare.","translation":"zoophilesに関する議論は、動物福祉に関する倫理的な懸念をしばしば提起します。","type":"ethical","meaning_category":"animal attraction"}]}