{"word":"mean-conditioned","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(数学、数値解析)平均条件の、平均的な条件を持つ","english_definition":"(mathematics, numerical analysis) Having a condition number that is neither particularly large nor particularly small; exhibiting a moderate sensitivity to changes in input data.","examples":[{"sentence":"The matrix is mean-conditioned, so the numerical solutions are relatively stable.","translation":"その行列は平均条件なので、数値解は比較的安定しています。"},{"sentence":"A mean-conditioned problem is easier to solve accurately than an ill-conditioned one.","translation":"平均条件の問題は、悪条件の問題よりも正確に解くのが容易です。"}],"collocations":["mean-conditioned matrix (平均条件の行列)","mean-conditioned problem (平均条件の問題)","mean-conditioned system (平均条件の系)"],"synonyms":["well-conditioned","moderately conditioned"],"antonyms":["ill-conditioned","poorly conditioned"]}],"etymology":{"value":"The term is formed by combining \"mean\" (in the sense of average or moderate) with \"conditioned,\" referring to the condition number of a matrix or problem. The condition number quantifies how sensitive the solution of a linear system of equations is to errors in the input data. A mean-conditioned problem has a condition number that is neither too large (indicating high sensitivity) nor too small (indicating low sensitivity).","priority":"★★☆"},"pronunciation":{"ipa":"ˈmiːn kənˈdɪʃənd","syllables":"mean-con-di-tioned"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"In numerical analysis, the condition number of a problem (often represented by a matrix) is a measure of how much the output value of the problem can change for a small change in the input data. A problem is considered well-conditioned if a small change in the input leads to a small change in the output. Conversely, a problem is ill-conditioned if a small change in the input can lead to a large change in the output. A mean-conditioned problem falls in between these two extremes, exhibiting a moderate level of sensitivity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mean-conditioned algorithm failed to converge.","correct":"✓ The algorithm, despite the problem being mean-conditioned, failed to converge.","note":"Mean-conditioned refers to the problem, not the algorithm. The algorithm might fail for other reasons even if the problem is mean-conditioned."}],"priority":"★☆☆"},"related_words":{"derivatives":["condition number (条件数)","conditioning (条件付け)","well-posed (適切に定式化された)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - This term is primarily used in specialized fields such as numerical analysis and applied mathematics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"mean-conditioned\" is used in mathematics and numerical analysis to describe a problem or matrix that has a condition number that is neither too large nor too small. The condition number is a measure of how sensitive the solution to a problem is to changes in the input data. A mean-conditioned problem is easier to solve accurately than an ill-conditioned problem because small changes in the input data will not lead to large changes in the output. This term is typically encountered in advanced mathematical or computational contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The iterative method converged rapidly because the system of equations was mean-conditioned.","translation":"反復法は、方程式系が平均条件であったため、急速に収束しました。","type":"adjective","meaning_category":"mathematical property"},{"sentence":"We chose a different algorithm because the original problem was not mean-conditioned.","translation":"元の問題が平均条件ではなかったので、別のアルゴリズムを選択しました。","type":"adjective","meaning_category":"numerical analysis"}]}