{"word":"self-flagellating","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"自己を鞭打つ、自己を責める、自虐的な","english_definition":"Excessively critical of oneself; characterized by self-punishment or self-criticism.","examples":[{"sentence":"He gave a self-flagellating speech, apologizing for his mistakes.","translation":"彼は自分の過ちを謝罪する、自虐的なスピーチをした。"},{"sentence":"She was self-flagellating after failing the exam.","translation":"彼女は試験に失敗した後、自己を責めていた。"},{"sentence":"The article was a self-flagellating critique of the company's failures.","translation":"その記事は、会社の失敗に対する自虐的な批判だった。"}],"collocations":["self-flagellating behavior (自虐的な行動)","self-flagellating attitude (自虐的な態度)","self-flagellating speech (自虐的なスピーチ)","self-flagellating critique (自虐的な批判)","self-flagellating tendencies (自虐的な傾向)"],"synonyms":["self-critical","self-punishing","self-reproachful","remorseful","contrite","penitent"],"antonyms":["self-satisfied","complacent","arrogant","proud","unrepentant"]}],"etymology":{"value":"The term originates from the literal practice of flagellation, or whipping oneself, often as a form of religious penance. The 'self-' prefix indicates that the action is directed towards oneself.","priority":"★★★"},"pronunciation":{"ipa":"/ˌself fləˈdʒeɪtɪŋ/","syllables":"self-fla-gel-lat-ing"},"inflection":{"notes":"This is an adjective and does not inflect like a verb."},"usage_notes":{"explanation":"'Self-flagellating' describes someone who is excessively critical of themselves, often to the point of being self-destructive. It implies a harsh and relentless inner critic. The term is often used metaphorically, as it refers to the act of whipping oneself as a form of punishment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He was self-flagellating about the weather.","correct":"He was self-flagellating about his performance.","note":"'Self-flagellating' is usually used in the context of personal failures, mistakes, or shortcomings, not external factors like the weather."},{"incorrect":"She is a self-flagellating person, so she is always happy.","correct":"She is a self-flagellating person, so she is often unhappy.","note":"Self-flagellation implies a negative self-perception and is therefore associated with unhappiness or dissatisfaction."}],"priority":"★★☆"},"related_words":{"derivatives":["self-flagellation (noun: 自虐行為、自己批判)","flagellate (verb: 鞭打つ、激しく批判する)","flagellation (noun: 鞭打ち)"],"idioms_phrases":["beat oneself up (over something) (～のことで自分を責める)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-flagellating' is a more advanced term used to describe someone who is excessively critical of themselves. It's not a common word in everyday conversation, but you might encounter it in literature, academic writing, or discussions about psychology or self-improvement. It implies a harsh and relentless inner critic.","priority":"★★☆"},"example_sentences":[{"sentence":"After the project failed, he engaged in a period of intense self-flagellating reflection.","translation":"プロジェクトが失敗した後、彼は激しい自己批判的な反省期間に入った。","type":"adjective","meaning_category":"自己を責める"},{"sentence":"Her self-flagellating tendencies made it difficult for her to accept compliments.","translation":"彼女の自虐的な傾向は、彼女が褒め言葉を受け入れるのを困難にした。","type":"adjective","meaning_category":"自虐的な"},{"sentence":"The author's self-flagellating tone made the book a difficult read.","translation":"著者の自虐的な口調は、その本を読むのを困難にした。","type":"adjective","meaning_category":"自己を責める"}]}