{"word":"litigiosity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"訴訟好き、訴訟を起こしやすい性質、係争性","english_definition":"The quality or state of being excessively inclined to litigate; proneness to engage in lawsuits.","examples":[{"sentence":"The company's litigiosity has made it a target for frivolous lawsuits.","translation":"その会社の訴訟好きの性質が、根拠のない訴訟の標的にさせている。"},{"sentence":"The litigiosity of modern society is a concern for many legal professionals.","translation":"現代社会の訴訟好きの傾向は、多くの法曹関係者にとって懸念事項である。"}],"collocations":["high litigiosity","increased litigiosity","corporate litigiosity"],"synonyms":["contentiousness","disputatiousness","quarrelsomeness","belligerence"],"antonyms":["peaceableness","amicability","conciliation","compromise"]}],"etymology":{"value":"Derived from 'litigious' (inclined to litigation) + '-ity' (a suffix denoting a state or quality). 'Litigious' comes from the Latin 'litigiosus', from 'litigare' (to sue, to quarrel).","priority":"★★☆"},"pronunciation":{"ipa":"/lɪˌtɪdʒɪˈɒsɪti/","syllables":"li-ti-gi-o-si-ty"},"inflection":{"noun_plural":"litigiosities"},"usage_notes":{"explanation":"'Litigiosity' refers to a tendency or eagerness to engage in lawsuits, often seen as excessive or unnecessary. It describes a characteristic of individuals, organizations, or even societies that are quick to resort to legal action to resolve disputes. It often carries a negative connotation, implying that the entity is overly aggressive or unreasonable in pursuing legal remedies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The litigiosity of the case was clear.","correct":"✓ The litigious nature of the case was clear.","note":"'Litigiosity' is a quality, not a description of a specific case. Use 'litigious' to describe the nature of a case. The sentence should describe the 'nature' of the case, not the 'litigiosity' of it."},{"incorrect":"✗ He showed litigiosity towards his neighbor.","correct":"✓ He showed a tendency towards litigiosity with his neighbor.","note":"'Litigiosity' is a state or quality, not a behavior. The sentence should describe a 'tendency' towards the quality of litigiosity."}],"priority":"★☆☆"},"related_words":{"derivatives":["litigious (adjective): inclined to litigation","litigate (verb): to engage in legal proceedings","litigation (noun): the process of taking legal action"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Litigiosity' is a relatively uncommon and complex term that describes a tendency to engage in lawsuits. It's often used in legal or academic contexts to discuss the prevalence of legal disputes in a society or the behavior of individuals or organizations that are quick to resort to legal action. This term implies a negative connotation, suggesting that the person or entity is excessively prone to sue others.","priority":"★☆☆"},"example_sentences":[{"sentence":"The company's high degree of **litigiosity** has earned it a reputation for being difficult to work with.","translation":"その会社の高い訴訟好きの性質は、付き合いにくいという評判を得ている。","type":"noun","meaning_category":"訴訟好き"},{"sentence":"Some argue that the **litigiosity** of American society is a barrier to innovation.","translation":"アメリカ社会の訴訟好きの傾向が、イノベーションの妨げになっていると主張する人もいる。","type":"noun","meaning_category":"係争性"},{"sentence":"The lawyer advised his client to avoid **litigiosity** if possible, and seek alternative dispute resolution methods.","translation":"弁護士は依頼人に、可能であれば訴訟を避け、代替紛争解決手段を検討するように助言した。","type":"noun","meaning_category":"訴訟を起こしやすい性質"}]}