{"word":"camarilla","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(しばしば軽蔑的に) 取り巻き、側近政治家団、陰謀団","english_definition":"a small group of secret advisers or unofficial inner circle, especially in a government or organization; a cabal.","examples":[{"sentence":"The king was surrounded by a camarilla of self-serving nobles.","translation":"王は私欲のために動く貴族たちの取り巻きに囲まれていた。"},{"sentence":"The president's camarilla controlled access to him and influenced his decisions.","translation":"大統領の側近政治家団は彼へのアクセスを管理し、彼の決定に影響を与えた。"},{"sentence":"The old guard formed a camarilla to protect their interests within the company.","translation":"古参幹部たちは社内で自分たちの権益を守るために陰謀団を形成した。"}],"collocations":["inner camarilla","presidential camarilla","power within the camarilla"],"synonyms":["cabal","clique","faction","inner circle","entourage","court","retinue"],"antonyms":["opposition","outsiders","public"],"notes":"Often used with a negative connotation, implying that the group is secretive and manipulative."}],"etymology":{"value":"スペイン語の *camarilla* (小さな部屋、私室) から派生。元々はスペイン国王の私室に出入りする側近たちを指す言葉だった。*cámara* (部屋) の指小辞。ラテン語の *camera* (部屋、アーチ状の天井) に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkæməˈrɪlə/","syllables":"ca-ma-ril-la"},"inflection":{"noun_plural":"camarillas"},"usage_notes":{"explanation":"The word *camarilla* refers to a small, often secretive, group of people who advise a leader, especially if their advice is not officially sanctioned or if they are seen as exerting undue influence. The term often carries a negative connotation, suggesting that the group is self-serving and manipulative.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The camarilla was openly discussing their plans.","correct":"✓ The camarilla was secretly discussing their plans.","note":"Camarillas are typically secretive, so openly discussing plans would be unusual."},{"incorrect":"✗ He was a lone wolf, not part of any camarilla.","correct":"✓ He was a lone wolf, not part of any camarilla.","note":"A camarilla is a group, so a lone wolf would not be part of one."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["cronyism","nepotism","oligarchy","plutocracy"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"camarilla\" is a relatively uncommon term, typically used in political or historical contexts to describe a small, often secretive, group of advisors or insiders who wield significant influence, often behind the scenes. Understanding the negative connotation associated with the term is important. It is not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The prime minister's decisions were heavily influenced by his close-knit camarilla.","translation":"首相の決定は、彼の緊密な取り巻きによって大きく影響された。","type":"example","meaning_category":"取り巻き"},{"sentence":"The reforms were blocked by a powerful camarilla within the government.","translation":"改革は政府内の強力な陰謀団によって阻止された。","type":"example","meaning_category":"陰謀団"},{"sentence":"Critics accused the governor of being controlled by a wealthy camarilla.","translation":"批評家たちは知事が裕福な側近政治家団に操られていると非難した。","type":"example","meaning_category":"側近政治家団"}]}