{"word":"planetesimal","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"微惑星","english_definition":"A minute planet; one of a number of small celestial bodies that are believed to have collided and coalesced to form the planets.","examples":[{"sentence":"Planetesimals are thought to be the building blocks of planets.","translation":"微惑星は惑星の構成要素であると考えられています。"},{"sentence":"The early solar system was filled with planetesimals.","translation":"初期の太陽系は微惑星で満たされていました。"}],"collocations":["form planetesimals","accrete planetesimals","planetesimal formation","planetesimal accretion"],"synonyms":["asteroid","minor planet","protoplanet"],"antonyms":[]}],"etymology":{"value":"From 'planet' + '-esimal' (suffix indicating smallness). Coined to describe the small bodies that are thought to have formed planets.","priority":"★★★"},"pronunciation":{"ipa":"/ˌplænɪˈtɛsɪməl/","syllables":"plan-et-es-i-mal","audio_url":null},"inflection":{"noun_plural":"planetesimals"},"usage_notes":{"explanation":"'Planetesimal' is a technical term used in astronomy and planetary science to describe small bodies that existed in the early solar system. These bodies are believed to have collided and merged to form larger objects, eventually leading to the formation of planets. The term is primarily used in scientific contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The planetesimal was very big like a planet.","correct":"✓ Planetesimals are small, unlike planets.","note":"Planetesimals are much smaller than planets; they are building blocks of planets, not planet-sized objects."}],"priority":"★★☆"},"related_words":{"derivatives":["planetesimal disk"],"related_terms":["planet","protoplanetary disk","accretion disk"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Planetesimal' is a specialized term used in astronomy. It refers to the small objects that existed in the early solar system and eventually combined to form planets. Understanding this term requires some background knowledge of planetary formation. It is not commonly used outside of scientific discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"Computer simulations show how planetesimals can coalesce into protoplanets.","translation":"コンピューターシミュレーションは、微惑星がどのように合体して原始惑星になるかを示しています。","type":"scientific","meaning_category":"formation"},{"sentence":"The study of planetesimals provides insights into the origins of our solar system.","translation":"微惑星の研究は、私たちの太陽系の起源に関する洞察を提供します。","type":"scientific","meaning_category":"study"}]}