{"word":"spectrophone","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"分光音響セル、分光音響検出器","english_definition":"An instrument that measures the absorption of light by a substance by detecting the sound waves produced when the substance is illuminated with pulsed light.","examples":[{"sentence":"The spectrophone is used to measure trace amounts of gases.","translation":"分光音響セルは、微量なガスを測定するために使用されます。"},{"sentence":"The sensitivity of the spectrophone depends on the intensity of the light source.","translation":"分光音響セルの感度は、光源の強度に依存します。"}],"collocations":["photoacoustic spectrophone","laser spectrophone"],"synonyms":["photoacoustic cell","photoacoustic detector"],"antonyms":[]}],"etymology":{"value":"'Spectro-' (from 'spectrum') + '-phone' (from 'sound').","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈspektrəfoʊn/","syllables":"spec-tro-phone"},"inflection":{"noun_plural":"spectrophones"},"usage_notes":{"explanation":"A spectrophone is a scientific instrument used in photoacoustic spectroscopy. It works by shining pulsed light onto a sample and detecting the sound waves generated by the sample's absorption of the light. The intensity of the sound is proportional to the amount of light absorbed, allowing for quantitative measurements of the sample's absorption spectrum.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["spectrophonic","spectroscopy","photoacoustic spectroscopy"],"related_terms":["photoacoustic effect","microphone","laser"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"A spectrophone is a sophisticated scientific instrument used for measuring how much light a substance absorbs. It works by shining pulses of light onto the substance, which then heats up and creates sound waves. By measuring these sound waves, scientists can determine how much light the substance absorbed. This technique is particularly useful for detecting very small amounts of substances, such as pollutants in the air. It's a specialized tool used in fields like environmental science and chemistry.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The researchers used a spectrophone to analyze the composition of the gas sample.","translation":"研究者たちは、ガスサンプルの組成を分析するために分光音響セルを使用しました。","type":"noun","meaning_category":"instrument"},{"sentence":"The spectrophone detected trace amounts of methane in the atmosphere.","translation":"分光音響セルは、大気中の微量のメタンを検出しました。","type":"noun","meaning_category":"instrument"}]}