{"word":"Shigella","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"赤痢菌（せきりきん）","english_definition":"A genus of Gram-negative, nonmotile, rod-shaped bacteria that are closely related to Escherichia coli and cause shigellosis (bacillary dysentery) in humans.","examples":[{"sentence":"Shigella is a common cause of bacterial dysentery.","translation":"赤痢菌は細菌性赤痢の一般的な原因です。"},{"sentence":"Proper hygiene is important to prevent the spread of Shigella.","translation":"赤痢菌の蔓延を防ぐためには、適切な衛生管理が重要です。"}],"collocations":["Shigella infection (赤痢菌感染症)","Shigella dysenteriae (志賀赤痢菌)","Shigella sonnei (ソンネ赤痢菌)","Shigella flexneri (フレキシネル赤痢菌)","Shigella boydii (ボイド赤痢菌)"],"synonyms":["dysentery bacilli"],"antonyms":[]},{"part_of_speech":"noun","definition":"赤痢菌属（せきりきんぞく）","english_definition":"The genus of bacteria containing the Shigella species.","examples":[{"sentence":"The genus Shigella belongs to the family Enterobacteriaceae.","translation":"赤痢菌属は、腸内細菌科に属します。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Kiyoshi Shiga, a Japanese bacteriologist who first discovered Shigella dysenteriae in 1897.","priority":"★★★"},"pronunciation":{"ipa":"/ʃɪˈɡɛlə/","syllables":"Shi-gel-la"},"inflection":{"noun_plural":"Shigellae (less common: Shigellas)"},"usage_notes":{"explanation":"Shigella is a genus of bacteria that causes shigellosis, also known as bacillary dysentery. It is highly contagious and spread through the fecal-oral route, often via contaminated food or water. Symptoms include diarrhea (often bloody), fever, stomach cramps, and tenesmus. Antibiotics are often used to treat shigellosis, but resistance is increasing. Prevention relies on good hygiene practices, such as frequent handwashing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Shigella is a virus.","correct":"✓ Shigella is a bacterium.","note":"Shigella is a type of bacteria, not a virus."},{"incorrect":"✗ Shigella causes the common cold.","correct":"✓ Shigella causes dysentery (shigellosis).","note":"Shigella causes dysentery, not the common cold."}],"priority":"★★☆"},"related_words":{"derivatives":["shigellosis (赤痢菌症)","shiga toxin (志賀毒素)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in medical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shigella' refers to a specific type of bacteria responsible for causing dysentery, also known as shigellosis. Understanding this term is important in medical and public health contexts, particularly when discussing infectious diseases, food safety, and hygiene practices. It's crucial to remember that Shigella is a bacterium, not a virus, and that it causes dysentery, not other common illnesses like the cold or flu. The term is primarily encountered in scientific literature, medical discussions, or public health advisories related to disease prevention and control."},"example_sentences":[{"sentence":"The outbreak was traced back to food contaminated with Shigella.","translation":"その集団発生は、赤痢菌に汚染された食品に遡って突き止められました。","type":"general","meaning_category":"cause of disease"},{"sentence":"Shigella infection is more common in areas with poor sanitation.","translation":"赤痢菌感染症は、衛生状態の悪い地域でより一般的です。","type":"general","meaning_category":"epidemiology"},{"sentence":"Diagnosis of Shigella involves culturing stool samples.","translation":"赤痢菌の診断には、便の培養検査が含まれます。","type":"medical","meaning_category":"diagnosis"}]}