{"word":"bustlingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"せわしなく、活気にあふれて、賑やかに","english_definition":"in a busy and energetic manner; full of activity and noise.","examples":[{"sentence":"The market was bustlingly alive with vendors and shoppers.","translation":"市場は露店商と買い物客で活気にあふれ、賑やかだった。"},{"sentence":"She bustlingly prepared breakfast for the family.","translation":"彼女は家族のためにせわしなく朝食を準備した。"},{"sentence":"The city streets were bustlingly crowded during the festival.","translation":"祭りの間、都市の通りは賑やかに混雑していた。"}],"collocations":["bustlingly active","bustlingly busy","bustlingly crowded","bustlingly alive"],"synonyms":["busily","energetically","actively","vibrantly","briskly","lively","hecticly"],"antonyms":["leisurely","quietly","calmly","peacefully","slowly"]}],"etymology":{"value":"\"Bustling\" + \"-ly\". \"Bustling\" is from \"bustle\" (to move or act with energetic and noisy activity), which is likely imitative in origin.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʌslɪŋli/","syllables":"bus-tling-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"\"Bustlingly\" describes actions or environments characterized by energetic activity and busyness. It conveys a sense of liveliness and often implies a degree of hurriedness or excitement. While grammatically correct, it's less common than \"busily\" or \"in a bustling manner,\" and its use can sometimes sound slightly formal or affected.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city was bustlingly.","correct":"✓ The city was bustling. / ✓ The city was bustlingly alive.","note":"\"Bustlingly\" is an adverb and should modify a verb or adjective, not stand alone as a predicate adjective. Use the adjective \"bustling\" instead to describe the city directly, or use \"bustlingly\" to modify another adjective like \"alive\" or \"busy\"."},{"incorrect":"✗ She worked bustlingly her job.","correct":"✓ She worked bustlingly at her job. / ✓ She worked on her job bustlingly.","note":"When using \"bustlingly\" to modify a verb related to work, ensure the sentence structure is correct. It's more natural to say \"She worked bustlingly at her job\" or rearrange the sentence to place \"bustlingly\" closer to the verb it modifies."}],"priority":"★★☆"},"related_words":{"derivatives":["bustling (adjective)","bustle (verb, noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Bustlingly\" is an adverb that describes something done in a busy, energetic, and often noisy way. It's not a very common word, so it's more likely to be found in formal writing or when someone wants to create a vivid image of activity. If you want to say something is done in a busy way, \"busily\" is a more common and simpler alternative."},"example_sentences":[{"sentence":"The restaurant was bustlingly full of customers during lunchtime.","translation":"昼食時、レストランはせわしなく客でいっぱいだった。","type":"adverb","meaning_category":"活気にあふれて"},{"sentence":"He bustlingly moved through the crowd, trying to catch his train.","translation":"彼は電車に間に合うように、人混みをせわしなく動き回った。","type":"adverb","meaning_category":"せわしなく"},{"sentence":"The port was bustlingly active with ships arriving and departing.","translation":"港は船の出入りで活気にあふれ、賑やかだった。","type":"adverb","meaning_category":"賑やかに"}]}