{"word":"sandbars","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"砂州（さす）","english_definition":"Submerged or partly exposed ridge of sand or gravel built up by the action of waves or currents, usually near a shore.","examples":[{"sentence":"The sandbars made it difficult for the boat to navigate close to the shore.","translation":"砂州のせいで、ボートが海岸近くを航行するのが困難になった。"},{"sentence":"Seagulls rested on the sandbars during low tide.","translation":"カモメは干潮時に砂州で休んでいた。"}],"collocations":["form sandbars (砂州を形成する)","navigate sandbars (砂州を航行する)","walk on sandbars (砂州を歩く)","sandbars at low tide (干潮時の砂州)"],"synonyms":["shoal","reef","bank","sandbank"],"antonyms":["channel","deep water"],"notes":"'Sandbars' is the plural form of 'sandbar'"}],"etymology":{"value":"'Sand' + 'bar'. 'Sand' refers to the granular material, and 'bar' refers to a ridge or obstruction.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsændbɑːrz/","syllables":"sand-bars"},"inflection":{"noun_plural":"sandbars"},"usage_notes":{"explanation":"Sandbars are typically formed by the deposition of sediment carried by water currents or waves. They can be temporary or relatively stable features, and they often shift and change shape over time due to erosion and deposition. Sandbars are often found in coastal areas, rivers, and estuaries. They can be hazardous to navigation but also provide habitat for various marine organisms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sandbar was made of rocks.","correct":"✓ The sandbar was made of sand.","note":"Sandbars are primarily composed of sand, not rocks."},{"incorrect":"✗ Sandbars are always visible.","correct":"✓ Sandbars can be submerged or partly exposed.","note":"Sandbars may be fully submerged, especially during high tide."}],"priority":"★★☆"},"related_words":{"derivatives":["sandbar (singular form)"],"phrases":["tidal sandbars (潮汐砂州)","offshore sandbars (沖合砂州)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Sandbars' refers to ridges of sand that build up in water, often near a shore. They can be partly visible or completely underwater. The word is most often used when discussing coastal geography, navigation, or marine ecosystems. It's a relatively specialized term, so it's more common in writing or discussions about these specific topics."},"example_sentences":[{"sentence":"The shallow water over the sandbars made it a popular spot for wading.","translation":"砂州の上の浅瀬は、水遊びをするのに人気の場所だった。","type":"general"},{"sentence":"The shifting sandbars posed a challenge to the harbor pilots.","translation":"移動する砂州は、港のパイロットにとって課題となっていた。","type":"specific"},{"sentence":"Coastal erosion is threatening the stability of the sandbars.","translation":"海岸浸食が砂州の安定性を脅かしている。","type":"environmental"}]}