{"word":"hormone-boosted","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ホルモンを投与された、ホルモン促進された","english_definition":"Having had hormones artificially increased or enhanced, typically to promote growth or performance.","examples":[{"sentence":"The athlete was accused of using hormone-boosted supplements.","translation":"その運動選手は、ホルモン促進サプリメントを使用したとして告発された。"},{"sentence":"Some farmers use hormone-boosted feed to increase livestock production.","translation":"家畜生産を増やすために、ホルモン促進飼料を使用する農家もいる。"}],"collocations":["hormone-boosted supplements","hormone-boosted feed","hormone-boosted meat"],"synonyms":["hormone-enhanced","hormone-treated","hormone-injected"],"antonyms":["hormone-free","natural"]},{"part_of_speech":"adjective","definition":"ホルモンが促進された、ホルモンによって強化された","english_definition":"Enhanced or stimulated by hormones, often implying an artificial or unnatural increase.","examples":[{"sentence":"The hormone-boosted growth of the plant was evident in its rapid development.","translation":"その植物のホルモン促進された成長は、急速な発達に明らかだった。"},{"sentence":"The product claims to provide hormone-boosted energy levels.","translation":"その製品は、ホルモンによって促進されたエネルギーレベルを提供すると主張している。"}],"collocations":["hormone-boosted growth","hormone-boosted energy"],"synonyms":["hormone-stimulated","hormone-enhanced","hormonally-enhanced"],"antonyms":["unstimulated","natural"]}],"etymology":{"value":"A compound adjective formed by combining \"hormone\" (a regulatory biochemical) and \"boosted\" (increased or enhanced).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɔːrmoʊn ˌbuːstɪd/","syllables":"hor-mone-boost-ed"},"inflection":{"notes":"Adjective, no inflection"},"usage_notes":{"explanation":"The term \"hormone-boosted\" typically carries a connotation of artificial enhancement, often implying that the increase in hormones is not natural or organic. It is frequently used in contexts related to agriculture, sports, and health products.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hormone-boosted is good for you.","correct":"✓ Hormone-boosted products are not always good for you.","note":"\"Hormone-boosted\" is an adjective and needs to modify a noun. It cannot stand alone as a subject. "},{"incorrect":"✗ He felt hormone-boosted after eating the salad.","correct":"✓ He felt energized after eating the salad.","note":"\"Hormone-boosted\" implies an artificial or unnatural enhancement. If the energy comes from natural food, use a different term like \"energized\"."}],"priority":"★★☆"},"related_words":{"derivatives":["hormone","boosted","hormonally"],"phrasal_verbs":[],"related_terms":["hormone therapy","growth hormone","anabolic steroids","performance-enhancing drugs"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"hormone-boosted\" is technical and specific, usually found in contexts discussing agriculture, sports, or health. It implies that hormones have been artificially increased to enhance growth or performance. Understanding the term requires knowledge of hormones and their effects on the body or on plant growth. It is not a commonly used term in everyday conversation."},"example_sentences":[{"sentence":"The company markets hormone-boosted chicken as a premium product.","translation":"その会社はホルモンを投与された鶏肉を高級製品として販売している。","type":"adjective","meaning_category":"ホルモンを投与された"},{"sentence":"The athlete denied using any hormone-boosted substances to improve his performance.","translation":"その運動選手は、パフォーマンスを向上させるためにホルモン促進物質を使用したことを否定した。","type":"adjective","meaning_category":"ホルモン促進された"}]}