{"word":"Planckian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"プランクの法則に従う、またはプランクの法則に関連する。","english_definition":"Relating to or following Planck's law.","examples":[{"sentence":"The radiation emitted by a black body is Planckian.","translation":"黒体から放射される放射はプランク的である。"},{"sentence":"The spectrum of the light source was found to be Planckian.","translation":"その光源のスペクトルはプランク的であることがわかった。"}],"collocations":["Planckian distribution","Planckian spectrum","Planckian radiation"],"synonyms":["blackbody","thermal"],"antonyms":[],"notes":"Often used in the context of blackbody radiation or thermal equilibrium."}],"etymology":{"value":"Named after Max Planck, the German physicist who originated quantum theory.","priority":"★★★"},"pronunciation":{"ipa":"/ˈplæŋkiən/","syllables":"Planck-i-an"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Planckian' describes something that adheres to Planck's law, often related to blackbody radiation. It's a term used in physics, particularly in discussions of thermal radiation and quantum mechanics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The temperature was Planckian.","correct":"✓ The radiation was Planckian.","note":"Planckian describes radiation or spectra, not temperature directly. While related to temperature, it's not a direct descriptor."}],"priority":"★★☆"},"related_words":{"derivatives":["Planck (noun, referring to Max Planck or Planck's constant)","Planck's law (noun, the law describing blackbody radiation)","Planck constant (noun, a fundamental physical constant)"],"related_terms":["blackbody radiation","thermal radiation","quantum mechanics","spectral radiance"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Planckian' is a technical term used in physics to describe phenomena that follow Planck's law, particularly in the context of blackbody radiation. It's primarily encountered in scientific literature and discussions related to quantum mechanics and thermal physics. Understanding requires familiarity with these concepts."},"example_sentences":[{"sentence":"The observed spectrum closely matched a Planckian distribution.","translation":"観測されたスペクトルは、プランク分布とほぼ一致した。","type":"scientific","meaning_category":"physics"},{"sentence":"The filament emitted Planckian radiation when heated.","translation":"そのフィラメントは加熱されるとプランク放射を放出した。","type":"scientific","meaning_category":"physics"}]}