{"word":"Chromatology","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"色彩学、色の科学","english_definition":"The science of colors; the study of colors including their physical properties, perception, and psychological effects.","examples":[{"sentence":"Chromatology is used in various fields, including art, design, and psychology.","translation":"色彩学は、芸術、デザイン、心理学を含む様々な分野で使用されています。"},{"sentence":"The artist had a deep understanding of chromatology, which allowed him to create stunning color combinations.","translation":"その芸術家は色彩学に対する深い理解を持っており、それによって見事な色の組み合わせを作り出すことができました。"}],"collocations":["applied chromatology","theoretical chromatology","principles of chromatology"],"synonyms":["color science","color theory","coloristics"],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史的な用法) 色彩療法","english_definition":"(historical) The use of colors to treat diseases; color therapy.","examples":[{"sentence":"In the past, chromatology was sometimes associated with practices like color therapy.","translation":"過去には、色彩学は色彩療法のような実践と関連付けられることがありました。"}],"collocations":["color therapy","light therapy"],"synonyms":["color therapy"],"antonyms":[]}],"etymology":{"value":"From Greek 'chroma' (color) + '-logy' (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkroʊməˈtɒlədʒi/","syllables":"chro-ma-tol-o-gy"},"inflection":{"noun_plural":"chromatologies"},"usage_notes":{"explanation":"Chromatology is primarily the scientific study of color. While historically it may have been linked to practices like color therapy, its modern usage is more focused on the physics, perception, and psychology of color.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Chromatology is the same as colorimetry.","correct":"✓ Chromatology encompasses a broader study of color than colorimetry, which is specifically the measurement of color.","note":"Chromatology is a broader field than colorimetry, which focuses specifically on color measurement."}],"priority":"★★☆"},"related_words":{"derivatives":["chromatic","achromatic","polychromatic"],"related_terms":["colorimetry","spectroscopy","optics","color psychology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Chromatology is a specialized term referring to the science of color. It's used in academic and professional contexts related to art, design, and science. The word itself is derived from Greek roots and implies a systematic study of color properties and effects."},"example_sentences":[{"sentence":"The course covered the fundamentals of chromatology, including color mixing and perception.","translation":"そのコースでは、色彩学の基礎を学びました。色の混合や知覚などです。","type":"general","meaning_category":"色彩学"},{"sentence":"Advanced chromatology techniques are used to analyze the composition of pigments in ancient artworks.","translation":"高度な色彩学技術は、古代美術品の顔料の組成を分析するために使用されます。","type":"technical","meaning_category":"色彩学"}]}