{"word":"Kaffirs","priority":"★☆☆","warning":{"severity":"high","message":"This term is considered highly offensive and racially derogatory in contemporary usage. It was historically used as a racial slur against Black Africans, particularly in South Africa. Its use is now widely condemned and may be illegal in some contexts under hate speech laws."},"meanings":[{"part_of_speech":"noun","historical_definition":"(Historical, now offensive) Term used in colonial contexts to refer to Black African people, particularly in South Africa","english_definition":"An offensive racial slur historically used to refer to Black Africans, especially in South African contexts","examples":[{"sentence":"(Historical context only) 19th century colonial documents sometimes referred to indigenous groups as 'Kaffirs'.","translation":"19世紀の植民地文書では先住民族を「カフィール」と呼ぶことがあった"}],"notes":"This term originates from Arabic 'kāfir' (unbeliever), but developed into a racial slur under colonialism. Its use today would be considered extremely inflammatory and racist."},{"part_of_speech":"noun","historical_definition":"(Obsolete finance) Term formerly used in London stock exchange for South African mining shares","english_definition":"Historical term for South African mining company stocks (late 19th-early 20th century)","examples":[{"sentence":"(Historical financial context) 'Kaffirs' were actively traded on the London exchange until the 1950s.","translation":"「カフィール株」は1950年代までロンドン取引所で活発に取引されていた"}],"notes":"Even in financial contexts, this usage became obsolete due to the term's offensive connotations"}],"etymology":{"value":"From Arabic 'kāfir' (كافر) meaning 'unbeliever' or 'infidel'. Originally used by Arab traders, then adopted by European colonists in Africa with increasingly derogatory racial connotations.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkæfər/","syllables":"Kaf-firs"},"usage_notes":{"explanation":"This term should be avoided in all modern contexts. When encountered in historical documents, it should be properly contextualized as a racial slur. In South Africa, its use could violate hate speech laws under the Promotion of Equality and Prevention of Unfair Discrimination Act.","priority":"★★★"},"modern_alternatives":[{"context":"Referring to people","alternatives":["South Africans","Black South Africans","specific ethnic group names (e.g., Zulu, Xhosa)"]},{"context":"Historical financial terms","alternatives":["South African mining shares","SA mining stocks"]}],"legal_status":[{"country":"South Africa","status":"Considered hate speech under the Promotion of Equality and Prevention of Unfair Discrimination Act (2000)"},{"country":"Other jurisdictions","status":"May violate anti-discrimination or hate speech laws depending on context"}],"level_frequency":{"CEFR":"Not applicable (term should not be actively learned or used)","frequency_google_ngram":"Sharp decline after mid-20th century; near-zero in contemporary usage","notes":"Appears primarily in historical texts or discussions about racism"},"recommendation":{"priority":"★★★","message":"This term should not be used in any context other than academic discussions of historical racism or colonialism. Even then, it requires careful contextualization and trigger warnings. Modern alternatives should always be preferred."}}