{"word":"Dadoes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"腰羽目、壁の下部の装飾","english_definition":"The lower part of an interior wall, often decorated differently from the upper part.","examples":[{"sentence":"The dadoes in the old house were beautifully carved.","translation":"その古い家の腰羽目は美しく彫刻されていた。"}],"collocations":["wooden dadoes","painted dadoes","install dadoes"],"synonyms":["wainscot","paneling","skirting board"],"antonyms":[]}],"etymology":{"value":"From French 'dossier' (back of a seat), ultimately from Latin 'dorsum' (back). The architectural term likely arose from the resemblance of the wall section to the back of a seat.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdeɪ.doʊz/","syllables":"day-doze"},"inflection":{"noun_plural":"dadoes"},"usage_notes":{"explanation":"'Dadoes' refers to the plural form of 'dado', which is a specific architectural feature. It is less commonly used in everyday conversation but is important in architectural and interior design contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dadoes are very high on the wall.","correct":"✓ The dado is very high on the wall.","note":"Use 'dado' for a singular instance, 'dadoes' for plural."}],"priority":"★☆☆"},"related_words":{"derivatives":["dado (singular form)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dadoes' is a specialized architectural term referring to the lower part of an interior wall when it is decorated differently from the upper part. It is not commonly used outside of contexts related to architecture, interior design, or historical buildings. Understanding the term requires some familiarity with architectural vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The restored Victorian house features original dadoes in the hallway.","translation":"修復されたビクトリア朝の家には、玄関ホールにオリジナルの腰羽目がある。","type":"noun","meaning_category":"腰羽目"},{"sentence":"They decided to paint the dadoes a contrasting color to highlight the architectural detail.","translation":"彼らは建築のディテールを強調するために、腰羽目を対照的な色で塗ることにした。","type":"noun","meaning_category":"腰羽目"}]}