{"word":"bacteriopsonic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Relating to or utilizing sound or ultrasound to affect bacteria, especially for diagnostic or therapeutic purposes.","english_definition":"Relating to or utilizing sound or ultrasound to affect bacteria, especially for diagnostic or therapeutic purposes.","examples":[{"sentence":"The bacteriopsonic device was used to disrupt the bacterial biofilm.","translation":"そのバクテリオプソニック装置は、細菌バイオフィルムを破壊するために使用されました。"},{"sentence":"Bacteriopsonic methods offer a non-invasive approach to bacterial detection.","translation":"バクテリオプソニック法は、細菌検出への非侵襲的なアプローチを提供します。"}],"collocations":["bacteriopsonic device","bacteriopsonic method","bacteriopsonic treatment"],"synonyms":["sonobactericidal","acoustic bacteriology"],"antonyms":[]}],"etymology":{"value":"A combination of 'bacteria' and 'opsonic', where 'opsonic' refers to the use of sound or ultrasound.","priority":"★★★"},"pronunciation":{"ipa":"/bækˌtɪəri.oʊˈsɒnɪk/","syllables":"bac-te-ri-o-spon-ic"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"The term 'bacteriopsonic' is primarily used in scientific and medical contexts to describe technologies or methods that use sound waves, particularly ultrasound, to interact with bacteria. This interaction can be for various purposes, including disrupting bacterial structures, enhancing the effectiveness of antibiotics, or detecting the presence of bacteria.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bacteriopsonic is used for viruses.","correct":"✓ The bacteriopsonic method is used for bacteria.","note":"Bacteriopsonic methods specifically target bacteria, not viruses."}],"priority":"★☆☆"},"related_words":{"derivatives":["bacteriopsonification (noun: the process of using sound to affect bacteria)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bacteriopsonic' is a technical term used in microbiology and medical fields. It describes the use of sound or ultrasound to interact with bacteria for diagnostic or therapeutic purposes. Understanding this term requires familiarity with scientific concepts related to acoustics and bacteriology."},"example_sentences":[{"sentence":"The research team is exploring bacteriopsonic techniques to combat antibiotic-resistant bacteria.","translation":"研究チームは、抗生物質耐性菌と闘うためのバクテリオプソニック技術を研究しています。","type":"general","meaning_category":"scientific research"},{"sentence":"Bacteriopsonic therapy shows promise in treating localized bacterial infections.","translation":"バクテリオプソニック療法は、局所的な細菌感染症の治療に有望性を示しています。","type":"medical","meaning_category":"medical treatment"}]}