{"word":"empicture","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"To create a picture or image of something in the mind; to imagine vividly.","english_definition":"To form a mental image of; to imagine vividly.","examples":[{"sentence":"I tried to empicture the scene as he described it.","translation":"彼が説明した場面を心に描こうとした。"},{"sentence":"Can you empicture what life will be like in the future?","translation":"未来の生活がどのようなものになるか想像できますか？"}],"collocations":["empicture the scene","empicture the future","empicture a possibility"],"synonyms":["imagine","envision","visualize","picture","conceive"],"antonyms":["disregard","ignore","overlook"]}],"etymology":{"value":"A blend of 'em-' (meaning 'to put into' or 'to cause to be') and 'picture'. The 'em-' prefix is often used to form verbs from nouns, indicating the act of putting something into a particular state or form.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˈpɪktʃər/","syllables":"im-pic-ture"},"inflection":{"verb_forms":{"present_simple":["empicture","empictures"],"past_simple":"empictured","past_participle":"empictured","present_participle":"empicturing"}},"usage_notes":{"explanation":"'Empicture' is a relatively rare and somewhat archaic verb. It is used to describe the act of forming a mental image or visualizing something in great detail. It is often used when trying to imagine something abstract or something that is not directly visible. While 'imagine' and 'visualize' are more common, 'empicture' can add a sense of vividness and detail to the act of mental imagery.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I empictured to go to the beach.","correct":"✓ I empictured myself at the beach.","note":"'Empicture' typically takes a direct object representing the thing being visualized, not an infinitive phrase. Use a reflexive pronoun if needed to clarify the subject's role in the image."},{"incorrect":"✗ She empictures the reality.","correct":"✓ She empictures the possibility.","note":"'Empicture' is often used for things that are not real or certain, such as possibilities, scenarios, or abstract concepts. For existing realities, 'see' or 'observe' would be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["picture","pictorial","picturesque"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Empicture' is a relatively uncommon and somewhat formal verb that means to form a mental image of something, or to imagine it vividly. It is not part of everyday language and is more likely to be found in literature or formal writing. Because of its rarity, it is best used when a more vivid or detailed sense of imagination is intended. It is important to ensure that the context clearly supports the use of this less common verb, as more common alternatives like 'imagine' or 'visualize' are often preferred.","priority":"★★☆"},"example_sentences":[{"sentence":"The author used vivid language to help readers empicture the fantastical world.","translation":"著者は、読者が幻想的な世界を鮮明に思い描けるように、鮮やかな言葉を使った。","type":"verb","meaning_category":"imagine vividly"},{"sentence":"I tried to empicture the concert hall filled with music and applause.","translation":"音楽と拍手で満たされたコンサートホールを想像しようとした。","type":"verb","meaning_category":"form a mental image"},{"sentence":"She could empicture herself living in a small cottage by the sea.","translation":"彼女は海のそばの小さなコテージに住んでいる自分の姿を思い描くことができた。","type":"verb","meaning_category":"visualize"},{"sentence":"Empicture the possibilities if we invest in this new technology.","translation":"この新しい技術に投資すれば、どんな可能性があるか想像してみてください。","type":"verb","meaning_category":"envision"}]}