{"word":"genitival","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"属格の、所有格の","english_definition":"relating to or functioning as a genitive case.","examples":[{"sentence":"The 's in 'John's car' is a genitival marker.","translation":"「John's car」の「's」は属格の標識です。"},{"sentence":"Genitival constructions indicate possession or relationship.","translation":"属格構文は所有または関係を示します。"}],"collocations":["genitival case (属格)","genitival construction (属格構文)","genitival marker (属格標識)"],"synonyms":["possessive"],"antonyms":[]}],"etymology":{"value":"From 'genitive' + '-al'. 'Genitive' comes from Latin 'genitivus', meaning 'relating to generation or birth', and later 'denoting source or origin'. The grammatical sense developed from the idea of the case denoting the source or possessor.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒɛnɪˈtaɪvəl/","syllables":"ge-ni-ti-val"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative forms, which are rare for 'genitival'."},"usage_notes":{"explanation":"'Genitival' is a term used in grammar to describe something related to the genitive case, which typically indicates possession, origin, or relationship. It's most often used in linguistic discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The genitival form is used for plural nouns only.","correct":"✓ The genitival form is used for both singular and plural nouns.","note":"The genitive (possessive) form can be used with both singular and plural nouns, although the way it's formed differs slightly (e.g., 'John's car' vs. 'the students' books')."}],"priority":"★★☆"},"related_words":{"derivatives":["genitive (noun, adjective)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'genitival' is a technical term used in the field of linguistics, specifically grammar. It refers to anything related to the genitive case, which is a grammatical case that typically indicates possession, origin, or relationship. Because it's a specialized term, it's not commonly used outside of discussions about grammar. Understanding the word requires familiarity with grammatical concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The genitival suffix indicates ownership in this language.","translation":"この言語では、属格接尾辞が所有権を示します。","type":"adjective","meaning_category":"属格の"},{"sentence":"The genitival relationship between the two nouns is clear.","translation":"2つの名詞間の属格関係は明らかです。","type":"adjective","meaning_category":"属格の"}]}