{"word":"soliquid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A substance that exhibits properties of both solids and liquids.","english_definition":"A substance that exhibits properties of both solids and liquids.","examples":[{"sentence":"The new material was described as a soliquid, flowing slowly but retaining its shape.","translation":"その新しい物質は、ゆっくりと流れるが形状を保持する、ソリキッドとして説明された。"}],"collocations":[],"synonyms":["semisolid","gel","slurry"],"antonyms":["solid","liquid"]}],"etymology":{"value":"A portmanteau of 'solid' and 'liquid', reflecting the combined properties of the substance.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɒlɪkwɪd/","syllables":"so-li-quid"},"inflection":{"noun_plural":"soliquids"},"usage_notes":{"explanation":"The term 'soliquid' is relatively new and not widely used. It typically refers to materials that don't fit neatly into the traditional categories of solid or liquid, often exhibiting characteristics of both. Examples might include certain gels, slurries, or other complex fluids.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The soliquid was completely hard.","correct":"✓ The soliquid had a firm consistency.","note":"Using 'completely hard' contradicts the nature of a soliquid, which should exhibit some liquid-like properties."},{"incorrect":"✗ The soliquid flowed like water.","correct":"✓ The soliquid flowed slowly, like a thick gel.","note":"Saying it flows 'like water' suggests it's purely liquid, whereas a soliquid has a more viscous or semi-solid flow."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["semisolid","thixotropy","rheology","non-Newtonian fluid"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical term, not in standard CEFR vocabulary)","frequency_google_ngram":"Low frequency (Relatively rare term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Soliquid' is a technical term used to describe a substance that has properties of both solids and liquids. It's not a common word and is typically used in scientific or technical contexts. Understanding the term requires knowledge of material science and fluid dynamics. Examples might include certain types of gels or slurries. The word is formed by combining 'solid' and 'liquid'. "},"example_sentences":[{"sentence":"The researchers studied the behavior of the soliquid under different pressures.","translation":"研究者たちは、異なる圧力下でのソリキッドの挙動を研究した。","type":"noun","meaning_category":"material science"},{"sentence":"This novel soliquid material could have applications in drug delivery systems.","translation":"この新しいソリキッド材料は、薬物送達システムに応用できる可能性がある。","type":"noun","meaning_category":"material science"}]}