{"word":"orangeleaf","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学) オレンジ色の葉を持つ植物、特に特定の品種や栽培品種を指す","english_definition":"(botany) A plant with orange-colored leaves, especially referring to specific varieties or cultivars.","examples":[{"sentence":"The 'Sunset' maple is a popular orangeleaf variety.","translation":"「サンセット」カエデは人気のあるオレンジ色の葉の品種です。"},{"sentence":"The garden featured a striking contrast between the green foliage and the orangeleaf accents.","translation":"その庭園は、緑の葉とオレンジ色の葉のアクセントの印象的なコントラストが特徴でした。"}],"collocations":["orangeleaf maple","orangeleaf cultivar","orangeleaf foliage"],"synonyms":["copperleaf","bronzeleaf"],"antonyms":["greenleaf"]},{"part_of_speech":"adjective","definition":"オレンジ色の葉を持つ","english_definition":"Having orange-colored leaves.","examples":[{"sentence":"The orangeleaf trees stood out against the autumn sky.","translation":"オレンジ色の葉の木々は秋の空に映えていた。"},{"sentence":"We planted several orangeleaf shrubs to add color to the garden.","translation":"庭に彩りを添えるために、オレンジ色の葉の低木をいくつか植えました。"}],"collocations":["orangeleaf tree","orangeleaf shrub"],"synonyms":["orange-leaved"],"antonyms":["green-leaved"]}],"etymology":{"value":"'Orange' + 'leaf'. Describes the color of the leaf.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɔrɪndʒˌliːf/","syllables":"or-ange-leaf"},"inflection":{"noun_plural":"orangeleaves"},"usage_notes":{"explanation":"The term 'orangeleaf' is primarily used in botanical or horticultural contexts to describe plants that naturally have orange-colored leaves or have been bred to exhibit this characteristic. It can refer to a specific cultivar name or a general description.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The orangeleaf is very tasty.","correct":"✓ The orangeleaf tree is very beautiful.","note":"'Orangeleaf' refers to the leaves' color, not edibility. Ensure the context is related to visual appearance or botany."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Orangeleaf' is a compound word used in botanical contexts to describe plants with orange-colored leaves. It is relatively uncommon in general conversation but may be encountered in gardening books, plant catalogs, or scientific descriptions of flora. Understanding the term requires familiarity with basic botanical terminology and color descriptors."},"example_sentences":[{"sentence":"The nursery specializes in unusual cultivars, including several varieties of orangeleaf maples.","translation":"その苗床は珍しい栽培品種を専門としており、オレンジ色の葉のカエデのいくつかの品種も含まれています。","type":"noun","meaning_category":"植物学"},{"sentence":"The orangeleaf foliage provided a warm contrast to the cool blues of the surrounding flowers.","translation":"オレンジ色の葉は、周囲の花々の涼しげな青色との温かいコントラストを提供しました。","type":"adjective","meaning_category":"植物学"}]}