{"word":"firespout","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"火災旋風、火炎竜巻","english_definition":"A whirling column of flames and hot air, resembling a tornado, that occurs during intense wildfires or other large fires.","examples":[{"sentence":"The firespout ripped through the forest, leaving a trail of destruction.","translation":"火災旋風が森林をなぎ倒し、破壊の跡を残した。"},{"sentence":"Witnesses described a terrifying firespout rising hundreds of feet into the air.","translation":"目撃者たちは、数百フィートも空に舞い上がる恐ろしい火災旋風について語った。"},{"sentence":"Firespouts are a rare but dangerous phenomenon associated with wildfires.","translation":"火災旋風は、山火事に関連するまれだが危険な現象である。"}],"collocations":["deadly firespout","massive firespout","rare firespout","wildfire firespout","form a firespout","witness a firespout"],"synonyms":["fire tornado","fire whirl","fire devil"],"antonyms":[]},{"part_of_speech":"noun","definition":"(比喩的に) 激しい怒りや破壊的な力の爆発","english_definition":"(figuratively) A sudden and intense outburst of anger or destructive force.","examples":[{"sentence":"His speech was a firespout of criticism against the government.","translation":"彼の演説は、政府に対する激しい批判の嵐だった。"},{"sentence":"The scandal unleashed a firespout of public outrage.","translation":"そのスキャンダルは、大衆の激しい怒りを引き起こした。"}],"collocations":["firespout of anger","firespout of criticism","firespout of outrage"],"synonyms":["outburst","eruption","explosion","torrent"],"antonyms":[]}],"etymology":{"value":"The word \"firespout\" is a compound of \"fire\" and \"spout.\" \"Fire\" comes from Old English *fyr*, from Proto-Germanic *fōr* (fire, hearth), from PIE *péh₂wr̥* (fire). \"Spout\" comes from Middle English *spoute*, from Middle Dutch *spūte* (spout, squirt), related to *spūten* (to spout). The combination describes the fire's action of violently erupting and whirling upwards.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfaɪərspaʊt/","syllables":"fire-spout"},"inflection":{"noun_plural":"firespouts"},"usage_notes":{"explanation":"A \"firespout\" is a specific meteorological phenomenon associated with large fires, characterized by a rotating, column-like vortex of flames and hot air. It is distinct from a regular tornado, although it shares a similar structure. The figurative sense extends this image to describe intense and sudden outbursts of emotion or criticism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a fire spout in the forest.","correct":"✓ I saw a firespout in the forest.","note":"The correct term is \"firespout,\" a single word, not \"fire spout.\""},{"incorrect":"✗ The storm created a firespout.","correct":"✓ The wildfire created a firespout.","note":"Firespouts are associated with wildfires or other large fires, not storms."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["tornado","whirlwind","wildfire","firestorm","vortex"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"firespout\" is relatively uncommon and specialized, typically encountered in discussions of wildfires, meteorology, or extreme weather events. Understanding its meaning requires a familiarity with these topics. The figurative usage is even less common, appearing in more sophisticated writing to describe intense emotional or critical outbursts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The documentary showed footage of a massive firespout during the California wildfires.","translation":"そのドキュメンタリーは、カリフォルニアの山火事の際に発生した巨大な火災旋風の映像を放映した。","type":"noun","meaning_category":"火災旋風"},{"sentence":"His article was a firespout of accusations against the company's unethical practices.","translation":"彼の記事は、その会社の非倫理的な慣行に対する激しい非難の嵐だった。","type":"noun","meaning_category":"(比喩的に) 激しい怒りや破壊的な力の爆発"}]}