{"word":"anarcho-capitalism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"無政府資本主義：国家を不要と考え、自由市場、私有財産権、自己所有権を重視する政治哲学。","english_definition":"A political philosophy that advocates for the elimination of the state in favor of individual sovereignty, private property, free markets, and voluntary association.","examples":[{"sentence":"Anarcho-capitalism proposes that all services, including law enforcement and defense, be provided by competing private entities.","translation":"無政府資本主義は、法執行や防衛を含むすべてのサービスが、競争する民間団体によって提供されることを提案する。"},{"sentence":"Critics of anarcho-capitalism argue that it could lead to a society dominated by powerful private interests.","translation":"無政府資本主義の批判者たちは、それが強力な私的利益によって支配される社会につながる可能性があると主張する。"}],"collocations":["free market anarchism","libertarian anarchism","private property rights","voluntary association","self-ownership"],"synonyms":["free market anarchism","libertarian anarchism"],"antonyms":["statism","socialism","communism"]},{"part_of_speech":"noun","definition":"(より広義に)国家権力の最小化を極限まで推し進める思想。","english_definition":"(More broadly) any ideology that advocates for the extreme minimization or elimination of state power, combined with a strong emphasis on private property and free markets.","examples":[{"sentence":"Some see anarcho-capitalism as a radical form of libertarianism.","translation":"無政府資本主義を、リバタリアニズムのラディカルな形態と見なす人もいる。"}],"collocations":["radical libertarianism","anti-statism","laissez-faire capitalism"],"synonyms":["radical libertarianism","anti-statism"],"antonyms":["interventionism","welfarism"]}],"etymology":{"value":"「anarchism（無政府主義）」と「capitalism（資本主義）」の合成語。無政府主義の国家否定と、資本主義の私有財産権・自由市場を組み合わせた思想を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænərkoʊˈkæpɪtəlɪzəm/","syllables":"an-ar-cho-cap-i-tal-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Anarcho-capitalism is a controversial political philosophy. It is distinct from anarchism, which is often associated with anti-capitalism. Proponents argue that a free market without a state would be more efficient and just, while critics fear that it would lead to exploitation and inequality. The term is often used in political science, economics, and philosophy discussions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Anarcho-capitalism is the same as communism.","correct":"✓ Anarcho-capitalism is the opposite of communism.","note":"Anarcho-capitalism is based on private property, while communism advocates for communal ownership."},{"incorrect":"✗ Anarcho-capitalism supports a strong central government.","correct":"✓ Anarcho-capitalism opposes any form of government.","note":"Anarcho-capitalism seeks to eliminate the state entirely."}],"priority":"★★☆"},"related_words":{"derivatives":["anarcho-capitalist (noun, adjective)"],"related_concepts":["libertarianism","minarchism","voluntaryism","Austrian economics"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Anarcho-capitalism' is a complex political philosophy that combines elements of anarchism (opposition to the state) and capitalism (private property and free markets). It's a niche term generally encountered in advanced discussions of political theory, economics, or philosophy. Understanding it requires familiarity with these underlying concepts. It is not a term typically used in everyday conversation."},"example_sentences":[{"sentence":"Anarcho-capitalism is a theoretical system where all services, including courts and police, are privately provided.","translation":"無政府資本主義は、裁判所や警察を含むすべてのサービスが民間で提供される理論的なシステムである。","type":"definition","meaning_category":"definition"},{"sentence":"Some proponents of anarcho-capitalism believe it would lead to a more just and efficient society than any existing system.","translation":"無政府資本主義の支持者の中には、それが既存のどのシステムよりも公正で効率的な社会につながると信じている人もいる。","type":"example","meaning_category":"example"}]}