{"word":"Battenburg","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"バッテンバーグケーキ：市松模様の断面を持つ、マジパンで覆われたイギリスのケーキ","english_definition":"A British cake consisting of مربعات of different coloured sponge cake held together with jam and covered in marzipan.","examples":[{"sentence":"She brought a Battenburg cake to the picnic.","translation":"彼女はピクニックにバッテンバーグケーキを持ってきた。"},{"sentence":"Battenburg is easily recognisable by its distinctive check pattern.","translation":"バッテンバーグは、その特徴的な市松模様で簡単に見分けられる。"}],"collocations":["Battenburg cake","slice of Battenburg","Battenburg pattern"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"名前は、1884年にヴィクトリア女王の孫娘であるヴィクトリア・オブ・ヘッセ＝ダルムシュタットがバッテンベルク公子ルートヴィヒと結婚した際に、この結婚を記念して作られたことに由来する。バッテンベルクは、ドイツのヘッセン大公国にある町の名前に由来する貴族の称号。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbætənbɜːɡ/","syllables":"Bat-ten-burg"},"inflection":{"noun_plural":"Battenburgs"},"usage_notes":{"explanation":"Battenburgケーキは、通常、アプリコットジャムで接着された、ピンクと黄色の4つの異なる色のスポンジケーキの مربعاتで構成されています。ケーキ全体はマジパンで覆われています。市松模様の مربعاتは、バッテンベルク公の4人の子供たちを表していると言われています。","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_cakes":["Simnel cake","Victoria sponge","Madeira cake"],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Battenburg is a type of cake that is not commonly known outside of the UK and some Commonwealth countries. The name and history are quite specific, making it a less accessible term for non-native speakers or those unfamiliar with British culture. Understanding the cultural context is important for comprehension."},"example_sentences":[{"sentence":"For her birthday, she requested a homemade Battenburg cake.","translation":"彼女の誕生日に、彼女は手作りのバッテンバーグケーキをリクエストした。","type":"noun","meaning_category":"ケーキ"},{"sentence":"The bakery is famous for its traditional Battenburg cake recipe.","translation":"そのパン屋は伝統的なバッテンバーグケーキのレシピで有名だ。","type":"noun","meaning_category":"ケーキ"}]}