{"word":"univalence","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(数学、特に型理論において)単一性公理、等価性の唯一性。等価な型は等しいとみなす原理。","english_definition":"(in mathematics, especially in type theory) the univalence axiom; the principle that equivalent types are equal.","examples":[{"sentence":"The univalence axiom is a key feature of homotopy type theory.","translation":"単一性公理はホモトピー型理論の重要な特徴です。"},{"sentence":"Univalence allows us to treat equivalent mathematical structures as being the same.","translation":"単一性により、等価な数学的構造を同一のものとして扱うことができます。"}],"collocations":["univalence axiom","homotopy type theory"],"synonyms":["equivalence","identity"],"antonyms":["none (it's a fundamental axiom)"]}],"etymology":{"value":"Derived from 'uni-' (meaning 'one' or 'unique') and 'valence' (meaning 'the quality of having value or being equivalent'). The term reflects the idea that equivalent mathematical objects should be considered uniquely identified.","priority":"★★★"},"pronunciation":{"ipa":"/ˌjuːnɪˈveɪləns/","syllables":"u-ni-va-lence"},"inflection":{"noun_plural":"univalences (rare)"},"usage_notes":{"explanation":"'Univalence' primarily appears in the context of advanced mathematics, particularly homotopy type theory. It asserts that if two mathematical structures are equivalent (isomorphic), they can be treated as identical. This principle has profound implications for how we reason about mathematical objects and their relationships.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The univalence of the car is important.","correct":"✓ The reliability of the car is important.","note":"'Univalence' is specific to mathematics and type theory. Use other words like 'reliability', 'value', or 'uniqueness' in other contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["univalent (adjective)"],"related_terms":["homotopy type theory","type theory","axiom","equivalence"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (very specialized vocabulary)","frequency_google_ngram":"Low (specific to mathematical literature)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Univalence' is a highly specialized term used within the field of homotopy type theory, a branch of mathematics. It refers to the principle that if two mathematical structures are equivalent, they can be considered identical. Understanding this term requires a background in advanced mathematics and logic."},"example_sentences":[{"sentence":"The proof relies heavily on the univalence axiom.","translation":"その証明は単一性公理に大きく依存している。","type":"noun","meaning_category":"mathematics"},{"sentence":"Univalence provides a new perspective on the foundations of mathematics.","translation":"単一性は数学の基礎に対する新しい視点を提供する。","type":"noun","meaning_category":"mathematics"}]}