{"word":"hyperlactation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"過剰授乳、乳汁過多症","english_definition":"A condition in which a mother produces more breast milk than her baby needs.","examples":[{"sentence":"Hyperlactation can lead to engorgement and discomfort for the mother.","translation":"乳汁過多症は、母親の乳房の張りや不快感につながる可能性があります。"},{"sentence":"Managing hyperlactation often involves strategies to reduce milk production.","translation":"乳汁過多症の管理には、多くの場合、乳汁の生産を減らすための戦略が含まれます."}],"collocations":["manage hyperlactation","reduce milk production","symptoms of hyperlactation"],"synonyms":["oversupply","excessive milk production"],"antonyms":["hypolactation","low milk supply"]}],"etymology":{"value":"The word \"hyperlactation\" is formed from the prefix \"hyper-\" meaning \"excessive\" or \"beyond normal,\" and \"lactation,\" referring to the secretion of milk from the mammary glands.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˌlækˈteɪʃən/","syllables":"hy-per-lac-ta-tion"},"inflection":{"noun_plural":"hyperlactications"},"usage_notes":{"explanation":"Hyperlactation is a condition where a mother produces more breast milk than her baby requires. This can lead to issues such as engorgement, forceful let-down, and digestive problems for the baby. Management strategies include block feeding, avoiding overstimulation of the breasts, and consulting with a lactation consultant.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She has hyper lactation.","correct":"✓ She has hyperlactation.","note":"Hyperlactation is one word, not two."},{"incorrect":"✗ Hyperlactation is when you don't produce enough milk.","correct":"✓ Hyperlactation is when you produce too much milk.","note":"Hyperlactation refers to overproduction, not underproduction, of breast milk."}],"priority":"★★☆"},"related_words":{"derivatives":["lactation","hyper-"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Hyperlactation\" is a specialized term related to breastfeeding and milk production. It refers to the condition where a mother produces an excessive amount of breast milk. Understanding this term requires knowledge of basic medical terminology and concepts related to lactation. Due to its specific context, it is not commonly encountered in everyday language but is relevant in medical or parenting contexts."},"example_sentences":[{"sentence":"The lactation consultant provided strategies for managing her hyperlactation.","translation":"授乳コンサルタントは、彼女の乳汁過多症を管理するための戦略を提供しました。","type":"medical","meaning_category":"乳汁過多症"},{"sentence":"Hyperlactation can sometimes cause the baby to gulp and choke during feeding.","translation":"乳汁過多症は、授乳中に赤ちゃんがゴクゴク飲み込んだり、むせたりする原因となることがあります。","type":"symptom","meaning_category":"乳汁過多症"}]}