{"word":"cousiny","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"いとこ同士のような、いとこ関係の","english_definition":"Resembling or characteristic of cousins; related like cousins.","examples":[{"sentence":"They had a cousiny relationship, always joking and teasing each other.","translation":"彼らはいつも冗談を言い合ったりからかったりする、いとこ同士のような関係だった。"},{"sentence":"The atmosphere at the family reunion was very cousiny.","translation":"家族の再会での雰囲気はとてもいとこ同士のようだった。"}],"collocations":["cousiny relationship","cousiny atmosphere"],"synonyms":["familiar","friendly","related"],"antonyms":["distant","unrelated"]}],"etymology":{"value":"The word 'cousiny' is derived from 'cousin' by adding the suffix '-y', which often indicates resemblance or characteristic.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkʌzɪni/","syllables":"cou-sin-y"},"inflection":{"notes":"This word primarily functions as an adjective. It does not have standard comparative or superlative forms. The base word is 'cousin', which is a noun."},"usage_notes":{"explanation":"'Cousiny' is an informal adjective used to describe something that resembles the relationship or characteristics typically associated with cousins. It suggests a sense of familiarity, friendliness, and perhaps a bit of playful teasing or closeness. It's not a commonly used word, but it can be effective in conveying a specific kind of familial connection or atmosphere.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cousiny were playing in the garden.","correct":"✓ The cousins were playing in the garden.","note":"'Cousiny' is an adjective, not a noun. Use 'cousins' as the plural noun for 'cousin'."},{"incorrect":"✗ She felt very cousiny to her friend.","correct":"✓ She felt very close to her friend.","note":"'Cousiny' describes a relationship or atmosphere, not a feeling. Use 'close' or 'friendly' to describe feelings."}],"priority":"★☆☆"},"related_words":{"derivatives":["cousin (noun)","cousinly (adjective)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not a standard word)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'cousiny' is not a standard English word and is relatively rare. It is used informally to describe something that resembles the relationship or characteristics typically associated with cousins. Because it is not a standard word, it is important to use it carefully and ensure that the context makes its meaning clear. It is more likely to be understood by native English speakers who are familiar with the base word 'cousin' and the suffix '-y', which often indicates resemblance or characteristic."},"example_sentences":[{"sentence":"The party had a warm, cousiny vibe, with everyone chatting and laughing like old friends.","translation":"パーティーは温かく、いとこ同士のような雰囲気で、誰もが旧友のように話し笑っていた。","type":"adjective","meaning_category":"relationship"},{"sentence":"Their cousiny banter was a constant source of amusement at family gatherings.","translation":"彼らのいとこ同士のような冗談のやり取りは、家族の集まりで常に笑いの種だった。","type":"adjective","meaning_category":"relationship"}]}