{"word":"Niihau","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ニイハウ島：ハワイ諸島に属する島。私有の島として知られ、伝統的なハワイの文化が色濃く残っている。","english_definition":"Niihau: An island in the Hawaiian archipelago. It is known as a privately owned island where traditional Hawaiian culture is well preserved.","examples":[{"sentence":"Niihau is known as the 'Forbidden Island'.","translation":"ニイハウ島は「禁断の島」として知られています。"},{"sentence":"Only residents and invited guests are allowed to visit Niihau.","translation":"ニイハウ島への訪問は、居住者と招待されたゲストのみに許可されています。"}],"collocations":["visit Niihau (ニイハウ島を訪問する)","Niihau shell leis (ニイハウシェルのレイ)","the island of Niihau (ニイハウ島)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"ハワイ語に由来し、具体的な語源は「小さな」または「高さ」に関連すると考えられているが、正確な起源は不明。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈniːhaʊ/","syllables":"Nee-hau"},"inflection":{},"usage_notes":{"explanation":"「**Niihau**」は、ハワイ諸島の中でも特異な存在である私有の島を指します。観光客の立ち入りが制限されているため、伝統的なハワイの文化や生活様式が色濃く残っています。ニイハウ島で作られるニイハウシェルのレイは、非常に価値が高く、特別な贈り物や記念品として珍重されています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to Niihau next week for vacation.","correct":"✓ Visiting Niihau is very difficult because it's a private island.","note":"ニイハウ島は一般の観光客が容易に訪れることができないため、旅行の計画を立てる際には注意が必要です。"},{"incorrect":"✗ Niihau is the biggest island in Hawaii.","correct":"✓ Niihau is one of the smaller inhabited islands in Hawaii.","note":"ニイハウ島はハワイ諸島の中で最も大きな島ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["Niihau shell (ニイハウシェル)","Niihau shell lei (ニイハウシェルのレイ)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 地名のため、一般的な会話ではほとんど使用されない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Niihau**」はハワイ諸島にある私有の島で、一般の観光客が自由に出入りできないため、あまり知られていません。この島は、伝統的なハワイの文化が色濃く残っていることで有名です。ニイハウ島で作られるニイハウシェルのレイは、非常に価値が高く、特別な贈り物として珍重されています。ハワイの歴史や文化に関心のある人にとっては重要な地名ですが、一般的な英語の学習においては、必ずしも頻繁に目にする単語ではありません。"},"example_sentences":[{"sentence":"The population of Niihau is very small, consisting mostly of native Hawaiians.","translation":"ニイハウ島の人口は非常に少なく、主にハワイの先住民で構成されています。","type":"noun","meaning_category":"地名"},{"sentence":"Niihau shell leis are highly prized and can be quite expensive.","translation":"ニイハウシェルのレイは非常に珍重されており、非常に高価になることがあります。","type":"noun","meaning_category":"地名"}]}