{"word":"corporally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"肉体的に、身体的に","english_definition":"in a bodily or physical manner; in person.","examples":[{"sentence":"The students were punished corporally for their misbehavior.","translation":"生徒たちはその非行に対して体罰を受けた。"},{"sentence":"He was corporally present at the meeting, but his mind was elsewhere.","translation":"彼は会議に肉体的に出席していたが、心は別の場所にあった。"}],"collocations":["punish corporally (体罰を加える)","present corporally (肉体的に出席する)","affected corporally (肉体的に影響を受ける)"],"synonyms":["physically","bodily","in the flesh","in person"],"antonyms":["mentally","spiritually","intellectually"]}],"etymology":{"value":"Late Middle English: from Old French corporel, from Latin corporalis, from corpus ‘body’.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɔːrpərəli/","syllables":"cor-po-ral-ly"},"inflection":{"notes":"Adverb - no inflection"},"usage_notes":{"explanation":"The adverb \"corporally\" describes actions or states related to the physical body. It is often used in contexts where physical punishment or physical presence is being discussed. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was corporally happy.","correct":"✓ She was physically happy.","note":"\"Corporally\" refers to the body, not emotions. Use \"physically\" if you want to emphasize the physical sensation of happiness."},{"incorrect":"✗ He corporally attended the online meeting.","correct":"✓ He physically attended the meeting.","note":"\"Corporally\" implies physical presence. An online meeting cannot be attended corporally."}],"priority":"★☆☆"},"related_words":{"derivatives":["corporal (adjective: relating to the body; noun: a non-commissioned officer in the army or marines)","corporation (noun: a company or group of people authorized to act as a single entity)","corporeal (adjective: relating to a person's body, especially as opposed to their spirit)"],"phrases":["corporal punishment (体罰)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"corporally\" means \"in a bodily or physical manner.\" It's not a common word and is usually found in formal writing or discussions about physical actions or the body. It's more specific than simply saying \"physically\" because it emphasizes the connection to the body itself. You might see it used when talking about physical punishment or the physical presence of someone at an event.","priority":"★★☆"},"example_sentences":[{"sentence":"The law prohibits parents from disciplining their children corporally.","translation":"法律は親が子供を体罰でしつけることを禁じている。","type":"adverb","meaning_category":"体罰"},{"sentence":"The king was corporally weak but mentally sharp.","translation":"王は肉体的に弱っていたが、精神は明晰だった。","type":"adverb","meaning_category":"身体的な状態"},{"sentence":"Although he was corporally present, his thoughts were far away.","translation":"彼は肉体的に出席していたが、考えは遠く離れていた。","type":"adverb","meaning_category":"物理的な存在"}]}