{"word":"endocytosis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"エンドサイトーシス、細胞内取り込み","english_definition":"the process by which cells absorb molecules (such as proteins) by engulfing them.","examples":[{"sentence":"Endocytosis is a crucial process for nutrient uptake in cells.","translation":"エンドサイトーシスは細胞における栄養素の取り込みに不可欠なプロセスである。"},{"sentence":"There are several types of endocytosis, including phagocytosis and pinocytosis.","translation":"エンドサイトーシスには、食作用やピノサイトーシスなど、いくつかの種類がある。"},{"sentence":"Receptor-mediated endocytosis allows cells to selectively internalize specific molecules.","translation":"受容体介在性エンドサイトーシスにより、細胞は特定の分子を選択的に内部に取り込むことができる。"}],"collocations":["receptor-mediated endocytosis (受容体介在性エンドサイトーシス)","phagocytosis (食作用)","pinocytosis (ピノサイトーシス)","clathrin-mediated endocytosis (クラトリン介在性エンドサイトーシス)","caveolae-mediated endocytosis (カベオラ介在性エンドサイトーシス)"],"synonyms":["cell internalization","vesicular transport","cellular uptake"],"antonyms":["exocytosis"],"notes":"エンドサイトーシスは、細胞膜が陥入し、小胞を形成することで物質を取り込むプロセス。"}],"etymology":{"value":"ギリシャ語の \"endon\" (内部) + \"kytos\" (細胞) + \"-osis\" (プロセス) に由来する。","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛndoʊsaɪˈtoʊsɪs/","syllables":"en-do-cy-to-sis"},"inflection":{"noun_plural":"endocytoses"},"usage_notes":{"explanation":"Endocytosis is a fundamental process in cell biology, allowing cells to internalize various substances, including nutrients, pathogens, and signaling molecules. It plays a crucial role in cellular communication, immune responses, and nutrient acquisition. There are different types of endocytosis, each with distinct mechanisms and functions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Endocytosis is the process of cell excretion.","correct":"✓ Endocytosis is the process of cell internalization.","note":"Endocytosis is the process of taking substances *into* the cell, not excreting them. Excretion is exocytosis."}],"priority":"★★☆"},"related_words":{"derivatives":["endocytose (verb)","endocytic (adjective)"],"related_terms":["exocytosis","transcytosis","vesicle","membrane trafficking"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 専門的な生物学用語。","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Endocytosis is a complex biological term referring to the process by which cells internalize substances from their external environment. This involves the cell membrane invaginating and forming vesicles to engulf the material. It's a key process in various cellular functions like nutrient uptake, signaling, and immune response. Understanding endocytosis requires knowledge of cell biology and related concepts like membrane dynamics and vesicular transport.","priority":"★★☆"},"example_sentences":[{"sentence":"The virus enters the cell through receptor-mediated endocytosis.","translation":"ウイルスは受容体介在性エンドサイトーシスを介して細胞に侵入する。","type":"scientific context","meaning_category":"cellular process"},{"sentence":"Endocytosis is essential for the removal of damaged proteins from the cell surface.","translation":"エンドサイトーシスは細胞表面から損傷したタンパク質を除去するために不可欠である。","type":"scientific context","meaning_category":"cellular process"},{"sentence":"Researchers are studying the role of endocytosis in cancer metastasis.","translation":"研究者たちは癌の転移におけるエンドサイトーシスの役割を研究している。","type":"scientific context","meaning_category":"cellular process"}]}