{"word":"Nucleophilicity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"求核性：ある原子または分子が、正電荷を持つ原子核（陽子）を求めて反応する傾向。求核性が高いほど、求電子的な部位への攻撃が容易になる。","english_definition":"The tendency of an atom or molecule to donate electrons to form a chemical bond; the strength of a nucleophile. A higher nucleophilicity indicates a greater ability to attack electrophilic sites.","examples":[{"sentence":"The nucleophilicity of hydroxide (OH-) is higher than that of water (H2O).","translation":"水酸化物イオン(OH-)の求核性は水(H2O)よりも高い。"},{"sentence":"Nucleophilicity is an important factor in determining the rate of SN2 reactions.","translation":"求核性はSN2反応の速度を決定する重要な要素である。"},{"sentence":"Factors such as charge, electronegativity, and steric hindrance affect nucleophilicity.","translation":"電荷、電気陰性度、立体障害などの要因が求核性に影響を与える。"}],"collocations":["high nucleophilicity (高い求核性)","low nucleophilicity (低い求核性)","increase nucleophilicity (求核性を高める)","decrease nucleophilicity (求核性を下げる)","nucleophilicity order (求核性の順序)","nucleophilicity scale (求核性の尺度)"],"synonyms":["nucleophilic strength","nucleophilic character","electron-donating ability"],"antonyms":["electrophilicity (求電子性)"]},{"part_of_speech":"noun","definition":"求核性：求核剤の相対的な反応速度の尺度。求核剤が特定の反応でどれだけ速く反応するかを示す。","english_definition":"A measure of the relative rate of reaction of a nucleophile in a specific reaction. It quantifies how quickly a nucleophile reacts in a particular process.","examples":[{"sentence":"The Swain-Scott equation is used to quantify nucleophilicity.","translation":"スウェイン-スコットの式は、求核性を定量化するために使用される。"},{"sentence":"Nucleophilicity is measured relative to a standard nucleophile.","translation":"求核性は、標準的な求核剤と比較して測定される。"},{"sentence":"The relative nucleophilicity of different halides varies depending on the solvent.","translation":"異なるハロゲン化物の相対的な求核性は、溶媒によって異なる。"}],"collocations":["relative nucleophilicity (相対的な求核性)","measure nucleophilicity (求核性を測定する)","quantify nucleophilicity (求核性を定量化する)","nucleophilicity constant (求核性定数)"],"synonyms":["nucleophilic reactivity","reaction rate (with electrophiles)"],"antonyms":["electrophilic reactivity"]}],"etymology":{"value":"Derived from 'nucleophile' (nucleus-loving) + '-icity' (state or quality). 'Nucleophile' comes from 'nucleus' (the positively charged center of an atom) and '-phile' (lover of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnjuːkliəˈfɪlɪsɪti/","syllables":"nu-cle-o-phil-i-ci-ty"},"inflection":{"noun_plural":"Nucleophilicities (rarely used)"},"usage_notes":{"explanation":"'Nucleophilicity' refers to the kinetic property of a nucleophile, i.e., how fast it reacts in a chemical reaction. It is different from 'basicity,' which is a thermodynamic property related to the equilibrium constant of a base reacting with an acid. Nucleophilicity is influenced by factors such as charge, solvent, steric hindrance, and the nature of the leaving group in a reaction. It is a crucial concept in understanding and predicting the rates and mechanisms of nucleophilic substitution and addition reactions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Nucleophilicity is the same as basicity.","correct":"✓ Nucleophilicity is a kinetic property, while basicity is a thermodynamic property.","note":"Nucleophilicity and basicity are related but distinct concepts. Basicity refers to the ability to accept a proton, while nucleophilicity refers to the ability to attack an electrophilic center. They are not interchangeable."},{"incorrect":"✗ Nucleophilicity only depends on the charge of the atom.","correct":"✓ Nucleophilicity depends on charge, electronegativity, steric hindrance, and the solvent.","note":"Charge is one factor, but other factors also significantly influence nucleophilicity."}],"priority":"★★☆"},"related_words":{"derivatives":["nucleophile (求核剤)","nucleophilic (求核的な)","nucleophilic substitution (求核置換反応)","nucleophilic addition (求核付加反応)"],"related_terms":["electrophilicity (求電子性)","electrophile (求電子剤)","leaving group (脱離基)","SN1 reaction (SN1反応)","SN2 reaction (SN2反応)","basicity (塩基性)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nucleophilicity' is a term used in organic chemistry to describe how well a molecule or atom donates electrons to form a chemical bond. It's a measure of how quickly a 'nucleophile' (electron-rich species) attacks an 'electrophile' (electron-deficient species). Several factors affect nucleophilicity, including charge, size, and the solvent used in the reaction. This term is typically encountered in advanced chemistry courses when studying reaction mechanisms.","priority":"★★☆"},"example_sentences":[{"sentence":"The **nucleophilicity** of the cyanide ion (CN-) makes it an effective reagent for SN2 reactions.","translation":"シアン化物イオン(CN-)の求核性は、SN2反応において効果的な試薬となる。","type":"general","meaning_category":"求核性"},{"sentence":"Solvent effects can significantly alter the observed **nucleophilicity** of different anions.","translation":"溶媒効果は、異なるアニオンの観察される求核性を大きく変化させる可能性がある。","type":"general","meaning_category":"求核性"},{"sentence":"Steric hindrance around the nucleophilic center decreases the **nucleophilicity** of the molecule.","translation":"求核中心の立体障害は、分子の求核性を低下させる。","type":"general","meaning_category":"求核性"}]}