{"word":"data-structure-oriented","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"データ構造指向の：プログラムや設計が、データの構造を中心に構成されていること。","english_definition":"Relating to or characterized by an approach to programming or design that prioritizes the organization and manipulation of data structures.","examples":[{"sentence":"The project requires a data-structure-oriented approach to efficiently manage the large dataset.","translation":"そのプロジェクトでは、大規模なデータセットを効率的に管理するために、データ構造指向のアプローチが必要です。"},{"sentence":"A data-structure-oriented design can lead to more maintainable and scalable software.","translation":"データ構造指向の設計は、より保守しやすく、拡張性の高いソフトウェアにつながる可能性があります。"}],"collocations":["data-structure-oriented programming","data-structure-oriented design","data-structure-oriented approach"],"synonyms":["data-centric","data-driven"],"antonyms":["process-oriented","function-oriented"]}],"etymology":{"value":"\"data structure\" + \"oriented\".  Indicates a focus on data structures as a primary organizing principle.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌdeɪtə ˈstrʌktʃər ˌɔːriˌɛntɪd/","syllables":"da-ta-struc-ture-o-ri-en-ted"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"This term is used in computer science and software engineering to describe methodologies where the choice and organization of data structures heavily influence the design and implementation of software. It emphasizes that the way data is structured is a key factor in the efficiency and effectiveness of the program.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ data structure oriented","correct":"✓ data-structure-oriented","note":"Hyphens are important for clarity and to indicate that this is a compound adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":["data structure","algorithm","object-oriented"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"This term is technical and specific to computer science. It implies a deep understanding of data structures and their impact on software design."},"example_sentences":[{"sentence":"The software architecture is data-structure-oriented, allowing for efficient data retrieval.","translation":"そのソフトウェアアーキテクチャはデータ構造指向であり、効率的なデータ検索を可能にします。","type":"adjective","meaning_category":"data structure focus"},{"sentence":"A data-structure-oriented curriculum provides students with a strong foundation in computer science.","translation":"データ構造指向のカリキュラムは、学生にコンピュータサイエンスの強力な基盤を提供します。","type":"adjective","meaning_category":"curriculum focus"}]}