{"word":"Euonymus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ニシキギ属の植物","english_definition":"A genus of shrubs and small trees in the family Celastraceae, native to Asia, Europe, Australasia, and North America.","examples":[{"sentence":"The Euonymus shrub has beautiful fall foliage.","translation":"ニシキギ属の低木は、秋に美しい紅葉を見せる。"}],"collocations":["Euonymus alatus (ニシキギ)","Euonymus japonicus (マサキ)"],"synonyms":["Spindle tree"],"antonyms":[]}],"etymology":{"value":"From the Ancient Greek word εὐώνυμος (euṓnymos), meaning \"of good name or reputation,\" but used ironically to mean \"ill-omened\" or \"unlucky.\" The name was given because of the poisonous nature of some species in the genus.","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈɒnɪməs/","syllables":"Eu-on-y-mus"},"inflection":{"noun_plural":"Euonymuses"},"usage_notes":{"explanation":"'Euonymus' is a botanical term referring to a specific genus of plants. It's not commonly used in everyday conversation, but is important in botanical and horticultural contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a beautiful euonymus in the garden, it was very tall.","correct":"✓ I saw a beautiful Euonymus in the garden; it was very tall.","note":"'Euonymus' is a genus name and should be capitalized."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low Frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Euonymus' is a scientific term used to refer to a genus of plants. It is not commonly used in everyday language and is primarily found in botanical or horticultural contexts. Understanding its meaning requires a relatively advanced vocabulary and familiarity with scientific nomenclature."},"example_sentences":[{"sentence":"The garden featured several varieties of Euonymus, known for their vibrant autumn colors.","translation":"その庭園には、鮮やかな秋の色で知られるニシキギ属の植物が数種類植えられていた。","type":"noun","meaning_category":"ニシキギ属の植物"}]}