{"word":"Iguania","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"イグアナ亜目：有鱗目のうち、イグアナ、カメレオン、アガマなどを含むグループ。","english_definition":"A suborder of scaled reptiles (order Squamata) that includes iguanas, chameleons, agamas, and related species.","examples":[{"sentence":"The Iguania suborder is diverse and contains many different families of lizards.","translation":"イグアナ亜目は多様であり、多くの異なるトカゲの科を含んでいます。"},{"sentence":"Many species within Iguania are adapted to arboreal or desert environments.","translation":"イグアナ亜目の多くの種は、樹上または砂漠の環境に適応しています。"}],"collocations":["Iguania species","Iguania family","Iguania lizard","Iguania habitat","Iguania evolution"],"synonyms":["lizard","scaled reptile","Squamata"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Iguana', which comes from the Spanish word 'Iguana', itself derived from the Taíno name for the species. The suffix '-ia' is used to denote a group or suborder in biological classification.","priority":"★★★"},"pronunciation":{"ipa":"/ɪˈɡwɑːniə/","syllables":"I-gua-ni-a"},"inflection":{"noun_plural":"Iguanias"},"usage_notes":{"explanation":"'Iguania' refers to a specific taxonomic grouping within the reptile order Squamata (scaled reptiles). It is used in scientific and zoological contexts to classify a range of lizards that share certain evolutionary characteristics. It is not a term commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ That iguana is an Iguania.","correct":"✓ That iguana belongs to the Iguania suborder.","note":"'Iguania' is a suborder, not a species or individual. You can say an animal belongs to the Iguania suborder, but you wouldn't say it *is* an Iguania."},{"incorrect":"✗ Iguania are only iguanas.","correct":"✓ Iguania includes iguanas, chameleons, agamas, and other related lizards.","note":"'Iguania' includes a wide variety of lizards, not just iguanas."}],"priority":"★★☆"},"related_words":{"derivatives":["Iguanidae (family of iguanas)"],"phrases":["Scaled reptile","Squamata","lizard"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and zoological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Iguania' is a technical term used in biology to classify a specific group of lizards. Understanding this term requires knowledge of biological classification systems. It is typically encountered in scientific literature or educational materials related to zoology and herpetology. The term is not commonly used in general conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"Phylogenetic studies have helped clarify the relationships within Iguania.","translation":"系統発生学的研究は、イグアナ亜目内の関係を明確にするのに役立っています。","type":"scientific","meaning_category":"classification"},{"sentence":"The diversity of Iguania is particularly evident in tropical regions.","translation":"イグアナ亜目の多様性は、特に熱帯地域で顕著です。","type":"ecological","meaning_category":"biodiversity"},{"sentence":"The Iguania suborder includes both terrestrial and arboreal species.","translation":"イグアナ亜目は、陸生種と樹上種の両方を含んでいます。","type":"zoological","meaning_category":"habitat"}]}