{"word":"non-investment-grade","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(債券などが)投資不適格の、投機的な、ハイイールドの","english_definition":"(of a bond or other debt instrument) considered to have a relatively high risk of default and therefore not suitable for investment by conservative investors; speculative; high-yield.","examples":[{"sentence":"The company's bonds were downgraded to non-investment-grade status.","translation":"その会社の債券は投資不適格の格付けに引き下げられた。"},{"sentence":"Non-investment-grade bonds typically offer higher yields to compensate for the increased risk.","translation":"投資不適格債は通常、リスクの増加を補うためにより高い利回りを提供する。"},{"sentence":"Many institutional investors are prohibited from holding non-investment-grade securities.","translation":"多くの機関投資家は、投資不適格の有価証券を保有することを禁じられている。"}],"collocations":["non-investment-grade bond (投資不適格債)","non-investment-grade debt (投資不適格債務)","non-investment-grade rating (投資不適格格付け)","high-yield bond (ハイイールド債)","junk bond (ジャンク債)"],"synonyms":["speculative grade","high-yield","junk bond","below investment grade"],"antonyms":["investment-grade"],"related_terms":["credit rating","default risk","yield","bond","securities"],"notes":"Often used interchangeably with 'high-yield' and 'junk bond', though 'junk bond' can sometimes carry a more negative connotation.","priority":"★★☆"}],"etymology":{"value":"A combination of 'non-' (meaning 'not'), 'investment', and 'grade'. Indicates that the security does not meet the standards for investment-grade status as determined by credit rating agencies.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌnɒn ɪnˈvɛstmənt ˌɡreɪd/","syllables":"non-in-vest-ment-grade"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Non-investment-grade' is a term used in finance to describe bonds and other debt instruments that are considered to have a higher risk of default compared to investment-grade securities. These bonds are rated below a certain threshold by credit rating agencies such as Moody's, Standard & Poor's, and Fitch. Because of the higher risk, they typically offer higher yields to attract investors. While 'high-yield' is often used as a synonym, 'non-investment-grade' is a more formal and neutral term. 'Junk bond' is another synonym, but it can have a more pejorative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is non investment grade.","correct":"✓ The company has a non-investment-grade rating.","note":"It's more accurate to say that a company *has* a non-investment-grade rating, rather than saying the company *is* non-investment-grade. The rating applies to specific debt instruments, not necessarily the entire company."},{"incorrect":"✗ Non investment grade bonds are always bad investments.","correct":"✓ Non-investment-grade bonds carry higher risk but can also offer higher potential returns.","note":"While non-investment-grade bonds are riskier, they are not inherently 'bad' investments. They can be part of a diversified portfolio and offer the potential for higher returns, but investors should be aware of the increased risk of default."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["credit rating agency","Moody's","Standard & Poor's","Fitch","default","yield spread","credit risk","investment-grade"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in financial contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-investment-grade' is used in finance to describe bonds that are considered riskier than those with an 'investment-grade' rating. This means that credit rating agencies, like Moody's or Standard & Poor's, have assessed these bonds as having a higher chance of default (failure to pay back the debt). Because of this higher risk, these bonds usually offer a higher yield (interest rate) to attract investors. They are also sometimes called 'high-yield' or 'junk bonds,' although 'non-investment-grade' is a more neutral and formal term. These types of bonds may not be suitable for all investors, especially those who are risk-averse or have a fiduciary duty to invest conservatively."},"example_sentences":[{"sentence":"Due to declining profits, the company's bonds were downgraded to **non-investment-grade**.","translation":"利益の減少により、その会社の債券は投資不適格に格下げされた。","type":"adjective","meaning_category":"investment risk"},{"sentence":"Investors seeking higher returns often consider **non-investment-grade** debt.","translation":"より高いリターンを求める投資家は、しばしば投資不適格債を検討する。","type":"adjective","meaning_category":"investment risk"},{"sentence":"The fund specializes in **non-investment-grade** corporate bonds.","translation":"そのファンドは、投資不適格の社債を専門としている。","type":"adjective","meaning_category":"investment risk"}]}