{"word":"Bullpup","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ブルパップ方式の銃","english_definition":"A firearm configuration in which the action and magazine are located behind the trigger, resulting in a shorter overall weapon for a given barrel length.","examples":[{"sentence":"The Steyr AUG is a well-known example of a bullpup rifle.","translation":"ステアーAUGは、ブルパップ方式のライフルとしてよく知られています。"},{"sentence":"Bullpup designs are often favored for their compact size.","translation":"ブルパップのデザインは、そのコンパクトなサイズから好まれることが多いです。"}],"collocations":["bullpup rifle","bullpup shotgun","bullpup configuration","bullpup design"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the physical resemblance to a bulldog puppy, having a 'short and stubby' appearance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʊlˌpʌp/","syllables":"Bull-pup"},"inflection":{"noun_plural":"bullpups"},"usage_notes":{"explanation":"The term \"bullpup\" refers specifically to the configuration of the firearm, not to a specific model or brand. Bullpup designs are found in rifles, shotguns, and occasionally other types of firearms. The primary advantage of a bullpup design is its shorter overall length compared to a conventional firearm with the same barrel length, making it more maneuverable in close quarters.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a new bullpup gun.","correct":"✓ I bought a new bullpup rifle.","note":"While 'gun' is a general term, specifying the type of firearm (e.g., rifle, shotgun) is more precise."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["rifle","shotgun","firearm","weapon","assault rifle"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"bullpup\" describes a specific design of firearms where the firing mechanism is located behind the trigger. This design allows for a shorter overall length while maintaining a longer barrel, which typically improves accuracy. Bullpup firearms are often used in military and law enforcement contexts where maneuverability in confined spaces is crucial. Understanding this term requires some familiarity with firearm terminology."},"example_sentences":[{"sentence":"The soldier carried a bullpup rifle for urban combat.","translation":"兵士は都市戦闘のためにブルパップ方式のライフルを携行していた。","type":"noun","meaning_category":"ブルパップ方式の銃"},{"sentence":"Many modern armies are adopting bullpup designs for their standard-issue rifles.","translation":"多くの現代軍が、標準装備のライフルにブルパップ方式を採用している。","type":"noun","meaning_category":"ブルパップ方式の銃"}]}