{"word":"Glucosin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A compound found in cruciferous plants (e.g., mustard, cabbage, horseradish) that, when broken down by the enzyme myrosinase, produces various products including isothiocyanates, thiocyanates, and nitriles. These products contribute to the characteristic flavors and aromas of these plants and can have both beneficial and toxic effects.","english_definition":"Any of a class of sulfur-containing glucosides found in cruciferous plants that yield mustard oils on hydrolysis.","examples":[{"sentence":"Glucosin levels in broccoli can be influenced by growing conditions.","translation":"ブロッコリー中のグルコシンのレベルは、生育条件によって影響を受ける可能性があります。"},{"sentence":"The breakdown products of glucosin contribute to the pungent flavor of horseradish.","translation":"グルコシンの分解生成物は、ホースラディッシュの刺激的な風味に寄与します。"}],"collocations":["glucosin content","glucosin hydrolysis","glucosin breakdown products","total glucosin","glucosin analysis"],"synonyms":["mustard oil glycoside"],"antonyms":[]},{"part_of_speech":"chemical compound","definition":"化学化合物の一種で、特にアブラナ科植物（例：マスタード、キャベツ、ホースラディッシュ）に含まれる。ミロシナーゼ酵素によって分解されると、イソチオシアネート、チオシアネート、ニトリルなどの様々な生成物を生成する。これらの生成物は、これらの植物特有の風味と香りに寄与し、有益な効果と有害な効果の両方をもたらす可能性がある。","english_definition":"A type of chemical compound, specifically a sulfur-containing glycoside found in cruciferous plants, that yields mustard oils upon hydrolysis.","examples":[{"sentence":"グルコシンはアブラナ科植物に広く分布している。","translation":"Glucosin is widely distributed in cruciferous plants."},{"sentence":"グルコシンの分解はミロシナーゼ酵素によって触媒される。","translation":"The decomposition of glucosin is catalyzed by the enzyme myrosinase."}],"collocations":["グルコシンの含有量","グルコシンの加水分解","グルコシンの分解生成物","総グルコシン","グルコシンの分析"],"synonyms":["マスタード油配糖体"],"antonyms":[]}],"etymology":{"value":"Derived from \"gluco-\" (referring to glucose, a sugar component) and \"-sin\" (related to sinigrin, one of the first glucosin identified).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡluːkəˈsɪn/","syllables":"glu-co-sin"},"inflection":{"noun_plural":"Glucosins"},"usage_notes":{"explanation":"Glucosin are primarily studied in the context of plant biology, food science, and human nutrition. They are of interest due to their potential health benefits (e.g., anticancer properties of isothiocyanates) and also their role in plant defense against herbivores and pathogens. The specific glucosin profile varies among different cruciferous species, leading to diverse flavors and potential health effects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Glucosin is a type of protein.","correct":"✓ Glucosin is a type of glycoside.","note":"Glucosin are not proteins; they are glycosides (specifically, sulfur-containing glucosides)."},{"incorrect":"✗ Glucosin are only harmful.","correct":"✓ Glucosin can have both beneficial and harmful effects.","note":"While some glucosin breakdown products can be toxic in high concentrations, others have demonstrated health benefits, such as anticancer properties."}],"priority":"★★☆"},"related_words":{"derivatives":["glucosinolate (related term, often used interchangeably)","myrosinase (enzyme that breaks down glucosin)","isothiocyanate (breakdown product of glucosin)","sinigrin (a specific type of glucosin)","sulforaphane (an isothiocyanate derived from glucosin)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Glucosin is a technical term used in the fields of botany, chemistry, and nutrition. It refers to a class of compounds found in cruciferous vegetables that, when broken down, produce various bioactive substances. Understanding glucosin requires knowledge of plant biochemistry and the effects of these compounds on human health. This term is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The **glucosin** content of kale varies depending on the variety and growing conditions.","translation":"ケールのグルコシン含有量は、品種や栽培条件によって異なります。","type":"noun","meaning_category":"chemical compound"},{"sentence":"Hydrolysis of **glucosin** by myrosinase releases isothiocyanates.","translation":"ミロシナーゼによるグルコシンの加水分解は、イソチオシアネートを放出します。","type":"noun","meaning_category":"chemical compound"},{"sentence":"Research suggests that certain **glucosin** breakdown products may have anticancer properties.","translation":"研究によると、特定のグルコシンの分解生成物は抗がん作用を持つ可能性があることが示唆されています。","type":"noun","meaning_category":"chemical compound"}]}