{"word":"helotisms","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘロット制度、ヘロット的状態","english_definition":"The condition or practice of being a helot; the system of serfdom or servitude, especially as practiced in ancient Sparta.","examples":[{"sentence":"The Spartan society was characterized by helotisms.","translation":"スパルタ社会はヘロット制度によって特徴づけられていた。"},{"sentence":"The fear of helotisms uprisings was a constant concern for the Spartan ruling class.","translation":"ヘロットの反乱への恐れは、スパルタの支配階級にとって絶え間ない懸念事項だった。"}],"collocations":["Spartan helotisms","practice of helotisms"],"synonyms":["serfdom","servitude","slavery"],"antonyms":["freedom","liberty"]}],"etymology":{"value":"Derived from 'helot,' referring to the state-owned serfs of ancient Sparta. The suffix '-ism' denotes a system, practice, or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛləˌtɪzəmz/","syllables":"he-lo-tiz-ums"},"inflection":{"noun_plural":"helotisms"},"usage_notes":{"explanation":"'Helotisms' specifically refers to the system or condition of helots, who were a class of serfs in ancient Sparta. It is not commonly used outside of historical contexts related to ancient Greece.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country suffered from helotisms after the war.","correct":"✓ The country suffered from serfdom after the war.","note":"'Helotisms' is specific to the Spartan system; 'serfdom' is a more general term."}],"priority":"★☆☆"},"related_words":{"derivatives":["helot (noun: ヘロット)"],"related_terms":["Sparta","serf","serfdom"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Helotisms' is a specialized term used in the context of ancient Spartan history, referring to the system of serfdom imposed on the helots. It is not commonly used in modern English outside of academic or historical discussions. Understanding requires familiarity with ancient Greek history and social structures."},"example_sentences":[{"sentence":"The study of Spartan helotisms provides insights into ancient social control mechanisms.","translation":"スパルタのヘロット制度の研究は、古代の社会統制メカニズムへの洞察を提供する。","type":"noun","meaning_category":"ヘロット制度"},{"sentence":"The Spartan economy was heavily reliant on the exploitation inherent in helotisms.","translation":"スパルタ経済は、ヘロット制度に内在する搾取に大きく依存していた。","type":"noun","meaning_category":"ヘロット制度"}]}