{"word":"Porphyrogenite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)紫色の部屋で生まれた人、特にビザンツ帝国の皇族","english_definition":"(historical) A person born in the purple chamber, especially a member of the Byzantine imperial family.","examples":[{"sentence":"The porphyrogenite emperors of Byzantium held a special status.","translation":"ビザンツ帝国の紫室生まれの皇帝たちは特別な地位を保持していた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Ancient Greek πορφυρογέννητος (porphyrogénnētos), from πορφύρα (porphúra, \"purple\") + γενν- (genn-, \"born\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɔːrfɪˈrɒdʒɪnaɪt/","syllables":"Por-phy-ro-ge-nite"},"inflection":{"noun_plural":"Porphyrogenites"},"usage_notes":{"explanation":"The term 'porphyrogenite' specifically refers to individuals, typically royalty, who were born in a room decorated with purple, a color historically associated with royalty and power. This practice was most notably associated with the Byzantine Empire.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["porphyrogenita (feminine form)"],"related":["purple","Byzantine Empire","royalty"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word \"Porphyrogenite\" is a highly specialized historical term, primarily used in the context of the Byzantine Empire. It refers to someone of royal or imperial status who was born in a purple chamber, signifying their legitimate claim to the throne. Due to its specific historical context and relatively infrequent use, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The Byzantine emperor Constantine VII was known as 'the Porphyrogenite' to emphasize his legitimate birthright.","translation":"ビザンツ皇帝コンスタンティヌス7世は、正当な生得権を強調するために「紫室生まれ」として知られていた。","type":"noun","meaning_category":"historical figure"},{"sentence":"Being a porphyrogenite was seen as advantageous in the succession of the Byzantine throne.","translation":"紫室生まれであることは、ビザンツ帝国の王位継承において有利であると見なされていた。","type":"noun","meaning_category":"historical status"}]}