{"word":"Numismatists","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"貨幣研究家、古銭収集家","english_definition":"People who study or collect coins, medals, and paper money.","examples":[{"sentence":"Numismatists often study coins to learn about the history and culture of a particular era.","translation":"貨幣研究家は、特定の時代の歴史や文化を学ぶために、しばしば貨幣を研究します。"},{"sentence":"The convention was attended by numismatists from all over the world.","translation":"その会議には、世界中の貨幣研究家が出席しました。"}],"collocations":["collect coins","study medals","paper money collector"],"synonyms":["coin collector","currency expert"],"antonyms":[]}],"etymology":{"value":"The word \"numismatist\" comes from the word \"numismatics,\" which is derived from the Latin word \"numisma,\" meaning \"coin.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnjuːˈmɪzmətɪsts/","syllables":"Nu-mis-ma-tists"},"inflection":{"noun_plural":"Numismatists"},"usage_notes":{"explanation":"\"Numismatists\" refers to individuals who are passionate about the study and collection of coins, medals, and paper money. They often possess extensive knowledge about the history, art, and cultural significance of these items.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a numismatic.","correct":"✓ He is a numismatist.","note":"\"Numismatic\" is an adjective, while \"numismatist\" is the noun referring to a person."}],"priority":"★★☆"},"related_words":{"derivatives":["numismatic (adjective)","numismatics (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"numismatists\" refers to people who study or collect coins, medals, and paper money. It is a specialized term used in the context of history, economics, and collecting. Understanding this word requires a good grasp of academic vocabulary and specific interests."},"example_sentences":[{"sentence":"The numismatists gathered to discuss the rare coin collection.","translation":"貨幣研究家たちは、その珍しいコインコレクションについて話し合うために集まりました。","type":"noun","meaning_category":"貨幣研究家"}]}