{"word":"TSTS","priority":"☆☆☆","meanings":[{"part_of_speech":"acronym","definition":"(主にインターネットスラング) Too Stupid To Search の略","english_definition":"(Internet slang) An acronym for \"Too Stupid To Search,\" used to criticize someone for asking a question that could easily be answered by searching online.","examples":[{"sentence":"Instead of asking here, just Google it. TSTS.","translation":"ここで聞く代わりに、ググれば？検索するのには馬鹿すぎるってこと。"},{"sentence":"Someone asked how to change their profile picture. TSTS.","translation":"誰かがプロフィール写真の変え方を聞いてた。検索するのには馬鹿すぎる。"}],"collocations":["used in online forums","chat rooms","social media comments"],"synonyms":["RTFM (Read The Fucking Manual)","LMGTFY (Let Me Google That For You)"],"antonyms":[]}],"etymology":{"value":"The acronym is formed from the initial letters of the phrase \"Too Stupid To Search.\" It reflects a frustration with people who ask easily searchable questions online.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtiː ˈɛs ˈtiː ˈɛs/","syllables":"T-S-T-S (each letter pronounced separately)"},"inflection":{"notes":"As an acronym, it does not inflect."},"usage_notes":{"explanation":"\"TSTS\" is an internet slang acronym used to express annoyance or frustration with someone who asks a question that could easily be answered by a simple online search. It's often considered rude or condescending. The acronym is typically used in online forums, chat rooms, and social media comments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need help with my homework, TSTS.","correct":"✓ I need help with my homework. (No TSTS needed)","note":"\"TSTS\" is used to criticize others, not to describe oneself."},{"incorrect":"✗ TSTS is a helpful way to guide people.","correct":"✓ TSTS is a rude way to respond to questions.","note":"\"TSTS\" is generally considered impolite."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_acronyms":["RTFM (Read The Fucking Manual)","LMGTFY (Let Me Google That For You)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Internet slang)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"TSTS\" is an internet slang acronym that stands for \"Too Stupid To Search.\" It is used to express frustration with someone who asks a question that is easily answered by searching online. Because it is slang, it is not appropriate for formal communication. It is considered rude or condescending. It is mostly used in online forums and social media comments.","priority":"★★☆"},"example_sentences":[{"sentence":"Why are you asking me? TSTS.","translation":"なんで私に聞くの？自分で調べられないの？","type":"statement","meaning_category":"criticism"},{"sentence":"Just Google it, TSTS.","translation":"ググれよ、自分で検索できないのか。","type":"imperative","meaning_category":"criticism"}]}