{"word":"oportunismo","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(政治的・経済的・社会的な)日和見主義、機会主義","english_definition":"the practice of taking advantage of opportunities as they arise, regardless of principles or consequences.","examples":[{"sentence":"El oportunismo político es común en tiempos de crisis.","translation":"政治的な日和見主義は危機的な時代によく見られる。"},{"sentence":"Acusaron al gobierno de oportunismo por cambiar su política.","translation":"彼らは政府が政策を変更したことを機会主義だと非難した。"},{"sentence":"El oportunismo puede llevar a decisiones poco éticas.","translation":"日和見主義は非倫理的な決定につながる可能性がある。"}],"collocations":["oportunismo político (政治的日和見主義)","oportunismo económico (経済的機会主義)","caer en el oportunismo (日和見主義に陥る)","acusar de oportunismo (日和見主義だと非難する)"],"synonyms":["conveniencia","interés","egoísmo","pragmatismo","utilitarismo"],"antonyms":["idealismo","principios","ética","moralidad"]}],"etymology":{"value":"Del latín *opportunus*, compuesto de *ob* (delante de) y *portus* (puerto), significando originalmente 'favorable para llegar al puerto'. De ahí derivó a 'favorable' y, finalmente, a la acepción de aprovechar cualquier oportunidad, sin importar la moralidad.","priority":"★★☆"},"pronunciation":{"ipa":"/opoɾtuˈnizmo/","syllables":"o-por-tu-nis-mo"},"inflection":{"noun_plural":"oportunismos"},"usage_notes":{"explanation":"*Oportunismo* se refiere a la tendencia a aprovechar las circunstancias, a menudo de manera poco ética o deshonesta, para obtener un beneficio personal o político. Implica una falta de principios y una disposición a cambiar de opinión o de lealtad según convenga. Se utiliza frecuentemente en contextos políticos y económicos para criticar acciones que se consideran motivadas por el interés propio más que por el bien común.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ El oportunismo es bueno para la sociedad.","correct":"✓ El oportunismo puede ser perjudicial para la sociedad.","note":"El oportunismo generalmente tiene connotaciones negativas, por lo que es raro que se considere algo positivo para la sociedad."},{"incorrect":"✗ El oportunismo es lo mismo que la estrategia.","correct":"✓ El oportunismo no es lo mismo que la estrategia, aunque a veces pueden confundirse.","note":"La estrategia implica una planificación a largo plazo, mientras que el oportunismo se basa en aprovechar las oportunidades inmediatas."}],"priority":"★★☆"},"related_words":{"derivatives":["oportunista (adjetivo/sustantivo: oportunista)","oportunísticamente (adverbio: oportunísticamente)"],"phrases":["aprovechar la oportunidad (aprovechar la oportunidad)","estar al acecho (estar al acecho)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Moderada","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"*Oportunismo* es una palabra que describe la actitud de alguien que aprovecha las oportunidades, a menudo de manera poco ética, para su propio beneficio. Es un término que se usa en política, economía y en la vida cotidiana para criticar a quienes actúan por interés propio sin considerar las consecuencias para los demás. Requiere un buen nivel de comprensión del idioma para entender las sutilezas de su significado y su uso en diferentes contextos."},"example_sentences":[{"sentence":"El gobierno fue acusado de **oportunismo** al subir los impuestos justo antes de las elecciones.","translation":"The government was accused of **opportunism** for raising taxes just before the elections.","type":"noun","meaning_category":"日和見主義"},{"sentence":"Su **oportunismo** le permitió escalar rápidamente en la empresa, pero a costa de su reputación.","translation":"His **opportunism** allowed him to climb quickly in the company, but at the cost of his reputation.","type":"noun","meaning_category":"機会主義"},{"sentence":"El **oportunismo** en la política puede socavar la confianza pública.","translation":"**Opportunism** in politics can undermine public trust.","type":"noun","meaning_category":"日和見主義"}]}