{"word":"Thiocarbamide","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"チオ尿素","english_definition":"A crystalline compound with the formula SC(NH2)2, used in photography, as a reagent in analytical chemistry, and in the manufacture of pharmaceuticals.","examples":[{"sentence":"Thiocarbamide is used in the production of flame-retardant resins.","translation":"チオ尿素は難燃性樹脂の製造に使用されます。"},{"sentence":"The experiment involved the reaction of thiocarbamide with a metal complex.","translation":"その実験は、チオ尿素と金属錯体の反応を伴いました。"}],"collocations":["used as a reagent","synthesis of thiocarbamide","reaction with thiocarbamide"],"synonyms":["Thiourea"],"antonyms":[]}],"etymology":{"value":"Formed from thio- + carbamide. The 'thio-' prefix indicates the replacement of an oxygen atom in carbamide (urea) with a sulfur atom.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθaɪoʊˈkɑːrbəmaɪd/","syllables":"thi-o-car-ba-mide"},"inflection":{"noun_plural":"Thiocarbamides"},"usage_notes":{"explanation":"Thiocarbamide, also known as thiourea, is a chemical compound primarily used in industrial applications and chemical research. It is structurally similar to urea, but with an oxygen atom replaced by a sulfur atom. Due to its reactivity, it is used in various processes, but it should be handled with care due to its potential toxicity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Theocarbamide is the same as urea.","correct":"✓ Thiocarbamide is similar to urea but has sulfur instead of oxygen.","note":"Thiocarbamide and urea are similar in structure, but thiocarbamide contains sulfur, while urea contains oxygen."}],"priority":"★★☆"},"related_words":{"derivatives":["Thiourea"],"related_compounds":["Urea","Sulfur compounds"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thiocarbamide' is a technical term primarily used in chemistry and related fields. Understanding its usage requires a background in chemical nomenclature and an understanding of organic compounds. It is not commonly encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The synthesis of thiocarbamide involves reacting ammonium thiocyanate at high temperatures.","translation":"チオ尿素の合成には、チオシアン酸アンモニウムを高温で反応させることが含まれます。","type":"general","meaning_category":"chemical synthesis"},{"sentence":"Thiocarbamide is used as a photographic fixing agent.","translation":"チオ尿素は写真の定着剤として使用されます。","type":"application","meaning_category":"industrial use"}]}