{"word":"interradiating","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"放射状に相互に広がる、相互に放射する","english_definition":"Radiating from multiple points and intersecting; emitting rays that cross or mingle.","examples":[{"sentence":"The interradiating beams of light created a stunning visual effect.","translation":"相互に放射する光線が、素晴らしい視覚効果を生み出した。"},{"sentence":"The design featured interradiating lines emanating from a central point.","translation":"そのデザインは、中心点から放射状に広がり交差する線が特徴だった。"}],"collocations":["interradiating beams","interradiating lines","interradiating patterns"],"synonyms":["radiating","intersecting","emanating","diverging","converging"],"antonyms":["parallel","non-intersecting"]}],"etymology":{"value":"The word is formed by combining 'inter-' (meaning between or among) and 'radiating' (emitting rays).","priority":"★★★"},"pronunciation":{"ipa":"ˌɪntərˈreɪdiˌeɪtɪŋ","syllables":"in-ter-ra-di-a-ting"},"inflection":{"notes":"This is the present participle of the verb 'interradiate', which is rarely used. The adjective form is more common."},"usage_notes":{"explanation":"'Interradiating' describes something that has rays or lines spreading out from multiple points, crossing or mingling with each other. It's often used in descriptions of light, design, or patterns. It is a relatively uncommon word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sun was interradiating heat.","correct":"✓ The sun was radiating heat.","note":"'Interradiating' implies multiple sources. If there's only one source, use 'radiating'."}],"priority":"★★☆"},"related_words":{"derivatives":["interradiation (noun): the act of interradiating or the state of being interradiated","radiate (verb): to emit rays or waves","radiation (noun): the emission of energy as waves or particles"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Interradiating' is a technical word used to describe something that has multiple sources of radiation or rays that intersect. It is not commonly used in everyday language. Understanding the prefixes 'inter-' and the root word 'radiate' can help in understanding its meaning."},"example_sentences":[{"sentence":"The artist created a mesmerizing effect with interradiating colors on the canvas.","translation":"そのアーティストは、キャンバス上に相互に放射する色彩を用いて、魅惑的な効果を生み出した。","type":"adjective","meaning_category":"visual art"},{"sentence":"The interradiating network of sensors provided comprehensive coverage of the area.","translation":"相互に放射するセンサーネットワークにより、そのエリアを包括的にカバーすることができた。","type":"adjective","meaning_category":"technology"},{"sentence":"The interradiating patterns in the stained glass window were breathtaking.","translation":"ステンドグラスの窓の相互に放射する模様は息をのむほど美しかった。","type":"adjective","meaning_category":"architecture"}]}