{"word":"reliquia","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"聖遺物、遺品","english_definition":"A relic; an object surviving from an earlier time, especially one of historical or sentimental interest. In a religious context, it often refers to a part of a saint's body or belongings kept as an object of reverence.","examples":[{"sentence":"La reliquia de San Valentín se encuentra en la iglesia.","translation":"聖バレンタインの聖遺物は教会にあります。"},{"sentence":"El museo exhibe reliquias de la guerra civil.","translation":"博物館は内戦の遺品を展示しています。"}],"collocations":["reliquia sagrada (聖なる聖遺物)","reliquia histórica (歴史的な遺品)","reliquia familiar (家族の遺品)"],"synonyms":["relic","vestige","remnant","artifact","heirloom"],"antonyms":[]}],"etymology":{"value":"From Latin *reliquiae*, plural of *reliquia* ('remains, relics'), from *relinquere* ('to leave behind').","priority":"★★☆"},"pronunciation":{"ipa":"/reˈlikja/","syllables":"re-li-quia"},"inflection":{"noun_plural":"reliquias"},"usage_notes":{"explanation":"The word *reliquia* is primarily used in Spanish and Portuguese. It refers to objects that have survived from the past, often with historical or sentimental value. In a religious context, it specifically refers to relics of saints or other holy figures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Tengo una reliquia de mi abuela que es un coche moderno.","correct":"✓ Tengo una herencia de mi abuela que es un coche moderno.","note":"Reliquia refers to old objects, not modern ones. Use 'herencia' (inheritance) for modern items."}],"priority":"★☆☆"},"related_words":{"derivatives":["relicario (reliquary)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'reliquia' refers to an object that has survived from the past, often with historical or sentimental significance. It is commonly used in Spanish and Portuguese. In a religious context, it refers to a part of a saint's body or belongings kept as an object of reverence. It is not a very common word in everyday conversation but is used in historical or religious contexts."},"example_sentences":[{"sentence":"La reliquia familiar fue transmitida de generación en generación.","translation":"その家族の遺品は代々受け継がれてきた。","type":"noun","meaning_category":"遺品"},{"sentence":"La iglesia guarda una valiosa reliquia de un santo.","translation":"教会は聖人の貴重な聖遺物を保管している。","type":"noun","meaning_category":"聖遺物"}]}