{"word":"unquarreled","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"議論されていない、争われていない、異議を唱えられていない","english_definition":"Not disputed or contested; not subject to quarrel or argument.","examples":[{"sentence":"The decision was unquarreled by any member of the committee.","translation":"その決定は委員会のどのメンバーからも異議を唱えられなかった。"},{"sentence":"The facts of the case remain largely unquarreled.","translation":"その事件の事実は、ほとんど議論されていないままである。"},{"sentence":"The inheritance was unquarreled among the siblings.","translation":"その相続は兄弟間で争われることはなかった。"}],"collocations":["unquarreled decision","unquarreled facts","unquarreled inheritance"],"synonyms":["undisputed","uncontested","unchallenged","unquestioned","unargued"],"antonyms":["disputed","contested","challenged","questioned","argued"]}],"etymology":{"value":"\"Un-\" (not) + \"quarreled\" (past participle of \"quarrel,\" meaning to argue or dispute).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈkwɒrəld/","syllables":"un-quar-reled"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. It can be used in comparative and superlative forms, though these are rare: more unquarreled, most unquarreled."},"usage_notes":{"explanation":"\"Unquarreled\" is a relatively uncommon word, typically used in formal or legal contexts to indicate that something has not been subject to argument or dispute. It emphasizes the lack of contention or disagreement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unquarreled children played happily.","correct":"✓ The children played happily without quarreling.","note":"\"Unquarreled\" describes a situation or fact, not a characteristic of people. It's more appropriate to say the children didn't quarrel, rather than describing them as \"unquarreled.\""},{"incorrect":"✗ The unquarreled land was fertile.","correct":"✓ The ownership of the land was unquarreled.","note":"\"Unquarreled\" usually refers to a situation where there is a lack of dispute, particularly in ownership or facts. It does not describe the physical characteristics of something like land."}],"priority":"★★☆"},"related_words":{"derivatives":["quarrel (noun: an argument or disagreement; verb: to argue)","quarrelsome (adjective: inclined to argue)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unquarreled\" is a more advanced term that means something has not been disputed or argued about. It's often used in formal writing or legal contexts. Because it's not a common word, it's important to understand its specific meaning to avoid misusing it. It's related to the word \"quarrel,\" which means to argue or disagree.","priority":"★★☆"},"example_sentences":[{"sentence":"The historian presented unquarreled evidence to support his theory.","translation":"歴史家は自身の理論を裏付けるために、議論の余地のない証拠を提示した。","type":"adjective","meaning_category":"undisputed evidence"},{"sentence":"The terms of the contract were unquarreled by either party.","translation":"契約条件は両当事者から異議を唱えられなかった。","type":"adjective","meaning_category":"uncontested terms"},{"sentence":"The king's claim to the throne was unquarreled for many years.","translation":"王の王位継承権は長年争われることはなかった。","type":"adjective","meaning_category":"unchallenged claim"}]}