{"word":"usufructs","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"用益権 (財産を使用し、そこから利益を得る権利だが、所有権はない)","english_definition":"The right to enjoy the use and advantages of another's property short of the destruction or waste of its substance.","examples":[{"sentence":"The elderly woman granted her son usufructs to her property, while retaining ownership.","translation":"その老婦人は、所有権を保持したまま、息子に自分の財産の用益権を与えた。"},{"sentence":"The contract outlined the terms of the usufructs, including the duration and responsibilities.","translation":"契約書には、期間や責任など、用益権の条件が明記されていた。"}],"collocations":["grant usufructs (用益権を付与する)","exercise usufructs (用益権を行使する)","terms of usufructs (用益権の条件)","establish usufructs (用益権を設定する)","right of usufructs (用益権)"],"synonyms":["right of enjoyment","right of use","beneficial interest","leasehold (related, but not identical)"],"antonyms":["ownership","fee simple","full ownership"]},{"part_of_speech":"noun","definition":"(法律) 収益権","english_definition":"The legal right of enjoying the benefits and profits of something belonging to another.","examples":[{"sentence":"The farmer had usufructs to the land, allowing him to cultivate crops and sell them.","translation":"その農民は土地の収益権を持っており、作物を栽培して販売することができた。"}],"collocations":["land usufructs","mineral usufructs","grant usufructs"],"synonyms":["profit rights","benefit rights"],"antonyms":["ownership"]}],"etymology":{"value":"Derived from Latin 'usus' (use) + 'fructus' (fruit, enjoyment).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjuːzʊfrʌkts/","syllables":"u-su-fructs"},"inflection":{"noun_plural":"usufructs"},"usage_notes":{"explanation":"'Usufructs' refers to the legal right to use and derive profit or benefit from property that belongs to another person. The key distinction is that the usufructuary (the person holding the usufructs) does not own the property itself, and must generally maintain it and not damage or destroy it. This concept is more common in civil law jurisdictions than in common law systems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has the usufructs of the land, so he is the owner.","correct":"✓ He has the usufructs of the land, but he is not the owner.","note":"Usufructs implies the right to use and enjoy property, but not ownership."},{"incorrect":"✗ Usufructs allows him to sell the property.","correct":"✓ Usufructs allows him to use the property and profit from it, but not to sell it.","note":"Usufructs does not grant the right to sell the property."}],"priority":"★★☆"},"related_words":{"derivatives":["usufructuary (noun: the person holding the usufructs)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized legal vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Usufructs' is a specialized legal term. It refers to the right to use and benefit from someone else's property without owning it. This concept is more common in civil law systems. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The agreement granted him usufructs to the orchard for twenty years.","translation":"その合意により、彼は20年間果樹園の用益権を与えられた。","type":"noun","meaning_category":"用益権"},{"sentence":"She inherited usufructs to the family estate, allowing her to live there and collect rent.","translation":"彼女は家族の地所の用益権を相続し、そこに住み、賃料を徴収することができた。","type":"noun","meaning_category":"用益権"}]}