{"word":"gildable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"金箔を施せる、金メッキできる","english_definition":"Capable of being gilded; suitable for applying a layer of gold or a gold-like substance.","examples":[{"sentence":"The frame is gildable, so we can apply gold leaf to it.","translation":"そのフレームは金箔を施せるので、金箔を貼ることができます。"},{"sentence":"This plastic is not gildable because it doesn't hold the adhesive well.","translation":"このプラスチックは接着剤がうまく付かないので、金メッキできません。"}],"collocations":["gildable surface","gildable material","gildable frame"],"synonyms":["suitable for gilding","able to be gilded","gold-leafable"],"antonyms":["ungildable","non-gildable"]}],"etymology":{"value":"The word 'gildable' is formed by adding the suffix '-able' to the verb 'gild'. 'Gild' comes from the Old English word 'gyldan', meaning 'to cover with gold'. The suffix '-able' indicates capability or suitability.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɪldəbəl/","syllables":"gil-da-ble"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs (e.g., easily gildable, very gildable) but does not have different forms for tense or number."},"usage_notes":{"explanation":"'Gildable' is a relatively uncommon word, primarily used in contexts related to art, crafts, and manufacturing where the application of gold leaf or a gold-like coating is involved. It describes the property of a surface or material that makes it suitable for gilding.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gildable is very expensive.","correct":"✓ The gildable material is very expensive.","note":"'Gildable' is an adjective, so it needs to modify a noun. Using it as a noun is incorrect."},{"incorrect":"✗ This metal is gilding.","correct":"✓ This metal is gildable.","note":"'Gilding' is the process of applying gold, while 'gildable' describes the property of being suitable for that process."}],"priority":"★★☆"},"related_words":{"derivatives":["gild (verb)","gilder (noun)","gilding (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (too specialized)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gildable' is a specialized term primarily encountered in contexts related to art restoration, crafting, or manufacturing processes involving the application of gold leaf or similar coatings. It describes a material's suitability for being gilded. Due to its specific usage, it is not a common word in everyday language."},"example_sentences":[{"sentence":"The artist chose a gildable clay for the sculpture to give it a luxurious finish.","translation":"アーティストは、彫刻に豪華な仕上がりを与えるために、金箔を施せる粘土を選びました。","type":"adjective","meaning_category":"金箔を施せる"},{"sentence":"Ensure the surface is properly prepared to make it gildable.","translation":"表面が適切に準備されていることを確認して、金箔を施せるようにします。","type":"adjective","meaning_category":"金メッキできる"},{"sentence":"Not all metals are easily gildable; some require special treatments.","translation":"すべての金属が簡単に金メッキできるわけではありません。特別な処理が必要なものもあります。","type":"adjective","meaning_category":"金メッキできる"}]}