{"word":"cacotrophia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"栄養不良、不適切な栄養状態","english_definition":"A condition of malnutrition or improper nourishment.","examples":[{"sentence":"The child suffered from cacotrophia due to a lack of access to nutritious food.","translation":"その子供は栄養のある食べ物へのアクセス不足のため、栄養不良に苦しんだ。"},{"sentence":"Cacotrophia can lead to various health problems, including stunted growth and weakened immunity.","translation":"栄養不良は、発育阻害や免疫力低下など、さまざまな健康問題を引き起こす可能性がある。"}],"collocations":["severe cacotrophia","childhood cacotrophia","nutritional cacotrophia"],"synonyms":["malnutrition","undernourishment","inanition"],"antonyms":["eutrophia","good nutrition"]}],"etymology":{"value":"From the Greek words 'kakos' (bad) + 'trophe' (nourishment) + '-ia' (condition).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkækəˈtrɒfiə/","syllables":"ca-co-tro-phi-a"},"inflection":{"noun_plural":"cacotrophias"},"usage_notes":{"explanation":"'Cacotrophia' is a relatively rare term, often replaced by the more common 'malnutrition'. It specifically refers to the state of being poorly nourished, whether due to insufficient intake, improper absorption, or other factors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant suffered from cacotrophia due to lack of sunlight.","correct":"✓ The plant suffered from etiolation due to lack of sunlight.","note":"Cacotrophia specifically refers to malnutrition in living organisms, especially animals and humans. For plants, 'etiolation' or 'nutrient deficiency' would be more appropriate terms."}],"priority":"★★☆"},"related_words":{"derivatives":["cacotrophic (adjective)"],"related_medical_terms":["malabsorption","marasmus","kwashiorkor"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cacotrophia' is a technical term used in medicine and nutrition to describe a state of malnutrition. It is not commonly used in everyday language. Understanding this term requires a background in biology or medicine. It is more formal and less frequently used than 'malnutrition'."},"example_sentences":[{"sentence":"The doctor diagnosed the patient with cacotrophia after observing signs of severe weight loss and muscle wasting.","translation":"医師は、患者の深刻な体重減少と筋肉消耗の兆候を観察した後、栄養不良と診断した。","type":"medical","meaning_category":"malnutrition"},{"sentence":"Public health programs aim to combat cacotrophia in developing countries by providing access to fortified foods and nutritional education.","translation":"公衆衛生プログラムは、栄養強化食品へのアクセスと栄養教育を提供することにより、発展途上国における栄養不良との闘いを目指している。","type":"public health","meaning_category":"malnutrition"}]}