{"word":"mantappeaux","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(plural only) A type of protective clothing, specifically loose, sleeveless overcoats or cloaks, formerly worn by coachmen or other outdoor workers to shield them from the elements.","english_definition":"(plural only) Loose, sleeveless overcoats or cloaks formerly worn by coachmen or other outdoor workers.","examples":[{"sentence":"The coachmen donned their mantappeaux before setting out in the rain.","translation":"御者たちは雨の中出発する前にマントポーを着用した。"},{"sentence":"Old illustrations show workers in mantappeaux, protecting them from the wind and cold.","translation":"古いイラストには、風や寒さから身を守るためにマントポーを着た労働者が描かれている。"}],"collocations":["wear mantappeaux","coachman's mantappeaux","protective mantappeaux"],"synonyms":["cloak","overcoat","cape"],"antonyms":[]}],"etymology":{"value":"Borrowed from French *manteau*, meaning 'coat' or 'cloak', with a plural ending. The exact historical evolution and usage are somewhat obscure.","priority":"★★☆"},"pronunciation":{"ipa":"/mɑ̃.ta.po/","syllables":"man-ta-po"},"inflection":{"noun_plural":"mantappeaux"},"usage_notes":{"explanation":"The term *mantappeaux* is relatively rare and archaic. It specifically refers to a type of protective outerwear worn historically by coachmen and other outdoor workers. It is almost exclusively used in the plural form.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a mantappeaux.","correct":"✓ They wore mantappeaux.","note":"The word is almost always used in the plural form."}],"priority":"★☆☆"},"related_words":{"derivatives":["manteau (French origin, meaning coat or cloak)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word *mantappeaux* is a rare, archaic term referring to a type of protective outerwear. Due to its specialized and historical context, it is unlikely to be encountered outside of specific historical or literary contexts. Understanding requires familiarity with historical clothing and potentially French vocabulary."},"example_sentences":[{"sentence":"The museum exhibit featured several examples of mantappeaux used by 18th-century coachmen.","translation":"博物館の展示では、18世紀の御者が使用したマントポーのいくつかの例が展示されていた。","type":"noun","meaning_category":"protective clothing"},{"sentence":"Descriptions of the livery often included details about the style and material of the mantappeaux.","translation":"制服の説明には、マントポーのスタイルと素材に関する詳細が含まれていることが多かった。","type":"noun","meaning_category":"protective clothing"}]}