{"word":"Gyges","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"ギュゲス（古代リディアの伝説的な王）","english_definition":"Legendary king of Lydia known from Greek mythology and Herodotus' Histories","examples":[{"sentence":"Gyges seized the Lydian throne after killing King Candaules.","translation":"ギュゲスはカンダウレス王を殺害した後、リディアの王座を奪った"},{"sentence":"The story of Gyges appears in Plato's Republic as the tale of the Ring of Gyges.","translation":"ギュゲスの物語はプラトンの『国家』においてギュゲスの指輪の寓話として登場する"}],"cultural_context":"Plato used Gyges in his moral philosophy thought experiment about whether a person would remain just if they could act with impunity","synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"ギュゲス（ギリシャ神話に登場する百腕巨人ヘカトンケイルの一人）","english_definition":"One of the Hecatoncheires (Hundred-Handed Ones) in Greek mythology","examples":[{"sentence":"Gyges was one of the three hundred-handed giants who aided Zeus in the Titanomachy.","translation":"ギュゲスはティタノマキアでゼウスを助けた三体の百腕巨人の一人であった"}],"mythological_context":"The Hecatoncheires were primordial beings with fifty heads and one hundred arms","synonyms":["Gyes"],"antonyms":[]}],"etymology":{"value":"古代ギリシャ語 Γύγης (Gýgēs) に由来。語源は不明だが、リディア語起源の可能性がある","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈdʒaɪdʒiːz/","syllables":"Gy-ges"},"usage_notes":{"explanation":"1. 歴史的文脈では紀元前7世紀のリディア王を指す\n2. 哲学的文脈ではプラトン『国家』第2巻の「ギュゲスの指輪」寓話で知られる\n3. 神話的文脈ではウラノスとガイアの子である百腕巨人を指す","priority":"★★☆"},"related_words":{"derivatives":["Ring of Gyges (ギュゲスの指輪)"],"mythological_figures":["Hecatoncheires (百腕巨人)","Briareus (ブリアレオス)","Cottus (コットス)"],"historical_figures":["Croesus (クロイソス)","Alyattes (アリュアッテス)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な歴史/哲学/神話用語)","frequency_google_ngram":"低頻度 (Low frequency) - 専門的文脈でのみ出現","priority":"★☆☆"},"example_sentences":[{"sentence":"The Ring of Gyges thought experiment questions whether people would remain moral if they could act without consequences.","translation":"ギュゲスの指輪の思考実験は、人が結果を気にせず行動できる場合に道徳的であり続けるかどうかを問う","type":"philosophical context","meaning_category":"倫理哲学"},{"sentence":"According to Herodotus, Gyges founded the Mermnad dynasty that ruled Lydia for nearly 150 years.","translation":"ヘロドトスによれば、ギュゲスは約150年間リディアを支配したメルムナス朝を創始した","type":"historical context","meaning_category":"古代史"},{"sentence":"In Hesiod's Theogony, Gyges and his brothers were imprisoned by Uranus in Tartarus.","translation":"ヘシオドスの『神統記』では、ギュゲスとその兄弟たちはウラノスによってタルタロスに閉じ込められた","type":"mythological context","meaning_category":"ギリシャ神話"}]}