{"word":"toxiphobiac","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"毒物恐怖症の人","english_definition":"A person who has toxiphobia (an abnormal and persistent fear of being poisoned).","examples":[{"sentence":"The toxiphobiac refused to eat anything that wasn't prepared in front of them.","translation":"その毒物恐怖症の人は、目の前で調理されたもの以外は何も食べようとしなかった。"},{"sentence":"As a toxiphobiac, he avoided all processed foods and medications.","translation":"毒物恐怖症として、彼はすべての加工食品と薬を避けた。"}],"collocations":["severe toxiphobiac","recovering toxiphobiac"],"synonyms":["poison phobic"],"antonyms":[],"related_terms":["toxiphobia"]}],"etymology":{"value":"From 'toxiphobia' (fear of poison) + '-ac' (denoting someone who suffers from a condition).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɒksɪˈfoʊbiæk/","syllables":"tox-i-pho-bi-ac"},"inflection":{"noun_plural":"toxiphobiacs"},"usage_notes":{"explanation":"'Toxiphobiac' refers specifically to an individual suffering from toxiphobia. It's not a commonly used term but is understood in contexts discussing phobias and mental health. The term highlights the person's condition rather than just the fear itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is toxiphobia.","correct":"✓ He is a toxiphobiac.","note":"'Toxiphobia' is the phobia itself, while 'toxiphobiac' is the person suffering from it. Use the correct term to describe the person."}],"priority":"★★☆"},"related_words":{"derivatives":["toxiphobia"],"related_terms":["phobia","anxiety","mental health"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Toxiphobiac' is a specialized term used to describe someone who suffers from toxiphobia, which is the fear of being poisoned. This word is not commonly used in everyday conversation but may appear in discussions related to psychology, mental health, or phobias. Understanding this term requires familiarity with medical and psychological vocabulary."},"example_sentences":[{"sentence":"The therapist worked with the toxiphobiac to address their anxieties.","translation":"セラピストは毒物恐怖症の人と協力して、彼らの不安に対処した。","type":"general","meaning_category":"general"},{"sentence":"As a self-described toxiphobiac, she scrutinized every ingredient in her food.","translation":"自称毒物恐怖症として、彼女は自分の食べ物に含まれるすべての成分を精査した。","type":"general","meaning_category":"general"}]}