{"word":"goliardic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"放蕩学生の、吟遊詩人の、風刺的な","english_definition":"Of or relating to the goliards, medieval wandering students and clerics who wrote satirical Latin poetry, often celebrating drinking, revelry, and carnal love.","examples":[{"sentence":"The play had a goliardic spirit, full of irreverence and wit.","translation":"その劇は放蕩学生のような精神に満ちており、不敬と機知に富んでいた。"},{"sentence":"His poems are reminiscent of goliardic verse, with their playful cynicism.","translation":"彼の詩は、その遊び心のあるシニシズムで、吟遊詩人の詩を彷彿とさせる。"}],"collocations":["goliardic verse","goliardic poetry","goliardic spirit"],"synonyms":["satirical","irreverent","bawdy","licentious","debauched"],"antonyms":["reverent","solemn","moralistic"]}],"etymology":{"value":"From 'goliard,' referring to wandering students and clerics in medieval Europe who wrote satirical Latin verse. The origin of 'goliard' is uncertain, possibly from 'Goliath' (the biblical giant), suggesting a figure of ridicule or wandering.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡoʊliˈɑːrdɪk/","syllables":"go-li-ar-dic"},"inflection":{"notes":"This word is an adjective and does not have plural forms."},"usage_notes":{"explanation":"'Goliardic' is used to describe something that resembles the style or spirit of the goliards, medieval wandering students and clerics known for their satirical and often bawdy Latin poetry. It often implies a sense of irreverence, wit, and a celebration of earthly pleasures. The term is relatively rare in modern usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived a goliardic life of solitude.","correct":"✓ He lived a goliardic life of revelry and excess.","note":"The goliards were known for their communal and often excessive lifestyle, not solitude."}],"priority":"★☆☆"},"related_words":{"derivatives":["goliard (noun: a wandering student or cleric in medieval Europe who wrote satirical Latin verse)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'goliardic' is a relatively rare and specialized term, primarily used in literary or historical contexts to describe something related to the goliards, medieval wandering students and clerics known for their satirical Latin poetry. Understanding the historical and cultural context of the goliards is essential for comprehending the meaning of 'goliardic.'"},"example_sentences":[{"sentence":"The collection features several examples of goliardic poetry, with their characteristic blend of humor and social criticism.","translation":"そのコレクションには、ユーモアと社会批判が特徴的な、放蕩学生の詩のいくつかの例が含まれている。","type":"adjective","meaning_category":"放蕩学生の、風刺的な"},{"sentence":"The film captured the goliardic atmosphere of the medieval university, with its students drinking and singing in the streets.","translation":"その映画は、中世の大学の放蕩学生的な雰囲気を捉えており、学生たちが通りで飲み、歌っていた。","type":"adjective","meaning_category":"放蕩学生の、風刺的な"}]}