{"word":"stratigraphy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"層位学、地層学","english_definition":"The branch of geology concerned with the study of rock layers (strata) and their layering. It is primarily used in the study of sedimentary and layered volcanic rocks.","examples":[{"sentence":"Stratigraphy is essential for understanding the geological history of an area.","translation":"層位学は、ある地域の地質学的歴史を理解するために不可欠です。"},{"sentence":"The stratigraphy of the Grand Canyon reveals millions of years of geological activity.","translation":"グランドキャニオンの層位学は、数百万年にわたる地質活動を明らかにしています。"},{"sentence":"Detailed stratigraphy can help in the exploration for oil and gas deposits.","translation":"詳細な層位学は、石油やガス鉱床の探査に役立ちます。"}],"collocations":["sequence stratigraphy (シーケンス層位学)","lithostratigraphy (岩相層位学)","biostratigraphy (生層位学)","chronostratigraphy (時間層位学)","seismic stratigraphy (地震層位学)","stratigraphic column (層序柱状図)","stratigraphic record (層序記録)","stratigraphic unit (層序単位)"],"synonyms":["geochronology","geology","sedimentology","historical geology"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'stratum' (layer) and the Greek 'graphia' (writing, description).","priority":"★★★"},"pronunciation":{"ipa":"/strəˈtɪɡrəfi/","syllables":"stra-tig-ra-phy"},"inflection":{"noun_plural":"stratigraphies"},"usage_notes":{"explanation":"Stratigraphy is a fundamental tool in geology, used to determine the relative ages of rocks and to understand the sequence of events that have shaped the Earth's surface. It involves the study of the composition, distribution, and age relationships of sedimentary and volcanic rock layers. Different types of stratigraphy focus on different aspects of the rock layers, such as their lithology (lithostratigraphy), fossil content (biostratigraphy), or age (chronostratigraphy).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Stratigraphy is the study of all rocks.","correct":"✓ Stratigraphy is the study of layered rocks, especially sedimentary and volcanic rocks.","note":"Stratigraphy focuses primarily on layered rocks, not all types of rocks."},{"incorrect":"✗ Stratigraphy can determine the absolute age of rocks.","correct":"✓ Stratigraphy primarily determines the relative age of rocks; radiometric dating is used for absolute age determination.","note":"While stratigraphy helps establish the sequence of events, absolute dating methods are needed for precise ages."}],"priority":"★★☆"},"related_words":{"derivatives":["stratigraphic (形容詞: 層位学的な)","stratigrapher (名詞: 層位学者)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Stratigraphy is a specialized term used in geology. It refers to the study of rock layers (strata) and how they are arranged. This helps geologists understand the history of the Earth, including how different layers formed over time and the relative ages of these layers. It's important for understanding geological events and for finding resources like oil and gas.","priority":"★★☆"},"example_sentences":[{"sentence":"The **stratigraphy** of the region indicated a long history of marine sedimentation.","translation":"その地域の層位学は、海洋堆積の長い歴史を示していました。","type":"noun","meaning_category":"層位学"},{"sentence":"**Stratigraphy** helps geologists correlate rock layers across different locations.","translation":"層位学は、地質学者が異なる場所の岩石層を関連付けるのに役立ちます。","type":"noun","meaning_category":"層位学"},{"sentence":"Understanding the **stratigraphy** is crucial for interpreting the fossil record.","translation":"層位学を理解することは、化石記録を解釈するために重要です。","type":"noun","meaning_category":"層位学"}]}