{"word":"tilling","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"耕すこと、耕作すること","english_definition":"The act of preparing land for raising crops by loosening or breaking up the soil.","examples":[{"sentence":"Tilling the soil helps to aerate it and prepare it for planting.","translation":"土を耕すことは、土壌に通気性を持たせ、植え付けの準備をするのに役立ちます。"},{"sentence":"Modern farming techniques often reduce the amount of tilling to prevent soil erosion.","translation":"現代の農業技術は、土壌浸食を防ぐために耕作の量を減らすことがよくあります。"}],"collocations":["soil tilling","reduced tilling","no-till farming"],"synonyms":["plowing","cultivating","turning the soil","preparing the ground"],"antonyms":["no-till farming","conservation tillage"]},{"part_of_speech":"noun","definition":"耕作、耕耘","english_definition":"The process of preparing land for growing crops.","examples":[{"sentence":"The farmer was busy with the tilling of his fields in the spring.","translation":"農家は春に畑の耕作で忙しかった。"},{"sentence":"Tilling can improve soil structure and drainage.","translation":"耕作は土壌構造と排水を改善することができます。"}],"collocations":["deep tilling","surface tilling","tilling depth"],"synonyms":["cultivation","plowing","soil preparation"],"antonyms":["no-till farming"]}],"etymology":{"value":"From the verb 'till', which comes from Old English 'tilian' meaning 'to cultivate, work, endeavor'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɪlɪŋ/","syllables":"til-ling"},"inflection":{"verb_forms":{"present_participle":"tilling"}},"usage_notes":{"explanation":"'Tilling' refers to the process of preparing soil for planting, usually by plowing, harrowing, or otherwise disturbing the soil surface. It is often done to improve soil aeration, drainage, and seedbed preparation. However, excessive tilling can lead to soil erosion and loss of organic matter.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is tilling the ground with a tractor last week.","correct":"✓ He tilled the ground with a tractor last week.","note":"Use the past tense 'tilled' when referring to a completed action in the past."},{"incorrect":"✗ Tilling is very important for no-till farming.","correct":"✓ Tilling is avoided in no-till farming.","note":"Tilling is the opposite of no-till farming."}],"priority":"★★☆"},"related_words":{"derivatives":["till (verb, noun)","tiller (noun)","tillable (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Tilling' is a term used in agriculture to describe the process of preparing the soil for planting crops. It involves breaking up and turning over the soil to improve aeration, drainage, and seedbed conditions. While tilling can be beneficial, it can also have negative impacts on soil health, such as erosion and loss of organic matter. Therefore, modern farming practices often focus on reducing or eliminating tilling through methods like no-till farming or conservation tillage."},"example_sentences":[{"sentence":"The farmer is tilling the field with a tractor.","translation":"農家はトラクターで畑を耕しています。","type":"verb","meaning_category":"耕すこと"},{"sentence":"The tilling of the soil is essential for good crop growth.","translation":"土壌の耕作は、作物の良好な成長に不可欠です。","type":"noun","meaning_category":"耕作"}]}