{"word":"Ullr","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ウル、北欧神話の神。狩猟、スキー、弓術、盾の神。","english_definition":"Ullr is a god in Norse mythology associated with hunting, skiing, archery, and shields.","examples":[{"sentence":"Ullr is known for his skill as a skier.","translation":"ウルはスキーヤーとしての腕前で知られている。"},{"sentence":"In some accounts, Ullr is associated with magic and prophecy.","translation":"いくつかの記述では、ウルは魔法や予言と関連付けられている。"}],"collocations":["god of skiing","Norse mythology","hunting god","archery god"],"synonyms":["none (unique deity)"],"antonyms":["none (unique deity)"]}],"etymology":{"value":"The name 'Ullr' comes from the Old Norse word 'Ullr', which is of uncertain origin but may be related to words meaning 'glory' or 'splendor'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʊlər/","syllables":"Ull-r (2 syllables)"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"Ullr is a relatively obscure figure in Norse mythology compared to gods like Odin or Thor. However, he is mentioned in several important sources, including the Poetic Edda and the Prose Edda. His association with winter sports and hunting suggests he was important to the Norse people in their daily lives.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["Ull (alternative spelling)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Proper noun, mythological figure)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Ullr is a proper noun referring to a specific deity in Norse mythology. Understanding references to Ullr requires familiarity with Norse mythology and its associated texts. The name itself and the concepts associated with the deity are not part of everyday vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The saga mentions Ullr's skill in archery.","translation":"そのサガはウルの弓術の腕前について言及している。","type":"noun","meaning_category":"神話の神"},{"sentence":"Some scholars believe Ullr was a more prominent god in earlier Norse paganism.","translation":"一部の学者は、ウルは初期の北欧の異教においてより重要な神だったと考えている。","type":"noun","meaning_category":"神話の神"}]}