{"word":"counterplotter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"陰謀に対抗する人、対抗陰謀を企てる人","english_definition":"A person who plots against a plot; one who devises a counterplot.","examples":[{"sentence":"The king suspected a counterplotter within his own court.","translation":"王は自身の宮廷内に陰謀に対抗する者がいるのではないかと疑った。"},{"sentence":"Identifying the counterplotter was crucial to the success of their original plan.","translation":"対抗陰謀を企てる者を特定することが、彼らの当初の計画の成功にとって重要だった。"}],"collocations":["identify a counterplotter","expose a counterplotter","unmask a counterplotter"],"synonyms":["opponent","rival","adversary","conspirator"],"antonyms":["ally","supporter","accomplice"]}],"etymology":{"value":"'Counter-' (against) + 'plotter' (one who plots).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkaʊntərˌplɒtər/","syllables":"coun-ter-plot-ter"},"inflection":{"noun_plural":"counterplotters"},"usage_notes":{"explanation":"'Counterplotter' refers specifically to someone who is actively engaged in creating a plan to thwart or undermine another person's or group's plot. It implies a level of active opposition and strategic planning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a counterplotter, so he helped the king.","correct":"✓ He was a counterplotter, so he worked against the king's enemies.","note":"A counterplotter works against the original plotters, not in support of them."}],"priority":"★☆☆"},"related_words":{"derivatives":["counterplot (noun/verb)","plotter (noun)","plot (noun/verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'counterplotter' is relatively uncommon and is used in contexts involving intrigue, political maneuvering, or complex strategic situations. It requires an understanding of the base words 'plot' and 'counter-' to fully grasp its meaning. It is more likely to be encountered in literature, historical texts, or discussions of espionage. "},"example_sentences":[{"sentence":"The novel features a cunning counterplotter who always seems one step ahead.","translation":"その小説には、常に一歩先を行く狡猾な対抗陰謀者が登場する。","type":"noun","meaning_category":"陰謀に対抗する人"},{"sentence":"The queen's advisor was revealed to be a counterplotter, working to undermine her authority.","translation":"女王の顧問は、彼女の権威を弱体化させるために働く対抗陰謀者であることが明らかになった。","type":"noun","meaning_category":"陰謀に対抗する人"}]}