{"word":"outsmiled","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)より笑顔で勝る、(人)の笑顔を上回る","english_definition":"To smile more than someone else, especially in a competitive or challenging situation; to surpass someone in smiling.","examples":[{"sentence":"She outsmiled her opponent during the press conference, making her seem more confident.","translation":"彼女は記者会見で対戦相手よりも笑顔で勝り、より自信があるように見せた。"},{"sentence":"No matter how hard he tried, he couldn't outsmile her; she always had a brighter, more genuine smile.","translation":"彼がどんなに頑張っても、彼女の笑顔には勝てなかった。彼女はいつもより明るく、より自然な笑顔をしていた。"}],"collocations":["outsmile an opponent","outsmile the competition","outsmile everyone"],"synonyms":["surpass in smiling","smile more than","outshine with a smile"],"antonyms":["frown at","scowl at","look gloomier than"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(困難・逆境)を笑顔で乗り越える、(困難・逆境)に笑顔で打ち勝つ","english_definition":"To overcome a difficulty or adversity with a smile; to maintain a positive and cheerful attitude in the face of challenges.","examples":[{"sentence":"She outsmiled every obstacle in her path, never letting anything get her down.","translation":"彼女は行く手に立ちはだかるあらゆる障害を笑顔で乗り越え、決してくじけることはなかった。"},{"sentence":"Despite the bad news, he outsmiled the situation and remained optimistic.","translation":"悪い知らせにもかかわらず、彼は笑顔で状況を乗り越え、楽観的な姿勢を保った。"}],"collocations":["outsmile adversity","outsmile challenges","outsmile hardship"],"synonyms":["face with a smile","overcome with cheerfulness","remain positive despite"],"antonyms":["succumb to","be defeated by","give in to"]}],"etymology":{"value":"Formed by combining the prefix 'out-' (meaning 'more than' or 'to surpass') with the verb 'smiled'. The word suggests exceeding or triumphing through the act of smiling.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊtˈsmaɪld/","syllables":"out-smiled"},"inflection":{"verb_forms":{"present_simple":["outsmile","outsmiles"],"past_simple":"outsmiled","past_participle":"outsmiled","present_participle":"outsmiling"}},"usage_notes":{"explanation":"'Outsmiled' is a relatively uncommon word, but it is easily understood due to its straightforward construction. It implies a deliberate or unintentional act of smiling more effectively or brightly than someone else, often in a context of competition, challenge, or adversity. It can also mean to maintain a cheerful demeanor despite difficulties. The word is often used figuratively.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She outsmiled to her rival.","correct":"✓ She outsmiled her rival.","note":"'Outsmile' is a transitive verb, so it takes a direct object without the need for a preposition like 'to'."},{"incorrect":"✗ He was outsmiled by the bad news.","correct":"✓ He outsmiled the bad news.","note":"When used in the sense of overcoming adversity, 'outsmile' takes the adversity as the direct object, not as the subject."}],"priority":"★★☆"},"related_words":{"derivatives":["outsmiling (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Outsmiled' is a relatively advanced word that combines the common verb 'smile' with the prefix 'out-'. Its meaning is generally clear from its construction: to smile more than someone else or to overcome something with a smile. It is not a frequently used word, but it is easily understood in context. Understanding the prefix 'out-' is helpful in deciphering its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The politician outsmiled his critics, deflecting their attacks with a confident grin.","translation":"その政治家は自信に満ちた笑みで批判をかわし、批判者たちを笑顔で打ち負かした。","type":"verb (vt)","meaning_category":"笑顔で勝る"},{"sentence":"She outsmiled the pain and continued to dance, captivating the audience.","translation":"彼女は痛みを笑顔で乗り越え、踊り続け、観客を魅了した。","type":"verb (vt)","meaning_category":"笑顔で乗り越える"}]}