{"word":"neurodegeneration","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"神経変性","english_definition":"the progressive loss of structure or function of neurons, including death of neurons.","examples":[{"sentence":"Neurodegeneration is a feature of many neurological diseases.","translation":"神経変性は多くの神経疾患の特徴です。"},{"sentence":"Research is focused on finding treatments to slow neurodegeneration.","translation":"研究は神経変性を遅らせる治療法を見つけることに焦点が当てられています。"}],"collocations":["cause neurodegeneration (神経変性を引き起こす)","prevent neurodegeneration (神経変性を防ぐ)","study neurodegeneration (神経変性を研究する)","neurodegeneration research (神経変性研究)","age-related neurodegeneration (加齢に伴う神経変性)"],"synonyms":["neuronal degeneration","nerve cell degeneration"],"antonyms":["neurogenesis","neuronal regeneration"]}],"etymology":{"value":"\"neuro-\" (神経) + \"degeneration\" (変性)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnjʊəroʊdɪˌdʒɛnəˈreɪʃən/","syllables":"neu-ro-de-gen-er-a-tion"},"inflection":{"noun_plural":"neurodegenerations"},"usage_notes":{"explanation":"Neurodegeneration refers to the progressive decline and death of nerve cells (neurons) in the brain and spinal cord. It is a hallmark of many neurological disorders, including Alzheimer's disease, Parkinson's disease, Huntington's disease, and amyotrophic lateral sclerosis (ALS). The causes of neurodegeneration are complex and can involve genetic factors, environmental factors, aging, and other underlying conditions. Research in this field aims to understand the mechanisms of neurodegeneration and develop therapies to prevent or slow down its progression.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Neurodegeneration is cure.","correct":"✓ Neurodegeneration is not curable. / ✓ There is no cure for neurodegeneration.","note":"神経変性は現状では治療法がないため、\"cure\" (治療) ではなく、\"not curable\" (治療不可能) または \"There is no cure\" (治療法はない) と表現するのが適切です。"},{"incorrect":"✗ Neurodegeneration only affects old people.","correct":"✓ Neurodegeneration is more common in older people, but it can affect younger people as well.","note":"神経変性は高齢者に多いですが、若い人も発症する可能性があります。"},{"incorrect":"✗ Neurodegeneration is the same as dementia.","correct":"✓ Neurodegeneration can cause dementia, but dementia has other causes as well.","note":"神経変性は認知症の原因の一つですが、認知症の原因は他にもあります。"}],"priority":"★★☆"},"related_words":{"derivatives":["neurodegenerative (adjective)"],"related_terms":["apoptosis (アポトーシス)","protein aggregation (タンパク質凝集)","oxidative stress (酸化ストレス)","inflammation (炎症)","mitochondrial dysfunction (ミトコンドリア機能不全)","synaptic dysfunction (シナプス機能不全)"],"priority":"★★☆"},"level_frequency":{"frequency_corpus":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Neurodegeneration\" is a complex term referring to the progressive loss of nerve cell structure or function. It's a key feature of many brain diseases, like Alzheimer's and Parkinson's. The process involves the gradual damage and death of neurons, leading to impaired brain function. Understanding neurodegeneration is crucial for developing treatments for these debilitating conditions.","priority":"★★☆"},"example_sentences":[{"sentence":"Alzheimer's disease is characterized by neurodegeneration in specific brain regions.","translation":"アルツハイマー病は、特定の脳領域における神経変性を特徴とする。","type":"general"},{"sentence":"Genetic mutations can increase the risk of neurodegeneration.","translation":"遺伝子変異は神経変性のリスクを高める可能性がある。","type":"cause"},{"sentence":"Researchers are investigating the role of inflammation in neurodegeneration.","translation":"研究者たちは神経変性における炎症の役割を調査している。","type":"research"},{"sentence":"Early diagnosis can help manage the symptoms of neurodegeneration.","translation":"早期診断は神経変性の症状を管理するのに役立つ。","type":"diagnosis"},{"sentence":"There is currently no cure for most neurodegeneration disorders.","translation":"現在、ほとんどの神経変性疾患に対する治療法はない。","type":"treatment"}]}