{"word":"paradoxician","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"逆説を好む人、逆説的な議論をする人","english_definition":"A person who likes paradoxes or argues paradoxically.","examples":[{"sentence":"He was known as a paradoxician, always challenging conventional wisdom with his seemingly contradictory statements.","translation":"彼は逆説を好む人として知られており、常に一見矛盾する発言で従来の知恵に挑戦していた。"}],"collocations":["philosophical paradoxician","intellectual paradoxician"],"synonyms":["paradoxist","dialectician","sophist"],"antonyms":["conventionalist","conformist"]}],"etymology":{"value":"'paradox'（逆説）+ '-ician'（～主義者、～専門家）","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærədɒkˈsɪʃən/","syllables":"par-a-dox-i-cian"},"inflection":{"noun_plural":"paradoxicians"},"usage_notes":{"explanation":"'Paradoxician' is a relatively rare word, more commonly found in philosophical or academic contexts. It describes someone who is drawn to paradoxes, either as a subject of study or as a rhetorical device.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a paradoxician because he is very contradictory.","correct":"He is a paradoxician because he enjoys exploring contradictions and challenging assumptions.","note":"Paradoxicians are not simply contradictory; they use paradoxes to stimulate thought and reveal deeper truths."}],"priority":"★★☆"},"related_words":{"derivatives":["paradox","paradoxical","paradoxically"],"related_terms":["oxymoron","contradiction","antinomy"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'paradoxician' is a niche term primarily used in philosophical or academic discussions. Understanding requires familiarity with the concept of a paradox and the suffix '-ician,' which denotes a person associated with a particular field or activity."},"example_sentences":[{"sentence":"The professor, a self-proclaimed paradoxician, delighted in presenting arguments that seemed impossible but held a kernel of truth.","translation":"その教授は、自称逆説主義者であり、不可能に見えるが真実の核を持つ議論を提示することを喜んだ。","type":"noun","meaning_category":"逆説を好む人"}]}