{"word":"refringency","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"複屈折、複折率","english_definition":"The property of a substance of having different refractive indices in different directions.","examples":[{"sentence":"The refringency of the crystal was measured using a polarising microscope.","translation":"その結晶の複屈折は偏光顕微鏡を用いて測定された。"},{"sentence":"Refringency is an important characteristic in identifying minerals.","translation":"複屈折は鉱物を特定する上で重要な特性である。"}],"collocations":["measure refringency","high refringency","low refringency"],"synonyms":["birefringence","double refraction"],"antonyms":["isotropy"]}],"etymology":{"value":"Derived from 'refringent' (capable of refracting light), which comes from Latin 'refringens', present participle of 'refringere' (to break back, refract), from 're-' (back) + 'frangere' (to break).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈfrɪndʒənsi/","syllables":"re-frin-gen-cy"},"inflection":{"noun_plural":"refringencies"},"usage_notes":{"explanation":"'Refringency' is a technical term primarily used in physics, mineralogy, and optics. It describes the phenomenon where a material exhibits different refractive indices depending on the polarization and direction of light passing through it. This property is crucial in identifying certain crystalline materials and is related to the material's anisotropy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The refringency was high because of the temperature.","correct":"✓ The refringency was high due to the temperature.","note":"'Due to' is generally preferred over 'because of' when following a form of the verb 'to be'."},{"incorrect":"✗ The refringency is when light bends.","correct":"✓ Refringency is the property of a material that causes light to bend differently depending on its polarization and direction.","note":"Refringency is not the bending of light itself (refraction), but the property that causes different degrees of refraction."}],"priority":"★☆☆"},"related_words":{"derivatives":["refringent (adjective)","refract (verb)","refraction (noun)","refractive index (noun)"],"related_terms":["anisotropy","isotropy","polarization","birefringence","optics","mineralogy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Technical vocabulary)","frequency_google_ngram":"Very low frequency (specialized scientific term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Refringency' is a specialized term used in fields like physics and mineralogy. It refers to the property of certain materials, particularly crystals, to refract light differently depending on the direction and polarization of the light. This means that light passing through the material will split into two rays that travel at different speeds and in different directions. The degree of this difference is what is measured as refringency. It's an important concept for identifying minerals and understanding the optical properties of anisotropic materials."},"example_sentences":[{"sentence":"The geologist used the crystal's refringency to identify its composition.","translation":"地質学者はその結晶の複屈折を利用して、その組成を特定した。","type":"general","meaning_category":"複屈折の利用"},{"sentence":"High refringency can indicate a strong degree of molecular alignment within the material.","translation":"高い複屈折は、材料内の分子配列の強い程度を示す可能性がある。","type":"scientific","meaning_category":"複屈折の指標"},{"sentence":"The refringency of the sample was measured at various wavelengths.","translation":"試料の複屈折は様々な波長で測定された。","type":"technical","meaning_category":"複屈折の測定"}]}