{"word":"unforfeitable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(権利などが)剥奪できない、没収できない","english_definition":"(of a right, etc.) that cannot be taken away or forfeited.","examples":[{"sentence":"The employee has an unforfeitable right to their pension benefits.","translation":"従業員は年金給付を受ける剥奪不可能な権利を有する。"},{"sentence":"The land grant included an unforfeitable title.","translation":"その土地の払い下げには、剥奪不可能な権利が含まれていた。"}],"collocations":["unforfeitable right","unforfeitable title","unforfeitable interest"],"synonyms":["inalienable","nonforfeitable","vested","guaranteed"],"antonyms":["forfeitable","revocable","alienable"]}],"etymology":{"value":"\"un-\" (否定) + \"forfeitable\" (没収可能な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnfɔːrˈfɪtəbəl/","syllables":"un-for-fit-a-ble"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"\"Unforfeitable\" is a relatively formal and legalistic term. It is often used in the context of contracts, property rights, and employment benefits. It indicates that a right or benefit is guaranteed and cannot be lost, even if certain conditions are not met.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The money was unforfeitable.","correct":"✓ The right to the money was unforfeitable.","note":"It's more precise to specify what is unforfeitable (e.g., a right, a claim, a benefit) rather than a general term like \"money.\""}],"priority":"★★☆"},"related_words":{"derivatives":["forfeit (verb, noun)","forfeiture (noun)","nonforfeitable (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unforfeitable\" is a formal term typically used in legal or financial contexts. It describes something, usually a right or benefit, that cannot be taken away, even if certain conditions are not met. Understanding this word is important for comprehending legal documents or financial agreements that guarantee certain protections. It is the opposite of \"forfeitable,\" which means something can be lost or taken away.","priority":"★★☆"},"example_sentences":[{"sentence":"The company provides an unforfeitable health insurance policy to its employees.","translation":"その会社は従業員に剥奪不可能な健康保険を提供している。","type":"example","meaning_category":"right"},{"sentence":"Once the stock options are vested, they become an unforfeitable asset.","translation":"ストックオプションが確定すると、それは剥奪不可能な資産となる。","type":"example","meaning_category":"asset"},{"sentence":"The pension plan guarantees an unforfeitable retirement income.","translation":"その年金制度は剥奪不可能な退職後の収入を保証する。","type":"example","meaning_category":"benefit"}]}