{"word":"Malayoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"マレー系の、マレー人に似た","english_definition":"Relating to or resembling the Malay people or their language and culture.","examples":[{"sentence":"The Malayoid physical features are characterized by dark hair and eyes.","translation":"マレー系の身体的特徴は、黒い髪と瞳によって特徴づけられる。"},{"sentence":"Malayoid languages are spoken across Southeast Asia.","translation":"マレー系言語は東南アジア全域で話されている。"}],"collocations":["Malayoid race","Malayoid languages","Malayoid features"],"synonyms":["Malayan","Austronesian"],"antonyms":[]},{"part_of_speech":"noun","definition":"マレー系の人、マレー語族の人","english_definition":"A person of Malay descent or one who speaks a Malay language.","examples":[{"sentence":"The Malayoids are known for their rich maritime history.","translation":"マレー系の人々は豊かな海洋史で知られている。"},{"sentence":"Many Malayoids have migrated to other parts of the world.","translation":"多くのマレー系の人々が世界の他の地域に移住した。"}],"collocations":["Malayoid people","Malayoid community"],"synonyms":["Malay","Austronesian"],"antonyms":[]}],"etymology":{"value":"Derived from 'Malay' (referring to the Malay people) and the suffix '-oid' (meaning resembling or having the form of).","priority":"★★★"},"pronunciation":{"ipa":"/məˈleɪɔɪd/","syllables":"Ma-lay-oid"},"inflection":{"noun_plural":"Malayoids"},"usage_notes":{"explanation":"'Malayoid' is used in anthropology, linguistics, and other fields to describe people, languages, or characteristics that are related to or resemble the Malay people and their culture. It is often used to classify groups within the broader Austronesian language family.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Malayoid is a country.","correct":"✓ Malayoid refers to people and their characteristics, not a country.","note":"Malayoid describes people, languages, or cultural traits, not a geographical location."}],"priority":"★★☆"},"related_words":{"derivatives":["Malay","Austronesian"],"related_terms":["Malayo-Polynesian languages"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Malayoid' is primarily used in academic contexts, such as anthropology and linguistics, to describe people, languages, or characteristics related to the Malay people and their culture. It is less common in everyday language. Understanding the term requires knowledge of the Malay people and the '-oid' suffix, which indicates resemblance or relation."},"example_sentences":[{"sentence":"The study focused on the genetic markers of Malayoid populations in the Philippines.","translation":"その研究は、フィリピンにおけるマレー系集団の遺伝子マーカーに焦点を当てた。","type":"adjective","meaning_category":"マレー系の"},{"sentence":"Malayoid languages share many similarities in vocabulary and grammar.","translation":"マレー系言語は、語彙と文法に多くの類似点がある。","type":"adjective","meaning_category":"マレー系の"},{"sentence":"The Malayoids have a rich tradition of seafaring and trade.","translation":"マレー系の人々は航海と貿易の豊かな伝統を持っている。","type":"noun","meaning_category":"マレー系の人"}]}