{"word":"Gettysburg","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ゲティスバーグ (アメリカ合衆国ペンシルベニア州にある町。南北戦争の激戦地であり、リンカーン大統領のゲティスバーグ演説の地として知られる)","english_definition":"A town in Pennsylvania, USA; the site of a major battle in the American Civil War and the location of Lincoln's Gettysburg Address.","examples":[{"sentence":"The Battle of Gettysburg was a turning point in the Civil War.","translation":"ゲティスバーグの戦いは南北戦争の転換点となった。"},{"sentence":"Lincoln delivered the Gettysburg Address at the dedication of the Soldiers' National Cemetery.","translation":"リンカーンは兵士国立墓地の献納式でゲティスバーグ演説を行った。"}],"collocations":["Battle of Gettysburg (ゲティスバーグの戦い)","Gettysburg Address (ゲティスバーグ演説)","Gettysburg National Military Park (ゲティスバーグ国立軍事公園)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after James Getty, an early settler of the area.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡɛtizbɜːrɡ/","syllables":"Get-tys-burg"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"Gettysburg is primarily known for two significant events in American history: the Battle of Gettysburg (1863), a crucial battle in the American Civil War, and the Gettysburg Address, a famous speech delivered by President Abraham Lincoln at the dedication of the Soldiers' National Cemetery in Gettysburg four months after the battle. The town itself is located in Pennsylvania.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Gettysburg is a city in Virginia.","correct":"✓ Gettysburg is a town in Pennsylvania.","note":"Gettysburg is located in Pennsylvania, not Virginia."},{"incorrect":"✗ Lincoln gave the Gettysburg Address before the battle.","correct":"✓ Lincoln gave the Gettysburg Address after the battle.","note":"Lincoln's Gettysburg Address was delivered several months after the Battle of Gettysburg."}],"priority":"★★☆"},"related_words":{"derivatives":["Gettysburgian (形容詞: ゲティスバーグの、ゲティスバーグに関する)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2-C1 (歴史や政治に関する文脈で登場)","frequency_google_ngram":"比較的低い (Relatively low) - 特定の歴史的文脈でのみ高頻度。","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"「**Gettysburg**」は、アメリカの南北戦争における重要な戦い「ゲティスバーグの戦い」があった場所の名前です。また、エイブラハム・リンカーン大統領が有名な「ゲティスバーグ演説」を行った場所としても知られています。アメリカの歴史や文化を学ぶ上で重要な地名です。"},"example_sentences":[{"sentence":"Visiting Gettysburg National Military Park is a moving experience.","translation":"ゲティスバーグ国立軍事公園を訪れることは感動的な体験です。","type":"general","meaning_category":"場所"},{"sentence":"The Gettysburg Address is considered one of the greatest speeches in American history.","translation":"ゲティスバーグ演説はアメリカ史における最も偉大な演説の一つと考えられています。","type":"general","meaning_category":"歴史的出来事"},{"sentence":"The Battle of Gettysburg lasted for three days and resulted in heavy casualties.","translation":"ゲティスバーグの戦いは3日間続き、多数の死傷者が出ました。","type":"general","meaning_category":"歴史的出来事"}]}