{"word":"pachymeningitis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"硬膜炎","english_definition":"Inflammation of the dura mater (the thick membrane that surrounds the brain and spinal cord).","examples":[{"sentence":"Pachymeningitis can be caused by infection or autoimmune disease.","translation":"硬膜炎は感染症または自己免疫疾患によって引き起こされる可能性があります。"},{"sentence":"Symptoms of pachymeningitis may include headache, fever, and stiff neck.","translation":"硬膜炎の症状には、頭痛、発熱、首の硬直などがあります。"}],"collocations":["chronic pachymeningitis","hypertrophic pachymeningitis","infectious pachymeningitis"],"synonyms":["duritis","meningitis"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'pachys' (thick), 'meninx' (membrane), and '-itis' (inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpækɪˌmɛnɪnˈdʒaɪtɪs/","syllables":"pa-chy-me-nin-gi-tis"},"inflection":{"noun_plural":"pachymeningitides (rare)"},"usage_notes":{"explanation":"Pachymeningitis specifically refers to inflammation of the dura mater, the outermost of the three layers of membranes surrounding the brain and spinal cord. It is distinct from leptomeningitis, which involves inflammation of the pia mater and arachnoid mater (the inner two layers). Pachymeningitis is a relatively rare condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Pachymeningitis is an inflammation of the brain tissue.","correct":"✓ Pachymeningitis is an inflammation of the dura mater.","note":"Pachymeningitis affects the dura mater, not the brain tissue itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["pachymeninx (dura mater)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pachymeningitis' is a highly specialized medical term referring to a specific type of inflammation affecting the dura mater. Understanding this term requires advanced knowledge of medical terminology and anatomy. It is unlikely to be encountered outside of medical contexts."},"example_sentences":[{"sentence":"MRI scans are often used to diagnose pachymeningitis.","translation":"MRIスキャンは、硬膜炎の診断によく使用されます。","type":"general","meaning_category":"diagnosis"},{"sentence":"Treatment for pachymeningitis depends on the underlying cause.","translation":"硬膜炎の治療は、根本的な原因によって異なります。","type":"general","meaning_category":"treatment"}]}