{"word":"Archking","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A supreme king; a king who rules over other kings.","english_definition":"A king who is superior to other kings; a king of kings.","examples":[{"sentence":"The Archking demanded tribute from all the lesser kings in the land.","translation":"大王は領内のすべての小王に貢物を要求した。"},{"sentence":"Legend tells of an Archking who united the warring tribes into a single kingdom.","translation":"伝説によれば、大王は戦いを続ける部族を統一して一つの王国にしたという。"}],"collocations":["supreme archking","mighty archking"],"synonyms":["high king","overking","king of kings","supreme ruler"],"antonyms":["lesser king","vassal king"]}],"etymology":{"value":"Formed from the prefix 'arch-' meaning chief or supreme, combined with 'king'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɑːrtʃˈkɪŋ/","syllables":"Arch-king"},"inflection":{"noun_plural":"Archkings"},"usage_notes":{"explanation":"The term 'Archking' is not commonly used in modern English. It is often found in fantasy literature or historical contexts referring to a king with authority over other kings. It implies a hierarchical structure among rulers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was the archking of the archkings.","correct":"✓ He was the archking.","note":"The term 'archking' already implies a supreme ruler, so saying 'archking of the archkings' is redundant."}],"priority":"★☆☆"},"related_words":{"derivatives":["archduchess","archduke","archangel","archbishop"],"related_terms":["king","queen","ruler","monarch","emperor"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Archking' is a relatively rare word, primarily encountered in historical or fantasy contexts. It denotes a king who holds dominion over other kings, signifying a high level of authority and power. The prefix 'arch-' indicates a superior or chief status. Understanding the word requires familiarity with hierarchical structures and historical or fictional power dynamics."},"example_sentences":[{"sentence":"The ancient texts spoke of an Archking whose reign brought peace and prosperity.","translation":"古代の文献には、その治世が平和と繁栄をもたらした大王について書かれていた。","type":"noun","meaning_category":"supreme ruler"},{"sentence":"The Archking's palace was grander than any other in the land.","translation":"大王の宮殿は、その土地の他のどの宮殿よりも壮大だった。","type":"noun","meaning_category":"supreme ruler"}]}