{"word":"reliable-eyed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having eyes that convey trustworthiness and dependability.","english_definition":"Possessing eyes that suggest reliability, trustworthiness, and dependability.","examples":[{"sentence":"The detective was known for his reliable-eyed gaze, which made suspects uneasy.","translation":"その刑事は、信頼できる目つきで知られており、容疑者を不安にさせた。"},{"sentence":"The dog, with its soft, reliable-eyed expression, was a comforting presence.","translation":"その犬は、優しく信頼できる目つきで、安心感を与えた。"},{"sentence":"The politician tried to project a reliable-eyed image to gain the public's trust.","translation":"その政治家は、国民の信頼を得るために、信頼できる目つきのイメージを打ち出そうとした。"}],"collocations":["reliable-eyed gaze","reliable-eyed expression","reliable-eyed look","soft reliable-eyed","honest reliable-eyed"],"synonyms":["trustworthy-eyed","dependable-eyed","honest-eyed","sincere-eyed","steady-eyed"],"antonyms":["untrustworthy-eyed","shifty-eyed","deceitful-eyed","unreliable-eyed"]}],"etymology":{"value":"A compound adjective formed by combining 'reliable' (trustworthy, dependable) and 'eyed' (having eyes of a certain kind).","priority":"N/A"},"pronunciation":{"ipa":"/rɪˈlaɪəbəl aɪd/","syllables":"re-li-a-ble-eyed"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Reliable-eyed' is a descriptive adjective used to characterize someone whose eyes give an impression of trustworthiness and dependability. It is often used in literature or descriptive writing to quickly convey a character's perceived honesty and stability. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a reliable-eye person.","correct":"✓ He is a reliable-eyed person.","note":"The correct form is 'reliable-eyed' (adjective) modifying the noun 'person'."},{"incorrect":"✗ The reliable-eyed of the dog made me trust him.","correct":"✓ The reliable-eyed expression of the dog made me trust him.","note":"'Reliable-eyed' is an adjective, not a noun. Use it to describe a noun, such as 'expression', 'look', or 'gaze'."}],"priority":"★★☆"},"related_words":{"derivatives":["reliable","eyed"],"phrasal_verbs":[],"related_adjectives":["trustworthy","dependable","honest","sincere"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Not commonly found in general text.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reliable-eyed' is a relatively uncommon, descriptive adjective. It is used to describe someone whose eyes give an impression of trustworthiness and dependability. Due to its specificity and infrequent use, it is more likely to be encountered in descriptive writing or literature rather than everyday conversation. Understanding the meanings of 'reliable' and 'eyed' helps in deciphering the meaning of the compound word."},"example_sentences":[{"sentence":"The old farmer had a kind, reliable-eyed face that put people at ease.","translation":"その老農夫は、優しく信頼できる目をした顔をしており、人々を安心させた。","type":"adjective","meaning_category":"descriptive"},{"sentence":"Despite the chaos around him, the captain remained calm and reliable-eyed.","translation":"周りの混乱にもかかわらず、船長は冷静で信頼できる目つきを保っていた。","type":"adjective","meaning_category":"descriptive"},{"sentence":"The interviewer looked at her with a probing, but ultimately reliable-eyed gaze.","translation":"面接官は、探るような、しかし最終的には信頼できる目つきで彼女を見た。","type":"adjective","meaning_category":"descriptive"}]}