{"word":"didactically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"教訓的に、教育的に、説教的に","english_definition":"In a manner intended to teach or instruct, especially in having moral instruction as an ulterior motive.","examples":[{"sentence":"The novel was written didactically, with the author clearly intending to impart a moral lesson.","translation":"その小説は教訓的に書かれており、著者は明らかに道徳的な教訓を伝えようとしていた。"},{"sentence":"He spoke didactically, as if addressing a classroom of students.","translation":"彼はまるで生徒たちに話しかけるかのように、教訓的に話した。"},{"sentence":"The film, while entertaining, also aims to inform and educate didactically about the historical events.","translation":"その映画は娯楽性がある一方で、歴史的な出来事について教訓的に知らせ、教育することも目的としている。"}],"collocations":["speak didactically (教訓的に話す)","write didactically (教訓的に書く)","approach something didactically (何かに対して教訓的に取り組む)","present something didactically (何かを教訓的に提示する)"],"synonyms":["pedagogically","instructionally","educationally","preceptively","moralistically","dogmatically"],"antonyms":["entertainingly","amusively","informally","subtly","implicitly"]}],"etymology":{"value":"From 'didactic' + '-ally'. 'Didactic' comes from the Greek 'didaktikos' meaning 'apt at teaching'.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈdæktɪkli/","syllables":"di-dac-ti-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Didactically' describes something done in a way that is intended to teach or instruct, often with a moral or ethical component. It can sometimes imply a sense of being overly preachy or dogmatic. The word is often used when the teaching or instruction is very direct and obvious, rather than subtle or implicit.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist created the painting didactically.","correct":"✓ The artist created the painting with a didactic purpose.","note":"While an artist can create something *with* a didactic purpose, 'didactically' as an adverb usually describes the *manner* in which something is done or presented, not the act of creation itself. The corrected sentence clarifies the intention behind the creation."},{"incorrect":"✗ The student answered the question didactically, showing his knowledge.","correct":"✓ The student answered the question knowledgeably, showing his knowledge.","note":"If the student is simply showing knowledge, 'knowledgeably' is a better fit. 'Didactically' implies the student is trying to *teach* or *instruct* through their answer, which might not be the intended meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["didactic (adjective: 教訓的な、教育的な)","didacticism (noun: 教訓主義)","didact (noun: 教師、教訓家 - 稀)"],"phrases":["didactic literature (教訓文学)","didactic poetry (教訓詩)","didactic art (教訓的な芸術)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Didactically' means in a way that is meant to teach you something, especially a moral lesson. It's often used when someone is trying to teach you something in a very direct or obvious way, sometimes in a way that seems a bit preachy or overly serious. It's not a very common word, so you'll mostly see it in more formal writing or discussions about education or art.","priority":"★★☆"},"example_sentences":[{"sentence":"The teacher presented the lesson didactically to ensure all students understood the core concepts.","translation":"教師はすべての生徒が核心概念を理解できるように、教訓的に授業を行った。","type":"general","meaning_category":"teaching"},{"sentence":"The play was criticized for being too didactically focused on its message, sacrificing entertainment value.","translation":"その劇は、娯楽性を犠牲にしてメッセージに教訓的に焦点を当てすぎていると批判された。","type":"criticism","meaning_category":"overly instructive"},{"sentence":"She didactically explained the rules of the game to the newcomers.","translation":"彼女は新参者にゲームのルールを教訓的に説明した。","type":"explanation","meaning_category":"instruction"},{"sentence":"The author's intent was to didactically convey the importance of environmental conservation through the story.","translation":"著者の意図は、物語を通して環境保護の重要性を教訓的に伝えることだった。","type":"author's intent","meaning_category":"moral lesson"}]}