{"word":"gromatic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"測量器であるグローマに関連する、またはグローマを用いた","english_definition":"Relating to or done with a groma, an ancient Roman surveying instrument.","examples":[{"sentence":"The gromatic art was essential for Roman land division.","translation":"グローマを用いた測量術は、ローマの土地分割に不可欠でした。"},{"sentence":"Gromatic surveys helped in the construction of Roman roads.","translation":"グローマを用いた測量は、ローマ街道の建設に役立ちました。"}],"collocations":["gromatic survey","gromatic art","gromatic method"],"synonyms":["surveying","geometric","topographical"],"antonyms":[]}],"etymology":{"value":"Derived from 'groma', the name of the Roman surveying instrument.","priority":"★★★"},"pronunciation":{"ipa":"/ɡroʊˈmætɪk/","syllables":"gro-mat-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'gromatic' specifically refers to the use of a groma, an ancient Roman surveying tool, in the context of land surveying and division. It is often used in historical or archaeological contexts when discussing Roman engineering and land management.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gromatic design of the building was modern.","correct":"✓ The geometric design of the building was modern.","note":"'Gromatic' refers specifically to the use of a groma, not general design principles. Use 'geometric' for general shapes and designs."}],"priority":"★☆☆"},"related_words":{"derivatives":["groma"],"related_terms":["surveying","geometry","topography","Roman engineering"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gromatic' is a specialized term related to ancient Roman surveying techniques using a groma. It is unlikely to be encountered outside of historical or archaeological contexts. Understanding requires familiarity with Roman history and surveying practices."},"example_sentences":[{"sentence":"The gromatic system ensured precise land allocation.","translation":"グローマを用いた測量システムは、正確な土地配分を保証しました。","type":"adjective","meaning_category":"relating to groma"},{"sentence":"Archaeologists study gromatic inscriptions to understand Roman land management.","translation":"考古学者は、ローマの土地管理を理解するために、グローマに関する碑文を研究しています。","type":"adjective","meaning_category":"relating to groma"}]}