{"word":"undose","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"（薬などを）過剰に投与しない、必要量より少なく投与する","english_definition":"To administer a dose of (a medication, etc.) that is less than the required or recommended amount.","examples":[{"sentence":"The doctor was concerned that the patient was being undosed, leading to a lack of improvement.","translation":"医師は、患者が必要量より少なく薬を投与されており、改善が見られないことを懸念していた。"},{"sentence":"It's crucial not to undose antibiotics, as it can contribute to antibiotic resistance.","translation":"抗生物質を必要量より少なく投与することは、抗生物質耐性につながる可能性があるため、非常に重要です。"}],"collocations":["undose a medication","undose antibiotics","undose a patient"],"synonyms":["underdose","hypodose"],"antonyms":["overdose","dose correctly"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not' or 'opposite of') to the word 'dose'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈdoʊs/","syllables":"un-dose"},"inflection":{"verb_forms":{"present_simple":["undose","undoses"],"past_simple":"undosed","past_participle":"undosed","present_participle":"undosing"}},"usage_notes":{"explanation":"The term 'undose' is primarily used in medical contexts to describe the act of administering a medication or treatment at a level lower than what is considered therapeutically effective. It carries the implication that the reduced dosage may compromise the treatment's effectiveness or lead to suboptimal outcomes. It is less commonly used than 'underdose'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant was undosed with water.","correct":"✓ The plant was under watered.","note":"'Undose' is typically used in the context of medication or treatment. For insufficient watering of plants, 'underwatered' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["undosing (noun: the act of administering a dose that is less than required)"],"synonyms":["underdose","hypodose"],"antonyms":["overdose","dose correctly"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Undose' is a relatively uncommon term, mainly used in medical or scientific contexts. It refers to administering a dose of something, usually medication, that is less than the recommended or required amount. Understanding this word requires a good grasp of medical terminology and the ability to infer meaning from prefixes like 'un-'. It's not a word commonly encountered in everyday conversation."},"example_sentences":[{"sentence":"The study investigated the effects of undosing chemotherapy drugs on tumor growth.","translation":"その研究では、化学療法薬を必要量より少なく投与することが腫瘍の成長に及ぼす影響を調査した。","type":"verb (vt)","meaning_category":"薬などを必要量より少なく投与する"},{"sentence":"The veterinarian warned against undosing the animal with the prescribed medication.","translation":"獣医は、動物に処方された薬を必要量より少なく投与しないように警告した。","type":"verb (vt)","meaning_category":"薬などを必要量より少なく投与する"}]}