{"word":"humorlessly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"ユーモアを解さずに、面白みのない様子で、真面目腐って","english_definition":"in a manner lacking humor; without amusement or understanding of humor; seriously.","examples":[{"sentence":"He humorlessly explained the complex rules of the game.","translation":"彼はゲームの複雑なルールをユーモアを交えずに説明した。"},{"sentence":"She humorlessly corrected his grammatical errors.","translation":"彼女は彼の文法的な誤りを面白みのない様子で訂正した。"},{"sentence":"The politician humorlessly addressed the serious issues facing the country.","translation":"政治家は国が直面している深刻な問題に、ユーモアを交えずに真面目腐って取り組んだ。"}],"collocations":["respond humorlessly","explain humorlessly","treat something humorlessly","take something humorlessly"],"synonyms":["seriously","solemnly","gravely","earnestly","without humor","without amusement","without levity"],"antonyms":["humorously","wittily","comically","amusingly","lightheartedly"]}],"etymology":{"value":"The word 'humorlessly' is formed by adding the suffix '-ly' to the adjective 'humorless'. 'Humorless' itself is formed by adding the suffix '-less' (meaning 'without') to the noun 'humor'. 'Humor' comes from the Old French 'humor' (meaning 'fluid, moisture'), which in turn comes from the Latin 'humor' (meaning 'liquid, fluid'). The original sense in English referred to bodily fluids, with the idea that a person's temperament was determined by the balance of these fluids.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhjuːmərləsli/","syllables":"hu-mor-less-ly"},"inflection":{"notes":"As an adverb, 'humorlessly' does not have different inflections."},"usage_notes":{"explanation":"'Humorlessly' describes the manner in which something is done or said, indicating a lack of humor or amusement. It suggests a serious or solemn approach, often implying that the person does not understand or appreciate humor in the given situation. It is often used to criticize someone for being too serious or for failing to see the lighter side of things.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted humorless.","correct":"✓ He acted humorlessly.","note":"'Humorless' is an adjective describing a person's character, while 'humorlessly' is an adverb describing how someone acts. To describe the manner of acting, use the adverb 'humorlessly'."},{"incorrect":"✗ She told the story humorlessly, so no one laughed.","correct":"✓ She told the story humorlessly, so no one laughed.","note":"This sentence is grammatically correct, but it's important to ensure that the context justifies the use of 'humorlessly'. If the story was intended to be funny, 'humorlessly' is appropriate. If the story was not intended to be funny, it might be redundant or inappropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["humor (noun)","humorous (adjective)","humorless (adjective)","humorously (adverb)"],"related_terms":["seriously","solemnly","gravely","earnestly"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'humorlessly' is an adverb that describes doing something without humor or amusement. It implies a serious or solemn approach. It is not a commonly used word, so it is more likely to be encountered in formal writing or speech. Understanding the word requires familiarity with the base word 'humor' and the suffixes '-less' (meaning 'without') and '-ly' (forming an adverb)."},"example_sentences":[{"sentence":"The teacher humorlessly explained the importance of following the rules.","translation":"先生は規則を守ることの重要性をユーモアを交えずに説明した。","type":"example"},{"sentence":"He humorlessly pointed out every flaw in her argument.","translation":"彼は彼女の議論のあらゆる欠点を面白みのない様子で指摘した。","type":"example"},{"sentence":"She humorlessly accepted the criticism, showing no sign of amusement.","translation":"彼女は批判をユーモアを解さずに受け入れ、少しも面白がる様子を見せなかった。","type":"example"}]}