{"word":"Lema","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学) ハマキホソクチキ属","english_definition":"(Zoology) A genus of beetles in the family Chrysomelidae, commonly known as cereal leaf beetles.","examples":[{"sentence":"The cereal leaf beetle, Lema melanopus, is a pest of cereal crops.","translation":"イネミズゾウムシ（Lema melanopus）は、穀物作物の害虫です。"}],"collocations":["Lema melanopus (イネミズゾウムシ)","cereal leaf beetle (イネミズゾウムシ)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from Ancient Greek. The exact origin and meaning in this context are not widely documented, but likely related to a descriptive feature of the beetle.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈliːmə/","syllables":"Le-ma"},"inflection":{"notes":"Plural: Lema (属名なので通常は複数形にしない)"},"usage_notes":{"explanation":"'Lema' is a scientific term used in zoology to classify a specific genus of beetles. It's primarily encountered in scientific literature or discussions related to entomology and agriculture, particularly concerning pests affecting cereal crops.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Lema in my garden, it was very big.","correct":"✓ I saw a beetle in my garden.","note":"Unless you are sure it is a Lema, it is better to say 'beetle' because Lema is a specific genus."}],"priority":"★☆☆"},"related_words":{"derivatives":["Chrysomelidae (ハムシ科)","beetle (甲虫)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lema' is a specialized term used in the field of zoology, specifically to refer to a genus of beetles. It is not commonly used in everyday language and is primarily found in scientific texts or discussions related to entomology and agriculture. Understanding this term requires a background in biology or a specific interest in beetles and their classification."},"example_sentences":[{"sentence":"Researchers are studying the population dynamics of Lema in agricultural fields.","translation":"研究者たちは、農業地帯におけるハマキホソクチキ属の個体数動態を研究しています。","type":"noun","meaning_category":"Genus of Beetles"},{"sentence":"Lema melanopus is known for its impact on cereal crops.","translation":"イネミズゾウムシは、穀物作物への影響で知られています。","type":"noun","meaning_category":"Genus of Beetles"}]}