{"word":"nondropsical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"水腫ではない、水腫にかかっていない","english_definition":"Not affected by or relating to dropsy (edema).","examples":[{"sentence":"The patient's condition improved, and he became nondropsical.","translation":"患者の状態は改善し、水腫はなくなった。"},{"sentence":"A nondropsical state is essential for proper kidney function.","translation":"適切な腎臓機能のためには、水腫のない状態が不可欠である。"}],"collocations":["nondropsical condition","nondropsical patient"],"synonyms":["nonedematous","nonhydropic"],"antonyms":["dropsical","edematous","hydropic"]}],"etymology":{"value":"\"non-\" (否定接頭辞) + \"dropsical\" (水腫の)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈdrɒpsɪkəl/","syllables":"non-drop-si-cal"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"Nondropsical\" is a relatively uncommon medical term used to describe a state or condition that is not characterized by dropsy (edema), which is an abnormal accumulation of fluid in the body's tissues or cavities. It's often used in medical contexts to indicate the absence or resolution of edema.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant was nondropsical due to overwatering.","correct":"✓ The plant was not dropsical despite overwatering.","note":"Plants do not suffer from dropsy in the same way as animals and humans, so the term is not generally applicable. Use a more general term like 'not waterlogged'."}],"priority":"★★☆"},"related_words":{"derivatives":["dropsy","dropsical"],"related_medical_terms":["edema","ascites","anasarca","hydrops"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学文献でまれに見られる程度。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Nondropsical\" is a highly specialized medical term. It is used to describe the absence of dropsy, which is an older term for edema (fluid retention). This word is unlikely to be encountered outside of medical contexts. Understanding requires knowledge of medical terminology. The prefix \"non-\" indicates negation, and \"dropsical\" pertains to dropsy. Therefore, \"nondropsical\" simply means \"not dropsical\" or \"without edema.\""},"example_sentences":[{"sentence":"The diuretic medication helped the patient become nondropsical.","translation":"利尿薬は患者が水腫のない状態になるのを助けた。","type":"adjective","meaning_category":"水腫ではない"},{"sentence":"A nondropsical heart is essential for efficient blood circulation.","translation":"水腫のない心臓は効率的な血液循環に不可欠である。","type":"adjective","meaning_category":"水腫ではない"}]}