{"word":"accusative-dative","priority":"☆☆☆","meanings":[{"part_of_speech":"grammar term","definition":"(文法) 対格・与格 (言語学において、ある名詞または代名詞が、直接目的語（対格）または間接目的語（与格）のいずれかの機能を果たすことを示す屈折体系)","english_definition":"(grammar) A system of morphological alignment in which a noun or pronoun is marked in the same way whether it is the direct object (accusative) or the indirect object (dative).","examples":[{"sentence":"German used to have a clear accusative-dative distinction, but it is becoming less clear in colloquial speech.","translation":"ドイツ語はかつて明確な対格・与格の区別がありましたが、口語では不明確になりつつあります。"},{"sentence":"In accusative-dative languages, the case marking distinguishes the subject from both the direct and indirect objects.","translation":"対格・与格言語では、格標識は主語を直接目的語と間接目的語の両方から区別します。"}],"collocations":["accusative-dative alignment (対格・与格アライメント)","accusative case (対格)","dative case (与格)","case marking (格標識)"],"synonyms":["direct object","indirect object","case system"],"antonyms":["nominative-accusative","ergative-absolutive"]}],"etymology":{"value":"The term combines 'accusative' (from Latin 'accusativus', denoting the case of the direct object) and 'dative' (from Latin 'dativus', denoting the case of the indirect object). It describes a system where these two cases are not clearly distinguished.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈkjuːzətɪv ˈdeɪtɪv/","syllables":"ac-cu-sa-tive-da-tive"},"inflection":{"notes":"This term is primarily used as an adjective or a noun. It does not have typical verb inflections."},"usage_notes":{"explanation":"The term 'accusative-dative' is used in linguistics to describe languages where the morphological marking of direct and indirect objects is not clearly distinguished. This is in contrast to languages where these cases are clearly marked with distinct suffixes or prefixes. The term is often used when discussing the evolution of case systems in languages.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The accusative-dative is a verb tense.","correct":"✓ The accusative-dative is a case system.","note":"The accusative-dative refers to a case system, not a verb tense."},{"incorrect":"✗ English has a strong accusative-dative system.","correct":"✓ English has a weak accusative-dative system.","note":"English has a very weak case system, and the accusative and dative are not morphologically marked in most instances."}],"priority":"★★☆"},"related_words":{"derivatives":["accusative (対格)","dative (与格)","case (格)","case marking (格標識)","morphology (形態論)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門的な言語学の文脈)","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な言語学の用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Accusative-dative' is a linguistic term used to describe a specific type of case system in languages. In these languages, the markers used to identify the direct object (accusative case) and the indirect object (dative case) are either the same or have merged over time. This concept is relevant in the study of comparative linguistics and historical linguistics, particularly when analyzing how case systems evolve. It is not a term commonly used outside of advanced linguistic discussions."},"example_sentences":[{"sentence":"Old English had a more robust accusative-dative system than modern English.","translation":"古英語は現代英語よりも強固な対格・与格システムを持っていました。","type":"descriptive","meaning_category":"historical linguistics"},{"sentence":"The accusative-dative case can be difficult for learners of languages like German.","translation":"対格・与格は、ドイツ語のような言語の学習者にとって難しい場合があります。","type":"example","meaning_category":"language learning"}]}