{"word":"symbolisms","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"象徴主義、象徴的表現、象徴的意味合い","english_definition":"The use of symbols to represent ideas or qualities. A system of symbols or symbolic representations.","examples":[{"sentence":"The novel is rich in symbolisms.","translation":"その小説は象徴主義に富んでいる。"},{"sentence":"Religious art is often full of symbolisms.","translation":"宗教芸術はしばしば象徴的意味合いに満ちている。"},{"sentence":"The poet uses complex symbolisms to convey his message.","translation":"その詩人は複雑な象徴主義を用いてメッセージを伝えている。"}],"collocations":["use of symbolisms (象徴主義の使用)","rich in symbolisms (象徴主義に富む)","complex symbolisms (複雑な象徴主義)","cultural symbolisms (文化的象徴主義)","religious symbolisms (宗教的象徴主義)"],"synonyms":["symbolic representation","allegory","imagery","metaphor","emblemism"],"antonyms":["literalness","directness","realism"]}],"etymology":{"value":"The word 'symbolism' comes from the word 'symbol', which originates from the Greek word 'symbolon' meaning 'token' or 'sign'. The suffix '-ism' denotes a doctrine, principle, or practice. Therefore, 'symbolism' refers to the use or study of symbols.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɪmbəlɪzəmz/","syllables":"sim-bol-i-zums"},"inflection":{"noun_plural":"symbolisms (already plural)"},"usage_notes":{"explanation":"'Symbolisms' refers to the use of symbols to represent ideas or qualities, or a particular system of symbols. It is often used in the context of art, literature, and religion, where symbols are used to convey deeper meanings. The plural form 'symbolisms' is used to refer to multiple instances or types of symbolic representation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The symbolism are important in this painting.","correct":"✓ The symbolisms are important in this painting.","note":"'Symbolism' is an uncountable noun when referring to the general use of symbols. However, 'symbolisms' (plural) is correct when referring to multiple systems or instances of symbolic representation. In this case, it depends on the context whether to use the singular or plural form."},{"incorrect":"✗ He used a lot of symbolism in his writing, but the symbolisms were confusing.","correct":"✓ He used a lot of symbolism in his writing, but the symbols were confusing.","note":"In this context, it's better to use 'symbols' instead of 'symbolisms' when referring to the specific symbols used."}],"priority":"★★☆"},"related_words":{"derivatives":["symbol (名詞: 象徴、記号)","symbolic (形容詞: 象徴的な)","symbolically (副詞: 象徴的に)","symbolist (名詞: 象徴主義者)"],"related_terms":["allegory (名詞: 寓話)","metaphor (名詞: 比喩)","imagery (名詞: イメージ)","iconography (名詞: 図像学)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 学術的な文脈や芸術関連の議論でより一般的。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Symbolisms' refers to the use of symbols to represent ideas or qualities. It is often encountered in discussions about art, literature, and cultural studies. The term implies a deeper, non-literal meaning conveyed through symbols. Understanding 'symbolisms' requires an ability to interpret abstract concepts and recognize the cultural or historical context of the symbols used. The plural form 'symbolisms' is used to refer to multiple instances or systems of symbolic representation, making it a more nuanced term than the singular 'symbolism'."},"example_sentences":[{"sentence":"Different cultures have different symbolisms associated with colors.","translation":"異なる文化は、色に関連付けられた異なる象徴主義を持っている。","type":"noun","meaning_category":"文化的象徴主義"},{"sentence":"The author explored various religious symbolisms in his novel.","translation":"著者は小説の中で様々な宗教的象徴主義を探求した。","type":"noun","meaning_category":"宗教的象徴主義"},{"sentence":"The use of symbolisms in the poem adds depth and complexity to its meaning.","translation":"詩における象徴主義の使用は、その意味に深みと複雑さを加える。","type":"noun","meaning_category":"象徴的意味合い"},{"sentence":"The artist's work is characterized by its intricate symbolisms.","translation":"その芸術家の作品は、その複雑な象徴主義によって特徴づけられる。","type":"noun","meaning_category":"象徴的表現"}]}