{"word":"SEL","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"社会性と感情の学習（Social and Emotional Learning）","english_definition":"Social and Emotional Learning: the process through which children and adults acquire and effectively apply the knowledge, attitudes, and skills necessary to understand and manage emotions, set and achieve positive goals, feel and show empathy for others, establish and maintain positive relationships, and make responsible decisions.","examples":[{"sentence":"SEL programs help students develop important life skills.","translation":"SELプログラムは、生徒たちが重要なライフスキルを身につけるのを助けます。"},{"sentence":"Integrating SEL into the curriculum can improve academic outcomes.","translation":"SELをカリキュラムに統合することで、学業成績を向上させることができます。"}],"collocations":["SEL program","SEL skills","SEL curriculum","SEL framework","SEL assessment"],"synonyms":["social-emotional development","character education","emotional intelligence"],"antonyms":[]}],"etymology":{"value":"社会性と感情の学習（Social and Emotional Learning）の頭字語。","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛsˌiːˈɛl/","syllables":"ES-EE-EL"},"inflection":{"notes":"名詞なので、複数形はありません。"},"usage_notes":{"explanation":"SELは、感情を理解し管理する能力、目標を設定し達成する能力、共感を示す能力、良好な人間関係を築き維持する能力、責任ある意思決定を行う能力を育成するプロセスを指します。教育分野で重要視されており、生徒の学業成績や社会性の向上に役立つと考えられています。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ SEL is important for only young children.","correct":"✓ SEL is important for children and adults.","note":"SELは子供だけでなく、大人にとっても重要なスキルです。"},{"incorrect":"✗ SEL is only about being nice to others.","correct":"✓ SEL includes empathy, but also self-awareness and responsible decision-making.","note":"SELは共感だけでなく、自己認識や責任ある意思決定など、より広範なスキルを包含します。"}],"priority":"★★☆"},"related_words":{"derivatives":["social-emotional","emotional intelligence","character development"],"phrases":["CASEL (Collaborative for Academic, Social, and Emotional Learning)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"比較的新しい概念のため、頻度は高くありません。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"SEL（社会性と感情の学習）は、子どもや大人が感情を理解し管理したり、目標を立てて達成したり、他者に共感したり、良い人間関係を築いたり、責任ある決断をしたりするために必要な知識、態度、スキルを身につけ、効果的に活用するプロセスです。教育現場で重要視されており、学業成績の向上やいじめの防止など、様々な効果が期待されています。専門的な用語であり、教育関係者や心理学者などが使用することが多いです。"},"example_sentences":[{"sentence":"The school implemented an SEL program to improve student behavior.","translation":"学校は生徒の行動を改善するためにSELプログラムを導入しました。","type":"noun","meaning_category":"社会性と感情の学習"},{"sentence":"SEL skills are essential for success in both school and life.","translation":"SELスキルは学校と人生の両方での成功に不可欠です。","type":"noun","meaning_category":"社会性と感情の学習"},{"sentence":"Teachers are trained to integrate SEL into their lessons.","translation":"教師はSELを授業に統合するための訓練を受けています。","type":"noun","meaning_category":"社会性と感情の学習"}]}