{"word":"Uraniidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カギバアオシャクガ科","english_definition":"A family of moths in the order Lepidoptera, characterized by their bright colors and swallowtail-like hindwings.","examples":[{"sentence":"The Uraniidae family includes some of the most beautiful moths in the world.","translation":"カギバアオシャクガ科には、世界で最も美しい蛾が含まれています。"}],"collocations":[],"synonyms":["swallowtail moths","钩蛾科 (Chinese)"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Urania', which is named after the Greek muse of astronomy. The suffix '-idae' is a standard taxonomic suffix indicating a family.","priority":"★★☆"},"pronunciation":{"ipa":"/jʊˈreɪnɪˌdaɪ/","syllables":"U-ra-ni-i-dae"},"inflection":{"noun_plural":"Uraniids"},"usage_notes":{"explanation":"Uraniidae is a family name used in scientific classification. It refers to a specific group of moths known for their vibrant colors and distinctive hindwings, which resemble those of swallowtail butterflies. They are often found in tropical regions.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Urania (genus)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Uraniidae' is a scientific term referring to a specific family of moths. It is primarily used in academic or scientific contexts related to entomology or zoology. Understanding this term requires familiarity with biological classification systems."},"example_sentences":[{"sentence":"Members of the Uraniidae family are often mistaken for butterflies due to their bright coloration.","translation":"カギバアオシャクガ科のメンバーは、その鮮やかな色彩のために蝶と間違われることが多いです。","type":"general","meaning_category":"description"},{"sentence":"Research is being conducted on the distribution patterns of Uraniidae species in Southeast Asia.","translation":"東南アジアにおけるカギバアオシャクガ科の種の分布パターンに関する研究が行われています。","type":"scientific","meaning_category":"research"}]}