{"word":"Anthemas","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural only) A genus of flowering plants in the family Asteraceae, commonly known as mayweeds or chamomile.","english_definition":"The plural form of the genus name Anthemis, which refers to a group of flowering plants in the family Asteraceae, often called mayweeds or chamomiles.","examples":[{"sentence":"The field was full of Anthemas, creating a beautiful scene.","translation":"その野原はアンテマス（カミツレ属の植物）でいっぱいで、美しい景色を作り出していた。"},{"sentence":"Different species of Anthemas have varying medicinal properties.","translation":"アンテマス（カミツレ属の植物）の異なる種は、さまざまな薬効を持っている。"}],"collocations":["Anthemas species","field of Anthemas","medicinal Anthemas"],"synonyms":["Chamomile","Mayweed"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name Anthemis, which comes from the Greek word 'anthemon' meaning 'flower'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈænθɪməs/","syllables":"An-the-mas"},"inflection":{"noun_plural":"Anthemas"},"usage_notes":{"explanation":"'Anthemas' is the plural form of the genus name 'Anthemis'. It is primarily used in botanical or scientific contexts when referring to multiple species or members of this plant genus. In general conversation, it's more common to use the common names like 'chamomile' or 'mayweed'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an Anthemas in the garden.","correct":"✓ I saw an Anthemis in the garden.","note":"'Anthemas' is plural; use 'Anthemis' for the singular form."}],"priority":"★☆☆"},"related_words":{"derivatives":["Anthemis (singular form of the genus name)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anthemas' is a technical term used in botany and plant science. It refers to multiple plants belonging to the genus Anthemis, which includes common plants like chamomile and mayweed. Understanding this term requires some familiarity with scientific classification of plants. In most everyday contexts, using the common names is more appropriate.","priority":"★★☆"},"example_sentences":[{"sentence":"The study focused on various species of Anthemas and their chemical compositions.","translation":"その研究は、アンテマス（カミツレ属の植物）のさまざまな種とその化学組成に焦点を当てていた。","type":"noun","meaning_category":"botany"},{"sentence":"The aroma of the field filled with Anthemas was incredibly soothing.","translation":"アンテマス（カミツレ属の植物）でいっぱいの野原の香りは、信じられないほど心地よかった。","type":"noun","meaning_category":"description"}]}