{"word":"radiation-processed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"放射線処理された、放射線照射された","english_definition":"Having been subjected to a process involving exposure to ionizing radiation, typically to sterilize, preserve, or modify the substance.","examples":[{"sentence":"Radiation-processed food can have a longer shelf life.","translation":"放射線処理された食品は、保存期間が長くなることがあります。"},{"sentence":"The hospital uses radiation-processed medical supplies to ensure sterility.","translation":"その病院では、滅菌を確実にするために放射線処理された医療用品を使用しています。"},{"sentence":"Some spices are radiation-processed to reduce microbial contamination.","translation":"一部のスパイスは、微生物汚染を減らすために放射線処理されます。"}],"collocations":["radiation-processed food (放射線処理食品)","radiation-processed medical supplies (放射線処理された医療用品)","radiation-processed spices (放射線処理されたスパイス)"],"synonyms":["irradiated","radiation-treated"],"antonyms":["unprocessed","non-irradiated"]}],"etymology":{"value":"Composed of 'radiation' (the emission of energy as electromagnetic waves or as moving subatomic particles) and 'processed' (subjected to a particular method or technique, typically to prepare, preserve, or improve it).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌreɪdiˈeɪʃən ˈprɑːsest/","syllables":"ra-di-a-tion-pro-cessed"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'radiation-processed' is used to describe items, especially food and medical supplies, that have undergone a process of irradiation. This process involves exposing the items to ionizing radiation, such as gamma rays or electron beams, to kill bacteria, viruses, and other microorganisms. It is used to extend shelf life, ensure sterility, and reduce the risk of foodborne illnesses.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ radiation processed","correct":"✓ radiation-processed","note":"The term is typically hyphenated when used as a compound adjective before a noun."}],"priority":"☆☆☆"},"related_words":{"derivatives":["radiation","process","irradiation"],"related_terms":["food irradiation","medical sterilization","gamma radiation","electron beam"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The term 'radiation-processed' is a technical term used to describe something that has been treated with radiation. This is commonly used for food to kill bacteria and extend shelf life, or for medical equipment to sterilize it. It's a compound adjective, so it's usually hyphenated. Understanding this term requires some familiarity with scientific and technical vocabulary."},"example_sentences":[{"sentence":"The label indicated that the fruit was **radiation-processed** to prevent spoilage.","translation":"そのラベルには、果物が腐敗を防ぐために放射線処理されていることが示されていました。","type":"adjective","meaning_category":"放射線処理された"},{"sentence":"**Radiation-processed** blood products are used in transfusions to reduce the risk of infection.","translation":"放射線処理された血液製剤は、感染のリスクを減らすために輸血に使用されます。","type":"adjective","meaning_category":"放射線処理された"}]}