{"word":"coccinellid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"テントウムシ（科）","english_definition":"A beetle of the family Coccinellidae, typically small and round, often red or yellow with black spots.","examples":[{"sentence":"The coccinellid is a beneficial insect in the garden.","translation":"テントウムシは庭にとって有益な昆虫です。"},{"sentence":"Coccinellids are often used as biological control agents.","translation":"テントウムシは生物的防除剤としてよく使われます。"}],"collocations":["coccinellid beetle","coccinellid larva","coccinellid species"],"synonyms":["ladybug","ladybird","lady beetle"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'coccinus' meaning 'scarlet'. The suffix '-id' is used to denote a family of animals.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒksɪˈnɛlɪd/","syllables":"coc-ci-nel-lid"},"inflection":{"noun_plural":"coccinellids"},"usage_notes":{"explanation":"'Coccinellid' is the scientific term for insects commonly known as ladybugs or ladybirds. It refers to any beetle belonging to the family Coccinellidae. While 'ladybug' and 'ladybird' are more common in everyday language, 'coccinellid' is used in scientific or formal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a coccinellid fly.","correct":"✓ I saw a coccinellid flying.","note":"The verb 'fly' should be in the present participle form ('flying') to describe the action of the coccinellid."},{"incorrect":"✗ Coccinellid are red.","correct":"✓ Coccinellids are red.","note":"Since 'coccinellid' is being used in the plural to refer to the family of beetles in general, the plural form 'coccinellids' should be used with the plural verb 'are'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Coleoptera (order of beetles)","Aphis (aphids, a common prey of coccinellids)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'coccinellid' is a scientific term used to refer to beetles in the family Coccinellidae, commonly known as ladybugs or ladybirds. It is primarily used in scientific or formal contexts when discussing these insects. Understanding this term is useful for reading scientific literature or engaging in discussions about entomology or biological pest control. While not a common word in everyday conversation, it is important for those studying or working with insects."},"example_sentences":[{"sentence":"The agricultural scientist studied the effect of different coccinellid species on aphid populations.","translation":"農業科学者は、さまざまなテントウムシの種がアブラムシの個体数に与える影響を研究しました。","type":"noun","meaning_category":"scientific context"},{"sentence":"Many gardeners encourage coccinellids in their gardens to control pests naturally.","translation":"多くの庭師は、害虫を自然に駆除するために、庭でテントウムシを奨励しています。","type":"noun","meaning_category":"gardening context"},{"sentence":"The coccinellid larva is also a voracious predator of aphids.","translation":"テントウムシの幼虫もまた、アブラムシの貪欲な捕食者です。","type":"noun","meaning_category":"entomology context"}]}