{"word":"unidolized","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not regarded with excessive admiration or reverence; not idolized.","english_definition":"Not regarded as an idol; not excessively admired or revered.","examples":[{"sentence":"The unidolized version of the historical figure presented a more balanced perspective.","translation":"偶像化されていないその歴史上の人物像は、よりバランスの取れた視点を示した。"},{"sentence":"She preferred to remain unidolized, focusing on her work rather than seeking fame.","translation":"彼女は偶像化されることを好まず、名声を求めるよりも自分の仕事に集中した。"}],"collocations":["unidolized version","unidolized perspective","remain unidolized"],"synonyms":["unidealized","realistic","down-to-earth","sober"],"antonyms":["idolized","revered","worshipped","idealized"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the word 'idolized,' which is the past participle of 'idolize.' 'Idolize' comes from 'idol,' referring to an object of worship or excessive admiration.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈaɪdəlaɪzd/","syllables":"un-i-dol-ized"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Unidolized' is used to describe something or someone that is not treated as an idol or viewed with excessive admiration. It suggests a more realistic, balanced, or critical perspective, free from the exaggeration or idealization often associated with idol worship. It is often used in discussions of historical figures, celebrities, or other prominent individuals to indicate a more objective or nuanced portrayal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unidolized hero was very popular.","correct":"✓ The unidolized portrayal of the hero was more realistic.","note":"'Unidolized' describes the portrayal or perspective, not the person themselves. It's better to say 'realistic portrayal' or 'nuanced perspective' instead of directly describing the person as 'unidolized'."}],"priority":"★☆☆"},"related_words":{"derivatives":["idolize (verb)","idolization (noun)","idol (noun)"],"related_terms":["deconstruct","debunk","critique"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unidolized' is a relatively uncommon word used to describe something or someone that is not treated as an idol or viewed with excessive admiration. It implies a realistic or critical perspective, free from idealization. It is typically used in academic or analytical contexts when discussing portrayals of historical figures or celebrities. Understanding the base word 'idolize' is helpful for comprehending the meaning of 'unidolized'."},"example_sentences":[{"sentence":"The biography presented an unidolized account of the president's life, highlighting both his achievements and his failures.","translation":"その伝記は、大統領の人生の偶像化されていない記述を提示し、彼の業績と失敗の両方を強調した。","type":"adjective","meaning_category":"Not idolized"},{"sentence":"The artist aimed to create an unidolized portrait, capturing the subject's flaws and imperfections.","translation":"そのアーティストは、被写体の欠点や不完全さを捉え、偶像化されていない肖像画を作成することを目指した。","type":"adjective","meaning_category":"Not idolized"}]}