{"word":"solubilization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"可溶化、溶解","english_definition":"The process of making something soluble, especially a substance that is not normally soluble in a particular solvent.","examples":[{"sentence":"Solubilization of the drug is necessary for its absorption in the body.","translation":"薬物の可溶化は、体内での吸収に必要である。"},{"sentence":"The solubilization of phosphate in the soil is enhanced by certain bacteria.","translation":"土壌中のリン酸の可溶化は、特定の細菌によって促進される。"}],"collocations":["phosphate solubilization (リン酸可溶化)","drug solubilization (薬物可溶化)","protein solubilization (タンパク質可溶化)"],"synonyms":["dissolution","dissolving","solvation"],"antonyms":["precipitation","crystallization"]},{"part_of_speech":"noun","definition":"（コロイド化学における）ミセル可溶化","english_definition":"(In colloid chemistry) The process by which a substance (e.g., a lipid or a hydrophobic drug) is dissolved in a micelle formed by a surfactant in a solvent.","examples":[{"sentence":"Solubilization in micelles allows for the transport of hydrophobic compounds in aqueous solutions.","translation":"ミセルへの可溶化により、疎水性化合物の水溶液中での輸送が可能になる。"},{"sentence":"The solubilization capacity of the surfactant depends on its concentration and structure.","translation":"界面活性剤の可溶化能力は、その濃度と構造に依存する。"}],"collocations":["micellar solubilization (ミセル可溶化)","surfactant solubilization (界面活性剤可溶化)"],"synonyms":["micellar dissolution"],"antonyms":[]}],"etymology":{"value":"Derived from 'solubilize' (verb), which comes from 'soluble' + '-ize'. 'Soluble' comes from Latin 'solubilis', from 'solvere' (to loosen, dissolve).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɒljʊbɪlaɪˈzeɪʃən/","syllables":"so-lu-bi-li-za-tion"},"inflection":{"noun_plural":"solubilizations"},"usage_notes":{"explanation":"'Solubilization' refers to the process of making a substance soluble, which means able to be dissolved in a liquid. This term is often used in chemistry, biology, and pharmacology. In colloid chemistry, it specifically refers to the process of dissolving a substance within micelles formed by surfactants. It is important in drug delivery and other applications where hydrophobic substances need to be dispersed in aqueous solutions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The solubilization is soluble.","correct":"✓ The solubilization process is important for making the substance soluble.","note":"'Solubilization' is a process (noun), while 'soluble' is an adjective describing the ability to be dissolved. Do not use them interchangeably."}],"priority":"★★☆"},"related_words":{"derivatives":["solubilize (verb)","soluble (adjective)","solubility (noun)","insoluble (adjective)"],"phrasal_verbs":[],"related_terms":["dissolution","solvation","micelle","surfactant"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. Primarily used in scientific and technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Solubilization' is a technical term that describes the process of making a substance able to dissolve in a liquid. It's often used in science, especially in chemistry and biology. For example, if a drug doesn't dissolve well in water, scientists might use a process of solubilization to make it dissolve better so that it can be absorbed by the body. It can also refer to dissolving a substance within micelles, which are tiny structures formed by surfactants (like soap) in water. This is important for transporting substances that don't normally mix with water.","priority":"★★★"},"example_sentences":[{"sentence":"The solubilization of the protein was achieved using a detergent.","translation":"そのタンパク質の可溶化は、洗剤を用いて達成された。","type":"noun","meaning_category":"可溶化 (一般的な溶解)"},{"sentence":"Micellar solubilization is crucial for the formulation of certain drugs.","translation":"ミセル可溶化は、特定の薬物の製剤化に不可欠である。","type":"noun","meaning_category":"ミセル可溶化"},{"sentence":"The study investigated the solubilization of heavy metals in contaminated soil.","translation":"その研究では、汚染された土壌中の重金属の可溶化について調査した。","type":"noun","meaning_category":"可溶化 (環境科学)"}]}