{"word":"squireship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"郷士の地位、大地主の地位","english_definition":"The position or status of a squire; the estate or property of a squire.","examples":[{"sentence":"He inherited the squireship from his father.","translation":"彼は父親から郷士の地位を受け継いだ。"},{"sentence":"The squireship included a large manor house and extensive lands.","translation":"その大地主の地位には、大きな荘園の館と広大な土地が含まれていた。"}],"collocations":["inherit a squireship","hold a squireship","the local squireship"],"synonyms":["landownership","gentry","estate","manor"],"antonyms":[]}],"etymology":{"value":"'Squire' + '-ship'. 'Squire' comes from Old French 'esquier', meaning 'shield-bearer' or 'attendant to a knight'. '-ship' is a suffix denoting a state, condition, or office.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskwaɪərʃɪp/","syllables":"squire-ship"},"inflection":{"noun_plural":"squireships"},"usage_notes":{"explanation":"'Squireship' refers specifically to the social and economic position of a squire, a member of the landed gentry. It often implies a certain level of social standing and responsibility within a local community. The term is most commonly used in historical contexts, particularly when discussing the social hierarchy of rural England.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was awarded a squireship for his bravery.","correct":"✓ He was awarded a knighthood for his bravery.","note":"'Squireship' is inherited or acquired through land ownership, not awarded for bravery. Knighthood is a more appropriate honor for bravery."},{"incorrect":"✗ The squireship was a democratic office.","correct":"✓ The squireship was a hereditary position.","note":"'Squireship' is typically a hereditary position associated with land ownership, not an elected or democratic office."}],"priority":"★☆☆"},"related_words":{"derivatives":["squire","squirearchy"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'squireship' is a relatively rare and specialized term, primarily used in historical or literary contexts to describe the position or status of a squire, a member of the landed gentry. Understanding its meaning requires familiarity with the social hierarchy of rural England and the role of squires within that system. Due to its limited usage and specific historical connotations, it is considered a high-level vocabulary word.","priority":"★☆☆"},"example_sentences":[{"sentence":"The responsibilities of the squireship included managing the estate and serving as a local magistrate.","translation":"郷士の責任には、領地の管理と地方判事としての役割が含まれていた。","type":"general","meaning_category":"position/status"},{"sentence":"The decline of the landed gentry led to the gradual disappearance of the traditional squireship.","translation":"地主階級の衰退は、伝統的な郷士の地位の徐々の消滅につながった。","type":"historical","meaning_category":"historical context"}]}