{"word":"impartation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(知識・知恵・霊的なものなどの)伝達、分け与え、授与","english_definition":"The act of imparting; communication or conveyance of something, such as knowledge, wisdom, or a spiritual gift.","examples":[{"sentence":"The impartation of knowledge is a key role of teachers.","translation":"知識の伝達は教師の重要な役割です。"},{"sentence":"He believed in the impartation of spiritual gifts through prayer.","translation":"彼は祈りを通して霊的な賜物が授与されると信じていた。"},{"sentence":"The impartation of skills is essential for job training.","translation":"技能の伝達は職業訓練に不可欠です。"}],"collocations":["spiritual impartation (霊的な授与)","knowledge impartation (知識の伝達)","skill impartation (技能の伝達)","divine impartation (神聖な授与)"],"synonyms":["communication","transmission","conveyance","bestowal","granting","endowment"],"antonyms":["withholding","concealment","retention"]}],"etymology":{"value":"From the verb 'impart,' which comes from the Latin 'impartire,' meaning 'to share, give a part.' 'Impartire' is composed of 'in-' (in, into) and 'partire' (to divide, share), from 'pars' (a part). The suffix '-ation' is added to form the noun.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪmpɑːrˈteɪʃən/","syllables":"im-par-ta-tion"},"inflection":{"noun_plural":"impartations"},"usage_notes":{"explanation":"'Impartation' is a relatively formal and somewhat specialized term, often used in educational, religious, or spiritual contexts. It refers to the process of transferring or sharing something intangible, such as knowledge, wisdom, a skill, or a spiritual blessing. It suggests a deliberate and intentional act of giving something of value to another person or group. It is less common in everyday conversation than simpler words like 'sharing' or 'transmission.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The impartation was very good.","correct":"✓ The impartation of knowledge was very effective.","note":"'Impartation' itself is the act of imparting, so it's better to specify *what* was imparted (e.g., knowledge, skills, wisdom) to make the sentence clearer. Alternatively, use a different word like 'teaching' or 'instruction' if the focus is on the method rather than the act of imparting itself."},{"incorrect":"✗ He received an impartation from the teacher.","correct":"✓ He received an impartation of wisdom from the teacher.","note":"Similar to the previous point, specify what kind of impartation was received (e.g., an impartation of wisdom, an impartation of spiritual gifts). This makes the sentence more precise."}],"priority":"★☆☆"},"related_words":{"derivatives":["impart (verb: to communicate, to bestow)","impartible (adjective: capable of being imparted)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Impartation' is a noun that describes the act of giving or sharing something, usually something abstract like knowledge, wisdom, or a spiritual gift. It's a formal word and not used very often in everyday conversation. You're more likely to encounter it in academic or religious writings. Think of it as the process by which someone receives something valuable from another person, often through teaching, mentorship, or spiritual practice."},"example_sentences":[{"sentence":"The conference focused on the impartation of leadership skills to young professionals.","translation":"その会議は若い専門家へのリーダーシップスキルの伝達に焦点を当てていました。","type":"noun","meaning_category":"伝達 (skills)"},{"sentence":"She experienced a powerful impartation of faith during the worship service.","translation":"彼女は礼拝中に信仰の力強い授与を経験しました。","type":"noun","meaning_category":"授与 (spiritual)"},{"sentence":"The professor emphasized the importance of the impartation of critical thinking skills.","translation":"教授は批判的思考スキルの伝達の重要性を強調しました。","type":"noun","meaning_category":"伝達 (knowledge)"}]}