{"word":"Pap smear","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"パップスメア、子宮頸部細胞診","english_definition":"a screening test for cervical cancer, involving the microscopic examination of cells scraped from the cervix.","examples":[{"sentence":"She had a Pap smear during her annual check-up.","translation":"彼女は年次検診でパップスメア検査を受けた。"},{"sentence":"Regular Pap smears are important for early detection of cervical cancer.","translation":"定期的なパップスメア検査は、子宮頸がんの早期発見に重要です。"}],"collocations":["get a Pap smear","have a Pap smear","Pap smear test","abnormal Pap smear","routine Pap smear"],"synonyms":["cervical smear","cervical screening","Pap test"],"antonyms":[]}],"etymology":{"value":"Named after Dr. George Nicholas Papanicolaou, a Greek-American pathologist who pioneered the technique in the 1920s.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpæp smɪər/","syllables":"Pap smear"},"inflection":{"noun_plural":"Pap smears"},"usage_notes":{"explanation":"A Pap smear is a medical screening procedure for cervical cancer. It involves collecting cells from the cervix and examining them under a microscope to detect any abnormalities that could indicate precancerous or cancerous changes. It is typically recommended that women begin having regular Pap smears at a certain age, as advised by their healthcare provider.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to have a pap smear on my throat.","correct":"✓ I'm going to have a Pap smear on my cervix.","note":"Pap smears are specifically for the cervix, not the throat."},{"incorrect":"✗ He needs to get a pap smear.","correct":"✓ She needs to get a Pap smear.","note":"Pap smears are typically performed on women, as they are a screening test for cervical cancer."}],"priority":"★★☆"},"related_words":{"derivatives":["Pap test","cervical cancer","gynecologist","gynecology","HPV (Human Papillomavirus)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"A \"Pap smear\" is a medical test for women. It checks for cancer in the cervix. The cervix is part of a woman's body. Doctors take cells from the cervix and look at them under a microscope. This helps find problems early. It's important for women to get Pap smears regularly.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor recommended a Pap smear as part of her routine checkup.","translation":"医師は、彼女の定期検診の一部としてパップスメア検査を推奨しました。","type":"noun","meaning_category":"子宮頸部細胞診"},{"sentence":"An abnormal Pap smear result requires further investigation.","translation":"パップスメア検査の結果が異常な場合は、さらなる検査が必要です。","type":"noun","meaning_category":"子宮頸部細胞診"}]}