{"word":"proprietarily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"所有権的に、独占的に、特許権的に","english_definition":"In a manner relating to ownership, especially exclusive ownership; in a way that protects or exploits patent rights.","examples":[{"sentence":"The software was proprietarily developed and could not be copied.","translation":"そのソフトウェアは独占的に開発されたもので、コピーは許可されていません。"},{"sentence":"The company handled the data proprietarily, ensuring no unauthorized access.","translation":"会社はデータを所有権的に扱い、不正アクセスがないようにしました。"}],"collocations":["proprietarily developed","proprietarily protected","proprietarily handled"],"synonyms":["exclusively","privately","solely","copyrighted","patented"],"antonyms":["openly","publicly","freely","generically"]},{"part_of_speech":"adverb","definition":"専売特許として、企業秘密として","english_definition":"As a trade secret; in a manner that involves or constitutes a trade secret.","examples":[{"sentence":"The formula was kept proprietarily and never revealed to outsiders.","translation":"その公式は企業秘密として保持され、外部に公開されることはありませんでした。"},{"sentence":"The manufacturing process was proprietarily guarded to maintain a competitive edge.","translation":"製造プロセスは競争力を維持するために企業秘密として厳重に保護されていました。"}],"collocations":["proprietarily guarded","proprietarily maintained","proprietarily kept"],"synonyms":["confidentially","secretly","privately","commercially"],"antonyms":["disclosed","revealed","divulged"]}],"etymology":{"value":"From 'proprietary' + '-ly'. 'Proprietary' comes from Latin 'proprietas' (ownership).","priority":"★★☆"},"pronunciation":{"ipa":"/prəˈpraɪəˌtɛrɪli/","syllables":"pro-pri-e-tar-i-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Proprietarily' is used to describe actions or processes related to exclusive ownership, especially in the context of intellectual property, trade secrets, or patented technologies. It emphasizes the protection and control of these assets by the owner.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The information was proprietarily, so it was kept secret.","correct":"✓ The information was proprietary, so it was kept secret.","note":"Confusing the adverb 'proprietarily' with the adjective 'proprietary'. Use 'proprietary' to describe the nature of the information."},{"incorrect":"✗ They developed the software proprietarily, but it was open-source.","correct":"✓ They developed the software, protecting its proprietary aspects, but it was open-source.","note":"'Proprietarily' implies exclusive control, which is contradictory to open-source. Rephrase to clarify that only certain aspects were protected."}],"priority":"★★☆"},"related_words":{"derivatives":["proprietary","proprietor","proprietorship"],"phrases":["proprietary software","proprietary information","intellectual property"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Proprietarily' is an advanced term used to describe doing something in a way that protects ownership rights, especially intellectual property or trade secrets. It's often used in business or legal contexts to emphasize that a process or product is developed and controlled exclusively by a particular company or individual. For example, 'The company proprietarily developed the technology to prevent others from copying it.'"},"example_sentences":[{"sentence":"The company proprietarily developed the new algorithm to maintain a competitive advantage.","translation":"その会社は競争優位性を維持するために、新しいアルゴリズムを独占的に開発しました。","type":"general","meaning_category":"ownership"},{"sentence":"The data was handled proprietarily to ensure compliance with privacy regulations.","translation":"データはプライバシー規制の遵守を確実にするために、所有権的に扱われました。","type":"general","meaning_category":"ownership"},{"sentence":"The manufacturing process was proprietarily guarded, preventing competitors from replicating it.","translation":"製造プロセスは企業秘密として厳重に保護され、競合他社がそれを複製できないようにしました。","type":"trade secret","meaning_category":"ownership"}]}