{"word":"Periodontic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"歯周病学の、歯周治療の","english_definition":"Relating to periodontics, the branch of dentistry concerned with the structures surrounding and supporting the teeth.","examples":[{"sentence":"Periodontic treatment is essential for maintaining healthy gums.","translation":"健康な歯茎を維持するためには、歯周治療が不可欠です。"},{"sentence":"The periodontic specialist examined the patient's gums.","translation":"歯周病専門医が患者の歯茎を診察しました。"}],"collocations":["periodontic treatment","periodontic specialist","periodontic disease"],"synonyms":["periodontal"],"antonyms":[]}],"etymology":{"value":"Derived from 'periodontics,' which comes from the Greek words 'peri' (around), 'odont' (tooth), and '-ics' (related to a science or practice).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌpɛrioʊˈdɒntɪk/","syllables":"per-i-o-don-tic"},"inflection":{"notes":"This is an adjective, so it doesn't have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Periodontic' is primarily used as an adjective to describe something related to the field of periodontics. It's often used in medical or dental contexts to specify treatments, specialists, or diseases concerning the gums and supporting structures of the teeth.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a periodontic.","correct":"✓ He is a periodontist.","note":"'Periodontic' is an adjective; the correct noun for a specialist is 'periodontist'."}],"priority":"☆☆☆"},"related_words":{"derivatives":["periodontics (noun: 歯周病学)","periodontist (noun: 歯周病専門医)","periodontal (adjective: 歯周の)"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'periodontic' is a specialized term used in the field of dentistry. It is an adjective that describes something related to periodontics, which is the branch of dentistry dealing with the structures surrounding and supporting the teeth, such as the gums and bone. This term is typically encountered in professional or academic contexts related to dental health. Understanding this word requires familiarity with medical terminology and dental concepts."},"example_sentences":[{"sentence":"The patient was referred for periodontic care.","translation":"患者は歯周治療のために紹介されました。","type":"adjective","meaning_category":"歯周治療の"},{"sentence":"The study focused on the effectiveness of various periodontic procedures.","translation":"その研究は、さまざまな歯周治療の有効性に焦点を当てました。","type":"adjective","meaning_category":"歯周病学の"}]}