{"word":"three-styled","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"3つのスタイルを持つ、3つのスタイルで構成された","english_definition":"Having or composed of three styles.","examples":[{"sentence":"The three-styled dance incorporated elements of ballet, jazz, and hip-hop.","translation":"その3つのスタイルで構成されたダンスは、バレエ、ジャズ、ヒップホップの要素を取り入れていました。"},{"sentence":"The three-styled building was a unique architectural achievement.","translation":"その3つのスタイルを持つ建物は、ユニークな建築上の業績でした。"}],"collocations":["three-styled dance","three-styled building","three-styled approach"],"synonyms":["tri-styled","three-faceted","three-mode"],"antonyms":["single-styled","mono-styled"]},{"part_of_speech":"adjective","definition":"3つの異なるスタイルに適応できる、または3つの異なるスタイルで表現できる","english_definition":"Adaptable to or expressible in three different styles.","examples":[{"sentence":"The three-styled artist could paint in realism, impressionism, and abstract styles.","translation":"その3つの異なるスタイルに適応できるアーティストは、写実主義、印象派、抽象派のスタイルで絵を描くことができました。"},{"sentence":"The three-styled musician could play classical, jazz, and rock music.","translation":"その3つの異なるスタイルで表現できる音楽家は、クラシック、ジャズ、ロック音楽を演奏することができました。"}],"collocations":["three-styled artist","three-styled musician","three-styled performance"],"synonyms":["versatile","adaptable","multi-styled"],"antonyms":["inflexible","unadaptable"]}],"etymology":{"value":"The word \"three-styled\" is formed by combining the numeral \"three\" with the word \"styled.\"","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈθriː ˈstaɪld/","syllables":"three-styled"},"inflection":{"notes":"The word \"three-styled\" is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The adjective \"three-styled\" is used to describe something that has or is characterized by three different styles. It can also describe someone or something that is capable of adapting to or expressing three different styles.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"The three styled building.","correct":"The three-styled building.","note":"Hyphen is needed."}],"priority":"★☆☆"},"related_words":{"derivatives":["style","styled"],"related_terms":["multi-styled","two-styled","single-styled"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"three-styled\" is a relatively uncommon adjective used to describe something that has or is characterized by three different styles. It is typically used in more formal or technical contexts, such as art, architecture, or fashion."},"example_sentences":[{"sentence":"The three-styled approach to marketing involved social media, email campaigns, and print advertising.","translation":"マーケティングへの3つのスタイルで構成されたアプローチは、ソーシャルメディア、メールキャンペーン、印刷広告を含んでいました。","type":"adjective","meaning_category":"3つのスタイルを持つ"},{"sentence":"The three-styled chef was known for his ability to create dishes that blended French, Italian, and Asian cuisines.","translation":"その3つの異なるスタイルに適応できるシェフは、フランス料理、イタリア料理、アジア料理を融合させた料理を作る能力で知られていました。","type":"adjective","meaning_category":"3つの異なるスタイルに適応できる"}]}