{"word":"Salmonellosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"サルモネラ症（サルモネラ菌による食中毒）","english_definition":"An infection with bacteria called Salmonella, usually causing diarrhea, fever, vomiting, and abdominal cramps.","examples":[{"sentence":"Salmonellosis is often caused by eating contaminated food.","translation":"サルモネラ症は、汚染された食品を食べることによって引き起こされることが多いです。"},{"sentence":"Symptoms of salmonellosis usually appear within 12 to 72 hours.","translation":"サルモネラ症の症状は通常、12〜72時間以内に現れます。"},{"sentence":"Proper food handling can help prevent salmonellosis.","translation":"適切な食品の取り扱いは、サルモネラ症の予防に役立ちます。"}],"collocations":["contract salmonellosis (サルモネラ症に感染する)","prevent salmonellosis (サルモネラ症を予防する)","symptoms of salmonellosis (サルモネラ症の症状)","foodborne salmonellosis (食品媒介性サルモネラ症)"],"synonyms":["Salmonella infection","Salmonella poisoning"],"antonyms":[]}],"etymology":{"value":"From Salmonella (the genus of bacteria) + -osis (a suffix indicating a disease or condition). Named after Daniel Elmer Salmon, an American veterinary pathologist.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsælmənəˈloʊsɪs/","syllables":"sal-mo-nel-lo-sis"},"inflection":{"noun_plural":"salmonelloses (less common)"},"usage_notes":{"explanation":"Salmonellosis is a common bacterial infection that affects the intestinal tract. Humans usually become infected through contaminated food or water. Common sources of infection include raw or undercooked meat, poultry, eggs, and unpasteurized milk. Symptoms can range from mild to severe and usually resolve within a week.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a salmonellosis.","correct":"✓ I have salmonellosis.","note":"'Salmonellosis' is an uncountable noun, so it doesn't usually take an article ('a' or 'an')."},{"incorrect":"✗ Salmonellosis is a virus.","correct":"✓ Salmonellosis is a bacterial infection.","note":"Salmonellosis is caused by bacteria, not a virus."}],"priority":"★★☆"},"related_words":{"derivatives":["Salmonella (noun: the genus of bacteria that causes salmonellosis)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2-C1","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Salmonellosis' is a term used in medical and scientific contexts to describe an infection caused by Salmonella bacteria. It's important to understand that it's a bacterial infection, often foodborne, and can cause gastrointestinal distress. While not an everyday word, it's relevant in discussions about food safety and public health."},"example_sentences":[{"sentence":"The Centers for Disease Control and Prevention (CDC) reported an increase in salmonellosis cases this year.","translation":"疾病管理予防センター（CDC）は、今年サルモネラ症の症例が増加したと報告しました。","type":"general","meaning_category":"general"},{"sentence":"Thoroughly cooking poultry and eggs can prevent the spread of salmonellosis.","translation":"鶏肉と卵を十分に調理することで、サルモネラ症の蔓延を防ぐことができます。","type":"prevention","meaning_category":"prevention"},{"sentence":"The patient was diagnosed with salmonellosis after experiencing severe diarrhea and fever.","translation":"患者は重度の下痢と発熱を経験した後、サルモネラ症と診断されました。","type":"diagnosis","meaning_category":"diagnosis"}]}