{"word":"Non-Mongol","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"モンゴル人ではない、モンゴル語族に属さない","english_definition":"Not of Mongolian ethnicity or not belonging to the Mongolic language family.","examples":[{"sentence":"The study focused on the genetic differences between Mongol and Non-Mongol populations in the region.","translation":"その研究は、その地域のモンゴル人と非モンゴル人集団間の遺伝的差異に焦点を当てた。"},{"sentence":"Several Non-Mongol ethnic groups reside within Mongolia's borders.","translation":"いくつかの非モンゴル民族集団がモンゴルの国境内に居住している。"}],"collocations":["Non-Mongol population","Non-Mongol ethnic group","Non-Mongol language"],"synonyms":["Non-Mongolian","Non-Mongolic"],"antonyms":["Mongol","Mongolian","Mongolic"]},{"part_of_speech":"noun","definition":"モンゴル人ではない人、モンゴル語族に属する言語を話さない人","english_definition":"A person who is not of Mongolian ethnicity or does not speak a language belonging to the Mongolic language family.","examples":[{"sentence":"The museum showcased artifacts from both Mongol and Non-Mongol cultures.","translation":"その博物館は、モンゴル文化と非モンゴル文化両方の工芸品を展示した。"},{"sentence":"The census data distinguished between Mongol and Non-Mongol residents.","translation":"国勢調査データは、モンゴル人と非モンゴル人の居住者を区別した。"}],"collocations":["Non-Mongol resident","Non-Mongol culture","Non-Mongol speaker"],"synonyms":["Non-Mongolian","Non-Mongolic person"],"antonyms":["Mongol","Mongolian"]}],"etymology":{"value":"\"Non-\" (否定の接頭辞) + \"Mongol\" (モンゴル人、モンゴル語)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈmɒŋɡəl/","syllables":"Non-Mon-gol"},"inflection":{"noun_plural":"Non-Mongols"},"usage_notes":{"explanation":"\"Non-Mongol\" は、モンゴル民族またはモンゴル語族に属さないもの全般を指す包括的な用語です。民族、言語、文化など、様々な文脈で使用されます。特定の民族や言語を指すのではなく、あくまでモンゴルではないことを示す場合に用いられます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Non-Mongol, he speak Kazakh.","correct":"✓ He is a Non-Mongol; he speaks Kazakh. / ✓ He is a Non-Mongol who speaks Kazakh.","note":"Non-Mongol の後に文を続ける場合は、セミコロン (;) で区切るか、関係代名詞 (who) を使用します。"},{"incorrect":"✗ Nonmongol people are also living in Mongolia.","correct":"✓ Non-Mongol people are also living in Mongolia.","note":"接頭辞 \"Non-\" は、ハイフンで区切るのが一般的です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Non-Mongolian","Non-Mongolic"],"related_terms":["Mongol","Mongolian","Mongolic","Turkic","Slavic","Tungistic"]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Non-Mongol\" is a term used to describe anything that is not Mongolian. It is often used in academic or formal contexts when discussing ethnicity, language, or culture in relation to Mongolia. The term is straightforward in its meaning but may require some background knowledge of Mongolian history and demographics to fully understand its implications."},"example_sentences":[{"sentence":"The research compared the genetic markers of Mongol and Non-Mongol groups in Central Asia.","translation":"その研究は、中央アジアのモンゴル人と非モンゴル人グループの遺伝子マーカーを比較した。","type":"adjective","meaning_category":"モンゴル人ではない"},{"sentence":"Many Non-Mongol languages are spoken in the region alongside Mongolian.","translation":"モンゴル語に加えて、多くの非モンゴル語がその地域で話されている。","type":"adjective","meaning_category":"モンゴル語族に属さない"},{"sentence":"The festival celebrated the diverse traditions of both Mongol and Non-Mongol communities.","translation":"その祭りは、モンゴル人と非モンゴル人コミュニティ両方の多様な伝統を祝った。","type":"noun","meaning_category":"モンゴル人ではない人"}]}