{"word":"interacademic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"学術機関間の、大学間の","english_definition":"Relating to or involving more than one academic institution or university.","examples":[{"sentence":"The interacademic conference brought together researchers from universities across the country.","translation":"その学術機関間会議には、全国の大学から研究者が集まった。"},{"sentence":"An interacademic collaboration led to a breakthrough in cancer research.","translation":"大学間の共同研究が、癌研究における画期的な進歩につながった。"},{"sentence":"The interacademic exchange program allows students to study at different universities.","translation":"大学間交換プログラムにより、学生はさまざまな大学で学ぶことができる。"}],"collocations":["interacademic conference","interacademic collaboration","interacademic exchange","interacademic research","interacademic cooperation"],"synonyms":["interuniversity","cross-institutional","multi-institutional"],"antonyms":["intra-academic","single-institution"]}],"etymology":{"value":"'Inter-' (between, among) + 'academic' (relating to education and scholarship).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntərækəˈdɛmɪk/","syllables":"in-ter-ac-a-dem-ic"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Interacademic' is used to describe activities, relationships, or collaborations that involve multiple academic institutions. It emphasizes the cooperative or shared nature of the endeavor across different universities or colleges. It is often used in formal or academic contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The conference was very interacademic.","correct":"✓ The conference was interacademic.","note":"'Interacademic' is already a descriptive term; using intensifiers like 'very' is generally redundant."},{"incorrect":"✗ He is an interacademic student.","correct":"✓ He is a student participating in an interacademic program.","note":"'Interacademic' describes the program or collaboration, not the student directly."}],"priority":"★★☆"},"related_words":{"derivatives":["academic","academical","academically","inter- (prefix)"],"phrases":["academic institution","academic collaboration","academic research"],"priority":"★★☆"},"level_frequency":{"level":"C1","frequency_google_ngram":"Low frequency, primarily used in academic or formal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'interacademic' is a formal term used to describe collaborations, relationships, or activities that involve multiple academic institutions, such as universities or colleges. It is commonly found in academic papers, institutional reports, and formal discussions about higher education. Understanding this word helps in comprehending the scope and collaborative nature of research, programs, or conferences that span across different universities.","priority":"★★☆"},"example_sentences":[{"sentence":"The interacademic study revealed significant differences in teaching methodologies.","translation":"その大学間研究は、教育方法論に大きな違いがあることを明らかにした。","type":"adjective","meaning_category":"university research"},{"sentence":"An interacademic agreement facilitated the sharing of resources between the two universities.","translation":"大学間協定により、2つの大学間のリソース共有が促進された。","type":"adjective","meaning_category":"university agreement"},{"sentence":"The interacademic seminar provided a platform for graduate students to present their research.","translation":"その大学間セミナーは、大学院生が研究発表を行うためのプラットフォームを提供した。","type":"adjective","meaning_category":"university seminar"}]}