{"word":"floating-rate","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"変動金利の","english_definition":"(of an interest rate) subject to change, usually in relation to a benchmark interest rate.","examples":[{"sentence":"We offer both fixed-rate and floating-rate mortgages.","translation":"固定金利と変動金利の住宅ローンをご用意しています。"},{"sentence":"The floating-rate loan is tied to the LIBOR rate.","translation":"その変動金利ローンはLIBOR金利に連動しています。"},{"sentence":"Many borrowers prefer floating-rate loans when interest rates are expected to fall.","translation":"金利が低下すると予想される場合、多くの借り手は変動金利ローンを好みます。"}],"collocations":["floating-rate mortgage (変動金利住宅ローン)","floating-rate loan (変動金利ローン)","floating-rate bond (変動金利債)","floating-rate note (変動金利債券)","floating-rate security (変動金利証券)"],"synonyms":["adjustable-rate","variable-rate"],"antonyms":["fixed-rate"]},{"part_of_speech":"noun","definition":"変動金利","english_definition":"an interest rate that changes over time, usually in relation to a benchmark interest rate.","examples":[{"sentence":"The advantage of a floating-rate is that it can decrease if market rates fall.","translation":"変動金利の利点は、市場金利が低下した場合に金利も低下する可能性があることです。"},{"sentence":"He decided to go with a floating-rate, hoping interest rates would stay low.","translation":"彼は金利が低いままであることを期待して、変動金利を選択することにしました。"}],"collocations":[],"synonyms":["adjustable rate","variable rate"],"antonyms":["fixed rate"]}],"etymology":{"value":"The term 'floating-rate' is a compound word. 'Floating' refers to the fact that the interest rate is not fixed but 'floats' or changes over time. 'Rate' refers to the interest rate itself.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfloʊtɪŋ reɪt/","syllables":"float-ing-rate"},"inflection":{"notes":"This term is typically used as an adjective, but can also function as a noun referring to the rate itself. No specific inflections apply."},"usage_notes":{"explanation":"'Floating-rate' describes financial instruments, such as mortgages, loans, or bonds, where the interest rate is not fixed for the life of the instrument. Instead, the rate is periodically adjusted based on a benchmark interest rate (e.g., LIBOR, SOFR, prime rate). This contrasts with 'fixed-rate' instruments, where the interest rate remains constant. Borrowers and investors choose between fixed and floating rates based on their expectations of future interest rate movements and their risk tolerance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ floating rate interest","correct":"✓ floating interest rate","note":"The correct order is 'floating interest rate' or 'floating-rate'."},{"incorrect":"✗ floating rate is more good than fixed rate.","correct":"✓ A floating rate is better than a fixed rate.","note":"Use correct comparative forms and articles."}],"priority":"★★☆"},"related_words":{"derivatives":["float (verb, noun)","floating (adjective)"],"phrasal_verbs":[],"related_terms":["interest rate","fixed-rate","LIBOR","SOFR","prime rate","mortgage","loan","bond","yield curve"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common in financial contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'floating-rate' is used in financial contexts to describe an interest rate that is not fixed but changes over time, usually in relation to a benchmark. It's important to understand this term when discussing mortgages, loans, bonds, and other financial instruments. The opposite of 'floating-rate' is 'fixed-rate', which means the interest rate remains constant over the life of the instrument. Understanding the difference between these two types of rates is crucial for making informed financial decisions."},"example_sentences":[{"sentence":"The company issued a new series of floating-rate notes.","translation":"その会社は新しいシリーズの変動金利債を発行しました。","type":"adjective","meaning_category":"finance"},{"sentence":"With a floating-rate mortgage, your monthly payments can change.","translation":"変動金利住宅ローンでは、毎月の支払額が変わる可能性があります。","type":"adjective","meaning_category":"finance"},{"sentence":"Many investors are wary of floating-rates due to interest rate volatility.","translation":"多くの投資家は、金利の変動性のため、変動金利に慎重です。","type":"noun","meaning_category":"finance"}]}