{"word":"oocystic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"オーシスト（胞嚢オーシスト）に関する、またはオーシストに特徴的な","english_definition":"Relating to or characteristic of an oocyst.","examples":[{"sentence":"The oocystic stage of the parasite's life cycle is crucial for transmission.","translation":"寄生虫のライフサイクルにおけるオーシスト期は、伝播にとって非常に重要です。"}],"collocations":["oocystic wall","oocystic morphology","oocystic development"],"synonyms":["oocystal"],"antonyms":[]}],"etymology":{"value":"Derived from 'oocyst' (a stage in the life cycle of certain parasites) with the suffix '-ic' (relating to).","priority":"★★★"},"pronunciation":{"ipa":"ˌoʊ.əʊˈsɪs.tɪk/","syllables":"o-o-cys-tic"},"inflection":{},"usage_notes":{"explanation":"The term 'oocystic' is primarily used in the context of parasitology, specifically when discussing parasites like *Cryptosporidium* or *Toxoplasma*. It describes features, structures, or processes associated with the oocyst stage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The oocystic are found in water.","correct":"✓ Oocysts are found in water.","note":"'Oocystic' is an adjective, so it must modify a noun. To refer to the oocysts themselves, use the noun form 'oocysts'."}],"priority":"★★☆"},"related_words":{"derivatives":["oocyst (noun): a walled structure containing sporozoites formed during the sexual reproduction of many sporozoan protozoa, such as malaria parasites","sporocyst (noun): a parasitic cyst formed in some sporozoans following the oocyst stage"],"related_terms":["parasite","sporozite","protozoa"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in scientific or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Oocystic' is a technical term used in biology and parasitology. It describes something related to an oocyst, which is a stage in the life cycle of certain parasites. Understanding this term requires familiarity with basic parasitology concepts."},"example_sentences":[{"sentence":"Oocystic shedding can contaminate water sources.","translation":"オーシストの排出は水源を汚染する可能性があります。","type":"general","meaning_category":"general"},{"sentence":"The oocystic wall provides protection against environmental stressors.","translation":"オーシスト壁は環境ストレス要因に対する保護を提供します。","type":"specific","meaning_category":"specific"}]}