{"word":"subpassage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(文章や音楽作品などの)一部分、一節、抜粋","english_definition":"A smaller section or excerpt taken from a larger passage of text or a musical composition.","examples":[{"sentence":"The student analyzed a key subpassage from the novel.","translation":"学生はその小説の重要な一節を分析した。"},{"sentence":"The composer highlighted a memorable subpassage in the symphony.","translation":"作曲家はその交響曲の中の記憶に残る一節を強調した。"},{"sentence":"We need to identify the relevant subpassages to answer the question.","translation":"質問に答えるために、関連する部分を特定する必要があります。"}],"collocations":["key subpassage","relevant subpassage","important subpassage","analyze a subpassage","extract a subpassage"],"synonyms":["excerpt","passage","section","extract","segment","fragment"],"antonyms":["entire passage","whole text","complete work"]}],"etymology":{"value":"The word 'subpassage' is formed by combining the prefix 'sub-' (meaning 'under', 'below', or 'part of') with the word 'passage' (meaning a section or portion of text).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌbˌpæsɪdʒ/","syllables":"sub-pas-sage"},"inflection":{"noun_plural":"subpassages"},"usage_notes":{"explanation":"'Subpassage' refers to a specific, smaller portion of a larger text or musical work. It is often used in academic or analytical contexts when focusing on a particular section for closer examination. The term implies that the selected portion is part of, and subordinate to, a more extensive work.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subpassage was the entire chapter.","correct":"✓ The subpassage was a section within the chapter.","note":"A subpassage is always a part of a larger passage, not the entire passage itself."},{"incorrect":"✗ He subpassaged the text.","correct":"✓ He extracted a subpassage from the text.","note":"'Subpassage' is a noun, not a verb. To describe the action of taking a subpassage, use verbs like 'extract', 'select', or 'identify'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["passage","excerpt","extract","section","segment","text","composition","analysis"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'subpassage' is a relatively uncommon term, primarily used in academic or analytical contexts. It refers to a specific, smaller section extracted from a larger piece of writing or music. Understanding this word requires a good vocabulary and familiarity with analytical language. It's not typically encountered in everyday conversation or general reading materials."},"example_sentences":[{"sentence":"The professor asked the students to identify the central theme of the selected subpassage.","translation":"教授は学生たちに、選択された一節の中心的なテーマを特定するように求めた。","type":"noun","meaning_category":"part of text"},{"sentence":"The critic focused on a particular subpassage to illustrate the author's use of symbolism.","translation":"評論家は、作者の象徴主義の使用を説明するために、特定の一節に焦点を当てた。","type":"noun","meaning_category":"part of text"},{"sentence":"The musician practiced the difficult subpassage repeatedly until he mastered it.","translation":"音楽家は、難しい部分を習得するまで繰り返し練習した。","type":"noun","meaning_category":"part of music"}]}