{"word":"serotinous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"晩生の、遅れて開花・結実する、または種子を放出する","english_definition":"relating to or denoting plants that release their seeds only in response to an environmental trigger, such as fire.","examples":[{"sentence":"Serotinous cones require heat to open and release their seeds.","translation":"晩生の球果は、開いて種子を放出するために熱を必要とする。"},{"sentence":"Many serotinous plants are adapted to fire-prone environments.","translation":"多くの晩生植物は、火災が発生しやすい環境に適応している。"}],"collocations":["serotinous cones","serotinous plants","serotinous species"],"synonyms":["late-blooming","delayed-release"],"antonyms":["precocious","early-blooming"]}],"etymology":{"value":"Derived from the Latin word 'serotinus,' meaning 'late' or 'belonging to the evening,' from 'serus' (late).","priority":"★★★"},"pronunciation":{"ipa":"/səˈrɒtɪnəs/","syllables":"se-ro-ti-nous"},"inflection":{"notes":"Adjective, comparative and superlative forms are more serotinous, most serotinous, but rarely used."},"usage_notes":{"explanation":"'Serotinous' refers to plants that have adapted to environments where seed release is triggered by specific environmental cues, most commonly fire. This is a survival strategy, ensuring seeds are released under conditions favorable for germination and growth after a disturbance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is serotiny.","correct":"✓ The plant is serotinous.","note":"'Serotiny' is the noun form referring to the condition of being serotinous, whereas 'serotinous' is the adjective describing the plant."}],"priority":"★★★"},"related_words":{"derivatives":["serotiny (noun)"],"phrasal_verbs":[],"related_terms":["pyriscence (related phenomenon where seed release is triggered by fire)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'serotinous' is a scientific term used to describe plants that exhibit a specific adaptation related to seed release. These plants hold onto their seeds within specialized structures (like cones or pods) until a specific environmental trigger, such as fire, heat, or drought, occurs. The trigger causes the structure to open and release the seeds, allowing the plant to reproduce after a disturbance. Understanding this term requires a background in botany or ecology."},"example_sentences":[{"sentence":"The lodgepole pine is a well-known example of a tree with **serotinous** cones.","translation":"ダイオウショウは、晩生の球果を持つ木のよく知られた例である。","type":"adjective","meaning_category":"delayed seed release"},{"sentence":"Fire plays a crucial role in the regeneration of **serotinous** plant communities.","translation":"火災は、晩生植物群落の再生において重要な役割を果たす。","type":"adjective","meaning_category":"fire-dependent seed release"}]}