{"word":"Simuliid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ブユ、ブヨ (black fly, buffalo gnat)","english_definition":"A black fly, also known as a buffalo gnat or turkey gnat, is any member of the family Simuliidae of bloodsucking flies. They are small, black, stout flies with a characteristic humped thorax. They are a common nuisance in many parts of the world, and are vectors of several diseases of humans and livestock.","examples":[{"sentence":"Simuliids are known for their painful bites.","translation":"ブユは痛みを伴う刺し傷で知られています。"},{"sentence":"The larvae of simuliids develop in flowing water.","translation":"ブユの幼虫は流水中で成長します。"}],"collocations":["simuliid bite (ブユの刺し傷)","simuliid larvae (ブユの幼虫)","black fly fever (ブユ熱)"],"synonyms":["black fly","buffalo gnat","turkey gnat"],"antonyms":[]}],"etymology":{"value":"New Latin Simuliidae, from Simulia, a genus name, + -idae, taxonomic suffix indicating a family. Simulia is derived from Latin similis, meaning 'similar', referring to the resemblance of these flies to other small flies.","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˈmjuːlɪɪd/","syllables":"Si-mu-li-id"},"inflection":{"noun_plural":"Simuliids"},"usage_notes":{"explanation":"The term \"Simuliid\" refers to any member of the Simuliidae family, which encompasses various species of black flies. These flies are notorious for their blood-feeding habits and the irritating bites they inflict. They are often found near flowing water sources, where their larvae develop.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I was bitten by a simuliid, it was like a mosquito bite.","correct":"✓ I was bitten by a simuliid, it was much more painful than a mosquito bite.","note":"Simuliid bites are typically more painful and cause more localized swelling and itching than mosquito bites."}],"priority":"★★☆"},"related_words":{"derivatives":["Simuliidae (family name)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Simuliid' is a scientific term used to refer to black flies, which are small, biting insects. This word is typically used in scientific or technical contexts, or when discussing public health issues related to these insects. It is not a common word in everyday conversation. Understanding this term is useful for reading scientific literature or articles about insect-borne diseases.","priority":"★★☆"},"example_sentences":[{"sentence":"The stream was teeming with simuliid larvae.","translation":"小川はブユの幼虫でいっぱいだった。","type":"noun","meaning_category":"insect larvae"},{"sentence":"Protective clothing is essential to avoid simuliid bites in this area.","translation":"この地域でブユに刺されないようにするには、防護服が不可欠です。","type":"noun","meaning_category":"insect bite prevention"}]}