{"word":"ogmic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"オグム文字の、オグム文字で書かれた","english_definition":"Relating to or written in the Ogham alphabet.","examples":[{"sentence":"The ogmic inscriptions are found mainly on standing stones.","translation":"オグム文字の碑文は主に立石に見られる。"},{"sentence":"He studied the ogmic script and its historical context.","translation":"彼はオグム文字とその歴史的背景を研究した。"}],"collocations":["ogmic inscription (オグム文字の碑文)","ogmic script (オグム文字)","ogmic alphabet (オグム文字)"],"synonyms":["oghamic"],"antonyms":[]}],"etymology":{"value":"Derived from 'ogham' (also spelled 'ogmic'), the name of the alphabet itself, which is of uncertain origin, possibly from the name of a Celtic god or hero.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɒɡmɪk/","syllables":"og-mic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Ogmic' is a relatively rare adjective used to describe something related to the Ogham alphabet, an early medieval alphabet used primarily to write the early Irish language. It is most often encountered in archaeological or historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote an ogmic poem using Latin letters.","correct":"✓ He wrote a poem inspired by ogmic script.","note":"Ogmic refers to the script itself, not the content or style of writing. You can't write an 'ogmic poem' in Latin letters, but you can write a poem inspired by the script."}],"priority":"★★☆"},"related_words":{"derivatives":["ogham (noun: オグム文字)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'ogmic' is highly specialized and rarely encountered outside of academic or historical contexts related to early Irish language and culture. Understanding requires familiarity with the Ogham alphabet itself."},"example_sentences":[{"sentence":"The museum displayed several stones with clear ogmic carvings.","translation":"博物館には、明確なオグム文字の彫刻が施された石がいくつか展示されていた。","type":"adjective","meaning_category":"オグム文字の"}]}