{"word":"osteotome","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"骨切り刀、骨ノミ","english_definition":"a surgical chisel for cutting or shaping bone.","examples":[{"sentence":"The surgeon used an osteotome to carefully reshape the bone.","translation":"外科医は骨を慎重に再形成するために骨切り刀を使用した。"},{"sentence":"Osteotomes come in various sizes and shapes for different surgical procedures.","translation":"骨切り刀には、さまざまな外科手術のためにさまざまなサイズと形状がある。"}],"collocations":["surgical osteotome","sharp osteotome","use an osteotome","osteotome blade"],"synonyms":["bone chisel","surgical chisel"],"antonyms":[]}],"etymology":{"value":"From Greek 'osteon' (bone) + 'tome' (cutting instrument).","priority":"★★☆"},"pronunciation":{"ipa":"ˈɒstiətoʊm","syllables":"os-te-o-tome"},"inflection":{"noun_plural":"osteotomes"},"usage_notes":{"explanation":"An osteotome is a specialized surgical instrument used primarily for cutting or shaping bone. It is similar to a chisel but designed specifically for use on bone tissue. Osteotomes are essential tools in orthopedic surgery, reconstructive surgery, and other surgical fields where bone modification is required.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor used a scalpel to cut the bone; it's an osteotome.","correct":"✓ The doctor used an osteotome to cut the bone.","note":"A scalpel is for soft tissue, an osteotome is for bone."}],"priority":"★☆☆"},"related_words":{"derivatives":["osteotomy (noun): surgical cutting of a bone"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'osteotome' is a specialized term primarily used in medical contexts, specifically surgery. It refers to a surgical instrument designed for cutting or shaping bone. Understanding this term requires some familiarity with medical terminology. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The orthopedic surgeon selected a narrow osteotome for the delicate procedure.","translation":"整形外科医は、繊細な手術のために細い骨切り刀を選んだ。","type":"noun","meaning_category":"surgical instrument"},{"sentence":"Proper sterilization of the osteotome is crucial to prevent infection.","translation":"感染を防ぐためには、骨切り刀の適切な滅菌が不可欠である。","type":"noun","meaning_category":"surgical instrument"}]}