{"word":"coregent","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"共同統治者、共同摂政","english_definition":"A person who rules jointly with another; a joint regent.","examples":[{"sentence":"The young king ruled with his mother as coregent.","translation":"若い王は母親と共同統治者として統治した。"},{"sentence":"During the prince's minority, a council of coregents governed the country.","translation":"王子の未成年の間、共同摂政の評議会が国を統治した。"}],"collocations":["act as coregent","appoint a coregent","rule as coregent"],"synonyms":["joint ruler","joint regent","co-ruler","co-regent"],"antonyms":["sole ruler","regent"]},{"part_of_speech":"adjective","definition":"共同統治の、共同摂政の","english_definition":"Ruling jointly with another; pertaining to a joint regency.","examples":[{"sentence":"The coregent powers were divided equally between the two families.","translation":"共同統治の権限は、2つの家族の間で平等に分割された。"},{"sentence":"The coregent agreement ensured stability during the transition period.","translation":"共同統治の合意は、移行期間中の安定を保証した。"}],"collocations":["coregent powers","coregent agreement","coregent rule"],"synonyms":["joint","co-ruling"],"antonyms":["sole"]}],"etymology":{"value":"From \"co-\" (together) + \"regent\" (one who rules in place of a monarch).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkoʊˈriːdʒənt/","syllables":"co-re-gent"},"inflection":{"noun_plural":"coregents"},"usage_notes":{"explanation":"The term \"coregent\" refers to a situation where two or more individuals share the responsibilities and powers of a ruler, either as joint monarchs or as regents ruling on behalf of a monarch who is unable to rule themselves (e.g., due to age or incapacity). It is often used in historical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a coregent to the king.","correct":"✓ He was a coregent with the king.","note":"Use \"with\" to indicate the person with whom the coregent rules."},{"incorrect":"✗ The coregent's power were limited.","correct":"✓ The coregent's power was limited.","note":"Ensure correct subject-verb agreement. If referring to one coregent, use \"was\"."}],"priority":"★★☆"},"related_words":{"derivatives":["coregency (noun): The state or period of being coregents.","regent (noun): A person appointed to administer a country because the monarch is a minor or is absent or incapacitated.","regency (noun): The office or period of office of a regent."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"coregent\" is a relatively uncommon term used to describe someone who rules jointly with another person, typically either as a joint monarch or as a regent. The term is most often encountered in historical or political contexts. Understanding the term requires knowledge of the roles of regents and monarchs.","priority":"★★☆"},"example_sentences":[{"sentence":"Queen Isabella and King Ferdinand were coregents of Spain.","translation":"イザベラ女王とフェルナンド王はスペインの共同統治者だった。","type":"noun","meaning_category":"joint ruler"},{"sentence":"The coregent council made important decisions for the kingdom.","translation":"共同摂政評議会は、王国のために重要な決定を下した。","type":"noun","meaning_category":"joint regent"},{"sentence":"The coregent system ensured a smooth transition of power.","translation":"共同統治システムは、権力の円滑な移行を保証した。","type":"adjective","meaning_category":"joint ruling"}]}