{"word":"Encephalomyocarditis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脳脊髄心筋炎","english_definition":"An inflammation of the brain, spinal cord, and heart muscle.","examples":[{"sentence":"Encephalomyocarditis virus (EMCV) can cause severe disease in pigs.","translation":"脳脊髄心筋炎ウイルス（EMCV）は豚に重篤な疾患を引き起こす可能性があります。"},{"sentence":"The symptoms of encephalomyocarditis can vary depending on the severity of the infection.","translation":"脳脊髄心筋炎の症状は、感染の重症度によって異なります。"}],"collocations":["encephalomyocarditis virus (EMCV)","viral encephalomyocarditis"],"synonyms":["EMC","encephalomyocarditis virus infection"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'encephalon' (brain), 'myo' (muscle), 'cardium' (heart), and '-itis' (inflammation).","priority":"★★★"},"pronunciation":{"ipa":"/ɛnˌsɛfəloʊˌmaɪoʊˌkɑːrˈdaɪtɪs/","syllables":"en-ceph-a-lo-my-o-car-di-tis"},"inflection":{"noun_plural":"encephalomyocarditides (rare)"},"usage_notes":{"explanation":"Encephalomyocarditis is a relatively rare disease that affects the brain, spinal cord, and heart. It is usually caused by a virus, such as the encephalomyocarditis virus (EMCV). The disease can affect a wide range of animals, including pigs, rodents, and primates, and in rare cases, humans.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Encephalomyocarditis is a disease of the brain only.","correct":"✓ Encephalomyocarditis is a disease affecting the brain, spinal cord, and heart.","note":"Encephalomyocarditis affects not only the brain but also the spinal cord and heart."}],"priority":"★★☆"},"related_words":{"derivatives":["encephalomyocarditic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Encephalomyocarditis is a complex medical term referring to the inflammation of the brain, spinal cord, and heart muscle. Due to its highly specialized nature, it is rarely encountered outside of medical or veterinary contexts. Understanding requires a strong background in medical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"Outbreaks of encephalomyocarditis have been reported in pig farms, leading to significant economic losses.","translation":"脳脊髄心筋炎の発生は養豚場で報告されており、重大な経済的損失につながっています。","type":"general","meaning_category":"disease in animals"},{"sentence":"Diagnosis of encephalomyocarditis requires careful examination and laboratory testing.","translation":"脳脊髄心筋炎の診断には、注意深い検査と臨床検査が必要です。","type":"medical","meaning_category":"diagnosis"},{"sentence":"Research is ongoing to develop effective treatments for encephalomyocarditis virus infections.","translation":"脳脊髄心筋炎ウイルス感染症の有効な治療法を開発するための研究が進行中です。","type":"research","meaning_category":"treatment"}]}