{"word":"passionflower","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"トケイソウ（時計草）","english_definition":"A climbing plant with distinctive flowers, typically having a corona of filaments resembling a crown of thorns, and often bearing edible fruit.","examples":[{"sentence":"The passionflower climbed the trellis, its intricate blooms a vibrant purple.","translation":"トケイソウは格子垣をよじ登り、その複雑な花は鮮やかな紫色だった。"},{"sentence":"Passionflower extract is sometimes used in herbal remedies for anxiety.","translation":"トケイソウのエキスは、不安に対するハーブ療法で時々使用される。"}],"collocations":["passionflower vine","passionflower extract","purple passionflower","edible passionflower","grow passionflower"],"synonyms":["Passiflora"],"antonyms":[]},{"part_of_speech":"noun","definition":"トケイソウ属の植物","english_definition":"Any plant of the genus Passiflora.","examples":[{"sentence":"Many species of passionflower are native to South America.","translation":"トケイソウ属の多くの種は南米原産である。"}],"collocations":[],"synonyms":["Passiflora"],"antonyms":[]}],"etymology":{"value":"The name 'passionflower' originates from the symbolic interpretation of the flower's parts by early Christian missionaries in South America, who saw in them symbols of the Passion of Christ. The ten petals and sepals represented the ten faithful apostles (excluding Judas and Peter), the corona symbolized the crown of thorns, the five anthers represented the five wounds, and the three stigmas represented the three nails.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpæʃənˌflaʊər/","syllables":"pas-sion-flow-er"},"inflection":{"noun_plural":"passionflowers"},"usage_notes":{"explanation":"The term 'passionflower' refers to plants in the genus *Passiflora*. They are known for their unique and intricate flower structure. Some species produce edible fruit, such as the passionfruit. The flowers are often associated with religious symbolism due to their historical interpretation by Christian missionaries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted a passion flower in my garden.","correct":"✓ I planted a passionflower in my garden.","note":"The correct spelling is 'passionflower' (one word)."},{"incorrect":"✗ Passionflowers are very easy to grow in cold climates.","correct":"✓ Passionflowers are relatively easy to grow in warm climates.","note":"Passionflowers generally prefer warmer climates and may require special care in colder regions."}],"priority":"★☆☆"},"related_words":{"derivatives":["passionfruit (名詞: パッションフルーツ)"],"phrasal_verbs":[],"related_plants":["Maypop (Passiflora incarnata)","Bluecrown passionflower (Passiflora caerulea)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'passionflower' refers to a specific genus of flowering plants, *Passiflora*, known for their distinctive and complex floral structures. Understanding the term requires familiarity with botanical nomenclature and some knowledge of plant classification. The historical and religious significance of the name adds another layer of complexity. While the plant itself may be familiar to some, the specific term is more commonly encountered in gardening, botany, or herbalism contexts."},"example_sentences":[{"sentence":"The intricate design of the **passionflower** is truly captivating.","translation":"トケイソウの複雑なデザインは本当に魅力的だ。","type":"noun","meaning_category":"トケイソウ"},{"sentence":"She brewed a calming tea using dried **passionflower** leaves.","translation":"彼女は乾燥させたトケイソウの葉を使って心を落ち着かせるお茶を淹れた。","type":"noun","meaning_category":"トケイソウ"}]}