{"word":"volumometry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"容量分析、滴定法","english_definition":"quantitative chemical analysis by volume (as by titration)","examples":[{"sentence":"Volumometry is a fundamental technique in analytical chemistry.","translation":"容量分析は分析化学における基礎的な技術です。"},{"sentence":"The experiment involved volumometry to determine the concentration of the acid.","translation":"その実験では、酸の濃度を決定するために容量分析が用いられました。"}],"collocations":["acid-base volumometry","redox volumometry","complexometric volumometry"],"synonyms":["titrimetry","titration"],"antonyms":[]}],"etymology":{"value":"'Volume' + '-metry' (measurement)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɒljuˈmɒmətri/","syllables":"vo-lu-mom-e-try"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Volumometry, also known as titrimetry or titration, is a quantitative analytical technique used to determine the concentration of a substance by measuring the volume of a solution of known concentration (the titrant) that reacts completely with the substance being analyzed (the analyte). The reaction between the titrant and analyte must be stoichiometric and proceed to completion. A common example is acid-base titration.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["volumetric","volumetrically"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Volumometry is a technical term used in chemistry. It refers to a method of quantitative chemical analysis where the amount of a substance is measured by determining the volume of a solution needed to react with it. This is a more advanced concept typically encountered in higher-level chemistry courses or professional settings.","priority":"★★☆"},"example_sentences":[{"sentence":"The lab technician used volumometry to accurately measure the amount of chloride in the water sample.","translation":"実験技師は容量分析を用いて、水サンプル中の塩化物量を正確に測定しました。","type":"general","meaning_category":"quantitative chemical analysis"},{"sentence":"Volumometry is often used in quality control to ensure the consistency of chemical products.","translation":"容量分析は、化学製品の一貫性を保証するために、品質管理でよく使用されます。","type":"general","meaning_category":"quantitative chemical analysis"}]}