{"word":"Ultra-English","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"Extremely or excessively English in character, manner, or style.","english_definition":"Exceedingly or exaggeratedly English in qualities or characteristics.","examples":[{"sentence":"His ultra-English accent was almost comical.","translation":"彼の過剰なほどイギリス英語の発音はほとんど滑稽だった。"},{"sentence":"The restaurant's decor was ultra-English, complete with portraits of the royal family.","translation":"そのレストランの装飾は、王室の肖像画が飾られているなど、極めてイギリス風だった。"}],"collocations":["ultra-English accent","ultra-English style","ultra-English traditions"],"synonyms":["hyper-English","excessively English","quintessentially English"],"antonyms":["un-English","non-English"]}],"etymology":{"value":"Formed by combining \"ultra-\" (meaning beyond or excessive) with \"English\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌltrə ˈɪŋɡlɪʃ/","syllables":"ul-tra-Eng-lish"},"inflection":{"notes":"As an adjective, it can be used to modify nouns."},"usage_notes":{"explanation":"\"Ultra-English\" is typically used to describe something that is perceived as an extreme or exaggerated version of Englishness. It can sometimes carry a slightly humorous or critical connotation, suggesting that the subject is overly concerned with English traditions or stereotypes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a ultra-english man.","correct":"✓ He is an ultra-English man.","note":"Remember to use \"an\" before \"ultra-English\" because it begins with a vowel sound."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_adjectives":["English","British"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Ultra-English\" is a relatively uncommon term used to describe something that is extremely or excessively English. It implies a level of Englishness that goes beyond the norm, often in a way that is noticeable or even exaggerated. This term is more likely to be encountered in advanced English texts or conversations."},"example_sentences":[{"sentence":"The hotel prided itself on its ultra-English afternoon tea service.","translation":"そのホテルは、極めてイギリス的なアフタヌーンティーサービスを誇っていた。","type":"adjective","meaning_category":"Extremely English"},{"sentence":"Some found his ultra-English manners charming, while others found them pretentious.","translation":"彼の過剰なほどイギリス的なマナーを魅力的だと感じる人もいれば、気取っていると感じる人もいた。","type":"adjective","meaning_category":"Excessively English"}]}