{"word":"politicized","priority":"★★☆","meanings":[{"part_of_speech":"verb (past participle)","definition":"政治問題化した、政治的に色付けされた、政治利用された","english_definition":"having been made political; having been given a political character or overtone; having been exploited for political purposes.","examples":[{"sentence":"The issue has become highly politicized.","translation":"その問題は非常に政治問題化している。"},{"sentence":"The debate was politicized by both sides.","translation":"その議論は両陣営によって政治利用された。"},{"sentence":"The museum tried to avoid displaying anything that could be seen as politicized.","translation":"その美術館は、政治的に色付けされていると見なされる可能性のあるものは何も展示しないように努めた。"}],"collocations":["highly politicized (非常に政治問題化された)","overly politicized (過度に政治問題化された)","increasingly politicized (ますます政治問題化された)","politicized issue (政治問題化された問題)","politicized debate (政治問題化された議論)","politicized environment (政治問題化された環境)"],"synonyms":["politicised (British spelling)","politic","political","partisan","ideological"],"antonyms":["apolitical","nonpolitical","neutral","impartial","objective"]},{"part_of_speech":"adjective","definition":"政治化された、政治的な色合いが強い","english_definition":"having a political character or overtone; influenced by political considerations.","examples":[{"sentence":"The politicized atmosphere made it difficult to have a rational discussion.","translation":"政治化された雰囲気のせいで、理性的な議論をすることが難しかった。"},{"sentence":"The politicized media often presents biased information.","translation":"政治的な色合いの強いメディアは、偏った情報を提示することが多い。"},{"sentence":"The politicized curriculum sparked controversy among parents.","translation":"政治化されたカリキュラムは、親たちの間で論争を引き起こした。"}],"collocations":["politicized atmosphere (政治化された雰囲気)","politicized media (政治化されたメディア)","politicized curriculum (政治化されたカリキュラム)","politicized society (政治化された社会)","politicized institutions (政治化された機関)"],"synonyms":["political","partisan","ideological","biased","tendentious"],"antonyms":["apolitical","nonpolitical","unbiased","objective","neutral"]}],"etymology":{"value":"The word \"politicized\" comes from the verb \"politicize,\" which is formed from \"politic\" (meaning political) and the suffix \"-ize\" (meaning to make or become). The root \"politic\" comes from the Greek word \"politikos,\" meaning \"relating to citizens or the state.\" Thus, \"politicize\" means to make something political or to give it a political character.","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈlɪtɪsaɪzd/","syllables":"po-lit-i-cized"},"inflection":{"notes":"Since 'politicized' can function as both a past participle and an adjective, it does not have typical inflectional forms. As a past participle, it is the past form of the verb 'politicize.' As an adjective, it describes a noun."},"usage_notes":{"explanation":"'Politicized' describes something that has been made political, often implying that it was not inherently political before. It can suggest that an issue, topic, or environment has been influenced by political considerations, often to the point of being biased or controversial. The term can be used neutrally, but it often carries a negative connotation, suggesting that something has been inappropriately or excessively influenced by politics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The politicized is a problem.","correct":"✓ Politicization is a problem.","note":"'Politicized' is an adjective or past participle, not a noun. To refer to the process of making something political, use the noun 'politicization.'"},{"incorrect":"✗ He politicized the situation, but it was necessary.","correct":"✓ He made the situation political, but it was necessary.","note":"While 'politicize' is a valid verb, sometimes using a more straightforward phrase like 'made the situation political' can be clearer, especially if you want to avoid any negative connotations."},{"incorrect":"✗ The politicized people were angry.","correct":"✓ The political people were angry.","note":"'Politicized' describes something that has been made political. To describe people who are involved in politics or have strong political views, use 'political' or 'politically active.'"}],"priority":"★★☆"},"related_words":{"derivatives":["politicize (verb: to make political)","politicization (noun: the process of making something political)","political (adjective: relating to politics)","politically (adverb: in a political way)","politics (noun: activities aimed at achieving or using power in a country or society)","politician (noun: a person professionally involved in politics)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in political and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Politicized' is a term used to describe something that has become political, often in a way that is considered controversial or divisive. It suggests that an issue or topic has been influenced by political considerations, sometimes to an excessive degree. The word is often used in discussions about current events, social issues, and media bias. Understanding this term is important for comprehending complex political discussions and analyses. It implies that something that might not have been inherently political has been given a political character or used for political purposes."},"example_sentences":[{"sentence":"The pandemic response became highly **politicized**, with different groups advocating for conflicting approaches.","translation":"パンデミックへの対応は非常に政治問題化し、異なるグループが相反するアプローチを提唱した。","type":"adjective","meaning_category":"政治問題化した"},{"sentence":"The media was accused of presenting a **politicized** view of the events.","translation":"メディアは、出来事の政治的な見方を提示していると非難された。","type":"adjective","meaning_category":"政治的な色合いが強い"},{"sentence":"The curriculum was **politicized** to promote a specific ideology.","translation":"特定のイデオロギーを推進するために、カリキュラムは政治利用された。","type":"verb (past participle)","meaning_category":"政治利用された"},{"sentence":"The debate became **politicized** when personal attacks were introduced.","translation":"個人的な攻撃が導入されたとき、議論は政治問題化した。","type":"verb (past participle)","meaning_category":"政治問題化した"},{"sentence":"The environmental issue has become increasingly **politicized** in recent years.","translation":"環境問題は近年ますます政治問題化している。","type":"adjective","meaning_category":"政治問題化した"}]}