{"word":"Uncanonicity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"正統的でないこと、規範から外れていること","english_definition":"The state or quality of not being canonical; deviation from accepted or established norms or standards.","examples":[{"sentence":"The uncanonicity of the text made it difficult to include in the official collection.","translation":"そのテキストが正統的でないため、公式コレクションに含めるのが困難になった。"},{"sentence":"The artist embraced uncanonicity in his work, challenging traditional artistic conventions.","translation":"そのアーティストは作品において規範からの逸脱を受け入れ、伝統的な芸術的慣習に挑戦した。"}],"collocations":["textual uncanonicity","artistic uncanonicity","historical uncanonicity"],"synonyms":["nonconformity","heterodoxy","irregularity","aberration","deviation"],"antonyms":["canonicity","orthodoxy","conformity","regularity"]}],"etymology":{"value":"Formed from 'un-' (prefix meaning 'not'), 'canonical' (relating to a canon or body of rules), and '-ity' (suffix denoting a state or quality).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnkænəˈnɪsɪti/","syllables":"Un-ca-non-i-ci-ty"},"inflection":{"noun_plural":"Uncanonicities"},"usage_notes":{"explanation":"'Uncanonicity' refers to the condition of something not conforming to established rules, principles, or norms, especially within a specific field or discipline. It often implies a departure from what is considered authoritative or standard.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The uncanonicity was obvious.","correct":"✓ The uncanonicity of the document was obvious.","note":"It's better to specify what possesses the quality of uncanonicity. Using 'the uncanonicity of the document' is more precise."}],"priority":"★☆☆"},"related_words":{"derivatives":["uncanonical (adjective)"],"related_terms":["canon","canonical","canonize"]},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency"},"readability_explanation":{"level":"C2","text":"The word 'uncanonicity' is a highly specialized term, primarily used in academic or scholarly contexts. It describes the state of something not conforming to established canons or standards, often in fields like literature, art, or religion. Due to its abstract nature and limited usage, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The scholar argued for the inclusion of works previously dismissed due to their perceived uncanonicity.","translation":"その学者は、以前は正統的でないと見なされて退けられていた作品の包含を主張した。","type":"general","meaning_category":"general"},{"sentence":"The film's uncanonicity, with its unconventional narrative structure, divided critics.","translation":"その映画の規範からの逸脱は、その型破りな物語構造のために、批評家を二分した。","type":"artistic","meaning_category":"artistic"}]}