{"word":"equalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"平等主義","english_definition":"The belief in or advocacy of equality among people.","examples":[{"sentence":"Equalism promotes the idea that all individuals should have equal rights and opportunities.","translation":"平等主義は、すべての個人が平等な権利と機会を持つべきだという考えを推進します。"},{"sentence":"The organization's mission is rooted in the principles of equalism and social justice.","translation":"その組織の使命は、平等主義と社会正義の原則に根ざしています。"}],"collocations":["gender equalism (ジェンダー平等主義)","social equalism (社会平等主義)","economic equalism (経済的平等主義)"],"synonyms":["egalitarianism","equality","impartiality","fairness"],"antonyms":["inequality","discrimination","bias","prejudice"]}],"etymology":{"value":"'Equal' + '-ism'. From the concept of equality.","priority":"★★★"},"pronunciation":{"ipa":"/ˈiːkwəlɪzəm/","syllables":"e-qual-ism"},"inflection":{"noun_plural":"equalisms"},"usage_notes":{"explanation":"Equalism is often used as a general term for any ideology promoting equality. It can sometimes be used to contrast with specific movements like feminism, implying a broader focus on equality for all genders, not just women. However, the term 'egalitarianism' is more commonly used in academic and philosophical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Equalism means everyone is the same.","correct":"Equalism means everyone has equal rights and opportunities, not that everyone is the same.","note":"Equalism emphasizes equal opportunities and rights, not necessarily identical outcomes or characteristics."}],"priority":"★★★"},"related_words":{"derivatives":["equalist (noun)","equalistic (adjective)"],"related_terms":["egalitarianism","feminism","humanism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Equalism refers to the belief that all people should have equal rights and opportunities. It's a general term for advocating equality, and it's related to ideas like fairness and social justice. It's important to understand that equalism doesn't mean everyone is the same, but rather that everyone deserves the same chances and respect."},"example_sentences":[{"sentence":"The politician advocated for equalism in the workplace.","translation":"その政治家は職場での平等主義を提唱しました。","type":"noun","meaning_category":"Advocacy of equality"},{"sentence":"Critics argue that true equalism is difficult to achieve in practice.","translation":"批評家たちは、真の平等主義は実際には達成困難であると主張しています。","type":"noun","meaning_category":"Belief in equality"},{"sentence":"The company implemented policies to promote equalism among its employees.","translation":"その会社は従業員間の平等主義を促進するための政策を実施しました。","type":"noun","meaning_category":"Promotion of equality"}]}