{"word":"sodalithite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ソーダライト","english_definition":"A tectosilicate mineral with the formula Na₄Al₃Si₃O₁₂Cl, a member of the sodalite group.","examples":[{"sentence":"Sodalithite is often used as an ornamental stone.","translation":"ソーダライトは装飾石としてよく使われます。"},{"sentence":"The deep blue color of sodalithite makes it popular in jewelry.","translation":"ソーダライトの濃い青色は、ジュエリーとして人気があります。"}],"collocations":["sodalithite gemstone","blue sodalithite","sodalithite jewelry"],"synonyms":["lapis lazuli (sometimes confused with)"],"antonyms":[]}],"etymology":{"value":"From 'soda' (referring to its sodium content) + 'lithos' (Greek for stone) + '-ite' (a suffix used for minerals).","priority":"★★☆"},"pronunciation":{"ipa":"/soʊˈdælɪˌθaɪt/","syllables":"so-dal-i-thite"},"inflection":{"noun_plural":"sodalithites"},"usage_notes":{"explanation":"Sodalithite is a relatively rare mineral known for its rich blue color, though it can also be found in other colors like grey, yellow, green, or pink. It is often confused with lapis lazuli, but sodalithite contains white veins of calcite, while lapis lazuli contains pyrite (gold flecks). It's primarily used in ornamental objects and jewelry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Sodalithite is a type of lapis.","correct":"✓ Sodalithite is similar to lapis but has different mineral inclusions.","note":"Sodalithite and lapis lazuli are often confused, but they are distinct minerals. Sodalithite typically has white calcite veins, while lapis lazuli contains pyrite."}],"priority":"★☆☆"},"related_words":{"derivatives":["sodalite (the sodalite group of minerals)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sodalithite' is a specialized term referring to a specific mineral. Understanding and using this term requires a scientific or geological background. It is not part of everyday vocabulary. The term is most likely to be encountered in contexts related to mineralogy, geology, or gemology."},"example_sentences":[{"sentence":"The museum displayed a large specimen of sodalithite from Brazil.","translation":"博物館にはブラジル産の大きなソーダライトの標本が展示されていました。","type":"noun","meaning_category":"mineral"},{"sentence":"Sodalithite is often used in carvings and decorative objects.","translation":"ソーダライトは彫刻や装飾品によく使用されます。","type":"noun","meaning_category":"mineral"}]}