{"word":"ravingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"熱狂的に、夢中で、狂ったように","english_definition":"in an extremely enthusiastic or wild manner; in a way that suggests madness or delirium.","examples":[{"sentence":"The critics ravingly praised the film.","translation":"批評家たちはその映画を熱狂的に褒め称えた。"},{"sentence":"She was ravingly jealous of her sister's success.","translation":"彼女は妹の成功に狂ったように嫉妬していた。"},{"sentence":"He spoke ravingly about his conspiracy theories.","translation":"彼は陰謀論について狂ったように語った。"}],"collocations":["ravingly enthusiastic","ravingly jealous","ravingly mad","praise ravingly","speak ravingly"],"synonyms":["enthusiastically","wildly","fanatically","deliriously","madly","fervently","passionately"],"antonyms":["apathetically","indifferently","calmly","moderately"]}],"etymology":{"value":"The word \"ravingly\" is derived from the verb \"rave,\" which comes from Middle English \"raven,\" meaning to be mad or furious. The suffix \"-ingly\" transforms the verb into an adverb, indicating the manner in which something is done.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈreɪvɪŋli/","syllables":"ra-ving-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Ravingly\" is used to describe actions or feelings that are expressed with extreme enthusiasm or in a way that suggests madness or delirium. It often implies a loss of control or a heightened emotional state. It is a relatively uncommon word and is typically used for emphasis or to create a vivid image.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was ravingly calm.","correct":"✓ He was calmly explaining the situation.","note":"\"Ravingly\" implies excitement or madness, so it cannot be used with words that describe calmness or moderation."},{"incorrect":"✗ She ravingly liked the ice cream.","correct":"✓ She really liked the ice cream. / ✓ She raved about the ice cream.","note":"\"Ravingly\" is usually used with verbs that describe speaking, praising, or feeling intense emotions, not with simple verbs like \"like.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["rave (verb, noun)","raving (adjective)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"ravingly\" is an adverb used to describe something done in an extremely enthusiastic or wild manner, often suggesting a loss of control or a state of madness. It is not a common word and is typically used in more advanced or literary contexts to add emphasis or create a vivid image. It is derived from the verb \"rave,\" meaning to speak wildly or enthusiastically, and the suffix \"-ingly,\" which turns it into an adverb. Understanding the root word \"rave\" can help in grasping the meaning of \"ravingly.\""},"example_sentences":[{"sentence":"The audience clapped ravingly after the performance.","translation":"観客は公演後、熱狂的に拍手喝采した。","type":"adverb","meaning_category":"enthusiastically"},{"sentence":"The artist spoke ravingly about his inspiration.","translation":"その芸術家は自身のインスピレーションについて夢中で語った。","type":"adverb","meaning_category":"wildly"},{"sentence":"The fans were ravingly excited to see their favorite band.","translation":"ファンたちは大好きなバンドに会えることに狂ったように興奮していた。","type":"adverb","meaning_category":"deliriously"}]}