{"word":"unpensioned","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"年金を受け取っていない、年金生活を送っていない","english_definition":"Not receiving a pension; not provided with a pension.","examples":[{"sentence":"The unpensioned workers struggled to make ends meet after retirement.","translation":"年金を受け取っていない労働者たちは、退職後に生活費を工面するのに苦労した。"},{"sentence":"Many unpensioned elderly individuals rely on social security benefits.","translation":"多くの年金を受け取っていない高齢者は、社会保障給付金に頼っている。"}],"collocations":["unpensioned workers","unpensioned elderly","remain unpensioned"],"synonyms":["non-pensioned","without pension","not retired on a pension"],"antonyms":["pensioned","retired on a pension"]},{"part_of_speech":"adjective","definition":"年金を支給されていない、年金制度がない","english_definition":"Not having a pension scheme or system.","examples":[{"sentence":"The company's unpensioned employees were concerned about their future financial security.","translation":"その会社の年金制度がない従業員たちは、将来の経済的な安定について懸念していた。"},{"sentence":"The unpensioned sector of the workforce faces significant challenges in retirement planning.","translation":"労働人口の年金制度がない部門は、退職後の計画において重大な課題に直面している。"}],"collocations":["unpensioned sector","unpensioned employees","unpensioned workforce"],"synonyms":["without a pension scheme","lacking pension benefits","non-contributory pension"],"antonyms":["pensioned","with a pension scheme"]}],"etymology":{"value":"The word \"unpensioned\" is formed by adding the prefix \"un-\" (meaning 'not') to the word \"pensioned.\" \"Pensioned\" itself comes from \"pension,\" which originates from the Latin word \"pensio,\" meaning 'payment.'","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈpɛnʃənd/","syllables":"un-pen-shoned"},"inflection":{"notes":"Since 'unpensioned' is an adjective, its inflection is limited. It does not have plural forms. Comparative and superlative forms (more unpensioned, most unpensioned) are grammatically correct but rarely used."},"usage_notes":{"explanation":"'Unpensioned' is used to describe individuals or situations where a pension is not provided or received. It highlights the absence of pension benefits, often emphasizing the financial challenges faced by those without such support. The term can refer to both the lack of a personal pension and the absence of a pension scheme within an organization or sector.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is unpension.","correct":"✓ He is unpensioned.","note":"'Unpension' is not a standard word. The correct form is 'unpensioned,' which functions as an adjective."},{"incorrect":"✗ The unpensioned workers are very worried for their retire.","correct":"✓ The unpensioned workers are very worried about their retirement.","note":"The correct preposition to use with 'worried' in this context is 'about,' and 'retire' should be 'retirement' (noun)."}],"priority":"★★☆"},"related_words":{"derivatives":["pension (noun, verb)","pensioner (noun)","pensionable (adjective)"],"antonyms":["pensioned (adjective)"],"synonyms":["non-pensioned (adjective)"]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unpensioned' is a relatively uncommon term that describes the state of not receiving or being covered by a pension. It is often used in discussions about retirement, financial security, and social welfare. Understanding this word requires a grasp of the prefix 'un-' (meaning 'not') and the base word 'pension.' It is typically encountered in more formal or specialized contexts, such as financial or policy discussions."},"example_sentences":[{"sentence":"The government is addressing the needs of the unpensioned population.","translation":"政府は年金を受け取っていない人々のニーズに取り組んでいる。","type":"adjective","meaning_category":"Not receiving a pension"},{"sentence":"The company's decision to eliminate pensions left many employees unpensioned.","translation":"会社が年金制度を廃止したことで、多くの従業員が年金を受け取れなくなった。","type":"adjective","meaning_category":"Not provided with a pension scheme"}]}