{"word":"aquacade","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"水上ショー、水中レビュー","english_definition":"A spectacular aquatic show featuring swimming, diving, and synchronized swimming, often with music and elaborate staging.","examples":[{"sentence":"The aquacade at the World's Fair was a major attraction.","translation":"万博でのアクアケードは大きな呼び物だった。"},{"sentence":"Many famous swimmers and divers performed in aquacades during the mid-20th century.","translation":"20世紀半ばには、多く著名な水泳選手や飛び込み選手がアクアケードに出演した。"}],"collocations":["put on an aquacade","aquacade performance","aquacade star"],"synonyms":["water show","aquatic spectacle","synchronized swimming show"],"antonyms":[]}],"etymology":{"value":"A blend of 'aqua' (Latin for water) and 'cade' (from 'cavalcade', a procession or display). The term combines the aquatic element with the idea of a grand, impressive display.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈækwəˌkeɪd/","syllables":"a-qua-cade"},"inflection":{"noun_plural":"aquacades"},"usage_notes":{"explanation":"The term 'aquacade' is primarily used to describe large-scale, theatrical water shows that were particularly popular in the mid-20th century. These shows often involved elaborate sets, costumes, and lighting, and featured synchronized swimming, diving, and other aquatic performances. While such shows still exist, the term 'aquacade' itself is less commonly used today.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an aquacade in the river.","correct":"✓ I saw an aquacade at the theater.","note":"Aquacades are typically performed in a specially designed pool or stage, not in natural bodies of water like rivers."}],"priority":"★☆☆"},"related_words":{"derivatives":["aquatic","aqua","cavalcade"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - The term is relatively rare in modern usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Aquacade' refers to a specific type of water show that was popular in the past. It involves synchronized swimming, diving, and other aquatic performances, often with elaborate staging and music. The word itself is not commonly used in everyday conversation, but you might encounter it when discussing historical entertainment or aquatic sports.","priority":"★★☆"},"example_sentences":[{"sentence":"The historic Jones Beach Marine Theater was famous for its spectacular aquacades.","translation":"歴史的なジョーンズビーチ海洋劇場は、壮大なアクアケードで有名だった。","type":"noun","meaning_category":"water show"},{"sentence":"Esther Williams was a renowned performer in many Hollywood aquacades.","translation":"エスター・ウィリアムズは、ハリウッドの多くのアクアケードで有名なパフォーマーだった。","type":"noun","meaning_category":"water show"}]}