{"word":"chigoe","priority":"low","meanings":[{"part_of_speech":"noun","definition":"(熱帯アメリカ・アフリカ産の) スナノミ","english_definition":"a tropical American and African flea (Tunga penetrans) whose fertilized female burrows under the skin, especially of the feet, and causes painful and irritating sores.","examples":[{"sentence":"The chigoe flea is a common parasite in many tropical regions.","translation":"スナノミは多くの熱帯地域で一般的な寄生虫です。"},{"sentence":"He contracted a chigoe infestation after walking barefoot on the beach.","translation":"彼はビーチを裸足で歩いた後、スナノミ症に感染しました。"}],"collocations":["chigoe flea","chigoe infestation","remove a chigoe"],"synonyms":["jigger (often used interchangeably)","sand flea"],"antonyms":[]}],"etymology":{"value":"Derived from a Cariban language. The exact origin is uncertain, but it is believed to have originated in the Caribbean region.","priority":"medium"},"pronunciation":{"ipa":"/ˈtʃɪɡoʊ/","syllables":"chi-goe"},"inflection":{"noun_plural":"chigoes"},"usage_notes":{"explanation":"The term \"chigoe\" refers specifically to the Tunga penetrans flea. It is important to note the parasitic nature of the female flea, which burrows into the skin. The term \"jigger\" is sometimes used interchangeably, but can also refer to other types of fleas.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"I was bitten by a chigger.","correct":"I was bitten by a chigoe.","note":"\"Chigger\" refers to a type of mite larva, while \"chigoe\" refers to the Tunga penetrans flea."}],"priority":"medium"},"related_words":{"derivatives":["tungiasis (the disease caused by chigoe infestation)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Not applicable","frequency_google_ngram":"Very low frequency","priority":"low"},"readability_explanation":{"level":"C2","text":"The word \"chigoe\" is a specialized term referring to a specific type of flea found in tropical regions. Understanding its meaning requires knowledge of tropical diseases and parasites. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The doctor diagnosed the patient with a chigoe infection.","translation":"医師は患者をスナノミ感染症と診断しました。","type":"noun","meaning_category":"parasite"},{"sentence":"Proper footwear can prevent chigoe infestations in endemic areas.","translation":"適切な履物は、流行地域でのスナノミ症感染を防ぐことができます。","type":"noun","meaning_category":"parasite"}]}