{"word":"Erotopathic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(精神医学) 色情病の、恋愛妄想の","english_definition":"Relating to or characterized by erotomania; having a delusional belief that another person, usually of higher status, is in love with oneself.","examples":[{"sentence":"She developed an erotopathic fixation on a celebrity.","translation":"彼女は有名人に対して色情的な執着を発達させた。"},{"sentence":"His erotopathic delusions led him to believe the actress was sending him secret messages.","translation":"彼の恋愛妄想は、女優が彼に秘密のメッセージを送っていると信じ込ませた。"}],"collocations":["erotopathic delusion","erotopathic patient","erotopathic love","erotopathic disorder","erotopathic fixation"],"synonyms":["erotomanic","delusional","obsessive"],"antonyms":["rational","sane","balanced"]}],"etymology":{"value":"From 'erotomania' (色情病) + '-pathic' (病的な性質を持つことを示す接尾辞). 'Erotomania' comes from Greek 'eros' (愛) + 'mania' (熱狂、狂気).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌroʊtəˈpæθɪk/","syllables":"e-ro-to-path-ic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Erotopathic' is a term primarily used in psychiatry and psychology to describe a condition where an individual has a delusional belief that another person, often someone famous or of higher social status, is in love with them. This belief persists even in the face of contradictory evidence. The term is closely associated with erotomania.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is erotopathic because he likes romance movies.","correct":"✓ He is erotopathic because he delusionally believes a movie star is in love with him.","note":"'Erotopathic' refers to a specific delusional belief, not simply an interest in romance. It involves a fixed, false belief that someone is in love with the person. "},{"incorrect":"✗ She is erotopathic and therefore dangerous.","correct":"✓ She has erotopathic delusions, which can sometimes lead to stalking or harassment.","note":"While erotopathic delusions can sometimes lead to problematic behaviors like stalking, not all individuals with erotomania are dangerous. It's important to avoid stigmatizing individuals with mental health conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["erotomania (名詞: 色情病、恋愛妄想)","erotomanic (形容詞: 色情病の、恋愛妄想の; 名詞: 色情病患者)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in academic or clinical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Erotopathic' is a specialized term used in the fields of psychiatry and psychology. It describes a condition characterized by erotomania, a delusional belief that another person, often someone of higher status or fame, is in love with the individual. Understanding this term requires familiarity with clinical vocabulary and concepts related to mental health. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The psychiatrist diagnosed the patient with an erotopathic disorder.","translation":"精神科医はその患者を色情病と診断した。","type":"clinical","meaning_category":"psychiatry"},{"sentence":"Erotopathic delusions can be difficult to treat due to the patient's strong conviction in their beliefs.","translation":"色情病の妄想は、患者が自分の信念を強く信じているため、治療が難しいことがある。","type":"clinical","meaning_category":"psychology"}]}