{"word":"Rolandic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(解剖学) ローランド溝（中心溝）に関連する、またはローランド溝の近くにある","english_definition":"(anatomy) Relating to or situated near the fissure of Rolando (central sulcus).","examples":[{"sentence":"The Rolandic cortex is involved in motor control.","translation":"ローランド皮質は運動制御に関与している。"},{"sentence":"A lesion in the Rolandic area can cause motor deficits.","translation":"ローランド領域の病変は運動機能障害を引き起こす可能性がある。"}],"collocations":["Rolandic cortex","Rolandic fissure","Rolandic area","Rolandic epilepsy"],"synonyms":["central","motor"],"antonyms":[]}],"etymology":{"value":"Named after Luigi Rolando (1773–1831), an Italian anatomist who first described the central sulcus of the brain.","priority":"★★★"},"pronunciation":{"ipa":"/roʊˈlændɪk/","syllables":"Ro-lan-dic"},"inflection":{"notes":"Adjective; no comparative or superlative forms."},"usage_notes":{"explanation":"'Rolandic' is a highly specialized term used primarily in the fields of anatomy, neurology, and medicine. It refers specifically to the area of the brain surrounding the central sulcus, also known as the fissure of Rolando. This area is crucial for motor function. Therefore, the term is most often encountered in discussions of brain anatomy, motor control, or neurological disorders affecting this region.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Rolando area is important for memory.","correct":"✓ The Rolandic area is important for motor control.","note":"The Rolandic area is associated with motor function, not memory."}],"priority":"☆☆☆"},"related_words":{"derivatives":["Rolando (noun)","fissure of Rolando (noun)","central sulcus (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Very low frequency - Primarily found in scientific and medical literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Rolandic' is a technical term used in anatomy and neurology. It refers to the area of the brain around the central sulcus (fissure of Rolando), which is important for motor control. You'll mostly find this word in scientific articles or medical contexts when discussing the brain and its functions. It is not a word used in everyday conversation."},"example_sentences":[{"sentence":"The **Rolandic** region is critical for voluntary movement.","translation":"ローランド領域は随意運動に不可欠である。","type":"adjective","meaning_category":"Anatomy"},{"sentence":"**Rolandic** epilepsy is a benign form of childhood epilepsy.","translation":"ローランドてんかんは、小児期の良性てんかんの一種である。","type":"adjective","meaning_category":"Medicine"}]}