{"word":"queasily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"吐き気を催すように、むかむかして、不安そうに","english_definition":"In a way that causes or suggests nausea; in a manner that is uneasy or apprehensive.","examples":[{"sentence":"He felt queasily unwell after the roller coaster.","translation":"彼はジェットコースターの後、むかむかして気分が悪かった。"},{"sentence":"She smiled queasily, unsure of what to say.","translation":"彼女は何を言うべきか分からず、不安そうに微笑んだ。"},{"sentence":"The boat rocked queasily on the rough sea.","translation":"ボートは荒れた海で吐き気を催すように揺れた。"}],"collocations":["feel queasily","smile queasily","rock queasily"],"synonyms":["nauseously","uneasily","apprehensively","uncomfortably","sickly"],"antonyms":["comfortably","steadily","calmly"]}],"etymology":{"value":"Derived from the adjective 'queasy', with the addition of the suffix '-ly' to form an adverb. 'Queasy' itself comes from an uncertain origin, possibly related to 'qualm'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkwiːzɪli/","syllables":"quee-zi-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Queasily' is used to describe actions or feelings that are characterized by nausea or a sense of unease. It often implies a physical sensation of sickness or a mental state of apprehension. The word is relatively uncommon but useful for conveying specific feelings of discomfort.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He queasily ate the food.","correct":"✓ He ate the food queasily.","note":"The adverb 'queasily' should typically modify the verb in a way that describes the manner of the action, not directly describe the object of the verb. In this case, it's better to say 'He ate the food queasily' to indicate he ate it with a feeling of nausea."},{"incorrect":"✗ She felt queasily about the situation.","correct":"✓ She felt queasy about the situation.","note":"'Queasily' is an adverb and modifies verbs, adverbs, or adjectives. 'Queasy' is the adjective that describes a state of feeling nauseous or uneasy. Therefore, 'She felt queasy' is correct."}],"priority":"★★☆"},"related_words":{"derivatives":["queasy (adjective: nauseous, uneasy)","queasiness (noun: nausea, uneasiness)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not commonly found in CEFR levels)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Queasily' is an adverb that describes something done in a way that suggests nausea or unease. It's not a common word, so it's more likely to be found in advanced texts. It implies a sense of physical discomfort or mental apprehension. For example, someone might smile 'queasily' if they are unsure about a situation, or a boat might rock 'queasily' on rough seas, suggesting a nauseating motion."},"example_sentences":[{"sentence":"The smell made him feel queasily sick.","translation":"その匂いで彼は吐き気を催すように気分が悪くなった。","type":"adverb","meaning_category":"nauseously"},{"sentence":"She agreed queasily, sensing something was wrong.","translation":"彼女は何かおかしいと感じながら、不安そうに同意した。","type":"adverb","meaning_category":"uneasily"},{"sentence":"The bridge swayed queasily in the wind.","translation":"橋は風の中で吐き気を催すように揺れた。","type":"adverb","meaning_category":"unsteadily"}]}