{"word":"tetraglot","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"4ヶ国語に通じる人、4ヶ国語で書かれた本","english_definition":"A person who speaks four languages fluently; a book written in four languages.","examples":[{"sentence":"He is a tetraglot, fluent in English, French, Spanish, and German.","translation":"彼は英語、フランス語、スペイン語、ドイツ語に堪能なテトラグロット（4ヶ国語に通じる人）だ。"},{"sentence":"The Rosetta Stone could be considered a partial tetraglot, as it contained inscriptions in three scripts.","translation":"ロゼッタストーンは3つの文字で碑文が含まれていたため、部分的なテトラグロットと見なすことができる。"}],"collocations":["fluent tetraglot","rare tetraglot"],"synonyms":["quadrilingual","four-language speaker"],"antonyms":["monoglot","bilingual","trilingual"]},{"part_of_speech":"adjective","definition":"4ヶ国語で書かれた、4ヶ国語に通じる","english_definition":"Written in four languages; able to speak four languages fluently.","examples":[{"sentence":"The ancient manuscript was a tetraglot text, featuring Greek, Latin, Hebrew, and Aramaic.","translation":"その古代写本は、ギリシャ語、ラテン語、ヘブライ語、アラム語で書かれたテトラグロット（4ヶ国語）のテキストだった。"},{"sentence":"A tetraglot dictionary would be a valuable resource for language learners.","translation":"テトラグロット（4ヶ国語）の辞書は、言語学習者にとって貴重なリソースとなるだろう。"}],"collocations":["tetraglot dictionary","tetraglot text"],"synonyms":["quadrilingual"],"antonyms":["monolingual","bilingual","trilingual"]}],"etymology":{"value":"Derived from the Greek words 'tetra-' meaning 'four' and 'glotta' meaning 'language' or 'tongue'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtɛtrəɡlɒt/","syllables":"te-tra-glot"},"inflection":{"noun_plural":"tetraglots"},"usage_notes":{"explanation":"The term 'tetraglot' is relatively rare compared to 'bilingual' or 'trilingual'. It is used to describe someone with a high level of proficiency in four languages or a document presented in four languages.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a tetraglot in five languages.","correct":"✓ He is a tetraglot, fluent in four languages.","note":"By definition, a tetraglot is fluent in four languages, not more or less."}],"priority":"★★☆"},"related_words":{"derivatives":["tetraglottic (adjective)"],"related_terms":["monoglot","bilingual","trilingual","polyglot"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'tetraglot' is a specialized term used to describe someone who speaks four languages fluently or a text written in four languages. It is not commonly used in everyday conversation but may appear in academic or linguistic contexts. Understanding the prefixes 'tetra-' (four) and 'glot' (language) can help in deciphering the meaning."},"example_sentences":[{"sentence":"The scholar was a renowned tetraglot, capable of translating complex texts from multiple ancient languages.","translation":"その学者は著名なテトラグロットであり、複数の古代言語から複雑なテキストを翻訳することができた。","type":"noun","meaning_category":"person"},{"sentence":"The museum displayed a tetraglot inscription, allowing visitors to compare the text in four different scripts.","translation":"博物館にはテトラグロット碑文が展示されており、訪問者は4つの異なる文字でテキストを比較することができた。","type":"adjective","meaning_category":"text"}]}