{"word":"Metapolitics","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"政治的言説や行動の根底にある文化、価値観、信念、世界観に関する議論や活動。政治的アジェンダや政策を直接的に追求するのではなく、社会の基盤となる考え方や感情に影響を与えることを目的とする。","english_definition":"Discourse or action concerning the underlying cultural, value-based, belief-based, and worldview-related foundations of political discourse and action. It aims to influence the fundamental ideas and emotions of society rather than directly pursuing political agendas or policies.","examples":[{"sentence":"Metapolitics seeks to shape the cultural landscape to make certain political ideas more acceptable.","translation":"メタポリティクスは、特定の政治思想がより受け入れられやすくなるように、文化的な状況を形成しようとします。"},{"sentence":"The rise of populism is often preceded by a shift in the metapolitical sphere.","translation":"ポピュリズムの台頭は、しばしばメタ政治的な領域における変化に先行されます。"},{"sentence":"Some argue that art and media are key tools in metapolitical warfare.","translation":"芸術とメディアは、メタ政治的な戦いにおける重要な道具であると主張する人もいます。"}],"collocations":["cultural metapolitics","right-wing metapolitics","left-wing metapolitics","shaping the metapolitical landscape","engaging in metapolitics"],"synonyms":["cultural politics","discourse analysis","ideological struggle","cultural hegemony"],"antonyms":["direct action","electoral politics","policy advocacy"]}],"etymology":{"value":"The term 'metapolitics' combines the prefix 'meta-' (meaning 'beyond' or 'about') with 'politics,' suggesting a level of analysis or activity that is above or prior to conventional politics.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛtəˈpɒlɪtɪks/","syllables":"met-a-pol-i-tics"},"inflection":{"noun_plural":"Metapolitics (通常は単数形で使用)"},"usage_notes":{"explanation":"Metapolitics is often associated with attempts to influence the 'Overton window,' the range of ideas the public is willing to consider and accept. It involves long-term efforts to shift societal norms and values, often through cultural production, education, and intellectual discourse. It is frequently discussed in the context of ideological movements seeking to achieve broader societal change.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Metapolitics is only about winning elections.","correct":"✓ Metapolitics is about shaping the cultural and ideological landscape that influences political outcomes.","note":"Metapolitics is not primarily about winning elections but about influencing the underlying beliefs and values that shape political discourse. "},{"incorrect":"✗ Metapolitics is the same as political science.","correct":"✓ Metapolitics is related to political science but focuses on the cultural and ideological foundations of politics.","note":"Political science is a broader field that studies political systems and behavior, while metapolitics specifically examines the cultural and ideological underpinnings of politics."}],"priority":"★★☆"},"related_words":{"derivatives":["metapolitical (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Metapolitics' is a complex term that refers to the underlying cultural, philosophical, and ideological foundations that shape political discourse and action. It's about influencing the values, beliefs, and worldviews that inform political opinions and decisions. This concept is often used in discussions about long-term strategies for social and political change, focusing on shifting the Overton window and influencing cultural hegemony. Understanding metapolitics requires familiarity with political theory, cultural studies, and critical thinking.","priority":"★★☆"},"example_sentences":[{"sentence":"The alt-right has been particularly effective in using online platforms to engage in metapolitics.","translation":"オルタナ右翼は、オンラインプラットフォームを利用してメタポリティクスを展開することに特に成功しています。","type":"general","meaning_category":"political strategy"},{"sentence":"Universities play a crucial role in shaping the metapolitical views of future leaders.","translation":"大学は、将来のリーダーのメタ政治的な見解を形成する上で重要な役割を果たします。","type":"general","meaning_category":"cultural influence"},{"sentence":"Gramsci's theory of cultural hegemony is a key influence on contemporary metapolitical thought.","translation":"グラムシの文化覇権理論は、現代のメタ政治思想に大きな影響を与えています。","type":"theoretical","meaning_category":"ideological foundation"}]}