{"word":"rock-breaking","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"岩石破砕、採石","english_definition":"The act or process of breaking rocks, typically in mining or construction.","examples":[{"sentence":"Rock-breaking is a necessary step in quarrying.","translation":"岩石破砕は採石において必要な工程です。"},{"sentence":"The noise from rock-breaking disturbed the neighborhood.","translation":"岩石破砕の騒音が近隣の迷惑になった。"}],"collocations":["rock-breaking equipment","rock-breaking machine","rock-breaking operation","rock-breaking process"],"synonyms":["stone crushing","quarrying","excavation"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of the words 'rock' and 'breaking', indicating the action of breaking rocks.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɒkˌbreɪkɪŋ/","syllables":"rock-break-ing"},"inflection":{"noun_plural":"rock-breakings"},"usage_notes":{"explanation":"'Rock-breaking' is a compound noun that describes the activity of breaking rocks. It is commonly used in the context of mining, construction, and geological surveys. The term often implies the use of specialized equipment or techniques to fracture or crush rocks.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ rock breaking","correct":"✓ rock-breaking","note":"Hyphenation is preferred when used as a compound noun or adjective. However, 'rock breaking' can be used as a verb phrase."}],"priority":"★★☆"},"related_words":{"derivatives":["rock breaker (noun: a machine or tool used for breaking rocks)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'rock-breaking' is relatively specialized, primarily used in technical or industrial contexts related to mining, construction, or geology. Understanding requires familiarity with these fields."},"example_sentences":[{"sentence":"The construction crew used heavy machinery for rock-breaking at the site.","translation":"建設作業員たちは現場で岩石破砕のために重機を使用した。","type":"noun","meaning_category":"岩石破砕"},{"sentence":"The rock-breaking process released significant amounts of dust into the air.","translation":"岩石破砕の過程で大量の粉塵が空中に放出された。","type":"noun","meaning_category":"岩石破砕"}]}