{"word":"mouseries","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A place where mice are bred or kept, typically for scientific research or as pets.","english_definition":"Plural form of 'mousery'. A place or establishment where mice are bred or kept.","examples":[{"sentence":"The university's biological research department includes extensive mouseries.","translation":"大学の生物学研究部門には、広大なマウス飼育施設が含まれています。"},{"sentence":"She runs a small mousery in her basement, breeding fancy mice for show.","translation":"彼女は地下室で小さなマウス飼育所を経営しており、品評会用のファンシーマウスを繁殖させています。"}],"collocations":["research mousery","breeding mousery","university mousery","commercial mousery","small mousery"],"synonyms":["mouse house","mouse farm","rodent breeding facility"],"antonyms":[]}],"etymology":{"value":"Derived from 'mouse' + '-ery' (a suffix denoting a place or establishment).","priority":"Medium"},"pronunciation":{"ipa":"/ˈmaʊsəriz/","syllables":"mou-se-ries"},"inflection":{"noun_plural":"mouseries"},"usage_notes":{"explanation":"The term 'mousery' is relatively uncommon in general usage. It is most frequently encountered in contexts related to scientific research, animal breeding, or hobbyist mouse keeping. The plural form 'mouseries' is used to refer to multiple such facilities or establishments.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ I visited the mouse's house.","correct":"✓ I visited the mousery.","note":"'Mousery' specifically refers to a place where mice are bred or kept, not just any house a mouse might live in."}],"priority":"Low"},"related_words":{"derivatives":["mousery","mouse","mice"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'mouseries' is a specialized term. It is most likely to be encountered in scientific or hobbyist contexts related to mice. Understanding the word requires knowledge of the suffix '-ery' and its function in forming nouns that denote places or establishments. The word is not commonly used in everyday conversation. "},"example_sentences":[{"sentence":"The new mouseries were designed to minimize stress on the animals.","translation":"新しいマウス飼育施設は、動物へのストレスを最小限に抑えるように設計されました。","type":"noun","meaning_category":"Place for breeding/keeping mice"},{"sentence":"Several different strains of mice are maintained in the university's mouseries.","translation":"大学のマウス飼育施設では、いくつかの異なる系統のマウスが維持されています。","type":"noun","meaning_category":"Place for breeding/keeping mice"}]}