{"word":"dicaryotic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"二核の、二核性の","english_definition":"(of a cell or fungal hypha) containing two genetically distinct nuclei.","examples":[{"sentence":"The dicaryotic stage is characteristic of many fungi.","translation":"二核期は多くの菌類に特徴的である。"},{"sentence":"Dicaryotic cells are formed during fungal mating.","translation":"二核細胞は菌類の接合中に形成される。"}],"collocations":["dicaryotic cell (二核細胞)","dicaryotic hypha (二核菌糸)","dicaryotic stage (二核期)"],"synonyms":["binucleate"],"antonyms":["monokaryotic","haploid","diploid"]}],"etymology":{"value":"Derived from the Greek words 'di-' (two), 'karyon' (kernel, nucleus), and '-otic' (pertaining to).","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˌkæriˈɒtɪk/","syllables":"di-car-y-ot-ic"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"'Dicaryotic' refers specifically to cells, especially in fungi, that contain two distinct nuclei derived from different parents. This stage is part of the sexual reproduction cycle in certain fungi, where the nuclei coexist without fusing for a period of time.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The dicaryotic cell has a single nucleus.","correct":"✓ The dicaryotic cell has two nuclei.","note":"Dicaryotic cells, by definition, have two nuclei, not one."},{"incorrect":"✗ Dicaryotic is the same as diploid.","correct":"✓ Dicaryotic is different from diploid. In dicaryotic cells, the nuclei remain separate, whereas in diploid cells, the nuclei have fused.","note":"Dicaryotic cells have two separate nuclei, while diploid cells have a single nucleus with twice the normal chromosome number."}],"priority":"★★☆"},"related_words":{"derivatives":["dikaryon (noun: a dicaryotic cell or nucleus)","dikaryophase (noun: the dicaryotic stage in fungi)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dicaryotic' is a technical term used in biology, specifically in mycology (the study of fungi). It describes a cell that has two distinct nuclei, each with its own set of chromosomes. This condition is typically found in fungi during a stage of sexual reproduction before the nuclei fuse. Understanding this term requires a background in cell biology and fungal reproduction.","priority":"★★☆"},"example_sentences":[{"sentence":"The **dicaryotic** hyphae of the fungus can grow and spread for a considerable time before nuclear fusion occurs.","translation":"その菌類の二核菌糸は、核融合が起こるまでかなりの期間成長し広がる可能性がある。","type":"adjective","meaning_category":"describing fungal hyphae"},{"sentence":"Formation of **dicaryotic** cells is a key step in the sexual cycle of ascomycete fungi.","translation":"二核細胞の形成は、子嚢菌類の有性生殖周期における重要なステップである。","type":"adjective","meaning_category":"describing fungal cells"}]}