{"word":"theomicrist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who believes that God is the creator and ruler of the universe, and that all things are ultimately determined by divine will.","english_definition":"A person who believes that God is the creator and ruler of the universe, and that all things are ultimately determined by divine will.","examples":[{"sentence":"The theomicrist held firm to their faith, believing that even in times of hardship, God's plan would prevail.","translation":"その有神論者は、困難な時でも神の計画が勝つと信じ、信仰を固く守った。"}],"synonyms":["theist","believer","religionist"],"antonyms":["atheist","agnostic","nonbeliever"]}],"etymology":{"value":"The word 'theomicrist' is derived from the Greek words 'theos' (God), 'mio' (to determine or control), and 'krites' (judge or ruler).","priority":"★★★"},"pronunciation":{"ipa":"/ˌθiːoʊˈmaɪkrɪst/","syllables":"the-o-mi-crist"},"inflection":{"noun_plural":"theomicrists"},"usage_notes":{"explanation":"'Theomicrist' is a relatively rare term that emphasizes the belief in God's ultimate control and judgment over all things. It is often used in theological or philosophical contexts to describe someone with a strong conviction in divine sovereignty.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a theomicrist, so he doesn't believe in free will.","correct":"✓ He is a theomicrist, so he believes that free will is ultimately guided by God.","note":"Theomicrists typically believe that even if humans have free will, it is still within the scope of God's ultimate plan."}],"priority":"★★☆"},"related_words":{"derivatives":["theomicracy (government by divine guidance)","theomicy (justification of God's goodness in the face of evil)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - The term is rare and not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Theomicrist' is a specialized term used in theological discussions to describe someone who believes that God is both the creator and the ultimate ruler and judge of the universe. This word is not commonly used in everyday conversation and is more likely to be found in academic or religious texts. Understanding this term requires familiarity with theological concepts and vocabulary."},"example_sentences":[{"sentence":"As a theomicrist, she dedicated her life to serving God's will.","translation":"有神論者として、彼女は神の意志に仕えるために人生を捧げた。","type":"general","meaning_category":"belief in divine sovereignty"},{"sentence":"The philosopher explored the implications of theomicrism on human morality.","translation":"その哲学者は、有神論が人間の道徳に与える影響を探求した。","type":"academic","meaning_category":"theological concept"}]}