{"word":"night-themed","meanings":[{"part_of_speech":"adjective","definition":"夜をテーマにした、夜をモチーフにした","english_definition":"having a night theme or motif","examples":[{"sentence":"The hotel room had a night-themed decor, with dark blue walls and star-shaped lights.","translation":"そのホテルの部屋は夜をテーマにした内装で、濃い青色の壁と星型のライトが使われていた。"},{"sentence":"The artist created a series of night-themed paintings, capturing the beauty of the moonlit landscape.","translation":"そのアーティストは、月明かりに照らされた風景の美しさを捉えた、夜をテーマにした一連の絵画を制作した。"},{"sentence":"The party was night-themed, so everyone dressed in dark colors and brought glow sticks.","translation":"パーティーは夜をテーマにしていたので、みんな暗い色の服を着て、光るスティックを持ってきた。"}],"collocations":["night-themed party","night-themed event","night-themed decorations","night-themed art","night-themed restaurant"],"synonyms":["nocturnal-themed","evening-themed"],"antonyms":["day-themed"]}],"etymology":{"value":"The word is formed by combining \"night\" with \"themed,\" indicating that the subject matter is related to or inspired by the night.","priority":"★★★"},"pronunciation":{"ipa":"/ˈnaɪt θiːmd/","syllables":"night-themed"},"inflection":{"notes":"This is an adjective and does not have different forms for gender or number."},"usage_notes":{"explanation":"The adjective \"night-themed\" is used to describe something that incorporates elements or motifs associated with the night, such as darkness, stars, the moon, or nocturnal animals. It is often used in the context of parties, decorations, art, or other creative works.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The night theme party was fun.","correct":"The night-themed party was fun.","note":"Using 'night theme' as two separate words is grammatically incorrect when it should be a compound adjective."}],"priority":"★★★"},"related_words":{"derivatives":["theme","themed","night"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"B1","text":"The term 'night-themed' is relatively straightforward. It means that something is designed or decorated to evoke the feeling or imagery of nighttime. It's commonly used to describe parties, events, or artistic creations."},"example_sentences":[{"sentence":"The amusement park featured a special night-themed fireworks display.","translation":"その遊園地では、特別な夜をテーマにした花火大会が開催された。","type":"general","meaning_category":"general"},{"sentence":"She designed a night-themed nursery for her baby, with a mobile of stars and moons.","translation":"彼女は赤ちゃんのために、星と月をモチーフにした夜をテーマにした子供部屋をデザインした。","type":"general","meaning_category":"general"}]}