{"word":"culturization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"文化化、文化適応、文化変容","english_definition":"The process of learning and incorporating the values, beliefs, norms, and behaviors of a culture, especially one that is not one's own. It can also refer to the modification of a culture through contact with another.","examples":[{"sentence":"The culturization of immigrants into the host society can be a complex process.","translation":"移民が受け入れ国社会に文化化される過程は複雑になりうる。"},{"sentence":"Globalization has led to the culturization of many aspects of life worldwide.","translation":"グローバル化は世界中の生活の多くの側面における文化化をもたらした。"},{"sentence":"The culturization of indigenous populations often results in the loss of traditional practices.","translation":"先住民の文化化は、しばしば伝統的な慣習の喪失につながる。"}],"collocations":["process of culturization (文化化の過程)","cultural culturization (文化的文化化)","social culturization (社会的文化化)","culturization of immigrants (移民の文化化)","culturization of youth (若者の文化化)","culturization into society (社会への文化化)"],"synonyms":["acculturation","cultural adaptation","cultural assimilation","enculturation","socialization"],"antonyms":["deculturation","cultural resistance","cultural preservation"]},{"part_of_speech":"noun","definition":"文化の創造・発展","english_definition":"The creation or development of culture, often in a specific context or field.","examples":[{"sentence":"The culturization of the arts in the Renaissance was a period of great innovation.","translation":"ルネサンス期の芸術における文化の創造は、大きな革新の時代だった。"},{"sentence":"The culturization of technology has transformed the way we live and work.","translation":"テクノロジーの文化化は、私たちの生活と仕事のやり方を変革した。"}],"collocations":["culturization of technology (テクノロジーの文化化)","culturization of the arts (芸術の文化化)","culturization of ideas (アイデアの文化化)","culturization of knowledge (知識の文化化)"],"synonyms":["cultural development","cultural creation","cultural evolution","cultural innovation"],"antonyms":["cultural stagnation","cultural decline"]}],"etymology":{"value":"The word \"culturization\" is derived from \"culture\" and the suffix \"-ization,\" indicating a process or action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkʌltʃərəˈzeɪʃən/","syllables":"cul-tur-i-za-tion"},"inflection":{"noun_plural":"culturizations"},"usage_notes":{"explanation":"\"Culturization\" refers to the process of adopting or adapting to a culture, especially one that is different from one's own. It can also describe the creation or development of culture within a specific context. The term is often used in sociology, anthropology, and cultural studies. It is related to, but distinct from, \"acculturation,\" which typically refers to the changes that occur when different cultures come into prolonged contact.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The culturization was happen quickly.","correct":"✓ The culturization happened quickly.","note":"\"Culturization\" is a noun, so it requires a verb to form a sentence. The correct sentence uses the past tense verb \"happened.\""},{"incorrect":"✗ They are culturizing to the new environment.","correct":"✓ They are acculturating to the new environment. / ✓ They are undergoing culturization in the new environment.","note":"While \"culturize\" could potentially be used as a verb, it is not common. It's better to use \"acculturate\" or describe the process using the noun \"culturization.\""}],"priority":"★★☆"},"related_words":{"derivatives":["culture","cultural","culturally","acculturation","enculturation"],"phrases":["cultural adaptation","cultural assimilation","cultural integration","cross-cultural communication"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. The term is more common in academic and specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Culturization\" is a term used to describe the process of adopting the values, beliefs, and behaviors of a culture, especially when it is different from one's own. It can also refer to the creation or development of culture. This word is often used in academic fields like sociology and anthropology. It's similar to \"acculturation,\" but \"culturization\" can also refer to the active creation of culture, not just the adaptation to it."},"example_sentences":[{"sentence":"The **culturization** of children begins at a young age through family and education.","translation":"子供たちの文化化は、幼い頃から家族や教育を通じて始まる。","type":"noun","meaning_category":"文化適応"},{"sentence":"The company focused on the **culturization** of innovation to stay competitive.","translation":"その会社は競争力を維持するために、イノベーションの文化化に焦点を当てた。","type":"noun","meaning_category":"文化の創造・発展"},{"sentence":"Language learning is a key aspect of **culturization** when moving to a new country.","translation":"新しい国に移住する際、言語学習は文化化の重要な側面である。","type":"noun","meaning_category":"文化適応"},{"sentence":"The **culturization** process can be challenging for refugees adjusting to a new society.","translation":"文化化の過程は、新しい社会に適応する難民にとって困難なものとなりうる。","type":"noun","meaning_category":"文化適応"}]}