{"word":"amniocentesis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"羊水穿刺（ようすいせんし）","english_definition":"a medical procedure used in prenatal diagnosis in which a small amount of amniotic fluid, which contains fetal tissues, is sampled from the amniotic sac surrounding a developing fetus, and the fetal DNA is examined for genetic abnormalities.","examples":[{"sentence":"Amniocentesis is usually performed between the 15th and 20th weeks of pregnancy.","translation":"羊水穿刺は通常、妊娠15週から20週の間に行われます。"},{"sentence":"The results of the amniocentesis indicated that the fetus had Down syndrome.","translation":"羊水穿刺の結果、胎児がダウン症候群であることが示されました。"}],"collocations":["perform amniocentesis (羊水穿刺を行う)","amniocentesis results (羊水穿刺の結果)","genetic amniocentesis (遺伝子羊水穿刺)","prenatal amniocentesis (出生前羊水穿刺)"],"synonyms":["prenatal diagnosis","chorionic villus sampling (CVS)"],"antonyms":[]}],"etymology":{"value":"The term \"amniocentesis\" comes from the Greek words \"amnion\" (the membrane surrounding the fetus) + \"kentēsis\" (surgical puncture).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæmnioʊsenˈtiːsɪs/","syllables":"am-ni-o-cen-te-sis"},"inflection":{"noun_plural":"amniocenteses"},"usage_notes":{"explanation":"Amniocentesis is a diagnostic procedure, not a treatment. It carries a small risk of miscarriage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Amniocentesis is a treatment for genetic disorders.","correct":"✓ Amniocentesis is a diagnostic test for genetic disorders.","note":"Amniocentesis is used to diagnose, not treat, genetic disorders."}],"priority":"★★☆"},"related_words":{"derivatives":["amniotic (adjective)","centesis (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Amniocentesis is a medical term referring to a procedure to take a sample of amniotic fluid during pregnancy to test for certain health conditions in the baby. This test is usually done when there's a higher chance of problems, and it helps doctors and parents make important decisions about the pregnancy. It's a complex topic, so it's usually discussed in medical settings or when talking about pregnancy and prenatal care."},"example_sentences":[{"sentence":"The doctor recommended amniocentesis due to the mother's age.","translation":"医師は母親の年齢を考慮して羊水穿刺を推奨しました。","type":"medical","meaning_category":"diagnosis"},{"sentence":"Amniocentesis can help detect chromosomal abnormalities in the fetus.","translation":"羊水穿刺は胎児の染色体異常を発見するのに役立ちます。","type":"medical","meaning_category":"diagnosis"}]}