{"word":"Sporation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学) 胞子形成、特に細菌における内生胞子形成","english_definition":"(Biology) The process of spore formation, especially endospore formation in bacteria.","examples":[{"sentence":"Sporation is a survival mechanism for some bacteria under unfavorable conditions.","translation":"胞子形成は、一部の細菌にとって不利な条件下での生存メカニズムです。"},{"sentence":"The sporulation process allows the bacteria to remain dormant until conditions improve.","translation":"胞子形成プロセスにより、細菌は条件が改善するまで休眠状態を維持できます。"}],"collocations":["initiate sporulation (胞子形成を開始する)","undergo sporulation (胞子形成を受ける)","inhibit sporulation (胞子形成を阻害する)","sporulation process (胞子形成過程)","bacterial sporulation (細菌の胞子形成)"],"synonyms":["sporogenesis","sporulation","endosporulation"],"antonyms":["vegetative growth"],"notes":"Sporation is distinct from simple spore production in fungi or plants. It refers specifically to the formation of highly resistant endospores within bacterial cells."}],"etymology":{"value":"Derived from 'spore' + '-ation' (suffix indicating a process or action).","priority":"★★★"},"pronunciation":{"ipa":"/spɔːˈreɪʃən/","syllables":"spo-ra-tion"},"inflection":{"noun_plural":"sporations"},"usage_notes":{"explanation":"'Sporation' is a technical term primarily used in microbiology and bacteriology. It describes the complex process by which certain bacteria form endospores, which are highly resistant to heat, radiation, and chemicals. These endospores allow the bacteria to survive harsh environmental conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The fungus underwent sporation.","correct":"✓ The fungus produced spores.","note":"'Sporation' specifically refers to endospore formation in bacteria, not spore production in fungi."}],"priority":"★★☆"},"related_words":{"derivatives":["spore (noun: 胞子)","sporulate (verb: 胞子を形成する)","endospore (noun: 内生胞子)","sporogenesis (noun: 胞子形成)"],"related_terms":["germination (胞子発芽)","dormancy (休眠)","bacteriology (細菌学)","microbiology (微生物学)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - technical term used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sporation' is a specialized term used in the field of microbiology, specifically referring to the process by which certain bacteria form endospores. These endospores are highly resistant structures that allow the bacteria to survive harsh environmental conditions. The term is typically encountered in scientific literature or advanced biology courses. It's important to distinguish 'sporation' from general spore production in other organisms like fungi."},"example_sentences":[{"sentence":"Clostridium species are known for their ability to undergo sporation.","translation":"クロストリジウム属の細菌は、胞子形成を行う能力があることで知られています。","type":"scientific","meaning_category":"bacterial endospore formation"},{"sentence":"The researchers studied the genetic mechanisms that regulate sporation in Bacillus subtilis.","translation":"研究者らは、枯草菌における胞子形成を制御する遺伝的メカニズムを研究しました。","type":"scientific","meaning_category":"bacterial endospore formation"}]}