{"word":"astrophotometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"天体光度計","english_definition":"An instrument for measuring the brightness of stars and other celestial objects.","examples":[{"sentence":"The astronomer used an astrophotometer to measure the magnitude of a distant star.","translation":"天文学者は、遠い星の等級を測定するために天体光度計を使用した。"}],"collocations":["use an astrophotometer","calibrate an astrophotometer","digital astrophotometer"],"synonyms":["photometer","stellar photometer"],"antonyms":[]}],"etymology":{"value":"The word is formed by combining 'astro-' (referring to stars or celestial objects), 'photo-' (referring to light), and '-meter' (an instrument for measuring).","priority":"★★★"},"pronunciation":{"ipa":"/ˌæstroʊfoʊˈtɑːmɪtər/","syllables":"as-tro-pho-tom-e-ter"},"inflection":{"noun_plural":"astrophotometers"},"usage_notes":{"explanation":"An astrophotometer is a specialized type of photometer used in astronomy. It measures the intensity of electromagnetic radiation emitted by celestial objects, typically in specific wavelength bands. This data is used to determine the object's brightness, color, and other physical properties.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a telescope instead of astrophotometer to measure the star's brightness.","correct":"✓ I used a telescope with an astrophotometer to measure the star's brightness.","note":"A telescope gathers light, and an astrophotometer measures the light's intensity. They often work together."}],"priority":"★☆☆"},"related_words":{"derivatives":["astrophotometry"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"An astrophotometer is a specialized instrument used in astronomy to measure the brightness of celestial objects. This instrument is crucial for determining the magnitude and other photometric properties of stars and galaxies. It is primarily used by professional astronomers and researchers in the field of astrophysics."},"example_sentences":[{"sentence":"The observatory is equipped with a state-of-the-art astrophotometer.","translation":"その天文台には、最新の天体光度計が装備されている。","type":"noun","meaning_category":"instrument"},{"sentence":"Data from the astrophotometer helped determine the variability of the star's light curve.","translation":"天体光度計からのデータは、その星の光度曲線の変動を決定するのに役立った。","type":"noun","meaning_category":"data analysis"}]}