{"word":"Tennysonianism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"テニスン主義：アルフレッド・テニスン（Alfred Tennyson）の詩やそのスタイル、テーマ、価値観に影響を受けた文学的・文化的運動、またはそれらを模倣・賛美する傾向。","english_definition":"The literary and cultural movement influenced by the poetry of Alfred Tennyson, or the tendency to imitate or admire his style, themes, and values.","examples":[{"sentence":"Tennysonianism was a dominant force in Victorian poetry, shaping the sensibilities of many writers.","translation":"テニスン主義は、多くの作家の感性を形成し、ビクトリア朝の詩において支配的な力でした。"},{"sentence":"The painting reflected Tennysonianism in its romantic depiction of nature and idealized figures.","translation":"その絵画は、自然のロマンチックな描写と理想化された人物像において、テニスン主義を反映していました。"},{"sentence":"Some critics argue that the later works of the poet showed a decline into mere Tennysonianism, lacking the original spark.","translation":"批評家の中には、その詩人の後期の作品は、オリジナルの輝きを欠き、単なるテニスン主義に陥ったと主張する者もいます。"}],"collocations":["Victorian Tennysonianism","literary Tennysonianism","Tennysonian influence","Tennysonian style","Tennysonian themes"],"synonyms":["Tennysonian","Tennyson","Victorianism","Romanticism","Aestheticism"],"antonyms":["Modernism","Realism","Naturalism"]}],"etymology":{"value":"「Tennysonianism」は、詩人アルフレッド・テニスン（Alfred Tennyson）の名前に、主義や運動を表す接尾辞「-ism」を付けたものです。","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɛnɪˈsoʊniənɪzəm/","syllables":"Ten-ny-so-ni-an-is-m"},"inflection":{"noun_plural":"Tennysonianisms (まれに複数形で使われる)"},"usage_notes":{"explanation":"「Tennysonianism」は、アルフレッド・テニスンの作品のスタイル、テーマ、価値観を模倣または賛美する傾向を指します。ビクトリア朝時代の文学や文化に大きな影響を与え、特に自然の美しさ、ロマンス、道徳的なテーマを扱った作品に多く見られます。ただし、オリジナリティを欠いた模倣を批判的に指す場合もあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Tennysonian.","correct":"✓ He is a Tennysonian poet. / ✓ He writes in the style of Tennysonianism.","note":"「Tennysonian」は形容詞または名詞として使われますが、人そのものを指す場合は「Tennysonian poet」のように具体的な職業や役割を付け加えるか、「Tennysonianismのスタイルで書く」のように表現します。"},{"incorrect":"✗ Tennysonianism is a type of music.","correct":"✓ Tennysonianism is a literary and cultural movement.","note":"Tennysonianismは音楽のジャンルではなく、文学と文化の運動です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Tennysonian (形容詞：テニスンの、テニスン風の；名詞：テニスン主義の詩人)","Tennyson (名詞：アルフレッド・テニスン)"],"phrases":["In the style of Tennyson","Inspired by Tennyson"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 文学研究や特定の文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Tennysonianism」は、アルフレッド・テニスンという19世紀の有名な詩人のスタイルや考え方に影響を受けた文学や文化の傾向を指す言葉です。テニスンの詩の特徴である、美しい言葉遣いや、自然やロマンス、道徳的なテーマを扱った作品を真似たり、高く評価したりすることを意味します。この言葉は、文学の研究や、ビクトリア朝時代の文化について議論する際に使われることが多いです。"},"example_sentences":[{"sentence":"The poem's lush descriptions and melancholic tone are characteristic of Tennysonianism.","translation":"その詩の豊かな描写と憂鬱なトーンは、テニスン主義の特徴です。","type":"general","meaning_category":"特徴"},{"sentence":"Critics debated whether the artist's work was a genuine continuation of Tennysonianism or merely a superficial imitation.","translation":"批評家たちは、その芸術家の作品がテニスン主義の真の継続であるか、単なる表面的な模倣であるかを議論しました。","type":"critical","meaning_category":"評価"},{"sentence":"Tennysonianism influenced the visual arts, inspiring paintings with romantic landscapes and Arthurian legends.","translation":"テニスン主義は視覚芸術にも影響を与え、ロマンチックな風景やアーサー王伝説を描いた絵画に影響を与えました。","type":"influence","meaning_category":"影響"}]}