{"word":"infectivity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"感染力、感染性","english_definition":"the ability of a pathogen to establish an infection","examples":[{"sentence":"The infectivity of the new variant is higher than the original strain.","translation":"その新しい変異株の感染力は、元の株よりも高い。"},{"sentence":"Researchers are studying the infectivity of the virus in different cell types.","translation":"研究者たちは、異なる細胞型におけるウイルスの感染力を研究している。"},{"sentence":"The level of infectivity depends on several factors, including the viral load and the host's immune system.","translation":"感染力のレベルは、ウイルス量や宿主の免疫系を含む、いくつかの要因に依存する。"}],"collocations":["high infectivity (高い感染力)","low infectivity (低い感染力)","measure infectivity (感染力を測定する)","viral infectivity (ウイルスの感染力)","increase infectivity (感染力を増加させる)","reduce infectivity (感染力を低下させる)"],"synonyms":["contagiousness","virulence","transmissibility","pathogenicity"],"antonyms":["non-infectivity"],"related_terms":["infection","virus","bacteria","pathogen","disease","transmission","contagion","immune system","viral load"]}],"etymology":{"value":"From 'infective' (capable of causing infection) + '-ity' (suffix denoting a state or quality).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪnfɛkˈtɪvɪti/","syllables":"in-fec-tiv-i-ty"},"inflection":{"noun_plural":"infectivities"},"usage_notes":{"explanation":"'Infectivity' refers specifically to the capacity of an infectious agent (like a virus or bacterium) to establish an infection in a host. It's a measure of how easily the pathogen can enter, survive, and multiply within the host. It's often used in epidemiology and virology to assess the potential spread and impact of infectious diseases. It is related to, but distinct from, 'transmissibility,' which refers to how easily a pathogen spreads from one host to another. 'Virulence' refers to the severity of the disease caused by the pathogen.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The infectivity of the disease is how sick you get.","correct":"The virulence of the disease is how sick you get.","note":"Infectivity refers to the ability to establish an infection, while virulence refers to the severity of the disease."},{"incorrect":"The infectivity of the virus is how easily it spreads between people.","correct":"The transmissibility of the virus is how easily it spreads between people.","note":"Infectivity is the ability to establish an infection, while transmissibility is the ability to spread between people."}],"priority":"★★☆"},"related_words":{"derivatives":["infectious","infective","infection"],"related_scientific_terms":["R0 (basic reproduction number)","viral titer","plaque assay"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Infectivity' is a technical term used in medicine and biology to describe how easily a pathogen can cause an infection. It's not a commonly used word in everyday conversation. Understanding this word is important for comprehending scientific articles and discussions related to infectious diseases. It's related to, but different from, terms like 'transmissibility' (how easily a pathogen spreads) and 'virulence' (how severe the disease is)."},"example_sentences":[{"sentence":"The study examined the infectivity of different strains of influenza virus.","translation":"その研究では、異なるインフルエンザウイルス株の感染力を調べた。","type":"scientific","meaning_category":"general"},{"sentence":"The high infectivity of the measles virus makes it easily spread in unvaccinated populations.","translation":"麻疹ウイルスの高い感染力により、ワクチン未接種の集団では感染が広がりやすい。","type":"medical","meaning_category":"epidemiology"},{"sentence":"Researchers are working to develop antiviral drugs that can reduce the infectivity of HIV.","translation":"研究者たちは、HIVの感染力を低下させることができる抗ウイルス薬の開発に取り組んでいる。","type":"medical","meaning_category":"virology"}]}