{"word":"automation-prone","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"自動化されやすい、自動化される可能性が高い","english_definition":"Likely to be automated; susceptible to automation.","examples":[{"sentence":"Repetitive tasks are automation-prone.","translation":"反復的な作業は自動化されやすい。"},{"sentence":"The study identified several automation-prone jobs in the manufacturing sector.","translation":"その調査では、製造業におけるいくつかの自動化されやすい仕事が特定された。"},{"sentence":"Software testing is an automation-prone area of software development.","translation":"ソフトウェアテストは、ソフトウェア開発において自動化されやすい分野である。"}],"collocations":["highly automation-prone","tasks that are automation-prone","industries that are automation-prone"],"synonyms":["automatable","susceptible to automation","easily automated"],"antonyms":["automation-resistant","difficult to automate"]}],"etymology":{"value":"The word is formed by combining 'automation' (the use of automatic equipment in a manufacturing or other process) with '-prone' (likely to suffer from, do, or experience something undesirable). Thus, 'automation-prone' describes something likely to be subjected to or replaced by automation.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌɔːtəˈmeɪʃən proʊn/","syllables":"au-to-ma-tion prone"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Automation-prone' is used to describe tasks, jobs, or industries that are easily or likely to be replaced or enhanced by automation technologies. It often implies that the task or job is repetitive, rule-based, and doesn't require a high degree of creativity or critical thinking.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The automation-prone of this job is high.","correct":"✓ The automation-proneness of this job is high.","note":"'Automation-prone' is an adjective, so it should be used to describe a noun. To refer to the quality of being automation-prone, use the noun 'automation-proneness'."}],"priority":"☆☆☆"},"related_words":{"derivatives":["automation (noun)","prone (adjective)","automation-resistance (noun)","automation-resistant (adjective)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'automation-prone' is a relatively advanced and specific term used in discussions about technology, economics, and the future of work. It describes tasks or jobs that are likely to be automated, meaning they can be easily performed by machines or software with minimal human intervention. Understanding this term is useful for analyzing trends in employment and technological advancements."},"example_sentences":[{"sentence":"Data entry is a highly **automation-prone** task.","translation":"データ入力は非常に自動化されやすい作業です。","type":"adjective","meaning_category":"Likely to be automated"},{"sentence":"The report highlights several **automation-prone** sectors of the economy.","translation":"その報告書は、経済におけるいくつかの自動化されやすい分野を強調している。","type":"adjective","meaning_category":"Susceptible to automation"}]}