{"word":"non-curatorial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"学芸員的でない、キュレーションに関わらない","english_definition":"Not relating to or involving the work of a curator or curating.","examples":[{"sentence":"The project took a non-curatorial approach, focusing on community engagement rather than exhibition design.","translation":"そのプロジェクトは、展示デザインよりも地域社会との連携に焦点を当てた、学芸員的でないアプローチをとった。"},{"sentence":"She took on a non-curatorial role in the museum, working in education and outreach.","translation":"彼女は美術館で教育とアウトリーチを担当し、キュレーションに関わらない役割を担った。"},{"sentence":"The website offers a non-curatorial selection of resources, allowing users to filter and choose based on their own preferences.","translation":"そのウェブサイトは、ユーザーが自分の好みに基づいてフィルタリングおよび選択できる、キュレーションされていないリソースのセレクションを提供している。"}],"collocations":["non-curatorial role","non-curatorial approach","non-curatorial selection"],"synonyms":["non-exhibition","non-archival","non-collection"],"antonyms":["curatorial","exhibitionary","archival","collection-based"]}],"etymology":{"value":"'Non-' (否定接頭辞) + 'curatorial' (学芸員の、キュレーションの)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn kjʊˈreɪtəriəl/","syllables":"non-cu-ra-to-ri-al"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"'Non-curatorial' describes activities, roles, or approaches that are outside the traditional responsibilities of a curator. This often involves focusing on education, community engagement, or other aspects of cultural heritage management that don't directly involve selecting and presenting objects for display. It can also refer to selections or collections of items that haven't been organized or presented according to curatorial principles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The curatorial team was non-curatorial in their approach.","correct":"✓ The team took a non-curatorial approach.","note":"'Non-curatorial' describes the *approach* or *role*, not the team itself. A curatorial team cannot be non-curatorial, but they can choose to adopt a non-curatorial approach to a specific project."}],"priority":"★★☆"},"related_words":{"derivatives":["curator","curatorial","curate","curation"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-curatorial' is a specialized term used in museum studies, art history, and related fields. It describes something that is not related to the traditional tasks of a curator, such as selecting, organizing, and presenting objects for display. It often implies a focus on other aspects of cultural heritage management, such as education or community engagement. Understanding this term requires familiarity with the role of a curator and the principles of curatorial practice."},"example_sentences":[{"sentence":"The museum's education program adopted a **non-curatorial** strategy to reach a wider audience.","translation":"美術館の教育プログラムは、より幅広い観客にリーチするために、キュレーションに関わらない戦略を採用した。","type":"adjective","meaning_category":"キュレーションに関わらない"},{"sentence":"Her **non-curatorial** work at the gallery involved managing social media and marketing.","translation":"彼女のギャラリーでのキュレーションに関わらない仕事は、ソーシャルメディアとマーケティングの管理を含んでいた。","type":"adjective","meaning_category":"キュレーションに関わらない"},{"sentence":"The online archive offers a **non-curatorial** view of the collection, allowing users to explore the materials in a more unstructured way.","translation":"オンラインアーカイブは、コレクションのキュレーションされていないビューを提供し、ユーザーがより構造化されていない方法で資料を探索できるようにする。","type":"adjective","meaning_category":"キュレーションに関わらない"}]}