{"word":"cationically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"陽イオン的に、カチオン的に","english_definition":"In a manner involving cations; by means of cations.","examples":[{"sentence":"The polymer was cationically modified to improve its adhesion.","translation":"そのポリマーは、その接着性を改善するために陽イオン的に修飾された。"},{"sentence":"The reaction proceeds cationically, forming a stable carbocation intermediate.","translation":"その反応は陽イオン的に進行し、安定なカルボカチオン中間体を形成する。"}],"collocations":["cationically modified","cationically initiated","cationically polymerizable"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Formed from 'cationic' (adjective relating to cations) with the addition of the adverbial suffix '-ally'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkætaɪˈɒnɪkli/","syllables":"cat-ion-ic-al-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"'Cationically' is used in scientific and technical contexts, particularly in chemistry and materials science, to describe processes or modifications involving cations (positively charged ions). It indicates that the mechanism or property is related to the behavior or presence of cations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The substance has cationical properties.","correct":"✓ The substance has cationic properties.","note":"'Cationical' is not a standard word. The correct adjective form is 'cationic'."}],"priority":"★★★"},"related_words":{"derivatives":["cation","cationic","cationization"],"related_terms":["anionically","radically"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized scientific vocabulary.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Cationically' is a highly specialized term used in chemistry and materials science. It describes a process or state related to cations, which are positively charged ions. Understanding this term requires a background in chemistry or a related scientific field. It is not commonly used outside of these contexts."},"example_sentences":[{"sentence":"The polymerization was initiated cationically using a Lewis acid catalyst.","translation":"重合は、ルイス酸触媒を用いて陽イオン的に開始された。","type":"adverb","meaning_category":"陽イオン的に"},{"sentence":"The surface was cationically charged to attract negatively charged particles.","translation":"表面は、負に帯電した粒子を引き付けるために陽イオン的に帯電された。","type":"adverb","meaning_category":"陽イオン的に"}]}