{"word":"counter-reaction","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"反作用、反発、逆反応","english_definition":"An action or feeling that is a direct response to something else, often in opposition or resistance.","examples":[{"sentence":"The government's new policy provoked a strong counter-reaction from the public.","translation":"政府の新しい政策は、国民から強い反発を引き起こした。"},{"sentence":"His initial enthusiasm was met with a counter-reaction of skepticism from his colleagues.","translation":"彼の最初の熱意は、同僚からの懐疑的な反作用に遭った。"},{"sentence":"The proposed tax increase led to a significant counter-reaction in the business community.","translation":"提案された増税は、経済界で大きな反発につながった。"}],"collocations":["strong counter-reaction","negative counter-reaction","public counter-reaction","political counter-reaction","economic counter-reaction"],"synonyms":["backlash","opposition","resistance","recoil","retort"],"antonyms":["acceptance","agreement","compliance","support","acquiescence"]}],"etymology":{"value":"The word is formed by combining \"counter-\" (meaning against or opposite) with \"reaction\" (meaning a response to something). The prefix \"counter-\" is commonly used to indicate opposition or reversal.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkaʊntərriˈækʃən/","syllables":"coun-ter-re-ac-tion"},"inflection":{"noun_plural":"counter-reactions"},"usage_notes":{"explanation":"\"Counter-reaction\" is used to describe a response that is directly opposed to or resisting a previous action or event. It often implies a negative or resistant response, but can also simply refer to any action that is a direct result of another action. The term is frequently used in political, social, and scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The counter-reaction was very good.","correct":"✓ The counter-reaction was very strong.","note":"When describing the intensity of a counter-reaction, it is more common to use words like \"strong,\" \"intense,\" or \"significant\" rather than \"good.\""},{"incorrect":"✗ The reaction counter was immediate.","correct":"✓ The counter-reaction was immediate.","note":"Ensure the correct word order is used. \"Counter-reaction\" is a single compound noun, not separate adjectives and nouns."}],"priority":"★★☆"},"related_words":{"derivatives":["counteract (verb): to act against something in order to reduce its force or neutralize it.","counterbalance (noun/verb): a weight or force that offsets another; to offset or balance something.","counterintuitive (adjective): contrary to what intuition or common sense would suggest.","counteroffensive (noun): an offensive undertaken as a response to an enemy's offensive."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in academic and formal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"counter-reaction\" is used to describe a response that is directly opposed to or resisting a previous action or event. It's often used in formal or academic contexts to describe political, social, or scientific responses. The prefix \"counter-\" indicates opposition, and \"reaction\" refers to a response. Understanding the context is crucial to grasp the specific meaning. For example, in politics, it might refer to public opposition to a new law, while in physics, it could describe a force acting in opposition to another force."},"example_sentences":[{"sentence":"The proposal to build a new highway met with a fierce counter-reaction from environmental groups.","translation":"新しい高速道路を建設するという提案は、環境保護団体から激しい反発を受けた。","type":"noun","meaning_category":"反発"},{"sentence":"The company's decision to cut wages triggered a counter-reaction in the form of a strike.","translation":"会社の賃金削減の決定は、ストライキという形で反作用を引き起こした。","type":"noun","meaning_category":"反作用"},{"sentence":"Every action has an equal and opposite counter-reaction, according to Newton's third law.","translation":"ニュートンの第三法則によると、すべての作用には等しく反対の反作用がある。","type":"noun","meaning_category":"逆反応"}]}