{"word":"statuarist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"彫像家、彫刻家（特に像を専門とする人）","english_definition":"a sculptor, especially one who specializes in statues.","examples":[{"sentence":"He is a renowned statuarist, known for his lifelike marble figures.","translation":"彼は生き生きとした大理石像で知られる、有名な彫像家です。"},{"sentence":"The statuarist spent years perfecting the technique of casting bronze statues.","translation":"その彫像家は、ブロンズ像の鋳造技術を完成させるのに何年も費やしました。"}],"collocations":["famous statuarist","talented statuarist","marble statuarist","bronze statuarist"],"synonyms":["sculptor","carver","modeler","image-maker"],"antonyms":["(none common)"],"notes":"The term \"statuarist\" is somewhat less common than \"sculptor,\" and it specifically emphasizes the creation of statues rather than other forms of sculpture."}],"etymology":{"value":"From \"statuary\" (a collection of statues) + \"-ist\" (a suffix indicating a person who practices or is concerned with something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstætʃuərɪst/","syllables":"stat-u-ar-ist"},"inflection":{"noun_plural":"statuarists"},"usage_notes":{"explanation":"The word \"statuarist\" is a more specific term than \"sculptor.\" While a sculptor may work with various materials and create different types of three-dimensional art, a statuarist primarily focuses on creating statues, which are typically representational figures or objects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a statuarist of abstract forms.","correct":"✓ He is a sculptor of abstract forms.","note":"\"Statuarist\" implies the creation of representational figures. If the artist creates abstract forms, \"sculptor\" is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["statuary (noun: 彫像群、彫像術)","statue (noun: 彫像、像)"],"related_occupations":["sculptor","stone carver","wood carver","bronze caster"],"priority":"★★☆"},"level_frequency":{"CEFR":"(Not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"statuarist\" is a specialized term for a sculptor who primarily creates statues. It's less common than \"sculptor\" but more precise when referring to someone who focuses on making statues, especially representational figures. You might encounter this word in art history or when discussing specific types of sculpture."},"example_sentences":[{"sentence":"The museum features works by several prominent statuarists from the 19th century.","translation":"その美術館には、19世紀の著名な彫像家たちの作品がいくつか展示されています。","type":"general","meaning_category":"彫像家"},{"sentence":"As a statuarist, she is dedicated to capturing the human form in marble.","translation":"彫像家として、彼女は大理石で人間の形を捉えることに専念しています。","type":"general","meaning_category":"彫像家"}]}