{"word":"anting-anting","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(フィリピン) お守り、護符、魔除け","english_definition":"(Philippines) An amulet, charm, or talisman believed to possess supernatural powers.","examples":[{"sentence":"He wore an anting-anting for protection against evil spirits.","translation":"彼は悪霊から身を守るためにお守りを身につけていた。"},{"sentence":"Many Filipinos believe in the power of anting-anting.","translation":"多くのフィリピン人はお守りの力を信じている。"},{"sentence":"The old man claimed his anting-anting could make him invisible.","translation":"その老人は彼のお守りが彼を透明にできると主張した。"}],"collocations":["wear an anting-anting (お守りを身につける)","believe in anting-anting (お守りを信じる)","anting-anting for protection (守りのためのお守り)"],"synonyms":["amulet","talisman","charm","pendant","lucky charm"],"antonyms":["curse","jinx"],"cultural_notes":"Anting-anting are deeply rooted in Filipino folklore and spirituality. They are often associated with folk Catholicism and indigenous beliefs. The powers attributed to anting-anting vary widely, including protection from harm, invisibility, invincibility, and good luck. They can take many forms, such as medallions, stones, clothing, or even prayers and rituals."}],"etymology":{"value":"Likely derived from the Tagalog word \"anit,\" meaning \"spirit of an ancestor.\" The repetition of \"anting\" may indicate emphasis or intensification of the spiritual power.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːntɪŋ ˈɑːntɪŋ/","syllables":"an-ting-an-ting"},"inflection":{"noun_plural":"anting-anting (usually unchanged in plural)"},"usage_notes":{"explanation":"The term \"anting-anting\" is specific to the Philippines and its culture. It refers to objects or practices believed to provide supernatural protection or power. While similar to amulets or talismans in other cultures, anting-anting hold a unique significance within the Filipino context, often intertwined with religious syncretism and folk beliefs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He bought an anting-anting from China.","correct":"✓ He bought an anting-anting from the Philippines.","note":"Anting-anting are specific to Filipino culture. While amulets exist in other cultures, the term \"anting-anting\" should be reserved for those originating from the Philippines."},{"incorrect":"✗ Anting-anting are always made of metal.","correct":"✓ Anting-anting can be made of various materials.","note":"Anting-anting can take many forms, including medallions, stones, cloth, or even written prayers."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrases":["anting-anting maker (お守りを作る人)","anting-anting seller (お守りを売る人)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency (Specific to Filipino culture)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Anting-anting\" is a culturally specific term referring to amulets or talismans in Filipino culture. Understanding its meaning requires familiarity with Filipino folklore and religious syncretism. The word itself is not commonly used outside of the Philippines or discussions about Filipino culture."},"example_sentences":[{"sentence":"The farmer wore an **anting-anting** to protect his crops from pests.","translation":"農夫は害虫から作物を守るためにお守りを身につけていた。","type":"noun","meaning_category":"amulet"},{"sentence":"She prayed over her **anting-anting**, seeking guidance from the spirits.","translation":"彼女は精霊からの導きを求めてお守りに祈りを捧げた。","type":"noun","meaning_category":"amulet"},{"sentence":"Many stories circulate about the powers of **anting-anting** in the province.","translation":"その地方では、お守りの力についての多くの物語が広まっている。","type":"noun","meaning_category":"amulet"}]}