{"word":"desmidian","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(生物学) 緑藻植物門接合藻綱ツヅミモ科に属する藻類の総称","english_definition":"Any alga of the family Desmidiaceae, characterized by cells divided into two symmetrical halves or semicells.","examples":[{"sentence":"Desmidians are often found in acidic, nutrient-poor waters.","translation":"ツヅミモ類は酸性で栄養の少ない水域によく見られる。"},{"sentence":"The intricate cell structure of desmidians makes them a subject of scientific interest.","translation":"ツヅミモ類の複雑な細胞構造は、科学的な関心の対象となっている。"}],"collocations":["desmidian algae","desmidian cell","desmidian species","desmidian flora"],"synonyms":["desmid"],"antonyms":[]}],"etymology":{"value":"Derived from Desmidiaceae (the family name), which is from Desmidium (a genus within the family), ultimately from Greek desmos (δεσμός) meaning 'bond, chain'. This refers to the way some desmidians form chains of cells.","priority":"★★☆"},"pronunciation":{"ipa":"/dɛzˈmɪdiən/","syllables":"dez-mid-i-an"},"inflection":{"noun_plural":"desmidians"},"usage_notes":{"explanation":"Desmidians are a group of green algae known for their symmetrical cell structure. They are often used as indicators of water quality. The term can refer to a single organism or the entire group.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Desmidians is a type of algae.","correct":"✓ Desmidians are a type of algae.","note":"Desmidians is plural, so it requires a plural verb."}],"priority":"★★☆"},"related_words":{"derivatives":["Desmidiaceae (family)","Desmidium (genus)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Desmidian' refers to a specific type of green algae, primarily of interest to those studying biology or ecology. The term is not commonly used in everyday language. Understanding requires familiarity with basic biological classification.","priority":"★★☆"},"example_sentences":[{"sentence":"The pond was teeming with various species of desmidian.","translation":"その池はさまざまな種類のツヅミモ類でいっぱいだった。","type":"noun","meaning_category":"藻類"},{"sentence":"Desmidian algae are sensitive to changes in water pH.","translation":"ツヅミモ類の藻類は水pHの変化に敏感である。","type":"noun","meaning_category":"藻類"},{"sentence":"Under the microscope, the intricate patterns of the desmidian cell walls were visible.","translation":"顕微鏡下では、ツヅミモ類の細胞壁の複雑なパターンが見えた。","type":"noun","meaning_category":"藻類"}]}