{"word":"Restrikes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にコイン)再鋳貨、再発行貨","english_definition":"Coins that are minted again, often years after the original issue, using the original dies or newly made dies of the original design.","examples":[{"sentence":"The coin collector was excited to find a silver restrike of the 1804 dollar.","translation":"そのコイン収集家は1804年ドル銀貨の再鋳貨を見つけて興奮した。"},{"sentence":"Restrikes are often produced for collectors or as commemorative items.","translation":"再鋳貨はしばしば収集家向けや記念品として製造される。"}],"collocations":["silver restrike","gold restrike","commemorative restrike"],"synonyms":["reissue","reproduction","replica"],"antonyms":["original issue"]},{"part_of_speech":"verb","definition":"(コインを)再鋳造する、再発行する","english_definition":"To mint (a coin) again, often using the original dies or newly made dies of the original design.","examples":[{"sentence":"The mint decided to restrike the popular coin due to high demand from collectors.","translation":"造幣局は収集家からの高い需要により、その人気コインを再鋳造することを決定した。"},{"sentence":"The restruck coins were marked with a small symbol to distinguish them from the originals.","translation":"再鋳造されたコインは、オリジナルと区別するために小さなシンボルでマークされた。"}],"collocations":["restrike a coin","restrike in silver","restrike in gold"],"synonyms":["remint","reproduce","recast"],"antonyms":["original mint"]}],"etymology":{"value":"The word 'restrike' is formed by combining the prefix 're-' (meaning again) with the word 'strike' (referring to the act of minting or striking a coin).","priority":"★★☆"},"pronunciation":{"ipa":"/riːˈstraɪks/","syllables":"re-strikes"},"inflection":{"noun_plural":"Restrikes","verb_forms":{"present_simple":["restrike","restrikes"],"past_simple":"restruck","past_participle":"restruck","present_participle":"restriking"}},"usage_notes":{"explanation":"'Restrikes' generally refer to coins that are minted again, often using the original dies or newly made dies of the original design. These are usually produced for collectors or as commemorative items. They are not the same as regular circulation coins.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The restrikes are same value as original.","correct":"✓ The restrikes are not the same value as the originals.","note":"Restrikes typically have a different value than the original coins, often lower, unless they are very rare or historically significant."},{"incorrect":"✗ He restriked the coin with his hammer.","correct":"✓ The mint restruck the coin.","note":"Restriking is usually done by an official mint, not by individuals using tools like a hammer."}],"priority":"★★☆"},"related_words":{"derivatives":["restruck","restriking"],"related_terms":["mint","coin","die","numismatics","reproduction","replica"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Restrikes' are coins that have been minted again, often long after the original issue. These are usually made for collectors and are not the same as regular coins in circulation. The term is used in numismatics, the study or collection of coins and medals."},"example_sentences":[{"sentence":"The museum has a collection of restrikes from various historical periods.","translation":"その博物館には、さまざまな歴史的時代の再鋳貨のコレクションがある。","type":"noun","meaning_category":"再鋳貨"},{"sentence":"The mint decided to restrike the commemorative coin due to its popularity.","translation":"造幣局は、その記念コインの人気のため、再鋳造することを決定した。","type":"verb","meaning_category":"再鋳造する"}]}