{"word":"Euphemization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"婉曲法、婉曲表現、婉曲化","english_definition":"The substitution of a mild, indirect, or vague term for one thought to be offensive, harsh, or blunt. The process of making something sound less unpleasant or offensive.","examples":[{"sentence":"Euphemization is often used when discussing death or bodily functions.","translation":"婉曲法は、死や身体機能について議論する際にしばしば用いられる。"},{"sentence":"The euphemization of 'passed away' for 'died' is a common example.","translation":"「死んだ」の婉曲表現としての「亡くなった」は一般的な例である。"},{"sentence":"Political discourse often involves euphemization to soften controversial policies.","translation":"政治的な議論では、物議を醸す政策を和らげるために婉曲表現がよく用いられる。"}],"collocations":["use euphemization","common euphemization","political euphemization","linguistic euphemization"],"synonyms":["circumlocution","understatement","genteelism","diplomacy","softening","mitigation"],"antonyms":["dysphemism","cacophemism","directness","bluntness","frankness","confrontation"]}],"etymology":{"value":"From 'euphemize' + '-ation'. 'Euphemize' is derived from 'euphemism', which comes from the Greek word 'euphemismos' (εὐφημισμός), meaning 'the use of words of good omen', from 'eu-' (εὖ) meaning 'well' and 'pheme' (φήμη) meaning 'speech, report, fame'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjuːfəmɪˈzeɪʃən/","syllables":"Eu-phe-mi-za-tion"},"inflection":{"noun_plural":"Euphemizations"},"usage_notes":{"explanation":"'Euphemization' refers to the process or act of using euphemisms. It's a linguistic strategy employed to avoid direct or offensive language. The term is often used in discussions of language, rhetoric, and social communication. It is important to note that while euphemisms can serve to be polite or sensitive, they can also be used to obscure or mislead.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used euphemization to insult her.","correct":"✓ He used euphemism to avoid insulting her.","note":"Euphemization is the *process* of using euphemisms, not the euphemism itself. The sentence should reflect the intention to avoid offense, not to cause it."},{"incorrect":"✗ The euphemization was very direct.","correct":"✓ The euphemism was very indirect.","note":"Euphemisms, by definition, are indirect. A direct statement would not be a euphemism or an example of euphemization."}],"priority":"★☆☆"},"related_words":{"derivatives":["euphemism (noun): A mild or indirect word or expression substituted for one considered to be too harsh or blunt.","euphemistic (adjective): Characterized by or using euphemisms.","euphemize (verb): To substitute a mild, indirect, or vague term for one thought to be offensive, harsh, or blunt."],"related_concepts":["taboo","political correctness","doublespeak","spin","rhetoric","linguistics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Specialized vocabulary related to linguistics and rhetoric.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Euphemization' is a relatively advanced term referring to the act of substituting unpleasant or offensive language with more mild or indirect terms. It is often used in discussions about language, politics, and social norms. Understanding the concept requires familiarity with abstract language and an awareness of social sensitivities. The word itself is not commonly used in everyday conversation, but the concept is relevant to understanding how language is used to shape perception and avoid conflict."},"example_sentences":[{"sentence":"The politician's speech was full of euphemization, making it difficult to understand his true intentions.","translation":"その政治家の演説は婉曲表現に満ちており、彼の真意を理解することを困難にしていた。","type":"noun","meaning_category":"婉曲表現の使用"},{"sentence":"The company engaged in euphemization to downplay the severity of the environmental damage.","translation":"その会社は、環境被害の深刻さを矮小化するために婉曲表現を用いた。","type":"noun","meaning_category":"婉曲化の行為"},{"sentence":"Euphemization can be a tool for both politeness and deception.","translation":"婉曲法は、丁寧さのためにも欺瞞のためにもなりうる。","type":"noun","meaning_category":"婉曲法の機能"}]}