{"word":"nucleated","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"核を持つ、核形成された","english_definition":"Having a nucleus or nuclei; having undergone nucleation.","examples":[{"sentence":"The nucleated cells were easily visible under the microscope.","translation":"核を持つ細胞は顕微鏡下で容易に観察できた。"},{"sentence":"The nucleated ice crystals grew rapidly in the supercooled liquid.","translation":"核形成された氷の結晶は、過冷却された液体中で急速に成長した。"}],"collocations":["nucleated cell","nucleated crystal","nucleated settlement"],"synonyms":["cored","centered"],"antonyms":["anucleate","non-nucleated"]},{"part_of_speech":"verb","definition":"nucleateの過去分詞・過去形","english_definition":"Past participle and past tense of the verb 'nucleate'.","examples":[{"sentence":"The solution was nucleated by the addition of seed crystals.","translation":"種結晶の添加により、溶液は核形成された。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the verb 'nucleate', which comes from the Latin 'nucleus' (kernel, nut, core).","priority":"★★★"},"pronunciation":{"ipa":"/ˈnjuːklieɪtɪd/","syllables":"nu-cle-a-ted"},"inflection":{"notes":"Adjective and verb form."},"usage_notes":{"explanation":"'Nucleated' primarily describes something that possesses a nucleus or has undergone the process of nucleation. In biology, it refers to cells or other structures containing a nucleus. In materials science, it describes the formation of a new phase (like crystals) around a central point (nucleus). The meaning is generally technical and specific to the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The city is nucleated.","correct":"The city has a nucleated settlement pattern.","note":"While 'nucleated' can describe a settlement pattern, it requires more context. Saying a city *is* nucleated is vague. Specifying the settlement pattern provides clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["nucleate (verb)","nucleation (noun)","nucleus (noun)","anucleate (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nucleated' is a technical term primarily used in scientific contexts, such as biology and materials science. It describes something that has a nucleus (a central point or core) or has undergone the process of nucleation (the formation of a new phase around a central point). Understanding this word requires familiarity with scientific concepts. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The biologist examined the nucleated red blood cells under the microscope.","translation":"生物学者は顕微鏡で核を持つ赤血球を観察した。","type":"adjective","meaning_category":"核を持つ (biology)"},{"sentence":"The polymer solution was nucleated by adding a small amount of a seeding agent.","translation":"ポリマー溶液は、少量の種晶剤を加えることによって核形成された。","type":"verb (past participle)","meaning_category":"核形成された (materials science)"}]}