{"word":"Whiggishly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"ホイッグ党員らしく、ホイッグ党の主義に基づいて","english_definition":"In a manner characteristic of the Whigs or their principles; in accordance with Whiggism.","examples":[{"sentence":"He argued Whiggishly for the expansion of parliamentary power.","translation":"彼はホイッグ党員らしく、議会の権力拡大を主張した。"},{"sentence":"The essay was written Whiggishly, emphasizing individual liberties and limited government.","translation":"そのエッセイはホイッグ党の主義に基づいて書かれ、個人の自由と制限された政府を強調していた。"}],"collocations":["argue Whiggishly","write Whiggishly","think Whiggishly","behave Whiggishly"],"synonyms":["liberally","progressively","reform-mindedly"],"antonyms":["conservatively","Toryishly"]},{"part_of_speech":"adverb","definition":"(歴史的に) 17世紀から19世紀にかけてのイギリスのホイッグ党の支持者のように","english_definition":"(Historically) In the manner of a supporter of the British Whig party of the 17th to 19th centuries.","examples":[{"sentence":"The novel portrayed the protagonist as acting Whiggishly, championing the rights of the common man.","translation":"その小説は、主人公をホイッグ党員らしく、一般の人々の権利を擁護する人物として描いた。"}],"collocations":["act Whiggishly","portray Whiggishly"],"synonyms":["in a Whig manner","like a Whig"],"antonyms":["in a Tory manner"]}],"etymology":{"value":"Formed from \"Whiggish\" + \"-ly\". \"Whiggish\" is derived from \"Whig,\" referring to the British political faction or party.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɪɡɪʃli/","syllables":"Whig-gish-ly"},"inflection":{"notes":"Adverb - no inflection."},"usage_notes":{"explanation":"\"Whiggishly\" describes actions, arguments, or writings that align with the principles of Whiggism. This often involves advocating for parliamentary power, individual liberties, and limited government. The term is most relevant in historical contexts, particularly when discussing British politics from the 17th to 19th centuries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He Whiggishly supported the monarchy.","correct":"✓ He supported the monarchy.","note":"Supporting the monarchy would be antithetical to Whiggish principles, which often favored limiting royal power."}],"priority":"★☆☆"},"related_words":{"derivatives":["Whig (noun)","Whiggish (adjective)","Whiggism (noun)"],"related_terms":["Tory (noun)","Toryishly (adverb)","Liberal (noun/adjective)","Conservative (noun/adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"Whiggishly\" is a specialized term related to British political history. Understanding it requires familiarity with the Whig party and its principles, which included advocating for parliamentary power, individual liberties, and limited government. The word is rarely used outside of academic or historical contexts."},"example_sentences":[{"sentence":"The historian analyzed the documents, noting how the author argued Whiggishly for greater representation in Parliament.","translation":"歴史家は文書を分析し、著者がいかにホイッグ党員らしく議会でのより大きな代表権を主張したかを指摘した。","type":"adverb","meaning_category":"ホイッグ党の主義に基づいて"},{"sentence":"The politician's speech was delivered Whiggishly, emphasizing the importance of civic virtue and public service.","translation":"政治家の演説はホイッグ党員らしく行われ、市民の徳と公共への奉仕の重要性を強調していた。","type":"adverb","meaning_category":"ホイッグ党の主義に基づいて"}]}