{"word":"cryogenic-durable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"極低温に耐える、極低温下でも耐久性がある","english_definition":"Able to withstand extremely low temperatures without degradation or failure.","examples":[{"sentence":"The cryogenic-durable seals prevented leakage of the liquid nitrogen.","translation":"その極低温耐久性シールは、液体窒素の漏れを防いだ。"},{"sentence":"Cryogenic-durable materials are essential for space exploration.","translation":"極低温耐久性材料は、宇宙探査に不可欠である。"},{"sentence":"The new alloy is designed to be cryogenic-durable for use in superconducting magnets.","translation":"その新しい合金は、超伝導磁石での使用のために極低温耐久性を持つように設計されている。"}],"collocations":["cryogenic-durable material","cryogenic-durable seal","cryogenic-durable container","cryogenic-durable adhesive"],"synonyms":["cryogenic-resistant","low-temperature resistant","cold-resistant"],"antonyms":["cryogenic-sensitive","temperature-sensitive"]}],"etymology":{"value":"The word is formed by combining \"cryogenic\" (relating to very low temperatures) with \"durable\" (able to withstand wear, pressure, or damage).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkraɪoʊˈdʒɛnɪk ˈdjʊərəbəl/","syllables":"cry-o-gen-ic-du-ra-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative degrees (more cryogenic-durable, most cryogenic-durable)."},"usage_notes":{"explanation":"This term is typically used in scientific, engineering, and industrial contexts where materials are exposed to extremely low temperatures (typically below -150°C or -238°F). It describes the ability of a material or component to maintain its structural integrity and functionality under such conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The material is cryogenic durable.","correct":"✓ The material is cryogenic-durable.","note":"The hyphen is important to correctly combine the two words into a single adjective. "},{"incorrect":"✗ cryogenic durability","correct":"✓ cryogenic-durability","note":"When used as a noun, the hyphen is also needed."}],"priority":"★★☆"},"related_words":{"derivatives":["cryogenics (noun: the branch of physics dealing with the production and effects of very low temperatures)","durability (noun: the ability to withstand wear, pressure, or damage)"],"phrasal_verbs":[],"related_terms":["cryogenic","durable","low temperature","material science","engineering","superconductivity","space exploration"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in technical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'cryogenic-durable' is a technical adjective used to describe materials that can withstand extremely low temperatures without failing. It's commonly used in fields like aerospace, materials science, and engineering where components must operate in cryogenic environments. The term implies a high level of reliability and resistance to the damaging effects of extreme cold. Understanding this term requires familiarity with both the concept of cryogenics (very low temperatures) and durability (ability to last)."},"example_sentences":[{"sentence":"The rocket's fuel tanks are made of a cryogenic-durable aluminum alloy.","translation":"ロケットの燃料タンクは、極低温耐久性のあるアルミニウム合金で作られている。","type":"adjective","meaning_category":"material property"},{"sentence":"Testing confirmed that the adhesive was cryogenic-durable and maintained its bond strength at liquid helium temperatures.","translation":"試験により、その接着剤が極低温耐久性があり、液体ヘリウム温度でも接着強度を維持することが確認された。","type":"adjective","meaning_category":"material property"},{"sentence":"The cryogenic-durable sensors are used to monitor temperature within the superconducting magnet.","translation":"極低温耐久性センサーは、超伝導磁石内の温度を監視するために使用される。","type":"adjective","meaning_category":"component property"}]}