{"word":"alcohol-resistant","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アルコール耐性のある、耐アルコール性の","english_definition":"Able to withstand or resist the effects of alcohol.","examples":[{"sentence":"This surface is alcohol-resistant, so it's easy to clean with disinfectant wipes.","translation":"この表面はアルコール耐性があるので、消毒用ウェットティッシュで簡単に掃除できます。"},{"sentence":"We need to use alcohol-resistant materials in the lab to prevent damage from spills.","translation":"こぼれによる損傷を防ぐために、実験室ではアルコール耐性のある材料を使用する必要があります。"}],"collocations":["alcohol-resistant coating (耐アルコール性コーティング)","alcohol-resistant material (耐アルコール性材料)","alcohol-resistant surface (耐アルコール性表面)","alcohol-resistant ink (耐アルコール性インク)"],"synonyms":["alcohol-proof","alcohol-tolerant"],"antonyms":["alcohol-sensitive","alcohol-vulnerable"]}],"etymology":{"value":"'Alcohol' + 'resistant'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌælkəhɔl rɪˈzɪstənt/","syllables":"al-co-hol re-sis-tant"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Alcohol-resistant' is used to describe materials or substances that are not easily damaged or affected by alcohol. It is often used in contexts where frequent cleaning with alcohol-based disinfectants is necessary, such as in healthcare settings or laboratories.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This plastic is resist alcohol.","correct":"✓ This plastic is alcohol-resistant.","note":"'Resist' is a verb. The adjective form 'alcohol-resistant' is needed to describe the property of the plastic."}],"priority":"★★★"},"related_words":{"derivatives":["resistance (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The term 'alcohol-resistant' is relatively straightforward. It describes something that doesn't easily degrade or get damaged when exposed to alcohol. You'll often find it used in technical contexts, like describing the properties of certain plastics, coatings, or cleaning products. It's a compound adjective, formed by combining 'alcohol' and 'resistant'."},"example_sentences":[{"sentence":"The new phone screen has an alcohol-resistant coating to prevent damage from hand sanitizers.","translation":"新しい電話の画面には、手指消毒剤による損傷を防ぐための耐アルコール性コーティングが施されています。","type":"example","meaning_category":"general"},{"sentence":"The lab benches are made of an alcohol-resistant material that can withstand frequent cleaning.","translation":"実験台は、頻繁な清掃に耐えられるアルコール耐性のある素材で作られています。","type":"example","meaning_category":"technical"}]}