{"word":"inflation-resistant","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"インフレに強い、インフレの影響を受けにくい","english_definition":"Able to maintain its value or purchasing power during periods of inflation.","examples":[{"sentence":"Investing in inflation-resistant assets is a good strategy during times of economic uncertainty.","translation":"経済が不安定な時期には、インフレに強い資産に投資するのが良い戦略です。"},{"sentence":"Real estate is often considered an inflation-resistant investment.","translation":"不動産はしばしばインフレに強い投資とみなされます。"},{"sentence":"The company's inflation-resistant pricing strategy helped it maintain profitability.","translation":"同社のインフレに強い価格設定戦略は、収益性の維持に役立ちました。"}],"collocations":["inflation-resistant assets","inflation-resistant investments","inflation-resistant bonds","inflation-resistant strategy","inflation-resistant portfolio"],"synonyms":["inflation-proof","hedge against inflation","protected from inflation"],"antonyms":["inflation-vulnerable","susceptible to inflation","inflation-sensitive"]}],"etymology":{"value":"The term is formed by combining 'inflation' (a general increase in prices and fall in the purchasing value of money) with 'resistant' (offering resistance; not susceptible or affected by).","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˌfleɪʃən rɪˈzɪstənt/","syllables":"in-fla-tion-re-sis-tant"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Inflation-resistant' is commonly used in financial and economic contexts to describe investments, assets, or strategies that are expected to hold their value or even increase in value during periods of inflation. It implies a degree of protection against the erosion of purchasing power caused by rising prices.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The product is inflation-resistance.","correct":"✓ The product is inflation-resistant.","note":"'Resistance' is a noun, while 'resistant' is the adjective form needed to describe something that resists inflation."},{"incorrect":"✗ This stock is very inflation-resist.","correct":"✓ This stock is very inflation-resistant.","note":"'Resist' is a verb. The adjective 'resistant' is needed to describe the stock."}],"priority":"★★☆"},"related_words":{"derivatives":["inflation","resistance","resist"],"phrasal_verbs":[],"related_terms":["hedge","deflation","stagflation","purchasing power","consumer price index (CPI)"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in financial and economic discussions.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'inflation-resistant' describes something that is able to maintain its value even when the general price level in an economy is rising (inflation). This term is frequently used in the context of investments and financial planning, referring to assets that are expected to hold or increase their value despite the effects of inflation. Understanding this term requires familiarity with basic economic concepts.","priority":"★★★"},"example_sentences":[{"sentence":"Treasury Inflation-Protected Securities (TIPS) are designed to be inflation-resistant.","translation":"物価連動国債（TIPS）はインフレに強いように設計されています。","type":"adjective","meaning_category":"インフレに強い"},{"sentence":"Commodities like gold and silver are often seen as inflation-resistant stores of value.","translation":"金や銀などの商品は、インフレに強い価値の貯蔵庫と見なされることがよくあります。","type":"adjective","meaning_category":"インフレに強い"},{"sentence":"An inflation-resistant investment strategy can help protect your savings.","translation":"インフレに強い投資戦略は、貯蓄を守るのに役立ちます。","type":"adjective","meaning_category":"インフレに強い"}]}