{"word":"municipalized","priority":"N/A","meanings":[{"part_of_speech":"verb (past participle)","definition":"(過去分詞) 市営化された、公営化された","english_definition":"(past participle) transferred from private to municipal or public ownership or control.","examples":[{"sentence":"The water supply was municipalized in the early 20th century.","translation":"水道は20世紀初頭に市営化されました。"},{"sentence":"After the war, many industries were municipalized.","translation":"戦後、多くの産業が公営化されました。"}],"collocations":["municipalized industry","municipalized service"],"synonyms":["nationalized","publicized","state-owned"],"antonyms":["privatized"],"related_words":["municipalize (verb)","municipality (noun)"]}],"etymology":{"value":"The word 'municipalized' comes from 'municipalize', which is formed from 'municipal' (relating to a city or town) + '-ize' (a suffix indicating to make something into).","priority":"N/A"},"pronunciation":{"ipa":"/mjuːˈnɪsɪpəlaɪzd/","syllables":"mu-nic-i-pal-ized"},"inflection":{"verb_forms":{"present_simple":["municipalize","municipalizes"],"past_simple":"municipalized","past_participle":"municipalized","present_participle":"municipalizing"}},"usage_notes":{"explanation":"'Municipalized' is the past participle and past tense of the verb 'municipalize'. It describes something that has been transferred from private ownership to ownership by a municipality (city or town) or other public body. This often refers to essential services like water, electricity, or transportation.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The company is municipalized.","correct":"The company was municipalized.","note":"Use the past tense 'was municipalized' to indicate that the action of municipalization has already occurred. 'Is municipalized' implies a continuous state, which is less common."}],"priority":"N/A"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'municipalized' refers to the act of transferring ownership of something, typically a service or industry, from private hands to the control of a municipality, which is a city or town government. It's often used in historical or political contexts when discussing changes in ownership structures. The word is relatively uncommon in everyday conversation but may appear in academic or journalistic writing about economics or public policy."},"example_sentences":[{"sentence":"The city's public transportation system was municipalized to improve service and accessibility.","translation":"市の公共交通機関は、サービスとアクセシビリティを向上させるために市営化されました。","type":"verb (past participle)","meaning_category":"公営化された"},{"sentence":"Many European countries municipalized their healthcare systems after World War II.","translation":"第二次世界大戦後、多くのヨーロッパ諸国が医療制度を公営化しました。","type":"verb (past participle)","meaning_category":"公営化された"}]}