{"word":"fetas","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"フェタチーズ（Feta cheese）の複数形","english_definition":"plural of feta cheese; a salty, crumbly Greek cheese made from sheep's milk or a mixture of sheep's and goat's milk.","examples":[{"sentence":"We bought several different types of fetas at the market.","translation":"私たちは市場でいくつかの種類のフェタチーズを買いました。"},{"sentence":"The salad included a variety of imported fetas.","translation":"そのサラダには様々な輸入されたフェタチーズが含まれていました。"}],"collocations":["Greek fetas","imported fetas","different types of fetas"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Feta' comes from the Italian word 'fetta' meaning 'slice'. The name was adopted in the 17th century, referring to the way the cheese is cut and stored.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɛtəz/","syllables":"fe-tas"},"inflection":{"noun_plural":"fetas"},"usage_notes":{"explanation":"'Fetas' is simply the plural form of 'feta cheese'. Since 'feta' is often considered a mass noun, it's more common to say 'types of feta' or 'varieties of feta' rather than 'fetas'. However, 'fetas' can be used to refer to different kinds or brands of feta cheese.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I like feta very much. I eat fetas every day.","correct":"✓ I like feta very much. I eat feta every day. / ✓ I like feta very much. I eat different types of feta every day.","note":"When referring to feta in general, use the singular form 'feta'. Use 'fetas' when referring to different kinds or brands."}],"priority":"★★☆"},"related_words":{"derivatives":["feta (singular form)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Fetas' is a plural noun referring to different types or varieties of feta cheese. Feta cheese is a traditional Greek cheese made from sheep's milk or a mixture of sheep's and goat's milk. It's often used in salads, pastries, and other Mediterranean dishes. The term 'fetas' is less common than 'feta,' which is often treated as a mass noun. However, 'fetas' is appropriate when discussing multiple distinct types of feta cheese."},"example_sentences":[{"sentence":"The store offers a selection of artisanal **fetas** from local farms.","translation":"その店では、地元の農場産の職人技が光るフェタチーズを各種取り揃えています。","type":"noun","meaning_category":"種類"},{"sentence":"We compared the flavors of several **fetas** to find the best one for the recipe.","translation":"レシピに最適なものを見つけるために、いくつかのフェタチーズの味を比較しました。","type":"noun","meaning_category":"種類"}]}