{"word":"gonochorism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"雌雄異体性、単性生殖","english_definition":"The state of having only one of at least two distinct sexes in any one individual organism.","examples":[{"sentence":"Gonochorism is common in mammals and birds.","translation":"雌雄異体性は哺乳類や鳥類では一般的です。"},{"sentence":"Many insects exhibit gonochorism.","translation":"多くの昆虫は雌雄異体性を示します。"}],"collocations":["exhibit gonochorism","display gonochorism","gonochoristic species"],"synonyms":["dioecy","unisexuality"],"antonyms":["hermaphroditism","simultaneous hermaphroditism","sequential hermaphroditism"]}],"etymology":{"value":"From Ancient Greek γονή (gonḗ, \"seed, generation\") + χωρίζω (khōrízō, \"to divide, separate\") + -ισμός (-ismós, suffix denoting a condition or doctrine).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡɒnəˈkɔːrɪzəm/","syllables":"gon-o-cho-rism"},"inflection":{"noun_plural":"gonochorisms"},"usage_notes":{"explanation":"Gonochorism refers to the condition where individual organisms are either male or female throughout their lives. It is a fundamental concept in biology, particularly in the study of reproduction and sexual differentiation. The term is often used in contrast to hermaphroditism, where individuals possess both male and female reproductive organs, either simultaneously or sequentially.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Gonochorism means that an organism can change sex during its lifetime.","correct":"✓ Gonochorism means that an organism has a fixed sex throughout its lifetime.","note":"Gonochorism implies a fixed sex, unlike sequential hermaphroditism where sex change occurs."},{"incorrect":"✗ Gonochorism is the same as asexual reproduction.","correct":"✓ Gonochorism is a form of sexual reproduction where individuals are either male or female.","note":"Gonochorism involves two distinct sexes, which is characteristic of sexual reproduction, not asexual reproduction."}],"priority":"★☆☆"},"related_words":{"derivatives":["gonochoristic (adjective)"],"related_terms":["hermaphroditism","dioecious","monoecious"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gonochorism' is a technical term used in biology to describe species where individuals are either male or female throughout their lives. This term is typically encountered in scientific literature, particularly in the fields of zoology, botany, and ecology. Understanding gonochorism requires a basic knowledge of reproductive biology and sexual differentiation. It is often contrasted with hermaphroditism, where individuals have both male and female reproductive organs.","priority":"★☆☆"},"example_sentences":[{"sentence":"The study focused on the genetic mechanisms underlying gonochorism in this fish species.","translation":"その研究は、この魚種における雌雄異体性の根底にある遺伝的メカニズムに焦点を当てていた。","type":"scientific","meaning_category":"general"},{"sentence":"Gonochorism ensures genetic diversity through sexual reproduction.","translation":"雌雄異体性は、有性生殖を通じて遺伝的多様性を保証する。","type":"biological","meaning_category":"general"},{"sentence":"In species with gonochorism, sex determination is often influenced by chromosomes or environmental factors.","translation":"雌雄異体性を持つ種では、性決定はしばしば染色体または環境要因の影響を受ける。","type":"biological","meaning_category":"general"}]}