{"word":"unscavenged","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"清掃されていない、あさられていない、漁られていない","english_definition":"Not scavenged; not searched through and cleared of useful or valuable items.","examples":[{"sentence":"The battlefield remained unscavenged for days after the conflict.","translation":"その戦場は紛争後数日間、清掃されずに残された。"},{"sentence":"The area was left unscavenged, leaving valuable resources behind.","translation":"その地域は漁られずに放置され、貴重な資源が残された。"}],"collocations":["unscavenged battlefield","unscavenged resources","unscavenged remains"],"synonyms":["uncollected","unreclaimed","unsearched","unpicked"],"antonyms":["scavenged","collected","reclaimed","searched","picked"]}],"etymology":{"value":"Prefix 'un-' (not) + 'scavenged' (past participle of 'scavenge'). 'Scavenge' comes from Middle English 'scavage,' meaning 'customs duty on goods exposed for sale,' from Old North French 'escavage,' from 'escauwer' (to inspect). The meaning shifted over time to mean searching through discarded materials.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈskævɪndʒd/","syllables":"un-scav-enged"},"inflection":{"notes":"Adjective; no plural form."},"usage_notes":{"explanation":"'Unscavenged' describes something that has not been searched through for useful or valuable items, often implying that it remains untouched or unexploited. It is frequently used in contexts where resources are scarce, or after events that leave behind debris or valuable materials.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unscavenged animal was left to rot.","correct":"✓ The unscavenged carcass was left to rot.","note":"'Unscavenged' refers to the location or items, not the animal itself. It's the carcass (dead body) that is unscavenged, not the live animal."},{"incorrect":"✗ The room was unscavenged of its furniture.","correct":"✓ The room was unscavenged; its furniture remained untouched.","note":"'Unscavenged' describes the state of the place, not what was removed. To describe removing items, use 'scavenged' or a similar verb."}],"priority":"★★☆"},"related_words":{"derivatives":["scavenge (verb)","scavenger (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unscavenged' is a relatively rare and specific word, typically used in contexts involving resource scarcity, post-disaster scenarios, or historical settings where scavenging might occur. It indicates that a place or collection of items has not been searched for usable materials."},"example_sentences":[{"sentence":"The wreckage of the plane lay unscavenged in the remote mountains.","translation":"その飛行機の残骸は、人里離れた山の中で漁られることなく横たわっていた。","type":"adjective","meaning_category":"清掃されていない"},{"sentence":"Despite the poverty in the region, some areas remained surprisingly unscavenged.","translation":"その地域では貧困にもかかわらず、驚くほど漁られていない場所もあった。","type":"adjective","meaning_category":"あさられていない"}]}