{"word":"Phallaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"スッポンタケ科","english_definition":"a family of fungi in the order Phallales; commonly known as stinkhorn mushrooms.","examples":[{"sentence":"Phallaceae are known for their foul odor, which attracts insects to help disperse their spores.","translation":"スッポンタケ科は、胞子を散布するために昆虫を引き寄せる悪臭で知られています。"}],"collocations":["stinkhorn mushrooms","fungal family"],"synonyms":["stinkhorns"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Phallus' (Latin for 'penis'), referring to the shape of the fruiting bodies of many species in this family, combined with the suffix '-aceae', which denotes a family in biological taxonomy.","priority":"★★☆"},"pronunciation":{"ipa":"/fəˈleɪsiː/","syllables":"Phal-la-ce-ae"},"inflection":{"noun_plural":"Phallaceae (though often used as a singular collective noun)"},"usage_notes":{"explanation":"'Phallaceae' refers specifically to the family of fungi that includes stinkhorn mushrooms. These fungi are characterized by their distinctive phallic shape and strong, unpleasant odor. The term is primarily used in mycological and botanical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Phallaceae in my garden, it was a beautiful flower.","correct":"✓ I saw a Phallaceae in my garden, it was a strange-looking fungus.","note":"Phallaceae are fungi, not flowers. They are known for their unusual shapes and foul smell."}],"priority":"★☆☆"},"related_words":{"derivatives":["Phallus (genus)","Phallales (order)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency (scientific/technical contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Phallaceae' is a technical term used in mycology (the study of fungi). It refers to a specific family of fungi characterized by their phallic shape and strong odor. Understanding this term requires a background in biology or mycology. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The distinctive morphology of the fruiting body is a key characteristic of the fungi belonging to the **Phallaceae**.","translation":"子実体の独特な形態は、スッポンタケ科に属する菌類の重要な特徴です。","type":"noun","meaning_category":"fungal family"},{"sentence":"Species within the **Phallaceae** often play a role in nutrient cycling within forest ecosystems.","translation":"スッポンタケ科の種は、森林生態系内の栄養循環においてしばしば役割を果たします。","type":"noun","meaning_category":"fungal family"}]}