{"word":"unsmoothable","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"Not capable of being smoothed; resistant to becoming smooth.","english_definition":"Not able to be made smooth; having a texture or quality that prevents it from becoming smooth.","examples":[{"sentence":"The rough concrete surface was unsmoothable, no matter how much he tried to polish it.","translation":"その粗いコンクリートの表面は、どれだけ磨こうとしても滑らかにすることができなかった。"},{"sentence":"Due to its inherent texture, the material remained unsmoothable even after extensive processing.","translation":"その固有の質感のために、その素材は広範囲な加工後も滑らかにすることができなかった。"}],"collocations":["unsmoothable surface","unsmoothable material","unsmoothable texture"],"synonyms":["unpolishable","unflattenable","unlevelable"],"antonyms":["smoothable","polishable","flattenable","levelable"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) and the suffix '-able' (capable of being) to the word 'smooth'.","priority":"low"},"pronunciation":{"ipa":"ʌnˈsmuːðəbəl","syllables":"un-smooth-a-ble"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns."},"usage_notes":{"explanation":"'Unsmoothable' is a relatively uncommon word, primarily used in technical or descriptive contexts where the inability to smooth a surface or material is relevant. It often implies that the inherent properties of the object prevent it from becoming smooth.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The plastic was unsmooth.","correct":"The plastic was unsmoothable. / The plastic was not smooth.","note":"'Unsmooth' is a less precise term. 'Unsmoothable' specifically implies that it cannot be made smooth, whereas 'unsmooth' simply means it is not smooth at the moment."}],"priority":"low"},"related_words":{"derivatives":["smooth","smoothable","smoothly","smoothness","unsmooth"],"related_terms":["rough","texture","polish","flatten","level"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"low"},"readability_explanation":{"level":"C1","text":"'Unsmoothable' is a relatively rare and technical term. It describes something that cannot be made smooth. The word is formed from 'smooth' with the addition of the prefix 'un-' (meaning 'not') and the suffix '-able' (meaning 'capable of being'). Therefore, 'unsmoothable' means 'not capable of being smoothed'. It is typically used in contexts where the properties of a material or surface are being discussed, particularly when those properties prevent it from being made smooth through processes like polishing or flattening."},"example_sentences":[{"sentence":"The artist discovered that the canvas was unsmoothable due to its coarse weave.","translation":"アーティストは、そのキャンバスが粗い織りのために滑らかにすることができないことに気づいた。","type":"descriptive","meaning_category":"inability to smooth"},{"sentence":"Despite repeated attempts, the metal alloy remained unsmoothable.","translation":"繰り返しの試みにもかかわらず、その金属合金は滑らかにすることができなかった。","type":"technical","meaning_category":"material property"}]}