{"word":"Undeceivability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality or state of being unable to be deceived; the capacity to resist deception.","english_definition":"The quality or state of being undeceivable; the capacity to resist deception.","examples":[{"sentence":"His undeceivability made him an excellent judge of character.","translation":"彼の欺瞞に屈しない性質が、彼を優れた人物鑑定家にした。"},{"sentence":"The software's undeceivability was tested rigorously by cybersecurity experts.","translation":"そのソフトウェアの欺瞞耐性は、サイバーセキュリティ専門家によって厳格にテストされた。"}],"collocations":["high undeceivability","inherent undeceivability","prove undeceivability"],"synonyms":["invulnerability to deception","resistance to deceit","impenetrability to fraud"],"antonyms":["deceivability","gullibility","credulity"]}],"etymology":{"value":"Formed from \"undeceivable\" (not able to be deceived) + \"-ity\" (suffix denoting a state or quality).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌndɪˌsiːvəˈbɪlɪti/","syllables":"un-de-ceiv-a-bil-i-ty"},"inflection":{"noun_plural":"undeceivabilities (rare)"},"usage_notes":{"explanation":"\"Undeceivability\" is a relatively rare and formal term. It refers to the characteristic of something or someone that makes them very difficult or impossible to deceive. It is often used in contexts where security, trust, or reliability are paramount.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undeceivability of the story was obvious.","correct":"✓ The lack of believability of the story was obvious.","note":"\"Undeceivability\" refers to the *ability* to resist deception, not the quality of something that is not deceptive. In this case, \"believability\" or \"credibility\" would be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["undeceivable (adjective)","deceive (verb)","deceit (noun)","deception (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Undeceivability\" is a complex and rare word. It means the quality of not being able to be tricked or deceived. Because it is not commonly used, it is more likely to appear in technical or formal contexts. Understanding the root words \"deceive\" and the prefix \"un-\" helps to understand its meaning."},"example_sentences":[{"sentence":"The key to the system's security lies in its inherent undeceivability.","translation":"そのシステムのセキュリティの鍵は、その固有の欺瞞耐性にある。","type":"general","meaning_category":"General"},{"sentence":"The politician's undeceivability was his greatest asset during negotiations.","translation":"その政治家の欺瞞に屈しない性質は、交渉において彼の最大の武器だった。","type":"general","meaning_category":"General"}]}