{"word":"conventionalization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"慣習化、定型化、因習化","english_definition":"The process by which something becomes conventional or standardized; the act of making something conform to accepted standards or norms.","examples":[{"sentence":"The conventionalization of language can lead to a loss of creativity.","translation":"言語の慣習化は創造性の喪失につながる可能性がある。"},{"sentence":"The conventionalization of scientific methods ensures consistency and reliability.","translation":"科学的方法の慣習化は一貫性と信頼性を保証する。"},{"sentence":"The conventionalization of certain artistic styles can stifle innovation.","translation":"特定の芸術様式の慣習化は革新を抑制する可能性がある。"}],"collocations":["language conventionalization","method conventionalization","artistic conventionalization","social conventionalization"],"synonyms":["standardization","formalization","routinization","institutionalization","habitualization"],"antonyms":["innovation","originality","unconventionality","deviation","nonconformity"]}],"etymology":{"value":"The word is derived from 'conventionalize,' which comes from 'conventional' + '-ize' (to make). 'Conventional' comes from 'convention,' which is from Latin 'conventio' (agreement, assembly).","priority":"★★☆"},"pronunciation":{"ipa":"/kənˌvɛnʃənələˈzeɪʃən/","syllables":"con-ven-tion-al-i-za-tion"},"inflection":{"noun_plural":"conventionalizations"},"usage_notes":{"explanation":"'Conventionalization' refers to the process where practices, ideas, or forms become widely accepted and established as the norm. It can apply to various fields, including language, art, science, and social behavior. The term often carries a connotation of reduced creativity or innovation due to adherence to established patterns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The conventionalization of the new idea was immediate.","correct":"The acceptance of the new idea was immediate.","note":"'Conventionalization' refers to a process that takes time, not an immediate event. Use 'acceptance' or 'adoption' instead."},{"incorrect":"Conventionalization is always a positive thing for progress.","correct":"Conventionalization can sometimes hinder progress.","note":"While conventionalization can provide stability and standardization, it can also stifle innovation and creativity. It's not always positive."}],"priority":"★★☆"},"related_words":{"derivatives":["conventionalize (verb)","conventional (adjective)","convention (noun)","conventionality (noun)"],"antonyms":["unconventional (adjective)","unconventionality (noun)"],"related_concepts":["standardization","normalization","institutionalization","social norms","cultural norms"]},"level_frequency":{"level":"C1-C2","frequency_google_ngram":"Relatively low frequency. More common in academic or specialized texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Conventionalization' is a complex term referring to the process by which something becomes a standard or norm. This often happens over time as ideas, practices, or behaviors are widely adopted and accepted within a society or field. The word is frequently used in academic and theoretical contexts, especially when discussing the evolution of language, art, or social structures. It's important to understand that conventionalization can both stabilize and limit innovation, depending on the context."},"example_sentences":[{"sentence":"The conventionalization of hand gestures varies across cultures.","translation":"手のジェスチャーの慣習化は文化によって異なる。","type":"noun","meaning_category":"慣習化"},{"sentence":"The study examines the conventionalization of online communication practices.","translation":"その研究はオンラインコミュニケーションの実践の慣習化を調査する。","type":"noun","meaning_category":"慣習化"},{"sentence":"The conventionalization of certain narratives in history can lead to biased interpretations.","translation":"歴史における特定の物語の慣習化は、偏った解釈につながる可能性がある。","type":"noun","meaning_category":"慣習化"}]}