{"word":"unfalsified","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"反証されていない、偽りであることが証明されていない","english_definition":"not proven false; not shown to be untrue.","examples":[{"sentence":"The hypothesis remains unfalsified after numerous experiments.","translation":"その仮説は、数多くの実験の後も反証されていない。"},{"sentence":"An unfalsified theory is not necessarily true, but it is consistent with the available evidence.","translation":"反証されていない理論は必ずしも真実であるとは限らないが、利用可能な証拠と矛盾しない。"}],"collocations":["remain unfalsified","an unfalsified hypothesis","an unfalsified theory"],"synonyms":["unrefuted","unproven","uncontested","uninvalidated"],"antonyms":["falsified","refuted","disproven","invalidated"]},{"part_of_speech":"adjective","definition":"(科学哲学において)反証可能性のテストに耐えた","english_definition":"(in the philosophy of science) having survived attempts at falsification.","examples":[{"sentence":"Popper argued that scientific theories should be falsifiable, and the best ones are those that have been rigorously tested and remain unfalsified.","translation":"ポパーは、科学理論は反証可能であるべきであり、最も優れた理論は厳密にテストされ、反証されていないものであると主張した。"}],"collocations":["scientifically unfalsified"],"synonyms":["corroborated","supported by evidence"],"antonyms":["falsifiable","disprovable"]}],"etymology":{"value":"\"un-\" (not) + \"falsified\" (past participle of \"falsify,\" to prove false).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈfɔːlsɪfaɪd/","syllables":"un-fal-si-fied"},"inflection":{"notes":"Adjective; no plural form."},"usage_notes":{"explanation":"The term \"unfalsified\" is primarily used in the context of scientific methodology and philosophy of science, particularly related to Karl Popper's concept of falsifiability. It describes a statement, hypothesis, or theory that has not yet been proven false, despite attempts to do so. Note that being \"unfalsified\" does not mean the statement is necessarily true, only that it is consistent with current evidence and has withstood testing. It is a weaker claim than \"proven\" or \"verified.\"","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unfalsified fact is true.","correct":"✓ The unfalsified hypothesis is consistent with the data.","note":"\"Unfalsified\" applies to hypotheses or theories, not facts. A fact is already considered true. An unfalsified hypothesis is simply one that hasn't been proven false yet."},{"incorrect":"✗ The theory is unfalsified, so it is definitely true.","correct":"✓ The theory is unfalsified, but further testing is needed.","note":"Being unfalsified doesn't guarantee truth. It only means the theory hasn't been disproven yet. Further evidence might still falsify it."}],"priority":"★★☆"},"related_words":{"derivatives":["falsify (verb)","falsification (noun)","falsifiable (adjective)","unfalsifiability (noun)"],"related_concepts":["falsifiability","Popperian falsification","scientific method","hypothesis testing"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unfalsified' is a term mainly used in science and philosophy. It means something hasn't been proven wrong yet. It's important to remember that just because something is 'unfalsified' doesn't mean it's definitely right; it just means we haven't found evidence to disprove it yet. The idea comes from Karl Popper, who said good scientific ideas should be testable and potentially able to be proven false."},"example_sentences":[{"sentence":"Despite numerous attempts to disprove it, the theory of general relativity remains **unfalsified**.","translation":"反証しようとする数多くの試みにもかかわらず、一般相対性理論は反証されていない。","type":"adjective","meaning_category":"not proven false"},{"sentence":"The **unfalsified** hypothesis provided a basis for further research.","translation":"その反証されていない仮説は、さらなる研究の基礎を提供した。","type":"adjective","meaning_category":"not proven false"},{"sentence":"The scientist emphasized that an **unfalsified** claim is not the same as a proven fact.","translation":"その科学者は、反証されていない主張は証明された事実と同じではないことを強調した。","type":"adjective","meaning_category":"not proven false"}]}