{"word":"Aeolic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"エオリス方言の、エオリス風の","english_definition":"Relating to the Aeolic dialect of ancient Greek, or to the Aeolians.","examples":[{"sentence":"Aeolic poetry is known for its lyricism.","translation":"エオリス詩は叙情性で知られている。"},{"sentence":"The Aeolic dialect was spoken in Lesbos.","translation":"エオリス方言はレスボス島で話されていた。"}],"collocations":["Aeolic dialect","Aeolic poetry","Aeolic meter"],"synonyms":["Aeolian"],"antonyms":[]},{"part_of_speech":"noun","definition":"エオリス方言","english_definition":"The Aeolic dialect of ancient Greek.","examples":[{"sentence":"Aeolic is one of the major dialects of ancient Greek.","translation":"エオリス方言は古代ギリシア語の主要な方言の一つである。"}],"collocations":["study of Aeolic","features of Aeolic"],"synonyms":["Aeolian"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek Αἰολικός (Aiolikós), referring to the Aeolians, a group of ancient Greek tribes. Derived from Αἰολία (Aiolía), the region inhabited by the Aeolians.","priority":"★★★"},"pronunciation":{"ipa":"/iːˈɒlɪk/","syllables":"Ae-o-lic"},"inflection":{"notes":"It can be used as both an adjective and a noun. The adjective form doesn't change. The noun form is usually singular, referring to the dialect itself."},"usage_notes":{"explanation":"'Aeolic' refers specifically to the dialect and cultural aspects associated with the Aeolians, an ancient Greek tribe. It's most commonly used in historical or linguistic contexts. The term 'Aeolian' is sometimes used interchangeably, but can also refer more broadly to anything related to the wind (from Aeolus, the Greek god of the winds).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am studying the Aeolian dialect, it is very interesting.","correct":"✓ I am studying the Aeolic dialect, it is very interesting.","note":"Use 'Aeolic' when referring specifically to the dialect of ancient Greek."}],"priority":"★★☆"},"related_words":{"derivatives":["Aeolian (adjective, noun)","Aeolis (noun: a region on Mars named after Aeolia)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Aeolic' is a specialized term primarily used in the context of ancient Greek history and linguistics. It refers to the Aeolic dialect, which was one of the major dialects of ancient Greek. Understanding this word requires familiarity with ancient Greek history and linguistic terminology. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The poems of Sappho are written in the Aeolic dialect.","translation":"サッポーの詩はエオリス方言で書かれている。","type":"adjective","meaning_category":"エオリス方言の"},{"sentence":"Aeolic preserves some archaic features of Proto-Greek.","translation":"エオリス方言は、原始ギリシア語のいくつかの古風な特徴を保持している。","type":"noun","meaning_category":"エオリス方言"}]}