{"word":"redissection","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再解剖、再剖検","english_definition":"The act of dissecting again; a second dissection.","examples":[{"sentence":"The medical examiner ordered a redissection to determine the exact cause of death.","translation":"監察医は正確な死因を特定するために再解剖を命じた。"},{"sentence":"Redissection of the ancient mummy revealed new insights into its life and death.","translation":"古代ミイラの再解剖により、その生涯と死に関する新たな洞察が得られた。"}],"collocations":["order a redissection","perform a redissection","undergo redissection"],"synonyms":["re-dissection","second dissection","reopening","re-examination"],"antonyms":[]}],"etymology":{"value":"The word \"redissection\" is formed by adding the prefix \"re-\" (meaning \"again\" or \"anew\") to the word \"dissection.\" Dissection itself comes from the Latin word \"dissectio,\" which is derived from \"dissecare\" (to cut apart).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːdɪˈsekʃən/","syllables":"re-di-sec-tion"},"inflection":{"noun_plural":"redissections"},"usage_notes":{"explanation":"\"Redissection\" is a relatively uncommon term, primarily used in medical and scientific contexts. It refers to the act of dissecting something (usually a body or organism) for a second or subsequent time. This might be done to re-examine findings, investigate new questions, or correct errors from a previous dissection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The redissection was done by the original doctor.","correct":"✓ The redissection was performed by a different doctor.","note":"Redissection is often performed by a different individual or team to provide a fresh perspective and avoid potential biases. While the original doctor could perform it, it's more common to have someone else do it."},{"incorrect":"✗ The redissection was unnecessary.","correct":"✓ The redissection provided valuable new information.","note":"Redissection is usually conducted when there is a specific reason to re-examine the subject, such as unresolved questions or the discovery of new evidence. Therefore, it is generally not considered unnecessary when properly justified."}],"priority":"★☆☆"},"related_words":{"derivatives":["dissect","dissection","re-","section"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"redissection\" is a specialized term primarily used in medical and scientific contexts. It refers to the act of dissecting something again, typically a body or organism, to re-examine findings or investigate new questions. Understanding this word requires familiarity with the basic concept of dissection and the meaning of the prefix \"re-\". Due to its specific and technical nature, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The professor requested a redissection of the specimen to clarify the anatomical details.","translation":"教授は解剖学的詳細を明らかにするために、標本の再解剖を要求した。","type":"noun","meaning_category":"再解剖"},{"sentence":"Redissection of the crime victim's body revealed previously unnoticed evidence.","translation":"犯罪被害者の遺体の再解剖により、以前は見過ごされていた証拠が明らかになった。","type":"noun","meaning_category":"再解剖"}]}