{"word":"corporate-friendly","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"企業にとって都合の良い、企業に有利な、企業が受け入れやすい","english_definition":"Designed or adapted to be suitable for or favored by corporations; not likely to offend or challenge corporate interests.","examples":[{"sentence":"The new regulations are seen as corporate-friendly, as they reduce taxes for large companies.","translation":"新しい規制は、大企業の税金を軽減するため、企業にとって都合が良いと見られている。"},{"sentence":"The politician promised to create a more corporate-friendly environment to attract investment.","translation":"その政治家は、投資を呼び込むため、より企業に有利な環境を作ると約束した。"},{"sentence":"The website's design is corporate-friendly, with a clean and professional look.","translation":"そのウェブサイトのデザインは、清潔でプロフェッショナルな外観で、企業が受け入れやすい。"}],"collocations":["corporate-friendly policies (企業に有利な政策)","corporate-friendly environment (企業に有利な環境)","corporate-friendly regulations (企業に有利な規制)","corporate-friendly tax laws (企業に有利な税法)","corporate-friendly image (企業に好印象を与えるイメージ)"],"synonyms":["business-friendly","pro-business","company-oriented","industry-friendly"],"antonyms":["anti-corporate","corporate-hostile","unfriendly to business","regulatory"],"notes":"Often used in discussions of politics, economics, and business regulations."}],"etymology":{"value":"Combination of 'corporate' (relating to a corporation) and 'friendly' (having the qualities of a friend; favorable).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɔːrpərət ˈfrɛndli/","syllables":"cor-po-rate-friend-ly"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"'Corporate-friendly' is used to describe something that is beneficial or appealing to corporations. This can include laws, regulations, policies, or even the general atmosphere of a region or country. It often implies a reduction in taxes, fewer regulations, or other measures that make it easier for corporations to operate and make profits. It can also refer to something designed to be inoffensive or acceptable to corporate culture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The government is being very corporate-friend.","correct":"✓ The government is being very corporate-friendly.","note":"'Corporate-friendly' is an adjective, so it should be used to describe a noun. 'Friend' is a noun, not an adjective."},{"incorrect":"✗ This policy is corporate-friend, it will help businesses a lot.","correct":"✓ This policy is corporate-friendly; it will help businesses a lot.","note":"'Corporate-friendly' is an adjective, so it needs to be used correctly to describe the policy."}],"priority":"★★☆"},"related_words":{"derivatives":["corporate (adjective, noun)","friendly (adjective, adverb, noun)"],"related_terms":["business-friendly","pro-business","deregulation","tax cuts","corporate tax","corporate social responsibility (CSR)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent, but commonly used in business and political contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Corporate-friendly' is a compound adjective used to describe something that is advantageous or appealing to corporations. It is often used in discussions of economic policy, regulations, and political climates. Understanding this term requires a grasp of the role and influence of corporations in society, as well as the implications of policies that favor them. It is more commonly encountered in professional or academic contexts dealing with business and economics."},"example_sentences":[{"sentence":"The new tax laws are considered corporate-friendly by many economists.","translation":"多くの経済学者は、新しい税法は企業にとって都合が良いと考えている。","type":"adjective","meaning_category":"企業に有利な"},{"sentence":"The city is trying to create a more corporate-friendly environment to attract new businesses.","translation":"市は新しい企業を誘致するために、より企業に有利な環境を作ろうとしている。","type":"adjective","meaning_category":"企業に有利な"},{"sentence":"Some critics argue that the government's policies are too corporate-friendly and neglect the needs of ordinary citizens.","translation":"政府の政策は企業に有利すぎ、一般市民のニーズを無視していると批判する人もいる。","type":"adjective","meaning_category":"企業に有利な"}]}