{"word":"anthropomorphized","priority":"★☆☆","meanings":[{"part_of_speech":"verb (past participle)","definition":"擬人化された、擬人観で語られた","english_definition":"having been given human characteristics or qualities.","examples":[{"sentence":"The animals in the story were anthropomorphized, each displaying human emotions and behaviors.","translation":"物語の中の動物たちは擬人化され、それぞれが人間の感情や行動を示していた。"},{"sentence":"The author anthropomorphized the trees, giving them the ability to speak and reason.","translation":"著者は木を擬人化し、話したり考えたりする能力を与えた。"},{"sentence":"In many children's books, objects are anthropomorphized to make them more relatable.","translation":"多くの子供向けの本では、物を擬人化して、より親しみやすくしている。"}],"collocations":["anthropomorphized animals","anthropomorphized objects","anthropomorphized characters","heavily anthropomorphized"],"synonyms":["personified","humanized","attributed human traits to"],"antonyms":["dehumanized","objectified"]},{"part_of_speech":"adjective","definition":"擬人化された、擬人観的な","english_definition":"treated or represented as having human form or traits.","examples":[{"sentence":"The anthropomorphized depiction of household appliances in the advertisement was quite amusing.","translation":"広告における家電製品の擬人化された描写は非常に面白かった。"},{"sentence":"The company logo features an anthropomorphized version of their product.","translation":"その会社のロゴは、自社製品を擬人化したバージョンを特徴としている。"},{"sentence":"Many cultures have anthropomorphized deities, giving them human-like qualities and stories.","translation":"多くの文化には、神々を擬人化し、人間のような性質や物語を与えることがある。"}],"collocations":["anthropomorphized deities","anthropomorphized logo","anthropomorphized representation","highly anthropomorphized"],"synonyms":["human-like","personified","humanoid"],"antonyms":["non-human","abstract"]}],"etymology":{"value":"The word 'anthropomorphized' comes from 'anthropomorphism,' which is derived from the Greek words 'anthropos' (meaning 'human') and 'morphe' (meaning 'form'). It literally means 'giving human form.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænθrəpəˈmɔːrfaɪzd/","syllables":"an-thro-po-mor-phaized"},"inflection":{"notes":"This is the past participle and adjective form of the verb 'anthropomorphize.' The base verb is 'anthropomorphize', the present participle is 'anthropomorphizing', and the past simple is 'anthropomorphized'."},"usage_notes":{"explanation":"'Anthropomorphized' is used to describe something that has been given human characteristics, even though it is not human. This can apply to animals, objects, or even abstract concepts. It's often used in literature, art, and marketing to make something more relatable or engaging. The term implies that the non-human entity is not just resembling a human superficially, but is also given human-like emotions, behaviors, and motivations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The story is anthropomorphic about animals.","correct":"✓ The story is anthropomorphic, featuring animals. / ✓ The story anthropomorphizes animals.","note":"'Anthropomorphic' is an adjective describing the story itself, or you can use the verb 'anthropomorphize' to describe the action of giving human traits to the animals."},{"incorrect":"✗ He anthropomorphized with his dog.","correct":"✓ He anthropomorphized his dog.","note":"'Anthropomorphize' is a transitive verb, meaning it takes a direct object. You anthropomorphize something (e.g., an animal, an object), not 'with' it."},{"incorrect":"✗ The car was anthropomorphic. Therefore, it could drive itself.","correct":"✓ The car was anthropomorphized. Therefore, it was depicted as being able to drive itself.","note":"Anthropomorphism is a literary or artistic device. It doesn't actually give non-human entities human abilities, but rather represents them as having those abilities."}],"priority":"★★☆"},"related_words":{"derivatives":["anthropomorphism (noun: the attribution of human characteristics or behavior to a god, animal, or object).","anthropomorphic (adjective: relating to or characterized by anthropomorphism).","anthropomorphize (verb: to attribute human characteristics or behavior to a god, animal, or object)."],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anthropomorphized' means that something that is not human has been given human qualities or characteristics. This term is often used in discussions about literature, art, and cultural representations where animals, objects, or even abstract ideas are portrayed as having human emotions, thoughts, or behaviors. Understanding this word helps in analyzing the deeper meanings and intentions behind such portrayals.","priority":"★★☆"},"example_sentences":[{"sentence":"The toys in the animated movie were cleverly anthropomorphized, each with their own unique personality.","translation":"アニメ映画のおもちゃたちは巧妙に擬人化され、それぞれ独自の個性を持っていた。","type":"adjective","meaning_category":"having human characteristics"},{"sentence":"The director anthropomorphized the natural elements in the film, giving them voices and motivations.","translation":"監督は映画の中で自然の要素を擬人化し、声と動機を与えた。","type":"verb (past participle)","meaning_category":"given human qualities"},{"sentence":"The anthropomorphized animals in the fable taught valuable moral lessons.","translation":"寓話に登場する擬人化された動物たちは、貴重な道徳的教訓を教えてくれた。","type":"adjective","meaning_category":"human-like"}]}