{"word":"metallophone","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"金属製の音板を持つ打楽器","english_definition":"A percussion instrument consisting of tuned metal bars which are struck to produce sounds, typically with a mallet.","examples":[{"sentence":"The metallophone's clear, bright tones filled the music room.","translation":"金属琴の澄んだ明るい音色が音楽室に響き渡った。"},{"sentence":"She played a simple melody on the metallophone.","translation":"彼女は金属琴で簡単なメロディーを演奏した。"},{"sentence":"The metallophone is often used in music education to introduce children to musical scales.","translation":"金属琴は、子供たちに音階を紹介するために音楽教育でよく使用される。"}],"collocations":["play the metallophone (金属琴を演奏する)","metallophone music (金属琴の音楽)","tuned metallophone (調律された金属琴)","bass metallophone (低音金属琴)","soprano metallophone (ソプラノ金属琴)"],"synonyms":["glockenspiel","xylophone (sometimes used loosely, but xylophones have wooden bars)","vibraphone (more complex, with resonators and vibrato)"],"antonyms":[]}],"etymology":{"value":"Derived from 'metallo-' (from Greek 'metallon' meaning 'metal') and '-phone' (from Greek 'phone' meaning 'sound'). Literally, 'metal sound'.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈtæləˌfoʊn/","syllables":"me-tal-lo-phone"},"inflection":{"noun_plural":"metallophones"},"usage_notes":{"explanation":"A metallophone is a percussion instrument similar to a xylophone, but with metal bars instead of wooden ones. The metal bars are tuned to specific pitches, and the instrument is played by striking the bars with mallets. Metallophones are often used in music education and in various musical genres for their bright, resonant sound. They come in different sizes and ranges, such as soprano, alto, tenor, and bass metallophones.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I played the metallophone, it was made of wood.","correct":"✓ I played the xylophone, it was made of wood. / ✓ I played the metallophone, it was made of metal.","note":"Metallophones are made of metal, while xylophones are made of wood. This is the defining difference between the two instruments."},{"incorrect":"✗ The metallophone is a string instrument.","correct":"✓ The metallophone is a percussion instrument.","note":"Metallophones are percussion instruments, meaning they are played by striking them, not by plucking or bowing strings."}],"priority":"★★☆"},"related_words":{"derivatives":["metallophonist (a person who plays the metallophone)"],"phrasal_verbs":[],"instruments":["xylophone","glockenspiel","vibraphone","marimba","balafon","gamelan (often includes metallophones)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (technical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"metallophone\" refers to a musical instrument in the percussion family. It's similar to a xylophone, but instead of wooden bars, it has metal bars that are struck to create sound. Because it's a specialized term, it's not commonly used in everyday conversation, but you might encounter it in discussions about music or musical instruments. The word itself is constructed from \"metallo-\" meaning metal, and \"-phone\" meaning sound, so it literally means \"metal sound.\""},"example_sentences":[{"sentence":"The school orchestra featured a metallophone solo during the concert.","translation":"学校のオーケストラはコンサート中に金属琴のソロを披露した。","type":"general","meaning_category":"instrument"},{"sentence":"The bright, shimmering sound of the metallophone added a unique texture to the composition.","translation":"金属琴の明るくきらめく音色が、楽曲に独特のテクスチャを加えた。","type":"general","meaning_category":"sound"},{"sentence":"The music teacher used the metallophone to teach the children about different musical pitches.","translation":"音楽教師は金属琴を使って、子供たちにさまざまな音の高さを教えた。","type":"education","meaning_category":"teaching"}]}