{"word":"crocodilian","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ワニ目（もく）の動物","english_definition":"Any reptile of the order Crocodilia, including crocodiles, alligators, caimans, and gharials.","examples":[{"sentence":"Crocodilians are apex predators in many aquatic ecosystems.","translation":"ワニ目の動物は、多くの水生生態系の頂点捕食者です。"},{"sentence":"The Nile crocodile is a well-known crocodilian species.","translation":"ナイルワニはよく知られたワニ目の種です。"}],"collocations":["crocodilian species (ワニ目の種)","large crocodilian (大型のワニ目の動物)","aquatic crocodilian (水生のワニ目の動物)"],"synonyms":["crocodile","alligator","caiman","gharial"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ワニ目の動物に関する、ワニ目に似た","english_definition":"Relating to or resembling crocodilians.","examples":[{"sentence":"The fossil showed crocodilian features.","translation":"その化石はワニ目の特徴を示していた。"},{"sentence":"Crocodilian skin is used to make leather products.","translation":"ワニ目の皮は革製品を作るために使われる。"}],"collocations":["crocodilian skin (ワニ目の皮)","crocodilian habitat (ワニ目の生息地)","crocodilian behavior (ワニ目の行動)"],"synonyms":["crocodiline"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'crocodilus' (crocodile), which comes from the Greek 'krokodilos' (lizard, crocodile), possibly related to 'kroke' (pebble) and 'drilos' (worm), referring to the rough skin of the animal.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrɒkəˈdɪliən/","syllables":"cro-co-dil-i-an"},"inflection":{"noun_plural":"crocodilians"},"usage_notes":{"explanation":"'Crocodilian' is used to refer to the entire order of reptiles that includes crocodiles, alligators, caimans, and gharials. It can be used as a noun to refer to any member of this group or as an adjective to describe something related to them.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Crocodile is a crocodilian, but not all crocodilians are crocodiles.","correct":"✓ A crocodile is a crocodilian, but not all crocodilians are crocodiles.","note":"When making a general statement about a type of animal, it's important to use the indefinite article ('a' or 'an') to indicate that you're referring to any member of that group."}],"priority":"★☆☆"},"related_words":{"derivatives":["crocodilia (noun: the order Crocodilia)","crocodile (noun: a specific type of crocodilian)","alligator (noun: a specific type of crocodilian)","caiman (noun: a specific type of crocodilian)","gharial (noun: a specific type of crocodilian)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Crocodilian' is a scientific term used to describe reptiles belonging to the order Crocodilia. This term encompasses various species, including crocodiles, alligators, caimans, and gharials. As an adjective, 'crocodilian' refers to characteristics or features related to these animals. Understanding this term is essential in biological and zoological contexts when discussing these specific reptiles as a group."},"example_sentences":[{"sentence":"The zoo features several species of **crocodilian**, including the American alligator and the saltwater crocodile.","translation":"その動物園には、アメリカアリゲーターやイリエワニなど、数種類の**ワニ目**の動物がいます。","type":"noun","meaning_category":"ワニ目の動物"},{"sentence":"**Crocodilian** habitats are often threatened by human encroachment.","translation":"**ワニ目**の生息地は、しばしば人間の侵入によって脅かされています。","type":"adjective","meaning_category":"ワニ目の動物に関する"}]}