{"word":"pro-excisionism","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"割礼擁護論、女性性器切除擁護論","english_definition":"The advocacy of excision, especially female genital mutilation (FGM).","examples":[{"sentence":"Pro-excisionism is a controversial and harmful ideology.","translation":"割礼擁護論は、議論の的となる有害なイデオロギーです。"},{"sentence":"Organizations promoting pro-excisionism often face strong opposition.","translation":"割礼擁護論を推進する組織は、しばしば強い反対に直面します。"}],"collocations":["pro-excisionism advocate","pro-excisionism ideology","support for pro-excisionism"],"synonyms":["FGM advocacy","female genital mutilation support"],"antonyms":["anti-excisionism","anti-FGM"],"notes":"This term is highly sensitive and often associated with harmful practices. It is important to approach discussions about this topic with caution and respect for human rights."},{"part_of_speech":"形容詞","definition":"割礼擁護の、女性性器切除擁護の","english_definition":"Supporting or advocating for excision, especially female genital mutilation (FGM).","examples":[{"sentence":"The pro-excisionism stance is widely condemned by human rights organizations.","translation":"割礼擁護の立場は、人権団体から広く非難されています。"},{"sentence":"A pro-excisionism argument often cites cultural tradition.","translation":"割礼擁護の議論は、しばしば文化的伝統を引用します。"}],"collocations":["pro-excisionism argument","pro-excisionism stance","pro-excisionism group"],"synonyms":["FGM-supporting","excision-advocating"],"antonyms":["anti-excisionism","anti-FGM"],"notes":"This term is highly sensitive and often associated with harmful practices. It is important to approach discussions about this topic with caution and respect for human rights."}],"etymology":{"value":"The term is formed by combining \"pro-\" (meaning in favor of) with \"excisionism\" (referring to the practice of excision, especially female genital mutilation).","priority":"低"},"pronunciation":{"ipa":"/ˌproʊɪkˈsɪʒənɪzəm/","syllables":"pro-ex-ci-sion-ism"},"inflection":{"notes":"As a noun and adjective, inflection is limited. The adjective does not inflect. The noun can be pluralized, but this is rare."},"usage_notes":{"explanation":"The term \"pro-excisionism\" is used to describe the support for or advocacy of excision, particularly female genital mutilation (FGM). It is a highly controversial term because FGM is widely recognized as a violation of human rights and a harmful practice. Discussions surrounding this topic should be approached with sensitivity and a strong emphasis on human rights and cultural sensitivity.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"Excisionism is a harmless cultural practice.","correct":"Excisionism, particularly FGM, is widely recognized as a harmful practice and a violation of human rights.","note":"It is important to accurately represent the harmful nature of excisionism, especially FGM."}],"priority":"高"},"related_words":{"derivatives":["excision (切除)","excisionism (切除主義)","FGM (female genital mutilation)"],"related_terms":["cultural relativism","human rights","gender equality"],"priority":"中"},"level_frequency":{"frequency_google_ngram":"Very low frequency","priority":"高"},"readability_explanation":{"level":"C2","text":"The term \"pro-excisionism\" is a complex and sensitive term related to the support of excision, particularly female genital mutilation (FGM). Understanding this term requires knowledge of human rights, cultural practices, and ethical considerations. Discussions should be approached with caution and respect for human rights.","note":"This term is rarely used and is highly sensitive."},"example_sentences":[{"sentence":"The documentary explored the arguments of pro-excisionism groups in certain communities.","translation":"そのドキュメンタリーは、特定のコミュニティにおける割礼擁護団体の主張を探求しました。","type":"noun","meaning_category":"割礼擁護論"},{"sentence":"The speaker presented a pro-excisionism viewpoint, which sparked controversy.","translation":"講演者は割礼擁護の視点を提示し、それが論争を引き起こしました。","type":"adjective","meaning_category":"割礼擁護の"}]}