{"word":"discriminatorily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"差別的に、区別的に","english_definition":"In a manner that shows prejudice or unfair bias; in a way that treats people or groups differently based on characteristics such as race, gender, religion, etc.","examples":[{"sentence":"The law was applied discriminatorily against minority groups.","translation":"その法律は少数派グループに対して差別的に適用された。"},{"sentence":"She claimed that she was treated discriminatorily at work because of her gender.","translation":"彼女は、職場において性別を理由に差別的な扱いを受けたと主張した。"},{"sentence":"The company was accused of acting discriminatorily in its hiring practices.","translation":"その会社は、採用活動において差別的に行動していると非難された。"}],"collocations":["treat discriminatorily","apply discriminatorily","act discriminatorily","discriminate discriminatorily"],"synonyms":["prejudicially","unfairly","inequitably","biasedly","partially"],"antonyms":["fairly","equitably","impartially","justly"]}],"etymology":{"value":"Derived from the word 'discriminatory,' which comes from 'discriminate.' 'Discriminate' originates from the Latin 'discriminare,' meaning 'to divide, separate, distinguish.' The suffix '-ly' turns it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈskrɪmɪnətɔːrɪli/","syllables":"dis-crim-i-na-to-ri-ly"},"inflection":{"notes":"As an adverb, it does not have different forms for tense or number."},"usage_notes":{"explanation":"'Discriminatorily' describes actions or behaviors that involve unfair or prejudicial treatment based on certain characteristics. It is often used in legal, ethical, and social contexts to describe actions that violate principles of equality and fairness. The word emphasizes the manner in which something is done, highlighting the presence of bias or prejudice.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The policy was discriminate.","correct":"✓ The policy was discriminatory.","note":"'Discriminate' is a verb, while 'discriminatory' is the adjective. To describe the nature of the policy, use the adjective form. To describe how the policy was applied, use 'discriminatorily'"},{"incorrect":"✗ They treated him discriminate.","correct":"✓ They treated him discriminatorily.","note":"'Discriminate' is a verb. To describe how someone was treated, use the adverb 'discriminatorily.'"}],"priority":"★★☆"},"related_words":{"derivatives":["discriminate (verb)","discrimination (noun)","discriminatory (adjective)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - used in formal or legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'discriminatorily' is an adverb that describes actions done in a way that shows unfair prejudice or bias. It's used to emphasize that someone or something is treating people differently based on characteristics like race, gender, or religion, and that this treatment is unfair. It's a formal word often found in discussions about law, ethics, and social justice.","priority":"★★☆"},"example_sentences":[{"sentence":"The company was found to have acted discriminatorily against female employees in promotions.","translation":"その会社は、昇進において女性従業員に対して差別的に行動していたと判断された。","type":"adverb","meaning_category":"unfair treatment"},{"sentence":"The rules were applied discriminatorily, favoring some students over others.","translation":"その規則は差別的に適用され、一部の生徒を他の生徒よりも優遇した。","type":"adverb","meaning_category":"biased application"},{"sentence":"She argued that the selection process was designed to exclude certain groups discriminatorily.","translation":"彼女は、選考プロセスが特定のグループを差別的に排除するように設計されていると主張した。","type":"adverb","meaning_category":"intentional exclusion"}]}