{"word":"Saxonly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"サクソン人のように、サクソン人らしく","english_definition":"In a manner characteristic of the Saxons; in a Saxon way.","examples":[{"sentence":"He spoke Saxonly, using many old English words.","translation":"彼はサクソン人のように話し、多くの古英語の単語を使った。"},{"sentence":"The music sounded Saxonly, with its strong rhythmic beat.","translation":"その音楽は、強いリズミカルなビートで、サクソン人のように聞こえた。"}],"collocations":["speak Saxonly","sound Saxonly","behave Saxonly"],"synonyms":["Saxon-like","in the manner of Saxons"],"antonyms":[]},{"part_of_speech":"adjective","definition":"サクソン人の、サクソン人に関する","english_definition":"Relating to or characteristic of the Saxons.","examples":[{"sentence":"The Saxonly traditions are still alive in some parts of England.","translation":"サクソン人の伝統は、イングランドの一部で今も生きている。"},{"sentence":"The museum displayed Saxonly artifacts.","translation":"博物館にはサクソン人の工芸品が展示されていた。"}],"collocations":["Saxonly traditions","Saxonly artifacts","Saxonly culture"],"synonyms":["Saxon"],"antonyms":[]}],"etymology":{"value":"From 'Saxon' + '-ly'. The suffix '-ly' is used to form adverbs from adjectives, indicating manner or characteristic.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsæksənli/","syllables":"Sax-on-ly"},"inflection":{"notes":"As an adverb, it does not inflect. As an adjective, it does not inflect."},"usage_notes":{"explanation":"'Saxonly' is primarily used to describe something that is characteristic of or related to the Saxons, an early Germanic people who inhabited parts of what is now Germany and England. It can be used as an adverb to describe how something is done in a Saxon manner, or as an adjective to describe something that is related to Saxon culture or people. Its usage is relatively rare in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived Saxonly.","correct":"✓ He lived in a Saxon way.","note":"While 'Saxonly' is a valid adverb, it's less common than using the phrase 'in a Saxon way' to describe living according to Saxon customs."}],"priority":"★★☆"},"related_words":{"derivatives":["Saxon","Anglo-Saxon"],"phrases":["in a Saxon way"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Saxonly' is relatively uncommon and specialized. It is most likely to be encountered in historical or academic contexts when discussing the Saxons or their culture. The meaning is straightforward: 'in a manner characteristic of the Saxons' or 'relating to the Saxons.'"},"example_sentences":[{"sentence":"The poem was written Saxonly, with a strong emphasis on alliteration.","translation":"その詩はサクソン人のように書かれており、頭韻法が強く強調されていた。","type":"adverb","meaning_category":"サクソン人のように"},{"sentence":"The archaeologist studied the Saxonly burial site.","translation":"考古学者はサクソン人の埋葬地を調査した。","type":"adjective","meaning_category":"サクソン人の"}]}