{"word":"unespousable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"結婚できない、結婚するのにふさわしくない","english_definition":"Not suitable or eligible for marriage.","examples":[{"sentence":"Due to his scandalous reputation, he was considered unespousable by many families.","translation":"彼のスキャンダラスな評判のために、多くの家族から彼は結婚するのにふさわしくないと見なされた。"},{"sentence":"In that era, a woman without a dowry was often deemed unespousable.","translation":"その時代には、持参金のない女性はしばしば結婚できないと見なされた。"}],"collocations":["considered unespousable","deemed unespousable"],"synonyms":["unmarriageable","ineligible for marriage","unsuitable for marriage"],"antonyms":["espousable","marriageable","eligible for marriage"]}],"etymology":{"value":"\"Un-\" (not) + \"espousable\" (able to be married). \"Espousable\" comes from \"espouse,\" meaning to take as a spouse.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪˈspaʊzəbəl/","syllables":"un-es-pous-a-ble"},"inflection":{"notes":"Comparative and superlative forms are not commonly used."},"usage_notes":{"explanation":"The term \"unespousable\" is somewhat archaic and formal. It indicates that someone is not considered a suitable candidate for marriage, often due to factors such as social status, reputation, or physical condition. It is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She felt very unespousable because she was shy.","correct":"✓ She felt very unmarriageable because she was shy.","note":"In modern English, 'unmarriageable' is more commonly used than 'unespousable'."}],"priority":"★☆☆"},"related_words":{"derivatives":["espouse (verb: to take as a spouse; to support or adopt an idea or cause)","espousal (noun: marriage or betrothal; adoption or support of a cause)","espoused (adjective: married; supported or adopted)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'unespousable' is a rare and formal term, primarily found in older literature. It means 'not suitable for marriage.' Due to its infrequent use, it is not part of standard vocabulary and is more likely to be encountered in academic or historical contexts."},"example_sentences":[{"sentence":"Her family's financial ruin made her practically unespousable in the eyes of society.","translation":"彼女の家族の経済的破綻は、社会の目には彼女を事実上結婚できない存在にした。","type":"adjective","meaning_category":"結婚できない"},{"sentence":"The prince's scandalous behavior rendered him unespousable to any respectable royal family.","translation":"王子のスキャンダラスな行動は、彼をどのまともな王室にとっても結婚相手として不適格にした。","type":"adjective","meaning_category":"結婚するのにふさわしくない"}]}