{"word":"Queer-exclusive","priority":"低","meanings":[{"part_of_speech":"形容詞","definition":"クィア・エクスクルーシブ。クィアコミュニティにおいて、特定のアイデンティティや属性を持つ人々を排除する、または排除しようとする態度やイデオロギーを指す。","english_definition":"Referring to attitudes or ideologies within the queer community that exclude or seek to exclude people based on specific identities or attributes.","examples":[{"sentence":"Some argue that certain online spaces are becoming increasingly queer-exclusive, focusing only on the experiences of cisgender gay men.","translation":"特定のオンラインスペースは、シスジェンダーのゲイ男性の経験のみに焦点を当て、ますますクィア・エクスクルーシブになっていると主張する人もいます。"},{"sentence":"The debate highlighted the tensions between inclusivity and queer-exclusive practices within the LGBTQ+ rights movement.","translation":"この議論は、LGBTQ+権利運動における包括性とクィア・エクスクルーシブな慣行の間の緊張を浮き彫りにしました。"}],"collocations":["クィア・エクスクルーシブなスペース (queer-exclusive spaces)","クィア・エクスクルーシブなイデオロギー (queer-exclusive ideology)","クィア・エクスクルーシブな態度 (queer-exclusive attitudes)"],"synonyms":["排他的な (exclusive)","選民主義的な (elitist)","分断的な (divisive)"],"antonyms":["包括的な (inclusive)","受容的な (accepting)","多様な (diverse)"]},{"part_of_speech":"名詞","definition":"クィア・エクスクルーシブな人々、またはクィア・エクスクルーシブな態度やイデオロギーを持つ人々。","english_definition":"People who hold queer-exclusive attitudes or ideologies.","examples":[{"sentence":"The forum was criticized for being dominated by queer-exclusives who dismissed the concerns of bisexual and transgender members.","translation":"そのフォーラムは、バイセクシュアルやトランスジェンダーのメンバーの懸念を無視するクィア・エクスクルーシブな人々によって支配されていると批判されました。"}],"collocations":["クィア・エクスクルーシブの集団 (groups of queer-exclusives)"],"synonyms":["排他的な人々 (exclusive people)","選民主義者 (elitists)"],"antonyms":["インクルーシブな人々 (inclusive people)"]}],"etymology":{"value":"「クィア (queer)」と「エクスクルーシブ (exclusive)」の組み合わせ。クィアコミュニティ内の一部のグループや個人が、他のグループや個人を排除する傾向を指すために作られた言葉。","priority":"中"},"pronunciation":{"ipa":"/ˈkwɪər ɪkˈskluːsɪv/","syllables":"kwi-a-i-ku-su-shi-bu"},"inflection":{"notes":"形容詞、または名詞として使用される。"},"usage_notes":{"explanation":"「クィア・エクスクルーシブ」は、クィアコミュニティ内部の複雑な力関係を理解するために重要な概念です。シスジェンダー、ゲイ男性、白人など、特定のアイデンティティを持つ人々が、コミュニティ内で優位な立場を占め、他のアイデンティティを持つ人々を疎外することがあります。この言葉は、そのような排他的な態度や行動を批判的に分析するために用いられます。","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"クィア・エクスクルーシブは、LGBTQ+コミュニティ全体を指す言葉です。","correct":"クィア・エクスクルーシブは、LGBTQ+コミュニティ内の一部の排他的な態度やグループを指す言葉です。","note":"クィア・エクスクルーシブは、コミュニティ全体ではなく、その一部に見られる排他的な傾向を指します。"}],"priority":"低"},"related_words":{"derivatives":["インクルーシブ (inclusive)","選民主義 (elitism)","排他主義 (exclusivism)"],"related_terms":["TERF (Trans-Exclusionary Radical Feminist)","SWERF (Sex Work-Exclusionary Radical Feminist)","内部差別 (internalized oppression)","交差性 (intersectionality)"],"priority":"中"},"level_frequency":{"CEFR":"該当なし","frequency_google_ngram":"低","priority":"低"},"readability_explanation":{"level":"C2","text":"「クィア・エクスクルーシブ」という言葉は、クィアコミュニティの中で、特定の人々を排除しようとする考え方や行動を指します。これは、コミュニティの中にいる人が、他の人たちを仲間として認めないことを意味します。例えば、あるグループが、トランスジェンダーの人たちをクィアコミュニティの一員として認めない場合、それはクィア・エクスクルーシブな考え方と言えます。この言葉は、コミュニティの中の不平等や差別について議論するときに使われます。"},"example_sentences":[{"sentence":"The organization aims to combat queer-exclusive attitudes and promote inclusivity.","translation":"その組織は、クィア・エクスクルーシブな態度と闘い、包括性を促進することを目指しています。","type":"一般的な使用例","meaning_category":"排他的な態度"},{"sentence":"Some critics argue that certain pride events have become queer-exclusive, catering primarily to cisgender gay men.","translation":"一部の批評家は、特定のプライドイベントがクィア・エクスクルーシブになり、主にシスジェンダーのゲイ男性を対象としていると主張しています。","type":"具体的な例","meaning_category":"排他的なイベント"}]}