{"word":"Brassavola","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of epiphytic orchids native to the Americas, known for their fragrant, usually white or greenish-white flowers that bloom at night.","english_definition":"A genus of epiphytic orchids native to the Americas, known for their fragrant, usually white or greenish-white flowers that bloom at night.","examples":[{"sentence":"Brassavola nodosa is a popular species in the genus.","translation":"Brassavola nodosa はこの属で人気のある種です。"},{"sentence":"The Brassavola orchid filled the room with its sweet scent.","translation":"ブラッサボラ蘭が部屋中に甘い香りを漂わせました。"}],"collocations":["Brassavola nodosa","Brassavola Little Stars","Brassavola care","Brassavola cultivation"],"synonyms":["orchid","epiphyte"],"antonyms":[]}],"etymology":{"value":"The name Brassavola is derived from Antonio Musa Brassavola, an Italian physician and botanist of the 16th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbræsəˈvoʊlə/","syllables":"Bras-sa-vo-la"},"inflection":{"noun_plural":"Brassavolas"},"usage_notes":{"explanation":"Brassavola orchids are popular among orchid enthusiasts for their ease of care and their nocturnal fragrance. They are often hybridized with other orchid genera to create new and interesting hybrids.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a brassavola orchid, it's flowers are very fragrant.","correct":"✓ I have a Brassavola orchid; its flowers are very fragrant.","note":"'Brassavola' is a genus name and should be capitalized. Also, use a semicolon to connect two related independent clauses."}],"priority":"★★☆"},"related_words":{"derivatives":["Brassavola nodosa (Lady of the Night orchid)","Brassavola hybrids"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Brassavola' refers to a specific genus of orchids. Understanding this word requires some familiarity with botany and orchid cultivation. The text uses botanical terms like 'epiphytic' and assumes a level of scientific literacy. Therefore, it is more suitable for advanced learners or those with a specific interest in orchids."},"example_sentences":[{"sentence":"The Brassavola orchid is known for its strong, sweet fragrance at night.","translation":"ブラッサボラ蘭は、夜に強く甘い香りを放つことで知られています。","type":"noun","meaning_category":"Orchid genus"},{"sentence":"Many Brassavola hybrids are easier to grow than other types of orchids.","translation":"多くのブラッサボラの交配種は、他の種類の蘭よりも育てやすいです。","type":"noun","meaning_category":"Orchid genus"}]}