{"word":"unburiable","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"埋葬できない、埋葬に値しない、埋葬を拒否される","english_definition":"Not able to be buried; not worthy of burial; denied burial.","examples":[{"sentence":"His crimes were so heinous that his body was deemed unburiable.","translation":"彼の罪はあまりにも凶悪であったため、彼の遺体は埋葬に値しないと判断された。"},{"sentence":"The sacred texts describe certain individuals as unburiable due to their transgressions.","translation":"聖典には、特定の違反行為のために埋葬を拒否される人々が記述されている。"},{"sentence":"In some cultures, those who die by suicide are considered unburiable in consecrated ground.","translation":"一部の文化では、自殺で亡くなった人々は聖なる地に埋葬できないと見なされている。"}],"collocations":["deemed unburiable","considered unburiable","declared unburiable","unburiable remains","unburiable corpse"],"synonyms":["unentombable","uninterrable","unsepulchral"],"antonyms":["buriable","entombable","interrable","sepulchral"]}],"etymology":{"value":"\"un-\" (否定) + \"buriable\" (埋葬できる)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈberiəbəl/","syllables":"un-bur-i-a-ble"},"inflection":{"adjective_forms":{"comparative":"more unburiable","superlative":"most unburiable"}},"usage_notes":{"explanation":"\"Unburiable\" is a relatively rare and formal word, often used in historical, literary, or religious contexts. It describes a state where burial is either physically impossible or morally/religiously forbidden. The word carries a strong negative connotation, suggesting disgrace, dishonor, or severe transgression.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unburiable treasure was hidden deep underground.","correct":"✓ The unburied treasure was hidden deep underground.","note":"\"Unburiable\" refers to something that cannot be buried, whereas \"unburied\" means something that has not been buried. In this context, \"unburied\" is the correct term."},{"incorrect":"✗ The unburiable waste was a serious environmental hazard.","correct":"✓ The non-biodegradable waste was a serious environmental hazard.","note":"If referring to waste that cannot decompose, \"non-biodegradable\" is a more appropriate term than \"unburiable\"."}],"priority":"★★☆"},"related_words":{"derivatives":["unburied (形容詞: 埋葬されていない)","bury (動詞: 埋める、埋葬する)","burial (名詞: 埋葬)"],"phrases":["denial of burial","refusal of burial","sacrilege"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unburiable\" is a formal and uncommon term indicating that something cannot be buried, either physically or due to religious or moral reasons. It often implies a sense of dishonor or being unworthy of a proper burial. Due to its rarity and specific context, it is more likely to be encountered in advanced reading materials related to history, literature, or religious studies. The prefix \"un-\" negates the meaning of \"buriable,\" making it easier to understand if you are familiar with the base word.","priority":"★★☆"},"example_sentences":[{"sentence":"The tyrant's body was left unburiable as a symbol of his eternal shame.","translation":"暴君の遺体は、彼の永遠の恥の象徴として埋葬を拒否された。","type":"adjective","meaning_category":"埋葬できない"},{"sentence":"Ancient laws often dictated that traitors were unburiable within the city walls.","translation":"古代の法律では、しばしば反逆者は都市の壁の中に埋葬できないと定められていた。","type":"adjective","meaning_category":"埋葬を拒否される"},{"sentence":"The unburiable remains were scattered across the battlefield, a grim reminder of the war's brutality.","translation":"埋葬されない遺体は戦場に散らばり、戦争の残虐さを痛烈に物語っていた。","type":"adjective","meaning_category":"埋葬に値しない"}]}