{"word":"organologic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"器官学の、器官組織学の","english_definition":"Relating to organology, the study of the anatomy and physiology of organs.","examples":[{"sentence":"The organologic analysis revealed the extent of the damage to the liver.","translation":"器官組織学的分析により、肝臓への損傷の程度が明らかになった。"},{"sentence":"Organologic studies are crucial for understanding the function of different body parts.","translation":"器官組織学的研究は、体のさまざまな部分の機能を理解する上で重要である。"}],"collocations":["organologic analysis","organologic study","organologic examination"],"synonyms":["histologic","anatomical","physiological"],"antonyms":[]}],"etymology":{"value":"Derived from 'organology', which comes from the Greek words 'organon' (tool, instrument, organ) and 'logia' (study of).","priority":"★★★"},"pronunciation":{"ipa":"/ɔːrˌɡænəlˈɒdʒɪk/","syllables":"or-gan-o-log-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Organologic' is a specialized term used primarily in the fields of biology, anatomy, and medicine. It describes something related to the study of organs and their functions, often involving microscopic examination of tissues.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The organological chart showed the family tree.","correct":"✓ The genealogical chart showed the family tree.","note":"'Organologic' relates to organs, not genealogy (family history)."},{"incorrect":"✗ The organologic music was very complex.","correct":"✓ The instrumental music was very complex.","note":"'Organologic' does not relate to music or instruments in a musical sense, but to biological organs."}],"priority":"★★☆"},"related_words":{"derivatives":["organology (noun): 器官学、器官組織学","organ (noun): 器官","organic (adjective): 有機的な"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'organologic' is a highly specialized word used in biological and medical contexts. It refers to the study of organs, their structure, and their function. Understanding this term requires a background in biology or medicine, as it is not commonly used in everyday language. It is typically found in scientific literature or academic discussions related to anatomy and physiology."},"example_sentences":[{"sentence":"The organologic examination of the biopsy sample provided valuable diagnostic information.","translation":"生検サンプルの器官組織学的検査は、貴重な診断情報を提供した。","type":"adjective","meaning_category":"器官学の"},{"sentence":"Detailed organologic studies are essential for understanding the pathogenesis of various diseases.","translation":"詳細な器官組織学的研究は、さまざまな疾患の病因を理解するために不可欠である。","type":"adjective","meaning_category":"器官組織学の"}]}