{"word":"tiltmeter","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"傾斜計、傾斜計","english_definition":"An instrument designed to measure very small changes from the vertical level, either on the surface or in a borehole.","examples":[{"sentence":"Tiltmeters are used to monitor the stability of volcanoes and dams.","translation":"傾斜計は、火山やダムの安定性を監視するために使用されます。"},{"sentence":"The tiltmeter detected a slight change in the slope of the land.","translation":"傾斜計は、土地の斜面のわずかな変化を検出しました。"}],"collocations":["install a tiltmeter","monitor with a tiltmeter","tiltmeter reading","high-resolution tiltmeter"],"synonyms":["inclinometer","clinometer"],"antonyms":[]}],"etymology":{"value":"The word \"tiltmeter\" is a compound word formed from \"tilt\" (the act of inclining or sloping) and \"meter\" (an instrument for measuring).","priority":"★★★"},"pronunciation":{"ipa":"/ˈtɪltˌmiːtər/","syllables":"tilt-me-ter"},"inflection":{"noun_plural":"tiltmeters"},"usage_notes":{"explanation":"Tiltmeters are highly sensitive instruments used in various fields, including geophysics, structural engineering, and civil engineering. They are used to detect subtle movements and deformations in the Earth's surface or in man-made structures. The data from tiltmeters can be used to predict volcanic eruptions, landslides, and structural failures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tiltmeter measure the temperature.","correct":"✓ The tiltmeter measures the tilt.","note":"Tiltmeters measure tilt or inclination, not temperature."}],"priority":"★★☆"},"related_words":{"derivatives":["tilt (noun, verb)","meter (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'tiltmeter' is specialized vocabulary, primarily encountered in scientific or technical contexts related to geology, engineering, or monitoring systems. Understanding requires familiarity with concepts of inclination, measurement, and instrumentation."},"example_sentences":[{"sentence":"Researchers deployed a network of tiltmeters around the volcano to monitor ground deformation.","translation":"研究者たちは、地盤の変形を監視するために、火山の周りに傾斜計のネットワークを配置しました。","type":"general","meaning_category":"measurement"},{"sentence":"Data from the borehole tiltmeter indicated a potential instability in the rock formation.","translation":"ボアホール傾斜計からのデータは、岩盤構造の潜在的な不安定性を示していました。","type":"technical","meaning_category":"geotechnical monitoring"}]}