{"word":"directly-sourced","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"直接仕入れた、直接調達した","english_definition":"Obtained or acquired directly from the original source or producer, without intermediaries.","examples":[{"sentence":"This coffee is directly-sourced from a farm in Ethiopia.","translation":"このコーヒーはエチオピアの農園から直接仕入れています。"},{"sentence":"The restaurant prides itself on using directly-sourced ingredients.","translation":"そのレストランは、直接仕入れた食材を使用していることを誇りに思っています。"},{"sentence":"We are committed to providing directly-sourced and ethically-produced goods.","translation":"私たちは、直接仕入れ、倫理的に生産された商品を提供することに尽力しています。"}],"collocations":["directly-sourced coffee (直接仕入れのコーヒー)","directly-sourced ingredients (直接仕入れの食材)","directly-sourced materials (直接仕入れの材料)","directly-sourced produce (直接仕入れの農産物)","directly-sourced goods (直接仕入れの商品)"],"synonyms":["directly obtained","directly acquired","source-direct","farm-to-table (food)"],"antonyms":["indirectly-sourced","third-party sourced","intermediary-sourced"]},{"part_of_speech":"adjective","definition":"(情報などが)直接情報源から得られた、一次情報源に基づいた","english_definition":"(of information) obtained directly from the original source; based on primary sources.","examples":[{"sentence":"The report uses directly-sourced data to support its conclusions.","translation":"その報告書は、結論を裏付けるために直接情報源から得られたデータを使用しています。"},{"sentence":"The historian relied on directly-sourced documents for her research.","translation":"その歴史家は、研究のために一次情報源の文書に頼っていました。"},{"sentence":"We prefer directly-sourced accounts over secondhand narratives.","translation":"私たちは、二次的な物語よりも直接情報源からの説明を好みます。"}],"collocations":["directly-sourced data (直接情報源からのデータ)","directly-sourced information (直接情報源からの情報)","directly-sourced accounts (直接情報源からの説明)","directly-sourced evidence (直接情報源からの証拠)","directly-sourced documents (直接情報源からの文書)"],"synonyms":["primary-source","firsthand","original-source"],"antonyms":["secondhand","indirectly-sourced","secondary-source"]}],"etymology":{"value":"The term is a compound adjective formed by combining \"directly\" (meaning without intermediaries) and \"sourced\" (meaning obtained from a source). It reflects a trend towards transparency and traceability in supply chains and information gathering.","priority":"★★☆"},"pronunciation":{"ipa":"/dəˈrɛktli ˈsɔːrst/","syllables":"di-rect-ly sourced"},"inflection":{"notes":"This is an adjective, so it doesn't inflect like a verb. It can be used to modify nouns in various contexts."},"usage_notes":{"explanation":"\"**directly-sourced**\" is commonly used to describe products (especially food and beverages) or information that has been obtained directly from the original producer or source, without involving middlemen or secondary sources. It emphasizes authenticity, transparency, and often ethical considerations. The term suggests a closer relationship with the origin and a greater level of control over quality and production methods.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The coffee is directly source.","correct":"✓ The coffee is directly-sourced.","note":"\"Sourced\" is an adjective here, so it needs to be in the past participle form. Using \"source\" as a noun is incorrect in this context."},{"incorrect":"✗ We directly sourced the materials.","correct":"✓ We use directly-sourced materials.","note":"While \"directly sourced\" can be used as a verb phrase, the adjective form \"directly-sourced\" is more common when describing the materials themselves."}],"priority":"★★☆"},"related_words":{"derivatives":["direct sourcing (直接調達)"],"phrases":["farm-to-table (農場から食卓へ)","source-to-consumer (供給元から消費者へ)","supply chain transparency (サプライチェーンの透明性)","ethical sourcing (倫理的な調達)","sustainable sourcing (持続可能な調達)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, but increasing in use, especially in marketing and ethical consumption contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"**directly-sourced**\" is used to describe something that comes straight from its origin, without any middlemen. This is often used for food, like coffee or vegetables, to show that the seller knows exactly where it came from and how it was made. It can also be used for information, meaning that the information comes directly from the original source, not from someone who heard it from someone else. This makes the information more reliable. It's a term that emphasizes transparency and authenticity."},"example_sentences":[{"sentence":"The company uses **directly-sourced** cocoa beans to make its chocolate.","translation":"その会社は、チョコレートを作るために直接仕入れたカカオ豆を使用しています。","type":"adjective","meaning_category":"直接仕入れた (商品)"},{"sentence":"The journalist relied on **directly-sourced** interviews for her article.","translation":"そのジャーナリストは、記事のために直接情報源からのインタビューに頼っていました。","type":"adjective","meaning_category":"直接情報源から得られた (情報)"}]}