{"word":"Cecropia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物) ケクロピア属の木","english_definition":"A genus of tropical trees in the family Urticaceae, native to the Americas.","examples":[{"sentence":"The Cecropia tree is known for its symbiotic relationship with ants.","translation":"ケクロピアの木は、アリとの共生関係で知られています。"}],"collocations":["Cecropia peltata","Cecropia tree","Cecropia leaf"],"synonyms":["trumpet tree"],"antonyms":[]}],"etymology":{"value":"Named after Cecrops, the mythical first king of Athens, often depicted with a serpent's tail, possibly alluding to the hollow stems of some Cecropia species.","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˈkroʊpiə/","syllables":"se-cro-pi-a"},"inflection":{"notes":"複数形は Cecropias"},"usage_notes":{"explanation":"Cecropia trees are fast-growing and often found in disturbed areas, such as clearings and along roadsides. They are easily recognizable by their large, palmate leaves and their association with ants, which live inside the hollow stems and protect the tree from herbivores.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a cecropia moth on the cecropia tree.","correct":"✓ I saw a luna moth on the cecropia tree.","note":"Cecropia refers to the tree genus, not the moth. The Cecropia moth is named after the tree, but they are distinct entities."}],"priority":"★☆☆"},"related_words":{"derivatives":["Cecropiaceae (ケクロピア科 - 廃止された分類)"],"phrases":["Cecropia moth (アメリカイヌガシ科の蛾)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な植物学の文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cecropia' is a scientific term referring to a genus of fast-growing tropical trees. Understanding this term requires knowledge of botany and ecology, particularly related to tropical ecosystems and plant-animal interactions (specifically, mutualism with ants). The etymology involves classical mythology, adding another layer of complexity. This word is unlikely to appear in general English conversation and is primarily used in specialized academic or scientific contexts."},"example_sentences":[{"sentence":"The rapid growth of Cecropia trees makes them important in forest regeneration.","translation":"ケクロピアの木の急速な成長は、森林再生において重要です。","type":"noun","meaning_category":"植物"},{"sentence":"Ants protect the Cecropia from herbivores.","translation":"アリは草食動物からケクロピアを守ります。","type":"noun","meaning_category":"植物"}]}