{"word":"Schisandraceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"マツブサ科","english_definition":"a family of flowering plants including the magnolia vine and star anise.","examples":[{"sentence":"Schisandraceae is a family of plants known for their medicinal properties.","translation":"マツブサ科は薬効があることで知られる植物の科です。"}],"collocations":[],"synonyms":["Magnolia vine family","Star anise family"],"antonyms":[]}],"etymology":{"value":"The name Schisandraceae is derived from the genus Schisandra, which comes from the Greek words 'schizein' (to cleave, split) and 'andros' (man), referring to the split stamens in the flowers of some species.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌskɪsænˈdreɪsiːˌaɪ/","syllables":"skis-an-dray-see-eye"},"inflection":{"noun_plural":"Schisandraceae (usually treated as uncountable)"},"usage_notes":{"explanation":"Schisandraceae is a relatively small family of flowering plants, consisting of three genera: Schisandra, Kadsura, and Illicium (star anise). These plants are typically found in temperate and tropical regions of Asia and North America. Some species, particularly those in the genus Schisandra, are used in traditional medicine.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["Schisandra (genus)","Kadsura (genus)","Illicium (genus)"],"priority":"☆☆☆"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"Schisandraceae refers to a specific family of plants, so it's a technical term not commonly used in everyday language. Understanding it requires knowledge of botany or plant taxonomy."},"example_sentences":[{"sentence":"Plants in the Schisandraceae family are often cultivated for their ornamental value.","translation":"マツブサ科の植物は、観賞価値があるため栽培されることが多いです。","type":"general","meaning_category":"description"},{"sentence":"The essential oils extracted from Schisandraceae plants have various applications.","translation":"マツブサ科植物から抽出された精油には、さまざまな用途があります。","type":"scientific","meaning_category":"uses"}]}