{"word":"hypothecation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律・金融) 担保権設定、抵当権設定","english_definition":"The act of pledging an asset as collateral for a loan, while retaining ownership of the asset.","examples":[{"sentence":"The bank required hypothecation of the company's assets as a condition for the loan.","translation":"銀行は融資の条件として、会社の資産に対する担保権設定を要求した。"},{"sentence":"Hypothecation allows the borrower to use the asset while it serves as security for the lender.","translation":"担保権設定により、借り手は資産を担保として提供しながら、その資産を使用することができる。"}],"collocations":["hypothecation agreement (担保権設定契約)","hypothecation of assets (資産の担保権設定)","reverse hypothecation (リバースモーゲージ)"],"synonyms":["pledge","mortgage","security interest"],"antonyms":["unsecured loan"]}],"etymology":{"value":"Derived from the Late Latin word 'hypotheca', which means 'pledge' or 'mortgage', originating from the Greek word 'hypotheke' (ὑποθήκη), meaning 'pledge, security'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪˌpɒθɪˈkeɪʃən/","syllables":"hy-poth-e-ca-tion"},"inflection":{"noun_plural":"hypothecations"},"usage_notes":{"explanation":"Hypothecation is a legal term referring to the practice where a debtor pledges collateral to secure a debt, but retains possession and control of the collateral. This contrasts with a pledge, where the lender takes possession of the asset. It is commonly used in mortgage loans, where the borrower retains possession of the property while the lender has a lien on it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He sold the house under hypothecation.","correct":"✓ He mortgaged the house. / ✓ He obtained a loan through hypothecation of the house.","note":"Hypothecation refers to the *act* of pledging an asset, not the state of ownership. Selling implies transfer of ownership, which is different from hypothecation."},{"incorrect":"✗ Hypothecation means giving up the asset.","correct":"✓ Hypothecation means pledging the asset as collateral while retaining ownership.","note":"The key feature of hypothecation is retaining ownership while using the asset as collateral."}],"priority":"★★☆"},"related_words":{"derivatives":["hypothecate (verb): to pledge as collateral","hypothecator (noun): one who hypothecates","hypothecary (adjective): relating to hypothecation"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypothecation' is a specialized legal and financial term that describes the process of using an asset as collateral for a loan without giving up possession of the asset. It's commonly encountered in discussions about mortgages and secured lending. Understanding this term requires familiarity with legal and financial concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The company used the hypothecation of its inventory to secure a short-term loan.","translation":"その会社は短期融資を確保するために、在庫の担保権設定を利用した。","type":"general","meaning_category":"担保権設定"},{"sentence":"Reverse hypothecation, or reverse mortgage, allows homeowners to borrow against the equity in their homes without selling them.","translation":"リバース担保権設定、またはリバースモーゲージは、住宅所有者が家を売却せずに、住宅の資産価値を担保に融資を受けることを可能にする。","type":"example","meaning_category":"担保権設定"}]}