{"word":"Umbro-Sienese","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Relating to or characteristic of the artistic styles of Umbria and Siena, especially during the 14th and 15th centuries.","english_definition":"Relating to or characteristic of the artistic styles of Umbria and Siena, especially during the 14th and 15th centuries.","examples":[{"sentence":"The painting exhibits a distinct Umbro-Sienese influence, blending the delicate colors of Siena with the more robust forms of Umbria.","translation":"その絵画は、明確なウンブリア＝シエナの影響を示しており、シエナの繊細な色彩とウンブリアのより力強い形態を融合させている。"}],"collocations":[],"synonyms":["Umbrian-Sienese"],"antonyms":[]}],"etymology":{"value":"A combination of 'Umbro-' (referring to Umbria, a region in central Italy) and 'Sienese' (referring to Siena, a city in Tuscany, Italy).","priority":"N/A"},"pronunciation":{"ipa":"/ˌʌmbroʊ siˈɛniːz/","syllables":"Um-bro-Si-e-nese"},"inflection":{},"usage_notes":{"explanation":"This term is primarily used in art history and criticism to describe a style that combines elements of the Umbrian and Sienese schools of painting. It is most often applied to works from the late medieval and early Renaissance periods.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["Umbria","Siena","Sienese"],"related_terms":["Umbrian school","Sienese school","Italian Renaissance art"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'Umbro-Sienese' is a specialized term used in art history. Understanding requires familiarity with the geographical regions of Umbria and Siena in Italy, as well as knowledge of art historical periods and styles. The term describes a synthesis or influence between the artistic traditions of these two regions. "},"example_sentences":[{"sentence":"The museum's collection includes several panels demonstrating Umbro-Sienese techniques in tempera painting.","translation":"美術館のコレクションには、テンペラ絵画におけるウンブリア＝シエナの技法を示すパネルがいくつか含まれている。","type":"adjective","meaning_category":"artistic style"}]}