{"word":"doorweed","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A common name for plants of the genus Polygonum, especially Polygonum aviculare, a weedy species often found growing in disturbed areas, including near doorways.","english_definition":"A common name for plants of the genus Polygonum, especially Polygonum aviculare, a weedy species often found growing in disturbed areas, including near doorways.","examples":[{"sentence":"The doorweed grew in the cracks of the pavement near the entrance.","translation":"ドアウィードは入り口近くの舗装のひび割れに生えていた。"}],"collocations":["doorweed plant","common doorweed"],"synonyms":["knotweed","Polygonum aviculare"],"antonyms":[]}],"etymology":{"value":"The name \"doorweed\" likely comes from the plant's tendency to grow in areas disturbed by human activity, often near doorways or paths.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɔːrwiːd/","syllables":"door-weed"},"inflection":{"noun_plural":"doorweeds"},"usage_notes":{"explanation":"\"Doorweed\" is a colloquial term and may not be universally recognized. It refers specifically to plants that thrive in compacted soil and disturbed environments, often found in areas where people frequently walk or work.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted doorweed in my garden for its beauty.","correct":"✓ I planted ornamental knotweed in my garden for its beauty.","note":"Doorweed is generally considered a weed, not an ornamental plant."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Doorweed\" is a relatively uncommon term referring to a specific type of plant (Polygonum aviculare) that grows in disturbed areas, often near doorways. It's a colloquial name, so it's not as widely used as its scientific name or other common names like \"knotweed.\" Understanding this term requires some familiarity with botany and common plant names.","priority":"★★☆"},"example_sentences":[{"sentence":"The children pulled up the **doorweed** from the garden path.","translation":"子供たちは庭の小道からドアウィードを引き抜いた。","type":"noun","meaning_category":"plant"},{"sentence":"The **doorweed** is a common sight in urban environments.","translation":"ドアウィードは都市環境ではよく見られる植物だ。","type":"noun","meaning_category":"plant"}]}