{"word":"Raphaelite","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ラファエル前派の、ラファエル前派風の","english_definition":"relating to or characteristic of the Pre-Raphaelite Brotherhood, an artistic movement founded in 1848","examples":[{"sentence":"Raphaelite paintings are known for their vibrant colors and detailed realism.","translation":"ラファエル前派の絵画は、鮮やかな色彩と詳細なリアリズムで知られています。"},{"sentence":"She wore a Raphaelite-inspired dress with flowing sleeves.","translation":"彼女は、流れるような袖のラファエル前派風のドレスを着ていました。"}],"collocations":["Raphaelite art","Raphaelite painting","Raphaelite artist","Raphaelite style","Raphaelite imagery"],"synonyms":["Pre-Raphaelite","Pre-Raphaelite style"],"antonyms":[]},{"part_of_speech":"noun","definition":"ラファエル前派の画家、ラファエル前派の芸術家","english_definition":"an artist belonging to the Pre-Raphaelite Brotherhood","examples":[{"sentence":"He is a Raphaelite known for his depictions of mythical subjects.","translation":"彼は、神話的な主題を描いたことで知られるラファエル前派の画家です。"},{"sentence":"The Raphaelite movement included painters, poets, and critics.","translation":"ラファエル前派の運動には、画家、詩人、批評家が含まれていました。"}],"collocations":["a member of the Raphaelite Brotherhood"],"synonyms":["Pre-Raphaelite artist","Pre-Raphaelite painter"],"antonyms":[]}],"etymology":{"value":"The term \"Raphaelite\" is derived from the name of the Italian Renaissance painter Raphael (Raffaello Sanzio da Urbino), who was considered by the Pre-Raphaelite Brotherhood to represent the academic and conventional art they were rebelling against. The Pre-Raphaelites aimed to return to the detailed realism and vibrant colors of early Italian and Flemish art before Raphael's influence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈræfiəˌlaɪt/","syllables":"Ra-pha-e-lite"},"inflection":{"noun_plural":"Raphaelites"},"usage_notes":{"explanation":"The term \"Raphaelite\" primarily refers to the Pre-Raphaelite Brotherhood, a group of English painters, poets, and critics founded in 1848. They rejected what they considered the mechanistic approach first adopted by Mannerist artists who succeeded Raphael and Michelangelo. Instead, they sought to revive the artistic styles of the early Renaissance. The term can be used both as an adjective to describe art or styles influenced by the Pre-Raphaelites and as a noun to refer to an artist or member of the movement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Raphael artist.","correct":"✓ He is a Raphaelite artist.","note":"\"Raphael\" refers to the artist himself, while \"Raphaelite\" refers to the movement or style inspired by artists *before* Raphael, which the Pre-Raphaelites admired."},{"incorrect":"✗ The Raphaelites were fans of Raphael's work.","correct":"✓ The Raphaelites were critical of the artistic conventions that followed Raphael.","note":"The Pre-Raphaelites actually sought to move away from the artistic styles that became dominant after Raphael."}],"priority":"★★☆"},"related_words":{"derivatives":["Pre-Raphaelite","Pre-Raphaelitism"],"related_concepts":["Romanticism","Victorian art","Aestheticism"],"priority":"★★☆"},"level_frequency":{"level":"C1","frequency_google_ngram":"Relatively low frequency. Specialized vocabulary related to art history.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Raphaelite\" refers specifically to the Pre-Raphaelite Brotherhood, a 19th-century art movement. Understanding the term requires knowledge of art history and the specific aims and ideals of this group of artists. It's not a commonly used word outside of discussions about art history or literature related to the Victorian era."},"example_sentences":[{"sentence":"The museum features a stunning collection of Raphaelite paintings.","translation":"その美術館には、ラファエル前派の絵画の見事なコレクションがあります。","type":"adjective","meaning_category":"ラファエル前派の"},{"sentence":"Many critics consider her to be the quintessential Raphaelite model.","translation":"多くの批評家は、彼女を典型的なラファエル前派のモデルだと考えています。","type":"adjective","meaning_category":"ラファエル前派の"},{"sentence":"Rossetti was a key Raphaelite figure.","translation":"ロセッティは、主要なラファエル前派の人物でした。","type":"noun","meaning_category":"ラファエル前派の芸術家"},{"sentence":"The Raphaelite Brotherhood sought to return to the artistic styles of the early Renaissance.","translation":"ラファエル前派同盟は、初期ルネサンスの芸術様式への回帰を目指しました。","type":"noun","meaning_category":"ラファエル前派の芸術家"}]}