{"word":"plagiocephalic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"斜頭の、斜頭症の","english_definition":"Relating to or having plagiocephaly (a condition characterized by an asymmetrical distortion of the skull).","examples":[{"sentence":"The baby was diagnosed with mild plagiocephalic deformity.","translation":"その赤ちゃんは軽度の斜頭変形と診断された。"},{"sentence":"Plagiocephalic infants may require physical therapy or helmet therapy.","translation":"斜頭症の乳児は、理学療法またはヘルメット療法が必要になる場合がある。"}],"collocations":["plagiocephalic skull","plagiocephalic head","plagiocephalic deformity"],"synonyms":["asymmetrical skull","deformed head"],"antonyms":["symmetrical skull","normal head shape"]}],"etymology":{"value":"From the Ancient Greek words 'plagios' (πλάγιος) meaning 'oblique' or 'slanting' and 'kephalē' (κεφαλή) meaning 'head'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpleɪdʒioʊsəˈfælɪk/","syllables":"pla-gi-o-ce-phal-ic"},"inflection":{"notes":"Comparative and superlative forms are possible (more plagiocephalic, most plagiocephalic), but are not commonly used."},"usage_notes":{"explanation":"'Plagiocephalic' is a technical term used in medicine to describe a skull that is asymmetrical or distorted. It is commonly used in the context of infant health, as babies can develop plagiocephaly due to sleeping position or other factors. The term is relatively uncommon in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said the baby was plagiocephaly.","correct":"✓ The doctor said the baby had plagiocephaly. / ✓ The doctor said the baby was plagiocephalic.","note":"'Plagiocephaly' is the noun (the condition), while 'plagiocephalic' is the adjective (describing something related to the condition)."},{"incorrect":"✗ The baby's head is plagiocephalic, so it's fine.","correct":"✓ The baby's head is plagiocephalic, so we should consult a doctor.","note":"While mild plagiocephaly may resolve on its own, it's important to consult a doctor to rule out any underlying medical conditions and determine the best course of treatment."}],"priority":"★☆☆"},"related_words":{"derivatives":["plagiocephaly (noun: 斜頭症)"],"related_medical_terms":["craniosynostosis (頭蓋骨縫合早期癒合症)","torticollis (斜頸)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (highly specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Plagiocephalic' is a highly specialized medical term used to describe a head shape that is asymmetrical or distorted, typically due to plagiocephaly. It is not commonly used in everyday language and is primarily encountered in medical contexts or discussions related to infant health. Understanding this term requires a strong grasp of medical terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The pediatrician noted the infant's plagiocephalic head shape during the examination.","translation":"小児科医は診察中に乳児の斜頭の頭の形に気づいた。","type":"adjective","meaning_category":"medical condition"},{"sentence":"Parents were concerned about their child's plagiocephalic appearance.","translation":"親たちは子供の斜頭の外見を心配していた。","type":"adjective","meaning_category":"physical appearance"},{"sentence":"Early intervention can often correct plagiocephalic deformities.","translation":"早期介入は、多くの場合、斜頭変形を矯正することができる。","type":"adjective","meaning_category":"medical treatment"}]}