{"word":"unrhapsodical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"熱狂的でない、叙情的でない、感情を表に出さない","english_definition":"Not rhapsodical; lacking in enthusiasm or emotional expression.","examples":[{"sentence":"His review of the play was unrhapsodical, focusing more on technical aspects than emotional impact.","translation":"彼の劇評は熱狂的ではなく、感情的な影響よりも技術的な側面に焦点を当てていた。"},{"sentence":"She gave an unrhapsodical account of her travels, simply stating the facts without embellishment.","translation":"彼女は旅行について熱狂的な説明をせず、単に事実を飾り立てずに述べた。"}],"collocations":["unrhapsodical account","unrhapsodical review","unrhapsodical description"],"synonyms":["matter-of-fact","unemotional","unenthusiastic","factual","objective","reserved","calm","detached"],"antonyms":["rhapsodical","enthusiastic","emotional","effusive","passionate","lyrical"]}],"etymology":{"value":"\"Un-\" (not) + \"rhapsodical\" (resembling a rhapsody; extravagantly enthusiastic or emotional). \"Rhapsodical\" comes from \"rhapsody,\" which is derived from Greek \"rhapsodia\" (recitation of epic poetry).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌn.ræpˈsɒd.ɪ.kəl/","syllables":"un-rhap-sod-i-cal"},"inflection":{"adjective_forms":{"comparative":"more unrhapsodical","superlative":"most unrhapsodical"}},"usage_notes":{"explanation":"\"Unrhapsodical\" describes something that lacks the characteristics of a rhapsody, meaning it is not extravagantly enthusiastic, emotional, or lyrical. It is often used to describe accounts, reviews, or descriptions that are factual, objective, and lacking in emotional embellishment. The word implies a deliberate absence of emotional expression or enthusiasm.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unrhapsodical music was very moving.","correct":"✓ The rhapsodical music was very moving.","note":"\"Unrhapsodical\" means lacking in emotional expression, so it would not typically be described as moving. \"Rhapsodical\" would be more appropriate in this context."},{"incorrect":"✗ He gave a rhapsodical account, so it was very unrhapsodical.","correct":"✓ He gave a factual account, so it was very unrhapsodical.","note":"If an account is rhapsodical, it is enthusiastic and emotional. Therefore, it cannot also be unrhapsodical. A factual account would be more likely to be described as unrhapsodical."}],"priority":"★★☆"},"related_words":{"derivatives":["rhapsodical (adjective: 熱狂的な、叙情的な)","rhapsodically (adverb: 熱狂的に、叙情的に)","rhapsody (noun: 狂詩曲、熱狂的な表現)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - This word is not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unrhapsodical\" is a relatively rare and sophisticated term. It is used to describe something that lacks enthusiasm, emotional expression, or lyrical quality. Understanding its meaning requires familiarity with the word \"rhapsodical\" and the concept of a \"rhapsody,\" which refers to an enthusiastic or emotional expression, often in a literary or musical context. This word is most likely to be encountered in formal writing or academic discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The scientist presented an unrhapsodical analysis of the data, focusing solely on the statistical significance.","translation":"科学者はデータの熱狂的でない分析を提示し、統計的な有意性のみに焦点を当てた。","type":"adjective","meaning_category":"熱狂的でない"},{"sentence":"Her unrhapsodical response to the proposal suggested she was not particularly impressed.","translation":"彼女の提案に対する熱狂的でない反応は、彼女が特に感銘を受けていないことを示唆していた。","type":"adjective","meaning_category":"感情を表に出さない"},{"sentence":"Despite the beauty of the landscape, he offered only an unrhapsodical description.","translation":"風景の美しさにもかかわらず、彼は熱狂的でない描写しか提供しなかった。","type":"adjective","meaning_category":"叙情的でない"}]}