{"word":"Un-englished","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"英語らしくない、英語化されていない、英語の慣用句や表現を含まない","english_definition":"Not conforming to English language conventions; lacking English idioms or expressions; not Anglicized.","examples":[{"sentence":"The translation, while accurate, sounded rather un-englished.","translation":"その翻訳は正確だったが、いささか英語らしくない響きだった。"},{"sentence":"His speech was filled with foreign phrases, making it sound un-englished to native speakers.","translation":"彼のスピーチは外国語のフレーズで満たされており、ネイティブスピーカーには英語らしく聞こえなかった。"},{"sentence":"The text was deliberately un-englished to create a unique style.","translation":"その文章は意図的に英語らしくないように書かれ、独特のスタイルを作り出していた。"}],"collocations":["sound un-englished","appear un-englished","deliberately un-englished"],"synonyms":["non-English","unidiomatic","foreign-sounding","non-Anglicized"],"antonyms":["Anglicized","idiomatic","English-sounding"]}],"etymology":{"value":"\"Un-\" (not) + \"englished\" (made English, translated into English). Indicates something that has not been properly or naturally rendered into English.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈɪŋɡlɪʃt/","syllables":"Un-eng-lished"},"inflection":{"notes":"Adjective; no comparative or superlative forms."},"usage_notes":{"explanation":"\"Un-englished\" is often used to describe translations that are technically accurate but lack the natural flow and idiomatic expressions of native English. It can also refer to writing or speech that deliberately avoids English conventions for stylistic effect. The term implies a deficiency in the quality of the English, either unintentionally or by design.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The book was unenglish.","correct":"✓ The book was un-englished.","note":"The correct term is \"un-englished,\" not \"unenglish.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["English (verb, noun, adjective)","Anglicize (verb)","Anglicization (noun)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Un-englished\" is a relatively uncommon term used to describe something that does not sound natural or idiomatic in English. It's often applied to translations or writing that, while technically correct, lack the fluency and style of native English. Understanding this word requires a good grasp of English idioms and conventions."},"example_sentences":[{"sentence":"The literal translation resulted in an un-englished sentence that was difficult to understand.","translation":"直訳の結果、理解しにくい英語らしくない文になってしまった。","type":"adjective","meaning_category":"lacking English idioms"},{"sentence":"The author's deliberate use of unusual syntax gave the novel an un-englished feel.","translation":"著者が意図的に珍しい構文を使ったことで、その小説は英語らしくない雰囲気になった。","type":"adjective","meaning_category":"not conforming to English conventions"}]}