{"word":"coprogenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"糞に起因する、糞から生じる、または糞の中で成長する","english_definition":"Originating in, caused by, or growing in dung or feces.","examples":[{"sentence":"Coprogenic bacteria play a crucial role in the decomposition of organic matter in manure.","translation":"糞に由来するバクテリアは、肥料中の有機物の分解において重要な役割を果たします。"},{"sentence":"The coprogenic environment of the compost heap supports a diverse community of organisms.","translation":"堆肥の糞に由来する環境は、多様な生物群集を支えています。"}],"collocations":["coprogenic bacteria","coprogenic environment","coprogenic fungi"],"synonyms":["fecal","dung-borne","scatogenous"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'copros' (κόπρος) meaning 'dung' or 'feces' and '-genic' (γενής) meaning 'producing' or 'originating'.","priority":"★★★"},"pronunciation":{"ipa":"ˌkɒprəˈdʒɛnɪk/","syllables":"cop-ro-gen-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Coprogenic' is a technical term primarily used in scientific contexts, especially in biology, ecology, and soil science, to describe processes, organisms, or environments related to feces or dung. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The coprogenic smell of the flowers was overwhelming.","correct":"The pungent smell of the flowers was overwhelming.","note":"'Coprogenic' refers to origin or growth in dung, not the smell itself. Use 'pungent' or another descriptive adjective for smell."}],"priority":"★☆☆"},"related_words":{"derivatives":["coprogen (noun): A siderophore (iron-binding compound) produced by fungi, often found in dung-rich environments.","coprophagy (noun): The act of consuming feces."],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. Primarily found in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Coprogenic' is a highly specialized term rarely encountered outside of scientific or technical contexts. Understanding requires familiarity with biological and ecological terminology. The word describes something that originates from, is caused by, or grows in feces or dung. Due to its limited use, it is not part of general vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The researchers studied the coprogenic microorganisms found in the soil samples.","translation":"研究者たちは、土壌サンプル中に見られる糞に由来する微生物を研究しました。","type":"scientific","meaning_category":"糞に起因する"},{"sentence":"Certain coprogenic fungi thrive in the nutrient-rich environment of animal droppings.","translation":"特定の糞に由来する菌類は、動物の排泄物という栄養豊富な環境で繁殖します。","type":"scientific","meaning_category":"糞の中で成長する"}]}