{"word":"torpitude","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"無感覚、不活発、麻痺状態","english_definition":"a state of inactivity or sluggishness; dormancy.","examples":[{"sentence":"The bear fell into a state of torpitude during the winter months.","translation":"熊は冬の間、無感覚の状態に陥った。"},{"sentence":"The torpitude of the patient was a cause for concern.","translation":"患者の不活発な状態は懸念の原因だった。"},{"sentence":"After the long illness, he struggled to overcome his torpitude.","translation":"長い病の後、彼は不活発な状態を克服するのに苦労した。"}],"collocations":["state of torpitude","overcome torpitude","mental torpitude","physical torpitude"],"synonyms":["lethargy","sluggishness","apathy","dormancy","inertia","stupor"],"antonyms":["activity","alertness","vigor","liveliness"]}],"etymology":{"value":"Late Middle English: from late Latin torpitudō, from torpidus ‘numb, sluggish’ (see torpid).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɔːrpɪtjuːd/","syllables":"tor-pi-tude"},"inflection":{"noun_plural":"torpitudes (rare)"},"usage_notes":{"explanation":"\"Torpitude\" refers to a state of reduced physical or mental activity. It is often used to describe a temporary condition of dormancy or sluggishness, such as that experienced by hibernating animals or individuals recovering from illness. The term is relatively uncommon in everyday conversation and is more frequently encountered in formal or scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was in a state of torpid.","correct":"✓ He was in a state of torpitude.","note":"\"Torpitude\" is a noun, while \"torpid\" is an adjective. Use the correct form according to the context."},{"incorrect":"✗ She showed great torpitude in solving the problem.","correct":"✓ She showed great lethargy in solving the problem.","note":"\"Torpitude\" describes a state of inactivity, not a quality of effort. \"Lethargy\" might be a more appropriate synonym in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["torpid (adjective: inactive or sluggish)","torpidly (adverb: in an inactive or sluggish manner)"],"phrases":["fall into torpitude","overcome torpitude","state of torpitude"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Torpitude\" is a relatively rare and formal word that describes a state of inactivity or sluggishness. It's not commonly used in everyday conversation. You're more likely to encounter it in scientific or literary contexts when describing a state of dormancy or reduced activity, similar to hibernation. Because of its infrequent use, it's considered a word for advanced English learners."},"example_sentences":[{"sentence":"The prolonged heat induced a state of torpitude in the desert creatures.","translation":"長引く暑さは砂漠の生き物たちに無感覚の状態を引き起こした。","type":"general","meaning_category":"inactivity"},{"sentence":"After the surgery, he experienced a period of mental torpitude.","translation":"手術後、彼は精神的な不活発状態を経験した。","type":"medical","meaning_category":"sluggishness"},{"sentence":"The economic torpitude of the region led to widespread unemployment.","translation":"その地域の経済的な不活発は広範囲にわたる失業につながった。","type":"economic","meaning_category":"dormancy"}]}