{"word":"subordinacy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"従属、下位、下属関係","english_definition":"The state of being subordinate; the condition of being of lesser rank or importance.","examples":[{"sentence":"The subordinacy of the branch office to the main headquarters was clearly defined.","translation":"支店が本社に従属する関係は明確に定義されていた。"},{"sentence":"The report highlighted the subordinacy of environmental concerns to economic growth in the government's priorities.","translation":"その報告書は、政府の優先順位において、環境への配慮が経済成長に従属していることを強調した。"},{"sentence":"In the military structure, subordinacy is essential for maintaining order and discipline.","translation":"軍事構造においては、秩序と規律を維持するために従属関係が不可欠である。"}],"collocations":["hierarchical subordinacy (階層的な従属関係)","structural subordinacy (構造的な従属関係)","inherent subordinacy (内在的な従属関係)","relative subordinacy (相対的な従属関係)","legal subordinacy (法的な従属関係)"],"synonyms":["inferiority","dependence","subjection","secondary status","lower rank","subservience"],"antonyms":["superiority","dominance","independence","autonomy","primacy"]}],"etymology":{"value":"Derived from 'subordinate', which comes from the Latin 'subordinatus', the past participle of 'subordinare' meaning 'to place in an inferior order'. 'Sub' means 'under' and 'ordinare' means 'to order'. The suffix '-acy' denotes a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/səˈbɔːrdɪnəsi/","syllables":"suh-bor-di-na-cy"},"inflection":{"noun_plural":"subordinacies"},"usage_notes":{"explanation":"'Subordinacy' refers to the state or condition of being subordinate, meaning lower in rank, importance, or power. It often implies a hierarchical relationship where one entity is controlled or influenced by another. It's frequently used in organizational, legal, and social contexts to describe relationships of dependence or lesser status.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subordinacy of the decision was obvious.","correct":"✓ The subordination of the decision was obvious.","note":"'Subordinacy' refers to the state of being subordinate, while 'subordination' refers to the act of making something subordinate. In this case, 'subordination' is more appropriate as it refers to the act of making the decision less important."},{"incorrect":"✗ He felt subordinacy in the meeting.","correct":"✓ He felt subordinate in the meeting.","note":"'Subordinacy' is a noun referring to the state of being subordinate. 'Subordinate' is the adjective describing his feeling."}],"priority":"★☆☆"},"related_words":{"derivatives":["subordinate (adjective, noun, verb)","subordination (noun)","subordinative (adjective)"],"phrasal_verbs":[],"related_concepts":["hierarchy","dependency","authority","power relations","control","influence"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Subordinacy' is a relatively formal and abstract noun that describes the state of being lower in rank or importance compared to something else. It is often used in discussions about organizational structures, power dynamics, and legal relationships. Understanding this word requires a good grasp of abstract concepts and the ability to recognize hierarchical relationships. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The company's success depends on the subordinacy of individual goals to the overall mission.","translation":"会社の成功は、個人の目標が全体的な使命に従属することにかかっている。","type":"noun","meaning_category":"従属"},{"sentence":"The subordinacy of emotions to reason is a common theme in philosophical debates.","translation":"感情が理性に劣るという考えは、哲学的な議論における共通のテーマである。","type":"noun","meaning_category":"下位"},{"sentence":"The contract clearly outlined the subordinacy of the subcontractor to the main contractor.","translation":"契約書には、下請け業者が元請け業者に従属することが明確に記載されていた。","type":"noun","meaning_category":"下属関係"}]}