{"word":"heautophany","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"自分自身の幻影を見ること、または自分自身が神格化された姿で現れること","english_definition":"The appearance of oneself to oneself; a vision of oneself, or the appearance of oneself in a divine or glorified form.","examples":[{"sentence":"The protagonist experienced a strange heautophany during his fever dream.","translation":"主人公は熱にうなされている間、奇妙な自己幻視を経験した。"},{"sentence":"Some religious texts describe heautophany as a sign of spiritual enlightenment.","translation":"いくつかの宗教的な文献では、自己幻視は精神的な悟りの兆候として記述されている。"}],"collocations":["experience heautophany","religious heautophany","spiritual heautophany"],"synonyms":["autoscopy","bilocation","doppelganger sighting"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'heauto-' (self) and 'phany' (appearance, manifestation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːɔːˈtɒfəni/","syllables":"he-au-to-pha-ny"},"inflection":{"noun_plural":"heautophanies"},"usage_notes":{"explanation":"'Heautophany' is a relatively rare and specialized term, primarily used in religious, philosophical, or psychological contexts to describe the phenomenon of seeing a vision of oneself. It often carries a connotation of spiritual or mystical significance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Heautophany is when you see someone else's ghost.","correct":"✓ Heautophany is when you see a vision of yourself.","note":"Heautophany specifically refers to seeing a vision of oneself, not someone else's ghost."}],"priority":"★☆☆"},"related_words":{"derivatives":["heautoscopic (adjective: relating to heautoscopy)","heautoscopy (noun: the experience of seeing one's own body from an outside perspective)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. A rare and specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Heautophany' is a very rare and technical word. It refers to the experience of seeing a vision of oneself, often in a religious or spiritual context. Because of its rarity and specific meaning, it is not commonly used in everyday language."},"example_sentences":[{"sentence":"The mystic claimed to have experienced a profound heautophany during his meditation.","translation":"その神秘主義者は、瞑想中に深遠な自己幻視を経験したと主張した。","type":"general","meaning_category":"自己幻視"},{"sentence":"Scholars debate the significance of heautophany in ancient religious practices.","translation":"学者たちは、古代の宗教的慣習における自己幻視の重要性について議論している。","type":"academic","meaning_category":"自己幻視"}]}