{"word":"allachesthesia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アロケステジア、異所感覚：触覚刺激が加えられた場所とは異なる場所で感覚が生じる状態。","english_definition":"A condition in which a tactile stimulus is perceived at a location other than where it was applied.","examples":[{"sentence":"Allachesthesia can be a symptom of certain neurological disorders.","translation":"アロケステジアは、特定の神経学的疾患の症状である可能性がある。"},{"sentence":"The patient reported feeling the touch on their left arm when it was actually applied to their right arm, demonstrating allachesthesia.","translation":"患者は、実際には右腕に触覚刺激が加えられたときに、左腕に触れた感覚を感じたと報告し、アロケステジアを示した。"}],"collocations":["tactile allachesthesia","visual allachesthesia","auditory allachesthesia"],"synonyms":["alloesthesia","allochiria"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「allos」（他の）、「aisthesis」（感覚）、「-ia」（状態）から構成される。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌæləkiːsˈθiːziə/","syllables":"al-la-ches-the-si-a"},"inflection":{"noun_plural":"allachesthesias"},"usage_notes":{"explanation":"Allachesthesia is a neurological phenomenon where a sensory stimulus is mislocalized, meaning the sensation is felt at a different location than where the stimulus was applied. It is often associated with damage to the parietal lobe or other parts of the sensory pathways in the brain. The condition can affect various senses, including touch, vision, and hearing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has allesthesia.","correct":"✓ He has allachesthesia.","note":"Allesthesia is a more general term for altered sensory perception. Allachesthesia is a specific type of allesthesia where the sensation is felt at a different location."}],"priority":"★☆☆"},"related_words":{"derivatives":["allesthesia","alloesthesia","allochiria"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Allachesthesia is a highly specialized term used in neurology to describe a specific type of sensory misperception. It is unlikely to be encountered outside of medical or scientific contexts. Understanding requires knowledge of neurological conditions and sensory processing.","priority":"★☆☆"},"example_sentences":[{"sentence":"The doctor tested for allachesthesia by lightly touching different areas of the patient's skin.","translation":"医師は、患者の皮膚のさまざまな領域を軽く触れることで、アロケステジアの検査を行った。","type":"general","meaning_category":"Definition"},{"sentence":"Allachesthesia can sometimes be managed with sensory retraining techniques.","translation":"アロケステジアは、感覚再訓練法によって管理できる場合がある。","type":"treatment","meaning_category":"Definition"}]}