{"word":"subrebellion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A minor or localized act of rebellion; a smaller-scale uprising or resistance within a larger system or organization.","english_definition":"A smaller, less organized, or localized act of rebellion, often within a larger system or organization.","examples":[{"sentence":"The students engaged in a subrebellion against the school's strict dress code.","translation":"学生たちは学校の厳しい服装規定に対して小規模な反乱を起こした。"},{"sentence":"The employees' refusal to work overtime was seen as a subrebellion against management.","translation":"従業員の残業拒否は、経営陣に対する小規模な反乱と見なされた。"},{"sentence":"Within the larger political movement, there were several subrebellions advocating for different strategies.","translation":"より大きな政治運動の中で、異なる戦略を提唱するいくつかの小規模な反乱があった。"}],"collocations":["minor subrebellion","student subrebellion","workplace subrebellion","organizational subrebellion"],"synonyms":["insubordination","resistance","protest","minor revolt","localized uprising"],"antonyms":["obedience","compliance","submission","conformity"]}],"etymology":{"value":"Formed by combining the prefix 'sub-' (meaning under, below, or secondary) with the noun 'rebellion'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsʌbrɪˈbɛliən/","syllables":"sub-re-bel-li-on"},"inflection":{"noun_plural":"subrebellions"},"usage_notes":{"explanation":"'Subrebellion' refers to a smaller, often less organized, act of resistance compared to a full-scale rebellion. It often occurs within a larger system, such as a school, workplace, or political movement. The term implies a challenge to authority but on a limited scale.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The subrebellion completely overthrew the government.","correct":"✓ The rebellion completely overthrew the government.","note":"A subrebellion is a smaller act of resistance, not a complete overthrow. Use 'rebellion' for a large-scale uprising."},{"incorrect":"✗ He was rewarded for his subrebellion.","correct":"✓ He was punished for his subrebellion.","note":"Subrebellions are typically acts of defiance and are usually met with negative consequences."}],"priority":"★★☆"},"related_words":{"derivatives":["subrebellious (adjective)"],"phrasal_verbs":[],"related_terms":["rebellion","insurrection","uprising","resistance","protest","civil disobedience"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'subrebellion' is a relatively uncommon term used to describe a small-scale or localized act of resistance or defiance against authority. It is often used in contexts where a larger system or organization faces internal dissent that does not amount to a full-blown rebellion. Understanding the prefix 'sub-' (meaning 'under' or 'lesser') is key to grasping the meaning of this word. It is more frequently encountered in academic or analytical writing rather than everyday conversation."},"example_sentences":[{"sentence":"The teacher saw the whispering and note-passing as a minor subrebellion against her authority.","translation":"先生は、ささやきやノートのやり取りを、彼女の権威に対する小規模な反乱と見なした。","type":"noun","meaning_category":"minor resistance"},{"sentence":"The open-source community experienced a subrebellion when some developers forked the project due to disagreements over its direction.","translation":"オープンソースコミュニティは、プロジェクトの方向性に関する意見の相違から一部の開発者がプロジェクトをフォークした際に、小規模な反乱を経験した。","type":"noun","meaning_category":"localized uprising"},{"sentence":"The employees' silent protest was a subrebellion against the company's new policies.","translation":"従業員の無言の抗議は、会社の新しい方針に対する小規模な反乱だった。","type":"noun","meaning_category":"act of defiance"}]}