{"word":"VLSI","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"大規模集積回路 (超大規模集積回路)","english_definition":"Very-Large-Scale Integration; the process of creating an integrated circuit (IC) with a very high density of components.","examples":[{"sentence":"VLSI technology has enabled the creation of complex microprocessors.","translation":"VLSI技術は、複雑なマイクロプロセッサの作成を可能にした。"},{"sentence":"The design of VLSI circuits requires specialized software and expertise.","translation":"VLSI回路の設計には、特殊なソフトウェアと専門知識が必要である。"}],"collocations":["VLSI design (VLSI設計)","VLSI technology (VLSI技術)","VLSI circuit (VLSI回路)","VLSI chip (VLSIチップ)"],"synonyms":["integrated circuit","microchip","IC"],"antonyms":[]}],"etymology":{"value":"An acronym for Very-Large-Scale Integration.","priority":"★★★"},"pronunciation":{"ipa":"ˌviː.el.esˈaɪ","syllables":"V-L-S-I"},"inflection":{"noun_plural":"VLSIs"},"usage_notes":{"explanation":"VLSI (Very-Large-Scale Integration) refers to the process of integrating hundreds of thousands of transistors on a single chip. It's a technology used in creating complex integrated circuits like microprocessors, memory chips, and other advanced electronic components. The term is primarily used in the context of electrical engineering, computer engineering, and related fields.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is working on VLSIs.","correct":"✓ He is working on VLSI.","note":"VLSI is often used as a singular noun referring to the technology or field, even when discussing multiple circuits. However, VLSIs is acceptable when referring to multiple distinct integrated circuits."}],"priority":"★★☆"},"related_words":{"derivatives":["ULSI (Ultra-Large-Scale Integration)","ASIC (Application-Specific Integrated Circuit)","FPGA (Field-Programmable Gate Array)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"VLSI (Very-Large-Scale Integration) is a technical term referring to the process of creating integrated circuits with a very high density of components. It's used in the context of electrical engineering and computer science. Understanding VLSI requires familiarity with semiconductor technology and digital circuit design.","priority":"★★☆"},"example_sentences":[{"sentence":"Modern computers rely heavily on VLSI technology for their processing power.","translation":"現代のコンピュータは、その処理能力のためにVLSI技術に大きく依存している。","type":"noun","meaning_category":"大規模集積回路"},{"sentence":"The development of VLSI has revolutionized the electronics industry.","translation":"VLSIの開発は、エレクトロニクス産業に革命をもたらした。","type":"noun","meaning_category":"大規模集積回路"}]}