{"word":"employer-interfered","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(労働法において)雇用主が不当に介入した、雇用主の不当介入による","english_definition":"(In labor law) pertaining to a situation where an employer has unlawfully interfered with, restrained, or coerced employees in the exercise of their rights to organize and bargain collectively.","examples":[{"sentence":"The union filed an unfair labor practice charge alleging employer-interfered elections.","translation":"労働組合は、雇用主が不当に介入した選挙があったとして、不当労働行為の申し立てを行った。"},{"sentence":"The NLRB found the company guilty of employer-interfered activities during the unionization drive.","translation":"全国労働関係委員会は、会社が労働組合結成運動中に雇用主の不当介入行為を行ったとして有罪判決を下した。"}],"collocations":["employer-interfered election","employer-interfered activities","employer-interfered conduct","employer-interfered campaign"],"synonyms":["employer-dominated","employer-influenced","anti-union","union-busting"],"antonyms":["union-supported","employee-led","fair labor practices"]}],"etymology":{"value":"A compound word formed by combining 'employer' (雇用主), 'interfered' (介入された), indicating that the employer has intervened in some process, usually related to labor rights or union activities.","priority":"Low"},"pronunciation":{"ipa":"/ɪmˈplɔɪər ˌɪntərˈfɪərd/","syllables":"im-ploy-er in-ter-fered"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms."},"usage_notes":{"explanation":"This term is primarily used in the context of labor law and union organizing. It describes situations where an employer's actions are deemed to have illegally influenced or prevented employees from exercising their rights to form or join a union, or to engage in collective bargaining. Such actions can include threats, intimidation, promises of benefits, or surveillance of union activities.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The employee was employer-interfered.","correct":"The employee was affected by employer-interfered activities.","note":"The adjective 'employer-interfered' typically modifies a noun describing the situation or activity, not the employee directly."}],"priority":"Low"},"related_words":{"derivatives":["interference (名詞: 介入)","interfere (動詞: 介入する)","employer (名詞: 雇用主)","employee (名詞: 従業員)"],"phrasal_verbs":[],"related_legal_terms":["unfair labor practice","National Labor Relations Act (NLRA)","collective bargaining","unionization","coercion","restraint"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"This term is highly specialized and primarily used within legal and labor relations contexts. Understanding requires familiarity with labor law principles and union organizing processes. The term describes situations where an employer's actions are deemed to have illegally influenced or prevented employees from exercising their rights to form or join a union, or to engage in collective bargaining. It's not a term commonly encountered in general conversation or writing."},"example_sentences":[{"sentence":"The labor board investigated the allegations of employer-interfered voting during the union election.","translation":"労働委員会は、労働組合選挙中の雇用主の不当介入による投票の申し立てを調査した。","type":"adjective","meaning_category":"Labor Law"},{"sentence":"The company was accused of creating an employer-interfered environment that discouraged union membership.","translation":"その会社は、労働組合への加入を妨げる雇用主の不当介入による環境を作り出したとして非難された。","type":"adjective","meaning_category":"Labor Relations"}]}