{"word":"explainably","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"説明可能なように、説明できる形で","english_definition":"in a way that can be explained or accounted for.","examples":[{"sentence":"The phenomenon is explainably linked to changes in atmospheric pressure.","translation":"その現象は、説明可能な形で気圧の変化と関連付けられています。"},{"sentence":"His behavior, while unusual, was explainably motivated by fear.","translation":"彼の行動は、普通ではないものの、説明可能な形で恐怖によって動機付けられていました。"}],"collocations":["explainably different","explainably related","explainably motivated"],"synonyms":["understandably","justifiably","accountably","rationally"],"antonyms":["inexplicably","unexplainably","mysteriously","irrationally"]}],"etymology":{"value":"The word 'explainably' is formed by adding the suffix '-ly' to the adjective 'explainable'. 'Explainable' comes from the verb 'explain' and the suffix '-able', indicating the capacity to be explained.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˈspleɪnəbli/","syllables":"ex-plain-a-bly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Explainably' is used to indicate that something can be understood or accounted for through explanation. It suggests that there is a logical or rational reason behind the event, situation, or behavior being described. It is often used to contrast with situations that are inexplicable or mysterious.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The accident was explainable, so it wasn't explainably.","correct":"✓ The accident was explainable, so it wasn't inexplicable.","note":"'Explainable' is an adjective, while 'explainably' is an adverb. The sentence requires an adjective to describe the accident."},{"incorrect":"✗ He acted explainably, but I still didn't understand.","correct":"✓ He acted strangely, but I still didn't understand. / ✓ His actions, while unusual, were explainably motivated.","note":"If understanding is still lacking, it suggests the action was not easily explainable. Consider using a word like 'strangely' or rephrasing to emphasize the explainable motivation despite the unusual nature of the actions."}],"priority":"★★☆"},"related_words":{"derivatives":["explain (verb)","explanation (noun)","explainable (adjective)","inexplainable (adjective)","inexplainably (adverb)"],"antonyms":["inexplicably"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Explainably' is an adverb used to describe how something can be understood through explanation. It is more formal and less common than words like 'understandably' or 'logically'. It is typically used in contexts where it's important to emphasize that something has a rational or understandable basis, even if it's not immediately obvious. This word is suitable for advanced learners who need to express nuanced meanings related to understanding and explanation."},"example_sentences":[{"sentence":"The increase in sales is explainably due to the new marketing campaign.","translation":"売上増加は、説明可能な形で新しいマーケティングキャンペーンによるものです。","type":"adverb","meaning_category":"reason/cause"},{"sentence":"The scientist demonstrated how the phenomenon was explainably consistent with existing theories.","translation":"科学者は、その現象が説明可能な形で既存の理論と一致することを示しました。","type":"adverb","meaning_category":"consistency/agreement"},{"sentence":"The company's decision, while unpopular, was explainably driven by financial constraints.","translation":"その会社の決定は、不評ではあるものの、説明可能な形で財政的制約によって推進されました。","type":"adverb","meaning_category":"motivation/justification"}]}