{"word":"FGM-advocating","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"女性器切除（FGM）を支持する、擁護する","english_definition":"Supporting or advocating for Female Genital Mutilation (FGM).","examples":[{"sentence":"The organization condemns any FGM-advocating groups.","translation":"その組織は、FGMを支持するいかなる団体も非難する。"},{"sentence":"FGM-advocating practices are illegal in many countries.","translation":"FGMを支持する行為は、多くの国で違法である。"}],"collocations":["FGM-advocating groups","FGM-advocating practices","FGM-advocating individuals"],"synonyms":["pro-FGM","FGM-supporting"],"antonyms":["anti-FGM","FGM-opposing"]}],"etymology":{"value":"Formed by combining \"FGM\" (Female Genital Mutilation) with \"advocating,\" the present participle of the verb \"advocate.\"","priority":"low"},"pronunciation":{"ipa":"/ˌɛfˌdʒiːˈɛm ˈædvəˌkeɪtɪŋ/","syllables":"F-G-M-ad-vo-cat-ing"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"This term is used to describe individuals, groups, or practices that support or promote Female Genital Mutilation (FGM). It is typically used in a negative context, as FGM is widely recognized as a harmful and human rights-violating practice.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a FGM advocating.","correct":"✓ He is FGM-advocating. / ✓ He is an FGM advocate.","note":"When used as an adjective, it should be \"FGM-advocating.\" To refer to a person, use \"FGM advocate\" (though this is less common and could be misinterpreted)."},{"incorrect":"✗ FGM-advocating is good.","correct":"✓ FGM advocacy is harmful.","note":"It is important to accurately represent the harmful nature of FGM advocacy."}],"priority":"medium"},"related_words":{"derivatives":["advocate (noun): a person who supports or defends a cause.","advocacy (noun): public support for or recommendation of a particular cause or policy."],"phrasal_verbs":[],"priority":"low"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"low"},"readability_explanation":{"level":"C1","text":"The term \"FGM-advocating\" is a specialized term used in discussions about human rights, women's health, and cultural practices. It describes the act of supporting or promoting Female Genital Mutilation (FGM), a practice widely condemned as harmful and a violation of human rights. Understanding this term requires familiarity with the issue of FGM and related ethical and legal considerations."},"example_sentences":[{"sentence":"The report highlighted the dangers of FGM-advocating rhetoric.","translation":"その報告書は、FGMを支持するレトリックの危険性を強調した。","type":"adjective","meaning_category":"supporting FGM"},{"sentence":"Several organizations are working to counter FGM-advocating messages in the community.","translation":"いくつかの組織が、地域社会におけるFGMを支持するメッセージに対抗するために活動している。","type":"adjective","meaning_category":"promoting FGM"}]}