{"word":"outmantle","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(比喩的に)～を覆い隠す、～を凌駕する、～を上回る","english_definition":"To surpass or exceed something, especially in importance or prominence; to cover or conceal as with a mantle.","examples":[{"sentence":"The new skyscraper outmantled all other buildings in the city.","translation":"その新しい超高層ビルは、市内の他のすべての建物を凌駕した。"},{"sentence":"Her achievements soon outmantled those of her rivals.","translation":"彼女の業績はすぐにライバルたちのものを上回った。"},{"sentence":"The fog outmantled the valley, making it impossible to see.","translation":"霧が谷を覆い隠し、何も見えなくした。"}],"collocations":["outmantle expectations","outmantle rivals","outmantle the competition","outmantle the past"],"synonyms":["surpass","exceed","outshine","overshadow","eclipse","cover","conceal"],"antonyms":["underperform","fall short","reveal","uncover"]}],"etymology":{"value":"The word 'outmantle' is formed by combining the prefix 'out-' (meaning 'surpassing' or 'exceeding') with the word 'mantle' (meaning 'to cover' or 'a cloak'). The etymology suggests the act of exceeding or surpassing something to the point of covering or concealing it.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊtˈmæntəl/","syllables":"out-man-tle"},"inflection":{"verb_forms":{"present_simple":["outmantle","outmantles"],"past_simple":"outmantled","past_participle":"outmantled","present_participle":"outmantling"}},"usage_notes":{"explanation":"'Outmantle' is a relatively rare and somewhat literary word. It is used to describe the act of surpassing or exceeding something in a significant way, often to the point of obscuring or overshadowing it. It can also mean to literally cover or conceal something, but this usage is less common. The word carries a sense of dramatic or complete surpassing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sun outmantled the moon at night.","correct":"✓ The sun outshines the moon during the day.","note":"'Outmantle' implies a more significant and comprehensive surpassing than simply being brighter. 'Outshine' is more appropriate in this context."},{"incorrect":"✗ He tried to outmantle his mistake by apologizing.","correct":"✓ He tried to atone for his mistake by apologizing.","note":"'Outmantle' is not typically used to describe correcting a mistake. 'Atone' or 'make up for' would be more suitable."}],"priority":"★★☆"},"related_words":{"derivatives":["mantle (noun: a cloak; something that covers or conceals)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Outmantle' is a sophisticated word meaning to surpass or exceed something to the point of covering or concealing it. It is not commonly used in everyday language. It implies a significant degree of surpassing or overshadowing. Understanding the etymology (out- + mantle) helps to grasp its meaning. It is more frequently found in literary or formal contexts."},"example_sentences":[{"sentence":"The artist's later works completely outmantled his earlier, more tentative efforts.","translation":"その芸術家の後期の作品は、初期の試作的な作品を完全に凌駕した。","type":"verb","meaning_category":"凌駕する"},{"sentence":"The dense fog seemed to outmantle the entire city, reducing visibility to near zero.","translation":"濃霧が街全体を覆い隠しているようで、視界はほぼゼロになった。","type":"verb","meaning_category":"覆い隠す"},{"sentence":"Her dedication and hard work outmantled all expectations, leading to her rapid promotion.","translation":"彼女の献身と努力はすべての期待を上回り、急速な昇進につながった。","type":"verb","meaning_category":"上回る"}]}