{"word":"affirmation-seeking","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"承認を求める、肯定的な評価を求める","english_definition":"Desiring or seeking validation, approval, or positive feedback from others.","examples":[{"sentence":"His constant affirmation-seeking behavior annoyed his colleagues.","translation":"彼の絶え間ない承認欲求は同僚をイライラさせた。"},{"sentence":"She engaged in affirmation-seeking posts on social media.","translation":"彼女は肯定的な評価を求める投稿をソーシャルメディアで行った。"},{"sentence":"Affirmation-seeking individuals often have low self-esteem.","translation":"承認を求める人は、しばしば自己肯定感が低い。"}],"collocations":["affirmation-seeking behavior","affirmation-seeking posts","affirmation-seeking tendencies"],"synonyms":["approval-seeking","validation-seeking","attention-seeking","praise-seeking"],"antonyms":["self-assured","confident","self-reliant","independent"],"notes":"This term often carries a slightly negative connotation, suggesting a neediness or insecurity."}],"etymology":{"value":"Derived from the noun 'affirmation' (the act of affirming or stating something positively) and the verb 'seek' (to attempt to find something). The combination describes the act of actively trying to obtain positive affirmations from others.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæfərˈmeɪʃən ˈsiːkɪŋ/","syllables":"af-fir-ma-tion seek-ing"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms."},"usage_notes":{"explanation":"'Affirmation-seeking' describes the behavior of individuals who actively seek out positive feedback or validation from others. This behavior often stems from a need for reassurance or a lack of self-confidence. It can manifest in various ways, such as constantly asking for opinions, posting content online specifically to receive likes or comments, or engaging in behaviors designed to elicit praise. While seeking validation is a normal human desire, excessive affirmation-seeking can be indicative of underlying issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is affirmation-seek.","correct":"✓ He is affirmation-seeking.","note":"'Affirmation-seeking' is an adjective, so it should be used to describe a noun (e.g., 'affirmation-seeking behavior'). 'Affirmation-seek' is not a standard term."},{"incorrect":"✗ She is affirmation-sought.","correct":"✓ She is affirmation-seeking.","note":"'Affirmation-sought' is not the correct term to describe someone who is actively seeking affirmation. 'Affirmation-seeking' is the appropriate adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["affirmation (noun)","seek (verb)"],"related_terms":["attention-seeking","validation","approval","self-esteem","insecurity"],"priority":"★★☆"},"level_frequency":{"level":"C1","frequency_google_ngram":"Low frequency, but increasing in usage, especially in psychological and social contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Affirmation-seeking' is a term used to describe the behavior of someone who actively looks for positive feedback or approval from other people. It's often used in discussions about psychology or social behavior. If someone is 'affirmation-seeking,' it means they have a strong desire to be told they are good, capable, or valued by others. This can be a normal human desire, but it can also become a problem if it's excessive or driven by low self-esteem."},"example_sentences":[{"sentence":"The politician's constant reliance on polls demonstrated his affirmation-seeking tendencies.","translation":"その政治家の世論調査への絶え間ない依存は、彼の承認欲求の傾向を示していた。","type":"adjective","meaning_category":"seeking approval"},{"sentence":"The artist's Instagram feed was filled with affirmation-seeking selfies.","translation":"そのアーティストのインスタグラムのフィードは、肯定的な評価を求める自撮りでいっぱいだった。","type":"adjective","meaning_category":"seeking validation"},{"sentence":"Therapy can help individuals address the root causes of their affirmation-seeking behavior.","translation":"セラピーは、承認を求める行動の根本的な原因に対処するのに役立つ。","type":"adjective","meaning_category":"seeking reassurance"}]}