{"word":"phyllosoma","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"フィロソーマ幼生（イセエビなどの幼生の一形態）","english_definition":"A larval stage of some crustaceans, especially spiny lobsters, slipper lobsters, and true lobsters, characterized by a flattened, transparent body.","examples":[{"sentence":"The phyllosoma larva drifts in the ocean for many months.","translation":"フィロソーマ幼生は数ヶ月間海を漂う。"},{"sentence":"Researchers are studying the development of phyllosoma larvae in aquaculture.","translation":"研究者たちは養殖におけるフィロソーマ幼生の成長を研究している。"}],"collocations":["phyllosoma larva","phyllosoma stage","phyllosoma development","phyllosoma culture"],"synonyms":["larva","crustacean larva"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek φύλλον (phúllon, \"leaf\") + σῶμα (sôma, \"body\"), referring to the leaf-like shape of the larva.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɪləˈsoʊmə/","syllables":"phyl-lo-so-ma"},"inflection":{"noun_plural":"phyllosomas or phyllosomae"},"usage_notes":{"explanation":"Phyllosoma larvae are a distinctive larval form found in several families of decapod crustaceans, most notably the Palinuridae (spiny lobsters), Scyllaridae (slipper lobsters), and some true lobsters. They are characterized by their flattened, transparent bodies and long legs, which aid in swimming and feeding in the planktonic environment. The phyllosoma stage can last for several months to over a year, during which the larvae undergo multiple molts before metamorphosing into the post-larval or puerulus stage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ phyllosomas larva","correct":"✓ phyllosoma larva","note":"'Phyllosoma' is the name of the larval stage, so it's used as an adjective here. The plural of 'phyllosoma' is 'phyllosomas' or 'phyllosomae'."},{"incorrect":"✗ phyllosoma are","correct":"✓ phyllosoma is","note":"When referring to the phyllosoma stage in general, use the singular form with 'is'. When referring to multiple individual larvae, use 'phyllosomas' or 'phyllosomae' with 'are'."}],"priority":"★☆☆"},"related_words":{"derivatives":["phyllosomidae (family name sometimes used)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"None (specialized scientific term)","frequency_google_ngram":"Low frequency (scientific context)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Phyllosoma' is a specialized scientific term used in the field of marine biology and zoology to describe a specific larval stage of certain crustaceans, particularly lobsters. Understanding this term requires familiarity with biological terminology and crustacean life cycles. Due to its specialized nature, it is not commonly encountered outside of scientific contexts."},"example_sentences":[{"sentence":"The **phyllosoma** larva is uniquely adapted for planktonic life.","translation":"フィロソーマ幼生は浮遊生活に特有の適応をしている。","type":"noun","meaning_category":"description"},{"sentence":"Scientists track the dispersal of **phyllosomas** to understand lobster population dynamics.","translation":"科学者たちはイセエビの個体数動態を理解するためにフィロソーマ幼生の分散を追跡する。","type":"noun (plural)","meaning_category":"research"}]}