{"word":"semipunitory","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"部分的に懲罰的な、ある程度懲罰的な","english_definition":"Partially or somewhat punitive; involving some degree of punishment.","examples":[{"sentence":"The fine was semipunitory, designed more to deter future violations than to severely penalize the offender.","translation":"その罰金は部分的に懲罰的なものであり、違反者を厳しく罰することよりも、将来の違反を抑止することを目的としていました。"},{"sentence":"The new regulations included semipunitory measures to encourage compliance.","translation":"新しい規制には、コンプライアンスを促進するための、ある程度懲罰的な措置が含まれていました。"}],"collocations":["semipunitory fine","semipunitory measure","semipunitory action"],"synonyms":["partially punitive","somewhat punitive","disciplinary","corrective"],"antonyms":["nonpunitive","rewarding","encouraging"]}],"etymology":{"value":"The word 'semipunitory' is formed by combining the prefix 'semi-' (meaning 'partially' or 'half') with the word 'punitory' (meaning 'punitive' or 'related to punishment').","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmɪˈpjuːnɪtɔːri/","syllables":"se-mi-pu-ni-to-ry"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms, which are less common for this word.","comparative":"more semipunitory","superlative":"most semipunitory"},"usage_notes":{"explanation":"The term 'semipunitory' is used to describe actions or measures that are intended to punish to some extent but are not fully or severely punitive. It often implies a balance between punishment and other goals, such as deterrence or correction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The policy was completely semipunitory.","correct":"✓ The policy was somewhat semipunitory.","note":"'Semipunitory' implies a partial or limited degree of punishment, so it cannot be 'completely' so. Use 'somewhat' or 'partially' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["semi- (prefix meaning 'half' or 'partially')","punitory (adjective: punitive)","punitive (adjective: inflicting or aiming at punishment)","punishment (noun: the infliction or imposition of a penalty as retribution for an offense)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - The term is relatively rare and more likely to be found in legal or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Semipunitory' is a relatively uncommon word used to describe something that is partially or somewhat punitive. It suggests that an action or measure involves some degree of punishment but is not entirely or severely punitive. The prefix 'semi-' indicates that the punishment is not complete or absolute. This term is more likely to appear in formal or legal contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The judge imposed a semipunitory sentence, balancing the need for justice with the possibility of rehabilitation.","translation":"裁判官は、正義の必要性とリハビリの可能性のバランスを取りながら、ある程度懲罰的な判決を下しました。","type":"adjective","meaning_category":"partially punitive"},{"sentence":"The company implemented semipunitory measures to address minor infractions of the safety regulations.","translation":"会社は、安全規制の軽微な違反に対処するために、ある程度懲罰的な措置を実施しました。","type":"adjective","meaning_category":"somewhat punitive"}]}