{"word":"schoolmaid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語)女学校教師、女教師","english_definition":"(archaic) A female schoolteacher.","examples":[{"sentence":"The schoolmaid was very strict with her students.","translation":"その女教師は生徒たちにとても厳しかった。"},{"sentence":"In the old days, the schoolmaid often lived in the schoolhouse.","translation":"昔は、女教師はよく校舎に住んでいた。"}],"collocations":["country schoolmaid (田舎の女教師)"],"synonyms":["schoolteacher","teacher","schoolmarm"],"antonyms":["schoolmaster"],"notes":"This term is now considered archaic and somewhat old-fashioned. It is rarely used in modern English.","etymology":{"value":"'School' + 'maid'. 'Maid' originally meant a young, unmarried woman, but in this context, it simply denotes a female person.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskuːlmeɪd/","syllables":"school-maid"},"inflection":{"noun_plural":"schoolmaids"},"usage_notes":{"explanation":"The term 'schoolmaid' is an outdated term for a female schoolteacher. It is not commonly used today, and the more modern and neutral term 'schoolteacher' or simply 'teacher' is preferred. The term may carry connotations of a young, unmarried woman, which is not necessarily accurate or relevant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a schoolmaid in the university.","correct":"✓ She is a teacher in the university. / She is a professor at the university.","note":"'Schoolmaid' is generally used for teachers in primary or secondary schools, not universities."}],"priority":"★☆☆"},"related_words":{"derivatives":["schoolmaster (male schoolteacher)","schoolmarm (stereotypical female schoolteacher, often strict)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (archaic)","frequency_google_ngram":"Very low frequency (archaic)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Schoolmaid' is an archaic term, meaning it is no longer in common use. It refers to a female schoolteacher, especially in the past. Because of its outdated nature, it is unlikely to be encountered in everyday conversation or modern texts. Its usage is primarily limited to historical contexts or literature. Therefore, understanding this word is more relevant for comprehending older texts than for practical communication."},"example_sentences":[{"sentence":"The schoolmaid rang the bell to signal the start of class.","translation":"女教師は授業の開始を知らせるためにベルを鳴らした。","type":"noun","meaning_category":"female schoolteacher"},{"sentence":"He remembered his first schoolmaid with fondness.","translation":"彼は最初の女教師を懐かしく思い出した。","type":"noun","meaning_category":"female schoolteacher"}]}]}