{"word":"hyperplastic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"過形成の、過形成性の","english_definition":"Relating to or characterized by hyperplasia (an abnormal increase in the number of cells in a tissue or organ).","examples":[{"sentence":"The biopsy revealed hyperplastic changes in the tissue.","translation":"生検の結果、組織に過形成性の変化が見られました。"},{"sentence":"Hyperplastic polyps are often benign but can sometimes become cancerous.","translation":"過形成ポリープはしばしば良性ですが、癌化することもあります。"}],"collocations":["hyperplastic polyp","hyperplastic tissue","hyperplastic lesion","hyperplastic growth"],"synonyms":["proliferative","hypertrophic"],"antonyms":["atrophic","hypoplastic"]},{"part_of_speech":"adjective","definition":"(比喩的に)急増している、過剰に増殖している","english_definition":"(Figuratively) Increasing rapidly; proliferating excessively.","examples":[{"sentence":"The city's hyperplastic growth strained its infrastructure.","translation":"都市の急増的な成長は、インフラに負担をかけました。"},{"sentence":"The hyperplastic bureaucracy made it difficult to get anything done.","translation":"肥大化した官僚組織は、何をするにも困難にしました。"}],"collocations":["hyperplastic growth","hyperplastic bureaucracy"],"synonyms":["proliferating","expanding","burgeoning"],"antonyms":["declining","shrinking"]}],"etymology":{"value":"From 'hyper-' (excessive) + 'plastic' (capable of being molded or developed). The term refers to the excessive proliferation of cells, leading to an increase in tissue mass.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˈplæstɪk/","syllables":"hy·per·plas·tic"},"inflection":{"notes":"No specific inflectional forms beyond the adjective itself."},"usage_notes":{"explanation":"'Hyperplastic' is primarily a medical term used to describe tissues or organs that exhibit hyperplasia. It can also be used figuratively to describe something that is growing or expanding rapidly and excessively. It is important to distinguish it from 'hypertrophic', which refers to an increase in cell size rather than cell number.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tissue was hypertrophic, showing increased cell number.","correct":"✓ The tissue was hyperplastic, showing increased cell number.","note":"Hypertrophy refers to an increase in cell size, while hyperplasia refers to an increase in cell number."}],"priority":"★★☆"},"related_words":{"derivatives":["hyperplasia (noun)","hyperplastically (adverb)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hyperplastic' is a technical term primarily used in medical and biological contexts. It describes a condition where there is an abnormal increase in the number of cells in a tissue or organ, leading to its enlargement. This term is often used in pathology reports and discussions about tissue growth and development. Understanding this term requires a background in biology or medicine."},"example_sentences":[{"sentence":"The pathologist noted hyperplastic changes in the prostate gland.","translation":"病理医は前立腺に過形成性の変化を認めました。","type":"medical","meaning_category":"Medical condition"},{"sentence":"The rapid, hyperplastic growth of the software company surprised many analysts.","translation":"そのソフトウェア会社の急速な過形成的な成長は、多くのアナリストを驚かせました。","type":"figurative","meaning_category":"Figurative growth"}]}