{"word":"inegalitarian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"不平等な、不公平な","english_definition":"relating to or believing in the principle that all people are unequal and therefore should not have equal rights or opportunities.","examples":[{"sentence":"The social structure of that country is highly inegalitarian.","translation":"その国の社会構造は非常に不平等である。"},{"sentence":"An inegalitarian society often leads to social unrest.","translation":"不平等な社会はしばしば社会不安につながる。"},{"sentence":"The system is inherently inegalitarian, favoring the wealthy.","translation":"そのシステムは本質的に不平等であり、富裕層を優遇している。"}],"collocations":["inegalitarian society (不平等な社会)","inegalitarian system (不平等な制度)","inegalitarian structure (不平等な構造)","inegalitarian distribution (不平等な分配)"],"synonyms":["unequal","unfair","unjust","biased","discriminatory"],"antonyms":["egalitarian","equal","fair","just","equitable"]}],"etymology":{"value":"'Inegalitarian' is formed by adding the prefix 'in-' (meaning 'not') to 'egalitarian'. 'Egalitarian' itself comes from the French word 'égal', meaning 'equal'. Thus, 'inegalitarian' literally means 'not egalitarian' or 'not equal'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪˌɡælɪˈtɛəriən/","syllables":"in-e-gal-i-tar-i-an"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Inegalitarian' is used to describe systems, societies, or ideologies that promote or accept inequality among people. It is often used in discussions about social justice, economics, and politics. The term implies a lack of fairness and equal opportunity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The inegalitarianism of the system was clear.","correct":"The inegalitarian nature of the system was clear.","note":"While 'inegalitarianism' exists, 'inegalitarian' is more commonly used as an adjective to describe something. Using 'inegalitarian nature' is often clearer than using 'inegalitarianism' as a noun."},{"incorrect":"The society is very inegalitarian for women.","correct":"The society is very inegalitarian towards women.","note":"When specifying who is affected by the inequality, use 'towards' or 'against' rather than 'for'."}],"priority":"★★☆"},"related_words":{"derivatives":["inequality (名詞: 不平等)","egalitarian (形容詞: 平等主義の)","egalitarianism (名詞: 平等主義)"],"phrases":["social inequality (社会的不平等)","economic inequality (経済的不平等)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, more common in academic and political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Inegalitarian' is a relatively advanced word used to describe something that is not equal or fair. It is often used in discussions about society, economics, or politics to describe systems or situations where some people have more advantages or opportunities than others. It's the opposite of 'egalitarian,' which means believing in equality for all people."},"example_sentences":[{"sentence":"The inegalitarian distribution of wealth is a major problem in many countries.","translation":"富の不平等な分配は、多くの国で大きな問題となっている。","type":"adjective","meaning_category":"describing distribution"},{"sentence":"Some argue that capitalism is inherently inegalitarian.","translation":"資本主義は本質的に不平等であると主張する人もいる。","type":"adjective","meaning_category":"describing systems"},{"sentence":"The inegalitarian policies of the government led to widespread protests.","translation":"政府の不平等な政策は広範な抗議活動につながった。","type":"adjective","meaning_category":"describing policies"}]}