{"word":"mudee","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(informal, Australian slang) A person who is considered foolish, stupid, or contemptible.","english_definition":"An informal Australian slang term for a person considered foolish, stupid, or contemptible.","examples":[{"sentence":"Don't be such a mudee, you'll get yourself into trouble.","translation":"そんな馬鹿なことするな、面倒なことになるぞ。"},{"sentence":"He's a bit of a mudee, always making silly mistakes.","translation":"彼は少し間抜けで、いつも馬鹿な間違いをしている。"}],"collocations":["silly mudee","stupid mudee"],"synonyms":["idiot","fool","moron","nitwit","numbskull","dunce"],"antonyms":["genius","intellectual","wise person"]}],"etymology":{"value":"Origin is uncertain, but likely an alteration of 'muddie' or a similar word, possibly related to 'mud' implying someone is 'thick' or 'dense'.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈmuːdiː/","syllables":"mu-dee"},"inflection":{"noun_plural":"mudees"},"usage_notes":{"explanation":"'Mudee' is a derogatory term, primarily used in Australian English. It carries a negative connotation and should be used with caution, as it can be offensive. It's often used in informal settings among friends, but it's best to avoid using it in formal situations or when speaking to strangers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He's a mudee person.","correct":"He's a mudee.","note":"The word 'mudee' is already a noun referring to a person, so adding 'person' is redundant."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_slang":["drongo","galah","dag"]},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Mudee' is an Australian slang term, meaning it's highly informal and specific to a particular region. It's used to describe someone considered foolish or stupid. Because it's slang and potentially offensive, it's not typically taught in standard English courses. Understanding its meaning requires familiarity with Australian colloquialisms."},"example_sentences":[{"sentence":"Stop acting like a mudee and listen to what I'm saying!","translation":"馬鹿なふりをするのはやめて、私の言うことを聞いて！","type":"noun","meaning_category":"foolish person"},{"sentence":"He got completely ripped off; what a mudee!","translation":"彼は完全に騙された。なんて馬鹿なんだ！","type":"noun","meaning_category":"foolish person"}]}