{"word":"unsublimed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"昇華されていない、純化されていない、洗練されていない","english_definition":"Not sublimed; not purified or refined; crude or unrefined in nature or expression.","examples":[{"sentence":"The unsublimed desires of the human heart can lead to destructive actions.","translation":"人間の心の純化されていない欲望は、破壊的な行動につながる可能性がある。"},{"sentence":"His unsublimed artistic talent was evident, but lacked the polish of formal training.","translation":"彼の洗練されていない芸術的才能は明らかだったが、正式な訓練による磨きが不足していた。"}],"collocations":["unsublimed desire","unsublimed talent","unsublimed passion","unsublimed emotion"],"synonyms":["crude","raw","unrefined","unpurified","unrefined","uncouth"],"antonyms":["sublimed","refined","purified","elevated","sophisticated"]}],"etymology":{"value":"From the prefix 'un-' (not) + 'sublimed', the past participle of the verb 'sublime'. 'Sublime' comes from Latin 'sublimare' (to raise up, elevate), from 'sublimis' (high, lofty). Thus, 'unsublimed' literally means 'not raised up' or 'not elevated' in a metaphorical sense, referring to something not refined or purified.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌn.səˈblaɪmd/","syllables":"un-suh-blimed"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more unsublimed' and 'most unsublimed', respectively, though rarely used."},"usage_notes":{"explanation":"'Unsublimed' is often used in a figurative sense to describe emotions, desires, or talents that have not been refined, controlled, or channeled into more socially acceptable or productive forms. It suggests a rawness or lack of sophistication. It can also refer literally to a substance that has not undergone the process of sublimation (transition directly from solid to gas).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unsublimed air made it hard to breathe.","correct":"✓ The unpurified air made it hard to breathe.","note":"'Unsublimed' is not typically used to describe physical air quality. 'Unpurified' is more appropriate in this context."},{"incorrect":"✗ He had an unsublimed smile on his face.","correct":"✓ He had a genuine smile on his face.","note":"'Unsublimed' is rarely used to describe a smile. 'Genuine,' 'unfeigned,' or 'unaffected' would be more common and appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["sublime (verb, adjective, noun)","sublimation (noun)","unsublimated (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unsublimed' is a relatively rare and sophisticated word. It is used to describe something that has not been refined or purified, often in a metaphorical sense relating to emotions, desires, or talents. Understanding the root word 'sublime' and the process of sublimation is helpful for grasping its meaning. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The artist's early works were characterized by their unsublimed energy and passion.","translation":"その芸術家の初期の作品は、洗練されていないエネルギーと情熱によって特徴づけられていた。","type":"adjective","meaning_category":"洗練されていない"},{"sentence":"The unsublimed grief was raw and overwhelming.","translation":"純化されていない悲しみは、むき出しで圧倒的だった。","type":"adjective","meaning_category":"純化されていない"},{"sentence":"The unsublimed sulfur had a strong, pungent odor.","translation":"昇華されていない硫黄は、強烈で刺激的な臭いがした。","type":"adjective","meaning_category":"昇華されていない (literal)"}]}