{"word":"Amidism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"阿弥陀信仰、浄土教","english_definition":"A branch of Mahayana Buddhism centered on faith in Amitābha Buddha.","examples":[{"sentence":"Amidism is one of the most widely practiced branches of Buddhism in East Asia.","translation":"阿弥陀信仰は、東アジアで最も広く実践されている仏教の一派です。"}],"collocations":["Pure Land Buddhism","Amitabha Buddha","Nianfo","Jodo Shu","Jodo Shinshu"],"synonyms":["Pure Land Buddhism"],"antonyms":[]}],"etymology":{"value":"From 'Amitabha' (the name of the Buddha central to the belief) + '-ism' (a suffix indicating a belief system or practice).","priority":"★★★"},"pronunciation":{"ipa":"/ˈæmɪdɪzəm/","syllables":"A-mid-i-sm"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Amidism' refers to the Buddhist traditions and practices centered on Amitābha Buddha and the goal of rebirth in his Pure Land. It emphasizes faith and recitation of Amitābha's name (Nianfo) as a means to achieve enlightenment. It is often used interchangeably with 'Pure Land Buddhism'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices Amidism and Zen.","correct":"✓ He practices Amidism. / ✓ He practices Zen.","note":"While some individuals may incorporate elements from different Buddhist traditions, Amidism and Zen are distinct schools with different emphases."}],"priority":"★★☆"},"related_words":{"derivatives":["Amitabha (Buddha)","Pure Land (Sukhavati)","Nianfo (recitation of Amitabha's name)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amidism' is a term used in religious studies and Buddhist scholarship to refer to the traditions of Pure Land Buddhism. Understanding this term requires familiarity with Buddhist concepts such as Amitābha Buddha and the Pure Land. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The core practice of Amidism involves reciting the name of Amitabha Buddha.","translation":"阿弥陀信仰の中核となる実践は、阿弥陀仏の名を唱えることです。","type":"general","meaning_category":"core practice"},{"sentence":"Amidism offers a path to enlightenment accessible to all, regardless of social status.","translation":"阿弥陀信仰は、社会的地位に関わらず、誰でもアクセスできる悟りへの道を提供します。","type":"general","meaning_category":"accessibility"},{"sentence":"Different schools of Amidism have developed unique interpretations of Pure Land teachings.","translation":"阿弥陀信仰の異なる宗派は、浄土の教えの独自の解釈を発展させてきました。","type":"general","meaning_category":"different schools"}]}