{"word":"unmitered","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(主に建築・木工で)留め継ぎされていない、斜め切りされていない","english_definition":"(chiefly in architecture and woodworking) not mitered; not having been cut at an angle to form a miter joint.","examples":[{"sentence":"The unmitered corners of the frame looked unfinished.","translation":"そのフレームの留め継ぎされていない角は未完成に見えた。"},{"sentence":"He preferred the clean look of unmitered trim.","translation":"彼は留め継ぎされていないトリムのすっきりとした外観を好んだ。"}],"collocations":["unmitered corner","unmitered edge","unmitered trim"],"synonyms":["square-edged","butt-jointed"],"antonyms":["mitered"],"notes":"Typically used in the context of woodworking, framing, or construction. It describes a joint or corner where the pieces meet at right angles rather than at an angle to form a seamless corner."}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'mitered,' the past participle of the verb 'miter.' 'Miter' comes from the Latin 'mitra,' meaning a headdress or turban, referring to the shape formed by the joint.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈmaɪtərd/","syllables":"un-mi-terd"},"inflection":{"notes":"Adjective; comparative and superlative forms (more unmitered, most unmitered) are possible but less common."},"usage_notes":{"explanation":"'Unmitered' specifically describes the absence of a miter joint, where two pieces are cut at an angle (usually 45 degrees) to form a 90-degree corner. An unmitered joint typically involves pieces meeting at right angles, resulting in a visible edge or corner.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unmitered angle was too sharp.","correct":"✓ The unmitered corner was too sharp.","note":"'Unmitered' describes the type of joint or edge, not the angle itself. Use 'unmitered corner' or 'unmitered edge' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["miter (noun: a joint made by cutting two pieces at an angle; verb: to make a miter joint)","mitered (adjective: having a miter joint)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unmitered' is a technical term primarily used in woodworking, construction, and related fields. It describes a corner or joint that is not formed by cutting two pieces at an angle to create a seamless corner. Instead, the pieces meet at right angles, resulting in a visible edge. Understanding this term requires familiarity with basic woodworking concepts. "},"example_sentences":[{"sentence":"The carpenter chose an unmitered joint for its simplicity.","translation":"その大工は単純さから留め継ぎされていない接合を選んだ。","type":"general"},{"sentence":"The unmitered edges of the shelf were sanded smooth.","translation":"その棚の留め継ぎされていない縁は滑らかに研磨された。","type":"specific"},{"sentence":"An unmitered frame is easier to construct than a mitered one.","translation":"留め継ぎされていないフレームは、留め継ぎされているものよりも簡単に構築できる。","type":"comparative"}]}