{"word":"awful-eyed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"having terrible or frightening eyes; having a menacing or unpleasant gaze.","english_definition":"Possessing eyes that are terrible, frightening, or unpleasant to look at; having a menacing or unpleasant gaze.","examples":[{"sentence":"The monster in the story was described as awful-eyed, sending shivers down the children's spines.","translation":"物語の中の怪物は、恐ろしい目を持っていると描写され、子供たちの背筋をゾッとさせた。"},{"sentence":"The awful-eyed gargoyle perched atop the cathedral, scaring away the pigeons.","translation":"恐ろしい目をしたガーゴイルが大聖堂の頂上に腰掛け、ハトを追い払った。"},{"sentence":"She gave him an awful-eyed stare, warning him to back off.","translation":"彼女は彼に恐ろしい目つきで睨みつけ、退くように警告した。"}],"collocations":["awful-eyed monster","awful-eyed stare","awful-eyed gargoyle","awful-eyed creature"],"synonyms":["menacing-eyed","frightening-eyed","terrible-eyed","evil-eyed","glaring","piercing"],"antonyms":["kind-eyed","gentle-eyed","pleasant-eyed","friendly-eyed","benign-eyed"]}],"etymology":{"value":"Compound word formed by combining \"awful\" (inspiring awe or terror) and \"eyed\" (having eyes of a specified kind). The term suggests that the eyes themselves are terrible or frightening in some way.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɔːfəl aɪd/","syllables":"aw-ful-eyed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"The term \"awful-eyed\" is typically used in descriptive writing to evoke a sense of fear, dread, or unease. It is not a common term in everyday conversation but is more frequently found in literature, fantasy, or horror genres. The word emphasizes the impact of the eyes as a source of terror or unpleasantness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an awful eyed man.","correct":"✓ He was an awful-eyed man.","note":"The hyphen is essential to connect \"awful\" and \"eyed\" when used as a compound adjective before a noun."},{"incorrect":"✗ She has awful eyed.","correct":"✓ She is awful-eyed.","note":"\"Awful-eyed\" is an adjective and requires a linking verb (e.g., is, are, was, were) to connect it to the subject."}],"priority":"★★☆"},"related_words":{"derivatives":["awful (adjective)","eyed (suffix)"],"related_terms":["evil-eyed","fierce-eyed","cold-eyed","hard-eyed","sharp-eyed"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency - not a commonly used term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"awful-eyed\" is a compound adjective used to describe someone or something with eyes that inspire fear or dread. It's not a common term in everyday language but is more frequently found in descriptive writing, particularly in genres such as horror or fantasy. The word combines \"awful,\" meaning terrible or frightening, with \"eyed,\" indicating the presence of such eyes. It is used to emphasize the impact of the eyes as a source of terror or unpleasantness, creating a vivid and unsettling image in the reader's mind."},"example_sentences":[{"sentence":"The awful-eyed dragon guarded its treasure hoard jealously.","translation":"恐ろしい目をしたドラゴンは、その宝物を妬むように守っていた。","type":"descriptive","meaning_category":"frightening eyes"},{"sentence":"His awful-eyed stare made her feel uncomfortable and exposed.","translation":"彼の恐ろしい目つきは、彼女を不快でむき出しにされたように感じさせた。","type":"descriptive","meaning_category":"menacing gaze"},{"sentence":"The awful-eyed portrait seemed to follow her around the room.","translation":"恐ろしい目をした肖像画は、部屋の中で彼女を追いかけてくるように見えた。","type":"descriptive","meaning_category":"unpleasant eyes"}]}