{"word":"well-provendered","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"食料が十分に備わっている、食料を豊富に供給された","english_definition":"supplied with abundant provisions or food.","examples":[{"sentence":"The ship was well-provendered for the long voyage.","translation":"その船は長い航海のために食料が十分に備えられていた。"},{"sentence":"The pioneers made sure their wagons were well-provendered before heading west.","translation":"開拓者たちは西部へ向かう前に、自分たちの幌馬車に食料が十分に供給されていることを確認した。"},{"sentence":"A well-provendered army is essential for a successful campaign.","translation":"食料が十分に備わった軍隊は、作戦を成功させるために不可欠である。"}],"collocations":["well-provendered ship","well-provendered army","well-provendered wagon","well-provendered for a journey"],"synonyms":["well-stocked","well-supplied","abundantly provisioned","richly provisioned","fully stocked"],"antonyms":["ill-provendered","poorly provisioned","under-supplied","lacking provisions"]},{"part_of_speech":"adjective","definition":"（比喩的に）必要なものが十分に備わっている","english_definition":"(figuratively) adequately equipped or prepared with what is needed.","examples":[{"sentence":"The library is well-provendered with books and resources.","translation":"その図書館は書籍や資料が十分に備わっている。"},{"sentence":"The team was well-provendered with the latest technology.","translation":"そのチームは最新技術が十分に備わっていた。"}],"collocations":["well-provendered library","well-provendered team","well-provendered with resources"],"synonyms":["well-equipped","well-furnished","well-endowed"],"antonyms":["ill-equipped","poorly furnished","lacking resources"]}],"etymology":{"value":"\"Well-\" + \"provendered\". \"Provender\" comes from Old French \"provendre,\" meaning \"provisions, food,\" ultimately from Latin \"praebenda,\" meaning \"allowance of food, ration.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌwɛl prɒvənˈdɜːd/","syllables":"well-prov-en-dered"},"inflection":{"adjective_forms":{"comparative":"more well-provendered","superlative":"most well-provendered"}},"usage_notes":{"explanation":"\"Well-provendered\" is a relatively formal and somewhat archaic term, most often used to describe something that has been thoroughly stocked with food or supplies. It can also be used figuratively to describe something that is well-equipped with resources. The term is not commonly used in modern conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The well-provendered car was ready for the trip.","correct":"✓ The well-stocked car was ready for the trip.","note":"While \"well-provendered\" could technically be used, \"well-stocked\" is more common and natural in modern English when referring to a car."},{"incorrect":"✗ He well-provendered the party with drinks.","correct":"✓ He well-supplied the party with drinks.","note":"\"Well-provendered\" is usually used as an adjective to describe something that *is* supplied, not as a verb to describe the act of supplying."}],"priority":"★★☆"},"related_words":{"derivatives":["provender (noun: food, provisions, especially for livestock)","provision (noun: a supply of food and other things needed)","provisions (plural noun: supplies of food and other things needed)"],"phrasal_verbs":[],"related_adjectives":["well-stocked","well-supplied","abundant","ample"],"related_nouns":["food","supplies","provisions"]},"level_frequency":{"CEFR":"C2 (rare and formal)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"well-provendered\" is a rather formal and uncommon adjective that means \"supplied with plenty of food or provisions.\" It is not a word you would typically encounter in everyday conversation. You might find it in historical novels or more formal writing. It's used to describe something that has been thoroughly stocked with what is needed, especially food.","priority":"★★☆"},"example_sentences":[{"sentence":"The fort was well-provendered to withstand a long siege.","translation":"その砦は長期の包囲に耐えられるように食料が十分に備えられていた。","type":"adjective","meaning_category":"食料が十分に備わっている"},{"sentence":"The expedition team made sure their backpacks were well-provendered with energy bars and water.","translation":"探検隊のチームは、エネルギーバーと水がバックパックに十分に備えられていることを確認した。","type":"adjective","meaning_category":"食料が十分に備わっている"},{"sentence":"The library is well-provendered with online databases and research tools.","translation":"その図書館はオンラインデータベースと調査ツールが十分に備わっている。","type":"adjective","meaning_category":"（比喩的に）必要なものが十分に備わっている"}]}