{"word":"Stormberg","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(地名)ストームバーグ (南アフリカ共和国の地名)","english_definition":"A geographical place name referring to a mountain range and a town in South Africa.","examples":[{"sentence":"The Stormberg Mountains are located in the Eastern Cape province.","translation":"ストームバーグ山脈は東ケープ州に位置しています。"},{"sentence":"The town of Stormberg is small but has historical significance.","translation":"ストームバーグの町は小さいが、歴史的な重要性を持っている。"}],"collocations":["Stormberg Mountains","Stormberg Series (geology)","Eastern Cape Stormberg","Stormberg Plateau"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after a mountain range in South Africa. The name is likely of Dutch origin, combining 'storm' (storm) and 'berg' (mountain).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstɔːrmbɜːrɡ/","syllables":"Storm-berg"},"inflection":{},"usage_notes":{"explanation":"'Stormberg' is primarily a place name. It refers to a specific geographical location in South Africa, including a mountain range and a town. It is also used in geological contexts to refer to a specific series of rock formations.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Stormberg Series (geological term)"],"related_places":["Eastern Cape","South Africa"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in geographical or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stormberg' is a proper noun, referring to a specific location in South Africa. Its usage is mainly confined to geographical, historical, or geological contexts. Understanding requires familiarity with South African geography or specific scientific domains."},"example_sentences":[{"sentence":"Fossils from the Stormberg Series provide valuable insights into early dinosaur evolution.","translation":"ストームバーグ累層の化石は、初期の恐竜の進化に関する貴重な洞察を提供します。","type":"noun","meaning_category":"Geological reference"},{"sentence":"The Battle of Stormberg was fought during the Second Boer War.","translation":"ストームバーグの戦いは、第二次ボーア戦争中に戦われました。","type":"noun","meaning_category":"Historical reference"},{"sentence":"The Stormberg region is known for its rugged terrain and scenic beauty.","translation":"ストームバーグ地域は、その険しい地形と美しい景観で知られています。","type":"noun","meaning_category":"Geographical reference"}]}