{"word":"depository","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"保管場所、貯蔵庫、預かり所","english_definition":"a place where things are stored; a storehouse.","examples":[{"sentence":"The bank is a depository for money.","translation":"銀行はお金を保管する場所です。"},{"sentence":"This museum is a depository of ancient artifacts.","translation":"この博物館は古代の工芸品の貯蔵庫です。"},{"sentence":"They used the warehouse as a temporary depository for the goods.","translation":"彼らは倉庫を一時的な商品の保管場所として使用しました。"}],"collocations":["central depository (中央保管機関)","data depository (データ保管場所)","official depository (公式保管場所)"],"synonyms":["storehouse","warehouse","repository","vault","archive","safe"],"antonyms":["distribution center"]},{"part_of_speech":"noun","definition":"(地質学)堆積地、鉱床","english_definition":"(geology) a place where minerals or other geological materials accumulate.","examples":[{"sentence":"This area is a rich depository of fossils.","translation":"この地域は化石の豊富な堆積地です。"},{"sentence":"The river delta is a natural depository of sediment.","translation":"その川の三角州は、堆積物の自然な堆積地です。"}],"collocations":["mineral depository (鉱物堆積地)","sediment depository (堆積物堆積地)"],"synonyms":["deposit","accumulation","bed","stratum"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from late Latin depositorium, from Latin depositus, past participle of deponere 'to deposit'.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈpɒzɪtəri/","syllables":"de-pos-i-to-ry","audio_url":"https://example.com/depository.mp3"},"inflection":{"noun_plural":"depositories"},"usage_notes":{"explanation":"The word \"depository\" refers to a place where something is stored for safekeeping. It can be a physical location like a bank or warehouse, or a more abstract concept like a data repository. In geology, it refers to a place where natural materials accumulate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He deposited the money in the depositary.","correct":"✓ He deposited the money in the depository.","note":"\"Depository\" is the noun referring to the place of storage. \"Depositary\" is a person or entity that receives and holds something in trust (often used in finance)."},{"incorrect":"✗ The depository was full of deposit.","correct":"✓ The depository was full of deposits.","note":"\"Deposit\" is the act of placing something for safekeeping or the thing placed. \"Deposits\" is the plural form, referring to multiple items deposited."}],"priority":"★★☆"},"related_words":{"derivatives":["deposit (verb, noun)","depositary (noun)","deposition (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"depository\" is a formal term for a place where things are stored. It's often used in contexts related to finance, museums, or geology. While not an everyday word, understanding its meaning is helpful for comprehending specialized texts and discussions in these fields. It's important to distinguish it from \"depositary,\" which refers to the person or entity holding the items."},"example_sentences":[{"sentence":"The national archive serves as a major depository for historical documents.","translation":"国立公文書館は、歴史的文書の主要な保管場所として機能しています。","type":"noun","meaning_category":"保管場所"},{"sentence":"The area is known as a significant gold depository.","translation":"その地域は、重要な金の鉱床として知られています。","type":"noun","meaning_category":"堆積地"}]}