{"word":"pro-drug","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"プロドラッグ（生体内変換薬）：投与後に体内で活性化される薬物","english_definition":"A medication or compound that, after administration, is metabolized (i.e., converted within the body) into a pharmacologically active drug.","examples":[{"sentence":"The antiviral drug is a pro-drug that is converted into its active form in the liver.","translation":"その抗ウイルス薬はプロドラッグであり、肝臓で活性型に変換される。"},{"sentence":"Using a pro-drug can improve drug absorption and reduce side effects.","translation":"プロドラッグを使用することで、薬物の吸収を改善し、副作用を軽減できる。"}],"collocations":["administer a pro-drug","convert to active drug","improve drug absorption","reduce side effects"],"synonyms":["prodrug","inactive precursor","drug precursor"],"antonyms":["active drug"],"notes":"プロドラッグは、薬物の吸収、分布、代謝、排泄（ADME）特性を改善するために設計される。"}],"etymology":{"value":"'Pro-' (for) + 'drug'.  The 'pro-' prefix indicates that it acts 'for' or as a precursor to the active drug.","priority":"★★★"},"pronunciation":{"ipa":"/ˈproʊˌdrʌɡ/","syllables":"pro-drug"},"inflection":{"noun_plural":"pro-drugs"},"usage_notes":{"explanation":"プロドラッグは、それ自体は薬理活性を持たないか、活性が低い薬物です。投与後、体内の酵素反応や化学反応によって活性のある薬物に変換されます。この戦略は、薬物の溶解性、膜透過性、安定性、または標的組織への選択性を高めるために用いられます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pro-drug is immediately active after injection.","correct":"✓ The pro-drug becomes active after being metabolized.","note":"プロドラッグは、代謝されて活性型に変換されるまで活性を持ちません。"},{"incorrect":"✗ Pro-drugs always have fewer side effects.","correct":"✓ Pro-drugs can sometimes reduce side effects.","note":"プロドラッグは、特定の状況下で副作用を軽減できますが、常にそうであるとは限りません。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["metabolism","pharmacokinetics","drug delivery","bioavailability"],"priority":"★★★"},"level_frequency":{"frequency_academic_writing":"Occurs frequently in academic writing related to pharmacology and drug development.","frequency_scientific_literature":"Common in scientific literature concerning pharmaceutical sciences.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'pro-drug' refers to a medication that is administered in an inactive or less active form and is then converted into its active form within the body through metabolic processes. This strategy is used to improve the drug's absorption, distribution, metabolism, and excretion (ADME) properties, potentially enhancing its efficacy or reducing its side effects. Understanding the concept of pro-drugs requires knowledge of pharmacology and drug metabolism."},"example_sentences":[{"sentence":"Enalapril is a pro-drug that is converted to enalaprilat, an ACE inhibitor, in the liver.","translation":"エナラプリルはプロドラッグであり、肝臓でACE阻害薬であるエナラプリラートに変換される。","type":"noun","meaning_category":"pharmacology"},{"sentence":"The use of pro-drugs can improve oral bioavailability of some medications.","translation":"プロドラッグの使用は、一部の薬物の経口バイオアベイラビリティを改善することができる。","type":"noun","meaning_category":"pharmacokinetics"},{"sentence":"Researchers are exploring new pro-drug strategies to target specific tissues.","translation":"研究者たちは、特定の組織を標的とする新しいプロドラッグ戦略を研究している。","type":"noun","meaning_category":"drug development"}]}