{"word":"unaffable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"愛想のない、打ち解けない、気さくでない","english_definition":"not friendly, sociable, or easy to talk to.","examples":[{"sentence":"Despite his fame, he remained unaffable and distant.","translation":"彼は有名にもかかわらず、愛想がなくよそよそしいままだった。"},{"sentence":"The manager's unaffable demeanor made it difficult for employees to approach him.","translation":"そのマネージャーの気さくでない態度は、従業員が彼に近づくのを困難にした。"},{"sentence":"Her unaffable nature often led to misunderstandings.","translation":"彼女の打ち解けない性格は、しばしば誤解を招いた。"}],"collocations":["unaffable demeanor (愛想のない態度)","unaffable manner (気さくでない物腰)","unaffable personality (打ち解けない性格)"],"synonyms":["unsociable","reserved","aloof","distant","cold","unfriendly","standoffish"],"antonyms":["affable","sociable","friendly","approachable","warm","cordial"]}],"etymology":{"value":"接頭辞 un-（～でない）+ affable（愛想の良い、気さくな）","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈæfəbəl/","syllables":"un-af-fa-ble"},"inflection":{"adjective_forms":{"comparative":"more unaffable","superlative":"most unaffable"}},"usage_notes":{"explanation":"\"**Unaffable**\" describes someone who is not friendly, sociable, or easy to talk to. It suggests a lack of warmth and approachability. The word is relatively formal and less commonly used than synonyms like \"unfriendly\" or \"unsociable.\" It often implies a deliberate choice to remain distant or reserved, rather than simply lacking social skills.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was very unaffable to talk to.","correct":"✓ He was very difficult to talk to. / ✓ He was unaffable.","note":"\"Unaffable\" already implies difficulty in approaching or talking to someone, so adding \"to talk to\" is redundant. It's better to use a more direct phrasing or a different expression like \"difficult to talk to.\""},{"incorrect":"✗ She is unaffable because she is shy.","correct":"✓ She is reserved because she is shy. / ✓ She appears unaffable, but she is actually shy.","note":"While shyness can sometimes lead to an unaffable appearance, \"unaffable\" often suggests a more deliberate choice to be distant. If shyness is the primary reason, \"reserved\" or \"shy\" might be more accurate. If describing the appearance, use \"appears unaffable.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["unaffably (adverb: 愛想なく、打ち解けずに)"],"antonyms":["affability (noun: 愛想の良さ、気さくさ)","affably (adverb: 愛想よく、気さくに)"],"related":["introverted (内向的な)","reserved (控えめな)","aloof (よそよそしい)","standoffish (打ち解けない)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"**Unaffable**\" is a relatively uncommon word that describes someone who is not friendly or easy to talk to. It's a more formal way of saying someone is not approachable or sociable. You might use this word to describe someone who seems distant or reserved, even if they are not necessarily being rude. It's a useful word to know for nuanced descriptions of personality.","priority":"★☆☆"},"example_sentences":[{"sentence":"The new CEO was seen as unaffable by many of the employees.","translation":"新しいCEOは多くの従業員から愛想がないと見なされていた。","type":"adjective","meaning_category":"愛想のない"},{"sentence":"His unaffable demeanor made it hard to build rapport with clients.","translation":"彼の気さくでない態度は、顧客との信頼関係を築くのを困難にした。","type":"adjective","meaning_category":"気さくでない"},{"sentence":"Despite his success, he remained an unaffable and solitary figure.","translation":"成功にもかかわらず、彼は愛想がなく孤独な人物のままだった。","type":"adjective","meaning_category":"打ち解けない"}]}