{"word":"non-navigational","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"航行用でない、ナビゲーションに関係しない","english_definition":"Not related to or used for navigation.","examples":[{"sentence":"The website includes non-navigational content such as articles and blog posts.","translation":"そのウェブサイトには、記事やブログの投稿など、ナビゲーション用でないコンテンツが含まれています。"},{"sentence":"The aircraft's non-navigational systems were functioning normally.","translation":"その航空機の航行用でないシステムは正常に機能していました。"}],"collocations":["non-navigational content","non-navigational systems","non-navigational information"],"synonyms":["unrelated to navigation","non-directional"],"antonyms":["navigational"],"notes":"Often used in the context of websites, software, or aircraft systems to distinguish elements not directly involved in guiding or directing movement."}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'navigational'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒnˌnævɪˈɡeɪʃənəl/","syllables":"non-nav-i-ga-tion-al"},"inflection":{},"usage_notes":{"explanation":"This term is primarily used to differentiate between features or content that are essential for navigation (e.g., maps, GPS) and those that are not (e.g., advertisements, supplementary information). It is commonly found in technical documentation, user interface design, and aviation contexts.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["navigation","navigational"],"related_terms":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'non-navigational' is a technical term used to describe something that is not related to the process of finding a way from one place to another. It's often used in the context of websites or software to differentiate between the elements that help you move around the site (navigation) and other content. Understanding this term requires a good grasp of the word 'navigation' itself."},"example_sentences":[{"sentence":"The app's settings menu is considered non-navigational.","translation":"そのアプリの設定メニューは、ナビゲーション用でないと見なされます。","type":"general","meaning_category":"general"},{"sentence":"Non-navigational data is stored separately from the GPS coordinates.","translation":"航行用でないデータは、GPS座標とは別に保存されます。","type":"technical","meaning_category":"technical"}]}