{"word":"lunar-durable","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Designed to withstand the harsh conditions of the moon, particularly its extreme temperatures, radiation, and lack of atmosphere.","english_definition":"Designed to last and remain functional under the environmental conditions present on the moon, such as vacuum, radiation, and extreme temperature variations.","examples":[{"sentence":"The new lunar rover is made of lunar-durable materials to ensure it can operate for years.","translation":"新しい月面探査車は、長年運用できるように、月面での耐久性のある素材で作られています。"},{"sentence":"Scientists are developing lunar-durable habitats to protect astronauts from radiation.","translation":"科学者たちは、宇宙飛行士を放射線から守るために、月面での耐久性のある居住施設を開発しています。"},{"sentence":"The solar panels are treated with a special coating to make them lunar-durable.","translation":"太陽電池パネルは、月面での耐久性を高めるために特殊なコーティングで処理されています。"}],"collocations":["lunar-durable materials","lunar-durable equipment","lunar-durable habitats","lunar-durable technology","lunar-durable coating"],"synonyms":["moon-resistant","space-durable","radiation-resistant","vacuum-resistant","extreme-environment-resistant"],"antonyms":["lunar-vulnerable","non-durable","fragile","sensitive"],"notes":"This term is often used in the context of space exploration and engineering."}],"etymology":{"value":"A compound word combining 'lunar' (relating to the moon) and 'durable' (able to withstand wear, pressure, or damage).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈluːnər ˈdjʊərəbəl/","syllables":"lu-nar-du-ra-ble"},"inflection":{"adjective_forms":{"comparative":"more lunar-durable","superlative":"most lunar-durable"}},"usage_notes":{"explanation":"'Lunar-durable' is a specialized term used to describe materials, equipment, or structures that are specifically designed and tested to withstand the challenging conditions found on the moon. These conditions include extreme temperature variations, high levels of radiation, a vacuum environment, and the presence of lunar dust. The term is commonly used in the context of space exploration, aerospace engineering, and materials science.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The lunar-durable car.","correct":"✓ The lunar-durable rover.","note":"It's more common to refer to rovers or equipment as lunar-durable rather than cars, as the term is specific to space-related applications."},{"incorrect":"✗ This plastic is lunar-durable.","correct":"✓ This plastic is designed to be lunar-durable.","note":"It's important to specify that the material is designed or treated to be lunar-durable, as not all materials inherently possess these properties."}],"priority":"★★☆"},"related_words":{"derivatives":["durability (noun)","lunar (adjective)"],"related_terms":["space-qualified","radiation shielding","thermal protection","vacuum testing","lunar environment"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lunar-durable' is a technical term used in the context of space exploration. It describes something that is designed to last a long time and work well in the harsh environment of the moon. This includes being able to handle extreme temperatures, radiation, and the lack of air. It's not a common word in everyday conversation, but you might come across it in articles about space missions or new technologies being developed for use on the moon."},"example_sentences":[{"sentence":"The lunar-durable suits will protect astronauts during their moonwalks.","translation":"月面での耐久性のある宇宙服は、宇宙飛行士を月面歩行中に保護します。","type":"adjective","meaning_category":"designed for lunar conditions"},{"sentence":"Engineers are testing the lunar-durable components to ensure they can withstand the vacuum of space.","translation":"エンジニアは、月面での耐久性のある部品が宇宙の真空に耐えられることを確認するためにテストしています。","type":"adjective","meaning_category":"resistant to lunar environment"},{"sentence":"The lunar-durable solar panels will provide a reliable source of power for the base.","translation":"月面での耐久性のある太陽電池パネルは、基地に信頼性の高い電源を供給します。","type":"adjective","meaning_category":"long-lasting on the moon"}]}