{"word":"Suability","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"The state or condition of being suable; the quality of being subject to being sued in a court of law.","english_definition":"The state or quality of being suable; capable of being sued.","examples":[{"sentence":"The company's suability was a key factor in the decision to pursue legal action.","translation":"その会社の訴訟可能性は、法的措置を追求する決定における重要な要素でした。"},{"sentence":"The sovereign immunity of the state limits its suability in certain cases.","translation":"国家の主権免除は、特定のケースにおける訴訟可能性を制限します。"}],"collocations":["establish suability","determine suability","challenge suability","limited suability","full suability"],"synonyms":["actionability","liability","vulnerability to suit","amenability to legal action"],"antonyms":["immunity from suit","non-suability","exemption from liability"]}],"etymology":{"value":"Derived from the word 'suable,' which comes from 'sue' (to bring a lawsuit against) + '-able' (capable of). The suffix '-ity' is added to form a noun indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːəˈbɪləti/","syllables":"su-a-bil-i-ty"},"inflection":{"noun_plural":"suabilities"},"usage_notes":{"explanation":"'Suability' refers specifically to the legal concept of whether an entity (person, company, organization, government) can be taken to court and sued. It is often discussed in the context of sovereign immunity, corporate law, and other legal doctrines that may limit or grant the right to sue.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The suability of the contract was questioned.","correct":"✓ The enforceability of the contract was questioned.","note":"'Suability' refers to the entity that can be sued, not the contract itself. Use 'enforceability' to describe whether a contract can be enforced in court."},{"incorrect":"✗ The company has high suability because of its assets.","correct":"✓ The company has high liability because of its assets.","note":"'Suability' indicates whether someone *can* be sued, not the likelihood of success or the amount they might owe. Use 'liability' to refer to the extent to which they are responsible for damages."}],"priority":"★★☆"},"related_words":{"derivatives":["suable","sue","suit","lawsuit","liability","immunity"],"phrases":["waiver of suability","limited suability","sovereign suability"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Suability' is a legal term that refers to the condition of being subject to legal action or being able to be sued. It is typically used in formal legal contexts and discussions regarding the legal rights and responsibilities of entities, such as corporations, government bodies, or individuals. Understanding this term requires familiarity with legal concepts and terminology.","priority":"★★★"},"example_sentences":[{"sentence":"The court addressed the issue of the defendant's suability under international law.","translation":"裁判所は、国際法の下での被告の訴訟可能性の問題に取り組みました。","type":"noun","meaning_category":"legal"},{"sentence":"One of the key questions in the case was whether the organization had suability as a legal entity.","translation":"この訴訟の重要な問題の1つは、その組織が法人としての訴訟可能性を有するかどうかでした。","type":"noun","meaning_category":"legal"},{"sentence":"The government's waiver of sovereign immunity increased its suability in contract disputes.","translation":"政府の主権免除の放棄は、契約紛争における訴訟可能性を高めました。","type":"noun","meaning_category":"legal"}]}