{"word":"passibility","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"感受性、受苦性、受動性、影響を受けやすさ","english_definition":"The capacity or susceptibility to feel or suffer; the state of being subject to suffering or passion; receptivity to external influences or impressions.","examples":[{"sentence":"The passibility of the human heart makes it vulnerable to both joy and sorrow.","translation":"人間の心の感受性は、喜びと悲しみの両方に対して脆弱にする。"},{"sentence":"His passibility to criticism made him hesitant to share his work.","translation":"彼は批判に対する感受性が高いため、自分の作品を共有することをためらった。"},{"sentence":"The artist explored the passibility of the human form in his sculptures.","translation":"その芸術家は彫刻の中で人間の形の受動性を探求した。"}],"collocations":["human passibility","emotional passibility","intellectual passibility","divine passibility (theological context)"],"synonyms":["susceptibility","sensitivity","vulnerability","receptivity","impressionability"],"antonyms":["impassibility","insensitivity","apathy","indifference"]},{"part_of_speech":"noun","definition":"(神学)受苦性 (神が苦しみや感情を経験できる性質)","english_definition":"(Theology) The capacity of God to experience suffering or emotions; the doctrine that God is capable of suffering.","examples":[{"sentence":"The debate over divine passibility concerns whether God can truly empathize with human suffering.","translation":"神の受苦性に関する議論は、神が人間の苦しみに真に共感できるかどうかに関わる。"},{"sentence":"Some theologians argue for the passibility of God to emphasize his love and compassion.","translation":"一部の神学者は、神の愛と慈悲を強調するために、神の受苦性を主張する。"},{"sentence":"The concept of divine passibility challenges traditional notions of God's immutability.","translation":"神の受苦性の概念は、神の不変性という伝統的な概念に挑戦する。"}],"collocations":["divine passibility","theological passibility","doctrine of passibility"],"synonyms":["divine suffering","God's capacity to suffer"],"antonyms":["divine impassibility","God's immutability"]}],"etymology":{"value":"Derived from the Latin word 'passibilis,' meaning 'capable of suffering,' which comes from 'pati,' meaning 'to suffer.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæsɪˈbɪlɪti/","syllables":"pas-si-bil-i-ty"},"inflection":{"noun_plural":"passibilities"},"usage_notes":{"explanation":"'Passibility' refers to the capacity to experience feelings or suffering. It is often used in philosophical or theological contexts, particularly when discussing the nature of God and whether God can experience human emotions and suffering. In general usage, it describes one's sensitivity or vulnerability to external influences.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She showed great passibility during the crisis.","correct":"✓ She showed great compassion during the crisis.","note":"'Passibility' (capacity to suffer) is often confused with 'compassion' (sympathy and concern for others)."},{"incorrect":"✗ The passibility of the metal made it easy to bend.","correct":"✓ The malleability of the metal made it easy to bend.","note":"'Passibility' (susceptibility to suffering) should not be confused with 'malleability' (ability to be shaped)."}],"priority":"★★☆"},"related_words":{"derivatives":["passible (adjective: capable of suffering)","impassible (adjective: incapable of suffering; without emotion)","passion (noun: strong feeling; suffering)","passive (adjective: receptive; submissive)"],"related_concepts":["empathy","suffering","vulnerability","sensitivity","compassion","immutability (in theology)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized or academic vocabulary)","frequency_google_ngram":"Low frequency (relatively rare word)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Passibility' is a relatively uncommon and abstract word, primarily used in philosophical and theological discussions. It refers to the capacity or susceptibility to experience feelings, especially suffering. Understanding this word requires a grasp of abstract concepts and specialized vocabulary. It is not typically encountered in everyday conversation or general reading materials."},"example_sentences":[{"sentence":"The philosopher explored the limits of human passibility in the face of extreme adversity.","translation":"その哲学者は、極度の逆境に直面した人間の感受性の限界を探求した。","type":"general","meaning_category":"susceptibility to suffering"},{"sentence":"The doctrine of divine passibility suggests that God is not immune to the pain and joy of creation.","translation":"神の受苦性の教義は、神が創造の痛みと喜びに無縁ではないことを示唆する。","type":"theological","meaning_category":"God's capacity to suffer"},{"sentence":"The artist's work revealed the passibility of the human body to external forces.","translation":"その芸術家の作品は、外力に対する人体の受動性を明らかにした。","type":"general","meaning_category":"receptivity to external influences"}]}