{"word":"pseudofever","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"心因性発熱、仮性発熱","english_definition":"Elevated body temperature caused by psychological factors rather than physical illness.","examples":[{"sentence":"The patient was diagnosed with pseudofever due to chronic stress.","translation":"その患者は慢性的なストレスによる心因性発熱と診断された。"},{"sentence":"Pseudofever is often observed in individuals with anxiety disorders.","translation":"心因性発熱は、不安障害を持つ人によく見られる。"}],"collocations":["diagnose pseudofever","treat pseudofever","psychological stress and pseudofever"],"synonyms":["functional fever","psychogenic fever"],"antonyms":[]}],"etymology":{"value":"The term \"pseudofever\" combines the prefix \"pseudo-\" (from Greek ψευδής, pseudḗs, meaning false or deceptive) with \"fever\" (from Latin febris, meaning fever).","priority":"★★★"},"pronunciation":{"ipa":"ˌsuːdoʊˈfiːvər","syllables":"pseu-do-fe-ver"},"inflection":{"noun_plural":"pseudofevers"},"usage_notes":{"explanation":"Pseudofever is a condition where an individual exhibits elevated body temperature without an underlying physical cause such as infection or inflammation. It is primarily linked to psychological factors like stress, anxiety, or emotional distress. Diagnosis typically involves ruling out other medical conditions and assessing the patient's psychological state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has a pseudofever because of a virus.","correct":"✓ The patient has a pseudofever due to psychological stress.","note":"Pseudofever is caused by psychological factors, not physical illnesses like viral infections."},{"incorrect":"✗ Pseudofever can be treated with antibiotics.","correct":"✓ Pseudofever is typically managed with psychological therapies or stress reduction techniques.","note":"Antibiotics are ineffective for pseudofever as it is not caused by a bacterial infection."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudo- (prefix meaning false or deceptive)","fever (elevated body temperature)"],"phrases":["psychosomatic illness","anxiety disorder","stress-induced illness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"pseudofever\" refers to a condition characterized by an elevated body temperature that is not caused by a physical illness, such as an infection. Instead, it is triggered by psychological factors like stress or anxiety. Understanding this term requires knowledge of medical terminology and the relationship between psychological stress and physical symptoms. It is primarily used in medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Chronic stress can sometimes manifest as pseudofever.","translation":"慢性的なストレスは時に心因性発熱として現れることがある。","type":"general","meaning_category":"Definition"},{"sentence":"The doctor suspected pseudofever after ruling out other possible causes of the elevated temperature.","translation":"医師は、体温上昇の他の考えられる原因を除外した後、心因性発熱を疑った。","type":"diagnostic","meaning_category":"Diagnosis"},{"sentence":"Cognitive behavioral therapy can be effective in managing pseudofever.","translation":"認知行動療法は、心因性発熱の管理に効果的である可能性がある。","type":"treatment","meaning_category":"Treatment"}]}