{"word":"Stannel","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A historical unit of weight used for wool, primarily in England.","english_definition":"A historical unit of weight used for wool, primarily in England, varying regionally but typically around 14 pounds.","examples":[{"sentence":"The wool was sold by the stannel at the local market.","translation":"その羊毛は地元の市場でスタネル単位で販売された。"},{"sentence":"A stannel of wool was considered a good yield for a small farm.","translation":"1スタネルの羊毛は、小規模農家にとっては良い収穫と見なされた。"}],"collocations":["weigh in stannels","a stannel of wool","sell by the stannel"],"synonyms":["weight unit","wool measure"],"antonyms":[]}],"etymology":{"value":"Likely derived from a regional term related to the handling or measurement of wool. The exact origin is obscure, with variations in spelling and usage across different historical records.","priority":"Medium"},"pronunciation":{"ipa":"/ˈstænəl/","syllables":"Stan-nel"},"inflection":{"noun_plural":"stannels"},"usage_notes":{"explanation":"'Stannel' is an archaic term and is rarely used in modern English. It is primarily of historical interest when studying the wool trade or local economies of past centuries in England.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a stannel of flour for this recipe.","correct":"✓ I need a pound of flour for this recipe.","note":"'Stannel' is specifically for wool, not general goods like flour."}],"priority":"Medium"},"related_words":{"derivatives":[],"related_terms":["wool","pound","weight","measure"],"priority":"Medium"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily found in historical texts.","priority":"High"},"readability_explanation":{"level":"C2","text":"The term 'stannel' is highly specialized and rarely encountered outside of historical contexts related to the wool trade in England. Understanding its meaning requires familiarity with historical units of measurement and economic practices. It is not part of the common English lexicon."},"example_sentences":[{"sentence":"The old records indicated that the farmer produced several stannels of wool each year.","translation":"古い記録によると、その農家は毎年数スタネルの羊毛を生産していた。","type":"noun","meaning_category":"historical unit of weight"},{"sentence":"The price of wool was determined by the stannel at the annual fair.","translation":"羊毛の価格は、年次市でスタネル単位で決定された。","type":"noun","meaning_category":"historical unit of weight"}]}