{"word":"Splenectopia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脾臓異所症：脾臓が正常な位置にない状態。","english_definition":"A condition in which the spleen is located in an abnormal position.","examples":[{"sentence":"Splenectopia is a rare condition that can be difficult to diagnose.","translation":"脾臓異所症はまれな疾患であり、診断が難しい場合があります。"},{"sentence":"The patient's splenectopia was discovered during an unrelated abdominal scan.","translation":"患者の脾臓異所症は、無関係な腹部スキャン中に発見されました。"}],"collocations":["wandering spleen","ectopic spleen"],"synonyms":["wandering spleen","ectopic spleen"],"antonyms":[]}],"etymology":{"value":"'Spleno-' (spleen) + '-ectopia' (displacement).","priority":"★★★"},"pronunciation":{"ipa":"/splɪˌnɛkˈtoʊpiə/","syllables":"sple-nec-to-pi-a"},"inflection":{"noun_plural":"splenectopias"},"usage_notes":{"explanation":"Splenectopia, also known as wandering spleen or ectopic spleen, is a rare medical condition where the spleen is not in its normal location in the upper left quadrant of the abdomen. This can occur due to laxity or absence of the ligaments that normally hold the spleen in place. The condition can lead to various complications, such as splenic torsion (twisting of the spleen), which can compromise blood supply and cause abdominal pain. Diagnosis often involves imaging studies like CT scans or ultrasounds.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor diagnosed him with splenectomy.","correct":"✓ The doctor diagnosed him with splenectopia.","note":"Splenectopia is the abnormal location of the spleen, while splenectomy is the surgical removal of the spleen."}],"priority":"★★★"},"related_words":{"derivatives":["splenic","spleen","ectopic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Splenectopia' is a highly specialized medical term referring to the abnormal positioning of the spleen. It is not commonly used outside of medical contexts. Understanding this term requires familiarity with medical terminology related to anatomy and rare conditions."},"example_sentences":[{"sentence":"The diagnosis of splenectopia was confirmed with a CT scan.","translation":"脾臓異所症の診断はCTスキャンで確認されました。","type":"medical","meaning_category":"abnormal spleen position"},{"sentence":"Splenectopia can lead to splenic torsion, requiring surgical intervention.","translation":"脾臓異所症は脾臓捻転を引き起こす可能性があり、外科的介入が必要です。","type":"medical","meaning_category":"complications"}]}