{"word":"form-over-function","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"機能性よりも外観や形式を重視すること","english_definition":"The design principle of prioritizing aesthetics and appearance over usability and practical purpose.","examples":[{"sentence":"The new website was beautiful, but suffered from form-over-function; it was difficult to navigate and find information.","translation":"新しいウェブサイトは美しかったが、形式主義に陥っており、ナビゲートが難しく、情報を見つけるのが困難だった。"},{"sentence":"The architect was criticized for prioritizing form-over-function in the design of the building, resulting in impractical spaces.","translation":"建築家は、建物の設計において機能性よりも形式を優先したとして批判され、その結果、非実用的な空間が生じた。"},{"sentence":"In software development, form-over-function can lead to a visually appealing interface that is ultimately frustrating to use.","translation":"ソフトウェア開発において、形式主義は、視覚的に魅力的なインターフェースにつながる可能性があるが、最終的には使いにくいものになる。"}],"collocations":["prioritize form-over-function","suffer from form-over-function","balance form and function"],"synonyms":["aesthetics over utility","style over substance","appearance over practicality"],"antonyms":["function-over-form","practicality","usability","utility"]}],"etymology":{"value":"The term is a compound of 'form' (referring to appearance or aesthetics) and 'function' (referring to purpose or usability). It describes situations where the emphasis is placed on the former at the expense of the latter.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɔːrm ˈoʊvər ˈfʌŋkʃən/","syllables":"form-o-ver-func-tion"},"inflection":{"notes":"This is a noun phrase and does not inflect."},"usage_notes":{"explanation":"'Form-over-function' is a critical design principle, often used in discussions about architecture, product design, web design, and software development. It implies a negative assessment, suggesting that the design has sacrificed usability and practicality for the sake of aesthetics. It is often used to critique designs that are visually appealing but difficult or frustrating to use.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The car has a good form-over-function.","correct":"✓ The car suffers from form-over-function. / ✓ The car prioritizes form-over-function.","note":"The phrase is typically used to describe a problem or a tendency, so verbs like 'suffer from' or 'prioritize' are often used with it."},{"incorrect":"✗ He is a form-over-function designer.","correct":"✓ He is a designer who prioritizes form-over-function.","note":"It is more common to describe a design or a design decision as 'form-over-function' rather than describing a person that way."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["user experience (UX)","usability","design principles","aesthetics","ergonomics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in design and technology discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Form-over-function' is a term used to describe situations where the appearance of something is considered more important than how well it works. It's often used in design, architecture, and software development to criticize things that look good but are difficult to use or impractical. If something 'suffers from form-over-function,' it means that its design is flawed because it prioritizes aesthetics over usability."},"example_sentences":[{"sentence":"The new smartphone case was stylish, but it was so bulky that it suffered from **form-over-function**.","translation":"新しいスマートフォンのケースはスタイリッシュだったが、かさばりすぎて機能性よりも外観を重視していた。","type":"noun","meaning_category":"general"},{"sentence":"The website's design prioritized **form-over-function**, making it difficult for users to find what they needed.","translation":"ウェブサイトのデザインは機能性よりも形式を優先しており、ユーザーが必要なものを見つけるのが困難になっている。","type":"noun","meaning_category":"web design"},{"sentence":"The building's striking facade was impressive, but the interior layout demonstrated a clear case of **form-over-function**.","translation":"建物の印象的なファサードは素晴らしかったが、インテリアのレイアウトは明らかに機能性よりも形式を重視していた。","type":"noun","meaning_category":"architecture"}]}