{"word":"schoolboyishness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"いたずら好き、子供っぽさ、未熟さ、学生らしさ","english_definition":"The quality or state of being like a schoolboy, especially in being immature, mischievous, or lacking in seriousness.","examples":[{"sentence":"His schoolboyishness often got him into trouble.","translation":"彼の子供っぽさ（いたずら好き）が原因で、彼はよくトラブルに巻き込まれた。"},{"sentence":"There was a certain schoolboyishness to his sense of humor.","translation":"彼のユーモアのセンスには、どこか子供っぽさがあった。"},{"sentence":"The politician's schoolboyishness was seen as a lack of professionalism.","translation":"その政治家の子供っぽさは、プロ意識の欠如と見なされた。"}],"collocations":["display schoolboyishness (子供っぽさを見せる)","a touch of schoolboyishness (少しばかりの子供っぽさ)","overcome schoolboyishness (子供っぽさを克服する)"],"synonyms":["immaturity","childishness","juvenility","puerility","mischievousness","playfulness","lack of seriousness"],"antonyms":["maturity","seriousness","professionalism","sophistication"]}],"etymology":{"value":"The word is formed by combining \"schoolboyish\" (resembling a schoolboy) with the suffix \"-ness\" (denoting a state or quality). \"Schoolboyish\" itself is derived from \"schoolboy\" (a boy attending school) with the suffix \"-ish\" (having the characteristics of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskuːlbɔɪɪʃnəs/","syllables":"school-boy-ish-ness"},"inflection":{"noun_plural":"N/A (uncountable noun)"},"usage_notes":{"explanation":"\"Schoolboyishness\" is generally used to describe behavior or qualities that are considered typical of young boys in school, often with negative connotations such as immaturity, lack of seriousness, or a tendency towards mischief. It can also sometimes be used in a more neutral or even affectionate way to describe playfulness or a youthful spirit. The specific meaning depends on the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of schoolboyish.","correct":"✓ He showed a lot of schoolboyishness.","note":"\"Schoolboyish\" is an adjective, while \"schoolboyishness\" is the noun form. You need the noun form to describe the quality or state. Also, \"a lot of\" is preferred over \"much\" with uncountable nouns like schoolboyishness."},{"incorrect":"✗ Her schoolboyishness was very mature.","correct":"✓ Her behavior, though playful, was surprisingly mature.","note":"\"Schoolboyishness\" generally implies a lack of maturity, so it's contradictory to say it's \"very mature.\" If you want to describe playful behavior that is still mature, use a different phrasing."}],"priority":"★☆☆"},"related_words":{"derivatives":["schoolboy (noun)","schoolboyish (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Schoolboyishness\" is a relatively uncommon word that describes the qualities associated with a schoolboy, typically including immaturity, playfulness, and a lack of seriousness. It's often used in a critical or disapproving way to describe behavior that is considered inappropriate for an adult. Understanding the word requires familiarity with the connotations of \"schoolboy\" behavior and the function of the suffix \"-ness\" to form nouns.","priority":"★☆☆"},"example_sentences":[{"sentence":"The CEO's prank at the conference revealed a surprising degree of schoolboyishness.","translation":"CEOが会議で行ったいたずらは、驚くほどの子供っぽさを露呈した。","type":"noun","meaning_category":"子供っぽさ、いたずら好き"},{"sentence":"Despite his age, a certain schoolboyishness remained in his eyes.","translation":"年齢にもかかわらず、彼の目にはどこか子供っぽさが残っていた。","type":"noun","meaning_category":"子供っぽさ、未熟さ"},{"sentence":"The team's schoolboyishness led to several costly mistakes during the game.","translation":"チームの子供っぽさが、試合中にいくつかの大きなミスにつながった。","type":"noun","meaning_category":"未熟さ、不真面目さ"}]}