{"word":"humidity-prone","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"湿気の影響を受けやすい、湿気に弱い","english_definition":"Easily affected or damaged by humidity.","examples":[{"sentence":"This type of fabric is humidity-prone, so it's not ideal for summer wear.","translation":"このタイプの生地は湿気の影響を受けやすいので、夏の着用には適していません。"},{"sentence":"Certain electronics are humidity-prone and should be stored in a dry place.","translation":"特定の電子機器は湿気に弱いため、乾燥した場所に保管する必要があります。"},{"sentence":"The old wooden structure was humidity-prone, leading to rot and decay.","translation":"その古い木造建築は湿気に弱く、腐敗や劣化につながっていました。"}],"collocations":["humidity-prone materials (湿気に弱い素材)","humidity-prone electronics (湿気に弱い電子機器)","humidity-prone fabrics (湿気に弱い生地)","humidity-prone environment (湿気の影響を受けやすい環境)"],"synonyms":["susceptible to humidity","sensitive to moisture","affected by dampness"],"antonyms":["humidity-resistant","moisture-resistant","waterproof"]}],"etymology":{"value":"The word is formed by combining 'humidity' (the amount of moisture in the air) with 'prone' (likely to or liable to suffer from, do, or experience something, typically something unwelcome or negative).","priority":"★★☆"},"pronunciation":{"ipa":"/hjuːˈmɪdɪti ˌproʊn/","syllables":"hu-mid-i-ty prone"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Humidity-prone' is used to describe something that is easily damaged or negatively affected by high levels of humidity. This can apply to materials, objects, or even environments. It is often used in contexts where preventing humidity damage is important.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The air is humidity-prone today.","correct":"✓ The air is humid today.","note":"'Humidity-prone' describes an object or material, not the air itself. Use 'humid' to describe the air. "},{"incorrect":"✗ The humidity-prone of this room is high.","correct":"✓ The humidity level of this room is high.","note":"'Humidity-prone' is an adjective. To describe the level of humidity, use 'humidity' as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["prone (adjective: likely to or liable to suffer from, do, or experience something, typically something unwelcome or negative)","humidity (noun: the amount of moisture in the air)"],"phrasal_verbs":[],"related_terms":["humidity","moisture","dampness","condensation","mildew","mold"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Humidity-prone' is a compound adjective used to describe materials or items that are easily damaged or negatively affected by high humidity levels. It combines the noun 'humidity' (the amount of moisture in the air) with the adjective 'prone' (meaning likely to be affected by something). It is typically used in technical or descriptive contexts where the sensitivity of a material to moisture is important. For example, certain types of wood or electronic components might be described as 'humidity-prone' because they can warp, corrode, or malfunction when exposed to high levels of humidity."},"example_sentences":[{"sentence":"The antique books were stored in a humidity-prone basement, leading to significant damage.","translation":"そのアンティーク本は湿気の影響を受けやすい地下室に保管されていたため、大きな損傷につながりました。","type":"general","meaning_category":"susceptible to humidity"},{"sentence":"This type of photographic paper is humidity-prone and must be stored in airtight containers.","translation":"このタイプの写真用紙は湿気に弱いため、密閉容器に保管する必要があります。","type":"specific material","meaning_category":"susceptible to humidity"},{"sentence":"The manufacturer warned that the device was humidity-prone and should not be used outdoors in wet conditions.","translation":"製造元は、そのデバイスが湿気に弱いため、雨天時の屋外で使用しないでくださいと警告しました。","type":"electronics","meaning_category":"susceptible to humidity"}]}