{"word":"sporulation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"胞子形成、芽胞形成","english_definition":"The process of spore formation, especially in bacteria and fungi.","examples":[{"sentence":"Sporulation is a survival mechanism for bacteria under unfavorable conditions.","translation":"胞子形成は、細菌が不利な条件下で生き残るためのメカニズムです。"},{"sentence":"The fungus reproduces through sporulation.","translation":"その菌類は胞子形成によって繁殖します。"}],"collocations":["bacterial sporulation","fungal sporulation","induce sporulation","initiate sporulation","inhibit sporulation"],"synonyms":["spore formation","sporogenesis"],"antonyms":["germination","vegetative growth"]}],"etymology":{"value":"Derived from 'spore' + '-ulation'. 'Spore' comes from Greek 'spora' (a sowing, seed), and '-ulation' is a suffix indicating a process or condition.","priority":"★★☆"},"pronunciation":{"ipa":"ˌspɔːrjuˈleɪʃən/","syllables":"spor-u-la-tion"},"inflection":{"noun_plural":"sporulations"},"usage_notes":{"explanation":"'Sporulation' specifically refers to the process of forming spores. Spores are reproductive structures that are highly resistant to environmental stress, allowing organisms to survive harsh conditions. The term is most commonly used in the context of bacteria and fungi.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell underwent sporulation and became a vegetative cell.","correct":"✓ The cell underwent sporulation and became a spore.","note":"Sporulation results in the formation of a spore, not a vegetative cell. A spore can later germinate into a vegetative cell under favorable conditions."},{"incorrect":"✗ Sporulation is a form of asexual reproduction in animals.","correct":"✓ Sporulation is a form of asexual reproduction in bacteria and fungi.","note":"Sporulation is primarily associated with bacteria and fungi, not animals."}],"priority":"★★☆"},"related_words":{"derivatives":["sporulate (verb): to form spores","spore (noun): a reproductive cell capable of developing into a new individual","sporangium (noun): a structure in which spores are formed"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sporulation' is a technical term used in biology, specifically referring to the process by which some bacteria and fungi form spores. Spores are dormant, highly resistant cells that allow the organism to survive unfavorable conditions. Understanding this term requires a background in biology or microbiology. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The researchers studied the factors that trigger sporulation in Bacillus subtilis.","translation":"研究者たちは、枯草菌における胞子形成を引き起こす要因を研究しました。","type":"scientific","meaning_category":"process of spore formation"},{"sentence":"Nutrient deprivation can induce sporulation in many bacterial species.","translation":"栄養欠乏は、多くの細菌種において胞子形成を誘導することがあります。","type":"scientific","meaning_category":"process of spore formation"},{"sentence":"The sporulation process allows the organism to survive extreme temperatures and desiccation.","translation":"胞子形成プロセスにより、その生物は極端な温度や乾燥に耐えることができます。","type":"scientific","meaning_category":"survival mechanism"}]}