{"word":"excysted","priority":"Low","meanings":[{"part_of_speech":"verb (past participle)","definition":"(生物学)被嚢から脱出した、脱嚢した","english_definition":"Having emerged from a cyst.","examples":[{"sentence":"The excysted parasites are now free to infect the host.","translation":"脱嚢した寄生虫は、今や自由に宿主に感染することができる。"}],"collocations":["excysted parasite","excysted amoeba"],"synonyms":["emerged","released","hatched"],"antonyms":["encysted"],"notes":"Generally used in biological or medical contexts to describe the process of a parasite or other organism emerging from its protective cyst."}],"etymology":{"value":"Derived from the verb 'excyst', which is formed from 'ex-' (out of) and 'cyst' (a sac or bladder).","priority":"Medium"},"pronunciation":{"ipa":"/ɛkˈsɪstɪd/","syllables":"ek-sis-ted"},"inflection":{"verb_forms":{"present_simple":["excyst"],"past_simple":"excysted","past_participle":"excysted","present_participle":"excysting"}},"usage_notes":{"explanation":"'Excysted' is a technical term primarily used in biology, parasitology, and related fields. It describes the state of an organism after it has emerged from a cyst, which is a protective outer covering. The process of excystation is often triggered by specific environmental conditions.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The excysted bacteria was visible under the microscope.","correct":"The excysted bacteria were visible under the microscope.","note":"'Bacteria' is a plural noun, so the verb should be 'were'."}],"priority":"Low"},"related_words":{"derivatives":["excyst (verb): to emerge from a cyst","excystation (noun): the process of emerging from a cyst","encyst (verb): to become enclosed in a cyst","encystation (noun): the process of becoming enclosed in a cyst","cyst (noun): a sac or bladder-like structure in the body"],"priority":"Medium"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency, primarily in scientific literature.","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Excysted' is a specialized term used in scientific contexts, particularly in biology and parasitology. It refers to the state of an organism that has emerged from its protective cyst. Understanding this term requires familiarity with biological processes and terminology related to cysts and encystation/excystation. It is not commonly used in general conversation."},"example_sentences":[{"sentence":"The excysted Giardia trophozoites attached to the intestinal lining.","translation":"脱嚢したジアルジアの栄養体は、腸の内壁に付着した。","type":"scientific","meaning_category":"biology"},{"sentence":"Microscopic examination revealed numerous excysted organisms.","translation":"顕微鏡検査により、多数の脱嚢した生物が確認された。","type":"scientific","meaning_category":"biology"}]}