{"word":"interfraternally","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"兄弟団間で、兄弟団相互に","english_definition":"In an interfraternal manner; between or among fraternities.","examples":[{"sentence":"The interfraternally organized event was a great success.","translation":"兄弟団間で組織されたイベントは大成功だった。"},{"sentence":"They cooperated interfraternally to raise money for charity.","translation":"彼らは慈善活動のためにお金を募るために、兄弟団相互に協力した。"}],"collocations":["cooperate interfraternally","organize interfraternally"],"synonyms":["mutually","collaboratively","jointly"],"antonyms":["separately","independently"]}],"etymology":{"value":"Derived from \"interfraternal,\" which combines the prefix \"inter-\" (meaning between or among) with \"fraternal\" (relating to fraternities or brotherhoods), and the suffix \"-ly\" (forming an adverb).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərfrəˈtɜːrnəli/","syllables":"in-ter-fra-ter-nal-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"The word \"interfraternally\" is used to describe actions or relationships that occur between or among different fraternities. It emphasizes cooperation, collaboration, or mutual interaction between these groups. It is relatively uncommon and primarily used in contexts involving fraternal organizations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The event was interfraternal.","correct":"✓ The event was organized interfraternally.","note":"\"Interfraternal\" is an adjective, while \"interfraternally\" is an adverb. Use the adverb to describe how an action is performed."}],"priority":"★★☆"},"related_words":{"derivatives":["interfraternal (adjective)","fraternity (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'interfraternally' is a specialized term used to describe interactions or activities that occur between different fraternities. It is not commonly used in everyday language and is more likely to be found in formal or academic contexts related to fraternal organizations. Understanding the word requires knowledge of the prefix 'inter-' and the term 'fraternity.'"},"example_sentences":[{"sentence":"The universities have created a council to promote interfraternally relations.","translation":"大学は兄弟団間の関係を促進するための協議会を設立した。","type":"general","meaning_category":"between fraternities"},{"sentence":"The students worked interfraternally to organize the homecoming parade.","translation":"学生たちはホームカミングパレードを組織するために、兄弟団相互に協力した。","type":"general","meaning_category":"among fraternities"}]}