{"word":"whitenose","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(主にイギリス英語で、軽蔑的に) 青白い顔の人、特に病気や恐怖で青ざめている人","english_definition":"(chiefly British, derogatory) a person with a pale face, especially one pale with illness or fear.","examples":[{"sentence":"He looked a right whitenose after seeing the ghost.","translation":"彼は幽霊を見た後、ひどく青ざめた顔をしていた。"},{"sentence":"Don't be such a whitenose, it's just a small spider.","translation":"そんなに青ざめた顔をするな、ただの小さなクモだ。"}],"collocations":["a right whitenose (ひどく青ざめた顔の人)"],"synonyms":["pale face","paleface","ghostly face"],"antonyms":["ruddy face","healthy complexion"]},{"part_of_speech":"noun","definition":"(動物、特に馬の) 白い鼻または顔の一部","english_definition":"a white nose or part of the face of an animal, especially a horse.","examples":[{"sentence":"The horse was easily identified by its distinctive whitenose.","translation":"その馬は特徴的な白い鼻で簡単に見分けられた。"}],"collocations":[],"synonyms":["white face","blaze"],"antonyms":[]}],"etymology":{"value":"'White' + 'nose'. The term likely originated from observing people with pale complexions, possibly due to illness or fear. Its application to animals, particularly horses, refers to the physical characteristic of a white marking on the nose.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwaɪtˌnəʊz/","syllables":"white-nose"},"inflection":{"noun_plural":"whitenoses"},"usage_notes":{"explanation":"The term \"whitenose\" is primarily used in British English as a derogatory term for someone with a pale face, often implying illness or fear. It can also refer to the white marking on the nose of an animal, especially a horse. The context usually makes the meaning clear.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["paleface (青白い顔の人、特に軽蔑的に)","rednose (赤い鼻の人)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"whitenose\" has two main meanings. One is a derogatory term, mainly used in British English, to describe someone with a pale face, suggesting they are ill or scared. The other meaning refers to a white marking on the nose of an animal, especially a horse. The context will usually indicate which meaning is intended. It's not a very common word.","priority":"★★☆"},"example_sentences":[{"sentence":"After the roller coaster, he looked like a proper whitenose.","translation":"ジェットコースターの後、彼はひどく青ざめた顔をしていた。","type":"noun","meaning_category":"青白い顔の人"},{"sentence":"The farmer pointed out the horse with the whitenose.","translation":"農夫は白い鼻の馬を指さした。","type":"noun","meaning_category":"動物の白い鼻"}]}