{"word":"codefendant","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"共同被告人、共同被告","english_definition":"a person who is jointly accused with another or others in a legal action.","examples":[{"sentence":"The codefendant pleaded guilty to all charges.","translation":"共同被告人はすべての罪状について有罪を認めた。"},{"sentence":"The prosecution presented evidence against both the defendant and the codefendant.","translation":"検察は被告と共同被告の両方に対して証拠を提出した。"},{"sentence":"The codefendant testified against the main defendant in the trial.","translation":"共同被告人は裁判で主たる被告に対して証言した。"}],"collocations":["named as codefendant","the other codefendant","a key codefendant","former codefendant"],"synonyms":["co-accused","joint defendant"],"antonyms":["plaintiff","prosecutor","defendant"],"notes":"Usually used in legal contexts."}],"etymology":{"value":"The word \"codefendant\" is formed by combining the prefix \"co-\" (meaning \"joint\" or \"together\") with the word \"defendant.\" The term indicates someone who is a defendant alongside one or more other defendants in the same legal case.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊdɪˈfɛndənt/","syllables":"co-de-fen-dant"},"inflection":{"noun_plural":"codefendants"},"usage_notes":{"explanation":"\"Codefendant\" is a legal term that refers to an individual who is accused of the same crime or involved in the same lawsuit as another defendant. The term is commonly used in criminal and civil cases where multiple parties are being sued or prosecuted together.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was the co-defendant of the case.","correct":"✓ He was a codefendant in the case.","note":"Use 'a codefendant' or 'the codefendant' rather than 'the co-defendant of'."},{"incorrect":"✗ The codefendant was guilty, but the defendant was innocent.","correct":"✓ The codefendant was found guilty, but the defendant was found innocent.","note":"Use 'found guilty' or 'pleaded guilty' to describe the outcome of a trial or plea."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["defendant","plaintiff","litigation","indictment","prosecution","civil case","criminal case"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"codefendant\" is a legal term used to describe a person who is accused alongside another person in a legal case. It is a technical term mainly used in legal contexts and is not commonly used in everyday conversation. Understanding the term requires familiarity with basic legal concepts such as \"defendant\" and \"legal action.\"","priority":"★★☆"},"example_sentences":[{"sentence":"The two codefendants were accused of conspiracy to commit fraud.","translation":"その二人の共同被告人は詐欺を共謀した罪で告発された。","type":"general","meaning_category":"legal"},{"sentence":"The judge ruled that the codefendant's testimony was admissible in court.","translation":"裁判官は共同被告の証言を法廷で認めることを決定した。","type":"general","meaning_category":"legal"},{"sentence":"The lawyer represented both the defendant and the codefendant in the case.","translation":"弁護士はその訴訟で被告と共同被告の両方を弁護した。","type":"general","meaning_category":"legal"}]}