{"word":"phlebotomist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"静脈採血技師、採血者","english_definition":"A person who is trained to draw blood from a patient for clinical or medical testing, transfusions, donations, or research.","examples":[{"sentence":"The phlebotomist explained the procedure before drawing my blood.","translation":"採血技師は採血前に手順を説明してくれた。"},{"sentence":"A skilled phlebotomist can find a vein quickly and painlessly.","translation":"熟練した採血技師は、素早く、痛みを伴わずに血管を見つけることができる。"},{"sentence":"The hospital employs several phlebotomists to handle the high volume of blood samples.","translation":"その病院では、大量の血液サンプルを処理するために数人の採血技師を雇用している。"}],"collocations":["draw blood","venipuncture","blood sample","healthcare professional","medical laboratory"],"synonyms":["blood drawer","venipuncturist"],"antonyms":[]}],"etymology":{"value":"The word \"phlebotomist\" comes from the Greek words \"phlebo-\" meaning \"vein,\" and \"-tomist\" meaning \"one who cuts.\" Historically, phlebotomy (bloodletting) was a common medical practice.","priority":"★★☆"},"pronunciation":{"ipa":"/fləˈbɒtəmɪst/","syllables":"phle-bot-o-mist"},"inflection":{"noun_plural":"phlebotomists"},"usage_notes":{"explanation":"A phlebotomist is a healthcare professional specifically trained in the practice of phlebotomy, which involves drawing blood from patients. Their primary responsibility is to collect blood samples for various diagnostic tests and procedures. They must adhere to strict safety protocols and maintain patient comfort.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ flebotomist","correct":"✓ phlebotomist","note":"The correct spelling starts with 'ph' not 'fl'."},{"incorrect":"✗ phlebotomyist","correct":"✓ phlebotomist","note":"The correct suffix is '-tomist' not '-tomyist'."}],"priority":"★★☆"},"related_words":{"derivatives":["phlebotomy (noun: the practice of drawing blood)"],"phrasal_verbs":[],"related_medical_terms":["venipuncture","blood culture","complete blood count (CBC)","serology"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"phlebotomist\" refers to a specialized healthcare worker responsible for drawing blood. Understanding this term is important in medical contexts. The etymology reflects the historical practice of bloodletting, though modern phlebotomists focus on safe and accurate blood collection for diagnostic purposes."},"example_sentences":[{"sentence":"The **phlebotomist** carefully cleaned the patient's arm before inserting the needle.","translation":"採血技師は針を刺す前に患者の腕を丁寧に消毒した。","type":"noun","meaning_category":"静脈採血技師"},{"sentence":"The **phlebotomist** must follow strict protocols to avoid contamination of the blood samples.","translation":"採血技師は血液サンプルの汚染を避けるために厳格な手順に従わなければならない。","type":"noun","meaning_category":"静脈採血技師"},{"sentence":"After the **phlebotomist** drew the blood, she applied a bandage to the injection site.","translation":"採血技師が採血した後、注射部位に絆創膏を貼った。","type":"noun","meaning_category":"静脈採血技師"}]}