{"word":"Ancaeus","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(ギリシア神話) アンカイオス：ポセイドンの息子。カリュドーンの猪狩りの参加者であり、予言者によって「自分が植えたブドウから作られたワインを飲むことはないだろう」と予言されたが、狩りの後にワインを飲もうとしたところ、猪が襲ってきたためワインを捨てて猪に立ち向かったが、猪に殺された。","english_definition":"(Greek mythology) Ancaeus: A son of Poseidon, participant in the Calydonian Boar Hunt, who was prophesied by a seer that he would not taste the wine from the grapes he planted. After the hunt, as he was about to drink the wine, a boar attacked, causing him to throw the wine away and confront the boar, but he was killed by it.","examples":[{"sentence":"Ancaeus was a skilled warrior in Greek mythology.","translation":"アンカイオスはギリシア神話における熟練した戦士でした。"},{"sentence":"The story of Ancaeus highlights the power of fate in Greek legends.","translation":"アンカイオスの物語は、ギリシアの伝説における運命の力を強調しています。"}],"collocations":["Calydonian Boar Hunt","son of Poseidon","Greek mythology","prophecy"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"ギリシア語の 'Ἀγκαῖος' (Ankaios) から。","priority":"★★★"},"pronunciation":{"ipa":"/ænˈsiːəs/","syllables":"An-cae-us"},"inflection":{},"usage_notes":{"explanation":"Ancaeus は、ギリシア神話に登場する人物の名前です。主にカリュドーンの猪狩りの物語で知られています。","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_characters":["Meleager","Atalanta","Theseus"],"related_places":["Calydon"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"Ancaeus is a character from Greek mythology, specifically known for his role in the Calydonian Boar Hunt. The story involves a prophecy and his untimely death. This name and the associated story are typically encountered in the study of classical literature or mythology. Understanding requires familiarity with Greek mythological figures and narratives."},"example_sentences":[{"sentence":"Ancaeus joined the Calydonian Boar Hunt but met an unfortunate end.","translation":"アンカイオスはカリュドーンの猪狩りに参加しましたが、不幸な最期を迎えました。","type":"mythological reference","meaning_category":"mythology"},{"sentence":"The seer's prophecy loomed over Ancaeus as he prepared to taste the wine.","translation":"ワインを味わおうとしたアンカイオスの頭上には、予言者の予言が迫っていました。","type":"mythological reference","meaning_category":"mythology"}]}