{"word":"Nonmalleabness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of not being malleable; resistance to deformation under compressive stress; the opposite of malleability.","english_definition":"The state or quality of not being malleable; resistance to deformation under compressive stress; the opposite of malleability.","examples":[{"sentence":"The nonmalleabness of the material made it unsuitable for shaping into thin sheets.","translation":"その材料の非展延性（非延性）のため、薄いシート状に成形するには不向きでした。"}],"collocations":["high nonmalleabness","exhibit nonmalleabness"],"synonyms":["brittleness","rigidity","hardness","inflexibility"],"antonyms":["malleability","ductility","pliability","flexibility"]}],"etymology":{"value":"Derived from 'non-' (prefix meaning 'not'), combined with 'malleable' (capable of being shaped), and '-ness' (suffix indicating a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈmæliəbəlnəs/","syllables":"non-mal-le-a-ble-ness"},"inflection":{"noun_plural":"Nonmalleabnesses"},"usage_notes":{"explanation":"'Nonmalleabness' is a relatively uncommon term, primarily used in materials science and engineering contexts. It describes the property of a material that resists deformation, particularly under compression. It is the direct opposite of 'malleability,' which refers to the ability of a material to be hammered or pressed into shape without breaking or cracking.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metal has a high malleability, so it shows nonmalleabness.","correct":"✓ The metal has a low malleability, so it shows nonmalleabness.","note":"Malleability and nonmalleabness are inverse properties; a material cannot simultaneously exhibit high malleability and nonmalleabness."}],"priority":"★☆☆"},"related_words":{"derivatives":["malleable","malleability"],"related_terms":["ductility","brittleness","hardness"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nonmalleabness' is a technical term primarily used in the fields of materials science and engineering. It describes the property of a material that is not easily shaped or deformed under pressure. Understanding this term requires a good grasp of related concepts such as malleability, ductility, and material properties. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The ceramic's nonmalleabness made it ideal for applications requiring high structural integrity.","translation":"そのセラミックの非展延性は、高い構造的完全性が求められる用途に理想的でした。","type":"general","meaning_category":"general"},{"sentence":"The alloy's composition was adjusted to reduce its nonmalleabness and improve its formability.","translation":"その合金の組成は、その非展延性を低減し、成形性を向上させるために調整されました。","type":"technical","meaning_category":"technical"}]}