{"word":"jockeyish","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"騎手のような、騎手気取りの、騎手風の","english_definition":"Resembling or characteristic of a jockey; acting like a jockey.","examples":[{"sentence":"He had a jockeyish stance, always leaning forward slightly.","translation":"彼はいつも少し前かがみになる、騎手のような姿勢をしていた。"},{"sentence":"The young man had a jockeyish attitude, always trying to be first.","translation":"その若者はいつも一番になろうとする、騎手気取りな態度だった。"}],"collocations":["jockeyish stance","jockeyish attitude","jockeyish appearance"],"synonyms":["sporty","athletic","competitive"],"antonyms":["unathletic","uncompetitive"]},{"part_of_speech":"adjective","definition":"ずる賢い、抜け目ない、出し抜こうとする","english_definition":"Showing a tendency to try to gain an advantage by any means necessary; cunning; scheming.","examples":[{"sentence":"His jockeyish business practices were frowned upon by many.","translation":"彼の出し抜こうとするような商売のやり方は多くの人に眉をひそめられた。"},{"sentence":"She had a jockeyish way of getting what she wanted.","translation":"彼女には欲しいものを手に入れるための抜け目ないやり方があった。"}],"collocations":["jockeyish business practices","jockeyish tactics","jockeyish behavior"],"synonyms":["cunning","scheming","devious","manipulative"],"antonyms":["honest","forthright","sincere"]}],"etymology":{"value":"Derived from 'jockey' (a person who rides horses in races) + '-ish' (a suffix indicating resemblance or characteristic).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɒkiɪʃ/","syllables":"jock-ey-ish"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more jockeyish' and 'most jockeyish'."},"usage_notes":{"explanation":"'Jockeyish' can have two main connotations: one referring to physical appearance or demeanor resembling a jockey (often implying a sporty or athletic quality), and another referring to a manipulative or overly competitive attitude. The negative connotation is more common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He was very jockeyish about his health.","correct":"He was very health-conscious.","note":"'Jockeyish' is not typically used to describe someone who is simply concerned about their health. It implies a more aggressive or competitive approach."}],"priority":"★☆☆"},"related_words":{"derivatives":["jockey (noun, verb)","jockeyship (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'jockeyish' is relatively uncommon and requires understanding of the role and characteristics associated with jockeys. It can describe physical appearance or, more often, a cunning and competitive attitude. Due to its nuanced meaning and infrequent usage, it is suitable for advanced learners."},"example_sentences":[{"sentence":"His small stature and agile movements gave him a jockeyish appearance.","translation":"彼の小柄な体格と機敏な動きは、彼に騎手のような印象を与えた。","type":"adjective","meaning_category":"騎手のような"},{"sentence":"The politician's jockeyish tactics to win the election were widely criticized.","translation":"その政治家が選挙に勝つための出し抜こうとする戦術は広く批判された。","type":"adjective","meaning_category":"ずる賢い"}]}