{"word":"excitation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"興奮、刺激、励起","english_definition":"The state of being excited; stimulation; the act of exciting or arousing. In physics and chemistry, it refers to the addition of a discrete amount of energy to a system, such as an atom or molecule, resulting in a transition to a higher energy state.","examples":[{"sentence":"The crowd was in a state of great excitation.","translation":"群衆は大変興奮した状態だった。"},{"sentence":"The excitation of the electrons caused the atom to emit light.","translation":"電子の励起によって、原子が光を放出した。"},{"sentence":"The news caused considerable excitation in the scientific community.","translation":"そのニュースは科学界にかなりの興奮をもたらした。"}],"collocations":["state of excitation (興奮状態)","cause excitation (興奮を引き起こす)","neural excitation (神経の興奮)","electronic excitation (電子励起)","atomic excitation (原子励起)"],"synonyms":["arousal","stimulation","excitement","agitation","animation","invigoration","galvanization"],"antonyms":["inhibition","depression","calm","quiescence","relaxation"]}],"etymology":{"value":"Derived from the Latin 'excitare', meaning 'to call forth, rouse, stir up'. The English word 'excite' entered the language in the 15th century, and 'excitation' followed as a noun form indicating the state or act of being excited.","priority":"★★★"},"pronunciation":{"ipa":"/ˌeksɪˈteɪʃən/","syllables":"ex-ci-ta-tion"},"inflection":{"noun_plural":"excitations"},"usage_notes":{"explanation":"'Excitation' refers to a state of heightened activity or arousal, whether emotional, physical, or in a scientific context. In general usage, it describes a state of excitement or agitation. In scientific contexts, particularly in physics and chemistry, it refers to the process of adding energy to a system, causing it to transition to a higher energy level. The specific meaning depends heavily on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The excitation was very high because of the boring lecture.","correct":"✓ The lack of engagement led to boredom during the lecture.","note":"'Excitation' implies a positive or heightened state. Boredom is the opposite."},{"incorrect":"✗ The excitation of the atom made it stable.","correct":"✓ The excitation of the atom made it unstable.","note":"Excitation generally makes a system less stable, as it is in a higher energy state. It will eventually decay back to its ground state. "},{"incorrect":"✗ The excitation of the muscle caused it to relax.","correct":"✓ The excitation of the muscle caused it to contract.","note":"Muscle excitation leads to contraction, not relaxation."}],"priority":"★★☆"},"related_words":{"derivatives":["excite (verb)","excited (adjective)","excitable (adjective)","exciting (adjective)","excitatory (adjective)"],"related_terms":["stimulus","response","arousal","agitation","stimulation","energy","photon","electron","quantum"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, more common in technical or scientific writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Excitation' is a relatively formal word that describes a state of being excited or stimulated. It's often used in technical or scientific contexts to describe the process of adding energy to a system, like an atom. In general usage, it refers to a state of heightened emotion or arousal. Because of its varied uses and relatively low frequency, it is considered a C1 level word.","priority":"★★☆"},"example_sentences":[{"sentence":"The **excitation** in the crowd was palpable as the band took the stage.","translation":"バンドがステージに上がると、群衆の興奮は目に見えるようだった。","type":"noun","meaning_category":"興奮 (general)"},{"sentence":"The **excitation** of the nerve cells caused a muscle contraction.","translation":"神経細胞の興奮が筋肉の収縮を引き起こした。","type":"noun","meaning_category":"刺激 (biological)"},{"sentence":"Electronic **excitation** is a fundamental process in photosynthesis.","translation":"電子励起は光合成における基本的なプロセスである。","type":"noun","meaning_category":"励起 (scientific)"}]}