{"word":"A-pole","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of utility pole that resembles the letter 'A' in shape, typically used for supporting power lines or communication cables.","english_definition":"A utility pole constructed in the shape of the letter 'A', used to support overhead power lines or communication cables.","examples":[{"sentence":"The new power lines were supported by sturdy A-poles.","translation":"新しい電力線は頑丈なA型電柱によって支えられていた。"},{"sentence":"A-poles are often used in areas where extra stability is needed.","translation":"A型電柱は、追加の安定性が必要な地域でよく使用される。"}],"collocations":["utility A-pole","power A-pole","communication A-pole","wooden A-pole","steel A-pole"],"synonyms":["A-frame pole"],"antonyms":[]}],"etymology":{"value":"The term 'A-pole' is derived from the pole's shape, which resembles the letter 'A'.","priority":"N/A"},"pronunciation":{"ipa":"/ˈeɪ poʊl/","syllables":"A-pole"},"inflection":{"noun_plural":"A-poles"},"usage_notes":{"explanation":"A-poles are designed to provide greater stability and strength compared to single-pole structures. They are commonly used in areas with high winds, heavy snow, or other environmental conditions that require additional support for overhead lines.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"Technical","text":"The term 'A-pole' refers to a specific type of utility pole shaped like the letter 'A'. It is used in electrical and telecommunications contexts to describe a structure that supports overhead lines. Understanding this term requires familiarity with utility infrastructure terminology."},"example_sentences":[{"sentence":"The construction crew installed several new A-poles along the highway.","translation":"建設作業員は高速道路沿いにいくつかの新しいA型電柱を設置した。","type":"noun","meaning_category":"Utility pole"},{"sentence":"The A-pole design provides superior resistance to wind and ice loads.","translation":"A型電柱の設計は、風や氷の荷重に対する優れた耐性を提供する。","type":"noun","meaning_category":"Utility pole"}]}