{"word":"tannadar","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A police station or police officer in certain parts of India and other South Asian countries.","english_definition":"(historical) A police station or police officer in certain parts of India and other South Asian countries.","examples":[{"sentence":"The villagers reported the crime to the local tannadar.","translation":"村人たちは地元の警察署または警察官に犯罪を報告した。"},{"sentence":"He worked as a tannadar in the city for many years.","translation":"彼は長年、その都市で警察官として働いていた。"}],"collocations":["local tannadar","police tannadar"],"synonyms":["police station","police officer"],"antonyms":[]}],"etymology":{"value":"From Hindi थानदार (thāndār), from थाना (thānā, “police station”) + -दार (-dār, “-holder”).","priority":"N/A"},"pronunciation":{"ipa":"/tænəˌdɑː(ɹ)/","syllables":"tan-na-dar"},"inflection":{"noun_plural":"tannadars"},"usage_notes":{"explanation":"The term 'tannadar' is primarily historical and specific to certain regions of South Asia. It refers to a police station or a police officer in charge of a 'thana' (police station). The term is not commonly used in modern English outside of contexts related to the history or culture of those regions.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["thana"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The word 'tannadar' is a specialized term primarily used in historical or cultural contexts related to South Asia. It is not commonly encountered in general English usage. Understanding this word requires familiarity with the historical administrative and policing structures of the Indian subcontinent."},"example_sentences":[{"sentence":"The old records mentioned the authority of the tannadar in maintaining law and order.","translation":"古い記録には、治安維持における警察署長（または警察官）の権限について言及されていた。","type":"noun","meaning_category":"police officer"},{"sentence":"The villagers sought help from the tannadar to resolve the land dispute.","translation":"村人たちは土地紛争を解決するために警察署長（または警察官）に助けを求めた。","type":"noun","meaning_category":"police officer"}]}