{"word":"Vancomycin","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"バンコマイシン (抗生物質の一種)","english_definition":"An antibiotic used to treat severe bacterial infections, especially those resistant to other antibiotics.","examples":[{"sentence":"Vancomycin is often used to treat MRSA infections.","translation":"バンコマイシンはしばしばMRSA感染症の治療に使用される。"},{"sentence":"The doctor prescribed vancomycin for his pneumonia.","translation":"医師は彼の肺炎にバンコマイシンを処方した。"}],"collocations":["vancomycin resistance","vancomycin-resistant enterococci (VRE)","IV vancomycin","oral vancomycin"],"synonyms":["Vancocin (brand name)"],"antonyms":[]}],"etymology":{"value":"Derived from the term 'Vanquish' suggesting its ability to overcome bacterial infections. The '-mycin' suffix indicates that it is an antibiotic produced by a microorganism.","priority":"★★☆"},"pronunciation":{"ipa":"ˌvæŋkəˈmaɪsɪn","syllables":"van-co-my-cin"},"inflection":{"noun_plural":"Vancomycins"},"usage_notes":{"explanation":"Vancomycin is a glycopeptide antibiotic used to treat serious Gram-positive bacterial infections that are resistant to other antibiotics. It is often reserved for severe infections due to its potential side effects and the risk of promoting vancomycin-resistant bacteria. It is typically administered intravenously but can also be given orally for certain gastrointestinal infections.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I take vancomycin for my cold.","correct":"✓ I am taking vancomycin for a serious bacterial infection.","note":"Vancomycin is a powerful antibiotic reserved for serious bacterial infections, not common colds."},{"incorrect":"✗ Vancomycin is safe for everyone.","correct":"✓ Vancomycin can have side effects and should only be used under a doctor's supervision.","note":"Vancomycin can have potential side effects, including kidney damage and hearing loss, and should be used cautiously."}],"priority":"★★☆"},"related_words":{"derivatives":["vancomycin-resistant (adjective)","glycopeptide (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Vancomycin is a complex term primarily encountered in medical contexts. It refers to a powerful antibiotic used to treat severe bacterial infections, particularly those resistant to other common antibiotics. Understanding its usage requires familiarity with medical terminology and an awareness of antibiotic resistance. It's crucial to recognize that vancomycin is not a first-line treatment and is reserved for specific situations under medical supervision.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient developed a vancomycin-resistant strain of bacteria.","translation":"患者はバンコマイシン耐性菌を発症した。","type":"noun","meaning_category":"抗生物質"},{"sentence":"Vancomycin is administered intravenously to treat the infection.","translation":"バンコマイシンは感染症の治療のために静脈内投与される。","type":"noun","meaning_category":"抗生物質"},{"sentence":"The doctor monitored the patient's kidney function while they were on vancomycin.","translation":"医師は患者がバンコマイシンを投与されている間、腎機能を監視した。","type":"noun","meaning_category":"抗生物質"}]}