{"word":"ethnogeographer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"民族地理学者","english_definition":"A geographer who studies the spatial and ecological aspects of ethnic groups and ethnicity.","examples":[{"sentence":"The ethnogeographer studied the distribution of different cultural groups in the region.","translation":"その民族地理学者は、その地域の異なる文化集団の分布を研究した。"}],"collocations":["study ethnic groups","analyze spatial distribution","research cultural landscapes"],"synonyms":["cultural geographer","human geographer"],"antonyms":[]}],"etymology":{"value":"The word is composed of 'ethno-' (referring to ethnicity or people), 'geo-' (referring to geography or the Earth), and '-grapher' (referring to someone who studies or writes about a particular subject).","priority":"★★★"},"pronunciation":{"ipa":"ˌɛθnoʊdʒiˈɒɡrəfər","syllables":"eth-no-ge-og-ra-pher"},"inflection":{"noun_plural":"ethnogeographers"},"usage_notes":{"explanation":"An ethnogeographer combines the study of human cultures (ethnology) with the study of spatial relationships and landscapes (geography). They often focus on how ethnic groups interact with their environment, how their culture shapes the landscape, and how spatial factors influence their cultural practices.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an ethnogeography.","correct":"✓ He is an ethnogeographer.","note":"'Ethnogeography' is the field of study, while 'ethnogeographer' is the person who studies it."}],"priority":"★★☆"},"related_words":{"derivatives":["ethnogeography (民族地理学)","ethnology (民族学)","geography (地理学)"],"phrases":["cultural landscape","ethnic enclave","spatial analysis"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"This term is specialized and used in academic contexts, particularly in geography, anthropology, and related fields. It refers to a scholar who studies the intersection of ethnicity and geography, focusing on how cultural groups interact with and shape their environments."},"example_sentences":[{"sentence":"As an ethnogeographer, she focused on the impact of globalization on indigenous communities.","translation":"民族地理学者として、彼女はグローバル化が先住民族のコミュニティに与える影響に焦点を当てた。","type":"noun","meaning_category":"職業"},{"sentence":"The ethnogeographer's research revealed the complex relationship between cultural identity and territorial boundaries.","translation":"その民族地理学者の研究は、文化的アイデンティティと領土境界の間の複雑な関係を明らかにした。","type":"noun","meaning_category":"研究分野"}]}