{"word":"zibethone","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"シベトン：ジャコウネコの分泌物に含まれる環状ケトン","english_definition":"A cyclic ketone found in civetone, the glandular secretion of the civet cat.","examples":[{"sentence":"Zibethone is used in perfumery for its musky odor.","translation":"シベトンは、その麝香のような香りのために香水に使用されます。"}],"collocations":["used in perfumery","synthetic zibethone"],"synonyms":["civetone","muscone"],"antonyms":[]}],"etymology":{"value":"Derived from 'zibet', the name for the civet cat, and '-one', a suffix used in chemistry to denote a ketone.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈzaɪbɪθoʊn/","syllables":"zi-be-thone"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Zibethone is primarily of interest in the context of organic chemistry and perfumery. It is a key component contributing to the characteristic musky scent of civet. Due to ethical concerns regarding the extraction of civet from animals, synthetic alternatives are often used in modern perfumery.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["zibet (civet cat)","ketone"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Zibethone' is a highly specialized term primarily encountered in the fields of chemistry and perfumery. Understanding requires knowledge of organic chemistry (ketones) and the origin of animal-derived scents in perfumery. Its usage is limited to technical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The synthesis of zibethone has been a topic of research in organic chemistry.","translation":"シベトンの合成は、有機化学の研究テーマとなっています。","type":"scientific","meaning_category":"chemical compound"},{"sentence":"Many modern perfumes use synthetic zibethone to mimic the scent of civet.","translation":"現代の香水の多くは、ジャコウネコの香りを模倣するために合成シベトンを使用しています。","type":"commercial","meaning_category":"perfumery"}]}