{"word":"Equinity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"馬の性質、馬らしさ","english_definition":"The state or quality of being equine; horseness.","examples":[{"sentence":"The painting captured the equinity of the wild mustangs.","translation":"その絵は野生のマスタングの馬らしさを捉えていた。"},{"sentence":"The trainer understood the equinity of each horse, allowing him to tailor their training.","translation":"トレーナーはそれぞれの馬の馬らしさを理解していたので、彼らの訓練を調整することができた。"}],"collocations":["essence of equinity","understanding equinity"],"synonyms":["horseness","equine nature"],"antonyms":[]}],"etymology":{"value":"From 'equine' (relating to horses) + '-ity' (a suffix forming nouns denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈkwɪnɪti/","syllables":"e-quin-i-ty"},"inflection":{"noun_plural":"equinities (rarely used)"},"usage_notes":{"explanation":"'Equinity' is a relatively rare and somewhat formal term used to describe the characteristics or qualities that are typical of horses. It is often used in contexts where a deeper understanding or appreciation of horses is being expressed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The equinity was running fast.","correct":"✓ The horse was running fast.","note":"'Equinity' is a quality, not a physical entity. Use 'horse' instead to refer to the animal itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["equine (adjective: relating to horses)","equine (noun: a horse or other member of the horse family)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Equinity' is a specialized term referring to the essence or quality of being a horse. It's not commonly used in everyday language and is more likely to appear in literature, scientific contexts, or discussions about horsemanship where a deeper understanding of horses is being conveyed. It is derived from 'equine,' which is a more common adjective meaning 'relating to horses.'"},"example_sentences":[{"sentence":"The sculptor aimed to capture the very equinity of the animal in his bronze statue.","translation":"彫刻家は、彼のブロンズ像で動物のまさに馬らしさを捉えることを目指した。","type":"noun","meaning_category":"馬の性質"},{"sentence":"Understanding the equinity of the breed is crucial for effective breeding programs.","translation":"その品種の馬らしさを理解することは、効果的な繁殖プログラムにとって重要である。","type":"noun","meaning_category":"馬の性質"}]}