{"word":"fermion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"フェルミ粒子：半整数スピンを持つ素粒子。パウリの排他原理に従う。","english_definition":"A particle with half-integer spin (e.g., 1/2, 3/2, 5/2), which obeys Fermi-Dirac statistics and the Pauli exclusion principle.","examples":[{"sentence":"Electrons, protons, and neutrons are all fermions.","translation":"電子、陽子、中性子はすべてフェルミ粒子です。"},{"sentence":"Fermions are fundamental building blocks of matter.","translation":"フェルミ粒子は物質の基本的な構成要素です。"}],"collocations":["elementary fermion","composite fermion","Majorana fermion","Dirac fermion"],"synonyms":[],"antonyms":["boson"]}],"etymology":{"value":"The term 'fermion' is derived from the surname of the physicist Enrico Fermi, who, along with Paul Dirac, developed Fermi-Dirac statistics, which describe the behavior of these particles.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɜːrmiɒn/","syllables":"fer-mi-on"},"inflection":{"noun_plural":"fermions"},"usage_notes":{"explanation":"Fermions are one of the two fundamental classes of particles in quantum mechanics, the other being bosons. Fermions have half-integer spin, meaning their spin quantum number is a half-integer (1/2, 3/2, etc.). This property leads them to obey the Pauli exclusion principle, which states that no two identical fermions can occupy the same quantum state simultaneously. This principle is crucial for the stability of matter and the structure of atoms. Examples of fermions include electrons, protons, neutrons, quarks, and neutrinos.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Fermions can occupy the same quantum state.","correct":"✓ Fermions cannot occupy the same quantum state.","note":"Due to the Pauli exclusion principle, no two identical fermions can occupy the same quantum state simultaneously."}],"priority":"★★☆"},"related_words":{"derivatives":["fermionic (adjective)"],"related_terms":["boson","spin","Pauli exclusion principle","Fermi-Dirac statistics","quantum mechanics"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in physics and related scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"A 'fermion' is a type of particle in physics that has a special property called 'half-integer spin.' This means its spin is like 1/2, 3/2, or 5/2. Because of this spin, fermions follow a rule called the 'Pauli exclusion principle,' which says that two identical fermions can't be in the same state at the same time. Electrons, protons, and neutrons are all examples of fermions. This concept is mostly used in advanced physics discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The Standard Model classifies fundamental particles as either fermions or bosons.","translation":"標準模型は、基本粒子をフェルミ粒子またはボソンとして分類します。","type":"noun","meaning_category":"particle physics"},{"sentence":"Electrons, being fermions, obey the Fermi-Dirac statistics.","translation":"電子はフェルミ粒子であるため、フェルミ・ディラック統計に従います。","type":"noun","meaning_category":"particle physics"},{"sentence":"The properties of fermions are crucial for understanding the structure of matter.","translation":"フェルミ粒子の特性は、物質の構造を理解する上で非常に重要です。","type":"noun","meaning_category":"particle physics"}]}