{"word":"convulsion-resistant","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Resistant to convulsions; having the property of preventing or reducing convulsions.","english_definition":"Having the property of preventing or reducing convulsions.","examples":[{"sentence":"The new drug is convulsion-resistant and shows promise in treating epilepsy.","translation":"その新薬は抗痙攣作用があり、てんかんの治療に有望である。"},{"sentence":"Researchers are developing convulsion-resistant materials for use in medical devices.","translation":"研究者たちは医療機器に使用するための抗痙攣性材料を開発している。"}],"collocations":["convulsion-resistant drug","convulsion-resistant material","convulsion-resistant properties"],"synonyms":["anticonvulsant","antiepileptic"],"antonyms":["convulsive","proconvulsant"]}],"etymology":{"value":"The word is formed by combining \"convulsion\" (a sudden, violent, irregular movement of the body caused by involuntary contraction of muscles) with \"resistant\" (offering resistance; not susceptible).","priority":"N/A"},"pronunciation":{"ipa":"/kənˈvʌlʃən rɪˈzɪstənt/","syllables":"con-vul-sion re-sis-tant"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparative and superlative forms (which are less common for this word)."},"usage_notes":{"explanation":"The term \"convulsion-resistant\" is primarily used in medical and scientific contexts to describe substances, treatments, or materials that can prevent or reduce the occurrence of convulsions. It is often used interchangeably with \"anticonvulsant\" or \"antiepileptic,\" although \"anticonvulsant\" is more common.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["convulsion","resistant","anticonvulsant","antiepileptic"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"C2 (Technical/Medical Vocabulary)","frequency_google_ngram":"Low Frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"convulsion-resistant\" is a technical term primarily used in medical and scientific contexts. It describes something that can prevent or reduce convulsions, which are sudden, uncontrolled muscle spasms. Understanding this term requires knowledge of medical terminology. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The study investigated the convulsion-resistant effects of the compound.","translation":"その研究では、その化合物の抗痙攣効果が調査された。","type":"adjective","meaning_category":"medical"},{"sentence":"The new helmet is made with convulsion-resistant materials to protect against head injuries.","translation":"その新しいヘルメットは、頭部外傷から保護するために抗痙攣性材料で作られている。","type":"adjective","meaning_category":"technical"}]}