{"word":"translatableness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"翻訳可能性、翻訳できること","english_definition":"The quality of being translatable; the extent to which something can be translated.","examples":[{"sentence":"The translatableness of poetry is a long-debated topic.","translation":"詩の翻訳可能性は、長年議論されているテーマです。"},{"sentence":"The high degree of translatableness of this document made it easy to adapt for international audiences.","translation":"この文書の高い翻訳可能性により、国際的な読者向けに容易に適合させることができました。"}],"collocations":["high translatableness (高い翻訳可能性)","low translatableness (低い翻訳可能性)","degree of translatableness (翻訳可能性の程度)","inherent translatableness (固有の翻訳可能性)"],"synonyms":["interpretability","convertibility"],"antonyms":["untranslatableness","uninterpretability"]}],"etymology":{"value":"Derived from 'translatable' (capable of being translated) + '-ness' (suffix indicating a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtrænzˈleɪtəblnəs/","syllables":"trans-la-ta-ble-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Translatableness' refers to the inherent quality of a text or idea that allows it to be accurately and effectively conveyed in another language. It is often discussed in the context of literature, philosophy, and technical documentation, where the preservation of meaning and nuance is crucial.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The translatableness is good.","correct":"✓ The translatableness is high.","note":"Use 'high' or 'low' to describe the degree of translatableness, rather than 'good' or 'bad'."}],"priority":"★☆☆"},"related_words":{"derivatives":["translate","translatable","translation","translator"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Translatableness' is a complex term referring to how easily and accurately a text can be converted from one language to another. It's often used in academic or technical contexts when discussing the challenges of conveying meaning across different linguistic and cultural boundaries. A text with high translatableness is straightforward to translate, while one with low translatableness might require significant adaptation or interpretation."},"example_sentences":[{"sentence":"The translatableness of legal documents is crucial for international law.","translation":"国際法において、法的文書の翻訳可能性は非常に重要です。","type":"noun","meaning_category":"general"},{"sentence":"Some argue that poetry loses its essence in translation, suggesting a low degree of translatableness.","translation":"詩は翻訳されると本質を失うと主張する人もおり、それは低い翻訳可能性を示唆しています。","type":"noun","meaning_category":"literature"}]}