{"word":"Polychronious","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Relating to or characterized by polychronicity; involving multiple activities or tasks being handled concurrently or overlapping in time.","english_definition":"Relating to or characterized by polychronicity, the preference for doing multiple things at the same time.","examples":[{"sentence":"A polychronious work environment often involves frequent interruptions and shifting priorities.","translation":"多時間性を特徴とする職場環境では、頻繁な中断や優先順位の変更が伴うことが多いです。"},{"sentence":"People with a polychronious personality tend to juggle multiple projects simultaneously.","translation":"多時間性を好む性格の人は、複数のプロジェクトを同時にこなす傾向があります。"}],"collocations":["polychronious behavior","polychronious culture","polychronious work style","polychronious personality"],"synonyms":["multitasking","simultaneous","concurrent","overlapping"],"antonyms":["monochronous","sequential","linear"]}],"etymology":{"value":"Derived from 'polychronicity,' which combines 'poly-' (meaning 'many') with 'chronos' (meaning 'time').","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒlɪˈkrəʊniəs/","syllables":"po-ly-chro-ni-ous"},"inflection":{"adjective_forms":{"comparative":"more polychronious","superlative":"most polychronious"}},"usage_notes":{"explanation":"'Polychronious' describes something related to polychronicity, which is the preference for and ability to handle multiple tasks or activities at the same time. It's often used in organizational behavior and psychology to describe individuals or environments that thrive on multitasking and flexible scheduling.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The office was very polychronic.","correct":"✓ The office had a polychronious atmosphere.","note":"'Polychronic' is more commonly used as 'polychronicity'. 'Polychronious' is used as an adjective to describe something related to polychronicity."},{"incorrect":"✗ He is a polychronious.","correct":"✓ He has a polychronious work style.","note":"'Polychronious' is an adjective, so it needs to modify a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["polychronicity (noun): The state or quality of preferring to do many things at the same time.","polychrone (noun, rare): A person who prefers to do many things at the same time."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polychronious' is a term used to describe something that is characterized by or related to polychronicity, which is the preference for handling multiple tasks or activities simultaneously. This word is most often encountered in academic or professional discussions related to time management, organizational behavior, or psychology. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The company fostered a polychronious culture where employees were encouraged to work on several projects at once.","translation":"その会社は、従業員が一度に複数のプロジェクトに取り組むことを奨励する、多時間性を特徴とする文化を育成しました。","type":"adjective","meaning_category":"Relating to polychronicity"},{"sentence":"Her polychronious approach to work allowed her to efficiently manage multiple deadlines.","translation":"彼女の多時間的な仕事への取り組みにより、複数の締め切りを効率的に管理することができました。","type":"adjective","meaning_category":"Characterized by polychronicity"}]}