{"word":"hypersplenism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"脾機能亢進症（ひきのうこうしんしょう）","english_definition":"A condition in which the spleen is overactive, resulting in the excessive destruction of blood cells.","examples":[{"sentence":"Hypersplenism can lead to anemia, leukopenia, and thrombocytopenia.","translation":"脾機能亢進症は貧血、白血球減少症、血小板減少症を引き起こす可能性があります。"},{"sentence":"Treatment for hypersplenism may involve splenectomy.","translation":"脾機能亢進症の治療には脾臓摘出術が含まれる場合があります。"}],"collocations":["cause hypersplenism","treat hypersplenism","secondary hypersplenism","primary hypersplenism"],"synonyms":["splenomegaly (often associated)"],"antonyms":[]}],"etymology":{"value":"'Hyper-' (過剰) + 'splen' (脾臓) + '-ism' (状態)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˈspliːnɪzəm/","syllables":"hy-per-splee-ni-sm"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hypersplenism is a medical condition characterized by an overactive spleen. This leads to the destruction of blood cells (red blood cells, white blood cells, and platelets) at an accelerated rate. This can result in anemia (low red blood cell count), leukopenia (low white blood cell count), and thrombocytopenia (low platelet count). The condition can be primary (caused by a problem within the spleen itself) or secondary (caused by another underlying disease). Diagnosis often involves blood tests and imaging studies. Treatment options vary depending on the cause and severity of the condition, and may include medication or splenectomy (surgical removal of the spleen).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Hypersplenism is when the spleen is underactive.","correct":"✓ Hypersplenism is when the spleen is overactive.","note":"Hypersplenism involves an *overactive* spleen, not an underactive one."},{"incorrect":"✗ Hypersplenism only affects red blood cells.","correct":"✓ Hypersplenism can affect red blood cells, white blood cells, and platelets.","note":"Hypersplenism can affect all types of blood cells, not just red blood cells."}],"priority":"★★☆"},"related_words":{"derivatives":["splenectomy","splenomegaly","splenic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypersplenism' is a medical term referring to a specific condition involving an overactive spleen. Understanding this term requires familiarity with medical terminology related to the spleen and blood cell production. It's generally encountered in medical contexts or when discussing hematological disorders."},"example_sentences":[{"sentence":"The patient was diagnosed with hypersplenism after blood tests revealed low platelet counts.","translation":"血液検査で血小板数の低下が認められたため、患者は脾機能亢進症と診断された。","type":"medical condition","meaning_category":"diagnosis"},{"sentence":"Secondary hypersplenism can be a complication of liver cirrhosis.","translation":"二次性脾機能亢進症は、肝硬変の合併症として起こることがある。","type":"medical condition","meaning_category":"cause"},{"sentence":"Splenectomy is sometimes necessary to treat severe cases of hypersplenism.","translation":"重症の脾機能亢進症を治療するためには、脾臓摘出術が必要となる場合がある。","type":"medical condition","meaning_category":"treatment"}]}