{"word":"aestheticism","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"耽美主義、唯美主義","english_definition":"An intellectual and art movement supporting the emphasis of aesthetic values more than social-political themes for literature, fine art, music and other arts.","examples":[{"sentence":"Aestheticism was a prominent movement in the late 19th century.","translation":"耽美主義は19世紀後半に顕著な運動でした。"},{"sentence":"The artist's work is characterized by aestheticism and attention to beauty.","translation":"その芸術家の作品は、耽美主義と美へのこだわりによって特徴づけられています。"}],"collocations":["art for art's sake","beauty as the highest value","decadence","sensory experience"],"synonyms":["art for art's sake","decadence","sensualism","hedonism (in some contexts)"],"antonyms":["moralism","utilitarianism","realism (in some contexts)"]},{"part_of_speech":"noun","definition":"耽美的な性質、美意識","english_definition":"Sensitivity to or concern with artistic values.","examples":[{"sentence":"The building's design reflects a strong aestheticism.","translation":"その建物のデザインは、強い美意識を反映しています。"},{"sentence":"Her aestheticism is evident in her carefully curated home decor.","translation":"彼女の美意識は、丁寧にキュレーションされた家の装飾に明らかです。"}],"collocations":["artistic sensibility","refined taste","cultivated appreciation"],"synonyms":["artistic sensibility","refined taste","cultivated appreciation","artistic sense"],"antonyms":["vulgarity","tastelessness","insensitivity"]}],"etymology":{"value":"From 'aesthetic' + '-ism'. 'Aesthetic' derives from Greek 'aisthētikos' meaning 'perceptive, sensitive', from 'aisthēsis' meaning 'sensation, perception'.","priority":"★★☆"},"pronunciation":{"ipa":"/iːsˈθɛtɪsɪzəm/","syllables":"aes·thet·i·cism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Aestheticism emphasizes the pursuit of beauty and sensory experiences for their own sake, often rejecting moral or social concerns. It can refer to a philosophical movement or simply a personal appreciation for aesthetics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices aestheticism in his business dealings.","correct":"✓ He values aesthetics in his business dealings.","note":"Aestheticism is usually related to art or personal philosophy rather than business. In business, you would value 'aesthetics' or 'design'."},{"incorrect":"✗ The aestheticism of the painting was its political message.","correct":"✓ The aesthetic appeal of the painting was its use of color and light.","note":"Aestheticism emphasizes beauty and form over political messages. If the focus is on the political message, it's not aestheticism."}],"priority":"★★☆"},"related_words":{"derivatives":["aesthetic (adj.)","aesthete (noun)","aesthetical (adj.)","aesthetically (adv.)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in academic or artistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Aestheticism' is a term used to describe a focus on beauty and artistic expression, often prioritizing these values over social or moral concerns. It can refer to a specific movement in art and literature, or more generally to a personal appreciation for aesthetics. The word is relatively uncommon and is more likely to be encountered in academic or artistic discussions."},"example_sentences":[{"sentence":"The novel is a prime example of literary aestheticism.","translation":"その小説は文学的な耽美主義の代表的な例です。","type":"noun","meaning_category":"耽美主義"},{"sentence":"Her aestheticism led her to collect only the most beautiful objects.","translation":"彼女の美意識は、彼女に最も美しい物だけを集めさせた。","type":"noun","meaning_category":"美意識"},{"sentence":"The movement of aestheticism rejected the idea that art should serve a moral purpose.","translation":"耽美主義の運動は、芸術が道徳的な目的を果たすべきだという考えを拒否した。","type":"noun","meaning_category":"耽美主義"}]}