{"word":"Deformism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(政治)現状を維持しながら、少しずつ改革を進めること。漸進主義的な改革。","english_definition":"A political strategy that aims to achieve socialist goals through gradual reforms within the existing capitalist system, rather than through revolutionary upheaval.","examples":[{"sentence":"Deformism is often criticized by revolutionary socialists for being too slow and ineffective.","translation":"漸進主義的な改革は、革命的な社会主義者からは、遅すぎ、効果がないと批判されることが多い。"},{"sentence":"The party adopted a strategy of deformism, seeking to improve workers' rights through legislation.","translation":"その党は、法律を通じて労働者の権利を改善しようとする漸進主義的な改革の戦略を採用した。"}],"collocations":["gradual reform","progressive reform","social democracy","welfare state"],"synonyms":["reformism","gradualism","ameliorism","social democracy"],"antonyms":["revolution","insurrection","radicalism","status quo"]}],"etymology":{"value":"The term 'deformism' is derived from 'reform,' with the prefix 'de-' possibly implying a deviation or modification of traditional reformist approaches. It suggests a focus on incremental changes within existing structures.","priority":"★★☆"},"pronunciation":{"ipa":"/diˈfɔːrmɪzəm/","syllables":"de-form-ism"},"inflection":{"noun_plural":"Deformisms"},"usage_notes":{"explanation":"'Deformism' is a political term, primarily used in discussions of socialist and Marxist theory. It describes a strategy of achieving socialist goals through gradual reforms within a capitalist system. It is often contrasted with revolutionary approaches that seek to overthrow the existing system entirely. The term can sometimes carry a negative connotation, implying a lack of commitment to radical change.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Deformism is a sudden and radical change.","correct":"✓ Deformism is a gradual and incremental change.","note":"Deformism is characterized by gradualism, not sudden or radical shifts."},{"incorrect":"✗ Deformism aims to overthrow the existing system.","correct":"✓ Deformism aims to reform the existing system.","note":"Deformism works within the existing system, rather than seeking to overthrow it."}],"priority":"★★☆"},"related_words":{"derivatives":["deformist (noun/adjective)"],"related_concepts":["socialism","capitalism","reform","revolution","gradualism","social democracy","welfare state"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Deformism' is a specialized political term that refers to a strategy of achieving socialist goals through gradual reforms within a capitalist system. It's often used in academic or political discussions, particularly when contrasting different approaches to social and economic change. Understanding this term requires familiarity with political theory and ideologies. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The party's platform was based on deformism, advocating for incremental changes to improve social welfare.","translation":"その党の綱領は漸進主義的な改革に基づき、社会福祉を改善するための段階的な変更を提唱していた。","type":"general","meaning_category":"political strategy"},{"sentence":"Critics of deformism argue that it is too slow to address urgent social problems.","translation":"漸進主義的な改革の批判者たちは、それが喫緊の社会問題に対処するには遅すぎると主張する。","type":"criticism","meaning_category":"political theory"}]}