{"word":"cross-locking","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(機械工学) クロスロッキング機構、交差ロック機構","english_definition":"A mechanism or system where two or more components are interlocked in such a way that the movement or release of one component is dependent on the position or state of another.","examples":[{"sentence":"The differential uses a cross-locking system to improve traction in off-road conditions.","translation":"そのディファレンシャルは、オフロード状態でのトラクションを向上させるためにクロスロッキングシステムを使用しています。"},{"sentence":"The safety gate features a cross-locking mechanism to prevent accidental opening.","translation":"その安全ゲートは、誤って開くのを防ぐためのクロスロッキング機構を備えています。"}],"collocations":["differential cross-locking","safety gate cross-locking","mechanical cross-locking","hydraulic cross-locking","pneumatic cross-locking"],"synonyms":["interlocking mechanism","sequential locking","dependent locking"],"antonyms":["independent locking","unrestricted movement"]},{"part_of_speech":"adjective","definition":"クロスロッキングの、交差ロック式の","english_definition":"Describing a system or component that utilizes cross-locking.","examples":[{"sentence":"The cross-locking pliers provide a secure grip on the workpiece.","translation":"そのクロスロッキングプライヤーは、ワークピースをしっかりとグリップします。"},{"sentence":"This cross-locking design ensures that the components remain firmly in place.","translation":"このクロスロッキング設計により、コンポーネントが確実に所定の位置に留まります。"}],"collocations":["cross-locking pliers","cross-locking design","cross-locking mechanism","cross-locking system"],"synonyms":["interlocked","sequentially locked","dependently locked"],"antonyms":["independently locked","unrestricted"]}],"etymology":{"value":"The term 'cross-locking' is derived from the concept of locking two or more elements in a way that their actions are mutually dependent or interlinked. The 'cross-' prefix indicates the interdependence or interaction between the locking elements.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈkrɔsˌlɒkɪŋ/","syllables":"cross-lock-ing"},"inflection":{"noun_plural":"cross-lockings","verb_forms":{}},"usage_notes":{"explanation":"'Cross-locking' typically refers to mechanical or electromechanical systems where the engagement or disengagement of one component is contingent on the state of another. It is commonly used in safety mechanisms, differential systems in vehicles, and other applications where sequential or interdependent locking is required. The term can be used as both a noun (referring to the system itself) and an adjective (describing a component or design).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The door has a cross lock.","correct":"✓ The door has a cross-locking mechanism.","note":"'Cross lock' is not commonly used. It's more accurate to specify 'cross-locking mechanism' or 'cross-locking system' to describe the interlocking feature. "},{"incorrect":"✗ The system is cross lock.","correct":"✓ The system is cross-locking.","note":"When used as an adjective, 'cross-locking' should be used to describe the system."}],"priority":"☆☆☆"},"related_words":{"derivatives":["lock","locking","interlock","interlocking"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - technical term.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Cross-locking' is a technical term primarily used in engineering and mechanics. It describes a system where the locking of one component is dependent on the state or position of another, creating an interdependent locking mechanism. This term is not commonly used in everyday language and is typically found in technical documentation, engineering specifications, and specialized contexts related to mechanical systems and safety devices."},"example_sentences":[{"sentence":"The **cross-locking** differential provides enhanced traction on uneven surfaces.","translation":"クロスロッキングディファレンシャルは、凹凸のある路面でトラクションを向上させます。","type":"adjective","meaning_category":"Describing a system"},{"sentence":"The **cross-locking** mechanism prevents the accidental release of the load.","translation":"クロスロッキング機構は、荷物の誤った解放を防ぎます。","type":"noun","meaning_category":"Mechanical Engineering"},{"sentence":"This **cross-locking** design ensures that the components remain firmly in place during operation.","translation":"このクロスロッキング設計により、コンポーネントは動作中も確実に所定の位置に留まります。","type":"adjective","meaning_category":"Describing a design"}]}