{"word":"Goblinism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The characteristic behavior, appearance, or nature of goblins; goblin-like qualities.","english_definition":"The characteristic behavior, appearance, or nature of goblins; goblin-like qualities.","examples":[{"sentence":"The old house had an air of Goblinism about it, with its crooked windows and shadowy corners.","translation":"その古い家は、歪んだ窓と影の多い角があり、ゴブリンのような雰囲気を持っていた。"},{"sentence":"His Goblinism was evident in his mischievous grin and fondness for pranks.","translation":"彼のゴブリン気質は、いたずらっぽい笑みと悪ふざけ好きに明らかだった。"}],"collocations":["air of Goblinism","essence of Goblinism","display Goblinism"],"synonyms":["goblinry","impishness","mischievousness","wickedness"],"antonyms":["angelic behavior","benevolence","kindness"]}],"etymology":{"value":"Derived from 'goblin' (a mischievous, ugly creature of folklore) with the suffix '-ism' (denoting a characteristic, condition, or doctrine).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɒblɪnɪzəm/","syllables":"Gob-lin-ism"},"inflection":{"noun_plural":"Goblinisms"},"usage_notes":{"explanation":"'Goblinism' is a relatively rare and somewhat whimsical term used to describe qualities associated with goblins. It can refer to physical appearance, behavior, or general atmosphere reminiscent of goblins. It is often used in fantasy literature or playful contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The goblinism was very tall and green.","correct":"✓ The goblin was very tall and green.","note":"'Goblinism' is a quality or characteristic, not a creature. Use 'goblin' to refer to the creature itself."}],"priority":"★★☆"},"related_words":{"derivatives":["goblin","goblinry","goblinesque"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Goblinism' is a niche term, primarily found in fantasy literature or imaginative contexts. It describes the essence or qualities associated with goblins, such as mischief, ugliness, or a generally eerie atmosphere. Understanding requires familiarity with the concept of goblins in folklore and literature."},"example_sentences":[{"sentence":"The forest seemed to exude an unsettling Goblinism, making the travelers uneasy.","translation":"その森は不安なゴブリンのような雰囲気を醸し出し、旅行者たちを不安にさせた。","type":"noun","meaning_category":"characteristic qualities"},{"sentence":"The artist captured the essence of Goblinism in his grotesque sculptures.","translation":"その芸術家は、彼のグロテスクな彫刻でゴブリンの本質を捉えた。","type":"noun","meaning_category":"characteristic qualities"}]}