{"word":"actualizer","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(心理学) 自己実現者：自己実現を達成した人、または自己実現に向けて努力している人","english_definition":"(psychology) A person who has achieved self-actualization or is working towards it.","examples":[{"sentence":"Maslow described self-actualizers as being highly creative and accepting of themselves and others.","translation":"マズローは、自己実現者を非常に創造的で、自分自身や他人を受け入れる人々と説明した。"},{"sentence":"To become an actualizer, one must strive for personal growth and fulfillment.","translation":"自己実現者になるためには、個人の成長と充足を追求しなければならない。"}],"collocations":["self-actualizer","potential actualizer"],"synonyms":["self-realized person","fulfilled individual"],"antonyms":["neurotic","maladjusted"],"notes":"This term is primarily used in the context of Maslow's hierarchy of needs and humanistic psychology."}],"etymology":{"value":"Derived from 'actualize,' meaning to make something actual or real. The suffix '-er' is added to denote a person who performs the action.","priority":"2"},"pronunciation":{"ipa":"/ˈæktʃuəlaɪzər/","syllables":"ac-tu-al-iz-er"},"inflection":{"noun_plural":"actualizers"},"usage_notes":{"explanation":"The term 'actualizer' is closely associated with Abraham Maslow's theory of self-actualization, which is the realization of one's full potential. It's often used in discussions of personal growth, human potential, and positive psychology.","priority":"3"},"common_mistakes":{"examples":[{"incorrect":"He is a great actualizer of business plans.","correct":"He is very good at actualizing business plans.","note":"'Actualizer' typically refers to a person achieving self-actualization, not someone who makes plans real. Use 'good at actualizing' for the latter."}],"priority":"1"},"related_words":{"derivatives":["actualize (verb)","actualization (noun)","self-actualization (noun)"],"related_concepts":["Maslow's hierarchy of needs","humanistic psychology","self-fulfillment","personal growth"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in academic or psychological contexts.","priority":"1"},"readability_explanation":{"level":"C1","text":"The term 'actualizer' is a specialized term primarily used within the field of psychology, specifically related to Maslow's hierarchy of needs and the concept of self-actualization. It refers to an individual who is in the process of achieving or has achieved their full potential. Understanding this term requires familiarity with psychological theories of human motivation and personal growth."},"example_sentences":[{"sentence":"The course aims to help participants become actualizers in their own lives.","translation":"このコースは、参加者が自身の人生において自己実現者になることを目指しています。","type":"general","meaning_category":"self-realization"},{"sentence":"Self-actualizers often exhibit a strong sense of purpose and meaning.","translation":"自己実現者は、しばしば強い目的意識と意味を見出しています。","type":"general","meaning_category":"self-realization"}]}