{"word":"locally-adapted","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"地域に適応した、地域に特化した","english_definition":"Modified or adjusted to suit the specific conditions, needs, or preferences of a particular local area or community.","examples":[{"sentence":"The company sells locally-adapted versions of its software in different countries.","translation":"その会社は、各国で地域に適応させたバージョンのソフトウェアを販売しています。"},{"sentence":"The agricultural techniques are locally-adapted to the climate and soil conditions.","translation":"その農業技術は、気候と土壌条件に合わせて地域に適応されています。"},{"sentence":"The school curriculum includes locally-adapted materials to reflect the community's history and culture.","translation":"学校のカリキュラムには、地域の歴史と文化を反映させるために、地域に特化した教材が含まれています。"}],"collocations":["locally-adapted curriculum (地域に適応したカリキュラム)","locally-adapted technology (地域に適応した技術)","locally-adapted solutions (地域に適応した解決策)","locally-adapted varieties (地域に適応した品種)"],"synonyms":["localized","regionalized","customized","tailored","adapted","context-specific"],"antonyms":["globalized","standardized","universal","generic"]},{"part_of_speech":"adjective","definition":"(生物が)地域的な環境に適応進化した","english_definition":"(Of a species or population) having evolved specific traits that enhance survival and reproduction in a particular local environment.","examples":[{"sentence":"The plant species is locally-adapted to the high altitude and harsh conditions of the mountain region.","translation":"その植物種は、山岳地域の高地と厳しい条件に適応するように地域的に進化しました。"},{"sentence":"Locally-adapted breeds of livestock are often more resilient to local diseases and climate variations.","translation":"地域に適応した家畜の品種は、地元の病気や気候変動に対する回復力が高いことが多いです。"}],"collocations":["locally-adapted species (地域に適応した種)","locally-adapted breeds (地域に適応した品種)","locally-adapted populations (地域に適応した個体群)"],"synonyms":["endemic","native","indigenous","acclimatized"],"antonyms":["introduced","non-native","exotic"]}],"etymology":{"value":"The word is formed by combining 'locally' (referring to a specific area or region) and 'adapted' (modified to suit certain conditions).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈloʊkəli əˈdæptɪd/","syllables":"lo-cal-ly a-dap-ted"},"inflection":{"notes":"This is an adjective, so it doesn't have different forms for tense or number."},"usage_notes":{"explanation":"The term 'locally-adapted' emphasizes that something has been specifically modified or has evolved to fit the unique characteristics of a particular place. This adaptation can be intentional, as in the case of technology or curricula, or it can be a result of natural selection, as in the case of species evolving to suit their environment. The term is often used in discussions of sustainability, conservation, and cultural relevance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The locally adapted plant.","correct":"✓ The locally-adapted plant.","note":"The hyphen is important to indicate that 'locally' modifies 'adapted' and that the phrase acts as a single adjective."},{"incorrect":"✗ The software is adapted to local.","correct":"✓ The software is locally-adapted.","note":"'Locally-adapted' is an adjective. 'Adapted to local conditions' is also correct but has a slightly different emphasis."}],"priority":"★★☆"},"related_words":{"derivatives":["adaptation (適応)","localize (地域化する)","local (地元の)"],"phrases":["culturally relevant (文化的に適切)","context-specific (状況に特有)","place-based (場所に基づいた)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in use, particularly in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Locally-adapted' is a term used to describe something that has been changed or has evolved to be suitable for a specific place. This can refer to things like technology, agricultural practices, or even species of plants and animals. The key idea is that the thing has been modified to fit the unique conditions of a particular local area. It's a more advanced term, often used in discussions about sustainability, conservation, and cultural relevance."},"example_sentences":[{"sentence":"The farmers use locally-adapted seeds that are resistant to drought.","translation":"農家は干ばつに強い地域に適応した種子を使用しています。","type":"adjective","meaning_category":"地域に適応した (農業)"},{"sentence":"The NGO promotes locally-adapted healthcare solutions in rural communities.","translation":"そのNGOは、農村地域で地域に適応した医療ソリューションを推進しています。","type":"adjective","meaning_category":"地域に適応した (医療)"},{"sentence":"This locally-adapted variety of rice yields higher harvests in the region.","translation":"この地域に適応した品種の米は、その地域でより高い収穫量をもたらします。","type":"adjective","meaning_category":"地域に適応した (生物)"}]}