{"word":"two-barreled","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"二連銃身の","english_definition":"Having two barrels.","examples":[{"sentence":"A two-barreled shotgun.","translation":"二連銃身の散弾銃。"}],"collocations":[],"synonyms":[],"antonyms":[],"notes":[]},{"part_of_speech":"adjective","definition":"二重の意味を持つ、二つの目的を持つ","english_definition":"Having two aspects or purposes; serving two functions.","examples":[{"sentence":"A two-barreled approach to solving the problem.","translation":"問題を解決するための二重のアプローチ。"},{"sentence":"The plan has a two-barreled effect: it reduces costs and improves efficiency.","translation":"その計画には、コスト削減と効率改善という二重の効果がある。"}],"collocations":[],"synonyms":["dual","double","twofold"],"antonyms":["single","onefold"],"notes":[]}],"etymology":{"value":"From 'two' + 'barreled', referring to a gun with two barrels. The figurative sense extends from this literal meaning.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtuːˈbærəld/","syllables":"two-bar-reled"},"inflection":{},"usage_notes":{"explanation":"The term 'two-barreled' can be used literally to describe a firearm with two barrels. Figuratively, it describes something with two distinct aspects, purposes, or effects. The figurative use often implies that both aspects are powerful or effective.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'two-barreled' is relatively uncommon. Its literal meaning is straightforward, referring to a gun with two barrels. The figurative meaning, indicating something with two distinct and often powerful aspects or purposes, is more nuanced and requires understanding of metaphorical language."},"example_sentences":[{"sentence":"He brought his two-barreled rifle on the hunting trip.","translation":"彼は狩猟旅行に二連銃身のライフルを持ってきた。","type":"literal","meaning_category":"二連銃身の"},{"sentence":"The government is taking a two-barreled approach to combatting unemployment: job creation and skills training.","translation":"政府は失業対策として、雇用創出と技能訓練という二重のアプローチをとっている。","type":"figurative","meaning_category":"二重の意味を持つ"}]}