{"word":"parhomology","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"相同性があるが、必ずしも共通の祖先から進化したとは限らない遺伝子またはタンパク質間の類似性。相同性には、オルソログ（種分化によって分離された遺伝子）とパラログ（遺伝子重複によって分離された遺伝子）が含まれるが、パラホモロジーは、非相同プロセスによる類似性を指す。","english_definition":"Similarity between genes or proteins that is homologous but not necessarily evolved from a common ancestor. Homology includes orthologs (genes separated by speciation) and paralogs (genes separated by gene duplication), whereas parhomology refers to similarity due to non-homologous processes.","examples":[{"sentence":"The parhomology between these two proteins suggests convergent evolution.","translation":"これらの2つのタンパク質間のパラホモロジーは、収斂進化を示唆している。"},{"sentence":"Distinguishing between homology and parhomology is crucial for accurate phylogenetic analysis.","translation":"相同性とパラホモロジーを区別することは、正確な系統解析にとって重要である。"}],"collocations":["convergent parhomology","distinguish parhomology","phylogenetic parhomology"],"synonyms":["analogy","convergence","homoplasy"],"antonyms":["homology","orthology","paralogy"]}],"etymology":{"value":"「par-」（類似、傍）+「homology」（相同性）から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɑːrhoʊˈmɒlədʒi/","syllables":"par-ho-mol-o-gy"},"inflection":{"noun_plural":"parhomologies"},"usage_notes":{"explanation":"パラホモロジーは、遺伝子またはタンパク質間の類似性を説明する用語であり、その類似性は必ずしも共通の祖先から受け継がれたものではないことを強調する。これは、収斂進化や水平遺伝子伝播など、非相同的なプロセスによって生じる類似性を指す。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Parhomology is the same as homology.","correct":"✓ Parhomology is a type of similarity that is distinct from homology.","note":"相同性（homology）は共通祖先からの進化による類似性を指すが、パラホモロジーは異なる進化経路による類似性を指す。"},{"incorrect":"✗ Parhomology can only occur in proteins.","correct":"✓ Parhomology can occur in both genes and proteins.","note":"パラホモロジーは遺伝子とタンパク質の両方に見られる。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["homology","analogy","convergent evolution","horizontal gene transfer"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Parhomology**」は、遺伝子やタンパク質の類似性を説明する専門用語で、その類似性が必ずしも共通の祖先から受け継がれたものではないことを強調します。これは、収斂進化や水平遺伝子伝播など、非相同的なプロセスによって生じる類似性を指します。この用語は、系統解析や進化研究において、相同性（homology）と区別して使用されます。専門的な生物学の文脈でのみ使用される可能性が高いです。"},"example_sentences":[{"sentence":"The researchers identified parhomology between the bacterial enzyme and a similar enzyme found in plants.","translation":"研究者らは、細菌酵素と植物に見られる同様の酵素との間にパラホモロジーを特定した。","type":"noun","meaning_category":"遺伝子またはタンパク質間の類似性"},{"sentence":"Convergent evolution can lead to parhomology, making it difficult to trace the true evolutionary history of a gene.","translation":"収斂進化はパラホモロジーを引き起こす可能性があり、遺伝子の真の進化史を追跡することを困難にする。","type":"noun","meaning_category":"遺伝子またはタンパク質間の類似性"}]}