{"word":"MLV","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Abbreviation for Multi-Level Vehicle, referring to specialized railcars designed to transport automobiles.","english_definition":"Abbreviation for Multi-Level Vehicle, a specialized type of railroad car designed for transporting automobiles.","examples":[{"sentence":"The train was composed of several MLVs loaded with new cars.","translation":"その列車は、新車を積んだ複数のMLVで構成されていた。"},{"sentence":"MLVs are commonly used to transport vehicles from factories to dealerships.","translation":"MLVは、工場から販売店へ車両を輸送するためによく使用されます。"}],"collocations":["railroad MLV","automobile MLV","MLV train","load MLVs"],"synonyms":["autorack","railcar"],"antonyms":[]},{"part_of_speech":"noun","definition":"Abbreviation for Murine Leukemia Virus, a type of retrovirus that infects mice.","english_definition":"Abbreviation for Murine Leukemia Virus, a retrovirus that infects mice and can be used in research.","examples":[{"sentence":"MLV is often used in gene therapy research as a viral vector.","translation":"MLVは、遺伝子治療研究において、ウイルスベクターとしてよく使用されます。"},{"sentence":"Studies have shown the effects of MLV on the immune system of mice.","translation":"研究により、MLVがマウスの免疫系に及ぼす影響が示されています。"}],"collocations":["MLV infection","MLV vector","MLV research","MLV genome"],"synonyms":["retrovirus"],"antonyms":[]}],"etymology":{"value":"Acronym formed from the initial letters of the words in the full name (Multi-Level Vehicle or Murine Leukemia Virus).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛmˌɛlˈviː/","syllables":"em-el-vee"},"inflection":{"noun_plural":"MLVs"},"usage_notes":{"explanation":"MLV is an acronym with multiple meanings, so context is crucial to understanding the intended meaning. In transportation, it refers to railcars. In biology and medicine, it refers to a virus. When used, it's helpful to provide context to avoid ambiguity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The MLV was carrying passengers.","correct":"✓ The MLV was carrying automobiles.","note":"MLVs (Multi-Level Vehicles) are specifically designed for transporting automobiles, not passengers."},{"incorrect":"✗ MLV caused a common cold in the patient.","correct":"✓ MLV is a retrovirus that infects mice.","note":"MLV (Murine Leukemia Virus) infects mice, not humans, and is not associated with the common cold."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_acronyms":["TLV (Threshold Limit Value)","SUV (Sport Utility Vehicle)"]},"level_frequency":{"CEFR":"N/A (Technical Term)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"MLV is a technical acronym. Understanding it requires familiarity with the specific fields in which it is used, either transportation (railroad industry) or biology/medicine (virology, gene therapy). It's important to define the acronym upon first use to ensure clarity."},"example_sentences":[{"sentence":"The manufacturer ships thousands of cars each month using dedicated MLV trains.","translation":"製造業者は、専用のMLV列車を使用して毎月数千台の車を出荷しています。","type":"noun","meaning_category":"Multi-Level Vehicle"},{"sentence":"Researchers are using MLV vectors to deliver genes into specific cells.","translation":"研究者たちは、MLVベクターを使用して、特定の細胞に遺伝子を導入しています。","type":"noun","meaning_category":"Murine Leukemia Virus"}]}