{"word":"reendows","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"to provide again with an endowment or source of income.","english_definition":"to provide (someone or something) again with an endowment or source of income.","examples":[{"sentence":"The university reendows its research programs annually.","translation":"その大学は毎年研究プログラムに再び寄付を行っています。"},{"sentence":"The foundation reendows the scholarship fund after a successful fundraising campaign.","translation":"財団は、成功した資金調達キャンペーンの後、奨学金基金に再び寄付をします。"}],"collocations":["reendow a program","reendow a fund","reendow an institution"],"synonyms":["refinance","resupply","replenish"],"antonyms":["withdraw","deplete"]}],"etymology":{"value":"The word 'reendows' is formed by adding the prefix 're-' (meaning 'again' or 'anew') to the verb 'endow' (meaning 'to provide with a permanent fund or source of income'). The word 'endow' comes from the Middle English word 'endowen', which in turn comes from the Old French word 'endouer', meaning 'to furnish with a dowry'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːɪnˈdaʊz/","syllables":"ree-en-dows"},"inflection":{"verb_forms":{"present_simple":["reendows"],"past_simple":"reendowed","past_participle":"reendowed","present_participle":"reendowing"}},"usage_notes":{"explanation":"'Reendows' is a verb that means to provide again with an endowment or source of income. It is often used in the context of institutions, programs, or funds that receive renewed financial support. The term implies that the entity had previously been endowed, and is now receiving further financial assistance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The government reendows with money to the company.","correct":"✓ The government reendows the company with money.","note":"The correct structure is 'reendow [entity] with [resources]'. The preposition 'with' should be used to indicate what is being provided."},{"incorrect":"✗ Reendows are important for the project.","correct":"✓ Reendowing is important for the project.","note":"'Reendows' is a verb form. If you need a noun, use 'reendowment', or 'reendowing' as a gerund."}],"priority":"★★☆"},"related_words":{"derivatives":["reendowment (noun): the act of reendowing; a new endowment.","endow (verb): to provide with a permanent fund or source of income.","endowment (noun): a permanent fund or source of income provided to a person or institution."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reendows' is a relatively uncommon verb, primarily used in financial or institutional contexts. It signifies the act of providing a new or renewed endowment to an entity that has previously received such funding. Understanding the term requires familiarity with the concept of endowments and financial support for organizations or programs."},"example_sentences":[{"sentence":"The alumni association decided to reendow the music department to ensure its continued success.","translation":"同窓会は、音楽学科の継続的な成功を確実にするために、音楽学科に再び寄付することを決定しました。","type":"verb","meaning_category":"financial support"},{"sentence":"The charity reendows its local branches annually to support community initiatives.","translation":"慈善団体は、地域社会のイニシアチブを支援するために、毎年地元の支部に再び寄付をしています。","type":"verb","meaning_category":"financial support"}]}