{"word":"preprogram","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"事前にプログラムする、あらかじめプログラムする","english_definition":"to program (something, especially a device) in advance or beforehand.","examples":[{"sentence":"The robot was preprogrammed to perform specific tasks.","translation":"そのロボットは特定のタスクを実行するように事前にプログラムされていた。"},{"sentence":"We need to preprogram the settings before the presentation.","translation":"プレゼンテーションの前に設定を事前にプログラムする必要がある。"},{"sentence":"The factory machines are preprogrammed for efficiency.","translation":"工場の機械は効率のために事前にプログラムされている。"}],"collocations":["preprogram a robot (ロボットを事前にプログラムする)","preprogram settings (設定を事前にプログラムする)","preprogram a device (デバイスを事前にプログラムする)"],"synonyms":["program in advance","preset","configure beforehand"],"antonyms":["reprogram","program on the spot"]}],"etymology":{"value":"\"pre-\" (前に、あらかじめ) + \"program\" (プログラムする)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˈproʊɡræm/","syllables":"pre-pro-gram"},"inflection":{"verb_forms":{"present_simple":["preprogram","preprograms"],"past_simple":"preprogrammed","past_participle":"preprogrammed","present_participle":"preprogramming"}},"usage_notes":{"explanation":"\"**Preprogram**\" means to program something, usually a device or machine, before it is needed or used. This is often done to automate tasks or ensure that the device functions correctly when it is activated. It is commonly used in the context of computers, robots, and other electronic devices.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I preprogrammed the robot yesterday, but it doesn't work today.","correct":"✓ I preprogrammed the robot yesterday, but it still doesn't work today.","note":"The issue is not with \"preprogram\" itself, but with the implication that preprogramming should guarantee functionality. The robot might not work due to other issues. The sentence can be improved by adding \"still\" to indicate that the preprogramming did not solve the problem."},{"incorrect":"✗ We preprogram the data every week.","correct":"✓ We preprogram the device every week.","note":"\"Preprogram\" typically applies to devices or systems, not directly to data. You might preprogram a device to process data, but you don't directly preprogram the data itself."}],"priority":"★★☆"},"related_words":{"derivatives":["preprogrammed (adjective)"],"phrasal_verbs":[],"related_terms":["program","programming","reprogram","unprogram"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"**Preprogram**\" means to set up a device or system with instructions before it's actually used. It's like giving a robot its marching orders in advance so it knows what to do when you turn it on. The word is often used in technical contexts, like robotics or manufacturing, where automation is important. It implies that the programming is done ahead of time, rather than on the spot. It's not a super common word, but it's useful to know if you're dealing with automated systems."},"example_sentences":[{"sentence":"The smart thermostat can be preprogrammed to adjust the temperature automatically.","translation":"スマートサーモスタットは、温度を自動的に調整するように事前にプログラムできます。","type":"verb","meaning_category":"事前にプログラムする"},{"sentence":"The drone was preprogrammed with a flight path for the survey.","translation":"ドローンには、調査のための飛行経路が事前にプログラムされていた。","type":"verb","meaning_category":"事前にプログラムする"},{"sentence":"The washing machine is preprogrammed with several different wash cycles.","translation":"その洗濯機には、いくつかの異なる洗濯サイクルが事前にプログラムされている。","type":"verb","meaning_category":"事前にプログラムする"}]}