{"word":"hemochrome","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘモクロム","english_definition":"A derivative of hemoglobin in which the iron is in the ferrous state and linked directly to nitrogenous bases of globin; it exhibits characteristic absorption spectra.","examples":[{"sentence":"Hemochromes are responsible for the red color of reduced hemoglobin.","translation":"ヘモクロムは還元ヘモグロビンの赤い色の原因である。"},{"sentence":"The formation of hemochrome can be used to detect the presence of certain proteins.","translation":"ヘモクロムの形成は、特定のタンパク質の存在を検出するために使用できる。"}],"collocations":["formation of hemochrome","absorption spectrum of hemochrome"],"synonyms":["reduced hemoglobin","ferrohemochrome"],"antonyms":[]}],"etymology":{"value":"From 'heme' (referring to the iron-containing part of hemoglobin) + '-chrome' (referring to color).","priority":"★★★"},"pronunciation":{"ipa":"/ˈhiːməˌkroʊm/","syllables":"he-mo-chrome"},"inflection":{"noun_plural":"hemochromes"},"usage_notes":{"explanation":"Hemochromes are derivatives of hemoglobin, a protein in red blood cells responsible for carrying oxygen. In hemochromes, the iron atom in the heme group is in the ferrous (Fe2+) state and is directly linked to nitrogenous bases of globin. This structural arrangement gives hemochromes distinct light absorption properties, making them useful in spectroscopic studies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hemochrome is the same as hemoglobin.","correct":"✓ Hemochrome is a derivative of hemoglobin.","note":"Hemochrome is not identical to hemoglobin but is a modified form of it."}],"priority":"★★☆"},"related_words":{"derivatives":["hemochromatosis (鉄過剰症)","hemoglobin (ヘモグロビン)","heme (ヘム)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hemochrome' is a technical term used in biochemistry and hematology. It refers to a specific derivative of hemoglobin where iron is in a reduced state and directly bonded to globin's nitrogenous bases. Understanding this term requires a background in chemistry or biology."},"example_sentences":[{"sentence":"The spectrophotometric analysis revealed the presence of **hemochrome**.","translation":"分光光度分析により、ヘモクロムの存在が明らかになった。","type":"noun","meaning_category":"chemical compound"},{"sentence":"**Hemochrome** formation is a key step in the degradation of hemoglobin.","translation":"ヘモクロムの形成は、ヘモグロビンの分解における重要なステップである。","type":"noun","meaning_category":"biological process"}]}