{"word":"isohedral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(幾何学)等面体の、等面性を持つ","english_definition":"(geometry) Having faces that are all congruent; relating to or being a polyhedron whose faces are all congruent and symmetrically equivalent.","examples":[{"sentence":"An isohedral polyhedron has faces that are all the same.","translation":"等面多面体は、すべての面が同一である。"},{"sentence":"The isohedral tiling is formed by repeating a single isohedral tile.","translation":"等面タイリングは、単一の等面タイルを繰り返すことによって形成される。"}],"collocations":["isohedral polyhedron","isohedral tiling","isohedral shape"],"synonyms":["congruent-faced","equilateral-faced"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'isos' (equal) and 'hedra' (face).","priority":"★★★"},"pronunciation":{"ipa":"/ˌaɪsoʊˈhiːdrəl/","syllables":"i-so-he-dral"},"inflection":{"notes":"Does not inflect (isohedral, more isohedral, most isohedral is not standard)."},"usage_notes":{"explanation":"The term 'isohedral' is primarily used in the context of geometry, specifically when discussing polyhedra (3D shapes with flat faces) and tilings (arrangements of shapes that cover a plane without gaps or overlaps). An isohedral polyhedron has faces that are all congruent (identical in shape and size) and are symmetrically equivalent, meaning that any face can be transformed into any other face by a symmetry operation of the polyhedron. An isohedral tiling uses a single isohedral tile to cover the plane.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The isohedral is a type of triangle.","correct":"✓ An isohedral tile can be a triangle.","note":"'Isohedral' is an adjective, not a noun. It describes a shape, such as a tile or polyhedron. A triangle itself is not isohedral, but it can be used as an isohedral tile in certain tilings."}],"priority":"★☆☆"},"related_words":{"derivatives":["isohedron (noun): An isohedral polyhedron."],"related_terms":["polyhedron","tiling","congruent","symmetry","face"],"priority":"★★☆"},"level_frequency":{"level":"Technical vocabulary, not commonly used outside of geometry.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'isohedral' is a technical term used in geometry. It describes shapes, particularly polyhedra and tiles, that have faces which are all congruent (identical) and symmetrically equivalent. Understanding this term requires a background in geometry and familiarity with concepts like polyhedra, tilings, congruence, and symmetry. It is not a word used in everyday language."},"example_sentences":[{"sentence":"The architect designed an isohedral structure for the museum's facade.","translation":"建築家は美術館のファサードのために等面構造を設計した。","type":"adjective","meaning_category":"geometry"},{"sentence":"The isohedral tiling pattern created a visually appealing design on the floor.","translation":"等面タイリングパターンは、床に視覚的に魅力的なデザインを作り出した。","type":"adjective","meaning_category":"geometry"}]}