{"word":"Urticating","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(主に動物の毛などが)刺すような、ヒリヒリさせる","english_definition":"Capable of stinging or causing a burning sensation; having stinging hairs or bristles.","examples":[{"sentence":"The urticating hairs of the caterpillar caused a rash on my skin.","translation":"その毛虫の刺す毛が私の肌に発疹を引き起こした。"},{"sentence":"Be careful of the urticating spines on that plant.","translation":"その植物の刺すような棘に注意してください。"}],"collocations":["urticating hairs","urticating spines","urticating bristles"],"synonyms":["stinging","prickly","irritating","burning"],"antonyms":["soothing","calming","non-irritating"]}],"etymology":{"value":"Derived from the Latin word 'urtica,' meaning 'nettle,' combined with the suffix '-ating,' indicating a capacity or tendency to cause a stinging or irritating effect similar to that of a nettle plant.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɜːrtɪkeɪtɪŋ/","syllables":"Ur-ti-ca-ting"},"inflection":{"notes":"This is the present participle and gerund form of the verb 'urticate'. It can also function as an adjective."},"usage_notes":{"explanation":"'Urticating' is primarily used to describe the characteristic of certain animals or plants, especially their hairs, bristles, or spines, that cause a stinging or burning sensation upon contact. It is commonly associated with nettles and certain types of caterpillars.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The urticating feeling made me happy.","correct":"✓ The urticating hairs made me itchy.","note":"'Urticating' describes the cause of the sensation, not the sensation itself. It causes itchiness, burning, or stinging, not happiness."},{"incorrect":"✗ The urticating plant was beautiful and soft.","correct":"✓ The plant had urticating hairs, so I avoided touching it.","note":"'Urticating' implies an irritating or stinging quality, so it wouldn't be used to describe something soft or pleasant to touch."}],"priority":"★★☆"},"related_words":{"derivatives":["urticate (verb: to sting or irritate with stinging hairs)","urtication (noun: the act of stinging or the condition of being stung)","urticant (noun/adjective: a substance that causes urtication)","urticaria (noun: hives, a skin rash characterized by itchy welts)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Urticating' is a technical term used to describe something that has the ability to sting or cause a burning sensation, similar to the effect of touching a nettle plant. It is often used in scientific or descriptive contexts when discussing plants or animals with stinging hairs or spines. The term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The caterpillar's urticating bristles can cause a painful rash.","translation":"その毛虫の刺す毛は痛みを伴う発疹を引き起こす可能性がある。","type":"adjective","meaning_category":"stinging"},{"sentence":"Handling the plant without gloves exposed me to its urticating properties.","translation":"手袋なしでその植物を扱うと、その刺すような特性にさらされた。","type":"adjective","meaning_category":"irritating"},{"sentence":"The urticating hairs are a defense mechanism against predators.","translation":"その刺す毛は捕食者に対する防御機構である。","type":"adjective","meaning_category":"stinging"}]}