{"word":"sinkingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"沈むように、沈み込むように、落胆して","english_definition":"in a manner that suggests sinking or drooping, often with a feeling of disappointment or discouragement.","examples":[{"sentence":"She watched sinkingly as her hopes of winning the competition disappeared.","translation":"彼女は、競技で勝つという希望が消えていくのを、落胆しながら見守った。"},{"sentence":"He sat down sinkingly, realizing the enormity of the task ahead.","translation":"彼は、目の前の仕事の大きさに気づき、がっかりと座り込んだ。"}],"collocations":["sinkingly aware","sinkingly disappointed","sinkingly hopeless"],"synonyms":["despondently","dejectedly","dispiritedly","droopingly","heavily"],"antonyms":["hopefully","buoyantly","optimistically","cheerfully"]}],"etymology":{"value":"The word 'sinkingly' is derived from the verb 'sink' and the suffix '-ing' (forming the present participle) and '-ly' (forming the adverb).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪŋkɪŋli/","syllables":"sink-ing-ly"},"inflection":{"notes":"Adverb, no inflections"},"usage_notes":{"explanation":"'Sinkingly' describes an action or state performed in a way that suggests a downward movement or a feeling of sinking, often associated with disappointment, discouragement, or a loss of hope. It implies a gradual decline or a feeling of being overwhelmed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The boat sinkingly sailed into the harbor.","correct":"✓ The boat slowly sailed into the harbor.","note":"'Sinkingly' implies a negative emotion or a downward motion. Use 'slowly' or another adverb if describing the speed of a boat sailing."}],"priority":"★★☆"},"related_words":{"derivatives":["sink (verb, noun)","sinking (adjective, noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'sinkingly' is a relatively uncommon adverb that describes an action performed in a way that suggests a feeling of sinking or drooping, often associated with disappointment or discouragement. It is typically used in descriptive writing to convey a sense of despair or hopelessness. Due to its relatively low frequency, it is more likely to be encountered by advanced learners of English."},"example_sentences":[{"sentence":"The market crashed, and he watched his investments sinkingly decline.","translation":"市場が暴落し、彼は自分の投資が落胆しながら減少していくのを見守った。","type":"adverb","meaning_category":"落胆して"},{"sentence":"She realized sinkingly that she had made a terrible mistake.","translation":"彼女は自分がひどい間違いを犯したことに、がっかりしながら気づいた。","type":"adverb","meaning_category":"落胆して"}]}