{"word":"gonadal-inhibiting","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"性腺抑制性の","english_definition":"Having the property of inhibiting or suppressing the activity or function of the gonads (testes in males, ovaries in females).","examples":[{"sentence":"The drug has a gonadal-inhibiting effect, reducing testosterone production.","translation":"その薬は性腺抑制効果があり、テストステロンの産生を減少させる。"},{"sentence":"Gonadal-inhibiting therapies are sometimes used in the treatment of hormone-sensitive cancers.","translation":"性腺抑制療法は、ホルモン感受性癌の治療に用いられることがある。"}],"collocations":["gonadal-inhibiting drug","gonadal-inhibiting therapy","gonadal-inhibiting effect"],"synonyms":["gonad-suppressing","anti-gonadal","gonadostatic"],"antonyms":["gonadal-stimulating","gonadotropic"]},{"part_of_speech":"adjective","definition":"性腺機能を阻害する","english_definition":"Acting to prevent or reduce the normal function of the gonads.","examples":[{"sentence":"Certain environmental toxins can have gonadal-inhibiting effects on wildlife.","translation":"特定の環境毒素は、野生生物の性腺機能を阻害する可能性がある。"}],"collocations":["environmental gonadal-inhibiting factors"],"synonyms":["gonad-disrupting"],"antonyms":[]}],"etymology":{"value":"Formed from \"gonadal\" (relating to the gonads) and \"inhibiting\" (reducing or preventing the action of).","priority":"N/A"},"pronunciation":{"ipa":"/ɡəˈnædəl ɪnˈhɪbɪtɪŋ/","syllables":"go-nad-al in-hib-it-ing"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term \"gonadal-inhibiting\" refers to something that reduces or prevents the function of the gonads, which are the reproductive organs (testes in males, ovaries in females). It is often used in the context of drugs, therapies, or environmental factors that can affect hormone production and reproductive function.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["gonad (性腺)","inhibit (抑制する)","inhibition (抑制)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily found in scientific or medical contexts.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term \"gonadal-inhibiting\" is a specialized term used in medical and scientific contexts. It describes substances or processes that reduce or prevent the function of the gonads (testes or ovaries). Understanding this term requires familiarity with basic biology and medical terminology. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The researchers investigated the gonadal-inhibiting properties of the compound.","translation":"研究者らは、その化合物の性腺抑制特性を調査した。","type":"adjective","meaning_category":"性腺抑制性の"},{"sentence":"Exposure to the chemical resulted in gonadal-inhibiting effects in the fish population.","translation":"その化学物質への暴露は、魚の個体群において性腺機能を阻害する影響をもたらした。","type":"adjective","meaning_category":"性腺機能を阻害する"}]}