{"word":"epithermal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(地質学)浅熱水の、浅熱水性の","english_definition":"(geology) relating to or formed by hydrothermal fluids at relatively shallow depths and moderate temperatures.","examples":[{"sentence":"Epithermal gold deposits are often associated with volcanic activity.","translation":"浅熱水性の金鉱床は、火山活動と関連していることが多い。"},{"sentence":"The epithermal environment is characterized by low salinity and near-surface conditions.","translation":"浅熱水環境は、低塩分濃度と地表に近い状態を特徴とする。"}],"collocations":["epithermal deposit","epithermal system","epithermal gold","epithermal alteration"],"synonyms":["hydrothermal","shallow hydrothermal"],"antonyms":["hypothermal","plutonic"]},{"part_of_speech":"noun","definition":"(地質学)浅熱水鉱床","english_definition":"(geology) a mineral deposit formed by hydrothermal fluids at relatively shallow depths and moderate temperatures.","examples":[{"sentence":"The mine exploits an epithermal deposit rich in silver and gold.","translation":"その鉱山は、銀と金が豊富な浅熱水鉱床を開発している。"}],"collocations":["high-sulfidation epithermal","low-sulfidation epithermal"],"synonyms":["hydrothermal deposit"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'epi' (upon, near) and 'therme' (heat), referring to the relatively shallow depths and moderate temperatures at which these deposits form.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛpɪˈθɜːrməl/","syllables":"ep-i-ther-mal"},"inflection":{"notes":"The word 'epithermal' does not have different inflections."},"usage_notes":{"explanation":"The term 'epithermal' is primarily used in geology and mining to describe a specific type of hydrothermal mineral deposit. These deposits form relatively close to the Earth's surface, at shallow depths, and at moderate temperatures, typically associated with volcanic activity. The term is often used to classify ore deposits, particularly those containing gold, silver, and other valuable metals.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The epithermal energy is used to generate electricity.","correct":"✓ Geothermal energy is used to generate electricity.","note":"'Epithermal' refers to a geological process, not a source of energy. 'Geothermal' is the correct term for heat from the Earth used for energy. "},{"incorrect":"✗ The epithermal zone is very deep.","correct":"✓ The epithermal zone is relatively shallow.","note":"By definition, 'epithermal' refers to shallow depths. Using 'deep' contradicts the meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["epithermally"],"phrases":["high-sulfidation epithermal","low-sulfidation epithermal"],"related_terms":["hydrothermal","geothermal","volcanogenic","magmatic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'epithermal' is a technical term used in geology and mining. It describes mineral deposits formed by hydrothermal fluids at shallow depths and moderate temperatures, often associated with volcanic activity. Understanding this term requires a background in earth sciences. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The exploration company is searching for new epithermal gold deposits in the region.","translation":"その探査会社は、その地域で新たな浅熱水性の金鉱床を探している。","type":"adjective","meaning_category":"浅熱水の"},{"sentence":"The ore samples showed characteristics typical of an epithermal system.","translation":"鉱石サンプルは、浅熱水系に典型的な特徴を示した。","type":"adjective","meaning_category":"浅熱水の"},{"sentence":"The epithermal deposit contained significant amounts of silver.","translation":"その浅熱水鉱床には、かなりの量の銀が含まれていた。","type":"noun","meaning_category":"浅熱水鉱床"}]}