{"word":"outshoved","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人を)押し退けて出し抜く、(競争相手を)力で打ち負かす","english_definition":"To surpass or overcome someone by pushing them aside or using force; to defeat a competitor through physical strength or aggressive tactics.","examples":[{"sentence":"He outshoved the other players to get the rebound.","translation":"彼はリバウンドを取るために他の選手たちを押し退けた。"},{"sentence":"The company outshoved its rivals in the market by aggressive marketing.","translation":"その会社は積極的なマーケティングによって市場で競合他社を出し抜いた。"}],"collocations":["outshove competitors (競争相手を押し退ける)","outshove opponents (対戦相手を押し退ける)"],"synonyms":["overpower","overcome","surpass","defeat","oust"],"antonyms":["yield","succumb","cede"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(比喩的に)力ずくで追い出す、排除する","english_definition":"To figuratively push out or exclude someone or something, often through aggressive or forceful means.","examples":[{"sentence":"New ideas were outshoved by the old, established ways of thinking.","translation":"新しいアイデアは、古く確立された考え方によって力ずくで追い出された。"},{"sentence":"Smaller businesses were outshoved by larger corporations.","translation":"中小企業は大企業によって排除された。"}],"collocations":["outshove ideas (アイデアを押し退ける)","outshove businesses (企業を押し退ける)"],"synonyms":["suppress","displace","marginalize","exclude"],"antonyms":["promote","support","include"]}],"etymology":{"value":"Derived from the verb 'shove,' with the addition of the prefix 'out-,' indicating surpassing or exceeding in the action of shoving.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊtˈʃʌvd/","syllables":"out-shoved"},"inflection":{"verb_forms":{"present_simple":["outshove","outshoves"],"past_simple":"outshoved","past_participle":"outshoved","present_participle":"outshoving"}},"usage_notes":{"explanation":"'Outshoved' implies a forceful or aggressive action where one entity pushes past or overcomes another. It can be used literally, referring to physical pushing, or figuratively, referring to the suppression or displacement of ideas, businesses, etc. The term suggests a competitive scenario where force or aggressive tactics are employed to gain an advantage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He outshoved to the front of the line.","correct":"✓ He outshoved his way to the front of the line.","note":"When describing movement or progress, it's often necessary to include 'his way' or a similar phrase to indicate how the action was accomplished."},{"incorrect":"✗ The project was outshoved because of budget cuts.","correct":"✓ The project was shelved because of budget cuts.","note":"'Outshoved' implies a more aggressive displacement. 'Shelved' is more appropriate when a project is simply postponed or canceled."}],"priority":"★★☆"},"related_words":{"derivatives":["shove (verb, noun)","outshoving (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Outshoved' is a relatively uncommon verb that describes the act of surpassing or overcoming someone or something by pushing them aside, either literally or figuratively. It implies a forceful or aggressive action. Due to its infrequent use, it is more likely to be encountered in advanced texts or specialized contexts where precise language is required to convey the idea of forceful displacement or suppression."},"example_sentences":[{"sentence":"The veteran player outshoved the rookie to secure his position on the team.","translation":"ベテラン選手はチームでの地位を確保するためにルーキーを押し退けた。","type":"verb","meaning_category":"押し退けて出し抜く"},{"sentence":"Her innovative ideas were often outshoved by the more conservative members of the committee.","translation":"彼女の革新的なアイデアは、委員会のより保守的なメンバーによってしばしば押し退けられた。","type":"verb","meaning_category":"力ずくで追い出す"}]}