{"word":"nontrespass","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)不法侵入をしないこと、または不法侵入に対する保護","english_definition":"The act of not trespassing; protection against trespass.","examples":[{"sentence":"The sign clearly indicated a policy of nontrespass.","translation":"その標識は明らかに不法侵入禁止の方針を示していた。"},{"sentence":"The property owner asserted his right to nontrespass.","translation":"その地主は不法侵入されない権利を主張した。"}],"collocations":["right of nontrespass","policy of nontrespass"],"synonyms":["lawful entry","permission","authorization"],"antonyms":["trespass","intrusion","invasion"]},{"part_of_speech":"adjective","definition":"不法侵入しない、または不法侵入を禁止する","english_definition":"Relating to the absence of trespass; prohibiting trespass.","examples":[{"sentence":"The nontrespass agreement protected the land from unauthorized access.","translation":"不法侵入禁止の合意は、その土地を許可されていないアクセスから保護した。"},{"sentence":"A nontrespass zone was established around the construction site.","translation":"工事現場の周囲に不法侵入禁止区域が設けられた。"}],"collocations":["nontrespass agreement","nontrespass zone","nontrespass area"],"synonyms":["restricted","private","off-limits"],"antonyms":["open","public","accessible"]}],"etymology":{"value":"\"non-\" (否定) + \"trespass\" (不法侵入)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈtrespæs/","syllables":"non-tres-pass"},"inflection":{"noun_plural":"nontrespasses"},"usage_notes":{"explanation":"\"Nontrespass\" is a relatively uncommon word, primarily used in legal or formal contexts. It refers to the state of not committing trespass or the protection against it. It can be used as both a noun and an adjective. As a noun, it denotes the act of not trespassing or the right to prevent trespass. As an adjective, it describes something that prohibits or relates to the absence of trespass.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a nontrespass on his property.","correct":"✓ He has a right to nontrespass on his property.","note":"\"Nontrespass\" is a state or condition, not something one possesses directly. It's more accurate to say someone has a \"right to nontrespass.\""},{"incorrect":"✗ The sign said 'nontrespass allowed'.","correct":"✓ The sign said 'no trespassing allowed'.","note":"The intended meaning is likely to prohibit trespass, so \"no trespassing\" is the correct phrase. \"Nontrespass allowed\" is contradictory."}],"priority":"★★☆"},"related_words":{"derivatives":["trespass","trespassing"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Not commonly found in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Nontrespass\" is a formal term primarily used in legal or official contexts. It signifies the condition of refraining from unlawful entry onto someone else's property or the legal protection against such entry. Due to its specialized usage, it is not commonly encountered in everyday language. Understanding this term requires familiarity with legal concepts related to property rights and restrictions. It's often found in legal documents, property deeds, or formal notices concerning land use and access rights."},"example_sentences":[{"sentence":"The landowner sought legal assurance of nontrespass on his property.","translation":"その地主は、自分の土地に対する不法侵入がないことの法的保証を求めた。","type":"noun","meaning_category":"不法侵入をしないことに対する保護"},{"sentence":"The nontrespass clause in the contract protected the homeowner from unwanted intrusions.","translation":"契約書の不法侵入禁止条項は、住宅所有者を望まない侵入から保護した。","type":"adjective","meaning_category":"不法侵入を禁止する"}]}