{"word":"dichroous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"二色性の、二色を示す","english_definition":"Exhibiting dichroism; having two different colors when viewed in two different directions, or exhibiting two different colors depending on the thickness of the material viewed.","examples":[{"sentence":"Some minerals are dichroous, displaying different colors when viewed under polarized light.","translation":"偏光下で見ると、異なる色を示す二色性の鉱物もある。"},{"sentence":"The dichroous glass appeared green when thin and red when thick.","translation":"その二色性ガラスは、薄いときは緑色に見え、厚いときは赤色に見えた。"}],"collocations":["dichroous mineral","dichroous glass","exhibit dichroism"],"synonyms":["dichromatic","bicolored","two-colored"],"antonyms":["monochromatic","single-colored"]},{"part_of_speech":"adjective","definition":"(植物学において)二色性のある、花弁の色が異なる","english_definition":"(Botany) Having petals of two different colors.","examples":[{"sentence":"The dichroous flowers were a striking combination of purple and yellow.","translation":"その二色性の花は、紫と黄色の見事な組み合わせだった。"}],"collocations":["dichroous flower","dichroous petals"],"synonyms":["bicolored","two-toned"],"antonyms":["uniform-colored"]}],"etymology":{"value":"From the Greek words 'di-' (two) and 'chroos' (color).","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈkroʊəs/","syllables":"di-chro-ous"},"inflection":{"notes":"Comparative and superlative forms are possible, though rare: more dichroous, most dichroous."},"usage_notes":{"explanation":"'Dichroous' is primarily used in scientific contexts, especially in mineralogy and optics, to describe materials that exhibit different colors depending on the viewing angle or thickness. In botany, it describes flowers with petals of two different colors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fabric was dichromatic, showing many colors.","correct":"✓ The fabric was dichromatic, showing two colors.","note":"'Dichromatic' and 'dichroous' specifically refer to two colors, not multiple colors."}],"priority":"★★☆"},"related_words":{"derivatives":["dichroism (noun): The property of exhibiting dichroous colors.","dichromatism (noun): A condition of having dichroic vision or the state of being dichromatic."],"related_terms":["pleochroism (noun): The property of exhibiting different colors when viewed from different crystallographic directions. This is a more general term than dichroism, which is a specific case of pleochroism."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - primarily a scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'dichroous' is a specialized scientific term used to describe materials or objects that display two different colors under specific conditions, such as different viewing angles or thicknesses. It is most commonly encountered in fields like mineralogy, optics, and botany. Due to its technical nature, it is not part of everyday vocabulary."},"example_sentences":[{"sentence":"The gem's dichroous nature was evident when rotated under the light.","translation":"その宝石の二色性は、光の下で回転させると明らかだった。","type":"adjective","meaning_category":"二色性を示す"},{"sentence":"This species of iris has dichroous petals, with a vibrant blue and yellow pattern.","translation":"このアヤメの種は二色性の花弁を持ち、鮮やかな青と黄色の模様をしている。","type":"adjective","meaning_category":"花弁の色が異なる"}]}