{"word":"meningococcemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"髄膜炎菌血症","english_definition":"The presence of meningococci bacteria in the blood, leading to a serious and potentially life-threatening infection.","examples":[{"sentence":"Meningococcemia can cause rapid deterioration and requires immediate medical attention.","translation":"髄膜炎菌血症は急速に悪化する可能性があり、直ちに医療措置が必要です。"},{"sentence":"Symptoms of meningococcemia include fever, rash, and fatigue.","translation":"髄膜炎菌血症の症状には、発熱、発疹、倦怠感などがあります。"}],"collocations":["acute meningococcemia","chronic meningococcemia","fulminant meningococcemia"],"synonyms":["meningococcal sepsis","meningococcal bloodstream infection"],"antonyms":[]}],"etymology":{"value":"From 'meningococcus' (the bacterium causing the infection) + '-emia' (presence in the blood).","priority":"★★★"},"pronunciation":{"ipa":"/məˌnɪŋɡoʊˌkɑkˈsiːmiə/","syllables":"me-nin-go-coc-ce-mi-a"},"inflection":{"noun_plural":"meningococcemias"},"usage_notes":{"explanation":"Meningococcemia is a severe bloodstream infection caused by Neisseria meningitidis bacteria. It is often associated with meningococcal meningitis but can occur independently. Rapid diagnosis and treatment with antibiotics are crucial to prevent serious complications and death. The characteristic petechial or purpuric rash is a key diagnostic sign.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Meningococcemia is a type of meningitis.","correct":"✓ Meningococcemia is a bloodstream infection that can occur with or without meningitis.","note":"Meningococcemia is a blood infection, while meningitis is an inflammation of the membranes surrounding the brain and spinal cord. They can occur together, but are distinct conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["meningococcal (adjective: relating to meningococcus bacteria)","meningitis (noun: inflammation of the meninges)","sepsis (noun: blood poisoning)"],"medical_terms":["petechiae (noun: small, pinpoint-sized red or purple spots on the skin)","purpura (noun: larger areas of red or purple discoloration on the skin)","septic shock (noun: a life-threatening condition caused by a severe infection)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - a specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Meningococcemia' is a complex medical term referring to the presence of meningococcal bacteria in the bloodstream. This condition can lead to severe complications, including septic shock and death, and requires immediate medical intervention. The term is primarily used within medical contexts and is not commonly encountered in everyday language. It's important to distinguish it from 'meningitis,' although both can be caused by the same bacteria."},"example_sentences":[{"sentence":"Early diagnosis of meningococcemia is critical for effective treatment.","translation":"髄膜炎菌血症の早期診断は、効果的な治療のために非常に重要です。","type":"medical","meaning_category":"disease"},{"sentence":"The patient presented with a fever and a characteristic petechial rash, indicative of possible meningococcemia.","translation":"患者は発熱と特徴的な点状出血疹を呈し、髄膜炎菌血症の可能性を示唆していました。","type":"medical","meaning_category":"symptoms"}]}