{"word":"aneurine","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"チアミン、ビタミンB1","english_definition":"A vitamin of the B complex, found in many foods including yeast, cereal grains, beans, nuts, and meat, and essential for metabolic processes; thiamine or vitamin B1.","examples":[{"sentence":"Aneurine deficiency can lead to beriberi.","translation":"アノイリン欠乏症は脚気を引き起こす可能性があります。"},{"sentence":"The body needs aneurine to convert carbohydrates into energy.","translation":"体は炭水化物をエネルギーに変換するためにアノイリンを必要とします。"}],"collocations":["aneurine deficiency","aneurine hydrochloride","dietary aneurine"],"synonyms":["thiamine","vitamin B1"],"antonyms":[]}],"etymology":{"value":"Derived from 'anti-' + 'neur(itis)' + '-ine'. 'Anti-' refers to its ability to prevent; 'neuritis' is inflammation of the nerves, which thiamine deficiency can cause; and '-ine' is a suffix used in chemical nomenclature.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænjʊˈraɪn/","syllables":"an-eu-rine"},"inflection":{"notes":"Plural: aneurines"},"usage_notes":{"explanation":"Aneurine is a less common term for thiamine or vitamin B1, primarily used in scientific or medical contexts. It refers to the same essential nutrient.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Aneurine is a mineral.","correct":"✓ Aneurine is a vitamin.","note":"Aneurine is a vitamin, specifically vitamin B1, not a mineral."},{"incorrect":"✗ Aneurine is produced by the body.","correct":"✓ Aneurine must be obtained from dietary sources.","note":"The human body cannot produce aneurine; it must be obtained through diet or supplements."}],"priority":"★★☆"},"related_words":{"derivatives":["thiamine pyrophosphate","thiamine mononitrate","benfotiamine"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Aneurine' is a technical term for thiamine or vitamin B1, primarily used in scientific or medical contexts. It's important to understand that it refers to the same nutrient, but the term 'thiamine' is more commonly used in general contexts. Knowledge of this term is useful for understanding scientific literature related to nutrition and metabolism."},"example_sentences":[{"sentence":"The doctor recommended a diet rich in aneurine to combat the patient's nerve inflammation.","translation":"医師は、患者の神経炎症と闘うために、アノイリンを豊富に含む食事を推奨しました。","type":"noun","meaning_category":"Vitamin B1"},{"sentence":"Aneurine is crucial for the proper functioning of the nervous system.","translation":"アノイリンは、神経系の適切な機能に不可欠です。","type":"noun","meaning_category":"Vitamin B1"}]}