{"word":"xenodiagnosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"異種診断：培養が困難な病原体の検出のために、無菌的に飼育したベクター（媒介動物、通常は吸血昆虫）を患者に接触させ、その後、ベクター内で病原体の有無を調べる診断法。","english_definition":"A diagnostic method used to detect the presence of a pathogen (disease-causing organism) by exposing a vector (typically a blood-sucking insect) to a patient and then examining the vector for the presence of the pathogen. This method is used when the pathogen is difficult to culture in a laboratory.","examples":[{"sentence":"Xenodiagnosis is used to detect Trypanosoma cruzi, the parasite that causes Chagas disease.","translation":"異種診断は、シャーガス病を引き起こす寄生虫であるトリパノソーマ・クルージの検出に使用されます。"},{"sentence":"The sensitivity of xenodiagnosis can vary depending on the stage of the infection.","translation":"異種診断の感度は、感染の段階によって異なる場合があります。"}],"collocations":["perform xenodiagnosis","positive xenodiagnosis","negative xenodiagnosis"],"synonyms":["biological diagnosis"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の xenos (異種の、外国の) + diagnosis (診断) に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌziːnoʊdaɪəɡˈnoʊsɪs/","syllables":"ze-no-di-ag-no-sis"},"inflection":{"noun_plural":"xenodiagnoses"},"usage_notes":{"explanation":"Xenodiagnosis is primarily used in cases where direct detection methods (e.g., microscopy, PCR) or culture techniques are not sufficiently sensitive or practical. It relies on the vector's ability to acquire and amplify the pathogen, making it easier to detect. Ethical considerations and the risk of transmitting other pathogens must be carefully addressed when using this method.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Xenodiagnosis is a treatment for Chagas disease.","correct":"✓ Xenodiagnosis is a diagnostic method for Chagas disease.","note":"Xenodiagnosis is a diagnostic tool, not a treatment. It helps to identify the presence of the disease-causing organism."}],"priority":"★★☆"},"related_words":{"derivatives":["xenodiagnostic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Xenodiagnosis is a specialized diagnostic technique used in parasitology, particularly when direct detection of a pathogen is challenging. It involves using a disease vector (like an insect) to acquire the pathogen from a patient, then examining the vector for the presence of the pathogen. This method is complex and requires careful handling to avoid contamination or transmission of other diseases. It is primarily encountered in scientific or medical contexts related to parasitic infections. Understanding requires knowledge of parasitology and diagnostic procedures."},"example_sentences":[{"sentence":"In some cases of chronic Chagas disease, xenodiagnosis may be the only way to confirm the presence of the parasite.","translation":"慢性シャーガス病の一部の症例では、異種診断が寄生虫の存在を確認する唯一の方法である場合があります。","type":"noun","meaning_category":"診断法"},{"sentence":"The researchers used xenodiagnosis to assess the effectiveness of a new drug against Trypanosoma cruzi.","translation":"研究者たちは、トリパノソーマ・クルージに対する新薬の有効性を評価するために異種診断を使用しました。","type":"noun","meaning_category":"診断法"}]}