{"word":"dhootie","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(インド亜大陸の男性が着用する)腰布、ドゥーティー","english_definition":"A traditional unstitched garment worn by men, primarily in the Indian subcontinent, typically wrapped around the waist and legs.","examples":[{"sentence":"He wore a simple dhootie and kurta.","translation":"彼はシンプルなドゥーティーとクルタを身に着けていた。"},{"sentence":"The politician was seen in his trademark dhootie.","translation":"その政治家はトレードマークのドゥーティー姿で見られた。"}],"collocations":["wear a dhootie","cotton dhootie","traditional dhootie"],"synonyms":["dhoti","veshti","mundu"],"antonyms":[]}],"etymology":{"value":"Derived from the Sanskrit word 'dhauti' (धौती) meaning 'to cleanse' or 'to wash', referring to the garment's traditional association with purity and ritual washing.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈduːti/","syllables":"dhoo-tie"},"inflection":{"noun_plural":"dhooties"},"usage_notes":{"explanation":"A dhootie (also spelled dhoti) is a traditional garment, primarily worn by men in India, Bangladesh, and other parts of the Indian subcontinent. It is an unstitched piece of cloth, usually cotton, wrapped around the waist and legs. It is a symbol of traditional Indian culture and is often worn in religious ceremonies and cultural events.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a dhootie like a skirt.","correct":"✓ He wore a dhootie.","note":"A dhootie is not exactly a skirt, though it may appear similar to the uninitiated. It is a specific type of garment with its own wrapping style."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["kurta","lungi","sari","sherwani"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dhootie' refers to a specific cultural garment. Understanding requires knowledge of South Asian culture. The term is not commonly used outside of contexts related to Indian or Bangladeshi clothing and traditions."},"example_sentences":[{"sentence":"The groom was resplendent in a silk dhootie for the wedding ceremony.","translation":"花婿は結婚式のために絹のドゥーティーを身に着けて輝いていた。","type":"noun","meaning_category":"traditional garment"},{"sentence":"Many rural men still prefer the comfort and simplicity of a dhootie.","translation":"多くの農村部の男性は今でもドゥーティーの快適さとシンプルさを好む。","type":"noun","meaning_category":"traditional garment"}]}