{"word":"chambul","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A type of traditional Indian trousers, typically loose-fitting and worn by men.","english_definition":"(rare) A type of traditional Indian trousers, typically loose-fitting and worn by men.","examples":[{"sentence":"He wore a simple kurta and chambul.","translation":"彼はシンプルなクルタとチャンブルを身に着けていた。"}],"collocations":[],"synonyms":["pyjama","salwar","dhoti"],"antonyms":[]}],"etymology":{"value":"Likely derived from a regional Indian language. The exact origin is uncertain due to its limited usage.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈtʃæmbʊl/","syllables":"cham-bul"},"inflection":{"noun_plural":"chambuls"},"usage_notes":{"explanation":"The word 'chambul' is rarely used in modern English. It refers to a specific type of traditional Indian trousers. If you are not discussing historical or cultural contexts related to India, it's best to use more common terms like 'pyjamas' or 'loose trousers'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a chambul to the office.","correct":"✓ He wore pyjamas/loose trousers to the office.","note":"Unless the office has a specific cultural dress code, 'pyjamas' or 'loose trousers' would be more appropriate and commonly understood."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["kurta","dhoti","sherwani","salwar kameez"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (extremely rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'chambul' is a highly specialized term referring to a specific type of traditional Indian clothing. It is unlikely to be encountered in general English contexts and is primarily relevant in discussions of Indian culture, history, or fashion. Understanding this word requires a high level of cultural literacy and vocabulary. It is not part of common English usage.","note":"This word is extremely rare and not recommended for general use."},"example_sentences":[{"sentence":"The villagers traditionally wear chambuls for comfort in the hot climate.","translation":"村人たちは伝統的に、暑い気候の中で快適に過ごすためにチャンブルを着用する。","type":"noun","meaning_category":"clothing"},{"sentence":"The historical texts mention the use of chambuls by the royal court.","translation":"歴史的な文献には、王室がチャンブルを使用していたことが記されている。","type":"noun","meaning_category":"clothing"}]}