{"word":"Free-Soil","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"自由土地主義の","english_definition":"Opposing the expansion of slavery into U.S. territories.","examples":[{"sentence":"The Free-Soil movement gained support in the North.","translation":"自由土地主義運動は北部で支持を得た。"},{"sentence":"He was a Free-Soil advocate.","translation":"彼は自由土地主義の支持者だった。"}],"collocations":["Free-Soil Party","Free-Soil principles","Free-Soil ideology"],"synonyms":["anti-slavery","abolitionist","non-extensionist"],"antonyms":["pro-slavery"]}],"etymology":{"value":"A compound word formed from 'free' and 'soil', reflecting the ideology of preventing slavery in new territories, thus keeping the soil 'free' for free labor.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfriːˌsɔɪl/","syllables":"free-soil"},"inflection":{"notes":"This word is generally used as an adjective. It can also function as a noun when referring to a member or supporter of the Free-Soil movement or party."},"usage_notes":{"explanation":"The term 'Free-Soil' is primarily historical, referring to a political movement and ideology in the United States during the mid-19th century. It was not necessarily about abolishing slavery where it already existed but rather about preventing its expansion into new territories. This was partly motivated by economic concerns of free laborers who did not want to compete with slave labor.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a free soil farmer.","correct":"✓ He is a farmer who supports free soil principles.","note":"'Free-soil' is not used to describe soil that is literally free. It describes the political ideology. To describe a farmer, you would say 'a farmer who supports free soil principles'."}],"priority":"★★☆"},"related_words":{"derivatives":["Free-Soiler (noun): A supporter of the Free-Soil movement or party."],"related_historical_terms":["Abolitionism","Popular Sovereignty","Compromise of 1850","Kansas-Nebraska Act"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Historical term, not commonly used in modern English)","frequency_google_ngram":"Low frequency in modern usage, higher frequency in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Free-Soil' is a historical term referring to the political ideology and movement in the United States before the Civil War that opposed the expansion of slavery into new territories. Understanding this term requires knowledge of 19th-century American history and political debates surrounding slavery. It is not commonly used in contemporary English outside of historical contexts."},"example_sentences":[{"sentence":"The **Free-Soil** Party was formed in 1848 to oppose the expansion of slavery.","translation":"自由土地党は1848年に奴隷制度の拡大に反対するために結成された。","type":"adjective","meaning_category":"自由土地主義の"},{"sentence":"Many Northerners supported **Free-Soil** principles to protect free labor.","translation":"多くの北部の人々は自由な労働を保護するために自由土地主義の原則を支持した。","type":"adjective","meaning_category":"自由土地主義の"},{"sentence":"The **Free-Soil** movement contributed to the growing tensions between the North and South.","translation":"自由土地主義運動は北部と南部の間の高まる緊張に貢献した。","type":"adjective","meaning_category":"自由土地主義の"}]}