{"word":"urds","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にファンタジーまたは神話) ウルドの複数形。","english_definition":"(primarily in fantasy or mythology) plural of Urd.","examples":[{"sentence":"In Norse mythology, the Norns, including Urðr (anglicized as Urd), Verðandi, and Skuld, determine destiny. Thus, 'urds' might refer to multiple instances or representations of Urðr.","translation":"北欧神話では、ノルンたちは、ウルド（英語化するとUrd）、ヴェルダンディ、スクルドを含み、運命を決定します。したがって、「urds」は、ウルドの複数の実例または表現を指す可能性があります。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Directly derived as the plural form of the Norse mythological figure 'Urðr' (anglicized as Urd).","priority":"★★☆"},"pronunciation":{"ipa":"/ɜːrdz/","syllables":"urds"},"inflection":{"noun_plural":"urds"},"usage_notes":{"explanation":"The term 'urds' is very rare outside the context of Norse mythology or fantasy works inspired by it. It typically refers to multiple aspects, representations, or instances related to the Norn named Urðr, who embodies fate or destiny associated with the past. Because 'Urðr' is often anglicized to 'Urd', 'urds' is not a common or widely recognized word.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw many Urd at the convention.","correct":"✓ I saw many depictions of Urðr at the convention.","note":"'Urds' is not a common pluralization, so rephrasing is better."}],"priority":"★★☆"},"related_words":{"derivatives":["Urd (単数形)","Urðr (古ノルド語)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (非常にまれ)","frequency_google_ngram":"非常に低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'urds' is highly specialized and uncommon, primarily found in discussions of Norse mythology or derivative fantasy literature. Understanding it requires familiarity with Norse mythology and the role of the Norns, particularly Urðr, who represents fate connected to the past. Due to its rarity and specific context, it is not part of general vocabulary."},"example_sentences":[{"sentence":"The author described the 'urds' as ancient entities weaving the tapestry of time.","translation":"著者は「urds」を、時のタペストリーを織る古代の存在として描写しました。","type":"noun","meaning_category":"複数形のウルド"}]}