{"word":"unbeneficed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(聖職者が)聖職禄を持たない、給与のない","english_definition":"(of a member of the clergy) not holding a benefice (a church office to which revenue is attached).","examples":[{"sentence":"He was an unbeneficed curate, relying on stipends and donations.","translation":"彼は聖職禄を持たない補佐司祭で、俸給と寄付金に頼っていた。"},{"sentence":"Many unbeneficed clergy struggled to make a living.","translation":"多くの聖職禄を持たない聖職者は生計を立てるのに苦労した。"}],"collocations":["unbeneficed clergy","unbeneficed minister","unbeneficed priest"],"synonyms":["nonbeneficed","stipendiary","unsalaried"],"antonyms":["beneficed","endowed"]},{"part_of_speech":"adjective","definition":"(一般的に)給与や報酬を受け取らない","english_definition":"Not receiving a salary or stipend; unpaid.","examples":[{"sentence":"The unbeneficed volunteers dedicated their time to the charity.","translation":"給与を受け取らないボランティアたちは、慈善団体に時間を捧げた。"}],"collocations":["unbeneficed volunteer","unbeneficed worker"],"synonyms":["unpaid","voluntary","unsalaried"],"antonyms":["paid","salaried"]}],"etymology":{"value":"\"Un-\" (not) + \"beneficed\" (holding a benefice). \"Benefice\" comes from the Old French word meaning \"benefit\" or \"favour\", ultimately from the Latin \"beneficium\" (a kindness, favour, benefit).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈbenɪfɪst/","syllables":"un-ben-i-ficed"},"inflection":{"notes":"Adjective; no inflections."},"usage_notes":{"explanation":"The term \"unbeneficed\" primarily applies to clergy who do not hold a benefice, meaning they do not have a permanent church position that provides income. It can also be used more broadly to describe someone who is not receiving a regular salary or stipend for their work, especially in voluntary or charitable contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unbenefited.","correct":"✓ He was unbeneficed.","note":"The correct term is \"unbeneficed,\" not \"unbenefited.\" \"Unbenefited\" means not having received a benefit, which is different from not holding a benefice."}],"priority":"★★☆"},"related_words":{"derivatives":["benefice","beneficed"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'unbeneficed' is a specialized term primarily used in religious contexts, specifically within the Anglican or Catholic Church. It describes a member of the clergy who does not hold a 'benefice,' which is a permanent church appointment that provides a stipend or income. Therefore, understanding this word requires familiarity with ecclesiastical terminology and hierarchical structures within religious organizations. It is not commonly used in general conversation or writing."},"example_sentences":[{"sentence":"As an unbeneficed priest, he relied on the generosity of the parishioners.","translation":"聖職禄を持たない司祭として、彼は教区民の寛大さに頼っていた。","type":"adjective","meaning_category":"聖職禄を持たない"},{"sentence":"The unbeneficed volunteers provided essential support to the organization.","translation":"給与を受け取らないボランティアたちは、組織に不可欠な支援を提供した。","type":"adjective","meaning_category":"給与や報酬を受け取らない"}]}