{"word":"unpeevishness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不機嫌でないこと、気難しさがないこと","english_definition":"The state or quality of not being peevish; the absence of irritability or ill-temper.","examples":[{"sentence":"Her unpeevishness, even in the face of constant challenges, was remarkable.","translation":"絶え間ない困難に直面しても、彼女が不機嫌にならないことは驚くべきことだった。"}],"collocations":["display unpeevishness (不機嫌さを見せない)","maintain unpeevishness (不機嫌でない状態を保つ)"],"synonyms":["good temper","patience","forbearance","tolerance","equanimity","composure"],"antonyms":["peevishness","irritability","ill-temper","bad mood"]}],"etymology":{"value":"Derived from \"peevishness\" (the state of being easily irritated or annoyed) with the addition of the prefix \"un-\" (meaning not).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈpiːvɪʃnəs/","syllables":"un-pee-vish-ness"},"inflection":{"noun_plural":"unpeevishnesses (rarely used)"},"usage_notes":{"explanation":"\"Unpeevishness\" is a relatively uncommon word that describes the quality of being free from peevishness, which is the tendency to be easily irritated or annoyed. It is often used to describe someone who is remarkably patient and good-tempered, even in difficult circumstances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a great unpeevish.","correct":"✓ He showed great unpeevishness.","note":"\"Unpeevishness\" is a noun, so it should not be used as an adjective. Use it to describe the state or quality of not being peevish."}],"priority":"★★☆"},"related_words":{"derivatives":["peevish (adjective: easily irritated or annoyed)","peevishly (adverb: in an irritable or annoyed manner)","peevishness (noun: the state of being easily irritated or annoyed)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Very low frequency - The word is rare and not commonly used in everyday language.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unpeevishness\" is an advanced word that describes the absence of irritability or annoyance. It's used to characterize someone who remains patient and good-tempered, even when faced with frustrating situations. Because it's not a common word, it's more likely to be found in formal writing or literature rather than everyday conversation."},"example_sentences":[{"sentence":"Her remarkable **unpeevishness** allowed her to handle difficult customers with grace.","translation":"彼女の驚くべき不機嫌さのなさは、難しい顧客を優雅に扱うことを可能にした。","type":"noun","meaning_category":"不機嫌でないこと"},{"sentence":"Despite the constant interruptions, he maintained his **unpeevishness** and continued to work diligently.","translation":"絶え間ない中断にもかかわらず、彼は不機嫌にならない状態を保ち、勤勉に働き続けた。","type":"noun","meaning_category":"気難しさがないこと"}]}