{"word":"unrapaciousness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"貪欲でないこと、強欲でないこと","english_definition":"the quality of not being rapacious; lack of greed or avarice.","examples":[{"sentence":"His unrapaciousness was surprising, considering his position of power.","translation":"彼の地位の高さから考えると、彼が貪欲でないことは驚くべきことだった。"},{"sentence":"The company's unrapaciousness in pricing allowed them to build customer loyalty.","translation":"その会社の価格設定における貪欲さのなさが、顧客の信頼を築くことを可能にした。"}],"collocations":["show unrapaciousness","demonstrate unrapaciousness"],"synonyms":["generosity","altruism","selflessness","benevolence","magnanimity"],"antonyms":["rapacity","greed","avarice","cupidity"]}],"etymology":{"value":"\"un-\" (否定の接頭辞) + \"rapaciousness\" (強欲さ)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌn.rəˈpeɪ.ʃəs.nəs/","syllables":"un-ra-pa-cious-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Unrapaciousness\" is a relatively rare word that describes the absence of rapacity, which is extreme greed or the tendency to seize what one desires by force or unscrupulous means. It is often used in contexts where one might expect greed or exploitation, making the lack of it noteworthy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a great unrapaciousness for money.","correct":"✓ He showed great unrapaciousness.","note":"\"Unrapaciousness\" refers to a general lack of greed, not a specific lack of desire for something. It is better to say he showed great unrapaciousness in his dealings, or he showed unrapaciousness in general."}],"priority":"★☆☆"},"related_words":{"derivatives":["rapacious (形容詞: 強欲な、略奪的な)","rapaciously (副詞: 強欲に、略奪的に)"],"antonyms":["rapacity (名詞: 強欲、略奪)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unrapaciousness\" is a sophisticated word that describes the absence of greed or predatory behavior. It's not commonly used, so understanding its meaning relies on knowing the root word \"rapacious,\" which means aggressively greedy or grasping. This word is more likely to appear in formal writing or discussions about ethics, business, or politics, where the lack of exploitative behavior is being highlighted."},"example_sentences":[{"sentence":"The leader's unrapaciousness earned him the respect of his people.","translation":"その指導者の貪欲でない態度は、彼に人々の尊敬を集めさせた。","type":"general","meaning_category":"lack of greed"},{"sentence":"Despite the opportunity for personal gain, her unrapaciousness guided her decisions.","translation":"個人的な利益を得る機会があったにもかかわらず、彼女の貪欲でない心が彼女の決断を導いた。","type":"ethical","meaning_category":"ethical behavior"}]}