{"word":"hyperkinesia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"多動症、運動過多症","english_definition":"Excessive movement; an abnormally increased and sometimes uncontrollable muscular activity.","examples":[{"sentence":"Hyperkinesia can be a symptom of certain neurological disorders.","translation":"多動症は特定の神経疾患の症状である可能性がある。"},{"sentence":"The child's hyperkinesia made it difficult for him to sit still in class.","translation":"その子供の多動症により、授業中にじっと座っているのが困難だった。"}],"collocations":["exhibit hyperkinesia (多動を示す)","treat hyperkinesia (多動症を治療する)","hyperkinesia symptoms (多動症の症状)"],"synonyms":["hyperactivity","restlessness","fidgetiness","akathisia"],"antonyms":["hypokinesia","akinesia","bradykinesia"]}],"etymology":{"value":"From the Greek words \"hyper\" (meaning \"over\" or \"excessive\") and \"kinesis\" (meaning \"movement\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərkɪˈniːziə/","syllables":"hy-per-ki-ne-si-a"},"inflection":{"noun_plural":"hyperkinesias"},"usage_notes":{"explanation":"Hyperkinesia refers to abnormally increased motor activity. It is a clinical sign, not a disease itself, and can be associated with various underlying conditions, including neurological disorders, psychiatric conditions, and medication side effects. The term is often used interchangeably with hyperactivity, although hyperkinesia is a more general term referring to any excessive movement, while hyperactivity often implies a specific pattern of behavior, particularly in children.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has hyperkinesia since birth.","correct":"✓ He has had hyperkinesia since birth.","note":"Since birth indicates a condition that has persisted from birth until the present, so the present perfect tense (has had) is more appropriate than the present simple (has)."},{"incorrect":"✗ Hyperkinesia is cure.","correct":"✓ Hyperkinesia is treatable.","note":"Hyperkinesia itself is not a disease to be cured, but a symptom that can be treated. Therefore, 'treatable' is a more appropriate term."}],"priority":"★★☆"},"related_words":{"derivatives":["hyperkinetic (adjective: relating to or affected by hyperkinesia)"],"phrasal_verbs":[],"medical_terms":["akathisia (内科: 静坐不能)","restless legs syndrome (内科: むずむず脚症候群)","tardive dyskinesia (内科: 遅発性ジスキネジア)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hyperkinesia' is a medical term referring to excessive movement or motor activity. It is often used in the context of neurological or psychiatric disorders. Understanding this term requires a familiarity with medical terminology and a higher level of English proficiency. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The patient's hyperkinesia was characterized by constant fidgeting and an inability to sit still.","translation":"その患者の多動症は、絶え間ないそわそわした動きと、じっと座っていられないことで特徴付けられた。","type":"general","meaning_category":"symptoms"},{"sentence":"Medication can sometimes help to manage the symptoms of hyperkinesia.","translation":"薬物療法は、多動症の症状を管理するのに役立つことがある。","type":"treatment","meaning_category":"treatment"},{"sentence":"The neurologist conducted a thorough examination to determine the cause of the patient's hyperkinesia.","translation":"神経科医は、患者の多動症の原因を特定するために徹底的な検査を行った。","type":"diagnosis","meaning_category":"diagnosis"}]}