{"word":"synoicous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学) 雄花と雌花が同じ花序に咲く、または両性花と雄花が同じ株に咲く","english_definition":"(botany) Having staminate and pistillate flowers in the same inflorescence, or having hermaphrodite and staminate flowers on the same plant.","examples":[{"sentence":"Synoicous plants are more likely to self-pollinate.","translation":"雌雄同株の植物は自家受粉しやすい。"},{"sentence":"The synoicous nature of the plant allows for both self- and cross-pollination.","translation":"その植物の雌雄同株性は、自家受粉と他家受粉の両方を可能にする。"}],"collocations":[],"synonyms":["monoecious","hermaphroditic"],"antonyms":["dioecious"]}],"etymology":{"value":"Derived from the Greek words 'syn' (together) and 'oikos' (house), referring to the 'same house' or plant having both male and female flowers.","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˈnɔɪkəs/","syllables":"sy-noi-cous"},"inflection":{"notes":"Adjective, comparative and superlative forms are more synoicous, most synoicous"},"usage_notes":{"explanation":"The term 'synoicous' is primarily used in botany to describe the arrangement of male and female flowers on a single plant. It is a relatively technical term and not commonly used outside of botanical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The animal is synoicous.","correct":"✓ The plant is synoicous.","note":"'Synoicous' applies to plants, not animals."}],"priority":"★☆☆"},"related_words":{"derivatives":["synoecy (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'synoicous' is a specialized botanical term, indicating that a plant has both male and female flowers in the same inflorescence, or hermaphrodite and staminate flowers on the same plant. Due to its technical nature, it is rarely encountered outside of academic or scientific contexts related to botany."},"example_sentences":[{"sentence":"The species is synoicous, with both male and female flowers present in the same cluster.","translation":"その種は雌雄同株で、雄花と雌花が同じ房に存在する。","type":"descriptive","meaning_category":"botany"},{"sentence":"The synoicous condition of this plant ensures a higher rate of self-pollination.","translation":"この植物の雌雄同株の状態は、自家受粉率を高める。","type":"descriptive","meaning_category":"botany"}]}