{"word":"geomicrobiology","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"地球微生物学、地質微生物学","english_definition":"The study of the interactions between microorganisms and geological processes and formations.","examples":[{"sentence":"Geomicrobiology is an interdisciplinary field that combines geology, microbiology, and chemistry.","translation":"地球微生物学は、地質学、微生物学、化学を組み合わせた学際的な分野です。"},{"sentence":"Geomicrobiology plays a crucial role in understanding the formation of mineral deposits.","translation":"地球微生物学は、鉱床の形成を理解する上で重要な役割を果たします。"},{"sentence":"The field of geomicrobiology has expanded rapidly with advances in molecular techniques.","translation":"地球微生物学の分野は、分子技術の進歩とともに急速に拡大しています。"}],"collocations":["environmental geomicrobiology","applied geomicrobiology","geomicrobiology research","geomicrobiology studies"],"synonyms":["environmental microbiology","biogeochemistry"],"antonyms":[]}],"etymology":{"value":"Combination of 'geo-' (earth), 'micro-' (small, referring to microorganisms), and 'biology' (the study of life).","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒiːoʊˌmaɪkroʊbaɪˈɒlədʒi/","syllables":"geo-mi-cro-bi-ol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Geomicrobiology is an interdisciplinary science that focuses on the roles of microbes in geological processes. This includes the study of microbial weathering of rocks and minerals, the formation of biominerals, the biogeochemical cycling of elements, and the impact of microbial activity on subsurface environments. It is a rapidly growing field with applications in environmental science, resource exploration, and astrobiology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Geomicrobiology is the study of large organisms and rocks.","correct":"✓ Geomicrobiology is the study of microorganisms and rocks.","note":"Geomicrobiology focuses on *micro*organisms, not large organisms."},{"incorrect":"✗ Geomicrobiology is important for understanding only the surface of the Earth.","correct":"✓ Geomicrobiology is important for understanding both the surface and subsurface of the Earth.","note":"Geomicrobiology studies both surface and subsurface environments."}],"priority":"★★☆"},"related_words":{"derivatives":["geomicrobiological (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Geomicrobiology is a specialized term used in scientific contexts. It refers to the study of how tiny living things (microbes) interact with rocks, minerals, and other geological features. This field helps us understand how microbes can change rocks, form minerals, and affect the environment deep underground. Because it's a technical term, it's mainly used by scientists and researchers in related fields."},"example_sentences":[{"sentence":"The geomicrobiology of deep-sea vents is a fascinating area of research.","translation":"深海熱水噴出孔の地球微生物学は、魅力的な研究分野です。","type":"noun","meaning_category":"Study of microbes and geological processes"},{"sentence":"Geomicrobiology techniques are used to analyze microbial communities in soil samples.","translation":"地球微生物学的手法は、土壌サンプル中の微生物群集を分析するために使用されます。","type":"noun","meaning_category":"Study of microbes and geological processes"},{"sentence":"Understanding geomicrobiology is essential for bioremediation of contaminated sites.","translation":"地球微生物学を理解することは、汚染された場所のバイオレメディエーションに不可欠です。","type":"noun","meaning_category":"Study of microbes and geological processes"}]}