{"word":"dyscrased","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(archaic) Having an unbalanced or disordered constitution or temperament; ill-humored.","english_definition":"(archaic) Having an unbalanced or disordered constitution or temperament; ill-humored.","examples":[{"sentence":"The dyscrased patient was difficult to treat due to their unpredictable moods.","translation":"気分のむらが予測できないため、体質が不均衡な患者の治療は困難だった。"},{"sentence":"His dyscrased nature made him prone to fits of anger and resentment.","translation":"彼の不均衡な性質は、彼を怒りや憤りの発作を起こしやすくした。"}],"collocations":["dyscrased temperament","dyscrased constitution"],"synonyms":["unbalanced","disordered","ill-humored","peevish","irritable"],"antonyms":["balanced","well-tempered","good-humored"]}],"etymology":{"value":"Derived from 'dyscrasia,' referring to an imbalance of humors in the body, a concept from ancient medicine.","priority":"Medium"},"pronunciation":{"ipa":"/dɪˈskreɪst/","syllables":"dys-crased"},"inflection":{"notes":"This is an adjective. It does not have standard inflections beyond comparative/superlative forms, which are rarely used."},"usage_notes":{"explanation":"'Dyscrased' is an archaic term, rarely used in modern English. It describes someone with an imbalanced or disordered temperament, often leading to irritability or ill-humor. Its usage is primarily historical or literary.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He felt dyscrased after a good night's sleep.","correct":"He felt refreshed after a good night's sleep.","note":"'Dyscrased' implies a negative or unbalanced state, not a positive or refreshed one."}],"priority":"Low"},"related_words":{"derivatives":["dyscrasia (noun): an imbalance of humors or elements in the body"],"related_terms":[]},"level_frequency":{"CEFR":"N/A (archaic)","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Dyscrased' is an archaic and rare term, primarily found in older texts. Understanding requires familiarity with historical medical concepts, particularly the theory of humors. Its modern usage is virtually non-existent."},"example_sentences":[{"sentence":"The physician diagnosed the patient as dyscrased, attributing their melancholy to a humoral imbalance.","translation":"医師は、患者の憂鬱な気分を体液の不均衡に起因するものとして、その患者を体質が不均衡であると診断した。","type":"adjective","meaning_category":"Unbalanced temperament"}]}