{"word":"landlouping","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(スコットランド) 土地を転々としながら農業をする人、またはそのような行為","english_definition":"(Scotland) The practice of itinerant agriculture; also, a person who practices such agriculture.","examples":[{"sentence":"The landlouping farmers moved from place to place, seeking fertile soil.","translation":"その土地を転々とする農家は、肥沃な土壌を求めて場所から場所へと移動した。"}],"collocations":[],"synonyms":["itinerant farming","shifting cultivation"],"antonyms":["sedentary agriculture"]}],"etymology":{"value":"Derived from Scots 'landlouper', from 'land' + 'louper' (leaper), referring to someone who leaps or wanders across the land.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlændˌluːpɪŋ/","syllables":"land-loop-ing"},"inflection":{"noun_plural":"landloupings"},"usage_notes":{"explanation":"'Landlouping' is a term primarily used in a Scottish historical context to describe a type of agricultural practice and the people who engaged in it. It refers to a nomadic or semi-nomadic form of farming where individuals or families would move from one piece of land to another, often without owning the land, to cultivate it until the soil was exhausted and then move on. This practice was often associated with poverty and a lack of stable land tenure.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["landlouper"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Landlouping' is a specialized term related to historical Scottish agricultural practices. It describes a form of itinerant farming where farmers moved from place to place, cultivating land temporarily before moving on. Understanding this term requires knowledge of historical agricultural practices and Scottish dialect. It is not commonly used in modern English.","priority":"★☆☆"},"example_sentences":[{"sentence":"The practice of landlouping was common in certain parts of Scotland due to the lack of secure land ownership.","translation":"土地を転々としながら農業をするという行為は、安定した土地所有権がなかったスコットランドの一部地域では一般的だった。","type":"noun","meaning_category":"agricultural practice"},{"sentence":"Landlouping was a difficult way of life, as families were constantly on the move.","translation":"土地を転々としながら農業をするのは、家族が常に移動しているため、困難な生き方だった。","type":"noun","meaning_category":"way of life"}]}