{"word":"monocrystal","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"単結晶","english_definition":"A single crystal; a crystalline solid in which the crystal lattice of the entire sample is continuous and unbroken to the edges of the sample, with no grain boundaries.","examples":[{"sentence":"Silicon monocrystals are used in the manufacture of semiconductors.","translation":"シリコン単結晶は半導体の製造に使用されます。"},{"sentence":"The properties of a monocrystal differ from those of a polycrystalline material.","translation":"単結晶の特性は多結晶材料の特性とは異なります。"}],"collocations":["silicon monocrystal","grow a monocrystal","monocrystal growth"],"synonyms":["single crystal"],"antonyms":["polycrystal","multicrystal"]}],"etymology":{"value":"From 'mono-' (single) + 'crystal'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɒnəˈkrɪstəl/","syllables":"mon-o-crys-tal"},"inflection":{"noun_plural":"monocrystals"},"usage_notes":{"explanation":"'Monocrystal' is primarily used in scientific and technical contexts, particularly in materials science, physics, and electronics. It refers to a material with a continuous crystal lattice throughout, which gives it unique properties compared to materials with grain boundaries (polycrystals).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metal is a monocrystal, so it's very weak.","correct":"✓ The metal is a monocrystal, so it has specific directional properties.","note":"Monocrystals are not necessarily weak; their properties are anisotropic (direction-dependent), which can be advantageous in certain applications."}],"priority":"★★☆"},"related_words":{"derivatives":["monocrystalline (adjective)"],"related_terms":["crystal","crystallography","polycrystalline","single-crystal diffraction"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monocrystal' is a technical term used in science and engineering, specifically when discussing materials with a single, continuous crystal lattice. Understanding this term requires a background in materials science or solid-state physics. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The efficiency of solar cells is improved by using silicon **monocrystals**.","translation":"太陽電池の効率は、シリコン単結晶を使用することで向上します。","type":"noun","meaning_category":"material science"},{"sentence":"Researchers are studying the growth of large-scale **monocrystals** for advanced applications.","translation":"研究者たちは、高度な応用に向けて大規模な単結晶の成長を研究しています。","type":"noun","meaning_category":"research and development"}]}