{"word":"undefaming","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(defameの否定)名誉毀損しないこと","english_definition":"The act of not defaming someone; refraining from damaging someone's reputation.","examples":[{"sentence":"The article was carefully written, undefaming the politician while still exposing the facts.","translation":"その記事は注意深く書かれており、政治家の名誉を毀損することなく事実を暴露していた。"},{"sentence":"The lawyer advised his client to speak undefamingly about his former business partner.","translation":"弁護士は依頼人に、以前のビジネスパートナーについて名誉毀損しないように話すよう助言した。"}],"collocations":["speak undefamingly","write undefamingly","act undefamingly"],"synonyms":["protecting reputation","clearing name","vindication","exoneration"],"antonyms":["defaming","slandering","libeling"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the verb 'defaming'. 'Defaming' comes from 'defame', which originates from Latin 'diffamare' (to spread a bad report of).","priority":"N/A"},"pronunciation":{"ipa":"/ˌʌndɪˈfeɪmɪŋ/","syllables":"un-di-fa-ming"},"inflection":{"verb_forms":{"present_simple":["undefames"],"past_simple":"undefamed","past_participle":"undefamed","present_participle":"undefaming"}},"usage_notes":{"explanation":"'Undefaming' is the act of refraining from defaming someone. It is the opposite of 'defaming', which means to damage someone's reputation through false statements. The term is not commonly used, but it can be useful in contexts where it is important to emphasize the absence of defamation.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is undefaming about his rival.","correct":"✓ He is speaking undefamingly about his rival.","note":"'Undefaming' is a verb, so it needs to be used with an auxiliary verb or in a verbal phrase. The adverb 'undefamingly' is more commonly used to describe the manner of speaking. "},{"incorrect":"✗ The undefaming article cleared his name.","correct":"✓ The undefaming article did not damage his name. / ✓ The article, by undefaming him, cleared his name.","note":"'Undefaming' describes the action of not defaming, not the quality of an article. To indicate that the article cleared his name, it is better to say that the article did not damage his name or that the article cleared his name by not defaming him."}],"priority":"N/A"},"related_words":{"derivatives":["undefamed (adjective)","undefamingly (adverb)","defame (verb)","defamation (noun)","defamatory (adjective)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Undefaming' is a complex and rare word. It means to actively avoid defaming someone, which is to say, to avoid damaging their reputation with false or misleading statements. It is formed by adding the prefix 'un-' to 'defaming,' making it the opposite. Due to its rarity and complexity, it is not suitable for beginner or intermediate learners. It is primarily used in legal or formal contexts where the avoidance of defamation is crucial."},"example_sentences":[{"sentence":"The journalist took great care in writing the article, ensuring that it was undefaming.","translation":"ジャーナリストは記事を書く際に細心の注意を払い、名誉毀損にならないようにした。","type":"verb","meaning_category":"名誉毀損しないこと"},{"sentence":"His statement was undefaming, carefully avoiding any accusations.","translation":"彼の声明は名誉毀損とは言えず、あらゆる非難を慎重に避けていた。","type":"verb","meaning_category":"名誉毀損しないこと"}]}