{"word":"berthage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"停泊料、バース使用料","english_definition":"The charge for the use of a berth in a port or harbor.","examples":[{"sentence":"The berthage fees at this marina are quite expensive.","translation":"このマリーナの停泊料はかなり高い。"},{"sentence":"We need to calculate the berthage costs before deciding which port to use.","translation":"どの港を使うか決める前に、停泊料を計算する必要があります。"}],"collocations":["berthage fees","berthage costs","calculate berthage","pay berthage"],"synonyms":["dockage","moorage","wharfage"],"antonyms":[]},{"part_of_speech":"noun","definition":"停泊場所を提供する能力、バースの総数","english_definition":"The capacity of a port or harbor to provide berths.","examples":[{"sentence":"The port has limited berthage, so reservations are essential.","translation":"その港は停泊場所が限られているため、予約が必須です。"},{"sentence":"Increased berthage is needed to accommodate the growing number of ships.","translation":"船舶数の増加に対応するため、停泊場所の増設が必要です。"}],"collocations":["limited berthage","increased berthage","expand berthage"],"synonyms":["docking capacity","mooring capacity"],"antonyms":[]}],"etymology":{"value":"'Berth' (停泊場所) + '-age' (名詞を作る接尾辞)","priority":"★★★"},"pronunciation":{"ipa":"ˈbɜːrθɪdʒ","syllables":"berth-age"},"inflection":{"noun_plural":"berthages"},"usage_notes":{"explanation":"'Berthage' refers to the fee charged for using a berth (a designated spot for a ship to dock) in a port or harbor. It can also refer to the overall capacity of a port to provide berths. The term is commonly used in the shipping and maritime industries.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The ship needed a berth, so it paid berth.","correct":"The ship needed a berth, so it paid berthage.","note":"'Berth' is the place to dock, 'berthage' is the fee for using that place."}],"priority":"★★☆"},"related_words":{"derivatives":["berth","berthing"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Berthage' is a specialized term primarily used in maritime and shipping contexts. It refers to the fee paid for using a designated docking space (berth) or the overall capacity of a port to accommodate ships. Understanding this term requires familiarity with nautical vocabulary and the operations of ports and harbors."},"example_sentences":[{"sentence":"The shipping company was billed for berthage after unloading its cargo.","translation":"その海運会社は貨物を降ろした後、停泊料を請求された。","type":"noun","meaning_category":"停泊料"},{"sentence":"The city is planning to expand the berthage at the port to attract more business.","translation":"市は、より多くのビジネスを誘致するために、港の停泊場所を拡大する計画を立てている。","type":"noun","meaning_category":"停泊場所を提供する能力"}]}