{"word":"itinerario","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"旅程、旅行計画","english_definition":"itinerary, travel plan","examples":[{"sentence":"El agente de viajes preparó un itinerario detallado para nuestro viaje.","translation":"旅行代理店は私たちの旅行のために詳細な旅程を作成しました。"},{"sentence":"Nuestro itinerario incluye visitas a museos, parques y monumentos históricos.","translation":"私たちの旅程には、美術館、公園、史跡への訪問が含まれています。"},{"sentence":"¿Podemos modificar el itinerario para incluir una visita a la playa?","translation":"ビーチへの訪問を含めるように旅程を変更できますか？"}],"collocations":["itinerario de viaje (travel itinerary)","itinerario detallado (detailed itinerary)","seguir un itinerario (to follow an itinerary)","modificar un itinerario (to modify an itinerary)"],"synonyms":["ruta","recorrido","plan de viaje"],"antonyms":[]}],"etymology":{"value":"Del latín itinerarius, relativo al camino (iter).","priority":"N/A"},"pronunciation":{"ipa":"/iti.neˈɾa.ɾjo/","syllables":"i-ti-ne-ra-rio"},"inflection":{"noun_forms":{"singular":"itinerario","plural":"itinerarios"}},"usage_notes":{"explanation":"'Itinerario' se refiere a la planificación de un viaje, incluyendo las actividades, lugares a visitar, y el orden en que se realizarán. Es un plan detallado que ayuda a organizar el viaje.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"El itinerario es muy aburrido. Necesitamos un itinerario más emoción.","correct":"El itinerario es muy aburrido. Necesitamos un itinerario con más emoción.","note":"'Emoción' necesita la preposición 'con' para indicar que el itinerario debe tener más emoción."},{"incorrect":"Tengo un itinerario para la semana.","correct":"Tengo un itinerario para la semana / Tengo planes para la semana.","note":"Si no se trata de un viaje, es mejor usar 'planes' en lugar de 'itinerario'."}],"priority":"N/A"},"related_words":{"derivatives":["itinerante (adjective: itinerant, wandering)"],"phrases":["seguir el itinerario (to follow the itinerary)","planificar un itinerario (to plan an itinerary)"]},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Medium","priority":"N/A"},"readability_explanation":{"level":"B1","text":"'Itinerario' es una palabra que se usa para describir un plan de viaje. Incluye los lugares que vas a visitar y las actividades que vas a hacer. Por ejemplo, si vas a visitar Europa, tu itinerario podría incluir visitar París, Roma y Londres. Es una palabra útil para hablar de viajes y vacaciones."},"example_sentences":[{"sentence":"El itinerario del crucero incluía varias islas del Caribe.","translation":"The cruise itinerary included several Caribbean islands.","type":"noun","meaning_category":"travel plan"},{"sentence":"Necesitamos un itinerario flexible que nos permita adaptarnos a los cambios.","translation":"We need a flexible itinerary that allows us to adapt to changes.","type":"noun","meaning_category":"travel plan"},{"sentence":"El guía turístico nos entregó un itinerario detallado de la excursión.","translation":"The tour guide gave us a detailed itinerary of the excursion.","type":"noun","meaning_category":"travel plan"}]}