{"word":"severization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(経済・政治) 分断化、分離化、遮断","english_definition":"The act or process of severing or dividing something, especially in an economic or political context.","examples":[{"sentence":"The severization of economic ties between the two countries led to a significant decline in trade.","translation":"両国間の経済的なつながりの分断化は、貿易の大幅な減少につながった。"},{"sentence":"The government's policy of severization aimed to create independent administrative regions.","translation":"政府の分断化政策は、独立した行政地域を作り出すことを目的としていた。"}],"collocations":["economic severization (経済的分断化)","political severization (政治的分断化)","severization policy (分断化政策)","complete severization (完全な分断化)"],"synonyms":["separation","division","fragmentation","isolation","disconnection","detachment"],"antonyms":["integration","unification","connection","consolidation","amalgamation"]}],"etymology":{"value":"Derived from the verb 'severize', which is formed from 'sever' (to divide or separate) + '-ize' (a suffix indicating a process or action).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌsɛvəraɪˈzeɪʃən/","syllables":"se-ver-i-za-tion"},"inflection":{"noun_plural":"severizations"},"usage_notes":{"explanation":"'Severization' is a relatively uncommon term, often used in academic or technical contexts, particularly in discussions of economics, politics, or international relations. It describes the process of breaking apart or isolating previously connected entities or systems. The term emphasizes the act of cutting off or separating, often with negative consequences such as reduced cooperation or economic decline.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The severization was caused by the integration.","correct":"✓ The severization was caused by the conflict.","note":"Severization is the opposite of integration, so it cannot be caused by integration."},{"incorrect":"✗ The severization of the company made it stronger.","correct":"✓ The severization of the company led to its downfall.","note":"Severization often implies negative consequences, such as weakening or downfall."}],"priority":"☆☆☆"},"related_words":{"derivatives":["sever (verb)","severance (noun)","severable (adjective)","severely (adverb)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Severization' is a complex term primarily used in specialized fields like economics and political science. It refers to the process of dividing or disconnecting entities, often leading to fragmentation or isolation. Due to its technical nature and limited usage, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The severization of the telecommunications network made it vulnerable to cyber attacks.","translation":"電気通信ネットワークの分断化は、サイバー攻撃に対して脆弱にした。","type":"noun","meaning_category":"分断化"},{"sentence":"Complete severization of the two departments led to communication problems.","translation":"二つの部署の完全な分離化は、コミュニケーションの問題につながった。","type":"noun","meaning_category":"分離化"}]}