{"word":"paroler","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"仮釈放中の人","english_definition":"A person who has been released from prison on parole.","examples":[{"sentence":"The paroler was required to report to his parole officer weekly.","translation":"仮釈放中の人は、毎週保護観察官に報告する必要があった。"},{"sentence":"The paroler violated the terms of his parole and was sent back to prison.","translation":"仮釈放中の人は仮釈放の条件に違反し、刑務所に戻された。"}],"collocations":["meet with a paroler","supervise a paroler","rehabilitate a paroler"],"synonyms":["probationer","releasee"],"antonyms":["prisoner","inmate"]}],"etymology":{"value":"Derived from 'parole', referring to the conditional release of a prisoner.","priority":"★★★"},"pronunciation":{"ipa":"/pəˈroʊlər/","syllables":"pa-rol-er"},"inflection":{"noun_plural":"parolers"},"usage_notes":{"explanation":"'Paroler' specifically refers to the individual who is under parole supervision, not the system or the officer.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The parole officer met with the paroler's parole.","correct":"The parole officer met with the paroler.","note":"'Parole' is the state of being released, not the person."}],"priority":"★★☆"},"related_words":{"derivatives":["parole (noun)","parolee (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'paroler' is a specific term used in the context of law and corrections, referring to an individual released from prison under parole conditions. It is less commonly used than 'parolee' but carries the same meaning. Understanding the term requires familiarity with the legal system and the concept of parole."},"example_sentences":[{"sentence":"The judge warned the paroler about the consequences of violating his parole conditions.","translation":"裁判官は、仮釈放中の人に仮釈放条件に違反した場合の結果について警告した。","type":"noun","meaning_category":"仮釈放中の人"},{"sentence":"The social worker provided support to the paroler to help him reintegrate into society.","translation":"ソーシャルワーカーは、仮釈放中の人が社会に復帰するのを支援するためにサポートを提供した。","type":"noun","meaning_category":"仮釈放中の人"}]}