{"word":"complacence","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己満足、慢心、独善","english_definition":"a feeling of quiet pleasure or security, often while unaware of some potential danger, defect, or the like; self-satisfaction; smugness.","examples":[{"sentence":"His complacence was shattered by the sudden turn of events.","translation":"彼の自己満足は、突然の事態の変化によって打ち砕かれた。"},{"sentence":"The team's complacence after their early victories led to their eventual defeat.","translation":"チームは序盤の勝利の後、自己満足に陥り、最終的には敗北につながった。"},{"sentence":"We must fight against complacence and continue to strive for improvement.","translation":"私たちは自己満足と闘い、改善のために努力し続けなければならない。"}],"collocations":["a feeling of complacence (自己満足感)","fall into complacence (自己満足に陥る)","shatter someone's complacence (人の自己満足を打ち砕く)","overcome complacence (自己満足を克服する)","danger of complacence (自己満足の危険性)"],"synonyms":["smugness","self-satisfaction","self-regard","conceit","arrogance","vanity","hubris","contentment","satisfaction"],"antonyms":["humility","modesty","dissatisfaction","concern","anxiety","vigilance"]}],"etymology":{"value":"Derived from the Latin word 'complacere', meaning 'to please greatly'. It evolved through the French 'complaisance' to describe a feeling of contentment and satisfaction, eventually developing the negative connotation of excessive self-satisfaction and unawareness of potential problems.","priority":"★★☆"},"pronunciation":{"ipa":"/kəmˈpleɪsəns/","syllables":"com-pla-cence"},"inflection":{"noun_form":"complacence (singular, uncountable)"},"usage_notes":{"explanation":"'Complacence' describes a state of being pleased with oneself or one's situation to the point of being unaware of potential dangers or the need for improvement. It often carries a negative connotation, suggesting a lack of vigilance or a resistance to change. It is similar to 'smugness' and 'self-satisfaction' but often implies a greater degree of unawareness or indifference to potential problems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed complacence for his work.","correct":"✓ He showed complacence in his work.","note":"The correct preposition to use with 'complacence' is often 'in' or 'with', depending on the context. 'Complacence in' or 'complacence with' something is more common than 'complacence for' something."},{"incorrect":"✗ The team was complacence after winning the first game.","correct":"✓ The team was complacent after winning the first game.","note":"'Complacence' is a noun, while 'complacent' is an adjective. Make sure to use the correct form of the word depending on the grammatical context."},{"incorrect":"✗ Complacence is good for motivation.","correct":"✓ Complacence can be detrimental to motivation.","note":"Complacence is generally considered a negative trait, as it can hinder progress and lead to missed opportunities. It is rarely seen as a positive influence on motivation."}],"priority":"★★☆"},"related_words":{"derivatives":["complacent (adjective: self-satisfied, smug)","complacently (adverb: in a self-satisfied manner)"],"idioms_phrases":["There are no specific idioms or common phrases directly using the word 'complacence', but related phrases include: 'resting on one's laurels' (relying on past achievements and not striving for further progress), 'patting oneself on the back' (expressing self-satisfaction)."],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Relatively low frequency - more common in formal writing and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Complacence' is a relatively advanced word that describes a state of self-satisfaction and lack of awareness of potential problems or the need for improvement. It is often used in formal writing and discussions about business, politics, or personal development. Understanding this word requires a good grasp of abstract concepts and nuanced language. It is often contrasted with qualities like humility, vigilance, and a desire for continuous improvement."},"example_sentences":[{"sentence":"The company's **complacence** allowed competitors to gain a significant market share.","translation":"その企業の自己満足が、競合他社に大きな市場シェアを獲得させることになった。","type":"noun","meaning_category":"self-satisfaction"},{"sentence":"We must guard against **complacence** and continue to innovate.","translation":"私たちは自己満足に陥らないように注意し、革新を続けなければならない。","type":"noun","meaning_category":"lack of vigilance"},{"sentence":"His **complacence** was evident in his lack of preparation for the meeting.","translation":"彼の自己満足は、会議への準備不足に明らかだった。","type":"noun","meaning_category":"smugness"}]}