{"word":"tarnishable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"変色しやすい、曇りやすい、光沢を失いやすい","english_definition":"Capable of being tarnished; susceptible to losing luster or becoming discolored.","examples":[{"sentence":"Silver is a tarnishable metal, requiring regular polishing to maintain its shine.","translation":"銀は変色しやすい金属なので、輝きを保つためには定期的な研磨が必要です。"},{"sentence":"The tarnishable surface of the old mirror reflected a distorted image.","translation":"その古い鏡の曇りやすい表面は、歪んだ像を映し出していました。"}],"collocations":["tarnishable silver","tarnishable surface","easily tarnishable"],"synonyms":["oxidizable","corrodible","discolorable","stainable"],"antonyms":["tarnish-resistant","non-tarnishable","imperishable","unfading"]}],"etymology":{"value":"The word is formed by adding the suffix '-able' to the verb 'tarnish'. 'Tarnish' comes from the Old French word 'ternir', meaning 'to darken, to make dull'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɑːrnɪʃəbəl/","syllables":"tar-nish-a-ble"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs (e.g., 'easily tarnishable') but does not have different forms like verbs."},"usage_notes":{"explanation":"'Tarnishable' describes materials, especially metals, that are prone to developing a dull or discolored surface due to oxidation or other chemical reactions. It is often used in the context of jewelry, silverware, and other decorative items. The word implies a need for maintenance to preserve the original appearance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tarnishable is silver.","correct":"✓ Silver is tarnishable.","note":"'Tarnishable' is an adjective, so it needs to modify a noun. It cannot stand alone as a noun."},{"incorrect":"✗ The metal is tarnish.","correct":"✓ The metal is tarnishable.","note":"'Tarnish' is a verb or a noun, not an adjective. Use 'tarnishable' to describe the property of being able to tarnish."}],"priority":"★★☆"},"related_words":{"derivatives":["tarnish (verb: 変色させる、曇らせる; noun: 変色、曇り)","tarnished (adjective: 変色した、曇った)","tarnishing (noun: 変色、曇り)"],"related_terms":["oxidation","corrosion","patina","luster","polish"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tarnishable' is a relatively uncommon word used to describe materials that are prone to losing their shine or becoming discolored. It is most often applied to metals like silver and copper. The word implies that the material requires care and maintenance to prevent or remove the tarnish. Understanding this word helps in describing the properties of materials and the need for their upkeep."},"example_sentences":[{"sentence":"Copper is a naturally **tarnishable** metal that develops a green patina over time.","translation":"銅は自然に変色しやすい金属で、時間とともに緑青が生じます。","type":"adjective","meaning_category":"変色しやすい"},{"sentence":"The **tarnishable** brass doorknob required frequent polishing to maintain its golden appearance.","translation":"その変色しやすい真鍮製のドアノブは、金色を保つために頻繁な研磨が必要でした。","type":"adjective","meaning_category":"曇りやすい"},{"sentence":"Jewelers often apply a protective coating to **tarnishable** jewelry to slow down the oxidation process.","translation":"宝石商は、酸化プロセスを遅らせるために、変色しやすい宝石に保護コーティングを施すことがよくあります。","type":"adjective","meaning_category":"光沢を失いやすい"}]}