{"word":"self-toning","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(写真)自己発色性の、自動調色式の","english_definition":"(of photographic paper or a process) producing a colored image without the use of a separate toning bath.","examples":[{"sentence":"self-toning paper is convenient for quick prints.","translation":"自己発色性の印画紙は、手早くプリントするのに便利だ。"}],"collocations":["self-toning paper","self-toning process"],"synonyms":["auto-toning"],"antonyms":[]}],"etymology":{"value":"'self-' + 'toning'.  'Toning' refers to the photographic process of changing the color of a print. 'Self-' indicates that the toning process is built into the paper or process itself.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˈtoʊnɪŋ/","syllables":"self-ton-ing"},"inflection":{"notes":"This word does not inflect as it is an adjective."},"usage_notes":{"explanation":"'Self-toning' is a technical term primarily used in photography. It describes a type of photographic paper or a process where the color of the image is developed without needing an additional chemical bath for toning. This simplifies the printing process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ This printer is self-toning.","correct":"✓ This printer uses self-toning paper.","note":"'Self-toning' describes the paper or process, not the printer itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["tone (verb, noun)","toner (noun)","toning (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-toning' is a specialized term related to photographic processes, specifically referring to materials or methods that automatically produce a colored image without requiring a separate toning step. Understanding this term requires some familiarity with photography terminology."},"example_sentences":[{"sentence":"The photographer preferred self-toning paper for its ease of use in the darkroom.","translation":"その写真家は、暗室での使いやすさから自己発色性の印画紙を好んだ。","type":"adjective","meaning_category":"自己発色性の"},{"sentence":"The self-toning process simplified the development of sepia-toned prints.","translation":"自己発色プロセスにより、セピア調のプリントの現像が簡素化された。","type":"adjective","meaning_category":"自動調色式の"}]}