{"word":"carcinological","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"蟹類学の、蟹類学的な","english_definition":"Relating to carcinology, the branch of zoology dealing with crustaceans, especially crabs.","examples":[{"sentence":"The carcinological research focused on the migratory patterns of the crab species.","translation":"その蟹類学的研究は、カニ種の回遊パターンに焦点を当てていた。"},{"sentence":"He presented his carcinological findings at the marine biology conference.","translation":"彼は海洋生物学会議で自身の蟹類学的研究結果を発表した。"}],"collocations":["carcinological research","carcinological study","carcinological findings","carcinological expertise"],"synonyms":["crustaceological"],"antonyms":[]}],"etymology":{"value":"From 'carcinology' (the study of crustaceans, especially crabs) + '-ical' (forming adjectives). 'Carcinology' derives from Greek 'karkinos' (crab) + '-logia' (study of).","priority":"★★☆"},"pronunciation":{"ipa":"ˌkɑːrsɪnəˈlɒdʒɪkəl","syllables":"car-ci-no-lo-gi-cal"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms (which are rare for this word)."},"usage_notes":{"explanation":"'Carcinological' is a specialized term used in the context of zoology and marine biology. It specifically relates to the study of crustaceans, particularly crabs. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cancerological study...","correct":"✓ The carcinological study...","note":"'Carcinological' (study of crabs) is often confused with 'oncological' (study of cancer). Ensure correct spelling and context."}],"priority":"★★☆"},"related_words":{"derivatives":["carcinology (noun): the study of crustaceans, especially crabs","carcinologist (noun): a person who studies carcinology"],"related_scientific_fields":["zoology","marine biology","crustaceology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'carcinological' is highly specialized and technical, primarily used within the field of zoology, specifically concerning the study of crustaceans, especially crabs. Its usage is limited to scientific and academic contexts. A general understanding of biology and scientific terminology is necessary to comprehend its meaning and application."},"example_sentences":[{"sentence":"The museum's collection included a detailed carcinological exhibit.","translation":"その博物館のコレクションには、詳細な蟹類学の展示が含まれていた。","type":"general","meaning_category":"general"},{"sentence":"The team published a carcinological paper on the evolution of crab claws.","translation":"そのチームは、カニの爪の進化に関する蟹類学の論文を発表した。","type":"scientific","meaning_category":"scientific"}]}