{"word":"rulable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"支配可能な、統治可能な","english_definition":"Capable of being ruled or governed.","examples":[{"sentence":"The population was considered rulable due to their peaceful nature.","translation":"その住民は穏やかな性格のため、統治可能であると考えられていた。"},{"sentence":"Whether a territory is rulable often depends on its resources and infrastructure.","translation":"ある地域が支配可能かどうかは、しばしばその資源やインフラに左右される。"}],"collocations":["easily rulable","difficult to rulable"],"synonyms":["governable","controllable","manageable"],"antonyms":["ungovernable","uncontrollable","unmanageable"]}],"etymology":{"value":"\"rule\" (支配する) + \"-able\" (～できる)","priority":"★★★"},"pronunciation":{"ipa":"/ˈruːləbəl/","syllables":"ru-la-ble"},"inflection":{"adjective_forms":{"comparative":"more rulable","superlative":"most rulable"}},"usage_notes":{"explanation":"\"Rulable\" is primarily used in formal contexts when discussing the capacity of a population, territory, or entity to be governed effectively. It often implies a degree of willingness or suitability for being ruled.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The king made the country more rulable.","correct":"✓ The king made the country more governable by improving infrastructure.","note":"While \"rulable\" is technically correct, \"governable\" is a more common and natural-sounding alternative. The example sentence is improved by specifying how the king made the country more governable."}],"priority":"★★☆"},"related_words":{"derivatives":["rule","ruler","ruling","unrulable"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"rulable\" is a relatively uncommon adjective that describes something capable of being ruled or governed. It is used in formal contexts to discuss the manageability of populations or territories. While understandable, more common synonyms like \"governable\" or \"manageable\" are often preferred in general usage."},"example_sentences":[{"sentence":"The newly acquired territory was deemed rulable after the establishment of a strong military presence.","translation":"新たに獲得した領土は、強力な軍事プレゼンスの確立後、支配可能とみなされた。","type":"adjective","meaning_category":"Capable of being ruled"},{"sentence":"A rulable society requires a certain level of cooperation from its citizens.","translation":"統治可能な社会は、市民からの一定レベルの協力が必要である。","type":"adjective","meaning_category":"Capable of being ruled"}]}