{"word":"chromogenesis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"色素形成、発色","english_definition":"The production of pigment or color.","examples":[{"sentence":"Chromogenesis is a process that can occur in certain bacteria.","translation":"色素形成は特定の細菌で起こりうるプロセスです。"},{"sentence":"The chromogenesis of the flower petals is influenced by environmental factors.","translation":"花びらの発色は環境要因の影響を受けます。"}],"collocations":["bacterial chromogenesis (細菌の色素形成)","floral chromogenesis (花の色の形成)"],"synonyms":["pigmentation","coloration","color formation"],"antonyms":["achromatism","decolorization"]}],"etymology":{"value":"From the Greek words 'chroma' (color) and 'genesis' (origin, creation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkroʊməˈdʒɛnəsɪs/","syllables":"chro-mo-gen-e-sis"},"inflection":{"noun_plural":"chromogeneses"},"usage_notes":{"explanation":"Chromogenesis refers to the biological process of producing pigment or color. It is often used in the context of microorganisms, plants, and animals, where the formation of color is a significant characteristic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The chromogenesis is very important for the energy of the plant.","correct":"✓ Chlorophyll production is very important for the energy of the plant.","note":"Chromogenesis refers to the production of pigment, not necessarily energy production. Chlorophyll production is more directly related to energy production in plants."}],"priority":"★☆☆"},"related_words":{"derivatives":["chromogenic (adjective: producing color)","chromogen (noun: a colorless precursor that can be converted into a colored compound)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Chromogenesis is a technical term used in biology and chemistry to describe the process of producing pigment or color. It's not a commonly used word in everyday conversation. Understanding this term requires knowledge of scientific concepts related to pigmentation and color formation.","priority":"★★☆"},"example_sentences":[{"sentence":"The study investigated the chromogenesis of melanin in skin cells.","translation":"その研究は、皮膚細胞におけるメラニンの色素形成を調査した。","type":"general","meaning_category":"色素形成"},{"sentence":"Certain bacteria exhibit chromogenesis, resulting in colorful colonies.","translation":"特定の細菌は色素形成を示し、その結果、カラフルなコロニーが形成される。","type":"specific","meaning_category":"色素形成"}]}