{"word":"untheologically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"神学的に正しくない方法で、神学の原則や教義に反して","english_definition":"in a way that is not theological; not in accordance with theological principles or doctrines.","examples":[{"sentence":"The argument was presented untheologically, lacking any grounding in religious doctrine.","translation":"その議論は神学的な根拠を欠き、神学的に正しくない方法で提示された。"},{"sentence":"He spoke untheologically about the nature of God, causing controversy among the clergy.","translation":"彼は神の本質について神学に反した発言をし、聖職者の間で論争を引き起こした。"}],"collocations":["argue untheologically","speak untheologically","approach the subject untheologically"],"synonyms":["irreligiously","heretically","secularly","profanely"],"antonyms":["theologically","religiously","orthodoxly"]}],"etymology":{"value":"接頭辞 un- (否定) + theologically (神学的に)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnθiəˈlɒdʒɪkli/","syllables":"un-the-o-log-i-cal-ly"},"inflection":{"notes":"adverb, no inflection"},"usage_notes":{"explanation":"'Untheologically' is used to describe actions, statements, or approaches that deviate from established theological principles or doctrines. It often implies a lack of understanding or adherence to religious teachings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The book was untheological.","correct":"✓ The book was untheologically written.","note":"'Untheological' is an adjective. 'Untheologically' is an adverb, so it modifies a verb or adjective. If you want to say the book lacks theological content, use 'untheological'."}],"priority":"★★☆"},"related_words":{"derivatives":["untheological (adjective)","theological (adjective)","theology (noun)","theologian (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'untheologically' is a complex term that is used to describe something that is done or expressed in a way that does not follow the principles or doctrines of theology. It is typically used in academic or religious contexts to critique or analyze arguments, statements, or approaches that are considered to be inconsistent with established theological thought. Understanding this word requires familiarity with theological concepts and principles."},"example_sentences":[{"sentence":"The sermon approached the topic of salvation untheologically, focusing more on personal experience than scriptural interpretation.","translation":"その説教は救いのテーマに神学的に正しくない方法で取り組み、聖書の解釈よりも個人的な経験に焦点を当てた。","type":"general","meaning_category":"manner"},{"sentence":"He argued untheologically, relying on philosophical reasoning rather than religious dogma.","translation":"彼は神学の教義よりも哲学的な推論に頼って、神学的に正しくない議論をした。","type":"general","meaning_category":"manner"}]}