{"word":"menaquinone","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"メナキノン（ビタミンK2）","english_definition":"A form of vitamin K produced by bacteria, found in some animal products and fermented foods, and important for blood clotting and bone health.","examples":[{"sentence":"Menaquinone is essential for the carboxylation of certain proteins involved in coagulation.","translation":"メナキノンは、凝固に関与する特定のタンパク質のカルボキシル化に不可欠です。"},{"sentence":"Natto is a rich source of menaquinone.","translation":"納豆はメナキノンの豊富な供給源です。"}],"collocations":["menaquinone-7 (MK-7)","menaquinone synthesis","dietary menaquinone","menaquinone supplementation"],"synonyms":["vitamin K2","phylloquinone (vitamin K1)"],"antonyms":[]}],"etymology":{"value":"Derived from 'mena-' (referring to a chemical structure) and 'quinone' (a type of organic compound), combined to describe the vitamin K2 molecule.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛnəˈkwɪnoʊn/","syllables":"me-na-qui-none"},"inflection":{"noun_plural":"menaquinones"},"usage_notes":{"explanation":"Menaquinone is a specific form of vitamin K2, which is different from phylloquinone (vitamin K1). It's produced by bacteria and found in fermented foods like natto and some animal products. It plays a crucial role in blood clotting and bone metabolism. Different forms of menaquinone exist, such as MK-4, MK-7, MK-9, etc., with varying bioavailability and functions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Menaquinone is the same as vitamin K1.","correct":"✓ Menaquinone is a form of vitamin K2, distinct from vitamin K1 (phylloquinone).","note":"Menaquinone (K2) and phylloquinone (K1) are different forms of vitamin K with distinct sources and functions."},{"incorrect":"✗ Menaquinone is only found in plants.","correct":"✓ Menaquinone is primarily produced by bacteria and found in some animal products and fermented foods.","note":"Unlike phylloquinone, which is found in green plants, menaquinone is mainly produced by bacteria."}],"priority":"★☆☆"},"related_words":{"derivatives":["menaquinol (reduced form of menaquinone)"],"phrases":["vitamin K","phylloquinone","natto","blood clotting","bone health"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency (scientific/medical context)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Menaquinone' is a technical term primarily used in the context of nutrition, biochemistry, and medicine. It refers to a specific type of vitamin K (vitamin K2) produced by bacteria and found in certain foods. Understanding this term requires some background knowledge in biology and nutrition. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The study investigated the effects of menaquinone supplementation on bone density in postmenopausal women.","translation":"その研究では、閉経後の女性の骨密度に対するメナキノン補給の効果を調査しました。","type":"scientific","meaning_category":"vitamin K2"},{"sentence":"Certain gut bacteria are capable of synthesizing menaquinone.","translation":"特定の腸内細菌はメナキノンを合成することができます。","type":"scientific","meaning_category":"vitamin K2"},{"sentence":"Fermented foods like natto are a significant dietary source of menaquinone.","translation":"納豆のような発酵食品は、メナキノンの重要な食事源です。","type":"nutritional","meaning_category":"vitamin K2"}]}