{"word":"haematuria","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"血尿","english_definition":"The presence of blood in the urine.","examples":[{"sentence":"The patient presented with haematuria and lower back pain.","translation":"患者は血尿と腰痛を訴えて来院した。"},{"sentence":"Microscopic haematuria can only be detected with a urine test.","translation":"顕微鏡的血尿は尿検査でのみ検出できる。"}],"collocations":["gross haematuria (肉眼的血尿)","microscopic haematuria (顕微鏡的血尿)","painless haematuria (無痛性血尿)","persistent haematuria (持続性血尿)","intermittent haematuria (間欠性血尿)"],"synonyms":["hematuria"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'haima' (αἷμα) meaning 'blood' and 'ouria' (οὐρία) meaning 'urine'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːməˈtjʊəriə/","syllables":"hee-ma-tu-ri-a"},"inflection":{"noun_plural":"haematurias"},"usage_notes":{"explanation":"'Haematuria' refers to the presence of red blood cells in the urine. It can be either visible to the naked eye (gross haematuria) or only detectable under a microscope (microscopic haematuria). The underlying causes can range from benign conditions like urinary tract infections to more serious issues such as kidney stones or cancer.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has haematuria, so he should drink more water.","correct":"✓ He has haematuria, so he should see a doctor.","note":"While drinking water is generally good, haematuria requires medical evaluation to determine the cause."},{"incorrect":"✗ Haematuria is always a sign of cancer.","correct":"✓ Haematuria can be a sign of cancer, but it can also be caused by other conditions.","note":"Haematuria has various causes, and cancer is only one possibility."}],"priority":"★★☆"},"related_words":{"derivatives":["haemato- (prefix related to blood)","-uria (suffix related to urine)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Haematuria' is a medical term that refers to the presence of blood in the urine. It's important to understand that while it can be a sign of a serious condition, it can also be caused by less severe issues. If someone experiences haematuria, it's crucial to seek medical advice to determine the underlying cause. The term is primarily used in medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor ordered a series of tests to determine the cause of the patient's haematuria.","translation":"医師は患者の血尿の原因を特定するために一連の検査を指示した。","type":"general","meaning_category":"General"},{"sentence":"Gross haematuria is often alarming for patients, but it doesn't always indicate a serious problem.","translation":"肉眼的血尿は患者にとってしばしば不安を煽るが、必ずしも深刻な問題を示すとは限らない。","type":"medical","meaning_category":"Medical"},{"sentence":"Microscopic haematuria was detected during a routine urine analysis.","translation":"定期的な尿検査で顕微鏡的血尿が検出された。","type":"medical","meaning_category":"Medical"}]}