{"word":"chemo-sensitive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"化学療法感受性の、化学療法が有効な","english_definition":"Responsive to chemotherapy; describing cells or tumors that are likely to be killed or inhibited by chemotherapy drugs.","examples":[{"sentence":"This type of cancer is usually chemo-sensitive, resulting in a good prognosis.","translation":"このタイプの癌は通常、化学療法感受性があり、予後良好です。"},{"sentence":"The tumor was found to be highly chemo-sensitive after initial testing.","translation":"最初の検査の結果、腫瘍は化学療法に対する感受性が高いことが判明しました。"}],"collocations":["highly chemo-sensitive","relatively chemo-sensitive","chemo-sensitive cancer cells","chemo-sensitive tumor"],"synonyms":["chemo-responsive","chemotherapy-sensitive"],"antonyms":["chemo-resistant","chemotherapy-resistant"]}],"etymology":{"value":"'chemo-' (化学療法) + 'sensitive' (感受性のある)","priority":"★★★"},"pronunciation":{"ipa":"/ˌkiːmoʊˈsɛnsɪtɪv/","syllables":"kee-mo-sen-si-tiv"},"inflection":{"notes":"比較変化なし"},"usage_notes":{"explanation":"'Chemo-sensitive' is used in the context of cancer treatment to describe cancers or cancer cells that respond well to chemotherapy. It indicates that the chemotherapy drugs are likely to be effective in killing or inhibiting the growth of the cancer cells. The degree of sensitivity can vary, and this is an important factor in determining the treatment plan.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient is chemo-sensitive to the treatment.","correct":"✓ The patient's cancer is chemo-sensitive.","note":"It's the cancer or cancer cells that are chemo-sensitive, not the patient themselves."},{"incorrect":"✗ Chemo-sensitive is a type of chemotherapy.","correct":"✓ Chemo-sensitive describes how well a cancer responds to chemotherapy.","note":"Chemo-sensitive describes the characteristic of the cancer, not the treatment itself."}],"priority":"★★☆"},"related_words":{"derivatives":["chemosensitivity (名詞: 化学療法感受性)"],"phrasal_verbs":[],"related_terms":["chemotherapy","chemoresistance","cancer","tumor","oncology"]},"level_frequency":{"frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 医学・腫瘍学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chemo-sensitive' is a term used in medicine, specifically in oncology (the study and treatment of cancer). It describes cancer cells or tumors that are likely to be killed or have their growth stopped by chemotherapy drugs. If a cancer is described as 'chemo-sensitive,' it means that chemotherapy is likely to be an effective treatment option. This term is usually used by doctors and medical professionals when discussing treatment options with patients."},"example_sentences":[{"sentence":"The leukemia cells were highly **chemo-sensitive**, which improved the patient's chances of remission.","translation":"白血病細胞は化学療法に対する感受性が高かったため、患者の寛解の可能性が高まりました。","type":"adjective","meaning_category":"化学療法感受性"},{"sentence":"Doctors were pleased to find the tumor was **chemo-sensitive** and responded well to the initial treatment.","translation":"医師たちは、腫瘍が化学療法感受性であり、初期治療によく反応したことを喜んだ。","type":"adjective","meaning_category":"化学療法感受性"}]}