{"word":"black-favored","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(archaic) Having a dark or swarthy complexion; dark-complexioned.","english_definition":"(archaic) Having a dark or swarthy complexion; dark-complexioned.","examples":[{"sentence":"The pirate was a black-favored man, weathered by years at sea.","translation":"その海賊は、長年の航海で日に焼けた、浅黒い肌の男だった。"},{"sentence":"She was described as a black-favored beauty with piercing eyes.","translation":"彼女は、鋭い目を持つ、浅黒い肌の美人として描写された。"}],"collocations":["black-favored pirate","black-favored beauty","black-favored rogue"],"synonyms":["dark-complexioned","swarthy","dusky","brunet"],"antonyms":["fair-complexioned","light-skinned","pale"],"notes":"This term is archaic and not commonly used in modern English. It often carries historical or literary connotations."}],"etymology":{"value":"Combination of 'black' (referring to dark color) and 'favored' (implying appearance or complexion). The term suggests a dark complexion that was once considered attractive or notable.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌblækˈfeɪvərd/","syllables":"black-fa-vored"},"inflection":{"notes":"Adjective, no standard comparative or superlative forms."},"usage_notes":{"explanation":"The term 'black-favored' is rarely used in contemporary English. It's primarily found in older literature or historical contexts to describe someone with a dark or swarthy complexion. The term might also carry outdated or potentially problematic connotations related to race or ethnicity, so it should be used with caution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Using 'black-favored' to describe someone of African descent.","correct":"Using terms like 'Black,' 'African American,' or 'person of color' depending on context and preference.","note":"'Black-favored' is not an appropriate or respectful term to describe someone of African descent in modern usage."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["swarthy","dark-complexioned","brunet"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (archaic and not in common use)","frequency_google_ngram":"Very low frequency - primarily found in older texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Black-favored' is an archaic term that is rarely used in modern English. It is most likely to be encountered in older literature or historical texts. Understanding the term requires familiarity with historical language conventions and an awareness of its potential to carry outdated or problematic connotations related to race or ethnicity. Therefore, it is considered a term that would be understood primarily by advanced English speakers or those with a specific interest in historical language."},"example_sentences":[{"sentence":"The old sea captain was described as a black-favored man with a weathered face.","translation":"その老船長は、日に焼けた顔をした、浅黒い肌の男として描写された。","type":"adjective","meaning_category":"Complexion"},{"sentence":"In the novel, the heroine was a black-favored beauty, admired for her exotic looks.","translation":"小説の中で、ヒロインはエキゾチックな美貌で賞賛される、浅黒い肌の美人だった。","type":"adjective","meaning_category":"Appearance"}]}