{"word":"deportability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"国外追放可能性、追放されやすさ","english_definition":"The state of being liable to deportation; the quality or condition of being deportable.","examples":[{"sentence":"His deportability was a major concern for his family.","translation":"彼の国外追放可能性は家族にとって大きな懸念事項だった。"},{"sentence":"The lawyer argued against his client's deportability.","translation":"弁護士は依頼人の国外追放可能性に対して反論した。"}],"collocations":["assess deportability","challenge deportability","face deportability","risk deportability"],"synonyms":["expellability","removability"],"antonyms":["non-deportability","right to remain"]},{"part_of_speech":"noun","definition":"(比喩的に)排除可能性、追放されやすさ","english_definition":"(Figuratively) The likelihood of being removed or excluded from a group, position, or situation.","examples":[{"sentence":"The company's restructuring increased the deportability of many employees.","translation":"会社のリストラにより、多くの従業員の排除可能性が高まった。"}],"collocations":["increase deportability","decrease deportability"],"synonyms":["excludability","removability","dismissibility"],"antonyms":["security","stability","permanence"]}],"etymology":{"value":"\"Deport\"（国外追放する）+ \"-ability\"（～できること、～の性質）","priority":"★★☆"},"pronunciation":{"ipa":"/diˌpɔːr.təˈbɪl.ə.ti/","syllables":"de-por-ta-bil-i-ty"},"inflection":{"noun_plural":"deportabilities"},"usage_notes":{"explanation":"\"Deportability\" refers specifically to the legal status or condition of being subject to deportation from a country. It is most commonly used in legal and immigration contexts. The figurative sense is less common but can be used to describe the likelihood of someone being removed from a job or other position.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The deportability of the package was a concern.","correct":"✓ The transportability of the package was a concern.","note":"\"Deportability\" is used for people, not objects. For objects, use \"transportability\" or \"deliverability\"."},{"incorrect":"✗ He has a high deportability.","correct":"✓ He has a high risk of deportation. / ✓ He has a high degree of deportability.","note":"Use \"risk of deportation\" or \"degree of deportability\" rather than \"high deportability\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["deport (verb)","deportable (adjective)","deportation (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Deportability\" is a formal term primarily used in legal and immigration contexts. It refers to the state of being liable to deportation, meaning that someone can be legally removed from a country. Understanding this term requires familiarity with immigration law and related concepts. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The judge considered his criminal record when assessing his deportability.","translation":"裁判官は彼の国外追放可能性を評価する際に、彼の犯罪歴を考慮した。","type":"noun","meaning_category":"国外追放可能性"},{"sentence":"Changes in immigration law can affect the deportability of certain groups of people.","translation":"入国管理法の変更は、特定の人々のグループの国外追放可能性に影響を与える可能性がある。","type":"noun","meaning_category":"国外追放可能性"}]}