{"word":"hyena-dog","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Alternative name for the African wild dog (Lycaon pictus).","english_definition":"An alternative name for the African wild dog (Lycaon pictus), reflecting a superficial resemblance to hyenas.","examples":[{"sentence":"The hyena-dog, also known as the African wild dog, is an endangered species.","translation":"ハイエナ犬としても知られるアフリカの野生犬は、絶滅危惧種です。"}],"collocations":["pack of hyena-dogs","endangered hyena-dog"],"synonyms":["African wild dog","painted wolf","painted hunting dog"],"antonyms":[]}],"etymology":{"value":"The term 'hyena-dog' arose from the African wild dog's somewhat hyena-like appearance, particularly in its build and coloration.","priority":"★★☆"},"pronunciation":{"ipa":"/haɪˈiːnə dɒɡ/","syllables":"hy-e-na dog"},"inflection":{"noun_plural":"hyena-dogs"},"usage_notes":{"explanation":"The term 'hyena-dog' is less common than 'African wild dog' or 'painted wolf,' but it is occasionally used, especially in older texts or by those unfamiliar with the more common names. It is important to note that despite the name, these animals are canids (members of the dog family) and not closely related to hyenas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hyena-dogs are related to hyenas.","correct":"✓ Hyena-dogs are not related to hyenas; they are canids.","note":"It's important to clarify that hyena-dogs are canids, not related to hyenas despite the name."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["African wild dog (Lycaon pictus)","Hyena"],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hyena-dog' is an uncommon term for the African wild dog. It's important to understand that, despite the name, the animal is a canid and not related to hyenas. The term might appear in specialized texts about African wildlife or in older literature. Knowing the more common names, 'African wild dog' or 'painted wolf,' is generally more useful."},"example_sentences":[{"sentence":"Conservation efforts are crucial to protect the dwindling population of the hyena-dog.","translation":"ハイエナ犬の減少している個体数を保護するためには、保全活動が不可欠です。","type":"noun","meaning_category":"animal name"},{"sentence":"The hyena-dog's mottled coat provides excellent camouflage in the African savanna.","translation":"ハイエナ犬のまだら模様の毛皮は、アフリカのサバンナで優れたカモフラージュになります。","type":"noun","meaning_category":"animal description"}]}