{"word":"wedgeable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(物が)楔(くさび)で固定できる、(隙間などに)押し込めることができる","english_definition":"Capable of being wedged; able to be fixed or fitted with a wedge; able to be forced or squeezed into a space.","examples":[{"sentence":"This gap is just wedgeable with a small piece of wood.","translation":"この隙間は、小さな木片でちょうど楔を打てる（詰め込める）。"},{"sentence":"The door wasn't locking, but it was wedgeable with a chair.","translation":"ドアはロックできなかったが、椅子で押し込んで固定することができた。"}],"collocations":["easily wedgeable","securely wedgeable"],"synonyms":["jammable","forceable","crammable","stuffable"],"antonyms":["unwedgeable","unfixable","immovable"]}],"etymology":{"value":"The word 'wedgeable' is formed by adding the suffix '-able' to the word 'wedge'. 'Wedge' comes from Old English 'wecg', meaning 'a wedge'. The suffix '-able' indicates capability or suitability.","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɛdʒəbəl/","syllables":"wedge-a-ble"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Wedgeable' is used to describe something that can be secured or fitted into place using a wedge or by being forced into a tight space. It implies that the object or space is suitable for this type of fixing or fitting. The word is relatively uncommon but useful in specific contexts where the ability to wedge something is relevant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cake was wedgeable.","correct":"✓ The cake was cut into wedgeable slices.","note":"'Wedgeable' describes the ability to be fixed or fitted with a wedge. It doesn't mean 'shaped like a wedge'."},{"incorrect":"✗ He wedgeabled the door shut.","correct":"✓ He wedged the door shut.","note":"'Wedgeable' is an adjective. The verb form is 'wedge'."}],"priority":"★★☆"},"related_words":{"derivatives":["wedge (noun): A piece of wood, metal, or some other material having one thick end and tapering to a thin edge, used for splitting wood, raising weights, or tightening parts.","wedge (verb): To fix in place or force apart with a wedge.","wedged (adjective): Firmly fixed or tightly packed.","wedging (noun): The act of fixing or forcing something with a wedge."],"related_concepts":["jamming","fitting","securing","fastening"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Wedgeable' is a relatively uncommon word used to describe something that can be fixed or secured using a wedge, or by being forced into a tight space. It's formed from the word 'wedge' (a triangular or tapering shape) and the suffix '-able' (meaning 'capable of'). This word is more likely to be encountered in technical or descriptive contexts where the ability to fix or secure something in this way is important. Understanding the meaning of 'wedge' is crucial for understanding 'wedgeable'."},"example_sentences":[{"sentence":"The space between the two rocks was just wedgeable with a large stone.","translation":"2つの岩の間のスペースは、大きな石でちょうど楔を打てる（詰め込める）広さだった。","type":"general"},{"sentence":"Because the shelf was slightly loose, it was wedgeable with a folded piece of cardboard.","translation":"棚が少し緩んでいたので、折りたたんだ段ボールで押し込んで固定することができた。","type":"general"}]}