{"word":"prednisone","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"プレドニゾン（合成副腎皮質ステロイド薬の一種）","english_definition":"a synthetic corticosteroid drug that is used to suppress the immune system and reduce inflammation.","examples":[{"sentence":"The doctor prescribed prednisone for her arthritis.","translation":"医師は彼女の関節炎にプレドニゾンを処方した。"},{"sentence":"Prednisone can have several side effects, including weight gain and mood changes.","translation":"プレドニゾンには、体重増加や気分の変化など、いくつかの副作用がある可能性がある。"}],"collocations":["take prednisone (プレドニゾンを服用する)","prednisone side effects (プレドニゾンの副作用)","prednisone dosage (プレドニゾンの投与量)","prednisone treatment (プレドニゾン治療)"],"synonyms":["corticosteroid","steroid"],"antonyms":[]}],"etymology":{"value":"Derived from the chemical structure and related to other corticosteroids.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈprɛdnɪˌsoʊn/","syllables":"pred-ni-sone"},"inflection":{"noun_plural":"prednisones"},"usage_notes":{"explanation":"Prednisone is a corticosteroid medication used to treat a variety of conditions, including inflammatory diseases, autoimmune disorders, and allergic reactions. It works by suppressing the immune system. It is typically taken orally, but can also be administered intravenously or topically. Long-term use can lead to significant side effects, so it's important to follow a doctor's instructions carefully.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I take prednisone for cold.","correct":"✓ I take prednisone for my autoimmune disease.","note":"Prednisone is not typically used for common colds. It's used for more serious conditions like autoimmune diseases or severe inflammation."},{"incorrect":"✗ You can stop taking prednisone suddenly.","correct":"✓ You should taper off prednisone slowly under a doctor's supervision.","note":"Stopping prednisone abruptly can be dangerous. The dosage needs to be reduced gradually."}],"priority":"★☆☆"},"related_words":{"derivatives":["prednisolone (a related corticosteroid)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but common in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Prednisone is a medication used to treat inflammation and suppress the immune system. It is a type of corticosteroid. It is often prescribed for conditions like arthritis, asthma, and allergies. Because it can have significant side effects, it is important to use it under the supervision of a doctor.","priority":"★☆☆"},"example_sentences":[{"sentence":"She was prescribed **prednisone** to help manage her asthma symptoms.","translation":"彼女は喘息の症状を管理するためにプレドニゾンを処方された。","type":"noun","meaning_category":"medication"},{"sentence":"Long-term use of **prednisone** can lead to bone thinning.","translation":"プレドニゾンの長期使用は骨粗鬆症につながる可能性がある。","type":"noun","meaning_category":"medication"},{"sentence":"The doctor is monitoring his **prednisone** dosage closely.","translation":"医師は彼のプレドニゾンの投与量を注意深く監視している。","type":"noun","meaning_category":"medication"}]}