{"word":"Eulimidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ウミウサギガイ科：海に生息する巻貝の一分類群","english_definition":"a taxonomic family of ectoparasitic sea snails, marine gastropod mollusks in the superfamily Eulimoidea. They are ectoparasites on echinoderms, especially sea cucumbers and sea stars.","examples":[{"sentence":"Eulimidae are often difficult to identify due to their small size and variable morphology.","translation":"ウミウサギガイ科は、その小ささと多様な形態のために、識別が困難なことが多いです。"},{"sentence":"Some Eulimidae species are known to change sex during their lifespan.","translation":"ウミウサギガイ科の一部の種は、生涯の間に性転換することが知られています。"}],"collocations":["Eulimidae species","Eulimidae parasite","Eulimidae taxonomy","Echinoderm hosts of Eulimidae"],"synonyms":["sea snail","gastropod","ectoparasite"],"antonyms":[]}],"etymology":{"value":"The name Eulimidae comes from the genus name *Eulima*. The etymology of *Eulima* is uncertain, but it is likely derived from Greek elements.","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈlɪmɪdiː/","syllables":"Eu-li-mi-dae"},"inflection":{"noun_plural":"Eulimidae (same form for singular and plural)"},"usage_notes":{"explanation":"Eulimidae is a family name used in scientific classification. It refers specifically to a group of small, parasitic sea snails. When discussing a single member, it's common to say \"a Eulimid snail.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Eulimidae is a singular snail.","correct":"✓ A Eulimid snail is a member of the Eulimidae family.","note":"Eulimidae is a family name (plural in form, but treated as singular in some contexts). To refer to one snail, use \"a Eulimid snail.\""}],"priority":"★★☆"},"related_words":{"derivatives":["Eulimid (adjective, relating to the family Eulimidae)","Eulimoidea (superfamily containing Eulimidae and related families)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Low frequency (scientific literature)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Eulimidae' is a specialized term used in marine biology and taxonomy. Understanding this term requires familiarity with biological classification systems and the characteristics of marine gastropods. It is typically encountered in scientific publications and specialized texts on marine life."},"example_sentences":[{"sentence":"The parasitic behavior of Eulimidae has been extensively studied.","translation":"ウミウサギガイ科の寄生行動は広く研究されてきました。","type":"general","meaning_category":"general"},{"sentence":"Several new species of Eulimidae have been discovered in deep-sea environments.","translation":"いくつかのウミウサギガイ科の新種が深海環境で発見されました。","type":"scientific","meaning_category":"scientific"}]}