{"word":"Geminid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ふたご座流星群","english_definition":"a prolific meteor shower associated with the asteroid 3200 Phaethon, which peaks around December 14th of each year.","examples":[{"sentence":"The Geminid meteor shower is known for its bright and numerous meteors.","translation":"ふたご座流星群は、明るく数多くの流星で知られています。"},{"sentence":"We watched the Geminids from a dark location outside the city.","translation":"私たちは都市部から離れた暗い場所でふたご座流星群を観察しました。"}],"collocations":["Geminid meteor shower","observe the Geminids","peak of the Geminids","Geminid activity"],"synonyms":["meteor shower"],"antonyms":[]}],"etymology":{"value":"Named after the constellation Gemini (ふたご座), from which the meteors appear to radiate.","priority":"★★★"},"pronunciation":{"ipa":"ˈdʒɛmɪnɪd","syllables":"Gem-i-nid"},"inflection":{"noun_plural":"Geminids"},"usage_notes":{"explanation":"The Geminids are a reliable and often spectacular meteor shower, visible in December. They are known for their relatively slow speed and bright meteors, making them easier to observe than some other showers. The radiant (the point from which the meteors appear to originate) is in the constellation Gemini, near the bright stars Castor and Pollux.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a gemini meteor.","correct":"✓ I saw a Geminid meteor.","note":"The correct term for a meteor belonging to the Geminid shower is \"Geminid meteor,\" not \"gemini meteor.\" Gemini is the constellation, while Geminid is the meteor shower."}],"priority":"★★☆"},"related_words":{"derivatives":["Geminids (plural noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Geminid\" refers to a specific astronomical event, the Geminid meteor shower. Understanding this term requires some familiarity with astronomy and meteor showers. The text explains the origin of the name, the time of year it occurs, and its characteristics. It also clarifies a common mistake in terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Geminid** meteor shower peaked last night, offering a stunning display.","translation":"昨夜、ふたご座流星群がピークを迎え、素晴らしい光景を見せてくれました。","type":"noun","meaning_category":"meteor shower"},{"sentence":"Many people braved the cold to observe the **Geminids**.","translation":"多くの人々が寒さに耐えながらふたご座流星群を観察しました。","type":"noun","meaning_category":"meteor shower"}]}