{"word":"RTSE","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"リアルタイム戦略エディタ (Real-Time Strategy Editor)","english_definition":"A real-time strategy editor, a software tool used to create or modify real-time strategy games.","examples":[{"sentence":"The game comes with a built-in RTSE, allowing players to create their own maps and scenarios.","translation":"そのゲームにはRTSEが内蔵されており、プレイヤーは独自のマップやシナリオを作成できます。"}],"collocations":["game RTSE","map RTSE","scenario RTSE"],"synonyms":["map editor","scenario editor"],"antonyms":[]}],"etymology":{"value":"An acronym derived from Real-Time Strategy Editor.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɑːrˌtiːˌɛsˈiː/","syllables":"ar-tee-es-ee"},"inflection":{"notes":"Plural: RTSEs"},"usage_notes":{"explanation":"RTSE is an acronym that stands for Real-Time Strategy Editor. It is a tool used in the creation or modification of real-time strategy games. It is typically included with the game or available as a separate download.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used the RTS to make a map.","correct":"✓ I used the RTSE to make a map.","note":"RTS is a real-time strategy game, RTSE is the editor for such games."}],"priority":"★★☆"},"related_words":{"derivatives":["RTS (Real-Time Strategy)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"RTSE is a technical term used in the context of video game development, specifically for real-time strategy games. It refers to the software tool that allows users to create or modify maps, scenarios, and other game elements. Understanding this term requires familiarity with the broader field of game development and real-time strategy games.","priority":"★★★"},"example_sentences":[{"sentence":"The community is actively developing new content using the game's RTSE.","translation":"コミュニティはゲームのRTSEを使って、積極的に新しいコンテンツを開発しています。","type":"noun","meaning_category":"リアルタイム戦略エディタ"},{"sentence":"The RTSE allows for detailed customization of terrain and unit placement.","translation":"RTSEでは、地形やユニットの配置を細かくカスタマイズできます。","type":"noun","meaning_category":"リアルタイム戦略エディタ"}]}