{"word":"stereotactic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"定位脳手術の、定位的な","english_definition":"Relating to or involving stereotaxy, a surgical procedure in which a three-dimensional coordinate system is used to locate small targets inside the body and to perform on them some action such as biopsy, lesion, injection, stimulation, implantation, radiosurgery (SRS) or a combination of these.","examples":[{"sentence":"The stereotactic surgery allowed the doctors to precisely target the tumor.","translation":"定位手術によって、医師は腫瘍を正確に標的にすることができた。"},{"sentence":"Stereotactic techniques are used in a variety of neurosurgical procedures.","translation":"定位技術は、さまざまな脳神経外科手術で使用されている。"}],"collocations":["stereotactic surgery","stereotactic biopsy","stereotactic radiosurgery","stereotactic frame"],"synonyms":["stereotaxic"],"antonyms":[]}],"etymology":{"value":"From 'stereo-' (three-dimensional) + 'tactic' (relating to arrangement or order), reflecting the use of a 3D coordinate system.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsteri.oʊˈtæktɪk/","syllables":"ste-re-o-tac-tic"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Stereotactic' refers to a precise surgical or diagnostic technique that uses a three-dimensional coordinate system to locate and target specific areas within the body, most commonly the brain. It allows for minimally invasive procedures with high accuracy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed a stereotypic surgery.","correct":"✓ The doctor performed a stereotactic surgery.","note":"'Stereotypic' means relating to stereotypes, while 'stereotactic' refers to the surgical technique. They are easily confused due to similar spelling."}],"priority":"★★☆"},"related_words":{"derivatives":["stereotaxy","stereotaxic","stereotactically"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'stereotactic' is a specialized term primarily used in the medical field, specifically in neurosurgery and related disciplines. It describes procedures that rely on precise spatial targeting within the body using a three-dimensional coordinate system. Due to its technical nature, it is not commonly encountered outside of medical contexts."},"example_sentences":[{"sentence":"Stereotactic brain biopsies are often used to diagnose brain tumors.","translation":"定位脳生検は、脳腫瘍の診断によく用いられる。","type":"general","meaning_category":"medical"},{"sentence":"The patient underwent stereotactic radiosurgery to treat the arteriovenous malformation.","translation":"患者は動静脈奇形を治療するために定位放射線手術を受けた。","type":"general","meaning_category":"medical"}]}