{"word":"all-flaming","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(rare, archaic) intensely fiery or passionate; completely ablaze.","english_definition":"(rare, archaic) Completely ablaze; intensely fiery or passionate.","examples":[{"sentence":"The all-flaming sun scorched the earth.","translation":"燃え盛る太陽が大地を焦がした。"},{"sentence":"His all-flaming eyes revealed his anger.","translation":"彼の燃え盛るような目は、彼の怒りをあらわにした。"}],"collocations":["all-flaming sun","all-flaming eyes","all-flaming fire"],"synonyms":["blazing","fiery","burning","passionate","intense"],"antonyms":["extinguished","cold","dull","apathetic"]}],"etymology":{"value":"Combination of \"all\" (meaning completely) and \"flaming\" (meaning burning or fiery). The \"all-\" prefix intensifies the meaning of \"flaming.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːl ˈfleɪmɪŋ/","syllables":"all-flam-ing"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"\"All-flaming\" is a rare and somewhat archaic adjective used to describe something that is completely ablaze or intensely fiery. It can also be used metaphorically to describe intense passion or anger. Due to its rarity, it is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The all-flaming car was driving down the street.","correct":"✓ The flaming car was driving down the street.","note":"\"All-flaming\" implies a complete and intense fire. A car that is simply on fire would be described as \"flaming\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["flaming","inflamed"],"related_terms":["all-consuming","all-encompassing"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"All-flaming\" is a rare and archaic term, likely encountered only in older literature or specialized contexts. It signifies something completely consumed by flames or possessing intense fiery qualities, both literally and metaphorically. Understanding requires a strong grasp of figurative language and historical vocabulary. Due to its limited usage, it is not part of common modern English vocabulary."},"example_sentences":[{"sentence":"The dragon's breath was an all-flaming torrent of destruction.","translation":"そのドラゴンの息は、すべてを焼き尽くす破壊の奔流だった。","type":"adjective","meaning_category":"intensely fiery"},{"sentence":"Her all-flaming determination propelled her forward despite the obstacles.","translation":"彼女の燃え盛るような決意が、障害にもかかわらず彼女を前進させた。","type":"adjective","meaning_category":"passionate"}]}