{"word":"element-sourced","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(化学、材料科学) 特定の元素を起源とする、または主要な構成要素として含むこと。","english_definition":"(chemistry, materials science) originating from or primarily composed of a specific element.","examples":[{"sentence":"The researchers developed an element-sourced semiconductor for high-temperature applications.","translation":"研究者たちは高温用途向けに、特定の元素を起源とする半導体を開発した。"},{"sentence":"This element-sourced material exhibits unique properties due to its elemental composition.","translation":"この元素を起源とする材料は、その元素組成のために独特の特性を示す。"}],"collocations":["element-sourced material","element-sourced semiconductor","element-sourced compound"],"synonyms":["elemental","element-based","element-derived"],"antonyms":["compound-sourced","alloy-sourced"]}],"etymology":{"value":"The word is formed by combining 'element' (referring to a chemical element) with 'sourced' (indicating the origin or source of something).","priority":"N/A"},"pronunciation":{"ipa":"/ˈɛləmənt sɔːrst/","syllables":"el-e-ment sourced"},"inflection":{"notes":"This is an adjective and does not have different inflectional forms."},"usage_notes":{"explanation":"The term 'element-sourced' is typically used in technical contexts, such as chemistry, materials science, and engineering, to describe materials or compounds that are primarily derived from or composed of a specific chemical element. It emphasizes the elemental origin or composition of the material.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The element-sourced water is pure.","correct":"✓ The element-sourced hydrogen is pure.","note":"'Element-sourced' should be used with elements, not compounds like water."}],"priority":"N/A"},"related_words":{"derivatives":["element","source","elemental"],"related_terms":["chemical element","material science","semiconductor"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in technical literature.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Element-sourced' is a technical term used to describe materials or compounds that originate from or are primarily composed of a specific chemical element. It is commonly found in scientific and engineering literature related to chemistry, materials science, and semiconductor technology. Understanding this term requires a background in these fields."},"example_sentences":[{"sentence":"The element-sourced thin film showed excellent conductivity.","translation":"その元素を起源とする薄膜は、優れた伝導性を示した。","type":"adjective","meaning_category":"材料科学"},{"sentence":"They are researching element-sourced alternatives to traditional alloys.","translation":"彼らは従来の合金に代わる、元素を起源とする代替材料を研究している。","type":"adjective","meaning_category":"化学"}]}