{"word":"dazzled","priority":"★★☆","meanings":[{"part_of_speech":"verb (past participle)","definition":"(光などで)目をくらまされた、幻惑された","english_definition":"past participle of dazzle: extremely impressed or overwhelmed by someone or something. Also, unable to see clearly because of very bright light.","examples":[{"sentence":"She was dazzled by the bright lights of the city.","translation":"彼女は街の明るい光に目をくらまされた。"},{"sentence":"I was dazzled by his charm and intelligence.","translation":"私は彼の魅力と知性に幻惑された。"},{"sentence":"The audience was dazzled by the performance.","translation":"観客はそのパフォーマンスに魅了された。"}],"collocations":["dazzled by the lights","dazzled by beauty","dazzled by talent"],"synonyms":["impressed","overwhelmed","blinded","amazed","astonished","mesmerized"],"antonyms":["underwhelmed","unimpressed","disenchanted"]},{"part_of_speech":"adjective","definition":"非常に感銘を受けた、魅了された","english_definition":"extremely impressed or attracted by someone or something.","examples":[{"sentence":"The critics were dazzled by her performance.","translation":"批評家たちは彼女の演技に非常に感銘を受けた。"},{"sentence":"He was dazzled by the prospect of fame and fortune.","translation":"彼は名声と富の見込みに魅了された。"}],"collocations":["dazzled critics","dazzled fans"],"synonyms":["impressed","amazed","astonished","captivated","enthralled","spellbound"],"antonyms":["disappointed","unimpressed","jaded"]}],"etymology":{"value":"The word \"dazzled\" comes from the verb \"dazzle,\" which originated in the late 14th century. It is believed to be derived from a frequentative form of the Middle English word \"dasen,\" meaning \"to stun or bewilder.\" The original sense of \"dazzle\" was to overpower the sight with intense light, but it later extended to mean to impress or amaze greatly.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdæzəld/","syllables":"daz-zled"},"inflection":{"notes":"'Dazzled' is the past participle and adjective form of the verb 'dazzle'. The verb 'dazzle' inflects as: dazzle, dazzles, dazzled, dazzling."},"usage_notes":{"explanation":"\"Dazzled\" is used to describe a state of being overwhelmed or greatly impressed, either literally by bright light or figuratively by someone's qualities or a spectacular event. It implies a sense of wonder and sometimes temporary disorientation. It can also suggest a loss of clear judgment due to being overly impressed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I was dazzling by her beauty.","correct":"✓ I was dazzled by her beauty.","note":"The correct form is 'dazzled' (past participle) when describing being impressed or overwhelmed."},{"incorrect":"✗ The lights were dazzling and I couldn't see.","correct":"✓ The lights were dazzling, and I couldn't see.","note":"While 'dazzling' can describe the lights, 'dazzled' describes the state of the person affected by the lights."}],"priority":"★★☆"},"related_words":{"derivatives":["dazzle (verb, noun)","dazzling (adjective, adverb)","dazzler (noun)"],"phrases":["dazzled by the lights","dazzled by her beauty"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but understandable in context.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Dazzled' means to be so impressed or amazed by something that you are almost overwhelmed. It can also mean being temporarily blinded by a very bright light. The word is often used to describe a strong, positive reaction to something visually stunning or intellectually impressive. It's more advanced than simply 'impressed' and suggests a sense of wonder or being overwhelmed.","priority":"★★☆"},"example_sentences":[{"sentence":"The tourists were **dazzled** by the beauty of the ancient temple.","translation":"観光客たちは古代寺院の美しさに魅了された。","type":"adjective","meaning_category":"魅了された"},{"sentence":"**Dazzled** by the sudden flash of light, he stumbled backwards.","translation":"突然の閃光に目をくらまされ、彼はよろめきながら後退した。","type":"verb (past participle)","meaning_category":"目をくらまされた"},{"sentence":"The **dazzled** audience gave the performers a standing ovation.","translation":"魅了された観客は出演者たちにスタンディングオベーションを送った。","type":"adjective","meaning_category":"魅了された"},{"sentence":"She was **dazzled** by the prospect of becoming a famous actress.","translation":"彼女は有名な女優になるという見込みに心を奪われた。","type":"verb (past participle)","meaning_category":"幻惑された"}]}