{"word":"institution-specific","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"特定の機関に特有の、機関固有の","english_definition":"Relating to or characteristic of a particular institution.","examples":[{"sentence":"The training program is institution-specific, tailored to the needs of this university.","translation":"その研修プログラムは機関固有のもので、この大学のニーズに合わせて調整されています。"},{"sentence":"Institution-specific policies govern the use of research data.","translation":"機関固有のポリシーが研究データの利用を管理しています。"},{"sentence":"We need to develop institution-specific strategies for improving student retention.","translation":"学生の定着率を向上させるための機関固有の戦略を策定する必要があります。"}],"collocations":["institution-specific policy","institution-specific training","institution-specific data","institution-specific procedures","institution-specific knowledge"],"synonyms":["organization-specific","company-specific","university-specific","agency-specific"],"antonyms":["general","universal","standardized","generic"]},{"part_of_speech":"adjective","definition":"(より詳細に)特定の教育機関に特有の","english_definition":"(More specifically) Relating to or characteristic of a particular educational institution.","examples":[{"sentence":"The course has institution-specific requirements for graduation.","translation":"そのコースには、特定の教育機関に特有の卒業要件があります。"},{"sentence":"Institution-specific scholarships are available to students who meet certain criteria.","translation":"特定の教育機関に特有の奨学金は、特定の基準を満たす学生が利用できます。"},{"sentence":"The accreditation process involves a review of institution-specific practices.","translation":"認定プロセスには、特定の教育機関に特有の慣行のレビューが含まれます。"}],"collocations":["institution-specific requirements","institution-specific scholarships","institution-specific practices","institution-specific curriculum","institution-specific resources"],"synonyms":["university-specific","college-specific","school-specific"],"antonyms":["standardized","national","statewide"]}],"etymology":{"value":"Combination of \"institution\" (an established organization or corporation) and \"specific\" (clearly defined or identified).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌɪnstɪˈtjuːʃən spəˈsɪfɪk/","syllables":"in-sti-tu-tion spe-ci-fic"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"\"Institution-specific\" is used to describe something that is unique to or designed for a particular institution. This could be a policy, procedure, program, or any other aspect of the institution's operations. It emphasizes that the item in question is not generally applicable but is tailored to the specific needs and characteristics of the institution. The term is often used in academic, governmental, and corporate contexts.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The policy is specific to the institution.","correct":"✓ The policy is institution-specific.","note":"While both are grammatically correct, \"institution-specific\" is a more concise and commonly used term."},{"incorrect":"✗ This is a specific institution policy.","correct":"✓ This is an institution-specific policy.","note":"The correct order is \"institution-specific\" before the noun it modifies."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["institution","specific","tailored","customized","localized"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"institution-specific\" is a relatively formal and specialized term. It is most commonly used in academic, professional, and governmental contexts to describe something that is unique to or designed for a particular institution. Understanding the meaning of \"institution\" and \"specific\" is helpful in understanding the meaning of the combined term. It is not a commonly used term in everyday conversation."},"example_sentences":[{"sentence":"The university offers institution-specific grants for research projects.","translation":"その大学は、研究プロジェクトのために機関固有の助成金を提供しています。","type":"adjective","meaning_category":"特定の機関に特有の"},{"sentence":"The hospital has institution-specific protocols for handling infectious diseases.","translation":"その病院には、感染症を取り扱うための機関固有のプロトコルがあります。","type":"adjective","meaning_category":"特定の機関に特有の"},{"sentence":"The company developed institution-specific software to manage its internal operations.","translation":"その会社は、内部業務を管理するために機関固有のソフトウェアを開発しました。","type":"adjective","meaning_category":"特定の機関に特有の"}]}