{"word":"profraternity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に米国)男子学生社交クラブを支持する立場、またはそのようなクラブの支持者","english_definition":"(mainly US) A position that supports male student social clubs, or a supporter of such clubs.","examples":[{"sentence":"The university's decision to ban fraternities sparked a debate between profraternity and antifraternity groups.","translation":"大学のフラタニティ禁止の決定は、フラタニティ支持派と反対派のグループ間の議論を引き起こした。"},{"sentence":"He is a vocal profraternity advocate, arguing that fraternities provide valuable leadership opportunities.","translation":"彼は声高なフラタニティ支持者であり、フラタニティは貴重なリーダーシップの機会を提供すると主張している。"}],"collocations":["profraternity stance","profraternity advocate","profraternity sentiment"],"synonyms":["fraternity supporter","fraternity advocate"],"antonyms":["antifraternity","fraternity critic"]}],"etymology":{"value":"\"pro-\" (支持) + \"fraternity\" (男子学生社交クラブ)","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊfrəˈtɜːrnɪti/","syllables":"pro-fra-ter-ni-ty"},"inflection":{"noun_plural":"profraternities"},"usage_notes":{"explanation":"\"profraternity\" は、男子学生社交クラブ（フラタニティ）の存在や活動を支持する立場や人を指す言葉です。大学やカレッジにおけるフラタニティの役割や価値について議論される文脈で用いられることが多いです。反対の立場は \"antifraternity\" と呼ばれます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pro-fraternity member.","correct":"✓ He is a profraternity advocate. / ✓ He is a member of a fraternity.","note":"\"profraternity\" は形容詞ではなく名詞（または形容詞的に使われる名詞）なので、メンバーを指す場合は \"profraternity advocate\" や \"member of a fraternity\" のように表現します。"},{"incorrect":"✗ The profraternity is very important for him.","correct":"✓ The profraternity stance is very important for him. / ✓ Fraternities are very important for him.","note":"\"profraternity\" は立場や支持を意味するので、重要性を表す場合は \"profraternity stance\" や \"Fraternities are important\" のように表現します。"}],"priority":"★★☆"},"related_words":{"derivatives":["pro-fraternity (形容詞)"],"related_terms":["fraternity","antifraternity","Greek life"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"profraternity\" is a specialized term primarily used in the context of higher education, particularly in the United States. It refers to the support of fraternities, which are male student social organizations. Understanding this term requires familiarity with the concept of fraternities and the debates surrounding their role in universities. It is not a commonly used word outside of these specific contexts."},"example_sentences":[{"sentence":"The profraternity group organized a rally to protest the proposed ban on Greek life.","translation":"フラタニティ支持団体は、ギリシャ文化の禁止案に抗議するために集会を組織した。","type":"noun","meaning_category":"支持者"},{"sentence":"His profraternity views were challenged by students concerned about hazing and alcohol abuse.","translation":"彼のフラタニティ支持の考えは、しごきやアルコール乱用を懸念する学生たちから異議を唱えられた。","type":"adjective (attributive)","meaning_category":"支持の立場"}]}