{"word":"protozoic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"原生動物の、原生動物に関する","english_definition":"Relating to or characteristic of protozoa.","examples":[{"sentence":"Protozoic diseases can be difficult to treat.","translation":"原生動物による病気は治療が難しいことがあります。"},{"sentence":"The protozoic organisms were observed under a microscope.","translation":"原生動物の生物が顕微鏡で観察されました。"}],"collocations":["protozoic disease (原生動物病)","protozoic organism (原生動物)"],"synonyms":["protozoal"],"antonyms":[]}],"etymology":{"value":"\"Protozoic\" comes from the combination of \"proto-\" (meaning first) and \"-zoic\" (relating to animals or life), referring to the earliest or simplest forms of animal life.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊtəˈzoʊɪk/","syllables":"pro-to-zo-ic"},"inflection":{"notes":"This word is an adjective and does not have different forms for gender or number."},"usage_notes":{"explanation":"The term \"protozoic\" is primarily used in scientific and biological contexts to describe something related to protozoa, which are single-celled eukaryotic microorganisms. It is not a commonly used word in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The protozoic era was a long time ago.","correct":"✓ The Proterozoic eon was a long time ago.","note":"\"Protozoic\" refers to protozoa, while \"Proterozoic\" refers to a geological eon. They are different terms."}],"priority":"★★☆"},"related_words":{"derivatives":["protozoa (名詞: 原生動物)","protozoan (名詞: 原生動物)","protozoology (名詞: 原生動物学)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"protozoic\" is a technical term used in biology and related fields. It refers to something related to protozoa, which are single-celled eukaryotic microorganisms. Understanding this term requires a background in biology or a related scientific discipline."},"example_sentences":[{"sentence":"The scientists studied the protozoic parasites in the water sample.","translation":"科学者たちは、水サンプル中の原生動物の寄生虫を研究しました。","type":"adjective","meaning_category":"原生動物の"},{"sentence":"Protozoic infections are a significant health concern in many regions.","translation":"原生動物感染症は、多くの地域で重要な健康上の懸念事項です。","type":"adjective","meaning_category":"原生動物に関する"}]}