{"word":"cynical-eyed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"冷笑的な目をした、皮肉屋の目をした","english_definition":"having a cynical or skeptical expression in one's eyes; viewing the world with distrust or pessimism.","examples":[{"sentence":"The detective gave the suspect a cynical-eyed look, clearly not believing his story.","translation":"刑事は容疑者に冷笑的な目を向け、彼の話を全く信じていない様子だった。"},{"sentence":"She had a cynical-eyed view of politics after years of corruption.","translation":"彼女は何年も汚職を見てきたので、政治に対して皮肉屋のような見方をしていた。"},{"sentence":"His cynical-eyed commentary often cut through the idealism of the group.","translation":"彼の冷笑的な視点からのコメントは、しばしばグループの理想主義を打ち砕いた。"}],"collocations":["cynical-eyed look (冷笑的な目つき)","cynical-eyed view (皮肉屋のような見方)","cynical-eyed gaze (冷笑的な眼差し)","cynical-eyed expression (冷笑的な表情)"],"synonyms":["skeptical-eyed","distrustful-eyed","pessimistic-eyed","jaundiced-eyed","suspicious-eyed"],"antonyms":["naive-eyed","trusting-eyed","optimistic-eyed","idealistic-eyed"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"cynical\" (characterized by a distrust of human sincerity or integrity) with \"eyed\" (having eyes of a specified kind).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪnɪkəl aɪd/","syllables":"cin-i-cal-eyed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Cynical-eyed\" is a descriptive adjective used to convey a sense of skepticism, distrust, or pessimism in someone's gaze. It suggests that the person views the world or specific situations with a critical and often negative perspective. The term is relatively uncommon but can be effective in creating a vivid image of a character or person.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was cynical-eyed about everything, it made him unhappy.","correct":"✓ He was cynical-eyed about everything, which made him unhappy.","note":"When using \"cynical-eyed\" as a descriptive adjective, ensure that the sentence structure is correct. The phrase modifies a noun and should be integrated smoothly into the sentence."},{"incorrect":"✗ She looked at the situation cynical-eyed.","correct":"✓ She had a cynical-eyed look at the situation.","note":"\"Cynical-eyed\" is an adjective, so it should modify a noun (e.g., look, view, expression) rather than being used adverbially."}],"priority":"★☆☆"},"related_words":{"derivatives":["cynical (adjective: 冷笑的な、皮肉な)","cynicism (noun: 冷笑主義、皮肉)","eyed (adjective: 目を持った、～の目をした)"],"phrases":["look askance (疑いの目で見る)","raise an eyebrow (眉をひそめる)","give the side-eye (横目で見る)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"cynical-eyed\" is relatively advanced and not commonly used. It implies a deep-seated skepticism or distrust that is visible in a person's eyes. Understanding the word requires familiarity with the concept of cynicism and the ability to interpret subtle emotional cues. It is more likely to be encountered in literature or descriptive writing than in everyday conversation."},"example_sentences":[{"sentence":"The old man gave the politician a cynical-eyed stare, unimpressed by his promises.","translation":"その老人は政治家の約束に感銘を受けず、冷笑的な目で彼を睨みつけた。","type":"general","meaning_category":"冷笑的な目をした"},{"sentence":"Her cynical-eyed assessment of the company's prospects proved to be accurate.","translation":"彼女の会社の見通しに対する皮肉屋のような評価は、正確であることが証明された。","type":"general","meaning_category":"皮肉屋の目をした"},{"sentence":"The journalist's cynical-eyed reporting exposed the corruption within the government.","translation":"そのジャーナリストの冷笑的な視点からの報道は、政府内の汚職を暴露した。","type":"general","meaning_category":"冷笑的な目をした"}]}