{"word":"sister-wife","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(主にモルモン教原理主義において)一人の男性と結婚している複数の女性の一人。","english_definition":"One of several women married to the same man, typically in a polygamous relationship, especially within Mormon fundamentalist communities.","examples":[{"sentence":"In some fundamentalist Mormon communities, men have multiple sister-wives.","translation":"一部のモルモン教原理主義のコミュニティでは、男性は複数のシスターワイフを持つ。"},{"sentence":"She lives with her husband and his other sister-wives.","translation":"彼女は夫と彼の他のシスターワイフたちと一緒に暮らしている。"}],"collocations":["plural marriage","polygamous family","fundamentalist Mormon","co-wife"],"synonyms":["co-wife","polygamous wife"],"antonyms":["only wife","sole wife"]}],"etymology":{"value":"「sister」と「wife」の複合語で、複婚関係にある妻同士の関係性を示す。モルモン教原理主義の文脈で、妻同士が「姉妹」のような関係にあることを表すために用いられる。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪstər waɪf/","syllables":"sis-ter-wife"},"inflection":{"noun_plural":"sister-wives"},"usage_notes":{"explanation":"「**sister-wife**」という言葉は、主にモルモン教原理主義のコミュニティにおける複婚（一夫多妻）関係にある妻たちを指すために使われます。この言葉は、妻同士が互いを「姉妹」のように見なす関係性を示唆しています。ただし、この用語は論争の的となることもあり、使用には注意が必要です。主流のモルモン教（末日聖徒イエス・キリスト教会）は、1890年に複婚を公式に放棄しており、現代の教会は一夫一妻制を支持しています。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is my sister-wife, but we are biologically related.","correct":"✓ She is my sister-wife, but we are not biologically related.","note":"「sister-wife」は、生物学的な姉妹関係を意味しません。複婚関係にある妻同士を指す言葉です。"},{"incorrect":"✗ He has a sister-wife and a brother-husband.","correct":"✓ He has a sister-wife.","note":"「brother-husband」という言葉は一般的ではありません。複婚は通常、一人の男性が複数の女性と結婚する形で行われます。"}],"priority":"★★☆"},"related_words":{"derivatives":["polygamy (一夫多妻制、複婚)","polygynous (一夫多妻の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常に特殊な用語)","frequency_google_ngram":"低頻度 (Low frequency) - 特定の文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**sister-wife**」は、モルモン教原理主義における複婚関係にある妻の一人を指す専門用語です。この言葉は、妻同士が互いを「姉妹」のように見なす関係性を示唆しますが、生物学的な姉妹関係を意味するものではありません。この用語は、特定の文化的・宗教的背景を持つコミュニティでのみ使用され、一般的な英語の語彙ではありません。使用する際には、その意味と文脈を理解しておく必要があります。"},"example_sentences":[{"sentence":"The documentary explored the lives of women in a polygamous family, focusing on the relationships between the sister-wives.","translation":"そのドキュメンタリーは、複婚家族の女性たちの生活を探求し、シスターワイフ同士の関係に焦点を当てた。","type":"noun","meaning_category":"複婚関係にある妻"},{"sentence":"She described the challenges and joys of being a sister-wife in a close-knit community.","translation":"彼女は緊密なコミュニティでシスターワイフであることの課題と喜びについて語った。","type":"noun","meaning_category":"複婚関係にある妻"}]}