{"word":"licensor","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ライセンサー、許諾者、許可を与える人（企業、組織など）","english_definition":"A person, company, or organization that grants a license to someone else.","examples":[{"sentence":"The licensor retains ownership of the intellectual property.","translation":"ライセンサーは知的財産権の所有権を保持します。"},{"sentence":"The licensor and licensee must agree on the terms of the license agreement.","translation":"ライセンサーとライセンシーは、ライセンス契約の条件に合意しなければなりません。"},{"sentence":"The software company acted as the licensor for its patented technology.","translation":"そのソフトウェア会社は、特許技術のライセンサーとして活動しました。"}],"collocations":["licensor agreement","licensor fee","intellectual property licensor","exclusive licensor","sole licensor"],"synonyms":["grantor","permitter","authorizer"],"antonyms":["licensee"]},{"part_of_speech":"noun","definition":"（特に知的財産権の）使用許諾者","english_definition":"The owner of intellectual property rights who grants a license to another party to use those rights.","examples":[{"sentence":"As the licensor, they control how their brand is used.","translation":"ライセンサーとして、彼らは自社のブランドがどのように使用されるかを管理します。"},{"sentence":"The licensor is responsible for ensuring the quality of the licensed product.","translation":"ライセンサーは、ライセンスされた製品の品質を保証する責任があります。"}],"collocations":["trademark licensor","patent licensor","copyright licensor"],"synonyms":["intellectual property owner","rights holder"],"antonyms":["licensee"]}],"etymology":{"value":"From 'license' + '-or'. 'License' comes from the Latin word 'licentia', meaning 'freedom to do something'. The suffix '-or' indicates the person or entity that performs the action.","priority":"★★★"},"pronunciation":{"ipa":"/ˈlaɪsənsər/","syllables":"li-cen-sor"},"inflection":{"noun_plural":"licensors"},"usage_notes":{"explanation":"The term 'licensor' is most commonly used in the context of intellectual property, such as patents, trademarks, and copyrights. It refers to the party that owns the rights and grants permission to another party (the licensee) to use those rights under specific terms and conditions. The licensor typically receives royalties or other compensation in exchange for granting the license.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The licensor must pay royalties to the licensee.","correct":"The licensee must pay royalties to the licensor.","note":"The licensee pays the licensor, not the other way around."},{"incorrect":"The licensor is the one who receives the license.","correct":"The licensor is the one who grants the license.","note":"The licensor grants the license; the licensee receives it."}],"priority":"★★☆"},"related_words":{"derivatives":["license","licensee","licensing"],"phrases":["license agreement","royalty payment","intellectual property rights"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in legal and business contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'licensor' is a formal term primarily used in legal and business contexts, specifically related to intellectual property. It refers to the entity that owns the rights and grants permission to another party (the licensee) to use those rights. Understanding this term requires familiarity with concepts like licenses, intellectual property, and legal agreements. It is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The **licensor** granted the company exclusive rights to use the patent.","translation":"ライセンサーはその会社に、特許を使用する独占的権利を付与しました。","type":"noun","meaning_category":"許諾者"},{"sentence":"As the **licensor**, they are responsible for enforcing the terms of the agreement.","translation":"ライセンサーとして、彼らは契約条件を履行する責任があります。","type":"noun","meaning_category":"許諾者"},{"sentence":"The **licensor** carefully reviews each application before granting a license.","translation":"ライセンサーは、ライセンスを付与する前に各申請書を注意深く審査します。","type":"noun","meaning_category":"許諾者"}]}