{"word":"fanger","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(スラング) 魅力的な人、特にゴスまたはオルタナティブファッションの女性","english_definition":"(slang) An attractive person, especially a woman in goth or alternative fashion.","examples":[{"sentence":"She's a total fanger, always rocking the coolest goth outfits.","translation":"彼女は完全なファンガーで、いつも最高のゴスファッションを着こなしている。"},{"sentence":"Look at that fanger over there, she's got amazing style.","translation":"あそこのファンガーを見て、彼女は素晴らしいスタイルを持っている。"}],"collocations":["goth fanger","alternative fanger"],"synonyms":["goth","alternative girl","scene queen"],"antonyms":[],"notes":"This term is slang and may be considered offensive by some."}],"etymology":{"value":"Likely a blend of 'fang' (referring to the stereotypical vampire-like appearance often associated with goth fashion) and 'banger' (British slang for an attractive person).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈfæŋər/","syllables":"fang-er"},"inflection":{"noun_plural":"fangers"},"usage_notes":{"explanation":"'Fanger' is a slang term, primarily used online and in subcultures associated with goth and alternative fashion. It is used to describe an attractive person, typically a woman, who embodies these styles. Use with caution as it may be considered objectifying or offensive.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'fanger' is slang and specific to certain subcultures. It is not widely used and may not be understood by those outside of these groups. Its usage can be considered offensive or objectifying depending on the context and the individual's perspective."},"example_sentences":[{"sentence":"The club was full of fangers dressed in black lace and leather.","translation":"クラブは黒いレースと革に身を包んだファンガーでいっぱいだった。","type":"noun","meaning_category":"attractive goth/alternative person"}]}