{"word":"amending","priority":"★★☆","meanings":[{"part_of_speech":"verb (gerund/present participle)","definition":"(法律、文書など)を修正すること、改正すること、修正案を出すこと","english_definition":"The act of making changes to a law, document, statement, etc., in order to correct or improve it.","examples":[{"sentence":"The amending of the constitution requires a two-thirds majority.","translation":"憲法の改正には3分の2以上の賛成が必要です。"},{"sentence":"We are currently amending the contract to reflect the new agreement.","translation":"現在、新しい合意を反映させるために契約書を修正しています。"},{"sentence":"Amending the proposal will make it more acceptable to all parties.","translation":"提案を修正することで、すべての関係者にとってより受け入れやすくなるでしょう。"}],"collocations":["amending legislation (法律の改正)","amending a bill (法案の修正)","amending a constitution (憲法の改正)","amending regulations (規則の改正)","amending procedures (手続きの修正)"],"synonyms":["revising","altering","modifying","editing","correcting","improving"],"antonyms":["worsening","damaging","invalidating"]}],"etymology":{"value":"The word 'amending' comes from the verb 'amend', which originates from the Latin word 'emendare', meaning 'to free from fault, correct'. This is further derived from 'ex-' (out of) and 'menda' (fault, blemish).","priority":"★★☆"},"pronunciation":{"ipa":"/əˈmɛndɪŋ/","syllables":"a-mend-ing"},"inflection":{"verb_forms":{"present_simple":["amend","amends"],"past_simple":"amended","past_participle":"amended","present_participle":"amending"}},"usage_notes":{"explanation":"'Amending' is the gerund or present participle form of the verb 'amend'. It is typically used to describe the process of making formal changes or improvements to something, especially legal or official documents. It often implies a careful and deliberate process of revision.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is amending about the report.","correct":"✓ He is amending the report.","note":"'Amend' is a transitive verb and usually takes a direct object (the thing being amended). The preposition 'about' is not needed in this context."},{"incorrect":"✗ Amending is good for the document improve.","correct":"✓ Amending is good for improving the document. / ✓ Amending the document is good for its improvement.","note":"The sentence structure should be grammatically correct. 'Amending' as a gerund acts as a noun, so the following phrase should be a gerund or a noun phrase."}],"priority":"★★☆"},"related_words":{"derivatives":["amend (verb): to make minor changes in (a text) in order to make it fairer, more accurate, or more up-to-date.","amendment (noun): a minor change or addition designed to improve a text, piece of legislation, etc.","amendable (adjective): capable of being amended."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, common in legal and formal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amending' refers to the act of making formal changes, usually to improve or correct something like a law or a document. It suggests a careful process of revision to make things more accurate or acceptable. This word is often used in legal, political, or official settings."},"example_sentences":[{"sentence":"The committee is currently amending the regulations regarding environmental protection.","translation":"委員会は現在、環境保護に関する規則を改正しています。","type":"verb (gerund)","meaning_category":"修正すること"},{"sentence":"Amending the agreement requires the consent of all parties involved.","translation":"合意を修正するには、関係者全員の同意が必要です。","type":"verb (gerund)","meaning_category":"修正すること"},{"sentence":"She is amending her statement to clarify her position on the issue.","translation":"彼女は問題に対する自身の立場を明確にするために声明を修正しています。","type":"verb (present participle)","meaning_category":"修正すること"},{"sentence":"The process of amending the constitution is complex and time-consuming.","translation":"憲法を改正するプロセスは複雑で時間がかかります。","type":"verb (gerund)","meaning_category":"改正すること"}]}