{"word":"unarticulatory","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"音声器官の調音を伴わない、または調音的でない","english_definition":"Not involving or relating to articulation, especially of speech sounds.","examples":[{"sentence":"The sound was described as an unarticulatory vocalization.","translation":"その音は、非調音的な発声として記述された。"},{"sentence":"Unarticulatory gestures can still convey meaning.","translation":"非調音的なジェスチャーでも意味を伝えることができる。"}],"collocations":["unarticulatory sound","unarticulatory gesture","unarticulatory vocalization"],"synonyms":["nonarticulatory"],"antonyms":["articulatory"]}],"etymology":{"value":"\"un-\" (否定) + \"articulatory\" (調音的な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnɑːrˈtɪkjələtɔːri/","syllables":"un-ar-tic-u-la-to-ry"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"Unarticulatory\" is primarily used in linguistics, phonetics, and related fields to describe sounds or gestures that do not involve the physical movements of the articulators (tongue, lips, teeth, etc.) in the vocal tract that are typical of speech. It is often used to contrast with sounds that are produced through precise articulatory movements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unarticulatory speaker was difficult to understand.","correct":"✓ The speaker's message was unarticulatory.","note":"\"Unarticulatory\" describes the nature of the sound or message, not the speaker themselves. A speaker might be inarticulate (unable to express themselves clearly), but their speech cannot be unarticulatory. The message can be unarticulatory."}],"priority":"★★☆"},"related_words":{"derivatives":["articulation","articulatory","inarticulate"],"phrases":["unarticulatory phonetics"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C2","text":"The term \"unarticulatory\" is a technical term primarily used in the fields of phonetics and linguistics. It describes something that does not involve the physical movements of the articulators (tongue, lips, teeth, etc.) in the vocal tract during speech production. It is a relatively rare word and is typically encountered in academic or specialized contexts. Understanding this term requires familiarity with the concepts of articulation and phonetics."},"example_sentences":[{"sentence":"The infant produced unarticulatory sounds, such as cries and gurgles.","translation":"その乳児は、泣き声やゴロゴロという音など、非調音的な音を発した。","type":"adjective","meaning_category":"describing sounds"},{"sentence":"The researcher studied the unarticulatory aspects of sign language.","translation":"研究者は、手話の非調音的な側面を研究した。","type":"adjective","meaning_category":"describing aspects of communication"}]}