{"word":"Episcopalism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"監督制、主教制 (教会組織において、主教が重要な権威を持つ制度)","english_definition":"A system of church government by bishops; the principles, constitution, or usages of an episcopal church.","examples":[{"sentence":"Episcopalism is a form of church governance found in various Christian denominations.","translation":"監督制は、様々なキリスト教宗派に見られる教会統治の一形態です。"},{"sentence":"The Episcopal Church in the United States follows the principles of Episcopalism.","translation":"米国聖公会は、監督制の原則に従っています。"}],"collocations":["Episcopal Church (聖公会)","episcopal succession (主教の継承)","episcopal authority (主教の権威)"],"synonyms":["prelacy","hierarchical church government"],"antonyms":["Congregationalism","Presbyterianism"]}],"etymology":{"value":"From 'episcopal' (relating to bishops), which comes from the Greek 'episkopos' (overseer, bishop).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈpɪskəpəlɪzəm/","syllables":"E-pis-co-pal-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Episcopalism refers to a specific form of church governance where bishops hold significant authority. It is distinct from other forms such as Presbyterianism (governed by elders) and Congregationalism (governed by individual congregations). The term is often associated with the Anglican Communion (including the Episcopal Church in the United States) and other churches that maintain a historical episcopate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices Episcopal.","correct":"✓ He practices Episcopalism.","note":"'Episcopal' is an adjective, while 'Episcopalism' is the noun referring to the system or practice."}],"priority":"★☆☆"},"related_words":{"derivatives":["episcopal (adjective)","episcopalian (noun/adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Episcopalism' is a term referring to a specific type of church governance where bishops have authority. It's a relatively uncommon word, primarily used in religious or historical contexts when discussing church structures. Understanding the term requires familiarity with different forms of church organization.","priority":"★☆☆"},"example_sentences":[{"sentence":"The debate centered on whether the church should adopt Episcopalism.","translation":"議論は、教会が監督制を採用すべきかどうかに集中した。","type":"noun","meaning_category":"監督制"},{"sentence":"Episcopalism ensures a line of apostolic succession through its bishops.","translation":"監督制は、主教を通じて使徒継承の系統を保証する。","type":"noun","meaning_category":"監督制"}]}