{"word":"bania","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(東欧・ロシアなどの)蒸し風呂、サウナ","english_definition":"A type of bathhouse or steam room originating in Eastern Europe and Russia.","examples":[{"sentence":"After a long day of work, he relaxed in the bania.","translation":"仕事で疲れた一日の後、彼はバーニャでリラックスした。"},{"sentence":"The traditional Russian bania uses birch branches to massage the skin.","translation":"伝統的なロシアのバーニャでは、白樺の枝を使って肌をマッサージする。"}],"collocations":["Russian bania (ロシアのバーニャ)","go to the bania (バーニャに行く)","steam bania (スチームバーニャ)"],"synonyms":["sauna","steam bath","bathhouse"],"antonyms":[]}],"etymology":{"value":"The word \"bania\" is derived from Proto-Slavic *banja, which referred to a bath or bathing establishment. It is related to the word for bath in various Slavic languages.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɑːnjə/","syllables":"ba-nia"},"inflection":{"noun_plural":"banias"},"usage_notes":{"explanation":"A bania is more than just a sauna; it's a social and cultural tradition in many Eastern European countries. It typically involves a wooden room heated to a high temperature, where people sweat and often beat themselves with leafy branches (usually birch or oak) to improve circulation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the banja to swim.","correct":"✓ I went to the bania to sweat and relax.","note":"Banias are not for swimming; they are for sweating and cleansing."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Not applicable (cultural term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"bania\" refers to a specific type of steam bath common in Eastern Europe, particularly Russia. Understanding this word requires some familiarity with Eastern European culture. It's not a widely used word in general English, so it's more likely to be encountered in contexts discussing cultural practices or travel related to those regions."},"example_sentences":[{"sentence":"The village had a small, communal bania.","translation":"その村には小さな共同バーニャがあった。","type":"noun","meaning_category":"蒸し風呂"},{"sentence":"He enjoyed the intense heat of the bania.","translation":"彼はバーニャの強烈な熱を楽しんだ。","type":"noun","meaning_category":"蒸し風呂"}]}