{"word":"Jesuits","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"イエズス会士","english_definition":"Members of the Society of Jesus, a Roman Catholic order of priests founded by St. Ignatius Loyola in 1540.","examples":[{"sentence":"The Jesuits established many schools and missions around the world.","translation":"イエズス会士は世界中に多くの学校と伝道所を設立した。"},{"sentence":"He was educated by the Jesuits.","translation":"彼はイエズス会によって教育を受けた。"}],"collocations":["Jesuit priest","Jesuit education","Jesuit order","Society of Jesus"],"synonyms":["Society of Jesus","members of the Society of Jesus"],"antonyms":[]}],"etymology":{"value":"From the Latin 'Iesuitae', derived from 'Iesus' (Jesus).","priority":"★★☆"},"pronunciation":{"ipa":"ˈdʒɛʒuɪts","syllables":"Je-su-its"},"inflection":{"noun_plural":"Jesuits"},"usage_notes":{"explanation":"'Jesuits' refers specifically to the members of the Society of Jesus, a religious order within the Catholic Church. They are known for their work in education, missionary activities, and intellectual pursuits. The term is always plural as it refers to multiple members or the group as a whole.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Jesuit.","correct":"✓ He is a Jesuit priest. / ✓ He is a member of the Jesuits.","note":"While 'Jesuit' can sometimes be used to refer to an individual, it's more common to specify 'Jesuit priest' or 'member of the Jesuits' for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["Jesuitical (adjective: characteristic of Jesuits, sometimes used pejoratively to mean cunning or deceptive)","Jesuitism (noun: the principles and practices of the Jesuits)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in historical or religious contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Jesuits' refers to members of the Society of Jesus, a Roman Catholic religious order. Understanding this term requires some familiarity with religious history and Catholic Church structure. The word itself is straightforward, but its usage is often found in contexts discussing education, missionary work, or historical events related to the Catholic Church.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Jesuits** played a significant role in the Counter-Reformation.","translation":"イエズス会士は対抗宗教改革において重要な役割を果たした。","type":"noun","meaning_category":"イエズス会士"},{"sentence":"Many prominent scientists and philosophers have been **Jesuits**.","translation":"多くの著名な科学者や哲学者がイエズス会士であった。","type":"noun","meaning_category":"イエズス会士"},{"sentence":"The **Jesuits** are known for their rigorous academic standards.","translation":"イエズス会は厳格な学術水準で知られている。","type":"noun","meaning_category":"イエズス会士"}]}