{"word":"Glossophagine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A member of the Glossophaginae subfamily of bats, characterized by their long tongues adapted for feeding on nectar and pollen.","english_definition":"A bat belonging to the subfamily Glossophaginae, known for their elongated snouts and tongues adapted for feeding on nectar and pollen from flowers.","examples":[{"sentence":"The glossophagine bats play a crucial role in pollinating various species of cacti.","translation":"舌口コウモリ亜科のコウモリは、さまざまな種類のサボテンの受粉において重要な役割を果たしています。"},{"sentence":"Glossophagine bats are found primarily in the tropical regions of the Americas.","translation":"舌口コウモリ亜科のコウモリは、主にアメリカ大陸の熱帯地域に生息しています。"}],"collocations":["nectar-feeding glossophagine","pollinating glossophagine","tropical glossophagine","glossophagine bat species"],"synonyms":["nectar bat","long-tongued bat"],"antonyms":[]}],"etymology":{"value":"From the scientific subfamily name 'Glossophaginae,' derived from 'glosso-' (tongue) + '-phagine' (eating), referring to their diet of nectar and pollen which they collect with their long tongues.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡlɒsəˈfeɪdʒiːn/","syllables":"glos-so-pha-gine"},"inflection":{"noun_plural":"Glossophagines"},"usage_notes":{"explanation":"'Glossophagine' is primarily used in scientific and zoological contexts when discussing bats of the Glossophaginae subfamily. These bats are ecologically significant as pollinators. The term is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A glossophagine is a type of bird.","correct":"✓ A glossophagine is a type of bat.","note":"Glossophagines are bats, not birds."},{"incorrect":"✗ Glossophagines eat only insects.","correct":"✓ Glossophagines eat nectar and pollen.","note":"Glossophagines primarily feed on nectar and pollen."}],"priority":"★★☆"},"related_words":{"derivatives":["Glossophaginae (subfamily)","Glossophaga (genus)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Glossophagine' is a scientific term referring to a specific subfamily of bats known for their nectar- and pollen-feeding habits. Due to its specialized nature, it is primarily used in academic or zoological contexts. Understanding the term requires knowledge of biological classifications and bat ecology."},"example_sentences":[{"sentence":"The study focused on the foraging behavior of glossophagine bats in the rainforest.","translation":"その研究は、熱帯雨林における舌口コウモリ亜科のコウモリの採餌行動に焦点を当てた。","type":"noun","meaning_category":"animal"},{"sentence":"Glossophagine bats are essential pollinators for many tropical plant species.","translation":"舌口コウモリ亜科のコウモリは、多くの熱帯植物種の重要な送粉者である。","type":"noun","meaning_category":"animal"}]}