{"word":"fire-brand","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"火付け棒、燃えさし","english_definition":"a piece of burning wood","examples":[{"sentence":"He used a fire-brand to light the campfire.","translation":"彼は火付け棒を使ってキャンプファイヤーに火をつけた。"}],"collocations":[],"synonyms":["ember","burning stick"],"antonyms":[]},{"part_of_speech":"noun","definition":"扇動者、お騒がせ者","english_definition":"a person who is passionate about a particular cause, typically inciting change and unrest.","examples":[{"sentence":"The politician was labeled a fire-brand for his controversial speeches.","translation":"その政治家は物議を醸す演説で扇動者とされた。"},{"sentence":"She is a fire-brand who is always fighting for social justice.","translation":"彼女は常に社会正義のために戦っている扇動者だ。"}],"collocations":[],"synonyms":["agitator","rabble-rouser","instigator","radical"],"antonyms":["peacemaker","conciliator"]}],"etymology":{"value":"'Fire' + 'brand' (burning piece of wood). The figurative sense of 'agitator' arose from the idea of someone who stirs up trouble like a burning brand sets things alight.","priority":"★★☆"},"pronunciation":{"ipa":"ˈfaɪərˌbrænd","syllables":"fire-brand"},"inflection":{"noun_plural":"fire-brands"},"usage_notes":{"explanation":"'Fire-brand' can refer literally to a piece of burning wood, but it is more commonly used figuratively to describe someone who is a troublemaker or an agitator. The figurative sense carries a negative connotation, implying that the person is stirring up conflict and unrest.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a firebrand for peace.","correct":"He is a peacemaker.","note":"A firebrand is someone who stirs up conflict, so it's not appropriate to use it for someone who promotes peace."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'fire-brand' has both a literal and figurative meaning. The literal meaning refers to a piece of burning wood, but this usage is rare. The figurative meaning refers to a person who is an agitator or troublemaker, stirring up conflict and unrest. This usage is more common, but still relatively infrequent. The word carries a negative connotation."},"example_sentences":[{"sentence":"The protesters carried fire-brands as they marched through the streets.","translation":"抗議者たちは街をデモ行進する際に火付け棒を掲げた。","type":"noun","meaning_category":"火付け棒"},{"sentence":"He was known as a political fire-brand, always challenging the status quo.","translation":"彼は現状に常に異議を唱える政治的な扇動者として知られていた。","type":"noun","meaning_category":"扇動者"}]}