{"word":"predisclose","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"（情報など）を事前に公開する、事前開示する","english_definition":"To disclose (information) in advance or beforehand.","examples":[{"sentence":"The company decided to predisclose its earnings results to avoid any surprises.","translation":"会社はサプライズを避けるために、事前に収益結果を公開することに決定した。"},{"sentence":"The government is required to predisclose certain documents to the public.","translation":"政府は特定の文書を事前に公衆に開示することが義務付けられている。"}],"collocations":["predisclose information","predisclose documents","predisclose earnings","predisclose data"],"synonyms":["reveal in advance","divulge beforehand","pre-reveal","pre-announce"],"antonyms":["withhold","conceal","suppress","hide"]}],"etymology":{"value":"The word \"predisclose\" is formed by combining the prefix \"pre-\" (meaning before) with the verb \"disclose\" (meaning to reveal or make known).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːdɪˈskloʊz/","syllables":"pre-dis-close"},"inflection":{"verb_forms":{"present_simple":["predisclose","prediscloses"],"past_simple":"predisclosed","past_participle":"predisclosed","present_participle":"predisclosing"}},"usage_notes":{"explanation":"\"Predisclose\" is typically used in formal or professional contexts, such as finance, law, or government, where transparency and early communication are important. It implies a deliberate act of making information available before it is normally expected or required.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The predisclose was made after the event.","correct":"✓ The pre-disclosure was made before the event.","note":"The prefix \"pre-\" indicates that the disclosure must occur before the event, not after. Using \"predisclose\" or \"pre-disclosure\" after the event is contradictory."},{"incorrect":"✗ They predisclosed the secret.","correct":"✓ They disclosed the secret in advance.","note":"While \"predisclose\" is a valid word, it's less common than \"disclose in advance.\" If clarity is paramount, using the phrase might be preferable."}],"priority":"★★☆"},"related_words":{"derivatives":["predisclosure (noun): the act of disclosing something in advance"],"phrasal_verbs":[],"related_concepts":["disclosure","transparency","compliance","regulation","information asymmetry"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"predisclose\" is a relatively uncommon term, primarily used in formal or technical contexts. It means to reveal information before it is normally required or expected. Understanding this word requires familiarity with the prefix \"pre-\" and the base word \"disclose.\" It is most likely to be encountered in legal, financial, or governmental documents where early transparency is mandated or practiced."},"example_sentences":[{"sentence":"The company decided to **predisclose** its financial statements to increase investor confidence.","translation":"会社は投資家の信頼を高めるために、財務諸表を事前に公開することに決定した。","type":"verb","meaning_category":"事前公開"},{"sentence":"Regulations require banks to **predisclose** certain fees to their customers.","translation":"規制により、銀行は特定の料金を顧客に事前に開示することが義務付けられている。","type":"verb","meaning_category":"事前開示"},{"sentence":"The government chose to **predisclose** the details of the new policy to allow for public feedback.","translation":"政府は国民からの意見を募るために、新しい政策の詳細を事前に公開することを選択した。","type":"verb","meaning_category":"事前公開"}]}