{"word":"Seignory","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"領主の地位、領主権、領地","english_definition":"The position or authority of a feudal lord; dominion; the territory or estate of a lord.","examples":[{"sentence":"The seignory was passed down through generations of the family.","translation":"領主権はその家族の世代を超えて受け継がれていった。"},{"sentence":"He ruled the seignory with an iron fist.","translation":"彼は鉄拳で領地を支配した。"},{"sentence":"The boundaries of the seignory were clearly marked.","translation":"領地の境界線は明確に示されていた。"}],"collocations":["feudal seignory","royal seignory","exercise seignory","grant a seignory"],"synonyms":["lordship","dominion","estate","manor","fief","territory"],"antonyms":["common land","public domain"]}],"etymology":{"value":"From Old French 'seigneurié', from 'seignor' (lord), ultimately from Latin 'senior' (older, elder).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈseɪnjəri/","syllables":"seig-no-ry"},"inflection":{"noun_plural":"seignories"},"usage_notes":{"explanation":"'Seignory' refers to the rights, authority, and territory held by a feudal lord. It is a term primarily used in historical contexts, particularly when discussing feudal systems. It encompasses not only the land itself but also the lord's power and jurisdiction over the inhabitants of that land.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He inherited the seignory of the kingdom.","correct":"✓ He inherited the throne of the kingdom. / ✓ He inherited the seignory of the manor.","note":"'Seignory' typically applies to a smaller territory or estate, not an entire kingdom. 'Throne' or 'kingship' would be more appropriate for a kingdom."},{"incorrect":"✗ The seignory was a democratic state.","correct":"✓ The seignory was a feudal estate.","note":"A seignory, by definition, involves a feudal lord and is not a democratic entity."}],"priority":"★☆☆"},"related_words":{"derivatives":["seigneurial (adjective: relating to a seignory or seigneur)","seigneur (noun: a feudal lord)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Seignory' is a specialized term related to feudalism, referring to the rights, authority, and territory of a feudal lord. It is not commonly used in modern English outside of historical or academic contexts. Understanding the concept requires knowledge of feudal systems and their hierarchical structure."},"example_sentences":[{"sentence":"The peasant owed allegiance to the lord of the seignory.","translation":"農民はその領地の領主に忠誠を誓っていた。","type":"noun","meaning_category":"領主権"},{"sentence":"The old castle was the center of the seignory's power.","translation":"その古い城は領地の権力の中心だった。","type":"noun","meaning_category":"領地"},{"sentence":"The seignory granted him the right to collect taxes from the villagers.","translation":"領主権は彼に村人から税を徴収する権利を与えた。","type":"noun","meaning_category":"領主の地位"}]}