{"word":"antiendowment","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(まれ)寄付反対、基金反対","english_definition":"(rare) Opposition to endowments or the establishment of endowments.","examples":[{"sentence":"The university faced strong antiendowment sentiment from some alumni.","translation":"大学は一部の卒業生から強い寄付反対の感情に直面した。"},{"sentence":"His antiendowment stance was controversial within the philanthropic community.","translation":"彼の基金反対の立場は慈善活動コミュニティ内で物議を醸した。"}],"collocations":["antiendowment sentiment","antiendowment stance","antiendowment movement"],"synonyms":["opposition to endowments","resistance to funding","anti-funding"],"antonyms":["pro-endowment","support for endowments","pro-funding"]}],"etymology":{"value":"\"anti-\" (反対) + \"endowment\" (寄付、基金)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiɪnˈdaʊmənt/","syllables":"an-ti-en-dow-ment"},"inflection":{"noun_plural":"antiendowments"},"usage_notes":{"explanation":"\"Antiendowment\" is a relatively rare term used to describe opposition to the concept or practice of endowments, particularly in the context of institutions like universities or charities. It can refer to concerns about the potential for endowments to create financial inequality, distort institutional priorities, or become overly focused on wealth accumulation rather than mission-driven activities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The antiendowment was successful in blocking the donation.","correct":"✓ The antiendowment group was successful in blocking the donation.","note":"\"Antiendowment\" itself is not an actor, but rather a sentiment or position. It's more accurate to refer to an \"antiendowment group\" or \"antiendowment movement.\""}],"priority":"★★☆"},"related_words":{"derivatives":["endowment","anti-","endow"],"related_concepts":["philanthropy","charity","funding","institutional finance"]},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"antiendowment\" is a specialized term related to the field of finance and philanthropy. It describes opposition to the practice of creating or maintaining endowments, which are funds set aside to support an institution or organization. This term is not commonly used in everyday language and would primarily be encountered in discussions about higher education, non-profit organizations, or financial management."},"example_sentences":[{"sentence":"The speaker presented a compelling antiendowment argument, citing concerns about long-term financial sustainability.","translation":"講演者は長期的な財政の持続可能性に関する懸念を引用して、説得力のある寄付反対の議論を展開した。","type":"noun","meaning_category":"寄付反対"},{"sentence":"An antiendowment campaign was launched by students concerned about rising tuition costs.","translation":"授業料の高騰を懸念する学生たちによって、基金反対運動が開始された。","type":"noun","meaning_category":"寄付反対"}]}