{"word":"poltophagic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"異常に熱い食べ物や飲み物を好む、または消費する傾向がある","english_definition":"Having a preference for, or a tendency to consume, abnormally hot food or drink.","examples":[{"sentence":"The poltophagic diner enjoyed the scalding soup.","translation":"その熱い食べ物好きの食事客は、熱々のスープを楽しんだ。"},{"sentence":"His poltophagic habits were a source of amusement to his friends.","translation":"彼の熱い食べ物を好む習慣は、友人たちの笑いの種だった。"}],"collocations":["poltophagic tendencies","poltophagic behavior","poltophagic diner","poltophagic habits"],"synonyms":["thermophilic (in a broader sense)"],"antonyms":["cryophilic (preference for cold)"]}],"etymology":{"value":"Derived from Greek: 'poltos' (πολτός) meaning 'gruel' or 'porridge' and '-phagic' relating to eating or consuming.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒltoʊˈfædʒɪk/","syllables":"pol-to-pha-gic"},"inflection":{"notes":"Adjective; no specific inflections beyond comparative/superlative forms (more poltophagic, most poltophagic), which are rarely used."},"usage_notes":{"explanation":"'Poltophagic' is a relatively rare and specialized term. It describes a specific preference or tolerance for extremely hot foods or beverages, beyond what is typical or comfortable for most people. It is often used in a descriptive or humorous context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is poltophagic because he likes spicy food.","correct":"✓ He is poltophagic because he likes extremely hot food, even if it burns his mouth.","note":"Poltophagia specifically refers to the temperature of the food, not its spiciness. Someone who likes spicy food is not necessarily poltophagic unless they also prefer it to be scalding hot."}],"priority":"★☆☆"},"related_words":{"derivatives":["poltophagia (noun: the practice of consuming abnormally hot food or drink)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare, not in standard CEFR vocabulary)","frequency_google_ngram":"Very low frequency - a niche term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Poltophagic' is a highly specialized term, not commonly encountered. Understanding requires knowledge of Greek root words and a specific context related to food preferences. It is unlikely to be understood by non-native speakers without explicit explanation."},"example_sentences":[{"sentence":"The chef was surprised by the customer's poltophagic request for the soup to be served at a near-boiling temperature.","translation":"シェフは、顧客からのスープを沸騰に近い温度で提供してほしいという熱い食べ物好きのリクエストに驚いた。","type":"adjective","meaning_category":"preference for hot food"},{"sentence":"His poltophagic tendencies meant he always waited only a few seconds before drinking his coffee.","translation":"彼の熱い食べ物を好む傾向は、彼がいつもコーヒーを数秒しか待たずに飲むことを意味していた。","type":"adjective","meaning_category":"preference for hot drinks"}]}