{"word":"Jujuism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"呪術信仰、ジュジュイズム：西アフリカの宗教的慣習で、物体（ジュジュ）に超自然的な力や霊が宿ると信じること。","english_definition":"A system of belief involving the use of objects (jujus) believed to have supernatural powers or to be inhabited by spirits, especially as practiced in West Africa.","examples":[{"sentence":"Jujuism is a traditional belief system found in many parts of West Africa.","translation":"ジュジュイズムは西アフリカの多くの地域で見られる伝統的な信仰体系です。"},{"sentence":"Some scholars study Jujuism to understand its role in African societies.","translation":"学者の中には、アフリカ社会におけるジュジュイズムの役割を理解するために研究する人もいます。"}],"collocations":["practice Jujuism (ジュジュイズムを実践する)","Jujuism beliefs (ジュジュイズムの信仰)","traditional Jujuism (伝統的なジュジュイズム)"],"synonyms":["animism","fetishism","traditional African religion"],"antonyms":[]}],"etymology":{"value":"「Juju」という言葉は、西アフリカの特定の言語に由来し、物体に宿ると信じられている超自然的な力を意味します。 「-ism」という接尾辞は、信仰体系または実践を示すために追加されました。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒuːdʒuːɪzəm/","syllables":"ju-ju-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"「Jujuism」は、特に西アフリカの伝統的な宗教的信仰体系を指すために使用される用語です。物体（「ジュジュ」）には超自然的な力や霊が宿っていると信じられており、儀式や実践に使用されます。この用語は、文化人類学や宗教学の研究で使われることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Jujuism.","correct":"✓ He practices Jujuism. / He is a follower of Jujuism.","note":"「Jujuism」は信仰体系の名前であり、人を指す言葉ではありません。信仰を実践する人を指す場合は、「follower of Jujuism」などと表現します。"},{"incorrect":"✗ Jujuism is only about witchcraft.","correct":"✓ Jujuism encompasses a range of beliefs and practices, including but not limited to healing, protection, and spiritual guidance.","note":"Jujuismは、単に魔術だけでなく、癒し、保護、精神的な導きなど、幅広い信仰と実践を含んでいます。"}],"priority":"★★☆"},"related_words":{"derivatives":["juju (名詞: ジュジュ、超自然的な力を持つ物体)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Jujuism」は、西アフリカの伝統的な宗教的信仰体系を指す専門用語です。この用語は、超自然的な力を持つと信じられている物体（ジュジュ）の使用を中心に展開する信仰体系を説明するために、文化人類学や宗教学などの学術的な文脈でよく使用されます。この用語は一般的な会話ではあまり使用されず、その意味を理解するには、特定の文化的および学術的な背景が必要です。"},"example_sentences":[{"sentence":"Anthropologists have studied the role of Jujuism in maintaining social order in some West African communities.","translation":"人類学者は、西アフリカの一部のコミュニティにおける社会秩序を維持する上でのジュジュイズムの役割を研究してきました。","type":"noun","meaning_category":"信仰体系"},{"sentence":"The museum exhibit featured various juju objects used in Jujuism rituals.","translation":"博物館の展示では、ジュジュイズムの儀式で使用されるさまざまなジュジュの物体が展示されていました。","type":"noun","meaning_category":"信仰体系"},{"sentence":"Understanding Jujuism requires a deep appreciation for the cultural context in which it is practiced.","translation":"ジュジュイズムを理解するには、それが実践されている文化的背景に対する深い理解が必要です。","type":"noun","meaning_category":"信仰体系"}]}