{"word":"Balau","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of hardwood timber from trees in the Shorea genus, native to Southeast Asia.","english_definition":"A durable hardwood timber originating from trees of the Shorea genus, commonly found in Southeast Asia.","examples":[{"sentence":"Balau is often used for decking and outdoor furniture due to its resistance to decay.","translation":"バローは腐食に強いため、デッキや屋外家具によく使用されます。"},{"sentence":"The balau wood had a rich, reddish-brown color.","translation":"バロー材は、豊かな赤茶色をしていました。"}],"collocations":["Balau decking","Balau timber","Balau wood","Use balau","Source balau"],"synonyms":["Shorea","Hardwood"],"antonyms":[]}],"etymology":{"value":"The name 'Balau' is derived from local languages in Southeast Asia, where these Shorea trees are native.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɑːlaʊ/","syllables":"Ba-lau"},"inflection":{"notes":"It's a noun, so the plural is 'Balaus', although it's often used as a mass noun."},"usage_notes":{"explanation":"Balau is a general term referring to several species within the Shorea genus. These trees are valued for their dense, durable timber. It is commonly used in construction, particularly for outdoor applications where resistance to weathering and decay is important.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought some balau's for my deck.","correct":"✓ I bought some balau for my deck.","note":"Balau is often used as a mass noun, so the plural form is not always necessary."}],"priority":"★★☆"},"related_words":{"derivatives":["Yellow Balau","Red Balau","Selangan Batu"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Balau is a specialized term related to forestry and woodworking. Understanding requires familiarity with timber types and their uses. It's commonly encountered in contexts related to construction, landscaping, and furniture making. "},"example_sentences":[{"sentence":"The contractor recommended balau for its long-lasting properties.","translation":"請負業者は、その長持ちする特性からバローを推奨しました。","type":"noun","meaning_category":"timber"},{"sentence":"Balau is a popular choice for outdoor decks in tropical climates.","translation":"バローは、熱帯気候の屋外デッキに人気の選択肢です。","type":"noun","meaning_category":"timber"}]}