{"word":"pasal","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にフィリピン)賃借人、テナント","english_definition":"(Philippines) tenant, lessee","examples":[{"sentence":"Ang mga pasal ay nagbayad ng upa sa may-ari ng lupa.","translation":"The tenants paid rent to the landowner.","usage_notes":"Commonly used in the Philippines, particularly in the context of land rental or property leasing."}],"collocations":["magbayad ng upa (pay rent)","may-ari ng lupa (landowner)"],"synonyms":["tenant","lessee","renter"],"antonyms":["landlord","lessor"]}],"etymology":{"value":"Likely derived from Spanish 'pasa' (to pass), referring to the passing of rent or lease payments.","priority":"★★☆"},"pronunciation":{"ipa":"/paˈsal/","syllables":"pa-sal"},"inflection":{"noun_plural":"mga pasal"},"usage_notes":{"explanation":"'Pasal' is a term primarily used in the Philippines to refer to someone who rents land or property. It's a direct equivalent of 'tenant' or 'lessee' in English. The term is most commonly encountered in discussions about land ownership, rental agreements, and property rights within the Filipino context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Siya ay isang landlord, hindi isang pasal.","correct":"Siya ay isang landlord, hindi isang tenant.","note":"'Landlord' is the opposite of 'pasal' (tenant)."},{"incorrect":"Ang pasal ay nagmamay-ari ng lupa.","correct":"Ang may-ari ng lupa ay nagmamay-ari ng lupa.","note":"The 'pasal' (tenant) does not own the land; the landowner does."}],"priority":"★★☆"},"related_words":{"derivatives":["upa (rent)","umuupa (to rent)","pag-upa (rental)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to the Philippines","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Pasal' is a specialized term used in the Philippines to mean 'tenant' or 'renter.' It's not commonly used outside of the Philippines. Understanding this word requires knowledge of Filipino culture and real estate practices. It is used in formal and informal contexts when discussing rental agreements and property rights. If you are discussing real estate in the Philippines, using 'pasal' would be appropriate and show familiarity with local customs."},"example_sentences":[{"sentence":"Ang pasal ay may karapatang manirahan sa lupa hangga't nagbabayad siya ng upa.","translation":"The tenant has the right to live on the land as long as they pay rent.","type":"noun","meaning_category":"tenant"},{"sentence":"Kailangan naming hanapin ang mga pasal para sa aming bakanteng apartment.","translation":"We need to find tenants for our vacant apartment.","type":"noun","meaning_category":"tenant"},{"sentence":"Maraming pasal ang umaasa sa agrikultura para sa kanilang kabuhayan.","translation":"Many tenants rely on agriculture for their livelihood.","type":"noun","meaning_category":"tenant"}]}