{"word":"histamine","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヒスタミン","english_definition":"A compound released by cells in response to injury and in allergic and inflammatory reactions, causing contraction of smooth muscle and dilation of capillaries.","examples":[{"sentence":"Histamine is released during allergic reactions.","translation":"ヒスタミンはアレルギー反応中に放出されます。"},{"sentence":"Antihistamines block the action of histamine.","translation":"抗ヒスタミン剤はヒスタミンの作用を遮断します。"}],"collocations":["histamine release (ヒスタミン放出)","antihistamine (抗ヒスタミン剤)","histamine receptor (ヒスタミン受容体)","high histamine foods (高ヒスタミン食品)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'histos' (Greek for tissue) + 'amine'. Coined in the early 20th century when it was discovered in tissue extracts.","priority":"★★☆"},"pronunciation":{"ipa":"ˈhɪstəmiːn","syllables":"his-ta-mine"},"inflection":{"noun_plural":"histamines"},"usage_notes":{"explanation":"Histamine is a chemical compound involved in local immune responses, as well as regulating physiological function in the gut and acting as a neurotransmitter for the brain, spinal cord, and uterus. It is particularly known for its role in allergic reactions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a histamine allergy.","correct":"✓ I have a histamine intolerance. / ✓ I have an allergy that causes histamine release.","note":"While histamine is involved in allergic reactions, it's more accurate to say you have an allergy *that causes* histamine release, or a histamine intolerance, rather than an allergy *to* histamine itself."}],"priority":"★★☆"},"related_words":{"derivatives":["antihistamine (抗ヒスタミン剤)","histaminergic (ヒスタミン作動性の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific or medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Histamine' is a technical term primarily used in medical and scientific contexts. It refers to a chemical compound that plays a key role in the body's immune and inflammatory responses. Understanding its function requires some knowledge of biology and medicine. The word is most likely encountered in discussions about allergies, inflammation, or the effects of certain medications.","priority":"★☆☆"},"example_sentences":[{"sentence":"The patient's symptoms were due to excessive histamine production.","translation":"患者の症状は、ヒスタミンの過剰な産生によるものでした。","type":"general","meaning_category":"medical"},{"sentence":"Foods high in histamine can trigger reactions in sensitive individuals.","translation":"ヒスタミンを多く含む食品は、敏感な人に反応を引き起こす可能性があります。","type":"general","meaning_category":"food/allergy"},{"sentence":"The researchers studied the effects of histamine on smooth muscle contraction.","translation":"研究者らは、平滑筋の収縮に対するヒスタミンの影響を研究しました。","type":"scientific","meaning_category":"research"}]}