{"word":"boroughwide","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"区全体の、行政区全体の","english_definition":"Extending throughout a borough; affecting or involving all parts of a borough.","examples":[{"sentence":"The council launched a boroughwide recycling program.","translation":"区議会は区全体の再利用プログラムを開始した。"},{"sentence":"The initiative aims to improve air quality boroughwide.","translation":"そのイニシアチブは、区全体の空気質を改善することを目的としている。"},{"sentence":"There is a boroughwide ban on the use of fireworks.","translation":"花火の使用は区全体で禁止されている。"}],"collocations":["boroughwide initiative","boroughwide campaign","boroughwide survey","boroughwide election","boroughwide policy","boroughwide service"],"synonyms":["citywide","areawide","regionwide"],"antonyms":["local","neighborhood","district"],"notes":"Typically used in the context of New York City or London, where boroughs are major administrative divisions."}],"etymology":{"value":"Formed by combining 'borough' (an administrative division of a city or town) with 'wide' (extending over a large area).","priority":"★★★"},"pronunciation":{"ipa":"/ˈbʌrəˌwaɪd/","syllables":"bur-ough-wide"},"inflection":{"notes":"Not applicable, as it is an adjective."},"usage_notes":{"explanation":"'Boroughwide' is used to describe something that applies to or affects the entirety of a borough. It is most commonly used in the context of New York City (with its five boroughs) and London (with its many boroughs). It indicates that a policy, program, or event is not limited to a specific neighborhood or district within the borough, but rather covers the entire administrative area.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The boroughwide is very large.","correct":"✓ The borough is very large.","note":"'Boroughwide' is an adjective and must modify a noun. 'Borough' is the noun referring to the administrative division itself."},{"incorrect":"✗ The citywide is better than the boroughwide.","correct":"✓ The citywide initiative is better than the boroughwide initiative.","note":"'Boroughwide' and 'citywide' are adjectives and must modify a noun. In this case, the noun is 'initiative'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["citywide","nationwide","statewide","worldwide"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'boroughwide' is a relatively uncommon adjective used to describe something that extends throughout an entire borough, which is a specific type of administrative division (often found in cities like New York or London). Understanding this word requires knowledge of administrative divisions and the ability to recognize compound words. Its usage is typically found in formal or official contexts, such as government reports or news articles discussing policies or initiatives affecting an entire borough."},"example_sentences":[{"sentence":"The mayor announced a boroughwide initiative to reduce homelessness.","translation":"市長は、ホームレスを減らすための区全体の取り組みを発表した。","type":"example","meaning_category":"General"},{"sentence":"The survey collected data from residents across the boroughwide area.","translation":"調査は、区全体の住民からデータを収集した。","type":"example","meaning_category":"General"},{"sentence":"The new regulations will be enforced boroughwide starting next month.","translation":"新しい規制は、来月から区全体で施行される。","type":"example","meaning_category":"General"}]}