{"word":"puppyish","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"子犬のような、子犬のような振る舞いをする、従順で熱心な","english_definition":"resembling a puppy in behavior or appearance; especially, excessively eager, enthusiastic, or submissive.","examples":[{"sentence":"He had a puppyish enthusiasm for the project.","translation":"彼はそのプロジェクトに対して子犬のような熱意を持っていた。"},{"sentence":"Her puppyish devotion to her boss was a little unsettling.","translation":"彼女の上司に対する子犬のような献身は少し不安になるほどだった。"},{"sentence":"The new recruit had a puppyish eagerness to please.","translation":"新入社員は喜んで人に尽くそうとする子犬のような熱意を持っていた。"}],"collocations":["puppyish enthusiasm","puppyish devotion","puppyish eagerness"],"synonyms":["eager","enthusiastic","submissive","fawning","ingratiating","obsequious"],"antonyms":["aloof","reserved","independent","domineering"]}],"etymology":{"value":"\"puppy\" + \"-ish\". Derived from the noun \"puppy,\" referring to a young dog, combined with the suffix \"-ish,\" which indicates resemblance or characteristic of.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʌpiɪʃ/","syllables":"pup-py-ish"},"inflection":{"adjective_forms":{"comparative":"more puppyish","superlative":"most puppyish"}},"usage_notes":{"explanation":"\"Puppyish\" is used to describe someone (or something) that exhibits qualities associated with puppies, such as eagerness, enthusiasm, and a desire to please. It often carries a slightly negative connotation, suggesting that the person is overly eager or submissive to the point of being annoying or unsettling. It can also describe a general appearance or manner that is reminiscent of a puppy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was puppyish strong.","correct":"✓ He was puppyishly enthusiastic.","note":"\"Puppyish\" is an adjective and should describe a noun. To describe the manner in which someone does something, use an adverb like \"puppyishly.\""},{"incorrect":"✗ The puppyish dog.","correct":"✓ The puppy-like dog.","note":"While \"puppyish\" is acceptable, \"puppy-like\" is a more common and natural-sounding way to describe something that resembles a puppy."}],"priority":"★★☆"},"related_words":{"derivatives":["puppy (noun)","puppy-like (adjective)","puppyishly (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR-aligned materials)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"puppyish\" is not a common word, but it's fairly easy to understand if you know what a puppy is. It means someone is acting like a puppy - very eager, enthusiastic, and wanting to please. It can sometimes have a slightly negative meaning, suggesting someone is too eager or submissive. You'll mostly find this word in more advanced or descriptive writing."},"example_sentences":[{"sentence":"His puppyish grin revealed his eagerness to start the project.","translation":"彼の犬のような笑顔は、プロジェクトを始めることへの熱意を表していた。","type":"adjective","meaning_category":"eagerness"},{"sentence":"The intern's puppyish attitude, while appreciated, sometimes bordered on being overly servile.","translation":"インターンの子犬のような態度は、感謝される一方で、時には過度に卑屈なほどだった。","type":"adjective","meaning_category":"submissiveness"},{"sentence":"She scolded him for his puppyish behavior, reminding him to maintain his composure.","translation":"彼女は彼の子犬のような振る舞いを叱り、落ち着きを保つように注意した。","type":"adjective","meaning_category":"enthusiasm"}]}