{"word":"preliterally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"文字通りに解釈される以前に、または文字通りの意味合いを持たない状態で","english_definition":"Before being interpreted literally; in a non-literal or figurative sense.","examples":[{"sentence":"The phrase was used preliterally, as a metaphor for something else entirely.","translation":"そのフレーズは文字通りではなく、全く別の何かの比喩として使われていました。"},{"sentence":"Preliterally speaking, the story is about animals, but it has a deeper meaning.","translation":"文字通りの意味合いで言えば、その物語は動物についてですが、より深い意味があります。"}],"collocations":["used preliterally","interpreted preliterally"],"synonyms":["figuratively","metaphorically","symbolically"],"antonyms":["literally","verbatim"]},{"part_of_speech":"adverb","definition":"文字通りの意味が確立する前に","english_definition":"Before a literal meaning or interpretation was established or became common.","examples":[{"sentence":"The word 'cloud' was used preliterally to describe a mass of vapor in the sky.","translation":"「雲」という言葉は、文字通りの意味で空中の水蒸気の塊を指す以前に使われていました。"}],"collocations":["used preliterally","understood preliterally"],"synonyms":["originally","formerly","previously"],"antonyms":["currently","presently"]}],"etymology":{"value":"\"pre-\" (before) + \"literally\" (in a literal manner). This indicates a state or usage that existed before a literal interpretation became standard or was applied.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriˈlɪtərəli/","syllables":"pre-lit-er-al-ly"},"inflection":{"notes":"Invariable adverb"},"usage_notes":{"explanation":"\"Preliterally\" is used to describe a state or time before a word, phrase, or concept was understood or intended in a literal sense. It often implies that the term was used figuratively, metaphorically, or in a more abstract way before its literal meaning became prominent. It can also refer to the historical evolution of a word's meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He preliterally meant what he said.","correct":"✓ He literally meant what he said.","note":"\"Preliterally\" means *before* a literal meaning was applied, so it's the opposite of \"literally.\""},{"incorrect":"✗ The book is preliterally about dragons.","correct":"✓ The book is figuratively about dragons.","note":"If the book is not literally about dragons, use \"figuratively\" or \"metaphorically\" instead of \"preliterally.\""}],"priority":"★★☆"},"related_words":{"derivatives":["literal","literally","nonliteral","figurative","metaphorical"],"related_concepts":["etymology","semantics","historical linguistics"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare; usage is primarily in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Preliterally\" is a relatively uncommon adverb used to describe something that occurred or was understood before a literal interpretation became standard. It is often used in discussions of language evolution, etymology, or the history of ideas. Because of its specialized usage, it is more likely to be encountered in academic or technical contexts. Understanding this word requires a strong grasp of the concept of literal versus figurative language.","priority":"★★☆"},"example_sentences":[{"sentence":"The myth was understood preliterally as an allegory for human experience.","translation":"その神話は、文字通りの意味で理解される以前は、人間の経験の寓意として理解されていました。","type":"adverb","meaning_category":"Figurative interpretation"},{"sentence":"Preliterally, the term 'artificial intelligence' was more about philosophical concepts than actual technology.","translation":"文字通りの意味で言うと、「人工知能」という言葉は、実際の技術よりも哲学的な概念に関するものでした。","type":"adverb","meaning_category":"Historical context"}]}