{"word":"donation-supported","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"寄付によって支えられている、寄付金で運営されている","english_definition":"Maintained or funded by donations, rather than through commercial revenue or government funding.","examples":[{"sentence":"This radio station is donation-supported, so your contributions are vital.","translation":"このラジオ局は寄付によって支えられていますので、皆様からのご支援が不可欠です。"},{"sentence":"The organization operates as a donation-supported charity.","translation":"その団体は寄付金で運営される慈善団体として活動しています。"},{"sentence":"We are a donation-supported project, relying on the generosity of individuals and organizations.","translation":"私たちは寄付金で運営されているプロジェクトであり、個人や団体の皆様からのご厚意に頼っています。"}],"collocations":["donation-supported radio station (寄付によって支えられているラジオ局)","donation-supported charity (寄付金で運営されている慈善団体)","donation-supported organization (寄付金で運営されている団体)","donation-supported project (寄付金で運営されているプロジェクト)"],"synonyms":["charity-funded","grant-funded","philanthropically-funded","nonprofit","not-for-profit"],"antonyms":["for-profit","commercial","government-funded"]}],"etymology":{"value":"The term 'donation-supported' is a compound adjective formed by combining 'donation' (a gift or contribution) and 'supported' (maintained or sustained). It directly describes the means by which something is funded or sustained.","priority":"N/A"},"pronunciation":{"ipa":"/doʊˈneɪʃən səˈpɔːrtɪd/","syllables":"do-na-tion-sup-port-ed"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"'Donation-supported' is used to describe entities like charities, organizations, or projects that rely on voluntary contributions of money or resources from individuals or other organizations to operate. It highlights their dependence on public or private generosity, as opposed to revenue generated through sales, services, or government funding. It often implies a mission-driven purpose, where the primary goal is not profit but rather serving a social or community need.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The supported-donation organization.","correct":"✓ The donation-supported organization.","note":"The correct order is 'donation-supported' because the donations are supporting the organization. The noun that receives the support comes last."},{"incorrect":"✗ They are donation support.","correct":"✓ They are donation-supported.","note":"To describe the organization, use the adjective form, 'donation-supported,' rather than the noun phrase 'donation support.'"}],"priority":"N/A"},"related_words":{"derivatives":["donation (noun: 寄付、寄贈)","support (noun: 支援、支持；verb: 支援する、支持する)","donor (noun: 寄付者、提供者)","supporter (noun: 支持者、支援者)"],"phrasal_verbs":["support (verb: 支援する、支持する)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, but readily understood.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Donation-supported' is a compound adjective used to describe an organization, project, or entity that relies on donations for its funding and operation. It indicates that the entity is not primarily funded by commercial activities, government grants, or other revenue streams, but rather by voluntary contributions from individuals, foundations, or other organizations. Understanding this term requires familiarity with the concept of charitable giving and non-profit organizations."},"example_sentences":[{"sentence":"The community center is donation-supported and offers free programs for children.","translation":"そのコミュニティセンターは寄付によって支えられており、子供たちに無料のプログラムを提供しています。","type":"adjective","meaning_category":"寄付によって支えられている"},{"sentence":"As a donation-supported news organization, we rely on our readers to help us continue providing quality journalism.","translation":"寄付金で運営されている報道機関として、質の高いジャーナリズムを提供し続けるために、読者の皆様からのご支援を頼りにしています。","type":"adjective","meaning_category":"寄付金で運営されている"},{"sentence":"The animal shelter is donation-supported and always in need of volunteers.","translation":"その動物保護施設は寄付によって支えられており、常にボランティアを必要としています。","type":"adjective","meaning_category":"寄付によって支えられている"}]}