{"word":"presecular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"脱世俗化以前の、世俗化以前の","english_definition":"Existing or belonging to a time before secularization.","examples":[{"sentence":"The presecular world was characterized by a strong connection between religious and political authority.","translation":"脱世俗化以前の世界は、宗教的権威と政治的権威の強い結びつきによって特徴づけられていた。"},{"sentence":"Understanding presecular societies requires examining their unique cultural and religious contexts.","translation":"脱世俗化以前の社会を理解するには、その独特な文化的、宗教的背景を調べる必要がある。"}],"collocations":["presecular society","presecular thought","presecular values"],"synonyms":["pre-modern","pre-enlightenment"],"antonyms":["postsecular","secular"],"notes":"Often used in academic or historical contexts."}],"etymology":{"value":"Derived from the prefix 'pre-' (before) and 'secular' (relating to worldly matters, not religious).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːˈsɛkjələr/","syllables":"pre-sec-u-lar"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than for comparative and superlative forms (which are less common for this word: more presecular, most presecular)."},"usage_notes":{"explanation":"'Presecular' is used to describe periods, societies, or ideas that existed before the widespread adoption of secular values and institutions. It often implies a greater role for religion in public life and a different understanding of the relationship between the sacred and the profane.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The presecular era was not important.","correct":"✓ The presecular era is important to understand the present.","note":"Avoid implying that presecular periods were unimportant or irrelevant. They are often crucial for understanding historical developments."}],"priority":"★☆☆"},"related_words":{"derivatives":["secular","secularism","secularization","postsecular"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in academic and specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'presecular' is primarily used in academic and scholarly contexts to describe a time before the separation of religious and political authority. It requires an understanding of the concept of secularization and is not commonly used in everyday language."},"example_sentences":[{"sentence":"The art of the period reflects the presecular worldview.","translation":"その時代の芸術は、脱世俗化以前の世界観を反映している。","type":"general"},{"sentence":"Legal systems in many presecular societies were based on religious law.","translation":"多くの脱世俗化以前の社会における法制度は、宗教法に基づいていた。","type":"historical"}]}