{"word":"picture-dealing","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"絵画取引、美術商","english_definition":"The business of buying and selling pictures, especially paintings; the profession of an art dealer.","examples":[{"sentence":"He made a fortune in picture-dealing.","translation":"彼は絵画取引で財を成した。"},{"sentence":"The gallery specializes in picture-dealing of modern art.","translation":"そのギャラリーは近代美術の絵画取引を専門としている。"}],"collocations":["art dealing","fine art dealing","antique dealing"],"synonyms":["art trade","art market","art business"],"antonyms":[]}],"etymology":{"value":"Compound word formed from 'picture' and 'dealing', indicating the activity of trading in pictures.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɪktʃərˌdiːlɪŋ/","syllables":"pic-ture-deal-ing"},"inflection":{"noun_plural":"picture-dealings (rarely used)"},"usage_notes":{"explanation":"'Picture-dealing' refers specifically to the buying and selling of pictures, often paintings, and is closely associated with the role of an art dealer. It can encompass a wide range of activities, including sourcing artworks, negotiating prices, and marketing to potential buyers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is in picture deal.","correct":"✓ He is in picture-dealing.","note":"'Picture-dealing' is a noun that describes the business or activity itself, not a single transaction. Use 'picture deal' to refer to a specific transaction."}],"priority":"★☆☆"},"related_words":{"derivatives":["picture dealer"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'picture-dealing' is relatively specialized and is most likely to be encountered in contexts related to art, business, or finance. It describes the activity of buying and selling pictures, particularly paintings, and is closely associated with the profession of an art dealer. Understanding this term requires a familiarity with the art market and related vocabulary."},"example_sentences":[{"sentence":"His expertise in picture-dealing allowed him to identify valuable artworks.","translation":"彼の絵画取引の専門知識により、彼は価値のある芸術作品を見分けることができた。","type":"general","meaning_category":"絵画取引の専門知識"},{"sentence":"The museum acquired several pieces through private picture-dealing.","translation":"美術館は私的な絵画取引を通じていくつかの作品を入手した。","type":"general","meaning_category":"絵画取引による作品入手"}]}