{"word":"worker-priest","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"労働者司祭、労働司祭 (労働者として働きながら司祭の職務も行う聖職者)","english_definition":"A priest who also works a secular job, typically in a working-class occupation.","examples":[{"sentence":"The worker-priest movement sought to bridge the gap between the church and the working class.","translation":"労働者司祭運動は、教会と労働者階級の間の隔たりを埋めようとした。"},{"sentence":"He was a worker-priest in a factory, ministering to his fellow workers.","translation":"彼は工場で働く労働司祭であり、同僚の労働者たちに奉仕していた。"}],"collocations":["become a worker-priest (労働者司祭になる)","the worker-priest movement (労働者司祭運動)","serve as a worker-priest (労働者司祭として奉仕する)"],"synonyms":["laborer-priest"],"antonyms":[],"notes":"This term is most commonly associated with a movement within the Catholic Church, particularly in France after World War II."}],"etymology":{"value":"A compound word formed from 'worker' and 'priest', reflecting the dual role of the individual. The concept emerged in the context of efforts to reconnect the church with the working class in industrialized societies.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːrkər ˈpriːst/","syllables":"work-er priest"},"inflection":{"noun_plural":"worker-priests"},"usage_notes":{"explanation":"The term 'worker-priest' specifically refers to a priest who takes on a secular job, often in a manual labor or working-class setting. This is typically done to better understand and serve the needs of the working class, and to bridge the gap between the church and those communities. The movement has had a complex history, facing both support and controversy within the church.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a worker priest, working at the church.","correct":"✓ He is a worker-priest, working in a factory.","note":"The distinction is that a worker-priest works a secular job in addition to their priestly duties, not at the church itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["worker (noun): a person who works","priest (noun): a religious leader or minister"],"related_concepts":["liberation theology (解放の神学)","social justice (社会正義)","Catholic Worker Movement (カトリック労働者運動)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized term)","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'worker-priest' refers to a specific type of clergy member who also holds a secular job, typically in a working-class occupation. This concept is often associated with a historical movement within the Catholic Church aimed at engaging more directly with the lives and concerns of working-class communities. Understanding this term requires some familiarity with the history of the church and its relationship with social issues.","priority":"★★☆"},"example_sentences":[{"sentence":"The local factory employed a worker-priest who was well-respected by the other employees.","translation":"その地元の工場では、他の従業員から尊敬されている労働司祭を雇用していた。","type":"noun","meaning_category":"person"},{"sentence":"The worker-priest program aimed to address the social and economic issues faced by laborers.","translation":"労働司祭プログラムは、労働者が直面する社会的および経済的問題に取り組むことを目的としていた。","type":"noun","meaning_category":"program"}]}