{"word":"recongestion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再び混雑すること、再混雑","english_definition":"The state of being congested again.","examples":[{"sentence":"The city experienced recongestion after the road closures were lifted.","translation":"道路閉鎖が解除された後、都市は再び混雑に見舞われた。"},{"sentence":"Efforts to prevent recongestion of the network are ongoing.","translation":"ネットワークの再混雑を防ぐための取り組みが進行中である。"}],"collocations":["prevent recongestion","avoid recongestion","traffic recongestion","network recongestion"],"synonyms":["re-crowding","re-blocking"],"antonyms":["decompression","clearing"]},{"part_of_speech":"noun","definition":"（医学）再び充血すること、再充血","english_definition":"(Medicine) The return of congestion, especially of blood vessels.","examples":[{"sentence":"The patient experienced recongestion of the lungs after discontinuing medication.","translation":"患者は投薬を中止した後、肺の再充血を経験した。"},{"sentence":"Recongestion can occur if treatment is not properly followed.","translation":"治療が適切に行われない場合、再充血が起こることがある。"}],"collocations":["pulmonary recongestion","nasal recongestion","avoid recongestion"],"synonyms":["re-swelling","re-occlusion"],"antonyms":["decongestion"]}],"etymology":{"value":"\"re-\" (again) + \"congestion\" (the state of being congested).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːkənˈdʒestʃən/","syllables":"re-con-ges-tion"},"inflection":{"noun_plural":"recongestions"},"usage_notes":{"explanation":"\"Recongestion\" refers to a state where something that was previously congested becomes congested again. This can apply to various contexts, such as traffic, networks, or medical conditions involving blood vessels or other bodily systems. The specific meaning depends on the context in which it is used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The recongestion was caused by too much cars.","correct":"✓ The recongestion was caused by too many cars.","note":"\"Cars\" is a countable noun, so use \"many\" instead of \"much\"."},{"incorrect":"✗ The recongestion of my nose made it hard to breath.","correct":"✓ The recongestion of my nose made it hard to breathe.","note":"\"Breathe\" is the verb (to inhale and exhale), while \"breath\" is the noun (the air inhaled or exhaled)."}],"priority":"★★☆"},"related_words":{"derivatives":["re-congest (verb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"recongestion\" is a relatively uncommon term generally used in technical or formal contexts. It describes a situation where congestion, a state of being blocked or overcrowded, returns after a period of being relieved. This word is most often encountered in discussions about traffic management, network infrastructure, or medical conditions. Understanding the prefix \"re-\" meaning \"again\" and the root word \"congestion\" is key to grasping its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The highway experienced severe recongestion during the evening rush hour.","translation":"高速道路は夕方のラッシュアワーに深刻な再混雑に見舞われた。","type":"noun","meaning_category":"traffic"},{"sentence":"Network engineers are working to prevent recongestion after the system upgrade.","translation":"ネットワークエンジニアは、システムアップグレード後の再混雑を防ぐために取り組んでいる。","type":"noun","meaning_category":"network"},{"sentence":"Pulmonary recongestion is a serious complication following heart surgery.","translation":"肺の再充血は、心臓手術後の深刻な合併症である。","type":"noun","meaning_category":"medical"}]}