{"word":"quintile","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"五分位数、5分位","english_definition":"Any of the four values that divide a sorted data set into five equal parts, so that each part represents 1/5 of the sample or population. Also, any of the five groups so divided.","examples":[{"sentence":"The study divided the population into quintiles based on income.","translation":"その研究では、所得に基づいて人口を5分位に分けました。"},{"sentence":"The top quintile of earners pays a disproportionate share of taxes.","translation":"所得上位5分位の層は、税金の不均衡な割合を負担しています。"},{"sentence":"We analyzed the data by quintiles to identify trends.","translation":"傾向を特定するために、データを5分位ごとに分析しました。"}],"collocations":["income quintile (所得5分位)","top quintile (上位5分位)","bottom quintile (下位5分位)","quintile analysis (5分位分析)","divide into quintiles (5分位に分割する)"],"synonyms":["percentile","decile","quartile"],"antonyms":[]},{"part_of_speech":"adjective","definition":"五分位の、5分位に関する","english_definition":"Relating to or dividing into quintiles.","examples":[{"sentence":"Quintile data can provide a more nuanced understanding of inequality.","translation":"5分位データは、不平等のより微妙な理解を提供できます。"},{"sentence":"The quintile distribution of wealth in the country is highly unequal.","translation":"その国の富の5分位分布は非常に不平等です。"}],"collocations":["quintile distribution (5分位分布)","quintile data (5分位データ)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Latin word 'quintus' meaning 'fifth'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkwɪntaɪl/","syllables":"quin-tile"},"inflection":{"noun_plural":"quintiles"},"usage_notes":{"explanation":"A quintile is a statistical term that refers to one of five equal groups into which a population can be divided. Quintiles are often used to analyze income distribution, wealth distribution, or other socioeconomic factors. The term is most commonly used in statistical analysis and economics. It is important to understand that quintiles are based on dividing a *sorted* dataset.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The quintile is a number between 0 and 1.","correct":"✓ A quintile is one of five groups into which a dataset is divided.","note":"A quintile is a group, not a single number. While you can represent the boundaries between quintiles as numbers, the quintile itself is a category."},{"incorrect":"✗ We divided the data into five equal parts, so we used quartiles.","correct":"✓ We divided the data into five equal parts, so we used quintiles.","note":"Quartiles divide the data into *four* equal parts, not five."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["quartile","decile","percentile","statistics","distribution","income inequality","wealth inequality"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'quintile' refers to one of five equal groups into which a population or dataset is divided. This term is primarily used in statistics and economics to analyze distributions, such as income or wealth. Understanding quintiles helps in grasping concepts related to inequality and data analysis. It's a more advanced statistical term, so familiarity with basic statistical concepts is helpful.","priority":"★★☆"},"example_sentences":[{"sentence":"The government aims to improve the living standards of the lowest income quintile.","translation":"政府は、所得下位5分位の生活水準の向上を目指しています。","type":"noun","meaning_category":"五分位数"},{"sentence":"The graph shows the quintile distribution of household income.","translation":"グラフは、世帯収入の5分位分布を示しています。","type":"adjective","meaning_category":"五分位の"},{"sentence":"The study found a significant difference in health outcomes between the top and bottom quintiles.","translation":"その研究では、上位と下位の5分位間で健康状態に大きな違いがあることがわかりました。","type":"noun","meaning_category":"五分位数"}]}