{"word":"contrastably","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"比較して、対照的に、著しく対比して","english_definition":"in a manner that is capable of being contrasted; in a way that shows a clear difference when compared.","examples":[{"sentence":"The two paintings were contrastably different in style and subject matter.","translation":"その二つの絵画は、スタイルと主題において比較して著しく異なっていた。"},{"sentence":"The new policy is contrastably more effective than the old one.","translation":"新しい政策は、以前のものと比べて著しく効果的である。"}],"collocations":["contrastably different","contrastably more effective","contrastably superior","contrastably inferior"],"synonyms":["distinctly","noticeably","markedly","strikingly","obviously","comparatively"],"antonyms":["similarly","identically","uniformly","analogously"]}],"etymology":{"value":"Derived from the word 'contrastable' (capable of being contrasted) with the addition of the adverbial suffix '-ly'. The root 'contrast' comes from the Latin 'contra' (against) and 'stare' (to stand), indicating a standing against or opposition.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈtræstəbli/","syllables":"con-tras-ta-bly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Contrastably' is used to emphasize a noticeable difference between two or more things when they are compared. It suggests that the difference is clear and easily observed. It is less common than other adverbs like 'distinctly' or 'noticeably', but it provides a precise way to describe a comparative difference.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The two ideas are contrastably each other.","correct":"✓ The two ideas are contrastably different from each other.","note":"'Contrastably' modifies the adjective 'different' or a similar term indicating a difference, not the preposition 'each other'."},{"incorrect":"✗ He performed contrastably good.","correct":"✓ He performed contrastably better.","note":"'Contrastably' is used to compare differences, so it is more appropriate to use it with comparative adjectives like 'better' rather than positive adjectives like 'good'."}],"priority":"★☆☆"},"related_words":{"derivatives":["contrast (noun, verb)","contrastive (adjective)","contrastable (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Contrastably' is a relatively uncommon adverb used to describe a clear and noticeable difference between two or more things when they are compared. It is typically used in formal writing or speech to emphasize the distinct differences. It is derived from 'contrast' and implies that the differences are easily observed and significant."},"example_sentences":[{"sentence":"The artist used light and shadow to make the figures contrastably stand out.","translation":"その芸術家は光と影を使って、人物を比較して際立たせた。","type":"adverb","meaning_category":"比較して目立たせる"},{"sentence":"The experimental group performed contrastably better than the control group in the study.","translation":"実験グループは、研究において対照的にコントロールグループよりも良い結果を出した。","type":"adverb","meaning_category":"比較して良い結果を出す"},{"sentence":"The two versions of the software are contrastably different in terms of user interface.","translation":"そのソフトウェアの二つのバージョンは、ユーザーインターフェースの点で比較して著しく異なる。","type":"adverb","meaning_category":"比較して異なる"}]}