{"word":"nonlimitative","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(文法) 非制限的な、付加的な","english_definition":"(grammar) providing descriptive or supplementary information that is not essential to the meaning of the sentence; also known as nonrestrictive.","examples":[{"sentence":"The clause 'who is a doctor' in 'My brother, who is a doctor, lives in London' is nonlimitative.","translation":"「医者である」という節は、「私の兄は医者ですが、ロンドンに住んでいます」という文において非制限的です。"},{"sentence":"Nonlimitative relative clauses are set off by commas.","translation":"非制限の関係詞節はコンマで区切られます。"}],"collocations":["nonlimitative clause (非制限節)","nonlimitative relative clause (非制限関係詞節)","nonlimitative modifier (非制限修飾語)"],"synonyms":["nonrestrictive","appositive","supplementary","parenthetical"],"antonyms":["limitative","restrictive","defining","essential"]}],"etymology":{"value":"'non-' (否定) + 'limitative' (制限的な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈlɪmɪtətɪv/","syllables":"non-lim-i-ta-tive"},"inflection":{"notes":"Adjective, no specific inflection"},"usage_notes":{"explanation":"'Nonlimitative' describes a clause or phrase that adds extra information to a sentence but is not essential to its core meaning. It's typically set off by commas or parentheses. Removing a nonlimitative element doesn't change the fundamental meaning of the sentence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonlimitative clause is essential to understand the meaning.","correct":"✓ The nonlimitative clause is not essential to understand the meaning.","note":"Nonlimitative clauses are, by definition, not essential."},{"incorrect":"✗ Don't use commas with limitative clauses, but use it with nonlimitative clauses.","correct":"✓ Don't use commas with limitative clauses, but use them with nonlimitative clauses.","note":"'Commas' is plural, so use 'them' instead of 'it'."}],"priority":"★★☆"},"related_words":{"derivatives":["limitative","limitation"],"phrases":["restrictive clause","nonrestrictive clause","relative clause"]},"level_frequency":{"level":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'nonlimitative' is primarily used in grammar to describe a type of clause or phrase that provides additional, non-essential information. It's important to understand that removing a nonlimitative element from a sentence will not alter its core meaning. These elements are usually set off by commas or parentheses to indicate their supplementary nature. The opposite of 'nonlimitative' is 'limitative' or 'restrictive,' which refers to elements that are essential for defining or limiting the noun they modify."},"example_sentences":[{"sentence":"My car, which is very old, still runs well. The clause 'which is very old' is a **nonlimitative** clause.","translation":"私の車はとても古いのですが、まだよく走ります。「とても古い」という節は非制限節です。","type":"definition"},{"sentence":"**Nonlimitative** clauses provide extra information and are separated by commas.","translation":"非制限節は追加情報を提供し、コンマで区切られます。","type":"general"},{"sentence":"The **nonlimitative** phrase can be removed without changing the core meaning of the sentence.","translation":"非制限句は文の核となる意味を変えることなく削除できます。","type":"usage"}]}