{"word":"saltwater-resistant","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"耐塩水性の、塩水に強い","english_definition":"Able to resist the damaging effects of saltwater; designed or treated to withstand exposure to saltwater.","examples":[{"sentence":"This watch is saltwater-resistant and can be worn while swimming in the ocean.","translation":"この時計は耐塩水性があり、海で泳ぐ際に着用できます。"},{"sentence":"The manufacturer claims that the new coating makes the metal saltwater-resistant.","translation":"製造業者は、新しいコーティングにより金属が耐塩水性になると主張しています。"},{"sentence":"Saltwater-resistant materials are essential for building structures near the coast.","translation":"耐塩水性の材料は、海岸近くの構造物を建設する上で不可欠です。"}],"collocations":["saltwater-resistant coating (耐塩水性コーティング)","saltwater-resistant material (耐塩水性材料)","saltwater-resistant metal (耐塩水性金属)","saltwater-resistant watch (耐塩水性時計)","saltwater-resistant equipment (耐塩水性機器)"],"synonyms":["corrosion-resistant","marine-grade","seawater-resistant"],"antonyms":["non-resistant","vulnerable to saltwater","susceptible to corrosion"]},{"part_of_speech":"adjective","definition":"(比喩的に)困難や苦難に耐えることができる","english_definition":"(Figuratively) Able to withstand difficult or adverse conditions; resilient.","examples":[{"sentence":"The community proved to be saltwater-resistant, bouncing back after the devastating hurricane.","translation":"そのコミュニティは、壊滅的なハリケーンの後、立ち直り、困難に耐えることができることを証明しました。"}],"collocations":["saltwater-resistant community (困難に耐えるコミュニティ)","saltwater-resistant spirit (困難に耐える精神)"],"synonyms":["resilient","durable","robust","hardy"],"antonyms":["fragile","vulnerable","weak"]}],"etymology":{"value":"The word is formed by combining 'saltwater' (water containing salt, especially seawater) with 'resistant' (able to withstand or oppose something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɔltˌwɔtər rɪˈzɪstənt/","syllables":"salt-wa-ter-re-sist-ant"},"inflection":{"notes":"This is an adjective, so it does not inflect for number or gender."},"usage_notes":{"explanation":"'Saltwater-resistant' is commonly used to describe items or materials that are designed to withstand the corrosive effects of saltwater, particularly in marine environments. It is often used in marketing materials for products such as watches, boats, and outdoor equipment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This material is saltwater proof.","correct":"✓ This material is saltwater-resistant.","note":"'Saltwater-resistant' implies that the material can withstand exposure to saltwater to a certain degree, while 'saltwater-proof' would imply that it is completely impervious to saltwater, which is often not the case."},{"incorrect":"✗ The saltwater-resistant of this metal is very high.","correct":"✓ The saltwater resistance of this metal is very high.","note":"'Saltwater-resistant' is an adjective, while 'saltwater resistance' is the noun form."}],"priority":"★★☆"},"related_words":{"derivatives":["resistance (名詞: 抵抗)","resist (動詞: 抵抗する)","saltwater (名詞: 塩水)"],"phrasal_verbs":[],"related_terms":["corrosion resistance (耐腐食性)","marine environment (海洋環境)","seawater (海水)"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'saltwater-resistant' is a compound adjective describing a material's ability to withstand the corrosive effects of saltwater. It is commonly used in technical and marketing contexts, particularly in relation to marine equipment and coastal infrastructure. Understanding the term requires familiarity with both 'saltwater' and 'resistant'. It is generally used in contexts where protection against corrosion from saltwater is important."},"example_sentences":[{"sentence":"The fishing rods are made with saltwater-resistant components to ensure durability.","translation":"その釣り竿は、耐久性を確保するために耐塩水性の部品で作られています。","type":"adjective","meaning_category":"耐塩水性"},{"sentence":"Choosing saltwater-resistant plants is crucial for landscaping near the ocean.","translation":"海の近くの景観設計には、耐塩水性の植物を選ぶことが重要です。","type":"adjective","meaning_category":"耐塩水性"},{"sentence":"The coating provides a saltwater-resistant barrier to protect the underlying metal.","translation":"そのコーティングは、下にある金属を保護するための耐塩水性の障壁を提供します。","type":"adjective","meaning_category":"耐塩水性"}]}