{"word":"paratypical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(生物学)副模式標本の、パラタイプの","english_definition":"(biology) Designating a specimen of a species that was used in the original description of that species but is not the holotype or lectotype.","examples":[{"sentence":"The paratypical specimens are stored in the museum's collection.","translation":"副模式標本は博物館のコレクションに保管されています。"},{"sentence":"Careful examination of the paratypical material is crucial for taxonomic accuracy.","translation":"分類学的精度には、副模式標本の慎重な検査が不可欠です。"}],"collocations":["paratypical specimen","paratypical material"],"synonyms":["paratype"],"antonyms":[]}],"etymology":{"value":"From 'para-' (beside, near) + 'typical' (representing a type).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpærəˈtɪpɪkəl/","syllables":"par-a-typ-i-cal"},"inflection":{"notes":"Adjectives do not inflect in English, though they can be modified by adverbs (e.g., 'very paratypical')."},"usage_notes":{"explanation":"'Paratypical' is a term used in biological taxonomy to describe specimens that are part of the original type series used to define a species but are not the primary type specimen (holotype or lectotype). These specimens provide additional information about the species' characteristics and variation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The paratypical specimen is the most important.","correct":"✓ The holotype is the most important.","note":"The holotype is the single specimen designated as the primary type. Paratypes are secondary."},{"incorrect":"✗ This is a paratypical example of a car.","correct":"✓ This is a typical example of a car.","note":"'Paratypical' is specific to biological taxonomy and should not be used in general contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["paratype (noun)"],"phrasal_verbs":[],"related_terms":["holotype","lectotype","neotype","type specimen","taxonomy"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Paratypical' is a highly specialized term used almost exclusively within the field of biological taxonomy. It refers to a specific type of specimen (a paratype) that contributes to the original description of a species but is not the primary defining specimen. Understanding this term requires familiarity with the principles of taxonomic nomenclature."},"example_sentences":[{"sentence":"The researchers analyzed the morphological characteristics of the paratypical specimens.","translation":"研究者たちは副模式標本の形態学的特性を分析した。","type":"adjective","meaning_category":"biology"},{"sentence":"Designation of a lectotype became necessary because the original holotype and paratypical material were lost.","translation":"元のホロタイプと副模式標本が失われたため、レクトタイプの指定が必要になった。","type":"adjective","meaning_category":"biology"}]}