{"word":"tabooism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"タブー主義：特定の行動、言葉、または対象が、社会、宗教、または文化的な理由で禁止または制限されているという信念または実践。","english_definition":"The belief in or practice of taboos; the system of prohibitions and restrictions based on what is considered sacred or forbidden in a particular society, religion, or culture.","examples":[{"sentence":"The tribe's culture was deeply rooted in tabooism, with many aspects of daily life governed by strict prohibitions.","translation":"その部族の文化はタブー主義に深く根ざしており、日常生活の多くの側面が厳格な禁止事項によって支配されていました。"},{"sentence":"Critics argued that the politician's stance on the issue was influenced by tabooism rather than rational thought.","translation":"批評家たちは、その問題に対する政治家の立場は、合理的な思考ではなくタブー主義に影響されていると主張しました。"},{"sentence":"The novel explores the consequences of challenging tabooism in a conservative society.","translation":"その小説は、保守的な社会におけるタブー主義への挑戦の結果を探求しています。"}],"collocations":["cultural tabooism","religious tabooism","social tabooism","practice of tabooism","belief in tabooism","challenge tabooism","overcome tabooism"],"synonyms":["taboo","prohibition","restriction","interdiction","sacredness","forbiddenness","cultural sensitivity"],"antonyms":["permissiveness","tolerance","acceptance","openness","liberalism"]}],"etymology":{"value":"'Taboo' はトンガ語の 'tapu' (神聖な、禁止された) に由来し、'ism' は主義や体系を表す接尾辞です。","priority":"★★★"},"pronunciation":{"ipa":"/təˈbuːɪzəm/","syllables":"ta-boo-i-zem"},"inflection":{"noun_plural":"tabooisms"},"usage_notes":{"explanation":"Tabooism は、ある社会や文化におけるタブーの存在と、それらが人々の行動や思考に与える影響を指します。タブーは、宗教的、文化的、社会的な理由で禁止されている行動、言葉、または対象であり、タブー主義は、これらのタブーを尊重し、遵守する体系または信念です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The concept of tabooism is only related to religion.","correct":"The concept of tabooism is related to religion, culture, and social norms.","note":"タブー主義は宗教だけでなく、文化や社会規範にも関連しています。"},{"incorrect":"Tabooism is the same as censorship.","correct":"Tabooism is related to cultural and social prohibitions, while censorship is the suppression of expression by authority.","note":"タブー主義は文化的な禁止事項に関連し、検閲は権力による表現の抑制です。"}],"priority":"★★☆"},"related_words":{"derivatives":["taboo","tabooist"],"phrasal_verbs":[],"related_concepts":["cultural relativism","social norms","moral codes","ethics","cultural anthropology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tabooism' は、特定の文化や社会におけるタブー（禁止されている行為、言葉、対象）に対する信念や実践を指す、やや専門的な用語です。この単語は、タブーが社会規範や行動にどのように影響を与えるかを議論する際に使用されます。例えば、特定の宗教的または文化的なタブーが、人々の食生活、服装、またはコミュニケーションの方法を制限する場合があります。この単語を理解するには、タブーの概念と、それが社会構造にどのように組み込まれているかを理解する必要があります。"},"example_sentences":[{"sentence":"The anthropologist studied the role of tabooism in maintaining social order within the tribe.","translation":"人類学者は、部族内の社会秩序を維持する上でのタブー主義の役割を研究しました。","type":"general","meaning_category":"社会秩序の維持"},{"sentence":"The film challenged the prevailing tabooism surrounding discussions of mental health.","translation":"その映画は、精神衛生に関する議論を取り巻く一般的なタブー主義に挑戦しました。","type":"general","meaning_category":"社会規範への挑戦"},{"sentence":"The government's policies were criticized for reinforcing tabooism and limiting personal freedoms.","translation":"政府の政策は、タブー主義を強化し、個人の自由を制限しているとして批判されました。","type":"general","meaning_category":"政治的影響"}]}