{"word":"non-chlorophyllous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"葉緑素を持たない、非葉緑素性の","english_definition":"lacking chlorophyll; not containing chlorophyll.","examples":[{"sentence":"Non-chlorophyllous plants obtain nutrients from other sources, such as decaying organic matter.","translation":"非葉緑素性の植物は、腐敗した有機物などの他の源から栄養を得ます。"},{"sentence":"Some fungi are non-chlorophyllous and rely on parasitism or symbiosis for survival.","translation":"一部の菌類は非葉緑素性であり、生存のために寄生または共生に依存しています。"}],"collocations":["non-chlorophyllous plant (非葉緑素性の植物)","non-chlorophyllous fungus (非葉緑素性の菌類)","non-chlorophyllous tissue (非葉緑素性の組織)"],"synonyms":["achlorophyllous"],"antonyms":["chlorophyllous"],"notes":"Typically used in botany and mycology to describe organisms that do not perform photosynthesis."}],"etymology":{"value":"Formed from the prefix 'non-' (meaning 'not'), combined with 'chlorophyllous' (meaning 'containing chlorophyll').","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌklɔːrəˈfɪləs/","syllables":"non-chlor-o-phyl-lous"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be modified by adverbs (e.g., 'very non-chlorophyllous')."},"usage_notes":{"explanation":"The term 'non-chlorophyllous' is primarily used in scientific contexts, specifically in botany, mycology, and related fields. It describes organisms or tissues that lack chlorophyll, the pigment responsible for photosynthesis. These organisms must obtain energy and nutrients through alternative means, such as parasitism, saprophytism, or symbiosis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is non-chlorophyll.","correct":"✓ The plant is non-chlorophyllous.","note":"'Non-chlorophyll' is a noun phrase, whereas 'non-chlorophyllous' is the adjective form that correctly describes the plant."}],"priority":"★★☆"},"related_words":{"derivatives":["chlorophyll (noun: 葉緑素)","chlorophyllous (adjective: 葉緑素を持つ)","achlorophyllous (adjective: 葉緑素を持たない - synonym)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-chlorophyllous' is a technical term used in biology, particularly when discussing plants and fungi. It means that an organism or tissue does not contain chlorophyll, which is necessary for photosynthesis. Because these organisms cannot produce their own food through photosynthesis, they must obtain nutrients from other sources. This term is more likely to be encountered in textbooks or scientific articles.","priority":"★★★"},"example_sentences":[{"sentence":"Indian pipe (Monotropa uniflora) is a non-chlorophyllous plant that appears ghostly white.","translation":"ギンリョウソウ（Monotropa uniflora）は、幽霊のような白い外観を持つ非葉緑素性の植物です。","type":"general","meaning_category":"description"},{"sentence":"Some orchid species are non-chlorophyllous and rely on mycorrhizal fungi for nutrients.","translation":"一部のラン科植物は非葉緑素性であり、栄養のために菌根菌に依存しています。","type":"botany","meaning_category":"example"},{"sentence":"The absence of chlorophyll makes non-chlorophyllous organisms unable to perform photosynthesis.","translation":"葉緑素の欠如により、非葉緑素性の生物は光合成を行うことができません。","type":"scientific","meaning_category":"function"}]}