{"word":"Africanderism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アフリカーナー特有の言葉遣い、表現、または習慣","english_definition":"A word, expression, or custom peculiar to the Afrikaans language or the Afrikaner people.","examples":[{"sentence":"The novel is full of Africanderisms that give it a unique flavor.","translation":"その小説は、独特の風味を与えるアフリカーナー特有の表現で満ちている。"},{"sentence":"Many Africanderisms have been incorporated into South African English.","translation":"多くのアフリカーナー特有の言葉遣いが南アフリカ英語に取り入れられている。"}],"collocations":["use of Africanderisms","examples of Africanderisms","common Africanderisms"],"synonyms":["Afrikaans idiom","South Africanism"],"antonyms":[]}],"etymology":{"value":"Derived from 'Africander' (an archaic term for an Afrikaner) + '-ism' (denoting a characteristic or usage).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæfrɪˈkændərɪzəm/","syllables":"Af-ri-can-der-ism"},"inflection":{"noun_plural":"Africanderisms"},"usage_notes":{"explanation":"'Africanderism' refers specifically to linguistic or cultural features that are characteristic of the Afrikaans language or the Afrikaner people. It is often used in discussions of language and cultural identity in South Africa.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke in pure English without any Africanderism.","correct":"✓ He spoke in standard English without any Africanderisms.","note":"'Pure English' is vague. 'Standard English' is more appropriate when contrasting with regional or dialectal variations."}],"priority":"★☆☆"},"related_words":{"derivatives":["Africander (archaic term for Afrikaner)","Afrikaans (language)","Afrikaner (South African ethnic group)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Africanderism' is a specialized term referring to linguistic or cultural characteristics specific to Afrikaans or Afrikaners. Understanding requires knowledge of South African history and language. It is not commonly used in general conversation."},"example_sentences":[{"sentence":"The author sprinkled the dialogue with Africanderisms to create a sense of authenticity.","translation":"作者は、真正性を出すために、会話にアフリカーナー特有の言葉遣いを散りばめた。","type":"general","meaning_category":"characteristic expression"},{"sentence":"Scholars study Africanderisms to understand the evolution of South African languages.","translation":"学者は、南アフリカの言語の進化を理解するために、アフリカーナー特有の言葉遣いを研究する。","type":"academic","meaning_category":"linguistic study"}]}