{"word":"horologies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"時計学、時計製作術","english_definition":"The science or art of measuring time or making timepieces.","examples":[{"sentence":"His expertise lies in the field of horologies, particularly antique clocks.","translation":"彼の専門は時計学の分野、特にアンティーク時計です。"},{"sentence":"The museum features an exhibit on the history of horologies.","translation":"その博物館は時計学の歴史に関する展示を特集しています。"}],"collocations":["history of horologies (時計学の歴史)","field of horologies (時計学の分野)","study of horologies (時計学の研究)"],"synonyms":["chronometry","timekeeping"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hora' (hour, time) and 'logia' (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/hɔːˈrɒlədʒiz/","syllables":"ho-rol-o-gies"},"inflection":{"noun_plural":"horologies"},"usage_notes":{"explanation":"'Horologies' is a rather uncommon word, primarily used in academic or specialized contexts related to the study, history, or craft of timekeeping devices. It encompasses both the scientific aspects of time measurement and the artistic elements of creating clocks and watches.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He studies horology, so he knows many horologies.","correct":"✓ He studies horology, so he knows a lot about horologies.","note":"'Horology' is the field of study, while 'horologies' refers to the plural of 'horology' when referring to multiple aspects or instances within the field.  It's more common to say 'he knows a lot about horology' or 'he knows a lot about timepieces'."}],"priority":"★☆☆"},"related_words":{"derivatives":["horological (adjective: relating to horology)","horologist (noun: a person skilled in horology)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Horologies' is a highly specialized term referring to the study and science of timekeeping. It is rarely used in everyday conversation and is primarily found in academic or technical contexts related to clock and watchmaking. Understanding this term requires a strong vocabulary and familiarity with technical fields.","priority":"★☆☆"},"example_sentences":[{"sentence":"The intricate mechanisms of antique horologies are a testament to human ingenuity.","translation":"アンティーク時計学の複雑なメカニズムは、人間の創意工夫の証です。","type":"noun","meaning_category":"時計学 (mechanisms)"},{"sentence":"The library houses a vast collection of books on horologies.","translation":"図書館には時計学に関する膨大な書籍コレクションがあります。","type":"noun","meaning_category":"時計学 (books)"}]}