{"word":"Fourdrinier","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"フォードリニア抄紙機（しょうしき）","english_definition":"A type of paper-making machine that uses a continuous moving wire mesh to form a paper web from a pulp slurry.","examples":[{"sentence":"The paper was made on a Fourdrinier machine.","translation":"その紙はフォードリニア抄紙機で作られた。"}],"collocations":["Fourdrinier machine","Fourdrinier paper machine","Fourdrinier wire"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after the Fourdrinier brothers, Henry and Sealy Fourdrinier, who financed the development of the machine in the early 19th century, based on a design by Louis-Nicolas Robert.","priority":"★★☆"},"pronunciation":{"ipa":"/fɔːrˈdrɪniər/","syllables":"Four-dri-ni-er"},"inflection":{"noun_plural":"Fourdriniers"},"usage_notes":{"explanation":"The term 'Fourdrinier' refers specifically to the type of paper-making machine and is often used in the context of paper manufacturing and industrial processes.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":["paper","pulp","wire mesh","paper-making"],"related":["Louis-Nicolas Robert","paper industry","manufacturing"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized vocabulary related to paper manufacturing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fourdrinier' is a technical term specific to the paper-making industry, referring to a particular type of machine used in the process. Understanding this term requires familiarity with industrial processes and paper manufacturing. It is not commonly used outside of this specific context."},"example_sentences":[{"sentence":"The mill uses a modern Fourdrinier to produce high-quality paper.","translation":"その工場では、高品質の紙を生産するために最新のフォードリニア抄紙機を使用している。","type":"noun","meaning_category":"抄紙機"},{"sentence":"The Fourdrinier section of the paper machine is critical for forming a uniform paper web.","translation":"抄紙機のフォードリニア部は、均一な紙ウェブを形成するために非常に重要である。","type":"noun","meaning_category":"抄紙機"}]}