{"word":"breakability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"壊れやすさ、破損性","english_definition":"The quality or state of being breakable; the degree to which something is likely to break.","examples":[{"sentence":"The breakability of the glass made it unsuitable for shipping.","translation":"そのガラスの壊れやすさが、輸送には不向きなものにした。"},{"sentence":"The company tested the breakability of their new phone screens.","translation":"その会社は新しい携帯電話の画面の壊れやすさを試験した。"}],"collocations":["high breakability","low breakability","assess breakability","test breakability"],"synonyms":["fragility","delicacy","frailty","brittleness"],"antonyms":["durability","strength","sturdiness","robustness"]}],"etymology":{"value":"Derived from 'breakable' by adding the suffix '-ity', which transforms an adjective into a noun denoting a quality or state. 'Breakable' comes from 'break' + '-able'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbreɪkəˈbɪləti/","syllables":"break-a-bil-i-ty"},"inflection":{"noun_plural":"breakabilities (rare, usually uncountable)"},"usage_notes":{"explanation":"'Breakability' is generally used as an uncountable noun referring to the general property of being breakable. While 'breakabilities' as a plural form is grammatically possible, it's rarely used. Instead, one would describe different types or instances of breakability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The breakabilitys of different materials were compared.","correct":"✓ The breakability of different materials was compared.","note":"'Breakability' is usually uncountable, so avoid using the plural form unless referring to distinct types of breakability."}],"priority":"★★☆"},"related_words":{"derivatives":["breakable","break","unbreakable"],"phrasal_verbs":[],"related_concepts":["material science","stress testing","impact resistance"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Breakability' refers to how easily something can be broken. It's a noun that describes the quality of being fragile or brittle. You might encounter this word in scientific or engineering contexts when discussing the properties of materials. For example, a scientist might study the 'breakability' of different types of glass to determine which is best for a particular application."},"example_sentences":[{"sentence":"The manufacturer improved the packaging to reduce the breakability of the product during shipping.","translation":"製造業者は、輸送中の製品の壊れやすさを軽減するために、梱包を改善した。","type":"general","meaning_category":"壊れやすさ"},{"sentence":"Engineers considered the breakability of the plastic when designing the toy.","translation":"エンジニアは、おもちゃを設計する際にプラスチックの壊れやすさを考慮した。","type":"technical","meaning_category":"破損性"}]}