{"word":"noncosmopolitism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非コスモポリタニズム、反世界主義、地方主義","english_definition":"Opposition to cosmopolitanism; advocacy of local or national interests over global ones.","examples":[{"sentence":"The rise of noncosmopolitism is evident in recent political events.","translation":"非コスモポリタニズムの高まりは最近の政治的な出来事に明らかである。"},{"sentence":"Some argue that noncosmopolitism can lead to isolationism.","translation":"非コスモポリタニズムは孤立主義につながる可能性があると主張する人もいる。"}],"collocations":["rise of noncosmopolitism","dangers of noncosmopolitism","noncosmopolitism and nationalism"],"synonyms":["localism","nationalism","parochialism","provincialism"],"antonyms":["cosmopolitanism","globalism","internationalism"]}],"etymology":{"value":"\"non-\" (否定の接頭辞) + \"cosmopolitanism\" (世界主義)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌkɒzməˈpɒlɪtənɪzəm/","syllables":"non-cos-mo-pol-i-tan-is-m"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Noncosmopolitism\" refers to the rejection of cosmopolitan values and the prioritization of local, national, or regional identities and interests. It often involves skepticism towards global governance, international cooperation, and cultural exchange.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ non-cosmopolitanism is always negative.","correct":"✓ Noncosmopolitism can have both positive and negative aspects, depending on the context.","note":"It's important to avoid generalizations about noncosmopolitism. It can be associated with both positive values (e.g., community solidarity) and negative ones (e.g., xenophobia)."}],"priority":"★★☆"},"related_words":{"derivatives":["noncosmopolitan (adjective)"],"related_concepts":["nationalism","patriotism","protectionism","anti-globalization"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Noncosmopolitism\" is a complex term that requires understanding of its opposite, \"cosmopolitanism.\" It is used in academic and political discourse to describe ideologies and movements that emphasize local or national identity and interests over global ones. The term is relatively rare in everyday conversation."},"example_sentences":[{"sentence":"The political discourse increasingly reflects a trend towards noncosmopolitism.","translation":"政治的な議論は、非コスモポリタニズムへの傾向をますます反映している。","type":"noun","meaning_category":"反世界主義"},{"sentence":"Scholars are studying the social factors that contribute to the rise of noncosmopolitism.","translation":"学者たちは、非コスモポリタニズムの高まりに寄与する社会的要因を研究している。","type":"noun","meaning_category":"地方主義"}]}