{"word":"Typhlopid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"メクラヘビ科のヘビ","english_definition":"Any snake of the family Typhlopidae, characterized by their small size, burrowing habits, and reduced eyes.","examples":[{"sentence":"The Typhlopid snakes are found in tropical and subtropical regions worldwide.","translation":"メクラヘビ科のヘビは、世界中の熱帯および亜熱帯地域で見られます。"}],"collocations":["Typhlopid snake","Typhlopidae family"],"synonyms":["blind snake","worm snake"],"antonyms":[]}],"etymology":{"value":"From Typhlops (the genus name) + -idae (a suffix used to form family names in zoological nomenclature). Typhlops comes from Greek typhlós (τυφλός) meaning 'blind', referring to the snakes' reduced eyes.","priority":"★★★"},"pronunciation":{"ipa":"/taɪˈflɒpɪd/","syllables":"ty-phlo-pid"},"inflection":{"noun_plural":"Typhlopids"},"usage_notes":{"explanation":"'Typhlopid' is used as a noun to refer to any member of the snake family Typhlopidae. They are commonly known as blind snakes or worm snakes due to their appearance and subterranean lifestyle.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The typhlopid is a kind of worm.","correct":"✓ The typhlopid is a kind of snake.","note":"Typhlopids are snakes, not worms, although they resemble worms in appearance."}],"priority":"★★☆"},"related_words":{"derivatives":["Typhlopidae (family name)","Typhlops (genus name)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Typhlopid' is a scientific term used to refer to snakes belonging to the family Typhlopidae. These snakes are also commonly known as blind snakes or worm snakes. The term is primarily used in zoological or scientific contexts. Understanding the term requires some familiarity with biological classification. "},"example_sentences":[{"sentence":"The tiny Typhlopid snake burrowed into the loose soil.","translation":"その小さなメクラヘビ科のヘビは、ゆるい土の中に潜っていった。","type":"general","meaning_category":"description"},{"sentence":"Researchers are studying the distribution of Typhlopids in the Amazon rainforest.","translation":"研究者たちは、アマゾンの熱帯雨林におけるメクラヘビ科の分布を研究している。","type":"scientific","meaning_category":"research"}]}