{"word":"Doxycycline","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ドキシサイクリン：テトラサイクリン系の広域スペクトル抗生物質","english_definition":"A broad-spectrum tetracycline antibiotic used to treat a variety of bacterial infections.","examples":[{"sentence":"The doctor prescribed doxycycline for my Lyme disease.","translation":"医者は私のライム病にドキシサイクリンを処方しました。"},{"sentence":"Doxycycline is also used to prevent malaria.","translation":"ドキシサイクリンはマラリアの予防にも使われます。"}],"collocations":["doxycycline hyclate (ドキシサイクリン・ハイクラート)","doxycycline monohydrate (ドキシサイクリン・モノハイドレート)","prescribe doxycycline (ドキシサイクリンを処方する)","take doxycycline (ドキシサイクリンを服用する)"],"synonyms":["vibramycin","tetracycline antibiotic"],"antonyms":[]}],"etymology":{"value":"Derived from tetracycline, with chemical modifications to improve its properties.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌdɒk.sɪˈsaɪ.kliːn/","syllables":"dok-si-sai-kleen"},"inflection":{"notes":"不可算名詞 (uncountable noun)"},"usage_notes":{"explanation":"Doxycycline is a commonly prescribed antibiotic effective against a wide range of bacteria. It's used to treat respiratory infections, acne, Lyme disease, and other conditions. It is also used prophylactically against malaria. Common side effects include nausea and increased sensitivity to sunlight.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I take doxycycline for cold.","correct":"✓ I take doxycycline for a bacterial infection.","note":"Doxycycline is an antibiotic and is not effective against viral infections like the common cold."},{"incorrect":"✗ Doxycycline can be taken with milk.","correct":"✓ Doxycycline should not be taken with milk or dairy products.","note":"Dairy products can interfere with the absorption of doxycycline."}],"priority":"★★☆"},"related_words":{"derivatives":["doxycycline hyclate","doxycycline monohydrate"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but common in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Doxycycline is a tetracycline antibiotic used to treat various bacterial infections, including Lyme disease, respiratory infections, and acne. It can also be used to prevent malaria. Common side effects include nausea and increased sun sensitivity. It's important to follow your doctor's instructions and avoid taking it with dairy products, which can reduce its effectiveness."},"example_sentences":[{"sentence":"The doctor prescribed a course of **doxycycline** to treat the bacterial infection.","translation":"医師は細菌感染症を治療するためにドキシサイクリンを処方しました。","type":"noun","meaning_category":"抗生物質"},{"sentence":"**Doxycycline** is often used to prevent malaria when traveling to certain regions.","translation":"ドキシサイクリンは、特定の地域へ旅行する際にマラリアを予防するためによく使用されます。","type":"noun","meaning_category":"抗生物質"}]}