{"word":"Bourbaki","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"ニコラ・ブルバキ (Nicolas Bourbaki): 20世紀に活動した主にフランスの数学者グループの集合名。単一の人物ではなく、共同で数学の基礎を再構築し、厳密な形式主義に基づく著作を出版した。","english_definition":"Nicolas Bourbaki: A collective pseudonym under which a group of mainly French mathematicians worked during the 20th century. It was not a single person, but a group that collaborated to rewrite the foundations of mathematics and publish works based on rigorous formalism.","examples":[{"sentence":"The Bourbaki group aimed to present mathematics in a highly abstract and axiomatic way.","translation":"ブルバキ・グループは、数学を非常に抽象的かつ公理的な方法で提示することを目指した。"},{"sentence":"Bourbaki's 'Elements of Mathematics' is a multi-volume series covering a wide range of mathematical topics.","translation":"ブルバキの『数学原論』は、広範な数学のトピックを網羅する多巻シリーズである。"}],"collocations":["Bourbaki group (ブルバキ・グループ)","Elements of Mathematics (数学原論)","Nicolas Bourbaki (ニコラ・ブルバキ)"],"synonyms":["collective of mathematicians (数学者集団)"],"antonyms":[]}],"etymology":{"value":"ニコラ・ブルバキという名前は、元々はフランスの学生ジョークから生まれた。ブルバキという架空の数学者をでっち上げ、講義のパロディを行ったことが起源とされる。その後、数学者グループがこの名前を共同ペンネームとして採用した。","priority":"中"},"pronunciation":{"ipa":"/buʁ.ba.ki/","syllables":"Bour-ba-ki"},"inflection":{"notes":"固有名詞のため、複数形は通常ありません。"},"usage_notes":{"explanation":"ニコラ・ブルバキは、実在の人物ではなく、複数の数学者が共同で著作を出版する際に使用したペンネームです。彼らは数学の基礎を厳密に再構築し、集合論を基盤とした公理的なアプローチを重視しました。彼らの著作は非常に抽象的で形式的であり、現代数学に大きな影響を与えました。","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"✗ Bourbaki was a famous mathematician.","correct":"✓ Bourbaki was a group of mathematicians.","note":"ブルバキは一人の数学者ではありません。数学者グループのペンネームです。"},{"incorrect":"✗ Bourbaki's theory is easy to understand.","correct":"✓ Bourbaki's work is highly abstract and requires a strong mathematical background to understand.","note":"ブルバキの著作は抽象的で難解なため、理解するには高度な数学の知識が必要です。"}],"priority":"中"},"related_words":{"derivatives":["Bourbakism (ブルバキ主義): ブルバキ・グループの数学に対するアプローチやスタイルを指す言葉。"],"priority":"低"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"低"},"readability_explanation":{"level":"C2","text":"「Bourbaki」は、数学史や数学の哲学に詳しい人向けの専門用語です。これは、20世紀に活動した主にフランスの数学者グループが使用した集合的なペンネームです。彼らは数学の基礎を厳密に再構築し、公理的な方法で数学を提示することを目指しました。彼らの著作は非常に抽象的で形式的であり、現代数学に大きな影響を与えましたが、難解であることでも知られています。数学を専門的に研究する人以外には馴染みのない言葉でしょう。"},"example_sentences":[{"sentence":"The **Bourbaki** approach to mathematics emphasized abstraction and rigor.","translation":"ブルバキの数学へのアプローチは、抽象性と厳密性を重視した。","type":"definition"},{"sentence":"**Bourbaki's** influence can be seen in many modern mathematical textbooks.","translation":"ブルバキの影響は、現代の多くの数学の教科書に見られる。","type":"usage"}]}