{"word":"Trigonelline","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トリゴネリン：マメ科植物に多く含まれるアルカロイドの一種。ニコチン酸の前駆体であり、血糖値や脂質代謝に影響を与える可能性が研究されている。","english_definition":"An alkaloid found in various plants, particularly in the Fabaceae (legume) family. It is a precursor to nicotinic acid and is being studied for its potential effects on blood sugar and lipid metabolism.","examples":[{"sentence":"Trigonelline is abundant in fenugreek seeds.","translation":"トリゴネリンはフェヌグリークの種子に豊富に含まれている。"},{"sentence":"Studies suggest that trigonelline may have hypoglycemic effects.","translation":"研究はトリゴネリンが血糖降下作用を持つ可能性を示唆している。"}],"collocations":["trigonelline content (トリゴネリン含有量)","trigonelline biosynthesis (トリゴネリン生合成)","trigonelline supplementation (トリゴネリン補給)","hypoglycemic effect of trigonelline (トリゴネリンの血糖降下作用)"],"synonyms":["N-methylnicotinate","caffeine precursor"],"antonyms":[]}],"etymology":{"value":"Trigonella（コロハ属：フェヌグリークを含む植物の属名）+ -ine（アルカロイドを示す接尾辞）","priority":"★★★"},"pronunciation":{"ipa":"/ˌtraɪɡɒnɛˈlɪn/","syllables":"Tri-gon-el-line"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Trigonelline is a naturally occurring alkaloid found in a variety of plants, with particularly high concentrations in fenugreek seeds and coffee beans. It's a zwitterion, meaning it contains both a positive and negative electrical charge, but is overall neutral. It is a derivative of niacin (vitamin B3) and is being investigated for its potential therapeutic properties, including its possible role in managing diabetes and improving lipid profiles. Roasting coffee beans can convert trigonelline into niacin, contributing to the vitamin content of coffee.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Trigonelline is a vitamin.","correct":"✓ Trigonelline is a precursor to a vitamin.","note":"Trigonelline is not a vitamin itself, but a precursor to niacin (vitamin B3)."},{"incorrect":"✗ Trigonelline is only found in coffee.","correct":"✓ Trigonelline is found in coffee and fenugreek, among other plants.","note":"While present in coffee, trigonelline is also found in significant amounts in fenugreek seeds and other plants."}],"priority":"★★☆"},"related_words":{"derivatives":["nicotinic acid (ニコチン酸)","niacin (ナイアシン)","fenugreek (フェヌグリーク)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (専門的な科学・医学分野)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Trigonelline**」は、フェヌグリークやコーヒー豆などの植物に含まれる天然の化学物質の名前です。科学的な文脈でよく使われ、特にその健康への影響について議論されることがあります。たとえば、血糖値を下げたり、コレステロールを改善したりする可能性が研究されています。一般の会話ではほとんど使われませんが、栄養や医学に関する記事を読む際には役立つかもしれません。"},"example_sentences":[{"sentence":"**Trigonelline** is a major alkaloid in coffee beans, contributing to their flavor and aroma.","translation":"トリゴネリンはコーヒー豆の主要なアルカロイドであり、その風味と香りに寄与している。","type":"noun","meaning_category":"アルカロイド"},{"sentence":"The effects of **trigonelline** on blood glucose levels are currently being investigated in clinical trials.","translation":"トリゴネリンの血糖値に対する影響は現在、臨床試験で調査されている。","type":"noun","meaning_category":"アルカロイド"}]}