{"word":"tire-filling","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"タイヤ充填用の、タイヤに充填する","english_definition":"Designed or used for filling tires, typically with a substance other than air to improve durability or performance.","examples":[{"sentence":"This is a tire-filling machine used in the factory.","translation":"これは工場で使用されるタイヤ充填機です。"},{"sentence":"The company specializes in tire-filling materials for off-road vehicles.","translation":"その会社はオフロード車用のタイヤ充填材を専門としています。"}],"collocations":["tire-filling machine","tire-filling material","tire-filling foam","tire-filling process"],"synonyms":["tire stuffing","tire packing"],"antonyms":[]}],"etymology":{"value":"The word is a compound adjective formed by combining \"tire\" (referring to a vehicle tire) and \"filling\" (referring to the act or material used to fill something). It describes something related to the process or materials used to fill tires.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtaɪərˌfɪlɪŋ/","syllables":"tire-fill-ing"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term \"tire-filling\" is primarily used in technical or industrial contexts related to vehicle maintenance, manufacturing, or specialized applications like off-road vehicles or heavy machinery. It refers to the process or materials used to fill tires with substances other than air, such as foam or other polymers, to prevent punctures, improve load-bearing capacity, or enhance durability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to tire-fill my car.","correct":"✓ I need to have my tires filled.","note":"\"Tire-filling\" is an adjective, not a verb. You would not say \"I tire-fill my car.\" Instead, you would say \"I need to have my tires filled\" or \"I need tire-filling services.\""}],"priority":"★★☆"},"related_words":{"derivatives":["fill (verb)","tire (noun)"],"phrasal_verbs":[],"related_terms":["foam filling","solid tire","flat-free tire","run-flat tire"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"tire-filling\" is a technical term, mostly used in automotive or engineering contexts. It refers to the process of filling tires with materials other than air, often to prevent punctures or improve performance in specific conditions. Because it is a specialized term, it is not commonly used in everyday conversation. Understanding the term requires some familiarity with automotive technology and terminology."},"example_sentences":[{"sentence":"The construction company uses tire-filling to prevent flat tires on their heavy equipment.","translation":"その建設会社は、重機のパンクを防ぐためにタイヤ充填を使用しています。","type":"example","meaning_category":"Usage in industry"},{"sentence":"Tire-filling with foam can significantly increase the lifespan of tires in demanding environments.","translation":"フォームによるタイヤ充填は、過酷な環境下でのタイヤの寿命を大幅に延ばすことができます。","type":"example","meaning_category":"Benefits of tire-filling"}]}