{"word":"sonnetry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ソネット詩、ソネットの作成","english_definition":"the writing or study of sonnets; sonnet composition.","examples":[{"sentence":"His sonnetry is characterized by its intricate rhyme schemes and emotional depth.","translation":"彼のソネット詩は、その複雑な韻律構成と感情的な深みが特徴である。"},{"sentence":"She dedicated her life to the art of sonnetry, producing hundreds of beautiful poems.","translation":"彼女はソネット詩の芸術に生涯を捧げ、何百もの美しい詩を生み出した。"}],"collocations":["practice sonnetry","study sonnetry","art of sonnetry"],"synonyms":["sonnet composition","sonnet writing","poetry","verse"],"antonyms":[]}],"etymology":{"value":"\"Sonnetry\" is derived from \"sonnet,\" which comes from the Italian word \"sonetto,\" meaning \"little song.\" The suffix \"-ry\" is added to denote a practice, art, or collection related to sonnets.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɒnɪtri/","syllables":"son-net-ry"},"inflection":{"noun_plural":"sonnetries"},"usage_notes":{"explanation":"\"Sonnetry\" refers to the art, practice, or body of work related to sonnets. It encompasses the creation, study, and appreciation of sonnets as a form of poetry. While not as commonly used as \"poetry\" or \"sonnet writing,\" it specifically highlights the focus on sonnets.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a sonnetry writer.","correct":"✓ He is a sonnet writer. / ✓ He is a sonneteer.","note":"Instead of \"sonnetry writer,\" it's more common to say \"sonnet writer\" or use the word \"sonneteer,\" which specifically means a writer of sonnets."}],"priority":"★☆☆"},"related_words":{"derivatives":["sonnet (noun: a 14-line poem)","sonneteer (noun: a writer of sonnets)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Sonnetry\" is a specialized term referring to the art or practice of writing sonnets. It is less commonly used than the word \"sonnet\" itself, and is typically encountered in literary or academic contexts when discussing the composition and study of sonnets as a poetic form. Understanding this term requires familiarity with poetry and literary analysis."},"example_sentences":[{"sentence":"Her mastery of sonnetry was evident in the intricate rhyme schemes she employed.","translation":"彼女のソネット詩の熟練は、彼女が用いた複雑な韻律構成に明らかだった。","type":"noun","meaning_category":"ソネット詩の作成"},{"sentence":"The course focused on the history and techniques of English sonnetry.","translation":"そのコースは、イギリスのソネット詩の歴史と技法に焦点を当てていた。","type":"noun","meaning_category":"ソネット詩"}]}