{"word":"non-inflamed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"炎症を起こしていない、炎症が見られない","english_definition":"Not affected by inflammation; showing no signs of inflammation.","examples":[{"sentence":"The wound was clean and non-inflamed.","translation":"その傷は清潔で炎症は見られなかった。"},{"sentence":"The doctor checked the area to ensure it was non-inflamed.","translation":"医者はその部位をチェックし、炎症がないことを確認した。"},{"sentence":"A non-inflamed joint is essential for pain-free movement.","translation":"炎症を起こしていない関節は、痛みのない動きに不可欠である。"}],"collocations":["non-inflamed skin (炎症を起こしていない皮膚)","non-inflamed tissue (炎症を起こしていない組織)","non-inflamed joint (炎症を起こしていない関節)","remain non-inflamed (炎症を起こさない状態を保つ)"],"synonyms":["uninflamed","unirritated","healthy","normal","clear"],"antonyms":["inflamed","irritated","swollen","red","painful"]}],"etymology":{"value":"Prefix 'non-' (not) + 'inflamed' (affected by inflammation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn ɪnˈfleɪmd/","syllables":"non-in-flamed"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"'Non-inflamed' is typically used in medical or scientific contexts to describe a condition or area of the body that does not exhibit signs of inflammation, such as redness, swelling, heat, or pain. It is often used in contrast to 'inflamed' to highlight the absence of these symptoms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The area is non inflammation.","correct":"✓ The area is non-inflamed.","note":"'Non-inflamed' is an adjective, so it should be used to describe a noun. 'Non inflammation' is grammatically incorrect in this context."},{"incorrect":"✗ The wound is not inflamed. It is non-inflame.","correct":"✓ The wound is not inflamed. It is non-inflamed.","note":"'Non-inflame' is not a word. The correct adjective form is 'non-inflamed'."}],"priority":"★★☆"},"related_words":{"derivatives":["inflammation (名詞: 炎症)","inflame (動詞: 炎症を起こす、悪化させる)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in specialized medical or scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-inflamed' is a technical term used in medical contexts to describe a condition where there is no inflammation. Inflammation is a process where a part of the body becomes reddened, swollen, hot, and often painful, usually as a reaction to injury or infection. Therefore, 'non-inflamed' simply means the absence of these signs. It's a term primarily encountered in medical reports, scientific articles, or when discussing health conditions with a healthcare professional."},"example_sentences":[{"sentence":"The dermatologist confirmed that the patient's skin was non-inflamed.","translation":"皮膚科医は、患者の皮膚に炎症がないことを確認した。","type":"adjective","meaning_category":"状態"},{"sentence":"Maintaining a clean and dry environment helps keep the area non-inflamed.","translation":"清潔で乾燥した環境を維持することは、その部位を炎症を起こさない状態に保つのに役立つ。","type":"adjective","meaning_category":"状態維持"},{"sentence":"The non-inflamed state of the tissue allowed for proper healing.","translation":"組織の炎症がない状態が、適切な治癒を可能にした。","type":"adjective","meaning_category":"状態"}]}