{"word":"Divertibility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"転用性、流用性、転換可能性","english_definition":"The quality or state of being divertible; the capability of being diverted or turned from one purpose or use to another.","examples":[{"sentence":"The divertibility of funds allowed them to address the unexpected crisis.","translation":"資金の転用性のおかげで、彼らは予期せぬ危機に対処することができた。"},{"sentence":"The divertibility of the river's water is a key issue in the ongoing negotiations.","translation":"その川の水の流用性は、現在進行中の交渉における重要な問題である。"},{"sentence":"The project's design considered the divertibility of resources to different areas as needed.","translation":"そのプロジェクトの設計では、必要に応じてリソースをさまざまな分野に転用できることが考慮された。"}],"collocations":["fund divertibility (資金の転用性)","resource divertibility (資源の転用性)","water divertibility (水の流用性)"],"synonyms":["transferability","repurposability","convertibility","flexibility","adaptability"],"antonyms":["fixedness","immutability","non-transferability"]}],"etymology":{"value":"Derived from 'divertible,' which comes from 'divert.' 'Divert' originates from the Latin 'divertere,' meaning 'to turn aside.' The suffix '-ibility' indicates the capacity or capability of something.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˌvɜːrtɪˈbɪləti/","syllables":"di-vert-i-bil-i-ty"},"inflection":{"noun_plural":"Divertibilities"},"usage_notes":{"explanation":"'Divertibility' refers to the degree to which something, typically resources or funds, can be redirected from its original purpose to another. It's often used in contexts involving project management, resource allocation, and financial planning. It implies a certain level of flexibility and adaptability in how resources are used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The divertibility was high.","correct":"✓ The divertibility of the funds was high.","note":"'Divertibility' is a quality or capability, so it's important to specify what possesses this quality (e.g., funds, resources)."},{"incorrect":"✗ The divertibility is important for success.","correct":"✓ Divertibility is important for success.","note":"In general statements, use the bare noun 'divertibility' without the article 'the' to refer to the concept in general."}],"priority":"★★☆"},"related_words":{"derivatives":["divert (verb)","divertible (adjective)","diversion (noun)","diverted (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Divertibility' is a relatively uncommon and technical term that describes the capacity of something to be redirected or repurposed. It is often used in formal contexts such as project management, resource allocation, or financial planning to discuss the flexibility of resources. The term assumes a level of understanding of abstract concepts related to resource management and planning."},"example_sentences":[{"sentence":"The high divertibility of the workforce allowed the company to quickly adapt to changing market demands.","translation":"労働力の高い転用性により、会社は変化する市場の需要に迅速に適応することができた。","type":"general"},{"sentence":"The government emphasized the divertibility of humanitarian aid to ensure it reached the most vulnerable populations.","translation":"政府は、人道支援が最も脆弱な人々に確実に届くように、その転用性を強調した。","type":"specific"},{"sentence":"The divertibility of the software's modules made it easy to customize for different applications.","translation":"ソフトウェアのモジュールの転用性により、さまざまなアプリケーションに合わせて簡単にカスタマイズすることができた。","type":"technical"}]}