{"word":"Darshana","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(インド哲学) ダルシャナ、見解、哲学体系","english_definition":"(Indian philosophy) A viewpoint, perspective, or system of philosophy. More specifically, one of the six orthodox schools of Hindu philosophy.","examples":[{"sentence":"The six orthodox Darshanas are Nyaya, Vaisheshika, Samkhya, Yoga, Mimamsa, and Vedanta.","translation":"正統な六つのダルシャナは、ニヤーヤ学派、ヴァイシェーシカ学派、サーンキヤ学派、ヨーガ学派、ミマーンサー学派、ヴェーダーンタ学派です。"},{"sentence":"Each Darshana offers a unique path to understanding reality.","translation":"各ダルシャナは、現実を理解するための独自の道を提供します。"}],"collocations":["six Darshanas","Hindu Darshanas","Indian Darshanas"],"synonyms":["philosophy","viewpoint","perspective","school of thought"],"antonyms":[]}],"etymology":{"value":"Sanskrit darśana (दर्शन) meaning 'seeing, viewing, sight, vision, appearance'. Derived from the root dṛś (दृश्) 'to see'.","priority":"★★☆"},"pronunciation":{"ipa":"/dʌrˈʃɑːnə/","syllables":"Dar-sha-na"},"inflection":{"notes":"単数形・複数形ともに Darshana"},"usage_notes":{"explanation":"In the context of Indian philosophy, 'Darshana' refers to a specific school or system of thought that offers a comprehensive worldview and a path to liberation (moksha). It's not merely a philosophical theory but a practical guide for living. The term also implies a direct vision or insight into reality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He studied Darshanas of Western philosophy.","correct":"✓ He studied philosophies of Western thought.","note":"'Darshana' specifically refers to Indian philosophical systems. For Western philosophy, use terms like 'philosophies' or 'schools of thought'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Darshan (名詞: 聖なる人物や像を拝むこと、神の姿を見ること)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 哲学やインド学の研究分野で使われる専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Darshana' is a technical term primarily used in the context of Indian philosophy. It refers to a specific system of thought or school of philosophy within the Hindu tradition. Understanding this term requires familiarity with Indian philosophical concepts and terminology. It is not commonly used in general English.","priority":"★☆☆"},"example_sentences":[{"sentence":"The study of Darshanas provides insights into the diverse intellectual traditions of India.","translation":"ダルシャナの研究は、インドの多様な知的伝統への洞察を提供します。","type":"noun","meaning_category":"哲学体系"},{"sentence":"Each of the six Darshanas has its own unique epistemology and metaphysics.","translation":"六つのダルシャナのそれぞれが、独自の認識論と形而上学を持っています。","type":"noun","meaning_category":"哲学体系"}]}