{"word":"mind-expansion","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"意識拡大、精神拡張、知性の拡大","english_definition":"The process of broadening one's awareness, understanding, and perception of the world, often through experiences like meditation, psychedelic substances, or intellectual pursuits.","examples":[{"sentence":"Meditation can be a powerful tool for mind-expansion.","translation":"瞑想は意識拡大のための強力なツールとなりうる。"},{"sentence":"Some people believe that psychedelic drugs can facilitate mind-expansion, but they also carry risks.","translation":"精神薬理学的な薬物が意識拡大を促進すると信じる人もいるが、それらはリスクも伴う。"},{"sentence":"Reading widely and engaging in intellectual discussions can contribute to mind-expansion.","translation":"幅広く読書をしたり、知的な議論に参加したりすることは、知性の拡大に貢献する。"}],"collocations":["achieve mind-expansion (意識拡大を達成する)","experience mind-expansion (意識拡大を経験する)","pursue mind-expansion (意識拡大を追求する)","tools for mind-expansion (意識拡大のためのツール)","techniques for mind-expansion (意識拡大のためのテクニック)","through mind-expansion (意識拡大を通して)"],"synonyms":["consciousness expansion","spiritual growth","intellectual growth","self-discovery","enlightenment","awakening"],"antonyms":["narrow-mindedness","close-mindedness","intellectual stagnation","spiritual stagnation"]}],"etymology":{"value":"The term 'mind-expansion' is a compound word formed by combining 'mind' (referring to the intellect, consciousness, or thought processes) and 'expansion' (meaning the act or process of becoming larger or more extensive). The phrase gained popularity in the mid-20th century, particularly within counterculture movements, to describe the broadening of one's awareness and understanding, often through unconventional means.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmaɪnd ɪkˌspænʃən/","syllables":"mind-ex-pan-sion"},"inflection":{"noun_plural":"mind-expansions (rarely used)"},"usage_notes":{"explanation":"'Mind-expansion' refers to the process of increasing one's awareness, understanding, and perception. It can be achieved through various means, including meditation, intellectual pursuits, and, controversially, the use of psychedelic substances. The term is often associated with personal growth, spiritual development, and a broader perspective on life. It is important to note that while some methods of mind-expansion may be beneficial, others can be risky and should be approached with caution.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used mind expansion drugs.","correct":"✓ He used mind-expanding drugs.","note":"When used as an adjective, 'mind-expanding' is hyphenated. 'Mind expansion drugs' implies drugs that cause the concept of mind expansion itself."},{"incorrect":"✗ Mind expansion is always good.","correct":"✓ Mind expansion can be beneficial, but it's important to approach it responsibly.","note":"While mind expansion can be positive, it's not inherently good in all cases. Uncontrolled or irresponsible attempts at mind expansion can have negative consequences."}],"priority":"★★☆"},"related_words":{"derivatives":["mind-expanding (adjective)","expansion (noun)","mindful (adjective)","mindfulness (noun)"],"related_concepts":["meditation","psychedelics","consciousness","enlightenment","self-awareness","spiritual growth","intellectual curiosity"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, but recognized in academic and philosophical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Mind-expansion' is a concept often discussed in philosophical, spiritual, and psychological contexts. It refers to the process of broadening one's awareness, understanding, and perception of the world. This can be achieved through various means, such as meditation, intellectual pursuits, or, controversially, the use of psychedelic substances. The term implies a significant shift in perspective and a deeper understanding of oneself and the universe. While the concept is generally viewed positively, it's important to acknowledge the potential risks associated with certain methods of mind-expansion and to approach the topic with a critical and responsible mindset."},"example_sentences":[{"sentence":"Yoga and mindfulness practices are often used to facilitate **mind-expansion**.","translation":"ヨガとマインドフルネスの実践は、意識拡大を促進するためによく用いられる。","type":"general","meaning_category":"consciousness expansion"},{"sentence":"The philosopher argued that critical thinking is essential for **mind-expansion**.","translation":"その哲学者は、批判的思考が知性の拡大に不可欠であると主張した。","type":"intellectual","meaning_category":"intellectual growth"},{"sentence":"Some researchers are exploring the potential of virtual reality for **mind-expansion**.","translation":"一部の研究者は、仮想現実が意識拡大の可能性を秘めているかどうかを研究している。","type":"technology","meaning_category":"broadening awareness"},{"sentence":"She sought **mind-expansion** through travel and cultural immersion.","translation":"彼女は旅行と文化への没頭を通して意識拡大を求めた。","type":"experience","meaning_category":"broadening awareness"},{"sentence":"The book explores the history and philosophy of **mind-expansion**.","translation":"その本は、意識拡大の歴史と哲学を探求している。","type":"academic","meaning_category":"intellectual growth"}]}