{"word":"ungnawed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(特に動物によって)かじられていない、かじられていないままの","english_definition":"not gnawed; not having been bitten or nibbled at, especially by an animal.","examples":[{"sentence":"The bone lay ungnaweed on the floor, untouched by the dog.","translation":"その骨は犬に触れられることなく、かじられていないまま床に置かれていた。"},{"sentence":"The ungnaweed apple remained pristine in the fruit bowl.","translation":"かじられていないリンゴは、フルーツボウルの中で元のままだった。"}],"collocations":["ungnawed bone","ungnawed apple","ungnawed remains"],"synonyms":["untouched","unbitten","unchewed","intact","whole"],"antonyms":["gnawed","bitten","chewed","nibbled"]},{"part_of_speech":"adjective","definition":"(比喩的に)損なわれていない、傷つけられていない","english_definition":"(figuratively) not damaged or harmed; remaining in its original condition.","examples":[{"sentence":"His enthusiasm remained ungnaweed by the years of hardship.","translation":"彼の熱意は、長年の苦難によっても損なわれることはなかった。"},{"sentence":"The artist's vision remained ungnaweed by commercial pressures.","translation":"その芸術家のビジョンは、商業的な圧力によっても傷つけられることはなかった。"}],"collocations":["ungnawed enthusiasm","ungnawed vision","ungnawed spirit"],"synonyms":["unimpaired","undamaged","unharmed","unscathed","pristine"],"antonyms":["impaired","damaged","harmed","corrupted"]}],"etymology":{"value":"\"Ungnawed\" is formed by adding the prefix \"un-\" (meaning \"not\") to the past participle \"gnawed\" of the verb \"gnaw.\" \"Gnaw\" comes from Old English \"gnagan,\" meaning \"to bite, chew, or nibble.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈnɔːd/","syllables":"un-gnawed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used predicatively with a linking verb (e.g., \"The bone remained ungnaweed.\")."},"usage_notes":{"explanation":"\"Ungnawed\" is a relatively uncommon word, primarily used to describe something that has not been subjected to the action of gnawing, typically by an animal. It can also be used figuratively to describe something that has not been damaged or eroded by external forces. The word often carries a sense of preservation or intactness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dog left the bone ungnawing.","correct":"✓ The dog left the bone ungnaweed.","note":"The correct form is the past participle \"ungnaweed,\" not the present participle \"ungnawing.\""},{"incorrect":"✗ The idea was ungnaweed by criticism.","correct":"✓ The idea remained ungnaweed by criticism.","note":"When used figuratively, it's often better to use a verb like \"remained\" or \"stayed\" to emphasize the continued state of being ungnaweed."}],"priority":"★★☆"},"related_words":{"derivatives":["gnaw (verb): to bite or chew on something persistently","gnawing (adjective/gerund): persistently biting or chewing","gnawingly (adverb): in a manner that gnaws","ungnawing (adjective): not currently gnawing (rare)"],"related_concepts":["erosion","preservation","damage","consumption"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Too rare to be included in CEFR levels)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"ungnawed\" is a relatively rare and sophisticated word. It is formed by adding the prefix \"un-\" to the past participle of the verb \"gnaw,\" which means to bite or chew on something persistently. Therefore, \"ungnawed\" means \"not gnawed\" or \"not having been bitten or chewed on.\" Due to its rarity and specific meaning, it is more likely to be encountered in advanced reading materials or specialized contexts. The figurative use of \"ungnawed\" requires an understanding of abstract concepts such as preservation and resistance to damage."},"example_sentences":[{"sentence":"The archaeologist was surprised to find the ancient artifact ungnaweed by time.","translation":"考古学者は、古代の人工物が時の流れにかじられていない（損なわれていない）のを見つけて驚いた。","type":"adjective","meaning_category":"(figuratively)損なわれていない"},{"sentence":"Despite being left outside, the wooden toy remained ungnaweed by squirrels.","translation":"外に放置されていたにもかかわらず、その木のおもちゃはリスにかじられていないままだった。","type":"adjective","meaning_category":"かじられていない"}]}