{"word":"Ventrospcopy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A medical procedure involving visual examination of the ventral (abdominal) cavity, typically using an endoscope.","english_definition":"Visual examination of the ventral cavity, usually with an endoscope.","examples":[{"sentence":"Ventrospcopy was performed to assess the extent of the abdominal injury.","translation":"腹部の損傷の程度を評価するために腹腔鏡検査が行われた。"},{"sentence":"The veterinarian used ventroscopy to diagnose the cause of the animal's abdominal pain.","translation":"獣医は、動物の腹痛の原因を診断するために腹腔鏡検査を使用した。"}],"collocations":["perform ventroscopy","diagnostic ventroscopy","surgical ventroscopy"],"synonyms":["celioscopy","laparoscopy"],"antonyms":[]}],"etymology":{"value":"Derived from 'ventral' (relating to the abdomen) and '-scopy' (visual examination using an instrument).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɛntrɒˈskɒpi/","syllables":"ven-tro-sco-py"},"inflection":{"noun_plural":"ventroscopies"},"usage_notes":{"explanation":"Ventrospcopy is a specialized medical term primarily used in veterinary medicine and sometimes in human medicine. It refers to the endoscopic examination of the abdominal cavity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor did a ventroscopy on my chest.","correct":"✓ The doctor did a ventroscopy on my abdomen.","note":"Ventrospcopy is specific to the abdominal (ventral) cavity, not the chest."}],"priority":"★☆☆"},"related_words":{"derivatives":["ventral","endoscopy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Ventrospcopy is a highly specialized medical term used primarily in veterinary medicine to describe the endoscopic examination of the abdominal cavity. It is not a common term and is typically only encountered in medical or veterinary contexts. Understanding requires knowledge of medical terminology. "},"example_sentences":[{"sentence":"The surgeon recommended ventroscopy to investigate the abdominal mass.","translation":"外科医は、腹部の腫瘤を調べるために腹腔鏡検査を推奨した。","type":"medical procedure","meaning_category":"diagnosis"},{"sentence":"Ventrospcopy allowed for a minimally invasive approach to the biopsy.","translation":"腹腔鏡検査により、生検への低侵襲アプローチが可能になった。","type":"medical procedure","meaning_category":"surgery"}]}