{"word":"extramorainic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"氷堆石の外側の、氷堆石の外側に位置する","english_definition":"Situated or occurring outside of a moraine.","examples":[{"sentence":"Extramorainic lakes are often formed by meltwater from glaciers.","translation":"氷堆石外側の湖は、しばしば氷河からの融解水によって形成される。"},{"sentence":"The extramorainic plain was characterized by outwash deposits.","translation":"氷堆石外側の平野は、氷河からの流出堆積物によって特徴づけられた。"}],"collocations":["extramorainic deposits","extramorainic lake","extramorainic plain"],"synonyms":[],"antonyms":["intramorainic"]}],"etymology":{"value":"'extra-' (outside) + 'morainic' (relating to a moraine).","priority":"★★★"},"pronunciation":{"ipa":"/ˌekstrəməˈreɪnɪk/","syllables":"ex-tra-mo-rain-ic"},"inflection":{"notes":"Does not inflect; it is an adjective."},"usage_notes":{"explanation":"'Extramorainic' is a technical term used in geology and geography to describe features, deposits, or areas located outside the furthest extent of a moraine. Moraines are accumulations of debris carried and deposited by glaciers. Therefore, 'extramorainic' refers to the landscape beyond the glacial limit.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["moraine","intramorainic"],"related_terms":["glacial","outwash","till"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'extramorainic' is a specialized geological term, primarily used in academic or technical contexts related to glacial geology and geomorphology. It describes locations or features that lie beyond the outermost boundary of a moraine, which is a ridge of sediment deposited by a glacier. Due to its specific and technical nature, it is not commonly encountered in general language use."},"example_sentences":[{"sentence":"The soils in the extramorainic region were significantly different from those within the moraine.","translation":"氷堆石外側の地域の土壌は、氷堆石内の土壌とは著しく異なっていた。","type":"general","meaning_category":"location"},{"sentence":"Extramorainic sediments provide valuable insights into past glacial activity.","translation":"氷堆石外側の堆積物は、過去の氷河活動に関する貴重な洞察を提供する。","type":"scientific","meaning_category":"geology"}]}