{"word":"penertiban","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"The act of organizing, regulating, or bringing order to something; enforcement of order; systematization.","english_definition":"The process or act of bringing something into order, regulating, or systematizing it; the enforcement of rules or regulations to maintain order.","examples":[{"sentence":"Penertiban pedagang kaki lima di trotoar dilakukan secara persuasif.","translation":"The organization/regulation of street vendors on the sidewalk was carried out persuasively.","type":"example"},{"sentence":"Pemerintah daerah berupaya meningkatkan penertiban administrasi kependudukan.","translation":"The local government is striving to improve the systematization/regulation of population administration.","type":"example"},{"sentence":"Penertiban parkir liar menjadi prioritas utama di kawasan ini.","translation":"Enforcement of order regarding illegal parking is a top priority in this area.","type":"example"}],"collocations":["penertiban administrasi (administrative organization/regulation)","penertiban lalu lintas (traffic regulation)","penertiban bangunan (building regulation)","operasi penertiban (operation to enforce order)"],"synonyms":["pengaturan (arrangement, regulation)","pemberesan (tidying up, sorting out)","perapian (tidying up, neatening)","pembenahan (improvement, fixing)","sistematisasi (systematization)"],"antonyms":["kekacauan (chaos)","ketidakteraturan (disorder)","kerusuhan (riot)"]}],"etymology":{"value":"Derived from the Indonesian word 'tertib,' which means orderly, disciplined, or well-behaved. The prefix 'pe-an' is added to create a noun that denotes the process or act of making something orderly.","priority":"★★☆"},"pronunciation":{"ipa":"/pənərˈtiban/","syllables":"pe-ner-ti-ban"},"inflection":{"notes":"This is a noun and does not inflect for tense or number."},"usage_notes":{"explanation":"'Penertiban' is commonly used in Indonesian to refer to actions taken by authorities to enforce regulations, organize public spaces, or bring order to various aspects of society. It often implies a process of standardization and compliance with established rules. The word carries a sense of official action aimed at improving order and efficiency.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"*penertiban jalan","correct":"penertiban lalu lintas di jalan","note":"While 'penertiban jalan' might be understood, it's more accurate to specify what aspect of the road is being organized (e.g., traffic, vendors)."},{"incorrect":"*penertiban orang","correct":"penertiban perilaku (orang)","note":"'Penertiban' is usually applied to systems, regulations, or spaces, not directly to people. To refer to regulating people, use 'penertiban perilaku' (regulation of behavior)."}],"priority":"★★☆"},"related_words":{"derivatives":["tertib (orderly, disciplined)","menertibkan (to organize, to regulate)","ketertiban (orderliness, discipline)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent, especially in news and official documents.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Penertiban' is a formal Indonesian word that refers to the act of bringing something into order or enforcing regulations. It is often used in the context of government actions or policies aimed at improving public order or administrative efficiency. Understanding this word is important for comprehending news reports and official communications related to urban planning, law enforcement, and public administration in Indonesia."},"example_sentences":[{"sentence":"Satuan Polisi Pamong Praja melakukan penertiban bangunan liar di bantaran sungai.","translation":"The Public Order Agency conducted the regulation/organization of illegal buildings on the riverbank.","type":"example"},{"sentence":"Penertiban izin usaha menjadi fokus utama pemerintah daerah.","translation":"The regulation/organization of business permits is a primary focus of the local government.","type":"example"},{"sentence":"Pihak kepolisian meningkatkan penertiban terhadap pelanggaran lalu lintas.","translation":"The police are increasing the enforcement of order regarding traffic violations.","type":"example"}]}