{"word":"keratomalacia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"角膜軟化症","english_definition":"A pathological condition of the cornea, marked by dryness and ulceration, due to vitamin A deficiency.","examples":[{"sentence":"Keratomalacia can lead to blindness if left untreated.","translation":"角膜軟化症は、治療せずに放置すると失明につながる可能性があります。"},{"sentence":"Vitamin A supplementation is crucial in preventing keratomalacia.","translation":"ビタミンAの補給は、角膜軟化症の予防に不可欠です。"}],"collocations":["vitamin A deficiency keratomalacia","severe keratomalacia","keratomalacia treatment","keratomalacia prevention"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from Greek words: 'kerato-' referring to the cornea, and 'malakia' meaning softness.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkerətəʊməˈleɪʃə/","syllables":"ke-ra-to-ma-la-ci-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Keratomalacia is a serious eye condition resulting from severe vitamin A deficiency. It leads to the softening, clouding, and eventual ulceration of the cornea. Early diagnosis and treatment with vitamin A supplementation are essential to prevent irreversible damage and blindness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Keratomalacia is caused by too much vitamin A.","correct":"✓ Keratomalacia is caused by a deficiency of vitamin A.","note":"Keratomalacia is caused by a lack of vitamin A, not an excess."}],"priority":"★★☆"},"related_words":{"derivatives":["kerato- (prefix referring to the cornea)","malacia (softening of a tissue)"],"medical_terms":["xerophthalmia (dry eye syndrome, often associated with vitamin A deficiency)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Keratomalacia is a medical term referring to a severe eye condition caused by vitamin A deficiency. It involves the softening and potential ulceration of the cornea, which can lead to blindness if untreated. Understanding this term requires a medical or advanced understanding of biology and nutrition."},"example_sentences":[{"sentence":"The child in the developing country was diagnosed with keratomalacia due to severe malnutrition.","translation":"発展途上国の子どもは、深刻な栄養失調により角膜軟化症と診断されました。","type":"medical","meaning_category":"disease"},{"sentence":"Early symptoms of keratomalacia include night blindness and dry eyes.","translation":"角膜軟化症の初期症状には、夜盲症やドライアイなどがあります。","type":"medical","meaning_category":"symptoms"},{"sentence":"Treatment for keratomalacia involves high doses of vitamin A supplements.","translation":"角膜軟化症の治療には、高用量のビタミンAサプリメントが用いられます。","type":"medical","meaning_category":"treatment"}]}