{"word":"bursarship","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"奨学金 (特に英国の私立学校や大学における経済的援助)","english_definition":"A scholarship or financial award, especially one awarded by a private school or university in the UK to assist with the cost of tuition or living expenses.","examples":[{"sentence":"He received a bursarship to attend the prestigious boarding school.","translation":"彼はその名門寄宿学校に通うための奨学金を得た。"},{"sentence":"The university offers a number of bursarships to students from low-income backgrounds.","translation":"その大学は低所得家庭の学生に多くの奨学金を提供している。"},{"sentence":"She applied for a bursarship to help cover her tuition fees.","translation":"彼女は授業料を賄うために奨学金を申請した。"}],"collocations":["apply for a bursarship (奨学金を申請する)","receive a bursarship (奨学金を受ける)","offer a bursarship (奨学金を提供する)","bursarship student (奨学金を受けている学生)"],"synonyms":["scholarship","grant","fellowship","financial aid","award"],"antonyms":[]}],"etymology":{"value":"「bursar」（会計係、奨学金事務担当者）+ 「-ship」（状態、地位、関係などを表す接尾辞）。bursarは中世ラテン語の「bursarius」（財布係、会計係）に由来し、さらにラテン語の「bursa」（財布、袋）に遡る。つまり、元々は「財布に関わる地位」から「奨学金」の意味に発展した。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɜːrsərʃɪp/","syllables":"bur-sar-ship"},"inflection":{"noun_plural":"bursarships"},"usage_notes":{"explanation":"「**bursarship**」は、特にイギリス英語圏で、私立学校や大学が学生に提供する経済的援助を指す言葉です。授業料や生活費の一部を補助する目的で支給されます。一般的な「scholarship（奨学金）」とほぼ同義ですが、「bursarship」はより経済的な必要性に基づいた援助を意味することが多く、成績優秀者向けの「scholarship」とは区別されることがあります。アメリカ英語では、同様の制度を「financial aid」と呼ぶのが一般的です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He won a bursarship for his athletic ability.","correct":"✓ He was awarded a scholarship for his athletic ability. / ✓ He received a bursarship due to his financial need.","note":"Bursarships are typically awarded based on financial need, while scholarships can be awarded based on merit (e.g., academic or athletic ability)."},{"incorrect":"✗ I have a bursarship from the government.","correct":"✓ I have a scholarship from the government. / ✓ I have a student loan from the government.","note":"Bursarships are more commonly associated with private institutions. Government-funded aid is usually referred to as scholarships, grants, or loans."}],"priority":"★★☆"},"related_words":{"derivatives":["bursar (名詞: 会計係、奨学金事務担当者)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"低頻度 (Low frequency) - 特にイギリス英語圏以外では使用頻度が低い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**bursarship**」は、特にイギリスの教育制度において、経済的な援助を必要とする学生に提供される奨学金を指す言葉です。一般的な奨学金（scholarship）と似ていますが、bursarshipは経済的な必要性に基づいて支給されることが多いというニュアンスがあります。この単語は、教育機関のウェブサイトや奨学金に関する情報で目にすることがあります。アメリカ英語では、同様の制度を「financial aid」と呼ぶことが一般的です。"},"example_sentences":[{"sentence":"The school's bursarship program helps students from disadvantaged backgrounds access quality education.","translation":"その学校の奨学金プログラムは、恵まれない環境の学生が質の高い教育を受けるのを支援している。","type":"noun","meaning_category":"奨学金"},{"sentence":"Many students rely on bursarships and loans to finance their university studies.","translation":"多くの学生が大学での勉強の資金を奨学金やローンに頼っている。","type":"noun","meaning_category":"奨学金"},{"sentence":"The application process for a bursarship often requires detailed financial information.","translation":"奨学金の申請プロセスでは、詳細な財務情報が必要となることが多い。","type":"noun","meaning_category":"奨学金"}]}