{"word":"Pedagoguism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"過度な教育主義、形式主義的な教育方法への偏重","english_definition":"An excessive adherence to or reliance on formal pedagogical methods; formalism in education.","examples":[{"sentence":"The school's curriculum suffered from an excess of pedagoguism, stifling creativity and critical thinking.","translation":"その学校のカリキュラムは過度な教育主義に苦しみ、創造性と批判的思考を抑制していた。"},{"sentence":"He criticized the lecture for its pedagoguism, arguing that it prioritized method over substance.","translation":"彼は講義が内容よりも方法を優先していると主張し、その教育主義を批判した。"}],"collocations":["excessive pedagoguism","formal pedagoguism","criticize pedagoguism","suffer from pedagoguism"],"synonyms":["formalism","didacticism","methodolatry"],"antonyms":["informal education","unschooling","experiential learning"]}],"etymology":{"value":"'Pedagogue'（教育者、教師）+ '-ism'（主義、傾向）から派生。教育方法や理論への過度な偏重を示すために作られた言葉。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɛdəˈɡɒɡjuɪzəm/","syllables":"ped-a-go-gu-ism"},"inflection":{"noun_plural":"Pedagoguisms"},"usage_notes":{"explanation":"'Pedagoguism'は、教育方法や理論に過度に固執し、柔軟性や実践的な応用を欠く状態を指す否定的な意味合いを持つ言葉です。教育現場で形式主義が蔓延し、生徒の個性やニーズが無視される状況を批判的に表現する際に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The teacher showed pedagoguism by adapting to each student's needs.","correct":"✓ The teacher avoided pedagoguism by adapting to each student's needs.","note":"'Pedagoguism'は柔軟性の欠如を意味するため、生徒のニーズに適応する行動とは対照的です。"},{"incorrect":"✗ Pedagoguism is always a positive approach to teaching.","correct":"✓ Pedagoguism can be a negative approach to teaching if it becomes too rigid.","note":"'Pedagoguism'は過度な形式主義を指すため、常に肯定的な意味を持つわけではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["pedagogue","pedagogical","pedagogy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Pedagoguism**」は、教育方法や理論に過度に固執することを意味する専門的な単語です。この単語は、教育現場で柔軟性や実践的な応用が欠けている状況を批判的に表現する際に使用されます。例えば、教師が形式的な教育方法にこだわりすぎて、生徒の個々のニーズや創造性を無視するような場合に、「pedagoguism」という言葉を使って批判することができます。この単語は、教育学の分野で高度な議論をする際に役立ちます。"},"example_sentences":[{"sentence":"The rigid curriculum was criticized for its excessive pedagoguism, which stifled student creativity.","translation":"その硬直的なカリキュラムは、学生の創造性を抑制する過度な教育主義として批判された。","type":"noun","meaning_category":"過度な教育主義"},{"sentence":"The professor warned against the dangers of pedagoguism, emphasizing the importance of adapting teaching methods to individual student needs.","translation":"教授は教育主義の危険性について警告し、個々の学生のニーズに合わせて教育方法を適応させることの重要性を強調した。","type":"noun","meaning_category":"過度な教育主義"}]}