{"word":"deammonation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"脱アンモニア化、アンモニア除去","english_definition":"The removal of ammonia from a compound or substance.","examples":[{"sentence":"Deammonation of amino acids yields keto acids and ammonia.","translation":"アミノ酸の脱アンモニア化は、ケト酸とアンモニアを生成する。"},{"sentence":"The deammonation process is important in wastewater treatment.","translation":"脱アンモニア化プロセスは、廃水処理において重要である。"}],"collocations":["deammonation process","deammonation reaction","wastewater deammonation"],"synonyms":["ammonia removal","nitrogen removal"],"antonyms":["ammonification"]},{"part_of_speech":"noun","definition":"(土壌学)脱アンモニウム化","english_definition":"(In soil science) The process by which ammonium ions are converted to other forms, often involving the loss of ammonia gas.","examples":[{"sentence":"Deammonation in soil can lead to a decrease in nitrogen availability for plants.","translation":"土壌中の脱アンモニウム化は、植物への窒素供給の減少につながる可能性がある。"}],"collocations":["soil deammonation"],"synonyms":["ammonium removal"],"antonyms":["ammonium fixation"]}],"etymology":{"value":"From 'de-' (removal) + 'ammonation' (the addition or presence of ammonia).","priority":"★★☆"},"pronunciation":{"ipa":"/diːˌæməˈneɪʃən/","syllables":"de-am-mo-na-tion"},"inflection":{"noun_plural":"deammonations"},"usage_notes":{"explanation":"'Deammonation' refers to the process of removing ammonia (NH3) from a compound or substance. It is commonly used in biochemistry to describe the removal of ammonia from amino acids, and in environmental science to describe the removal of ammonia from wastewater or soil. The specific context determines the precise meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Deamination is the same as deammonation.","correct":"✓ Deamination and deammonation are related but not identical. Deamination generally refers to the removal of an amino group, which may or may not result in the release of free ammonia.","note":"'Deamination' and 'deammonation' are often used interchangeably, but 'deamination' is a broader term that refers to the removal of an amino group, while 'deammonation' specifically refers to the removal of ammonia."}],"priority":"★★☆"},"related_words":{"derivatives":["deaminate (verb)","deaminated (adjective)"],"related_terms":["ammonification","nitrification","denitrification"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Deammonation' is a technical term primarily used in biochemistry, environmental science, and soil science. Understanding this term requires a background in chemistry and biology, as it describes a specific chemical process involving the removal of ammonia. The term is not commonly encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"Anaerobic ammonium oxidation (anammox) is a deammonation process used in wastewater treatment.","translation":"嫌気性アンモニウム酸化（アナモックス）は、廃水処理で使用される脱アンモニア化プロセスである。","type":"general","meaning_category":"Wastewater treatment"},{"sentence":"The deammonation of glutamate is catalyzed by glutamate dehydrogenase.","translation":"グルタミン酸の脱アンモニア化は、グルタミン酸デヒドロゲナーゼによって触媒される。","type":"general","meaning_category":"Biochemistry"},{"sentence":"Soil deammonation can be influenced by factors such as pH and temperature.","translation":"土壌の脱アンモニウム化は、pHや温度などの要因によって影響を受ける可能性がある。","type":"general","meaning_category":"Soil science"}]}