{"word":"clablaria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(造語)架空の病名、または存在しない病気に対する恐怖症","english_definition":"(Neologism) A fictitious disease name, or the fear of non-existent diseases.","examples":[{"sentence":"The internet is full of people claiming to suffer from clablaria, despite it not being a real illness.","translation":"インターネット上には、クラブラリアという架空の病気に苦しんでいると主張する人々がたくさんいますが、実際には存在しない病気です。"},{"sentence":"He seems to have developed clablaria after reading too much medical literature.","translation":"彼は医学文献を読みすぎた後、クラブラリアを発症したようだ。"}],"collocations":["suffer from clablaria","diagnosed with clablaria","clablaria support group"],"synonyms":["hypochondria","cyberchondria","nosophobia"],"antonyms":["health","well-being"]}],"etymology":{"value":"This word appears to be a neologism, possibly derived from a combination of sounds that suggest a medical term, but has no established etymological roots. It is likely a made-up word used to describe a fear of imaginary diseases.","priority":"★☆☆"},"pronunciation":{"ipa":"/klæˈblɛəriə/","syllables":"clab-lar-i-a"},"inflection":{"noun_plural":"clablarias"},"usage_notes":{"explanation":"\"Clablaria\" is not a recognized medical term. It is used humorously or satirically to refer to the phenomenon of people self-diagnosing with nonexistent illnesses, often fueled by misinformation found online. It can also refer to the fear of contracting such imaginary diseases.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He died of clablaria.","correct":"✓ He mistakenly believed he had clablaria.","note":"Since clablaria is a fictitious disease, one cannot die from it. The correct usage involves the belief or fear of having it."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely low frequency - likely a neologism or rare term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Clablaria\" is a neologism, meaning it's a newly coined word. It's not found in standard dictionaries and is used to describe the fear of imaginary diseases or the act of self-diagnosing with nonexistent conditions, often influenced by online misinformation. Understanding this term requires a high level of vocabulary and awareness of internet culture and medical discourse. It is not a word commonly encountered in everyday language."},"example_sentences":[{"sentence":"The support group was for people who thought they had clablaria.","translation":"その支援グループは、自分がクラブラリアにかかっていると思っている人たちのためのものでした。","type":"noun","meaning_category":"fictitious disease"},{"sentence":"His doctor assured him that his symptoms were not indicative of clablaria, as it doesn't exist.","translation":"彼の医者は、彼の症状はクラブラリアを示すものではないと保証しました。なぜなら、それは存在しないからです。","type":"noun","meaning_category":"fictitious disease"}]}