{"word":"undimensioned","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"寸法が決められていない、寸法が記載されていない","english_definition":"Not having dimensions specified or indicated.","examples":[{"sentence":"The drawing was marked 'undimensioned' because the exact sizes were not yet determined.","translation":"図面には、正確なサイズがまだ決定されていないため、「寸法未記入」と記載されていました。"},{"sentence":"An undimensioned sketch can be useful for initial planning, but it's not suitable for manufacturing.","translation":"寸法が記載されていないスケッチは、初期計画には役立ちますが、製造には適していません。"}],"collocations":["undimensioned drawing","undimensioned sketch","undimensioned part"],"synonyms":["unspecified","unmeasured","unscaled"],"antonyms":["dimensioned","specified","measured","scaled"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to the word 'dimensioned'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌndɪˈmɛnʃənd/","syllables":"un-di-men-sioned"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"'Undimensioned' is typically used in technical contexts, such as engineering, architecture, or design, to describe drawings, parts, or plans that lack specific measurements. It implies that the dimensions are either unknown, not yet determined, or intentionally omitted.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The undimensioned car was driving down the street.","correct":"✓ The car was driving down the street.","note":"'Undimensioned' is not used to describe physical objects directly, but rather representations of them (e.g., drawings, plans)."},{"incorrect":"✗ The undimensioned problem was hard to solve.","correct":"✓ The unsolved problem was hard to solve.","note":"'Undimensioned' refers specifically to a lack of dimensional information, not a general lack of definition or clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["dimension (noun, verb)","dimensional (adjective)","dimensioning (noun, verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Undimensioned' is a technical term used to describe something, typically a drawing or plan, that does not have specific measurements indicated. It's most commonly found in fields like engineering, architecture, and manufacturing. The prefix 'un-' indicates the absence of dimensions, making it the opposite of 'dimensioned'. It's important to use this word in the correct context to avoid confusion."},"example_sentences":[{"sentence":"The architect provided an undimensioned floor plan for initial review.","translation":"建築家は、初期レビューのために寸法が記載されていない平面図を提供しました。","type":"general"},{"sentence":"The engineer noted that several parts on the assembly drawing were undimensioned.","translation":"エンジニアは、組立図のいくつかの部品に寸法が記載されていないことに気づきました。","type":"technical"},{"sentence":"Without dimensions, the undimensioned model could not be used for fabrication.","translation":"寸法がないと、寸法が記載されていないモデルは製造に使用できませんでした。","type":"technical"}]}