{"word":"ex-celebrity","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"かつての有名人、過去に人気があった人","english_definition":"a person who was famous in the past but is no longer famous.","examples":[{"sentence":"The reality show featured a panel of ex-celebrities.","translation":"そのリアリティ番組は、かつての有名人たちをパネリストとしてフィーチャーしていた。"},{"sentence":"He's trying to revive his career, but he's essentially an ex-celebrity now.","translation":"彼はキャリアを復活させようとしているが、今や実質的に過去の有名人だ。"},{"sentence":"Many ex-celebrities struggle to adjust to life out of the spotlight.","translation":"多くの元有名人は、スポットライトの外での生活に適応するのに苦労している。"}],"collocations":["former celebrity","one-time celebrity","fading celebrity","washed-up celebrity"],"synonyms":["former celebrity","has-been","one-time star"],"antonyms":["rising star","current celebrity","A-lister"]},{"part_of_speech":"adjective","definition":"かつての有名人の、元有名人の","english_definition":"relating to or characteristic of someone who was famous in the past but is no longer famous.","examples":[{"sentence":"The magazine ran an article about the lives of ex-celebrity couples.","translation":"その雑誌は、かつての有名人カップルの生活に関する記事を掲載した。"},{"sentence":"He now works as a real estate agent, a far cry from his ex-celebrity status.","translation":"彼は現在、不動産業者として働いており、かつての有名人としての地位とはかけ離れている。"}],"collocations":["ex-celebrity status","ex-celebrity lifestyle","ex-celebrity endorsement"],"synonyms":["former celebrity","one-time celebrity"],"antonyms":["current celebrity","high-profile celebrity"]}],"etymology":{"value":"The prefix 'ex-' indicates 'former' or 'past.' Thus, 'ex-celebrity' signifies someone who was previously a celebrity but no longer holds that status.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeks.səˈlebrəti/","syllables":"ex-ce-leb-ri-ty"},"inflection":{"noun_plural":"ex-celebrities"},"usage_notes":{"explanation":"The term 'ex-celebrity' is used to describe individuals who were once well-known and enjoyed a certain level of fame but are no longer in the public eye or have lost their celebrity status. This term can sometimes carry a slightly negative connotation, suggesting that the person's career has declined.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a celebrity ex.","correct":"✓ He is an ex-celebrity.","note":"The prefix 'ex-' should be attached directly to 'celebrity' to form 'ex-celebrity.'"},{"incorrect":"✗ She was a celebrity before, but now she is not famous. So, she is a celebrity ex.","correct":"✓ She was a celebrity before, but now she is not famous. So, she is an ex-celebrity.","note":"Using 'ex celebrity' as two separate words is less common and less grammatically correct than using it as a compound word, 'ex-celebrity'."}],"priority":"★★☆"},"related_words":{"derivatives":["ex- (prefix indicating former or past)","celebrity (a famous person)"],"phrases":["Where are they now? (a common phrase used when discussing ex-celebrities)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but understandable.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'ex-celebrity' is relatively straightforward. It combines the prefix 'ex-' (meaning 'former') with the word 'celebrity' (meaning a famous person). Therefore, an 'ex-celebrity' is someone who used to be famous but is no longer widely recognized or active in the public eye. The term is commonly used in media and everyday conversation to refer to individuals whose fame has faded.","priority":"★★☆"},"example_sentences":[{"sentence":"The talk show invited several ex-celebrities to discuss their experiences.","translation":"そのトーク番組は、数人の元有名人を招待して、彼らの経験について話し合った。","type":"noun","meaning_category":"かつての有名人"},{"sentence":"He's trying to make a comeback after years as an ex-celebrity.","translation":"彼は元有名人として何年も過ごした後、カムバックしようとしている。","type":"noun","meaning_category":"かつての有名人"},{"sentence":"The article focused on the challenges faced by ex-celebrity athletes.","translation":"その記事は、元有名アスリートが直面する課題に焦点を当てていた。","type":"adjective","meaning_category":"かつての有名人の"}]}