{"word":"tuberculinisation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ツベルクリン反応検査","english_definition":"The process of performing a tuberculin test, which involves injecting tuberculin into the skin to determine if someone has been exposed to tuberculosis.","examples":[{"sentence":"Tuberculinisation is a common method for detecting latent tuberculosis infection.","translation":"ツベルクリン反応検査は、潜在性結核感染を検出するための一般的な方法です。"}],"collocations":["tuberculinisation test","positive tuberculinisation","negative tuberculinisation"],"synonyms":["tuberculin testing","Mantoux test","PPD test"],"antonyms":[]}],"etymology":{"value":"Derived from 'tuberculin' (a substance prepared from cultures of tubercle bacilli) and '-isation' (a suffix indicating a process or action).","priority":"★★★"},"pronunciation":{"ipa":"/tjʊˌbɜːkjʊlɪnaɪˈzeɪʃən/","syllables":"tu-ber-cu-li-ni-sa-tion"},"inflection":{"noun_plural":"tuberculinisations"},"usage_notes":{"explanation":"Tuberculinisation refers specifically to the process of administering the tuberculin test. It's a medical term used in the context of diagnosing tuberculosis infection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tuberculinisation was positive, so he has tuberculosis.","correct":"✓ The tuberculinisation test was positive, so further tests are needed to confirm if he has active tuberculosis.","note":"A positive tuberculin test indicates exposure to tuberculosis, but it doesn't necessarily mean the person has active tuberculosis. Further tests are required."}],"priority":"★☆☆"},"related_words":{"derivatives":["tuberculin","tuberculinized"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tuberculinisation' is a highly specialized medical term referring to the administration of a tuberculin test. Understanding requires knowledge of medical terminology and the context of tuberculosis diagnosis."},"example_sentences":[{"sentence":"The doctor recommended tuberculinisation for all healthcare workers.","translation":"医師はすべての医療従事者にツベルクリン反応検査を推奨しました。","type":"noun","meaning_category":"ツベルクリン反応検査"},{"sentence":"Routine tuberculinisation can help in early detection of TB infection.","translation":"定期的なツベルクリン反応検査は、結核感染の早期発見に役立ちます。","type":"noun","meaning_category":"ツベルクリン反応検査"}]}