{"word":"athermal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(物理学)温度変化の影響を受けにくい、温度変化に対して安定な","english_definition":"(physics) not producing or absorbing heat; insensitive to temperature changes; temperature-stable.","examples":[{"sentence":"The athermal design of the instrument ensures accurate measurements even with temperature fluctuations.","translation":"その機器の非熱的な設計は、温度変動があっても正確な測定を保証する。"},{"sentence":"An athermal lens system maintains focus over a wide temperature range.","translation":"非熱レンズシステムは、広い温度範囲にわたって焦点を維持する。"}],"collocations":["athermal process","athermal material","athermal lens","athermal design"],"synonyms":["temperature-stable","temperature-compensated","insensitive to temperature"],"antonyms":["thermal","temperature-sensitive"]},{"part_of_speech":"adjective","definition":"(材料科学)熱処理を必要としない、熱活性化を伴わない","english_definition":"(materials science) not requiring heat treatment; not involving thermal activation.","examples":[{"sentence":"Athermal transformations occur without the need for thermal energy.","translation":"非熱変態は、熱エネルギーを必要とせずに起こる。"},{"sentence":"Athermal diffusion is a process where atoms move without thermal activation.","translation":"非熱拡散は、原子が熱活性化なしに移動するプロセスである。"}],"collocations":["athermal transformation","athermal diffusion","athermal process"],"synonyms":["non-thermally activated"],"antonyms":["thermally activated"]}],"etymology":{"value":"'a-' (without) + 'thermal' (relating to heat).","priority":"★★★"},"pronunciation":{"ipa":"/eɪˈθɜːrməl/","syllables":"a-ther-mal"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically formed using 'more athermal' and 'most athermal'."},"usage_notes":{"explanation":"'Athermal' is a technical term primarily used in physics and materials science. It describes something that is either unaffected by temperature changes or does not involve heat in its process. It is often used in the context of design or materials that need to maintain stability or function accurately regardless of temperature variations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The athermal coffee kept my drink hot all day.","correct":"✓ The insulated coffee cup kept my drink hot all day.","note":"'Athermal' means not producing or being affected by heat, not maintaining a specific temperature. Use 'insulated' or 'thermally insulated' for items that maintain temperature."}],"priority":"★★☆"},"related_words":{"derivatives":["athermally (adverb)"],"phrasal_verbs":[],"related_terms":["thermal","isothermal","diathermal"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Athermal' is a specialized term mainly used in scientific and engineering fields. It describes something that is either not affected by temperature changes or does not involve heat in its process. Understanding this term requires a background in physics or materials science. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The telescope's athermal design minimizes distortions caused by temperature gradients.","translation":"望遠鏡の非熱設計は、温度勾配によって引き起こされる歪みを最小限に抑える。","type":"adjective","meaning_category":"temperature-stable"},{"sentence":"Athermal polymerization can create polymers with unique properties.","translation":"非熱重合は、ユニークな特性を持つポリマーを作成することができる。","type":"adjective","meaning_category":"not requiring heat treatment"}]}