{"word":"Syntheticism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"総合主義（絵画における様式）","english_definition":"An artistic movement or style that aimed to synthesize form and color to create a simplified and expressive representation of reality.","examples":[{"sentence":"Syntheticism, with its emphasis on simplified forms and bold colors, influenced many artists of the late 19th century.","translation":"総合主義は、単純化された形と大胆な色彩を重視し、19世紀後半の多くの芸術家に影響を与えた。"},{"sentence":"Gauguin's work is often associated with Syntheticism due to his use of flat planes of color and symbolic imagery.","translation":"ゴーギャンの作品は、平面的な色彩と象徴的なイメージの使用により、総合主義と関連付けられることが多い。"}],"collocations":["artistic syntheticism","Gauguin and Syntheticism","Syntheticism in painting","post-impressionist Syntheticism"],"synonyms":["cloisonnism","symbolism","post-impressionism"],"antonyms":["naturalism","realism"]}],"etymology":{"value":"Derived from 'synthetic' (combining separate elements) + '-ism' (denoting a doctrine, principle, or movement).","priority":"★★☆"},"pronunciation":{"ipa":"/sɪnˈθɛtɪsɪzəm/","syllables":"syn-thet-i-cism"},"inflection":{"noun_plural":"Syntheticisms"},"usage_notes":{"explanation":"Syntheticism is primarily used in the context of art history and criticism, specifically when discussing the artistic movement that emerged in the late 19th century. It's not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The syntheticism of the building was impressive.","correct":"✓ The synthesis of the building's design was impressive.","note":"Syntheticism refers to an art style, not general synthesis. Use 'synthesis' for general combination. "},{"incorrect":"✗ He is a syntheticism artist.","correct":"✓ He is a Syntheticist artist.","note":"The correct term for an artist associated with Syntheticism is 'Syntheticist'."}],"priority":"★★☆"},"related_words":{"derivatives":["synthetic","synthesize","synthesist","Syntheticist"],"related_art_movements":["Symbolism","Cloisonnism","Post-Impressionism"],"artists_associated":["Paul Gauguin","Émile Bernard","Louis Anquetin"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Syntheticism' is a specialized term primarily used in art history to describe a specific artistic movement. It's not part of everyday vocabulary and requires a background in art to fully understand its meaning and context. The word itself suggests a focus on combining elements ('synthetic') into a unified whole, which is a key characteristic of the movement. "},"example_sentences":[{"sentence":"The exhibition showcased the key principles of Syntheticism, including the use of simplified forms and vibrant colors.","translation":"その展覧会では、単純化された形と鮮やかな色彩の使用を含む、総合主義の主要な原則が展示された。","type":"definition","meaning_category":"Artistic movement"},{"sentence":"Émile Bernard's paintings are often cited as examples of early Syntheticism.","translation":"エミール・ベルナールの絵画は、初期の総合主義の例としてよく引用される。","type":"example","meaning_category":"Artistic movement"},{"sentence":"Syntheticism sought to capture the essence of a subject rather than its literal appearance.","translation":"総合主義は、主題の文字通りの外観ではなく、その本質を捉えようとした。","type":"explanation","meaning_category":"Artistic movement"}]}