{"word":"interaxal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"軸間の、軸と軸の間の","english_definition":"Located or occurring between axes.","examples":[{"sentence":"The interaxal spacing of the wheels was carefully calculated.","translation":"車輪の軸間距離は慎重に計算された。"},{"sentence":"The interaxal forces were analyzed to determine the stability of the structure.","translation":"構造の安定性を判断するために、軸間の力が分析された。"}],"collocations":["interaxal distance","interaxal spacing","interaxal forces"],"synonyms":["between axes","axial"],"antonyms":["coaxial","on-axis"]}],"etymology":{"value":"The word \"interaxal\" is formed by combining the prefix \"inter-\" (meaning between) with the word \"axial\" (relating to an axis).","priority":"★★★"},"pronunciation":{"ipa":"ˌɪntərˈæksəl","syllables":"in-ter-ax-al"},"inflection":{"notes":"Since it is an adjective, it can have comparative and superlative forms, but they are rarely used. More common to use 'more interaxal' and 'most interaxal'"},"usage_notes":{"explanation":"The term \"interaxal\" is primarily used in technical or scientific contexts, particularly in engineering, physics, and mathematics, to describe the spatial relationship or forces between axes. It is not commonly used in everyday language.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The interaxial distance.","correct":"✓ The interaxal distance.","note":"Common misspelling is interaxial, but the correct spelling is interaxal."}],"priority":"★★★"},"related_words":{"derivatives":["axis","axial","inter-"],"related_terms":["coaxial","axial"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★★★"},"readability_explanation":{"level":"C2","text":"The word 'interaxal' is a technical term used in specialized fields like engineering and physics. It describes something located or occurring between axes. Due to its specific and technical nature, it's not commonly encountered in general English. Understanding requires familiarity with the concept of 'axis' in a scientific or mathematical context."},"example_sentences":[{"sentence":"The engineers adjusted the interaxal alignment of the robotic arm.","translation":"エンジニアはロボットアームの軸間アライメントを調整した。","type":"adjective","meaning_category":"technical"},{"sentence":"The interaxal magnetic field was measured with high precision.","translation":"軸間の磁場は高精度で測定された。","type":"adjective","meaning_category":"scientific"}]}