{"word":"pro-Gaelic","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"ゲール語を支持する、ゲール語擁護の","english_definition":"Supporting or promoting the Gaelic language and culture.","examples":[{"sentence":"The organization is pro-Gaelic and works to promote the language in schools.","translation":"その組織はゲール語を支持しており、学校でゲール語を推進するために活動しています。"},{"sentence":"He is a pro-Gaelic activist who campaigns for greater recognition of the language.","translation":"彼はゲール語擁護の活動家で、ゲール語のより大きな認知を求めて運動しています。"}],"collocations":["pro-Gaelic organization","pro-Gaelic activist","pro-Gaelic policy","pro-Gaelic movement"],"synonyms":["Gaelic-supporting","Gaelic-promoting"],"antonyms":["anti-Gaelic","Anglophile"]},{"part_of_speech":"noun","definition":"ゲール語支持者、ゲール語擁護者","english_definition":"A person who supports or promotes the Gaelic language and culture.","examples":[{"sentence":"The pro-Gaelics gathered to protest the lack of Gaelic programming on television.","translation":"ゲール語支持者たちは、テレビでのゲール語番組の不足に抗議するために集まりました。"}],"collocations":["strong pro-Gaelic","outspoken pro-Gaelic"],"synonyms":["Gaelic supporter","Gaelic advocate"],"antonyms":["anti-Gaelic","Anglophile"]}],"etymology":{"value":"The prefix 'pro-' indicates support or advocacy. 'Gaelic' refers to the Gaelic languages (Irish, Scottish Gaelic, Manx). Therefore, 'pro-Gaelic' means 'in favor of Gaelic'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊ ˈɡeɪlɪk/","syllables":"pro-Gael-ic"},"inflection":{"notes":"As an adjective, it can be used attributively (e.g., a pro-Gaelic policy) or predicatively (e.g., The policy is pro-Gaelic). As a noun, it is countable and can be pluralized (pro-Gaelics)."},"usage_notes":{"explanation":"'Pro-Gaelic' is used to describe individuals, groups, policies, or movements that actively support the preservation, promotion, and use of the Gaelic languages and associated cultures. It often implies a political or cultural stance in favor of maintaining or reviving Gaelic in the face of perceived threats from other languages or cultures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pro-Gaelic speaker.","correct":"✓ He is a Gaelic speaker and a pro-Gaelic activist.","note":"'Pro-Gaelic' describes support, not necessarily ability to speak the language. Someone can be pro-Gaelic without being fluent."}],"priority":"★★☆"},"related_words":{"derivatives":["Gaelic","Gaeldom","pro-"],"phrasal_verbs":[],"related_terms":["Gaelic League","Comunn na Gàidhlig","An Coimisiún"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pro-Gaelic' is a compound term used to describe support for the Gaelic languages (Irish, Scottish Gaelic, Manx) and their associated cultures. It is often used in the context of language revitalization efforts, cultural preservation, and political movements advocating for the rights and recognition of Gaelic speakers. The term implies an active and positive stance towards Gaelic, as opposed to indifference or opposition."},"example_sentences":[{"sentence":"The government's pro-Gaelic policies have been praised by language activists.","translation":"政府のゲール語擁護政策は、言語活動家から賞賛されています。","type":"adjective","meaning_category":"ゲール語を支持する"},{"sentence":"Many pro-Gaelics believe that more needs to be done to ensure the survival of the language.","translation":"多くのゲール語支持者は、言語の存続を確実にするためには、もっと多くのことをする必要があると信じています。","type":"noun","meaning_category":"ゲール語支持者"}]}