{"word":"non-refrigerated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"冷蔵されていない、冷蔵不要の","english_definition":"Not kept or stored in a refrigerator; not requiring refrigeration.","examples":[{"sentence":"This product is shelf-stable and can be stored non-refrigerated.","translation":"この製品は常温保存可能で、冷蔵せずに保管できます。"},{"sentence":"Non-refrigerated items should be stored in a cool, dry place.","translation":"冷蔵不要の品物は、涼しく乾燥した場所に保管してください。"},{"sentence":"The label indicates that the food can be stored non-refrigerated until opened.","translation":"ラベルには、開封するまで冷蔵せずに食品を保管できると記載されています。"}],"collocations":["store non-refrigerated","keep non-refrigerated","non-refrigerated storage","non-refrigerated food","non-refrigerated goods"],"synonyms":["ambient","shelf-stable","unrefrigerated"],"antonyms":["refrigerated","chilled","frozen"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'refrigerated'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn rɪˈfrɪdʒəreɪtɪd/","syllables":"non-re-frig-er-a-ted"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Non-refrigerated' describes items, typically food or beverages, that do not require refrigeration to prevent spoilage or maintain their quality. These items are often processed or packaged in a way that allows them to be stored at room temperature.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I put the non-refrigerated milk in the fridge.","correct":"✓ I put the milk that doesn't need to be refrigerated in the fridge.","note":"The mistake is using 'non-refrigerated' to describe milk that *doesn't need* refrigeration, but is still *being* refrigerated. The adjective describes the inherent property of the item, not where it's currently located."},{"incorrect":"✗ Nonrefrigerated food is always safe to eat.","correct":"✓ Non-refrigerated food is generally safe to eat if stored properly.","note":"While non-refrigerated food is designed to be shelf-stable, it still needs to be stored properly (e.g., in a cool, dry place) and consumed before its expiration date."}],"priority":"★★☆"},"related_words":{"derivatives":["refrigerate","refrigeration","refrigerator"],"phrases":["shelf-stable","ambient temperature","room temperature"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but understandable in context.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Non-refrigerated' means that something doesn't need to be kept in a fridge. It's often used for food that has been processed to last longer without refrigeration. You might see this word on packaging labels to indicate how to store the product. Remember that even if something is non-refrigerated, it still needs to be stored properly to prevent it from spoiling."},"example_sentences":[{"sentence":"The canned goods are all stored non-refrigerated in the pantry.","translation":"缶詰はすべて、パントリーに冷蔵せずに保管されています。","type":"adjective","meaning_category":"storage"},{"sentence":"Many types of dried fruit can be stored non-refrigerated for extended periods.","translation":"多くの種類のドライフルーツは、長期間冷蔵せずに保管できます。","type":"adjective","meaning_category":"food"},{"sentence":"The package clearly states that the product is non-refrigerated until opened.","translation":"パッケージには、製品は開封するまで冷蔵不要であることが明確に記載されています。","type":"adjective","meaning_category":"instructions"}]}