{"word":"karyotins","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(細胞学) カリオチン (染色質の主要なタンパク質成分)","english_definition":"(cytology) A term formerly used to describe the protein component of chromatin, now understood to be primarily histones.","examples":[{"sentence":"Karyotins were once thought to be a unique type of protein specific to the cell nucleus.","translation":"かつて、カリオチンは細胞核に特有のユニークなタンパク質の一種であると考えられていました。"}],"collocations":["karyotin structure","karyotin composition"],"synonyms":["histones","chromatin proteins"],"antonyms":[]}],"etymology":{"value":"Derived from karyon (nucleus) + -in (a suffix used to denote proteins).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkæriˈoʊtɪnz/","syllables":"ka-ry-o-tins"},"inflection":{"noun_plural":"karyotins"},"usage_notes":{"explanation":"The term 'karyotins' is largely obsolete in modern cell biology. It was used historically to refer to the protein components of chromatin, but now these proteins are more specifically identified as histones and other chromatin-associated proteins.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Karyotins are a type of DNA.","correct":"✓ Karyotins are proteins associated with DNA in chromatin.","note":"Karyotins are proteins, not DNA. They help organize and package DNA within the cell nucleus."}],"priority":"★★☆"},"related_words":{"derivatives":["karyon","karyoplasm","chromatin","histone"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な細胞生物学の文脈)","frequency_google_ngram":"Low frequency - 専門用語 (Low frequency - specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Karyotins' is a historical term from cell biology, referring to the protein components of chromatin, which are now better known as histones. This term is not commonly used in contemporary scientific literature, but may be encountered in older texts or discussions of the history of cell biology. Understanding the term requires a background in cell biology and molecular biology.","priority":"★★☆"},"example_sentences":[{"sentence":"Early studies of the cell nucleus focused on characterizing karyotins.","translation":"細胞核の初期の研究は、カリオチンの特性を明らかにすることに焦点を当てていました。","type":"noun","meaning_category":"細胞学"}]}