{"word":"dysplastic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"異形成の、形成異常の","english_definition":"Relating to or exhibiting dysplasia; characterized by abnormal development or growth of cells, tissues, or organs.","examples":[{"sentence":"The biopsy revealed dysplastic cells in the tissue sample.","translation":"生検の結果、組織サンプルに異形成細胞が見つかりました。"},{"sentence":"Dysplastic nevi are atypical moles that have a higher risk of developing into melanoma.","translation":"異形成母斑は、メラノーマに発展するリスクが高い非定型的なほくろです。"},{"sentence":"The pathologist identified dysplastic changes in the cervical cells.","translation":"病理医は、子宮頸部細胞に異形成の変化を確認しました。"}],"collocations":["dysplastic cells","dysplastic nevi","dysplastic tissue","dysplastic changes","cervical dysplasia","hip dysplasia"],"synonyms":["abnormal","atypical","malformed","anomalous","irregular"],"antonyms":["normal","typical","well-formed","regular","healthy"]}],"etymology":{"value":"From the prefix 'dys-' meaning 'bad' or 'abnormal' and 'plastic' relating to formation or development. Ultimately from Greek 'dys-' (δυσ-) meaning 'bad, difficult' and 'plassein' (πλάσσειν) meaning 'to mold or form'.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈplæstɪk/","syllables":"dis-plas-tic"},"inflection":{"notes":"Adjective; comparative and superlative forms are generally formed using 'more' and 'most' (e.g., more dysplastic, most dysplastic)."},"usage_notes":{"explanation":"'Dysplastic' is a medical term primarily used to describe cells or tissues that show abnormal growth or development. It indicates a deviation from the normal structure and organization of cells and is often associated with a risk of developing into cancerous conditions. The term is commonly used in pathology reports and medical diagnoses related to conditions like cervical dysplasia, hip dysplasia, and dysplastic nevi. It is important to note that 'dysplastic' does not necessarily mean cancerous, but rather indicates a higher risk of developing cancer.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The doctor said the cells were plastic.","correct":"The doctor said the cells were dysplastic.","note":"'Plastic' refers to something made of plastic material, while 'dysplastic' refers to abnormal cell growth. These terms are very different and should not be confused."},{"incorrect":"Dysplasia is the same as cancer.","correct":"Dysplasia is not the same as cancer, but it can increase the risk of developing cancer.","note":"Dysplasia indicates abnormal cell growth, which may or may not lead to cancer. It is a precancerous condition in some cases, but not always."}],"priority":"★★☆"},"related_words":{"derivatives":["dysplasia (noun: abnormal growth or development of cells or tissues)","dysplastically (adverb: in a dysplastic manner)"],"phrasal_verbs":[],"related_medical_terms":["neoplasia","hyperplasia","metaplasia","anaplasia","carcinoma in situ"]},"level_frequency":{"CEFR":"C2 (Specialized vocabulary used in medical contexts)","frequency_google_ngram":"Low frequency (Primarily used in medical and scientific contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dysplastic' is a technical term used in medicine to describe cells or tissues that exhibit abnormal growth or development. It's derived from 'dys-' (meaning bad or abnormal) and 'plastic' (referring to formation). This term is often found in medical reports, particularly in pathology, when discussing potential precancerous conditions. It's crucial to understand that 'dysplastic' doesn't automatically mean cancerous, but it indicates an increased risk that cells may become cancerous over time. Examples include dysplastic nevi (atypical moles) and cervical dysplasia (abnormal changes in cervical cells)."},"example_sentences":[{"sentence":"The patient was diagnosed with cervical dysplasia after a routine Pap smear.","translation":"患者は、定期的なパップスメア検査の結果、子宮頸部異形成と診断されました。","type":"medical diagnosis","meaning_category":"abnormal cell growth"},{"sentence":"Histological examination revealed dysplastic changes in the esophageal lining.","translation":"組織学的検査により、食道内膜に異形成の変化が認められました。","type":"pathology report","meaning_category":"abnormal tissue development"},{"sentence":"Regular monitoring is essential for dysplastic nevi to detect any signs of malignant transformation.","translation":"悪性転換の兆候を検出するためには、異形成母斑の定期的なモニタリングが不可欠です。","type":"medical management","meaning_category":"atypical moles"}]}