{"word":"inhalator","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"吸入器、吸入薬","english_definition":"A device for inhaling medication, typically used for respiratory conditions such as asthma.","examples":[{"sentence":"He uses an inhalator to manage his asthma symptoms.","translation":"彼は喘息の症状を管理するために吸入器を使っています。"},{"sentence":"The doctor prescribed an inhalator to help with her breathing difficulties.","translation":"医師は彼女の呼吸困難を助けるために吸入器を処方しました。"},{"sentence":"Make sure to always carry your inhalator with you, especially during exercise.","translation":"特に運動中は、必ず吸入器を携帯するようにしてください。"}],"collocations":["asthma inhalator (喘息用吸入器)","metered-dose inhalator (定量吸入器)","dry powder inhalator (ドライパウダー吸入器)","rescue inhalator (レスキュー吸入器、頓服薬として使用する吸入器)","steroid inhalator (ステロイド吸入器)"],"synonyms":["vaporizer","nebulizer","atomizer"],"antonyms":[]}],"etymology":{"value":"From 'inhale' + '-ator'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɪnhəleɪtər/","syllables":"in-ha-la-tor"},"inflection":{"noun_plural":"inhalators"},"usage_notes":{"explanation":"An 'inhalator' is a device used to administer medication directly into the lungs. It is commonly used by people with asthma, COPD, or other respiratory conditions. There are different types of inhalators, such as metered-dose inhalators (MDIs) and dry powder inhalators (DPIs).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to inhale my inhalator.","correct":"✓ I need to use my inhalator. / ✓ I need to take a puff from my inhalator.","note":"You don't 'inhale' the inhalator itself; you 'use' it or 'take a puff' from it. The inhalator helps you inhale the medication."},{"incorrect":"✗ He has a bad cough, he needs a nebulizer.","correct":"✓ He has a bad cough, he needs an inhalator. / ✓ He has a bad cough, he needs a nebulizer (if the cough is very severe).","note":"While both inhalators and nebulizers deliver medication to the lungs, inhalators are more commonly used for quick relief of asthma symptoms. Nebulizers are often used for more severe respiratory issues or for young children who cannot use inhalators effectively."}],"priority":"★★☆"},"related_words":{"derivatives":["inhale (verb)","inhalation (noun)"],"phrasal_verbs":[],"related_medical_terms":["asthma","COPD","bronchodilator","corticosteroid","respiratory disease"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'inhalator' refers to a device that helps people breathe in medicine. It's often used by people who have trouble breathing, like those with asthma. There are different kinds of inhalators, but they all do the same thing: they help get medicine into your lungs so you can breathe easier. It's important to use an inhalator correctly, as directed by a doctor or pharmacist, to ensure the medicine works properly.","priority":"★★★"},"example_sentences":[{"sentence":"She reached for her inhalator as she felt her chest tightening.","translation":"彼女は胸が締め付けられるのを感じて、吸入器に手を伸ばした。","type":"noun","meaning_category":"吸入器"},{"sentence":"The nurse showed him how to use the inhalator correctly.","translation":"看護師は彼に吸入器の正しい使い方を教えた。","type":"noun","meaning_category":"吸入器"},{"sentence":"He always keeps a spare inhalator in his bag.","translation":"彼はいつも予備の吸入器をバッグに入れている。","type":"noun","meaning_category":"吸入器"}]}