{"word":"submaniacal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"軽躁的な、軽躁病の気がある","english_definition":"Slightly manic; exhibiting symptoms of submania, a less severe form of mania.","examples":[{"sentence":"His behavior was described as submaniacal, characterized by increased energy and talkativeness.","translation":"彼の行動は軽躁的だとされ、エネルギーの増加とおしゃべり好きが特徴だった。"},{"sentence":"The doctor suspected a submaniacal episode based on the patient's elevated mood and impulsivity.","translation":"医師は、患者の気分の高揚と衝動性に基づいて、軽躁病のエピソードを疑った。"}],"collocations":["submaniacal episode","submaniacal behavior","submaniacal symptoms"],"synonyms":["hypomanic","slightly manic","elated","overexcited"],"antonyms":["depressed","lethargic","subdued"]}],"etymology":{"value":"'sub-' (under, less than) + 'maniacal' (relating to mania). Indicates a condition that is less severe than full-blown mania.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌbməˈnaɪəkəl/","syllables":"sub-ma-ni-a-cal"},"inflection":{"adjective_forms":{"comparative":"more submaniacal","superlative":"most submaniacal"}},"usage_notes":{"explanation":"'Submaniacal' describes a state that is similar to mania but less intense. It's often used in a clinical context to describe someone exhibiting elevated mood, increased energy, and talkativeness, but without the severe impairment of judgment or functioning seen in full mania.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was submaniacal because he drank too much coffee.","correct":"✓ His behavior was likely due to the caffeine, not a submaniacal state.","note":"While caffeine can cause increased energy, it doesn't necessarily indicate a submaniacal state, which is a specific clinical condition."}],"priority":"★☆☆"},"related_words":{"derivatives":["submania (noun): A less severe form of mania, also known as hypomania.","mania (noun): A state of abnormally elevated arousal, affect, and energy level, or 'a state of madness'.","maniacal (adjective): Exhibiting extremely wild or violent behavior."]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'submaniacal' is a technical term primarily used in psychology and psychiatry. It describes a state of mind that is similar to mania, but less severe. Understanding this word requires familiarity with the concept of mania and the prefixes used to indicate degree or intensity. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"During the submaniacal phase, she felt unusually creative and productive.","translation":"軽躁的な段階の間、彼女は異常なほど創造的で生産的だと感じた。","type":"adjective","meaning_category":"軽躁的な"},{"sentence":"The patient's submaniacal symptoms included rapid speech and a decreased need for sleep.","translation":"患者の軽躁的な症状には、早口と睡眠時間の減少が含まれていた。","type":"adjective","meaning_category":"軽躁的な"}]}