{"word":"devouringly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"むさぼり食うように、貪欲に、熱心に","english_definition":"In a manner that shows great hunger or eagerness; greedily or voraciously.","examples":[{"sentence":"She read the book devouringly, unable to put it down.","translation":"彼女はその本をむさぼるように読み、手放すことができなかった。"},{"sentence":"The children ate the cookies devouringly after their long hike.","translation":"子供たちは長いハイキングの後、クッキーをむさぼり食った。"},{"sentence":"He watched the performance devouringly, captivated by every detail.","translation":"彼はそのパフォーマンスを貪欲に見つめ、細部に至るまで魅了された。"}],"collocations":["read devouringly","eat devouringly","watch devouringly","listen devouringly"],"synonyms":["greedily","voraciously","eagerly","avidly","hungrily","insatiably"],"antonyms":["slowly","reluctantly","disinterestedly","apathetically"]}],"etymology":{"value":"The word \"devouringly\" comes from the verb \"devour,\" which originates from the Old French word \"devorer,\" meaning \"to swallow down, consume.\" This, in turn, comes from the Latin word \"devorare,\" which combines \"de-\" (completely) and \"vorare\" (to swallow). The suffix \"-ingly\" is added to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈvaʊərɪŋli/","syllables":"de-vour-ing-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Devouringly\" is an adverb that describes an action done with great eagerness or hunger, either literally (in the context of eating) or figuratively (in the context of consuming information or experiences). It suggests a strong, almost insatiable desire.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He devouringly is eating the cake.","correct":"✓ He is eating the cake devouringly.","note":"Adverbs typically go after the verb or after the object if there is one."},{"incorrect":"✗ She has a devouringly appetite.","correct":"✓ She has a devouring appetite.","note":"\"Devouring\" is the adjective form, while \"devouringly\" is the adverb form. Use the adjective to describe the noun \"appetite.\""}],"priority":"★★☆"},"related_words":{"derivatives":["devour (verb)","devouring (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Devouringly\" is an adverb that describes doing something with great eagerness or enthusiasm, like reading a book you can't put down or eating food when you're very hungry. It's not a very common word, so you'll mostly find it in more advanced texts."},"example_sentences":[{"sentence":"The critic watched the play devouringly, taking notes on every scene.","translation":"評論家はその劇をむさぼるように見つめ、すべてのシーンについてメモを取った。","type":"adverb","meaning_category":"熱心に"},{"sentence":"She listened to his stories devouringly, hanging on every word.","translation":"彼女は彼の話をむさぼるように聞き、一言一句に耳を傾けた。","type":"adverb","meaning_category":"熱心に"},{"sentence":"The hikers drank the water devouringly after their long trek in the sun.","translation":"ハイカーたちは太陽の下での長いトレッキングの後、水をむさぼるように飲んだ。","type":"adverb","meaning_category":"貪欲に"}]}