{"word":"Paphiopedilum","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"パフィオペディルム属 (アツモリソウ亜科のランの属)","english_definition":"A genus of orchids in the subfamily Cypripedioideae, commonly known as lady's slipper orchids.","examples":[{"sentence":"Paphiopedilum orchids are prized for their unique pouch-shaped flowers.","translation":"パフィオペディルム属のランは、独特の袋状の花で珍重されています。"},{"sentence":"Many Paphiopedilum species are endangered due to habitat loss and over-collection.","translation":"多くのパフィオペディルム属の種は、生息地の喪失と過剰な採取により絶滅の危機に瀕しています。"}],"collocations":["Paphiopedilum orchid","Paphiopedilum species","cultivate Paphiopedilum","grow Paphiopedilum"],"synonyms":["lady's slipper orchid"],"antonyms":[]}],"etymology":{"value":"The name Paphiopedilum is derived from Paphos (a city in Cyprus associated with Aphrodite) and pedilon (Greek for 'slipper'), referring to the slipper-like shape of the flower's labellum.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpæfioʊˈpɛdɪləm/","syllables":"Paf-i-o-ped-i-lum"},"inflection":{"noun_plural":"Paphiopedilums"},"usage_notes":{"explanation":"Paphiopedilum is a genus of orchids, so it is treated as a singular noun when referring to the genus as a whole, but the plural form 'Paphiopedilums' can be used when referring to multiple species or individual plants within the genus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Paphiopedilum are beautiful flowers.","correct":"✓ Paphiopedilum is a beautiful genus of flowers.","note":"When referring to the genus as a whole, use the singular form of the verb."},{"incorrect":"✗ Paphiopedilum's flower is very unique.","correct":"✓ The Paphiopedilum flower is very unique.","note":"When referring to a specific flower of a Paphiopedilum, use the article 'The' or a possessive pronoun."}],"priority":"★★☆"},"related_words":{"derivatives":["Cypripedioideae (亜科: アツモリソウ亜科)","orchid (名詞: ラン)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Paphiopedilum' is a scientific term used to refer to a specific genus of orchids, commonly known as lady's slipper orchids. Due to its specialized nature, it is typically encountered in botanical contexts or among orchid enthusiasts. The term itself is derived from Greek roots, reflecting the flower's unique slipper-like shape. Understanding its usage requires familiarity with botanical nomenclature and orchid cultivation practices."},"example_sentences":[{"sentence":"The greenhouse was filled with various species of **Paphiopedilum**.","translation":"温室は様々な種類のパフィオペディルム属でいっぱいだった。","type":"noun","meaning_category":"ランの属"},{"sentence":"**Paphiopedilum** orchids are known for their long-lasting flowers.","translation":"パフィオペディルム属のランは、花持ちが良いことで知られている。","type":"noun","meaning_category":"ランの属"},{"sentence":"The rare **Paphiopedilum** rothschildianum is highly sought after by collectors.","translation":"希少なパフィオペディルム・ロスチャイルディアナムは、収集家によって非常に求められている。","type":"noun","meaning_category":"ランの属"}]}