{"word":"behavioralism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"行動主義、行動科学主義","english_definition":"An approach in political science and other social sciences that seeks to explain and predict political behavior using scientific methods, focusing on observable actions and empirical data rather than abstract concepts or ideologies.","examples":[{"sentence":"Behavioralism revolutionized the study of political science by emphasizing empirical observation and quantitative analysis.","translation":"行動主義は、経験的な観察と定量的な分析を重視することで、政治学の研究に革命をもたらした。"},{"sentence":"Critics of behavioralism argue that it overlooks the importance of values and ideas in shaping political behavior.","translation":"行動主義の批判者たちは、それが政治行動を形成する上での価値観や理念の重要性を見過ごしていると主張している。"},{"sentence":"The rise of behavioralism in the mid-20th century led to a greater emphasis on data collection and statistical analysis in social science research.","translation":"20世紀半ばの行動主義の台頭は、社会科学研究におけるデータ収集と統計分析の重視につながった。"}],"collocations":["political behavioralism (政治行動主義)","behavioralism approach (行動主義的アプローチ)","empirical behavioralism (経験的行動主義)","post-behavioralism (ポスト行動主義)"],"synonyms":["behaviorism","behavioral science","empirical analysis"],"antonyms":["traditionalism","idealism","normativism"]},{"part_of_speech":"noun","definition":"行動主義心理学","english_definition":"A school of psychology that focuses on observable behaviors and the environmental factors that influence them, rejecting the study of internal mental states.","examples":[{"sentence":"Behavioralism in psychology emphasizes the role of learning and conditioning in shaping behavior.","translation":"心理学における行動主義は、行動を形成する上での学習と条件付けの役割を強調する。"},{"sentence":"Early behavioralism largely ignored cognitive processes, focusing instead on stimulus-response relationships.","translation":"初期の行動主義は、認知プロセスをほとんど無視し、刺激と反応の関係に焦点を当てていた。"},{"sentence":"While behavioralism has been influential, it has also been criticized for its reductionist approach to human behavior.","translation":"行動主義は影響力がある一方で、人間の行動に対する還元主義的なアプローチであるとして批判もされている。"}],"collocations":["radical behavioralism (徹底的行動主義)","methodological behavioralism (方法論的行動主義)","cognitive behavioralism (認知行動主義)","behavioral therapy (行動療法)"],"synonyms":["behaviorism","stimulus-response psychology"],"antonyms":["cognitive psychology","psychoanalysis"]}],"etymology":{"value":"Derived from 'behavior' (observable actions) + '-al' (relating to) + '-ism' (a doctrine or practice).","priority":"★★☆"},"pronunciation":{"ipa":"/bɪˈheɪvjərəlɪzəm/","syllables":"be-hav-ior-al-ism"},"inflection":{"notes":"Noun, uncountable."},"usage_notes":{"explanation":"'Behavioralism' refers to a specific approach within social sciences, particularly political science and psychology. It emphasizes the use of empirical data and scientific methods to study observable behaviors, rather than relying on abstract theories or introspection. In political science, it seeks to explain political behavior through measurable actions. In psychology, it focuses on how environmental factors influence behavior. It is often contrasted with traditional approaches that emphasize values, ideas, or internal mental states.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Behavioralism is the same as behavior.","correct":"Behavioralism is a scientific approach to studying behavior.","note":"'Behavior' refers to actions, while 'behavioralism' is a methodology for studying those actions."},{"incorrect":"Behavioralism only focuses on internal thoughts.","correct":"Behavioralism focuses on observable actions, not internal thoughts.","note":"Behavioralism intentionally avoids studying internal mental states."}],"priority":"★★☆"},"related_words":{"derivatives":["behavioral (adjective)","behaviorally (adverb)","behaviorist (noun)"],"phrases":["behavioral economics","behavioral finance","behavioral therapy","cognitive behavioral therapy"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic and scholarly contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Behavioralism' is a term used in academic fields like political science and psychology. It's about studying people's actions in a scientific way, focusing on what you can see and measure, rather than just guessing what they're thinking or feeling. Think of it as trying to understand why people vote a certain way by looking at data, or how people learn by observing their actions and the results of those actions. It's a specific way of studying behavior using data and scientific methods."},"example_sentences":[{"sentence":"The behavioralism approach to political science seeks to identify patterns in voting behavior.","translation":"政治学への行動主義的アプローチは、投票行動のパターンを特定しようとする。","type":"general","meaning_category":"Political Science"},{"sentence":"Early behavioralism in psychology focused on classical and operant conditioning.","translation":"心理学における初期の行動主義は、古典的条件付けとオペラント条件付けに焦点を当てていた。","type":"general","meaning_category":"Psychology"},{"sentence":"Post-behavioralism emerged as a critique of the limitations of strict behavioralism.","translation":"ポスト行動主義は、厳格な行動主義の限界に対する批判として登場した。","type":"general","meaning_category":"General"}]}