{"word":"Koroseal","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A brand of flexible polyvinyl chloride (PVC) plastic used for various applications, including upholstery, wall coverings, and protective coatings.","english_definition":"A brand name for a flexible polyvinyl chloride (PVC) plastic used in various applications.","examples":[{"sentence":"The chairs were upholstered in durable Koroseal.","translation":"椅子は耐久性のあるコロシールで張り替えられていた。"},{"sentence":"Koroseal wall coverings are easy to clean.","translation":"コロシールの壁材は掃除が簡単だ。"}],"collocations":["Koroseal upholstery","Koroseal wall covering","Koroseal coating"],"synonyms":["PVC","vinyl","polyvinyl chloride"],"antonyms":[]}],"etymology":{"value":"Derived from the B.F. Goodrich Company's trade name for their flexible PVC product. The exact origin of the name is proprietary, but it likely combines elements suggesting 'corrosion resistance' and 'seal'.","priority":"2"},"pronunciation":{"ipa":"ˈkɔːrəˌsiːl","syllables":"Ko-ro-seal"},"inflection":{"noun_plural":"Koroseals"},"usage_notes":{"explanation":"'Koroseal' is a specific brand name, but it is sometimes used generically to refer to similar flexible PVC materials, especially in older contexts. It is known for its durability, water resistance, and ease of cleaning.","priority":"2"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to koroseal the wall.","correct":"✓ I need to apply a Koroseal wall covering to the wall.","note":"'Koroseal' is a noun (a material), not a verb. You apply Koroseal, you don't 'koroseal' something."}],"priority":"1"},"related_words":{"derivatives":["None"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"1"},"readability_explanation":{"level":"C1","text":"'Koroseal' is a specialized term referring to a specific brand of flexible PVC plastic. Understanding its use requires familiarity with materials science and manufacturing contexts. While not a common term, it may appear in discussions of historical or specialized applications of plastics."},"example_sentences":[{"sentence":"The vintage car's interior was restored using original Koroseal materials.","translation":"そのヴィンテージカーの内装は、オリジナルのコロシール素材を使用して修復された。","type":"noun","meaning_category":"Material"},{"sentence":"Koroseal was a popular choice for seating in public transportation during the mid-20th century.","translation":"コロシールは、20世紀半ばの公共交通機関の座席によく使用されていた。","type":"noun","meaning_category":"Application"}]}