{"word":"zone-marked","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"区域指定された、特定の区域に区分けされた","english_definition":"Designated or divided into zones; specifically marked to indicate different zones or areas.","examples":[{"sentence":"The parking lot was zone-marked to indicate areas for employees and visitors.","translation":"駐車場は従業員用と訪問者用の区域を示すために区域指定されていた。"},{"sentence":"The factory floor was zone-marked for safety, with different areas designated for specific tasks.","translation":"工場の床は安全のために区域指定されており、特定の作業のために異なる区域が指定されていた。"}],"collocations":["zone-marked parking","zone-marked area","zone-marked for safety"],"synonyms":["zoned","designated","partitioned","sectioned","demarcated"],"antonyms":["unmarked","undesignated","unpartitioned"]}],"etymology":{"value":"The word is a compound of 'zone' (referring to an area or region with specific characteristics or purpose) and 'marked' (indicating that it has been labeled or designated).","priority":"★★★"},"pronunciation":{"ipa":"/ˈzoʊn mɑːrkt/","syllables":"zone-marked"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"'Zone-marked' is typically used to describe a physical space that has been divided into different zones or areas, often with specific markings or labels to indicate the purpose or restrictions of each zone. It implies a deliberate and organized division of space.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The map was zone-marking.","correct":"✓ The map was zone-marked.","note":"'Zone-marking' would refer to the act of creating zones, while 'zone-marked' describes something that has already been divided into zones."}],"priority":"★★☆"},"related_words":{"derivatives":["zone","mark","zoning"],"phrasal_verbs":[],"related_terms":["zone map","zone designation","zone planning"]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'zone-marked' is a relatively specialized term, typically used in contexts related to urban planning, safety regulations, or organizational management where the division of space into distinct zones is important. Understanding the term requires familiarity with the concept of zoning and the use of markings to delineate different areas."},"example_sentences":[{"sentence":"The construction site was carefully zone-marked to prevent accidents.","translation":"建設現場は事故を防ぐために注意深く区域指定されていた。","type":"general","meaning_category":"Safety and organization"},{"sentence":"The warehouse was zone-marked to optimize storage and retrieval of goods.","translation":"倉庫は商品の保管と検索を最適化するために区域指定されていた。","type":"business","meaning_category":"Logistics and storage"}]}