{"word":"heezed","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"Simple past tense and past participle of 'heeze'. 'Heeze' is a Scottish and Northern English dialect word meaning to lift or raise something heavy, often with difficulty.","english_definition":"Past tense and past participle of the dialectal verb 'heeze', meaning to lift or raise something heavy.","examples":[{"sentence":"He heezed the sack of potatoes onto his shoulder.","translation":"彼はジャガイモの袋を肩に担ぎ上げた。"},{"sentence":"She heezed herself up from the chair with a groan.","translation":"彼女はうめき声を上げながら椅子から体を持ち上げた。"}],"collocations":["heeze up","heeze onto","heeze over"],"synonyms":["lift","hoist","raise","heave"],"antonyms":["lower","drop","descend"]}],"etymology":{"value":"From Middle English 'hesen', 'heisen', from Old English 'hēsan' meaning 'to raise, lift up'. Related to Dutch 'hijsen' and German 'hissen', both meaning 'to hoist'. Primarily found in Scottish and Northern English dialects.","priority":"★★☆"},"pronunciation":{"ipa":"/hiːzd/","syllables":"heezed"},"inflection":{"verb_forms":{"present_simple":["heeze","heezes"],"past_simple":"heezed","past_participle":"heezed","present_participle":"heezing"}},"usage_notes":{"explanation":"'Heeze' is a dialectal term, primarily used in Scotland and Northern England. It implies lifting something heavy with considerable effort. While not standard English, it provides a vivid description of the action.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I heezed the box easily.","correct":"✓ I lifted the box easily.","note":"'Heeze' implies difficulty. If the action was easy, use a more general term like 'lift'."},{"incorrect":"✗ He heezed the flag up the pole.","correct":"✓ He hoisted the flag up the pole.","note":"For raising flags or sails, 'hoist' is the more appropriate term."}],"priority":"★★☆"},"related_words":{"derivatives":["heezing (present participle, can be used as an adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Dialectal, not typically included in CEFR)","frequency_google_ngram":"Very low frequency (dialectal)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Heezed' is the past tense and past participle of 'heeze', a dialectal verb primarily used in Scotland and Northern England. It means to lift or raise something heavy with effort. Due to its dialectal nature, it's not commonly encountered in standard English. Understanding its meaning requires familiarity with regional vocabulary. Its usage adds a specific color to descriptions involving physical exertion.","priority":"★☆☆"},"example_sentences":[{"sentence":"The farmer heezed the bale of hay onto the cart.","translation":"農夫は干し草の俵を荷車に担ぎ上げた。","type":"verb","meaning_category":"lift with effort"},{"sentence":"She heezed the heavy suitcase into the overhead compartment.","translation":"彼女は重いスーツケースを頭上の荷物入れに持ち上げた。","type":"verb","meaning_category":"raise with difficulty"}]}