{"word":"Coltun","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of hair matting or tangling, often associated with poor hygiene or neglect.","english_definition":"A condition in which hair becomes severely matted and tangled, forming a large, solid mass.","examples":[{"sentence":"The feral child's hair was a massive coltun.","translation":"野生児の髪は巨大なコルトゥンだった。"},{"sentence":"Lack of grooming can lead to the formation of a coltun.","translation":"手入れ不足はコルトゥンの形成につながる可能性がある。"}],"collocations":["form a coltun","remove a coltun","severe coltun"],"synonyms":["matted hair","dreadlocks (sometimes, but not always)","hair tangle"],"antonyms":["well-groomed hair","detangled hair"]}],"etymology":{"value":"The term 'coltun' is believed to originate from Polish 'kołtun', which refers to matted hair. It has historical associations with superstitions and folk medicine.","priority":"N/A"},"pronunciation":{"ipa":"/ˈkɔltən/","syllables":"Col-tun"},"inflection":{"noun_plural":"coltuns"},"usage_notes":{"explanation":"A coltun is more than just a simple hair tangle; it's a dense, often hardened mass of hair. Historically, it was sometimes associated with illness or curses, leading to reluctance to remove it. Modern understanding attributes it to poor hygiene, lack of grooming, or certain medical conditions.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ She had a small coltun in her hair.","correct":"✓ She had some matted hair in her hair.","note":"'Coltun' typically refers to a large, significant matting, not just a small tangle."}],"priority":"N/A"},"related_words":{"derivatives":["kołtun (Polish)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - a relatively uncommon word.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Coltun' is a rare and specialized term referring to severely matted hair. It is unlikely to be encountered in everyday conversation and is more likely to appear in historical, medical, or anthropological contexts. Understanding the term requires a high level of vocabulary and cultural awareness."},"example_sentences":[{"sentence":"The historical accounts describe people who refused to cut their coltun due to superstitious beliefs.","translation":"歴史的な記録には、迷信的な信念のためにコルトゥンを切ることを拒否した人々が記述されている。","type":"noun","meaning_category":"hair matting"},{"sentence":"Proper hair care can prevent the development of a coltun.","translation":"適切なヘアケアはコルトゥンの発生を防ぐことができる。","type":"noun","meaning_category":"hair matting"}]}