{"word":"flesher","meanings":[{"part_of_speech":"noun","definition":"(歴史的な職業) 皮なめし職人、獣皮を処理する人","english_definition":"A person whose occupation is to remove flesh from hides in preparation for tanning.","examples":[{"sentence":"The flesher used a special knife to scrape the remaining flesh from the animal hide.","translation":"皮なめし職人は、動物の皮から残りの肉を削り取るために特殊なナイフを使った。"}],"synonyms":["skinner","hide processor"],"antonyms":[]},{"part_of_speech":"noun","definition":"(道具) 皮なめし用の肉削ぎナイフ、皮から肉を取り除くための道具","english_definition":"A tool used to remove flesh from hides.","examples":[{"sentence":"The museum displayed various antique fleshers used in the traditional tanning process.","translation":"博物館では、伝統的な皮なめし工程で使用された様々なアンティークの肉削ぎナイフが展示されていた。"}],"synonyms":["fleshing knife","hide scraper"],"antonyms":[]}],"etymology":{"value":"From the verb 'flesh' (to remove flesh from a hide) + '-er' (suffix indicating a person or thing that performs an action).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈflɛʃər/","syllables":"flesh-er"},"inflection":{"noun_plural":"fleshers"},"usage_notes":{"explanation":"The term \"flesher\" refers both to the person who performs the task of removing flesh from hides and to the tool they use. It is most commonly encountered in historical contexts or discussions of traditional leatherworking techniques.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["flesh (verb, noun)","fleshing (noun)"],"priority":"★☆☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word \"flesher\" is relatively uncommon in modern English. It is primarily used in historical contexts or when discussing traditional leatherworking. Understanding the term requires knowledge of the process of tanning hides.","priority":"★☆☆"},"example_sentences":[{"sentence":"The archaeologist found several bone fleshers at the ancient tannery site.","translation":"考古学者は古代の皮なめし工場跡地でいくつかの骨製の肉削ぎ道具を発見した。","type":"noun","meaning_category":"道具"},{"sentence":"In the 18th century, the flesher was an essential worker in the leather industry.","translation":"18世紀には、皮なめし職人は皮革産業において不可欠な労働者だった。","type":"noun","meaning_category":"職業"}]}