{"word":"object-matter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"対象、問題、議題","english_definition":"The thing or subject with which one is occupied or concerned; the topic or issue under consideration.","examples":[{"sentence":"The object-matter of the meeting was the proposed budget cuts.","translation":"会議の対象事項は、提案された予算削減だった。"},{"sentence":"The object-matter of his research is the impact of climate change on coastal ecosystems.","translation":"彼の研究対象は、気候変動が沿岸生態系に与える影響である。"},{"sentence":"The object-matter of the dispute was the ownership of the land.","translation":"紛争の対象事項は、その土地の所有権だった。"}],"collocations":["object-matter of discussion","object-matter of research","object-matter of debate","object-matter of concern"],"synonyms":["subject matter","topic","theme","issue","point at issue","matter in hand"],"antonyms":[]}],"etymology":{"value":"A compound word formed from 'object' (something presented to the senses or the mind) and 'matter' (a subject under consideration).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɒbdʒɪkt ˈmætər/","syllables":"ob-ject-mat-ter"},"inflection":{"noun_plural":"object-matters"},"usage_notes":{"explanation":"'Object-matter' is a somewhat formal or technical term used to refer to the specific subject or topic being discussed, studied, or considered. It emphasizes the concrete or tangible aspect of the subject. It is often used in academic, legal, or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The object-matter are complex.","correct":"✓ The object-matter is complex.","note":"'Object-matter' is a singular noun, so it takes a singular verb ('is')."},{"incorrect":"✗ The object-matter of the book was interesting, but the writing was poor.","correct":"✓ The subject matter of the book was interesting, but the writing was poor.","note":"'Subject matter' is a more common and natural-sounding alternative to 'object-matter' in general usage."}],"priority":"★★☆"},"related_words":{"derivatives":["objective (adjective: relating to facts and not influenced by personal feelings or opinions)","subjective (adjective: based on or influenced by personal feelings, tastes, or opinions)","matter (noun: a subject or situation)","object (noun: a thing that can be seen or touched)"],"phrases":["in question (under discussion)","at issue (in dispute)","under consideration (being thought about)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in formal or technical writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Object-matter' is a formal term that refers to the specific topic or subject being discussed or studied. It's not commonly used in everyday conversation but is more likely to appear in academic papers, legal documents, or technical reports. It's similar in meaning to 'subject matter' but has a slightly more technical or formal tone.","priority":"★★☆"},"example_sentences":[{"sentence":"The committee focused on the object-matter of environmental regulations.","translation":"委員会は、環境規制という対象事項に焦点を当てた。","type":"noun","meaning_category":"対象、問題、議題"},{"sentence":"The object-matter of his thesis was the evolution of artificial intelligence.","translation":"彼の論文の対象事項は、人工知能の進化だった。","type":"noun","meaning_category":"対象、問題、議題"},{"sentence":"The object-matter of the investigation is the alleged fraud.","translation":"調査の対象事項は、申し立てられた詐欺である。","type":"noun","meaning_category":"対象、問題、議題"}]}