{"word":"candescently","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"白熱して、光り輝いて","english_definition":"In a candescent manner; with a glowing or luminous intensity; emitting light as a result of being heated.","examples":[{"sentence":"The metal filament glowed candescently within the vacuum tube.","translation":"金属フィラメントは真空管の中で白熱して光り輝いた。"},{"sentence":"The lava flowed candescently down the volcano's slopes.","translation":"溶岩は火山の斜面を光り輝きながら流れ下った。"}],"collocations":["glow candescently","shine candescently","burn candescently"],"synonyms":["glowingly","luminously","radiantly","brilliantly"],"antonyms":["dimly","darkly","opaquely"]}],"etymology":{"value":"Derived from 'candescent', which comes from the Latin word 'candescere', meaning 'to begin to glow' or 'to become white'.","priority":"★★☆"},"pronunciation":{"ipa":"/kænˈdɛsəntli/","syllables":"can-des-cent-ly"},"inflection":{"notes":"This is an adverb and does not have different forms."},"usage_notes":{"explanation":"'Candescently' describes something that emits light due to being heated. It is often used in technical or scientific contexts to describe the glowing of materials at high temperatures. It is a relatively uncommon word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The stars shone candescently in the night sky, reflecting the sun's light.","correct":"✓ The stars shone brightly in the night sky, reflecting the sun's light.","note":"'Candescently' implies that the light is emitted due to heat. Stars shine due to nuclear fusion, but 'brightly' is a more general term for shining light."}],"priority":"★☆☆"},"related_words":{"derivatives":["candescent (adjective)","candescence (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Candescently' is a high-level word used to describe the manner in which something glows due to being heated. It's not commonly used in everyday language and is more likely to appear in scientific or technical writing."},"example_sentences":[{"sentence":"The iron bar, heated in the forge, began to glow candescently.","translation":"鍛冶場で熱せられた鉄の棒は、白熱して光り始めた。","type":"adverb","meaning_category":"光り輝いて"},{"sentence":"The bulb burned candescently, illuminating the room with a warm, orange light.","translation":"電球は白熱して燃え、部屋を暖かくオレンジ色の光で照らした。","type":"adverb","meaning_category":"光り輝いて"}]}