{"word":"judgmental-eyed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"批判的な目をしている、人を裁くような目つきをしている","english_definition":"Having an expression in the eyes that indicates a tendency to judge people harshly or critically.","examples":[{"sentence":"The librarian gave him a judgmental-eyed stare when he returned the book late.","translation":"彼が本を返却するのが遅れたとき、図書館員は彼を批判的な目で睨みつけた。"},{"sentence":"She couldn't help but feel uncomfortable under his judgmental-eyed gaze.","translation":"彼女は彼の批判的な目つきの下で居心地の悪さを感じざるを得なかった。"},{"sentence":"The painting depicted a figure with a stern, judgmental-eyed expression.","translation":"その絵は、厳格で人を裁くような目つきをした人物を描いていた。"}],"collocations":["judgmental-eyed stare (批判的な目つきの凝視)","judgmental-eyed look (批判的な目つき)","judgmental-eyed gaze (批判的な目つきの視線)"],"synonyms":["critical-eyed","disapproving-eyed","censorious-eyed","condemning-eyed","reproachful-eyed"],"antonyms":["accepting-eyed","forgiving-eyed","understanding-eyed","compassionate-eyed","nonjudgmental-eyed"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"judgmental\" (inclined to make judgments, especially moral ones) with \"eyed\" (having eyes of a specified kind). The term suggests that the person's judgmental attitude is evident in their eyes.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌdʒʌdʒˈmɛntəl aɪd/","syllables":"judge-men-tal-eyed"},"inflection":{"notes":"This is a compound adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Judgmental-eyed\" is used to describe someone whose eyes seem to express a critical or disapproving attitude. It implies that the person is quick to form negative opinions or judgments about others. The term is often used to convey a sense of discomfort or unease caused by the person's scrutinizing gaze.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He looked at me judgmental-eye.","correct":"✓ He looked at me with a judgmental-eyed expression.","note":"\"Judgmental-eyed\" is an adjective, so it needs to modify a noun (e.g., expression, look, stare). It cannot be used as an adverb to describe how someone looked. Use a prepositional phrase like \"with a judgmental-eyed expression\" instead."},{"incorrect":"✗ The judgmental-eyed person.","correct":"✓ The judgmental-eyed figure.","note":"While grammatically correct, \"judgmental-eyed person\" is less common and less descriptive than using it to modify a more specific noun like \"figure,\" \"stare,\" or \"look.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["judgmental (adjective)","judgmentally (adverb)"],"phrases":["give someone the side-eye (人を横目で見る、疑念や不承認を示す)","look daggers at someone (人を睨みつける)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (This is a relatively uncommon compound adjective.)","frequency_google_ngram":"Low Frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"\"Judgmental-eyed\" is a compound adjective that describes someone whose eyes convey a critical or disapproving attitude. It's a relatively uncommon term, but its meaning is easily understood by combining the meanings of \"judgmental\" (inclined to judge) and \"eyed\" (having eyes). It is used to create a vivid image of someone who is quick to form negative opinions or judgments about others, and whose eyes reflect this attitude. It's more literary and descriptive than simply saying someone is judgmental."},"example_sentences":[{"sentence":"The portrait showed a stern man with a **judgmental-eyed** expression, as if he disapproved of everyone who looked at him.","translation":"その肖像画は、自分を見る人すべてを不承認しているかのような、批判的な目つきをした厳格な男を描いていた。","type":"adjective","meaning_category":"批判的な目をしている"},{"sentence":"She felt self-conscious under the **judgmental-eyed** scrutiny of the fashion critics.","translation":"彼女はファッション評論家たちの批判的な目つきの監視の下で、自意識過剰になった。","type":"adjective","meaning_category":"人を裁くような目つきをしている"},{"sentence":"Even though he tried to be friendly, there was a **judgmental-eyed** quality to his gaze that made people uneasy.","translation":"彼は友好的であろうとしたが、彼の視線には人を裁くような性質があり、人々を不安にさせた。","type":"adjective","meaning_category":"批判的な目をしている"}]}