{"word":"pseudocharitably","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"偽善的に慈善的に、見せかけだけで慈善的に","english_definition":"In a manner that appears charitable but is not genuinely so; hypocritically charitable.","examples":[{"sentence":"He pseudocharitably donated a small sum to the charity, mainly for the publicity.","translation":"彼は広報目的で、偽善的に少額を慈善団体に寄付した。"},{"sentence":"She pseudocharitably offered her help, but it was clear she didn't really want to be involved.","translation":"彼女は見せかけだけで援助を申し出たが、本当は関わりたくないのが明らかだった。"}],"collocations":["donate pseudocharitably","offer help pseudocharitably","act pseudocharitably"],"synonyms":["hypocritically","insincerely","ostentatiously","superficially"],"antonyms":["genuinely","sincerely","charitably"]}],"etymology":{"value":"Formed by combining \"pseudo-\" (meaning false or fake) with \"charitably\" (in a charitable manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈtʃærɪtəbli/","syllables":"pseu-do-char-i-ta-bly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"The adverb \"pseudocharitably\" describes actions that appear to be charitable but are motivated by insincere reasons, such as seeking publicity or maintaining a positive image. It implies a level of hypocrisy, where the person performing the action does not genuinely care about the welfare of others. The word is relatively uncommon and often used in contexts where the insincerity is being criticized or highlighted.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted pseudocharity.","correct":"✓ He acted pseudocharitably.","note":"\"Pseudocharity\" is a noun, while \"pseudocharitably\" is an adverb. Use the adverb to modify a verb. "},{"incorrect":"✗ She gave pseudocharitable to the poor.","correct":"✓ She gave pseudocharitably to the poor.","note":"\"Pseudocharitable\" is an adjective, while \"pseudocharitably\" is an adverb. Use the adverb to describe how the giving was done."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudocharity (noun): False or insincere charity.","pseudocharitable (adjective): Appearing charitable but not genuinely so."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"pseudocharitably\" is a relatively rare and sophisticated term. It describes actions done in a way that seems charitable on the surface, but are actually motivated by insincere or self-serving reasons. Understanding this word requires a grasp of the prefix \"pseudo-\" (meaning false or fake) and the concept of genuine charity. It's often used in critical or analytical contexts to expose hypocrisy or insincerity."},"example_sentences":[{"sentence":"The corporation pseudocharitably sponsored the event to improve its public image after the scandal.","translation":"その企業はスキャンダルの後、世間のイメージを良くするために、偽善的にイベントを後援した。","type":"adverb","meaning_category":"偽善的に慈善的に"},{"sentence":"He pseudocharitably offered his old clothes to the homeless shelter, but they were all ripped and unusable.","translation":"彼は見せかけだけでホームレスシェルターに古着を提供したが、すべて破れていて使い物にならなかった。","type":"adverb","meaning_category":"見せかけだけで慈善的に"}]}