{"word":"tributo","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"貢物、献上品、賛辞、敬意","english_definition":"tribute, offering, homage, respect","examples":[{"sentence":"La ciudad pagó un tributo al rey.","translation":"The city paid tribute to the king. (その都市は王に貢物を納めた。)"},{"sentence":"Este premio es un tributo a su arduo trabajo.","translation":"This award is a tribute to his hard work. (この賞は彼の努力への賛辞です。)"},{"sentence":"Le rindieron tributo a los héroes caídos.","translation":"They paid tribute to the fallen heroes. (彼らは戦没した英雄に敬意を払った。)"}],"collocations":["rendir tributo a (pay tribute to)","tributo a la memoria de (tribute to the memory of)","pagar tributo (pay tribute)"],"synonyms":["homenaje","ofrenda","reconocimiento","elogio","respeto"],"antonyms":["insulto","desprecio"]}],"etymology":{"value":"Latin 'tributum' (a thing contributed or paid, tax, tribute), from 'tribuere' (to assign, allot, attribute).","priority":"★★☆"},"pronunciation":{"ipa":"/tɾiˈβuto/","syllables":"tri-bu-to"},"inflection":{"noun_plural":"tributos"},"usage_notes":{"explanation":"'Tributo' refers to something given or done to show gratitude, respect, or admiration. It can be a physical offering, a payment, or an expression of praise.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"El tributo fue muy caro.","correct":"El impuesto fue muy caro.","note":"'Tributo' is not the same as 'impuesto' (tax), although it can sometimes refer to a payment. 'Impuesto' is the more common word for tax."}],"priority":"★★☆"},"related_words":{"derivatives":["tributar (to pay tribute, to honor)","tributario (tributary, relating to taxes or tributes)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'tributo' is used to describe an act of showing respect or gratitude, often through a gift, payment, or public acknowledgment. It's commonly used in contexts of honoring someone's achievements or memory. It is not the same as 'impuesto' (tax), although it can sometimes refer to a payment or offering. The word is of medium frequency and is generally understood by advanced learners of Spanish."},"example_sentences":[{"sentence":"La banda hizo un tributo a los Beatles.","translation":"The band made a tribute to the Beatles. (そのバンドはビートルズへのトリビュートを行った。)"},{"sentence":"El museo exhibe los tributos de las antiguas civilizaciones.","translation":"The museum exhibits the tributes of ancient civilizations. (その博物館は古代文明の貢物を展示している。)"},{"sentence":"El poema es un tributo a la belleza de la naturaleza.","translation":"The poem is a tribute to the beauty of nature. (その詩は自然の美しさへの賛辞である。)"}]}