{"word":"allergen-marked","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アレルゲン表示がされている、アレルゲンに関する表示が付いている","english_definition":"Having a label or marking indicating the presence of allergens.","examples":[{"sentence":"The product is clearly allergen-marked, making it easier for consumers with allergies to identify potential risks.","translation":"その製品にはアレルゲン表示が明確にされているため、アレルギーを持つ消費者が潜在的なリスクを特定しやすくなっています。"},{"sentence":"Allergen-marked foods are essential for ensuring the safety of individuals with food allergies.","translation":"アレルゲン表示がされている食品は、食物アレルギーを持つ個人の安全を確保するために不可欠です。"},{"sentence":"The restaurant menu is allergen-marked, allowing customers to make informed choices.","translation":"レストランのメニューにはアレルゲン表示がされており、顧客は情報に基づいた選択をすることができます。"}],"collocations":["clearly allergen-marked (明確にアレルゲン表示がされている)","properly allergen-marked (適切にアレルゲン表示がされている)","allergen-marked food (アレルゲン表示がされている食品)","allergen-marked product (アレルゲン表示がされている製品)","allergen-marked menu (アレルゲン表示がされているメニュー)"],"synonyms":["allergy-labeled","allergy-marked","allergen-labeled"],"antonyms":["allergen-free","unmarked"]},{"part_of_speech":"verb","definition":"アレルゲン表示をする、アレルゲンに関する表示を付ける","english_definition":"To label or mark something to indicate the presence of allergens.","examples":[{"sentence":"The company is required to allergen-mark all products containing common allergens.","translation":"その会社は、一般的なアレルゲンを含むすべての製品にアレルゲン表示をすることが義務付けられています。"},{"sentence":"They allergen-marked the packaging to comply with regulations.","translation":"彼らは規制を遵守するために、パッケージにアレルゲン表示をしました。"},{"sentence":"The new law requires all restaurants to allergen-mark their menus.","translation":"新しい法律では、すべてのレストランがメニューにアレルゲン表示をすることが義務付けられています。"}],"collocations":["allergen-mark a product (製品にアレルゲン表示をする)","allergen-mark packaging (包装にアレルゲン表示をする)","allergen-mark a menu (メニューにアレルゲン表示をする)"],"synonyms":["allergy-label","allergy-mark","allergen-label"],"antonyms":["remove allergen marking","omit allergen marking"]}],"etymology":{"value":"The term \"allergen-marked\" is a compound word formed by combining \"allergen\" (a substance that causes an allergic reaction) and \"marked\" (having a mark or label).","priority":"☆☆☆"},"pronunciation":{"ipa":"ˈælərdʒən mɑːrkt","syllables":"al-ler-gen-marked"},"inflection":{"verb_forms":{"present_simple":["allergen-mark","allergen-marks"],"past_simple":"allergen-marked","past_participle":"allergen-marked","present_participle":"allergen-marking"}},"usage_notes":{"explanation":"\"Allergen-marked\" is used to describe products, foods, or menus that have been labeled to indicate the presence of substances known to cause allergic reactions. This is crucial for individuals with food allergies or sensitivities to make informed decisions about what they consume.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The food is allergen mark.","correct":"✓ The food is allergen-marked.","note":"The correct form is \"allergen-marked,\" which is an adjective. Using \"allergen mark\" is grammatically incorrect."},{"incorrect":"✗ Allergen mark is important.","correct":"✓ Allergen marking is important.","note":"When referring to the act of marking allergens, use \"allergen marking\" as a noun phrase."}],"priority":"☆☆☆"},"related_words":{"derivatives":["allergen","allergy","marking","labeling"],"phrases":["allergen information","food allergy","allergy awareness"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The term \"allergen-marked\" is used to describe items, especially food products or menus, that have been labeled to show the presence of allergens. This is important for people with allergies so they can avoid foods that might cause a reaction. The term is generally used in contexts related to food safety, health, and consumer information. Understanding this term requires a good grasp of vocabulary related to health and safety."},"example_sentences":[{"sentence":"Allergen-marked products help consumers with allergies make safe choices.","translation":"アレルゲン表示がされている製品は、アレルギーを持つ消費者が安全な選択をするのに役立ちます。","type":"adjective","meaning_category":"アレルゲン表示がされている"},{"sentence":"The company must allergen-mark all products containing nuts.","translation":"その会社は、ナッツを含むすべての製品にアレルゲン表示をしなければなりません。","type":"verb","meaning_category":"アレルゲン表示をする"},{"sentence":"The allergen-marked menu made it easy for me to find safe options.","translation":"アレルゲン表示がされているメニューのおかげで、安全な選択肢を簡単に見つけることができました。","type":"adjective","meaning_category":"アレルゲン表示がされている"}]}