{"word":"nonco-operator","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非協力者、非協力的な人","english_definition":"A person who refuses to cooperate, especially with an authority or in a collective effort.","examples":[{"sentence":"He was labeled a nonco-operator for refusing to participate in the project.","translation":"彼はプロジェクトへの参加を拒否したため、非協力者とみなされた。"},{"sentence":"The government struggled to deal with the large number of nonco-operators.","translation":"政府は多数の非協力者への対応に苦慮した。"}],"collocations":["labeled as a nonco-operator","deal with nonco-operators"],"synonyms":["dissenter","objector","resister","rebel"],"antonyms":["cooperator","collaborator","ally"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'co-operator'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.kəʊˈɒp.ə.reɪ.tər/","syllables":"non-co-op-er-a-tor"},"inflection":{"noun_plural":"nonco-operators"},"usage_notes":{"explanation":"The term 'nonco-operator' is often used in political or organizational contexts to describe individuals who actively or passively resist collaboration or compliance. It can carry a negative connotation, implying obstruction or unwillingness to work towards a common goal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non-cooperator person.","correct":"✓ He is a nonco-operator.","note":"'Nonco-operator' is already a noun referring to a person, so adding 'person' is redundant."}],"priority":"★★☆"},"related_words":{"derivatives":["noncooperation (noun): The act of refusing to cooperate.","cooperate (verb): To work together towards a common goal.","cooperation (noun): The process of working together.","cooperative (adjective): Willing to cooperate."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonco-operator' is relatively uncommon and is typically used in formal or specialized contexts. Understanding its meaning requires familiarity with the prefix 'non-' and the concept of cooperation. The word is most likely to be encountered in discussions of politics, organizational behavior, or social movements."},"example_sentences":[{"sentence":"The company fired several employees who were identified as nonco-operators.","translation":"会社は非協力者と判断された従業員数名を解雇した。","type":"example","meaning_category":"general"},{"sentence":"Gandhi's philosophy of noncooperation influenced many nonco-operators in the Indian independence movement.","translation":"ガンジーの非協力主義は、インド独立運動における多くの非協力者に影響を与えた。","type":"historical","meaning_category":"political"},{"sentence":"The project failed because of the high number of nonco-operators among the team members.","translation":"プロジェクトは、チームメンバーの中に非協力者が多かったために失敗した。","type":"organizational","meaning_category":"workplace"}]}