{"word":"hyposexuality","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"性的欲求減退症、性的関心の低下","english_definition":"A condition characterized by abnormally low or absent sexual desire or libido.","examples":[{"sentence":"Hyposexuality can be caused by various factors, including hormonal imbalances, psychological issues, and certain medications.","translation":"性的欲求減退症は、ホルモンバランスの乱れ、心理的な問題、特定の薬など、さまざまな要因によって引き起こされる可能性があります。"},{"sentence":"Treatment for hyposexuality often involves addressing the underlying cause.","translation":"性的欲求減退症の治療は、多くの場合、根本的な原因に対処することを含みます。"}],"collocations":["low libido","decreased sexual desire","sexual dysfunction","hormonal imbalance","psychological factors"],"synonyms":["inhibited sexual desire","low sexual desire","decreased libido","sexual apathy"],"antonyms":["hypersexuality","increased libido","high sexual desire"]}],"etymology":{"value":"The term 'hyposexuality' is formed from the prefix 'hypo-' meaning 'below' or 'deficient', combined with 'sexuality', referring to sexual desire or activity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊsekʃuˈæləti/","syllables":"hy-po-sex-u-al-i-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hyposexuality is a medical and psychological term used to describe a persistent or recurrent deficiency or absence of sexual fantasies and desire for sexual activity. It is considered a sexual dysfunction when it causes significant distress or interpersonal difficulties. It's important to differentiate between a natural variation in sexual interest and a clinically significant condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hyposexuality is the same as asexuality.","correct":"✓ Hyposexuality is a condition of low sexual desire, while asexuality is a lack of sexual attraction.","note":"Hyposexuality is a medical condition characterized by low sexual desire, while asexuality is a sexual orientation characterized by a lack of sexual attraction to others."}],"priority":"★★☆"},"related_words":{"derivatives":["hyposexual (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hyposexuality' is a technical term used in medicine and psychology to describe a condition where an individual experiences a persistent lack of sexual desire or fantasies. It is important to note that this term is used when the lack of sexual interest causes distress or interpersonal difficulties, distinguishing it from natural variations in sexual interest or asexuality, which is a sexual orientation characterized by a lack of sexual attraction."},"example_sentences":[{"sentence":"The patient reported experiencing hyposexuality following the start of a new medication.","translation":"患者は、新しい薬の服用開始後に性的欲求減退症を経験したと報告しました。","type":"noun","meaning_category":"medical condition"},{"sentence":"Hyposexuality can be a symptom of underlying depression or anxiety.","translation":"性的欲求減退症は、潜在的なうつ病や不安神経症の症状である可能性があります。","type":"noun","meaning_category":"medical symptom"}]}