{"word":"pietistic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"信心深いふりをする、信心過剰な、敬虔主義的な","english_definition":"excessively or affectedly pious; marked by an excessive or affected devotion to religious principles and practices.","examples":[{"sentence":"The novel criticized the town's pietistic attitudes.","translation":"その小説は、町の信心過剰な態度を批判した。"},{"sentence":"He adopted a pietistic tone when discussing religion.","translation":"彼は宗教について話すとき、信心深いふりをする口調になった。"},{"sentence":"The community was known for its strict and pietistic lifestyle.","translation":"そのコミュニティは、厳格で敬虔主義的なライフスタイルで知られていた。"}],"collocations":["pietistic attitude","pietistic tone","pietistic lifestyle","pietistic fervor","pietistic language"],"synonyms":["sanctimonious","self-righteous","holier-than-thou","devout","religious","pious","moralistic","hypocritical"],"antonyms":["secular","irreligious","atheistic","agnostic","worldly","profane"]}],"etymology":{"value":"Derived from 'pietism,' a 17th-century movement within Lutheranism that emphasized personal piety and religious experience. The suffix '-istic' indicates a characteristic or relating to pietism.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaɪɪˈtɪstɪk/","syllables":"pie-et-is-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be modified by adverbs like 'very' or 'somewhat' (e.g., 'very pietistic')."},"usage_notes":{"explanation":"'Pietistic' usually carries a negative connotation, suggesting that the person or behavior is excessively or insincerely pious. It often implies a judgmental or hypocritical attitude towards others. While 'pious' can be neutral or positive, 'pietistic' is almost always critical.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a pietistic scientist, always praying before experiments.","correct":"✓ He was a devout scientist, always praying before experiments.","note":"'Devout' is more appropriate when describing genuine religious devotion without the negative connotation of affectation or hypocrisy. 'Pietistic' implies the devotion is insincere or excessive."},{"incorrect":"✗ The pietistic art was beautiful and inspiring.","correct":"✓ The religious art was beautiful and inspiring.","note":"Use 'religious' or 'devotional' to describe art that is simply related to religion, without implying insincerity or excessive piety."}],"priority":"★★☆"},"related_words":{"derivatives":["pietism (noun): A 17th-century movement within Lutheranism emphasizing personal piety.","pietist (noun): A follower of pietism.","piety (noun): Religious devotion and reverence to God."],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pietistic' describes someone or something characterized by excessive or affected religious devotion. It is often used critically to suggest that the person's piety is insincere or exaggerated. This word is not commonly used in everyday conversation and is more often found in academic or literary contexts when discussing religious movements or criticisms of religious hypocrisy."},"example_sentences":[{"sentence":"The play satirized the pietistic attitudes of the town's elders.","translation":"その劇は、町の長老たちの信心過剰な態度を風刺した。","type":"adjective","meaning_category":"excessively pious"},{"sentence":"Her pietistic pronouncements were met with skepticism by her colleagues.","translation":"彼女の信心深い発言は、同僚たちから懐疑的に受け止められた。","type":"adjective","meaning_category":"affectedly pious"},{"sentence":"The historian examined the pietistic influences on the art of the period.","translation":"歴史家は、その時代の芸術に対する敬虔主義的な影響を調査した。","type":"adjective","meaning_category":"relating to pietism"}]}