{"word":"Effeminising","priority":"☆☆☆","meanings":[{"part_of_speech":"verb (present participle)","definition":"Making a male appear or behave in a way traditionally associated with women.","english_definition":"Present participle of effeminise: to make (a man or boy) appear or behave in a way traditionally associated with women.","examples":[{"sentence":"The media is often accused of effeminising men.","translation":"メディアはしばしば男性を女性化していると非難される。"},{"sentence":"He felt that the new fashion trends were effeminising the male image.","translation":"彼は新しいファッショントレンドが男性のイメージを女性化していると感じた。"}],"collocations":["effeminising influence","effeminising effect","effeminising trends"],"synonyms":["feminizing","emasculating","softening"],"antonyms":["masculinizing","virilizing"]},{"part_of_speech":"adjective","definition":"Having the effect of making a male appear or behave in a way traditionally associated with women.","english_definition":"Having the effect of effeminising.","examples":[{"sentence":"Some critics considered the play to have an effeminising influence on young men.","translation":"一部の批評家は、その劇が若い男性に女性化の影響を与えると見なした。"},{"sentence":"He worried about the effeminising effects of spending too much time indoors.","translation":"彼は屋内で過ごす時間が長すぎることによる女性化の影響を心配した。"}],"collocations":["effeminising influence","effeminising effect","effeminising fashion"],"synonyms":["feminizing","emasculating","softening"],"antonyms":["masculinizing","virilizing"]}],"etymology":{"value":"Derived from the verb 'effeminise', which comes from 'effeminate' (having qualities associated with women), ultimately from Latin 'ex-' (out of) + 'femina' (woman).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈfemɪnaɪzɪŋ/","syllables":"ef-fem-i-ni-sing"},"inflection":{"verb_forms":{"present_participle":"effeminising"}},"usage_notes":{"explanation":"'Effeminising' can be used as both a verb (present participle) and an adjective. As a verb, it describes the action of making someone or something appear more feminine. As an adjective, it describes something that has the effect of making someone appear more feminine. The term can be considered offensive depending on the context, as it implies that feminine traits are undesirable in men.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is effeminizing.","correct":"✓ He is being effeminised.","note":"'He is effeminising' implies he is actively making others feminine. 'He is being effeminised' implies someone is making him feminine."},{"incorrect":"✗ The effeminising is bad.","correct":"✓ The effeminising effect is bad.","note":"'Effeminising' is a verb or adjective, not a noun. Use 'effeminising effect' or a similar noun phrase."}],"priority":"★★☆"},"related_words":{"derivatives":["effeminise (verb)","effeminate (adjective)","effeminately (adverb)","effeminacy (noun)"],"synonyms":["feminizing","emasculating","softening","weakening"],"antonyms":["masculinizing","virilizing","strengthening"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'effeminising' describes the process or effect of making a male appear or behave in a way traditionally associated with women. It can be used as a verb (present participle) or an adjective. The term is often associated with discussions about gender roles and can be considered sensitive or offensive, depending on the context. It is important to be aware of the potential negative connotations when using this word."},"example_sentences":[{"sentence":"The artist was accused of effeminising the male protagonist in his latest painting.","translation":"そのアーティストは、最新の絵画で男性主人公を女性化していると非難された。","type":"verb (present participle)","meaning_category":"Making appear feminine"},{"sentence":"The effeminising influence of social media on young boys is a growing concern.","translation":"ソーシャルメディアが若い男の子に与える女性化の影響は、ますます懸念されている。","type":"adjective","meaning_category":"Having a feminizing effect"}]}