{"word":"marchers","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"行進者、デモ参加者","english_definition":"People who are marching, especially as part of a demonstration or parade.","examples":[{"sentence":"The marchers carried signs and chanted slogans.","translation":"行進者たちはプラカードを持ち、スローガンを唱えた。"},{"sentence":"Thousands of marchers participated in the protest.","translation":"数千人のデモ参加者が抗議運動に参加した。"}],"collocations":["peace marchers (平和行進者)","protest marchers (抗議デモ参加者)","civil rights marchers (公民権運動の行進者)"],"synonyms":["demonstrators","paraders","protesters"],"antonyms":["spectators","observers"]}],"etymology":{"value":"The word \"marchers\" is derived from the verb \"march,\" which comes from the Old French word \"marcher,\" meaning \"to walk, step, proceed.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɑːrtʃərz/","syllables":"march-ers"},"inflection":{"noun_plural":"marchers"},"usage_notes":{"explanation":"\"Marchers\" specifically refers to people actively participating in a march, often for a cause or celebration. It implies organized movement and purpose, distinguishing them from casual walkers or bystanders.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The marchers were marching on the street.","correct":"The marchers were marching down the street.","note":"Use \"down\" or \"along\" with \"marching\" to indicate direction on a street."}],"priority":"★★☆"},"related_words":{"derivatives":["march (verb, noun)","marching (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in news and historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Marchers\" refers to people who are walking together in a formal or organized way, often as part of a demonstration, parade, or protest. The word is generally used in contexts where people are moving together for a specific purpose, such as to show support for a cause or to celebrate an event. It's more common in news reports or historical accounts than in everyday conversation."},"example_sentences":[{"sentence":"The civil rights marchers faced significant opposition.","translation":"公民権運動の行進者たちは大きな反対に直面した。","type":"noun","meaning_category":"行進者"},{"sentence":"The parade featured colorful floats and enthusiastic marchers.","translation":"パレードは色鮮やかな山車と熱心な行進者たちを特色としていた。","type":"noun","meaning_category":"行進者"},{"sentence":"Police monitored the marchers closely.","translation":"警察は行進者たちを注意深く監視した。","type":"noun","meaning_category":"行進者"}]}