{"word":"dorsoventrally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"背腹方向に、背腹軸に沿って","english_definition":"In a dorsoventral direction; along the dorsoventral axis.","examples":[{"sentence":"The embryo is flattened dorsoventrally.","translation":"その胚は背腹方向に平坦化されている。"},{"sentence":"The muscles are arranged dorsoventrally.","translation":"筋肉は背腹方向に配置されている。"}],"collocations":["dorsoventrally flattened","dorsoventrally compressed"],"synonyms":["vertically","axially"],"antonyms":["laterally","horizontally"]}],"etymology":{"value":"Derived from \"dorsal\" (relating to the back) and \"ventral\" (relating to the abdomen or front), combined with the suffix \"-ly\" to form an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"ˌdɔːrsəʊˈvɛntrəli","syllables":"dor-so-ven-tral-ly"},"inflection":{"notes":"Adverb, so it does not inflect."},"usage_notes":{"explanation":"\"Dorsoventrally\" describes a direction or orientation relating to the back (dorsal) and the belly or front (ventral) of an organism or structure. It is commonly used in biology, anatomy, and developmental biology to describe how structures are arranged or how processes occur along the axis running from the back to the belly.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The leaf is dorsoventral.","correct":"✓ The leaf is dorsoventrally flattened.","note":"\"Dorsoventral\" is an adjective, while \"dorsoventrally\" is an adverb. Use the adjective to describe something possessing a back and belly, and the adverb to describe the direction or manner in which something is oriented or compressed."}],"priority":"★★☆"},"related_words":{"derivatives":["dorsal","ventral","dorsoventral (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Dorsoventrally\" is a technical term primarily used in biological and anatomical contexts. It describes something oriented or occurring along the axis from the back (dorsal) to the belly (ventral) side. Understanding requires familiarity with anatomical terminology. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The insect's body is dorsoventrally compressed, allowing it to fit into narrow crevices.","translation":"その昆虫の体は背腹方向に圧縮されており、狭い隙間に収まることができる。","type":"descriptive","meaning_category":"direction"},{"sentence":"The leaf's vascular bundles are arranged dorsoventrally to optimize light capture.","translation":"葉の維管束は、光の捕捉を最適化するために背腹方向に配置されている。","type":"descriptive","meaning_category":"direction"}]}