{"word":"Periodontology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"歯周病学","english_definition":"The branch of dentistry concerned with the structures surrounding and supporting the teeth (such as the gums and bone), and the diseases and conditions that affect them.","examples":[{"sentence":"Periodontology is a critical field in maintaining overall oral health.","translation":"歯周病学は、口腔全体の健康を維持する上で重要な分野です。"},{"sentence":"The dentist specialized in periodontology to treat gum disease.","translation":"その歯科医は歯周病を治療するために歯周病学を専門としています。"}],"collocations":["clinical periodontology","periodontology department","periodontology research","advanced periodontology"],"synonyms":["periodontics","gum disease treatment","oral medicine"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'peri' (around), 'odont' (tooth), and 'logy' (study of).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɪəriɒdɒnˈtɒlədʒi/","syllables":"pe-ri-o-don-tol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Periodontology is a specialized field within dentistry that focuses on the prevention, diagnosis, and treatment of diseases affecting the gums, bones, and other structures that support the teeth. Professionals in this field are called periodontists.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a periodontology appointment for my teeth cleaning.","correct":"✓ I have a dental appointment for my teeth cleaning. / ✓ I have a periodontology appointment to address my gum issues.","note":"Periodontology is specifically for gum and supporting tissue issues, not routine teeth cleaning."},{"incorrect":"✗ Periodontology is a doctor that treats gum disease.","correct":"✓ A periodontist is a doctor that treats gum disease. / ✓ Periodontology is the study of gum disease.","note":"Periodontology is the *study* of gum disease; a periodontist is the *doctor*."}],"priority":"★★☆"},"related_words":{"derivatives":["periodontal (adjective: relating to the tissues surrounding the teeth)","periodontist (noun: a dentist specializing in periodontology)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Periodontology' is a specialized term used in the field of dentistry. It refers to the study and treatment of the gums and supporting structures of the teeth. Understanding this term requires a background in medical or dental terminology. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The patient was referred to the periodontology department for treatment of severe gingivitis.","translation":"患者は重度の歯肉炎の治療のために歯周病科に紹介されました。","type":"general","meaning_category":"歯周病学"},{"sentence":"Advances in periodontology have significantly improved the treatment of aggressive periodontitis.","translation":"歯周病学の進歩により、侵襲性歯周炎の治療が大幅に改善されました。","type":"research","meaning_category":"歯周病学"}]}