{"word":"Suh","priority":"★☆☆","meanings":[{"part_of_speech":"interjection","definition":"(スラング)挨拶の一種。What's up? (調子はどう？) のくだけた言い方。特にアメリカ南部やアフリカ系アメリカ人のコミュニティで使われる。","english_definition":"(slang) A casual greeting, short for \"What's up?\". Commonly used in the Southern United States and within African American communities.","examples":[{"sentence":"Suh, how you doin' today?","translation":"よお、今日の調子はどう？"},{"sentence":"Suh dude, long time no see!","translation":"よお兄弟、久しぶり！"}],"collocations":["Suh, what's up?","Suh dude","Suh fam"],"synonyms":["What's up","Yo","Hey","How's it going","What's good"],"antonyms":["Goodbye","Farewell","See you later"]}],"etymology":{"value":"\"Suh\" is a shortened and informal pronunciation of \"Sir\" or \"What's up?\". Its usage evolved within specific communities, particularly in the Southern United States and African American Vernacular English (AAVE).","priority":"★★☆"},"pronunciation":{"ipa":"/sʌ/","syllables":"Suh"},"inflection":{},"usage_notes":{"explanation":"\"Suh\" is a very informal greeting, almost exclusively used among friends or acquaintances. It can be considered disrespectful in formal settings or when addressing someone of higher authority. The term is often associated with specific subcultures and may not be universally understood.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Suh, Mr. President.","correct":"✓ Good morning/afternoon, Mr. President.","note":"\"Suh\" is inappropriate for formal situations. Use standard greetings like \"Good morning\" or \"Good afternoon\" when addressing someone with respect or in a professional setting."},{"incorrect":"✗ Suh? I don't understand.","correct":"✓ Sorry, I don't understand.","note":"If you don't understand what someone said, use a polite phrase like \"Sorry, I don't understand\" instead of simply repeating \"Suh?\""}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_slang":["Wassup","Yo","Fam","Dude"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Slang - not typically included in CEFR)","frequency_google_ngram":"Low frequency (primarily used in specific communities)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Suh\" is a slang term, primarily used as a casual greeting among friends, especially in the Southern United States and within African American communities. It's a very informal shortening of \"What's up?\" or sometimes a playful take on \"Sir.\" Due to its informality and cultural context, it is not appropriate for formal settings or when addressing someone with authority. Understanding its usage requires familiarity with specific subcultures and slang. It is not typically included in standard English language learning materials."},"example_sentences":[{"sentence":"Suh, man, what you been up to?","translation":"よお、最近何してたんだ？","type":"interjection","meaning_category":"Greeting"},{"sentence":"He walked in and just said, \"Suh,\" to the whole crew.","translation":"彼は入ってきて、みんなに「よお」って言っただけだった。","type":"interjection","meaning_category":"Greeting"}]}