{"word":"virology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ウイルス学","english_definition":"The study of viruses – submicroscopic, parasitic particles of genetic material contained in a protein coat – and virus-like agents. It focuses on the following aspects of viruses: their structure, classification and evolution, their ways to infect and exploit host cells for reproduction, their interaction with host organism physiology and immunity, the diseases they cause, the techniques to isolate and culture them, and their use in research and therapy.","examples":[{"sentence":"Virology is a crucial field in understanding and combating infectious diseases.","translation":"ウイルス学は、感染症を理解し、対抗する上で重要な分野です。"},{"sentence":"The virology lab is equipped with advanced instruments for virus detection and analysis.","translation":"ウイルス学研究室には、ウイルスの検出と分析のための高度な機器が備わっています。"},{"sentence":"She specializes in virology, focusing on the study of emerging viral pathogens.","translation":"彼女はウイルス学を専門としており、新興のウイルス性病原体の研究に焦点を当てています。"}],"collocations":["clinical virology (臨床ウイルス学)","molecular virology (分子ウイルス学)","veterinary virology (獣医ウイルス学)","plant virology (植物ウイルス学)","environmental virology (環境ウイルス学)","diagnostic virology (診断ウイルス学)","virology lab (ウイルス学研究室)","virology research (ウイルス学研究)","virology studies (ウイルス学研究)"],"synonyms":["viral science","virus research"],"antonyms":[]}],"etymology":{"value":"From 'virus' + '-ology'. 'Virus' comes from Latin virus meaning 'poison, slime, offensive liquid'. '-ology' is a suffix denoting a branch of knowledge or science.","priority":"★★☆"},"pronunciation":{"ipa":"/vaɪˈrɒlədʒi/","syllables":"vi-rol-o-gy"},"inflection":{"notes":"It is an uncountable noun.","noun_plural":null},"usage_notes":{"explanation":"Virology is a specialized field of microbiology that deals exclusively with viruses. It encompasses a wide range of research areas, from basic viral biology to applied aspects such as vaccine development and antiviral therapies. The field is constantly evolving due to the emergence of new viral diseases and the increasing sophistication of research techniques.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a virologist who studies bacteria.","correct":"✓ He is a virologist who studies viruses.","note":"Virologists study viruses, not bacteria. Bacteriologists study bacteria."},{"incorrect":"✗ Virology is the study of all microorganisms.","correct":"✓ Virology is the study of viruses.","note":"Virology focuses specifically on viruses, while microbiology is the broader study of all microorganisms."}],"priority":"★★☆"},"related_words":{"derivatives":["virological (adj.)","virologist (noun)","pre-virology (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Virology is a specialized term referring to the scientific study of viruses. It is a complex field that requires a strong understanding of biology, chemistry, and genetics. The term is primarily used in academic, medical, and research contexts. Understanding the basic concepts of virology is essential for comprehending the nature of viral diseases, their transmission, and strategies for prevention and treatment.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor gave a lecture on the latest advancements in virology.","translation":"教授はウイルス学の最新の進歩について講義を行った。","type":"general","meaning_category":"Definition"},{"sentence":"The outbreak of the new virus prompted intensive virology research.","translation":"新しいウイルスの発生は、集中的なウイルス学研究を促した。","type":"research","meaning_category":"Research"},{"sentence":"She is pursuing a degree in virology to become a virus expert.","translation":"彼女はウイルス専門家になるためにウイルス学の学位を取得している。","type":"career","meaning_category":"Career"}]}