{"word":"cotrustee","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"共同受託者","english_definition":"One of two or more trustees who jointly manage a trust.","examples":[{"sentence":"As cotrustees, they were jointly responsible for managing the trust assets.","translation":"共同受託者として、彼らは信託財産の管理に共同で責任を負っていました。"},{"sentence":"The beneficiaries requested an accounting from the cotrustees.","translation":"受益者たちは共同受託者たちに会計報告を要求しました。"}],"collocations":["named as cotrustee","serving as cotrustee","appoint a cotrustee"],"synonyms":["joint trustee","co-fiduciary"],"antonyms":["sole trustee"]}],"etymology":{"value":"Formed from 'co-' (meaning 'joint' or 'together') and 'trustee' (a person who holds or controls property or assets for the benefit of another).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊtrʌˈstiː/","syllables":"co-trust-ee"},"inflection":{"noun_plural":"cotrustees"},"usage_notes":{"explanation":"A 'cotrustee' is one of multiple trustees who share responsibility for managing a trust. Unlike a sole trustee who has complete control, cotrustees must act together or in accordance with the trust document, and they share liability for decisions made regarding the trust.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is the co-trusty of the estate.","correct":"✓ He is the cotrustee of the estate.","note":"The correct term is 'cotrustee,' not 'co-trusty'."},{"incorrect":"✗ As cotrustee, she can make decisions alone.","correct":"✓ As cotrustee, she must make decisions jointly with the other trustees, unless the trust document specifies otherwise.","note":"Cotrustees generally must act together, unless the trust document grants individual authority."}],"priority":"★☆☆"},"related_words":{"derivatives":["trustee","trust","co-","fiduciary"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'cotrustee' is a legal term used in the context of trusts and estate planning. It refers to one of multiple individuals or entities responsible for jointly managing a trust's assets and fulfilling its terms. Understanding the responsibilities and liabilities associated with being a cotrustee requires familiarity with legal and financial concepts related to trusts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The court appointed two cotrustees to oversee the charitable trust.","translation":"裁判所は、慈善信託を監督するために2人の共同受託者を任命しました。","type":"example","meaning_category":"General usage"},{"sentence":"Each cotrustee has a fiduciary duty to act in the best interests of the beneficiaries.","translation":"各共同受託者は、受益者の最善の利益のために行動する受託者義務を負っています。","type":"example","meaning_category":"Responsibilities"},{"sentence":"The trust document outlined the specific powers and responsibilities of each cotrustee.","translation":"信託証書には、各共同受託者の具体的な権限と責任が明記されていました。","type":"example","meaning_category":"Trust documents"}]}