{"word":"zip-liner","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ジップラインをする人","english_definition":"A person who rides on a zip-line.","examples":[{"sentence":"The zip-liner enjoyed the thrilling ride through the forest canopy.","translation":"そのジップラインをする人は、森林の樹冠を通り抜けるスリリングな乗り心地を楽しんだ。"},{"sentence":"Experienced zip-liners often seek out courses with longer and faster lines.","translation":"経験豊富なジップラインをする人は、より長く、より速いラインを持つコースを探すことが多い。"}],"collocations":["experienced zip-liner","first-time zip-liner","professional zip-liner"],"synonyms":["zip-line rider","canopy tour participant"],"antonyms":[]}],"etymology":{"value":"The word is formed by combining \"zip-line\" (a cable or rope stretched between two points, down which a person can slide using a pulley) with the suffix \"-er\" (denoting a person who performs the action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈzɪpˌlaɪnər/","syllables":"zip-lin-er"},"inflection":{"noun_plural":"zip-liners"},"usage_notes":{"explanation":"The term \"zip-liner\" is straightforward and commonly used to refer to individuals who participate in the activity of riding a zip-line. It is often used in the context of adventure tourism, recreational activities, and outdoor experiences.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am a zip-lining.","correct":"✓ I am a zip-liner.","note":"\"Zip-lining\" is the activity itself (gerund), while \"zip-liner\" is the person doing the activity (noun)."},{"incorrect":"✗ He is a zip line rider.","correct":"✓ He is a zip-liner.","note":"While \"zip line rider\" is understandable, \"zip-liner\" is the more common and concise term."}],"priority":"★★☆"},"related_words":{"derivatives":["zip-line (noun: ジップライン)","zip-lining (noun: ジップラインをすること)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"zip-liner\" is a compound noun referring to someone who participates in the activity of zip-lining. It is relatively straightforward to understand, but its usage is specific to the context of adventure activities and tourism. Therefore, it is more commonly encountered by those familiar with or interested in such activities."},"example_sentences":[{"sentence":"The resort offers guided tours for both beginner and advanced **zip-liners**.","translation":"そのリゾートは、初心者と上級者の両方のジップラインをする人向けにガイド付きツアーを提供している。","type":"noun","meaning_category":"ジップラインをする人"},{"sentence":"As a **zip-liner**, safety is always my top priority.","translation":"ジップラインをする人として、安全は常に私の最優先事項です。","type":"noun","meaning_category":"ジップラインをする人"}]}