{"word":"Rampion","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"イトシャジン (キキョウ科の植物)","english_definition":"A Eurasian plant, *Campanula rapunculus*, of the bellflower family, with edible leaves and roots.","examples":[{"sentence":"Rampion was once commonly grown for its roots and leaves.","translation":"イトシャジンはかつて、その根と葉のために一般的に栽培されていました。"},{"sentence":"The salad included rampion leaves for a slightly bitter flavor.","translation":"サラダには、わずかに苦味のある風味のためにイトシャジンの葉が含まれていました。"}],"collocations":["grow rampion","eat rampion","rampion leaves","rampion root"],"synonyms":["rapunzel (sometimes used)"],"antonyms":[]},{"part_of_speech":"noun","definition":"(古語) ランピオン、特にその根","english_definition":"(archaic) The root of the rampion plant, used as a vegetable.","examples":[{"sentence":"The market sold rampion roots alongside other root vegetables.","translation":"市場では、他の根菜類と並んでランピオンの根が販売されていました。"}],"collocations":["rampion root","harvest rampion"],"synonyms":["rapunzel root"],"antonyms":[]}],"etymology":{"value":"From French *rampon*, diminutive of *rampe* 'claw, paw, root', from Old French *rampe*, of Germanic origin; related to Old High German *rimpfen* 'to wrinkle'. The plant's roots were thought to resemble claws.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈræmpiən/","syllables":"ram-pi-on"},"inflection":{"noun_plural":"rampions"},"usage_notes":{"explanation":"'Rampion' refers to a specific plant, *Campanula rapunculus*, and its edible parts, especially the root. It is not a commonly used word in modern English, but it appears in older literature and gardening contexts. The plant is also sometimes referred to as 'rapunzel', particularly in connection with the fairy tale.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought some rampions for my garden, but they were actually radishes.","correct":"✓ I bought some rampion seeds for my garden, but they didn't sprout.","note":"Rampion is a specific plant, not a general term for root vegetables. Ensure you are purchasing the correct seeds or plants. Radishes are a different vegetable."}],"priority":"★☆☆"},"related_words":{"derivatives":["rapunzel (related name, fairy tale character)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very low frequency)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Rampion' is a relatively obscure word referring to a specific plant species, *Campanula rapunculus*. It is unlikely to be encountered outside of specialized contexts such as botany, historical texts, or gardening. Understanding the term requires a familiarity with plant nomenclature and potentially historical agricultural practices."},"example_sentences":[{"sentence":"The recipe called for fresh rampion, but I couldn't find any at the market.","translation":"レシピでは新鮮なイトシャジンが必要でしたが、市場で見つけることができませんでした。","type":"noun","meaning_category":"plant"},{"sentence":"In old herbals, rampion was praised for its medicinal properties.","translation":"古い薬草書では、イトシャジンはその薬効が称賛されていました。","type":"noun","meaning_category":"plant"}]}