{"word":"king-of-the-herrings","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"リュウグウノツカイ","english_definition":"A very long, ribbon-shaped fish of the genus Regalecus, known for its bright red fins and small, toothless mouth.","examples":[{"sentence":"The king-of-the-herrings is rarely seen near the surface.","translation":"リュウグウノツカイは水面近くで見られることはめったにない。"},{"sentence":"Fishermen were surprised to find a king-of-the-herrings washed ashore.","translation":"漁師たちはリュウグウノツカイが打ち上げられているのを見つけて驚いた。"}],"collocations":["catch a king-of-the-herrings","king-of-the-herrings sighting","king-of-the-herrings washed ashore"],"synonyms":["oarfish","ribbonfish"],"antonyms":[]}],"etymology":{"value":"The name \"king-of-the-herrings\" likely comes from the fish's crown-like dorsal fin and its supposed ability to lead schools of herring.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɪŋ əv ðə ˈhɛrɪŋz/","syllables":"king-of-the-her-rings"},"inflection":{"noun_plural":"king-of-the-herrings (no change for plural)"},"usage_notes":{"explanation":"The term \"king-of-the-herrings\" is a common name for fish in the genus Regalecus, particularly Regalecus glesne. These fish are known for their elongated, ribbon-like bodies and are often associated with myths and legends due to their unusual appearance and deep-sea habitat. Sightings of king-of-the-herrings are relatively rare, and they are often seen as omens in some cultures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a kings of the herrings.","correct":"✓ I saw a king-of-the-herrings.","note":"The plural form remains \"king-of-the-herrings,\" similar to \"fish\"."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["Regalecus glesne (Giant oarfish)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"\"King-of-the-herrings\" is a specialized term referring to a specific type of fish, the Regalecus glesne, also known as the giant oarfish. Due to its deep-sea habitat and infrequent sightings, this term is not commonly used in everyday conversation. Understanding the term requires knowledge of marine biology and the ability to comprehend scientific or descriptive texts about sea creatures. The name itself is derived from folklore, suggesting the fish's supposed ability to lead schools of herring, which adds a cultural dimension to its understanding."},"example_sentences":[{"sentence":"Scientists are studying the behavior of the king-of-the-herrings to understand more about deep-sea ecosystems.","translation":"科学者たちは深海生態系についてより深く理解するために、リュウグウノツカイの行動を研究している。","type":"noun","meaning_category":"fish"},{"sentence":"The appearance of a king-of-the-herrings near the shore often attracts media attention.","translation":"リュウグウノツカイが海岸近くに現れることは、しばしばメディアの注目を集める。","type":"noun","meaning_category":"fish"}]}