{"word":"polysynthesism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"抱合語（ほうご）: 一つの語に多くの接辞や語根を含み、文全体の意味を表す言語の類型。","english_definition":"A type of language in which single words can consist of long strings of morphemes, often incorporating objects and other elements that would be expressed as separate words in other languages; a high degree of synthesis.","examples":[{"sentence":"Many indigenous languages of North America exhibit polysynthesism.","translation":"北米の多くの先住民族の言語は抱合語の性質を示す。"}],"collocations":["polysynthetic language (抱合語)"],"synonyms":["holophrastic language"],"antonyms":["isolating language","analytic language"],"notes":"Polysynthesism is a degree of synthesis even higher than that found in agglutinative languages. A polysynthetic language often incorporates what would be free morphemes (independent words) in other languages into a single word.","related_terms":["morphology","agglutinative language","synthetic language","isolating language"]}],"etymology":{"value":"From poly- (many) + synthesis (combining elements). The term reflects the idea of many elements being synthesized or combined into a single word.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒliˈsɪnθɪsɪzəm/","syllables":"pol-y-syn-the-sism"},"inflection":{"noun_plural":"polysynthesisms"},"usage_notes":{"explanation":"Polysynthesism is a linguistic typology term. It refers to languages where words are highly complex, often containing multiple roots and affixes that express what other languages would express in entire phrases or sentences. It's a characteristic found in some indigenous languages around the world.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Polysynthesism is a type of isolating language.","correct":"✓ Polysynthesism is the opposite of an isolating language.","note":"Isolating languages have simple word structures, while polysynthetic languages have complex word structures."}],"priority":"★★☆"},"related_words":{"derivatives":["polysynthetic (adjective)"],"related_concepts":["morphology","linguistic typology","language families"]},"level_frequency":{"frequency_google_ngram":"Low frequency - a specialized term in linguistics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polysynthesism' is a technical term in linguistics referring to a language type where words are highly complex, incorporating many morphemes (meaningful units) that would be separate words in other languages. It's a concept used to classify languages based on their morphological structure. Understanding it requires some background in linguistic terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"Kalaallisut (Greenlandic) is a well-known example of a language exhibiting **polysynthesism**.","translation":"グリーンランド語（カラ―リスート）は、抱合語の性質を示す言語のよく知られた例である。","type":"example","meaning_category":"linguistics"},{"sentence":"In languages with **polysynthesism**, a single word can express what would be a whole sentence in English.","translation":"抱合語を持つ言語では、一つの語が英語では文全体になるものを表現できる。","type":"example","meaning_category":"linguistics"}]}