{"word":"unadeptly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"不器用に、下手くそに","english_definition":"in an unskillful or clumsy manner; without dexterity.","examples":[{"sentence":"He unadeptly tried to fix the car, but only made things worse.","translation":"彼は不器用に車を修理しようとしたが、事態を悪化させただけだった。"},{"sentence":"She unadeptly handled the delicate situation, causing further problems.","translation":"彼女はそのデリケートな状況を下手くそに扱い、さらなる問題を引き起こした。"}],"collocations":["handle something unadeptly (何かを不器用に扱う)","attempt something unadeptly (何かを不器用に試みる)"],"synonyms":["clumsily","awkwardly","ineptly","unskillfully"],"antonyms":["adeptly","skillfully","deftly","gracefully"]}],"etymology":{"value":"\"un-\" (否定) + \"adeptly\" (巧みに)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəˈdɛptli/","syllables":"un-a-dept-ly"},"inflection":{"notes":"Adverb, no comparative or superlative forms."},"usage_notes":{"explanation":"\"Unadeptly\" is the adverbial form of \"unadept,\" meaning lacking skill or dexterity. It describes an action performed in a clumsy or unskillful way. It is not a commonly used word, so it may sound somewhat formal or unusual in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unadeptly was trying to fix it.","correct":"✓ He was unadeptly trying to fix it.","note":"Adverbs usually go before the verb they modify, unless the verb is 'to be' in which case the adverb goes after."}],"priority":"★★☆"},"related_words":{"derivatives":["unadept (adjective: 不器用な、下手な)","adeptly (adverb: 巧みに、上手に)","adept (adjective: 熟達した、上手な; noun: 熟練者、名人)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rarely used, but understanding may be required in advanced texts)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unadeptly\" means doing something in a clumsy or unskilled way. It's not a common word, so you'll mostly find it in more formal writing or when someone wants to emphasize how poorly something was done. Think of it as the opposite of doing something skillfully or gracefully. If someone \"unadeptly\" tries to bake a cake, it probably won't turn out very well!"},"example_sentences":[{"sentence":"The novice dancer moved unadeptly across the stage, struggling to keep up with the music.","translation":"その初心者のダンサーは、音楽についていくのに苦労しながら、舞台を不器用に動き回った。","type":"general","meaning_category":"不器用に"},{"sentence":"He unadeptly tried to hide his surprise, but his face gave him away.","translation":"彼は不器用に驚きを隠そうとしたが、顔がそれを物語っていた。","type":"general","meaning_category":"不器用に"}]}