{"word":"dermatome","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"皮膚分節、デルマトーム","english_definition":"An area of skin supplied by a single spinal nerve.","examples":[{"sentence":"The dermatome map shows the areas of skin innervated by each spinal nerve.","translation":"デルマトームマップは、各脊髄神経によって神経支配される皮膚の領域を示しています。"},{"sentence":"Damage to a specific spinal nerve can result in loss of sensation in the corresponding dermatome.","translation":"特定の脊髄神経の損傷は、対応するデルマトームにおける感覚の喪失をもたらす可能性があります。"}],"collocations":["dermatome map","cervical dermatomes","thoracic dermatomes","lumbar dermatomes","sacral dermatomes","spinal nerve dermatome","sensory dermatome","dermatome distribution","dermatome testing","dermatome examination"],"synonyms":["cutaneous nerve territory","skin segment"],"antonyms":[]},{"part_of_speech":"noun","definition":"（皮膚移植に用いる）皮膚剥離刀","english_definition":"A surgical instrument used to remove thin slices of skin for skin grafting.","examples":[{"sentence":"The surgeon used a dermatome to harvest a skin graft from the patient's thigh.","translation":"外科医はデルマトームを使用して、患者の太ももから皮膚移植用の皮膚を採取しました。"},{"sentence":"Dermatomes allow for the precise and consistent removal of skin grafts.","translation":"デルマトームを使用すると、皮膚移植片を正確かつ一貫して除去できます。"}],"collocations":["skin graft dermatome","surgical dermatome","electric dermatome","drum dermatome","blade dermatome","harvesting dermatome","removing dermatome"],"synonyms":["skin grafting knife","skin splitter"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek δέρμα (dérma, \"skin\") + τέμνω (témnō, \"I cut\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɜːrmətoʊm/","syllables":"der-ma-tome"},"inflection":{"noun_plural":"dermatomes"},"usage_notes":{"explanation":"A dermatome refers to two distinct concepts: 1) a specific area of skin innervated by a single spinal nerve, and 2) a surgical instrument used for skin grafting. When discussing neurology or sensory function, dermatome refers to the skin area. In a surgical context, it refers to the instrument.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor used a dermatome to test my reflexes.","correct":"✓ The doctor tested my reflexes to assess the dermatome function.","note":"Reflexes are tested to assess nerve function, which can help determine if there's an issue with a specific dermatome (skin area). A dermatome (instrument) isn't used for reflex testing."},{"incorrect":"✗ He had a dermatome on his back after the surgery.","correct":"✓ He had a skin graft on his back after the surgery, which was harvested using a dermatome.","note":"A dermatome (instrument) is used to harvest skin grafts. The patient receives a skin graft, not a dermatome."}],"priority":"★★☆"},"related_words":{"derivatives":["dermatomal (adjective: relating to a dermatome)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"dermatome\" has two primary meanings in medical contexts.  First, it refers to a specific area of skin that is innervated by a single spinal nerve root. Understanding dermatomes is crucial for diagnosing nerve-related issues, as sensory loss or pain in a particular dermatome can indicate damage to the corresponding nerve. Second, a dermatome is a surgical instrument used to harvest thin, uniform slices of skin for grafting purposes. The context usually clarifies which meaning is intended.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient reported numbness in the C6 dermatome.","translation":"患者はC6デルマトームのしびれを訴えました。","type":"noun","meaning_category":"Skin area innervated by a spinal nerve"},{"sentence":"The surgeon carefully adjusted the dermatome to ensure a uniform skin graft.","translation":"外科医は、均一な皮膚移植片を確保するために、デルマトームを注意深く調整しました。","type":"noun","meaning_category":"Surgical instrument"},{"sentence":"Dermatomal mapping is an important part of the neurological exam.","translation":"デルマトームマッピングは、神経学的検査の重要な部分です。","type":"noun","meaning_category":"Skin area innervated by a spinal nerve"},{"sentence":"An electric dermatome is often used for large skin grafts.","translation":"電気デルマトームは、大きな皮膚移植片によく使用されます。","type":"noun","meaning_category":"Surgical instrument"}]}