{"word":"Greek-influenced","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"ギリシャの影響を受けた","english_definition":"Having characteristics or qualities that show the influence of Greek culture, language, or history.","examples":[{"sentence":"The architecture of the building is Greek-influenced, featuring columns and pediments.","translation":"その建物の建築様式はギリシャの影響を受けており、柱やペディメントが特徴的です。"},{"sentence":"Many English words are Greek-influenced, derived from ancient Greek roots.","translation":"多くの英単語はギリシャの影響を受けており、古代ギリシャ語の語源に由来します。"},{"sentence":"The art of the Renaissance was heavily Greek-influenced, drawing inspiration from classical sculptures.","translation":"ルネサンス美術はギリシャの影響を強く受けており、古典的な彫刻からインスピレーションを得ています。"}],"collocations":["Greek-influenced architecture","Greek-influenced art","Greek-influenced philosophy","Greek-influenced language","Greek-influenced culture"],"synonyms":["Hellenic","Hellenized","Greco-Roman","classicized"],"antonyms":["uninfluenced","unaffected","independent"]}],"etymology":{"value":"Combines \"Greek,\" referring to Greece, its people, or its language, with \"influenced,\" indicating the act of having an effect on something.","priority":"N/A"},"pronunciation":{"ipa":"/ˌɡriːk ˈɪnfluənst/","syllables":"Greek-in-flu-enced"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparative and superlative forms (which are less common for compound adjectives like this)."},"usage_notes":{"explanation":"\"Greek-influenced\" describes something that has been changed or shaped by Greek culture. This influence can be seen in various aspects such as art, architecture, language, philosophy, and more. The degree of influence can vary, but the term generally implies a noticeable impact.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The building is influence by Greek.","correct":"✓ The building is influenced by Greek architecture. / ✓ The building is Greek-influenced.","note":"It's important to use the correct grammatical structure. 'Influenced' requires a 'by' phrase or can be used as part of the compound adjective 'Greek-influenced'."}],"priority":"N/A"},"related_words":{"derivatives":["influence (noun, verb)","Greek (noun, adjective)"],"phrases":["under Greek influence","showing Greek influence"],"related_concepts":["Hellenism","Classical antiquity","Greco-Roman culture"]},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"Greek-influenced\" is used to describe something that has been affected or shaped by Greek culture, history, or language. It's a relatively sophisticated term often used in academic or cultural contexts to describe art, architecture, or philosophical ideas that show the impact of ancient Greece. Understanding the term requires familiarity with Greek history and culture."},"example_sentences":[{"sentence":"The pottery designs were Greek-influenced, featuring intricate patterns and mythological scenes.","translation":"その陶器のデザインはギリシャの影響を受けており、複雑な模様や神話の場面が特徴的でした。","type":"adjective","meaning_category":"cultural influence"},{"sentence":"His philosophical ideas were heavily Greek-influenced, particularly those of Plato and Aristotle.","translation":"彼の哲学的な考え方は、特にプラトンやアリストテレスといったギリシャの影響を強く受けていました。","type":"adjective","meaning_category":"intellectual influence"},{"sentence":"The city's architecture is a blend of modern and Greek-influenced styles.","translation":"その都市の建築様式は、現代的なスタイルとギリシャの影響を受けたスタイルが混ざり合っています。","type":"adjective","meaning_category":"architectural style"}]}