{"word":"restrictively","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"制限的に、限定的に、制約的に","english_definition":"in a way that limits freedom or prevents expansion; in a manner that imposes restrictions or limitations.","examples":[{"sentence":"The law was applied restrictively, affecting only a small group of people.","translation":"その法律は制限的に適用され、少数の人々にしか影響を与えなかった。"},{"sentence":"The contract was worded restrictively to prevent any loopholes.","translation":"契約書は抜け穴を防ぐために、制約的に表現されていた。"},{"sentence":"Access to the information is restrictively controlled.","translation":"その情報へのアクセスは厳しく制限されている。"},{"sentence":"The budget was restrictively managed to avoid overspending.","translation":"予算は支出超過を避けるために、厳しく管理されていた。"}],"collocations":["apply restrictively","interpret restrictively","control restrictively","manage restrictively","word restrictively","define restrictively","use restrictively"],"synonyms":["narrowly","limitedly","stringently","tightly","severely","exclusively","specifically"],"antonyms":["liberally","broadly","loosely","generously","expansively","permissively"]}],"etymology":{"value":"The word 'restrictively' is derived from the adjective 'restrictive' by adding the adverbial suffix '-ly'. 'Restrictive' comes from the verb 'restrict', which originates from the Latin 're-' (back, again) and 'stringere' (to draw tight, bind). Thus, 'restrictively' implies acting in a manner that tightens or limits something.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈstrɪktɪvli/","syllables":"re-stric-tive-ly"},"inflection":{"notes":"As an adverb, 'restrictively' does not have inflections."},"usage_notes":{"explanation":"'Restrictively' is used to describe actions or qualities that impose limitations or constraints. It often implies a deliberate effort to reduce scope, access, or freedom. It is commonly used in contexts related to laws, regulations, contracts, budgets, and access to resources or information. The degree of restriction can vary, but the word generally suggests a significant limitation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company restrictively hired new employees.","correct":"✓ The company hired new employees restrictively.","note":"Adverbs often follow the verb they modify, especially when the verb is transitive and has an object. In this case, 'restrictively' modifies 'hired', so it should come after 'hired new employees'. Alternatively, rephrasing to use 'restrictively' to modify the manner of hiring is also possible: 'The company hired new employees in a restrictive manner.'"},{"incorrect":"✗ The rules are restrictive to play.","correct":"✓ The rules restrictively apply. / ✓ The rules are restrictive.","note":"'Restrictively' is an adverb and modifies verbs, adjectives, or other adverbs. It does not directly modify nouns like 'rules'. To describe the rules themselves as limiting, use the adjective 'restrictive'. To describe how the rules are applied, use 'restrictively' with a verb like 'apply'."},{"incorrect":"✗ They restrictively have access to the data.","correct":"✓ They have restricted access to the data. / ✓ They have access to the data restrictively.","note":"The phrasing 'restrictively have access' is awkward. It's better to use the adjective 'restricted' to modify 'access' or to place 'restrictively' after 'have access' to describe the manner of access."}],"priority":"★★★"},"related_words":{"derivatives":["restrict (verb): to put a limit on; to keep under control","restriction (noun): a limiting condition or measure","restrictive (adjective): imposing restrictions or limitations"],"antonyms":["liberally (adverb): in a generous or openhanded way","permissively (adverb): in a way that allows or permits something","expansively (adverb): in a wide-ranging or comprehensive way"],"synonyms":["limitedly (adverb): in a limited manner","narrowly (adverb): in a limited or restricted way","stringently (adverb): in a strict or severe manner"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'restrictively' is an adverb that describes how something is done in a limited or controlled way. It's often used in formal contexts, such as legal documents or academic writing, to indicate that something is subject to specific constraints or limitations. Understanding this word requires a good grasp of abstract concepts and the ability to recognize subtle differences in meaning. It's not typically encountered in everyday conversation, making it more suitable for advanced learners of English."},"example_sentences":[{"sentence":"The use of the software is restrictively licensed, allowing it only for non-commercial purposes.","translation":"そのソフトウェアの使用は制限的にライセンスされており、非営利目的でのみ許可されています。","type":"adverb","meaning_category":"limiting use"},{"sentence":"The information was interpreted restrictively, focusing solely on the financial aspects of the project.","translation":"その情報は制限的に解釈され、プロジェクトの財務的側面にのみ焦点が当てられました。","type":"adverb","meaning_category":"limiting interpretation"},{"sentence":"The policy was applied restrictively to exclude certain groups from receiving benefits.","translation":"その政策は、特定のグループが給付金を受け取ることを除外するために、制限的に適用されました。","type":"adverb","meaning_category":"limiting application"},{"sentence":"The definition of 'family' was restrictively defined in the law, excluding many non-traditional relationships.","translation":"法律における「家族」の定義は制限的に定義されており、多くの非伝統的な関係が除外されていました。","type":"adverb","meaning_category":"limiting definition"}]}