{"word":"Androginized","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(transitive) To cause to take on an androgynous appearance or quality; to make androgynous.","english_definition":"To cause to take on an androgynous appearance or quality; to make androgynous.","examples":[{"sentence":"The artist androginized the model in the painting, blurring the lines between male and female characteristics.","translation":"そのアーティストは絵画の中でモデルを中性的にし、男性と女性の特徴の境界線を曖昧にした。"}],"collocations":["androginize a model","androginize an image","androginize a character"],"synonyms":["gender-neutralize","de-gender","effeminate","masculinize"],"antonyms":["masculinize","feminize"]}],"etymology":{"value":"Derived from the word 'androgynize,' which comes from 'androgyny' (having both male and female characteristics) + '-ize' (to cause to become).","priority":"★★★"},"pronunciation":{"ipa":"/ænˈdrɒdʒɪnaɪzd/","syllables":"An-drog-i-nized"},"inflection":{"verb_forms":{"present_simple":["androginize","androginizes"],"past_simple":"androginized","past_participle":"androginized","present_participle":"androginizing"}},"usage_notes":{"explanation":"'Androginized' is the past simple and past participle form of the verb 'androginize.' It describes the action of making something or someone appear androgynous, meaning having both male and female characteristics. This term is often used in discussions of art, fashion, and gender identity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The photo was androginous.","correct":"✓ The photo was androginized.","note":"'Androginous' is an adjective describing something that has both male and female characteristics. 'Androginized' is a verb describing the action of making something androgynous."}],"priority":"★★☆"},"related_words":{"derivatives":["androgyny","androgynous","androginize"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Androginized' is a specialized term related to gender studies and art. It signifies the act of making something appear androgynous, blurring traditional gender lines. Understanding this term requires familiarity with concepts of gender identity and representation. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The fashion designer androginized the clothing line to appeal to a wider audience.","translation":"そのファッションデザイナーは、より幅広い層にアピールするために、その服のラインを中性的にした。","type":"verb","meaning_category":"make androgynous"},{"sentence":"The character in the play was deliberately androginized to challenge traditional gender roles.","translation":"劇中のキャラクターは、伝統的なジェンダーロールに挑戦するために、意図的に中性的にされた。","type":"verb","meaning_category":"make androgynous"}]}