{"word":"preconspiracy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"陰謀の前段階、陰謀の準備段階","english_definition":"The stage or period before a conspiracy is fully formed or executed; the planning or preparation phase of a conspiracy.","examples":[{"sentence":"The documents revealed the preconspiracy, showing how the plot was hatched.","translation":"その文書は陰謀の前段階を明らかにし、どのように陰謀が企てられたかを示していた。"},{"sentence":"Detectives focused on the preconspiracy to understand the motivations behind the crime.","translation":"刑事たちは犯罪の背後にある動機を理解するために、陰謀の準備段階に焦点を当てた。"}],"collocations":["evidence of preconspiracy (陰謀準備の証拠)","investigate the preconspiracy (陰謀準備を調査する)","early stages of preconspiracy (陰謀準備の初期段階)"],"synonyms":["planning","preparation","plotting","scheming","incubation"],"antonyms":["postconspiracy","aftermath","cover-up"]}],"etymology":{"value":"\"pre-\" (before) + \"conspiracy\" (a secret plan by a group to do something unlawful or harmful).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːkənˈspɪrəsi/","syllables":"pre-con-spir-a-cy"},"inflection":{"noun_plural":"preconspiracies"},"usage_notes":{"explanation":"\"Preconspiracy\" refers to the period or activities leading up to the actual conspiracy. It emphasizes the planning, preparation, and initial stages of forming a secret agreement to commit an unlawful act. It is often used in legal or investigative contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The preconspiracy was successful.","correct":"✓ The conspiracy was successful.","note":"\"Preconspiracy\" refers to the planning stage, not the execution or success of the conspiracy itself."},{"incorrect":"✗ He was charged with preconspiracy.","correct":"✓ He was charged with conspiracy.","note":"One is typically charged with conspiracy, not the planning stage before it. However, evidence of planning can be used to prove the existence of a conspiracy."}],"priority":"★★☆"},"related_words":{"derivatives":["preconspirational (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"preconspiracy\" is a specialized term, primarily used in legal, investigative, or academic contexts. It refers to the preparatory phase of a conspiracy, focusing on the planning and scheming that occurs before the actual unlawful act is committed. Due to its specific and technical nature, it is not commonly encountered in everyday language. Understanding the term requires a grasp of the concept of conspiracy itself and the ability to distinguish between planning and execution."},"example_sentences":[{"sentence":"The investigation uncovered evidence of a detailed preconspiracy involving multiple individuals.","translation":"捜査により、複数の個人が関与する詳細な陰謀準備の証拠が明らかになった。","type":"noun","meaning_category":"陰謀の前段階"},{"sentence":"The prosecution aimed to prove the existence of a preconspiracy to establish criminal intent.","translation":"検察は犯罪の意図を立証するために、陰謀準備の存在を証明することを目指した。","type":"noun","meaning_category":"陰謀の準備段階"}]}