{"word":"misadjudicated","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"誤って裁定する、誤審する","english_definition":"to judge or decide wrongly or unfairly.","examples":[{"sentence":"The referee misadjudicated the play, resulting in a penalty.","translation":"審判はそのプレーを誤審し、ペナルティにつながった。"},{"sentence":"The case was misadjudicated due to insufficient evidence.","translation":"その事件は証拠不十分のため誤審された。"}],"collocations":["misadjudicate a case","misadjudicate a play"],"synonyms":["misjudge","misrule","err in judgment"],"antonyms":["adjudicate correctly","judge fairly"]}],"etymology":{"value":"The word is formed by adding the prefix 'mis-' (meaning wrongly or incorrectly) to the word 'adjudicated,' which comes from the Latin 'adjudicare' (to judge).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪsədˈdʒuːdɪkeɪtɪd/","syllables":"mis-ad-ju-di-cat-ed"},"inflection":{"verb_forms":{"present_simple":["misadjudicate","misadjudicates"],"past_simple":"misadjudicated","past_participle":"misadjudicated","present_participle":"misadjudicating"}},"usage_notes":{"explanation":"'Misadjudicated' implies an error in the process of judging or making a decision, often suggesting unfairness or incorrect application of rules or laws. It is typically used in formal contexts, such as legal or sporting situations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The judge misadjudicated because he was bias.","correct":"✓ The judge misadjudicated because he was biased.","note":"'Bias' is a noun, while 'biased' is the adjective form meaning having a prejudice. Also, 'because' should be followed by a clause (subject + verb)."},{"incorrect":"✗ The game was misadjudicated, it was very unfair.","correct":"✓ The game was misadjudicated; it was very unfair. / ✓ The game was misadjudicated, and it was very unfair.","note":"Two independent clauses should be separated by a semicolon or connected by a conjunction like 'and'."}],"priority":"★★☆"},"related_words":{"derivatives":["misadjudication (noun: the act of judging wrongly)","adjudicate (verb: to judge or decide)","adjudication (noun: the act of judging)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Misadjudicated' is a formal term indicating that a decision or judgment was made incorrectly or unfairly. It is often used in legal or formal contexts where the correctness of a judgment is critical. The word implies that there was an error in the process of judging, leading to an unjust outcome. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The arbitrator determined that the claim had been misadjudicated by the insurance company.","translation":"仲裁人は、その請求が保険会社によって誤って裁定されたと判断した。","type":"verb","meaning_category":"誤って裁定する"},{"sentence":"Many fans felt the penalty call was misadjudicated, costing their team the game.","translation":"多くのファンは、そのペナルティの判定が誤審であり、自分たちのチームが試合に負けたと感じた。","type":"verb","meaning_category":"誤審する"}]}