{"word":"nonconsecration","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不聖別、非奉献","english_definition":"The act of not consecrating; the state of not being consecrated.","examples":[{"sentence":"The altar was in a state of nonconsecration, awaiting the proper ceremony.","translation":"祭壇は不聖別の状態にあり、適切な儀式を待っていた。"},{"sentence":"The nonconsecration of the building meant it could not be used for religious purposes.","translation":"その建物の不聖別は、宗教目的で使用できないことを意味した。"}],"collocations":["state of nonconsecration","act of nonconsecration"],"synonyms":["desecration","profanation"],"antonyms":["consecration","sanctification"]}],"etymology":{"value":"\"non-\" (not) + \"consecration\" (the act of making something sacred).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌkɒnsɪˈkreɪʃən/","syllables":"non-con-se-cra-tion"},"inflection":{"noun_plural":"nonconsecrations"},"usage_notes":{"explanation":"\"Nonconsecration\" refers to the absence of the act of making something sacred or holy through a formal ritual. It implies that something remains in a secular or unblessed state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonconsecration was a great consecration.","correct":"✓ The lack of consecration was a great oversight.","note":"Nonconsecration is the opposite of consecration, so it cannot be a great consecration."}],"priority":"★★☆"},"related_words":{"derivatives":["consecrate","consecration"],"related_terms":["desecrate","desecration","profane","profanation"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"nonconsecration\" is a formal and relatively rare term. It is typically used in religious or ceremonial contexts to describe the state of something that has not been officially declared sacred or holy. Understanding requires familiarity with the concept of consecration and the prefix \"non-\" indicating negation."},"example_sentences":[{"sentence":"The chapel remained in a state of nonconsecration for many years due to a dispute over its ownership.","translation":"礼拝堂は所有権をめぐる紛争のため、長年不聖別の状態のままだった。","type":"general"},{"sentence":"The nonconsecration of the land meant that it could be used for secular purposes without violating religious norms.","translation":"その土地の不聖別は、宗教規範に違反することなく世俗的な目的で使用できることを意味した。","type":"general"}]}