{"word":"foleye","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(音響制作における)フォーリーアーティスト、フォーリー効果技師","english_definition":"A person who creates Foley sounds for films, television programs, video games, and other media.","examples":[{"sentence":"The foleye artist added the sound of footsteps on gravel to the scene.","translation":"フォーリーアーティストは、砂利道での足音のサウンドをそのシーンに追加した。"},{"sentence":"A skilled foleye can create realistic sounds using everyday objects.","translation":"熟練したフォーリーは、日常的な物を使ってリアルなサウンドを作り出すことができる。"}],"collocations":["create foley sounds","work as a foleye artist","foleye effects","record foley"],"synonyms":["foley artist","foley walker","sound effects artist"],"antonyms":[]}],"etymology":{"value":"Named after Jack Foley, a sound effects pioneer at Universal Studios. He developed many of the techniques used to create sound effects in post-production.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfoʊli/","syllables":"fo-ley"},"inflection":{"noun_plural":"foleyes"},"usage_notes":{"explanation":"'Foleye' specifically refers to the person creating the sound effects, not the effects themselves. While 'Foley' can sometimes be used to refer to the artist, 'foleye' is a more direct and unambiguous term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The foleye was very realistic.","correct":"✓ The foley sounds were very realistic.","note":"'Foleye' refers to the person, not the sound effect itself."}],"priority":"★★☆"},"related_words":{"derivatives":["foley (noun: the sound effects themselves, or the process of creating them; verb: to create foley sounds)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Foleye' is a specialized term used in the film and audio production industry. It refers to the person who creates Foley sound effects. Understanding this term requires familiarity with the post-production process of audio and video media.","priority":"★★☆"},"example_sentences":[{"sentence":"The film's atmosphere was greatly enhanced by the work of the foleye.","translation":"その映画の雰囲気は、フォーリーアーティストの仕事によって大きく高められた。","type":"noun","meaning_category":"Person creating sound effects"},{"sentence":"The foleye carefully matched the sounds to the on-screen action.","translation":"フォーリーは、画面上のアクションに注意深く音を合わせた。","type":"noun","meaning_category":"Person creating sound effects"}]}