{"word":"Elegits","meanings":[{"part_of_speech":"noun","definition":"(plural only) A former type of Scottish MP who represented a constituency that elected more than one member.","english_definition":"(plural only, historical) Scottish MPs representing constituencies electing more than one member.","examples":[{"sentence":"The Elegits were abolished in 1918.","translation":"エレジットは1918年に廃止されました。"}],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Originates from the term 'elector' referring to those who had the right to vote for these MPs.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛlɪdʒɪts/","syllables":"El-e-gits"},"inflection":{"noun_plural":"Elegits"},"usage_notes":{"explanation":"'Elegits' is a historical term specifically related to the Scottish parliamentary system before 1918. It refers to the Members of Parliament who represented constituencies that elected multiple members. These constituencies were typically larger or more populous.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an Elegit in the current parliament.","correct":"✓ He was an Elegit in the pre-1918 parliament.","note":"The term 'Elegit' is only applicable to the historical context before the parliamentary reforms of 1918."}],"priority":"★★☆"},"related_words":{"derivatives":["Elegit (singular form, less common)","Elector (related to the voting process for Elegits)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Elegits' is a highly specialized historical term referring to a specific type of Scottish MP before 1918. Understanding requires knowledge of Scottish parliamentary history. The term is rarely encountered outside of academic or historical contexts."},"example_sentences":[{"sentence":"The role of the Elegits was crucial in representing diverse interests within the larger constituencies.","translation":"エレジットの役割は、より大きな選挙区内の多様な利害を代表する上で重要でした。","type":"noun","meaning_category":"historical"},{"sentence":"The reforms of 1918 led to the abolition of the Elegits and a restructuring of the Scottish parliamentary system.","translation":"1918年の改革により、エレジットは廃止され、スコットランドの議会制度が再構築されました。","type":"noun","meaning_category":"historical"}]}