{"word":"genuflectory","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(キリスト教) 膝をつく場所、特に教会で膝をついて祈るための台","english_definition":"A place for kneeling, especially a kneeling-stool or rest for kneeling in a church.","examples":[{"sentence":"The faithful knelt at the genuflectory to offer their prayers.","translation":"信者たちは祈りを捧げるために膝をつく場所でひざまずいた。"}],"collocations":["church genuflectory","kneel at the genuflectory"],"synonyms":["kneeling-stool","prie-dieu"],"antonyms":[]}],"etymology":{"value":"From Latin 'genu' (knee) + 'flectere' (to bend) + '-ory' (suffix indicating a place or thing associated with).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒɛnjʊˈflɛktəri/","syllables":"ge-nu-flec-to-ry"},"inflection":{"noun_plural":"genuflectories"},"usage_notes":{"explanation":"'Genuflectory' is a relatively uncommon word, primarily used in religious contexts, specifically within Christianity. It refers to a physical structure or space designed for kneeling during prayer. It's often found in churches or private chapels.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He prayed at the genuflection.","correct":"✓ He prayed at the genuflectory.","note":"'Genuflection' is the act of kneeling, while 'genuflectory' is the place or object where one kneels."}],"priority":"★☆☆"},"related_words":{"derivatives":["genuflect (verb: to bend the knee, especially as an act of reverence)","genuflection (noun: the act of bending the knee)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Genuflectory' is a specialized term primarily encountered in religious contexts, specifically within Christianity. It denotes a physical structure or designated area intended for kneeling during prayer, typically found in churches or private chapels. Due to its limited usage and specific domain, it is considered an advanced vocabulary word. Understanding the related terms 'genuflect' (to bend the knee) and 'genuflection' (the act of bending the knee) can aid in comprehending the meaning of 'genuflectory'."},"example_sentences":[{"sentence":"The small chapel included a simple genuflectory for private prayer.","translation":"その小さな礼拝堂には、個人的な祈りのための簡素な膝つき台が備えられていた。","type":"noun","meaning_category":"場所"},{"sentence":"She reverently approached the genuflectory before the altar.","translation":"彼女は敬虔に祭壇の前の膝つき台に近づいた。","type":"noun","meaning_category":"場所"}]}