{"word":"nonbiliously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"快活に、機嫌よく、不機嫌でなく","english_definition":"In a manner that is not bilious; cheerfully; good-humoredly; not ill-tempered.","examples":[{"sentence":"He greeted her nonbiliously, a stark contrast to his usual morning grumbling.","translation":"彼はいつもの朝の不機嫌なうめき声とは対照的に、快活に彼女に挨拶した。"},{"sentence":"Despite the setback, she approached the problem nonbiliously, determined to find a solution.","translation":"その挫折にもかかわらず、彼女は解決策を見つけようと決意し、機嫌よく問題に取り組んだ。"}],"collocations":["greet nonbiliously","approach nonbiliously","respond nonbiliously"],"synonyms":["cheerfully","good-humoredly","amiably","pleasantly","genially","affably"],"antonyms":["biliously","irascibly","grumpily","peevishly","testily"]}],"etymology":{"value":"Derived from 'non-' (prefix meaning 'not'), 'bilious' (affected by or associated with nausea or vomiting; ill-tempered), and '-ly' (suffix forming adverbs). The word essentially means 'not in a bilious manner.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈbɪliəsli/","syllables":"non-bil-i-ous-ly"},"inflection":{"notes":"Adverb, so no inflection."},"usage_notes":{"explanation":"'Nonbiliously' is a rather uncommon word that describes actions or behaviors performed in a cheerful or good-humored manner, specifically avoiding any display of ill-temper or irritability. Its usage often implies a deliberate effort to maintain a positive attitude, especially in situations where one might reasonably expect someone to be grumpy or unpleasant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He nonbiliously ate his breakfast, showing no signs of hunger.","correct":"✓ He ate his breakfast heartily, showing no signs of a lack of appetite.","note":"'Nonbiliously' refers to one's mood or temperament, not their appetite or physical state. Using 'heartily' or another adverb related to appetite would be more appropriate in this context."},{"incorrect":"✗ The medicine tasted nonbiliously.","correct":"✓ The medicine tasted pleasant.","note":"'Nonbiliously' describes a manner or disposition, not a taste or sensory experience. Use a word like 'pleasant' or 'agreeable' to describe a favorable taste."}],"priority":"★★☆"},"related_words":{"derivatives":["bilious (adjective)","biliousness (noun)"],"antonyms":["biliously (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Nonbiliously' is a rare and sophisticated word. It describes doing something in a cheerful and good-humored way, without any signs of being grumpy or bad-tempered. Because it is not commonly used, it's best suited for advanced English speakers who want to add nuance to their vocabulary. It is often used to describe a contrast to an expected negative mood or behavior."},"example_sentences":[{"sentence":"Despite the early hour, she greeted her colleagues nonbiliously.","translation":"朝早い時間にもかかわらず、彼女は同僚たちに快活に挨拶した。","type":"adverb","meaning_category":"cheerfully"},{"sentence":"He approached the difficult task nonbiliously, maintaining a positive attitude.","translation":"彼は困難な仕事に機嫌よく取り組み、前向きな姿勢を維持した。","type":"adverb","meaning_category":"good-humoredly"},{"sentence":"Even after the frustrating meeting, she responded to the email nonbiliously.","translation":"イライラする会議の後でも、彼女はそのメールに快活に返信した。","type":"adverb","meaning_category":"not ill-tempered"}]}