{"word":"roentgenoscopic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"レントゲン透視の、レントゲン透視的な","english_definition":"Relating to or employing roentgenoscopy.","examples":[{"sentence":"The doctor performed a roentgenoscopic examination of the patient's chest.","translation":"医師は患者の胸部のレントゲン透視検査を行った。"}],"collocations":["roentgenoscopic examination","roentgenoscopic image"],"synonyms":["fluoroscopic"],"antonyms":[]}],"etymology":{"value":"From 'roentgenoscopy' (the examination of the internal structure of opaque objects by means of X-rays) + '-ic' (forming adjectives). 'Roentgenoscopy' is derived from Wilhelm Conrad Röntgen, the discoverer of X-rays, and '-scopy' (viewing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛntɡənəˈskɑːpɪk/","syllables":"rent-gen-o-scop-ic"},"inflection":{"notes":"Adjectives do not inflect in English, but can be used in comparative or superlative forms (more roentgenoscopic, most roentgenoscopic)."},"usage_notes":{"explanation":"'Roentgenoscopic' is a technical term primarily used in medical contexts. It describes procedures, images, or techniques related to real-time X-ray imaging.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The roentgenoscopic was clear.","correct":"✓ The roentgenoscopic image was clear.","note":"'Roentgenoscopic' is an adjective and needs to modify a noun. It cannot stand alone as a noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["roentgenoscopy (noun): the examination of the internal structure of opaque objects by means of X-rays"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'roentgenoscopic' is a highly specialized term primarily encountered in medical or scientific contexts. Understanding requires familiarity with medical imaging techniques and the history of X-ray technology. It is unlikely to be encountered in general conversation or writing."},"example_sentences":[{"sentence":"The surgeon used roentgenoscopic guidance to place the catheter.","translation":"外科医はレントゲン透視ガイダンスを用いてカテーテルを挿入した。","type":"adjective","meaning_category":"レントゲン透視の"},{"sentence":"Roentgenoscopic evaluation revealed a small anomaly in the patient's lung.","translation":"レントゲン透視評価により、患者の肺に小さな異常が見つかった。","type":"adjective","meaning_category":"レントゲン透視的な"}]}