{"word":"spectrographs","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"分光写真器","english_definition":"Instruments that separate incoming radiation by wavelength or frequency. A spectrograph records the separated radiation as a function of wavelength or frequency.","examples":[{"sentence":"Spectrographs are used in astronomy to analyze the light from stars.","translation":"分光写真器は、天文学において星からの光を分析するために使用されます。"},{"sentence":"The spectrographs showed the presence of certain elements in the sample.","translation":"分光写真器は、サンプル中の特定の元素の存在を示しました。"}],"collocations":["astronomical spectrograph","high-resolution spectrograph"],"synonyms":["spectrometer","spectroscope"],"antonyms":[]}],"etymology":{"value":"The word \"spectrograph\" is derived from \"spectrum\" (from Latin, meaning 'image') and \"-graph\" (from Greek, meaning 'something written or recorded').","priority":"★★★"},"pronunciation":{"ipa":"ˈspektrəˌɡræfs","syllables":"spec-tro-graphs"},"inflection":{"noun_plural":"spectrographs"},"usage_notes":{"explanation":"Spectrographs are primarily used in scientific fields, especially astronomy and chemistry, to analyze the composition of light or other electromagnetic radiation. The plural form \"spectrographs\" refers to multiple instruments or multiple recordings made by such instruments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The spectrograph are used.","correct":"✓ The spectrographs are used.","note":"When referring to multiple spectrographs, use the plural form and ensure the verb agrees in number."}],"priority":"★★☆"},"related_words":{"derivatives":["spectrography","spectroscopic","spectrum"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"spectrographs\" refers to scientific instruments used to analyze the composition of light or other electromagnetic radiation. This term is typically encountered in advanced scientific contexts, such as astronomy or chemistry, and is used by professionals and researchers in these fields. Understanding the term requires a background in physics or a related scientific discipline."},"example_sentences":[{"sentence":"Astronomers use **spectrographs** to determine the chemical composition of distant stars.","translation":"天文学者は、遠い星の化学組成を決定するために分光写真器を使用します。","type":"general","meaning_category":"scientific analysis"},{"sentence":"The data from the **spectrographs** revealed the presence of previously unknown elements.","translation":"分光写真器からのデータは、以前に知られていなかった元素の存在を明らかにしました。","type":"research","meaning_category":"scientific discovery"}]}