{"word":"first-expressed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"最初に表現された、最初に明示された","english_definition":"Initially stated or articulated; expressed for the first time.","examples":[{"sentence":"The first-expressed idea was not well-received.","translation":"最初に表現されたアイデアはあまり受け入れられなかった。"},{"sentence":"We need to consider the first-expressed concerns of the community.","translation":"私たちは地域社会から最初に表明された懸念事項を考慮する必要があります。"}],"collocations":["first-expressed idea","first-expressed concern","first-expressed thought","first-expressed opinion"],"synonyms":["initial","original","primary","preliminary"],"antonyms":["later","subsequent","secondary"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'first' (referring to the beginning or initial occurrence) and 'expressed' (meaning conveyed or articulated). It describes something that has been communicated or shown for the first time.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɜːrst ɪkˈsprɛst/","syllables":"first-ex-pressed"},"inflection":{"notes":"Since it is an adjective, it can be used to modify nouns. It doesn't have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"'First-expressed' is used to emphasize that something is the initial or original articulation of an idea, concern, or opinion. It is often used in contexts where it is important to distinguish the initial expression from later modifications or elaborations. It can also highlight the importance or priority of the initial statement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The first express idea was good.","correct":"✓ The first-expressed idea was good.","note":"'First-expressed' is a compound adjective and should be hyphenated to correctly modify the noun 'idea'."},{"incorrect":"✗ The first expressed idea's.","correct":"✓ The first-expressed idea's.","note":"The possessive form is correctly formed by adding 's to the entire compound adjective phrase."}],"priority":"★★☆"},"related_words":{"derivatives":["express (verb, noun, adjective)","expression (noun)","expressive (adjective)"],"phrasal_verbs":["N/A"],"priority":"N/A"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized or technical vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'First-expressed' is a complex adjective used to describe something that has been communicated or articulated for the very first time. It's typically used in formal or academic contexts to emphasize the originality or priority of an idea, concern, or opinion. The word is formed by combining 'first' and 'expressed,' indicating the initial act of making something known. Due to its specific and somewhat formal usage, it's more commonly encountered in advanced texts and discussions."},"example_sentences":[{"sentence":"The committee reviewed the first-expressed needs of the community before making any decisions.","translation":"委員会は意思決定を行う前に、地域社会から最初に表明されたニーズを検討した。","type":"adjective","meaning_category":"initial articulation"},{"sentence":"The first-expressed theory was later refined based on new evidence.","translation":"最初に表現された理論は、新しい証拠に基づいて後に修正された。","type":"adjective","meaning_category":"original statement"},{"sentence":"It is important to document the first-expressed concerns to ensure they are addressed.","translation":"最初に表明された懸念事項が確実に処理されるように、文書化することが重要である。","type":"adjective","meaning_category":"initial concerns"}]}