{"word":"Hellenophilic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"親ギリシャ的な、ギリシャ文化を愛好する","english_definition":"Loving or admiring Greece or Greek culture.","examples":[{"sentence":"He is a Hellenophilic scholar who has dedicated his life to studying ancient Greece.","translation":"彼は古代ギリシャの研究に生涯を捧げている親ギリシャ的な学者です。"},{"sentence":"The museum's collection reflects the Hellenophilic tastes of its founder.","translation":"その美術館のコレクションは、創設者の親ギリシャ的な趣味を反映しています。"}],"collocations":["Hellenophilic tendencies","Hellenophilic sentiments","Hellenophilic scholar","Hellenophilic art","Hellenophilic influence"],"synonyms":["pro-Greek","Greek-loving","Hellenophile"],"antonyms":["Hellenophobic","anti-Greek"]},{"part_of_speech":"noun","definition":"親ギリシャ主義者、ギリシャ文化愛好家","english_definition":"A person who loves or admires Greece or Greek culture.","examples":[{"sentence":"As a Hellenophile, she travels to Greece every year.","translation":"彼女は親ギリシャ主義者として、毎年ギリシャへ旅行します。"},{"sentence":"The local Hellenophile society organizes events celebrating Greek traditions.","translation":"地元の親ギリシャ主義者の協会は、ギリシャの伝統を祝うイベントを企画しています。"}],"collocations":["ardent Hellenophile","dedicated Hellenophile","lifelong Hellenophile"],"synonyms":["Hellenophile","Greek enthusiast","lover of Greek culture"],"antonyms":["Hellenophobe","anti-Greek activist"]}],"etymology":{"value":"Derived from 'Hellen-' (referring to Greece or Greek culture) + '-o-' (connecting vowel) + '-philic' (loving, having an affinity for).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɛlənəˈfɪlɪk/","syllables":"Hel-len-o-phil-ic"},"inflection":{"notes":"Adjective forms: more Hellenophilic, most Hellenophilic. Noun form: Hellenophile (singular), Hellenophiles (plural)."},"usage_notes":{"explanation":"'Hellenophilic' and 'Hellenophile' are used to describe a strong admiration or love for Greece, its people, its language, and its culture. The term can apply to individuals, groups, or even artistic and intellectual movements. It often implies a deep understanding and appreciation of Greek history, philosophy, and art.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very Hellenistic.","correct":"✓ He is very Hellenophilic.","note":"'Hellenistic' refers to the period of Greek history after Alexander the Great, while 'Hellenophilic' refers to a love or admiration for Greek culture in general."}],"priority":"★★☆"},"related_words":{"derivatives":["Hellenism (Greek culture or civilization)","Hellenist (a scholar of Greek culture or language)","Hellenize (to make Greek in character or culture)","Hellenophily (love of Greek culture)"],"phrases":["Philhellenism (support for Greek independence or the Greek cause)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hellenophilic' is a relatively uncommon word that describes someone who loves or admires Greek culture. It's more formal than simply saying someone 'likes Greece.' You'll typically encounter this word in academic or historical contexts when discussing people or movements that were strongly influenced by Greek culture. Understanding the word requires familiarity with the root 'Hellen-' (referring to Greece) and the suffix '-philic' (loving)."},"example_sentences":[{"sentence":"His Hellenophilic views were evident in his collection of ancient Greek sculptures.","translation":"彼の親ギリシャ的な見解は、古代ギリシャの彫刻のコレクションに明らかでした。","type":"adjective","meaning_category":"Admiration for Greek culture"},{"sentence":"She became a Hellenophile after studying classical literature.","translation":"彼女は古典文学を研究した後、親ギリシャ主義者になりました。","type":"noun","meaning_category":"Lover of Greek culture"}]}