{"word":"adcon","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(military, US, Philippines) A unit or formation placed under the operational control of another unit or formation.","english_definition":"A unit or formation placed under the operational control of another unit or formation.","examples":[{"sentence":"The 1st Infantry Battalion was placed as an adcon to the 2nd Brigade for the duration of the exercise.","translation":"第1歩兵大隊は、演習期間中、第2旅団の作戦指揮下（adcon）に置かれた。"}],"collocations":["placed as adcon","under adcon"],"synonyms":["operational control","OPCON"],"antonyms":[]}],"etymology":{"value":"A blend of the words 'attached' and 'control'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈædkɒn/","syllables":"ad-con"},"inflection":{"noun_plural":"adcons"},"usage_notes":{"explanation":"The term 'adcon' is primarily used within the United States and the Philippines military contexts. It refers to a specific type of command relationship where one unit is temporarily placed under the operational control of another. It is less common in other English-speaking countries.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The adcon was responsible for logistics.","correct":"The unit under adcon was responsible for logistics.","note":"'Adcon' refers to the state of being under operational control, not the unit itself. You need to specify the unit that is under adcon."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["OPCON","TACON"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Adcon' is a highly specialized term primarily used in military contexts, specifically within the US and the Philippines. It describes a command relationship where a unit is placed under the operational control of another unit. Understanding this term requires familiarity with military terminology and organizational structures. Due to its limited usage, it is not commonly encountered outside of military settings."},"example_sentences":[{"sentence":"The engineer company was in adcon to the armored brigade.","translation":"その工兵中隊は機甲旅団の指揮下にあった。","type":"noun","meaning_category":"military command structure"}]}