{"word":"nonhouseholder","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に英国)世帯主でない人、同居人","english_definition":"(chiefly British) a person who is not a householder; a person living in a household who is not the owner or tenant.","examples":[{"sentence":"The survey included both householders and nonhouseholders.","translation":"その調査には世帯主と同居人の両方が含まれていた。"},{"sentence":"Nonhouseholders often have different needs and perspectives compared to householders.","translation":"同居人はしばしば世帯主とは異なるニーズや視点を持っている。"}],"collocations":["survey of householders and nonhouseholders","census data on nonhouseholders","rights of nonhouseholders"],"synonyms":["lodger","dependent","resident","cohabitant"],"antonyms":["householder","tenant","owner"]},{"part_of_speech":"adjective","definition":"世帯主でない、同居人の","english_definition":"relating to or characteristic of a person who is not a householder.","examples":[{"sentence":"Nonhouseholder income is often lower than that of householders.","translation":"同居人の収入はしばしば世帯主の収入よりも低い。"},{"sentence":"Nonhouseholder status can affect eligibility for certain benefits.","translation":"同居人という身分は特定の給付金の受給資格に影響を与える可能性がある。"}],"collocations":["nonhouseholder income","nonhouseholder status","nonhouseholder population"],"synonyms":["dependent","resident"],"antonyms":["householder"]}],"etymology":{"value":"Formed from \"non-\" + \"householder\".","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌnɒnˈhaʊshəʊldər/","syllables":"non-house-hold-er"},"inflection":{"noun_plural":"nonhouseholders"},"usage_notes":{"explanation":"The term \"nonhouseholder\" is primarily used in British English and in formal contexts such as surveys, censuses, and legal documents. It refers to individuals who reside in a household but are not the owner or tenant responsible for the property. This can include adult children living with their parents, relatives, lodgers, or other dependents. The term is used to distinguish these individuals from the householder, who typically has greater rights and responsibilities related to the property.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non-house holder.","correct":"✓ He is a nonhouseholder.","note":"The term is typically written as one word: \"nonhouseholder\"."},{"incorrect":"✗ Non-householders are the same as homeless people.","correct":"✓ Nonhouseholders are people who live in a household but are not the householder.","note":"Nonhouseholders are not necessarily homeless. They live in a dwelling, but are not the owner or tenant."}],"priority":"★☆☆"},"related_words":{"derivatives":["householder","household","non-","holder"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonhouseholder\" is a formal term used to describe someone who lives in a house but is not the person who owns or rents it. It's often used in official documents or surveys to distinguish between the person responsible for the household (the householder) and other residents. This word is not commonly used in everyday conversation and is more likely to be encountered in academic or administrative contexts."},"example_sentences":[{"sentence":"The census data showed an increase in the number of nonhouseholders living in urban areas.","translation":"国勢調査のデータは、都市部に住む同居人の数が増加していることを示した。","type":"noun","meaning_category":"世帯主でない人"},{"sentence":"The policy aims to support both householders and nonhouseholders in accessing affordable housing.","translation":"その政策は、手頃な価格の住宅へのアクセスにおいて、世帯主と同居人の両方を支援することを目的としている。","type":"adjective","meaning_category":"世帯主でない"}]}