{"word":"Bodyshirt","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A close-fitting, one-piece garment that covers the torso and sometimes the arms, typically fastening at the crotch.","english_definition":"A one-piece, form-fitting garment for the torso, similar to a leotard or bodysuit, that usually fastens at the crotch.","examples":[{"sentence":"She wore a bodyshirt under her jeans.","translation":"彼女はジーンズの下にボディシャツを着ていた。"},{"sentence":"The dancer's bodyshirt accentuated her movements.","translation":"ダンサーのボディシャツは彼女の動きを強調した。"}],"collocations":["wear a bodyshirt","bodyshirt and jeans","long-sleeved bodyshirt","lace bodyshirt"],"synonyms":["bodysuit","leotard","unitard"],"antonyms":[]}],"etymology":{"value":"Combination of 'body' and 'shirt', reflecting its function as a shirt-like garment that fits closely to the body.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbɒdiʃɜːrt/","syllables":"bod-y-shirt"},"inflection":{"noun_plural":"bodyshirts"},"usage_notes":{"explanation":"A bodyshirt is typically worn as a base layer or as a top. It provides a smooth, tucked-in look without the bulk of a traditional shirt. It is often made of stretchy material for a comfortable and form-fitting silhouette.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I wear a bodyshirt to the beach.","correct":"✓ I wear a swimsuit to the beach.","note":"Bodyshirts are not typically worn as swimwear. Use 'swimsuit' instead."},{"incorrect":"✗ He wore a bodyshirt to the office.","correct":"✓ He wore a shirt to the office.","note":"While acceptable, wearing a bodyshirt to the office is less common than wearing a traditional shirt."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'bodyshirt' refers to a specific type of clothing item. Understanding its meaning requires familiarity with fashion terminology. It's not a commonly used word in everyday conversation but is more likely to appear in fashion contexts or descriptions of clothing.","level_note":"The word is not frequently used, but the concept is relatively simple to grasp."},"example_sentences":[{"sentence":"The model wore a black bodyshirt with high-waisted pants.","translation":"モデルはハイウエストのパンツと黒いボディシャツを着ていた。","type":"example"},{"sentence":"She prefers bodyshirts because they stay tucked in all day.","translation":"彼女は一日中シャツが出ないのでボディシャツが好きだ。","type":"example"},{"sentence":"A lace bodyshirt can be dressed up for a night out.","translation":"レースのボディシャツは夜のお出かけのために着飾ることができる。","type":"example"}]}