{"word":"euxanthate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"キサントゲン酸ユーキシル","english_definition":"A salt or ester of euxanthic acid; specifically, potassium euxanthate, a reagent used in analytical chemistry for the detection and determination of certain metals.","examples":[{"sentence":"Euxanthate is used in the flotation process to separate minerals.","translation":"ユーキサンテートは、鉱物を分離するための浮遊選鉱プロセスで使用されます。"}],"collocations":["potassium euxanthate","sodium euxanthate"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'euxanthic acid' (from Greek 'eu' meaning 'good' and 'xanthos' meaning 'yellow') + '-ate' (indicating a salt or ester).","priority":"☆☆☆"},"pronunciation":{"ipa":"/juːˈzænθeɪt/","syllables":"eu-xan-thate"},"inflection":{"noun_plural":"euxanthates"},"usage_notes":{"explanation":"Euxanthates are chemical compounds, specifically salts or esters of euxanthic acid. They are primarily known for their use as reagents in analytical chemistry, particularly in the detection and determination of metals. Potassium euxanthate is a common example. They also find application in mineral processing, such as in flotation techniques.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["euxanthic acid"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Euxanthate' is a highly specialized term in chemistry, specifically referring to salts or esters of euxanthic acid. Its primary use is in analytical chemistry and mineral processing. Due to its technical nature, it's unlikely to appear outside of specialized scientific or industrial contexts."},"example_sentences":[{"sentence":"Potassium euxanthate is used as a reagent to precipitate copper ions from solution.","translation":"ユーキシルキサントゲン酸カリウムは、溶液から銅イオンを沈殿させるための試薬として使用されます。","type":"noun","meaning_category":"chemical compound"}]}