{"word":"calthrops","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"菱、撒菱（まきびし）","english_definition":"a device with two or more sharp points arranged in such a manner that one of them always points upward from a stable base, used to impede the advance of enemy troops or vehicles.","examples":[{"sentence":"The battlefield was littered with calthrops to slow down the enemy cavalry.","translation":"戦場には敵の騎兵を減速させるために菱が散乱していた。"},{"sentence":"Calthrops were used as a defensive measure against chariots.","translation":"菱は戦車に対する防御策として使用された。"}],"collocations":["scatter calthrops (菱を撒く)","deploy calthrops (菱を配置する)"],"synonyms":["tack","jackrock"],"antonyms":[]}],"etymology":{"value":"Late Middle English: plural of caltrap, from Latin calcatrippa, from calx ‘heel’ + trippa ‘tripe’ (because it pricks the heel).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkælθrɒps/","syllables":"cal-throps"},"inflection":{"noun_plural":"calthrops (always plural in form, even when referring to a single item)"},"usage_notes":{"explanation":"Calthrops are always referred to in the plural form, even when describing a single object. The word refers to the device as a whole, rather than individual spikes or points.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He stepped on a calthrop.","correct":"✓ He stepped on a calthrop. (Although grammatically correct, it's more common to say: He stepped on calthrops.)","note":"While 'calthrop' can technically be used in the singular, it's much more common to use the plural form 'calthrops' even when referring to a single instance."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["military tactics","siege warfare","anti-personnel weapon"],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"calthrops\" is a specialized term related to military history and strategy. It is unlikely to be encountered in everyday conversation and is more likely to appear in historical texts, military analyses, or discussions of ancient warfare. Understanding of the word implies familiarity with historical warfare techniques and vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The ancient Roman army used calthrops to defend against chariot attacks.","translation":"古代ローマ軍は戦車攻撃から防御するために菱を使用した。","type":"noun","meaning_category":"military history"},{"sentence":"The calthrops were designed to puncture the tires of enemy vehicles.","translation":"その菱は敵の車両のタイヤをパンクさせるように設計されていた。","type":"noun","meaning_category":"military technology"}]}