{"word":"extrared","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"赤外線より外側の、赤外線を超える","english_definition":"Beyond the red end of the spectrum; pertaining to or utilizing wavelengths longer than those of visible red light; infrared.","examples":[{"sentence":"The extrared radiation is invisible to the human eye.","translation":"赤外線は人間の目には見えません。"},{"sentence":"Extrared photography can reveal details not seen in visible light.","translation":"赤外線写真は可視光では見えない細部を明らかにすることができます。"}],"collocations":["extrared radiation","extrared photography","extrared sensor"],"synonyms":["infrared"],"antonyms":["ultraviolet"]},{"part_of_speech":"noun","definition":"赤外線","english_definition":"Infrared radiation.","examples":[{"sentence":"The device detects heat using extrared.","translation":"その装置は赤外線を使って熱を検出します。"}],"collocations":[],"synonyms":["infrared radiation"],"antonyms":[]}],"etymology":{"value":"\"extra-\" (beyond) + \"red\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌekstrəˈrɛd/","syllables":"ex-tra-red"},"inflection":{"notes":"Typically used as an adjective, but can also function as a noun referring to infrared radiation."},"usage_notes":{"explanation":"\"Extrared\" is a term that is less commonly used than \"infrared\" to describe electromagnetic radiation with wavelengths longer than those of visible red light. While technically correct, \"infrared\" is the preferred and more widely recognized term in scientific and technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The extrared light is very bright.","correct":"✓ The infrared light is not visible.","note":"Infrared radiation, whether referred to as \"extrared\" or \"infrared,\" is not visible to the human eye. The mistake here is implying that it is bright and visible."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["infrared","electromagnetic spectrum","radiation","wavelength"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"extrared\" is a relatively uncommon synonym for \"infrared.\" It refers to electromagnetic radiation with wavelengths longer than visible red light. While understandable, it's less frequently used in both technical and general contexts compared to \"infrared.\" Understanding this term can be helpful in specialized scientific literature, but \"infrared\" is the preferred and more common term."},"example_sentences":[{"sentence":"The security system uses extrared sensors to detect movement in the dark.","translation":"そのセキュリティシステムは、暗闇での動きを検出するために赤外線センサーを使用しています。","type":"adjective","meaning_category":"赤外線の"},{"sentence":"The scientist measured the amount of extrared emitted by the star.","translation":"科学者は、その星から放射される赤外線の量を測定しました。","type":"noun","meaning_category":"赤外線"}]}