{"word":"Dicyandiamide","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ジシアンジアミド：肥料や樹脂の製造に使用される有機化合物。","english_definition":"An organic compound used in the manufacture of fertilizers and resins.","examples":[{"sentence":"Dicyandiamide is used as a fertilizer additive.","translation":"ジシアンジアミドは肥料添加物として使用されます。"},{"sentence":"The chemical formula of dicyandiamide is C2H4N4.","translation":"ジシアンジアミドの化学式はC2H4N4です。"}],"collocations":["dicyandiamide fertilizer","dicyandiamide resin","dicyandiamide production"],"synonyms":["cyanoguanidine","DCD"],"antonyms":[]}],"etymology":{"value":"ジシアンジアミドは、シアンアミドの二量体であることから命名されました。","priority":"☆☆☆"},"pronunciation":{"ipa":"/daɪˌsaɪənˈdaɪəmaɪd/","syllables":"di-cy-an-di-a-mide"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Dicyandiamide (DCD) is a chemical compound primarily used in agriculture as a nitrification inhibitor, slowing down the conversion of ammonia to nitrate in the soil. This helps to reduce nitrogen loss and improve fertilizer efficiency. It is also used in the production of resins and other chemical products.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["cyanide","cyanamide"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"低頻度","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Dicyandiamide is a technical term primarily encountered in the fields of chemistry, agriculture, and environmental science. Understanding its usage requires a background in these areas, particularly related to nitrogen cycling and fertilizer technology. The term is not commonly used in general conversation or writing."},"example_sentences":[{"sentence":"The application of dicyandiamide can reduce nitrous oxide emissions from agricultural soils.","translation":"ジシアンジアミドの施用は、農業土壌からの亜酸化窒素の排出を削減することができます。","type":"noun","meaning_category":"chemical compound"},{"sentence":"Dicyandiamide is often used in combination with urea to enhance nitrogen uptake by plants.","translation":"ジシアンジアミドは、植物による窒素吸収を促進するために、尿素と組み合わせて使用​​されることがよくあります。","type":"noun","meaning_category":"fertilizer additive"}]}