{"word":"tularaemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"野兎病（やとびょう）","english_definition":"An infectious disease of wild rodents, especially rabbits and hares, caused by the bacterium Francisella tularensis, and transmissible to humans.","examples":[{"sentence":"Tularaemia is a rare disease in humans, but it can be serious if left untreated.","translation":"野兎病は人間に稀な病気ですが、治療せずに放置すると重症化する可能性があります。"},{"sentence":"Hunters are at risk of contracting tularaemia from infected rabbits.","translation":"狩猟者は、感染したウサギから野兎病に感染するリスクがあります。"}],"collocations":["contract tularaemia (野兎病に感染する)","tularaemia outbreak (野兎病の発生)","treat tularaemia (野兎病を治療する)"],"synonyms":["rabbit fever","deer fly fever"],"antonyms":[]}],"etymology":{"value":"The word \"tularaemia\" comes from Tulare County, California, where the disease was first discovered in 1911, combined with \"-aemia,\" a suffix denoting the presence of something in the blood.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtjuːləˈriːmiə/","syllables":"tu-la-rae-mi-a"},"inflection":{"noun_plural":"tularaemias"},"usage_notes":{"explanation":"Tularaemia is a zoonotic disease, meaning it can be transmitted from animals to humans. Humans can contract the disease through various routes, including tick and deer fly bites, direct contact with infected animals, ingestion of contaminated water or food, and inhalation of aerosolized bacteria. Symptoms can vary depending on the route of infection but often include fever, skin ulcers, and swollen lymph nodes. Early diagnosis and treatment with antibiotics are crucial to prevent serious complications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Tularaemia is caused by a virus.","correct":"✓ Tularaemia is caused by a bacterium.","note":"Tularaemia is caused by the bacterium Francisella tularensis, not a virus."},{"incorrect":"✗ Tularaemia is highly contagious between humans.","correct":"✓ Tularaemia is not highly contagious between humans.","note":"Human-to-human transmission of tularaemia is very rare."}],"priority":"★★☆"},"related_words":{"derivatives":["tularemic (adjective: relating to or affected by tularaemia)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Tularaemia is a relatively rare and technical term referring to a specific infectious disease. Understanding its meaning requires familiarity with medical terminology and zoonotic diseases. The word is primarily used in medical and scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The public health department is investigating a possible case of tularaemia in the area.","translation":"公衆衛生当局は、地域における野兎病の疑いのある症例を調査しています。","type":"noun","meaning_category":"disease"},{"sentence":"Prompt treatment with antibiotics is essential for patients diagnosed with tularaemia.","translation":"野兎病と診断された患者には、抗生物質による迅速な治療が不可欠です。","type":"noun","meaning_category":"disease"}]}