{"word":"Paralexia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"錯読：文字や単語を読み間違えること。失読症の一種で、読もうとする単語とは異なる単語を読んでしまう症状。","english_definition":"A reading disorder in which a person substitutes words or letters for others when reading. It is a type of alexia where the person reads a word differently from how it is written.","examples":[{"sentence":"He suffered from paralexia after the stroke, often reading 'cat' as 'hat'.","translation":"彼は脳卒中後、錯読に苦しみ、「cat」を「hat」と読んでしまうことがよくあった。"},{"sentence":"Paralexia can manifest in different forms, such as semantic paralexia, where the substituted word is related in meaning to the original word.","translation":"錯読は、意味性錯読のように、置換された単語が元の単語と意味的に関連しているなど、さまざまな形で現れることがある。"}],"collocations":["semantic paralexia (意味性錯読)","surface paralexia (表層性錯読)","deep paralexia (深層性錯読)","literal paralexia (文字性錯読)"],"synonyms":["misreading","reading error","dyslexia (より広範な読字障害)"],"antonyms":["accurate reading","correct reading"]}],"etymology":{"value":"ギリシャ語の 'para-' (そば、誤り) + 'lexis' (言葉、読み方) に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəˈlɛksiə/","syllables":"par-a-lex-i-a"},"inflection":{"noun_plural":"paralexias"},"usage_notes":{"explanation":"Paralexiaは、脳損傷や神経学的疾患によって引き起こされる読字障害の一種です。単語全体を別の単語に置き換える場合や、単語の一部の文字を置き換える場合があります。Semantic paralexia（意味性錯読）は、意味的に関連する単語に置き換える現象を指し、例えば 'dog' を 'cat' と読むような場合です。Literal paralexia（文字性錯読）は、単語の一部の文字を置き換える現象を指し、例えば 'clap' を 'glap' と読むような場合です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Paralexia is the same as dyslexia.","correct":"✓ Paralexia is a type of alexia, which is a broader category of reading disorders, while dyslexia is a broader developmental reading disorder.","note":"Paralexiaは失読症の一種であり、失読症は脳損傷などによって後天的に生じる読字障害を指します。一方、dyslexia（ディスレクシア、識字障害）は発達性の読字障害であり、原因や症状が異なります。"},{"incorrect":"✗ Paralexia only affects children.","correct":"✓ Paralexia can affect adults as a result of brain injury or neurological conditions.","note":"Paralexiaは、脳損傷や神経学的疾患の結果として、大人にも起こりえます。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_medical_terms":["alexia","dyslexia","agraphia","aphasia","stroke","neurological disorder"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Paralexia is a highly specialized term related to neuropsychology and speech pathology. It refers to a specific type of reading error characterized by the substitution of words or letters during reading. Understanding this term requires familiarity with neurological conditions and reading disorders. It is not commonly used outside of medical or academic contexts."},"example_sentences":[{"sentence":"The patient's paralexia was evident in his tendency to replace function words with content words.","translation":"患者の錯読は、機能語を内容語に置き換える傾向に明らかだった。","type":"general","meaning_category":"definition"},{"sentence":"Through speech therapy, some individuals with paralexia can improve their reading accuracy.","translation":"言語療法を通して、錯読を持つ人々の中には読字の正確さを改善できる人もいる。","type":"treatment","meaning_category":"treatment"},{"sentence":"Research suggests that different types of brain lesions can lead to different forms of paralexia.","translation":"研究は、脳病変の種類が異なると、異なる形の錯読につながる可能性があることを示唆している。","type":"research","meaning_category":"research"}]}