{"word":"hobblingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"足を引きずりながら、よろめきながら","english_definition":"in a hobbling manner; moving with difficulty or irregularity.","examples":[{"sentence":"The old man walked hobblingly down the street.","translation":"その老人は足を引きずりながら通りを歩いて行った。"},{"sentence":"He advanced hobblingly, leaning on his cane.","translation":"彼は杖に寄りかかりながら、よろめきながら進んだ。"}],"collocations":["walk hobblingly","move hobblingly","advance hobblingly"],"synonyms":["lamely","haltingly","unevenly","staggeringly"],"antonyms":["smoothly","steadily","gracefully"]}],"etymology":{"value":"The word 'hobblingly' is derived from the verb 'hobble,' which means to walk with difficulty because of pain or injury. The suffix '-ingly' is added to form an adverb, indicating the manner in which the action is performed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɒbəlɪŋli/","syllables":"hob-bling-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Hobblingly' describes a way of moving that is unsteady and labored, usually due to some physical impairment or injury. It emphasizes the difficulty and unevenness of the movement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He ran hobblingly to catch the bus.","correct":"✓ He limped to catch the bus.","note":"'Hobblingly' implies a greater degree of difficulty than simply limping. If the person is running, 'hobblingly' might not be the best choice unless the limp is very pronounced."},{"incorrect":"✗ The car moved hobblingly down the road.","correct":"✓ The car moved jerkily down the road.","note":"'Hobblingly' is generally used to describe the movement of people or animals, not machines. For a car, 'jerkily' or 'unevenly' would be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["hobble (verb, noun)","hobbling (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hobblingly' is an adverb that describes the manner of walking with difficulty, usually due to an injury or impediment. It is not a commonly used word and is more likely to be found in descriptive writing. It implies a noticeable and labored movement. Understanding the base word 'hobble' is essential to grasping the meaning of 'hobblingly.'"},"example_sentences":[{"sentence":"The injured soldier hobblingly made his way back to the camp.","translation":"負傷した兵士は足を引きずりながら、よろめきながら陣営へ戻った。","type":"general","meaning_category":"足を引きずりながら"},{"sentence":"She watched the old dog hobblingly cross the yard.","translation":"彼女は老犬が足を引きずりながら庭を横切るのを見ていた。","type":"general","meaning_category":"足を引きずりながら"}]}