{"word":"Delusionist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A performer who presents illusions, often involving mentalism or psychological tricks, creating the impression of mind-reading, telekinesis, or other paranormal abilities.","english_definition":"A performer who presents illusions, often involving mentalism or psychological tricks, creating the impression of mind-reading, telekinesis, or other paranormal abilities.","examples":[{"sentence":"The delusionist amazed the audience with his apparent ability to predict their thoughts.","translation":"そのデリュージョニストは、観客の考えを予知するような能力で観客を驚かせた。"},{"sentence":"Unlike traditional magicians, delusionists focus on creating a sense of wonder and mystery through psychological manipulation.","translation":"伝統的なマジシャンとは異なり、デリュージョニストは心理的な操作を通じて不思議と神秘の感覚を作り出すことに焦点を当てている。"}],"collocations":["mental delusionist","stage delusionist","psychological delusionist"],"synonyms":["mentalist","illusionist","magician","performer"],"antonyms":[]}],"etymology":{"value":"A blend of 'delusion' and '-ist'. The term suggests creating the illusion of delusion or manipulating perceptions to create a sense of wonder and mystery.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈluːʒənɪst/","syllables":"de-lu-sion-ist"},"inflection":{"noun_plural":"Delusionists"},"usage_notes":{"explanation":"The term 'delusionist' is often used to distinguish performers who specialize in mentalism and psychological illusions from traditional magicians who primarily perform sleight-of-hand and other visual tricks. Delusionists often cultivate a persona that suggests they possess genuine psychic abilities, blurring the line between entertainment and perceived reality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a delusionist, so he must be crazy.","correct":"✓ He is a delusionist, so he creates illusions of mental abilities.","note":"'Delusionist' refers to a performer, not someone suffering from actual delusions."}],"priority":"★★☆"},"related_words":{"derivatives":["delusion","illusion","mentalism","magic"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Rare","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Delusionist' is a relatively uncommon word that refers to a type of performer who specializes in creating illusions, often involving mentalism or psychological tricks. They aim to create a sense of wonder and mystery by manipulating perceptions and creating the impression of paranormal abilities. The term is more specialized than 'magician' or 'illusionist'."},"example_sentences":[{"sentence":"The stage **delusionist** convinced the audience he could bend spoons with his mind.","translation":"舞台のデリュージョニストは、自分の心でスプーンを曲げられると観客に信じ込ませた。","type":"noun","meaning_category":"performer"},{"sentence":"Many people are fascinated by the art of the **delusionist**, wondering how they create such convincing illusions.","translation":"多くの人々は、デリュージョニストの芸術に魅了され、彼らがどのようにしてそのような説得力のあるイリュージョンを作り出すのか不思議に思っている。","type":"noun","meaning_category":"performer"}]}