{"word":"list price","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"希望小売価格、定価","english_definition":"the price of an article as stated by the manufacturer or distributor; the recommended retail price.","examples":[{"sentence":"The list price of the car is $25,000, but you might be able to negotiate a lower price.","translation":"その車の希望小売価格は25,000ドルですが、もっと低い価格で交渉できるかもしれません。"},{"sentence":"We are selling these books at 20% off the list price.","translation":"これらの本を定価の20%引きで販売しています。"},{"sentence":"The store often has sales where items are marked down from the list price.","translation":"その店ではよくセールがあり、商品が定価から値下げされます。"}],"collocations":["at list price (定価で)","below list price (定価以下で)","above list price (定価以上で)","manufacturer's list price (メーカー希望小売価格)","suggested list price (推奨小売価格)"],"synonyms":["recommended retail price (RRP)","sticker price","suggested retail price","catalog price","published price"],"antonyms":["discounted price","sale price","wholesale price","cost price"]}],"etymology":{"value":"'List price' is a straightforward combination of 'list' (referring to a catalog or listing of prices) and 'price' (the amount of money for which something is sold).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪst praɪs/","syllables":"list price"},"inflection":{"notes":"It is a noun, so the plural form is 'list prices'."},"usage_notes":{"explanation":"'List price' is the price at which a manufacturer suggests a retailer sell a product. It is often used as a starting point for negotiations or discounts. Consumers rarely pay the full list price, especially for big-ticket items like cars or appliances. The term is important in retail and sales contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The list price is very cheap.","correct":"✓ The list price is very high. / ✓ The item is cheap even at list price.","note":"List prices are typically higher than what consumers expect to pay, so saying it's 'cheap' is usually incorrect unless emphasizing that it's a good deal even at full price."},{"incorrect":"✗ I bought it for the list price, it was a bargain!","correct":"✓ I bought it below the list price, it was a bargain! / ✓ I bought it at the list price, which was a good deal.","note":"Buying something at list price is rarely a bargain unless the list price itself is unusually low or the item is in high demand."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["MSRP (Manufacturer's Suggested Retail Price)","retail price","wholesale price","cost price","market price","selling price","price tag","discount","markup","markdown"],"priority":"★★★"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Moderately Frequent","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'List price' means the price that a company suggests a store should sell something for. It's like the starting price, but often you can find it for less money, especially if there's a sale or you negotiate."},"example_sentences":[{"sentence":"The dealer offered a discount on the car's list price.","translation":"ディーラーは車の希望小売価格から割引を提示した。","type":"example","meaning_category":"定価から割引"},{"sentence":"Always compare prices before buying, as some stores mark up items above the list price.","translation":"購入する前に必ず価格を比較してください。一部の店では、商品を希望小売価格以上に値上げしている場合があります。","type":"example","meaning_category":"定価以上で販売"},{"sentence":"You can often find electronics online for less than the list price.","translation":"電化製品は、オンラインで希望小売価格よりも安く見つかることがよくあります。","type":"example","meaning_category":"定価以下で販売"}]}