{"word":"Zoomorphism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"動物形態主義、獣形化：人間でないもの（神、人、対象など）に動物の特性を付与すること。","english_definition":"The attribution of animal characteristics to non-animal things; especially the representation of a god or human as having the form or characteristics of an animal.","examples":[{"sentence":"Ancient Egyptian gods were often depicted with zoomorphism, such as Anubis with the head of a jackal.","translation":"古代エジプトの神々は、アヌビスがジャッカルの頭を持つなど、しばしば動物形態主義で描かれていた。"},{"sentence":"In literature, zoomorphism can be used to emphasize certain traits of a character.","translation":"文学では、動物形態主義はキャラクターの特定の特性を強調するために使用できる。"},{"sentence":"The use of zoomorphism in art can be traced back to prehistoric cave paintings.","translation":"芸術における動物形態主義の使用は、先史時代の洞窟壁画にまで遡ることができる。"}],"collocations":["religious zoomorphism (宗教的な動物形態主義)","cultural zoomorphism (文化的な動物形態主義)","artistic zoomorphism (芸術的な動物形態主義)","literary zoomorphism (文学的な動物形態主義)","anthropomorphism and zoomorphism (擬人化と動物形態主義)"],"synonyms":["theriomorphism","animalization"],"antonyms":["anthropomorphism (擬人化：人間に動物の特性を付与すること)"]}],"etymology":{"value":"ギリシャ語の「zōion」（動物）と「morphē」（形、形態）の組み合わせに由来する。","priority":"★★★"},"pronunciation":{"ipa":"/ˌzoʊ.əˈmɔːrˌfɪzəm/","syllables":"zo-o-mor-phi-sm"},"inflection":{"noun_plural":"zoomorphisms"},"usage_notes":{"explanation":"「**Zoomorphism**」は、人間以外のものに動物の特性を与えることを指します。特に、神話や宗教において、神々が動物の姿や特徴を持つ場合によく見られます。また、文学や芸術においても、キャラクターや対象の特定の側面を強調するために用いられます。対義語として、動物に人間の特性を与える「Anthropomorphism（擬人化）」があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist used anthropomorphism to create animal characters.","correct":"✓ The artist used zoomorphism to create animal characters.","note":"Anthropomorphism is attributing human characteristics to animals, while zoomorphism is attributing animal characteristics to non-animals (like gods or objects)."},{"incorrect":"✗ Zoomorphism is only found in ancient cultures.","correct":"✓ Zoomorphism can be found in both ancient and modern cultures.","note":"While prevalent in ancient cultures, zoomorphism is still used in modern art, literature, and media. "}],"priority":"★★☆"},"related_words":{"derivatives":["zoomorphic (形容詞：動物形態の、獣形の)"],"related_terms":["anthropomorphism (擬人化)","therianthropy (獣人化：人間が動物に変身する、またはその逆)","totemism (トーテミズム：特定の動物や自然物を氏族の象徴とする信仰)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低い (Relatively low frequency) - 学術的な文脈や専門分野でよく使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Zoomorphism**」は、主に芸術、人類学、宗教学などの分野で使用される専門用語です。これは、神、人間、または無生物に動物の特性または形を与えることを指します。たとえば、古代エジプトの神々（アヌビスなど）は、動物の頭を持つ人間として描かれることがよくありました。この単語は、高度な語彙力と特定の学術分野の知識を必要とするため、一般的には上級レベルの読者向けです。擬人化 (動物に人間の特性を与えること) との違いを理解することが重要です。"},"example_sentences":[{"sentence":"The statue displayed zoomorphism, with the deity having the head of a lion.","translation":"その像は動物形態主義を示しており、神はライオンの頭を持っていた。","type":"noun","meaning_category":"動物形態主義の例"},{"sentence":"Zoomorphism is a common feature in many indigenous religions.","translation":"動物形態主義は多くの先住民族の宗教における一般的な特徴である。","type":"noun","meaning_category":"宗教における動物形態主義"},{"sentence":"The artist explored zoomorphism by giving human-like qualities to animals in his paintings.","translation":"そのアーティストは、絵画の中で人間のような性質を動物に与えることによって、動物形態主義を探求した。","type":"noun","meaning_category":"芸術における動物形態主義"}]}