{"word":"Didelphyidae","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"オポッサム科：アメリカ大陸に生息する有袋類の科","english_definition":"The family of opossums, marsupials native to the Americas.","examples":[{"sentence":"The Didelphyidae family includes a wide variety of opossum species.","translation":"オポッサム科には、多種多様なオポッサム種が含まれています。"},{"sentence":"Didelphyidae are known for their adaptability to different environments.","translation":"オポッサム科は、さまざまな環境への適応力で知られています。"}],"collocations":["Didelphyidae family","Didelphyidae species","American Didelphyidae"],"synonyms":["opossum family"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Didelphis', which comes from Greek 'di' (double) and 'delphys' (womb), referring to the marsupial's characteristic double uterus or pouch. The suffix '-idae' is a standard taxonomic suffix indicating a family.","priority":"★★★"},"pronunciation":{"ipa":"/daɪˌdɛlˈfaɪɪdiː/","syllables":"Di-del-phy-i-dae"},"inflection":{"noun_plural":"Didelphyidae (科名のため、複数形は通常用いない)"},"usage_notes":{"explanation":"'Didelphyidae' is a scientific term used in biology and zoology to classify a specific family of marsupials. It is most often used in academic or scientific contexts. In general conversation, the term 'opossum' is more common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ A Didelphyidae is cute.","correct":"✓ An opossum is cute.","note":"'Didelphyidae' refers to the family, not a single animal. Use 'opossum' when referring to an individual animal."}],"priority":"★★☆"},"related_words":{"derivatives":["Didelphis (genus)","marsupial","mammal","animal"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Didelphyidae' is a scientific term used to classify a family of marsupials known as opossums. This term is primarily used in scientific or academic contexts. It's important to understand that 'Didelphyidae' refers to the entire family, while 'opossum' can refer to individual animals within that family. Due to its specialized usage, this term is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"Research on Didelphyidae provides insights into the evolution of marsupials in the Americas.","translation":"オポッサム科の研究は、アメリカ大陸における有袋類の進化に関する洞察を提供します。","type":"noun","meaning_category":"オポッサム科"},{"sentence":"The classification of certain opossum species within Didelphyidae is still under debate.","translation":"オポッサム科内の一部のオポッサム種の分類は、まだ議論中です。","type":"noun","meaning_category":"オポッサム科"}]}