{"word":"inhesion","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"粘着、密着、付着","english_definition":"The state of sticking together; adherence; cohesion.","examples":[{"sentence":"The inhesion of the paint to the wall was poor, and it started to peel.","translation":"塗料の壁への粘着が悪く、剥がれ始めた。"},{"sentence":"The inhesion between the two surfaces was strengthened by the adhesive.","translation":"接着剤によって2つの表面間の密着が強化された。"}],"collocations":["poor inhesion","strong inhesion","surface inhesion","promote inhesion"],"synonyms":["adhesion","cohesion","sticking","attachment","adherence"],"antonyms":["separation","detachment","repulsion"]}],"etymology":{"value":"From Latin *inhaesiōnem*, from *inhaerēre* ('to stick to, adhere'), from *in-* ('in, on') + *haerēre* ('to stick, cling').","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈhiːʒən/","syllables":"in-he-sion"},"inflection":{"noun_plural":"inhesions"},"usage_notes":{"explanation":"'Inhesion' refers to the physical property of two surfaces or substances sticking together. It is often used in technical contexts, such as in materials science, engineering, and chemistry, to describe the degree to which one material adheres to another. It is similar to 'adhesion' and 'cohesion', but 'inhesion' specifically emphasizes the state of sticking together.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inhesion of the idea was well-received.","correct":"✓ The idea was well-received.","note":"'Inhesion' refers to physical sticking, not abstract concepts. Use 'reception' or 'acceptance' for ideas."},{"incorrect":"✗ The inhesion between the people was strong.","correct":"✓ The cohesion between the people was strong.","note":"For people sticking together in a social or emotional sense, use 'cohesion' instead of 'inhesion'."}],"priority":"★★☆"},"related_words":{"derivatives":["inhere (verb): to exist essentially or permanently in something.","inherent (adjective): existing in something as a permanent, essential, or characteristic attribute."],"related_terms":["adhesion","cohesion","adherence","attachment"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Inhesion' is a relatively uncommon term that describes the physical property of two surfaces or substances sticking or clinging together. It is often used in technical or scientific contexts. It is related to the words 'adhesion' and 'cohesion,' but it specifically emphasizes the state of being stuck together. It is not typically used in everyday language."},"example_sentences":[{"sentence":"The manufacturer tested the inhesion of the coating to ensure its durability.","translation":"製造業者は、耐久性を確保するために、コーティングの密着性をテストした。","type":"noun","meaning_category":"密着性"},{"sentence":"Proper surface preparation is crucial for good inhesion of the adhesive.","translation":"適切な表面処理は、接着剤の良好な付着に不可欠である。","type":"noun","meaning_category":"付着"},{"sentence":"The inhesion between the particles was improved by the addition of a binder.","translation":"バインダーの添加により、粒子間の粘着性が向上した。","type":"noun","meaning_category":"粘着"}]}