{"word":"obnubilation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)意識混濁、意識朦朧","english_definition":"The state of being clouded or confused in mind; mental obscurity.","examples":[{"sentence":"The patient presented with obnubilation following the head trauma.","translation":"その患者は頭部外傷後、意識混濁を呈した。"},{"sentence":"Obnubilation can be a symptom of various neurological disorders.","translation":"意識混濁は様々な神経学的疾患の症状となりうる。"}],"collocations":["mental obnubilation","clouding of consciousness"],"synonyms":["clouding of consciousness","mental confusion","altered mental status","dazedness","stupefaction"],"antonyms":["clarity","lucidity","alertness"]}],"etymology":{"value":"Late Latin obnubilatio, from obnubilare (to cloud over), from ob- (over) + nubilare (to cloud), from nubilum (cloud).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒbnjuːbɪˈleɪʃən/","syllables":"ob-nu-bi-la-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Obnubilation\" is a relatively uncommon term, primarily used in medical contexts to describe a state of clouded or confused consciousness. It indicates a less severe alteration in mental status compared to coma or delirium, but more pronounced than simple drowsiness. The term is often used in neurology and psychiatry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The obnubilation of the sky made it difficult to see the stars.","correct":"✓ The cloudiness of the sky made it difficult to see the stars.","note":"\"Obnubilation\" refers specifically to a clouded mental state, not to cloud cover in the sky. For the latter, use \"cloudiness\" or similar terms."}],"priority":"★★☆"},"related_words":{"derivatives":["obnubilate (verb: to cloud over, obscure)","obnubilated (adjective: clouded, obscured)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Obnubilation\" is a highly specialized term primarily encountered within medical and clinical settings. It denotes a specific state of altered consciousness characterized by mental clouding and confusion. Due to its technical nature and limited usage outside of professional medical discourse, it is considered a word of advanced vocabulary. Understanding requires familiarity with medical terminology and concepts related to neurological and psychiatric conditions."},"example_sentences":[{"sentence":"The doctor noted the patient's obnubilation in the medical chart.","translation":"医師は患者の意識混濁をカルテに記録した。","type":"general","meaning_category":"medical"},{"sentence":"Severe dehydration can sometimes lead to obnubilation.","translation":"重度の脱水症状は時に意識混濁を引き起こすことがある。","type":"general","meaning_category":"medical"}]}