{"word":"aquaregia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"王水（おうすい）：濃硝酸と濃塩酸を1:3のモル比で混合した、金を溶解できる非常に腐食性の高い混合物","english_definition":"A highly corrosive mixture of concentrated nitric acid and hydrochloric acid, optimally in a molar ratio of 1:3. It was named so by alchemists because it can dissolve the noble metals gold and platinum, though not all metals.","examples":[{"sentence":"Aquaregia is used to dissolve gold because neither nitric acid nor hydrochloric acid can do so alone.","translation":"王水は、硝酸も塩酸も単独では金を溶解できないため、金を溶解するために使用されます。"},{"sentence":"The alchemists discovered that aquaregia could dissolve the king of metals, gold.","translation":"錬金術師たちは、王水が金属の王である金を溶解できることを発見しました。"}],"collocations":["dissolve gold with aquaregia","mixture of nitric and hydrochloric acid","corrosive mixture"],"synonyms":["nitrohydrochloric acid"],"antonyms":[]}],"etymology":{"value":"ラテン語の \"aqua regia\" に由来し、「王の水」を意味します。これは、この混合物が貴金属である金を溶解できることから、錬金術師によって名付けられました。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌækwəˈriːdʒiə/","syllables":"a-qua-re-gi-a"},"inflection":{"noun_plural":"aquaregias"},"usage_notes":{"explanation":"王水は、金や白金などの貴金属を溶解できることで知られています。硝酸は酸化剤として働き、塩酸は金イオンと反応してテトラクロリド金(III)アニオン（[AuCl4]−）を形成し、溶液から金イオンを取り除くことで、金のさらなる酸化を促進します。この反応により、金は溶解します。非常に腐食性が高く、取り扱いには注意が必要です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Aquaregia is safe to handle with bare hands.","correct":"✓ Aquaregia is highly corrosive and should not be handled with bare hands.","note":"王水は非常に腐食性が高く、皮膚に触れると重度の化学熱傷を引き起こす可能性があります。"},{"incorrect":"✗ Aquaregia can dissolve all metals.","correct":"✓ Aquaregia can dissolve noble metals like gold and platinum, but not all metals.","note":"王水はすべての金属を溶解できるわけではありません。特に、鉄やアルミニウムなどの卑金属は溶解しません。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["nitric acid","hydrochloric acid","gold","platinum","corrosion","acid","chemistry","alchemy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 化学や錬金術の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**aquaregia**（王水）」は、濃硝酸と濃塩酸を混合した非常に腐食性の高い液体を指す、専門的な化学用語です。この混合物は、金や白金などの貴金属を溶解できることで知られています。これは、硝酸が酸化剤として働き、塩酸が生成された金イオンと反応して、溶液から金イオンを取り除くことで、金のさらなる酸化を促進するためです。この用語は、日常会話ではほとんど使用されず、化学、冶金、または歴史的な錬金術の文脈で最も一般的に使用されます。その腐食性の性質のため、取り扱いには特別な注意が必要です。"},"example_sentences":[{"sentence":"The chemist prepared aquaregia to dissolve the gold sample.","translation":"化学者は金のサンプルを溶解するために王水を準備しました。","type":"noun","meaning_category":"化学"},{"sentence":"Aquaregia was historically used by alchemists in their attempts to create the philosopher's stone.","translation":"王水は歴史的に、錬金術師が賢者の石を作り出そうとする試みの中で使用されました。","type":"noun","meaning_category":"歴史"}]}