{"word":"Coupage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ワイン製造における)異なる種類のワインをブレンドすること、またはブレンドされたワインそのもの","english_definition":"(in winemaking) the blending of different wines to create a final product, or the resulting blend itself.","examples":[{"sentence":"The coupage of Cabernet Sauvignon and Merlot creates a balanced flavor profile.","translation":"カベルネ・ソーヴィニヨンとメルローのクーパージュは、バランスの取れた風味を生み出す。"},{"sentence":"This wine is a coupage of several different grape varieties.","translation":"このワインはいくつかの異なるブドウ品種のクーパージュである。"}],"collocations":["coupage wine","coupage blend","grape coupage"],"synonyms":["blend","assemblage","cuvée"],"antonyms":[]}],"etymology":{"value":"フランス語の「couper」（切る、混ぜる）に由来する。ワイン製造において、異なるワインを混ぜ合わせる行為を指す専門用語。","priority":"★★☆"},"pronunciation":{"ipa":"/kuːˈpɑːʒ/","syllables":"coo-pahzh"},"inflection":{"notes":"可算名詞"},"usage_notes":{"explanation":"「**Coupage**」は、主にワイン業界で使用される専門用語で、異なる種類のワインをブレンドするプロセス、またはその結果として得られるブレンドワイン自体を指します。単一のブドウ品種から作られたワインとは異なり、クーパージュは、意図的に複数の品種を組み合わせることで、より複雑でバランスの取れた風味やアロマを実現しようとします。この用語は、特にヨーロッパのワイン産地でよく用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The coupage was made of only one grape.","correct":"✓ The wine was made of only one grape.","note":"クーパージュは複数のブドウ品種をブレンドすることなので、単一のブドウ品種から作られたワインをクーパージュと呼ぶのは誤りです。"},{"incorrect":"✗ I don't like coupage because it's artificial.","correct":"✓ (Depending on the context) I prefer single-varietal wines.","note":"クーパージュは、必ずしも人工的なプロセスではありません。ワインメーカーの意図と技術によって、自然な風味の組み合わせを生み出すことができます。クーパージュに対する好みは、個人の趣向によるものです。"}],"priority":"★★☆"},"related_words":{"derivatives":["couper (フランス語: 切る、混ぜる)"],"phrasal_verbs":[],"related_terms":["assemblage","blend","cuvée","varietal wine","terroir"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - ワイン業界以外ではあまり使われない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Coupage**」はワイン製造の専門用語で、異なる種類のワインを混ぜ合わせることを指します。ワインの風味、香り、バランスを調整するために行われ、最終的な製品の品質を向上させる目的があります。この用語は、ワイン愛好家や専門家向けの文章でよく見られます。ワインに関する知識がない人にとっては、馴染みのない言葉かもしれません。"},"example_sentences":[{"sentence":"The winemaker carefully selected the grapes for the final coupage.","translation":"ワインメーカーは最終的なクーパージュのために慎重にブドウを選んだ。","type":"noun","meaning_category":"ワインブレンド"},{"sentence":"The coupage resulted in a complex and well-balanced wine.","translation":"そのクーパージュは複雑でバランスの取れたワインを生み出した。","type":"noun","meaning_category":"ワインブレンドの結果"}]}