{"word":"HDLC","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"高水準データリンク制御手順 (High-level Data Link Control): ISO標準のデータリンク層プロトコルの一つ。","english_definition":"High-level Data Link Control: A group of communication protocols of the data link layer, standardized by the ISO.","examples":[{"sentence":"HDLC is a bit-oriented synchronous data link layer protocol.","translation":"HDLCは、ビット指向の同期データリンク層プロトコルです。"},{"sentence":"HDLC is used for communication over point-to-point or multi-point links.","translation":"HDLCは、ポイントツーポイントまたはマルチポイントリンクでの通信に使用されます。"}],"collocations":["HDLC frame","HDLC protocol","HDLC standard"],"synonyms":["SDLC (Synchronous Data Link Control)"],"antonyms":[],"notes":"HDLC is the general form, and SDLC is a specific implementation by IBM."}],"etymology":{"value":"Acronym of 'High-level Data Link Control'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌeɪtʃˌdiːˌɛlˈsiː/","syllables":"aitch-dee-el-see"},"inflection":{"notes":"It's a noun, so plural is HDLCs, but rarely used."},"usage_notes":{"explanation":"HDLC is a protocol used at the data link layer (Layer 2) of the OSI model. It provides a method for transmitting data between network nodes in a reliable manner. It is a bit-oriented protocol, meaning that it transmits data as a continuous stream of bits rather than as characters.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_terms":["LAPB (Link Access Procedure, Balanced)","LAPD (Link Access Procedure on the D channel)","PPP (Point-to-Point Protocol)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"HDLC is a technical term related to networking and data communication. It is typically encountered in contexts dealing with network protocols, data transmission, and telecommunications. Understanding HDLC requires familiarity with networking concepts and the OSI model."},"example_sentences":[{"sentence":"The router uses HDLC encapsulation for serial interfaces.","translation":"そのルーターは、シリアルインターフェースにHDLCカプセル化を使用しています。","type":"general","meaning_category":"Networking"},{"sentence":"HDLC provides error detection and correction mechanisms.","translation":"HDLCは、エラー検出および訂正メカニズムを提供します。","type":"technical","meaning_category":"Data Communication"}]}