{"word":"turbidimetry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"比濁法","english_definition":"An analytical technique in which the turbidity (cloudiness) of a solution is measured to determine the concentration of suspended particles.","examples":[{"sentence":"Turbidimetry is used to quantify bacterial growth in a liquid medium.","translation":"比濁法は、液体培地中の細菌の増殖を定量化するために使用されます。"},{"sentence":"The concentration of the precipitate was determined using turbidimetry.","translation":"沈殿物の濃度は、比濁法を用いて決定されました。"}],"collocations":["perform turbidimetry","turbidimetry assay","turbidimetry measurement"],"synonyms":["nephelometry"],"antonyms":[]}],"etymology":{"value":"From 'turbid' (cloudy) + '-metry' (measurement).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɜːrbɪˈdɪmətri/","syllables":"tur-bid-i-me-try"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Turbidimetry measures the decrease in light transmission through a solution due to the presence of particulate matter. It is distinct from nephelometry, which measures the light scattered by the particles.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["turbidimetric (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Turbidimetry is a scientific term used in chemistry and biology. It refers to a method of measuring the cloudiness (turbidity) of a liquid to find out how much of a substance is dissolved or suspended in it. It's like shining a light through the liquid and seeing how much of the light gets blocked by the particles in the liquid. The more particles, the less light gets through, and this helps scientists figure out the concentration of the substance. This term is mainly used in lab settings and scientific research.","priority":"★★☆"},"example_sentences":[{"sentence":"The experiment involved the use of turbidimetry to assess the clarity of the water samples.","translation":"その実験では、比濁法を用いて水サンプルの透明度を評価しました。","type":"general","meaning_category":"definition"},{"sentence":"Turbidimetry results indicated a high level of suspended solids in the wastewater.","translation":"比濁法の結果は、廃水中の浮遊固形物の高レベルを示していました。","type":"example","meaning_category":"application"}]}