{"word":"phototypy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"写真版、写真凸版（主に19世紀後半から20世紀初頭に使われた印刷技術）","english_definition":"A printing process in which a photograph is transferred to a printing plate, typically a metal or glass plate coated with a light-sensitive gelatin or other substance, and then etched or otherwise treated to create a relief or intaglio image that can be used for printing.","examples":[{"sentence":"Phototypy was a popular method for reproducing photographs in books and magazines before the advent of halftone printing.","translation":"写真版は、ハーフトーン印刷が登場する以前は、書籍や雑誌で写真を複製するための一般的な方法でした。"},{"sentence":"The museum has a collection of original phototypy plates.","translation":"その博物館はオリジナルの写真版のプレートを所蔵しています。"}],"collocations":["collotype","artotype","lichtdruck"],"synonyms":["collotype","artotype","lichtdruck"],"antonyms":[]}],"etymology":{"value":"\"photo-\" (光) + \"-typy\" (印刷) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/foʊˈtoʊtaɪpi/","syllables":"pho-to-ty-py"},"inflection":{"noun_plural":"phototypies"},"usage_notes":{"explanation":"Phototypyは、写真画像を印刷するための歴史的な技術を指します。特に、ハーフトーン印刷が普及する前に使用された、collotype、artotype、lichtdruckなどを含む様々なプロセスを包括的に指すことがあります。現代ではほとんど使用されませんが、歴史的な文脈で言及されることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used phototypy to create digital images.","correct":"✓ He used a scanner to create digital images from the phototypy.","note":"Phototypyは印刷技術であり、デジタル画像を直接作成するものではありません。"},{"incorrect":"✗ Phototypy is the same as digital photography.","correct":"✓ Phototypy is an early form of photographic printing.","note":"Phototypyはデジタル写真とは異なり、アナログの印刷技術です。"}],"priority":"★★☆"},"related_words":{"derivatives":["phototype (名詞: 写真版)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 歴史的な文脈でのみ使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**phototypy**」は、写真画像を印刷するための古い技術を指す専門用語です。これは、ハーフトーン印刷が一般的になる前に使用された、光に敏感な物質でコーティングされたプレートに写真を転写し、印刷に使用できるレリーフまたは凹版を作成するプロセスです。この用語は、歴史的な文脈や印刷技術の議論でのみ使用される可能性が高く、一般的な語彙ではありません。"},"example_sentences":[{"sentence":"The book featured several high-quality phototypy reproductions of the original paintings.","translation":"その本には、オリジナルの絵画の高品質な写真版複製がいくつか掲載されていました。","type":"noun","meaning_category":"写真版"},{"sentence":"Researchers are studying the phototypy process to better understand the history of photographic printing.","translation":"研究者たちは、写真印刷の歴史をよりよく理解するために、写真版のプロセスを研究しています。","type":"noun","meaning_category":"写真版"}]}