{"word":"servo-motor","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"サーボモーター","english_definition":"A rotary actuator or linear actuator that allows for precise control of angular or linear position, velocity and acceleration. It consists of a suitable motor coupled to a sensor for position feedback. It also requires a relatively sophisticated controller, often a dedicated module designed specifically for use with servomotors.","examples":[{"sentence":"The robot arm uses servo-motors for precise movements.","translation":"ロボットアームは正確な動きのためにサーボモーターを使用します。"},{"sentence":"Servo-motors are commonly used in CNC machines.","translation":"サーボモーターはCNCマシンで一般的に使用されています。"},{"sentence":"The drone's stability is maintained by servo-motors adjusting the propeller angles.","translation":"ドローンの安定性は、プロペラの角度を調整するサーボモーターによって維持されます。"}],"collocations":["precision servo-motor","high-torque servo-motor","digital servo-motor","analog servo-motor","control a servo-motor","calibrate a servo-motor"],"synonyms":["servomotor","servo"],"antonyms":[]}],"etymology":{"value":"The term 'servo-motor' is a combination of 'servo' (from Latin 'servus' meaning 'slave' or 'servant', referring to its role as a 'servant' following commands) and 'motor' (from Latin 'motor', meaning 'mover').","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɜːrvoʊˌmoʊtər/","syllables":"ser-vo-mo-tor"},"inflection":{"noun_plural":"servo-motors"},"usage_notes":{"explanation":"'Servo-motor' refers to a specific type of motor that incorporates feedback control to achieve precise positioning. It's commonly used in applications requiring accuracy and responsiveness. The term is often shortened to 'servo'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The servo motor was broken, so the robot arm didn't work.","correct":"✓ The servo-motor was broken, so the robot arm didn't work.","note":"While 'servo motor' is understandable, 'servo-motor' is the more technically correct term. Using the hyphen clarifies that it's a single component with a specific function."},{"incorrect":"✗ The servo motor is controlling by the computer.","correct":"✓ The servo-motor is controlled by the computer.","note":"'Controlled' is the past participle form needed here, not 'controlling'. Also, using the hyphenated form is preferred."}],"priority":"★★☆"},"related_words":{"derivatives":["servo (noun: shortened form of servo-motor, or a general term for a control system)","servomechanism (noun: a feedback control system)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'servo-motor' refers to a specific type of motor used in automated systems to provide precise control over movement. It's a technical term primarily used in engineering, robotics, and automation contexts. Understanding the function and application of servo-motors requires some familiarity with control systems and feedback mechanisms. While the concept is relatively straightforward, the implementation and advanced control strategies can be quite complex, making it a term more commonly encountered in technical documentation and specialized fields."},"example_sentences":[{"sentence":"The **servo-motor** precisely positions the robotic arm.","translation":"サーボモーターはロボットアームを正確に位置決めします。","type":"noun","meaning_category":"Definition"},{"sentence":"The CNC machine relies on **servo-motors** for accurate cutting.","translation":"CNCマシンは、正確な切断のためにサーボモーターに依存しています。","type":"noun","meaning_category":"Definition"},{"sentence":"The engineer calibrated the **servo-motor** to ensure optimal performance.","translation":"エンジニアは、最適なパフォーマンスを確保するためにサーボモーターを調整しました。","type":"noun","meaning_category":"Definition"}]}