{"word":"Comptean","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Relating to or characteristic of Auguste Comte or his philosophy of positivism.","english_definition":"Relating to or characteristic of Auguste Comte or his philosophy of positivism.","examples":[{"sentence":"Comptean sociology emphasizes empirical observation and the discovery of social laws.","translation":"コントの実証主義社会学は、経験的な観察と社会法則の発見を重視する。"}],"collocations":["Comptean positivism","Comptean sociology"],"synonyms":["Comtist","positivistic"],"antonyms":[]}],"etymology":{"value":"Derived from the name of Auguste Comte (1798-1857), the French philosopher and sociologist, combined with the suffix '-an', indicating association or relation.","priority":"★★★"},"pronunciation":{"ipa":"/kɒmptiən/","syllables":"Com-pte-an"},"inflection":{"notes":"This is an adjective and does not inflect for number or gender."},"usage_notes":{"explanation":"'Comptean' is primarily used in academic or philosophical contexts when discussing or referencing ideas directly related to Auguste Comte's work, particularly his positivist philosophy. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a Comptean view of the world, believing in magic and superstition.","correct":"✓ He had a Comptean view of the world, emphasizing scientific observation and rational thought.","note":"Comptean philosophy is rooted in science and reason, so associating it with magic or superstition would be incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["Comte (noun: Auguste Comte)","Comtism (noun: the philosophical system of Auguste Comte)","positivism (noun: a philosophical system recognizing only that which can be scientifically verified or which is capable of logical or mathematical proof)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in academic or philosophical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Comptean' is specific to discussions of philosophy and sociology, particularly concerning the work of Auguste Comte. Understanding this word requires familiarity with the history of social thought and philosophical terminology. The word is not commonly encountered outside of academic contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The Comptean approach to social science sought to establish objective laws governing human behavior.","translation":"社会科学へのコント的アプローチは、人間の行動を支配する客観的な法則を確立しようとした。","type":"adjective","meaning_category":"Relating to Auguste Comte"},{"sentence":"Critics of Comptean positivism argue that it oversimplifies the complexities of human experience.","translation":"コントの実証主義の批判者たちは、それが人間の経験の複雑さを単純化しすぎていると主張する。","type":"adjective","meaning_category":"Characteristic of Comte's philosophy"}]}