{"word":"hets","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(主に遺伝学で)ヘテロ接合体 (heterozygotes) の複数形または略語","english_definition":"Plural form or abbreviation of heterozygotes (primarily in genetics).","examples":[{"sentence":"The offspring were a mix of homozygotes and hets.","translation":"子孫はホモ接合体とヘテロ接合体の混合だった。"},{"sentence":"We analyzed the hets to determine the recombination frequency.","translation":"組換え頻度を決定するために、ヘテロ接合体を分析した。"}],"collocations":["homozygotes and hets (ホモ接合体とヘテロ接合体)","analyzing hets (ヘテロ接合体の分析)"],"synonyms":["heterozygotes"],"antonyms":["homozygotes"]}],"etymology":{"value":"Derived from the abbreviation of 'heterozygotes'.","priority":"★★★"},"pronunciation":{"ipa":"/hɛts/","syllables":"hets"},"inflection":{"noun_plural":"hets"},"usage_notes":{"explanation":"'Hets' is a specialized term used primarily in the field of genetics. It refers to individuals or organisms that are heterozygous for a particular gene or set of genes. In simpler terms, it means that for a specific trait, the individual has two different alleles (versions) of the gene, one inherited from each parent. The term is often used as a shorthand in scientific writing and discussions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The hets are homozygous for the trait.","correct":"✓ The hets are heterozygous for the trait.","note":"Heterozygous (hets) means having two different alleles, while homozygous means having two identical alleles. These are opposite concepts."},{"incorrect":"✗ Het is a singular form.","correct":"✓ Hets is a plural form. The singular form is heterozygote.","note":"'Hets' is already a plural form. The singular form is 'heterozygote'."}],"priority":"★★☆"},"related_words":{"derivatives":["heterozygote (単数形)","heterozygous (形容詞)","homozygote (対義語)","homozygous (対義語の形容詞)","allele","gene","genotype","phenotype"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 専門分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hets' is a technical term used in genetics. It is the plural form or abbreviation of 'heterozygotes,' which refers to individuals or organisms that have two different alleles (versions) of a particular gene. Understanding this term requires a background in genetics and is typically encountered in advanced scientific contexts. It's important to distinguish it from 'homozygotes,' which have two identical alleles for a gene."},"example_sentences":[{"sentence":"The study focused on identifying hets within the population.","translation":"その研究は、集団内のヘテロ接合体の特定に焦点を当てた。","type":"noun","meaning_category":"ヘテロ接合体"},{"sentence":"The ratio of hets to homozygotes was approximately 1:1.","translation":"ヘテロ接合体とホモ接合体の比率は約1：1だった。","type":"noun","meaning_category":"ヘテロ接合体"}]}