{"word":"toddycat","priority":"low","meanings":[{"part_of_speech":"noun","definition":"A civet, especially the Asian palm civet (Paradoxurus hermaphroditus).","english_definition":"A civet, especially the Asian palm civet (Paradoxurus hermaphroditus).","examples":[{"sentence":"The toddycat is known for its role in producing Kopi Luwak, a type of coffee.","translation":"トディキャットは、コピ・ルアクという種類のコーヒーの生産における役割で知られています。"}],"collocations":["Asian palm toddycat","civet cat"],"synonyms":["civet","musang"],"antonyms":[]}],"etymology":{"value":"Likely derived from 'toddy' (a palm wine) and 'cat', referring to the animal's fondness for the sap used to make toddy, or perhaps its cat-like appearance.","priority":"medium"},"pronunciation":{"ipa":"/ˈtɒdiˌkæt/","syllables":"tod-dy-cat"},"inflection":{"noun_plural":"toddycats"},"usage_notes":{"explanation":"The term 'toddycat' is primarily used in South and Southeast Asia. It is a common name for the Asian palm civet, an animal known for its role in the production of Kopi Luwak coffee. The animal eats coffee cherries, and the partially digested beans are collected from its droppings, processed, and sold as a luxury coffee.","priority":"medium"},"common_mistakes":{"examples":[],"priority":"low"},"related_words":{"derivatives":["Kopi Luwak"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"The word 'toddycat' refers to a specific animal, the Asian palm civet. Understanding this word requires some knowledge of zoology and regional fauna, particularly in South and Southeast Asia. The term is not commonly used outside of these contexts or in general English conversation."},"example_sentences":[{"sentence":"The villagers set traps to protect their fruit trees from the toddycat.","translation":"村人たちは果樹をトディキャットから守るために罠を仕掛けた。","type":"noun","meaning_category":"animal"},{"sentence":"Kopi Luwak is made from coffee beans eaten and excreted by the toddycat.","translation":"コピ・ルアクは、トディキャットが食べて排泄したコーヒー豆から作られている。","type":"noun","meaning_category":"animal"}]}