{"word":"dandify","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人や物を)飾る、おしゃれにする、気取らせる","english_definition":"To make (someone or something) like a dandy; to adorn or dress up in a showy or affected manner.","examples":[{"sentence":"He dandified his old car with new chrome and paint.","translation":"彼は古い車に新しいクロムメッキと塗装を施して、おしゃれにした。"},{"sentence":"She dandified herself for the party, wearing a sparkling dress and elaborate jewelry.","translation":"彼女はパーティーのために、きらびやかなドレスと手の込んだジュエリーを身に着けて、着飾った。"},{"sentence":"The interior designer dandified the living room with luxurious fabrics and antique furniture.","translation":"インテリアデザイナーは、豪華な生地とアンティーク家具でリビングルームを飾った。"}],"collocations":["dandify a car","dandify a room","dandify oneself","dandify an outfit"],"synonyms":["adorn","embellish","decorate","dress up","prettify","beautify","spruce up"],"antonyms":["simplify","plainify","uglify","dowdy"]},{"part_of_speech":"verb","transitivity":"vi","definition":"気取る、おしゃれをする","english_definition":"To act like a dandy; to dress or behave in an affectedly elegant manner.","examples":[{"sentence":"He dandified around town, showing off his expensive clothes and accessories.","translation":"彼は高価な服やアクセサリーを見せびらかしながら、街中で気取っていた。"},{"sentence":"She dandified at the ball, trying to impress the other guests with her elaborate gown.","translation":"彼女は舞踏会で、手の込んだガウンで他の客を感心させようと気取っていた。"},{"sentence":"Stop dandifying and get to work!","translation":"気取るのはやめて仕事に取り掛かりなさい！"}],"collocations":["dandify around","dandify at a party","dandify for attention"],"synonyms":["flaunt","strut","show off","pose","primp"],"antonyms":["be humble","be modest","behave naturally"]}],"etymology":{"value":"Derived from 'dandy' (a man unduly devoted to style, neatness, and fashion in dress and appearance) + '-ify' (a suffix meaning 'to make or cause to become').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdændɪfaɪ/","syllables":"dan-di-fy"},"inflection":{"verb_forms":{"present_simple":["dandify","dandifies"],"past_simple":"dandified","past_participle":"dandified","present_participle":"dandifying"}},"usage_notes":{"explanation":"'Dandify' implies an excessive or affected attention to appearance, often with the intention of impressing others. It can be used both for making something or someone more stylish and for the act of behaving like a dandy. The word often carries a slightly negative connotation, suggesting vanity or superficiality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He dandified the room with simple decorations.","correct":"✓ He decorated the room with simple decorations.","note":"'Dandify' implies elaborate and showy decoration, not simple decoration."},{"incorrect":"✗ She dandified because she was sad.","correct":"✓ She dressed up because she was sad.","note":"'Dandify' implies an affected or showy manner of dressing, not simply dressing up."}],"priority":"★★☆"},"related_words":{"derivatives":["dandy (noun, adjective)","dandyism (noun)"],"phrasal_verbs":[],"related_concepts":["fashion","style","elegance","grooming","vanity"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dandify' is a relatively uncommon word that means to make someone or something like a dandy, which is a man who is excessively concerned with his appearance and fashion. It implies a showy or affected manner of dressing or decorating. Because of its specific meaning and low frequency, it is typically used in more advanced or literary contexts."},"example_sentences":[{"sentence":"The tailor carefully dandified the suit, adding intricate details and embellishments.","translation":"仕立て屋は、凝ったディテールと装飾を加えて、スーツを注意深く飾り立てた。","type":"verb (vt)","meaning_category":"飾る、おしゃれにする"},{"sentence":"He spent hours dandifying himself before going out, meticulously styling his hair and choosing the perfect outfit.","translation":"彼は出かける前に何時間もかけて身なりを整え、髪型を細かく整え、完璧な服装を選んだ。","type":"verb (vi)","meaning_category":"気取る、おしゃれをする"},{"sentence":"The hotel lobby was dandified with opulent furnishings and extravagant artwork.","translation":"ホテルのロビーは、豪華な家具と贅沢な芸術作品で飾られていた。","type":"verb (vt)","meaning_category":"飾る、おしゃれにする"}]}