{"word":"tallyman","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"集金人、割賦販売の集金人","english_definition":"A person who collects payments on installment plans, especially for clothing or household goods.","examples":[{"sentence":"The tallyman came by every week to collect the payments.","translation":"集金人は毎週支払いを集めにやって来た。"},{"sentence":"She bought the furniture from a tallyman.","translation":"彼女は集金人から家具を割賦で購入した。"}],"collocations":["door-to-door tallyman","weekly tallyman","tallyman calls"],"synonyms":["installment collector","debt collector"],"antonyms":[],"notes":"This term is somewhat dated but may still be encountered in historical contexts or older literature, particularly in the UK."}],"etymology":{"value":"The word 'tallyman' comes from the practice of using tallies (notched sticks) to record debts and payments. The tallyman would keep one half of the tally, and the customer would keep the other.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtælimæn/","syllables":"tal-ly-man"},"inflection":{"noun_plural":"tallymen"},"usage_notes":{"explanation":"A tallyman was a common figure in the past, especially in working-class communities, offering credit for goods and collecting payments in installments. The system relied on trust and the physical tally sticks as a record of the transaction.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["tally (noun, verb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'tallyman' refers to a historical occupation related to installment-based selling and debt collection. Understanding this term requires knowledge of historical economic practices and social contexts, making it more relevant to advanced learners or those interested in historical studies."},"example_sentences":[{"sentence":"In the past, the **tallyman** was a familiar figure in many working-class neighborhoods.","translation":"昔、集金人は多くの労働者階級の地域でよく知られた存在だった。","type":"noun","meaning_category":"集金人"},{"sentence":"The family struggled to make the weekly payments to the **tallyman**.","translation":"その家族は毎週集金人への支払いを済ませるのに苦労した。","type":"noun","meaning_category":"集金人"}]}