{"word":"extraovular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"卵管外の、卵胞外の","english_definition":"Located or occurring outside of an ovule or ovary.","examples":[{"sentence":"The extraovular pregnancy was a rare and dangerous condition.","translation":"卵管外妊娠はまれで危険な状態だった。"},{"sentence":"Extraovular fluid was detected during the examination.","translation":"検査中に卵胞外液が検出された。"}],"collocations":["extraovular pregnancy","extraovular fluid"],"synonyms":["ectopic","extrauterine"],"antonyms":["intraovular","intrauterine"]}],"etymology":{"value":"\"extra-\" (outside) + \"ovular\" (relating to an ovule or ovary).","priority":"★★★"},"pronunciation":{"ipa":"/ˌekstrəˈɒvjʊlər/","syllables":"ex-tra-ov-u-lar"},"inflection":{"notes":"Comparative and superlative forms are 'more extraovular' and 'most extraovular', respectively."},"usage_notes":{"explanation":"This term is primarily used in medical and biological contexts to describe something located or occurring outside the ovule or ovary. It is often used in discussions of ectopic pregnancies or other conditions related to the female reproductive system.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The extraovular cell was found inside the ovary.","correct":"✓ The extraovular cell was found outside the ovary.","note":"The prefix \"extra-\" means outside, so extraovular means outside the ovule or ovary."}],"priority":"★★★"},"related_words":{"derivatives":["extraovularly"],"related_terms":["ovule","ovary","ectopic pregnancy"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term \"extraovular\" is a highly specialized term used in medical and biological contexts. It describes something located or occurring outside of an ovule (the structure that develops into a seed after fertilization) or an ovary (the female reproductive organ that produces ovules). Understanding this term requires advanced knowledge of reproductive biology and medical terminology. It is not commonly used outside of these fields."},"example_sentences":[{"sentence":"The extraovular development of the embryo led to complications.","translation":"胚の卵管外での発育は合併症を引き起こした。","type":"general","meaning_category":"medical"},{"sentence":"An extraovular mass was identified during the ultrasound.","translation":"超音波検査で卵胞外の塊が確認された。","type":"specific","meaning_category":"medical"}]}