{"word":"relationality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"関係性、関係性に基づく性質、関係性を持つこと","english_definition":"The state of being relational; the property of pertaining to relations; the way in which two or more things are related.","examples":[{"sentence":"The relationality between the two concepts is complex.","translation":"その2つの概念の関係性は複雑だ。"},{"sentence":"Her work explores the relationality of identity and place.","translation":"彼女の作品は、アイデンティティと場所の関係性を探求している。"},{"sentence":"Understanding the relationality of power dynamics is crucial for social change.","translation":"権力構造の関係性を理解することは、社会変革にとって重要だ。"}],"collocations":["social relationality (社会的な関係性)","human relationality (人間の関係性)","interpersonal relationality (対人関係性)","relationality of power (権力の関係性)","relationality of identity (アイデンティティの関係性)"],"synonyms":["relatedness","interconnectedness","interdependence","connection","relationship"],"antonyms":["isolation","separateness","independence"]}],"etymology":{"value":"\"Relational\" + \"-ity\". \"Relational\" comes from \"relation\" + \"-al\". \"Relation\" comes from Latin \"relatio\" (a bringing back, referring), from relatus, past participle of referre (to bring back, refer). The suffix \"-ity\" is used to form nouns expressing state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈleɪʃənælɪti/","syllables":"re-la-tion-al-i-ty"},"inflection":{"notes":"Noun, uncountable in most contexts."},"usage_notes":{"explanation":"\"Relationality\" refers to the quality or state of being relational, emphasizing the interconnectedness and interdependence of things. It is often used in academic and philosophical contexts to discuss the nature of relationships, particularly in fields like sociology, psychology, and philosophy. It highlights that entities are not isolated but exist in relation to others.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The relationality is important.","correct":"✓ Relationality is important.","note":"\"Relationality\" itself is often used as an abstract concept. Avoid using a definite article unless referring to a specific instance of relationality. "},{"incorrect":"✗ Relationality is when you have relations.","correct":"✓ Relationality refers to the quality or state of being relational, emphasizing interconnectedness and interdependence.","note":"\"Relationality\" is more than just having relations; it's about the nature and quality of those relationships and how things are interconnected."}],"priority":"★☆☆"},"related_words":{"derivatives":["relational (adjective)","relation (noun)","relate (verb)","relationship (noun)"],"phrases":["Relational ontology (関係論的実体論)","Relational ethics (関係性の倫理)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in academic and philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Relationality\" is a complex term often used in academic and philosophical discussions. It refers to the idea that things are defined by their relationships to other things, rather than existing in isolation. Understanding this term requires familiarity with abstract concepts and theoretical frameworks. It's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"Her research focuses on the relationality between humans and technology.","translation":"彼女の研究は、人間とテクノロジーの関係性に着目している。","type":"general","meaning_category":"relationship"},{"sentence":"The concept of relationality challenges traditional notions of individual autonomy.","translation":"関係性の概念は、個人の自律性という伝統的な概念に異議を唱えている。","type":"academic","meaning_category":"interconnectedness"},{"sentence":"Understanding the relationality of social structures is key to addressing inequality.","translation":"社会構造の関係性を理解することは、不平等に対処するための鍵となる。","type":"sociological","meaning_category":"social relationships"}]}