{"word":"Grundified","priority":"Low","meanings":[{"part_of_speech":"verb","definition":"To make something look or feel gritty, dirty, or run-down, often in an intentional or stylistic way.","english_definition":"To give something a gritty, dirty, or run-down appearance or feel, often intentionally for stylistic purposes.","examples":[{"sentence":"The artist grundified the painting by adding layers of dirt and grime.","translation":"アーティストは絵に汚れや煤を重ねて、絵を粗く汚れた感じにした。"},{"sentence":"The set designers grundified the stage to create a realistic depiction of a dilapidated urban environment.","translation":"舞台デザイナーは、荒廃した都市環境をリアルに描写するために、舞台を粗く汚れた感じにした。"}],"collocations":["grundify a painting","grundify a set","grundify an image"],"synonyms":["grungify","distress","weather","roughen"],"antonyms":["sanitize","clean","polish"]},{"part_of_speech":"adjective","definition":"Having a gritty, dirty, or run-down appearance or feel, often intentionally stylistic.","english_definition":"Having a gritty, dirty, or run-down appearance or feel, often intentionally for stylistic purposes.","examples":[{"sentence":"The film had a grundified aesthetic, reflecting the harsh realities of the story.","translation":"その映画は、物語の厳しい現実を反映して、粗く汚れた美学を持っていた。"},{"sentence":"The band's sound was intentionally grundified, with distorted guitars and raw vocals.","translation":"そのバンドのサウンドは、歪んだギターと生々しいボーカルで、意図的に粗く汚された感じにされていた。"}],"collocations":["grundified aesthetic","grundified sound","grundified look"],"synonyms":["grungy","distressed","weathered","roughened"],"antonyms":["clean","polished","pristine"]}],"etymology":{"value":"Derived from 'grunge,' a subgenre of alternative rock characterized by its dirty, distorted sound and associated with a disaffected, anti-establishment aesthetic. The suffix '-ify' turns it into a verb meaning 'to make something like grunge.'","priority":"Medium"},"pronunciation":{"ipa":"/ˈɡrʌndɪfaɪd/","syllables":"Grun-di-fied"},"inflection":{"verb_forms":{"present_simple":["grundify","grundifies"],"past_simple":"grundified","past_participle":"grundified","present_participle":"grundifying"},"adjective_forms":{"comparative":"more grundified","superlative":"most grundified"}},"usage_notes":{"explanation":"'Grundified' is often used in art, design, and music contexts to describe the process or state of making something appear rough, worn, or unpolished. It implies a deliberate choice to embrace imperfection and a rejection of conventional aesthetics.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ He grundified the clean room.","correct":"✓ He made the clean room look grundified.","note":"It's better to use 'made...look grundified' when describing the result of the action."}],"priority":"Low"},"related_words":{"derivatives":["grunge","grungy","grungify"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Grundified' is a niche word derived from 'grunge,' referring to a style that is intentionally gritty, dirty, or run-down. It's used to describe the process of making something appear this way or the state of being in this condition. This word is more likely to be encountered in discussions about art, music, or design aesthetics.","priority":"Low"},"example_sentences":[{"sentence":"The photographer grundified the portraits to give them a raw, emotional feel.","translation":"写真家は、ポートレートに粗く感情的な雰囲気を与えるために、ポートレートを粗く汚した感じにした。","type":"verb","meaning_category":"To make something look gritty"},{"sentence":"The band's grundified sound became their trademark.","translation":"そのバンドの粗く汚れたサウンドは、彼らのトレードマークとなった。","type":"adjective","meaning_category":"Having a gritty appearance"}]}