{"word":"ikhtiar","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にインドネシア語、マレー語)選択、自由意志、裁量、努力、手段","english_definition":"(Primarily Indonesian and Malay) choice, free will, discretion, effort, means.","examples":[{"sentence":"Dia menggunakan segala ikhtiar untuk mencapai tujuannya. (Indonesian)","translation":"He used all means to achieve his goal. (English) / 彼は目標を達成するためにあらゆる手段を使った。（日本語訳）"},{"sentence":"Itu adalah ikhtiar terakhir kami. (Indonesian)","translation":"That was our last resort. (English) / それは私たちの最後の手段だった。（日本語訳）"},{"sentence":"Setiap manusia diberi ikhtiar untuk menentukan jalan hidupnya. (Indonesian)","translation":"Every human is given the free will to determine their path in life. (English) / すべての人間は、自分の人生の道を決定する自由意志を与えられている。（日本語訳）"}],"collocations":["berikhtiar (to make an effort, to try)","usaha dan ikhtiar (effort and means)","dengan ikhtiar sendiri (by one's own efforts)"],"synonyms":["pilihan (choice)","kebebasan (freedom)","usaha (effort)","upaya (endeavor)","cara (way, method)","akal (trick, device)"],"antonyms":["keterpaksaan (compulsion)","kewajiban (obligation)"],"cultural_context":"This word is commonly used in Indonesian and Malay speaking regions, often carrying a connotation of personal agency and responsibility in making choices and striving towards a goal. It is often associated with religious and philosophical concepts of free will within an Islamic context.","register":"Formal","domain":"General, Religious/Philosophical"}],"etymology":{"value":"Derived from Arabic 'اخْتِيَار' (ʾikhtiyār), meaning 'choice, selection'. This reflects the historical influence of Arabic language and Islamic culture in the Malay Archipelago.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪxˈti.ar/","syllables":"ikh-ti-ar"},"inflection":{"notes":"This word does not inflect (change form) in Indonesian or Malay."},"usage_notes":{"explanation":"'Ikhtiar' emphasizes the active role of an individual in making choices and putting forth effort. It implies a sense of agency and responsibility. It is often used in contexts where one is trying to achieve something despite challenges or uncertainties. It can refer to both the act of choosing and the means or resources employed in pursuing a goal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"*Dia menggunakan ikhtiar untuk tidur.","correct":"Dia menggunakan cara untuk tidur.","note":"'Ikhtiar' is not typically used for simple actions like sleeping. It is used more for achieving goals or overcoming obstacles. Use 'cara' (way, method) instead."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_languages":[{"language":"Arabic","word":"اخْتِيَار (ʾikhtiyār)","translation":"choice, selection"}]},"level_frequency":{"frequency_corpus":"Moderate (in Indonesian and Malay corpora)","priority":"★☆☆"},"readability_explanation":{"level":"Intermediate","text":"'Ikhtiar' is a relatively common word in Indonesian and Malay, particularly in formal settings and discussions related to religion, philosophy, or personal development. Understanding its connection to the Arabic root 'اخْتِيَار' (ʾikhtiyār) can aid in grasping its meaning. It emphasizes the active role of a person in making choices and striving towards a goal."},"example_sentences":[{"sentence":"Kita harus berikhtiar sekuat tenaga untuk mencapai cita-cita. (Indonesian)","translation":"We must strive with all our might to achieve our aspirations. (English)","type":"general","meaning_category":"effort"},{"sentence":"Manusia memiliki ikhtiar dan takdir. (Indonesian)","translation":"Humans have free will and destiny. (English)","type":"religious/philosophical","meaning_category":"free will"},{"sentence":"Dia mencari ikhtiar untuk menyelesaikan masalah itu. (Indonesian)","translation":"He sought ways to solve the problem. (English)","type":"general","meaning_category":"means"}]}