{"word":"specularity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"正反射性、鏡面反射性","english_definition":"The quality of being specular; the degree to which a surface exhibits specular reflection (mirror-like reflection).","examples":[{"sentence":"The specularity of the polished metal surface gave it a mirror-like appearance.","translation":"研磨された金属表面の正反射性により、鏡のような外観になった。"},{"sentence":"Adjusting the specularity in the rendering software can create more realistic highlights.","translation":"レンダリングソフトウェアで正反射性を調整すると、よりリアルなハイライトを作成できる。"}],"collocations":["high specularity","low specularity","specularity map","specularity value","adjust specularity","control specularity"],"synonyms":["glossiness","reflectivity","shininess","luster","mirror-like reflection"],"antonyms":["diffuseness","matte finish","roughness"]},{"part_of_speech":"noun","definition":"(3Dグラフィックス) スペキュラ反射、鏡面反射","english_definition":"(In 3D graphics) The specular reflection of light from a surface, creating highlights.","examples":[{"sentence":"The artist added specularity to the eyes of the character to make them look more lifelike.","translation":"アーティストはキャラクターの目をより生き生きと見せるために、スペキュラ反射を追加した。"},{"sentence":"The specularity of the water surface changes depending on the angle of the light.","translation":"水面のスペキュラ反射は、光の角度によって変化する。"}],"collocations":["specular highlight","specular lighting","specular component","specular reflection","specular shader"],"synonyms":["specular reflection","highlight","glint"],"antonyms":["diffuse reflection","ambient lighting"]}],"etymology":{"value":"Derived from 'specular,' which comes from the Latin word 'speculum,' meaning 'mirror.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌspɛkjʊˈlærɪti/","syllables":"spec-u-lar-i-ty"},"inflection":{"noun_plural":"specularities"},"usage_notes":{"explanation":"'Specularity' refers to the degree to which a surface reflects light in a mirror-like fashion. In computer graphics, it is a parameter that controls the brightness and size of highlights on a 3D model. A high specularity value results in bright, focused highlights, while a low value results in softer, more diffuse highlights.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The specularity was very diffuse.","correct":"✓ The specularity was very low. / ✓ The surface had low specularity.","note":"Specularity and diffuseness are opposite qualities. High specularity means low diffuseness, and vice versa. Use 'low specularity' to indicate a diffuse reflection. "},{"incorrect":"✗ The model has a lot of specularities.","correct":"✓ The model has high specularity.","note":"While 'specularities' is the plural form, it's less common to refer to multiple instances of specularity. It's more common to say that something 'has high specularity' or 'exhibits specularity.'"}],"priority":"★★☆"},"related_words":{"derivatives":["specular (adjective)","specularly (adverb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in technical contexts (physics, computer graphics).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Specularity' is a technical term primarily used in physics and computer graphics. It describes how much a surface reflects light in a mirror-like way, creating highlights. A surface with high specularity produces sharp, bright highlights, while a surface with low specularity appears more matte or diffuse. This term is important for understanding how light interacts with surfaces and is often used when discussing rendering techniques in 3D graphics."},"example_sentences":[{"sentence":"The high **specularity** of the car's paint made it gleam in the sunlight.","translation":"車の塗装の高い正反射性により、太陽光の下で輝いていた。","type":"noun","meaning_category":"正反射性"},{"sentence":"Increasing the **specularity** in the material settings will make the object appear more shiny.","translation":"マテリアル設定でスペキュラ反射を増やすと、オブジェクトがより光沢があるように見える。","type":"noun","meaning_category":"(3Dグラフィックス) スペキュラ反射"}]}