{"word":"chemosensitive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"化学物質に敏感な、化学受容性のある","english_definition":"Sensitive to chemical stimuli; having the ability to detect and respond to chemical substances.","examples":[{"sentence":"Certain cells in the brain are chemosensitive to changes in blood pH.","translation":"脳内の特定の細胞は、血液pHの変化に化学的に敏感です。"},{"sentence":"The chemosensitive neurons in the carotid body monitor blood oxygen levels.","translation":"頸動脈小体の化学受容性ニューロンは、血中酸素レベルを監視します。"},{"sentence":"Chemosensitive materials are used in some types of sensors.","translation":"化学物質に敏感な材料は、一部のセンサーで使用されています。"}],"collocations":["chemosensitive cells (化学受容性細胞)","chemosensitive neurons (化学受容性ニューロン)","chemosensitive receptors (化学受容性受容体)","chemosensitive materials (化学受容性材料)","chemosensitive areas (化学受容性領域)"],"synonyms":["chemically sensitive","chemoreceptive"],"antonyms":["chemoresistant","chemically inert","insensitive"],"related_terms":["chemoreceptor","chemotherapy","chemosensitivity"]}],"etymology":{"value":"Derived from 'chemo-' (referring to chemicals) and 'sensitive' (easily affected or responsive).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkiːmoʊˈsɛnsɪtɪv/","syllables":"che-mo-sen-si-tive"},"inflection":{"notes":"Does not have different inflections as it is an adjective."},"usage_notes":{"explanation":"'Chemosensitive' is primarily used in scientific and medical contexts to describe cells, tissues, or materials that can detect and respond to specific chemical signals. It is often used in discussions of sensory biology, physiology, and the development of chemical sensors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The patient is chemosensitive to the treatment.","correct":"The patient is sensitive to the chemotherapy treatment.","note":"While 'chemosensitive' can be used in relation to chemotherapy, it's more common to say 'sensitive to chemotherapy' or 'responsive to chemotherapy' to indicate that the patient's cancer cells are affected by the treatment."}],"priority":"★☆☆"},"related_words":{"derivatives":["chemosensitivity (n.)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chemosensitive' is a technical term primarily used in biology, medicine, and chemistry. It describes something that is able to detect and react to chemical substances. Because of its specific usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The respiratory center in the brainstem contains chemosensitive neurons that regulate breathing.","translation":"脳幹の呼吸中枢には、呼吸を調節する化学受容性ニューロンが含まれています。","type":"scientific","meaning_category":"physiology"},{"sentence":"The new chemosensitive sensor can detect trace amounts of pollutants in water.","translation":"新しい化学受容性センサーは、水中の微量の汚染物質を検出できます。","type":"technical","meaning_category":"environmental science"},{"sentence":"Some cancer cells are more chemosensitive than others, which affects the success of chemotherapy.","translation":"一部の癌細胞は他の癌細胞よりも化学受容性が高く、化学療法の成功に影響を与えます。","type":"medical","meaning_category":"oncology"}]}