{"word":"olefins","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"オレフィン類（アルケン類）","english_definition":"A class of unsaturated hydrocarbons containing one or more carbon-carbon double bonds; also known as alkenes.","examples":[{"sentence":"Olefins are important building blocks in the petrochemical industry.","translation":"オレフィン類は石油化学産業において重要な構成要素です。"},{"sentence":"Ethylene and propylene are the most common olefins.","translation":"エチレンとプロピレンは最も一般的なオレフィン類です。"}],"collocations":["alpha olefins","cyclic olefins","linear alpha olefins"],"synonyms":["alkenes"],"antonyms":["alkanes"]}],"etymology":{"value":"Derived from 'olefiant gas,' an old name for ethylene, coined from Latin 'oleum' (oil) + 'facere' (to make) because ethylene reacts with chlorine to produce an oily liquid.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈoʊləfɪnz/","syllables":"o-le-fins"},"inflection":{"noun_plural":"olefins (already plural)"},"usage_notes":{"explanation":"'Olefins' is a collective term referring to alkenes, which are hydrocarbons characterized by the presence of at least one carbon-carbon double bond. The term is mainly used in the context of chemistry and the petrochemical industry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Olefin is used to produce plastics.","correct":"✓ Olefins are used to produce plastics.","note":"Since 'olefins' refers to a class of compounds, the plural form is generally used when discussing their applications or properties in general."}],"priority":"★★☆"},"related_words":{"derivatives":["olefin (singular form)","polyolefin (ポリ オレフィン)"],"related_compounds":["ethylene","propylene","butene","alpha-olefin"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency outside of technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'olefins' is a technical term primarily used in chemistry and related fields. It refers to a specific class of hydrocarbons containing carbon-carbon double bonds. Understanding this term is essential for those studying organic chemistry or working in the petrochemical industry."},"example_sentences":[{"sentence":"The cracking process converts alkanes into a mixture of olefins and other products.","translation":"分解プロセスはアルカンをオレフィン類と他の生成物の混合物に変換します。","type":"general","meaning_category":"chemical process"},{"sentence":"Olefins are used as monomers in the production of many common plastics.","translation":"オレフィン類は多くの一般的なプラスチックの製造におけるモノマーとして使用されます。","type":"application","meaning_category":"industrial use"}]}