{"word":"Subcompany","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"子会社","english_definition":"A company that is owned or controlled by another company, which is called the parent company or holding company.","examples":[{"sentence":"Our subcompany in Japan is doing very well.","translation":"日本にある当社の子会社は非常にうまくいっています。"},{"sentence":"The parent company has several subcompanies in different sectors.","translation":"親会社はさまざまな分野に複数の子会社を持っています。"},{"sentence":"The subcompany operates independently but follows the guidelines of the parent company.","translation":"子会社は独立して運営されていますが、親会社のガイドラインに従っています。"}],"collocations":["wholly-owned subcompany (完全子会社)","foreign subcompany (海外子会社)","establish a subcompany (子会社を設立する)","manage a subcompany (子会社を経営する)","acquire a subcompany (子会社を買収する)"],"synonyms":["subsidiary","affiliate","daughter company"],"antonyms":["parent company","holding company"]}],"etymology":{"value":"The word 'subcompany' is formed by combining the prefix 'sub-' (meaning under, below, or subordinate) with the word 'company'. It indicates a company that is subordinate to or controlled by another company.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌbˌkʌmpəni/","syllables":"sub-com-pa-ny"},"inflection":{"noun_plural":"Subcompanies"},"usage_notes":{"explanation":"'Subcompany' is a straightforward term used in business and finance to refer to a company that is owned or controlled by another, larger company. The term 'subsidiary' is often used interchangeably and is perhaps more common in formal contexts. Understanding the relationship between a parent company and its subcompanies is important for analyzing corporate structures and financial performance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The subcompany is own by the parent company.","correct":"✓ The subcompany is owned by the parent company.","note":"The correct passive form is 'is owned' not 'is own'."},{"incorrect":"✗ Subcompany's are important for expansion.","correct":"✓ Subcompanies are important for expansion.","note":"The plural of 'subcompany' is 'subcompanies'."},{"incorrect":"✗ The subcompany is depend from the main company.","correct":"✓ The subcompany is dependent on the main company.","note":"Use 'dependent on' instead of 'depend from'."}],"priority":"★★☆"},"related_words":{"derivatives":["subsidiary (noun/adjective)","parent company (noun)","holding company (noun)","affiliate (noun)","division (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in business contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'subcompany' is a business term. It means a company that is owned or controlled by another company, which is called the parent company. It is used in financial and business discussions. The term 'subsidiary' is a more formal and common synonym. Understanding this term is useful for reading financial reports and business news."},"example_sentences":[{"sentence":"The subcompany reported a significant increase in profits this quarter.","translation":"その子会社は今四半期に大幅な利益増加を報告しました。","type":"noun","meaning_category":"子会社"},{"sentence":"The parent company decided to merge two of its subcompanies.","translation":"親会社は2つの子会社を合併することを決定しました。","type":"noun","meaning_category":"子会社"},{"sentence":"The subcompany is responsible for all sales in the European market.","translation":"その子会社はヨーロッパ市場におけるすべての販売を担当しています。","type":"noun","meaning_category":"子会社"}]}