{"word":"antitropical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"反熱帯の、熱帯と反対の性質を持つ","english_definition":"relating to or characteristic of regions outside the tropics; having characteristics opposite to those of the tropics.","examples":[{"sentence":"Antitropical species are found in temperate regions.","translation":"反熱帯性の種は温帯地域で見られる。"},{"sentence":"The antitropical distribution of certain plants is a biogeographical puzzle.","translation":"特定の植物の反熱帯分布は生物地理学的な謎である。"}],"collocations":["antitropical distribution","antitropical species","antitropical pattern"],"synonyms":["temperate","non-tropical","subtropical"],"antonyms":["tropical"]},{"part_of_speech":"adjective","definition":"（気候が）熱帯と反対の性質を持つ","english_definition":"(of a climate) having characteristics opposite to those of the tropics, such as greater temperature variation and distinct seasons.","examples":[{"sentence":"The antitropical climate is characterized by hot summers and cold winters.","translation":"反熱帯気候は、暑い夏と寒い冬によって特徴づけられる。"}],"collocations":["antitropical climate","antitropical zone"],"synonyms":["temperate","seasonal"],"antonyms":["tropical"]}],"etymology":{"value":"\"anti-\" (反対) + \"tropical\" から構成される。熱帯の反対の性質を持つことを意味する。","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈtrɒpɪkəl/","syllables":"an-ti-trop-i-cal"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化があります（more antitropical, most antitropical）。"},"usage_notes":{"explanation":"\"antitropical\" は、主に生物学や気候学の分野で使用される専門用語です。熱帯地域とは異なる、温帯や亜寒帯地域の特徴を指す場合に使われます。日常会話ではほとんど使われません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city has an antitropical weather all year round.","correct":"✓ The city has a temperate climate.","note":"「antitropical」は気候のタイプを指す言葉であり、特定の日の天気を表すのには適していません。"},{"incorrect":"✗ Antitropical fruits grow in the Amazon rainforest.","correct":"✓ Tropical fruits grow in the Amazon rainforest.","note":"熱帯雨林は熱帯地域なので、熱帯の果物が育ちます。"}],"priority":"★★☆"},"related_words":{"derivatives":["antitropically (副詞)"],"related_terms":["tropical","temperate","subtropical","climate","biogeography","distribution"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Antitropical\" is a specialized term primarily used in scientific contexts, particularly in biology and climatology. It describes regions or characteristics that are the opposite of those found in the tropics. For example, an antitropical distribution pattern in biology refers to species that are found in temperate regions but not in the tropics. The term is not commonly used in everyday language. Understanding the prefix \"anti-\" (meaning opposite) and the term \"tropical\" is helpful in grasping the meaning of \"antitropical.\""},"example_sentences":[{"sentence":"The distribution of certain plant species shows an **antitropical** pattern, with populations in both northern and southern temperate zones but absent from the tropics.","translation":"特定の植物種の分布は、北部と南部の温帯地域に個体群が存在するが、熱帯地域には存在しないという反熱帯的なパターンを示している。","type":"adjective","meaning_category":"反熱帯の"},{"sentence":"**Antitropical** regions experience greater seasonal temperature variations compared to the relatively stable temperatures of the tropics.","translation":"反熱帯地域は、熱帯地域の比較的安定した気温と比較して、より大きな季節的な気温変動を経験する。","type":"adjective","meaning_category":"（気候が）熱帯と反対の性質を持つ"}]}