{"word":"alveolated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(生物学)有孔質の、蜂の巣状の、肺胞状の","english_definition":"Having small cavities or cells like a honeycomb; pitted with alveoli or small cavities.","examples":[{"sentence":"The bone structure was alveolated, making it lightweight.","translation":"骨の構造は有孔質で、軽量化されていた。"},{"sentence":"The surface of the coral was alveolated.","translation":"サンゴの表面は蜂の巣状だった。"}],"collocations":["alveolated bone","alveolated surface","alveolated structure"],"synonyms":["honeycombed","porous","cellular","pitted"],"antonyms":["solid","compact","dense"]}],"etymology":{"value":"Derived from the Latin word 'alveolus,' meaning 'small cavity' or 'cell.' The suffix '-ated' indicates the presence of or resemblance to alveoli.","priority":"★★☆"},"pronunciation":{"ipa":"/ælˈviːəleɪtɪd/","syllables":"al-ve-o-la-ted"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms, which are rare for this word.","comparative":"more alveolated","superlative":"most alveolated"},"usage_notes":{"explanation":"The term 'alveolated' is primarily used in scientific or technical contexts, particularly in biology, geology, and materials science, to describe structures with small cavities or cells resembling a honeycomb or the alveoli of the lungs. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The alveolated rock was smooth.","correct":"✓ The alveolated rock was rough due to its pitted surface.","note":"Alveolated surfaces are characterized by pits or cavities, so they are generally rough rather than smooth."}],"priority":"★☆☆"},"related_words":{"derivatives":["alveolus (noun: a small cavity, pit, or cell; e.g., an air sac in the lungs)","alveolar (adjective: relating to alveoli)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Alveolated' is a technical term primarily used in scientific fields like biology and geology. It describes a surface or structure that has numerous small cavities or pits, similar to a honeycomb or the alveoli in the lungs. Due to its specialized usage, it is not commonly encountered in general English. Understanding the term requires familiarity with scientific vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The alveolated structure of the pumice stone makes it lightweight and porous.","translation":"軽石の有孔質の構造は、軽量で多孔質である。","type":"general","meaning_category":"porous structure"},{"sentence":"Histological analysis revealed alveolated cells within the tissue sample.","translation":"組織学的分析により、組織サンプル内に肺胞状の細胞が明らかになった。","type":"biology","meaning_category":"biology"},{"sentence":"The alveolated surface of the catalyst increased its surface area for chemical reactions.","translation":"触媒の有孔質の表面は、化学反応のための表面積を増加させた。","type":"chemistry","meaning_category":"chemistry"}]}