{"word":"dependency-grammar-based","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Based on or relating to dependency grammar, a linguistic theory that analyzes sentence structure in terms of dependencies between words rather than phrase structure.","english_definition":"Relying on or structured according to the principles of dependency grammar, a linguistic framework where syntactic structure is defined by directed links between words.","examples":[{"sentence":"The system uses a dependency-grammar-based parser to analyze the sentence structure.","translation":"そのシステムは、文構造を解析するために依存文法に基づいたパーサーを使用しています。"},{"sentence":"A dependency-grammar-based approach can be effective for machine translation.","translation":"依存文法に基づいたアプローチは、機械翻訳に効果的です。"}],"collocations":["dependency-grammar-based parser","dependency-grammar-based approach","dependency-grammar-based system"],"synonyms":["dependency-based","dependency-oriented"],"antonyms":["phrase-structure-based","constituency-based"]}],"etymology":{"value":"Formed by combining 'dependency grammar' (a linguistic theory) with '-based' (meaning 'founded on' or 'using as a basis').","priority":"☆☆☆"},"pronunciation":{"ipa":"/dɪˈpɛndənsi ˌɡræmə ˌbeɪst/","syllables":"de-pen-den-cy-gram-mar-based"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'dependency-grammar-based' is used to describe tools, systems, or approaches that utilize the principles of dependency grammar in computational linguistics and natural language processing. It indicates that the system's analysis or operation is fundamentally structured around word-to-word dependencies rather than traditional phrase structures.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"dependency grammar based","correct":"dependency-grammar-based","note":"Hyphenation is important for clarity when using multiple words to form a compound adjective before a noun."}],"priority":"☆☆☆"},"related_words":{"derivatives":["dependency grammar","dependency parsing"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, primarily used in academic and technical contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'dependency-grammar-based' is a technical term used in linguistics and computer science. It describes something that uses dependency grammar, a way of analyzing the structure of sentences by looking at how words depend on each other, rather than grouping words into phrases. This term is primarily found in academic papers and technical documentation related to natural language processing."},"example_sentences":[{"sentence":"The research team developed a new dependency-grammar-based method for semantic role labeling.","translation":"研究チームは、意味役割ラベリングのための新しい依存文法に基づいた手法を開発しました。","type":"adjective","meaning_category":"Describing a method"},{"sentence":"Several state-of-the-art parsers are dependency-grammar-based.","translation":"いくつかの最先端のパーサーは依存文法に基づいています。","type":"adjective","meaning_category":"Describing a parser"}]}