{"word":"tremolite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"透閃石（とうせんせき）：角閃石グループに属する鉱物。変成岩中に産出し、白色または淡緑色で、繊維状または柱状の結晶をなす。一部は石綿（アスベスト）として利用される。","english_definition":"A mineral of the amphibole group, a hydrous magnesium calcium silicate. It is typically white to light green in color and forms fibrous or columnar crystals. Some varieties are used as asbestos.","examples":[{"sentence":"Tremolite is a common mineral found in metamorphic rocks.","translation":"透閃石は変成岩によく見られる鉱物です。"},{"sentence":"Some forms of tremolite are classified as asbestos.","translation":"透閃石の一部の形態は石綿として分類されます。"}],"collocations":["tremolite asbestos","fibrous tremolite","tremolite crystal"],"synonyms":["amphibole","asbestos (in some forms)"],"antonyms":[]}],"etymology":{"value":"由来は、スイスのサン・ゴッタルド峠にあるトレモラ（Tremola）渓谷で最初に発見されたことによる。","priority":"★★☆"},"pronunciation":{"ipa":"ˈtrɛməˌlaɪt","syllables":"trem-o-lite"},"inflection":{"noun_plural":"tremolites"},"usage_notes":{"explanation":"Tremolite is a mineral that can occur in both asbestiform and non-asbestiform habits. Asbestiform tremolite is regulated as asbestos due to its potential health hazards when inhaled. Non-asbestiform tremolite is not regulated as asbestos.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Tremolite is safe to inhale.","correct":"✓ Asbestiform tremolite is dangerous to inhale.","note":"Only asbestiform tremolite poses a health risk when inhaled."}],"priority":"★★☆"},"related_words":{"derivatives":["actinolite (緑閃石): 関連する鉱物で、鉄分を含む。"],"phrases":[]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Tremolite is a relatively uncommon mineral, and discussions about it often involve technical or scientific contexts. Understanding its properties and potential health risks requires some background knowledge in geology and mineralogy."},"example_sentences":[{"sentence":"The geologist identified the mineral sample as tremolite.","translation":"地質学者はその鉱物サンプルを透閃石と特定した。","type":"general","meaning_category":"identification"},{"sentence":"Exposure to tremolite asbestos can lead to serious health problems.","translation":"透閃石アスベストへの曝露は深刻な健康問題を引き起こす可能性がある。","type":"health","meaning_category":"health risks"}]}