{"word":"Josephinism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヨーゼフ主義（オーストリアの皇帝ヨーゼフ2世の宗教政策。国家が教会を統制する考え方）","english_definition":"The ecclesiastical policies of the Austrian Emperor Joseph II, advocating state control of the Church.","examples":[{"sentence":"Josephinism aimed to subordinate the Catholic Church to the state in the Austrian Empire.","translation":"ヨーゼフ主義は、オーストリア帝国においてカトリック教会を国家に従属させることを目的とした。"}],"collocations":["religious policy","state control","ecclesiastical reform"],"synonyms":["State Church system","Erastianism"],"antonyms":["Ultramontanism","Papal supremacy"]}],"etymology":{"value":"Named after Joseph II, Holy Roman Emperor and ruler of the Habsburg lands from 1765 to 1790.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒoʊzɪˈfɪnɪzəm/","syllables":"Jo-se-phin-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Josephinism refers specifically to the policies and principles enacted by Joseph II in the late 18th century. It is a form of Caesaropapism, where the state asserts authority over religious matters.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Josephinism is about separating church and state.","correct":"✓ Josephinism is about controlling the church by the state.","note":"Josephinism is not about separation, but about state control."}],"priority":"★★★"},"related_words":{"derivatives":["Josephinist (noun/adjective)"],"related_terms":["Gallicanism","Febronianism"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Josephinism is a historical term referring to a specific set of policies enacted by Emperor Joseph II of Austria. Understanding it requires knowledge of 18th-century European history and the relationship between church and state during that period."},"example_sentences":[{"sentence":"The reforms enacted under Josephinism significantly altered the relationship between the Austrian state and the Catholic Church.","translation":"ヨーゼフ主義の下で制定された改革は、オーストリア国家とカトリック教会の関係を大きく変えた。","type":"general","meaning_category":"historical context"},{"sentence":"Critics of Josephinism argued that it undermined the autonomy of the Church.","translation":"ヨーゼフ主義の批判者たちは、それが教会の自治を損なうと主張した。","type":"criticism","meaning_category":"criticism"}]}