{"word":"appealer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"控訴する人、上訴する人、訴える人、懇願する人","english_definition":"A person who makes an appeal; someone who asks for something earnestly; someone who makes a formal request to a higher authority for a reversal of a decision.","examples":[{"sentence":"He is an appealer of the court's decision.","translation":"彼は裁判所の決定に対して控訴する人です。"},{"sentence":"She is an appealer for donations to the charity.","translation":"彼女は慈善団体への寄付を訴える人です。"},{"sentence":"The appealer presented new evidence to the judge.","translation":"上訴人は裁判官に新しい証拠を提出しました。"}],"collocations":["tax appealer","environmental appealer","legal appealer"],"synonyms":["petitioner","supplicant","requester","applicant","claimant","challenger"],"antonyms":["defender","respondent","acceptor"]}],"etymology":{"value":"The word \"appealer\" is derived from the verb \"appeal,\" which comes from the Old French word \"apeler\" (to call upon, to appeal to), and ultimately from the Latin word \"appellare\" (to address, to call upon). The suffix \"-er\" is added to the verb \"appeal\" to form the noun \"appealer,\" indicating a person who performs the action of appealing.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈpiːlər/","syllables":"ap-peal-er"},"inflection":{"noun_plural":"appealers"},"usage_notes":{"explanation":"The term \"appealer\" generally refers to someone who makes an appeal, whether in a legal context (e.g., appealing a court decision) or in a more general sense (e.g., appealing to someone for help). The specific meaning can often be determined by the context in which the word is used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The appealer was appeal.","correct":"✓ The appealer made an appeal.","note":"\"Appealer\" is a noun, so it needs a verb to form a complete sentence. \"Appeal\" can be used as a verb in this context."},{"incorrect":"✗ She is a good appealer.","correct":"✓ She is a good advocate.","note":"While \"appealer\" is correct, \"advocate\" might be a more common and natural-sounding word in some contexts, especially when referring to someone who argues for a cause."}],"priority":"★☆☆"},"related_words":{"derivatives":["appeal (verb, noun)","appealing (adjective)","appealable (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"appealer\" is a relatively uncommon word that refers to someone who makes an appeal. It is most often used in legal or formal contexts. Because it is not a commonly used word, it is more likely to be understood by those with a higher level of English proficiency."},"example_sentences":[{"sentence":"The tax appealer successfully argued for a lower property assessment.","translation":"税務上訴人は、より低い資産評価を求めて主張し、成功しました。","type":"noun","meaning_category":"legal"},{"sentence":"As an appealer for the homeless, she organized several fundraising events.","translation":"ホームレスのために訴える人として、彼女はいくつかの資金調達イベントを企画しました。","type":"noun","meaning_category":"charity"},{"sentence":"The environmental appealer fought against the construction of the new factory.","translation":"環境保護を訴える人は、新しい工場の建設に反対しました。","type":"noun","meaning_category":"environmental"},{"sentence":"The appealer presented a strong case, but the judge upheld the original verdict.","translation":"上訴人は強力な事例を提示しましたが、裁判官は元の判決を支持しました。","type":"noun","meaning_category":"legal"},{"sentence":"He became a vocal appealer after witnessing the injustice.","translation":"彼は不正を目撃した後、声高に訴える人になりました。","type":"noun","meaning_category":"general"}],"japanese_readings":[{"type":"katakana","reading":"アピーラー"},{"type":"kanji","reading":"上訴人"},{"type":"kanji","reading":"控訴人"},{"type":"kanji","reading":"訴求者"}]}