{"word":"astringency","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"渋味、収斂性（しゅうれんせい）","english_definition":"the quality of being astringent; a sharp, puckering, or drying sensation in the mouth caused by tannins or other substances.","examples":[{"sentence":"The astringency of the wine was due to the high tannin content.","translation":"そのワインの渋味は、タンニン含有量が高いことに起因していた。"},{"sentence":"Some people enjoy the astringency of strong black tea.","translation":"強い紅茶の渋味を楽しむ人もいる。"},{"sentence":"The astringency of the unripe persimmon made it unpleasant to eat.","translation":"熟していない柿の渋味は、食べるのを不快にした。"}],"collocations":["high astringency (強い渋味)","low astringency (弱い渋味)","level of astringency (渋味のレベル)","cause astringency (渋味を引き起こす)","reduce astringency (渋味を軽減する)"],"synonyms":["tartness","puckering","dryness","bitterness (sometimes, depending on context)"],"antonyms":["sweetness","smoothness","mellowness"],"notes":"Astringency is often associated with tannins, which are found in foods like tea, wine, and some fruits. It causes a tightening or puckering sensation in the mouth."}],"etymology":{"value":"From the adjective 'astringent,' which comes from Latin 'astringens,' present participle of 'astringere' meaning 'to bind fast, contract.' This refers to the binding or contracting effect that astringent substances have on tissues.","priority":"★★★"},"pronunciation":{"ipa":"/əˈstrɪndʒənsi/","syllables":"a-strin-gen-cy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Astringency' specifically refers to the sensory experience of puckering or dryness in the mouth. It's a tactile sensation rather than a taste, although it's often described alongside tastes like bitterness or sourness. It's a key characteristic in describing wine, tea, and certain fruits.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The astringency was very sour.","correct":"The astringency was high, and it had a sour note.","note":"Astringency is a tactile sensation (puckering, dryness), not a taste like sourness. While astringent substances may also be sour, the astringency itself is not the sourness."}],"priority":"★★☆"},"related_words":{"derivatives":["astringent (adjective: causing contraction of body tissues, or tasting sharp and puckering; noun: an astringent substance)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. Used more in specialized contexts like food science, wine tasting, or dermatology.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Astringency' is a technical term used to describe a specific mouthfeel sensation. It's most commonly used in the context of food and beverages, particularly wine and tea. Understanding this word requires some knowledge of sensory science and vocabulary related to taste and texture."},"example_sentences":[{"sentence":"The **astringency** of the green tea cleansed the palate.","translation":"緑茶の渋味が口の中をさっぱりさせた。","type":"noun","meaning_category":"渋味"},{"sentence":"This skin toner is known for its **astringency**, which helps to tighten pores.","translation":"この化粧水は、毛穴を引き締める収斂性で知られている。","type":"noun","meaning_category":"収斂性"}]}