{"word":"Protagonism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"主人公意識、主役願望、自己中心的な行動","english_definition":"Behavior that is self-centered or attention-seeking; the tendency to see oneself as the main character in every situation.","examples":[{"sentence":"His constant protagonism made it difficult to work with him.","translation":"彼の絶え間ない主人公意識のせいで、彼と働くのは困難だった。"},{"sentence":"She accused him of protagonism for always trying to be the center of attention.","translation":"彼女は彼が常に注目を集めようとするため、主人公意識が強いと非難した。"},{"sentence":"The movie explores the dangers of unchecked protagonism.","translation":"その映画は、抑制されない主人公意識の危険性を探求している。"}],"collocations":["exhibit protagonism (主人公意識を示す)","accuse someone of protagonism (誰かを主人公意識が強いと非難する)","overcome protagonism (主人公意識を克服する)","protagonism in relationships (人間関係における主人公意識)","protagonism in the workplace (職場における主人公意識)"],"synonyms":["egocentrism","narcissism","self-centeredness","attention-seeking","histrionics"],"antonyms":["altruism","selflessness","humility","modesty"]}],"etymology":{"value":"Derived from 'protagonist,' the main character in a story, with the suffix '-ism' indicating a behavior, practice, or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈtæɡənɪzəm/","syllables":"pro-tag-o-nism"},"inflection":{"noun_plural":"protagonisms"},"usage_notes":{"explanation":"'Protagonism' refers to the tendency to behave as if one is the main character in every situation, often leading to self-centered or attention-seeking actions. It is generally used in a negative context to describe someone who is overly concerned with their own importance and role. The term is relatively uncommon and is more frequently encountered in psychological or sociological discussions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The protagonism of the hero saved the day.","correct":"✓ The hero's actions saved the day.","note":"'Protagonism' refers to a negative trait. Use 'heroism' or 'actions' to describe positive, heroic behavior."},{"incorrect":"✗ She has a lot of protagonism.","correct":"✓ She exhibits a lot of protagonism. / ✓ She is protagonistic.","note":"'Protagonism' is an uncountable noun. Use 'exhibits' or the adjective 'protagonistic' to describe someone who displays this trait."}],"priority":"★★☆"},"related_words":{"derivatives":["protagonist (主人公)","protagonistic (主人公意識の強い、自己中心的な)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Relatively uncommon word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Protagonism' is a relatively uncommon term that describes the tendency to behave as if one is the main character in every situation. It often implies self-centeredness and attention-seeking behavior. This word is more likely to be found in academic or psychological discussions rather than everyday conversation. Understanding the root word 'protagonist' (the main character) helps to grasp the meaning of 'protagonism' as the state or behavior of acting like a protagonist in real life."},"example_sentences":[{"sentence":"His protagonism was evident in every meeting as he always steered the conversation back to himself.","translation":"彼の主人公意識は、常に会話を自分自身に戻そうとするため、すべての会議で明らかだった。","type":"noun","meaning_category":"自己中心的な行動"},{"sentence":"The therapist worked with her to overcome her protagonism and develop more empathetic relationships.","translation":"セラピストは、彼女が主人公意識を克服し、より共感的な人間関係を築けるように支援した。","type":"noun","meaning_category":"自己中心的な行動"},{"sentence":"The novel satirizes the protagonism of modern celebrities.","translation":"その小説は、現代の有名人の主人公意識を風刺している。","type":"noun","meaning_category":"自己中心的な行動"}]}