{"word":"seismogram","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"地震記録、地震波形記録","english_definition":"a record produced by a seismograph, showing the ground motion at a specific location as a function of time.","examples":[{"sentence":"The seismogram showed a large spike during the earthquake.","translation":"地震記録には、地震発生時に大きなスパイクが見られた。"},{"sentence":"Scientists analyzed the seismogram to determine the earthquake's magnitude.","translation":"科学者たちは地震の規模を特定するために地震記録を分析した。"},{"sentence":"The seismogram provides valuable data about the Earth's interior.","translation":"地震記録は地球内部に関する貴重なデータを提供する。"}],"collocations":["analyze a seismogram (地震記録を分析する)","interpret a seismogram (地震記録を解釈する)","read a seismogram (地震記録を読む)","seismogram data (地震記録データ)","digital seismogram (デジタル地震記録)","historical seismogram (過去の地震記録)"],"synonyms":["seismic record","earthquake record","ground motion record","waveform record"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の 'seismos' (地震) + 'gramma' (記録) に由来。","priority":"★★★"},"pronunciation":{"ipa":"ˈsaɪzməˌɡræm/","syllables":"seis-mo-gram"},"inflection":{"noun_plural":"seismograms"},"usage_notes":{"explanation":"A seismogram is a visual representation of ground motion, typically recorded by a seismograph. It shows the amplitude and arrival times of seismic waves, which can be used to determine the location, magnitude, and depth of an earthquake. Seismograms are also used to study the Earth's internal structure and to monitor underground nuclear explosions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The seismograph is the seismogram.","correct":"✓ The seismograph produces the seismogram.","note":"A seismograph is the instrument that records ground motion, while the seismogram is the resulting record. They are related but distinct."},{"incorrect":"✗ Seismograms are only used for earthquakes.","correct":"✓ Seismograms can also be used to detect underground explosions.","note":"Seismograms have applications beyond earthquake monitoring, including detecting underground explosions and studying Earth's internal structure."}],"priority":"★★☆"},"related_words":{"derivatives":["seismograph (地震計)","seismology (地震学)","seismic (地震の)","seismologist (地震学者)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"中頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A seismogram is a record of ground motion produced by a seismograph. It's a technical term primarily used in the context of seismology and earthquake studies. Understanding seismograms requires knowledge of seismic waves and their properties. The term is unlikely to be encountered in everyday conversation but is common in scientific literature and news reports related to earthquakes."},"example_sentences":[{"sentence":"The seismogram clearly showed the arrival of both P-waves and S-waves.","translation":"地震記録には、P波とS波の両方の到着が明確に示されていた。","type":"general","meaning_category":"general"},{"sentence":"By comparing seismograms from different locations, scientists can pinpoint the epicenter of the earthquake.","translation":"科学者たちは異なる場所からの地震記録を比較することで、地震の震源地を特定できる。","type":"scientific","meaning_category":"scientific"},{"sentence":"The digital seismogram allowed for more precise analysis of the seismic event.","translation":"デジタル地震記録によって、地震現象のより正確な分析が可能になった。","type":"technical","meaning_category":"technical"}]}