{"word":"Beastishness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"獣性、野獣性、獣のような性質","english_definition":"The quality or state of being beastlike; brutal or savage behavior.","examples":[{"sentence":"His beastishness was evident in his violent actions.","translation":"彼の獣性は彼の暴力的な行動に明らかだった。"},{"sentence":"The novel explores the theme of beastishness in human nature.","translation":"その小説は人間の本性における獣性というテーマを探求している。"}],"collocations":["animalistic beastishness","brutal beastishness","inherent beastishness"],"synonyms":["brutality","savagery","animality","bestiality","ferocity"],"antonyms":["humanity","civility","gentleness","kindness"]}],"etymology":{"value":"Derived from 'beastish' (resembling a beast) + '-ness' (a suffix indicating a state or quality). 'Beastish' comes from 'beast' (an animal, especially a wild one) + '-ish' (having the characteristics of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbiːstɪʃnəs/","syllables":"beast-ish-ness"},"inflection":{"noun_plural":"beastishnesses (rarely used)"},"usage_notes":{"explanation":"'Beastishness' refers to the quality of resembling a beast, often in terms of behavior or nature. It implies a lack of reason, empathy, or moral restraint, and is often associated with violence, aggression, and savagery. The term is typically used in a figurative or metaphorical sense to describe human behavior that is considered base, uncivilized, or animalistic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed beastishness to his friends.","correct":"✓ He showed beastishness in his treatment of his friends.","note":"'Beastishness' is a quality or state, so it's better to use 'in' to describe where it is shown."}],"priority":"★☆☆"},"related_words":{"derivatives":["beast","beastly","beastlike","beastish"],"related_concepts":["bestiality (sexual relations between a person and an animal)","animalism (behavior that is primarily instinctive or animal-like)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Beastishness' is a relatively uncommon word that describes the quality of being like a beast, often in a negative way. It suggests a lack of human qualities such as reason, compassion, or morality, and is often associated with violence or savagery. The word is typically used in literary or philosophical contexts to explore the darker aspects of human nature. You might encounter it in discussions about the relationship between humans and animals, or in analyses of characters who exhibit cruel or barbaric behavior."},"example_sentences":[{"sentence":"The dictator's beastishness was evident in his ruthless treatment of political opponents.","translation":"その独裁者の獣性は、政敵に対する彼の冷酷な扱いには明らかだった。","type":"general","meaning_category":"獣性"},{"sentence":"The author used the concept of beastishness to explore the dark side of human nature.","translation":"著者は獣性の概念を使って、人間の本性の暗い側面を探求した。","type":"literary","meaning_category":"獣性"},{"sentence":"The tribe's ritualistic practices were often interpreted as a form of beastishness by outsiders.","translation":"その部族の儀式的な慣習は、部外者によってしばしば獣性の一形態として解釈された。","type":"cultural","meaning_category":"獣性"}]}