{"word":"Nootka","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ヌートカ族（カナダのバンクーバー島に住む先住民族）","english_definition":"A member of an indigenous people living on Vancouver Island in Canada.","examples":[{"sentence":"The Nootka people were skilled whalers.","translation":"ヌートカ族は熟練した捕鯨者でした。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ヌートカ語（ヌートカ族の言語）","english_definition":"The Wakashan language of the Nootka people.","examples":[{"sentence":"Nootka is a Wakashan language.","translation":"ヌートカ語はワクシ語族の言語です。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"ヌートカ族の、ヌートカ語の","english_definition":"Relating to the Nootka people or their language.","examples":[{"sentence":"Nootka art is known for its intricate carvings.","translation":"ヌートカ族の芸術は、その複雑な彫刻で知られています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Nootka Sound, a body of water on the west coast of Vancouver Island, British Columbia. The name 'Nootka' is believed to be a misinterpretation by Captain James Cook of a Nuu-chah-nulth phrase meaning 'go around'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnuːtkə/","syllables":"Noot-ka"},"inflection":{},"usage_notes":{"explanation":"'Nootka' can refer to the people, their language, or things related to them. It's important to consider the context to understand the intended meaning. The term is sometimes used interchangeably with 'Nuu-chah-nulth', although the latter is a broader term encompassing several related groups.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Nuu-chah-nulth (related indigenous group and language family)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'Nootka' refers to an indigenous people of Vancouver Island and their language. It is a term used in anthropology, history, and linguistics. The term is sometimes used interchangeably with 'Nuu-chah-nulth', although the latter is a broader term encompassing several related groups. Understanding the historical and cultural context is important when using this term."},"example_sentences":[{"sentence":"The Nootka tribe had a rich maritime culture.","translation":"ヌートカ族は豊かな海洋文化を持っていました。","type":"noun","meaning_category":"ヌートカ族"},{"sentence":"Efforts are being made to preserve the Nootka language.","translation":"ヌートカ語を保存するための努力がなされています。","type":"noun","meaning_category":"ヌートカ語"},{"sentence":"We studied Nootka history in our Canadian studies class.","translation":"私たちはカナダ研究の授業でヌートカ族の歴史を学びました。","type":"adjective","meaning_category":"ヌートカ族の"}]}