{"word":"pseudolunulae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"爪甲剥離症（爪が爪床から剥がれる状態）によって生じる、爪の根元に見られる白い半月状の領域に似た外観。","english_definition":"The appearance of white, half-moon shaped areas at the base of the nails, resembling lunulae, caused by onycholysis (separation of the nail from the nail bed).","examples":[{"sentence":"The patient presented with pseudolunulae on several fingernails due to a fungal infection causing onycholysis.","translation":"患者は、爪甲剥離症を引き起こしている真菌感染症により、いくつかの指の爪に偽爪半月が現れていました。"},{"sentence":"Pseudolunulae can be a sign of various underlying conditions affecting the nails.","translation":"偽爪半月は、爪に影響を与えるさまざまな基礎疾患の兆候である可能性があります。"}],"collocations":["develop pseudolunulae","observe pseudolunulae","presence of pseudolunulae","caused by onycholysis","associated with nail disorders"],"synonyms":["apparent lunula","false lunula"],"antonyms":[]}],"etymology":{"value":"\"pseudo-\" (偽の) + \"lunulae\" (lunula の複数形)。lunula はラテン語で「小さな月」を意味し、爪の根元にある半月形の白い部分を指します。したがって、pseudolunulae は「偽の lunula」を意味します。","priority":"★★★"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈljuːnjʊliː/","syllables":"pseu-do-lu-nu-lae"},"inflection":{"noun_plural":"pseudolunulae"},"usage_notes":{"explanation":"Pseudolunulae are not true lunulae but rather an optical illusion created by the separation of the nail plate from the nail bed. They appear whiter than the rest of the nail due to the air space beneath the nail. The presence of pseudolunulae can be associated with various conditions, including trauma, infection, and certain systemic diseases.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor diagnosed true lunula instead of pseudolunulae.","correct":"✓ The doctor diagnosed pseudolunulae, not true lunulae.","note":"It is important to distinguish between true lunulae and pseudolunulae for accurate diagnosis."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudo- (接頭辞: 偽の)","lunula (名詞: 爪半月)","onycholysis (名詞: 爪甲剥離症)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Pseudolunulae\" is a specialized medical term referring to the appearance of white, half-moon shapes at the base of the nails, resembling lunulae, but caused by the separation of the nail from the nail bed (onycholysis). It's important to note that these are not true lunulae and can be a sign of underlying nail conditions or systemic diseases. This term is primarily used within medical contexts and may not be commonly understood by the general public."},"example_sentences":[{"sentence":"The presence of **pseudolunulae** raised suspicion of a fungal nail infection.","translation":"偽爪半月の存在は、爪の真菌感染症の疑いを引き起こしました。","type":"noun","meaning_category":"医学的兆候"},{"sentence":"Distinguishing between true lunulae and **pseudolunulae** is crucial for accurate diagnosis.","translation":"真の爪半月と偽爪半月を区別することは、正確な診断のために重要です。","type":"noun","meaning_category":"医学的診断"}]}