{"word":"perimetry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"視野測定（法）","english_definition":"The systematic measurement of the field of vision.","examples":[{"sentence":"Perimetry is used to detect visual field defects.","translation":"視野測定は、視野欠損を検出するために用いられる。"},{"sentence":"Automated perimetry provides a detailed map of the visual field.","translation":"自動視野測定は、視野の詳細な地図を提供する。"}],"collocations":["visual field perimetry","automated perimetry","static perimetry","kinetic perimetry"],"synonyms":["visual field testing","campimetry"],"antonyms":[]}],"etymology":{"value":"From 'peri-' (around) + '-metry' (measurement).","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈrɪmɪtri/","syllables":"pe-rim-e-try"},"inflection":{"noun_plural":"perimetries"},"usage_notes":{"explanation":"Perimetry is a diagnostic test used in ophthalmology and neurology to assess the extent of a person's visual field. It helps detect blind spots (scotomas) and other visual field defects, which can be indicative of various eye diseases (e.g., glaucoma, retinitis pigmentosa) or neurological conditions (e.g., stroke, brain tumor).","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["perimeter (外周)","perimetric (視野測定の)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"Perimetry is a specialized term used in the medical field, specifically in ophthalmology and neurology. It refers to the systematic measurement of the visual field, which is the area that a person can see when looking straight ahead. This test is crucial for diagnosing and monitoring various eye and neurological conditions that can affect vision. Understanding this term is important for those in healthcare professions or individuals undergoing visual field testing."},"example_sentences":[{"sentence":"The doctor recommended perimetry to check for glaucoma.","translation":"医師は緑内障の検査のために視野測定を勧めた。","type":"general","meaning_category":"視野測定"},{"sentence":"Changes in perimetry results can indicate disease progression.","translation":"視野測定の結果の変化は、病気の進行を示す可能性がある。","type":"medical","meaning_category":"視野測定"}]}