{"word":"Membracine","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"膜翅亜目に属する昆虫（特にツノゼミ）に関連する、またはそれらに特有の","english_definition":"Relating to, or characteristic of, insects of the suborder Membracoidea (formerly Membracina), especially treehoppers.","examples":[{"sentence":"Membracine insects are known for their elaborate and often bizarre pronotal structures.","translation":"膜翅亜目の昆虫は、精巧でしばしば奇妙な前胸背板の構造で知られています。"},{"sentence":"The membracine fauna of the Amazon rainforest is incredibly diverse.","translation":"アマゾン熱帯雨林の膜翅亜目の動物相は信じられないほど多様です。"}],"collocations":["membracine insect","membracine fauna","membracine morphology"],"synonyms":["membracoid"],"antonyms":[]}],"etymology":{"value":"Derived from the taxonomic name Membracidae (now Membracoidea), the family of treehoppers, itself derived from Latin 'membrana' (membrane) referring to the wing structure.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɛmbrəˌsaɪn/","syllables":"Mem-bra-cine"},"inflection":{"notes":"This is an adjective and does not have plural forms."},"usage_notes":{"explanation":"'Membracine' is a technical term used primarily in entomology to describe features or characteristics associated with treehoppers and related insects within the suborder Membracoidea. It is most often encountered in scientific literature or specialized discussions about insect morphology, taxonomy, or ecology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The membracine is a beautiful insect.","correct":"✓ The membracine insect is a beautiful insect.","note":"'Membracine' is an adjective, so it needs to be followed by a noun (e.g., insect, structure, characteristic)."},{"incorrect":"✗ Membracines are found all over the world.","correct":"✓ Membracoid insects are found all over the world.","note":"'Membracines' is not a standard plural form. Use 'membracoid insects' or specify the group of insects (e.g., treehoppers)."}],"priority":"★★☆"},"related_words":{"derivatives":["Membracoidea (suborder name)","Membracidae (former family name)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Technical term, not in standard CEFR vocabulary)","frequency_google_ngram":"Very low frequency. Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Membracine' is a highly specialized term used in entomology. Understanding its meaning requires familiarity with insect taxonomy and morphology. It is unlikely to be encountered outside of scientific or technical contexts. The term refers to characteristics or features associated with insects of the suborder Membracoidea, particularly treehoppers.","priority":"★☆☆"},"example_sentences":[{"sentence":"The membracine wing venation patterns are a key characteristic used in taxonomic classification.","translation":"膜翅亜目の翅脈パターンは、分類学的な分類に使用される重要な特徴です。","type":"adjective","meaning_category":"Relating to Membracoidea"},{"sentence":"Studies of membracine communication signals have revealed complex vibrational behaviors.","translation":"膜翅亜目のコミュニケーション信号の研究により、複雑な振動行動が明らかになりました。","type":"adjective","meaning_category":"Relating to Membracoidea"}]}