{"word":"expansionists","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"拡張主義者、領土拡張主義者","english_definition":"Advocates or supporters of territorial or economic expansion.","examples":[{"sentence":"The expansionists in the government pushed for war.","translation":"政府内の拡張主義者たちは戦争を推し進めた。"},{"sentence":"Critics accused the company of being expansionists, seeking to dominate the market.","translation":"批評家たちは、その会社が市場を支配しようとする拡張主義者だと非難した。"}],"collocations":["territorial expansionists (領土拡張主義者)","economic expansionists (経済拡張主義者)","political expansionists (政治拡張主義者)"],"synonyms":["imperialists","annexationists","interventionists","aggrandizers"],"antonyms":["isolationists","pacifists","non-interventionists"]}],"etymology":{"value":"The word 'expansionist' is derived from 'expansion,' which comes from the Latin word 'expandere,' meaning 'to spread out.' The suffix '-ist' denotes a person who advocates or practices a specified belief or system. Therefore, 'expansionist' refers to someone who supports the policy of expanding a country's territory or economic influence.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˈspænʃənɪsts/","syllables":"ex-pan-sion-ists"},"inflection":{"noun_plural":"expansionists"},"usage_notes":{"explanation":"'Expansionists' typically refers to individuals or groups who actively promote the growth of a nation's territory, influence, or economy, often through aggressive or assertive means. The term is often used in political and historical contexts to describe those who support policies of territorial annexation or economic domination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The expansionist policy was supported by many citizens.","correct":"✓ The expansionist policy was supported by many citizens.","note":"'Expansionist' is an adjective describing the policy, while 'expansionists' (plural) are the people who support it."}],"priority":"★★☆"},"related_words":{"derivatives":["expansionism (名詞: 拡張主義)","expansionist (形容詞: 拡張主義の)","expand (動詞: 拡大する)","expansion (名詞: 拡大)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"比較的中頻度 (Relatively moderate frequency) - 政治学や歴史学の文脈でよく使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Expansionists' refers to people who believe in expanding a country's territory or influence, often through political or military action. This word is often used in discussions about history, politics, and international relations. It's important to understand the context in which it's used, as it can carry negative connotations when describing aggressive or imperialistic policies."},"example_sentences":[{"sentence":"The expansionists believed that acquiring new territories would benefit the nation's economy.","translation":"拡張主義者たちは、新たな領土を獲得することが国家経済に利益をもたらすと信じていた。","type":"noun","meaning_category":"領土拡張主義者"},{"sentence":"The expansionists in the company aimed to dominate the global market.","translation":"その会社の拡張主義者たちは、グローバル市場を支配することを目指していた。","type":"noun","meaning_category":"経済拡張主義者"}]}