{"word":"antisophistry","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"詭弁に対する反対、詭弁を排撃する論法","english_definition":"Opposition to or arguments against sophistry; the use of sound reasoning to refute fallacious arguments.","examples":[{"sentence":"His lecture was an exercise in antisophistry, carefully dismantling the flawed logic of his opponents.","translation":"彼の講義は反詭弁の実践であり、対立者の誤った論理を注意深く解体していた。"},{"sentence":"The philosopher's writings are filled with examples of antisophistry, demonstrating how to identify and counter deceptive reasoning.","translation":"その哲学者の著作は反詭弁の例に満ちており、欺瞞的な推論を特定し、対抗する方法を示している。"}],"collocations":["arguments of antisophistry","exercise in antisophistry","examples of antisophistry"],"synonyms":["logical reasoning","sound argumentation","critical analysis","fallacy detection","refutation of sophistry"],"antonyms":["sophistry","fallacious reasoning","deceptive argumentation","specious logic"]}],"etymology":{"value":"\"Anti-\" (反対) + \"sophistry\" (詭弁) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈsɒfɪstri/","syllables":"an-ti-soph-is-try"},"inflection":{"noun_plural":"antisophistries"},"usage_notes":{"explanation":"\"Antisophistry\" は、詭弁（sophistry）に対する反対や、詭弁を論破するための健全な論理の使用を指します。詭弁とは、一見もっともらしく見えるが、実際には誤った推論や欺瞞的な議論のことです。したがって、antisophistry は、批判的思考、論理的分析、および健全な推論を用いて、そのような誤った議論を暴き、反論する行為または技術を意味します。学術的な文脈や、論理的な議論が重要な場面で用いられることが多いです。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced antisophistry by ignoring the opposing arguments.","correct":"✓ He practiced antisophistry by carefully dismantling the opposing arguments.","note":"Antisophistry は、単に反対するだけでなく、論理的に反論することを意味します。"},{"incorrect":"✗ Antisophistry is the same as being stubborn.","correct":"✓ Antisophistry involves using logical reasoning to counter deceptive arguments, unlike stubbornness, which is simply refusing to change one's opinion.","note":"Antisophistry は、頑固さとは異なり、論理的な根拠に基づいた反論を伴います。"}],"priority":"★☆☆"},"related_words":{"derivatives":["antisophist (名詞: 詭弁に反対する人)"],"related_terms":["sophistry","fallacy","logic","rhetoric","argumentation","critical thinking"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Antisophistry\" means to argue against tricky or misleading arguments (called sophistry) by using clear and logical thinking. It's about spotting when someone is using clever but wrong reasoning and showing why their argument doesn't make sense. This word is not commonly used and is more often found in discussions about philosophy or debate.","priority":"★☆☆"},"example_sentences":[{"sentence":"The lawyer employed antisophistry to expose the weaknesses in the witness's testimony.","translation":"弁護士は反詭弁を用いて、証人の証言の弱点を暴いた。","type":"noun","meaning_category":"詭弁に対する反対"},{"sentence":"A key element of critical thinking is the ability to engage in antisophistry.","translation":"批判的思考の重要な要素は、反詭弁を行う能力である。","type":"noun","meaning_category":"詭弁を排撃する論法"}]}