{"word":"Aryanizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"アーリア化する、アーリア人化する（ナチス・ドイツにおいて、ユダヤ人などの財産や企業を没収し、アーリア人の手に移すこと）","english_definition":"To subject to Aryanization; specifically, in Nazi Germany, to transfer property or businesses from Jewish to non-Jewish (Aryan) ownership.","examples":[{"sentence":"The Nazi regime systematically Aryanized Jewish businesses throughout Germany.","translation":"ナチス政権はドイツ全土でユダヤ人の企業を組織的にアーリア化した。"},{"sentence":"Many Jewish families were forced to sell their homes and businesses as part of the Aryanizing process.","translation":"多くのユダヤ人家族は、アーリア化の過程の一環として、家や事業を売却することを余儀なくされた。"}],"collocations":["Aryanize a business (企業をアーリア化する)","Aryanize property (財産をアーリア化する)"],"synonyms":["expropriate","confiscate","transfer (ownership)"],"antonyms":[]}],"etymology":{"value":"「Aryanize」は、「Aryan」（アーリア人）に動詞化接尾辞「-ize」が付いたもの。ナチス・ドイツにおいて、ユダヤ人などの財産や企業を没収し、アーリア人の手に移す政策を指すために用いられた。","priority":"★★★"},"pronunciation":{"ipa":"/ˈɛəriənaɪzɪŋ/","syllables":"Ar-i-an-iz-ing"},"inflection":{"verb_forms":{"present_simple":["Aryanize","Aryanizes"],"past_simple":"Aryanized","past_participle":"Aryanized","present_participle":"Aryanizing"}},"usage_notes":{"explanation":"「**Aryanizing**」は、歴史的な文脈、特にナチス・ドイツの時代におけるユダヤ人迫害に関連して使用される言葉です。この言葉は、ユダヤ人やその他の「非アーリア人」と見なされた人々の財産、企業、その他の資産を強制的に没収し、アーリア人（ナチスの人種イデオロギーにおける理想的な人種）の手に移す行為を指します。現代では、この言葉は、歴史的な文脈での使用に限定されるべきであり、人種差別や不当な差別を想起させるため、注意して使用する必要があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is Aryanizing its workforce by hiring only white employees.","correct":"✓ The company is discriminating against minority employees.","note":"「Aryanizing」は特定の歴史的文脈（ナチス・ドイツ）で使用される言葉であり、現代の人種差別的な行為を指す場合には、より一般的な「discriminating」などの言葉を使用する方が適切です。"},{"incorrect":"✗ The government is Aryanizing the country's culture.","correct":"✓ The government is promoting a specific cultural identity.","note":"文化的な均質化を指す場合、「Aryanizing」は不適切です。より正確な言葉を使用する必要があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["Aryanization (名詞: アーリア化)","Aryan (名詞/形容詞: アーリア人/アーリアの)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 特定の歴史的文脈でのみ使用される。","priority":"★★☆"},"readability_explanation":{"level":"C2","text":"「**Aryanizing**」は、ナチス・ドイツの時代に、ユダヤ人やその他の「非アーリア人」と見なされた人々の財産や企業を強制的に没収し、アーリア人の手に移す行為を指す歴史的な言葉です。この言葉は、現代ではほとんど使用されず、特定の歴史的な文脈でのみ使用されます。人種差別や不当な差別を想起させるため、使用には注意が必要です。"},"example_sentences":[{"sentence":"The museum exhibit detailed the process of Aryanizing Jewish-owned businesses in Berlin during the 1930s.","translation":"博物館の展示では、1930年代のベルリンにおけるユダヤ人所有の企業のアーリア化の過程が詳細に説明されていた。","type":"verb","meaning_category":"アーリア化する"},{"sentence":"The documents revealed the extent to which the government was involved in Aryanizing private property.","translation":"その文書は、政府が私有財産のアーリア化にどの程度関与していたかを明らかにした。","type":"verb","meaning_category":"アーリア化する"}]}