{"word":"hematherapy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"血液療法（自己または他者の血液を投与して治療する方法）","english_definition":"The therapeutic use of blood or blood products, either from oneself (autologous) or from another person (allogeneic).","examples":[{"sentence":"Hematherapy was used in the early 20th century to treat various conditions, but its effectiveness is not well-supported by modern research.","translation":"血液療法は20世紀初頭に様々な症状の治療に用いられたが、その有効性は現代の研究では十分に支持されていない。"},{"sentence":"Autologous hematherapy involves reinfusing a patient's own blood after it has been treated or processed.","translation":"自己血液療法は、患者自身の血液を処理または加工した後に再輸血することを伴う。"}],"collocations":["autologous hematherapy (自己血液療法)","allogeneic hematherapy (同種血液療法)"],"synonyms":["blood therapy","blood transfusion"],"antonyms":[]}],"etymology":{"value":"「hema-」（血液を意味する接頭辞、ギリシャ語の「haima」に由来）と「therapy」（治療）の組み合わせ。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːməˈθɛrəpi/","syllables":"he-ma-the-ra-py"},"inflection":{"noun_plural":"hematherapies"},"usage_notes":{"explanation":"Hematherapy is a general term encompassing various therapeutic uses of blood. It is sometimes used interchangeably with blood transfusion, although the latter usually refers to the direct transfer of blood from one person to another. Autologous hematherapy involves using a patient's own blood, while allogeneic hematherapy involves using blood from a donor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hematherapy is a type of surgery.","correct":"✓ Hematherapy is a type of medical treatment involving blood.","note":"Hematherapy involves the use of blood, not surgical procedures. It is a form of medical treatment or therapy. "},{"incorrect":"✗ Hematherapy is always safe and effective.","correct":"✓ The safety and effectiveness of hematherapy depend on the specific procedure and the patient's condition.","note":"Like any medical treatment, hematherapy carries potential risks and benefits that should be carefully evaluated. Its effectiveness varies depending on the specific application and the patient's health. "}],"priority":"★★☆"},"related_words":{"derivatives":["hema- (接頭辞: 血液)","-therapy (接尾辞: 治療)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 医学・専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Hematherapy**」は、血液または血液製剤を治療に用いることを指す専門用語です。自己血液（患者自身の血液）または同種血液（他者からの血液）を使用する場合があります。この用語は、血液療法全般を指す広い意味を持ちますが、具体的な治療法や状況によって意味合いが異なることがあります。医学や生物学の分野で用いられることが多く、一般的には馴染みの薄い言葉です。"},"example_sentences":[{"sentence":"The patient underwent autologous **hematherapy** to boost their immune system.","translation":"患者は免疫システムを強化するために自己血液療法を受けた。","type":"noun","meaning_category":"治療法"},{"sentence":"**Hematherapy** was considered as a potential treatment option for the rare blood disorder.","translation":"血液療法は、そのまれな血液疾患の潜在的な治療選択肢として検討された。","type":"noun","meaning_category":"治療法"}]}