{"word":"Fructoses","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"フルクトース（果糖）の複数形","english_definition":"plural of fructose; a simple sugar found in many plants, where it is often bonded to glucose to form the disaccharide sucrose.","examples":[{"sentence":"Fructoses are found in honey, tree and vine fruits, flowers, berries, and most root vegetables.","translation":"フルクトースは蜂蜜、木や蔓の果物、花、ベリー、そしてほとんどの根菜に含まれています。"}],"collocations":["high-fructose corn syrup","fructose malabsorption"],"synonyms":["fruit sugar","levulose"],"antonyms":[]}],"etymology":{"value":"The word \"fructose\" is derived from the Latin word fructus meaning fruit and the suffix -ose denoting a sugar.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfrʌktoʊsiːz/","syllables":"fruck-to-sees"},"inflection":{"noun_plural":"Fructoses"},"usage_notes":{"explanation":"\"Fructoses\" is simply the plural form of \"fructose.\" Fructose is a monosaccharide, a simple sugar, also known as fruit sugar. It's commonly found in fruits, honey, and high-fructose corn syrup.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I eat fructoses because it's healthy.","correct":"✓ I eat fruit containing fructose because it's healthy.","note":"Use 'fructose' (singular, uncountable) when referring to the sugar in general. 'Fructoses' is used when referring to different types or multiple instances of fructose."}],"priority":"★★☆"},"related_words":{"derivatives":["fructose","high-fructose corn syrup","fructolysis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Fructoses\" is the plural form of \"fructose,\" a type of sugar naturally present in fruits and honey. While \"fructose\" is a common term, the plural form \"fructoses\" is less frequently used, typically appearing in scientific or technical contexts when discussing different forms or multiple instances of the sugar. It's important to understand that in most everyday situations, the singular form \"fructose\" is sufficient."},"example_sentences":[{"sentence":"Different types of fructoses may have varying effects on the body.","translation":"異なる種類のフルクトースは、体にさまざまな影響を与える可能性があります。","type":"noun","meaning_category":"plural of fructose"},{"sentence":"The study analyzed the concentrations of fructoses in various fruits.","translation":"その研究では、さまざまな果物中のフルクトース濃度を分析しました。","type":"noun","meaning_category":"plural of fructose"}]}