{"word":"intuitionism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"直観主義、直覚主義","english_definition":"(philosophy) the theory that primary truths and principles (especially of ethics and metaphysics) are known by intuition.","examples":[{"sentence":"Intuitionism in ethics holds that moral truths are self-evident.","translation":"倫理学における直観主義は、道徳的真実は自明であると主張する。"},{"sentence":"Some philosophers criticize intuitionism for lacking a clear method of justification.","translation":"一部の哲学者は、直観主義が明確な正当化の方法を欠いていると批判する。"}],"collocations":["ethical intuitionism (倫理的直観主義)","mathematical intuitionism (数学的直観主義)"],"synonyms":["rationalism","empiricism"],"antonyms":["skepticism","relativism"]},{"part_of_speech":"noun","definition":"(数学) 直観主義数学","english_definition":"(mathematics) a philosophical approach to mathematics that requires every mathematical entity to be a construction in the mind of the mathematician.","examples":[{"sentence":"Intuitionism rejects the law of excluded middle in mathematics.","translation":"直観主義は数学における排中律を否定する。"},{"sentence":"Brouwer was a key figure in the development of intuitionism in mathematics.","translation":"ブラウワーは数学における直観主義の発展における重要な人物であった。"}],"collocations":["Brouwer's intuitionism (ブラウワーの直観主義)","constructive mathematics (構成的数学)"],"synonyms":["constructivism"],"antonyms":["classical mathematics"]}],"etymology":{"value":"From 'intuition' + '-ism'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntjuˈɪʃənɪzəm/","syllables":"in-tu-i-tion-ism"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"'Intuitionism' refers to a philosophical or mathematical approach that emphasizes the role of intuition in acquiring knowledge or constructing mathematical entities. In ethics, it suggests that moral truths are known directly through intuition. In mathematics, it is a constructivist approach that requires mathematical objects to be mentally constructed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a intuitionist.","correct":"✓ He is an intuitionist.","note":"Use 'an' before 'intuitionist' because it starts with a vowel sound."},{"incorrect":"✗ Intuitionism is about feeling, not thinking.","correct":"✓ Intuitionism is about a specific kind of direct knowledge, not just feeling.","note":"Intuitionism is not simply about feelings; it's about a specific philosophical claim about how we gain certain kinds of knowledge."}],"priority":"★★☆"},"related_words":{"derivatives":["intuition (直観)","intuitionist (直観主義者)","intuitionistic (直観主義的な)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Intuitionism' is a philosophical term referring to the belief that certain truths, especially in ethics and mathematics, are known through intuition rather than through empirical evidence or logical deduction. It is a complex concept often discussed in philosophy and advanced mathematics courses.","priority":"★★☆"},"example_sentences":[{"sentence":"Ethical intuitionism suggests that we have a direct, intuitive awareness of moral facts.","translation":"倫理的直観主義は、私たちが道徳的事実を直接的かつ直観的に認識していることを示唆する。","type":"noun","meaning_category":"philosophy"},{"sentence":"Intuitionism in mathematics requires every mathematical object to be constructed in the mind.","translation":"数学における直観主義は、すべての数学的対象が心の中で構築されることを要求する。","type":"noun","meaning_category":"mathematics"}]}