{"word":"Opticians","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"眼鏡技師、眼鏡店","english_definition":"A person qualified to prescribe and dispense glasses and contact lenses, and to detect eye diseases. Also, a shop selling eyeglasses and contact lenses.","examples":[{"sentence":"I need to visit the opticians to get my eyes tested.","translation":"目の検査を受けるために眼鏡店に行かなければなりません。"},{"sentence":"The opticians recommended new lenses for my glasses.","translation":"眼鏡店で眼鏡の新しいレンズを勧められました。"},{"sentence":"She works as an optician in a local store.","translation":"彼女は地元の店で眼鏡技師として働いています。"}],"collocations":["visit the opticians (眼鏡店に行く)","qualified optician (資格のある眼鏡技師)","local opticians (地元の眼鏡店)","high street opticians (商店街の眼鏡店)","independent opticians (独立系の眼鏡店)"],"synonyms":["eyeglass fitter","lens crafter","eye care professional"],"antonyms":[]}],"etymology":{"value":"The word \"optician\" comes from the word \"optic\", which is derived from the Greek word \"optikos\", meaning \"of or pertaining to sight\".","priority":"★★☆"},"pronunciation":{"ipa":"/ɒpˈtɪʃənz/","syllables":"op-ti-cianz"},"inflection":{"noun_plural":"Opticians"},"usage_notes":{"explanation":"\"Opticians\" refers to either the professionals who are qualified to examine eyes, prescribe corrective lenses, and fit eyeglasses and contact lenses, or the shops where these services and products are available. In some regions, the term may also include the detection of eye diseases, although this is more commonly associated with optometrists or ophthalmologists.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the optician shop.","correct":"✓ I went to the optician's shop. / ✓ I went to the opticians.","note":"When referring to the shop, it is common to say \"optician's shop\" or simply \"the opticians\"."},{"incorrect":"✗ Opticians are doctors.","correct":"✓ Opticians are not doctors.","note":"Opticians are not medical doctors. They are trained to fit and dispense corrective lenses, but they do not perform surgery or prescribe medication. Optometrists and ophthalmologists are eye doctors."}],"priority":"★★☆"},"related_words":{"derivatives":["optician (singular form)","optical (adjective)","optics (noun)"],"related_professions":["optometrist (検眼医)","ophthalmologist (眼科医)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"Opticians\" refers to professionals who are qualified to prescribe and fit glasses and contact lenses, or the shops where these services are provided. It's important to note that opticians are not medical doctors; their role is primarily focused on vision correction and dispensing eyewear. For more comprehensive eye care, such as diagnosing and treating eye diseases, you would need to see an optometrist or ophthalmologist."},"example_sentences":[{"sentence":"The **opticians** have a wide selection of frames to choose from.","translation":"その眼鏡店には、選べるフレームがたくさんあります。","type":"noun","meaning_category":"眼鏡店"},{"sentence":"The **opticians** tested my vision and updated my prescription.","translation":"眼鏡技師が私の視力を検査し、処方箋を更新してくれました。","type":"noun","meaning_category":"眼鏡技師"}]}