{"word":"histodiagnosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"組織診断","english_definition":"The microscopic examination of tissue in order to diagnose disease.","examples":[{"sentence":"The histodiagnosis confirmed the presence of cancer cells.","translation":"組織診断により、癌細胞の存在が確認された。"},{"sentence":"The doctor ordered a histodiagnosis to determine the cause of the patient's symptoms.","translation":"医師は患者の症状の原因を特定するために組織診断を指示した。"}],"collocations":["perform histodiagnosis","histodiagnosis report","histodiagnosis result"],"synonyms":["biopsy","tissue diagnosis","pathological diagnosis"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'histos' (tissue) + 'diagnosis' (determination).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɪstoʊdaɪəɡˈnoʊsɪs/","syllables":"his-to-di-ag-no-sis"},"inflection":{"noun_plural":"histodiagnoses"},"usage_notes":{"explanation":"Histodiagnosis involves the microscopic examination of tissue samples to identify abnormalities and diagnose diseases. It is a crucial step in the diagnosis of many conditions, including cancer, infections, and autoimmune disorders.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The histodiagnosis was done on the blood sample.","correct":"✓ The histodiagnosis was done on the tissue sample.","note":"Histodiagnosis is performed on tissue samples, not blood samples."},{"incorrect":"✗ Histodiagnosis is a treatment for cancer.","correct":"✓ Histodiagnosis is a diagnostic tool for cancer.","note":"Histodiagnosis is a diagnostic procedure, not a treatment."}],"priority":"★★☆"},"related_words":{"derivatives":["histodiagnostic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Histodiagnosis is a specialized term used in the medical field, specifically in pathology. It refers to the process of examining tissue samples under a microscope to diagnose diseases. This term is typically encountered in medical contexts, such as pathology reports, medical research papers, and discussions among healthcare professionals. Understanding this term requires a background in biology and medicine."},"example_sentences":[{"sentence":"The histodiagnosis revealed that the tumor was benign.","translation":"組織診断の結果、腫瘍は良性であることが判明した。","type":"general","meaning_category":"diagnosis"},{"sentence":"The pathologist reviewed the slides for histodiagnosis.","translation":"病理医は組織診断のためにスライドを調べた。","type":"medical","meaning_category":"pathology"}]}