{"word":"cardiodysneuria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)心臓神経症、心臓神経衰弱","english_definition":"(medicine) A nervous condition with symptoms resembling heart disease.","examples":[{"sentence":"His symptoms were diagnosed as cardiodysneuria, not an actual heart ailment.","translation":"彼の症状は、実際の心臓病ではなく、心臓神経症と診断された。"}],"collocations":[],"synonyms":["cardiac neurosis","neurocirculatory asthenia"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'cardio-' (heart), 'dys-' (bad, difficult), 'neur(o)-' (nerve), and '-ia' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɑːrdioʊdɪsˈnʊəriə/","syllables":"car-di-o-dys-neu-ri-a"},"inflection":{"noun_plural":"cardiodysneurias"},"usage_notes":{"explanation":"'Cardiodysneuria' is a somewhat archaic term, with the more modern term being cardiac neurosis or neurocirculatory asthenia. It refers to a condition where a patient experiences symptoms that mimic heart disease, such as chest pain, palpitations, and shortness of breath, but without any underlying organic heart problem. The symptoms are believed to be psychological in origin.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["cardiac","neurosis","asthenia"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Cardiodysneuria' is a highly specialized medical term rarely encountered outside of medical contexts. It refers to a condition where a person experiences symptoms similar to heart disease, but without any physical heart problems. The symptoms are psychological in origin. Due to its specialized nature, this term is not part of general vocabulary. Understanding requires a background in medical terminology."},"example_sentences":[{"sentence":"The patient's complaints of chest pain and palpitations were ultimately attributed to cardiodysneuria.","translation":"患者の胸痛と動悸の訴えは、最終的に心臓神経症によるものと診断された。","type":"medical","meaning_category":"diagnosis"}]}