{"word":"Brihaspati","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ブリハスパティ：インド神話における神々の師、木星の神格化","english_definition":"In Hindu mythology, Brihaspati is the guru of the gods and is the personification of the planet Jupiter.","examples":[{"sentence":"Brihaspati is revered as a wise and learned deity.","translation":"ブリハスパティは、賢明で博識な神として崇拝されています。"},{"sentence":"In Vedic astrology, Brihaspati is associated with good fortune and wisdom.","translation":"ヴェーダ占星術では、ブリハスパティは幸運と知恵に関連付けられています。"}],"collocations":["Guru Brihaspati","Lord Brihaspati","Brihaspati Puja"],"synonyms":["Guru","Jupiter","Devaguru"],"antonyms":[]}],"etymology":{"value":"From Sanskrit बृहस्पति (bṛhaspati), meaning \"lord of prayer or devotion\". It is derived from bṛhas (prayer, devotion) and pati (lord, master).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbriːˈhʌspəti/","syllables":"Bri-has-pa-ti"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"Brihaspati is a significant figure in Hindu mythology and astrology. He is considered the guru (teacher) of the gods and is associated with wisdom, knowledge, and good fortune. He is also the name for the planet Jupiter in Vedic astrology. The name is often used in religious contexts and in discussions of Hindu mythology or astrology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Brihaspati is a planet.","correct":"✓ Brihaspati is the name of a deity associated with the planet Jupiter.","note":"While Brihaspati is associated with Jupiter, it is more accurate to describe him as a deity or a personification of the planet rather than simply stating he is a planet."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["Vedic astrology","Hindu deities","Jupiter","Guru"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in religious or mythological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Brihaspati' is a proper noun referring to a specific deity in Hindu mythology and the Vedic name for the planet Jupiter. Understanding its meaning requires familiarity with Hindu religious concepts and Vedic astrology. It is not a commonly used word in general English conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"Devotees offer prayers to Brihaspati for wisdom and prosperity.","translation":"信者たちは、知恵と繁栄を求めてブリハスパティに祈りを捧げます。","type":"general","meaning_category":"Hindu deity"},{"sentence":"According to Vedic astrology, a strong Brihaspati in one's birth chart indicates good fortune.","translation":"ヴェーダ占星術によると、出生図においてブリハスパティが強いことは幸運を示す。","type":"astrology","meaning_category":"Vedic astrology"}]}