{"word":"tophyperidrosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"局所性多汗症：特定の身体部位、特に手足に過剰な発汗が見られる症状","english_definition":"Localized hyperhidrosis: excessive sweating limited to specific body areas, especially the hands and feet.","examples":[{"sentence":"He was diagnosed with tophyperidrosis after complaining about constantly sweaty palms.","translation":"彼は、常に手のひらが汗ばむことを訴えた後、局所性多汗症と診断された。"},{"sentence":"Tophyperidrosis can be socially debilitating due to the discomfort and embarrassment it causes.","translation":"局所性多汗症は、不快感や恥ずかしさをもたらすため、社会生活に支障をきたす可能性がある。"}],"collocations":["treat tophyperidrosis (局所性多汗症を治療する)","symptoms of tophyperidrosis (局所性多汗症の症状)","severe tophyperidrosis (重度の局所性多汗症)"],"synonyms":["localized hyperhidrosis","focal hyperhidrosis","palmar hyperhidrosis (手のひらの多汗症)","plantar hyperhidrosis (足の裏の多汗症)"],"antonyms":["generalized hyperhidrosis (全身性多汗症)","anhidrosis (無汗症)"]}],"etymology":{"value":"The term 'tophyperidrosis' is constructed from Greek elements: 'topos' (place, location), 'hyper' (excessive), and 'hidrosis' (sweating). It describes excessive sweating localized to a specific area.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɒfɪˌhaɪpərɪˈdroʊsɪs/","syllables":"to-phy-per-i-dro-sis"},"inflection":{"noun_plural":"tophyperidroses"},"usage_notes":{"explanation":"'Tophyperidrosis' is a medical term primarily used by healthcare professionals. It is more specific than 'hyperhidrosis', which refers to excessive sweating in general. When discussing excessive sweating with a doctor, using the term 'localized hyperhidrosis' or describing the specific area affected (e.g., 'excessive sweating of the hands') may be more readily understood by the general public.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have hyperidrosis on my face.","correct":"✓ I have tophyperidrosis on my face. / ✓ I have hyperhidrosis on my face.","note":"While 'tophyperidrosis' can be used if the sweating is truly localized to the face, 'hyperhidrosis' is more common unless specifying a very small area. If the sweating is all over the face, just use 'hyperhidrosis'."},{"incorrect":"✗ Tophyperidrosis is contagious.","correct":"✓ Tophyperidrosis is not contagious.","note":"Tophyperidrosis is a medical condition, not an infectious disease. It cannot be transmitted from person to person."}],"priority":"★☆☆"},"related_words":{"derivatives":["hyperhidrosis (多汗症)","hidrosis (発汗)"],"medical_terms":["palmar hyperhidrosis (手のひらの多汗症)","plantar hyperhidrosis (足の裏の多汗症)","axillary hyperhidrosis (腋窩多汗症)","gustatory hyperhidrosis (味覚性多汗症)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized medical term)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学文献や専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tophyperidrosis' is a highly specialized medical term referring to excessive sweating localized to a specific area of the body, most commonly the hands and feet. It is not a term typically used in everyday conversation and is primarily found in medical literature or discussions among healthcare professionals. Due to its specificity and technical nature, understanding and using this term requires a strong background in medical terminology. When communicating with the general public, it is more appropriate to use the more general term 'hyperhidrosis' or to describe the condition in plain language (e.g., 'excessive sweating of the hands')."},"example_sentences":[{"sentence":"The dermatologist diagnosed her with tophyperidrosis and recommended topical treatments.","translation":"皮膚科医は彼女を局所性多汗症と診断し、局所療法を勧めた。","type":"medical","meaning_category":"diagnosis"},{"sentence":"Tophyperidrosis of the hands can make it difficult to grip objects securely.","translation":"手の局所性多汗症は、物体をしっかりと握ることを困難にする可能性がある。","type":"symptoms","meaning_category":"symptoms"},{"sentence":"Botulinum toxin injections are a common treatment for severe cases of tophyperidrosis.","translation":"ボツリヌス毒素注射は、重度の局所性多汗症の一般的な治療法である。","type":"treatment","meaning_category":"treatment"}]}