{"word":"parathyroprivic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"副甲状腺除去後の、副甲状腺機能低下による","english_definition":"Relating to or resulting from the removal of the parathyroid glands or a deficiency of parathyroid hormone.","examples":[{"sentence":"The patient exhibited parathyroprivic tetany following the surgery.","translation":"患者は手術後、副甲状腺機能低下によるテタニーを発症した。"},{"sentence":"Parathyroprivic hypocalcemia can lead to various neurological symptoms.","translation":"副甲状腺機能低下による低カルシウム血症は、様々な神経症状を引き起こす可能性がある。"}],"collocations":["parathyroprivic tetany","parathyroprivic hypocalcemia","parathyroprivic state"],"synonyms":["hypoparathyroid","post-parathyroidectomy"],"antonyms":["hyperparathyroid"],"related_conditions":["hypocalcemia","tetany"]}],"etymology":{"value":"Derived from 'parathyroid' (referring to the parathyroid glands) and 'privic' (related to deprivation or removal).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəˌθaɪroʊˈpraɪvɪk/","syllables":"par-a-thy-ro-pri-vic"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns."},"usage_notes":{"explanation":"The term 'parathyroprivic' is primarily used in medical contexts to describe conditions or symptoms that arise due to the absence or deficiency of parathyroid hormone. This is often a consequence of surgical removal of the parathyroid glands (parathyroidectomy). It's important to note that the term specifically refers to the *cause* being related to parathyroid deficiency, not simply the presence of the symptoms themselves.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The symptoms were parathyroprivic, even though the parathyroid glands were intact.","correct":"✓ The symptoms resembled those of a parathyroprivic state, but the parathyroid glands were intact.","note":"'Parathyroprivic' implies that the condition is caused by parathyroid deficiency. If the glands are intact, the symptoms may be similar, but the condition is not technically parathyroprivic."}],"priority":"★★☆"},"related_words":{"derivatives":["parathyroidectomy (surgical removal of the parathyroid glands)","hypoparathyroidism (condition of deficient parathyroid hormone production)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Parathyroprivic' is a highly specialized medical term used to describe conditions resulting from the removal or deficiency of parathyroid glands. It is primarily encountered in medical texts and discussions related to endocrinology and surgery. Understanding this term requires familiarity with the function of the parathyroid glands and the consequences of their absence. The term is not commonly used in general conversation or non-medical contexts."},"example_sentences":[{"sentence":"The parathyroprivic state led to a significant decrease in serum calcium levels.","translation":"副甲状腺除去後の状態は、血清カルシウム値の著しい低下を引き起こした。","type":"adjective","meaning_category":"副甲状腺機能低下による"},{"sentence":"Management of parathyroprivic hypocalcemia requires careful monitoring and calcium supplementation.","translation":"副甲状腺機能低下による低カルシウム血症の管理には、注意深いモニタリングとカルシウム補給が必要である。","type":"adjective","meaning_category":"副甲状腺機能低下による"}]}