{"word":"Gorgonesque","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ゴルゴンのような、ゴルゴンを思わせる","english_definition":"Resembling or characteristic of a Gorgon, especially in being terrifying or repulsive.","examples":[{"sentence":"The old woman's face had a gorgonesque quality, with its sharp features and piercing eyes.","translation":"その老婆の顔は、鋭い顔立ちと鋭い眼光で、ゴルゴンのような雰囲気を持っていた。"},{"sentence":"The monster's appearance was truly gorgonesque, causing anyone who looked upon it to recoil in horror.","translation":"その怪物の外見はまさにゴルゴンのようで、それを見た者は誰でも恐怖で身をすくませた。"}],"collocations":["gorgonesque features (ゴルゴンのような顔立ち)","gorgonesque appearance (ゴルゴンのような外見)","gorgonesque stare (ゴルゴンのような凝視)"],"synonyms":["hideous","monstrous","repulsive","terrifying","grotesque"],"antonyms":["beautiful","attractive","appealing"]}],"etymology":{"value":"Derived from 'Gorgon', a creature in Greek mythology whose appearance was so terrifying that anyone who looked at her turned to stone, plus the suffix '-esque', meaning 'resembling' or 'in the style of'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡɔːrɡənˈesk/","syllables":"Gor-gon-esque"},"inflection":{"notes":"Adjectives do not typically inflect in English, though they can be used in comparative or superlative forms (more gorgonesque, most gorgonesque)."},"usage_notes":{"explanation":"'Gorgonesque' is used to describe something that is extremely frightening, ugly, or repulsive, reminiscent of the Gorgons of Greek mythology. It often implies a petrifying or paralyzing effect due to the sheer horror of the subject.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gorgonesque statue was admired for its beauty.","correct":"✓ The gorgonesque statue was feared for its terrifying appearance.","note":"'Gorgonesque' implies something frightening or repulsive, not beautiful or admirable."}],"priority":"★☆☆"},"related_words":{"derivatives":["Gorgon (noun: ゴルゴン)"],"phrases":["Gorgon's head (ゴルゴンの頭)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gorgonesque' is a relatively rare and sophisticated word used to describe something extremely frightening or repulsive, similar to the Gorgons of Greek mythology. Understanding the reference to the Gorgons is essential to grasping the meaning of this word. It is not commonly used in everyday conversation but may appear in literary or academic contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The twisted trees in the haunted forest had a distinctly gorgonesque silhouette against the stormy sky.","translation":"お化けの森のねじれた木々は、嵐の空を背景に、明らかにゴルゴンのようなシルエットをしていた。","type":"adjective","meaning_category":"ゴルゴンのような"},{"sentence":"Her gorgonesque rage was enough to silence the entire room.","translation":"彼女のゴルゴンのような怒りは、部屋全体を静まり返らせるほどだった。","type":"adjective","meaning_category":"ゴルゴンのような"},{"sentence":"The gargoyle's gorgonesque face leered down from the cathedral roof.","translation":"ガーゴイルのゴルゴンのような顔が、大聖堂の屋根から下をにらみつけていた。","type":"adjective","meaning_category":"ゴルゴンのような"}]}