{"word":"sorptions","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(化学)収着","english_definition":"The process of one substance becoming attached to another. Sorption is a general term encompassing both absorption and adsorption.","examples":[{"sentence":"The sorptions of pollutants by soil particles is an important environmental process.","translation":"土壌粒子による汚染物質の収着は、重要な環境プロセスです。"}],"collocations":["sorption process","sorption isotherm","sorption capacity"],"synonyms":["absorption","adsorption"],"antonyms":["desorption"]}],"etymology":{"value":"A blend of 'absorption' and 'adsorption'.","priority":"★★☆"},"pronunciation":{"ipa":"/sɔːrpʃənz/","syllables":"sorp-tions"},"inflection":{"noun_plural":"sorptions"},"usage_notes":{"explanation":"'Sorption' is used when it is not known or specified whether a substance is being absorbed (entering the bulk of the material) or adsorbed (attaching to the surface of the material). It is a general term in chemistry and environmental science.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sorption was only on the surface.","correct":"✓ The adsorption was only on the surface.","note":"If you know it's only on the surface, use 'adsorption' instead of 'sorption'."},{"incorrect":"✗ The sorption went all the way through the material.","correct":"✓ The absorption went all the way through the material.","note":"If you know it went through the material, use 'absorption' instead of 'sorption'."}],"priority":"★★☆"},"related_words":{"derivatives":["sorb (verb): to undergo sorption","sorbent (noun): a material that can undergo sorption"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sorption' is a technical term used in chemistry and environmental science to describe the process where one substance attaches to another. It's used when you don't need to specify whether the substance is being absorbed (taken inside) or adsorbed (attaching to the surface). If you know specifically which one is happening, use 'absorption' or 'adsorption' instead.","priority":"★★☆"},"example_sentences":[{"sentence":"The rate of sorptions depends on the temperature and pressure.","translation":"収着の速度は温度と圧力に依存します。","type":"noun","meaning_category":"General sorption process"},{"sentence":"Understanding sorptions mechanisms is crucial for designing effective filters.","translation":"効果的なフィルターを設計するには、収着メカニズムを理解することが重要です。","type":"noun","meaning_category":"Understanding sorption"},{"sentence":"Activated carbon is often used for sorptions of organic compounds from water.","translation":"活性炭は、水からの有機化合物の収着によく使用されます。","type":"noun","meaning_category":"Application of sorption"}]}