{"word":"lucubrate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"(特に夜間に)苦心して研究する、勉強する、執筆する","english_definition":"to study, write, or work laboriously, especially at night.","examples":[{"sentence":"He lucubrated for hours on the complex mathematical problem.","translation":"彼はその複雑な数学の問題を何時間も苦心して研究した。"},{"sentence":"The scholar lucubrated late into the night to finish his manuscript.","translation":"その学者は原稿を仕上げるために夜遅くまで苦心して執筆した。"},{"sentence":"She lucubrated over the ancient texts, trying to decipher their meaning.","translation":"彼女は古代のテキストを苦心して研究し、その意味を解読しようとした。"}],"collocations":["lucubrate on a topic","lucubrate over a book","lucubrate late into the night"],"synonyms":["study","ponder","meditate","deliberate","cogitate","burn the midnight oil","grind away"],"antonyms":["relax","idle","dally","laze"]}],"etymology":{"value":"Derived from the Latin word 'lucubrare,' meaning 'to work by lamplight,' which comes from 'lux' (light). The word suggests diligent study or writing, often done at night.","priority":"★★☆"},"pronunciation":{"ipa":"ˈluːkjuˌbreɪt","syllables":"lu-cu-brate"},"inflection":{"verb_forms":{"present_simple":["lucubrate","lucubrates"],"past_simple":"lucubrated","past_participle":"lucubrated","present_participle":"lucubrating"}},"usage_notes":{"explanation":"'Lucubrate' is a somewhat formal and uncommon word, often used to describe scholarly or intellectual work that requires significant effort and time, especially when done at night. It implies a dedication to study or writing, often involving intricate or complex subjects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lucubrated the party with his friends.","correct":"✓ He lucubrated on his thesis.","note":"'Lucubrate' should be used with activities involving study, writing, or deep thought, not with social activities."},{"incorrect":"✗ She lucubrated quickly and carelessly.","correct":"✓ She lucubrated diligently and thoroughly.","note":"'Lucubrate' implies a careful and laborious effort, so it should not be associated with quick or careless actions."}],"priority":"★★☆"},"related_words":{"derivatives":["lucubration (noun: laborious study or thought, especially at night; a product of such study)","lucubratory (adjective: characterized by or suggestive of lucubration)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - A relatively rare word.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lucubrate' is a sophisticated term denoting diligent study or writing, particularly during the night. Its usage is infrequent, typically found in academic or literary contexts to describe intense intellectual effort. Understanding this word enhances comprehension of advanced texts and scholarly discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The graduate student lucubrated tirelessly on his dissertation.","translation":"その大学院生は、論文に精力を注いで苦心して研究した。","type":"verb","meaning_category":"研究する"},{"sentence":"Many great literary works were born from authors who lucubrated late into the night.","translation":"多くの偉大な文学作品は、夜遅くまで苦心して執筆した作家たちから生まれた。","type":"verb","meaning_category":"執筆する"},{"sentence":"She lucubrated over the ancient manuscripts, hoping to uncover hidden truths.","translation":"彼女は隠された真実を明らかにしたいと願い、古代の原稿を苦心して研究した。","type":"verb","meaning_category":"研究する"}]}