{"word":"Metascope","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of optical instrument, especially one used for viewing objects in a different medium (e.g., underwater). It can also refer to a wide-angle viewing device.","english_definition":"An optical instrument for viewing objects, especially those in a different medium or with a wide field of view.","examples":[{"sentence":"The divers used a Metascope to examine the coral reef.","translation":"ダイバーたちはメタスコープを使ってサンゴ礁を調べた。"},{"sentence":"The Metascope provided a clear view of the underwater environment.","translation":"メタスコープは水中の環境の鮮明な視界を提供した。"}],"collocations":["underwater Metascope","wide-angle Metascope"],"synonyms":["periscope","telescope","optical instrument"],"antonyms":[]}],"etymology":{"value":"The etymology combines 'meta-' (meaning 'beyond' or 'about') with '-scope' (from the Greek 'skopeō', meaning 'to see' or 'to examine'). The name suggests an instrument that allows one to see beyond normal limitations or to examine something in detail.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɛtəˌskoʊp/","syllables":"me-ta-scope"},"inflection":{"noun_plural":"Metascopes"},"usage_notes":{"explanation":"The term 'Metascope' is relatively rare and may not be widely recognized. It generally refers to an optical instrument designed for specific viewing conditions, such as underwater viewing or wide-angle observation. The precise design and functionality can vary.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a microscope to see the fish underwater.","correct":"✓ I used a Metascope to see the fish underwater.","note":"A microscope is for viewing very small objects, not for underwater viewing. A Metascope is more appropriate for the latter."}],"priority":"★☆☆"},"related_words":{"derivatives":["Metascopic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Technical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Metascope' is a specialized term referring to an optical instrument designed for specific viewing conditions, such as underwater or wide-angle observation. It is not a commonly used word and is more likely to be encountered in technical or scientific contexts. Understanding the etymology ('meta-' meaning 'beyond' and '-scope' meaning 'to see') helps to grasp its function as an instrument that allows seeing beyond normal limitations."},"example_sentences":[{"sentence":"The marine biologist deployed a Metascope to study the deep-sea creatures.","translation":"海洋生物学者は深海生物を研究するためにメタスコープを展開した。","type":"noun","meaning_category":"optical instrument"},{"sentence":"Using the Metascope, the surveyor could get a panoramic view of the landscape.","translation":"メタスコープを使って、測量技師は風景のパノラマビューを得ることができた。","type":"noun","meaning_category":"optical instrument"}]}