{"word":"Nothingarian","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"無宗教者、特に特定の宗教的信念を持たない人","english_definition":"A person who has no particular religious beliefs or affiliations; someone who does not identify with any organized religion.","examples":[{"sentence":"He describes himself as a Nothingarian, not actively atheist but without any religious faith.","translation":"彼は自らを無宗教者だと説明しており、積極的に無神論者というわけではないが、いかなる宗教的信仰も持っていない。"},{"sentence":"Many young people today identify as Nothingarians, finding traditional religions irrelevant to their lives.","translation":"今日、多くの若者が自らを無宗教者だと認識しており、伝統的な宗教が彼らの生活には無関係だと感じている。"}],"collocations":["identify as a Nothingarian (無宗教者だと認識する)","a growing number of Nothingarians (増加する無宗教者の数)","modern Nothingarianism (現代の無宗教主義)"],"synonyms":["non-religious","secular","unaffiliated","agnostic","atheist (sometimes overlapping, but not always)"],"antonyms":["religious","believer","adherent","devotee"]},{"part_of_speech":"adjective","definition":"無宗教の、特定の宗教的信念を持たない","english_definition":"Relating to or characteristic of people who have no particular religious beliefs or affiliations.","examples":[{"sentence":"The Nothingarian viewpoint is becoming more common in Western societies.","translation":"無宗教的な視点は、西洋社会においてより一般的になりつつある。"},{"sentence":"Nothingarian ethics often focus on humanism and secular morality.","translation":"無宗教的な倫理観は、しばしば人道主義や世俗的な道徳に焦点を当てる。"}],"collocations":["Nothingarian viewpoint (無宗教的な視点)","Nothingarian ethics (無宗教的な倫理観)","Nothingarian society (無宗教的な社会)"],"synonyms":["non-religious","secular","unaffiliated"],"antonyms":["religious"]}],"etymology":{"value":"「nothing」+「-arian」（～主義者、～信奉者）から作られた造語。特定の宗教的信念「何もない（nothing）」ことを意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnʌθɪŋˈɛəriən/","syllables":"Noth-ing-air-i-an"},"inflection":{"noun_plural":"Nothingarians"},"usage_notes":{"explanation":"「**Nothingarian**」は比較的最近の言葉で、特定の宗教的信念を持たない人々を指すために使われます。必ずしも無神論者（atheist）や不可知論者（agnostic）と同義ではありません。無神論者は神の存在を否定し、不可知論者は神の存在を知ることができないと考えますが、無宗教者は単に特定の宗教に所属したり、宗教的信念を持ったりしないことを意味します。この言葉は、宗教的なアイデンティティを持たないことを積極的に表明するニュアンスを含むことがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Nothingarian because he hates all religions.","correct":"✓ He is a Nothingarian because he doesn't practice any religion.","note":"Nothingarianism is not necessarily about hating religion, but rather about not having any particular religious affiliation or belief."},{"incorrect":"✗ Nothingarians are always atheists.","correct":"✓ Nothingarians are not always atheists; they may simply not identify with any particular religion.","note":"Atheism is a specific belief (or lack thereof) regarding the existence of God, while Nothingarianism is about a lack of religious affiliation."}],"priority":"★★☆"},"related_words":{"derivatives":["None (関連する言葉として、宗教的所属を尋ねられた際に「None」と答える人がいる)"],"phrases":["spiritual but not religious (SBNR) (宗教的ではないが、精神的なものを重視する人)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (この単語はCEFRのレベルに含まれていません)","frequency_google_ngram":"低頻度 (Low frequency) - 比較的新しい言葉であり、一般的な語彙ではありません。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Nothingarian**」は、特定の宗教的信念や所属を持たない人を指す、比較的新しい言葉です。無神論者（神の存在を否定する人）や不可知論者（神の存在を知ることが不可能だと考える人）とは異なり、無宗教者は単に特定の宗教に所属しないことを意味します。この言葉は、宗教的なアイデンティティを持たないことを積極的に表明するニュアンスを含むことがあります。この単語は、宗教、哲学、社会学などの分野で議論されることがあります。"},"example_sentences":[{"sentence":"As a self-described Nothingarian, she found comfort in secular philosophy.","translation":"自称無宗教者として、彼女は世俗的な哲学に慰めを見出した。","type":"noun","meaning_category":"無宗教者"},{"sentence":"The rise of Nothingarianism reflects a growing skepticism towards organized religion.","translation":"無宗教主義の台頭は、組織化された宗教に対する懐疑的な見方の高まりを反映している。","type":"noun","meaning_category":"無宗教主義"},{"sentence":"Many Nothingarian parents choose to raise their children without religious indoctrination.","translation":"多くの無宗教の親は、子供たちを宗教的な教化なしに育てることを選択する。","type":"adjective","meaning_category":"無宗教の"}]}