{"word":"Cathedratical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Of or pertaining to a cathedral; proceeding from, or possessing the authority of, a bishop's chair or cathedral.","english_definition":"Relating to a cathedral or a bishop's seat of authority.","examples":[{"sentence":"The cathedratical school was known for its rigorous academic standards.","translation":"その大聖堂学校は、厳格な学術水準で知られていました。"},{"sentence":"He delivered a cathedratical sermon that resonated with the entire congregation.","translation":"彼は、会衆全体に響き渡る、司教座聖堂にふさわしい説教を行いました。"}],"collocations":["cathedratical authority","cathedratical church","cathedratical school","cathedratical sermon"],"synonyms":["ecclesiastical","episcopal","diocesan","pontifical"],"antonyms":["secular","lay","nonclerical"]}],"etymology":{"value":"From Medieval Latin cathedraticus, from cathedra (bishop's seat or chair), from Greek kathedra (seat).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkæθɪˈdrætɪkəl/","syllables":"ca-the-dra-ti-cal"},"inflection":{"notes":"Adjective, no specific inflections apply."},"usage_notes":{"explanation":"'Cathedratical' is a somewhat rare and formal term used to describe something related to a cathedral, particularly in the context of the bishop's authority or the cathedral's role as the seat of that authority. It is often used in historical or ecclesiastical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cathedratical was very beautiful.","correct":"✓ The cathedral was very beautiful.","note":"'Cathedratical' is an adjective, not a noun. Use 'cathedral' as the noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["cathedral","cathedra"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'cathedratical' is a relatively uncommon and formal adjective. It is used to describe something that relates to a cathedral, especially in terms of the authority or function associated with the bishop's seat (cathedra) within that cathedral. Due to its specialized usage, it is more likely to be encountered in academic or historical texts concerning ecclesiastical matters."},"example_sentences":[{"sentence":"The document bore the cathedratical seal, signifying its official origin.","translation":"その文書には司教座聖堂の印章が押されており、その公式な起源を示していました。","type":"adjective","meaning_category":"Relating to a cathedral"},{"sentence":"The conference addressed various aspects of cathedratical governance and administration.","translation":"会議では、司教座聖堂の統治と運営のさまざまな側面が取り上げられました。","type":"adjective","meaning_category":"Relating to a bishop's seat of authority"}]}