{"word":"perivisceral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"内臓周囲の、臓器周囲の","english_definition":"Located around or surrounding the viscera (internal organs).","examples":[{"sentence":"The perivisceral fat was significantly reduced after the intervention.","translation":"介入後、内臓周囲脂肪は大幅に減少した。"},{"sentence":"Perivisceral inflammation can contribute to various health problems.","translation":"内臓周囲の炎症は、様々な健康問題の一因となる可能性がある。"}],"collocations":["perivisceral fat (内臓周囲脂肪)","perivisceral space (内臓周囲腔)","perivisceral inflammation (内臓周囲炎症)"],"synonyms":["visceral","intra-abdominal","splanchnic"],"antonyms":[]}],"etymology":{"value":"Derived from the prefix 'peri-' (around, surrounding) and 'visceral' (relating to the viscera or internal organs).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɛrɪˈvɪsərəl/","syllables":"per-i-vis-cer-al"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparative and superlative forms (which are less common for this word)."},"usage_notes":{"explanation":"'Perivisceral' is a technical term primarily used in medical and scientific contexts to describe the location of structures, tissues, or processes around the internal organs (viscera) of the body. It is often used in discussions of anatomy, physiology, and pathology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The perivisceral area is located on the skin.","correct":"✓ The perivisceral area is located around the internal organs.","note":"The perivisceral area is specifically related to the internal organs, not the skin."}],"priority":"★★☆"},"related_words":{"derivatives":["viscera (名詞: 内臓)","visceral (形容詞: 内臓の、本能的な)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Technical/Medical Vocabulary)","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Perivisceral' is a specialized term used in medical and biological fields. It refers to the area or tissues surrounding the internal organs. Because it's a technical term, it's not commonly used in everyday language. Understanding its meaning requires knowledge of basic anatomy and physiology. It is most often encountered in scientific literature, medical reports, or academic discussions related to the body's internal structures and their functions."},"example_sentences":[{"sentence":"The study examined the effects of diet on perivisceral fat accumulation.","translation":"その研究では、食事が内臓周囲脂肪の蓄積に及ぼす影響を調査した。","type":"general","meaning_category":"内臓周囲の"},{"sentence":"Perivisceral fibrosis was observed in the liver samples.","translation":"肝臓のサンプルにおいて、内臓周囲の線維化が観察された。","type":"medical","meaning_category":"内臓周囲の"}]}