{"word":"spastically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"痙攣的に、強直的に","english_definition":"In a spastic manner; characterized by or affected with spasms, especially muscular spasms.","examples":[{"sentence":"The dancer moved spastically, her limbs jerking uncontrollably.","translation":"ダンサーは痙攣的に動き、手足が制御不能に震えた。"},{"sentence":"The patient's muscles contracted spastically.","translation":"患者の筋肉は強直的に収縮した。"}],"collocations":["move spastically","contract spastically","react spastically"],"synonyms":["convulsively","jerky","uncontrollably"],"antonyms":["smoothly","gracefully","fluidly"]}],"etymology":{"value":"Derived from the adjective 'spastic' (relating to or affected by muscle spasm) + '-ally' (suffix forming adverbs). 'Spastic' comes from Greek 'spastikos' (drawing in, convulsive), from 'span' (to draw).","priority":"★★☆"},"pronunciation":{"ipa":"/spæsˈtɪk(ə)li/","syllables":"spas-tic-al-ly"},"inflection":{"notes":"Adverb - no inflection."},"usage_notes":{"explanation":"'Spastically' describes movements or actions that are uncontrolled, jerky, and often associated with muscle spasms. It is derived from 'spastic,' which, in medical contexts, refers to spasticity, a condition characterized by increased muscle tone and stiffness. However, it's crucial to note that the term 'spastic' has a history of being used as a derogatory term for people with cerebral palsy or other disabilities, particularly in British English. Therefore, using 'spastically' to describe a person's movements or behavior can be offensive and should be avoided. It is better to use more neutral and descriptive language.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He walked spastically down the street (when referring to someone with a disability in a derogatory way).","correct":"✓ He walked with an unsteady gait down the street.","note":"Avoid using 'spastically' to describe someone's movements in a way that could be perceived as mocking or offensive. Use more neutral terms like 'unsteadily,' 'with difficulty,' or describe the specific characteristics of their movement. "},{"incorrect":"✗ The machine was working spastically.","correct":"✓ The machine was working erratically.","note":"When describing the irregular or jerky movements of a machine, 'erratically' or 'sporadically' are more appropriate terms than 'spastically'."}],"priority":"★★☆"},"related_words":{"derivatives":["spastic (adjective, noun)","spasm (noun)","spasmodic (adjective)","spasmodically (adverb)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (low frequency, specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Spastically' is an adverb that describes something done in a way that involves spasms or uncontrolled muscle contractions. It is related to the adjective 'spastic,' which has a complex history. While it is a medical term, it has also been used as a derogatory term for people with certain disabilities. Therefore, it's important to use this word with caution and be aware of its potential to cause offense. In many cases, more neutral and descriptive language is preferable."},"example_sentences":[{"sentence":"The injured bird flapped its wings spastically.","translation":"怪我をした鳥は翼を痙攣的に羽ばたかせた。","type":"adverb","meaning_category":"痙攣的に"},{"sentence":"Due to the nerve damage, his hand moved spastically.","translation":"神経損傷のため、彼の腕は痙攣的に動いた。","type":"adverb","meaning_category":"痙攣的に"}]}