{"word":"Concernment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"心配、懸念、関心事","english_definition":"A feeling of anxiety or worry, especially about something important; a matter of interest or importance.","examples":[{"sentence":"There is growing concernment about the safety of the new bridge.","translation":"新しい橋の安全性に対する懸念が高まっている。"},{"sentence":"Her primary concernment is the well-being of her children.","translation":"彼女の主な関心事は子供たちの幸福である。"},{"sentence":"He expressed his concernment over the rising cost of living.","translation":"彼は生活費の高騰に対する懸念を表明した。"}],"collocations":["express concernment (懸念を表明する)","growing concernment (高まる懸念)","primary concernment (主な関心事)","show concernment (関心を示す)"],"synonyms":["worry","anxiety","apprehension","unease","interest","care","solicitude"],"antonyms":["indifference","apathy","unconcern"],"notes":"'Concernment' is a less common and somewhat formal synonym for 'concern'. It can sometimes sound stilted or overly elaborate, so 'concern' is usually preferred. However, 'concernment' can be used to emphasize a strong feeling of worry or importance."}],"etymology":{"value":"Derived from 'concern' with the addition of the suffix '-ment', which typically forms nouns indicating a state, condition, or result. 'Concern' comes from Middle French 'concerner', which in turn comes from Latin 'concernere' (to concern, affect, relate to).","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈsɜːrnmənt/","syllables":"con-cern-ment"},"inflection":{"noun_plural":"concernments"},"usage_notes":{"explanation":"'Concernment' is a noun that expresses a feeling of worry, anxiety, or interest. While grammatically correct, it's less frequently used than 'concern'. In most contexts, 'concern' is the preferred and more natural choice. 'Concernment' can be used to add emphasis or formality, but it should be used sparingly to avoid sounding pretentious.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have much concernment about the exam.","correct":"✓ I have much concern about the exam.","note":"'Concern' is generally preferred over 'concernment' in most contexts. Using 'concern' sounds more natural and less formal."},{"incorrect":"✗ The concernment is very big.","correct":"✓ The concern is very big.","note":"Again, 'concern' is the more common and natural choice. 'The concern is very big' sounds better than 'The concernment is very big'."}],"priority":"★★☆"},"related_words":{"derivatives":["concern (verb, noun)","concerned (adjective)","concerning (preposition)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rarely used in everyday conversation, more common in formal writing)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Concernment' is a formal word that means worry or interest. It's not used very often in everyday speech. Instead, people usually say 'concern'. If you want to sound more formal or emphasize the feeling, you can use 'concernment', but be careful not to use it too much because it can sound unnatural. It's more common in formal writing or when someone wants to stress the importance of something they are worried about or interested in."},"example_sentences":[{"sentence":"The level of public concernment regarding environmental pollution is rising.","translation":"環境汚染に関する国民の懸念が高まっている。","type":"noun","meaning_category":"心配、懸念"},{"sentence":"Her deep concernment for the welfare of animals led her to volunteer at the shelter.","translation":"彼女の動物の福祉に対する深い関心から、シェルターでボランティア活動をするようになった。","type":"noun","meaning_category":"関心事"},{"sentence":"Despite his outward calm, there was a palpable concernment in his voice.","translation":"表面上は冷静だったが、彼の声には明らかな懸念が感じられた。","type":"noun","meaning_category":"心配、懸念"}]}