{"word":"probationally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"試用的に、仮採用で、執行猶予付きで","english_definition":"in a way that relates to or involves a period of trial or testing to see if someone or something is suitable or satisfactory; under a period of supervision or monitoring.","examples":[{"sentence":"He was hired probationally for three months to see if he fit the team.","translation":"彼はチームに合うかどうかを見るために、3ヶ月間の試用期間で採用された。"},{"sentence":"The employee was placed probationally after violating company policy.","translation":"その従業員は社内規定に違反したため、執行猶予付きとなった。"},{"sentence":"She was accepted into the program probationally, pending the completion of her background check.","translation":"彼女は身元調査の完了を条件として、試用的にプログラムに受け入れられた。"}],"collocations":["hired probationally","employed probationally","accepted probationally","placed probationally","serving probationally"],"synonyms":["temporarily","conditionally","experimentally","provisionally","tentatively","subject to approval"],"antonyms":["permanently","definitely","unconditionally"]}],"etymology":{"value":"Derived from 'probation', which comes from the Latin 'probatio' meaning 'a proving, a trying'. The suffix '-ally' turns it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈbeɪʃənəli/","syllables":"pro-ba-tion-al-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Probationally' indicates that something is happening under a trial period or with conditions attached. It is often used in employment contexts to describe a period where an employee's performance is being evaluated before a permanent position is offered. It can also refer to a legal context, where someone is serving a sentence under probation, meaning they are being supervised instead of being incarcerated.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was probationally permanent.","correct":"✓ He was hired on a probationary basis.","note":"'Probationally' implies a temporary or conditional state, so it cannot be used with 'permanent' which means lasting forever. It's better to use the phrase 'on a probationary basis'."},{"incorrect":"✗ She probationally did her homework.","correct":"✓ She did her homework with extra care because she was on probation.","note":"'Probationally' describes the condition under which something is done, not the manner in which it is done. The sentence should be rephrased to reflect this."}],"priority":"★★☆"},"related_words":{"derivatives":["probation (noun)","probationary (adjective)"],"phrasal_verbs":[],"related_concepts":["parole","suspended sentence","trial period","conditional release"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Probationally' is an adverb that describes something happening under a probationary period, meaning a trial or testing phase. It is used in formal contexts, such as employment or legal settings, to indicate that something is not yet permanent and is subject to evaluation or conditions. Understanding this word requires a good grasp of formal vocabulary and the concept of probation."},"example_sentences":[{"sentence":"The new recruit was hired probationally to assess his skills and work ethic.","translation":"新入社員は、彼のスキルと労働倫理を評価するために試用期間で採用された。","type":"general","meaning_category":"Trial period employment"},{"sentence":"The judge sentenced him to five years of probation, during which he would be monitored probationally.","translation":"裁判官は彼に5年間の執行猶予を言い渡し、その間、彼は執行猶予付きで監視されることになった。","type":"legal","meaning_category":"Legal probation"},{"sentence":"She was accepted into the university probationally, pending submission of her final transcripts.","translation":"彼女は最終成績証明書の提出を条件として、試用的に大学に受け入れられた。","type":"academic","meaning_category":"Conditional acceptance"}]}