{"word":"deslealmente","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"Disloyally; in a disloyal manner.","english_definition":"In a manner that is not loyal; betraying trust or allegiance.","examples":[{"sentence":"Actuó deslealmente al revelar nuestros secretos.","translation":"He acted disloyally by revealing our secrets.","note":"This sentence shows how someone can act in a disloyal way."},{"sentence":"Fue tratado deslealmente por sus compañeros.","translation":"He was treated disloyally by his colleagues.","note":"This sentence describes how someone can be treated in a disloyal way."}],"collocations":["actuar deslealmente","tratar deslealmente"],"synonyms":["traidoramente","infielmente","pérfidamente"],"antonyms":["lealmente","fielmente"],"related_words":["desleal (adjective: disloyal)","deslealtad (noun: disloyalty)"]}],"etymology":{"value":"Formed from the adjective 'desleal' (disloyal) and the suffix '-mente' (equivalent to '-ly' in English), which is used to form adverbs in Spanish.","note":"The etymology explains the word's structure and origin from 'desleal'."},"pronunciation":{"ipa":"/deslealˈmente/","syllables":"des-le-al-men-te"},"inflection":{"notes":"As an adverb, 'deslealmente' does not inflect for gender or number."},"usage_notes":{"explanation":"'Deslealmente' describes an action or behavior that lacks loyalty, betraying a trust or allegiance. It is used to indicate that someone has acted in a way that is not faithful or honest to a person, group, or cause.","note":"This explains the general usage of the word."},"common_mistakes":{"examples":[{"incorrect":"Él es deslealmente.","correct":"Él actúa deslealmente.","note":"'Deslealmente' is an adverb and should modify a verb, not be used as a predicate nominative."}],"note":"This highlights a common grammatical error."},"level_frequency":{"frequency_spanish_corpus":"Relatively infrequent; more common is the adjective 'desleal'.","note":"This gives an idea of how often the word is used compared to its adjective form."},"readability_explanation":{"level":"B2","text":"The word 'deslealmente' is a relatively advanced term in Spanish, used to describe actions that betray loyalty. It is formed by adding '-mente' to the adjective 'desleal' (disloyal). Understanding its use requires a good grasp of Spanish grammar and vocabulary.","note":"This explains the readability and level of the word."},"example_sentences":[{"sentence":"La empresa fue acusada de competir deslealmente en el mercado.","translation":"The company was accused of competing disloyally in the market.","type":"general","meaning_category":"business"},{"sentence":"El espía actuó deslealmente al vender información al enemigo.","translation":"The spy acted disloyally by selling information to the enemy.","type":"general","meaning_category":"espionage"},{"sentence":"No puedo creer que me hayas tratado deslealmente después de todo lo que he hecho por ti.","translation":"I can't believe you treated me disloyally after everything I've done for you.","type":"general","meaning_category":"personal relationships"}]}