{"word":"self-piquer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己嫌悪に陥る人、自虐的な人","english_definition":"A person who indulges in self-pity or self-deprecation.","examples":[{"sentence":"He was a self-piquer, always complaining about his misfortunes.","translation":"彼は自己嫌悪に陥りやすい人で、いつも自分の不幸について不平を言っていた。"},{"sentence":"The character in the novel is portrayed as a self-piquer, constantly dwelling on her past mistakes.","translation":"小説の登場人物は、過去の過ちを常に気に病む、自虐的な人として描かれている。"}],"collocations":["chronic self-piquer (慢性の自己嫌悪者)","inveterate self-piquer (根っからの自己嫌悪者)"],"synonyms":["self-pitying person","self-deprecator","complainer","whiner","pessimist"],"antonyms":["optimist","self-confident person","positive thinker"]}],"etymology":{"value":"The word is formed by combining \"self-\" (referring to oneself) with \"piquer,\" which is derived from the French word \"piquer\" meaning \"to prick\" or \"to sting.\" In this context, it implies stinging or tormenting oneself with negative thoughts or feelings.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌself.piˈkeɪ/","syllables":"self-pi-kay"},"inflection":{"noun_plural":"self-piquers"},"usage_notes":{"explanation":"\"Self-piquer\" is a relatively uncommon word used to describe someone who frequently engages in self-pity or self-deprecation. It suggests a tendency to dwell on negative aspects of oneself or one's circumstances, often leading to complaints or expressions of unhappiness. The term carries a slightly negative connotation, implying that the person's self-pity is excessive or unwarranted.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a self-pique.","correct":"✓ He is a self-piquer.","note":"The correct term is \"self-piquer,\" not \"self-pique.\" The suffix \"-er\" indicates a person who performs the action or embodies the characteristic."},{"incorrect":"✗ She self-piquers all the time.","correct":"✓ She is a self-piquer. / ✓ She engages in self-pity all the time.","note":"\"Self-piquer\" is a noun, not a verb. To describe the action, use phrases like \"engages in self-pity\" or \"is self-pitying.\""}],"priority":"★★☆"},"related_words":{"derivatives":["self-pity (名詞: 自己憐憫)","self-pitying (形容詞: 自己憐憫的な)","self-deprecation (名詞: 自己卑下)","self-deprecating (形容詞: 自己卑下的な)"],"phrases":["wallowing in self-pity (自己憐憫に浸る)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency - The word is not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Self-piquer\" is a rare and sophisticated term for someone who habitually engages in self-pity or self-deprecation. It implies a tendency to dwell on negative aspects of oneself or one's situation, often leading to complaints or expressions of unhappiness. The word is not commonly encountered in everyday language and is more likely to be found in literary or academic contexts. Understanding this word requires a strong vocabulary and an appreciation for nuanced language.","priority":"★☆☆"},"example_sentences":[{"sentence":"Don't be such a self-piquer; focus on the positive aspects of your life.","translation":"そんなに自己嫌悪に陥らないで、人生のポジティブな面に焦点を当てなさい。","type":"noun","meaning_category":"自己嫌悪に陥る人"},{"sentence":"The therapist helped him overcome his tendency to be a self-piquer.","translation":"セラピストは、彼が自己嫌悪に陥りやすい傾向を克服するのを助けた。","type":"noun","meaning_category":"自虐的な人"}]}