{"word":"acetylcholine","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アセチルコリン","english_definition":"A neurotransmitter that is released at nerve endings, involved in muscle contraction and other functions.","examples":[{"sentence":"Acetylcholine is essential for muscle movement.","translation":"アセチルコリンは筋肉運動に不可欠です。"},{"sentence":"The study investigated the role of acetylcholine in memory formation.","translation":"その研究は記憶形成におけるアセチルコリンの役割を調査しました。"}],"collocations":["acetylcholine receptor","acetylcholine esterase","release of acetylcholine","synthesis of acetylcholine"],"synonyms":["ACh"],"antonyms":[]}],"etymology":{"value":"Formed from acetyl- + choline.","priority":"★★☆"},"pronunciation":{"ipa":"/əˌsiːtəlˈkoʊliːn/","syllables":"a-ce-tyl-cho-line"},"inflection":{"notes":"It is a noun, so it has a plural form (acetylcholines), but it is rarely used."},"usage_notes":{"explanation":"Acetylcholine is a vital neurotransmitter in both the peripheral nervous system (PNS) and the central nervous system (CNS). In the PNS, it plays a crucial role in muscle contraction at the neuromuscular junction. In the CNS, it is involved in cognitive functions such as memory and attention. Disruptions in acetylcholine levels or signaling are associated with various neurological disorders, including Alzheimer's disease and myasthenia gravis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Acetylcholine is a hormone.","correct":"✓ Acetylcholine is a neurotransmitter.","note":"Acetylcholine is a neurotransmitter, not a hormone."},{"incorrect":"✗ Acetylcholine is responsible for all brain functions.","correct":"✓ Acetylcholine plays a role in many brain functions, including memory and attention.","note":"Acetylcholine is not responsible for *all* brain functions, but it plays a significant role in several key functions."}],"priority":"★★☆"},"related_words":{"derivatives":["cholinergic (adjective: relating to or producing acetylcholine)","anticholinergic (adjective: blocking the action of acetylcholine)"],"phrases":["acetylcholine esterase inhibitors"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Acetylcholine' is a specialized term primarily used in the fields of biology, neuroscience, and medicine. It refers to a specific neurotransmitter that plays a key role in muscle contraction and various cognitive functions. Understanding this term requires a background in basic biology and an understanding of the nervous system. It's not commonly used in everyday conversation but is essential for those studying related scientific disciplines."},"example_sentences":[{"sentence":"The nerve impulses trigger the release of **acetylcholine**.","translation":"神経インパルスはアセチルコリンの放出を引き起こします。","type":"general","meaning_category":"neurotransmitter"},{"sentence":"**Acetylcholine** receptors are found throughout the nervous system.","translation":"アセチルコリン受容体は神経系全体に存在します。","type":"general","meaning_category":"neurotransmitter"},{"sentence":"Drugs that block **acetylcholine** can have side effects such as dry mouth.","translation":"アセチルコリンを遮断する薬は、口の渇きなどの副作用を引き起こす可能性があります。","type":"medical","meaning_category":"medical"}]}