{"word":"disproportionately weighted","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"不均衡に重み付けされた、偏って重み付けされた","english_definition":"Having an unfair or inappropriate influence or effect because of the weight or importance assigned to it.","examples":[{"sentence":"The algorithm's results were disproportionately weighted towards older data.","translation":"アルゴリズムの結果は、古いデータに不均衡に重み付けされていた。"},{"sentence":"In the survey, responses from urban areas were disproportionately weighted, skewing the overall results.","translation":"その調査では、都市部からの回答が偏って重み付けされていたため、全体的な結果が歪められた。"},{"sentence":"The project's success was disproportionately weighted on the performance of a single team.","translation":"プロジェクトの成功は、単一のチームのパフォーマンスに不均衡に重み付けされていた。"}],"collocations":["disproportionately weighted data","disproportionately weighted results","disproportionately weighted influence","disproportionately weighted towards","disproportionately weighted against"],"synonyms":["unevenly weighted","unfairly weighted","biased","skewed","unbalanced"],"antonyms":["proportionately weighted","evenly weighted","fairly weighted","balanced"]}],"etymology":{"value":"The term is formed by combining 'disproportionately' (in an unequal or unfair way) with 'weighted' (having a weight or importance assigned).","priority":"★★★"},"pronunciation":{"ipa":"/ˌdɪsprəˈpɔːrʃənətli ˈweɪtɪd/","syllables":"dis-pro-por-tion-ate-ly weight-ed"},"inflection":{"notes":"This is an adjective phrase; it does not inflect."},"usage_notes":{"explanation":"'Disproportionately weighted' is used to describe situations where certain factors, data points, or elements are given an unfair or inappropriate level of importance compared to others. This can lead to skewed results, biased outcomes, or an inaccurate representation of the overall picture. It is often used in statistical analysis, algorithms, decision-making processes, and evaluations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The data was disproportionate weighted.","correct":"The data was disproportionately weighted.","note":"'Disproportionate' is an adjective, but 'disproportionately' is the adverb needed to modify the verb 'weighted'."},{"incorrect":"The weighted was disproportionately.","correct":"The data was disproportionately weighted.","note":"The subject needs to be what is being weighted, not the act of weighting itself."}],"priority":"★★☆"},"related_words":{"derivatives":["disproportionate","disproportionately","weight","weighted","weighting"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'disproportionately weighted' indicates that some elements have been given more importance or influence than they deserve, leading to an imbalance or bias in the overall outcome. It is often used in technical or analytical contexts to describe how data or factors have been unfairly emphasized. Understanding this term requires a grasp of the concepts of proportion, weight, and bias."},"example_sentences":[{"sentence":"The model's predictions were unreliable because certain variables were disproportionately weighted.","translation":"特定の変数が不均衡に重み付けされていたため、モデルの予測は信頼できなかった。","type":"adjective","meaning_category":"biased analysis"},{"sentence":"The committee's decision was criticized for being disproportionately weighted towards the interests of larger corporations.","translation":"委員会の決定は、大企業の利益に偏って重み付けされていると批判された。","type":"adjective","meaning_category":"biased decision-making"},{"sentence":"The algorithm's fairness was compromised by the fact that some demographic groups' data was disproportionately weighted.","translation":"一部の人口統計グループのデータが不均衡に重み付けされていたという事実により、アルゴリズムの公平性が損なわれた。","type":"adjective","meaning_category":"algorithmic bias"}]}