{"word":"disproportionately-weighted","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"不均衡に重み付けされた、不相応に重点が置かれた","english_definition":"Having a weight or importance assigned in an unequal or imbalanced manner, often resulting in an unfair or skewed representation.","examples":[{"sentence":"The survey results were disproportionately-weighted towards urban areas, leading to inaccurate conclusions about the entire population.","translation":"調査結果は都市部に不均衡に重み付けされていたため、全人口に関する不正確な結論につながった。"},{"sentence":"The candidate's campaign disproportionately-weighted its efforts on social media, neglecting traditional outreach methods.","translation":"候補者のキャンペーンは、ソーシャルメディアに不相応に重点を置いており、従来の働きかけの方法を無視していた。"},{"sentence":"The disproportionately-weighted curriculum favored theoretical knowledge over practical skills.","translation":"不均衡に重点が置かれたカリキュラムは、実践的なスキルよりも理論的な知識を重視していた。"}],"collocations":["disproportionately-weighted towards (～に不均衡に重み付けされた)","disproportionately-weighted in favor of (～に有利に不均衡に重み付けされた)","disproportionately-weighted against (～に不利に不均衡に重み付けされた)"],"synonyms":["unequally-weighted","imbalanced","skewed","lopsided","unfairly-weighted"],"antonyms":["proportionately-weighted","equally-weighted","balanced","fairly-weighted"]}],"etymology":{"value":"The word is formed by combining \"disproportionately\" (in an unequal or imbalanced way) and \"weighted\" (having a weight or importance assigned).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪs.prəˈpɔːr.ʃənətli ˈweɪ.tɪd/","syllables":"dis-pro-por-tion-ate-ly weight-ed"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms like verbs or nouns. It can be modified by adverbs (e.g., very disproportionately-weighted)."},"usage_notes":{"explanation":"\"Disproportionately-weighted\" is used to describe situations where certain elements, factors, or groups are given more or less importance than they objectively deserve, leading to an imbalance or unfairness. It often implies that the weighting is intentional or results from a biased approach.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The data was disproportionately weight.","correct":"✓ The data was disproportionately weighted.","note":"\"Weighted\" is the past participle form of the verb \"to weight\" and should be used as an adjective."},{"incorrect":"✗ The study was disproportionately weighted, it was biased.","correct":"✓ The study was disproportionately weighted; therefore, it was biased. / ✓ Because the study was disproportionately weighted, it was biased.","note":"When using \"disproportionately weighted\" to describe a study or analysis, ensure proper sentence structure and logical connection."}],"priority":"★★☆"},"related_words":{"derivatives":["disproportionate (adjective: out of proportion; too large or too small in relation to something else)","disproportionately (adverb: in a way that is out of proportion)","weight (noun: a quantity used to express how heavy something is; importance or influence)","weight (verb: to assign a weight or importance to)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized or technical vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Disproportionately-weighted\" is a complex term used to describe situations where certain elements are given an unfair amount of importance or influence compared to others. This can lead to skewed results or biased outcomes. Understanding this term requires a good grasp of the meanings of \"disproportionate\" and \"weighted\" and how they combine to describe an imbalanced situation. It is often used in statistical analysis, research, and discussions of fairness and representation."},"example_sentences":[{"sentence":"The algorithm's results were disproportionately-weighted towards the preferences of its initial users.","translation":"アルゴリズムの結果は、初期ユーザーの好みに不均衡に重み付けされていた。","type":"adjective","meaning_category":"imbalanced influence"},{"sentence":"The committee's decision was criticized for being disproportionately-weighted in favor of the larger corporations.","translation":"委員会の決定は、大企業に有利に不均衡に重み付けされているとして批判された。","type":"adjective","meaning_category":"unfair advantage"},{"sentence":"The news coverage was disproportionately-weighted towards sensational stories, neglecting important but less exciting issues.","translation":"ニュース報道は、扇情的な記事に不均衡に重点が置かれ、重要だが刺激の少ない問題を無視していた。","type":"adjective","meaning_category":"skewed representation"}]}