{"word":"spirillotropism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"らせん状に向かう屈性。植物の根や茎が、らせんを描くように成長する現象。","english_definition":"The spiraling or helical growth movement of a plant organ, such as a root or stem.","examples":[{"sentence":"Spirillotropism can be observed in the climbing stems of certain vines.","translation":"らせん状に向かう屈性は、特定のつる植物の巻き付く茎に見られる。"},{"sentence":"The roots exhibited spirillotropism as they grew through the soil.","translation":"根は土壌中を成長するにつれて、らせん状に向かう屈性を示した。"}],"collocations":["exhibit spirillotropism","observe spirillotropism","root spirillotropism","stem spirillotropism"],"synonyms":["circumnutation","twining","helical growth"],"antonyms":[]}],"etymology":{"value":"「spirillo-」（らせん）+「tropism」（屈性）の合成語。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌspaɪˈrɪləˌtroʊpɪzəm/","syllables":"spi-ril-lo-tro-pi-zem"},"inflection":{"noun_plural":"spirillotropisms"},"usage_notes":{"explanation":"Spirillotropism is a type of tropism, which is a directional growth response to a stimulus. In spirillotropism, the stimulus is often gravity or contact with a support, causing the plant organ to grow in a spiral pattern. It is commonly observed in climbing plants that use tendrils or stems to attach to supports.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The plant showed spirillotropism due to the light.","correct":"The plant showed phototropism due to the light.","note":"Spirillotropism is usually in response to gravity or touch, not light. Phototropism is the response to light."}],"priority":"★★☆"},"related_words":{"derivatives":["spirillotropic"],"related_terms":["tropism","phototropism","geotropism","thigmotropism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Spirillotropism is a specialized term in botany that describes the spiral growth pattern of plant organs. It is most relevant in the context of plant physiology and developmental biology. Understanding this term requires a background in plant sciences.","priority":"★★☆"},"example_sentences":[{"sentence":"The beanstalk's spirillotropism allowed it to climb the trellis efficiently.","translation":"その豆の木のらせん状に向かう屈性によって、効率的に格子垣を登ることができた。","type":"general","meaning_category":"general"},{"sentence":"Researchers are studying the genetic factors that influence spirillotropism in Arabidopsis thaliana.","translation":"研究者たちは、シロイヌナズナにおけるらせん状に向かう屈性に影響を与える遺伝的要因を研究している。","type":"scientific","meaning_category":"scientific"}]}