{"word":"histotomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"組織切片法、組織切開術","english_definition":"The dissection or cutting of tissues for microscopic examination.","examples":[{"sentence":"Histotomy is an essential technique in pathology for diagnosing diseases.","translation":"組織切片法は、病気を診断するための病理学における不可欠な技術です。"},{"sentence":"The histotomy revealed abnormalities in the cellular structure.","translation":"組織切開術により、細胞構造の異常が明らかになりました。"}],"collocations":["perform histotomy","histotomy sample","serial histotomy"],"synonyms":["tissue sectioning","microtomy"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'histos' (tissue) and 'tome' (cutting).","priority":"★★★"},"pronunciation":{"ipa":"/hɪˈstɒtəmi/","syllables":"his-tot-o-my"},"inflection":{"noun_plural":"histotomies"},"usage_notes":{"explanation":"Histotomy is a specialized technique used to prepare tissue samples for microscopic examination. It involves carefully cutting thin sections of tissue, which are then stained and mounted on slides for analysis. This process is crucial for diagnosing diseases and studying tissue structures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed a histotomy on the patient.","correct":"✓ The doctor performed a biopsy, and the sample was sent for histotomy.","note":"Histotomy is the process of cutting the tissue, not a procedure performed directly on a patient. A biopsy is performed on the patient, and then the tissue sample undergoes histotomy."}],"priority":"★★☆"},"related_words":{"derivatives":["histotome (noun: a microtome used for histotomy)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Histotomy is a technical term used in the field of pathology and histology. It refers to the process of cutting thin sections of biological tissue for microscopic examination. Understanding this term requires familiarity with basic concepts in biology and medicine. It is typically encountered in scientific literature or medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The pathologist used histotomy to prepare the tissue sample for analysis.","translation":"病理医は組織切片法を用いて、分析のために組織サンプルを準備しました。","type":"noun","meaning_category":"組織切片法"},{"sentence":"Detailed histotomy of the tumor revealed its cellular composition.","translation":"腫瘍の詳細な組織切開術により、その細胞組成が明らかになりました。","type":"noun","meaning_category":"組織切開術"}]}