{"word":"tranquilization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"鎮静、精神安定","english_definition":"The act of making someone calm and free from anxiety or agitation; the state of being tranquilized.","examples":[{"sentence":"The doctor recommended tranquilization to help the patient cope with severe anxiety.","translation":"医師は、患者が重度の不安に対処できるように、鎮静を勧めた。"},{"sentence":"The tranquilization of the animals was necessary before they could be safely transported.","translation":"動物を安全に輸送する前に、鎮静処置が必要だった。"}],"collocations":["chemical tranquilization (薬物による鎮静)","forced tranquilization (強制的な鎮静)","veterinary tranquilization (獣医による鎮静)"],"synonyms":["sedation","calming","soothing","pacification","relaxation"],"antonyms":["agitation","excitation","stimulation","arousal"]},{"part_of_speech":"noun","definition":"(動物の)麻酔、鎮静","english_definition":"The administration of a tranquilizer to an animal, often for medical or handling purposes.","examples":[{"sentence":"The zoo staff used tranquilization to safely examine the injured lion.","translation":"動物園の職員は、負傷したライオンを安全に検査するために鎮静麻酔を使用した。"},{"sentence":"Tranquilization is a common practice in wildlife management.","translation":"鎮静麻酔は、野生動物管理において一般的な慣行である。"}],"collocations":["dart tranquilization (吹き矢による鎮静)","remote tranquilization (遠隔鎮静)","wildlife tranquilization (野生動物の鎮静)"],"synonyms":["anesthesia","narcosis","sedation"],"antonyms":["revival","stimulation"]}],"etymology":{"value":"From \"tranquilize\" + \"-ation\". \"Tranquilize\" comes from the Latin \"tranquillus\" (quiet, calm).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtræŋkwɪlaɪˈzeɪʃən/","syllables":"tran·quil·i·za·tion"},"inflection":{"noun_plural":"tranquilizations"},"usage_notes":{"explanation":"\"Tranquilization\" refers to the process of inducing a state of calmness or reduced anxiety, often through the use of medication (tranquilizers). It can be used in the context of humans or animals. In medical settings, it is used to manage anxiety or agitation. In veterinary and wildlife management, it is used to safely handle or treat animals. The term implies a deliberate action to reduce someone's or something's level of excitement or distress.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tranquilization was very tranquil.","correct":"✓ The tranquilization was very effective.","note":"\"Tranquil\" describes a state of calmness, while \"tranquilization\" is the *process* of achieving that state. Use \"effective\" or similar words to describe the success of the tranquilization process."},{"incorrect":"✗ He needs a tranquilization.","correct":"✓ He needs tranquilization.","note":"\"Tranquilization\" is a non-count noun, so it doesn't usually take an indefinite article (a/an)."}],"priority":"★★☆"},"related_words":{"derivatives":["tranquilize (verb: to make calm)","tranquilizer (noun: a drug used to reduce anxiety)","tranquil (adjective: calm, peaceful)","tranquilly (adverb: in a calm manner)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"tranquilization\" is a formal term referring to the process of making someone or something calm, often through the use of medication. It is commonly used in medical, veterinary, and wildlife management contexts. Understanding the word requires a good vocabulary and an understanding of related concepts such as sedation and anxiety management. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The patient underwent tranquilization before the surgery to reduce anxiety.","translation":"患者は不安を軽減するために手術前に鎮静処置を受けた。","type":"noun","meaning_category":"鎮静"},{"sentence":"The wildlife biologist used dart tranquilization to capture the bear for relocation.","translation":"野生生物学者は、クマを移動させるために吹き矢による鎮静麻酔を使用した。","type":"noun","meaning_category":"麻酔"}]}