{"word":"SI","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"国際単位系","english_definition":"The International System of Units (Système International d'Unités), the modern form of the metric system and the world's most widely used system of measurement.","examples":[{"sentence":"The SI system is used by scientists worldwide.","translation":"SI単位系は世界中の科学者によって使用されています。"},{"sentence":"The kilogram is the SI unit of mass.","translation":"キログラムは質量のSI単位です。"}],"collocations":["SI unit","SI base unit","SI derived unit","use SI units","convert to SI units"],"synonyms":["metric system","International System of Units"],"antonyms":[]}],"etymology":{"value":"An abbreviation of the French name Système International d'Unités (International System of Units).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛsˈaɪ/","syllables":"es-eye"},"inflection":{"notes":"It is an acronym and does not have plural forms."},"usage_notes":{"explanation":"SI is the standard system of measurement used in science, technology, and most countries around the world. It is based on seven base units: the meter (length), kilogram (mass), second (time), ampere (electric current), kelvin (thermodynamic temperature), mole (amount of substance), and candela (luminous intensity). All other SI units are derived from these base units.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Use S.I. units.","correct":"✓ Use SI units.","note":"SI is an acronym, not an initialism, so periods are not used between the letters."},{"incorrect":"✗ SI units are meters, kilograms, and seconds.","correct":"✓ SI units are metres, kilograms, and seconds.","note":"Be careful with spelling. In British English, the unit of length is spelled 'metre', while in American English, it is spelled 'meter'."}],"priority":"★★☆"},"related_words":{"derivatives":["None"],"phrasal_verbs":["None"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent in scientific and technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"SI stands for the International System of Units, which is the standard system of measurement used globally in science, technology, and commerce. It's based on seven fundamental units, like meters for length and kilograms for mass, from which all other units are derived. Understanding SI is crucial for anyone working in technical fields or reading scientific literature. While the term itself is relatively simple, its application and the complexity of derived units can make it a more advanced topic.","priority":"★★☆"},"example_sentences":[{"sentence":"Scientists use the **SI** system for accurate measurements.","translation":"科学者は正確な測定のためにSI単位系を使用します。","type":"noun","meaning_category":"国際単位系"},{"sentence":"The **SI** unit of time is the second.","translation":"時間のSI単位は秒です。","type":"noun","meaning_category":"国際単位系"}]}