{"word":"quadripartitely","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"四分割に、四者間で、四部構成で","english_definition":"In a quadripartite manner; divided into four parts; involving four parties.","examples":[{"sentence":"The agreement was quadripartitely negotiated between the four nations.","translation":"その合意は4か国間で四者間交渉された。"},{"sentence":"The document was structured quadripartitely, with each section addressing a different aspect.","translation":"その文書は四部構成で、各セクションが異なる側面を取り扱っていた。"}],"collocations":["quadripartite agreement (四者間合意)","quadripartite negotiation (四者間交渉)","quadripartite structure (四部構成)"],"synonyms":["fourfold","in four parts","among four parties"],"antonyms":["bipartitely","tripartitely"]}],"etymology":{"value":"From 'quadripartite' (adjective, meaning divided into four parts or involving four parties) + '-ly' (suffix forming adverbs of manner). 'Quadripartite' itself comes from Latin 'quadripartitus' (divided into four), from 'quadri-' (four) + 'partitus' (divided).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkwɒdrɪˈpɑː(r)taɪtli/","syllables":"quad-ri-par-tite-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Quadripartitely' is an adverb that describes something done in a four-part manner or involving four parties. It's a relatively uncommon word, typically used in formal or technical contexts, such as legal, political, or academic writing. It specifies that something is divided into four sections or that four different entities are involved in an action or agreement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The project was quadripartitely, involving five companies.","correct":"✓ The project was quadripartite, involving five companies.","note":"'Quadripartite' describes something involving four parties. If there are five, a different term is needed, or the sentence should be rephrased. The adverb 'quadripartitely' describes the *manner* in which something is done, not the number of parties involved."},{"incorrect":"✗ The book was quadripartitely, with each part being very long.","correct":"✓ The book was divided quadripartitely, with each part being very long.","note":"The adverb 'quadripartitely' needs a verb to modify. 'The book was quadripartitely' is grammatically incorrect. You need to say 'The book was divided quadripartitely' or similar."}],"priority":"★☆☆"},"related_words":{"derivatives":["quadripartite (adjective)","quadripartition (noun)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'quadripartitely' is a highly formal and infrequent adverb. It is used to describe something that is done in a four-part manner or involving four parties. Due to its rarity and specific meaning, it is typically encountered in specialized or academic texts. Understanding the root word 'quadripartite' (divided into four parts) is essential for comprehending its meaning."},"example_sentences":[{"sentence":"The research was conducted quadripartitely, with each team focusing on a specific area.","translation":"その研究は四分割で行われ、各チームが特定の分野に焦点を当てた。","type":"general","meaning_category":"四分割に"},{"sentence":"The funds were distributed quadripartitely among the four beneficiary organizations.","translation":"その資金は、4つの受益団体に四者間で分配された。","type":"general","meaning_category":"四者間で"}]}