{"word":"criminously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"犯罪的に、罪深く","english_definition":"In a criminal or wicked manner.","examples":[{"sentence":"He acted criminously, showing a complete disregard for the law.","translation":"彼は犯罪的に行動し、法を完全に無視した。"},{"sentence":"The evidence suggests that the company criminously concealed the safety defects.","translation":"証拠は、その会社が安全上の欠陥を犯罪的に隠蔽したことを示唆している。"}],"collocations":["act criminously","behave criminously","criminously conceal","criminously neglect"],"synonyms":["wickedly","illegally","unlawfully","feloniously","nefariously","sinfully"],"antonyms":["lawfully","legally","righteously","morally"]}],"etymology":{"value":"Derived from the adjective 'criminous', which comes from the Latin word 'criminosus', meaning 'full of crime' or 'reproachful'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɪmɪnəsli/","syllables":"crim-i-nous-ly"},"inflection":{"notes":"Adverbs do not inflect; this word does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Criminously' is used to describe actions or behaviors that are not only wrong but also involve a violation of the law. It emphasizes the criminal nature of the act. It is often used in legal or formal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He criminously felt sad about his actions.","correct":"✓ He felt criminally responsible for his actions.","note":"'Criminously' describes the manner of an action, not a feeling. Use 'criminally responsible' for feelings of guilt related to a crime."},{"incorrect":"✗ The situation was criminously bad.","correct":"✓ The situation was criminally bad.","note":"'Criminously' describes an action, not a state or situation. Use 'criminally' to describe the extent to which something is bad in a criminal context."}],"priority":"★★☆"},"related_words":{"derivatives":["crime (noun: an illegal act)","criminal (noun: a person who commits a crime; adjective: relating to crime)","criminous (adjective: involving or characterized by crime; wicked)","criminality (noun: criminal behavior or activities)"],"phrases":["criminally negligent (adjective: failing to take reasonable care to avoid causing harm, resulting in criminal charges)"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Criminously' is an advanced word used in formal or legal contexts to describe actions done in a criminal or wicked manner. It is not commonly used in everyday conversation. Understanding its use requires familiarity with legal and formal language."},"example_sentences":[{"sentence":"The CEO was accused of criminously mismanaging the company's funds.","translation":"そのCEOは、会社の資金を犯罪的に不正管理したとして告発された。","type":"adverb","meaning_category":"犯罪的に"},{"sentence":"They criminously ignored the safety regulations, leading to the accident.","translation":"彼らは犯罪的に安全規制を無視し、事故につながった。","type":"adverb","meaning_category":"犯罪的に"},{"sentence":"The documents revealed that the officials had criminously conspired to defraud the government.","translation":"その文書は、当局者が政府を欺くために犯罪的に共謀していたことを明らかにした。","type":"adverb","meaning_category":"犯罪的に"}]}