{"word":"equivocation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"曖昧な言い方、言葉の濁し、ごまかし、両義性","english_definition":"the use of ambiguous language to conceal the truth or avoid committing to a particular point of view; ambiguity.","examples":[{"sentence":"His equivocation on the issue made it difficult to understand his true stance.","translation":"その問題に関する彼の曖昧な言い方は、彼の本当の立場を理解することを困難にした。"},{"sentence":"The politician's equivocation allowed him to appeal to different groups without alienating any.","translation":"その政治家の言葉の濁しは、誰をも遠ざけることなく、様々なグループにアピールすることを可能にした。"},{"sentence":"Equivocation is often used in politics and diplomacy.","translation":"曖昧な言い方は、政治や外交でよく使われる。"}],"collocations":["use equivocation","resort to equivocation","avoid equivocation","political equivocation","moral equivocation"],"synonyms":["ambiguity","vagueness","evasion","prevarication","double-talk","indecision","uncertainty"],"antonyms":["clarity","candor","frankness","directness","honesty","certainty"]}],"etymology":{"value":"Late Middle English: from late Latin aequivocation-, aequivocatio, from aequivocare ‘call by the same name’ (see equivocate).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌkwɪvəˈkeɪʃən/","syllables":"e-quiv-o-ca-tion"},"inflection":{"noun_plural":"equivocations"},"usage_notes":{"explanation":"'Equivocation' refers to the use of language that is open to multiple interpretations, often intentionally, in order to mislead or avoid making a clear statement. It can involve using words or phrases that have more than one meaning, or speaking in a way that is intentionally vague or ambiguous. While sometimes used for humorous effect, it is more often employed to deceive or evade responsibility. It is a common tactic in politics, diplomacy, and situations where one wants to avoid taking a firm position or revealing their true intentions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He made an equivocation about his age.","correct":"✓ He equivocated about his age.","note":"'Equivocation' is a noun, so it refers to the act of being equivocal. 'Equivocate' is the verb, meaning to speak in an equivocal way."},{"incorrect":"✗ The equivocation was very clear.","correct":"✓ The statement was very clear. / ✓ The equivocation was very subtle.","note":"Equivocation, by its nature, is not clear. If something is clear, it is not an equivocation. The opposite of clarity is what characterizes equivocation."}],"priority":"★★☆"},"related_words":{"derivatives":["equivocate (verb)","equivocal (adjective)","equivocally (adverb)"],"idioms_phrases":["no equivocations (明確に、ごまかしなしに)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Equivocation' is a formal term referring to the use of ambiguous language, often to conceal the truth or avoid commitment. It's not a word used in everyday conversation, but you might encounter it in discussions of politics, ethics, or rhetoric. Understanding this word helps in analyzing arguments and identifying potential deception or evasion in communication."},"example_sentences":[{"sentence":"The witness's **equivocation** made it difficult to determine what really happened.","translation":"証人の曖昧な言い方は、何が本当に起こったのかを判断することを困難にした。","type":"noun","meaning_category":"曖昧な言い方"},{"sentence":"The company was accused of **equivocation** in its advertising.","translation":"その会社は、広告における言葉の濁しで告発された。","type":"noun","meaning_category":"ごまかし"},{"sentence":"His statement was full of **equivocation**, making it impossible to understand his true intentions.","translation":"彼の声明は曖昧な言い方で満ちており、彼の真の意図を理解することは不可能だった。","type":"noun","meaning_category":"曖昧な言い方"}]}