{"word":"emasculating","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(男性を)自信喪失させる、男らしさを奪う、去勢するような","english_definition":"making a man feel less masculine or confident; depriving of virility; castrating.","examples":[{"sentence":"He found the criticism deeply emasculating.","translation":"彼はその批判が非常に自信を喪失させるものだと感じた。"},{"sentence":"The company's policies were seen as emasculating to male employees.","translation":"その会社の方針は、男性従業員の男らしさを奪うものと見なされた。"},{"sentence":"The experience was emasculating, leaving him feeling helpless.","translation":"その経験は去勢的であり、彼は無力感を感じた。"}],"collocations":["emasculating experience (自信喪失させる経験)","emasculating criticism (自信喪失させる批判)","emasculating effect (自信喪失効果)","feel emasculated (自信を喪失したと感じる)"],"synonyms":["debilitating","weakening","humiliating","disempowering","unmanning"],"antonyms":["empowering","strengthening","affirming","validating"]},{"part_of_speech":"verb","definition":"(動詞 emasculate の現在分詞形) 自信喪失させる、男らしさを奪う、去勢する","english_definition":"present participle of the verb 'emasculate': to deprive a man of his male role or identity; to castrate.","examples":[{"sentence":"The constant belittling was emasculating him.","translation":"絶え間ない見下しが彼の自信を喪失させていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the verb 'emasculate,' which comes from Latin 'ēmasculātus,' past participle of 'ēmasculāre' meaning 'to castrate,' from 'ē-' (out) + 'masculus' (male).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈmæskjʊleɪtɪŋ/","syllables":"e-mas-cu-la-ting"},"inflection":{"notes":"This is the present participle and adjective form of the verb 'emasculate.'"},"usage_notes":{"explanation":"'Emasculating' is a strong word that implies a significant loss of confidence, power, or masculinity, particularly in men. It can describe experiences, criticisms, or policies that make someone feel less of a man. It is often used figuratively to describe anything that weakens or undermines someone's sense of self-worth or authority. Be mindful of the potentially offensive nature of this word, especially when used in sensitive contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was very emasculating for women.","correct":"✓ The movie was very disempowering for women.","note":"'Emasculating' specifically refers to the loss of masculinity or male confidence. For women, 'disempowering' or 'demeaning' would be more appropriate. While it can be used metaphorically for women, it's less common and can be misconstrued."},{"incorrect":"✗ He felt emasculated after winning the lottery.","correct":"✓ He felt overwhelmed after winning the lottery.","note":"'Emasculated' implies a loss of power or confidence, often due to a perceived threat to one's masculinity. Winning the lottery would not typically cause this feeling. 'Overwhelmed' or 'excited' would be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["emasculate (verb)","emasculation (noun)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'emasculating' is a complex term that describes something that makes a man feel less masculine, confident, or powerful. It often implies a loss of control or a feeling of being undermined. This word is not commonly used in everyday conversation and is more often found in academic or literary contexts where nuanced descriptions of power dynamics are required. It's important to use this word carefully, as it can be considered offensive or insensitive if used inappropriately."},"example_sentences":[{"sentence":"The public humiliation was an emasculating experience for him.","translation":"公衆の面前での屈辱は、彼にとって自信喪失させる経験だった。","type":"adjective","meaning_category":"自信喪失させる"},{"sentence":"He felt emasculated by his inability to provide for his family.","translation":"彼は家族を養うことができないことで、男らしさを奪われたと感じた。","type":"adjective","meaning_category":"男らしさを奪う"},{"sentence":"The constant criticism from his boss was slowly emasculating him.","translation":"上司からの絶え間ない批判が、徐々に彼の自信を喪失させていた。","type":"verb (present participle)","meaning_category":"自信喪失させる"}]}