{"word":"ungraded","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"未採点の、評価されていない","english_definition":"not having been given a grade or mark; not assessed for quality or achievement.","examples":[{"sentence":"The teacher allowed students to submit ungraded homework for practice.","translation":"先生は生徒たちが練習のために未採点の宿題を提出することを許可した。"},{"sentence":"This assignment is ungraded, but it's important for your learning.","translation":"この課題は未採点ですが、あなたの学習にとって重要です。"},{"sentence":"We offer both graded and ungraded options for this course.","translation":"このコースでは、採点されるオプションと採点されないオプションの両方を提供しています。"}],"collocations":["ungraded assignment","ungraded homework","ungraded paper","ungraded quiz","ungraded work","ungraded exercise"],"synonyms":["unassessed","unevaluated","unmarked"],"antonyms":["graded","assessed","evaluated","marked"]}],"etymology":{"value":"The word \"ungraded\" is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"graded\". \"Graded\" comes from the word \"grade\", which originates from the Latin word \"gradus\" meaning \"step\" or \"degree\".","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈɡreɪdɪd/","syllables":"un-grad-ed"},"inflection":{"notes":"As an adjective, \"ungraded\" does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Ungraded\" is commonly used in educational contexts to describe assignments, activities, or courses that are not formally assessed or given a specific grade. This approach is often used to encourage learning and exploration without the pressure of evaluation. It can also refer to materials that are in the process of being assessed but have not yet received a final grade.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The student was ungraded in the class.","correct":"✓ The student's work was ungraded in the class.","note":"\"Ungraded\" describes the assignment or work, not the student themselves. It is more accurate to say that the student's work was ungraded, rather than the student being ungraded."},{"incorrect":"✗ Ungraded is better than graded.","correct":"✓ Ungraded assignments can be beneficial for certain learning purposes.","note":"While ungraded assignments can have benefits, it's a subjective opinion whether they are universally better than graded assignments. It depends on the learning goals and context."}],"priority":"★★☆"},"related_words":{"derivatives":["ungradable"],"related":["grade","grading","assessment","evaluation","marking"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"ungraded\" is used to describe something, usually schoolwork, that doesn't get a letter grade or a number score. It's often used when the goal is to practice and learn without the pressure of being judged. You might see it used for homework that's just for practice, or for a class where you get feedback but not a grade. It's the opposite of \"graded,\" which means something does get a formal score."},"example_sentences":[{"sentence":"The professor offered an ungraded version of the course for students who wanted to learn without the pressure of grades.","translation":"教授は、成績のプレッシャーなしに学びたい学生のために、採点されないバージョンのコースを提供した。","type":"adjective","meaning_category":"未採点の"},{"sentence":"The students appreciated the opportunity to complete ungraded practice problems before the exam.","translation":"学生たちは試験前に未採点の練習問題を解く機会をありがたく思った。","type":"adjective","meaning_category":"未採点の"},{"sentence":"The teacher explained that the ungraded assignments were designed to help students identify their strengths and weaknesses.","translation":"先生は、未採点の課題は生徒たちが自分の長所と短所を特定するのに役立つように設計されていると説明した。","type":"adjective","meaning_category":"未採点の"}]}