{"word":"Anti-Nebraska","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"反ネブラスカの、ネブラスカ法に反対する","english_definition":"Opposed to the Nebraska Act.","examples":[{"sentence":"The Anti-Nebraska movement gained momentum in the North.","translation":"反ネブラスカ運動は北部で勢いを増した。"}],"collocations":[],"synonyms":["Opposed to the Kansas-Nebraska Act"],"antonyms":["Pro-Nebraska"]},{"part_of_speech":"noun","definition":"反ネブラスカ派、ネブラスカ法に反対する人々","english_definition":"A person or group opposed to the Nebraska Act.","examples":[{"sentence":"Anti-Nebraska politicians formed the Republican Party.","translation":"反ネブラスカの政治家たちは共和党を結成した。"}],"collocations":[],"synonyms":["Opponent of the Kansas-Nebraska Act"],"antonyms":["Pro-Nebraska activist"]}],"etymology":{"value":"The term 'Anti-Nebraska' arose in the context of the Kansas-Nebraska Act of 1854. This act allowed residents of the Kansas and Nebraska territories to decide on the issue of slavery through popular sovereignty. Those who opposed the expansion of slavery and the Act itself were labeled 'Anti-Nebraska'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænti nəˈbræskə/","syllables":"An-ti-Ne-bras-ka"},"inflection":{},"usage_notes":{"explanation":"The term 'Anti-Nebraska' is primarily historical, referring to the political opposition to the Kansas-Nebraska Act of 1854. This Act effectively repealed the Missouri Compromise, which had previously limited the expansion of slavery. The Anti-Nebraska movement was significant in the formation of the Republican Party, which opposed the expansion of slavery.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Nebraska Act","Kansas-Nebraska Act","Republican Party","Free Soil Party"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'Anti-Nebraska' is a historical term referring to opposition to the Kansas-Nebraska Act of 1854, which allowed residents of those territories to decide on the issue of slavery. Understanding this term requires knowledge of 19th-century American political history, particularly the debates surrounding slavery and states' rights. The 'Anti-Nebraska' movement was a key factor in the formation of the Republican Party, which opposed the expansion of slavery."},"example_sentences":[{"sentence":"The Anti-Nebraska coalition included former Whigs and Free Soilers.","translation":"反ネブラスカ連合には、かつてのホイッグ党員と自由土地党員が含まれていた。","type":"noun","meaning_category":"反ネブラスカ派"},{"sentence":"An Anti-Nebraska stance was common among abolitionists.","translation":"反ネブラスカの立場は、奴隷制度廃止論者の間で一般的だった。","type":"adjective","meaning_category":"反ネブラスカの"}]}