{"word":"chaffingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"からかうように、冗談めかして","english_definition":"In a teasing or mocking manner; playfully.","examples":[{"sentence":"He chaffingly accused her of being late, even though he was the one who had kept her waiting.","translation":"彼は彼女をからかうように遅刻だと責めたが、実は彼女を待たせていたのは彼の方だった。"},{"sentence":"'Oh, you think you're so clever,' she said chaffingly, nudging him with her elbow.","translation":"「あら、自分はとても賢いと思っているのね」と彼女はからかうように言い、肘で彼を軽く突いた。"}],"collocations":["speak chaffingly","tease chaffingly","smile chaffingly"],"synonyms":["teasingly","mockingly","banteringly","jokingly","playfully"],"antonyms":["seriously","earnestly","solemnly"]}],"etymology":{"value":"Derived from the verb 'chaff', meaning to tease or mock in a good-natured way, with the addition of the suffix '-ingly' to form an adverb.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtʃæfɪŋli/","syllables":"chaf-fing-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Chaffingly' describes an action done in a light-hearted, teasing manner. It implies gentle mockery or playful banter, without the intention to cause harm or offense. The tone is usually friendly and humorous.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He said it chaffingly, so I was very offended.","correct":"✓ He said it teasingly, but I was still a little offended.","note":"'Chaffingly' implies a lack of serious intent to offend. If someone is genuinely offended, 'teasingly' or another adverb might be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["chaff (noun, verb)","chaffing (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a relatively rare word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chaffingly' is a relatively uncommon word that describes an action performed in a teasing or playfully mocking manner. It's used to convey a light-hearted and humorous tone, suggesting that the teasing is not meant to be taken seriously. Because of its rarity, it's more likely to be encountered in literature or formal writing rather than everyday conversation."},"example_sentences":[{"sentence":"She looked at him chaffingly, a smile playing on her lips.","translation":"彼女はからかうように彼を見て、唇に笑みを浮かべた。","type":"adverb","meaning_category":"teasingly"},{"sentence":"The old friends chaffingly reminisced about their youthful misadventures.","translation":"旧友たちは冗談めかして若き日の冒険を懐かしんだ。","type":"adverb","meaning_category":"playfully"}]}