{"word":"one-party","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"一党の、一党による、一党支配の","english_definition":"relating to or characteristic of a political system in which one political party holds all the power.","examples":[{"sentence":"The country is a one-party state.","translation":"その国は一党独裁国家だ。"},{"sentence":"The election was criticized for being held under a one-party system.","translation":"その選挙は一党制下で行われたとして批判された。"},{"sentence":"The government is dominated by one-party rule.","translation":"政府は一党支配によって支配されている。"}],"collocations":["one-party system (一党制)","one-party rule (一党支配)","one-party state (一党独裁国家)","one-party government (一党政府)"],"synonyms":["authoritarian","totalitarian","undemocratic"],"antonyms":["multi-party","democratic","pluralistic"]}],"etymology":{"value":"'One' + 'party'. Describes a political system with a single dominant party.","priority":"★★★"},"pronunciation":{"ipa":"/ˌwʌn ˈpɑːrti/","syllables":"one-par-ty"},"inflection":{"notes":"It is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'One-party' is typically used to describe political systems where only one political party is legally allowed to hold power, or where, although other parties may technically exist, the dominant party maintains control through various means. It is often associated with authoritarian or undemocratic regimes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The country has a one party system.","correct":"✓ The country has a one-party system.","note":"Hyphenate 'one-party' when used as an adjective before a noun."},{"incorrect":"✗ The government is one party.","correct":"✓ The government is one-party.","note":"Using it as an adjective to describe the nature of the government."}],"priority":"★★☆"},"related_words":{"derivatives":["party (名詞: 政党)","multiparty (形容詞: 複数政党の)","bipartisan (形容詞: 二大政党の)"],"phrases":["single-party system (単一政党制)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in political discussions.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'one-party' is used to describe a political system where one political party holds all or most of the power. It's often used in discussions about politics and government, particularly when talking about countries that are not democracies. Understanding this term is important for following news and discussions about international politics."},"example_sentences":[{"sentence":"The country transitioned from a one-party state to a multi-party democracy.","translation":"その国は一党独裁国家から複数政党制民主主義へと移行した。","type":"general","meaning_category":"一党支配の"},{"sentence":"Critics argue that the election was unfair due to the one-party dominance.","translation":"批評家たちは、一党支配のために選挙が不公平だったと主張している。","type":"general","meaning_category":"一党支配の"},{"sentence":"The one-party government implemented several controversial policies.","translation":"その一党政府はいくつかの物議を醸す政策を実施した。","type":"general","meaning_category":"一党支配の"}]}