{"word":"Ecophene","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生態学) ある生物種が、その生息地の特定の環境要因（温度、湿度、光など）に適応して生じた、遺伝的には同一だが表現型が異なる個体群。","english_definition":"(Ecology) A population or group of organisms within a species that exhibits distinct morphological or physiological differences as a result of adaptation to specific local environmental conditions. Ecophenes are genetically identical but phenotypically different.","examples":[{"sentence":"The coastal ecophene of this plant species exhibits greater salt tolerance than the inland ecophene.","translation":"この植物種の沿岸部のエコフェンは、内陸部のエコフェンよりも高い塩分耐性を示す。"},{"sentence":"Differences in leaf size and shape were observed between ecophenes of the same tree species growing at different altitudes.","translation":"異なる高度で生育する同じ樹種のエコフェン間で、葉のサイズと形状に違いが観察された。"}],"collocations":["coastal ecophene (沿岸エコフェン)","inland ecophene (内陸エコフェン)","altitude ecophene (高度エコフェン)","temperature ecophene (温度エコフェン)","humidity ecophene (湿度エコフェン)","light ecophene (光エコフェン)","phenotypic plasticity (表現型の可塑性)","environmental adaptation (環境適応)"],"synonyms":["phenotype","morphotype","environmental variant","plastic response"],"antonyms":["genotype","ecotype (遺伝的な適応を示す亜種)"]},{"part_of_speech":"noun","definition":"(より広義に) 環境要因によって誘導される、生物の可塑的な表現型変化。","english_definition":"(More broadly) A plastic phenotypic change in an organism induced by environmental factors.","examples":[{"sentence":"The change in fur color in arctic animals in response to seasonal changes in daylight is an example of an ecophene.","translation":"日照時間の季節変化に応じて北極圏の動物の毛皮の色が変化することは、エコフェンの一例である。"}],"collocations":["phenotypic plasticity (表現型の可塑性)","environmental influence (環境の影響)","developmental plasticity (発達可塑性)"],"synonyms":["plasticity","phenotypic variation","environmental modification"],"antonyms":["genetic determination"]}],"etymology":{"value":"ギリシャ語の 'eco-' (οἶκος, oikos, 「家、生息地」) + 'phene' (φαίνω, phainō, 「現れる、示す」) に由来。環境（生息地）によって現れる形質、という意味合い。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈiːkoʊˌfiːn/","syllables":"e-co-phene"},"inflection":{"notes":"複数形は ecophenes"},"usage_notes":{"explanation":"「**Ecophene**」は生態学の専門用語であり、一般的にはあまり使われません。ある生物種が、遺伝的には同一であるにもかかわらず、生息地の環境要因（温度、湿度、光など）の違いに適応した結果、異なる表現型を示す個体群を指します。重要なのは、これらの違いが遺伝的なものではなく、環境によって誘導されるということです。この現象は「表現型の可塑性」と呼ばれます。エコフェンは、同じ種であっても、生育環境によって外見や生理機能が異なることを示しています。より広義には、環境要因によって誘導される生物の可塑的な表現型変化全般を指すこともあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Ecophenes are different species that look alike.","correct":"✓ Ecophenes are individuals within the same species that look different due to environmental factors.","note":"Ecophenes are not different species, but variations within the same species. The key is that they are genetically identical but express different traits due to their environment."},{"incorrect":"✗ Ecophenes are caused by genetic mutations.","correct":"✓ Ecophenes are caused by environmental factors, not genetic mutations.","note":"The differences between ecophenes are due to phenotypic plasticity, not genetic changes."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["phenotype","genotype","ecotype","plasticity","environmental adaptation","morphology","physiology","ecology","evolution","natural selection"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 生態学の専門分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Ecophene**」は、生態学の分野で使われる専門用語です。ある生物種の中で、遺伝的には同じでも、育つ環境の違いによって見た目や性質が異なる個体群を指します。この違いは遺伝によるものではなく、環境への適応によって生じるものです。例えば、同じ種類の植物でも、日当たりの良い場所と日陰で育ったものでは葉の形が異なる場合があります。この単語を理解するには、生態学、遺伝学、表現型といった関連分野の知識が必要です。専門的な文脈以外ではほとんど使われません。"},"example_sentences":[{"sentence":"The water buttercup (*Ranunculus aquatilis*) exhibits different leaf forms depending on whether the leaves are submerged or floating, demonstrating ecophenic variation.","translation":"バイカモ（*Ranunculus aquatilis*）は、葉が水没しているか浮遊しているかによって異なる葉の形を示し、エコフェン的な変異を示している。","type":"noun","meaning_category":"生態学"},{"sentence":"Studies have shown that the size and shape of fish scales can vary depending on water temperature, representing an ecophene.","translation":"魚の鱗のサイズと形状は水温によって変化することが研究で示されており、これはエコフェンを表している。","type":"noun","meaning_category":"生態学"},{"sentence":"The different growth forms observed in *Potentilla glandulosa* at varying elevations are classic examples of ecophenes.","translation":"異なる標高で観察されるキジムシロ（*Potentilla glandulosa*）の異なる成長形態は、エコフェンの典型的な例である。","type":"noun","meaning_category":"生態学"}]}