{"word":"jugulation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"頸部切断、頸動脈の切断","english_definition":"The act of cutting the throat or severing the carotid artery.","examples":[{"sentence":"The jugulation of the prisoner was swift and brutal.","translation":"囚人の頸部切断は迅速かつ残忍だった。"},{"sentence":"The lion's jugulation of the gazelle ensured a quick kill.","translation":"ライオンがガゼルを頸部切断したことで、迅速な殺害が保証された。"}],"collocations":["attempted jugulation","successful jugulation","surgical jugulation (まれ)"],"synonyms":["strangulation","decapitation","throttling"],"antonyms":["revival","healing"]},{"part_of_speech":"noun","definition":"(比喩的に) 抑圧、鎮圧、根絶","english_definition":"(figuratively) The act of suppressing or eradicating something.","examples":[{"sentence":"The jugulation of free speech is a hallmark of totalitarian regimes.","translation":"言論の自由の抑圧は、全体主義体制の特徴である。"},{"sentence":"The government aimed for the jugulation of the rebellion.","translation":"政府は反乱の鎮圧を目指した。"}],"collocations":["jugulation of dissent","jugulation of opposition","jugulation of a problem"],"synonyms":["suppression","eradication","annihilation","elimination"],"antonyms":["promotion","encouragement","fostering"]}],"etymology":{"value":"Late Latin *iugulatio*, from Latin *iugulare* 'to cut the throat', from *iugulum* 'throat'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒʌɡjʊˈleɪʃən/","syllables":"jug-u-la-tion"},"inflection":{"noun_plural":"jugulations"},"usage_notes":{"explanation":"The word \"jugulation\" refers literally to the act of cutting the throat, specifically severing the carotid artery. Figuratively, it describes the suppression or eradication of something, often used in the context of authoritarian control or forceful elimination. The term is relatively uncommon and carries a strong connotation of violence or forceful suppression.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The jugulation of the problem was solved.","correct":"✓ The jugulation of the problem was achieved. / ✓ The problem was solved.","note":"\"Jugulation\" refers to the act of suppressing or eradicating, not solving. While you can achieve the jugulation of a problem, it's often better to use a more direct verb like \"solved\"."},{"incorrect":"✗ The jugulation was very painful.","correct":"✓ The jugulation caused extreme pain.","note":"\"Jugulation\" is the act itself; it doesn't experience pain. The person undergoing jugulation experiences pain."}],"priority":"★☆☆"},"related_words":{"derivatives":["jugulate (verb)"],"phrases":["attempted jugulation","successful jugulation"],"related_terms":["strangulation","suffocation","decapitation","eradication","suppression"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"jugulation\" is a formal and relatively rare term primarily referring to the act of cutting the throat or severing the carotid artery. It also has a figurative meaning, denoting the suppression or eradication of something. Due to its graphic and violent connotations, it is typically used in specific contexts, such as historical accounts of violence, discussions of authoritarian control, or in medical/anatomical descriptions. The word is uncommon in everyday language and is more likely to be encountered in academic or specialized texts."},"example_sentences":[{"sentence":"The historical records described the brutal jugulation of the captured enemies.","translation":"歴史的記録は、捕らえられた敵の残忍な頸部切断について記述していた。","type":"noun","meaning_category":"頸部切断"},{"sentence":"The dictator ordered the jugulation of all dissenting voices in the media.","translation":"独裁者はメディアにおけるすべての反対意見の抑圧を命じた。","type":"noun","meaning_category":"抑圧"}]}