{"word":"dicotyls","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"双子葉植物","english_definition":"A class of flowering plants characterized by having two cotyledons (seed leaves) in the seed, reticulate venation in the leaves, flower parts in multiples of four or five, and a vascular cambium.","examples":[{"sentence":"Roses, sunflowers, and oak trees are examples of dicotyls.","translation":"バラ、ヒマワリ、カシの木は双子葉植物の例です。"},{"sentence":"Dicotyls typically have a taproot system.","translation":"双子葉植物は通常、直根系を持っています。"}],"collocations":["dicotyl plant (双子葉植物)","dicotyl seedling (双子葉植物の苗)","eudicot (真正双子葉植物)"],"synonyms":["dicotyledons","magnoliopsida"],"antonyms":["monocotyls"]},{"part_of_speech":"noun","definition":"(分類学) 双子葉植物綱","english_definition":"(Taxonomy) A former class or subclass of flowering plants (Angiosperms) characterized by having two cotyledons in the seed. Now largely replaced by the term 'eudicots' within the broader dicot grouping.","examples":[{"sentence":"The dicotyls were traditionally separated from monocotyls based on several key characteristics.","translation":"双子葉植物は伝統的に、いくつかの重要な特徴に基づいて単子葉植物から区別されていました。"}],"collocations":["dicotyl classification (双子葉植物の分類)","dicotyl characteristics (双子葉植物の特徴)"],"synonyms":["dicotyledoneae"],"antonyms":["monocotyls"]}],"etymology":{"value":"Derived from the Greek words 'di-' (two) + 'kotyle' (seed leaf) + '-yl' (suffix indicating a group).","priority":"★★★"},"pronunciation":{"ipa":"/ˈdaɪkɒtɪlz/","syllables":"di-cot-yls"},"inflection":{"noun_plural":"dicotyls"},"usage_notes":{"explanation":"The term 'dicotyls' is somewhat outdated in modern botanical classification. The group is paraphyletic, meaning it does not include all descendants of a common ancestor. The term 'eudicots' (true dicotyls) is now more commonly used to refer to the monophyletic group that includes most of the traditional dicotyls. However, 'dicotyls' is still used informally and in some contexts to refer to plants with two cotyledons.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Dicotyls is a large group of plants.","correct":"✓ Dicotyls are a large group of plants.","note":"'Dicotyls' is a plural noun, so it takes a plural verb."},{"incorrect":"✗ Dicotyls have one cotyledon.","correct":"✓ Dicotyls have two cotyledons.","note":"Dicotyls are defined by having two cotyledons."}],"priority":"★★☆"},"related_words":{"derivatives":["dicotyledon (noun: a plant with two cotyledons)","dicotyledonous (adjective: having two cotyledons)","eudicot (noun: true dicotyl)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, mainly used in scientific or educational contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Dicotyls' refers to a broad group of flowering plants characterized by having two seed leaves (cotyledons). While the term is still used, modern botany often prefers 'eudicots' for a more precise classification. Understanding this term is helpful in the context of plant biology and botany. It is important to note that the term dicotyls is becoming less common in scientific literature due to advances in phylogenetic studies. However, it remains useful for general understanding of plant classification.","priority":"★★☆"},"example_sentences":[{"sentence":"Most broadleaf trees are dicotyls.","translation":"ほとんどの広葉樹は双子葉植物です。","type":"noun","meaning_category":"双子葉植物"},{"sentence":"The vascular bundles in dicotyls are arranged in a ring.","translation":"双子葉植物の維管束は環状に配置されています。","type":"noun","meaning_category":"双子葉植物"},{"sentence":"Eudicots represent the majority of plant species previously classified as dicotyls.","translation":"真正双子葉植物は、以前は双子葉植物として分類されていた植物種の大部分を占めています。","type":"noun","meaning_category":"双子葉植物"}]}