{"word":"Bhudevi","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Hinduism) The Hindu goddess of the Earth. She is the divine wife of Varaha, an avatar of Vishnu.","english_definition":"In Hinduism, Bhudevi is the goddess of the Earth and the divine wife of Varaha, an avatar of Vishnu.","examples":[{"sentence":"Bhudevi is often depicted alongside Varaha in Hindu art.","translation":"ブーデーヴィーはヒンドゥー教の芸術において、ヴァラーハと共に描かれることが多いです。"},{"sentence":"Devotees pray to Bhudevi for fertility and prosperity.","translation":"信者たちは、豊穣と繁栄を祈ってブーデーヴィーに祈ります。"}],"collocations":["Varaha and Bhudevi","worship of Bhudevi","Bhudevi temple"],"synonyms":["Prithvi","Bhoomi","Earth Goddess"],"antonyms":[]}],"etymology":{"value":"From Sanskrit भूदेवी (bhūdevī), meaning \"Goddess of the Earth.\"  भू (bhū) means \"earth\" and देवी (devī) means \"goddess\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈbuːˌdeɪvi/","syllables":"Bhoo-de-vi"},"inflection":{"notes":"Proper noun, so no plural form."},"usage_notes":{"explanation":"Bhudevi is a significant figure in Hinduism, representing the Earth and its life-sustaining properties. She is often associated with fertility, abundance, and patience. Stories about Bhudevi are found in various Hindu scriptures, including the Puranas.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Bhu (Earth)","Devi (Goddess)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"Bhudevi is a proper noun referring to a specific deity in Hinduism. Understanding requires familiarity with Hindu mythology and religious concepts."},"example_sentences":[{"sentence":"The statue depicted Bhudevi adorned with jewels and flowers.","translation":"その像は、宝石と花で飾られたブーデーヴィーを描いていました。","type":"noun","meaning_category":"Hindu Goddess"},{"sentence":"Farmers often invoke Bhudevi for a bountiful harvest.","translation":"農民はしばしば豊かな収穫を祈ってブーデーヴィーに祈願します。","type":"noun","meaning_category":"Hindu Goddess"}]}