{"word":"olefines","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"オレフィン類（アルケン類）","english_definition":"A general term for unsaturated hydrocarbons containing one or more carbon-carbon double bonds; also known as alkenes.","examples":[{"sentence":"Olefines are important building blocks in the petrochemical industry.","translation":"オレフィン類は石油化学産業において重要な構成要素です。"},{"sentence":"Ethylene and propylene are the most common olefines.","translation":"エチレンとプロピレンは最も一般的なオレフィン類です。"}],"collocations":["alpha olefines","linear olefines","cyclic olefines","olefine polymerization","olefine production"],"synonyms":["alkenes","unsaturated hydrocarbons"],"antonyms":["alkanes","saturated hydrocarbons"]}],"etymology":{"value":"Derived from 'olefiant gas', an old name for ethylene, coined from Latin 'oleum' (oil) + 'facio' (make), because ethylene reacts with chlorine to form an oily liquid. The suffix '-ine' indicates an unsaturated hydrocarbon.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈoʊləfiːnz/","syllables":"o-le-fines"},"inflection":{"noun_plural":"olefines (already plural)"},"usage_notes":{"explanation":"'Olefines' is a collective term referring to a group of hydrocarbons characterized by the presence of at least one carbon-carbon double bond. The term is often used interchangeably with 'alkenes', although 'olefines' is more common in industrial contexts, particularly in the petrochemical industry. The singular form 'olefine' is rarely used; it's more common to refer to a specific compound (e.g., ethylene, propylene) or use the collective plural.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Olefine are used in plastics production.","correct":"✓ Olefines are used in plastics production.","note":"'Olefines' is a plural noun, so it requires a plural verb form ('are' instead of 'is')."},{"incorrect":"✗ The olefine is very reactive.","correct":"✓ Olefines are very reactive. / ✓ Ethylene is very reactive.","note":"To refer to the group in general, use the plural 'olefines'. To refer to a specific compound, use its name (e.g., ethylene, propylene)."}],"priority":"★★☆"},"related_words":{"derivatives":["olefine polymerization (オレフィン重合)","alpha-olefine (アルファオレフィン)"],"chemical_formulas":["ethylene (C2H4)","propylene (C3H6)","butene (C4H8)"],"priority":"★★☆"},"level_frequency":{"technical_level":"High (Chemistry, Petrochemistry)","frequency_google_ngram":"Low (Technical term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Olefines' are a group of chemical compounds, specifically hydrocarbons, that contain at least one carbon-carbon double bond. They are also known as alkenes. These compounds are very important in the chemical industry, especially in the production of plastics and other materials. The term 'olefines' is typically used in technical or scientific contexts, particularly when discussing the chemistry of these compounds or their industrial applications. Understanding the term requires some background knowledge in chemistry.","priority":"★☆☆"},"example_sentences":[{"sentence":"The cracking process converts alkanes into smaller olefines.","translation":"分解プロセスはアルカンをより小さなオレフィン類に変換します。","type":"noun","meaning_category":"Chemical compounds"},{"sentence":"Olefines are used as monomers in the production of many polymers.","translation":"オレフィン類は多くのポリマーの製造においてモノマーとして使用されます。","type":"noun","meaning_category":"Industrial applications"},{"sentence":"The reactivity of olefines is due to the presence of the double bond.","translation":"オレフィン類の反応性は二重結合の存在によるものです。","type":"noun","meaning_category":"Chemical properties"}]}