{"word":"beatification","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"列福、福者認定","english_definition":"an act by which the Pope declares that a dead person lived a holy life and is worthy of public veneration; the state of being declared a 'Blessed' person in the Roman Catholic Church, a step towards canonization (sainthood).","examples":[{"sentence":"The beatification of the nun took place in Rome.","translation":"その修道女の列福はローマで行われた。"},{"sentence":"Beatification is the penultimate step before canonization.","translation":"列福は列聖（聖人化）の前の最後の段階である。"}],"collocations":["ceremony of beatification (列福式)","decree of beatification (列福の布告)","process of beatification (列福の過程)"],"synonyms":["blessedness","canonization"],"antonyms":["damnation","excommunication"]}],"etymology":{"value":"Late Middle English: from late Latin beatificatio(n-), from beatificare ‘make happy’ (see beatify).","priority":"★★☆"},"pronunciation":{"ipa":"/biˌætɪfɪˈkeɪʃən/","syllables":"be-at-i-fi-ca-tion"},"inflection":{"noun_plural":"beatifications"},"usage_notes":{"explanation":"Beatification is a formal process within the Roman Catholic Church. It recognizes that a deceased person lived a virtuous life and is worthy of limited public veneration. It is a step towards canonization, which is the declaration of sainthood. A person who has been beatified is called 'Blessed'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The beatification was a big party.","correct":"✓ The beatification ceremony was a solemn religious event.","note":"Beatification is a religious process, not just a party."},{"incorrect":"✗ He was beatified after only one miracle.","correct":"✓ The requirements for beatification vary, but typically involve evidence of a virtuous life and often a confirmed miracle.","note":"The requirements for beatification are complex and depend on the specific case."}],"priority":"★★☆"},"related_words":{"derivatives":["beatify (verb: to declare someone blessed)","beatific (adjective: blissful, saintly)"],"phrasal_verbs":[],"related_concepts":["canonization (sainthood)","saint","blessed","veneration","Catholic Church"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'beatification' refers to a specific religious process within the Roman Catholic Church. It's a formal declaration by the Pope that a deceased person lived a holy life and is worthy of public veneration, but on a limited scale. It's an important step towards becoming a saint (canonization). The term is rarely used outside of this specific religious context."},"example_sentences":[{"sentence":"The Vatican announced the beatification of Mother Teresa.","translation":"バチカンはマザー・テレサの列福を発表した。","type":"noun","meaning_category":"列福"},{"sentence":"After beatification, the person is referred to as 'Blessed'.","translation":"列福後、その人物は「福者」と呼ばれる。","type":"noun","meaning_category":"列福"},{"sentence":"The local church celebrated the beatification with a special mass.","translation":"地元の教会は特別なミサで列福を祝った。","type":"noun","meaning_category":"列福"}]}