{"word":"Austenitizing","priority":"★★☆","meanings":[{"part_of_speech":"verb","definition":"オーステナイト化処理する","english_definition":"Heating a metal, alloy, or steel to a temperature at which it changes to austenite.","examples":[{"sentence":"The steel was austenitized at 900°C to achieve the desired microstructure.","translation":"望ましい微細構造を得るために、鋼は900℃でオーステナイト化処理された。"},{"sentence":"Austenitizing is a crucial step in the heat treatment process.","translation":"オーステナイト化は熱処理プロセスにおける重要なステップである。"}],"collocations":["austenitizing temperature","austenitizing process","austenitizing time"],"synonyms":["heat treating","annealing"],"antonyms":["quenching","tempering"]}],"etymology":{"value":"The term 'austenitizing' is derived from 'austenite,' which is named after Sir William Chandler Roberts-Austen, a British metallurgist.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɔːstənaɪˌzɪŋ/","syllables":"Aus-ten-i-tiz-ing"},"inflection":{"verb_forms":{"present_simple":["austenitize","austenitizes"],"past_simple":"austenitized","past_participle":"austenitized","present_participle":"austenitizing"}},"usage_notes":{"explanation":"Austenitizing is a specific heat treatment process used primarily for steels. It involves heating the steel to a temperature where the crystal structure transforms into austenite, a face-centered cubic structure. This process is essential for subsequent heat treatments like quenching and tempering, as it allows for the formation of martensite or other desired microstructures. The austenitizing temperature varies depending on the specific alloy composition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The metal was austenitizing to room temperature.","correct":"✓ The metal was austenitized and then cooled to room temperature.","note":"Austenitizing is the heating process, not the cooling process. Cooling after austenitizing is a separate step, often quenching or controlled cooling. "},{"incorrect":"✗ Austenitizing is only for aluminum alloys.","correct":"✓ Austenitizing is primarily used for steels.","note":"Austenitizing is mainly applied to steels to transform their microstructure. While other alloys undergo heat treatments, the term 'austenitizing' specifically refers to the formation of austenite in ferrous alloys."}],"priority":"★★☆"},"related_words":{"derivatives":["austenite","austenitic","austenitization"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Specialized metallurgical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Austenitizing' refers to a heat treatment process applied to metals, particularly steel. It involves heating the metal to a specific temperature at which its crystal structure transforms into austenite. This is a crucial step in achieving desired mechanical properties through subsequent processes like quenching or tempering. The term is highly technical and specific to the field of metallurgy.","priority":"★★☆"},"example_sentences":[{"sentence":"Proper austenitizing is critical for achieving the desired hardness in the final product.","translation":"適切なオーステナイト化は、最終製品で望ましい硬度を得るために重要である。","type":"verb","meaning_category":"heat treatment"},{"sentence":"The austenitizing temperature must be carefully controlled to prevent grain growth.","translation":"結晶粒の成長を防ぐためには、オーステナイト化温度を慎重に制御する必要がある。","type":"verb","meaning_category":"heat treatment"},{"sentence":"After austenitizing, the steel is rapidly quenched to form martensite.","translation":"オーステナイト化後、鋼はマルテンサイトを形成するために急速に焼入れされる。","type":"verb","meaning_category":"heat treatment"}]}