{"word":"twice-handicapped","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"二重に障害を持つ、複数の障害を抱える","english_definition":"Having two or more disabilities or handicaps.","examples":[{"sentence":"The school specializes in educating twice-handicapped children.","translation":"その学校は、二重に障害を持つ子供たちの教育を専門としている。"},{"sentence":"Providing adequate support for twice-handicapped individuals requires specialized resources.","translation":"二重に障害を持つ個人に適切なサポートを提供するには、専門的なリソースが必要となる。"}],"collocations":["twice-handicapped children","twice-handicapped individuals","twice-handicapped students"],"synonyms":["multiply disabled","dually diagnosed","multi-handicapped"],"antonyms":["able-bodied","non-disabled"]}],"etymology":{"value":"The term is formed by combining \"twice\" (meaning two times or doubly) with \"handicapped\" (meaning having a physical or mental disability). It indicates that an individual has two or more disabilities, which compound the challenges they face.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtwaɪsˈhændiˌkæpt/","syllables":"twice-han-di-capped"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term \"twice-handicapped\" is used to describe individuals who have two or more disabilities, which can include physical, intellectual, sensory, or emotional impairments. This term is often used in educational and medical contexts to identify individuals who require specialized support and services due to the complexity of their needs. While the term is descriptive, it's important to use it with sensitivity and respect, as some may find it stigmatizing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a twice handicapped person.","correct":"✓ He is a twice-handicapped person.","note":"The adjective 'twice-handicapped' should be hyphenated when used before a noun."},{"incorrect":"✗ She has twice handicap.","correct":"✓ She has a double handicap. / ✓ She is twice-handicapped.","note":"'Handicap' is a noun. To describe someone with multiple disabilities, use 'twice-handicapped' as an adjective or 'double handicap' as a noun phrase."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, used primarily in specialized contexts (education, medicine).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"twice-handicapped\" is a specialized term used to describe individuals with two or more disabilities. It's important to understand that this term is primarily used in professional or academic contexts, such as special education or healthcare, and may not be widely understood by the general public. When using this term, it's crucial to be sensitive and respectful, as it can be perceived as stigmatizing by some individuals. It's often more appropriate to use person-first language, such as \"individuals with multiple disabilities,\" to emphasize the person rather than the disability."},"example_sentences":[{"sentence":"The program is designed to meet the unique needs of twice-handicapped students.","translation":"そのプログラムは、二重に障害を持つ学生の独自のニーズを満たすように設計されている。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"Research is needed to better understand the challenges faced by twice-handicapped adults.","translation":"二重に障害を持つ成人が直面する課題をより良く理解するためには、研究が必要である。","type":"adjective","meaning_category":"Descriptive"}]}