{"word":"cypsela","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"キク科植物の果実","english_definition":"a dry single-seeded fruit formed from a double ovary, characteristic of the Asteraceae (Compositae) family.","examples":[{"sentence":"The dandelion produces cypselae that are easily dispersed by the wind.","translation":"タンポポは風によって容易に散布される痩果を生成する。"}],"collocations":["cypsela morphology","cypsela dispersal"],"synonyms":["achene"],"antonyms":[]},{"part_of_speech":"noun","definition":"痩果","english_definition":"A dry, single-seeded fruit that develops from an inferior ovary, often with an attached pappus.","examples":[{"sentence":"The cypsela of a sunflower is the seed we typically eat.","translation":"ヒマワリの痩果は私たちが通常食べる種子です。"}],"collocations":[],"synonyms":["fruit of Asteraceae"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'kypselē' (κυψέλη) meaning 'box' or 'bees-hive'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪpsələ/","syllables":"cip-se-la"},"inflection":{"noun_plural":"cypselae"},"usage_notes":{"explanation":"A cypsela is technically a type of achene, but the term is generally reserved for the fruits of the Asteraceae family.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["cypselar (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"cypsela\" is a botanical term specifically used to describe the type of fruit produced by plants in the Asteraceae family (such as sunflowers, dandelions, and lettuce). It's a dry, single-seeded fruit that develops from an inferior ovary and often has a pappus (modified sepals) attached, which aids in wind dispersal. This term is primarily encountered in botany textbooks, scientific papers, and specialized horticultural contexts."},"example_sentences":[{"sentence":"The morphology of the cypsela is an important characteristic for identifying different species of Asteraceae.","translation":"痩果の形態は、キク科の異なる種を識別するための重要な特徴です。","type":"noun","meaning_category":"キク科植物の果実"},{"sentence":"The pappus attached to the cypsela aids in wind dispersal.","translation":"痩果に取り付けられた冠毛は、風による散布を助けます。","type":"noun","meaning_category":"痩果"},{"sentence":"Botanists study the cypsela to understand the evolutionary relationships within the Asteraceae family.","translation":"植物学者は、キク科内の進化的関係を理解するために痩果を研究します。","type":"noun","meaning_category":"キク科植物の果実"}]}