{"word":"unabutting","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not abutting; not touching or bordering.","english_definition":"Not touching or bordering; not having a common boundary.","examples":[{"sentence":"The two properties are unabutting, separated by a narrow alley.","translation":"その二つの不動産は隣接しておらず、狭い路地で隔てられています。"},{"sentence":"The unabutting edges of the fabric created a gap in the seam.","translation":"生地の隣接しない端が、縫い目に隙間を作ってしまいました。"}],"collocations":["unabutting properties","unabutting edges","unabutting surfaces"],"synonyms":["nonadjacent","separate","detached","disconnected"],"antonyms":["abutting","adjacent","touching","bordering"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'abutting'. 'Abutting' comes from the Middle English word 'abuten', meaning 'to border upon', which in turn comes from the Old French word 'abouter', meaning 'to touch at the end'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəˈbʌtɪŋ/","syllables":"un-a-but-ting"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"'Unabutting' is a relatively uncommon word used to describe things that do not physically touch or share a boundary. It's often used in technical or legal contexts, such as property descriptions or engineering specifications. The word implies a separation or gap between the items being described.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The houses were unabutting each other.","correct":"✓ The houses were unabutting. / ✓ The houses did not abut each other.","note":"'Unabutting' is an adjective describing the state of being not touching. The phrase 'each other' is redundant when using the adjective 'unabutting'. Instead, use 'did not abut each other' if you want to emphasize the action of not touching."}],"priority":"★★☆"},"related_words":{"derivatives":["abut","abutment"],"related_terms":["adjacent","contiguous","proximate"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unabutting' is a technical term primarily used in legal, engineering, or real estate contexts to denote that two objects or properties do not share a common boundary or touch each other. Because of its specialized usage, it is not commonly encountered in everyday language, making it a word primarily understood by those with specific expertise in related fields."},"example_sentences":[{"sentence":"The plans clearly showed the two buildings as unabutting.","translation":"その計画では、二つの建物が隣接していないことが明確に示されていた。","type":"general","meaning_category":"not touching"},{"sentence":"The unabutting sections of the pipeline required a flexible connector.","translation":"パイプラインの隣接しない部分には、柔軟なコネクターが必要だった。","type":"technical","meaning_category":"not touching"}]}