{"word":"Monochromator","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"単色光分光器、モノクロメーター","english_definition":"An optical device that transmits a mechanically selectable narrow band of wavelengths of light or other radiation chosen from a wider range of wavelengths available at the input.","examples":[{"sentence":"The monochromator is used to select a specific wavelength of light for the experiment.","translation":"そのモノクロメーターは、実験のために特定の波長の光を選択するために使用される。"},{"sentence":"By adjusting the monochromator, we can scan the spectrum of the light source.","translation":"モノクロメーターを調整することで、光源のスペクトルをスキャンできる。"}],"collocations":["double monochromator","grating monochromator","prism monochromator","scanning monochromator"],"synonyms":["spectrometer","spectroscope","optical filter"],"antonyms":[]}],"etymology":{"value":"The word \"monochromator\" comes from the Greek words \"mono\" (single), \"chroma\" (color), and the suffix \"-tor\" (an agent or instrument).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɒnəˈkroʊmətər/","syllables":"mon-o-chro-ma-tor"},"inflection":{"noun_plural":"monochromators"},"usage_notes":{"explanation":"A monochromator is an instrument used to isolate a narrow band of wavelengths from a broader spectrum of light. It is commonly used in spectroscopy, where it is essential to analyze the interaction of light with matter at specific wavelengths.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The monochromator measure the intensity of light.","correct":"✓ The monochromator selects the wavelength of light.","note":"Monochromators select wavelengths, while detectors measure intensity."}],"priority":"★☆☆"},"related_words":{"derivatives":["monochromatic","monochrome"],"related_terms":["spectroscopy","spectrometer","diffraction grating","prism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, used primarily in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A monochromator is a scientific instrument used to select a narrow range of wavelengths of light from a broader spectrum. It is used in various scientific applications, particularly in spectroscopy, to analyze how light interacts with different substances at specific wavelengths. Understanding its function requires familiarity with optics and spectroscopy concepts."},"example_sentences":[{"sentence":"The researcher used a monochromator to isolate the 532 nm laser line.","translation":"研究者は、532nmのレーザーラインを分離するためにモノクロメーターを使用した。","type":"general","meaning_category":"光学機器"},{"sentence":"The monochromator's grating was carefully aligned to maximize light throughput.","translation":"光のスループットを最大化するために、モノクロメーターのグレーティングは慎重に調整された。","type":"technical","meaning_category":"光学機器"}]}