{"word":"nondonation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"不寄付、非寄付","english_definition":"The act or state of not donating; a lack of donation.","examples":[{"sentence":"The charity was surprised by the high rate of nondonation among wealthy individuals.","translation":"その慈善団体は、富裕層の間での寄付をしない割合の高さに驚いた。"},{"sentence":"Nondonation can stem from various factors, including economic hardship or lack of trust in the organization.","translation":"不寄付は、経済的困難や組織への信頼の欠如など、さまざまな要因から生じる可能性がある。"}],"collocations":["high rate of nondonation (高い不寄付率)","factors influencing nondonation (不寄付に影響を与える要因)"],"synonyms":["lack of donation","non-contribution"],"antonyms":["donation","contribution"]}],"etymology":{"value":"\"non-\" (否定) + \"donation\" (寄付)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒndoʊˈneɪʃən/","syllables":"non-do-na-tion"},"inflection":{"noun_plural":"nondonations"},"usage_notes":{"explanation":"\"Nondonation\" is a relatively uncommon word that refers to the act of *not* donating. It's often used in studies or discussions about charitable giving, philanthropy, and the reasons why people choose not to donate to specific causes or organizations. It can also be used more broadly to describe the absence of any kind of donation, not just monetary.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nondonation was very high this year due to the economy.","correct":"✓ The rate of nondonation was very high this year due to the economy.","note":"It's more common to refer to the *rate* or *level* of nondonation, rather than saying \"the nondonation\" itself was high."}],"priority":"★★☆"},"related_words":{"derivatives":["donate","donation","donor","nondonor"],"antonyms":["donation","contribution","gift","offering"],"related_concepts":["philanthropy","charity","fundraising","altruism"]},"level_frequency":{"frequency_google_ngram":"Low frequency - not a commonly used word.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"nondonation\" is a more formal and less common term for simply \"not donating.\" It's often used in academic or professional contexts when discussing trends or reasons behind why people or organizations choose not to give to charity or other causes. It's formed by adding the prefix \"non-\" to \"donation,\" indicating the absence or negation of a donation."},"example_sentences":[{"sentence":"The study analyzed the demographics of individuals with a history of nondonation to environmental causes.","translation":"その研究は、環境保護活動への寄付歴がない個人の人口統計を分析した。","type":"noun","meaning_category":"不寄付"},{"sentence":"A better understanding of the motives behind nondonation is crucial for effective fundraising strategies.","translation":"効果的な資金調達戦略のためには、不寄付の背後にある動機をより深く理解することが不可欠である。","type":"noun","meaning_category":"不寄付"},{"sentence":"The organization sought to address the common misconceptions that lead to nondonation.","translation":"その組織は、不寄付につながる一般的な誤解に対処しようとした。","type":"noun","meaning_category":"不寄付"}]}