{"word":"proapostolic","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Supporting or promoting the apostolic tradition or authority.","english_definition":"Favoring or advocating for the apostolic teachings, practices, or authority within a religious context, typically Christianity.","examples":[{"sentence":"The conference aimed to promote proapostolic views within the church.","translation":"その会議は、教会内で使徒的見解を促進することを目的としていた。"},{"sentence":"He is a strong advocate for a proapostolic approach to ministry.","translation":"彼は、宣教への使徒的アプローチの強力な提唱者である。"}],"collocations":["proapostolic teaching","proapostolic ministry","proapostolic leadership","proapostolic succession"],"synonyms":["apostolic","orthodox","traditionalist"],"antonyms":["antiapostolic","heretical","unorthodox"]}],"etymology":{"value":"The word 'proapostolic' is formed by combining the prefix 'pro-' (meaning 'in favor of' or 'supporting') with 'apostolic,' which relates to the apostles or their teachings.","priority":"N/A"},"pronunciation":{"ipa":"/ˌproʊ.æp.əˈstɑː.lɪk/","syllables":"pro-ap-o-stol-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more proapostolic, most proapostolic)."},"usage_notes":{"explanation":"'Proapostolic' is often used in theological or religious discussions to describe viewpoints or practices that align with or defend what is considered the original teachings and authority of the apostles, particularly within Christian traditions. It can also be used to describe individuals, groups, or movements that actively support or promote these apostolic principles.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pro-apostolic.","correct":"✓ He is a proapostolic person.","note":"'Proapostolic' is an adjective, so it needs to modify a noun."}],"priority":"N/A"},"related_words":{"derivatives":["apostolicity (noun): The quality of being apostolic.","apostolate (noun): The office or mission of an apostle.","apostolic (adjective): Relating to the apostles."],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - The term is relatively uncommon and primarily used in specific religious or theological contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Proapostolic' is a term used in religious contexts, especially within Christianity, to describe something that supports or promotes the teachings and authority of the apostles. It is often used in theological discussions or writings to indicate adherence to traditional or orthodox views related to the apostles' role and legacy. The term is not commonly used in everyday conversation and is more likely to be encountered in academic or religious settings."},"example_sentences":[{"sentence":"The seminary emphasizes a proapostolic interpretation of scripture.","translation":"その神学校は、聖書についての使徒的解釈を強調している。","type":"adjective","meaning_category":"Supporting apostolic tradition"},{"sentence":"The movement seeks to restore proapostolic practices within the church.","translation":"その運動は、教会内で使徒的慣習を回復しようとしている。","type":"adjective","meaning_category":"Promoting apostolic authority"}]}