{"word":"chestier","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(comparative of chesty) より胸を張った、より威勢の良い、より自慢げな","english_definition":"(comparative of chesty) more boastful or self-assertive; having a prominent chest.","examples":[{"sentence":"He became chestier after winning the award.","translation":"彼は受賞後、より自慢げになった。"},{"sentence":"She walked with a chestier stride, full of confidence.","translation":"彼女は自信に満ち溢れ、より胸を張って歩いた。"}],"collocations":["grow chestier","become chestier","a chestier attitude","a chestier demeanor"],"synonyms":["more boastful","more arrogant","more conceited","more self-assured","more confident"],"antonyms":["more modest","more humble","more reserved","more shy","less confident"]}],"etymology":{"value":"Derived from 'chesty,' which originally referred to having a large or prominent chest. Over time, it also came to describe someone who is boastful or self-assertive, possibly due to the association of a puffed-out chest with pride or confidence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃɛstiər/","syllables":"chest-i-er"},"inflection":{"adjective_forms":{"comparative":"chestier","superlative":"chestiest"}},"usage_notes":{"explanation":"'Chestier' is the comparative form of 'chesty.' 'Chesty' can describe someone with a large chest or, more commonly, someone who is boastful or self-assertive. 'Chestier' implies a greater degree of boastfulness or self-assertion compared to someone who is simply 'chesty.' The term is often used to describe a change in someone's behavior or attitude, indicating they have become more confident and perhaps arrogant.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was chestier than her chest.","correct":"✓ He was chestier than her. / He was more chesty than her.","note":"When comparing levels of boastfulness, avoid confusing the figurative sense of 'chesty' with a literal reference to chest size. The comparison should focus on the degree of boastfulness, not physical attributes."},{"incorrect":"✗ She felt chestier after the defeat.","correct":"✓ She felt less chesty after the defeat.","note":"'Chestier' implies increased confidence or boastfulness. After a defeat, it's more likely someone would feel less confident or boastful."}],"priority":"★★☆"},"related_words":{"derivatives":["chesty (adjective)","chestiest (adjective, superlative)","chestiness (noun)"],"idioms_phrases":["N/A"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Chestier' is the comparative form of 'chesty,' an adjective that describes someone who is boastful or self-assertive. It implies a greater degree of confidence or arrogance than simply being 'chesty.' The term is not very common and is more likely to be encountered in descriptive writing or character portrayals. Understanding the context is key to interpreting the intended meaning, as it can refer to an increase in confidence or a more pronounced display of arrogance."},"example_sentences":[{"sentence":"After his promotion, John became noticeably chestier.","translation":"昇進後、ジョンは目に見えて威勢が良くなった。","type":"adjective","meaning_category":"more boastful"},{"sentence":"The team played with a chestier attitude after their initial success.","translation":"チームは最初の成功の後、より自信に満ちた態度でプレーした。","type":"adjective","meaning_category":"more self-assured"},{"sentence":"Compared to his earlier interviews, he seemed chestier and less willing to compromise.","translation":"以前のインタビューと比べて、彼はより自信過剰で、妥協する気がなさそうだった。","type":"adjective","meaning_category":"more arrogant"}]}