{"word":"rotators","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"回転させるもの、回転筋群","english_definition":"Something that rotates or causes rotation; specifically, the rotator cuff muscles in the shoulder.","examples":[{"sentence":"The rotators in the shoulder allow for a wide range of motion.","translation":"肩の回転筋群は、広範囲の動きを可能にする。"},{"sentence":"He injured his rotators while lifting heavy weights.","translation":"彼は重い物を持ち上げている時に回転筋群を痛めた。"},{"sentence":"The machine uses rotators to spin the object.","translation":"その機械は回転子を使って物体を回転させる。"}],"collocations":["rotator cuff","shoulder rotators","external rotators","internal rotators"],"synonyms":["spinner","revolver"],"antonyms":["stabilizers"]},{"part_of_speech":"noun","definition":"（複数形で）回転筋腱板（肩関節の）","english_definition":"(anatomy, plural) A group of muscles and their tendons that surround the shoulder joint, providing stability and enabling a wide range of motion.","examples":[{"sentence":"Rotators are essential for shoulder joint stability.","translation":"回転筋腱板は肩関節の安定に不可欠である。"},{"sentence":"Exercises to strengthen the rotators can help prevent shoulder injuries.","translation":"回転筋腱板を強化する運動は、肩の怪我の予防に役立つ。"}],"collocations":["rotator cuff tear","rotator cuff injury","rotator cuff exercises"],"synonyms":["rotator cuff muscles"],"antonyms":[]}],"etymology":{"value":"The word \"rotator\" comes from the Latin word \"rotare,\" meaning \"to turn or revolve.\" The suffix \"-or\" indicates something that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈroʊteɪtərz/","syllables":"ro-ta-tors"},"inflection":{"noun_plural":"rotators"},"usage_notes":{"explanation":"The term \"rotators\" most commonly refers to the rotator cuff muscles in the shoulder. These muscles are vital for shoulder stability and movement. In a more general sense, \"rotator\" can refer to any device or mechanism that causes something to rotate.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has pain in his rotator.","correct":"✓ He has pain in his rotator cuff.","note":"While \"rotator\" can refer to the rotator cuff muscles, it's more common and precise to say \"rotator cuff\" when discussing shoulder injuries or anatomy."}],"priority":"★★☆"},"related_words":{"derivatives":["rotate","rotation","rotatory"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"rotators\" typically refers to the rotator cuff muscles in the shoulder, which are important for shoulder movement and stability. It can also refer to anything that causes rotation. Understanding the context is important to know which meaning is intended. In medical contexts, it almost always refers to the rotator cuff.","priority":"★★☆"},"example_sentences":[{"sentence":"Strengthening the shoulder **rotators** can help prevent injuries.","translation":"肩の回転筋群を強化することは、怪我の予防に役立つ。","type":"noun","meaning_category":"回転筋群"},{"sentence":"The machine uses powerful **rotators** to spin the turbine.","translation":"その機械は強力な回転子を使ってタービンを回転させる。","type":"noun","meaning_category":"回転させるもの"}]}