{"word":"alpinery","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"高山植物園、ロックガーデン","english_definition":"a garden or part of a garden devoted to growing alpine plants.","examples":[{"sentence":"The alpinery was carefully designed to mimic the natural conditions of a mountain environment.","translation":"高山植物園は、山岳環境の自然条件を模倣するように注意深く設計されました。"},{"sentence":"Many rare and delicate alpine flowers thrive in the alpinery.","translation":"多くの希少で繊細な高山植物が高山植物園で生育しています。"}],"collocations":["create an alpinery","maintain an alpinery","visit an alpinery","alpine plants in the alpinery"],"synonyms":["rock garden","alpine garden","rockery"],"antonyms":[]}],"etymology":{"value":"\"Alpinery\" is derived from \"alpine,\" referring to high mountains (especially the Alps), and the suffix \"-ery,\" which denotes a place or collection. Thus, an alpinery is literally a place where alpine plants are grown.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈælpɪnəri/","syllables":"al-pin-er-y"},"inflection":{"noun_plural":"alpinaries"},"usage_notes":{"explanation":"An \"alpinery\" is a specialized type of garden that focuses on cultivating plants that naturally grow in high-altitude, mountainous regions. These gardens often incorporate rocks and well-draining soil to replicate the conditions found in alpine environments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I visited the alpinary.","correct":"✓ I visited the alpinery.","note":"The correct spelling is \"alpinery,\" not \"alpinary.\""},{"incorrect":"✗ The alpinery is full of tropical plants.","correct":"✓ The alpinery is full of alpine plants.","note":"An alpinery is specifically for alpine plants, not tropical plants."}],"priority":"★☆☆"},"related_words":{"derivatives":["alpine (adjective: relating to high mountains)","alpinist (noun: a mountain climber)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"alpinery\" is a relatively uncommon term referring to a garden specifically designed for growing alpine plants. Understanding this word requires some familiarity with gardening terminology and the concept of alpine environments."},"example_sentences":[{"sentence":"The local botanical garden boasts a stunning alpinery, showcasing a diverse collection of mountain flora.","translation":"地元の植物園には見事な高山植物園があり、多様な山の植物のコレクションを展示しています。","type":"noun","meaning_category":"高山植物園"},{"sentence":"Creating an alpinery requires careful attention to soil drainage and sun exposure to mimic the natural habitat of alpine plants.","translation":"高山植物園を作るには、高山植物の自然の生息地を模倣するために、土壌の排水と日当たりに注意が必要です。","type":"noun","meaning_category":"高山植物園"}]}