{"word":"exorbitation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"法外な要求、過大な要求、不当な取り立て","english_definition":"The act of exorbitating; excessive or unreasonable demand, especially of payment.","examples":[{"sentence":"The exorbitation of fees by some lawyers is a matter of public concern.","translation":"一部の弁護士による法外な報酬請求は、社会的な関心事である。"},{"sentence":"The company was accused of exorbitation in its pricing policies.","translation":"その会社は、価格設定において不当な取り立てを行っていると非難された。"}],"collocations":["exorbitation of fees (法外な手数料)","exorbitation of prices (法外な価格)"],"synonyms":["extortion","profiteering","overcharging","gouging"],"antonyms":["reasonableness","fairness","moderation"]}],"etymology":{"value":"Late Middle English: from late Latin exorbitatio(n-), from exorbitare ‘deviate from the track’, from ex- ‘out of’ + orbita ‘wheel track’ (from orbis ‘ring, circle’); the sense ‘excessive demand’ arose in the mid 17th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪɡˌzɔː(r)bɪˈteɪʃ(ə)n/","syllables":"ex-or-bi-ta-tion"},"inflection":{"noun_plural":"exorbitations"},"usage_notes":{"explanation":"\"Exorbitation\" refers to the act of making demands that are excessive, unreasonable, or unfair, particularly in the context of prices, fees, or other charges. It suggests a deliberate attempt to take advantage of someone by imposing unfairly high costs. The term is often used in legal or business contexts to describe unethical or illegal practices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The exorbitation of the view was breathtaking.","correct":"✓ The magnificence of the view was breathtaking.","note":"\"Exorbitation\" refers to excessive demands, not the grandeur of a view. Use \"magnificence\" or a similar word to describe the view. "},{"incorrect":"✗ He showed exorbitation towards his employees.","correct":"✓ He showed exploitation towards his employees.","note":"\"Exorbitation\" is about excessive demands, usually of money. \"Exploitation\" refers to taking unfair advantage of someone."}],"priority":"★★☆"},"related_words":{"derivatives":["exorbitate (verb: to deviate from the track; to make excessive demands)","exorbitant (adjective: excessively high; unreasonable)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Exorbitation\" is a relatively rare and formal word that describes the act of making excessive or unreasonable demands, especially in terms of money or prices. It is often used in legal or business contexts to denote unethical or illegal practices such as overcharging or extortion. Understanding this word requires a strong vocabulary and familiarity with formal language. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The government intervened to prevent the exorbitation of essential goods during the crisis.","translation":"政府は、危機の間、生活必需品の不当な価格つり上げを防ぐために介入した。","type":"general","meaning_category":"法外な要求"},{"sentence":"The exorbitation of interest rates by predatory lenders can trap vulnerable borrowers in a cycle of debt.","translation":"悪質な貸し手による法外な金利は、脆弱な借り手を借金の悪循環に陥れる可能性がある。","type":"general","meaning_category":"法外な要求"}]}