{"word":"Daymark","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"昼間標識、昼標","english_definition":"A fixed, unlighted aid to navigation used during daylight hours, often a geometric shape or color pattern on a structure.","examples":[{"sentence":"The daymark helped the ship navigate safely into the harbor.","translation":"その昼間標識は、船が安全に港へ入るのを助けた。"},{"sentence":"Sailors rely on daymarks to avoid hazards near the coast.","translation":"船乗りたちは、海岸付近の危険を避けるために昼間標識を頼りにする。"}],"collocations":["coastal daymark","navigation daymark","triangular daymark","square daymark"],"synonyms":["beacon","marker","landmark","navigation aid"],"antonyms":[]}],"etymology":{"value":"From 'day' + 'mark'. Indicates a mark or sign used for navigation during the day.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdeɪmɑːrk/","syllables":"day-mark"},"inflection":{"noun_plural":"daymarks"},"usage_notes":{"explanation":"Daymarks are unlighted structures used as navigational aids during daylight. They are often painted with specific colors and shapes to indicate channels, hazards, or other important features. Unlike lighthouses, they are not illuminated and are therefore only useful during the day.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ship used the lightmark to navigate during the day.","correct":"✓ The ship used the daymark to navigate during the day.","note":"'Lightmark' is not a standard term. Use 'daymark' for daytime navigation aids. A lightmark would imply a lighted aid, which is not what a daymark is."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Daymark' refers to a specific type of navigational aid used during the day. It's a term primarily used in maritime contexts and may not be familiar to those outside of sailing or shipping. Understanding the term requires knowledge of navigational terminology."},"example_sentences":[{"sentence":"The red triangular daymark indicated the port side of the channel.","translation":"赤い三角形の昼間標識は、水路の左舷側を示していた。","type":"noun","meaning_category":"navigation"},{"sentence":"The daymark was clearly visible against the backdrop of the coastline.","translation":"その昼間標識は、海岸線の背景に対してはっきりと見えた。","type":"noun","meaning_category":"visibility"},{"sentence":"Sailors use charts that show the locations of daymarks and other navigational aids.","translation":"船乗りたちは、昼間標識やその他の航行援助施設の場所を示す海図を使用する。","type":"noun","meaning_category":"chart"}]}