{"word":"European-influenced","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ヨーロッパの影響を受けた、ヨーロッパの影響がみられる","english_definition":"having been affected or changed by European culture, ideas, or styles.","examples":[{"sentence":"The architecture of the city is heavily European-influenced.","translation":"その都市の建築はヨーロッパの影響を強く受けている。"},{"sentence":"The cuisine is a blend of local ingredients and European-influenced cooking techniques.","translation":"その料理は地元の食材とヨーロッパの影響を受けた調理技術を組み合わせたものです。"},{"sentence":"Her paintings show a European-influenced style, particularly in the use of light and color.","translation":"彼女の絵画は、特に光と色の使い方において、ヨーロッパの影響を受けたスタイルを示している。"}],"collocations":["European-influenced art (ヨーロッパの影響を受けた芸術)","European-influenced architecture (ヨーロッパの影響を受けた建築)","European-influenced cuisine (ヨーロッパの影響を受けた料理)","European-influenced design (ヨーロッパの影響を受けたデザイン)","European-influenced fashion (ヨーロッパの影響を受けたファッション)","European-influenced music (ヨーロッパの影響を受けた音楽)"],"synonyms":["Europeanized","Westernized","affected by European culture"],"antonyms":["uninfluenced by Europe","indigenous","native"]},{"part_of_speech":"adjective","definition":"ヨーロッパの影響を受けた人々によって作られた、ヨーロッパの影響を受けた人々が関わった","english_definition":"created or shaped by people who have been influenced by European culture.","examples":[{"sentence":"The school offers a European-influenced curriculum.","translation":"その学校はヨーロッパの影響を受けたカリキュラムを提供している。"},{"sentence":"The project was led by a team of European-influenced researchers.","translation":"そのプロジェクトは、ヨーロッパの影響を受けた研究者チームによって率いられた。"}],"collocations":["European-influenced education (ヨーロッパの影響を受けた教育)","European-influenced research (ヨーロッパの影響を受けた研究)","European-influenced policies (ヨーロッパの影響を受けた政策)"],"synonyms":["shaped by European ideas","created by Europeanized individuals"],"antonyms":["locally developed","indigenously created"]}],"etymology":{"value":"The term is a compound adjective formed by combining \"European\" (referring to Europe or its culture) and \"influenced\" (meaning affected or changed). It describes something that has undergone a change or modification due to European culture, ideas, or styles.","priority":"☆☆☆"},"pronunciation":{"ipa":null,"syllables":"Eu-ro-pe-an-in-flu-enced"},"inflection":{"notes":"It's an adjective, so it doesn't inflect like a verb. It can be used in comparative and superlative forms (more European-influenced, most European-influenced), but this is less common."},"usage_notes":{"explanation":"\"European-influenced\" is used to describe something that shows the impact of European culture, ideas, or styles. This influence can be seen in various aspects of life, such as art, architecture, cuisine, fashion, education, and policies. The degree of influence can vary, and the term implies that the subject has been altered or modified as a result of this influence. It's important to consider the specific context to understand the extent and nature of the European influence.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The food is influence by European.","correct":"✓ The food is influenced by European culture.","note":"It's important to use the correct form of the verb (influenced) and to specify what is doing the influencing (European culture, ideas, etc.)."},{"incorrect":"✗ The city is European-influenced, but it's not really European.","correct":"✓ The city is European-influenced, but it retains its own unique character.","note":"\"European-influenced\" doesn't mean that something is entirely European; it simply means that it has been affected by European culture. It's possible for something to be European-influenced while still maintaining its own distinct identity."}],"priority":"☆☆☆"},"related_words":{"derivatives":["influence","European","Europeanization"],"phrases":["Western-influenced","culturally influenced"],"related_concepts":["cultural exchange","cultural diffusion","acculturation"]},"level_frequency":{"CEFR":null,"frequency_google_ngram":null,"priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"European-influenced\" is used to describe something that has been changed or affected by European culture, ideas, or styles. It is often used in discussions of art, architecture, cuisine, fashion, and other cultural aspects. The term implies that the subject has been modified or altered as a result of European influence, but it does not necessarily mean that it is entirely European. It is important to consider the specific context to understand the extent and nature of the European influence."},"example_sentences":[{"sentence":"The city's architecture is a blend of traditional styles and European-influenced designs.","translation":"その都市の建築は、伝統的なスタイルとヨーロッパの影響を受けたデザインが融合している。","type":"adjective","meaning_category":"General"},{"sentence":"The restaurant serves European-influenced dishes with a modern twist.","translation":"そのレストランでは、ヨーロッパの影響を受けた料理を現代風にアレンジして提供している。","type":"adjective","meaning_category":"Cuisine"},{"sentence":"The museum features a collection of European-influenced art from the 19th century.","translation":"その美術館には、19世紀のヨーロッパの影響を受けた芸術作品が集められている。","type":"adjective","meaning_category":"Art"}]}