{"word":"infrapatellar","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"膝蓋骨下の、膝蓋靭帯の","english_definition":"Situated below the patella (kneecap). Pertaining to the area or structures below the patella, often referring to the infrapatellar fat pad or the infrapatellar tendon (patellar ligament).","examples":[{"sentence":"The doctor examined the infrapatellar region for tenderness.","translation":"医者は圧痛がないか膝蓋骨下部を診察した。"},{"sentence":"Infrapatellar bursitis can cause pain and swelling below the kneecap.","translation":"膝蓋骨下包炎は膝蓋骨の下の痛みと腫れを引き起こす可能性がある。"}],"collocations":["infrapatellar fat pad (膝蓋骨下脂肪体)","infrapatellar tendon (膝蓋靭帯)","infrapatellar bursitis (膝蓋骨下包炎)"],"synonyms":["subpatellar"],"antonyms":["suprapatellar"]}],"etymology":{"value":"From 'infra-' (below) + 'patellar' (relating to the patella).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪnfrəpəˈtelər/","syllables":"in-fra-pa-tel-lar"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Infrapatellar' specifically denotes structures or conditions located *below* the patella (kneecap). It's commonly used in medical contexts to describe anatomical locations, injuries, or conditions related to the area beneath the kneecap, such as the infrapatellar fat pad or the patellar ligament.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pain was suprapatellar, near the infrapatellar tendon.","correct":"✓ The pain was suprapatellar, above the patellar tendon.","note":"'Suprapatellar' means above the patella, so it cannot be near the infrapatellar tendon (which is below the patella)."},{"incorrect":"✗ The infrapatellar is swollen.","correct":"✓ The infrapatellar region is swollen. / ✓ The infrapatellar fat pad is swollen.","note":"'Infrapatellar' is an adjective, not a noun. You need to specify what infrapatellar structure you are referring to."}],"priority":"★★☆"},"related_words":{"derivatives":["infrapatellarly (adverb)"],"related_terms":["patella (kneecap)","patellar tendon (膝蓋腱)","suprapatellar (膝蓋骨上の)","prepatellar (膝蓋骨前の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in medical or anatomical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'infrapatellar' is a technical term used in medicine and anatomy. It describes something located below the patella, which is the kneecap. You'll most likely encounter this word when reading about knee injuries, conditions, or surgical procedures. Understanding this term requires a basic knowledge of anatomical prefixes like 'infra-' (meaning below)."},"example_sentences":[{"sentence":"An MRI revealed inflammation of the infrapatellar fat pad.","translation":"MRI検査で膝蓋骨下脂肪体の炎症が明らかになった。","type":"medical","meaning_category":"anatomical location"},{"sentence":"The patient reported pain with palpation of the infrapatellar tendon.","translation":"患者は膝蓋靭帯の触診時に痛みを訴えた。","type":"medical","meaning_category":"anatomical location"},{"sentence":"Infrapatellar straps are sometimes used to alleviate patellar tendonitis.","translation":"膝蓋靭帯炎を軽減するために、膝蓋骨下ストラップが使用されることがある。","type":"medical","meaning_category":"treatment"}]}