{"word":"dichromacy","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"二色型色覚、二色覚","english_definition":"A condition in which only two of the three primary colour pigments are present, resulting in an inability to distinguish certain colours.","examples":[{"sentence":"Dichromacy is a type of color blindness.","translation":"二色覚は色盲の一種です。"},{"sentence":"People with dichromacy have difficulty distinguishing between red and green.","translation":"二色覚の人は、赤と緑の区別が困難です。"}],"collocations":["red-green dichromacy (赤緑色覚異常)","blue-yellow dichromacy (青黄色覚異常)"],"synonyms":["color blindness","color vision deficiency"],"antonyms":["trichromacy"]},{"part_of_speech":"noun","definition":"(動物学)二色性","english_definition":"(Zoology) The condition of having two different colors.","examples":[{"sentence":"Some birds exhibit dichromacy in their plumage.","translation":"一部の鳥類は羽毛に二色性を示します。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Greek words 'di-' (two) + 'chroma' (color) + '-acy' (state or condition).","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈkroʊməsi/","syllables":"di-chro-ma-cy"},"inflection":{"noun_plural":"dichromacies"},"usage_notes":{"explanation":"Dichromacy refers to a specific type of color vision deficiency where one of the three cone pigments in the eye is missing or non-functional. This results in the individual being able to perceive only two primary colors instead of the usual three (red, green, and blue). The most common forms are protanopia (red-blindness), deuteranopia (green-blindness), and tritanopia (blue-blindness). It is important to differentiate dichromacy from anomalous trichromacy, where all three cone pigments are present but one is altered, leading to distorted color perception.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Dichromacy is when you can see all colors, but they are faded.","correct":"✓ Dichromacy is when you can only see two primary colors.","note":"Dichromacy involves the inability to see a full spectrum of colors, not simply faded colors."},{"incorrect":"✗ Dichromacy is curable with surgery.","correct":"✓ Dichromacy is generally not curable.","note":"Currently, there is no widely accepted cure for dichromacy."}],"priority":"★★☆"},"related_words":{"derivatives":["dichromat (名詞: 二色覚者)","dichromatic (形容詞: 二色の、二色性の)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dichromacy' is a technical term primarily used in the fields of ophthalmology and vision science. It describes a specific type of color blindness where an individual possesses only two functioning cone pigments in their eyes, leading to a reduced ability to perceive the full spectrum of colors. Understanding this term requires familiarity with basic concepts of color vision and its deficiencies. It is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"His diagnosis revealed that he had deuteranopia, a type of dichromacy.","translation":"彼の診断の結果、彼は第二色盲という二色覚の一種であることが判明しました。","type":"medical","meaning_category":"二色型色覚"},{"sentence":"The study investigated the genetic basis of dichromacy in primates.","translation":"その研究は、霊長類における二色覚の遺伝的基盤を調査しました。","type":"scientific","meaning_category":"二色型色覚"}]}