{"word":"precollege","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"大学入学前の、大学進学準備の","english_definition":"Relating to the period before a student enters college or university; preparatory for college.","examples":[{"sentence":"She took precollege courses to improve her math skills.","translation":"彼女は数学のスキルを向上させるために大学進学準備コースを受講しました。"},{"sentence":"The precollege program helps students prepare for the rigors of higher education.","translation":"その大学進学準備プログラムは、学生が高等教育の厳しさに備えるのを支援します。"},{"sentence":"Many precollege students participate in extracurricular activities.","translation":"多くの大学進学前の学生は課外活動に参加しています。"}],"collocations":["precollege education","precollege program","precollege student","precollege courses","precollege experience"],"synonyms":["preparatory","secondary","high school"],"antonyms":["postgraduate","university","college-level"]},{"part_of_speech":"noun","definition":"大学入学前の期間、大学進学準備期間","english_definition":"The period of time before a student enters college or university.","examples":[{"sentence":"His precollege years were spent focusing on academics and sports.","translation":"彼の大学入学前の期間は、学業とスポーツに集中して過ごされました。"},{"sentence":"She had a rich precollege experience, filled with travel and volunteer work.","translation":"彼女は旅行やボランティア活動で満たされた、豊かな大学進学準備期間を過ごしました。"}],"collocations":["during precollege","throughout precollege"],"synonyms":["high school years","secondary education"],"antonyms":["college years","university years"]}],"etymology":{"value":"The word 'precollege' is formed by combining the prefix 'pre-' (meaning 'before') with the noun 'college'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˈkɒlɪdʒ/","syllables":"pre-col-lege"},"inflection":{"notes":"The word 'precollege' can function as both an adjective and a noun. As an adjective, it does not inflect. As a noun, it is generally used in the singular to refer to the period of time."},"usage_notes":{"explanation":"'Precollege' refers to the time period or educational stage before a student attends college or university. It is often used to describe programs, courses, or experiences designed to prepare students for higher education. It can function as both an adjective (e.g., 'precollege program') and a noun (e.g., 'during precollege').","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ pre-college","correct":"✓ precollege","note":"While 'pre-' is often used with a hyphen, 'precollege' is commonly written as one word, especially in American English."},{"incorrect":"✗ pre college","correct":"✓ precollege","note":"'Precollege' is typically written as one word, not two."}],"priority":"★★☆"},"related_words":{"derivatives":["precollegiate"],"related":["high school","secondary school","college preparatory","university preparatory"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but commonly understood in educational contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'precollege' is relatively straightforward, referring to the time or education before attending college. It is commonly used in academic and educational contexts to describe programs, courses, or experiences designed to prepare students for higher education. While not extremely common, it is readily understood by those familiar with the American education system."},"example_sentences":[{"sentence":"The university offers a summer **precollege** program for high school students.","translation":"その大学は高校生向けのサマー大学進学準備プログラムを提供しています。","type":"adjective","meaning_category":"大学入学前の"},{"sentence":"Her **precollege** years were filled with academic achievements and extracurricular activities.","translation":"彼女の大学入学前の期間は、学業での成果と課外活動で満たされていました。","type":"noun","meaning_category":"大学入学前の期間"}]}