{"word":"dodded","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(archaic) past tense and past participle of dod (to clip or shear; to poll or lop off).","english_definition":"(archaic) simple past and past participle of the verb 'dod', meaning to clip, shear, poll, or lop off (usually referring to hair or trees).","examples":[{"sentence":"The trees were dodded to prevent them from growing too tall.","translation":"木が大きくなりすぎるのを防ぐために、剪定された。"},{"sentence":"His hair was dodded short.","translation":"彼の髪は短く刈り込まれた。"}],"collocations":[],"synonyms":["clipped","sheared","trimmed","lopped","pollarded"],"antonyms":[],"notes":"This word and its base verb 'dod' are largely obsolete in modern English. It is primarily found in historical texts or specialized contexts related to forestry or agriculture."}],"etymology":{"value":"Derived from the verb 'dod', which has origins in Middle English and possibly earlier Germanic roots, related to cutting or removing something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɒdɪd/","syllables":"dod-ded"},"inflection":{"verb_forms":{"present_simple":["dod"],"past_simple":"dodded","past_participle":"dodded","present_participle":"dodding"}},"usage_notes":{"explanation":"'Dodded' is the past tense and past participle of 'dod', a verb that is now considered archaic. It means to cut off, clip, shear, poll, or lop off, typically referring to hair or trees. Due to its obsolescence, it is rarely encountered in contemporary English.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["dod (verb)","dodder (related but different word meaning to tremble or totter)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency - virtually obsolete in modern English.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Dodded' is an archaic word, meaning it is no longer in common use. It is the past tense and past participle of the verb 'dod,' which meant to clip or shear something, like hair or trees. You are unlikely to encounter this word except in older texts.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The farmer dodded the willow trees along the riverbank.","translation":"農夫は川岸沿いのヤナギの木を剪定した。","type":"verb","meaning_category":"clipped/sheared"},{"sentence":"Having been dodded, the hedge looked neat and tidy.","translation":"剪定された後、生け垣はきちんとして整って見えた。","type":"verb","meaning_category":"trimmed"}]}