{"word":"nonelectrocution","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"感電死しないこと、電気ショックによる死亡を回避すること","english_definition":"The avoidance of death by electrocution.","examples":[{"sentence":"The safety features of the device ensured nonelectrocution even in the event of a malfunction.","translation":"その装置の安全機能は、故障が発生した場合でも感電死を確実に回避するように設計されていた。"},{"sentence":"The training program emphasized the importance of proper grounding to prevent electrocution and ensure nonelectrocution.","translation":"その研修プログラムでは、感電死を防ぎ、感電死しないことを確実にするために、適切な接地の重要性を強調した。"}],"collocations":["ensure nonelectrocution","prevent nonelectrocution","risk of nonelectrocution"],"synonyms":["survival","non-fatal shock","avoidance of electrocution"],"antonyms":["electrocution","death by electrocution"]}],"etymology":{"value":"\"non-\" (否定) + \"electrocution\" (感電死)","priority":"★★★"},"pronunciation":{"ipa":"/nɒnɪˌlɛktrəˈkjuːʃən/","syllables":"non-e-lec-tro-cu-tion"},"inflection":{"noun_plural":"nonelectrocutions"},"usage_notes":{"explanation":"\"Nonelectrocution\" is a relatively rare term, primarily used in technical or safety contexts where the prevention of electrocution is a key concern. It is often used in discussions of electrical safety, equipment design, and accident prevention.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonelectrocution was a miracle.","correct":"✓ The survival was a miracle.","note":"\"Nonelectrocution\" refers to the *avoidance* of death by electrocution, not the state of being alive after a shock. Use \"survival\" in general contexts."},{"incorrect":"✗ The nonelectrocution of the device is important.","correct":"✓ The safe operation of the device is important.","note":"In general contexts, it's better to use terms like \"safe operation\" or \"safety features\" instead of focusing on the negative \"nonelectrocution.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["electrocution","electrocute"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"nonelectrocution\" is a technical term used to describe the state of not being killed by electric shock. It's primarily found in specialized contexts related to electrical safety, engineering, and accident investigation. Due to its specific and somewhat uncommon usage, it's considered a high-level vocabulary word. It is more common to use phrases like \"avoidance of electrocution\" or \"survival of an electric shock\" in general communication."},"example_sentences":[{"sentence":"The new grounding system significantly improved the chances of nonelectrocution for workers in the factory.","translation":"新しい接地システムは、工場労働者の感電死を回避する可能性を大幅に向上させた。","type":"noun","meaning_category":"avoidance of death by electrocution"},{"sentence":"The design of the appliance prioritized nonelectrocution, incorporating multiple layers of insulation.","translation":"その器具の設計は、複数の絶縁層を組み込むことで、感電死を回避することを優先した。","type":"noun","meaning_category":"avoidance of death by electrocution"}]}