{"word":"well-bowled","priority":"★☆☆","meanings":[{"part_of_speech":"exclamation","definition":"(クリケットで)ナイスボール！、良いボールだ！","english_definition":"(cricket) An exclamation of praise for a good delivery by a bowler.","examples":[{"sentence":"\"Well bowled! That was a beauty!\" shouted the wicket-keeper.","translation":"「ナイスボール！素晴らしい球だ！」とウィケットキーパーが叫んだ。"},{"sentence":"The captain patted the bowler on the back and said, \"Well bowled, mate!\"","translation":"キャプテンはボーラーの背中を叩いて「ナイスボール、相棒！」と言った。"}],"collocations":["well bowled, mate","well bowled, skip","well bowled, sir"],"synonyms":["good ball","nice one","top delivery"],"antonyms":["poorly bowled","bad ball","wide","no-ball"]}],"etymology":{"value":"A combination of the adverb \"well\" and the past participle \"bowled\", indicating that the ball was bowled skillfully.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌwɛl ˈboʊld/","syllables":"well-bowled"},"inflection":{"notes":"This phrase is typically used as an exclamation and does not have different inflections."},"usage_notes":{"explanation":"\"Well-bowled\" is a common expression used in cricket to commend a bowler for delivering a particularly good ball. It is often shouted by teammates, the wicket-keeper, or even spectators to show appreciation for the bowler's skill. The phrase implies that the ball was bowled with accuracy, pace, spin, or a combination of these, making it difficult for the batsman to play.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Well bowleding!","correct":"✓ Well bowled!","note":"The correct form is \"well bowled,\" using the past participle. Adding \"-ing\" is grammatically incorrect in this context."},{"incorrect":"✗ Well bowl!","correct":"✓ Well bowled!","note":"Using the base form of the verb \"bowl\" is incorrect. The past participle \"bowled\" is required."}],"priority":"★★☆"},"related_words":{"derivatives":["bowl (verb, noun)","bowler (noun)","bowling (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specific to cricket)","frequency_google_ngram":"Low frequency (Specific to cricket)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Well-bowled\" is a specialized term used in cricket. It's an exclamation to praise a bowler's good delivery. Understanding this phrase requires familiarity with cricket terminology and context. It's not commonly used outside of cricket-related conversations or settings."},"example_sentences":[{"sentence":"\"That's a wicket! Well bowled!\" the commentator exclaimed.","translation":"「ウィケットだ！ナイスボール！」と解説者が叫んだ。","type":"exclamation","meaning_category":"Praise for a good delivery"},{"sentence":"The team cheered, \"Well bowled!\" as the batsman was dismissed.","translation":"バッツマンがアウトになると、チームは「ナイスボール！」と歓声を上げた。","type":"exclamation","meaning_category":"Praise for a good delivery"}]}