{"word":"Noncorporeality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非物質性、無形性、実体のないこと","english_definition":"The state or quality of not having a physical body or form; immateriality.","examples":[{"sentence":"The concept of ghosts relies on the idea of noncorporeality.","translation":"幽霊の概念は非物質性の考えに基づいている。"},{"sentence":"Angels are often described as beings of pure noncorporeality.","translation":"天使はしばしば純粋な非物質性の存在として記述される。"},{"sentence":"The philosopher explored the implications of noncorporeality for the existence of the soul.","translation":"その哲学者は、魂の存在に対する非物質性の意味を探求した。"}],"collocations":["pure noncorporeality","spiritual noncorporeality","essential noncorporeality"],"synonyms":["immateriality","incorporeality","intangibility","ethereality","spirituality"],"antonyms":["corporeality","materiality","tangibility","physicality"]}],"etymology":{"value":"Formed from 'non-' (not) + 'corporeality' (having a body), which itself comes from Latin 'corporeus' (bodily) and 'corpus' (body).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnkɔːrˌpɔːriˈæləti/","syllables":"non-cor-po-re-al-i-ty"},"inflection":{"noun_plural":"Noncorporealities (rarely used)"},"usage_notes":{"explanation":"'Noncorporeality' is a relatively formal and philosophical term. It is often used in discussions of metaphysics, religion, and the nature of consciousness. It refers to the absence of a physical body or form, often implying a spiritual or ethereal existence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The noncorporeality of the object made it difficult to see.","correct":"✓ The immateriality of the object made it difficult to detect.","note":"'Noncorporeality' is usually applied to beings or concepts, not physical objects. Use 'immateriality' or 'intangibility' for objects. "},{"incorrect":"✗ He experienced noncorporeality after his accident.","correct":"✓ He had an out-of-body experience after his accident.","note":"'Noncorporeality' is a state or quality, not an experience. Use 'out-of-body experience' to describe the sensation of being separate from one's body."}],"priority":"★★☆"},"related_words":{"derivatives":["noncorporeal (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Noncorporeality' is a high-level, abstract noun referring to the state of not having a physical body. It's used in philosophical or theological contexts when discussing the nature of spirits, souls, or other entities that are considered immaterial. Understanding requires familiarity with abstract concepts and specialized vocabulary. "},"example_sentences":[{"sentence":"The philosopher argued for the noncorporeality of the mind.","translation":"その哲学者は心の非物質性を主張した。","type":"general","meaning_category":"非物質性"},{"sentence":"Belief in the noncorporeality of angels is common in many religions.","translation":"天使の非物質性を信じることは多くの宗教で一般的である。","type":"religious","meaning_category":"非物質性"},{"sentence":"The study of consciousness often involves exploring the concept of noncorporeality.","translation":"意識の研究はしばしば非物質性の概念の探求を伴う。","type":"philosophical","meaning_category":"非物質性"}]}