{"word":"Zoist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)動物磁気療法（アニマル・マグネティズム）の実践者または信奉者。特に、病気を治療するために動物磁気を使用する人。","english_definition":"(historical) A practitioner or believer in animal magnetism, especially one who uses it to treat diseases.","examples":[{"sentence":"The Zoists claimed to be able to cure a variety of ailments through the application of animal magnetism.","translation":"ゾイストたちは、動物磁気を応用することで様々な病気を治療できると主張した。"}],"collocations":["animal magnetism","magnetic healing"],"synonyms":["magnetizer","mesmerist"],"antonyms":[]}],"etymology":{"value":"由来はフランツ・アントン・メスメル（Franz Anton Mesmer）の動物磁気療法（アニマル・マグネティズム）の理論から派生した「zoism」という言葉に関連する。19世紀に、この療法の実践者や信奉者を指す言葉として使われた。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈzoʊɪst/","syllables":"Zo-ist"},"inflection":{"noun_plural":"Zoists"},"usage_notes":{"explanation":"「Zoist」は歴史的な用語であり、現代ではほとんど使われません。動物磁気療法自体が科学的に否定されているため、この言葉を使う場面は非常に限られています。歴史的な文脈や、動物磁気療法について議論する際に用いられることがあります。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a zoist and believes in modern medicine.","correct":"✓ He was a zoist and believed in animal magnetism.","note":"ゾイストは動物磁気療法を信奉していたため、現代医学と両立することはありません。"},{"incorrect":"✗ Zoist is a new type of therapy.","correct":"✓ Animal magnetism was a historical type of therapy.","note":"ゾイストに関連する治療法は現代では一般的ではありません。"}],"priority":"★☆☆"},"related_words":{"derivatives":["zoism (名詞: 動物磁気療法)","mesmerism (名詞: 動物磁気療法、催眠術)","mesmerize (動詞: 魅了する、催眠術をかける)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 歴史的な文脈でのみ使用される。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「Zoist」は、現代ではほとんど使われない歴史的な単語です。19世紀に動物磁気療法（アニマル・マグネティズム）を実践または信奉していた人々を指します。この療法は、フランツ・アントン・メスメルによって提唱され、病気を治療するために動物磁気を使用するというものでした。現代科学では否定されているため、「Zoist」という言葉は歴史的な文脈でのみ用いられます。動物磁気療法やメスメリズムに関する文献を読む際に遭遇する可能性があります。"},"example_sentences":[{"sentence":"The 19th-century pamphlet described the methods used by Zoists to induce trances in their patients.","translation":"19世紀のパンフレットには、ゾイストたちが患者にトランス状態を誘発するために用いた方法が記述されていた。","type":"noun","meaning_category":"動物磁気療法の実践者"},{"sentence":"Many people in the Victorian era were skeptical of the claims made by Zoists.","translation":"ヴィクトリア朝時代には、多くの人々がゾイストたちの主張に懐疑的だった。","type":"noun","meaning_category":"動物磁気療法の実践者"}]}