{"word":"undeferrable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"延期できない、先送りできない","english_definition":"Not able to be deferred; that cannot be postponed or delayed.","examples":[{"sentence":"This task is undeferrable; it must be completed immediately.","translation":"このタスクは延期できません。すぐに完了させる必要があります。"},{"sentence":"The meeting is undeferrable due to the urgency of the matter.","translation":"会議は事態の緊急性から延期できません。"}],"collocations":["undeferrable task","undeferrable meeting","undeferrable obligation"],"synonyms":["inescapable","unavoidable","urgent","pressing","imperative"],"antonyms":["deferrable","postponable","delayable","avoidable","nonurgent"]}],"etymology":{"value":"The word 'undeferrable' is formed by adding the prefix 'un-' (meaning 'not') to the word 'deferrable'. 'Deferrable' comes from 'defer', which originates from the Latin word 'differre', meaning 'to carry away, postpone, differ'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌndɪˈfɜːrəbəl/","syllables":"un-de-fer-ra-ble"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more undeferrable, most undeferrable), though these are less common."},"usage_notes":{"explanation":"'Undeferrable' is a formal word used to describe something that cannot be postponed or delayed. It implies a sense of urgency or necessity. It is often used in professional or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undeferrable of the meeting caused some issues.","correct":"✓ The undeferrability of the meeting caused some issues.","note":"'Undeferrable' is an adjective, not a noun. The noun form is 'undeferrability'."},{"incorrect":"✗ This task is undeferrable than that one.","correct":"✓ This task is more undeferrable than that one.","note":"While grammatically correct, using 'more undeferrable' is less common and can sound awkward. Consider rephrasing or using a stronger synonym."}],"priority":"★★☆"},"related_words":{"derivatives":["undeferrability (noun): the state of being undeferrable","defer (verb): to postpone","deferrable (adjective): able to be postponed","deferment (noun): the act of postponing"],"phrases":["not undeferrable (double negative, meaning 'deferrable')"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. This is a relatively uncommon word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'undeferrable' is a relatively uncommon and formal word. It is best used in situations where you want to emphasize that something absolutely cannot be postponed. Because it is not a commonly used word, it may be better to use simpler synonyms like 'urgent' or 'inescapable' in many contexts to ensure clarity."},"example_sentences":[{"sentence":"The deadline for submitting the application is undeferrable.","translation":"申請書の提出期限は延期できません。","type":"adjective","meaning_category":"cannot be postponed"},{"sentence":"Due to the critical nature of the situation, any further action is undeferrable.","translation":"状況の重大さから、これ以上の行動の延期は認められません。","type":"adjective","meaning_category":"cannot be delayed"},{"sentence":"The patient's surgery was deemed undeferrable due to the severity of their condition.","translation":"患者の状態の重さから、手術は延期できないと判断されました。","type":"adjective","meaning_category":"cannot be postponed"}]}