{"word":"multipole","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"多極子","english_definition":"A configuration of charges or currents that produces a field whose strength varies inversely with a power of the distance greater than one.","examples":[{"sentence":"The electric field of a multipole falls off faster with distance than that of a dipole.","translation":"多極子の電場は、双極子の電場よりも距離とともに急速に減衰する。"}],"collocations":["electric multipole","magnetic multipole","multipole expansion","multipole moment"],"synonyms":["none"],"antonyms":["monopole","dipole"]},{"part_of_speech":"adjective","definition":"多極の","english_definition":"Having multiple poles.","examples":[{"sentence":"Multipole magnets are used in particle accelerators to focus the particle beam.","translation":"多極磁石は、粒子加速器で粒子ビームを収束させるために使用される。"}],"collocations":["multipole magnet","multipole field"],"synonyms":["multipolar"],"antonyms":["unipolar","bipolar"]}],"etymology":{"value":"Derived from the combination of 'multi-' (meaning many) and 'pole'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmʌltɪpoʊl/","syllables":"mul-ti-pole"},"inflection":{"noun_plural":"multipoles"},"usage_notes":{"explanation":"In physics, a multipole is a series expansion used to represent a field (e.g., electric or magnetic) generated by a localized source. The expansion consists of terms with different angular dependencies and radial fall-off rates. The first few terms are the monopole, dipole, quadrupole, octupole, and so on. Multipole expansions are useful for approximating fields at large distances from the source.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The multipole is more simple than a dipole.","correct":"✓ The multipole is more complex than a dipole.","note":"Multipoles are generally more complex than dipoles, as they involve higher-order terms in the expansion."}],"priority":"★★☆"},"related_words":{"derivatives":["multipole expansion","multipole moment"],"related_terms":["monopole","dipole","quadrupole","octupole"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'multipole' is primarily used in physics, particularly in electromagnetism and related fields. It refers to a series expansion representing a field generated by a localized source, with terms like monopole, dipole, quadrupole, etc. Understanding this term requires a background in physics and mathematics.","priority":"★★★"},"example_sentences":[{"sentence":"The multipole expansion is a useful tool for calculating the electric potential of a charge distribution.","translation":"多極子展開は、電荷分布の電位を計算するための便利なツールです。","type":"noun","meaning_category":"Physics"},{"sentence":"Multipole magnets are essential components in modern particle accelerators.","translation":"多極磁石は、現代の粒子加速器に不可欠な部品です。","type":"adjective","meaning_category":"Physics"}]}