{"word":"Muscicole","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A bird of the Old World flycatcher family (Muscicapidae).","english_definition":"A bird belonging to the family Muscicapidae, commonly known as Old World flycatchers.","examples":[{"sentence":"The European robin is a well-known muscicole.","translation":"ヨーロッパコマドリはよく知られたMuscicole（ヒタキ科の鳥）です。"}],"collocations":["Old World flycatcher","Muscicapidae family"],"synonyms":["Old World flycatcher"],"antonyms":[]}],"etymology":{"value":"From Latin 'musca' (fly) + '-cola' (dweller), referring to their fly-catching habits.","priority":"★★☆"},"pronunciation":{"ipa":"/mjuːˈsɪkəʊl/","syllables":"mu-si-cole"},"inflection":{"noun_plural":"muscicoles"},"usage_notes":{"explanation":"The term 'muscicole' is primarily used in ornithology to refer to birds within the Muscicapidae family. It's a more technical or scientific term, less commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The muscicole is a mammal.","correct":"✓ The muscicole is a bird.","note":"Muscicoles are birds, specifically belonging to the Old World flycatcher family."}],"priority":"★★☆"},"related_words":{"derivatives":["Muscicapidae (family name)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Muscicole' is a specialized term used in ornithology to refer to birds of the Muscicapidae family, commonly known as Old World flycatchers. Due to its technical nature and limited usage outside of scientific contexts, it is considered an advanced term. Understanding this word requires familiarity with biological classifications and bird identification.","translation":"「Muscicole」は、鳥類学で使用される専門用語で、一般に旧世界のヒタキとして知られるヒタキ科の鳥を指します。その技術的な性質と科学的な文脈以外での使用が限られているため、高度な用語と見なされます。この単語を理解するには、生物学的分類と鳥の識別に精通している必要があります。"},"example_sentences":[{"sentence":"The ornithologist studied the foraging behavior of the muscicole in the forest.","translation":"鳥類学者は、森林におけるmuscicole（ヒタキ科の鳥）の採餌行動を研究しました。","type":"noun","meaning_category":"bird"},{"sentence":"Several species of muscicoles are known for their melodious songs.","translation":"いくつかのmuscicole（ヒタキ科の鳥）の種は、そのメロディアスな歌で知られています。","type":"noun","meaning_category":"bird"}]}