{"word":"Raptness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"夢中、熱中、没頭","english_definition":"The state of being completely fascinated or absorbed by what one is seeing or hearing.","examples":[{"sentence":"The audience listened with raptness to the speaker's compelling story.","translation":"聴衆は講演者の説得力のある話に夢中で聞き入った。"},{"sentence":"Her raptness in the novel made her forget everything around her.","translation":"彼女は小説に夢中になり、周りのすべてのことを忘れてしまった。"},{"sentence":"The child watched the magician with complete raptness.","translation":"子供は完全に夢中でマジシャンを見ていた。"}],"collocations":["complete raptness","utter raptness","with raptness","in raptness"],"synonyms":["absorption","fascination","engrossment","entrancement","preoccupation","immersion"],"antonyms":["distraction","apathy","indifference","boredom"]}],"etymology":{"value":"Derived from the word 'rapt', which comes from the Latin 'raptus', the past participle of 'rapere' meaning 'to seize, carry off'. The sense evolved from being 'carried away' physically to being 'carried away' emotionally or mentally.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈræptnəs/","syllables":"rapt-ness"},"inflection":{"noun_plural":"raptnesses (rarely used)"},"usage_notes":{"explanation":"'Raptness' describes a state of intense focus and absorption, often accompanied by a sense of wonder or delight. It is a stronger term than 'interest' or 'attention', suggesting a complete mental and emotional immersion in the subject at hand. It is often used to describe the reaction of an audience to a performance or the state of someone deeply engaged in an activity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She showed raptness for the boring lecture.","correct":"✓ She showed no raptness for the boring lecture. / ✓ She showed a lack of raptness for the boring lecture.","note":"'Raptness' implies a positive engagement. If someone is not engaged, use 'lack of raptness' or state the opposite emotion (e.g., boredom)."},{"incorrect":"✗ He was in raptness.","correct":"✓ He was in a state of raptness. / ✓ He listened with raptness.","note":"'Raptness' is a noun. Use 'a state of raptness' or the adverbial phrase 'with raptness' to describe someone experiencing this state."}],"priority":"★☆☆"},"related_words":{"derivatives":["rapt (adjective)","raptly (adverb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Raptness' is a relatively uncommon word that describes a state of being completely absorbed or fascinated by something. It implies a strong level of engagement and attention, often to the exclusion of everything else. You might encounter this word in literature or formal writing when describing someone's intense focus or emotional involvement.","priority":"★☆☆"},"example_sentences":[{"sentence":"The pianist played with such skill that the entire hall was filled with an atmosphere of raptness.","translation":"ピアニストは非常に巧みな演奏をしたので、ホール全体が夢中な雰囲気に包まれた。","type":"noun","meaning_category":"夢中"},{"sentence":"She gazed at the painting with a look of utter raptness, lost in its beauty.","translation":"彼女はその絵の美しさに心を奪われ、完全に夢中になって見つめていた。","type":"noun","meaning_category":"没頭"},{"sentence":"The children listened with raptness as their grandfather told them stories of his adventures.","translation":"子供たちは祖父が冒険の話をしてくれるのを夢中で聞いていた。","type":"noun","meaning_category":"熱中"}]}