{"word":"plenipotence","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"全能、絶対的な力","english_definition":"the quality or state of being all-powerful; omnipotence.","examples":[{"sentence":"The plenipotence of God is a central tenet of many religions.","translation":"神の全能性は多くの宗教の中心的な教義です。"},{"sentence":"He spoke of the plenipotence of the human will.","translation":"彼は人間の意志の全能性について語った。"}],"collocations":["divine plenipotence (神の全能)","absolute plenipotence (絶対的な全能)"],"synonyms":["omnipotence","almightiness","supreme power","unlimited power"],"antonyms":["impotence","weakness","powerlessness"]}],"etymology":{"value":"Late Middle English: from late Latin ‘plenipotentia’, from plenipotens, ‘having full power’ (see plenipotentiary).","priority":"★★☆"},"pronunciation":{"ipa":"/pləˈnɪpətəns/","syllables":"ple-nip-o-tence"},"inflection":{"noun_plural":"plenipotences (rare)"},"usage_notes":{"explanation":"\"Plenipotence\" is a formal and somewhat rare word that specifically refers to the state of having complete or unlimited power. It is often used in religious or philosophical contexts to describe the attributes of a deity or the theoretical potential of human will. It is a more abstract and less commonly used synonym for \"omnipotence.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He demonstrated his plenipotence by lifting the car.","correct":"✓ He demonstrated his strength by lifting the car.","note":"\"Plenipotence\" refers to the state of having unlimited power, not a specific act of strength. Use \"strength\" or \"power\" for physical demonstrations."},{"incorrect":"✗ The plenipotence of the government was used to suppress dissent.","correct":"✓ The power of the government was used to suppress dissent.","note":"While \"plenipotence\" can describe governmental power, it is more common and natural to use \"power\" in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["plenipotent (adjective: having full power)","plenipotentiary (noun: a person invested with full power to take independent action)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare, academic/philosophical context)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Plenipotence\" is a rare and formal word indicating complete or unlimited power. It's primarily used in philosophical or theological discussions, particularly when referring to the attributes of a deity. Due to its specialized usage, it's not commonly encountered in everyday language. Understanding its meaning is more relevant in academic or religious contexts rather than general communication."},"example_sentences":[{"sentence":"The concept of divine plenipotence is debated among theologians.","translation":"神の全能性の概念は神学者たちの間で議論されています。","type":"noun","meaning_category":"全能"},{"sentence":"Some philosophers argue about the limits, if any, to human plenipotence.","translation":"一部の哲学者は、人間の全能性に限界があるかどうかについて議論しています。","type":"noun","meaning_category":"全能"}]}