{"word":"absorptivity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"吸収率、吸光度","english_definition":"The capacity of a material to absorb electromagnetic radiation; specifically, the fraction of incident radiation absorbed per unit path length or per unit concentration.","examples":[{"sentence":"The absorptivity of the solution was measured using a spectrophotometer.","translation":"その溶液の吸収率は分光光度計を用いて測定された。"},{"sentence":"The absorptivity of the material varies with the wavelength of the incident light.","translation":"その材料の吸収率は入射光の波長によって変化する。"}],"collocations":["molar absorptivity","spectral absorptivity","high absorptivity","low absorptivity"],"synonyms":["absorption coefficient","extinction coefficient","absorbance"],"antonyms":["transmittance","reflectivity"]}],"etymology":{"value":"Derived from 'absorptive' (capable of absorbing) + '-ity' (a suffix denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/æbˌsɔːrpˈtɪvɪti/","syllables":"ab-sorp-ti-vi-ty"},"inflection":{"noun_plural":"absorptivities"},"usage_notes":{"explanation":"'Absorptivity' is a material property that quantifies how well a substance absorbs electromagnetic radiation, such as light. It is often used in physics, chemistry, and materials science. It can be wavelength-dependent, meaning that a material may absorb some wavelengths more strongly than others. Molar absorptivity is a specific type of absorptivity that is normalized to the concentration of the absorbing substance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The absorptivity is high, so the light passes through.","correct":"✓ The absorptivity is high, so the light is absorbed.","note":"High absorptivity means that the material absorbs light, not that it transmits it. Transmittance is the opposite of absorptivity."},{"incorrect":"✗ Absorbance and absorptivity are the same.","correct":"✓ Absorbance is related to absorptivity, but they are not the same. Absorbance depends on the path length and concentration, while absorptivity is a material property.","note":"Absorbance is the measure of light absorbed by a solution, while absorptivity is a property of the substance itself."}],"priority":"★★☆"},"related_words":{"derivatives":["absorb","absorption","absorptive","absorbance"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Absorptivity' is a technical term used in science and engineering to describe how well a material absorbs electromagnetic radiation. It's a quantitative measure, often used in fields like spectroscopy to analyze the composition and properties of substances. Understanding absorptivity is important for anyone working with light or other forms of electromagnetic radiation, as it helps predict how a material will interact with that radiation."},"example_sentences":[{"sentence":"The high absorptivity of the coating makes it ideal for solar panels.","translation":"そのコーティングの高い吸収率により、太陽光パネルに最適である。","type":"noun","meaning_category":"absorption of radiation"},{"sentence":"We determined the molar absorptivity of the dye at 520 nm.","translation":"我々は、その色素のモル吸光度を520nmで決定した。","type":"noun","meaning_category":"molar absorption"}]}