{"word":"rawnesses","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)生の、未加工の状態、未熟さ、痛々しさ、むき出しの状態、感情の露わさ","english_definition":"(plural form of rawness) the state of being raw; inexperience; painfulness; the condition of being exposed; emotional vulnerability.","examples":[{"sentence":"The rawnesses of the wound made it very sensitive to the touch.","translation":"傷口のむき出しの状態が、触ると非常に敏感にさせた。"},{"sentence":"The rawnesses of his grief were still evident months after the loss.","translation":"彼の悲しみの露わさは、失ってから数ヶ月経ってもまだ明らかだった。"},{"sentence":"The rawnesses of the data made it difficult to draw any firm conclusions.","translation":"データの未加工の状態では、確固たる結論を引き出すのが困難だった。"}],"collocations":["emotional rawnesses (感情の露わさ)","rawnesses of grief (悲しみの露わさ)","rawnesses of the wound (傷口のむき出しの状態)","data rawnesses (データの未加工の状態)"],"synonyms":["vulnerability","exposure","tenderness","inexperience","crudeness"],"antonyms":["sophistication","refinement","processed","healed","callousness"]}],"etymology":{"value":"'Rawnesses' is the plural form of 'rawness'. 'Rawness' is derived from 'raw', which comes from Old English 'hreaw', meaning uncooked, unripe, or crude. The suffix '-ness' is added to form a noun indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɔːnəsɪz/","syllables":"raw-ness-es"},"inflection":{"noun_plural":"rawnesses"},"usage_notes":{"explanation":"'Rawnesses' is the plural form of 'rawness', which is a noun that describes the state or quality of being raw. It can refer to the physical state of something being uncooked or unprocessed, the emotional state of being vulnerable or exposed, or the state of being inexperienced or crude. The plural form is used when referring to multiple instances or aspects of this state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rawnesses was evident.","correct":"✓ The rawnesses were evident.","note":"Since 'rawnesses' is a plural noun, it requires a plural verb form ('were' instead of 'was')."},{"incorrect":"✗ He showed much rawnesses.","correct":"✓ He showed much rawness.","note":"'Rawnesses' is used when referring to multiple instances or aspects of rawness. If referring to the general state, use the singular form 'rawness'."}],"priority":"★★☆"},"related_words":{"derivatives":["raw","rawly"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'rawnesses' is the plural form of 'rawness', which describes the state of being raw, exposed, or emotionally vulnerable. It's not a commonly used word and is more likely to appear in literary or academic contexts when describing multiple instances or aspects of a raw or exposed state. Understanding the root word 'raw' is essential to grasping the meaning of 'rawnesses'."},"example_sentences":[{"sentence":"The chef emphasized the importance of using fresh ingredients to capture the rawnesses of the flavors.","translation":"シェフは、風味の生のままの状態を捉えるために、新鮮な食材を使うことの重要性を強調した。","type":"noun","meaning_category":"unprocessed state"},{"sentence":"The play explored the emotional rawnesses of the characters, leaving the audience deeply moved.","translation":"その劇は登場人物の感情の露わさを探求し、観客を深く感動させた。","type":"noun","meaning_category":"emotional vulnerability"},{"sentence":"The rawnesses in the data set made it difficult to draw definitive conclusions.","translation":"データセットの未加工の状態では、明確な結論を導き出すのが難しかった。","type":"noun","meaning_category":"unprocessed state"}]}