{"word":"conchie","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にイギリス英語、軽蔑的) 良心的兵役拒否者","english_definition":"(mainly British English, derogatory) a conscientious objector, especially during wartime.","examples":[{"sentence":"During World War I, many conchies faced imprisonment for refusing to fight.","translation":"第一次世界大戦中、多くの良心的兵役拒否者は戦闘を拒否したために投獄された。"},{"sentence":"He was labeled a 'conchie' by those who supported the war.","translation":"彼は戦争を支持する人々から「良心的兵役拒否者」というレッテルを貼られた。"}],"collocations":["be a conchie","label someone a conchie"],"synonyms":["conscientious objector","pacifist","objector"],"antonyms":["soldier","combatant","warrior"]}],"etymology":{"value":"'Conchie' is a shortened, informal, and often derogatory term for 'conscientious objector'. It arose during World War I to refer to individuals who refused to serve in the armed forces on moral or religious grounds.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒntʃi/","syllables":"con-chie"},"inflection":{"noun_plural":"conchies"},"usage_notes":{"explanation":"The term 'conchie' is primarily used in British English and carries a negative connotation, especially when used by those who support military action. It is often considered offensive by conscientious objectors themselves, who prefer to be called 'conscientious objectors' or 'pacifists'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a conchie because he was scared of fighting.","correct":"✓ He was a conchie because of his moral beliefs against war.","note":"A 'conchie' is someone who objects to war on moral or religious grounds, not simply because they are afraid. The objection is based on conscience."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["conscientious objector","pacifism","pacifist","conscience"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare, historical context)","frequency_google_ngram":"Very low frequency. Primarily used in historical contexts related to wars.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Conchie' is a somewhat obscure and potentially offensive term for a conscientious objector, someone who refuses to participate in military service due to moral or religious beliefs. It's mainly used in British English and is most often encountered in historical contexts, particularly those related to World War I and World War II. Because of its potential to offend, it is best to use the term 'conscientious objector' instead, unless you are specifically discussing the historical use of the word 'conchie'."},"example_sentences":[{"sentence":"The 'conchies' were often ostracized by their communities during wartime.","translation":"「良心的兵役拒否者」は戦時中、しばしば地域社会から排斥された。","type":"noun","meaning_category":"良心的兵役拒否者"},{"sentence":"He declared himself a 'conchie' and refused to be drafted.","translation":"彼は自身を「良心的兵役拒否者」であると宣言し、徴兵を拒否した。","type":"noun","meaning_category":"良心的兵役拒否者"}]}