{"word":"language-accommodating","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"言語対応の、多言語対応の、言語に配慮した","english_definition":"Designed or able to adapt to different languages; showing consideration for linguistic diversity.","examples":[{"sentence":"The website is language-accommodating, offering content in multiple languages.","translation":"そのウェブサイトは多言語対応で、複数の言語でコンテンツを提供しています。"},{"sentence":"A language-accommodating approach is essential for global marketing campaigns.","translation":"グローバルマーケティングキャンペーンには、言語に配慮したアプローチが不可欠です。"},{"sentence":"The software is language-accommodating, allowing users to select their preferred language.","translation":"そのソフトウェアは言語対応で、ユーザーは好みの言語を選択できます。"}],"collocations":["language-accommodating website (多言語対応ウェブサイト)","language-accommodating software (多言語対応ソフトウェア)","language-accommodating approach (言語に配慮したアプローチ)","language-accommodating design (言語対応設計)"],"synonyms":["multilingual","localized","internationalized"],"antonyms":["monolingual","language-insensitive"]}],"etymology":{"value":"'Language' + 'accommodating'. 'Language' refers to a system of communication used by a particular community or country. 'Accommodating' comes from the verb 'accommodate', meaning to provide sufficient space for; to be agreeable or compliant.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlæŋɡwɪdʒ əˈkɒmədeɪtɪŋ/","syllables":"lan-guage-ac-com-mo-dat-ing"},"inflection":{"notes":"This is an adjective, so it doesn't inflect like a verb. The comparative and superlative forms would be 'more language-accommodating' and 'most language-accommodating' respectively, but these are rarely used."},"usage_notes":{"explanation":"'Language-accommodating' is typically used to describe systems, products, or approaches that are designed to work effectively with multiple languages or to be sensitive to linguistic differences. It implies a level of adaptability and consideration for users who speak different languages.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is accommodating language.","correct":"✓ The company is language-accommodating.","note":"'Accommodating language' doesn't make sense. 'Language-accommodating' is the correct compound adjective."},{"incorrect":"✗ The website is language accommodate.","correct":"✓ The website is language-accommodating.","note":"'Accommodate' is a verb. The adjective form 'accommodating' is needed."}],"priority":"★★☆"},"related_words":{"derivatives":["accommodation (名詞: 適応、便宜)","accommodate (動詞: 適応させる、便宜を図る)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (Technical or specialized vocabulary)","frequency_google_ngram":"Low frequency - Relatively uncommon, used in technical or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'language-accommodating' is used in technical or professional contexts to describe something that is designed to be easily adapted for use with different languages. It implies a proactive approach to linguistic diversity and usability across different language groups. This term is more common in fields like software development, website design, and international marketing."},"example_sentences":[{"sentence":"The new software update is more language-accommodating, supporting right-to-left languages.","translation":"新しいソフトウェアアップデートは、より言語対応になり、右から左に書く言語をサポートしています。","type":"adjective","meaning_category":"言語対応の"},{"sentence":"A language-accommodating design is crucial for reaching a global audience.","translation":"言語対応設計は、グローバルな視聴者にリーチするために重要です。","type":"adjective","meaning_category":"言語に配慮した"},{"sentence":"The company's language-accommodating policies helped them expand into new markets.","translation":"その会社の言語対応ポリシーは、新しい市場への拡大に役立ちました。","type":"adjective","meaning_category":"多言語対応の"}]}