{"word":"Stambha","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(インドの建築)柱、塔、支柱。特に、宗教的な意味を持つ記念柱。","english_definition":"(Indian architecture) A pillar, column, or post; especially a monumental pillar with religious significance.","examples":[{"sentence":"The Ashoka Stambha is a famous example of ancient Indian pillars.","translation":"アショーカの石柱は、古代インドの柱の有名な例です。"},{"sentence":"Many temples feature a stambha in front of the main shrine.","translation":"多くの寺院は、本堂の前に柱を設けています。"}],"collocations":["Ashoka Stambha (アショーカの石柱)","victory stambha (勝利の柱)","dhwaja stambha (旗竿柱)"],"synonyms":["pillar","column","post","tower","monolith"],"antonyms":[]}],"etymology":{"value":"サンスクリット語の 'स्तम्भ' (stambha) に由来し、これは「支える、固定する」という意味の語根 'स्तम्भ्' (stambh) から派生しています。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstʌmbə/","syllables":"stam-bha"},"inflection":{"noun_plural":"stambhas"},"usage_notes":{"explanation":"'Stambha' は、インドの建築、特に寺院建築において重要な要素です。宗教的な意味合いを持つ記念柱として建てられることが多く、神聖な場所を示す役割を果たします。アショーカ王の石柱のように、歴史的な意義を持つものもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The stambha was made of wood.","correct":"✓ The stambha was made of stone.","note":"Stambhas are traditionally made of stone, though other materials might be used in modern interpretations."}],"priority":"★☆☆"},"related_words":{"derivatives":["stambhana (サンスクリット語: 抑制、停止)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - インドの建築や文化に関する文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stambha' is a specialized term related to Indian architecture and religious structures. It refers to a pillar or column, often with symbolic or historical significance. Understanding this term requires familiarity with Indian cultural and architectural contexts. It's not commonly used in general English.","note":"This word is specific to Indian architecture and culture and is not commonly used in general English."},"example_sentences":[{"sentence":"The intricately carved stambha stood as a testament to the skilled artisans of the era.","translation":"精巧に彫刻された柱は、その時代の熟練した職人たちの証として立っていた。","type":"noun","meaning_category":"柱 (記念柱)"},{"sentence":"The temple's dhwaja stambha, adorned with colorful flags, marked the entrance to the sacred grounds.","translation":"色とりどりの旗で飾られた寺院の旗竿柱は、神聖な場所への入り口を示していた。","type":"noun","meaning_category":"柱 (旗竿柱)"}]}