{"word":"Dieffenbachia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ディフェンバキア (植物)","english_definition":"A genus of tropical flowering plants in the family Araceae, native to the Neotropics. It is popular as a houseplant, but its sap is poisonous and can cause temporary speechlessness.","examples":[{"sentence":"She has a large Dieffenbachia in her living room.","translation":"彼女はリビングに大きなディフェンバキアを置いている。"},{"sentence":"Be careful when handling Dieffenbachia, as the sap can irritate the skin.","translation":"ディフェンバキアを取り扱う際は、樹液が皮膚を刺激する可能性があるため注意してください。"}],"collocations":["grow Dieffenbachia","care for Dieffenbachia","poisonous Dieffenbachia","Dieffenbachia plant","Dieffenbachia sap"],"synonyms":["dumb cane","Araceae"],"antonyms":[]}],"etymology":{"value":"Named after Joseph Dieffenbach (1796–1863), a German botanist and gardener.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːfənˈbækiə/","syllables":"Dief-fen-bach-i-a"},"inflection":{"noun_plural":"Dieffenbachias"},"usage_notes":{"explanation":"Dieffenbachia is a popular houseplant known for its decorative leaves. However, it's important to be aware that its sap contains calcium oxalate crystals, which can cause a temporary burning sensation and speechlessness if ingested, hence the common name 'dumb cane'. Keep it out of reach of children and pets.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I watered my Dieffenbachia too much and it died.","correct":"✓ I overwatered my Dieffenbachia and it died.","note":"'Overwatered' is a more common and concise way to say 'watered too much' when referring to plants."},{"incorrect":"✗ The Dieffenbachia is a very sensible plant.","correct":"✓ The Dieffenbachia is a very sensitive plant.","note":"'Sensible' means reasonable or practical, while 'sensitive' means easily affected or damaged. Dieffenbachias are sensitive to overwatering and cold temperatures."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Dieffenbachia is a relatively uncommon word referring to a specific type of houseplant. Understanding the word requires some familiarity with botany or gardening. The word is primarily used by people who are interested in or knowledgeable about houseplants. The main point to remember is that it is a type of plant and that it can be poisonous if ingested.","priority":"★☆☆"},"example_sentences":[{"sentence":"The office lobby was decorated with several large Dieffenbachia plants.","translation":"オフィスのロビーはいくつかの大きなディフェンバキアの植物で飾られていた。","type":"noun","meaning_category":"plant"},{"sentence":"She repotted her Dieffenbachia into a larger container.","translation":"彼女はディフェンバキアをより大きな鉢に植え替えた。","type":"noun","meaning_category":"plant"},{"sentence":"Dieffenbachia plants are known for their air-purifying qualities.","translation":"ディフェンバキアは空気清浄効果があることで知られている。","type":"noun","meaning_category":"plant"}]}