{"word":"self-righter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"自己復元装置、自己修正装置","english_definition":"A device or mechanism that automatically returns to an upright or correct position after being tilted or disturbed.","examples":[{"sentence":"The toy boat had a self-righter so it wouldn't capsize easily.","translation":"そのおもちゃのボートは自己復元装置が付いていたので、簡単には転覆しなかった。"},{"sentence":"This type of buoy is equipped with a self-righter to ensure it remains visible.","translation":"このタイプのブイは、視認性を保つために自己復元装置が装備されている。"}],"collocations":["equipped with a self-righter","incorporate a self-righter","automatic self-righter"],"synonyms":["self-correcting mechanism","automatic righting system","stability device"],"antonyms":[]}],"etymology":{"value":"The term is formed by combining \"self-\" (meaning acting automatically or on its own) with \"righter\" (someone or something that rights or corrects).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˈraɪtər/","syllables":"self-right-er"},"inflection":{"noun_plural":"self-righters"},"usage_notes":{"explanation":"A \"self-righter\" is typically used in the context of objects that need to maintain a specific orientation, such as boats, buoys, or certain types of machinery. The device ensures that the object returns to its intended position even if it is temporarily displaced.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The self-righter was righting the ship.","correct":"✓ The self-righter kept the ship from capsizing.","note":"The self-righter is a device, not an active agent. It doesn't \"right\" the ship, but rather prevents it from staying overturned."}],"priority":"★★☆"},"related_words":{"derivatives":["self-righting (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"self-righter\" refers to a device that automatically returns something to an upright position. This is often used in technical contexts, such as describing features of boats or machinery. Understanding the term requires some familiarity with technical vocabulary and the concept of automatic mechanisms.","priority":"★★☆"},"example_sentences":[{"sentence":"The lifeboat is designed with a **self-righter** to ensure it can recover from capsizing in rough seas.","translation":"その救命艇は、荒れた海で転覆しても復元できるように自己復元装置が設計されている。","type":"noun","meaning_category":"Device"},{"sentence":"The buoy's **self-righter** kept it upright despite the strong currents.","translation":"強い海流にもかかわらず、ブイの自己復元装置はブイを直立状態に保った。","type":"noun","meaning_category":"Device"}]}