{"word":"Diadochy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) ディアドコイ、アレクサンドロス大王の死後、その帝国を分割・統治した将軍たち。また、その時代。","english_definition":"(historical) The successors of Alexander the Great, the generals who divided and ruled his empire after his death; also, the era in which they ruled.","examples":[{"sentence":"The Diadochy fought amongst themselves for control of Alexander's vast empire.","translation":"ディアドコイたちは、アレクサンドロスの広大な帝国の支配権をめぐって互いに争った。"},{"sentence":"The Diadochy period was marked by constant warfare and shifting alliances.","translation":"ディアドコイ時代は、絶え間ない戦争と変化する同盟関係によって特徴づけられた。"}],"collocations":["Wars of the Diadochi","Diadochi kingdoms","Hellenistic period"],"synonyms":["Successors","Generals of Alexander"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'diadochos' (διάδοχος), meaning 'successor'.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈædəki/","syllables":"Di-a-do-chy"},"inflection":{"noun_plural":"Diadochies"},"usage_notes":{"explanation":"'Diadochy' refers specifically to the historical period and the individuals who succeeded Alexander the Great. It is not a general term for successors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a diadochy of the company.","correct":"✓ He was a successor in the company.","note":"'Diadochy' is specific to the historical context of Alexander's successors, not general succession."}],"priority":"★★☆"},"related_words":{"derivatives":["Diadoch (singular form, referring to one of the successors)","Diadochian (adjective, relating to the Diadochi)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Diadochy' is a highly specialized term used in the context of ancient history, specifically referring to the successors of Alexander the Great and the period following his death. It is unlikely to be encountered outside of academic or historical contexts. Understanding requires knowledge of Hellenistic history.","priority":"★★☆"},"example_sentences":[{"sentence":"The fragmentation of Alexander's empire began almost immediately after his death, as the **Diadochy** vied for power.","translation":"アレクサンドロスの帝国の分裂は、彼の死後ほぼすぐに始まり、ディアドコイたちが権力を争った。","type":"noun","meaning_category":"historical"},{"sentence":"The **Diadochy** established new dynasties and kingdoms throughout the Hellenistic world.","translation":"ディアドコイたちは、ヘレニズム世界全体に新しい王朝と王国を築いた。","type":"noun","meaning_category":"historical"}]}