{"word":"dowsing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ダウジング、水脈探し、鉱脈探し","english_definition":"The practice of using a forked stick, rod, pendulum, or similar device to locate underground water, minerals, or other hidden or missing items.","examples":[{"sentence":"Dowsing is often used to find sources of groundwater.","translation":"ダウジングは地下水源を見つけるためによく使用されます。"},{"sentence":"Some people believe in dowsing, while others are skeptical.","translation":"ダウジングを信じる人もいれば、懐疑的な人もいます。"},{"sentence":"He tried dowsing to locate the lost ring in the garden.","translation":"彼は庭で紛失した指輪を見つけるためにダウジングを試みました。"}],"collocations":["water dowsing","mineral dowsing","locate with dowsing","practice dowsing","believe in dowsing"],"synonyms":["divining","water witching","rhabdomancy"],"antonyms":[]}],"etymology":{"value":"The origin of the word 'dowsing' is uncertain, but it is believed to be related to the Middle English word 'dowse,' which meant 'to strike, fall.' This may refer to the movement of the dowsing rod when a target is located.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdaʊzɪŋ/","syllables":"dows-ing"},"inflection":{"noun_plural":"dowsings"},"usage_notes":{"explanation":"Dowsing is a controversial practice, as its effectiveness has not been scientifically proven. Believers attribute the movement of the dowsing tool to various factors, such as paranormal abilities, subconscious muscle movements, or sensitivity to electromagnetic fields. Skeptics attribute any success to chance or the Barnum effect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used dowsing rod to find water.","correct":"✓ He used a dowsing rod to find water.","note":"'Dowsing rod' is a countable noun, so it needs an article ('a' or 'the') or a plural form."},{"incorrect":"✗ Dowsing is a science.","correct":"✓ Dowsing is a pseudoscience.","note":"Dowsing is not recognized as a legitimate science due to the lack of empirical evidence supporting its effectiveness."}],"priority":"★★☆"},"related_words":{"derivatives":["dowse (verb)","dowser (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dowsing' refers to the practice of using tools like rods or pendulums to find things hidden underground, like water or minerals. While some people believe it works, there's no scientific proof. It's a niche topic, so you won't hear about it as often as more common subjects."},"example_sentences":[{"sentence":"The farmer employed **dowsing** to find a new well location.","translation":"その農家は新しい井戸の場所を見つけるためにダウジングを使った。","type":"noun","meaning_category":"water/mineral finding"},{"sentence":"Despite the lack of scientific evidence, **dowsing** remains a popular practice in some rural areas.","translation":"科学的証拠がないにもかかわらず、ダウジングは一部の農村地域で人気のある慣習のままです。","type":"noun","meaning_category":"traditional practice"},{"sentence":"The **dowsing** rod dipped sharply, indicating a possible water source below.","translation":"ダウジングロッドが急激に傾き、地下に水源がある可能性を示唆した。","type":"noun","meaning_category":"tool indication"}]}