{"word":"reindex","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(データベース、検索エンジンなど)のインデックスを再構築する、再作成する","english_definition":"To rebuild or recreate an index, especially in a database or search engine.","examples":[{"sentence":"We need to reindex the database to improve search performance.","translation":"検索パフォーマンスを向上させるために、データベースのインデックスを再構築する必要があります。"},{"sentence":"The website was slow, so I decided to reindex the content.","translation":"ウェブサイトの動作が遅かったので、コンテンツのインデックスを再作成することにしました。"},{"sentence":"After the data migration, it's important to reindex the search engine.","translation":"データ移行後、検索エンジンのインデックスを再構築することが重要です。"}],"collocations":["reindex database","reindex search engine","reindex content","perform reindex","schedule reindex"],"synonyms":["rebuild index","refresh index","update index"],"antonyms":["index","deindex"]}],"etymology":{"value":"Prefix 're-' (again) + 'index'. Indicates performing the indexing process again.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈɪndeks/","syllables":"re-in-dex"},"inflection":{"verb_forms":{"present_simple":["reindex","reindexes"],"past_simple":"reindexed","past_participle":"reindexed","present_participle":"reindexing"}},"usage_notes":{"explanation":"\"Reindex\" is a technical term primarily used in the context of databases, search engines, and other systems that rely on indexes for efficient data retrieval. It refers to the process of recreating or rebuilding an index to improve performance, resolve inconsistencies, or reflect changes in the underlying data. Reindexing can be a resource-intensive operation, so it's often scheduled during off-peak hours.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"I need to re-index the files manually.","correct":"I need to reindex the files manually.","note":"The word is generally written as one word: reindex."}],"priority":"★★☆"},"related_words":{"derivatives":["reindexing (noun)","index (noun, verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Primarily a technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Reindex\" is a technical term mainly used in computer science and database management. It means to rebuild or refresh an index, which is a data structure that helps speed up searches. If you're not working with databases or search engines, you probably won't encounter this word often."},"example_sentences":[{"sentence":"The system administrator decided to reindex the entire file system.","translation":"システム管理者は、ファイルシステム全体を再インデックスすることにしました。","type":"verb (vt)","meaning_category":"インデックス再構築"},{"sentence":"Reindexing can take a significant amount of time, depending on the size of the database.","translation":"再インデックス処理は、データベースのサイズによってはかなりの時間がかかることがあります。","type":"noun (gerund)","meaning_category":"インデックス再構築"},{"sentence":"We scheduled a script to automatically reindex the data every night.","translation":"毎晩データを自動的に再インデックスするスクリプトをスケジュールしました。","type":"verb (vt)","meaning_category":"インデックス再構築"}]}