{"word":"dollyway","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A path or track used by a dolly, especially in film or television production.","english_definition":"A path or track used by a dolly, especially in film or television production.","examples":[{"sentence":"The camera smoothly glided along the dollyway during the tracking shot.","translation":"カメラは追跡ショットの間、ドリーウェイに沿ってスムーズに滑った。"}],"collocations":["camera dollyway","smooth dollyway"],"synonyms":["track","rail"],"antonyms":[]}],"etymology":{"value":"Combination of 'dolly' (a platform with wheels used to move a camera) and 'way' (a path or track).","priority":"★★★"},"pronunciation":{"ipa":"ˈdɒliweɪ","syllables":"dol-ly-way"},"inflection":{"noun_plural":"dollyways"},"usage_notes":{"explanation":"The term 'dollyway' is specific to the film and television industry. It refers to the physical path or track laid down to allow a camera dolly to move smoothly and consistently during a shot.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The camera was on a dollyway, so it was very quiet.","correct":"✓ The camera was on a dolly, so it was very quiet.","note":"'Dollyway' refers to the track, not the dolly itself."}],"priority":"★★☆"},"related_words":{"derivatives":["dolly (noun): a platform with wheels used to move a camera.","tracking shot (noun): a shot in which the camera follows a subject along a horizontal axis.","camera dolly (noun): a specialized piece of equipment used in filmmaking and television production to create smooth, controlled camera movements."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'dollyway' is a specialized term used in the film and television industry. Understanding requires familiarity with filmmaking equipment and techniques. It refers to the path or track that a camera dolly moves along to create smooth, controlled camera movements. It is not a commonly used word outside of this context."},"example_sentences":[{"sentence":"The gaffer ensured the dollyway was perfectly level for the next shot.","translation":"照明技師は、次のショットのためにドリーウェイが完全に水平であることを確認した。","type":"noun","meaning_category":"film production"},{"sentence":"Laying the dollyway took longer than expected, delaying the shoot.","translation":"ドリーウェイの設置に予想以上に時間がかかり、撮影が遅れた。","type":"noun","meaning_category":"film production"}]}