{"word":"horticulturalists","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"園芸家、園芸学者","english_definition":"An expert in the science and art of cultivating plants, including fruits, vegetables, flowers, and ornamental plants.","examples":[{"sentence":"Horticulturalists study plant growth and development to improve crop yields.","translation":"園芸家は、作物の収量を改善するために植物の成長と発達を研究します。"},{"sentence":"The horticulturalists at the botanical garden are responsible for maintaining the diverse plant collection.","translation":"植物園の園芸家たちは、多様な植物コレクションの維持を担当しています。"},{"sentence":"She hired horticulturalists to design and maintain her garden.","translation":"彼女は庭を設計し維持するために園芸家を雇いました。"}],"collocations":["professional horticulturalists","skilled horticulturalists","research horticulturalists","landscape horticulturalists","amateur horticulturalists"],"synonyms":["gardener","botanist","floriculturist","pomologist","oenologist"],"antonyms":[],"related_words":["horticulture","horticultural","horticulturally"]}],"etymology":{"value":"The word \"horticulturalist\" is derived from \"horticulture,\" which comes from the Latin words \"hortus\" (garden) and \"cultura\" (cultivation). The suffix \"-ist\" indicates a person who practices or is skilled in a particular field.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɔːrtɪˈkʌltʃərəlɪst/","syllables":"hor-ti-cul-tur-al-ist"},"inflection":{"noun_plural":"horticulturalists"},"usage_notes":{"explanation":"A horticulturalist is someone who specializes in the cultivation of plants, often for food, ornamental, or medicinal purposes. They may work in various settings, including gardens, nurseries, farms, research institutions, and botanical gardens. Horticulturalists apply scientific principles and techniques to improve plant growth, breeding, and management.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is a agriculturalist specializing in fruits.","correct":"He is a horticulturalist specializing in fruits.","note":"'Agriculturalist' is a broader term referring to agriculture in general, while 'horticulturalist' specifically refers to the cultivation of plants in gardens or orchards."},{"incorrect":"She is a gardeningist.","correct":"She is a horticulturalist.","note":"'Gardeningist' is not a standard word. The correct term is 'horticulturalist' or simply 'gardener'."}],"priority":"★★☆"},"related_words":{"derivatives":["horticulture","horticultural","horticulturally"],"related_terms":["arboriculture","floriculture","pomology","viticulture","landscape architecture"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"horticulturalist\" refers to a specialist in the field of horticulture, which involves the science and art of cultivating plants. This term is typically used in academic, professional, or technical contexts related to gardening, landscaping, and plant cultivation. Understanding the term implies familiarity with the specific vocabulary used in botany and agriculture."},"example_sentences":[{"sentence":"The horticulturalists are experimenting with new methods of growing organic vegetables.","translation":"園芸家たちは、有機野菜を栽培するための新しい方法を実験しています。","type":"noun","meaning_category":"園芸家"},{"sentence":"The local horticulturalists association holds regular workshops for its members.","translation":"地元の園芸家協会は、会員向けに定期的なワークショップを開催しています。","type":"noun","meaning_category":"園芸家"},{"sentence":"The horticulturalists developed a new variety of disease-resistant roses.","translation":"園芸家たちは、耐病性の新しいバラの品種を開発しました。","type":"noun","meaning_category":"園芸家"}]}