{"word":"phycochrome","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学)藻類に見られる光受容体タンパク質の一種で、光の色に応じて構造変化を起こし、藻類の生理機能や発生を制御する。","english_definition":"(botany) A type of photoreceptor protein found in algae, which undergoes structural changes in response to different colors of light, thereby regulating the physiological functions and development of algae.","examples":[{"sentence":"Phycochromes play a crucial role in the chromatic adaptation of cyanobacteria.","translation":"フィコクロムはシアノバクテリアの色順応において重要な役割を果たす。"},{"sentence":"The discovery of phycochromes has provided insights into the light-dependent regulation of algal development.","translation":"フィコクロムの発見は、藻類の発生における光依存的な制御に関する洞察をもたらした。"}],"collocations":["chromatic adaptation (色順応)","light-dependent regulation (光依存的な制御)","cyanobacteria (シアノバクテリア)","photoreceptor protein (光受容体タンパク質)"],"synonyms":["photoreceptor","light sensor"],"antonyms":[]}],"etymology":{"value":"\"phyco-\" (藻類を意味する接頭辞) + \"chrome\" (色を意味する接尾辞)","priority":"★★★"},"pronunciation":{"ipa":"/ˈfaɪkoʊˌkroʊm/","syllables":"phy-co-chrome"},"inflection":{"noun_plural":"phycochromes"},"usage_notes":{"explanation":"Phycochromes are a class of photoreceptor proteins unique to algae and cyanobacteria. They are involved in the process of chromatic adaptation, where the organism adjusts its photosynthetic machinery in response to changes in the color of light available in its environment.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["phycobilin (藻類に含まれる色素)","phycocyanin (藍藻に含まれる青色の色素)","phycoerythrin (紅藻に含まれる赤色の色素)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"\"Phycochrome\" is a technical term used in the field of phycology (the study of algae) and plant physiology. It refers to a specific type of photoreceptor protein found in algae that plays a role in light-dependent processes. Understanding this term requires a background in biology or related scientific fields."},"example_sentences":[{"sentence":"Researchers are studying the structure of phycochromes to understand how they sense different wavelengths of light.","translation":"研究者たちは、フィコクロムがどのように異なる波長の光を感知するのかを理解するために、その構造を研究している。","type":"general","meaning_category":"光受容体タンパク質"},{"sentence":"The expression of certain genes in algae is regulated by phycochromes.","translation":"藻類における特定の遺伝子の発現は、フィコクロムによって制御されている。","type":"scientific","meaning_category":"光受容体タンパク質"}]}