{"word":"politically-shaped","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"政治的に形成された、政治的な影響を受けて形作られた","english_definition":"formed or influenced by political factors or considerations.","examples":[{"sentence":"The country's economic policies are politically-shaped by the ruling party's ideology.","translation":"その国の経済政策は、与党のイデオロギーによって政治的に形成されている。"},{"sentence":"The boundaries of the district were politically-shaped to favor a particular party.","translation":"その地区の境界線は、特定の政党に有利になるように政治的に形成された。"},{"sentence":"Public opinion on this issue is politically-shaped by media coverage and political rhetoric.","translation":"この問題に関する世論は、メディアの報道と政治的なレトリックによって政治的に形成されている。"}],"collocations":["politically-shaped policies","politically-shaped boundaries","politically-shaped opinions","politically-shaped decisions","politically-shaped landscape"],"synonyms":["politically influenced","politically determined","politically motivated","politically driven","politically constructed"],"antonyms":["apolitical","non-political","neutral","objective","impartial"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"politically\" (an adverb derived from \"political\") and \"shaped\" (the past participle of the verb \"shape\"). It indicates that something has been formed or influenced by political factors.","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈlɪtɪkli ʃeɪpt/","syllables":"po-lit-i-cal-ly shaped"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The adjective \"politically-shaped\" is used to describe something that has been influenced or determined by political considerations. It often implies that the shaping was done intentionally to achieve a political goal or to favor a particular political viewpoint. It can be used in both neutral and critical contexts, depending on the speaker's perspective.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The decision was shaped political.","correct":"✓ The decision was politically-shaped.","note":"The correct form is \"politically-shaped,\" which is an adjective. The incorrect sentence uses \"political\" as an adverb, which is grammatically incorrect."},{"incorrect":"✗ The policy is shape politically.","correct":"✓ The policy is shaped politically.","note":"The correct sentence uses \"shaped\" as a past participle and \"politically\" as an adverb modifying \"shaped.\""}],"priority":"★★☆"},"related_words":{"derivatives":["political","politics","shape","shaped"],"phrases":["politically motivated","politically correct","politically charged","politically sensitive","politically expedient"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"politically-shaped\" is a relatively complex adjective used to describe something that has been significantly influenced or determined by political factors. It is often used in academic or analytical contexts to discuss how political considerations have shaped policies, decisions, or opinions. Understanding this term requires a good grasp of political concepts and the ability to analyze how political forces can influence various aspects of society."},"example_sentences":[{"sentence":"The media's portrayal of the event was politically-shaped to support a particular narrative.","translation":"イベントのメディアによる描写は、特定の物語を支持するように政治的に形成されていた。","type":"general"},{"sentence":"The curriculum in some schools is politically-shaped to promote certain values.","translation":"一部の学校のカリキュラムは、特定の価値観を促進するように政治的に形成されている。","type":"general"},{"sentence":"The allocation of resources was politically-shaped to benefit certain regions.","translation":"資源の配分は、特定の地域に利益をもたらすように政治的に形成されていた。","type":"general"}]}