{"word":"Tranker","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Slang, Gaming) A player in a video game, typically an MMORPG, who primarily focuses on absorbing damage and protecting other players.","english_definition":"A player in a video game, typically an MMORPG, whose primary role is to absorb damage and protect other players. Often characterized by high health and defense stats.","examples":[{"sentence":"Our party needs a good Tranker to survive this dungeon.","translation":"このダンジョンを生き残るには、パーティーに優秀なTrankerが必要です。"},{"sentence":"He's playing a Tranker class, so he's always on the front lines.","translation":"彼はTrankerクラスをプレイしているので、常に最前線にいます。"}],"collocations":["Main Tranker","Off Tranker","Damage Tranker","Healer-Tranker synergy"],"synonyms":["Tank","Meat Shield"],"antonyms":["Damage Dealer","Healer","Support"],"notes":"The term is often used in online gaming communities. It's a slang term, not typically found in formal contexts."}],"etymology":{"value":"Likely a variant spelling or misspelling of 'Tanker', which is derived from 'Tank' (referring to a heavily armored military vehicle). The term 'Tank' was adopted in gaming to describe characters with high defense and health, capable of withstanding significant damage.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtræŋkər/","syllables":"Tran-ker"},"inflection":{"noun_plural":"Trankers"},"usage_notes":{"explanation":"'Tranker' is a slang term, primarily used within online gaming communities, specifically in MMORPGs and similar games. It refers to a player whose character build and playstyle are focused on absorbing damage and protecting other party members. While 'Tank' is the more common term, 'Tranker' may be used informally or humorously.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a Tranker for my water.","correct":"✓ I need a Tank for my water.","note":"'Tranker' is specific to gaming. For a container, use 'Tank'."},{"incorrect":"✗ He is a Tranker driver.","correct":"✓ He is a Tank driver.","note":"For military vehicles, use 'Tank'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Tank","Tanking","Tanked"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Tranker' is a specialized slang term used in online gaming. Understanding its meaning requires familiarity with gaming terminology, particularly MMORPGs. The term describes a player who prioritizes absorbing damage to protect other players, a role often referred to as 'Tank'. While not a formal word, its usage is common within specific gaming communities."},"example_sentences":[{"sentence":"The raid leader asked for a volunteer to play the Tranker role.","translation":"レイドリーダーは、Trankerの役割を果たすボランティアを求めました。","type":"noun","meaning_category":"Gaming Role"},{"sentence":"A good Tranker knows how to manage threat and keep the enemy focused on them.","translation":"優秀なTrankerは、敵意を管理し、敵を自分に集中させる方法を知っています。","type":"noun","meaning_category":"Gaming Skill"}]}