{"word":"originators","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"創始者、創作者、考案者、発案者","english_definition":"people who create or initiate something; those who bring something into being for the first time.","examples":[{"sentence":"The originators of the internet could not have foreseen its impact on society.","translation":"インターネットの創始者たちは、インターネットが社会に与える影響を予見できなかっただろう。"},{"sentence":"These artists are considered the originators of the modern art movement.","translation":"これらの芸術家は、現代美術運動の創始者とみなされている。"},{"sentence":"He is one of the originators of this innovative teaching method.","translation":"彼は、この革新的な教育方法の考案者の一人だ。"}],"collocations":["the originators of an idea (アイデアの創始者)","the originators of a movement (運動の創始者)","the originators of a technology (技術の創始者)"],"synonyms":["founders","creators","inventors","pioneers","authors","initiators"],"antonyms":["followers","imitators","successors"]}],"etymology":{"value":"The word 'originator' comes from 'originate,' which is derived from the Latin word 'originare,' meaning 'to begin' or 'to arise.' The suffix '-or' indicates a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈrɪdʒɪneɪtərz/","syllables":"o-rig-i-na-tors"},"inflection":{"noun_form":"plural"},"usage_notes":{"explanation":"'Originators' refers to multiple individuals who were the first to create, invent, or initiate something. It emphasizes the act of bringing something new into existence. It is often used in contexts involving ideas, movements, technologies, or artistic styles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The originator of this project are unknown.","correct":"The originators of this project are unknown.","note":"Since 'originators' is plural, the verb should also be plural ('are' instead of 'is')."},{"incorrect":"He is the originator of the all project.","correct":"He is the originator of the entire project.","note":"'All' is not the correct word to use in this context. 'Entire' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["originate (verb): to begin or create something","origin (noun): the point or place where something begins, arises, or is derived","original (adjective): existing from the beginning; not copied or derived from something else"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in academic and formal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'originators' is used to describe the people who first created or started something. It is often used in formal or academic contexts when discussing the history or development of ideas, inventions, or movements. The word implies a significant level of creativity and initiative. It is not a commonly used word in everyday conversation, but it is important to understand its meaning in more formal settings."},"example_sentences":[{"sentence":"The originators of the theory faced significant challenges in gaining acceptance.","translation":"その理論の創始者たちは、受け入れられるために大きな困難に直面した。","type":"general"},{"sentence":"We must acknowledge the originators of this technology for their groundbreaking work.","translation":"私たちは、この技術の創始者たちの画期的な業績を認めなければならない。","type":"general"},{"sentence":"The originators of the company had a vision for a sustainable future.","translation":"その会社の創業者たちは、持続可能な未来へのビジョンを持っていた。","type":"business"}]}