{"word":"prolicidal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"子殺しの、幼児殺しの","english_definition":"Relating to or involving the killing of one's own children; characterized by the act of killing one's offspring.","examples":[{"sentence":"The prolicidal mother was sentenced to life in prison.","translation":"その子殺しの母親は終身刑を宣告された。"},{"sentence":"The novel explores the themes of infanticide and prolicidal behavior.","translation":"その小説は幼児殺しと子殺し的行動のテーマを探求している。"}],"collocations":["prolicidal act","prolicidal behavior","prolicidal tendencies","prolicidal mother","prolicidal father"],"synonyms":["infanticidal","filicidal"],"antonyms":["nurturing","protective","caring"]},{"part_of_speech":"noun","definition":"子殺し（をする人）","english_definition":"A person who kills their own child or children.","examples":[{"sentence":"The prolicidal was apprehended by the police.","translation":"その子殺しは警察に逮捕された。"},{"sentence":"Studies are being conducted to understand the motivations of prolicidals.","translation":"子殺しをする人々の動機を理解するための研究が行われている。"}],"collocations":["a convicted prolicidal","a suspected prolicidal","the motivations of prolicidals"],"synonyms":["infanticide","filicide"],"antonyms":["parent","protector"]}],"etymology":{"value":"Derived from the Latin words 'proles' (offspring) and '-cide' (killing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊlɪˈsaɪdl/","syllables":"pro-li-ci-dal"},"inflection":{"noun_plural":"prolicidals"},"usage_notes":{"explanation":"The term 'prolicidal' is used to describe the act of a parent killing their own child or children. It is a more specific term than 'infanticide,' which refers specifically to the killing of infants. 'Filicide' is a related term that refers to the killing of one's own child, regardless of the child's age. 'Prolicidal' can be used as both an adjective and a noun.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The prolicidal was a victim of abuse.","correct":"✓ The prolicidal was a perpetrator of abuse.","note":"A prolicidal is someone who commits the act of killing their own child, so they are a perpetrator, not a victim, in this specific context."},{"incorrect":"✗ Prolicidal is the same as suicide.","correct":"✓ Prolicidal is the killing of one's own children, while suicide is the act of killing oneself.","note":"Prolicidal refers to the killing of offspring, whereas suicide is the act of taking one's own life. They are distinct concepts."}],"priority":"★★☆"},"related_words":{"derivatives":["prolicide (noun: the act of killing one's own children)"],"phrasal_verbs":[],"related_terms":["infanticide (noun: the killing of an infant)","filicide (noun: the killing of one's own child)","matricide (noun: the killing of one's mother)","patricide (noun: the killing of one's father)","homicide (noun: the killing of another person)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Prolicidal' is a specialized term referring to the act of a parent killing their own child or children. It is less commonly used than more general terms like 'infanticide' or 'filicide.' Understanding this word requires a strong grasp of Latin roots and a familiarity with legal and psychological terminology related to violent crimes within families. It is typically encountered in academic, legal, or psychological contexts."},"example_sentences":[{"sentence":"The psychiatrist studied the **prolicidal** tendencies of the patient.","translation":"精神科医はその患者の子殺し的傾向を研究した。","type":"adjective","meaning_category":"子殺しの"},{"sentence":"The court sought to understand the motives of the **prolicidal**.","translation":"裁判所は子殺し（をする人）の動機を理解しようとした。","type":"noun","meaning_category":"子殺し（をする人）"}]}