{"word":"salary-boosting","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"給与を増加させる、給与を向上させる","english_definition":"Increasing or improving one's salary.","examples":[{"sentence":"She took on extra responsibilities to demonstrate her value and pursue salary-boosting opportunities.","translation":"彼女は自分の価値を示すため、そして給与を向上させる機会を追求するために、追加の責任を引き受けました。"},{"sentence":"The new certification is salary-boosting, allowing employees to qualify for higher-paying positions.","translation":"その新しい資格は給与向上につながり、従業員が高給のポジションの資格を得ることを可能にします。"}],"collocations":["salary-boosting skills","salary-boosting opportunities","salary-boosting potential"],"synonyms":["pay-enhancing","income-increasing"],"antonyms":["salary-reducing","pay-decreasing"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"salary\" (a fixed regular payment, typically paid on a monthly or biweekly basis but often expressed as an annual sum, made by an employer to an employee) with \"boosting\" (the present participle of the verb \"boost,\" meaning to increase or improve).","priority":"N/A"},"pronunciation":{"ipa":"/ˈsæləri ˌbuːstɪŋ/","syllables":"sal-a-ry boost-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. It can be used to modify nouns."},"usage_notes":{"explanation":"\"Salary-boosting\" is typically used to describe actions, skills, qualifications, or opportunities that can lead to an increase in one's salary. It is often used in the context of career development and professional advancement.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is salary-boost.","correct":"✓ He is looking for a salary-boosting opportunity.","note":"\"Salary-boosting\" is an adjective and needs to modify a noun. It cannot stand alone as a noun or be used as a verb in this form."}],"priority":"N/A"},"related_words":{"derivatives":["salary","boost","boosting"],"phrasal_verbs":["N/A"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'salary-boosting' is a compound adjective used to describe something that has the potential to increase one's salary. It's generally used in professional contexts when discussing career advancement, skill development, or opportunities for higher pay. Because it's a more specialized term, it's less common in everyday conversation and more frequently found in business or career-related materials."},"example_sentences":[{"sentence":"Investing in further education can be a salary-boosting move.","translation":"さらなる教育への投資は、給与を向上させる動きとなりえます。","type":"adjective","meaning_category":"給与を向上させる"},{"sentence":"The company offers several salary-boosting benefits, such as performance bonuses and stock options.","translation":"その会社は、業績ボーナスやストックオプションなど、給与を向上させるいくつかの特典を提供しています。","type":"adjective","meaning_category":"給与を向上させる"}]}