{"word":"Ajiva","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Jainism) Non-living substance; that which lacks consciousness or soul.","english_definition":"In Jainism, the category of reality that is without life, soul, or consciousness. It includes matter, space, time, and the principles of motion and rest.","examples":[{"sentence":"According to Jain philosophy, the universe is composed of jiva (living beings) and ajiva (non-living substances).","translation":"ジャイナ哲学によれば、宇宙はジーヴァ（ जीव, 生きているもの）とアジーヴァ（अजीव, 生きていないもの）で構成されています。"}],"collocations":["jiva and ajiva","categories of ajiva","nature of ajiva"],"synonyms":["non-soul","non-living matter","inanimate substance"],"antonyms":["jiva (soul, living being)"]}],"etymology":{"value":"From Sanskrit अजीव (ajīva), meaning \"not living\".  Composed of the negative prefix अ- (a-) and जीव (jīva) meaning \"living being, soul\".","priority":"★★★"},"pronunciation":{"ipa":"/ɐˈdʒiːvə/","syllables":"a-jee-va"},"inflection":{"notes":"Singular noun. No plural form typically used."},"usage_notes":{"explanation":"'Ajiva' is a core concept in Jainism, representing the antithesis of 'jiva'. Understanding ajiva is crucial for grasping the Jain worldview and its emphasis on minimizing harm to all living beings, as well as detachment from material possessions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Ajiva refers to the soul.","correct":"✓ Ajiva refers to non-living substances.","note":"Ajiva is the opposite of jiva, which refers to the soul."}],"priority":"★★☆"},"related_words":{"derivatives":["ajivika (related ascetic tradition)"],"related_concepts":["jiva","karma","moksha","Jain cosmology"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in religious or philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ajiva' is a technical term from Jain philosophy. It refers to non-living substances, which are the opposite of 'jiva' (living beings or souls). Understanding this term requires familiarity with the basic tenets of Jainism. It is not commonly used outside of this specific context."},"example_sentences":[{"sentence":"Jain monks strive to minimize their interaction with ajiva to reduce the possibility of causing harm.","translation":"ジャイナ教の僧侶は、危害を加える可能性を減らすために、アジーヴァとの相互作用を最小限に抑えるよう努めています。","type":"general","meaning_category":"definition"},{"sentence":"The Jain concept of ajiva includes not only physical matter but also abstract entities like time and space.","translation":"ジャイナ教のアジーヴァの概念には、物理的な物質だけでなく、時間や空間のような抽象的な存在も含まれています。","type":"philosophical","meaning_category":"definition"}]}