{"word":"tryptamine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トリプタミン","english_definition":"A monoamine alkaloid found in plants, fungi, and animals. It possesses stimulant, mood-altering, and hallucinogenic properties.","examples":[{"sentence":"Tryptamine is a naturally occurring compound that can affect mood.","translation":"トリプタミンは、気分に影響を与える可能性のある天然化合物です。"},{"sentence":"Some plants contain tryptamine derivatives with psychoactive effects.","translation":"一部の植物には、精神活性作用のあるトリプタミン誘導体が含まれています。"}],"collocations":["tryptamine derivative","psychoactive tryptamine","endogenous tryptamine"],"synonyms":["indolethylamine"],"antonyms":[]}],"etymology":{"value":"Derived from \"trypsin\" (an enzyme involved in its synthesis) and \"amine\" (referring to its chemical structure).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrɪptəmiːn/","syllables":"trip-ta-mine"},"inflection":{"noun_plural":"tryptamines"},"usage_notes":{"explanation":"Tryptamine is a chemical compound that serves as a precursor to many important neurotransmitters and psychoactive substances, including serotonin and melatonin. It is found in trace amounts in the human brain and is also present in various plants and fungi.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Triptamine is a vitamin.","correct":"✓ Triptamine is an alkaloid.","note":"Tryptamine is a type of alkaloid, not a vitamin."},{"incorrect":"✗ Tryptamine is only found in synthetic drugs.","correct":"✓ Tryptamine is found in both natural and synthetic compounds.","note":"Tryptamine occurs naturally in plants and animals, as well as being synthesized for research and pharmaceutical purposes."}],"priority":"★☆☆"},"related_words":{"derivatives":["tryptaminergic (adjective: relating to or affecting tryptamine-sensitive receptors)"],"precursors":["tryptophan"],"related_compounds":["serotonin","melatonin","psilocybin","DMT (dimethyltryptamine)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Tryptamine is a complex biochemical term primarily used in scientific and medical contexts. Understanding requires a background in chemistry, biology, or pharmacology. It refers to a specific class of organic compounds and their derivatives, often involved in neurotransmission and psychoactive effects. The term is rarely encountered in general conversation."},"example_sentences":[{"sentence":"The study investigated the effects of tryptamine on serotonin receptors.","translation":"その研究では、トリプタミンがセロトニン受容体に与える影響を調査した。","type":"noun","meaning_category":"chemical compound"},{"sentence":"Certain species of mushrooms contain significant amounts of tryptamine derivatives.","translation":"特定の種類のキノコには、かなりの量のトリプタミン誘導体が含まれている。","type":"noun","meaning_category":"chemical compound"}]}