{"word":"presbycousis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"加齢性難聴","english_definition":"Hearing loss that gradually occurs in most individuals as they grow older.","examples":[{"sentence":"Presbycousis is a common condition affecting older adults.","translation":"加齢性難聴は高齢者に影響を与える一般的な症状です。"},{"sentence":"The doctor diagnosed him with presbycousis after the hearing test.","translation":"医師は聴力検査後、彼を加齢性難聴と診断しました。"}],"collocations":["age-related hearing loss","sensorineural hearing loss","high-frequency hearing loss"],"synonyms":["age-related hearing loss","hearing impairment due to aging"],"antonyms":["normal hearing","acute hearing"]},{"part_of_speech":"noun","definition":"老人性聴力低下","english_definition":"A type of sensorineural hearing loss that is associated with aging and typically involves a gradual loss of hearing, especially at higher frequencies.","examples":[{"sentence":"The patient's audiogram showed signs of presbycousis, with reduced sensitivity to high-pitched sounds.","translation":"患者の聴力図は、高音に対する感度の低下を示しており、加齢性難聴の兆候が見られました。"}],"collocations":["audiogram","hearing aid","cochlear implant","sensorineural","high-frequency"],"synonyms":["age-related hearing impairment","age-related hearing decline"],"antonyms":["youthful hearing","unimpaired hearing"]}],"etymology":{"value":"Derived from the Greek words 'presbys' (meaning 'old man') and 'akousis' (meaning 'hearing').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌprɛzbɪˈkjuːsɪs/","syllables":"pres-by-cou-sis"},"inflection":{"noun_plural":"presbycousises"},"usage_notes":{"explanation":"Presbycousis is a medical term specifically referring to age-related hearing loss. It is important to distinguish it from other causes of hearing loss, such as noise-induced hearing loss or hearing loss due to infection. The term is commonly used in audiology and medical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has presbycusis in one ear.","correct":"✓ He has presbycusis.","note":"Presbycusis typically affects both ears, although the degree of hearing loss may vary between ears."},{"incorrect":"✗ Presbycusis is curable.","correct":"✓ Presbycusis is manageable with hearing aids or other assistive devices.","note":"While there is no cure for presbycusis, its effects can be managed with hearing aids or other assistive devices."}],"priority":"★★☆"},"related_words":{"derivatives":["presbyacusia (variant spelling)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'presbycousis' is a technical term used in the medical field, specifically audiology, to describe age-related hearing loss. It is not a commonly used word in everyday conversation. Understanding this term is important for medical professionals and those studying audiology. It signifies a gradual decline in hearing ability due to aging, typically affecting higher frequencies first."},"example_sentences":[{"sentence":"The prevalence of presbycousis increases with age, affecting a significant portion of the elderly population.","translation":"加齢性難聴の有病率は年齢とともに増加し、高齢者人口のかなりの部分に影響を与えています。","type":"general","meaning_category":"General"},{"sentence":"Early diagnosis and management of presbycousis can improve the quality of life for affected individuals.","translation":"加齢性難聴の早期診断と管理は、罹患した個人の生活の質を向上させることができます。","type":"medical","meaning_category":"Medical"},{"sentence":"The audiologist explained the causes and treatment options for presbycousis to the patient.","translation":"聴覚専門医は、患者に加齢性難聴の原因と治療の選択肢について説明しました。","type":"audiology","meaning_category":"Audiology"}]}