{"word":"diversionist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(政治)転向者、日和見主義者、攪乱主義者","english_definition":"A person who practices diversionism, especially in a political context; someone who deviates from a set political line or ideology, often seen as disruptive or subversive.","examples":[{"sentence":"The party accused him of being a diversionist and expelled him.","translation":"党は彼を転向者だと非難し、除名した。"},{"sentence":"In those days, anyone who questioned the official line was labeled a diversionist.","translation":"当時、公式見解に疑問を呈する者は誰でも攪乱主義者と見なされた。"}],"collocations":["labeled as a diversionist (転向者とみなされる)","accused of being a diversionist (転向者だと非難される)","purge of diversionists (転向者の粛清)"],"synonyms":["defector","dissenter","deviationist","renegade","heretic","saboteur"],"antonyms":["loyalist","conformist","adherent","orthodox"],"notes":"The term often carries a negative connotation, particularly in authoritarian or highly ideological contexts."}],"etymology":{"value":"Derived from 'diversion' (the act of diverting or turning aside) + '-ist' (a suffix denoting a person who practices or believes in something).","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈvɜːrʒənɪst/","syllables":"di-ver-sion-ist"},"inflection":{"noun_plural":"diversionists"},"usage_notes":{"explanation":"The term 'diversionist' is primarily used in political contexts to describe someone who deviates from the established political line or ideology. It often implies that the person is deliberately trying to undermine the system or cause disruption. The term is more common in historical or political science discussions, particularly when referring to totalitarian or authoritarian regimes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a diversionist in his career, always changing jobs.","correct":"✓ He was indecisive in his career, always changing jobs.","note":"'Diversionist' has a specific political meaning. If you mean someone who changes direction or focus frequently, use terms like 'indecisive,' 'unfocused,' or 'easily distracted' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["diversion (名詞: 気晴らし、転換、迂回)","diversionism (名詞: 転向主義、攪乱主義)"],"related_terms":["deviationism (名詞: 逸脱主義)","opportunism (名詞: 日和見主義)","factionalism (名詞: 派閥主義)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Diversionist' is a specialized term primarily used in political contexts. It refers to someone who deviates from the established political line or ideology, often with the implication of causing disruption or undermining the system. This term is not commonly used in everyday conversation and is more likely to appear in political analysis, historical texts, or discussions of totalitarian regimes. Understanding its meaning requires a grasp of political vocabulary and historical context."},"example_sentences":[{"sentence":"The regime condemned the intellectuals as dangerous diversionists.","translation":"政権は知識人たちを危険な攪乱主義者として非難した。","type":"noun","meaning_category":"political deviation"},{"sentence":"He was purged from the party for his alleged diversionist activities.","translation":"彼は転向主義的な活動の疑いで党から粛清された。","type":"noun","meaning_category":"political deviation"},{"sentence":"The historian examined the role of diversionists in the collapse of the Soviet Union.","translation":"歴史家はソ連崩壊における転向主義者の役割を検証した。","type":"noun","meaning_category":"political deviation"}]}