{"word":"shamanism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"シャーマニズム、巫俗信仰","english_definition":"A religion practiced by indigenous peoples of northern Asia and other parts of the world in which shamans mediate between the human and spirit worlds.","examples":[{"sentence":"Shamanism is still practiced in some parts of Siberia.","translation":"シャーマニズムはシベリアの一部地域で今もなお行われている。"},{"sentence":"The shaman acted as a bridge between the village and the spirit world.","translation":"シャーマンは村と精霊界の橋渡し役を務めた。"},{"sentence":"Traditional shamanism involves rituals and ceremonies to communicate with spirits.","translation":"伝統的なシャーマニズムは、精霊と交信する儀式や祭礼を伴う。"}],"collocations":["practice shamanism (シャーマニズムを行う)","shamanistic rituals (シャーマニズムの儀式)","traditional shamanism (伝統的なシャーマニズム)","core shamanism (コア・シャーマニズム)"],"synonyms":["animism","spiritualism","witchcraft","paganism"],"antonyms":[]}],"etymology":{"value":"The word 'shaman' comes from the Evenki language of Siberia. It was adopted into Russian and then into other languages. The suffix '-ism' indicates a system of beliefs or practices.","priority":"★★★"},"pronunciation":{"ipa":"/ˈʃɑːmənɪzəm/","syllables":"sha-man-i-sm"},"inflection":{"noun_plural":"shamanisms (rarely used)"},"usage_notes":{"explanation":"Shamanism is a complex and diverse set of beliefs and practices. It is often associated with indigenous cultures and involves a belief in spirits and the ability of shamans to interact with them. The term is sometimes used loosely to refer to any form of spiritual healing or practice that involves altered states of consciousness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a shamanism.","correct":"✓ She is a shaman.","note":"'Shamanism' is the belief system or practice; 'shaman' is the person who practices it."},{"incorrect":"✗ Shamanism is only practiced in Africa.","correct":"✓ Shamanism is practiced in many parts of the world, including Asia, the Americas, and Africa.","note":"Shamanism is not limited to a single geographic region."}],"priority":"★★☆"},"related_words":{"derivatives":["shaman (名詞: シャーマン、巫)","shamanic (形容詞: シャーマンの、巫術的な)","shamanistically (副詞: シャーマン的に)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 専門的な文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shamanism' refers to a set of traditional beliefs and practices where a 'shaman' (a kind of spiritual leader or healer) interacts with the spirit world. It's often found in indigenous cultures around the world. It involves rituals, altered states of consciousness, and communicating with spirits for healing, guidance, or to influence events. It's a complex topic, so you'll usually find it discussed in more advanced texts about religion, anthropology, or indigenous cultures."},"example_sentences":[{"sentence":"The anthropologist studied the role of shamanism in the tribe's social structure.","translation":"人類学者は、部族の社会構造におけるシャーマニズムの役割を研究した。","type":"noun","meaning_category":"信仰体系"},{"sentence":"Shamanism often involves the use of hallucinogenic plants to enter altered states of consciousness.","translation":"シャーマニズムは、変性意識状態に入るために幻覚性植物の使用を伴うことが多い。","type":"noun","meaning_category":"信仰体系"},{"sentence":"The shamanic tradition has been passed down through generations.","translation":"シャーマニズムの伝統は世代を超えて受け継がれてきた。","type":"adjective","meaning_category":"伝統"}]}