{"word":"Heterophagi","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(生物学) 異種栄養生物：他の生物を摂取して栄養を得る生物。","english_definition":"(biology) An organism that obtains nutrients by consuming other organisms.","examples":[{"sentence":"Heterophagi include animals, fungi, and many bacteria.","translation":"異種栄養生物には、動物、菌類、そして多くの細菌が含まれます。"}],"collocations":["obligate heterophagi (偏性異種栄養生物)","facultative heterophagi (通性異種栄養生物)"],"synonyms":["heterotroph"],"antonyms":["autotroph"],"notes":"Heterophagi is a specific type of heterotroph. Not all heterotrophs are heterophagi, but all heterophagi are heterotrophs."}],"etymology":{"value":"Derived from the Greek words 'heteros' (ἕτερος) meaning 'other' or 'different', and 'phagein' (φαγεῖν) meaning 'to eat'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛtərəˈfeɪdʒaɪ/","syllables":"Het-er-o-pha-gi"},"inflection":{"noun_plural":"Heterophagi"},"usage_notes":{"explanation":"'Heterophagi' refers to organisms that obtain their nutrition by consuming other organisms. This is a key concept in biology, particularly in understanding food chains and ecological relationships.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Heterophagi are plants that make their own food.","correct":"✓ Heterophagi are organisms that consume other organisms for food.","note":"Heterophagi cannot make their own food; they must consume other organisms."}],"priority":"★★☆"},"related_words":{"derivatives":["heterotrophic (adjective)","heterotroph (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Heterophagi' is a scientific term used in biology to describe organisms that obtain nutrients by consuming other organisms. It is a more specific term than 'heterotroph,' which broadly refers to organisms that cannot produce their own food. Understanding this term is crucial for comprehending ecological relationships and food chains.","priority":"★★☆"},"example_sentences":[{"sentence":"Most animals are heterophagi, relying on consuming plants or other animals for sustenance.","translation":"ほとんどの動物は異種栄養生物であり、植物や他の動物を摂取して栄養を得ています。","type":"general","meaning_category":"biological"},{"sentence":"Fungi are a diverse group of heterophagi that play a crucial role in decomposition.","translation":"菌類は多様な異種栄養生物のグループであり、分解において重要な役割を果たしています。","type":"specific","meaning_category":"biological"}]}