{"word":"single-media","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単一メディアの、単一媒体の","english_definition":"Relating to or using only one type of media.","examples":[{"sentence":"The project was originally designed as a single-media presentation, but it was later expanded to include interactive elements.","translation":"そのプロジェクトは当初、単一メディアのプレゼンテーションとして設計されましたが、後にインタラクティブな要素を含むように拡張されました。"},{"sentence":"Single-media art installations can be very powerful in their simplicity.","translation":"単一メディアのアートインスタレーションは、そのシンプルさにおいて非常に強力なものとなりえます。"}],"collocations":["single-media presentation","single-media art","single-media campaign"],"synonyms":["monomedia"],"antonyms":["multi-media","cross-media","mixed-media"]}],"etymology":{"value":"Combination of 'single' (one) and 'media' (plural of medium, a means of communication).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪŋɡəl ˈmiːdiə/","syllables":"sin-gle-me-di-a"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"'Single-media' refers to content or projects that utilize only one form of communication, such as text, audio, or video, but not a combination thereof. It is often used in contrast to 'multimedia' or 'mixed media' which incorporate several different types of media.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The single media presentation included video and audio.","correct":"✓ The multimedia presentation included video and audio.","note":"If the presentation includes more than one type of media, it is not 'single-media'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["multimedia","mixed media","cross-media","medium"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'single-media' is a relatively specialized term used to describe projects or content that utilize only one form of media. It is most commonly found in discussions of art, technology, and communication. Understanding this term requires a good vocabulary and familiarity with related concepts like 'multimedia' and 'mixed media'."},"example_sentences":[{"sentence":"The artist chose a single-media approach to emphasize the purity of the message.","translation":"アーティストはメッセージの純粋さを強調するために、単一メディアのアプローチを選びました。","type":"general","meaning_category":"art"},{"sentence":"The website was designed as a single-media platform, focusing solely on text-based articles.","translation":"そのウェブサイトは、テキストベースの記事のみに焦点を当てた、単一メディアのプラットフォームとして設計されました。","type":"general","meaning_category":"technology"},{"sentence":"The marketing campaign relied on a single-media strategy, primarily using television commercials.","translation":"そのマーケティングキャンペーンは、主にテレビコマーシャルを使用した、単一メディア戦略に依存していました。","type":"general","meaning_category":"marketing"}]}