{"word":"waitressless","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(レストランなどが)ウェイトレスがいない、またはウェイトレスのサービスがない","english_definition":"(of a restaurant, etc.) without waitresses; not having waitress service.","examples":[{"sentence":"The restaurant is waitressless; you order at the counter.","translation":"そのレストランはウェイトレスがおらず、カウンターで注文します。"},{"sentence":"A waitressless cafe might rely on technology for ordering and serving.","translation":"ウェイトレスがいないカフェは、注文やサービスにテクノロジーを利用するかもしれません。"}],"collocations":["waitressless restaurant","waitressless cafe","waitressless service"],"synonyms":["self-service","counter service","staffless"],"antonyms":["waitressed","full-service"]},{"part_of_speech":"adjective","definition":"(比喩的に)（通常ウェイトレスによって提供されるような）サービスや注意がない","english_definition":"(figuratively) lacking service or attention, especially of the kind typically provided by a waitress.","examples":[{"sentence":"The event felt waitressless, with attendees struggling to find assistance.","translation":"そのイベントは、参加者が支援を見つけるのに苦労し、まるでウェイトレスがいないようだった。"}],"collocations":["waitressless event","waitressless experience"],"synonyms":["unattended","unserviced","neglected"],"antonyms":["attended","serviced"]}],"etymology":{"value":"The word 'waitressless' is formed by adding the suffix '-less' (meaning 'without') to the noun 'waitress'. This indicates the absence of waitresses.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈweɪtrɪsləs/","syllables":"wai-tress-less"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Waitressless' is primarily used to describe establishments, typically restaurants or cafes, that do not employ waitresses to take orders and serve food. Instead, customers might order at a counter, use a self-service system, or rely on technology like tablets or apps. Figuratively, it can describe situations lacking personal service or attention. The word is relatively uncommon, reflecting the prevalence of waitress service in many dining establishments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The restaurant is waitress-less.","correct":"✓ The restaurant is waitressless.","note":"The correct spelling is 'waitressless' (one word), not 'waitress-less' (hyphenated)."},{"incorrect":"✗ She felt waitressless at the party.","correct":"✓ She felt neglected at the party.","note":"While 'waitressless' can be used figuratively, in most contexts, using a more common word like 'neglected' or 'unattended' is clearer and more natural."}],"priority":"★★☆"},"related_words":{"derivatives":["-less (suffix meaning 'without')"],"phrasal_verbs":[],"related_words":["waiterless","self-service","counter service","staffless","automated"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not commonly found in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency - The term is not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Waitressless' is a compound adjective describing a place (usually a restaurant or cafe) that does not have waitresses. Instead of being served at a table, customers might order at a counter or use a self-service system. The word is not very common, so it's more likely to be encountered in specialized contexts or when discussing trends in the food service industry."},"example_sentences":[{"sentence":"The new cafe is completely waitressless, with customers ordering through an app.","translation":"その新しいカフェは完全にウェイトレスレスで、顧客はアプリを通じて注文します。","type":"adjective","meaning_category":"without waitresses"},{"sentence":"The conference felt waitressless, as there were no staff available to assist attendees.","translation":"その会議は、参加者を支援できるスタッフがいなかったため、ウェイトレスレスのように感じられました。","type":"adjective","meaning_category":"lacking service"}]}