{"word":"plasmaphaeresis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"血漿交換療法、血漿分離交換法","english_definition":"A medical procedure in which blood is removed from the body and the plasma is separated from the blood cells. The blood cells are then returned to the body, and the plasma is either replaced with a substitute solution or treated and returned to the body.","examples":[{"sentence":"Plasmaphaeresis is used to treat autoimmune diseases.","translation":"血漿交換療法は自己免疫疾患の治療に用いられる。"},{"sentence":"The patient underwent plasmaphaeresis to remove harmful antibodies.","translation":"患者は有害な抗体を除去するために血漿交換療法を受けた。"}],"collocations":["therapeutic plasmaphaeresis","plasma exchange","apheresis"],"synonyms":["plasma exchange","apheresis"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'plasma' (πλάσμα) meaning 'something molded or formed' and 'apheresis' (ἀφαίρεσις) meaning 'taking away'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌplæzməfəˈriːsɪs/","syllables":"plaz-muh-fuh-ree-sis"},"inflection":{"noun_plural":"plasmaphereses"},"usage_notes":{"explanation":"Plasmaphaeresis is a medical procedure used to treat various autoimmune, hematological, and neurological disorders. It involves removing blood, separating the plasma, and returning the blood cells to the patient. The removed plasma may be discarded and replaced with a substitute, or it may be treated to remove harmful components before being returned to the patient. The procedure is also known as plasma exchange.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Plasmapheresis are a treatment.","correct":"✓ Plasmaphaeresis is a treatment.","note":"Plasmaphaeresis is a singular noun, even though the procedure involves multiple steps. Therefore, it takes a singular verb."},{"incorrect":"✗ Plasmaferesis is a treatment.","correct":"✓ Plasmaphaeresis is a treatment.","note":"The correct spelling is 'plasmaphaeresis' with a 'ph' after 'plasma' and 'aeresis'."}],"priority":"★★☆"},"related_words":{"derivatives":["apheresis"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Plasmaphaeresis' is a specialized medical term referring to a procedure where blood plasma is separated and removed from the blood. It's primarily used in treating certain diseases by removing harmful substances from the plasma or replacing it altogether. This term is typically encountered in medical contexts or discussions related to specific health conditions requiring this treatment."},"example_sentences":[{"sentence":"The doctor recommended plasmaphaeresis to treat the patient's Guillain-Barré syndrome.","translation":"医師は、患者のギラン・バレー症候群を治療するために血漿交換療法を推奨した。","type":"medical procedure","meaning_category":"treatment"},{"sentence":"Plasmaphaeresis can help reduce the severity of symptoms in some autoimmune diseases.","translation":"血漿交換療法は、一部の自己免疫疾患の症状の重症度を軽減するのに役立つ。","type":"medical procedure","meaning_category":"treatment"}]}