{"word":"hypotrichous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(生物学)腹側に繊毛を持つ、腹毛類の","english_definition":"(biology) Having cilia or similar structures on the ventral (lower) surface.","examples":[{"sentence":"Hypotrichous ciliates are a diverse group of protozoa.","translation":"腹毛類の繊毛虫は多様な原生動物のグループです。"},{"sentence":"The hypotrichous arrangement of cilia aids in locomotion.","translation":"腹側の繊毛の配置は移動を助けます。"}],"collocations":["hypotrichous ciliate","hypotrichous surface","hypotrichous protozoa"],"synonyms":["ventrociliated"],"antonyms":["dorsotrichous"]},{"part_of_speech":"adjective","definition":"(植物学)下生的な、子房下位の","english_definition":"(botany) Having the stamens and other floral parts inserted below the ovary.","examples":[{"sentence":"Hypotrichous flowers are common in certain plant families.","translation":"子房下位の花は特定の植物科によく見られます。"},{"sentence":"The hypotrichous condition is a characteristic of some species.","translation":"子房下位の状態は、いくつかの種の特徴です。"}],"collocations":["hypotrichous flower","hypotrichous ovary"],"synonyms":["inferior (ovary)"],"antonyms":["epigynous","perigynous"]}],"etymology":{"value":"From the Greek words 'hypo' (under) and 'thrix, trichos' (hair, cilium), referring to the ventral cilia in some organisms.","priority":"★★☆"},"pronunciation":{"ipa":"/haɪˈpɒtrɪkəs/","syllables":"hy-po-tri-chous"},"inflection":{"notes":"Comparative and superlative forms are possible (more hypotrichous, most hypotrichous), but rare."},"usage_notes":{"explanation":"The term 'hypotrichous' has two distinct meanings depending on the field. In zoology, particularly protozoology, it refers to organisms with cilia on their ventral surface. In botany, it describes flowers with an inferior ovary, where the other floral parts are attached below the ovary. Context is crucial to understanding the intended meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hypotrichous animal had hairs on its back.","correct":"✓ The hypotrichous animal had hairs on its underside.","note":"Hypotrichous refers to structures on the ventral (underside), not the dorsal (back) surface."},{"incorrect":"✗ The ovary was superior and hypotrichous.","correct":"✓ The ovary was inferior and hypotrichous.","note":"Hypotrichous in botany implies an inferior ovary."}],"priority":"★★☆"},"related_words":{"derivatives":["hypotrich (noun): A hypotrichous organism.","hypotrichida (noun): An order of ciliates characterized by hypotrichy."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hypotrichous' is a technical term used in biology, specifically in zoology (protozoology) and botany. It describes organisms with cilia on their ventral surface or flowers with an inferior ovary. Understanding requires knowledge of biological terminology. It is not a word used in everyday conversation."},"example_sentences":[{"sentence":"The pond water contained numerous hypotrichous ciliates.","translation":"池の水には多数の腹毛類の繊毛虫が含まれていました。","type":"adjective","meaning_category":"zoology"},{"sentence":"The botanist identified the flower as having a hypotrichous structure.","translation":"植物学者はその花が子房下位の構造を持つと特定しました。","type":"adjective","meaning_category":"botany"}]}