{"word":"argumented","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"N/A","definition":"(コンピュータープログラミング) 引数化された、引数を持つ","english_definition":"(computer programming) having arguments; provided with arguments.","examples":[{"sentence":"The argumented function returned an unexpected value.","translation":"引数化された関数が予期しない値を返した。"},{"sentence":"Ensure the argumented parameters are of the correct type.","translation":"引数化されたパラメータが正しい型であることを確認してください。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'to augment' (to increase or supplement) or 'to argue' (to present reasons). In programming, it relates to providing arguments to a function or process.","priority":"N/A"},"pronunciation":{"ipa":"/ˈɑːrɡjuməntɪd/","syllables":"ar-gu-ment-ed"},"inflection":{"verb_forms":{"present_simple":["argument","arguments"],"past_simple":"argumented","past_participle":"argumented","present_participle":"argumenting"}},"usage_notes":{"explanation":"'Argumented' is primarily used in technical contexts, particularly in computer programming. It describes something that has been supplied with arguments or parameters. It is not a common word in everyday conversation.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["argument (noun): an expression used as input to a function.","argumentation (noun): the process of reasoning systematically in support of an idea, action, or theory."],"phrasal_verbs":[],"related_terms":["parameter","function","method","variable"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in technical documentation and programming contexts.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'argumented' is highly technical and specific to programming. It signifies that a function, method, or process has been supplied with arguments or parameters necessary for its execution. This term is not generally used outside of technical documentation or discussions among programmers."},"example_sentences":[{"sentence":"The argumented call to the API failed due to invalid credentials.","translation":"APIへの引数化された呼び出しは、無効な資格情報のために失敗しました。","type":"technical","meaning_category":"programming"},{"sentence":"The argumented data set was used to train the machine learning model.","translation":"引数化されたデータセットは、機械学習モデルを訓練するために使用されました。","type":"technical","meaning_category":"programming"}]}