{"word":"galangals","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ガランガル（ショウガ科の植物）","english_definition":"A rhizomatous herb of the ginger family, native to Southeast Asia, used as a spice and in traditional medicine.","examples":[{"sentence":"Galangals are used in many Thai and Indonesian dishes.","translation":"ガランガルは多くのタイ料理やインドネシア料理に使われています。"}],"collocations":["lesser galangal (Alpinia officinarum)","greater galangal (Alpinia galanga)"],"synonyms":["ginger","turmeric","cardamom"],"antonyms":[]}],"etymology":{"value":"Derived from the Arabic word \"khalanjan\" or \"kholanjan\", which in turn comes from the Chinese word \"gaoliangjiang\" (高良薑), referring to the plant's origin in the Gaoliang region of China.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡælənˌɡælz/","syllables":"ga-lan-gals"},"inflection":{"noun_plural":"galangals"},"usage_notes":{"explanation":"'Galangals' refers to the rhizomes of several plants in the ginger family, primarily Alpinia galanga (greater galangal) and Alpinia officinarum (lesser galangal). These rhizomes are used as spices in Southeast Asian cuisine and have medicinal properties. The term is usually used in the plural when referring to the spice itself or multiple rhizomes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I added galangal to my soup, it was very spicy.","correct":"✓ I added galangal to my soup; it was very spicy.","note":"'Galangal' is a noun, so it should be used as such in a sentence. In the incorrect example, the sentence is a run-on sentence and should be separated by a semicolon or made into two separate sentences."}],"priority":"★★☆"},"related_words":{"derivatives":["galangal"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Galangals' refers to a specific type of spice, so it's not a word commonly used in everyday conversation. You're most likely to encounter it in recipes for Southeast Asian cuisine or in discussions about herbal remedies.","priority":"★★☆"},"example_sentences":[{"sentence":"The aroma of galangals filled the kitchen as she prepared the tom yum soup.","translation":"彼女がトムヤムスープを作ると、ガランガルの香りが台所に広がった。","type":"noun","meaning_category":"spice"},{"sentence":"Some people believe that galangals have anti-inflammatory properties.","translation":"ガランガルには抗炎症作用があると考えている人もいる。","type":"noun","meaning_category":"medicinal properties"}]}