{"word":"nonblasphemies","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Plural form of nonblasphemy. A statement or act that is not considered blasphemous.","english_definition":"The plural form of nonblasphemy, referring to statements or actions that do not constitute blasphemy.","examples":[{"sentence":"The sermon was full of nonblasphemies, carefully avoiding any controversial religious claims.","translation":"その説教は非冒涜的な内容に満ちており、物議を醸す宗教的な主張を注意深く避けていた。"}],"collocations":["utter nonblasphemies","a collection of nonblasphemies"],"synonyms":["inoffensive statements","respectful remarks"],"antonyms":["blasphemies","sacrileges"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'blasphemies,' which is the plural of 'blasphemy.' 'Blasphemy' originates from Late Latin 'blasphemia' and Greek 'blasphemia,' meaning 'impious, irreverent speech or action concerning God or sacred things.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈblæsfəmiz/","syllables":"non-blas-phe-mies"},"inflection":{"noun_plural":"nonblasphemies"},"usage_notes":{"explanation":"'Nonblasphemies' is a relatively rare word, used to describe statements or actions that are the opposite of blasphemy. It is often used in contexts where there is a concern about avoiding offense to religious sensibilities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke many nonblasphemy during the service.","correct":"✓ He spoke many nonblasphemies during the service.","note":"'Nonblasphemies' is the plural form, so it should be used when referring to multiple instances."}],"priority":"★★☆"},"related_words":{"derivatives":["nonblasphemous (adjective)"],"antonyms":["blasphemy","sacrilege"],"related_terms":["heresy","irreverence","profanity"]},"level_frequency":{"frequency_google_ngram":"Low frequency - The term is rarely used in general conversation or writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonblasphemies' is a complex term formed by negating 'blasphemies.' It is used in formal or academic contexts to describe statements or actions that are intentionally or carefully devoid of any blasphemous content. Understanding the root word 'blasphemy' is essential to comprehend its meaning. It is not a commonly used word in everyday language."},"example_sentences":[{"sentence":"The politician's speech was a series of carefully crafted nonblasphemies, designed to offend no one.","translation":"その政治家の演説は、誰をも不快にさせないように設計された、注意深く練られた非冒涜的な言葉の連続だった。","type":"noun","meaning_category":"statements that are not blasphemous"},{"sentence":"The book contained a collection of religious stories rewritten as nonblasphemies for a secular audience.","translation":"その本には、世俗的な読者のために非冒涜的な内容に書き換えられた宗教的な物語が集められていた。","type":"noun","meaning_category":"actions that are not blasphemous"}]}