{"word":"harps","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ハープ（harp）の複数形","english_definition":"plural of harp","examples":[{"sentence":"The orchestra included several harps.","translation":"そのオーケストラには数台のハープが含まれていた。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"verb","definition":"harp（ハープを演奏する、同じことをくどくど言う）の三人称単数現在","english_definition":"third-person singular present of harp","examples":[{"sentence":"She harps on about the same things every day.","translation":"彼女は毎日同じことをくどくど言う。"},{"sentence":"He harps the melody beautifully.","translation":"彼はそのメロディーを美しくハープで奏でる。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'harps' is simply the plural form of the noun 'harp' and the third-person singular present form of the verb 'harp'. The etymology traces back to Proto-Germanic *harpōn, from Proto-Indo-European *kerp- 'to pluck, harvest'.","priority":"★★★"},"pronunciation":{"ipa":"/hɑːrps/","syllables":"harps"},"inflection":{"noun_plural":"harps","verb_forms":{"present_simple":["harps"]}},"usage_notes":{"explanation":"'Harps' can function as either the plural form of the noun 'harp,' referring to multiple musical instruments, or as the third-person singular present tense form of the verb 'harp,' indicating someone is playing the harp or, more commonly, dwelling tediously on a particular subject. The context determines the correct interpretation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He plays harps very well.","correct":"✓ He plays the harps very well.","note":"When referring to specific harps, it's common to use the definite article 'the'."},{"incorrect":"✗ She harps about her problems all the time.","correct":"✓ She harps on about her problems all the time.","note":"The phrasal verb 'harp on' is the correct form when indicating someone is dwelling tediously on a subject."}],"priority":"★★★"},"related_words":{"derivatives":["harpist (noun): a person who plays the harp","harping (noun/verb): the act of playing the harp or dwelling on a subject"],"phrasal_verbs":["harp on (verb): to talk or complain about something repeatedly"],"related_concepts":["music","instrument","melody","repetition"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★★"},"readability_explanation":{"level":"B2","text":"The word 'harps' can be understood in two main contexts: as the plural of 'harp,' referring to multiple musical instruments, or as the third-person singular present tense of the verb 'harp,' indicating someone is playing the harp or dwelling tediously on a subject. The latter usage, particularly in the phrasal verb 'harp on,' is more idiomatic and requires understanding of figurative language."},"example_sentences":[{"sentence":"The music room was filled with various instruments, including several beautiful harps.","translation":"音楽室には様々な楽器があり、その中には美しいハープが数台含まれていた。","type":"noun","meaning_category":"plural of harp"},{"sentence":"She harps on about the importance of education every chance she gets.","translation":"彼女は機会があるごとに教育の重要性についてくどくど言う。","type":"verb","meaning_category":"third-person singular present of harp (to dwell tediously)"},{"sentence":"He expertly harps the traditional Irish tunes.","translation":"彼は熟練した腕で伝統的なアイルランドの曲をハープで奏でる。","type":"verb","meaning_category":"third-person singular present of harp (to play the harp)"}]}