{"word":"Haggadical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ハガダー（ユダヤ教の祭典「過越の祭り」で朗読される物語）に関する、ハガダー的な","english_definition":"Relating to the Haggadah, a Jewish text recited during the Passover Seder, which includes stories, legends, and explanations.","examples":[{"sentence":"The haggadical interpretations of the Exodus story vary among different Jewish traditions.","translation":"出エジプト記の物語のハガダー的な解釈は、異なるユダヤ教の伝統の間で異なります。"},{"sentence":"The illustrations in the illuminated manuscript are haggadical in nature, depicting scenes from the Passover narrative.","translation":"彩飾写本のイラストはハガダー的な性質を持ち、過越の物語の場面を描いています。"}],"collocations":["haggadical interpretation (ハガダー的な解釈)","haggadical tradition (ハガダー的な伝統)","haggadical illustration (ハガダー的なイラスト)","haggadical commentary (ハガダー的な解説)"],"synonyms":["narrative","legendary","exegetical","interpretive","allegorical"],"antonyms":["halakhic (律法的な)","legalistic","literal"]},{"part_of_speech":"adjective","definition":"物語的な、伝説的な、寓話的な","english_definition":"Of the nature of a story, legend, or allegory; interpretive rather than strictly legal.","examples":[{"sentence":"His sermon took on a haggadical tone, focusing on the moral lessons of the biblical story.","translation":"彼の説教はハガダー的な口調になり、聖書の物語の道徳的な教訓に焦点を当てました。"},{"sentence":"The haggadical approach to understanding scripture emphasizes the symbolic meaning of the text.","translation":"聖書を理解するためのハガダー的なアプローチは、テキストの象徴的な意味を強調します。"}],"collocations":["haggadical tone (ハガダー的な口調)","haggadical approach (ハガダー的なアプローチ)","haggadical style (ハガダー的なスタイル)"],"synonyms":["narrative","allegorical","interpretive","homiletic","parabolic"],"antonyms":["literal","factual","historical","legalistic"]}],"etymology":{"value":"Derived from the Hebrew word 'Haggadah' (הַגָּדָה), meaning 'telling' or 'narration.' It refers to the Jewish text that is read during the Passover Seder, which recounts the story of the Exodus from Egypt. The adjective 'haggadical' is formed by adding the suffix '-ical' to 'Haggadah.'","priority":"★★☆"},"pronunciation":{"ipa":"/həˈɡædɪkəl/","syllables":"ha-gad-di-cal"},"inflection":{"notes":"Adjective; comparative and superlative forms are formed using 'more' and 'most' (e.g., more haggadical, most haggadical)."},"usage_notes":{"explanation":"'Haggadical' is used to describe something related to the Haggadah, which is a central text in Judaism, particularly during Passover. It is often used in academic or religious contexts when discussing interpretations, traditions, or elements related to the Passover Seder and the Exodus story. It can also be used more broadly to describe a narrative or allegorical style of interpretation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The haggadic story was very interesting.","correct":"✓ The haggadical story was very interesting.","note":"The correct adjective form is 'haggadical,' not 'haggadic.'"},{"incorrect":"✗ He used a haggadical method for legal interpretation.","correct":"✓ He used a halakhic method for legal interpretation.","note":"'Haggadical' refers to narrative or allegorical interpretation, while 'halakhic' refers to legal or strictly observant interpretation. Using the correct term is important in Jewish studies."}],"priority":"★★☆"},"related_words":{"derivatives":["Haggadah (ハガダー)","Haggadist (ハガダの専門家)"],"phrases":["Passover Haggadah (過越のハガダー)","Seder (セデル - 過越の祭りの儀式)"],"related_concepts":["Midrash (ミドラシュ - 聖書解釈)","Halakha (ハラハー - ユダヤ法)","Exodus (出エジプト記)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Haggadical' is a specialized term primarily used in Jewish studies and religious contexts. It refers to anything related to the Haggadah, a Jewish text used during the Passover Seder to recount the story of the Exodus from Egypt. Understanding this term requires familiarity with Jewish traditions and religious vocabulary. It is not commonly used in general English. The word can also describe a narrative or allegorical style of interpretation, as opposed to a strictly legal or literal one."},"example_sentences":[{"sentence":"The professor delivered a lecture on the haggadical elements in medieval Jewish art.","translation":"教授は中世ユダヤ美術におけるハガダー的な要素について講義を行いました。","type":"adjective","meaning_category":"ハガダーに関する"},{"sentence":"The haggadical tradition emphasizes the importance of storytelling in transmitting Jewish values.","translation":"ハガダー的な伝統は、ユダヤ人の価値観を伝える上での物語の重要性を強調しています。","type":"adjective","meaning_category":"物語的な"},{"sentence":"The haggadical interpretations provide a deeper understanding of the symbolic meaning of the Passover Seder.","translation":"ハガダー的な解釈は、過越の祭りの儀式の象徴的な意味をより深く理解するのに役立ちます。","type":"adjective","meaning_category":"解釈的な"}]}