{"word":"anti-vacuum","priority":"low","meanings":[{"part_of_speech":"noun","definition":"(物理学で)真空の反対、または真空を打ち消すもの。理論上の概念であり、通常の物質が存在する空間を指す場合もある。","english_definition":"(In physics) The opposite of a vacuum, or something that counteracts a vacuum. A theoretical concept, sometimes referring to space filled with ordinary matter.","examples":[{"sentence":"Some theories propose the existence of an anti-vacuum to explain certain cosmological phenomena.","translation":"いくつかの理論は、特定の宇宙論的現象を説明するために反真空の存在を提唱している。"},{"sentence":"The concept of an anti-vacuum is often used in discussions of theoretical physics and cosmology.","translation":"反真空の概念は、理論物理学や宇宙論の議論でよく用いられる。"}],"collocations":["theoretical anti-vacuum","cosmological anti-vacuum"],"synonyms":["matter-filled space","positive pressure environment"],"antonyms":["vacuum","empty space"]},{"part_of_speech":"adjective","definition":"真空に対抗する、または真空を防ぐように設計された。","english_definition":"Designed to counteract or prevent a vacuum.","examples":[{"sentence":"The anti-vacuum valve prevents backflow in the system.","translation":"その逆止弁は、システム内の逆流を防ぐ。"},{"sentence":"This device has an anti-vacuum mechanism to ensure proper operation.","translation":"この装置は、適切な動作を保証するための逆止弁機構を備えている。"}],"collocations":["anti-vacuum valve","anti-vacuum mechanism"],"synonyms":["backflow prevention","vacuum resistant"],"antonyms":["vacuum-inducing"]}],"etymology":{"value":"\"Anti-\" (反対) + \"vacuum\" (真空)","priority":"medium"},"pronunciation":{"ipa":"/ˌæntiˈvækjʊəm/","syllables":"an-ti-vac-u-um"},"inflection":{"noun_plural":"anti-vacuums"},"usage_notes":{"explanation":"\"Anti-vacuum\" は、真空の反対の状態や真空を防ぐための機構を指す言葉です。物理学の理論的な文脈では、通常の物質で満たされた空間や、真空を打ち消すような仮説上の存在を意味することがあります。工学的な文脈では、逆止弁のような真空状態の発生を防ぐための装置や機構を指します。","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The anti-vacuum cleaner is used to create a vacuum.","correct":"The vacuum cleaner is used to create a vacuum.","note":"\"Anti-vacuum\" は真空を作るものではなく、真空を防ぐものです。真空を作るのは \"vacuum cleaner\" です。"}],"priority":"low"},"related_words":{"derivatives":["vacuum","anti-"],"related_concepts":["positive pressure","backflow","valve","theoretical physics","cosmology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"The term \"anti-vacuum\" is a specialized term primarily used in theoretical physics and engineering. In theoretical physics, it refers to a hypothetical state or space that is the opposite of a vacuum, often conceptualized as being filled with matter or energy. In engineering, it typically describes mechanisms or devices designed to prevent the formation of a vacuum or to counteract its effects, such as backflow prevention valves. Understanding this term requires familiarity with basic physics and engineering concepts."},"example_sentences":[{"sentence":"The theoretical physicists discussed the properties of an **anti-vacuum** during the conference.","translation":"理論物理学者たちは会議中に反真空の特性について議論した。","type":"noun","meaning_category":"theoretical physics"},{"sentence":"The **anti-vacuum** valve is crucial for maintaining the integrity of the pipeline system.","translation":"その逆止弁は、パイプラインシステムの完全性を維持するために不可欠である。","type":"adjective","meaning_category":"engineering"}]}