{"word":"underinvested","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"投資不足の、十分な投資を受けていない","english_definition":"Not having received sufficient investment.","examples":[{"sentence":"The company's research and development department was severely underinvested.","translation":"その会社の研究開発部門は深刻な投資不足だった。"},{"sentence":"Many public schools are underinvested, leading to poor educational outcomes.","translation":"多くの公立学校は投資不足であり、それが低い教育成果につながっている。"},{"sentence":"The region's infrastructure is underinvested and needs significant upgrades.","translation":"その地域のインフラは投資不足であり、大幅な改善が必要である。"}],"collocations":["severely underinvested","chronically underinvested","historically underinvested","underinvested in research","underinvested in infrastructure","underinvested in education"],"synonyms":["underfunded","underfinanced","deprived of investment","lacking investment"],"antonyms":["overinvested","well-funded","adequately financed","sufficiently invested"]}],"etymology":{"value":"The word is formed by adding the prefix 'under-' (meaning 'not enough' or 'below') to the word 'invested'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərɪnˈvestɪd/","syllables":"un-der-in-vest-ed"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs (e.g., severely underinvested) and used in comparative constructions (e.g., more underinvested)."},"usage_notes":{"explanation":"'Underinvested' is typically used to describe sectors, companies, or projects that have not received the necessary financial resources to thrive or meet their potential. It often implies a need for increased funding or resources to address deficiencies or achieve desired outcomes. The term is commonly used in discussions related to economics, business, education, and infrastructure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company underinvested in their employees.","correct":"✓ The company underinvested in employee training.","note":"While 'underinvested' can describe a general lack of investment, it's often more precise to specify what area was underinvested (e.g., training, equipment, etc.)."},{"incorrect":"✗ The project was underinvested of funds.","correct":"✓ The project was underinvested in funds.","note":"The correct preposition to use with 'underinvested' is 'in'. For example, 'underinvested in education' or 'underinvested in infrastructure'."}],"priority":"★★☆"},"related_words":{"derivatives":["underinvestment (noun): the act or state of not investing enough.","invest (verb): to allocate money or resources with the expectation of a future benefit.","investment (noun): the act of investing or the amount invested."],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to discussions about infrastructure and social programs.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Underinvested' is a relatively specialized term used to describe situations where something (like a company, sector, or project) has not received enough financial resources or attention. It suggests that more investment is needed to improve performance or achieve desired goals. This word is often used in economic, business, and political contexts when discussing resource allocation and development.","priority":"★★☆"},"example_sentences":[{"sentence":"The healthcare system in many rural areas is severely underinvested.","translation":"多くの地方の医療システムは深刻な投資不足である。","type":"adjective","meaning_category":"Investment"},{"sentence":"The city's public transportation system has been underinvested for decades.","translation":"その都市の公共交通機関は何十年も投資不足の状態が続いている。","type":"adjective","meaning_category":"Investment"},{"sentence":"The government needs to address the issue of underinvested infrastructure.","translation":"政府は投資不足のインフラ問題に対処する必要がある。","type":"adjective","meaning_category":"Investment"}]}