{"word":"tacheometer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"経緯儀式距離計、速測儀","english_definition":"A surveying instrument used for rapid measurement of distances, directions, and elevations, typically by optical means.","examples":[{"sentence":"The surveyor used a tacheometer to quickly map the terrain.","translation":"測量技師は、地形を迅速に地図化するために経緯儀式距離計を使用した。"},{"sentence":"Tacheometers are essential for efficient topographic surveys.","translation":"経緯儀式距離計は、効率的な地形測量に不可欠である。"}],"collocations":["use a tacheometer","tacheometer survey","tacheometer measurement"],"synonyms":["total station","theodolite","surveying instrument"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'tachys' (ταχύς) meaning 'swift' or 'rapid,' 'metron' (μέτρον) meaning 'measure,' and '-meter' (suffix indicating a measuring instrument).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtækiˈɒmɪtər/","syllables":"ta-che-o-me-ter"},"inflection":{"noun_plural":"tacheometers"},"usage_notes":{"explanation":"A tacheometer is a specialized surveying instrument primarily used for rapid distance and elevation measurements. It combines the functions of a theodolite (for angle measurement) and a distance meter, allowing surveyors to quickly gather data for topographic mapping and other surveying applications. Modern tacheometers often incorporate electronic distance measurement (EDM) and data recording capabilities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a tachometer to measure the speed of the car.","correct":"✓ I used a radar gun/speedometer to measure the speed of the car.","note":"A tachometer measures rotational speed (RPM), while a tacheometer is a surveying instrument. The terms are similar but have different applications."}],"priority":"★☆☆"},"related_words":{"derivatives":["tacheometry (noun: the science or practice of surveying using a tacheometer)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'tacheometer' refers to a specialized surveying instrument used for quickly measuring distances, directions, and elevations. It's a technical term primarily encountered in the context of surveying, civil engineering, and related fields. Understanding its function requires some familiarity with surveying principles and instrumentation."},"example_sentences":[{"sentence":"The construction team relied on the tacheometer for precise measurements.","translation":"建設チームは、正確な測定のために経緯儀式距離計に頼った。","type":"noun","meaning_category":"surveying instrument"},{"sentence":"The tacheometer data was used to create a detailed digital terrain model.","translation":"経緯儀式距離計のデータは、詳細なデジタル地形モデルを作成するために使用された。","type":"noun","meaning_category":"surveying instrument"}]}