{"word":"mucidity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The condition of being mucid; mustiness; sliminess.","english_definition":"The state or quality of being mucid; mustiness; sliminess.","examples":[{"sentence":"The mucidity of the old cellar made it unpleasant to enter.","translation":"その古い地下室のヌメリ気が、そこに入るのを不快にさせた。"},{"sentence":"The mucidity on the surface of the spoiled fruit was a sign of decay.","translation":"腐った果物の表面のヌメリは、腐敗の兆候だった。"}],"collocations":["increase in mucidity","surface mucidity","prevent mucidity"],"synonyms":["mustiness","sliminess","moldiness","dampness","stickiness"],"antonyms":["dryness","freshness","cleanliness"]}],"etymology":{"value":"Derived from the Latin word 'mucidus', meaning 'slimy' or 'moldy', which in turn comes from 'mucus'.","priority":"★★☆"},"pronunciation":{"ipa":"/mjuːˈsɪdɪti/","syllables":"mu-cid-i-ty"},"inflection":{"noun_plural":"mucidities"},"usage_notes":{"explanation":"'Mucidity' refers to the unpleasant slimy or musty condition often associated with dampness and decay. It is not a commonly used word in modern English, but it can be useful in describing specific textures or environments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mucidity was very colorful.","correct":"✓ The mold was very colorful.","note":"Mucidity describes a condition, not a substance. Use 'mold' or another appropriate noun if you are referring to a substance. "},{"incorrect":"✗ He felt mucidity.","correct":"✓ He felt the mucidity of the wall.","note":"'Mucidity' is a state or quality, so it's better to use it with 'of' to describe something that possesses that quality."}],"priority":"★★☆"},"related_words":{"derivatives":["mucid (adjective: slimy, moldy)","mucus (noun: a slimy liquid secreted by mucous membranes)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mucidity' is a relatively rare and sophisticated term used to describe the slimy, musty, or moldy condition of something, often due to dampness or decay. It's more likely to be encountered in descriptive writing or technical contexts rather than everyday conversation. Understanding its connection to 'mucus' can help in grasping its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The laboratory sample exhibited a high degree of mucidity, indicating bacterial contamination.","translation":"その実験室サンプルは高度のヌメリを示し、細菌汚染を示唆していた。","type":"noun","meaning_category":"sliminess"},{"sentence":"The old book suffered from mucidity due to years of damp storage.","translation":"その古い本は長年の湿った保管によりヌメリが生じていた。","type":"noun","meaning_category":"mustiness"},{"sentence":"The increased mucidity in the air signaled the onset of mold growth.","translation":"空気中のヌメリ気の増加は、カビの成長の始まりを示していた。","type":"noun","meaning_category":"dampness"}]}