{"word":"Knolling","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に写真撮影における)物を90度の角度で並べる行為、またはそのように配置された物の集合","english_definition":"The process of arranging related objects in parallel or 90-degree angles as a method of organization, especially for photography.","examples":[{"sentence":"He arranged his tools in perfect knolling before taking a picture.","translation":"彼は写真を撮る前に、道具を完璧なノルリングで配置した。"},{"sentence":"The knolling of her desk supplies was oddly satisfying.","translation":"彼女の机の上の文房具のノルリングは、奇妙な満足感を与えた。"}],"collocations":["perfect knolling","organized knolling","desk knolling","tool knolling","flat lay knolling"],"synonyms":["flat lay","organized arrangement","parallel alignment"],"antonyms":["disorganized clutter","random arrangement"]},{"part_of_speech":"verb","definition":"(物を)ノルリングする、90度の角度で並べる","english_definition":"To arrange objects in parallel or 90-degree angles.","examples":[{"sentence":"She spent hours knolling her collection of vintage cameras.","translation":"彼女はヴィンテージカメラのコレクションをノルリングするのに何時間も費やした。"},{"sentence":"The photographer carefully knolled the ingredients for the recipe.","translation":"写真家はレシピの材料を丁寧にノルリングした。"}],"collocations":["knolling objects","knolling items","knolling tools","knolling supplies"],"synonyms":["arrange","align","organize","layout"],"antonyms":["scatter","disarrange","clutter"]}],"etymology":{"value":"The term was coined in 1987 by Andrew Kromelow, a janitor at Frank Gehry's furniture fabrication shop. He would arrange Gehry's tools at right angles on surfaces, and Kromelow named the practice knolling, because the tools were arranged in a similar way to Knoll furniture – hence the name.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnoʊlɪŋ/","syllables":"knoll-ing"},"inflection":{"verb_forms":{"present_simple":["knoll","knolls"],"past_simple":"knolled","past_participle":"knolled","present_participle":"knolling"},"noun_plural":"knollings"},"usage_notes":{"explanation":"\"Knolling\" is primarily used in the context of design, photography, and organization. It emphasizes order, precision, and visual appeal. It's often used to showcase collections of objects or to create aesthetically pleasing images. While it can be a verb (to knoll), it's more commonly used as a noun to describe the arrangement itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm nolling my books on the shelf.","correct":"✓ I'm arranging my books on the shelf. / ✓ I'm creating a knolling arrangement of my books.","note":"While \"knolling\" can be used as a verb, it's less common than using \"arrange\" or describing the process as creating a \"knolling arrangement.\" Using \"knolling\" as a verb might sound awkward to some native speakers."},{"incorrect":"✗ This is a very good nolling.","correct":"✓ This is a very good knolling arrangement.","note":"It's more natural to say \"knolling arrangement\" rather than just \"knolling\" when referring to a specific instance of the arrangement."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["flat lay photography","minimalism","organization","visual merchandising","still life photography"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in general language learning materials)","frequency_google_ngram":"Low frequency (Relatively uncommon term, primarily used in specific design and photography contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Knolling\" is a specialized term primarily used in design, photography, and organizational contexts. It refers to the practice of arranging objects at 90-degree angles to create a visually appealing and organized composition. While not a common term in everyday conversation, it's recognized within creative and design communities. Understanding the term requires familiarity with design principles and visual aesthetics. It's more likely to be encountered in articles, blogs, or discussions related to photography, product presentation, or workspace organization."},"example_sentences":[{"sentence":"The artist meticulously created a knolling of paintbrushes and art supplies.","translation":"アーティストは絵筆と画材を細心の注意を払ってノルリングした。","type":"noun","meaning_category":"organized arrangement"},{"sentence":"Before starting the project, she knolled all the necessary tools on the workbench.","translation":"プロジェクトを始める前に、彼女は必要な道具をすべて作業台にノルリングした。","type":"verb","meaning_category":"arrange"},{"sentence":"The knolling photography trend is popular on social media for showcasing products.","translation":"ノルリング写真のトレンドは、ソーシャルメディアで製品を紹介する際に人気がある。","type":"noun","meaning_category":"organized arrangement"},{"sentence":"He admired the perfect knolling in the museum's display of antique watches.","translation":"彼は博物館のアンティーク時計の展示における完璧なノルリングに感心した。","type":"noun","meaning_category":"organized arrangement"}]}