{"word":"Grandisonianism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（サミュエル・リチャードソンの小説『サー・チャールズ・グランディソン』の主人公にちなむ）過度に礼儀正しく、高潔で、洗練された行動や性格","english_definition":"Excessive politeness, high-mindedness, and refinement of behavior or character, reminiscent of the protagonist of Samuel Richardson's novel *Sir Charles Grandison*.","examples":[{"sentence":"His Grandisonianism, while admirable in principle, often came across as insincere.","translation":"彼のグランディソニスムは、原則としては称賛に値するものの、しばしば不誠実な印象を与えた。"},{"sentence":"The play satirized the Grandisonianism of the upper class.","translation":"その劇は、上流階級のグランディソニスムを風刺した。"}],"collocations":["affected Grandisonianism","false Grandisonianism","Grandisonian manners","Grandisonian virtue"],"synonyms":["affectation","priggishness","sanctimoniousness","moral superiority"],"antonyms":["sincerity","genuineness","authenticity"]}],"etymology":{"value":"From *Grandison*, the surname of the protagonist in Samuel Richardson's novel *Sir Charles Grandison* (1753), combined with the suffix *-ianism*.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡrændɪˈsoʊniənɪzəm/","syllables":"gran-di-so-ni-an-i-sm"},"inflection":{"noun_plural":"Grandisonianisms"},"usage_notes":{"explanation":"*Grandisonianism* refers to behavior or character that is excessively polite, virtuous, and refined, often to the point of being artificial or insincere. It is derived from the character of Sir Charles Grandison in Samuel Richardson's novel, who embodies these qualities. The term is often used critically to describe someone who is perceived as being overly concerned with appearing morally superior or socially refined.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great grandisonianism by helping the poor.","correct":"✓ He showed Grandisonianism by helping the poor, but his motives seemed insincere.","note":"While helping the poor is a virtuous act, *Grandisonianism* implies that the act is performed with an excessive or insincere display of virtue."}],"priority":"★☆☆"},"related_words":{"derivatives":["Grandisonian (adjective: グランディソンのような、過度に礼儀正しい; noun: グランディソンのような人)"],"related_terms":["Richardsonian (relating to Samuel Richardson or his works)","virtue signalling (displaying moral values to signal one's social standing)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (rare and specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"*Grandisonianism* is a specialized term referring to the excessive display of politeness and virtue, often to the point of insincerity, reminiscent of the character Sir Charles Grandison in Samuel Richardson's novel. Understanding this term requires familiarity with the novel and the concept of affected virtue. It is rarely used in everyday conversation and is more likely to be encountered in literary analysis or discussions of social behavior."},"example_sentences":[{"sentence":"The politician's Grandisonianism was evident in his carefully crafted speeches and public appearances.","translation":"その政治家のグランディソニスムは、彼の注意深く練られた演説や公の場での振る舞いに明らかだった。","type":"general","meaning_category":"excessive politeness and virtue"},{"sentence":"Her Grandisonianism made it difficult to connect with her on a genuine level.","translation":"彼女のグランディソニスムのせいで、彼女と心から打ち解けるのが難しかった。","type":"general","meaning_category":"excessive politeness and virtue"},{"sentence":"The novel critiques the superficiality of Grandisonianism in 18th-century society.","translation":"その小説は、18世紀社会におけるグランディソニスムの表面的さを批判している。","type":"literary analysis","meaning_category":"excessive politeness and virtue"}]}