{"word":"Pansil","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"(Philippines) A type of noodle dish originating from the province of Batangas, Philippines.","english_definition":"A Filipino noodle dish, typically made with wheat noodles, meat (such as pork or chicken), vegetables, and a savory sauce. It is a popular dish in the Batangas province and throughout the Philippines.","examples":[{"sentence":"We ordered Pansil at the Filipino restaurant.","translation":"フィリピン料理店でパンシルを注文しました。"},{"sentence":"My grandmother makes the best Pansil in our family.","translation":"私の祖母は家族の中で一番美味しいパンシルを作ります。"}],"collocations":["Pansil Batangas","Pansil Bihon","Pansil Canton"],"synonyms":["Filipino noodles","noodle dish"],"antonyms":[]}],"etymology":{"value":"The name 'Pansil' is believed to be a local variation or shortening of 'Pancit,' a general term for noodle dishes in the Philippines, derived from the Hokkien word 'pian-sit' (便食), meaning 'convenient food.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɑːnsɪl/","syllables":"Pan-sil"},"inflection":{"notes":"Proper nouns do not typically inflect."},"usage_notes":{"explanation":"'Pansil' specifically refers to a noodle dish, particularly associated with Batangas. While similar to other Filipino noodle dishes like Pancit Canton or Pancit Bihon, it often has its own regional variations in ingredients and preparation. It is a cultural dish.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I want to eat pancit, specifically pansil.","correct":"✓ I want to eat Pansil, a type of Filipino noodle dish.","note":"'Pansil' is a specific type of 'pancit.' It's better to introduce it as a type of Filipino noodle dish."}],"priority":"★★☆"},"related_words":{"derivatives":["Pancit (general term for Filipino noodle dishes)","Bihon (thin rice noodles)","Canton (thick wheat noodles)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in the Philippines.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Pansil' is a specific type of Filipino noodle dish, similar to 'pancit' but with regional variations, particularly in the Batangas province. It's not a common word outside of the Philippines, so it's helpful to explain that it's a Filipino noodle dish when using it. It is important to understand the cultural context to use it correctly.","priority":"★★☆"},"example_sentences":[{"sentence":"She learned how to cook authentic Pansil from her mother.","translation":"彼女は母親から本場のパンシルの作り方を教わった。","type":"example","meaning_category":"Filipino cuisine"},{"sentence":"The restaurant is famous for its delicious Pansil.","translation":"そのレストランは美味しいパンシルで有名だ。","type":"example","meaning_category":"Filipino cuisine"}]}