{"word":"press-mark","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(図書館の)請求記号、配架番号","english_definition":"A code, usually consisting of letters and numbers, used in libraries to identify a book and indicate its location on the shelves.","examples":[{"sentence":"The press-mark is usually found on the spine of the book.","translation":"請求記号は通常、本の背表紙に記載されています。"},{"sentence":"Use the press-mark to locate the book in the library.","translation":"請求記号を使って図書館で本を探してください。"}],"collocations":["find a press-mark","check the press-mark","library press-mark"],"synonyms":["call number","shelf mark","location mark"],"antonyms":[]}],"etymology":{"value":"The term 'press-mark' likely originates from the practice of libraries using printing presses to create marks or labels for books, indicating their location and classification.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈprɛs mɑːrk/","syllables":"press-mark"},"inflection":{"noun_plural":"press-marks"},"usage_notes":{"explanation":"A 'press-mark' is a specific term used in library science to refer to the unique identifier assigned to each book or item in a library's collection. It serves as a guide for locating the item on the shelves. It is a more specific term than a general 'identification number'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need the press mark for this book to order it online.","correct":"✓ I need the ISBN for this book to order it online.","note":"'Press-mark' is for locating the book within a library, whereas ISBN (International Standard Book Number) is used for ordering books."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Press-mark' is a specialized term primarily used within the context of library science. It refers to the unique identifier assigned to library materials to facilitate their location on shelves. Understanding this term is essential for navigating library catalogs and physical collections effectively."},"example_sentences":[{"sentence":"The librarian helped me find the book using its press-mark.","translation":"司書は請求記号を使って本を見つけるのを手伝ってくれた。","type":"example","meaning_category":"identification"},{"sentence":"Make sure to note the press-mark before going to the stacks.","translation":"書庫に行く前に必ず請求記号をメモしてください。","type":"example","meaning_category":"location"}]}