{"word":"retranquilize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び落ち着かせる、再び静める","english_definition":"To tranquilize again; to restore to a state of calmness or tranquility.","examples":[{"sentence":"The doctor had to retranquilize the patient after they became agitated.","translation":"患者が興奮したので、医者は再び患者を落ち着かせなければならなかった。"},{"sentence":"After the loud noise, it took some time to retranquilize the dog.","translation":"騒音の後、犬を再び落ち着かせるのに時間がかかった。"}],"collocations":["retranquilize a patient","retranquilize an animal"],"synonyms":["requiet","reassure","calm","soothe"],"antonyms":["agitate","excite","disturb"]}],"etymology":{"value":"The word \"retranquilize\" is formed by adding the prefix \"re-\" (meaning \"again\" or \"back\") to the word \"tranquilize.\" \"Tranquilize\" comes from the word \"tranquil,\" which is derived from the Latin word \"tranquillus,\" meaning \"calm\" or \"quiet.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈtræŋkwɪlaɪz/","syllables":"re-tran-quil-ize"},"inflection":{"verb_forms":{"present_simple":["retranquilize","retranquilizes"],"past_simple":"retranquilized","past_participle":"retranquilized","present_participle":"retranquilizing"}},"usage_notes":{"explanation":"\"Retranquilize\" is used to describe the act of calming someone or something down again after they have become agitated or disturbed. It often implies the use of medication or other calming techniques to restore a state of tranquility.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to retranquilizing myself after that stressful meeting.","correct":"✓ I need to retranquilize myself after that stressful meeting.","note":"The correct form is the base form of the verb, 'retranquilize,' when used with 'need to.'"},{"incorrect":"✗ The retranquilized patient was still nervous.","correct":"✓ The patient who was retranquilized was still nervous.","note":"While 'retranquilized' can be used as an adjective, it's more common to use a relative clause to describe someone who has been retranquilized."}],"priority":"★☆☆"},"related_words":{"derivatives":["tranquilize","tranquilizer","tranquility","tranquil"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Word is not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"retranquilize\" is a relatively uncommon word that means to tranquilize again. It is formed by adding the prefix \"re-\" to the word \"tranquilize.\" The word is typically used in medical or veterinary contexts to describe the act of calming someone or something down after they have become agitated or disturbed. It is not a word that is commonly used in everyday conversation."},"example_sentences":[{"sentence":"The vet had to retranquilize the tiger after it woke up unexpectedly.","translation":"獣医は、トラが予期せず目を覚ました後、再びトラを落ち着かせなければならなかった。","type":"verb","meaning_category":"再び静める"},{"sentence":"The nurse attempted to retranquilize the anxious patient before surgery.","translation":"看護師は、手術前に不安な患者を再び落ち着かせようとした。","type":"verb","meaning_category":"再び落ち着かせる"}]}