{"word":"uniformitarianism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"斉一説（せいいつせつ）: 地質学の基本原理の一つで、現在地球上で起こっている地質学的プロセス（浸食、堆積、火山活動など）は、過去においても同様に作用してきたと考え、過去の地質現象を説明する際に、現在観察されるプロセスを基準とすること。","english_definition":"The principle that the same geological processes that operate today operated in the past to produce the geological features we see now.","examples":[{"sentence":"Uniformitarianism is a fundamental concept in geology.","translation":"斉一説は地質学における基本的な概念です。"},{"sentence":"Lyell's work on uniformitarianism greatly influenced Darwin.","translation":"ライエルの斉一説に関する研究は、ダーウィンに大きな影響を与えました。"},{"sentence":"The principle of uniformitarianism helps us understand Earth's history.","translation":"斉一説の原理は、私たちが地球の歴史を理解するのに役立ちます。"}],"collocations":["principle of uniformitarianism (斉一説の原理)","geological uniformitarianism (地質学的斉一説)"],"synonyms":["actualism"],"antonyms":["catastrophism (天変地異説)"]},{"part_of_speech":"adjective","definition":"斉一説の、斉一説的な","english_definition":"Relating to or based on uniformitarianism.","examples":[{"sentence":"The uniformitarian view of geological change emphasizes gradual processes.","translation":"地質変化に関する斉一説的な見方は、緩やかなプロセスを強調します。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Uniform'（一様な） + 'itarian'（主義者） + '-ism'（主義）から構成される。19世紀初頭に、地質学において、過去の地質現象を説明するために、現在観察される地質学的プロセスのみを用いるという考え方を表すために作られた言葉。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjuːnɪˌfɔːrmɪˈteəriənɪzəm/","syllables":"u-ni-for-mi-tar-i-an-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"斉一説は、過去の地質現象を理解するために、現在観察されるプロセス（例：川による浸食、火山活動、地震など）が、過去においても同様の速度と規模で作用してきたと仮定するものです。この考え方は、ジェームズ・ハットンの地質学理論に端を発し、チャールズ・ライエルによって体系化されました。ただし、斉一説は、過去に現在では考えられない規模の出来事が起こらなかったと主張するものではありません。巨大隕石の衝突や大規模な火山噴火など、現在では稀な出来事が過去に地球の歴史に大きな影響を与えた可能性も考慮されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Uniformitarianism means everything happened slowly and gradually.","correct":"✓ Uniformitarianism suggests that the same gradual processes we see today have shaped the Earth over long periods, but it doesn't exclude the possibility of catastrophic events.","note":"斉一説は、主に緩やかなプロセスを強調しますが、過去に起こった可能性のある大規模な出来事を完全に否定するものではありません。"},{"incorrect":"✗ Uniformitarianism is the opposite of evolution.","correct":"✓ Uniformitarianism is a geological principle, while evolution is a biological principle. They are not direct opposites, but they both involve gradual change over time.","note":"斉一説は地質学の原理であり、進化は生物学の原理です。両者は異なる分野の概念ですが、どちらも長期にわたる変化を扱います。"}],"priority":"★★☆"},"related_words":{"derivatives":["uniformitarian (形容詞: 斉一説の、斉一説的な)","uniformitarianly (副詞: 斉一説的に)"],"phrases":["actualism (現実主義: 斉一説とほぼ同義で用いられることがある)","gradualism (漸進主義: 変化が徐々に起こるとする考え方)"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 地質学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Uniformitarianism**（斉一説）」は、地質学で使われる専門用語で、少し難しい概念です。これは、地球の歴史を理解するために、現在私たちが観察できる地質学的なプロセス（例えば、川が土地を削ったり、火山が噴火したりすること）が、昔も同じように起こっていたという考え方です。つまり、昔の地球を理解するためには、今の地球をよく観察することが大切だ、という考え方です。この言葉は、日常会話ではあまり使いませんが、地質学や地球科学を学ぶ際には重要な言葉です。"},"example_sentences":[{"sentence":"The geologist used the principle of **uniformitarianism** to interpret the ancient rock formations.","translation":"地質学者は斉一説の原理を用いて、古代の岩石層を解釈しました。","type":"noun","meaning_category":"斉一説"},{"sentence":"The **uniformitarian** approach suggests that the Earth's features were formed by slow, continuous processes over vast periods of time.","translation":"斉一説的なアプローチは、地球の地形が長い年月をかけてゆっくりと連続的なプロセスによって形成されたことを示唆しています。","type":"adjective","meaning_category":"斉一説の"}]}