{"word":"urbanistically-sound","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"都市計画的に健全な、都市計画の観点から見て妥当な","english_definition":"Well-planned and designed from an urban planning perspective; conforming to principles of good urban design.","examples":[{"sentence":"The new development is urbanistically-sound, incorporating green spaces and pedestrian-friendly streets.","translation":"その新しい開発は都市計画的に健全であり、緑地や歩行者に優しい通りを取り入れている。"},{"sentence":"An urbanistically-sound approach is essential for creating sustainable and livable cities.","translation":"都市計画的に健全なアプローチは、持続可能で住みやすい都市を作るために不可欠である。"}],"collocations":["urbanistically-sound development","urbanistically-sound policy","urbanistically-sound design","urbanistically-sound approach"],"synonyms":["well-planned","well-designed","sustainable","livable","pedestrian-friendly"],"antonyms":["poorly-planned","unsustainable","sprawling","car-dependent"]}],"etymology":{"value":"The word is formed by combining \"urbanistically\" (relating to urban planning) and \"sound\" (meaning well-founded, reasonable, or healthy).","priority":"low"},"pronunciation":{"ipa":"/ˌɜːrbənˈɪstɪkli saʊnd/","syllables":"ur-ban-is-ti-cal-ly sound"},"inflection":{"notes":"This is an adjective and does not have different forms for gender or number."},"usage_notes":{"explanation":"This term is used to describe projects, policies, or designs that adhere to the principles of good urban planning. It implies that the development is sustainable, promotes walkability, incorporates green spaces, and contributes positively to the overall quality of life in the city. It is often used in academic or professional contexts related to urban planning and design.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The city is urbanistically sound.","correct":"The city has urbanistically-sound policies.","note":"It's more common to describe policies, developments, or approaches as urbanistically-sound, rather than the entire city itself."}],"priority":"low"},"related_words":{"derivatives":["urbanism","urbanist","urban planning","urban design","sustainable development","smart growth"],"phrasal_verbs":[],"priority":"medium"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'urbanistically-sound' is a specialized term used in the field of urban planning and design. It describes something that is well-planned and designed according to the principles of good urbanism, such as sustainability, walkability, and creating a livable environment. It is not a common word in everyday conversation."},"example_sentences":[{"sentence":"The new transit-oriented development is an example of an urbanistically-sound project.","translation":"その新しいトランジット指向開発は、都市計画的に健全なプロジェクトの例である。","type":"example","meaning_category":"general"},{"sentence":"The city council is committed to implementing urbanistically-sound policies to improve the quality of life for its residents.","translation":"市議会は、住民の生活の質を向上させるために、都市計画的に健全な政策を実施することに尽力している。","type":"example","meaning_category":"policy"}]}