{"word":"unseignioral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not befitting a seigneur; lacking the qualities or characteristics expected of a seigneur.","english_definition":"Not having or showing the qualities of a seigneur; unbecoming of a lord.","examples":[{"sentence":"His unseignioral behavior shocked the other nobles.","translation":"彼の領主らしくない振る舞いは他の貴族たちを驚かせた。"},{"sentence":"The unseignioral treatment of the peasants led to a revolt.","translation":"農民に対する領主らしくない扱いは反乱につながった。"}],"collocations":["unseignioral conduct","unseignioral actions","unseignioral attitude"],"synonyms":["ungentlemanly","unworthy","base","ignoble"],"antonyms":["seignioral","lordly","noble","gentlemanly"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'seignioral'. 'Seignioral' comes from 'seignior', an archaic term for a lord or feudal superior, derived from Old French 'seigneur' (lord).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈseɪnjərəl/","syllables":"un-sei-gnio-ral"},"inflection":{"adjective_forms":{"comparative":"more unseignioral","superlative":"most unseignioral"}},"usage_notes":{"explanation":"'Unseignioral' is a relatively rare word, primarily used in historical or literary contexts when discussing feudalism or the behavior of lords. It describes actions, attitudes, or qualities that are considered inappropriate or unbecoming for someone of noble rank or authority.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted very unseignioral to his friends.","correct":"✓ He acted in an unseignioral manner towards his friends.","note":"Because 'unseignioral' is an adjective, it should modify a noun. To describe how someone acts, use an adverbial phrase like 'in an unseignioral manner'."}],"priority":"★☆☆"},"related_words":{"derivatives":["seignior (noun): a lord or feudal superior","seignioral (adjective): relating to a seigneur or feudal lord","seigniory (noun): the territory or jurisdiction of a seigneur"],"related_terms":["feudal","lord","nobility","aristocracy"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unseignioral' is a sophisticated word used to describe behavior or characteristics that are inappropriate for a lord or someone of high social status, especially in a historical context related to feudalism. Understanding this word requires knowledge of the historical role of seigneurs and the expected conduct associated with that position. It is not commonly used in modern English.","priority":"★☆☆"},"example_sentences":[{"sentence":"The knight's unseignioral display of greed tarnished his reputation.","translation":"騎士の領主らしくない貪欲な態度は彼の評判を傷つけた。","type":"adjective","meaning_category":"behavior"},{"sentence":"His unseignioral disregard for the peasants' suffering was widely criticized.","translation":"彼の領主らしくない農民の苦しみに対する無視は広く批判された。","type":"adjective","meaning_category":"attitude"}]}