{"word":"Huntingdonshire","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ハンティンドンシャー（イングランドの歴史的なカウンティ）","english_definition":"A historic county in England, now part of Cambridgeshire.","examples":[{"sentence":"Huntingdonshire is known for its rural landscapes.","translation":"ハンティンドンシャーは、その田園風景で知られています。"},{"sentence":"Oliver Cromwell was born in Huntingdonshire.","translation":"オリバー・クロムウェルはハンティンドンシャーで生まれました。"}],"collocations":["in Huntingdonshire","Huntingdonshire villages","Huntingdonshire history"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Huntingdonshire' is derived from the town of Huntingdon, which likely comes from the Old English 'huntan dūn', meaning 'hunter's hill'. The 'shire' suffix indicates a county or administrative division.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhʌntɪŋdənʃər/","syllables":"Hun-ting-don-shire"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Huntingdonshire is no longer an administrative county but a historic one, forming part of Cambridgeshire. It's used in geographical and historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I live in Huntingdonshire, Cambridgeshire.","correct":"✓ I live in Huntingdonshire, which is part of Cambridgeshire.","note":"Huntingdonshire is part of Cambridgeshire, so it's more accurate to clarify the relationship."}],"priority":"★☆☆"},"related_words":{"derivatives":["Huntingdon (town)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency, used primarily in UK-specific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Huntingdonshire' refers to a specific geographic location in England. It's a historical county, meaning it's recognized for its history and cultural significance, but it's no longer an administrative division. The word is most likely to appear in texts about British geography, history, or local culture. It's a relatively uncommon word outside of these contexts."},"example_sentences":[{"sentence":"The Fens in Huntingdonshire are a haven for wildlife.","translation":"ハンティンドンシャーのフェン地帯は野生生物の避難場所です。","type":"noun","meaning_category":"Location"},{"sentence":"Many historical buildings can still be found in Huntingdonshire.","translation":"多くの歴史的建造物が今もハンティンドンシャーで見られます。","type":"noun","meaning_category":"Location"}]}