{"word":"citable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"引用可能な、引用するに値する","english_definition":"Suitable or worthy of being cited or quoted, especially as an authority or example.","examples":[{"sentence":"This research paper provides citable evidence to support the theory.","translation":"この研究論文は、その理論を裏付ける引用可能な証拠を提供します。"},{"sentence":"The professor's lecture was full of citable quotes from famous philosophers.","translation":"教授の講義は、有名な哲学者の引用するに値する言葉で満たされていました。"},{"sentence":"Is this source citable in an academic paper?","translation":"この情報源は学術論文で引用可能ですか？"}],"collocations":["citable source","citable evidence","citable quote","citable authority","citable reference"],"synonyms":["quotable","referable","attributable","authoritative","verifiable"],"antonyms":["uncitable","unreliable","unverifiable","unattributable"]}],"etymology":{"value":"The word 'citable' is formed by adding the suffix '-able' (meaning 'capable of' or 'suitable for') to the verb 'cite'. 'Cite' comes from the Latin word 'citare', meaning 'to summon, to quote'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsaɪtəbəl/","syllables":"ci-ta-ble"},"inflection":{"notes":"Since 'citable' is an adjective, it has comparative and superlative forms: more citable, most citable."},"usage_notes":{"explanation":"'Citable' is typically used in academic, legal, and journalistic contexts to describe sources, evidence, or statements that are reliable and appropriate to include in formal writing or arguments. It implies that the information has a certain level of credibility and can be attributed to a specific source.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The citable of this book is very high.","correct":"✓ The citability of this book is very high.","note":"'Citable' is an adjective, so it describes a noun. The correct noun form is 'citability' (the quality of being citable)."},{"incorrect":"✗ He is a very citable person.","correct":"✓ He is a highly respected authority. / ✓ His works are highly citable.","note":"While technically correct, saying someone is a 'citable person' sounds awkward. It's better to say they are an authority or that their works are citable."}],"priority":"★★☆"},"related_words":{"derivatives":["cite (verb): to quote or refer to (a source)","citation (noun): the act of citing; a reference to a source","citability (noun): the quality of being citable"],"related_terms":["source","reference","evidence","authority","quotation"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Citable' means something is good enough to be used as a source in writing, like in a school paper or a news article. It means the information is trustworthy and you can say where you got it from. It's used when talking about research and making sure your information is correct."},"example_sentences":[{"sentence":"The website is not considered a citable source for academic research.","translation":"そのウェブサイトは、学術研究のための引用可能な情報源とは見なされていません。","type":"adjective","meaning_category":"引用可能な情報源"},{"sentence":"The lawyer presented citable precedents to support his client's case.","translation":"弁護士は、依頼人の主張を裏付けるために、引用可能な判例を提示しました。","type":"adjective","meaning_category":"引用可能な判例"},{"sentence":"Ensure that all data used in the report is from citable and reliable sources.","translation":"レポートで使用されるすべてのデータが、引用可能で信頼できる情報源からのものであることを確認してください。","type":"adjective","meaning_category":"引用可能な情報源"}]}