{"word":"Ballet-proper","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A highly formalized style of ballet technique.","english_definition":"A specific, highly formalized style of ballet technique characterized by precise movements, specific body positions, and adherence to traditional ballet principles.","examples":[{"sentence":"The dancer's training focused on Ballet-proper, emphasizing classical form and technique.","translation":"そのダンサーの訓練は、古典的な形式と技術を重視した、バレエ・プロパーに焦点を当てていた。"}],"collocations":["classical ballet","traditional ballet","formal ballet technique"],"synonyms":["classical ballet","traditional ballet"],"antonyms":["contemporary ballet","modern ballet"]}],"etymology":{"value":"The term 'Ballet-proper' is used to distinguish a specific, formal style of ballet from more modern or contemporary forms. It emphasizes adherence to traditional ballet principles and techniques.","priority":"N/A"},"pronunciation":{"ipa":"/bæˈleɪ ˈprɒpər/","syllables":"bal-ley-pro-per"},"inflection":{"noun_plural":"N/A"},"usage_notes":{"explanation":"'Ballet-proper' is a term used to describe a specific style of ballet that adheres strictly to classical traditions and techniques. It is often contrasted with more modern or contemporary forms of ballet that may incorporate different styles or movements.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["ballet","classical ballet","contemporary ballet","modern ballet"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Ballet-proper' refers to a highly formalized and traditional style of ballet, emphasizing precise movements and adherence to classical principles. It is often used to distinguish this specific style from more modern or contemporary forms of ballet that may incorporate different techniques or movements."},"example_sentences":[{"sentence":"The school's curriculum is rooted in Ballet-proper, ensuring a strong foundation in classical technique.","translation":"その学校のカリキュラムはバレエ・プロパーに根ざしており、古典的な技術の強固な基礎を保証している。","type":"noun","meaning_category":"formal ballet technique"}]}