{"word":"macrofossil","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"大型化石、肉眼で見える化石","english_definition":"A fossil large enough to be visible without the aid of a microscope; a fossilized plant or animal large enough to be examined by the naked eye.","examples":[{"sentence":"The museum's macrofossil collection includes dinosaur bones and fossilized tree trunks.","translation":"博物館の大型化石コレクションには、恐竜の骨や化石化した木の幹が含まれています。"},{"sentence":"Macrofossil analysis helps scientists understand past ecosystems.","translation":"大型化石の分析は、科学者が過去の生態系を理解するのに役立ちます。"},{"sentence":"Unlike microfossils, macrofossils can often be identified directly in the field.","translation":"微化石とは異なり、大型化石は多くの場合、野外で直接識別できます。"}],"collocations":["macrofossil assemblage (大型化石群集)","macrofossil analysis (大型化石分析)","plant macrofossil (植物大型化石)","animal macrofossil (動物大型化石)"],"synonyms":["megafossil"],"antonyms":["microfossil"]},{"part_of_speech":"noun","definition":"(古植物学)肉眼で識別可能な植物化石","english_definition":"(Paleobotany) A plant fossil large enough to be identified without the aid of a microscope.","examples":[{"sentence":"Plant macrofossils provide valuable information about past vegetation and climate.","translation":"植物大型化石は、過去の植生と気候に関する貴重な情報を提供します。"},{"sentence":"The study of plant macrofossils is essential for reconstructing ancient landscapes.","translation":"植物大型化石の研究は、古代の景観を再構築するために不可欠です。"}],"collocations":["plant macrofossil remains (植物大型化石の残骸)","identification of plant macrofossils (植物大型化石の識別)"],"synonyms":["plant megafossil"],"antonyms":["plant microfossil"]}],"etymology":{"value":"\"macro-\" (large) + \"fossil\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈmækroʊˌfɒsɪl/","syllables":"mac-ro-fos-sil"},"inflection":{"noun_plural":"macrofossils"},"usage_notes":{"explanation":"The term \"macrofossil\" is used to distinguish fossils visible to the naked eye from \"microfossils,\" which require magnification to be seen. Macrofossils are important for understanding the evolution and distribution of larger organisms, as well as for reconstructing past environments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ macro fossil","correct":"✓ macrofossil","note":"It should be written as one word."},{"incorrect":"✗ macrofossils is","correct":"✓ macrofossils are","note":"Macrofossils is plural, so it takes a plural verb."}],"priority":"★★☆"},"related_words":{"derivatives":["macrofossil record (大型化石記録)"],"related_terms":["fossil","microfossil","paleontology","paleobotany","sedimentary rock"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"macrofossil\" is a scientific term used in paleontology and related fields. It refers to fossils that are large enough to be seen without a microscope, distinguishing them from microfossils. Understanding this term requires some familiarity with scientific vocabulary and the study of fossils."},"example_sentences":[{"sentence":"Researchers discovered a well-preserved macrofossil of an ancient fern in the coal mine.","translation":"研究者たちは、炭鉱で古代のシダの保存状態の良い大型化石を発見しました。","type":"noun","meaning_category":"大型化石"},{"sentence":"The macrofossil evidence suggests that the area was once a lush forest.","translation":"大型化石の証拠は、その地域がかつて緑豊かな森林であったことを示唆しています。","type":"noun","meaning_category":"大型化石"},{"sentence":"By studying plant macrofossils, scientists can reconstruct the vegetation of past ecosystems.","translation":"植物大型化石を研究することで、科学者は過去の生態系の植生を再構築できます。","type":"noun","meaning_category":"植物化石"}]}