{"word":"cassumuniar","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(archaic) A type of aromatic ginger, also known as Bengal ginger.","english_definition":"(archaic) An aromatic ginger, Zingiber cassumunar, also known as Bengal ginger.","examples":[{"sentence":"The cassumuniar was used in traditional medicine for its anti-inflammatory properties.","translation":"カスムニアルは、その抗炎症作用のために伝統医学で使用されていました。"}],"collocations":["cassumuniar root","cassumuniar extract"],"synonyms":["Bengal ginger","Zingiber cassumunar"],"antonyms":[]}],"etymology":{"value":"Derived from the Malay word 'kasumbo' or 'kasumbor', referring to the plant's reddish color.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkæsjuːməˈnaɪər/","syllables":"cas-su-mu-ni-ar"},"inflection":{"notes":"Plural form is 'cassumuniars'."},"usage_notes":{"explanation":"'Cassumuniar' is an archaic term and is not commonly used in modern English. It is more frequently referred to by its scientific name, Zingiber cassumunar, or as Bengal ginger.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I added cassumuniar to my tea for sweetness.","correct":"✓ I added cassumuniar to my tea for its medicinal properties.","note":"Cassumuniar is not primarily used for sweetness but for its medicinal and aromatic qualities."}],"priority":"★☆☆"},"related_words":{"derivatives":["cassumunarol (a chemical compound found in cassumuniar)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'cassumuniar' is highly specialized and rarely encountered outside of historical or botanical contexts. Understanding requires familiarity with archaic terminology and knowledge of specific plant species.","priority":"★☆☆"},"example_sentences":[{"sentence":"The ancient texts described the use of cassumuniar in preparing medicinal balms.","translation":"古代の文献には、薬効のある香油を調合する際にカスムニアルを使用することが記載されていました。","type":"noun","meaning_category":"aromatic ginger"}]}