{"word":"serotype","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"血清型：微生物（細菌、ウイルスなど）を、細胞表面抗原の違いによって分類した型。","english_definition":"A distinct variation within a species of bacteria or virus or among immune cells of different individuals. These microorganisms, viruses or cells are classified together based on their cell surface antigens, allowing the epidemiologic classification of organisms to the subspecies level.","examples":[{"sentence":"Salmonella has many different serotypes.","translation":"サルモネラ菌には多くの異なる血清型が存在する。"},{"sentence":"Serotyping is important for tracking the spread of infectious diseases.","translation":"血清型判定は感染症の蔓延を追跡する上で重要である。"},{"sentence":"The serotype of the virus determines the severity of the infection.","translation":"ウイルスの血清型が感染の重症度を決定する。"}],"collocations":["serotype identification (血清型同定)","serotype distribution (血清型分布)","novel serotype (新規血清型)","dominant serotype (優勢な血清型)","serotype prevalence (血清型有病率)"],"synonyms":["serovar","subtype","strain"],"antonyms":[]}],"etymology":{"value":"「sero-」（血清）+ 「type」（型）の組み合わせ。微生物の分類において、血清学的反応の違いに基づいて区別される型を意味する。","priority":"★★☆"},"pronunciation":{"ipa":"ˈsɪəroʊtaɪp","syllables":"se-ro-type"},"inflection":{"noun_plural":"serotypes"},"usage_notes":{"explanation":"「**serotype**」は、微生物学、免疫学、疫学の分野で用いられる専門用語です。細菌、ウイルス、または免疫細胞を、細胞表面にある抗原（特に血清学的反応を引き起こす抗原）の違いに基づいて分類した型を指します。血清型を特定することで、感染症の発生源や感染経路を追跡したり、ワクチンの開発や効果を評価したりすることが可能になります。血清型は、同じ種の中でも抗原性の異なる亜種を区別するために使用され、感染症の制御と予防に不可欠な情報を提供します。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The serotype is a type of blood.","correct":"✓ A serotype is a classification of microorganisms based on their surface antigens.","note":"血清型は血液の種類ではなく、微生物の分類です。"},{"incorrect":"✗ Serotype is only used for humans.","correct":"✓ Serotype is used for classifying various microorganisms, including bacteria and viruses, that affect both humans and animals.","note":"血清型は人間だけでなく、動物に影響を与える微生物の分類にも使用されます。"},{"incorrect":"✗ Serotype and genotype are the same thing.","correct":"✓ Serotype is based on surface antigens, while genotype is based on genetic makeup.","note":"血清型は表面抗原に基づいており、遺伝子型は遺伝的構成に基づいています。"}],"priority":"★★☆"},"related_words":{"derivatives":["serotyping (血清型判定)","serotypical (血清型的な)"],"phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1-C2 (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 専門分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**serotype**」は、細菌やウイルスなどの微生物を、その表面にある抗原の違いによって分類したものです。この分類は、感染症がどのように広がるかを調べたり、ワクチンを作ったりするのに役立ちます。例えば、サルモネラ菌にはたくさんの種類がありますが、それぞれ血清型が異なります。血清型を調べることを「血清型判定」と言います。この言葉は専門的な分野で使われることが多いです。"},"example_sentences":[{"sentence":"Different serotypes of E. coli can cause different illnesses.","translation":"大腸菌の異なる血清型は、異なる病気を引き起こす可能性がある。","type":"general","meaning_category":"微生物分類"},{"sentence":"The vaccine protects against several common serotypes of pneumococcus.","translation":"そのワクチンは、一般的な肺炎球菌のいくつかの血清型に対して保護効果がある。","type":"medical","meaning_category":"ワクチン"},{"sentence":"Monitoring serotype distribution helps track the evolution of pathogens.","translation":"血清型分布のモニタリングは、病原体の進化を追跡するのに役立つ。","type":"epidemiology","meaning_category":"疫学"}]}