{"word":"Shen","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(中国語) 神 (shén): 中国の宗教や哲学における精神、魂、神霊、意識などを指す言葉。","english_definition":"(Chinese) 神 (shén): A Chinese word referring to spirit, soul, deity, consciousness, or mental faculties in Chinese religion and philosophy.","examples":[{"sentence":"中医では、精神的な健康は「神」の状態と深く関わっていると考えられています。","translation":"In traditional Chinese medicine, mental health is considered deeply connected to the state of 'Shen'.","notes":"This example illustrates the concept of 'Shen' in the context of traditional Chinese medicine."},{"sentence":"道教では、人間の体には様々な「神」が宿るとされています。","translation":"In Taoism, it is believed that various 'Shen' reside within the human body.","notes":"This example shows the concept of 'Shen' in Taoism."}],"collocations":["养神 (yǎng shén): 精神を養う、心を落ち着かせる","伤神 (shāng shén): 心を痛める、精神を消耗する","精神 (jīng shén): 精神、心","神气 (shén qì): 生気、活気、様子、態度"],"synonyms":["精神 (jīng shén)","灵魂 (líng hún)","神灵 (shén líng)","意识 (yì shí)"],"antonyms":[]}],"etymology":{"value":"中国語の「神 (shén)」に由来。甲骨文字にも見られる古い文字で、祭壇に供物を捧げる様子を表した象形文字であるという説がある。","priority":"★★☆"},"pronunciation":{"ipa":"/ʃɛn/","syllables":"Shen"},"inflection":{},"usage_notes":{"explanation":"「Shen」は、中国の文化、宗教、哲学において非常に重要な概念です。単に「神」と訳されることもありますが、西洋の神の概念とは異なり、より広範な意味を持ちます。人間の精神、魂、意識、活力、神霊など、目に見えない生命エネルギーや精神的な側面を包括的に指します。また、中医（中国伝統医学）においては、健康状態を測る重要な指標の一つとされています。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Shen is a god in Chinese mythology like Zeus.","correct":"✓ Shen is a concept in Chinese philosophy related to spirit and consciousness, not necessarily a god like Zeus.","note":"'Shen' is a broader concept than a specific deity like Zeus. It encompasses spirit, consciousness, and mental faculties."},{"incorrect":"✗ My shen is very strong because I exercise a lot.","correct":"✓ My jing (essence) and qi (vital energy) are strong because I exercise a lot, which can positively influence my shen (spirit).","note":"While physical exercise can indirectly influence 'Shen' by improving overall well-being, 'Shen' is more directly related to mental and spiritual health. 'Jing' (essence) and 'Qi' (vital energy) are more directly related to physical strength."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["精 (jīng): エッセンス、生命力","气 (qì): 気、生命エネルギー","精气神 (jīng qì shén): 生命の三宝（エッセンス、気、精神）"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"比較的に低い (Relatively low) - 主に中国文化や哲学、中医などの文脈で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Shen (神)**」は、中国の哲学や宗教、特に道教や仏教、そして中国伝統医学（TCM）において重要な概念です。これは、単なる「神」というよりも、精神、意識、魂、心の状態、または精神的な活力といった、より広範な意味合いを持ちます。TCMでは、Shenは個人の精神的な健康と幸福を反映するものと見なされ、精(Jing)と気(Qi)と共に、生命の三つの宝（三宝）の一つとされています。この言葉は、西洋の読者にとっては馴染みが薄いかもしれませんが、中国文化を理解する上で不可欠な概念です。"},"example_sentences":[{"sentence":"中医认为，心主神明，心是神居住的场所。(Zhōngyī rènwéi, xīn zhǔ shénmíng, xīn shì shén jūzhù de chǎngsuǒ.)","translation":"Traditional Chinese medicine believes that the heart governs the Shen, and the heart is the place where the Shen resides.","type":"noun","meaning_category":"精神、魂"},{"sentence":"他最近工作压力大，有点伤神。(Tā zuìjìn gōngzuò yālì dà, yǒudiǎn shāng shén.)","translation":"He has been under a lot of work pressure recently and is a bit mentally exhausted.","type":"verb (used as part of a phrase)","meaning_category":"精神を消耗する"},{"sentence":"养神的关键在于保持心态平和。(Yǎng shén de guānjiàn zàiyú bǎochí xīntài pínghé.)","translation":"The key to nourishing the Shen lies in maintaining a peaceful state of mind.","type":"verb (used as part of a phrase)","meaning_category":"精神を養う"}]}