{"word":"ethylenoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"エチレン型の、エチレンに類似した","english_definition":"Resembling ethylene or having properties similar to ethylene.","examples":[{"sentence":"Ethylenoid compounds are important in polymer chemistry.","translation":"エチレン型化合物は高分子化学において重要である。"},{"sentence":"The ethylenoid structure contributes to the molecule's reactivity.","translation":"エチレン型構造は分子の反応性に寄与する。"}],"collocations":["ethylenoid compound","ethylenoid structure"],"synonyms":["olefinic","unsaturated"],"antonyms":["saturated"],"notes":"Used primarily in chemistry to describe compounds containing a carbon-carbon double bond."}],"etymology":{"value":"From ethylene + -oid (suffix indicating resemblance).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛθɪˈliːnɔɪd/","syllables":"eth-yl-e-noid"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"'Ethylenoid' is a technical term used in organic chemistry to describe molecules or structures that are similar to ethylene (C₂H₄), particularly in having a carbon-carbon double bond. It indicates a degree of unsaturation and often implies specific chemical properties.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ethylenoid is used as a fuel.","correct":"✓ An ethylenoid compound is used as a fuel.","note":"'Ethylenoid' is an adjective; it must modify a noun (e.g., 'ethylenoid compound')."}],"priority":"★★☆"},"related_words":{"derivatives":["ethylene","olefin","alkene"],"related_terms":["polymerization","unsaturation","double bond"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ethylenoid' is a specialized term in organic chemistry. It describes compounds that share structural similarities with ethylene, specifically the presence of a carbon-carbon double bond. Understanding this term requires a background in chemistry, as it relates to concepts such as unsaturation and reactivity in organic molecules. It's not commonly used outside of scientific or technical discussions.","requires_background":"Requires background in organic chemistry."},"example_sentences":[{"sentence":"The ethylenoid character of the monomer allows for chain growth during polymerization.","translation":"モノマーのエチレン型特性により、重合中の鎖成長が可能になる。","type":"adjective","meaning_category":"chemical structure"},{"sentence":"Spectroscopic analysis confirmed the presence of an ethylenoid moiety in the synthesized molecule.","translation":"分光分析により、合成された分子中にエチレン型部分が存在することが確認された。","type":"adjective","meaning_category":"chemical analysis"}]}