{"word":"posteriad","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(数学) 階乗の逆数和の整数部分。つまり、e (ネイピア数) の整数部分である2。","english_definition":"(mathematics) The integer part of the sum of the reciprocals of the factorials; that is, the integer part of e (Euler's number), which is 2.","examples":[{"sentence":"The posteriad is a mathematical constant related to the exponential function.","translation":"ポステリアドは、指数関数に関連する数学定数です。"},{"sentence":"Calculating the posteriad involves summing an infinite series.","translation":"ポステリアドの計算には、無限級数の総和が含まれます。"}],"collocations":["calculate the posteriad","the value of the posteriad"],"synonyms":["integer part of e","floor(e)"],"antonyms":[]}],"etymology":{"value":"The term 'posteriad' is derived from 'posterior' and 'factorial'. It refers to the integer part of the sum of the reciprocals of the factorials, which is related to the exponential function and the number e.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌpɒstɪˈraɪæd/","syllables":"pos-te-ri-ad"},"inflection":{"noun_plural":"posteriads"},"usage_notes":{"explanation":"The term 'posteriad' is a relatively rare term in mathematics, specifically referring to the integer part of the infinite sum 1/0! + 1/1! + 1/2! + 1/3! + ..., which equals the integer part of the mathematical constant e (Euler's number or Napier's constant). The value of the posteriad is 2. It is primarily used in mathematical discussions and literature related to series, factorials, and the number e.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The posteriad is an irrational number.","correct":"✓ The posteriad is an integer.","note":"The posteriad is the integer part of e, so it is an integer (2), not an irrational number. e itself is irrational."}],"priority":"★☆☆"},"related_words":{"derivatives":["factorial","exponential","e (Euler's number)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'posteriad' is highly specialized and rarely encountered outside advanced mathematical contexts. It refers to the integer part of the sum of reciprocals of factorials, equivalent to the integer part of the mathematical constant 'e'. Understanding requires familiarity with mathematical series, factorials, and the nature of 'e'. Its usage is confined to theoretical discussions within mathematics.","priority":"☆☆☆"},"example_sentences":[{"sentence":"In mathematics, the posteriad is equal to 2.","translation":"数学において、ポステリアドは2に等しい。","type":"noun","meaning_category":"definition"},{"sentence":"The posteriad can be calculated using the series expansion of e.","translation":"ポステリアドは、eの級数展開を用いて計算できる。","type":"noun","meaning_category":"calculation"}]}