{"word":"psaltress","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"女性の詩篇歌唱者、女性の詩篇演奏者","english_definition":"A woman who sings psalms or plays the psaltery.","examples":[{"sentence":"The psaltress's voice filled the chapel with a heavenly sound.","translation":"その女性詩篇歌唱者の声は、礼拝堂を天上の響きで満たした。"}],"collocations":["sing psalms","play the psaltery"],"synonyms":["psalmist (gender-neutral)"],"antonyms":[]}],"etymology":{"value":"Derived from \"psalter,\" referring to the Book of Psalms or a stringed instrument used to accompany the singing of psalms. The suffix \"-ess\" is added to denote a female performer.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɔːltrɪs/","syllables":"psalt-ress"},"inflection":{"noun_plural":"psaltresses"},"usage_notes":{"explanation":"The term \"psaltress\" is relatively archaic and rarely used in modern English. It specifically refers to a female who performs psalms, either vocally or instrumentally (typically with a psaltery). The more common and gender-neutral term is \"psalmist.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a psaltress.","correct":"✓ She is a psaltress. / ✓ He is a psalmist.","note":"\"Psaltress\" is specifically for females. Use \"psalmist\" for males or when gender is unspecified."}],"priority":"★☆☆"},"related_words":{"derivatives":["psalter","psaltery","psalmist"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency - an archaic term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'psaltress' is a highly specialized and archaic term. Understanding requires familiarity with religious terminology and historical musical practices. It's unlikely to be encountered outside of specialized contexts such as historical literature or religious studies."},"example_sentences":[{"sentence":"The medieval manuscript depicts a psaltress playing for the queen.","translation":"その中世の写本には、女王のために演奏する女性詩篇演奏者が描かれている。","type":"noun","meaning_category":"female psalm performer"},{"sentence":"Her skill as a psaltress was renowned throughout the kingdom.","translation":"彼女の女性詩篇歌唱者としての腕前は王国中に知れ渡っていた。","type":"noun","meaning_category":"female psalm singer"}]}