{"word":"Autolith","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(地質学) 自源岩塊：火成岩中に見られる、周囲の岩石と組成が類似した岩石の包有物。一般に、同じマグマ溜まりから早期に結晶化したものが、後に固化した岩石に取り込まれたと考えられている。","english_definition":"(Geology) A xenolith of igneous rock that is similar in composition to the surrounding igneous rock. It is generally believed to have formed earlier from the same magma chamber and was later incorporated into the solidified rock.","examples":[{"sentence":"The granite contained several autoliths, indicating a complex history of magma crystallization.","translation":"その花崗岩にはいくつかの自源岩塊が含まれており、マグマの結晶化の複雑な歴史を示していた。"},{"sentence":"Analysis of the autolith's mineral composition revealed it was slightly richer in iron than the surrounding rock.","translation":"自源岩塊の鉱物組成の分析により、周囲の岩石よりも鉄分がわずかに豊富であることが明らかになった。"}],"collocations":["autolith occurrence","autolith composition","autolith analysis","granitic autolith","dioritic autolith"],"synonyms":["cognate xenolith","igneous enclave"],"antonyms":["xenolith (異質岩塊：周囲の岩石と組成が異なる岩石の包有物)"]}],"etymology":{"value":"ギリシャ語の 'auto-' (自己) + 'lithos' (石) から。つまり、「自己の石」を意味し、起源が周囲の岩石と関連していることを示唆する。","priority":"★★★"},"pronunciation":{"ipa":"ˈɔːtoʊˌlɪθ","syllables":"Au-to-lith"},"inflection":{"noun_plural":"autoliths"},"usage_notes":{"explanation":"Autoliths are important geological features that provide insights into the processes occurring within magma chambers. Their presence and composition can help geologists understand the evolution of magmas and the formation of igneous rocks. They are often studied to determine the conditions under which they formed and the relationship between the autolith and the host rock.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The geologist identified the rock as an autolite.","correct":"✓ The geologist identified the rock as an autolith.","note":"The correct term is 'autolith' (岩塊) not 'autolite' (オートライト：自動点灯装置)."},{"incorrect":"✗ The autolith was significantly different in composition from the surrounding rock, indicating it was likely a xenolith.","correct":"✓ The xenolith was significantly different in composition from the surrounding rock.","note":"Autoliths are, by definition, similar in composition to the surrounding rock. If the composition is significantly different, it is more likely a xenolith."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["xenolith","enclave","magma","igneous rock","granite","diorite","petrology","geochemistry"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な地質学の語彙)","frequency_google_ngram":"低頻度 (Low frequency) - 地質学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Autolith' is a specialized geological term referring to a fragment of igneous rock found within a larger body of igneous rock, with which it shares a similar composition. Understanding this term requires a background in geology, specifically petrology and geochemistry, to grasp the significance of compositional similarities and the processes within magma chambers. The term is primarily used in scientific literature and discussions among geologists.","priority":"★★☆"},"example_sentences":[{"sentence":"The presence of numerous autoliths in the granite suggests a complex history of magma mixing and crystallization.","translation":"花崗岩中に多数の自源岩塊が存在することは、マグマの混合と結晶化の複雑な歴史を示唆している。","type":"example","meaning_category":"geology"},{"sentence":"Geochemical analysis of the autolith revealed that it originated from a slightly different part of the same magma chamber.","translation":"自源岩塊の地球化学的分析により、それが同じマグマ溜まりのわずかに異なる部分に由来することが明らかになった。","type":"example","meaning_category":"geochemistry"}]}