{"word":"disegno","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(イタリア語)デザイン、デッサン、構想、意匠","english_definition":"(Italian) design, drawing, concept, plan","examples":[{"sentence":"Il Rinascimento italiano ha dato grande importanza al concetto di disegno.","translation":"The Italian Renaissance placed great importance on the concept of disegno.","usage_notes":"In art, disegno refers to the intellectual conception of a work of art as well as its execution in drawing."}],"collocations":["disegno interiore (内なるデザイン、内面の構想)","scuola del disegno (デザイン学校、デッサンスクール)"],"synonyms":["progetto","schizzo","ideazione","concezione"],"antonyms":[]}],"etymology":{"value":"Italian word derived from the Latin 'designare' meaning 'to designate, mark out, devise'.","priority":"★★☆"},"pronunciation":{"ipa":"/diˈzeɲɲo/","syllables":"di-se-gno"},"inflection":{"noun_plural":"disegni"},"usage_notes":{"explanation":"'Disegno' is an Italian term that has a specific meaning in art history, particularly in relation to Renaissance art. It encompasses both the ability to draw and the intellectual capacity to conceive and invent a design. It's often contrasted with 'colore' (color), representing a debate about the relative importance of line and color in painting.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["designare (イタリア語の動詞: デザインする、指定する)","disegnatore (イタリア語の名詞: デザイナー、製図者)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency, primarily used in art historical contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Disegno' is a specialized term primarily encountered in the context of Italian Renaissance art history. Understanding its meaning requires familiarity with art historical concepts and Italian terminology. It is not a word commonly used in everyday English or Italian.","priority":"☆☆☆"},"example_sentences":[{"sentence":"Vasari sosteneva che il disegno fosse il padre delle tre arti: pittura, scultura e architettura.","translation":"Vasari maintained that disegno was the father of the three arts: painting, sculpture, and architecture.","type":"noun","meaning_category":"design/concept"},{"sentence":"Il disegno preparatorio rivela la maestria dell'artista.","translation":"The preparatory drawing reveals the mastery of the artist.","type":"noun","meaning_category":"drawing"}]}