{"word":"protococcaceous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(主に植物学で) 単細胞藻類であるプロトコッカス属に似た、またはそれらに関連する","english_definition":"(chiefly botany) Resembling or relating to protococcus, a genus of single-celled green algae.","examples":[{"sentence":"The lichen's algal component was described as protococcaceous.","translation":"その地衣類の藻類成分は、プロトコッカス属に似ていると記述された。"}],"collocations":[],"synonyms":["algal","chlorococcalean"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Protococcus' + '-aceous' (suffix indicating resemblance or relation). 'Protococcus' comes from Greek 'protos' (first) + 'kokkos' (berry, grain), referring to the simple, single-celled structure of these algae.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊtoʊˌkɑkˈseɪʃəs/","syllables":"pro-to-coc-ca-ceous"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"The term 'protococcaceous' is primarily used in botanical and phycological contexts to describe algae that share morphological or structural similarities with the Protococcus genus. It is often used in descriptions of lichens or other symbiotic relationships where the algal component is a single-celled green alga.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Protococcus (genus name)"],"related_terms":["algae","lichen","phycology","chlorophyta"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'protococcaceous' is a highly specialized term used within the fields of botany and phycology. Understanding requires familiarity with algal taxonomy and morphology. It is unlikely to be encountered outside of scientific literature or specialized discussions within these fields."},"example_sentences":[{"sentence":"Microscopic examination revealed the presence of protococcaceous cells within the lichen thallus.","translation":"顕微鏡検査により、地衣体の内部にプロトコッカス属に似た細胞の存在が明らかになった。","type":"descriptive","meaning_category":"botany"}]}