{"word":"positivism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"実証主義","english_definition":"a philosophical system recognizing only that which can be scientifically verified or which is capable of logical or mathematical proof, and therefore rejecting metaphysics and theism.","examples":[{"sentence":"Positivism emphasizes empirical observation and scientific methods.","translation":"実証主義は、経験的な観察と科学的方法を重視する。"},{"sentence":"Auguste Comte is considered the founder of positivism.","translation":"オーギュスト・コントは実証主義の創始者とみなされている。"},{"sentence":"Logical positivism was a significant movement in 20th-century philosophy.","translation":"論理実証主義は、20世紀の哲学における重要な運動であった。"}],"collocations":["logical positivism (論理実証主義)","scientific positivism (科学的実証主義)","social positivism (社会実証主義)","Comte's positivism (コントの実証主義)","empirical positivism (経験的実証主義)"],"synonyms":["empiricism","scientism","verificationism"],"antonyms":["metaphysics","idealism","theology"]}],"etymology":{"value":"Derived from the French word 'positivisme', coined by Auguste Comte in the 19th century. 'Positif' means 'positive' in French, referring to something that is real, factual, and verifiable through observation and experimentation.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɒzɪtɪvɪzəm/","syllables":"po-sit-i-vi-sm"},"inflection":{"notes":"Uncountable noun (不可算名詞)"},"usage_notes":{"explanation":"Positivism is a philosophical approach that asserts that genuine knowledge is based only on experience and observable phenomena. It rejects speculation and metaphysical arguments, emphasizing the importance of scientific methods for understanding the world. It is often associated with the belief that society can be studied using the same scientific methods as the natural sciences.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a positivism.","correct":"✓ He is a positivist.","note":"'Positivism' is the philosophical system, while 'positivist' is a person who adheres to positivism."},{"incorrect":"✗ Positivism is about positive thinking.","correct":"✓ Positivism is about empirical evidence and scientific verification.","note":"Positivism is not simply about having a positive attitude; it's a specific philosophical approach."}],"priority":"★★☆"},"related_words":{"derivatives":["positivist (名詞: 実証主義者, 形容詞: 実証主義の)","positive (形容詞: 肯定的な, 実証的な)","positively (副詞: 肯定的に, 確実に)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency (比較的低頻度) - Primarily used in academic and philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Positivism' is a term primarily used in philosophy and social sciences. It refers to a system of thought that relies on empirical evidence and scientific methods to gain knowledge. It rejects metaphysical speculation and focuses on what can be observed and verified. Understanding this term requires familiarity with philosophical concepts and academic discourse.","priority":"★★★"},"example_sentences":[{"sentence":"The core tenet of **positivism** is that knowledge should be based on observable facts.","translation":"実証主義の中核となる教義は、知識は観察可能な事実に基づいていなければならないということである。","type":"noun","meaning_category":"philosophical system"},{"sentence":"Critics of **positivism** argue that it oversimplifies the complexities of human experience.","translation":"実証主義の批判者たちは、それが人間の経験の複雑さを単純化しすぎていると主張する。","type":"noun","meaning_category":"philosophical system"},{"sentence":"Early sociologists adopted **positivism** to study social phenomena scientifically.","translation":"初期の社会学者たちは、社会現象を科学的に研究するために実証主義を採用した。","type":"noun","meaning_category":"philosophical system"}]}