{"word":"Otocrane","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A fictional mechanical crane resembling an ear, often used in science fiction or fantasy settings.","english_definition":"A fictional mechanical crane resembling an ear, often used in science fiction or fantasy settings.","examples":[{"sentence":"The steampunk city was filled with Otocranes, their delicate arms lifting cargo with surprising precision.","translation":"そのスチームパンク都市はオトクレーンで溢れており、その繊細なアームは驚くほどの精度で貨物を持ち上げていた。"},{"sentence":"The artist designed an Otocrane as a whimsical addition to the robot's anatomy.","translation":"アーティストは、ロボットの解剖学的構造への気まぐれな追加としてオトクレーンを設計した。"}],"collocations":["steampunk Otocrane","robotic Otocrane","miniature Otocrane","giant Otocrane"],"synonyms":["ear-crane","aural crane","mechanical ear crane"],"antonyms":[]}],"etymology":{"value":"A portmanteau of 'oto-' (prefix relating to the ear) and 'crane' (a lifting machine).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈoʊtoʊˌkreɪn/","syllables":"O-to-crane"},"inflection":{"noun_plural":"Otocranes"},"usage_notes":{"explanation":"'Otocrane' is a neologism, primarily found in imaginative fiction. Its usage is limited to contexts where a mechanical or fantastical ear-like crane is relevant. It is not a standard English word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The otocrane was used for hearing distant sounds.","correct":"✓ The otocrane was used for lifting heavy objects.","note":"An otocrane is a crane, not a hearing device. Its primary function is lifting, not listening."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Neologism)","frequency_google_ngram":"Very low frequency (Neologism)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Otocrane' is a specialized term, likely encountered only in science fiction or fantasy literature. Understanding requires familiarity with both the concept of a crane and the 'oto-' prefix. Due to its niche usage, it is not part of standard English vocabulary. "},"example_sentences":[{"sentence":"The inventor proudly displayed his latest creation: a miniature Otocrane capable of assembling microchips.","translation":"発明者は、マイクロチップを組み立てることができるミニチュアオトクレーンである彼の最新の創造物を誇らしげに展示した。","type":"noun","meaning_category":"fictional mechanical crane"},{"sentence":"High above the dieselpunk city, a network of Otocranes hummed, tirelessly moving goods between the towering skyscrapers.","translation":"ディーゼルパンク都市の上空高く、オトクレーンのネットワークがうなり声を上げ、そびえ立つ高層ビル間で絶え間なく商品を移動させていた。","type":"noun","meaning_category":"fictional mechanical crane"}]}