{"word":"sublimationist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"昇華主義者、昇華論者","english_definition":"One who advocates or practices sublimation, especially in the Freudian sense of redirecting base impulses into socially acceptable activities.","examples":[{"sentence":"The sublimationist believed that art could transform destructive urges into creative expression.","translation":"その昇華主義者は、芸術が破壊的な衝動を創造的な表現に変えることができると信じていた。"}],"collocations":["Freudian sublimationist","artistic sublimationist"],"synonyms":["idealist","transcendentalist"],"antonyms":["realist","pragmatist"]},{"part_of_speech":"adjective","definition":"昇華主義の、昇華論的な","english_definition":"Relating to or characterized by sublimation, particularly in the psychological sense.","examples":[{"sentence":"The sublimationist approach to therapy focused on channeling negative emotions into positive actions.","translation":"昇華主義的なセラピーのアプローチは、否定的な感情を肯定的な行動へと向けることに焦点を当てていた。"}],"collocations":["sublimationist theory","sublimationist art"],"synonyms":["idealistic","transcendental"],"antonyms":["realistic","pragmatic"]}],"etymology":{"value":"From 'sublimation' (the psychological process of redirecting unacceptable impulses into socially acceptable actions) + '-ist' (a suffix denoting a person who believes in or practices something).","priority":"★★☆"},"pronunciation":{"ipa":"/sʌˈblɪmeɪʃənɪst/","syllables":"sub-li-ma-tion-ist"},"inflection":{"noun_plural":"sublimationists"},"usage_notes":{"explanation":"The term 'sublimationist' is primarily used in the context of Freudian psychology, referring to someone who believes in or practices sublimation as a defense mechanism or a therapeutic approach. It can also be used more broadly to describe someone who believes in transforming base or negative impulses into something higher or more refined.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a sublimationist of water into ice.","correct":"✓ He studies the sublimation of ice.","note":"'Sublimationist' refers to a person who believes in or practices sublimation, not the process itself. The correct term for the process is 'sublimation'."}],"priority":"★★☆"},"related_words":{"derivatives":["sublimation (noun)","sublimate (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sublimationist' is a specialized term primarily used in psychology, particularly in the context of Freudian theory. It refers to someone who believes in or practices sublimation, which is the process of redirecting unacceptable impulses or desires into socially acceptable activities. Therefore, understanding of psychological concepts is required to comprehend this word. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"As a committed sublimationist, she channeled her anger into writing powerful poetry.","translation":"熱心な昇華主義者として、彼女は怒りを力強い詩を書くことに向けた。","type":"noun","meaning_category":"Person practicing sublimation"},{"sentence":"The therapist adopted a sublimationist approach to help the patient deal with their aggressive tendencies.","translation":"セラピストは、患者が攻撃的な傾向に対処するのを助けるために、昇華主義的なアプローチを採用した。","type":"adjective","meaning_category":"Relating to sublimation"}]}