{"word":"bedesman","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的) 施しを受けて教会のために祈る人、救貧院の居住者","english_definition":"(historical) a person supported by charity who was required to pray for their benefactor, especially an inmate of an almshouse.","examples":[{"sentence":"In return for food and lodging, the bedesman was expected to pray for the soul of the founder.","translation":"食べ物と住居の代わりに、ベデスマンは創設者の魂のために祈ることが期待されていた。"},{"sentence":"The old bedesman shuffled slowly to his place in the chapel.","translation":"老いたベデスマンはゆっくりと礼拝堂の自分の場所まで歩いた。"}],"collocations":["old bedesman","poor bedesman"],"synonyms":["almsman","pauper","beadsman"],"antonyms":[],"notes":"The term is archaic and rarely used in modern English."}],"etymology":{"value":"From Middle English 'bedeman', from Old English 'bēdman', equivalent to 'bede' (prayer) + 'man'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbiːdzmən/","syllables":"beeds-man"},"inflection":{"noun_plural":"bedesmen"},"usage_notes":{"explanation":"The term 'bedesman' refers to a historical figure who lived in poverty and was supported by charity, typically residing in an almshouse. In return for this support, the bedesman was obligated to pray for the benefactor or the benefactor's family. The word is now archaic and primarily encountered in historical contexts or literature.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":["bead (関連語源)","beadsman (同義語)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (非常にまれな単語)","frequency_google_ngram":"非常に低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bedesman' is an archaic term referring to a person who lived in poverty and was supported by charity in exchange for praying for their benefactor. This word is rarely used in modern English and is primarily found in historical texts or literature. Understanding this word requires a good grasp of historical and literary contexts."},"example_sentences":[{"sentence":"The aged bedesman knelt in the chapel, his lips moving in silent prayer.","translation":"年老いたベデスマンは礼拝堂でひざまずき、唇を動かして静かに祈った。","type":"noun","meaning_category":"施しを受けて祈る人"},{"sentence":"Sir Walter Scott's novel features a bedesman as a key character.","translation":"ウォルター・スコットの小説には、ベデスマンが重要なキャラクターとして登場する。","type":"noun","meaning_category":"施しを受けて祈る人"}]}