{"word":"TANSTAAFL","priority":"★☆☆","meanings":[{"part_of_speech":"acronym","definition":"There Ain't No Such Thing As A Free Lunch（タダ飯なんてない）","english_definition":"An expression meaning that nothing is truly free; every choice has a cost, even if it's not immediately obvious.","examples":[{"sentence":"The government program seemed generous, but remember TANSTAAFL; someone is paying for it.","translation":"その政府のプログラムは寛大に見えたが、TANSTAAFLを忘れないで。誰かがその代金を払っている。"},{"sentence":"They offered a 'free' consultation, but it was just a way to get you to buy their services; TANSTAAFL.","translation":"彼らは「無料」相談を提供したが、それは単に彼らのサービスを買わせるための手段だった。TANSTAAFLだ。"}],"collocations":["remember TANSTAAFL","TANSTAAFL applies","TANSTAAFL in action"],"synonyms":["Everything has a price","No free ride","You get what you pay for"],"antonyms":["Free lunch","Something for nothing"]}],"etymology":{"value":"Attributed to various economists, including Milton Friedman, and popularized in libertarian circles. The exact origin is debated, but it gained prominence in the mid-20th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtænˌstɑːfəl/","syllables":"tan-staa-fl"},"inflection":{"notes":"Acronym - no inflection"},"usage_notes":{"explanation":"TANSTAAFL is a principle emphasizing that all choices involve costs, whether direct or indirect. It's often used in economics and political discourse to highlight hidden expenses or trade-offs associated with seemingly free goods or services. It serves as a reminder that resources are finite and that every benefit comes at some cost to someone.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ TANSTAAFL means everything is expensive.","correct":"✓ TANSTAAFL means that nothing is truly free; there's always a cost.","note":"TANSTAAFL doesn't simply mean things are expensive, but that there's always a cost, even if it's not monetary."},{"incorrect":"✗ TANSTAAFL only applies to government programs.","correct":"✓ TANSTAAFL applies to all situations where something appears free.","note":"TANSTAAFL is a general principle, not limited to government programs."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in specific economic and political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"TANSTAAFL is an acronym that stands for \"There Ain't No Such Thing As A Free Lunch.\" It's a saying that means nothing is truly free. Even if something is offered for free, there's always a cost involved, whether it's time, resources, or someone else paying for it. This concept is often used in economics and politics to point out that every decision has trade-offs and hidden costs. It's a reminder that resources are limited and that someone always bears the burden, even if it's not immediately obvious."},"example_sentences":[{"sentence":"The 'free' software came bundled with spyware; a clear example of TANSTAAFL.","translation":"「無料」のソフトウェアにはスパイウェアがバンドルされていた。TANSTAAFLの明確な例だ。","type":"example","meaning_category":"General principle"},{"sentence":"Politicians promising 'free' healthcare should be reminded of TANSTAAFL.","translation":"「無料」の医療を約束する政治家には、TANSTAAFLを思い出させるべきだ。","type":"example","meaning_category":"Political context"},{"sentence":"Even using open-source software isn't truly free; there's a cost in time and effort to learn and maintain it, so TANSTAAFL applies.","translation":"オープンソースのソフトウェアを使うことさえ、本当には無料ではない。それを学び、維持するための時間と労力がかかるので、TANSTAAFLが当てはまる。","type":"example","meaning_category":"Economic context"}]}