{"word":"shris","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Hinduism) A title of respect, often used before a person's name, similar to 'Mr.' or 'Ms.' in English. It can also refer to wealth, prosperity, or good fortune.","english_definition":"A title of respect in Hinduism, similar to 'Mr.' or 'Ms.' in English, or referring to wealth, prosperity, or good fortune.","examples":[{"sentence":"Shri Ramakrishna was a famous Indian saint.","translation":"シュリ・ラマクリシュナは有名なインドの聖人でした。"},{"sentence":"The temple is dedicated to Shri Lakshmi, the goddess of wealth.","translation":"その寺院は、富の女神であるシュリ・ラクシュミに捧げられています。"}],"collocations":["Shri + name (人名)","Shri Lakshmi (ラクシュミ)","Shri Ganesh (ガネーシャ)"],"synonyms":["Mr.","Ms.","wealth","prosperity","fortune"],"antonyms":["poverty","misfortune"]}],"etymology":{"value":"Derived from Sanskrit श्री (śrī), meaning 'radiance, beauty, wealth, prosperity, good fortune'.","priority":"★★★"},"pronunciation":{"ipa":"/ʃriː/","syllables":"shri"},"inflection":{"notes":"It is a title, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Shri' is a respectful title used in Hinduism and Indian culture. It's similar to 'Mr.' or 'Ms.' but carries a deeper connotation of respect and auspiciousness. It's often used before the names of deities, revered individuals, or important places. It can also be used more generally to denote wealth or prosperity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a shri yesterday.","correct":"✓ I saw Shri Patel yesterday.","note":"'Shri' should be used as a title before a name, not as a standalone noun."}],"priority":"★★☆"},"related_words":{"derivatives":["Shrimati (married woman)","Sri Lankan (relating to Sri Lanka)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency in general English, but common in contexts related to Hinduism and Indian culture.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shri' is a cultural term primarily used within Hinduism and Indian society as a respectful title. It's important to understand its cultural significance and use it appropriately in relevant contexts. While not commonly used in general English, familiarity with the term is beneficial for understanding discussions related to Indian culture and religion."},"example_sentences":[{"sentence":"We offer our prayers to Shri Krishna.","translation":"私たちはシュリ・クリシュナに祈りを捧げます。","type":"noun","meaning_category":"title"},{"sentence":"The company aims to bring Shri to the lives of its employees.","translation":"その会社は、従業員の生活に繁栄をもたらすことを目指しています。","type":"noun","meaning_category":"prosperity"}]}