{"word":"interpolymer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"インターポリマー、2種類以上の異なるポリマーが化学的に結合した高分子","english_definition":"A polymer composed of two or more different types of polymer chains chemically bonded together.","examples":[{"sentence":"The interpolymer exhibits enhanced properties compared to its constituent homopolymers.","translation":"そのインターポリマーは、構成するホモポリマーと比較して強化された特性を示す。"},{"sentence":"Interpolymers are used in a variety of applications, including adhesives, coatings, and plastics.","translation":"インターポリマーは、接着剤、コーティング、プラスチックなど、さまざまな用途で使用されている。"}],"collocations":["interpolymer blend","interpolymer composite","interpolymer network"],"synonyms":["polymer blend","copolymer","polymer composite"],"antonyms":["homopolymer"]},{"part_of_speech":"adjective","definition":"インターポリマーの、インターポリマーに関する","english_definition":"Relating to or consisting of an interpolymer.","examples":[{"sentence":"The interpolymer material showed improved tensile strength.","translation":"そのインターポリマー材料は、引張強度が向上した。"},{"sentence":"Interpolymer interactions play a crucial role in determining the properties of the material.","translation":"インターポリマーの相互作用は、材料の特性を決定する上で重要な役割を果たす。"}],"collocations":["interpolymer material","interpolymer interactions","interpolymer structure"],"synonyms":["polymeric","copolymeric"],"antonyms":["monomeric"]}],"etymology":{"value":"\"Inter-\" (between) + \"polymer\" (a substance consisting of large molecules).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntərˈpɒlɪmər/","syllables":"in-ter-pol-y-mer"},"inflection":{"noun_plural":"interpolymers"},"usage_notes":{"explanation":"The term \"interpolymer\" is often used interchangeably with \"polymer blend\" or \"copolymer,\" but it specifically refers to a material where different polymer chains are chemically linked. This chemical bonding distinguishes it from simple physical mixtures of polymers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The interpolymer was made of only one monomer.","correct":"✓ The interpolymer was made of two or more different monomers.","note":"Interpolymers, by definition, are made from two or more different types of monomers or polymers."}],"priority":"★★☆"},"related_words":{"derivatives":["interpolymerization"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"interpolymer\" is a technical term used in polymer chemistry and materials science. It refers to a specific type of polymer that is made up of two or more different types of polymer chains that are chemically bonded together. Understanding this term requires a background in chemistry or materials science."},"example_sentences":[{"sentence":"This novel interpolymer is synthesized via a controlled radical polymerization technique.","translation":"この新規なインターポリマーは、制御ラジカル重合技術によって合成される。","type":"noun","meaning_category":"高分子"},{"sentence":"The interpolymer coating provides excellent resistance to corrosion.","translation":"そのインターポリマーコーティングは、優れた耐食性を提供する。","type":"adjective","meaning_category":"インターポリマーの"}]}