{"word":"Controvertibility","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"反駁可能性、議論の余地があること","english_definition":"The quality of being controvertible; the state of being open to argument or dispute.","examples":[{"sentence":"The controvertibility of the scientific theory was debated among experts.","translation":"その科学理論の反駁可能性は専門家の間で議論された。"},{"sentence":"The statement's controvertibility made it difficult to accept as fact.","translation":"その声明の議論の余地があることが、事実として受け入れることを困難にした。"}],"collocations":["high controvertibility","low controvertibility","degree of controvertibility"],"synonyms":["disputability","debatability","questionability","arguability"],"antonyms":["incontrovertibility","indisputability","certainty","factuality"]}],"etymology":{"value":"Derived from 'controvertible,' which comes from the Latin 'controversus,' meaning 'turned against, disputed.' 'Controvertibility' adds the suffix '-ity' to denote a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒntrəˌvɜːrtɪˈbɪləti/","syllables":"con-tro-ver-ti-bi-li-ty"},"inflection":{"noun_plural":"controvertibilities"},"usage_notes":{"explanation":"'Controvertibility' refers to the extent to which a statement, claim, or theory can be disputed or argued against. It is often used in academic, legal, or scientific contexts where the validity of information is being assessed. High controvertibility suggests that there are strong arguments against the idea, while low controvertibility suggests the opposite.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The controvertibility is high because everyone agrees.","correct":"✓ The controvertibility is low because everyone agrees.","note":"High controvertibility means there's much disagreement, while low means there's much agreement."},{"incorrect":"✗ The controvertibility of the proof is clear.","correct":"✓ The validity of the proof is clear.","note":"If something is clear and not disputed, 'validity' or 'certainty' might be more appropriate than 'controvertibility'."}],"priority":"★★☆"},"related_words":{"derivatives":["controvertible (adjective)","controvert (verb)","controversy (noun)","controversial (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Controvertibility' is a complex term used to describe how open something is to dispute or argument. It's often used in formal discussions or academic writing to talk about whether a statement or idea can be easily challenged. If something has high 'controvertibility,' it means there are good reasons to question it. If it has low 'controvertibility,' it means it's hard to argue against. This word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The judge considered the controvertibility of the witness's testimony.","translation":"裁判官は証人の証言の反駁可能性を検討した。","type":"noun","meaning_category":"反駁可能性"},{"sentence":"The degree of controvertibility in the research findings raised concerns.","translation":"研究結果における議論の余地がある程度が懸念を引き起こした。","type":"noun","meaning_category":"議論の余地があること"}]}