{"word":"mountebankly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"山師のように、ペテン師のように、いかさま師のように","english_definition":"In the manner of a mountebank; like a charlatan or quack.","examples":[{"sentence":"He mountebankly promoted the product, making false claims and exaggerating its benefits.","translation":"彼はその製品を山師のように宣伝し、虚偽の主張をしてその利点を誇張した。"},{"sentence":"The politician spoke mountebankly, promising unrealistic changes to win votes.","translation":"その政治家は山師のように話し、票を獲得するために非現実的な変化を約束した。"}],"collocations":["promote something mountebankly (何かを山師のように宣伝する)","speak mountebankly (山師のように話す)","act mountebankly (山師のように振る舞う)"],"synonyms":["charlatanically","deceptively","fraudulently","quackishly","dishonestly"],"antonyms":["honestly","sincerely","genuinely","truthfully"]}],"etymology":{"value":"The word is derived from \"mountebank\" (a charlatan or quack), with the addition of the suffix \"-ly\" to form an adverb. \"Mountebank\" itself comes from the Italian \"montimbanco,\" literally meaning \"one who mounts a bench,\" referring to the platforms used by these individuals to hawk their wares or perform.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmaʊntɪˌbæŋkli/","syllables":"moun-te-bank-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Mountebankly\" is an adverb that describes actions or behaviors characteristic of a mountebank. It implies deception, exaggeration, and a lack of genuine expertise or sincerity. The word is relatively rare and often used in formal or literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted mountebankly, but he was actually a skilled doctor.","correct":"✓ He acted mountebankly, but his actions were deceptive.","note":"The word implies deception, so it's contradictory to say someone acted mountebankly but was actually skilled or genuine."}],"priority":"★☆☆"},"related_words":{"derivatives":["mountebank (noun: 山師、ペテン師)","mountebankery (noun: 山師行為、詐欺行為)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"mountebankly\" is a sophisticated term used to describe actions that are deceitful or fraudulent, similar to those of a charlatan. It's not commonly used in everyday conversation and is more likely to appear in formal writing or historical contexts. Understanding the root word \"mountebank\" is essential to grasping the meaning of \"mountebankly.\"","priority":"★☆☆"},"example_sentences":[{"sentence":"The salesman mountebankly advertised the product as a miracle cure.","translation":"そのセールスマンはその製品を奇跡の治療薬として山師のように宣伝した。","type":"adverb","meaning_category":"deceptive promotion"},{"sentence":"The con artist mountebankly convinced people to invest in his fake company.","translation":"その詐欺師は山師のように人々を説得して、彼の偽の会社に投資させた。","type":"adverb","meaning_category":"fraudulent persuasion"}]}