{"word":"cawl","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ウェールズの)スープ、シチュー","english_definition":"A Welsh soup or stew, traditionally made with meat and vegetables.","examples":[{"sentence":"My grandmother always made a hearty cawl in the winter.","translation":"私の祖母はいつも冬に心温まるカウルを作ってくれた。"},{"sentence":"Cawl is considered a national dish of Wales.","translation":"カウルはウェールズの国民料理とみなされている。"}],"collocations":["traditional cawl","hearty cawl","Welsh cawl"],"synonyms":["soup","stew","broth"],"antonyms":[]}],"etymology":{"value":"From Welsh *cawl*, meaning broth or soup.","priority":"★★☆"},"pronunciation":{"ipa":"/kaʊl/","syllables":"cawl"},"inflection":{"noun_plural":"cawls"},"usage_notes":{"explanation":"Cawl is a traditional Welsh soup or stew, typically made with meat (often lamb or beef) and vegetables such as leeks, potatoes, carrots, and swedes. Recipes vary from region to region and family to family. It's considered a staple dish in Welsh cuisine, especially during the colder months.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I had a bowl of cole for lunch.","correct":"✓ I had a bowl of cawl for lunch.","note":"'Cole' is not a Welsh soup; it's 'cawl.'"},{"incorrect":"✗ Cawl is made with cabbage.","correct":"✓ Cawl is often made with leeks, carrots, and potatoes.","note":"While variations exist, cabbage is not a typical ingredient in traditional cawl."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cawl' refers to a specific type of Welsh soup or stew. It's a cultural food term, so understanding requires familiarity with Welsh cuisine. The word is not commonly used outside of contexts discussing Welsh food or culture.","priority":"★☆☆"},"example_sentences":[{"sentence":"She prepared a pot of cawl using her family's secret recipe.","translation":"彼女は家族の秘伝のレシピを使ってカウルの鍋を準備した。","type":"noun","meaning_category":"soup/stew"},{"sentence":"The aroma of cawl filled the kitchen, promising a warm and comforting meal.","translation":"カウルの香りが台所に広がり、温かく心地よい食事を約束した。","type":"noun","meaning_category":"soup/stew"}]}