{"word":"performative","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(言語学で)遂行的、行為遂行的な (発話自体が行為となるような)","english_definition":"(linguistics) (of a verb or utterance) performing or accomplishing an action when spoken.","examples":[{"sentence":"'I promise' is a performative verb because saying it is the act of making a promise.","translation":"「私は約束します」は遂行的動詞です。なぜなら、それを言うこと自体が約束をするという行為だからです。"},{"sentence":"The declaration 'I now pronounce you husband and wife' is a performative utterance.","translation":"「私は今、あなた方を夫婦と宣言します」という宣言は遂行的発話です。"}],"collocations":["performative verb","performative utterance","performative speech act"],"synonyms":["operative","effective","constitutive"],"antonyms":["constative","descriptive"]},{"part_of_speech":"adjective","definition":"(社会学・文化研究で) パフォーマティブな、演技的な、構築的な (社会的なアイデンティティや現実が、繰り返される行為や言説によって構築されることを指す)","english_definition":"(sociology, cultural studies) relating to or characteristic of performativity, the idea that social identities and realities are constructed through repeated actions and discourses.","examples":[{"sentence":"Gender is performative, meaning it is not an inherent quality but rather something we enact through our behaviors.","translation":"ジェンダーはパフォーマティブです。つまり、それは固有の性質ではなく、むしろ私たちの行動を通して演じるものです。"},{"sentence":"The politician's speech was seen as performative, designed to create a certain image rather than express genuine beliefs.","translation":"その政治家の演説はパフォーマティブであると見なされました。それは、真の信念を表現するのではなく、特定のイメージを作り出すように設計されたものでした。"}],"collocations":["performative identity","performative act","performative politics","performative art"],"synonyms":["theatrical","staged","constructed","enacted"],"antonyms":["authentic","genuine","natural"]}],"etymology":{"value":"Derived from 'perform' + '-ative'. The linguistic sense arose from J.L. Austin's work on speech act theory. The sociological sense developed later, influenced by post-structuralist thought, particularly Judith Butler's work on gender.","priority":"★★☆"},"pronunciation":{"ipa":"/pərˈfɔːrmətɪv/","syllables":"per-for-ma-tive"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more performative' and 'most performative'."},"usage_notes":{"explanation":"The word 'performative' has two main uses, one in linguistics and one in sociology/cultural studies. In linguistics, it describes utterances that perform an action simply by being spoken (e.g., promising, declaring). In sociology, it describes how identities and social realities are constructed through repeated actions and discourses. Be aware of the context to understand which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The play was very performative. (when meaning 'well-acted')","correct":"✓ The play was very well-performed. / ✓ The actors were very performative. (in the sociological sense, meaning the acting was deliberately stylized or artificial)","note":"'Performative' in the sociological sense doesn't simply mean 'well-acted'. It implies a deliberate construction of identity or reality through action. Use 'well-performed' to describe the quality of acting. If you mean the acting was deliberately stylized or artificial to create a certain image, then 'performative' might be appropriate."},{"incorrect":"✗ He made a performative promise.","correct":"✓ He made a promise. / ✓ He uttered a performative.","note":"All promises are performative in the linguistic sense, so saying 'performative promise' is redundant. You can say 'He uttered a performative' to refer to an utterance that performs an action."}],"priority":"★★☆"},"related_words":{"derivatives":["performativity (noun): the quality or state of being performative","perform (verb): to carry out, accomplish, or fulfill an action","performance (noun): the act of performing; a public presentation or exhibition"],"related_terms":["speech act theory","gender performativity","social constructionism","discourse analysis"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Performative' is a technical term used in linguistics and social sciences. In linguistics, it refers to utterances that perform an action simply by being said (e.g., 'I apologize'). In social sciences, it refers to the idea that identities and social realities are constructed through repeated actions and discourses. Understanding this word requires familiarity with these theoretical frameworks. It's not a word used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The marriage vow is a classic example of a **performative** utterance.","translation":"結婚の誓いは、遂行的発話の典型的な例です。","type":"adjective","meaning_category":"linguistics"},{"sentence":"Butler argues that gender is not a fixed identity but a **performative** construct.","translation":"バトラーは、ジェンダーは固定されたアイデンティティではなく、パフォーマティブな構築物であると主張しています。","type":"adjective","meaning_category":"sociology"},{"sentence":"His apology seemed insincere and **performative**, as if he were just going through the motions.","translation":"彼の謝罪は、まるで形式的なものに過ぎないかのように、不誠実でパフォーマティブに思えた。","type":"adjective","meaning_category":"sociology (implying insincerity)"}]}