{"word":"knavishness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不正行為、悪党根性、不誠実さ","english_definition":"the quality or state of being like a knave; dishonesty or trickery.","examples":[{"sentence":"His knavishness was evident in his constant attempts to deceive others.","translation":"彼の不正行為は、他人を欺こうとする絶え間ない試みに明らかだった。"},{"sentence":"The company's downfall was due to the knavishness of its executives.","translation":"会社の没落は、経営幹部の悪党根性に起因していた。"},{"sentence":"She was shocked by the knavishness displayed in the political campaign.","translation":"彼女は、政治キャンペーンで示された不誠実さに衝撃を受けた。"}],"collocations":["display knavishness (不正行為を示す)","reveal knavishness (悪党根性を明らかにする)","the knavishness of (～の不正行為)"],"synonyms":["dishonesty","trickery","deceitfulness","villainy","rascality","roguery","unscrupulousness"],"antonyms":["honesty","integrity","uprightness","fairness","sincerity"]}],"etymology":{"value":"\"Knavishness\" is derived from \"knavish,\" which means resembling or characteristic of a knave. \"Knave\" comes from the Old English word \"cnafa,\" originally meaning a boy or servant, but later evolving to mean a dishonest or unscrupulous person. The suffix \"-ness\" is added to form the noun, indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈneɪvɪʃnəs/","syllables":"kna-vish-ness"},"inflection":{"noun_plural":"N/A (uncountable noun)"},"usage_notes":{"explanation":"\"Knavishness\" is a noun that describes the quality or state of being dishonest, deceitful, or unscrupulous. It is typically used to describe actions or behaviors that are morally wrong and intended to deceive or exploit others. The word often carries a strong negative connotation, implying a lack of integrity and a willingness to engage in unethical practices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of knavish.","correct":"✓ He showed a lot of knavishness.","note":"\"Knavish\" is an adjective, while \"knavishness\" is the noun form. Use the noun form to describe the quality or state of being dishonest."},{"incorrect":"✗ The knavishness person stole the money.","correct":"✓ The knavish person stole the money. / ✓ The knave stole the money.","note":"\"Knavishness\" is a quality; \"knavish\" is an adjective describing a person, or \"knave\" is the noun for a dishonest person."}],"priority":"★★☆"},"related_words":{"derivatives":["knave (noun: a dishonest or unscrupulous man)","knavish (adjective: resembling or characteristic of a knave)","knavishly (adverb: in a knavish manner)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"knavishness\" is a relatively uncommon and sophisticated term that describes the quality of being dishonest or deceitful. It is used to characterize actions or behaviors that are morally wrong and intended to exploit or deceive others. Understanding this word requires a good grasp of vocabulary and an ability to recognize subtle nuances in meaning. It is more likely to be encountered in formal writing or literature than in everyday conversation."},"example_sentences":[{"sentence":"The politician's knavishness was exposed by the investigative journalist.","translation":"政治家の不正行為は、調査ジャーナリストによって暴露された。","type":"general","meaning_category":"不正行為"},{"sentence":"The company's success was built on a foundation of knavishness and exploitation.","translation":"会社の成功は、不正行為と搾取の上に築かれた。","type":"general","meaning_category":"不誠実さ"},{"sentence":"The detective was determined to uncover the knavishness behind the seemingly legitimate business.","translation":"刑事は、一見正当に見えるビジネスの背後にある不正行為を暴こうと決意した。","type":"general","meaning_category":"悪党根性"}]}