{"word":"pycnosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(細胞核の)濃縮","english_definition":"the irreversible condensation of chromatin in the nucleus of a cell undergoing necrosis or apoptosis.","examples":[{"sentence":"Pycnosis is a characteristic feature of apoptosis.","translation":"濃縮はアポトーシスの特徴的な特徴です。"},{"sentence":"The pathologist observed pycnosis in the tissue sample.","translation":"病理医は組織サンプルにおいて濃縮を観察した。"}],"collocations":["nuclear pycnosis (核濃縮)"],"synonyms":["karyopyknosis","nuclear condensation"],"antonyms":[]}],"etymology":{"value":"Derived from Greek πυκνός (pyknos) meaning \"thick, dense\".","priority":"★★☆"},"pronunciation":{"ipa":"/pɪkˈnoʊsɪs/","syllables":"pic-no-sis"},"inflection":{"noun_plural":"pyknoses"},"usage_notes":{"explanation":"Pycnosis is a morphological change indicating cell death, specifically referring to the irreversible condensation of chromatin in the nucleus. It is a key feature in both apoptosis (programmed cell death) and necrosis (uncontrolled cell death).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell showed signs of pyknosis, indicating it was healthy.","correct":"✓ The cell showed signs of pyknosis, indicating it was dying.","note":"Pycnosis is a sign of cell death, not health."}],"priority":"★★☆"},"related_words":{"derivatives":["pyknotic (adjective)"],"related_terms":["apoptosis","necrosis","karyorrhexis","karyolysis"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pycnosis' is a technical term used in biology and medicine, specifically in the fields of pathology and cell biology. It refers to a specific morphological change in the nucleus of a dying cell. Understanding this term requires a background in cell biology or medicine."},"example_sentences":[{"sentence":"The presence of pycnosis confirmed that the cells were undergoing apoptosis.","translation":"濃縮の存在は、細胞がアポトーシスを起こしていることを確認した。","type":"scientific","meaning_category":"cell death"},{"sentence":"The degree of pycnosis varied among the different cell types in the sample.","translation":"濃縮の程度は、サンプル中の異なる細胞型の間で異なっていた。","type":"scientific","meaning_category":"cell morphology"}]}