{"word":"subsidiariamente","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"補助的に、代替的に、予備的に","english_definition":"subsidiarily; alternatively; in a subsidiary or secondary manner; as a backup or alternative.","examples":[{"sentence":"O plano B foi preparado subsidiariamente, caso o plano principal falhasse.","translation":"Plan B was prepared subsidiarily, in case the main plan failed.","note":"(Plan Bは、メインの計画が失敗した場合に備えて、補助的に準備されました。)"},{"sentence":"Subsidiariamente, pode-se usar este método se o primeiro não funcionar.","translation":"Alternatively, you can use this method if the first one doesn't work.","note":"(代替案として、最初の方法がうまくいかない場合は、この方法を使用できます。)"},{"sentence":"A empresa possui uma fonte de energia subsidiariamente para emergências.","translation":"The company has a power source subsidiarily for emergencies.","note":"(会社は緊急時に備えて、補助的な電源を持っています。)"}],"collocations":["agir subsidiariamente (act subsidiarily)","usar subsidiariamente (use subsidiarily)","aplicar subsidiariamente (apply subsidiarily)"],"synonyms":["alternativamente","supletivamente","adicionalmente","secundariamente","complementarmente"],"antonyms":["principalmente","primariamente","diretamente"]}],"etymology":{"value":"Derivado do latim 'subsidiarius', que significa 'que serve de auxílio, reserva'.","priority":"★★☆"},"pronunciation":{"ipa":"/supsiˈdjaɾjamente/","syllables":"sub-si-di-a-ria-men-te"},"inflection":{"notes":"Adverbio (adverb)"},"usage_notes":{"explanation":"'Subsidiariamente' é usado para indicar que algo é feito ou usado como um apoio, uma alternativa, ou um recurso secundário, caso a opção principal não esteja disponível ou não seja bem-sucedida. É comum em contextos legais, administrativos e de planejamento.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Ele subsidiariamente foi o culpado.","correct":"Ele foi considerado subsidiariamente responsável.","note":"O uso correto geralmente envolve a ação ou responsabilidade sendo subsidiária, não a pessoa diretamente."},{"incorrect":"Subsidiariamente, eu gosto de café.","correct":"Adicionalmente, eu gosto de café.","note":"'Subsidiariamente' implica uma relação de dependência ou alternativa, não apenas uma adição."}],"priority":"★★☆"},"related_words":{"derivatives":["subsidiário (adjetivo/substantivo)","subsídio (substantivo)"],"phrases":["responsabilidade subsidiária"],"priority":"★★☆"},"level_frequency":{"priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A palavra 'subsidiariamente' é usada em contextos formais para indicar que algo é feito como uma alternativa ou apoio secundário. Ela implica que existe uma opção principal, e que a ação subsidiária só é tomada se a principal não for possível ou bem-sucedida. É um termo comum em áreas como direito e administração."},"example_sentences":[{"sentence":"A lei será aplicada subsidiariamente, caso não haja legislação específica sobre o assunto.","translation":"The law will be applied subsidiarily if there is no specific legislation on the matter.","type":"general","meaning_category":"alternative application"},{"sentence":"Subsidiariamente, o réu pediu a redução da pena.","translation":"Alternatively, the defendant requested a reduction of the sentence.","type":"legal","meaning_category":"legal context"},{"sentence":"O gerador será usado subsidiariamente em caso de falha de energia.","translation":"The generator will be used subsidiarily in case of power failure.","type":"technical","meaning_category":"technical context"}]}