{"word":"Underriding","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(保険)保険料を不当に低く設定すること。","english_definition":"The practice of setting insurance premiums too low to cover expected losses and expenses.","examples":[{"sentence":"Underriding can lead to financial instability for insurance companies.","translation":"アンダーライディングは、保険会社の財政不安定につながる可能性があります。"},{"sentence":"The company was accused of underriding to gain market share.","translation":"その会社は、市場シェアを獲得するためにアンダーライディングを行っていると非難されました。"}],"collocations":["Engage in underriding","Accused of underriding","Risk of underriding"],"synonyms":["Price cutting","Underpricing"],"antonyms":["Overpricing","Charging adequate premiums"]},{"part_of_speech":"verb","definition":"(保険)保険料を不当に低く設定する。","english_definition":"To set insurance premiums too low to cover expected losses and expenses.","examples":[{"sentence":"The insurer underrided policies in an attempt to attract more customers.","translation":"その保険会社は、より多くの顧客を引き付けるために、保険料を不当に低く設定しました。"}],"collocations":["Underride policies","Underride premiums"],"synonyms":["Underprice"],"antonyms":["Overprice"]}],"etymology":{"value":"The term 'underriding' is derived from the idea of setting insurance rates that are 'under' the level needed to cover the risks.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌʌndəˈraɪdɪŋ/","syllables":"un-der-ri-ding"},"inflection":{"verb_forms":{"present_participle":"underriding","past_simple":"underrided","past_participle":"underrided"}},"usage_notes":{"explanation":"'Underriding' is primarily used in the context of insurance. It refers to the practice of setting premiums at a level that is insufficient to cover the anticipated costs of claims and operating expenses. This can be a risky strategy, as it may lead to financial losses for the insurer if claims are higher than expected.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is underriding the market with high prices.","correct":"✓ The company is underriding the market with low prices.","note":"Underriding involves setting prices *lower* than what is sustainable, not higher."}],"priority":"★☆☆"},"related_words":{"derivatives":["Underwriter","Underwriting"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Underriding' is a specialized term primarily used within the insurance industry. It describes the practice of setting insurance premiums at a level that is too low to adequately cover the expected costs of claims and operational expenses. This can be a deliberate strategy to gain market share, but it carries significant financial risks for the insurer if claims exceed the underpriced premiums. Understanding this term requires familiarity with insurance principles and risk management."},"example_sentences":[{"sentence":"The practice of **underriding** can jeopardize an insurance company's solvency.","translation":"アンダーライディングの慣行は、保険会社の支払い能力を危うくする可能性があります。","type":"noun","meaning_category":"Insurance"},{"sentence":"By **underriding** their competitors, they quickly gained a larger customer base.","translation":"競合他社よりも低い保険料を設定することで、彼らはすぐに大きな顧客基盤を獲得しました。","type":"verb","meaning_category":"Insurance"}]}