{"word":"birefringence","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"複屈折","english_definition":"The optical property of a material having a refractive index that depends on the polarization and propagation direction of light.","examples":[{"sentence":"Birefringence is observed in many crystalline materials.","translation":"複屈折は多くの結晶性物質で観察される。"},{"sentence":"The birefringence of the mineral was measured using a polarizing microscope.","translation":"その鉱物の複屈折は偏光顕微鏡を用いて測定された。"}],"collocations":["exhibit birefringence","measure birefringence","stress-induced birefringence"],"synonyms":["double refraction"],"antonyms":["isotropy (in optics)"]},{"part_of_speech":"noun","definition":"（複屈折性の）複屈折率","english_definition":"The numerical difference between the largest and smallest refractive indices of a birefringent material.","examples":[{"sentence":"The birefringence value is crucial for identifying the material.","translation":"複屈折率の値は、その物質を特定するために重要である。"},{"sentence":"High birefringence materials are used in certain optical devices.","translation":"高い複屈折率を持つ材料は、特定の光学デバイスで使用される。"}],"collocations":["high birefringence","low birefringence","birefringence value"],"synonyms":["refractive index difference"],"antonyms":[]}],"etymology":{"value":"Derived from 'bi-' (meaning two) + 'refringence' (referring to refraction). The term reflects the fact that light is refracted in two different directions within the material.","priority":"★★★"},"pronunciation":{"ipa":"/ˌbaɪrɪˈfrɪndʒəns/","syllables":"bi-re-frin-gence"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Birefringence' is primarily used in the context of optics, materials science, and mineralogy. It describes how certain materials split a beam of light into two beams, each traveling at a different speed and with a different refractive index. This property is useful for identifying materials and in various optical technologies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The material has a high refractive.","correct":"✓ The material has a high birefringence.","note":"'Refractive' is an adjective, while 'birefringence' is the noun describing the property."},{"incorrect":"✗ Birefringence is when light bends.","correct":"✓ Birefringence is when light splits into two beams with different refractive indices.","note":"Birefringence is more than just bending; it's the splitting of light into two beams."}],"priority":"★★☆"},"related_words":{"derivatives":["birefringent (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Birefringence' is a technical term primarily used in scientific contexts, particularly in physics, materials science, and geology. Understanding it requires familiarity with concepts like refractive index, polarization, and anisotropic materials. It's not typically encountered in general English usage."},"example_sentences":[{"sentence":"Calcite crystals are well-known for their strong **birefringence**.","translation":"方解石の結晶は、その強い複屈折でよく知られている。","type":"noun","meaning_category":"複屈折"},{"sentence":"Stress in the plastic caused **birefringence**, which could be observed under polarized light.","translation":"プラスチック内の応力が複屈折を引き起こし、偏光下で観察できた。","type":"noun","meaning_category":"複屈折"},{"sentence":"The **birefringence** of the sample was measured to determine its composition.","translation":"試料の複屈折を測定して、その組成を決定した。","type":"noun","meaning_category":"複屈折"}]}