{"word":"blacktongue","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(獣医)犬のペラグラ、犬のナイアシン欠乏症","english_definition":"(veterinary medicine) A disease of dogs caused by a deficiency of niacin, characterized by inflammation and ulceration of the tongue and mouth, and diarrhea.","examples":[{"sentence":"Blacktongue is a serious concern for dogs fed a poor diet.","translation":"黒舌病は、粗末な食事を与えられた犬にとって深刻な懸念事項です。"}],"collocations":["contract blacktongue","diagnose blacktongue","treat blacktongue"],"synonyms":["canine pellagra","niacin deficiency in dogs"],"antonyms":[]},{"part_of_speech":"noun","definition":"(俗語、侮辱的)悪口を言う人、中傷者","english_definition":"(slang, derogatory) A person who speaks maliciously or slanderously.","examples":[{"sentence":"Don't listen to him, he's just a blacktongue trying to ruin your reputation.","translation":"彼に耳を傾けないで、彼はただあなたの評判を台無しにしようとしている悪口屋です。"}],"collocations":["a venomous blacktongue","a malicious blacktongue"],"synonyms":["slanderer","libeler","backbiter","gossipmonger"],"antonyms":["supporter","defender"]}],"etymology":{"value":"'Black' + 'tongue'. The veterinary term refers to the dark appearance of the tongue in affected dogs. The slang term likely derives from the idea of a tongue that spreads black (evil) words.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈblæktʌŋ/","syllables":"black-tongue"},"inflection":{"noun_plural":"blacktongues"},"usage_notes":{"explanation":"The term 'blacktongue' has two distinct meanings. The primary meaning is a veterinary term referring to a specific disease in dogs. The secondary meaning is a derogatory slang term for someone who speaks ill of others. Context is crucial to understanding the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was diagnosed with blacktongue. (referring to a person)","correct":"✓ He was accused of being a blacktongue.","note":"When referring to a person who speaks maliciously, use the term as an accusation or description, not as a diagnosis."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["pellagra","niacin","deficiency","slander","libel"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'blacktongue' has two distinct meanings, one technical and one slang. The technical meaning refers to a specific veterinary condition in dogs. The slang meaning is a derogatory term for someone who speaks maliciously. Understanding the context is essential to interpreting the intended meaning. Due to its dual nature and potential for misinterpretation, use this word with caution."},"example_sentences":[{"sentence":"The vet confirmed the dog had blacktongue.","translation":"獣医は犬が黒舌病にかかっていることを確認しました。","type":"noun","meaning_category":"veterinary disease"},{"sentence":"He's nothing but a blacktongue, spreading lies about everyone.","translation":"彼はただの悪口屋で、みんなについて嘘を広めているだけだ。","type":"noun","meaning_category":"slanderer"}]}