{"word":"malandrous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(archaic) Lacking possessions; needy; indigent.","english_definition":"(archaic) Lacking possessions; needy; indigent.","examples":[{"sentence":"The malandrous beggar pleaded for a coin.","translation":"その貧しい物乞いは硬貨を懇願した。"},{"sentence":"In those days, many were malandrous and without hope.","translation":"当時、多くの人々は貧困にあえぎ、希望を失っていた。"}],"collocations":["malandrous beggar","malandrous state"],"synonyms":["needy","indigent","poverty-stricken","destitute","impecunious"],"antonyms":["wealthy","affluent","prosperous","rich"]},{"part_of_speech":"adjective","definition":"(archaic) Poor in quality; inferior; worthless.","english_definition":"(archaic) Poor in quality; inferior; worthless.","examples":[{"sentence":"The malandrous goods were quickly discarded.","translation":"その粗悪品はすぐに廃棄された。"},{"sentence":"He offered a malandrous excuse for his tardiness.","translation":"彼は遅刻の言い訳として、取るに足らない弁解をした。"}],"collocations":["malandrous goods","malandrous excuse"],"synonyms":["inferior","worthless","shoddy","poor","cheap"],"antonyms":["superior","excellent","valuable","high-quality"]}],"etymology":{"value":"Derived from Middle English, possibly related to 'malandre,' referring to a skin disease in horses, suggesting a state of being 'unhealthy' or 'deficient.' The etymology is somewhat uncertain.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈlændrəs/","syllables":"ma-lan-drous"},"inflection":{"notes":"Comparative and superlative forms (more malandrous, most malandrous) are possible but rare due to the word's archaicity."},"usage_notes":{"explanation":"'Malandrous' is an archaic word, rarely used in modern English. It primarily describes a state of poverty or a lack of quality. When referring to people, it means lacking possessions and being in need. When referring to objects or excuses, it means being of poor quality or worthless. Due to its rarity, it's best to use more common synonyms in contemporary writing and speech.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The malandrous king ruled his country poorly.","correct":"✓ The impoverished king ruled his country poorly.","note":"'Malandrous' describes a state of lacking possessions, not necessarily a lack of skill or moral character. 'Impoverished' is a more suitable replacement in this context."},{"incorrect":"✗ She felt malandrous after losing the competition.","correct":"✓ She felt dejected after losing the competition.","note":"'Malandrous' describes a state of poverty or poor quality, not an emotional state. 'Dejected' or 'disheartened' would be more appropriate to describe her feelings."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["malady (related in root, meaning a disease or ailment)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency - an archaic word.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Malandrous' is a very rare and archaic word, not typically encountered in modern English. It is best understood as a historical term used to describe someone lacking possessions or something of poor quality. Due to its obscurity, it is not recommended for general use. Understanding its meaning is primarily useful for interpreting older texts."},"example_sentences":[{"sentence":"The malandrous travelers were grateful for the offered shelter.","translation":"その貧しい旅行者たちは、提供された避難場所に感謝した。","type":"adjective","meaning_category":"Lacking possessions"},{"sentence":"The malandrous craftsmanship was evident in the poorly constructed building.","translation":"その粗末な職人技は、ずさんな建物の構造に明らかだった。","type":"adjective","meaning_category":"Poor quality"}]}