{"word":"overretention","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"過剰保持、過剰貯留","english_definition":"The excessive retention or holding back of something, especially fluid or information.","examples":[{"sentence":"Overretention of fluid can lead to edema.","translation":"体液の過剰貯留は浮腫につながる可能性があります。"},{"sentence":"The company suffered from overretention of outdated inventory.","translation":"その会社は時代遅れの在庫の過剰保持に苦しんだ。"},{"sentence":"Overretention of information without proper processing can hinder learning.","translation":"適切な処理を伴わない情報の過剰保持は学習を妨げる可能性があります。"}],"collocations":["fluid overretention (体液過剰貯留)","inventory overretention (在庫過剰保持)","information overretention (情報過剰保持)"],"synonyms":["excessive retention","excess retention","overaccumulation","overstorage"],"antonyms":["underretention","insufficient retention","loss","release"]}],"etymology":{"value":"\"Over-\" (超過) + \"retention\" (保持)","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərɪˈtɛnʃən/","syllables":"o-ver-re-ten-tion"},"inflection":{"noun_plural":"overretentions"},"usage_notes":{"explanation":"\"Overretention\" refers to a state where something is retained or held back to an excessive degree. This can apply to physical substances like fluids in the body, or abstract concepts like information or inventory. The term often implies a negative consequence resulting from the excess.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The overretention was caused by too much drinking water.","correct":"✓ The fluid overretention was caused by drinking too much water.","note":"Specify what is being overretained (e.g., fluid, information)."},{"incorrect":"✗ Overretention is good for memory.","correct":"✓ Overretention of irrelevant information can be detrimental to memory.","note":"Overretention is generally viewed negatively, especially when it involves irrelevant or outdated material. Clarify the context."}],"priority":"★★☆"},"related_words":{"derivatives":["overretain (verb)"],"related_terms":["retention","underretention","accumulation","storage"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Overretention\" is a relatively uncommon term that describes the state of retaining something to an excessive degree. It's often used in technical or specialized contexts, such as medicine (fluid overretention) or business (inventory overretention). The word implies that the excessive retention is undesirable or problematic. Because of its specialized usage, it's more likely to be encountered in academic or professional reading materials.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient's edema was a clear sign of fluid overretention.","translation":"患者の浮腫は体液過剰貯留の明らかな兆候でした。","type":"general","meaning_category":"体液"},{"sentence":"The museum's overretention of artifacts led to storage issues.","translation":"博物館の工芸品の過剰保持は保管問題につながった。","type":"general","meaning_category":"在庫・物品"},{"sentence":"Overretention of details can sometimes obscure the main point.","translation":"細部の過剰保持は、時に要点を曖昧にする可能性がある。","type":"general","meaning_category":"情報"}]}