{"word":"concentrators","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)濃縮器、集光器、集中させるもの","english_definition":"plural of concentrator: devices or substances that increase the concentration of something; devices that focus light or other forms of energy; things that bring elements together.","examples":[{"sentence":"Solar concentrators use lenses or mirrors to focus sunlight onto a small area.","translation":"太陽光集光器は、レンズまたは鏡を使用して、太陽光を小さな領域に集めます。"},{"sentence":"Oxygen concentrators are used by people with breathing difficulties.","translation":"酸素濃縮器は、呼吸困難のある人々によって使用されます。"},{"sentence":"The city is a major hub, one of the world's great concentrators of economic and cultural power.","translation":"その都市は主要なハブであり、世界の経済的および文化的パワーの偉大な集中地の1つです。"}],"collocations":["solar concentrators (太陽光集光器)","oxygen concentrators (酸素濃縮器)","dust concentrators (集塵機)"],"synonyms":["focusers","aggregators","amplifiers","intensifiers"],"antonyms":["diffusers","dispersers","diluters"]}],"etymology":{"value":"The word 'concentrator' is derived from 'concentrate,' which comes from the Latin 'con-' (together) and 'centrum' (center). The suffix '-or' indicates an agent or device that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒnsənˌtreɪtərz/","syllables":"con-cen-tra-tors"},"inflection":{"noun_plural":"concentrators"},"usage_notes":{"explanation":"'Concentrators' is the plural form of 'concentrator.' A concentrator is a device or substance that increases the concentration of something. This could refer to focusing light, increasing the purity of a substance, or bringing elements together in a specific location. The specific meaning depends on the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He uses concentrator to breathe easier.","correct":"✓ He uses a concentrator to breathe easier.","note":"Since 'concentrator' is a countable noun, it typically requires an article (a, an, the) or a possessive pronoun (his, her, etc.) before it when referring to a specific instance."},{"incorrect":"✗ The concentrators is very efficient.","correct":"✓ The concentrators are very efficient.","note":"When using the plural form 'concentrators,' the verb must agree and also be in plural form ('are' instead of 'is')."}],"priority":"★★☆"},"related_words":{"derivatives":["concentrate (verb, noun)","concentration (noun)","concentrated (adjective)","concentrically (adverb)"],"related_terms":["condenser","amplifier","lens","mirror","filter"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'concentrators' refers to multiple devices or systems designed to increase the density or focus of something. Common examples include solar concentrators, which focus sunlight for energy production, and oxygen concentrators, which increase the oxygen level for medical use. The word is generally used in technical or scientific contexts. Understanding the specific type of concentrator being discussed requires context.","priority":"★★☆"},"example_sentences":[{"sentence":"These solar concentrators are designed to maximize energy production in desert climates.","translation":"これらの太陽光集光器は、砂漠気候でのエネルギー生産を最大化するように設計されています。","type":"noun","meaning_category":"集光器"},{"sentence":"The hospital uses oxygen concentrators to provide patients with supplemental oxygen.","translation":"病院では、酸素濃縮器を使用して、患者に補助酸素を提供しています。","type":"noun","meaning_category":"濃縮器"},{"sentence":"The city's universities are major concentrators of intellectual talent.","translation":"その都市の大学は、知的才能の主要な集中地です。","type":"noun","meaning_category":"集中させるもの"}]}