{"word":"Chartism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"チャーティズム、人民憲章運動：19世紀のイギリスにおける労働者階級の政治改革運動。","english_definition":"A working-class movement for political reform in Britain between 1838 and 1848. It took its name from the People's Charter of 1838 and was a national protest movement, distinct from local radicalism.","examples":[{"sentence":"Chartism was a significant movement in the history of British democracy.","translation":"チャーティズムはイギリス民主主義の歴史において重要な運動でした。"},{"sentence":"The demands of Chartism included universal male suffrage and secret ballots.","translation":"チャーティズムの要求には、男子普通選挙と秘密投票が含まれていました。"},{"sentence":"Chartism ultimately failed to achieve its goals, but it influenced later reforms.","translation":"チャーティズムは最終的に目標を達成できませんでしたが、後の改革に影響を与えました。"}],"collocations":["People's Charter","universal suffrage","political reform","working-class movement"],"synonyms":["radicalism","reform movement","political activism"],"antonyms":["conservatism","status quo"]}],"etymology":{"value":"The term 'Chartism' is derived from the 'People's Charter' of 1838, which outlined the six main aims of the movement.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtʃɑːtɪzəm/","syllables":"Char-tism"},"inflection":{"noun_plural":null,"notes":"Chartism is generally considered an uncountable noun, so it doesn't usually have a plural form."},"usage_notes":{"explanation":"Chartism was a significant social and political movement in 19th-century Britain, driven by the working class who sought greater political rights and representation. The movement's demands were articulated in the People's Charter, which called for reforms such as universal male suffrage, equal electoral districts, secret ballots, annually elected Parliaments, and the abolition of property qualifications for MPs. While Chartism ultimately failed to achieve its aims during its active period, it laid the groundwork for later democratic reforms in Britain.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Chartism were a failure.","correct":"✓ Chartism was a failure.","note":"Chartism is a singular noun referring to a movement, so it takes a singular verb."},{"incorrect":"✗ He participated in the Chartisms.","correct":"✓ He participated in Chartism.","note":"Chartism is generally uncountable, so it doesn't usually take a plural form."}],"priority":"★★☆"},"related_words":{"derivatives":["Chartist (noun: a supporter of Chartism)","Chartist (adjective: relating to Chartism or Chartists)"],"phrases":["The Six Points of the Charter","People's Charter"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary related to history)","frequency_google_ngram":"Relatively low frequency, mainly used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chartism' refers to a specific historical movement in 19th-century Britain. Understanding it requires some knowledge of British history and political science. The word itself is not commonly used in everyday conversation but appears in academic or historical contexts. To fully understand the term, one needs to know about the People's Charter and the social and political conditions of the time."},"example_sentences":[{"sentence":"The rise of Chartism reflected the growing discontent among the working class.","translation":"チャーティズムの台頭は、労働者階級の間で高まる不満を反映していました。","type":"general"},{"sentence":"Feargus O'Connor was a prominent leader of Chartism.","translation":"フィアガス・オコナーはチャーティズムの著名な指導者でした。","type":"historical figure"},{"sentence":"Chartism advocated for secret ballots to protect voters from intimidation.","translation":"チャーティズムは、有権者を脅迫から守るために秘密投票を提唱しました。","type":"political reform"}]}