{"word":"sarcoplasmic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"筋形質の、筋漿の","english_definition":"Relating to the sarcoplasm of muscle tissue.","examples":[{"sentence":"Sarcoplasmic reticulum is a specialized type of smooth ER that regulates the calcium concentration in the sarcoplasm of muscle cells.","translation":"筋小胞体は、筋肉細胞の筋漿におけるカルシウム濃度を調節する特殊な滑面小胞体の一種です。"},{"sentence":"Sarcoplasmic hypertrophy refers to the increase in the volume of the sarcoplasmic fluid in the muscle cell.","translation":"筋漿肥大とは、筋肉細胞内の筋漿液の体積が増加することを指します。"}],"collocations":["sarcoplasmic reticulum","sarcoplasmic hypertrophy"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'sarx' (flesh) and 'plasma' (something molded or formed), combined with '-ic' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɑːrkoʊˈplæzmɪk/","syllables":"sar-co-plas-mic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'sarcoplasmic' is primarily used in the context of muscle physiology and exercise science. It describes structures, processes, or conditions related to the sarcoplasm, which is the cytoplasm of muscle cells. It's often used in discussions about muscle growth, particularly in the context of sarcoplasmic hypertrophy vs. myofibrillar hypertrophy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sarcoplasmic is important for muscle contraction.","correct":"✓ The sarcoplasm is important for muscle contraction.","note":"'Sarcoplasmic' is an adjective; 'sarcoplasm' is the noun referring to the substance itself."}],"priority":"★★☆"},"related_words":{"derivatives":["sarcoplasm","sarcomere","sarcolemma"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sarcoplasmic' is a technical term primarily used in the fields of biology, physiology, and exercise science. Understanding this term requires a solid foundation in these areas, as it relates specifically to the cytoplasm of muscle cells and associated processes. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The sarcoplasmic reticulum plays a crucial role in muscle contraction by storing and releasing calcium ions.","translation":"筋小胞体は、カルシウムイオンを貯蔵および放出することにより、筋肉の収縮において重要な役割を果たします。","type":"adjective","meaning_category":"Relating to muscle cell cytoplasm"}]}