{"word":"parliamenteer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"議会主義者、議会政治論者","english_definition":"An advocate of parliamentary government or of the principles of parliamentarism.","examples":[{"sentence":"He was a staunch parliamenteer, believing in the power of representative democracy.","translation":"彼は断固たる議会主義者であり、代議制民主主義の力を信じていた。"},{"sentence":"The parliamenteers argued for greater accountability from the executive branch.","translation":"議会主義者たちは、行政部門からのより大きな説明責任を求めて議論した。"}],"collocations":["staunch parliamenteer (断固たる議会主義者)","leading parliamenteer (主要な議会主義者)"],"synonyms":["parliamentarian","democrat","constitutionalist"],"antonyms":["autocrat","despot","dictator"]},{"part_of_speech":"noun","definition":"議会代表、使節","english_definition":"A person appointed or deputed to hold communication or negotiate with an enemy.","examples":[{"sentence":"The general sent a parliamenteer under a flag of truce to discuss terms of surrender.","translation":"将軍は降伏条件について話し合うため、休戦旗の下に議会代表を派遣した。"},{"sentence":"The parliamenteer carried a message of peace from one side to the other.","translation":"議会代表は一方の側から他方へ平和のメッセージを伝えた。"}],"collocations":["send a parliamenteer (議会代表を派遣する)","receive a parliamenteer (議会代表を受け入れる)"],"synonyms":["envoy","delegate","negotiator","emissary"],"antonyms":["combatant","enemy"]}],"etymology":{"value":"From 'parliament' + '-eer'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɑːrlɪmənˈtɪər/","syllables":"par-lia-men-teer"},"inflection":{"noun_plural":"parliamenteers"},"usage_notes":{"explanation":"The word 'parliamenteer' has two distinct meanings. The first refers to someone who believes in or advocates for parliamentary government. The second, a more historical usage, refers to a person sent to negotiate with an enemy, often under a flag of truce. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a strong parliamentarian, so he is a good parliamenteer.","correct":"✓ He is a strong parliamentarian, so he understands parliamentary procedure well.","note":"While 'parliamentarian' and 'parliamenteer' can sometimes be used interchangeably to describe someone involved in parliamentary politics, 'parliamentarian' is the more common and general term. 'Parliamenteer' is more specifically about advocating for parliamentarism."}],"priority":"★☆☆"},"related_words":{"derivatives":["parliament","parliamentary","parliamentarian"],"related_terms":["democracy","republic","negotiation","truce"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'parliamenteer' is a relatively uncommon word with two possible meanings. It can refer to someone who supports parliamentary government, or, historically, to someone sent to negotiate with an enemy. Because it is not a frequently used word, understanding its context is important to determine its intended meaning. It is more common to use 'parliamentarian' to refer to a member of parliament or someone knowledgeable about parliamentary procedure."},"example_sentences":[{"sentence":"As a dedicated parliamenteer, she fought tirelessly for democratic reforms.","translation":"献身的な議会主義者として、彼女は民主的改革のために精力的に戦った。","type":"noun","meaning_category":"議会主義者"},{"sentence":"The parliamenteer approached the enemy lines with a white flag.","translation":"議会代表は白旗を持って敵陣に近づいた。","type":"noun","meaning_category":"議会代表"}]}