{"word":"crajuru","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Brazilian indigenous term) A type of red pigment derived from the Bignonia chica plant, traditionally used by indigenous peoples in the Amazon for body painting and medicinal purposes.","english_definition":"A red pigment derived from the Bignonia chica plant, traditionally used by indigenous peoples in the Amazon for body painting and medicinal purposes.","examples":[{"sentence":"The indigenous tribe used crajuru to paint their faces for the ceremony.","translation":"その先住民族は儀式のためにクラジュルを使って顔を塗った。"},{"sentence":"Crajuru is known for its anti-inflammatory properties in traditional medicine.","translation":"クラジュルは伝統医学において抗炎症作用があることで知られている。"}],"collocations":["crajuru pigment","crajuru extract","traditional crajuru use"],"synonyms":["carajuru","chica red"],"antonyms":[]}],"etymology":{"value":"Derived from the Tupi language, spoken by indigenous peoples of Brazil.","priority":"★★★"},"pronunciation":{"ipa":"/kraˈʒuɾu/","syllables":"cra-ju-ru"},"inflection":{"noun_plural":"crajurus"},"usage_notes":{"explanation":"'Crajuru' is primarily used in anthropological, ethnobotanical, and medicinal contexts when discussing Amazonian indigenous cultures and traditional practices. It is not a commonly known word outside of these specific fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought crajuru paint at the art store.","correct":"✓ I bought crajuru pigment from a specialized supplier.","note":"Crajuru is not typically found in mainstream art stores; it is a specialized product. It is more accurate to refer to it as a 'pigment' rather than 'paint' when discussing its raw form."}],"priority":"★★☆"},"related_words":{"derivatives":["Bignonia chica (scientific name of the plant)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Crajuru' is a highly specialized term primarily encountered in academic or niche contexts related to Amazonian ethnobotany, anthropology, and traditional medicine. Understanding requires familiarity with indigenous cultures of Brazil and specialized vocabulary related to natural pigments and medicinal plants. Due to its limited usage and specific cultural context, it is not typically part of general English vocabulary."},"example_sentences":[{"sentence":"The anthropologist studied the use of crajuru in the tribe's traditional rituals.","translation":"人類学者は部族の伝統的な儀式におけるクラジュルの使用を研究した。","type":"noun","meaning_category":"pigment"},{"sentence":"Crajuru extract is being investigated for its potential dermatological benefits.","translation":"クラジュル抽出物は、皮膚科学的な利点の可能性について研究されている。","type":"noun","meaning_category":"pigment"}]}