{"word":"hydrosulphurated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(化学)硫化水素化された、硫化水素が付加された","english_definition":"(chemistry) Having undergone hydrosulphuration; having had hydrogen sulfide added.","examples":[{"sentence":"The hydrosulphurated compound exhibited a unique spectral signature.","translation":"その硫化水素化された化合物は、独特のスペクトル特性を示した。"}],"collocations":[],"synonyms":["sulfhydrated","hydrogen sulfide-added"],"antonyms":[],"notes":"This term is primarily used in technical chemical contexts."}],"etymology":{"value":"Formed from 'hydro-' (relating to hydrogen), 'sulphur' (sulfur), and '-ated' (having undergone a process). It indicates the addition of hydrogen sulfide (H₂S).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪdroʊˈsʌlfjʊˌreɪtɪd/","syllables":"hy-dro-sul-phu-rat-ed"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Hydrosulphurated' is a technical term used in chemistry to describe a compound that has undergone hydrosulphuration, a process where hydrogen sulfide (H₂S) is added to a molecule. It is most commonly encountered in the context of organic chemistry and industrial processes involving sulfur compounds.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["hydrosulphuration (noun): The process of adding hydrogen sulfide to a compound."],"related_terms":["hydrogen sulfide (H₂S)","sulfide","sulfuration"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Primarily used in specialized chemical literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Hydrosulphurated' is a highly specialized term used within the field of chemistry. Understanding this term requires a solid foundation in organic chemistry and chemical nomenclature. It describes a specific type of chemical modification involving the addition of hydrogen sulfide. Due to its highly technical nature, it is rarely encountered outside of specialized scientific contexts."},"example_sentences":[{"sentence":"The catalyst facilitated the hydrosulphuration of the alkene.","translation":"その触媒はアルケンの硫化水素化を促進した。","type":"technical","meaning_category":"chemical process"},{"sentence":"Analysis confirmed that the product was a hydrosulphurated derivative of the original compound.","translation":"分析の結果、その生成物が元の化合物の硫化水素化された誘導体であることが確認された。","type":"technical","meaning_category":"chemical composition"}]}