{"word":"cutcherries","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural only) A type of small, tart cherry, often used in pies and preserves.","english_definition":"A type of small, tart cherry, often used in pies and preserves.","examples":[{"sentence":"She made a delicious pie with the cutcherries she picked from her garden.","translation":"彼女は庭で摘んだカットチェリーで美味しいパイを作った。"}],"collocations":["cutcherry pie","cutcherry preserves"],"synonyms":["Morello cherry","tart cherry"],"antonyms":[]}],"etymology":{"value":"Likely a regional or dialectal term, possibly derived from 'cut' referring to the small size or a specific characteristic of the cherry, combined with 'cherries'. The exact origin is unclear due to its limited usage.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkʌtʃɛriz/","syllables":"cut-cher-ries"},"inflection":{"noun_plural":"cutcherries"},"usage_notes":{"explanation":"'Cutcherries' is a relatively uncommon term, primarily used in specific regions or by individuals familiar with this particular type of cherry. It is typically used in the plural form.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I only ate one cutcherry.","correct":"✓ I only ate a few cutcherries.","note":"'Cutcherries' is usually used in the plural form, even when referring to a small quantity."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["cherry","fruit","pie","preserve"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cutcherries' refers to a specific type of tart cherry. It is not a common term, so it is unlikely to be encountered frequently. Understanding its meaning requires familiarity with regional or specialized vocabulary related to fruit varieties."},"example_sentences":[{"sentence":"The farmer grew cutcherries specifically for making jam.","translation":"その農家はジャムを作るためだけにカットチェリーを栽培していた。","type":"noun","meaning_category":"type of cherry"}]}