{"word":"irroration","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"散布、霧吹き","english_definition":"The act of sprinkling or bedewing; a sprinkling or bedewing.","examples":[{"sentence":"The irroration of the plants with water helps them thrive.","translation":"植物に水を散布することで、植物の生育が促進される。"},{"sentence":"The irroration of perfume created a pleasant atmosphere.","translation":"香水を散布することで、心地よい雰囲気を作り出した。"}],"collocations":["water irroration","perfume irroration"],"synonyms":["sprinkling","bedewing","spray","misting"],"antonyms":[]}],"etymology":{"value":"From Latin irrorationem (nominative irroratio) \"a sprinkling, bedewing,\" noun of action from past participle stem of irrorare \"to sprinkle, bedew,\" from in- \"on, upon\" + rorare \"to bedew,\" from ros \"dew.\"","priority":"★★☆"},"pronunciation":{"ipa":"ɪˌrɔˈreɪʃən","syllables":"ir-ro-ra-tion"},"inflection":{"noun_plural":"irrorations"},"usage_notes":{"explanation":"'Irroration' refers to the act of sprinkling or spraying, often with a liquid. It is a somewhat uncommon word, typically found in technical or descriptive contexts where precise language is valued.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The irroration was done by pouring water.","correct":"✓ The irroration was done by spraying water.","note":"Irroration implies a fine spray or mist, not pouring."}],"priority":"★☆☆"},"related_words":{"derivatives":["irrorate (verb)","irrorated (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Irroration' is a rare and formal term denoting the act of sprinkling or spraying, often with a fine mist. Its usage is primarily confined to technical or highly descriptive contexts. Due to its infrequent appearance, it is suitable for advanced learners aiming to expand their vocabulary and comprehension of nuanced language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The gardener used a fine mist for the irroration of the delicate orchids.","translation":"庭師は繊細な蘭に細かい霧を散布するために使用しました。","type":"general","meaning_category":"sprinkling"},{"sentence":"The chemist demonstrated the irroration technique for applying the solution evenly.","translation":"化学者は溶液を均一に塗布するための散布技術を実演しました。","type":"technical","meaning_category":"spraying"}]}