{"word":"cursedness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"呪われている状態、呪いの性質、災厄","english_definition":"The state of being cursed; the quality of being cursed; a condition of misfortune or evil resulting from a curse.","examples":[{"sentence":"The cursedness of the tomb was said to bring doom to anyone who disturbed it.","translation":"その墓の呪いは、それを荒らす者に破滅をもたらすと言われていた。"},{"sentence":"They believed the cursedness of the land was responsible for their misfortunes.","translation":"彼らはその土地の呪いが自分たちの不幸の原因だと信じていた。"},{"sentence":"The cursedness seemed to follow the family for generations.","translation":"その呪いは何世代にもわたってその家族につきまとっているようだった。"}],"collocations":["feel the cursedness","break the cursedness","lift the cursedness","the cursedness of the artifact","the cursedness of the place"],"synonyms":["damnation","doom","ill-fortune","misery","affliction","bane"],"antonyms":["blessedness","fortune","happiness","luck","prosperity"]}],"etymology":{"value":"Derived from the word 'cursed' (past participle of 'curse') + '-ness' (suffix denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɜːrsɪdnəs/","syllables":"curs-ed-ness"},"inflection":{"noun_plural":"cursednesses (rarely used)"},"usage_notes":{"explanation":"'Cursedness' is a noun that refers to the state or quality of being cursed. It is often associated with a sense of misfortune, evil, or doom. The word is relatively uncommon in everyday language and tends to appear in contexts involving folklore, mythology, or supernatural themes. It is the abstract noun form of 'cursed'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cursedness was very happiness.","correct":"✓ The cursedness was a source of great unhappiness.","note":"'Cursedness' is the opposite of happiness and should not be associated with positive emotions."},{"incorrect":"✗ He was feeling cursedness.","correct":"✓ He was feeling the effects of the cursedness.","note":"'Cursedness' is a state or quality, not a feeling in itself. One feels the *effects* of cursedness."},{"incorrect":"✗ The cursedness is person.","correct":"✓ The cursedness is a condition/state.","note":"'Cursedness' is a state, not a person. Do not use it to describe someone directly."}],"priority":"★★☆"},"related_words":{"derivatives":["curse","cursed","cursedly","uncursed"],"phrases":["under a curse"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Too specific to be categorized by CEFR levels)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cursedness' is a relatively rare and abstract noun referring to the state of being under a curse or the quality of being afflicted by misfortune due to a curse. It is most often found in literature, mythology, or contexts involving supernatural or superstitious beliefs. Because of its rarity and abstract nature, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The ancient artifact radiated an aura of palpable cursedness.","translation":"その古代の工芸品は、明白な呪いのオーラを放っていた。","type":"noun","meaning_category":"呪われている状態"},{"sentence":"The cursedness of the family's history haunted them for generations.","translation":"その家族の歴史の呪いが、何世代にもわたって彼らを苦しめた。","type":"noun","meaning_category":"呪いの性質"},{"sentence":"They sought a way to break the cursedness that plagued their village.","translation":"彼らは自分たちの村を苦しめる呪いを解く方法を探した。","type":"noun","meaning_category":"災厄"}]}