{"word":"appendico-enterostomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"虫垂回腸吻合術（虫垂を回腸に吻合する外科手術）","english_definition":"A surgical procedure in which the appendix is connected to the ileum (a part of the small intestine). This is typically done to create a continent catheterizable stoma, allowing for antegrade colonic enemas to treat fecal incontinence or constipation.","examples":[{"sentence":"Appendico-enterostomy is sometimes performed in patients with severe constipation.","translation":"虫垂回腸吻合術は、重度の便秘の患者に対して行われることがあります。"},{"sentence":"The surgeon created a continent catheterizable stoma using appendico-enterostomy.","translation":"外科医は虫垂回腸吻合術を用いて、自己導尿可能なストーマを作成しました。"}],"collocations":["perform appendico-enterostomy","create a stoma with appendico-enterostomy","appendico-enterostomy for fecal incontinence"],"synonyms":["continent appendicostomy","Malone antegrade continence enema (MACE) procedure"],"antonyms":[]}],"etymology":{"value":"The term is derived from the combination of 'appendico-' (referring to the appendix), 'entero-' (referring to the intestine, specifically the small intestine), and '-stomy' (referring to the surgical creation of an opening).","priority":"★★☆"},"pronunciation":{"ipa":"/əˌpɛndɪkoʊˌɛntəˈrɒstəmi/","syllables":"a-pen-di-co-en-te-ros-to-my"},"inflection":{"noun_plural":"appendico-enterostomies"},"usage_notes":{"explanation":"Appendico-enterostomy is a highly specialized surgical procedure primarily used to manage severe bowel dysfunction. The created stoma allows for the administration of enemas directly into the colon, aiding in bowel evacuation and improving continence. It is often considered when conservative treatments have failed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ appendicoenterostomy","correct":"✓ appendico-enterostomy","note":"The term should be hyphenated to clearly separate the components."}],"priority":"★☆☆"},"related_words":{"derivatives":["appendicostomy","ileum","stoma","enema"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Appendico-enterostomy is a complex medical term referring to a surgical procedure. It involves connecting the appendix to the ileum to create a stoma, which facilitates the administration of enemas for bowel management. Understanding this term requires medical knowledge and familiarity with surgical procedures.","priority":"★☆☆"},"example_sentences":[{"sentence":"Appendico-enterostomy can significantly improve the quality of life for patients with chronic constipation.","translation":"虫垂回腸吻合術は、慢性便秘の患者の生活の質を大幅に改善することができます。","type":"general","meaning_category":"便秘治療"},{"sentence":"The success of appendico-enterostomy depends on careful patient selection and surgical technique.","translation":"虫垂回腸吻合術の成功は、慎重な患者選択と外科手術の技術に依存します。","type":"surgical","meaning_category":"手術の成功"}]}