{"word":"wrist-drop","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"下垂手、手関節下垂","english_definition":"A condition in which the wrist and fingers cannot be extended due to paralysis of the extensor muscles of the forearm and hand.","examples":[{"sentence":"Wrist-drop can be caused by damage to the radial nerve.","translation":"下垂手は橈骨神経の損傷によって引き起こされることがある。"},{"sentence":"The patient presented with wrist-drop following a fracture.","translation":"患者は骨折後、下垂手を呈した。"}],"collocations":["radial nerve palsy (橈骨神経麻痺)","nerve damage (神経損傷)","muscle weakness (筋力低下)","splint (添え木)","physical therapy (理学療法)"],"synonyms":["radial nerve palsy","extensor paralysis"],"antonyms":[]}],"etymology":{"value":"The term 'wrist-drop' is descriptive, indicating the drooping or falling of the wrist due to muscle weakness or paralysis.","priority":"★★★"},"pronunciation":{"ipa":"/ˈrɪstˌdrɒp/","syllables":"wrist-drop"},"inflection":{"noun_plural":"wrist-drops"},"usage_notes":{"explanation":"Wrist-drop is a clinical sign, not a disease itself. It indicates an underlying neurological or muscular problem. The most common cause is damage to the radial nerve, which can occur due to fractures, compression, or other injuries. Treatment focuses on addressing the underlying cause and may include splinting, physical therapy, or surgery.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a wrist drop.","correct":"✓ He has wrist-drop.","note":"Wrist-drop is typically used as a noncount noun, so 'a' is usually omitted."},{"incorrect":"✗ Wrist drop is when your wrist falls.","correct":"✓ Wrist-drop is a condition where the wrist and fingers cannot be extended.","note":"Provide a more precise definition, focusing on the inability to extend the wrist and fingers."}],"priority":"★★☆"},"related_words":{"derivatives":["drop foot (下垂足)","nerve palsy (神経麻痺)","paresis (不全麻痺)","paralysis (麻痺)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Wrist-drop' is a specialized medical term referring to the inability to extend the wrist and fingers due to paralysis of the extensor muscles, typically caused by radial nerve damage. It's a clinical sign indicating an underlying neurological issue, requiring medical diagnosis and treatment. This term is primarily used in medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor diagnosed the patient with wrist-drop and ordered an EMG.","translation":"医師は患者を下垂手と診断し、筋電図検査を指示した。","type":"medical","meaning_category":"diagnosis"},{"sentence":"Splinting is often used to support the wrist in patients with wrist-drop.","translation":"下垂手の患者には、手首を支えるために添え木がよく用いられる。","type":"treatment","meaning_category":"treatment"},{"sentence":"Severe wrist-drop can significantly impair hand function.","translation":"重度の下垂手は、手の機能を著しく損なう可能性がある。","type":"symptom","meaning_category":"symptom"}]}