{"word":"tralineate","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(図面、地図などを)線で表す、線画する","english_definition":"To represent (something) by lines; to delineate.","examples":[{"sentence":"The architect tralineated the building's facade in detail.","translation":"建築家は建物のファサードを詳細に線画した。"},{"sentence":"The cartographer carefully tralineated the coastline on the map.","translation":"地図製作者は地図上に海岸線を注意深く線画した。"}],"collocations":["tralineate a map (地図を線画する)","tralineate a diagram (図を線画する)","tralineate an image (画像を線画する)"],"synonyms":["delineate","outline","draw","sketch","represent"],"antonyms":["shade","color","paint"]}],"etymology":{"value":"From Latin *trans-* (across) + *linea* (line) + *-ate* (suffix indicating action). The word suggests representing something by drawing lines across it or outlining it.","priority":"★★☆"},"pronunciation":{"ipa":"/trəˈlɪniˌeɪt/","syllables":"tra-lin-i-ate"},"inflection":{"verb_forms":{"present_simple":["tralineate","tralineates"],"past_simple":"tralineated","past_participle":"tralineated","present_participle":"tralineating"}},"usage_notes":{"explanation":"'Tralineate' is a relatively rare and formal word, primarily used in technical or artistic contexts to describe the act of representing something through lines, especially in drawing or mapping. It emphasizes the linear representation of an object or area.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He tralineated the painting with watercolors.","correct":"✓ He delineated the painting with watercolors.","note":"'Tralineate' specifically refers to representation using lines, not colors or shading. If watercolors are used, 'delineate' is a more appropriate term."},{"incorrect":"✗ The author tralineated his feelings in the poem.","correct":"✓ The author expressed his feelings in the poem.","note":"'Tralineate' is generally used for visual representations, not abstract concepts or emotions. Use 'expressed' or 'described' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["tralineation (noun: the act of tralineating; a representation made by lines)"],"phrasal_verbs":[],"related_terms":["line","delineation","outline","sketch"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. The word is rare and not commonly used in everyday language.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tralineate' is a sophisticated and uncommon term used to describe the act of representing something through lines, such as in technical drawings or maps. It is not typically encountered in general conversation or writing, and its usage is largely confined to specialized fields. Understanding this word requires a strong vocabulary and familiarity with technical or artistic terminology."},"example_sentences":[{"sentence":"The engineer tralineated the circuit diagram with precision.","translation":"エンジニアは回路図を正確に線画した。","type":"verb","meaning_category":"線で表す"},{"sentence":"The artist used fine lines to tralineate the details of the portrait.","translation":"アーティストは細い線を使って肖像画の詳細を線画した。","type":"verb","meaning_category":"線画する"},{"sentence":"The software can automatically tralineate a photograph into a line drawing.","translation":"そのソフトウェアは写真を自動的に線画に変換できる。","type":"verb","meaning_category":"線画する"}]}