{"word":"Retrovision","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A hypothetical ability to perceive events in the past.","english_definition":"The ability to see or perceive past events, often associated with science fiction or paranormal phenomena.","examples":[{"sentence":"The comic book character possessed retrovision, allowing him to witness historical moments.","translation":"その漫画のキャラクターは過去の出来事を目撃できるレトロビジョン能力を持っていた。"},{"sentence":"Scientists dismissed the claims of retrovision as pseudoscience.","translation":"科学者たちはレトロビジョンの主張を疑似科学として否定した。"}],"collocations":["possess retrovision","develop retrovision","study retrovision","claims of retrovision"],"synonyms":["clairvoyance","precognition","past sight"],"antonyms":["present sight","future sight"]}],"etymology":{"value":"A combination of \"retro-\" (meaning backward or past) and \"vision\" (the ability to see).","priority":"★★★"},"pronunciation":{"ipa":"/ˌrɛtroʊˈvɪʒən/","syllables":"re-tro-vi-sion"},"inflection":{"noun_plural":"Retrovisions"},"usage_notes":{"explanation":"Retrovision is primarily used in fictional contexts, such as science fiction, fantasy, or paranormal discussions. It is not a scientifically recognized phenomenon.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She used her retrovision to change the past.","correct":"✓ She used her retrovision to observe the past.","note":"Retrovision, as a concept, typically only allows observation, not alteration, of past events."}],"priority":"★★☆"},"related_words":{"derivatives":["retro (adjective, noun)","vision (noun)"],"related_terms":["precognition","clairvoyance","telekinesis"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'retrovision' is not commonly used in everyday language. It is primarily found in science fiction or discussions of paranormal abilities. Understanding requires familiarity with the prefixes 'retro-' and the concept of 'vision.'"},"example_sentences":[{"sentence":"In the novel, the protagonist's retrovision revealed the true origins of the ancient artifact.","translation":"小説の中で、主人公のレトロビジョンは古代のアーティファクトの真の起源を明らかにした。","type":"noun","meaning_category":"Hypothetical ability"},{"sentence":"The psychic claimed her retrovision allowed her to solve cold cases by seeing the events as they happened.","translation":"その超能力者は、彼女のレトロビジョンによって、事件が起こった時の様子を見ることができるため、未解決事件を解決できると主張した。","type":"noun","meaning_category":"Hypothetical ability"}]}