{"word":"bookworms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"本好き、本の虫","english_definition":"A person who spends a great deal of time reading.","examples":[{"sentence":"She is one of the biggest bookworms I know.","translation":"彼女は私が知っている中で一番の読書家の一人です。"},{"sentence":"The library is a haven for bookworms.","translation":"図書館は本の虫たちの安息の地です。"}],"collocations":["avid bookworm","dedicated bookworm","serious bookworm"],"synonyms":["reader","bibliophile","scholar","intellectual"],"antonyms":[],"notes":"Usually used in a positive or neutral way, but can sometimes be used humorously or slightly negatively to imply someone is overly focused on books to the exclusion of other activities."}],"etymology":{"value":"The term originally referred to actual worms or insects that bore into and damage books. The figurative sense, referring to people who love to read, developed later.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʊk.wɜːrmz/","syllables":"book-worms"},"inflection":{"noun_plural":"bookworms"},"usage_notes":{"explanation":"'Bookworms' is the plural form of 'bookworm'. It refers to multiple people who enjoy reading extensively. It is generally used to describe someone who is passionate about reading and spends a lot of time doing so.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a bookworm, he doesn't like to go out.","correct":"✓ He is a bookworm; he doesn't like to go out.","note":"The two clauses are independent, so they should be separated by a semicolon or made into two separate sentences."},{"incorrect":"✗ She is a bookworm and spends all her time to read.","correct":"✓ She is a bookworm and spends all her time reading.","note":"After 'spends time', use the gerund form of the verb (reading)."}],"priority":"★★☆"},"related_words":{"derivatives":["bookworm (singular noun)"],"phrases":["reading enthusiast","avid reader","bibliophile"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but recognizable.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'bookworms' is used to describe people who love reading and spend a lot of time doing it. It is a relatively common term, but it's not as basic as words like 'read' or 'book'. You might encounter it in books, articles, or conversations about reading and literature. It's generally understood by native English speakers, but it's not essential for basic communication."},"example_sentences":[{"sentence":"The library was filled with **bookworms** quietly reading.","translation":"図書館は静かに読書をする本の虫たちでいっぱいだった。","type":"noun","meaning_category":"本好き"},{"sentence":"My friends call me a **bookworm** because I always have a book with me.","translation":"友達はいつも本を持ち歩いている私を本の虫と呼ぶ。","type":"noun","meaning_category":"本好き"}]}