{"word":"antirationalist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"反合理主義者、反理性主義者","english_definition":"One who opposes rationalism or the use of reason as the primary source of knowledge or justification.","examples":[{"sentence":"He was described as an antirationalist, emphasizing intuition and emotion over logical analysis.","translation":"彼は反合理主義者であると評され、論理的な分析よりも直感と感情を重視した。"}],"collocations":["philosophical antirationalist","political antirationalist"],"synonyms":["irrationalist","anti-intellectual"],"antonyms":["rationalist"]},{"part_of_speech":"adjective","definition":"反合理主義の、反理性主義の","english_definition":"Opposing rationalism; characterized by a rejection of reason as the primary source of knowledge or justification.","examples":[{"sentence":"The movement adopted an antirationalist stance, rejecting Enlightenment ideals.","translation":"その運動は反合理主義的な立場を取り、啓蒙思想の理想を拒否した。"}],"collocations":["antirationalist philosophy","antirationalist movement"],"synonyms":["irrational","nonrational"],"antonyms":["rational"]}],"etymology":{"value":"'Anti-' (against) + 'rationalist' (one who believes in reason as the primary source of knowledge).","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈræʃənəlɪst/","syllables":"an-ti-ra-tion-al-ist"},"inflection":{"noun_plural":"antirationalists"},"usage_notes":{"explanation":"'Antirationalist' refers to someone or something opposing rationalism, which is the belief that reason is the chief source of knowledge. This term is often used in philosophical, political, and social contexts to describe movements or individuals who prioritize other sources of knowledge, such as intuition, emotion, or tradition, over reason.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a antirationalist.","correct":"✓ He is an antirationalist.","note":"'Antirationalist' begins with a vowel sound, so it requires the indefinite article 'an' rather than 'a'."}],"priority":"★★☆"},"related_words":{"derivatives":["antirationalism"],"related_terms":["rationalism","irrationalism","reason","intuition","emotion"]},"level_frequency":{"frequency_google_ngram":"Low Frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'antirationalist' is a relatively advanced term used in philosophical and intellectual discussions. It describes a person or idea that opposes rationalism, which is the belief that reason is the primary source of knowledge. Understanding this term requires familiarity with philosophical concepts and abstract thinking."},"example_sentences":[{"sentence":"The artist embraced an antirationalist approach to creation, allowing instinct to guide his work.","translation":"その芸術家は、創造に対する反合理主義的なアプローチを採用し、本能が彼の作品を導くようにした。","type":"adjective"},{"sentence":"Many critics viewed the politician as an antirationalist due to his reliance on populist rhetoric.","translation":"多くの批評家は、その政治家が大衆迎合的なレトリックに頼っているため、反合理主義者であると見なした。","type":"noun"}]}