{"word":"twice-suspected","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"二度疑われた、二度容疑をかけられた","english_definition":"Having been suspected of something on two separate occasions.","examples":[{"sentence":"The twice-suspected thief was finally caught red-handed.","translation":"二度容疑をかけられた泥棒は、ついに現行犯で捕まった。"},{"sentence":"He was a twice-suspected murderer, but the evidence was always circumstantial.","translation":"彼は二度殺人容疑をかけられたが、証拠は常に状況証拠だった。"}],"collocations":["twice-suspected criminal","twice-suspected arsonist","twice-suspected fraudster"],"synonyms":["repeatedly suspected","previously suspected","formerly suspected"],"antonyms":["never suspected","unsuspected"]}],"etymology":{"value":"The word is formed by combining \"twice\" (meaning two times) with \"suspected\" (meaning having doubts or mistrust about someone).","priority":"N/A"},"pronunciation":{"ipa":"/ˈtwaɪs səsˌpektɪd/","syllables":"twice-sus-pect-ed"},"inflection":{"notes":"This is an adjective and does not have typical inflections."},"usage_notes":{"explanation":"\"Twice-suspected\" is used to describe someone who has been under suspicion for a particular act or crime on two separate occasions. It implies a recurring pattern of suspicion, even if the person was not convicted or proven guilty in either instance.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is twice suspected.","correct":"✓ He is twice-suspected.","note":"Using the hyphen creates a compound adjective, clearly indicating that the person has been suspected on two occasions, rather than simply saying that he is suspected twice. "},{"incorrect":"✗ twice suspect","correct":"✓ twice-suspected","note":"The hyphen is important to link the words and create a single adjective. Without it, the meaning is less clear."}],"priority":"N/A"},"related_words":{"derivatives":["suspect","suspicion","suspectable"],"phrases":["under suspicion","prime suspect","usual suspect"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"twice-suspected\" is a relatively uncommon compound adjective used to describe someone who has been suspected of something (usually a crime) on two separate occasions. It is more frequently found in formal or journalistic writing. Understanding requires a good grasp of compound adjectives and the nuances of the word \"suspect.\""},"example_sentences":[{"sentence":"The twice-suspected politician denied all allegations of corruption.","translation":"二度容疑をかけられた政治家は、汚職のすべての申し立てを否定した。","type":"example","meaning_category":"general use"},{"sentence":"As a twice-suspected individual, he found it difficult to get a job.","translation":"二度容疑をかけられた人物として、彼は仕事を見つけるのが難しいと感じた。","type":"example","meaning_category":"impact of suspicion"}]}