{"word":"opsonification","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"オプソニン化（細菌などの微生物が抗体や補体などのオプソニンによって覆われることで、食細胞による貪食が促進される現象）","english_definition":"The process by which a pathogen is marked for ingestion and destruction by phagocytes. Opsonization involves the binding of an opsonin (e.g., an antibody) to an epitope on the pathogen. After opsonin binds to the pathogen, phagocytes are attracted to the pathogen.","examples":[{"sentence":"Opsonification is a crucial step in the immune response against bacterial infections.","translation":"オプソニン化は、細菌感染に対する免疫応答における重要なステップです。"},{"sentence":"Antibodies play a significant role in the opsonification of pathogens.","translation":"抗体は病原体のオプソニン化において重要な役割を果たします。"},{"sentence":"Complement proteins can also act as opsonins, enhancing phagocytosis through opsonification.","translation":"補体タンパク質もオプソニンとして作用し、オプソニン化を介して食作用を促進することができます。"}],"collocations":["enhance opsonification (オプソニン化を促進する)","mediate opsonification (オプソニン化を媒介する)","opsonification assay (オプソニン化アッセイ)","complement-mediated opsonification (補体介在性オプソニン化)","antibody-dependent opsonification (抗体依存性オプソニン化)"],"synonyms":["immune enhancement of phagocytosis","antibody-mediated phagocytosis"],"antonyms":["inhibition of phagocytosis"]},{"part_of_speech":"noun","definition":"(より広義には) ある物質が食細胞による認識と貪食を促進されるように修飾されるプロセス","english_definition":"More broadly, the process by which a substance is modified to be more readily recognized and ingested by phagocytes.","examples":[{"sentence":"Opsonification can be induced by various factors, including antibodies and complement components.","translation":"オプソニン化は、抗体や補体成分を含む様々な因子によって誘導され得る。"},{"sentence":"The efficiency of opsonification affects the overall effectiveness of the immune system.","translation":"オプソニン化の効率は、免疫系の全体的な有効性に影響を与える。"}],"collocations":["promote opsonification (オプソニン化を促進する)","increase opsonification (オプソニン化を増加させる)"],"synonyms":["phagocytosis enhancement"],"antonyms":["phagocytosis inhibition"]}],"etymology":{"value":"Derived from the Greek word 'opson', meaning 'relish' or 'sauce', reflecting the idea that opsonins make pathogens more 'palatable' to phagocytes.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɒpsənɪfɪˈkeɪʃən/","syllables":"op-so-ni-fi-ca-tion"},"inflection":{"noun_plural":"opsonifications"},"usage_notes":{"explanation":"Opsonification is a key process in the adaptive immune response. It involves coating a pathogen with opsonins, which are molecules that enhance phagocytosis. Antibodies and complement proteins are the most important opsonins. The process is crucial for clearing extracellular pathogens, especially bacteria, from the body. Opsonification assays are used in research and diagnostics to measure the effectiveness of opsonins and phagocytes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Opsonization is the same as phagocytosis.","correct":"✓ Opsonization enhances phagocytosis.","note":"Opsonization prepares pathogens for phagocytosis, but it is not the same as the process of phagocytosis itself."},{"incorrect":"✗ Opsonification only involves antibodies.","correct":"✓ Opsonification can involve antibodies, complement proteins, and other factors.","note":"While antibodies are important opsonins, complement proteins and other molecules can also mediate opsonification."}],"priority":"★★☆"},"related_words":{"derivatives":["opsonize (verb)","opsonin (noun)","opsonic (adjective)"],"related_terms":["phagocytosis","antibody","complement system","immune response","macrophage","neutrophil"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Opsonification' is a specialized term in immunology. It refers to the process where pathogens (like bacteria) are coated with molecules called opsonins, which makes them easier for immune cells (phagocytes) to recognize, engulf, and destroy. Think of it like putting a 'flag' on the pathogen so the immune cells know to attack it. The most common opsonins are antibodies and complement proteins. Understanding opsonification is important for understanding how the immune system clears infections.","priority":"★★★"},"example_sentences":[{"sentence":"Effective opsonification is essential for the clearance of bacteria from the bloodstream.","translation":"効果的なオプソニン化は、血流からの細菌除去に不可欠です。","type":"general","meaning_category":"immune response"},{"sentence":"The opsonification assay measured the ability of antibodies to enhance phagocytosis.","translation":"オプソニン化アッセイは、抗体が食作用を促進する能力を測定しました。","type":"research","meaning_category":"research"},{"sentence":"Deficiencies in complement proteins can impair opsonification, leading to increased susceptibility to infection.","translation":"補体タンパク質の欠損はオプソニン化を阻害し、感染に対する感受性を高める可能性があります。","type":"medical","meaning_category":"medical"}]}