{"word":"All-India","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"全インドの、インド全土にわたる","english_definition":"Relating to or affecting the whole of India.","examples":[{"sentence":"The All-India Congress Committee held a meeting.","translation":"全インド・コングレス委員会が会議を開催した。"},{"sentence":"An All-India strike was called by the trade unions.","translation":"労働組合によって全インド・ストライキが呼びかけられた。"},{"sentence":"This is an All-India survey on consumer preferences.","translation":"これは消費者の嗜好に関する全インド調査です。"}],"collocations":["All-India strike (全インド・ストライキ)","All-India survey (全インド調査)","All-India competition (全インド競技会)","All-India level (全インドレベル)","All-India organization (全インド組織)"],"synonyms":["national","countrywide","nationwide"],"antonyms":["regional","local","state-level"]}],"etymology":{"value":"A compound adjective formed from 'all' and 'India', indicating something that encompasses the entirety of India.","priority":"★★☆"},"pronunciation":{"ipa":"ɔːl ɪnˈdɪə","syllables":"All-In-di-a"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'All-India' is used to describe something that involves or affects the entire country of India. It is commonly used in the context of organizations, events, surveys, and movements that have a national scope within India. The term implies that the subject is not limited to a specific region or state but extends to the entire Indian territory.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The event was only India.","correct":"✓ The event was All-India.","note":"'All-India' specifies that the event covers the entire country, whereas 'India' alone is too broad and does not convey the same meaning."},{"incorrect":"✗ The survey is for only some states, not All-India.","correct":"✓ The survey is for some states only, not All-India.","note":"The correct phrasing emphasizes the limited scope of the survey compared to the nationwide scope implied by 'All-India'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Indian","India","national","countrywide","pan-Indian"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively common in Indian English and contexts related to India.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'All-India' is generally used in contexts that require a clear indication of national scope within India. It is most often found in news articles, academic papers, and official documents related to Indian affairs. Understanding the term is essential for comprehending discussions about national-level policies, events, and organizations in India."},"example_sentences":[{"sentence":"The All-India Radio is a national radio broadcaster.","translation":"全インド放送は国のラジオ放送局です。","type":"example","meaning_category":"national broadcaster"},{"sentence":"An All-India entrance exam is conducted for medical colleges.","translation":"医科大学への入学試験は全インド入学試験として実施されます。","type":"example","meaning_category":"national entrance exam"},{"sentence":"The company has an All-India distribution network.","translation":"その会社は全インドの流通ネットワークを持っています。","type":"example","meaning_category":"national distribution network"}]}