{"word":"lectin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"レクチン (特定の糖鎖に結合するタンパク質)","english_definition":"A type of protein that binds to specific sugar molecules.","examples":[{"sentence":"Lectins are found in many plants, especially legumes and grains.","translation":"レクチンは多くの植物、特に豆類や穀物に含まれています。"},{"sentence":"Some people believe that lectins can interfere with nutrient absorption.","translation":"レクチンは栄養素の吸収を妨げると信じている人もいます。"},{"sentence":"Cooking can reduce the amount of lectins in food.","translation":"調理することで食品中のレクチンの量を減らすことができます。"}],"collocations":["plant lectins (植物レクチン)","lectin-free diet (レクチンフリーダイエット)","lectin binding (レクチン結合)","lectin activity (レクチン活性)"],"synonyms":["phytohemagglutinin"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'legere,' meaning 'to select' or 'to pick out,' because lectins selectively bind to specific sugar molecules.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛktɪn/","syllables":"lek-tin"},"inflection":{"noun_plural":"lectins"},"usage_notes":{"explanation":"Lectins are proteins that bind to carbohydrates (sugars). They are found in a wide variety of plants and animals. Some people believe that lectins can have negative effects on health, such as interfering with nutrient absorption or causing inflammation. This has led to the popularity of lectin-free diets. However, most lectins are deactivated by cooking, and many lectin-containing foods are nutritious and beneficial.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Lectin is a type of sugar.","correct":"✓ Lectin is a type of protein.","note":"Lectins are proteins that bind to sugars, but they are not sugars themselves."},{"incorrect":"✗ All lectins are harmful.","correct":"✓ Some lectins may have negative effects, but many are deactivated by cooking or are present in nutritious foods.","note":"Not all lectins are harmful, and many are consumed safely as part of a balanced diet."}],"priority":"★★☆"},"related_words":{"derivatives":["lectin-binding (形容詞: レクチン結合性の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in scientific or dietary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'lectin' refers to a complex protein that binds to carbohydrates. It's mainly used in scientific and health-related discussions, particularly when talking about nutrition and the effects of certain foods on the body. Because it's a technical term, it's not commonly used in everyday conversation. Understanding 'lectin' requires some background knowledge in biology and nutrition."},"example_sentences":[{"sentence":"The study investigated the effects of different **lectins** on gut health.","translation":"その研究では、さまざまなレクチンが腸の健康に及ぼす影響を調査しました。","type":"noun","meaning_category":"タンパク質"},{"sentence":"Soaking and cooking beans can significantly reduce their **lectin** content.","translation":"豆を浸水して調理すると、レクチン含有量を大幅に減らすことができます。","type":"noun","meaning_category":"タンパク質"},{"sentence":"Some diets restrict foods high in **lectins** to promote weight loss and reduce inflammation.","translation":"一部の食事療法では、体重減少を促進し、炎症を軽減するために、レクチンを多く含む食品を制限しています。","type":"noun","meaning_category":"タンパク質"}]}