{"word":"groupthink","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"集団思考：集団内で、批判的思考や個人の意見を抑え、合意を優先する思考様式。","english_definition":"a psychological phenomenon that occurs within a group of people in which the desire for harmony or conformity in the group results in an irrational or dysfunctional decision-making outcome.","examples":[{"sentence":"The project failed because of groupthink; no one dared to challenge the leader's flawed plan.","translation":"そのプロジェクトは集団思考が原因で失敗した。誰もリーダーの欠陥のある計画に異議を唱えようとしなかった。"},{"sentence":"To avoid groupthink, it's important to encourage diverse perspectives and critical evaluation.","translation":"集団思考を避けるためには、多様な視点と批判的な評価を奨励することが重要だ。"},{"sentence":"Groupthink can lead to poor decisions, as dissenting opinions are suppressed.","translation":"集団思考は、反対意見が抑圧されるため、不適切な決定につながる可能性がある。"}],"collocations":["avoid groupthink (集団思考を避ける)","prevent groupthink (集団思考を防ぐ)","combat groupthink (集団思考に対抗する)","suffer from groupthink (集団思考に苦しむ)","fall victim to groupthink (集団思考の犠牲になる)","groupthink mentality (集団思考の考え方)"],"synonyms":["conformity","herd mentality","consensus seeking","lack of critical thinking","uniformity of thought"],"antonyms":["critical thinking","independent thought","dissent","diversity of opinion","constructive criticism"]}],"etymology":{"value":"1952年にウィリアム・H・ホワイト・ジュニアによって造られた言葉で、ジョージ・オーウェルの小説『1984年』に登場する「doublethink（二重思考）」からの類推。社会心理学者のアーヴィング・ジャニスが1970年代にこの概念を広めた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡruːpθɪŋk/","syllables":"group-think"},"inflection":{"notes":"可算名詞としても、不可算名詞としても使われる。"},"usage_notes":{"explanation":"「**groupthink**」は、集団の結束を重視するあまり、批判的思考や建設的な反対意見が抑圧される状況を指します。これは、意思決定の質を低下させ、誤った判断につながる可能性があります。特に、リーダーシップが強い場合や、外部からのプレッシャーがある場合に起こりやすいとされます。集団思考を避けるためには、意図的に多様な意見を求め、批判的な視点を奨励することが重要です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The team had a good groupthink and made a quick decision.","correct":"✓ The team suffered from groupthink and made a quick decision.","note":"「groupthink」は通常、否定的な意味合いで使われます。良い結果につながった場合は、集団思考が働いたとは言いません。"},{"incorrect":"✗ We need more groupthink in this project.","correct":"✓ We need more critical thinking in this project.","note":"集団思考は避けるべきものであり、批判的思考を促進する必要があります。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低い (Relatively low) - 専門的な文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**groupthink（集団思考）**」とは、グループで何かを決めるときに、みんなが同じ意見を持つことを優先して、反対意見や新しいアイデアが出にくくなる現象のことです。例えば、リーダーが強い意見を持っているときや、グループの雰囲気を壊したくないときに起こりやすくなります。集団思考になると、間違った決断をしてしまう可能性があるので、いろいろな意見を聞くことが大切です。ビジネスや政治など、重要な決断をする場面でよく議論される言葉です。"},"example_sentences":[{"sentence":"The company's failure was attributed to groupthink among the executives.","translation":"その会社の失敗は、経営幹部間の集団思考が原因だとされた。","type":"noun","meaning_category":"集団思考"},{"sentence":"She warned the team about the dangers of groupthink.","translation":"彼女はチームに集団思考の危険性について警告した。","type":"noun","meaning_category":"集団思考"},{"sentence":"Open discussion is crucial to preventing groupthink.","translation":"集団思考を防ぐためには、率直な議論が不可欠だ。","type":"noun","meaning_category":"集団思考"}]}