{"word":"arthrography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"関節造影法","english_definition":"radiographic examination of a joint after injection of a contrast medium","examples":[{"sentence":"Arthrography can help diagnose problems with the ligaments, cartilage, or other soft tissues within a joint.","translation":"関節造影法は、関節内の靭帯、軟骨、またはその他の軟部組織の問題を診断するのに役立ちます。"},{"sentence":"The doctor recommended arthrography to further investigate the knee pain.","translation":"医師は膝の痛みをさらに調べるために、関節造影法を勧めました。"}],"collocations":["knee arthrography (膝関節造影法)","shoulder arthrography (肩関節造影法)","direct arthrography (直接関節造影法)","indirect arthrography (間接関節造影法)","magnetic resonance arthrography (MR関節造影法)"],"synonyms":["arthrogram","joint imaging"],"antonyms":[]}],"etymology":{"value":"From 'arthro-' (joint) + '-graphy' (writing, recording).","priority":"★★☆"},"pronunciation":{"ipa":"/ɑːrˈθrɒɡrəfi/","syllables":"ar-thro-gra-phy"},"inflection":{"noun_plural":"arthrographies"},"usage_notes":{"explanation":"Arthrography involves injecting a contrast dye into a joint, followed by X-rays, CT scans, or MRI scans to visualize the joint's internal structures. While less common now due to advancements in MRI technology, it's still used in specific cases.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ arthography","correct":"✓ arthrography","note":"The correct spelling includes the 'r' after 'artho-'."}],"priority":"★★☆"},"related_words":{"derivatives":["arthrogram (関節造影写真)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Arthrography is a specialized medical imaging technique used to visualize the internal structures of a joint. It involves injecting a contrast agent into the joint space and then using X-rays, CT scans, or MRI to create images. This procedure is typically used to diagnose conditions affecting the ligaments, cartilage, and other soft tissues within the joint. While MRI has become more common, arthrography remains useful in certain situations. Understanding this term requires a familiarity with medical terminology and imaging procedures."},"example_sentences":[{"sentence":"The patient underwent arthrography to evaluate the extent of cartilage damage in the knee.","translation":"患者は膝の軟骨損傷の程度を評価するために、関節造影検査を受けた。","type":"general","meaning_category":"diagnosis"},{"sentence":"Magnetic resonance arthrography provided detailed images of the shoulder joint.","translation":"MR関節造影法は肩関節の詳細な画像を提供した。","type":"specific","meaning_category":"imaging technique"}]}