{"word":"trachoma","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"トラコーマ (眼の感染症)","english_definition":"A chronic, contagious bacterial infection of the eye characterized by inflammation and scarring of the conjunctiva and cornea, leading to blindness if left untreated.","examples":[{"sentence":"Trachoma is a leading cause of preventable blindness worldwide.","translation":"トラコーマは世界中で予防可能な失明の主要な原因です。"},{"sentence":"Early treatment with antibiotics can prevent the progression of trachoma.","translation":"抗生物質による早期治療は、トラコーマの進行を防ぐことができます。"},{"sentence":"Improved sanitation and hygiene practices are crucial for controlling the spread of trachoma.","translation":"衛生状態と衛生習慣の改善は、トラコーマの蔓延を抑制するために重要です。"}],"collocations":["active trachoma","trachoma control","trachoma elimination","trachoma prevalence","trachoma infection","trachoma surgery"],"synonyms":["granular conjunctivitis","Egyptian ophthalmia"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek τράχωμα (trákhōma), from τραχύς (trakhús, \"rough\"), referring to the roughened appearance of the inner eyelid.","priority":"★★☆"},"pronunciation":{"ipa":"/trəˈkoʊmə/","syllables":"tra-cho-ma"},"inflection":{"noun_plural":"trachomas"},"usage_notes":{"explanation":"Trachoma is a neglected tropical disease (NTD) caused by the bacterium Chlamydia trachomatis. It is the world's leading cause of infectious blindness. The SAFE strategy (Surgery, Antibiotics, Facial cleanliness, and Environmental improvement) is used to control and eliminate trachoma.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Trachoma is caused by a virus.","correct":"✓ Trachoma is caused by bacteria.","note":"Trachoma is caused by the bacterium Chlamydia trachomatis, not a virus."},{"incorrect":"✗ Trachoma only affects adults.","correct":"✓ Trachoma commonly affects children.","note":"Trachoma is most common in children, although it can affect people of all ages."}],"priority":"★★☆"},"related_words":{"derivatives":["trachomatous (adjective)"],"phrasal_verbs":[],"related_medical_terms":["conjunctivitis","corneal ulcer","blindness","Chlamydia trachomatis","SAFE strategy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Trachoma' is a specialized medical term referring to a specific eye disease. Understanding its causes, prevention, and treatment requires knowledge of medical terminology and public health strategies. The term is primarily used in medical and public health contexts.","note":"This explanation is tailored for advanced learners due to the specialized nature of the term."},"example_sentences":[{"sentence":"The World Health Organization is working to eliminate trachoma as a public health problem.","translation":"世界保健機関は、トラコーマを公衆衛生上の問題として撲滅するために取り組んでいます。","type":"general","meaning_category":"Definition"},{"sentence":"Repeated trachoma infections can lead to irreversible blindness.","translation":"トラコーマの感染を繰り返すと、不可逆的な失明につながる可能性があります。","type":"medical","meaning_category":"Definition"},{"sentence":"The SAFE strategy is an effective approach to trachoma control.","translation":"SAFE戦略は、トラコーマの制御に効果的なアプローチです。","type":"medical","meaning_category":"Treatment"}]}