{"word":"Underwriters","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(保険の)引受業者、(株式・債券の)引受会社","english_definition":"Companies or individuals that assess and assume financial risk, typically in insurance or securities offerings.","examples":[{"sentence":"The underwriters assessed the risk before issuing the insurance policy.","translation":"引受業者は保険証書を発行する前にリスクを評価しました。"},{"sentence":"The investment bank acted as underwriters for the company's initial public offering.","translation":"その投資銀行は、会社の新規株式公開の引受会社として活動しました。"}],"collocations":["insurance underwriters (保険引受業者)","securities underwriters (証券引受会社)","lead underwriters (主幹事引受会社)"],"synonyms":["guarantors","insurers","backers","sponsors"],"antonyms":[],"notes":"Underwriters are crucial in the financial industry, evaluating risk and providing capital."}],"etymology":{"value":"The term originates from the practice of individuals (typically merchants or financiers) signing their names under the amount of risk they were willing to take on a shipping venture. They were literally 'under' the 'writers' of the policy.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌndəˌraɪtərz/","syllables":"un-der-writ-ers"},"inflection":{"noun_plural":"Underwriters"},"usage_notes":{"explanation":"'Underwriters' refers to entities (usually companies, but sometimes individuals) that evaluate and assume financial risks. The term is commonly used in the context of insurance (where underwriters assess the risk of insuring something or someone) and securities (where underwriters guarantee the sale of newly issued stocks or bonds).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The underwriter decided to underwrite the loan.","correct":"✓ The underwriter decided to underwrite the loan.","note":"This is grammatically correct but could be clearer. Consider: 'The underwriter approved the loan.'"},{"incorrect":"✗ The underwriter is under writing the policy.","correct":"✓ The underwriter is underwriting the policy.","note":"'Underwriting' is one word when used as a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["underwrite (verb: 引き受ける、保証する)","underwriting (noun: 引き受け、保証)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Underwriters' are companies or individuals who assess and take on financial risks. You'll often hear this term in the context of insurance, where they decide whether to insure something, or in the stock market, where they help companies sell new stocks. It's a specialized term, so it's more common in business or finance discussions."},"example_sentences":[{"sentence":"The **underwriters** carefully reviewed the loan application.","translation":"引受業者は融資申請を注意深く審査しました。","type":"general","meaning_category":"financial"},{"sentence":"Experienced **underwriters** are essential for assessing risk in the insurance industry.","translation":"経験豊富な引受業者は、保険業界におけるリスク評価に不可欠です。","type":"insurance","meaning_category":"insurance"},{"sentence":"The **underwriters** priced the new bond offering attractively to ensure its success.","translation":"引受会社は、新規債券の発行を成功させるために魅力的な価格設定をしました。","type":"securities","meaning_category":"securities"}]}