{"word":"Wertherism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ウェルテル効果：ゲーテの小説『若きウェルテルの悩み』に触発された模倣自殺の現象","english_definition":"An instance of imitative suicide, following a widely publicized suicide, especially that of a celebrity. The term originates from Goethe's novel 'The Sorrows of Young Werther', in which the protagonist commits suicide.","examples":[{"sentence":"The media must be cautious when reporting suicides to avoid triggering Wertherism.","translation":"メディアはウェルテル効果を引き起こさないように、自殺報道には慎重でなければならない。"},{"sentence":"Studies have shown a correlation between celebrity suicides and an increase in Wertherism among vulnerable individuals.","translation":"研究により、著名人の自殺と、脆弱な人々におけるウェルテル効果の増加との間に相関関係があることが示されている。"}],"collocations":["prevent Wertherism (ウェルテル効果を防ぐ)","trigger Wertherism (ウェルテル効果を引き起こす)","media coverage of Wertherism (ウェルテル効果に関するメディア報道)","Wertherism in teenagers (ティーンエイジャーにおけるウェルテル効果)"],"synonyms":["copycat suicide","suicide contagion","imitative suicide cluster"],"antonyms":[]},{"part_of_speech":"noun","definition":"『若きウェルテルの悩み』に登場するウェルテルのような、過度に感情的な、または感傷的な性格特性","english_definition":"A character trait of being excessively emotional or sentimental, like Werther in 'The Sorrows of Young Werther'.","examples":[{"sentence":"His Wertherism made him prone to dramatic outbursts of emotion.","translation":"彼のウェルテル的な性格は、彼を感情の劇的な爆発を起こしやすくした。"},{"sentence":"She found his Wertherism endearing at first, but it eventually became tiresome.","translation":"彼女は最初、彼のウェルテル的な性格を愛らしく思ったが、最終的にはうんざりするようになった。"}],"collocations":["display Wertherism (ウェルテル的な性格を示す)","Wertherism in literature (文学におけるウェルテル的な性格)"],"synonyms":["sentimentality","emotionalism","melancholy","romanticism"],"antonyms":["stoicism","apathy","detachment"]}],"etymology":{"value":"ゲーテの1774年の小説『若きウェルテルの悩み』(Die Leiden des jungen Werthers)に由来。主人公のウェルテルが失恋の苦しみから自殺する物語であり、出版後、ヨーロッパ各地で模倣自殺が多発したことが語源。David Phillips が1974年にこの現象を「ウェルテル効果」と名付けた。","priority":"★★★"},"pronunciation":{"ipa":"/ˈvɜːrθərɪzəm/","syllables":"Wer-ther-ism"},"inflection":{"noun_plural":"Wertherisms"},"usage_notes":{"explanation":"「**Wertherism**」は、主に2つの意味で使用されます。\n\n1.  **ウェルテル効果（模倣自殺）**: メディア報道や物語の影響を受け、自殺が連鎖的に発生する現象を指します。特に、著名人の自殺報道後に起こりやすいとされています。報道機関は、詳細な自殺方法の記述を避け、相談窓口の情報を掲載するなど、ウェルテル効果を抑制するよう努める必要があります。\n\n2.  **ウェルテルのような性格**: 『若きウェルテルの悩み』の主人公ウェルテルのように、過度に感情的、感傷的、メランコリックな性格特性を指します。この意味での使用は、より文学的または心理学的な文脈で見られます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He suffered from Wertherism and needed medical attention.","correct":"✓ He was at risk of Wertherism and needed psychological support.","note":"「Wertherism」は病名ではありません。自殺念慮に影響を受けやすい状態を指すため、「at risk of Wertherism」のように表現します。"},{"incorrect":"✗ The novel caused Wertherism in the population.","correct":"✓ The novel contributed to Wertherism in the population.","note":"小説がウェルテル効果の「原因」となるのではなく、「一因」となる、または「影響を与えた」と表現する方が適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Werther effect (ウェルテル効果)","Wertherian (ウェルテル的な)"],"phrases":["copycat suicide","suicide contagion","imitative suicide"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語に近い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Wertherism**」は、少し専門的な言葉で、ゲーテの小説『若きウェルテルの悩み』に由来します。主に二つの意味があります。一つは、小説の主人公ウェルテルのように、感情的で感傷的な性格を表す言葉です。もう一つは、メディアの自殺報道などがきっかけで、自殺が連鎖的に起こる「ウェルテル効果」を指します。メディアは、この効果を避けるために、自殺報道に注意を払う必要があります。日常会話ではあまり使いませんが、心理学やメディア研究などの分野で使われることがあります。"},"example_sentences":[{"sentence":"The suicide of the celebrity sparked concerns about Wertherism.","translation":"その有名人の自殺は、ウェルテル効果への懸念を引き起こした。","type":"noun","meaning_category":"ウェルテル効果"},{"sentence":"His Wertherism was evident in his overly dramatic poetry.","translation":"彼のウェルテル的な性格は、彼の過度に劇的な詩に明らかだった。","type":"noun","meaning_category":"ウェルテルのような性格"},{"sentence":"Public health officials are working to prevent Wertherism following the recent cluster of suicides.","translation":"公衆衛生当局は、最近の自殺の多発を受けて、ウェルテル効果を防ぐために活動している。","type":"noun","meaning_category":"ウェルテル効果"}]}