{"word":"Vril","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"（架空の）生命力、エネルギー源、または物質。エドワード・ブルワー＝リットン卿の小説『来るべき種族』(1871)に登場する。","english_definition":"(fictional) A form of energy, life force, or substance described in Edward Bulwer-Lytton's novel *Vril, the Power of the Coming Race* (1871).","examples":[{"sentence":"In Bulwer-Lytton's novel, Vril is a powerful force wielded by an advanced subterranean race.","translation":"ブルワー＝リットンの小説では、ヴリルは高度な地下種族によって行使される強力な力である。"},{"sentence":"Some esoteric groups have adopted the concept of Vril, believing it to be a real source of power.","translation":"一部の秘教団体は、ヴリルの概念を採用し、それを現実の力の源であると信じている。"}],"collocations":["Vril energy","Vril society","Vril power","harness Vril"],"synonyms":["life force","energy","élan vital"],"antonyms":["N/A - fictional concept"]},{"part_of_speech":"固有名詞","definition":"（歴史的な、または架空の）ヴリル協会。19世紀末から20世紀初頭にかけて、ドイツの神秘主義者やオカルト信奉者の間で噂された秘密結社。","english_definition":"(historical or fictional) The Vril Society; a purported secret society of German mystics and occultists active in the late 19th and early 20th centuries.","examples":[{"sentence":"The Vril Society is often associated with Nazi occultism and UFO conspiracy theories.","translation":"ヴリル協会は、しばしばナチスのオカルト主義やUFO陰謀論と関連付けられる。"},{"sentence":"There is little historical evidence to support the existence of the Vril Society.","translation":"ヴリル協会の存在を裏付ける歴史的証拠はほとんどない。"}],"collocations":["Vril Gesellschaft","Vril-Gesellschaft","Nazi occultism","Thule Society"],"synonyms":["N/A - proper noun"],"antonyms":["N/A - proper noun"]}],"etymology":{"value":"エドワード・ブルワー＝リットン卿が、彼の小説『来るべき種族』(1871)の中で造語した言葉。語源は不明だが、リットン自身は古代言語からインスピレーションを得たと述べている。","priority":"★★☆"},"pronunciation":{"ipa":"/vrɪl/","syllables":"vril"},"inflection":{"noun_plural":"Vrils (まれに)"},"usage_notes":{"explanation":"「Vril」は、主にフィクションの世界に存在する概念です。エドワード・ブルワー＝リットンの小説に登場する強力なエネルギー源、またはそれを操る種族を指します。また、歴史的な信憑性は低いものの、ナチスのオカルト主義と関連付けられる「ヴリル協会」という秘密結社の名前としても知られています。現代では、陰謀論やファンタジー作品に登場することがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Vril is a scientific term for electricity.","correct":"✓ Vril is a fictional energy source from a novel.","note":"Vrilは科学的な用語ではなく、小説に登場する架空の概念です。"},{"incorrect":"✗ The Vril Society was a real Nazi organization.","correct":"✓ The Vril Society is a purported secret society, but its historical existence is doubtful.","note":"ヴリル協会は、ナチスと関連付けられることが多いですが、その存在を裏付ける確固たる証拠はありません。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Vril-ya (ヴリルを操る種族)"],"idioms_phrases":["N/A - fictional concept"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A - 専門用語/架空の概念","frequency_google_ngram":"低頻度 (Low frequency) - 主に文学、オカルト、陰謀論関連の文脈で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Vril**」は、エドワード・ブルワー＝リットン卿の小説『来るべき種族』に登場する架空のエネルギー源または生命力を指す言葉です。また、歴史的な信憑性は低いものの、ナチスのオカルト主義と関連付けられる「ヴリル協会」という秘密結社の名前としても知られています。一般的には、フィクション、陰謀論、またはオカルト関連の文脈でのみ使用される専門用語です。日常会話で使用されることはほとんどありません。"},"example_sentences":[{"sentence":"The novel describes a subterranean race that controls the mysterious power of **Vril**.","translation":"その小説は、謎めいたヴリルの力を操る地下種族について描写している。","type":"noun","meaning_category":"架空の生命力"},{"sentence":"Some believe the **Vril Society** sought to harness this energy for world domination.","translation":"ヴリル協会は、このエネルギーを世界征服のために利用しようとしたと信じる人もいる。","type":"proper noun","meaning_category":"ヴリル協会"}]}