{"word":"Orey-eyed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having eyes that are rimmed or surrounded by a dark or discolored area, resembling the markings around the eyes of an oreo cookie.","english_definition":"Having dark circles or discoloration around the eyes.","examples":[{"sentence":"She looked tired and Orey-eyed after pulling an all-nighter.","translation":"徹夜明けで、彼女は疲れてオレオのような目の周りをしていた。"},{"sentence":"The lack of sleep made him look Orey-eyed and exhausted.","translation":"睡眠不足で、彼はオレオのような目の周りをしていて、疲れ切っているように見えた。"}],"collocations":["Orey-eyed look","Orey-eyed appearance","look Orey-eyed"],"synonyms":["dark circles under eyes","puffy eyes","tired eyes","raccoon eyes"],"antonyms":["bright-eyed","alert","rested"],"notes":"This term is informal and playful, referencing the appearance of dark circles around the eyes resembling the dark filling of an Oreo cookie."}],"etymology":{"value":"The term is a playful, descriptive neologism combining 'Oreo' (a popular cookie with a dark outer layer and a light filling) and 'eyed' (having eyes). It suggests that the area around the eyes resembles the dark outer layer of an Oreo cookie.","priority":"N/A"},"pronunciation":{"ipa":"/ˈɔːriˌaɪd/","syllables":"O-rey-eyed"},"inflection":{"adjective_forms":{"comparative":"more Orey-eyed","superlative":"most Orey-eyed"}},"usage_notes":{"explanation":"'Orey-eyed' is a descriptive adjective used informally to describe the appearance of dark circles or discoloration around the eyes, reminiscent of the dark outer layers of an Oreo cookie. It is often used to imply tiredness, lack of sleep, or stress.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a orey-eyed dog.","correct":"✓ He looked Orey-eyed after the long flight.","note":"'Orey-eyed' specifically refers to the appearance of dark circles around the eyes, not the color of the eyes themselves or any other characteristic."}],"priority":"N/A"},"related_words":{"derivatives":[],"related_terms":["raccoon eyes","dark circles","puffy eyes"],"notes":"The term is related to other informal terms describing the appearance of the eyes, particularly when tired or lacking sleep."},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - This is a relatively new and informal term, so it is not commonly found in formal writing or speech.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Orey-eyed' is an informal and descriptive term used to describe dark circles around the eyes, resembling the dark outer layers of an Oreo cookie. It is a playful and relatively new term, so it may not be widely recognized. It is used to imply tiredness or lack of sleep. Understanding the reference to Oreo cookies is essential to understanding the meaning of the term."},"example_sentences":[{"sentence":"After the sleepless night, she looked completely Orey-eyed.","translation":"寝不足の夜の後、彼女は完全にオレオのような目の周りをしていた。","type":"adjective","meaning_category":"Appearance"},{"sentence":"He tried to cover up his Orey-eyed look with concealer.","translation":"彼はコンシーラーでオレオのような目の周りを隠そうとした。","type":"adjective","meaning_category":"Appearance"}]}