{"word":"intortion","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(眼科学)眼球の内方回旋、内旋","english_definition":"(ophthalmology) inward rotation of the eyeball around the visual axis; also called incyclotorsion or incycloduction.","examples":[{"sentence":"Intortion of the right eye can compensate for excyclotorsion of the left eye to maintain binocular vision.","translation":"右眼の内方回旋は、両眼視を維持するために左眼の外方回旋を補償することができる。"},{"sentence":"Excessive intortion may indicate a problem with the superior oblique muscle.","translation":"過度の内方回旋は、上斜筋の問題を示唆する可能性がある。"}],"collocations":["ocular intortion","cyclotorsion","eye intortion"],"synonyms":["incyclotorsion","incycloduction"],"antonyms":["extortion","excyclotorsion"]}],"etymology":{"value":"From Latin *in-* (inward) + *tortio* (a twisting), from *torquere* (to twist).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈtɔːrʃən/","syllables":"in-tor-tion"},"inflection":{"noun_plural":"intortions"},"usage_notes":{"explanation":"'Intortion' is a technical term used in ophthalmology to describe the inward or nasal rotation of the eye. It's the opposite of 'extortion', which is outward rotation. The terms are used to describe and diagnose certain eye conditions and muscle imbalances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient complained of intortion after the surgery.","correct":"✓ The patient complained of diplopia (double vision) after the surgery, possibly due to intortion.","note":"Patients don't typically 'complain of intortion' directly, as it is a clinical finding. They might complain of symptoms like double vision, which could be caused by intortion."}],"priority":"★☆☆"},"related_words":{"derivatives":["intorted (adjective)"],"related_terms":["excyclotorsion","cyclotorsion","hypertropia","hypotropia","strabismus"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Intortion' is a highly specialized term primarily used within the field of ophthalmology. Understanding this term requires a strong background in anatomy and physiology, specifically related to the muscles controlling eye movement and binocular vision. It is unlikely to be encountered outside of medical contexts."},"example_sentences":[{"sentence":"The ophthalmologist observed significant intortion in the patient's left eye during the examination.","translation":"眼科医は診察中に患者の左眼に著しい内方回旋を観察した。","type":"technical","meaning_category":"ophthalmology"},{"sentence":"Surgical correction may be necessary to address severe cases of intortion and restore proper alignment.","translation":"重度の内方回旋を治療し、適切なアライメントを回復するためには、外科的矯正が必要になる場合がある。","type":"medical","meaning_category":"treatment"}]}