{"word":"public-influenced","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"影響を受けた","english_definition":"Influenced or affected by the public or public opinion.","examples":[{"sentence":"The politician's decision was public-influenced, reflecting the concerns of the voters.","translation":"政治家の決定は世論の影響を受けており、有権者の懸念を反映していた。"},{"sentence":"The company's new policy is public-influenced, aiming to improve its image.","translation":"同社の新しいポリシーは世論の影響を受けており、イメージ向上を目指している。"}],"collocations":["public-influenced decision","public-influenced policy","public-influenced opinion"],"synonyms":["community-driven","popularly-influenced","voter-driven"],"antonyms":["privately-determined","self-motivated","independent"],"notes":"This term is often used to describe decisions or policies that are shaped by public opinion or pressure. It indicates that the public has played a significant role in influencing the outcome."}],"etymology":{"value":"Combination of 'public' and 'influenced'. 'Public' refers to the general population, and 'influenced' means affected or changed by someone or something.","priority":"low"},"pronunciation":{"ipa":"/ˈpʌblɪk ˈɪnfluənst/","syllables":"pub-lic in-flu-enced"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Public-influenced' is used to describe something that has been affected or shaped by public opinion, sentiment, or pressure. It suggests that the public has had a role in determining the outcome or direction of a decision, policy, or action.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The decision was public influenced.","correct":"The decision was public-influenced.","note":"Hyphenate 'public' and 'influenced' when used as a compound adjective before a noun."}],"priority":"low"},"related_words":{"derivatives":["influence","public","public opinion"],"phrases":["influenced by the public","responsive to public opinion"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Not a common term, but understandable in context.","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'public-influenced' describes something that has been affected or shaped by the views, opinions, or actions of the general public. It is used to indicate that the public has had a significant role in determining the outcome of a decision, policy, or action. This term is more commonly used in formal or academic contexts when discussing the impact of public opinion on various aspects of society."},"example_sentences":[{"sentence":"The revised budget was public-influenced, incorporating suggestions from community meetings.","translation":"修正された予算は世論の影響を受けており、地域社会の会議からの提案を取り入れている。","type":"adjective","meaning_category":"世論の影響を受けた"},{"sentence":"The new law is public-influenced, aiming to address the concerns raised by citizens.","translation":"新しい法律は世論の影響を受けており、市民から提起された懸念に対処することを目指している。","type":"adjective","meaning_category":"世論の影響を受けた"}]}