{"word":"goniocraniometry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"頭蓋骨の角度測定法、頭蓋骨の形態を角度で分析する計測学","english_definition":"The measurement of angles of the skull; the craniometric study of the angles of the skull.","examples":[{"sentence":"Goniocraniometry is used in anthropology to study variations in skull shape.","translation":"頭蓋骨角度計測法は、人類学において頭蓋骨の形状の変動を研究するために用いられる。"},{"sentence":"The researchers used goniocraniometry to compare skull angles between different populations.","translation":"研究者たちは、異なる集団間で頭蓋骨の角度を比較するために頭蓋骨角度計測法を用いた。"}],"collocations":["perform goniocraniometry","apply goniocraniometry","use goniocraniometry in research"],"synonyms":["craniometry","cephalometry"],"antonyms":[]}],"etymology":{"value":"Derived from 'gonio-' (angle), 'cranio-' (skull), and '-metry' (measurement).","priority":"★★★"},"pronunciation":{"ipa":"ˌɡoʊniːoʊˌkreɪniːˈɒmətri","syllables":"go-ni-o-cra-ni-o-me-try"},"inflection":{"noun_plural":"goniocraniometries"},"usage_notes":{"explanation":"Goniocraniometry is a specialized term primarily used within the fields of anthropology, anatomy, and occasionally forensic science. It refers to the specific technique of measuring angles on the skull to analyze its morphology. This method can be used to compare skull shapes across different populations, study evolutionary changes, or assist in identifying individuals based on skeletal remains.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ goniocranometry","correct":"✓ goniocraniometry","note":"Ensure the correct spelling, as the word is quite long and prone to errors."},{"incorrect":"✗ goniocraniometry is a study of skull size.","correct":"✓ goniocraniometry is a study of skull angles.","note":"Goniocraniometry specifically measures angles, not overall size."}],"priority":"★★☆"},"related_words":{"derivatives":["goniocraniometric (adjective)"],"phrases":[]},"level_frequency":{"frequency_google_ngram":"Very low frequency - Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Goniocraniometry' is a highly specialized term used in anthropology and related fields. It involves the precise measurement of angles on the skull to analyze its shape and structure. Understanding this term requires familiarity with anatomical terminology and craniometric techniques. Due to its niche usage, it is not commonly encountered outside of academic or research contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The anthropologist used **goniocraniometry** to analyze the ancient skull.","translation":"人類学者は、古代の頭蓋骨を分析するために頭蓋骨角度計測法を用いた。","type":"general","meaning_category":"definition"},{"sentence":"**Goniocraniometry** can help determine the biological ancestry of skeletal remains.","translation":"頭蓋骨角度計測法は、骨格遺骸の生物学的祖先を特定するのに役立つ。","type":"application","meaning_category":"application"}]}