{"word":"Sternocleidomastoid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"胸鎖乳突筋（きょうさにゅうとつきん）","english_definition":"A muscle in the neck that is responsible for flexing and rotating the head.","examples":[{"sentence":"The sternocleidomastoid muscle allows you to turn your head.","translation":"胸鎖乳突筋によって、あなたは頭を回すことができます。"},{"sentence":"Tightness in the sternocleidomastoid can cause headaches.","translation":"胸鎖乳突筋の緊張は頭痛の原因となることがあります。"}],"collocations":["sternocleidomastoid muscle","SCM muscle","sternocleidomastoid pain","sternocleidomastoid stretch"],"synonyms":["SCM (abbreviation)"],"antonyms":[]}],"etymology":{"value":"The name 'sternocleidomastoid' is derived from its points of origin: 'sterno-' refers to the sternum (breastbone), 'cleido-' refers to the clavicle (collarbone), and 'mastoid' refers to the mastoid process of the temporal bone (behind the ear).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌstɜːrnoʊˌklaɪdoʊˈmæstɔɪd/","syllables":"ster-no-clei-do-mas-toid"},"inflection":{"noun_plural":"sternocleidomastoids"},"usage_notes":{"explanation":"The sternocleidomastoid muscle is a prominent muscle on each side of the neck. It plays a key role in head movement and posture. It is often abbreviated as SCM.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ sternocleidomastoid muscle is in the arm.","correct":"✓ The sternocleidomastoid muscle is in the neck.","note":"The sternocleidomastoid is located in the neck, not the arm."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["muscle","anatomy","neck","sternum","clavicle","mastoid process"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Technical/Medical Vocabulary)","frequency_google_ngram":"Low frequency - Primarily used in medical or anatomical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sternocleidomastoid' is a technical term referring to a specific muscle in the neck. It is not commonly used in everyday conversation but is important in medical and anatomical contexts. Understanding its function and location is crucial for healthcare professionals.","note":"This word is highly specialized and unlikely to be encountered outside of specific fields."},"example_sentences":[{"sentence":"The doctor examined the patient's sternocleidomastoid for signs of tension.","translation":"医師は患者の胸鎖乳突筋を診察し、緊張の兆候がないか確認した。","type":"noun","meaning_category":"anatomy"},{"sentence":"Stretching the sternocleidomastoid can help relieve neck pain.","translation":"胸鎖乳突筋をストレッチすることで、首の痛みを和らげることができます。","type":"noun","meaning_category":"anatomy"}]}