{"word":"fat-detecting","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Capable of detecting the presence or amount of fat.","english_definition":"Able to identify or measure the quantity of fat in something.","examples":[{"sentence":"The new sensor is fat-detecting, allowing for precise measurements in food processing.","translation":"その新しいセンサーは脂肪検出が可能で、食品加工における正確な測定を可能にする。"},{"sentence":"Scientists are developing fat-detecting technology for use in medical diagnostics.","translation":"科学者たちは医療診断で使用するための脂肪検出技術を開発している。"}],"collocations":["fat-detecting sensor","fat-detecting technology","fat-detecting device","fat-detecting ability"],"synonyms":["lipid-detecting","oil-detecting"],"antonyms":["N/A"]}],"etymology":{"value":"Combination of 'fat' (referring to lipids) and 'detecting' (identifying or sensing).","priority":"N/A"},"pronunciation":{"ipa":"/ˈfæt dɪˈtektɪŋ/","syllables":"fat-de-tect-ing"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'fat-detecting' is generally used in technical or scientific contexts to describe devices, sensors, or technologies that can identify or measure the amount of fat present in a substance. It is often used in the food industry, medical diagnostics, and environmental monitoring.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["detect","detection"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'fat-detecting' is a technical term used to describe something that can identify or measure fat. It is typically found in scientific or technical contexts. Understanding requires knowledge of both 'fat' and 'detecting' and the ability to combine them to understand the overall meaning."},"example_sentences":[{"sentence":"The company developed a fat-detecting system to improve quality control in their dairy production.","translation":"その会社は、乳製品生産における品質管理を改善するために、脂肪検出システムを開発した。","type":"adjective","meaning_category":"detecting fat"},{"sentence":"This fat-detecting probe can quickly analyze the composition of various food samples.","translation":"この脂肪検出プローブは、さまざまな食品サンプルの組成を迅速に分析できる。","type":"adjective","meaning_category":"detecting fat"}]}