{"word":"Jacobean","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ジェームズ1世時代の、ジェームズ1世風の","english_definition":"relating to the reign of James I of England (1603-1625).","examples":[{"sentence":"Jacobean drama is known for its dark themes.","translation":"ジェームズ1世時代の演劇は、その暗いテーマで知られています。"},{"sentence":"The house features Jacobean architecture.","translation":"その家はジェームズ1世時代の建築様式を特徴としています。"}],"collocations":["Jacobean drama","Jacobean architecture","Jacobean period","Jacobean style"],"synonyms":["Stuart","Elizabethan (preceding period)"],"antonyms":["Georgian (later period)","Victorian (later period)"]},{"part_of_speech":"noun","definition":"ジェームズ1世時代の人","english_definition":"a person who lived during the reign of James I of England.","examples":[{"sentence":"The Jacobeans were known for their elaborate court life.","translation":"ジェームズ1世時代の人々は、その手の込んだ宮廷生活で知られていました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin *Jacobus*, the Latinized form of James, referring to King James I of England.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒækəˈbiːən/","syllables":"Ja-co-be-an"},"inflection":{"notes":"The word 'Jacobean' does not typically inflect, as it is primarily an adjective or a noun referring to a period or people."},"usage_notes":{"explanation":"'Jacobean' refers specifically to the period in English and Scottish history during the reign of James I of England (who was also James VI of Scotland). It is often used in the context of art, literature, architecture, and furniture. It follows the Elizabethan era and precedes the Caroline era (reign of Charles I).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The play was written in Jacobian style.","correct":"✓ The play was written in Jacobean style.","note":"Common misspelling. Ensure the correct spelling with 'o' before 'b'."}],"priority":"★★☆"},"related_words":{"derivatives":["Jacobite (related to the supporters of James II and his descendants)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, used primarily in academic or historical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Jacobean' is a term used in history, literature, and art history to describe things related to the reign of King James I of England. It is not a commonly used word in everyday conversation, but it is important to know if you are studying English history or literature from that period. It's often contrasted with the preceding Elizabethan era and the subsequent Caroline era."},"example_sentences":[{"sentence":"Shakespeare wrote some of his most famous tragedies during the Jacobean period.","translation":"シェイクスピアは、ジェームズ1世時代に最も有名な悲劇のいくつかを書きました。","type":"adjective","meaning_category":"relating to the reign of James I"},{"sentence":"Many examples of Jacobean furniture can be found in museums.","translation":"多くのジェームズ1世時代の家具の例が博物館で見られます。","type":"adjective","meaning_category":"relating to the reign of James I"},{"sentence":"The Jacobeans had a different worldview compared to the Elizabethans.","translation":"ジェームズ1世時代の人々は、エリザベス朝の人々とは異なる世界観を持っていました。","type":"noun","meaning_category":"people during the reign of James I"}]}