{"word":"Indocility","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不従順、言うことを聞かないこと、手に負えないこと","english_definition":"The quality or state of being unwilling to be taught or led; stubborn resistance to instruction or discipline; unmanageableness.","examples":[{"sentence":"The indocility of the students made it difficult for the teacher to maintain order.","translation":"生徒たちの不従順さにより、先生は秩序を維持するのが困難だった。"},{"sentence":"His indocility was a constant source of frustration for his parents.","translation":"彼の不従順さは、両親にとって常に不満の種だった。"},{"sentence":"The horse's indocility made it unsuitable for novice riders.","translation":"その馬の手に負えなさは、初心者のライダーには不向きだった。"}],"collocations":["show indocility","inherent indocility","overcome indocility","display indocility"],"synonyms":["stubbornness","recalcitrance","obstinacy","intractability","unruliness","disobedience","defiance"],"antonyms":["docility","obedience","tractability","compliance","submissiveness"]}],"etymology":{"value":"Derived from the Latin word \"indocilis,\" meaning \"not easily taught,\" which is composed of \"in-\" (not) + \"docilis\" (easily taught). \"Docilis\" comes from \"docere\" (to teach).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪndəˈsɪləti","syllables":"in-do-cil-i-ty"},"inflection":{"noun_plural":"Indocilities (rarely used)"},"usage_notes":{"explanation":"\"Indocility\" refers to a persistent unwillingness or inability to be taught, guided, or controlled. It suggests a deep-seated resistance to instruction or authority. The term is often used in contexts involving education, training, or management, where cooperation and willingness to learn are expected.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed indocility to the rules.","correct":"✓ He showed indocility by breaking the rules. / ✓ He showed indocility in his behavior.","note":"\"Indocility\" is a quality or state, not an action directed *to* something. It's better to say someone *shows* indocility *by* doing something or *in* their behavior."},{"incorrect":"✗ The indocility child was punished.","correct":"✓ The indocile child was punished.","note":"\"Indocility\" is a noun. The adjective form is \"indocile.\""}],"priority":"★★☆"},"related_words":{"derivatives":["indocile (adjective: unwilling to be taught or led; stubborn)","docile (adjective: easily taught or led; compliant)","docility (noun: the quality of being easily taught or led; compliance)"],"antonyms":["docile (adjective: easily taught or led; compliant)","docility (noun: the quality of being easily taught or led; compliance)"],"related_concepts":["rebellion","insubordination","noncompliance","defiance","resistance"]},"level_frequency":{"CEFR":"C2 (Rare and formal)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Indocility\" is a formal and relatively rare word that describes the quality of being unwilling to be taught or led. It implies a stubborn resistance to instruction or discipline. You might encounter this word in academic texts, historical accounts, or discussions about education or management. It's the opposite of \"docility,\" which means being easily taught or led. Understanding this word requires a good vocabulary and familiarity with abstract concepts related to behavior and learning."},"example_sentences":[{"sentence":"The trainer struggled with the horse's inherent indocility.","translation":"調教師はその馬の生来の不従順さに苦労した。","type":"general","meaning_category":"不従順"},{"sentence":"The government faced widespread indocility from citizens refusing to comply with the new regulations.","translation":"政府は、新しい規制に従うことを拒否する市民からの広範囲な不従順に直面した。","type":"general","meaning_category":"不従順"},{"sentence":"Despite his intelligence, his indocility prevented him from succeeding in the structured environment of the school.","translation":"彼の知性にもかかわらず、彼の不従順さは、学校の構造化された環境で成功することを妨げた。","type":"general","meaning_category":"不従順"}]}