{"word":"cenospecies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学)交雑可能な種群、交雑種群","english_definition":"(biology) a group of species that can interbreed to some extent; a group of species capable of exchanging genes through hybridization.","examples":[{"sentence":"The genus *Brassica* is a well-known example of a cenospecies, with various species like cabbage, broccoli, and cauliflower capable of interbreeding.","translation":"アブラナ属は、キャベツ、ブロッコリー、カリフラワーなどの様々な種が交雑可能であることでよく知られる交雑種群の例です。"}],"collocations":["belong to a cenospecies (交雑種群に属する)","form a cenospecies (交雑種群を形成する)","cenospecies complex (交雑種群複合体)"],"synonyms":["comparium","syngameon","interbreeding group"],"antonyms":["allospecies","biological species"],"notes":"The concept of cenospecies is useful in understanding plant evolution and crop breeding."}],"etymology":{"value":"The term 'cenospecies' is derived from the Greek words 'κοινός' (koinós), meaning 'common' or 'shared,' and 'species.' It reflects the shared genetic material among species within the group due to their ability to interbreed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsiːnoʊˈspiːʃiːz/","syllables":"ce-no-spe-cies"},"inflection":{"noun_plural":"cenospecies or cenospecieses"},"usage_notes":{"explanation":"The term 'cenospecies' is primarily used in botany and evolutionary biology. It emphasizes the potential for gene flow between different species through hybridization, which can complicate species definitions and lead to the evolution of new forms. The concept is particularly relevant in plant breeding, where interspecific hybridization is often used to introduce desirable traits from one species into another.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The two species are in different cenospecies, so they can interbreed easily.","correct":"✓ The two species are in the same cenospecies, so they can interbreed easily.","note":"Species in *different* cenospecies are generally reproductively isolated and cannot interbreed, or can only do so with great difficulty and resulting infertile offspring."}],"priority":"★☆☆"},"related_words":{"derivatives":["cenospecific (adjective)"],"related_concepts":["hybridization","introgression","species complex","gene flow","reproductive isolation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized term in biology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cenospecies' is a technical term used in biology to describe a group of different species that are still able to mate with each other and produce offspring to some extent. This term is especially useful in botany, where different species of plants can sometimes cross-pollinate. It helps scientists understand how new plant species can evolve and how genes can be shared between different but related plants. It's not a common word in everyday language, but it's important for understanding certain aspects of plant evolution and genetics."},"example_sentences":[{"sentence":"Several wild tomato species belong to the same cenospecies and can be crossed to improve cultivated varieties.","translation":"いくつかの野生トマト種は同じ交雑種群に属しており、栽培品種を改良するために交配することができます。","type":"scientific","meaning_category":"interbreeding group"},{"sentence":"Understanding the cenospecies relationships within the genus *Solanum* is crucial for effective breeding strategies.","translation":"ナス属内の交雑種群の関係を理解することは、効果的な育種戦略にとって非常に重要です。","type":"scientific","meaning_category":"interbreeding group"}]}