{"word":"treadling","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"足踏み操作、足踏み運動","english_definition":"The action or process of operating a treadle; the movement of the feet on a treadle.","examples":[{"sentence":"The rhythmic treadling of the sewing machine filled the room.","translation":"ミシンのリズミカルな足踏み操作が部屋に響いた。"},{"sentence":"She perfected her treadling technique to increase the speed of her weaving.","translation":"彼女は織りの速度を上げるために足踏み操作の技術を完成させた。"}],"collocations":["rhythmic treadling","smooth treadling","fast treadling","slow treadling"],"synonyms":["pedaling","footwork","stepping"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'treadle,' which comes from 'tread,' meaning to step or walk. The '-ing' suffix indicates an action or process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrɛdlɪŋ/","syllables":"tread-ling"},"inflection":{"noun_plural":"treadlings"},"usage_notes":{"explanation":"'Treadling' specifically refers to the action of using a treadle, which is a lever operated by the foot to power a machine. It is most commonly associated with sewing machines, looms, and other older mechanical devices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The treadling of the car was difficult.","correct":"✓ The pedaling of the car was difficult.","note":"'Treadling' is typically used for machines with treadles, not vehicles. Use 'pedaling' for vehicles like bicycles."}],"priority":"★★☆"},"related_words":{"derivatives":["treadle (noun: 足踏み板, verb: 足踏み操作する)","tread (verb: 踏む, 歩く, noun: 足どり, 接地面)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Treadling' is a specialized term referring to the action of operating a treadle, a foot-operated lever typically found on older machines like sewing machines or looms. Understanding this word requires familiarity with such mechanical devices. It is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The weaver's skilled treadling created intricate patterns in the fabric.","translation":"織り手の熟練した足踏み操作が、生地に複雑な模様を生み出した。","type":"noun","meaning_category":"足踏み操作"},{"sentence":"Consistent treadling is essential for maintaining a steady rhythm while sewing.","translation":"縫製中に安定したリズムを維持するには、一貫した足踏み操作が不可欠である。","type":"noun","meaning_category":"足踏み運動"}]}