{"word":"tercerai","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"intransitive","definition":"(Malay/Indonesian) to be divorced; to be separated (legally, as a married couple)","english_definition":"to be divorced; to have a marriage legally ended","examples":[{"sentence":"Pasangan itu akhirnya tercerai setelah bertahun-tahun mencoba memperbaiki hubungan mereka.","translation":"The couple finally divorced after years of trying to fix their relationship."},{"sentence":"Dia merasa sedih ketika mengetahui bahwa orang tuanya akan tercerai.","translation":"He felt sad when he found out that his parents were going to divorce."}],"collocations":["proses tercerai (divorce process)","permohonan tercerai (divorce application)"],"synonyms":["bercerai","berpisah","putus"],"antonyms":["menikah","bersatu"]}],"etymology":{"value":"Derived from the root word 'cerai' (divorce, separation) with the prefix 'ter-' indicating a state or passive voice.","priority":"N/A"},"pronunciation":{"ipa":"/tər.t͡ʃə.rai/","syllables":"ter-ce-rai"},"inflection":{"notes":"This is a verb in its base form. It can be inflected with affixes to indicate tense, aspect, or voice, depending on the specific grammatical context in Malay or Indonesian."},"usage_notes":{"explanation":"'Tercerai' specifically refers to the legal ending of a marriage. It is often used in formal contexts or when discussing legal matters related to divorce. The verb 'bercerai' is a more general term for divorce.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Mereka sudah cerai.","correct":"Mereka sudah bercerai / Mereka sudah tercerai.","note":"While 'cerai' can be used as an adjective, it's more common to use the verb forms 'bercerai' or 'tercerai' to indicate that a divorce has occurred."}],"priority":"N/A"},"related_words":{"derivatives":["perceraian (divorce - noun)","mencerai (to divorce someone - active verb)","menceraikan (to divorce someone - active verb)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"frequency_corpus":"Moderately frequent in formal and legal contexts.","priority":"N/A"},"readability_explanation":{"level":"B1/B2","text":"The word 'tercerai' is used to describe a legal divorce. It's important to understand that this word specifically refers to the legal ending of a marriage. It is more formal than the general term 'bercerai'. You will often find this word in news articles or legal documents related to divorce."},"example_sentences":[{"sentence":"Setelah melalui persidangan yang panjang, mereka akhirnya resmi tercerai.","translation":"After a long trial, they were finally officially divorced.","type":"verb","meaning_category":"divorce"},{"sentence":"Banyak anak-anak yang menderita ketika orang tua mereka tercerai.","translation":"Many children suffer when their parents divorce.","type":"verb","meaning_category":"divorce"}]}