{"word":"muscularly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"筋肉質に、筋肉隆々に","english_definition":"In a muscular manner; with well-developed muscles.","examples":[{"sentence":"He was muscularly built, a testament to his dedication to weightlifting.","translation":"彼は筋肉質に鍛え上げられており、それは彼のウェイトリフティングへの献身の証だった。"},{"sentence":"The dancer moved muscularly, showcasing her strength and control.","translation":"そのダンサーは筋肉隆々に動き、彼女の力強さとコントロールを披露した。"}],"collocations":["muscularly built","muscularly developed","muscularly toned"],"synonyms":["powerfully","strongly","brawnily","robustly"],"antonyms":["weakly","feebly","delicately"]}],"etymology":{"value":"Formed from 'muscular' + '-ly'. 'Muscular' derives from Latin 'musculus', meaning 'muscle'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmʌskjələrli/","syllables":"mus-cu-lar-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Muscularly' is primarily used to describe the physical appearance or movement of someone or something that is characterized by well-developed muscles. It is not a commonly used word, and its usage is often limited to descriptive contexts where the emphasis is on physical strength and muscularity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He performed the task muscularly, showing his intelligence.","correct":"✓ He performed the task skillfully, showing his intelligence.","note":"'Muscularly' refers to physical strength, not intelligence or skill. Use 'skillfully' or 'competently' instead."},{"incorrect":"✗ The design was muscularly, with bold lines and strong shapes.","correct":"✓ The design was bold, with strong lines and shapes.","note":"'Muscularly' typically describes living beings, not inanimate objects or designs. Use adjectives like 'bold' or 'strong' to describe the design."}],"priority":"★☆☆"},"related_words":{"derivatives":["muscular (adjective)","muscularity (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Muscularly' is an advanced term used to describe actions or appearances related to well-developed muscles. It is not commonly used in everyday conversation and is more likely to appear in descriptive writing or specialized contexts related to fitness, anatomy, or physical performance. Understanding the root word 'muscular' is helpful in grasping the meaning of 'muscularly'."},"example_sentences":[{"sentence":"The athlete was muscularly defined, a result of years of training.","translation":"その運動選手は筋肉隆々としており、それは長年のトレーニングの結果だった。","type":"adverb","meaning_category":"physical appearance"},{"sentence":"He lifted the heavy weights muscularly, demonstrating his impressive strength.","translation":"彼は重いウェイトを筋肉隆々に持ち上げ、彼の印象的な力強さを示した。","type":"adverb","meaning_category":"physical action"}]}