{"word":"Jesuitries","priority":"低","meanings":[{"part_of_speech":"noun","definition":"イエズス会士のような詭弁術、ごまかし、策略","english_definition":"The use of equivocation or mental reservation; casuistry; deceptive or evasive practices; dissimulation.","examples":[{"sentence":"His business dealings were filled with Jesuitries, making it difficult to trust him.","translation":"彼の商取引はイエズス会士のような詭弁術に満ちており、彼を信用するのは難しかった。"},{"sentence":"The politician's speech was criticized for its Jesuitries, as he seemed to avoid answering direct questions.","translation":"その政治家の演説は、直接的な質問への回答を避けているように見えたため、イエズス会士のような詭弁術として批判された。"}],"collocations":["use of Jesuitries","political Jesuitries","business Jesuitries"],"synonyms":["equivocation","casuistry","deception","dissimulation","subterfuge","guile","trickery"],"antonyms":["honesty","candor","frankness","sincerity"]}],"etymology":{"value":"「Jesuitry」は「Jesuit」（イエズス会士）に由来する。元々はイエズス会の教義や実践を指す言葉だったが、特に16世紀から17世紀にかけて、その倫理観や政治的な策略が批判されるようになり、「詭弁術」「ごまかし」といった否定的な意味合いを持つようになった。","priority":"中"},"pronunciation":{"ipa":"/ˈdʒɛʒuɪtriːz/","syllables":"je-su-it-ries"},"inflection":{"noun_plural":"Jesuitries"},"usage_notes":{"explanation":"「Jesuitries」は、イエズス会士が用いるとされる、または用いると非難された、複雑で巧妙な議論や策略を指す言葉である。しばしば、道徳的な正当性を疑われるような、ごまかしや詭弁を含むニュアンスで使用される。現代では、特定の宗教団体だけでなく、一般的な欺瞞的な行為を指す場合もある。","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great Jesuitries in his charity work.","correct":"✓ He showed great dedication in his charity work.","note":"慈善活動のような肯定的な文脈では、「Jesuitries」は不適切。献身や誠実さを示す言葉を使うべき。"},{"incorrect":"✗ The Jesuitries of the building were impressive.","correct":"✓ The architecture of the building was impressive.","note":"建物の構造や外観を指す場合、「Jesuitries」は意味をなさない。建築やデザインに関する言葉を使うべき。"}],"priority":"低"},"related_words":{"derivatives":["Jesuit (名詞: イエズス会士、形容詞: イエズス会の)","Jesuitical (形容詞: イエズス会的な、詭弁的な)","Jesuitism (名詞: イエズス会の主義、イエズス会的なやり方)"],"phrases":["practice of Jesuitries","art of Jesuitries"],"priority":"低"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度","priority":"低"},"readability_explanation":{"level":"C2","text":"「Jesuitries」は、高度な語彙であり、日常会話ではほとんど使用されない。主に、歴史、政治、宗教に関する議論や、特定の種類の欺瞞的な行為を批判的に分析する文脈で見られる。この単語を理解するには、イエズス会の歴史的背景と、その倫理観に対する批判的な視点についての知識が必要となる。"},"example_sentences":[{"sentence":"The lawyer's arguments were dismissed as mere Jesuitries, designed to confuse the jury.","translation":"弁護士の主張は、陪審員を混乱させるための単なるイエズス会士のような詭弁術として退けられた。","type":"noun","meaning_category":"詭弁術"},{"sentence":"Critics accused the company of using Jesuitries to justify its environmentally damaging practices.","translation":"批評家たちは、その会社が環境を破壊する行為を正当化するためにイエズス会士のような詭弁術を用いていると非難した。","type":"noun","meaning_category":"策略"},{"sentence":"The treaty was carefully worded to avoid any potential Jesuitries that could be exploited later.","translation":"その条約は、後で悪用される可能性のあるイエズス会士のような詭弁術を避けるために、注意深く言葉が選ばれていた。","type":"noun","meaning_category":"ごまかし"}]}