{"word":"Crustaceological","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"甲殻類学の、甲殻類学に関する","english_definition":"Relating to crustaceology, the branch of zoology devoted to the study of crustaceans.","examples":[{"sentence":"The crustaceological research was published in a scientific journal.","translation":"その甲殻類学の研究は科学雑誌に掲載された。"},{"sentence":"He has a crustaceological interest in crabs and lobsters.","translation":"彼はカニやロブスターに甲殻類学的な興味を持っている。"}],"collocations":["crustaceological research","crustaceological study","crustaceological interest"],"synonyms":["crustacean","carcinological"],"antonyms":[]}],"etymology":{"value":"Formed from 'crustaceology' (the study of crustaceans) + '-ical' (forming adjectives). 'Crustaceology' comes from 'crustacean' (a type of arthropod) + '-ology' (the study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrʌs.teɪ.ʃi.əˈlɒdʒɪ.kəl/","syllables":"crus-ta-ce-o-log-i-cal"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than for comparative/superlative forms (though these are rare for longer words like this)."},"usage_notes":{"explanation":"'Crustaceological' is a highly specialized term used almost exclusively within the context of zoology and marine biology. It describes something related to the scientific study of crustaceans, such as crabs, lobsters, shrimp, and barnacles. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a crustacean interest.","correct":"✓ He has a crustaceological interest.","note":"'Crustacean' is the noun referring to the animal itself, while 'crustaceological' is the adjective referring to the study of those animals."}],"priority":"★★☆"},"related_words":{"derivatives":["crustaceology (noun: the study of crustaceans)","crustaceologist (noun: a scientist who studies crustaceans)","crustacean (noun: a type of arthropod including crabs, lobsters, etc.)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very specialized vocabulary)","frequency_google_ngram":"Extremely low frequency - very rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'crustaceological' is a highly technical term primarily used in the fields of zoology and marine biology. It is used to describe something related to the study of crustaceans, which are a diverse group of arthropods including crabs, lobsters, shrimp, and barnacles. Due to its specialized nature, this word is not commonly encountered outside of scientific contexts. Understanding requires familiarity with scientific terminology and the field of zoology."},"example_sentences":[{"sentence":"The museum's collection includes a vast array of crustaceological specimens.","translation":"その博物館のコレクションには、膨大な種類の甲殻類学的な標本が含まれている。","type":"adjective","meaning_category":"甲殻類学の"},{"sentence":"Her crustaceological expertise made her a valuable asset to the research team.","translation":"彼女の甲殻類学的な専門知識は、彼女を研究チームにとって貴重な財産にした。","type":"adjective","meaning_category":"甲殻類学の"}]}