{"word":"quedship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, humorous) A state of being strange, peculiar, or eccentric; oddness.","english_definition":"The state or quality of being strange, peculiar, or eccentric; oddness.","examples":[{"sentence":"His actions were marked by a certain quedship that both amused and bewildered his colleagues.","translation":"彼の行動は、同僚を面白がらせると同時に困惑させる、ある種の奇妙さによって特徴付けられていた。"},{"sentence":"The artist embraced his quedship, using it as a source of inspiration for his unique creations.","translation":"その芸術家は自身の奇抜さを受け入れ、それを独自の作品のインスピレーションの源として利用した。"}],"collocations":["a touch of quedship","embrace one's quedship","display quedship"],"synonyms":["eccentricity","peculiarity","strangeness","oddness","unconventionality"],"antonyms":["normality","conventionality","ordinariness"]}],"etymology":{"value":"Likely a humorous or nonce word formed by analogy with words ending in '-ship' (e.g., friendship, kinship), perhaps from 'qued' (archaic term for bad or evil), or simply a playful invention to describe a state of oddness.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkwɛdʃɪp/","syllables":"qued-ship"},"inflection":{"noun_plural":"quedships"},"usage_notes":{"explanation":"\"Quedship\" is a rare and somewhat humorous word. It is not found in most standard dictionaries. Its use is typically confined to informal contexts where the speaker wishes to playfully describe a state of oddness or eccentricity. It carries a lighthearted tone and is not generally used in formal or serious discussions.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great quedship in his business dealings.","correct":"✓ He showed great acumen in his business dealings.","note":"Quedship refers to oddness or eccentricity, not skill or shrewdness. Acumen would be more appropriate in this context."},{"incorrect":"✗ The quedship of the situation was alarming.","correct":"✓ The strangeness of the situation was alarming.","note":"In more serious or alarming contexts, 'strangeness' or 'peculiarity' would be more suitable than the lighthearted 'quedship'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["qued (archaic: bad, evil; odd)","eccentric","peculiar","odd","strange"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not a common word)","frequency_google_ngram":"Very low frequency; not commonly found in corpora.","priority":"★☆☆"},"readability_explanation":{"level":"C2 (due to rarity and nuanced usage)","text":"\"Quedship\" is a rare and informal word used to describe the state of being strange or eccentric. It's not a common term and is more likely to be encountered in humorous or playful contexts. Because of its rarity and the subtle understanding required to use it appropriately, it would be considered a C2-level word."},"example_sentences":[{"sentence":"The professor's lectures were known for their intellectual quedship, often veering into unexpected tangents.","translation":"その教授の講義は、知的な奇抜さで知られており、予期せぬ方向に脱線することが多かった。","type":"noun","meaning_category":"oddness"},{"sentence":"There was a certain charming quedship to the old house, with its mismatched furniture and quirky decorations.","translation":"その古い家には、家具がバラバラで風変わりな装飾が施されているなど、どこか魅力的な奇妙さがあった。","type":"noun","meaning_category":"oddness"}]}