{"word":"pseudolegality","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"外見上の合法性、見せかけの合法性、擬似的な合法性","english_definition":"The appearance of legality; something that appears to be legal but is not.","examples":[{"sentence":"The regime used pseudolegality to justify its oppressive actions.","translation":"その政権は、抑圧的な行動を正当化するために、見せかけの合法性を使用した。"},{"sentence":"The contract had an air of pseudolegality, but closer inspection revealed several loopholes.","translation":"その契約は見せかけの合法性を持っていたが、詳しく調べるといくつかの抜け穴が明らかになった。"}],"collocations":["cloak of pseudolegality","air of pseudolegality","veneer of pseudolegality"],"synonyms":["sham legality","apparent legality","ostensible legality","simulated legality","mock legality"],"antonyms":["actual legality","true legality","genuine legality","real legality"]}],"etymology":{"value":"\"pseudo-\"（偽の、見せかけの）+ \"legality\"（合法性）から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"ˌsuːdoʊlɪˈɡæləti","syllables":"pseu-do-le-gal-i-ty"},"inflection":{"noun_plural":"pseudolegalities"},"usage_notes":{"explanation":"\"Pseudolegality\" refers to something that gives the impression of being legal or legitimate, but in reality, it is not. It often involves manipulating laws or procedures to achieve a desired outcome while maintaining a facade of legality. This term is frequently used in political, legal, and business contexts to describe actions that are technically legal but morally or ethically questionable.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pseudolegality of the document was obvious to everyone.","correct":"✓ The pseudolegality of the document was apparent to everyone.","note":"\"Obvious\" implies something is easily noticed. While pseudolegality is a facade, it's often designed to be convincing. \"Apparent\" suggests it seems legal on the surface but isn't upon closer inspection."},{"incorrect":"✗ He used pseudolegality to break the law.","correct":"✓ He used pseudolegality to circumvent the law.","note":"Pseudolegality doesn't directly break the law; it attempts to stay within the bounds of the law while achieving an illegal or unethical outcome. \"Circumvent\" is a more accurate verb."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudolegal (adjective)"],"related_terms":["legality","illegality","sham","facade","pretense"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Pseudolegality\" is a complex term that describes something that appears to be legal but is not truly so. It's like a trick or a disguise that makes something seem lawful when it's actually questionable or unethical. This word is often used in serious discussions about law, politics, or business when someone is trying to make something wrong look right. Understanding this word helps you recognize when someone might be trying to manipulate the system.","priority":"★☆☆"},"example_sentences":[{"sentence":"The company's tax avoidance scheme operated under a veil of pseudolegality.","translation":"その会社の脱税計画は、見せかけの合法性のベールのもとで行われた。","type":"general","meaning_category":"general"},{"sentence":"Critics argued that the government's actions, while technically legal, were a form of pseudolegality.","translation":"批評家たちは、政府の行動は、技術的には合法であるものの、見せかけの合法性の一形態であると主張した。","type":"political","meaning_category":"political"},{"sentence":"The contract's pseudolegality masked its exploitative terms.","translation":"その契約の見せかけの合法性は、その搾取的な条項を覆い隠していた。","type":"legal","meaning_category":"legal"}]}