{"word":"Conventionally-raised","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"慣行的に飼育された、従来の方法で育てられた","english_definition":"Raised or produced using traditional or standard agricultural methods, often involving synthetic fertilizers, pesticides, and other inputs.","examples":[{"sentence":"Conventionally-raised beef is typically cheaper than organic beef.","translation":"慣行的に飼育された牛肉は、通常、有機牛肉よりも安価です。"},{"sentence":"Many consumers are concerned about the environmental impact of conventionally-raised crops.","translation":"多くの消費者は、従来の方法で育てられた作物の環境への影響を懸念しています。"},{"sentence":"Conventionally-raised chickens are often kept in confined spaces.","translation":"従来の方法で飼育された鶏は、しばしば狭い場所に閉じ込められています。"}],"collocations":["conventionally-raised beef (慣行的に飼育された牛肉)","conventionally-raised crops (従来の方法で育てられた作物)","conventionally-raised livestock (従来の方法で飼育された家畜)","conventionally-raised poultry (従来の方法で飼育された家禽)"],"synonyms":["industrially-raised","traditionally-farmed","non-organic"],"antonyms":["organically-raised","sustainably-raised","pasture-raised","free-range"],"notes":"This term is often used in the context of agriculture and food production to distinguish products from those raised using organic or sustainable methods."}],"etymology":{"value":"A compound adjective formed by combining 'conventionally' (in a conventional manner) and 'raised' (brought up or grown). It indicates that something has been raised or produced according to established or traditional methods.","priority":"N/A"},"pronunciation":{"ipa":"/kənˌvɛnʃənəli ˈreɪzd/","syllables":"con-ven-tion-al-ly raised"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Conventionally-raised' is used to describe agricultural products (crops, livestock, poultry, etc.) that have been produced using standard, widespread farming practices. These practices often involve the use of synthetic fertilizers, pesticides, herbicides, and other chemical inputs, as well as specific animal husbandry techniques. The term is often used in contrast to 'organically-raised,' 'sustainably-raised,' or 'pasture-raised' to highlight differences in production methods.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The conventionally raised.","correct":"✓ Conventionally-raised livestock.","note":"'Conventionally-raised' is an adjective and needs to modify a noun."},{"incorrect":"✗ Conventionally raised is better for the environment.","correct":"✓ Conventionally-raised products may have a greater environmental impact.","note":"It's important to avoid making generalizations about the environmental impact of conventionally-raised products, as it can vary depending on specific practices and contexts."}],"priority":"N/A"},"related_words":{"derivatives":["conventionally (adverb)","raised (verb)"],"related_terms":["organic farming","sustainable agriculture","industrial agriculture","factory farming","CAFO (Concentrated Animal Feeding Operation)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'conventionally-raised' is used to describe agricultural products that are produced using standard, widespread farming practices. This often involves the use of synthetic fertilizers, pesticides, and other chemical inputs. The term is often used in contrast to 'organically-raised' or 'sustainably-raised' to highlight differences in production methods. It's a term commonly found in discussions about food production, agriculture, and environmental issues."},"example_sentences":[{"sentence":"Many consumers are seeking alternatives to conventionally-raised produce due to health concerns.","translation":"多くの消費者は、健康上の懸念から、従来の方法で育てられた農産物の代替品を探しています。","type":"general","meaning_category":"general"},{"sentence":"The price difference between conventionally-raised and organic chicken can be significant.","translation":"従来の方法で飼育された鶏肉と有機鶏肉の価格差は大きい場合があります。","type":"general","meaning_category":"general"},{"sentence":"Regulations regarding the use of pesticides in conventionally-raised crops vary from country to country.","translation":"従来の方法で育てられた作物における農薬の使用に関する規制は、国によって異なります。","type":"general","meaning_category":"general"}]}