{"word":"janitorship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"管理人[用務員]の職、管理人[用務員]の地位","english_definition":"The position or job of a janitor.","examples":[{"sentence":"He applied for the janitorship at the local school.","translation":"彼は地元の学校の管理人職に応募した。"},{"sentence":"The janitorship came with a small apartment on the premises.","translation":"その管理人職には敷地内の小さなアパートが付属していた。"}],"collocations":["apply for a janitorship","hold a janitorship","the duties of a janitorship"],"synonyms":["custodianship","caretakership","maintenance position"],"antonyms":[]}],"etymology":{"value":"The word \"janitorship\" is derived from \"janitor\" (doorkeeper, caretaker) + \"-ship\" (a suffix denoting a state, condition, office, or function).","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʒænɪtərʃɪp/","syllables":"jan-i-tor-ship"},"inflection":{"noun_plural":"janitorships"},"usage_notes":{"explanation":"The term \"janitorship\" refers specifically to the role or position held by a janitor. It often implies the responsibilities and duties associated with maintaining a building or facility.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He works as janitorship.","correct":"✓ He works in janitorship. / ✓ He holds a janitorship. / ✓ He works as a janitor.","note":"\"Janitorship\" is a noun referring to the position itself, not the act of working. Use \"in janitorship\" or \"holds a janitorship\" to describe someone working in that position, or rephrase to say \"works as a janitor.\""}],"priority":"★★☆"},"related_words":{"derivatives":["janitor","janitorial"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"janitorship\" is a relatively uncommon noun that refers to the job or position of a janitor. It is most likely to be encountered in formal contexts, such as job postings or official descriptions of roles within an organization. Understanding the term requires familiarity with the role of a janitor and the suffix \"-ship,\" which indicates a position or state of being."},"example_sentences":[{"sentence":"The competition for the janitorship was surprisingly fierce.","translation":"その管理人職の競争は驚くほど激しかった。","type":"noun","meaning_category":"position"},{"sentence":"His father held the janitorship at the church for over twenty years.","translation":"彼の父は20年以上教会で管理人職を務めた。","type":"noun","meaning_category":"position"},{"sentence":"The responsibilities of the janitorship included cleaning, maintenance, and security.","translation":"その管理人職の責任には、清掃、メンテナンス、警備が含まれていた。","type":"noun","meaning_category":"responsibilities"}]}