{"word":"Agraria","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(主にヨーロッパの)農業展示会、農業博覧会","english_definition":"An agricultural show or fair, especially in Europe.","examples":[{"sentence":"We visited Agraria in Wels, Austria, to see the latest agricultural technology.","translation":"最新の農業技術を見るために、オーストリアのウェルズで開催されたAgrariaを訪問しました。"},{"sentence":"Agraria is an important event for farmers in the region.","translation":"Agrariaは、その地域の農家にとって重要なイベントです。"}],"collocations":["Agraria exhibition","Agraria trade fair","visit Agraria"],"synonyms":["agricultural fair","agricultural show","farm show"],"antonyms":[]}],"etymology":{"value":"The word \"Agraria\" is derived from the Latin word \"agrarius,\" which relates to land or agriculture. It is often used as a proper noun to name agricultural exhibitions or trade fairs.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈɡrɛəriə/","syllables":"A-gra-ri-a"},"inflection":{"notes":"It is a proper noun, often used as the name of a specific event or organization. Plural form is Agrarias."},"usage_notes":{"explanation":"\"Agraria\" is primarily used as a proper noun to refer to a specific agricultural exhibition or trade fair, especially those held in Europe. It is not a common word in everyday English but is well-understood within the agricultural community in the regions where these events take place.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to an agraria to buy seeds.","correct":"✓ I went to Agraria to buy seeds.","note":"Use 'Agraria' as a proper noun, referring to a specific event, not as a general term for agricultural fairs."}],"priority":"★★☆"},"related_words":{"derivatives":["agrarian (adjective: relating to cultivated land or the cultivation of land)","agriculture (noun: the science or practice of farming)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in specific contexts related to agricultural events.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Agraria\" is a specialized term primarily used to refer to agricultural exhibitions or trade fairs, especially in Europe. It is not a common word in general English but is understood within the context of agriculture and farming. Understanding this term requires familiarity with agricultural events and trade shows."},"example_sentences":[{"sentence":"The Agraria in Hanover is one of the largest agricultural exhibitions in Germany.","translation":"ハノーバーで開催されるAgrariaは、ドイツ最大の農業展示会の1つです。","type":"noun","meaning_category":"agricultural fair"},{"sentence":"Many international companies participate in Agraria to showcase their latest products.","translation":"多くの国際企業が最新の製品を展示するためにAgrariaに参加します。","type":"noun","meaning_category":"agricultural fair"}]}