{"word":"Low-churchmanship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(英国国教会内の) ローチャーチ主義、低教会派","english_definition":"A tendency in Anglicanism to attach relatively little importance to ritual, priestly authority, etc.","examples":[{"sentence":"Low-churchmanship emphasized personal piety and biblical authority.","translation":"低教会派は、個人的な信仰心と聖書の権威を強調した。"},{"sentence":"The parish was known for its strong tradition of Low-churchmanship.","translation":"その教区は、低教会派の強い伝統で知られていた。"}],"collocations":["evangelical Low-churchmanship","broad Low-churchmanship"],"synonyms":["Evangelicalism (in some contexts)"],"antonyms":["High-churchmanship","Anglo-Catholicism"]},{"part_of_speech":"noun","definition":"低教会派の人々","english_definition":"The principles and practices of Low Church Anglicans.","examples":[{"sentence":"Low-churchmanship is often associated with evangelicalism.","translation":"低教会派はしばしば福音主義と関連付けられる。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Low Church' (18th century) + '-manship'. 'Low Church' refers to a group within the Church of England that places less emphasis on ritual and priestly authority, and more on personal piety and biblical authority.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌloʊˈtʃɜːrtʃmənʃɪp/","syllables":"Low-church-man-ship"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Low-churchmanship' refers to a set of beliefs and practices within Anglicanism (the Church of England and related churches). It emphasizes the importance of personal faith, biblical authority, and evangelism, while downplaying the significance of ritual, sacraments, and priestly authority. It is often contrasted with 'High-churchmanship', which places greater emphasis on these latter aspects.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["Low Church (adjective, noun)","Low Churchman (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Low-churchmanship' is a term used to describe a particular approach to Anglican Christianity. It's about prioritizing personal faith and the Bible over formal rituals and the authority of priests. Think of it as a more straightforward, less ceremonial way of practicing the Anglican faith. It's a term you'll mostly encounter in discussions about the history and different traditions within the Church of England.","example_sentences":[]}}