{"word":"chimpanzee","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"チンパンジー","english_definition":"a great ape with large ears, mainly black coloration, and native to the forests of tropical Africa.","examples":[{"sentence":"The chimpanzee is one of the closest living relatives to humans.","translation":"チンパンジーは現生人類に最も近い親戚の一つです。"},{"sentence":"Chimpanzees are known for their intelligence and tool use.","translation":"チンパンジーは知能の高さと道具の使用で知られています。"},{"sentence":"The chimpanzee enclosure at the zoo is very popular.","translation":"動物園のチンパンジーの囲いはとても人気があります。"}],"collocations":["chimpanzee troop","chimpanzee habitat","chimpanzee behavior","chimpanzee research","baby chimpanzee"],"synonyms":["chimp"],"antonyms":[]}],"etymology":{"value":"Derived from a Bantu language, likely Tshiluba, the name \"chimpenze\" was originally a local name for the animal. The term was first used in English in the early 18th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtʃɪmpənˈziː/","syllables":"chim·pan·zee"},"inflection":{"noun_plural":"chimpanzees"},"usage_notes":{"explanation":"The term \"chimpanzee\" generally refers to the common chimpanzee (Pan troglodytes). There is also the bonobo (Pan paniscus), sometimes called the pygmy chimpanzee, which is a separate but closely related species. When referring to both species collectively, the term \"panins\" can be used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ chimpanzee's are intelligent.","correct":"✓ Chimpanzees are intelligent.","note":"When making a general statement about chimpanzees, use the plural form without an apostrophe."},{"incorrect":"✗ I saw a chimpazee at the zoo.","correct":"✓ I saw a chimpanzee at the zoo.","note":"Correct spelling is crucial. Double-check the spelling, especially the ending."}],"priority":"★★☆"},"related_words":{"derivatives":["chimp (shortened form of chimpanzee)"],"phrases":["Jane Goodall (renowned primatologist known for her chimpanzee research)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"chimpanzee\" is a specific term referring to a particular species of ape. While not an everyday word, it's commonly used in discussions about animals, biology, and conservation. Understanding its meaning is helpful for comprehending scientific and general interest articles about primates.","priority":"★★☆"},"example_sentences":[{"sentence":"Scientists are studying the social behavior of chimpanzees in the wild.","translation":"科学者たちは野生のチンパンジーの社会行動を研究しています。","type":"general","meaning_category":"animal behavior"},{"sentence":"The chimpanzee used a stick to extract termites from the mound.","translation":"チンパンジーは棒を使って蟻塚からシロアリを取り出した。","type":"general","meaning_category":"tool use"},{"sentence":"Conservation efforts are crucial to protect chimpanzees from habitat loss.","translation":"チンパンジーを生息地の喪失から守るためには、保護活動が不可欠です。","type":"general","meaning_category":"conservation"}]}