{"word":"Dormition","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"永眠、聖母就寝祭（正教会における聖母マリアの死と昇天を記念する祝祭）","english_definition":"The falling asleep or repose; specifically, the Feast of the Dormition of the Theotokos, commemorating the death and assumption of Mary, mother of Jesus.","examples":[{"sentence":"The Dormition of the Virgin is a major feast day in the Orthodox Church.","translation":"生神女就寝祭は正教会における重要な祝日です。"},{"sentence":"Icons depicting the Dormition often show Mary surrounded by the apostles.","translation":"聖母就寝を描いたイコンは、しばしば聖母マリアが使徒たちに囲まれている様子を示しています。"}],"collocations":["Feast of the Dormition","Dormition of the Theotokos","celebrate the Dormition"],"synonyms":["Falling Asleep","Repose","Assumption"],"antonyms":["Nativity (of Mary)"]}],"etymology":{"value":"From Late Latin *dormitio*, from Latin *dormire* (to sleep).","priority":"★★☆"},"pronunciation":{"ipa":"/dɔːrˈmɪʃən/","syllables":"dor-mi-tion"},"inflection":{"noun_plural":"Dormitions"},"usage_notes":{"explanation":"'Dormition' refers to the 'falling asleep' or death, especially of the Virgin Mary. It is primarily used in the context of the Eastern Orthodox and Eastern Catholic churches. The term is often capitalized when referring to the specific feast day.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Dormition is about Mary's birth.","correct":"✓ The Dormition is about Mary's death and assumption.","note":"The Dormition commemorates Mary's death, not her birth."}],"priority":"★★☆"},"related_words":{"derivatives":["dormient (adj.) - sleeping or lying at rest","dormitory (noun) - a sleeping place"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Primarily used in religious contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Dormition' is a specialized term primarily used within Eastern Christian religious contexts to refer to the death and assumption of the Virgin Mary. Due to its specific religious usage and etymological roots in Latin, it is not a commonly encountered word in general English vocabulary. Understanding requires familiarity with Christian theology and history."},"example_sentences":[{"sentence":"The church celebrated the Feast of the Dormition with a special liturgy.","translation":"教会は特別な典礼で聖母就寝祭を祝いました。","type":"noun","meaning_category":"Religious Feast"},{"sentence":"The icon of the Dormition portrays Mary's peaceful passing surrounded by the apostles.","translation":"聖母就寝のイコンは、聖母マリアが使徒たちに囲まれて安らかに息を引き取る様子を描いています。","type":"noun","meaning_category":"Religious Art"}]}