{"word":"dihybrids","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"二重雑種、二遺伝子雑種","english_definition":"Individuals or offspring that are heterozygous for two traits; resulting from a cross between parents that are homozygous for different alleles of two genes.","examples":[{"sentence":"The dihybrids in the F2 generation showed a 9:3:3:1 phenotypic ratio.","translation":"F2世代の二重雑種は、9:3:3:1の表現型比を示した。"},{"sentence":"Mendel's experiments with dihybrids led to the law of independent assortment.","translation":"メンデルの二重雑種を用いた実験は、独立の法則につながった。"}],"collocations":["dihybrid cross (二重雑種交配)","dihybrid ratio (二重雑種比)","F1 dihybrids (F1世代の二重雑種)","F2 dihybrids (F2世代の二重雑種)"],"synonyms":["double heterozygotes"],"antonyms":["monohybrids (単一雑種)"],"notes":["Typically used in the context of genetics and biology."]}],"etymology":{"value":"The word 'dihybrid' is formed from the prefix 'di-' meaning 'two,' and 'hybrid,' referring to the offspring of two different varieties or species.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdaɪˈhaɪbrɪdz/","syllables":"di-hy-brids"},"inflection":{"noun_plural":"dihybrids"},"usage_notes":{"explanation":"'Dihybrids' refers specifically to organisms that are heterozygous for two different genes or traits. It is a term commonly used in genetics to describe the offspring resulting from a cross between two parents that are each homozygous for different alleles of two genes. The study of dihybrids is essential for understanding the principles of independent assortment and genetic inheritance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The dihybrid was homozygous for both traits.","correct":"✓ The dihybrid was heterozygous for both traits.","note":"Dihybrids are, by definition, heterozygous for the two traits being considered. Homozygous individuals would not be considered dihybrids."},{"incorrect":"✗ Dihybrids are used to study single gene inheritance.","correct":"✓ Dihybrids are used to study the inheritance of two genes simultaneously.","note":"Dihybrids are used to study the inheritance patterns of two genes at the same time, not single gene inheritance."}],"priority":"★★☆"},"related_words":{"derivatives":["dihybrid cross (二重雑種交配)","dihybridism (二重雑種性)"],"related_terms":["heterozygous (ヘテロ接合)","homozygous (ホモ接合)","allele (対立遺伝子)","gene (遺伝子)","genotype (遺伝子型)","phenotype (表現型)","Mendelian genetics (メンデル遺伝学)","independent assortment (独立の法則)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in scientific and educational contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'dihybrids' is a specialized term used in genetics. It refers to organisms that are heterozygous for two different genes, meaning they have two different alleles for each of those genes. Understanding this term requires a background in basic genetics concepts such as genes, alleles, homozygosity, and heterozygosity. Dihybrid crosses are used to study how two different traits are inherited simultaneously, and they are fundamental to understanding Mendel's law of independent assortment."},"example_sentences":[{"sentence":"The F1 **dihybrids** were all tall and had purple flowers.","translation":"F1世代の二重雑種はすべて背が高く、紫色の花を持っていた。","type":"noun","meaning_category":"Genetics"},{"sentence":"Analyzing the F2 generation of the **dihybrids** allowed us to determine the linkage between the two genes.","translation":"二重雑種のF2世代を分析することで、2つの遺伝子間の連鎖を特定することができた。","type":"noun","meaning_category":"Genetics"},{"sentence":"We performed a test cross with the **dihybrids** to determine the genotype of the unknown parent.","translation":"未知の親の遺伝子型を決定するために、二重雑種との検定交雑を行った。","type":"noun","meaning_category":"Genetics"}]}