{"word":"dandyize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ダンディにする、ダンディ風にする","english_definition":"To make dandy-like; to adorn or affect with the characteristics of a dandy.","examples":[{"sentence":"He dandyized his appearance with a silk scarf and a pocket watch.","translation":"彼はシルクのスカーフと懐中時計で外見をダンディ風にした。"}],"collocations":["dandyize oneself","dandyize an outfit"],"synonyms":["embellish","adorn","prettify","smart up"],"antonyms":["uglify","simplify","dowdy"],"notes":"This word is not commonly used in modern English. It is more of a historical term."}],"etymology":{"value":"From 'dandy' + '-ize'. 'Dandy' originally referred to a man unduly devoted to style, neatness, and fashion in dress and appearance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdændaɪz/","syllables":"dan-dy-ize"},"inflection":{"verb_forms":{"present_simple":["dandyize","dandyizes"],"past_simple":"dandyized","past_participle":"dandyized","present_participle":"dandyizing"}},"usage_notes":{"explanation":"'Dandyize' is a verb that means to make something or someone resemble a dandy, typically by adding stylish or fashionable elements. It is not a commonly used word in contemporary English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She dandyized the room with simple furniture.","correct":"✓ She decorated the room with elegant furniture.","note":"'Dandyize' implies a focus on personal appearance or style, not general decoration."}],"priority":"★☆☆"},"related_words":{"derivatives":["dandy (noun, adjective)","dandyism (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dandyize' is a rare and sophisticated word. It is used to describe the act of making something or someone resemble a dandy, which refers to a man who is excessively concerned with his appearance and fashion. This word is not commonly encountered in everyday language and is more likely to be found in historical or literary contexts."},"example_sentences":[{"sentence":"The artist dandyized the portrait with exaggerated details.","translation":"その画家は誇張されたディテールで肖像画をダンディ風にした。","type":"verb","meaning_category":"ダンディにする"}]}