{"word":"psychoepilepsy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"精神てんかん","english_definition":"A historical term for a condition resembling epilepsy but believed to be of psychological origin; now largely replaced by more specific diagnoses such as psychogenic non-epileptic seizures (PNES).","examples":[{"sentence":"The patient was diagnosed with psychoepilepsy after exhibiting seizure-like symptoms without neurological abnormalities.","translation":"患者は神経学的な異常がないにもかかわらず、発作のような症状を示したため、精神てんかんと診断された。"}],"collocations":["diagnosed with psychoepilepsy","symptoms of psychoepilepsy"],"synonyms":["psychogenic seizures","non-epileptic seizures","conversion disorder"],"antonyms":[]},{"part_of_speech":"noun","definition":"(古)精神的な原因によるてんかん様の症状","english_definition":"(historical) A condition in which seizure-like symptoms are believed to be caused by psychological factors rather than neurological ones.","examples":[{"sentence":"In the early 20th century, psychoepilepsy was often attributed to hysteria.","translation":"20世紀初頭には、精神てんかんはしばしばヒステリーに起因すると考えられていた。"}],"collocations":["historical diagnosis of psychoepilepsy","psychoepilepsy and hysteria"],"synonyms":["hysterical seizures","pseudoseizures"],"antonyms":[]}],"etymology":{"value":"Derived from 'psycho-' (referring to the mind or psychological factors) and 'epilepsy' (a neurological disorder characterized by seizures).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsaɪkoʊˈɛpɪlɛpsi/","syllables":"psy-cho-ep-i-lep-sy"},"inflection":{"noun_plural":"psychoepilepsies"},"usage_notes":{"explanation":"The term 'psychoepilepsy' is largely outdated and considered stigmatizing. Modern medical practice prefers using terms like 'psychogenic non-epileptic seizures' (PNES) or 'functional seizures' to describe seizure-like events that are not caused by abnormal electrical activity in the brain but rather by psychological factors such as stress, trauma, or emotional distress. When encountering this term, it is important to understand its historical context and avoid using it in current clinical settings.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Psychoepilepsy is treated with anti-epileptic drugs.","correct":"✓ Psychogenic non-epileptic seizures (PNES) are typically treated with psychotherapy and stress management techniques.","note":"Psychoepilepsy (or PNES) is not caused by neurological abnormalities and therefore does not respond to anti-epileptic drugs. Treatment focuses on addressing the underlying psychological factors."}],"priority":"★★☆"},"related_words":{"derivatives":["psychogenic","epilepsy","seizure","psychosomatic"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - The term is rarely used in contemporary medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Psychoepilepsy' is a historical term that is rarely used in modern medicine. It refers to seizure-like symptoms believed to be caused by psychological factors rather than neurological ones. The term is now considered outdated and potentially stigmatizing, and it has been largely replaced by more specific and neutral terms such as 'psychogenic non-epileptic seizures' (PNES) or 'functional seizures.' Understanding this term requires knowledge of medical history and terminology, as well as an awareness of the evolution of diagnostic practices in neurology and psychiatry."},"example_sentences":[{"sentence":"The old medical records indicated a diagnosis of psychoepilepsy, but the patient's current symptoms suggest a different condition.","translation":"古い医療記録には精神てんかんの診断が示されていたが、患者の現在の症状は別の状態を示唆している。","type":"noun","meaning_category":"Historical diagnosis"},{"sentence":"Modern clinicians avoid the term psychoepilepsy due to its potential to stigmatize patients.","translation":"現代の臨床医は、患者を偏見の目で見られる可能性があるため、精神てんかんという用語を避けている。","type":"noun","meaning_category":"Outdated term"}]}