{"word":"truncheoner","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A person armed with a truncheon; specifically, a member of a riot control force or similar law enforcement group.","english_definition":"A person armed with a truncheon, especially a member of a riot control force.","examples":[{"sentence":"The truncheoners advanced on the crowd, batons raised.","translation":"警棒を持った鎮圧隊員たちが、警棒を構えながら群衆に迫った。"},{"sentence":"Historical accounts describe the truncheoners as a brutal force.","translation":"歴史的記録では、警棒隊は残忍な部隊として描かれている。"}],"collocations":["riot truncheoner","police truncheoner"],"synonyms":["baton-wielder","clubman"],"antonyms":[]}],"etymology":{"value":"Derived from 'truncheon' (a short, thick stick carried as a weapon by a police officer) + '-er' (a suffix denoting a person associated with something).","priority":"★★★"},"pronunciation":{"ipa":"/ˈtrʌntʃənər/","syllables":"trun-cheon-er"},"inflection":{"noun_plural":"truncheoners"},"usage_notes":{"explanation":"The term 'truncheoner' is primarily historical and refers to individuals, often law enforcement or military personnel, who were equipped with truncheons (batons) for maintaining order or suppressing riots. It is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["truncheon"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'truncheoner' is a rare and specialized term, primarily found in historical contexts. It refers to someone armed with a truncheon, typically a member of a riot control force. Due to its limited usage, it's not part of common vocabulary and would be understood mainly by those familiar with historical or specialized texts. Understanding requires knowledge of the word 'truncheon' itself."},"example_sentences":[{"sentence":"The historical records detailed how the truncheoner squads were deployed during the labor protests.","translation":"歴史的記録には、労働者の抗議活動中に警棒隊がどのように配備されたかが詳しく記されている。","type":"noun","meaning_category":"historical riot control"}]}