{"word":"analogised","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(analogizeの過去形、過去分詞)類似点を指摘する、類似性を説明する、たとえる","english_definition":"(past tense and past participle of analogize) to point out the similarities between things; to explain something by showing its similarity to something else; to compare.","examples":[{"sentence":"He analogised the workings of the human brain to a computer.","translation":"彼は人間の脳の働きをコンピューターにたとえた。"},{"sentence":"The author analogised the political situation to a chess game.","translation":"著者は政治状況をチェスゲームにたとえた。"}],"collocations":["analogise A to B (AをBにたとえる)"],"synonyms":["compare","liken","equate","correlate","relate"],"antonyms":["differentiate","distinguish","contrast"]}],"etymology":{"value":"analogizeの過去形・過去分詞。analogizeは、1828年に「類似性を示す」という意味で使用され始め、analogy + -izeから派生。","priority":"★★☆"},"pronunciation":{"ipa":"/əˈnæləˌdʒaɪzd/","syllables":"a-nal-o-gised"},"inflection":{"verb_forms":{"present_simple":["analogise","analogises"],"past_simple":"analogised","past_participle":"analogised","present_participle":"analogising"}},"usage_notes":{"explanation":"'Analogised' is the past tense and past participle of the verb 'analogise', which means to draw an analogy between two things, typically for the purpose of explanation or clarification. It is used to describe the act of comparing something to something else to highlight their similarities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He analogized with a computer.","correct":"✓ He analogised the brain to a computer.","note":"'Analogise' requires a direct object (what is being analogized) and a prepositional phrase indicating what it is being compared to. The correct structure is 'analogise A to B'."}],"priority":"★★☆"},"related_words":{"derivatives":["analogize (動詞: たとえる)","analogy (名詞: 類似、比喩)","analogous (形容詞: 類似の、似通った)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Analogised' is a relatively uncommon word that means to have drawn a comparison between two things to show their similarities. It is the past tense form of 'analogise'. This word is typically used in formal writing or speech when making a complex comparison to explain something more clearly. Understanding the base word 'analogy' (a comparison between two things) is helpful in understanding 'analogised'."},"example_sentences":[{"sentence":"The teacher analogised the atom to the solar system to help the students understand its structure.","translation":"先生は生徒たちが原子の構造を理解するのを助けるために、原子を太陽系にたとえた。","type":"verb","meaning_category":"たとえる"},{"sentence":"In his lecture, the professor analogised the human heart to a pump.","translation":"講義で、教授は人間の心臓をポンプにたとえた。","type":"verb","meaning_category":"たとえる"}]}