{"word":"heterodyning","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘテロダイン (無線信号処理技術)","english_definition":"A signal processing technique in which two signals are mixed to create new frequencies.","examples":[{"sentence":"Heterodyning is used in radio receivers to convert high-frequency signals to lower intermediate frequencies.","translation":"ヘテロダインは、無線受信機で高周波信号をより低い中間周波数に変換するために使用されます。"}],"collocations":["frequency conversion","signal mixing","superheterodyne receiver"],"synonyms":["frequency mixing","frequency translation"],"antonyms":[]}],"etymology":{"value":"Derived from 'hetero-' (different) and '-dyning' (from 'dyne', a unit of force), referring to the mixing of different frequencies.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛtəroʊˈdaɪnɪŋ/","syllables":"het-er-o-dy-ning"},"inflection":{"noun_plural":"heterodynings"},"usage_notes":{"explanation":"Heterodyning is a technique used in radio receivers, radar systems, and other electronic devices to shift the frequency of a signal. It involves mixing two signals together, resulting in new signals at the sum and difference of the original frequencies. The superheterodyne receiver is a common application of heterodyning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Heterodyning is used to amplify signals directly.","correct":"✓ Heterodyning is used to convert frequencies.","note":"Heterodyning primarily converts frequencies, not amplifies signals directly."}],"priority":"★☆☆"},"related_words":{"derivatives":["heterodyne (noun, verb)","superheterodyne (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Heterodyning is a technical term used in electronics and signal processing. It refers to the process of mixing two signals to create new frequencies, typically the sum and difference of the original frequencies. This technique is commonly used in radio receivers to convert high-frequency signals to lower, more manageable intermediate frequencies. Understanding heterodyning requires a background in electronics or physics."},"example_sentences":[{"sentence":"The heterodyning process allows for efficient signal demodulation.","translation":"ヘテロダイン処理により、効率的な信号復調が可能になります。","type":"noun","meaning_category":"signal processing"},{"sentence":"Superheterodyne receivers rely on heterodyning to improve selectivity.","translation":"スーパーヘテロダイン受信機は、選択性を向上させるためにヘテロダインに依存しています。","type":"noun","meaning_category":"radio technology"}]}