{"word":"Neo-Platonism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"新プラトン主義","english_definition":"A philosophical school of thought that emerged in the 3rd century AD, based on the teachings of Plato and earlier Platonists, but incorporating elements of mysticism and Eastern philosophy.","examples":[{"sentence":"Neo-Platonism greatly influenced early Christian theology.","translation":"新プラトン主義は初期キリスト教神学に大きな影響を与えた。"},{"sentence":"Plotinus is considered the founder of Neo-Platonism.","translation":"プロティノスは新プラトン主義の創始者とみなされている。"},{"sentence":"Neo-Platonism emphasizes the concept of 'The One' as the ultimate source of reality.","translation":"新プラトン主義は、究極の現実の源としての「唯一者」の概念を強調する。"}],"collocations":["influence of Neo-Platonism","history of Neo-Platonism","principles of Neo-Platonism","Neo-Platonism and Christianity","Neo-Platonism and Renaissance"],"synonyms":["Platonism","Mysticism"],"antonyms":["Materialism","Empiricism"]}],"etymology":{"value":"Derived from 'Neo-' (new) + 'Platonism,' referring to a renewed or modified form of Plato's philosophy.","priority":"★★★"},"pronunciation":{"ipa":"/ˌniːoʊˈpleɪtənɪzəm/","syllables":"Ne-o-Pla-to-ni-sm"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Neo-Platonism is a complex philosophical system that attempts to reconcile Plato's ideas with other philosophical and religious traditions. Key concepts include 'The One' (a transcendent, ultimate reality), emanation (the process by which lower levels of reality proceed from 'The One'), and the soul's ascent back to 'The One' through contemplation and virtue. It had a significant impact on Western thought, particularly during the Middle Ages and Renaissance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Neo-Platonism is a scientific theory.","correct":"✓ Neo-Platonism is a philosophical school of thought.","note":"Neo-Platonism is a philosophical, not scientific, system."},{"incorrect":"✗ Neo-Platonism was founded by Plato.","correct":"✓ Neo-Platonism was influenced by Plato, but founded later by thinkers like Plotinus.","note":"Plato was a major influence, but Neo-Platonism developed centuries after Plato's death."}],"priority":"★★☆"},"related_words":{"derivatives":["Neo-Platonist (noun: a follower of Neo-Platonism)","Neo-Platonic (adjective: relating to Neo-Platonism)"],"phrases":["The One (the ultimate source of reality in Neo-Platonism)","Emanation (the process of creation in Neo-Platonism)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in academic or philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Neo-Platonism is an advanced philosophical term referring to a school of thought that developed from Plato's philosophy, incorporating mystical and religious elements. It's often discussed in the context of intellectual history, theology, and philosophy. Understanding it requires familiarity with abstract concepts and historical context.","priority":"★★☆"},"example_sentences":[{"sentence":"Augustine's philosophy was heavily influenced by Neo-Platonism.","translation":"アウグスティヌスの哲学は新プラトン主義から大きな影響を受けた。","type":"general","meaning_category":"Influence"},{"sentence":"Neo-Platonism offered a spiritual interpretation of Plato's metaphysics.","translation":"新プラトン主義はプラトンの形而上学に精神的な解釈を提供した。","type":"general","meaning_category":"Interpretation"},{"sentence":"The concept of 'The One' is central to Neo-Platonism.","translation":"「唯一者」の概念は新プラトン主義の中心である。","type":"concept","meaning_category":"Core concept"}]}