{"word":"monsterhood","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"怪物性、怪物である状態、怪物であること","english_definition":"The state or condition of being a monster; monstrous nature or quality.","examples":[{"sentence":"The film explores the themes of alienation and the burden of monsterhood.","translation":"その映画は、疎外感と怪物であることの重荷というテーマを探求している。"},{"sentence":"His actions revealed the true extent of his monsterhood.","translation":"彼の行動は、彼の怪物性の真の程度を明らかにした。"}],"collocations":["embrace one's monsterhood (自身の怪物性を受け入れる)","the burden of monsterhood (怪物であることの重荷)","the nature of monsterhood (怪物性の本質)"],"synonyms":["monstrosity","inhumanity","savagery","brutality"],"antonyms":["humanity","kindness","compassion"]}],"etymology":{"value":"'Monster' + '-hood'. The suffix '-hood' is used to form nouns referring to a state, condition, or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɒnstərhʊd/","syllables":"mon-ster-hood"},"inflection":{"noun_plural":"monsterhoods (rarely used in plural)"},"usage_notes":{"explanation":"'Monsterhood' is a relatively rare and abstract noun. It refers to the state, condition, or quality of being a monster. It can be used to describe the inherent nature of a monster, or the experience of being one. The term often carries negative connotations, implying cruelty, inhumanity, or a lack of empathy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great monsterhood in helping the poor.","correct":"✓ He showed great humanity in helping the poor.","note":"'Monsterhood' is negative. If you want to express kindness, use 'humanity' or similar words."}],"priority":"★★☆"},"related_words":{"derivatives":["monster (noun)","monstrous (adjective)","monstrously (adverb)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Not a common word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monsterhood' is an abstract noun referring to the state of being a monster. It's not a common word and is generally used in more sophisticated or philosophical discussions about the nature of monsters or evil. Understanding the word requires a good grasp of abstract concepts and the ability to infer meaning from context."},"example_sentences":[{"sentence":"The novel delves into the psychological aspects of monsterhood, exploring the character's descent into darkness.","translation":"その小説は、怪物性の心理的側面を掘り下げ、登場人物が闇に堕ちていく様子を描いている。","type":"noun","meaning_category":"怪物性"},{"sentence":"He grappled with the moral implications of his own monsterhood, torn between his desires and his conscience.","translation":"彼は自身の怪物性の道徳的意味合いに苦悩し、欲望と良心の狭間で葛藤した。","type":"noun","meaning_category":"怪物である状態"}]}