{"word":"transphenomenal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"超越現象的な、現象を超越した","english_definition":"Beyond or transcending the realm of phenomena or observable experience.","examples":[{"sentence":"The artist aimed to capture the transphenomenal essence of nature in his abstract paintings.","translation":"その芸術家は、抽象絵画で自然の超越現象的な本質を捉えることを目指した。"},{"sentence":"Philosophers often explore transphenomenal concepts such as the nature of reality beyond human perception.","translation":"哲学者は、人間の知覚を超えた現実の性質のような、超越現象的な概念をしばしば探求する。"}],"collocations":["transphenomenal reality","transphenomenal experience","transphenomenal realm"],"synonyms":["transcendental","metaphysical","noumenal","otherworldly"],"antonyms":["phenomenal","empirical","observable","mundane"]},{"part_of_speech":"noun","definition":"超越現象的なもの、現象を超越したもの","english_definition":"That which exists beyond or transcends the realm of phenomena or observable experience.","examples":[{"sentence":"The concept of a soul is often considered a transphenomenal.","translation":"魂の概念は、しばしば超越現象的なものと見なされる。"},{"sentence":"The scientist questioned whether transphenomenals could ever be empirically verified.","translation":"科学者は、超越現象的なものが経験的に検証可能かどうか疑問に思った。"}],"collocations":["the transphenomenal","a transphenomenal"],"synonyms":["transcendental entity","metaphysical object","noumenon"],"antonyms":["phenomenon","empirical object"]}],"etymology":{"value":"Derived from the prefix 'trans-' (beyond, across) and 'phenomenal' (relating to phenomena or experience).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtrænsfɪˈnɒmɪnəl/","syllables":"trans-phe-nom-i-nal"},"inflection":{"adjective_forms":{"comparative":"more transphenomenal","superlative":"most transphenomenal"},"noun_plural":"transphenomenals"},"usage_notes":{"explanation":"'Transphenomenal' is a relatively rare term, primarily used in philosophical, artistic, and sometimes spiritual contexts. It refers to that which lies beyond the scope of empirical observation or sensory experience, often relating to abstract concepts or metaphysical realities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The transphenomenal world is easily accessible through scientific experiments.","correct":"✓ The transphenomenal world is, by definition, not easily accessible through scientific experiments.","note":"The transphenomenal realm is defined as being beyond empirical observation, so it cannot be easily accessed through scientific experiments."}],"priority":"★☆☆"},"related_words":{"derivatives":["transphenomenality (noun)"],"related_terms":["phenomenon","transcendental","noumenon","metaphysics","epistemology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Transphenomenal' is a highly abstract and technical term primarily used in philosophical and theoretical discussions. It refers to concepts or realities that are considered to exist beyond the realm of observable phenomena or empirical experience. Understanding this term requires familiarity with philosophical concepts such as transcendentalism, metaphysics, and epistemology. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The philosopher argued that true understanding requires grasping the **transphenomenal** reality underlying our sensory perceptions.","translation":"その哲学者は、真の理解は、私たちの感覚的知覚の根底にある超越現象的な現実を把握することを必要とすると主張した。","type":"adjective","meaning_category":"超越現象的な"},{"sentence":"Many spiritual traditions posit the existence of **transphenomenals** that cannot be detected by scientific instruments.","translation":"多くの精神的な伝統は、科学機器では検出できない超越現象的なものの存在を仮定している。","type":"noun","meaning_category":"超越現象的なもの"}]}