{"word":"Zanjona","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にスペイン語圏)恋人に捨てられた女性、振られた女性","english_definition":"(Primarily in Spanish-speaking regions) A woman who has been abandoned by her lover; a woman who has been jilted.","examples":[{"sentence":"Ella se sentía como una zanjona después de que su novio la dejara.","translation":"She felt like a zanjona after her boyfriend left her. (彼女は恋人に振られた後、まるでzanjonaのような気持ちだった。)","usage_notes":"This term carries a strong emotional connotation of abandonment and heartbreak. (この言葉は、見捨てられたという強い感情的な意味合いと失恋を伴います。)"}],"collocations":["ser una zanjona (to be a zanjona)","sentirse como una zanjona (to feel like a zanjona)"],"synonyms":["abandonada","desamparada","rechazada"],"antonyms":["amada","querida"]}],"etymology":{"value":"Derived from the Spanish word 'zanja' (ditch, trench), metaphorically suggesting being left in a ditch or abandoned. (スペイン語の「zanja」（溝、堀）に由来し、比喩的に溝に置き去りにされた、または見捨てられた状態を示唆しています。)","priority":"★★☆"},"pronunciation":{"ipa":"/θanˈxo.na/ (Spain) or /sanˈxo.na/ (Latin America)","syllables":"zan-jo-na"},"inflection":{"noun_plural":"zanjonas"},"usage_notes":{"explanation":"The term 'zanjona' is primarily used in Spanish-speaking countries. It is a feminine noun. It is not a common word, but it is understood in many regions. (「zanjona」という用語は主にスペイン語圏の国で使用されます。女性名詞です。一般的な単語ではありませんが、多くの地域で理解されています。)","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"El zanjona.","correct":"La zanjona.","note":"'Zanjona' is a feminine noun, so it requires the feminine article 'la'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (低頻度)","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'zanjona' is a Spanish term referring to a woman who has been abandoned by her lover. It is not a common word and carries a strong emotional connotation. It is important to understand the cultural context in which this word is used. (「zanjona」という単語は、恋人に捨てられた女性を指すスペイン語の用語です。一般的な単語ではなく、強い感情的な意味合いを持ちます。この単語が使用される文化的背景を理解することが重要です。)","priority":"★★☆"},"example_sentences":[{"sentence":"Después de la boda, se sintió como una zanjona cuando su esposo la abandonó.","translation":"After the wedding, she felt like a zanjona when her husband abandoned her. (結婚後、夫に捨てられたとき、彼女はzanjonaのような気持ちになった。)","type":"noun","meaning_category":"abandoned woman"}]}