{"word":"nonhedonic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"快楽的でない、快楽主義的でない","english_definition":"Not relating to or characterized by pleasure or hedonism.","examples":[{"sentence":"The therapy focuses on nonhedonic goals, such as personal growth and meaning.","translation":"そのセラピーは、個人の成長や意味といった非快楽的な目標に焦点を当てています。"},{"sentence":"A nonhedonic approach to life emphasizes values beyond mere pleasure seeking.","translation":"人生への非快楽的なアプローチは、単なる快楽追求を超えた価値を強調します。"}],"collocations":["nonhedonic values","nonhedonic goals","nonhedonic motivation"],"synonyms":["non-pleasurable","non-sensual","non-gratifying"],"antonyms":["hedonic","pleasurable","gratifying"]}],"etymology":{"value":"\"non-\" (否定) + \"hedonic\" (快楽的な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnhiˈdɒnɪk/","syllables":"non-he-don-ic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"**Nonhedonic**\" describes something that is not related to pleasure or hedonism. It's often used in psychology, philosophy, and related fields to distinguish motivations, goals, or values that are not primarily driven by the pursuit of pleasure. It is the opposite of \"hedonic,\" which relates to pleasure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hedonic therapy focused on nonhedonic goals.","correct":"✓ The therapy focused on nonhedonic goals.","note":"Hedonic and nonhedonic are opposites. Hedonic therapy would focus on pleasure, while nonhedonic therapy would focus on goals other than pleasure."}],"priority":"★★☆"},"related_words":{"derivatives":["nonhedonism (名詞: 非快楽主義)"],"related_terms":["hedonic (形容詞: 快楽的な)","hedonism (名詞: 快楽主義)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"**nonhedonic**\" is a specialized term, primarily used in academic contexts such as psychology, philosophy, and related fields. It describes something that is not related to pleasure or the pursuit of pleasure. It is the direct opposite of \"hedonic.\" Understanding this term requires familiarity with the concept of hedonism, which is the belief that pleasure is the most important goal in life. Therefore, \"nonhedonic\" is typically encountered in advanced reading materials. "},"example_sentences":[{"sentence":"The study explored the role of nonhedonic factors in long-term well-being.","translation":"その研究は、長期的な幸福における非快楽的要因の役割を探求しました。","type":"adjective","meaning_category":"快楽的でない"},{"sentence":"Nonhedonic activities, such as volunteering, can provide a sense of purpose.","translation":"ボランティア活動のような非快楽的な活動は、目的意識を提供することができます。","type":"adjective","meaning_category":"快楽的でない"}]}