{"word":"divinization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"神格化、神聖化、神化","english_definition":"The act or process of making someone or something divine; the state of being divine.","examples":[{"sentence":"The divinization of the emperor was a key element of Roman imperial ideology.","translation":"皇帝の神格化は、ローマ帝国のイデオロギーの重要な要素でした。"},{"sentence":"Some religious traditions believe in the divinization of humanity.","translation":"いくつかの宗教的伝統は、人類の神格化を信じています。"},{"sentence":"The artist's divinization of nature is evident in his paintings.","translation":"芸術家の自然の神格化は、彼の絵画に明らかです。"}],"collocations":["achieve divinization","undergo divinization","process of divinization","doctrine of divinization"],"synonyms":["apotheosis","deification","canonization","glorification","sanctification"],"antonyms":["humanization","secularization"]}],"etymology":{"value":"From Late Latin 'divinizatio', from Latin 'divinus' (divine) + '-izare' (to make).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪvɪnaɪˈzeɪʃən/","syllables":"di-vin-i-za-tion"},"inflection":{"noun_plural":"divinizations"},"usage_notes":{"explanation":"'Divinization' refers to the process of making something or someone divine, or the state of being divine. It is often used in religious or philosophical contexts to describe the elevation of a person or concept to a godlike status. It can also be used in a more general sense to describe the idealization or glorification of something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The divinization of the idea made it more popular.","correct":"✓ The idealization of the idea made it more popular.","note":"'Divinization' is typically reserved for religious or philosophical contexts, or for things being made god-like. 'Idealization' is more appropriate for general concepts."},{"incorrect":"✗ The divinization of the hero was a surprise.","correct":"✓ The deification of the hero was a surprise.","note":"'Deification' is a more common synonym for 'divinization', especially when referring to a person becoming a god."}],"priority":"★★☆"},"related_words":{"derivatives":["divinize (verb)","divine (adjective)","divinely (adverb)"],"phrasal_verbs":[],"related_concepts":["apotheosis","theosis","deification","canonization"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Divinization' is a relatively uncommon and abstract noun that refers to the process of making something divine or godlike. It is often used in theological or philosophical discussions. Understanding this word requires a grasp of abstract concepts and a familiarity with religious or philosophical terminology. It is not typically encountered in everyday language."},"example_sentences":[{"sentence":"The ancient Egyptians practiced the divinization of pharaohs.","translation":"古代エジプト人はファラオの神格化を行っていました。","type":"noun","meaning_category":"神格化"},{"sentence":"The concept of theosis in Eastern Orthodox theology is closely related to divinization.","translation":"東方正教神学における神化の概念は、神格化と密接に関連しています。","type":"noun","meaning_category":"神格化"},{"sentence":"The poem explores the divinization of love and beauty.","translation":"その詩は、愛と美の神格化を探求しています。","type":"noun","meaning_category":"神格化"}]}