{"word":"Mormonism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"モルモン教","english_definition":"The religious faith of the Church of Jesus Christ of Latter-day Saints.","examples":[{"sentence":"Mormonism originated in the United States in the 19th century.","translation":"モルモン教は19世紀にアメリカ合衆国で始まった。"},{"sentence":"He converted to Mormonism after moving to Utah.","translation":"彼はユタ州に引っ越した後、モルモン教に改宗した。"},{"sentence":"Mormonism emphasizes family values and community service.","translation":"モルモン教は家族の価値観と地域社会への奉仕を重視する。"}],"collocations":["Church of Jesus Christ of Latter-day Saints","Mormon Church","Mormon faith","Book of Mormon","Mormon temple","Mormon missionary"],"synonyms":["Latter-day Saint movement","The Church of Jesus Christ of Latter-day Saints"],"antonyms":[]}],"etymology":{"value":"Derived from the Book of Mormon, a sacred text of the Latter-day Saint movement. The term 'Mormon' is believed to be derived from the name of a prophet-historian in the book.","priority":"★★★"},"pronunciation":{"ipa":"ˈmɔːrmənɪzəm","syllables":"Mor-mon-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Mormonism' refers specifically to the religious beliefs and practices of The Church of Jesus Christ of Latter-day Saints. It's important to note that while 'Mormon' is a common term, the official name of the church is The Church of Jesus Christ of Latter-day Saints. The term 'Mormon' can sometimes be considered offensive by members of the church, so it's best to use it respectfully or refer to the church by its full name.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Mormonism is a country.","correct":"✓ Mormonism is a religion.","note":"Mormonism is a religion, not a country or a nationality."},{"incorrect":"✗ All Mormons are from Utah.","correct":"✓ Many Mormons live in Utah, but they are found all over the world.","note":"While Utah has a large population of members of The Church of Jesus Christ of Latter-day Saints, they live worldwide."}],"priority":"★★☆"},"related_words":{"derivatives":["Mormon (noun, adjective)","Mormonize (verb)"],"phrases":["Book of Mormon","Latter-day Saint","The Church of Jesus Christ of Latter-day Saints"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but recognizable.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'Mormonism' refers to the religious system and doctrines of The Church of Jesus Christ of Latter-day Saints. It's a term often used in academic or journalistic contexts when discussing the history, theology, or cultural impact of the church. Understanding the term requires familiarity with the historical and religious context of the Latter-day Saint movement. It is important to use the term respectfully and be aware of the preferred terminology of members of the church, which is 'Latter-day Saint' or referring to the church by its full name.","priority":"★★★"},"example_sentences":[{"sentence":"Mormonism teaches the importance of personal revelation.","translation":"モルモン教は個人的な啓示の重要性を教えている。","type":"general","meaning_category":"belief"},{"sentence":"Scholars have studied the history of Mormonism extensively.","translation":"学者たちはモルモン教の歴史を広範囲に研究してきた。","type":"academic","meaning_category":"study"},{"sentence":"Mormonism has a unique perspective on the nature of God.","translation":"モルモン教は神の本質について独特な見解を持っている。","type":"theological","meaning_category":"doctrine"}]}