{"word":"antiatoms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"反原子：通常の原子を構成する粒子（陽子、中性子、電子）の対応する反粒子（反陽子、反中性子、陽電子）で構成された原子。","english_definition":"Atoms composed of antiparticles of the particles that constitute normal atoms (antiprotons, antineutrons, and positrons).","examples":[{"sentence":"Antiatoms are extremely rare and difficult to produce and study.","translation":"反原子は非常に稀であり、生成と研究が困難である。"},{"sentence":"The study of antiatoms can provide insights into the fundamental symmetries of the universe.","translation":"反原子の研究は、宇宙の基本的な対称性に関する洞察を提供することができる。"}],"collocations":["create antiatoms (反原子を生成する)","study antiatoms (反原子を研究する)","antimatter (反物質)","antiproton (反陽子)","positron (陽電子)"],"synonyms":["antimatter atoms","exotic atoms"],"antonyms":["atoms","matter atoms"]}],"etymology":{"value":"'Anti-' (反対、反) + 'atoms' (原子)","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈætəmz/","syllables":"an-ti-a-toms"},"inflection":{"noun_plural":"antiatoms"},"usage_notes":{"explanation":"'Antiatoms' are the antimatter counterparts of regular atoms. They are composed of antiparticles: antiprotons, antineutrons, and positrons, instead of protons, neutrons, and electrons. Antiatoms are extremely rare because when matter and antimatter meet, they annihilate each other, converting their mass into energy. The study of antiatoms is important for testing fundamental symmetries in physics, such as CPT symmetry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Antiatoms are the same as regular atoms.","correct":"✓ Antiatoms are made of antimatter, unlike regular atoms which are made of matter.","note":"Antiatoms are the antimatter counterparts of regular atoms, not the same. They have opposite charges and other properties."},{"incorrect":"✗ Antiatoms are easy to produce in large quantities.","correct":"✓ Antiatoms are very difficult and expensive to produce.","note":"Due to matter-antimatter annihilation, creating and containing antiatoms is extremely challenging."}],"priority":"★★☆"},"related_words":{"derivatives":["antimatter (反物質)","antiproton (反陽子)","antineutron (反中性子)","positron (陽電子)","annihilation (消滅)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な科学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antiatoms' are a specialized scientific term referring to atoms made of antimatter. Understanding this term requires knowledge of particle physics and the concept of antimatter. The word is typically used in scientific contexts, such as research papers or discussions about fundamental physics. It is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"Scientists are working to create and trap antiatoms for longer periods to study their properties.","translation":"科学者たちは、その特性を研究するために、より長い期間、反原子を生成して捕捉する研究に取り組んでいる。","type":"noun","meaning_category":"反原子"},{"sentence":"The annihilation of matter and antiatoms releases a tremendous amount of energy.","translation":"物質と反原子の消滅は、莫大なエネルギーを放出する。","type":"noun","meaning_category":"反原子"},{"sentence":"The existence of antiatoms supports the theory of antimatter.","translation":"反原子の存在は、反物質の理論を裏付けている。","type":"noun","meaning_category":"反原子"}]}