{"word":"uneulogized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"賛辞を受けなかった、追悼されなかった","english_definition":"Not praised in a eulogy; not commemorated with a formal speech or writing of praise, especially after death.","examples":[{"sentence":"He died uneulogized and largely forgotten.","translation":"彼は賛辞を受けることもなく、ほとんど忘れ去られて死んだ。"},{"sentence":"Many unsung heroes remain uneulogized in history.","translation":"歴史の中では、多くの無名の英雄たちが追悼されることなく残されている。"}],"collocations":["die uneulogized","remain uneulogized","be buried uneulogized"],"synonyms":["unpraised","uncommemorated","unrecognized","uncelebrated","unhonored"],"antonyms":["eulogized","praised","commemorated","celebrated","honored"]}],"etymology":{"value":"\"un-\" (not) + \"eulogized\" (praised in a eulogy). \"Eulogize\" comes from \"eulogy,\" which originates from the Greek word \"eulogia\" (praise).","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈjuːlədʒaɪzd/","syllables":"u-eu-lo-gized"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb."},"usage_notes":{"explanation":"\"Uneulogized\" specifically means that someone or something did not receive a formal eulogy, which is a speech or piece of writing that praises someone, especially after they have died. It suggests a lack of recognition or commemoration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The uneulogized event was a success.","correct":"✓ The uncelebrated event was a success.","note":"\"Uneulogized\" refers to a lack of praise, especially in a formal setting or after death. It is not a general synonym for \"uncelebrated.\" Use \"uncelebrated\" for events."}],"priority":"★☆☆"},"related_words":{"derivatives":["eulogize (verb): to praise highly","eulogy (noun): a speech or piece of writing that praises someone, especially after they have died"],"phrases":["unsung hero (noun): a person who makes a substantive yet unrecognized contribution; someone whose bravery is not publicly acknowledged"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"uneulogized\" is a relatively rare and sophisticated word. It specifically means that someone or something was not praised in a eulogy, which is a formal speech or writing of praise, especially after death. The word implies a lack of recognition or commemoration. It is most likely to be encountered in advanced literary or historical contexts."},"example_sentences":[{"sentence":"The artist died relatively uneulogized, his genius only recognized decades later.","translation":"その芸術家は比較的追悼されることなく亡くなり、彼の才能は何十年も経ってからようやく認められた。","type":"adjective","meaning_category":"not praised"},{"sentence":"Despite her contributions to the field, her work remained largely uneulogized.","translation":"その分野への貢献にもかかわらず、彼女の業績はほとんど追悼されることがなかった。","type":"adjective","meaning_category":"not praised"}]}