{"word":"thick-skinnedly","priority":"Low","meanings":[{"part_of_speech":"adverb","definition":"鈍感に、ずうずうしく、批判や侮辱に動じない様子で","english_definition":"In a manner that shows insensitivity to criticism or insults; in a thick-skinned way.","examples":[{"sentence":"He responded thick-skinnedly to the negative reviews, dismissing them as the work of jealous rivals.","translation":"彼は否定的なレビューに対して鈍感に対応し、嫉妬深いライバルの仕業だと一蹴した。"},{"sentence":"She navigated the political landscape thick-skinnedly, ignoring personal attacks and focusing on her goals.","translation":"彼女は政治の世界をずうずうしく切り抜け、個人的な攻撃は無視して自分の目標に集中した。"}],"collocations":["respond thick-skinnedly","act thick-skinnedly","behave thick-skinnedly","navigate thick-skinnedly"],"synonyms":["insensitively","callously","imperturbably","stoically","indifferently","unfeelingly"],"antonyms":["sensitively","thin-skinnedly","delicately","empathetically","responsively"]}],"etymology":{"value":"Derived from the adjective 'thick-skinned' (having a tough hide or being insensitive to criticism) with the addition of the adverbial suffix '-ly'.","priority":"Medium"},"pronunciation":{"ipa":"/ˌθɪkˈskɪndɪdli/","syllables":"thick-skin-ned-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Thick-skinnedly' describes the manner in which someone behaves or reacts to situations, particularly when facing criticism or insults. It implies a lack of emotional vulnerability or sensitivity. It is a relatively uncommon word, and its use can sometimes be seen as negative, suggesting a lack of empathy or awareness. The antonym 'thin-skinnedly' describes the opposite behavior, where someone is easily offended or upset by criticism.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He thick-skinned to the insult.","correct":"He responded thick-skinnedly to the insult.","note":"'Thick-skinnedly' is an adverb and should modify a verb, not be used as a verb itself. Use it to describe how someone acts or responds."},{"incorrect":"She is a thick-skinnedly person.","correct":"She is a thick-skinned person.","note":"'Thick-skinned' is the adjective form, used to describe a person. 'Thick-skinnedly' is the adverb, used to describe how someone acts."}],"priority":"Low"},"related_words":{"derivatives":["thick-skinned (adjective)","thick skin (noun)"],"phrasal_verbs":[],"priority":"Medium"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'thick-skinnedly' is an adverb that describes acting in a way that is insensitive to criticism or insults. It's formed from the adjective 'thick-skinned,' which means not easily affected by criticism, and the adverbial suffix '-ly.' Because it's not a commonly used word, it's more likely to be encountered in formal writing or speech, and understanding its meaning requires a good grasp of related vocabulary like 'insensitive' and 'criticism.'"},"example_sentences":[{"sentence":"Despite the harsh comments, the politician proceeded thick-skinnedly with the press conference.","translation":"厳しいコメントにもかかわらず、その政治家は鈍感な様子で記者会見を進めた。","type":"adverb","meaning_category":"Insensitivity to criticism"},{"sentence":"The CEO thick-skinnedly ignored the employee complaints, focusing solely on the company's profits.","translation":"CEOは従業員の苦情をずうずうしく無視し、会社の利益だけに焦点を当てた。","type":"adverb","meaning_category":"Ignoring complaints"}]}