{"word":"Acquisite","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"取得された、後天的な、獲得的な","english_definition":"Obtained or developed after birth or by experience; not innate or hereditary.","examples":[{"sentence":"Acquisite characteristics are not passed on to offspring.","translation":"後天的な特徴は子孫に受け継がれません。"},{"sentence":"His knowledge of the subject was entirely acquisite, gained through years of study.","translation":"彼のその科目に関する知識は完全に後天的で、長年の研究を通して得られたものです。"}],"collocations":["Acquisite skill","Acquisite knowledge","Acquisite characteristic","Acquisite immunity"],"synonyms":["acquired","gained","learned","developed","non-hereditary","non-innate"],"antonyms":["innate","hereditary","inborn","congenital"]}],"etymology":{"value":"Derived from the Latin word 'acquisitus', the past participle of 'acquirere' (to acquire), formed from 'ad-' (to, toward) and 'quaerere' (to seek, gain).","priority":"★★★"},"pronunciation":{"ipa":"/əkˈkwɪzɪt/","syllables":"ac-qui-site"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more acquisite, most acquisite), though these are less common."},"usage_notes":{"explanation":"The term 'acquisite' is primarily used in scientific or technical contexts to describe traits, skills, or knowledge that are not inherent but rather are gained through learning, experience, or environmental factors. It is often contrasted with 'innate' or 'hereditary' characteristics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The baby has acquisite skills.","correct":"✓ The baby has acquired skills.","note":"'Acquisite' is an adjective, whereas 'acquired' is the past participle of the verb 'acquire'. Use 'acquired' to describe skills that someone has gained."},{"incorrect":"✗ He acquisited a new language.","correct":"✓ He acquired a new language.","note":"'Acquisite' is an adjective, not a verb. The verb form is 'acquire'."}],"priority":"★★☆"},"related_words":{"derivatives":["Acquire (verb): to gain possession of; to get or obtain.","Acquisition (noun): the act of acquiring; something acquired.","Acquisitive (adjective): excessively interested in acquiring money or material things."],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, primarily used in academic or technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Acquisite' is a formal adjective used to describe something that is gained or developed after birth, rather than being innate. It's often used in scientific, medical, or academic contexts. Understanding this word helps in distinguishing between learned and inherent traits or characteristics.","priority":"★★★"},"example_sentences":[{"sentence":"The patient developed acquisite immunity to the disease after vaccination.","translation":"患者はワクチン接種後、その病気に対する後天的な免疫を獲得しました。","type":"adjective","meaning_category":"Medical/Scientific"},{"sentence":"His acquisite knowledge of art history made him a valuable member of the museum staff.","translation":"彼が後天的に得た美術史の知識は、彼を美術館の貴重なスタッフにしました。","type":"adjective","meaning_category":"General Knowledge"},{"sentence":"Acquisite behaviors can sometimes be modified through training and conditioning.","translation":"後天的な行動は、訓練や条件付けによって修正できる場合があります。","type":"adjective","meaning_category":"Psychology"}]}