{"word":"bispecific","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"二重特異的な、二重特異性を持つ","english_definition":"(of an antibody, molecule, etc.) having specificity for two different epitopes or antigens.","examples":[{"sentence":"Bispecific antibodies are being developed for cancer therapy.","translation":"二重特異性抗体は、がん治療のために開発されています。"},{"sentence":"This bispecific molecule can bind to both the tumor cell and the immune cell.","translation":"この二重特異性分子は、腫瘍細胞と免疫細胞の両方に結合することができます。"}],"collocations":["bispecific antibody","bispecific T-cell engager (BiTE)","bispecific molecule"],"synonyms":["dual-specific","bivalent"],"antonyms":["monospecific"]},{"part_of_speech":"noun","definition":"二重特異性抗体、二重特異性分子","english_definition":"a bispecific antibody or molecule.","examples":[{"sentence":"The study evaluated the efficacy of a bispecific in treating lymphoma.","translation":"その研究では、リンパ腫の治療における二重特異性抗体の有効性を評価しました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"\"bi-\" (two) + \"specific\" (having a particular property or effect).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbaɪspəˈsɪfɪk/","syllables":"bi-spe-ci-fic"},"inflection":{"notes":"Adjective: bispecific (comparative/superlative forms are rare). Noun: bispecifics"},"usage_notes":{"explanation":"The term \"bispecific\" is primarily used in the fields of immunology, biotechnology, and medicine, particularly in the context of cancer immunotherapy. It refers to molecules, most commonly antibodies, that can bind to two different targets simultaneously. This dual-targeting capability allows for novel therapeutic strategies, such as bringing immune cells into close proximity with tumor cells to enhance their destruction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The antibody is bispecificity.","correct":"✓ The antibody is bispecific.","note":"\"Bispecificity\" is a noun (the property of being bispecific), while \"bispecific\" is the adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["bispecificity"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"bispecific\" refers to a molecule, typically an antibody, that has the ability to bind to two different targets (antigens or epitopes) at the same time. This concept is primarily used in the context of immunotherapy and biotechnology, where bispecific antibodies are engineered to simultaneously target a tumor cell and an immune cell, facilitating the immune cell's ability to destroy the tumor cell. The term is relatively technical and is primarily encountered in scientific or medical contexts."},"example_sentences":[{"sentence":"The **bispecific** antibody targets both the tumor antigen and the T-cell receptor.","translation":"その二重特異性抗体は、腫瘍抗原とT細胞受容体の両方を標的とする。","type":"adjective","meaning_category":"describing a molecule"},{"sentence":"This **bispecific** has shown promising results in preclinical studies.","translation":"この二重特異性抗体は、前臨床試験で有望な結果を示している。","type":"noun","meaning_category":"referring to a bispecific antibody"}]}