{"word":"Turkism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トルコ主義、トルコ民族主義","english_definition":"A political ideology promoting the unity of Turkic peoples and the cultural and political solidarity of Turkic nations.","examples":[{"sentence":"Some scholars argue that Turkism has played a significant role in shaping modern Turkish identity.","translation":"一部の学者は、トルコ主義が現代のトルコ人のアイデンティティ形成に重要な役割を果たしてきたと主張している。"},{"sentence":"Pan-Turkism is a broader concept encompassing the unification of all Turkic-speaking populations.","translation":"汎トルコ主義は、すべてのトルコ語を話す人々の統一を包含する、より広範な概念である。"}],"collocations":["Pan-Turkism","Turkish nationalism","ideology of Turkism"],"synonyms":["Turkish nationalism","Pan-Turkism"],"antonyms":[]}],"etymology":{"value":"Derived from the word 'Turk' and the suffix '-ism', indicating a doctrine, principle, or ideology.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtɜːrkɪzəm/","syllables":"Turk-ism"},"inflection":{"noun_plural":"Turkisms"},"usage_notes":{"explanation":"Turkism is often associated with the promotion of Turkish language, culture, and history. It can also refer to the political movements advocating for the rights and interests of Turkish people.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Turkist.","correct":"✓ He is a Turkist advocate.","note":"'Turkist' is not commonly used as a noun to describe a person; instead, use 'Turkist advocate' or 'supporter of Turkism'."}],"priority":"★★☆"},"related_words":{"derivatives":["Turkic","Turkist","Turkey"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Turkism' refers to a political and cultural ideology centered on the unity and solidarity of Turkic peoples. It is a term often used in academic and political discussions related to Turkish nationalism and Pan-Turkism. Understanding the historical and cultural context is essential for interpreting its meaning accurately."},"example_sentences":[{"sentence":"The ideology of Turkism emphasizes the importance of Turkish language and culture.","translation":"トルコ主義のイデオロギーは、トルコ語と文化の重要性を強調している。","type":"noun","meaning_category":"トルコ主義"},{"sentence":"Some critics view Turkism as a form of ethnic nationalism.","translation":"一部の批評家は、トルコ主義を民族ナショナリズムの一形態と見なしている。","type":"noun","meaning_category":"トルコ主義"}]}