{"word":"killickinnic","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"a mixture of tobacco and dried leaves or bark, smoked by Native Americans of the Great Lakes region","english_definition":"a mixture of tobacco and dried leaves or bark, smoked by Native Americans of the Great Lakes region","examples":[{"sentence":"The Native Americans smoked killickinnic during their ceremonies.","translation":"ネイティブアメリカンは儀式の際にキリックキニックを喫煙した。"}],"collocations":[],"synonyms":["smoking mixture","native tobacco blend"],"antonyms":[]}],"etymology":{"value":"Likely derived from Algonquian languages, possibly related to words for 'mixture' or 'smoking'. The exact origin is uncertain due to variations in spelling and usage across different tribes and historical records.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɪlɪˈkɪnɪk/","syllables":"kil-lick-in-nic"},"inflection":{"noun_plural":"killickinnics"},"usage_notes":{"explanation":"Killickinnic refers specifically to the smoking blend used by certain Native American tribes, primarily in the Great Lakes region. It is not simply tobacco, but a mixture that often includes other plant materials like sumac leaves, willow bark, or bearberry. The composition varied by tribe and availability of resources. Today, the term is primarily historical or anthropological.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["tobacco","sumac","smoking","Native American","ceremony"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈（歴史、人類学）でのみ使用される。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'killickinnic' is highly specialized and rarely encountered outside of historical or anthropological contexts related to Native American smoking practices in the Great Lakes region. Understanding requires familiarity with indigenous cultures and historical terminology.","note":"This word is not in common usage and is primarily found in specialized texts."},"example_sentences":[{"sentence":"Early European explorers observed Native Americans smoking killickinnic in their pipes.","translation":"初期のヨーロッパの探検家は、ネイティブアメリカンがパイプでキリックキニックを喫煙しているのを観察した。","type":"noun","meaning_category":"smoking mixture"},{"sentence":"The recipe for killickinnic varied from tribe to tribe, depending on the available plants.","translation":"キリックキニックのレシピは、利用可能な植物に応じて部族ごとに異なっていた。","type":"noun","meaning_category":"smoking mixture"}]}