{"word":"typikons","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(コンピューター) 型にはまったアイコン、典型的なアイコン","english_definition":"(computing) A generic or stereotypical icon.","examples":[{"sentence":"The application used typikons for all its file types, making it difficult to distinguish them.","translation":"そのアプリケーションはすべてのファイルタイプに型にはまったアイコンを使用していたため、区別が難しかった。"}],"collocations":["generic icons","stereotypical icons"],"synonyms":["generic icon","default icon","placeholder icon"],"antonyms":["custom icon","unique icon"]}],"etymology":{"value":"A blend of 'typical' and 'icon'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/tɪˈpaɪkɒnz/","syllables":"ty-pi-kons"},"inflection":{"noun_plural":"typikons"},"usage_notes":{"explanation":"'Typikons' is a relatively uncommon term, primarily used in computing contexts to describe icons that are generic, default, or lack distinctiveness. It implies a lack of creativity or customization in icon design.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist created beautiful typikons for the website.","correct":"✓ The artist created beautiful custom icons for the website.","note":"'Typikons' implies generic icons, so using it to describe beautiful or custom icons would be contradictory."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'typikons' is a specialized term in the field of computing, referring to generic or stereotypical icons that lack uniqueness. It is not a common word and would primarily be understood by those with technical knowledge in software or graphic design."},"example_sentences":[{"sentence":"The software's interface was bland, filled with nothing but typikons.","translation":"そのソフトウェアのインターフェースは平凡で、型にはまったアイコンばかりだった。","type":"noun","meaning_category":"generic icons"},{"sentence":"Users complained that the program's typikons made it hard to quickly identify different file types.","translation":"ユーザーは、プログラムの型にはまったアイコンのせいで、さまざまなファイルタイプをすばやく識別するのが難しいと不満を述べた。","type":"noun","meaning_category":"generic icons"}]}