{"word":"derangedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"狂ったように、錯乱して、精神的に不安定な様子で","english_definition":"in a deranged manner; in a way that shows mental instability or madness.","examples":[{"sentence":"He laughed derangedly, his eyes wide and unfocused.","translation":"彼は狂ったように笑い、目は大きく見開かれ焦点が合っていなかった。"},{"sentence":"She spoke derangedly about conspiracies and hidden messages.","translation":"彼女は陰謀や隠されたメッセージについて錯乱した様子で話した。"},{"sentence":"The character acted derangedly, adding to the horror of the scene.","translation":"その登場人物は狂ったように振る舞い、シーンの恐怖を増した。"}],"collocations":["laugh derangedly","speak derangedly","act derangedly","stare derangedly"],"synonyms":["madly","insanely","crazily","unbalancedly","irrationally","dementedly"],"antonyms":["sanely","rationally","calmly","soundly","normally"]}],"etymology":{"value":"The word \"derangedly\" is formed by adding the suffix \"-ly\" to the adjective \"deranged.\" \"Deranged\" comes from the past participle of the verb \"derange,\" which originates from the Old French word \"desrengier\" meaning \"to put out of order.\" This further comes from \"des-\" (dis-, meaning apart) and \"rengier\" (to rank, arrange).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈreɪndʒdli/","syllables":"di-ranged-ly"},"inflection":{"notes":"As an adverb, \"derangedly\" does not have different inflections."},"usage_notes":{"explanation":"\"Derangedly\" is an adverb that describes actions or behaviors performed in a manner indicative of mental instability or madness. It suggests a loss of reason, coherence, or control. This word is often used in literature, film, and psychological contexts to depict characters or situations that are severely disturbed. It's a strong term and should be used carefully, as it can be stigmatizing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was derangedly happy.","correct":"✓ He was deliriously happy.","note":"\"Derangedly\" implies mental instability, so it doesn't fit with positive emotions like happiness. Use \"deliriously\" or \"ecstatically\" instead."},{"incorrect":"✗ She looked derangedly because she was tired.","correct":"✓ She looked disoriented because she was tired.","note":"\"Derangedly\" suggests a deeper mental issue than mere tiredness. Use \"disoriented\" or \"confused\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":["deranged (adjective: 精神錯乱の、狂った)","derangement (noun: 精神錯乱、狂気)","derange (verb: 狂わせる、混乱させる)"],"phrasal_verbs":[],"related_adjectives":["mad","insane","crazy","unbalanced","irrational","demented"],"related_nouns":["madness","insanity","craziness","dementia"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"derangedly\" is an adverb that means \"in a way that shows mental instability or madness.\" It is a relatively uncommon word, typically used in formal writing or when describing extreme situations involving mental disturbance. Because of its strong connotation, it's important to use it carefully and accurately."},"example_sentences":[{"sentence":"The prisoner screamed derangedly from his cell.","translation":"囚人は独房から狂ったように叫んだ。","type":"general","meaning_category":"manner"},{"sentence":"The artist painted derangedly, driven by an unknown force.","translation":"その芸術家は、未知の力に突き動かされ、錯乱したように絵を描いた。","type":"general","meaning_category":"manner"},{"sentence":"He acted derangedly after the accident, unable to recognize his family.","translation":"彼は事故後、錯乱したように振る舞い、家族を認識することができなかった。","type":"general","meaning_category":"manner"}]}