{"word":"Wesleyanism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ウェスレー主義、メソジスト","english_definition":"The theological doctrines and religious practices associated with John Wesley and the Methodist movement.","examples":[{"sentence":"Wesleyanism emphasizes personal holiness and social action.","translation":"ウェスレー主義は、個人の聖さと社会活動を重視します。"},{"sentence":"Wesleyanism spread rapidly throughout England and America.","translation":"ウェスレー主義は、イングランドとアメリカ全土に急速に広まりました。"}],"collocations":["Arminian Wesleyanism","Holiness Wesleyanism","Classic Wesleyanism"],"synonyms":["Methodism"],"antonyms":[]},{"part_of_speech":"noun","definition":"ウェスレー主義の信奉","english_definition":"Adherence to the doctrines and practices of Wesleyanism.","examples":[{"sentence":"His commitment to Wesleyanism was evident in his daily life.","translation":"彼のウェスレー主義への献身は、彼の日常生活に明らかでした。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after John Wesley (1703-1791), an Anglican cleric and theologian who founded Methodism. The suffix '-ism' denotes a system of thought or practice.","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɛsliənɪzəm/","syllables":"Wes-ley-an-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Wesleyanism is a theological tradition within Protestant Christianity that originated with John Wesley. It emphasizes the importance of personal conversion, sanctification (growing in holiness), and social justice. Key doctrines include prevenient grace (God's grace available to all), justification by faith, and the possibility of Christian perfection (living a life of love and obedience to God's will). Wesleyanism has had a significant impact on the development of Methodism and other denominations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Wesleyanism is a type of Calvinism.","correct":"✓ Wesleyanism is distinct from Calvinism, emphasizing free will and the possibility of salvation for all.","note":"Wesleyanism is Arminian in theology, which differs from Calvinism's emphasis on predestination."}],"priority":"★★☆"},"related_words":{"derivatives":["Wesleyan (adjective, noun)","Methodism (noun)","Methodist (adjective, noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency, primarily used in religious or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Wesleyanism is a term referring to the theological beliefs and practices associated with John Wesley, the founder of Methodism. It emphasizes personal holiness, social action, and the possibility of Christian perfection. The term is often used in academic or religious contexts when discussing the history and theology of Methodism and related denominations. Understanding the term requires familiarity with Christian theology and church history."},"example_sentences":[{"sentence":"Wesleyanism teaches that all people can respond to God's grace.","translation":"ウェスレー主義は、すべての人が神の恵みに応えることができると教えています。","type":"general","meaning_category":"doctrine"},{"sentence":"Many universities with 'Wesleyan' in their name have historical ties to Wesleyanism.","translation":"名前に「ウェスレーアン」と付く多くの大学は、ウェスレー主義との歴史的なつながりがあります。","type":"historical","meaning_category":"influence"}]}