{"word":"Keynesianism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ケインズ主義","english_definition":"The economic theories of John Maynard Keynes, especially the advocacy of government monetary and fiscal programs to stimulate economic activity and lessen the effects of economic recessions.","examples":[{"sentence":"Keynesianism became the dominant economic theory in many Western countries after World War II.","translation":"ケインズ主義は、第二次世界大戦後、多くの西側諸国で支配的な経済理論となった。"},{"sentence":"Critics of Keynesianism argue that government intervention can create more problems than it solves.","translation":"ケインズ主義の批判者たちは、政府の介入は解決するよりも多くの問題を生み出す可能性があると主張している。"}],"collocations":["fiscal Keynesianism (財政ケインズ主義)","monetary Keynesianism (金融ケインズ主義)","post-Keynesianism (ポスト・ケインズ主義)"],"synonyms":["Keynesian economics"],"antonyms":["classical economics","neoliberalism","monetarism"]}],"etymology":{"value":"Named after John Maynard Keynes (1883-1946), a British economist who developed these theories in response to the Great Depression.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkeɪnziənɪzəm/","syllables":"Key-ne-si-an-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Keynesianism is an economic philosophy advocating for active government intervention to manage aggregate demand and stabilize the economy, particularly during recessions. It suggests that government spending and tax policies can influence macroeconomic trends.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Keynesianism is a person.","correct":"✓ Keynesianism is an economic theory.","note":"Keynesianism is not a person but an economic theory named after John Maynard Keynes."}],"priority":"★★☆"},"related_words":{"derivatives":["Keynesian (adjective, noun)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent, but common in economics and political science contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Keynesianism is a complex economic theory that suggests governments should actively manage the economy, especially during downturns, by adjusting spending and taxes. It's named after economist John Maynard Keynes and is often debated in economics and politics. Understanding it requires some knowledge of economic principles."},"example_sentences":[{"sentence":"The government adopted Keynesianism policies to combat the recession.","translation":"政府は不況に対抗するためにケインズ主義政策を採用した。","type":"general","meaning_category":"economic theory"},{"sentence":"The debate between Keynesianism and free-market economics continues to this day.","translation":"ケインズ主義と自由市場経済の間の議論は今日まで続いている。","type":"general","meaning_category":"economic theory"}]}