{"word":"subserviently","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"従順に、卑屈に、献身的に","english_definition":"in a manner that shows an excessive willingness to serve or obey others; in a subordinate or compliant way.","examples":[{"sentence":"He acted subserviently towards his boss, always agreeing with everything he said.","translation":"彼は上司に対して従順に振る舞い、常に彼の言うことに同意していた。"},{"sentence":"She listened subserviently to the instructions, eager to please.","translation":"彼女は喜んで従おうと、指示に献身的に耳を傾けた。"},{"sentence":"The character was portrayed as subserviently following the orders of the dictator.","translation":"そのキャラクターは、独裁者の命令に卑屈に従うように描かれていた。"}],"collocations":["act subserviently","behave subserviently","listen subserviently","follow orders subserviently","treat someone subserviently"],"synonyms":["obsequiously","servilely","slavishly","submissively","deferentially","humbly","compliantly","obediently"],"antonyms":["assertively","independently","domineeringly","authoritatively","disobediently","rebelliously"]}],"etymology":{"value":"The word 'subserviently' is derived from the adjective 'subservient,' which comes from the Latin 'subserviens,' the present participle of 'subservire,' meaning 'to serve under.' This is composed of 'sub-' (under) and 'servire' (to serve). The suffix '-ly' turns the adjective into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/səbˈsɜːrviəntli/","syllables":"sub-ser-vi-ent-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Subserviently' describes an action or behavior that demonstrates a willingness to obey or serve others to an excessive degree. It often carries a negative connotation, suggesting a lack of independence or self-respect. The adverb emphasizes the manner in which someone is acting, highlighting their eagerness to please or comply with the wishes of someone in authority.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He subserviently the manager.","correct":"✓ He acted subserviently towards the manager.","note":"'Subserviently' is an adverb and modifies a verb, not a noun. You need to use a verb like 'act,' 'behave,' or 'respond' to show how someone is acting in a subservient manner."},{"incorrect":"✗ She was subserviently, which made her colleagues uncomfortable.","correct":"✓ She was subservient, which made her colleagues uncomfortable. / ✓ She acted subserviently, which made her colleagues uncomfortable.","note":"'Subservient' is the adjective form, describing the person. 'Subserviently' is the adverb, describing how she acted."}],"priority":"★★☆"},"related_words":{"derivatives":["subservient (adjective)","subservience (noun)"],"phrases":["subservient attitude","subservient role","subservient position"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'subserviently' is an adverb that describes the manner of acting in an excessively compliant or obedient way. It suggests a willingness to subordinate one's own desires or opinions to those of another, often to an extreme degree. This word is typically used in formal contexts to describe behavior that lacks independence or self-assertion. Because of its nuanced meaning and relatively infrequent use, it is more commonly encountered by advanced English language learners."},"example_sentences":[{"sentence":"The junior employee listened subserviently as the senior manager outlined the project's goals.","translation":"その若手社員は、上級管理職がプロジェクトの目標を概説するのを従順に聞いていた。","type":"adverb","meaning_category":"従順に"},{"sentence":"The small nation behaved subserviently to the larger, more powerful country to avoid conflict.","translation":"その小国は、紛争を避けるために、より大きく強力な国に対して卑屈に振る舞った。","type":"adverb","meaning_category":"卑屈に"},{"sentence":"She worked subserviently, hoping to gain favor with her superiors.","translation":"彼女は上司の好意を得ようと、献身的に働いた。","type":"adverb","meaning_category":"献身的に"}]}