{"word":"implasticity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"弾塑性を持たないこと、非塑性。材料が塑性変形を起こさない性質。","english_definition":"The state or quality of not being plastic; the absence of plasticity. The property of a material that prevents it from undergoing permanent deformation.","examples":[{"sentence":"The implasticity of the material made it unsuitable for the intended application.","translation":"その材料の非塑性のため、意図された用途には適していなかった。"},{"sentence":"The study focused on the implasticity of ceramics under high stress.","translation":"その研究は、高応力下でのセラミックスの非塑性に焦点を当てた。"}],"collocations":["material implasticity","exhibit implasticity","degree of implasticity"],"synonyms":["nonplasticity","rigidity","brittleness"],"antonyms":["plasticity","ductility","malleability"]}],"etymology":{"value":"'im-' (否定の接頭辞) + 'plasticity' (塑性)","priority":"★★★"},"pronunciation":{"ipa":"ˌɪmplæˈstɪsɪti","syllables":"im-plas-tic-i-ty"},"inflection":{"noun_plural":"implasticities"},"usage_notes":{"explanation":"'Implasticity' is a technical term primarily used in materials science, engineering, and physics to describe the lack of plasticity in a material. It indicates that the material will not undergo permanent deformation when subjected to stress; instead, it will either return to its original shape (elasticity) or fracture. It is the opposite of plasticity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The implasticity of the rubber band made it stretch easily.","correct":"✓ The elasticity of the rubber band made it stretch easily.","note":"Rubber bands are known for their elasticity, not implasticity. Implasticity implies a lack of deformation ability."}],"priority":"★☆☆"},"related_words":{"derivatives":["implastic (adjective)"],"related_terms":["elasticity","plasticity","stress","strain","deformation","fracture","yield strength"]},"level_frequency":{"CEFR":"C2 (Technical Vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Implasticity' is a specialized term used in technical fields like materials science and engineering. It refers to the absence of plasticity in a material, meaning the material does not undergo permanent deformation when stress is applied. Instead, it will either return to its original shape or break. This term is not commonly used in everyday language. Understanding requires a background in material properties.","priority":"★★☆"},"example_sentences":[{"sentence":"The high implasticity of the diamond makes it very hard but also brittle.","translation":"ダイヤモンドの高い非塑性は、非常に硬いが脆くもある理由である。","type":"general","meaning_category":"material property"},{"sentence":"The engineer considered the implasticity of the concrete when designing the bridge.","translation":"エンジニアは橋を設計する際、コンクリートの非塑性を考慮した。","type":"engineering","meaning_category":"application"}]}