{"word":"axoplasmic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"軸索原形質の、軸索形質の","english_definition":"Relating to the axoplasm (the cytoplasm of an axon).","examples":[{"sentence":"Axoplasmic transport is essential for the function of neurons.","translation":"軸索原形質輸送はニューロンの機能に不可欠である。"},{"sentence":"The axoplasmic flow carries proteins and organelles along the axon.","translation":"軸索原形質流はタンパク質とオルガネラを軸索に沿って運ぶ。"}],"collocations":["axoplasmic transport","axoplasmic flow"],"synonyms":["axonal"],"antonyms":[]}],"etymology":{"value":"Formed from 'axoplasm' (axon + cytoplasm) + '-ic'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæksoʊˈplæzmɪk/","syllables":"ax-o-plas-mic"},"inflection":{"notes":"Not applicable for adjectives."},"usage_notes":{"explanation":"'Axoplasmic' is a technical term used in biology, specifically in the context of neurons and their axons. It describes something that is related to or part of the axoplasm, which is the cytoplasm found within an axon. Axoplasmic transport, for example, refers to the movement of materials within the axoplasm along the axon.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell was axoplasmic.","correct":"✓ The axon was axoplasmic.","note":"'Axoplasmic' specifically relates to the axon, so it's more accurate to use it to describe the axon itself or processes within the axon, rather than a general cell. "},{"incorrect":"✗ Axoplasmic is a type of cell.","correct":"✓ Axoplasm is a component of a neuron's axon.","note":"'Axoplasmic' is an adjective, not a noun. Axoplasm is the substance."}],"priority":"★★☆"},"related_words":{"derivatives":["axoplasm"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'axoplasmic' is a highly specialized term used within the field of neuroscience and cell biology. Understanding its meaning requires familiarity with the structure of neurons, particularly the axon and its cytoplasm (axoplasm). Therefore, it is typically encountered in advanced scientific texts and discussions. "},"example_sentences":[{"sentence":"The rate of axoplasmic transport can be affected by certain neurodegenerative diseases.","translation":"軸索原形質輸送の速度は、特定の神経変性疾患によって影響を受ける可能性がある。","type":"adjective","meaning_category":"Relating to axoplasm"},{"sentence":"Studies have shown that disruptions in axoplasmic flow can lead to neuronal dysfunction.","translation":"研究により、軸索原形質流の混乱がニューロン機能障害につながる可能性があることが示されている。","type":"adjective","meaning_category":"Relating to axoplasm"}]}