{"word":"dichromasy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"二色性、二色型色覚","english_definition":"A condition in which only two of the three cone pigments are present in the eye, resulting in a reduced ability to distinguish colors.","examples":[{"sentence":"Dichromasy is a type of color blindness where one of the three primary color mechanisms is absent or malfunctioning.","translation":"二色性は、三原色のうち一つが欠如または機能不全である色覚異常の一種です。"},{"sentence":"People with dichromasy can typically distinguish between 10,000 different colors, while those with normal vision can distinguish about 1 million.","translation":"二色性の人は通常1万色の識別が可能ですが、正常な視力を持つ人は約100万色を識別できます。"}],"collocations":["have dichromasy","dichromasy test","types of dichromasy"],"synonyms":["color blindness","color vision deficiency"],"antonyms":["trichromacy (normal color vision)"]},{"part_of_speech":"noun","definition":"（鉱物などの）二色性","english_definition":"The property of a substance (e.g., a mineral) exhibiting two different colors when viewed through a dichroscope or when viewed along different axes of polarized light.","examples":[{"sentence":"Some minerals exhibit dichromasy, displaying different colors depending on the angle of light.","translation":"一部の鉱物は二色性を示し、光の角度によって異なる色を表示します。"},{"sentence":"The dichromasy of tourmaline can be used to help identify the mineral.","translation":"トルマリンの二色性は、鉱物の識別に役立ちます。"}],"collocations":["exhibit dichromasy","dichromasy in minerals","optical dichromasy"],"synonyms":["pleochroism"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'di-' (two) + 'chroma' (color) + '-asy' (state or condition).","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈkroʊməsi/","syllables":"di-chro-ma-sy"},"inflection":{"noun_plural":"dichromasies"},"usage_notes":{"explanation":"'Dichromasy' refers to two distinct concepts: a type of color blindness in humans and the property of certain substances (especially minerals) to display different colors depending on the viewing angle or light polarization. When referring to human vision, it's a specific kind of color vision deficiency.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has dichromatism.","correct":"✓ He has dichromasy.","note":"'Dichromatism' is a related but distinct term, sometimes used interchangeably, but 'dichromasy' is more precise for describing the condition of having only two functioning cone types."}],"priority":"★★☆"},"related_words":{"derivatives":["dichromatic (adjective)"],"phrasal_verbs":[],"related_terms":["protanopia (red-blindness)","deuteranopia (green-blindness)","tritanopia (blue-blindness)","color vision deficiency (CVD)","cone","retina"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dichromasy' is a technical term used in the context of color vision and mineralogy. It refers either to a specific type of color blindness where only two color receptors are functional, or to the property of certain materials to exhibit different colors under different lighting conditions. Understanding this term requires some background knowledge in biology (for color vision) or mineralogy (for material properties)."},"example_sentences":[{"sentence":"His dichromasy made it difficult for him to distinguish between red and green.","translation":"彼の二色性のために、赤と緑の区別が困難でした。","type":"medical/biological"},{"sentence":"The dichromasy of the gemstone was a key factor in its identification.","translation":"宝石の二色性は、その識別の重要な要素でした。","type":"mineralogical"}]}