{"word":"promulgations","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"公布、発布、公布された法令","english_definition":"the action of making something known to the public; the state of being promulgated; a law or decree that has been promulgated.","examples":[{"sentence":"The promulgation of the new regulations was met with mixed reactions.","translation":"新しい規則の公布は賛否両論の反応を呼んだ。"},{"sentence":"The government announced the promulgation of the emergency decree.","translation":"政府は緊急勅令の発布を発表した。"},{"sentence":"The official promulgation of the treaty took place last week.","translation":"条約の正式な公布は先週行われた。"}],"collocations":["official promulgation","public promulgation","promulgation of a law","promulgation of regulations","promulgation of a decree"],"synonyms":["announcement","declaration","publication","proclamation","dissemination","enactment"],"antonyms":["suppression","concealment","withholding"]}],"etymology":{"value":"Derived from the Latin word 'promulgare,' meaning 'to make known publicly, to publish.' This comes from 'pro-' (forth, publicly) and 'mulgere' (to milk), metaphorically suggesting the bringing forth of something for public consumption.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌprɒməlˈɡeɪʃənz/","syllables":"pro-mul-ga-tions"},"inflection":{"noun_plural":"promulgations"},"usage_notes":{"explanation":"'Promulgations' refers specifically to the act of formally announcing or publishing a law, decree, or regulation so that it becomes known to the public. It often implies an official or authoritative action. The term is typically used in legal or governmental contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The promulgations of the rumors caused panic.","correct":"✓ The spread of the rumors caused panic.","note":"'Promulgations' is used for formal announcements, not for spreading informal information like rumors."},{"incorrect":"✗ The promulgation was very secret.","correct":"✓ The announcement was very secret. / The promulgation was not publicized.","note":"'Promulgation' inherently implies making something public, so a secret promulgation is contradictory."}],"priority":"★☆☆"},"related_words":{"derivatives":["promulgate (verb): to make known to the public; to put a law or decree into effect by official proclamation.","promulgator (noun): a person who promulgates something."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily found in legal and official documents.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Promulgations' is a formal term referring to the official public announcement of a law or decree. It's used in legal and governmental contexts. Understanding this word requires familiarity with formal language and legal processes.","priority":"★☆☆"},"example_sentences":[{"sentence":"The president signed the bill, leading to its official promulgations.","translation":"大統領が法案に署名し、それが正式に公布されることになった。","type":"noun","meaning_category":"公布された法令"},{"sentence":"The promulgations of the new safety standards were essential for protecting workers.","translation":"新しい安全基準の公布は、労働者を保護するために不可欠だった。","type":"noun","meaning_category":"公布"},{"sentence":"The city council debated the timing of the promulgations of the zoning changes.","translation":"市議会は、ゾーニング変更の公布のタイミングについて議論した。","type":"noun","meaning_category":"公布"}]}