{"word":"valetudinariness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"病弱であること、健康に不安があること、健康を過度に気遣うこと","english_definition":"The state of being chronically ill or having an anxious concern about one's health.","examples":[{"sentence":"His valetudinariness made him constantly worry about catching a cold.","translation":"彼の病弱さは、常に風邪をひくことを心配させた。"},{"sentence":"She was known for her valetudinariness, always consulting doctors for minor ailments.","translation":"彼女は病弱さで知られており、いつも些細な病気で医者に相談していた。"}],"collocations":["chronic valetudinariness","extreme valetudinariness","nervous valetudinariness"],"synonyms":["infirmity","debility","weakness","frailty","hypochondria"],"antonyms":["robustness","health","vigor","well-being"]}],"etymology":{"value":"From the Latin word 'valetudo' meaning 'state of health', combined with the suffix '-ariness' indicating a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvæləˌtjuːdɪˈnɛərɪnəs/","syllables":"va-le-tu-di-nar-i-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Valetudinariness' refers to a state of being unwell or overly concerned about one's health. It often implies a chronic condition or a tendency to worry excessively about minor ailments. The word is relatively uncommon in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great valetudinariness by running the marathon.","correct":"✓ He showed great fortitude by running the marathon.","note":"'Valetudinariness' implies weakness, while fortitude implies strength. They are antonyms in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["valetudinary (adjective: 病弱な, noun: 病弱者)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Valetudinariness' is a rare and complex word that describes the state of being chronically ill or overly concerned about one's health. It is not commonly used in everyday conversation and is more likely to be found in formal writing or medical contexts. Understanding this word requires a strong vocabulary and familiarity with Latin roots."},"example_sentences":[{"sentence":"The old man's valetudinariness kept him confined to his home.","translation":"その老人の病弱さは彼を家に閉じ込めていた。","type":"general","meaning_category":"病弱であること"},{"sentence":"Her valetudinariness was a constant source of anxiety for her family.","translation":"彼女の病弱さは、家族にとって絶え間ない不安の種だった。","type":"general","meaning_category":"健康に不安があること"},{"sentence":"Some viewed his frequent doctor visits as a sign of valetudinariness rather than genuine illness.","translation":"彼の頻繁な医者通いは、真の病気というよりは健康を過度に気遣うことの表れだと見る人もいた。","type":"general","meaning_category":"健康を過度に気遣うこと"}]}