{"word":"hemilingual","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"片言しか話せない、言語能力が不完全な","english_definition":"Speaking a language imperfectly; having incomplete language skills.","examples":[{"sentence":"He's hemilingual in French, able to understand but not speak fluently.","translation":"彼はフランス語を片言しか話せず、理解はできるが流暢に話すことはできない。"},{"sentence":"The study focused on hemilingual children and their language development.","translation":"その研究は、言語能力が不完全な子供たちとその言語発達に焦点を当てた。"}],"collocations":["hemilingual speaker","hemilingual child","hemilingual proficiency"],"synonyms":["semilingual","limited language proficiency"],"antonyms":["bilingual","multilingual","fluent"],"notes":"Often used in the context of second language acquisition or language disorders."}],"etymology":{"value":"Derived from the Greek prefix 'hemi-' meaning 'half' and 'lingual' relating to language.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛmiˈlɪŋɡwəl/","syllables":"hem-i-lin-gual"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'hemilingual' is often used to describe individuals who have not fully developed proficiency in either their first or second language. It implies a level of language ability that is less than fluent or native-like. It is sometimes used in educational or clinical settings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is hemilingual because he only speaks one language.","correct":"He is monolingual because he only speaks one language.","note":"'Hemilingual' implies partial proficiency, not speaking only one language."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["semilingualism","bilingualism","multilingualism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hemilingual' is a specialized term used to describe someone who has limited proficiency in a language. It is not a common word and is typically used in academic or clinical contexts related to language acquisition and development. The word implies that the person's language skills are incomplete, but they are not completely unable to communicate in the language.","priority":"★★☆"},"example_sentences":[{"sentence":"The program aims to support hemilingual students in developing their language skills.","translation":"そのプログラムは、言語能力が不完全な学生が言語スキルを向上させるのを支援することを目的としている。","type":"general","meaning_category":"Language Proficiency"}]}