{"word":"aminoaciduria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アミノ酸尿症","english_definition":"The presence of excessive amounts of amino acids in the urine.","examples":[{"sentence":"Aminoaciduria can be caused by genetic disorders.","translation":"アミノ酸尿症は遺伝性疾患によって引き起こされることがある。"},{"sentence":"Screening for aminoaciduria is important in newborns.","translation":"新生児におけるアミノ酸尿症のスクリーニングは重要である。"}],"collocations":["renal aminoaciduria (腎性アミノ酸尿症)","primary aminoaciduria (原発性アミノ酸尿症)","secondary aminoaciduria (続発性アミノ酸尿症)"],"synonyms":["amino aciduria"],"antonyms":[]}],"etymology":{"value":"amino acid + -uria (urineを意味する接尾辞)","priority":"★★★"},"pronunciation":{"ipa":"/əˌmiːnoʊˌæsɪdˈjʊəriə/","syllables":"a-mi-no-a-ci-du-ri-a"},"inflection":{"noun_plural":"aminoacidurias"},"usage_notes":{"explanation":"Aminoaciduria refers to a condition characterized by abnormal levels of amino acids in the urine. It can be caused by various factors, including genetic disorders, kidney problems, or other underlying medical conditions. Diagnosis typically involves urine tests to measure the levels of different amino acids.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Aminoaciduria is a type of amino acid.","correct":"✓ Aminoaciduria is a condition with high levels of amino acids in urine.","note":"Aminoaciduria is not an amino acid itself, but a condition where there are excessive amino acids in the urine."}],"priority":"★★☆"},"related_words":{"derivatives":["amino acid","uria"],"phrasal_verbs":[]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Aminoaciduria is a medical term referring to the presence of abnormally high levels of amino acids in the urine. This condition can result from genetic disorders, kidney dysfunction, or other underlying health issues. Diagnosis typically involves laboratory analysis of urine samples to quantify amino acid levels. Understanding this term requires familiarity with medical terminology and biochemical concepts."},"example_sentences":[{"sentence":"The newborn screening test revealed possible aminoaciduria, necessitating further investigation.","translation":"新生児スクリーニング検査でアミノ酸尿症の可能性が示唆され、さらなる調査が必要となった。","type":"noun","meaning_category":"アミノ酸尿症"},{"sentence":"Certain genetic mutations can lead to the development of aminoaciduria.","translation":"特定の遺伝子変異はアミノ酸尿症の発症につながる可能性がある。","type":"noun","meaning_category":"アミノ酸尿症"}]}