{"word":"defamation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"名誉毀損、中傷","english_definition":"the action of damaging the good reputation of someone; slander or libel.","examples":[{"sentence":"He sued the newspaper for defamation of character.","translation":"彼は新聞を名誉毀損で訴えた。"},{"sentence":"The article contained several defamatory statements.","translation":"その記事にはいくつかの名誉を毀損する記述が含まれていた。"},{"sentence":"She claimed that the accusations were a deliberate act of defamation.","translation":"彼女は、その告発は意図的な名誉毀損行為であると主張した。"}],"collocations":["commit defamation (名誉毀損を行う)","suffer defamation (名誉毀損に苦しむ)","defamation lawsuit (名誉毀損訴訟)","defamation of character (人格に対する名誉毀損)","online defamation (ネット上での名誉毀損)"],"synonyms":["slander","libel","vilification","calumny","aspersion","traducement","character assassination"],"antonyms":["praise","commendation","acclaim","eulogy","adulation"]}],"etymology":{"value":"Late Middle English: from Old French diffamacion, from late Latin diffamatio(n-), from diffamare ‘spread evil report of’, from dis- (expressing reversal) + fama ‘reputation’.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdefəˈmeɪʃən/","syllables":"de·fa·ma·tion"},"inflection":{"noun_form":{"plural":"defamations"}},"usage_notes":{"explanation":"\"Defamation\" is a legal term that refers to the act of harming someone's reputation through false statements. It can take two forms: libel (written defamation) and slander (spoken defamation). To prove defamation, the plaintiff (the person who claims to have been defamed) typically needs to show that the statement was false, published to a third party, caused harm to their reputation, and, in some cases, was made with malice (knowledge that the statement was false or reckless disregard for its truth). The specific laws regarding defamation vary by jurisdiction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He made a defamation about her.","correct":"✓ He committed defamation against her. / ✓ He defamed her.","note":"\"Defamation\" is a noun, so it's more common to say someone \"committed defamation\" or \"engaged in defamation.\" Alternatively, you can use the verb \"defame.\""},{"incorrect":"✗ He is suing her for defame.","correct":"✓ He is suing her for defamation.","note":"\"Defame\" is a verb, while \"defamation\" is the noun form. In this context, you need the noun."},{"incorrect":"✗ Slander is written defamation, and libel is spoken defamation.","correct":"✓ Libel is written defamation, and slander is spoken defamation.","note":"Slander is spoken, libel is written. It's a common mistake to mix these up."}],"priority":"★★☆"},"related_words":{"derivatives":["defame (verb: to damage the good reputation of someone)","defamer (noun: a person who defames)","defamatory (adjective: damaging to someone's reputation)"],"legal_terms":["libel (noun: written defamation)","slander (noun: spoken defamation)","tort (noun: a civil wrong that causes someone else to suffer loss or harm resulting in legal liability for the person who commits the tortious act)","negligence (noun: failure to take proper care in doing something)","malice (noun: the intention or desire to do evil; ill will)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively infrequent, but used in legal and journalistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Defamation\" is a legal term referring to the act of harming someone's reputation through false statements. It's a more formal word often used in legal or journalistic contexts when discussing lawsuits or accusations related to damaging someone's good name. Understanding the difference between libel (written defamation) and slander (spoken defamation) is important when discussing this topic. The word implies a serious accusation with potential legal consequences."},"example_sentences":[{"sentence":"The celebrity brought a defamation case against the tabloid magazine.","translation":"その有名人は、タブロイド誌に対して名誉毀損訴訟を起こした。","type":"noun","meaning_category":"名誉毀損"},{"sentence":"The website was accused of publishing defamatory content.","translation":"そのウェブサイトは、名誉を毀損するコンテンツを掲載したとして非難された。","type":"adjective (defamatory)","meaning_category":"名誉毀損の"},{"sentence":"He threatened to defame her reputation if she didn't comply.","translation":"彼は、彼女が従わなければ彼女の名声を傷つけると脅した。","type":"verb (defame)","meaning_category":"名誉を毀損する"}]}