{"word":"Proteinphobia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"タンパク質恐怖症：タンパク質を含む食品に対する病的な恐怖または嫌悪感","english_definition":"An irrational fear or aversion to protein-rich foods.","examples":[{"sentence":"Some individuals with eating disorders may exhibit proteinphobia, severely restricting their intake of protein-rich foods.","translation":"摂食障害を持つ人の中には、タンパク質恐怖症を示し、タンパク質が豊富な食品の摂取を厳しく制限する人もいます。"}],"collocations":["develop proteinphobia","exhibit proteinphobia","overcome proteinphobia"],"synonyms":["fear of protein","aversion to protein"],"antonyms":["proteinophilia (hypothetical)"]}],"etymology":{"value":"\"Protein\"（タンパク質）+ \"phobia\"（恐怖症）の組み合わせ。","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊtiːnˈfoʊbiə/","syllables":"pro-tein-pho-bi-a"},"inflection":{"noun_plural":"proteinphobias"},"usage_notes":{"explanation":"Proteinphobia is a relatively rare and specific phobia, often associated with underlying psychological issues such as eating disorders or obsessive-compulsive tendencies. It is not a widely recognized or formally classified phobia in standard diagnostic manuals, but it is used to describe a genuine and debilitating fear in some individuals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has proteinphobia, so he eats a lot of meat.","correct":"✓ He has proteinphobia, so he avoids meat and other protein-rich foods.","note":"Proteinphobia involves avoiding protein-rich foods, not consuming them in large quantities."}],"priority":"★★☆"},"related_words":{"derivatives":["proteinphobic (adjective)"],"phobias":["food phobia","eating disorder"],"nutrition":["protein","amino acids"]},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学・心理学分野以外ではほとんど使われない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Proteinphobia\" is a specialized term referring to an irrational fear of protein-rich foods. It is not a common term and is primarily used in the context of eating disorders or specific psychological conditions. Understanding this term requires a good grasp of both biological and psychological vocabulary."},"example_sentences":[{"sentence":"The therapist worked with the patient to address her underlying anxiety and overcome her proteinphobia.","translation":"セラピストは、患者の根底にある不安に対処し、タンパク質恐怖症を克服するために協力しました。","type":"general","meaning_category":"general"},{"sentence":"Proteinphobia can lead to nutritional deficiencies if not properly managed.","translation":"タンパク質恐怖症は、適切に管理されない場合、栄養不足につながる可能性があります。","type":"medical","meaning_category":"medical"}]}