{"word":"tear-blinded","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"涙で目がくらんだ、涙で視界が遮られた","english_definition":"Having one's vision obscured or impaired by tears.","examples":[{"sentence":"She stumbled forward, tear-blinded and unable to see where she was going.","translation":"彼女はよろめきながら前に進んだ。涙で目がくらみ、どこへ向かっているのかわからなかった。"},{"sentence":"He gave a tear-blinded wave as the train pulled away.","translation":"列車が動き出すと、彼は涙で視界がぼやけた状態で手を振った。"},{"sentence":"The tear-blinded child reached out for his mother.","translation":"涙で目がかすんだ子供は母親に手を伸ばした。"}],"collocations":["tear-blinded eyes","tear-blinded vision","tear-blinded gaze"],"synonyms":["blinded by tears","eyes filled with tears","unable to see through tears"],"antonyms":["clear-eyed","dry-eyed","with clear vision"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'tear' (referring to the liquid secreted by the eyes) and 'blinded' (having impaired or lost vision). The combination describes the state of having one's vision impaired specifically due to tears.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɪərˌblaɪndɪd/","syllables":"tear-blind-ed"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Tear-blinded' is a descriptive adjective that vividly conveys the emotional state of someone who is crying intensely, to the point where their vision is affected. It is often used in literature and descriptive writing to create a strong image of sadness, grief, or other intense emotions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was tear-blinded of sadness.","correct":"✓ She was tear-blinded by sadness.","note":"While 'tear-blinded' describes the state, 'by' is often used to indicate the cause or reason for the state. However, the adjective itself already implies the cause (tears), so the prepositional phrase is often omitted: 'She was tear-blinded.'"},{"incorrect":"✗ He felt tear-blinded.","correct":"✓ He was tear-blinded.","note":"'Tear-blinded' describes a state of being, so it's more common to use it with the verb 'to be' rather than 'to feel.' While 'He felt tearful' is correct, 'He felt tear-blinded' is less common."}],"priority":"★☆☆"},"related_words":{"derivatives":["tearful (adjective: 涙もろい、悲しげな)","teary (adjective: 涙ぐんだ、涙でいっぱいの)","blinded (adjective: 目が見えない、見えなくされた)"],"phrasal_verbs":[],"related_concepts":["grief","sorrow","despair","emotional distress","crying","weeping"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency. More common in literary or descriptive contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tear-blinded' is a relatively uncommon and descriptive adjective that combines the concepts of tears and blindness. It is used to vividly portray the state of someone whose vision is obscured by tears, typically due to intense emotion. The word is more likely to be encountered in literary or descriptive writing rather than everyday conversation. Understanding the individual components ('tear' and 'blinded') helps in grasping the meaning of the compound word."},"example_sentences":[{"sentence":"The grieving widow gave a tear-blinded eulogy at her husband's funeral.","translation":"悲しみに暮れる未亡人は、夫の葬儀で涙で視界が遮られた状態で弔いの言葉を述べた。","type":"adjective","meaning_category":"vision obscured by tears"},{"sentence":"He searched frantically for his lost child, his vision tear-blinded by fear.","translation":"彼は必死に迷子になった子供を探した。恐怖で涙が溢れ、視界が遮られていた。","type":"adjective","meaning_category":"vision obscured by tears"},{"sentence":"The movie's emotional climax left many in the audience tear-blinded.","translation":"映画の感情的なクライマックスは、多くの観客を涙で目がかすんだ状態にした。","type":"adjective","meaning_category":"vision obscured by tears"}]}