{"word":"Syrtic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(主に天文学で)大シルチス高原に関連する、または大シルチス高原に特徴的な","english_definition":"Relating to or characteristic of Syrtis Major, especially in astronomy.","examples":[{"sentence":"The Syrtic albedo features are prominent in early telescopic observations of Mars.","translation":"シルチス的アルベド地形は、初期の火星の望遠鏡観測で顕著に見られます。"}],"collocations":["Syrtic Major","Syrtic dust storms"],"synonyms":["Martian","areal"],"antonyms":[]}],"etymology":{"value":"Derived from 'Syrtis Major', a dark region (albedo feature) on the planet Mars. 'Syrtis' comes from the classical name for the Gulf of Sidra off the coast of Libya, known for its quicksands and dangerous shoals.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɜːrtɪk/","syllables":"Syr-tic"},"inflection":{"notes":"Adjective, no standard inflections apply."},"usage_notes":{"explanation":"The term 'Syrtic' is almost exclusively used within the context of Martian geography and astronomy, referring to features or phenomena associated with the Syrtis Major Planum region on Mars. It is not a commonly used word outside of this specific scientific context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The syrtic desert was hot.","correct":"✓ The Martian desert was hot.","note":"'Syrtic' specifically refers to features related to Syrtis Major on Mars, not general deserts. Use 'Martian' for general references to Mars."}],"priority":"★★☆"},"related_words":{"derivatives":["Syrtis Major (大シルチス高原)","Syrtis (シルチス)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency - specialized astronomical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Syrtic' is a highly specialized term primarily used in astronomy and planetary science. It refers specifically to features or phenomena related to Syrtis Major Planum, a prominent dark region on Mars. Due to its limited context and technical nature, it is not part of general vocabulary and would only be encountered in specialized scientific literature or discussions. Understanding requires prior knowledge of Martian geography.","priority":"★★☆"},"example_sentences":[{"sentence":"The Syrtic slopes are believed to be composed of basaltic rock.","translation":"シルチス斜面は玄武岩質の岩石で構成されていると考えられています。","type":"adjective","meaning_category":"大シルチス高原に関連する"},{"sentence":"Observations revealed a Syrtic dust storm developing in the southern hemisphere.","translation":"観測により、南半球でシルチス的砂塵嵐が発生していることが明らかになりました。","type":"adjective","meaning_category":"大シルチス高原に特徴的な"}]}