{"word":"Berogue","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"To denounce or criticize severely; to attack the reputation of someone.","english_definition":"To denounce or criticize severely; to attack the reputation of someone.","examples":[{"sentence":"The politician was berogued by the media for his controversial statements.","translation":"その政治家は物議を醸す発言をしたことでメディアから厳しく非難された。"},{"sentence":"She felt berogued by her colleagues after the project failed.","translation":"プロジェクトが失敗した後、彼女は同僚から非難されたと感じた。"}],"collocations":["berogue someone publicly","berogue someone in the press"],"synonyms":["vilify","denigrate","defame","slander","malign"],"antonyms":["praise","commend","extol"]}],"etymology":{"value":"Likely a blend of 'belittle' and 'rogue,' suggesting the act of portraying someone as a scoundrel or unreliable person.","priority":"★☆☆"},"pronunciation":{"ipa":"/bɪˈroʊɡ/","syllables":"bi-rogue"},"inflection":{"verb_forms":{"present_simple":["berogue","berogues"],"past_simple":"berogued","past_participle":"berogued","present_participle":"beroguing"}},"usage_notes":{"explanation":"'Berogue' is a relatively rare and informal verb, primarily used to describe the act of publicly and harshly criticizing someone, often with the intent to damage their reputation. It carries a stronger connotation of malicious intent than simple criticism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He berogued the situation.","correct":"✓ He berogued the politician.","note":"'Berogue' typically takes a person as its object, not a situation or thing."},{"incorrect":"✗ She was berogued for her honesty.","correct":"✓ She was criticized for her honesty.","note":"'Berogue' implies a negative assessment, so it's unlikely to be used in conjunction with positive qualities like honesty."}],"priority":"★☆☆"},"related_words":{"derivatives":["beroguement (noun, rare: the act of beroguing)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (low frequency)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Berogue' is a rare and somewhat informal verb that means to severely criticize or denounce someone, often with the intention of damaging their reputation. It is not commonly used in everyday conversation or writing and is more likely to appear in journalistic or academic contexts where the author seeks a more vivid or impactful way to describe public criticism. Understanding its meaning requires a strong vocabulary and an awareness of nuanced language use."},"example_sentences":[{"sentence":"The whistleblower was berogued by the company's PR team in an attempt to discredit his claims.","translation":"内部告発者は、彼の主張の信頼性を損なうために、会社の広報チームから非難された。","type":"verb","meaning_category":"criticize severely"},{"sentence":"The activist was berogued for her radical views, but she remained steadfast in her beliefs.","translation":"その活動家は過激な見解のために非難されたが、彼女は信念を固く守り続けた。","type":"verb","meaning_category":"denounce"}]}