{"word":"Mythologizer","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"One who creates or promotes myths; one who interprets events or people in a mythical way.","english_definition":"A person who creates, promotes, or interprets something as a myth.","examples":[{"sentence":"He was seen as a mythologizer of the old West, romanticizing its history.","translation":"彼は西部開拓時代の歴史を美化し、神話化する者と見なされていた。"},{"sentence":"The author is a mythologizer, turning everyday events into epic tales.","translation":"その作家は、日常の出来事を壮大な物語に変える神話化者だ。"}],"collocations":["a mythologizer of history","a political mythologizer","a cultural mythologizer"],"synonyms":["mythmaker","romanticizer","idealizer"],"antonyms":["debunker","realist","critic"]}],"etymology":{"value":"Formed from 'mythology' + '-ize' (to make into) + '-er' (agent noun suffix).","priority":"N/A"},"pronunciation":{"ipa":"/mɪˈθɒləˌdʒaɪzər/","syllables":"my-thol-o-gi-zer"},"inflection":{"noun_plural":"mythologizers"},"usage_notes":{"explanation":"The term 'mythologizer' is used to describe someone who either creates new myths or presents existing events or figures in a way that elevates them to mythical status. This often involves exaggeration, idealization, or the creation of narratives that serve a particular purpose or worldview.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a mythologizer, so he always tells the truth.","correct":"✓ He is a mythologizer, so he often exaggerates or idealizes the truth.","note":"Mythologizers are more likely to embellish or create stories rather than simply tell the plain truth."}],"priority":"N/A"},"related_words":{"derivatives":["mythologize (verb)","mythological (adjective)","mythology (noun)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The word 'mythologizer' is a relatively uncommon term used to describe someone who creates or promotes myths, or who interprets events or people in a mythical or idealized way. It implies a process of transforming reality into something larger than life, often with the intention of creating a particular narrative or belief system. This word is more likely to be encountered in academic or literary contexts."},"example_sentences":[{"sentence":"The biographer was accused of being a mythologizer, presenting a one-sided view of the president's life.","translation":"その伝記作家は、大統領の人生を一方的に描いているとして、神話化者だと非難された。","type":"noun","meaning_category":"creates or promotes myths"},{"sentence":"As a cultural mythologizer, she transformed local folklore into national legends.","translation":"文化的な神話化者として、彼女は地方の民話を国の伝説に変えた。","type":"noun","meaning_category":"interprets events or people in a mythical way"}]}