{"word":"xanthogen","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"キサントゲン：ジチオ炭酸の塩またはエステル","english_definition":"A salt or ester of dithiocarbonic acid.","examples":[{"sentence":"Potassium ethyl xanthogen is used in ore flotation.","translation":"エチルキサントゲンカリウムは鉱石の浮遊選鉱に使用される。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Greek 'xanthos' (ξανθός) meaning 'yellow' + 'gen' (from 'genos' γένος) meaning 'producing'. Refers to the typically yellow color of these compounds.","priority":"★★★"},"pronunciation":{"ipa":"/ˈzænθədʒən/","syllables":"xan-tho-gen"},"inflection":{"noun_plural":"xanthogens"},"usage_notes":{"explanation":"Xanthogens are chemical compounds, specifically salts or esters of dithiocarbonic acid. They are primarily known for their use in mining, particularly in the froth flotation process to separate valuable minerals from ore. The term 'xanthogen' is derived from the Greek words for 'yellow' and 'producing,' referring to the characteristic yellow color of many of these compounds.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["xanthate"],"related_terms":["dithiocarbonate","potassium ethyl xanthogen"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - a technical term used in chemistry and mining.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Xanthogen' is a highly specialized term primarily encountered in the fields of chemistry and mining. It refers to a specific class of chemical compounds used in industrial processes like froth flotation. Due to its technical nature, it is unlikely to be encountered outside of these contexts."},"example_sentences":[{"sentence":"The addition of xanthogen to the slurry improved the recovery of copper.","translation":"スラリーにキサントゲンを加えることで、銅の回収率が向上した。","type":"noun","meaning_category":"chemical compound"},{"sentence":"Different xanthogens exhibit varying selectivity for different metal sulfides.","translation":"異なるキサントゲンは、異なる金属硫化物に対して異なる選択性を示す。","type":"noun","meaning_category":"chemical compound"}]}