{"word":"eradicability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"根絶可能性、撲滅可能性","english_definition":"The quality of being eradicable; the capability of being completely removed or destroyed.","examples":[{"sentence":"The eradicability of the disease depends on the availability of a vaccine.","translation":"その病気の根絶可能性は、ワクチンの入手可能性にかかっている。"},{"sentence":"Researchers are studying the eradicability of the invasive species.","translation":"研究者たちは、その侵略的外来種の根絶可能性を研究している。"}],"collocations":["disease eradicability (病気の根絶可能性)","pest eradicability (害虫の根絶可能性)","weed eradicability (雑草の根絶可能性)"],"synonyms":["removability","eliminability","destructibility","abolishability"],"antonyms":["ineradicability","indelibility","permanence"]},{"part_of_speech":"noun","definition":"(具体的に)根絶可能な性質","english_definition":"A specific characteristic or set of characteristics that makes something capable of being eradicated.","examples":[{"sentence":"The eradicability of smallpox was due to its lack of animal reservoir.","translation":"天然痘の根絶可能性は、動物宿主が存在しないことに起因していた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'eradicable' (capable of being eradicated) + '-ability' (suffix denoting capability or quality). 'Eradicable' comes from 'eradicate' (to completely remove or destroy), which originates from Latin 'eradicare' (to root out).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌrædɪkəˈbɪləti/","syllables":"i-rad-i-ca-bil-i-ty"},"inflection":{"noun_plural":"eradicabilities (rarely used)"},"usage_notes":{"explanation":"'Eradicability' is a relatively uncommon noun that refers to the potential or capability of something to be completely removed or eliminated. It is often used in scientific, medical, or environmental contexts when discussing the possibility of eliminating diseases, pests, or invasive species. The term focuses on the inherent properties or circumstances that allow for complete removal, rather than the act of eradication itself.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The eradication.","correct":"✓ The eradicability.","note":"'Eradication' is the act of eradicating, while 'eradicability' is the potential to be eradicated. Use the correct noun depending on whether you are referring to the process or the potential."}],"priority":"★★☆"},"related_words":{"derivatives":["eradicable (adjective: capable of being eradicated)","eradicate (verb: to completely remove or destroy)","eradication (noun: the act of eradicating)","ineradicable (adjective: not capable of being eradicated)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'eradicability' is a complex term used to describe whether something can be completely removed or destroyed. It's often used in scientific or technical discussions, such as when talking about diseases or invasive species. Because it's a more advanced word, it's not commonly used in everyday conversation. Understanding the word requires knowledge of its root 'eradicate,' which means to eliminate completely."},"example_sentences":[{"sentence":"The study focused on the eradicability of malaria in different regions.","translation":"その研究は、異なる地域におけるマラリアの根絶可能性に焦点を当てた。","type":"general","meaning_category":"根絶可能性"},{"sentence":"Factors affecting the eradicability of the virus are still being investigated.","translation":"そのウイルスの根絶可能性に影響を与える要因は、まだ調査中である。","type":"scientific","meaning_category":"根絶可能性"}]}