{"word":"horometry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"時間測定術、時間測定学","english_definition":"The art or science of measuring time, especially by sundials or clocks.","examples":[{"sentence":"Horometry is essential for navigation and astronomy.","translation":"時間測定術は航海術や天文学にとって不可欠である。"},{"sentence":"The history of horometry reveals the evolution of timekeeping devices.","translation":"時間測定術の歴史は、時間計測装置の進化を明らかにする。"}],"collocations":["history of horometry","principles of horometry","applications of horometry"],"synonyms":["chronometry","time measurement","timekeeping"],"antonyms":[]}],"etymology":{"value":"Derived from Greek words 'hora' (hour, time) and 'metron' (measure).","priority":"★★☆"},"pronunciation":{"ipa":"/hɔˈrɒmɪtri/","syllables":"ho-rom-e-try"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Horometry is a specialized term, primarily used in historical or technical contexts related to timekeeping. It encompasses the methods and principles used to measure time accurately.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Horometry is the study of clocks themselves.","correct":"✓ Horometry is the study of time measurement using clocks and other devices.","note":"Horometry is not just about clocks, but the broader science of time measurement. "},{"incorrect":"✗ Horometry is used in modern digital watches.","correct":"✓ Chronometry is used in modern digital watches.","note":"While horometry is the general study of time measurement, chronometry is more often used in the context of modern timekeeping devices."}],"priority":"★★☆"},"related_words":{"derivatives":["horometer (n. a time-measuring instrument)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Horometry' is a technical term related to the science of measuring time, primarily in historical contexts or when discussing the principles behind timekeeping devices. It is not commonly used in everyday language. Understanding requires familiarity with scientific and historical vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The ancient Egyptians were skilled in horometry, using sundials to divide the day.","translation":"古代エジプト人は時間測定術に長けており、日時計を使って一日を区分していた。","type":"general","meaning_category":"time measurement"},{"sentence":"The development of accurate horometry was crucial for advancements in navigation.","translation":"正確な時間測定術の発展は、航海術の進歩にとって非常に重要だった。","type":"general","meaning_category":"time measurement"},{"sentence":"Horometry involves understanding the earth's rotation and its effect on timekeeping.","translation":"時間測定術には、地球の自転とそれが時間計測に及ぼす影響の理解が含まれる。","type":"technical","meaning_category":"time measurement"}]}