{"word":"polarisability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"分極率","english_definition":"The relative tendency of a charge distribution, like the electron cloud of an atom or molecule, to be distorted from its normal shape by an external electric field; it is defined as the ratio of the induced dipole moment to the electric field that induces it.","examples":[{"sentence":"The polarisability of the molecule affects its interaction with other molecules.","translation":"その分子の分極率は、他の分子との相互作用に影響を与えます。"},{"sentence":"High polarisability indicates that the electron cloud is easily distorted.","translation":"高い分極率は、電子雲が容易に変形することを示します。"}],"collocations":["high polarisability","low polarisability","molecular polarisability","atomic polarisability","electronic polarisability","calculate polarisability","measure polarisability"],"synonyms":["electronic susceptibility","dielectric susceptibility"],"antonyms":["N/A"]}],"etymology":{"value":"Derived from 'polarize' (to cause polarization) + '-ability' (the quality of being able to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpəʊlərəˌzaɪzəˈbɪləti/","syllables":"po-lar-i-sa-bil-i-ty"},"inflection":{"noun_plural":"polarisabilities"},"usage_notes":{"explanation":"'Polarisability' is a property of matter that describes how easily its electron cloud is distorted by an external electric field. It is a key concept in chemistry and physics, particularly when discussing intermolecular forces, dielectric properties, and light scattering.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The polarisability is high because of the strong charge.","correct":"✓ The polarisability is high because of the loosely held electrons.","note":"Polarisability is related to how easily electrons can be displaced, not the strength of the charge itself."}],"priority":"★★☆"},"related_words":{"derivatives":["polarize","polarization","polarizable"],"related_terms":["dipole moment","electric field","dielectric constant"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polarisability' is a technical term primarily used in chemistry and physics. It refers to the ease with which the electron cloud of an atom or molecule can be distorted by an external electric field. Understanding this term requires a background in basic science concepts. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The **polarisability** of noble gases increases with atomic number.","translation":"希ガスの分極率は原子番号とともに増加します。","type":"noun","meaning_category":"property of matter"},{"sentence":"Computational methods are used to predict the **polarisability** of complex molecules.","translation":"複雑な分子の分極率を予測するために計算手法が用いられます。","type":"noun","meaning_category":"property of matter"}]}