{"word":"despoliation","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"略奪、強奪、破壊、荒廃","english_definition":"The act of stripping something of value or beauty; devastation; plunder.","examples":[{"sentence":"The despoliation of the forest by illegal logging is a serious environmental problem.","translation":"違法伐採による森林の略奪は深刻な環境問題だ。"},{"sentence":"The city suffered widespread despoliation during the war.","translation":"その都市は戦争中に広範囲にわたる破壊を受けた。"},{"sentence":"The despoliation of cultural artifacts is a crime against humanity.","translation":"文化遺産の略奪は人類に対する犯罪である。"}],"collocations":["environmental despoliation (環境破壊)","cultural despoliation (文化的な略奪)","systematic despoliation (組織的な略奪)","widespread despoliation (広範囲にわたる破壊)"],"synonyms":["plunder","pillage","looting","ravaging","devastation","destruction","spoliation","desecration"],"antonyms":["preservation","conservation","restoration","protection"]}],"etymology":{"value":"Late Middle English: from Old French despoliation, from Latin despoliatio(n-), from despoliare ‘strip, plunder’, from des- (expressing reversal) + poliare ‘to polish, plunder’.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɛˌspoʊliˈeɪʃən/","syllables":"de-spo-li-a-tion"},"inflection":{"noun_plural":"despoliations"},"usage_notes":{"explanation":"\"Despoliation\" refers to the act of stripping something of its value, beauty, or importance, often through violence or destruction. It can apply to physical objects, environments, or even cultural heritage. It often implies a deliberate and systematic process of destruction or looting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The despoliation of the land was a result of natural causes.","correct":"The degradation of the land was a result of natural causes.","note":"\"Despoliation\" typically implies intentional human action, whereas \"degradation\" can refer to natural processes."},{"incorrect":"The despoliation was prevented by the police.","correct":"The theft was prevented by the police.","note":"If the focus is on the act of stealing, \"theft\" is more appropriate. \"Despoliation\" emphasizes the broader act of stripping something of its value."}],"priority":"★★☆"},"related_words":{"derivatives":["despoil (verb: to strip, plunder, or rob)","despoiler (noun: one who despoils)"],"phrasal_verbs":[],"related_concepts":["vandalism","looting","environmental degradation","cultural destruction"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Despoliation\" is a formal and relatively uncommon word that describes the act of stripping something of its value or beauty, often through violence or destruction. It implies a deliberate and systematic process. It is often used in discussions about environmental damage, cultural heritage, or the aftermath of war.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum condemned the despoliation of ancient tombs by treasure hunters.","translation":"博物館は、トレジャーハンターによる古代の墓の略奪を非難した。","type":"general","meaning_category":"cultural heritage"},{"sentence":"The despoliation of the rainforest has led to the extinction of many species.","translation":"熱帯雨林の破壊は、多くの種の絶滅につながった。","type":"general","meaning_category":"environmental"},{"sentence":"The invading army was accused of the systematic despoliation of the conquered territory.","translation":"侵略軍は、征服した領土の組織的な略奪で告発された。","type":"general","meaning_category":"warfare"}]}