{"word":"euthenics","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(集合的に)環境改善学：遺伝的素質に関わらず、環境を改善することで、人間の生活の質を向上させることを目的とする学問。","english_definition":"The study of the improvement of human functioning and well-being by improvement of living conditions.","examples":[{"sentence":"Euthenics focuses on creating healthier environments for people to thrive.","translation":"環境改善学は、人々が成長できるより健康的な環境を作ることに焦点を当てています。"},{"sentence":"The principles of euthenics were applied in urban planning to reduce disease.","translation":"環境改善学の原則は、都市計画に応用され、病気を減らすために役立てられました。"}],"collocations":["apply euthenics","principles of euthenics","study of euthenics","euthenics program"],"synonyms":["environmental improvement","social betterment","hygiene","public health"],"antonyms":["eugenics (優生学)"],"notes":"Euthenics is often contrasted with eugenics, which focuses on improving human traits through genetic selection."}],"etymology":{"value":"From Greek 'eu-' (well) + 'then-' (condition, state of being) + '-ics' (study of). Coined by Ellen Swallow Richards in the early 20th century.","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈθɛnɪks/","syllables":"eu-then-ics"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Euthenics is a field concerned with improving the human race through improving environmental factors such as sanitation, housing, nutrition, and education. It contrasts with eugenics, which aims to improve the human race through selective breeding. The term is not as widely used today as it was in the early 20th century, but the principles of euthenics are still relevant in public health and environmental studies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Euthenics is about improving genes.","correct":"✓ Euthenics is about improving the environment.","note":"Euthenics focuses on environmental improvements, not genetic ones."}],"priority":"★★☆"},"related_words":{"derivatives":["euthenist (noun: a practitioner or advocate of euthenics)"],"related_terms":["eugenics","public health","environmental science","social reform"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The term is not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Euthenics' is a specialized term primarily used in the context of historical discussions about social reform and public health. It refers to the improvement of human living conditions to enhance well-being. Understanding this term requires familiarity with the history of social sciences and the distinction between environmental and genetic approaches to human improvement. It is not a common word in everyday conversation."},"example_sentences":[{"sentence":"The early proponents of euthenics believed that better living conditions could significantly improve public health.","translation":"初期の環境改善学の提唱者たちは、より良い生活環境が公衆衛生を大幅に改善できると信じていました。","type":"noun","meaning_category":"environmental improvement"},{"sentence":"Euthenics programs aimed to provide better nutrition and sanitation to impoverished communities.","translation":"環境改善学プログラムは、貧困地域に、より良い栄養と衛生を提供することを目指していました。","type":"noun","meaning_category":"social betterment"},{"sentence":"While euthenics focuses on environmental factors, eugenics deals with genetic traits.","translation":"環境改善学が環境要因に焦点を当てる一方、優生学は遺伝的特性を扱います。","type":"noun","meaning_category":"comparison to eugenics"}]}