{"word":"antithrombic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"抗血栓性の","english_definition":"Tending to prevent the formation of blood clots (thrombi).","examples":[{"sentence":"The doctor prescribed an antithrombic medication to prevent blood clots.","translation":"医師は血栓を予防するために抗血栓薬を処方した。"},{"sentence":"Antithrombic therapy is crucial for patients at risk of stroke.","translation":"抗血栓療法は、脳卒中のリスクがある患者にとって非常に重要である。"}],"collocations":["antithrombic agent","antithrombic drug","antithrombic therapy","antithrombic effect","antithrombic properties"],"synonyms":["anticoagulant","antiplatelet"],"antonyms":["prothrombotic","thrombogenic"]}],"etymology":{"value":"Derived from the prefix 'anti-' (against) + 'thromb-' (referring to a thrombus or blood clot) + '-ic' (relating to).","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈθrɒmbɪk/","syllables":"an-ti-throm-bic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Antithrombic' describes substances or treatments that reduce the risk of blood clot formation. It is often used in medical contexts to refer to medications or therapies prescribed to prevent or treat thrombotic events such as deep vein thrombosis (DVT) or pulmonary embolism (PE). It is distinct from 'thrombolytic', which refers to agents that break down existing blood clots.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient was given a thrombolytic drug as an antithrombic measure.","correct":"✓ The patient was given an antithrombic drug to prevent clot formation.","note":"'Antithrombic' prevents clot formation; 'thrombolytic' dissolves existing clots."},{"incorrect":"✗ Antithrombic drugs are safe for everyone.","correct":"✓ Antithrombic drugs should be used under medical supervision due to the risk of bleeding.","note":"Antithrombic drugs can increase the risk of bleeding and should be used with caution."}],"priority":"★★☆"},"related_words":{"derivatives":["antithrombotics (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'antithrombic' is a specialized medical term used to describe substances or treatments that prevent the formation of blood clots. It is commonly encountered in medical literature, prescriptions, and discussions related to cardiovascular health and the prevention of thrombotic events. Understanding this term requires a basic knowledge of medical terminology and physiology related to blood clotting.","priority":"★★☆"},"example_sentences":[{"sentence":"Aspirin is often used as an antithrombic agent to prevent heart attacks.","translation":"アスピリンは、心臓発作を予防するための抗血栓薬としてよく使用される。","type":"general","meaning_category":"prevention"},{"sentence":"Patients with atrial fibrillation may require long-term antithrombic treatment.","translation":"心房細動の患者は、長期的な抗血栓治療が必要となる場合がある。","type":"medical","meaning_category":"treatment"},{"sentence":"The antithrombic effect of the drug was evaluated in a clinical trial.","translation":"その薬の抗血栓効果は臨床試験で評価された。","type":"scientific","meaning_category":"research"}]}