{"word":"infuscation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(意図的な)曖昧化、難解化、煙幕を張ること","english_definition":"the action of making something obscure, unclear, or unintelligible, especially deliberately.","examples":[{"sentence":"The company used infuscation to hide its illegal activities.","translation":"その会社は違法行為を隠すために曖昧化工作を行った。"},{"sentence":"The politician's speech was full of infuscation and empty rhetoric.","translation":"その政治家の演説は曖昧化と空虚な美辞麗句に満ちていた。"},{"sentence":"Infuscation is a common tactic used in malware to avoid detection.","translation":"曖昧化は、マルウェアが検出を回避するために使用する一般的な戦術です。"}],"collocations":["deliberate infuscation (意図的な曖昧化)","obfuscation and infuscation (曖昧化と難解化)","use infuscation (曖昧化を使う)","employ infuscation (曖昧化を用いる)"],"synonyms":["obfuscation","obscuration","equivocation","ambiguity","bewilderment","mystification","clouding","muddying"],"antonyms":["clarification","elucidation","explication","simplification","transparency","illumination"]}],"etymology":{"value":"Late Latin *infuscatio* from *infuscare* 'to darken', from *fuscus* 'dark brown, swarthy'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌfʌˈskeɪʃən/","syllables":"in-fus-ca-tion"},"inflection":{"noun_plural":"infuscations"},"usage_notes":{"explanation":"\"**Infuscation**\" refers to the act of making something unclear, obscure, or unintelligible, often intentionally. It is a more formal and less commonly used synonym of \"obfuscation.\" It often implies a deliberate attempt to conceal or confuse, whether in language, code, or actions. It can be used in contexts ranging from politics and corporate behavior to computer science and malware analysis. The term often carries a negative connotation, suggesting dishonesty or an attempt to deceive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The infuscation of the room made it hard to see.","correct":"✓ The dimness of the room made it hard to see.","note":"\"Infuscation\" refers to the act of making something obscure, not the state of being dark. Use \"darkness\" or \"dimness\" to describe a poorly lit room."},{"incorrect":"✗ He used infuscation to clarify the complex issue.","correct":"✓ He used simplification to clarify the complex issue.","note":"\"Infuscation\" means to make something unclear, the opposite of clarifying. Use \"simplification\" or \"elucidation\" when the intention is to make something easier to understand."}],"priority":"★☆☆"},"related_words":{"derivatives":["infuscate (verb: to darken, to obscure)","infuscated (adjective: darkened, obscured)"],"related_terms":["obfuscate (verb: to make obscure)","obfuscation (noun: the act of making obscure)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"**Infuscation**\" is a relatively uncommon and formal word that describes the act of making something difficult to understand, often on purpose. It's similar to \"obfuscation\" but may imply a more deliberate effort to mislead or conceal information. You're most likely to encounter this word in academic writing, technical documentation, or discussions about politics or corporate behavior where someone is trying to hide or confuse the truth."},"example_sentences":[{"sentence":"The software code was deliberately designed with **infuscation** to prevent reverse engineering.","translation":"そのソフトウェアコードは、リバースエンジニアリングを防ぐために、意図的に曖昧化が施されていた。","type":"noun","meaning_category":"曖昧化"},{"sentence":"The report accused the government of **infuscation** in its handling of the financial crisis.","translation":"その報告書は、政府が金融危機の処理において曖昧化を行っていると非難した。","type":"noun","meaning_category":"曖昧化"},{"sentence":"The lawyer skillfully used **infuscation** to confuse the jury.","translation":"弁護士は陪審員を混乱させるために、巧みに曖昧化を用いた。","type":"noun","meaning_category":"曖昧化"}]}