{"word":"Cosmism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"コスミズム：19世紀末から20世紀初頭にかけてロシアで発展した哲学・文化運動。宇宙、科学技術、人間の可能性を重視し、不死、宇宙探査、人類の進化などを提唱した。","english_definition":"A philosophical and cultural movement that emerged in Russia in the late 19th and early 20th centuries, emphasizing the cosmos, science, technology, and human potential, and advocating for immortality, space exploration, and the evolution of humanity.","examples":[{"sentence":"Cosmism influenced early Soviet space programs.","translation":"コスミズムは初期のソビエト宇宙計画に影響を与えた。"},{"sentence":"Key figures in Cosmism included Nikolai Fedorov and Konstantin Tsiolkovsky.","translation":"コスミズムの主要人物には、ニコライ・フョードロフとコンスタンチン・ツィオルコフスキーが含まれる。"}],"collocations":["Russian Cosmism","philosophical Cosmism","early Cosmism"],"synonyms":["Russian transhumanism","Fedorovism"],"antonyms":[]}],"etymology":{"value":"From 'cosmos' (宇宙) + '-ism' (主義)。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒzmɪzəm/","syllables":"Cos-mism"},"inflection":{"noun_plural":"Cosmisms"},"usage_notes":{"explanation":"'Cosmism' refers specifically to the Russian philosophical and cultural movement. It is distinct from general cosmological theories, although it incorporates them.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He studies cosmism as a branch of astronomy.","correct":"✓ He studies cosmology as a branch of astronomy.","note":"Cosmism is a philosophical movement, while cosmology is the study of the universe's origin and structure."}],"priority":"★★☆"},"related_words":{"derivatives":["Cosmist (名詞: コスミズムの信奉者)","Cosmist (形容詞: コスミズムの)"],"related_concepts":["Transhumanism","Immortality","Space exploration","Nikolai Fedorov","Konstantin Tsiolkovsky"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cosmism' is a specialized term referring to a specific philosophical and cultural movement originating in Russia. Understanding requires familiarity with Russian intellectual history and philosophical concepts related to transhumanism and space exploration. It is not part of general vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"Cosmism envisioned a future where humanity would conquer death and explore the universe.","translation":"コスミズムは、人類が死を克服し、宇宙を探査する未来を構想した。","type":"general","meaning_category":"definition"},{"sentence":"The ideas of Cosmism resonated with some Soviet scientists and engineers.","translation":"コスミズムの思想は、一部のソビエトの科学者や技術者の共感を呼んだ。","type":"historical","meaning_category":"influence"}]}