{"word":"russeting","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(果物の)さび状の肌、金網状の模様","english_definition":"A rough, brownish or yellowish-brown texture on the skin of some fruits, especially apples and pears, caused by microscopic cracks and corky tissue.","examples":[{"sentence":"The russeting on this apple gives it a unique texture.","translation":"このリンゴのさび状の肌が独特の食感を与えている。"},{"sentence":"Some varieties of pears are prized for their heavy russeting.","translation":"ナシの中には、その強い金網状の模様が珍重される品種もある。"}],"collocations":["skin russeting","apple russeting","pear russeting","heavy russeting","light russeting"],"synonyms":["corking","scarring","rough skin"],"antonyms":["smooth skin","unblemished skin"]},{"part_of_speech":"adjective","definition":"さび色の、赤褐色の","english_definition":"Having a rough, brownish or yellowish-brown color or texture resembling russeting on fruit.","examples":[{"sentence":"The russeting apples lay scattered on the orchard floor.","translation":"さび色のリンゴが果樹園の地面に散らばっていた。"},{"sentence":"The russeting leaves of autumn created a beautiful landscape.","translation":"秋の赤褐色の葉が美しい風景を作り出した。"}],"collocations":["russeting apples","russeting pears","russeting leaves","russeting color","russeting texture"],"synonyms":["russet","brownish-red","reddish-brown"],"antonyms":["green","yellow"]}],"etymology":{"value":"Derived from 'russet,' referring to a coarse cloth of reddish-brown color, and the suffix '-ing,' indicating a process or result. The term was first used to describe the texture of certain fruits resembling the color and texture of russet cloth.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrʌsɪtɪŋ/","syllables":"rus-set-ing"},"inflection":{"noun_plural":"russetings"},"usage_notes":{"explanation":"'Russeting' primarily refers to the rough, brownish texture found on the skin of some fruits, notably apples and pears. It can also be used as an adjective to describe something having a similar color or texture. The presence and extent of russeting can be a characteristic feature of certain fruit varieties, sometimes even considered desirable.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The apple was russeting all over the tree.","correct":"✓ The russeting was visible on the apples all over the tree.","note":"'Russeting' is the name of the texture, not an action. So you can't say the apple was 'russeting.'"},{"incorrect":"✗ I prefer apples without any russeting. They look cleaner.","correct":"✓ I prefer apples with smooth skin. They look cleaner.","note":"While expressing a preference is fine, it's important to use the correct term. 'Russeting' is the specific term for the texture, while 'smooth skin' is its opposite."}],"priority":"★☆☆"},"related_words":{"derivatives":["russet (noun/adjective: reddish-brown color or coarse cloth)"],"phrasal_verbs":[],"related_terms":["corking (similar texture)","bloom (opposite: smooth, waxy coating on fruit)"]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Russeting' is a specialized term used to describe a specific texture on the skin of certain fruits, particularly apples and pears. It refers to a rough, brownish, or yellowish-brown appearance caused by microscopic cracks and corky tissue. The term is more commonly encountered in contexts related to fruit cultivation, horticulture, or culinary descriptions. Understanding the term requires some familiarity with fruit characteristics and descriptive vocabulary."},"example_sentences":[{"sentence":"The 'Cox's Orange Pippin' apple is known for its characteristic russeting.","translation":"'コックスオレンジピピン'というリンゴはその特徴的なさび状の肌で知られている。","type":"noun","meaning_category":"果物の肌"},{"sentence":"The russeting pears were ripe and ready for picking.","translation":"赤褐色のナシは熟していて、収穫の準備ができていた。","type":"adjective","meaning_category":"さび色の"}]}