{"word":"uncontending","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"争わない、議論しない、抵抗しない","english_definition":"not contending; not arguing or struggling; peaceful; acquiescent.","examples":[{"sentence":"He adopted an uncontending attitude, preferring to avoid conflict.","translation":"彼は争わない態度を取り、対立を避けることを好んだ。"},{"sentence":"The uncontending nature of the lamb made it an easy target for the wolf.","translation":"その羊の争わない性質が、狼にとって格好の餌食となった。"},{"sentence":"She remained uncontending despite the unfair accusations.","translation":"彼女は不当な非難にもかかわらず、抵抗しなかった。"}],"collocations":["uncontending spirit","uncontending attitude","uncontending nature","uncontending disposition"],"synonyms":["peaceful","acquiescent","compliant","docile","non-resistant","yielding","submissive","placid"],"antonyms":["contentious","belligerent","combative","argumentative","resistant","defiant","aggressive"]}],"etymology":{"value":"\"Un-\" (not) + \"contending\" (present participle of \"contend\", meaning to struggle or argue).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnkənˈtɛndɪŋ/","syllables":"un-con-tend-ing"},"inflection":{"notes":"Adjective, comparative and superlative forms are: more uncontending, most uncontending."},"usage_notes":{"explanation":"\"Uncontending\" describes someone or something that avoids conflict and does not engage in arguments or struggles. It often implies a passive or yielding disposition. It can also describe a situation that is free from conflict.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was uncontending for the championship.","correct":"✓ He was not contending for the championship.","note":"\"Uncontending\" describes a state of not arguing or struggling, not a state of not competing. Use \"not contending\" to describe someone not competing. "},{"incorrect":"✗ The uncontending of the two parties led to a quick resolution.","correct":"✓ The uncontending attitude of the two parties led to a quick resolution.","note":"\"Uncontending\" is an adjective, not a noun. Use a related noun such as \"attitude\", \"nature\", or \"spirit\"."}],"priority":"★★☆"},"related_words":{"derivatives":["contend (verb): to struggle or argue","contender (noun): someone who competes or argues","contention (noun): argument or struggle","contentious (adjective): causing or likely to cause an argument"],"phrases":["uncontendingly (adverb): in an uncontending manner"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - not commonly used in everyday language.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'uncontending' is a relatively uncommon and sophisticated term. It describes a state of being peaceful and non-resistant, avoiding arguments and struggles. It is often used in formal or literary contexts to describe a person's character or a particular situation. Understanding this word requires a good grasp of vocabulary related to conflict and passivity."},"example_sentences":[{"sentence":"Her uncontending spirit allowed her to navigate difficult situations with grace.","translation":"彼女の争わない精神は、困難な状況を優雅に乗り切ることを可能にした。","type":"adjective","meaning_category":"peaceful attitude"},{"sentence":"The uncontending approach of the diplomats helped to de-escalate the tensions between the two nations.","translation":"外交官たちの争わない姿勢が、二国間の緊張を緩和するのに役立った。","type":"adjective","meaning_category":"avoiding conflict"},{"sentence":"He was known for his uncontending nature, always willing to compromise.","translation":"彼は常に妥協を厭わない、争わない性質で知られていた。","type":"adjective","meaning_category":"willing to compromise"}]}