{"word":"circumnutatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物の茎や先端などの成長運動が)旋回運動をする、回転しながら成長する","english_definition":"Exhibiting circumnutation; spiraling or rotating during growth (said of the stem or tip of a plant).","examples":[{"sentence":"The bean plant's stem showed circumnutatory growth as it climbed the trellis.","translation":"その豆の木の茎は、格子垣を登るにつれて旋回運動成長を示した。"},{"sentence":"Circumnutatory movements help plants explore their environment for support.","translation":"旋回運動は、植物が支持を求めて環境を探査するのに役立つ。"}],"collocations":["circumnutatory movement","circumnutatory growth","circumnutatory motion"],"synonyms":["spiraling","rotating","twisting","whorling","gyrating"],"antonyms":["static","stationary","fixed"]}],"etymology":{"value":"From 'circumnutate' (to move around in a circle or spiral) + '-ory' (suffix indicating a quality or function). 'Circumnutate' is derived from Latin 'circum' (around) + 'nutare' (to nod, sway).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɜːrkəmˈnuːteɪtɔːri/","syllables":"cir-cum-nu-ta-to-ry (5 syllables)"},"inflection":{"notes":"This is an adjective, so it does not inflect for number or gender."},"usage_notes":{"explanation":"'Circumnutatory' describes the specific type of spiraling or rotating movement observed in growing plant stems or tendrils as they seek support or explore their environment. It is a relatively specialized term used in botany and plant physiology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dancer's movements were circumnutatory.","correct":"✓ The dancer's movements were spiraling/whirling/rotating.","note":"'Circumnutatory' is specifically used for plant growth. For other types of spiraling movement, use more general terms like 'spiraling,' 'rotating,' or 'whirling'."}],"priority":"★★★"},"related_words":{"derivatives":["circumnutation (noun: the act or process of circumnutating)","circumnutate (verb: to move around in a circle or spiral)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very specialized vocabulary)","frequency_google_ngram":"Very low frequency - a specialized term used in botany.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Circumnutatory' is a technical term used in botany to describe the spiraling or rotating growth movement of plant stems or tendrils. It's not commonly used outside of scientific contexts. If you encounter this word, it most likely refers to the way plants like vines or beans move as they grow and search for support."},"example_sentences":[{"sentence":"The scientist observed the circumnutatory motion of the plant's tendrils.","translation":"科学者は、その植物の巻きひげの旋回運動を観察した。","type":"adjective","meaning_category":"旋回運動をする"},{"sentence":"The circumnutatory growth pattern allowed the vine to find a sturdy support.","translation":"その旋回運動成長パターンにより、つる植物は丈夫な支えを見つけることができた。","type":"adjective","meaning_category":"回転しながら成長する"}]}