{"word":"occupation-centered","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"職業を中心とした、仕事に重点を置いた","english_definition":"Focusing on or prioritizing occupation, work, or employment.","examples":[{"sentence":"The training program is occupation-centered, providing skills directly applicable to the workplace.","translation":"その研修プログラムは職業中心であり、職場に直接適用できるスキルを提供します。"},{"sentence":"An occupation-centered approach to therapy helps patients regain their ability to perform daily tasks.","translation":"作業中心のアプローチによるセラピーは、患者が日常のタスクを実行する能力を取り戻すのに役立ちます。"}],"collocations":["occupation-centered therapy","occupation-centered training","occupation-centered approach","occupation-centered education"],"synonyms":["work-focused","career-oriented","job-related","employment-based"],"antonyms":["leisure-oriented","recreation-centered","hobby-based"]}],"etymology":{"value":"Combination of 'occupation' (a job or profession) and 'centered' (focused on).","priority":"N/A"},"pronunciation":{"ipa":"/ˌɒkjʊˈpeɪʃən ˈsentərd/","syllables":"oc-cu-pa-tion-cen-tered"},"inflection":{},"usage_notes":{"explanation":"'Occupation-centered' is often used in the context of therapy, education, or training programs that prioritize the development of skills and knowledge related to specific jobs or professions. It emphasizes the importance of work and employment in a person's life and well-being.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["occupation","centered"],"related_terms":["work","career","employment","profession"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'occupation-centered' is a compound adjective that describes something focused on a person's job or profession. It is often used in professional contexts, such as therapy or training, to indicate a focus on skills and knowledge needed for employment. The term is relatively specialized and may not be commonly encountered in everyday conversation."},"example_sentences":[{"sentence":"The rehabilitation program uses an occupation-centered model to help patients return to work.","translation":"リハビリテーションプログラムでは、患者が職場復帰できるよう、職業中心のモデルを使用しています。","type":"adjective","meaning_category":"職業を中心とした"},{"sentence":"Occupation-centered interventions are designed to improve a person's ability to perform job-related tasks.","translation":"職業中心の介入は、人が仕事関連のタスクを実行する能力を向上させるように設計されています。","type":"adjective","meaning_category":"仕事に重点を置いた"}]}