{"word":"vehicle-accessible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"車両でアクセス可能な、車椅子対応の車両でアクセス可能な","english_definition":"(of a place or facility) able to be reached or used by vehicles, especially including vehicles adapted for wheelchair users.","examples":[{"sentence":"The park has several vehicle-accessible picnic areas.","translation":"その公園には、車両でアクセス可能なピクニックエリアがいくつかあります。"},{"sentence":"We need to ensure the trail is vehicle-accessible for emergency services.","translation":"緊急サービスのために、その道が車両でアクセス可能であることを確認する必要があります。"},{"sentence":"The new bus is vehicle-accessible, with a ramp for wheelchairs.","translation":"新しいバスは車椅子用のスロープがあり、車椅子対応の車両でアクセス可能です。"}],"collocations":["vehicle-accessible parking","vehicle-accessible entrance","vehicle-accessible route","vehicle-accessible restroom"],"synonyms":["accessible by car","drive-up","wheelchair-accessible vehicle"],"antonyms":["inaccessible by vehicle","pedestrian-only"],"notes":"This term is commonly used in descriptions of parks, buildings, and other facilities to indicate that they can be reached or used by vehicles. When specifically referring to accessibility for wheelchair users, it implies that the vehicle is adapted to accommodate wheelchairs."}],"etymology":{"value":"The word is formed by combining 'vehicle' (a means of transport), 'accessible' (able to be reached or entered), and a hyphen to connect them.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈviːɪkəl əkˈsɛsɪbəl/","syllables":"ve-hi-cle ac-ces-si-ble"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Vehicle-accessible' typically describes a location, path, or facility that can be reached using a standard vehicle. However, it can also refer to accessibility for specialized vehicles, such as those adapted for wheelchair users. Context is important to understand the specific meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building is vehicle accessible.","correct":"✓ The building is vehicle-accessible.","note":"The hyphen is important to connect the words and form a compound adjective."},{"incorrect":"✗ Only vehicle accessible people are allowed.","correct":"✓ Only people with vehicle-accessible permits are allowed.","note":"The adjective 'vehicle-accessible' describes the facility or route, not the people."}],"priority":"★★☆"},"related_words":{"derivatives":["accessibility (noun)","accessible (adjective)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"'Vehicle-accessible' is a compound adjective that describes a place or facility that can be reached or used by vehicles. It's often used in descriptions of public spaces to indicate ease of access for cars, vans, or other vehicles. In some contexts, it may specifically refer to accessibility for vehicles adapted for wheelchair users. The word is relatively straightforward but may be less common in everyday conversation, making it more suitable for intermediate to advanced English learners."},"example_sentences":[{"sentence":"The campsite offers several vehicle-accessible parking spots near the tent sites.","translation":"そのキャンプ場には、テントサイトの近くに車両でアクセス可能な駐車スペースがいくつかあります。","type":"adjective","meaning_category":"General Vehicle Access"},{"sentence":"The museum has a vehicle-accessible entrance located on the side of the building.","translation":"博物館には、建物の側面に車両でアクセス可能な入り口があります。","type":"adjective","meaning_category":"General Vehicle Access"},{"sentence":"The community center provides a vehicle-accessible van for seniors and people with disabilities.","translation":"コミュニティセンターは、高齢者や障害者向けに車両でアクセス可能なバンを提供しています。","type":"adjective","meaning_category":"Wheelchair-Adapted Vehicle Access"}]}