{"word":"Normanise","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ノルマンディー化する、ノルマン風にする、ノルマン人の影響を与える","english_definition":"To bring under Norman influence or control; to make Norman in character or style.","examples":[{"sentence":"The Anglo-Saxon legal system was gradually Normanised after the conquest.","translation":"アングロサクソン法制度は、征服後徐々にノルマンディー化された。"},{"sentence":"The architecture of the period shows how the local buildings were Normanised.","translation":"その時代の建築は、地元の建物がどのようにノルマン風にされたかを示している。"}],"collocations":["Normanise the legal system","Normanise the architecture","Normanise the culture"],"synonyms":["Normanize","subject to Norman influence","make Norman"],"antonyms":["de-Normanise","remove Norman influence"],"notes":"Often used in historical contexts, particularly relating to the Norman conquest of England."}],"etymology":{"value":"Derived from \"Norman\" (referring to the people of Normandy) + \"-ise\" (a suffix indicating a process of becoming or being made).","priority":"★★☆"},"pronunciation":{"ipa":"ˈnɔːmənaɪz","syllables":"Nor-man-ise"},"inflection":{"verb_forms":{"present_simple":["Normanise","Normanises"],"past_simple":"Normanised","past_participle":"Normanised","present_participle":"Normanising"}},"usage_notes":{"explanation":"The term \"Normanise\" typically refers to the process by which something or someone becomes influenced by or conforms to Norman customs, culture, or practices. It is most often used in historical contexts, particularly when discussing the impact of the Normans on England after the Norman Conquest of 1066.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city was Normanised with French culture.","correct":"✓ The city was Normanised with Norman culture.","note":"It should be Norman culture, as Norman is not exactly French."}],"priority":"★☆☆"},"related_words":{"derivatives":["Normanisation (noun): The process of Normanising.","Norman (noun/adjective): Relating to the Normans or Normandy."],"related_terms":["Norman Conquest","Normandy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Normanise' is a specialized term primarily used in historical contexts to describe the process of something becoming influenced by Norman culture, particularly after the Norman Conquest of England. It's not a commonly used word in everyday conversation, and understanding its meaning requires some familiarity with historical events and terminology."},"example_sentences":[{"sentence":"The English language was heavily Normanised with the introduction of French vocabulary.","translation":"英語はフランス語の語彙の導入により、大きくノルマンディー化された。","type":"general","meaning_category":"linguistics"},{"sentence":"The local customs were Normanised over time, reflecting the new ruling class.","translation":"地元の習慣は時間の経過とともにノルマンディー化され、新しい支配階級を反映するようになった。","type":"historical","meaning_category":"culture"}]}