{"word":"root-pruned","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"根が剪定された、根切りされた","english_definition":"Having had its roots pruned, typically to restrict growth or prepare for transplanting.","examples":[{"sentence":"The root-pruned bonsai tree was carefully shaped.","translation":"根切りされた盆栽は丁寧に形作られた。"},{"sentence":"Root-pruned seedlings are less likely to become root-bound in containers.","translation":"根切りされた苗は、容器内で根詰まりを起こしにくい。"}],"collocations":["root-pruned tree","root-pruned seedling","root-pruned plant"],"synonyms":["root-trimmed","root-controlled"],"antonyms":["root-bound","unpruned"]}],"etymology":{"value":"Derived from the verb phrase \"root prune,\" which combines \"root\" (the underground part of a plant) and \"prune\" (to trim or cut away unnecessary parts).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈruːtˌpruːnd/","syllables":"root-pruned"},"inflection":{"notes":"This is an adjective formed from a past participle. It does not have separate inflections."},"usage_notes":{"explanation":"\"**Root-pruned**\" describes a plant or tree that has undergone root pruning. Root pruning is the process of selectively removing roots to control the size and shape of the plant, stimulate new root growth, or prepare it for transplanting. This is commonly done with bonsai trees, container plants, and some fruit trees. The term implies a deliberate action to manage the root system for specific horticultural purposes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The root-pruned tree was root-pruning.","correct":"✓ The root-pruned tree had been root-pruned last year.","note":"\"Root-pruned\" is an adjective describing the state of the tree. \"Root-pruning\" is the action of pruning roots. Use the correct tense to describe the action of root pruning."}],"priority":"★★☆"},"related_words":{"derivatives":["root prune (verb)","root pruning (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Specialized horticultural term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"**root-pruned**\" is a technical term used in gardening and horticulture. It describes a plant whose roots have been intentionally cut back. This is done to control the plant's size, encourage new root growth, or prepare the plant for transplanting. It is not a commonly used term outside of these specific contexts. Understanding the term requires some knowledge of gardening practices."},"example_sentences":[{"sentence":"The nursery sells a variety of **root-pruned** shrubs.","translation":"その苗床では、さまざまな根切りされた低木を販売している。","type":"adjective","meaning_category":"根が剪定された"},{"sentence":"A **root-pruned** plant is easier to transplant because it has a more compact root ball.","translation":"根切りされた植物は、根鉢がよりコンパクトなので移植しやすい。","type":"adjective","meaning_category":"根が剪定された"}]}