{"word":"warrener","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ウサギの飼育係、ウサギの番人、ウサギ狩猟者","english_definition":"A person who manages or works in a warren, especially one who breeds rabbits for meat or fur.","examples":[{"sentence":"The warrener checked the traps daily to collect the rabbits.","translation":"ウサギの飼育係は毎日罠を点検してウサギを回収した。"},{"sentence":"In medieval times, the warrener was an important figure in the local economy.","translation":"中世において、ウサギの飼育係は地域経済において重要な人物だった。"}],"collocations":["rabbit warrener","head warrener","estate warrener"],"synonyms":["rabbit keeper","rabbit breeder","gamekeeper"],"antonyms":[]}],"etymology":{"value":"Derived from 'warren', referring to an area where rabbits are bred and kept. The suffix '-er' denotes a person associated with that place or activity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɒrənər/","syllables":"wor-ren-er"},"inflection":{"noun_plural":"warreners"},"usage_notes":{"explanation":"The term 'warrener' is somewhat archaic but still used in historical contexts or in specific regions where rabbit farming or management is practiced. It specifically refers to someone who manages a warren, which is an enclosed area for breeding rabbits.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a rabbit farmer, like a warren.","correct":"✓ He is a rabbit farmer, like a warrener.","note":"'Warren' is the place where rabbits are kept, while 'warrener' is the person who manages the warren."}],"priority":"★☆☆"},"related_words":{"derivatives":["warren (noun: ウサギの飼育場、ウサギの巣窟)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'warrener' is a specialized term referring to someone who manages a rabbit warren. It's not commonly used in modern English, but might be encountered in historical texts or specific contexts related to rabbit farming or gamekeeping. Understanding the term requires knowledge of the historical practice of rabbit farming in warrens.","priority":"★☆☆"},"example_sentences":[{"sentence":"The old warrener knew all the secrets of the rabbit colony.","translation":"年老いたウサギの飼育係はウサギのコロニーのすべての秘密を知っていた。","type":"general","meaning_category":"ウサギの飼育係"},{"sentence":"The warrener's job was to protect the rabbits from predators.","translation":"ウサギの飼育係の仕事は、捕食者からウサギを守ることだった。","type":"general","meaning_category":"ウサギの番人"}]}