{"word":"ergastic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物細胞に関して)原形質内に存在する、細胞活動の副産物または貯蔵物質である","english_definition":"(of plant cells) containing nonprotoplasmic substances, such as crystals, oil droplets, starch grains, or tannins, that are either byproducts of metabolism or reserve materials.","examples":[{"sentence":"Ergastic substances are found in the cytoplasm and vacuoles of plant cells.","translation":"エルガスティック物質は植物細胞の細胞質および液胞に見られる。"},{"sentence":"Starch grains are a common type of ergastic substance.","translation":"デンプン粒は一般的なエルガスティック物質の一種である。"}],"collocations":["ergastic substance","ergastic inclusion","ergastic matter"],"synonyms":["inclusion","nonliving inclusion"],"antonyms":["protoplasm"],"notes":"Ergastic substances are non-living components of cells, in contrast to the protoplasm, which is the living part of the cell."}],"etymology":{"value":"Derived from the Greek word 'ergasia', meaning 'work, activity', referring to the products or byproducts of cell activity.","priority":"★★☆"},"pronunciation":{"ipa":"/ɜːrˈɡæstɪk/","syllables":"er-gas-tic"},"inflection":{"notes":"This word does not have typical inflections as it is primarily an adjective."},"usage_notes":{"explanation":"The term 'ergastic' is primarily used in the context of plant cell biology to describe non-living inclusions within the cell. These inclusions can be various substances like crystals, oil droplets, starch grains, or tannins, which are either byproducts of metabolic processes or stored reserve materials. It's a technical term specific to the field.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ergastic material is alive.","correct":"✓ The ergastic material is non-living.","note":"Ergastic substances are, by definition, non-living components of the cell."}],"priority":"★★☆"},"related_words":{"derivatives":["ergasia (Greek root, meaning work or activity)"],"related_terms":["protoplasm","cytoplasm","vacuole","inclusion"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - a specialized term used in botany and cell biology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ergastic' is a highly specialized term used in the field of plant cell biology. It refers to non-living substances found within plant cells, such as crystals, oil droplets, or starch grains. These substances are either byproducts of the cell's metabolic activities or stored reserve materials. Due to its specific and technical nature, this term is not commonly encountered outside of advanced studies in botany or cell biology."},"example_sentences":[{"sentence":"The presence of numerous starch grains is a characteristic feature of ergastic inclusions in potato cells.","translation":"多数のデンプン粒の存在は、ジャガイモ細胞におけるエルガスティック内包物の特徴的な特徴である。","type":"scientific","meaning_category":"cell biology"},{"sentence":"Crystals of calcium oxalate are a type of ergastic substance commonly found in plant tissues.","translation":"シュウ酸カルシウムの結晶は、植物組織で一般的に見られるエルガスティック物質の一種である。","type":"scientific","meaning_category":"cell biology"}]}