{"word":"autosuggestions","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"自己暗示、自己暗示法","english_definition":"The process or practice of influencing one's own thoughts, behavior, or physical state through self-administered suggestions.","examples":[{"sentence":"He used autosuggestions to improve his confidence.","translation":"彼は自信を高めるために自己暗示を使った。"},{"sentence":"Autosuggestions can be a powerful tool for personal development.","translation":"自己暗示は自己啓発のための強力なツールとなり得る。"}],"collocations":["use autosuggestions","practice autosuggestions","positive autosuggestions","negative autosuggestions"],"synonyms":["self-suggestion","self-hypnosis","affirmations"],"antonyms":[],"notes":"Autosuggestions are often used in conjunction with other techniques such as meditation and visualization."}],"etymology":{"value":"The term 'autosuggestion' was popularized by Émile Coué, a French pharmacist and psychologist, in the early 20th century. It combines the Greek prefix 'auto-' (self) with the word 'suggestion'.","priority":"★★☆"},"pronunciation":{"ipa":"ˌɔːtoʊsəˈdʒestʃənz","syllables":"au-to-sug-ges-tions"},"inflection":{"noun_plural":"autosuggestions"},"usage_notes":{"explanation":"'Autosuggestions' refers to the technique of influencing one's own mind through repeated positive statements or suggestions. It's based on the idea that the subconscious mind can be programmed to accept these suggestions as reality, leading to changes in behavior, attitudes, or even physical well-being.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used auto suggestion to quit smoking.","correct":"✓ He used autosuggestion to quit smoking.","note":"The correct term is 'autosuggestion' (one word)."},{"incorrect":"✗ Autosuggestion are helpful.","correct":"✓ Autosuggestions are helpful.","note":"'Autosuggestions' is a plural noun, so it takes a plural verb."}],"priority":"★☆☆"},"related_words":{"derivatives":["autosuggestive (adjective)"],"related_concepts":["affirmations","self-hypnosis","visualization","positive thinking","cognitive behavioral therapy (CBT)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. Primarily used in contexts related to psychology, self-help, and personal development.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Autosuggestions' is a term primarily used in psychology and self-help contexts. It refers to the practice of influencing one's own thoughts and behaviors through repeated positive statements. Understanding this term requires familiarity with concepts like the subconscious mind and the power of positive thinking."},"example_sentences":[{"sentence":"Through daily autosuggestions, she managed to overcome her fear of public speaking.","translation":"毎日の自己暗示によって、彼女は人前で話すことへの恐怖を克服することができた。","type":"general","meaning_category":"overcoming fear"},{"sentence":"The therapist recommended autosuggestions as a way to manage chronic pain.","translation":"セラピストは慢性的な痛みを管理する方法として自己暗示を勧めた。","type":"medical/therapeutic","meaning_category":"pain management"},{"sentence":"Athletes often use autosuggestions to enhance their performance.","translation":"アスリートはパフォーマンスを向上させるために自己暗示をよく使う。","type":"sports/performance","meaning_category":"performance enhancement"}]}