{"word":"single-industry","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"単一産業の、特定の産業に特化した","english_definition":"Relating to or characterized by reliance on a single industry.","examples":[{"sentence":"The town was a single-industry community, dependent on the coal mine for its livelihood.","translation":"その町は単一産業のコミュニティで、生活は石炭鉱山に依存していた。"},{"sentence":"Diversification is important for single-industry economies to reduce vulnerability.","translation":"多様化は、単一産業経済が脆弱性を軽減するために重要である。"}],"collocations":["single-industry town","single-industry economy","single-industry region"],"synonyms":["industry-dependent","mono-industrial"],"antonyms":["diversified","multi-industry"]},{"part_of_speech":"noun","definition":"単一産業","english_definition":"An industry that is the only or primary economic activity in a region or area.","examples":[{"sentence":"The decline of the single-industry led to widespread unemployment.","translation":"その単一産業の衰退は、広範囲な失業につながった。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Single' + 'industry'. Indicates a concentration or reliance on one specific industry.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪŋɡəl ˈɪndəstri/","syllables":"sin-gle in-dus-try"},"inflection":{"notes":"Adjective and noun forms are the same."},"usage_notes":{"explanation":"The term 'single-industry' describes a situation where a region, town, or economy is heavily reliant on one particular industry for its economic well-being. This can make the area vulnerable to economic downturns if that industry faces difficulties.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is single industry.","correct":"✓ The city is a single-industry city.","note":"Needs a noun after the adjective. Alternatively, you could say 'The city relies on a single industry.'"}],"priority":"★★☆"},"related_words":{"derivatives":["industrial","industry","single"],"phrasal_verbs":[],"related_concepts":["economic diversification","resource curse","boom and bust cycle"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but used in economic and regional planning contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term 'single-industry' describes a situation where a region, town, or economy is heavily reliant on one particular industry for its economic well-being. This can make the area vulnerable to economic downturns if that industry faces difficulties. The word is used in economics and regional planning. It's not a very common word, but it's important to understand if you're reading about economics or regional development."},"example_sentences":[{"sentence":"The **single-industry** town struggled after the factory closed.","translation":"その単一産業の町は、工場閉鎖後苦境に陥った。","type":"adjective","meaning_category":"単一産業の"},{"sentence":"The government encouraged diversification to move the region away from being a **single-industry** economy.","translation":"政府は、その地域を単一産業経済から脱却させるために、多様化を奨励した。","type":"adjective","meaning_category":"単一産業の"}]}