{"word":"manak","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A unit of mass used in some parts of India, equal to approximately 84 pounds.","english_definition":"A traditional unit of mass, primarily used in India, equivalent to roughly 84 pounds or 38 kilograms.","examples":[{"sentence":"The farmer harvested several manaks of wheat this season.","translation":"農家は今シーズン、数マナクの小麦を収穫した。"},{"sentence":"The weight of the goods was measured in manaks.","translation":"商品の重さはマナクで測定された。"}],"collocations":["measure in manaks","weigh in manaks","manak of wheat","manak of rice"],"synonyms":["maund","seer"],"antonyms":[]}],"etymology":{"value":"The term 'manak' is derived from historical weight measurements used in the Indian subcontinent. Its exact origin is difficult to pinpoint, as it varies regionally and historically.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈnæk/","syllables":"ma-nak"},"inflection":{"noun_plural":"manaks"},"usage_notes":{"explanation":"The 'manak' is a historical unit of weight, and its exact value can vary depending on the region and time period. It is not a standard unit in modern measurement systems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He weighed the gold in kilograms instead of manak.","correct":"✓ He weighed the gold in kilograms instead of manaks."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["maund","seer","tola"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'manak' refers to a historical unit of mass used in India. It is not commonly used in modern contexts, and understanding its meaning requires familiarity with historical measurement systems."},"example_sentences":[{"sentence":"The old records indicated the grain was traded in manaks.","translation":"古い記録には、穀物がマナク単位で取引されていたことが示されていた。","type":"noun","meaning_category":"unit of mass"},{"sentence":"A manak of cotton was considered a substantial amount.","translation":"1マナクの綿はかなりの量と見なされた。","type":"noun","meaning_category":"unit of mass"}]}