{"word":"Deewans","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"plural of deewan (a variant spelling of diwan)","english_definition":"plural form of deewan, which is an alternative spelling of diwan, referring to a collection of poems, a council chamber, or a type of sofa.","examples":[{"sentence":"The library held several ancient Deewans, filled with the works of Persian poets.","translation":"その図書館には、ペルシャの詩人たちの作品で満たされた古代のディーワンがいくつか所蔵されていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Persian word 'diwan', meaning a collection of poems, a government department, or a council chamber.","priority":"★★★"},"pronunciation":{"ipa":"/diːˈwɑːnz/","syllables":"Dee-wans"},"inflection":{"noun_plural":"Deewans"},"usage_notes":{"explanation":"'Deewans' is simply the plural form of 'deewan', which itself is a variant spelling of 'diwan'. The word is relatively uncommon in modern English outside of specific historical or literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["diwan"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Deewans' refers to multiple instances of 'deewan,' a word that can have several meanings, including a collection of poems, a council chamber, or a type of sofa. Its usage is relatively rare and often confined to historical or literary contexts. Understanding the context is essential to interpreting its meaning correctly."},"example_sentences":[{"sentence":"The exhibition showcased several antique Deewans, each representing a different era of Persian literature.","translation":"その展示会では、さまざまな時代のペルシャ文学を代表するアンティークのディーワンがいくつか展示されていた。","type":"noun","meaning_category":"collection of poems"},{"sentence":"The historical records mention the gatherings of officials in the Deewans of the Mughal emperors.","translation":"歴史的記録には、ムガル皇帝のディーワンでの役人たちの集まりについて言及されている。","type":"noun","meaning_category":"council chambers"}]}