{"word":"scholasticism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"スコラ哲学、スコラ学","english_definition":"the system of theology and philosophy taught in medieval European universities, based on Aristotelian logic and the writings of the early Church Fathers and having a strong emphasis on tradition and dogma.","examples":[{"sentence":"Scholasticism dominated intellectual life in Europe for several centuries.","translation":"スコラ哲学は何世紀にもわたってヨーロッパの知的活動を支配した。"},{"sentence":"Thomas Aquinas is a central figure in the development of scholasticism.","translation":"トマス・アクィナスはスコラ哲学の発展における中心人物である。"},{"sentence":"Scholasticism attempted to reconcile faith and reason.","translation":"スコラ哲学は信仰と理性の調和を試みた。"}],"collocations":["medieval scholasticism (中世スコラ哲学)","Thomistic scholasticism (トマス的スコラ哲学)","scholastic method (スコラ的方法)","scholastic tradition (スコラ的伝統)"],"synonyms":["scholastic philosophy","scholastic theology"],"antonyms":["humanism","empiricism","rationalism"]},{"part_of_speech":"noun","definition":"（軽蔑的に）形式主義、独断主義、権威主義","english_definition":"(derogatory) excessive adherence to traditional doctrines and methods; formalism.","examples":[{"sentence":"His approach to the problem was criticized as scholasticism.","translation":"彼の問題への取り組み方は形式主義だと批判された。"},{"sentence":"The debate degenerated into mere scholasticism.","translation":"その議論は単なる独断主義に堕落した。"}],"collocations":["empty scholasticism (空虚な形式主義)","sterile scholasticism (不毛な形式主義)"],"synonyms":["formalism","dogmatism","pedantry"],"antonyms":["originality","creativity"]}],"etymology":{"value":"Derived from the Latin word 'scholasticus,' meaning 'belonging to a school' or 'teacher.' It refers to the philosophical and theological methods developed and taught in medieval schools and universities.","priority":"★★★"},"pronunciation":{"ipa":"/skəˈlæstɪsɪzəm/","syllables":"sco-las-ti-ci-sm"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"Scholasticism refers to a specific intellectual tradition that flourished in medieval Europe. It is characterized by its reliance on Aristotelian logic, the writings of Church Fathers, and a commitment to reconciling faith and reason. In a derogatory sense, it can refer to an overly formal or dogmatic approach to intellectual inquiry.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He studied scholastic.","correct":"✓ He studied scholasticism.","note":"Scholastic is an adjective. Scholasticism is the noun form referring to the system of thought."}],"priority":"★★☆"},"related_words":{"derivatives":["scholastic (adjective: relating to schools or education; noun: a student or scholar)","scholastically (adverb: in a scholastic manner)"],"phrases":["Scholastic method (a method of critical thought based on Aristotelian logic and dialectic)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Scholasticism' is a term used to describe a specific system of philosophy and theology that was prominent in medieval universities. It's a complex concept that involves understanding Aristotelian logic, the writings of early Church Fathers, and the attempt to reconcile faith and reason. It's not a word you'd encounter in everyday conversation, but it's important for understanding intellectual history. The derogatory sense of the word, referring to excessive formalism, is less common but still relevant in academic contexts."},"example_sentences":[{"sentence":"The rise of humanism challenged the dominance of scholasticism in the Renaissance.","translation":"ルネサンスにおけるヒューマニズムの台頭は、スコラ哲学の支配に挑戦した。","type":"general","meaning_category":"General"},{"sentence":"Scholasticism emphasized rigorous logical analysis and debate.","translation":"スコラ哲学は厳密な論理分析と討論を重視した。","type":"general","meaning_category":"General"},{"sentence":"Some critics argue that scholasticism became too focused on abstract arguments and lost touch with practical concerns.","translation":"一部の批評家は、スコラ哲学が抽象的な議論に焦点を当てすぎて、実際的な問題とのつながりを失ったと主張している。","type":"derogatory","meaning_category":"Derogatory"}]}