{"word":"Roxolani","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A Sarmatian tribe who migrated westwards to the area north of the Black Sea in the 2nd century BC.","english_definition":"An ancient Sarmatian tribe who migrated westwards to the area north of the Black Sea in the 2nd century BC.","examples":[{"sentence":"The Roxolani were known for their skilled cavalry.","translation":"ロクソラニ族は熟練した騎兵で知られていました。"},{"sentence":"The Roxolani frequently clashed with the Roman Empire.","translation":"ロクソラニ族はしばしばローマ帝国と衝突しました。"}],"collocations":["Roxolani tribe","Sarmatian Roxolani","Roman-Roxolani wars"],"synonyms":["Sarmatians","Alans","Iazyges"],"antonyms":[]}],"etymology":{"value":"The name 'Roxolani' is believed to be derived from an Iranian language, possibly meaning 'bright Alans' or 'people of the bright Alans'. The prefix 'rox' is thought to be related to the Iranian word for 'bright' or 'shining'.","priority":"★★☆"},"pronunciation":{"ipa":"/rɒkˈsɒləni/","syllables":"Rox-o-la-ni"},"inflection":{"notes":"Plural form is Roxolani (as it refers to a tribe)."},"usage_notes":{"explanation":"The Roxolani were a nomadic people of Iranian origin who played a significant role in the history of the Black Sea region and the Roman Empire. They are primarily known from historical accounts by Roman and Greek writers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Roxolani was a person.","correct":"✓ The Roxolani were a tribe.","note":"Roxolani refers to a group of people, not an individual."}],"priority":"★☆☆"},"related_words":{"derivatives":["Roxolanian (adjective: relating to the Roxolani)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily encountered in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Roxolani' is a term primarily encountered in the study of ancient history, specifically when examining the interactions between nomadic tribes and settled empires in the Black Sea region. Understanding requires familiarity with ancient history and tribal migrations.","requires_background_knowledge":true},"example_sentences":[{"sentence":"The Roxolani posed a constant threat to Roman control over the Danubian frontier.","translation":"ロクソラニ族はドナウ川国境に対するローマの支配にとって絶え間ない脅威でした。","type":"historical context","meaning_category":"historical significance"},{"sentence":"Archaeological findings suggest that the Roxolani had a sophisticated culture.","translation":"考古学的発見は、ロクソラニ族が洗練された文化を持っていたことを示唆しています。","type":"archaeological evidence","meaning_category":"cultural aspects"}]}