{"word":"behaviorally-driven","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"行動によって動機づけられた、行動に基づいて推進される","english_definition":"Motivated or influenced by behavior; driven by behavioral factors.","examples":[{"sentence":"The company adopted a behaviorally-driven approach to improve employee productivity.","translation":"その会社は、従業員の生産性を向上させるために、行動に基づいて推進されるアプローチを採用した。"},{"sentence":"The marketing campaign was behaviorally-driven, focusing on how consumers make decisions.","translation":"そのマーケティングキャンペーンは、消費者がどのように意思決定を行うかに焦点を当てた、行動によって推進されるものだった。"},{"sentence":"The new policy is behaviorally-driven, aiming to change people's habits through incentives.","translation":"その新しい政策は、インセンティブを通じて人々の習慣を変えることを目的とした、行動によって動機づけられたものである。"}],"collocations":["behaviorally-driven design","behaviorally-driven intervention","behaviorally-driven strategy","behaviorally-driven model"],"synonyms":["behavior-based","behaviorally-influenced","behaviorally-oriented"],"antonyms":["instinctively-driven","intuitively-driven","randomly-driven"]}],"etymology":{"value":"The term is formed by combining 'behaviorally' (relating to behavior) with 'driven' (motivated or propelled). It suggests that actions or decisions are primarily guided by behavioral considerations or principles.","priority":"★★☆"},"pronunciation":{"ipa":"/bɪˈheɪvjərəlɪ ˈdrɪvn/","syllables":"bi-hav-ior-al-ly driv-en"},"inflection":{"notes":"Adjectives do not typically inflect in English, though they can be modified by adverbs (e.g., 'very behaviorally-driven')."},"usage_notes":{"explanation":"'Behaviorally-driven' is often used in contexts where understanding and influencing behavior is crucial, such as in marketing, policy-making, and organizational management. It implies a deliberate focus on behavioral factors rather than relying solely on other considerations like logic or intuition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The project was behaviorally driving.","correct":"✓ The project was behaviorally-driven.","note":"'Behaviorally-driven' is a compound adjective, not a verb. The past participle form 'driven' is required."},{"incorrect":"✗ The decision was drive behaviorally.","correct":"✓ The decision was behaviorally-driven.","note":"The correct word order is 'behaviorally-driven', with 'behaviorally' modifying 'driven'."}],"priority":"★★☆"},"related_words":{"derivatives":["behavioral (adjective)","behaviorism (noun)","behaviorist (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized or technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Behaviorally-driven' is a complex term used in specialized fields like psychology, marketing, and organizational behavior. It signifies that a process, strategy, or decision is primarily motivated by understanding and influencing behavior. This term is not commonly used in everyday language and requires a good understanding of behavioral science concepts to fully grasp its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The user interface was redesigned using a behaviorally-driven approach to increase engagement.","translation":"ユーザーインターフェースは、エンゲージメントを高めるために、行動に基づいて推進されるアプローチを使用して再設計された。","type":"adjective","meaning_category":"行動によって動機づけられた"},{"sentence":"The company's success is largely due to its behaviorally-driven sales strategy.","translation":"その会社の成功は、主に行動によって推進される販売戦略によるものである。","type":"adjective","meaning_category":"行動に基づいて推進される"},{"sentence":"The program is behaviorally-driven, incorporating principles of operant conditioning.","translation":"そのプログラムは、オペラント条件付けの原則を取り入れた、行動によって動機づけられたものである。","type":"adjective","meaning_category":"行動によって動機づけられた"}]}