{"word":"undeftly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"不器用に、下手に","english_definition":"in a clumsy or unskillful manner","examples":[{"sentence":"He undeftly tried to catch the ball and dropped it.","translation":"彼は不器用にボールを捕ろうとして落としてしまった。"},{"sentence":"She undeftly navigated the crowded room, bumping into several people.","translation":"彼女は混雑した部屋を下手に行き来し、何人かの人にぶつかった。"}],"collocations":["handle something undeftly","move undeftly","act undeftly"],"synonyms":["clumsily","awkwardly","ineptly","ungracefully"],"antonyms":["deftly","skillfully","gracefully","adroitly"]}],"etymology":{"value":"\"Undeftly\" is formed by adding the suffix \"-ly\" to the adjective \"undeft.\" \"Undeft\" is created by adding the prefix \"un-\" (meaning \"not\") to \"deft,\" which means skillful and nimble. Therefore, \"undeftly\" literally means \"not skillfully.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈdɛftli/","syllables":"un-deft-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"\"Undeftly\" describes an action performed without skill or grace. It is used to emphasize the lack of dexterity or finesse in the execution of a task or movement. It is less common than its synonym \"clumsily\" but provides a more precise description of a lack of skill rather than simple awkwardness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He undefterly tried to fix the car.","correct":"✓ He undeftly tried to fix the car.","note":"The correct adverb form is \"undeftly,\" not \"undefterly.\" There is no comparative or superlative form for this adverb."},{"incorrect":"✗ She acted undefter than usual.","correct":"✓ She acted more undeftly than usual.","note":"To express a comparative degree, use \"more undeftly\" rather than creating a non-existent comparative form."}],"priority":"★★☆"},"related_words":{"derivatives":["undeft (adjective: not skillful, clumsy)","deftly (adverb: skillfully, nimbly)","deft (adjective: skillful, nimble)"],"antonyms":["deftly (adverb: skillfully, nimbly)"],"synonyms":["clumsily (adverb: awkwardly, without skill)","awkwardly (adverb: in an uncomfortable or clumsy manner)","ineptly (adverb: unskillfully, incompetently)","ungracefully (adverb: without grace or elegance)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Undeftly\" is an adverb that means \"in a clumsy or unskillful manner.\" It's not a commonly used word, so it is more often found in formal writing or when trying to precisely describe a lack of skill. If you want to describe someone doing something without skill, you can use \"undeftly.\" It's the opposite of \"deftly,\" which means skillfully. The word is formed by adding \"un-\" to \"deft\" (meaning skillful) and then adding \"-ly\" to make it an adverb. Because of its rarity, it's more likely to appear in advanced texts or when a writer wants to be very specific about the lack of skill involved in an action."},"example_sentences":[{"sentence":"The waiter undeftly spilled the wine on the tablecloth.","translation":"ウェイターは不器用にテーブルクロスにワインをこぼしてしまった。","type":"example"},{"sentence":"He undeftly tried to open the jar, struggling for several minutes.","translation":"彼は不器用に瓶を開けようとし、数分間もがいていた。","type":"example"},{"sentence":"She undeftly applied the makeup, resulting in a smeared and uneven look.","translation":"彼女は不器用に化粧をし、その結果、化粧がにじんでむらになった。","type":"example"}]}