{"word":"unroadworthiness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(車両の)整備不良、走行不適合状態","english_definition":"The state or condition of a vehicle being unfit or unsafe to be driven on a road.","examples":[{"sentence":"The vehicle was impounded due to its unroadworthiness.","translation":"その車両は整備不良のため、差し押さえられた。"},{"sentence":"The inspector cited several instances of unroadworthiness.","translation":"検査官はいくつかの走行不適合状態を指摘した。"},{"sentence":"Unroadworthiness can lead to serious accidents.","translation":"整備不良は重大な事故につながる可能性がある。"}],"collocations":["vehicle unroadworthiness","certificate of unroadworthiness","due to unroadworthiness"],"synonyms":["mechanical failure","disrepair","unsafe condition"],"antonyms":["roadworthiness","serviceability","safe condition"]}],"etymology":{"value":"Formed from \"un-\" (not) + \"roadworthiness\" (the state of being fit to be driven on a road).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈroʊdwɜːrdinəs/","syllables":"un-road-wor-thi-ness"},"inflection":{"noun_plural":"unroadworthinesses (rare)"},"usage_notes":{"explanation":"\"Unroadworthiness\" is a formal term, often used in legal or technical contexts, to describe the condition of a vehicle that is not safe or legally permitted to be driven on public roads. It typically refers to mechanical defects or failures that compromise the safety of the vehicle, its occupants, or other road users.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The car had a unroadworthiness.","correct":"✓ The car had unroadworthiness.","note":"\"Unroadworthiness\" is an uncountable noun, so it does not take the indefinite article \"a\"."},{"incorrect":"✗ The unroadworthiness of the car caused an accident.","correct":"✓ The unroadworthy condition of the car caused an accident.","note":"While \"unroadworthiness\" is correct, using \"unroadworthy condition\" might sound more natural and be more easily understood in general conversation."}],"priority":"★★☆"},"related_words":{"derivatives":["unroadworthy (adjective)"],"phrases":["certificate of unroadworthiness"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unroadworthiness\" is a technical term that describes the condition of a vehicle that is not safe or legally allowed to be driven on roads. It's a formal word, often used in legal or official documents related to vehicle inspections and safety regulations. Because it's a specialized term, it's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The police issued a notice of unroadworthiness to the driver.","translation":"警察は運転手に整備不良の通知を発行した。","type":"noun","meaning_category":"整備不良"},{"sentence":"The cost of repairing the vehicle's unroadworthiness exceeded its value.","translation":"車両の整備不良を修理する費用がその価値を超えた。","type":"noun","meaning_category":"走行不適合状態"},{"sentence":"Regular inspections are essential to prevent unroadworthiness.","translation":"定期的な検査は、整備不良を防ぐために不可欠である。","type":"noun","meaning_category":"整備不良"}]}