{"word":"temper-wearing","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(Literally) Wearing or displaying one's temper; easily angered or irritable.","english_definition":"Literally, wearing or displaying one's temper. More commonly, easily angered or irritable.","examples":[{"sentence":"He was a temper-wearing man, quick to anger at the slightest provocation.","translation":"彼は短気な男で、ほんの少しの挑発にもすぐに怒った。"},{"sentence":"The temper-wearing child threw a tantrum in the store.","translation":"癇癪持ちの子供は店の中で駄々をこねた。"}],"collocations":["temper-wearing behavior","temper-wearing attitude","temper-wearing personality"],"synonyms":["irascible","choleric","irritable","testy","quick-tempered","hot-tempered"],"antonyms":["placid","calm","even-tempered","good-natured"]}],"etymology":{"value":"A compound adjective formed by combining 'temper' (referring to a person's state of mind or disposition, especially with regard to anger) and 'wearing' (in the sense of displaying or exhibiting).","priority":"N/A"},"pronunciation":{"ipa":"/ˈtempərˌwɛərɪŋ/","syllables":"tem-per-wear-ing"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The adjective 'temper-wearing' literally describes someone who 'wears' their temper, meaning they visibly display their anger or irritability. While the literal interpretation is possible, it is more commonly used to describe someone who is generally quick-tempered or easily angered. It is a relatively uncommon word.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The temper-wearing of the metal made it brittle.","correct":"✓ The tempering of the metal made it brittle.","note":"'Temper-wearing' (displaying one's temper) should not be confused with 'tempering' (a metallurgical process)."},{"incorrect":"✗ She was temper-wearing a new dress.","correct":"✓ She was wearing a new dress and had a bad temper.","note":"'Temper-wearing' is an adjective, not a verb. It describes a quality of a person, not an action."}],"priority":"N/A"},"related_words":{"derivatives":["temper (noun)","wearing (adjective)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Temper-wearing' is a relatively rare and sophisticated word used to describe someone who readily displays their anger or irritability. It combines the concept of 'temper' (referring to a person's mood or disposition, especially with regard to anger) with 'wearing' (in the sense of displaying something visibly). Because of its rarity and somewhat figurative nature, it is more likely to be encountered in advanced literary or descriptive contexts."},"example_sentences":[{"sentence":"The temper-wearing old man shouted at the children for playing in his yard.","translation":"短気な老人は、庭で遊んでいる子供たちに怒鳴った。","type":"adjective","meaning_category":"easily angered"},{"sentence":"Her temper-wearing attitude made it difficult to work with her.","translation":"彼女の短気な態度は、彼女と一緒に働くことを困難にした。","type":"adjective","meaning_category":"irritable"}]}