{"word":"centurial","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"100年ごとの、100年紀の、世紀の","english_definition":"Relating to a century or centuries; occurring every hundred years.","examples":[{"sentence":"The centurial celebrations were a grand affair.","translation":"100年ごとの祝典は盛大なものでした。"},{"sentence":"Centurial changes in climate are difficult to predict.","translation":"気候における100年ごとの変化を予測するのは難しい。"}],"collocations":["centurial cycle","centurial event","centurial change"],"synonyms":["century-long","hundred-year"],"antonyms":["annual","decennial"]}],"etymology":{"value":"From Latin 'centuria' (a division of one hundred, especially of soldiers in the Roman army) + '-al'.","priority":"★★★"},"pronunciation":{"ipa":"/sɛnˈtʃʊəriəl/","syllables":"cen-tu-ri-al"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with 'centurial'."},"usage_notes":{"explanation":"'Centurial' is used to describe events, changes, or cycles that happen or are measured over a period of one hundred years. It is less common than 'centennial', which also means relating to a century but is more frequently used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The centurial anniversary.","correct":"✓ The centennial anniversary.","note":"'Centennial' is more commonly used for anniversaries."}],"priority":"★★☆"},"related_words":{"derivatives":["century","centennial"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'centurial' is a relatively uncommon adjective used to describe something that occurs or pertains to a period of one hundred years. It's often used in academic or technical contexts when discussing long-term trends or cycles. While similar in meaning to 'centennial', 'centennial' is much more frequently used in general contexts. Therefore, understanding 'centurial' is more relevant for advanced English comprehension rather than everyday usage."},"example_sentences":[{"sentence":"The study analyzed centurial trends in sea levels.","translation":"その研究では、海面水位の100年ごとの傾向を分析しました。","type":"general","meaning_category":"100年ごとの"},{"sentence":"Centurial shifts in agricultural practices have significantly impacted soil quality.","translation":"農業慣行における100年ごとの変化は、土壌の質に大きな影響を与えています。","type":"technical","meaning_category":"100年ごとの"}]}