{"word":"Englander","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"イングランド人、イングランド国民","english_definition":"A person from England; an English person.","examples":[{"sentence":"He is an Englander living abroad.","translation":"彼は海外に住むイングランド人です。"},{"sentence":"Many Englanders visit the Scottish Highlands each year.","translation":"毎年多くのイングランド人がスコットランドのハイランド地方を訪れます。"}],"collocations":["proud Englander","typical Englander"],"synonyms":["Englishman","Englishwoman","Briton"],"antonyms":[],"notes":"Often used interchangeably with 'Englishman' or 'Englishwoman', although 'Briton' refers to someone from Great Britain, which includes England, Scotland, and Wales."}],"etymology":{"value":"Derived from 'England' (the country) + '-er' (suffix indicating a person from a place).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɪŋɡləndər/","syllables":"Eng-land-er"},"inflection":{"noun_plural":"Englanders"},"usage_notes":{"explanation":"'Englander' is a straightforward term for a person from England. While 'Englishman' and 'Englishwoman' are more common, 'Englander' is perfectly acceptable and understandable. It's important to remember that 'Englander' specifically refers to someone from England, not the UK as a whole.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is an Englander, so she is Scottish.","correct":"✓ She is Scottish. / ✓ She is an Englander, but she also has Scottish ancestry.","note":"An Englander is from England, not Scotland. Someone from Scotland is Scottish."},{"incorrect":"✗ He is an Englander, therefore he supports the Welsh rugby team.","correct":"✓ He is English, therefore he supports the English rugby team. / ✓ He is an Englander, but he supports the Welsh rugby team.","note":"Typically, an Englander supports the English national teams."}],"priority":"★★☆"},"related_words":{"derivatives":["England","English","Englishman","Englishwoman"],"related_terms":["Briton","Great Britain","United Kingdom"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent compared to 'Englishman' or 'Englishwoman'.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Englander' is a noun referring to a person from England. It's a less common alternative to 'Englishman' or 'Englishwoman' but is easily understood. The word is formed by adding the suffix '-er' to 'England', indicating a person associated with that place. It's important to use this term accurately to refer specifically to people from England, and not to confuse it with 'Briton', which refers to people from Great Britain (England, Scotland, and Wales)."},"example_sentences":[{"sentence":"As an Englander, he felt a strong connection to his homeland.","translation":"イングランド人として、彼は故郷との強い繋がりを感じていた。","type":"general","meaning_category":"nationality"},{"sentence":"The Englanders in the crowd cheered loudly for their team.","translation":"群衆の中のイングランド人たちは、自分たちのチームに大声で声援を送った。","type":"general","meaning_category":"nationality"},{"sentence":"She met many Englanders while backpacking through Europe.","translation":"彼女はヨーロッパをバックパック旅行中に多くのイングランド人と出会った。","type":"general","meaning_category":"nationality"}]}