{"word":"nontemporally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"時間的制約を受けずに、時間に関係なく","english_definition":"in a manner that is not subject to or limited by time; without regard to time.","examples":[{"sentence":"The concept of eternity is often understood nontemporally, as existing outside of time.","translation":"永遠という概念は、時間外に存在する、時間的制約を受けないものとして理解されることが多い。"},{"sentence":"Some philosophical arguments attempt to prove the existence of a nontemporal reality.","translation":"いくつかの哲学的議論は、時間に関係ない現実の存在を証明しようと試みる。"}],"collocations":["exist nontemporally","understand nontemporally","view nontemporally"],"synonyms":["atemporally","timelessly","eternally"],"antonyms":["temporally","transiently","ephemerally"]}],"etymology":{"value":"\"non-\" (否定) + \"temporally\" (時間的に)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈtɛmpərəli/","syllables":"non-tem-po-ral-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Nontemporally\" is an adverb used to describe something that exists or occurs outside of the constraints of time. It is often used in philosophical, theological, and scientific contexts when discussing concepts such as eternity, timelessness, or realities that are not bound by the conventional understanding of time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was nontemporal.","correct":"✓ The painting existed nontemporally in the artist's mind.","note":"\"Nontemporal\" is an adjective; \"nontemporally\" is an adverb. Use the correct form to modify the appropriate word."}],"priority":"★★★"},"related_words":{"derivatives":["nontemporal (adjective)","temporally (adverb)","temporal (adjective)","temporality (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Nontemporally\" is a highly specialized term primarily used in philosophical, theological, and theoretical physics contexts. It describes something that exists or happens without being influenced or constrained by time. This word is not commonly encountered in everyday language and requires a sophisticated understanding of abstract concepts related to time and existence. Therefore, it is categorized as a C2 level word."},"example_sentences":[{"sentence":"God is often described as existing **nontemporally**.","translation":"神はしばしば時間的制約を受けずに存在すると説明される。","type":"adverb","meaning_category":"時間的制約を受けずに"},{"sentence":"The artwork captured a feeling that resonated **nontemporally** with viewers across generations.","translation":"そのアート作品は、世代を超えて、時間に関係なく観る人の心に響く感情をとらえた。","type":"adverb","meaning_category":"時間に関係なく"}]}