{"word":"Eunomian","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"エウノミオス派の人、アノモイオス派の人","english_definition":"A follower of Eunomius, a proponent of Anomoeanism.","examples":[{"sentence":"The Eunomians were considered heretics by the mainstream church.","translation":"エウノミオス派は主流教会から異端とみなされていた。"}],"synonyms":["Anomoean"],"antonyms":[]},{"part_of_speech":"形容詞","definition":"エウノミオス派の、アノモイオス派の","english_definition":"Relating to Eunomius or Anomoeanism.","examples":[{"sentence":"Eunomian theology emphasized the incomprehensibility of God's essence.","translation":"エウノミオス派の神学は、神の本質の不可解さを強調した。"}],"synonyms":["Anomoean"],"antonyms":[]}],"etymology":{"value":"From Eunomius (Greek: Εὐνόμιος), a 4th-century Arian bishop, + -ian.","priority":"中"},"pronunciation":{"ipa":"/juːˈnoʊmiən/","syllables":"Eu-no-mi-an"},"inflection":{},"usage_notes":{"explanation":"Eunomianism, also known as Anomoeanism, was a radical Arian sect in the 4th century that argued that the essence of God the Father was completely dissimilar (Greek: anomoios) to that of the Son. This contrasted with the Homoian and Homoousian positions. The term is primarily used in historical and theological contexts.","priority":"高"},"common_mistakes":{},"related_words":{"derivatives":["Eunomius","Anomoean","Arian"],"related_terms":["Homoousian","Homoian"],"priority":"中"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'Eunomian' is highly specialized, pertaining to a specific theological movement in the 4th century. Understanding requires knowledge of early Christian history and Arianism. Usage is limited to academic or theological discussions.","priority":"高"},"example_sentences":[{"sentence":"The writings of the Eunomian theologians are important for understanding the development of Arian thought.","translation":"エウノミオス派の神学者の著作は、アリウス派思想の発展を理解する上で重要である。","type":"adjective","meaning_category":"Relating to Eunomius"},{"sentence":"The controversy surrounding the Eunomians led to further divisions within the early church.","translation":"エウノミオス派をめぐる論争は、初期教会におけるさらなる分裂につながった。","type":"noun","meaning_category":"A follower of Eunomius"}]}