{"word":"senggang","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(マレーシア、インドネシアのスラング)暇な時間、自由時間","english_definition":"(Malaysian/Indonesian slang) free time, leisure time","examples":[{"sentence":"Saya tak ada senggang nak buat kerja itu.","translation":"I don't have any free time to do that work. (私はその仕事をする暇がありません。)","english_translation":"I don't have any free time to do that work."},{"sentence":"Pada waktu senggang, dia suka membaca buku.","translation":"In his free time, he likes to read books. (暇なとき、彼は本を読むのが好きです。)","english_translation":"In his free time, he likes to read books."}],"collocations":["waktu senggang (free time)","masa senggang (free time)"],"synonyms":["masa lapang","waktu lapang"],"antonyms":["sibuk (busy)"],"notes":"This word is commonly used in informal conversations in Malaysia and Indonesia."}],"etymology":{"value":"Likely derived from Malay/Indonesian roots, but the exact etymology is not widely documented. It's a colloquial term.","priority":"★☆☆"},"pronunciation":{"ipa":"/səŋ.ɡaŋ/","syllables":"seng-gang"},"inflection":{"notes":"As a noun, it doesn't inflect for pluralization in the same way as English nouns. The plural is often indicated by context or quantity words."},"usage_notes":{"explanation":"'Senggang' is a casual way to refer to free time. It's more commonly heard than seen in writing, especially in formal contexts. It's useful for expressing a lack of time or describing activities done during leisure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Saya sangat senggang hari ini.","correct":"Saya ada banyak waktu senggang hari ini.","note":"'Senggang' itself is the free time, not an adjective to describe yourself. You have to say 'I have a lot of free time'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["santai (relax)","rehat (rest)","libur (holiday)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency, mainly used in Malaysia and Indonesia.","priority":"★☆☆"},"readability_explanation":{"level":"Beginner/Intermediate","text":"'Senggang' is a simple word to understand if you're familiar with Malaysian or Indonesian slang. It just means free time. Use it when you want to sound casual. Remember it's not often used in formal writing. "},"example_sentences":[{"sentence":"Kalau ada senggang, mari kita minum kopi.","translation":"If there's free time, let's have coffee.","type":"General","meaning_category":"Free time"},{"sentence":"Saya tak punya senggang untuk menonton film.","translation":"I don't have free time to watch a movie.","type":"General","meaning_category":"Lack of free time"}]}