{"word":"polysomaty","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"多染色体性、多核体性：細胞内に通常の二倍体以上の染色体セットが存在する状態。植物細胞や一部の動物細胞で見られる。","english_definition":"The condition of having more than the normal diploid number of chromosome sets within a cell. It is observed in plant cells and some animal cells.","examples":[{"sentence":"Polysomaty is common in plant endosperm tissue.","translation":"多染色体性は植物の胚乳組織によく見られる。"},{"sentence":"The degree of polysomaty can vary between different tissues in the same organism.","translation":"多染色体性の程度は、同じ生物の異なる組織間で異なることがある。"}],"collocations":["degree of polysomaty","plant polysomaty","endosperm polysomaty"],"synonyms":["polyploidy","endomitosis"],"antonyms":[]}],"etymology":{"value":"\"poly-\" (多くの) + \"somaty\" (体、ここでは染色体セットを指す) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒlɪˈsoʊməti/","syllables":"pol-y-so-ma-ty"},"inflection":{"noun_plural":"polysomaties"},"usage_notes":{"explanation":"Polysomatyは、細胞が通常の二倍体（2n）以上の染色体セットを持つ状態を指します。これはpolyploidy（倍数性）の一種と見なされることもありますが、polysomatyは生物全体ではなく、特定の細胞または組織に限定されることが多いです。植物では特に一般的な現象であり、特定の組織の成長や機能に影響を与える可能性があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Polysomaty is the same as polyploidy in all cases.","correct":"✓ Polysomaty is a type of polyploidy, but it is localized to specific cells or tissues, unlike whole-organism polyploidy.","note":"Polysomatyはpolyploidyの一種ですが、生物全体ではなく特定の細胞や組織に限定される点が異なります。"},{"incorrect":"✗ Polysomaty always leads to negative consequences for the organism.","correct":"✓ Polysomaty can have both positive and negative effects on the organism, depending on the specific context.","note":"Polysomatyの影響は文脈によって異なり、必ずしも負の結果をもたらすとは限りません。"}],"priority":"★★☆"},"related_words":{"derivatives":["polysomatic (adjective): 多染色体性の"],"related_terms":["polyploidy","endomitosis","chromosome","genome"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な生物学の文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Polysomaty**」は、生物学、特に細胞生物学の分野で使用される専門用語です。これは、通常の二倍体細胞が持つ染色体セット数よりも多い染色体セットが細胞内に存在するという状態を指します。この現象は、植物の特定の組織（例えば、胚乳）でよく見られます。Polysomatyは、細胞の成長や機能に影響を与える可能性があり、その影響は文脈によって異なります。この用語は、高度な生物学の知識を持つ読者を対象としています。"},"example_sentences":[{"sentence":"The study investigated the role of polysomaty in the development of the plant's root system.","translation":"その研究は、植物の根系の発達における多染色体性の役割を調査した。","type":"noun","meaning_category":"多染色体性"},{"sentence":"Polysomaty in liver cells can be an indicator of certain diseases.","translation":"肝細胞における多染色体性は、特定の疾患の指標となる可能性がある。","type":"noun","meaning_category":"多染色体性"}]}