{"word":"regainment","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(失ったもの、特に体重)の再獲得、取り戻し","english_definition":"The act or process of regaining something, especially weight that has been lost.","examples":[{"sentence":"Weight regainment is a common challenge after dieting.","translation":"体重の再獲得は、ダイエット後の一般的な課題です。"},{"sentence":"The study focused on strategies to prevent regainment of lost muscle mass.","translation":"その研究は、失われた筋肉量の再獲得を防ぐための戦略に焦点を当てました。"}],"collocations":["weight regainment (体重の再獲得)","muscle regainment (筋肉の再獲得)","regainment prevention (再獲得の防止)"],"synonyms":["recovery","reacquisition","restoration"],"antonyms":["loss","depletion"]}],"etymology":{"value":"\"Regainment\" is formed by combining the prefix \"re-\" (meaning again or anew) with the noun \"gainment\" (the act of gaining). The word suggests the act of gaining something back that was previously lost.","priority":"★★☆"},"pronunciation":{"ipa":"/riˈɡeɪnmənt/","syllables":"re-gain-ment"},"inflection":{"noun_plural":"regainments"},"usage_notes":{"explanation":"\"Regainment\" specifically refers to the act of getting something back, often after a period of loss. It is commonly used in the context of health and fitness, particularly in discussions about weight management and muscle recovery. While \"recovery\" and \"restoration\" can be synonyms, \"regainment\" emphasizes the process of regaining something that was previously possessed but then lost.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The regainment of his health was a slow process.","correct":"✓ The recovery of his health was a slow process.","note":"While \"regainment\" can be used for health in some contexts, \"recovery\" is more common and natural in this general sense."},{"incorrect":"✗ She focused on the regainment of her lost keys.","correct":"✓ She focused on finding her lost keys.","note":"For simple objects, \"finding\" or \"recovering\" are more common than \"regainment.\""}],"priority":"★★☆"},"related_words":{"derivatives":["regain (verb: 取り戻す、回復する)","gain (noun: 獲得、利益; verb: 獲得する、増す)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門的な文脈での使用)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 専門的な文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Regainment\" is a relatively uncommon word that refers to the process of getting something back that was previously lost, particularly in the context of health and fitness. It is often used in discussions about weight regain after dieting or muscle regain after periods of inactivity. While the word is straightforward in its construction (re- + gainment), its usage is more common in specialized or technical writing.","priority":"★☆☆"},"example_sentences":[{"sentence":"The athlete was frustrated by the rapid regainment of fat after the competition.","translation":"そのアスリートは、競技会後の脂肪の急速な再獲得に不満を感じていた。","type":"noun","meaning_category":"体重の再獲得"},{"sentence":"Effective strategies are needed to minimize weight regainment following bariatric surgery.","translation":"肥満外科手術後の体重の再獲得を最小限に抑えるための効果的な戦略が必要です。","type":"noun","meaning_category":"体重の再獲得"},{"sentence":"The study investigated the factors contributing to muscle mass regainment after immobilization.","translation":"その研究では、固定後の筋肉量の再獲得に寄与する要因を調査しました。","type":"noun","meaning_category":"筋肉の再獲得"}]}