{"word":"Tanking","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(スポーツ) 意図的に負けること、弱体化戦略","english_definition":"(in sports) the practice of deliberately losing games in order to obtain a better draft pick or improve a team's position for future seasons; a strategy of deliberately weakening a team.","examples":[{"sentence":"The team was accused of tanking to get the first overall pick.","translation":"そのチームは、全体1位指名権を得るために意図的に負けていると非難された。"},{"sentence":"Tanking is a controversial strategy in professional sports.","translation":"タンキングはプロスポーツにおいて議論の的となる戦略である。"},{"sentence":"Fans were frustrated by the team's obvious tanking efforts.","translation":"ファンはチームの明白なタンキングの努力に不満を感じていた。"}],"collocations":["strategic tanking","deliberate tanking","accused of tanking","anti-tanking rules"],"synonyms":["losing on purpose","strategic losing","weakening the team"],"antonyms":["trying to win","competing fairly"]},{"part_of_speech":"verb","definition":"(スポーツ) 意図的に負ける、弱体化する","english_definition":"(in sports) to deliberately lose games in order to obtain a better draft pick or improve a team's position for future seasons; to deliberately weaken a team.","examples":[{"sentence":"The team is tanking this season to rebuild for the future.","translation":"そのチームは将来のために再建するため、今シーズンは意図的に負けている。"},{"sentence":"Critics accused the coach of tanking the game.","translation":"批評家たちはコーチが試合を意図的に負けさせたと非難した。"},{"sentence":"They were tanking so hard that they lost every game in the last month.","translation":"彼らは非常に熱心にタンキングしていたので、最後の1ヶ月のすべての試合に負けた。"}],"collocations":["tanking a game","tanking the season","tanking for a draft pick"],"synonyms":["losing on purpose","strategically losing","weakening the team"],"antonyms":["trying to win","competing fairly"]},{"part_of_speech":"verb","definition":"(株価などが)急落する、暴落する","english_definition":"(of stock prices, etc.) to decline rapidly and significantly; to plummet.","examples":[{"sentence":"The company's stock price tanked after the bad news.","translation":"その会社の株価は悪いニュースの後、急落した。"},{"sentence":"Shares tanked following the announcement of lower-than-expected earnings.","translation":"予想を下回る収益の発表後、株価は暴落した。"},{"sentence":"The market tanked due to investor fears.","translation":"投資家の不安により、市場は暴落した。"}],"collocations":["stock price tanking","market tanking","shares tanking"],"synonyms":["plummet","crash","collapse","decline sharply"],"antonyms":["soar","rise sharply"]},{"part_of_speech":"verb","definition":"(ゲーム) タンク役をする","english_definition":"(in gaming, especially MMOs) to play the role of a tank, which involves drawing enemy attacks and protecting other players.","examples":[{"sentence":"He's tanking the boss while the rest of us deal damage.","translation":"彼がボスの攻撃を引き付けている間、残りのメンバーはダメージを与える。"},{"sentence":"We need someone who can tank effectively.","translation":"効果的にタンク役ができる人が必要だ。"},{"sentence":"Tanking requires good gear and a solid understanding of the game mechanics.","translation":"タンク役は、良い装備とゲームの仕組みの確かな理解が必要だ。"}],"collocations":["tanking the boss","tanking effectively","good at tanking"],"synonyms":["drawing aggro","absorbing damage","protecting the team"],"antonyms":["dealing damage","healing"]}],"etymology":{"value":"The term 'tanking' in sports likely originated from the idea of a team 'going into the tank,' meaning to deliberately perform poorly. The financial sense of 'tanking' (stock prices) probably derives from the image of something heavy and substantial (like a tank) suddenly falling rapidly. The gaming sense of 'tanking' comes from the idea of a character being heavily armored and able to withstand a lot of damage, like a tank.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtæŋkɪŋ/","syllables":"tan-king"},"inflection":{"verb_forms":{"present_simple":["tanking"],"past_simple":"tanked","past_participle":"tanked","present_participle":"tanking"}},"usage_notes":{"explanation":"The word 'tanking' has multiple meanings depending on the context. In sports, it refers to the deliberate act of losing to gain a competitive advantage in the future. In finance, it describes a rapid and significant decline in stock prices or market value. In gaming, it refers to the role of a player who absorbs damage and protects other teammates. Understanding the context is crucial to interpreting the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The team is tanking because they are not good.","correct":"✓ The team is tanking as a strategy, not because they are not good.","note":"Tanking implies a deliberate strategy, not simply being bad at the sport. It's important to emphasize the intentional aspect. If a team is simply performing poorly, it's more accurate to say they are 'playing badly' or 'struggling'."},{"incorrect":"✗ The company is tanking, so they are doing well.","correct":"✓ The company is tanking, so their stock price is falling.","note":"Tanking in finance always implies a negative outcome, such as a decline in stock value. It's the opposite of 'doing well'."},{"incorrect":"✗ He is tanking the team by scoring many points.","correct":"✓ He is tanking the team by deliberately missing shots and not playing defense.","note":"In sports, tanking involves actions that deliberately reduce the team's chances of winning, such as poor performance or strategic errors, not scoring points."}],"priority":"★★☆"},"related_words":{"derivatives":["tank (noun, verb)","tanker (noun)"],"phrases":["go into the tank"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (context dependent)","frequency_google_ngram":"Relatively low frequency, but increasing in sports and finance contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Tanking' is a word with specific meanings in different contexts. In sports, it means a team is intentionally losing to get better draft picks. In finance, it means a stock price or market is rapidly declining. In gaming, it describes a player who protects the team by absorbing damage. It's important to understand the context to know which meaning is intended. The term is more common in specialized discussions about sports, finance, or gaming, so it might not be widely understood by everyone.","priority":"★★☆"},"example_sentences":[{"sentence":"The basketball team was accused of **tanking** to improve their draft position.","translation":"そのバスケットボールチームは、ドラフト順位を上げるために意図的に負けていると非難された。","type":"verb","meaning_category":"sports"},{"sentence":"The stock market **tanked** after the unexpected economic report.","translation":"予想外の経済報告の後、株式市場は暴落した。","type":"verb","meaning_category":"finance"},{"sentence":"As a **tank**, his job is to absorb damage and protect the rest of the party.","translation":"タンク役として、彼の仕事はダメージを吸収し、パーティーの他のメンバーを守ることだ。","type":"noun","meaning_category":"gaming"},{"sentence":"The company's reputation **tanked** after the scandal was revealed.","translation":"スキャンダルが明らかになった後、その会社の評判は急落した。","type":"verb","meaning_category":"general (decline)"}]}