{"word":"Panak","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にインド、特にマハラシュトラ州で飲まれる)ショウガ、レモン、カルダモン、砂糖などを混ぜた伝統的な飲み物","english_definition":"A traditional Indian drink, especially popular in Maharashtra, made with ginger, lemon, cardamom, sugar, and water.","examples":[{"sentence":"She prepared a refreshing glass of Panak for the guests.","translation":"彼女は客のために爽やかなパナクを準備した。"},{"sentence":"During summer, Panak is a common drink to beat the heat.","translation":"夏の間、パナクは暑さをしのぐための一般的な飲み物です。"}],"collocations":["prepare Panak","drink Panak","refreshing Panak","traditional Panak"],"synonyms":["Indian lemonade","ginger drink"],"antonyms":[]}],"etymology":{"value":"The word 'Panak' is derived from Sanskrit.","priority":"★★★"},"pronunciation":{"ipa":"/pɑːnɑːk/","syllables":"Pa-nak"},"inflection":{"notes":"It is a noun and does not change form."},"usage_notes":{"explanation":"Panak is a traditional Indian beverage known for its refreshing and digestive properties. It is often consumed during festivals and hot weather. The recipe can vary slightly depending on regional preferences, but the core ingredients remain consistent.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"Panak is a specific cultural term referring to a traditional Indian drink. Understanding its meaning requires some familiarity with Indian culture or cuisine. The word itself is not commonly used outside of contexts related to Indian food and beverages.","priority":"★★☆"},"example_sentences":[{"sentence":"The vendor was selling cool glasses of Panak on the roadside.","translation":"露店商は道端で冷たいパナクを売っていた。","type":"noun","meaning_category":"traditional drink"},{"sentence":"My grandmother always makes Panak during the Hindu festival of Rama Navami.","translation":"私の祖母はいつもヒンドゥー教の祭りであるラーマ・ナヴァミの期間中にパナクを作る。","type":"noun","meaning_category":"traditional drink"}]}