{"word":"Zabaean","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ザバア人の、ザバア語の、ザバア教の","english_definition":"Relating to the Sabaeans, their language, or their religion.","examples":[{"sentence":"Zabaean inscriptions provide valuable insights into ancient Arabian culture.","translation":"ザバア語の碑文は、古代アラビア文化に関する貴重な洞察を提供する。"}],"collocations":[],"synonyms":["Sabaean"],"antonyms":[]},{"part_of_speech":"noun","definition":"ザバア人、ザバア語","english_definition":"A member of an ancient people of southern Arabia or their language.","examples":[{"sentence":"The Zabaeans were skilled traders and builders.","translation":"ザバア人は熟練した貿易商であり、建築家であった。"}],"collocations":[],"synonyms":["Sabaean"],"antonyms":[]}],"etymology":{"value":"From Latin Zabaei, from Greek Zabai, from Arabic Sabaʾ (سبأ), the name of the kingdom.","priority":"★★☆"},"pronunciation":{"ipa":"/zəˈbiːən/","syllables":"Za-bae-an"},"inflection":{"noun_plural":"Zabaeans"},"usage_notes":{"explanation":"The term \"Zabaean\" is often used interchangeably with \"Sabaean.\" It refers to the people, language, and culture of the ancient kingdom of Saba in southern Arabia (modern-day Yemen). The Sabaeans were known for their trade, agriculture, and the Great Dam of Marib.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["Sabaean"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"Zabaean\" is a relatively rare term referring to the ancient Sabaean civilization of southern Arabia. It is primarily encountered in historical or archaeological contexts. Familiarity with ancient history and civilizations is helpful for understanding this term."},"example_sentences":[{"sentence":"The Zabaean kingdom flourished through trade and agriculture.","translation":"ザバア王国は貿易と農業によって繁栄した。","type":"noun","meaning_category":"人"},{"sentence":"Zabaean art is characterized by its intricate designs and religious symbolism.","translation":"ザバアの芸術は、その複雑なデザインと宗教的な象徴性が特徴である。","type":"adjective","meaning_category":"形容詞"}]}