{"word":"alidade","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"照準器、視準儀","english_definition":"A sighting device used for measuring angles, typically in surveying or navigation.","examples":[{"sentence":"The surveyor used an alidade to measure the angle to the distant peak.","translation":"測量技師はアリダードを使って遠くの山の頂上までの角度を測った。"},{"sentence":"The alidade is an essential tool for creating accurate maps.","translation":"アリダードは正確な地図を作成するための不可欠な道具である。"}],"collocations":["plane table alidade","telescopic alidade","optical alidade"],"synonyms":["sight","sighting device","surveying instrument","theodolite (related)"],"antonyms":[]},{"part_of_speech":"noun","definition":"(天球儀などの)指針","english_definition":"A rule or arm attached to an instrument, such as a celestial globe, for indicating a reading.","examples":[{"sentence":"The alidade on the celestial globe pointed to the current position of the star.","translation":"天球儀のアリダードは星の現在の位置を示していた。"}],"collocations":["celestial globe alidade","armillary sphere alidade"],"synonyms":["index","pointer","indicator"],"antonyms":[]}],"etymology":{"value":"アラビア語の 'al-'idādah' (الْعِضَادَة) に由来し、これは 'the ruler' または 'the side' を意味する。","priority":"★★☆"},"pronunciation":{"ipa":"ˈælɪdeɪd","syllables":"al-i-dade"},"inflection":{"noun_plural":"alidades"},"usage_notes":{"explanation":"An alidade is a tool used for sighting and measuring angles. It is commonly used in surveying with a plane table, but can also be found on instruments like sextants and celestial globes. The term refers to the part of the instrument used for sighting.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a theodolite instead of alidade.","correct":"✓ I used an alidade.","note":"Theodolites are more complex surveying instruments, while alidades are simpler sighting devices. Using the wrong term can confuse the level of instrumentation used."}],"priority":"★☆☆"},"related_words":{"derivatives":["None (The term itself is not commonly used to derive other words.)"],"phrasal_verbs":["None (The term is a noun and does not form phrasal verbs.)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary, not typically covered in CEFR levels.)","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'alidade' is specialized vocabulary primarily used in the context of surveying, navigation, and astronomical instruments. It refers to a sighting device used for measuring angles. Understanding this term requires familiarity with these technical fields. It is not part of general English vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The surveyor carefully adjusted the alidade to get an accurate reading.","translation":"測量技師は正確な測定値を得るためにアリダードを注意深く調整した。","type":"noun","meaning_category":"照準器"},{"sentence":"By using the alidade on the plane table, they were able to map the terrain quickly.","translation":"平板上のアリダードを使うことで、彼らは地形を素早く地図にすることができた。","type":"noun","meaning_category":"照準器"}]}