{"word":"Gumbo-limbos","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A tropical tree (Bursera simaruba) native to the Americas, known for its peeling red bark.","english_definition":"A tropical tree (Bursera simaruba) native to tropical America, known for its smooth, reddish bark that peels off in papery flakes.","examples":[{"sentence":"The gumbo-limbos provided shade in the park.","translation":"その公園では、ガムボリンボの木が日陰を作っていた。"},{"sentence":"The peeling bark of the gumbo-limbos is a distinctive feature.","translation":"ガムボリンボの剥がれる赤い樹皮は特徴的だ。"}],"collocations":["gumbo-limbo tree","red gumbo-limbo","Bursera simaruba"],"synonyms":["turpentine tree","copperwood"],"antonyms":[]}],"etymology":{"value":"The name \"gumbo-limbo\" is believed to be derived from a combination of \"gumbo,\" referring to a type of okra soup, and \"limbo,\" perhaps alluding to the tree's use in folk medicine or its peeling bark.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡʌmboʊ ˈlɪmboʊz/","syllables":"gum-bo-lim-bohs"},"inflection":{"noun_plural":"Gumbo-limbos"},"usage_notes":{"explanation":"Gumbo-limbos are often planted as ornamental trees due to their attractive bark and tolerance of various soil conditions. They are also used in traditional medicine for various ailments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ gumbo limboes","correct":"✓ gumbo-limbos","note":"The correct plural form retains the hyphen and adds an 's' at the end."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Gumbo-limbos are tropical trees known for their distinctive peeling red bark. They are native to the Americas and are often used as ornamental trees. The name is thought to be derived from a combination of 'gumbo' and 'limbo', possibly referring to its use in folk medicine or its peeling bark."},"example_sentences":[{"sentence":"The gumbo-limbos in the garden added a tropical touch.","translation":"庭のガムボリンボはトロピカルな雰囲気を添えた。","type":"noun","meaning_category":"tree"},{"sentence":"The smooth, red bark of the gumbo-limbos is quite striking.","translation":"ガムボリンボの滑らかな赤い樹皮は非常に印象的だ。","type":"noun","meaning_category":"tree"}]}