{"word":"Waltonian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"アイザック・ウォルトン（Izaak Walton）または彼の著作に関連する、または彼のような","english_definition":"relating to, characteristic of, or like Izaak Walton or his writings.","examples":[{"sentence":"He had a Waltonian love of the countryside and fishing.","translation":"彼はウォルトンのように田園地帯と釣りを愛していた。"},{"sentence":"The Waltonian approach to angling emphasizes patience and observation.","translation":"ウォルトン流の釣りへのアプローチは、忍耐と観察を重視する。"}],"collocations":["Waltonian philosophy","Waltonian style","Waltonian angler"],"synonyms":["pastoral","bucolic","idyllic"],"antonyms":[]},{"part_of_speech":"noun","definition":"アイザック・ウォルトンを尊敬する人、または彼の著作に影響を受けた人","english_definition":"an admirer of Izaak Walton or someone influenced by his writings.","examples":[{"sentence":"He considers himself a Waltonian, finding solace in the quiet art of fishing.","translation":"彼は静かな釣りという芸術に慰めを見出し、自身をウォルトン主義者だと考えている。"}],"collocations":["a true Waltonian"],"synonyms":["angler","fisherman"],"antonyms":[]}],"etymology":{"value":"Izaak Walton (1593–1683), an English writer best known for 'The Compleat Angler' (1653), + -ian.","priority":"★★★"},"pronunciation":{"ipa":"/wɔːlˈtoʊniən/","syllables":"Wal-ton-i-an"},"inflection":{"noun_plural":"Waltonians"},"usage_notes":{"explanation":"The term \"Waltonian\" is primarily associated with Izaak Walton's book 'The Compleat Angler,' which celebrates the art of fishing, the beauty of nature, and a contemplative, peaceful lifestyle. It often implies a gentle, patient, and appreciative approach to angling and the natural world.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a Waltonian experience at the museum.","correct":"✓ He had a peaceful and reflective experience at the museum.","note":"'Waltonian' is specifically related to Izaak Walton and his association with fishing and nature. Using it in a general sense of peacefulness is incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["Walton (proper noun)","Compleat Angler (proper noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Waltonian' is a relatively uncommon word that specifically refers to Izaak Walton, the author of 'The Compleat Angler,' or to things associated with him, such as a love of fishing and nature. It implies a peaceful, contemplative approach to these activities. Due to its specific reference, it's not a word used in everyday conversation but is more likely to appear in literature or discussions about angling and nature writing."},"example_sentences":[{"sentence":"The old man possessed a Waltonian serenity as he cast his line into the river.","translation":"その老人は、川に糸を垂らすとき、ウォルトンのような静けさを持っていた。","type":"adjective","meaning_category":"Izaak Waltonに関連する"},{"sentence":"As a true Waltonian, she always released the fish she caught back into the water.","translation":"真のウォルトン主義者として、彼女はいつも釣った魚を水に返した。","type":"noun","meaning_category":"Izaak Waltonを尊敬する人"}]}