{"word":"estrogen-independent","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"エストロゲン非依存性の","english_definition":"Not requiring estrogen for growth or survival.","examples":[{"sentence":"This cell line is estrogen-independent.","translation":"この細胞株はエストロゲン非依存性です。"},{"sentence":"The tumor was found to be estrogen-independent, making hormone therapy less effective.","translation":"その腫瘍はエストロゲン非依存性であることが判明し、ホルモン療法は効果が低いと考えられます。"}],"collocations":["estrogen-independent cell line","estrogen-independent tumor","estrogen-independent growth"],"synonyms":["hormone-independent"],"antonyms":["estrogen-dependent"],"notes":"Used primarily in medical and biological contexts, particularly in discussions of cancer."}],"etymology":{"value":"Formed from 'estrogen' + 'independent'.","priority":"Low"},"pronunciation":{"ipa":"/ˈɛstrədʒən ɪndɪˈpɛndənt/","syllables":"es-tro-gen in-de-pen-dent"},"inflection":{},"usage_notes":{"explanation":"This term is used to describe cells or tissues that do not rely on estrogen for their proliferation or survival. It is particularly relevant in the context of breast cancer, where some tumors are estrogen-dependent (their growth is stimulated by estrogen) and others are estrogen-independent (their growth is not affected by estrogen). Estrogen-independent cancers may not respond to hormone therapies that target estrogen signaling.","priority":"Medium"},"common_mistakes":{},"related_words":{"derivatives":["estrogen","independent","estrogen-dependent"],"related_terms":["hormone receptor","hormone therapy","endocrine therapy"]},"level_frequency":{"priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'estrogen-independent' is a technical term used in biology and medicine, specifically in the context of cancer research and treatment. It describes cells or tumors that do not require estrogen to grow. Understanding this term requires a basic knowledge of biology and hormonal signaling."},"example_sentences":[{"sentence":"The researchers investigated the mechanisms of estrogen-independent growth in breast cancer cells.","translation":"研究者たちは、乳がん細胞におけるエストロゲン非依存性増殖のメカニズムを調査しました。","type":"scientific","meaning_category":"biology/medicine"},{"sentence":"Patients with estrogen-independent tumors may require different treatment strategies.","translation":"エストロゲン非依存性腫瘍の患者は、異なる治療戦略を必要とする場合があります。","type":"medical","meaning_category":"clinical oncology"}]}