{"word":"Ordovician","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"オルドビス紀","english_definition":"The second period of the Paleozoic Era, lasting from approximately 485.4 to 443.8 million years ago.","examples":[{"sentence":"The Ordovician Period was characterized by a great diversification of marine invertebrates.","translation":"オルドビス紀は、海洋無脊椎動物の大規模な多様化を特徴としていました。"}],"collocations":["Ordovician Period","Late Ordovician","Early Ordovician"],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"オルドビス紀の","english_definition":"Relating to the Ordovician Period.","examples":[{"sentence":"Ordovician rocks are found in many parts of the world.","translation":"オルドビス紀の岩石は世界の多くの地域で発見されています。"},{"sentence":"The Ordovician extinction event was one of the largest in Earth's history.","translation":"オルドビス紀の大量絶滅は、地球の歴史の中で最大規模のものの1つでした。"}],"collocations":["Ordovician rocks","Ordovician extinction","Ordovician fauna"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after the Ordovices, an ancient Celtic tribe in Wales, where rocks from this period were first studied.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɔːrdəˈvɪʃən/","syllables":"Or-do-vi-cian"},"inflection":{"notes":"The noun is invariable. The adjective does not inflect."},"usage_notes":{"explanation":"'Ordovician' refers to a specific geological period and is used in scientific contexts, particularly in geology, paleontology, and evolutionary biology. It's often used to describe rock formations, fossils, and events that occurred during that time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ordovician era.","correct":"✓ The Ordovician Period.","note":"It's more common and scientifically accurate to refer to it as the 'Ordovician Period' rather than 'Ordovician era'."}],"priority":"★★☆"},"related_words":{"derivatives":["Ordovicium (alternative spelling, especially in some European languages)"],"phrases":["Ordovician-Silurian extinction event"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, mainly used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ordovician' is a technical term used in geology and paleontology to refer to a specific period in Earth's history. It is not a commonly used word outside of these scientific fields. Understanding the term requires knowledge of the geological timescale and the history of life on Earth."},"example_sentences":[{"sentence":"Fossils from the **Ordovician** period provide valuable insights into the early evolution of marine life.","translation":"オルドビス紀の化石は、海洋生物の初期の進化に関する貴重な洞察を提供します。","type":"noun","meaning_category":"geological period"},{"sentence":"The **Ordovician** extinction event had a significant impact on the biodiversity of the planet.","translation":"オルドビス紀の大量絶滅は、地球の生物多様性に大きな影響を与えました。","type":"adjective","meaning_category":"geological period"},{"sentence":"**Ordovician** sedimentary rocks are often rich in fossils.","translation":"オルドビス紀の堆積岩は、しばしば化石が豊富です。","type":"adjective","meaning_category":"geological period"}]}