{"word":"solicitedly","priority":"Low","meanings":[{"part_of_speech":"adverb","definition":"In a manner that shows excessive or intrusive concern; in a way that involves asking for something (such as advice or help) that is not wanted or needed.","english_definition":"In a manner that shows excessive or intrusive concern; in a way that involves asking for something (such as advice or help) that is not wanted or needed.","examples":[{"sentence":"She asked solicitedly if he was feeling alright, even though he had already said he was fine.","translation":"彼は大丈夫だと言ったのに、彼女はしつこく彼の体調を尋ねた。"},{"sentence":"He offered his opinion solicitedly, even though no one had asked for it.","translation":"誰も頼んでいないのに、彼は余計な意見を述べた。"}],"collocations":["asked solicitedly","offered solicitedly","inquired solicitedly"],"synonyms":["intrusively","officiously","meddlesomely","importunately","obtrusively"],"antonyms":["unobtrusively","discreetly","reservedly","unsolicitedly"]}],"etymology":{"value":"Derived from the adjective 'solicited' (asked for or requested) with the addition of the adverbial suffix '-ly'. 'Solicited' comes from the Latin 'sollicitare' meaning 'to disturb, agitate, or entice'.","priority":"Medium"},"pronunciation":{"ipa":"/səˈlɪsɪtɪdli/","syllables":"so-lic-it-ed-ly"},"inflection":{"notes":"Adverb; does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Solicitedly' describes actions or behaviors that involve unwanted or excessive attention, concern, or requests. It often implies a lack of tact or awareness of boundaries. It is the opposite of 'unsolicitedly', which means without being asked for.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He helped her solicitedly.","correct":"He helped her officiously. / He offered his help solicitedly.","note":"'Solicitedly' typically modifies verbs related to asking, offering, or inquiring, rather than general actions like helping. It describes *how* the action is done, not the action itself."}],"priority":"Low"},"related_words":{"derivatives":["solicit (verb): to ask for or try to obtain something from someone.","solicitation (noun): the act of asking for or trying to obtain something from someone.","solicited (adjective): asked for or requested.","unsolicited (adjective): not asked for; given or done voluntarily."],"phrasal_verbs":[],"priority":"Medium"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Solicitedly' is a relatively rare adverb that describes behavior characterized by excessive or unwanted asking, offering, or concern. It implies an intrusive or officious manner. Because of its low frequency and nuanced meaning, it is typically encountered in advanced or formal contexts. Understanding the root verb 'solicit' (to ask for) is helpful in grasping the meaning of 'solicitedly'."},"example_sentences":[{"sentence":"She inquired solicitedly about his health, making him uncomfortable.","translation":"彼女は彼の健康状態をしつこく尋ね、彼を不快にさせた。","type":"adverb","meaning_category":"Excessive concern"},{"sentence":"He offered his advice solicitedly, even though it was clear no one wanted it.","translation":"誰も求めていないのは明らかだったが、彼は余計なアドバイスをした。","type":"adverb","meaning_category":"Unwanted offering"}]}