{"word":"Mid-Renaissance","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"盛期ルネサンス","english_definition":"The High Renaissance, a brief period of exceptional artistic production in the different Italian states, particularly Rome, Florence, and Venice, during the late 15th and early 16th centuries.","examples":[{"sentence":"The Mid-Renaissance saw the creation of some of the world's most famous artworks.","translation":"盛期ルネサンスには、世界で最も有名な芸術作品のいくつかが制作されました。"},{"sentence":"Leonardo da Vinci and Michelangelo were key figures of the Mid-Renaissance.","translation":"レオナルド・ダ・ヴィンチとミケランジェロは、盛期ルネサンスの主要人物でした。"}],"collocations":["High Renaissance art","Italian Renaissance","Renaissance period"],"synonyms":["High Renaissance"],"antonyms":["Early Renaissance","Late Renaissance"]}],"etymology":{"value":"A compound word combining \"Mid\" referring to the middle or peak, and \"Renaissance\" referring to the cultural and artistic rebirth in Europe.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɪd ˈrɛnəˌsɑːns/","syllables":"Mid-Re-nais-sance"},"related_words":{"derivatives":["Renaissance","Early Renaissance","Late Renaissance","Renaissance art","Renaissance architecture"],"related_terms":["Humanism","Medici","Florence","Rome","Venice"]},"usage_notes":{"explanation":"The term \"Mid-Renaissance\" is often used interchangeably with \"High Renaissance.\" It denotes the peak of the Renaissance period, characterized by a flourishing of art, culture, and intellectual pursuits. It is specifically associated with the artistic achievements in Italy during the late 15th and early 16th centuries.","priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent, more common in academic or art historical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term \"Mid-Renaissance\" refers to a specific period in European history, particularly the peak of the Renaissance in Italy during the late 15th and early 16th centuries. It is a term often used in art history and academic contexts to describe the artistic and cultural achievements of that time. Understanding this term requires some knowledge of European history and art history."},"example_sentences":[{"sentence":"The **Mid-Renaissance** was a time of great artistic innovation.","translation":"盛期ルネサンスは、芸術的な革新の時代でした。","type":"noun","meaning_category":"historical period"},{"sentence":"Many masterpieces were created during the **Mid-Renaissance**.","translation":"多くの傑作が盛期ルネサンスに制作されました。","type":"noun","meaning_category":"historical period"},{"sentence":"The **Mid-Renaissance** is known for its emphasis on humanism and classical ideals.","translation":"盛期ルネサンスは、ヒューマニズムと古典的な理想の重視で知られています。","type":"noun","meaning_category":"historical period"}]}