{"word":"qadar","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"運命、宿命 (イスラム教における概念)","english_definition":"Destiny or divine decree in Islam; the concept that everything that happens is predetermined by God.","examples":[{"sentence":"Qadar is one of the six articles of faith in Islam.","translation":"カダル（運命）はイスラム教の六信五行の一つです。"},{"sentence":"Muslims believe that both good and bad events are part of God's qadar.","translation":"イスラム教徒は、良いことも悪いことも神の定めたカダルの一部であると信じています。"},{"sentence":"Accepting qadar can bring peace of mind in difficult times.","translation":"カダルを受け入れることは、困難な時に心の平安をもたらすことがあります。"}],"collocations":["believe in qadar (カダルを信じる)","part of qadar (カダルの一部)","accept qadar (カダルを受け入れる)","divine qadar (神の定めたカダル)"],"synonyms":["destiny","fate","predestination","divine decree","divine will"],"antonyms":["free will (自由意志)","choice (選択)"],"cultural_note":"Qadar is a central concept in Islamic theology. It is related to, but distinct from, the concept of divine will (mashi'ah). The interplay between qadar and human agency is a complex theological issue."}],"etymology":{"value":"From the Arabic word قَدَر (qadar) meaning 'decree, destiny, power, ability, value'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɑːdɑːr/","syllables":"qa-dar"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"The term 'qadar' is specifically used within the context of Islamic belief. It refers to the divine preordainment of all events. It is often discussed in relation to free will and human responsibility.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Qadar is the same as luck.","correct":"✓ Qadar is the divine decree of God.","note":"Qadar is not simply luck; it is the belief that God has predetermined everything. It is a core theological concept."}],"priority":"★★★"},"related_words":{"derivatives":["muqaddar (destined, fated)"],"related_concepts":["Tawhid (Oneness of God)","Risalah (Prophethood)","Akhirah (Afterlife)","Iman (Faith)","Malaikah (Angels)","Mashi'ah (Divine Will)"],"priority":"★★☆"},"level_frequency":{"frequency_corpus":"Low (specific to religious contexts)","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Qadar' is a theological term specific to Islam, referring to the concept of divine preordainment or destiny. Understanding this term requires familiarity with Islamic beliefs and theological discussions. It is not a commonly used word outside of this context."},"example_sentences":[{"sentence":"Belief in qadar requires accepting that God's knowledge encompasses all things.","translation":"カダルを信じるには、神の知識がすべてを網羅していることを受け入れる必要があります。","type":"general","meaning_category":"Islamic Theology"},{"sentence":"Some Muslims find comfort in the concept of qadar during times of hardship.","translation":"イスラム教徒の中には、苦難の時にカダルの概念に慰めを見出す人もいます。","type":"general","meaning_category":"Islamic Theology"},{"sentence":"The debate about free will and qadar is a complex one in Islamic thought.","translation":"自由意志とカダルに関する議論は、イスラム思想において複雑なものです。","type":"theological","meaning_category":"Islamic Theology"}]}