{"word":"Endometriosis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"子宮内膜症","english_definition":"A condition resulting from the appearance of endometrial tissue outside the uterus and causing pelvic pain, especially associated with menstruation.","examples":[{"sentence":"Endometriosis can cause severe pain and infertility.","translation":"子宮内膜症は、激しい痛みや不妊症を引き起こす可能性があります。"},{"sentence":"She was diagnosed with endometriosis after experiencing chronic pelvic pain.","translation":"彼女は慢性的な骨盤痛を経験した後、子宮内膜症と診断されました。"}],"collocations":["treat endometriosis (子宮内膜症を治療する)","diagnose endometriosis (子宮内膜症を診断する)","symptoms of endometriosis (子宮内膜症の症状)","severe endometriosis (重度の内膜症)"],"synonyms":["none"],"antonyms":["none"]}],"etymology":{"value":"Derived from 'endometrium' (the mucous membrane lining the uterus) and '-osis' (denoting a condition or disease).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛndoʊˌmiːtriˈoʊsɪs/","syllables":"en-do-me-tri-o-sis"},"inflection":{"noun_plural":"Endometrioses (rarely used)"},"usage_notes":{"explanation":"Endometriosis is a medical term referring to a specific condition. It's important to use the term accurately in medical contexts or when discussing health issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have endometriosis in my stomach.","correct":"✓ I have endometriosis.","note":"Endometriosis is the condition itself. It's not typically described as being 'in' a specific organ other than generally referring to the pelvic region. The location of the endometrial tissue outside the uterus is specified in medical reports. "},{"incorrect":"✗ Endometriosis is a type of cancer.","correct":"✓ Endometriosis is a condition where tissue similar to the lining of the uterus grows outside of it.","note":"Endometriosis is not a form of cancer, though it can cause significant health problems."}],"priority":"★★☆"},"related_words":{"derivatives":["endometrium (子宮内膜)","endometrial (子宮内膜の)"],"phrasal_verbs":["none"],"priority":"★★★"},"level_frequency":{"CEFR":"B2-C1 (specialized medical vocabulary)","frequency_google_ngram":"Relatively low frequency, specific to medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Endometriosis' is a specialized medical term that describes a condition where tissue similar to the lining of the uterus grows outside of it. This can lead to pain, infertility, and other complications. Because it is a medical term, it is typically used in healthcare settings or when discussing specific health conditions. Understanding this term requires some familiarity with medical terminology related to the female reproductive system."},"example_sentences":[{"sentence":"The doctor explained the treatment options for her **endometriosis**.","translation":"医師は彼女の子宮内膜症の治療選択肢について説明しました。","type":"noun","meaning_category":"medical condition"},{"sentence":"Many women experience pain related to their **endometriosis**.","translation":"多くの女性が子宮内膜症に関連した痛みを経験しています。","type":"noun","meaning_category":"medical condition"},{"sentence":"Surgery is sometimes necessary to remove the endometrial tissue caused by **endometriosis**.","translation":"子宮内膜症によって引き起こされた子宮内膜組織を除去するために、手術が必要になることがあります。","type":"noun","meaning_category":"medical condition"}]}