{"word":"pontificality","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"尊大さ、権威主義、教皇のような態度","english_definition":"the quality of being pompous and dogmatic; a display of excessive self-importance or authority.","examples":[{"sentence":"His pontificality made it difficult to have a genuine conversation with him.","translation":"彼の尊大な態度のため、彼と心からの会話をすることが難しかった。"},{"sentence":"The speaker's pontificality alienated many in the audience.","translation":"講演者の権威主義的な態度は、聴衆の多くを遠ざけた。"},{"sentence":"She delivered her opinion with such pontificality that no one dared to disagree.","translation":"彼女はあまりにも尊大な態度で意見を述べたので、誰も反対する勇気がなかった。"}],"collocations":["display of pontificality","air of pontificality","tone of pontificality"],"synonyms":["pompousness","dogmatism","authoritarianism","arrogance","sanctimoniousness","pretension","grandiosity"],"antonyms":["humility","modesty","simplicity","unpretentiousness"]}],"etymology":{"value":"Derived from 'pontifical,' meaning relating to a pontiff (especially the Pope) or characterized by a pompous and dogmatic manner. 'Pontifical' comes from Latin 'pontificalis,' from 'pontifex,' meaning 'high priest.' The suffix '-ity' denotes a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒntɪfɪˈkælɪti/","syllables":"pon-tif-i-cal-i-ty"},"inflection":{"noun_plural":"pontificalities"},"usage_notes":{"explanation":"'Pontificality' describes behavior or speech that is excessively formal, self-important, and often moralizing, reminiscent of the pronouncements of a high-ranking religious figure. It implies a sense of superiority and an unwillingness to consider other viewpoints. It's often used in a critical or satirical way.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed pontificality to the poor.","correct":"✓ He showed pontificality in his dealings with the poor.","note":"'Pontificality' is a quality or manner, so it's shown *in* one's actions or words, not *to* someone. The preposition 'in' is more appropriate here."},{"incorrect":"✗ The pontificality was very nice.","correct":"✓ His humility was very nice.","note":"'Pontificality' is generally considered a negative trait, so describing it as 'nice' is usually inappropriate. Consider using an antonym like 'humility' or 'modesty' if you want to express a positive sentiment."}],"priority":"★★☆"},"related_words":{"derivatives":["pontifical (adjective)","pontifically (adverb)"],"related_words":["pope","pontiff","dogmatic","pompous","authoritarian"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pontificality' is a formal word used to describe someone's behavior or speech when they act in a very pompous, self-important, and often moralizing way, as if they are speaking from a position of great authority. It suggests an air of superiority and a lack of openness to other people's ideas. Because of its formal nature and specific meaning, it is not a commonly used word and is more likely to be encountered in academic or literary contexts."},"example_sentences":[{"sentence":"The professor's lecture was marred by his pontificality, which made it difficult for students to engage with the material.","translation":"教授の講義は彼の尊大な態度によって損なわれ、学生が教材に関わることが困難になった。","type":"noun","meaning_category":"尊大さ、権威主義"},{"sentence":"She recognized the pontificality in her own pronouncements and tried to adopt a more humble tone.","translation":"彼女は自身の発言における尊大さに気づき、より謙虚な口調を採用しようとした。","type":"noun","meaning_category":"尊大さ、権威主義"},{"sentence":"The politician's pontificality during the debate turned off many potential voters.","translation":"討論中の政治家の尊大な態度は、多くの潜在的な有権者を遠ざけた。","type":"noun","meaning_category":"尊大さ、権威主義"}]}