{"word":"quasi-bravely","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"いくらか勇敢に、ほとんど勇敢に、勇敢であるかのように","english_definition":"In a manner that is somewhat brave; in a way that resembles bravery; seemingly brave.","examples":[{"sentence":"He quasi-bravely stepped forward, his voice trembling slightly.","translation":"彼はいくらか勇敢に前に出たが、声は少し震えていた。"},{"sentence":"She quasi-bravely faced the challenge, though she was terrified inside.","translation":"彼女は内心では恐ろしかったが、勇敢であるかのようにその挑戦に立ち向かった。"}],"collocations":["act quasi-bravely","speak quasi-bravely","behave quasi-bravely"],"synonyms":["somewhat bravely","seemingly bravely","apparently bravely","ostensibly bravely"],"antonyms":["cowardly","fearfully","timidly"]}],"etymology":{"value":"The word is formed by combining \"quasi-\" (meaning \"resembling\" or \"seemingly\") with \"bravely\" (meaning \"in a brave manner\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪˈbreɪvli/","syllables":"qua-si-brave-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Quasi-bravely\" suggests an action or behavior that appears brave on the surface but may lack genuine courage or conviction. It implies a degree of pretense or imitation in the display of bravery. The action might be hesitant, forced, or motivated by something other than true courage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted very quasi-bravely.","correct":"✓ He acted quasi-bravely.","note":"The word 'very' is redundant because 'quasi-' already implies a degree of approximation or resemblance. It's better to use 'very bravely' if you want to emphasize the bravery. "},{"incorrect":"✗ She quasi bravely ran away.","correct":"✓ She quasi-bravely faced the danger.","note":"The adverb 'quasi-bravely' is best used with actions that are typically associated with bravery, such as facing a danger, speaking out against injustice, or making a difficult decision. Running away is generally the opposite of bravery."}],"priority":"★☆☆"},"related_words":{"derivatives":["quasi (adverb, adjective)","bravely (adverb)","brave (adjective)","bravery (noun)"],"antonyms":["cowardly","fearfully","timidly"],"related_terms":["half-heartedly","reluctantly","hesitantly"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency - not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Quasi-bravely\" is a relatively rare and sophisticated adverb. It describes an action that seems brave but might not be truly so. It suggests a superficial or incomplete display of courage. Understanding this word requires a good grasp of the prefix \"quasi-\" and the concept of bravery."},"example_sentences":[{"sentence":"He quasi-bravely offered his opinion, but quickly backtracked when challenged.","translation":"彼はいくらか勇敢に意見を述べたが、反論されるとすぐに撤回した。","type":"adverb","meaning_category":"Somewhat brave"},{"sentence":"The politician quasi-bravely addressed the controversial issue, avoiding any real commitment.","translation":"その政治家は勇敢であるかのようにその論争の的となる問題を取り上げたが、具体的な約束は避けた。","type":"adverb","meaning_category":"Seemingly brave"}]}