{"word":"laetrile","priority":"低","meanings":[{"part_of_speech":"noun","definition":"レートリル：アミグダリン（バラ科植物の種子に含まれる天然化合物）を原料とする、がんの代替療法として用いられた物質。科学的な有効性は証明されていない。","english_definition":"Laetrile is a semi-synthetic derivative of amygdalin, a naturally occurring compound found in the seeds of many fruits, especially apricots. It has been promoted as an alternative cancer treatment, but its effectiveness has not been scientifically proven.","examples":[{"sentence":"Laetrile was once a popular alternative cancer treatment, but it is now largely discredited.","translation":"レートリルはかつて人気のある代替がん治療法でしたが、現在ではほとんど信用されていません。"},{"sentence":"The use of laetrile is controversial due to its lack of proven effectiveness and potential toxicity.","translation":"レートリルの使用は、その有効性が証明されていないことと、潜在的な毒性があるため、議論の的となっています。"}],"collocations":["laetrile treatment","laetrile therapy","laetrile injection"],"synonyms":["amygdalin","vitamin B17"],"antonyms":[]}],"etymology":{"value":"'Laetrile'という名前は、'laevo-'（左旋性の異性体を示す接頭辞）と'mandelonitrile'（アミグダリンの化学構造の一部）を組み合わせた造語である。","priority":"中"},"pronunciation":{"ipa":"/ˈleɪəˌtriːl/","syllables":"lae-trile"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"レートリルは、アミグダリンという化合物から作られる物質で、かつてはがんの代替療法として用いられました。しかし、科学的な研究によって有効性が証明されておらず、シアン化水素を生成する可能性があるため、多くの国で使用が禁止または制限されています。がん治療の選択肢として検討されることはほとんどありません。","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"Laetrile is a proven cure for cancer.","correct":"Laetrile has not been proven to be an effective cure for cancer.","note":"レートリルは、がんの治療法として科学的に証明されていません。"},{"incorrect":"Laetrile is completely safe to use.","correct":"Laetrile carries potential health risks due to the release of cyanide.","note":"レートリルは、シアン化水素を生成する可能性があるため、完全に安全とは言えません。"}],"priority":"高"},"related_words":{"derivatives":["amygdalin","cyanide"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"C2","text":"「レートリル」は、一般的にはあまり知られていない専門用語です。これは、アミグダリンという物質から作られた化合物で、かつてがんの代替療法として使われましたが、科学的な証拠がないため、現在ではほとんど使われていません。また、シアン化水素を生成する可能性があるため、安全性にも懸念があります。医学や薬学の分野に関心がある人以外は、特に知っておく必要はないでしょう。"},"example_sentences":[{"sentence":"The patient inquired about laetrile as a possible treatment option.","translation":"患者は、可能な治療選択肢としてレートリルについて問い合わせました。","type":"noun","meaning_category":"代替がん治療"},{"sentence":"Studies have shown that laetrile is not an effective cancer treatment.","translation":"研究により、レートリルは効果的ながん治療ではないことが示されています。","type":"noun","meaning_category":"代替がん治療"}]}