{"word":"forleave","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(古語)完全に手放す、放棄する、許す","english_definition":"(archaic) to give up entirely; to abandon; to forgive.","examples":[{"sentence":"He forleaveth all his sins.","translation":"彼はすべての罪を許す。（古語的な表現）"},{"sentence":"I forleave my claim to the throne.","translation":"私は王位への主張を放棄する。（古語的な表現）"}],"collocations":["forleave all sins (すべての罪を許す)","forleave a claim (主張を放棄する)"],"synonyms":["abandon","relinquish","forgive","pardon","forsake"],"antonyms":["retain","keep","hold","cherish"]}],"etymology":{"value":"古英語の「forlǣfan」に由来し、「完全に手放す、放棄する、許す」という意味を持つ。「for-」（完全に、徹底的に）と「lǣfan」（残す、許可する、手放す）の組み合わせ。現代英語の「leave」と語源的に関連がある。","priority":"★★☆"},"pronunciation":{"ipa":"/fɔːrˈliːv/","syllables":"for-leave"},"inflection":{"verb_forms":{"present_simple":["forleave","forleaves"],"past_simple":"forleft","past_participle":"forleft","present_participle":"forleaving"}},"usage_notes":{"explanation":"「**forleave**」は古語であり、現代英語ではほとんど使われません。現代英語では、「abandon」、「relinquish」、「forgive」などの単語が同様の意味を表すために用いられます。文学作品や歴史的な文書で見られることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I will forleave you my car.","correct":"✓ I will leave you my car.","note":"現代英語では「forleave」の代わりに「leave」を使うのが一般的です。"},{"incorrect":"✗ He forleaves his job every day.","correct":"✓ He quits his job every day. / ✓ He leaves his job every day.","note":"「forleave」は日常的な状況では不自然です。「quit」または「leave」を使用します。"}],"priority":"★★☆"},"related_words":{"derivatives":["leave (現代英語の「去る」「残す」「許可する」)","forsake (見捨てる、放棄する - 意味が近い)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (現代英語ではほとんど使用されない)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 古語のため、現代のテキストではほとんど見られない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**forleave**」は古語であり、現代英語ではほとんど使われません。そのため、現代英語を学習する際には特に覚える必要はありません。古い文献を読む際に遭遇する可能性がありますが、意味は文脈から推測できるでしょう。現代英語では、同様の意味を表す「abandon」、「relinquish」、「forgive」などの単語を使用します。"},"example_sentences":[{"sentence":"(古語) He that believeth on him is not condemned: but he that believeth not is condemned already, because he hath not believed in the name of the only begotten Son of God. And this is the condemnation, that light is come into the world, and men loved darkness rather than light, because their deeds were evil. For every one that doeth evil hateth the light, neither cometh to the light, lest his deeds should be reproved. But he that doeth truth cometh to the light, that his deeds may be made manifest, that they are wrought in God. After these things came Jesus and his disciples into the land of Judaea; and there he tarried with them, and baptized. And John also was baptizing in Aenon near to Salim, because there was much water there: and they came, and were baptized. For John was not yet cast into prison. Then there arose a question between some of John's disciples and the Jews about purifying. And they came unto John, and said unto him, Rabbi, he that was with thee beyond Jordan, to whom thou barest witness, behold, the same baptizeth, and all men come to him. John answered and said, A man can receive nothing, except it be given him from heaven. Ye yourselves bear me witness, that I said, I am not the Christ, but that I am sent before him. He that hath the bride is the bridegroom: but the friend of the bridegroom, which standeth and heareth him, rejoiceth greatly because of the bridegroom's voice: this my joy therefore is fulfilled. He must increase, but I must decrease. He that cometh from above is above all: he that is of the earth is earthly, and speaketh of the earth: he that cometh from heaven is above all. And what he hath seen and heard, that he testifieth; and no man receiveth his testimony. He that hath received his testimony hath set to his seal that God is true. For he whom God hath sent speaketh the words of God: for God giveth not the Spirit by measure unto him. The Father loveth the Son, and hath given all things into his hand. He that believeth on the Son hath everlasting life: and he that believeth not the Son shall not see life; but the wrath of God abideth on him. (John 3:18-36 KJV)","translation":"(古語) 彼を信じる者は裁かれない。しかし、信じない者はすでに裁かれている。それは、神のひとり子を信じなかったからである。その裁きとは、光が世に来たのに、人々はその行いが悪いために、光よりも闇を愛したことである。悪を行う者は皆、光を憎み、その行いが明らかにされるのを恐れて、光に近づかない。しかし、真理を行う者は光に近づく。それは、その行いが神においてなされたことを明らかにするためである。これらの後、イエスとその弟子たちはユダヤの地に入り、そこで彼らと共に滞在し、バプテスマを授けた。ヨハネもまた、サリムに近いエノンでバプテスマを授けていた。そこには水が多かったからである。人々は来て、バプテスマを受けた。ヨハネはまだ投獄されていなかった。さて、ヨハネの弟子たちとユダヤ人との間に、清めに関する論争が起こった。彼らはヨハネのところに来て言った。「先生、ヨルダン川の向こうであなたと一緒にいた、あなたが証ししたあの人が、今バプテスマを授けており、皆が彼のところに行っています。」ヨハネは答えて言った。「人が天から与えられなければ、何も受けることはできない。私がキリストではなく、その前に遣わされた者であると、私が言ったことについて、あなたがた自身が私の証人である。花嫁を持つ者は花婿である。しかし、花婿の友は、そばに立って花婿の声を聞き、花婿の声を聞いて大いに喜ぶ。それゆえ、この私の喜びは満たされている。彼は増えなければならない。しかし、私は減らなければならない。上から来る者はすべてにまさる。地から出る者は地に属し、地のことを語る。天から来る者はすべてにまさる。彼が見聞きしたことを証しするが、彼の証しを受け入れる者はいない。彼の証しを受け入れた者は、神が真実であることを証印した。神が遣わした者は神の言葉を語る。神は霊を測って与えるのではない。父は子を愛し、すべてのものをその手に委ねられた。子を信じる者は永遠の命を持つ。しかし、子を信じない者は命を見ることができず、神の怒りがその上にとどまる。」","type":"verb (vt)","meaning_category":"(古語)放棄する、許す"}]}