{"word":"crotalism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(病理)妄想的に自分の陰茎が蛇であると信じる精神疾患","english_definition":"(pathology) A mental disorder in which the sufferer has the delusion that their penis is a snake.","examples":[{"sentence":"Crotalism is a rare but documented psychiatric condition.","translation":"クロタリズムはまれですが、記録されている精神医学的疾患です。"},{"sentence":"The patient presented with symptoms consistent with crotalism.","translation":"患者はクロタリズムと一致する症状を呈しました。"}],"collocations":["rare mental disorder","psychiatric condition","delusional disorder"],"synonyms":["penile zoanthropy"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'krotalon' (κρόταλον), meaning 'rattle' or 'castanet', referring to the snake-like appearance or movement the sufferer imagines.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɒtəlɪzəm/","syllables":"cro-tal-ism"},"inflection":{"noun_plural":"crotalisms"},"usage_notes":{"explanation":"Crotalism is a very rare and specific delusion, primarily encountered in clinical psychiatric settings. It is not a commonly known or discussed condition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was diagnosed with crotalism after a snake bite.","correct":"✓ He was diagnosed with crotalism, a delusional disorder.","note":"Crotalism is a mental disorder, not a physical condition caused by a snake bite."}],"priority":"★★☆"},"related_words":{"derivatives":["crotalic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare, not in standard language learning resources)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Crotalism' is a highly specialized term primarily used in the fields of psychiatry and clinical psychology. Understanding it requires familiarity with medical terminology and an understanding of delusional disorders. Due to its rarity and specific context, it is not generally encountered in everyday language or standard educational materials."},"example_sentences":[{"sentence":"The case study described a patient experiencing severe anxiety due to crotalism.","translation":"その症例研究では、クロタリズムのために重度の不安を経験している患者について説明しています。","type":"noun","meaning_category":"mental disorder"},{"sentence":"Crotalism, though uncommon, highlights the diverse manifestations of delusional beliefs.","translation":"クロタリズムは一般的ではありませんが、妄想的な信念の多様な現れを強調しています。","type":"noun","meaning_category":"mental disorder"}]}