{"word":"Notionalist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学) 概念実在論者、名目論者","english_definition":"A proponent of notionalism, a philosophical doctrine that universals are merely concepts existing only in the mind and without any reality outside of it.","examples":[{"sentence":"As a notionalist, he believed that abstract concepts like justice and beauty are simply mental constructs.","translation":"概念実在論者として、彼は正義や美といった抽象的な概念は単なる精神的な構築物であると信じていた。"}],"collocations":["philosophical notionalist","strict notionalist"],"synonyms":["conceptualist","nominalist"],"antonyms":["realist","platonist"]}],"etymology":{"value":"The term 'notionalist' is derived from 'notion,' referring to a concept or idea. It reflects the belief that universals are merely mental notions rather than existing realities.","priority":"★★★"},"pronunciation":{"ipa":"/ˈnoʊʃənəlɪst/","syllables":"no-tion-al-ist"},"inflection":{"noun_plural":"Notionalists"},"usage_notes":{"explanation":"'Notionalist' is primarily used in philosophical contexts to describe someone who adheres to notionalism. It is often contrasted with 'realist' or 'platonist,' who believe that universals have an independent existence. The term is relatively uncommon outside of academic discussions on metaphysics and philosophy of language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a notionalist artist, focusing on abstract forms.","correct":"✓ He is an abstract artist, focusing on non-representational forms.","note":"'Notionalist' refers to a philosophical position, not an artistic style. Use 'abstract artist' or similar terms to describe art that focuses on non-representational forms."}],"priority":"★★☆"},"related_words":{"derivatives":["notionalism (名詞: 概念実在論)","notion (名詞: 概念、考え)","notional (形容詞: 概念的な、想像上の)"],"related_terms":["nominalism (名詞: 名目論)","conceptualism (名詞: 概念主義)","realism (名詞: 実在論)","Platonism (名詞: プラトン主義)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 哲学分野に限定される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Notionalist' is a term used in philosophy to describe someone who believes that universal concepts only exist as ideas in the mind and do not have any real existence outside of it. This idea is called notionalism. It's a complex philosophical concept, so the word is mostly used in advanced discussions about philosophy.","priority":"★★☆"},"example_sentences":[{"sentence":"The medieval philosopher Roscelin is often considered an early notionalist.","translation":"中世の哲学者ロスケリヌスは、しばしば初期の概念実在論者と見なされる。","type":"noun","meaning_category":"哲学"},{"sentence":"As a notionalist, she argued that the concept of 'justice' is a social construct.","translation":"概念実在論者として、彼女は「正義」という概念は社会的な構築物であると主張した。","type":"noun","meaning_category":"哲学"},{"sentence":"The debate between notionalists and realists has been central to the philosophy of universals.","translation":"概念実在論者と実在論者の間の議論は、普遍性の哲学の中心となってきた。","type":"noun","meaning_category":"哲学"}]}