{"word":"doni","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(主にインドネシアで使われる)寄付、献金","english_definition":"(Primarily used in Indonesia) A donation or contribution, often for charitable purposes.","examples":[{"sentence":"Kami mengumpulkan doni untuk korban bencana alam.","translation":"We are collecting donations for the victims of the natural disaster.","note":"Indonesian sentence."},{"sentence":"Dia memberikan doni yang besar kepada yayasan tersebut.","translation":"He gave a large donation to the foundation.","note":"Indonesian sentence."}],"collocations":["memberi doni (to give a donation)","mengumpulkan doni (to collect donations)","menerima doni (to receive donations)"],"synonyms":["sumbangan (Indonesian)","contribution","donation","offering"],"antonyms":["N/A"]}],"etymology":{"value":"The word 'doni' is likely derived from or related to words in Indonesian or other Southeast Asian languages signifying 'donation' or 'contribution'. Further research is needed for a definitive etymology.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈdo.ni/","syllables":"do-ni"},"inflection":{"notes":"The word 'doni' is a noun and does not typically inflect for pluralization in Indonesian. However, context may sometimes dictate the use of reduplication for emphasis."},"usage_notes":{"explanation":"The word 'doni' is primarily used in Indonesian-speaking contexts to refer to a donation or contribution, often made to a charitable organization or for a specific cause. While the word may be understood in other regions, it is not a standard English term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He made a doni to the museum.","correct":"✓ He made a donation to the museum.","note":"In English, use 'donation' instead of 'doni'."}],"priority":"★☆☆"},"related_words":{"derivatives":["pendoni (Indonesian: donor)"],"phrasal_verbs":["N/A"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency in general English corpora; more common in Indonesian texts.","priority":"★☆☆"},"readability_explanation":{"level":"N/A","text":"'Doni' is not a standard English word. It is used in Indonesian to mean 'donation'. If you are speaking or writing in English, use the word 'donation' instead.","note":"This word is specific to Indonesian usage, so readability levels are not applicable in an English context."},"example_sentences":[{"sentence":"Mereka membutuhkan doni untuk membangun kembali sekolah.","translation":"They need donations to rebuild the school.","type":"noun","meaning_category":"donation","note":"Indonesian sentence."}]}