{"word":"Neo-Eurasianism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"ネオ・ユーラシア主義：地政学的・政治的イデオロギーであり、ロシア文明はヨーロッパにもアジアにも属さない独自の文明であると主張し、ロシアを中心としたユーラシア大陸における政治的・文化的統合を提唱する。","english_definition":"A geopolitical and political ideology which asserts that Russian civilization does not belong to either Europe or Asia, and advocates for political and cultural integration on the Eurasian continent, led by Russia.","examples":[{"sentence":"Neo-Eurasianism has become an influential ideology in Russian politics.","translation":"ネオ・ユーラシア主義はロシア政治において影響力のあるイデオロギーとなっている。"},{"sentence":"Critics argue that Neo-Eurasianism is a form of Russian imperialism.","translation":"批評家たちは、ネオ・ユーラシア主義はロシア帝国主義の一形態であると主張する。"}],"collocations":["Eurasian integration (ユーラシア統合)","geopolitics (地政学)","Russian ideology (ロシアのイデオロギー)"],"synonyms":["Eurasianism"],"antonyms":[]}],"etymology":{"value":"「Neo-」は「新しい」を意味する接頭辞。「Eurasianism」は、20世紀初頭にロシアの亡命者によって提唱された思想であり、ロシアはヨーロッパとアジアの中間に位置する独自の文明であると主張した。","priority":"中"},"pronunciation":{"ipa":"/ˌniːoʊjʊˈreɪʒənɪzəm/","syllables":"Ne-o-Eu-ra-sian-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"ネオ・ユーラシア主義は、アレクサンドル・ドゥーギンなどの思想家によって提唱され、現代ロシアの外交政策や国内政治に影響を与えている。このイデオロギーは、多極世界を支持し、アメリカ合衆国を中心とした一極支配体制に反対する。","priority":"中"},"common_mistakes":{"examples":[],"priority":"低"},"related_words":{"derivatives":["Eurasian (ユーラシアの)","Eurasianist (ユーラシア主義者)"],"priority":"中"},"level_frequency":{"frequency_google_ngram":"低頻度","priority":"低"},"readability_explanation":{"level":"C1","text":"「ネオ・ユーラシア主義」は、ロシアを中心としたユーラシア大陸の統合を主張する複雑な地政学的イデオロギーです。この用語は、ロシアがヨーロッパにもアジアにも属さない独自の文明であるという考えに基づいています。政治、歴史、国際関係の文脈でよく使用されます。"},"example_sentences":[{"sentence":"The rise of Neo-Eurasianism has led to increased tensions between Russia and the West.","translation":"ネオ・ユーラシア主義の台頭は、ロシアと西側諸国間の緊張を高めている。","type":"noun","meaning_category":"地政学的イデオロギー"},{"sentence":"Some scholars believe that Neo-Eurasianism is a response to Western globalization.","translation":"一部の学者は、ネオ・ユーラシア主義は西洋のグローバリゼーションへの対応であると考えている。","type":"noun","meaning_category":"地政学的イデオロギー"}]}