{"word":"epitaphic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"墓碑銘の、墓碑銘のような","english_definition":"of or relating to an epitaph; suitable for an epitaph.","examples":[{"sentence":"The poem had an epitaphic quality, making it suitable for a memorial.","translation":"その詩は墓碑銘のような性質を持ち、追悼にふさわしいものでした。"},{"sentence":"He wrote a short, epitaphic verse for his friend's grave.","translation":"彼は友人の墓のために短い墓碑銘的な詩を書いた。"}],"collocations":["epitaphic inscription","epitaphic verse","epitaphic style"],"synonyms":["funereal","memorial","commemorative","elegiac"],"antonyms":["non-memorial","non-commemorative"]}],"etymology":{"value":"From the word 'epitaph' + '-ic'. 'Epitaph' comes from Greek 'epitaphios' meaning 'funeral oration', from 'epi' (upon) + 'taphos' (tomb).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛpɪˈtæfɪk/","syllables":"ep-i-taph-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms. However, 'epitaphic' is rarely used in comparative or superlative forms."},"usage_notes":{"explanation":"'Epitaphic' is primarily used to describe something that resembles or is suitable for an epitaph, such as a short, memorable phrase or a style of writing. It often carries a somber or reflective tone.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The book was epitaphic.","correct":"✓ The book contained epitaphic elements.","note":"'Epitaphic' describes qualities resembling an epitaph, not necessarily the entire subject. It's better to say something *contains* epitaphic elements, rather than saying the whole thing *is* epitaphic."}],"priority":"★☆☆"},"related_words":{"derivatives":["epitaph (noun): a phrase or form of words written in memory of a person who has died, especially as an inscription on a tombstone.","epitaphically (adverb): in an epitaphic manner."],"related_terms":["elegy (noun): a poem of serious reflection, typically a lament for the dead.","obituary (noun): a notice of a death, especially in a newspaper, typically with a brief biography of the deceased person."]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'epitaphic' is a relatively uncommon adjective that describes something related to or resembling an epitaph. An epitaph is a short statement or inscription commemorating a deceased person, often found on a tombstone. Therefore, 'epitaphic' is used to describe writing, speech, or art that has a similar quality, such as being concise, reflective, and memorializing. It is typically used in literary or academic contexts.","example_sentences":[{"sentence":"The artist's final painting had an epitaphic quality, as if it were a farewell to the world.","translation":"その芸術家の最後の絵は、まるで世界への別れの挨拶であるかのように、墓碑銘のような性質を持っていた。","type":"example"},{"sentence":"His brief, epitaphic remarks captured the essence of her life.","translation":"彼の簡潔な墓碑銘のような言葉は、彼女の人生の本質を捉えていた。","type":"example"}]}}