{"word":"Kwajalein-Eniwetok","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"クェゼリン・エニウェトク (マーシャル諸島にある環礁名)","english_definition":"A hypothetical combined atoll name referencing both Kwajalein and Eniwetok Atolls in the Marshall Islands, often used in historical or military contexts.","examples":[{"sentence":"The discussion centered on the strategic importance of Kwajalein-Eniwetok during World War II.","translation":"議論は、第二次世界大戦中のクェゼリン・エニウェトクの戦略的重要性に集中した。"},{"sentence":"The Kwajalein-Eniwetok area was heavily contested by Allied and Japanese forces.","translation":"クェゼリン・エニウェトク地域は、連合軍と日本軍によって激しく争われた。"}],"collocations":["strategic importance of Kwajalein-Eniwetok","Kwajalein-Eniwetok campaign","Kwajalein-Eniwetok area","capture of Kwajalein-Eniwetok"],"synonyms":["Kwajalein Atoll","Eniwetok Atoll"],"antonyms":[]}],"etymology":{"value":"クェゼリン環礁 (Kwajalein Atoll) とエニウェトク環礁 (Eniwetok Atoll) の名前を組み合わせたもので、両環礁が地理的に近く、歴史的・軍事的に関連性が高いため。特に第二次世界大戦中、およびその後の核実験において重要な役割を果たした。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkwɑːdʒəlɪn ˌɛnɪˈwiːtɒk/","syllables":"Kwa-ja-lein-E-ni-we-tok"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"「**Kwajalein-Eniwetok**」は、クェゼリン環礁とエニウェトク環礁をまとめて指す場合に用いられる名称です。この名称は、特に第二次世界大戦における両環礁の戦略的重要性を強調する文脈や、その後の核実験に関連する歴史的な議論でよく見られます。現代では、個々の環礁名を使用することが一般的ですが、歴史的な背景を考慮する際には、この複合名が用いられることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The island of Kwajalein-Eniwetok is a popular tourist destination.","correct":"✓ The Kwajalein and Eniwetok Atolls are not major tourist destinations.","note":"クェゼリンとエニウェトクは観光地として有名ではありません。軍事施設や歴史的な背景が主な特徴です。"},{"incorrect":"✗ Kwajalein-Eniwetok is located near Hawaii.","correct":"✓ Kwajalein and Eniwetok are located in the Marshall Islands.","note":"クェゼリンとエニウェトクはハワイの近くではなく、マーシャル諸島に位置しています。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_locations":["Marshall Islands","Pacific Ocean"],"historical_events":["World War II","Operation Crossroads","nuclear testing"],"military_terms":["atoll","island hopping","strategic location"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 特定の歴史的または軍事的文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Kwajalein-Eniwetok**」は、マーシャル諸島にあるクェゼリン環礁とエニウェトク環礁を指す、やや専門的な名称です。主に歴史的な文脈、特に第二次世界大戦やその後の核実験に関連して使用されます。この複合名称は、両環礁が地理的に近く、戦略的に重要な役割を果たしたことから生まれました。一般的な会話では個々の環礁名が使われることが多いですが、歴史的背景を議論する際にはこの複合名が用いられることがあります。"},"example_sentences":[{"sentence":"The U.S. military conducted numerous nuclear tests in the Kwajalein-Eniwetok area during the Cold War.","translation":"アメリカ軍は冷戦時代にクェゼリン・エニウェトク地域で多数の核実験を実施した。","type":"historical context","meaning_category":"歴史的背景"},{"sentence":"The capture of Kwajalein and Eniwetok was a key objective in the Allied forces' island-hopping campaign.","translation":"クェゼリンとエニウェトクの占領は、連合軍の島伝い作戦における重要な目標だった。","type":"military strategy","meaning_category":"軍事戦略"},{"sentence":"Studies have been conducted to assess the long-term environmental impact of nuclear testing on Kwajalein and Eniwetok.","translation":"クェゼリンとエニウェトクにおける核実験の長期的な環境影響を評価するための研究が行われてきた。","type":"environmental impact","meaning_category":"環境影響"}]}