{"word":"adhesion-independent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"接着非依存性の、細胞接着に依存しない","english_definition":"Not requiring cell adhesion for survival or proliferation; able to survive and proliferate without being attached to a substrate or other cells.","examples":[{"sentence":"Adhesion-independent growth is a characteristic of some cancer cells.","translation":"接着非依存性増殖は、一部の癌細胞の特徴である。"},{"sentence":"This cell line exhibits adhesion-independent survival in suspension culture.","translation":"この細胞株は、懸濁培養において接着非依存性の生存を示す。"}],"collocations":["adhesion-independent growth","adhesion-independent survival","adhesion-independent proliferation"],"synonyms":["anchorage-independent","suspension culture"],"antonyms":["adhesion-dependent"],"related_terms":["adhesion","anchorage-dependence","suspension culture","cell adhesion","cell proliferation","cancer cell"]}],"etymology":{"value":"Formed by combining \"adhesion\" (the state of sticking together), \"independent\" (not relying on something else), and the suffix \"-ent\" (indicating a state or condition).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ædˈhiːʒən ɪndɪˈpɛndənt/","syllables":"ad-he-sion in-di-pen-dent"},"inflection":{"notes":"Adjective; does not inflect"},"usage_notes":{"explanation":"The term \"adhesion-independent\" is commonly used in cell biology and cancer research to describe cells that can grow and survive without being attached to a surface or other cells. This is in contrast to normal cells, which typically require adhesion to a substrate for survival and proliferation (anchorage dependence). Adhesion-independent growth is a hallmark of cancer cells, as it allows them to metastasize and form tumors in distant locations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ adhesion independent","correct":"✓ adhesion-independent","note":"The term is typically hyphenated."}],"priority":"☆☆☆"},"related_words":{"derivatives":["adhesion","independent"],"related_terms":["anchorage-dependence","suspension culture","cell adhesion","cell proliferation","metastasis"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"adhesion-independent\" describes cells that don't need to stick to a surface to grow. Normal cells need to attach to something to survive, but some cancer cells can grow without this attachment, which is called adhesion-independent growth. This is important in cancer because it allows cancer cells to spread more easily."},"example_sentences":[{"sentence":"The researchers studied the adhesion-independent properties of the tumor cells.","translation":"研究者らは、腫瘍細胞の接着非依存性の特性を研究した。","type":"general","meaning_category":"General"},{"sentence":"Adhesion-independent growth is often assessed using soft agar assays.","translation":"接着非依存性増殖は、しばしば軟寒天アッセイを用いて評価される。","type":"technical","meaning_category":"Technical"}]}