{"word":"anthroposcopy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"人相学、人体観察","english_definition":"The study of the human body's characteristics, especially facial features, for purposes of identification or character assessment.","examples":[{"sentence":"Anthroposcopy was once used in forensic science to identify criminals based on their physical features.","translation":"人相学はかつて、犯罪者の身体的特徴に基づいて識別するために法医学で使用されていました。"},{"sentence":"Some historical figures believed that anthroposcopy could reveal a person's inner character.","translation":"歴史上の人物の中には、人相学が人の内面的な性格を明らかにすると信じていた人もいました。"}],"collocations":["forensic anthroposcopy","historical anthroposcopy"],"synonyms":["physiognomy","anthropometry"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'anthropos' (human) and 'skopeō' (to examine, view).","priority":"★★☆"},"pronunciation":{"ipa":"ˌænθrəˈpɒskəpi","syllables":"an-thro-pos-co-py"},"inflection":{"noun_plural":"anthroposcopies"},"usage_notes":{"explanation":"Anthroposcopy is a historical and somewhat outdated term referring to the study of the human body, particularly facial features, to infer characteristics or for identification. It's closely related to physiognomy, which focuses on character assessment through facial features, and anthropometry, which involves the measurement of human body dimensions. While it once had applications in fields like forensic science, modern techniques have largely replaced it.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Anthroposcopy is the same as anthropology.","correct":"✓ Anthroposcopy is the study of human physical features, while anthropology is the broader study of human societies and cultures.","note":"Anthroposcopy focuses on physical features, whereas anthropology is a much broader field encompassing culture, society, and human evolution."}],"priority":"★☆☆"},"related_words":{"derivatives":["anthroposcopic (adjective)"],"related_terms":["anthropology","physiognomy","anthropometry"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Anthroposcopy is a specialized term referring to the study of human physical characteristics, particularly facial features, for identification or character assessment. It is a relatively uncommon term, primarily encountered in historical or forensic contexts. Understanding its distinction from related fields like anthropology and physiognomy is important for accurate usage."},"example_sentences":[{"sentence":"The old book described how anthroposcopy could be used to judge a person's character.","translation":"その古い本には、人相学を使って人の性格を判断する方法が書かれていました。","type":"general","meaning_category":"definition"},{"sentence":"Early forensic scientists used anthroposcopy to identify suspects based on their facial measurements.","translation":"初期の法医学者は、容疑者の顔の測定値に基づいて識別するために人相学を使用していました。","type":"historical","meaning_category":"application"}]}