{"word":"Obstructionists","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 妨害主義者たち、議事妨害をする人たち","english_definition":"(plural) People who systematically obstruct or delay progress, especially in a legislative assembly.","examples":[{"sentence":"The opposition party was accused of being obstructionists.","translation":"野党は、議事妨害主義者であると非難された。"},{"sentence":"The senator criticized the obstructionists for delaying the vote.","translation":"上院議員は、投票を遅らせている議事妨害者たちを批判した。"}],"collocations":["political obstructionists (政治的な妨害主義者たち)","legislative obstructionists (立法府の妨害主義者たち)"],"synonyms":["blockers","hinders","opponents","saboteurs"],"antonyms":["facilitators","supporters","collaborators"]}],"etymology":{"value":"The word 'obstructionist' is derived from 'obstruct,' which comes from the Latin 'obstruere,' meaning 'to build against, block up.' The suffix '-ist' indicates a person who practices or is associated with a particular doctrine, principle, or practice. Therefore, an obstructionist is someone who engages in the practice of obstructing.","priority":"★★☆"},"pronunciation":{"ipa":"/əbˈstrʌkʃənɪsts/","syllables":"ob-struc-tion-ists"},"inflection":{"noun_plural":"Obstructionists"},"usage_notes":{"explanation":"'Obstructionists' refers to a group of people who deliberately create obstacles or delays, often in a political or legislative context. The term carries a negative connotation, implying that these individuals are acting in bad faith or for selfish reasons, rather than for the greater good. It is often used in political discourse to criticize those who use procedural tactics to prevent or slow down the passage of legislation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The obstructionist are delaying the vote.","correct":"✓ The obstructionists are delaying the vote.","note":"'Obstructionists' is a plural noun, so it requires a plural verb ('are')."},{"incorrect":"✗ He is an obstructionists.","correct":"✓ He is an obstructionist.","note":"When referring to a single person, use the singular form 'obstructionist.'"}],"priority":"★★☆"},"related_words":{"derivatives":["obstruct (verb): to block or hinder","obstruction (noun): the act of obstructing","obstructionism (noun): the practice of deliberately obstructing or delaying progress"],"related_terms":["filibuster (noun): a tactic used in the United States Senate to delay or prevent a vote on a bill","gridlock (noun): a situation in which progress is blocked, especially in a legislative body"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'obstructionists' is a relatively advanced term used to describe individuals who intentionally impede progress, particularly in political or legislative settings. Understanding the term requires familiarity with political processes and the tactics used to delay or block legislation. It is often used in news reports and political commentary, so familiarity with the term can aid in understanding these sources."},"example_sentences":[{"sentence":"The speaker accused the opposition of being a group of obstructionists.","translation":"議長は野党を妨害主義者の集団だと非難した。","type":"noun","meaning_category":"議事妨害をする人たち"},{"sentence":"The obstructionists in the Senate made it impossible to pass the bill.","translation":"上院の妨害主義者たちは、法案を通過させることを不可能にした。","type":"noun","meaning_category":"議事妨害をする人たち"}]}