{"word":"learnedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"博識ぶって、学識高く、学問的に","english_definition":"in a learned manner; with erudition; in a way that shows great knowledge or scholarship.","examples":[{"sentence":"He spoke learnedly about the history of the Byzantine Empire.","translation":"彼はビザンツ帝国の歴史について博識ぶって語った。"},{"sentence":"The professor lectured learnedly on the intricacies of quantum physics.","translation":"教授は量子物理学の複雑さについて学問的に講義した。"},{"sentence":"She wrote learnedly on the subject of ancient philosophy.","translation":"彼女は古代哲学のテーマについて学識高く執筆した。"}],"collocations":["speak learnedly","write learnedly","lecture learnedly","discuss learnedly"],"synonyms":["eruditely","scholarly","pedantically","intellectually","knowledgeably"],"antonyms":["ignorantly","uneducatedly","simply","naively"]}],"etymology":{"value":"\"Learned\" + \"-ly\". \"Learned\" comes from the Old English word \"leornian,\" meaning \"to learn.\" The suffix \"-ly\" is used to form adverbs.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɜːrnɪdli/","syllables":"learn-ed-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Learnedly\" describes the manner in which someone speaks, writes, or behaves, emphasizing the display of extensive knowledge and scholarship. It can sometimes imply a slightly pretentious or ostentatious display of learning. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He learnedly the poem.","correct":"✓ He recited the poem learnedly.","note":"\"Learnedly\" is an adverb, so it modifies a verb. It cannot be used as a verb itself. You need to use a verb like \"recite,\" \"speak,\" or \"write\" that the adverb can modify."},{"incorrect":"✗ She is a learnedly person.","correct":"✓ She is a learned person.","note":"\"Learned\" is the adjective form. \"Learnedly\" is the adverb form and cannot be used to describe a person directly."}],"priority":"★★☆"},"related_words":{"derivatives":["learned (adjective: 博識な、学識のある)","learning (noun: 学習、学問)","learn (verb: 学ぶ)"],"phrases":["a learned society (学術団体)","learned professions (専門職)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"learnedly\" is an adverb that describes doing something in a way that shows a lot of knowledge and education. It's not a common word, and it's usually used in formal writing or speech. It suggests that the person is trying to impress others with their intelligence. For example, if someone \"speaks learnedly,\" it means they are talking in a way that shows they know a lot about a subject, possibly in a way that seems a bit showy or pretentious."},"example_sentences":[{"sentence":"The historian wrote learnedly about the complex political landscape of the era.","translation":"その歴史家は、その時代の複雑な政治情勢について学識高く執筆した。","type":"adverb","meaning_category":"博識ぶって"},{"sentence":"He debated the philosophical points learnedly, citing numerous ancient texts.","translation":"彼は多くの古代の文献を引用して、哲学的なポイントを学問的に議論した。","type":"adverb","meaning_category":"学問的に"},{"sentence":"She approached the problem learnedly, applying theories from various academic disciplines.","translation":"彼女は様々な学問分野の理論を応用して、その問題に学識高く取り組んだ。","type":"adverb","meaning_category":"学識高く"}]}