{"word":"self-disserving","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"自己のためにならない、自己犠牲的な","english_definition":"Not serving one's own interests; self-sacrificing, often in a way that is ultimately harmful or disadvantageous.","examples":[{"sentence":"His self-disserving actions ultimately led to his downfall.","translation":"彼の自己犠牲的な行動は、最終的に彼の没落につながった。"},{"sentence":"She made a self-disserving decision to put her family's needs before her own career.","translation":"彼女は家族のニーズを自分のキャリアよりも優先するという自己犠牲的な決断をした。"},{"sentence":"While generosity is admirable, being self-disserving to an extreme can be detrimental to one's well-being.","translation":"寛大さは称賛に値するが、極端に自己犠牲的であることは、自分の幸福にとって有害となり得る。"}],"collocations":["self-disserving behavior","self-disserving actions","self-disserving decisions","self-disserving attitude"],"synonyms":["self-sacrificing","altruistic (often negatively)","unselfish (often negatively)","self-defeating"],"antonyms":["self-serving","selfish","opportunistic","pragmatic"]}],"etymology":{"value":"The word is formed by combining \"self-\" (referring to oneself) with \"disserving\" (not serving or benefiting). Thus, it literally means 'not serving oneself'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌself.dɪˈzɜːrvɪŋ/","syllables":"self-di-ser-ving"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically formed using 'more' and 'most' (e.g., more self-disserving, most self-disserving)."},"usage_notes":{"explanation":"\"Self-disserving\" describes actions, decisions, or behaviors that, while perhaps appearing noble or generous, ultimately work against one's own interests or well-being. It often implies a level of sacrifice that is excessive or even harmful. The term carries a slightly negative connotation, suggesting that such behavior is not necessarily wise or healthy. It is important to distinguish it from simply being unselfish, as self-disserving actions often have negative consequences for the individual performing them.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very self-disserving person, always helping others.","correct":"✓ He is a very self-sacrificing person, always helping others. / ✓ His self-disserving actions, though intended to help others, ultimately harmed him.","note":"While 'self-disserving' implies helping others, it emphasizes the negative impact on the individual. 'Self-sacrificing' is a more neutral or positive term for simply helping others. The second correct sentence clarifies the negative impact. "},{"incorrect":"✗ She was self-disserving to her friends.","correct":"✓ She was self-disserving to herself by always putting her friends first.","note":"The term refers to actions that harm oneself. The corrected sentence clarifies that her actions, intended to help friends, harmed herself."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_adjectives":["self-defeating","self-destructive"],"related_nouns":["self-sacrifice","altruism (often negatively)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"self-disserving\" describes actions or behaviors that do not benefit the person doing them, and may even be harmful. It suggests a level of self-sacrifice that is excessive or unwise. It's a more nuanced term than simply \"unselfish,\" as it implies negative consequences for the individual. Understanding the negative connotation and the emphasis on harm to oneself is key to correctly using this word."},"example_sentences":[{"sentence":"His constant willingness to work overtime, even when exhausted, was a **self-disserving** habit.","translation":"疲れていても常に残業を厭わない彼の態度は、自己のためにならない習慣だった。","type":"adjective","meaning_category":"Not serving one's own interests"},{"sentence":"Making the **self-disserving** choice to give up her scholarship for her sibling's education, she struggled to find her own path.","translation":"妹の教育のために奨学金を諦めるという自己犠牲的な選択をした彼女は、自分の道を見つけるのに苦労した。","type":"adjective","meaning_category":"Self-sacrificing"},{"sentence":"The company's policy of prioritizing short-term profits over employee well-being was ultimately **self-disserving**.","translation":"従業員の幸福よりも短期的な利益を優先するという会社の方針は、最終的には自己のためにならなかった。","type":"adjective","meaning_category":"Harmful to one's own interests"}]}