{"word":"misadventurously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"不運にも冒険的に、災難に見舞われやすい冒険心をもって","english_definition":"In a manner characterized by misfortune or ill-fated adventurousness.","examples":[{"sentence":"He misadventurously decided to climb the mountain without proper gear.","translation":"彼は不運にも、適切な装備なしでその山に登ることを決意した。"},{"sentence":"She misadventurously invested all her savings in a risky scheme.","translation":"彼女は災難に見舞われやすい冒険心をもって、すべての貯金を危険な計画に投資した。"}],"collocations":["act misadventurously","proceed misadventurously","invest misadventurously"],"synonyms":["recklessly","rashly","unwisely","foolishly","imprudently","hazardously"],"antonyms":["cautiously","prudently","safely","wisely"]}],"etymology":{"value":"Derived from 'misadventure' (an unlucky accident or event) + '-ous' (characterized by) + '-ly' (manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪsədˈventʃərəsli/","syllables":"mis-ad-ven-tur-ous-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Misadventurously' describes an action performed in a way that combines risk-taking with a high likelihood of negative outcomes or bad luck. It suggests that the action was not only adventurous but also poorly planned or executed, leading to potential or actual misfortune.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He adventurously miscalculated the risk.","correct":"✓ He misadventurously calculated the risk.","note":"'Misadventurously' modifies the manner of the action, not the adjective describing the action. Therefore, it should be placed to modify the verb directly."}],"priority":"★☆☆"},"related_words":{"derivatives":["misadventure (noun): An unlucky accident or event.","adventurous (adjective): Willing to take risks or try out new methods, ideas, or experiences.","adventurously (adverb): In an adventurous manner."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Misadventurously' is a complex word indicating that an action is both adventurous and likely to lead to misfortune due to poor planning or execution. It is used to describe actions that are not only risky but also ill-fated. It is not a common word and is typically found in formal writing or speech.","priority":"★★☆"},"example_sentences":[{"sentence":"The explorers, misadventurously navigating uncharted waters, soon found themselves in a perilous situation.","translation":"探検家たちは、不運にも未踏の海域を冒険的に航海し、すぐに危険な状況に陥った。","type":"adverb","meaning_category":"Ill-fated adventurousness"},{"sentence":"She misadventurously trusted a stranger with her valuables, leading to their immediate loss.","translation":"彼女は災難に見舞われやすい冒険心をもって、見知らぬ人に貴重品を預け、すぐに紛失してしまった。","type":"adverb","meaning_category":"Unlucky risk-taking"}]}