{"word":"disquisitively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"詮索的に、詳しく議論するように、綿密に調べるように","english_definition":"in a disquisitive manner; in a way that involves or shows an interest in discussing or examining a subject in detail.","examples":[{"sentence":"He approached the problem disquisitively, examining every possible angle.","translation":"彼はあらゆる角度から検討し、その問題に詮索的に取り組みました。"},{"sentence":"The author writes disquisitively about the nuances of human relationships.","translation":"その著者は人間関係のニュアンスについて詳しく議論するように書いています。"}],"collocations":["approach disquisitively","examine disquisitively","write disquisitively"],"synonyms":["analytically","inquisitively","exploratively","thoroughly","critically","investigatively"],"antonyms":["superficially","cursorily","briefly"]}],"etymology":{"value":"「disquisitive」+「-ly」。 「disquisitive」は、ラテン語の「disquisitus」（調査された、詳細に調べられた）に由来します。 これは、「disquirere」（徹底的に探求する）の過去分詞形です。","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈskwɪzɪtɪvli/","syllables":"dis-quiz-i-tive-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"**Disquisitively**\" describes an action done in a manner that is thorough, analytical, and deeply inquisitive. It implies a detailed examination or discussion of a subject, often with a focus on exploring nuances and complexities. This word is relatively formal and not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He disquisitively the answer.","correct":"✓ He explored the answer disquisitively.","note":"\"Disquisitively\" is an adverb, so it modifies a verb. It doesn't directly take an object. Use a verb like \"explore,\" \"examine,\" or \"discuss\" with \"disquisitively.\""}],"priority":"★★☆"},"related_words":{"derivatives":["disquisition (名詞: 論文、詳細な議論)","disquisitive (形容詞: 詮索的な、詳細に議論する)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"**disquisitively**\" is a formal adverb that means \"in a way that involves or shows an interest in discussing or examining a subject in detail.\" It is not a common word and is typically used in academic or formal writing. If you want to use a more common word, you could use \"analytically,\" \"thoroughly,\" or \"inquisitively.\" Understanding this word can improve comprehension of complex texts, but it is not essential for basic communication."},"example_sentences":[{"sentence":"The historian researched the ancient documents disquisitively, uncovering new insights into the civilization.","translation":"歴史家は古代文書を詮索的に調査し、その文明に関する新たな洞察を明らかにした。","type":"adverb","meaning_category":"詳しく調べるように"},{"sentence":"She analyzed the data disquisitively to identify any potential trends.","translation":"彼女は潜在的な傾向を特定するために、データを詳しく議論するように分析した。","type":"adverb","meaning_category":"詳しく議論するように"}]}