{"word":"cathode ray","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"陰極線","english_definition":"a beam of electrons emitted from the cathode of a vacuum tube.","examples":[{"sentence":"The cathode ray is deflected by a magnetic field.","translation":"陰極線は磁場によって偏向される。"},{"sentence":"Early televisions used cathode ray tubes to display images.","translation":"初期のテレビは、画像を表示するために陰極線管を使用していた。"}],"collocations":["cathode ray tube","deflection of cathode ray","properties of cathode rays"],"synonyms":["electron beam"],"antonyms":[]}],"etymology":{"value":"The term 'cathode ray' originates from the fact that these rays emanate from the cathode (negative electrode) in a vacuum tube.","priority":"N/A"},"pronunciation":{"ipa":"/ˈkæθoʊd reɪ/","syllables":"ca-thode ray"},"inflection":{"noun_plural":"cathode rays"},"usage_notes":{"explanation":"Cathode rays are streams of electrons observed in vacuum tubes. Applying a high voltage between two electrodes in an evacuated glass tube causes a beam to be emitted from the cathode. These rays can be deflected by magnetic fields, demonstrating that they carry a negative charge. Cathode rays were crucial in the discovery of the electron and the development of early television technology.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["cathode ray tube (CRT)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Cathode ray' refers to a stream of electrons emitted from the cathode of a vacuum tube. This term is typically encountered in the context of physics, electronics, and the history of technology, particularly in relation to the development of cathode ray tubes (CRTs) used in early televisions and oscilloscopes. Understanding this term requires some background knowledge in basic physics and electronics.","priority":"N/A"},"example_sentences":[{"sentence":"The discovery of cathode rays led to the invention of the cathode ray tube.","translation":"陰極線の発見が陰極線管の発明につながった。","type":"noun","meaning_category":"physics"},{"sentence":"The intensity of the cathode ray can be controlled to vary the brightness of the image.","translation":"陰極線の強度を制御することで、画像の明るさを変えることができる。","type":"noun","meaning_category":"physics"}]}