{"word":"aparthrosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"関節離開、関節弛緩","english_definition":"A diarthrosis in which the articular surfaces are separated by an interarticular cartilage, as in the temporomandibular joint. Also, a false joint formed in a fracture that has not healed properly.","examples":[{"sentence":"The patient was diagnosed with temporomandibular joint aparthrosis.","translation":"患者は顎関節のアパルトローシスと診断された。"},{"sentence":"Aparthrosis can occur as a complication of certain types of fractures.","translation":"アパルトローシスは、特定の種類の骨折の合併症として発生することがある。"}],"collocations":["temporomandibular joint aparthrosis","fracture aparthrosis"],"synonyms":["diarthrosis","false joint","pseudoarthrosis"],"antonyms":[]}],"etymology":{"value":"From Greek ἀπ- (ap-, \"away, apart\") + ἄρθρωσις (arthrōsis, \"articulation\").","priority":"★★★"},"pronunciation":{"ipa":"/ˌæpɑːrˈθroʊsɪs/","syllables":"a-par-thro-sis"},"inflection":{"noun_plural":"aparthroses"},"usage_notes":{"explanation":"Aparthrosis refers to a specific type of joint or a condition resulting from improper healing of a fracture. It is a technical term primarily used in medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor treated the aparthrosis with antibiotics.","correct":"✓ The doctor treated the aparthrosis with physical therapy and possibly surgery.","note":"Aparthrosis is a structural issue, not an infection, so antibiotics are not the appropriate treatment."}],"priority":"★★☆"},"related_words":{"derivatives":["arthrosis"],"related_terms":["diarthrosis","synarthrosis"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - a technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Aparthrosis is a highly specialized medical term referring to a specific type of joint or a complication of fracture healing. It is not commonly used outside of medical and anatomical contexts. Understanding requires knowledge of medical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"Surgical intervention may be necessary to correct aparthrosis resulting from a non-union fracture.","translation":"手術介入は、癒合不全骨折に起因するアパルトローシスを矯正するために必要となる場合がある。","type":"medical","meaning_category":"関節離開・関節弛緩"},{"sentence":"Aparthrosis of the temporomandibular joint can lead to chronic pain and limited jaw movement.","translation":"顎関節のアパルトローシスは、慢性的な痛みと顎の可動域制限につながる可能性がある。","type":"medical","meaning_category":"関節離開・関節弛緩"}]}