{"word":"syntax-sensitive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"構文に依存する、構文を考慮する、構文解析を必要とする","english_definition":"Relating to or requiring an understanding of the grammatical structure (syntax) of a language or code.","examples":[{"sentence":"The compiler performs syntax-sensitive analysis to detect errors.","translation":"コンパイラは、エラーを検出するために構文に依存する解析を実行します。"},{"sentence":"Syntax-sensitive editors can provide better code completion suggestions.","translation":"構文を考慮するエディタは、より良いコード補完の提案を提供できます。"},{"sentence":"Some search engines are becoming more syntax-sensitive to improve the accuracy of results.","translation":"一部の検索エンジンは、検索結果の精度を向上させるために、より構文を考慮するようになっています。"}],"collocations":["syntax-sensitive analysis","syntax-sensitive editor","syntax-sensitive parsing","syntax-sensitive search"],"synonyms":["context-aware","grammar-aware","language-aware"],"antonyms":["syntax-insensitive","context-free","grammar-free"]},{"part_of_speech":"adjective","definition":"（特にプログラミングにおいて）構文を正しく解釈・処理できる","english_definition":"Capable of correctly interpreting and processing the syntax of a language, especially in programming.","examples":[{"sentence":"The syntax-sensitive tool highlighted the mismatched parentheses.","translation":"その構文を正しく解釈できるツールは、対応していない括弧を強調表示しました。"},{"sentence":"A syntax-sensitive parser is essential for compiling complex code.","translation":"構文を正しく解釈できるパーサーは、複雑なコードをコンパイルするために不可欠です。"}],"collocations":["syntax-sensitive parser","syntax-sensitive compiler","syntax-sensitive editor"],"synonyms":["syntactically aware","syntactically correct","syntax-aware"],"antonyms":["syntax-ignorant","syntax-unaware"]}],"etymology":{"value":"The term is formed by combining 'syntax' (the arrangement of words and phrases to create well-formed sentences in a language) with 'sensitive' (responsive or susceptible).","priority":"N/A"},"pronunciation":{"ipa":"/ˈsɪnˌtæks ˈsɛnsɪtɪv/","syllables":"syn-tax-sen-si-tive"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Syntax-sensitive' describes a system or tool that understands and utilizes the grammatical rules (syntax) of a language. This is particularly important in computer science, linguistics, and related fields where correct interpretation of language structure is crucial. The term implies a level of sophistication beyond simple keyword matching or pattern recognition, indicating a deeper understanding of the language's structure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The software is syntax-sensitive to all languages.","correct":"The software is syntax-sensitive to several programming languages.","note":"It's rare for a system to be syntax-sensitive to *all* languages. Be specific about which languages are supported."},{"incorrect":"The tool is sensitive to syntax.","correct":"The tool is syntax-sensitive.","note":"While 'sensitive to syntax' is understandable, 'syntax-sensitive' is the more common and precise term."}],"priority":"★☆☆"},"related_words":{"derivatives":["syntax","sensitive","syntactically","sensitivity"],"related_terms":["parser","compiler","lexer","grammar","syntax analysis","context-free grammar","context-sensitive grammar"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Syntax-sensitive' is a technical term primarily used in computer science and linguistics. It describes a system or tool that understands and takes into account the grammatical structure (syntax) of a language. For example, a syntax-sensitive editor can identify syntax errors in code because it understands the rules of the programming language. This term is not commonly used in everyday conversation and is more likely to appear in technical documentation or academic papers.","priority":"★★☆"},"example_sentences":[{"sentence":"The IDE uses a syntax-sensitive editor to highlight errors in real-time.","translation":"そのIDEは、リアルタイムでエラーを強調表示するために、構文を考慮するエディタを使用しています。","type":"general","meaning_category":"構文を考慮する"},{"sentence":"The search engine employs syntax-sensitive parsing to better understand complex queries.","translation":"その検索エンジンは、複雑なクエリをより良く理解するために、構文に依存する解析を使用しています。","type":"technical","meaning_category":"構文解析を必要とする"},{"sentence":"Developing a syntax-sensitive algorithm requires a deep understanding of formal language theory.","translation":"構文を考慮するアルゴリズムを開発するには、形式言語理論の深い理解が必要です。","type":"technical","meaning_category":"構文に依存する"}]}