{"word":"agenetic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"遺伝的でない、遺伝に関係しない","english_definition":"Not genetic; unrelated to genes or heredity.","examples":[{"sentence":"The disease is agenetic, meaning it is not passed down through families.","translation":"その病気は遺伝的ではなく、家族間で受け継がれるものではないことを意味します。"},{"sentence":"Environmental factors, rather than agenetic ones, are believed to cause the condition.","translation":"その状態を引き起こすのは、遺伝的要因ではなく、環境要因であると考えられています。"}],"collocations":["agenetic disease","agenetic factor","agenetic cause"],"synonyms":["non-hereditary","non-genetic","acquired","environmental"],"antonyms":["genetic","hereditary","inherited"]}],"etymology":{"value":"'a-' (否定) + 'genetic' (遺伝的な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌeɪdʒəˈnɛtɪk/","syllables":"a-ge-net-ic"},"inflection":{"notes":"adjective, comparative and superlative forms are possible but rare (more agenetic, most agenetic)"},"usage_notes":{"explanation":"'Agenetic' is primarily used in scientific and medical contexts to describe conditions, diseases, or traits that are not determined by genetic inheritance. It emphasizes the role of environmental or other non-genetic factors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The agenetic code determines the protein structure.","correct":"✓ The genetic code determines the protein structure.","note":"'Agenetic' refers to things *not* related to genes. The genetic code is, by definition, genetic."}],"priority":"★★☆"},"related_words":{"derivatives":["agenetically (adverb)"],"related_terms":["phenotype","environment","mutation (when not inherited)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific or medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Agenetic' is a technical term used in biology and medicine. It signifies that a trait, condition, or disease is not caused by genes passed down from parents. Instead, it arises from environmental factors, spontaneous mutations not inherited, or other non-genetic influences. Understanding this term requires a basic knowledge of genetics and heredity."},"example_sentences":[{"sentence":"The researchers investigated whether the observed trait was genetic or agenetic in origin.","translation":"研究者たちは、観察された特性が遺伝的起源であるか、非遺伝的起源であるかを調査しました。","type":"scientific","meaning_category":"non-genetic origin"},{"sentence":"Lung cancer is often cited as an example of an agenetic disease, as it is primarily caused by environmental factors like smoking.","translation":"肺がんは、喫煙などの環境要因が主な原因であるため、非遺伝性疾患の例としてよく挙げられます。","type":"medical","meaning_category":"non-genetic disease"}]}