{"word":"forward-scattering","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"前方散乱","english_definition":"The scattering of radiation or particles in directions close to the original direction of motion.","examples":[{"sentence":"Forward-scattering is important in understanding the propagation of light through fog.","translation":"前方散乱は、霧の中の光の伝播を理解する上で重要です。"},{"sentence":"The forward-scattering of electrons can be used to analyze the structure of materials.","translation":"電子の前方散乱は、材料の構造を分析するために使用できます。"}],"collocations":["small-angle forward-scattering","elastic forward-scattering","inelastic forward-scattering"],"synonyms":["small-angle scattering"],"antonyms":["backscattering"]},{"part_of_speech":"adjective","definition":"前方散乱の","english_definition":"Relating to or characterized by forward scattering.","examples":[{"sentence":"The forward-scattering peak in the diffraction pattern indicates the presence of large particles.","translation":"回折パターンにおける前方散乱ピークは、大きな粒子の存在を示しています。"},{"sentence":"Forward-scattering techniques are used in many optical instruments.","translation":"前方散乱技術は、多くの光学機器で使用されています。"}],"collocations":["forward-scattering amplitude","forward-scattering cross-section","forward-scattering geometry"],"synonyms":["small-angle scattering"],"antonyms":["backscattering"]}],"etymology":{"value":"The term is derived from the combination of \"forward,\" indicating the direction of motion, and \"scattering,\" referring to the dispersion of particles or radiation.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈfɔːrwərdˌskætərɪŋ/","syllables":"for-ward-scat-ter-ing"},"inflection":{"notes":"It can be used as a noun or an adjective, with no specific inflectional forms."},"usage_notes":{"explanation":"Forward-scattering refers to the phenomenon where particles or radiation are deflected in directions close to their original path. It is commonly used in physics, optics, and materials science to describe the behavior of light, electrons, and other particles as they interact with matter. The term is often contrasted with backscattering, where particles are deflected in the opposite direction.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ forward scatter","correct":"✓ forward-scattering","note":"When used as an adjective, it's generally hyphenated. When used as a noun, it can be written as one word or hyphenated, but hyphenated is more common in technical contexts."}],"priority":"☆☆☆"},"related_words":{"derivatives":["scattering","backscattering","Mie scattering","Rayleigh scattering"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'forward-scattering' is a technical term primarily used in scientific and engineering contexts, particularly in physics, optics, and materials science. It describes the phenomenon where particles or radiation are deflected at small angles relative to their original direction of motion. Understanding this term requires familiarity with basic concepts of wave propagation and particle interactions. It is typically encountered in advanced textbooks, research papers, and specialized technical literature."},"example_sentences":[{"sentence":"The intensity of the forward-scattering signal depends on the size and shape of the particles.","translation":"前方散乱信号の強度は、粒子のサイズと形状に依存します。","type":"noun","meaning_category":"前方散乱"},{"sentence":"The instrument uses a forward-scattering detector to measure particle size.","translation":"その装置は、粒子サイズを測定するために前方散乱検出器を使用しています。","type":"adjective","meaning_category":"前方散乱の"}]}