{"word":"squassation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ローマの刑罰)水責め","english_definition":"(historical) A form of torture in ancient Rome involving repeated drenching or pouring of water over the victim.","examples":[{"sentence":"Squassation was a brutal method used to extract confessions.","translation":"水責めは自白を引き出すために使われた残忍な方法だった。"},{"sentence":"The historical records describe squassation as a common punishment for slaves.","translation":"歴史的記録は水責めを奴隷に対する一般的な刑罰として記述している。"}],"collocations":["inflict squassation (水責めを科す)","undergo squassation (水責めを受ける)"],"synonyms":["water torture","drenching","submersion"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'squassare', meaning 'to shake, agitate, or squash'. The torture involved shaking or agitating the victim with water.","priority":"★★☆"},"pronunciation":{"ipa":"/skwæˈseɪʃən/","syllables":"squas-sa-tion"},"inflection":{"noun_plural":"squassations"},"usage_notes":{"explanation":"'Squassation' refers specifically to a form of water torture practiced in ancient Rome. It is a relatively rare word, primarily encountered in historical contexts or discussions of ancient Roman law and punishment. It should not be confused with modern forms of waterboarding, although both involve water submersion.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The squassation was very quiet.","correct":"✓ The squassation was very brutal.","note":"'Squassation' refers to a torture method, so it is typically described with adjectives like 'brutal', 'cruel', or 'inhumane', not 'quiet'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Squassation' is a highly specialized term referring to a specific form of ancient Roman torture. Its usage is limited to historical contexts and academic discussions. Due to its rarity and specific meaning, it is not commonly encountered in general English. Understanding requires knowledge of historical torture methods and a strong vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The Roman historian Tacitus described the use of squassation in his accounts.","translation":"ローマの歴史家タキトゥスは、彼の記述の中で水責めの使用について説明した。","type":"noun","meaning_category":"水責め"},{"sentence":"Squassation was often used in conjunction with other forms of torture.","translation":"水責めはしばしば他の形態の拷問と組み合わせて使用​​された。","type":"noun","meaning_category":"水責め"}]}