{"word":"unrentable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"賃貸できない、貸し出しに適さない","english_definition":"Not suitable or able to be rented.","examples":[{"sentence":"The apartment was unrentable due to the extensive water damage.","translation":"そのアパートは広範囲にわたる水害のため、賃貸に出すことができなかった。"},{"sentence":"The property was deemed unrentable because it didn't meet the safety standards.","translation":"その物件は安全基準を満たしていなかったため、賃貸に適さないと判断された。"},{"sentence":"An unrentable movie or game might be available for purchase only.","translation":"レンタルできない映画やゲームは、購入のみ可能な場合がある。"}],"collocations":["unrentable property","unrentable apartment","unrentable condition"],"synonyms":["unleasable","unmarketable (for rent)","uninhabitable"],"antonyms":["rentable","leasable","marketable (for rent)"],"related_words":["rent","rental","unrented"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the word 'rentable'.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈrɛntəbəl/","syllables":"un-rent-a-ble"},"inflection":{"notes":"Adjectives do not inflect in English, but can form comparative and superlative forms using 'more' and 'most' or '-er' and '-est' (though this is uncommon for 'unrentable')."},"usage_notes":{"explanation":"'Unrentable' is used to describe something that cannot be rented, usually due to its poor condition, legal restrictions, or lack of demand. It often implies that some action (such as repairs or renovations) would be necessary to make the item or property suitable for rental.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The house is unrented.","correct":"The house is unrentable.","note":"'Unrented' means not currently rented, but potentially rentable. 'Unrentable' means not able to be rented in its current condition."}],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'unrentable' is relatively uncommon and is used in specific contexts related to real estate and rentals. It means that something cannot be rented out, usually because it is in poor condition or does not meet certain standards. Understanding this word requires a good grasp of vocabulary related to property and renting."},"example_sentences":[{"sentence":"The old building was considered unrentable without significant renovations.","translation":"その古い建物は、大規模な改修なしには賃貸できないと考えられていた。","type":"general","meaning_category":"General Use"},{"sentence":"Due to the mold infestation, the apartment became unrentable.","translation":"カビの蔓延により、そのアパートは賃貸できなくなった。","type":"property condition","meaning_category":"Property Condition"},{"sentence":"The outdated software was unrentable; customers preferred to buy newer versions.","translation":"その旧式のソフトウェアはレンタルできず、顧客はより新しいバージョンを購入することを好んだ。","type":"product rental","meaning_category":"Product Rental"}]}