{"word":"sickle-cell","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"鎌状赤血球の、鎌形赤血球性の","english_definition":"Relating to or affected by sickle cells or sickle-cell anemia.","examples":[{"sentence":"sickle-cell anemia is a genetic blood disorder.","translation":"鎌状赤血球貧血は遺伝性の血液疾患です。"},{"sentence":"sickle-cell trait can offer some protection against malaria.","translation":"鎌状赤血球形質はマラリアに対するある程度の防御効果をもたらすことがあります。"}],"collocations":["sickle-cell anemia","sickle-cell trait","sickle-cell disease","sickle-cell crisis"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"鎌状赤血球","english_definition":"A red blood cell that has assumed an abnormal, rigid, sickle shape.","examples":[{"sentence":"The blood test revealed the presence of sickle-cells.","translation":"血液検査で鎌状赤血球の存在が明らかになった。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'sickle-cell' comes from the sickle shape that red blood cells take on in individuals with sickle-cell anemia. 'Sickle' refers to a short-handled farming tool with a semi-circular blade, used for cutting grain or grass.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɪkəlˌsɛl/","syllables":"sick-le-cell"},"inflection":{"noun_plural":"sickle-cells"},"usage_notes":{"explanation":"'Sickle-cell' is primarily used in the context of medicine and genetics to describe conditions related to sickle-cell anemia, a hereditary blood disorder. It can refer to the abnormal sickle-shaped red blood cells themselves, or to the genetic trait or disease associated with these cells.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ sickle cell anemia is a contagious disease.","correct":"✓ Sickle cell anemia is a genetic disease.","note":"Sickle cell anemia is inherited, not contagious."}],"priority":"★★☆"},"related_words":{"derivatives":["sickle-cell anemia","sickle-cell trait","sickle-cell disease","sickling"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'sickle-cell' is a technical term primarily used in medical and scientific contexts. Understanding its meaning requires knowledge of genetics and hematology. It refers to a specific condition where red blood cells are abnormally shaped, which can lead to various health complications. The term is most commonly encountered in discussions about sickle-cell anemia, a genetic blood disorder."},"example_sentences":[{"sentence":"The patient was diagnosed with sickle-cell anemia at a young age.","translation":"その患者は幼い頃に鎌状赤血球貧血と診断された。","type":"adjective","meaning_category":"鎌状赤血球の"},{"sentence":"Sickle-cells can block blood flow in small vessels.","translation":"鎌状赤血球は細い血管内で血流を遮断することがある。","type":"noun","meaning_category":"鎌状赤血球"},{"sentence":"Genetic counseling is important for couples at risk of having a child with sickle-cell disease.","translation":"鎌状赤血球病の子どもを持つリスクのあるカップルにとって、遺伝カウンセリングは重要です。","type":"adjective","meaning_category":"鎌状赤血球の"}]}