{"word":"nonprolifically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"非多産的に、繁殖力が低い状態で、豊富でない状態で","english_definition":"In a way that is not prolific; not producing offspring, fruit, or results abundantly; sparsely.","examples":[{"sentence":"The plant grew nonprolifically in the shaded area.","translation":"その植物は日陰の場所ではあまり繁殖しなかった。"},{"sentence":"The author wrote nonprolifically, publishing only a few books in his lifetime.","translation":"その作家は寡作で、生涯に数冊しか本を出版しなかった。"},{"sentence":"The business expanded nonprolifically due to lack of investment.","translation":"そのビジネスは投資不足のため、あまり拡大しなかった。"}],"collocations":["grow nonprolifically","write nonprolifically","expand nonprolifically"],"synonyms":["sparsely","meagerly","infrequently","unproductively","unfruitfully"],"antonyms":["prolifically","abundantly","copiously","fruitfully","productively"]}],"etymology":{"value":"接頭辞 \"non-\" (否定) + 副詞 \"prolifically\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnprəˈlɪfɪkli/","syllables":"non-pro-lif-ic-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Nonprolifically\" is the adverbial form of \"nonprolific,\" meaning not producing offspring, fruit, or results abundantly. It describes something that happens or exists in a sparse or infrequent manner. It's often used to describe growth, production, or output that is limited or restricted.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rabbits bred nonprolifically.","correct":"✓ The rabbits did not breed prolifically. / ✓ The rabbit population remained stable.","note":"Rabbits are known for breeding prolifically. Saying they bred nonprolifically is counter-intuitive. It's better to say they did not breed prolifically or describe the population as stable."},{"incorrect":"✗ He wrote nonprolifically because he was lazy.","correct":"✓ He wrote nonprolifically due to writer's block. / ✓ He wrote nonprolifically because he was meticulous.","note":"Nonprolific writing can be due to various reasons, not necessarily laziness. It could be due to writer's block, meticulousness, or other factors."}],"priority":"★☆☆"},"related_words":{"derivatives":["nonprolific (adjective)","prolifically (adverb)","prolific (adjective)","proliferation (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonprolifically\" is an advanced term that means \"not in a prolific manner.\" Prolific means producing a lot of something, so nonprolifically means producing only a small amount or not very often. This word is not commonly used and is more likely to appear in academic or technical writing."},"example_sentences":[{"sentence":"The artist painted nonprolifically, creating only a few masterpieces over his lifetime.","translation":"その芸術家は寡作で、生涯に数点の傑作しか制作しなかった。","type":"adverb","meaning_category":"非多産的に"},{"sentence":"Due to the harsh climate, the native plants grew nonprolifically.","translation":"厳しい気候のため、自生植物はあまり繁殖しなかった。","type":"adverb","meaning_category":"非多産的に"},{"sentence":"The company expanded nonprolifically in the new market, struggling to gain traction.","translation":"その会社は新しい市場でなかなか拡大できず、苦戦した。","type":"adverb","meaning_category":"非多産的に"}]}