{"word":"Miao","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ミャオ族、中国南部に居住する少数民族","english_definition":"A group of linguistically related ethnic groups living in Southern China and Southeast Asia; also known as Hmong.","examples":[{"sentence":"The Miao people have a rich cultural heritage.","translation":"ミャオ族は豊かな文化遺産を持っている。"},{"sentence":"Many Miao live in the mountains of Guizhou province.","translation":"多くのミャオ族が貴州省の山岳地帯に住んでいる。"}],"collocations":["Miao people","Miao language","Guizhou Miao"],"synonyms":["Hmong"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ミャオ族の、ミャオ語の","english_definition":"Relating to the Miao people or their language.","examples":[{"sentence":"Miao embroidery is known for its intricate designs.","translation":"ミャオ族の刺繍は、その複雑なデザインで知られている。"},{"sentence":"She is studying the Miao language.","translation":"彼女はミャオ語を勉強している。"}],"collocations":["Miao culture","Miao embroidery","Miao language"],"synonyms":["Hmong"],"antonyms":[]}],"etymology":{"value":"The name 'Miao' was historically used by the Han Chinese to refer to various non-Han ethnic groups in southern China. The term's usage and connotations have varied over time, sometimes carrying pejorative meanings.","priority":"★★☆"},"pronunciation":{"ipa":"/mjaʊ/","syllables":"Miao"},"inflection":{"notes":"The word 'Miao' does not typically inflect for pluralization or tense."},"usage_notes":{"explanation":"The term 'Miao' is used to refer to a collection of distinct but related ethnic groups, primarily residing in southern China and parts of Southeast Asia. While 'Miao' is used in China, the term 'Hmong' is more commonly used internationally, particularly among diaspora communities. It's important to be aware of the sensitivities surrounding the term 'Miao,' as it has a complex history and has sometimes been used in a derogatory way.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Miaos are a single ethnic group.","correct":"✓ The Miao are a collection of related ethnic groups.","note":"It's important to remember that 'Miao' refers to a group of related, but distinct, ethnic groups, not a single unified group."},{"incorrect":"✗ All Miao speak the same language.","correct":"✓ The Miao speak a variety of related languages.","note":"The Miao groups speak a family of related languages, but not all speak the same language."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'Miao' refers to a group of related ethnic groups primarily living in southern China and Southeast Asia. It's important to understand that 'Miao' encompasses multiple distinct groups, each with its own culture and language. The term 'Hmong' is often used interchangeably with 'Miao,' particularly outside of China. Be aware of the potential sensitivities surrounding the term 'Miao' due to its historical usage.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Miao** villages are often located in remote mountainous areas.","translation":"ミャオ族の村は、多くの場合、人里離れた山岳地帯に位置している。","type":"noun","meaning_category":"ethnic group"},{"sentence":"The **Miao** New Year is a significant cultural event.","translation":"ミャオ族の正月は重要な文化的なイベントである。","type":"adjective","meaning_category":"relating to ethnic group"},{"sentence":"She is researching traditional **Miao** medicine.","translation":"彼女は伝統的なミャオ族の医学を研究している。","type":"adjective","meaning_category":"relating to ethnic group"},{"sentence":"The **Miao** language belongs to the Hmong-Mien language family.","translation":"ミャオ語は、ミャオ・ヤオ語族に属している。","type":"adjective","meaning_category":"relating to language"}]}