{"word":"sigmoidoscope","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"S状結腸鏡","english_definition":"A medical instrument consisting of a flexible tube with a light and camera, used to examine the sigmoid colon.","examples":[{"sentence":"The doctor used a sigmoidoscope to examine the patient's colon.","translation":"医師はS状結腸鏡を使って患者の結腸を検査した。"},{"sentence":"A sigmoidoscope is inserted through the anus to visualize the lower colon.","translation":"S状結腸鏡は下部結腸を観察するために肛門から挿入される。"}],"collocations":["flexible sigmoidoscope","insert a sigmoidoscope","sigmoidoscope examination","sigmoidoscope procedure"],"synonyms":["colonoscope","endoscope"],"antonyms":[]}],"etymology":{"value":"From 'sigmoid colon' (S状結腸) + '-scope' (観察する器具) + '-o-' (連結要素).","priority":"★★☆"},"pronunciation":{"ipa":"/sɪɡˈmɔɪdəskoʊp/","syllables":"sig-moi-do-scope"},"inflection":{"noun_plural":"sigmoidoscopes"},"usage_notes":{"explanation":"A sigmoidoscope is a specific type of endoscope used to visualize the sigmoid colon, which is the S-shaped part of the large intestine closest to the rectum and anus. Sigmoidoscopy is a medical procedure that uses this instrument to screen for abnormalities, such as polyps, inflammation, or cancer, in the lower colon.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sigmoidoscope was used to examine the stomach.","correct":"✓ The sigmoidoscope was used to examine the colon.","note":"A sigmoidoscope is specifically for the colon, not the stomach."},{"incorrect":"✗ Sigmoidoscopy is a treatment for colon cancer.","correct":"✓ Sigmoidoscopy is a screening tool for colon cancer.","note":"Sigmoidoscopy is primarily a diagnostic and screening tool, not a treatment."}],"priority":"★☆☆"},"related_words":{"derivatives":["sigmoidoscopy (noun: S状結腸鏡検査)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sigmoidoscope' is a specialized medical term referring to an instrument used to examine the sigmoid colon. Understanding this term requires knowledge of medical terminology and anatomy. It is typically encountered in medical contexts or discussions related to gastroenterology and colorectal health."},"example_sentences":[{"sentence":"The gastroenterologist recommended a sigmoidoscope to investigate the patient's symptoms.","translation":"消化器内科医は、患者の症状を調べるためにS状結腸鏡検査を推奨した。","type":"noun","meaning_category":"medical instrument"},{"sentence":"During the sigmoidoscope procedure, the doctor identified a small polyp.","translation":"S状結腸鏡検査中に、医師は小さなポリープを発見した。","type":"noun","meaning_category":"medical instrument"}]}