{"word":"nontarnished","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a metal or other surface) not having lost its luster or become dull due to oxidation or other chemical reactions; remaining bright and shiny.","english_definition":"Not tarnished; remaining bright and shiny; not having lost luster due to oxidation or other chemical reactions.","examples":[{"sentence":"The silver cutlery remained nontarnished even after years of use.","translation":"その銀製のカトラリーは、長年使用した後でも輝きを失わず、くすんでいませんでした。"},{"sentence":"The nontarnished brass fixtures added a touch of elegance to the room.","translation":"くすんでいない真鍮製の備品が、部屋に上品さを添えていました。"}],"collocations":["nontarnished silver","nontarnished brass","nontarnished surface","nontarnished appearance"],"synonyms":["untarnished","unblemished","shiny","bright","gleaming","lustrous"],"antonyms":["tarnished","dull","oxidized","lackluster"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'tarnished'. 'Tarnished' itself comes from the Old French word 'ternir', meaning 'to make dull'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌnɒnˈtɑːrnɪʃt/","syllables":"non-tar-nished"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Nontarnished' is a descriptive adjective used to indicate that a surface, typically metal, has retained its original shine and has not become dull or discolored due to oxidation or other chemical processes. It suggests a state of preservation and cleanliness. It is less commonly used than 'untarnished' but carries the same meaning.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The nontarnished is important for jewelry.","correct":"✓ Maintaining a nontarnished surface is important for jewelry.","note":"'Nontarnished' is an adjective and needs to modify a noun or be part of a descriptive phrase. It cannot stand alone as a subject."},{"incorrect":"✗ He cleaned the metal to make it nontarnished.","correct":"✓ He cleaned the metal to keep it nontarnished.","note":"The adjective describes a state, not an action. Use 'keep it nontarnished' or 'restore it to a nontarnished state'."}],"priority":"N/A"},"related_words":{"derivatives":["tarnish (verb, noun)","untarnished (adjective)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Nontarnished' is a relatively uncommon adjective that means something has not lost its shine or become dull, typically due to chemical reactions like oxidation. It's often used to describe metals that have been well-maintained. Because it's formed with the prefix 'non-', it's fairly easy to understand if you know what 'tarnished' means. It is more formal than common synonyms like 'shiny' or 'bright'."},"example_sentences":[{"sentence":"The museum showcased a collection of nontarnished ancient coins.","translation":"その博物館は、くすんでいない古代のコインのコレクションを展示していました。","type":"adjective","meaning_category":"appearance"},{"sentence":"Regular polishing helps keep the silver nontarnished.","translation":"定期的な研磨は、銀の輝きを保つのに役立ちます。","type":"adjective","meaning_category":"condition"}]}