{"word":"proximity-sensitive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"近接感知式の、近接に反応する","english_definition":"Capable of detecting or responding to the presence of nearby objects without physical contact.","examples":[{"sentence":"The smartphone has a proximity-sensitive screen that turns off when held to the ear during a call.","translation":"そのスマートフォンは、通話中に耳に当てると画面がオフになる近接感知式スクリーンを備えている。"},{"sentence":"Proximity-sensitive sensors are used in robotics to avoid collisions.","translation":"近接感知センサーは、衝突を避けるためにロボット工学で使用される。"},{"sentence":"The security system uses proximity-sensitive technology to detect intruders.","translation":"そのセキュリティシステムは、侵入者を検知するために近接感知技術を使用している。"}],"collocations":["proximity-sensitive sensor","proximity-sensitive technology","proximity-sensitive device","proximity-sensitive switch"],"synonyms":["nearness-detecting","presence-sensing","distance-sensitive"],"antonyms":["contact-sensitive","touch-sensitive","insensitive"],"related_words":["proximity","sensor","sensitive","detection","range","field","infrared","ultrasonic","capacitive"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'proximity' (the state of being near) and 'sensitive' (responsive to stimuli).","priority":"★★★"},"pronunciation":{"ipa":"/prɒkˈsɪmɪti ˈsɛnsɪtɪv/","syllables":"prox-im-i-ty sen-si-tive"},"inflection":{"notes":"Adjectives do not typically inflect in English. Comparative and superlative forms can be created using 'more' and 'most' or '-er' and '-est', but this is uncommon for compound adjectives like this one.","comparative":"more proximity-sensitive","superlative":"most proximity-sensitive"},"usage_notes":{"explanation":"'Proximity-sensitive' is used to describe devices or systems that can detect the presence of objects within a certain range without needing to physically touch them. This is often achieved using sensors that measure distance, such as infrared, ultrasonic, or capacitive sensors. The term is commonly used in the context of technology, robotics, and security systems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The door is sensitive to proximity.","correct":"✓ The door is proximity-sensitive.","note":"The correct phrasing is 'proximity-sensitive' as a single adjective. Using 'sensitive to proximity' is grammatically correct but less common and less concise."},{"incorrect":"✗ The proximity sensor is very sensitive.","correct":"✓ The proximity sensor is proximity-sensitive.","note":"While a proximity sensor is indeed sensitive, using 'proximity-sensitive' specifically emphasizes its ability to detect nearness."}],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Mostly used in technical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Proximity-sensitive' is a technical term used to describe something that can detect when an object is close to it without needing to touch it. It's often used for sensors in phones, robots, or security systems. Because it's a technical term, it's more common in specialized texts and less common in everyday conversation.","priority":"★★★"},"example_sentences":[{"sentence":"The elevator doors are equipped with a proximity-sensitive system to prevent them from closing on passengers.","translation":"そのエレベーターのドアには、乗客にぶつかって閉まるのを防ぐための近接感知式システムが搭載されている。","type":"general","meaning_category":"general"},{"sentence":"The robot uses proximity-sensitive infrared sensors to navigate its environment.","translation":"そのロボットは、周囲を移動するために近接感知式赤外線センサーを使用している。","type":"technical","meaning_category":"technical"},{"sentence":"The alarm system features proximity-sensitive detectors that trigger when someone approaches the property.","translation":"その警報システムは、誰かが敷地に近づくと作動する近接感知式探知機を備えている。","type":"security","meaning_category":"security"}]}