{"word":"disaffirmance","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)否認、破棄、無効の主張 (特に契約における未成年者の権利行使)","english_definition":"The act of disaffirming; repudiation; denial; the act by which a person who was not bound by an agreement when it was made renders it of no effect. Specifically, the act of a minor by which he rejects a contract he made during minority.","examples":[{"sentence":"The minor's disaffirmance of the contract released them from their obligations.","translation":"未成年者による契約の否認は、彼らを義務から解放した。"},{"sentence":"The company sought disaffirmance of the agreement due to unforeseen circumstances.","translation":"会社は、予期せぬ状況により、合意の否認を求めた。"}],"collocations":["disaffirmance of contract (契約の否認)","right of disaffirmance (否認権)","exercise disaffirmance (否認権を行使する)"],"synonyms":["repudiation","rejection","rescission","revocation","nullification","invalidation"],"antonyms":["affirmance","ratification","validation","confirmation"]}],"etymology":{"value":"From disaffirm + -ance.  'Disaffirm' comes from Old French 'desafirmer', meaning 'to contradict, deny', from Latin 'dis-' (not) + 'affirmare' (to affirm). The suffix '-ance' is used to form nouns denoting an action, process, or state.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪsəˈfɜːrməns/","syllables":"dis-af-firm-ance"},"inflection":{"noun_plural":"disaffirmances"},"usage_notes":{"explanation":"'Disaffirmance' is primarily a legal term, most commonly used in the context of contracts involving minors. It refers to the act of a minor (a person under the legal age of majority) rejecting or voiding a contract they entered into while they were still a minor. This right is designed to protect minors from being taken advantage of due to their lack of experience and judgment. The term can also be used more broadly to refer to the rejection or denial of any agreement or obligation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The disaffirmance was affirmed by the court.","correct":"✓ The disaffirmance was upheld by the court.","note":"'Affirmed' is usually used in the context of a higher court affirming a lower court's decision. Use 'upheld' to indicate that the court supported the disaffirmance."},{"incorrect":"✗ He disaffirmed the contract after he turned 21.","correct":"✓ He disaffirmed the contract before he turned 18. / ✓ He ratified the contract after he turned 18.","note":"Minors can typically only disaffirm contracts *during* their minority or within a reasonable time after reaching the age of majority. After that, their actions might be seen as ratification (affirming) of the contract."}],"priority":"★★☆"},"related_words":{"derivatives":["disaffirm (verb: to reject, deny, or repudiate)","disaffirming (adjective: the act of rejecting, denying, or repudiating)"],"phrasal_verbs":[],"related_legal_terms":["ratification (the act of affirming a contract)","voidable (capable of being voided)","minor (a person under the legal age of majority)","contract (a legally binding agreement)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Very specialized legal vocabulary)","frequency_google_ngram":"Very low frequency. Primarily used in legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Disaffirmance' is a technical legal term referring to the act of rejecting or nullifying a contract, especially by a minor. It's not a word used in everyday conversation. Understanding requires familiarity with legal concepts like contracts, minors' rights, and the ability to void agreements. The word's etymology and usage are specific to legal contexts, making it a challenging term for non-experts."},"example_sentences":[{"sentence":"The court considered the evidence before ruling on the disaffirmance.","translation":"裁判所は、否認に関する判決を下す前に証拠を検討した。","type":"general","meaning_category":"否認"},{"sentence":"Upon reaching adulthood, she had the option of disaffirmance or ratification of the contract.","translation":"成人になると、彼女は契約を否認または批准する選択肢があった。","type":"legal","meaning_category":"法律"},{"sentence":"The disaffirmance of the agreement led to a lengthy legal battle.","translation":"合意の否認は、長期にわたる法廷闘争につながった。","type":"legal","meaning_category":"法律"}]}