{"word":"colorectitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"大腸直腸炎","english_definition":"Inflammation of both the colon and the rectum.","examples":[{"sentence":"Colorectitis can be caused by various factors, including infections and inflammatory bowel diseases.","translation":"大腸直腸炎は、感染症や炎症性腸疾患を含む様々な要因によって引き起こされる可能性があります。"},{"sentence":"Symptoms of colorectitis may include abdominal pain, diarrhea, and rectal bleeding.","translation":"大腸直腸炎の症状には、腹痛、下痢、および直腸出血が含まれる場合があります。"}],"collocations":["acute colorectitis (急性大腸直腸炎)","chronic colorectitis (慢性大腸直腸炎)","infectious colorectitis (感染性大腸直腸炎)","ulcerative colorectitis (潰瘍性大腸直腸炎)"],"synonyms":["proctocolitis","rectocolitis"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'colo-' (referring to the colon), 'rect-' (referring to the rectum), and '-itis' (denoting inflammation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkoʊləˌrɛkˈtaɪtɪs/","syllables":"co-lo-rec-ti-tis"},"inflection":{"noun_plural":"colorectitides (less common)"},"usage_notes":{"explanation":"Colorectitis is a medical term specifically indicating inflammation affecting both the colon and the rectum simultaneously. It is often used to describe the condition when it's not clear whether the inflammation primarily affects one or both organs. Proctocolitis and rectocolitis are often used interchangeably with colorectitis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Colorectitis only affects the colon.","correct":"✓ Colorectitis affects both the colon and the rectum.","note":"Colorectitis, by definition, involves inflammation of both the colon and the rectum. If only the colon is affected, it's colitis; if only the rectum is affected, it's proctitis."}],"priority":"★★☆"},"related_words":{"derivatives":["colitis (大腸炎)","proctitis (直腸炎)","inflammatory bowel disease (IBD) (炎症性腸疾患)","ulcerative colitis (潰瘍性大腸炎)","Crohn's disease (クローン病)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Colorectitis' is a medical term referring to the inflammation of both the colon and rectum. It's a more specific term than colitis (inflammation of the colon) or proctitis (inflammation of the rectum) because it indicates that both areas are affected. It is often associated with inflammatory bowel diseases (IBD) such as ulcerative colitis or Crohn's disease, but can also be caused by infections or other factors. Symptoms often include abdominal pain, diarrhea, and rectal bleeding. Diagnosis typically involves colonoscopy and biopsy. Because it is a medical term, it is primarily used in medical contexts.","priority":"★★★"},"example_sentences":[{"sentence":"The patient was diagnosed with severe colorectitis after a colonoscopy revealed extensive inflammation.","translation":"患者は、大腸内視鏡検査で広範囲の炎症が明らかになった後、重度の大腸直腸炎と診断されました。","type":"medical","meaning_category":"inflammation"},{"sentence":"Infectious colorectitis is often treated with antibiotics.","translation":"感染性大腸直腸炎は、しばしば抗生物質で治療されます。","type":"medical","meaning_category":"inflammation"}]}