{"word":"antiphysically","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"反物理的に、物理法則に反して","english_definition":"In a manner that is contrary to the laws of physics; in a way that defies physical principles.","examples":[{"sentence":"The magician seemed to move objects antiphysically across the stage.","translation":"手品師は、舞台上で物体を反物理的に移動させているように見えた。"},{"sentence":"The character in the science fiction novel possessed the ability to travel antiphysically through walls.","translation":"そのSF小説の登場人物は、壁を反物理的に通り抜ける能力を持っていた。"}],"collocations":["move antiphysically","travel antiphysically","behave antiphysically"],"synonyms":["supernaturally","unnaturally","miraculously","impossibly"],"antonyms":["physically","naturally","realistically"]}],"etymology":{"value":"'anti-' (against) + 'physically' (in a physical manner).","priority":"★★☆"},"pronunciation":{"ipa":"ˌæntiˈfɪzɪkli","syllables":"an-ti-phys-i-cal-ly"},"inflection":{},"usage_notes":{"explanation":"'Antiphysically' is used to describe actions or phenomena that violate or contradict the established laws of physics. It often appears in science fiction, fantasy, or discussions about the supernatural. The term implies that something is happening in a way that is not possible according to our current understanding of the physical world.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["antiphysical (adjective)"],"related_terms":["physics","physical","metaphysical"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'antiphysically' is a relatively uncommon word, primarily used in contexts that involve science fiction, fantasy, or theoretical discussions about phenomena that defy the laws of physics. It suggests something occurring in a manner that is impossible or highly improbable according to our understanding of the physical world. Because of its specialized usage, it is more likely to be encountered in advanced texts or discussions. Understanding the prefixes 'anti-' and the root word 'physical' helps in deciphering its meaning."},"example_sentences":[{"sentence":"The ghost seemed to float antiphysically through the closed door.","translation":"その幽霊は、閉じたドアを反物理的に浮遊しているように見えた。","type":"general","meaning_category":"contrary to physics"},{"sentence":"The spaceship in the movie moved antiphysically, exceeding the speed of light without any apparent consequences.","translation":"映画の中の宇宙船は、反物理的に移動し、明らかな結果もなく光速を超えていた。","type":"science fiction","meaning_category":"defying physical principles"}]}