{"word":"translinguate","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"(言語学)複数の言語を流暢に使いこなし、言語間を自在に行き来しながら思考・表現すること。","english_definition":"(Linguistics) To perform translingualism; to move fluidly between languages, leveraging linguistic and cultural resources across multiple languages to communicate effectively.","examples":[{"sentence":"The author translinguates effortlessly, weaving Spanish and English phrases into her narrative.","translation":"その作家は難なく複数の言語を使いこなし、スペイン語と英語のフレーズを物語に織り交ぜている。"},{"sentence":"In multilingual classrooms, students often translinguate to help each other understand complex concepts.","translation":"多言語教室では、生徒たちは複雑な概念を理解し合うために、しばしば複数の言語を使いこなす。"}],"collocations":["translinguate between languages (言語間を使いこなす)","translinguate in the classroom (教室で複数の言語を使いこなす)","translinguate effectively (効果的に複数の言語を使いこなす)"],"synonyms":["code-switch","multilingualize"],"antonyms":["monolingualize"],"notes":"This term is often used in the context of multilingualism and language pedagogy."}],"etymology":{"value":"Derived from the prefix 'trans-' (across, beyond) and 'lingua' (language), suggesting movement or operation across languages.","priority":"★★☆"},"pronunciation":{"ipa":"/trænzˈlɪŋɡwət/","syllables":"trans-lin-gu-ate"},"inflection":{"verb_forms":{"present_simple":["translinguate","translinguats"],"past_simple":"translinguated","past_participle":"translinguated","present_participle":"translinguating"}},"usage_notes":{"explanation":"'Translinguate' emphasizes the dynamic and creative use of multiple languages, rather than simply translating between them. It highlights the ability to draw on all linguistic resources to construct meaning. It is often used in academic discussions of multilingualism and language teaching.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He translinguats from English to French perfectly.","correct":"✓ He translinguats between English and French fluently.","note":"'Translinguate' implies a more fluid and integrated use of languages than simply translating from one to another. Use 'between' to indicate the movement between languages, and 'fluently' or 'effectively' to describe the skill. "},{"incorrect":"✗ Translinguating is just about knowing many languages.","correct":"✓ Translinguating is about using all your languages creatively to communicate.","note":"Translinguating is not just about knowing multiple languages, but about using them dynamically and creatively to communicate effectively."}],"priority":"★★☆"},"related_words":{"derivatives":["translingual (adjective)","translingualism (noun)"],"related_terms":["code-switching","multilingualism","plurilingualism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Term primarily used in academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Translinguate' is a specialized term used in linguistics and education to describe the practice of using multiple languages fluidly and creatively. It goes beyond simple translation, emphasizing the ability to draw on all linguistic resources to communicate effectively. This term is most often encountered in academic discussions of multilingualism and language pedagogy."},"example_sentences":[{"sentence":"Many bilingual individuals translinguate naturally in their daily conversations.","translation":"多くのバイリンガル者は、日常会話の中で自然に複数の言語を使いこなす。","type":"verb","meaning_category":"言語を使いこなす"},{"sentence":"Teachers can encourage students to translinguate in the classroom to foster deeper understanding.","translation":"教師は、より深い理解を促進するために、教室で生徒たちが複数の言語を使いこなすことを奨励できる。","type":"verb","meaning_category":"言語を使いこなす"},{"sentence":"Translinguating allows for more nuanced and culturally rich communication.","translation":"複数の言語を使いこなすことで、よりニュアンスに富み、文化的に豊かなコミュニケーションが可能になる。","type":"verb","meaning_category":"言語を使いこなす"}]}