{"word":"hachuring","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(地図製作、製図) 陰影線、ハッチング","english_definition":"(cartography, technical drawing) the use of short parallel lines to indicate slope on a map or in a technical drawing.","examples":[{"sentence":"The hachuring on the map clearly showed the steepness of the mountains.","translation":"地図上の陰影線は山の傾斜の急峻さを明確に示していた。"}],"collocations":["contour hachuring","relief hachuring"],"synonyms":["hatching","shading"],"antonyms":[]}],"etymology":{"value":"Derived from the French word 'hachure', which means a short stroke or line.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhæʃərɪŋ/","syllables":"hash-ur-ing"},"inflection":{"noun_plural":"hachurings"},"usage_notes":{"explanation":"Hachuring is a technique used in cartography and technical drawing to represent relief or slope. It involves drawing short, parallel lines, with the thickness and density of the lines indicating the steepness of the slope. Steeper slopes are represented by thicker and denser lines, while gentler slopes are represented by thinner and more widely spaced lines.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The map used contours instead of hachuring to show elevation.","correct":"✓ The map used contours instead of hachuring to show relief.","note":"Hachuring specifically shows relief (slope), while contours show elevation (height above sea level)."},{"incorrect":"✗ Hachuring is the same as color shading.","correct":"✓ Hachuring is a type of line shading.","note":"Hachuring uses lines, not colors, to create shading effects."}],"priority":"★★☆"},"related_words":{"derivatives":["hachure (noun: a single line used in hachuring; verb: to apply hachures)"],"related_terms":["contour line","topography","cartography","technical drawing"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hachuring' refers to a specialized technique in mapmaking and technical drawings. It uses short, parallel lines to show how steep a slope is. The closer and thicker the lines, the steeper the slope. This term is not commonly used outside of these specific fields, making it a more advanced vocabulary word."},"example_sentences":[{"sentence":"The detailed hachuring on the old map made the mountainous terrain appear very rugged.","translation":"古い地図上の詳細な陰影線は、山岳地帯を非常に険しく見せていた。","type":"noun","meaning_category":"陰影線"},{"sentence":"The cartographer carefully added hachuring to the map to represent the hills and valleys.","translation":"地図製作者は、丘や谷を表すために、地図に注意深く陰影線を追加した。","type":"noun","meaning_category":"陰影線"},{"sentence":"Early maps often relied on hachuring as the primary method for depicting relief.","translation":"初期の地図は、地形を描写する主な方法として陰影線に頼ることが多かった。","type":"noun","meaning_category":"陰影線"}]}