{"word":"perceptibility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"知覚できること、感知できること、識別できること、可視性、聴取性","english_definition":"The quality of being perceptible; the capability of being perceived or detected by the senses.","examples":[{"sentence":"The perceptibility of the faint signal was improved by reducing background noise.","translation":"微弱な信号の知覚性を、背景ノイズを減らすことで改善した。"},{"sentence":"The artist played with light and shadow to enhance the perceptibility of the sculpture's details.","translation":"芸術家は彫刻の細部の知覚性を高めるために光と影を操った。"},{"sentence":"The perceptibility of the warning signs was crucial for preventing accidents.","translation":"警告標識の知覚性は、事故を防ぐために非常に重要だった。"}],"collocations":["enhance perceptibility (知覚性を高める)","improve perceptibility (知覚性を改善する)","low perceptibility (低い知覚性)","high perceptibility (高い知覚性)"],"synonyms":["visibility","noticeability","detectability","discernibility","observability","recognizability"],"antonyms":["imperceptibility","invisibility","undetectability","obscurity"]}],"etymology":{"value":"Derived from the word 'perceptible', which comes from the Latin 'percipere' meaning 'to perceive' or 'to grasp with the mind or senses'. The suffix '-ibility' denotes the quality or state of being.","priority":"★★☆"},"pronunciation":{"ipa":"/pərˌsɛptəˈbɪləti/","syllables":"per-cep-ti-bil-i-ty (6 syllables)"},"inflection":{"noun_plural":"perceptibilities (rarely used)"},"usage_notes":{"explanation":"'Perceptibility' refers to how easily something can be noticed or understood through the senses. It's often used in technical or scientific contexts when discussing how well signals, objects, or information can be detected. It is less common in everyday conversation than words like 'visibility' or 'noticeability'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The perceptibility of the object was very good because it was very perceptive.","correct":"✓ The perceptibility of the object was very good because it was very visible.","note":"'Perceptibility' refers to how easily something is perceived, while 'perceptive' describes someone with a keen ability to perceive things. Use 'visible' or 'noticeable' instead of 'perceptive' in this context."},{"incorrect":"✗ The perceptibility of the sound was very low, so I couldn't perceive it.","correct":"✓ The audibility of the sound was very low, so I couldn't perceive it.","note":"When referring specifically to the ability to hear something, 'audibility' is more appropriate than 'perceptibility', which is a more general term for sensory perception."}],"priority":"★★☆"},"related_words":{"derivatives":["perceptible (adjective: capable of being perceived)","perceive (verb: to become aware of through the senses)","perception (noun: the ability to see, hear, or become aware of something through the senses)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - More common in academic or technical writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Perceptibility' is a formal term that describes how easily something can be noticed or understood through the senses. It's often used in technical or scientific contexts. For example, you might talk about the 'perceptibility' of a warning sign, meaning how easy it is to see and understand the sign. It's not a word you'd use in everyday conversation as much as 'visibility' or 'noticeability'."},"example_sentences":[{"sentence":"The **perceptibility** of the data on the screen was affected by the glare.","translation":"画面上のデータの知覚性は、まぶしさによって影響を受けた。","type":"noun","meaning_category":"知覚できること"},{"sentence":"The engineers worked to increase the **perceptibility** of the radar signals.","translation":"エンジニアたちはレーダー信号の知覚性を高めるために尽力した。","type":"noun","meaning_category":"感知できること"},{"sentence":"The **perceptibility** of the differences between the two paintings was subtle.","translation":"2つの絵画の間の違いの知覚性は微妙だった。","type":"noun","meaning_category":"識別できること"},{"sentence":"The **perceptibility** of the aircraft was reduced by using stealth technology.","translation":"航空機の可視性は、ステルス技術を使用することで低下した。","type":"noun","meaning_category":"可視性"}]}