{"word":"connectedly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"関連して、つながりを持って、論理的に首尾一貫して","english_definition":"In a connected manner; with logical coherence or in a way that shows a relationship between things.","examples":[{"sentence":"The speaker presented his arguments connectedly, making it easy to follow his reasoning.","translation":"講演者は彼の議論を関連性を持って提示し、彼の推論を理解しやすくした。"},{"sentence":"The events in the story are described connectedly, showing the cause-and-effect relationships.","translation":"物語の中の出来事はつながりを持って記述されており、因果関係を示している。"}],"collocations":["speak connectedly","describe connectedly","write connectedly","argue connectedly"],"synonyms":["coherently","logically","consistently","relatedly","jointly","associatedly"],"antonyms":["disjointedly","incoherently","illogically","separately","independently"]},{"part_of_speech":"adverb","definition":"（文法的に）連結詞を使って、または連結詞によって","english_definition":"Using or by means of conjunctions or other linking words.","examples":[{"sentence":"The sentences were written connectedly, using conjunctions to link related ideas.","translation":"文は連結詞を使ってつながりを持って書かれており、関連するアイデアを結びつけている。"}],"collocations":["write connectedly","speak connectedly"],"synonyms":["conjunctively","linkingly"],"antonyms":["disjunctively"]}],"etymology":{"value":"Formed from the adjective 'connected' with the addition of the suffix '-ly'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/kəˈnɛktɪdlɪ/","syllables":"con-nect-ed-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Connectedly' is used to describe how something is presented or expressed, emphasizing the logical or relational links between its parts. It suggests a clear and coherent structure. It is not a commonly used word, and its absence is often replaced by phrases like 'in a connected way' or 'logically'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He connectedly the wires.","correct":"He connected the wires.","note":"'Connectedly' is an adverb and cannot be used as a verb. The verb form is 'connected'."},{"incorrect":"The data was connectedly, making it hard to understand.","correct":"The data was presented disjointedly, making it hard to understand.","note":"If the data is hard to understand, 'disjointedly' or 'incoherently' would be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["connect (verb)","connected (adjective)","connection (noun)","connectivity (noun)"],"phrases":["in a connected way","in a coherent manner"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Connectedly' is a relatively rare adverb used to describe something that is presented in a logical, coherent, and interrelated manner. It implies that the different parts are linked together in a way that makes sense and is easy to follow. Due to its infrequent use, it is more common to use phrases like 'in a connected way' or 'coherently' instead. It is most often found in formal writing or academic contexts."},"example_sentences":[{"sentence":"The author presented the historical events connectedly, making it easy to understand the sequence of events.","translation":"著者は歴史的な出来事を関連性を持って提示し、出来事の順序を理解しやすくした。","type":"general","meaning_category":"relatedly"},{"sentence":"She spoke connectedly about her research, linking each finding to the overall hypothesis.","translation":"彼女は自分の研究について、各発見を全体的な仮説に関連付けながら、つながりを持って語った。","type":"academic","meaning_category":"coherently"},{"sentence":"The software allows the different databases to be accessed and analyzed connectedly.","translation":"そのソフトウェアを使用すると、さまざまなデータベースにアクセスして、関連性を持って分析できる。","type":"technical","meaning_category":"associatedly"}]}