{"word":"stow-boating","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"The act of concealing oneself on a boat to travel without paying or being detected.","english_definition":"The act of traveling as a stowaway on a boat.","examples":[{"sentence":"Stow-boating is a risky way to travel, as stowaways can face serious legal consequences if caught.","translation":"密航は危険な旅行方法であり、密航者は捕まると重大な法的結果に直面する可能性があります。"},{"sentence":"The young man's stow-boating adventure ended when the ship's crew discovered him hiding in the cargo hold.","translation":"その若者の密航の冒険は、船の乗組員が彼が貨物倉に隠れているのを発見したときに終わりました。"}],"collocations":["illegal stow-boating","risky stow-boating","attempted stow-boating"],"synonyms":["stowing away","hitchhiking on a boat","clandestine sea travel"],"antonyms":["legal passage","authorized travel"],"notes":"This term is relatively uncommon and may not be widely recognized."}],"etymology":{"value":"Derived from 'stowaway' (someone who hides on a ship or aircraft to travel without paying) and 'boating' (the activity of traveling in a boat).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstoʊˌboʊtɪŋ/","syllables":"stow-boat-ing"},"inflection":{"noun_plural":"stow-boatings"},"usage_notes":{"explanation":"'Stow-boating' specifically refers to the act of being a stowaway on a boat, distinguishing it from other forms of stowaway travel (e.g., on airplanes). It implies an attempt to travel secretly and without authorization via a water vessel.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was stow-boating on the plane.","correct":"✓ He was stow-boating on the ship.","note":"'Stow-boating' is specific to boats; for planes, use 'stowaway' or 'stowing away' on a plane."}],"priority":"★☆☆"},"related_words":{"derivatives":["stowaway","boat","boating"],"phrasal_verbs":[],"related_terms":["smuggling","illegal immigration"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stow-boating' is a specialized term referring to the act of being a stowaway on a boat. It is less commonly used than 'stowaway' in general, and understanding requires familiarity with maritime travel and illegal activities. The term is straightforward to understand if the components ('stowaway' and 'boating') are known."},"example_sentences":[{"sentence":"The authorities are cracking down on stow-boating attempts at the port.","translation":"当局は港での密航の試みを厳しく取り締まっています。","type":"noun","meaning_category":"illegal travel"},{"sentence":"Stow-boating can lead to severe penalties if the individual is caught.","translation":"密航は、個人が捕まった場合、重い処罰につながる可能性があります。","type":"noun","meaning_category":"illegal travel"}]}