{"word":"mastitis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"乳腺炎","english_definition":"inflammation of the mammary gland in the breast, typically due to bacterial infection via a cracked nipple.","examples":[{"sentence":"She developed mastitis after breastfeeding her baby.","translation":"彼女は赤ちゃんに授乳した後、乳腺炎を発症しました。"},{"sentence":"Mastitis can be treated with antibiotics.","translation":"乳腺炎は抗生物質で治療できます。"},{"sentence":"Symptoms of mastitis include breast pain, swelling, and redness.","translation":"乳腺炎の症状には、乳房の痛み、腫れ、発赤などがあります。"}],"collocations":["acute mastitis (急性乳腺炎)","chronic mastitis (慢性乳腺炎)","puerperal mastitis (産褥乳腺炎)","lactational mastitis (授乳性乳腺炎)","treat mastitis (乳腺炎を治療する)","prevent mastitis (乳腺炎を予防する)"],"synonyms":["mammary inflammation","breast infection"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'mastos' (breast) and '-itis' (inflammation).","priority":"★★★"},"pronunciation":{"ipa":"/mæˈstaɪtɪs/","syllables":"mas-ti-tis"},"inflection":{"noun_plural":"mastitides (less common), mastitises"},"usage_notes":{"explanation":"Mastitis is most commonly associated with breastfeeding women, but it can also occur in non-breastfeeding women and, rarely, in men. It's important to seek medical attention if you suspect you have mastitis, as early treatment can prevent complications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a mastitis in my chest.","correct":"✓ I have mastitis in my breast.","note":"The correct anatomical term is 'breast,' not 'chest,' when referring to the mammary gland. While chest pain can be associated, the inflammation is specifically in the breast tissue."},{"incorrect":"✗ Mastitis is always caused by a blocked milk duct.","correct":"✓ Mastitis can be caused by a blocked milk duct, but it's often due to a bacterial infection.","note":"While blocked milk ducts can contribute to mastitis, bacterial infection is a common cause. Not all cases are solely due to blockage."}],"priority":"★★☆"},"related_words":{"derivatives":["mastitic (adjective: relating to or affected by mastitis)"],"phrasal_verbs":[],"medical_terms":["cellulitis (蜂窩織炎: related skin infection)","abscess (膿瘍: a complication of untreated mastitis)","galactocele (乳瘤: milk-filled cyst in the breast)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (medical context)","frequency_google_ngram":"Low (primarily used in medical contexts)","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Mastitis' refers to the inflammation of breast tissue, most often occurring in women who are breastfeeding. It's typically caused by a bacterial infection entering through a cracked nipple, although blocked milk ducts can also contribute. Symptoms include breast pain, swelling, redness, and fever. Treatment usually involves antibiotics. While the term is primarily used in a medical context, understanding it is important for women's health.","priority":"★★★"},"example_sentences":[{"sentence":"She felt a sharp pain in her breast and suspected she had mastitis.","translation":"彼女は乳房に鋭い痛みを感じ、乳腺炎を疑った。","type":"general","meaning_category":"symptoms"},{"sentence":"The doctor prescribed antibiotics to treat her mastitis.","translation":"医師は彼女の乳腺炎を治療するために抗生物質を処方した。","type":"treatment","meaning_category":"treatment"},{"sentence":"Proper breastfeeding techniques can help prevent mastitis.","translation":"適切な授乳方法で乳腺炎を予防することができます。","type":"prevention","meaning_category":"prevention"},{"sentence":"Untreated mastitis can lead to a breast abscess.","translation":"治療せずに放置すると、乳腺炎は乳房膿瘍につながる可能性があります。","type":"complication","meaning_category":"complication"}]}