{"word":"Boogaloo","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ブーガルー：1960年代に流行したラテン音楽とR&Bを融合させた音楽とダンスのジャンル。","english_definition":"A genre of Latin music and dance that was popular in the 1960s, blending Latin rhythms with R&B and soul music.","examples":[{"sentence":"The boogaloo craze swept through New York City in the mid-1960s.","translation":"1960年代半ば、ブーガルー熱がニューヨーク市を席巻した。"},{"sentence":"Pete Rodriguez was one of the leading figures in the boogaloo movement.","translation":"ピート・ロドリゲスはブーガルー運動の主要人物の一人だった。"}],"collocations":["play boogaloo","dance the boogaloo","boogaloo music","Latin boogaloo"],"synonyms":["Latin soul","shing-a-ling"],"antonyms":[]},{"part_of_speech":"noun","definition":"(俗語)内戦、または政府に対する暴力的な反乱を指すインターネットスラング。右翼過激派や反政府組織が使用することが多い。","english_definition":"(slang) An internet slang term, often used by right-wing extremists and anti-government groups, to refer to a second American civil war or a violent uprising against the government.","examples":[{"sentence":"Online, they were discussing the coming boogaloo.","translation":"オンラインで、彼らは来るべきブーガルーについて議論していた。"},{"sentence":"The term 'boogaloo' has been co-opted by extremist groups to promote violence.","translation":"「ブーガルー」という言葉は、過激派グループによって暴力を助長するために利用されている。"}],"collocations":["civil boogaloo","the boogaloo","boogaloo boys"],"synonyms":["civil war","revolution","uprising"],"antonyms":[]}],"etymology":{"value":"ブーガルーという言葉の語源ははっきりしていませんが、おそらく「shing-a-ling」やその他の当時のダンス用語の影響を受けています。インターネットスラングとしての用法は、2010年代後半にオンラインフォーラムで生まれ、当初は「内戦2：エレクトリック・ブーガルー」という映画のタイトルに由来するジョークでした。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbuːɡəˈluː/","syllables":"boo-ga-loo"},"inflection":{"notes":"複数形は \"boogaloos\" です。"},"usage_notes":{"explanation":"「**Boogaloo**」には2つの異なる意味があります。1つは1960年代のラテン音楽のジャンルであり、もう1つは最近インターネットスラングとして使われる、内戦や反乱を指す言葉です。スラングとしての用法は、特に右翼過激派や反政府組織によって使用されることが多く、暴力的な意味合いを持つため、注意が必要です。文脈によってどちらの意味で使われているかを判断する必要があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I love listening to boogaloo music, it's so peaceful.","correct":"✓ I love listening to boogaloo music, it's so lively and energetic.","note":"ブーガルー音楽は一般的に活発でエネルギッシュな音楽であり、「平和な」というイメージとは異なります。"},{"incorrect":"✗ He mentioned the boogaloo at the family dinner, and everyone understood he meant the dance.","correct":"✓ He mentioned the boogaloo at the family dinner, and caused a very awkward silence.","note":"家族の夕食で「ブーガルー」という言葉を使うと、スラングの意味で解釈され、気まずい雰囲気を作り出す可能性があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["boogalooer (ブーガルーを踊る人、またはブーガルー音楽を演奏する人)"],"phrases":["Electric Boogaloo (映画のタイトル、スラングの語源)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語またはスラング)","frequency_google_ngram":"低頻度 (Low frequency) - 一般的な会話ではあまり使われません。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Boogaloo**」という言葉は、文脈によって大きく意味が異なります。1960年代の音楽ジャンルを指す場合は、ラテン音楽とR&Bの融合という文化的な背景を理解している必要があります。一方、インターネットスラングとして使われる場合は、右翼過激派や反政府組織が内戦や暴力的な反乱を指す隠語であることを知っておく必要があります。このスラングは非常にデリケートな話題に関連するため、使用には十分な注意が必要です。"},"example_sentences":[{"sentence":"The band played a set of classic boogaloo tunes.","translation":"そのバンドは古典的なブーガルーの曲を演奏した。","type":"noun","meaning_category":"音楽ジャンル"},{"sentence":"Some online groups are openly advocating for a boogaloo.","translation":"一部のオンライングループは公然とブーガルー（内戦）を提唱している。","type":"noun","meaning_category":"スラング"}]}