{"word":"substantialization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"実質化、具体化、実体化","english_definition":"The act or process of making something substantial or real; the process of giving concrete form to something abstract.","examples":[{"sentence":"The substantialization of the project required significant funding.","translation":"そのプロジェクトの実質化には多額の資金が必要だった。"},{"sentence":"The artist aimed for the substantialization of emotions through sculpture.","translation":"その芸術家は彫刻を通して感情の具体化を目指した。"},{"sentence":"The substantialization of abstract concepts into tangible products is a key aspect of innovation.","translation":"抽象的な概念を具体的な製品に実体化することが、イノベーションの重要な側面である。"}],"collocations":["substantialization of a plan (計画の実質化)","substantialization of an idea (アイデアの具体化)","substantialization of a concept (概念の実体化)"],"synonyms":["embodiment","materialization","actualization","realization","implementation","concretion"],"antonyms":["abstraction","idealization","conceptualization"]},{"part_of_speech":"noun","definition":"(哲学)実体化、実体視","english_definition":"(Philosophy) The treatment of an abstract concept as if it were a concrete entity.","examples":[{"sentence":"The substantialization of 'justice' as a single, achievable goal can be misleading.","translation":"「正義」を単一の達成可能な目標として実体視することは誤解を招く可能性がある。"},{"sentence":"Critics argued that the theory involved the substantialization of social constructs.","translation":"批評家たちは、その理論が社会構築物の実体化を伴うと主張した。"}],"collocations":["philosophical substantialization (哲学的な実体化)","substantialization of concepts (概念の実体化)"],"synonyms":["reification","hypostatization","objectification"],"antonyms":["deconstruction","abstraction"]}],"etymology":{"value":"Derived from 'substantialize' (to make substantial), which comes from 'substantial' (having substance) + '-ize' (to make). 'Substantial' comes from Latin 'substantia' (substance).","priority":"★★☆"},"pronunciation":{"ipa":"/səbˌstænʃəlaɪˈzeɪʃən/","syllables":"sub-stan-tia-li-za-tion"},"inflection":{"noun_plural":"substantializations"},"usage_notes":{"explanation":"'Substantialization' refers to the process of making something real, concrete, or substantial. It can apply to turning abstract ideas into tangible forms, or, in philosophy, to the problematic treatment of abstract concepts as if they were real entities. The word is relatively formal and often used in academic or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The substantialization of the building was impressive.","correct":"✓ The construction of the building was impressive.","note":"'Substantialization' refers to the process of making something real or concrete, not the physical structure itself. Use 'construction' or 'building' instead."},{"incorrect":"✗ The substantialization of the problem was easy.","correct":"✓ The definition of the problem was easy.","note":"'Substantialization' is not about defining a problem, but about making something abstract into something real. Use 'definition' or 'understanding' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["substantialize (verb)","substantial (adjective)","substance (noun)"],"phrases":["turn into a substance","make real","bring to fruition"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Substantialization' is a formal and relatively uncommon word that refers to the process of making something abstract or conceptual into something concrete or real. It's often used in academic or technical contexts to describe the act of giving substance to ideas, plans, or projects. The philosophical meaning refers to treating abstract concepts as if they were real entities, which is often a critical point in philosophical discussions."},"example_sentences":[{"sentence":"The **substantialization** of their business plan required securing significant investment.","translation":"彼らの事業計画の実質化には、多額の投資を確保する必要があった。","type":"noun","meaning_category":"実質化、具体化"},{"sentence":"The philosopher warned against the **substantialization** of abstract values, arguing that it could lead to dogmatism.","translation":"その哲学者は、抽象的な価値観の実体視に警鐘を鳴らし、それが独断論につながる可能性があると主張した。","type":"noun","meaning_category":"(哲学)実体化"}]}