{"word":"belfried","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"鐘楼のある、鐘楼を備えた","english_definition":"Having a belfry; furnished with a belfry.","examples":[{"sentence":"a belfried church","translation":"鐘楼のある教会"},{"sentence":"The belfried tower stood tall against the skyline.","translation":"鐘楼のある塔が空を背景に高くそびえ立っていた。"}],"collocations":[],"synonyms":["towered","spired"],"antonyms":[]}],"etymology":{"value":"'Belfried' is derived from 'belfry,' which comes from the Middle English word 'berfrey' or 'bell-frey.' The 'bell' part is straightforward, referring to the bells housed within. The 'frey' part is thought to be related to the Old French word 'frei,' meaning 'tower' or 'scaffold.' So, a belfry is essentially a bell tower.","priority":"★★☆"},"pronunciation":{"ipa":"ˈbɛlfrid","syllables":"bel-fried"},"inflection":{},"usage_notes":{"explanation":"The word 'belfried' is primarily used as an adjective to describe a structure, typically a church or tower, that has a belfry. It's not a commonly used word in everyday conversation, but it can be found in descriptive writing or architectural contexts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["belfry (noun): A tower or part of a building in which bells are hung."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The adjective 'belfried' is a relatively uncommon word used to describe a structure that possesses a belfry (a tower or part of a building in which bells are hung). Due to its specialized usage and low frequency, it is typically encountered in more formal or descriptive contexts, such as architectural discussions or historical texts. Understanding the meaning of 'belfry' is essential to comprehending 'belfried'."},"example_sentences":[{"sentence":"The quaint village was known for its belfried chapel, a landmark visible from miles away.","translation":"その趣のある村は、何マイルも離れた場所から見えるランドマークである鐘楼のある礼拝堂で知られていました。","type":"general","meaning_category":"descriptive"},{"sentence":"The architect's design featured a belfried facade, adding a touch of historical charm to the modern building.","translation":"建築家のデザインは、鐘楼のあるファサードを特徴とし、現代的な建物に歴史的な魅力を加えていました。","type":"architectural","meaning_category":"descriptive"}]}