{"word":"Lobola","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(南部アフリカの文化における)花嫁の家族に新郎またはその家族から支払われる持参金、結婚持参金","english_definition":"(in Southern African cultures) the bride price that a groom or his family pays to the bride's family.","examples":[{"sentence":"Lobola is an important custom in many Southern African societies.","translation":"ロボールは多くのアフリカ南部社会において重要な慣習です。"},{"sentence":"The amount of lobola paid can vary depending on the bride's education and family status.","translation":"支払われるロボールの金額は、花嫁の教育や家族の地位によって異なります。"},{"sentence":"Negotiations for lobola can be complex and involve many family members.","translation":"ロボールの交渉は複雑になることがあり、多くの家族が関与します。"}],"collocations":["pay lobola","negotiate lobola","lobola negotiations","lobola ceremony"],"synonyms":["bride price","bride wealth"],"antonyms":[]}],"etymology":{"value":"ンデベレ語、ズールー語、スワジ語の「lobola」に由来する。これは牛やその他の財産を花嫁の家族に譲渡する慣習を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ləˈboʊlə/","syllables":"lo-bo-la"},"inflection":{"noun_plural":"lobolas"},"usage_notes":{"explanation":"「**Lobola**」は、アフリカ南部の特定の文化において、結婚の際に新郎またはその家族から新婦の家族に支払われる持参金を指す言葉です。これは単なる金銭のやり取りではなく、新婦の家族への敬意と感謝の気持ちを示すとともに、結婚の安定と新婦の幸福を願う意味合いがあります。ロボールの金額や内容は、新婦の家族の地位、教育、その他の要因によって異なります。現代では、ロボールの慣習は変化しつつあり、その意義や金額について議論されることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Lobola is a payment from the bride's family to the groom.","correct":"✓ Lobola is a payment from the groom's family to the bride's family.","note":"ロボールは新郎側から新婦側に支払われるものです。"},{"incorrect":"✗ Lobola is only about money.","correct":"✓ Lobola is about respect, gratitude, and the establishment of a bond between families, although it involves a payment.","note":"ロボールは単なる金銭のやり取りではなく、家族間の絆を築き、敬意を示す意味合いがあります。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"比較的低い頻度 (Relatively low frequency) - 特定の文化圏に関連する語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Lobola**」は、アフリカ南部の一部の文化における結婚に関連する特定の用語です。新郎の家族から新婦の家族への支払いであり、敬意と絆の象徴です。この言葉は、これらの文化圏外では一般的ではありません。そのため、この単語を理解するには、これらの特定の文化慣習の知識が必要です。"},"example_sentences":[{"sentence":"The young man worked hard to earn enough money for the **lobola**.","translation":"その若者はロボールのためにお金を稼ぐために一生懸命働いた。","type":"noun","meaning_category":"結婚持参金"},{"sentence":"The **lobola** negotiations were conducted with great respect and formality.","translation":"ロボールの交渉は、非常に敬意と礼儀をもって行われた。","type":"noun","meaning_category":"結婚持参金"},{"sentence":"Some argue that the custom of **lobola** should be modernized to reflect current economic realities.","translation":"ロボールの慣習は、現在の経済状況を反映するように現代化されるべきだと主張する人もいる。","type":"noun","meaning_category":"結婚持参金"}]}