{"word":"aftercoming","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"後から来る、後に続く","english_definition":"Coming after; subsequent.","examples":[{"sentence":"The aftercoming generations will benefit from our efforts.","translation":"後の世代は私たちの努力から恩恵を受けるでしょう。"},{"sentence":"He was concerned about the aftercoming consequences of his decision.","translation":"彼は自分の決定の後に続く結果を心配していました。"}],"collocations":["aftercoming generations","aftercoming events","aftercoming consequences"],"synonyms":["subsequent","following","later","succeeding"],"antonyms":["preceding","previous","former"]}],"etymology":{"value":"after + coming","priority":"★★★"},"pronunciation":{"ipa":"/ˌæftərˈkʌmɪŋ/","syllables":"af-ter-com-ing"},"inflection":{"notes":"Comparative and superlative forms are not commonly used."},"usage_notes":{"explanation":"'Aftercoming' is a relatively rare word, primarily used in formal or literary contexts to describe something that follows or comes after something else. It emphasizes the sequential nature of events or generations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The aftercoming of the rain ruined the picnic.","correct":"✓ The rain that came after ruined the picnic.","note":"'Aftercoming' is an adjective, not a noun. It should modify a noun, not be used as the subject of a sentence."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Aftercoming' is a relatively uncommon adjective used to describe something that comes after or is subsequent. It is more often found in formal writing or historical texts. Due to its rarity, it is not typically encountered in everyday language. It is important to remember that it functions as an adjective and modifies a noun."},"example_sentences":[{"sentence":"The aftercoming years proved to be prosperous for the company.","translation":"その後の数年間は、その会社にとって繁栄していることが証明されました。","type":"adjective","meaning_category":"後に続く"},{"sentence":"She pondered the aftercoming effects of her actions.","translation":"彼女は自分の行動の後に続く影響について熟考しました。","type":"adjective","meaning_category":"後に続く"}]}