{"word":"myelotherapy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脊髄療法、脊髄注射療法","english_definition":"A therapeutic method involving the injection of a substance into the spinal cord or spinal canal.","examples":[{"sentence":"Myelotherapy is sometimes used to treat chronic pain.","translation":"脊髄療法は慢性的な痛みを治療するために用いられることがある。"},{"sentence":"The doctor recommended myelotherapy as a possible treatment option.","translation":"医師は脊髄療法を可能な治療選択肢の一つとして勧めた。"}],"collocations":["undergo myelotherapy","recommend myelotherapy","use myelotherapy for treatment"],"synonyms":["spinal injection","intrathecal injection"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'myelo-' (referring to the spinal cord or bone marrow) and 'therapy' (treatment).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪəloʊˈθerəpi/","syllables":"my-e-lo-ther-a-py"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"Myelotherapy is a medical procedure that involves injecting substances directly into the spinal cord or spinal canal. It is used for various purposes, including pain management and the treatment of neurological conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Myelotherapy is a very simple procedure with no risks.","correct":"✓ Myelotherapy, like any medical procedure, carries potential risks and should be carefully considered.","note":"Myelotherapy is an invasive procedure and is not without risks. It should be approached with caution and after careful evaluation."}],"priority":"★★☆"},"related_words":{"derivatives":["myelo- (prefix relating to spinal cord or bone marrow)","therapy (treatment)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized medical term)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Myelotherapy' is a highly specialized medical term referring to a specific treatment involving injections into the spinal cord. It is not commonly used outside of medical contexts. Understanding requires familiarity with medical terminology."},"example_sentences":[{"sentence":"The patient is scheduled to undergo myelotherapy next week.","translation":"患者は来週、脊髄療法を受ける予定である。","type":"general","meaning_category":"general"},{"sentence":"Myelotherapy has shown promise in alleviating severe back pain.","translation":"脊髄療法は、重度の腰痛を緩和する上で有望であることが示されている。","type":"medical","meaning_category":"medical"}]}