{"word":"tritium","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"トリチウム（三重水素）","english_definition":"A radioactive isotope of hydrogen with one proton and two neutrons in the nucleus.","examples":[{"sentence":"Tritium is used in some self-luminous products.","translation":"トリチウムは一部の自己発光製品に使用されています。"},{"sentence":"The half-life of tritium is about 12.3 years.","translation":"トリチウムの半減期は約12.3年です。"},{"sentence":"Tritium is produced in nuclear reactors.","translation":"トリチウムは原子炉で生成されます。"}],"collocations":["tritium concentration (トリチウム濃度)","tritium decay (トリチウム崩壊)","tritium monitoring (トリチウムモニタリング)","tritium removal (トリチウム除去)","tritium water (トリチウム水)"],"synonyms":["hydrogen-3","³H"],"antonyms":[]}],"etymology":{"value":"Derived from 'tri-' (meaning three) and '-ium' (a suffix used for chemical elements), referring to the three nucleons (one proton and two neutrons) in its nucleus.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtrɪtiəm/","syllables":"tri-ti-um"},"inflection":{"noun_plural":"tritiums (rare)"},"usage_notes":{"explanation":"Tritium is a radioactive isotope of hydrogen. It's often discussed in the context of nuclear power and environmental concerns due to its presence in water discharged from nuclear facilities. While tritium poses a radiation risk, its low energy beta decay and relatively short half-life make it less dangerous than many other radioactive isotopes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Tritium is a very dangerous element, so we should avoid it completely.","correct":"✓ While tritium is radioactive, its low energy and relatively short half-life make it less dangerous than many other radioactive isotopes.","note":"Tritium's radioactivity is a concern, but its danger is often overstated compared to other radioactive materials."}],"priority":"★★☆"},"related_words":{"derivatives":["tritiated (adjective: containing tritium)"],"related_terms":["deuterium (重水素)","hydrogen (水素)","isotope (同位体)","radioactive (放射性の)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Primarily used in scientific and technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Tritium' is a specialized term primarily encountered in scientific or technical discussions, particularly those related to nuclear physics, chemistry, or environmental science. Understanding the term requires familiarity with basic concepts of atomic structure, isotopes, and radioactivity. Its use is generally limited to contexts where these concepts are relevant, making it less common in everyday language."},"example_sentences":[{"sentence":"The research team is studying the behavior of **tritium** in groundwater.","translation":"研究チームは地下水中のトリチウムの挙動を研究しています。","type":"noun","meaning_category":"isotope"},{"sentence":"The concentration of **tritium** in the sample was measured using liquid scintillation counting.","translation":"試料中のトリチウム濃度は液体シンチレーションカウンティングを用いて測定されました。","type":"noun","meaning_category":"isotope"},{"sentence":"There are concerns about the potential environmental impact of **tritium** releases from nuclear facilities.","translation":"原子力施設からのトリチウム放出の潜在的な環境への影響について懸念があります。","type":"noun","meaning_category":"isotope"}]}