{"word":"anthelions","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アリジゴク（ウスバカゲロウの幼虫）","english_definition":"plural of antlion: the larva of the antlion, which digs a conical pit in sandy soil to trap ants and other insects.","examples":[{"sentence":"Anthelions are fascinating creatures that create traps for their prey.","translation":"アリジゴクは獲物を捕らえるための罠を作る魅力的な生き物です。"}],"collocations":["antlion larva","antlion pit","trap ants"],"synonyms":["doodlebug"],"antonyms":[]}],"etymology":{"value":"\"Antlion\" is derived from the insect's predatory behavior toward ants. The name reflects the larva's habit of preying on ants, combining \"ant\" and \"lion\" to suggest a powerful predator of ants.","priority":"★★☆"},"pronunciation":{"ipa":"/æntˈlaɪənz/","syllables":"ant-li-ons"},"inflection":{"noun_plural":"anthelions"},"usage_notes":{"explanation":"\"Anthelions\" is the plural form of \"antlion,\" referring to multiple larvae of the insect known for creating pitfall traps in sand or soil to catch ants and other small insects. These larvae are not ants themselves but are the juvenile stage of insects in the family Myrmeleontidae.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an antlion's.","correct":"✓ I saw an antlion.","note":"'Antlion's' implies possession, not plurality. Use 'antlions' for multiple larvae."}],"priority":"★★☆"},"related_words":{"derivatives":["antlion (singular form)","Myrmeleontidae (antlion family)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anthelions' refers to the plural form of 'antlion,' which are the larvae of insects that create pitfall traps to catch ants. This term is relatively uncommon and specialized, typically encountered in scientific or nature-related contexts. Understanding the term requires knowledge of insect life cycles and predatory behaviors."},"example_sentences":[{"sentence":"We observed several anthelions in the sandy area, each with its own pit.","translation":"砂地で数匹のアリジゴクを観察しました。それぞれが独自の巣穴を持っていました。","type":"noun","meaning_category":"plural of antlion"},{"sentence":"The anthelions were patiently waiting for unsuspecting ants to fall into their traps.","translation":"アリジゴクは用心しないアリが罠に落ちるのを辛抱強く待っていました。","type":"noun","meaning_category":"plural of antlion"}]}