{"word":"Pro-Swiss","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"親スイスの、スイスびいきの","english_definition":"Supporting or favoring Switzerland, its people, culture, or policies.","examples":[{"sentence":"The politician's pro-Swiss stance was evident in his speeches.","translation":"その政治家の親スイスの姿勢は彼の演説で明らかだった。"},{"sentence":"The article presented a pro-Swiss viewpoint on the issue of neutrality.","translation":"その記事は中立性という問題について、親スイスの視点を提示していた。"}],"collocations":["pro-Swiss sentiment","pro-Swiss policy","pro-Swiss attitude","pro-Swiss media"],"synonyms":["Swiss-supporting","Swiss-leaning","favoring Switzerland"],"antonyms":["anti-Swiss","Swiss-opposed"]},{"part_of_speech":"noun","definition":"親スイス派の人","english_definition":"A person who supports or favors Switzerland.","examples":[{"sentence":"He is a known pro-Swiss activist.","translation":"彼は知られた親スイスの活動家だ。"},{"sentence":"The pro-Swiss group organized a rally in support of the referendum.","translation":"その親スイスのグループは、国民投票を支持する集会を組織した。"}],"collocations":["pro-Swiss activist","pro-Swiss group","pro-Swiss organization"],"synonyms":["Swiss supporter","Swiss advocate","Switzerland enthusiast"],"antonyms":["anti-Swiss activist","Swiss detractor"]}],"etymology":{"value":"The term is formed by combining the prefix \"pro-\" (meaning 'in favor of' or 'supporting') with the adjective \"Swiss\" (referring to Switzerland).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊˈswɪs/","syllables":"Pro-Swiss"},"inflection":{"notes":"The word \"Pro-Swiss\" does not typically inflect. It remains the same in singular and plural forms when used as a noun, and does not have comparative or superlative forms when used as an adjective."},"usage_notes":{"explanation":"\"Pro-Swiss\" is used to describe someone or something that is supportive of Switzerland, its people, culture, or policies. It is often used in political or social contexts to indicate a particular alignment or viewpoint. The term can be used to describe individuals, groups, organizations, or even media outlets.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pro Swiss person.","correct":"✓ He is a pro-Swiss person.","note":"The hyphen is important to connect \"pro-\" to \"Swiss\" and create a single compound adjective. Without the hyphen, it can be grammatically incorrect or confusing."},{"incorrect":"✗ The pro-Swiss are many in this region.","correct":"✓ Pro-Swiss people are numerous in this region. / ✓ There are many pro-Swiss individuals in this region.","note":"When referring to people who are pro-Swiss, it's better to use \"pro-Swiss people\" or \"pro-Swiss individuals\" to avoid ambiguity."}],"priority":"★★☆"},"related_words":{"derivatives":["Swiss (adjective, noun)","Switzerland (noun)","pro- (prefix indicating support)"],"phrasal_verbs":[],"related_concepts":["Swiss nationalism","Swiss identity","Swiss culture","Swiss politics","Neutrality (of Switzerland)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - The term is relatively specific and not commonly used in general conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Pro-Swiss\" is a specialized term that combines the prefix \"pro-\" (meaning in favor of) with the adjective \"Swiss\" (referring to Switzerland). It is used to describe individuals, groups, or viewpoints that are supportive of Switzerland, its culture, people, or policies. Understanding this term requires familiarity with the prefix \"pro-\" and the context of Swiss identity and politics. It is more likely to be encountered in discussions related to international relations, political ideologies, or cultural affiliations.","priority":"★★☆"},"example_sentences":[{"sentence":"The newspaper is known for its pro-Swiss bias.","translation":"その新聞は親スイスの偏向で知られている。","type":"adjective","meaning_category":"親スイスの"},{"sentence":"The pro-Swiss organization advocates for closer ties with the European Union.","translation":"その親スイスの組織は、欧州連合とのより緊密な関係を提唱している。","type":"adjective","meaning_category":"親スイスの"},{"sentence":"Many pro-Swiss citizens support the country's neutrality policy.","translation":"多くの親スイスの市民が、国の永世中立政策を支持している。","type":"adjective","meaning_category":"親スイスの"},{"sentence":"He identifies as a pro-Swiss intellectual and often writes about Swiss history.","translation":"彼は自身を親スイスの知識人と認識しており、スイスの歴史についてよく書いている。","type":"adjective","meaning_category":"親スイスの"}]}