{"word":"old-fogyism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"保守主義、時代遅れな考え方、旧弊主義","english_definition":"adherence to old-fashioned ideas or customs; resistance to change or innovation.","examples":[{"sentence":"His old-fogyism made it difficult for him to adapt to the new workplace culture.","translation":"彼の保守主義的な考え方のせいで、新しい職場の文化に適応するのが難しかった。"},{"sentence":"The company's old-fogyism was hindering its ability to compete in the modern market.","translation":"その会社の旧弊主義が、現代の市場で競争する能力を妨げていた。"},{"sentence":"She criticized the committee's old-fogyism, arguing that their policies were outdated.","translation":"彼女は委員会の旧弊主義を批判し、彼らの政策は時代遅れだと主張した。"}],"collocations":["a symptom of old-fogyism (保守主義の兆候)","combat old-fogyism (保守主義と戦う)","overcome old-fogyism (保守主義を克服する)"],"synonyms":["conservatism","traditionalism","conventionality","obsolete thinking","hidebound attitude"],"antonyms":["progressivism","modernism","innovation","forward-thinking"],"notes":"Often used in a derogatory way to describe someone who is resistant to new ideas."}],"etymology":{"value":"Derived from 'old fogy,' a term for an old-fashioned or conservative person, combined with the suffix '-ism,' indicating a belief system or ideology.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊldˈfoʊɡiɪzəm/","syllables":"old-fo-gy-ism"},"inflection":{"noun_plural":"old-fogyisms"},"usage_notes":{"explanation":"'Old-fogyism' is typically used to describe a rigid adherence to outdated customs, ideas, or technologies. It often implies a resistance to progress and a preference for the status quo. The term can be used to criticize individuals, organizations, or even entire societies for being stuck in the past.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an old-fogyism person.","correct":"✓ He exhibits old-fogyism. / ✓ He is an old fogy.","note":"'Old-fogyism' is a noun, not an adjective. To describe a person, use 'old fogy' or say they 'exhibit old-fogyism.'"},{"incorrect":"✗ The new policy was a refreshing departure from old-fogyism.","correct":"✓ The new policy was a refreshing departure from old-fashioned ideas.","note":"While grammatically correct, it's often clearer to replace the abstract noun with the specific concept it represents, such as 'old-fashioned ideas' or 'traditional practices,' especially in less formal contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["old fogy (noun: an old-fashioned or conservative person)","fogyish (adjective: characteristic of an old fogy)"],"antonyms":["modernism","progressivism","avant-gardism"],"related_concepts":["conservatism","traditionalism","status quo","resistance to change"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Old-fogyism' is a relatively uncommon word used to describe a strong adherence to old-fashioned ideas and a resistance to change. It's often used in discussions about social progress, business innovation, or cultural shifts. Understanding the word requires familiarity with the concept of conservatism and a critical perspective on tradition. It's more likely to appear in academic or journalistic writing than in everyday conversation."},"example_sentences":[{"sentence":"The museum's exhibit was criticized for its **old-fogyism**, failing to engage with contemporary artistic trends.","translation":"その美術館の展示は、現代の芸術的傾向に関わろうとせず、旧弊主義的だと批判された。","type":"noun","meaning_category":"保守主義"},{"sentence":"The company needed to shed its **old-fogyism** and embrace new technologies to stay competitive.","translation":"その会社は競争力を維持するために、旧弊主義を捨てて新しい技術を受け入れる必要があった。","type":"noun","meaning_category":"時代遅れな考え方"},{"sentence":"His **old-fogyism** was evident in his insistence on using outdated methods.","translation":"彼の旧弊主義は、時代遅れのやり方に固執していることに明らかだった。","type":"noun","meaning_category":"旧弊主義"}]}