{"word":"Agamemnon","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"ギリシャ神話におけるミケーネ（ミュケナイ）の王で、トロイア戦争のギリシャ軍総指揮官","english_definition":"In Greek mythology, the king of Mycenae and leader of the Greek forces in the Trojan War.","examples":[{"sentence":"Agamemnon sacrificed his daughter Iphigenia to appease Artemis.","translation":"アガメムノンはアルテミスの怒りを鎮めるため娘のイフィゲネイアを犠牲にした。"},{"sentence":"The quarrel between Agamemnon and Achilles is central to Homer's Iliad.","translation":"アガメムノンとアキレウスの争いはホメロスの『イリアス』の中心的なテーマである。"}],"cultural_context":"ギリシャ神話において、アガメムノンはアトレウスの子でメネラオスの兄。トロイア戦争終結後、妻クリュタイムネストラとその愛人アイギストスによって殺害される。この物語はアイスキュロスの悲劇『オレステイア』三部作などで描かれる。","priority":"★★★"},{"part_of_speech":"proper noun","definition":"ギリシャ悲劇や西洋文学における典型的な権力者の象徴","english_definition":"A symbolic figure representing flawed leadership in Greek tragedy and Western literature.","examples":[{"sentence":"Shakespeare's Macbeth has been compared to Agamemnon in his tragic downfall.","translation":"シェイクスピアのマクベスはその悲劇的な没落においてアガメムノンと比較されてきた。"}],"priority":"★★☆"}],"etymology":{"value":"古代ギリシャ語 Ἀγαμέμνων (Agamémnōn) に由来。語源は「非常に」を意味する ἀγα- (aga-) と「考え抜く」を意味する μέμνων (mémnōn) の合成で「断固たる意志を持つ者」の意。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌæɡəˈmɛmnɒn/","syllables":"A-ga-mem-non"},"cultural_significance":{"description":"アガメムノンはギリシャ神話において権力の危険性と家族の呪い（アトレウス家の悲劇）を象徴する人物。ホメロスの叙事詩から現代文学まで、権力者の傲慢（ヒュブリス）とその代償というテーマで繰り返し描かれる。","priority":"★★★"},"related_figures":[{"name":"Clytemnestra","relation":"妻で殺害者"},{"name":"Orestes","relation":"復讐を果たした息子"},{"name":"Menelaus","relation":"スパルタ王の弟"}],"artistic_depictions":[{"type":"古代ギリシャ壺絵","description":"トロイア戦争の場面で甲冑姿で描かれる"},{"type":"ルネサンス絵画","description":"イフィゲネイアの犠牲場面が好題材"}],"example_sentences":[{"sentence":"Agamemnon's scepter symbolized his royal authority over the Greek alliance.","translation":"アガメムノンの笏はギリシャ連合に対する彼の王的権威の象徴だった。","context":"ホメロス『イリアス』"},{"sentence":"The ghost of Agamemnon appears in Homer's Odyssey to warn about treacherous women.","translation":"アガメムノンの亡霊がホメロスの『オデュッセイア』に登場し、奸計に長けた女たちへの警告をする。","context":"古代文学"}]}