{"word":"bonnwis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(スラング)賢い人、知識豊富な人、情報通の人","english_definition":"(slang) A knowledgeable or intelligent person; someone who is well-informed.","examples":[{"sentence":"He's a real bonnwis when it comes to computers.","translation":"彼はコンピューターのことなら本当に情報通だ。"},{"sentence":"Ask Sarah, she's the bonnwis in the office about these things.","translation":"サラに聞いてみて、彼女はオフィスでこういうことについて一番情報通だから。"}],"collocations":["real bonnwis","office bonnwis","local bonnwis"],"synonyms":["expert","guru","maven","whiz","sage"],"antonyms":["novice","ignoramus","dunce"]}],"etymology":{"value":"Origin is uncertain, possibly a blend or alteration of 'bonus' and 'wise'. The term likely emerged in informal speech.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbɒnwɪz/","syllables":"bon-nwis"},"inflection":{"noun_plural":"bonnwises"},"usage_notes":{"explanation":"\"bonnwis\" is a slang term, primarily used informally to refer to someone who is particularly knowledgeable or well-informed about a specific subject. It implies a level of expertise or insider knowledge. The term is not widely used and might be considered humorous or colloquial.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a bonnwis person.","correct":"✓ He's a bonnwis.","note":"The word \"bonnwis\" already implies a person, so adding \"person\" is redundant."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["wise","knowledgeable","expert"]},"level_frequency":{"CEFR":"N/A (slang, not typically included in CEFR)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Bonnwis\" is a slang term, meaning it is very informal and not commonly found in formal writing or speech. It refers to someone who is very knowledgeable or an expert in a particular area. Because it is slang, its usage is limited to casual conversation and may not be understood by all English speakers."},"example_sentences":[{"sentence":"If you need help with your taxes, John's a real bonnwis.","translation":"税金のことで助けが必要なら、ジョンは本当に情報通だよ。","type":"noun","meaning_category":"knowledgeable person"},{"sentence":"She's the office bonnwis when it comes to social media.","translation":"彼女はソーシャルメディアのことならオフィスの情報通だ。","type":"noun","meaning_category":"knowledgeable person"}]}