{"word":"Ranids","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カエル科 (Ranidae) のカエル","english_definition":"Plural form of ranid. Frogs belonging to the family Ranidae, characterized by their smooth, moist skin and long, powerful legs, typically found in aquatic or semi-aquatic habitats.","examples":[{"sentence":"The ranids are a diverse group of frogs found worldwide.","translation":"カエル科のカエルは、世界中で見られる多様なグループです。"},{"sentence":"Many ranids are known for their ability to jump long distances.","translation":"多くのカエル科のカエルは、長距離をジャンプする能力で知られています。"}],"collocations":["ranid frog","ranid species","ranid habitat"],"synonyms":["true frogs"],"antonyms":[]}],"etymology":{"value":"Derived from the taxonomic family name Ranidae, which comes from the genus Rana (Latin for 'frog').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrænɪdz/","syllables":"ran-ids"},"inflection":{"noun_plural":"Ranids"},"usage_notes":{"explanation":"'Ranids' is the plural form of 'ranid,' referring to frogs belonging to the family Ranidae. These frogs are commonly known as true frogs and are characterized by their smooth, moist skin and long, powerful legs. They are found in various aquatic and semi-aquatic habitats around the world.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ranid are common in this area.","correct":"✓ The ranids are common in this area.","note":"'Ranid' is singular, so use 'ranids' (plural) when referring to multiple frogs."},{"incorrect":"✗ Ranids is a type of frog.","correct":"✓ Ranids are a type of frog.","note":"Use the plural form 'ranids' with the plural verb 'are'."}],"priority":"★★☆"},"related_words":{"derivatives":["Ranid (singular form)","Ranidae (family name)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ranids' refers to frogs belonging to the family Ranidae, often called true frogs. This term is primarily used in scientific or zoological contexts. Understanding this term requires familiarity with biological classification. The key characteristic of ranids is that they are a diverse group of frogs characterized by their smooth, moist skin and long, powerful legs, typically found in aquatic or semi-aquatic habitats. It's a specialized term, so it's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The pond was teeming with various species of **ranids**.","translation":"その池は様々な種類のカエル科のカエルで賑わっていた。","type":"noun","meaning_category":"カエル科のカエル"},{"sentence":"Researchers are studying the population dynamics of **ranids** in the local wetlands.","translation":"研究者たちは地元の湿地におけるカエル科のカエルの個体数動態を研究している。","type":"noun","meaning_category":"カエル科のカエル"}]}