{"word":"Introfying","priority":"★☆☆","meanings":[{"part_of_speech":"verb (gerund or present participle)","definition":"内向的にする、内省的にする、内面に向かわせる","english_definition":"The act of making something introverted, introspective, or directed inward.","examples":[{"sentence":"The artist was introfying the external world by focusing on the inner emotions it evoked.","translation":"その芸術家は、外部世界が喚起する内面の感情に焦点を当てることで、外部世界を内面化していた。"},{"sentence":"Introfying the company culture led to a decrease in external collaboration.","translation":"企業文化を内向きにすることで、外部との連携が減少した。"}],"collocations":["introfying the process","introfying the culture","introfying the focus","introfying the attention","introfying the feelings"],"synonyms":["internalizing","inwardizing","subjectifying","personalizing"],"antonyms":["externalizing","outwardizing","objectifying"]},{"part_of_speech":"adjective","definition":"内向的にする傾向がある、内省的にする傾向がある","english_definition":"Having a tendency to make something introverted, introspective, or directed inward.","examples":[{"sentence":"The introfying effect of the pandemic led many people to re-evaluate their lives.","translation":"パンデミックの内向化効果により、多くの人々が自分の人生を再評価するようになった。"},{"sentence":"The introfying nature of the meditation practice helped him connect with his inner self.","translation":"瞑想の実践の内向的な性質は、彼が内なる自己とつながるのを助けた。"}],"collocations":["introfying effect","introfying influence","introfying tendency","introfying nature","introfying power"],"synonyms":["internalizing","inwardizing","subjectifying","personalizing"],"antonyms":["externalizing","outwardizing","objectifying"]}],"etymology":{"value":"Derived from \"introfy,\" which is formed from \"intro-\" (meaning inward) and \"-fy\" (a suffix meaning to make or cause to become).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntroʊˈfaɪɪŋ/","syllables":"In-tro-fy-ing"},"inflection":{"verb_forms":{"present_participle":"introfying","gerund":"introfying"}},"usage_notes":{"explanation":"\"Introfying\" is used to describe the process or tendency of turning something inward, making it more introspective or focused on internal aspects. It can apply to processes, cultures, or even personal tendencies. The term is relatively uncommon but useful for describing a specific type of inward focus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is introfying because he is introvert.","correct":"✓ He is introfying because he is an introvert.","note":"\"Introvert\" is a noun, so it needs an article (\"an\"). \"Introfying\" describes the action or process, not the state of being an introvert."},{"incorrect":"✗ Introfying is a good way to avoid external problems.","correct":"✓ Introversion is a good way to avoid external problems.","note":"\"Introversion\" (the state of being an introvert) is often used to describe a personality trait, whereas \"introfying\" describes the act of making something inward-focused."}],"priority":"★★☆"},"related_words":{"derivatives":["introfy","introfied","introfier","introfication"],"related_terms":["introspection","introvert","introverted","internalize","inward"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Introfying\" is a relatively uncommon word that describes the process of turning something inward or making it more focused on internal aspects. It is often used in psychological or philosophical contexts to describe the act of internalizing experiences or emotions. The word is derived from \"introfy,\" which means to make something introverted. Understanding this word requires a good grasp of prefixes and suffixes and the ability to infer meaning from context.","example_sentences":[]},"example_sentences":[{"sentence":"The company's new strategy involved introfying its research and development efforts.","translation":"その会社の新戦略は、研究開発の取り組みを内向きにすることを含んでいた。","type":"verb (gerund)","meaning_category":"内向的にする"},{"sentence":"The introfying atmosphere of the retreat allowed participants to deeply reflect on their personal goals.","translation":"リトリートの内向的な雰囲気は、参加者が自分の個人的な目標を深く反省することを可能にした。","type":"adjective","meaning_category":"内向的にする傾向がある"}]}