{"word":"Dirichletian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ディリクレの、ディリクレに関する","english_definition":"Relating to or characteristic of the work of the mathematician Peter Gustav Lejeune Dirichlet.","examples":[{"sentence":"Dirichletian boundary conditions are used in solving partial differential equations.","translation":"ディリクレ境界条件は偏微分方程式を解く際に用いられる。"},{"sentence":"The Dirichletian kernel plays a significant role in Fourier analysis.","translation":"ディリクレ核はフーリエ解析において重要な役割を果たす。"}],"collocations":["Dirichletian boundary conditions","Dirichletian kernel","Dirichletian process"],"synonyms":["Dirichlet"],"antonyms":[]},{"part_of_speech":"noun","definition":"ディリクレ的なもの","english_definition":"Something that relates to or is characteristic of Dirichlet's work.","examples":[{"sentence":"The paper explores various Dirichletians in number theory.","translation":"その論文は数論における様々なディリクレ的なものを探求している。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Peter Gustav Lejeune Dirichlet (1805-1859), a German mathematician who made significant contributions to number theory, analysis, and mathematical physics.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdɪrɪkˈliːʃən/","syllables":"Di-rich-le-ti-an"},"inflection":{"notes":"The word 'Dirichletian' can function as both an adjective and a noun. As an adjective, it does not inflect. As a noun, it can be pluralized (Dirichletians)."},"usage_notes":{"explanation":"'Dirichletian' is primarily used in mathematical and scientific contexts to describe concepts, methods, or results associated with the mathematician Peter Gustav Lejeune Dirichlet. It often appears in discussions related to differential equations, Fourier analysis, and number theory.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Dirichletian is a person.","correct":"✓ The Dirichletian refers to concepts associated with the mathematician Dirichlet.","note":"'Dirichletian' does not refer to a person but to mathematical concepts or objects related to Dirichlet's work."}],"priority":"★☆☆"},"related_words":{"derivatives":["Dirichlet (proper noun)","Dirichlet boundary condition (noun)","Dirichlet kernel (noun)","Dirichlet process (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Dirichletian' is highly specialized and primarily encountered in advanced mathematical and scientific literature. Understanding its meaning requires familiarity with the work of Peter Gustav Lejeune Dirichlet and the mathematical fields he contributed to. It is not typically used in general English.","priority":"★★☆"},"example_sentences":[{"sentence":"The solution satisfies the Dirichletian conditions.","translation":"その解はディリクレ条件を満たす。","type":"adjective","meaning_category":"relating to Dirichlet"},{"sentence":"The study of Dirichletians is crucial in understanding the distribution of prime numbers.","translation":"ディリクレ的なものの研究は素数の分布を理解する上で重要である。","type":"noun","meaning_category":"Dirichlet-related concepts"}]}