{"word":"imperatively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"命令的に、断固として、どうしても","english_definition":"in a way that expresses a command or order; in a way that is absolutely necessary or unavoidable.","examples":[{"sentence":"The doctor spoke imperatively, telling him to stop smoking immediately.","translation":"医者は命令的に、すぐにタバコをやめるように彼に言った。"},{"sentence":"The situation demanded imperatively that we act quickly.","translation":"その状況は、私たちが迅速に行動することをどうしても要求した。"},{"sentence":"He imperatively insisted that she stay home.","translation":"彼は彼女に家にいるように断固として主張した。"}],"collocations":["speak imperatively","demand imperatively","insist imperatively","act imperatively"],"synonyms":["authoritatively","commandingly","urgently","necessarily","compellingly","insistently"],"antonyms":["mildly","gently","optionally","unnecessarily"]}],"etymology":{"value":"Derived from the adjective 'imperative', which comes from the Latin 'imperativus' (relating to a command), from 'imperare' (to command). The adverbial form is created by adding the suffix '-ly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˈpɛrətɪvli/","syllables":"im-per-a-tive-ly"},"inflection":{"notes":"Adverbs do not typically inflect (change form)."},"usage_notes":{"explanation":"'Imperatively' is used to describe actions or speech that convey a sense of command, urgency, or necessity. It emphasizes the authoritative or unavoidable nature of the action or statement. It is less common in everyday conversation and more often found in formal writing or situations where authority or urgency is emphasized.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She asked imperatively if I could help.","correct":"✓ She asked urgently if I could help.","note":"'Imperatively' implies a command, not a request. 'Urgently' is more appropriate for a plea for help."},{"incorrect":"✗ He acted imperatively, so everyone was happy.","correct":"✓ He acted decisively, so everyone was happy.","note":"'Imperatively' suggests a forceful command, which may not always lead to happiness. 'Decisively' implies a clear and effective action."}],"priority":"★★☆"},"related_words":{"derivatives":["imperative (adjective, noun)","imperativeness (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'imperatively' is used to describe something done in a commanding or absolutely necessary way. It's not a common word, so it's more likely to appear in formal writing or when someone wants to emphasize the urgency or authority of an action or statement. For example, 'The captain ordered the crew imperatively to abandon ship' means the captain gave a forceful and unavoidable command."},"example_sentences":[{"sentence":"The general spoke imperatively, demanding immediate obedience.","translation":"将軍は命令的に話し、即座の服従を要求した。","type":"general","meaning_category":"commandingly"},{"sentence":"The situation imperatively required a swift response to prevent further damage.","translation":"その状況は、さらなる被害を防ぐために、どうしても迅速な対応を必要とした。","type":"general","meaning_category":"urgently"},{"sentence":"She imperatively told him to leave her alone.","translation":"彼女は彼に、私を放っておいてと断固として言った。","type":"general","meaning_category":"insistently"}]}