{"word":"Octarch","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) 八王政、八頭政治：アングロサクソン七王国時代における、有力な八つの王国（ノーサンブリア、マーシア、ケント、イーストアングリア、エセックス、サセックス、ウェセックス）の支配体制。","english_definition":"(historical) A system of government by eight rulers; specifically, the period in Anglo-Saxon England when eight powerful kingdoms (Northumbria, Mercia, Kent, East Anglia, Essex, Sussex, and Wessex) dominated.","examples":[{"sentence":"The concept of the Octarchy is used to describe the fluctuating power dynamics of Anglo-Saxon England.","translation":"八王政という概念は、アングロサクソン時代のイングランドにおける変動する権力構造を説明するために用いられる。"}],"collocations":["Anglo-Saxon Octarchy","period of the Octarchy"],"synonyms":["Heptarchy (七王国時代 - より一般的)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek 'okto' (eight) + 'archē' (rule, government).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɒktɑːrk/","syllables":"Oc-tarch"},"inflection":{"noun_plural":"Octarchies"},"usage_notes":{"explanation":"The term 'Octarchy' is less commonly used than 'Heptarchy' to describe the Anglo-Saxon period, as the number of dominant kingdoms fluctuated over time. While there were typically seven major kingdoms, the term 'Octarchy' acknowledges the occasional emergence of an eighth powerful kingdom or the shifting dominance among the existing ones.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["octarchic (adjective)"],"related_terms":["Heptarchy","Anglo-Saxon England","kingdom","Northumbria","Mercia","Wessex"]},"level_frequency":{"CEFR":"N/A (specialized historical term)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Octarch' is a specialized historical term referring to a period in Anglo-Saxon England when eight kingdoms held significant power. It's less common than 'Heptarchy' (seven kingdoms) because the number of dominant kingdoms varied. Understanding this term requires knowledge of early English history."},"example_sentences":[{"sentence":"The rise of Wessex eventually led to the end of the Octarchy and the unification of England.","translation":"ウェセックスの台頭は、最終的に八王政の終焉とイングランドの統一につながった。","type":"historical context","meaning_category":"historical government"},{"sentence":"Historians debate whether the term Octarchy or Heptarchy more accurately reflects the political landscape of the time.","translation":"歴史家たちは、八王政と七王国時代のどちらの用語が、当時の政治情勢をより正確に反映しているかについて議論している。","type":"academic discussion","meaning_category":"historical terminology"}]}