{"word":"xeriscaping","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"乾燥造園、節水型庭園設計","english_definition":"a style of landscape design requiring little or no irrigation or other maintenance, used in arid or semiarid regions.","examples":[{"sentence":"Xeriscaping is a great way to conserve water in dry climates.","translation":"乾燥地帯では、乾燥造園は水を節約するのに最適な方法です。"},{"sentence":"They transformed their water-guzzling lawn into a beautiful xeriscaped garden.","translation":"彼らは水を大量に消費する芝生を、美しい乾燥造園の庭に変えました。"}],"collocations":["xeriscape garden","xeriscape design","xeriscape principles"],"synonyms":["drought-tolerant landscaping","water-wise gardening"],"antonyms":["traditional landscaping","water-intensive landscaping"]}],"etymology":{"value":"The word \"xeriscaping\" is a portmanteau of the Greek word \"xeros\" (meaning dry) and \"landscaping\". It was coined in Denver, Colorado, in the early 1980s by Denver Water.","priority":"★★☆"},"pronunciation":{"ipa":"ˈzɪrɪˌskeɪpɪŋ","syllables":"ze-ri-scap-ing"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Xeriscaping is not just about using cacti and rocks. It involves careful planning, soil improvement, efficient irrigation (if any), appropriate plant selection, mulching, and lawn alternatives to create a sustainable and attractive landscape that minimizes water use. The seven principles of xeriscaping are: planning and design, soil improvement, efficient irrigation, appropriate plant selection, mulching, turf alternatives, and maintenance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Xeriscaping means no plants at all.","correct":"✓ Xeriscaping means using drought-tolerant plants.","note":"Xeriscaping doesn't mean eliminating plants, but rather selecting plants that thrive in dry conditions."},{"incorrect":"✗ Xeriscaping is only for deserts.","correct":"✓ Xeriscaping can be used in any climate to conserve water.","note":"While xeriscaping is particularly useful in dry climates, its principles can be applied anywhere to reduce water consumption in landscaping."}],"priority":"★★☆"},"related_words":{"derivatives":["xeriscape (verb)","xeriscaped (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"xeriscaping\" refers to a type of landscaping designed to reduce or eliminate the need for irrigation. It's a combination of the Greek word \"xeros,\" meaning dry, and \"landscaping.\" Xeriscaping involves using drought-tolerant plants, efficient irrigation techniques, and other methods to conserve water in outdoor spaces. This approach is particularly useful in arid and semi-arid regions, but its principles can be applied in any climate to promote sustainable landscaping practices. It is a more specialized term related to environmental sustainability and landscape architecture."},"example_sentences":[{"sentence":"Many homeowners are turning to **xeriscaping** to lower their water bills.","translation":"多くの住宅所有者が、水道料金を下げるために乾燥造園に移行しています。","type":"noun","meaning_category":"節水型庭園設計"},{"sentence":"The city offers rebates to residents who convert their lawns to **xeriscaping**.","translation":"市は、芝生を乾燥造園に転換する住民に払い戻しを提供しています。","type":"noun","meaning_category":"節水型庭園設計"}]}