{"word":"Mulki","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(インドのハイデラバード地方の)土地っ子、地元民","english_definition":"A native or local resident of the Hyderabad region in India.","examples":[{"sentence":"He is a Mulki of Hyderabad.","translation":"彼はハイデラバードの土地っ子です。"}],"collocations":["Mulki rules (土地っ子ルール)"],"synonyms":["local","native","resident"],"antonyms":["foreigner","outsider"]}],"etymology":{"value":"Derived from the Arabic word 'Mulk' meaning 'land' or 'territory'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈmʊlki","syllables":"Mul-ki"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"'Mulki' refers to a person who is considered a native or local of the Hyderabad region in India. Historically, 'Mulki rules' were established to protect the interests of local residents in government jobs and education.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a citizen, not a Mulki.","correct":"He is a citizen and a Mulki.","note":"A person can be both a citizen and a Mulki if they are a native resident of the Hyderabad region."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mulki' is a term specific to the Hyderabad region of India, referring to a native or local resident. Understanding this term requires knowledge of the historical and social context of the region, particularly the 'Mulki rules' which were implemented to protect the rights and interests of local residents in employment and education. This term is not commonly used outside of this specific regional context."},"example_sentences":[{"sentence":"The Mulki rules aimed to prioritize local residents for government jobs.","translation":"土地っ子ルールは、政府の仕事で地元住民を優先することを目的としていました。","type":"noun","meaning_category":"Local Resident"},{"sentence":"Many people identify as Mulki to assert their connection to the region.","translation":"多くの人々が、その地域とのつながりを主張するために、土地っ子であると認識しています。","type":"noun","meaning_category":"Local Resident"}]}