{"word":"federalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"連邦主義、連邦制","english_definition":"a system of government in which entities such as states or provinces share power with a national government.","examples":[{"sentence":"Federalism is a key feature of the United States government.","translation":"連邦主義はアメリカ合衆国政府の重要な特徴です。"},{"sentence":"Canada operates under a system of federalism.","translation":"カナダは連邦制のシステムの下で運営されています。"},{"sentence":"The debate over federalism continues to shape political discourse.","translation":"連邦主義に関する議論は、政治的な言説を形成し続けています。"}],"collocations":["division of powers (権力分立)","states' rights (州の権利)","central government (中央政府)","regional autonomy (地域自治)","constitutional framework (憲法上の枠組み)"],"synonyms":["decentralization","devolution","confederation"],"antonyms":["centralization","unitary system"]}],"etymology":{"value":"Derived from the Latin word \"foedus,\" meaning \"covenant\" or \"agreement.\" The term \"federal\" emerged in the 17th century, referring to a league or alliance. \"Federalism\" as a political concept developed during the formation of federal republics like the United States.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfedərəlɪzəm/","syllables":"fed-er-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Federalism is a system where power is divided between a central (federal) government and regional (state, provincial) governments. Each level has some degree of autonomy and direct authority over its citizens. Key aspects include the division of powers, states' rights, and the balance between national unity and regional diversity. It is often contrasted with unitary systems, where the central government holds most of the power.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Federalism means the central government has all the power.","correct":"✓ Federalism means power is shared between the central and regional governments.","note":"Federalism involves a sharing of power, not complete dominance by the central government."},{"incorrect":"✗ Federalism is the same as a unitary system.","correct":"✓ Federalism is different from a unitary system, where the central government holds most of the power.","note":"Federalism and unitary systems are contrasting forms of government."}],"priority":"★★☆"},"related_words":{"derivatives":["federal (形容詞: 連邦の)","federalist (名詞: 連邦主義者)","federation (名詞: 連邦)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Moderate Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"federalism\" refers to a complex system of government where power is divided between a national government and regional governments (like states or provinces). It's important to understand that this involves a balance of power, with each level having some autonomy. The concept is often discussed in political science and history, particularly in the context of countries like the United States, Canada, and Germany. Understanding federalism requires knowledge of constitutional law and the historical development of political systems."},"example_sentences":[{"sentence":"The Canadian system of **federalism** allows provinces significant control over education.","translation":"カナダの連邦制システムでは、州が教育に対して大きな権限を持つことが認められています。","type":"noun","meaning_category":"連邦主義"},{"sentence":"Debates about the balance of power in **federalism** are common in many countries.","translation":"連邦主義における権力バランスに関する議論は、多くの国で一般的です。","type":"noun","meaning_category":"連邦主義"},{"sentence":"The U.S. Constitution establishes the principles of **federalism**.","translation":"アメリカ合衆国憲法は、連邦主義の原則を確立しています。","type":"noun","meaning_category":"連邦主義"}]}