{"word":"disflesh","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(動物の)肉を骨から取り除く、(死体から)肉を剥ぎ取る","english_definition":"To remove the flesh from (a carcass or hide); to strip the flesh from (a body).","examples":[{"sentence":"The hunters carefully disflshed the deer carcass.","translation":"猟師たちは注意深く鹿の死骸から肉を剥ぎ取った。"},{"sentence":"The vultures quickly disflshed the remains of the animal.","translation":"ハゲタカたちは素早く動物の残骸から肉を剥ぎ取った。"},{"sentence":"(Figurative) The author disflshed the characters, revealing their true nature.","translation":"(比喩的に) 著者は登場人物から飾りを取り除き、彼らの本性を明らかにした。"}],"collocations":["disflesh a carcass (死骸から肉を剥ぎ取る)","disflesh a hide (皮から肉を取り除く)","disflesh a body (死体から肉を剥ぎ取る)"],"synonyms":["flay","strip","excarnate","eviscerate"],"antonyms":["flesh","cover"],"notes":"The term is often used in the context of butchery, taxidermy, or forensic science. It can also be used figuratively to mean stripping away the non-essential aspects of something to reveal its core essence."}],"etymology":{"value":"Formed from 'dis-' (expressing removal or separation) and 'flesh'.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈflɛʃ/","syllables":"dis-flesh"},"inflection":{"verb_forms":{"present_simple":["disflesh","disfleshes"],"past_simple":"disfleshed","past_participle":"disfleshed","present_participle":"disfleshing"}},"usage_notes":{"explanation":"'Disflesh' is a relatively uncommon word, primarily used in technical or specialized contexts. It specifically refers to the act of removing flesh, often from a carcass or hide. It can also be used in a figurative sense to describe the act of stripping away superficial or extraneous elements to reveal the core essence of something.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He disflshed the apple.","correct":"✓ He peeled the apple.","note":"'Disflesh' is generally used for animal carcasses or hides, not fruits or vegetables. 'Peel' or 'pare' would be more appropriate for removing the skin of an apple."},{"incorrect":"✗ The sculptor disflshed the statue.","correct":"✓ The sculptor carved the statue.","note":"'Disflesh' implies removing existing flesh. For creating a statue, 'carve' or 'sculpt' would be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["disfleshment (noun: the act of disfleshing)"],"related_terms":["flesh","flay","excarnate","eviscerate"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not commonly found in standard language learning resources)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Disflesh' is a specialized and uncommon term. It is primarily used in contexts related to butchery, taxidermy, or forensic science, where the removal of flesh from a carcass or body is discussed. The figurative use of the term is even rarer, and requires a high level of understanding of abstract language. Due to its limited use and specialized meaning, it is not typically encountered in general language learning materials."},"example_sentences":[{"sentence":"The taxidermist carefully disflshed the animal hide before beginning the tanning process.","translation":"剥製師は、なめし工程を始める前に、動物の皮から肉を注意深く取り除いた。","type":"verb (vt)","meaning_category":"肉を骨から取り除く"},{"sentence":"In some ancient rituals, the bodies of the deceased were disflshed as part of the funerary rites.","translation":"古代の儀式の中には、葬儀の一部として故人の遺体から肉を剥ぎ取るものもあった。","type":"verb (vt)","meaning_category":"肉を剥ぎ取る"},{"sentence":"(Figurative) The critic disflshed the author's arguments, exposing their logical flaws.","translation":"(比喩的に) 批評家は著者の主張から飾りを取り除き、その論理的な欠陥を露呈させた。","type":"verb (vt)","meaning_category":"飾りを取り除く"}]}