{"word":"dysmorphology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"形態異常学、奇形学","english_definition":"The study of human congenital malformations, particularly those affecting anatomy.","examples":[{"sentence":"Dysmorphology is essential for diagnosing genetic syndromes.","translation":"形態異常学は遺伝的症候群の診断に不可欠です。"},{"sentence":"The dysmorphology clinic provides evaluations for children with birth defects.","translation":"形態異常学クリニックは、先天性欠損症を持つ子供たちの評価を提供しています。"}],"collocations":["clinical dysmorphology","pediatric dysmorphology","dysmorphology evaluation","dysmorphology features"],"synonyms":["teratology","birth defects research"],"antonyms":[]}],"etymology":{"value":"From the Greek roots 'dys-' (bad, abnormal), 'morph-' (form), and '-ology' (study of).","priority":"★★★"},"pronunciation":{"ipa":"/dɪsˌmɔːrˈfɒlədʒi/","syllables":"dys-mor-phol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Dysmorphology focuses on the physical aspects of birth defects and genetic syndromes. It involves careful observation and measurement of physical features to identify patterns and diagnose underlying conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Dysmorphology is only about visible birth defects.","correct":"Dysmorphology includes both visible and subtle physical abnormalities.","note":"Dysmorphology encompasses a wide range of physical features, not just obvious defects."}],"priority":"★★☆"},"related_words":{"derivatives":["dysmorphic (adjective)","dysmorphologist (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Dysmorphology is a specialized term used in the medical field to describe the study of congenital malformations. It involves understanding the abnormal development of physical structures in the human body. This term is typically encountered in medical literature, genetic counseling, and clinical settings dealing with birth defects.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor specialized in dysmorphology to better understand genetic disorders.","translation":"その医師は、遺伝性疾患をより良く理解するために、形態異常学を専門としていた。","type":"general","meaning_category":"study of malformations"},{"sentence":"Detailed dysmorphology assessments are crucial for accurate diagnoses.","translation":"詳細な形態異常学的評価は、正確な診断に不可欠である。","type":"clinical","meaning_category":"assessment"}]}