{"word":"Aminize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"To convert (a chemical compound) into an amine or introduce an amino group into (a molecule).","english_definition":"To convert (a chemical compound) into an amine or introduce an amino group into (a molecule).","examples":[{"sentence":"The researchers attempted to aminize the polymer to improve its biocompatibility.","translation":"研究者たちは、生体適合性を向上させるために、そのポリマーをアミン化しようと試みた。"},{"sentence":"The process involves aminizing a hydroxyl group on the molecule.","translation":"そのプロセスでは、分子上のヒドロキシル基をアミン化することが含まれる。"}],"collocations":["aminize a compound","aminize a molecule","aminize a polymer"],"synonyms":["amino-functionalize","aminate"],"antonyms":["deaminate"]}],"etymology":{"value":"Formed from 'amine' + '-ize'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈæmənaɪz/","syllables":"A-mi-nize"},"inflection":{"verb_forms":{"present_simple":["aminize","aminizes"],"past_simple":"aminized","past_participle":"aminized","present_participle":"aminizing"}},"usage_notes":{"explanation":"'Aminize' is a technical term used in chemistry, particularly in organic chemistry and polymer chemistry. It refers to the process of introducing an amino group (-NH2) into a molecule or converting a compound into an amine. This is often done to modify the properties of the molecule, such as its reactivity, solubility, or biocompatibility.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The solution was aminized for 2 hours.","correct":"✓ The compound was aminized for 2 hours.","note":"'Aminize' refers to the modification of a specific compound or molecule, not a general solution."}],"priority":"★☆☆"},"related_words":{"derivatives":["amination (noun): the process of introducing an amino group.","amine (noun): a compound derived from ammonia by replacement of one or more hydrogen atoms by organic groups."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Aminize' is a specialized term primarily encountered within the fields of chemistry, specifically organic and polymer chemistry. It describes the chemical process of converting a compound into an amine or introducing an amino group into a molecule. Understanding this term requires a background in chemistry, as it involves specific chemical reactions and functional groups. The term is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The surface of the nanoparticle was aminized to facilitate bioconjugation.","translation":"そのナノ粒子の表面は、生体結合を促進するためにアミン化された。","type":"verb","meaning_category":"Chemical modification"},{"sentence":"Aminizing the cellulose fibers improved their adhesion to the epoxy matrix.","translation":"セルロース繊維をアミン化することで、エポキシマトリックスへの接着性が向上した。","type":"verb","meaning_category":"Chemical modification"}]}