{"word":"angiolymphitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"血管リンパ管炎","english_definition":"Inflammation of a lymphatic vessel and adjacent blood vessel.","examples":[{"sentence":"Angiolymphitis can be caused by bacterial infection.","translation":"血管リンパ管炎は細菌感染によって引き起こされることがあります。"},{"sentence":"Symptoms of angiolymphitis include pain, swelling, and redness.","translation":"血管リンパ管炎の症状には、痛み、腫れ、発赤などがあります。"}],"collocations":["bacterial angiolymphitis","acute angiolymphitis"],"synonyms":["lymphangitis","lymphadenitis"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'angeion' (vessel), 'lymph' (lymph), and 'itis' (inflammation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌændʒioʊlɪmˈfaɪtɪs/","syllables":"an-gi-o-lym-phi-tis"},"inflection":{"noun_plural":"angiolymphitides"},"usage_notes":{"explanation":"Angiolymphitis is a relatively rare condition involving inflammation of both lymphatic and blood vessels. It is often associated with infection and can present with localized pain and swelling.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Angiolymphitis is a type of cancer.","correct":"Angiolymphitis is an inflammation of lymphatic and blood vessels, not a type of cancer.","note":"Angiolymphitis is an inflammatory condition, not a cancerous one."}],"priority":"★★☆"},"related_words":{"derivatives":["angio- (prefix relating to blood or lymph vessels)","lymph- (prefix relating to lymph)","-itis (suffix relating to inflammation)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Angiolymphitis refers to a medical condition characterized by the inflammation of both blood vessels and lymphatic vessels. It's a term primarily used in medical contexts and is not commonly encountered in everyday language. Understanding this term requires a background in medical terminology. Symptoms may include pain, swelling, and redness in the affected area, often due to an underlying infection. Treatment typically involves addressing the cause of the inflammation, such as antibiotics for bacterial infections."},"example_sentences":[{"sentence":"The patient presented with signs of acute angiolymphitis in the lower extremity.","translation":"患者は下肢に急性血管リンパ管炎の兆候を呈した。","type":"medical","meaning_category":"Inflammation"},{"sentence":"Angiolymphitis can be a complication of cellulitis.","translation":"血管リンパ管炎は蜂窩織炎の合併症となることがある。","type":"medical","meaning_category":"Inflammation"}]}