{"word":"Encumbrancer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)負担設定者、担保提供者","english_definition":"A person who has a claim, lien, charge, or liability attached to and binding real property.","examples":[{"sentence":"The encumbrancer must provide a clear title before the property can be sold.","translation":"負担設定者は、不動産が売却される前に、明確な権利を提供しなければならない。"},{"sentence":"The bank acted as the encumbrancer by placing a lien on the property.","translation":"銀行は、不動産に先取特権を設定することにより、負担設定者として行動した。"}],"collocations":["act as encumbrancer","the encumbrancer must","the encumbrancer provides"],"synonyms":["lienholder","mortgagor","claimant","creditor"],"antonyms":["debtor","property owner","freeholder"]}],"etymology":{"value":"Derived from the verb 'encumber,' meaning to burden or impede. The suffix '-er' denotes the person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈkʌmbrənsər/","syllables":"en-cum-ber-ser"},"inflection":{"noun_plural":"Encumbrancers"},"usage_notes":{"explanation":"The term 'Encumbrancer' is primarily used in legal and real estate contexts. It refers specifically to an individual or entity that holds a claim or lien against a property, which reduces its value or restricts its use. This is often a bank or other lending institution that has provided a mortgage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The encumbrancer is the person who owns the property free and clear.","correct":"✓ The encumbrancer is the person who holds a claim against the property.","note":"The encumbrancer holds a claim or lien, not ownership free and clear."},{"incorrect":"✗ An encumbrancer always has full ownership of the property.","correct":"✓ An encumbrancer has a financial interest or claim on the property.","note":"The encumbrancer does not necessarily have ownership, but rather a claim or lien."}],"priority":"★★☆"},"related_words":{"derivatives":["encumbrance (noun: 負担、担保物権)","encumber (verb: 負担をかける、妨げる)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Encumbrancer' is a specialized legal term primarily encountered in real estate and legal documentation. It denotes an individual or entity that holds a claim, lien, or charge against a property, thereby affecting its title or use. Understanding this term requires familiarity with property law and financial transactions involving real estate. It is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The title search revealed several encumbrancers on the property.","translation":"権利調査により、その不動産に複数の負担設定者がいることが明らかになった。","type":"general","meaning_category":"legal"},{"sentence":"As the encumbrancer, the bank has the right to foreclose on the property if payments are not made.","translation":"負担設定者として、銀行は支払いが滞った場合、不動産を差し押さえる権利を有する。","type":"general","meaning_category":"legal"},{"sentence":"The encumbrancer's claim must be satisfied before the property can be transferred.","translation":"不動産を譲渡する前に、負担設定者の請求を満たさなければならない。","type":"general","meaning_category":"legal"}]}