{"word":"artfulness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"巧妙さ、ずる賢さ、策略、ごまかし、器用さ、芸術的技巧","english_definition":"skill in achieving an end, especially by using cunning or deception; cleverness or skill, especially in a crafty or cunning way; artistic skill.","examples":[{"sentence":"The con artist's artfulness allowed him to swindle many people.","translation":"その詐欺師の巧妙さによって、彼は多くの人々を騙すことができた。"},{"sentence":"She admired the artfulness of the politician's speech.","translation":"彼女は政治家の演説の巧妙さに感心した。"},{"sentence":"The artfulness of the novel's plot kept readers guessing until the very end.","translation":"その小説のプロットの巧妙さが、読者を最後まで推測させ続けた。"},{"sentence":"His artfulness with the brush created stunning landscapes.","translation":"彼の筆の器用さは、見事な風景を描き出した。"}],"collocations":["deceptive artfulness","political artfulness","literary artfulness","artfulness of design","artfulness of execution"],"synonyms":["cunning","deceit","guile","craftiness","slyness","ingenuity","skill","cleverness","adroitness","subtlety"],"antonyms":["naivety","simplicity","candor","honesty","sincerity","artlessness","clumsiness"]},{"part_of_speech":"noun","definition":"芸術性、技巧、芸術的才能","english_definition":"the quality of being artistic; artistic skill or ability.","examples":[{"sentence":"The painting displayed great artfulness in its use of color and light.","translation":"その絵画は、色彩と光の使い方に優れた芸術性を示していた。"},{"sentence":"The dancer's artfulness was evident in every movement.","translation":"ダンサーの芸術性は、あらゆる動きに明らかだった。"}],"collocations":["artfulness in painting","artfulness in dance","artfulness in music","artfulness in sculpture"],"synonyms":["artistry","skill","talent","craftsmanship","technique","virtuosity"],"antonyms":["crudeness","ineptitude","awkwardness"]}],"etymology":{"value":"Derived from \"artful\" (adjective), which combines \"art\" (skill, craft) and \"-ful\" (full of). The word evolved to encompass both positive (skillful) and negative (cunning) connotations.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrtfʊlnəs/","syllables":"art-ful-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Artfulness\" can have both positive and negative connotations. In a positive sense, it refers to skill, cleverness, and ingenuity. In a negative sense, it implies cunning, deceit, and manipulation. The context usually determines which meaning is intended. When referring to artistic skill, it is often used to describe the skillful execution of a work of art.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"His artfulness made him a good person.","correct":"His skill/cleverness made him successful.","note":"While \"artfulness\" can mean skill, it often implies a degree of cunning or deception. In this context, a more neutral word like \"skill\" or \"cleverness\" would be more appropriate."},{"incorrect":"The artfulness of the child was admirable.","correct":"The child's innocence was admirable.","note":"\"Artfulness\" implies a level of sophistication or manipulation that is not usually associated with children. \"Innocence\" or \"naivety\" would be more fitting in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["artful (adjective)","artlessly (adverb)","artless (adjective)"],"phrases":["with artfulness","displaying artfulness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Artfulness\" is a relatively sophisticated word that describes the quality of being artful. It can refer to skill and cleverness, especially in a crafty or cunning way. It can also refer to artistic skill or ability. Because it can have both positive and negative connotations, it's important to understand the context in which it is used. It is not a commonly used word, so it is more likely to be encountered in formal writing or speech."},"example_sentences":[{"sentence":"The lawyer used great artfulness to win the case.","translation":"弁護士は、その訴訟に勝つために非常に巧妙な手段を用いた。","type":"general","meaning_category":"cunning/skill"},{"sentence":"The artfulness with which she told the story captivated the audience.","translation":"彼女が物語を語るその巧妙さが、聴衆を魅了した。","type":"general","meaning_category":"skill/craft"},{"sentence":"He employed artfulness to avoid answering the difficult question.","translation":"彼は難しい質問に答えるのを避けるために、策略を用いた。","type":"general","meaning_category":"cunning"},{"sentence":"The artfulness of the design was apparent in its intricate details.","translation":"そのデザインの巧妙さは、その複雑なディテールに明らかだった。","type":"general","meaning_category":"skill/design"},{"sentence":"Her performance was marked by both passion and artfulness.","translation":"彼女の演技は、情熱と巧妙さの両方によって特徴づけられていた。","type":"general","meaning_category":"skill/artistic ability"}]}