{"word":"Semi-Jesuit","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A person who is partially or nominally associated with the Jesuit order, or who adheres to some but not all Jesuit principles.","english_definition":"A person who is partially or nominally associated with the Jesuit order, or who adheres to some but not all Jesuit principles.","examples":[{"sentence":"He was described as a Semi-Jesuit because he admired their educational methods but disagreed with their political involvement.","translation":"彼はイエズス会の教育方法を高く評価する一方で、彼らの政治的関与には反対していたため、半イエズス会員と評された。"}],"collocations":["Nominal Semi-Jesuit","Partial Semi-Jesuit"],"synonyms":["Jesuit sympathizer","Jesuit-leaning individual"],"antonyms":["Anti-Jesuit","Jesuit detractor"]}],"etymology":{"value":"Formed by combining the prefix 'semi-' meaning 'partially' or 'half' with the term 'Jesuit,' referring to a member of the Society of Jesus.","priority":"Medium"},"pronunciation":{"ipa":"/ˌsɛmi ˈdʒɛzjuɪt/","syllables":"Se-mi-Je-su-it"},"inflection":{"noun_plural":"Semi-Jesuits"},"usage_notes":{"explanation":"The term 'Semi-Jesuit' is not an official designation within the Jesuit order. It is often used informally or pejoratively to describe someone who is perceived to have some Jesuit characteristics or affiliations without being a full member of the order or fully adhering to its principles.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He is a Semi-Jesuit because he went to a Catholic school.","correct":"He is a graduate of a Jesuit school, but that doesn't make him a Semi-Jesuit.","note":"Attending a Catholic or Jesuit school does not automatically make someone a Semi-Jesuit. The term implies a deeper, albeit partial, association or adherence to Jesuit principles."}],"priority":"Low"},"related_words":{"derivatives":["Semi-Jesuitism"],"related_terms":["Jesuit","Society of Jesus","Catholic","Religious Order"]},"level_frequency":{"frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'Semi-Jesuit' is a niche term, generally used in discussions about religious affiliations and adherence to principles. It implies a partial or nominal connection to the Jesuit order, rather than full membership or complete adherence to Jesuit teachings. Understanding requires familiarity with the Jesuit order and its principles."},"example_sentences":[{"sentence":"The historian described several figures of the era as Semi-Jesuits due to their complex relationship with the Society of Jesus.","translation":"歴史家は、その時代の数人の人物がイエズス会との複雑な関係を持っていたため、半イエズス会員と評した。","type":"general","meaning_category":"association"},{"sentence":"His critics labeled him a Semi-Jesuit, accusing him of secretly promoting Jesuit ideals within the government.","translation":"彼の批判者たちは、彼が政府内でイエズス会の理想を密かに推進していると非難し、彼を半イエズス会員とレッテルを貼った。","type":"pejorative","meaning_category":"criticism"}]}