{"word":"Pseudointellectuals","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"知識人ぶる人たち、見せかけの知識人たち","english_definition":"People who pretend to be intellectual or knowledgeable, but lack genuine understanding or expertise.","examples":[{"sentence":"The conference was filled with pseudointellectuals trying to impress each other with complex jargon.","translation":"その会議は、複雑な専門用語でお互いを感心させようとする知識人ぶる人たちでいっぱいだった。"},{"sentence":"He dismissed the critics as pseudointellectuals who didn't understand the true meaning of his work.","translation":"彼は批評家たちを、自分の作品の真の意味を理解していない見せかけの知識人として退けた。"},{"sentence":"The article criticized the rise of pseudointellectuals in online discourse.","translation":"その記事は、オンラインの議論における知識人ぶる人たちの増加を批判した。"}],"collocations":["a gathering of pseudointellectuals","criticizing pseudointellectuals","identifying pseudointellectuals","pseudointellectual discourse","pseudointellectual arguments"],"synonyms":["poseurs","pretenders","fakes","charlatans","sophists"],"antonyms":["intellectuals","experts","scholars","authorities"]},{"part_of_speech":"adjective","definition":"知識人ぶった、見せかけの知識人の","english_definition":"Characteristic of or relating to pseudointellectuals; pretending to be intellectual.","examples":[{"sentence":"The movie was criticized for its pseudointellectual dialogue and pretentious themes.","translation":"その映画は、知識人ぶった台詞と気取ったテーマで批判された。"},{"sentence":"He found the discussion to be overly pseudointellectual and lacking in practical application.","translation":"彼はその議論があまりにも知識人ぶっていて、実用性に欠けていると感じた。"}],"collocations":["pseudointellectual arguments","pseudointellectual discussions","pseudointellectual writing","pseudointellectual ideas","pseudointellectual pretense"],"synonyms":["pretentious","affected","ostentatious","sophistical","insincere"],"antonyms":["genuine","authentic","sincere","intellectual"]}],"etymology":{"value":"The word is formed by combining \"pseudo-\" (meaning false or pretending) with \"intellectuals.\" The term implies that these individuals are not genuinely intellectual but merely feigning it.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊɪnˈtelɪktʃuəlz/","syllables":"pseu-do-in-tel-lec-tu-als"},"inflection":{"noun_plural":"pseudointellectuals"},"usage_notes":{"explanation":"\"Pseudointellectuals\" is a derogatory term used to describe individuals who exhibit the outward signs of being intellectual (e.g., using complex vocabulary, discussing philosophical concepts) but lack genuine understanding or critical thinking skills. The term often carries a negative connotation, suggesting that these individuals are more interested in appearing intelligent than in actually engaging in meaningful intellectual pursuits.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an pseudointellectual.","correct":"✓ He is a pseudointellectual.","note":"The word \"pseudointellectual\" starts with a consonant sound, so the indefinite article \"a\" should be used instead of \"an.\""},{"incorrect":"✗ They are pseudointellectual.","correct":"✓ They are pseudointellectuals.","note":"When referring to multiple people, use the plural form \"pseudointellectuals.\""}],"priority":"★★☆"},"related_words":{"derivatives":["pseudointellectual (adjective)","pseudointellectuality (noun)"],"phrases":["intellectual poseur","armchair philosopher"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, but used in academic and critical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"pseudointellectuals\" refers to people who try to appear intelligent or knowledgeable but don't have a real understanding of the subjects they discuss. It's often used to criticize people who use big words or complicated ideas to impress others without actually knowing what they're talking about. This word is more common in academic or critical writing.","priority":"★★☆"},"example_sentences":[{"sentence":"The debate was dominated by pseudointellectuals who used jargon to confuse the audience.","translation":"その討論会は、専門用語を使って聴衆を混乱させる知識人ぶる人たちによって支配された。","type":"noun","meaning_category":"見せかけの知識人"},{"sentence":"His writing style was criticized as being overly pseudointellectual and pretentious.","translation":"彼の文体は、過度に知識人ぶっていて気取っていると批判された。","type":"adjective","meaning_category":"知識人ぶった"}]}