{"word":"nucleator","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"核剤、造核剤","english_definition":"A substance that promotes nucleation, the initial formation of a nucleus (seed) from which crystals, bubbles, or a new phase can grow.","examples":[{"sentence":"The polymer compound included a nucleator to increase the rate of crystallization.","translation":"そのポリマー化合物には、結晶化速度を上げるために核剤が含まれていた。"},{"sentence":"Adding a nucleator to the solution helped to create a more uniform distribution of bubbles.","translation":"溶液に核剤を加えることで、より均一な気泡分布を作り出すのに役立った。"}],"collocations":["polymer nucleator","crystal nucleator","bubble nucleator","nucleation agent"],"synonyms":["nucleation agent","seeding agent"],"antonyms":[]},{"part_of_speech":"noun","definition":"（まれ）核形成を行うもの、核形成装置","english_definition":"(rare) Something that causes nucleation.","examples":[{"sentence":"The device acted as a nucleator, initiating the formation of ice crystals in the supercooled liquid.","translation":"その装置は核形成装置として機能し、過冷却液体中の氷晶の形成を開始した。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'nucleate' (to form a nucleus) + '-or' (agent suffix).","priority":"★★★"},"pronunciation":{"ipa":"/ˈnjuːkliˌeɪtər/","syllables":"nu-cle-a-tor"},"inflection":{"noun_plural":"nucleators"},"usage_notes":{"explanation":"A 'nucleator' is typically a chemical additive used to control the nucleation process in materials science, particularly in polymers and other crystalline materials. It provides sites for crystal growth, leading to finer and more uniform crystal structures, which can improve the material's properties. The term can also, less commonly, refer to a device or mechanism that initiates nucleation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nucleator was used to break down the polymer.","correct":"✓ The nucleator was used to promote crystallization of the polymer.","note":"Nucleators promote nucleation (crystal formation), not breakdown."}],"priority":"★★☆"},"related_words":{"derivatives":["nucleate","nucleation"],"related_terms":["nucleus","crystal","polymer","crystallization"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency, technical term.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Nucleator' is a technical term used in chemistry and materials science. It refers to a substance added to a material to encourage the formation of nuclei, which are the starting points for crystal growth or phase changes. Understanding this term requires some background knowledge in these fields."},"example_sentences":[{"sentence":"The addition of the nucleator significantly improved the clarity of the plastic film.","translation":"核剤の添加により、プラスチックフィルムの透明度が大幅に向上した。","type":"noun","meaning_category":"核剤"},{"sentence":"Researchers are developing new nucleators for biodegradable polymers.","translation":"研究者たちは、生分解性ポリマーのための新しい核剤を開発している。","type":"noun","meaning_category":"核剤"},{"sentence":"The cloud seeding experiment used silver iodide as a nucleator to induce rainfall.","translation":"雲の種まき実験では、降雨を誘発するためにヨウ化銀を核剤として使用した。","type":"noun","meaning_category":"核剤"}]}