{"word":"BMR","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"基礎代謝量","english_definition":"Basal Metabolic Rate: The amount of energy expended while at rest in a neutrally temperate environment, in the post-absorptive state (meaning that the digestive system is inactive, which requires about twelve hours of fasting).","examples":[{"sentence":"The doctor calculated her BMR to determine her daily caloric needs.","translation":"医者は彼女の1日のカロリー必要量を決定するために、彼女の基礎代謝量を計算した。"},{"sentence":"A high BMR can make it easier to lose weight.","translation":"高い基礎代謝量は、体重を減らすことをより容易にする可能性がある。"}],"collocations":["calculate BMR","increase BMR","lower BMR"],"synonyms":["basal metabolism"],"antonyms":["resting metabolic rate (RMR) - often used interchangeably, but technically slightly different"],"notes":"BMR is measured under more restrictive conditions than RMR. RMR is often used interchangeably with BMR, though RMR measurement is less strict."}],"etymology":{"value":"An acronym for Basal Metabolic Rate.","priority":"★★★"},"pronunciation":{"ipa":"/ˌbiːˌemˈɑːr/","syllables":"B-M-R (bee-em-ar)"},"inflection":{"notes":"It's a noun, so the plural form is BMRs, but it's not commonly used."},"usage_notes":{"explanation":"BMR is a key factor in understanding how many calories a person needs to consume each day to maintain, lose, or gain weight. It's influenced by factors like age, sex, muscle mass, and genetics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ My BMR is very high because I exercise a lot, so my RMR is low.","correct":"✓ My BMR is very high because I exercise a lot, so my resting metabolic rate is also high.","note":"BMR and RMR are highly correlated and both increase with exercise and muscle mass. They don't usually move in opposite directions."}],"priority":"★★☆"},"related_words":{"derivatives":["metabolism","metabolic","basal"],"related_terms":["RMR (Resting Metabolic Rate)","calorie","kilojoule","energy expenditure","thermogenesis"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"BMR stands for Basal Metabolic Rate, which is the amount of energy your body uses when you're completely at rest. It's like the minimum amount of fuel your body needs to keep running. Factors like your age, gender, and muscle mass can affect your BMR. Knowing your BMR can help you understand how many calories you need to eat each day to maintain your weight."},"example_sentences":[{"sentence":"Understanding your BMR is crucial for effective weight management.","translation":"基礎代謝量を理解することは、効果的な体重管理に不可欠です。","type":"general"},{"sentence":"Regular exercise can help increase your BMR over time.","translation":"定期的な運動は、時間をかけて基礎代謝量を増加させるのに役立ちます。","type":"lifestyle"}]}