{"word":"Subtasking","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(プロジェクト管理) サブタスクに分割すること、または分割されたタスクの集合","english_definition":"The act of breaking down a larger task into smaller, more manageable subtasks; or the collection of subtasks resulting from this process.","examples":[{"sentence":"Effective subtasking is crucial for managing complex projects.","translation":"効果的なサブタスク化は、複雑なプロジェクトを管理する上で非常に重要です。"},{"sentence":"The project manager used subtasking to assign responsibilities and track progress.","translation":"プロジェクトマネージャーは、サブタスク化を使って責任を割り当て、進捗状況を追跡しました。"},{"sentence":"Subtasking allowed the team to focus on specific, achievable goals.","translation":"サブタスク化によって、チームは具体的で達成可能な目標に集中することができました。"}],"collocations":["project subtasking","task subtasking","subtasking process","subtasking strategy","subtasking technique"],"synonyms":["task breakdown","decomposition","task splitting","task division"],"antonyms":["task aggregation","task consolidation"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(プロジェクト管理) タスクをサブタスクに分割する","english_definition":"To divide a task into smaller, more manageable subtasks.","examples":[{"sentence":"We need to subtask the main project into smaller, more manageable steps.","translation":"メインプロジェクトを、より小さく、管理しやすいステップにサブタスク化する必要があります。"},{"sentence":"The project manager subtasked the project to improve efficiency.","translation":"プロジェクトマネージャーは、効率を改善するためにプロジェクトをサブタスク化しました。"},{"sentence":"By subtasking, we can better estimate the time and resources needed.","translation":"サブタスク化することで、必要な時間とリソースをより正確に見積もることができます。"}],"collocations":["subtask a project","subtask a task","subtask into smaller steps"],"synonyms":["break down","decompose","split up","divide"],"antonyms":["aggregate","consolidate","combine"]}],"etymology":{"value":"The word \"subtasking\" is formed by combining the prefix \"sub-\" (meaning under, below, or secondary) with the word \"task\" and adding the suffix \"-ing\" to denote an action or process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌbˌtæskɪŋ/","syllables":"sub-task-ing"},"inflection":{"verb_forms":{"present_simple":["subtask","subtasks"],"past_simple":"subtasked","past_participle":"subtasked","present_participle":"subtasking"}},"usage_notes":{"explanation":"\"Subtasking\" is primarily used in project management and software development contexts. It refers to the practice of breaking down large, complex tasks into smaller, more manageable units called subtasks. This allows for better organization, delegation, and tracking of progress. The term can be used as both a noun (the process or result of dividing tasks) and a verb (the act of dividing tasks).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We should subtasking the work.","correct":"✓ We should subtask the work. / ✓ We should do subtasking of the work.","note":"When using \"subtask\" as a verb, ensure the correct verb form is used. \"Subtasking\" is the present participle, while \"subtask\" is the base form. When using it as a noun, you can say \"do subtasking\"."},{"incorrect":"✗ Subtasking is when you make small tasks.","correct":"✓ Subtasking is when you break down a large task into smaller tasks.","note":"Ensure the definition accurately reflects the process of breaking down a larger task, not just creating small tasks in isolation."}],"priority":"★★☆"},"related_words":{"derivatives":["subtask (noun): A smaller task that is part of a larger task.","task (noun): A unit of work that needs to be completed.","project (noun): A temporary endeavor undertaken to create a unique product, service, or result."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in professional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"subtasking\" refers to the project management practice of dividing a large task into smaller, more manageable components. This process is useful for organizing complex projects, delegating responsibilities, and tracking progress more effectively. The word can be used as both a noun, describing the process or the collection of subtasks, and as a verb, describing the action of dividing the task. Understanding the context of project management is crucial for grasping the meaning of this term."},"example_sentences":[{"sentence":"The team used **subtasking** to manage the complex software development project.","translation":"チームは、複雑なソフトウェア開発プロジェクトを管理するために**サブタスク化**を使用しました。","type":"noun","meaning_category":"サブタスクに分割すること"},{"sentence":"The manager **subtasked** the project to improve efficiency and accountability.","translation":"マネージャーは、効率と説明責任を向上させるためにプロジェクトを**サブタスク化**しました。","type":"verb","meaning_category":"タスクをサブタスクに分割する"},{"sentence":"Effective **subtasking** involves breaking down the main goal into achievable steps.","translation":"効果的な**サブタスク化**には、主な目標を達成可能なステップに分割することが含まれます。","type":"noun","meaning_category":"サブタスクに分割すること"},{"sentence":"By **subtasking** the project, we were able to identify potential bottlenecks.","translation":"プロジェクトを**サブタスク化**することで、潜在的なボトルネックを特定することができました。","type":"verb","meaning_category":"タスクをサブタスクに分割する"}]}