{"word":"Erotopath","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(精神医学、古風) 性的倒錯の一種で、他者から愛されているという妄想を抱く人。","english_definition":"(psychiatry, archaic) A person who suffers from erotomania, a delusional belief that another person is in love with them.","examples":[{"sentence":"The psychiatrist diagnosed her as an Erotopath after she insisted a celebrity was secretly in love with her.","translation":"精神科医は、彼女が有名人が密かに自分に恋をしていると主張した後、彼女を色情症患者と診断した。"}],"collocations":["diagnose as Erotopath","suffer from Erotopathia"],"synonyms":["erotomaniac","de Clerambault's syndrome sufferer"],"antonyms":[]}],"etymology":{"value":"Derived from Greek roots: ἔρως (érōs) meaning 'love, sexual love' and πάθος (páthos) meaning 'suffering, disease'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈrɒtəˌpæθ/","syllables":"E-ro-to-path"},"inflection":{"noun_plural":"Erotopaths"},"usage_notes":{"explanation":"'Erotopath' is an archaic term, primarily used in historical psychiatric contexts. The modern term for the condition is 'erotomania'. The term describes an individual who holds a delusional belief that another person, often of higher social status, is in love with them. This delusion is not based on reality and persists despite evidence to the contrary.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Erotopath because he likes romantic movies.","correct":"✓ He is an Erotopath because he delusionally believes a famous actress is in love with him.","note":"Being fond of romantic movies doesn't make someone an Erotopath. The term specifically refers to the delusional belief of being loved by someone else."}],"priority":"★★☆"},"related_words":{"derivatives":["Erotopathia (noun: erotomania)","Erotomania (noun: delusional belief of being loved by another)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - an archaic term rarely used in modern contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Erotopath' is a highly specialized and archaic term referring to a person experiencing erotomania. This condition involves a persistent, delusional belief that another person is in love with them. Due to its infrequent use and clinical nature, this term is rarely encountered outside of historical or psychiatric literature. Understanding requires familiarity with psychological terminology and historical medical concepts."},"example_sentences":[{"sentence":"The case study described a female Erotopath fixated on a local politician.","translation":"その症例研究は、地元の政治家に執着する女性の色情症患者について記述していた。","type":"noun","meaning_category":"色情症患者"},{"sentence":"Historically, Erotopaths were often misunderstood and stigmatized.","translation":"歴史的に、色情症患者はしばしば誤解され、偏見を持たれていた。","type":"noun","meaning_category":"色情症患者"}]}