{"word":"Combflower","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A plant of the genus Schizanthus, native to Chile, noted for its intricately patterned and colorful flowers.","english_definition":"A plant of the genus Schizanthus, native to Chile, noted for its intricately patterned and colorful flowers.","examples":[{"sentence":"The combflower in her garden was a vibrant mix of pink and purple.","translation":"彼女の庭のコンブフラワーは、ピンクと紫の見事な組み合わせだった。"},{"sentence":"Combflowers are relatively easy to grow from seed, making them popular with home gardeners.","translation":"コンブフラワーは種から比較的簡単に育てられるため、家庭菜園家にも人気がある。"}],"collocations":["grow combflowers","combflower seeds","combflower varieties","combflower garden","combflower care"],"synonyms":["Schizanthus","butterfly flower","poor man's orchid"],"antonyms":[]}],"etymology":{"value":"The name 'Schizanthus' comes from the Greek words 'schizein' meaning 'to split' and 'anthos' meaning 'flower', referring to the split petals of the flower.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkoʊmˌflaʊər/","syllables":"comb-flow-er"},"inflection":{"noun_plural":"combflowers"},"usage_notes":{"explanation":"Combflowers, scientifically known as Schizanthus, are ornamental plants prized for their showy, orchid-like flowers. They are often grown as annuals, although they are technically short-lived perennials. They require well-drained soil and partial shade.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I watered the combflower too much, and it died.","correct":"✓ I overwatered the combflower, and it died.","note":"'Overwatered' is a more precise term for giving a plant too much water."},{"incorrect":"✗ Combflower is very resistent to the sun.","correct":"✓ Combflower is not very resistant to the sun.","note":"Combflowers prefer partial shade, so they are not particularly resistant to full sun."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["Schizanthus pinnatus","Schizanthus grahamii","Schizanthus wisetonensis"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'combflower' refers to a specific genus of flowering plants, Schizanthus, known for their unique flower structure. Understanding this term requires some familiarity with botany and gardening. The word itself is not commonly used in everyday conversation, but is more likely to appear in horticultural contexts."},"example_sentences":[{"sentence":"The delicate combflower added a touch of exotic beauty to the cottage garden.","translation":"その繊細なコンブフラワーは、コテージガーデンにエキゾチックな美しさを添えた。","type":"noun","meaning_category":"plant"},{"sentence":"She carefully planted the combflower seedlings in a sheltered spot.","translation":"彼女はコンブフラワーの苗を、日陰になる場所に丁寧に植えた。","type":"noun","meaning_category":"plant"}]}