{"word":"transcriptase","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"転写酵素","english_definition":"An enzyme that catalyzes the formation of RNA from a DNA template (DNA-dependent RNA polymerase) or DNA from an RNA template (reverse transcriptase).","examples":[{"sentence":"Reverse transcriptase is essential for the replication of retroviruses.","translation":"逆転写酵素はレトロウイルスの複製に不可欠です。"},{"sentence":"Transcriptase enzymes are used in molecular biology research.","translation":"転写酵素は分子生物学の研究で使用されます。"}],"collocations":["reverse transcriptase","DNA-dependent RNA transcriptase","RNA transcriptase"],"synonyms":["RNA polymerase","reverse transcriptase"],"antonyms":[]}],"etymology":{"value":"Derived from 'transcription' (the process of copying DNA into RNA) and '-ase' (a suffix denoting an enzyme).","priority":"★★☆"},"pronunciation":{"ipa":"/trænˈskrɪpteɪs/","syllables":"tran-scrip-tase"},"inflection":{"noun_plural":"transcriptases"},"usage_notes":{"explanation":"'Transcriptase' broadly refers to enzymes involved in transcription. However, it's often used to specifically mean 'reverse transcriptase', an enzyme that synthesizes DNA from an RNA template. Context is important to determine the specific type of transcriptase being referred to.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Transcriptase is a type of DNA.","correct":"✓ Transcriptase is a type of enzyme.","note":"Transcriptase is an enzyme, not a type of DNA."},{"incorrect":"✗ Transcriptase only works on DNA templates.","correct":"✓ Reverse transcriptase works on RNA templates, while DNA-dependent RNA transcriptase works on DNA templates.","note":"It is important to specify the type of transcriptase, as reverse transcriptase uses RNA templates."}],"priority":"★★☆"},"related_words":{"derivatives":["transcription","reverse transcription","reverse transcriptase","polymerase"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Transcriptase' is a technical term used in molecular biology. It refers to enzymes that are involved in the process of transcription, which is the synthesis of RNA from a DNA template. A key point is that 'transcriptase' can refer to different types of enzymes, including reverse transcriptase, which is particularly important in the context of retroviruses like HIV. Understanding this term requires a background in biology and genetics."},"example_sentences":[{"sentence":"The discovery of reverse transcriptase revolutionized molecular biology.","translation":"逆転写酵素の発見は分子生物学に革命をもたらしました。","type":"general","meaning_category":"general"},{"sentence":"PCR utilizes transcriptase to amplify DNA sequences.","translation":"PCRは、DNA配列を増幅するために転写酵素を利用します。","type":"general","meaning_category":"general"},{"sentence":"Some viruses use transcriptase to replicate their genetic material.","translation":"一部のウイルスは、遺伝物質を複製するために転写酵素を使用します。","type":"general","meaning_category":"general"}]}