{"word":"Cuculidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カッコウ科","english_definition":"The cuckoo family of birds.","examples":[{"sentence":"The Cuculidae family includes cuckoos, roadrunners, and anis.","translation":"カッコウ科には、カッコウ、ロードランナー、およびアメリカバサが含まれます。"}],"collocations":[],"synonyms":["cuckoo family"],"antonyms":[]}],"etymology":{"value":"New Latin, from Cuculus (the genus of cuckoos) + -idae (standard suffix for zoological families). Cuculus is onomatopoeic, imitating the cuckoo's call.","priority":"★★☆"},"pronunciation":{"ipa":"/kjuːˈkjuːlɪdiː/","syllables":"Cu-cu-li-dae"},"inflection":{"noun_plural":"Cuculidae (same form for singular and plural)"},"usage_notes":{"explanation":"In biological taxonomy, Cuculidae refers specifically to the family of birds that includes cuckoos, roadrunners, and related species. It's primarily used in scientific or ornithological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["cuculiform (adjective: cuckoo-shaped)","Cuculus (genus of typical cuckoos)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Low frequency (scientific contexts)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Cuculidae' is a scientific term used in biology, specifically ornithology, to refer to the cuckoo family of birds. It's not a word commonly used in everyday conversation and is primarily found in scientific literature or discussions related to bird taxonomy. Understanding this term requires familiarity with biological classification systems."},"example_sentences":[{"sentence":"The evolutionary relationships within the Cuculidae family are complex and still being studied.","translation":"カッコウ科内の進化関係は複雑であり、現在も研究されています。","type":"general","meaning_category":"scientific"},{"sentence":"Many species in the Cuculidae are brood parasites, laying their eggs in the nests of other birds.","translation":"カッコウ科の多くの種は托卵寄生であり、他の鳥の巣に卵を産みます。","type":"general","meaning_category":"scientific"}]}