{"word":"NaN","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(プログラミング) Not a Number: 数値ではないことを表す特別な値。主に浮動小数点演算の結果が定義できない場合（例：0 ÷ 0）に用いられる。","english_definition":"(programming) Not a Number: a special value representing an undefined or unrepresentable numerical result, especially in floating-point arithmetic (e.g., the result of 0 ÷ 0).","examples":[{"sentence":"The function returned NaN because the input was invalid.","translation":"入力が無効だったため、関数はNaNを返しました。"},{"sentence":"Check for NaN before using the result of the calculation.","translation":"計算結果を使用する前に、NaNであるかどうかを確認してください。"}],"collocations":["is NaN","check for NaN","return NaN","NaN value","floating-point NaN"],"synonyms":["invalid number","undefined number"],"antonyms":["number","valid number"]}],"etymology":{"value":"Short for 'Not a Number'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛn.eɪˈɛn/","syllables":"NaN"},"inflection":{"noun_plural":"NaNs"},"usage_notes":{"explanation":"NaN is a special floating-point value used in programming to represent results that are undefined or cannot be represented as a number. Common causes include dividing zero by zero, taking the square root of a negative number, or performing arithmetic operations on non-numeric data. It's important to check for NaN values to prevent errors in calculations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"NaN == NaN","correct":"Number.isNaN(NaN)","note":"In many programming languages, NaN is not equal to itself. You should use a function like `isNaN()` or `Number.isNaN()` to check if a value is NaN."},{"incorrect":"Treating NaN as zero.","correct":"Explicitly handle NaN values.","note":"NaN should not be treated as zero or any other specific number. It indicates an invalid or undefined result and should be handled accordingly."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["floating-point arithmetic","IEEE 754","undefined","null","infinity"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency (technical term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"NaN\" stands for \"Not a Number.\" It's a special value in computer programming that you get when a calculation doesn't make sense, like dividing zero by zero. It's important for programmers to check for NaN because if they don't, it can cause problems in their programs. Unlike regular numbers, NaN is not equal to itself, so you need to use a special function to check if a value is NaN."},"example_sentences":[{"sentence":"The square root of a negative number results in NaN.","translation":"負の数の平方根はNaNになります。","type":"noun","meaning_category":"Not a Number"},{"sentence":"The program crashed because it didn't handle the NaN value properly.","translation":"プログラムは、NaN値を適切に処理しなかったためにクラッシュしました。","type":"noun","meaning_category":"Not a Number"}]}