{"word":"interradium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(数学)多面体の内接球の半径","english_definition":"(mathematics) The radius of the insphere of a polyhedron.","examples":[{"sentence":"The interradium of a regular tetrahedron can be calculated using its edge length.","translation":"正四面体の内接球の半径は、その辺の長さを用いて計算できます。"}],"collocations":[],"synonyms":["insphere radius"],"antonyms":[]}],"etymology":{"value":"'inter-' (間に) + 'radium' (半径)","priority":"★★★"},"pronunciation":{"ipa":"ˌɪntərˈreɪdiəm","syllables":"in-ter-ra-di-um"},"inflection":{"noun_plural":"interradia"},"usage_notes":{"explanation":"'Interradium' is a relatively specialized term in geometry, specifically referring to the radius of the largest sphere that can be inscribed within a polyhedron (the insphere). It's most commonly encountered in mathematical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The interradius is the same as the circumradius.","correct":"The interradium is different from the circumradius.","note":"The interradium (insphere radius) and circumradius (circumsphere radius) are generally different for a polyhedron. The circumradius is the radius of the sphere that passes through all the vertices of the polyhedron."}],"priority":"★☆☆"},"related_words":{"derivatives":["insphere","polyhedron","radius","circumradius"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Interradium' is a technical term used in geometry. It refers to the radius of the largest sphere that can fit inside a polyhedron, touching each of its faces. This term is not commonly used outside of advanced mathematical discussions. Understanding the concept of an insphere is essential to understanding the interradium."},"example_sentences":[{"sentence":"The formula to calculate the interradium depends on the specific type of polyhedron.","translation":"内接球の半径を計算する公式は、多面体の種類によって異なります。","type":"noun","meaning_category":"数学"},{"sentence":"Finding the interradium is a key step in determining the volume of certain polyhedra.","translation":"内接球の半径を求めることは、特定の多面体の体積を決定する上で重要なステップです。","type":"noun","meaning_category":"数学"}]}