{"word":"carkingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"心配そうに、苦悩して、悩ましく","english_definition":"In a worried, anxious, or troubled manner; fretfully.","examples":[{"sentence":"He looked at the bills carkingly, wondering how he would pay them.","translation":"彼はどうやって支払うか心配そうに請求書を見た。"},{"sentence":"She paced the room carkingly, awaiting news of her family.","translation":"彼女は家族の知らせを待ちながら、部屋を苦悩して歩き回った。"}],"collocations":["look carkingly","pace carkingly","think carkingly"],"synonyms":["anxiously","worriedly","fretfully","troubledly","distressedly"],"antonyms":["calmly","peacefully","serenely"]}],"etymology":{"value":"The word 'carkingly' is derived from 'cark', which means to worry, fret, or be anxious. The suffix '-ingly' turns it into an adverb, indicating the manner in which something is done.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɑːrkɪŋli/","syllables":"cark-ing-ly"},"inflection":{"notes":"This is an adverb, so it does not have different forms."},"usage_notes":{"explanation":"'Carkingly' is an adverb that describes actions done in a worried or anxious manner. It is not a commonly used word in modern English, and might be considered somewhat archaic or formal. It is used to emphasize the emotional state of someone who is deeply concerned or troubled.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She smiled carkingly.","correct":"✓ She smiled anxiously.","note":"Smiling typically doesn't express worry or anxiety. Use 'carkingly' with actions that can express concern or trouble."}],"priority":"★☆☆"},"related_words":{"derivatives":["cark (verb, noun): to worry, fret; a cause of anxiety","carking (adjective): causing worry or anxiety"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Carkingly' is a relatively rare and formal word, best suited for advanced learners. It describes actions performed in a worried or anxious manner, adding a layer of emotional depth to the description. Due to its infrequent use, it's more likely to be encountered in literature or formal writing rather than everyday conversation."},"example_sentences":[{"sentence":"He stared carkingly at the stock market reports.","translation":"彼は株式市場のレポートを心配そうに見つめた。","type":"adverb","meaning_category":"worryingly"},{"sentence":"She wrung her hands carkingly, awaiting the doctor's call.","translation":"彼女は医者からの電話を待ちながら、苦悩して手を揉んだ。","type":"adverb","meaning_category":"anxiously"}]}