{"word":"re-enthronement","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再び王位につけること、再即位","english_definition":"The act of enthroning again; the restoration of a monarch to their throne.","examples":[{"sentence":"The re-enthronement of the king marked a new era for the country.","translation":"国王の再即位は、その国にとって新しい時代の到来を意味した。"},{"sentence":"After years of exile, the prince's re-enthronement was celebrated by the people.","translation":"長年の亡命の後、王子の再即位は国民によって祝われた。"}],"collocations":["ceremony of re-enthronement","re-enthronement celebration"],"synonyms":["restoration","reinstatement","reestablishment"],"antonyms":["dethronement","abdication","removal"]}],"etymology":{"value":"The word is formed by adding the prefix \"re-\" (meaning again or anew) to the word \"enthronement\" (the act of placing a monarch on a throne).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːɪnˈθroʊnmənt/","syllables":"re-en-throne-ment"},"inflection":{"noun_plural":"re-enthronements"},"usage_notes":{"explanation":"\"Re-enthronement\" refers specifically to the act of placing a monarch back on the throne after they have been removed or have lost their position. It implies a restoration of power and authority.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The re-enthronement of the president.","correct":"✓ The inauguration of the president.","note":"\"Re-enthronement\" is specifically for monarchs. For presidents or other elected officials, use \"inauguration\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["re-enthrone (verb)","enthronement (noun)","throne (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"re-enthronement\" is a formal term referring to the act of restoring a monarch to their throne. It is typically used in historical or political contexts when discussing the return of a king or queen to power after a period of absence or removal. The word is relatively uncommon and may not be familiar to those without a strong background in history or political science."},"example_sentences":[{"sentence":"The historical documents detailed the elaborate ceremony of the emperor's re-enthronement.","translation":"その歴史的文書は、天皇の再即位の精巧な儀式について詳しく記述していた。","type":"noun","meaning_category":"再即位"},{"sentence":"The people hoped that the re-enthronement would bring stability to the war-torn nation.","translation":"人々は、再即位が戦争で荒廃した国に安定をもたらすことを願っていた。","type":"noun","meaning_category":"再即位"}]}