{"word":"Dicyanodiamide","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ジシアンジアミド（肥料、硬化剤、難燃剤などとして使用される化合物）","english_definition":"A crystalline compound (C2H4N4) used as a fertilizer, in the manufacture of melamine, as a curing agent for epoxy resins, and as a flame retardant.","examples":[{"sentence":"Dicyanodiamide is used in slow-release fertilizers.","translation":"ジシアンジアミドは、徐放性肥料に使用されます。"},{"sentence":"The addition of dicyanodiamide improves the flame retardancy of the material.","translation":"ジシアンジアミドの添加は、材料の難燃性を向上させます。"}],"collocations":["dicyanodiamide fertilizer","dicyanodiamide resin","dicyanodiamide production"],"synonyms":["cyanoguanidine","DCD"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'di-' (two), 'cyano-' (referring to the cyanide group), and 'diamide' (a type of amide).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪˌsaɪənoʊˈdaɪəmaɪd/","syllables":"di-cy-a-no-di-a-mide"},"inflection":{"noun_plural":"dicyanodiamides"},"usage_notes":{"explanation":"Dicyanodiamide, often abbreviated as DCD, is a chemical compound primarily used in agriculture and industry. In agriculture, it acts as a nitrification inhibitor, slowing down the conversion of ammonium to nitrate in the soil, which helps to reduce nitrogen loss and improve fertilizer efficiency. Industrially, it is used in the production of melamine and as a curing agent for epoxy resins.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Dicyanodiamide is a vitamin.","correct":"✓ Dicyanodiamide is a chemical compound used as a fertilizer and curing agent.","note":"Dicyanodiamide is not a vitamin but a chemical compound with specific industrial and agricultural applications."}],"priority":"★☆☆"},"related_words":{"derivatives":["melamine","guanidine","cyanide"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Dicyanodiamide is a technical term referring to a specific chemical compound. Understanding its usage requires knowledge of chemistry or related fields. The term is primarily encountered in scientific literature, agricultural contexts, or industrial applications involving chemical processes. Its meaning is precise and technical, relating to its function as a fertilizer component, resin curing agent, or flame retardant.","priority":"★☆☆"},"example_sentences":[{"sentence":"The farmer used dicyanodiamide to reduce nitrogen runoff from his fields.","translation":"その農家は、畑からの窒素流出を減らすためにジシアンジアミドを使用しました。","type":"noun","meaning_category":"chemical compound"},{"sentence":"Dicyanodiamide is a key ingredient in the production of certain types of resins.","translation":"ジシアンジアミドは、特定の種類の樹脂の製造における重要な成分です。","type":"noun","meaning_category":"chemical compound"}]}