{"word":"Carlylese","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"カーライル風の文体、カーライル特有の文体","english_definition":"The peculiar, forceful, and often eccentric writing style of Thomas Carlyle, characterized by neologisms, archaisms, Germanisms, and a generally emphatic and idiosyncratic tone.","examples":[{"sentence":"His writing was often dismissed as mere Carlylese.","translation":"彼の文章はしばしば単なるカーライル風の文体として片付けられた。"},{"sentence":"The essay was written in a dense Carlylese, making it difficult to understand.","translation":"そのエッセイは難解なカーライル風の文体で書かれており、理解するのが難しかった。"}],"collocations":["written in Carlylese","dense Carlylese","pure Carlylese"],"synonyms":["bombast","rhetoric","prose"],"antonyms":[]},{"part_of_speech":"adjective","definition":"カーライル風の、カーライルの文体に似た","english_definition":"Resembling or characteristic of the writing style of Thomas Carlyle.","examples":[{"sentence":"The author adopted a Carlylese tone in his historical essays.","translation":"その著者は歴史エッセイの中でカーライル風の口調を採用した。"},{"sentence":"The passage is marked by its Carlylese syntax and vocabulary.","translation":"その一節は、カーライル風の構文と語彙によって特徴付けられている。"}],"collocations":["Carlylese style","Carlylese prose","Carlylese syntax"],"synonyms":["rhetorical","forceful","eccentric"],"antonyms":[]}],"etymology":{"value":"Named after Thomas Carlyle (1795-1881), a Scottish essayist, historian, and philosopher known for his distinctive and highly idiosyncratic writing style. The suffix '-ese' is used to denote a style or language associated with a particular person or place.","priority":"★★★"},"pronunciation":{"ipa":"/kɑːrˈlaɪˌliːz/","syllables":"Car-ly-lese"},"inflection":{"notes":"The word 'Carlylese' can function as both a noun (referring to the style itself) and an adjective (describing something that resembles the style). As a noun, it is generally uncountable. As an adjective, it does not inflect.","noun_plural":null},"usage_notes":{"explanation":"'Carlylese' is used to describe a very specific and recognizable writing style. It's not simply 'good' or 'bad' writing, but rather a particular way of using language that is associated with Carlyle. It often implies a certain degree of complexity, archaism, and forceful expression.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke in Carlylese.","correct":"✓ He used a Carlylese style in his writing.","note":"'Carlylese' primarily refers to a writing style, not a spoken style. While someone might *sound* like they're using Carlylese, it's more accurate to say they're using a Carlylese style in their writing."}],"priority":"★☆☆"},"related_words":{"derivatives":["Carlylian (adjective: pertaining to Thomas Carlyle)"],"phrases":["in the style of Carlyle"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Very specialized vocabulary, likely only encountered in literary criticism or academic contexts.)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Carlylese' is a highly specialized term used in literary analysis to describe the unique and often challenging writing style of Thomas Carlyle. It's unlikely to be encountered outside of academic or literary contexts. Understanding the term requires familiarity with Carlyle's works and the characteristics of his writing, such as his use of neologisms, archaisms, and unusual sentence structures.","priority":"★☆☆"},"example_sentences":[{"sentence":"The professor described the passage as 'pure Carlylese,' noting its convoluted syntax and obscure vocabulary.","translation":"教授はその一節を「純粋なカーライル風」と評し、その複雑な構文と難解な語彙を指摘した。","type":"noun","meaning_category":"カーライル風の文体"},{"sentence":"The author's attempt at a Carlylese style fell flat, lacking the genuine force and originality of the original.","translation":"その著者のカーライル風の文体への試みは失敗に終わり、本物の力強さと独創性を欠いていた。","type":"adjective","meaning_category":"カーライル風の"}]}