{"word":"ramoon","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A tropical tree, Brosimum alicastrum, of the mulberry family, native to the Americas, whose seeds and leaves are edible.","english_definition":"A tropical tree, Brosimum alicastrum, of the mulberry family, native to the Americas, whose seeds and leaves are edible.","examples":[{"sentence":"The ramoon tree provides a valuable food source in some regions.","translation":"ラモンの木は、一部の地域で貴重な食料源となっています。"}],"collocations":["ramoon tree","edible ramoon","harvest ramoon"],"synonyms":["breadnut","maya nut"],"antonyms":[]}],"etymology":{"value":"Likely derived from a local indigenous language of Central America, where the tree is native.","priority":"★★☆"},"pronunciation":{"ipa":"/rɑːˈmuːn/","syllables":"ra-moon"},"inflection":{"noun_plural":"ramoons"},"usage_notes":{"explanation":"The term 'ramoon' specifically refers to the Brosimum alicastrum tree and its edible parts. It's most commonly used in regions where the tree grows natively, such as Central America and parts of South America. The seeds are often roasted and used as a coffee substitute or ground into flour.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ ramon","correct":"✓ ramoon","note":"The correct spelling is 'ramoon' with a double 'o'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["Brosimum utile (cow-tree)","Brosimum paraense"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specialized contexts related to botany or regional cuisine.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'ramoon' is a relatively uncommon term referring to a specific tropical tree, Brosimum alicastrum. It is most likely to be encountered in texts concerning botany, ethnobotany, or the cuisine and ecology of Central and South America. Understanding the term requires a degree of familiarity with specialized vocabulary related to plant species and regional food sources."},"example_sentences":[{"sentence":"The ancient Maya relied on the ramoon tree as a staple food source.","translation":"古代マヤ人は、ラモンの木を主食として頼っていました。","type":"noun","meaning_category":"tree"},{"sentence":"Ramoon seeds can be roasted and ground into a nutritious flour.","translation":"ラモンの種子はローストして挽いて、栄養価の高い小麦粉にすることができます。","type":"noun","meaning_category":"edible parts"}]}