{"word":"lion-maned","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ライオンのたてがみのような、またはそれを持つ","english_definition":"Having a mane resembling that of a lion.","examples":[{"sentence":"The lion-maned dog stood proudly in the show ring.","translation":"ライオンのたてがみのような毛並みの犬が、品評会のリングで誇らしげに立っていた。"},{"sentence":"He was a lion-maned warrior, feared by all.","translation":"彼はライオンのたてがみのような髪をした戦士で、皆に恐れられていた。"}],"collocations":["lion-maned dog","lion-maned warrior","lion-maned appearance"],"synonyms":["maned","shaggy","hirsute"],"antonyms":["smooth","sleek","short-haired"]}],"etymology":{"value":"The term 'lion-maned' is a compound adjective formed by combining 'lion' (referring to the animal) and 'maned' (having a mane).","priority":"★★★"},"pronunciation":{"ipa":"/ˈlaɪənˌmeɪnd/","syllables":"li-on-maned"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"'Lion-maned' is typically used to describe animals or people who have a thick, flowing mane of hair that resembles the mane of a lion. It is often used to evoke a sense of power, wildness, or majesty.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lion-maned cat.","correct":"✓ The long-haired cat.","note":"While some cats may have thick fur, 'lion-maned' is typically reserved for creatures with a distinct mane, like some dog breeds or mythological creatures."}],"priority":"★☆☆"},"related_words":{"derivatives":["lion (noun)","mane (noun)"],"related_terms":["lion-like","maned wolf"]},"level_frequency":{"frequency_google_ngram":"Low frequency - This is a relatively uncommon term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lion-maned' is a descriptive adjective used to portray something with a mane similar to that of a lion. It is not a commonly used term and may be found more often in descriptive or literary contexts. The reader should understand the characteristics of a lion's mane to fully grasp the imagery conveyed by this word."},"example_sentences":[{"sentence":"The majestic lion-maned horse galloped across the field.","translation":"威厳のあるライオンのたてがみのような毛並みの馬が、野原を駆け抜けた。","type":"descriptive","meaning_category":"appearance"},{"sentence":"The artist painted a mythical creature with a lion-maned head.","translation":"その芸術家はライオンのたてがみのような頭を持つ神話上の生き物を描いた。","type":"literary","meaning_category":"description"}]}