{"word":"Compartner","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(造語)共同経営者、共同出資者、事業パートナー","english_definition":"(Neologism) A co-partner; a business partner or associate, especially in a company or enterprise.","examples":[{"sentence":"She is my compartner in this venture.","translation":"彼女はこの事業における私の共同経営者です。"},{"sentence":"We need a reliable compartner to expand our business.","translation":"事業を拡大するためには、信頼できる共同出資者が必要です。"}],"collocations":["business compartner","venture compartner"],"synonyms":["co-partner","business partner","associate","collaborator"],"antonyms":["competitor","rival"]}],"etymology":{"value":"A blend of 'company' and 'partner'. A relatively recent neologism, likely created to emphasize the collaborative nature of the partnership.","priority":"★★☆"},"pronunciation":{"ipa":"/kəmˈpɑːrtnər/","syllables":"com-part-ner"},"inflection":{"noun_plural":"compartners"},"usage_notes":{"explanation":"'Compartner' is a relatively uncommon neologism, meaning it's a newly coined word. It is used to describe someone who is both a partner and part of a company, often implying a deeper level of involvement and shared responsibility than a simple 'partner'. While understandable, it is not as widely recognized or used as 'business partner' or 'co-partner'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a compartner of the project.","correct":"✓ He is a compartner in the project. / ✓ He is a partner in the project.","note":"While 'compartner of' is sometimes used, 'compartner in' is more common and natural. However, 'partner in' is the most widely accepted and understood phrase."}],"priority":"★☆☆"},"related_words":{"derivatives":["co-partner (more common synonym)","partnership","company"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not a standard CEFR word)","frequency_google_ngram":"Low frequency (低頻度) - Not a commonly used word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Compartner' is a neologism, meaning it's a relatively new and uncommon word. It combines 'company' and 'partner' to describe someone who is both a partner and part of a company. Because it's not a standard word, its meaning might not be immediately clear to everyone, and it's generally better to use more common alternatives like 'business partner' or 'co-partner' for clarity."},"example_sentences":[{"sentence":"As a compartner, she was involved in all major decisions.","translation":"共同経営者として、彼女はすべての主要な決定に関与していました。","type":"noun","meaning_category":"共同経営者"},{"sentence":"They became compartners to start a new tech company.","translation":"彼らは新しいテクノロジー企業を始めるために共同出資者となった。","type":"noun","meaning_category":"共同出資者"}]}