{"word":"lampooner","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"風刺作家、痛烈な批判者","english_definition":"A writer who uses satire to ridicule or attack someone or something.","examples":[{"sentence":"The political lampooner spared no one in his scathing articles.","translation":"その政治風刺作家は、痛烈な記事で誰をも容赦しなかった。"},{"sentence":"As a lampooner, he was known for his sharp wit and biting commentary.","translation":"風刺作家として、彼は鋭い機知と辛辣な批評で知られていた。"},{"sentence":"The magazine hired a lampooner to add a humorous edge to their content.","translation":"その雑誌は、コンテンツにユーモラスなエッジを加えるために風刺作家を雇った。"}],"collocations":["political lampooner","social lampooner","literary lampooner"],"synonyms":["satirist","caricaturist","parodist","critic","mocker"],"antonyms":["supporter","admirer","eulogist"]}],"etymology":{"value":"Derived from the word 'lampoon,' which originated from the French 'lampon,' meaning 'a drinking song, a ribald satire.' The suffix '-er' denotes a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/læmˈpuːnər/","syllables":"lam-poon-er"},"inflection":{"noun_plural":"lampooners"},"usage_notes":{"explanation":"A 'lampooner' is someone who uses satire, often in a harsh or biting way, to criticize or ridicule individuals, institutions, or society in general. The term implies a deliberate and often humorous attempt to expose flaws or follies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a lampooner of his friends.","correct":"He is a lampooner of political figures.","note":"'Lampooner' typically refers to someone who satirizes public figures or institutions, not usually personal friends."}],"priority":"★☆☆"},"related_words":{"derivatives":["lampoon (noun/verb)","lampoonery (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'lampooner' refers to a person who writes or creates lampoons, which are satirical attacks that ridicule someone or something. This word is not commonly used in everyday conversation and is more often found in literary or academic contexts. Understanding the term requires a familiarity with satire and critical writing.","priority":"★☆☆"},"example_sentences":[{"sentence":"The famous lampooner skewered the politician's hypocrisy in his latest article.","translation":"その有名な風刺作家は、最新の記事で政治家の偽善を痛烈に批判した。","type":"general","meaning_category":"風刺作家"},{"sentence":"Many consider him a modern-day lampooner, unafraid to challenge the status quo.","translation":"多くの人が彼を現代の風刺作家とみなし、現状に挑戦することを恐れない。","type":"general","meaning_category":"風刺作家"}]}