{"word":"mammatropic","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"Having an affinity for or stimulating the mammary glands.","english_definition":"Having a stimulating effect on the mammary glands; promoting the growth or activity of mammary tissue.","examples":[{"sentence":"Prolactin is a mammatropic hormone essential for lactation.","translation":"プロラクチンは授乳に不可欠な乳腺刺激ホルモンです。"},{"sentence":"Certain drugs can have mammatropic effects, leading to breast enlargement.","translation":"特定の薬は乳腺刺激作用を持ち、乳房の肥大を引き起こす可能性があります。"}],"collocations":["mammatropic hormone","mammatropic effect","mammatropic activity"],"synonyms":["lactogenic","prolactin-like"],"antonyms":["anti-mammatropic"],"notes":["Primarily used in medical or scientific contexts."]}],"etymology":{"value":"Derived from 'mamma' (Latin for breast) and '-tropic' (having an affinity for or stimulating).","priority":"medium"},"pronunciation":{"ipa":"/ˌmæməˈtrɑːpɪk/","syllables":"mam-ma-trop-ic"},"inflection":{"notes":"Adjective; comparative and superlative forms (more mammatropic, most mammatropic) exist but are rarely used."},"usage_notes":{"explanation":"The term 'mammatropic' is mainly used in the fields of endocrinology, pharmacology, and reproductive biology to describe substances or hormones that influence the development or function of the mammary glands. It is not a commonly used word in everyday language.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant has mammatropic properties.","correct":"✓ The plant extract has potential mammatropic effects.","note":"Ensure the context is appropriate; 'mammatropic' should be used when there is a direct or scientifically plausible link to mammary gland stimulation."}],"priority":"low"},"related_words":{"derivatives":["mammotropin (noun): A hormone that stimulates the mammary glands."],"related_terms":["mammary gland","prolactin","estrogen","lactation"],"priority":"medium"},"level_frequency":{"frequency_google_ngram":"Very low frequency. Primarily a scientific term.","priority":"low"},"readability_explanation":{"level":"C2","text":"'Mammatropic' is a technical term primarily encountered in scientific or medical texts related to endocrinology or reproductive biology. Understanding requires familiarity with basic anatomy and physiology, particularly concerning the mammary glands and hormonal influences. It describes substances that have a stimulating effect on mammary tissue. Due to its specialized usage, it's unlikely to be found outside of these contexts."},"example_sentences":[{"sentence":"The researchers investigated the mammatropic effects of the compound on breast cancer cells.","translation":"研究者たちは、その化合物が乳がん細胞に及ぼす乳腺刺激作用を調査しました。","type":"scientific","meaning_category":"stimulating mammary glands"},{"sentence":"Estrogen and prolactin are key mammatropic hormones during pregnancy.","translation":"エストロゲンとプロラクチンは、妊娠中の主要な乳腺刺激ホルモンです。","type":"medical","meaning_category":"hormonal influence on mammary glands"}]}