{"word":"Raytheon","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"レイセオン (アメリカ合衆国の軍事産業複合企業)","english_definition":"A major U.S. defense contractor and industrial corporation with core manufacturing concentrations in weapons and military and commercial electronics.","examples":[{"sentence":"Raytheon is one of the largest defense contractors in the world.","translation":"レイセオンは世界最大の軍事企業の一つです。"},{"sentence":"Raytheon's products include missiles, radar systems, and other advanced technologies.","translation":"レイセオンの製品には、ミサイル、レーダーシステム、その他の高度な技術が含まれています。"}],"collocations":["Raytheon Technologies","Raytheon missile","Raytheon radar"],"synonyms":["defense contractor","military industrial complex"],"antonyms":[]}],"etymology":{"value":"The name 'Raytheon' is a combination of 'ray' (referring to light or electromagnetic radiation) and 'theon' (from the Greek 'theos' meaning 'god'), suggesting the company's early focus on electronics and radio technology.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈreɪθiːɑːn/","syllables":"Ray-the-on"},"inflection":{},"usage_notes":{"explanation":"'Raytheon' is primarily used as a proper noun to refer to the company. It is often used in discussions about defense spending, military technology, and international relations.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Raytheon Technologies (合併後の企業名)"],"related_companies":["Lockheed Martin","Boeing","Northrop Grumman"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Raytheon' is a specialized term primarily encountered in discussions related to the defense industry, military technology, and global politics. Understanding its significance requires familiarity with these contexts."},"example_sentences":[{"sentence":"The government awarded Raytheon a large contract for missile defense systems.","translation":"政府はレイセオンにミサイル防衛システムに関する大規模な契約を授与しました。","type":"noun","meaning_category":"company"},{"sentence":"Raytheon's headquarters are located in Waltham, Massachusetts.","translation":"レイセオンの本社はマサチューセッツ州ウォルサムにあります。","type":"noun","meaning_category":"company"}]}