{"word":"tumulter","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"騒ぎを起こす人、騒動の元","english_definition":"One who makes a tumult; a rioter.","examples":[{"sentence":"The tumulters were quickly apprehended by the police.","translation":"騒ぎを起こした者たちはすぐに警察に逮捕された。"},{"sentence":"A few tumulters disrupted the peaceful protest.","translation":"数人の騒動の元が平和的な抗議活動を妨害した。"}],"collocations":["public tumulter","political tumulter"],"synonyms":["rioter","troublemaker","agitator","rabble-rouser"],"antonyms":["peacekeeper","pacifier"]}],"etymology":{"value":"From the word 'tumult', meaning a loud, confused noise, especially one caused by a large mass of people. The suffix '-er' is added to denote a person who does or is associated with the action.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtjuːmʌltər/","syllables":"tu-mul-ter"},"inflection":{"noun_plural":"tumulters"},"usage_notes":{"explanation":"The word 'tumulter' is relatively rare and somewhat archaic. It specifically refers to someone who actively creates or participates in a tumult, often implying a deliberate intent to cause disruption or disorder. It is stronger than simply being a 'troublemaker' as it suggests involvement in a larger, more chaotic event.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tumulter caused a quiet disturbance.","correct":"✓ The tumulter caused a loud disturbance.","note":"A 'tumulter' implies a loud and disruptive action, so 'quiet disturbance' is contradictory."},{"incorrect":"✗ He was a tumulter in his own home.","correct":"✓ He was a troublemaker in his own home.","note":"'Tumulter' is typically used in the context of public disturbances or large-scale events, not private settings."}],"priority":"★★☆"},"related_words":{"derivatives":["tumult (noun)","tumultuous (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tumulter' is a rare and somewhat formal word for someone who creates a disturbance or tumult. It is not commonly used in everyday conversation and is more likely to be found in historical or legal contexts. Understanding the base word 'tumult' is essential for grasping the meaning of 'tumulter'."},"example_sentences":[{"sentence":"The authorities struggled to control the tumulters during the political rally.","translation":"当局は政治集会中の騒ぎを起こす者たちを制御するのに苦労した。","type":"noun","meaning_category":"騒ぎを起こす人"},{"sentence":"History often remembers the tumulters who challenged the status quo.","translation":"歴史はしばしば現状に挑戦した騒動の元を記憶している。","type":"noun","meaning_category":"騒動の元"}]}