{"word":"experientialists","priority":"low","meanings":[{"part_of_speech":"noun","definition":"People who believe that knowledge comes primarily from sensory experience.","english_definition":"Individuals who adhere to the philosophical perspective of experientialism, which posits that knowledge and understanding are derived primarily from sensory experience and direct interaction with the world.","examples":[{"sentence":"The experientialists argued that children learn best through hands-on activities.","translation":"経験主義者たちは、子供たちは実践的な活動を通して最もよく学ぶと主張した。"},{"sentence":"Many educators who are experientialists advocate for field trips and real-world projects.","translation":"多くの経験主義者の教育者たちは、遠足や実社会のプロジェクトを提唱している。"}],"collocations":["experientialist learning","experientialist philosophy","experientialist approach","experientialist education"],"synonyms":["empiricists","pragmatists","experimentalists"],"antonyms":["rationalists","idealists","theorists"]}],"etymology":{"value":"Derived from 'experiential,' relating to or derived from experience, and the suffix '-ist,' denoting a person who adheres to a particular belief system or philosophy.","priority":"medium"},"pronunciation":{"ipa":"/ɪkˌspɪəriˈɛnʃəlɪsts/","syllables":"ex-pe-ri-en-tial-ists"},"inflection":{"noun_plural":"experientialists"},"usage_notes":{"explanation":"'Experientialists' refers to those who strongly emphasize the role of experience in acquiring knowledge and understanding. This term is often used in educational and philosophical contexts to describe individuals who prioritize hands-on learning and direct engagement with the world over abstract theorizing.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"Experientialists believe in theories over practice.","correct":"Experientialists believe in practice over theories.","note":"Experientialists prioritize experience and practice, not abstract theories."}],"priority":"low"},"related_words":{"derivatives":["experientialism (noun: the theory that knowledge comes from experience)","experiential (adjective: relating to or derived from experience)"],"priority":"medium"},"level_frequency":{"frequency_google_ngram":"Low frequency; primarily used in academic or philosophical discussions.","priority":"low"},"readability_explanation":{"level":"C1","text":"'Experientialists' is a term used in philosophy and education to describe people who believe that we learn best through experience. They think that doing things and having direct sensory experiences is more important than just reading or hearing about them. This word is not commonly used in everyday conversation, but you might encounter it in academic texts or discussions about learning theories."},"example_sentences":[{"sentence":"The conference featured several prominent experientialists who shared their insights on learning methodologies.","translation":"その会議には、学習方法論に関する洞察を共有する著名な経験主義者が数名参加した。","type":"general","meaning_category":"people who value experience"},{"sentence":"Experientialists often design educational programs that involve active participation and real-world application.","translation":"経験主義者は、積極的な参加と実社会への応用を含む教育プログラムを設計することが多い。","type":"general","meaning_category":"people who value experience"}]}