{"word":"intermodification","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(言語学)相互修飾、相互限定","english_definition":"(linguistics) A process in which two or more words or phrases modify each other, creating a new meaning that is not simply the sum of their individual meanings.","examples":[{"sentence":"In the phrase 'student teacher', there is intermodification between 'student' and 'teacher'.","translation":"「student teacher（教育実習生）」という句では、「student（学生）」と「teacher（教師）」の間に相互修飾が見られる。"},{"sentence":"Intermodification can lead to the creation of new compound words or idiomatic expressions.","translation":"相互修飾は、新しい複合語や慣用句の生成につながることがある。"}],"collocations":["semantic intermodification","syntactic intermodification"],"synonyms":["mutual modification","reciprocal modification"],"antonyms":[]}],"etymology":{"value":"'Inter-' (between, among) + 'modification' (the act of modifying).","priority":"☆☆☆"},"pronunciation":{"ipa":"ˌɪntərmɑːdɪfɪˈkeɪʃən","syllables":"in-ter-mod-i-fi-ca-tion"},"inflection":{"noun_plural":"intermodifications"},"usage_notes":{"explanation":"Intermodification is a linguistic term primarily used in the analysis of compound words and phrases. It describes how two or more elements within a phrase influence each other's meaning, resulting in a combined meaning that is more specific or nuanced than the sum of the parts. This concept is important in understanding how language evolves and creates new meanings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intermodification of the words was very clear.","correct":"✓ The intermodification between the words was very clear.","note":"The preposition 'between' is often used to clarify the relationship of intermodification between two specific elements."}],"priority":"☆☆☆"},"related_words":{"derivatives":["modify","modification","inter-"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized linguistic term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Intermodification' is a specialized term in linguistics that describes how two or more words or phrases mutually influence each other's meaning. This concept is typically discussed in advanced linguistic analyses and is not commonly used in everyday language. Understanding this term requires familiarity with linguistic concepts such as semantics and syntax."},"example_sentences":[{"sentence":"The analysis of intermodification is crucial for understanding the nuances of compound nouns.","translation":"相互修飾の分析は、複合名詞のニュアンスを理解するために重要である。","type":"noun","meaning_category":"相互修飾"},{"sentence":"Semantic intermodification can create meanings that are not immediately obvious from the individual words.","translation":"意味的な相互修飾は、個々の単語からはすぐに明らかにならない意味を生み出すことがある。","type":"noun","meaning_category":"相互修飾"}]}