{"word":"Anti-Athenian","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"反アテネの、アテネに反対する","english_definition":"Opposed to or against Athens, its people, or its policies.","examples":[{"sentence":"The Anti-Athenian sentiment was strong among the Spartans.","translation":"スパルタ人の間では、反アテネ感情が強かった。"},{"sentence":"He adopted an Anti-Athenian stance in the debate.","translation":"彼は討論で反アテネの立場をとった。"}],"collocations":["Anti-Athenian league","Anti-Athenian policy","Anti-Athenian sentiment"],"synonyms":["anti-Athenic","opposed to Athens","against Athens"],"antonyms":["pro-Athenian","Athenian-supporting"]},{"part_of_speech":"noun","definition":"反アテネ主義者、アテネに反対する人","english_definition":"A person who is opposed to or against Athens, its people, or its policies.","examples":[{"sentence":"The Anti-Athenians sought to undermine Athenian power.","translation":"反アテネ主義者たちは、アテネの力を弱体化させようとした。"},{"sentence":"He was known as an Anti-Athenian for his criticisms of Athenian democracy.","translation":"彼はアテネ民主主義への批判から、反アテネ主義者として知られていた。"}],"collocations":["staunch Anti-Athenian","vocal Anti-Athenian"],"synonyms":["Athenophobe","opponent of Athens"],"antonyms":["Athenophile","supporter of Athens"]}],"etymology":{"value":"Formed from \"anti-\" (against) + \"Athenian\" (relating to Athens).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænti əˈθiniən/","syllables":"An-ti-A-the-ni-an"},"inflection":{"notes":"The word \"Anti-Athenian\" can function as both an adjective and a noun. As an adjective, it does not inflect. As a noun, the plural form is \"Anti-Athenians.\""},"usage_notes":{"explanation":"\"Anti-Athenian\" refers to opposition to the ancient Greek city-state of Athens, its culture, political system, or its inhabitants. It is often used in historical contexts when discussing the Peloponnesian War or other conflicts involving Athens.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Anti-Athenian.","correct":"✓ He is an Anti-Athenian.","note":"Since \"Anti-\" is pronounced with a vowel sound at the beginning, use \"an\" instead of \"a\" before the word when it functions as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["Anti-Athenism (反アテネ主義)"],"related_terms":["Athenian","Athens","Peloponnesian War","Sparta"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in historical or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Anti-Athenian\" is a relatively uncommon word primarily used in historical or academic discussions related to ancient Greece. It describes someone or something opposed to the city-state of Athens. Understanding this term requires familiarity with ancient Greek history, particularly the rivalry between Athens and other city-states like Sparta."},"example_sentences":[{"sentence":"The Theban general Epaminondas led an Anti-Athenian coalition to challenge Athenian hegemony.","translation":"テーバイの将軍エパメイナンダスは、アテネの覇権に挑戦するために反アテネ連合を率いた。","type":"adjective","meaning_category":"反アテネの"},{"sentence":"Many Anti-Athenians believed that Athenian democracy was inherently flawed.","translation":"多くのアテネ反対派は、アテネの民主主義は本質的に欠陥があると信じていた。","type":"noun","meaning_category":"反アテネ主義者"}]}