{"word":"Acetated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"アセチル化された、酢酸化された","english_definition":"Having undergone acetylation; treated with acetic acid or an acetate.","examples":[{"sentence":"The acetated cellulose fibers were used in the production of rayon.","translation":"アセチル化されたセルロース繊維は、レーヨンの製造に使用されました。"},{"sentence":"An acetated derivative of the drug was synthesized for improved bioavailability.","translation":"薬物の酢酸化誘導体が、生物学的利用能を向上させるために合成されました。"}],"collocations":["Acetated cellulose","Acetated derivative"],"synonyms":["acetylated","esterified"],"antonyms":["deacetylated","hydrolyzed"]}],"etymology":{"value":"Formed from 'acetate' (a salt or ester of acetic acid) with the suffix '-ed' indicating a state of being acted upon.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæsɪteɪtɪd/","syllables":"a-ce-ta-ted"},"inflection":{"notes":"This is the past participle and adjective form of the verb 'acetate'."},"usage_notes":{"explanation":"'Acetated' is primarily a technical term used in chemistry, materials science, and related fields to describe a substance that has been treated with acetic acid or an acetate. It indicates that an acetylation reaction has occurred, where an acetyl group (CH3CO) has been introduced into a molecule. This process can modify the properties of the substance, such as its solubility or stability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fruit was acetated for preservation.","correct":"✓ The fruit was pickled in vinegar for preservation.","note":"'Acetated' refers to a specific chemical process. For food preservation using vinegar, 'pickled' or 'preserved in vinegar' is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["Acetate","Acetylation","Acetic acid"],"related_terms":["Cellulose acetate","Polyvinyl acetate (PVA)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Acetated' is a specialized term used in chemistry and materials science. It describes a substance that has undergone acetylation, a chemical process where an acetyl group is added to a molecule. This term is not commonly used in everyday language and is typically encountered in scientific or technical literature. Understanding requires knowledge of basic organic chemistry concepts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The acetated starch showed improved thermal stability.","translation":"アセチル化されたデンプンは、熱安定性が向上しました。","type":"adjective","meaning_category":"アセチル化された"},{"sentence":"The researchers prepared an acetated form of the polymer.","translation":"研究者たちは、ポリマーの酢酸化された形態を調製しました。","type":"adjective","meaning_category":"酢酸化された"}]}