{"word":"exhumer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"掘り起こす人、発掘者、特に埋葬された死体を掘り起こす人","english_definition":"A person who exhumes, especially one who disinters a buried corpse.","examples":[{"sentence":"The exhumer carefully brushed away the dirt from the coffin.","translation":"掘り起こし人は棺から慎重に土を払い落とした。"},{"sentence":"The police hired an exhumer to retrieve the evidence.","translation":"警察は証拠を取り出すために掘り起こし人を雇った。"}],"collocations":["professional exhumer (プロの掘り起こし人)","grave exhumer (墓を掘り起こす人)","hired exhumer (雇われた掘り起こし人)"],"synonyms":["disinterrer","grave robber (文脈によっては)","archaeologist (文脈によっては)"],"antonyms":["burier"]}],"etymology":{"value":"exhume + -er","priority":"★★★"},"pronunciation":{"ipa":"/ɪɡˈzjuːmər/","syllables":"ex-hu-mer"},"inflection":{"noun_plural":"exhumers"},"usage_notes":{"explanation":"'Exhumer' specifically refers to someone who digs up something that has been buried, most often a corpse. The act of exhuming is usually done for legal, forensic, or archaeological reasons.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"An exhumer is someone who digs up dinosaur bones.","correct":"An archaeologist is someone who digs up dinosaur bones.","note":"While an exhumer digs up buried things, they are usually focused on corpses. Dinosaur bones are typically the domain of archaeologists."}],"priority":"★★☆"},"related_words":{"derivatives":["exhume (verb)","exhumation (noun)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'exhumer' is a specialized term, primarily used in contexts involving legal investigations, forensic science, or historical studies where the act of digging up buried remains is relevant. It is not a common word in everyday conversation."},"example_sentences":[{"sentence":"The exhumer was called in to examine the remains for forensic analysis.","translation":"法医学的分析のために、掘り起こし人が呼ばれて遺体を調べた。","type":"general","meaning_category":"掘り起こす人"},{"sentence":"A professional exhumer must follow strict protocols to preserve the integrity of the site.","translation":"プロの掘り起こし人は、現場の完全性を保つために厳格な手順に従わなければならない。","type":"professional","meaning_category":"掘り起こす人"}]}