{"word":"zoomorphize","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"動物の形にする、動物の特性を与える、擬獣化する","english_definition":"To represent or transform something into an animal form or with animal characteristics; to attribute animal qualities to something.","examples":[{"sentence":"Ancient cultures often zoomorphized their deities, giving them animal heads or bodies.","translation":"古代文化では、神々を擬獣化し、動物の頭や体を与えることがよくありました。"},{"sentence":"The artist zoomorphized the city, depicting buildings as crouching beasts.","translation":"その芸術家は都市を擬獣化し、建物をうずくまる獣として描いた。"},{"sentence":"The writer zoomorphized the protagonist, giving him the cunning of a fox.","translation":"その作家は主人公を擬獣化し、キツネのような狡猾さを与えた。"}],"collocations":["zoomorphize deities (神々を擬獣化する)","zoomorphize a character (キャラクターを擬獣化する)","zoomorphize abstract concepts (抽象的な概念を擬獣化する)"],"synonyms":["animalize","therianthropize","bestialize","personify (when animals are given human traits)"],"antonyms":["anthropomorphize (人間に似せる、擬人化する)","humanize"],"notes":"This word is often used in the context of art, literature, and mythology. It is the opposite of anthropomorphize, which means to give human characteristics to non-human things."}],"etymology":{"value":"Derived from the combination of 'zoomorph' (from Greek 'zoon' meaning 'animal' and 'morphe' meaning 'form') and the suffix '-ize' (meaning 'to make or become').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌzoʊ.əˈmɔːr.faɪz/","syllables":"zo-o-mor-phize"},"inflection":{"verb_forms":{"present_simple":["zoomorphize","zoomorphizes"],"past_simple":"zoomorphized","past_participle":"zoomorphized","present_participle":"zoomorphizing"}},"usage_notes":{"explanation":"'Zoomorphize' is a relatively uncommon word that specifically refers to the act of transforming something into an animal form or giving it animal characteristics. It is often used in academic or artistic contexts when discussing the representation of non-animal entities as animals. It is the direct opposite of 'anthropomorphize', which is a more common term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The author anthropomorphized the animals, zoomorphizing their behavior.","correct":"✓ The author anthropomorphized the animals, giving them human-like behavior.","note":"Anthropomorphizing means giving human traits, while zoomorphizing means giving animal traits. The sentence incorrectly uses zoomorphizing to describe human-like behavior."},{"incorrect":"✗ He zoomorphized his car by giving it a spoiler.","correct":"✓ He customized his car by giving it a spoiler.","note":"Zoomorphizing involves giving animal characteristics. Adding a spoiler to a car is simply customization, not zoomorphization."}],"priority":"★★☆"},"related_words":{"derivatives":["zoomorphism (名詞: 擬獣化)","zoomorphic (形容詞: 擬獣化された)","zoomorph (名詞: 擬獣化されたもの)"],"related_concepts":["therianthropy (獣人化)","totemism (トーテム信仰)","animal symbolism (動物象徴)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Relatively rare word, primarily used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Zoomorphize' is a specialized term primarily used in academic or artistic contexts. It refers to the act of representing something as an animal or giving it animal-like characteristics. Understanding this word requires familiarity with the concepts of representation, symbolism, and the distinction between animal and human traits. It is the opposite of 'anthropomorphize', which means to give human characteristics to something. Due to its specialized nature, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The tribe's mythology zoomorphized natural forces, representing them as powerful animals.","translation":"その部族の神話は自然の力を擬獣化し、それらを強力な動物として表現した。","type":"verb","meaning_category":"擬獣化する"},{"sentence":"The artist's sculptures zoomorphized everyday objects, transforming them into strange, animalistic forms.","translation":"その芸術家の彫刻は日常の物体を擬獣化し、それらを奇妙な動物のような形に変えた。","type":"verb","meaning_category":"動物の形にする"},{"sentence":"In the story, the wizard zoomorphized the prince, turning him into a wolf.","translation":"物語の中で、魔法使いは王子を擬獣化し、彼を狼に変えた。","type":"verb","meaning_category":"動物の形にする"}]}