{"word":"septship","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"The position or authority of a sept leader; the territory or people under a sept leader's control.","english_definition":"The position or authority of a sept leader; the territory or people under a sept leader's control.","examples":[{"sentence":"The septship was passed down through generations of the same family.","translation":"その首長職は同じ家系の世代を通して受け継がれてきた。"},{"sentence":"He ruled his people fairly and justly during his time in septship.","translation":"彼は首長職の間、公正かつ正当に人々を統治した。"}],"collocations":["inherit a septship","rule a septship","relinquish a septship"],"synonyms":["chieftainship","leadership","rule","authority"],"antonyms":["subordination","servitude"]}],"etymology":{"value":"Combination of 'sept' (a clan or division, especially in Ireland) and '-ship' (denoting a state, condition, or office).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛptʃɪp/","syllables":"sept-ship"},"inflection":{"noun_plural":"septships"},"usage_notes":{"explanation":"'Septship' is a relatively rare term, specifically used in contexts where septs (typically Irish clans) are being discussed. It refers to both the position of leadership within the sept and the area or people governed by that leader.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was the septship of the company.","correct":"✓ He was the CEO of the company.","note":"'Septship' is only used in the context of septs (clans), not modern organizations like companies."}],"priority":"★☆☆"},"related_words":{"derivatives":["sept","septal"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'septship' is a specialized term primarily found in historical or anthropological contexts related to Irish clans (septs). It denotes the office or authority of the sept leader and the territory or people they govern. Due to its specific usage and infrequent appearance, it is not commonly encountered in general English. Understanding requires familiarity with the concept of 'septs' as clan divisions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The ancient laws governed the succession to the septship.","translation":"古代の法律が首長職の継承を規定していた。","type":"noun","meaning_category":"position of leadership"},{"sentence":"The responsibilities of the septship included protecting the clan's territory.","translation":"首長職の責任には、氏族の領土を守ることが含まれていた。","type":"noun","meaning_category":"authority and responsibilities"}]}