{"word":"unfarced","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(rare) Not farced; not stuffed or padded; genuine, authentic, or unexaggerated.","english_definition":"(rare) Not stuffed or padded; genuine, authentic, or unexaggerated.","examples":[{"sentence":"The unfarced truth is often stranger than fiction.","translation":"飾りのない真実は、しばしば小説よりも奇妙だ。"},{"sentence":"He presented an unfarced account of the events.","translation":"彼は事件について誇張のない説明をした。"}],"collocations":["unfarced truth","unfarced account","unfarced reality"],"synonyms":["genuine","authentic","unexaggerated","unembellished","unadorned","real","true"],"antonyms":["farced","stuffed","padded","exaggerated","embellished","adorned","untrue","false"]}],"etymology":{"value":"Formed from \"un-\" (not) + \"farced,\" the past participle of the verb \"farce\" (to stuff), ultimately from Latin \"farcire\" (to stuff). The sense evolved from literal stuffing to figurative embellishment or exaggeration.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈfɑːrst/","syllables":"un-farced"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs (e.g., very unfarced) but does not inflect for number or gender."},"usage_notes":{"explanation":"The word \"unfarced\" is relatively rare and formal. It is used to describe something that is presented without embellishment, exaggeration, or artificiality. It suggests a commitment to truth and accuracy. It is often used in contrast to accounts or descriptions that are considered to be \"farced,\" meaning they have been embellished or exaggerated for effect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unfarced chicken was delicious.","correct":"✓ The un-stuffed chicken was delicious.","note":"While 'unfarced' literally means 'not stuffed', it is rarely used in this literal sense. Use 'un-stuffed' instead."},{"incorrect":"✗ He told an unfarced story, and everyone laughed.","correct":"✓ He told an unexaggerated story, but no one laughed.","note":"'Unfarced' implies a lack of embellishment, not necessarily humor. If the story was meant to be funny, but wasn't, 'unfarced' is not the appropriate word."}],"priority":"★☆☆"},"related_words":{"derivatives":["farce (noun, verb)","farcial (adjective)","unfarcical (adjective)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'unfarced' is a rare and sophisticated term used to describe something presented without embellishment or exaggeration. Its usage implies a deliberate choice to avoid artificiality and to adhere strictly to the truth. Due to its rarity, it is typically encountered in formal writing or academic contexts. Understanding its etymology (related to 'farce,' meaning to stuff or pad) helps to grasp its nuanced meaning of being 'un-stuffed' or 'un-padded' with unnecessary details or exaggerations."},"example_sentences":[{"sentence":"The historian aimed to provide an unfarced account of the war, relying solely on primary sources.","translation":"歴史家は、第一次資料のみに頼り、戦争について誇張のない説明を提供することを目指した。","type":"adjective","meaning_category":"unexaggerated"},{"sentence":"The documentary presented an unfarced reality of life in the slums.","translation":"そのドキュメンタリーは、スラム街での生活の飾りのない現実を提示した。","type":"adjective","meaning_category":"genuine"},{"sentence":"He preferred the unfarced version of the story, devoid of sensationalism.","translation":"彼は、扇情主義のない、その物語の誇張のないバージョンを好んだ。","type":"adjective","meaning_category":"unembellished"}]}