{"word":"Diomedeidae","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ミズナギドリ目アホウドリ科","english_definition":"The albatrosses, a family of large seabirds found in the Southern Ocean and the North Pacific.","examples":[{"sentence":"The Diomedeidae family includes the wandering albatross and the black-footed albatross.","translation":"アホウドリ科には、ワタリアホウドリやクロアシアホウドリが含まれます。"}],"collocations":["Diomedeidae family (アホウドリ科)","albatross (アホウドリ)","seabird (海鳥)"],"synonyms":["albatross family"],"antonyms":[]}],"etymology":{"value":"Derived from Diomedea, a genus within the family, named after Diomedes, a hero in Greek mythology. The suffix '-idae' is a standard taxonomic suffix used to denote a family.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪ.oʊˌmiːˈdiː.ɪˌdaɪ/","syllables":"Di-o-me-di-i-dae"},"inflection":{"noun_plural":"Diomedeidae (same as singular, as it's a family name)"},"usage_notes":{"explanation":"'Diomedeidae' is the scientific name for the albatross family. It is primarily used in scientific and ornithological contexts. The common name 'albatrosses' is more frequently used in general conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A Diomedeidae is a bird.","correct":"✓ A member of Diomedeidae is a bird. / ✓ An albatross is a bird.","note":"'Diomedeidae' refers to the entire family, not a single bird. To refer to one bird, use 'a member of Diomedeidae' or the common name 'albatross'."}],"priority":"★★☆"},"related_words":{"derivatives":["Diomedea (genus within the family)"],"phrases":["Wandering Albatross (Diomedea exulans)","Black-footed Albatross (Phoebastria nigripes)"],"priority":"★★☆"},"level_frequency":{"level":"Scientific/Ornithological","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"Difficult","text":"'Diomedeidae' is a scientific term used to classify the albatross family. It is not commonly used in everyday language and is primarily found in scientific literature or ornithological contexts. Understanding this term requires familiarity with biological taxonomy."},"example_sentences":[{"sentence":"Conservation efforts are crucial for many species within the Diomedeidae family.","translation":"アホウドリ科の多くの種にとって、保全活動が非常に重要です。","type":"general","meaning_category":"Conservation"},{"sentence":"The taxonomy of Diomedeidae has been subject to revisions based on genetic studies.","translation":"アホウドリ科の分類は、遺伝学的研究に基づいて改訂されてきました。","type":"scientific","meaning_category":"Taxonomy"}]}