{"word":"worse-taught","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Taught in a way that is inferior or less effective than ideal; poorly educated or instructed.","english_definition":"Educated or instructed to a substandard degree; having received inadequate or ineffective teaching.","examples":[{"sentence":"The students from that school often perform poorly because they are worse-taught in basic subjects.","translation":"あの学校の生徒たちは、基礎科目の教育が不十分なため、成績が悪いことが多いです。"},{"sentence":"Compared to other institutions, the students here seem worse-taught in critical thinking skills.","translation":"他の機関と比較して、ここの学生は批判的思考スキルにおいて教育が不十分であるように見えます。"},{"sentence":"Many believe that the children in underfunded schools are worse-taught than those in wealthier districts.","translation":"多くの人が、資金不足の学校の子供たちは、裕福な地区の子供たちよりも教育が不十分であると考えています。"}],"collocations":["worse-taught students","worse-taught subjects","worse-taught skills","relatively worse-taught","significantly worse-taught"],"synonyms":["poorly educated","under-educated","badly taught","inadequately instructed","substandardly taught"],"antonyms":["well-taught","properly educated","effectively instructed","adequately taught","superiorly taught"]}],"etymology":{"value":"Compound word formed from 'worse' (comparative of 'bad') and 'taught' (past participle of 'teach'). Indicates a lower quality of teaching compared to a standard or other instances.","priority":"N/A"},"pronunciation":{"ipa":"/ˌwɜːrs ˈtɔːt/","syllables":"worse-taught"},"inflection":{"notes":"Adjective. Does not have comparative or superlative forms as 'worse' is already a comparative."},"usage_notes":{"explanation":"'Worse-taught' is used to describe individuals or groups who have received a level of education or instruction that is considered inferior. It implies a comparison to a standard of good teaching or to other groups who have received better instruction. The term is often used in discussions about educational disparities and the quality of teaching in different schools or regions.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The worse taught student.","correct":"✓ The worse-taught student.","note":"Hyphenation is important to ensure the phrase is read as a single adjective modifying 'student'."},{"incorrect":"✗ They are more worse-taught than others.","correct":"✓ They are worse-taught than others.","note":"'Worse' is already a comparative form, so 'more' is redundant."},{"incorrect":"✗ The students were worse teach.","correct":"✓ The students were worse-taught.","note":"'Taught' is the past participle form of 'teach' and is necessary to form the compound adjective."}],"priority":"N/A"},"related_words":{"derivatives":["teach","taught","teaching","worse","badly taught","poorly taught"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Rare. Not commonly found in general text.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Worse-taught' is a relatively uncommon compound adjective that describes someone who has received a substandard education. It is often used in discussions about educational quality and disparities. The term implies a comparison to a standard of good teaching and suggests that the individual or group has been disadvantaged by poor instruction. Understanding the term requires a good grasp of comparative adjectives and compound word formation."},"example_sentences":[{"sentence":"The report highlighted that children from rural areas are often worse-taught in STEM subjects.","translation":"その報告書は、地方の子供たちはSTEM科目の教育が不十分であることが多いと強調しました。","type":"adjective","meaning_category":"Poorly Educated"},{"sentence":"The worse-taught students struggled to keep up with the advanced curriculum.","translation":"教育が不十分な学生は、高度なカリキュラムについていくのに苦労しました。","type":"adjective","meaning_category":"Inadequately Instructed"},{"sentence":"The lack of resources contributed to the students being worse-taught in essential skills.","translation":"資源の不足が、学生が不可欠なスキルにおいて教育が不十分であることに貢献しました。","type":"adjective","meaning_category":"Substandardly Taught"}]}