{"word":"sectarianly","meanings":[{"part_of_speech":"adverb","definition":"宗派的に、党派的に","english_definition":"In a sectarian manner; characterized by narrow-minded adherence to a particular sect or party.","examples":[{"sentence":"The issue was debated sectarianly, with each side refusing to consider the other's point of view.","translation":"その問題は宗派的に議論され、それぞれの側が相手の視点を考慮することを拒否した。"},{"sentence":"The newspaper reported the events sectarianly, favoring one group over another.","translation":"その新聞は出来事を党派的に報道し、あるグループを別のグループよりも優遇した。"}],"synonyms":["factionally","parochially","dogmatically","narrow-mindedly"],"antonyms":["impartially","objectively","fairly","neutrally"],"related_words":["sectarian","sectarianism"]}],"etymology":{"value":"Derived from 'sectarian' + '-ly'. 'Sectarian' comes from 'sect', ultimately from Latin 'secta' (a following, school, or faction).","note":"The adverbial form indicates an action or quality performed in a manner consistent with sectarian beliefs or practices."},"pronunciation":{"ipa":"/sɛkˈtɛəriənli/","syllables":"sec-tar-i-an-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Sectarianly' describes actions, attitudes, or writings that are strongly biased towards a particular sect or faction, often to the exclusion or detriment of others. It implies a lack of objectivity and a strong adherence to a specific group's beliefs or interests.","priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - not commonly used in general conversation or writing.","note":"Primarily used in contexts discussing politics, religion, or social divisions."},"readability_explanation":{"level":"C1","text":"'Sectarianly' is an advanced term used to describe something done in a way that shows strong bias towards a particular sect or group, often ignoring or being unfair to other groups. It's usually found in discussions about conflicts or divisions based on religious, political, or social affiliations."},"example_sentences":[{"sentence":"The conflict was fueled by sectarianly motivated violence.","translation":"その紛争は、宗派的な動機による暴力によって煽られた。","type":"general","meaning_category":"violence"},{"sentence":"The organization's policies were criticized for being applied sectarianly.","translation":"その組織の政策は、宗派的に適用されているとして批判された。","type":"general","meaning_category":"policies"}]}