{"word":"calculatingly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"計算高く、打算的に、策略的に","english_definition":"in a calculating manner; shrewdly and deliberately, often with a focus on personal gain or advantage.","examples":[{"sentence":"He smiled calculatingly, knowing he had the upper hand.","translation":"彼は自分が優位に立っていることを知って、計算高く微笑んだ。"},{"sentence":"She planned her career calculatingly, always thinking several steps ahead.","translation":"彼女は常に数歩先を考えて、計算高くキャリアを計画した。"},{"sentence":"The company acted calculatingly to maximize profits.","translation":"その会社は利益を最大化するために、打算的に行動した。"}],"collocations":["act calculatingly","plan calculatingly","smile calculatingly","speak calculatingly","look calculatingly"],"synonyms":["shrewdly","deliberately","schemingly","cunningly","coldly","rationally","pragmatically","opportunistically"],"antonyms":["impulsively","spontaneously","naively","honestly","sincerely","openly","genuinely"],"related_words":["calculating (adjective)","calculate (verb)","calculation (noun)"]}],"etymology":{"value":"Derived from the adjective 'calculating,' which comes from the verb 'calculate.' The suffix '-ly' turns it into an adverb. The root implies careful planning and assessment, often with a self-serving motive.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkælkjəˌleɪtɪŋli/","syllables":"cal-cu-lat-ing-ly"},"inflection":{"notes":"As an adverb, 'calculatingly' does not have different inflections."},"usage_notes":{"explanation":"'Calculatingly' describes actions or behaviors performed with a deliberate and strategic mindset, often with the intention of achieving a specific goal or advantage. It implies a degree of coldness or detachment, suggesting that emotions are suppressed in favor of rational planning. The term often carries a negative connotation, implying manipulation or a lack of sincerity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He calculatingly helped her.","correct":"He calculatingly offered to help her. / He helped her in a calculating manner.","note":"'Calculatingly' usually modifies the manner in which an action is performed, not the action itself. It's better to use it with verbs that describe a way of doing something or rephrase the sentence. "},{"incorrect":"She calculatingly felt sad.","correct":"She calculatingly pretended to feel sad.","note":"'Calculatingly' doesn't describe genuine emotions. It describes the deliberate display or manipulation of emotions or actions."}],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'calculatingly' is used to describe someone who plans their actions very carefully, often to get an advantage for themselves. It suggests that they are not acting spontaneously or emotionally, but rather thinking about the consequences of their actions and how they can benefit. This word is more common in formal writing or speech and may not be familiar to those with a lower level of English proficiency."},"example_sentences":[{"sentence":"The politician answered the question calculatingly, avoiding any direct commitment.","translation":"その政治家は質問に計算高く答え、直接的な約束は避けた。","type":"general"},{"sentence":"She smiled calculatingly as she accepted the offer.","translation":"彼女は申し出を受け入れながら、計算高く微笑んだ。","type":"general"},{"sentence":"He advanced his career calculatingly, making strategic alliances.","translation":"彼は戦略的な同盟を築き、計算高くキャリアを築いた。","type":"general"}]}