{"word":"Hyperromanticism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"過剰なロマン主義、極端なロマン主義","english_definition":"An exaggerated or excessive form of Romanticism.","examples":[{"sentence":"The novel's hyperromanticism made it unrealistic and difficult to relate to.","translation":"その小説の過剰なロマン主義は、非現実的で共感しにくいものにした。"},{"sentence":"His hyperromanticism led him to idealize love and relationships to an unattainable degree.","translation":"彼の極端なロマン主義は、愛と人間関係を達成不可能なほど理想化させた。"}],"collocations":["hyperromantic ideal","hyperromantic view","hyperromantic sensibility"],"synonyms":["excessive romanticism","exaggerated romanticism","extreme romanticism"],"antonyms":["realism","cynicism"]}],"etymology":{"value":"\"Hyper-\" (過剰な) + \"Romanticism\" (ロマン主義)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərroʊˈmæntɪsɪzəm/","syllables":"hy-per-ro-man-ti-ci-sm"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Hyperromanticism\" refers to a state or tendency of being excessively or extremely romantic. It often involves idealizing emotions, relationships, or situations to an unrealistic degree. It can be seen as a critique or exaggeration of the Romantic movement in literature and art.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a hyperromantic.","correct":"✓ He exhibits hyperromanticism.","note":"\"Hyperromanticism\" is a noun referring to the ideology or tendency. To describe a person, use phrases like \"He exhibits hyperromanticism\" or \"He is a hyperromantic type.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["hyperromantic (adjective)"],"related_terms":["Romanticism","Romantic","idealism","sentimentality"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Hyperromanticism\" is a relatively uncommon term used to describe an extreme or exaggerated form of Romanticism. It implies an unrealistic idealization of emotions, relationships, or situations. The term is often used in literary criticism or academic discussions. Understanding the root words \"hyper-\" (excessive) and \"Romanticism\" is helpful in grasping its meaning."},"example_sentences":[{"sentence":"The film's hyperromanticism was criticized for portraying an unrealistic view of love.","translation":"その映画の過剰なロマン主義は、愛の非現実的な見方を描いているとして批判された。","type":"noun","meaning_category":"過剰なロマン主義"},{"sentence":"Her hyperromanticism often led to disappointment when reality didn't match her expectations.","translation":"彼女の極端なロマン主義は、現実が彼女の期待と一致しないときに失望につながることが多かった。","type":"noun","meaning_category":"極端なロマン主義"}]}