{"word":"Neurogliosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"神経膠症：中枢神経系の神経組織が損傷を受けた後に、グリア細胞（特にアストロサイト）が増殖し、瘢痕組織を形成する状態。","english_definition":"A pathological process involving proliferation or hypertrophy of glial cells (astrocytes, oligodendrocytes, and microglia) in response to damage to the central nervous system. It results in the formation of glial scars.","examples":[{"sentence":"Neurogliosis was observed in the affected area of the brain following the stroke.","translation":"脳卒中後、脳の患部に神経膠症が認められた。"},{"sentence":"The extent of neurogliosis can be assessed using specific staining techniques.","translation":"神経膠症の程度は、特定の染色技術を用いて評価することができる。"}],"collocations":["reactive neurogliosis","focal neurogliosis","diffuse neurogliosis","perivascular neurogliosis","astrocytic neurogliosis"],"synonyms":["glial scar","gliosis","astrogliosis"],"antonyms":[]}],"etymology":{"value":"'Neuro-' (神経) + 'glio-' (グリア) + '-osis' (状態、病状)に由来。グリア細胞の過剰な増殖を示す。","priority":"★★★"},"pronunciation":{"ipa":"/ˌnjʊərəʊɡlaɪˈoʊsɪs/","syllables":"neu-ro-gli-o-sis"},"inflection":{"noun_plural":"neuroglioses (まれに)"},"usage_notes":{"explanation":"Neurogliosisは、特定の疾患ではなく、脳や脊髄の損傷に対する反応です。原因としては、脳卒中、外傷性脳損傷、感染症、多発性硬化症、腫瘍などが挙げられます。神経膠症の程度と場所は、損傷の重症度と性質によって異なります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Neurogliosis is a type of brain tumor.","correct":"✓ Neurogliosis is a reaction to brain injury, not a tumor itself.","note":"神経膠症は脳腫瘍ではなく、脳損傷に対する反応です。"},{"incorrect":"✗ Neurogliosis is always symptomatic.","correct":"✓ Neurogliosis may be asymptomatic depending on the location and extent.","note":"神経膠症は、場所と程度によっては無症状の場合があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["gliosis","astrogliosis","astrocyte","glial cell"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Neurogliosis is a complex medical term referring to the proliferation of glial cells in the central nervous system following injury. Understanding this term requires a strong background in biology and medicine. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"Extensive neurogliosis was identified in the patient's spinal cord after the injury.","translation":"負傷後、患者の脊髄に広範囲の神経膠症が確認された。","type":"medical","meaning_category":"病理"},{"sentence":"The researchers are investigating the role of neurogliosis in the progression of Alzheimer's disease.","translation":"研究者らは、アルツハイマー病の進行における神経膠症の役割を調査している。","type":"research","meaning_category":"研究"}]}