{"word":"oblateness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"扁平率、偏平度","english_definition":"The state of being flattened at the poles; a measure of the flattening of a sphere or spheroid, calculated as (a-b)/a, where a is the equatorial radius and b is the polar radius.","examples":[{"sentence":"The Earth's oblateness is caused by its rotation.","translation":"地球の扁平率は、その自転によって引き起こされる。"},{"sentence":"The oblateness of a planet can affect its gravitational field.","translation":"惑星の扁平率は、その重力場に影響を与える可能性がある。"}],"collocations":["Earth's oblateness (地球の扁平率)","planetary oblateness (惑星の扁平率)","degree of oblateness (扁平度)","calculate oblateness (扁平率を計算する)"],"synonyms":["flattening","ellipticity","asphericity"],"antonyms":["sphericity"],"related_terms":["equatorial radius","polar radius","spheroid","geoid"]}],"etymology":{"value":"From 'oblate' (flattened or depressed at the poles) + '-ness' (state or quality). 'Oblate' comes from Latin 'oblatus', past participle of 'offerō' (to offer, present), referring to the shape being 'offered' or presented as flattened.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɒblətnəs/","syllables":"ob-late-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Oblateness' is a scientific term primarily used in astronomy, geodesy, and related fields to describe the deviation of a rotating spheroid (like a planet) from a perfect sphere. It's quantified by the flattening fraction, which indicates the relative difference between the equatorial and polar radii. A higher oblateness value means a greater degree of flattening.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The oblateness is the same as the eccentricity.","correct":"The oblateness is related to the eccentricity, but they are not the same.","note":"Oblateness and eccentricity are related concepts describing the shape of an ellipse or spheroid, but they are calculated differently and represent slightly different aspects of the shape."}],"priority":"★★☆"},"related_words":{"derivatives":["oblate (adjective)","oblation (noun, unrelated meaning)"],"related_scientific_terms":["eccentricity","ellipsoid","geodesy","astronomy"]},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency, primarily used in specialized scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Oblateness' is a technical term used in scientific fields like astronomy and geodesy. It refers to the degree to which a sphere, such as a planet, is flattened at its poles. The term is not commonly used in everyday language and is typically encountered in academic or scientific discussions related to the shape and properties of celestial bodies. Understanding the term requires some familiarity with geometry and physics concepts.","requires_background_knowledge":"Requires background knowledge in geometry, physics, and astronomy."},"example_sentences":[{"sentence":"Jupiter has a significant oblateness due to its rapid rotation.","translation":"木星は自転が速いため、大きな扁平率を持つ。","type":"scientific","meaning_category":"flattening"},{"sentence":"Scientists are studying the oblateness of asteroids to understand their internal structure.","translation":"科学者たちは小惑星の扁平率を研究して、その内部構造を理解しようとしている。","type":"scientific","meaning_category":"flattening measurement"}]}