{"word":"Indigenous-governed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Governed or controlled by Indigenous peoples or communities.","english_definition":"Controlled, managed, or administered by Indigenous people, reflecting their self-determination and cultural values.","examples":[{"sentence":"The Indigenous-governed conservation area protects vital ecosystems.","translation":"先住民が管理する保護区は、重要な生態系を保護しています。"},{"sentence":"The school is Indigenous-governed, ensuring culturally relevant education.","translation":"その学校は先住民が運営しており、文化的に適切な教育を保証しています。"},{"sentence":"Indigenous-governed healthcare prioritizes traditional healing practices.","translation":"先住民が管理する医療は、伝統的な治療法を優先しています。"}],"collocations":["Indigenous-governed land","Indigenous-governed organization","Indigenous-governed territory","Indigenous-governed education","Indigenous-governed healthcare"],"synonyms":["Indigenous-led","Indigenous-controlled","self-governed","self-determined"],"antonyms":["state-governed","government-controlled","externally-governed"]}],"etymology":{"value":"A compound word combining 'Indigenous' (originating or occurring naturally in a particular place; native) and 'governed' (controlled or regulated by a governing body or authority). The term emphasizes the agency and authority of Indigenous peoples in managing their own affairs and resources.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈdɪdʒənəs ˈɡʌvərnd/","syllables":"in-dig-e-nous-gov-ernd"},"inflection":{"notes":"Adjective; does not inflect for number or gender."},"usage_notes":{"explanation":"'Indigenous-governed' is used to describe entities, areas, or systems where Indigenous peoples exercise primary control and decision-making power. It reflects a commitment to Indigenous self-determination and the recognition of Indigenous rights. The term is often used in discussions of land management, resource allocation, education, and healthcare.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The area is governed by Indigenous.","correct":"✓ The area is Indigenous-governed.","note":"'Indigenous' is an adjective, but 'Indigenous-governed' functions as a compound adjective modifying a noun. Using 'by Indigenous' is grammatically incorrect in this context."},{"incorrect":"✗ Indigenous governed area","correct":"✓ Indigenous-governed area","note":"The hyphenated form 'Indigenous-governed' is preferred when used as a compound adjective before a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["governed","governance","Indigenous"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, specific to academic and policy contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Indigenous-governed' is a term used in discussions about the rights and self-determination of Indigenous peoples. It describes situations where Indigenous communities have the authority to manage their own affairs, lands, and resources. This term is often found in academic papers, policy documents, and news articles related to Indigenous issues. Understanding this term requires familiarity with concepts of Indigenous sovereignty and self-governance."},"example_sentences":[{"sentence":"The Indigenous-governed fisheries are managed sustainably.","translation":"先住民が管理する漁業は持続可能な方法で運営されています。","type":"adjective","meaning_category":"Governance"},{"sentence":"The Indigenous-governed tribal council makes decisions for the community.","translation":"先住民が管理する部族評議会がコミュニティの決定を下します。","type":"adjective","meaning_category":"Governance"},{"sentence":"The Indigenous-governed park protects sacred sites.","translation":"先住民が管理する公園は聖地を保護しています。","type":"adjective","meaning_category":"Governance"}]}