{"word":"Uncatechizedness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state of not being catechized; lack of instruction in the principles of religion.","english_definition":"The state of not being instructed in the basic principles of a religion, especially Christianity.","examples":[{"sentence":"The uncatechizedness of the population was a concern for the church leaders.","translation":"その地域の住民が宗教の教義を教えられていない状態は、教会の指導者たちにとって懸念事項であった。"},{"sentence":"Addressing the uncatechizedness of young people is crucial for the future of the faith.","translation":"若者たちが教義を教えられていない状態に対処することは、信仰の将来にとって非常に重要である。"}],"collocations":["address uncatechizedness","combat uncatechizedness","overcome uncatechizedness","religious uncatechizedness","widespread uncatechizedness"],"synonyms":["lack of religious instruction","religious ignorance","lack of catechesis"],"antonyms":["catechization","religious education","religious instruction"]}],"etymology":{"value":"Formed from \"uncatechized\" (not having received religious instruction) + \"-ness\" (a suffix denoting a state or condition). \"Catechized\" comes from \"catechize,\" which originates from the Greek word \"katēcheō\" meaning \"to instruct orally.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnkætɪˈkaɪzdnəs/","syllables":"Un-cat-e-chized-ness"},"inflection":{"noun_plural":"Uncatechizednesses (rarely used)"},"usage_notes":{"explanation":"\"Uncatechizedness\" refers to the condition of individuals or groups who have not been adequately taught the fundamental doctrines and principles of a particular religion, most often Christianity. It highlights a deficiency in religious education and understanding. The term is typically used in religious or academic contexts when discussing the importance of religious instruction and the consequences of its absence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The uncatechizedness are a problem.","correct":"✓ Uncatechizedness is a problem.","note":"\"Uncatechizedness\" is an uncountable noun, so it takes a singular verb."},{"incorrect":"✗ He suffered from uncatechized.","correct":"✓ He suffered from uncatechizedness.","note":"\"Uncatechized\" is an adjective; the noun form is \"uncatechizedness.\""}],"priority":"★★☆"},"related_words":{"derivatives":["uncatechized (adjective)","catechize (verb)","catechism (noun)","catechesis (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare, academic/religious contexts)","frequency_google_ngram":"Very low frequency - Primarily found in theological or academic texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Uncatechizedness\" is a complex and rare word primarily used in religious or academic contexts. It refers to the state of lacking instruction in the basic principles of a religion, especially Christianity. Understanding this word requires familiarity with religious terminology and abstract concepts. Due to its limited usage and specialized meaning, it is typically encountered in advanced texts related to theology, religious education, or sociology of religion."},"example_sentences":[{"sentence":"The bishop lamented the growing uncatechizedness among young adults in the diocese.","translation":"司教は、教区内の若い成人たちの間で宗教教育を受けていない状態が広がっていることを嘆いた。","type":"noun","meaning_category":"lack of religious instruction"},{"sentence":"Efforts to combat uncatechizedness include providing accessible religious education programs.","translation":"宗教教育が行き届いていない状態に対処するための取り組みには、利用しやすい宗教教育プログラムの提供が含まれる。","type":"noun","meaning_category":"lack of religious instruction"},{"sentence":"The study examined the impact of uncatechizedness on religious identity and practice.","translation":"その研究は、宗教教育を受けていない状態が宗教的アイデンティティと実践に与える影響を調査した。","type":"noun","meaning_category":"lack of religious instruction"}]}