{"word":"Chondrofibroma","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"軟骨線維腫","english_definition":"A rare, benign (non-cancerous) bone tumor that typically occurs at the end of long bones, especially around the knee and shoulder.","examples":[{"sentence":"Chondrofibroma is characterized by a mixture of chondroid (cartilage-like) and fibrous tissue.","translation":"軟骨線維腫は、軟骨様組織と線維性組織の混合によって特徴づけられます。"},{"sentence":"The patient was diagnosed with chondrofibroma after experiencing persistent knee pain.","translation":"患者は持続的な膝の痛みを訴えた後、軟骨線維腫と診断されました。"},{"sentence":"Treatment for chondrofibroma usually involves surgical removal of the tumor.","translation":"軟骨線維腫の治療は通常、腫瘍の外科的切除を伴います。"}],"collocations":["diagnose chondrofibroma (軟骨線維腫を診断する)","treat chondrofibroma (軟骨線維腫を治療する)","chondrofibroma surgery (軟骨線維腫手術)","chondrofibroma of the knee (膝の軟骨線維腫)"],"synonyms":["bone tumor","benign tumor","cartilage tumor"],"antonyms":["malignant tumor","osteosarcoma"]}],"etymology":{"value":"The term 'chondrofibroma' is derived from the Greek words 'chondros' (cartilage), 'fibra' (fiber), and '-oma' (tumor). It describes the tumor's composition of both cartilaginous and fibrous elements.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒndroʊfaɪˈbroʊmə/","syllables":"con-dro-fi-bro-ma"},"inflection":{"notes":"Plural form: Chondrofibromas"},"usage_notes":{"explanation":"Chondrofibroma is a relatively rare bone tumor, typically affecting individuals between the ages of 10 and 30. It is usually benign, but can cause pain and limited range of motion in the affected joint. Diagnosis is typically made through imaging studies (X-rays, MRI) and biopsy. Treatment usually involves surgical excision, and recurrence is uncommon.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Chondrofibroma is a type of cancer.","correct":"✓ Chondrofibroma is a benign tumor.","note":"Chondrofibroma is almost always benign (non-cancerous)."},{"incorrect":"✗ Chondrofibroma is treated with chemotherapy.","correct":"✓ Chondrofibroma is treated with surgery.","note":"The primary treatment for chondrofibroma is surgical removal. Chemotherapy is not typically used."}],"priority":"★★☆"},"related_words":{"derivatives":["chondroma (軟骨腫)","fibroma (線維腫)","osteochondroma (骨軟骨腫)"],"medical_terms":["bone lesion","tumor","biopsy","surgical excision","MRI","X-ray"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chondrofibroma' is a specialized medical term referring to a rare, non-cancerous tumor that develops in bone, primarily affecting the ends of long bones. It is characterized by a mixture of cartilage-like and fibrous tissue. Diagnosis involves imaging techniques and biopsy, and treatment typically consists of surgical removal. Due to its rarity and medical context, this term is primarily encountered in medical literature and discussions. Understanding requires familiarity with basic medical terminology related to tumors and bone pathology."},"example_sentences":[{"sentence":"The X-ray revealed a lesion consistent with chondrofibroma in the distal femur.","translation":"X線検査で、大腿骨遠位端に軟骨線維腫に一致する病変が認められました。","type":"medical diagnosis","meaning_category":"診断"},{"sentence":"Surgical excision is the preferred treatment for chondrofibroma to prevent further bone damage.","translation":"さらなる骨の損傷を防ぐため、外科的切除が軟骨線維腫の好ましい治療法です。","type":"treatment","meaning_category":"治療"},{"sentence":"Microscopic examination of the biopsy sample confirmed the diagnosis of chondrofibroma.","translation":"生検サンプルの顕微鏡検査により、軟骨線維腫の診断が確定しました。","type":"diagnosis","meaning_category":"診断"}]}