{"word":"bitubercular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having two tubercles or small rounded projections.","english_definition":"Possessing or characterized by two tubercles.","examples":[{"sentence":"The bitubercular bone structure was evident in the fossil.","translation":"その化石には二つの結節を持つ骨格構造が明らかに見られた。"},{"sentence":"The leaf exhibits a bitubercular shape at its base.","translation":"その葉は基部に二つの小さな突起を持つ形状を示す。"}],"collocations":["bitubercular bone","bitubercular leaf","bitubercular structure"],"synonyms":["dituberculate","two-tubercled"],"antonyms":[]}],"etymology":{"value":"From the Latin 'bi-' (two) + 'tuberculum' (small swelling, tubercle) + '-ar' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/baɪtjuːˈbɜːrkjʊlər/","syllables":"bi-tu-ber-cu-lar"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative forms, which are rarely used for this word."},"usage_notes":{"explanation":"'Bitubercular' is a relatively rare term used in scientific or technical contexts, particularly in biology, zoology, and anatomy, to describe structures or organisms that possess two tubercles. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The muscle is bitubercular, therefore it has one head.","correct":"✓ The muscle is bitubercular, therefore it has two tubercles.","note":"'Bitubercular' refers to having two tubercles, not necessarily to the number of heads a muscle has."}],"priority":"★☆☆"},"related_words":{"derivatives":["tuberculum (noun: a small rounded projection or nodule, especially on a bone or tooth)","tubercle (noun: a small rounded projection or nodule)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'bitubercular' is a technical term primarily used in scientific and medical contexts. It describes something that has two tubercles, which are small, rounded projections. Due to its specialized usage, it is not commonly encountered in general English and is more likely to be found in academic or professional literature related to biology, anatomy, or zoology."},"example_sentences":[{"sentence":"The specimen was identified as belonging to a bitubercular species of beetle.","translation":"その標本は、二つの結節を持つカブトムシの一種に属すると特定された。","type":"general","meaning_category":"description"},{"sentence":"The anatomical study revealed a bitubercular formation on the distal end of the bone.","translation":"解剖学的研究により、骨の末端に二つの結節状の形成が明らかになった。","type":"technical","meaning_category":"anatomy"}]}