{"word":"shot-silk","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"玉虫織り、シャンタン","english_definition":"A fabric, especially silk, woven with threads of different colours so that it appears to change colour as the light strikes it from different angles.","examples":[{"sentence":"She wore a dress made of shot-silk.","translation":"彼女は玉虫織りのドレスを着ていた。"},{"sentence":"The shot-silk scarf shimmered in the sunlight.","translation":"玉虫織りのスカーフが太陽光の中で輝いていた。"}],"collocations":["shot-silk dress","shot-silk scarf","shot-silk fabric","shot-silk gown"],"synonyms":["changeable silk","iridescent silk","two-tone silk"],"antonyms":[]}],"etymology":{"value":"The term \"shot\" refers to the effect of light reflecting differently from the warp and weft threads, creating the illusion of changing color. The term \"silk\" indicates the material used.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɒtˌsɪlk/","syllables":"shot-silk"},"inflection":{"noun_plural":"shot-silks"},"usage_notes":{"explanation":"Shot-silk is a luxurious fabric known for its iridescent appearance. It is often used in high-end fashion and interior design. The effect is achieved by using different colored threads for the warp and weft.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a shot silk dress.","correct":"✓ She wore a shot-silk dress.","note":"The term is usually hyphenated. However, it is acceptable to write it as two words, 'shot silk', but the hyphenated form is more common."}],"priority":"★★☆"},"related_words":{"derivatives":["shot (adjective, describing the effect)","silk (the base material)"],"phrases":["iridescent","changeable","two-tone"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shot-silk' refers to a specific type of fabric known for its unique visual effect. The term itself implies a level of sophistication and knowledge of textiles. Understanding this word enhances one's vocabulary related to fashion and design.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum displayed a collection of antique shot-silk garments.","translation":"博物館では、アンティークの玉虫織りの衣服のコレクションが展示されていた。","type":"noun","meaning_category":"fabric"},{"sentence":"The designer used shot-silk to create a stunning visual effect in the gown.","translation":"デザイナーは玉虫織りを使用して、ガウンに素晴らしい視覚効果を生み出した。","type":"noun","meaning_category":"fabric"},{"sentence":"The light played across the shot-silk curtains, creating a shimmering effect.","translation":"光が玉虫織りのカーテンを横切り、きらめく効果を生み出した。","type":"noun","meaning_category":"fabric"}]}