{"word":"static-angle","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(映画、テレビ、写真)固定されたカメラアングル、静止アングル","english_definition":"(film, television, photography) a camera angle that remains fixed throughout a shot.","examples":[{"sentence":"The director used a static-angle for the establishing shot to emphasize the vastness of the landscape.","translation":"監督は、風景の広大さを強調するために、エスタブリッシングショットに固定アングルを使用した。"},{"sentence":"The static-angle made the scene feel more formal and deliberate.","translation":"固定アングルは、シーンをよりフォーマルで意図的なものに感じさせた。"},{"sentence":"In contrast to the dynamic action sequences, the static-angle shots provided a moment of calm.","translation":"ダイナミックなアクションシーンとは対照的に、固定アングルのショットは静けさの瞬間を提供した。"}],"collocations":["static-angle shot","fixed camera angle","stationary camera angle"],"synonyms":["fixed shot","locked-off shot"],"antonyms":["dynamic angle","moving shot","tracking shot","panning shot","tilting shot"]},{"part_of_speech":"adjective","definition":"(映画、テレビ、写真)固定アングルの、静止アングルの","english_definition":"(film, television, photography) relating to or characterized by a camera angle that remains fixed throughout a shot.","examples":[{"sentence":"The static-angle composition allowed the audience to focus on the actors' expressions.","translation":"固定アングルの構図は、観客が俳優の表情に集中することを可能にした。"},{"sentence":"The static-angle interview felt a bit stiff and unnatural.","translation":"固定アングルのインタビューは、少し硬くて不自然に感じられた。"},{"sentence":"The static-angle approach was a deliberate choice to create a sense of detachment.","translation":"固定アングルという手法は、疎外感を出すための意図的な選択だった。"}],"collocations":["static-angle photography","static-angle filming","static-angle scene"],"synonyms":["fixed-angle","stationary-angle"],"antonyms":["dynamic-angle","moving-angle"]}],"etymology":{"value":"The term 'static-angle' is derived from the combination of 'static,' meaning fixed or unchanging, and 'angle,' referring to the camera's viewpoint or perspective.","priority":"★★★"},"pronunciation":{"ipa":"/ˌstætɪk ˈæŋɡəl/","syllables":"stat-ic-an-gle"},"inflection":{"noun_plural":"static-angles"},"usage_notes":{"explanation":"A 'static-angle' refers to a shot in film, television, or photography where the camera remains in a fixed position, without any movement such as panning, tilting, or tracking. This technique can be used to create a sense of stability, formality, or to draw attention to the subject within the frame. It is often contrasted with dynamic camera techniques that involve camera movement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The static angle was moving slightly.","correct":"The static angle remained fixed.","note":"A static angle, by definition, does not move. If there is movement, it is not a static angle."},{"incorrect":"Use static-angle to make the film more exciting.","correct":"Use dynamic angles to make the film more exciting.","note":"Static angles tend to create a sense of stability or formality, not excitement. Dynamic angles are more suitable for creating excitement."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["camera angle","shot","establishing shot","close-up","medium shot","long shot","panning","tilting","tracking","dolly shot","zoom shot"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'static-angle' is a technical term used in film, television, and photography to describe a shot where the camera remains in a fixed position. It's often used to create a sense of stability or formality, or to draw attention to the subject within the frame. Understanding this term requires some familiarity with filmmaking and photography terminology."},"example_sentences":[{"sentence":"The director chose a static-angle shot to highlight the actor's emotional performance.","translation":"監督は、俳優の感情的な演技を強調するために、固定アングルのショットを選んだ。","type":"noun","meaning_category":"fixed camera angle"},{"sentence":"The static-angle scene created a sense of tension and anticipation.","translation":"固定アングルのシーンは、緊張感と期待感を生み出した。","type":"adjective","meaning_category":"fixed-angle"}]}