{"word":"iliocaudal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(解剖学)腸骨と尾部に関連する、または腸骨から尾部へ向かう","english_definition":"(anatomy) Relating to or extending from the ilium to the caudal region.","examples":[{"sentence":"The iliocaudal muscles are involved in tail movement.","translation":"腸骨尾筋は尾の動きに関与している。"},{"sentence":"An iliocaudal ligament connects the ilium to the tailbone.","translation":"腸骨尾靭帯は腸骨と尾骨をつないでいる。"}],"collocations":["iliocaudal muscle","iliocaudal ligament"],"synonyms":["sacrocaudal","ilium-caudal"],"antonyms":[]}],"etymology":{"value":"Derived from 'ilio-' (referring to the ilium) and 'caudal' (referring to the tail or posterior region).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪlioʊˈkɔːdl/","syllables":"il-i-o-cau-dal"},"inflection":{"notes":"Adjective; no specific inflections beyond comparative/superlative forms (more iliocaudal, most iliocaudal), which are rarely used."},"usage_notes":{"explanation":"The term 'iliocaudal' is primarily used in anatomical descriptions, particularly in veterinary anatomy and zoology, to specify structures or directions related to both the ilium (the largest bone of the pelvis) and the caudal (tail) region of an animal. It is not commonly used in general language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The iliocaudal artery supplies blood to the head.","correct":"✓ The iliocaudal artery supplies blood to the tail region.","note":"The iliocaudal region is specifically related to the ilium and tail; it would be incorrect to associate it with other body parts like the head."}],"priority":"★★☆"},"related_words":{"derivatives":["ilium","caudal","cauda"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Iliocaudal' is a highly specialized anatomical term. It is used in the context of anatomy, zoology, and veterinary medicine to describe structures or anatomical relationships between the ilium (part of the pelvis) and the caudal or tail region. Understanding this term requires a solid grounding in anatomical terminology. It is unlikely to be encountered outside of these specific fields."},"example_sentences":[{"sentence":"The surgeon carefully dissected the iliocaudal nerve during the procedure.","translation":"外科医は手術中に腸骨尾神経を注意深く解剖した。","type":"adjective","meaning_category":"anatomy"},{"sentence":"The iliocaudal angle was measured to assess pelvic alignment.","translation":"骨盤のアライメントを評価するために、腸骨尾角が測定された。","type":"adjective","meaning_category":"anatomy"}]}