{"word":"Toluol","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"トルオール：ベンゼン環にメチル基が結合した有機化合物。無色の液体で、溶剤や化学原料として用いられる。","english_definition":"Toluene, also known as methylbenzene or phenylmethane, is an aromatic hydrocarbon. It is a colorless, water-insoluble liquid with the smell of paint thinners. It is used as a solvent and as a raw material in organic synthesis.","examples":[{"sentence":"Toluol wird als Lösungsmittel für Farben und Lacke verwendet.","translation":"トルオールは塗料やワニスの溶剤として使用されます。"},{"sentence":"Die chemische Formel von Toluol ist C7H8.","translation":"トルオールの化学式はC7H8です。"}],"collocations":["als Lösungsmittel verwenden (溶剤として使用する)","chemische Formel (化学式)","organische Synthese (有機合成)"],"synonyms":["Methylbenzol","Phenylmethan"],"antonyms":[]},{"part_of_speech":"noun","definition":"トルオールを含む製品、特に溶剤や接着剤。乱用されることがある。","english_definition":"A product containing toluene, especially a solvent or adhesive, which may be subject to abuse.","examples":[{"sentence":"Der Missbrauch von Toluol-haltigen Produkten kann gesundheitsschädlich sein.","translation":"トルオールを含む製品の乱用は健康に有害である可能性があります。"}],"collocations":["Toluol-haltige Produkte (トルオールを含む製品)","Toluol-Missbrauch (トルオール乱用)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Toluol leitet sich vom Tolu-Balsam ab, einem Harz des in Südamerika heimischen Balsambaums Myroxylon balsamum var. toluiferum. Aus diesem Balsam wurde Toluol erstmals isoliert.","priority":"★★☆"},"pronunciation":{"ipa":"/tɔluˈoːl/","syllables":"To-lu-ol"},"inflection":{"notes":"トルオールは名詞なので、複数形は通常ありません。"},"usage_notes":{"explanation":"Toluol ist eine farblose, flüchtige Flüssigkeit mit einem aromatischen Geruch. Es ist ein wichtiges Lösungsmittel in der chemischen Industrie und wird auch als Ausgangsstoff für die Herstellung von Kunststoffen, Sprengstoffen und anderen Chemikalien verwendet. Der unsachgemäße Gebrauch von Toluol kann gesundheitsschädlich sein.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Ich habe Toluol getrunken.","correct":"✓ Ich habe Toluol eingeatmet.","note":"トルオールは通常、吸入によって乱用されます。飲むことは非常に危険です。"},{"incorrect":"✗ Toluol ist ein Metall.","correct":"✓ Toluol ist eine organische Verbindung.","note":"トルオールは有機化合物であり、金属ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["Toluoldämpfe (トルオール蒸気)","Toluolhaltig (トルオールを含む)"],"phrases":["Toluol ist ein aromatischer Kohlenwasserstoff. (トルオールは芳香族炭化水素です。)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Toluol ist eine chemische Verbindung, die in verschiedenen industriellen Anwendungen eingesetzt wird. Es ist wichtig zu wissen, dass der unsachgemäße Gebrauch von Toluol gesundheitsschädlich sein kann. Daher sollte man immer die Sicherheitsvorkehrungen beachten, wenn man mit Toluol arbeitet."},"example_sentences":[{"sentence":"Toluol ist ein gutes Lösungsmittel für viele organische Stoffe.","translation":"トルオールは多くの有機物にとって優れた溶剤です。","type":"general","meaning_category":"溶剤"},{"sentence":"Die Exposition gegenüber hohen Toluolkonzentrationen kann zu Gesundheitsschäden führen.","translation":"高濃度のトルオールへの暴露は健康被害を引き起こす可能性があります。","type":"caution","meaning_category":"健康被害"},{"sentence":"Toluol wird in der chemischen Industrie in großen Mengen hergestellt.","translation":"トルオールは化学工業で大量に製造されています。","type":"industry","meaning_category":"工業用途"}]}