{"word":"escarped","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(城壁などが)斜面をなした、傾斜した","english_definition":"Having an escarpment; sloped or steeply inclined.","examples":[{"sentence":"The escarped walls of the fortress provided a formidable defense.","translation":"その要塞の斜面をなした壁は、手ごわい防御を提供した。"}],"collocations":[],"synonyms":["sloped","inclined","scarped"],"antonyms":["level","flat"]}],"etymology":{"value":"Derived from the noun 'escarpment,' which comes from the French 'escarpement,' meaning a steep slope or cliff.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈskɑːrpt/","syllables":"es-carped"},"inflection":{"notes":"This is an adjective, so it does not have plural forms. Comparative and superlative forms are 'more escarped' and 'most escarped,' respectively, though these are not commonly used."},"usage_notes":{"explanation":"'Escarped' is a relatively uncommon adjective used to describe something that has been formed into or possesses an escarpment, which is a steep slope or cliff, often man-made as part of a fortification. It is most often used in historical or military contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The escarped building was modern and sleek.","correct":"✓ The building had a modern, sleek design.","note":"'Escarped' refers to a slope or cliff, so it is not typically used to describe the overall design of a modern building unless it incorporates such a feature."}],"priority":"★☆☆"},"related_words":{"derivatives":["escarpment (noun: a steep slope or cliff)","escarp (verb: to form into an escarpment)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very low frequency)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'escarped' is a specialized term, primarily used in contexts related to fortifications, geology, or land surveying. Understanding requires familiarity with the concept of an 'escarpment,' which is a steep slope or cliff. The word is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The castle was protected by an escarped embankment.","translation":"その城は、斜面をなした土塁によって守られていた。","type":"adjective","meaning_category":"斜面をなした"},{"sentence":"The escarped terrain made the advance difficult for the troops.","translation":"斜面をなした地形は、軍隊の前進を困難にした。","type":"adjective","meaning_category":"傾斜した"}]}