{"word":"Menshevist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"メンシェビキ：ロシア社会民主労働党の少数派で、穏健な社会主義を主張したグループ。","english_definition":"A member of the non-Leninist wing of the Russian Social Democratic Workers' Party, opposed to the Bolsheviks and defeated by them after the October Revolution.","examples":[{"sentence":"The Menshevists believed in a gradual transition to socialism.","translation":"メンシェビキは社会主義への漸進的な移行を信じていた。"},{"sentence":"The Bolsheviks eventually suppressed the Menshevists after a period of political struggle.","translation":"ボリシェビキは政治的闘争の後、最終的にメンシェビキを抑圧した。"}],"collocations":["Menshevist ideology","Menshevist policies","Bolsheviks vs. Menshevists"],"synonyms":["Minoritarian","Social Democrat"],"antonyms":["Bolshevik","Leninist"]},{"part_of_speech":"adjective","definition":"メンシェビキの、メンシェビキに関する","english_definition":"Relating to or characteristic of the Menshevists.","examples":[{"sentence":"The Menshevist faction held different views on the revolution.","translation":"メンシェビキの派閥は革命について異なる見解を持っていた。"},{"sentence":"Menshevist literature was critical of Lenin's approach.","translation":"メンシェビキの文献はレーニンのアプローチを批判していた。"}],"collocations":["Menshevist views","Menshevist faction","Menshevist literature"],"synonyms":["Minoritarian","Social Democratic"],"antonyms":["Bolshevik","Leninist"]}],"etymology":{"value":"From Russian меньшевик (men'shevík), literally 'member of the minority', from меньший (men'shiy) 'smaller, lesser', comparative of малый (malyy) 'small'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmenʃəvɪst/","syllables":"Men-she-vist"},"inflection":{"noun_plural":"Menshevists"},"usage_notes":{"explanation":"The term 'Menshevist' refers to a specific political group in early 20th-century Russia. It is important to understand the historical context to use the term correctly.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Menshevik. Therefore, he must be weak.","correct":"✓ He is a Menshevist. He believed in a different path to socialism than the Bolsheviks.","note":"The term 'Menshevist' should not be used to imply weakness or inferiority. It refers to a specific political ideology."}],"priority":"★☆☆"},"related_words":{"derivatives":["Menshevism (noun): The political principles and practices of the Menshevists."],"related_terms":["Bolshevik","Leninism","Marxism","Socialism","Communism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in historical or political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Menshevist' is a historical and political term. It requires understanding of Russian history and political ideologies of the early 20th century. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The **Menshevists** and Bolsheviks disagreed on the strategy for achieving a socialist state.","translation":"メンシェビキとボリシェビキは社会主義国家を達成するための戦略について意見が異なっていた。","type":"noun","meaning_category":"Political Group"},{"sentence":"The **Menshevist** approach was more gradual and democratic compared to the Bolsheviks.","translation":"メンシェビキのアプローチは、ボリシェビキと比較して、より漸進的で民主的だった。","type":"adjective","meaning_category":"Relating to Menshevists"}]}