{"word":"Yazdegerdian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Of or relating to the Sasanian dynasty of Persia, particularly the later period associated with the reigns of Yazdegerd I, Yazdegerd II, and Yazdegerd III.","english_definition":"Relating to the Sasanian dynasty of Persia, especially the reigns of Yazdegerd I, Yazdegerd II, and Yazdegerd III.","examples":[{"sentence":"The Yazdegerdian era marked a period of decline for the Sasanian Empire.","translation":"ヤズデギルド朝時代は、ササン朝ペルシア帝国の衰退期であった。"},{"sentence":"Yazdegerdian coins provide valuable insights into the economic conditions of the time.","translation":"ヤズデギルド朝のコインは、当時の経済状況に関する貴重な洞察を提供する。"}],"collocations":["Yazdegerdian dynasty","Yazdegerdian coins","Yazdegerdian period","Yazdegerdian art"],"synonyms":["Sasanian"],"antonyms":[]},{"part_of_speech":"noun","definition":"A member or supporter of the Sasanian dynasty during the reigns of Yazdegerd I, Yazdegerd II, or Yazdegerd III.","english_definition":"A person who lived during the reigns of Yazdegerd I, Yazdegerd II, or Yazdegerd III and was associated with or supported the Sasanian dynasty.","examples":[{"sentence":"The Yazdegerdians fought valiantly against the Arab invasions.","translation":"ヤズデギルド朝の人々は、アラブの侵略に対して勇敢に戦った。"},{"sentence":"Many Yazdegerdians fled Persia after the fall of the empire.","translation":"帝国の崩壊後、多くのヤズデギルド朝の人々がペルシアから逃れた。"}],"collocations":["Yazdegerdian soldier","Yazdegerdian refugee"],"synonyms":["Sasanian"],"antonyms":[]}],"etymology":{"value":"Derived from the name of the Sasanian emperors Yazdegerd (particularly Yazdegerd I, Yazdegerd II, and Yazdegerd III) + the suffix \"-ian\", indicating association or belonging.","priority":"★★★"},"pronunciation":{"ipa":"/ˌjæzdɪˈɡɜːrdiən/","syllables":"Yaz-de-ger-di-an"},"inflection":{"noun_plural":"Yazdegerdians"},"usage_notes":{"explanation":"The term \"Yazdegerdian\" is primarily used in historical contexts when discussing the later period of the Sasanian Empire, specifically during and after the reigns of the emperors named Yazdegerd. It helps to distinguish this period from earlier phases of the dynasty.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Yazdigerdian","correct":"✓ Yazdegerdian","note":"Correct spelling is crucial as it is derived from a proper name."}],"priority":"★☆☆"},"related_words":{"derivatives":["Yazdegerd (proper noun)","Sasanian (related dynasty)"],"phrases":["Sasanian Empire","Arab Conquest of Persia"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in academic or historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Yazdegerdian\" is specific to historical discussions about the Sasanian Empire of Persia. It is generally used in academic or specialized contexts. Understanding requires knowledge of Persian history and the Sasanian dynasty. The word is formed by adding the suffix \"-ian\" to the name of the emperor Yazdegerd, indicating association or belonging to that era.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Yazdegerdian** silver coins are highly valued by numismatists.","translation":"ヤズデギルド朝の銀貨は、貨幣収集家によって高く評価されている。","type":"adjective","meaning_category":"Relating to the Sasanian dynasty during the reign of Yazdegerd."},{"sentence":"Many **Yazdegerdians** converted to Islam following the Arab conquest.","translation":"アラブの征服後、多くのヤズデギルド朝の人々がイスラム教に改宗した。","type":"noun","meaning_category":"A person associated with the Sasanian dynasty during the reign of Yazdegerd."}]}