{"word":"jury-squaring","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)陪審員買収、陪審員操作","english_definition":"(law) The act of improperly influencing or attempting to influence a jury, especially by bribery or other unlawful means.","examples":[{"sentence":"The prosecutor accused the defendant of jury-squaring to secure a favorable verdict.","translation":"検察官は、被告が有利な判決を得るために陪審員買収を行ったと非難した。"},{"sentence":"Evidence of jury-squaring led to a mistrial and a new investigation.","translation":"陪審員買収の証拠が、誤審と新たな捜査につながった。"}],"collocations":["attempted jury-squaring","evidence of jury-squaring","accused of jury-squaring"],"synonyms":["jury tampering","bribery of jurors","improper influence of a jury"],"antonyms":[]}],"etymology":{"value":"The term combines \"jury\" (a body of people sworn to give a verdict in a legal case) with \"squaring\" (to make compliant or to fix, often implying dishonesty). The term suggests making the jury 'compliant' to a desired outcome.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʒʊəriˌskweərɪŋ/","syllables":"ju-ry-squar-ing"},"inflection":{"noun_plural":"jury-squarings"},"usage_notes":{"explanation":"\"Jury-squaring\" refers specifically to the illegal act of attempting to influence a jury to return a particular verdict, typically through bribery or other illicit means. It is a serious offense that undermines the integrity of the judicial process. The term is relatively uncommon in general usage but is recognized within legal contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The lawyer was found guilty of jury squaring the evidence.","correct":"✓ The lawyer was found guilty of jury-squaring.","note":"\"Jury-squaring\" refers to influencing the jury itself, not the evidence. Tampering with evidence is a separate offense."},{"incorrect":"✗ Jury-squaring is a legal strategy used to ensure a fair trial.","correct":"✓ Jury-squaring is an illegal activity aimed at influencing a jury.","note":"Jury-squaring is illegal and undermines the fairness of a trial."}],"priority":"★★☆"},"related_words":{"derivatives":["square (verb - to make compliant, to fix)"],"phrasal_verbs":[],"related_legal_terms":["jury tampering","obstruction of justice","bribery","perjury","mistrial"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"jury-squaring\" is a specialized legal term referring to the illegal act of influencing a jury, usually through bribery or other unlawful means, to secure a desired verdict. It is a serious offense that undermines the integrity of the judicial system. This term is primarily used in legal contexts and is not commonly encountered in everyday language. Understanding this term requires familiarity with legal terminology and concepts.","priority":"★★★"},"example_sentences":[{"sentence":"The investigation revealed a complex scheme of jury-squaring involving several high-profile individuals.","translation":"捜査により、数名の著名人が関与する複雑な陪審員買収計画が明らかになった。","type":"noun","meaning_category":"陪審員買収"},{"sentence":"The judge warned the parties against any attempts at jury-squaring, emphasizing the importance of a fair trial.","translation":"裁判官は、公正な裁判の重要性を強調し、当事者に対し陪審員買収の試みをしないよう警告した。","type":"noun","meaning_category":"陪審員買収"}]}