{"word":"widthless","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"幅のない、狭い、幅が足りない","english_definition":"Lacking width; narrow; having insufficient width.","examples":[{"sentence":"The path was widthless, barely allowing one person to pass.","translation":"その道は幅がなく、人が一人やっと通れるほどだった。"},{"sentence":"A widthless strip of land separated the two properties.","translation":"幅の狭い土地が二つの不動産を隔てていた。"}],"collocations":["widthless path","widthless strip","widthless gap"],"synonyms":["narrow","thin","slender","slim","confined"],"antonyms":["wide","broad","spacious","ample","extensive"]}],"etymology":{"value":"\"width\" + \"-less\". Formed from the noun \"width\" and the suffix \"-less\", indicating absence or lack of.","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɪθləs/","syllables":"width-less"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically formed using \"more\" and \"most\": more widthless, most widthless."},"usage_notes":{"explanation":"\"Widthless\" is used to describe something that has very little or no width. It emphasizes the lack of breadth or the narrowness of an object or space. It is relatively uncommon in modern usage, with \"narrow\" being a more frequently used synonym.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The widthless of the table was a problem.","correct":"✓ The width of the table was a problem.","note":"\"Widthless\" is an adjective, not a noun. Use \"width\" as a noun."},{"incorrect":"✗ The door was widthless to fit the wheelchair.","correct":"✓ The door was too widthless to fit the wheelchair. / ✓ The door was not wide enough to fit the wheelchair.","note":"Ensure proper use of \"widthless\" to describe the lack of width, or rephrase using \"wide enough\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["width (noun): the measurement or extent of something from side to side.","-less (suffix): without.","narrow (adjective): of small width.","thin (adjective): of small thickness or width."],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not commonly listed in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"widthless\" is a relatively uncommon adjective that means lacking width or being very narrow. It is formed by combining the noun \"width\" with the suffix \"-less,\" which indicates the absence of something. While its meaning is straightforward, it is not frequently used in everyday language, and more common synonyms like \"narrow\" are often preferred. Therefore, understanding the word contributes to a more advanced vocabulary but is not essential for basic communication."},"example_sentences":[{"sentence":"The old bridge had become widthless over time, making it unsafe for vehicles.","translation":"その古い橋は時が経つにつれて幅が狭くなり、車両にとっては危険になった。","type":"adjective","meaning_category":"幅がない"},{"sentence":"The artist painted a widthless line to create the illusion of depth.","translation":"その芸術家は奥行きの錯覚を作り出すために、幅のない線を描いた。","type":"adjective","meaning_category":"幅がない"},{"sentence":"The crack in the wall was almost widthless, but it still worried the homeowner.","translation":"壁のひびはほとんど幅がなかったが、それでも家の所有者を心配させた。","type":"adjective","meaning_category":"幅がない"}]}