{"word":"Easternism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"東洋趣味、東洋風、東洋的な特徴","english_definition":"A feature characteristic of the Orient or of Easterners; an Orientalism.","examples":[{"sentence":"The novel is full of Easternisms, from the descriptions of the landscape to the characters' philosophies.","translation":"その小説は、風景の描写から登場人物の哲学に至るまで、東洋趣味に満ちている。"},{"sentence":"The architecture incorporates several Easternisms, such as curved roofs and intricate carvings.","translation":"その建築は、曲線的な屋根や複雑な彫刻など、いくつかの東洋的な特徴を取り入れている。"}],"collocations":["cultural Easternism (文化的な東洋趣味)","artistic Easternism (芸術的な東洋趣味)","architectural Easternism (建築的な東洋趣味)"],"synonyms":["Orientalism","East Asian culture","Eastern influence"],"antonyms":["Westernism","Occidentalism"]},{"part_of_speech":"noun","definition":"東洋の文化・思想・習慣を模倣または取り入れること","english_definition":"The adoption or imitation of Eastern cultures, philosophies, or customs.","examples":[{"sentence":"His embrace of Easternism led him to study meditation and yoga.","translation":"彼の東洋趣味は、彼を瞑想とヨガの研究へと導いた。"},{"sentence":"Some critics view her work as a superficial Easternism, lacking genuine understanding.","translation":"批評家の中には、彼女の作品を、真の理解を欠いた表面的な東洋趣味と見なす者もいる。"}],"collocations":["embrace of Easternism (東洋趣味の受容)","study of Easternism (東洋趣味の研究)","superficial Easternism (表面的な東洋趣味)"],"synonyms":["adoption of Eastern culture","imitation of Eastern customs"],"antonyms":["rejection of Eastern culture","avoidance of Eastern customs"]}],"etymology":{"value":"\"Eastern\" + \"-ism\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈiːstərnɪzəm/","syllables":"Eas-tern-ism"},"inflection":{"noun_plural":"Easternisms"},"usage_notes":{"explanation":"\"Easternism\" refers to the characteristics, styles, or customs associated with Eastern cultures, often used in the context of art, literature, or architecture. It can also describe the adoption or imitation of Eastern cultures. It is closely related to the term \"Orientalism,\" which is sometimes used interchangeably but can also carry negative connotations due to its historical association with Western colonialism and misrepresentation of Eastern cultures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is an Easternism.","correct":"✓ She is interested in Easternism.","note":"\"Easternism\" is a noun referring to a concept or style, not a person."},{"incorrect":"✗ The building has many easternism details.","correct":"✓ The building has many Easternist details. / ✓ The building has many Eastern-style details.","note":"To describe something as being in an Eastern style, use \"Easternist\" as an adjective or \"Eastern-style.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["Easternist (noun/adjective)","Orientalism (noun)","Orientalist (noun/adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Easternism\" is a relatively uncommon term that refers to the characteristics, styles, or customs associated with Eastern cultures. It is often used in academic or artistic contexts to describe the influence of Eastern cultures on Western art, literature, or architecture. The term can also refer to the adoption or imitation of Eastern cultures. It is closely related to the term \"Orientalism,\" which is more widely known but can carry negative connotations. Understanding the nuances of this word requires a good grasp of cultural studies and art history."},"example_sentences":[{"sentence":"The artist's work shows a clear influence of Easternism, with its use of traditional Japanese motifs.","translation":"その芸術家の作品は、伝統的な日本のモチーフの使用において、東洋趣味の明確な影響を示している。","type":"noun","meaning_category":"東洋趣味"},{"sentence":"Some scholars criticize the novel for its superficial portrayal of Easternism.","translation":"一部の学者は、その小説が東洋趣味を表面的に描写していると批判している。","type":"noun","meaning_category":"東洋趣味"},{"sentence":"The museum's collection includes several examples of architectural Easternism from the early 20th century.","translation":"その美術館のコレクションには、20世紀初頭の建築における東洋趣味のいくつかの例が含まれている。","type":"noun","meaning_category":"東洋趣味"}]}