{"word":"nocturia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"夜間頻尿","english_definition":"The need to wake and pass urine at night.","examples":[{"sentence":"Nocturia can be a symptom of various underlying medical conditions.","translation":"夜間頻尿は、さまざまな基礎疾患の症状である可能性があります。"},{"sentence":"He consulted a doctor about his nocturia.","translation":"彼は夜間頻尿について医師に相談しました。"}],"collocations":["experience nocturia","suffer from nocturia","treat nocturia","cause nocturia"],"synonyms":["nighttime urination","frequent nighttime urination"],"antonyms":[]}],"etymology":{"value":"From noct- (prefix meaning 'night') + -uria (suffix relating to urination).","priority":"★★☆"},"pronunciation":{"ipa":"/nɒkˈtjʊəriə/","syllables":"noc-tu-ri-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Nocturia is a medical term referring to the frequent need to urinate during the night, disrupting sleep. It is important to consult a healthcare professional to determine the underlying cause.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have nocturia every night. It's very normal.","correct":"✓ I have nocturia every night. I should probably see a doctor.","note":"While occasional nighttime urination is normal, frequent nocturia may indicate an underlying medical condition that requires evaluation."}],"priority":"★★☆"},"related_words":{"derivatives":["nocturnal (adjective: active at night)","polyuria (noun: excessive urination)","oliguria (noun: decreased urination)"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency. Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nocturia' is a medical term that describes the condition of needing to wake up during the night to urinate. It's not a common word in everyday conversation but is used in medical settings to describe this specific symptom. If someone mentions they have nocturia, it means they are experiencing frequent urination at night, which may warrant a visit to the doctor to find out the cause."},"example_sentences":[{"sentence":"Persistent nocturia can significantly impact sleep quality.","translation":"持続的な夜間頻尿は睡眠の質に大きな影響を与える可能性があります。","type":"general","meaning_category":"General"},{"sentence":"The doctor asked about the frequency of his nocturia.","translation":"医師は彼の夜間頻尿の頻度について尋ねました。","type":"medical","meaning_category":"Medical"}]}