{"word":"paraphrenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"誇大妄想を伴う精神病の、またはそれに関する","english_definition":"relating to or affected by paraphrenia, a mental disorder characterized by systematized delusions, often of grandeur or persecution, with relative preservation of intellect and personality.","examples":[{"sentence":"The patient exhibited paraphrenic symptoms, including elaborate delusions of being a historical figure.","translation":"その患者は、歴史上の人物であるという手の込んだ妄想を含む、誇大妄想的な症状を示した。"}],"collocations":["paraphrenic disorder","paraphrenic state","paraphrenic symptoms"],"synonyms":["delusional","psychotic","grandiose","paranoid"],"antonyms":["sane","rational","coherent"]}],"etymology":{"value":"Derived from the combination of 'para-' (meaning 'beside' or 'beyond') and 'phrenic' (relating to the mind), indicating a mental state that is 'beyond' or 'deviating from' normal mental functioning.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəˈfrɛnɪk/","syllables":"pa-ra-phren-ic"},"inflection":{"notes":"Since it is an adjective, it has comparative and superlative forms (more paraphrenic, most paraphrenic), but they are rarely used."},"usage_notes":{"explanation":"'Paraphrenic' is a term primarily used in the field of psychiatry to describe symptoms or conditions related to paraphrenia. It is often used to characterize specific types of delusions or behaviors observed in patients with this disorder. The term is less commonly used now, with more specific diagnoses being preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The paraphrenic person was happy.","correct":"✓ The paraphrenic patient was happy.","note":"'Paraphrenic' is an adjective, not a noun. It should be used to describe a person or their symptoms, not as a label for the person themselves. Use 'paraphrenic patient' or 'person with paraphrenia' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["paraphrenia (noun: a mental disorder characterized by systematized delusions)"],"related_terms":["schizophrenia","paranoid schizophrenia","delusional disorder"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'paraphrenic' is highly specialized and primarily used within psychiatric contexts to describe conditions related to paraphrenia. It is not commonly encountered in general language. Understanding this term requires familiarity with psychiatric terminology and concepts related to delusional disorders."},"example_sentences":[{"sentence":"The psychiatrist noted the patient's paraphrenic tendencies during the evaluation.","translation":"精神科医は評価中に患者の誇大妄想的な傾向に注目した。","type":"adjective","meaning_category":"精神医学"},{"sentence":"Paraphrenic delusions often involve complex and internally consistent belief systems.","translation":"誇大妄想的な妄想は、複雑で内部的に一貫した信念体系を伴うことが多い。","type":"adjective","meaning_category":"精神医学"}]}