{"word":"hop-shaped","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"ホップの形をした","english_definition":"Having the shape of a hop (the flower of the hop plant).","examples":[{"sentence":"The candies were hop-shaped and flavored with beer.","translation":"そのキャンディはホップの形をしていて、ビール風味だった。"},{"sentence":"The earrings were a unique hop-shaped design.","translation":"そのイヤリングはユニークなホップ型のデザインだった。"}],"collocations":["hop-shaped candy","hop-shaped earrings","hop-shaped design"],"synonyms":["cone-shaped (if referring to the general shape of a hop cone)"],"antonyms":[]}],"etymology":{"value":"Formed from 'hop' (referring to the plant) and 'shaped' (having a specific form).","priority":"N/A"},"pronunciation":{"ipa":"/ˈhɒpˌʃeɪpt/","syllables":"hop-shaped"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms, which are not common for compound adjectives like this one."},"usage_notes":{"explanation":"This term is descriptive and relatively uncommon. It is used to describe something that visually resembles the shape of a hop, particularly the cone-like flower of the hop plant.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["hop (noun)","shape (noun, verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'hop-shaped' is a compound adjective used to describe objects that resemble the shape of a hop, which is the cone-like flower of the hop plant. It is a relatively uncommon term, likely to be encountered in contexts related to beer, gardening, or specialized design. Understanding requires familiarity with the appearance of hops."},"example_sentences":[{"sentence":"The brewery gave out promotional items that were hop-shaped.","translation":"その醸造所はホップの形をした販促品を配布した。","type":"adjective","meaning_category":"shape"},{"sentence":"She crafted hop-shaped ornaments for the beer festival.","translation":"彼女はビール祭りのためにホップ型の飾りを作った。","type":"adjective","meaning_category":"shape"}]}