{"word":"slide-rest","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(旋盤などの)刃物台","english_definition":"A component of a lathe or other machine tool that supports and positions the cutting tool.","examples":[{"sentence":"The slide-rest allows for precise control of the cutting tool's movement.","translation":"刃物台によって、切削工具の動きを正確に制御できます。"},{"sentence":"Adjust the slide-rest to achieve the desired depth of cut.","translation":"目的の切削深さを得るために、刃物台を調整してください。"}],"collocations":["compound slide-rest","top slide-rest","cross slide-rest"],"synonyms":["tool slide","compound rest"],"antonyms":[]}],"etymology":{"value":"Compound of 'slide' and 'rest', referring to its sliding motion and supporting function.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈslaɪdˌrɛst/","syllables":"slide-rest"},"inflection":{"noun_plural":"slide-rests"},"usage_notes":{"explanation":"The term 'slide-rest' is primarily used in the context of machining and engineering. It specifically refers to the part of a machine tool that holds and moves the cutting tool.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The slide rest was broken, so I couldn't slide.","correct":"✓ The slide-rest was broken, so I couldn't machine the part.","note":"'Slide-rest' refers to a machine component, not a playground slide."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'slide-rest' is a technical term used in engineering and machining contexts. It refers to a specific component of machine tools like lathes. Understanding its meaning requires familiarity with machining processes."},"example_sentences":[{"sentence":"The machinist carefully adjusted the slide-rest before starting the cut.","translation":"機械工は切削を開始する前に、慎重に刃物台を調整しました。","type":"noun","meaning_category":"刃物台"},{"sentence":"The compound slide-rest allows for angled cuts to be made easily.","translation":"複合刃物台を使用すると、角度のある切削を簡単に行うことができます。","type":"noun","meaning_category":"刃物台"}]}