{"word":"gleanable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"拾い集めることができる、収集可能な","english_definition":"Capable of being gleaned; able to be gathered or collected, often referring to information or leftover crops.","examples":[{"sentence":"The data is gleanable from various online sources.","translation":"そのデータは様々なオンラインソースから収集可能です。"},{"sentence":"There's still some gleanable wheat left in the field after the harvest.","translation":"収穫後もまだ畑には拾い集められる小麦が残っています。"}],"collocations":["gleanable data","gleanable information","gleanable resources"],"synonyms":["collectable","gatherable","obtainable","extractable"],"antonyms":["unobtainable","uncollectable"]}],"etymology":{"value":"The word \"gleanable\" is derived from the verb \"glean,\" which comes from the Old French word \"glener,\" meaning \"to gather what is left behind.\" This, in turn, comes from Late Latin \"glennare,\" of uncertain origin. The suffix \"-able\" indicates capability or possibility.","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡliːnəbəl","syllables":"glean-a-ble"},"inflection":{"notes":"This is an adjective, so it can form comparative and superlative degrees, though they are not commonly used: more gleanable, most gleanable."},"usage_notes":{"explanation":"\"Gleanable\" is often used in the context of information or data that can be gathered from various sources, sometimes implying that the gathering requires effort or is done after the primary collection has occurred. It can also refer to leftover crops after a harvest. The term suggests that the material is available but may not be immediately obvious or easily accessible.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gleanable is easy to find.","correct":"✓ The gleanable information is easy to find.","note":"\"Gleanable\" is an adjective and needs to modify a noun. It cannot stand alone as a noun."},{"incorrect":"✗ The data was gleaning.","correct":"✓ The data was gleanable.","note":"\"Gleaning\" is a verb form. Use \"gleanable\" to describe something that can be gleaned."}],"priority":"★★☆"},"related_words":{"derivatives":["glean (verb, noun)","gleaner (noun)","gleaning (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"gleanable\" is a relatively uncommon adjective that means something can be gathered or collected, often with effort or from scattered sources. It's more frequently used in academic or technical contexts, especially when referring to data or information. Understanding the root word \"glean\" (to gather leftover crops or information) helps in grasping the meaning of \"gleanable.\""},"example_sentences":[{"sentence":"Much of the information is **gleanable** through careful analysis of public records.","translation":"情報の多くは、公的記録の注意深い分析を通じて収集可能です。","type":"adjective","meaning_category":"収集可能な (情報)"},{"sentence":"The remaining grain was **gleanable** by the villagers after the main harvest.","translation":"残りの穀物は、本収穫後に村人たちによって拾い集めることができました。","type":"adjective","meaning_category":"拾い集めることができる (作物)"}]}