{"word":"examination-centered","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"試験中心の、試験偏重の","english_definition":"Focused primarily on examinations, often to the detriment of other aspects of learning.","examples":[{"sentence":"The education system is too examination-centered, focusing on rote memorization rather than critical thinking.","translation":"その教育システムは試験中心に偏りすぎており、批判的思考よりも暗記学習に重点を置いている。"},{"sentence":"An examination-centered curriculum can stifle creativity and discourage students from pursuing their own interests.","translation":"試験中心のカリキュラムは創造性を抑制し、生徒が自身の興味を追求することを妨げる可能性がある。"}],"collocations":["examination-centered education","examination-centered curriculum","examination-centered system","examination-centered approach"],"synonyms":["test-oriented","exam-focused","assessment-driven"],"antonyms":["student-centered","inquiry-based","holistic"],"notes":"Often used critically to describe educational systems that prioritize exam results over genuine understanding and skill development."}],"etymology":{"value":"A compound adjective formed from 'examination' (a formal test of knowledge or ability) and 'centered' (having something as the main focus).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪɡˌzæmɪˈneɪʃənˌsentərd/","syllables":"ex-am-i-na-tion-cen-tered"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Examination-centered' is used to describe educational systems, curricula, or approaches that place excessive emphasis on examinations as the primary measure of student achievement. This can lead to a narrow focus on memorization and test-taking skills, potentially neglecting other important aspects of learning such as critical thinking, creativity, and practical application of knowledge. The term often carries a negative connotation, suggesting that the focus on examinations is detrimental to a well-rounded education.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The school is very center of examination.","correct":"✓ The school is very examination-centered.","note":"'Examination-centered' is a compound adjective, not a noun phrase."}],"priority":"★★☆"},"related_words":{"derivatives":["examination","center","centeredness"],"related_concepts":["rote learning","standardized testing","high-stakes testing","curriculum","pedagogy"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'examination-centered' is a relatively complex term used in educational contexts to critique systems that overemphasize testing. Understanding requires familiarity with educational theory and critical perspectives on assessment."},"example_sentences":[{"sentence":"The government is trying to move away from an overly examination-centered approach to education.","translation":"政府は、教育における過度な試験中心のアプローチから脱却しようとしている。","type":"general","meaning_category":"general"},{"sentence":"Many teachers feel pressured to teach to the test in an examination-centered environment.","translation":"多くの教師は、試験中心の環境で、試験対策の授業をすることを強いられていると感じている。","type":"general","meaning_category":"general"}]}