{"word":"twice-destroyed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"destroyed two times; having undergone destruction on two separate occasions.","english_definition":"Having been destroyed or ruined on two separate occasions.","examples":[{"sentence":"The city was twice-destroyed by earthquakes.","translation":"その都市は地震によって二度破壊された。"},{"sentence":"The document was twice-destroyed, first by fire and then by water.","translation":"その書類は二度破壊された。最初は火事で、次に水害で。"}],"collocations":["twice-destroyed city","twice-destroyed document","twice-destroyed artifact"],"synonyms":["double-destroyed","repeatedly destroyed"],"antonyms":["undestroyed","intact","preserved"]}],"etymology":{"value":"Formed by combining \"twice\" (meaning two times) with \"destroyed\" (past participle of the verb \"destroy\").","priority":"N/A"},"pronunciation":{"ipa":"/ˈtwaɪs dɪˈstrɔɪd/","syllables":"twice-de-stroyed"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative constructions with 'more' and 'most' (e.g., 'more twice-destroyed')."},"usage_notes":{"explanation":"The term \"twice-destroyed\" is a descriptive adjective used to emphasize the repeated destruction of something. It is not a common word, but it is readily understood due to its straightforward construction. It is typically used to evoke a sense of severe damage or loss.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The twice destroy building.","correct":"✓ The twice-destroyed building.","note":"Use the past participle form 'destroyed' as it acts as an adjective describing the building."}],"priority":"N/A"},"related_words":{"derivatives":["destruction","destroy","destroyed"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"twice-destroyed\" is a compound adjective indicating that something has been destroyed on two separate occasions. It is a relatively uncommon term but easily understood due to its straightforward composition. It is used to emphasize the extent of damage or loss something has suffered. It is more likely to appear in formal or descriptive contexts."},"example_sentences":[{"sentence":"The library, a twice-destroyed landmark, was finally rebuilt with modern technology.","translation":"二度破壊されたランドマークである図書館は、ついに最新技術で再建された。","type":"adjective","meaning_category":"destroyed two times"},{"sentence":"The ancient manuscript, twice-destroyed by floods and fires, was painstakingly restored by experts.","translation":"洪水と火災で二度破壊された古代の原稿は、専門家によって骨の折れる作業で修復された。","type":"adjective","meaning_category":"destroyed two times"}]}