{"word":"documentary-style","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ドキュメンタリー風の、記録映画のような","english_definition":"resembling or characteristic of a documentary film or television program.","examples":[{"sentence":"The movie used a documentary-style approach to tell the story.","translation":"その映画はドキュメンタリー風の手法を使って物語を語った。"},{"sentence":"The photographer captured the events in a documentary-style manner.","translation":"その写真家はドキュメンタリー風のやり方で出来事を捉えた。"},{"sentence":"The series is filmed in a documentary-style, with interviews and real-life footage.","translation":"そのシリーズは、インタビューや実生活の映像を交えながら、ドキュメンタリー風に撮影されている。"}],"collocations":["documentary-style film","documentary-style photography","documentary-style approach","documentary-style filmmaking","documentary-style techniques"],"synonyms":["verité","cinema verité","observational","non-fiction","factual"],"antonyms":["fictional","staged","scripted","narrative"],"related_terms":["mockumentary","docudrama","documentary"],"notes":"Often used to describe a film or television program that uses techniques associated with documentaries, even if it is not strictly a documentary itself."}],"etymology":{"value":"Combination of 'documentary' (a film or television program presenting the facts about a person or event) and 'style' (a particular way of doing something).","priority":"★★★"},"pronunciation":{"ipa":"/ˌdɒkjʊˈmɛntəri staɪl/","syllables":"doc-u-men-ta-ry style"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Documentary-style' describes something that imitates the aesthetics, techniques, or methods of a documentary film. It implies a sense of realism, authenticity, and often involves elements such as interviews, real-life footage, and a focus on factual information. It can be used to describe various forms of media, including films, television programs, photography, and even writing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The film was documentary style.","correct":"✓ The film was documentary-style.","note":"It is important to use the hyphen to connect the words and create a compound adjective."},{"incorrect":"✗ He made a documentary style movie.","correct":"✓ He made a documentary-style movie.","note":"The hyphen is needed to correctly modify the noun 'movie' with the compound adjective."}],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in discussions of film and media.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Documentary-style' is used to describe something that looks or feels like a documentary, even if it isn't a real documentary. This means it might use real-life footage, interviews, or try to seem very realistic. It's often used to describe movies or TV shows that want to feel authentic or show things as they really are. You might hear it used when talking about how a film is made or how a photographer captures images.","priority":"★★★"},"example_sentences":[{"sentence":"The commercial was shot in a documentary-style to give it a more authentic feel.","translation":"そのコマーシャルは、より本物らしさを出すためにドキュメンタリー風に撮影された。","type":"general","meaning_category":"general"},{"sentence":"The director chose a documentary-style approach to explore the social issues.","translation":"監督は社会問題を掘り下げるためにドキュメンタリー風の手法を選んだ。","type":"general","meaning_category":"general"},{"sentence":"Her photography has a raw, documentary-style quality.","translation":"彼女の写真は、生々しいドキュメンタリー風の質を持っている。","type":"general","meaning_category":"general"}]}