{"word":"Orrum","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A historical unit of dry measure used in certain parts of India, particularly in the Madras Presidency. It was typically a small measure used for grains.","english_definition":"A historical unit of dry measure used in certain parts of India, particularly in the Madras Presidency. It was typically a small measure used for grains.","examples":[{"sentence":"The farmer measured the rice using an orrum.","translation":"農家はオルムを使って米を測った。"},{"sentence":"An orrum was a common measure in the local market.","translation":"オルムは地元の市場で一般的な単位だった。"}],"collocations":["measure in orrums","one orrum of rice","local orrum measure"],"synonyms":["measure","unit","historical unit"],"antonyms":[]}],"etymology":{"value":"The origin of the word 'Orrum' is likely rooted in local Indian languages of the Madras Presidency, possibly Tamil or Telugu, where it was used as a specific measurement term. Further research would be needed to pinpoint the exact linguistic origin.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈɔːrəm/","syllables":"Or-rum"},"inflection":{"noun_plural":"orrums"},"usage_notes":{"explanation":"The term 'Orrum' is primarily of historical interest and is not commonly used in modern contexts. It refers to a specific unit of dry measure used in parts of India, especially during the British colonial period. Its exact equivalent in modern units would vary depending on the region and specific grain being measured.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Using 'Orrum' in a modern measurement context without specifying its historical and regional relevance.","correct":"Referencing 'Orrum' when discussing historical measurements in specific regions of India."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["seer","maund","paddy","Madras Presidency"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency due to its historical and regional specificity.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Orrum' is a specialized term related to historical measurement systems in India. It is unlikely to be encountered in general English usage and is more relevant in historical or anthropological contexts when discussing traditional measurement units in specific regions of India. Understanding requires knowledge of historical measurement practices."},"example_sentences":[{"sentence":"The old records indicated that the tax was collected based on the number of orrums of grain produced.","translation":"古い記録によると、税金は生産された穀物のオルム数に基づいて徴収された。","type":"noun","meaning_category":"historical measure"},{"sentence":"Local historians are researching the precise volume of an orrum in different villages.","translation":"地元の歴史家たちは、異なる村におけるオルムの正確な量を研究している。","type":"noun","meaning_category":"historical measure"}]}