{"word":"antisubstance","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"反物質","english_definition":"Matter composed of antiparticles, which have the same mass as particles of ordinary matter but opposite charge and other quantum numbers.","examples":[{"sentence":"Antisubstance annihilates upon contact with ordinary matter, releasing energy.","translation":"反物質は通常の物質と接触すると対消滅し、エネルギーを放出する。"},{"sentence":"Scientists are studying the properties of antisubstance to understand the asymmetry between matter and antimatter in the universe.","translation":"科学者たちは宇宙における物質と反物質の非対称性を理解するために反物質の特性を研究している。"}],"collocations":["antihydrogen (反水素)","antiproton (反陽子)","positron (陽電子)","matter-antimatter asymmetry (物質と反物質の非対称性)"],"synonyms":["antimatter"],"antonyms":["matter","substance"]}],"etymology":{"value":"Formed by combining the prefix 'anti-' (meaning 'opposite' or 'against') with 'substance'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈsʌbstəns/","syllables":"an-ti-sub-stance"},"inflection":{"noun_plural":"antisubstances"},"usage_notes":{"explanation":"'Antisubstance' is a scientific term used in physics to describe matter composed of antiparticles. When antisubstance comes into contact with ordinary matter, they annihilate each other, converting their mass into energy. The study of antisubstance is crucial for understanding fundamental aspects of the universe.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Antisubstance is the same as dark matter.","correct":"✓ Antisubstance is different from dark matter.","note":"Antisubstance is composed of antiparticles and interacts with ordinary matter through annihilation, while dark matter is a hypothetical form of matter that does not interact with light or ordinary matter. They are distinct concepts."}],"priority":"★★☆"},"related_words":{"derivatives":["antimatter","antiparticle","annihilation"],"related_terms":["physics","quantum mechanics","particle physics","cosmology"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antisubstance' is a technical term primarily used in the context of physics and cosmology. Understanding the concept requires familiarity with particle physics and the properties of antiparticles. The term is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The creation of antihydrogen atoms allows scientists to study antisubstance in a controlled environment.","translation":"反水素原子の生成により、科学者たちは制御された環境で反物質を研究することができる。","type":"scientific context","meaning_category":"反物質"},{"sentence":"The annihilation of antisubstance with matter releases a tremendous amount of energy.","translation":"反物質と物質の対消滅は、莫大なエネルギーを放出する。","type":"scientific context","meaning_category":"反物質"}]}