{"word":"death-swimming","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A dangerous or reckless act of swimming, often involving high risk or disregard for safety.","english_definition":"(rare) A dangerous or reckless act of swimming, often involving high risk or disregard for safety.","examples":[{"sentence":"His death-swimming antics in the rapids worried his friends.","translation":"彼の急流での危険な水泳は友人たちを心配させた。"},{"sentence":"The lifeguard warned against death-swimming near the cliffs.","translation":"ライフガードは崖の近くでの危険な水泳を警告した。"}],"collocations":["reckless swimming","dangerous swimming","risky swimming"],"synonyms":["daredevil swimming","suicidal swimming"],"antonyms":["safe swimming","cautious swimming"]}],"etymology":{"value":"Likely a compound word formed from \"death\" and \"swimming,\" implying swimming activities that are life-threatening or extremely dangerous.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɛθˌswɪmɪŋ/","syllables":"death-swim-ming"},"inflection":{"noun_plural":"death-swimmings"},"usage_notes":{"explanation":"The term \"death-swimming\" is rare and not widely recognized. It is used to describe swimming activities that are extremely dangerous and often involve a high risk of death or serious injury. The term implies a reckless disregard for safety.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was death-swimmingly good at swimming.","correct":"✓ He was extremely good at swimming.","note":"\"Death-swimming\" is a noun describing a dangerous activity, not an adverb to describe skill. Use \"extremely\" or \"very\" to describe skill. "},{"incorrect":"✗ She enjoyed death-swimming in the pool.","correct":"✓ She enjoyed swimming in the pool.","note":"\"Death-swimming\" implies a high level of danger. It's unlikely to occur in a controlled environment like a pool."}],"priority":"★☆☆"},"related_words":{"derivatives":["death wish","daredevil","reckless"],"phrases":["tempting fate","playing with fire"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Death-swimming\" is a rare and figurative term used to describe swimming activities that are extremely dangerous and life-threatening. It implies a reckless disregard for personal safety and a high risk of serious injury or death. Due to its rarity and strong connotation, it is not commonly used in everyday language and is more likely to appear in descriptive or narrative contexts where the danger of the activity is being emphasized."},"example_sentences":[{"sentence":"The local authorities strongly discourage death-swimming in the treacherous river currents.","translation":"地元の当局は、危険な川の流れでの危険な水泳を強く禁止している。","type":"noun","meaning_category":"dangerous activity"},{"sentence":"His reputation for death-swimming preceded him, making him a legend among the local youth.","translation":"彼の危険な水泳の評判は先行し、地元の若者の間で彼を伝説にした。","type":"noun","meaning_category":"dangerous activity"}]}