{"word":"lipase","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"リパーゼ（脂肪分解酵素）","english_definition":"Any of a class of enzymes that catalyze the hydrolysis of fats (lipids).","examples":[{"sentence":"Lipase is essential for the digestion of fats in the body.","translation":"リパーゼは体内の脂肪の消化に不可欠である。"},{"sentence":"Pancreatic lipase breaks down triglycerides into fatty acids and glycerol.","translation":"膵リパーゼはトリグリセリドを脂肪酸とグリセロールに分解する。"}],"collocations":["pancreatic lipase (膵リパーゼ)","gastric lipase (胃リパーゼ)","lipase activity (リパーゼ活性)","lipase production (リパーゼ産生)"],"synonyms":["fat-splitting enzyme","steapsin"],"antonyms":[]}],"etymology":{"value":"From 'lipo-' (referring to fat) + '-ase' (suffix indicating an enzyme). The 'lipo-' prefix comes from the Greek word 'lipos' meaning fat.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlaɪpeɪs/","syllables":"li-pase"},"inflection":{"noun_plural":"lipases"},"usage_notes":{"explanation":"Lipases are a family of enzymes that play a crucial role in the digestion and metabolism of fats (lipids). They catalyze the hydrolysis of triglycerides into glycerol and fatty acids. Different types of lipases exist, each with specific functions and locations in the body, such as pancreatic lipase (produced in the pancreas) and gastric lipase (produced in the stomach). Lipase levels in the blood can be measured to diagnose certain medical conditions, such as pancreatitis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Lipase are important for digestion.","correct":"✓ Lipases are important for digestion.","note":"Lipase is a class of enzymes, so when referring to the group in general, use the plural form 'lipases'."},{"incorrect":"✗ Lipase is a type of fat.","correct":"✓ Lipase is a type of enzyme that breaks down fat.","note":"Lipase is an enzyme, not a type of fat. It breaks down fats into smaller molecules."}],"priority":"★★☆"},"related_words":{"derivatives":["lipolytic (adjective: relating to or promoting the breakdown of fats)","lipolysis (noun: the breakdown of fats and other lipids by hydrolysis to release fatty acids)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific or medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lipase' is a technical term used in biology and medicine to describe a type of enzyme that breaks down fats. It's not a word you'd typically encounter in everyday conversation. Understanding this word requires some knowledge of biochemistry or physiology. It's most commonly found in scientific articles, textbooks, or medical discussions related to digestion and metabolism.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor ordered a blood test to check her **lipase** levels.","translation":"医師は彼女の血液中のリパーゼ値を調べるために血液検査を指示した。","type":"noun","meaning_category":"Enzyme levels"},{"sentence":"**Lipase** inhibitors are sometimes used in weight-loss medications.","translation":"リパーゼ阻害剤は、減量薬として使用されることがある。","type":"noun","meaning_category":"Medication"},{"sentence":"The small intestine is the primary site of **lipase** activity.","translation":"小腸はリパーゼ活性の主要な部位である。","type":"noun","meaning_category":"Location of activity"},{"sentence":"Different types of **lipases** are produced by various organs in the body.","translation":"様々な種類のリパーゼが体内の様々な器官によって産生される。","type":"noun","meaning_category":"Enzyme types"}]}