{"word":"prayer-repeating","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a person or action) characterized by the repetitive recitation of prayers, often without deep understanding or sincere intention.","english_definition":"Characterized by the repetitive recitation of prayers, often without deep understanding or sincere intention.","examples":[{"sentence":"The monk's prayer-repeating became a mindless ritual.","translation":"その僧侶の祈りの繰り返しは、無意味な儀式と化した。"},{"sentence":"She accused him of prayer-repeating instead of truly connecting with God.","translation":"彼女は彼が神と真につながる代わりに、祈りを繰り返しているだけだと非難した。"}],"collocations":["mindless prayer-repeating","empty prayer-repeating","rote prayer-repeating"],"synonyms":["formulaic","mechanical","rote","ritualistic"],"antonyms":["sincere","heartfelt","genuine"]}],"etymology":{"value":"Derived from the combination of 'prayer' (a solemn request for help or expression of thanks addressed to God or an object of worship) and 'repeating' (the action of saying or doing something again). The hyphenated form emphasizes the combined meaning of the repetitive nature of the prayers.","priority":"N/A"},"pronunciation":{"ipa":"/ˈpreɪər rɪˌpiːtɪŋ/","syllables":"prayer-re-peat-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. The noun form would be 'prayer-repeating' (the act of)."},"usage_notes":{"explanation":"The term 'prayer-repeating' often carries a negative connotation, suggesting a lack of genuine devotion or understanding in the act of praying. It implies that the prayers are being recited mechanically, without the person truly engaging with the meaning or intent behind them.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is prayer repeating.","correct":"✓ He is prayer-repeating.","note":"The hyphen is important to connect the two words and create the adjective. Alternatively, you could say 'He is repeating prayers.'"},{"incorrect":"✗ The prayer-repeating was sincerity.","correct":"✓ The prayer-repeating lacked sincerity.","note":"'Prayer-repeating' itself is not sincerity; rather, it is often contrasted with sincerity. The act of repeating prayers might lack sincerity."}],"priority":"N/A"},"related_words":{"derivatives":["prayer","repeat","repetition"],"phrasal_verbs":["N/A"],"related_concepts":["ritual","devotion","sincerity","faith"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Not a common term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Prayer-repeating' describes the act of saying prayers over and over, often without really thinking about what the words mean. It's like reading aloud without understanding. This term is often used negatively to suggest that someone is just going through the motions and isn't truly devoted or sincere in their faith. It is not a common term, so it is mostly used in specific religious or philosophical discussions."},"example_sentences":[{"sentence":"His critics dismissed his religious practice as mere prayer-repeating.","translation":"彼の批判者たちは、彼の宗教的実践を単なる祈りの繰り返しだと一蹴した。","type":"adjective","meaning_category":"repetitive recitation of prayers"},{"sentence":"The prayer-repeating machine was designed to offer comfort to those in need.","translation":"その祈り繰り返し機は、困っている人々に慰めを与えるように設計された。","type":"adjective","meaning_category":"repetitive recitation of prayers"}]}