{"word":"holohedron","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(結晶学)完全面像結晶、全面像結晶","english_definition":"(crystallography) a crystal form or class having the highest possible symmetry, with all faces present in pairs related by a center of symmetry.","examples":[{"sentence":"A cube is a simple example of a holohedron.","translation":"立方体は、正像面像結晶の単純な例です。"},{"sentence":"Holohedrons exhibit the maximum number of faces consistent with the crystal system.","translation":"正像面像結晶は、結晶系と一致する最大の面数を示します。"}],"collocations":["holohedral class","holohedral form","holohedral symmetry"],"synonyms":["euhedral","idiomorphic"],"antonyms":["hemihedral","tetartohedral"]}],"etymology":{"value":"From Greek 'holos' (whole) + 'hedra' (base, face) + '-on' (suffix indicating a unit or form).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɒləˈhiːdrən/","syllables":"ho-lo-he-dron"},"inflection":{"noun_plural":"holohedrons or holohedra"},"usage_notes":{"explanation":"A holohedron is a crystal form that exhibits the highest degree of symmetry possible within its crystal system. This means that every possible face that is consistent with the symmetry elements of the crystal system is present in the crystal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Holohedrons are always cubic.","correct":"✓ Holohedrons can be cubic, but they also exist in other crystal systems.","note":"While a cube is a common example of a holohedron, holohedrons exist in other crystal systems as well."}],"priority":"★☆☆"},"related_words":{"derivatives":["holohedral (adjective)"],"related_terms":["crystal system","symmetry","hemihedron","tetartohedron"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. Specialized term in crystallography.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'holohedron' is highly specialized within the field of crystallography. It refers to a crystal form that possesses the highest possible symmetry within its crystal system, meaning all faces consistent with the crystal's symmetry are present. Understanding this term requires knowledge of crystallography and crystal symmetry elements."},"example_sentences":[{"sentence":"The mineral sample displayed a perfect holohedron structure.","translation":"その鉱物サンプルは完璧な正像面像結晶構造を示した。","type":"noun","meaning_category":"crystallography"},{"sentence":"Holohedrons are important in understanding the underlying symmetry of crystal lattices.","translation":"正像面像結晶は、結晶格子の基本的な対称性を理解する上で重要です。","type":"noun","meaning_category":"crystallography"}]}