{"word":"sonnetisation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ソネット化、ソネットにすること","english_definition":"The act or process of converting something into a sonnet, or expressing something in the form of a sonnet.","examples":[{"sentence":"The sonnetisation of the poem was a challenging task.","translation":"その詩をソネット化することは困難な作業だった。"},{"sentence":"He attempted the sonnetisation of the novel's key themes.","translation":"彼はその小説の主要なテーマをソネット化しようと試みた。"}],"collocations":["attempted sonnetisation","literary sonnetisation"],"synonyms":["sonnetizing","sonnetification"],"antonyms":[]}],"etymology":{"value":"Formed from \"sonnet\" + \"-isation\" (the suffix used to form nouns of action or process).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɒnɪtaɪˈzeɪʃən/","syllables":"son-net-i-sa-tion"},"inflection":{"noun_plural":"sonnetisations"},"usage_notes":{"explanation":"\"Sonnetisation\" is a relatively rare term, primarily used in literary contexts to describe the transformation of prose or other poetic forms into a sonnet. It emphasizes the act of adapting content to fit the strict structure and rhyme scheme of a sonnet.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sonnetization was beautiful, but it didn't make sense.","correct":"✓ The sonnetisation was beautiful, but the meaning was lost.","note":"Sonnetisation refers to the process, not the result. The result would be the sonnet itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["sonnet","sonnetize","sonneteer"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Sonnetisation\" is a highly specialized term used in literary analysis. It refers to the process of converting a text or idea into a sonnet form. Understanding this word requires familiarity with the sonnet as a poetic form."},"example_sentences":[{"sentence":"The professor discussed the challenges of the sonnetisation of modern themes.","translation":"教授は現代的なテーマをソネット化する際の課題について議論した。","type":"noun","meaning_category":"ソネット化のプロセス"},{"sentence":"Her thesis explored the sonnetisation of classical myths in contemporary poetry.","translation":"彼女の論文は、現代詩における古典的な神話のソネット化を探求した。","type":"noun","meaning_category":"ソネット化のプロセス"}]}