{"word":"goblinry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ゴブリンのような性質、行動、またはゴブリンに関する事柄","english_definition":"behavior or actions characteristic of goblins; things relating to goblins.","examples":[{"sentence":"The old house was filled with an atmosphere of goblinry, with strange noises and shadows.","translation":"その古い家は、奇妙な音と影で、ゴブリンのような雰囲気に満ちていた。"},{"sentence":"The children's story was full of goblinry and fantastical creatures.","translation":"その子供向けの話は、ゴブリンや空想的な生き物でいっぱいだった。"}],"collocations":["atmosphere of goblinry","tales of goblinry","elements of goblinry"],"synonyms":["devilry","witchcraft","trickery","mischief","impishness"],"antonyms":[],"notes":"Often used to describe mischievous or malevolent behavior."}],"etymology":{"value":"\"Goblin\" + \"-ry\". The suffix \"-ry\" is used to form nouns denoting a characteristic quality, condition, skill, or activity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɒblɪnri/","syllables":"gob-lin-ry"},"inflection":{"noun_plural":"goblinries"},"usage_notes":{"explanation":"\"Goblinry\" is a relatively uncommon word used to describe things associated with goblins, especially their mischievous or malevolent behavior. It can refer to the atmosphere, actions, or stories involving goblins.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The goblinry was delicious.","correct":"✓ The goblin stew was delicious.","note":"\"Goblinry\" refers to the characteristics or actions of goblins, not something that can be eaten. Use \"goblin stew\" or another appropriate term when referring to food."}],"priority":"★☆☆"},"related_words":{"derivatives":["goblin (noun)","goblinish (adjective)"],"phrasal_verbs":[],"related_concepts":["folklore","mythology","fantasy"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Goblinry\" is a niche word, primarily found in fantasy literature or discussions about folklore. Understanding requires familiarity with the concept of goblins and the function of the suffix \"-ry.\" It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The play was filled with scenes of dark forests and eerie goblinry.","translation":"その劇は、暗い森と不気味なゴブリンのような場面で満たされていた。","type":"noun","meaning_category":"ゴブリンのような性質"},{"sentence":"She described the politician's actions as a form of bureaucratic goblinry.","translation":"彼女は政治家の行動を官僚的なゴブリンのようなものだと表現した。","type":"noun","meaning_category":"ゴブリンのような行動"}]}