{"word":"hypnosporic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(biology) Relating to or characterized by hypnospores.","english_definition":"Relating to or characterized by hypnospores.","examples":[{"sentence":"The hypnosporic stage of the fungus is highly resistant to environmental stress.","translation":"その菌類の休眠胞子の段階は、環境ストレスに対して非常に耐性がある。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'hypnospore' (a thick-walled, dormant spore) + '-ic' (suffix indicating relationship or characteristic).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɪpnəˈspɔːrɪk/","syllables":"hyp-no-spor-ic"},"inflection":{},"usage_notes":{"explanation":"This term is highly specialized and primarily used in mycology (the study of fungi) and phycology (the study of algae). It describes features or processes associated with hypnospores, which are resting spores that allow organisms to survive unfavorable conditions.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["hypnospore"],"related_terms":[]},"level_frequency":{"frequency_google_ngram":"Extremely low frequency. This is a highly technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'hypnosporic' is a highly technical adjective used in the fields of biology, specifically mycology and phycology. It describes something that pertains to or is characterized by hypnospores, which are thick-walled, dormant spores that enable certain organisms to survive harsh environmental conditions. Due to its specialized nature, this term is rarely encountered outside of scientific literature. Understanding requires a background in biological terminology."},"example_sentences":[{"sentence":"The alga exhibits a hypnosporic phase during periods of drought.","translation":"その藻類は、干ばつの期間中に休眠胞子の段階を示す。","type":"general","meaning_category":"biology"},{"sentence":"Hypnosporic cells are crucial for the long-term survival of the species.","translation":"休眠胞子の細胞は、その種の長期的な生存にとって重要である。","type":"general","meaning_category":"biology"}]}