{"word":"draw-loom","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"紋織機、ドロー織機：複雑な模様の織物を織るために使用される織機の一種。模様を制御するために補助的な機構（ドローボーイまたはジャカード機構）を使用する。","english_definition":"A type of loom used for weaving figured cloth, employing an auxiliary mechanism (drawboy or Jacquard mechanism) to control the pattern.","examples":[{"sentence":"The draw-loom allowed weavers to create intricate designs in silk and other fine fabrics.","translation":"紋織機のおかげで、織工は絹やその他の高級生地に複雑な模様を作り出すことができた。"},{"sentence":"Operating a draw-loom required skill and coordination between the weaver and the drawboy.","translation":"紋織機を操作するには、織工とドローボーイの間の熟練した技術と連携が必要だった。"}],"collocations":["operate a draw-loom (紋織機を操作する)","weave on a draw-loom (紋織機で織る)","draw-loom weaving (紋織機織り)"],"synonyms":["figured loom","pattern loom"],"antonyms":[]},{"part_of_speech":"noun","definition":"（歴史的な意味で）ドローボーイ：紋織機で模様を制御するために糸を引く少年。","english_definition":"(historical) A drawboy: a boy who pulled the cords to control the pattern on a draw-loom.","examples":[{"sentence":"Before the invention of the Jacquard mechanism, a drawboy was essential for operating a draw-loom.","translation":"ジャカード機構が発明される前は、ドローボーイは紋織機を操作するために不可欠だった。"},{"sentence":"The work of a drawboy was laborious and required precision.","translation":"ドローボーイの仕事は骨が折れ、正確さが求められた。"}],"collocations":["employ a drawboy (ドローボーイを雇う)","drawboy's work (ドローボーイの仕事)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Draw' は、模様を制御するために糸を引く動作を指し、'loom' は織機を意味する。","priority":"★★★"},"pronunciation":{"ipa":"/ˈdrɔːˌluːm/","syllables":"draw-loom"},"inflection":{"noun_plural":"draw-looms"},"usage_notes":{"explanation":"'Draw-loom' は、複雑な模様の織物を織るための特殊な織機を指す。歴史的には、この織機はドローボーイと呼ばれる助手を必要としたが、現代ではジャカード機構などの自動化されたシステムが使用されることが多い。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a draw-loom to weave a plain fabric.","correct":"✓ I used a draw-loom to weave an intricate patterned fabric.","note":"Draw-looms are specifically for complex patterns, not plain fabrics."}],"priority":"★★☆"},"related_words":{"derivatives":["drawboy","Jacquard loom","loom","weaving"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'draw-loom' refers to a specialized weaving machine used to create intricate patterns in textiles. Understanding this term requires knowledge of textile manufacturing and historical weaving techniques. The concept involves an auxiliary mechanism, originally operated by a 'drawboy,' to control the warp threads and create complex designs. Therefore, familiarity with textile terminology is necessary to fully grasp the meaning of 'draw-loom'."},"example_sentences":[{"sentence":"The museum displayed a beautifully preserved draw-loom, showcasing its complex mechanism.","translation":"博物館には、その複雑な機構を示す、美しく保存された紋織機が展示されていた。","type":"noun","meaning_category":"織機"},{"sentence":"The skilled weaver used the draw-loom to create a tapestry with elaborate floral motifs.","translation":"熟練した織工は紋織機を使って、精巧な花のモチーフが描かれたタペストリーを作り上げた。","type":"noun","meaning_category":"織機"}]}