{"word":"variadic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(関数やメソッドが)可変個引数を取る","english_definition":"(of a function or method) able to accept a variable number of arguments.","examples":[{"sentence":"The printf function is a variadic function.","translation":"printf関数は可変個引数関数です。"},{"sentence":"This method is designed to be variadic.","translation":"このメソッドは可変個引数を取れるように設計されています。"}],"collocations":["variadic function","variadic method","variadic template"],"synonyms":["variable-arity"],"antonyms":["fixed-arity"]},{"part_of_speech":"noun","definition":"可変個引数関数、可変引数関数","english_definition":"A function or method that accepts a variable number of arguments.","examples":[{"sentence":"Variadic functions are common in C and C++.","translation":"可変個引数関数はCとC++でよく使われます。"}],"collocations":["use of variadic","implement variadic"],"synonyms":["variable-arity function"],"antonyms":["fixed-arity function"]}],"etymology":{"value":"Derived from 'variable' and '-adic', indicating a variable number of arguments.","priority":"★★★"},"pronunciation":{"ipa":"/ˌveəriˈædɪk/","syllables":"ve-a-ri-a-dic"},"inflection":{"notes":"Adjective and noun forms exist. The adjective doesn't inflect. The noun can be pluralized (variadics)."},"usage_notes":{"explanation":"The term 'variadic' is primarily used in computer science and programming contexts to describe functions or methods that can accept a varying number of arguments. This is a feature of some programming languages that allows for more flexible function design.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The function is variadic, so you must provide all arguments.","correct":"✓ The function is variadic, so you can provide a variable number of arguments.","note":"Variadic functions allow a variable number of arguments, not requiring all arguments to be provided."}],"priority":"★★☆"},"related_words":{"derivatives":["variadically"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'variadic' is a technical term primarily used in computer science and programming. It describes functions or methods that can accept a variable number of arguments. Understanding this term requires familiarity with programming concepts, particularly function design and argument passing."},"example_sentences":[{"sentence":"The sum function is variadic; it can accept any number of numerical arguments.","translation":"sum関数は可変個引数関数であり、任意の数の数値引数を受け取ることができます。","type":"adjective","meaning_category":"可変個引数を取る"},{"sentence":"Using variadic functions can simplify code when the number of inputs is not known in advance.","translation":"可変個引数関数を使用すると、入力の数が事前にわからない場合にコードを簡略化できます。","type":"noun","meaning_category":"可変個引数関数"}]}