{"word":"interlineation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"行間挿入、行間書き込み","english_definition":"The act of inserting something between lines of text; something inserted between lines of text.","examples":[{"sentence":"The contract contained several interlineations that made it difficult to understand.","translation":"その契約書には理解を困難にするいくつかの行間挿入があった。"},{"sentence":"The editor made interlineations to improve the clarity of the manuscript.","translation":"編集者は原稿の明瞭さを向上させるために行間書き込みを行った。"}],"collocations":["make an interlineation","add an interlineation","correct with interlineation"],"synonyms":["insertion","addition","annotation","correction"],"antonyms":["deletion","omission"]}],"etymology":{"value":"From Latin 'interlineare', from 'inter-' (between) + 'linea' (line).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərˌlɪniˈeɪʃən/","syllables":"in-ter-li-ne-a-tion"},"inflection":{"noun_plural":"interlineations"},"usage_notes":{"explanation":"'Interlineation' refers to the process of adding text or corrections between the lines of an existing document. It can also refer to the added text itself. This is often done to clarify, correct, or expand upon the original text.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He made an interpolation in the text.","correct":"✓ He made an interlineation in the text.","note":"'Interpolation' refers to inserting something into something else, often in a way that alters or affects the original. 'Interlineation' specifically refers to inserting text between lines."}],"priority":"★★☆"},"related_words":{"derivatives":["interlinear (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'interlineation' is a formal term referring to the act of inserting text between the lines of a document, often for corrections or additions. It is typically used in legal, academic, or editorial contexts. Understanding this term helps in comprehending discussions about document editing and textual analysis."},"example_sentences":[{"sentence":"The judge reviewed the document, noting several significant interlineations.","translation":"裁判官は文書を精査し、いくつかの重要な行間挿入に注目した。","type":"noun","meaning_category":"行間挿入"},{"sentence":"The student made interlineations in his notes to add extra details.","translation":"学生は追加の詳細を書き込むためにノートに行間書き込みを行った。","type":"noun","meaning_category":"行間書き込み"}]}