{"word":"hemidomatic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(言語学) 半ば家畜化された、または半ば野生化した言語要素を特徴とする","english_definition":"(linguistics) Characterized by linguistic elements that are only partly domesticated or only partly wild.","examples":[{"sentence":"The lexicon of creole languages often contains hemidomatic words derived from both the superstrate and substrate languages.","translation":"クレオール言語の語彙は、多くの場合、上層言語と下層言語の両方から派生した半家畜化された単語を含んでいます。"}],"collocations":[],"synonyms":["semi-domesticated","partly-wild"],"antonyms":["fully domesticated","fully wild"]}],"etymology":{"value":"Derived from the combination of 'hemi-' (meaning 'half' or 'partly') and 'domatic' (related to 'domesticated' or 'tamed'). The term suggests a state between wild and domesticated.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛmɪdoʊˈmætɪk/","syllables":"he-mi-do-mat-ic"},"inflection":{},"usage_notes":{"explanation":"The term 'hemidomatic' is primarily used in linguistic contexts to describe words or linguistic features that have undergone partial adaptation or borrowing between languages, or that exist in a state of flux between formal and informal usage. It is not a commonly used word outside of specialized linguistic discussions.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["hemidomestication (noun)"],"related_terms":["domesticated","wild","creole language","linguistics","borrowing (linguistics)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Hemidomatic' is a specialized term used in linguistics to describe elements of language that are neither fully domesticated (integrated and standardized) nor fully wild (unmodified and independent). It is typically encountered in academic discussions of language evolution, creolization, or language contact phenomena. Understanding of this term requires a background in linguistics.","priority":"★★☆"},"example_sentences":[{"sentence":"The presence of hemidomatic vocabulary in the new dialect indicates a complex process of linguistic adaptation.","translation":"その新しい方言における半家畜化された語彙の存在は、複雑な言語的適応のプロセスを示しています。","type":"general","meaning_category":"General Linguistic Description"}]}