{"word":"fustilarian","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"取るに足らない人、くだらない人、無価値な人","english_definition":"a pompous or bombastic person; one of little worth or importance.","examples":[{"sentence":"He dismissed the critic as a mere fustilarian.","translation":"彼はその批評家を単なる取るに足らない人物として無視した。"},{"sentence":"The fustilarian's speech was full of empty rhetoric.","translation":"そのくだらない人物の演説は、空虚な美辞麗句に満ちていた。"}],"collocations":["mere fustilarian","pompous fustilarian"],"synonyms":["nonentity","windbag","braggart","empty boaster","worthless fellow"],"antonyms":["person of importance","respected individual","valued member"],"notes":"This word is somewhat archaic and rarely used in modern English."}],"etymology":{"value":"From Latin 'fustis' (club, cudgel) + '-arian' (suffix denoting a person associated with something). The term originally referred to a low-ranking soldier or a person deserving of a beating with a club.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfʌstɪˈlɛəriən/","syllables":"fus-til-air-i-an"},"inflection":{"noun_plural":"fustilarians"},"usage_notes":{"explanation":"'Fustilarian' is a rather obscure and somewhat humorous term for someone considered unimportant, pretentious, or generally worthless. It carries a strong sense of disdain and is often used to dismiss someone's opinions or actions as insignificant. Due to its rarity, using it correctly can add a touch of erudite mockery to one's speech or writing.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a fustilarian example of honesty.","correct":"✓ He was not a fustilarian; he was a paragon of honesty.","note":"'Fustilarian' is a derogatory term, so it cannot be used to describe someone who is virtuous or admirable."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["fusty (musty, stale, old-fashioned)","fustian (pompous or bombastic language)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Fustilarian' is a highly uncommon word, indicating a person of little worth or importance, often with an added connotation of being pompous or pretentious. Due to its rarity, understanding and using this word correctly requires a strong command of English vocabulary and an appreciation for archaic or literary language."},"example_sentences":[{"sentence":"The professor dismissed the student's poorly researched argument as the work of a fustilarian.","translation":"教授はその学生のずさんな調査に基づいた主張を、取るに足らない人物の仕事として退けた。","type":"noun","meaning_category":"取るに足らない人"},{"sentence":"Don't pay any attention to him; he's just a fustilarian trying to sound important.","translation":"彼に注意を払うな。彼はただ重要そうに聞こえようとしているくだらない人物だ。","type":"noun","meaning_category":"くだらない人"}]}