{"word":"online-addicted","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"インターネット中毒の、オンライン中毒の","english_definition":"Habitually and compulsively engaging in online activities to an excessive degree; exhibiting symptoms of internet addiction.","examples":[{"sentence":"My brother is online-addicted; he spends almost all his free time gaming.","translation":"私の弟はネット中毒で、ほとんどの自由時間をゲームに費やしています。"},{"sentence":"The therapist specializes in treating online-addicted teenagers.","translation":"そのセラピストは、ネット中毒のティーンエイジャーの治療を専門としています。"},{"sentence":"She realized she was becoming online-addicted when her grades started to drop.","translation":"彼女は成績が下がり始めたとき、自分がネット中毒になりつつあることに気づきました。"}],"collocations":["become online-addicted (ネット中毒になる)","treat online-addicted patients (ネット中毒の患者を治療する)","online-addicted teenager (ネット中毒のティーンエイジャー)","online-addicted gamer (ネット中毒のゲーマー)"],"synonyms":["internet-addicted","cyber-addicted","digitally-addicted"],"antonyms":["offline","disconnected","unplugged","tech-free"]},{"part_of_speech":"noun","definition":"インターネット中毒者、オンライン中毒者","english_definition":"A person who is habitually and compulsively engaging in online activities to an excessive degree.","examples":[{"sentence":"Online-addicted individuals often neglect their real-life responsibilities.","translation":"ネット中毒者は、現実の生活での責任をしばしば無視します。"},{"sentence":"Support groups can help online-addicted people manage their addiction.","translation":"支援グループは、ネット中毒者が中毒を管理するのに役立ちます。"},{"sentence":"The study focused on the behavior of online-addicted students.","translation":"その研究は、ネット中毒の学生の行動に焦点を当てました。"}],"collocations":["recovering online-addicted (回復中のネット中毒者)","former online-addicted (かつてのネット中毒者)"],"synonyms":["internet addict","cyber addict","digital addict"],"antonyms":["non-addict"]}],"etymology":{"value":"The word is a compound formed by combining \"online\" (referring to being connected to the internet) with \"addicted\" (meaning compulsively dependent on something).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɒnˌlaɪn əˈdɪktɪd/","syllables":"on-line ad-dict-ed"},"inflection":{"notes":"The word can function as both an adjective and a noun. As an adjective, it describes someone or something related to internet addiction. As a noun, it refers to a person suffering from internet addiction."},"usage_notes":{"explanation":"\"Online-addicted\" is a relatively modern term used to describe individuals who excessively use the internet, often to the detriment of their real-life responsibilities and relationships. It is often used in discussions about mental health and the impact of technology on society. The term can carry a negative connotation, implying that the person has a problem with self-control and needs help managing their online behavior.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is online addicted.","correct":"✓ He is online-addicted.","note":"The hyphen is important to correctly form the compound adjective. Alternatively, you can say \"He is addicted to online activities.\""},{"incorrect":"✗ She is a online-addicted.","correct":"✓ She is an online-addicted person. / ✓ She is online-addicted.","note":"When used as a noun, it typically requires a noun like 'person' after it, or it can be used as an adjective describing the person. Alternatively, use 'She is an internet addict.'"}],"priority":"★★☆"},"related_words":{"derivatives":["online addiction (ネット中毒)","online addict (ネット中毒者)"],"phrases":["internet addiction disorder (インターネット依存症)","digital detox (デジタルデトックス)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing with the prevalence of internet use.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Online-addicted' describes someone who spends too much time on the internet, often neglecting other important things in their life. It's a compound word that combines 'online' (connected to the internet) and 'addicted' (unable to stop doing something). It's used in discussions about the negative effects of excessive internet use.","priority":"★★★"},"example_sentences":[{"sentence":"The study examined the effects of social media on online-addicted youth.","translation":"その研究は、ソーシャルメディアがネット中毒の若者に与える影響を調査した。","type":"adjective","meaning_category":"インターネット中毒の"},{"sentence":"Many online-addicted individuals seek therapy to overcome their compulsive behavior.","translation":"多くのネット中毒者は、強迫的な行動を克服するためにセラピーを求めます。","type":"noun","meaning_category":"インターネット中毒者"},{"sentence":"Excessive gaming can lead to becoming online-addicted.","translation":"過度のゲームは、ネット中毒になる可能性があります。","type":"adjective","meaning_category":"インターネット中毒の"}]}