{"word":"papule","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"丘疹（きゅうしん）、小さな隆起性発疹","english_definition":"A small, raised, solid pimple or swelling, typically inflamed but not producing pus.","examples":[{"sentence":"The doctor identified the skin condition as characterized by numerous papules.","translation":"医師は、その皮膚の状態を多数の丘疹を特徴とするものと診断した。"},{"sentence":"The rash consisted of small, red papules.","translation":"発疹は小さくて赤い丘疹で構成されていた。"},{"sentence":"Papules are a common symptom of various skin diseases.","translation":"丘疹は様々な皮膚疾患の一般的な症状である。"}],"collocations":["skin papule","inflammatory papule","small papule","red papule"],"synonyms":["pimple","bump","wheal","macule (if flat)"],"antonyms":["pustule (contains pus)","vesicle (contains fluid)","nodule (larger than a papule)"]}],"etymology":{"value":"From Latin 'papula' meaning 'pimple'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpæpjuːl/","syllables":"pap-ule"},"inflection":{"noun_plural":"papules"},"usage_notes":{"explanation":"A papule is a small, raised skin lesion that does not contain pus. It is a descriptive term, not a specific diagnosis. Papules can be caused by a variety of conditions, including acne, eczema, and viral infections.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The papule was filled with pus.","correct":"The pustule was filled with pus.","note":"Papules do not contain pus; pustules do."},{"incorrect":"The papule was larger than 1 cm.","correct":"The nodule was larger than 1 cm.","note":"Papules are typically smaller than 1 cm; larger lesions are usually called nodules."}],"priority":"★★☆"},"related_words":{"derivatives":["papular (adjective: relating to or characterized by papules)","papulopustular (adjective: having both papules and pustules)"],"phrases":["papular rash","inflammatory papule"],"priority":"★★★"},"level_frequency":{"level":null,"frequency_google_ngram":"Relatively low frequency, primarily used in medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Papule' is a medical term referring to a small, raised bump on the skin that doesn't contain pus. It's important to distinguish it from other skin lesions like pustules (which contain pus) and nodules (which are larger). This term is primarily used in dermatology and medical contexts. Understanding this term can help in describing skin conditions accurately.","priority":"★★★"},"example_sentences":[{"sentence":"The dermatologist examined the patient's skin, noting several small, red papules.","translation":"皮膚科医は患者の皮膚を診察し、いくつかの小さくて赤い丘疹に注目した。","type":"noun","meaning_category":"medical"},{"sentence":"The rash was characterized by numerous papules and some scaling.","translation":"発疹は多数の丘疹といくらかの鱗屑（りんせつ）を特徴としていた。","type":"noun","meaning_category":"symptom"},{"sentence":"The doctor prescribed a topical cream to treat the inflammatory papules.","translation":"医師は炎症性の丘疹を治療するために局所用クリームを処方した。","type":"noun","meaning_category":"treatment"}]}