{"word":"pseudepigraphy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"偽名文書、偽書 (特に、聖書や古代の文献において、実際には著者でない人物の名前を冠した文書)","english_definition":"the false ascription of a work to an author; specifically, the practice of writing under a false name, especially in ancient or biblical texts.","examples":[{"sentence":"Scholars have identified several instances of pseudepigraphy in the Old Testament.","translation":"学者たちは旧約聖書の中にいくつかの偽名文書の例を確認している。"},{"sentence":"The text is considered pseudepigraphical because it was likely not written by the person it is attributed to.","translation":"その文書は、それが帰属されている人物によって書かれた可能性が低いことから、偽書とみなされている。"}],"collocations":["pseudepigraphical work","pseudepigraphical text","instances of pseudepigraphy","apocalyptic pseudepigraphy"],"synonyms":["false ascription","spurious authorship","anonymous work (related, but not always)"],"antonyms":["genuine authorship","authentic work","canonical text (often contrasted)"]},{"part_of_speech":"noun","definition":"偽名文書の集合、偽書文献","english_definition":"a body of writings falsely ascribed to a particular author or period.","examples":[{"sentence":"The pseudepigraphy of the intertestamental period provides valuable insights into Jewish thought.","translation":"中間期時代の偽書文献は、ユダヤ人の思想に関する貴重な洞察を提供する。"}],"collocations":["study of pseudepigraphy","corpus of pseudepigraphy"],"synonyms":["apocrypha (sometimes overlaps)"],"antonyms":[]}],"etymology":{"value":"Derived from Greek: ψευδής (pseudḗs) meaning 'false' + ἐπιγραφή (epigraphḗ) meaning 'inscription' or 'title'.","priority":"★★★"},"pronunciation":{"ipa":"ˌsjuːdəˈpɪɡrəfi","syllables":"pseu-de-pig-ra-phy"},"inflection":{"noun_plural":"pseudepigraphies"},"usage_notes":{"explanation":"Pseudepigraphy is primarily used in academic and theological contexts when discussing ancient texts. It refers to the practice of attributing a work to a well-known figure, often to lend it authority or influence. It is important to note that the term does not necessarily imply forgery or malicious intent, as the practice may have been acceptable or even conventional in certain historical periods.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a pseudepigraphy about Jesus.","correct":"✓ He wrote a pseudepigraphical work about Jesus.","note":"'Pseudepigraphy' is the noun, referring to the practice or the body of works. 'Pseudepigraphical' is the adjective, describing the work itself."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudepigraphical (adjective)"],"phrasal_verbs":[],"related_terms":["apocrypha","canon","hermeneutics","textual criticism"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized academic vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pseudepigraphy' is a specialized term used in academic fields such as religious studies, history, and literature. It refers to the practice of attributing a text to an author who did not actually write it. This was a common practice in ancient times, and understanding it is important for interpreting historical and religious texts. The word itself is derived from Greek roots, reflecting its academic usage.","priority":"★★☆"},"example_sentences":[{"sentence":"The Book of Enoch is a well-known example of Jewish pseudepigraphy.","translation":"エノク書は、ユダヤ教の偽書文献の有名な例である。","type":"noun","meaning_category":"偽名文書"},{"sentence":"Scholars debate the extent to which pseudepigraphy was used in early Christian writings.","translation":"学者たちは、初期キリスト教の著作において偽名文書がどの程度使用されたかについて議論している。","type":"noun","meaning_category":"偽名文書"},{"sentence":"The pseudepigraphical nature of the text raises questions about its authenticity.","translation":"その文書が偽書であるという性質は、その信憑性についての疑問を投げかける。","type":"adjective (using the related adjective 'pseudepigraphical')","meaning_category":"偽名文書の性質"}]}