{"word":"world-overcoming","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"世界を克服する、世界を凌駕する、世界征服の","english_definition":"Surpassing, conquering, or transcending the world or worldly limitations.","examples":[{"sentence":"The hero possessed a world-overcoming spirit, never giving up in the face of adversity.","translation":"その英雄は、逆境に直面しても決して諦めない、世界を克服する精神を持っていた。"},{"sentence":"The artist's work had a world-overcoming quality, inspiring viewers to look beyond their immediate circumstances.","translation":"その芸術家の作品は、世界を凌駕するような質を持ち、鑑賞者に目の前の状況を超えて考えるように促した。"},{"sentence":"The dictator's ambition was world-overcoming, leading to widespread conflict and suffering.","translation":"その独裁者の野望は世界征服であり、広範囲にわたる紛争と苦しみをもたらした。"}],"collocations":["world-overcoming spirit","world-overcoming power","world-overcoming ambition","world-overcoming love","world-overcoming technology"],"synonyms":["transcendent","conquering","victorious","supreme","dominant","all-powerful"],"antonyms":["mundane","worldly","limited","defeated","submissive"]}],"etymology":{"value":"A compound adjective formed by combining 'world' (referring to the earth or the realm of human experience) with 'overcoming' (the act of defeating or surpassing). The hyphenated form indicates a close association between the two elements, suggesting a quality or action that directly impacts or transcends the world.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːrld oʊvərˌkʌmɪŋ/","syllables":"world-o-ver-com-ing"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms (like pluralization)."},"usage_notes":{"explanation":"'World-overcoming' is a relatively uncommon adjective, often used in literary or philosophical contexts to describe something that surpasses ordinary limitations or has a transformative impact on the world. It can suggest both positive (e.g., spiritual transcendence, artistic inspiration) and negative (e.g., destructive ambition, tyrannical power) connotations, depending on the context. The term implies a significant degree of power, influence, or transcendence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The world overcoming hero saved the day.","correct":"✓ The world-overcoming hero saved the day.","note":"The hyphen is important to indicate that 'world' and 'overcoming' function together as a single adjective modifying 'hero'."},{"incorrect":"✗ His ambition was to become world overcoming.","correct":"✓ His ambition was to become world-overcoming.","note":"The hyphenated form is necessary when using the phrase as a compound adjective before a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["overcome (verb)","world (noun)"],"phrases":["conquer the world","transcend the world","dominate the world","rule the world"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'world-overcoming' is a complex adjective that implies surpassing, conquering, or transcending the limitations of the world. It's often used in philosophical or literary contexts to describe something that has a transformative impact or possesses extraordinary power. Due to its abstract nature and infrequent usage, it's more suitable for advanced learners. Understanding the individual components ('world' and 'overcoming') helps to grasp the overall meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"Her world-overcoming love inspired countless others to pursue their dreams.","translation":"彼女の世界を凌駕する愛は、数えきれないほど多くの人々に夢を追い求めるように促した。","type":"adjective","meaning_category":"Transcendence/Inspiration"},{"sentence":"The scientist's world-overcoming discovery revolutionized the field of medicine.","translation":"その科学者の世界を覆す発見は、医学の分野に革命をもたらした。","type":"adjective","meaning_category":"Revolutionary Impact"},{"sentence":"The tyrant's world-overcoming ambition led to widespread destruction and suffering.","translation":"その暴君の世界征服の野望は、広範囲にわたる破壊と苦しみをもたらした。","type":"adjective","meaning_category":"Destructive Ambition"}]}