{"word":"ommatidial","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"個眼の、個眼からなる","english_definition":"Relating to or consisting of ommatidia.","examples":[{"sentence":"The compound eye is composed of many ommatidial units.","translation":"複眼は多数の個眼単位から構成されている。"},{"sentence":"The ommatidial structure of the insect eye allows for a wide field of view.","translation":"昆虫の眼の個眼構造は、広い視野を可能にする。"}],"collocations":["ommatidial array","ommatidial structure","ommatidial organization"],"synonyms":["faceted","lenticular"],"antonyms":[]}],"etymology":{"value":"Derived from 'ommatidium' (from Greek 'ommat-' meaning 'eye' + '-idion' diminutive suffix) + '-al' (adjectival suffix).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɒmətɪˈdaɪəl/","syllables":"om-ma-ti-di-al"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Ommatidial' is a technical term primarily used in the context of zoology, specifically when describing the compound eyes of arthropods (insects, crustaceans, etc.). It refers to the individual units (ommatidia) that make up the compound eye. The term is not commonly used outside of scientific or technical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The human eye has an ommatidial structure.","correct":"✓ The insect eye has an ommatidial structure.","note":"Ommatidia are found in compound eyes, which are characteristic of arthropods, not vertebrate eyes like human eyes."}],"priority":"★★☆"},"related_words":{"derivatives":["ommatidium (noun): a single visual unit in a compound eye"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'ommatidial' is a highly specialized term related to the structure of compound eyes found in arthropods. Understanding this word requires knowledge of biology, specifically the anatomy of insect eyes. It is not a word commonly encountered in general English; its usage is limited to scientific or technical discussions about zoology and related fields."},"example_sentences":[{"sentence":"The resolution of the compound eye depends on the number of ommatidial units.","translation":"複眼の解像度は、個眼単位の数に依存する。","type":"scientific","meaning_category":"structure"},{"sentence":"Each ommatidial lens focuses light onto photoreceptor cells.","translation":"各個眼レンズは、光を光受容体細胞に集束させる。","type":"scientific","meaning_category":"function"}]}