{"word":"pomaceous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"リンゴのような果実の、またはそれに関する","english_definition":"Of or relating to pomes (fruits such as apples and pears).","examples":[{"sentence":"Pomaceous fruits are often used in pies and jams.","translation":"リンゴのような果実は、パイやジャムによく使われます。"},{"sentence":"The orchard was filled with pomaceous trees.","translation":"果樹園はリンゴのような果実の木でいっぱいでした。"}],"collocations":["pomaceous fruit","pomaceous tree","pomaceous orchard"],"synonyms":["fruitful","apple-like","pear-like"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from late Latin pomaceus, from Latin pomum ‘fruit, especially apple’.","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈmeɪʃəs/","syllables":"po-ma-ceous"},"inflection":{"notes":"Does not inflect."},"usage_notes":{"explanation":"The term \"pomaceous\" is primarily used in botanical or agricultural contexts to describe fruits that are technically classified as pomes. A pome is a type of fruit produced by flowering plants in the subtribe Malinae of the family Rosaceae. It has a core of several small seeds, surrounded by a fleshy edible part.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pomaceous vegetable was delicious in the salad.","correct":"✓ The fruit was delicious in the salad.","note":"Pomaceous refers to fruits, not vegetables."}],"priority":"★★☆"},"related_words":{"derivatives":["pome (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pomaceous\" is a specialized term used in botany and agriculture to describe fruits that are pomes, such as apples and pears. It is not commonly used in everyday language. Understanding and use of this word indicates a high level of vocabulary and familiarity with scientific or technical terminology."},"example_sentences":[{"sentence":"The pomaceous aroma filled the air during the apple harvest.","translation":"リンゴのような香りがリンゴの収穫期に空気を満たしました。","type":"adjective","meaning_category":"リンゴのような果実の、またはそれに関する"}]}