{"word":"Microencapsulation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"マイクロカプセル化、微小カプセル化","english_definition":"A process in which solid particles or liquid droplets are surrounded or coated with a continuous film of polymeric material.","examples":[{"sentence":"Microencapsulation is used in the pharmaceutical industry to control the release of drugs.","translation":"マイクロカプセル化は、医薬品業界で薬物の放出を制御するために使用されます。"},{"sentence":"The flavor of the chewing gum is preserved through microencapsulation.","translation":"チューインガムの風味は、マイクロカプセル化によって保持されます。"},{"sentence":"Microencapsulation techniques are applied in various fields, including food, cosmetics, and agriculture.","translation":"マイクロカプセル化技術は、食品、化粧品、農業など、さまざまな分野で応用されています。"}],"collocations":["controlled release microencapsulation","spray drying microencapsulation","complex coacervation microencapsulation","microencapsulation technology","microencapsulation process"],"synonyms":["encapsulation","coating","packaging","containment"],"antonyms":["release","exposure","uncoating"]}],"etymology":{"value":"The term is derived from 'micro' (small), 'encapsulation' (the process of enclosing something in a capsule).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪkroʊɪnkæpsjuˈleɪʃən/","syllables":"mi-cro-en-cap-su-la-tion"},"inflection":{"noun_plural":"Microencapsulations"},"usage_notes":{"explanation":"Microencapsulation is a technique used to package materials within small capsules, typically ranging from 1 to 1000 micrometers in size. This process protects the core material from external environmental factors such as moisture, oxidation, or light, and allows for controlled release of the encapsulated substance. It is widely used in various industries, including pharmaceuticals, food, cosmetics, agriculture, and textiles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Microcapsulation is a process...","correct":"✓ Microencapsulation is a process...","note":"The correct spelling is 'microencapsulation', not 'microcapsulation'."},{"incorrect":"✗ The microencapsulation are used...","correct":"✓ The microencapsulation is used...","note":"'Microencapsulation' is a singular noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["microcapsule","encapsulate","encapsulated"],"phrasal_verbs":[],"related_terms":["nanocapsule","liposome","microsphere"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'microencapsulation' refers to a technical process used to enclose substances within tiny capsules. Understanding it requires some familiarity with scientific and industrial applications. The word itself is complex, reflecting the complexity of the process it describes. It's commonly found in scientific literature, technical reports, and specialized articles related to fields like pharmaceuticals, food science, and materials engineering."},"example_sentences":[{"sentence":"The **microencapsulation** of probiotics helps them survive the acidic environment of the stomach.","translation":"プロバイオティクスのマイクロカプセル化は、胃の酸性環境での生存を助けます。","type":"general"},{"sentence":"**Microencapsulation** techniques are used to create time-release medications.","translation":"マイクロカプセル化技術は、時間放出型医薬品を作成するために使用されます。","type":"pharmaceutical"},{"sentence":"The **microencapsulation** process protects the core material from degradation.","translation":"マイクロカプセル化プロセスは、コア材料の劣化から保護します。","type":"technical"},{"sentence":"In agriculture, **microencapsulation** can improve the delivery of pesticides.","translation":"農業では、マイクロカプセル化は農薬の送達を改善できます。","type":"agricultural"},{"sentence":"The use of **microencapsulation** in cosmetics allows for the controlled release of fragrances.","translation":"化粧品でのマイクロカプセル化の使用により、香料の制御された放出が可能になります。","type":"cosmetics"}]}