{"word":"small-batch","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"少量生産の、手作りの、小規模な","english_definition":"produced in small quantities; often implying higher quality, handcrafted, or artisanal methods.","examples":[{"sentence":"This is a small-batch bourbon, carefully distilled and aged.","translation":"これは少量生産のバーボンで、丁寧に蒸留され熟成されています。"},{"sentence":"We specialize in small-batch ice cream made with local ingredients.","translation":"私たちは地元の食材を使った少量生産のアイスクリームを専門としています。"},{"sentence":"The brewery is known for its small-batch craft beers.","translation":"その醸造所は少量生産のクラフトビールで知られています。"}],"collocations":["small-batch bourbon","small-batch ice cream","small-batch coffee","small-batch production","small-batch brewing","small-batch distillery"],"synonyms":["artisanal","handcrafted","limited edition","micro-produced","boutique"],"antonyms":["mass-produced","large-scale","industrial","factory-made"]},{"part_of_speech":"noun","definition":"少量生産品","english_definition":"a product produced in small quantities, often implying higher quality, handcrafted, or artisanal methods.","examples":[{"sentence":"The store only carries small-batches from local producers.","translation":"その店は地元の生産者の少量生産品のみを取り扱っています."},{"sentence":"These small-batches are highly sought after by collectors.","translation":"これらの少量生産品はコレクターに非常に人気があります."}],"collocations":["limited small-batches","exclusive small-batches"],"synonyms":["artisanal product","handcrafted item","limited edition product"],"antonyms":["mass-produced item","factory product"]}],"etymology":{"value":"Combination of \"small\" and \"batch,\" indicating production in limited quantities. The term emphasizes a focus on quality and craftsmanship over mass production.","priority":"★★★"},"pronunciation":{"ipa":"/smɔːl bæʧ/","syllables":"small-batch"},"inflection":{"notes":"Generally used as an adjective. Can be used as a noun to refer to the product itself, but this is less common."},"usage_notes":{"explanation":"\"Small-batch\" typically implies a focus on quality, unique flavors, or artisanal methods. It's often used in the context of food and beverage production (e.g., coffee, beer, spirits), but can also apply to other goods where limited production and craftsmanship are valued. The term suggests a contrast to mass-produced items.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company has a small batch of cars.","correct":"✓ The company produces a small batch of cars. / ✓ The company has a small production run of cars.","note":"\"Small-batch\" is usually associated with artisanal or handcrafted goods, not mass-produced items like cars. Using \"small production run\" would be more appropriate in this context."},{"incorrect":"✗ This is a small batch product.","correct":"✓ This is a small-batch product.","note":"The hyphen is important when using \"small-batch\" as a compound adjective before a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["batch (名詞: 一回分の量、一団)","small-scale (形容詞: 小規模な)","craft (名詞: 工芸、技術)","artisanal (形容詞: 職人技の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent, especially in contexts related to food, beverages, and artisanal goods.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"small-batch\" is used to describe products made in limited quantities, often by hand or with a focus on quality and unique characteristics. It's commonly used in the context of food and beverage production, such as coffee, beer, or spirits, to indicate a higher level of craftsmanship and attention to detail compared to mass-produced items. Understanding the term requires some familiarity with artisanal production methods and consumer preferences for unique, high-quality goods."},"example_sentences":[{"sentence":"The distillery is known for its award-winning, small-batch whiskeys.","translation":"その蒸留所は、受賞歴のある少量生産のウイスキーで知られています。","type":"adjective","meaning_category":"少量生産の"},{"sentence":"We source our beans from small-batch coffee roasters around the world.","translation":"私たちは世界中の少量生産のコーヒー焙煎業者から豆を調達しています。","type":"adjective","meaning_category":"少量生産の"},{"sentence":"The market featured a variety of small-batch cheeses and artisanal breads.","translation":"その市場には、様々な少量生産のチーズや職人技のパンが並んでいました。","type":"adjective","meaning_category":"少量生産の"},{"sentence":"These are limited small-batches, so get them while they last.","translation":"これらは限定された少量生産品なので、お早めにお求めください。","type":"noun","meaning_category":"少量生産品"}]}