{"word":"twistedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"ねじれて、よじれて","english_definition":"In a twisted manner; in a distorted or contorted way.","examples":[{"sentence":"The metal was bent twistedly after the accident.","translation":"事故後、金属はねじれて曲がっていた。"},{"sentence":"The branches grew twistedly towards the sunlight.","translation":"枝は太陽光に向かってねじれながら伸びた。"}],"collocations":["bent twistedly","grew twistedly"],"synonyms":["contortedly","distortedly","crookedly","askew","awry"],"antonyms":["straightly","directly"]},{"part_of_speech":"adverb","definition":"ひねくれて、ゆがんで、悪意をもって","english_definition":"In a morally or mentally distorted way; perversely.","examples":[{"sentence":"He smiled twistedly, revealing his evil intentions.","translation":"彼は悪意のある意図を露わにして、ひねくれた笑みを浮かべた。"},{"sentence":"The story was told twistedly to make him look bad.","translation":"彼が悪く見えるように、その話はゆがめて語られた。"}],"collocations":["smiled twistedly","told twistedly"],"synonyms":["perversely","cynically","maliciously","deviously","dishonestly"],"antonyms":["honestly","sincerely","genuinely"]}],"etymology":{"value":"Derived from the adjective 'twisted' by adding the suffix '-ly'. 'Twisted' comes from the verb 'twist', which has origins in Old English.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtwɪstɪdlɪ/","syllables":"twist-ed-ly"},"inflection":{"notes":"Adverb, so it does not inflect for number or gender."},"usage_notes":{"explanation":"'Twistedly' describes actions or states that are either physically twisted or, more often, morally or mentally distorted. It can refer to the physical appearance of something or the manner in which something is done or said. The context usually makes it clear whether the physical or figurative sense is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He looked at her twistedly beautiful.","correct":"✓ He looked at her with a twisted smile.","note":"'Twistedly' modifies verbs or adverbs, not adjectives. To describe something as both twisted and beautiful, use a phrase like 'twistedly beautiful' as a compound adjective or rephrase the sentence."},{"incorrect":"✗ She spoke twistedly about the event.","correct":"✓ She spoke in a twisted way about the event. / ✓ She twisted the story about the event.","note":"While 'twistedly' is a valid adverb, sometimes rephrasing with 'in a twisted way' or using the verb 'twist' provides more clarity or sounds more natural."}],"priority":"★★☆"},"related_words":{"derivatives":["twisted (adjective)","twist (verb, noun)"],"phrases":["in a twisted way","with a twisted smile"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Twistedly' is an adverb that describes something done in a twisted or distorted manner. It can refer to a physical twisting, but it more often describes something done in a morally or mentally distorted way. Because it's not a common word and has a nuanced meaning, it's more likely to be encountered in advanced texts or conversations."},"example_sentences":[{"sentence":"The sculpture was formed twistedly from scrap metal.","translation":"その彫刻はスクラップ金属からねじれて作られていた。","type":"adverb","meaning_category":"ねじれて"},{"sentence":"He presented the facts twistedly to support his argument.","translation":"彼は自分の主張を支持するために、事実をゆがめて提示した。","type":"adverb","meaning_category":"ひねくれて"}]}