{"word":"Bohemian-tartar","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A person of mixed Bohemian (Czech) and Tatar ancestry.","english_definition":"A person who has both Bohemian (Czech) and Tatar heritage.","examples":[{"sentence":"My great-grandmother was a Bohemian-tartar, which explains my love for both dumplings and strong tea.","translation":"私の曾祖母はボヘミアン・タタールだったので、それが私のダンプリングと濃いお茶への愛を説明する。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"Relating to or characteristic of people of mixed Bohemian (Czech) and Tatar ancestry.","english_definition":"Relating to or characteristic of individuals with mixed Bohemian (Czech) and Tatar heritage.","examples":[{"sentence":"The restaurant featured Bohemian-tartar cuisine, a unique blend of Central European and Asian flavors.","translation":"そのレストランは、ボヘミアン・タタール料理を特色としており、中央ヨーロッパとアジアの風味のユニークな融合を提供していた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Combination of \"Bohemian\" (referring to Bohemia, now part of the Czech Republic) and \"Tartar\" (referring to the Tatar people, a Turkic ethnic group).","priority":"Medium"},"pronunciation":{"ipa":"/boʊˈhiːmiən ˈtɑːrtər/","syllables":"Bo-he-mi-an-Tar-tar"},"inflection":{"noun_plural":"Bohemian-tartars"},"usage_notes":{"explanation":"This term is highly specific and not commonly used. It describes a person or something related to a person with mixed Bohemian (Czech) and Tatar ancestry. Its usage is primarily descriptive and may be found in genealogical or historical contexts.","priority":"Low"},"common_mistakes":{"examples":[],"priority":"Low"},"related_words":{"derivatives":["Bohemian","Tartar"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"This term is very specific and uncommon, likely encountered only in specialized contexts such as genealogy or historical discussions about ethnic mixes in Central and Eastern Europe. Understanding requires knowledge of both Bohemian and Tatar cultures and histories."},"example_sentences":[{"sentence":"The historian specialized in the study of Bohemian-tartar communities in the 18th century.","translation":"その歴史家は、18世紀のボヘミアン・タタール人コミュニティの研究を専門としていた。","type":"noun","meaning_category":"Person of mixed ancestry"},{"sentence":"The festival celebrated the unique Bohemian-tartar cultural heritage of the region.","translation":"その祭りは、その地域のユニークなボヘミアン・タタール文化遺産を祝った。","type":"adjective","meaning_category":"Relating to mixed ancestry"}]}