{"word":"animalising","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"動物化する、動物のように扱う、動物の特徴を付与する","english_definition":"To represent or treat someone or something as an animal or with animal characteristics.","examples":[{"sentence":"The artist was accused of animalising women in his paintings.","translation":"その芸術家は、絵の中で女性を動物化していると非難された。"},{"sentence":"The novel explores the theme of animalising human instincts.","translation":"その小説は、人間の本能を動物化するというテーマを探求している。"},{"sentence":"Some critics argue that the media is animalising refugees by portraying them as a threat.","translation":"一部の批評家は、メディアが難民を脅威として描写することで動物化していると主張している。"}],"collocations":["animalising someone (誰かを動物化する)","animalising a concept (概念を動物化する)","animalising instincts (本能を動物化する)"],"synonyms":["bestializing","dehumanizing","brutalizing","objectifying"],"antonyms":["humanizing","personifying"],"notes":"Often used in critical contexts to describe the act of reducing a person or concept to a base, animalistic level."}],"etymology":{"value":"Derived from the verb 'animalise' (or 'animalize' in American English), which comes from 'animal' + '-ise' (or '-ize').","priority":"★★★"},"pronunciation":{"ipa":"/ˈænɪməlaɪzɪŋ/","syllables":"an-i-mal-is-ing"},"inflection":{"verb_forms":{"present_simple":["animalises"],"past_simple":"animalised","past_participle":"animalised","present_participle":"animalising"}},"usage_notes":{"explanation":"'Animalising' is often used in discussions of art, literature, and social commentary to describe the act of portraying humans or abstract concepts in terms of animals, often with negative connotations. It suggests a reduction to basic instincts or a loss of humanity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The process of animalising the data was difficult.","correct":"✓ The process of analyzing the data was difficult.","note":"'Animalising' is rarely used in a neutral or positive sense. Consider whether 'analyzing' or another more appropriate word is intended."}],"priority":"★★☆"},"related_words":{"derivatives":["animal (名詞: 動物)","animalistic (形容詞: 動物的な)","animalism (名詞: 動物主義)","animalize (動詞: 動物化する)","animalization (名詞: 動物化)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Animalising' is a relatively uncommon word used to describe the act of portraying something as an animal or with animal-like characteristics. It often carries a negative connotation, suggesting a reduction to base instincts or a loss of humanity. This word is more likely to be encountered in academic or critical writing.","priority":"★★☆"},"example_sentences":[{"sentence":"By depicting the characters as wolves, the author is animalising their predatory nature.","translation":"登場人物を狼として描くことで、作者は彼らの捕食的な性質を動物化している。","type":"verb","meaning_category":"動物化する"},{"sentence":"The politician was accused of animalising immigrants during his speech.","translation":"その政治家は演説中に移民を動物化していると非難された。","type":"verb","meaning_category":"動物化する"},{"sentence":"The artist's animalising of the urban landscape created a sense of chaos and decay.","translation":"芸術家による都市景観の動物化は、混沌と荒廃の感覚を生み出した。","type":"verb","meaning_category":"動物化する"}]}