{"word":"compendiate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"要約する、簡潔にする、凝縮する","english_definition":"to express or present in a concise or summary form; to abridge or condense.","examples":[{"sentence":"The author compendiated the lengthy report into a brief summary.","translation":"著者は長大な報告書を簡潔な要約にまとめた。"},{"sentence":"He compendiated his findings into a single paragraph.","translation":"彼は自分の発見を一つの段落に凝縮した。"}],"collocations":["compendiate a report (報告書を要約する)","compendiate information (情報を凝縮する)","compendiate findings (調査結果を要約する)"],"synonyms":["summarize","abridge","condense","abstract","recapitulate","digest"],"antonyms":["expand","elaborate","extend","amplify"]}],"etymology":{"value":"Late Latin *compendiatus*, past participle of *compendiare* 'to shorten, abridge', from Latin *compendium* 'saving, gain, profit; abbreviation, short cut', from *com-* 'together' + *pendere* 'to weigh'.","priority":"★★☆"},"pronunciation":{"ipa":"/kəmˈpɛndiˌeɪt/","syllables":"com-pen-di-ate"},"inflection":{"verb_forms":{"present_simple":["compendiate","compendiates"],"past_simple":"compendiated","past_participle":"compendiated","present_participle":"compendiating"}},"usage_notes":{"explanation":"'Compendiate' is a relatively rare and formal verb that means to summarize or condense information. It is often used in academic or professional contexts when referring to the process of shortening a longer piece of writing or presentation. It implies a careful and deliberate effort to retain the most important information while eliminating unnecessary details.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He compendiated the story with many details.","correct":"✓ He compendiated the story, removing many details.","note":"'Compendiate' means to shorten or condense, not to add details."},{"incorrect":"✗ The compendiated version was longer than the original.","correct":"✓ The compendiated version was shorter than the original.","note":"A compendiated version should always be shorter than the original."}],"priority":"★☆☆"},"related_words":{"derivatives":["compendium (名詞: 要約、概要、概論)","compendious (形容詞: 簡潔な、要約的な)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'compendiate' is a formal and uncommon verb that means to summarize or condense something, typically a lengthy piece of writing or information. It suggests a deliberate effort to make something shorter while retaining its essential elements. Due to its formality and infrequent use, it is generally encountered in academic or professional contexts rather than everyday conversation."},"example_sentences":[{"sentence":"The research team compendiated their extensive data into a concise report for the stakeholders.","translation":"研究チームは、利害関係者のために、広範なデータを簡潔な報告書に要約した。","type":"verb","meaning_category":"要約する"},{"sentence":"She was tasked with compendiating the complex legal document into a more accessible summary for the public.","translation":"彼女は、複雑な法的文書を一般の人々がより理解しやすいように、要約する任務を与えられた。","type":"verb","meaning_category":"簡潔にする"},{"sentence":"The professor compendiated the key concepts of the course into a single lecture.","translation":"教授は、コースの主要な概念を1回の講義に凝縮した。","type":"verb","meaning_category":"凝縮する"}]}