{"word":"stylography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"筆跡研究、文体研究","english_definition":"The study of writing styles, especially to determine authorship or authenticity of a document.","examples":[{"sentence":"Stylography can be used to identify the author of an anonymous text.","translation":"筆跡研究は、匿名のテキストの著者を特定するために使用できます。"},{"sentence":"Forensic stylography is often employed in legal cases involving disputed documents.","translation":"法廷筆跡研究は、係争中の文書が関与する訴訟事件でよく用いられます。"}],"collocations":["forensic stylography","literary stylography"],"synonyms":["calligraphy analysis","graphology","style analysis"],"antonyms":[]}],"etymology":{"value":"From 'stylo-' (referring to style or writing) + '-graphy' (referring to a descriptive science).","priority":"★★☆"},"pronunciation":{"ipa":"/staɪˈlɒɡrəfi/","syllables":"sty-log-ra-phy"},"inflection":{"noun_plural":"stylographies"},"usage_notes":{"explanation":"Stylography is a specialized field that analyzes the characteristics of writing style, including vocabulary, syntax, and other linguistic features, to draw conclusions about the author or the authenticity of a text. It is often used in forensic science and literary studies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a stylography expert.","correct":"✓ He is a stylographer.","note":"The correct term for a person who studies stylography is 'stylographer'."}],"priority":"★★☆"},"related_words":{"derivatives":["stylographer (noun): A person who studies or analyzes writing styles.","stylographic (adjective): Relating to stylography or writing styles."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Stylography is a specialized term related to the analysis of writing styles. It is used in forensic science and literary studies to identify authors or authenticate documents based on their unique writing characteristics. The term is not commonly used in everyday conversation and is more likely to be encountered in academic or professional contexts. A related term is 'stylographer,' which refers to a person who studies or analyzes writing styles."},"example_sentences":[{"sentence":"The expert used stylography to compare the writing styles of the two suspects.","translation":"専門家は筆跡研究を用いて、2人の容疑者の文体を比較しました。","type":"noun","meaning_category":"筆跡研究"},{"sentence":"Stylography can help determine if a document is a forgery.","translation":"筆跡研究は、文書が偽造であるかどうかを判断するのに役立ちます。","type":"noun","meaning_category":"筆跡研究"},{"sentence":"The stylography analysis revealed subtle differences in the author's writing over time.","translation":"筆跡研究分析により、時間の経過とともに著者の文章に微妙な違いがあることが明らかになりました。","type":"noun","meaning_category":"筆跡研究"}]}