{"word":"Heavenese","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(言語学) 天上の言語、神の言語、または高度に洗練された言語を指す比喩的な表現。","english_definition":"(linguistics) A metaphorical term referring to a celestial language, the language of the gods, or a highly refined language.","examples":[{"sentence":"The professor's lecture was so filled with jargon it was practically Heavenese to the undergraduates.","translation":"教授の講義は専門用語で埋め尽くされており、学部生にとってはほとんど天国の言葉だった。"},{"sentence":"Some scholars consider classical Sanskrit to be a kind of Heavenese due to its complexity and sacred associations.","translation":"一部の学者は、古典サンスクリット語を、その複雑さと神聖な関連性から、ある種の天上の言語と見なしている。"}],"collocations":["speak Heavenese (天上の言語を話す)","understand Heavenese (天上の言語を理解する)","translate Heavenese (天上の言語を翻訳する)"],"synonyms":["high language","refined language","divine language","celestial language"],"antonyms":["common tongue","vernacular","low language"]}],"etymology":{"value":"'Heaven' (天国) + '-ese' (言語を示す接尾辞) からの造語。","priority":"★★☆"},"pronunciation":{"ipa":"ˌhɛvənˈiːz","syllables":"Hea-ven-ese"},"inflection":{"noun_plural":"Heaveneses"},"usage_notes":{"explanation":"'Heavenese' は、文字通りに天国で話されている言語を指すのではなく、比喩的な表現として使われます。高度に専門的、複雑、または洗練された言語を指し、理解が難しい、または特別な知識が必要な言語を指すことが多いです。皮肉を込めて、またはユーモラスに用いられることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke Heavenese fluently because he was an angel.","correct":"✓ He spoke Heavenese fluently because he was a highly trained linguist.","note":"'Heavenese' は実際の言語ではなく、高度な言語能力や専門知識を比喩的に表現するために使用されます。"},{"incorrect":"✗ I need a Heavenese dictionary to understand this textbook.","correct":"✓ I need a specialized dictionary to understand this textbook.","note":"'Heavenese' は特定の言語を指すのではなく、専門用語や難解な表現が多い状態を指します。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Heavenese' は、比喩的な意味合いが強く、日常会話ではほとんど使われません。文学、学術的な文脈、または専門的な議論において、非常に高度で理解が難しい言語や表現を指す際に用いられます。この単語を理解するためには、比喩表現を解釈する能力と、文脈から意味を推測する高度な読解力が必要です。"},"example_sentences":[{"sentence":"The legal document was written in such convoluted language that it seemed like pure Heavenese to the average person.","translation":"その法律文書は非常に複雑な言葉で書かれていたため、一般の人にはまるで天国の言葉のように思えた。","type":"noun","meaning_category":"比喩的な表現"},{"sentence":"Trying to decipher the medical report felt like attempting to translate Heavenese without any prior training.","translation":"その医療報告書を解読しようとすることは、事前の訓練なしに天上の言語を翻訳しようとするようなものだった。","type":"noun","meaning_category":"比喩的な表現"}]}