{"word":"unio","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(生物学) イシガイ属","english_definition":"(biology) A genus of freshwater mussels in the family Unionidae.","examples":[{"sentence":"The Unio pictorum is a common species of freshwater mussel.","translation":"Unio pictorumは一般的な淡水イシガイの一種です。"}],"collocations":["Unio pictorum","Unio tumidus"],"synonyms":["freshwater mussel"],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史) 真珠","english_definition":"(historical) A pearl, especially a large or fine one.","examples":[{"sentence":"The queen wore a unio of great size and beauty.","translation":"女王は大きく美しい真珠を身に着けていた。"}],"collocations":["large unio","fine unio"],"synonyms":["pearl"],"antonyms":[]}],"etymology":{"value":"From Latin unio, meaning 'union, unity, oneness; a single large pearl'. The biological sense derives from the two shells being joined together. The pearl sense refers to a single, unique gem.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjuːni.oʊ/","syllables":"U-ni-o"},"inflection":{"noun_plural":"uniones or unios"},"usage_notes":{"explanation":"The word \"unio\" has two main meanings: a biological term referring to freshwater mussels of the genus Unio, and a historical term for a large or fine pearl. The biological meaning is more common in scientific contexts, while the pearl meaning is more often found in historical or literary texts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a unio in the sea.","correct":"✓ I saw a unio in the river.","note":"Unio are freshwater mussels, so they are found in rivers, not the sea."}],"priority":"★☆☆"},"related_words":{"derivatives":["unionid (noun): a mussel of the family Unionidae","Unionidae (noun): the family of freshwater mussels that includes the genus Unio"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unio\" is a relatively uncommon word with two distinct meanings. In a biological context, it refers to a specific genus of freshwater mussels. In a historical or literary context, it refers to a large or fine pearl. Due to its specialized usage and relatively low frequency, it is more likely to be encountered by advanced learners or those with specific interests in biology or history."},"example_sentences":[{"sentence":"The biologist identified the mussel as a member of the genus **Unio**.","translation":"生物学者はその貝をイシガイ属の一種であると特定した。","type":"noun","meaning_category":"生物学"},{"sentence":"The necklace featured a magnificent **unio** as its centerpiece.","translation":"そのネックレスは、中央に壮大な真珠をあしらっていた。","type":"noun","meaning_category":"歴史"}]}