{"word":"Draconism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代アテナイの)ドラコン法、ドラコン主義、厳罰主義","english_definition":"The code of laws introduced by Draco in ancient Athens; extreme severity or cruelty.","examples":[{"sentence":"The severity of Draconism was later softened by Solon's reforms.","translation":"ドラコン法の厳しさは、後にソロンの改革によって緩和された。"},{"sentence":"Some critics argue that the government's policies are leaning towards Draconism.","translation":"政府の政策は厳罰主義に傾倒していると批判する人もいる。"}],"collocations":["Draconian laws (ドラコン的な法律、厳罰的な法律)","Draconian measures (ドラコン的な措置、厳罰的な措置)"],"synonyms":["severity","harshness","cruelty","strictness","rigor"],"antonyms":["leniency","mercy","mildness","forbearance"]}],"etymology":{"value":"Derived from Draco, the name of the Athenian lawgiver who codified the laws of Athens in the 7th century BC. His laws were known for their extreme harshness.","priority":"★★★"},"pronunciation":{"ipa":"/dreɪˈkoʊnɪzəm/","syllables":"dra-co-nism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Draconism\" refers both to the specific legal code of Draco in ancient Athens and, more generally, to any system of laws or rules characterized by extreme severity. It is often used to criticize policies perceived as excessively harsh or punitive.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The draconism law was passed yesterday.","correct":"✓ The Draconian law was passed yesterday.","note":"Use the adjective \"Draconian\" to describe a law. \"Draconism\" is the system or philosophy itself."}],"priority":"★★☆"},"related_words":{"derivatives":["Draco (人名: ドラコン)","Draconian (形容詞: ドラコンの、厳罰的な)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Draconism' is a relatively uncommon word referring to the harsh legal code of Draco in ancient Athens. It is used in historical or political contexts to describe extremely strict or severe laws and punishments. Understanding the historical origin and the connotation of extreme severity is key to interpreting this word correctly."},"example_sentences":[{"sentence":"The **Draconism** of the old regime was replaced by a more humane legal system.","translation":"旧体制の厳罰主義は、より人道的な法制度に取って代わられた。","type":"noun","meaning_category":"厳罰主義"},{"sentence":"Critics denounced the new regulations as a return to **Draconism**.","translation":"批評家たちは、新しい規制を厳罰主義への回帰だと非難した。","type":"noun","meaning_category":"厳罰主義"}]}