{"word":"Plyscore","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A numerical rating system used in the sport of ultimate frisbee to evaluate a player's overall performance, considering factors such as throwing ability, catching ability, defensive skills, and game knowledge.","english_definition":"A numerical rating system used in the sport of ultimate frisbee to evaluate a player's overall performance, considering factors such as throwing ability, catching ability, defensive skills, and game knowledge.","examples":[{"sentence":"The coach used Plyscore to assess each player's strengths and weaknesses.","translation":"コーチは各選手の長所と短所を評価するためにPlyscoreを使用した。"},{"sentence":"Her Plyscore improved significantly after focusing on her throwing accuracy.","translation":"彼女のPlyscoreは、投球精度に焦点を当てた後、大幅に向上した。"}],"collocations":["calculate Plyscore","improve Plyscore","high Plyscore","low Plyscore"],"synonyms":["rating","score","performance metric"],"antonyms":[]}],"etymology":{"value":"Likely a portmanteau of 'play' and 'score', reflecting its purpose of scoring a player's overall play.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈplaɪˌskɔːr/","syllables":"Ply-score"},"inflection":{"noun_plural":"Plyscores"},"usage_notes":{"explanation":"Plyscore is a relatively new and specific term within the ultimate frisbee community. It's not universally adopted, and the specific formula for calculating it can vary. It's used as a tool for player evaluation and development.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a high plyscore in basketball.","correct":"✓ He has a high Plyscore in ultimate frisbee.","note":"Plyscore is specific to ultimate frisbee, not other sports."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very specific vocabulary)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Plyscore is a specialized term used within the sport of ultimate frisbee to quantify a player's overall performance. Understanding its meaning requires familiarity with ultimate frisbee and its performance metrics. The concept involves combining various aspects of a player's skills into a single numerical rating. It is not a commonly used term outside of this specific context."},"example_sentences":[{"sentence":"The team captain analyzed the Plyscores to determine the optimal lineup.","translation":"チームキャプテンは最適なラインナップを決定するためにPlyscoreを分析した。","type":"noun","meaning_category":"rating system"},{"sentence":"Improving your defensive Plyscore requires consistent effort and practice.","translation":"防御のPlyscoreを向上させるには、一貫した努力と練習が必要だ。","type":"noun","meaning_category":"rating system"}]}