{"word":"Bonifaces","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) ボニファティウス (人名、特に聖ボニファティウス)","english_definition":"plural of Boniface (a male given name, especially referring to Saint Boniface)","examples":[{"sentence":"The Bonifaces were known for their missionary work.","translation":"ボニファティウスたちは、その伝道活動で知られていた。"},{"sentence":"Several men named Boniface have been canonized as saints; these are the Bonifaces referred to in the church's history.","translation":"ボニファティウスという名の男性の何人かは聖人として列聖されており、これらが教会の歴史で言及されるボニファティウスたちである。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the given name Boniface, derived from Latin 'bonus' (good) and 'fatum' (fate).","priority":"★★★"},"pronunciation":{"ipa":"/ˈbɒnɪfeɪsɪz/","syllables":"Bon-i-fac-es"},"inflection":{"noun_plural":"Bonifaces"},"usage_notes":{"explanation":"'Bonifaces' is primarily used as the plural form of the proper noun 'Boniface,' referring to multiple individuals with that name. It commonly refers to Saint Boniface, an 8th-century English Benedictine monk and missionary who is known as the 'Apostle to the Germans.'","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Boniface (singular form)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Bonifaces' is the plural form of the proper noun 'Boniface,' typically referring to multiple individuals named Boniface, often in a historical or religious context. It is not a commonly used word outside of specific historical or religious discussions."},"example_sentences":[{"sentence":"The book detailed the lives of several early saints, including the Bonifaces.","translation":"その本は、ボニファティウスたちを含む、初期の聖人たちの生涯を詳しく記述していた。","type":"noun","meaning_category":"人名（複数）"},{"sentence":"The historical records mention the Bonifaces as key figures in the spread of Christianity in the region.","translation":"歴史的記録は、ボニファティウスたちを、その地域におけるキリスト教の普及における重要な人物として言及している。","type":"noun","meaning_category":"人名（複数）"}]}