{"word":"Svarabhakti","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(言語学) スヴァラバクティ、母音挿入：子音連結を解消するために、単語の中間に挿入される母音。","english_definition":"(linguistics) Svarabhakti, also known as anaptyxis or epenthesis, is the insertion of a vowel between consonants within a word to break up a consonant cluster.","examples":[{"sentence":"The word 'film' might be pronounced as 'filum' with svarabhakti.","translation":"「film」という単語は、スヴァラバクティによって「filum」と発音されることがある。"}],"collocations":["anaptyxis","epenthesis","vowel insertion","breaking consonant clusters"],"synonyms":["anaptyxis","epenthesis"],"antonyms":[]}],"etymology":{"value":"From Sanskrit 'svara' (sound, vowel) and 'bhakti' (division, separation), referring to the 'division' or 'separation' of sounds by inserting a vowel.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌswɑːrəˈbʌkti/","syllables":"Sva-ra-bhak-ti"},"inflection":{"notes":"単数形、複数形ともに Svarabhakti"},"usage_notes":{"explanation":"Svarabhakti is a linguistic term primarily used in phonetics and phonology to describe the phenomenon of vowel insertion. It is often observed in languages where consonant clusters are disfavored. The inserted vowel typically reduces the complexity of pronunciation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Svarabhakti is the deletion of a vowel.","correct":"✓ Svarabhakti is the insertion of a vowel.","note":"Svarabhakti involves adding a vowel, not removing one."}],"priority":"★★☆"},"related_words":{"derivatives":["anaptyptic (adjective)","epenthetic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Svarabhakti' is a highly specialized term used in linguistics, specifically in the areas of phonetics and phonology. Understanding this term requires a solid foundation in linguistic concepts. It refers to the insertion of a vowel to break up consonant clusters, a phenomenon that can be observed in various languages. Due to its technical nature, it is typically encountered in advanced linguistic studies."},"example_sentences":[{"sentence":"The occurrence of svarabhakti can vary depending on the dialect.","translation":"スヴァラバクティの発生は方言によって異なることがある。","type":"general","meaning_category":"general"},{"sentence":"Linguistic analysis revealed instances of svarabhakti in the pronunciation of certain words.","translation":"言語分析により、特定の単語の発音にスヴァラバクティの例が明らかになった。","type":"technical","meaning_category":"technical"}]}