{"word":"eugenically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"優生学的に、優生学の原理に基づいて","english_definition":"in a manner that relates to or promotes eugenics; according to the principles of eugenics.","examples":[{"sentence":"The population was eugenically selected to eliminate undesirable traits.","translation":"望ましくない特性を排除するために、その集団は優生学的に選抜された。"},{"sentence":"Some historical policies were eugenically motivated, aiming to improve the genetic quality of the population.","translation":"一部の歴史的な政策は、人口の遺伝的質を改善することを目的とした優生学的な動機に基づいていた。"}],"collocations":["eugenically bred","eugenically selected","eugenically motivated"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The word \"eugenically\" is derived from \"eugenic,\" which comes from the Greek word \"eugenes,\" meaning \"well-born\" or \"of good stock.\" The suffix \"-ally\" transforms the adjective \"eugenic\" into the adverb \"eugenically.\"","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈdʒɛnɪk(ə)li/","syllables":"eu-gen-i-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"The term \"eugenically\" is strongly associated with the controversial and often unethical practice of eugenics. Eugenics is the pseudoscientific belief and practice of improving the genetic quality of a human population. It has historically been used to justify discriminatory and coercive policies, such as forced sterilization and segregation. Therefore, the word \"eugenically\" carries significant negative connotations and should be used with caution and awareness of its historical context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The flowers were eugenically arranged.","correct":"✓ The flowers were artistically arranged.","note":"\"Eugenically\" refers specifically to eugenics, the (often unethical) practice of improving genetic qualities. It should not be used to describe general improvements or arrangements. Use a different adverb that fits the context, such as \"artistically,\" \"carefully,\" or \"systematically.\""}],"priority":"★★☆"},"related_words":{"derivatives":["eugenic (adjective)","eugenics (noun)"],"phrasal_verbs":[],"related_concepts":["genetics","heredity","selective breeding","social Darwinism","racial hygiene"]},"level_frequency":{"CEFR":"C2 (rare and specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"eugenically\" is a highly specialized term directly related to the concept of eugenics. Eugenics is a complex and controversial field involving the (often unethical) attempt to improve the genetic quality of a population. Therefore, understanding and using \"eugenically\" requires a strong grasp of this specific historical and scientific context. It is not a word commonly encountered in everyday language."},"example_sentences":[{"sentence":"Historically, some societies attempted to manage populations eugenically, with devastating consequences.","translation":"歴史的に、一部の社会は優生学的に人口を管理しようと試み、壊滅的な結果をもたらした。","type":"adverb","meaning_category":"優生学的に"},{"sentence":"The study examined the impact of eugenically-motivated policies on marginalized communities.","translation":"その研究は、優生学的な動機に基づいた政策が疎外されたコミュニティに与える影響を調査した。","type":"adverb","meaning_category":"優生学の原理に基づいて"}]}