{"word":"Shakespeareans","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"シェイクスピア研究者、シェイクスピア劇団員、シェイクスピアの作風を模倣する人","english_definition":"People who study Shakespeare, actors in Shakespeare's plays, or those who imitate Shakespeare's style.","examples":[{"sentence":"The conference was attended by many Shakespeareans from around the world.","translation":"会議には世界中から多くのシェイクスピア研究者が参加した。"},{"sentence":"The Shakespeareans performed Hamlet to a packed house.","translation":"シェイクスピア劇団員たちは満員の観客の前でハムレットを上演した。"},{"sentence":"His writing style is often described as Shakespearean, though he is not one of the Shakespeareans.","translation":"彼の文体はシェイクスピア的だとよく言われるが、彼はシェイクスピア研究者ではない。"}],"collocations":["Shakespearean scholar","Shakespearean actor","Shakespearean production","Shakespearean sonnet"],"synonyms":["Bardolators","Shakespeare scholars","Shakespearean actors"],"antonyms":[]}],"etymology":{"value":"Derived from 'Shakespeare' (the playwright) + '-an' (suffix denoting association or belonging) + '-s' (plural marker).","priority":"★★☆"},"pronunciation":{"ipa":"/ʃeɪkˈspɪəriənz/","syllables":"shake-spear-i-ans"},"inflection":{"noun_plural":"Shakespeareans"},"usage_notes":{"explanation":"'Shakespeareans' typically refers to a group of people deeply involved with Shakespeare's works, either through study, performance, or imitation. It can refer to scholars, actors, or writers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Shakespearean, so he wrote many plays.","correct":"✓ He is a Shakespearean scholar, so he knows a lot about Shakespeare's plays.","note":"Being a 'Shakespearean' doesn't necessarily mean someone writes plays; it often means they study or perform them."}],"priority":"★★☆"},"related_words":{"derivatives":["Shakespeare","Shakespearean (adjective)","Shakespearean (noun singular)"],"phrases":["Shakespearean tragedy","Shakespearean comedy","Shakespearean sonnet"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in academic or theatrical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Shakespeareans' is primarily used in academic, literary, or theatrical contexts. It refers to individuals who are deeply involved with the works of William Shakespeare, either through scholarly study, acting in his plays, or writing in a style reminiscent of his. The term assumes a familiarity with Shakespeare and his works, making it more common among those with a strong interest in literature and theater."},"example_sentences":[{"sentence":"The annual conference of Shakespeareans drew scholars from across the globe.","translation":"シェイクスピア研究者の年次会議には世界中から学者が集まった。","type":"noun","meaning_category":"シェイクスピア研究者"},{"sentence":"The Shakespeareans rehearsed tirelessly for their upcoming performance of Macbeth.","translation":"シェイクスピア劇団員たちは、間近に迫ったマクベスの公演に向けて精力的にリハーサルを行った。","type":"noun","meaning_category":"シェイクスピア劇団員"},{"sentence":"Though not a Shakespearean himself, he admired the playwright's use of language.","translation":"彼自身はシェイクスピア研究者ではないが、劇作家の言葉遣いを高く評価していた。","type":"noun","meaning_category":"シェイクスピア研究者"}]}