{"word":"Lawyered","priority":"★☆☆","meanings":[{"part_of_speech":"interjection","definition":"(スラング) 論破された、言い負かされた、弁護士によって解決された","english_definition":"(slang) Used to indicate that someone has been thoroughly defeated in an argument, especially with legal or logical arguments; or that a situation has been resolved by a lawyer.","examples":[{"sentence":"He tried to argue with me, but I presented the facts and he was totally lawyered.","translation":"彼は私と議論しようとしたが、私が事実を提示したら、彼は完全に論破された。"},{"sentence":"When the company tried to deny her claim, she got a lawyer and they were lawyered pretty quickly.","translation":"会社が彼女の請求を拒否しようとしたとき、彼女は弁護士を雇い、会社はすぐに弁護士によって解決された。"}],"collocations":["get lawyered","totally lawyered","completely lawyered"],"synonyms":["owned","destroyed","rekt","pwned","defeated","demolished","schooled","outsmarted","outmaneuvered","checkmate"],"antonyms":["won","persuaded","convinced"]},{"part_of_speech":"verb","definition":"(スラング) 論破する、言い負かす、弁護士を使って解決する","english_definition":"(slang) To defeat someone in an argument, especially with legal or logical arguments; or to resolve a situation by using a lawyer.","examples":[{"sentence":"I lawyered him so hard in that debate, he didn't know what to say.","translation":"私はその討論で彼を徹底的に論破したので、彼は何も言えなかった。"},{"sentence":"We had to lawyer up to deal with their aggressive tactics.","translation":"彼らの攻撃的な戦術に対処するために、弁護士を立てる必要があった。"}],"collocations":["lawyer up","lawyer someone","lawyer someone into something","lawyer someone out of something"],"synonyms":["defeat","demolish","trounce","overcome","outargue","outwit","outreason","out-think"],"antonyms":["agree","concede","yield"]}],"etymology":{"value":"Derived from the word 'lawyer', with the suffix '-ed' added to create a past participle or adjectival form. It implies that the situation has been handled or resolved by a lawyer, or that someone has been defeated using legal or logical arguments, as a lawyer might do.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɔːjərd/","syllables":"law-yered"},"inflection":{"verb_forms":{"present_simple":["lawyer","lawyers"],"past_simple":"lawyered","past_participle":"lawyered","present_participle":"lawyering"}},"usage_notes":{"explanation":"'Lawyered' is a slang term, primarily used in informal contexts, often online or in casual conversation. It is used to express that someone has been thoroughly defeated in an argument, typically through the use of logic, facts, or legal knowledge. It can also mean that a situation has been resolved by a lawyer. It is often used humorously or sarcastically.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lawyered the contract.","correct":"✓ He had the contract lawyered. / ✓ He used a lawyer to review the contract.","note":"'Lawyered' is not typically used to describe directly modifying a legal document. It's more about the outcome of a legal situation or argument."},{"incorrect":"✗ She lawyered me with kindness.","correct":"✓ (This is not a standard usage) She overwhelmed me. / She was very kind to me.","note":"'Lawyered' generally implies a defeat through argument or legal means, not through kindness or other non-adversarial approaches."}],"priority":"★★☆"},"related_words":{"derivatives":["lawyer","lawyering"],"idioms_phrases":["lawyer up (hire a lawyer)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Slang)","frequency_google_ngram":"Low frequency (as a slang term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lawyered' is a slang term used to indicate that someone has been thoroughly defeated in an argument, especially through the use of logic, facts, or legal knowledge. It can also mean that a situation has been resolved by a lawyer. It is primarily used in informal contexts and often carries a humorous or sarcastic tone. Understanding its usage requires familiarity with internet slang and colloquial expressions."},"example_sentences":[{"sentence":"I presented the evidence, and he was completely **lawyered**.","translation":"証拠を提示したら、彼は完全に論破された。","type":"interjection","meaning_category":"論破された"},{"sentence":"They tried to sue us, but we **lawyered** them and won the case.","translation":"彼らは私たちを訴えようとしたが、私たちは弁護士を使って彼らを打ち負かし、訴訟に勝った。","type":"verb","meaning_category":"弁護士を使って解決する"},{"sentence":"After I showed him the contract, he knew he was **lawyered**.","translation":"契約書を見せたら、彼は自分が言い負かされたことを悟った。","type":"interjection","meaning_category":"論破された"},{"sentence":"We had to **lawyer up** to protect our interests.","translation":"私たちの利益を守るために、弁護士を立てる必要があった。","type":"verb (phrasal)","meaning_category":"弁護士を使って解決する"}]}