{"word":"nutrition-aware","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"栄養に配慮した、栄養を意識した","english_definition":"Having or showing an understanding of the importance of good nutrition; making choices based on nutritional value.","examples":[{"sentence":"The restaurant offers nutrition-aware menu options for health-conscious customers.","translation":"そのレストランは、健康を意識する顧客のために、栄養に配慮したメニューを提供しています。"},{"sentence":"She is a nutrition-aware athlete who carefully plans her meals.","translation":"彼女は、食事を注意深く計画する栄養を意識したアスリートです。"},{"sentence":"Nutrition-aware parents often read food labels before buying groceries.","translation":"栄養に配慮した親は、食料品を買う前に食品ラベルをよく読みます。"}],"collocations":["nutrition-aware diet (栄養に配慮した食事)","nutrition-aware cooking (栄養を意識した料理)","nutrition-aware choices (栄養を意識した選択)","become nutrition-aware (栄養を意識するようになる)"],"synonyms":["health-conscious","diet-conscious","nutrition-conscious","health-aware"],"antonyms":["nutrition-unaware","health-unconscious","diet-unconscious"]}],"etymology":{"value":"The word is a compound of 'nutrition' (the process of providing or obtaining the food necessary for health and growth) and 'aware' (having knowledge or perception of a situation or fact).","priority":"N/A"},"pronunciation":{"ipa":"/njuːˈtrɪʃən əˈweər/","syllables":"nu-tri-tion a-ware"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Nutrition-aware' describes someone or something that demonstrates knowledge and consideration of nutritional value. It implies a proactive approach to making healthy choices based on understanding nutritional principles. It is often used in the context of food, diet, and health.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very nutrition.","correct":"✓ He is very nutrition-aware.","note":"'Nutrition' is a noun. Use the adjective 'nutrition-aware' to describe someone who is mindful of nutrition."},{"incorrect":"✗ She made a nutrition aware decision.","correct":"✓ She made a nutrition-aware decision.","note":"'Nutrition-aware' is a compound adjective and should be hyphenated when used before a noun."}],"priority":"N/A"},"related_words":{"derivatives":["nutrition (noun)","nutritional (adjective)","awareness (noun)"],"phrasal_verbs":[],"related_adjectives":["health-aware","diet-aware","food-conscious"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing in use due to growing health consciousness.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Nutrition-aware' is a compound adjective used to describe someone or something that is knowledgeable and mindful of the importance of good nutrition. It implies a conscious effort to make choices based on nutritional value. The term is commonly used in contexts related to health, diet, and food choices. Understanding the individual components 'nutrition' and 'aware' helps in grasping the meaning of the compound word."},"example_sentences":[{"sentence":"The school implemented a nutrition-aware program to promote healthy eating habits among students.","translation":"その学校は、生徒たちの健康的な食習慣を促進するために、栄養に配慮したプログラムを実施しました。","type":"adjective","meaning_category":"栄養に配慮した"},{"sentence":"More consumers are becoming nutrition-aware and demanding healthier food options.","translation":"より多くの消費者が栄養を意識するようになり、より健康的な食品を求めるようになっています。","type":"adjective","meaning_category":"栄養を意識した"},{"sentence":"A nutrition-aware approach to cooking can help you create delicious and healthy meals.","translation":"栄養を意識した料理のアプローチは、美味しくて健康的な食事を作るのに役立ちます。","type":"adjective","meaning_category":"栄養を意識した"}]}