{"word":"non-athletes","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"運動選手ではない人々、スポーツを職業または熱心な趣味としていない人々","english_definition":"People who are not athletes; individuals who do not engage in sports professionally or as a dedicated hobby.","examples":[{"sentence":"The survey included both athletes and non-athletes to get a balanced perspective on health habits.","translation":"その調査には、健康習慣に関するバランスの取れた視点を得るために、運動選手と非運動選手の両方が含まれていました。"},{"sentence":"Non-athletes may not realize the level of commitment required to compete at a professional level.","translation":"非運動選手は、プロレベルで競争するために必要なコミットメントのレベルを理解していないかもしれません。"},{"sentence":"Many fitness programs are designed to cater to non-athletes looking to improve their overall health.","translation":"多くのフィットネスプログラムは、全体的な健康を改善したいと考えている非運動選手に対応するように設計されています。"}],"collocations":["casual exercisers","sedentary individuals","general population (in the context of fitness)"],"synonyms":["average people","general public (regarding sports participation)","non-sporting individuals"],"antonyms":["athletes","sportsmen","sportswomen","competitors"],"related_words":["sedentary","exercise","fitness","health","sports"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'athletes'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌnɒn ˈæθliːts/","syllables":"non-ath-letes"},"inflection":{"noun_plural":"non-athletes"},"usage_notes":{"explanation":"'Non-athletes' is a straightforward term used to describe people who do not participate in sports at a professional or highly dedicated amateur level. It's often used in studies or discussions comparing the health, fitness, or habits of athletes versus the general population.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ non athletes","correct":"✓ non-athletes","note":"Hyphenation is generally preferred for clarity, especially when 'non-' is attached to a longer word."}],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Used primarily in specific contexts such as research or discussions about sports and health.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The term 'non-athletes' is relatively straightforward. It simply refers to people who are not athletes. It's commonly used in contexts where a distinction needs to be made between individuals who actively participate in sports and those who do not. Understanding the term requires a basic knowledge of the prefix 'non-' and the word 'athletes'."},"example_sentences":[{"sentence":"The study compared the dietary habits of athletes and non-athletes.","translation":"その研究では、運動選手と非運動選手の食習慣が比較されました。","type":"general","meaning_category":"comparison"},{"sentence":"Many non-athletes find it challenging to maintain a regular exercise routine.","translation":"多くの非運動選手は、定期的な運動習慣を維持するのが難しいと感じています。","type":"general","meaning_category":"exercise"},{"sentence":"The marketing campaign targeted non-athletes to promote the benefits of joining a local gym.","translation":"そのマーケティングキャンペーンは、地元のジムに入会するメリットを宣伝するために、非運動選手をターゲットにしました。","type":"general","meaning_category":"marketing"}]}