{"word":"condonative","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"寛大な、容赦深い、大目に見る","english_definition":"tending to condone; forgiving; excusing.","examples":[{"sentence":"A condonative attitude towards minor offenses can sometimes lead to bigger problems.","translation":"小さな違反に対する寛大な態度は、時に大きな問題につながることがある。"},{"sentence":"The judge was not condonative of the defendant's behavior.","translation":"裁判官は被告の行動を容認しなかった。"},{"sentence":"A condonative society may struggle to enforce rules and regulations effectively.","translation":"寛容な社会は、規則や規制を効果的に施行するのに苦労するかもしれない。"}],"collocations":["condonative attitude","condonative behavior","condonative society"],"synonyms":["forgiving","lenient","tolerant","excusing","permissive","indulgent"],"antonyms":["strict","intolerant","punitive","condemnatory","critical"]}],"etymology":{"value":"condone + -ative","priority":"★★★"},"pronunciation":{"ipa":"/kənˈdoʊnətɪv/","syllables":"con-do-na-tive"},"inflection":{"notes":"Adjective, comparative and superlative forms are condonative, more condonative, most condonative."},"usage_notes":{"explanation":"'Condonative' describes a tendency or willingness to condone, excuse, or overlook wrongdoing. It suggests a forgiving or lenient approach, often in situations where criticism or punishment might be expected. The term is relatively formal and not as commonly used as its root word, 'condone'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The condonative person always lets people get away with everything.","correct":"✓ The condonative person is more likely to let small things slide.","note":"'Condonative' implies a tendency to excuse or overlook, but not necessarily to let people 'get away with everything.' It suggests a degree of leniency rather than complete permissiveness."},{"incorrect":"✗ His condonative actions were seen as weakness.","correct":"✓ His condonative actions were seen as leniency.","note":"Use 'condonative' to describe the nature of the action or attitude. The noun form that best fits is 'leniency'."}],"priority":"★★☆"},"related_words":{"derivatives":["condone (verb)","condonation (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Condonative' is a relatively advanced word that describes a tendency to forgive or excuse wrongdoing. It is not commonly used in everyday conversation but may appear in formal writing or discussions about ethics, law, or social behavior. Understanding the meaning of 'condone' is essential for grasping the meaning of 'condonative'."},"example_sentences":[{"sentence":"The teacher's condonative approach to tardiness resulted in many students arriving late to class.","translation":"先生の遅刻に対する寛大な態度は、多くの生徒が授業に遅れてくる結果となった。","type":"general"},{"sentence":"Some argue that a condonative attitude towards corruption can undermine public trust in government.","translation":"汚職に対する寛大な態度は、政府に対する国民の信頼を損なう可能性があると主張する人もいる。","type":"ethics"},{"sentence":"The company's condonative policy on personal phone use during work hours led to decreased productivity.","translation":"勤務時間中の私用電話の使用に対する会社の寛大な方針は、生産性の低下につながった。","type":"business"}]}