{"word":"unmaidenly","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"女性らしくない、淑女らしくない、未婚女性にふさわしくない","english_definition":"Not befitting a maiden; unbecoming a young, unmarried woman; not ladylike.","examples":[{"sentence":"Her unmaidenly behavior shocked the older generation.","translation":"彼女の女性らしくない振る舞いは、年配の世代に衝撃を与えた。"},{"sentence":"She was criticized for her unmaidenly outspokenness.","translation":"彼女は女性らしくない率直さで批判された。"},{"sentence":"Some considered her ambition to be unmaidenly.","translation":"彼女の野心は女性らしくないと考える人もいた。"}],"collocations":["unmaidenly conduct","unmaidenly behavior","unmaidenly ambition","unmaidenly outspokenness"],"synonyms":["unladylike","improper","indecorous","unbecoming","unseemly"],"antonyms":["maidenly","ladylike","proper","decorous","seemly"]}],"etymology":{"value":"\"un-\" (否定) + \"maidenly\" (乙女らしい)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈmeɪdn̩li/","syllables":"un-mai-den-ly"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"Unmaidenly\" is a somewhat archaic term used to describe behavior, characteristics, or actions that are considered inappropriate or unbecoming for a young, unmarried woman, according to traditional standards of femininity and propriety. It often implies a deviation from expected norms of modesty, demureness, and submissiveness. The term carries a judgmental tone and reflects outdated societal expectations of women.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He found her unmaidenly attractive.","correct":"✓ He found her unmaidenly behavior unattractive.","note":"\"Unmaidenly\" describes behavior or characteristics, not physical attractiveness directly. You could say her unmaidenly confidence was attractive, but not just \"unmaidenly attractive\"."},{"incorrect":"✗ The knight was unmaidenly.","correct":"✓ The knight was brave.","note":"\"Unmaidenly\" is specifically used for women. For a male knight, use terms like \"unknightly\" if his behavior is unbecoming of a knight, or simply describe his positive traits (brave, courageous)."}],"priority":"★★☆"},"related_words":{"derivatives":["unmanly (男らしくない)","unwomanly (女らしくない)","maiden (乙女)","maidenhood (乙女時代)","maidenliness (乙女らしさ)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 古風な表現","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unmaidenly\" is a word used to describe actions or qualities that are not considered suitable for a young, unmarried woman, especially according to old-fashioned ideas about how women should behave. It suggests that someone is not acting in a modest, quiet, or obedient way, which were traditionally expected of young women. This word is not commonly used today and can sound judgmental or old-fashioned."},"example_sentences":[{"sentence":"Her unmaidenly laughter echoed through the quiet hall.","translation":"彼女の女性らしくない笑い声が静かなホールに響き渡った。","type":"adjective","meaning_category":"女性らしくない"},{"sentence":"The older women frowned at her unmaidenly display of confidence.","translation":"年配の女性たちは、彼女の女性らしくない自信の表れに眉をひそめた。","type":"adjective","meaning_category":"女性らしくない"},{"sentence":"She rejected the notion that her ambitions were unmaidenly.","translation":"彼女は自分の野心が女性らしくないという考えを拒否した。","type":"adjective","meaning_category":"女性らしくない"}]}