{"word":"cheapness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"安さ、安価、低価格","english_definition":"The state or quality of being low in price; inexpensiveness.","examples":[{"sentence":"The cheapness of the product made it attractive to budget shoppers.","translation":"その製品の安さが、予算重視の買い物客にとって魅力的なものにした。"},{"sentence":"We were surprised by the cheapness of the hotel, but it was clean and comfortable.","translation":"ホテルの安さに驚いたが、清潔で快適だった。"}],"collocations":["relative cheapness (相対的な安さ)","overall cheapness (全体的な安さ)","sheer cheapness (全くの安さ)"],"synonyms":["inexpensiveness","affordability","low price","bargain price"],"antonyms":["expensiveness","high price","costliness"]},{"part_of_speech":"noun","definition":"（品質・価値などの）低さ、粗悪さ、下品さ","english_definition":"Inferiority in quality; shoddiness; lack of elegance or refinement.","examples":[{"sentence":"The cheapness of the materials was obvious.","translation":"材料の粗悪さは明らかだった。"},{"sentence":"There was a certain cheapness to the decor.","translation":"その装飾にはある種の下品さがあった。"}],"collocations":["tasteless cheapness (趣味の悪い粗悪さ)","obvious cheapness (明らかな粗悪さ)"],"synonyms":["shoddiness","inferiority","poor quality","vulgarity","tackiness"],"antonyms":["quality","excellence","refinement","elegance"]}],"etymology":{"value":"Derived from the adjective 'cheap' and the suffix '-ness'. 'Cheap' originally meant 'market' or 'bargain', evolving to mean 'low in price' over time. The suffix '-ness' turns adjectives into nouns, indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃiːpnəs/","syllables":"cheap-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Cheapness' can refer to either the low price of something or its poor quality. Context is crucial to understanding which meaning is intended. When referring to price, it's often a neutral or positive attribute, especially when affordability is desired. When referring to quality, it's almost always negative.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The cheapness of the car made me suspicious about its safety.","correct":"The low price of the car made me suspicious about its safety.","note":"While 'cheapness' is technically correct, 'low price' is often a more natural and common way to express the idea of a low price. 'Cheapness' can sometimes imply poor quality, so 'low price' is clearer when that's not the intended meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["cheap (adjective)","cheaply (adverb)"],"phrases":["relatively cheapness (比較的安価)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Cheapness' is a noun that describes the quality of being inexpensive or of low quality. It is used in situations where you want to emphasize the state of something being cheap. The context will usually indicate whether you are referring to the low price or the poor quality. It is less common than the adjective 'cheap', but useful for expressing the abstract concept of being cheap.","priority":"★★☆"},"example_sentences":[{"sentence":"The store is known for the cheapness of its clothing.","translation":"その店は衣料品の安さで知られている。","type":"noun","meaning_category":"安さ"},{"sentence":"The cheapness of the construction was evident in the crumbling walls.","translation":"その建物の粗悪さは、崩れかけている壁に明らかだった。","type":"noun","meaning_category":"粗悪さ"},{"sentence":"The cheapness of labor in that country allows them to produce goods at a lower cost.","translation":"その国の労働力の安さにより、彼らはより低いコストで商品を生産することができる。","type":"noun","meaning_category":"安さ"},{"sentence":"Despite its cheapness, the toy was surprisingly durable.","translation":"そのおもちゃは安価にもかかわらず、驚くほど耐久性があった。","type":"noun","meaning_category":"安さ"}]}