{"word":"case-sensitive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"大文字と小文字を区別する","english_definition":"(of a computer system or program) recognizing the difference between upper- and lowercase letters.","examples":[{"sentence":"The password is case-sensitive, so be careful when typing it.","translation":"パスワードは大文字と小文字を区別するので、入力する際は注意してください。"},{"sentence":"The search function is not case-sensitive; it will find results regardless of capitalization.","translation":"検索機能は大文字と小文字を区別しません。大文字小文字に関わらず結果を見つけます。"},{"sentence":"Make sure your username is entered correctly, as it is case-sensitive.","translation":"ユーザー名は大文字と小文字を区別するため、正しく入力してください。"}],"collocations":["case-sensitive password (大文字と小文字を区別するパスワード)","case-sensitive search (大文字と小文字を区別する検索)","case-sensitive username (大文字と小文字を区別するユーザー名)"],"synonyms":["case-distinct","case-specific"],"antonyms":["case-insensitive"],"related_terms":["case-insensitive","uppercase","lowercase"],"notes":"This term is commonly used in computer science and programming contexts.","priority":"★★★"}],"etymology":{"value":"The term is a compound word combining 'case' (referring to uppercase or lowercase letters) and 'sensitive' (meaning responsive to or affected by). It describes a system's sensitivity to the case of letters.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkeɪs ˈsɛnsɪtɪv/","syllables":"case-sen-si-tive"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Case-sensitive' describes a system's ability to differentiate between uppercase (A, B, C) and lowercase (a, b, c) letters. If a system is case-sensitive, 'Password' and 'password' would be treated as two distinct values. This is common in passwords, usernames, and programming languages. The opposite of case-sensitive is 'case-insensitive'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The system is not case-sensitive, so you can type in any case.","correct":"The system is case-insensitive, so you can type in any case.","note":"'Case-sensitive' and 'case-insensitive' are often confused. Make sure to use the correct term to describe whether the system distinguishes between uppercase and lowercase letters."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["case-insensitive","uppercase","lowercase"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common in technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Case-sensitive' means that a computer system or program recognizes the difference between uppercase (A, B, C) and lowercase (a, b, c) letters. If something is case-sensitive, you need to type the letters exactly as they are required, or it won't work. This is often used when talking about passwords or usernames. The opposite is 'case-insensitive,' which means it doesn't matter if you use uppercase or lowercase letters."},"example_sentences":[{"sentence":"The programming language Python is case-sensitive.","translation":"プログラミング言語のPythonは大文字と小文字を区別します。","type":"example","meaning_category":"general"},{"sentence":"When creating an account, remember that the username field is case-sensitive.","translation":"アカウントを作成する際、ユーザー名欄は大文字と小文字を区別することを覚えておいてください。","type":"example","meaning_category":"accounts"},{"sentence":"The search query is case-sensitive, so 'Example' will not match 'example'.","translation":"検索クエリは大文字と小文字を区別するため、「Example」は「example」と一致しません。","type":"example","meaning_category":"search queries"}]}