{"word":"noncondensible","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"凝縮しない、凝縮不可能な","english_definition":"Not capable of being condensed; not able to be changed from a gas or vapor to a liquid.","examples":[{"sentence":"Noncondensible gases are often vented from industrial processes.","translation":"凝縮しないガスは、しばしば工業プロセスから排出されます。"},{"sentence":"The presence of noncondensible components can affect the efficiency of a heat exchanger.","translation":"凝縮しない成分の存在は、熱交換器の効率に影響を与える可能性があります。"}],"collocations":["noncondensible gas","noncondensible component","noncondensible fraction"],"synonyms":["incondensable"],"antonyms":["condensible"],"notes":"Often used in the context of chemistry, physics, and engineering."}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'condensible'. 'Condensible' comes from 'condense', which originates from Latin 'condensare' (to make dense).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnkənˈdɛnsɪbəl/","syllables":"non-con-den-si-ble"},"inflection":{},"usage_notes":{"explanation":"'Noncondensible' is a technical term primarily used in scientific and engineering fields. It describes substances, typically gases, that remain in a gaseous state under conditions where other substances would condense into a liquid. This property is crucial in various applications, such as refrigeration, distillation, and chemical processing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The air is noncondensible.","correct":"✓ Air contains noncondensible gases.","note":"Air itself is a mixture of gases, some of which are condensible (like water vapor) and some of which are noncondensible (like nitrogen and oxygen). Therefore, it's more accurate to say that air *contains* noncondensible gases."}],"priority":"★★☆"},"related_words":{"derivatives":["noncondensability (noun)"],"related_terms":["condense","condensation","condenser","condensible"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Noncondensible' is a specialized term used in science and engineering. It describes a substance, usually a gas, that cannot be turned into a liquid by increasing pressure or decreasing temperature under normal conditions. You'll typically encounter this word in textbooks, research papers, or technical manuals related to chemistry, physics, or engineering."},"example_sentences":[{"sentence":"The system is designed to remove noncondensible gases to maintain optimal performance.","translation":"そのシステムは、最適な性能を維持するために凝縮しないガスを除去するように設計されています。","type":"general","meaning_category":"general"},{"sentence":"The presence of noncondensible gases in the steam turbine can reduce its efficiency.","translation":"蒸気タービン内の凝縮しないガスの存在は、その効率を低下させる可能性があります。","type":"technical","meaning_category":"technical"}]}