{"word":"Boke","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(スラング/インターネット用語) ボケ：お笑いコンビなどで、主に面白いことを言う担当。または、とぼけた言動や、それをする人。","english_definition":"(Slang/Internet Term) Boke: In a comedy duo, the member who is mainly responsible for saying funny things. Alternatively, a dazed or absent-minded action or speech, or the person who does it.","examples":[{"sentence":"A: 昨日見た漫才、面白かったね！ B: うん、ボケの人が最高だった！","translation":"A: The stand-up comedy we saw yesterday was funny! B: Yeah, the boke was the best!","type":"example"},{"sentence":"彼はいつもボケをかますから、周りが笑ってしまう。","translation":"He always makes silly remarks, so everyone around him laughs.","type":"example"},{"sentence":"あの人のボケは、ちょっと天然で面白い。","translation":"That person's silliness is a bit natural and funny.","type":"example"}],"collocations":["ボケとツッコミ (boke and tsukkomi: the roles in a comedy duo)","ボケをかます (boke wo kamasu: to make a silly remark)","ボケ担当 (boke tantou: the person in charge of playing the boke role)","天然ボケ (tennen boke: a naturally silly person)"],"synonyms":["お笑い担当 (owarai tantou: comedy role)","いじられキャラ (ijirare kyara: a character who is teased)","おとぼけ (otoboke: silliness)","とぼけ (toboke: feigned ignorance)"],"antonyms":["ツッコミ (tsukkomi: the straight man in a comedy duo)"],"notes":"This term is specific to Japanese comedy culture. It refers to the comedian who provides the humorous or absurd statements, while the 'tsukkomi' provides the corrections or straight-man responses. It can also refer to someone who is naturally silly or absent-minded.","related_terms":["ツッコミ (tsukkomi: straight man in a comedy duo)","漫才 (manzai: Japanese stand-up comedy)","お笑い (owarai: comedy)"],"usage_examples":[]}],"etymology":{"value":"由来は動詞「惚ける(bokeru)」から派生。意味は「(年老いて)ぼんやりする、(意識が)はっきりしなくなる、間が抜ける、とぼける」など。","priority":"★★★"},"pronunciation":{"ipa":"/bo̞ke̞/","syllables":"bo-ke"},"inflection":{"notes":"Japanese nouns generally do not inflect for number or gender."},"usage_notes":{"explanation":"「ボケ」は、主にお笑いコンビにおける役割を指す言葉ですが、日常会話では、とぼけた言動をする人や、その言動自体を指すこともあります。特に、意図的ではなく、天然でとぼけた言動をする人を「天然ボケ」と呼びます。インターネットスラングとしても広く使われています。","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"比較的高頻度 (Relatively high frequency) - 特に若者やインターネットユーザーの間で。","priority":"★★☆"},"readability_explanation":{"level":"N/A","text":"「ボケ」は、お笑い用語で、面白いことを言う人、またはとぼけた言動のことです。漫才などでよく使われます。友達との会話で、誰かが面白いことを言ったり、ちょっと間抜けなことをしたときに、「ボケてるね！」と言うことがあります。"},"example_sentences":[]}