{"word":"Ijmaa","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"イスラム法学における合意。預言者ムハンマドの死後、ある特定の時代のイスラム法学者（ムジュタヒド）全員による、ある法的な問題に関する合意を指す。スンニ派イスラム法において、クルアーン、スンナに次ぐ第三の法源とされる。","english_definition":"(In Islamic jurisprudence) a consensus or agreement of Islamic scholars (mujtahids) of a particular era on a legal matter after the death of Prophet Muhammad. It is considered the third source of law in Sunni Islam, after the Quran and Sunnah.","examples":[{"sentence":"Ijmaa is a significant principle in Islamic jurisprudence.","translation":"イジュマーはイスラム法学における重要な原則である。"},{"sentence":"The scholars reached an ijmaa on the issue of inheritance.","translation":"学者たちは相続の問題についてイジュマーに達した。"}],"collocations":["reach an ijmaa (イジュマーに達する)","principle of ijmaa (イジュマーの原則)","scholarly ijmaa (学者のイジュマー)"],"synonyms":["consensus","agreement","scholarly consensus"],"antonyms":["individual opinion","dissenting opinion"]}],"etymology":{"value":"アラビア語の إجماع (ʾijmāʿ) に由来し、「集めること、まとめること、決意すること」といった意味を持つ。","priority":"★★★"},"pronunciation":{"ipa":"/ɪdʒˈmɑː(ʔ)/","syllables":"Ij-maa"},"inflection":{"noun_plural":"None (通常、単数形で用いられる)"},"usage_notes":{"explanation":"イジュマーは、イスラム法において、クルアーンやスンナに明示的な規定がない問題について、学者たちの合意によって法的判断を導き出すための重要な手段です。ただし、イジュマーとして認められるためには、一定の条件（特定の時代のすべてのムジュタヒドによる合意など）を満たす必要があります。シーア派イスラムにおいては、イジュマーの概念はスンニ派とは異なり、イマームの言葉や行動が重視されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Ijmaa is the same as Quran.","correct":"✓ Ijmaa is a source of Islamic law, but it is distinct from the Quran.","note":"イジュマーはイスラム法の源泉の一つですが、クルアーンそのものではありません。クルアーン、スンナ、イジュマー、キヤース（類推）が主要な法源とされます。"},{"incorrect":"✗ Any Muslim can participate in ijmaa.","correct":"✓ Ijmaa is the consensus of qualified Islamic scholars (mujtahids).","note":"イジュマーは、特定の条件を満たすイスラム法学者（ムジュタヒド）による合意であり、一般のムスリムが参加するものではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["mujtahid (イスラム法学者)","fiqh (イスラム法学)","sharia (シャリーア、イスラム法)","sunnah (スンナ、預言者ムハンマドの言行)","qiyas (キヤース、類推)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「**Ijmaa**」は、イスラム法学における専門用語であり、イスラム法学者たちが特定の時代に、ある法的問題について合意に達することを指します。これは、クルアーンやスンナに明示的な規定がない問題に対する法的判断の根拠となるもので、スンニ派イスラム法において重要な位置を占めます。ただし、イジュマーとして認められるためには、厳格な条件を満たす必要があり、その解釈や適用については、宗派や学者によって見解が異なる場合があります。この概念を理解するには、イスラム法学の基礎知識が必要となります。"},"example_sentences":[{"sentence":"The concept of Ijmaa is central to Sunni Islamic legal theory.","translation":"イジュマーの概念は、スンニ派イスラム法理論の中核をなす。","type":"noun","meaning_category":"合意"},{"sentence":"Some scholars argue that Ijmaa can adapt to changing social conditions.","translation":"イジュマーは変化する社会状況に適応できると主張する学者もいる。","type":"noun","meaning_category":"合意"},{"sentence":"The validity of Ijmaa as a source of law is debated among different Islamic schools of thought.","translation":"法源としてのイジュマーの妥当性は、さまざまなイスラム思想学派の間で議論されている。","type":"noun","meaning_category":"合意"}]}