{"word":"Szeged","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"セゲド (ハンガリー南部の都市)","english_definition":"A city in southern Hungary, located near the border with Serbia and Romania. It is the third-largest city in Hungary and is known for its rich history, architecture, and cultural events.","examples":[{"sentence":"We visited the Dom square in Szeged.","translation":"私たちはセゲドのドーム広場を訪れました。"},{"sentence":"Szeged is famous for its paprika.","translation":"セゲドはパプリカで有名です。"}],"collocations":["Szeged paprika (セゲドのパプリカ)","University of Szeged (セゲド大学)","Szeged Open-Air Festival (セゲド野外劇場祭)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Szeged' is of uncertain origin, but it is believed to be derived from an old Slavic word meaning 'corner' or 'angle', referring to the city's location at the confluence of the Tisza and Maros rivers.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛɡɛd/","syllables":"Se-ged"},"inflection":{},"usage_notes":{"explanation":"Szeged is a significant city in Hungary, known for its university, food industry (especially paprika), and cultural events. It's a popular tourist destination with notable landmarks such as the Szeged Cathedral (Dom) and the Votive Church.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Szegedi (adjective: relating to Szeged)"],"related_places":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Szeged' is a proper noun referring to a specific city in Hungary. It is not a commonly used word unless discussing Hungarian geography, culture, or history. Understanding the term requires familiarity with European geography.","priority":"★☆☆"},"example_sentences":[{"sentence":"The city of Szeged lies on the Great Hungarian Plain.","translation":"セゲド市はハンガリー大平原に位置しています。","type":"geographical","meaning_category":"location"},{"sentence":"Many students attend the University of Szeged.","translation":"多くの学生がセゲド大学に通っています。","type":"education","meaning_category":"education"},{"sentence":"Szeged is known for its traditional Hungarian cuisine.","translation":"セゲドは伝統的なハンガリー料理で知られています。","type":"culture","meaning_category":"culture"}]}