{"word":"pedestrian-oriented","meanings":[{"part_of_speech":"adjective","definition":"歩行者向けの、歩行者中心の","english_definition":"Designed or planned to prioritize the needs and convenience of pedestrians.","examples":[{"sentence":"The city is developing a more pedestrian-oriented downtown area.","translation":"その都市は、より歩行者中心のダウンタウン地区を開発している。"},{"sentence":"The new street design is pedestrian-oriented, with wider sidewalks and more crosswalks.","translation":"新しい道路設計は歩行者中心で、歩道が広く、横断歩道が増えている。"},{"sentence":"They aim to create a pedestrian-oriented shopping district.","translation":"彼らは歩行者中心の商店街を作ることを目指している。"}],"collocations":["pedestrian-oriented design","pedestrian-oriented development","pedestrian-oriented planning","pedestrian-oriented street","pedestrian-oriented zone"],"synonyms":["walkable","pedestrian-friendly"],"antonyms":["car-oriented","automobile-dependent"]},{"part_of_speech":"adjective","definition":"歩行者の利用を促進する、歩行者の快適性を重視する","english_definition":"Promoting or encouraging pedestrian activity and comfort.","examples":[{"sentence":"The pedestrian-oriented policies have made the city more livable.","translation":"歩行者中心の政策により、都市はより住みやすくなった。"},{"sentence":"The project aims to create a more pedestrian-oriented environment.","translation":"このプロジェクトは、より歩行者中心の環境を作ることを目指している。"}],"collocations":["pedestrian-oriented policy","pedestrian-oriented approach","pedestrian-oriented strategy"],"synonyms":["walkability-focused","pedestrian-focused"],"antonyms":["vehicle-focused"]}],"etymology":{"value":"The term combines \"pedestrian\" (a person traveling on foot) with \"oriented\" (directed or focused towards). It describes something designed or focused on the needs of pedestrians.","priority":"★☆☆"},"pronunciation":{"ipa":"/pəˌdɛstriən ˈɔːriɛntɪd/","syllables":"pe-des-tri-an-o-ri-en-ted"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Pedestrian-oriented\" is used to describe designs, policies, or developments that prioritize the safety, comfort, and convenience of people walking. It often implies features like wider sidewalks, pedestrian zones, traffic calming measures, and easy access to public transportation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plan is oriented to pedestrians.","correct":"✓ The plan is pedestrian-oriented.","note":"The correct form is \"pedestrian-oriented,\" not \"oriented to pedestrians.\" Although the meaning is similar, the hyphenated adjective is more common and natural."}],"priority":"★☆☆"},"related_words":{"derivatives":["pedestrianization (名詞: 歩行者専用化)","pedestrian (名詞: 歩行者)"],"phrases":["pedestrian-friendly","walkable city","complete streets"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in use.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"pedestrian-oriented\" describes something designed with the needs of people who walk in mind. It means that the design or plan makes it easier and more pleasant for people to walk, often by providing things like wide sidewalks, safe crosswalks, and areas where cars are not allowed. This term is often used in urban planning and design contexts."},"example_sentences":[{"sentence":"The city's new development plan is highly pedestrian-oriented, featuring numerous parks and walking paths.","translation":"市の新しい開発計画は非常に歩行者中心で、多数の公園や遊歩道が設けられています。","type":"adjective","meaning_category":"歩行者向けの"},{"sentence":"A pedestrian-oriented shopping street can attract more customers and boost local businesses.","translation":"歩行者中心の商店街は、より多くの顧客を引きつけ、地元のビジネスを活性化することができます。","type":"adjective","meaning_category":"歩行者向けの"},{"sentence":"The pedestrian-oriented design of the plaza makes it a popular gathering place for residents.","translation":"広場の歩行者中心のデザインは、住民にとって人気の集いの場となっています。","type":"adjective","meaning_category":"歩行者向けの"}]}