{"word":"winter-habited","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(of a plant or animal) remaining in a particular place throughout the winter.","english_definition":"(of a plant or animal) remaining in a particular place throughout the winter.","examples":[{"sentence":"The winter-habited birds stayed in the valley, finding shelter from the harsh winds.","translation":"冬の間、その場所に留まる鳥たちは、厳しい風を避けて谷に避難した。"},{"sentence":"Unlike migratory species, these winter-habited insects have adapted to survive the cold temperatures.","translation":"渡りをする種とは異なり、これらの冬の間その場所に留まる昆虫は、低温に耐えられるように適応している。"}],"collocations":["winter-habited birds","winter-habited insects","winter-habited plants"],"synonyms":["non-migratory","resident","overwintering"],"antonyms":["migratory","transient"]}],"etymology":{"value":"A compound word formed from 'winter' (the season between autumn and spring) and 'habited' (past participle of 'habit', meaning to dwell or inhabit). The term describes organisms that dwell or inhabit a place during the winter season.","priority":"★★☆"},"pronunciation":{"ipa":"ˈwɪntərˌhæbɪtɪd","syllables":"win-ter-hab-it-ed"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. It can be used to modify nouns in singular or plural form."},"usage_notes":{"explanation":"'Winter-habited' is a descriptive term used in biology and ecology to specify that a plant or animal remains in a particular location throughout the winter, rather than migrating or becoming dormant. It emphasizes the organism's adaptation to the local winter conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The winter-habited animal migrates south.","correct":"✓ The winter-habited animal stays in the same area all winter.","note":"'Winter-habited' means the animal stays in one place during winter, so it cannot be migratory."},{"incorrect":"✗ The plant is winter-habited during the summer.","correct":"✓ The plant is winter-habited during the winter.","note":"The term specifically refers to the winter season."}],"priority":"★☆☆"},"related_words":{"derivatives":["winter","habit","habitat","inhabit"],"phrasal_verbs":[],"related_terms":["overwinter","hibernation","dormancy","migration"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Specialized term used in ecology and biology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'winter-habited' is a specialized adjective used to describe plants or animals that remain in a specific location throughout the winter season. This term is often found in ecological or biological contexts when discussing the behavior and adaptation of species to cold climates. It implies that the organism has adapted to survive the winter conditions in that specific area, rather than migrating or entering a state of dormancy. Understanding this term requires knowledge of basic ecological concepts and vocabulary related to animal behavior and plant adaptations."},"example_sentences":[{"sentence":"The scientist studied the behavior of winter-habited deer in the national park.","translation":"科学者は国立公園で冬の間その場所に留まる鹿の行動を研究した。","type":"adjective","meaning_category":"remaining in a place during winter"},{"sentence":"The winter-habited plants have developed mechanisms to resist frost and snow.","translation":"冬の間その場所に留まる植物は、霜や雪に耐えるためのメカニズムを発達させてきた。","type":"adjective","meaning_category":"remaining in a place during winter"}]}