{"word":"gastrological","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"胃腸病学の、胃腸病学的な","english_definition":"Relating to the study of the stomach, intestines, and their diseases.","examples":[{"sentence":"The patient underwent a gastrological examination.","translation":"患者は胃腸病学的な検査を受けた。"},{"sentence":"Gastrological research has advanced significantly in recent years.","translation":"胃腸病学の研究は近年著しく進歩している。"}],"collocations":["gastrological examination","gastrological research","gastrological symptoms","gastrological disorders"],"synonyms":["digestive","alimentary","gastrointestinal"],"antonyms":[]}],"etymology":{"value":"Derived from 'gastrology', which comes from the Greek words 'gaster' (stomach) and 'logia' (study of).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɡæstroˈlɒdʒɪkəl","syllables":"gas-tro-lo-gi-cal"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Gastrological' is an adjective used to describe something related to gastrology, the branch of medicine concerned with the study and treatment of diseases of the stomach and intestines. It is often used in medical and scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The restaurant had a gastrological menu.","correct":"✓ The restaurant had a gourmet or specialized menu.","note":"'Gastrological' relates to the study of the digestive system, not gourmet food. Use 'gourmet' or 'specialized' when referring to food."}],"priority":"★★☆"},"related_words":{"derivatives":["gastrology (noun: the study of the stomach and intestines and their diseases)","gastrologist (noun: a doctor specializing in gastrology)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'gastrological' is a specialized term primarily used in medical and scientific contexts. It describes anything related to the study of the stomach, intestines, and their diseases. Due to its specific usage, it is less common in everyday language and more frequently encountered in medical literature or discussions. Understanding this term is useful for those in healthcare or related fields."},"example_sentences":[{"sentence":"The doctor recommended a gastrological consultation for the patient's persistent stomach problems.","translation":"医師は、患者の持続的な胃の不調に対して、胃腸病学的な診察を勧めた。","type":"adjective","meaning_category":"medical"},{"sentence":"New gastrological techniques have improved the diagnosis of digestive disorders.","translation":"新しい胃腸病学的な技術が、消化器疾患の診断を改善した。","type":"adjective","meaning_category":"scientific"}]}