{"word":"engarrison","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"駐屯させる、守備兵を配置する","english_definition":"To place troops in (a town, fort, etc.) for its defense; to garrison.","examples":[{"sentence":"The general decided to engarrison the town to prevent enemy infiltration.","translation":"将軍は敵の侵入を防ぐためにその町に守備兵を配置することを決定した。"},{"sentence":"We must engarrison the border fortresses to protect our territory.","translation":"我々は領土を守るために国境の要塞に守備兵を配置しなければならない。"}],"collocations":["engarrison a town","engarrison a fortress","engarrison troops"],"synonyms":["garrison","fortify","defend","secure"],"antonyms":["abandon","evacuate","leave"]}],"etymology":{"value":"'Engarrison' is formed by adding the prefix 'en-' (meaning 'to put in or on') to the word 'garrison'. 'Garrison' itself comes from the Old French 'garison', meaning 'provision, defense, protection', which is derived from 'garir' meaning 'to protect, defend'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɛnˈɡærɪsən/","syllables":"en-gar-ri-son"},"inflection":{"verb_forms":{"present_simple":["engarrison","engarrisons"],"past_simple":"engarrisoned","past_participle":"engarrisoned","present_participle":"engarrisoning"}},"usage_notes":{"explanation":"'Engarrison' is a relatively uncommon verb that specifically means to provide a place with a garrison (a body of troops stationed in a fortified place). It emphasizes the act of stationing troops for defense. While 'garrison' can be used as a verb with a similar meaning, 'engarrison' is more explicit in indicating the action of placing troops.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city was engarrisoned by the civilians.","correct":"✓ The city was engarrisoned by the soldiers.","note":"'Engarrison' refers to the placement of troops, so the subject performing the action should be a military force, not civilians."},{"incorrect":"✗ They engarrisoned from the town.","correct":"✓ They engarrisoned the town.","note":"'Engarrison' is a transitive verb and requires a direct object (the place being garrisoned)."}],"priority":"★★☆"},"related_words":{"derivatives":["garrison (noun: a body of troops stationed in a fortified place; verb: to station troops in a place)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'engarrison' is a formal and relatively rare term. It is used to describe the action of placing troops in a specific location, such as a town or fort, for the purpose of defending it. The word is primarily encountered in historical or military contexts. Understanding the word requires a grasp of military terminology and a familiarity with more advanced vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The commander ordered to engarrison the strategic hilltop to secure the area.","translation":"司令官は地域を確保するために戦略的な丘の上に守備兵を配置するように命じた。","type":"verb","meaning_category":"駐屯させる"},{"sentence":"The castle was heavily engarrisoned in anticipation of the siege.","translation":"その城は包囲を予想して厳重に守備兵が配置された。","type":"verb","meaning_category":"守備兵を配置する"}]}