{"word":"procoelian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(解剖学) 前方に凹んだ、または前方に向かってくぼんだ","english_definition":"(anatomy) Concave anteriorly, or hollowed out on the front side.","examples":[{"sentence":"Procoelian vertebrae are characteristic of crocodiles.","translation":"前凹型の椎骨はワニの特徴である。"}],"collocations":[],"synonyms":["concave","hollowed"],"antonyms":["opisthocoelian","convex"]}],"etymology":{"value":"Derived from the Greek words \"pro-\" (meaning \"before\" or \"forward\") and \"koilos\" (meaning \"hollow\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊsiːˈliːən/","syllables":"pro-coel-i-an"},"inflection":{},"usage_notes":{"explanation":"The term \"procoelian\" is primarily used in comparative anatomy, especially when describing the shape of vertebrae. Procoelian vertebrae have a concave (hollowed) front surface and a convex (rounded) rear surface, allowing for a wide range of motion. This type of vertebral articulation is found in crocodiles and some other reptiles.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["procoely (noun: the state of being procoelian)"],"related_terms":["opisthocoelian (adjective: convex anteriorly)","amphicoelian (adjective: concave on both ends)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - primarily a technical term used in zoology and comparative anatomy.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"procoelian\" is a highly specialized term used in the field of zoology and comparative anatomy. It describes a specific anatomical feature, namely vertebrae that are concave on their anterior (front) surface. Understanding this term requires a background in biology or anatomy. It is not commonly encountered in general language use."},"example_sentences":[{"sentence":"The procoelian structure of crocodile vertebrae allows for significant flexibility.","translation":"ワニの椎骨の前凹構造は、大きな柔軟性を可能にする。","type":"technical","meaning_category":"anatomy"},{"sentence":"Procoelian vertebrae provide a ball-and-socket joint-like articulation.","translation":"前凹椎骨は、ボールアンドソケットジョイントのような関節を提供する。","type":"technical","meaning_category":"anatomy"}]}