{"word":"Coparcenary","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 共同相続権、特にヒンドゥー法における共同相続権","english_definition":"(Law) A joint heirship; specifically, in Hindu law, the joint ownership of property by birthright.","examples":[{"sentence":"Under Hindu law, a coparcenary consists of those males who take by birth an interest in the property of their father, grandfather, and great-grandfather.","translation":"ヒンドゥー法の下では、共同相続権は、父、祖父、曽祖父の財産に対する権利を出生によって取得する男性で構成される。"},{"sentence":"The concept of coparcenary is central to understanding property rights in traditional Hindu families.","translation":"共同相続権の概念は、伝統的なヒンドゥー家族における財産権を理解する上で中心となる。"}],"collocations":["Hindu coparcenary","joint family coparcenary","coparcenary property","coparcenary rights"],"synonyms":["joint heirship","joint ownership","tenancy in common"],"antonyms":["sole ownership","separate property"]}],"etymology":{"value":"Derived from the Middle French 'coparcenerie', from 'coparcener', meaning a joint heir. 'Co-' signifies 'joint' and 'parcener' comes from 'parcener', meaning one who has a share in an inheritance.","priority":"★★☆"},"pronunciation":{"ipa":"/koʊˈpɑːrsənɛri/","syllables":"co-par-ce-na-ry"},"inflection":{"noun_plural":"Coparcenaries"},"usage_notes":{"explanation":"'Coparcenary' specifically refers to a type of joint ownership, particularly within the context of Hindu law, where individuals acquire rights to ancestral property by birth. It's a legal term with specific implications regarding property inheritance and management within a joint family structure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has coparcenary of the business.","correct":"✓ He has a coparcenary interest in the property.","note":"'Coparcenary' refers specifically to joint heirship of property, not general ownership of a business. Use 'interest' to clarify the type of right. "},{"incorrect":"✗ Coparcenary is the same as inheritance.","correct":"✓ Coparcenary is a type of inheritance, where rights are acquired by birth.","note":"'Coparcenary' is a specific form of inheritance, not a general term for all types of inheritance. It involves rights acquired by birth in ancestral property."}],"priority":"★★☆"},"related_words":{"derivatives":["coparcener (noun: A joint heir)"],"related_legal_terms":["partition (noun: The division of coparcenary property)","Hindu Undivided Family (HUF) (noun: The family unit that holds coparcenary property)","ancestral property (noun: Property inherited from ancestors)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Primarily used in legal and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Coparcenary' is a highly specialized legal term primarily used in the context of Hindu law. It refers to a specific type of joint ownership where individuals inherit rights to ancestral property by birth. Understanding this term requires familiarity with legal concepts and the Hindu legal system. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The court examined the validity of the coparcenary claim in the property dispute.","translation":"裁判所は、財産紛争における共同相続権の主張の有効性を検討した。","type":"noun","meaning_category":"joint heirship"},{"sentence":"Each member of the Hindu Undivided Family has a coparcenary interest in the ancestral property.","translation":"ヒンドゥー不可分家族の各メンバーは、先祖伝来の財産に対する共同相続権を有する。","type":"noun","meaning_category":"joint heirship"}]}