{"word":"demonetized","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(ウェブサイト、動画、チャンネルなど)の収益化を停止する、広告掲載を停止する","english_definition":"to stop (a website, video, channel, etc.) from being able to generate revenue, typically by disabling advertisements.","examples":[{"sentence":"The YouTube channel was demonetized due to copyright violations.","translation":"そのYouTubeチャンネルは著作権侵害のため収益化を停止された。"},{"sentence":"The website was demonetized after it was found to be spreading misinformation.","translation":"そのウェブサイトは誤った情報を拡散していることが判明した後、収益化を停止された。"},{"sentence":"Content creators fear being demonetized for controversial opinions.","translation":"コンテンツクリエイターは物議を醸す意見のために収益化を停止されることを恐れている。"}],"collocations":["get demonetized","be demonetized","demonetize a video","demonetize a channel","demonetize a website"],"synonyms":["deplatform","disable monetization","remove ads"],"antonyms":["monetize","enable monetization"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(通貨)の貨幣価値を廃止する、通貨としての使用を停止する","english_definition":"to remove something's status as money.","examples":[{"sentence":"The government demonetized the old currency notes.","translation":"政府は旧紙幣の貨幣価値を廃止した。"},{"sentence":"The country demonetized gold as a form of currency.","translation":"その国は通貨としての金の貨幣価値を廃止した。"}],"collocations":["demonetize currency","demonetize gold","demonetize cash"],"synonyms":["devalue","invalidate","withdraw from circulation"],"antonyms":["monetize","validate"]}],"etymology":{"value":"'Demonetize' is formed from 'de-' (meaning 'to remove' or 'reverse') and 'monetize' (meaning 'to convert into or express in the form of money').","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈmʌnɪtaɪzd/","syllables":"de-mon-e-tized"},"inflection":{"verb_forms":{"present_simple":["demonetize","demonetizes"],"past_simple":"demonetized","past_participle":"demonetized","present_participle":"demonetizing"}},"usage_notes":{"explanation":"'Demonetize' is commonly used in the context of online content creation, particularly on platforms like YouTube, where content creators rely on ad revenue. It refers to the act of disabling ads on a video or channel, thereby preventing the creator from earning money from that content. It can also refer to removing the status of something as money, such as a currency.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The video was demonetized because of it's content.","correct":"✓ The video was demonetized because of its content.","note":"The possessive pronoun 'its' (without an apostrophe) should be used, not the contraction 'it's' (it is)."},{"incorrect":"✗ He was very sad after being demonetized.","correct":"✓ He was very sad after his channel was demonetized.","note":"It is important to specify what was demonetized (e.g., channel, video) for clarity. Although the first sentence is understandable, the second is more precise."}],"priority":"★★☆"},"related_words":{"derivatives":["demonetization (noun)","monetize (verb)","monetization (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing due to the rise of online content creation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Demonetized' means that something, usually a website, video, or channel on the internet, has had its ability to make money turned off. This usually happens because the content breaks rules about what can be shown or said, like rules about copyright or hate speech. It can also mean that a type of money, like a certain coin or bill, is no longer used or accepted as money by the government. It's a term that's becoming more common because of the way people make money online now."},"example_sentences":[{"sentence":"The streamer's account was demonetized after violating the platform's terms of service.","translation":"そのストリーマーのアカウントは、プラットフォームの利用規約に違反したため、収益化を停止された。","type":"verb","meaning_category":"停止する"},{"sentence":"The government's decision to demonetize high-value currency notes caused widespread disruption.","translation":"政府が高額紙幣の貨幣価値を廃止するという決定は、広範囲に混乱を引き起こした。","type":"verb","meaning_category":"貨幣価値を廃止する"}]}