{"word":"Trueblood","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にフィクション作品に登場する)姓","english_definition":"A surname, primarily found in fictional works.","examples":[{"sentence":"The character Lafayette Reynolds is a descendant of Trueblood on the show True Blood.","translation":"ラファイエット・レイノルズというキャラクターは、ドラマ『True Blood』の中でTruebloodの子孫である。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"(作品名)True Blood (アメリカのテレビドラマシリーズ)","english_definition":"True Blood, an American television drama series.","examples":[{"sentence":"True Blood is a fantasy horror series set in Louisiana.","translation":"True Bloodは、ルイジアナを舞台にしたファンタジーホラーシリーズである。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The surname Trueblood is of English origin, likely derived from a nickname meaning 'true' or 'faithful' blood, possibly referring to someone of noble or pure lineage.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtruːˌblʌd/","syllables":"True-blood"},"inflection":{},"usage_notes":{"explanation":"'Trueblood' is most commonly recognized as a surname, often associated with fictional characters or settings. Its usage outside of these contexts is relatively rare. When used as a proper noun, it typically refers to the TV series 'True Blood'.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency, primarily due to its association with specific fictional works.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Trueblood' is not a common word in everyday English. It is primarily recognized as a surname, often associated with fictional works, most notably the TV series 'True Blood'. Therefore, its understanding and usage are limited to contexts related to these references."},"example_sentences":[{"sentence":"The Trueblood family has a long history in the town.","translation":"Trueblood家はこの町で長い歴史を持っている。","type":"noun","meaning_category":"Surname"},{"sentence":"True Blood gained a large following during its run.","translation":"True Bloodはその放送期間中に多くのファンを獲得した。","type":"proper noun","meaning_category":"TV series"}]}