{"word":"perplantar","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"足底の、足の裏の","english_definition":"relating to the sole of the foot","examples":[{"sentence":"The perplantar surface of the foot is often subject to pressure.","translation":"足の裏の表面は、しばしば圧力を受けやすい。"},{"sentence":"Perplantar warts can be painful.","translation":"足底疣贅は痛みを伴うことがある。"}],"collocations":["perplantar surface","perplantar wart"],"synonyms":["plantar"],"antonyms":["dorsal (of the foot)"]}],"etymology":{"value":"Derived from Latin: 'per' (through) + 'plantar' (relating to the sole of the foot).","priority":"★★☆"},"pronunciation":{"ipa":"/pərˈplæntər/","syllables":"per-plan-tar"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative forms, which are rare for this word."},"usage_notes":{"explanation":"The term 'perplantar' is a technical term primarily used in medical and anatomical contexts to specifically refer to the sole of the foot. It is not commonly used in everyday language. The simpler term 'plantar' is more frequently used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has pain in his perplantar.","correct":"✓ He has pain in his perplantar region. / ✓ He has pain in the sole of his foot.","note":"'Perplantar' is an adjective, so it needs to modify a noun. Using 'perplantar' alone as a noun is incorrect."}],"priority":"★☆☆"},"related_words":{"derivatives":["plantar (adjective: relating to the sole of the foot; noun: plantar muscle or nerve)","plantar fasciitis (noun: inflammation of the plantar fascia)"],"phrases":["perplantar fibromatosis (noun: a benign growth on the sole of the foot)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Perplantar' is a specialized term used in medical and anatomical contexts to describe something related to the sole of the foot. It is less common than the simpler term 'plantar'. Understanding its meaning is important for comprehending medical literature related to foot conditions."},"example_sentences":[{"sentence":"The doctor examined the perplantar aspect of the patient's foot.","translation":"医師は患者の足の足底面を診察した。","type":"adjective","meaning_category":"足底の"},{"sentence":"Excessive pressure on the perplantar tissues can lead to discomfort.","translation":"足底組織への過度の圧力は不快感につながる可能性がある。","type":"adjective","meaning_category":"足の裏の"}]}