{"word":"gainpain","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) Profit obtained at the expense of another's pain or suffering; ill-gotten gains.","english_definition":"Profit or advantage obtained through causing pain or suffering to others.","examples":[{"sentence":"The company's profits were seen as gainpain, as they were achieved by exploiting their workers.","translation":"その会社の利益は、労働者を搾取することによって達成されたため、他人の苦痛を代償にした利益と見なされた。"},{"sentence":"He refused to accept the money, considering it gainpain from the war.","translation":"彼はその金を、戦争によって得られた不正な利益と見なし、受け取ることを拒否した。"}],"collocations":["ill-gotten gainpain","make gainpain","profit from gainpain"],"synonyms":["ill-gotten gains","blood money","unjust enrichment","exploitation","profiteering"],"antonyms":["altruism","charity","benevolence"]}],"etymology":{"value":"A compound word formed from 'gain' (profit, advantage) and 'pain' (suffering, distress). The term emphasizes that the profit is directly derived from the pain or suffering of others.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡeɪnpeɪn/","syllables":"gain-pain"},"inflection":{"noun_plural":"gainpains"},"usage_notes":{"explanation":"The word 'gainpain' is relatively rare and carries a strong negative connotation. It is used to describe profits or advantages that are considered morally wrong because they are obtained at the expense of someone else's suffering. It is often used in contexts where there is exploitation, injustice, or unethical behavior.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He felt gainpain for his success.","correct":"✓ He felt guilt for his success.","note":"'Gainpain' refers to the profit itself, not the feeling. Use 'guilt' to describe the feeling of remorse. "},{"incorrect":"✗ The gainpain was very high this year.","correct":"✓ The profits were very high this year, but they were achieved through unethical means.","note":"If you are not emphasizing the unethical nature of the profit, use 'profit' or 'gains' instead of 'gainpain'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["exploitation","profiteering","unethical behavior","social injustice","moral corruption"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gainpain' is a rare and sophisticated term used to describe profits or advantages gained through unethical means, specifically by causing pain or suffering to others. It is a critical term used in discussions of social justice, exploitation, and moral corruption. Because of its rarity, it is not commonly encountered in everyday language and is more likely to appear in academic or specialized contexts. Understanding this term requires a strong grasp of ethical and moral concepts."},"example_sentences":[{"sentence":"The journalist exposed the company's gainpain by revealing their exploitative labor practices.","translation":"ジャーナリストは、搾取的な労働慣行を暴露することで、その会社の不正な利益を明らかにした。","type":"noun","meaning_category":"ill-gotten gains"},{"sentence":"Many condemned the war profiteers for their gainpain during the conflict.","translation":"多くの人が、紛争中の戦争成金たちの不正な利益を非難した。","type":"noun","meaning_category":"ill-gotten gains"},{"sentence":"The activist argued that the pharmaceutical company's high drug prices were a form of gainpain, as they priced life-saving medication out of reach for many.","translation":"活動家は、製薬会社が高額な薬価を設定することは、多くの人々が救命薬を手に入れることができないようにしているため、不正な利益の一形態であると主張した。","type":"noun","meaning_category":"ill-gotten gains"}]}