{"word":"nonimpeachability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"弾劾不可能性、訴追不可能性","english_definition":"The state or condition of being exempt from impeachment; not subject to being formally accused of wrongdoing, especially in a political context.","examples":[{"sentence":"The constitution ensures the nonimpeachability of certain judicial decisions to protect the independence of the judiciary.","translation":"憲法は、司法の独立性を保護するために、特定の司法判断の弾劾不可能性を保証している。"},{"sentence":"The president's lawyers argued for his nonimpeachability based on their interpretation of the law.","translation":"大統領の弁護士たちは、法律の解釈に基づいて彼（大統領）の弾劾不可能性を主張した。"}],"collocations":["enjoy nonimpeachability","claim nonimpeachability","argue for nonimpeachability","constitutional nonimpeachability"],"synonyms":["immunity from impeachment","exemption from prosecution","untouchability"],"antonyms":["impeachability","vulnerability to prosecution"]}],"etymology":{"value":"Derived from \"impeachability\" (the state of being liable to impeachment) with the addition of the prefix \"non-\" (meaning \"not\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnɪmˌpiːtʃəˈbɪlɪti/","syllables":"non-im-peach-a-bil-i-ty"},"inflection":{"noun_plural":"nonimpeachabilities"},"usage_notes":{"explanation":"\"Nonimpeachability\" is a formal term, primarily used in legal and political contexts. It refers to the condition where an individual or action is protected from being impeached, meaning they cannot be formally accused of wrongdoing by a legislative body. This term is often debated in discussions about the limits of power and accountability of public officials.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-impeachability of the evidence was clear.","correct":"✓ The inadmissibility of the evidence was clear.","note":"\"Nonimpeachability\" applies to people or actions, not evidence. Use \"inadmissibility\" for evidence. "},{"incorrect":"✗ He has nonimpeachability.","correct":"✓ He enjoys nonimpeachability.","note":"Use the verb \"enjoy\" or \"have\" to indicate possession of nonimpeachability."}],"priority":"★★☆"},"related_words":{"derivatives":["impeach","impeachment","impeachable","non-impeachable"],"phrases":["high crimes and misdemeanors"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Nonimpeachability\" is a complex legal and political term. It is best understood in the context of constitutional law and the separation of powers. The term is rarely used in everyday conversation. Understanding requires familiarity with the process of impeachment and the roles of different branches of government."},"example_sentences":[{"sentence":"The senator questioned the extent of the executive's nonimpeachability in matters of national security.","translation":"上院議員は、国家安全保障に関する問題における行政の弾劾不可能性の範囲に疑問を呈した。","type":"noun","meaning_category":"弾劾不可能性"},{"sentence":"Legal scholars debated whether the president's actions fell within the scope of nonimpeachability.","translation":"法学者は、大統領の行動が弾劾不可能性の範囲内であるかどうかについて議論した。","type":"noun","meaning_category":"弾劾不可能性"}]}