{"word":"muscavado","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"マスコバド糖（精製度の低い、粗糖の一種）","english_definition":"An unrefined or minimally refined brown sugar with a strong molasses flavor.","examples":[{"sentence":"She used muscavado sugar in her chocolate chip cookies for a richer flavor.","translation":"彼女はチョコレートチップクッキーにマスコバド糖を使い、より豊かな風味を出した。"},{"sentence":"Muscavado sugar retains more of the natural molasses than refined white sugar.","translation":"マスコバド糖は精製された白砂糖よりも多くの天然糖蜜を保持している。"}],"collocations":["use muscavado","muscavado sugar","dark muscavado","light muscavado"],"synonyms":["raw sugar","unrefined sugar","brown sugar","turbinado sugar"],"antonyms":["white sugar","refined sugar"]}],"etymology":{"value":"由来はポルトガル語の \"mascavado\", これは \"mascavar\" （粗く扱う、粗く仕上げる）の過去分詞形です。これは砂糖の精製過程が最小限であることを示しています。","priority":"★★★"},"pronunciation":{"ipa":"/ˌmʌskəˈveɪdoʊ/","syllables":"mus-ca-va-do"},"inflection":{"noun_plural":"muscavados"},"usage_notes":{"explanation":"Muscavado sugar is a type of partially refined cane sugar. It is brown and has a strong molasses flavor. It is often used in baking and cooking. It is less processed than refined white sugar, retaining more of the natural molasses and minerals from the sugarcane.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I added muscavado instead of sweetener.","correct":"✓ I added muscavado instead of artificial sweetener.","note":"Muscavado is a type of sugar, so it replaces other sugars or sweeteners, especially natural ones. Using 'sweetener' alone is too broad."},{"incorrect":"✗ Muscavado is healthier than all sugars.","correct":"✓ Muscavado is less processed than refined sugars.","note":"While muscavado retains more minerals, it's still sugar and should be consumed in moderation. The key difference is in the processing level."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["demerara sugar","turbinado sugar","molasses","brown sugar","cane sugar"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Muscavado\" is a specific type of unrefined or minimally refined brown sugar. It's less common than regular brown sugar or white sugar, so it's typically encountered in recipes or discussions about specialty ingredients. Understanding its properties (strong molasses flavor, less processing) is key to using it correctly in cooking or baking. It's more likely to be found in specialized grocery stores or online retailers."},"example_sentences":[{"sentence":"For a deep caramel flavor, try using muscavado sugar in your next batch of brownies.","translation":"濃厚なキャラメルの風味を出すには、今度ブラウニーを作る際にマスコバド糖を使ってみてください。","type":"example","meaning_category":"cooking"},{"sentence":"The texture of muscavado is slightly coarser and stickier than regular brown sugar.","translation":"マスコバド糖の質感は、通常のブラウンシュガーよりもやや粗く、ねっとりとしている。","type":"example","meaning_category":"description"}]}