{"word":"twice-corrected","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"二度修正された、二度訂正された","english_definition":"Having been corrected or revised two times.","examples":[{"sentence":"The twice-corrected manuscript was finally ready for publication.","translation":"二度修正された原稿は、ついに出版の準備ができた。"},{"sentence":"The twice-corrected proofs still contained a few minor errors.","translation":"二度訂正された校正刷りにも、まだいくつかの小さな誤りがあった。"}],"collocations":["twice-corrected manuscript","twice-corrected proofs","twice-corrected version"],"synonyms":["double-checked","revised twice","corrected again"],"antonyms":["uncorrected","unrevised","original"]}],"etymology":{"value":"The word is formed by combining \"twice\" (meaning two times) with the past participle of \"correct\" (meaning to make right or accurate).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtwaɪs kəˈrɛktɪd/","syllables":"twice-cor-rect-ed"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Twice-corrected\" is used to describe something that has undergone a correction process on two separate occasions. This implies a higher level of scrutiny and accuracy compared to something that has only been corrected once. It is often used in contexts where precision is important, such as in academic writing, legal documents, or technical manuals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The twice corrected paper was accepted.","correct":"✓ The twice-corrected paper was accepted.","note":"Hyphen is required between \"twice\" and \"corrected\" when used as a compound adjective before a noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["correct","correction","corrected","twice"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"twice-corrected\" is relatively uncommon and is typically used in formal or technical contexts where accuracy is paramount. Understanding requires familiarity with the meaning of \"twice\" and \"corrected\" and the ability to combine them to infer the overall meaning. It is more likely to be encountered in written rather than spoken English. "},"example_sentences":[{"sentence":"The professor returned the twice-corrected essay with a note praising the student's attention to detail.","translation":"教授は、学生の細部への注意を褒めるメモとともに、二度修正されたエッセイを返却した。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"After the document was twice-corrected, it was deemed ready for legal review.","translation":"文書が二度訂正された後、法的なレビューの準備ができたと判断された。","type":"adjective","meaning_category":"Descriptive"}]}