{"word":"Playmaking","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(スポーツ) 試合を組み立てること、プレーを作る能力","english_definition":"The act of organizing and creating plays in a sport, especially in team sports like basketball, soccer, or hockey. It refers to the ability to set up teammates for scoring opportunities and control the flow of the game.","examples":[{"sentence":"His playmaking skills are exceptional; he always knows where his teammates are.","translation":"彼の試合を組み立てる能力は並外れており、常にチームメイトがどこにいるかを知っている。"},{"sentence":"The team needs more playmaking from its guards to be successful.","translation":"チームが成功するためには、ガードからのより多くの試合を組み立てる能力が必要だ。"},{"sentence":"Good playmaking involves vision, passing accuracy, and decision-making.","translation":"優れた試合の組み立てには、視野、パスの正確さ、意思決定が含まれる。"}],"collocations":["offensive playmaking (攻撃的な試合の組み立て)","creative playmaking (創造的な試合の組み立て)","defensive playmaking (守備的な試合の組み立て)","central playmaking (中心的な試合の組み立て)"],"synonyms":["game management","orchestration","facilitation","creation","setup"],"antonyms":["scoring","finishing"]},{"part_of_speech":"adjective","definition":"試合を組み立てる、プレーを作る","english_definition":"Relating to or characterized by the ability to create and organize plays in a sport.","examples":[{"sentence":"He is a playmaking guard who prioritizes assists over scoring.","translation":"彼は得点よりもアシストを優先する試合を組み立てるガードだ。"},{"sentence":"The team needs a more playmaking presence in the midfield.","translation":"チームは中盤でより試合を組み立てる存在が必要だ。"}],"collocations":["playmaking ability (試合を組み立てる能力)","playmaking skills (試合を組み立てるスキル)","playmaking role (試合を組み立てる役割)"],"synonyms":["creative","facilitating","organizing"],"antonyms":["scoring","finishing"]}],"etymology":{"value":"The word is formed by combining the verb 'play' (referring to participation in a game or sport) and 'making' (referring to the act of creating or organizing). The combination emphasizes the act of creating plays or opportunities within a game.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpleɪˌmeɪkɪŋ/","syllables":"play-ma-king"},"inflection":{"notes":"As a noun, it is typically uncountable. The adjective form does not inflect."},"usage_notes":{"explanation":"'Playmaking' is most commonly used in the context of team sports to describe the ability of a player to create scoring opportunities for their teammates. It emphasizes the strategic and creative aspects of the game, focusing on setting up plays and making smart decisions to advance the team's position. It is often associated with positions like point guards in basketball, midfielders in soccer, and playmaking forwards in hockey.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is good at play make.","correct":"✓ He is good at playmaking.","note":"'Playmaking' is a single word, not two separate words. It functions as a noun describing the act of creating plays. Using 'play make' is grammatically incorrect."},{"incorrect":"✗ The team lacks of playmaking.","correct":"✓ The team lacks playmaking.","note":"The verb 'lack' does not require the preposition 'of' after it when used in this context. 'The team lacks playmaking' is the correct phrasing."}],"priority":"★★☆"},"related_words":{"derivatives":["playmaker (名詞: 試合を組み立てる選手)"],"phrasal_verbs":[],"related_concepts":["assist","pass","vision","strategy","game sense","hockey assist","key pass"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in sports commentary and analysis.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Playmaking' is a specialized term primarily used in sports contexts. It refers to the ability of a player to create scoring opportunities for their teammates through strategic passing, vision, and decision-making. Understanding this term requires familiarity with sports terminology and a grasp of strategic concepts within team sports. It is more commonly found in sports commentary, analysis, and coaching materials rather than general conversation."},"example_sentences":[{"sentence":"The point guard's exceptional **playmaking** led the team to victory.","translation":"ポイントガードの卓越した試合を組み立てる能力がチームを勝利に導いた。","type":"noun","meaning_category":"試合を組み立てること"},{"sentence":"He is known as a **playmaking** forward with a knack for setting up his teammates.","translation":"彼はチームメイトをうまくアシストすることで知られる試合を組み立てるフォワードとして知られている。","type":"adjective","meaning_category":"試合を組み立てる"},{"sentence":"The coach emphasized the importance of **playmaking** in the team's offensive strategy.","translation":"コーチはチームの攻撃戦略における試合を組み立てることの重要性を強調した。","type":"noun","meaning_category":"試合を組み立てること"},{"sentence":"Her **playmaking** skills have significantly improved this season.","translation":"彼女の試合を組み立てるスキルは今シーズン大幅に向上した。","type":"noun","meaning_category":"試合を組み立てること"}]}