{"word":"Hebraisation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘブライ化、ヘブライ語化","english_definition":"The process of causing something to become more Hebrew or Jewish in character.","examples":[{"sentence":"The Hebraisation of names was common among early Zionist settlers in Palestine.","translation":"名前のヘブライ化は、パレスチナの初期のシオニスト入植者の間で一般的でした。"},{"sentence":"The Hebraisation of the curriculum aimed to promote a stronger sense of Jewish identity.","translation":"カリキュラムのヘブライ化は、ユダヤ人のアイデンティティのより強い感覚を促進することを目的としていました。"}],"collocations":["name Hebraisation","cultural Hebraisation","linguistic Hebraisation"],"synonyms":["Judaization","Hebraicization"],"antonyms":["De-Hebraisation","Assimilation"],"notes":"Often used in the context of language, culture, or personal names."}],"etymology":{"value":"Derived from \"Hebraise\" (to make Hebrew) + \"-ation\" (a suffix denoting a process or action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːbraɪˈzeɪʃən/","syllables":"He-brai-sa-tion"},"inflection":{"noun_plural":"Hebraisations"},"usage_notes":{"explanation":"\"Hebraisation\" refers to the act of making something more Hebrew in character. This can involve linguistic changes, such as adopting Hebrew names or words, or cultural shifts towards more traditional Jewish practices. The term is often used in historical contexts, particularly concerning the development of modern Israel and the revival of the Hebrew language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Hebraisation was very Hebraic.","correct":"✓ The process of Hebraisation made the culture more Hebraic.","note":"Avoid redundant phrasing. Use \"Hebraisation\" to describe the process and \"Hebraic\" to describe the state or characteristic."}],"priority":"★★☆"},"related_words":{"derivatives":["Hebraise (verb)","Hebraic (adjective)","Hebraist (noun)"],"related_concepts":["Zionism","Jewish culture","Hebrew language revival"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Hebraisation\" is a relatively specialized term, primarily used in academic or historical contexts when discussing the process of making something more Hebrew in character. It is often associated with the history of Zionism and the revival of the Hebrew language. Understanding requires familiarity with these historical and cultural contexts."},"example_sentences":[{"sentence":"The **Hebraisation** of street names in Jerusalem reflected the changing demographics of the city.","translation":"エルサレムの通りの名前のヘブライ化は、都市の人口構成の変化を反映していました。","type":"general","meaning_category":"General"},{"sentence":"The early kibbutzim promoted the **Hebraisation** of daily life, including language and customs.","translation":"初期のキブツは、言語や習慣を含む日常生活のヘブライ化を推進しました。","type":"cultural","meaning_category":"Cultural"},{"sentence":"Many immigrants underwent a process of **Hebraisation** upon arrival in Israel.","translation":"多くの移民は、イスラエルに到着するとヘブライ化のプロセスを経ました。","type":"immigration","meaning_category":"Immigration"}]}