{"word":"leister","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A type of spear with barbed prongs, used for fishing.","english_definition":"A spear with barbed prongs, used for catching fish.","examples":[{"sentence":"The fisherman used a leister to catch salmon in the river.","translation":"漁師は川で鮭を捕るためにライスターを使った。"},{"sentence":"Archaeological evidence suggests leisters were used in ancient times for fishing.","translation":"考古学的証拠は、ライスターが古代に漁に使われていたことを示唆している。"}],"collocations":["fishing leister","pronged leister","salmon leister"],"synonyms":["fish spear","trident","gig"],"antonyms":[]}],"etymology":{"value":"From Middle English *leistre*, from Old Norse *ljóstr*, from *ljósta* (“to strike, beat”), from Proto-Germanic *leuhstijaną (“to strike, beat”).","priority":"Medium"},"pronunciation":{"ipa":"/ˈlaɪstər/","syllables":"lais-ter"},"inflection":{"noun_plural":"leisters"},"usage_notes":{"explanation":"A leister is a specialized fishing tool, a type of spear with multiple barbed prongs designed to efficiently catch fish. It is less common in modern fishing practices, often replaced by nets or fishing rods, but it remains relevant in historical contexts and some traditional fishing methods.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He used a laser to catch the fish.","correct":"He used a leister to catch the fish.","note":"'Laser' and 'leister' are different words with different meanings. A laser is a device that emits light, while a leister is a type of spear."}],"priority":"Low"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"None","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"The word 'leister' is a specialized term related to historical and traditional fishing practices. It is unlikely to be encountered in everyday conversation or general texts. Understanding this word requires familiarity with archaic tools and fishing techniques."},"example_sentences":[{"sentence":"The museum exhibit displayed a collection of ancient leisters used by indigenous populations.","translation":"博物館の展示では、先住民が使用していた古代のライスターのコレクションが展示されていた。","type":"noun","meaning_category":"fishing tool"},{"sentence":"Using a leister requires skill and precision to effectively spear the fish.","translation":"ライスターを使うには、魚を効果的に突くためのスキルと正確さが必要だ。","type":"noun","meaning_category":"fishing tool"}]}