{"word":"nonecliptical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"黄道面（太陽の通り道）上にない、または黄道面と一致しない","english_definition":"Not located on or coinciding with the ecliptic (the plane of Earth's orbit around the Sun).","examples":[{"sentence":"The comet's orbit is highly nonecliptical, taking it far from the plane of the solar system.","translation":"その彗星の軌道は非常に黄道面から外れており、太陽系の平面から遠く離れている。"},{"sentence":"Many minor planets have nonecliptical orbits.","translation":"多くの小惑星は黄道面と一致しない軌道を持つ。"}],"collocations":["nonecliptical orbit","highly nonecliptical","nonecliptical trajectory"],"synonyms":["off-ecliptic","non-coplanar (with the ecliptic)"],"antonyms":["ecliptical","coplanar (with the ecliptic)"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'ecliptical'. 'Ecliptical' itself refers to the ecliptic, the plane of Earth's orbit around the Sun, from Greek 'ekleipsis' (eclipse), because eclipses occur when the Moon crosses this plane.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnʌnɪˈklɪptɪkəl/","syllables":"non-e-clip-ti-cal"},"inflection":{"notes":"Adjectives do not typically inflect in English, beyond comparative and superlative forms (which are less common for this word)."},"usage_notes":{"explanation":"'Nonecliptical' is a technical term primarily used in astronomy and astrophysics to describe orbits or positions of celestial objects that are not aligned with the ecliptic plane. It's often used to characterize the orbits of comets, asteroids, and other objects that have significantly inclined orbits relative to the planets in our solar system.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The star has a nonecliptical color.","correct":"✓ The star has a color that is unrelated to its position relative to the ecliptic.","note":"'Nonecliptical' refers to a position or orbit, not to properties like color. Ensure the context is related to orbital mechanics or celestial positioning."},{"incorrect":"✗ The Earth's orbit is nonecliptical.","correct":"✓ The Earth's orbit is ecliptical by definition.","note":"The Earth's orbit defines the ecliptic plane, so it cannot be nonecliptical. This term is used for other objects whose orbits are inclined relative to Earth's orbit."}],"priority":"★★☆"},"related_words":{"derivatives":["ecliptic","ecliptical","non-ecliptic"],"related_terms":["orbital inclination","celestial mechanics","astronomy","astrophysics"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Technical vocabulary, specific to astronomy)","frequency_google_ngram":"Very low frequency (Specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonecliptical' is a specialized term used in astronomy. It describes something that is not on the same plane as the Earth's orbit around the Sun (the ecliptic). If an object has a 'nonecliptical orbit,' it means its path around the Sun is tilted compared to the paths of the planets in our solar system. This term is mainly found in scientific contexts related to space and celestial mechanics."},"example_sentences":[{"sentence":"The Oort cloud is thought to contain many objects with highly **nonecliptical** orbits.","translation":"オールトの雲には、非常に黄道面から外れた軌道を持つ天体が多数含まれていると考えられている。","type":"adjective","meaning_category":"黄道面上にない"},{"sentence":"Studying **nonecliptical** orbits helps astronomers understand the formation and evolution of the solar system.","translation":"黄道面と一致しない軌道を研究することで、天文学者は太陽系の形成と進化を理解することができる。","type":"adjective","meaning_category":"黄道面上にない"},{"sentence":"The spacecraft was designed to observe celestial objects from a **nonecliptical** vantage point.","translation":"その宇宙船は、黄道面から外れた有利な地点から天体を観測するように設計された。","type":"adjective","meaning_category":"黄道面上にない"}]}