{"word":"nondenotative","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非指示的な、指示的でない","english_definition":"Not having a direct or specific reference; not directly denoting something.","examples":[{"sentence":"The poem's language is highly nondenotative, relying on symbolism and imagery rather than concrete references.","translation":"その詩の言葉は非常に非指示的であり、具体的な言及ではなく、象徴主義とイメージに依存している。"},{"sentence":"Nondenotative terms are often used in abstract art to evoke feelings rather than represent objects.","translation":"非指示的な用語は、オブジェクトを表現するのではなく、感情を呼び起こすために抽象芸術でよく使用される。"}],"collocations":["nondenotative language","nondenotative art","nondenotative meaning"],"synonyms":["nonreferential","abstract","symbolic","figurative"],"antonyms":["denotative","referential","concrete","literal"]}],"etymology":{"value":"Derived from the prefix 'non-' (meaning 'not') combined with 'denotative' (meaning 'having a direct or specific reference').","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒndiˈnoʊteɪtɪv/","syllables":"non-de-no-ta-tive"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"'Nondenotative' is typically used in discussions of language, literature, and art to describe elements that do not have a straightforward, literal meaning or reference. It emphasizes the use of symbolism, metaphor, and other figures of speech.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was very denotative, using abstract shapes.","correct":"✓ The painting was very nondenotative, using abstract shapes.","note":"'Denotative' means having a direct reference, while 'nondenotative' means lacking a direct reference. Abstract shapes are typically nondenotative."}],"priority":"★☆☆"},"related_words":{"derivatives":["denotation","denotative","denote"],"related_concepts":["semantics","semiotics","symbolism","representation"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nondenotative' is a term used in advanced discussions of language and art. It describes something that doesn't have a direct, literal meaning but relies on abstract or symbolic representation. Understanding this term requires familiarity with concepts like symbolism and semantics."},"example_sentences":[{"sentence":"The artist employed nondenotative forms to convey a sense of unease.","translation":"アーティストは、不安感を伝えるために非指示的な形式を採用した。","type":"general","meaning_category":"art"},{"sentence":"Much of modern poetry uses nondenotative language to create layers of meaning.","translation":"現代詩の多くは、意味の層を作成するために非指示的な言語を使用している。","type":"general","meaning_category":"literature"}]}