{"word":"Corebox","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of mold used in foundries to create cores for casting metal parts.","english_definition":"A mold used to produce cores, which are inserts placed in a mold to create hollow sections or intricate internal shapes in a casting.","examples":[{"sentence":"The foundry worker carefully filled the corebox with sand and binder.","translation":"鋳物工は注意深くコアボックスに砂とバインダーを充填した。"},{"sentence":"The design of the corebox is critical to the accuracy of the final casting.","translation":"コアボックスの設計は、最終的な鋳物の精度にとって非常に重要である。"}],"collocations":["sand corebox","metal corebox","resin corebox","corebox design","corebox tooling","corebox manufacturing"],"synonyms":["core mold","core making equipment"],"antonyms":[]}],"etymology":{"value":"The term 'corebox' is a compound word derived from 'core,' referring to the internal shape-forming insert in a casting, and 'box,' indicating the container or mold used to create that core.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɔːrˌbɒks/","syllables":"core-box"},"inflection":{"noun_plural":"coreboxes"},"usage_notes":{"explanation":"A corebox is a specialized tool used in metal casting to produce cores. These cores are placed inside the main mold cavity to create internal features, such as holes or complex passages, in the final cast part. The corebox is typically made of metal, wood, or resin and is designed to be filled with a core material (usually sand mixed with a binder) that hardens to form the core.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The corebox was used to make the entire casting.","correct":"✓ The corebox was used to make the core, which was then placed in the main mold to create the casting's internal features.","note":"The corebox only creates the core, not the entire casting. The core is an insert within the main mold."}],"priority":"★★☆"},"related_words":{"derivatives":["core","casting","foundry","mold","pattern"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Specialized term within the foundry industry.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Corebox' is a technical term used in the context of metal casting and foundry work. It refers to a specific type of mold used to create cores, which are inserts placed inside the main mold cavity to form internal shapes in the final cast product. Understanding this term requires familiarity with the metal casting process."},"example_sentences":[{"sentence":"The engineer inspected the corebox for any signs of wear or damage.","translation":"エンジニアは、摩耗や損傷の兆候がないかコアボックスを検査した。","type":"noun","meaning_category":"mold"},{"sentence":"A well-designed corebox can significantly reduce casting defects.","translation":"適切に設計されたコアボックスは、鋳造欠陥を大幅に減らすことができる。","type":"noun","meaning_category":"mold"}]}