{"word":"non-hydrogenated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非水素添加の、水素添加されていない","english_definition":"Not having undergone hydrogenation; not having had hydrogen atoms added to its molecules.","examples":[{"sentence":"This margarine is made with non-hydrogenated vegetable oils.","translation":"このマーガリンは非水素添加の植物油で作られています。"},{"sentence":"Consumers are increasingly seeking products made with non-hydrogenated fats.","translation":"消費者はますます非水素添加の脂肪で作られた製品を求めるようになっています。"}],"collocations":["non-hydrogenated vegetable oil","non-hydrogenated fat","non-hydrogenated shortening"],"synonyms":["unhydrogenated"],"antonyms":["hydrogenated"]},{"part_of_speech":"adjective","definition":"（特に食品に関して）トランス脂肪酸を含まない、または非常に少ない","english_definition":"(Especially of food) containing no, or very little, trans fats.","examples":[{"sentence":"Non-hydrogenated oils are often used as a healthier alternative to partially hydrogenated oils, which contain trans fats.","translation":"非水素添加油は、トランス脂肪酸を含む部分水素添加油のより健康的な代替品としてよく使用されます。"},{"sentence":"Many food manufacturers have switched to using non-hydrogenated oils to reduce trans fat content in their products.","translation":"多くの食品メーカーは、製品中のトランス脂肪酸含有量を減らすために、非水素添加油の使用に切り替えました。"}],"collocations":["trans fat free","zero trans fat"],"synonyms":["trans fat free","zero trans fat"],"antonyms":["hydrogenated (partially, containing trans fats)"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'hydrogenated'. Hydrogenated means having undergone hydrogenation, a chemical process where hydrogen atoms are added to molecules, typically unsaturated fats, to make them more saturated and solid at room temperature.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn haɪˈdrɒdʒəneɪtɪd/","syllables":"non-hy-dro-gen-a-ted"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Non-hydrogenated' refers to fats and oils that have not been subjected to the hydrogenation process. Hydrogenation is often used to solidify liquid oils and increase shelf life, but it can create trans fats, which are considered unhealthy. Therefore, 'non-hydrogenated' is often used to indicate a healthier product, free from or low in trans fats. The term is commonly found on food labels.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This oil is non-hydrogen.","correct":"✓ This oil is non-hydrogenated.","note":"'Non-hydrogen' is not a correct term. The correct term is 'non-hydrogenated', which describes the process the oil has *not* undergone."},{"incorrect":"✗ Non-hydrogenated oil is the same as hydrogenated oil.","correct":"✓ Non-hydrogenated oil is different from hydrogenated oil.","note":"Non-hydrogenated and hydrogenated oils have different properties and health implications. Non-hydrogenated oils do not contain trans fats produced during the hydrogenation process."}],"priority":"★★☆"},"related_words":{"derivatives":["hydrogenation","hydrogenated","partially hydrogenated"],"phrases":["trans fat","saturated fat","unsaturated fat","vegetable oil"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency, primarily used in scientific and food-related contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-hydrogenated' is used to describe oils and fats that have not undergone a chemical process called hydrogenation. Hydrogenation is often used to make oils more solid and stable, but it can also create unhealthy trans fats. Therefore, products labeled 'non-hydrogenated' are often marketed as a healthier alternative. Understanding this term requires knowledge of basic chemistry and nutrition concepts. It is commonly found in the context of food labeling and nutritional information.","priority":"★★☆"},"example_sentences":[{"sentence":"The label clearly states that the product contains non-hydrogenated sunflower oil.","translation":"ラベルには、製品に非水素添加のヒマワリ油が含まれていることが明記されています。","type":"adjective","meaning_category":"describing oil"},{"sentence":"Choosing non-hydrogenated spreads can help reduce your intake of trans fats.","translation":"非水素添加のスプレッドを選ぶことは、トランス脂肪酸の摂取量を減らすのに役立ちます。","type":"adjective","meaning_category":"health benefit"},{"sentence":"This bakery uses only non-hydrogenated shortening in its pastries.","translation":"このパン屋では、ペストリーに非水素添加のショートニングのみを使用しています。","type":"adjective","meaning_category":"food ingredient"}]}