{"word":"desmocyte","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(細胞生物学) デスモサイト：細胞間橋（細胞間連絡構造）を持つ細胞。特に、棘細胞層（有棘層）のケラチノサイトを指すことが多い。","english_definition":"(cell biology) A cell connected to others by desmosomes, especially a keratinocyte in the stratum spinosum of the epidermis.","examples":[{"sentence":"Desmocytes are abundant in the epidermis, providing structural integrity to the skin.","translation":"デスモサイトは表皮に豊富に存在し、皮膚の構造的完全性を提供します。"},{"sentence":"The desmosomes between desmocytes contribute to the skin's barrier function.","translation":"デスモサイト間のデスモソームは、皮膚のバリア機能に貢献します。"}],"collocations":["intercellular bridge","prickle cell","stratum spinosum","desmosome"],"synonyms":["keratinocyte (in some contexts)","prickle cell"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の 'desmos' (結合、連結) + 'cyte' (細胞) に由来。細胞間を連結する構造を持つ細胞を意味する。","priority":"★★★"},"pronunciation":{"ipa":"/ˈdɛzməˌsaɪt/","syllables":"des-mo-cyte"},"inflection":{"noun_plural":"desmocytes"},"usage_notes":{"explanation":"'Desmocyte' は、細胞間橋（デスモソーム）によって互いに連結された細胞を指す用語です。特に皮膚の棘細胞層（有棘層）に見られるケラチノサイトを指すことが多いです。これらの細胞間の連結は、組織の構造的な強度と安定性を維持する上で重要です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Desmocytes are a type of muscle cell.","correct":"✓ Desmocytes are a type of epithelial cell, specifically keratinocytes in the epidermis.","note":"デスモサイトは上皮細胞の一種であり、特に表皮のケラチノサイトです。筋細胞ではありません。"},{"incorrect":"✗ Desmocytes are found in the brain.","correct":"✓ Desmocytes are primarily found in the epidermis, particularly the stratum spinosum.","note":"デスモサイトは主に表皮、特に棘細胞層に存在します。脳には存在しません。"}],"priority":"★★☆"},"related_words":{"derivatives":["desmosome (名詞: デスモソーム、細胞間接着装置)","desmoplasia (名詞: デスモプラスチック反応、線維性組織の増生)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な生物学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Desmocyte' は、細胞生物学における専門用語であり、一般的には使用されません。この単語は、デスモソームと呼ばれる細胞間接着構造によって互いに連結された細胞を指します。特に、皮膚の表皮層である棘細胞層（有棘層）に存在するケラチノサイトを指すことが多いです。デスモサイトは、皮膚の構造的な完全性とバリア機能を維持する上で重要な役割を果たします。生物学や医学の専門分野で学習する可能性のある単語です。"},"example_sentences":[{"sentence":"The stratum spinosum is characterized by the presence of numerous desmocytes connected by desmosomes.","translation":"有棘層は、デスモソームによって連結された多数のデスモサイトの存在によって特徴づけられます。","type":"scientific","meaning_category":"細胞生物学"},{"sentence":"Loss of desmosomal adhesion between desmocytes can lead to skin disorders.","translation":"デスモサイト間のデスモソーム接着の喪失は、皮膚疾患につながる可能性があります。","type":"medical","meaning_category":"医学"}]}