{"word":"Birdman","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(しばしば複合語で)鳥類学者、鳥を専門とする人","english_definition":"(often in compounds) a person who studies birds; an ornithologist.","examples":[{"sentence":"He's a self-proclaimed birdman, always watching the skies.","translation":"彼は自称バードマンで、いつも空を見ている。"}],"collocations":[],"synonyms":["ornithologist","birdwatcher"],"antonyms":[]},{"part_of_speech":"noun","definition":"(俗語)麻薬の売人、特にヘロインの売人","english_definition":"(slang) a drug dealer, especially a heroin dealer.","examples":[{"sentence":"The police are cracking down on the birdmen in the neighborhood.","translation":"警察は近所のバードマン（麻薬売人）を取り締まっている。"}],"collocations":[],"synonyms":["drug dealer","pusher"],"antonyms":[]},{"part_of_speech":"noun","definition":"(映画)2014年の映画『バードマン あるいは（無知がもたらす予期せぬ奇跡）』の略称、またはその主人公","english_definition":"Shortened form of the title of the 2014 film 'Birdman or (The Unexpected Virtue of Ignorance)', or the main character in the film.","examples":[{"sentence":"Have you seen Birdman? It's a really interesting film.","translation":"バードマンを見た？とても面白い映画だよ。"},{"sentence":"Michael Keaton played Birdman in the movie.","translation":"マイケル・キートンが映画でバードマンを演じた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Bird' + 'man'. The drug dealer sense likely arose from the association of birds with flight and escape, or possibly from the street names used by dealers.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɜːrdmæn/","syllables":"bird-man"},"inflection":{"noun_plural":"Birdmen"},"usage_notes":{"explanation":"The term 'Birdman' has multiple meanings, ranging from a person interested in birds to a slang term for a drug dealer. The specific meaning is typically determined by context. It is also widely known as the title of a popular film.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_films":["Birdman or (The Unexpected Virtue of Ignorance)"],"related_people":["Michael Keaton"]},"level_frequency":{"CEFR":null,"frequency_google_ngram":null,"priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Birdman' is a compound word with a few different meanings. It can refer to someone who studies birds, but it's also slang for a drug dealer. More recently, it's become associated with the movie of the same name. You need to understand the context to know which meaning is intended."},"example_sentences":[{"sentence":"The local birdman identified several rare species in the park.","translation":"地元のバードマン（鳥類学者）が公園でいくつかの珍しい種を特定した。","type":"noun","meaning_category":"ornithologist"},{"sentence":"He was known as the Birdman on the streets, selling heroin to anyone who would buy.","translation":"彼は街でバードマンとして知られており、買う人なら誰にでもヘロインを売っていた。","type":"noun","meaning_category":"drug dealer"},{"sentence":"Birdman is a dark comedy about an actor trying to revive his career.","translation":"バードマンは、キャリアを復活させようとする俳優についてのブラックコメディだ。","type":"noun","meaning_category":"film title"}]}