{"word":"nonmelodiously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"旋律的でないように、メロディーを欠いて","english_definition":"in a way that lacks melody; without a pleasing sequence of sounds.","examples":[{"sentence":"The avant-garde composer arranged the notes nonmelodiously, creating a jarring effect.","translation":"その前衛的な作曲家は、旋律的でないように音符を配置し、耳障りな効果を生み出した。"},{"sentence":"The poem was recited nonmelodiously, making it difficult to appreciate its rhythm.","translation":"その詩はメロディーを欠いて朗読されたため、そのリズムを理解するのが難しかった。"}],"collocations":["sing nonmelodiously","play nonmelodiously","recite nonmelodiously"],"synonyms":["discordantly","cacophonously","unharmoniously","dissonantly"],"antonyms":["melodiously","harmoniously","tunefully","sweetly"]}],"etymology":{"value":"'non-' (否定接頭辞) + 'melodiously' (旋律的に)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn məˈloʊdiəsli/","syllables":"non-me-lo-di-ous-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Nonmelodiously' is used to describe something that is performed or expressed without a pleasing melody or sequence of sounds. It is often used in the context of music, speech, or other forms of auditory expression.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The bird sang nonmelodiously. (if the intention is that the bird's song was simply not melodic)","correct":"The bird's song was nonmelodic.","note":"Use the adjective 'nonmelodic' to describe the quality of something that lacks melody, rather than the adverb 'nonmelodiously' to describe how something is performed."}],"priority":"★☆☆"},"related_words":{"derivatives":["nonmelodic (adjective)","melody (noun)","melodious (adjective)","melodiously (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonmelodiously' is a relatively uncommon adverb that describes the manner in which something is done without a pleasing melody. It is formed by adding the prefix 'non-' to 'melodiously,' indicating a negation of the quality of being melodious. This word is most likely to be encountered in contexts related to music theory, criticism, or avant-garde artistic expression, where the absence of traditional melody is a deliberate choice or characteristic."},"example_sentences":[{"sentence":"The experimental piece was performed nonmelodiously to challenge traditional musical expectations.","translation":"その実験的な作品は、従来の音楽的期待に挑戦するために、旋律的でないように演奏された。","type":"adverb","meaning_category":"lack of melody"},{"sentence":"The poem, though rich in imagery, was delivered nonmelodiously, diminishing its emotional impact.","translation":"その詩は、イメージが豊かであるにもかかわらず、メロディーを欠いて伝えられたため、その感情的なインパクトが薄れてしまった。","type":"adverb","meaning_category":"lack of melody"},{"sentence":"The composer intentionally arranged the chords nonmelodiously to create a sense of unease.","translation":"作曲家は、不安感を出すために、意図的にコードを旋律的でないように配置した。","type":"adverb","meaning_category":"lack of melody"}]}