{"word":"Holi","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ホーリー祭 (インドのヒンドゥー教の春祭り。色粉や色水をかけ合って祝う)","english_definition":"A Hindu spring festival celebrated in India and Nepal, also known as the \"festival of colors\" or the \"festival of love\". It is celebrated by people throwing vibrant colored powders and water at each other.","examples":[{"sentence":"We celebrated Holi with friends and family, throwing colored powder and water at each other.","translation":"私たちは友人や家族とホーリー祭を祝い、色粉や色水をかけ合いました。"},{"sentence":"Holi is a time for forgiveness, renewal, and celebrating the arrival of spring.","translation":"ホーリー祭は、許し、再生、そして春の到来を祝う時です。"},{"sentence":"The festival of Holi is known for its vibrant colors and joyful atmosphere.","translation":"ホーリー祭は、その鮮やかな色彩と楽しい雰囲気で知られています。"}],"collocations":["celebrate Holi","play Holi","Holi colors","Holi festival","Holi party"],"synonyms":["festival of colors","festival of love"],"antonyms":[]}],"etymology":{"value":"The word \"Holi\" is derived from the Sanskrit word \"Holika\", which refers to the burning of Holika, a demoness in Hindu mythology. The festival celebrates the victory of good over evil.","priority":"★★★"},"pronunciation":{"ipa":"ˈhoʊliː","syllables":"Ho-li"},"inflection":{"noun_plural":"Holis (まれに複数形で使われることがある)"},"usage_notes":{"explanation":"Holi is a proper noun referring specifically to the Hindu festival. It is often used with verbs like \"celebrate\" or \"play.\" When describing the colored powders used in the festival, you can use the term \"Holi colors.\"","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to a Holi's party.","correct":"✓ I'm going to a Holi party.","note":"Holi is used as an adjective here, so no possessive is needed."},{"incorrect":"✗ Holi is a celebration of colors.","correct":"✓ Holi is a celebration with colors. / ✓ Holi is a celebration involving colors.","note":"'With' or 'involving' is more appropriate than 'of' when describing what the celebration uses."}],"priority":"★★☆"},"related_words":{"derivatives":["Holika (デーモン、ホーリー祭の起源となる神話上の存在)"],"festivals":["Diwali (ディワリ、光の祭り)","Dussehra (ダセラ)","Raksha Bandhan (ラクシャ・バンダン)"],"terms":["gulal (色粉)","rangoli (ランゴリ、色砂で描く模様)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (文化的な話題で使われる)","frequency_google_ngram":"比較的低い頻度 (Relatively low frequency) - 特定の文化圏に関連する単語であるため。","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"\"Holi\" is the name of a fun spring festival celebrated in India and Nepal. People throw colorful powders and water on each other. It's like a big, joyful party with lots of colors! It's a time for happiness and celebrating new beginnings.","priority":"★★★"},"example_sentences":[{"sentence":"During Holi, the streets are filled with people covered in vibrant colors.","translation":"ホーリー祭の間、通りは鮮やかな色で覆われた人々でいっぱいになります。","type":"general","meaning_category":"description"},{"sentence":"Many tourists visit India to experience the unique celebration of Holi.","translation":"多くの観光客が、ホーリー祭というユニークな祭りを体験するためにインドを訪れます。","type":"general","meaning_category":"travel"},{"sentence":"The children were excited to play Holi with their friends.","translation":"子供たちは友達とホーリー祭で遊ぶのを楽しみにしていました。","type":"general","meaning_category":"activity"},{"sentence":"Holi is a festival that brings people together in a spirit of joy and friendship.","translation":"ホーリー祭は、喜びと友情の精神で人々を結びつける祭りです。","type":"general","meaning_category":"purpose"}]}