{"word":"inhabitancy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"居住、居住すること、居住地","english_definition":"the state or condition of inhabiting; residence; the fact of living in a particular place.","examples":[{"sentence":"The inhabitancy of the island dates back centuries.","translation":"その島の居住は数世紀前に遡る。"},{"sentence":"The low population density reflects the challenges of inhabitancy in this region.","translation":"低い人口密度は、この地域における居住の難しさを反映している。"}],"collocations":["permanent inhabitancy (永住)","long-term inhabitancy (長期居住)","seasonal inhabitancy (季節的な居住)"],"synonyms":["residence","habitation","dwelling","occupancy","tenancy"],"antonyms":["uninhabitancy","abandonment","eviction"]}],"etymology":{"value":"\"Inhabit\" + \"-ancy\". \"Inhabit\" comes from the Latin \"inhabitare\" (to dwell in), from \"in-\" (in) + \"habitare\" (to dwell). The suffix \"-ancy\" denotes a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈhæbɪtənsi/","syllables":"in-hab-it-an-cy"},"inflection":{"noun_plural":"inhabitancies"},"usage_notes":{"explanation":"\"Inhabitancy\" is a formal term referring to the state or condition of living in a particular place. It is less commonly used than \"residence\" or \"habitation\" in modern English. It often appears in legal or historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inhabitancy is very expensive in Tokyo.","correct":"✓ The cost of inhabitancy is very expensive in Tokyo. / ✓ Living in Tokyo is very expensive.","note":"\"Inhabitancy\" refers to the state of inhabiting, not the act of living itself. Therefore, it's more appropriate to use \"cost of inhabitancy\" or rephrase the sentence to \"living in\"."},{"incorrect":"✗ The inhabitancy of birds in this forest is diverse.","correct":"✓ The inhabitants of this forest are diverse. / ✓ The bird population in this forest is diverse.","note":"\"Inhabitancy\" refers to the state of inhabiting, not the inhabitants themselves. Use \"inhabitants\" to refer to the people or animals living in a place."}],"priority":"★★☆"},"related_words":{"derivatives":["inhabit (verb: 居住する)","inhabitant (noun: 居住者)","inhabitable (adjective: 居住可能な)","uninhabitable (adjective: 居住不可能な)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Inhabitancy\" is a relatively uncommon and formal word that refers to the state or condition of living in a particular place. It is often used in legal or historical contexts. Because it is not frequently used in everyday conversation, it is considered a more advanced vocabulary word. It's important to distinguish it from the more common words like \"residence\" or \"habitation.\""},"example_sentences":[{"sentence":"The history of human inhabitancy in this region is long and complex.","translation":"この地域における人類の居住の歴史は長く複雑である。","type":"general","meaning_category":"居住"},{"sentence":"The legal definition of inhabitancy can vary from country to country.","translation":"居住の法的定義は国によって異なる場合がある。","type":"legal","meaning_category":"居住"},{"sentence":"The challenges of inhabitancy in extreme environments are significant.","translation":"極限環境における居住の課題は大きい。","type":"environmental","meaning_category":"居住"}]}