{"word":"unidisciplinary","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単一分野の、単一学問分野の","english_definition":"Involving or pertaining to only one academic discipline or field of study.","examples":[{"sentence":"The research project took a unidisciplinary approach, focusing solely on economic factors.","translation":"その研究プロジェクトは単一分野のアプローチを取り、経済的要因のみに焦点を当てました。"},{"sentence":"A unidisciplinary curriculum may lack the breadth needed to address complex real-world problems.","translation":"単一学問分野のカリキュラムは、複雑な現実世界の問題に対処するために必要な幅広さを欠いている可能性があります。"}],"collocations":["unidisciplinary approach","unidisciplinary research","unidisciplinary study","unidisciplinary curriculum","unidisciplinary perspective"],"synonyms":["monodisciplinary","single-discipline"],"antonyms":["multidisciplinary","interdisciplinary","transdisciplinary"]}],"etymology":{"value":"Formed from the prefix \"uni-\" (meaning one) + \"disciplinary\" (relating to a discipline or field of study).","priority":"★★★"},"pronunciation":{"ipa":"/ˌjuːnɪdɪˈsɪplɪneri/","syllables":"u-ni-di-sci-pli-ner-y"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"\"Unidisciplinary\" describes something that involves only one academic discipline. It stands in contrast to \"multidisciplinary\" (involving several disciplines), \"interdisciplinary\" (integrating knowledge from different disciplines), and \"transdisciplinary\" (transcending disciplinary boundaries to create a holistic approach).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The team was unidisciplinary, including members from various fields.","correct":"✓ The team was multidisciplinary, including members from various fields.","note":"\"Unidisciplinary\" means involving only one discipline, so a team with members from various fields would be \"multidisciplinary.\""}],"priority":"★★☆"},"related_words":{"derivatives":["unidisciplinarity (noun)"],"phrases":["unidisciplinary education","unidisciplinary training"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"unidisciplinary\" is primarily used in academic or research contexts to describe an approach, study, or curriculum that focuses on a single academic discipline. It's important to distinguish it from related terms like \"multidisciplinary,\" \"interdisciplinary,\" and \"transdisciplinary,\" which involve multiple fields of study. Understanding these distinctions is crucial for discussing research methodologies and educational approaches."},"example_sentences":[{"sentence":"The department offers a unidisciplinary program in physics.","translation":"その学科は物理学の単一分野プログラムを提供しています。","type":"adjective","meaning_category":"単一分野の"},{"sentence":"A unidisciplinary approach may overlook the social implications of technological advancements.","translation":"単一分野のアプローチでは、技術進歩の社会的影響が見過ごされる可能性があります。","type":"adjective","meaning_category":"単一分野の"},{"sentence":"The study adopted a unidisciplinary lens, analyzing the data from a purely sociological perspective.","translation":"その研究は単一分野のレンズを採用し、データを純粋に社会学的視点から分析しました。","type":"adjective","meaning_category":"単一分野の"}]}