{"word":"antiphonary","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"聖歌集、交唱詩篇集","english_definition":"a book containing the antiphons, responsories, and other chants sung in the Roman Catholic Church Office.","examples":[{"sentence":"The monks chanted from the antiphonary.","translation":"修道士たちは聖歌集から聖歌を唱えた。"},{"sentence":"The antiphonary was beautifully illuminated.","translation":"その聖歌集は美しく彩飾されていた。"}],"collocations":["illuminated antiphonary","medieval antiphonary"],"synonyms":["antiphonal","chant book"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from medieval Latin antiphonarius, from late Latin antiphona (see antiphon).","priority":"★★☆"},"pronunciation":{"ipa":"/ænˈtɪfənəri/","syllables":"an-ti-pho-na-ry"},"inflection":{"noun_plural":"antiphonaries"},"usage_notes":{"explanation":"An antiphonary is a liturgical book used in the Roman Catholic Church and some other Western Christian traditions. It contains the musical settings for the portions of the Divine Office (also known as the Liturgy of the Hours) that are sung by the choir, such as antiphons, responsories, and other chants. These books were often large and beautifully decorated, especially in the medieval period.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used the antiphony to sing.","correct":"✓ He used the antiphonary to sing.","note":"'Antiphony' is the style of singing, 'antiphonary' is the book."}],"priority":"★☆☆"},"related_words":{"derivatives":["antiphon","antiphonal"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"antiphonary\" refers to a specialized liturgical book primarily used within certain Christian traditions, particularly the Roman Catholic Church. It contains the chants and musical settings necessary for the performance of the Divine Office or Liturgy of the Hours. Due to its specific religious context and limited application outside of liturgical studies and musicology, the term is not commonly encountered in general usage."},"example_sentences":[{"sentence":"The scholar studied the ancient antiphonary to understand the musical practices of the medieval monastery.","translation":"学者は中世の修道院の音楽慣習を理解するために、古代の聖歌集を研究した。","type":"noun","meaning_category":"聖歌集"},{"sentence":"The choir carefully followed the notation in the antiphonary during the service.","translation":"聖歌隊は礼拝中、聖歌集の楽譜を注意深く追った。","type":"noun","meaning_category":"聖歌集"}]}