{"word":"nonmaterialistic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"物質主義的でない、物質的なものに価値を置かない","english_definition":"Not excessively concerned with material possessions; valuing spiritual or intellectual pursuits over material wealth.","examples":[{"sentence":"She leads a nonmaterialistic lifestyle, focusing on experiences rather than things.","translation":"彼女は物質的なものよりも経験を重視する、非物質主義的なライフスタイルを送っている。"},{"sentence":"They chose a nonmaterialistic wedding, emphasizing the commitment rather than lavish decorations.","translation":"彼らは豪華な装飾よりも誓約を重視する、非物質主義的な結婚式を選んだ。"},{"sentence":"His nonmaterialistic philosophy emphasizes the importance of inner peace and personal growth.","translation":"彼の非物質主義的な哲学は、心の平和と自己成長の重要性を強調している。"}],"collocations":["nonmaterialistic lifestyle","nonmaterialistic values","nonmaterialistic approach","nonmaterialistic philosophy","nonmaterialistic society"],"synonyms":["unmaterialistic","spiritual","idealistic","ascetic","altruistic"],"antonyms":["materialistic","consumerist","worldly","greedy","avaricious"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'materialistic'. 'Materialistic' itself comes from 'material', which refers to physical matter or possessions.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnməˌtɪəriəˈlɪstɪk/","syllables":"non-ma-te-ri-al-is-tic"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Nonmaterialistic' describes a person, lifestyle, or philosophy that prioritizes non-physical aspects of life, such as relationships, experiences, personal growth, and spirituality, over the accumulation of material possessions. It often implies a conscious rejection of consumer culture and a focus on simpler, more meaningful ways of living.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very non-material person.","correct":"✓ He is a very nonmaterialistic person.","note":"Although 'non-material' can be used, 'nonmaterialistic' is the more common and specific term to describe someone who isn't focused on material possessions."},{"incorrect":"✗ They live in a nonmaterial house.","correct":"✓ They live a nonmaterialistic lifestyle.","note":"'Nonmaterialistic' typically describes a lifestyle, values, or philosophy, not a physical object like a house. You could say they live in a simple or modest house."}],"priority":"★★☆"},"related_words":{"derivatives":["nonmaterialism (noun)"],"related_concepts":["minimalism","voluntary simplicity","asceticism","spiritualism","anti-consumerism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but understood in academic and philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonmaterialistic' is a more advanced term that describes someone who doesn't place a high value on possessions or wealth. It's often used in discussions about philosophy, lifestyle choices, or societal values. You'll likely encounter this word in more sophisticated texts or conversations about living a simpler, more meaningful life. It's the opposite of being 'materialistic', which means being very interested in money and possessions."},"example_sentences":[{"sentence":"Their nonmaterialistic values led them to donate a large portion of their income to charity.","translation":"彼らの非物質主義的な価値観は、収入の大部分を慈善団体に寄付することにつながった。","type":"adjective","meaning_category":"values"},{"sentence":"She found happiness in her nonmaterialistic pursuits, such as painting and hiking.","translation":"彼女は絵を描いたりハイキングをしたりする、非物質主義的な活動に幸せを見出した。","type":"adjective","meaning_category":"pursuits"},{"sentence":"The book explores the benefits of adopting a more nonmaterialistic approach to life.","translation":"その本は、より非物質主義的な生き方を取り入れることの利点を探求している。","type":"adjective","meaning_category":"approach"}]}