{"word":"indigestibly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"消化しにくい状態で、消化不良を起こしやすい状態で","english_definition":"in a way that is difficult to digest; in a manner that causes indigestion.","examples":[{"sentence":"The food was prepared indigestibly, causing many guests to feel unwell.","translation":"その料理は消化しにくいように調理されており、多くの客が気分を悪くした。"},{"sentence":"He ate the rich dessert indigestibly, and later regretted it.","translation":"彼はその濃厚なデザートを消化しにくい状態で食べ、後で後悔した。"}],"collocations":["prepared indigestibly","eaten indigestibly"],"synonyms":["heavily","richly","unwholesomely"],"antonyms":["digestibly","lightly","wholesomely"]}],"etymology":{"value":"Formed from 'indigestible' + '-ly'. 'Indigestible' comes from 'in-' (not) + 'digestible' (able to be digested).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪndɪˈdʒɛstəbli/","syllables":"in-di-gest-i-bly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Indigestibly' describes the manner in which food is prepared or eaten that makes it difficult to digest, often leading to discomfort or illness. It emphasizes the quality of being hard to process by the digestive system.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The information was presented indigestibly, so no one understood it.","correct":"✓ The information was presented in an indigestible manner, so no one understood it. / ✓ The information was presented unclearly, so no one understood it.","note":"'Indigestibly' typically refers to food or substances that are physically difficult to digest. For abstract concepts like information, use 'in an indigestible manner' or a more appropriate word like 'unclearly' or 'incomprehensibly'."}],"priority":"★☆☆"},"related_words":{"derivatives":["indigestible (adjective)","indigestion (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'indigestibly' is a relatively uncommon adverb that describes something done in a way that makes it difficult to digest. It's often used in the context of food preparation or eating habits that lead to digestive discomfort. Because it's not a frequently used word, it's more likely to be encountered in advanced texts or specialized discussions about food and health."},"example_sentences":[{"sentence":"The fried food was cooked indigestibly, leaving a greasy residue.","translation":"その揚げ物は消化しにくいように調理されており、油っぽい残留物を残した。","type":"general"},{"sentence":"He consumed the spicy dish indigestibly, resulting in a stomach ache.","translation":"彼はその辛い料理を消化しにくい状態で摂取し、その結果、腹痛になった。","type":"general"}]}