{"word":"Oestradiol","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"エストラジオール（卵胞ホルモンの一種）","english_definition":"A major estrogen produced primarily in the ovaries; it plays a key role in the development and maintenance of female reproductive tissues and secondary sexual characteristics.","examples":[{"sentence":"Oestradiol levels fluctuate throughout the menstrual cycle.","translation":"エストラジオールのレベルは月経周期を通して変動する。"},{"sentence":"Oestradiol is used in hormone replacement therapy.","translation":"エストラジオールはホルモン補充療法で使用される。"}],"collocations":["oestradiol level","oestradiol patch","oestradiol production","hormone replacement therapy (HRT)"],"synonyms":["estradiol","E2","17β-estradiol"],"antonyms":[]}],"etymology":{"value":"Derived from 'oestro-' (referring to oestrus, the period of sexual receptivity in female mammals) and '-diol' (indicating a chemical compound with two hydroxyl groups).","priority":"★★☆"},"pronunciation":{"ipa":"ˌiːstrəˈdaɪɒl","syllables":"Ees-tra-dye-ol"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Oestradiol is a crucial hormone in female reproductive health, influencing various physiological processes. It is also used in medical treatments related to hormone deficiencies or imbalances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor prescribed estriol instead of oestradiol.","correct":"✓ The doctor prescribed oestradiol.","note":"Estriol and oestradiol are different estrogens with different potencies and uses. Ensure the correct hormone is specified."}],"priority":"★☆☆"},"related_words":{"derivatives":["oestrogen","estrogen receptor","hormone"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Oestradiol is a technical term primarily encountered in medical or scientific contexts. Understanding its role requires knowledge of reproductive biology and endocrinology.","priority":"★★☆"},"example_sentences":[{"sentence":"The blood test revealed low oestradiol levels.","translation":"血液検査でエストラジオールのレベルが低いことがわかった。","type":"general","meaning_category":"medical"},{"sentence":"Oestradiol is essential for bone health in women.","translation":"エストラジオールは女性の骨の健康に不可欠である。","type":"general","meaning_category":"medical"}]}