{"word":"Buphthalmos","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"牛眼、先天性緑内障","english_definition":"Abnormal enlargement of the eyeball, especially in congenital glaucoma.","examples":[{"sentence":"Buphthalmos is a serious condition that can lead to blindness if left untreated.","translation":"牛眼は、治療せずに放置すると失明につながる可能性のある深刻な状態です。"}],"collocations":[],"synonyms":["Hydrophthalmos","牛眼","先天性緑内障"],"antonyms":[]}],"etymology":{"value":"From Greek 'bous' (ox) + 'ophthalmos' (eye), referring to the enlarged appearance of the eye resembling that of an ox.","priority":"★★★"},"pronunciation":{"ipa":"/bʊfˈθælməs/","syllables":"buf-THAL-mos"},"inflection":{"noun_plural":"Buphthalmoses"},"usage_notes":{"explanation":"Buphthalmos, also known as congenital glaucoma or hydrophthalmos, is characterized by an abnormal enlargement of the eye, typically occurring in infants and young children. The condition results from increased intraocular pressure due to malformation or dysfunction of the eye's drainage system.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has buphthalmos in one ears.","correct":"✓ He has buphthalmos in one eye.","note":"Buphthalmos affects the eyes, not the ears."}],"priority":"★★☆"},"related_words":{"derivatives":["Buphthalmic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Buphthalmos is a medical term referring to the abnormal enlargement of the eyeball, typically associated with congenital glaucoma. It is a relatively rare condition primarily affecting infants and young children. Understanding this term requires a background in medical terminology. "},"example_sentences":[{"sentence":"Early diagnosis of buphthalmos is crucial to prevent vision loss.","translation":"視力喪失を防ぐためには、牛眼の早期診断が重要です。","type":"general","meaning_category":"general"},{"sentence":"The infant presented with symptoms of buphthalmos, including an enlarged cornea and increased intraocular pressure.","translation":"その乳児は、角膜の肥大や眼圧の上昇など、牛眼の症状を呈していました。","type":"clinical","meaning_category":"clinical"}]}