{"word":"perilymph","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"外リンパ","english_definition":"The fluid contained in the bony labyrinth of the inner ear.","examples":[{"sentence":"The perilymph fills the space between the membranous and bony labyrinths of the inner ear.","translation":"外リンパは内耳の膜迷路と骨迷路の間の空間を満たしている。"},{"sentence":"Changes in perilymph pressure can affect hearing and balance.","translation":"外リンパの圧力の変化は、聴覚と平衡感覚に影響を与える可能性がある。"}],"collocations":["perilymph fistula","perilymphatic space","cochlear perilymph","vestibular perilymph"],"synonyms":["extracellular fluid of inner ear"],"antonyms":[]}],"etymology":{"value":"From the Greek 'peri' (around) and 'lymph' (lymph).","priority":"★★★"},"pronunciation":{"ipa":"/ˈperɪlɪmf/","syllables":"per-i-lymph"},"inflection":{"noun_plural":"perilymphs"},"usage_notes":{"explanation":"Perilymph is a specialized extracellular fluid found in the inner ear. It is similar in composition to extracellular fluid and cerebrospinal fluid. It plays a crucial role in the transmission of sound vibrations and the maintenance of balance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The perilymph is in the middle ear.","correct":"✓ The perilymph is in the inner ear.","note":"Perilymph is located in the inner ear, not the middle ear."}],"priority":"★★☆"},"related_words":{"derivatives":["endolymph","inner ear","cochlea","vestibule"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Perilymph' is a technical term related to the anatomy and physiology of the inner ear. It refers to the fluid found within the bony labyrinth of the inner ear, specifically in the space between the bony and membranous labyrinths. Understanding this term requires knowledge of human anatomy and physiology, particularly the structure and function of the inner ear. It is not commonly used in everyday language.","priority":"★★★"},"example_sentences":[{"sentence":"A perilymph fistula can cause vertigo and hearing loss.","translation":"外リンパ瘻は、めまいや難聴を引き起こす可能性がある。","type":"medical context","meaning_category":"fluid in inner ear"},{"sentence":"The composition of perilymph is similar to that of extracellular fluid.","translation":"外リンパの組成は、細胞外液の組成と類似している。","type":"scientific context","meaning_category":"fluid in inner ear"}]}