{"word":"reflexibility","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"再帰性、反射性、自己言及性","english_definition":"The quality or state of being reflexive; the property of being able to be applied to itself; self-reference.","examples":[{"sentence":"The reflexibility of the concept allows it to be applied to itself.","translation":"その概念の再帰性により、その概念自体に適用できる。"},{"sentence":"The author explores the reflexibility of language in his novel.","translation":"その作家は小説の中で言語の自己言及性を探求している。"},{"sentence":"Reflexibility is a key characteristic of postmodern thought.","translation":"再帰性はポストモダン思想の重要な特徴である。"}],"collocations":["exhibit reflexibility","demonstrate reflexibility","explore reflexibility","analyze reflexibility","consider reflexibility"],"synonyms":["self-reference","self-application","circularity","recursion","recursive property"],"antonyms":["irreflexivity","externality","objectivity"]}],"etymology":{"value":"Derived from 'reflexible,' which comes from the Latin 'reflexus' (past participle of 'reflectere,' meaning 'to bend back'). The suffix '-ity' is added to form a noun denoting a quality or state.","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːflɛksɪˈbɪləti/","syllables":"re-flex-i-bil-i-ty"},"inflection":{"noun_plural":"reflexibilities"},"usage_notes":{"explanation":"'Reflexibility' refers to the ability of something to refer back to itself or to be applied to itself. It is often used in philosophical, mathematical, and linguistic contexts. It is closely related to concepts like self-reference, recursion, and circularity. In social sciences, it can also refer to the way our understanding of the world shapes the world itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reflexibility of the mirror.","correct":"✓ The reflectivity of the mirror.","note":"'Reflexibility' is not typically used to describe the property of a mirror. 'Reflectivity' is more appropriate in that context."},{"incorrect":"✗ He showed great reflexibility in his actions.","correct":"✓ He showed great flexibility in his actions.","note":"'Reflexibility' should not be confused with 'flexibility,' which refers to adaptability or the ability to change."}],"priority":"★★☆"},"related_words":{"derivatives":["reflexible","reflexive","reflect","reflection","reflective"],"related_concepts":["self-reference","recursion","circularity","feedback loop","Gödel's incompleteness theorems","postmodernism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reflexibility' is a relatively advanced term often encountered in academic contexts, particularly in philosophy, mathematics, and social sciences. It describes the capacity of a concept or system to refer back to itself or to be applied to itself. Understanding this term requires familiarity with abstract thinking and related concepts such as self-reference and recursion. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The theory's reflexibility allows for continuous self-critique and improvement.","translation":"その理論の再帰性により、継続的な自己批判と改善が可能になる。","type":"general","meaning_category":"Self-reference"},{"sentence":"The reflexibility of social research means that the act of studying society can change it.","translation":"社会調査の再帰性とは、社会を研究する行為自体が社会を変える可能性があるということである。","type":"social sciences","meaning_category":"Self-reference"},{"sentence":"The artist explored the reflexibility of the medium by creating works that commented on their own creation.","translation":"その芸術家は、作品の制作自体についてコメントする作品を制作することで、媒体の再帰性を探求した。","type":"art","meaning_category":"Self-reference"}]}