{"word":"panner","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(鉱業)選鉱鍋を使う人、選鉱者","english_definition":"A person who uses a pan to wash gravel or other material in a search for gold or other valuable minerals.","examples":[{"sentence":"The old panner spent his days by the river, hoping to strike it rich.","translation":"その老いた選鉱者は、一攫千金を夢見て川辺で日々を過ごした。"},{"sentence":"Panners often work in remote areas, far from civilization.","translation":"選鉱者は文明から遠く離れた僻地で働くことが多い。"}],"collocations":["gold panner","river panner","experienced panner"],"synonyms":["gold miner","prospector","miner"],"antonyms":[]},{"part_of_speech":"noun","definition":"(写真・映画)パニングを行う人、カメラを水平方向に動かす人","english_definition":"A person who operates a camera in a panning motion.","examples":[{"sentence":"The panner followed the race car as it sped around the track.","translation":"カメラマンはレースカーがトラックを疾走するのに合わせてカメラを水平方向に動かした。"},{"sentence":"A skilled panner can create a dynamic sense of motion in a still image.","translation":"熟練したカメラマンは、静止画に躍動感を生み出すことができる。"}],"collocations":["camera panner","film panner","video panner"],"synonyms":["cameraman","camera operator","videographer"],"antonyms":[]}],"etymology":{"value":"The word 'panner' is derived from the verb 'to pan,' referring to the act of using a pan for washing materials in mining or operating a camera in a panning motion.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpænər/","syllables":"pan-ner"},"inflection":{"noun_plural":"panners"},"usage_notes":{"explanation":"The term 'panner' has two primary meanings, one related to mining and the other to photography/videography. In mining, a panner is someone who uses a pan to search for valuable minerals. In photography and film, a panner is someone who performs a panning motion with a camera to follow a moving subject or create a wide panoramic view.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good paner.","correct":"✓ He is a good panner.","note":"The correct spelling for the person who pans is 'panner,' with two 'n's."}],"priority":"★★☆"},"related_words":{"derivatives":["pan (verb, noun)","panning (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'panner' has two main meanings. One is related to mining, where it refers to someone who uses a pan to look for gold or other valuable minerals. The other is related to photography or filmmaking, where it refers to someone who moves a camera horizontally to follow a moving object or create a wide view. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"example_sentences":[{"sentence":"The gold **panner** carefully swirled the water in his pan.","translation":"その金の選鉱者は注意深く鍋の水を渦巻かせた。","type":"noun","meaning_category":"鉱業"},{"sentence":"The **panner** kept the camera focused on the athlete as she ran the race.","translation":"カメラマンはアスリートがレースを走る間、カメラの焦点を合わせ続けた。","type":"noun","meaning_category":"写真・映画"}]}