{"word":"rooflight","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"天窓、屋根窓","english_definition":"A window set into a roof or ceiling, designed to admit light.","examples":[{"sentence":"The new rooflight made the room much brighter.","translation":"新しい天窓のおかげで部屋がずっと明るくなった。"},{"sentence":"We installed a rooflight in the attic to create a more usable space.","translation":"屋根裏部屋にもっと使いやすい空間を作るために、天窓を設置した。"}],"collocations":["install a rooflight","replace a rooflight","clean a rooflight","a large rooflight","a small rooflight"],"synonyms":["skylight","roof window"],"antonyms":[]}],"etymology":{"value":"'Roof' + 'light'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈruːflaɪt/","syllables":"roof-light"},"inflection":{"noun_plural":"rooflights"},"usage_notes":{"explanation":"'Rooflight' and 'skylight' are often used interchangeably, but 'rooflight' may sometimes refer to a more general term, including windows that are flush with the roof surface, while 'skylight' may refer to a raised window structure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a roof light on the roof.","correct":"✓ I saw a rooflight on the roof.","note":"'Roof light' (two words) can be understood, but 'rooflight' (one word) is the standard term."}],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"B2","text":"The word 'rooflight' refers to a window specifically designed to be installed in a roof. It's a compound word, combining 'roof' and 'light', making its meaning relatively straightforward. While not an extremely common word, it's frequently used in construction, architecture, and home improvement contexts. Understanding this term can be helpful for describing or discussing building features."},"example_sentences":[{"sentence":"The architect designed the building with several rooflights to maximize natural light.","translation":"建築家は自然光を最大限に取り入れるために、いくつかの天窓を建物に設計した。","type":"noun","meaning_category":"天窓"},{"sentence":"The rooflight provided ample light for the plants in the conservatory.","translation":"天窓は温室の植物に十分な光を与えた。","type":"noun","meaning_category":"天窓"}]}