{"word":"Sabbath-profaning","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"Desecrating or violating the Sabbath; failing to observe the Sabbath in a religiously appropriate manner.","english_definition":"Desecrating or violating the Sabbath; failing to observe the Sabbath in a religiously appropriate manner.","examples":[{"sentence":"The Puritans considered many activities to be Sabbath-profaning, such as working or engaging in recreation.","translation":"ピューリタンは、労働や娯楽など、多くの活動を安息日を汚すものと見なしていました。"},{"sentence":"In some strict religious communities, even reading a newspaper on Sunday is considered Sabbath-profaning.","translation":"一部の厳格な宗教コミュニティでは、日曜日に新聞を読むことさえ安息日を汚す行為と見なされます。"}],"collocations":["Sabbath-profaning activities","Sabbath-profaning behavior"],"synonyms":["desecrating the Sabbath","violating the Sabbath","unholy"],"antonyms":["Sabbath-observing","holy","reverent"],"cultural_note":"The Sabbath is a day of rest and worship in Judaism and Christianity. Traditionally, it is observed from Friday evening to Saturday evening in Judaism, and on Sunday in Christianity. Sabbath-profaning refers to actions that violate the religious rules and customs associated with the Sabbath.","usage_notes":"This term is often used in historical or religious contexts to describe behaviors considered unacceptable by strict religious observers. It carries a negative connotation.","etymology":{"value":"Combines 'Sabbath' (a day of religious observance and rest) with 'profaning' (treating something sacred with irreverence or contempt).","priority":"medium"},"pronunciation":{"ipa":"/ˈsæbəθ prəˌfeɪnɪŋ/","syllables":"Sab-bath-pro-fan-ing"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms."},"level_frequency":{"frequency_google_ngram":"Low frequency","CEFR":"C2"},"readability_explanation":{"level":"C1","text":"The term 'Sabbath-profaning' is relatively uncommon and specific to religious contexts, particularly those discussing the observance of the Sabbath. Understanding requires familiarity with the concept of the Sabbath and the act of profaning something sacred. It is more likely to be encountered in theological discussions, historical texts about religious practices, or literature that explores religious themes."},"example_sentences":[{"sentence":"The town elders accused him of Sabbath-profaning by operating his shop on Sunday.","translation":"町の長老たちは、彼が日曜日に店を営業することで安息日を汚していると非難した。","type":"adjective","meaning_category":"desecrating the Sabbath"},{"sentence":"The sermon condemned Sabbath-profaning behavior and urged congregants to dedicate the day to prayer and reflection.","translation":"説教は安息日を汚す行為を非難し、信者にその日を祈りと内省に捧げるよう促した。","type":"adjective","meaning_category":"violating the Sabbath"}]}]}