{"word":"tendenciously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"偏向的に、特定の意図を持って、誘導的に","english_definition":"in a way that shows a strong bias or inclination towards a particular point of view; in a manner intended to promote a particular cause or viewpoint, often unfairly or misleadingly.","examples":[{"sentence":"The article was written tendenciously, presenting only one side of the argument.","translation":"その記事は偏向的に書かれており、議論の一方の側面しか提示していなかった。"},{"sentence":"He spoke tendenciously about the issue, clearly trying to sway the audience's opinion.","translation":"彼はその問題について偏向的に話し、明らかに聴衆の意見を左右しようとしていた。"},{"sentence":"The evidence was presented tendenciously to support their claim.","translation":"証拠は彼らの主張を支持するために偏向的に提示された。"}],"collocations":["argue tendenciously","present information tendenciously","write tendenciously","speak tendenciously"],"synonyms":["biasedly","prejudicially","partially","slantingly","subjectively","unfairly","dishonestly","provocatively","suggestively","obliquely"],"antonyms":["impartially","objectively","fairly","honestly","neutrally","unbiasedly","disinterestedly"]}],"etymology":{"value":"Derived from the adjective 'tendencious,' which comes from the German 'tendenziös' (tendentious), from 'Tendenz' (tendency), from the Latin 'tendere' (to stretch, aim, tend).","priority":"★★☆"},"pronunciation":{"ipa":"/tɛnˈdɛnʃəsli/","syllables":"ten-den-cious-ly (4 syllables)"},"inflection":{"notes":"Adverb - no inflection"},"usage_notes":{"explanation":"'Tendenciously' describes the manner in which something is done or presented. It implies that the information, argument, or presentation is slanted or biased in a way that promotes a particular viewpoint, often at the expense of fairness or objectivity. It suggests an intention to influence or persuade the audience towards a specific conclusion, rather than presenting a balanced or neutral perspective. The term often carries a negative connotation, implying a lack of integrity or honesty in the presentation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He tendenciously argued for the truth.","correct":"✓ He argued tendenciously for his preferred outcome.","note":"'Tendenciously' implies bias, so it's usually not used with concepts like 'truth,' which suggest objectivity. It's more appropriate when the goal is to promote a specific outcome or viewpoint. "},{"incorrect":"✗ The report was tendentious, so it was very objective.","correct":"✓ The report was tendentious, so it lacked objectivity.","note":"'Tendentious' and 'objective' are antonyms. A tendentious report is, by definition, not objective."}],"priority":"★★☆"},"related_words":{"derivatives":["tendency (noun): an inclination or predisposition towards something","tendencious (adjective): expressing or intending to promote a particular point of view, especially a controversial one","tend (verb): to be directed or inclined; to take care of"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tendenciously' means doing something in a way that shows a strong bias or slant towards a particular viewpoint. It suggests that someone is presenting information or arguing in a way that is designed to persuade you to agree with them, rather than giving you a fair and balanced view. This word is often used in discussions about politics, media, or any situation where someone might be trying to influence your opinion unfairly.","example_sentences":[{"sentence":"The documentary presented the issue tendenciously, ignoring alternative perspectives.","translation":"そのドキュメンタリーはその問題を偏向的に提示し、代替的な視点を無視した。","type":"general"},{"sentence":"The politician spoke tendenciously, exaggerating the benefits of his policies.","translation":"その政治家は偏向的に話し、彼の政策の利点を誇張した。","type":"general"},{"sentence":"The website tendenciously reported the news, favoring one political party over others.","translation":"そのウェブサイトはニュースを偏向的に報道し、他の政党よりも一方の政党を優遇した。","type":"general"}]}}