{"word":"raiiform","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(動物学)エイのような形の、特に胸びれが大きく広がっている魚類について言う","english_definition":"(zoology) Having a shape similar to that of a ray, especially referring to fish with greatly expanded pectoral fins.","examples":[{"sentence":"The angelshark has a raiiform body shape.","translation":"カスザメはエイのような体型をしている。"},{"sentence":"Raiiform locomotion is observed in some batoids.","translation":"エイ型の遊泳様式は一部のガンギエイ類に見られる。"}],"collocations":["raiiform locomotion","raiiform body shape"],"synonyms":["ray-like","batoid"],"antonyms":[]}],"etymology":{"value":"Derived from 'ray' (referring to the fish) and '-iform' (meaning 'having the form of').","priority":"★★★"},"pronunciation":{"ipa":"ˈreɪ.ɪ.fɔːrm","syllables":"ray-i-form"},"inflection":{"notes":"Does not inflect (only used as an adjective)."},"usage_notes":{"explanation":"The term 'raiiform' is primarily used in zoology and ichthyology to describe the body shape or swimming style of certain fish, particularly those in the superorder Batoidea (rays and skates) or fish that have evolved a similar body plan. It emphasizes the flattened body and expanded pectoral fins that resemble the wings of a ray.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fish was raiiforming through the water.","correct":"✓ The fish was swimming with raiiform locomotion.","note":"'Raiiform' is an adjective, not a verb. Use it to describe a characteristic, not an action directly."}],"priority":"★★☆"},"related_words":{"derivatives":["Batoidea (superorder including rays and skates)","pectoral fin"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'raiiform' is a technical term used in zoology to describe a specific body shape or mode of locomotion in fish. It is unlikely to be encountered outside of scientific or academic contexts related to fish biology. Understanding requires familiarity with zoological terminology and the anatomy of fish, particularly rays and related species."},"example_sentences":[{"sentence":"The fossil record shows examples of fish that evolved raiiform characteristics independently.","translation":"化石記録には、エイ型の特徴を独自に進化させた魚の例が示されている。","type":"descriptive","meaning_category":"shape"},{"sentence":"Raiiform swimming allows for efficient maneuvering in benthic environments.","translation":"エイ型の遊泳は、底生環境での効率的な操縦を可能にする。","type":"functional","meaning_category":"locomotion"}]}