{"word":"skimmington","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的) スキミントン乗り、またはスキミントン行列：不道徳または家庭内不和の罪で告発された人々を嘲笑するために行われる騒々しい行列。通常、罪を犯したとされる人物またはその人物を模した人形を乗せた馬車や荷車が、騒音を立てながら村を練り歩く。","english_definition":"(historical) A skimmington ride or skimmington procession: a noisy procession made to ridicule people accused of immorality or domestic discord, typically involving the parading through a village of the alleged offender or an effigy of them on a horse or cart, accompanied by much noise.","examples":[{"sentence":"The skimmington was a common form of social shaming in pre-industrial England.","translation":"スキミントン乗りは、産業革命以前のイングランドでは一般的な社会的恥辱の形でした。"},{"sentence":"The effigy in the skimmington was meant to represent the henpecked husband.","translation":"スキミントン乗りで使用される人形は、尻に敷かれた夫を表現することを意図していました。"},{"sentence":"Villagers would participate in the skimmington, making loud noises with pots and pans.","translation":"村人たちはスキミントン乗りに行列に参加し、鍋やフライパンで大きな音を立てました。"}],"collocations":["skimmington ride","skimmington procession","effigy in a skimmington","participate in a skimmington"],"synonyms":["charivari","rough music","huzzaing","riding the stang"],"antonyms":[]}],"etymology":{"value":"語源は不明確だが、おそらく「skimming ladle」（お玉）または「skimmington ladle」という言葉に関連していると考えられている。これは、騒々しい行列で使用される道具の一つであった可能性がある。また、「skim」という動詞（表面をすくい取る）に関連し、表面的な不正を暴くという意味合いを持つ可能性もある。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskɪmɪŋtən/","syllables":"skim-ming-ton"},"inflection":{"noun_plural":"skimmingtons"},"usage_notes":{"explanation":"「skimmington」は歴史的な用語であり、現代英語ではほとんど使用されません。主に、歴史、社会学、民俗学の研究において見られます。この言葉は、過去の社会における社会的統制と公的な恥辱の形態を理解する上で重要です。","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常にまれな単語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**skimmington**」は、現代英語ではほとんど使われない歴史的な単語です。この言葉は、過去の社会における公的な恥辱と社会的統制の形態を指します。歴史的な文脈や、社会学、民俗学の研究において遭遇する可能性があります。理解するには、当時の社会慣習や価値観に関する知識が必要です。"},"example_sentences":[{"sentence":"The local historian described a skimmington that took place in the village in the 18th century.","translation":"地元の歴史家は、18世紀にその村で行われたスキミントン乗りについて説明しました。","type":"noun","meaning_category":"スキミントン乗り"},{"sentence":"The skimmington was intended to publicly shame those who violated community norms.","translation":"スキミントン乗りは、共同体の規範を破った人々を公に恥をかかせることを目的としていました。","type":"noun","meaning_category":"スキミントン乗り"},{"sentence":"The noise of the skimmington procession echoed through the streets.","translation":"スキミントン行列の騒音が通りに響き渡りました。","type":"noun","meaning_category":"スキミントン乗り"}]}