{"word":"Porcellanid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A member of the crab family Porcellanidae, also known as porcelain crabs.","english_definition":"Any crab of the family Porcellanidae, characterized by their flattened bodies and porcelain-like exoskeletons.","examples":[{"sentence":"The tide pool was teeming with small creatures, including several porcellanids clinging to the rocks.","translation":"その潮だまりは、岩にしがみついている数匹のporcellanid（カニ）を含む、小さな生き物でいっぱいだった。"}],"collocations":["porcelain crab","intertidal porcellanid","filter-feeding porcellanid"],"synonyms":["porcelain crab"],"antonyms":[]}],"etymology":{"value":"Derived from the family name Porcellanidae, which comes from the Latin 'porcellanus' meaning 'porcelain-like', referring to the smooth, pale exoskeleton of these crabs.","priority":"★★☆"},"pronunciation":{"ipa":"/pɔːrsəˈlænɪd/","syllables":"por-cel-la-nid"},"inflection":{"noun_plural":"Porcellanids"},"usage_notes":{"explanation":"'Porcellanid' is a relatively specific term used in marine biology and zoology. It refers to a particular family of crabs, not just any crab with a smooth exoskeleton. The term 'porcelain crab' is more commonly used in general contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a porcellanid on the beach, it was very big.","correct":"✓ I saw a crab on the beach, it was very big.","note":"Porcellanids are typically small, so describing one as 'very big' might be inaccurate. It's better to simply say 'crab' if the size is notable."}],"priority":"★☆☆"},"related_words":{"derivatives":["Porcellanidae (family name)","Porcelain crab"],"phrases":[]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'porcellanid' is a scientific term used to refer to crabs belonging to the family Porcellanidae. These crabs are often called 'porcelain crabs' due to their smooth, pale exoskeletons. The term is primarily used in scientific or technical contexts related to marine biology. General audiences are more likely to use the term 'porcelain crab'."},"example_sentences":[{"sentence":"Researchers studied the distribution of intertidal porcellanids in the rocky shore ecosystem.","translation":"研究者たちは、岩の多い海岸生態系における潮間帯のporcellanid（カニ）の分布を研究した。","type":"noun","meaning_category":"marine biology"},{"sentence":"The aquarium featured a diverse collection of crustaceans, including several species of porcellanids.","translation":"水族館には、いくつかの種のporcellanid（カニ）を含む、多様な甲殻類のコレクションが展示されていた。","type":"noun","meaning_category":"zoology"}]}