{"word":"pyrrhotist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who practices or believes in Pyrrhonism; a philosophical skeptic.","english_definition":"A follower of Pyrrho of Elis; one who doubts the possibility of real knowledge of any kind.","examples":[{"sentence":"The professor was known as a pyrrhotist, always questioning the assumptions of his colleagues.","translation":"その教授はピュロン主義者として知られており、常に同僚の前提に疑問を呈していた。"}],"collocations":["philosophical pyrrhotist","academic pyrrhotist"],"synonyms":["skeptic","doubter","agnostic"],"antonyms":["dogmatist","believer","assertor"]},{"part_of_speech":"noun","definition":"Someone who is habitually skeptical or doubtful.","english_definition":"A person characterized by persistent skepticism or doubt.","examples":[{"sentence":"He was such a pyrrhotist that he never believed anything anyone told him.","translation":"彼は非常に懐疑的な人だったので、誰もが彼に言ったことを決して信じなかった。"}],"collocations":["habitual pyrrhotist","chronic pyrrhotist"],"synonyms":["cynic","pessimist","disbeliever"],"antonyms":["optimist","trusting person"]}],"etymology":{"value":"Derived from 'Pyrrho', the name of the Greek philosopher, and the suffix '-ist', indicating a follower or believer.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪrəˌtɪst/","syllables":"pyr-rho-tist"},"inflection":{"noun_plural":"pyrrhotists"},"usage_notes":{"explanation":"The term 'pyrrhotist' refers to someone who adheres to Pyrrhonism, a school of philosophical skepticism founded by Pyrrho of Elis. Pyrrhonists suspend judgment on all matters of belief, arguing that it is impossible to attain certainty. The term can also be used more broadly to describe someone who is generally skeptical or doubtful.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pyrrhotic.","correct":"✓ He is a pyrrhotist.","note":"The correct term for a follower of Pyrrho is 'pyrrhotist', not 'pyrrhotic'."}],"priority":"★★☆"},"related_words":{"derivatives":["Pyrrhonism (noun: the philosophical doctrine of Pyrrho)","Pyrrhonian (adjective: relating to Pyrrho or Pyrrhonism; noun: a follower of Pyrrho)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pyrrhotist' is a relatively uncommon term referring to a follower of Pyrrho, a Greek philosopher known for his skepticism. It is primarily used in philosophical contexts to describe someone who doubts the possibility of attaining certain knowledge and suspends judgment on matters of belief. Due to its specialized usage, it is more likely to be encountered in academic or philosophical discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"As a dedicated pyrrhotist, she questioned every claim made by the politicians.","translation":"熱心なピュロン主義者として、彼女は政治家によってなされたすべての主張に疑問を呈した。","type":"noun","meaning_category":"philosophical skeptic"},{"sentence":"The journalist's pyrrhotist approach made him an excellent investigative reporter.","translation":"そのジャーナリストの懐疑的なアプローチは、彼を優れた調査報道記者にした。","type":"noun","meaning_category":"habitually skeptical"}]}