{"word":"Funch","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Rare) A variant spelling of 'punch', referring to a drink made with fruit juice, spices, and alcohol.","english_definition":"(Rare) An archaic or variant spelling of 'punch', a beverage typically made with fruit juices, spices, and alcohol.","examples":[{"sentence":"They served Funch at the party, a delightful concoction of rum and citrus.","translation":"彼らはパーティーでファンチを出した。ラムと柑橘系の楽しい混合物だった。"}],"collocations":["serve Funch","make Funch","a bowl of Funch"],"synonyms":["punch (drink)"],"antonyms":[]}],"etymology":{"value":"Likely a misspelling or archaic variant of 'punch', influenced by dialectal pronunciation. 'Punch' itself comes from Hindi 'panch', meaning 'five', referring to the original number of ingredients.","priority":"★☆☆"},"pronunciation":{"ipa":"/fʌntʃ/","syllables":"Funch"},"inflection":{"noun_plural":"Funches"},"usage_notes":{"explanation":"'Funch' is an extremely rare spelling variant of 'punch' (the drink). It is not in common use and may be considered archaic or a misspelling. If you intend to refer to the alcoholic beverage, 'punch' is the standard and preferred spelling.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'd like a glass of Funch, please.","correct":"✓ I'd like a glass of punch, please.","note":"'Punch' is the standard spelling for the drink."}],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Funch' is an uncommon and potentially archaic spelling of 'punch' (the drink). It is unlikely to be encountered in modern usage. If you encounter this word, it is safe to assume it refers to the same beverage as 'punch'. However, using 'punch' is always preferable for clarity. This word is more relevant for historical texts or dialectal studies."},"example_sentences":[{"sentence":"The old recipe called for 'Funch', but I used modern punch ingredients.","translation":"古いレシピは「ファンチ」と呼んでいたが、私は現代のパンチの材料を使った。","type":"noun","meaning_category":"drink"}]}