{"word":"supercalender","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(製紙業)スーパーカレンダー、スーパーカレンダー仕上げ機","english_definition":"A machine used in the paper industry to produce a smooth, glossy surface on paper by passing it between rollers under pressure.","examples":[{"sentence":"The paper was given a high-gloss finish using a supercalender.","translation":"その紙はスーパーカレンダーを使って高光沢仕上げが施された。"}],"collocations":["supercalendered paper","glossy paper"],"synonyms":["calender","paper finishing machine"],"antonyms":[]}],"etymology":{"value":"The term 'supercalender' is derived from 'calender', a machine used for smoothing paper, with the prefix 'super-' indicating a higher level of refinement or capability.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərˈkæləndər/","syllables":"su-per-cal-en-der"},"inflection":{"noun_plural":"supercalenders"},"usage_notes":{"explanation":"A supercalender is a specialized machine used in the paper manufacturing process to enhance the surface properties of paper. It typically consists of a series of rollers that apply pressure and heat to the paper, resulting in a smoother, glossier finish. This type of finishing is often used for high-quality printing papers, such as those used in magazines and brochures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The supercalender is used to make paper.","correct":"✓ The supercalender is used to finish paper.","note":"Supercalenders are used for finishing paper, not for making it from raw materials."}],"priority":"★★☆"},"related_words":{"derivatives":["calender","calendaring"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'supercalender' refers to a specialized machine in the paper industry used to create a smooth, glossy finish on paper. It's a technical term primarily encountered in contexts related to paper manufacturing and printing. Understanding this term requires some familiarity with the paper production process.","priority":"★★☆"},"example_sentences":[{"sentence":"The mill invested in a new supercalender to improve the quality of their paper.","translation":"その製紙工場は紙の品質を向上させるために新しいスーパーカレンダーを導入した。","type":"noun","meaning_category":"machine"},{"sentence":"Supercalendered paper is often used for printing high-quality images.","translation":"スーパーカレンダー仕上げの紙は、高品質の画像を印刷するためによく使用される。","type":"adjective (as modifier)","meaning_category":"paper type"}]}