{"word":"untriumphantly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"勝利を収めずに、得意げでなく、誇らしげでなく","english_definition":"In a manner that lacks triumph; not victoriously; without exultation or pride.","examples":[{"sentence":"He completed the task, but did so untriumphantly, knowing it wasn't his best work.","translation":"彼はそのタスクを完了したが、それが自分の最高の出来ではないとわかっていたので、得意げではなかった。"},{"sentence":"She accepted the second-place prize untriumphantly, her disappointment evident.","translation":"彼女は2位の賞を誇らしげでなく受け取った。彼女の失望は明らかだった。"}],"collocations":["accept untriumphantly","complete untriumphantly","finish untriumphantly","walk away untriumphantly"],"synonyms":["dejectedly","disappointedly","unhappily","without fanfare","modestly"],"antonyms":["triumphantly","victoriously","exultantly","proudly","happily"]}],"etymology":{"value":"Derived from the adjective 'untriumphant' (not triumphant) with the addition of the adverbial suffix '-ly'. 'Untriumphant' is formed by adding the prefix 'un-' (not) to 'triumphant'. 'Triumphant' comes from the noun 'triumph', ultimately from Latin 'triumphus'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌntraɪˈʌmfəntli/","syllables":"un-tri-um-phant-ly"},"inflection":{"notes":"Adverbs do not typically inflect. This word does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Untriumphantly' describes the manner in which an action is performed, specifically indicating a lack of triumph, victory, or exultation. It suggests a subdued or even disappointed demeanor, even in situations where one might expect celebration. It is often used to convey a sense of anticlimax or incomplete success.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He untriumphantly won the race.","correct":"✓ He won the race, but untriumphantly.","note":"'Untriumphantly' is an adverb describing *how* something is done, not whether it was done. The first sentence suggests a contradiction. The second clarifies that the winning lacked triumphant emotion."},{"incorrect":"✗ She felt untriumphantly.","correct":"✓ She felt untriumphant.","note":"'Untriumphantly' is an adverb and modifies verbs. 'Untriumphant' is an adjective and modifies nouns or describes a state of being after a linking verb (like 'feel')."}],"priority":"★★☆"},"related_words":{"derivatives":["untriumphant (adjective)","triumphantly (adverb)","triumph (noun/verb)"],"phrases":["accept defeat untriumphantly","leave untriumphantly"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Untriumphantly' is a relatively uncommon word that describes doing something without a sense of victory or pride. It's used to show a lack of celebration or happiness, even when someone might be expected to be triumphant. Understanding this word requires a good grasp of prefixes (un-), suffixes (-ly), and the root word 'triumph'."},"example_sentences":[{"sentence":"The team accepted their consolation prize untriumphantly.","translation":"チームは慰めの賞を誇らしげでなく受け取った。","type":"general","meaning_category":"lacking triumph"},{"sentence":"He walked off the stage untriumphantly after his performance was poorly received.","translation":"彼のパフォーマンスの評判が悪かったため、彼はステージを誇らしげでなく立ち去った。","type":"general","meaning_category":"lacking triumph"},{"sentence":"Although she completed the project, she did so untriumphantly, feeling it could have been better.","translation":"彼女はプロジェクトを完了させたが、もっと良くできたはずだと感じていたので、得意げではなかった。","type":"general","meaning_category":"lacking triumph"}]}