{"word":"spondylosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脊椎症","english_definition":"A degenerative condition of the spine involving osteoarthritis of the vertebral bodies and related joints.","examples":[{"sentence":"Spondylosis is a common cause of neck and back pain.","translation":"脊椎症は首や背中の痛みの一般的な原因です。"},{"sentence":"Treatment for spondylosis may include physical therapy and pain medication.","translation":"脊椎症の治療には、理学療法や鎮痛剤が含まれることがあります。"}],"collocations":["cervical spondylosis (頸椎症)","lumbar spondylosis (腰椎症)","spondylosis deformans (変形性脊椎症)"],"synonyms":["spinal osteoarthritis","degenerative disc disease"],"antonyms":[]}],"etymology":{"value":"From the Greek word 'spondylos' meaning vertebra, and '-osis' denoting a condition or process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌspɒndɪˈloʊsɪs/","syllables":"spon-dy-lo-sis"},"inflection":{"noun_plural":"spondyloses"},"usage_notes":{"explanation":"Spondylosis refers to the general degeneration of the spine, often associated with aging. It can affect various regions of the spine, most commonly the neck (cervical spondylosis) and lower back (lumbar spondylosis). The condition involves the breakdown of cartilage and the formation of bone spurs, leading to pain, stiffness, and sometimes nerve compression.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Spondylosis is always a severe condition.","correct":"✓ Spondylosis can range from mild to severe, with many people experiencing only mild symptoms.","note":"The severity of spondylosis varies greatly among individuals. Some may have minimal symptoms, while others experience significant pain and disability."},{"incorrect":"✗ Spondylosis is curable.","correct":"✓ Spondylosis is a chronic condition that can be managed but not cured.","note":"While the symptoms of spondylosis can be managed with various treatments, the underlying degenerative process is typically irreversible."}],"priority":"★★☆"},"related_words":{"derivatives":["spondylitic (adjective)","spondylolisthesis (noun)","spondylolysis (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Spondylosis' is a medical term referring to the degeneration of the spine. It involves osteoarthritis of the vertebral bodies and related joints. The condition is often age-related and can cause pain and stiffness. While the term itself is specialized, understanding its meaning is relevant in discussions about back and neck pain, especially in older adults.","priority":"★★☆"},"example_sentences":[{"sentence":"The X-ray revealed signs of spondylosis in the cervical spine.","translation":"レントゲン写真で頸椎の脊椎症の兆候が明らかになった。","type":"general","meaning_category":"general"},{"sentence":"Physical therapy can help manage the symptoms of lumbar spondylosis.","translation":"理学療法は腰椎の脊椎症の症状を管理するのに役立つ。","type":"treatment","meaning_category":"treatment"},{"sentence":"Many people with spondylosis experience no symptoms.","translation":"多くの脊椎症患者は症状を経験しない。","type":"symptoms","meaning_category":"symptoms"}]}