{"word":"Amanita","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"テングタケ属","english_definition":"A genus of poisonous mushrooms, including the death cap and destroying angel.","examples":[{"sentence":"The death cap is a species of Amanita.","translation":"ドクツルタケはテングタケ属の一種です。"},{"sentence":"Be careful when foraging for mushrooms; some Amanita species are deadly.","translation":"キノコを採取する際は注意してください。テングタケ属の中には致死的な種も存在します。"}],"collocations":["Amanita mushroom","Amanita species","poisonous Amanita"],"synonyms":["toadstool","mushroom (in a general sense)"],"antonyms":[]}],"etymology":{"value":"Derived from Ancient Greek ἀμανίτης (amanítēs), referring to mushrooms from the Amanus Mountains (modern-day Nur Mountains) in Cilicia.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæməˈnaɪtə/","syllables":"A-ma-ni-ta"},"inflection":{"noun_plural":"Amanitas"},"usage_notes":{"explanation":"'Amanita' refers to a specific genus of mushrooms, many of which are highly poisonous. It's important to be able to identify these mushrooms accurately to avoid accidental poisoning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate an amanita and now I feel fine.","correct":"✓ I ate a mushroom and now I feel fine. (If you are actually fine, it likely wasn't Amanita)","note":"Eating an Amanita mushroom can be fatal. This statement is highly unlikely to be true if the person feels fine. It's better to say 'I ate a mushroom' if you are unsure of the species."}],"priority":"★★☆"},"related_words":{"derivatives":["amanitin (a toxic peptide found in some Amanita species)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amanita' is a scientific term referring to a genus of mushrooms, many of which are poisonous. It's a word primarily encountered in scientific or mycological contexts. Understanding the term is important for mushroom identification and avoiding potential poisoning. Knowledge of botany or mycology is helpful for understanding this term.","priority":"★☆☆"},"example_sentences":[{"sentence":"The field guide warned about the dangers of confusing edible mushrooms with poisonous Amanita species.","translation":"そのフィールドガイドは、食用キノコと有毒なテングタケ属の種を混同することの危険性について警告していました。","type":"noun","meaning_category":"Mushroom genus"},{"sentence":"Amanita phalloides, also known as the death cap, is one of the most poisonous of all known mushrooms.","translation":"ドクツルタケとしても知られるAmanita phalloidesは、知られているすべてのキノコの中で最も有毒なものの1つです。","type":"noun","meaning_category":"Mushroom genus"}]}