{"word":"omentosplenopexy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(手術)大網脾固定術：大網を脾臓に縫い付けて固定する手術。門脈圧亢進症の治療に用いられることがある。","english_definition":"(surgery) Omentosplenopexy: A surgical procedure in which the omentum is attached to the spleen to create collateral circulation, sometimes used in the treatment of portal hypertension.","examples":[{"sentence":"Omentosplenopexy may be performed to reduce portal hypertension.","translation":"大網脾固定術は、門脈圧亢進症を軽減するために行われることがある。"},{"sentence":"The surgeon performed an omentosplenopexy to improve blood flow to the liver.","translation":"外科医は、肝臓への血流を改善するために大網脾固定術を行った。"}],"collocations":["perform omentosplenopexy (大網脾固定術を行う)","undergo omentosplenopexy (大網脾固定術を受ける)","omentosplenopexy for portal hypertension (門脈圧亢進症に対する大網脾固定術)"],"synonyms":["splenorenal shunt","portacaval shunt"],"antonyms":[]}],"etymology":{"value":"「omentum」（大網）+ 「spleno-」（脾臓の）+ 「-pexy」（固定術）の組み合わせ。","priority":"★☆☆"},"pronunciation":{"ipa":"/oʊˌmɛntoʊsplɪˈnoʊˌpɛksi/","syllables":"o-men-to-sple-no-pex-y"},"inflection":{"noun_plural":"omentosplenopexies"},"usage_notes":{"explanation":"Omentosplenopexy is a relatively uncommon surgical procedure. It's primarily used in specific cases of portal hypertension where other treatments are not suitable or have failed. The goal is to create new pathways for blood to flow, bypassing the obstructed portal vein.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["omentum","spleen","splenopexy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学専門用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Omentosplenopexy is a complex medical term referring to a surgical procedure. It involves attaching the omentum (a large fold of peritoneum hanging down from the stomach) to the spleen. This is done to create new blood vessels that can bypass blockages in the portal vein, which is the main vessel carrying blood from the digestive organs to the liver. This procedure is typically reserved for cases of portal hypertension where other treatments are not effective. Due to its highly specialized nature, this term is rarely encountered outside of medical contexts."},"example_sentences":[{"sentence":"Omentosplenopexy is a surgical option for patients with portal hypertension who are not candidates for other shunt procedures.","translation":"大網脾固定術は、他のシャント手術の候補とならない門脈圧亢進症患者に対する外科的選択肢である。","type":"medical","meaning_category":"surgical procedure"},{"sentence":"The effectiveness of omentosplenopexy in reducing ascites is still under investigation.","translation":"腹水の軽減における大網脾固定術の有効性は、まだ調査中である。","type":"medical","meaning_category":"treatment"}]}