{"word":"patrimony","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"世襲財産、遺産、相続財産","english_definition":"property inherited from one's father or male ancestor.","examples":[{"sentence":"He received a considerable patrimony from his grandfather.","translation":"彼は祖父からかなりの世襲財産を受け継いだ。"},{"sentence":"The family's patrimony included land and valuable artifacts.","translation":"その家族の世襲財産には土地と貴重な工芸品が含まれていた。"}],"collocations":["receive a patrimony","inherit a patrimony","family patrimony","ancestral patrimony"],"synonyms":["inheritance","heritage","legacy","estate","endowment"],"antonyms":["acquired property"]},{"part_of_speech":"noun","definition":"(文化的な)遺産、伝統、継承されたもの","english_definition":"a cultural heritage or tradition passed down from ancestors.","examples":[{"sentence":"The nation's patrimony includes its art, literature, and music.","translation":"その国の文化遺産には、芸術、文学、音楽が含まれる。"},{"sentence":"Protecting our patrimony is a responsibility for future generations.","translation":"私たちの遺産を守ることは、将来の世代への責任である。"}],"collocations":["cultural patrimony","national patrimony","historical patrimony","artistic patrimony"],"synonyms":["heritage","legacy","tradition","inheritance","birthright"],"antonyms":["innovation"]}],"etymology":{"value":"Middle English: from Old French patremoine, from Latin patrimonium, from pater ‘father’","priority":"★★★"},"pronunciation":{"ipa":"/ˈpætrɪməni/","syllables":"pa-tri-mo-ny"},"inflection":{"noun_plural":"patrimonies"},"usage_notes":{"explanation":"\"Patrimony\" refers to something inherited, typically property or wealth, from a male ancestor. It can also refer to a broader cultural or national heritage. The term often carries a sense of tradition and historical significance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"She built her patrimony through hard work.","correct":"She built her fortune through hard work.","note":"Patrimony refers to inherited wealth, not wealth created through one's own efforts."},{"incorrect":"The patrimony of the company was its innovative spirit.","correct":"The legacy of the company was its innovative spirit.","note":"While patrimony can refer to cultural heritage, it's more commonly used for tangible inherited assets. Legacy is a better fit for intangible qualities."}],"priority":"★★☆"},"related_words":{"derivatives":["patrimonial (adjective)"],"phrases":["patrimony of Saint Peter (教皇領)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Patrimony\" is a formal word that refers to something inherited from a male ancestor, especially property or wealth. It can also refer to a cultural or national heritage. This word is not commonly used in everyday conversation and is more often found in legal, historical, or academic contexts."},"example_sentences":[{"sentence":"The young man squandered his entire patrimony in a few years.","translation":"その若者は数年で世襲財産をすべて浪費してしまった。","type":"noun","meaning_category":"世襲財産"},{"sentence":"The museum is dedicated to preserving the country's artistic patrimony.","translation":"その博物館は、国の芸術的遺産を保存することに専念している。","type":"noun","meaning_category":"文化遺産"}]}