{"word":"stag-necked","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"首が硬直した、首がこわばった","english_definition":"Having a stiff neck; suffering from torticollis.","examples":[{"sentence":"He woke up stag-necked after sleeping in an awkward position.","translation":"彼は不自然な姿勢で寝た後、首がこわばって目が覚めた。"},{"sentence":"The patient complained of being stag-necked and unable to turn his head easily.","translation":"患者は首がこわばって、頭を容易に回すことができないと訴えた。"}],"collocations":["stag-necked with pain","stag-necked and uncomfortable"],"synonyms":["stiff-necked","torticollis","wryneck"],"antonyms":["flexible-necked","supple-necked"]}],"etymology":{"value":"The term \"stag-necked\" likely originates from the observation of stags (male deer) sometimes holding their necks stiffly, although the exact etymological origin is not definitively documented. The term combines \"stag\" (deer) and \"necked\" (having a neck).","priority":"★★★"},"pronunciation":{"ipa":"/ˈstæɡˌnekt/","syllables":"stag-necked"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"\"Stag-necked\" is primarily used to describe the physical condition of having a stiff neck, often due to muscle tension or injury. It is not commonly used in everyday conversation but may appear in medical or descriptive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was stag-necked with excitement.","correct":"✓ He was stiff with excitement.","note":"\"Stag-necked\" refers specifically to a physical condition of neck stiffness, not emotional states. Use \"stiff\" or another appropriate adjective for emotional contexts."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_medical_terms":["torticollis","cervicalgia","muscle spasm"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"stag-necked\" is relatively uncommon and may not be familiar to many English speakers. It specifically describes the condition of having a stiff neck, often due to muscle strain or a medical condition like torticollis. Due to its specialized meaning, it is more likely to be encountered in medical or descriptive writing rather than in everyday conversation."},"example_sentences":[{"sentence":"After the long car ride, she felt quite stag-necked.","translation":"長時間の車の移動後、彼女はかなり首がこわばっているのを感じた。","type":"adjective","meaning_category":"physical condition"},{"sentence":"The doctor diagnosed him with a mild case of being stag-necked.","translation":"医者は彼を軽度の首こわばりと診断した。","type":"adjective","meaning_category":"medical condition"}]}