{"word":"Cuscus","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"クスクス：オーストラリア、ニューギニア、セレベス島などに生息する、フクロギツネ科の哺乳類","english_definition":"A nocturnal arboreal marsupial native to Australia, New Guinea, and Sulawesi.","examples":[{"sentence":"The cuscus is a marsupial that lives in trees.","translation":"クスクスは木に住む有袋類です。"},{"sentence":"Cuscuses are known for their slow movements.","translation":"クスクスは動きが遅いことで知られています。"}],"collocations":["spotted cuscus","common cuscus","ground cuscus"],"synonyms":["possum","marsupial"],"antonyms":[]},{"part_of_speech":"noun","definition":"クスクス：セモリナ粉を蒸して作る北アフリカ料理","english_definition":"A North African dish of steamed semolina.","examples":[{"sentence":"We had couscous with vegetables and lamb.","translation":"私たちは野菜とラム肉のクスクスを食べました。"},{"sentence":"Couscous is a staple food in many North African countries.","translation":"クスクスは多くのアフリカ北部諸国で主食です。"}],"collocations":["couscous salad","vegetable couscous","lamb couscous"],"synonyms":["semolina","pasta"],"antonyms":[]}],"etymology":{"value":"The word \"cuscus\" is believed to be derived from a Papuan language. As a dish, 'couscous' comes from the Arabic word 'kuskus'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌskəs/","syllables":"Cus-cus"},"inflection":{"noun_plural":"cuscuses"},"usage_notes":{"explanation":"The word \"Cuscus\" can refer to two different things: an animal and a food. When referring to the animal, it's a marsupial native to Australia and New Guinea. When referring to the food, it's a North African dish made from semolina. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a couscous in the zoo.","correct":"✓ I saw a cuscus in the zoo.","note":"Be careful with the spelling. The animal is spelled 'cuscus', while the food is often spelled 'couscous'."},{"incorrect":"✗ Couscous are cute animals.","correct":"✓ Cuscuses are cute animals.","note":"When referring to multiple animals, use the plural form 'cuscuses'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"Cuscus\" has two distinct meanings: a type of marsupial and a North African dish. Understanding the context is crucial to determine the intended meaning. The marsupial meaning is less common and may require some background knowledge of zoology or geography. The food meaning is more widely known, especially in culinary contexts. Be mindful of the spelling, as \"couscous\" is often used for the food, while \"cuscus\" is generally used for the animal."},"example_sentences":[{"sentence":"The **cuscus** is well-adapted to life in the rainforest canopy.","translation":"クスクスは熱帯雨林の樹冠での生活によく適応しています。","type":"noun","meaning_category":"Animal"},{"sentence":"She prepared a delicious **couscous** with roasted vegetables.","translation":"彼女はローストした野菜を使った美味しいクスクスを作りました。","type":"noun","meaning_category":"Food"}]}