{"word":"Euphausiidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オキアミ科","english_definition":"A family of krill (small crustaceans) in the order Euphausiacea.","examples":[{"sentence":"Euphausiidae are an important food source for many marine animals.","translation":"オキアミ科は多くの海洋動物にとって重要な食料源です。"}],"collocations":["krill fishery","Antarctic krill","Euphausia superba"],"synonyms":["krill"],"antonyms":[]}],"etymology":{"value":"From the order name Euphausiacea, itself derived from Greek 'eu' (good, well) and 'phausis' (appearance, light), referring to the bioluminescent properties of some species. The suffix '-idae' is a standard taxonomic suffix for families.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjuːfɔːˈsiːɪdiː/","syllables":"Eu-phau-si-i-dae"},"inflection":{"noun_plural":"Euphausiidae (plural form is the same as the singular)"},"usage_notes":{"explanation":"'Euphausiidae' refers to the family of krill. It is a scientific term used in biology and marine science. Because the plural form is the same as the singular, context is important to determine if one is referring to a single species or the entire family.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Euphausiidaes are small crustaceans.","correct":"✓ Euphausiidae are small crustaceans.","note":"The plural form of Euphausiidae is Euphausiidae, not Euphausiidaes."}],"priority":"★★☆"},"related_words":{"derivatives":["Euphausiacea (order)","Euphausia (genus)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Euphausiidae' is a scientific term used to classify a family of krill. It's unlikely to appear in general conversation and is primarily used in scientific or academic contexts related to marine biology. Understanding requires familiarity with biological classification systems."},"example_sentences":[{"sentence":"The biomass of Euphausiidae in the Southern Ocean is immense.","translation":"南極海におけるオキアミ科のバイオマスは莫大である。","type":"noun","meaning_category":"オキアミ科"},{"sentence":"Research is being conducted on the impact of climate change on Euphausiidae populations.","translation":"気候変動がオキアミ科の個体数に与える影響に関する研究が行われている。","type":"noun","meaning_category":"オキアミ科"}]}