{"word":"de-baptize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"洗礼を取り消す、洗礼を受けた状態を取り消す（比喩的に用いることも）","english_definition":"To revoke or undo a baptism; to renounce or reject one's baptism (often used figuratively).","examples":[{"sentence":"He wanted to de-baptize himself after renouncing his faith.","translation":"彼は信仰を捨てた後、洗礼を取り消したいと思った。"},{"sentence":"It's impossible to literally de-baptize someone, as baptism is considered a permanent spiritual mark.","translation":"洗礼は永続的な精神的な印と考えられているため、文字通りに誰かの洗礼を取り消すことは不可能である。"},{"sentence":"Figuratively, he de-baptized himself from the corporate culture by quitting his job.","translation":"比喩的に、彼は仕事を辞めることで企業文化からの洗礼を取り消した。"}],"collocations":["de-baptize oneself","attempt to de-baptize","figuratively de-baptize"],"synonyms":["unbaptize","unconvert","renounce baptism","reject baptism"],"antonyms":["baptize","convert"]},{"part_of_speech":"verb","transitivity":"vi","definition":"洗礼を取り消すことを求める、洗礼を受けた状態から離れる","english_definition":"To seek to have one's baptism revoked; to disassociate oneself from one's baptism.","examples":[{"sentence":"Some individuals who leave their religion seek to de-baptize.","translation":"宗教を離れる人々の中には、洗礼を取り消すことを求める者もいる。"}],"collocations":["seek to de-baptize","try to de-baptize"],"synonyms":["renounce one's faith","disaffiliate","disassociate"],"antonyms":["remain faithful","stay affiliated"]}],"etymology":{"value":"The word 'de-baptize' is formed by adding the prefix 'de-' (meaning 'undo' or 'reverse') to the word 'baptize'.","priority":"★★★"},"pronunciation":{"ipa":"/diːˈbæptaɪz/","syllables":"de-bap-tize"},"inflection":{"verb_forms":{"present_simple":["de-baptize","de-baptizes"],"past_simple":"de-baptized","past_participle":"de-baptized","present_participle":"de-baptizing"}},"usage_notes":{"explanation":"The term 'de-baptize' is controversial because many religions, particularly Christianity, view baptism as a permanent spiritual event that cannot be undone. Therefore, the term is often used figuratively to describe someone's rejection of their former beliefs or affiliations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He de-baptized by the priest.","correct":"✓ He was de-baptized by the priest. / ✓ He de-baptized himself.","note":"'De-baptize' often requires a reflexive pronoun ('himself,' 'herself') or passive voice because the action is typically performed on oneself or by an external entity (though the latter is theologically problematic)."},{"incorrect":"✗ You can't de-baptize someone, it's against the rules.","correct":"✓ You can't de-baptize someone, it's theologically impossible in many faiths.","note":"The reason 'de-baptizing' is not possible is often due to theological doctrine rather than simple rules."}],"priority":"★★☆"},"related_words":{"derivatives":["de-baptism (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Uncommon)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'de-baptize' means to attempt to undo or reverse the act of baptism. However, it's important to understand that in many religions, especially Christianity, baptism is considered a permanent spiritual event that cannot be undone. Therefore, 'de-baptize' is often used figuratively to describe someone renouncing their faith or disassociating themselves from a religious community. It's a relatively uncommon word and should be used with care, as it can be controversial due to its theological implications."},"example_sentences":[{"sentence":"Some atheists have sought legal recognition for 'de-baptism' ceremonies.","translation":"無神論者の中には、「脱洗礼」式の法的承認を求める者もいる。","type":"verb","meaning_category":"洗礼を取り消すことを求める"},{"sentence":"The artist's work explored the idea of de-baptizing oneself from societal norms.","translation":"そのアーティストの作品は、社会規範から自らを脱洗礼するという考えを探求した。","type":"verb","meaning_category":"洗礼を取り消す（比喩的）"}]}