{"word":"plastometry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"塑性測定法、塑性測定","english_definition":"The science and technique of measuring the plastic properties of materials.","examples":[{"sentence":"Plastometry is used to determine the yield strength and flow behavior of metals.","translation":"塑性測定法は、金属の降伏強度と流動特性を決定するために使用されます。"},{"sentence":"The plastometry test provides valuable data for material selection in engineering design.","translation":"塑性測定試験は、エンジニアリング設計における材料選択のための貴重なデータを提供します。"}],"collocations":["indentation plastometry","high-temperature plastometry","micro-plastometry"],"synonyms":["plasticity measurement","plastic deformation testing"],"antonyms":[]}],"etymology":{"value":"Derived from \"plastic\" (from Greek \"plastikos\" meaning capable of being shaped) and \"-metry\" (from Greek \"metron\" meaning measurement).","priority":"★★★"},"pronunciation":{"ipa":"/plæˈstɒmɪtri/","syllables":"plas-tom-e-try"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Plastometry is primarily used in materials science and engineering to characterize the plastic behavior of solids, particularly metals, polymers, and ceramics. It involves techniques that induce plastic deformation in a material and measure the resulting forces and displacements.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Plastometry is used to measure elastic properties.","correct":"✓ Plastometry is used to measure plastic properties.","note":"Plastometry specifically measures plastic (permanent) deformation, not elastic (recoverable) deformation."}],"priority":"★☆☆"},"related_words":{"derivatives":["plastometric (adjective)"],"related_terms":["plasticity","deformation","yield strength","hardness","creep"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Plastometry is a technical term used in materials science and engineering. It refers to the measurement of the plastic properties of materials, which is the ability of a material to undergo permanent deformation without fracture. This involves specialized techniques and equipment to apply forces and measure the resulting changes in the material's shape. Understanding plastometry requires a background in materials science or a related field."},"example_sentences":[{"sentence":"Indentation **plastometry** is a common method for determining the hardness of a material.","translation":"圧痕塑性測定法は、材料の硬度を決定するための一般的な方法です。","type":"noun","meaning_category":"塑性測定法"},{"sentence":"The results of the **plastometry** experiments were used to validate the material model.","translation":"塑性測定実験の結果は、材料モデルを検証するために使用されました。","type":"noun","meaning_category":"塑性測定法"}]}