{"word":"outsaint","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)よりも聖人らしく振る舞う、(人)よりも信心深い行いをする、(人)を信心深さで上回る","english_definition":"To surpass or exceed (someone) in saintliness or piety; to appear more virtuous or holy than (another person).","examples":[{"sentence":"He tried to outsaint his rivals by donating even more to charity.","translation":"彼はさらに多くの慈善寄付をすることで、ライバルたちよりも聖人らしく振る舞おうとした。"},{"sentence":"It's difficult to outsaint someone who has dedicated their life to religious service.","translation":"人生を宗教的な奉仕に捧げている人よりも信心深くなるのは難しい。"},{"sentence":"She attempted to outsaint her sister, but her efforts seemed forced and insincere.","translation":"彼女は妹よりも聖人らしく振る舞おうとしたが、その努力は無理やりで誠実さに欠けるように見えた。"}],"collocations":["outsaint rivals","outsaint competitors","outsaint peers","try to outsaint","attempt to outsaint"],"synonyms":["outdo","surpass","exceed","outshine","excel","outperform","outvie"],"antonyms":["fall short","be inferior","be surpassed","be outdone"]}],"etymology":{"value":"The word 'outsaint' is formed by combining the prefix 'out-' (meaning 'more than' or 'to exceed') with the noun 'saint' (a person recognized as having an exceptional degree of holiness or likeness to God).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊtˈseɪnt/","syllables":"out-saint"},"inflection":{"verb_forms":{"present_simple":["outsaint","outsaints"],"past_simple":"outsainted","past_participle":"outsainted","present_participle":"outsainting"}},"usage_notes":{"explanation":"'Outsaint' is a relatively rare and somewhat humorous or ironic word. It implies a competitive aspect to religious devotion or virtuous behavior, suggesting that someone is trying to appear more holy or righteous than others. It is often used critically to describe someone whose piety seems ostentatious or insincere.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He outsainted to the church every Sunday.","correct":"✓ He outsainted his rival by going to church every Sunday.","note":"'Outsaint' requires a direct object (the person being surpassed in saintliness). It is not used intransitively to describe simply going to church. You need to specify who is being outsainted and how."},{"incorrect":"✗ She is the most outsainting person I know.","correct":"✓ She is the most saintly person I know.","note":"'Outsainting' is a verb. To describe someone as very saintly, use the adjective 'saintly' or 'holy' rather than trying to use 'outsainting' as an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["saint (noun)","saintly (adjective)","saintliness (noun)"],"related_concepts":["piety","holiness","virtue","righteousness","devotion","sanctity"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not commonly found in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency. The word is rare and not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'outsaint' is a relatively rare and sophisticated term. Understanding it requires a grasp of the prefix 'out-' and its meaning of exceeding or surpassing, as well as a clear understanding of the concept of a 'saint' as a person of exceptional holiness. The word is often used in a critical or ironic context, implying a competitive or insincere display of piety. Its usage is more common in literary or academic writing than in everyday conversation."},"example_sentences":[{"sentence":"The two monks were constantly trying to outsaint each other in their acts of charity and devotion.","translation":"その二人の修道士は、慈善活動や献身において、常に互いよりも聖人らしく振る舞おうとしていた。","type":"verb","meaning_category":"聖人らしく振る舞う"},{"sentence":"It's a cynical world when even religious leaders are accused of trying to outsaint their colleagues for personal gain.","translation":"宗教指導者でさえ、個人的な利益のために同僚よりも聖人らしく振る舞おうとしていると非難されるのは、皮肉な世の中だ。","type":"verb","meaning_category":"信心深さで上回る"},{"sentence":"No matter how hard she tried, she couldn't outsaint her grandmother, whose kindness and generosity were legendary.","translation":"どんなに頑張っても、彼女は祖母よりも聖人らしく振る舞うことはできなかった。祖母の優しさと寛大さは伝説的だったからだ。","type":"verb","meaning_category":"信心深さで上回る"}]}