{"word":"cyanoacrylate","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"シアノアクリレート (瞬間接着剤の主成分)","english_definition":"An acrylic resin that rapidly polymerizes in the presence of water (specifically hydroxide ions), forming long, strong chains, joining the bonded surfaces together.","examples":[{"sentence":"Cyanoacrylate is the main ingredient in most super glues.","translation":"シアノアクリレートは、ほとんどの瞬間接着剤の主成分です。"},{"sentence":"Be careful when using cyanoacrylate as it bonds skin very quickly.","translation":"シアノアクリレートを使用する際は、皮膚を非常に素早く接着するため注意が必要です。"}],"collocations":["cyanoacrylate adhesive","ethyl cyanoacrylate","methyl cyanoacrylate"],"synonyms":["super glue","instant glue"," Krazy Glue (trademark)"],"antonyms":[]}],"etymology":{"value":"Derived from the chemical names of its components: cyano- (referring to the presence of a nitrile group) + acrylate (referring to the acrylic ester).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsaɪˌænoʊˈækrɪleɪt/","syllables":"cy-a-no-ac-ry-late"},"inflection":{"noun_plural":"cyanoacrylates"},"usage_notes":{"explanation":"Cyanoacrylate is a general term for a family of strong, fast-acting adhesives. Different types of cyanoacrylates exist, such as ethyl cyanoacrylate and methyl cyanoacrylate, each with slightly different properties. It's commonly known as 'super glue' or 'instant glue'. Due to its rapid bonding, it's used in various applications, from household repairs to medical procedures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used cyanoacrylate to glue the wood, but it didn't work.","correct":"✓ I used cyanoacrylate to glue the plastic, and it worked instantly.","note":"Cyanoacrylate works best on non-porous materials like plastic, rubber, and metal. Wood is porous and may require a different type of adhesive."},{"incorrect":"✗ Cyanoacrylate is safe to use on skin.","correct":"✓ Cyanoacrylate can bond skin very quickly, so caution is needed.","note":"Cyanoacrylate bonds skin rapidly and can cause irritation or injury. It's important to use it carefully and avoid skin contact."}],"priority":"★☆☆"},"related_words":{"derivatives":["acrylate","acrylic","polymer","polymerization"],"phrasal_verbs":[],"related_chemical_compounds":["ethyl cyanoacrylate","methyl cyanoacrylate","butyl cyanoacrylate"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な科学・化学分野で使われる語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cyanoacrylate' is a technical term referring to a specific type of acrylic resin used in fast-acting adhesives, commonly known as 'super glue' or 'instant glue'. It's a chemical compound that polymerizes rapidly in the presence of moisture, creating strong bonds between surfaces. The term is primarily used in scientific, industrial, and technical contexts. Understanding the properties and applications of cyanoacrylate requires some knowledge of chemistry and materials science."},"example_sentences":[{"sentence":"The surgeon used cyanoacrylate to close the wound quickly.","translation":"外科医は傷を素早く閉じるためにシアノアクリレートを使用しました。","type":"noun","meaning_category":"chemical compound"},{"sentence":"Industrial applications of cyanoacrylate include bonding small components.","translation":"シアノアクリレートの産業用途には、小型部品の接合が含まれます。","type":"noun","meaning_category":"chemical compound"}]}