{"word":"pseudorunic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"疑似ルーン文字の、ルーン文字に似た","english_definition":"Resembling or imitating runic script; not genuinely runic.","examples":[{"sentence":"The inscription was in a pseudorunic script.","translation":"その碑文は疑似ルーン文字で書かれていた。"},{"sentence":"The artist used pseudorunic symbols in their artwork.","translation":"そのアーティストは作品の中で疑似ルーン文字のシンボルを使用した。"}],"collocations":["pseudorunic inscription","pseudorunic symbols","pseudorunic alphabet"],"synonyms":["runelike","runic-inspired","quasi-runic"],"antonyms":["genuinely runic","authentic runic"]}],"etymology":{"value":"\"pseudo-\" (偽の) + \"runic\" (ルーン文字の)","priority":"★★★"},"pronunciation":{"ipa":"ˌsjuːdoʊˈruːnɪk","syllables":"pseu-do-ru-nic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありますが、使用頻度は非常に低いでしょう。"},"usage_notes":{"explanation":"\"Pseudorunic\" is used to describe something that looks like runic script but is not actually runic. It's often used in art, fantasy literature, or games to create a sense of antiquity or mystery without using actual historical runic writing. The term implies that the symbols are either invented or loosely based on runic forms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ancient text was pseudorunic and easy to translate.","correct":"✓ The ancient text was in runic script and easy to translate.","note":"If the text is easy to translate, it's likely genuinely runic, not pseudorunic. Pseudorunic scripts are often invented and therefore untranslatable."},{"incorrect":"✗ He studies pseudorunic history.","correct":"✓ He studies runic history.","note":"History focuses on real runic writing; pseudorunic scripts are more relevant to art or literature."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudo- (接頭辞: 偽の、見せかけの)","rune (名詞: ルーン文字)","runic (形容詞: ルーン文字の)"],"related_concepts":["futhark (ルーン文字のアルファベット)","Elder Futhark","Younger Futhark","Armanen runes"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Pseudorunic\" is a specialized term used to describe something that appears to be written in runic script but is not authentic. It is often encountered in contexts related to fantasy, art, or design where a runic aesthetic is desired without the need for historical accuracy. The term implies a deliberate imitation or invention of runic-like symbols. Understanding this term requires familiarity with the concept of runic writing and the prefix \"pseudo-\" which indicates falseness or imitation."},"example_sentences":[{"sentence":"The sword hilt was decorated with a **pseudorunic** inscription that added to its mystical appearance.","translation":"その剣の柄は、神秘的な外観を添える疑似ルーン文字の碑文で装飾されていた。","type":"adjective","meaning_category":"外観"},{"sentence":"Many fantasy novels feature languages written in **pseudorunic** alphabets.","translation":"多くのファンタジー小説には、疑似ルーン文字のアルファベットで書かれた言語が登場する。","type":"adjective","meaning_category":"文学"},{"sentence":"The artist created a series of paintings incorporating **pseudorunic** symbols.","translation":"そのアーティストは、疑似ルーン文字のシンボルを取り入れた一連の絵画を作成した。","type":"adjective","meaning_category":"芸術"}]}