{"word":"Zermatt","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ツェルマット：スイス、ヴァレー州にある村。マッターホルンの麓に位置する観光地であり、自動車の乗り入れが禁止されている。","english_definition":"Zermatt: a municipality in the district of Visp in the German-speaking section of the canton of Valais in Switzerland. It is a car-free village and a popular mountaineering and ski resort.","examples":[{"sentence":"We visited Zermatt last summer and were amazed by the Matterhorn.","translation":"私たちは昨年の夏にツェルマットを訪れ、マッターホルンに圧倒されました。"},{"sentence":"Zermatt is famous for its car-free environment and stunning mountain views.","translation":"ツェルマットは自動車の乗り入れが禁止されている環境と、息をのむような山の景色で有名です。"}],"collocations":["visit Zermatt (ツェルマットを訪れる)","in Zermatt (ツェルマットで)","near Zermatt (ツェルマットの近く)","Zermatt village (ツェルマットの村)","Zermatt ski resort (ツェルマット・スキーリゾート)"],"synonyms":["none (proper noun)"],"antonyms":["none (proper noun)"]}],"etymology":{"value":"The name 'Zermatt' likely derives from 'zur Matte', meaning 'at the meadow' in old German.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtsɛrmæt/","syllables":"Zer-matt"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"'Zermatt' is primarily used as a proper noun to refer to the specific location in Switzerland. It is known for its scenic beauty, mountaineering opportunities, and environmental policies (car-free). When discussing travel, geography, or tourism related to Switzerland, 'Zermatt' is the accurate and commonly used term.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the Zermatt.","correct":"✓ I went to Zermatt.","note":"'Zermatt' is a proper noun and doesn't usually require a definite article ('the') unless referring to a specific feature or aspect of the location."},{"incorrect":"✗ Zermatt is a city.","correct":"✓ Zermatt is a village.","note":"Zermatt is a village or municipality, not a city."}],"priority":"★★☆"},"related_words":{"derivatives":["Matterhorn (マッターホルン)","Valais (ヴァレー州)","Swiss Alps (スイスアルプス)","ski resort (スキーリゾート)","mountaineering (登山)"],"phrasal_verbs":["none"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Proper noun, not typically CEFR rated)","frequency_google_ngram":"Relatively low frequency, specific to travel and geography contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Zermatt' is a place name, specifically a village in Switzerland. It's famous for being near the Matterhorn mountain and for not allowing cars. If you're talking about travel to Switzerland or mountain climbing, you might use this word. It's not a common word in everyday conversation unless you're discussing these topics."},"example_sentences":[{"sentence":"Many tourists flock to Zermatt to see the Matterhorn.","translation":"多くの観光客がマッターホルンを見るためにツェルマットに集まります。","type":"noun","meaning_category":"location"},{"sentence":"Zermatt offers some of the best skiing in the Swiss Alps.","translation":"ツェルマットはスイスアルプスで最高のスキーを提供しています。","type":"noun","meaning_category":"location"},{"sentence":"Staying in Zermatt is a unique experience due to its car-free policy.","translation":"ツェルマットに滞在することは、自動車の乗り入れが禁止されているという点でユニークな経験です。","type":"noun","meaning_category":"location"}]}