{"word":"parochialize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(考え、視野、活動などを)地方根性にする、狭める、偏狭にする","english_definition":"to limit in scope or narrow in perspective; to make parochial.","examples":[{"sentence":"The curriculum has been parochialized, focusing only on local history.","translation":"カリキュラムは地方根性化され、地元の歴史のみに焦点を当てている。"},{"sentence":"The debate was parochialized by focusing on irrelevant local issues.","translation":"その議論は、無関係な地域問題に焦点を当てることによって狭められた。"},{"sentence":"The media's coverage parochialized the issue, ignoring the broader national context.","translation":"メディアの報道は、より広い国の状況を無視して、問題を地方根性化した。"}],"collocations":["parochialize the curriculum (カリキュラムを地方根性化する)","parochialize the debate (議論を狭める)","parochialize the issue (問題を偏狭にする)"],"synonyms":["narrow","restrict","localize","provincialize","insularize"],"antonyms":["broaden","expand","generalize","universalize"]},{"part_of_speech":"verb","transitivity":"vi","definition":"地方根性になる、視野が狭くなる","english_definition":"to become limited in scope or narrow in perspective; to become parochial.","examples":[{"sentence":"The discussion parochialized as participants focused solely on their own experiences.","translation":"参加者が自分の経験だけに焦点を当てたため、議論は地方根性化した。"},{"sentence":"The community parochialized after the economic downturn, becoming less open to outsiders.","translation":"景気後退後、コミュニティは地方根性化し、外部の人々に対して閉鎖的になった。"}],"collocations":["the discussion parochializes (議論が狭くなる)","the community parochializes (コミュニティが地方根性になる)"],"synonyms":["narrow","restrict","localize","provincialize","insularize"],"antonyms":["broaden","expand","generalize","universalize"]}],"etymology":{"value":"\"Parochial\" + \"-ize\". \"Parochial\" comes from the Latin \"parochia\" (parish), from the Greek \"paroikia\" (foreign district, sojourn), from \"para-\" (beside, near) + \"oikos\" (house). The suffix \"-ize\" means \"to make, to render\".","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈroʊkiəˌlaɪz/","syllables":"pa-ro-chi-a-lize"},"inflection":{"verb_forms":{"present_simple":["parochialize","parochializes"],"past_simple":"parochialized","past_participle":"parochialized","present_participle":"parochializing"}},"usage_notes":{"explanation":"\"Parochialize\" implies a negative transformation, where something that should be broad or inclusive becomes limited and focused on a narrow, local perspective. It often suggests a lack of awareness or interest in wider issues or contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The city parochialized the national park.","correct":"✓ The city localized the national park.","note":"\"Parochialize\" is usually applied to abstract concepts like ideas, discussions, or perspectives, not physical locations. Use \"localize\" or similar verbs for physical spaces."},{"incorrect":"✗ The teacher parochialized the students.","correct":"✓ The teacher narrowed the students' perspectives.","note":"\"Parochialize\" is not typically used to describe the direct impact on people, but rather on their views or activities. Use \"narrowed the perspectives of\" or similar phrases."}],"priority":"★★☆"},"related_words":{"derivatives":["parochial (adjective: 地方の、教区の、視野の狭い)","parochialism (noun: 地方根性、偏狭さ)","parochially (adverb: 地方根性的に、偏狭に)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Parochialize\" is a relatively uncommon word that means to make something limited or narrow in scope, especially by focusing on local or provincial concerns. It is often used in academic or critical contexts to describe how a broader issue or perspective has been reduced to a more limited, local focus. The word implies a negative connotation, suggesting that this narrowing is undesirable or detrimental. It is important to distinguish it from words like \"localize,\" which simply means to make something local without necessarily implying a negative judgment."},"example_sentences":[{"sentence":"The university's research efforts were parochialized by a lack of funding for international collaborations.","translation":"大学の研究活動は、国際的な共同研究のための資金不足によって地方根性化された。","type":"verb","meaning_category":"狭める"},{"sentence":"The political discourse has been parochialized by the media's focus on sensational local stories.","translation":"政治的な議論は、メディアが扇情的な地元のニュースに焦点を当てることによって偏狭化されている。","type":"verb","meaning_category":"狭める"},{"sentence":"The artist deliberately parochialized his work to reflect the unique character of his hometown.","translation":"そのアーティストは、故郷のユニークな個性を反映させるために、意図的に作品を地方根性化した。","type":"verb","meaning_category":"狭める"}]}