{"word":"deletionism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(インターネット、特にウィキペディアにおいて)削除主義。記事やコンテンツを削除することを重視する立場。","english_definition":"(On the Internet, especially Wikipedia) The belief that articles or content that are not of high quality or significance should be deleted.","examples":[{"sentence":"Deletionism is a controversial philosophy on Wikipedia.","translation":"削除主義はウィキペディアにおいて議論の的となる哲学です。"},{"sentence":"Some editors accuse others of deletionism when they nominate articles for deletion.","translation":"記事の削除を提案するとき、一部の編集者は他の編集者を削除主義だと非難します。"}],"collocations":["deletionist editor","deletionist policy","oppose deletionism","support deletionism"],"synonyms":["excisionism","eliminativism"],"antonyms":["inclusionism"]},{"part_of_speech":"noun","definition":"(より一般的に)不要なものや価値のないものを削除または排除することを重視する立場。","english_definition":"(More generally) The belief that unnecessary or valueless things should be deleted or eliminated.","examples":[{"sentence":"In the context of urban planning, deletionism might refer to the demolition of old buildings to make way for new development.","translation":"都市計画の文脈では、削除主義は新しい開発のために古い建物を解体することを指すかもしれません。"}],"collocations":[],"synonyms":["reductionism","simplification"],"antonyms":["preservationism","conservationism"]}],"etymology":{"value":"'Deletion'（削除） + '-ism'（主義）からなる造語。","priority":"☆☆☆"},"pronunciation":{"ipa":"/dɪˈliːʃənɪzəm/","syllables":"de-le-tion-ism"},"inflection":{"noun_plural":"deletionisms"},"usage_notes":{"explanation":"「**deletionism**」は、主にインターネット、特にウィキペディアなどの共同編集プロジェクトにおいて、記事やコンテンツの品質維持を目的として、不要または不適切なものを積極的に削除すべきだという考え方を指します。対義語は「inclusionism（包摂主義）」で、できる限り多くの情報を含めるべきだという立場です。削除主義は、記事の質を向上させる一方で、貴重な情報が失われる可能性や、編集者間の対立を引き起こす可能性があるため、議論の的となっています。より一般的には、不要なものや価値のないものを排除する考え方を指すこともあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a deletionist, so he always adds content.","correct":"✓ He is a deletionist, so he always deletes content.","note":"削除主義者はコンテンツを追加するのではなく、削除することを重視します。"},{"incorrect":"✗ Deletionism is the same as censorship.","correct":"✓ Deletionism is not necessarily the same as censorship.","note":"削除主義は必ずしも検閲と同じではありません。削除主義は品質維持を目的とすることが多いですが、検閲は政治的またはイデオロギー的な理由で行われることがあります。"}],"priority":"☆☆☆"},"related_words":{"derivatives":["deletionist (名詞/形容詞: 削除主義者、削除主義的な)","delete (動詞: 削除する)","deletion (名詞: 削除)"],"idioms_phrases":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 特定のコミュニティや文脈でのみ使用される専門用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"「**deletionism**」は、特にウィキペディアのような共同編集サイトで使われる言葉で、質の低い記事や重要でない記事は削除すべきだという考え方を指します。この言葉は、コンテンツをできるだけ多く残すべきだという「inclusionism（包摂主義）」と対立する概念です。削除主義者は、質の低い記事がサイト全体の信頼性を損なうと考えています。この言葉は、一般的な会話ではあまり使われません。"},"example_sentences":[{"sentence":"The debate between deletionism and inclusionism continues to shape Wikipedia's content policies.","translation":"削除主義と包摂主義の間の議論は、ウィキペディアのコンテンツポリシーを形成し続けています。","type":"noun","meaning_category":"(インターネットにおける)削除主義"},{"sentence":"Some argue that a degree of deletionism is necessary to maintain the quality of online encyclopedias.","translation":"オンライン百科事典の質を維持するためには、ある程度の削除主義が必要だと主張する人もいます。","type":"noun","meaning_category":"(インターネットにおける)削除主義"}]}