{"word":"catastaltic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)腸の蠕動運動を抑制する、または抑制する性質のある","english_definition":"(medicine) Inhibiting or tending to inhibit peristaltic movement in the intestines.","examples":[{"sentence":"The drug has a catastaltic effect on the bowel.","translation":"その薬は腸に蠕動運動を抑制する効果がある。"},{"sentence":"Catastaltic agents are sometimes used to treat diarrhea.","translation":"蠕動運動抑制剤は、下痢の治療に使用されることがある。"}],"collocations":["catastaltic drug","catastaltic effect","catastaltic action"],"synonyms":["antiperistaltic","antispasmodic"],"antonyms":["peristaltic"]}],"etymology":{"value":"Derived from the Greek words 'kata' (down, against) + 'stal' (compress, contract) + '-tic' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkætəˈstɔːltɪk/","syllables":"ca-ta-stal-tic"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms, though they are rarely used: more catastaltic, most catastaltic."},"usage_notes":{"explanation":"'Catastaltic' is a relatively rare term primarily used in medical contexts to describe substances or processes that reduce or inhibit the normal peristaltic movements of the intestines. Peristalsis is the wave-like muscle contractions that move food through the digestive tract. Therefore, a catastaltic agent would work against this process, often to alleviate symptoms like diarrhea or intestinal spasms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor prescribed a catastaltic exercise.","correct":"✓ The doctor prescribed a catastaltic drug.","note":"'Catastaltic' relates to inhibiting intestinal movement, so it's typically associated with drugs or treatments, not exercises."},{"incorrect":"✗ The food poisoning caused catastaltic movement.","correct":"✓ The food poisoning caused increased peristaltic movement.","note":"Food poisoning usually increases intestinal movement, leading to diarrhea, rather than inhibiting it."}],"priority":"★☆☆"},"related_words":{"derivatives":["catastalsis (noun): Inhibition of peristalsis."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'catastaltic' is a technical term primarily used in medical contexts. It describes something that inhibits or reduces the peristaltic movements of the intestines. Peristalsis refers to the wave-like muscle contractions that move food through the digestive system. Therefore, 'catastaltic' is usually used to describe medications or treatments that slow down or stop these movements, often to treat conditions like diarrhea or intestinal spasms. It is not a commonly used word in everyday language."},"example_sentences":[{"sentence":"The patient was given a catastaltic medication to relieve their severe diarrhea.","translation":"患者は重度の下痢を緩和するために、蠕動運動抑制薬を投与された。","type":"adjective","meaning_category":"Inhibiting intestinal movement"},{"sentence":"The study investigated the catastaltic effects of the new compound on the digestive system.","translation":"その研究は、新しい化合物が消化器系に及ぼす蠕動運動抑制効果を調査した。","type":"adjective","meaning_category":"Inhibiting intestinal movement"}]}