{"word":"pseudoromantically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"疑似ロマンチックに。ロマンチックであるかのように見せかけて。","english_definition":"In a manner that is superficially or falsely romantic.","examples":[{"sentence":"They behaved pseudoromantically, exchanging flowery compliments without any real affection.","translation":"彼らは疑似ロマンチックに振る舞い、本当の愛情なしに華やかな賛辞を交わした。"},{"sentence":"The movie portrayed the relationship pseudoromantically, focusing on dramatic gestures rather than genuine connection.","translation":"その映画は、本物のつながりよりも劇的な身振りに焦点を当て、その関係を疑似ロマンチックに描いた。"}],"collocations":["behave pseudoromantically","portray pseudoromantically","describe pseudoromantically"],"synonyms":["insincerely","falsely","superficially","ostensibly","affectedly"],"antonyms":["sincerely","genuinely","authentically"]}],"etymology":{"value":"The word is formed by combining \"pseudo-\" (meaning false or imitation) with \"romantically\" (in a romantic manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊroʊˈmæntɪkli/","syllables":"pseu-do-ro-man-ti-cal-ly"},"inflection":{"notes":"This is an adverb, so it does not have different forms for gender or number."},"usage_notes":{"explanation":"The adverb 'pseudoromantically' is used to describe actions, behaviors, or portrayals that appear romantic on the surface but lack genuine emotion or sincerity. It suggests a superficial or artificial quality to the romantic gestures or expressions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They pseudoromantic each other.","correct":"✓ They behaved pseudoromantically towards each other.","note":"'Pseudoromantically' is an adverb, so it modifies a verb. It cannot be used as a verb itself."},{"incorrect":"✗ The pseudoromantically relationship was short-lived.","correct":"✓ The pseudoromantic relationship was short-lived.","note":"To describe the relationship, use the adjective 'pseudoromantic'."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudoromantic (adjective)","pseudoromance (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pseudoromantically' is a complex adverb used to describe something done in a way that appears romantic but is not genuine or sincere. It's often used in academic or literary contexts to analyze relationships or portrayals that are superficial or artificial. Understanding the prefixes and suffixes (pseudo-, -ly) can help in deciphering the meaning."},"example_sentences":[{"sentence":"The scene was staged pseudoromantically, with soft lighting and dramatic music, but the actors seemed detached.","translation":"そのシーンは、ソフトな照明と劇的な音楽で疑似ロマンチックに演出されたが、俳優たちはどこかよそよそしかった。","type":"adverb","meaning_category":"manner"},{"sentence":"The politician spoke pseudoromantically about the importance of family values, but his personal life told a different story.","translation":"その政治家は、家族の価値観の重要性について疑似ロマンチックに語ったが、彼の私生活は別の物語を語っていた。","type":"adverb","meaning_category":"manner"}]}