{"word":"co-surety","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"共同保証人","english_definition":"One of two or more sureties who are liable for the same debt or obligation of a principal debtor.","examples":[{"sentence":"The bank required a co-surety for the loan.","translation":"銀行は融資のために共同保証人を要求した。"},{"sentence":"Each co-surety is responsible for a portion of the debt.","translation":"各共同保証人は債務の一部に対して責任を負う。"}],"collocations":["act as co-surety","require a co-surety","liability of a co-surety"],"synonyms":["joint surety","co-guarantor"],"antonyms":["sole surety"]},{"part_of_speech":"noun","definition":"連帯保証人","english_definition":"A surety who is jointly and severally liable with other sureties for the same debt or obligation.","examples":[{"sentence":"The co-sureties were jointly and severally liable.","translation":"共同保証人たちは連帯して責任を負っていた。"}],"collocations":["jointly and severally liable co-sureties"],"synonyms":["joint and several surety"],"antonyms":[]}],"etymology":{"value":"The term 'co-surety' is formed by combining the prefix 'co-' meaning 'joint' or 'together' with the word 'surety,' which refers to a person who takes responsibility for another's performance of an undertaking or payment of a debt.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkoʊˈʃʊərəti/","syllables":"co-sure-ty"},"inflection":{"noun_plural":"co-sureties"},"usage_notes":{"explanation":"A co-surety is one of two or more sureties who are liable for the same debt or obligation of a principal debtor. Co-sureties share the responsibility for the debt, and their liability can be either joint or joint and several, depending on the agreement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a cosurety for his friend's loan.","correct":"✓ He is a co-surety for his friend's loan.","note":"The correct spelling is 'co-surety' with a hyphen."}],"priority":"★★☆"},"related_words":{"derivatives":["surety","guarantor","indemnitor"],"related_legal_terms":["subrogation","contribution","exoneration"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in legal and financial contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'co-surety' is a specialized term primarily used in legal and financial contexts. It refers to one of multiple parties who agree to be responsible for the debt or obligation of another party. Understanding this term requires familiarity with concepts of surety, guarantee, and joint liability. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The bank required two co-sureties for the business loan.","translation":"銀行は事業融資のために2人の共同保証人を要求した。","type":"example","meaning_category":"General"},{"sentence":"Each co-surety's liability is limited to a specific percentage of the total debt.","translation":"各共同保証人の責任は、総債務の特定の割合に制限されている。","type":"example","meaning_category":"Liability"},{"sentence":"The co-sureties agreed to indemnify the lender against any losses.","translation":"共同保証人たちは、貸し手に対して損失を補償することに合意した。","type":"example","meaning_category":"Agreement"}]}