{"word":"tenantship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"賃借権、賃貸契約、賃借期間","english_definition":"The state or condition of being a tenant; the possession of land or property as a tenant.","examples":[{"sentence":"The tenantship agreement outlined the responsibilities of both the landlord and the tenant.","translation":"賃借契約には、家主と賃借人の両方の責任が明記されていた。"},{"sentence":"He enjoyed a long tenantship on the farm, raising his family there for many years.","translation":"彼はその農場で長期間の賃借権を享受し、そこで長年家族を育てた。"},{"sentence":"The laws governing tenantship vary from state to state.","translation":"賃借権を管轄する法律は州によって異なる。"}],"collocations":["long-term tenantship","secure tenantship","tenantship agreement","tenantship rights"],"synonyms":["tenancy","leasehold","occupancy","possession","holding"],"antonyms":["ownership","landlordism"]}],"etymology":{"value":"Derived from 'tenant' + '-ship'. 'Tenant' comes from Old French 'tenant,' meaning 'holding,' from Latin 'tenens,' present participle of 'tenere' (to hold). '-ship' is a suffix denoting state, condition, or office.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtenəntʃɪp/","syllables":"ten-ant-ship"},"inflection":{"noun_plural":"tenantships"},"usage_notes":{"explanation":"'Tenantship' refers to the legal relationship and associated rights and responsibilities between a landlord and a tenant. It often implies a formal agreement or contract that defines the terms of occupancy. The term is less commonly used than 'tenancy' but carries a similar meaning, often emphasizing the duration or conditions of the tenant's occupancy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a tenantship of his car.","correct":"✓ He has ownership of his car.","note":"'Tenantship' applies to land or property, not movable items like cars. Ownership is the correct term for cars."},{"incorrect":"✗ The tenantship is very expensive every month.","correct":"✓ The rent is very expensive every month.","note":"'Tenantship' refers to the state of being a tenant, while 'rent' refers to the payment made by the tenant."}],"priority":"★★☆"},"related_words":{"derivatives":["tenant","tenancy","landlord","lease","rent"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'tenantship' is a formal term referring to the state of being a tenant, holding property under a lease or agreement. It is less commonly used than 'tenancy' but conveys a similar meaning. Understanding this word requires familiarity with legal and property-related vocabulary. It's often found in legal documents or discussions about property rights.","priority":"★☆☆"},"example_sentences":[{"sentence":"The details of the tenantship were carefully reviewed by the lawyers.","translation":"弁護士によって賃借権の詳細が注意深く検討された。","type":"general","meaning_category":"賃借権の詳細"},{"sentence":"Changes in the law affected the security of his tenantship.","translation":"法律の変更は、彼の賃借権の安定性に影響を与えた。","type":"legal","meaning_category":"賃借権の安定性"},{"sentence":"The duration of the tenantship was specified in the contract.","translation":"賃借期間は契約書に明記されていた。","type":"contractual","meaning_category":"賃借期間"}]}