{"word":"Affilier","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(団体などに)加入させる、提携させる、系列に入れる","english_definition":"To attach or connect to a larger group or organization; to associate oneself or one's organization with another.","examples":[{"sentence":"Il a cherché à affilier son association à une fédération reconnue.","translation":"He sought to affiliate his association with a recognized federation."}],"collocations":["s'affilier à (join, become affiliated with)","affilier une entreprise (affiliate a company)","affilier une association (affiliate an association)"],"synonyms":["associer","rattacher","agréger","intégrer"],"antonyms":["désaffilier","dissocier","séparer"]}],"etymology":{"value":"From the French word 'affilier', which comes from the Latin 'ad-' (to) + 'filius' (son), originally meaning to adopt as a son or to bring into a family. The meaning evolved to include joining or associating with a group.","priority":"★★☆"},"pronunciation":{"ipa":"/a.fi.lje/","syllables":"a-fi-li-er"},"inflection":{"verb_forms":{"present_simple":["affilie","affilies","affilie","affilions","affiliez","affilient"],"past_simple":"affiliai","past_participle":"affilié","present_participle":"affiliant"}},"usage_notes":{"explanation":"'Affilier' is primarily used in a formal context to describe the act of joining or connecting an entity (like a company, association, or individual) to a larger organization or network. It implies a formal relationship or membership. The reflexive form 's'affilier' means 'to become affiliated' or 'to join'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ J'affilie avec cette organisation.","correct":"✓ Je m'affilie à cette organisation.","note":"The reflexive pronoun 'me' is necessary when expressing that you are joining the organization. Use 's'affilier à'."},{"incorrect":"✗ Affilier l'entreprise à...","correct":"✓ Affilier l'entreprise à... (correct, but needs a complement)","note":"The sentence needs a complement to indicate what the company is being affiliated with."}],"priority":"★★☆"},"related_words":{"derivatives":["affiliation (noun: the state of being affiliated)","affilié (adjective: affiliated, member)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, mainly used in formal or organizational contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Affilier' is a verb that means to connect or associate with a larger group or organization. It is often used in business, legal, or political contexts. The reflexive form 's'affilier' means to become a member or affiliate oneself. It is not a commonly used word in everyday conversation, so it is more likely to be encountered in formal writing or professional settings."},"example_sentences":[{"sentence":"Notre entreprise est affiliée à un réseau international de distribution.","translation":"Our company is affiliated with an international distribution network.","type":"verb","meaning_category":"joining a network"},{"sentence":"De nombreux médecins se sont affiliés à cette association professionnelle.","translation":"Many doctors have affiliated themselves with this professional association.","type":"verb","meaning_category":"joining an association"},{"sentence":"Le parti politique cherche à affilier de nouveaux membres.","translation":"The political party is seeking to affiliate new members.","type":"verb","meaning_category":"recruiting members"}]}