{"word":"Astrophobia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"星、宇宙空間、天体に対する恐怖症","english_definition":"An irrational fear of stars, celestial space, or astronomical objects.","examples":[{"sentence":"Her astrophobia made it impossible for her to enjoy stargazing.","translation":"彼女の宇宙恐怖症のせいで、星空観察を楽しむことができなかった。"},{"sentence":"Astrophobia can manifest as anxiety when viewing images of space.","translation":"宇宙恐怖症は、宇宙の画像を見たときに不安として現れることがある。"}],"collocations":["suffer from astrophobia","overcome astrophobia","diagnosed with astrophobia"],"synonyms":["fear of space","fear of stars","celestial phobia"],"antonyms":["astrophilia (love of stars)"]}],"etymology":{"value":"Derived from the Greek words 'astron' (ἄστρον) meaning 'star' and 'phobos' (φόβος) meaning 'fear'.","priority":"★★★"},"pronunciation":{"ipa":"ˌæstroʊˈfoʊbiə","syllables":"As-tro-pho-bi-a"},"inflection":{"noun_plural":"astrophobias"},"usage_notes":{"explanation":"Astrophobia is a specific phobia characterized by an intense and irrational fear of stars, space, or celestial objects. It can be triggered by various stimuli, including looking at the night sky, viewing images of space, or even thinking about astronomical concepts. The severity of astrophobia can vary from person to person, with some experiencing mild anxiety and others experiencing panic attacks.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have astrophobia, so I like to look at the stars.","correct":"✓ I have astrophobia, so I avoid looking at the stars.","note":"Astrophobia is a fear of stars, so someone with astrophobia would avoid them."}],"priority":"★★☆"},"related_words":{"derivatives":["phobia","astronomy","astral"],"related_phobias":["aerophobia (fear of flying)","acrophobia (fear of heights)","claustrophobia (fear of enclosed spaces)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - This is a specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Astrophobia' is a complex word referring to a specific phobia, which is an intense and irrational fear. It specifically denotes the fear of stars or celestial objects. This term is not commonly used in everyday conversation and is more likely to appear in discussions related to psychology or phobias. Understanding this word requires a good vocabulary and comprehension of psychological terms."},"example_sentences":[{"sentence":"The therapist helped him manage his astrophobia through exposure therapy.","translation":"セラピストは、暴露療法を通じて彼の宇宙恐怖症を管理するのを助けた。","type":"general","meaning_category":"treatment"},{"sentence":"Astrophobia is often linked to a fear of the unknown and the vastness of space.","translation":"宇宙恐怖症は、未知のものや宇宙の広大さへの恐怖と関連していることが多い。","type":"general","meaning_category":"causes"}]}