{"word":"Lichening","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"The process of becoming covered in lichen; the action of lichen growing or spreading.","english_definition":"The process by which a surface becomes covered with lichens, or the action of lichens growing and spreading.","examples":[{"sentence":"The stone wall was slowly lichening, turning green and grey with the creeping organisms.","translation":"石壁はゆっくりと地衣類に覆われ、忍び寄る生物によって緑と灰色に変わっていった。"},{"sentence":"The lichening of the bark provides a habitat for small insects.","translation":"樹皮の地衣類化は、小さな昆虫の生息地を提供する。"}],"collocations":["lichening process","lichening of rocks","lichening of trees","lichening surface"],"synonyms":["lichenification","lichen growth","lichen colonization","lichen spread"],"antonyms":["delichening (removal of lichens)","clearing","cleaning"]}],"etymology":{"value":"Derived from the word 'lichen' (a composite organism consisting of a fungus and an alga) and the suffix '-ing', indicating a process or action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlaɪkənɪŋ/","syllables":"Li-chen-ing"},"inflection":{"verb_forms":{"present_simple":["lichenings"],"past_simple":"lichened","past_participle":"lichened","present_participle":"lichening"}},"usage_notes":{"explanation":"'Lichening' is primarily used in scientific or descriptive contexts to refer to the gradual coverage of a surface by lichens. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lichening is very beautiful on the old building.","correct":"✓ The lichens are very beautiful on the old building.","note":"'Lichening' refers to the process, not the lichens themselves. Use 'lichens' to describe the organisms. Or rewrite it to say 'The lichening process makes the old building beautiful.'"},{"incorrect":"✗ The tree is lichening.","correct":"✓ The tree is becoming covered in lichens.","note":"It's more common to say 'becoming covered in lichens' or 'developing lichens' than to use 'lichening' as a verb in continuous tense."}],"priority":"★☆☆"},"related_words":{"derivatives":["lichen (noun)","lichened (adjective)","lichenify (verb)","lichenization (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in general language learning materials)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lichening' is a technical term related to the biological process of lichen growth on surfaces. It is not typically encountered in general English usage and is more likely to appear in scientific or environmental contexts. Understanding this word requires familiarity with the concept of lichens as composite organisms and the processes by which they colonize surfaces."},"example_sentences":[{"sentence":"The slow lichening of the gravestones gave them a weathered, ancient appearance.","translation":"墓石がゆっくりと地衣類に覆われることで、風化した古代の趣が生まれた。","type":"verb (gerund)","meaning_category":"process of lichen growth"},{"sentence":"Scientists studied the lichening rates on different rock types to assess air quality.","translation":"科学者たちは、大気質を評価するために、さまざまな岩石の種類における地衣類化の速度を調査した。","type":"noun (process)","meaning_category":"process of lichen growth"},{"sentence":"The old wooden fence was undergoing rapid lichening due to the damp conditions.","translation":"古い木製のフェンスは、湿った状態のために急速な地衣類化を受けていた。","type":"verb (present participle)","meaning_category":"process of lichen growth"}]}