{"word":"Cartelizing","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"カルテルを形成する、カルテル化する","english_definition":"To form a cartel; to organize or combine into a cartel.","examples":[{"sentence":"The industry was accused of cartelizing to fix prices.","translation":"その業界は価格を固定するためにカルテルを形成していると非難された。"},{"sentence":"Efforts to cartelize the market failed due to lack of cooperation.","translation":"市場をカルテル化する試みは、協力不足のために失敗した。"}],"collocations":["cartelize the market","cartelize an industry"],"synonyms":["collude","monopolize","syndicate"],"antonyms":["decentralize","deregulate","liberalize"]},{"part_of_speech":"verb","transitivity":"vi","definition":"カルテルを形成する","english_definition":"To join or participate in a cartel.","examples":[{"sentence":"Smaller companies feared being forced into cartelizing with larger ones.","translation":"中小企業は、大企業とのカルテル化を強制されることを恐れた。"}],"collocations":["cartelizing with","cartelizing against"],"synonyms":["collude","conspire"],"antonyms":["compete","differentiate"]}],"etymology":{"value":"The word 'cartelizing' is derived from 'cartel', which comes from the German word 'Kartell'. It refers to an association of manufacturers or suppliers with the purpose of maintaining prices at a high level and restricting competition. The suffix '-ize' is added to form a verb, indicating the act of forming or becoming a cartel.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɑːrtəlaɪzɪŋ/","syllables":"car-tel-iz-ing"},"inflection":{"verb_forms":{"present_simple":["cartelizes"],"past_simple":"cartelized","past_participle":"cartelized","present_participle":"cartelizing"}},"usage_notes":{"explanation":"'Cartelizing' is used to describe the action of forming or participating in a cartel, which is an agreement between competing firms to control prices or exclude entry of a new competitor in a market. It is often used in the context of economics, business, and law.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The government encouraged cartelizing to stabilize the economy.","correct":"✓ The government discouraged cartelizing to promote competition.","note":"Cartelizing is generally viewed negatively due to its anti-competitive effects. Governments typically discourage it. "},{"incorrect":"✗ Cartelizing is beneficial for consumers because it lowers prices.","correct":"✓ Cartelizing is harmful to consumers because it raises prices.","note":"Cartels typically aim to increase prices and profits for their members, which is detrimental to consumers."}],"priority":"★★☆"},"related_words":{"derivatives":["cartel (noun)","cartelization (noun)"],"phrases":["price fixing","market manipulation","anti-competitive practices"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cartelizing' refers to the act of forming a cartel, which is when businesses agree to control prices or limit competition. This word is mostly used in economics or law when discussing how companies might try to unfairly control a market. It's not a common word in everyday conversation, but it's important to understand in the context of business and economics.","priority":"★★☆"},"example_sentences":[{"sentence":"Several companies were found guilty of cartelizing the cement market.","translation":"複数の企業がセメント市場をカルテル化していたとして有罪判決を受けた。","type":"verb","meaning_category":"カルテルを形成する"},{"sentence":"The government has taken measures to prevent companies from cartelizing.","translation":"政府は企業がカルテルを形成するのを防ぐための措置を講じてきた。","type":"verb","meaning_category":"カルテルを形成する"}]}