{"word":"prediality","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)不動産に付随する権利または義務、地役権","english_definition":"(law) A right or obligation that is attached to a piece of real property.","examples":[{"sentence":"The prediality of the easement allows the owner of one property to cross another.","translation":"地役権の不動産付随性により、ある不動産の所有者は別の不動産を横断することができます。"}],"collocations":["predial servitude","predial obligation"],"synonyms":["easement","right-of-way"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word \"praedialis,\" pertaining to land or estates, which in turn comes from \"praedium,\" meaning estate or farm.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːdiˈæləti/","syllables":"pre-di-al-i-ty"},"inflection":{"noun_plural":"predialities"},"usage_notes":{"explanation":"\"Prediality\" is a legal term primarily used in civil law jurisdictions, particularly in the context of property law. It refers to the characteristic of certain rights or obligations that are inherently linked to a specific piece of land. This means that the right or obligation benefits or burdens the land itself, rather than a specific individual. A common example is an easement, where the right to use a neighboring property (e.g., for access) is tied to the ownership of a particular piece of land.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The prediality was assigned to the person.","correct":"✓ The prediality was assigned to the land.","note":"Prediality refers to rights or obligations attached to the land, not to a person. Therefore, it is incorrect to say it is assigned to a person."}],"priority":"★☆☆"},"related_words":{"derivatives":["predial (adjective: pertaining to land or farms)","praedium (noun: estate or farm - Latin)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized Legal Term)","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Prediality\" is a highly specialized legal term primarily encountered in the context of property law, especially within civil law systems. It denotes the quality of a right or obligation being inherently connected to a specific piece of land, rather than being a personal right or obligation. Understanding this term requires familiarity with legal concepts related to property ownership, easements, and servitudes. Due to its technical nature and limited usage outside legal contexts, it is considered an advanced vocabulary word.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **prediality** of the servitude ensures that future owners of the property will also have the right of access.","translation":"地役権の不動産付随性により、その不動産の将来の所有者も通行権を有することが保証されます。","type":"noun","meaning_category":"不動産に付随する権利または義務"}]}