{"word":"dioicous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学)雌雄異株の","english_definition":"(of a plant or species) having the male and female reproductive organs on separate individuals.","examples":[{"sentence":"Willow trees are dioicous, with male and female flowers on separate trees.","translation":"ヤナギは雌雄異株であり、雄花と雌花が別の木に咲きます。"},{"sentence":"Dioicous species rely on wind or insects for pollination.","translation":"雌雄異株の種は、受粉のために風や昆虫に頼っています。"}],"collocations":["dioicous plant","dioicous species","dioecious flowering plant"],"synonyms":["dioecious","unisexual"],"antonyms":["monoecious","bisexual","hermaphroditic"]}],"etymology":{"value":"Derived from the Greek words 'di-' meaning 'two' and 'oikos' meaning 'house'.","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈɔɪkəs/","syllables":"di-o-i-cous"},"inflection":{"notes":"Does not inflect; the plural form is 'dioicous' as well."},"usage_notes":{"explanation":"The term 'dioicous' is primarily used in botany to describe plants that have separate male and female individuals. It is often used interchangeably with 'dioecious'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The dioicous animal.","correct":"✓ The dioecious plant.","note":"'Dioicous' is primarily used to describe plants, not animals."},{"incorrect":"✗ This plant is dioicous because it has both male and female flowers on the same plant.","correct":"✓ This plant is monoecious because it has both male and female flowers on the same plant.","note":"Dioicous plants have male and female flowers on separate plants. Plants with both types of flowers on the same plant are monoecious."}],"priority":"★★★"},"related_words":{"derivatives":["dioecy (noun): the condition of being dioecious"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Dioicous' is a technical term used in botany to describe plants that have separate male and female individuals. It is not a commonly used word in everyday language. Understanding this term requires knowledge of basic botanical concepts related to plant reproduction."},"example_sentences":[{"sentence":"Most holly species are dioicous, requiring both male and female plants for berry production.","translation":"ほとんどのヒイラギの種は雌雄異株であり、果実を生産するには雄株と雌株の両方が必要です。","type":"adjective","meaning_category":"雌雄異株の"},{"sentence":"The evolutionary advantage of being dioicous is thought to promote outcrossing and genetic diversity.","translation":"雌雄異株であることの進化上の利点は、異系交配と遺伝的多様性を促進すると考えられています。","type":"adjective","meaning_category":"雌雄異株の"}]}