{"word":"saw-fly","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(昆虫) キバチ","english_definition":"any of a large group of insects related to wasps and ants, the females of which have a saw-like ovipositor used to cut into plants for laying eggs.","examples":[{"sentence":"The rose bushes were infested with saw-fly larvae.","translation":"バラの茂みはキバチの幼虫に侵食されていた。"},{"sentence":"Saw-flies can cause significant damage to crops and trees.","translation":"キバチは作物や木に重大な損害を与える可能性がある。"}],"collocations":["saw-fly larvae","saw-fly infestation","control saw-flies"],"synonyms":["none (specific synonym, use general insect terms)"],"antonyms":["none (no direct antonym)"]}],"etymology":{"value":"The name \"saw-fly\" comes from the saw-like structure (ovipositor) that the female uses to cut into plants when laying eggs.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɔːflaɪ/","syllables":"saw-fly"},"inflection":{"noun_plural":"saw-flies"},"usage_notes":{"explanation":"Saw-flies are plant-feeding insects, and their larvae often resemble caterpillars. They are named for the saw-like ovipositor of the female, which is used to insert eggs into plant tissue. They are not true flies (Diptera) but belong to the order Hymenoptera, which also includes wasps, bees, and ants.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a sawfly on my window.","correct":"✓ I saw a saw-fly on my window.","note":"The correct spelling is with a hyphen: saw-fly."},{"incorrect":"✗ Sawflies are flies.","correct":"✓ Saw-flies are related to wasps, bees, and ants.","note":"Saw-flies are not true flies, although they are insects."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Hymenoptera (order)","ovipositor","larva","insect","wasp","bee","ant"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"saw-fly\" refers to a specific type of insect. It's not a common word in everyday conversation, but it's used in contexts related to gardening, agriculture, and entomology. Understanding this term requires some knowledge of insect classification and plant pests."},"example_sentences":[{"sentence":"The gardener sprayed the plants to control the **saw-fly** population.","translation":"庭師はキバチの個体数を抑制するために植物に殺虫剤を散布した。","type":"general","meaning_category":"insect pest"},{"sentence":"Damage from **saw-fly** larvae can defoliate entire trees.","translation":"キバチの幼虫による被害は、木全体を落葉させることがある。","type":"general","meaning_category":"insect damage"}]}