{"word":"pseudoliberally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"偽リベラル的に、見せかけのリベラルな態度で","english_definition":"In a manner that is falsely or superficially liberal; in a way that only appears to be liberal.","examples":[{"sentence":"He pseudoliberally supported the cause, but his actions revealed his true conservative beliefs.","translation":"彼は偽リベラル的にその運動を支持したが、彼の行動は彼の真の保守的な信念を明らかにした。"},{"sentence":"The company pseudoliberally advertised its environmental efforts, while continuing to pollute the river.","translation":"その会社は偽リベラル的に環境への取り組みを宣伝しながら、川を汚染し続けた。"}],"collocations":["act pseudoliberally","speak pseudoliberally","behave pseudoliberally","support pseudoliberally"],"synonyms":["superficially","ostensibly","falsely","hypocritically"],"antonyms":["genuinely","sincerely","truly","authentically"]},{"part_of_speech":"adjective","definition":"偽リベラルな、見せかけのリベラルな","english_definition":"Characterized by a false or superficial appearance of being liberal.","examples":[{"sentence":"The politician's pseudoliberally stance was seen as a cynical attempt to gain votes.","translation":"その政治家の偽リベラルな態度は、票を得るための皮肉な試みと見なされた。"},{"sentence":"The pseudoliberally policies did little to address the underlying social inequalities.","translation":"その偽リベラルな政策は、根底にある社会的不平等をほとんど解決しなかった。"}],"collocations":["pseudoliberally policies","pseudoliberally stance","pseudoliberally views","pseudoliberally arguments"],"synonyms":["superficial","ostensible","false","hypocritical"],"antonyms":["genuine","sincere","true","authentic"]}],"etymology":{"value":"Formed by combining \"pseudo-\" (meaning false or imitation) with \"liberally\" (in a liberal manner).","priority":"★★★"},"pronunciation":{"ipa":"ˌsuːdoʊˈlɪbərəli","syllables":"pseu-do-lib-er-al-ly"},"inflection":{"notes":"As an adverb, it does not inflect. As an adjective, it can be used to modify nouns."},"usage_notes":{"explanation":"The term \"pseudoliberally\" is used to describe actions, statements, or policies that appear to be liberal but are, in reality, insincere or intended to deceive. It often implies a criticism of someone who is trying to present themselves as liberal for personal or political gain.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted very pseudoliberally, that was sincere.","correct":"✓ He acted pseudoliberally, but it wasn't sincere.","note":"The word implies insincerity, so avoid using it in a context that suggests genuine belief."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudoliberal (noun/adjective)","pseudo- (prefix)","liberal (adjective/noun)","liberally (adverb)"],"phrases":["virtue signaling","performative activism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'pseudoliberally' is a complex term used to describe something that appears liberal on the surface but is actually insincere or deceptive. It's used to critique actions or statements that are falsely presented as liberal, often for personal or political advantage. Understanding this word requires a grasp of both the prefix 'pseudo-' (meaning false) and the concept of liberalism."},"example_sentences":[{"sentence":"The corporation pseudoliberally supported LGBTQ+ rights during Pride month, but donated to anti-LGBTQ+ politicians the rest of the year.","translation":"その企業はプライド月間中に偽リベラル的にLGBTQ+の権利を支持したが、一年の残りの期間は反LGBTQ+の政治家に寄付をした。","type":"adverb","meaning_category":"見せかけのリベラルな態度で"},{"sentence":"The pseudoliberally policies were designed to appeal to younger voters.","translation":"その偽リベラルな政策は、若い有権者にアピールするように設計された。","type":"adjective","meaning_category":"見せかけのリベラルな"}]}