{"word":"Hellenistic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ヘレニズムの、ヘレニズム時代の","english_definition":"Relating to Greek history, language, and culture from the death of Alexander the Great to the defeat of Cleopatra and Mark Antony by Octavian in 31 BC. During this period Greek influence was dominant in the Mediterranean region.","examples":[{"sentence":"Hellenistic art and architecture.","translation":"ヘレニズム美術と建築。"},{"sentence":"The Hellenistic period saw the rise of new philosophical schools.","translation":"ヘレニズム時代には、新しい哲学の学派が台頭した。"}],"collocations":["Hellenistic period","Hellenistic culture","Hellenistic art","Hellenistic philosophy","Hellenistic world"],"synonyms":["Greco-Roman","Alexandrian"],"antonyms":[]},{"part_of_speech":"noun","definition":"ヘレニズム時代","english_definition":"The period of Greek history and culture from the death of Alexander the Great to the defeat of Cleopatra and Mark Antony by Octavian in 31 BC.","examples":[{"sentence":"The Hellenistic age was a time of great cultural exchange.","translation":"ヘレニズム時代は、文化交流が盛んな時代だった。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Greek 'Hellēnistikos', pertaining to a 'Hellēnistes' (one who imitates Greeks or speaks Greek). 'Hellēnistes' comes from 'Hellēnizein' (to speak Greek, to act like a Greek), which derives from 'Hellēn' (a Greek).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛlɪˈnɪstɪk/","syllables":"Hel-le-nis-tic"},"inflection":{"noun_plural":"None (used as a proper noun or adjective)"},"usage_notes":{"explanation":"'Hellenistic' refers specifically to the period and culture that followed Alexander the Great's conquests, characterized by a fusion of Greek culture with those of the Near East and Egypt. It's distinct from 'Hellenic', which refers to ancient Greece before Alexander.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He studied Hellenic art from the Hellenistic period.","correct":"✓ He studied Hellenistic art from the Hellenistic period.","note":"'Hellenic' refers to classical Greek art, while 'Hellenistic' refers to the art of the Hellenistic period (after Alexander the Great)."},{"incorrect":"✗ The Hellenistic people were purely Greek.","correct":"✓ The Hellenistic culture was a blend of Greek and Eastern influences.","note":"Hellenistic culture was a fusion of Greek and other cultures, not purely Greek."}],"priority":"★★☆"},"related_words":{"derivatives":["Hellenism","Hellenist","Hellenize"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Hellenistic' is used in historical and academic contexts to describe the period and culture following Alexander the Great, characterized by the spread of Greek influence in the Eastern Mediterranean. It is important to distinguish it from 'Hellenic,' which refers to ancient Greece before Alexander's conquests. Understanding the historical context is crucial for using this word correctly."},"example_sentences":[{"sentence":"The library of Alexandria was a major center of Hellenistic learning.","translation":"アレクサンドリア図書館は、ヘレニズム文化における主要な学術の中心地でした。","type":"adjective","meaning_category":"Relating to Hellenistic period"},{"sentence":"Many Hellenistic cities were founded in the Near East.","translation":"多くのヘレニズム都市が近東に建設されました。","type":"adjective","meaning_category":"Relating to Hellenistic period"},{"sentence":"The Hellenistic period saw significant advancements in science and mathematics.","translation":"ヘレニズム時代には、科学と数学において著しい進歩が見られました。","type":"noun","meaning_category":"Hellenistic period"}]}