{"word":"hypsothermometer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"沸点温度計、高山沸点温度計","english_definition":"An instrument for determining altitudes by measuring the boiling point of water.","examples":[{"sentence":"The explorer used a hypsothermometer to determine the altitude of the mountain peak.","translation":"探検家は高山沸点温度計を使って山頂の高度を測定した。"},{"sentence":"Hypsothermometers are useful in areas where accurate maps are not available.","translation":"沸点温度計は正確な地図がない地域で役立つ。"}],"collocations":["determine altitude with a hypsothermometer","use a hypsothermometer for measurement"],"synonyms":["boiling-point thermometer"],"antonyms":[]}],"etymology":{"value":"From 'hypso-' meaning height or altitude, 'thermo-' referring to heat, and '-meter' indicating a measuring device.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɪpsəʊθərˈmɒmɪtər/","syllables":"hyp-so-ther-mom-e-ter"},"inflection":{"noun_plural":"hypsothermometers"},"usage_notes":{"explanation":"A hypsothermometer is primarily used in situations where barometric pressure is unreliable or unknown, such as in mountainous regions or during unstable weather conditions. The boiling point of water decreases with altitude due to lower atmospheric pressure, allowing for altitude determination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hypsothermometer measures temperature directly.","correct":"✓ The hypsothermometer measures altitude based on the boiling point of water.","note":"Hypsothermometers do not directly measure temperature, but infer altitude from the boiling point of water."}],"priority":"★★☆"},"related_words":{"derivatives":["hypsometry (測高法)","thermometer (温度計)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hypsothermometer' is a technical term used in geography, surveying, and meteorology. It refers to a specific type of thermometer that measures altitude based on the principle that the boiling point of water decreases with increasing altitude. Understanding the concept requires familiarity with physics and measurement techniques.","priority":"★★☆"},"example_sentences":[{"sentence":"The scientist calibrated the hypsothermometer before taking measurements on the remote island.","translation":"科学者は、離島で測定を行う前に沸点温度計を校正した。","type":"noun","meaning_category":"instrument"},{"sentence":"Using the hypsothermometer, they were able to accurately estimate their position in the uncharted territory.","translation":"沸点温度計を使用することで、彼らは未踏の地での自分たちの位置を正確に推定することができた。","type":"noun","meaning_category":"instrument"}]}