{"word":"Amphipoda","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"端脚類（たんきゃくるい）","english_definition":"An order of malacostracan crustaceans with no carapace and generally with a laterally compressed body. Includes sandhoppers, beach fleas, scuds, etc.","examples":[{"sentence":"Amphipods are found in marine, freshwater, and terrestrial environments.","translation":"端脚類は海洋、淡水、および陸上の環境で見られる。"}],"collocations":["marine amphipods","freshwater amphipods","terrestrial amphipods"],"synonyms":["scud","sandhopper","beach flea"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ἀμφίς (amphís, “on both sides”) + πούς (poús, “foot”). Referring to the different forms of legs that amphipods possess.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæmˈfɪpədə/","syllables":"Am-phi-po-da"},"inflection":{"noun_plural":"Amphipods"},"usage_notes":{"explanation":"Amphipoda refers to the taxonomic order of crustaceans commonly known as amphipods. They are characterized by their lack of a carapace and their laterally compressed bodies. The term is primarily used in scientific and zoological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an amphipod on the beach, it was an insect.","correct":"✓ I saw an amphipod on the beach, it was a crustacean.","note":"Amphipods are crustaceans, not insects."}],"priority":"★★☆"},"related_words":{"derivatives":["amphipod (singular noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amphipoda' is a scientific term used in biology and zoology to refer to a specific order of crustaceans. It is not commonly used in everyday language. Understanding this term requires a background in biology or zoology.","priority":"★★☆"},"example_sentences":[{"sentence":"Scientists are studying the biodiversity of Amphipoda in the deep sea.","translation":"科学者たちは深海における端脚類の生物多様性を研究している。","type":"scientific","meaning_category":"端脚類"},{"sentence":"Some species of Amphipoda are used as indicators of water quality.","translation":"端脚類の一部の種は、水質指標として使用されている。","type":"ecological","meaning_category":"端脚類"}]}