{"word":"Esterification","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"エステル化：アルコールとカルボン酸が反応してエステルと水を生成する化学反応","english_definition":"A chemical reaction in which an ester is formed from an alcohol and a carboxylic acid.","examples":[{"sentence":"Esterification is commonly used in the production of fragrances and flavors.","translation":"エステル化は、香料やフレーバーの製造によく用いられます。"},{"sentence":"The esterification process requires a catalyst to speed up the reaction.","translation":"エステル化のプロセスは、反応を促進するために触媒を必要とします。"}],"collocations":["acid-catalyzed esterification","Fischer esterification","direct esterification","enzymatic esterification"],"synonyms":["ester synthesis","ester formation"],"antonyms":["hydrolysis (エステルの加水分解)"]}],"etymology":{"value":"「ester」+「-ification」（～化）から。エステルという用語は、ドイツの化学者レオポルト・グメリンによって1848年に作られた。","priority":"★★☆"},"pronunciation":{"ipa":"ɪˌstɛrɪfɪˈkeɪʃən","syllables":"e-ster-i-fi-ca-tion"},"inflection":{"noun_plural":"esterifications"},"usage_notes":{"explanation":"Esterification is a fundamental reaction in organic chemistry, widely used in various industrial applications. The reaction typically involves a carboxylic acid and an alcohol, often with an acid catalyst to enhance the reaction rate. The reverse reaction is known as hydrolysis, where an ester is broken down into an alcohol and a carboxylic acid by water.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Esterification is when you add water to an ester.","correct":"✓ Esterification is when you combine an alcohol and a carboxylic acid to form an ester and water.","note":"Esterification is the formation of an ester from an alcohol and a carboxylic acid, not the addition of water to an ester (which is hydrolysis)."},{"incorrect":"✗ Esterification only happens with strong acids.","correct":"✓ Esterification can be catalyzed by both strong and weak acids.","note":"While strong acids are commonly used as catalysts, esterification can also occur with weaker acids or even enzymatic catalysts."}],"priority":"★★☆"},"related_words":{"derivatives":["esterify (動詞: エステル化する)","esterified (形容詞: エステル化された)"],"related_terms":["alcohol","carboxylic acid","ester","catalyst","hydrolysis"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"低頻度 (Low frequency) - 化学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Esterification is a chemical process where an alcohol and a carboxylic acid react to form an ester and water. It's a fundamental reaction in organic chemistry, often requiring a catalyst to speed up the process. This reaction is commonly used in industrial applications such as the production of fragrances, flavors, and polymers. The reverse reaction, hydrolysis, involves breaking down an ester into an alcohol and a carboxylic acid using water. Understanding esterification is crucial in fields like chemistry, biochemistry, and materials science."},"example_sentences":[{"sentence":"The esterification of acetic acid with ethanol produces ethyl acetate.","translation":"酢酸とエタノールのエステル化は、酢酸エチルを生成します。","type":"noun","meaning_category":"化学反応"},{"sentence":"Sulfuric acid is often used as a catalyst in esterification reactions.","translation":"硫酸は、エステル化反応において触媒としてよく使用されます。","type":"noun","meaning_category":"化学反応における利用"},{"sentence":"Esterification is an important process in the synthesis of many polymers.","translation":"エステル化は、多くのポリマーの合成において重要なプロセスです。","type":"noun","meaning_category":"ポリマー合成"}]}