{"word":"historically-grounded","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"歴史的根拠に基づいた、歴史的背景に立脚した","english_definition":"based on or having a firm foundation in historical facts or context.","examples":[{"sentence":"The author's analysis is historically-grounded, drawing on extensive archival research.","translation":"著者の分析は、広範なアーカイブ調査に基づいた歴史的根拠のあるものだ。"},{"sentence":"The film offers a historically-grounded portrayal of the events leading up to the revolution.","translation":"その映画は、革命に至るまでの出来事を歴史的背景に立脚して描いている。"},{"sentence":"A historically-grounded understanding of the conflict is essential for finding a lasting solution.","translation":"紛争の永続的な解決策を見つけるためには、歴史的根拠に基づいた理解が不可欠だ。"}],"collocations":["historically-grounded analysis (歴史的根拠に基づいた分析)","historically-grounded perspective (歴史的背景に立脚した視点)","historically-grounded approach (歴史的根拠に基づいたアプローチ)","historically-grounded research (歴史的根拠に基づいた研究)","historically-grounded account (歴史的根拠に基づいた記述)"],"synonyms":["historically-based","historically-informed","rooted in history","historically-contextualized"],"antonyms":["ahistorical","decontextualized","unhistorical"]}],"etymology":{"value":"The word is formed by combining 'historical' (relating to history) with 'grounded' (having a firm foundation or basis). The combination indicates something that is firmly based on or derived from historical facts and understanding.","priority":"☆☆☆"},"pronunciation":{"ipa":"/hɪˈstɒrɪkli ˈɡraʊndɪd/","syllables":"hi-stor-i-cal-ly ground-ed"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns. Comparative and superlative forms are not typically used (e.g., *more historically-grounded* is less common than *more firmly historically-grounded*)."},"usage_notes":{"explanation":"'Historically-grounded' is used to describe something that is based on or has a strong connection to historical facts, events, or contexts. It implies a deep understanding and consideration of history in the development or analysis of a subject. It is often used in academic, scholarly, or analytical contexts to emphasize the importance of historical perspective.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The theory is historically grounded.","correct":"✓ The theory is historically-grounded.","note":"The hyphen is important to connect 'historically' and 'grounded' to form a single adjective modifying the noun. Without the hyphen, the sentence may be grammatically incorrect or have a different meaning."},{"incorrect":"✗ The historically ground theory.","correct":"✓ The historically-grounded theory.","note":"The adjective should be formed correctly with the hyphen."}],"priority":"☆☆☆"},"related_words":{"derivatives":["historical (adjective)","history (noun)","grounded (adjective)"],"phrases":["historical context","historical analysis","historical perspective","historical research"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'historically-grounded' is a relatively advanced term often used in academic or scholarly writing. It indicates that something is based on a solid understanding and consideration of historical facts and context. To understand this term, one should be familiar with the meanings of 'historical' (relating to history) and 'grounded' (firmly based or established). The hyphenated form is crucial to its meaning as a compound adjective."},"example_sentences":[{"sentence":"Her research provides a historically-grounded account of the social changes in the 19th century.","translation":"彼女の研究は、19世紀の社会変化に関する歴史的根拠に基づいた記述を提供している。","type":"general","meaning_category":"general"},{"sentence":"The course aims to provide students with a historically-grounded understanding of political ideologies.","translation":"このコースは、学生に政治イデオロギーに関する歴史的根拠に基づいた理解を提供することを目的としている。","type":"academic","meaning_category":"academic"},{"sentence":"The museum's exhibit offers a historically-grounded perspective on the development of modern art.","translation":"博物館の展示は、近代美術の発展に関する歴史的背景に立脚した視点を提供している。","type":"cultural","meaning_category":"cultural"}]}