{"word":"dowress","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"寡婦、特に亡夫の財産から生活費を受け取る権利を持つ寡婦","english_definition":"A widow who has a dower; especially, one who has a life interest in the estate of her deceased husband for her support.","examples":[{"sentence":"The dowress lived comfortably on the income from her late husband's estate.","translation":"その寡婦は、亡き夫の財産からの収入で快適に暮らしていた。"},{"sentence":"Under common law, a dowress was entitled to a portion of her husband's lands.","translation":"慣習法の下では、寡婦は夫の土地の一部を受け取る権利があった。"}],"collocations":["dowress estate","former dowress","wealthy dowress"],"synonyms":["widow","relict"],"antonyms":["husband","married woman"]}],"etymology":{"value":"From Middle English *dowageresse*, from *dowager* + *-esse*.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdaʊ.rɪs/","syllables":"dow-ress"},"inflection":{"noun_plural":"dowresses"},"usage_notes":{"explanation":"The term 'dowress' is somewhat archaic and refers specifically to a widow who holds a dower, which is a legal right to a portion of her deceased husband's estate. It is less commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She became a dowress after her divorce.","correct":"✓ She became a dowager after her divorce.","note":"'Dowress' refers to a widow, not a divorcee. 'Dowager' is a more general term for a widow with a title or property from her late husband."}],"priority":"★☆☆"},"related_words":{"derivatives":["dower","dowager"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'dowress' is an archaic term referring to a widow who has a dower, which is a legal right to a portion of her deceased husband's estate. This term is rarely used in modern English and is more likely to be encountered in historical or legal contexts. Understanding this word requires familiarity with historical property laws and social customs.","priority":"★☆☆"},"example_sentences":[{"sentence":"The dowress received a life estate in her husband's property.","translation":"その寡婦は、夫の財産に対する終身財産権を受け取った。","type":"noun","meaning_category":"寡婦"}]}