{"word":"Executers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 実行者、遂行者 (executor の複数形)","english_definition":"(plural form) persons who carry out or perform a task, role, or duty; often referring to the plural of 'executor', someone appointed to carry out the terms of a will.","examples":[{"sentence":"The will named three executers to manage the estate.","translation":"遺言書は、遺産を管理する3人の執行者を指名した。"},{"sentence":"The executers of the project were responsible for its success.","translation":"そのプロジェクトの実行者たちは、その成功に責任を負っていた。"},{"sentence":"As executers, they had a fiduciary duty to act in the best interests of the beneficiaries.","translation":"執行者として、彼らは受益者の最大の利益のために行動する受託者責任を負っていた。"}],"collocations":["Executers of a will (遺言執行者)","Project executers (プロジェクト実行者)","Estate executers (遺産執行者)"],"synonyms":["performers","implementers","administrators","agents","operators"],"antonyms":["beneficiaries","recipients","receivers"]}],"etymology":{"value":"'Executers' is simply the plural form of 'executer', which is an archaic or less common spelling of 'executor'. 'Executor' comes from the Latin 'exsequi', meaning 'to follow out, carry out, perform', combined with the agent suffix '-tor'.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈɛɡzɪˌkjuːtərz/","syllables":"Ex-e-cu-ters"},"inflection":{"noun_plural":"Executers"},"usage_notes":{"explanation":"'Executers' is primarily encountered as the plural of 'executor,' particularly in legal contexts related to wills and estates. While 'executors' is the more common and preferred spelling, 'executers' is still recognizable, though it may sound slightly old-fashioned or less formal. Outside of legal contexts, it can refer to individuals responsible for carrying out a specific task or project, but more common terms like 'implementers' or 'performers' are often used instead.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The executers was responsible for the estate.","correct":"✓ The executers were responsible for the estate.","note":"Since 'executers' is plural, the verb must agree and be in the plural form ('were' instead of 'was')."},{"incorrect":"✗ He is one of the executers.","correct":"✓ He is one of the executors.","note":"Ensure the spelling is correct. While 'executers' is a valid plural form, 'executors' is the more commonly used and accepted spelling."}],"priority":"★★☆"},"related_words":{"derivatives":["execute (verb): to carry out, perform","execution (noun): the act of carrying out or performing","executor (noun): a person appointed to carry out the terms of a will","executrix (noun): a female executor"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very specialized legal vocabulary)","frequency_google_ngram":"Low frequency (as 'executers', compared to 'executors')","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Executers' refers to multiple individuals who are responsible for carrying out specific tasks, often in a legal or formal context. It's most commonly used as the plural form of 'executor', which is someone named in a will to manage and distribute the deceased person's assets. While 'executers' is a valid form, 'executors' is much more commonly used. The term implies a significant level of responsibility and legal obligation."},"example_sentences":[{"sentence":"The executers of the trust diligently managed the assets.","translation":"信託の執行者たちは、資産を勤勉に管理した。","type":"noun","meaning_category":"執行者"},{"sentence":"The court appointed the executers to oversee the distribution of the inheritance.","translation":"裁判所は相続財産の分配を監督するために執行者を任命した。","type":"noun","meaning_category":"執行者"},{"sentence":"The executers had to follow the instructions outlined in the detailed will.","translation":"執行者たちは、詳細な遺言書に概説された指示に従わなければならなかった。","type":"noun","meaning_category":"執行者"}]}