{"word":"phratral","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(古代ギリシアの)氏族同盟の、氏族集団の","english_definition":"Relating to or characteristic of a phratry.","examples":[{"sentence":"The phratral organization was important in ancient Athenian society.","translation":"氏族同盟の組織は古代アテネ社会において重要だった。"},{"sentence":"Phratral festivals were held to celebrate kinship.","translation":"氏族同盟の祭りは血縁関係を祝うために開催された。"}],"collocations":["phratral organization","phratral festival","phratral membership"],"synonyms":["clan-related","tribal","fraternal"],"antonyms":[]}],"etymology":{"value":"Derived from the word 'phratry', which comes from the Greek word 'phratria' (φρατρία), meaning a brotherhood or a group of related clans in ancient Greece.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfreɪtrəl/","syllables":"phra-tral"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Phratral' is an adjective that describes something related to a 'phratry'. A phratry was a social division, a brotherhood or a group of related clans, especially in ancient Greece. It's a term mainly used in historical or anthropological contexts when discussing ancient Greek society or similar social structures in other cultures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The phratral is a member of the phratry.","correct":"✓ The phratry member is a member of the phratry.","note":"'Phratral' is an adjective, not a noun. Use it to describe something related to a phratry, not as a substitute for a member of the phratry."}],"priority":"★★☆"},"related_words":{"derivatives":["phratry (noun): A brotherhood or a group of related clans, especially in ancient Greece."],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'phratral' is a specialized term primarily used in the context of ancient Greek history and anthropology. It describes something related to a 'phratry', which was a social division or brotherhood in ancient Greece. Due to its specific and historical context, it is not commonly used in everyday language. Understanding this term requires familiarity with ancient Greek social structures and terminology."},"example_sentences":[{"sentence":"The phratral ties strengthened the community's social bonds.","translation":"氏族同盟の絆は共同体の社会的結束を強めた。","type":"adjective","meaning_category":"氏族同盟の"},{"sentence":"Each citizen belonged to a phratral group.","translation":"各市民は氏族同盟のグループに所属していた。","type":"adjective","meaning_category":"氏族同盟の"}]}