{"word":"noncoagulating","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"凝固しない、凝結しない","english_definition":"Not undergoing coagulation; remaining in a liquid state and not forming a clot or solid mass.","examples":[{"sentence":"Noncoagulating blood is essential for certain medical procedures.","translation":"凝固しない血液は、特定の医療処置に不可欠です。"},{"sentence":"The scientist studied the properties of the noncoagulating solution.","translation":"科学者は、凝固しない溶液の特性を研究しました。"}],"collocations":["noncoagulating blood","noncoagulating solution","noncoagulating agent"],"synonyms":["uncoagulating","liquid","fluid"],"antonyms":["coagulating","clotting","solidifying"]}],"etymology":{"value":"Derived from the prefix 'non-' (meaning 'not') combined with the word 'coagulating' (the present participle of 'coagulate', meaning 'to change to a solid or semi-solid state').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.koʊˈæɡ.jʊ.leɪ.tɪŋ/","syllables":"non-co-ag-u-la-ting"},"inflection":{"notes":"Adjective; does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"'Noncoagulating' is a technical term primarily used in scientific and medical contexts. It describes substances, especially liquids like blood or solutions, that do not thicken or solidify into a clot or gel-like state. This property is often crucial for specific applications, such as in medical procedures or laboratory experiments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-coagulating is important.","correct":"✓ The noncoagulating property is important.","note":"'Noncoagulating' is an adjective and needs to modify a noun. Using it alone as a noun is grammatically incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["coagulate (verb)","coagulation (noun)","coagulant (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily found in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'noncoagulating' is a specialized adjective typically encountered in scientific or medical texts. It describes a substance's property of not undergoing coagulation, which is the process of a liquid changing to a solid or semi-solid state. Due to its technical nature, it is less common in everyday language and more frequently found in professional or academic contexts related to biology, chemistry, or medicine."},"example_sentences":[{"sentence":"Heparin is used as a noncoagulating agent in blood collection tubes.","translation":"ヘパリンは、採血管内で凝固防止剤として使用されます。","type":"adjective","meaning_category":"凝固しない"},{"sentence":"The researcher observed that the mutant strain produced noncoagulating hemolymph.","translation":"研究者は、変異株が凝固しない体液を生成することを確認しました。","type":"adjective","meaning_category":"凝固しない"}]}