{"word":"homeoblastic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(地質学)等粒状組織の、均質結晶組織の","english_definition":"(geology) Having a uniform crystalline texture; composed of crystals of approximately equal size.","examples":[{"sentence":"The rock exhibited a homeoblastic texture, indicating slow and even cooling.","translation":"その岩石は等粒状組織を示しており、ゆっくりと均等に冷却されたことを示唆していた。"}],"collocations":["homeoblastic texture","homeoblastic rock"],"synonyms":["equigranular","uniform","isogranular"],"antonyms":["heteroblastic","porphyritic"]}],"etymology":{"value":"Derived from the Greek words 'homoios' (similar, uniform) and 'blastos' (bud, sprout, germ), referring to the uniform development of crystals.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhoʊmioʊˈblæstɪk/","syllables":"ho-me-o-blas-tic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Homeoblastic' is primarily used in geology to describe the texture of metamorphic rocks where the crystals are of roughly the same size. This texture suggests a consistent and uniform growth environment during metamorphism. It is often contrasted with heteroblastic textures, where crystal sizes vary significantly.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The homeoblastic structure was found in sedimentary rock.","correct":"✓ The homeoblastic structure was found in metamorphic rock.","note":"Homeoblastic textures are typically associated with metamorphic rocks, not sedimentary rocks."}],"priority":"★☆☆"},"related_words":{"derivatives":["homeoblast (noun)"],"related_terms":["granoblastic","lepidoblastic","porphyroblastic"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized geological term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Homeoblastic' is a technical term used in geology to describe rocks with a uniform texture, meaning the crystals within the rock are roughly the same size. This term is most relevant in the context of metamorphic petrology, where the texture of a rock provides clues about its formation history. Understanding this term requires some background knowledge in geology."},"example_sentences":[{"sentence":"The thin section revealed a beautifully homeoblastic texture in the quartzite.","translation":"薄片は、石英岩に見事な等粒状組織を明らかにしました。","type":"adjective","meaning_category":"地質学"},{"sentence":"Homeoblastic rocks typically form under conditions of slow, uniform cooling.","translation":"等粒状組織の岩石は通常、ゆっくりと均一な冷却条件下で形成されます。","type":"adjective","meaning_category":"地質学"}]}