{"word":"foramination","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The process of forming foramina (small holes or openings), or the state of having foramina.","english_definition":"The process of forming foramina, or the state of having foramina.","examples":[{"sentence":"The foramination of the bone allowed for the passage of blood vessels.","translation":"骨の有孔化により、血管の通過が可能になった。"},{"sentence":"Studies of skull foramination can provide insights into evolutionary biology.","translation":"頭蓋骨の有孔化の研究は、進化生物学への洞察を提供することができる。"}],"collocations":["skull foramination","bone foramination","process of foramination"],"synonyms":["perforation","fenestration","piercing"],"antonyms":[]}],"etymology":{"value":"Derived from 'foramen' (Latin for 'hole' or 'opening') + '-ation' (a suffix indicating a process or state).","priority":"★★☆"},"pronunciation":{"ipa":"/fɔːˌræmɪˈneɪʃən/","syllables":"fo-ram-i-na-tion"},"inflection":{"noun_plural":"foraminations"},"usage_notes":{"explanation":"\"Foramination\" is a relatively technical term, primarily used in biological and anatomical contexts. It refers to the development or presence of small holes or openings, particularly in bones or other tissues. The term is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["foramen","foraminate"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Foramination\" is a specialized term used in scientific contexts, particularly in biology and anatomy. It describes the process of forming small holes or openings (foramina) in a structure, such as a bone. Due to its technical nature, it is not commonly encountered in general English usage."},"example_sentences":[{"sentence":"The degree of foramination in the vertebral arch varies among different species.","translation":"椎弓の有孔化の程度は、種によって異なる。","type":"noun","meaning_category":"Process of forming foramina"},{"sentence":"Increased foramination in the skull may be indicative of certain developmental conditions.","translation":"頭蓋骨の有孔化の増加は、特定の発生状態を示している可能性がある。","type":"noun","meaning_category":"State of having foramina"}]}