{"word":"Promethazine","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"プロメタジン：フェノチアジン系の抗ヒスタミン薬。アレルギー反応、乗り物酔い、吐き気、嘔吐の治療に使用され、鎮静作用もある。","english_definition":"A phenothiazine derivative antihistamine used to treat allergic reactions, motion sickness, nausea, and vomiting. It also has sedative properties.","examples":[{"sentence":"Promethazine can cause drowsiness.","translation":"プロメタジンは眠気を引き起こす可能性がある。"},{"sentence":"The doctor prescribed promethazine for her nausea.","translation":"医師は彼女の吐き気にプロメタジンを処方した。"}],"collocations":["promethazine hydrochloride","promethazine syrup","prescribe promethazine","take promethazine","side effects of promethazine"],"synonyms":["Phenergan (brand name)","Histantil (brand name)"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'pro-' (indicating a precursor or related compound), 'meth-' (referring to a methyl group in its chemical structure), and 'azine' (denoting a class of organic compounds containing a nitrogen-containing ring).","priority":"★★☆"},"pronunciation":{"ipa":"/prəˈmɛθəziːn/","syllables":"pro-meth-a-zine"},"inflection":{"notes":"It is a noun, so it has no inflectional forms."},"usage_notes":{"explanation":"Promethazine is a prescription medication primarily used for its antihistamine and sedative effects. It is commonly available in tablet, syrup, and injectable forms. Due to its sedative properties, it is often used to treat insomnia or as a pre-operative sedative. It is important to use promethazine under the guidance of a healthcare professional due to potential side effects and interactions with other medications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I take promethazine for headache.","correct":"✓ I take promethazine for nausea.","note":"Promethazine is not typically used to treat headaches. It is primarily used for allergies, motion sickness, and nausea."},{"incorrect":"✗ Promethazine is safe for everyone.","correct":"✓ Promethazine should be used with caution and under medical supervision.","note":"Promethazine can have significant side effects and is not safe for everyone, especially children. It should only be used under medical supervision."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. It is a specialized term related to medicine.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Promethazine is a medication used to treat allergies, motion sickness, and nausea. It works by blocking histamine, a substance in the body that causes allergic symptoms. It also has a sedative effect, which means it can make you feel sleepy. It is available by prescription only and should be used under the guidance of a healthcare professional. Common side effects include drowsiness, dry mouth, and blurred vision. It is important to inform your doctor about any other medications you are taking before using promethazine, as it can interact with other drugs.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor prescribed promethazine to help alleviate her allergic reaction.","translation":"医師は彼女のアレルギー反応を和らげるためにプロメタジンを処方した。","type":"general","meaning_category":"medical"},{"sentence":"Promethazine is often used to prevent motion sickness during travel.","translation":"プロメタジンは旅行中の乗り物酔いを防ぐためによく使用される。","type":"general","meaning_category":"medical"},{"sentence":"The sedative effects of promethazine can help with insomnia.","translation":"プロメタジンの鎮静効果は不眠症に役立つことがある。","type":"general","meaning_category":"medical"}]}