{"word":"coenoecial","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"（動物学）群体性の、群体住居の","english_definition":"Relating to or forming a coenoecium (a common protective structure or housing for a colony of animals, especially bryozoans).","examples":[{"sentence":"The coenoecial structure of the bryozoan colony provides protection from predators.","translation":"コケムシのコロニーの群体住居構造は、捕食者からの保護を提供する。"},{"sentence":"Coenoecial tubes are characteristic of certain marine worms.","translation":"群体住居性の管は、特定の海洋性蠕虫の特徴である。"}],"collocations":["coenoecial tube","coenoecial structure","coenoecial colony"],"synonyms":["colonial","gregarious","communal"],"antonyms":["solitary","individual"]}],"etymology":{"value":"Derived from the Greek words 'koinos' (κοινός) meaning 'common' and 'oikia' (οικία) meaning 'dwelling' or 'house', combined with the suffix '-al' indicating relationship.","priority":"★★★"},"pronunciation":{"ipa":"/siːˈniːʃəl/","syllables":"coe-noe-ci-al"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Coenoecial' is a term primarily used in zoology, specifically when describing colonial animals such as bryozoans (moss animals) and certain marine worms. It refers to the shared or common housing structure (coenoecium) that protects the colony. The term is relatively technical and not commonly used outside of scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The coenoecial animal lived alone.","correct":"✓ The coenoecial animals lived in a colony.","note":"Coenoecial refers to a colonial lifestyle, so it is incorrect to describe a solitary animal as coenoecial."}],"priority":"★★☆"},"related_words":{"derivatives":["coenoecium (noun): the common protective structure of a colony of animals"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. A technical term used mainly in zoology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'coenoecial' is a technical term used in the field of zoology to describe structures or characteristics related to a coenoecium, which is a shared protective housing for a colony of animals. Due to its specialized usage, it is primarily encountered in scientific literature or academic discussions related to colonial organisms. Understanding the etymology (Greek roots for 'common' and 'dwelling') can aid in comprehending its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The bryozoan colony exhibited a complex coenoecial morphology.","translation":"そのコケムシのコロニーは、複雑な群体住居の形態を示した。","type":"general","meaning_category":"descriptive"},{"sentence":"Coenoecial modifications can provide valuable taxonomic information.","translation":"群体住居の修正は、貴重な分類学的情報を提供することができる。","type":"technical","meaning_category":"scientific"}]}