{"word":"latherin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A protein found in horse sweat, thought to act as a surfactant to help spread sweat evenly over the coat.","english_definition":"A protein found in horse sweat that is thought to act as a surfactant, helping to spread sweat evenly over the coat.","examples":[{"sentence":"Latherin is responsible for the frothy appearance of horse sweat.","translation":"ラセリンは馬の汗の泡状の外観の原因です。"},{"sentence":"The presence of latherin facilitates evaporative cooling in horses.","translation":"ラセリンの存在は、馬の蒸発冷却を促進します。"}],"collocations":["horse sweat","surfactant","evaporative cooling"],"synonyms":["None"],"antonyms":["None"]}],"etymology":{"value":"Derived from 'lather', referring to the frothy appearance of sweat containing this protein.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈlæθərɪn/","syllables":"lath-er-in"},"inflection":{"noun_plural":"latherins"},"usage_notes":{"explanation":"Latherin is a relatively recently discovered protein, and research into its function is ongoing. It is primarily discussed in scientific and equestrian contexts.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["lather (noun/verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Latherin' is a highly specialized term primarily used in scientific or equestrian contexts. Understanding requires knowledge of biology and/or horse care. It is not part of general vocabulary."},"example_sentences":[{"sentence":"The unique properties of latherin allow horses to cool efficiently during exercise.","translation":"ラセリンのユニークな特性により、馬は運動中に効率的に冷却できます。","type":"scientific","meaning_category":"protein function"},{"sentence":"Researchers are studying latherin to understand its potential applications in surfactant technology.","translation":"研究者たちは、界面活性剤技術における潜在的な応用を理解するためにラセリンを研究しています。","type":"scientific","meaning_category":"research"}]}