{"word":"Pauperization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"貧困化、窮乏化","english_definition":"The process by which individuals or groups become impoverished; the state of being reduced to poverty.","examples":[{"sentence":"The pauperization of the working class was a major concern during the Industrial Revolution.","translation":"産業革命期における労働者階級の貧困化は大きな懸念事項だった。"},{"sentence":"Globalization has led to the pauperization of many small farmers in developing countries.","translation":"グローバル化は発展途上国の多くの小規模農家の貧困化につながっている。"}],"collocations":["economic pauperization","social pauperization","relative pauperization","mass pauperization"],"synonyms":["impoverishment","destitution","indigence","ruin","bankrupting"],"antonyms":["enrichment","affluence","wealth","prosperity"],"related_terms":["proletarianization","marginalization","underclass"]}],"etymology":{"value":"From 'pauperize', which comes from 'pauper' (Latin for 'poor') + '-ize' (a suffix indicating a process or action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɔːpərɪˈzeɪʃən/","syllables":"pau-per-i-za-tion"},"inflection":{"noun_plural":"pauperizations"},"usage_notes":{"explanation":"'Pauperization' refers to the process or state of becoming poor, often implying a significant decline in economic or social status. It is frequently used in sociological and economic contexts to describe large-scale trends of impoverishment affecting entire groups or classes of people.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pauperization is a good thing for the economy.","correct":"✓ The pauperization is a negative trend for the economy.","note":"Pauperization is almost always a negative phenomenon, indicating a decline in living standards and economic well-being."},{"incorrect":"✗ Pauperization only affects individuals.","correct":"✓ Pauperization can affect both individuals and entire communities.","note":"While individuals can experience pauperization, the term often describes broader trends affecting large groups of people."}],"priority":"★★☆"},"related_words":{"derivatives":["pauperize (verb)","pauper (noun)","pauperized (adjective)"],"related_concepts":["economic inequality","social stratification","exploitation","capitalism","globalization"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pauperization' is a relatively complex term used in economics and sociology to describe the process by which individuals or groups become increasingly poor. It often implies a systemic issue rather than individual misfortune. This word is more likely to be encountered in academic or specialized texts discussing poverty, inequality, and economic trends.","priority":"★★☆"},"example_sentences":[{"sentence":"The government's policies led to the rapid pauperization of the rural population.","translation":"政府の政策は農村部の急速な貧困化につながった。","type":"general"},{"sentence":"Historians have documented the pauperization of many European peasants during the enclosure movements.","translation":"歴史家たちは、囲い込み運動の間に多くのヨーロッパの農民が貧困化したことを記録している。","type":"historical context"},{"sentence":"The study examines the factors contributing to the pauperization of single-parent families.","translation":"その研究は、ひとり親家庭の貧困化に寄与する要因を調査している。","type":"social study"},{"sentence":"Technological advancements, while beneficial overall, can also lead to the pauperization of workers in certain industries.","translation":"技術の進歩は全体としては有益である一方で、特定の産業の労働者の貧困化につながる可能性もある。","type":"economic analysis"}]}