{"word":"opioid-susceptible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"オピオイド感受性の、オピオイドに影響を受けやすい","english_definition":"Capable of being affected by or responding to opioids.","examples":[{"sentence":"The patient was described as opioid-susceptible, experiencing significant pain relief from morphine.","translation":"その患者はオピオイド感受性と診断され、モルヒネによって著しい鎮痛効果を経験した。"},{"sentence":"Opioid-susceptible neurons are often targeted in pain management therapies.","translation":"オピオイド感受性のニューロンは、しばしば疼痛管理療法において標的とされる。"}],"collocations":["opioid-susceptible neurons","opioid-susceptible cells","opioid-susceptible receptors","opioid-susceptible individual"],"synonyms":["opioid-sensitive","opioid-responsive"],"antonyms":["opioid-resistant","opioid-insensitive"]}],"etymology":{"value":"Derived from 'opioid' (a substance that binds to opioid receptors) and 'susceptible' (likely to be influenced or harmed by a particular thing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈoʊpiɔɪd sʌˈsɛptəbəl/","syllables":"o-pi-oid sus-cep-ti-ble"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"The term 'opioid-susceptible' is used in medical and scientific contexts to describe cells, tissues, individuals, or conditions that are responsive to opioids. It indicates that the target is likely to be affected by opioid medications or substances. It's often used in the context of pain management, neuroscience, and pharmacology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The tumor was opioid-susceptible, so we stopped treatment.","correct":"The tumor was opioid-resistant, so we stopped treatment.","note":"Opioid-susceptible means the tumor responds to opioids, so treatment would likely continue. Opioid-resistant means it doesn't respond, so treatment might be stopped."}]},"related_words":{"derivatives":["susceptibility","opioid","receptor"],"related_terms":["opioid-resistant","opioid-induced","opioid receptor"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'opioid-susceptible' is a technical term used in medical and scientific fields. It describes something that is likely to be affected by opioids. Opioids are a class of drugs used to relieve pain. If something is 'opioid-susceptible', it means it responds to these drugs. This term is most often encountered in discussions of pain management, drug development, and related research."},"example_sentences":[{"sentence":"The researchers identified a specific gene associated with opioid-susceptible pain pathways.","translation":"研究者らは、オピオイド感受性の疼痛経路に関連する特定の遺伝子を特定した。","type":"adjective","meaning_category":"オピオイド感受性の"},{"sentence":"Understanding the mechanisms behind opioid-susceptible conditions is crucial for developing effective treatments.","translation":"オピオイド感受性の状態の背後にあるメカニズムを理解することは、効果的な治療法を開発するために不可欠である。","type":"adjective","meaning_category":"オピオイド感受性の"}]}