{"word":"nonanachronously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"時代錯誤的でないように、時代錯誤を含まないように","english_definition":"in a way that avoids anachronism; without containing or reflecting things inappropriate to the time period being depicted.","examples":[{"sentence":"The film depicted the era nonanachronously, paying careful attention to historical details.","translation":"その映画は歴史的詳細に注意を払い、時代錯誤を含まないようにその時代を描写した。"},{"sentence":"The author tried to write nonanachronously, ensuring that the language and customs reflected the period accurately.","translation":"著者は言語と習慣がその時代を正確に反映するように、時代錯誤を含まないように書こうとした。"}],"collocations":["depict something nonanachronously","write nonanachronously","represent something nonanachronously"],"synonyms":["accurately","authentically","historically accurately","faithfully","genuinely"],"antonyms":["anachronistically","inaccurately","ahistorically"]}],"etymology":{"value":"\"non-\" (否定) + \"anachronously\" (時代錯誤的に)。 \"anachronously\" は \"anachronous\" (時代錯誤の) の副詞形で、これは \"anachronism\" (時代錯誤) に由来する。 \"anachronism\" はギリシャ語の \"ana-\" (逆、後ろ) + \"chronos\" (時間) に由来し、文字通りには「時間に対して逆」という意味。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnəˈnækrənəsli/","syllables":"non-a-nach-ro-nous-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Nonanachronously\" is used to describe actions or depictions that are careful to avoid placing elements (objects, ideas, language, etc.) in a time period where they do not belong. It emphasizes historical accuracy and attention to detail. Because it's a relatively uncommon word, it's often used in academic or critical contexts where precise language is valued.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The play was nonanachronously, with modern costumes.","correct":"✓ The play was anachronistic, with modern costumes.","note":"The presence of modern costumes makes the play anachronistic (containing anachronisms), not nonanachronistic (avoiding anachronisms)."},{"incorrect":"✗ He nonanachronously wrote about the future.","correct":"✓ He futuristically wrote about the future.","note":"\"Nonanachronously\" applies to depicting the past accurately. For the future, terms like \"futuristically\" or \"prophetically\" are more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["anachronism (名詞: 時代錯誤)","anachronistic (形容詞: 時代錯誤の)","anachronously (副詞: 時代錯誤的に)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (非常に高度な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Nonanachronously\" means doing something in a way that avoids putting things in the wrong time period. It's a complex word used when talking about how accurately something represents a particular time in history. For example, if a movie shows people in ancient Rome using cell phones, that would be an anachronism. If the movie is careful to avoid such mistakes, it could be described as depicting the era \"nonanachronously.\""},"example_sentences":[{"sentence":"The historical novel was praised for its ability to portray the 18th century nonanachronously.","translation":"その歴史小説は、18世紀を時代錯誤を含まずに描写する能力が評価された。","type":"adverb","meaning_category":"時代錯誤的でないように"},{"sentence":"She researched extensively to ensure that her portrayal of Victorian life was nonanachronously accurate.","translation":"彼女はビクトリア朝時代の描写が時代錯誤を含まず正確であることを保証するために、広範囲にわたって調査した。","type":"adverb","meaning_category":"時代錯誤的でないように"}]}