{"word":"recluses","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"隠遁者たち、世捨て人たち","english_definition":"plural of recluse: people who live in seclusion and avoid contact with other people.","examples":[{"sentence":"The mountains were home to a few recluses.","translation":"その山には数人の隠遁者が住んでいた。"},{"sentence":"The village was known for its population of eccentric recluses.","translation":"その村は、風変わりな世捨て人が住むことで知られていた。"}],"collocations":["group of recluses","community of recluses","eccentric recluses","hermit-like recluses"],"synonyms":["hermits","anchorites","solitaries","ascetics","eremites"],"antonyms":["socialites","extroverts","gregarious individuals"]},{"part_of_speech":"noun","definition":"(比喩的に)引きこもりがちな人たち、社会との関わりを避ける人たち","english_definition":"(figuratively) people who tend to avoid social interaction and prefer to be alone.","examples":[{"sentence":"In modern society, there are many recluses who prefer online interactions.","translation":"現代社会には、オンラインでの交流を好む多くの引きこもりがちな人がいる。"},{"sentence":"They were a group of intellectual recluses, more comfortable with books than people.","translation":"彼らは知的な引きこもりがちな人たちで、人よりも本の方が気楽だった。"}],"collocations":["intellectual recluses","digital recluses","modern recluses","social recluses"],"synonyms":["loners","introverts","isolates","outsiders","wallflowers"],"antonyms":["social butterflies","partygoers","joiners"]}],"etymology":{"value":"The word 'recluses' is the plural form of 'recluse,' which comes from the Latin word 'reclusus,' the past participle of 'recludere,' meaning 'to shut up' or 'to enclose.' It refers to someone who lives in seclusion.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛkluːsɪz/","syllables":"re-cluse-es"},"inflection":{"noun_plural":"recluses","noun_singular":"recluse"},"usage_notes":{"explanation":"'Recluses' refers to multiple individuals who have chosen to withdraw from society and live in solitude. While traditionally it meant someone living a religious, solitary life (like a hermit), it can also describe anyone who avoids social interaction. The term can sometimes carry a negative connotation, implying eccentricity or social maladjustment, but it can also simply describe someone who values their privacy and independence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is one of the recluses.","correct":"✓ He is one of the reclusive people. / ✓ He is a recluse.","note":"'Recluses' is plural. To refer to a single person, use 'recluse.' Alternatively, use 'reclusive' as an adjective to describe the person (e.g., 'reclusive person')."},{"incorrect":"✗ The recluses are living in the society.","correct":"✓ The recluses are living apart from society.","note":"Recluses, by definition, live apart from society. The sentence should reflect their separation from mainstream society."}],"priority":"★★☆"},"related_words":{"derivatives":["recluse (noun: a person who lives in seclusion)","reclusive (adjective: tending to live in seclusion; characterized by seclusion)","reclusion (noun: the state of being reclusive; seclusion)"],"related_concepts":["hermitage (the dwelling of a hermit)","asceticism (severe self-discipline and avoidance of all forms of indulgence, typically for religious reasons)","solitude (the state of being alone)","isolation (the state of being separated from others)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Recluses' is a relatively uncommon word that refers to multiple people who live in seclusion and avoid social interaction. It's often used to describe individuals who have intentionally withdrawn from society, sometimes for religious or philosophical reasons. The word implies a deliberate choice to live apart from others, and it can carry connotations of eccentricity or a desire for privacy. Understanding the word requires a good vocabulary and an understanding of social concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The remote island was inhabited only by seabirds and a few aging recluses.","translation":"その人里離れた島には、海鳥と数人の年老いた隠遁者だけが住んでいた。","type":"noun","meaning_category":"people living in seclusion"},{"sentence":"The author became one of the most famous recluses in literary history.","translation":"その作家は、文学史において最も有名な隠遁者の一人となった。","type":"noun","meaning_category":"people living in seclusion"},{"sentence":"The mountains provided a sanctuary for the recluses seeking peace and quiet.","translation":"その山々は、平和と静けさを求める隠遁者たちの聖域となった。","type":"noun","meaning_category":"people living in seclusion"},{"sentence":"Some see them as wise sages, others as eccentric recluses.","translation":"彼らを賢明な賢者と見る人もいれば、風変わりな隠遁者と見る人もいる。","type":"noun","meaning_category":"people living in seclusion"}]}