{"word":"Semiquietism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"半静寂主義：17世紀にフランスで起こった神秘主義の一派で、完全な静寂主義には至らないものの、神との合一を追求するために、意志や活動を抑制することを重視した思想。","english_definition":"A mitigated form of Quietism, advocating a degree of passivity and withdrawal from the world in order to achieve union with God, but stopping short of complete inaction.","examples":[{"sentence":"Semiquietism was a controversial movement within the Catholic Church.","translation":"半静寂主義はカトリック教会内で論争を呼んだ運動だった。"},{"sentence":"The teachings of Semiquietism emphasized inner contemplation and detachment from worldly concerns.","translation":"半静寂主義の教えは、内的な瞑想と世俗的な関心からの分離を強調した。"}],"collocations":["influenced by Semiquietism (半静寂主義の影響を受けた)","teachings of Semiquietism (半静寂主義の教え)","a form of Semiquietism (半静寂主義の一形態)"],"synonyms":["Quietism (静寂主義)","Mysticism (神秘主義)","Contemplation (観想)"],"antonyms":["Activism (行動主義)","Voluntarism (意志主義)"]}],"etymology":{"value":"\"Semi-\"（半分、部分的な）+ \"Quietism\"（静寂主義）から構成される。静寂主義の完全な受容には至らない、緩和された形態であることを示す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛmikwaɪəˈtɪzəm/","syllables":"se-mi-qui-e-tism"},"inflection":{"noun_plural":"Semiquietisms"},"usage_notes":{"explanation":"\"Semiquietism\"は、歴史的な文脈、特に宗教史や哲学史において用いられる専門的な用語です。日常会話で使用されることは稀です。関連語である\"Quietism\"（静寂主義）との違いを理解することが重要です。半静寂主義は、静寂主義の過激な側面を緩和したもので、完全な無為無策ではなく、ある程度の活動を容認します。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced semiquietism in his daily life by being completely inactive.","correct":"✓ He practiced a form of semiquietism in his daily life by emphasizing contemplation and limiting worldly activities.","note":"半静寂主義は完全な無活動を意味しません。瞑想を重視し、世俗的な活動を制限するというニュアンスがより正確です。"},{"incorrect":"✗ Semiquietism is the same as being quiet.","correct":"✓ Semiquietism is a specific philosophical and religious doctrine, not simply being quiet.","note":"\"Semiquietism\"は単に「静かにすること」を意味するのではなく、特定の思想体系を指します。"}],"priority":"★★☆"},"related_words":{"derivatives":["Semiquietist (半静寂主義者)"],"related_terms":["Mysticism (神秘主義)","Contemplation (観想)","Quietism (静寂主義)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Semiquietism**」は、17世紀のフランスで発展した神秘主義の一派を指す、非常に専門的な歴史用語です。これは「Quietism（静寂主義）」の緩和された形態であり、神との合一を目指すために、ある程度の受動性と世俗からの離脱を提唱しますが、完全な無為無策には至りません。この用語は、宗教史や哲学史の研究においてのみ使用されることがほとんどであり、日常会話で使われることはありません。"},"example_sentences":[{"sentence":"The bishop condemned the spread of Semiquietism within his diocese.","translation":"司教は教区内での半静寂主義の広がりを非難した。","type":"noun","meaning_category":"半静寂主義の教義"},{"sentence":"Some scholars argue that certain aspects of her philosophy reflect Semiquietist influences.","translation":"彼女の哲学のある側面は、半静寂主義の影響を反映していると主張する学者もいる。","type":"noun","meaning_category":"半静寂主義の影響"}]}