{"word":"larbowlines","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(古語)左舷側の船員たち、または左舷側","english_definition":"(Nautical, archaic) The port watch; the members of the crew who work on the port side of a vessel. Also, the port side itself.","examples":[{"sentence":"The captain ordered the larbowlines to brace the yards.","translation":"船長は左舷側の船員たちにヤードを支えるように命じた。"},{"sentence":"The larbowlines were responsible for maintaining the rigging on their side of the ship.","translation":"左舷側の船員たちは船の自分たちの側の索具を維持する責任があった。"}],"collocations":["port watch","port side","starboard watch","starboard side"],"synonyms":["port watch","port side"],"antonyms":["starboard watch","starboard side"]}],"etymology":{"value":"A corruption of 'port watch' or possibly a combination of 'larboard' (an older term for port) and 'lines'. The term is archaic and rarely used in modern nautical contexts.","priority":"★★☆"},"pronunciation":{"ipa":"ˈlɑːrboʊˌlaɪnz","syllables":"lar-bow-lines"},"inflection":{"noun_plural":"larbowlines"},"usage_notes":{"explanation":"'Larbowlines' is an archaic nautical term referring to the port (left) side of a ship or the crew members assigned to work on that side. It is rarely used in modern maritime language, having been replaced by 'port watch' or simply 'port side'. The term is primarily of historical interest.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The larbowlines were on the right side of the ship.","correct":"✓ The larbowlines were on the left side of the ship.","note":"Larbowlines always refers to the port (left) side, not the starboard (right) side."}],"priority":"★☆☆"},"related_words":{"derivatives":["larboard (archaic term for port)","port (modern term for left side of a ship)","starboard (right side of a ship)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - an archaic term, rarely used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Larbowlines' is an archaic nautical term, primarily of historical interest. Understanding its meaning requires familiarity with historical sailing terminology. It refers to the port (left) side of a ship or the crew working on that side. Due to its rarity in modern usage, it is not typically encountered outside of historical texts or specialized nautical contexts."},"example_sentences":[{"sentence":"The bosun called out to the **larbowlines** to adjust the sails.","translation":"甲板長は左舷側の船員たちに帆を調整するように呼びかけた。","type":"noun","meaning_category":"左舷側の船員たち"},{"sentence":"All hands on deck, especially the **larbowlines**, to deal with the squall!","translation":"総員甲板へ、特に左舷側の船員たち、スコールに対処せよ！","type":"noun","meaning_category":"左舷側の船員たち"}]}