{"word":"locomotively","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"運動的に、運動能力によって、または運動器官を用いて","english_definition":"In a manner relating to locomotion; by means of locomotion; with the ability to move from place to place.","examples":[{"sentence":"The animal moved locomotively across the terrain.","translation":"その動物は運動能力を使って地形を移動した。"},{"sentence":"Humans are locomotively capable of walking, running, and swimming.","translation":"人間は運動能力によって、歩いたり、走ったり、泳いだりすることができる。"}],"collocations":["move locomotively","capable locomotively","assisted locomotively"],"synonyms":["motility","movement","kinetically"],"antonyms":["immobile","stationary","fixed"]}],"etymology":{"value":"From 'locomotive' (relating to movement) + '-ly' (forming an adverb). 'Locomotive' itself comes from Latin 'loco' (place) + 'motus' (moved).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌloʊkəˈmoʊtɪvli/","syllables":"lo-co-mo-tive-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"'Locomotively' is an adverb that describes how something moves or is capable of moving from one place to another. It is often used in scientific or technical contexts when discussing animal or mechanical movement. It is less common in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The car locomotively transported the goods.","correct":"✓ The car transported the goods.","note":"'Locomotively' describes the manner of movement, not the action of transporting. In this case, 'transported' is sufficient."},{"incorrect":"✗ The plant grew locomotively towards the sun.","correct":"✓ The plant grew towards the sun.","note":"Plants do not move from place to place, so 'locomotively' is not appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["locomotion (noun: the act of moving from place to place)","locomotive (adjective: relating to movement; noun: a self-propelled vehicle used for pulling trains)","locomotor (adjective: relating to movement)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a relatively rare word, mostly found in technical or scientific writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Locomotively' is an advanced term that describes movement from one place to another. It's not commonly used in everyday language. You're more likely to encounter it in scientific or technical contexts when discussing how animals or machines move. It emphasizes the ability or manner of movement itself."},"example_sentences":[{"sentence":"The robot was designed to move locomotively across uneven surfaces.","translation":"そのロボットは、不整な表面を運動能力を使って移動するように設計された。","type":"adverb","meaning_category":"運動的に"},{"sentence":"The study examined how different species adapt locomotively to their environments.","translation":"その研究は、異なる種がどのように運動能力を使って環境に適応するかを調査した。","type":"adverb","meaning_category":"運動能力によって"},{"sentence":"The insect propelled itself locomotively using its six legs.","translation":"その昆虫は6本の脚を使って運動的に推進した。","type":"adverb","meaning_category":"運動器官を用いて"}]}