{"word":"circulator","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"循環器、循環装置","english_definition":"A device or system that causes something to move continuously around a closed path or system.","examples":[{"sentence":"The aquarium has a circulator to keep the water fresh.","translation":"水槽には水を新鮮に保つための循環器が付いている。"},{"sentence":"The central heating system uses a circulator pump to distribute hot water.","translation":"セントラルヒーティングシステムは、温水を分配するために循環ポンプを使用している。"}],"collocations":["water circulator","heating circulator","circulator pump"],"synonyms":["pump","fan","blower"],"antonyms":[]},{"part_of_speech":"noun","definition":"（情報などの）伝達者、回覧者","english_definition":"A person or thing that spreads or distributes something, such as information or documents.","examples":[{"sentence":"He was a circulator of gossip in the office.","translation":"彼はオフィスでゴシップを広める人だった。"},{"sentence":"The newsletter is a circulator of important company announcements.","translation":"そのニュースレターは、重要な会社のお知らせの伝達者である。"}],"collocations":["gossip circulator","information circulator"],"synonyms":["distributor","spreader","transmitter"],"antonyms":[]},{"part_of_speech":"noun","definition":"（電子工学）サーキュレータ","english_definition":"(Electronics) A passive multi-port device in which microwave or optical power entering any port is transmitted to the next port in rotation.","examples":[{"sentence":"The circulator directs the signal to the appropriate output port.","translation":"サーキュレータは信号を適切な出力ポートに送る。"}],"collocations":["microwave circulator","optical circulator"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From circulate + -or.","priority":"★★★"},"pronunciation":{"ipa":"ˈsɜːrkjəˌleɪtər","syllables":"cir-cu-la-tor"},"inflection":{"noun_plural":"circulators"},"usage_notes":{"explanation":"The word \"circulator\" refers to something that causes circulation. It can be a device, a system, or even a person. In technical contexts, it often refers to a specific type of electronic component.","priority":"★★☆"},"common_mistakes":[],"related_words":{"derivatives":["circulate","circulation"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"B2","text":"The word \"circulator\" has a few different meanings depending on the context. Generally, it refers to something that causes circulation, whether it's water in an aquarium, information in an office, or signals in an electronic circuit. It's important to understand the context to determine the specific meaning. In electronics, it has a very specific technical meaning."},"example_sentences":[{"sentence":"The blood circulator helps improve blood flow in the legs.","translation":"その血液循環器は、脚の血流を改善するのに役立つ。","type":"noun","meaning_category":"循環器"},{"sentence":"She was known as a circulator of rumors throughout the town.","translation":"彼女は町中で噂を広める人として知られていた。","type":"noun","meaning_category":"伝達者"},{"sentence":"The microwave circulator is essential for proper signal routing in the radar system.","translation":"そのマイクロ波サーキュレータは、レーダーシステムにおける適切な信号経路にとって不可欠である。","type":"noun","meaning_category":"サーキュレータ"}]}