{"word":"whole-looking","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"外見が完全な、全体的に見える、損傷や欠損がないように見える","english_definition":"Appearing complete, undamaged, or lacking any visible signs of being broken or incomplete; having the appearance of being a whole.","examples":[{"sentence":"The antique vase, despite its age, was surprisingly whole-looking.","translation":"そのアンティークの花瓶は、その古さにもかかわらず、驚くほど全体的に見える状態だった。"},{"sentence":"After the restoration, the painting had a more whole-looking appearance than before.","translation":"修復後、その絵画は以前よりも全体的に見える外観になった。"},{"sentence":"The recovered artifact was remarkably whole-looking, considering the circumstances in which it was found.","translation":"回収された工芸品は、発見された状況を考えると、驚くほど無傷に見えた。"}],"collocations":["remarkably whole-looking","surprisingly whole-looking","more whole-looking","appear whole-looking","remain whole-looking"],"synonyms":["intact-looking","complete-appearing","undamaged-seeming","unbroken-looking","sound-appearing"],"antonyms":["broken-looking","damaged-looking","incomplete-looking","fragmented-looking","impaired-looking"]}],"etymology":{"value":"Formed by combining 'whole' (complete, entire) with '-looking' (having the appearance of). The suffix '-looking' indicates the perceived appearance or visual impression of something.","priority":"Low"},"pronunciation":{"ipa":"/ˈhoʊlˌlʊkɪŋ/","syllables":"whole-look-ing"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically formed using 'more' and 'most' (e.g., more whole-looking, most whole-looking)."},"usage_notes":{"explanation":"'Whole-looking' is an adjective used to describe something that gives the visual impression of being complete, undamaged, or lacking any missing parts. It suggests that, despite potential reasons for expecting damage or incompleteness, the object or item appears to be in a sound and entire state. The term is often used when there is an element of surprise or unexpectedness in the object's condition.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The whole-looking building was actually quite dilapidated inside.","correct":"✓ The seemingly whole-looking building was actually quite dilapidated inside.","note":"Using 'seemingly' or 'apparently' can emphasize the contrast between the appearance and the reality. 'Whole-looking' already implies appearance, so adding a word to emphasize the contrast can make the sentence clearer."},{"incorrect":"✗ The whole-looking apple had a bruise on the other side.","correct":"✓ The whole-looking apple had a bruise on the back side.","note":"Clarifying where the hidden damage is located can improve the description."}],"priority":"Low"},"related_words":{"derivatives":["whole","looking","wholely","wholeness"],"phrasal_verbs":[],"related_adjectives":["intact","complete","undamaged","unbroken","sound"],"related_nouns":["whole","appearance","look"]},"level_frequency":{"CEFR":"N/A (Uncommon term)","frequency_google_ngram":"Very Low Frequency - Not commonly found in general text.","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Whole-looking' is a descriptive adjective that suggests something has the visual appearance of being complete and undamaged. It is used to describe an object or item that, despite potential reasons to expect otherwise, seems to be in its original, entire state. This term is not commonly used and is more likely to be found in descriptive writing or specialized contexts where the appearance of completeness is significant."},"example_sentences":[{"sentence":"The ancient scroll, though fragile, remained remarkably whole-looking after centuries in the tomb.","translation":"古代の巻物は、壊れやすいものの、墓の中で何世紀も経った後も驚くほど無傷に見えた。","type":"descriptive","meaning_category":"appearance of completeness"},{"sentence":"The restored car had a surprisingly whole-looking body, considering the extent of the accident damage.","translation":"修復された車は、事故による損傷の程度を考えると、驚くほど全体的に見える車体だった。","type":"descriptive","meaning_category":"appearance of being undamaged"},{"sentence":"Despite the harsh environment, the plant had a surprisingly whole-looking appearance.","translation":"厳しい環境にもかかわらず、その植物は驚くほど全体的に見える外観をしていた。","type":"descriptive","meaning_category":"appearance of completeness"}]}