{"word":"sinterability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"焼結性、焼結可能性","english_definition":"The ability of a powder or compact to be sintered, i.e., to be transformed into a solid mass by heating without melting to the point of liquefaction.","examples":[{"sentence":"The sinterability of the ceramic powder was enhanced by adding a small amount of sintering aid.","translation":"セラミック粉末の焼結性は、少量の焼結助剤を加えることによって向上した。"},{"sentence":"Good sinterability is crucial for achieving high density and strength in the final product.","translation":"良好な焼結性は、最終製品において高い密度と強度を達成するために重要である。"}],"collocations":["good sinterability (良好な焼結性)","high sinterability (高い焼結性)","poor sinterability (低い焼結性)","enhance sinterability (焼結性を向上させる)","improve sinterability (焼結性を改善する)"],"synonyms":["compactibility","densification","consolidation"],"antonyms":["unsinterable","non-sinterable"]}],"etymology":{"value":"Derived from the verb 'sinter' (to cause to become a coherent mass by heating without melting) and the suffix '-ability' (denoting the capacity or quality of being able to do something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪntərəˈbɪləti/","syllables":"sin-ter-a-bil-i-ty"},"inflection":{"noun_plural":"sinterabilities (rarely used)"},"usage_notes":{"explanation":"'Sinterability' refers to the degree to which a material can be successfully sintered. Factors affecting sinterability include particle size, particle shape, surface area, chemical composition, and the presence of additives. Materials with high sinterability require lower temperatures and shorter sintering times to achieve a dense, strong product.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sinterability is depending on the temperature.","correct":"✓ The sinterability depends on the temperature.","note":"'Sinterability' is a noun, so it should be the subject of the sentence. The verb should agree with the singular noun."},{"incorrect":"✗ The sinterability is very sinterable.","correct":"✓ The material has high sinterability. / ✓ The material is highly sinterable.","note":"Avoid using 'sinterable' (adjective) and 'sinterability' (noun) redundantly in the same phrase. Choose either the noun form with 'high/low' or the adverb 'highly' with the adjective form."}],"priority":"★★☆"},"related_words":{"derivatives":["sinter (verb, noun)","sintering (noun, gerund)","sinterable (adjective)","sintered (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in materials science and engineering contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sinterability' is a technical term used in materials science and engineering. It describes how well a powdered material can be transformed into a solid object through the process of sintering, which involves heating the material to a high temperature without melting it completely. The higher the sinterability, the easier it is to create a dense and strong final product. This term is typically encountered in specialized contexts related to ceramics, metallurgy, and powder processing.","priority":"★★☆"},"example_sentences":[{"sentence":"The **sinterability** of the nanoparticles was significantly improved by surface modification.","translation":"ナノ粒子の焼結性は、表面改質によって大幅に改善された。","type":"noun","meaning_category":"焼結性"},{"sentence":"Understanding the **sinterability** of different materials is essential for optimizing the manufacturing process.","translation":"さまざまな材料の焼結性を理解することは、製造プロセスを最適化するために不可欠である。","type":"noun","meaning_category":"焼結性"},{"sentence":"The study investigated the effect of particle size on the **sinterability** of the powder.","translation":"この研究では、粉末の粒径が焼結性に与える影響を調査した。","type":"noun","meaning_category":"焼結性"}]}