{"word":"phytonomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"植物の構造、成長、および進化の研究","english_definition":"The study of the structure, growth, and evolution of plants.","examples":[{"sentence":"Phytonomy helps us understand how plants adapt to different environments.","translation":"植物構造学は、植物がどのように異なる環境に適応するかを理解するのに役立ちます。"},{"sentence":"Advances in phytonomy have led to improvements in crop yields.","translation":"植物構造学の進歩は、作物の収量向上につながっています。"}],"collocations":["comparative phytonomy","experimental phytonomy","developmental phytonomy"],"synonyms":["plant morphology","plant anatomy","plant physiology"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の 'phyto-' (植物) + '-nomy' (科学、法則) に由来します。","priority":"★★★"},"pronunciation":{"ipa":"/faɪˈtɒnəmi/","syllables":"phy-ton-o-my"},"inflection":{"noun_plural":"phytonomies"},"usage_notes":{"explanation":"Phytonomy is a specialized field within botany that focuses on the internal and external structure of plants, their development, and their evolutionary relationships. It often involves detailed anatomical studies, comparative analyses of different plant groups, and experimental investigations into plant growth and development.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Phytonomy is the study of animals.","correct":"✓ Phytonomy is the study of plants.","note":"Phytonomy specifically deals with plants, not animals."},{"incorrect":"✗ Phytonomy is the same as plant ecology.","correct":"✓ Phytonomy focuses on plant structure and development, while plant ecology focuses on the interactions between plants and their environment.","note":"While related, phytonomy and plant ecology are distinct fields of study."}],"priority":"★★☆"},"related_words":{"derivatives":["phytonomic (adjective)"],"phrases":["comparative phytonomy","experimental phytonomy"],"related_fields":["botany","plant morphology","plant anatomy","plant physiology","plant ecology"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Phytonomy' is a specialized term in botany referring to the study of plant structure, growth, and evolution. It's not a commonly used word outside of academic or scientific contexts. Understanding this term requires familiarity with botanical terminology and concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor specialized in phytonomy, focusing on the vascular systems of various plant species.","translation":"その教授は植物構造学を専門としており、さまざまな植物種の維管束系に焦点を当てていました。","type":"general","meaning_category":"植物の構造、成長、および進化の研究"},{"sentence":"Advances in phytonomy have allowed scientists to better understand plant adaptations to extreme environments.","translation":"植物構造学の進歩により、科学者は極限環境への植物の適応をより良く理解できるようになりました。","type":"research","meaning_category":"植物の構造、成長、および進化の研究"}]}