{"word":"disemployed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"失業した、職を失った","english_definition":"Having lost employment; unemployed.","examples":[{"sentence":"The factory closure left many people disemployed.","translation":"その工場の閉鎖は多くの人々を失業させた。"},{"sentence":"He is currently disemployed and seeking new opportunities.","translation":"彼は現在失業中で、新たな機会を探している。"}],"collocations":["become disemployed","remain disemployed"],"synonyms":["unemployed","jobless","out of work","laid off","redundant"],"antonyms":["employed","working","hired"],"notes":"'Disemployed' is a more formal or technical term than 'unemployed'. It often implies that the job loss was due to economic or structural changes rather than individual performance."}],"etymology":{"value":"Formed by adding the prefix 'dis-' (meaning 'not' or 'lack of') to 'employed'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪsɪmˈplɔɪd/","syllables":"dis-em-ployed"},"inflection":{"adjective_forms":{"comparative":"more disemployed","superlative":"most disemployed"}},"usage_notes":{"explanation":"'Disemployed' is used to describe someone who has lost their job, often due to circumstances beyond their control, such as company downsizing, automation, or economic downturns. It is a more formal and less common term than 'unemployed'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was disemployed because he was lazy.","correct":"✓ He was unemployed because he was lazy.","note":"'Disemployed' usually implies job loss due to external factors, not personal failings. 'Unemployed' is more appropriate in this case."}],"priority":"★☆☆"},"related_words":{"derivatives":["disemployment (noun): The state of being disemployed; job loss due to economic or structural changes.","employment (noun): The state of having a job.","unemployment (noun): The state of being unemployed."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Disemployed' is a formal term for someone who has lost their job, often because of changes in the economy or the way a company is run, rather than because of something they did wrong. It's not a word you hear every day, but it's useful in discussions about economics and job markets."},"example_sentences":[{"sentence":"The rise of automation has left many workers disemployed.","translation":"自動化の進展により、多くの労働者が職を失った。","type":"adjective","meaning_category":"失業した"},{"sentence":"The government is implementing programs to assist disemployed individuals.","translation":"政府は失業した人々を支援するためのプログラムを実施している。","type":"adjective","meaning_category":"失業した"}]}