{"word":"factory-inspired","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"工場から着想を得た、工場風の、工業的なデザインを取り入れた","english_definition":"Taking design cues or inspiration from factories, often characterized by exposed materials, utilitarian aesthetics, and functional design.","examples":[{"sentence":"The restaurant's decor is factory-inspired, with exposed brick walls and metal fixtures.","translation":"そのレストランの内装は工場風で、むき出しのレンガの壁と金属製の備品が特徴です。"},{"sentence":"Factory-inspired lighting is a popular choice for modern homes.","translation":"工場風の照明は、現代的な住宅で人気があります。"},{"sentence":"The artist's factory-inspired sculptures are made from recycled materials.","translation":"そのアーティストの工場から着想を得た彫刻は、リサイクル素材で作られています。"}],"collocations":["factory-inspired design (工場風のデザイン)","factory-inspired decor (工場風の内装)","factory-inspired lighting (工場風の照明)","factory-inspired furniture (工場風の家具)","factory-inspired aesthetic (工場風の美学)","industrial-inspired (工業的なデザイン)"],"synonyms":["industrial-style","loft-style","utilitarian","functional","minimalist"],"antonyms":["ornate","decorative","traditional","classic"],"notes":"Often used to describe interior design, architecture, and art that incorporates elements reminiscent of factories and industrial spaces."}],"etymology":{"value":"Combination of 'factory' (a building or group of buildings where goods are manufactured or assembled chiefly by machine) and 'inspired' (influenced or guided by an idea or feeling).","priority":"★★★"},"pronunciation":{"ipa":"/ˈfæktəri ɪnˈspaɪərd/","syllables":"fac-to-ry in-spired"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'factory-inspired' is often used in the context of design and architecture to describe a style that incorporates elements commonly found in factories, such as exposed brick, metal fixtures, and a focus on functionality. It is closely related to 'industrial-style' and 'loft-style' design.","priority":"★★★"},"related_words":{"related_terms":["industrial","factory","loft","warehouse","utilitarian","minimalism"],"derivatives":["inspiration","inspired"]},"level_frequency":{"priority":"☆☆☆"},"example_sentences":[{"sentence":"The apartment featured a factory-inspired kitchen with stainless steel countertops and open shelving.","translation":"そのアパートメントは、ステンレス製のカウンタートップとオープンな棚を備えた、工場風のキッチンが特徴でした。","type":"adjective","meaning_category":"デザイン"},{"sentence":"Many coffee shops now embrace a factory-inspired aesthetic to create a trendy and urban atmosphere.","translation":"多くのコーヒーショップが、トレンディで都会的な雰囲気を作り出すために、工場風の美学を取り入れています。","type":"adjective","meaning_category":"デザイン"},{"sentence":"The factory-inspired furniture was both stylish and functional, perfect for a modern living space.","translation":"工場風の家具は、スタイリッシュで機能的であり、現代的なリビングスペースに最適でした。","type":"adjective","meaning_category":"家具"}]}