{"word":"censorability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"検閲可能性、検閲されやすさ","english_definition":"The quality of being able to be censored; the extent to which something can be censored.","examples":[{"sentence":"The high censorability of the platform made it unpopular with free speech advocates.","translation":"そのプラットフォームの検閲可能性の高さは、言論の自由を擁護する人々には不評だった。"},{"sentence":"Decentralized systems aim to reduce censorability.","translation":"分散型システムは検閲可能性を低減することを目的としている。"}],"collocations":["high censorability","low censorability","increase censorability","reduce censorability"],"synonyms":["susceptibility to censorship","vulnerability to censorship"],"antonyms":["uncensorability","censorship resistance"]},{"part_of_speech":"noun","definition":"検閲の対象となりうる性質","english_definition":"The inherent characteristics of something that make it susceptible to censorship.","examples":[{"sentence":"The censorability of certain types of content is a subject of ongoing debate.","translation":"特定種類のコンテンツの検閲対象となりうる性質は、現在も議論の対象となっている。"}],"collocations":[],"synonyms":["censorship potential"],"antonyms":[]}],"etymology":{"value":"Derived from \"censorable\" (capable of being censored) + \"-ity\" (suffix denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛnsərəˈbɪləti/","syllables":"cen·sor·a·bil·i·ty"},"inflection":{"noun_plural":"censorabilities"},"usage_notes":{"explanation":"\"Censorability\" is a relatively new term, often used in discussions about online content, freedom of speech, and decentralized technologies. It refers to how easily something can be suppressed, removed, or controlled by authorities or platforms. It's often contrasted with \"censorship resistance\" or \"uncensorability,\" which describe systems or content designed to be immune to censorship.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The censorability is a problem.","correct":"✓ The high censorability is a problem.","note":"\"Censorability\" is a quality, so it's often modified by adjectives like \"high\" or \"low\" to indicate the degree of censorability."}],"priority":"★★☆"},"related_words":{"derivatives":["censor (verb, noun)","censorable (adjective)","censorship (noun)","uncensorable (adjective)","censorship-resistance (noun)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in specialized contexts (e.g., technology, law, political science).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Censorability\" refers to the degree to which something can be censored or suppressed. It's commonly used in discussions about online content, freedom of speech, and decentralized technologies. A system with high \"censorability\" is easily controlled or shut down by authorities, while one with low \"censorability\" is difficult to censor. This word is relatively specialized and more likely to be encountered in academic or technical contexts."},"example_sentences":[{"sentence":"The platform's design prioritized low censorability to ensure freedom of expression.","translation":"そのプラットフォームの設計は、表現の自由を確保するために、低い検閲可能性を優先した。","type":"general","meaning_category":"general"},{"sentence":"The government's attempts to increase the censorability of the internet were met with strong opposition.","translation":"政府によるインターネットの検閲可能性を高めようとする試みは、強い反対に遭った。","type":"political","meaning_category":"political"},{"sentence":"Blockchain technology aims to provide uncensorable platforms by reducing censorability.","translation":"ブロックチェーン技術は、検閲可能性を低減することで、検閲不可能なプラットフォームを提供することを目指している。","type":"technical","meaning_category":"technical"}]}