{"word":"Shaddock","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ザボン (柑橘類の一種)","english_definition":"a citrus fruit, Citrus maxima, with a thick rind and coarse, juicy pulp; also known as pomelo.","examples":[{"sentence":"I bought a Shaddock at the market.","translation":"私は市場でザボンを買いました。"},{"sentence":"Shaddocks are larger than grapefruits.","translation":"ザボンはグレープフルーツよりも大きいです。"}],"collocations":["eat a Shaddock","grow Shaddocks","Shaddock tree","Shaddock fruit"],"synonyms":["pomelo","Citrus maxima"],"antonyms":[]}],"etymology":{"value":"Captain Shaddock, a captain of an East India Company ship, is credited with introducing the fruit to the West Indies in the 17th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃædək/","syllables":"Shad-dock"},"inflection":{"noun_plural":"Shaddocks"},"usage_notes":{"explanation":"The word \"Shaddock\" refers to a specific type of citrus fruit. While \"pomelo\" is a more common term, \"Shaddock\" is still used, particularly in older literature or by those familiar with the fruit's history.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I like Shaddock juice more than orange juice.","correct":"✓ I like pomelo juice more than orange juice.","note":"Pomelo juice is more common than Shaddock juice, so it is better to use the term pomelo."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Shaddock\" is a relatively uncommon word referring to a specific type of citrus fruit also known as a pomelo. Due to its limited usage, it is typically encountered in specialized contexts such as botany or horticulture, or in regions where the fruit is commonly grown and consumed. Understanding this word requires familiarity with different types of citrus fruits."},"example_sentences":[{"sentence":"The shaddock tree in our backyard yields a bountiful harvest every year.","translation":"裏庭のザボンの木は毎年豊かな収穫をもたらします。","type":"noun","meaning_category":"fruit"},{"sentence":"For breakfast, she enjoyed a refreshing shaddock with a sprinkle of sugar.","translation":"朝食に、彼女は砂糖を少しふりかけた爽やかなザボンを楽しみました。","type":"noun","meaning_category":"fruit"}]}