{"word":"astrograph","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"天体写真儀、星図写真機","english_definition":"A telescope specially designed for taking photographs of stars and other celestial objects.","examples":[{"sentence":"The astrograph was used to create a detailed map of the night sky.","translation":"その天体写真儀は、夜空の詳細な地図を作成するために使用された。"},{"sentence":"Many observatories have astrographs for long-exposure photography.","translation":"多くの天文台には、長時間露光写真撮影用の天体写真儀がある。"}],"collocations":["wide-field astrograph (広視野天体写真儀)","Schmidt astrograph (シュミット式天体写真儀)"],"synonyms":["photographic telescope","astronomical camera"],"antonyms":[]}],"etymology":{"value":"'Astro-' (ギリシャ語の 'astron' = 星) + '-graph' (ギリシャ語の 'graphō' = 書く、描く) に由来。星を「書き出す」または「描く」ための装置という意味。","priority":"★★★"},"pronunciation":{"ipa":"/ˈæstroʊˌɡræf/","syllables":"as-tro-graph"},"inflection":{"noun_plural":"astrographs"},"usage_notes":{"explanation":"An astrograph is a specialized telescope primarily used for astrophotography. Unlike telescopes designed for visual observation, astrographs are optimized for capturing images on photographic plates or digital sensors. They often have a wide field of view to capture large areas of the sky.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an astrograph with my eyes.","correct":"✓ I used an astrograph to take a picture of the stars.","note":"Astrographs are for taking pictures, not for direct viewing."}],"priority":"★★☆"},"related_words":{"derivatives":["astrophotography (天体写真)","astrometry (天体位置測定)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'astrograph' refers to a specific type of telescope designed for taking photographs of astronomical objects. It is a technical term used in astronomy and related fields. Understanding the term requires familiarity with basic astronomical concepts and equipment.","priority":"★★☆"},"example_sentences":[{"sentence":"The observatory's astrograph has captured stunning images of distant galaxies.","translation":"その天文台の天体写真儀は、遠い銀河の素晴らしい画像を捉えている。","type":"general","meaning_category":"definition"},{"sentence":"Researchers use astrographs to measure the positions and motions of stars.","translation":"研究者たちは、天体写真儀を使って星の位置と動きを測定する。","type":"research","meaning_category":"usage"}]}