{"word":"crumblings","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"崩れ落ちるかけら、崩壊しかけの部分","english_definition":"Small pieces that have broken off something; parts that are in a state of decay or disintegration.","examples":[{"sentence":"The old building was covered in crumblings of stone and plaster.","translation":"その古い建物は石や漆喰の崩れ落ちるかけらで覆われていた。"},{"sentence":"The archaeologist carefully collected the crumblings of the ancient pottery.","translation":"考古学者は古代の陶器の崩壊しかけの部分を注意深く集めた。"},{"sentence":"The cake was delicious, but there were crumblings all over the table.","translation":"ケーキは美味しかったが、テーブルのあちこちに崩れたかけらが散らばっていた。"}],"collocations":["stone crumblings (石の崩れかけら)","plaster crumblings (漆喰の崩れかけら)","cake crumblings (ケーキの崩れかけら)","wall crumblings (壁の崩れかけら)"],"synonyms":["fragments","debris","rubble","shards","splinters"],"antonyms":["whole","intact","solid"]}],"etymology":{"value":"\"crumbling\"の複数形。 \"crumbling\"は動詞\"crumble\"の現在分詞であり、中英語の\"crumblen\"（パンを砕く）に由来し、古英語の\"crymel\"（パンくず）に関連する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrʌmblɪŋz/","syllables":"crum-blingz"},"inflection":{"noun_plural":"crumblings"},"usage_notes":{"explanation":"\"Crumblings\"は、何かが崩壊または分解している状態を表す名詞です。通常、小さな破片や断片を指し、物理的な崩壊（建物、ケーキなど）または比喩的な崩壊（関係、計画など）に関連して使用できます。単数形の\"crumbling\"は、崩壊のプロセスまたは状態を指す場合があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The crumbling of the wall were dangerous.","correct":"✓ The crumblings of the wall were dangerous.","note":"壁の崩れ落ちるかけらが複数ある場合は、複数形の\"crumblings\"を使用します。単数形の\"crumbling\"は、崩壊のプロセスや状態を指します。"},{"incorrect":"✗ There was a lot of crumbling on the floor.","correct":"✓ There were a lot of crumblings on the floor.","note":"床にたくさんの崩れ落ちるかけらがある場合は、複数形の\"crumblings\"を使用します。"}],"priority":"★★☆"},"related_words":{"derivatives":["crumble (verb): 崩れる、砕ける","crumb (noun): パンくず、かけら","crumbly (adjective): 崩れやすい、もろい","crumbling (adjective): 崩れかけている、衰退している"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"crumblings\" refers to small pieces or fragments that have broken off from something larger, often indicating a state of decay or disintegration. It is typically used in contexts where physical objects like buildings, walls, or food items are breaking down. The word suggests a process of gradual deterioration and is more common in descriptive or literary writing rather than everyday conversation. Understanding the word requires a grasp of the related terms \"crumble\" and \"crumb,\" and an ability to recognize its use in describing states of decay or disintegration."},"example_sentences":[{"sentence":"The wind scattered the dry crumblings of leaves across the yard.","translation":"風が乾燥した葉の崩れかけらを庭に散らした。","type":"noun","meaning_category":"崩れ落ちるかけら"},{"sentence":"Archaeologists sifted through the crumblings of the ancient city, hoping to find artifacts.","translation":"考古学者は古代都市の崩れ落ちるかけらをふるいにかけ、遺物を見つけようとした。","type":"noun","meaning_category":"崩壊しかけの部分"},{"sentence":"The old book was falling apart, leaving crumblings of paper on the shelf.","translation":"その古い本はバラバラになり、棚に紙の崩れかけらを残した。","type":"noun","meaning_category":"崩れ落ちるかけら"}]}