{"word":"non-recidivist","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"再犯しない、再犯者でない","english_definition":"Not relapsing into criminal behavior; not a repeat offender.","examples":[{"sentence":"The program aims to turn offenders into non-recidivist members of society.","translation":"そのプログラムは、犯罪者を再犯しない社会の一員に変えることを目指しています。"},{"sentence":"Non-recidivist offenders are often cited as evidence of the effectiveness of rehabilitation programs.","translation":"再犯しない犯罪者は、リハビリテーションプログラムの効果を示す証拠としてよく引用されます。"}],"collocations":["non-recidivist offender","non-recidivist behavior","non-recidivist population"],"synonyms":["rehabilitated","law-abiding","reformed"],"antonyms":["recidivist","repeat offender"]},{"part_of_speech":"noun","definition":"再犯しない人、再犯者でない人","english_definition":"A person who does not relapse into criminal behavior; a person who is not a repeat offender.","examples":[{"sentence":"The study focused on the factors that contribute to an offender becoming a non-recidivist.","translation":"その研究は、犯罪者が再犯しない人になる要因に焦点を当てました。"},{"sentence":"Non-recidivists are more likely to have strong social support networks.","translation":"再犯しない人は、強力な社会的支援ネットワークを持っている可能性が高いです。"}],"collocations":["former offender","rehabilitated individual"],"synonyms":["reformed individual","rehabilitated offender"],"antonyms":["recidivist","repeat offender"]}],"etymology":{"value":"The word is formed by adding the prefix \"non-\" (meaning \"not\") to \"recidivist.\" \"Recidivist\" comes from the French \"récidiviste,\" which is derived from the Latin \"recidivus\" meaning \"relapsing, recurring.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn rɪˈsɪdɪvɪst/","syllables":"non-re-cid-i-vist"},"inflection":{"noun_plural":"non-recidivists"},"usage_notes":{"explanation":"\"Non-recidivist\" is a term used in the fields of criminology, sociology, and law to describe individuals who, after having committed a crime, do not re-offend. It is often used in the context of evaluating the effectiveness of rehabilitation programs and understanding the factors that contribute to successful reintegration into society. The term emphasizes the absence of repeat offending.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non-recidivism.","correct":"✓ He is a non-recidivist.","note":"\"Non-recidivism\" is the state of not re-offending, while \"non-recidivist\" is the person who does not re-offend."},{"incorrect":"✗ The program aims to make them non-recidivist.","correct":"✓ The program aims to make them non-recidivists.","note":"When referring to multiple people, use the plural form \"non-recidivists.\""}],"priority":"★★☆"},"related_words":{"derivatives":["non-recidivism (noun: the state of not re-offending)"],"phrases":["recidivism rate (the rate at which offenders re-offend)"],"related_terms":["rehabilitation","reintegration","offender","criminal justice system","corrections"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-recidivist' is a specialized term primarily used in the context of criminology, sociology, and legal studies. It refers to an individual who, after having committed an offense, does not relapse into criminal behavior. Understanding this term requires familiarity with concepts related to crime, punishment, and rehabilitation. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"Effective rehabilitation programs can help transform offenders into **non-recidivist** members of society.","translation":"効果的なリハビリテーションプログラムは、犯罪者を再犯しない社会の一員に変えるのに役立ちます。","type":"adjective","meaning_category":"再犯しない"},{"sentence":"The study identified several factors that contribute to an offender becoming a **non-recidivist**.","translation":"その研究は、犯罪者が再犯しない人になる要因をいくつか特定しました。","type":"noun","meaning_category":"再犯しない人"}]}