{"word":"system-defined","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"システム定義の、システムによって定義された","english_definition":"Defined or determined by the system itself, rather than by the user or an external source.","examples":[{"sentence":"The error code is system-defined and cannot be changed.","translation":"そのエラーコードはシステム定義であり、変更できません。"},{"sentence":"System-defined variables are automatically initialized when the program starts.","translation":"システム定義変数は、プログラムの開始時に自動的に初期化されます。"}],"collocations":["system-defined variable","system-defined function","system-defined constant","system-defined error code"],"synonyms":["predefined","built-in","default"],"antonyms":["user-defined","custom","external"]}],"etymology":{"value":"Combination of 'system' and 'defined'. Indicates that the definition originates from the system's internal configuration.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪstəm dɪˈfaɪnd/","syllables":"sys-tem-de-fined"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"\"System-defined\" refers to elements within a computer system or software that are automatically created or configured by the system itself, as opposed to being set up by the user. These elements are typically essential for the system's basic operation and are often not modifiable by the user.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The system defined it.","correct":"✓ It is system-defined.","note":"Use the adjective form 'system-defined' to describe the characteristic of being defined by the system."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["system","defined","user-defined","configuration","default settings"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, primarily used in technical documentation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"System-defined\" is a technical term used in computing and software development to describe something that is automatically configured or determined by the system itself, without user intervention. Understanding this term is important for reading technical documentation and understanding how software systems operate."},"example_sentences":[{"sentence":"The operating system uses system-defined functions for memory management.","translation":"オペレーティングシステムは、メモリ管理にシステム定義関数を使用します。","type":"adjective","meaning_category":"system-defined function"},{"sentence":"The system-defined parameters ensure consistent behavior across different installations.","translation":"システム定義パラメータは、異なるインストール間で一貫した動作を保証します。","type":"adjective","meaning_category":"system-defined parameters"}]}