{"word":"antinomical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(哲学で)二律背反の、矛盾する原理を含む","english_definition":"involving or characterized by an antinomy; relating to a contradiction between two beliefs or conclusions that are in themselves reasonable; paradoxical.","examples":[{"sentence":"The concept of free will and determinism are antinomical.","translation":"自由意志と決定論の概念は二律背反である。"},{"sentence":"The antinomical nature of the problem makes it difficult to solve.","translation":"その問題の二律背反的な性質が、解決を困難にしている。"}],"collocations":["antinomical ideas","antinomical principles","antinomical concepts","antinomical arguments","antinomical statements"],"synonyms":["contradictory","paradoxical","inconsistent","self-contradictory","irreconcilable"],"antonyms":["consistent","harmonious","compatible","reconcilable"]}],"etymology":{"value":"Derived from the word 'antinomy,' which comes from the Greek words 'anti' (against) and 'nomos' (law). The suffix '-ical' is added to form an adjective.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntɪˈnɒmɪkəl/","syllables":"an-ti-nom-i-cal"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more antinomical' and 'most antinomical', respectively."},"usage_notes":{"explanation":"'Antinomical' is primarily used in philosophical or academic contexts to describe ideas, principles, or arguments that contain or lead to an antinomy, a situation where two seemingly valid principles or beliefs contradict each other. It is often used to highlight inherent tensions or paradoxes within a system of thought.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The weather is antinomical today.","correct":"✓ The weather is unpredictable today.","note":"'Antinomical' refers to logical contradictions, not general unpredictability."},{"incorrect":"✗ He is an antinomical person.","correct":"✓ He is a contradictory person.","note":"'Antinomical' describes ideas or principles, not usually people."}],"priority":"★★☆"},"related_words":{"derivatives":["antinomy (noun): a contradiction between two beliefs or conclusions that are in themselves reasonable.","antinomian (noun/adjective): one who rejects a moral law.","antinomianism (noun): the rejection of moral law."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'antinomical' is a highly specialized term primarily used in philosophy and advanced academic discourse. It describes something that contains or relates to an 'antinomy,' which is a contradiction between two principles or beliefs that seem reasonable in themselves. This word is not commonly encountered in everyday language and requires a sophisticated understanding of philosophical concepts to use correctly."},"example_sentences":[{"sentence":"The philosopher explored the antinomical relationship between freedom and responsibility.","translation":"その哲学者は、自由と責任の二律背反的な関係を探求した。","type":"general"},{"sentence":"The legal system often grapples with antinomical principles of justice and fairness.","translation":"法制度はしばしば、正義と公平さという二律背反的な原理に取り組む。","type":"academic"},{"sentence":"The artist's work reflected the antinomical tension between tradition and innovation.","translation":"その芸術家の作品は、伝統と革新の間の二律背反的な緊張を反映していた。","type":"literary"}]}