{"word":"unpervertedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"歪曲されずに、堕落せずに、邪な考えなしに","english_definition":"In a manner that is not perverted; without distortion, corruption, or impure thoughts.","examples":[{"sentence":"He unpervertedly presented the facts of the case, ensuring no bias influenced the outcome.","translation":"彼は事件の事実を歪曲せずに提示し、偏見が結果に影響を与えないようにしました。"},{"sentence":"She approached the sensitive topic unpervertedly, maintaining a respectful and objective viewpoint.","translation":"彼女はそのデリケートな話題に邪な考えなしにアプローチし、敬意を払い客観的な視点を維持しました。"}],"collocations":["present something unpervertedly (何かを歪曲せずに提示する)","approach a topic unpervertedly (話題に邪な考えなしにアプローチする)","view something unpervertedly (何かを歪曲せずに見る)"],"synonyms":["honestly","truthfully","purely","objectively","impartially","sincerely"],"antonyms":["pervertedly","dishonestly","corruptly","biasedly"]}],"etymology":{"value":"Derived from the adjective 'perverted', meaning 'distorted or corrupted', with the addition of the prefix 'un-' (meaning 'not') and the suffix '-ly' (forming an adverb).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnpərˈvɜːrtɪdli/","syllables":"un-per-vert-ed-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Unpervertedly' is a relatively rare adverb that describes an action or manner performed without any form of perversion, distortion, or corruption. It emphasizes the purity, honesty, and objectivity of the action. It is often used in contexts where there is a risk of bias or misrepresentation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted unpervertedly towards her.","correct":"✓ He acted respectfully towards her.","note":"While 'unpervertedly' implies a lack of inappropriate behavior, 'respectfully' is a more common and direct way to express respectful conduct."},{"incorrect":"✗ The data was presented unpervertedly, so it was accurate.","correct":"✓ The data was presented accurately, so it was accurate.","note":"'Accurately' is a more common and concise way to express that data is presented without distortion."}],"priority":"★★☆"},"related_words":{"derivatives":["unperverted (adjective)","pervertedly (adverb)","pervert (verb, noun)","perversion (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unpervertedly' is a complex word rarely used in everyday language. It describes doing something without any distortion or corruption, emphasizing purity and honesty. Due to its infrequent use and complex meaning, it is suitable for advanced learners.","priority":"★★☆"},"example_sentences":[{"sentence":"The historian unpervertedly recounted the events of the war, avoiding any nationalistic bias.","translation":"その歴史家は戦争の出来事を歪曲せずに語り、国家主義的な偏見を避けました。","type":"general","meaning_category":"without distortion"},{"sentence":"She approached the ethical dilemma unpervertedly, carefully considering all perspectives.","translation":"彼女は倫理的なジレンマに邪な考えなしにアプローチし、すべての視点を注意深く検討しました。","type":"general","meaning_category":"without impure thoughts"}]}