{"word":"multiprogramming","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"多重プログラミング：複数のプログラムを同時に実行できるように見せかけるオペレーティングシステムの手法","english_definition":"A technique used in operating systems that allows multiple programs to appear to run simultaneously by rapidly switching between them.","examples":[{"sentence":"Multiprogramming increases CPU utilization by overlapping I/O and processing.","translation":"多重プログラミングは、入出力と処理をオーバーラップさせることで、CPU利用率を向上させます。"},{"sentence":"Early operating systems used multiprogramming to improve efficiency.","translation":"初期のオペレーティングシステムは、効率を改善するために多重プログラミングを使用していました。"},{"sentence":"Multiprogramming differs from multiprocessing, which uses multiple CPUs.","translation":"多重プログラミングは、複数のCPUを使用する多重処理とは異なります。"}],"collocations":["operating system with multiprogramming","implement multiprogramming","multiprogramming environment","multiprogramming system"],"synonyms":["concurrency","time-sharing"],"antonyms":["single-tasking","batch processing"]}],"etymology":{"value":"'Multi-' (many) + 'programming' (the process of writing computer programs). The concept arose to improve CPU utilization by switching between processes when one is waiting for I/O.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmʌltiˈproʊɡræmɪŋ/","syllables":"mul-ti-pro-gram-ming"},"inflection":{"noun_plural":"None (uncountable noun)"},"usage_notes":{"explanation":"Multiprogramming is a technique where multiple programs reside in memory at the same time, and the CPU rapidly switches between them. This gives the illusion of simultaneous execution. It's important to distinguish it from multiprocessing, which involves multiple CPUs actually executing instructions in parallel. Multiprogramming is designed to maximize CPU utilization, especially when programs are frequently waiting for I/O operations to complete.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Multiprogramming means multiple CPUs.","correct":"✓ Multiprogramming means multiple programs sharing one CPU.","note":"Multiprogramming uses a single CPU to switch between programs, while multiprocessing uses multiple CPUs to execute programs in parallel."},{"incorrect":"✗ Multiprogramming is the same as multitasking.","correct":"✓ Multiprogramming is a type of multitasking.","note":"Multiprogramming is a specific technique for achieving multitasking, but multitasking is a broader concept."}],"priority":"★★☆"},"related_words":{"derivatives":["multiprogrammed (adjective)"],"related_terms":["multitasking","multiprocessing","time-sharing","concurrency","CPU utilization","operating system"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Multiprogramming' is a computer science term. It refers to a way for a computer's operating system to handle many programs at what seems like the same time. The computer quickly switches between these programs. This is done to make the computer work more efficiently, especially when a program is waiting for something (like data from the internet). It's different from 'multiprocessing,' where the computer actually uses more than one processing unit (CPU) to do things at the same time.","priority":"★★☆"},"example_sentences":[{"sentence":"The operating system supports multiprogramming to allow multiple applications to run concurrently.","translation":"そのオペレーティングシステムは、複数のアプリケーションを同時に実行できるように、多重プログラミングをサポートしています。","type":"definition"},{"sentence":"Multiprogramming improves system throughput by minimizing CPU idle time.","translation":"多重プログラミングは、CPUのアイドル時間を最小限に抑えることで、システムのスループットを向上させます。","type":"advantage"},{"sentence":"In a multiprogramming environment, resource management is crucial.","translation":"多重プログラミング環境では、リソース管理が重要です。","type":"environment"},{"sentence":"Multiprogramming was a significant advancement in operating system design.","translation":"多重プログラミングは、オペレーティングシステムの設計における重要な進歩でした。","type":"history"}]}