{"word":"Unapparently","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"外見上はそうでないように、見たところは～でないように","english_definition":"In a way that does not appear to be the case; seemingly not.","examples":[{"sentence":"Unapparently, he was deeply affected by the criticism.","translation":"見たところそうではないが、彼はその批判に深く心を痛めていた。"},{"sentence":"Unapparently, the company was on the verge of bankruptcy.","translation":"見たところそうではないが、その会社は倒産の危機に瀕していた。"}],"collocations":["unapparently affected","unapparently on the verge"],"synonyms":["seemingly not","ostensibly not","superficially not","apparently not"],"antonyms":["apparently","obviously","evidently"]}],"etymology":{"value":"Formed from \"apparently\" with the prefix \"un-\", indicating negation or the opposite of what appears to be true.","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnəˈpærəntli/","syllables":"un-ap-par-ent-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Unapparently\" suggests a contrast between outward appearances and the actual situation. It implies that the true state of affairs is not readily visible or obvious. It's often used to introduce a fact or condition that contradicts what one might expect based on superficial observation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unapparently happy, but inside he was sad.","correct":"✓ He was apparently happy, but inside he was sad. / ✓ Unapparently, he was sad inside.","note":"The word 'apparently' is used when something seems to be true based on the evidence available, while 'unapparently' is used when something does not seem to be true based on the evidence available. Be careful not to mix them up."}],"priority":"★★☆"},"related_words":{"derivatives":["apparent (adjective)","apparently (adverb)","unapparent (adjective)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency. The word is not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unapparently' is an advanced word that means something is not as it seems. It's used to show that the real situation is different from what you might think at first glance. Because it's not a common word, it's best used in formal writing or when you want to be very precise. It's important to make sure your audience will understand it. If not, you might want to use a simpler way to say the same thing."},"example_sentences":[{"sentence":"Unapparently, the old house was equipped with a state-of-the-art security system.","translation":"見たところそうではないが、その古い家には最新のセキュリティシステムが備わっていた。","type":"adverb","meaning_category":"seeming contradiction"},{"sentence":"Unapparently to his colleagues, he had been struggling with a serious illness for months.","translation":"同僚にはそう見えなかったが、彼は数ヶ月間深刻な病気と闘っていた。","type":"adverb","meaning_category":"hidden condition"}]}