{"word":"text-hand","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古)読みやすい書体、整った筆跡","english_definition":"(archaic) A clear, legible style of handwriting; a neat hand.","examples":[{"sentence":"She wrote the letter in a beautiful text-hand.","translation":"彼女は美しい整った筆跡で手紙を書いた。"},{"sentence":"His text-hand was admired by all who received his correspondence.","translation":"彼の整った筆跡は、彼からの手紙を受け取ったすべての人に賞賛された。"}],"collocations":["beautiful text-hand","clear text-hand","elegant text-hand","write in text-hand"],"synonyms":["calligraphy","penmanship","handwriting","script"],"antonyms":["scribble","scrawl"]}],"etymology":{"value":"'Text' refers to the style of lettering, and 'hand' refers to the handwriting. The term describes a specific style of handwriting that is clear and easy to read, often used in formal documents or correspondence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛkstˌhænd/","syllables":"text-hand"},"inflection":{"noun_plural":"text-hands"},"usage_notes":{"explanation":"'Text-hand' is an archaic term referring to a specific style of handwriting that is neat, legible, and often used for formal purposes. It is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He sent a text-hand message.","correct":"✓ He sent a handwritten message.","note":"In modern usage, 'text-hand' should not be confused with digital text messages. Use 'handwritten' to describe a message written by hand."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - archaic term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Text-hand' is an archaic term, meaning it is rarely used in contemporary English. It refers to a style of handwriting that is very neat and easy to read, similar to calligraphy but less ornate. Understanding this term is more relevant to historical contexts or literature. It is not part of modern everyday vocabulary."},"example_sentences":[{"sentence":"The old manuscript was written in a precise text-hand, making it easy to decipher.","translation":"古い原稿は正確な整った筆跡で書かれており、解読しやすかった。","type":"noun","meaning_category":"整った筆跡"},{"sentence":"Learning text-hand was once a common skill taught in schools.","translation":"整った筆跡を学ぶことは、かつて学校で教えられた一般的なスキルだった。","type":"noun","meaning_category":"整った筆跡"}]}