{"word":"eutrophy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"富栄養化","english_definition":"The process by which a body of water acquires a high concentration of nutrients, especially phosphates and nitrates. These typically promote excessive growth of algae. As the algae die and decompose, high levels of organic matter and the decomposing organisms deplete the water of available oxygen, causing the death of other organisms, such as fish.","examples":[{"sentence":"Eutrophy in lakes can lead to fish kills due to oxygen depletion.","translation":"湖の富栄養化は、酸素欠乏により魚が死滅する原因となる。"},{"sentence":"Agricultural runoff is a major contributor to eutrophy in many rivers.","translation":"農業からの流出は、多くの河川における富栄養化の主な原因である。"}],"collocations":["cause eutrophy","prevent eutrophy","control eutrophy","effects of eutrophy","reverse eutrophy"],"synonyms":["nutrient enrichment","hypertrophication"],"antonyms":["oligotrophy"]},{"part_of_speech":"noun","definition":"(植物の)栄養状態良好","english_definition":"A state of having abundant nutrients available for plant growth.","examples":[{"sentence":"Eutrophy of the soil ensures rapid plant growth.","translation":"土壌の富栄養化は、植物の急速な成長を保証する。"}],"collocations":["soil eutrophy","promote eutrophy"],"synonyms":["fertility","nutrient richness"],"antonyms":["nutrient deficiency"]}],"etymology":{"value":"From the Greek words 'eu' (meaning 'well' or 'good') and 'trophē' (meaning 'nourishment' or 'food').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjuːtrəfi/","syllables":"eu-tro-phy"},"inflection":{"noun_plural":"eutrophies"},"usage_notes":{"explanation":"'Eutrophy' refers to the process or condition of nutrient enrichment in an ecosystem, particularly in aquatic environments. It often has negative consequences due to the imbalance it creates. While nutrients are essential for life, excessive amounts can lead to ecological problems. The term is also used in soil science to describe nutrient-rich soil conditions that support vigorous plant growth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The eutrophy was caused by a lack of nutrients.","correct":"✓ The eutrophy was caused by an excess of nutrients.","note":"Eutrophy is caused by too many nutrients, not a lack of them."},{"incorrect":"✗ Eutrophy is beneficial for all aquatic life.","correct":"✓ Eutrophy can be harmful to aquatic life due to oxygen depletion.","note":"While some organisms may initially benefit from increased nutrients, the overall effect of eutrophy is often detrimental to aquatic ecosystems."}],"priority":"★★☆"},"related_words":{"derivatives":["eutrophic (adjective)","eutrophication (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Eutrophy' is a specialized term primarily used in ecology and environmental science. It describes the process where a body of water becomes overly enriched with minerals and nutrients, often due to human activities. This leads to excessive plant and algal growth, which can deplete oxygen levels and harm aquatic life. The term is generally encountered in academic or technical contexts related to environmental issues.","priority":"★★☆"},"example_sentences":[{"sentence":"The lake experienced severe eutrophy due to fertilizer runoff.","translation":"その湖は肥料の流出により深刻な富栄養化を経験した。","type":"noun","meaning_category":"富栄養化"},{"sentence":"Eutrophy can drastically alter the biodiversity of a freshwater ecosystem.","translation":"富栄養化は淡水生態系の生物多様性を劇的に変化させる可能性がある。","type":"noun","meaning_category":"富栄養化"},{"sentence":"The eutrophic soil supported a dense growth of vegetation.","translation":"富栄養化した土壌は、植物の密生を支えた。","type":"adjective","meaning_category":"(植物の)栄養状態良好"}]}