{"word":"tubercularness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"結核性であること、結核の性質","english_definition":"The state or quality of being tubercular; a condition characterized by the presence of tubercles or lesions caused by tuberculosis.","examples":[{"sentence":"The tubercularness of the lung tissue was evident in the X-ray.","translation":"レントゲン写真で肺組織の結核性が明らかだった。"},{"sentence":"The doctor noted the tubercularness of the patient's skin.","translation":"医師は患者の皮膚の結核性に注目した。"}],"collocations":["pulmonary tubercularness (肺結核性)","skin tubercularness (皮膚結核性)"],"synonyms":["tuberculosis","tubercle","consumption","phthisis"],"antonyms":["health","normality"]}],"etymology":{"value":"Formed from 'tubercular' (relating to or affected with tubercles or tuberculosis) + '-ness' (a suffix denoting a state, condition, or quality). 'Tubercular' comes from 'tubercle,' a small nodular lesion, which in turn comes from the Latin 'tuberculum,' diminutive of 'tuber' (lump, swelling).","priority":"★★☆"},"pronunciation":{"ipa":"/tjuːˌbɜːrkjʊˈlɑːrnəs/","syllables":"tu-ber-cu-lar-ness"},"inflection":{"noun_plural":"tubercularnesses (rarely used)"},"usage_notes":{"explanation":"'Tubercularness' refers to the condition or quality of being affected by tuberculosis or having tubercular lesions. It is a more technical term than 'tuberculosis' itself, often used in medical contexts to describe the specific characteristics of tissue or organs affected by the disease.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tubercularness is contagious.","correct":"✓ Tuberculosis is contagious.","note":"'Tubercularness' refers to the state of being tubercular, while 'tuberculosis' is the disease itself. The disease is contagious, not the state of being tubercular."}],"priority":"★☆☆"},"related_words":{"derivatives":["tubercular (adjective)","tuberculosis (noun)","tubercle (noun)"],"related_medical_terms":["consumption","phthisis","Koch's disease"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tubercularness' is a highly specialized term used in medical contexts to describe the condition of being affected by tuberculosis, specifically referring to the presence of tubercles or lesions caused by the disease. It is not commonly used in everyday language and is primarily found in medical literature or discussions among healthcare professionals."},"example_sentences":[{"sentence":"The radiographic examination revealed significant tubercularness in the upper lobe of the lung.","translation":"レントゲン検査で、肺の上葉に著しい結核性が認められた。","type":"noun","meaning_category":"結核性であること"},{"sentence":"Pathological analysis confirmed the tubercularness of the affected lymph nodes.","translation":"病理学的分析により、罹患したリンパ節の結核性が確認された。","type":"noun","meaning_category":"結核の性質"}]}