{"word":"well-urged","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"強く勧められた、十分に促された","english_definition":"Having been strongly encouraged or adequately prompted to do something.","examples":[{"sentence":"The committee was well-urged to consider all options before making a decision.","translation":"委員会は、決定を下す前にすべての選択肢を検討するよう強く促された。"},{"sentence":"He felt well-urged by his friends to pursue his dreams.","translation":"彼は、夢を追いかけるように友人たちから十分に促されたと感じた。"}],"collocations":["well-urged to consider","well-urged by friends","well-urged to take action"],"synonyms":["encouraged","prompted","advised","motivated","persuaded"],"antonyms":["discouraged","dissuaded","deterred"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'well' (meaning thoroughly or effectively) with the past participle of 'urge' (meaning to encourage or persuade someone to do something).","priority":"★★★"},"pronunciation":{"ipa":"/ˌwel ˈɜːrdʒd/","syllables":"well-urged"},"inflection":{"notes":"This is an adjective, so it doesn't have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Well-urged' is used to describe a state of being where someone has received strong encouragement or prompting to take a particular action. It implies that the urging was effective and had a significant impact on the person's decision or motivation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was urge well to apply for the job.","correct":"✓ He was well-urged to apply for the job.","note":"The correct form is 'well-urged' as a compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["urge (verb, noun)","urging (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (This is not a common word)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Well-urged' is a relatively uncommon adjective used to describe someone who has been strongly encouraged or prompted to do something. It suggests that the person received sufficient encouragement to take action. It is typically used in formal contexts or writing. The word is formed by combining 'well' with the past participle of 'urge'."},"example_sentences":[{"sentence":"The students were well-urged by their professor to participate in the research project.","translation":"学生たちは、教授から研究プロジェクトに参加するよう強く促された。","type":"adjective","meaning_category":"強く勧められた"},{"sentence":"She felt well-urged to speak out against the injustice.","translation":"彼女は、不正に対して声を上げるように強く促されたと感じた。","type":"adjective","meaning_category":"十分に促された"}]}