{"word":"Kibsey","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Rare) A type of small, usually inexpensive, toy or trinket. Often associated with childhood or novelty items.","english_definition":"(Rare) A type of small, usually inexpensive, toy or trinket. Often associated with childhood or novelty items.","examples":[{"sentence":"She collected kibseys from every trip to the store.","translation":"彼女は店に行くたびに、小さな玩具を集めました。"},{"sentence":"The box was filled with kibseys from his childhood.","translation":"その箱は彼の子供時代の小さな玩具でいっぱいでした。"}],"collocations":["collect kibseys","childhood kibseys"],"synonyms":["trinket","bauble","knick-knack","toy","novelty item"],"antonyms":[]}],"etymology":{"value":"Origin uncertain, possibly a diminutive or alteration of 'kibble' or a similar word suggesting something small and insignificant. The term is rare and may be regional or dialectal.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkɪbzi/","syllables":"kib-sey"},"inflection":{"noun_plural":"kibseys"},"usage_notes":{"explanation":"'Kibsey' is a very rare word, and its meaning can be vague. It generally refers to a small, often cheap, toy or trinket. It is not a commonly used word and may be unfamiliar to many English speakers.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The kibsey was very expensive and rare.","correct":"✓ The trinket was very expensive and rare.","note":"'Kibsey' implies something inexpensive, so describing it as expensive is contradictory. Use a more general term like 'trinket' or 'collectible' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Kibsey' is a rare and uncommon word. It refers to a small, inexpensive toy or trinket. Because of its rarity, it is unlikely to be encountered in everyday language. If you intend to use it, be aware that many people may not understand its meaning. It's more common to use words like 'toy,' 'trinket,' or 'knick-knack' to describe such items."},"example_sentences":[{"sentence":"The children were delighted with the kibseys they received as party favors.","translation":"子供たちはパーティーのお土産にもらった小さな玩具に大喜びでした。","type":"noun","meaning_category":"toy"},{"sentence":"Her grandmother's attic was filled with forgotten kibseys and treasures.","translation":"彼女の祖母の屋根裏部屋は、忘れられた小さな玩具や宝物でいっぱいでした。","type":"noun","meaning_category":"trinket"}]}