{"word":"Motordom","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"自動車社会、自動車業界、自動車愛好家","english_definition":"The world of motor vehicles, especially cars, and those who own, drive, or are enthusiastic about them.","examples":[{"sentence":"Motordom has changed significantly over the past few decades.","translation":"自動車社会は過去数十年間で大きく変化しました。"},{"sentence":"He is a prominent figure in motordom.","translation":"彼は自動車業界の著名な人物です。"},{"sentence":"The influence of motordom on urban planning is undeniable.","translation":"都市計画に対する自動車社会の影響は否定できません。"}],"collocations":["influence of motordom","future of motordom","members of motordom"],"synonyms":["automobile industry","car culture","automotive world"],"antonyms":[]}],"etymology":{"value":"'Motor' + 'dom' (suffix denoting domain, realm, or collective group).","priority":"★★☆"},"pronunciation":{"ipa":"ˈmoʊtərdəm","syllables":"mo-tor-dom"},"inflection":{"noun_plural":"None (usually used as an uncountable noun)"},"usage_notes":{"explanation":"'Motordom' refers to the collective world associated with motor vehicles, including the industry, culture, and enthusiasts. It often implies the societal impact and dominance of automobiles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The motordom are growing.","correct":"✓ Motordom is growing.","note":"'Motordom' is generally used as an uncountable noun, so it takes a singular verb."}],"priority":"★☆☆"},"related_words":{"derivatives":["motorist","automobile","automotive"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Motordom' is a relatively uncommon word that describes the collective world of motor vehicles. It is often used in discussions about the social, economic, and environmental impacts of cars. Understanding this word requires a good grasp of abstract nouns and specialized vocabulary related to the automotive industry."},"example_sentences":[{"sentence":"The rise of electric vehicles is reshaping motordom.","translation":"電気自動車の台頭は自動車社会を再構築しています。","type":"general","meaning_category":"automobile society"},{"sentence":"Regulations within motordom are constantly evolving to address safety concerns.","translation":"自動車業界内の規制は、安全上の懸念に対処するために常に進化しています。","type":"industry","meaning_category":"automobile industry"},{"sentence":"His passion for classic cars made him a respected figure in motordom.","translation":"彼のクラシックカーへの情熱は、彼を自動車愛好家の中で尊敬される人物にしました。","type":"enthusiasts","meaning_category":"automobile enthusiasts"}]}