{"word":"effigiated","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人を)像で表す、(人を)像にして処罰する","english_definition":"To represent (a person) in an effigy; to punish or execute (a person) in effigy.","examples":[{"sentence":"The dictator was effigiated in street protests.","translation":"その独裁者は街頭デモで像で表された。"},{"sentence":"Although the traitor had fled the country, he was effigiated in absentia.","translation":"その裏切り者は国外に逃亡したが、不在のまま像で処罰された。"}],"collocations":["effigiate a person (人を像で表す)","effigiate in absentia (不在のまま像で処罰する)"],"synonyms":["represent","depict","portray","symbolize"],"antonyms":[]}],"etymology":{"value":"Derived from 'effigy,' which comes from the Latin 'effigies' meaning 'image, likeness, portrait.' The verb 'effigiate' means to create an effigy of someone or to treat someone in effigy.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈfɪdʒieɪtɪd/","syllables":"ef-fig-i-a-ted"},"inflection":{"verb_forms":{"present_simple":["effigiate","effigiates"],"past_simple":"effigiated","past_participle":"effigiated","present_participle":"effigiating"}},"usage_notes":{"explanation":"'Effigiate' is a relatively rare verb, primarily used in historical or political contexts to describe the act of creating an effigy (a representation or image) of someone, often for purposes of protest, ridicule, or symbolic punishment. The phrase 'effigiated in absentia' refers to the practice of symbolically punishing someone by destroying or mistreating their effigy when they are not physically present.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was effigiated with lights.","correct":"✓ The building was decorated with lights.","note":"'Effigiate' specifically refers to creating or using an effigy of a person, not simply decorating something."},{"incorrect":"✗ They effigiated the problem.","correct":"✓ They addressed the problem.","note":"'Effigiate' is used for people, not abstract concepts or problems. Use 'addressed' or 'solved' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["effigy (noun: an image or representation of a person)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Effigiated' is a sophisticated term mainly encountered in historical or political discussions. It describes the act of creating a representation (effigy) of someone, often for symbolic punishment or protest. This word is not commonly used in everyday conversation and is more likely to appear in academic or specialized texts. Understanding the nuances of this word requires a strong grasp of historical and cultural contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The unpopular leader was effigiated during the demonstration.","translation":"その不人気な指導者はデモの際に像で表された。","type":"verb","meaning_category":"像で表す"},{"sentence":"The convicted criminal, who had escaped, was effigiated in the town square.","translation":"逃亡した有罪判決を受けた犯罪者は、町の広場で像で処罰された。","type":"verb","meaning_category":"像にして処罰する"}]}