{"word":"odorimeter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"臭気測定器、におい計","english_definition":"An instrument used to measure odor concentration and intensity.","examples":[{"sentence":"The odorimeter is used to quantify the level of malodor in the wastewater treatment plant.","translation":"その臭気測定器は、廃水処理プラントにおける悪臭のレベルを定量化するために使用される。"},{"sentence":"Researchers used an odorimeter to assess the effectiveness of the air freshener.","translation":"研究者たちは、空気清浄機の効果を評価するために臭気測定器を使用した。"}],"collocations":["use an odorimeter (臭気測定器を使う)","calibrate an odorimeter (臭気測定器を校正する)","measure odor with an odorimeter (臭気測定器で臭気を測定する)"],"synonyms":["olfactometer"],"antonyms":[]},{"part_of_speech":"noun","definition":"（より広義に）臭いを測定するための装置全般","english_definition":"(More broadly) Any device used for measuring odors.","examples":[{"sentence":"Various types of odorimeters are available, each designed for specific applications.","translation":"様々な種類の臭気測定器があり、それぞれ特定の用途向けに設計されている。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"\"Odor\" (におい) + \"-i-\" (連結音) + \"-meter\" (測定器)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊdəˈrɪmɪtər/","syllables":"o-do-rim-e-ter"},"inflection":{"noun_plural":"odorimeters"},"usage_notes":{"explanation":"An odorimeter is a scientific instrument designed to objectively measure the concentration and intensity of odors. It is used in various fields, including environmental science, food science, and industrial hygiene, to assess and control odor pollution. The instrument typically dilutes an odorous sample with odor-free air until the odor is just barely detectable by human assessors or sensors. The dilution factor at which the odor is detectable is then used as a measure of the odor concentration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The odorimeter measured the taste of the sample.","correct":"✓ The odorimeter measured the odor of the sample.","note":"Odorimeters measure odors, not tastes."},{"incorrect":"✗ The odorimeter gave a subjective reading of the smell.","correct":"✓ The odorimeter gave an objective reading of the smell.","note":"While human assessors may be involved, the odorimeter aims to provide an objective measurement of odor concentration."}],"priority":"★★☆"},"related_words":{"derivatives":["odorimetry (名詞: 臭気測定法)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"odorimeter\" is a technical term used to describe a device that measures smells. It's not a common word in everyday conversation, but it's used in scientific and industrial contexts where the objective measurement of odors is important. Understanding the word requires knowledge of the root words \"odor\" (smell) and \"meter\" (measuring device)."},"example_sentences":[{"sentence":"The company uses an odorimeter to ensure that its products meet strict odor control standards.","translation":"その会社は、製品が厳格な臭気管理基準を満たしていることを保証するために、臭気測定器を使用している。","type":"general","meaning_category":"臭気測定器の使用例"},{"sentence":"The researchers compared the results obtained from the odorimeter with sensory evaluations by a panel of trained assessors.","translation":"研究者たちは、臭気測定器から得られた結果と、訓練された評価者パネルによる官能評価とを比較した。","type":"research","meaning_category":"研究における使用例"}]}