{"word":"unremittency","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"絶え間ないこと、不断であること、容赦のなさ","english_definition":"The quality or state of being unremitting; ceaselessness; persistence; relentlessness.","examples":[{"sentence":"The unremittency of the rain made it impossible to continue the hike.","translation":"雨が降り止まないため、ハイキングを続けることは不可能になった。"},{"sentence":"He admired her unremittency in pursuing her goals, despite the obstacles.","translation":"彼は、障害にもかかわらず目標を追求する彼女の不断の努力に感心した。"},{"sentence":"The unremittency of the pain was unbearable.","translation":"痛みが絶え間なく続くのが耐えられなかった。"}],"collocations":["unremittency of effort","unremittency of pain","unremittency of attention","unremittency of pressure"],"synonyms":["ceaselessness","persistence","relentlessness","constancy","incessancy","perpetuity","continuity"],"antonyms":["remission","intermittence","cessation","discontinuity"]}],"etymology":{"value":"Derived from 'unremitting' (not remitting or relaxing), which comes from 'remit' (to send back, relax, or abate) with the prefix 'un-' (not) and the suffix '-ency' (forming nouns denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnrɪˈmɪtənsi/","syllables":"un-re-mit-ten-cy"},"inflection":{"noun_plural":"unremittencies (rare)"},"usage_notes":{"explanation":"'Unremittency' is a relatively uncommon noun that describes the quality of something being continuous, persistent, and without any breaks or pauses. It is often used to describe negative situations such as constant pain or pressure, but can also be used to describe positive qualities like unwavering dedication.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unremittency was feeling by everyone.","correct":"✓ The unremittency was felt by everyone.","note":"'Unremittency' is a noun, so it describes a state or quality. The correct verb form should reflect that the quality was 'felt' rather than 'feeling'."},{"incorrect":"✗ He showed unremitting to his work.","correct":"✓ He showed unremittency in his work.","note":"'Unremitting' is an adjective, while 'unremittency' is a noun. The correct usage depends on whether you are describing the quality (unremittency) or describing something as being continuous (unremitting)."}],"priority":"★★☆"},"related_words":{"derivatives":["unremitting (adjective)","remit (verb)","remittance (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unremittency' is a formal and uncommon word that means the state of being continuous and without any pauses or breaks. It's often used in academic or technical contexts to describe something that is persistent and unrelenting. Because it is not a commonly used word, it is more likely to be encountered in advanced reading materials or formal writing.","example_sentences":[]},"example_sentences":[{"sentence":"The doctor was concerned about the unremittency of the patient's fever.","translation":"医師は患者の熱が下がらないことを懸念していた。","type":"noun","meaning_category":"絶え間ないこと"},{"sentence":"The company's success was due to the unremittency of its marketing efforts.","translation":"その会社の成功は、マーケティング活動の不断の努力によるものだった。","type":"noun","meaning_category":"不断であること"},{"sentence":"The prisoner suffered from the unremittency of the guards' surveillance.","translation":"囚人は看守の容赦ない監視に苦しんだ。","type":"noun","meaning_category":"容赦のなさ"}]}