{"word":"middle-class-influenced","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"中産階級の影響を受けた","english_definition":"Having been affected or shaped by the values, attitudes, or behaviors associated with the middle class.","examples":[{"sentence":"The policy was criticized for being middle-class-influenced and not addressing the needs of the working class.","translation":"その政策は、中産階級の影響を受けており、労働者階級のニーズに対応していないとして批判された。"},{"sentence":"The school's curriculum is very middle-class-influenced, focusing on academic achievement and college preparation.","translation":"その学校のカリキュラムは、学業成績と大学進学の準備に重点を置いており、中産階級の影響を強く受けている。"},{"sentence":"Her upbringing was middle-class-influenced, emphasizing education and social responsibility.","translation":"彼女の生い立ちは、教育と社会的責任を重視する中産階級の影響を受けていた。"}],"collocations":["middle-class values","middle-class upbringing","middle-class education","middle-class culture"],"synonyms":["bourgeois-influenced","conventional","mainstream"],"antonyms":["working-class-influenced","upper-class-influenced","unconventional"]},{"part_of_speech":"adjective","definition":"中産階級の影響力のある","english_definition":"Having the power to affect or change something because of the influence of the middle class.","examples":[{"sentence":"The election results showed that the middle-class-influenced voters were decisive in the outcome.","translation":"選挙結果は、中産階級の影響力のある有権者が結果を左右したことを示した。"},{"sentence":"The advertising campaign targeted the middle-class-influenced consumer market.","translation":"その広告キャンペーンは、中産階級の影響力のある消費者市場をターゲットにしていた。"}],"collocations":["middle-class voters","middle-class consumer","middle-class market"],"synonyms":["influential","powerful","dominant"],"antonyms":["powerless","weak","insignificant"]}],"etymology":{"value":"Derived from the combination of 'middle-class' (referring to the socioeconomic group between the working class and upper class) and 'influenced' (affected or shaped by something).","priority":"low"},"pronunciation":{"ipa":"/ˌmɪdəl ˈklæs ˌɪnfluənst/","syllables":"mid-dle-class-in-flu-enced"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. It can be used to modify nouns."},"usage_notes":{"explanation":"'Middle-class-influenced' describes something that has been affected by the values, attitudes, or behaviors typically associated with the middle class. It can refer to policies, cultural products, or even personal characteristics. The term often carries a connotation of being conventional or mainstream, but it can also be used neutrally to describe the impact of the middle class on a particular phenomenon.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The middle-class influenced policy.","correct":"The middle-class-influenced policy.","note":"Hyphenation is important to show that 'middle-class' is acting as a single adjective modifying 'influenced'."},{"incorrect":"The policy was influence by the middle class.","correct":"The policy was middle-class-influenced.","note":"'Middle-class-influenced' is a more concise and direct way to express that the policy was affected by the middle class."}],"priority":"low"},"related_words":{"derivatives":["influence","middle-class","middle-class values","middle-class society"],"phrases":["influenced by","shaped by","affected by"],"priority":"low"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'middle-class-influenced' is used to describe something that has been affected or shaped by the values, attitudes, or behaviors associated with the middle class. This term is often used in discussions about social class, cultural norms, and policy. It implies that the middle class has had a significant impact on the thing being described. It's important to understand the context in which the term is used, as it can sometimes carry a critical connotation, suggesting that the interests of other social classes have been overlooked."},"example_sentences":[{"sentence":"The art exhibit was criticized for being too middle-class-influenced and lacking diversity.","translation":"その美術展は、中産階級の影響を受けすぎて多様性に欠けると批判された。","type":"adjective","meaning_category":"affected by middle class values"},{"sentence":"The government's education reforms were largely middle-class-influenced.","translation":"政府の教育改革は、主に中産階級の影響を受けていた。","type":"adjective","meaning_category":"shaped by middle class"},{"sentence":"The candidate's policies were seen as middle-class-influenced, alienating some working-class voters.","translation":"その候補者の政策は、中産階級の影響を受けていると見なされ、一部の労働者階級の有権者を遠ざけた。","type":"adjective","meaning_category":"having middle class influence"}]}