{"word":"concentrically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"同心円状に、中心を同じくして","english_definition":"in a concentric manner; having a common center.","examples":[{"sentence":"The ripples spread concentrically from the point where the stone hit the water.","translation":"石が水面に当たった場所から、波紋が同心円状に広がった。"},{"sentence":"The rings of the target are arranged concentrically.","translation":"的の輪は同心円状に配置されている。"},{"sentence":"The city was planned with concentrically arranged streets.","translation":"その都市は、同心円状に配置された通りで計画された。"}],"collocations":["arranged concentrically","spread concentrically","positioned concentrically"],"synonyms":["circularly","radially"],"antonyms":["eccentrically","asymmetrically"]}],"etymology":{"value":"「concentric」+「-ally」。concentricは、「con-」（共に）+「centric」（中心の）から成り立ち、全体として「同じ中心を持つ」という意味。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒnˈsɛntrɪkli/","syllables":"con-cen-tri-cal-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Concentrically' describes the arrangement or movement of objects or patterns around a common center. It is often used in contexts involving circles, rings, or waves. The word emphasizes the shared center point of the shapes or movements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The circles were concentric, they shared a center.","correct":"✓ The circles were arranged concentrically; they shared a center.","note":"'Concentric' is an adjective, while 'concentrically' is an adverb. Use the adjective to describe the circles directly, or use the adverb to describe how they are arranged."}],"priority":"★★☆"},"related_words":{"derivatives":["concentric (adjective)","concentricity (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Concentrically' is an adverb that describes something arranged or moving in circles that share the same center. It's a more advanced word, often used in technical or descriptive contexts. For example, you might say that the rings of a tree grow concentrically, meaning each new ring forms a circle around the same center point as the previous rings."},"example_sentences":[{"sentence":"The artist painted a series of concentrically larger circles.","translation":"その芸術家は、同心円状に大きくしていく一連の円を描いた。","type":"descriptive","meaning_category":"arrangement"},{"sentence":"The sound waves expanded concentrically from the speaker.","translation":"音波はスピーカーから同心円状に広がった。","type":"descriptive","meaning_category":"movement"},{"sentence":"The seats in the amphitheater were arranged concentrically around the stage.","translation":"円形劇場の座席は、舞台を中心にして同心円状に配置されていた。","type":"descriptive","meaning_category":"arrangement"}]}