{"word":"pubescency","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"思春期、青年期、発毛期","english_definition":"the stage of life during which an individual becomes capable of sexual reproduction; the period of adolescence; the state of being covered with soft, downy hairs.","examples":[{"sentence":"Pubescency is a time of significant physical and emotional change.","translation":"思春期は、身体的および感情的に大きな変化の時期です。"},{"sentence":"The onset of pubescency varies among individuals.","translation":"思春期の始まりは個人によって異なります。"},{"sentence":"The pubescency of certain plants is a characteristic used for identification.","translation":"特定の植物の軟毛は、識別のために使用される特徴です。"}],"collocations":["onset of pubescency (思春期の始まり)","signs of pubescency (思春期の兆候)","during pubescency (思春期の間)"],"synonyms":["adolescence","puberty","youth","maturation"],"antonyms":["childhood","infancy"]}],"etymology":{"value":"Derived from the Latin word 'pubescere,' meaning 'to become pubescent' or 'to reach puberty.' This, in turn, comes from 'pubes,' referring to the adult groin or pubic area, and also to the hair that grows there.","priority":"★★☆"},"pronunciation":{"ipa":"/pjuːˈbɛsənsi/","syllables":"pu-bes-cen-cy"},"inflection":{"noun_plural":"pubescencies"},"usage_notes":{"explanation":"'Pubescency' refers to the process or state of reaching puberty. It can also refer to the presence of soft, downy hairs, especially on plants. The context usually makes the intended meaning clear.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pubescency was a difficult time for her parents.","correct":"✓ Adolescence was a difficult time for her parents.","note":"While 'pubescency' refers to the stage of development, 'adolescence' is more commonly used to describe the period of life. 'Pubescency' is more biological, while 'adolescence' encompasses social and psychological aspects."},{"incorrect":"✗ The plant's pubescency made it easy to identify.","correct":"✓ The plant's pubescence made it easy to identify.","note":"When referring to the presence of soft hairs, 'pubescence' is the more common and accepted term."}],"priority":"★☆☆"},"related_words":{"derivatives":["pubescent (adjective: 思春期の、発毛した)","pubescence (noun: 軟毛、思春期)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pubescency' is a relatively formal and specialized term referring to the process of reaching puberty or the presence of soft, downy hairs. It's more common in scientific or medical contexts when discussing the biological aspects of puberty or describing botanical characteristics. In general conversation, 'puberty' or 'adolescence' are more frequently used to describe the period of development. When referring to hairs, 'pubescence' is more common."},"example_sentences":[{"sentence":"The study examined the hormonal changes during pubescency.","translation":"その研究では、思春期におけるホルモンの変化を調べた。","type":"noun","meaning_category":"思春期"},{"sentence":"The botanist noted the pubescency on the leaves of the new species.","translation":"植物学者は、新種の葉の軟毛に注目した。","type":"noun","meaning_category":"発毛期"}]}