{"word":"xanthane","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"キサンタン","english_definition":"A polysaccharide secreted by Xanthomonas campestris, used as a thickening or stabilizing agent.","examples":[{"sentence":"Xanthane is used in a wide variety of food products.","translation":"キサンタンは多種多様な食品に使用されています。"},{"sentence":"Xanthane helps to improve the texture of sauces.","translation":"キサンタンはソースのテクスチャを改善するのに役立ちます。"}],"collocations":["xanthane gum","food-grade xanthane"],"synonyms":["xanthan gum"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name Xanthomonas (bacteria producing it) + -ane (chemical suffix).","priority":"★★★"},"pronunciation":{"ipa":"/ˈzænθeɪn/","syllables":"zan-thane"},"inflection":{"noun_plural":"xanthanes"},"usage_notes":{"explanation":"Xanthane is primarily used as a food additive and stabilizer. It is also used in cosmetics, pharmaceuticals, and industrial applications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I added xanthane to the soup for flavor.","correct":"✓ I added xanthane to the soup to thicken it.","note":"Xanthane is primarily a thickening agent, not a flavoring agent."}],"priority":"★★☆"},"related_words":{"derivatives":["xanthane gum"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Xanthane is a technical term primarily encountered in the context of food science, chemistry, and manufacturing. Understanding its usage requires familiarity with polysaccharides and their applications as thickening and stabilizing agents.","priority":"★★☆"},"example_sentences":[{"sentence":"The viscosity of the solution increased with the addition of xanthane.","translation":"キサンタンを加えることで溶液の粘度が増加しました。","type":"noun","meaning_category":"thickening agent"},{"sentence":"Xanthane is often used in gluten-free baking to improve the texture of the bread.","translation":"キサンタンはグルテンフリーのパンのテクスチャを改善するためによく使用されます。","type":"noun","meaning_category":"food additive"}]}