{"word":"erosive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"浸食性の、腐食性の、むしばむような","english_definition":"Causing erosion; tending to erode; corrosive.","examples":[{"sentence":"The erosive power of the river carved the canyon over millions of years.","translation":"その川の浸食力は何百万年もの間、峡谷を刻み続けた。"},{"sentence":"Acid rain has an erosive effect on buildings and statues.","translation":"酸性雨は建物や彫像に腐食性の影響を与える。"},{"sentence":"The erosive nature of the political debate damaged the party's unity.","translation":"その政治討論のむしばむような性質は、党の結束を損なった。"}],"collocations":["erosive force (浸食力)","erosive effect (浸食効果、腐食効果)","erosive action (浸食作用)","erosive soils (浸食されやすい土壌)","erosive processes (浸食過程)","erosive wear (腐食摩耗)"],"synonyms":["corrosive","destructive","wearing","degrading","attenuating","dissolving","consuming"],"antonyms":["constructive","protective","building","conservative","stabilizing"]}],"etymology":{"value":"From 'erode' + '-ive'. 'Erode' comes from the Latin 'erodere', meaning 'to gnaw away'.","priority":"★★★"},"pronunciation":{"ipa":"/ɪˈroʊsɪv/","syllables":"e-ro-sive"},"inflection":{"notes":"Adjectives do not inflect in English, but can form comparative and superlative degrees (more erosive, most erosive)."},"usage_notes":{"explanation":"'Erosive' describes something that causes gradual destruction or wearing away, either physically (like water eroding rock) or metaphorically (like criticism eroding confidence). It's often used in scientific or technical contexts, but can also be used in more general writing to describe something that gradually weakens or destroys something else. The word emphasizes the gradual, persistent nature of the destructive process.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The erosive person made me feel bad.","correct":"✓ The critical person made me feel bad.","note":"'Erosive' describes a process or quality, not a person. Use 'critical', 'undermining', or another adjective to describe a person who makes you feel bad."},{"incorrect":"✗ The medicine was erosive to my stomach.","correct":"✓ The medicine was irritating to my stomach.","note":"'Erosive' implies a gradual wearing away. For immediate discomfort, use 'irritating' or 'upsetting' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["erosion (noun: the process of eroding)","erode (verb: to gradually wear away)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency; more common in scientific and technical writing.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Erosive' is a more advanced word that describes something causing erosion, which is the process of gradually wearing something away. It's often used in science to describe how water or wind changes the landscape. You might also see it used to describe how something gradually damages or weakens something else, like how constant criticism can have an 'erosive' effect on someone's confidence. Because it's more specialized, you won't see it as often as more common words."},"example_sentences":[{"sentence":"The constant negativity had an erosive impact on their relationship.","translation":"絶え間ない否定的な感情は、彼らの関係にむしばむような影響を与えた。","type":"adjective","meaning_category":"metaphorical erosion"},{"sentence":"The erosive action of the waves gradually reshaped the coastline.","translation":"波の浸食作用は徐々に海岸線を再形成した。","type":"adjective","meaning_category":"physical erosion"},{"sentence":"The erosive effects of inflation can reduce the value of savings over time.","translation":"インフレの浸食効果は、時間の経過とともに貯蓄の価値を減少させる可能性がある。","type":"adjective","meaning_category":"economic erosion"}]}