{"word":"resterilizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再滅菌する、再び滅菌処理を行う","english_definition":"To sterilize again; to subject to a second sterilization process.","examples":[{"sentence":"The instruments were resterilized before the next surgery.","translation":"その器具は次の手術の前に再滅菌された。"},{"sentence":"Due to contamination, the equipment required resterilizing.","translation":"汚染のため、その装置は再滅菌が必要だった。"}],"collocations":["resterilize equipment (装置を再滅菌する)","resterilize instruments (器具を再滅菌する)"],"synonyms":["re-sterilize","second sterilization"],"antonyms":["sterilize (once)"],"notes":"This term is typically used in medical, laboratory, or food processing contexts."}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning 'again') to the word 'sterilizing', which is the present participle of 'sterilize'. 'Sterilize' comes from the French 'stérile' and Late Latin 'sterilis', meaning 'barren' or 'infertile'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈstɛrɪlaɪzɪŋ/","syllables":"re-ster-i-liz-ing"},"inflection":{"verb_forms":{"present_simple":["resterilize","resterilizes"],"past_simple":"resterilized","past_participle":"resterilized","present_participle":"resterilizing"}},"usage_notes":{"explanation":"'Resterilizing' implies that an item or substance has already undergone a sterilization process once, but for some reason (e.g., contamination, improper initial sterilization) it needs to be sterilized again.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Resterilizing is not necessary if you sterilize good.","correct":"✓ Resterilizing is not necessary if you sterilize well.","note":"'Good' is an adjective, while 'well' is an adverb. Since it modifies the verb 'sterilize', the adverb 'well' should be used."}],"priority":"★☆☆"},"related_words":{"derivatives":["resterilize (verb)","resterilization (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized term used in specific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Resterilizing' is a specialized term primarily used in medical, laboratory, and food processing settings. It refers to the act of sterilizing something again, implying that a previous sterilization process was either insufficient or that the item has been re-contaminated. The term is derived from 'sterilize' with the addition of the prefix 're-', indicating repetition. Understanding this term requires a familiarity with sterilization processes and the importance of maintaining a sterile environment in certain fields."},"example_sentences":[{"sentence":"The lab technician was responsible for resterilizing the petri dishes after each experiment.","translation":"その実験技師は、各実験後にシャーレを再滅菌する責任があった。","type":"verb","meaning_category":"再滅菌する"},{"sentence":"Resterilizing medical equipment is a critical step in preventing infections.","translation":"医療機器の再滅菌は、感染症予防において重要なステップである。","type":"verb","meaning_category":"再滅菌する"}]}