{"word":"Nonautonomously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"非自律的に、自律性なしに","english_definition":"In a manner that is not autonomous; without self-governance or independence.","examples":[{"sentence":"The system operates nonautonomously, requiring constant human oversight.","translation":"そのシステムは非自律的に動作し、常に人間の監視を必要とする。"},{"sentence":"The subsidiary functions nonautonomously under the direct control of the parent company.","translation":"その子会社は親会社の直接的な管理下で非自律的に機能する。"}],"collocations":["operate nonautonomously","function nonautonomously","behave nonautonomously"],"synonyms":["dependently","subordinately","heteronomously"],"antonyms":["autonomously","independently","self-sufficiently"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (not) to 'autonomously'. 'Autonomously' comes from 'autonomous', which is derived from the Greek words 'auto' (self) and 'nomos' (law or rule), thus meaning 'self-governing'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnɔːˈtɒnəməsli/","syllables":"non-au-ton-o-mous-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Nonautonomously' describes actions or processes that lack independence or self-governance. It is often used in technical or formal contexts to indicate a system or entity that relies on external control or input.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The robot acted nonautonomously because it was broken.","correct":"✓ The robot acted nonautonomously because it was programmed to follow instructions.","note":"'Nonautonomously' refers to a design or programming choice, not a malfunction. If a robot malfunctions, it is simply malfunctioning, not acting nonautonomously."}],"priority":"★☆☆"},"related_words":{"derivatives":["nonautonomous (adjective)","autonomously (adverb)","autonomy (noun)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonautonomously' is a formal term used to describe something that lacks independence or self-governance. It's the opposite of 'autonomously,' which means acting independently. You'll typically find this word in technical, academic, or legal contexts when discussing systems, processes, or entities that are controlled by external factors rather than operating on their own. Understanding the root word 'autonomy' is key to grasping the meaning of 'nonautonomously.'"},"example_sentences":[{"sentence":"The drone flew nonautonomously, guided by a remote pilot.","translation":"そのドローンは遠隔操縦士によって誘導され、非自律的に飛行した。","type":"general"},{"sentence":"The AI system, while advanced, still operates nonautonomously, requiring human oversight for critical decisions.","translation":"そのAIシステムは高度だが、依然として非自律的に動作し、重要な決定には人間の監視を必要とする。","type":"technical"}]}