{"word":"thrombus","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"血栓","english_definition":"A blood clot formed in situ within the vascular system of the body and impeding blood flow.","examples":[{"sentence":"A thrombus in the coronary artery can cause a heart attack.","translation":"冠動脈内の血栓は心臓発作を引き起こす可能性があります。"},{"sentence":"The doctor warned about the risk of thrombus formation after surgery.","translation":"医師は手術後の血栓形成のリスクについて警告しました。"},{"sentence":"Deep vein thrombosis (DVT) is caused by a thrombus forming in a deep vein.","translation":"深部静脈血栓症（DVT）は、深部静脈に血栓が形成されることによって引き起こされます。"}],"collocations":["coronary thrombus (冠状血栓)","venous thrombus (静脈血栓)","arterial thrombus (動脈血栓)","thrombus formation (血栓形成)","dissolve a thrombus (血栓を溶解する)","remove a thrombus (血栓を除去する)"],"synonyms":["blood clot","clot","embolus"],"antonyms":["anticoagulant","thrombolytic agent"]},{"part_of_speech":"noun","definition":"(病理学)血栓症","english_definition":"(Pathology) The condition of having a thrombus.","examples":[{"sentence":"Thrombus can lead to serious complications if not treated promptly.","translation":"血栓症は、迅速に治療しないと深刻な合併症につながる可能性があります。"}],"collocations":[],"synonyms":["thrombosis"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek θρόμβος (thrómbos, “lump, clot”).","priority":"★★★"},"pronunciation":{"ipa":"/ˈθrɒmbəs/","syllables":"throm-bus"},"inflection":{"noun_plural":"thrombi"},"usage_notes":{"explanation":"A thrombus is a stationary blood clot that forms inside a blood vessel or the heart. It's important to distinguish it from an embolus, which is a clot that has broken loose and is traveling through the bloodstream. The formation of a thrombus (thrombosis) can obstruct blood flow and lead to serious medical conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a thrombus in his brain, so he took aspirin.","correct":"✓ He had a thrombus in his brain, so he was prescribed anticoagulants.","note":"Aspirin can help prevent thrombus formation, but stronger anticoagulants are often needed to treat an existing thrombus."},{"incorrect":"✗ The thrombus was caused by a bacteria.","correct":"✓ The thrombus was caused by a combination of factors, including slow blood flow and damage to the blood vessel wall.","note":"While infection can sometimes contribute, thrombus formation is usually due to a combination of factors (Virchow's triad): slow blood flow (stasis), hypercoagulability, and damage to the blood vessel wall."}],"priority":"★★☆"},"related_words":{"derivatives":["thrombotic (adjective: relating to or caused by a thrombus)","thrombosis (noun: the formation or presence of a thrombus)","thrombectomy (noun: surgical removal of a thrombus)","thrombolysis (noun: the breakdown of a thrombus)","thrombolytic (adjective: causing the breakdown of a thrombus; noun: a thrombolytic drug)","thromboplastin (noun: a substance involved in blood clotting)","thrombocyte (noun: platelet)","thrombocytopenia (noun: deficiency of platelets in the blood)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thrombus' is a medical term referring to a blood clot that forms inside a blood vessel or the heart. It's a more technical term, usually encountered in medical contexts or discussions about health conditions like deep vein thrombosis (DVT) or heart attacks. Understanding this term is important for comprehending medical information related to cardiovascular health.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient developed a deep vein **thrombus** after prolonged immobility.","translation":"患者は長期の不動状態の後、深部静脈血栓を発症しました。","type":"noun","meaning_category":"血栓"},{"sentence":"An arterial **thrombus** can lead to ischemia in the affected tissue.","translation":"動脈血栓は、影響を受けた組織の虚血を引き起こす可能性があります。","type":"noun","meaning_category":"血栓"},{"sentence":"The doctor prescribed medication to prevent further **thrombus** formation.","translation":"医師は、さらなる血栓形成を防ぐための薬を処方しました。","type":"noun","meaning_category":"血栓"},{"sentence":"The **thrombus** was successfully removed during the thrombectomy procedure.","translation":"血栓は血栓摘出手術中に無事除去されました。","type":"noun","meaning_category":"血栓"}]}