{"word":"Kugelhof","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"クグロフ (アルザス地方の伝統的な焼き菓子)","english_definition":"A type of ring-shaped cake, traditionally made with yeast, raisins, and almonds, originating from the Alsace region of France and Southern Germany.","examples":[{"sentence":"She baked a delicious Kugelhof for the Christmas party.","translation":"彼女はクリスマスパーティーのために美味しいクグロフを焼いた。"},{"sentence":"We enjoyed a slice of Kugelhof with our afternoon coffee.","translation":"私たちは午後のコーヒーと一緒にクグロフを一切れ楽しんだ。"}],"collocations":["bake a Kugelhof","slice of Kugelhof","traditional Kugelhof","Alsatian Kugelhof"],"synonyms":["Gugelhupf","Bundt cake"],"antonyms":[]}],"etymology":{"value":"The name 'Kugelhof' is derived from the German words 'Kugel' (ball, sphere) and 'Hof' (courtyard, manor). It is also known as 'Gugelhupf' in other regions, which has a less clear etymology but is thought to be related to the hood or head covering shape of the cake.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkuːɡəlˌhɔːf/","syllables":"Ku-gel-hof"},"inflection":{"noun_plural":"Kugelhofs"},"usage_notes":{"explanation":"'Kugelhof' typically refers to the traditional Alsatian cake, though the term can sometimes be used interchangeably with 'Gugelhupf' or 'Bundt cake,' depending on the region and specific recipe. It's often associated with festive occasions and is known for its distinctive ring shape and use of yeast dough.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I baked a Kugelhof in a square pan.","correct":"✓ I baked a Kugelhof in a Kugelhof pan.","note":"Kugelhof is traditionally baked in a specific ring-shaped mold. Using a square pan would not result in a true Kugelhof."}],"priority":"★★☆"},"related_words":{"derivatives":["Gugelhupf","Bundt cake"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Kugelhof' is a relatively uncommon word, referring to a specific type of cake. Understanding requires familiarity with European baked goods. The term is most likely to be encountered in culinary contexts or when discussing regional specialties of Alsace or Southern Germany."},"example_sentences":[{"sentence":"The aroma of freshly baked Kugelhof filled the kitchen.","translation":"焼きたてのクグロフの香りが台所を満たした。","type":"noun","meaning_category":"cake"},{"sentence":"She decorated the Kugelhof with powdered sugar and almonds.","translation":"彼女はクグロフに粉砂糖とアーモンドで飾り付けをした。","type":"noun","meaning_category":"cake"}]}