{"word":"palpator","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"触診器、触診者","english_definition":"An instrument or person that palpates, especially for medical purposes.","examples":[{"sentence":"The doctor used a palpator to examine the patient's abdomen.","translation":"医者は触診器を使って患者の腹部を診察した。"},{"sentence":"The palpator detected a slight swelling.","translation":"触診者はわずかな腫れを検出した。"}],"collocations":["medical palpator","abdominal palpator"],"synonyms":["examiner","toucher"],"antonyms":[]}],"etymology":{"value":"From Latin 'palpare' (to touch gently, feel) + '-tor' (agent suffix).","priority":"★★★"},"pronunciation":{"ipa":"ˈpælpeɪtər","syllables":"pal-pa-tor"},"inflection":{"noun_plural":"palpators"},"usage_notes":{"explanation":"'Palpator' is a relatively uncommon word, primarily used in medical contexts. It refers either to a tool designed for palpation or to a medical professional who performs palpation as part of a physical examination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The palpator was used to see the inside of the body.","correct":"✓ The palpator was used to feel for abnormalities.","note":"Palpators are used for feeling, not seeing."}],"priority":"★★☆"},"related_words":{"derivatives":["palpate","palpation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'palpator' is a technical term primarily used in medical settings. It refers to either an instrument used for palpation or a person who performs palpation, which is the process of examining the body by touch to detect abnormalities. Due to its specialized usage, it is not commonly encountered in general English. Understanding this term is more relevant for those in medical or related fields."},"example_sentences":[{"sentence":"The experienced physician acted as a skilled palpator, quickly identifying the source of the patient's discomfort.","translation":"熟練した医師は熟練した触診者として行動し、患者の不快感の原因を迅速に特定した。","type":"noun","meaning_category":"触診者"},{"sentence":"The new electronic palpator provided more precise feedback than manual methods.","translation":"新しい電子触診器は、手動の方法よりも正確なフィードバックを提供した。","type":"noun","meaning_category":"触診器"}]}