{"word":"Mangyan","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"マンヤン族 (フィリピン、ミンドロ島の先住民族)","english_definition":"A collective term for the eight indigenous groups of Mindoro Island, Philippines.","examples":[{"sentence":"The Mangyan people are known for their peaceful nature and rich cultural heritage.","translation":"マンヤン族は、その平和的な性格と豊かな文化遺産で知られています。"}],"collocations":["Mangyan tribe","Mangyan culture","Mangyan script"],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"マンヤン族の、マンヤン族に関する","english_definition":"Relating to the Mangyan people or their culture.","examples":[{"sentence":"Mangyan handicrafts are popular souvenirs.","translation":"マンヤン族の民芸品は人気のお土産です。"}],"collocations":["Mangyan language","Mangyan traditions","Mangyan art"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"マンヤン語 (ミンドロ島で話される言語の総称)","english_definition":"A group of related languages spoken by the Mangyan peoples.","examples":[{"sentence":"Several distinct Mangyan languages are spoken on Mindoro.","translation":"ミンドロ島では、いくつかの異なるマンヤン語が話されています。"}],"collocations":["Alangan language","Tadyawan language","Iraya language"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'Mangyan' is derived from the word 'man' or 'tao-o-man', meaning 'people' or 'human beings'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɑːŋjɑːn/","syllables":"Mang-yan"},"inflection":{"notes":"The word 'Mangyan' does not have a plural form when referring to the collective group of people. When referring to an individual, 'a Mangyan' can be used."},"usage_notes":{"explanation":"'Mangyan' is a collective term, and it's important to recognize that it encompasses multiple distinct ethnolinguistic groups, each with its own language, customs, and traditions. Using the term respectfully and being aware of the diversity within the Mangyan community is crucial.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Mangyans are a single tribe.","correct":"✓ The Mangyan are a collective term for several tribes.","note":"It's a common misconception to think of the Mangyan as a single tribe, but they are actually a group of distinct indigenous groups."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Mangyan' refers to the indigenous peoples of Mindoro Island in the Philippines. It is a collective term encompassing several distinct ethnolinguistic groups. When discussing these communities, it is important to recognize their diversity and avoid generalizations. The term itself is not commonly used outside of contexts related to the Philippines or anthropology. Understanding the cultural sensitivity associated with indigenous groups is essential when using this term."},"example_sentences":[{"sentence":"The traditional clothing of the **Mangyan** people is often made from woven fabrics.","translation":"マンヤン族の伝統的な衣服は、織物で作られていることが多いです。","type":"noun","meaning_category":"民族"},{"sentence":"Researchers are studying the unique writing system used in some **Mangyan** communities.","translation":"研究者たちは、一部のマンヤン族のコミュニティで使用されている独特の文字体系を研究しています。","type":"noun","meaning_category":"民族"},{"sentence":"The **Mangyan** languages are related to other Philippine languages.","translation":"マンヤン語は、他のフィリピンの言語と関連があります。","type":"noun","meaning_category":"言語"}]}