{"word":"Mammillaria","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"マミラリア属（サボテン科の属名）","english_definition":"A large genus of cacti in the family Cactaceae, characterized by tubercles instead of ribs.","examples":[{"sentence":"The Mammillaria is a popular cactus among collectors.","translation":"マミラリアは収集家の間で人気のサボテンです。"},{"sentence":"Many Mammillaria species are native to Mexico.","translation":"多くのマミラリア種はメキシコ原産です。"}],"collocations":["Mammillaria species","Mammillaria cactus","grow Mammillaria","collect Mammillaria"],"synonyms":["cactus","cacti","succulent"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'mammilla' meaning 'nipple' or 'teat', referring to the tubercles on the surface of the plant.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmæmɪˈlɛəriə/","syllables":"Mam-il-lar-i-a"},"inflection":{"noun_plural":"Mammillarias"},"usage_notes":{"explanation":"'Mammillaria' refers specifically to plants within the Mammillaria genus. These cacti are easily identifiable by their tubercles (small, rounded projections) instead of ribs, which are more common in other cactus genera. They are popular as houseplants due to their relatively small size and ease of care.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a Mammillaria cactus. They are so easy to take care of.","correct":"✓ I have a Mammillaria cactus. It is so easy to take care of.","note":"When referring to a single Mammillaria plant, use the singular pronoun 'it' rather than the plural 'they'."}],"priority":"★★☆"},"related_words":{"derivatives":["Mammillarioideae (subfamily)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Mammillaria' is a botanical term referring to a specific genus of cacti. Understanding this term requires some familiarity with plant taxonomy. The word itself is derived from Latin, and its meaning relates to the physical characteristics of the plant. While not a common word in everyday conversation, it is frequently used in botanical contexts and among cactus enthusiasts."},"example_sentences":[{"sentence":"The globular shape of the Mammillaria makes it an attractive addition to any succulent collection.","translation":"マミラリアの球状の形は、多肉植物コレクションへの魅力的な追加となります。","type":"noun","meaning_category":"サボテンの属"},{"sentence":"Proper watering is essential for the healthy growth of a Mammillaria.","translation":"適切な水やりは、マミラリアの健全な成長に不可欠です。","type":"noun","meaning_category":"サボテンの属"}]}