{"word":"reprimido","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"抑圧された、抑制された、感情を表に出さない","english_definition":"repressed; suppressed; restrained; not expressing feelings openly","examples":[{"sentence":"Era una persona reprimida y le costaba expresar sus emociones.","translation":"彼は感情を抑圧する人で、自分の感情を表現するのが難しかった。","type":"general"},{"sentence":"Vivía en una sociedad muy reprimida donde las libertades individuales eran limitadas.","translation":"彼は個人の自由が制限された非常に抑圧された社会に住んでいた。","type":"societal"},{"sentence":"Sus sentimientos reprimidos terminaron manifestándose en forma de ansiedad.","translation":"彼の抑圧された感情は、最終的に不安の形で現れた。","type":"psychological"}],"collocations":["sentimientos reprimidos (抑圧された感情)","sociedad reprimida (抑圧された社会)","deseos reprimidos (抑圧された欲望)","persona reprimida (抑圧された人)"],"synonyms":["inhibido","contenido","sofocado","censurado","cohibido"],"antonyms":["expresivo","desinhibido","abierto","libre"],"notes":"This word often carries a negative connotation, suggesting that the suppression is unhealthy or forced."}],"etymology":{"value":"From the past participle of the Spanish verb 'reprimir', which comes from the Latin 'reprimere' (to press back, check, restrain).","priority":"N/A"},"pronunciation":{"ipa":"re.pɾiˈmi.ðo","syllables":"re-pri-mi-do"},"inflection":{"gender":"masculine","number":"singular"},"usage_notes":{"explanation":"'Reprimido' is used to describe someone or something that is kept under control or prevented from being expressed. It can refer to emotions, desires, or even societal freedoms. The nuance is that the suppression is often considered undesirable or harmful.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Él está muy reprimido porque es tímido.","correct":"Él está muy inhibido porque es tímido.","note":"'Reprimido' implies a deeper, often unconscious suppression, whereas 'inhibido' simply means shy or reserved. 'Reprimido' often has a negative connotation, suggesting a psychological issue."}],"priority":"N/A"},"related_words":{"derivatives":["reprimir (verb: to repress, suppress)","represión (noun: repression, suppression)"],"related_languages":[{"language":"English","word":"repressed"}],"priority":"N/A"},"level_frequency":{"level":"B2","frequency_corpus":"Appears in advanced texts and discussions about psychology, sociology, and personal development.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The word 'reprimido' describes something or someone that is kept under control or not allowed to be expressed freely. It often refers to emotions or desires that are suppressed, sometimes unconsciously. This word is common in discussions about psychology, sociology, and personal development, where the effects of repression are often explored."},"example_sentences":[{"sentence":"La dictadura mantuvo al pueblo reprimido durante muchos años.","translation":"The dictatorship kept the people repressed for many years.","type":"political","meaning_category":"suppressed"},{"sentence":"Sus recuerdos reprimidos comenzaron a emerger durante la terapia.","translation":"His repressed memories began to emerge during therapy.","type":"psychological","meaning_category":"repressed"},{"sentence":"En esa época, la sociedad era muy reprimida en cuanto a la sexualidad.","translation":"At that time, society was very repressed when it came to sexuality.","type":"societal","meaning_category":"restrained"}]}