{"word":"Sophists","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ギリシアの)ソフィストたち","english_definition":"A group of itinerant Greek teachers in the 5th century BC who taught rhetoric, philosophy, and other subjects for a fee. They were often criticized for their relativistic views and their willingness to argue any side of an issue.","examples":[{"sentence":"The Sophists were known for their persuasive arguments.","translation":"ソフィストたちは説得力のある議論で知られていた。"},{"sentence":"Some philosophers criticized the Sophists for prioritizing rhetoric over truth.","translation":"一部の哲学者は、ソフィストたちが真実よりも弁論術を優先していると批判した。"},{"sentence":"The teachings of the Sophists had a significant impact on Athenian society.","translation":"ソフィストたちの教えは、アテナイ社会に大きな影響を与えた。"}],"collocations":["ancient Greek Sophists (古代ギリシアのソフィストたち)","teachings of the Sophists (ソフィストたちの教え)","criticism of the Sophists (ソフィストたちへの批判)","arguments of the Sophists (ソフィストたちの議論)"],"synonyms":["rhetoricians","teachers of rhetoric","intellectuals","philosophers (sometimes used critically)"],"antonyms":["philosophers (in the traditional sense)","seekers of truth"],"notes":"'Sophists' is the plural form of 'Sophist'. It refers to a group or school of thought, not a single individual."}],"etymology":{"value":"From the Greek word 'sophistēs' (σοφιστής), meaning 'wise man' or 'expert'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɒfɪsts/","syllables":"Soph-ists"},"inflection":{"noun_plural":"Sophists (already plural)"},"usage_notes":{"explanation":"'Sophists' refers specifically to a group of teachers and intellectuals in ancient Greece. They are often contrasted with philosophers like Socrates and Plato, who emphasized the pursuit of truth and virtue. The Sophists were more concerned with practical skills like rhetoric and persuasion, which they taught for a fee. Their views were often relativistic, meaning they believed that truth was subjective and dependent on the individual or culture. This led to criticism from those who believed in objective truth.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Sophists.","correct":"✓ He is a Sophist.","note":"'Sophists' is plural. To refer to a single person, use 'Sophist'."},{"incorrect":"✗ The Sophists believed in objective truth.","correct":"✓ The Sophists were often criticized for their relativistic views on truth.","note":"The Sophists were generally known for their relativistic views, not for believing in objective truth."}],"priority":"★★☆"},"related_words":{"derivatives":["Sophist (singular noun)","sophistry (noun: the use of fallacious arguments)","sophistic (adjective: using clever but false arguments)","sophistication (noun: refinement, complexity)"],"related_concepts":["rhetoric","relativism","moral relativism","Socratic method","Platonism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in academic or philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Sophists' refers to a specific group of teachers in ancient Greece who were known for their skills in rhetoric and argumentation. They are often studied in philosophy and history courses. Understanding the term requires knowledge of ancient Greek history and philosophy. The word is not commonly used in everyday conversation, but it is important for understanding certain historical and philosophical contexts."},"example_sentences":[{"sentence":"The **Sophists** challenged traditional views of morality and justice.","translation":"ソフィストたちは、道徳と正義に関する伝統的な見方に異議を唱えた。","type":"noun","meaning_category":"ソフィストたち (グループ)"},{"sentence":"Plato's dialogues often feature debates with the **Sophists**.","translation":"プラトンの対話篇には、ソフィストたちとの討論がよく登場する。","type":"noun","meaning_category":"ソフィストたち (グループ)"},{"sentence":"The **Sophists** were skilled at using language to persuade their audiences.","translation":"ソフィストたちは、聴衆を説得するために言葉を巧みに使うことに長けていた。","type":"noun","meaning_category":"ソフィストたち (グループ)"}]}