{"word":"hyperrealism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"超現実主義：絵画や彫刻において、写真のように精密な描写を追求する芸術運動。","english_definition":"A genre of painting and sculpture resembling a high-resolution photograph.","examples":[{"sentence":"Hyperrealism is characterized by its meticulous detail and illusionistic effects.","translation":"超現実主義は、その綿密なディテールとイリュージョニスティックな効果によって特徴づけられる。"},{"sentence":"The artist's hyperrealist paintings often depict everyday objects with astonishing clarity.","translation":"そのアーティストの超現実主義絵画は、日常的な物体を驚くほどの明瞭さで描写することが多い。"}],"collocations":["hyperrealist painting","hyperrealist sculpture","photorealistic","illusionistic","meticulous detail"],"synonyms":["photorealism","super-realism","verism"],"antonyms":["abstract art","surrealism","impressionism"]}],"etymology":{"value":"\"Hyper-\"（超越、過剰）と \"realism\"（現実主義）の組み合わせ。現実を越えた、または現実以上にリアルな表現を意味する。","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpərˈriːəlɪzəm/","syllables":"hy-per-re-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hyperrealism is an advanced form of photorealism. While photorealism aimed to reproduce photographs as accurately as possible, hyperrealism goes further, often enhancing details and creating an even more convincing illusion of reality. Hyperrealist works often have a higher resolution and more focus than actual photographs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a hyperrealism artist.","correct":"✓ He is a hyperrealist artist.","note":"Use 'hyperrealist' as an adjective to describe the artist."},{"incorrect":"✗ Hyperrealism is very abstract.","correct":"✓ Hyperrealism is very realistic.","note":"Hyperrealism aims for extreme realism, the opposite of abstract art."}],"priority":"★★☆"},"related_words":{"derivatives":["hyperrealist (adjective, noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Hyperrealism is a term used to describe art, especially painting and sculpture, that looks extremely realistic, almost like a photograph. These artworks often have very fine details and make the viewer feel like they are looking at the real thing. It's a style that goes beyond simply copying reality, aiming to create an even more convincing illusion."},"example_sentences":[{"sentence":"His hyperrealism sculpture of a human figure was incredibly lifelike.","translation":"彼の超現実主義の人物彫刻は信じられないほど生き生きとしていた。","type":"noun","meaning_category":"超現実主義の彫刻"},{"sentence":"The hyperrealist painting captured every wrinkle and pore on the subject's face.","translation":"その超現実主義の絵画は、被写体の顔のすべてのしわと毛穴を捉えていた。","type":"noun","meaning_category":"超現実主義の絵画"},{"sentence":"Many people are amazed by the level of detail in hyperrealism art.","translation":"多くの人々が、超現実主義アートの細部のレベルに驚いている。","type":"noun","meaning_category":"超現実主義アート"}]}