{"word":"hypercarotenemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"高カロテン血症","english_definition":"A condition characterized by high levels of carotenoids in the blood, resulting in yellowing of the skin, especially the palms and soles.","examples":[{"sentence":"Hypercarotenemia is often caused by excessive consumption of carrots or other carotenoid-rich foods.","translation":"高カロテン血症は、しばしばニンジンや他のカロテノイドを豊富に含む食品の過剰摂取によって引き起こされる。"},{"sentence":"The patient presented with yellow skin discoloration, leading to a diagnosis of hypercarotenemia.","translation":"患者は皮膚の黄変を呈し、高カロテン血症と診断された。"}],"collocations":["caused by hypercarotenemia","diagnosed with hypercarotenemia","treatment for hypercarotenemia","hypercarotenemia symptoms","dietary hypercarotenemia"],"synonyms":["carotenemia"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek prefix 'hyper-' (excessive), 'carotene' (a type of pigment), and '-emia' (condition of the blood).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˌkærətiːˈniːmiə/","syllables":"hy-per-car-o-te-ne-mi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hypercarotenemia is a benign condition, meaning it is not harmful. It is different from jaundice, which also causes yellowing of the skin but is associated with liver problems and elevated bilirubin levels. Hypercarotenemia is primarily a cosmetic concern.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Hypercarotenemia is a symptom of liver failure.","correct":"Jaundice is a symptom of liver failure; hypercarotenemia is usually harmless.","note":"Hypercarotenemia is generally harmless and distinct from jaundice, which can indicate liver issues."}],"priority":"★★☆"},"related_words":{"derivatives":["carotenoid","carotene"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hypercarotenemia' is a medical term describing elevated levels of carotenoids in the blood, leading to skin yellowing. It's typically benign and caused by excessive intake of carotenoid-rich foods, unlike jaundice which signals liver dysfunction. This term is primarily used in medical or nutritional contexts.","note":"This explanation is intended for individuals with advanced English proficiency due to the specialized nature of the term."},"example_sentences":[{"sentence":"The infant developed hypercarotenemia due to a diet consisting almost exclusively of pureed carrots.","translation":"その乳児は、ほぼニンジンピューレのみで構成された食事のために高カロテン血症を発症した。","type":"medical","meaning_category":"cause"},{"sentence":"Diagnosis of hypercarotenemia is typically made based on clinical examination and dietary history.","translation":"高カロテン血症の診断は、通常、臨床検査と食事歴に基づいて行われる。","type":"medical","meaning_category":"diagnosis"}]}