{"word":"scabies","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"疥癬（かいせん）","english_definition":"a contagious skin disease marked by itching and small raised spots, caused by the itch mite.","examples":[{"sentence":"He was diagnosed with scabies.","translation":"彼は疥癬と診断された。"},{"sentence":"Scabies is often spread through close physical contact.","translation":"疥癬はしばしば濃厚な身体接触によって広がる。"},{"sentence":"The itching associated with scabies can be intense.","translation":"疥癬に伴う痒みは激しいことがある。"}],"collocations":["contract scabies (疥癬に感染する)","treat scabies (疥癬を治療する)","scabies infestation (疥癬の蔓延)"],"synonyms":["itch","seven-year itch"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from Latin, from scabere ‘to scratch’.","priority":"★★☆"},"pronunciation":{"ipa":"ˈskeɪbiːz/","syllables":"sca-bies"},"inflection":{"noun_plural":"(usually treated as singular)"},"usage_notes":{"explanation":"Scabies is a skin condition caused by tiny mites that burrow into the skin. It is highly contagious and causes intense itching, especially at night. Treatment usually involves prescription creams or lotions to kill the mites.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a scabie.","correct":"✓ I have scabies.","note":"Scabies is a noncount noun, so it doesn't take an 'a' or become plural."},{"incorrect":"✗ Scabies are caused by bacteria.","correct":"✓ Scabies is caused by mites.","note":"Scabies is caused by mites, not bacteria."}],"priority":"★★☆"},"related_words":{"derivatives":["scabietic (adjective: 疥癬の、名詞: 疥癬患者)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Scabies is a contagious skin disease caused by tiny mites that burrow into the skin. It is characterized by intense itching, particularly at night, and the appearance of small, raised spots or blisters. Transmission typically occurs through prolonged, direct skin-to-skin contact with an infected individual. Diagnosis usually involves a physical examination and microscopic identification of the mites or their eggs. Treatment typically consists of prescription-strength topical medications designed to kill the mites and relieve symptoms. Due to its contagious nature, close contacts of infected individuals are often advised to undergo treatment as well, even if they are asymptomatic.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor confirmed that the rash was caused by **scabies**.","translation":"医師は発疹の原因が疥癬であることを確認した。","type":"noun","meaning_category":"disease"},{"sentence":"He was prescribed a cream to treat the **scabies**.","translation":"彼は疥癬を治療するためのクリームを処方された。","type":"noun","meaning_category":"treatment"},{"sentence":"Good hygiene practices can help prevent the spread of **scabies**.","translation":"良好な衛生習慣は疥癬の蔓延を防ぐのに役立つ。","type":"noun","meaning_category":"prevention"}]}