{"word":"planity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of being planar; flatness.","english_definition":"The state or quality of being planar; flatness.","examples":[{"sentence":"The planity of the surface is crucial for accurate measurements.","translation":"正確な測定のためには、表面の平坦度が重要である。"},{"sentence":"We checked the planity of the metal sheet before using it in the machine.","translation":"機械で使用する前に、金属板の平坦度を確認しました。"}],"collocations":["surface planity","check planity","measure planity"],"synonyms":["flatness","levelness","evenness"],"antonyms":["unevenness","roughness","irregularity"]}],"etymology":{"value":"Derived from 'planar' (relating to a plane) with the suffix '-ity' (denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpleɪnɪti/","syllables":"pla-ni-ty"},"inflection":{"noun_plural":"planities"},"usage_notes":{"explanation":"\"Planity\" refers to how closely a surface approximates a perfect plane. It's often used in technical contexts, such as manufacturing, engineering, and physics, where precise flatness is important. It is less commonly used than \"flatness\" but provides a more technical and specific term.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The planarity of the table was perfect.","correct":"✓ The planity of the table was perfect.","note":"Use 'planity' to refer to the state or quality of being planar, not 'planarity'."}],"priority":"★★☆"},"related_words":{"derivatives":["planar","plane"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Planity\" is a technical term that describes how flat a surface is. It is used in fields like engineering and manufacturing where precise flatness is important. If something has high planity, it means it is very flat. This word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The grinding process improves the planity of the silicon wafer.","translation":"研磨工程は、シリコンウェハーの平坦度を向上させる。","type":"noun","meaning_category":"flatness"},{"sentence":"High planity is essential for the proper functioning of the optical instrument.","translation":"高い平坦度は、光学機器の適切な機能に不可欠である。","type":"noun","meaning_category":"flatness"}]}