{"word":"ichorrhemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"血液腐敗症、腐敗血液症","english_definition":"A condition in which putrid or toxic substances are present in the blood.","examples":[{"sentence":"The patient was diagnosed with ichorrhemia after showing signs of severe infection.","translation":"患者は重度の感染の兆候を示した後、血液腐敗症と診断された。"},{"sentence":"Ichorrhemia is a serious condition requiring immediate medical intervention.","translation":"血液腐敗症は直ちに医学的介入を必要とする重篤な状態である。"}],"collocations":["diagnosed with ichorrhemia","signs of ichorrhemia","treatment for ichorrhemia"],"synonyms":["septicemia","blood poisoning","pyemia"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'ichor' (the ethereal fluid that served as blood for the gods) and 'hemia' (a condition of the blood).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪkɒˈriːmiə/","syllables":"i-chor-rhe-mi-a"},"inflection":{"noun_plural":"ichorrhemias"},"usage_notes":{"explanation":"Ichorrhemia is a rarely used term in modern medicine. Septicemia, blood poisoning, or pyemia are more common and accurate terms for describing the presence of toxic substances in the blood.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor prescribed antibiotics for ichorrhemic.","correct":"✓ The doctor prescribed antibiotics for ichorrhemia.","note":"Ichorrhemia is a noun, not an adjective. Use it to refer to the condition itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["ichorous (adjective: resembling ichor)"],"phrases":[]},"level_frequency":{"frequency_google_ngram":"Extremely low frequency - rarely used in modern contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ichorrhemia' is a highly specialized and rarely used medical term. It refers to a condition where putrid or toxic substances are present in the blood. Due to its infrequent usage, it is primarily encountered in historical medical texts rather than contemporary practice. More common terms like septicemia or blood poisoning are preferred in modern medical contexts."},"example_sentences":[{"sentence":"The old medical textbook described the symptoms of ichorrhemia in detail.","translation":"その古い医学書は血液腐敗症の症状を詳細に記述していた。","type":"general","meaning_category":"definition"},{"sentence":"Early treatments for what was then called ichorrhemia were often ineffective.","translation":"当時血液腐敗症と呼ばれていたものの初期の治療法は、しばしば効果がなかった。","type":"historical","meaning_category":"historical context"}]}