{"word":"arrentation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) The licensing of land in a forest area for cultivation or enclosure, subject to the payment of a fixed rent.","english_definition":"The licensing of land in a forest area for cultivation or enclosure, subject to the payment of a fixed rent.","examples":[{"sentence":"The arrentation of forest lands was a common practice in medieval England.","translation":"森林地帯の土地の賃貸は、中世イングランドでは一般的な慣習でした。"},{"sentence":"The records show several instances of arrentation in the royal forest during the 13th century.","translation":"記録によると、13世紀の王室の森でいくつかの賃貸の事例が示されています。"}],"collocations":["royal arrentation","forest arrentation","grant of arrentation","license of arrentation"],"synonyms":["licensing","leasing","enclosure","cultivation license"],"antonyms":[]}],"etymology":{"value":"From Anglo-Norman *arrent*, from Old French *arener* (“to lease”), from Latin *ad- + reddere* (“to render, give back”).","priority":"★★☆"},"pronunciation":{"ipa":"/əˌrɛnˈteɪʃən/","syllables":"ar-ren-ta-tion"},"inflection":{"noun_plural":"arrentations"},"usage_notes":{"explanation":"\"Arrentation\" is a historical term primarily used in the context of medieval English forest law. It refers to the practice of granting licenses to individuals to cultivate or enclose land within a royal forest, in exchange for a fixed rent. This practice was a way for the crown to generate revenue from forest lands while also allowing for some degree of agricultural use.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The arrentation was used for building houses.","correct":"✓ The arrentation was used for cultivation and enclosure of land.","note":"Arrentation specifically refers to licensing land for cultivation or enclosure, not general construction."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["forest law","enclosure","rent","license","royal forest"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - A historical term, not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Arrentation\" is a highly specialized historical term. It's unlikely to be encountered outside of academic texts dealing with medieval English history, forest law, or land tenure. Understanding requires familiarity with legal and economic practices of the period."},"example_sentences":[{"sentence":"The increase in arrentation during the reign of Henry III reflects the growing pressure on royal forests.","translation":"ヘンリー3世の治世中の賃貸の増加は、王室の森への圧力の高まりを反映しています。","type":"noun","meaning_category":"licensing of land"},{"sentence":"The terms of the arrentation specified the amount of land that could be enclosed and the rent due to the crown.","translation":"賃貸の条件は、囲い込むことができる土地の量と王室に支払われるべき賃料を指定していました。","type":"noun","meaning_category":"licensing of land"}]}