{"word":"photogenic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"写真写りの良い、写真向きの","english_definition":"looking attractive in photographs or on film.","examples":[{"sentence":"She's very photogenic.","translation":"彼女はとても写真写りが良い。"},{"sentence":"The city is incredibly photogenic, especially at sunset.","translation":"その都市は信じられないほど写真写りが良く、特に夕暮れ時はそうだ。"},{"sentence":"He's not very photogenic, but he's a great person.","translation":"彼はあまり写真写りが良くないが、素晴らしい人だ。"}],"collocations":["extremely photogenic (非常に写真写りが良い)","naturally photogenic (生まれつき写真写りが良い)","a photogenic face (写真写りの良い顔)","a photogenic location (写真写りの良い場所)","photogenic scenery (写真写りの良い景色)"],"synonyms":["picturesque","attractive","beautiful","good-looking","camera-ready"],"antonyms":["unphotogenic"],"notes":"Often used to describe people, but can also be used for places or things."}],"etymology":{"value":"From 'photo-' (referring to light or photography) + '-genic' (producing or generating).","priority":"★★★"},"pronunciation":{"ipa":"/ˌfoʊtəˈdʒɛnɪk/","syllables":"pho-to-gen-ic"},"inflection":{"adjective_forms":{"comparative":"more photogenic","superlative":"most photogenic"}},"usage_notes":{"explanation":"'Photogenic' is used to describe someone or something that looks good in photographs. It implies that the subject's features or qualities translate well into a visual medium. It doesn't necessarily mean that the person or thing is conventionally beautiful or attractive in real life, but rather that they possess qualities that make them appear appealing in photographs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very photogenic in the real life.","correct":"✓ He is very photogenic in photographs.","note":"'Photogenic' specifically refers to how someone looks in photos, not in real life. You can say someone is attractive or handsome in real life, but 'photogenic' is reserved for their appearance in pictures."},{"incorrect":"✗ The food was photogenic. I ate it.","correct":"✓ The food was photogenic. I took a picture of it.","note":"While food can be photogenic, the typical action is to take a photo of it, not necessarily eat it. The sentence implies that the photogenic quality of the food led to the action of eating it, which is not a common association."}],"priority":"★★☆"},"related_words":{"derivatives":["photogenicity (noun: the quality of being photogenic)"],"related_terms":["photography (noun: the art or practice of taking and processing photographs)","photo (noun: a photograph)","genic (suffix: producing or generating)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but understood.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Photogenic' means that someone or something looks good in photos. It's a word you might use to describe a person who always looks great in pictures, or a place that is very beautiful to photograph. It's not a super common word, but it's easily understood if you know the words 'photo' and 'genic' (meaning producing or generating)."},"example_sentences":[{"sentence":"She's a professional model because she's so photogenic.","translation":"彼女はとても写真写りが良いので、プロのモデルだ。","type":"adjective","meaning_category":"写真写りの良い"},{"sentence":"The mountain range is incredibly photogenic, attracting photographers from all over the world.","translation":"その山脈は信じられないほど写真写りが良く、世界中から写真家が集まってくる。","type":"adjective","meaning_category":"写真写りの良い"},{"sentence":"Even though he's not conventionally handsome, he's surprisingly photogenic.","translation":"彼は慣習的なハンサムではないけれど、驚くほど写真写りが良い。","type":"adjective","meaning_category":"写真写りの良い"}]}