{"word":"free-moving","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"自由に動ける、動きやすい、可動式の","english_definition":"able to move easily and without restriction; not fixed in place; mobile.","examples":[{"sentence":"The swivel chair is free-moving, allowing you to turn in any direction.","translation":"その回転椅子は自由に動くので、どの方向にも回ることができます。"},{"sentence":"The robot has free-moving joints, which enable it to perform complex tasks.","translation":"そのロボットは自由に動く関節を持っており、複雑な作業を実行することができます。"},{"sentence":"The free-moving particles in the gas collide with each other.","translation":"気体中の自由に動く粒子は互いに衝突します。"}],"collocations":["free-moving parts (自由に動く部品)","free-moving joints (自由に動く関節)","free-moving vehicle (自由に動く乗り物)","free-moving population (自由に移動する人口)"],"synonyms":["mobile","movable","flexible","unrestricted","unfixed","independent"],"antonyms":["fixed","stationary","immobile","restricted"]}],"etymology":{"value":"Combination of 'free' (unrestricted, not confined) and 'moving' (in motion).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfriːˈmuːvɪŋ/","syllables":"free-mov-ing"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparative and superlative forms (which are less common for compound adjectives like this)."},"usage_notes":{"explanation":"'Free-moving' describes something that is not held in place or constrained, and can therefore move easily. It is often used in technical contexts to describe mechanical parts, but can also be applied to other situations where freedom of movement is important.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The car is very free-moving on the road.","correct":"✓ The car has good handling and is easy to maneuver on the road.","note":"While technically correct, 'free-moving' is less common to describe a car's handling. More common terms are 'easy to maneuver', 'responsive', or 'good handling'."},{"incorrect":"✗ The bird is free-moving in the cage.","correct":"✓ The bird is flying freely in the cage.","note":"'Free-moving' implies the *ability* to move freely, not necessarily the act of moving. If the bird *is* moving, 'flying freely' is more appropriate. If the cage is large enough to allow free movement, you could say 'The bird has a free-moving space in the cage'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["mobile","flexible","unrestricted","unfixed","independent","mobility","movement","free"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but understandable in context.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'free-moving' is a compound adjective that describes something capable of moving easily and without restrictions. It is often used in technical or descriptive contexts. Understanding the individual words 'free' and 'moving' makes the meaning of the compound word clear. While not extremely common, it is readily understood by native English speakers."},"example_sentences":[{"sentence":"The conveyor belt uses free-moving rollers to transport the packages.","translation":"そのコンベヤーベルトは自由に動くローラーを使って荷物を運びます。","type":"adjective","meaning_category":"able to move easily"},{"sentence":"The artist created a free-moving sculpture that responded to the wind.","translation":"そのアーティストは風に反応する自由に動く彫刻を作りました。","type":"adjective","meaning_category":"not fixed in place"},{"sentence":"The company needs a free-moving workforce to adapt to changing market conditions.","translation":"会社は変化する市場の状況に適応するために、自由に移動できる労働力を必要としています。","type":"adjective","meaning_category":"unrestricted"}]}