{"word":"Zoopathologist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"動物病理学者","english_definition":"A veterinary pathologist; a pathologist who specializes in the diseases of animals.","examples":[{"sentence":"The zoopathologist examined the tissue samples from the deceased animal.","translation":"その動物病理学者は、死亡した動物の組織サンプルを検査した。"},{"sentence":"Zoopathologists play a crucial role in diagnosing diseases in wildlife and livestock.","translation":"動物病理学者は、野生動物や家畜の病気を診断する上で重要な役割を果たしている。"}],"collocations":["veterinary pathology","animal diseases","tissue samples","diagnose diseases"],"synonyms":["veterinary pathologist","animal pathologist"],"antonyms":[]}],"etymology":{"value":"\"Zoo-\" (動物) + \"pathologist\" (病理学者).","priority":"★★★"},"pronunciation":{"ipa":"/ˌzoʊ.oʊ.pəˈθɑlədʒɪst/","syllables":"zo-o-pa-thol-o-gist"},"inflection":{"noun_plural":"Zoopathologists"},"usage_notes":{"explanation":"A zoopathologist is a specialized type of pathologist who focuses on diagnosing diseases in animals, similar to how a pathologist in human medicine diagnoses diseases in people. They often work with veterinarians, wildlife organizations, and research institutions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The zoopathologist studied human diseases.","correct":"✓ The zoopathologist studied animal diseases.","note":"Zoopathologists specialize in animal diseases, not human diseases."}],"priority":"★☆☆"},"related_words":{"derivatives":["zoopathology (動物病理学)","pathology (病理学)","veterinary (獣医の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"zoopathologist\" is a specialized term used in the fields of veterinary medicine and pathology. It refers to a pathologist who specializes in diagnosing diseases in animals. Understanding this term requires knowledge of both \"zoo-\" (related to animals) and \"pathologist\" (a specialist in the study of diseases). It is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The university hired a new zoopathologist to enhance their research on animal diseases.","translation":"その大学は、動物病の研究を強化するために、新しい動物病理学者を雇用した。","type":"general","meaning_category":"general"},{"sentence":"As a zoopathologist, her expertise was crucial in identifying the cause of the outbreak among the local bird population.","translation":"動物病理学者として、彼女の専門知識は、地元の鳥の個体群における発生の原因を特定する上で非常に重要だった。","type":"professional","meaning_category":"professional"}]}