{"word":"UV-permeable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"紫外線透過性の、紫外線を透過する","english_definition":"allowing ultraviolet (UV) light to pass through.","examples":[{"sentence":"The material is UV-permeable, allowing sunlight to reach the plants.","translation":"その素材は紫外線透過性で、日光が植物に届くようにします。"},{"sentence":"We need a UV-permeable film for this experiment.","translation":"この実験には紫外線透過性のフィルムが必要です。"},{"sentence":"The window is made of UV-permeable glass.","translation":"その窓は紫外線透過性のガラスでできています。"}],"collocations":["UV-permeable material (紫外線透過性素材)","UV-permeable film (紫外線透過性フィルム)","UV-permeable glass (紫外線透過性ガラス)","highly UV-permeable (高紫外線透過性)"],"synonyms":["UV-transparent","UV-transmitting","transparent to UV light"],"antonyms":["UV-resistant","UV-blocking","UV-opaque"]},{"part_of_speech":"adjective","definition":"（比喩的に）紫外線が通過するように、何かが容易に浸透する、影響を受けやすい","english_definition":"(figuratively) allowing something to easily penetrate or be influenced, as if UV light were passing through.","examples":[{"sentence":"The company's security system was UV-permeable to hackers.","translation":"その会社のセキュリティシステムは、ハッカーに対して紫外線が通過するように脆弱だった。"},{"sentence":"The politician's arguments were UV-permeable to criticism.","translation":"その政治家の主張は、批判に対して紫外線が通過するように弱かった。"}],"collocations":[],"synonyms":["vulnerable","susceptible","penetrable"],"antonyms":["resistant","impermeable"]}],"etymology":{"value":"'UV' (ultraviolet) + 'permeable' (allowing liquids or gases to pass through).","priority":"★★☆"},"pronunciation":{"ipa":"ˌjuːˈviː ˈpɜːrmiəbəl/","syllables":"U-V-per-me-a-ble"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'UV-permeable' describes materials that allow ultraviolet light to pass through them. It is commonly used in scientific, agricultural, and industrial contexts. The figurative sense is less common but can be used to describe something that is easily penetrated or influenced.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The UV-permeable is good for plant growth.","correct":"✓ The UV-permeable material is good for plant growth.","note":"'UV-permeable' is an adjective and needs to be followed by a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["permeability (名詞: 透過性)","permeate (動詞: 浸透する)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'UV-permeable' is a technical term, primarily used in scientific or technical contexts. It describes a material's property of allowing ultraviolet light to pass through it. Understanding this term requires familiarity with basic scientific concepts. The figurative use is even less common and requires a good grasp of metaphorical language.","priority":"★★☆"},"example_sentences":[{"sentence":"The greenhouse uses UV-permeable plastic to maximize sunlight exposure for the plants.","translation":"その温室では、植物への日光照射を最大化するために紫外線透過性プラスチックを使用しています。","type":"adjective","meaning_category":"紫外線透過性"},{"sentence":"The sunscreen is not UV-permeable, providing excellent protection against harmful rays.","translation":"その日焼け止めは紫外線透過性ではなく、有害な光線に対する優れた保護を提供します。","type":"adjective","meaning_category":"紫外線透過性"},{"sentence":"The researcher tested the UV-permeable properties of various polymers.","translation":"研究者は、様々なポリマーの紫外線透過特性をテストしました。","type":"adjective","meaning_category":"紫外線透過性"}]}