{"word":"redlined","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"(過去形・過去分詞) (特定の地域に住む人々に対して)差別的な融資拒否をする、レッドライニングする","english_definition":"(past tense and past participle) to refuse a loan or other services to someone because they live in an area deemed to be a poor financial risk.","examples":[{"sentence":"The bank was accused of redlining minority neighborhoods.","translation":"その銀行は、マイノリティが多く住む地域に対して差別的な融資拒否を行っていると非難された。"},{"sentence":"Historically, certain areas were redlined, preventing residents from accessing mortgages.","translation":"歴史的に、特定の地域はレッドライニングされ、住民が住宅ローンを利用することを妨げられていた。"}],"collocations":["redline an area (ある地域をレッドライニングする)","redline a neighborhood (ある地域をレッドライニングする)","redline against a community (あるコミュニティに対してレッドライニングする)"],"synonyms":["discriminate against","blacklist","exclude"],"antonyms":["invest in","support","include"]},{"part_of_speech":"verb","definition":"(過去形・過去分詞) (文書などを)修正・編集するために赤線でマークする、レッドラインを入れる","english_definition":"(past tense and past participle) to mark (a document, etc.) with red lines to indicate changes or areas needing attention.","examples":[{"sentence":"The lawyer redlined the contract before sending it back to the client.","translation":"弁護士は契約書を修正するために赤線を引き、クライアントに返送した。"},{"sentence":"The editor redlined the manuscript, highlighting areas for improvement.","translation":"編集者は原稿に赤線を引き、改善すべき箇所を強調した。"}],"collocations":["redline a document (文書に赤線を入れる)","redline a contract (契約書に赤線を入れる)","redline a manuscript (原稿に赤線を入れる)"],"synonyms":["mark up","edit","revise","annotate"],"antonyms":["approve","accept"]}],"etymology":{"value":"「redline」という言葉は、1960年代にアメリカ合衆国で、銀行や保険会社が地図上で特定の地域（主にマイノリティが多く住む地域）を赤い線で囲み、その地域への融資や保険の提供を拒否したことに由来する。この行為は、住宅差別を助長し、地域社会の経済的発展を妨げた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛdˌlaɪnd/","syllables":"red-lined"},"inflection":{"notes":"これは動詞redlineの過去形・過去分詞です。"},"usage_notes":{"explanation":"「**redlined**」は、主に2つの意味で使用されます。\n\n1.  **差別的な融資拒否:** 特定の地域、特にマイノリティが多く住む地域に対して、銀行や金融機関が融資やサービスを意図的に拒否する行為を指します。これは、住宅差別や地域社会の経済的衰退につながる深刻な問題です。この意味での使用は、しばしば社会問題や経済格差に関する議論で見られます。\n\n2.  **文書の修正:** 文書、契約書、原稿などを編集または修正するために、変更箇所や注意すべき箇所を赤線でマークすること。これは、法律、出版、編集などの分野で一般的な慣行です。赤線は、変更の提案や議論の対象となる箇所を明確に示すために使用されます。\n\n文脈によってどちらの意味で使用されているかを判断する必要があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company redlined the product because it was popular.","correct":"✓ The company discontinued the product because it was not profitable.","note":"「redline」は、製品が人気があるからという理由で使用停止にすることを意味しません。差別的な融資拒否または文書の修正に使用されます。"},{"incorrect":"✗ The teacher redlined the student for cheating.","correct":"✓ The teacher disciplined the student for cheating.","note":"「redline」は、不正行為をした生徒を罰することを意味しません。差別的な融資拒否または文書の修正に使用されます。"}],"priority":"★★☆"},"related_words":{"derivatives":["redlining (名詞: レッドライニング、差別的な融資拒否)"],"phrases":["reverse redlining (高金利のローンを不当に提供すること)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (専門的な文脈で使われる)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 特定の分野や文脈で使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**redlined**」は、主に2つの意味を持つ単語です。1つは、銀行などが特定の地域（特にマイノリティが多く住む地域）に対して、差別的に融資を拒否する行為を指します。これは、過去の差別的な慣行に由来する言葉で、社会問題や経済格差の文脈で使われます。もう1つは、文書を修正・編集する際に、変更箇所や注意すべき点を赤線でマークすることを指します。こちらは、法律や出版などの専門分野で使われることが多いです。どちらの意味で使われているかは、文脈によって判断する必要があります。"},"example_sentences":[{"sentence":"The city council is working to combat the effects of historical **redlining**.","translation":"市議会は、過去のレッドライニングの影響に対抗するために取り組んでいる。","type":"verb (past participle)","meaning_category":"差別的な融資拒否"},{"sentence":"The legal team **redlined** the agreement to protect their client's interests.","translation":"弁護士チームは、クライアントの利益を守るために契約書に赤線を入れた。","type":"verb (past participle)","meaning_category":"文書の修正"}]}