{"word":"contextuality","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"文脈性、文脈依存性","english_definition":"The quality or state of being contextual; dependence on context.","examples":[{"sentence":"The contextuality of language makes direct translation difficult.","translation":"言語の文脈性により、直接的な翻訳は困難になる。"},{"sentence":"Understanding the contextuality of historical events is crucial for accurate interpretation.","translation":"歴史的出来事の文脈性を理解することは、正確な解釈にとって重要である。"}],"collocations":["linguistic contextuality (言語的文脈性)","cultural contextuality (文化的文脈性)","historical contextuality (歴史的文脈性)","social contextuality (社会的文脈性)"],"synonyms":["context-dependence","situationality","relativity"],"antonyms":["universality","absoluteness","context-independence"]},{"part_of_speech":"noun","definition":"(量子力学における)文脈性","english_definition":"(In quantum mechanics) the property that the result of a measurement on a quantum system can depend on which other measurements are performed at the same time.","examples":[{"sentence":"Bell's theorem demonstrates the contextuality of quantum mechanics.","translation":"ベルの定理は量子力学の文脈性を示す。"},{"sentence":"Quantum contextuality challenges classical notions of realism.","translation":"量子文脈性は、リアリズムの古典的な概念に挑戦する。"}],"collocations":["quantum contextuality (量子文脈性)","contextuality violation (文脈性違反)","non-contextuality (非文脈性)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'contextual' + '-ity'. 'Contextual' is derived from 'context', which comes from Latin 'con-' (with) + 'texere' (to weave). Thus, contextuality refers to the quality of being woven together with surrounding information.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒntekstʃuˈæləti/","syllables":"con-tex-tu-al-i-ty"},"inflection":{"notes":"This is a noun, so it has no plural form in the typical sense, although it can be used in plural contexts."},"usage_notes":{"explanation":"'Contextuality' refers to the degree to which something's meaning or interpretation depends on its surrounding context. It is used broadly across various fields, including linguistics, history, and quantum mechanics. In linguistics and social sciences, it highlights that meaning is not inherent but constructed through interaction with surrounding information. In quantum mechanics, it has a specific technical meaning related to measurement outcomes depending on the measurement context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The contextuality is very important to understand the situation.","correct":"✓ Context is very important to understand the situation.","note":"In many cases, using 'context' directly is clearer and more natural than using 'contextuality', especially in general contexts. 'Contextuality' is more appropriate when discussing the *degree* to which something is context-dependent."}],"priority":"★★☆"},"related_words":{"derivatives":["contextual (adjective)","contextualize (verb)","context (noun)"],"phrases":["out of context (文脈から外れて)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency. Primarily used in academic or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Contextuality' is a relatively advanced term that describes how much the meaning or interpretation of something relies on its surrounding context. It's often used in academic discussions, particularly in fields like linguistics, history, and quantum physics. The term emphasizes that understanding something fully requires considering the circumstances and background information related to it. In simpler terms, it's about how things make sense because of what's around them."},"example_sentences":[{"sentence":"The **contextuality** of the artwork's message made it difficult for some viewers to grasp its meaning without background knowledge.","translation":"そのアート作品のメッセージの文脈性により、背景知識なしでは一部の観客がその意味を把握することが困難になった。","type":"general","meaning_category":"general"},{"sentence":"Researchers are exploring the implications of **contextuality** in quantum computing.","translation":"研究者たちは、量子コンピューティングにおける文脈性の意味合いを探求している。","type":"quantum mechanics","meaning_category":"quantum mechanics"}]}