{"word":"ligand-insensitive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"リガンド非感受性の、リガンドに反応しない","english_definition":"Not responsive or sensitive to a ligand. Describes a molecule or system that does not change its behavior or properties upon binding to a ligand.","examples":[{"sentence":"The mutant receptor was ligand-insensitive and did not activate downstream signaling pathways.","translation":"その変異型受容体はリガンド非感受性であり、下流のシグナル伝達経路を活性化しなかった。"},{"sentence":"Ligand-insensitive ion channels remain closed even in the presence of their cognate ligand.","translation":"リガンド非感受性イオンチャネルは、対応するリガンドが存在しても閉じたままである。"}],"collocations":["ligand-insensitive receptor (リガンド非感受性受容体)","ligand-insensitive mutant (リガンド非感受性変異体)","ligand-insensitive channel (リガンド非感受性チャネル)"],"synonyms":["ligand-unresponsive","ligand-resistant"],"antonyms":["ligand-sensitive","ligand-responsive"]}],"etymology":{"value":"Formed by combining 'ligand' (a molecule that binds to another molecule), 'in-' (a prefix indicating negation), and 'sensitive' (responsive to stimuli).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈlaɪɡənd ɪnˈsɛnsətɪv/","syllables":"li-gand in-sen-si-tive"},"inflection":{"notes":"Does not inflect (only used as an adjective)."},"usage_notes":{"explanation":"'Ligand-insensitive' is a term used primarily in biochemistry, molecular biology, and pharmacology to describe molecules, typically receptors or enzymes, that do not exhibit a change in activity or conformation upon binding to their specific ligand. This insensitivity can arise from mutations, structural modifications, or other factors that disrupt the normal ligand-binding mechanism or downstream signaling pathways.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell was ligand-insensitive to the drug.","correct":"✓ The receptor was ligand-insensitive to the drug.","note":"'Ligand-insensitive' typically describes a specific molecule (e.g., receptor, enzyme) rather than an entire cell. The cell's response would be due to the receptor being ligand-insensitive."}],"priority":"☆☆☆"},"related_words":{"derivatives":["insensitivity (名詞: 非感受性)"],"related_terms":["ligand","receptor","sensitivity","binding","signal transduction"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Ligand-insensitive' is a technical term used in scientific contexts, particularly in fields like biochemistry and pharmacology. It describes a molecule that does not respond to the binding of a ligand, which is a molecule that typically triggers a response when it binds to a receptor or other target molecule. Understanding this term requires a background in these scientific disciplines."},"example_sentences":[{"sentence":"The researchers created a ligand-insensitive version of the protein to study its basal activity.","translation":"研究者らは、そのタンパク質の基礎活性を研究するために、リガンド非感受性バージョンを作成した。","type":"adjective","meaning_category":"biochemistry"},{"sentence":"This particular mutation resulted in a ligand-insensitive receptor that could no longer activate the G protein.","translation":"この特定の変異は、もはやGタンパク質を活性化することができないリガンド非感受性受容体をもたらした。","type":"adjective","meaning_category":"molecular biology"}]}