{"word":"Tarsometatarsi","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(鳥類の)足根中足骨","english_definition":"A bone found in the lower leg of birds, formed by the fusion of the distal tarsals with the metatarsals.","examples":[{"sentence":"The tarsometatarsi is a unique bone structure in birds that provides strength and flexibility for perching and locomotion.","translation":"足根中足骨は鳥類に見られる独特な骨格構造で、止まり木にとまったり移動したりするための強度と柔軟性を提供します。"}],"collocations":["fused tarsometatarsi","avian tarsometatarsi"],"synonyms":["shank","drumstick"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'tarso-' (referring to the tarsus or ankle bones), 'metatarso-' (referring to the metatarsus or foot bones), and '-i' (a plural ending in Latin). This reflects the bone's formation from the fusion of tarsal and metatarsal elements.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɑːrsoʊˌmɛtəˈtɑːrsi/","syllables":"tar-so-me-ta-tar-si"},"inflection":{"noun_plural":"Tarsometatarsus"},"usage_notes":{"explanation":"The term 'tarsometatarsi' is primarily used in ornithology and comparative anatomy when discussing the skeletal structure of birds. It is a technical term and not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tarsometatarsus is found in mammals.","correct":"✓ The tarsometatarsus is found in birds.","note":"The tarsometatarsus is a characteristic bone of birds, not mammals."}],"priority":"★★☆"},"related_words":{"derivatives":["tarsus","metatarsus"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'tarsometatarsi' is a highly specialized term used in the context of avian anatomy. Understanding requires knowledge of skeletal biology and ornithology. It's not part of general vocabulary.","word_length":"long"},"example_sentences":[{"sentence":"The length of the tarsometatarsi can be used to estimate the body size of extinct birds.","translation":"足根中足骨の長さは、絶滅した鳥の体の大きさを推定するために使用できます。","type":"noun","meaning_category":"anatomy"},{"sentence":"The structure of the tarsometatarsi is adapted for efficient bipedal locomotion.","translation":"足根中足骨の構造は、効率的な二足歩行に適応しています。","type":"noun","meaning_category":"anatomy"}]}