{"word":"uratic","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Pertaining to, derived from, or containing uric acid or urates.","english_definition":"Relating to or containing uric acid or urates.","examples":[{"sentence":"The doctor examined the patient's uratic deposits in the joints.","translation":"医者は患者の関節に見られる尿酸塩の沈着を診察した。"},{"sentence":"Uratic crystals were found in the kidney stones.","translation":"尿酸塩結晶が腎臓結石の中から見つかった。"}],"collocations":["uratic deposits","uratic crystals","uratic diathesis"],"synonyms":["uric","urate"],"antonyms":[]}],"etymology":{"value":"Derived from 'uric' (from 'urea') + '-atic'.","priority":"Medium"},"pronunciation":{"ipa":"/jʊˈrætɪk/","syllables":"yu-rat-ic"},"inflection":{"notes":"The word 'uratic' is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Uratic' is a specialized term primarily used in medical and scientific contexts to describe substances or conditions related to uric acid and its salts (urates). It is often used when discussing gout, kidney stones, and other metabolic disorders.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The uratic acid level was normal.","correct":"The uric acid level was normal.","note":"While 'uratic' relates to uric acid, it's more common to directly use 'uric acid' when referring to the acid itself."}],"priority":"Low"},"related_words":{"derivatives":["urate","uric acid","uria"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"The word 'uratic' is a technical term primarily used in medical and scientific contexts. Understanding requires familiarity with basic chemistry and biology, specifically related to uric acid and metabolic processes. It is not a word commonly encountered in everyday language."},"example_sentences":[{"sentence":"The patient presented with symptoms indicative of uratic arthritis.","translation":"患者は尿酸性関節炎を示唆する症状を呈した。","type":"adjective","meaning_category":"Medical"},{"sentence":"Analysis of the fluid revealed a high concentration of uratic compounds.","translation":"体液の分析により、高濃度の尿酸塩化合物が検出された。","type":"adjective","meaning_category":"Scientific"}]}