{"word":"securitized","priority":"★★☆","meanings":[{"part_of_speech":"verb (past participle)","definition":"証券化された","english_definition":"(of an asset or group of assets) converted into marketable securities, typically for sale to investors.","examples":[{"sentence":"The mortgage loans were securitized and sold to investors.","translation":"その住宅ローンは証券化され、投資家に販売された。"},{"sentence":"Securitized assets can be traded more easily than individual loans.","translation":"証券化された資産は、個別のローンよりも容易に取引できる。"}],"collocations":["securitized debt","securitized loan","securitized asset","mortgage-backed securities (MBS)","asset-backed securities (ABS)"],"synonyms":["packaged","pooled","financialized"],"antonyms":["unsecuritized","illiquid"],"related_terms":["securitization","security","asset","mortgage","loan","investment"]}],"etymology":{"value":"The word 'securitized' comes from the verb 'securitize,' which is formed from 'security' + '-ize' (a suffix meaning 'to make or become'). It refers to the process of converting assets into securities.","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˈkjʊərɪtaɪzd/","syllables":"se-cu-ri-tized"},"inflection":{"verb_forms":{"present_simple":["securitize","securitizes"],"past_simple":"securitized","past_participle":"securitized","present_participle":"securitizing"}},"usage_notes":{"explanation":"'Securitized' describes assets that have undergone securitization, a process where assets (like loans, mortgages, or receivables) are pooled together and converted into securities that can be sold to investors. This process increases liquidity and allows originators of the assets to free up capital. However, it can also increase risk if not managed properly, as seen in the 2008 financial crisis. It is primarily used in financial contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The securitized was sold to investors.","correct":"✓ The securitized asset was sold to investors.","note":"'Securitized' is an adjective, so it needs to modify a noun (like 'asset,' 'loan,' or 'debt'). It cannot stand alone as a noun."},{"incorrect":"✗ The company securitized after the bankruptcy.","correct":"✓ The company securitized its assets before the bankruptcy.","note":"'Securitize' is a verb that means to convert assets into securities. The sentence should indicate what was securitized."}],"priority":"★★☆"},"related_words":{"derivatives":["securitization (noun: the process of securitizing assets)","securitizer (noun: an entity that securitizes assets)"],"related_terms":["asset-backed security (ABS)","mortgage-backed security (MBS)","collateralized debt obligation (CDO)","tranche","credit rating agency"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, primarily used in financial contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Securitized' is a technical term primarily used in finance. It describes assets that have been transformed into securities, which are financial instruments that can be bought and sold in the market. Understanding this word requires familiarity with financial concepts like assets, securities, and investment. The process of securitization involves pooling assets and creating new securities backed by those assets, allowing investors to purchase a share of the pooled assets. This term is most commonly encountered in discussions about financial markets, investment strategies, and risk management."},"example_sentences":[{"sentence":"The bank **securitized** its auto loans to raise capital.","translation":"その銀行は、資本を調達するために自動車ローンを証券化した。","type":"verb","meaning_category":"証券化する (過去形)"},{"sentence":"These **securitized** mortgages are considered high-risk investments.","translation":"これらの証券化された住宅ローンは、高リスク投資とみなされている。","type":"adjective","meaning_category":"証券化された"},{"sentence":"The **securitized** debt market has grown significantly in recent years.","translation":"証券化された債務市場は近年著しく成長している。","type":"adjective","meaning_category":"証券化された"}]}