{"word":"non-commodified","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"商品化されていない、商業化されていない","english_definition":"Not treated as or turned into a commodity; not subject to commercial exploitation or market forces.","examples":[{"sentence":"The artist sought to create non-commodified art that was freely accessible to everyone.","translation":"そのアーティストは、誰でも自由にアクセスできる、商品化されていないアートを創造しようと努めた。"},{"sentence":"They advocated for non-commodified education, believing that knowledge should not be treated as a product.","translation":"彼らは、知識は商品として扱われるべきではないと考え、非商品化された教育を提唱した。"},{"sentence":"Access to clean water should be a right, not a non-commodified service.","translation":"きれいな水へのアクセスは権利であるべきで、商品化されないサービスであるべきではない。"}],"collocations":["non-commodified art","non-commodified education","non-commodified service","non-commodified resource","non-commodified space"],"synonyms":["decommodified","uncommodified","non-commercial","non-market"],"antonyms":["commodified","commercialized","marketized"]},{"part_of_speech":"adjective","definition":"商品としての価値を持たない、市場で取引されない","english_definition":"Lacking the characteristics or status of a commodity; not intended for sale or exchange in a market.","examples":[{"sentence":"Personal relationships should remain non-commodified and based on genuine connection.","translation":"個人的な関係は、商品化されず、真のつながりに基づいているべきだ。"},{"sentence":"The value of volunteering lies in its non-commodified nature; it's about giving back to the community.","translation":"ボランティア活動の価値は、その非商品化された性質にある。それは地域社会への貢献だ。"}],"collocations":["non-commodified labor","non-commodified relationship","non-commodified gift","non-commodified exchange"],"synonyms":["priceless","invaluable","non-monetary","non-pecuniary"],"antonyms":["marketable","saleable","commercial","valuable"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the past participle 'commodified' of the verb 'commodify'. 'Commodify' means to turn something into a commodity, i.e., an object for sale or exchange in a market.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.kəˈmɒdɪfaɪd/","syllables":"non-co-mod-i-fied"},"inflection":{"adjective_forms":{"comparative":"more non-commodified","superlative":"most non-commodified"}},"usage_notes":{"explanation":"'Non-commodified' describes something that is not treated as a commodity, meaning it's not primarily intended for sale or exchange in a market. It often implies a resistance to or rejection of market principles and commercial exploitation. The term is frequently used in discussions about art, education, resources, and relationships, where there's a concern that treating these things as commodities can diminish their intrinsic value or create inequalities in access.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-commodified product was very expensive.","correct":"✓ The non-commodified service was offered free of charge.","note":"If something is non-commodified, it typically isn't sold at all, so it wouldn't have a price, let alone be expensive. The sentence should reflect that it's free or not for sale."},{"incorrect":"✗ He wanted to commodify his art, making it non-commodified.","correct":"✓ He wanted to decommodify his art, making it freely available.","note":"'Commodify' and 'non-commodified' are opposites. If someone wants to make something non-commodified, they are essentially decommodifying it."}],"priority":"★★☆"},"related_words":{"derivatives":["decommodify (verb)","commodification (noun)","commodity (noun)"],"antonyms":["commodified","commercialized","market-based","for-profit"],"related_concepts":["gift economy","commons","public goods","open-source","free culture"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in academic and specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-commodified' is a term used to describe something that is not treated as a product to be bought or sold. It's often used when discussing things like art, education, or natural resources, where people believe that putting a price on them can damage their value or make them unfair. It's a more complex term, so you'll usually find it in more academic or specialized writing. Think of it as the opposite of 'commercialized'."},"example_sentences":[{"sentence":"The library provides non-commodified access to information for all citizens.","translation":"図書館はすべての市民に、商品化されていない情報へのアクセスを提供している。","type":"adjective","meaning_category":"not treated as a commodity"},{"sentence":"They argued that healthcare should be a non-commodified right, not a privilege.","translation":"彼らは、医療は特権ではなく、商品化されない権利であるべきだと主張した。","type":"adjective","meaning_category":"not treated as a commodity"},{"sentence":"The festival aimed to create a non-commodified space for artistic expression.","translation":"そのフェスティバルは、芸術的表現のための非商品化された空間を創造することを目指した。","type":"adjective","meaning_category":"not treated as a commodity"}]}