{"word":"parallelotropic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(鉱物学で)圧力または温度の変化に応じて、互いに平行な方向に光学的特性が変化する","english_definition":"(mineralogy) exhibiting optical properties that change in parallel directions with changes in pressure or temperature.","examples":[{"sentence":"The parallelotropic behavior of the crystal was studied under varying conditions.","translation":"その結晶の平行屈性挙動は、さまざまな条件下で研究された。"}],"collocations":[],"synonyms":["anisotropic","birefringent"],"antonyms":["isotropic"]}],"etymology":{"value":"The term combines 'parallel' (from Greek 'parallēlos', alongside one another) and '-tropic' (from Greek 'tropos', a turning, direction, manner). It describes the parallel change in optical properties.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəˌlɛləˈtrɒpɪk/","syllables":"par-al-lel-o-trop-ic"},"inflection":{},"usage_notes":{"explanation":"This term is highly specific to mineralogy and optical physics, describing a particular type of anisotropic behavior in crystals. It indicates that changes in refractive indices occur along parallel axes when subjected to pressure or temperature variations.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["parallelotropism (noun)"],"related_terms":["anisotropy","birefringence","optical properties"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Parallelotropic' is a technical term used in mineralogy and optical physics. It describes materials, typically crystals, whose optical properties (specifically, refractive indices) change in parallel directions when subjected to changes in pressure or temperature. Understanding this term requires a background in materials science or physics."},"example_sentences":[{"sentence":"The quartz crystal exhibited parallelotropic behavior under high pressure.","translation":"その石英結晶は高圧下で平行屈性挙動を示した。","type":"scientific","meaning_category":"mineralogy"}]}