{"word":"pathic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(性的な役割において)受け身の、受動的な (特に男性同性愛において)","english_definition":"(of a person, especially a male homosexual) taking the passive role in sexual activity.","examples":[{"sentence":"In some cultures, the pathic role is considered less desirable.","translation":"一部の文化では、パシックな役割はあまり好ましくないとされています。"},{"sentence":"He was described as pathic in the encounter.","translation":"彼はその出会いにおいてパシックであると描写されました。"}],"collocations":["pathic role","pathic behavior"],"synonyms":["passive","receptive","submissive"],"antonyms":["active","insertive"],"notes":"This term can be considered offensive by some, depending on the context and intent."},{"part_of_speech":"adjective","definition":"(医学)病的な、疾患の","english_definition":"relating to or caused by disease; pathological.","examples":[{"sentence":"The pathic condition of the tissue was evident under the microscope.","translation":"その組織の病的な状態は顕微鏡下で明らかでした。"}],"collocations":["pathic condition","pathic state"],"synonyms":["diseased","morbid","pathological"],"antonyms":["healthy","normal"]}],"etymology":{"value":"From Greek 'pathos' (suffering, feeling) + '-ic' (relating to). The sexual sense likely derives from the idea of 'suffering' or 'being acted upon'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpæθɪk/","syllables":"path-ic"},"inflection":{"notes":"Adjective, comparative and superlative forms (more pathic, most pathic) are possible but not commonly used."},"usage_notes":{"explanation":"The term 'pathic' has two distinct meanings. In the context of sexual roles, it refers to the passive partner, particularly in male homosexual relationships. This usage can be stigmatizing and is often avoided in favor of more neutral terms. In a medical context, 'pathic' relates to disease or pathology, similar to 'pathological'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He felt very pathic about the situation.","correct":"✓ He felt very apathetic about the situation.","note":"'Pathic' (related to passive sexual role or disease) is often confused with 'apathetic' (showing or feeling no interest, enthusiasm, or concern)."},{"incorrect":"✗ The pathic results were normal.","correct":"✓ The pathological results were normal.","note":"In medical contexts, 'pathological' is generally preferred over 'pathic' to describe test results or conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["pathos (名詞: 悲哀、哀愁、感情)","pathetic (形容詞: 哀れな、痛ましい)","pathology (名詞: 病理学)","pathological (形容詞: 病的な、病理学的な)","empathy (名詞: 共感)","sympathy (名詞: 同情)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pathic' is a relatively uncommon word with two primary meanings. One refers to the passive role in sexual activity, especially among gay men, and can be considered offensive. The other, more technical meaning relates to disease, similar to 'pathological'. Due to its potential for misinterpretation and negative connotations, it should be used with caution and awareness of the context. The medical sense is less problematic but often replaced by 'pathological' for clarity."},"example_sentences":[{"sentence":"The study explored the social stigma associated with the pathic role in male same-sex relationships.","translation":"その研究は、男性同性愛関係におけるパシックな役割に関連する社会的偏見を探求しました。","type":"adjective","meaning_category":"(性的な役割において)受け身の、受動的な"},{"sentence":"The doctor noted the pathic changes in the patient's liver.","translation":"医師は患者の肝臓の病的な変化に注目しました。","type":"adjective","meaning_category":"(医学)病的な、疾患の"}]}