{"word":"nonego","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"無我、エゴの欠如、自己中心性のなさ","english_definition":"The absence of ego; lack of self-centeredness.","examples":[{"sentence":"Meditation can help one achieve a state of nonego.","translation":"瞑想は人が無我の境地に達するのを助けることができる。"},{"sentence":"His actions were motivated by compassion and nonego.","translation":"彼の行動は思いやりと自己中心性のなさによって動機づけられていた。"},{"sentence":"The artist strived to create art from a place of nonego.","translation":"その芸術家は無我の境地から芸術を創造しようと努めた。"}],"collocations":["achieve nonego (無我を達成する)","practice nonego (無我を実践する)","state of nonego (無我の境地)"],"synonyms":["selflessness","altruism","impartiality","objectivity"],"antonyms":["egoism","selfishness","self-centeredness","narcissism"]},{"part_of_speech":"adjective","definition":"無我の、自己中心的でない","english_definition":"Characterized by the absence of ego; not self-centered.","examples":[{"sentence":"She approached the project with a nonego attitude, focusing on the collective goal.","translation":"彼女はプロジェクトに無我の姿勢で取り組み、集団の目標に焦点を当てた。"},{"sentence":"His nonego leadership style fostered collaboration and trust.","translation":"彼の自己中心的でないリーダーシップスタイルは、協力と信頼を育んだ。"}],"collocations":["nonego attitude (無我の姿勢)","nonego approach (無我のアプローチ)","nonego leadership (無我のリーダーシップ)"],"synonyms":["selfless","altruistic","unassuming","humble"],"antonyms":["egoistic","selfish","self-absorbed","arrogant"]}],"etymology":{"value":"\"Nonego\" is formed by combining the prefix \"non-\" (meaning \"not\") with the word \"ego.\" The term is primarily used in philosophical, psychological, and spiritual contexts to describe a state or quality of being without a dominant sense of self or personal identity.","priority":"★★☆"},"pronunciation":{"ipa":"/nʌnˈiːɡoʊ/","syllables":"non-e-go"},"inflection":{"noun_plural":"nonegos","adjective_forms":{}},"usage_notes":{"explanation":"\"Nonego\" refers to a state of being where the sense of self or \"I\" is diminished or absent. This concept is often explored in Eastern philosophies and spiritual practices, such as Buddhism and Advaita Vedanta, where the dissolution of the ego is seen as a path to enlightenment or liberation. In psychological contexts, \"nonego\" can describe a healthy detachment from one's own needs and desires, leading to greater empathy and compassion for others.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very nonego person, always talking about himself.","correct":"✓ He is not a nonego person, always talking about himself.","note":"A person who is always talking about themselves is the opposite of nonego. They are egoistic or self-centered."},{"incorrect":"✗ Nonego is the same as having low self-esteem.","correct":"✓ Nonego is not the same as having low self-esteem. It is about transcending the ego, not lacking confidence.","note":"Nonego is not about lacking confidence or having low self-esteem. It is about transcending the ego and acting without self-centeredness."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrases":["Ego death (エゴの死)","Selflessness (無私)","Altruism (利他主義)"],"related_concepts":["Buddhism (仏教)","Advaita Vedanta (アドヴァイタ・ヴェーダーンタ)","Mindfulness (マインドフルネス)","Meditation (瞑想)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonego\" is relatively uncommon and is primarily used in philosophical, psychological, and spiritual contexts. It describes the absence of a strong sense of self or ego. Understanding the term requires familiarity with concepts such as selflessness, altruism, and the philosophical idea of transcending the ego. It is not typically used in everyday conversation and is more likely to be encountered in academic or specialized texts.","priority":"★★☆"},"example_sentences":[{"sentence":"The guru emphasized the importance of cultivating a state of **nonego** to achieve inner peace.","translation":"その導師は、内なる平和を達成するために無我の境地を養うことの重要性を強調した。","type":"noun","meaning_category":"無我"},{"sentence":"Her **nonego** approach to leadership allowed her team to thrive.","translation":"彼女の自己中心的でないリーダーシップのアプローチは、彼女のチームが繁栄することを可能にした。","type":"adjective","meaning_category":"自己中心的でない"},{"sentence":"Through years of practice, he learned to act from a place of **nonego**.","translation":"長年の実践を通して、彼は無我の境地から行動することを学んだ。","type":"noun","meaning_category":"無我"},{"sentence":"The goal of the retreat was to help participants experience **nonego**.","translation":"そのリトリートの目的は、参加者が無我を体験するのを助けることだった。","type":"noun","meaning_category":"無我"},{"sentence":"A **nonego** perspective can lead to greater compassion and understanding.","translation":"自己中心的でない視点は、より大きな思いやりと理解につながる可能性がある。","type":"adjective","meaning_category":"自己中心的でない"}]}