{"word":"microchaetae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"微小毛、微細剛毛（昆虫などの体表に見られる非常に小さな剛毛）","english_definition":"Very small bristles or setae, especially those found on the bodies of insects.","examples":[{"sentence":"The microchaetae on the fly's wings help it sense air currents.","translation":"ハエの翅にある微小毛は、気流を感知するのに役立つ。"},{"sentence":"Scanning electron microscopy revealed the presence of numerous microchaetae on the beetle's exoskeleton.","translation":"走査型電子顕微鏡により、甲虫の外骨格に多数の微小毛が存在することが明らかになった。"}],"collocations":["sensory microchaetae","cuticular microchaetae"],"synonyms":["setulae","sensilla"],"antonyms":[]}],"etymology":{"value":"'Micro-' (small) + 'chaetae' (bristles). Chaetae comes from the Greek 'chaite' meaning long hair or bristle.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪkroʊˈkiːtiː/","syllables":"mi-cro-chae-tae"},"inflection":{"noun_plural":"microchaetae"},"usage_notes":{"explanation":"'Microchaetae' refers specifically to very small, hair-like structures on the surface of organisms, particularly insects. They often serve sensory functions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The microchaeta is visible with the naked eye.","correct":"✓ Microchaetae are only visible with a microscope.","note":"Microchaetae are, by definition, very small and not visible without magnification."}],"priority":"★★☆"},"related_words":{"derivatives":["chaeta","macrochaetae"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Microchaetae' is a technical term used in entomology and related fields to describe very small bristles on insects. Understanding this term requires a background in biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The arrangement of microchaetae on the leafhopper's tibia is a key taxonomic characteristic.","translation":"ヨコバイの脛節上の微小毛の配置は、重要な分類学的特徴である。","type":"scientific","meaning_category":"description"},{"sentence":"Studies suggest that microchaetae play a role in the insect's ability to cling to surfaces.","translation":"研究によると、微小毛は昆虫が表面に付着する能力において役割を果たしていることが示唆されている。","type":"scientific","meaning_category":"function"}]}