{"word":"unliquidatable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"換金できない、清算できない","english_definition":"impossible to liquidate; not able to be converted into cash or otherwise settled.","examples":[{"sentence":"Due to the current market conditions, some of our assets have become unliquidatable.","translation":"現在の市場状況により、当社の一部の資産は換金不可能になっています。"},{"sentence":"The company's debt was so high that it was considered unliquidatable.","translation":"その会社の負債は非常に大きかったため、清算不可能と見なされました。"}],"collocations":["unliquidatable assets","unliquidatable debt","unliquidatable investments"],"synonyms":["illiquid","non-negotiable","unsalable"],"antonyms":["liquid","marketable","salable"]}],"etymology":{"value":"\"un-\" (否定) + \"liquidatable\" (換金可能な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnˈlɪkwɪdəteɪbəl/","syllables":"un-liq-ui-da-ta-ble"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"\"Unliquidatable\" describes assets or debts that cannot be easily converted to cash or settled. It often implies a situation where the asset has little or no market value or the debt is too large to be repaid.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is unliquidatable because it's doing well.","correct":"✓ The company is not being liquidated because it's doing well.","note":"\"Unliquidatable\" means impossible to liquidate. If a company is doing well, it would not be liquidated, but it would be liquidatable."}],"priority":"★★☆"},"related_words":{"derivatives":["liquidate","liquidation","liquidatable","illiquid","liquidity"],"related_concepts":["insolvency","bankruptcy","asset valuation","financial distress"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unliquidatable\" is a technical term used in finance and economics. It means that something, typically an asset or a debt, cannot be easily converted into cash or settled. Understanding this term requires familiarity with financial concepts such as liquidity, assets, and debt. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The real estate investment proved to be unliquidatable during the economic downturn.","translation":"その不動産投資は、景気後退期には換金不可能であることが判明した。","type":"adjective","meaning_category":"換金できない"},{"sentence":"The company faced significant losses due to its unliquidatable inventory.","translation":"その会社は、換金できない在庫のために大きな損失を被った。","type":"adjective","meaning_category":"清算できない"}]}