{"word":"corolline","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"花冠状の、花冠に似た","english_definition":"Resembling or pertaining to a corolla (the petals of a flower).","examples":[{"sentence":"The corolline leaves of this plant are quite striking.","translation":"この植物の花冠状の葉は非常に印象的です。"},{"sentence":"The botanist described the corolline structure of the newly discovered species.","translation":"植物学者は新種の花冠状の構造を説明しました。"}],"collocations":["corolline leaves","corolline structure","corolline arrangement"],"synonyms":["petaloid","floral","petaline"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'corolla,' meaning 'little crown' or 'wreath,' which refers to the petals of a flower. The suffix '-ine' is used to form adjectives.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒrəlaɪn/","syllables":"cor-ol-line"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than forming comparative and superlative degrees (which is uncommon for this word)."},"usage_notes":{"explanation":"The term 'corolline' is primarily used in botany to describe structures or arrangements that resemble the corolla of a flower. It is a relatively uncommon term, mainly found in technical or scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The corolline is beautiful.","correct":"✓ The corolla is beautiful.","note":"'Corolline' is an adjective, so it must modify a noun. 'Corolla' is the noun referring to the petals of a flower."}],"priority":"★★☆"},"related_words":{"derivatives":["corolla (noun: the petals of a flower)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Corolline' is a specialized term used in botany to describe something that resembles or pertains to the corolla of a flower. It is not a commonly used word and is primarily found in scientific or technical contexts related to plant morphology. Understanding the term requires familiarity with botanical terminology."},"example_sentences":[{"sentence":"The plant's **corolline** arrangement of bracts mimicked the appearance of a true flower.","translation":"その植物の苞葉の花冠状の配置は、本物の花の外観を模倣していました。","type":"adjective","meaning_category":"花冠状の"},{"sentence":"The **corolline** shape of the modified leaves helped attract pollinators.","translation":"変形した葉の花冠状の形は、受粉媒介者を引き寄せるのに役立ちました。","type":"adjective","meaning_category":"花冠に似た"}]}