{"word":"sand-warped","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(of an object or surface) distorted or eroded by the abrasive action of windblown sand.","english_definition":"Having been distorted or eroded by the abrasive action of windblown sand.","examples":[{"sentence":"The ancient sandstone formations were sand-warped by centuries of desert winds.","translation":"古代の砂岩層は、何世紀にもわたる砂漠の風によって砂で歪められていた。"},{"sentence":"The sand-warped surface of the driftwood told a story of relentless exposure to the elements.","translation":"砂で歪められた流木の表面は、容赦ない自然環境への暴露の物語を語っていた。"}],"collocations":["sand-warped rock","sand-warped wood","sand-warped landscape"],"synonyms":["wind-eroded","sandblasted","weathered","distorted","eroded"],"antonyms":["smooth","unaffected","preserved"]}],"etymology":{"value":"Combination of 'sand' (fine granular material resulting from the erosion of rocks) and 'warped' (distorted or bent out of shape). The term describes the effect of sand abrasion on a surface, causing it to become uneven or misshapen.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsænd wɔːrpt/","syllables":"sand-warped"},"inflection":{"notes":"This is an adjective, so it doesn't inflect like a verb. Comparative and superlative forms are possible but less common (more sand-warped, most sand-warped)."},"usage_notes":{"explanation":"'Sand-warped' is a descriptive adjective used to characterize objects or surfaces that have been altered by the abrasive force of sand carried by wind. It often implies a rough, uneven texture and is commonly used in geological or environmental contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sand-warped building was beautiful.","correct":"✓ The sand-warped building was interesting/unique.","note":"While technically correct, 'sand-warped' often implies damage or distortion, so it's rarely associated with beauty in a conventional sense. 'Interesting' or 'unique' might be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["warped","sand","sandblasting","abrasion","erosion"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency (Specific and descriptive term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sand-warped' is a relatively uncommon and descriptive adjective. It is most likely to be encountered in texts discussing geology, desert environments, or the effects of weathering on materials. Understanding the term requires knowledge of the individual words 'sand' and 'warped,' and the concept of abrasion caused by windblown particles. Due to its specialized nature, it is more suitable for advanced learners.","priority":"★☆☆"},"example_sentences":[{"sentence":"The sand-warped cliffs stood as a testament to the power of the desert winds.","translation":"砂で歪められた崖は、砂漠の風の力を証明するものとして立っていた。","type":"descriptive","meaning_category":"distorted by sand"},{"sentence":"Archaeologists carefully documented the sand-warped inscriptions on the ancient monument.","translation":"考古学者は、古代の記念碑の砂で歪められた碑文を注意深く記録した。","type":"descriptive","meaning_category":"eroded by sand"}]}