{"word":"digester","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"消化器","english_definition":"An organism, cell, or body part that digests food.","examples":[{"sentence":"The stomach is the primary digester in many animals.","translation":"胃は多くの動物における主要な消化器です。"}],"collocations":[],"synonyms":["stomach","gut","alimentary canal"],"antonyms":[]},{"part_of_speech":"noun","definition":"消化槽、分解槽、発酵槽","english_definition":"A container in which substances are broken down, especially by bacterial action.","examples":[{"sentence":"The sewage treatment plant uses a digester to break down organic waste.","translation":"下水処理場では、有機廃棄物を分解するために消化槽を使用しています。"},{"sentence":"The biogas plant uses a digester to produce methane from agricultural waste.","translation":"バイオガスプラントでは、農業廃棄物からメタンを生成するために発酵槽を使用しています。"}],"collocations":["anaerobic digester","sludge digester"],"synonyms":["fermenter","reactor","vat"],"antonyms":[]}],"etymology":{"value":"From the verb 'digest' + '-er'.","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈdʒestər/","syllables":"di-gest-er"},"inflection":{"noun_plural":"digesters"},"usage_notes":{"explanation":"The word \"digester\" has two main meanings. The first refers to a biological entity or organ involved in digestion. The second, and more common usage, refers to a piece of equipment used to break down materials, often organic waste, through biological or chemical processes. The context will usually make it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The digester is used to cook food.","correct":"The digester is used to break down waste.","note":"Digesters are used for breaking down materials, not for cooking food."}],"priority":"★★☆"},"related_words":{"derivatives":["digest","digestion","digestible"],"related_terms":["anaerobic digestion","biogas"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'digester' refers to something that digests, either a part of the body or a machine. In biology, it refers to an organ that digests food. In engineering, it refers to a tank or container used to break down organic material, often in waste treatment or biogas production. It's a technical term, so it's more common in scientific or engineering contexts."},"example_sentences":[{"sentence":"The human stomach is a powerful digester.","translation":"人間の胃は強力な消化器です。","type":"noun","meaning_category":"消化器"},{"sentence":"The anaerobic digester converts organic waste into biogas.","translation":"嫌気性消化槽は有機廃棄物をバイオガスに変換します。","type":"noun","meaning_category":"消化槽"}]}