{"word":"untreatableness","priority":"low","meanings":[{"part_of_speech":"noun","definition":"治療不可能性、治療困難性","english_definition":"The state or quality of being untreatable; the condition of not being able to be cured or effectively treated.","examples":[{"sentence":"The untreatableness of the disease left the doctors with few options.","translation":"その病気の治療不可能性により、医師たちはほとんど選択肢が残されていなかった。"},{"sentence":"They discussed the untreatableness of his condition with his family.","translation":"彼らは彼の家族と彼の容体の治療困難性について話し合った。"}],"collocations":["untreatableness of a disease","untreatableness of a condition","assess the untreatableness"],"synonyms":["incurability","hopelessness","irremediability","intractability"],"antonyms":["treatability","curability","remediability"],"related_terms":["untreatable","treatment","disease","condition"]}],"etymology":{"value":"Formed from 'untreatable' (not able to be treated) + '-ness' (suffix indicating a state or quality).","priority":"low"},"pronunciation":{"ipa":"ʌnˈtriːtəbəlnəs","syllables":"un-treat-a-ble-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Untreatableness' is a noun that refers to the state or quality of something (usually a disease or condition) being impossible or very difficult to treat effectively. It is often used in medical contexts.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The untreatableness made him sad.","correct":"The untreatableness of his illness made him sad.","note":"It's important to specify what is untreatable. The noun needs context to be meaningful."}],"priority":"low"},"level_frequency":{"frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C2","text":"'Untreatableness' is a complex word used in formal or medical contexts to describe the state of a disease or condition that cannot be cured or effectively treated. It is derived from 'untreatable,' which means not able to be treated, and the suffix '-ness,' which turns an adjective into a noun indicating a state or quality. This word is not commonly used in everyday language."},"example_sentences":[{"sentence":"The researchers focused on the untreatableness of certain types of cancer.","translation":"研究者たちは、特定の種類のがんの治療不可能性に焦点を当てた。","type":"general","meaning_category":"incurability"},{"sentence":"The patient's family struggled to accept the untreatableness of his neurological disorder.","translation":"患者の家族は、彼の神経疾患の治療不可能性を受け入れるのに苦労した。","type":"medical","meaning_category":"incurability"}]}