{"word":"antisophistication","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"反洗練; 素朴さの尊重; 知ったかぶりや気取りに対する嫌悪","english_definition":"opposition to sophistication; a preference for simplicity and genuineness; dislike of pretension or affectation.","examples":[{"sentence":"His antisophistication was evident in his preference for simple, unadorned clothing.","translation":"彼の反洗練は、飾り気のないシンプルな服装を好むことに明らかだった。"},{"sentence":"The author's antisophistication appealed to readers who were tired of overly intellectual novels.","translation":"その作家の反洗練は、過度に知的な小説に飽きた読者にアピールした。"},{"sentence":"The movement was characterized by its antisophistication and its embrace of traditional values.","translation":"その運動は、反洗練と伝統的な価値観の受け入れによって特徴づけられた。"}],"collocations":["a sense of antisophistication","an air of antisophistication","to value antisophistication"],"synonyms":["simplicity","genuineness","authenticity","unpretentiousness","naiveté"],"antonyms":["sophistication","pretension","affectation","artificiality"]}],"etymology":{"value":"\"anti-\" (反対) + \"sophistication\" (洗練)","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiːsəˌfɪstɪˈkeɪʃən/","syllables":"an-ti-so-phis-ti-ca-tion"},"inflection":{"noun_plural":"antisophistications (rarely used)"},"usage_notes":{"explanation":"\"Antisophistication\" refers to the quality or state of being opposed to sophistication. It often implies a preference for things that are simple, genuine, and unpretentious. The term can be used to describe a person's attitude, a movement, or a style. It is less common than \"sophistication\" and is often used in academic or critical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of antisophistication for art.","correct":"✓ He showed a lot of antisophistication in his approach to art.","note":"The preposition \"in\" is often used to specify the area where the antisophistication is evident."},{"incorrect":"✗ The antisophistication of the movie made it boring.","correct":"✓ The lack of sophistication in the movie made it boring.","note":"Sometimes, it's more natural to say \"lack of sophistication\" instead of \"antisophistication\" to avoid awkward phrasing."}],"priority":"★☆☆"},"related_words":{"derivatives":["antisophisticate (rarely used)"],"related_terms":["sophistication","unsophisticated","naive","genuine","simple","unpretentious"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Antisophistication\" is a complex term referring to the opposition or dislike of sophistication. It suggests a preference for simplicity, genuineness, and a rejection of pretension or artificiality. This word is not commonly used and is more often found in academic or critical writing where the nuances of style and attitude are being analyzed. Understanding the root word \"sophistication\" is essential to grasping the meaning of \"antisophistication.\""},"example_sentences":[{"sentence":"The artist's work displayed a deliberate antisophistication, rejecting elaborate techniques in favor of a raw, unfiltered approach.","translation":"そのアーティストの作品は、入念な技術を拒否し、生の、フィルターを通さないアプローチを好む、意図的な反洗練を示していた。","type":"noun","meaning_category":"反洗練"},{"sentence":"The politician's appeal rested on his perceived antisophistication, which resonated with voters who felt alienated by the political establishment.","translation":"その政治家の魅力は、彼の認識された反洗練にあり、それは政治体制に疎外感を抱く有権者の共感を呼んだ。","type":"noun","meaning_category":"反洗練"},{"sentence":"The design of the building reflected an antisophistication, with exposed brick and minimal ornamentation.","translation":"その建物のデザインは、むき出しのレンガと最小限の装飾で、反洗練を反映していた。","type":"noun","meaning_category":"反洗練"}]}