{"word":"superrheumatized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(rare, possibly humorous) Extremely affected by rheumatism.","english_definition":"(rare, possibly humorous) Suffering from or affected by rheumatism to an extreme degree.","examples":[{"sentence":"After spending the day in the damp weather, he felt completely superrheumatized.","translation":"湿気の多い天気の中で一日過ごした後、彼は完全にリウマチが悪化したように感じた。"},{"sentence":"The old man joked that he was superrheumatized whenever the weather changed.","translation":"その老人は、天気が変わるたびにリウマチがひどくなると冗談を言った。"}],"collocations":["completely superrheumatized","feel superrheumatized"],"synonyms":["extremely rheumatic","severely arthritic"],"antonyms":["nonrheumatic","healthy","unaffected"]}],"etymology":{"value":"Formed by adding the prefix 'super-' to 'rheumatized', indicating an extreme or exaggerated state of being affected by rheumatism. 'Rheumatized' itself comes from 'rheumatism', a term for diseases marked by inflammation or pain in the joints, muscles, or fibrous tissue.","priority":"★★☆"},"pronunciation":{"ipa":"ˌsuːpərˈruːmətɑɪzd","syllables":"su-per-rheu-ma-tized"},"inflection":{"adjective_forms":{"comparative":"more superrheumatized","superlative":"most superrheumatized"}},"usage_notes":{"explanation":"The term 'superrheumatized' is not commonly found in standard English and may be considered humorous or informal. It suggests an exaggerated or extreme state of being affected by rheumatism. Its use is typically limited to descriptive or jocular contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is superrheumatism.","correct":"✓ He is superrheumatized.","note":"'Superrheumatism' would be a noun referring to the condition itself, whereas 'superrheumatized' is an adjective describing someone affected by it. To describe someone suffering from the condition, use the adjective form."}],"priority":"★★☆"},"related_words":{"derivatives":["super- (prefix indicating 'above', 'beyond', or 'to an extreme degree')","rheumatism (noun: a disease marked by inflammation or pain in the joints, muscles, or fibrous tissue)","rheumatic (adjective: relating to or affected by rheumatism)","rheumatoid (adjective: resembling rheumatism)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not a standard English term)","frequency_google_ngram":"Very low frequency (rarely used)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Superrheumatized' is a rare and informal term used to describe someone who is extremely affected by rheumatism. It is formed by adding the prefix 'super-' to 'rheumatized', indicating an exaggerated state. Due to its rarity, it is not commonly used in formal contexts and may be considered humorous. Understanding the word requires knowledge of the prefix 'super-' and the term 'rheumatism'."},"example_sentences":[{"sentence":"After the cold, damp winter, the old dog seemed completely superrheumatized, barely able to move without whimpering.","translation":"寒くて湿気の多い冬の後、その老犬は完全にリウマチが悪化したように見え、うめき声を上げずに動くことがほとんどできなかった。","type":"adjective","meaning_category":"Extremely affected by rheumatism."}]}