{"word":"reproductivity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"繁殖力、生殖能力","english_definition":"The capacity to reproduce; the ability to produce offspring.","examples":[{"sentence":"The reproductivity of the species is crucial for its survival.","translation":"その種の繁殖力は、その生存にとって非常に重要です。"},{"sentence":"Environmental factors can affect the reproductivity of animals.","translation":"環境要因は動物の繁殖力に影響を与える可能性があります。"},{"sentence":"Studies are being conducted to assess the reproductivity of the population.","translation":"人口の繁殖力を評価するための研究が行われています。"}],"collocations":["high reproductivity (高い繁殖力)","low reproductivity (低い繁殖力)","affect reproductivity (繁殖力に影響を与える)","assess reproductivity (繁殖力を評価する)","species reproductivity (種の繁殖力)"],"synonyms":["fertility","fecundity","procreativity","propagation","generation"],"antonyms":["infertility","sterility"]}],"etymology":{"value":"'Reproductive' + '-ity'. 'Reproductive' from 're-' (again) + 'productive' (producing).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌriːprəˌdʌkˈtɪvɪti/","syllables":"re-pro-duc-tiv-i-ty"},"inflection":{"noun_plural":"reproductivities (rarely used)"},"usage_notes":{"explanation":"'Reproductivity' refers to the inherent capacity or potential for reproduction, often considered in a biological or ecological context. It's less commonly used than 'fertility' but emphasizes the overall system or process of reproduction rather than just the ability of an individual to conceive or produce offspring.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The reproductivity of the machine was excellent.","correct":"The productivity of the machine was excellent.","note":"'Reproductivity' is typically used in biological contexts, while 'productivity' is used for machines or other non-biological systems."}],"priority":"★☆☆"},"related_words":{"derivatives":["reproduce (verb)","reproductive (adjective)","reproduction (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reproductivity' is a formal term that describes the ability of organisms to reproduce. It is often used in scientific and academic contexts when discussing populations, species, and ecosystems. The word implies a focus on the overall capacity and potential for reproduction, rather than just individual fertility."},"example_sentences":[{"sentence":"The high reproductivity of rabbits allows their populations to recover quickly after declines.","translation":"ウサギの高い繁殖力は、個体数が減少した後でも迅速に回復することを可能にします。","type":"general","meaning_category":"繁殖力"},{"sentence":"Scientists are studying the effects of pollution on the reproductivity of fish in the river.","translation":"科学者たちは、川の汚染が魚の繁殖力に与える影響を研究しています。","type":"scientific","meaning_category":"繁殖力"},{"sentence":"The reproductivity of endangered species is a major concern for conservation efforts.","translation":"絶滅危惧種の繁殖力は、保全活動における主要な懸念事項です。","type":"conservation","meaning_category":"繁殖力"}]}