{"word":"nonallelic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"非対立遺伝子の、対立遺伝子でない","english_definition":"Relating to or denoting genes that are not alleles, i.e., genes at different loci.","examples":[{"sentence":"Nonallelic genes interact to produce the phenotype.","translation":"非対立遺伝子は相互作用して表現型を生成する。"},{"sentence":"The mutation occurred in a nonallelic gene.","translation":"その変異は非対立遺伝子で発生した。"}],"collocations":["nonallelic gene","nonallelic interaction","nonallelic homologous recombination"],"synonyms":["heterologous","unlinked"],"antonyms":["allelic"]},{"part_of_speech":"adjective","definition":"(遺伝学) 異なる遺伝子座にある","english_definition":"(genetics) Located at different loci.","examples":[{"sentence":"These are nonallelic genes on different chromosomes.","translation":"これらは異なる染色体上の非対立遺伝子である。"}],"collocations":[],"synonyms":["heterotopical"],"antonyms":[]}],"etymology":{"value":"The word \"nonallelic\" is formed by adding the prefix \"non-\" (meaning \"not\") to the word \"allelic\". \"Allelic\" refers to alleles, which are different forms of a gene at the same locus. Therefore, \"nonallelic\" means \"not allelic\" or \"not at the same locus\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnəˈliːlɪk/","syllables":"non-al-lel-ic"},"inflection":{"notes":"This word is an adjective and does not have different forms for gender or number."},"usage_notes":{"explanation":"In genetics, \"nonallelic\" is used to describe genes that are not alleles of each other. Alleles are different versions of the same gene, located at the same locus (position) on a chromosome. Nonallelic genes are located at different loci, either on the same chromosome or on different chromosomes. Interactions between nonallelic genes can influence the expression of traits.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The two genes are non-allelic, meaning they are different versions of the same gene.","correct":"✓ The two genes are non-allelic, meaning they are located at different loci.","note":"Nonallelic genes are at different locations, not different versions of the same gene (that would be alleles)."}],"priority":"★★☆"},"related_words":{"derivatives":["allele","allelomorph","nonallelic interaction","nonallelic homologous recombination"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"nonallelic\" is a technical term used in genetics. It describes genes that are not alleles of each other, meaning they are located at different positions (loci) in the genome. This term is typically encountered in advanced biology or genetics contexts. Understanding this term requires a solid foundation in genetics principles.","priority":"★★☆"},"example_sentences":[{"sentence":"Nonallelic homologous recombination can lead to gene duplication.","translation":"非対立遺伝子間の相同組換えは遺伝子重複を引き起こす可能性がある。","type":"scientific","meaning_category":"Genetics"},{"sentence":"Epistasis involves interactions between nonallelic genes.","translation":"エピスタシスは非対立遺伝子間の相互作用を伴う。","type":"scientific","meaning_category":"Genetics"}]}