{"word":"Ontologistic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"存在論的な、存在論主義の","english_definition":"Relating to ontologism, a philosophical doctrine that claims we have innate knowledge of God.","examples":[{"sentence":"The ontologistic argument for the existence of God is based on the idea that we have an innate awareness of the divine.","translation":"神の存在に対する存在論的主張は、私たちが神聖なものに対する生来の認識を持っているという考えに基づいています。"}],"collocations":["ontologistic argument","ontologistic philosophy"],"synonyms":["ontological"],"antonyms":[],"notes":"Often used in the context of philosophy and theology."}],"etymology":{"value":"Derived from 'ontologism,' which combines 'ontology' (the study of being) with the suffix '-ism' (denoting a doctrine or belief).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɒntəˈlɒdʒɪstɪk","syllables":"on-to-lo-gis-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative or superlative forms (more ontologistic, most ontologistic)."},"usage_notes":{"explanation":"'Ontologistic' is primarily used in academic or philosophical discussions related to ontologism, a specific philosophical viewpoint. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist's style was very ontologistic.","correct":"✓ The artist's style was very abstract.","note":"'Ontologistic' refers to a philosophical doctrine, not artistic style. Use 'abstract' or another appropriate term for art."}],"priority":"★☆☆"},"related_words":{"derivatives":["ontologism (noun)","ontology (noun)"],"related_terms":["epistemology","metaphysics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'ontologistic' is a highly specialized term primarily used within the fields of philosophy and theology. It describes something related to ontologism, which is the philosophical belief that humans possess innate knowledge of God. Due to its specific and technical nature, it is not commonly encountered outside of academic contexts."},"example_sentences":[{"sentence":"The philosopher critiqued the ontologistic tendencies in modern theology.","translation":"その哲学者は、現代神学における存在論主義的な傾向を批判した。","type":"general","meaning_category":"philosophical criticism"},{"sentence":"Some argue that the concept of inherent human rights has ontologistic underpinnings.","translation":"固有の人権という概念は、存在論主義的な基盤を持っていると主張する人もいる。","type":"general","meaning_category":"philosophical argument"}]}