{"word":"subcortical","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"皮質下の、大脳皮質下の","english_definition":"Relating to or denoting the region or structures of the brain immediately below the cerebral cortex.","examples":[{"sentence":"Subcortical structures play a crucial role in motor control.","translation":"皮質下の構造は運動制御において重要な役割を果たす。"},{"sentence":"Subcortical dementia can present with different symptoms than cortical dementia.","translation":"皮質下性認知症は皮質性認知症とは異なる症状を呈することがある。"},{"sentence":"The basal ganglia are subcortical nuclei involved in a variety of functions.","translation":"基底核は、さまざまな機能に関与する皮質下の神経核である。"}],"collocations":["subcortical brain regions","subcortical structures","subcortical nuclei","subcortical dementia","subcortical white matter","subcortical gray matter"],"synonyms":["diencephalic","basal","deep brain"],"antonyms":["cortical","supratentorial"]}],"etymology":{"value":"From the prefix 'sub-' (meaning 'below' or 'under') combined with 'cortical' (relating to the cortex).","priority":"★★★"},"pronunciation":{"ipa":"/sʌbˈkɔːrtɪkəl/","syllables":"sub-cor-ti-cal"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Subcortical' refers specifically to brain structures located beneath the cerebral cortex. These structures include, but are not limited to, the basal ganglia, thalamus, hypothalamus, and parts of the brainstem. Understanding the location and function of subcortical regions is important in neurology and neuroscience.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The subcortical is responsible for higher cognitive functions.","correct":"✓ Subcortical structures are responsible for basic functions like motor control and reward.","note":"While subcortical structures contribute to cognition, higher cognitive functions are primarily associated with the cerebral cortex."},{"incorrect":"✗ Subcortical refers to the outer layer of the brain.","correct":"✓ Subcortical refers to the structures beneath the outer layer of the brain (the cortex).","note":"The cortex is the outer layer; subcortical is below it."}],"priority":"★★☆"},"related_words":{"derivatives":["subcortex (noun): The region of the brain beneath the cerebral cortex."],"related_terms":["cortex","cerebral cortex","basal ganglia","thalamus","hypothalamus","brainstem","neural","neurology","neuroscience"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Subcortical' is a term used in neuroscience and neurology to describe areas of the brain located beneath the cerebral cortex. These areas include structures like the basal ganglia, thalamus, and hypothalamus, which are involved in various functions such as motor control, emotion, and basic physiological regulation. The word is mainly encountered in academic or medical contexts when discussing brain anatomy and function."},"example_sentences":[{"sentence":"Damage to subcortical areas can result in movement disorders.","translation":"皮質下領域の損傷は運動障害を引き起こす可能性がある。","type":"general","meaning_category":"General"},{"sentence":"The study examined the role of subcortical pathways in reward processing.","translation":"その研究は、報酬処理における皮質下経路の役割を調査した。","type":"research","meaning_category":"Research"},{"sentence":"Subcortical vascular dementia is associated with white matter lesions.","translation":"皮質下血管性認知症は白質病変と関連している。","type":"medical","meaning_category":"Medical"}]}