{"word":"Half-lop","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ハーフロップ (片方の耳が立ち、もう片方の耳が垂れているウサギの種類)","english_definition":"A breed of domestic rabbit characterized by one ear being erect while the other hangs down.","examples":[{"sentence":"She owns a charming Half-lop rabbit named Miffy.","translation":"彼女はミッフィーという名前のかわいいハーフロップのウサギを飼っています。"},{"sentence":"Half-lops are known for their gentle and friendly temperament.","translation":"ハーフロップは穏やかで友好的な性格で知られています。"}],"collocations":["own a Half-lop","Half-lop rabbit","Half-lop breed"],"synonyms":["lop-eared rabbit (general term for rabbits with drooping ears)"],"antonyms":[]}],"etymology":{"value":"The name 'Half-lop' describes the rabbit's distinctive ear carriage, where one ear stands erect and the other 'lops' or hangs down. It's a descriptive term combining 'half' and 'lop-eared'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhæf ˈlɒp/","syllables":"half-lop"},"inflection":{"noun_plural":"Half-lops"},"usage_notes":{"explanation":"'Half-lop' is a specific breed name, so it's capitalized. The term refers to the unique ear position that defines this type of rabbit.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a half lop rabbit.","correct":"✓ I saw a Half-lop rabbit.","note":"The breed name 'Half-lop' is a proper noun and should be capitalized."}],"priority":"★★☆"},"related_words":{"derivatives":["lop (verb: to hang down)","lop-eared (adjective: having drooping ears)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specific breed name, not general vocabulary)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Half-lop' refers to a specific breed of rabbit that has a characteristic ear position: one ear stands up while the other hangs down. It's a relatively uncommon term, mainly used by rabbit enthusiasts or those involved in animal breeding. Therefore, understanding this word is more relevant if you have a specific interest in rabbits or animal breeds.","priority":"★★☆"},"example_sentences":[{"sentence":"The child was delighted to receive a fluffy Half-lop as a pet.","translation":"その子供はふわふわのハーフロップをペットとしてもらって大喜びした。","type":"noun","meaning_category":"rabbit breed"},{"sentence":"The breeder specializes in raising show-quality Half-lops.","translation":"そのブリーダーはショーに出せる品質のハーフロップの飼育を専門としている。","type":"noun","meaning_category":"rabbit breed"}]}