{"word":"innatist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"生得説論者、生得説を信奉する人","english_definition":"A person who believes in innatism; someone who believes that the mind is born with ideas or knowledge and is therefore not a 'blank slate' at birth.","examples":[{"sentence":"The debate between empiricists and innatists has been central to the philosophy of mind.","translation":"経験論者と生得説論者の間の議論は、心の哲学の中心となってきた。"},{"sentence":"As an innatist, she argued that certain moral principles are innate to human beings.","translation":"生得説論者として、彼女は特定の道徳的原則は人間に生得的に備わっていると主張した。"}],"collocations":["classical innatist","modern innatist","linguistic innatist"],"synonyms":["nativist"],"antonyms":["empiricist","behaviorist"]},{"part_of_speech":"adjective","definition":"生得説の、生得説的な","english_definition":"Relating to or characteristic of innatism; based on the belief that certain ideas or knowledge are innate.","examples":[{"sentence":"The innatist theory of language acquisition suggests that humans have a built-in capacity for learning language.","translation":"言語習得の生得説的理論は、人間は言語を学習するための生来の能力を持っていることを示唆している。"},{"sentence":"He presented an innatist argument for the existence of universal moral values.","translation":"彼は普遍的な道徳的価値の存在について、生得説的な議論を展開した。"}],"collocations":["innatist theory","innatist view","innatist perspective","innatist approach"],"synonyms":["nativistic"],"antonyms":["empirical","behavioral"]}],"etymology":{"value":"From 'innate' (existing from birth) + '-ist' (a person who believes in or advocates something).","priority":"★★★"},"pronunciation":{"ipa":"ˈɪnətɪst","syllables":"in-na-tist"},"inflection":{"noun_plural":"innatists"},"usage_notes":{"explanation":"The term 'innatist' is primarily used in philosophy, psychology, and linguistics to refer to someone who believes in or supports the theory of innatism. Innatism posits that the mind is not a blank slate (tabula rasa) at birth but rather comes equipped with certain pre-existing ideas, knowledge, or capacities. The opposite of innatism is empiricism, which argues that knowledge comes primarily from sensory experience.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an innate.","correct":"✓ He is an innatist.","note":"'Innate' is an adjective, while 'innatist' is the noun referring to a person who believes in innatism."},{"incorrect":"✗ The innatist theory believes that all knowledge is innate.","correct":"✓ The innatist theory posits that some knowledge is innate.","note":"Innatism doesn't claim *all* knowledge is innate, but that some fundamental ideas or capacities are present from birth."}],"priority":"★★☆"},"related_words":{"derivatives":["innate (adjective)","innately (adverb)","innateness (noun)"],"related_terms":["nativism (noun)","empiricism (noun)","rationalism (noun)","tabula rasa (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'innatist' refers to someone who believes in innatism, a philosophical and psychological theory that suggests the mind is born with certain innate ideas or knowledge. This contrasts with empiricism, which emphasizes the role of experience in acquiring knowledge. The word is primarily used in academic discussions related to the nature of knowledge and the mind."},"example_sentences":[{"sentence":"Many linguists are innatists, believing that humans have a built-in language acquisition device.","translation":"多くの言語学者は生得説論者であり、人間は生来の言語習得装置を持っていると信じている。","type":"noun","meaning_category":"生得説論者"},{"sentence":"The innatist perspective on morality suggests that some moral principles are universal and not learned.","translation":"道徳に関する生得説的な見方は、いくつかの道徳的原則は普遍的であり、学習されるものではないことを示唆している。","type":"adjective","meaning_category":"生得説の"}]}