{"word":"chemotactic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"走化性のある、化学走性を示す","english_definition":"relating to or exhibiting chemotaxis","examples":[{"sentence":"The chemotactic response of neutrophils is essential for fighting infection.","translation":"好中球の走化性反応は感染症と闘うために不可欠である。"},{"sentence":"Chemotactic factors attract immune cells to the site of inflammation.","translation":"走化性因子は炎症部位に免疫細胞を引き寄せる。"}],"collocations":["chemotactic factor","chemotactic gradient","chemotactic activity","chemotactic response"],"synonyms":["chemoattractant","chemoattractive"],"antonyms":["chemokinetic","chemorepellent"]}],"etymology":{"value":"\"Chemotactic\" is derived from the combination of \"chemo-\" (referring to chemicals) and \"tactic\" (referring to movement or arrangement in response to a stimulus). The term reflects the process by which cells move in response to a chemical stimulus.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkiːmoʊˈtæktɪk/","syllables":"ke-mo-tak-tic"},"inflection":{"notes":"This word does not have typical inflections as it is an adjective."},"usage_notes":{"explanation":"\"Chemotactic\" describes something that exhibits or relates to chemotaxis, which is the movement of an organism or cell in response to a chemical stimulus. This is a crucial process in biology, especially in immune responses, where cells move towards areas with specific chemical signals, such as sites of infection or inflammation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell was chemotaxis.","correct":"✓ The cell was chemotactic.","note":"\"Chemotaxis\" is the noun (the process), while \"chemotactic\" is the adjective (describing something that exhibits chemotaxis)."},{"incorrect":"✗ The chemotactic is important.","correct":"✓ The chemotactic response is important.","note":"\"Chemotactic\" is an adjective and needs to be followed by a noun. Using \"chemotactic\" alone is grammatically incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["chemotaxis (noun)"],"phrasal_verbs":[],"related_terms":["chemoattractant","chemorepellent","chemokine"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"chemotactic\" is a specialized term used in biology, particularly in the context of cell biology and immunology. It describes the property of a substance or cell that causes movement in response to a chemical stimulus. Understanding this term requires familiarity with basic biological concepts such as cells, chemical signals, and movement. It's primarily encountered in scientific literature and advanced biology courses."},"example_sentences":[{"sentence":"The researchers studied the chemotactic behavior of cancer cells.","translation":"研究者たちは癌細胞の走化性挙動を研究した。","type":"scientific","meaning_category":"走化性のある"},{"sentence":"Certain bacteria exhibit strong chemotactic responses to specific nutrients.","translation":"特定の細菌は特定の栄養素に対して強い走化性反応を示す。","type":"scientific","meaning_category":"走化性を示す"}]}