{"word":"codebtor","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"共同債務者","english_definition":"A person who is jointly liable for a debt.","examples":[{"sentence":"My mother had to sign as a codebtor for my student loan.","translation":"私の母は、私の学生ローンの共同債務者として署名しなければなりませんでした。"},{"sentence":"The bank required a codebtor before approving the loan.","translation":"銀行は融資を承認する前に共同債務者を要求しました。"}],"collocations":["sign as a codebtor","require a codebtor","become a codebtor"],"synonyms":["cosigner","guarantor","joint debtor"],"antonyms":["debtor","creditor"]}],"etymology":{"value":"The word \"codebtor\" is formed by combining the prefix \"co-\" (meaning \"joint\" or \"together\") with the word \"debtor\" (a person who owes money).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊˈdɛtər/","syllables":"co-debt-or"},"inflection":{"noun_plural":"codebtors"},"usage_notes":{"explanation":"A \"codebtor\" shares the responsibility for a debt with the primary debtor. If the primary debtor fails to make payments, the codebtor becomes liable for the debt.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am a co-debtor for my friend's house.","correct":"✓ I am a codebtor for my friend's house.","note":"The correct spelling is 'codebtor', not 'co-debtor'."},{"incorrect":"✗ The bank asked for a co-signer, not a codebtor.","correct":"✓ The bank asked for a cosigner, not a codebtor.","note":"While 'cosigner' and 'codebtor' are similar, a codebtor has equal responsibility for the debt from the start, whereas a cosigner may only become responsible if the primary debtor defaults."}],"priority":"★★☆"},"related_words":{"derivatives":["debtor","debt","codebt","co-sign"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"codebtor\" refers to someone who is jointly responsible for a debt alongside the primary borrower. This means that if the primary borrower cannot repay the debt, the codebtor is legally obligated to do so. Understanding the legal and financial implications of being a codebtor is crucial before entering into such an agreement. This term is commonly used in legal and financial contexts."},"example_sentences":[{"sentence":"As a codebtor, you are equally responsible for repaying the loan.","translation":"共同債務者として、あなたはローンの返済に対して平等に責任があります。","type":"general","meaning_category":"general"},{"sentence":"The lender required a creditworthy codebtor to secure the loan.","translation":"貸し手は、ローンを確保するために信用できる共同債務者を要求しました。","type":"finance","meaning_category":"finance"},{"sentence":"Before agreeing to be a codebtor, consider the potential risks involved.","translation":"共同債務者になることに同意する前に、伴う潜在的なリスクを考慮してください。","type":"advice","meaning_category":"advice"}]}