{"word":"superrefraction","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"超屈折：大気中の異常な屈折現象で、電波や光が通常よりも大きく曲げられること。これにより、電波や光が地平線よりも遠くまで届くことがある。","english_definition":"An atmospheric condition in which radio waves or light rays are bent more than normal, allowing them to travel much farther than usual.","examples":[{"sentence":"Superrefraction caused the radar to detect ships far beyond the horizon.","translation":"超屈折により、レーダーは地平線のはるか向こうの船を検出した。"},{"sentence":"The phenomenon of superrefraction can affect the performance of communication systems.","translation":"超屈折の現象は、通信システムの性能に影響を与える可能性がある。"}],"collocations":["atmospheric superrefraction","radar superrefraction","duct superrefraction"],"synonyms":["anomalous propagation","atmospheric ducting"],"antonyms":["subrefraction"]}],"etymology":{"value":"\"super-\"（超える）+ \"refraction\"（屈折）の組み合わせ。","priority":"★★★"},"pronunciation":{"ipa":"ˌsuːpərəˈfrækʃən","syllables":"su-per-re-frac-tion"},"inflection":{"noun_plural":"superrefractions"},"usage_notes":{"explanation":"Superrefractionは、通常、気温や湿度の急激な変化によって大気中に屈折率の勾配が生じる場合に発生します。特に、海面や砂漠などの上空で発生しやすいです。この現象は、レーダーや無線通信などの電波伝搬に影響を与えるため、気象学や通信工学の分野で重要視されています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Superrefraction is when light bends less than usual.","correct":"✓ Superrefraction is when light bends more than usual.","note":"Superrefractionは、光が通常よりも多く曲がる現象です。"},{"incorrect":"✗ Superrefraction only affects visible light.","correct":"✓ Superrefraction can affect both light and radio waves.","note":"Superrefractionは、光だけでなく電波にも影響を与えます。"}],"priority":"★★☆"},"related_words":{"derivatives":["superrefractive (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Superrefraction\" is a technical term used in meteorology and telecommunications to describe a specific type of atmospheric refraction. It refers to the bending of electromagnetic waves, such as radio waves or light, to a greater extent than normal due to unusual atmospheric conditions. This can cause signals to travel farther than they normally would. Understanding this term requires knowledge of basic physics concepts related to refraction and wave propagation.","priority":"★★☆"},"example_sentences":[{"sentence":"The extended range of the radar was attributed to superrefraction in the lower atmosphere.","translation":"レーダーの拡張された範囲は、下層大気中の超屈折に起因すると考えられた。","type":"noun","meaning_category":"超屈折"},{"sentence":"Superrefraction can lead to anomalous propagation of radio signals.","translation":"超屈折は、電波の異常伝搬を引き起こす可能性がある。","type":"noun","meaning_category":"超屈折"}]}