{"word":"sawfish","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ノコギリエイ","english_definition":"A ray-like fish with a long, flattened snout edged with sharp teeth, resembling a saw.","examples":[{"sentence":"The sawfish uses its saw-like snout to stir up sediment and detect prey.","translation":"ノコギリエイは、ノコギリのような吻を使って堆積物をかき混ぜ、獲物を探知します。"},{"sentence":"Sawfish are critically endangered due to habitat loss and overfishing.","translation":"ノコギリエイは、生息地の喪失と乱獲により、絶滅危惧種に指定されています。"}],"collocations":["endangered sawfish (絶滅危惧種のノコギリエイ)","sawfish habitat (ノコギリエイの生息地)","sawfish rostrum (ノコギリエイの吻)"],"synonyms":["carpenter shark"],"antonyms":[]}],"etymology":{"value":"The name \"sawfish\" comes from the saw-like appearance of the fish's rostrum.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɔːfɪʃ/","syllables":"saw-fish"},"inflection":{"noun_plural":"sawfish (通常複数形は sawfish)"},"usage_notes":{"explanation":"Sawfish are a type of ray, not a shark, despite their appearance. The \"saw\" (rostrum) is used for both hunting and defense. All species of sawfish are endangered.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a sawfish in the aquarium with a saw.","correct":"✓ I saw a sawfish in the aquarium.","note":"Sawfish are defined by their saw-like rostrum, so mentioning 'a saw' is redundant."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度 (Low frequency)"},"readability_explanation":{"level":"B2","text":"The term \"sawfish\" refers to a type of ray characterized by a distinctive, saw-like projection (rostrum) extending from its snout. These fish are critically endangered and primarily found in tropical and subtropical waters. Understanding the term requires knowledge of marine biology and conservation efforts.","priority":"★★★"},"example_sentences":[{"sentence":"The **sawfish** uses its rostrum to detect electrical signals from prey hidden in the sand.","translation":"ノコギリエイは、吻を使って砂の中に隠れた獲物からの電気信号を探知します。","type":"noun","meaning_category":"description"},{"sentence":"Conservation efforts are crucial to protect the remaining populations of **sawfish**.","translation":"ノコギリエイの残りの個体数を保護するためには、保護活動が不可欠です。","type":"noun","meaning_category":"conservation"}]}