{"word":"planipennine","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"having straight wings with many cross veins, especially of the lacewing family.","english_definition":"Relating to insects having wings with a netlike venation, especially those of the order Neuroptera (formerly Planipennia).","examples":[{"sentence":"Planipennine insects are often beneficial predators in gardens and agricultural settings.","translation":"アミメカゲロウ類の昆虫は、庭や農業環境において有益な捕食者であることが多い。"}],"collocations":["planipennine insect","planipennine wings"],"synonyms":["net-winged","neuropterous"],"antonyms":[]}],"etymology":{"value":"From Latin *plani-* (flat) + *penna* (wing) + *-ine* (suffix indicating belonging or resemblance).","priority":"★★☆"},"pronunciation":{"ipa":"ˌplænɪˈpɛnaɪn","syllables":"pla-ni-pen-nine"},"inflection":{"notes":"This word does not have common inflections beyond its adjective form."},"usage_notes":{"explanation":"The term \"planipennine\" is primarily used in entomology to describe insects with a specific wing structure. It is often used synonymously with \"neuropterous,\" although the latter is a broader term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The planipennine bird flew across the sky.","correct":"✓ The planipennine insect flew across the garden.","note":"Planipennine refers to insects, not birds."}],"priority":"★☆☆"},"related_words":{"derivatives":["Planipennia (former taxonomic order)","Neuroptera (current taxonomic order)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Specialized term in entomology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"planipennine\" is a specialized term used in entomology to describe insects with net-like wings. It is not a common word and is primarily used in scientific contexts. Understanding requires knowledge of insect anatomy and taxonomic classification."},"example_sentences":[{"sentence":"The delicate venation of the planipennine wings is a key characteristic of this insect group.","translation":"アミメカゲロウ類の翅の繊細な翅脈は、この昆虫群の重要な特徴である。","type":"adjective","meaning_category":"descriptive"},{"sentence":"Many planipennine larvae are voracious predators of aphids and other small insects.","translation":"多くのアミメカゲロウ類の幼虫は、アブラムシやその他の小さな昆虫を貪欲に捕食する。","type":"adjective","meaning_category":"descriptive"}]}