{"word":"cave-lodged","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Living or situated in a cave.","english_definition":"Dwelling or situated within a cave.","examples":[{"sentence":"The cave-lodged hermit had not seen another human in decades.","translation":"洞窟に住む隠者は、数十年間他の人間を見ていなかった。"},{"sentence":"Cave-lodged bats are an important part of the local ecosystem.","translation":"洞窟に住むコウモリは、地域の生態系において重要な役割を果たしている。"}],"collocations":["cave-lodged bats","cave-lodged hermit","cave-lodged creatures"],"synonyms":["cave-dwelling","cave-inhabiting","troglodytic"],"antonyms":["surface-dwelling","open-air"],"notes":["This word is relatively uncommon and often used in descriptive or literary contexts."]}],"etymology":{"value":"A compound word formed by combining 'cave' (referring to a hollow underground chamber) and 'lodged' (past participle of 'lodge', meaning to reside or be situated).","priority":"N/A"},"pronunciation":{"ipa":"/ˈkeɪvˌlɒdʒd/","syllables":"cave-lodged"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms, which are not typically applicable to this word."},"usage_notes":{"explanation":"The term 'cave-lodged' is used to describe something that lives or is situated inside a cave. It suggests a more permanent or habitual residence within the cave environment, rather than a temporary or accidental occurrence. It is often used in ecological or descriptive contexts to highlight the specific habitat of certain organisms or individuals.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The cave lodged was dark.","correct":"✓ The cave was dark.","note":"'cave-lodged' is an adjective and must modify a noun. The sentence should be restructured to use it correctly."}],"priority":"N/A"},"related_words":{"derivatives":["cave","lodge","lodged"],"phrasal_verbs":[],"related_terms":["cave dweller","troglodyte","speleology"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'cave-lodged' is a relatively uncommon compound adjective used to describe something that lives or is situated inside a cave. It combines the familiar words 'cave' and 'lodged' to create a more descriptive and specific term. Understanding the meaning of the individual words helps to decipher the meaning of the compound word. It is primarily used in descriptive or scientific contexts."},"example_sentences":[{"sentence":"The scientists studied the unique ecosystem of cave-lodged spiders.","translation":"科学者たちは、洞窟に生息するユニークなクモの生態系を研究した。","type":"adjective","meaning_category":"Living in a cave"},{"sentence":"The cave-lodged community developed its own unique customs and traditions.","translation":"洞窟に住むコミュニティは、独自の習慣や伝統を発展させた。","type":"adjective","meaning_category":"Situated in a cave"}]}