{"word":"Khilafat","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"カリフ制：イスラム教のウンマ（共同体）の指導者であるカリフによって統治されるイスラム国家の制度または時代。また、カリフの地位または権威。","english_definition":"The system or era of Islamic rule under a caliph, the leader of the Muslim Ummah (community). Also, the office or authority of a caliph.","examples":[{"sentence":"The Ottoman Empire claimed the Khilafat for centuries.","translation":"オスマン帝国は何世紀にもわたってカリフ制を主張した。"},{"sentence":"The abolition of the Khilafat in 1924 was a significant event in Islamic history.","translation":"1924年のカリフ制の廃止は、イスラム史における重要な出来事だった。"}],"collocations":["Khilafat Movement (カリフ制擁護運動)","abolition of the Khilafat (カリフ制の廃止)","claim the Khilafat (カリフ制を主張する)"],"synonyms":["Caliphate","Islamic Caliphate"],"antonyms":[]}],"etymology":{"value":"アラビア語の「خلافة (khilāfa)」に由来し、「後継、代理」を意味する。預言者ムハンマドの後継者としてのカリフの地位を示す。","priority":"中"},"pronunciation":{"ipa":"/kɪˈlɑːfæt/","syllables":"Khi-la-fat"},"inflection":{"notes":"可算名詞"},"usage_notes":{"explanation":"「Khilafat」は、イスラム教の歴史と政治において重要な概念です。カリフは、イスラム教徒の共同体の宗教的・政治的指導者であり、預言者ムハンマドの後継者とみなされます。カリフ制は、イスラム世界の統一と指導を象徴するものでしたが、歴史を通じて様々な王朝や国家によって主張され、その権威や範囲は時代によって大きく異なりました。20世紀初頭のカリフ制擁護運動（Khilafat Movement）は、第一次世界大戦後のオスマン帝国の解体に対するインドのイスラム教徒の抗議運動として知られています。","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"✗ The Khilafat was a democratic government.","correct":"✓ The Khilafat was a form of Islamic rule, not necessarily democratic.","note":"カリフ制は必ずしも民主的な政府形態ではありません。"},{"incorrect":"✗ Khilafat still exists today in many countries.","correct":"✓ The Khilafat was abolished in 1924, and does not exist as a unified political entity today.","note":"カリフ制は1924年に廃止され、現代では統一された政治組織としては存在しません。"}],"priority":"中"},"related_words":{"derivatives":["Caliph (カリフ)","Caliphate (カリフ制)"],"phrasal_verbs":[],"priority":"高"},"level_frequency":{"CEFR":"不明","frequency_google_ngram":"低い","priority":"低"},"readability_explanation":{"level":"C1","text":"「Khilafat」は、イスラム史におけるカリフ制を指す専門用語です。カリフはイスラム教徒共同体の指導者であり、カリフ制はイスラム世界の政治的・宗教的統一を象徴するものでした。この用語は、イスラム史、政治学、国際関係などの文脈で現れることがあります。理解するには、イスラム教の歴史的背景とカリフ制の役割に関する知識が必要です。"},"example_sentences":[{"sentence":"The Khilafat Movement aimed to preserve the Ottoman Caliphate after World War I.","translation":"カリフ制擁護運動は、第一次世界大戦後のオスマン帝国のカリフ制を維持することを目的としていた。","type":"noun","meaning_category":"カリフ制"},{"sentence":"The concept of the Khilafat has been interpreted in various ways throughout Islamic history.","translation":"カリフ制の概念は、イスラム史を通じて様々な解釈がなされてきた。","type":"noun","meaning_category":"カリフ制"}]}