{"word":"unhospitalized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"入院していない、病院に収容されていない","english_definition":"Not admitted to or treated in a hospital.","examples":[{"sentence":"The patient was treated as an outpatient and remained unhospitalized.","translation":"その患者は外来患者として治療を受け、入院せずに済んだ。"},{"sentence":"Many people with mild symptoms of the disease remain unhospitalized.","translation":"その病気の軽度の症状を持つ多くの人々は、入院せずに済んでいる。"}],"collocations":["remain unhospitalized","be unhospitalized"],"synonyms":["nonhospitalized","outpatient"],"antonyms":["hospitalized","inpatient"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to the word 'hospitalized'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnhɒspɪtəlaɪzd/","syllables":"un-hos-pi-tal-ized"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more unhospitalized, most unhospitalized), though these are rare."},"usage_notes":{"explanation":"'Unhospitalized' is typically used to describe a patient or individual who does not require or has not undergone admission to a hospital for treatment. It is often used in medical contexts to differentiate between patients receiving inpatient care versus outpatient or home-based care.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is unhospital.","correct":"✓ He is unhospitalized.","note":"'Unhospital' is not a correct word. The correct adjective form is 'unhospitalized'."},{"incorrect":"✗ The unhospitalized patient was sent home.","correct":"✓ The unhospitalized patient was sent home.","note":"The sentence is grammatically correct, but it's important to ensure the context is clear. It should be evident that the patient was indeed unhospitalized at the time of being sent home."}],"priority":"★★☆"},"related_words":{"derivatives":["hospitalize (verb)","hospitalization (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unhospitalized' is a relatively uncommon term, primarily used in medical or healthcare contexts. It describes the state of not being admitted to a hospital. The prefix 'un-' negates the meaning of 'hospitalized,' making it straightforward to understand if one is familiar with the base word. The term is most likely to be encountered in discussions about healthcare capacity, treatment protocols, or patient statistics."},"example_sentences":[{"sentence":"The government aims to keep as many patients as possible unhospitalized through effective community care programs.","translation":"政府は、効果的な地域ケアプログラムを通じて、できるだけ多くの患者を入院させないようにすることを目指しています。","type":"adjective","meaning_category":"Not admitted to a hospital"},{"sentence":"Despite the severity of his symptoms, he remained unhospitalized due to a lack of available beds.","translation":"彼の症状の重さにもかかわらず、利用可能なベッドが不足していたため、彼は入院せずに済んだ。","type":"adjective","meaning_category":"Not treated in a hospital"}]}