{"word":"Apollinian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アポロン的な、アポロンに由来する、アポロンの性質を持つ","english_definition":"relating to or characteristic of Apollo or the qualities associated with him (such as reason, order, harmony, and light).","examples":[{"sentence":"The Apollinian spirit emphasizes reason and order.","translation":"アポロン的な精神は、理性と秩序を強調する。"},{"sentence":"His art reflects an Apollinian aesthetic.","translation":"彼の芸術はアポロン的な美学を反映している。"}],"collocations":["Apollinian art (アポロン的な芸術)","Apollinian spirit (アポロン的な精神)","Apollinian ideal (アポロン的な理想)"],"synonyms":["classical","rational","harmonious","ordered","balanced"],"antonyms":["Dionysian","irrational","chaotic","disordered"]},{"part_of_speech":"adjective","definition":"(ニーチェ哲学において) 理性、秩序、形式美を重んじる","english_definition":"(in Nietzschean philosophy) representing the rational, ordered, and formally beautiful aspects of human nature and art.","examples":[{"sentence":"Nietzsche contrasted the Apollinian with the Dionysian.","translation":"ニーチェはアポロン的なものとディオニュソス的なものを対比させた。"},{"sentence":"The Apollinian seeks to control the chaotic forces of life.","translation":"アポロン的なものは、人生の混沌とした力を制御しようとする。"}],"collocations":["Apollinian and Dionysian (アポロン的とディオニュソス的)","Apollinian impulse (アポロン的な衝動)","Apollinian worldview (アポロン的な世界観)"],"synonyms":["rational","ordered","formal","controlled"],"antonyms":["Dionysian","irrational","chaotic","uncontrolled"]}],"etymology":{"value":"Derived from Apollo, the Greek god of light, music, healing, and reason. The term gained philosophical significance through the writings of Friedrich Nietzsche, particularly in his book *The Birth of Tragedy*.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæpəˈlɪniən/","syllables":"A-pol-li-ni-an"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more Apollinian' and 'most Apollinian', respectively."},"usage_notes":{"explanation":"The term \"Apollinian\" is most often encountered in discussions of art, philosophy, and literature, particularly in the context of Friedrich Nietzsche's theories. It represents the side of human nature that values reason, order, and control, as opposed to the Dionysian, which emphasizes passion, chaos, and instinct.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was very Apollonian in his dancing.","correct":"✓ His dancing had an Apollinian quality.","note":"While technically correct, it's more common to say that something *has* an Apollinian quality or reflects an Apollinian spirit, rather than directly describing a person as Apollonian."},{"incorrect":"✗ The Apollinian is about being happy and joyful.","correct":"✓ The Apollinian is about reason, order, and form.","note":"The Apollinian is not simply about happiness, but about a specific kind of aesthetic and philosophical ideal rooted in reason and order."}],"priority":"★★☆"},"related_words":{"derivatives":["Apollonianism (名詞: アポロン主義)"],"related_terms":["Dionysian (ディオニュソス的な)","Nietzschean (ニーチェ的な)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (専門的な文脈でのみ使用される)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Apollinian\" is a relatively rare and sophisticated term primarily used in the context of philosophy, art criticism, and literary analysis. Understanding its meaning requires familiarity with Greek mythology (specifically the god Apollo) and, ideally, the philosophical concepts developed by Friedrich Nietzsche. It is not a word commonly encountered in everyday conversation or general reading material.","priority":"★★☆"},"example_sentences":[{"sentence":"The architecture of the building reflects an Apollinian sense of balance and proportion.","translation":"その建物の建築は、アポロン的なバランスとプロポーションの感覚を反映している。","type":"adjective","meaning_category":"アポロン的な性質を持つ"},{"sentence":"Nietzsche argued that Western culture had become overly Apollinian, suppressing the vital Dionysian forces.","translation":"ニーチェは、西洋文化は過度にアポロン的になり、重要なディオニュソス的な力を抑圧していると主張した。","type":"adjective","meaning_category":"(ニーチェ哲学において) 理性、秩序、形式美を重んじる"}]}