{"word":"moisture-dependent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"水分依存性の、湿度依存性の","english_definition":"Relying on or affected by the amount of moisture present.","examples":[{"sentence":"The germination of these seeds is moisture-dependent; they need consistent dampness to sprout.","translation":"これらの種子の発芽は水分依存性であり、発芽には一定の湿り気が必要です。"},{"sentence":"The strength of the adhesive is moisture-dependent, performing best in humid conditions.","translation":"この接着剤の強度は湿度依存性であり、湿気の多い環境で最高の性能を発揮します。"},{"sentence":"Certain molds are moisture-dependent and thrive in damp environments.","translation":"特定のカビは水分依存性であり、湿った環境で繁殖します。"}],"collocations":["moisture-dependent process","moisture-dependent behavior","moisture-dependent properties","moisture-dependent resistance"],"synonyms":["humidity-sensitive","water-dependent","hygroscopic"],"antonyms":["moisture-resistant","water-repellent","hydrophobic"]}],"etymology":{"value":"The word is formed by combining 'moisture' (the presence of water in the air or a substance) with 'dependent' (relying on or determined by something).","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɔɪstʃər dɪˈpɛndənt/","syllables":"mois-ture-de-pen-dent"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Moisture-dependent' is typically used in scientific, agricultural, or technical contexts to describe materials, processes, or organisms whose characteristics or behavior are influenced by the level of moisture in their environment. It is important to specify the range of moisture levels that are relevant for the specific application or context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The plant is moisture-dependent, so it doesn't need water.","correct":"The plant is moisture-dependent, so it needs consistent watering.","note":"Moisture-dependent means that it relies on moisture, not that it doesn't need it."},{"incorrect":"This electronic device is moisture-dependent and can be used underwater.","correct":"This electronic device is not moisture-dependent and can be used underwater.","note":"Electronic devices that can be used underwater are typically moisture-resistant or waterproof, not moisture-dependent."}],"priority":"★★☆"},"related_words":{"derivatives":["moisture (noun)","dependent (adjective)","dependence (noun)"],"phrasal_verbs":[],"related_terms":["humidity","hygroscopic","hydroscopic","water content","moisture content"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'moisture-dependent' is a technical term used to describe something that relies on or is affected by the amount of moisture present. It is often used in scientific or technical contexts, such as agriculture, materials science, or environmental science. Understanding this term requires a good grasp of vocabulary related to moisture and dependence."},"example_sentences":[{"sentence":"The electrical conductivity of the soil is moisture-dependent.","translation":"土壌の電気伝導率は水分依存性です。","type":"general","meaning_category":"general usage"},{"sentence":"The enzyme's activity is highly moisture-dependent, requiring a specific water activity level for optimal function.","translation":"その酵素の活性は高度に水分依存性であり、最適な機能のために特定の水分活性レベルが必要です。","type":"scientific","meaning_category":"scientific context"},{"sentence":"The expansion and contraction of the wood are moisture-dependent, which must be considered in construction.","translation":"木材の膨張と収縮は水分依存性であり、建設において考慮する必要があります。","type":"technical","meaning_category":"technical context"}]}