{"word":"Apism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The condition of being stung by bees.","english_definition":"A condition resulting from bee stings, often involving local pain, swelling, and in severe cases, allergic reactions.","examples":[{"sentence":"He suffered from apism after disturbing a beehive.","translation":"彼は蜂の巣を刺激した後、蜂に刺されて苦しんだ。"},{"sentence":"Apism can be a serious concern for individuals with bee allergies.","translation":"蜂アレルギーを持つ人にとって、蜂刺されは深刻な懸念事項となりうる。"}],"collocations":["severe apism","mild apism","treat apism","suffer from apism"],"synonyms":["bee sting","bee attack","melittophobia (fear of bees, leading to avoidance and potential apism)"],"antonyms":["bee-free","unbitten","protected from bees"]}],"etymology":{"value":"Derived from the Latin word 'apis' meaning 'bee' and the suffix '-ism' indicating a condition or state.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeɪpɪzəm/","syllables":"A-pism"},"inflection":{"noun_plural":"apisms"},"usage_notes":{"explanation":"'Apism' specifically refers to the state of being stung by bees. It is not a commonly used term in everyday conversation, but it may appear in medical or scientific contexts. The severity of apism varies depending on the number of stings and the individual's sensitivity to bee venom.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has apism because he likes bees.","correct":"✓ He has apism because he was stung by bees.","note":"Apism is the condition of being stung by bees, not liking them."},{"incorrect":"✗ Apism is a disease caused by bees.","correct":"✓ Apism is a condition caused by bee stings.","note":"Apism is not a disease but a condition resulting from bee stings."}],"priority":"★★☆"},"related_words":{"derivatives":["apitherapy (medical use of bee venom)","apiary (a place where bees are kept)","apiculture (beekeeping)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Very rare, technical term)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Apism' is a specialized term referring to the condition of being stung by bees. It is primarily used in medical or scientific contexts to describe the symptoms and effects of bee stings. Understanding this term requires a high level of vocabulary and familiarity with technical language. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The doctor diagnosed the patient with apism due to multiple bee stings.","translation":"医師は、複数の蜂刺されにより患者を蜂刺症と診断した。","type":"noun","meaning_category":"bee sting condition"},{"sentence":"Proper protective gear can prevent apism when working near beehives.","translation":"適切な防護具は、蜂の巣の近くで作業する際の蜂刺症を防ぐことができる。","type":"noun","meaning_category":"bee sting condition"}]}