{"word":"pragmatists","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"実用主義者、プラグマティスト","english_definition":"People who follow the philosophical approach of pragmatism, which emphasizes practical consequences and real-world applications of ideas and beliefs.","examples":[{"sentence":"The company is run by pragmatists who focus on what works.","translation":"その会社は、何が効果的かに焦点を当てる実用主義者によって経営されています。"},{"sentence":"In politics, pragmatists are often willing to compromise to achieve progress.","translation":"政治において、実用主義者は進歩を達成するために妥協することを厭わないことが多いです。"},{"sentence":"The debate between idealists and pragmatists is common in many fields.","translation":"理想主義者と実用主義者の間の議論は、多くの分野でよく見られます。"}],"collocations":["political pragmatists (政治的実用主義者)","business pragmatists (ビジネスの実用主義者)","philosophical pragmatists (哲学的実用主義者)"],"synonyms":["realists","practical thinkers","empiricists","utilitarians"],"antonyms":["idealists","theorists","dogmatists"]}],"etymology":{"value":"The word 'pragmatist' comes from 'pragmatism', which originates from the Greek word 'pragma' (πρᾶγμα), meaning 'deed' or 'act'. It reflects the emphasis on action and practical results.","priority":"★★☆"},"pronunciation":{"ipa":"ˈpræɡmətɪsts","syllables":"prag-ma-tists"},"inflection":{"noun_plural":"pragmatists"},"usage_notes":{"explanation":"'Pragmatists' refers to individuals who adhere to the philosophy of pragmatism. This philosophy values practical results and consequences over abstract theories or principles. Pragmatists tend to focus on what works in a given situation and are often willing to compromise or adapt their beliefs to achieve practical goals. The term can be used in various contexts, including politics, business, and philosophy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pragmatist, so he doesn't have any values.","correct":"✓ He is a pragmatist, so he focuses on practical solutions.","note":"Pragmatists are not necessarily without values, but they prioritize practical solutions and outcomes. They may be willing to set aside certain principles if they believe it will lead to a better result. It's a misunderstanding to equate pragmatism with a complete lack of values."},{"incorrect":"✗ Pragmatists are always right.","correct":"✓ Pragmatists focus on practical results, but their solutions may not always be ethical or long-term.","note":"Pragmatism doesn't guarantee success or ethical behavior. A pragmatist's focus on immediate results might lead to overlooking long-term consequences or ethical considerations. It's important to evaluate their actions critically."}],"priority":"★★☆"},"related_words":{"derivatives":["pragmatism (noun: 実用主義)","pragmatic (adjective: 実用的な)","pragmatically (adverb: 実用的に)"],"idioms_phrases":["There are no specific idioms directly related to 'pragmatists', but the concept of pragmatism is often discussed in philosophical and political contexts."],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pragmatists' refers to people who follow the philosophy of pragmatism. Pragmatism is a way of thinking that emphasizes the practical results and real-world usefulness of ideas. Instead of focusing on abstract theories, pragmatists are more interested in what works and what produces tangible outcomes. This term is often used in discussions about politics, business, and philosophy, where the focus is on achieving practical goals and solving real-world problems. Understanding the concept of pragmatism is key to understanding the role and approach of pragmatists."},"example_sentences":[{"sentence":"The team was composed of pragmatists who wanted to see immediate results.","translation":"そのチームは、すぐに結果を出したい実用主義者で構成されていました。","type":"noun","meaning_category":"実用主義者"},{"sentence":"Unlike the idealists, the pragmatists in the government were focused on achievable goals.","translation":"理想主義者とは異なり、政府の実用主義者は達成可能な目標に焦点を当てていました。","type":"noun","meaning_category":"実用主義者"},{"sentence":"Many business leaders are pragmatists who prioritize profit and efficiency.","translation":"多くのビジネスリーダーは、利益と効率を優先する実用主義者です。","type":"noun","meaning_category":"実用主義者"}]}