{"word":"Pastinas","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A very small, star-shaped pasta, traditionally used in soups.","english_definition":"A type of very small pasta, typically star-shaped, used in soups and other dishes.","examples":[{"sentence":"My grandmother always made chicken soup with pastinas.","translation":"私の祖母はいつもパスティナ入りのチキンスープを作ってくれました。"},{"sentence":"Pastinas are a favorite for children's soups.","translation":"パスティナは子供向けのスープとして人気があります。"}],"collocations":["chicken soup with pastinas","pastina soup","star-shaped pastinas"],"synonyms":["stelline","acini di pepe"],"antonyms":[]}],"etymology":{"value":"Derived from the Italian word 'pastina', which is a diminutive form of 'pasta'.","priority":"★★☆"},"pronunciation":{"ipa":"/pɑːˈstiːnəz/","syllables":"pas-ti-nas"},"inflection":{"noun_plural":"pastinas"},"usage_notes":{"explanation":"'Pastinas' is often used to refer to the pasta shape itself, especially when discussing Italian cuisine or recipes. It's commonly associated with comfort food and is frequently used in broths or light soups.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a pastina for dinner.","correct":"✓ I ate pastinas for dinner.","note":"Since pastinas are very small and numerous, it's more common to use the plural form even when referring to a single serving."}],"priority":"★★☆"},"related_words":{"derivatives":["pasta","pastina"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Pastinas' refers to a specific type of very small, often star-shaped pasta. It's a culinary term, primarily used when discussing Italian food or recipes. While not a common word in everyday conversation, it's easily understood in the context of cooking or food preparation. It is most often used in the plural form because it refers to many small pieces of pasta."},"example_sentences":[{"sentence":"She added a handful of pastinas to the simmering broth.","translation":"彼女は煮込んでいるスープに一掴みのパスティナを加えた。","type":"noun","meaning_category":"pasta"},{"sentence":"The children enjoyed the simple pastina soup.","translation":"子供たちはシンプルなパスティナのスープを楽しんだ。","type":"noun","meaning_category":"pasta"}]}