{"word":"Allotropicity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"同素体","english_definition":"The property of some chemical elements to exist in two or more different forms, in the same physical state. These different forms are known as allotropes of the element.","examples":[{"sentence":"Oxygen exhibits allotropicity, existing as both diatomic oxygen (O₂) and ozone (O₃).","translation":"酸素は同素体を示し、二原子酸素 (O₂) とオゾン (O₃) の両方として存在する。"},{"sentence":"Carbon has several allotropes, including diamond, graphite, and fullerenes.","translation":"炭素には、ダイヤモンド、グラファイト、フラーレンなど、いくつかの同素体がある。"}],"collocations":["exhibit allotropicity","carbon allotropes","oxygen allotropes"],"synonyms":["allotropy"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'allos' (meaning 'other' or 'different') and 'tropos' (meaning 'manner' or 'form').","priority":"★★☆"},"pronunciation":{"ipa":"/əˌlɒtrəˈpɪsɪti/","syllables":"a-llo-tro-pi-ci-ty"},"inflection":{"noun_plural":"Allotropicities"},"usage_notes":{"explanation":"Allotropicity (or allotropy) refers to the ability of a chemical element to exist in two or more different forms, known as allotropes, in the same physical state (solid, liquid, or gas). The different allotropes of an element have different physical properties and, sometimes, different chemical properties. This phenomenon occurs due to differences in the arrangement of atoms in the crystal lattice or in the way atoms are bonded together.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Allotropicity is when different elements have the same form.","correct":"✓ Allotropicity is when the same element has different forms.","note":"Allotropicity refers to different forms of the *same* element, not different elements."}],"priority":"★★☆"},"related_words":{"derivatives":["allotrope","allotropic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Allotropicity' is a scientific term used in chemistry to describe when an element can exist in multiple forms (allotropes) within the same state of matter. This is due to different atomic arrangements or bonding. Examples include carbon (diamond, graphite) and oxygen (O₂, O₃)."},"example_sentences":[{"sentence":"Sulfur demonstrates allotropicity by forming various ring structures.","translation":"硫黄は、さまざまな環状構造を形成することにより、同素体を示す。","type":"general","meaning_category":"general"},{"sentence":"The allotropicity of phosphorus leads to white, red, and black forms with distinct properties.","translation":"リンの同素体により、異なる特性を持つ白リン、赤リン、黒リンの形態が生じる。","type":"example","meaning_category":"example"}]}