{"word":"creepmouse","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(架空の生き物) こっそり忍び寄るネズミ、気味の悪いネズミ","english_definition":"A fictional creature, a mouse that creeps stealthily or is unsettling.","examples":[{"sentence":"The children made up a story about a creepmouse that lived under their beds.","translation":"子供たちは、ベッドの下に住むこっそり忍び寄るネズミについての物語を作った。"},{"sentence":"The artist's depiction of the creepmouse was surprisingly disturbing.","translation":"その芸術家による気味の悪いネズミの描写は、驚くほど不穏だった。"}],"collocations":["creepmouse story","creepmouse drawing"],"synonyms":["scary mouse","stealth mouse"],"antonyms":[]}],"etymology":{"value":"Combination of 'creep' (to move slowly and quietly) and 'mouse'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkriːpmaʊs/","syllables":"creep-mouse"},"inflection":{"noun_plural":"creepmice or creepmouses"},"usage_notes":{"explanation":"'Creepmouse' is not a standard English word. It is typically used in fictional contexts, especially in children's stories or fantasy literature, to describe a mouse-like creature with unsettling or stealthy characteristics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a creepmouse in my house, I need to call pest control.","correct":"✓ I saw a mouse in my house, I need to call pest control.","note":"Use 'mouse' instead of 'creepmouse' in real-life situations, as 'creepmouse' is a fictional term."}],"priority":"★☆☆"},"related_words":{"derivatives":["creep","mouse"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency, mostly in fictional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Creepmouse' is a compound word that combines 'creep' (to move quietly and slowly) and 'mouse' (a small rodent). It is not a common word and is usually found in imaginative or fictional contexts, such as children's stories or fantasy literature. The word suggests a mouse that is either stealthy or unsettling in nature. Because it's not a standard word, understanding its meaning relies on recognizing the meanings of its component parts and the context in which it's used."},"example_sentences":[{"sentence":"The children giggled as they described the antics of the little creepmouse.","translation":"子供たちは、小さなこっそり忍び寄るネズミのいたずらを説明しながらくすくす笑った。","type":"fictional","meaning_category":"fictional creature"},{"sentence":"In the dark corners of the castle, legends spoke of a sinister creepmouse.","translation":"城の暗い隅で、伝説は不吉な気味の悪いネズミについて語った。","type":"fictional","meaning_category":"fictional creature"}]}