{"word":"concept-oriented","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"概念指向の、概念重視の","english_definition":"Focused on or emphasizing concepts and ideas rather than specific details or practical applications.","examples":[{"sentence":"The course is concept-oriented, focusing on the underlying principles rather than specific programming languages.","translation":"そのコースは概念指向で、特定のプログラミング言語よりも根本的な原則に焦点を当てています。"},{"sentence":"Concept-oriented learning helps students develop a deeper understanding of the subject matter.","translation":"概念指向の学習は、学生が主題についてより深い理解を深めるのに役立ちます。"},{"sentence":"The research paper takes a concept-oriented approach to the problem.","translation":"その研究論文は、問題に対して概念指向のアプローチを取っています。"}],"collocations":["concept-oriented approach (概念指向のアプローチ)","concept-oriented learning (概念指向の学習)","concept-oriented design (概念指向の設計)","concept-oriented curriculum (概念指向のカリキュラム)","concept-oriented thinking (概念指向の思考)"],"synonyms":["theoretical","abstract","conceptual","principle-based","idea-focused"],"antonyms":["detail-oriented","practical","application-oriented","concrete","empirical"]}],"etymology":{"value":"The term is formed by combining 'concept' (an abstract idea or general notion) with 'oriented' (directed toward or focused on).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒnsept ˈɔːriˌentɪd/","syllables":"con-cept o-ri-ent-ed"},"inflection":{"notes":"This is an adjective and does not have inflections like verbs or nouns."},"usage_notes":{"explanation":"'Concept-oriented' describes something that prioritizes abstract ideas, theories, or general principles over specific details, practical applications, or empirical evidence. It is often used in the context of education, research, and design to indicate a focus on understanding the underlying concepts rather than simply memorizing facts or following procedures. It is the opposite of 'detail-oriented' or 'application-oriented.'","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The concept-oriented is important.","correct":"✓ A concept-oriented approach is important.","note":"'Concept-oriented' is an adjective and needs a noun to modify. Using it alone as a subject is grammatically incorrect."},{"incorrect":"✗ The concept oriented person.","correct":"✓ The concept-oriented person.","note":"The hyphen is important to show that 'concept' and 'oriented' are working together as a single adjective modifying the noun."}],"priority":"★★☆"},"related_words":{"derivatives":["concept (名詞: 概念)","orientation (名詞: 方向付け、志向)","conceptual (形容詞: 概念的な)","conceptualize (動詞: 概念化する)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Moderate frequency in academic and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Concept-oriented' means focusing on the big ideas and theories behind something, rather than just the small details or how to use it in a practical way. It's often used to describe a way of learning or teaching that emphasizes understanding the main principles of a subject, rather than just memorizing facts. Think of it as seeing the forest instead of just the trees. It is used in academic and technical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor's lectures were highly concept-oriented, which made it difficult for some students to follow.","translation":"教授の講義は非常に概念指向であったため、一部の学生には理解するのが困難でした。","type":"adjective","meaning_category":"General"},{"sentence":"A concept-oriented curriculum encourages critical thinking and problem-solving skills.","translation":"概念指向のカリキュラムは、批判的思考と問題解決能力を促進します。","type":"adjective","meaning_category":"Education"},{"sentence":"The design of the software was concept-oriented, prioritizing user experience over technical complexity.","translation":"ソフトウェアの設計は概念指向で、技術的な複雑さよりもユーザーエクスペリエンスを優先していました。","type":"adjective","meaning_category":"Design"}]}