{"word":"empty-paneled","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having empty panels; specifically, (of a vehicle) having no windows or other glazing in its panels.","english_definition":"Describing something, typically a vehicle, that has panels without windows or glazing.","examples":[{"sentence":"The empty-paneled van looked suspicious parked on the street.","translation":"窓のないバンが通りに駐車されているのは怪しく見えた。"},{"sentence":"He preferred the empty-paneled design for its added security.","translation":"彼はセキュリティが強化されるため、窓のないデザインを好んだ。"}],"collocations":["empty-paneled van","empty-paneled truck"],"synonyms":["windowless","unwindowed","blind-sided"],"antonyms":["glazed","windowed","paneled"],"notes":"This term primarily describes vehicles like vans or trucks that have solid panels instead of windows."}],"etymology":{"value":"Combination of 'empty' and 'paneled', indicating panels that lack the usual contents (like glass).","priority":"N/A"},"pronunciation":{"ipa":"/ˌempti ˈpænəld/","syllables":"emp-ty-pan-eld"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"The term 'empty-paneled' is relatively uncommon but specifically describes vehicles or structures where the panels are solid and lack windows or other transparent materials.  It's often used to emphasize the lack of visibility or the increased security provided by such a design.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["panel van","cargo van"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'empty-paneled' is a compound adjective that describes a vehicle or structure with panels that lack windows or glazing. It is a descriptive term used to highlight the absence of visibility or the presence of solid panels instead of transparent ones. The term is relatively uncommon and likely to be found in technical or descriptive contexts related to vehicle design or security features."},"example_sentences":[{"sentence":"The company uses empty-paneled vans to transport valuable goods discreetly.","translation":"その会社は、貴重品を慎重に輸送するために、窓のないバンを使用しています。","type":"adjective","meaning_category":"Describing a vehicle"},{"sentence":"For maximum privacy, they chose an empty-paneled design for the back of the building.","translation":"最大限のプライバシーを確保するために、彼らは建物の裏側に窓のないデザインを選んだ。","type":"adjective","meaning_category":"Describing a design feature"}]}