{"word":"ordainable","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"叙任可能な、聖職に任命できる","english_definition":"Capable of being ordained; fit to be admitted to holy orders.","examples":[{"sentence":"He was deemed ordainable after completing his theological studies.","translation":"彼は神学研究を修了した後、叙任可能と判断された。"}],"collocations":[],"synonyms":["eligible for ordination","qualified for holy orders"],"antonyms":["unordainable","ineligible for ordination"]}],"etymology":{"value":"\"Ordain\" + \"-able\". \"Ordain\" comes from Old French \"ordener,\" from Latin \"ordinare\" (to put in order, regulate, appoint), from \"ordo\" (order, rank). The suffix \"-able\" indicates capability or suitability.","priority":"N/A"},"pronunciation":{"ipa":"ɔrˈdeɪnəbəl","syllables":"or-dain-a-ble"},"inflection":{"adjective_forms":{"comparative":"more ordainable","superlative":"most ordainable"}},"usage_notes":{"explanation":"\"Ordainable\" is a relatively rare word, primarily used in religious contexts, specifically within Christianity and other religions that have a formal ordination process. It describes someone who meets the requirements to become a member of the clergy.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["ordain (verb)","ordination (noun)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The word 'ordainable' is a highly specialized term primarily used in religious contexts to describe someone who is qualified to be ordained as a member of the clergy. Due to its limited usage and specific context, it's not commonly encountered in general English. Understanding the term requires familiarity with religious terminology and the process of ordination."},"example_sentences":[{"sentence":"The bishop confirmed that all candidates were ordainable and met the necessary criteria.","translation":"司教は、すべての候補者が叙任可能であり、必要な基準を満たしていることを確認した。","type":"adjective","meaning_category":"叙任可能な"},{"sentence":"After a thorough review of his qualifications, the committee declared him ordainable.","translation":"彼の資格を徹底的に審査した後、委員会は彼を叙任可能であると宣言した。","type":"adjective","meaning_category":"叙任可能な"}]}