{"word":"Chi-square","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"カイ二乗 (χ²)","english_definition":"A statistical test used to compare observed results with expected results. The purpose of this test is to determine if a difference between observed data and expected data is due to chance, or if it is due to a relationship between the variables you are studying.","examples":[{"sentence":"The chi-square test showed a significant association between smoking and lung cancer.","translation":"カイ二乗検定は喫煙と肺がんの間に有意な関連性があることを示した。"},{"sentence":"We used a chi-square test to analyze the categorical data.","translation":"カテゴリカルデータを分析するためにカイ二乗検定を用いた。"}],"collocations":["chi-square test (カイ二乗検定)","chi-square distribution (カイ二乗分布)","degrees of freedom (自由度)","observed frequency (観測度数)","expected frequency (期待度数)","statistical significance (統計的有意性)"],"synonyms":["Pearson's chi-squared test","χ² test"],"antonyms":[]}],"etymology":{"value":"The term \"chi-square\" comes from the Greek letter chi (χ) and the mathematical concept of squaring a value. It was formalized by Karl Pearson in the early 20th century.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkaɪˌskwɛər/","syllables":"Chi-square"},"inflection":{"notes":"It is a noun and does not inflect."},"usage_notes":{"explanation":"The chi-square test is used when you have categorical (not continuous) data. It is commonly used to test for independence between two categorical variables or to assess the goodness of fit of a model to observed data. The chi-square statistic measures the discrepancy between the observed values and the values that would be expected under the null hypothesis. A large chi-square value suggests that the observed data deviate significantly from the expected values, leading to rejection of the null hypothesis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The chi-square are significant.","correct":"✓ The chi-square statistic is significant.","note":"Chi-square itself is a statistic. You should say 'chi-square statistic' or 'chi-square value' instead of just 'chi-square' when referring to the test result."},{"incorrect":"✗ We use chi-square for continuous data.","correct":"✓ We use chi-square for categorical data.","note":"Chi-square tests are appropriate for categorical data, not continuous data."}],"priority":"★★☆"},"related_words":{"derivatives":["chi-squared (adjective)"],"phrasal_verbs":[],"related_terms":["p-value","null hypothesis","alternative hypothesis","contingency table","statistical test","categorical data","degrees of freedom"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively frequent in academic and scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The Chi-square test is a statistical test used to see if there's a real connection between two groups when you have data that falls into categories (like colors or opinions). It helps you figure out if any differences you see are just random chance or if they mean something important. You'll often find this test used in science, research, and surveys to analyze data and draw conclusions."},"example_sentences":[{"sentence":"The **chi-square** value was calculated to determine the significance of the association.","translation":"関連性の有意性を判断するためにカイ二乗値を計算した。","type":"general","meaning_category":"statistical test"},{"sentence":"The **chi-square** test is appropriate for analyzing categorical variables.","translation":"カイ二乗検定はカテゴリカル変数の分析に適している。","type":"general","meaning_category":"statistical test"},{"sentence":"A significant **chi-square** result indicates a relationship between the variables.","translation":"有意なカイ二乗の結果は変数間の関係を示している。","type":"general","meaning_category":"statistical test"}]}