{"word":"quinarian","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"五つ組の、五の要素からなる","english_definition":"Arranged in fives; consisting of five elements.","examples":[{"sentence":"The quinarian system of classification was once popular in natural history.","translation":"五数法による分類体系はかつて博物学で人気があった。"}],"collocations":[],"synonyms":["quinary"],"antonyms":[]},{"part_of_speech":"noun","definition":"五数説の信奉者、五数法を支持する人","english_definition":"An advocate of the quinarian system.","examples":[{"sentence":"Some early naturalists were quinarians, believing in the fundamental importance of the number five in nature.","translation":"初期の博物学者の中には、五数説を信奉し、自然界における数字の5の根本的な重要性を信じる人々がいた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin *quinarius* (containing five), from *quinque* (five).","priority":"★★☆"},"pronunciation":{"ipa":"/kwɪˈnɛəriən/","syllables":"qui-nar-i-an"},"inflection":{},"usage_notes":{"explanation":"The term 'quinarian' primarily relates to the quinarian system of classification, a historical approach that attempted to organize the natural world based on groups of five. This system is now largely obsolete.","priority":"★★☆"},"common_mistakes":{},"related_words":["quinary","quinque-"],"level_frequency":{},"readability_explanation":{"level":"C2","text":"'Quinarian' is a specialized term primarily used in the context of historical scientific classification systems. It refers to arrangements or systems based on the number five, particularly the quinarian system of classification in natural history. Due to its limited and specialized use, it is not a commonly encountered word."},"example_sentences":[{"sentence":"The quinarian system proposed that all natural groups could be divided into five subgroups.","translation":"五数法は、すべての自然なグループを5つのサブグループに分割できると提唱した。","type":"adjective","meaning_category":"五つ組の"},{"sentence":"The quinarian was convinced that the number five held a key to understanding the structure of the natural world.","translation":"その五数説の信奉者は、数字の5が自然界の構造を理解するための鍵を握っていると確信していた。","type":"noun","meaning_category":"五数説の信奉者"}]}