{"word":"Menelaus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"メネラオス：ギリシア神話の人物。アトレウスの子で、アガメムノンの弟。スパルタ王であり、ヘレネの夫。トロイア戦争の原因となったヘレネを奪還するためにギリシア軍を率いた。","english_definition":"(Greek mythology) A king of Sparta, son of Atreus, and brother of Agamemnon. His wife, Helen, was abducted by Paris of Troy, leading to the Trojan War.","examples":[{"sentence":"Menelaus was the king of Sparta.","translation":"メネラオスはスパルタの王だった。"},{"sentence":"The abduction of Helen, wife of Menelaus, sparked the Trojan War.","translation":"メネラオスの妻ヘレネの誘拐が、トロイア戦争の引き金となった。"}],"collocations":["King Menelaus","Helen and Menelaus","The story of Menelaus"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Greek Μενέλαος (Menelaos), of uncertain etymology.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌmɛnɪˈleɪəs/","syllables":"Me-ne-la-us"},"inflection":{"notes":"Proper noun, singular only."},"usage_notes":{"explanation":"Menelaus is a figure primarily known from Greek mythology, particularly the *Iliad* and other works related to the Trojan War cycle. He is most famous for being the husband of Helen, whose abduction by Paris led to the Trojan War. References to Menelaus are usually within the context of classical literature, mythology, or historical studies related to ancient Greece.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Menelaic (adjective)"],"related_characters":["Helen (his wife)","Agamemnon (his brother)","Paris (abductor of Helen)","Odysseus (Greek hero)","Achilles (Greek hero)"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily in academic or literary contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The name 'Menelaus' is primarily encountered in the context of classical literature, mythology, and historical studies related to ancient Greece. Understanding references to Menelaus requires familiarity with the Trojan War narrative and related characters. Due to its specific and limited usage, it is not considered part of general vocabulary.","priority":"☆☆☆"},"example_sentences":[{"sentence":"In Homer's *Iliad*, Menelaus is portrayed as a valiant warrior seeking to reclaim his wife, Helen.","translation":"ホメロスの『イリアス』では、メネラオスは妻ヘレネを取り戻そうとする勇敢な戦士として描かれている。","type":"narrative","meaning_category":"mythology"},{"sentence":"The play recounts the events of the Trojan War, including the role of Menelaus.","translation":"その劇は、メネラオスの役割を含むトロイア戦争の出来事を語っている。","type":"literature","meaning_category":"mythology"}]}