{"word":"prerevised","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"改訂前の、修正前の","english_definition":"Not yet revised; in a state before revision.","examples":[{"sentence":"The prerevised manuscript was full of errors.","translation":"改訂前の原稿は誤りだらけだった。"},{"sentence":"We need to review the prerevised version before making further changes.","translation":"さらなる変更を加える前に、改訂前のバージョンを確認する必要があります。"}],"collocations":["prerevised manuscript","prerevised version","prerevised draft"],"synonyms":["unrevised","unedited","preliminary","draft"],"antonyms":["revised","edited","finalized"]}],"etymology":{"value":"prefix 'pre-' (before) + 'revised' (having been revised).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːrɪˈvaɪzd/","syllables":"pre-re-vised"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"'Prerevised' is used to describe something that exists in a state before it has been revised or edited. It's often used in academic or professional contexts when discussing documents, manuscripts, or other materials that go through a revision process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pre-revised version is better than the revised.","correct":"✓ The prerevised version is better than the revised.","note":"The prefix 'pre-' is directly attached to 'revised' without a hyphen in this case."}],"priority":"★★☆"},"related_words":{"derivatives":["revise","revision","revising"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'prerevised' is a relatively uncommon term used to describe something that has not yet undergone a revision process. It is most often encountered in academic or professional settings where documents or materials are subject to multiple revisions. Understanding the meaning of the prefix 'pre-' is helpful in deciphering the word's meaning. It is less common than its antonym 'revised'."},"example_sentences":[{"sentence":"The author submitted a prerevised version of the book to the editor.","translation":"著者は改訂前のバージョンの本を編集者に提出した。","type":"adjective","meaning_category":"改訂前の"},{"sentence":"The team discussed the prerevised plan before implementing the changes.","translation":"チームは変更を実施する前に、改訂前の計画について話し合った。","type":"adjective","meaning_category":"修正前の"}]}