{"word":"endogamies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"同族結婚","english_definition":"The practice of marrying within a specific ethnic group, class, or social group, rejecting others on such a basis.","examples":[{"sentence":"Endogamies are common in some traditional societies to maintain cultural purity.","translation":"同族結婚は、文化的な純粋さを維持するために、一部の伝統的な社会で一般的です。"}],"collocations":["practice endogamies","cultural endogamies"],"synonyms":["inbreeding","consanguinity"],"antonyms":["exogamy"]}],"etymology":{"value":"From the Greek words 'endon' (within) and 'gamos' (marriage).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛndoʊˈɡæmiz/","syllables":"en-do-ga-mies"},"inflection":{"noun_plural":"endogamies"},"usage_notes":{"explanation":"'Endogamies' refers to the plural form of 'endogamy,' which is the practice of marrying within a specific group. This is often done to preserve cultural, religious, or social identity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Endogamies is a good way to promote diversity.","correct":"Endogamies is a way to maintain the homogeneity of a group.","note":"Endogamy tends to reduce diversity within a group, not promote it."}],"priority":"★★☆"},"related_words":{"derivatives":["endogamy","endogamous"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Endogamies' is a plural noun referring to instances of endogamy, the practice of marrying within a specific group. This term is typically used in sociological or anthropological contexts when discussing marriage patterns and their effects on group dynamics and cultural preservation."},"example_sentences":[{"sentence":"The study examined the prevalence of endogamies in different religious communities.","translation":"その研究は、異なる宗教コミュニティにおける同族結婚の普及率を調査しました。","type":"general","meaning_category":"同族結婚"},{"sentence":"Historical records show that endogamies were strictly enforced in certain aristocratic families.","translation":"歴史的な記録は、特定の貴族の家族において同族結婚が厳格に施行されていたことを示しています。","type":"historical","meaning_category":"同族結婚"}]}