{"word":"leucopenia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"白血球減少症","english_definition":"A condition in which a person has an abnormally low number of leukocytes (white blood cells) in the blood.","examples":[{"sentence":"Leucopenia can be a side effect of certain medications.","translation":"白血球減少症は特定の薬の副作用である可能性がある。"},{"sentence":"The patient's blood test revealed leucopenia.","translation":"患者の血液検査で白血球減少症が明らかになった。"},{"sentence":"Severe leucopenia increases the risk of infection.","translation":"重度の白血球減少症は感染のリスクを高める。"}],"collocations":["cause leucopenia","treat leucopenia","severe leucopenia","mild leucopenia","drug-induced leucopenia"],"synonyms":["leukocytopenia","neutropenia (if neutrophils are specifically low)"],"antonyms":["leukocytosis (increase in white blood cells)"]}],"etymology":{"value":"From the Greek words 'leuko-' (λευκός) meaning 'white', 'cyto-' (κύτος) meaning 'cell', and '-penia' (πενία) meaning 'deficiency'.","priority":"★★☆"},"pronunciation":{"ipa":"ˌljuːkoʊˈpiːniə","syllables":"leu-co-pe-ni-a"},"inflection":{"noun_plural":"leucopenias"},"usage_notes":{"explanation":"Leucopenia is a medical term referring specifically to a decrease in the number of white blood cells. It's important to note that leucopenia itself is not a disease, but rather a condition or sign that can be caused by various factors, such as infections, medications, or bone marrow disorders. When discussing leucopenia, it's often necessary to specify which type of white blood cells are affected (e.g., neutropenia for low neutrophils, lymphocytopenia for low lymphocytes).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Leucopenia is a type of cancer.","correct":"✓ Leucopenia can be a symptom of some cancers or their treatment, but it is not cancer itself.","note":"Leucopenia is a condition, not a disease like cancer. It can be a side effect of cancer treatment or a symptom of certain cancers affecting the bone marrow."},{"incorrect":"✗ You can catch leucopenia from someone.","correct":"✓ Leucopenia is not contagious. It is caused by underlying medical conditions or treatments.","note":"Leucopenia is not an infectious disease and cannot be transmitted from person to person."}],"priority":"★★☆"},"related_words":{"derivatives":["leukocyte (white blood cell)","neutropenia (low neutrophil count)","lymphocytopenia (low lymphocyte count)","pancytopenia (deficiency of all blood cell types)"],"medical_terms":["hematology (study of blood)","bone marrow (site of blood cell production)","chemotherapy (cancer treatment that can cause leucopenia)","immunosuppression (reduced immune function)"],"priority":"★★☆"},"level_frequency":{"frequency_medical_texts":"Relatively common in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Leucopenia' is a specialized medical term. Understanding it requires knowledge of basic medical terminology, particularly related to blood cells and their functions. The word itself is derived from Greek roots, which can aid in understanding its meaning. The concept is relatively straightforward – a deficiency in white blood cells – but the causes and implications can be complex and require further medical knowledge."},"example_sentences":[{"sentence":"The chemotherapy caused severe leucopenia, making the patient vulnerable to infections.","translation":"化学療法は重度の白血球減少症を引き起こし、患者を感染症にかかりやすくした。","type":"medical","meaning_category":"cause and effect"},{"sentence":"Regular blood tests are crucial for monitoring leucopenia in patients on immunosuppressant drugs.","translation":"免疫抑制剤を服用している患者の白血球減少症を監視するには、定期的な血液検査が不可欠である。","type":"medical","meaning_category":"monitoring"},{"sentence":"The doctor prescribed medication to stimulate white blood cell production and combat the leucopenia.","translation":"医師は白血球の産生を刺激し、白血球減少症と闘うための薬を処方した。","type":"medical","meaning_category":"treatment"}]}