{"word":"underzealot","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who is less zealous than a typical zealot; someone who is moderately enthusiastic or fervent about a cause or belief.","english_definition":"A person who exhibits a moderate level of zeal or enthusiasm, falling short of the intensity typically associated with a zealot.","examples":[{"sentence":"He was an underzealot when it came to environmental activism, supporting some initiatives but not dedicating his life to the cause.","translation":"彼は環境保護活動に関しては熱心とは言えず、いくつかのイニシアチブを支援するものの、その活動に人生を捧げるほどではなかった。"},{"sentence":"As an underzealot for the local sports team, she enjoyed watching games but didn't obsess over their performance.","translation":"地元のスポーツチームのファンではあるものの、試合観戦は楽しむが、チームの成績に執着するほどではなかった。"}],"collocations":["moderate zealot","mild enthusiast","lukewarm supporter"],"synonyms":["moderate","enthusiast","supporter","fan","follower"],"antonyms":["zealot","fanatic","extremist","radical"]}],"etymology":{"value":"The word is formed by combining \"under-\" (meaning less than or below) with \"zealot\" (a person who is fanatical and uncompromising in pursuit of their religious, political, or other ideals).","priority":"★★★"},"pronunciation":{"ipa":"ˌʌndərˈzɛlət","syllables":"un-der-zeal-ot"},"inflection":{"noun_plural":"underzealots"},"usage_notes":{"explanation":"The term \"underzealot\" is typically used to describe someone who is supportive or enthusiastic about a particular cause or belief, but not to the extreme or fanatical level of a typical zealot. It implies a more balanced or moderate approach.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He was an underzealot, so he bombed the building.","correct":"He was a zealot, so he bombed the building.","note":"Underzealots are not extremists; zealots are."}],"priority":"★★☆"},"related_words":{"derivatives":["under-","zealot","zealous","zeal"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'underzealot' is a rare and somewhat humorous term used to describe someone who is less enthusiastic or committed than a typical zealot. It's a niche word that requires a good understanding of the prefix 'under-' and the word 'zealot' to fully grasp its meaning. It's unlikely to be encountered in everyday conversation or writing, but it might appear in more specialized or academic contexts."},"example_sentences":[{"sentence":"While many considered him a dedicated activist, in reality, he was more of an underzealot, occasionally participating in protests but never fully committing.","translation":"多くの人が彼を熱心な活動家だと考えていたが、実際には彼はせいぜい熱心とは言えない支持者であり、時折抗議活動に参加するものの、完全にコミットすることはなかった。","type":"noun","meaning_category":"moderate supporter"},{"sentence":"She described herself as an underzealot for classical music, enjoying concerts but not delving deeply into music theory or history.","translation":"彼女は自身をクラシック音楽の熱心とは言えないファンだと表現し、コンサートは楽しむものの、音楽理論や歴史を深く掘り下げることはなかった。","type":"noun","meaning_category":"moderate enthusiast"}]}