{"word":"Prosorus","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Zoology) A genus of harvestmen in the family Nemastomatidae.","english_definition":"A genus of harvestmen in the family Nemastomatidae.","examples":[{"sentence":"The genus Prosorus includes several species of harvestmen found in Europe.","translation":"Prosorus属には、ヨーロッパで見られるザトウムシのいくつかの種が含まれています。"}],"collocations":["Prosorus simonii","Prosorus spiders"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from Greek, possibly combining 'pros' (towards) and 'oros' (mountain), hinting at the habitat of these harvestmen.","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈsɔːrəs/","syllables":"pro-so-rus"},"inflection":{"noun_plural":"Prosorus (usually treated as a genus name, so plural is uncommon)"},"usage_notes":{"explanation":"Prosorus is a taxonomic term used in zoology to classify a specific group of harvestmen. It is most commonly encountered in scientific literature related to arachnology and taxonomy. When referring to a specific species within the genus, the binomial nomenclature (e.g., Prosorus simonii) is used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Prosorus are spiders.","correct":"✓ Prosorus are harvestmen.","note":"Prosorus refers to a genus of harvestmen, which are related to but distinct from spiders."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["harvestman","Opiliones","Nemastomatidae"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in specialized scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Prosorus' is highly specialized and primarily used within the field of zoology, specifically in the context of arachnology and taxonomy. Understanding and using this term requires familiarity with biological classification systems and a scientific background. It is unlikely to be encountered outside of academic or research settings related to the study of harvestmen."},"example_sentences":[{"sentence":"Researchers have identified a new species within the genus Prosorus.","translation":"研究者たちはProsorus属の新しい種を特定しました。","type":"noun","meaning_category":"Zoology"},{"sentence":"The morphological characteristics of Prosorus harvestmen are of interest to evolutionary biologists.","translation":"Prosorusのザトウムシの形態学的特徴は、進化生物学者にとって興味深いものです。","type":"noun","meaning_category":"Zoology"}]}