{"word":"Brunswick","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"ブランズウィック（ドイツの都市）","english_definition":"A city in Lower Saxony, Germany.","examples":[{"sentence":"Brunswick is known for its medieval architecture.","translation":"ブランズウィックは中世の建築で知られています。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ブランズウィック（アメリカ合衆国の地名）","english_definition":"A place name in the United States, including towns, cities, and counties, most notably in Georgia and Maine.","examples":[{"sentence":"Brunswick, Maine is a charming coastal town.","translation":"メイン州のブランズウィックは魅力的な沿岸の町です。"},{"sentence":"We visited Brunswick, Georgia, during our trip.","translation":"旅行中にジョージア州のブランズウィックを訪れました。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ブランズウィック家（ヨーロッパの貴族の家系）","english_definition":"A European noble family, also known as the House of Brunswick-Lüneburg, that has included rulers of various German states and the United Kingdom.","examples":[{"sentence":"The House of Brunswick played a significant role in European history.","translation":"ブランズウィック家はヨーロッパの歴史において重要な役割を果たしました。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ブランズウィック（ビリヤード台メーカー）","english_definition":"A brand of billiard tables and other sporting goods.","examples":[{"sentence":"We bought a Brunswick billiard table for our game room.","translation":"ゲームルーム用にブランズウィックのビリヤード台を購入しました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after the city of Brunswick in Germany (German: Braunschweig). The name is derived from 'Brun' (brown) and 'Wiek' (settlement).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbrʌnzwɪk/","syllables":"Bruns-wick"},"inflection":{"notes":"Proper noun, so it doesn't have plural forms in most cases, unless referring to multiple locations named Brunswick."},"usage_notes":{"explanation":"'Brunswick' is primarily a proper noun, referring to a city in Germany, various places in the United States, a noble family, or a brand. The specific meaning depends on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I live in Brunswick of Maine.","correct":"✓ I live in Brunswick, Maine.","note":"When referring to a specific Brunswick in the US, use a comma to separate the city name from the state name."}],"priority":"★★☆"},"related_words":{"derivatives":["Brunswicker (noun: a resident of Brunswick)"],"phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, except in specific contexts like history or geography.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Brunswick' is a proper noun that requires some background knowledge to fully understand its different meanings. It's important to consider the context to determine whether it refers to the German city, a place in the US, a historical family, or a brand.","priority":"★★★"},"example_sentences":[{"sentence":"The architecture in Brunswick, Germany, is stunning.","translation":"ドイツのブランズウィックの建築は素晴らしいです。","type":"noun","meaning_category":"German City"},{"sentence":"Brunswick, Georgia, is located near the coast.","translation":"ジョージア州のブランズウィックは海岸の近くに位置しています。","type":"noun","meaning_category":"US Place"},{"sentence":"Queen Victoria was a member of the House of Brunswick.","translation":"ヴィクトリア女王はブランズウィック家のメンバーでした。","type":"noun","meaning_category":"Noble Family"},{"sentence":"He plays pool on a Brunswick table.","translation":"彼はブランズウィックのテーブルでビリヤードをします。","type":"noun","meaning_category":"Billiard Table Brand"}]}