{"word":"BSPhar","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Bachelor of Science in Pharmacy (薬学理学士)","english_definition":"A bachelor's degree in the field of pharmacy.","examples":[{"sentence":"She earned her BSPhar from a reputable university.","translation":"彼女は有名な大学で薬学理学士の学位を取得した。"},{"sentence":"A BSPhar is often a prerequisite for becoming a licensed pharmacist.","translation":"薬学理学士は、免許を持つ薬剤師になるための前提条件であることが多い。"}],"collocations":["earn a BSPhar","BSPhar degree","BSPhar program"],"synonyms":["BSc Pharmacy","BPharm"],"antonyms":[]}],"etymology":{"value":"Abbreviation of 'Bachelor of Science in Pharmacy'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌbiːˌɛsˈfɑːr/","syllables":"B-S-Phar"},"inflection":{"notes":"It is a noun, so it has no inflection."},"usage_notes":{"explanation":"'BSPhar' is an abbreviation commonly used in academic and professional contexts to refer to the Bachelor of Science in Pharmacy degree. It indicates that the holder has completed a four-year undergraduate program focused on pharmaceutical sciences. This degree is often a stepping stone to further studies or professional licensure as a pharmacist.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a BSPhar student.","correct":"✓ He is a BSPhar graduate. / ✓ He is a pharmacy student.","note":"'BSPhar' refers to the degree itself, not the status of being a student. Use 'pharmacy student' or 'BSPhar graduate' to describe someone studying or having completed the degree."}],"priority":"★★☆"},"related_words":{"derivatives":["PharmD (Doctor of Pharmacy)","Pharmacy","Pharmacist","Pharmaceutical"],"phrases":["BS","BSc","Bachelor of Science"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in academic and professional settings.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'BSPhar' is a technical term representing the 'Bachelor of Science in Pharmacy' degree. It's primarily encountered in academic or professional settings related to pharmacy. Understanding this term is essential for those involved in pharmaceutical education or the healthcare industry. It signifies the completion of an undergraduate pharmacy program, often a prerequisite for becoming a licensed pharmacist."},"example_sentences":[{"sentence":"The curriculum for the BSPhar program includes courses in pharmacology, medicinal chemistry, and pharmaceutics.","translation":"薬学理学士課程のカリキュラムには、薬理学、医薬品化学、製剤学のコースが含まれています。","type":"noun","meaning_category":"Degree Program"},{"sentence":"After completing her BSPhar, she decided to pursue a PharmD.","translation":"薬学理学士を修了後、彼女は薬学博士号を取得することにしました。","type":"noun","meaning_category":"Degree"}]}