{"word":"crampingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"けいれんするように、窮屈に、制限的に","english_definition":"In a manner characterized by cramps or spasms; in a restrictive or confined way.","examples":[{"sentence":"The small room was crampingly furnished, leaving little space to move.","translation":"その小さな部屋は窮屈なほど家具が置かれており、動き回るスペースはほとんどなかった。"},{"sentence":"He held the pen crampingly, his hand aching after writing for hours.","translation":"彼はペンをけいれんするように握りしめ、何時間も書き続けた後、手が痛くなった。"},{"sentence":"The rules were applied crampingly, stifling any creativity.","translation":"規則は制限的に適用され、あらゆる創造性を抑圧した。"}],"collocations":["crampingly furnished (窮屈に家具が配置された)","crampingly held (けいれんするように握られた)","crampingly applied (制限的に適用された)"],"synonyms":["restrictively","confiningly","spasmodically","tightly","constrictively"],"antonyms":["freely","loosely","comfortably","expansively"]}],"etymology":{"value":"The word 'crampingly' is derived from the verb 'cramp,' meaning to affect with a cramp or to restrict. The suffix '-ing' turns it into a present participle or gerund, and '-ly' transforms it into an adverb.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkræmpɪŋli/","syllables":"cram-ping-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Crampingly' describes an action or state that involves either physical cramping or a sense of restriction and confinement. It is used to convey the manner in which something is done, emphasizing the discomfort, tightness, or lack of freedom associated with the action.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She was crampingly happy.","correct":"✓ She was happily cramped in the small space.","note":"'Crampingly' describes the manner of an action or state, not a feeling. Instead, use 'happily' to describe the feeling and 'cramped' to describe the physical state."},{"incorrect":"✗ The style was crampingly.","correct":"✓ The style was crampingly restrictive.","note":"'Crampingly' modifies an adjective or verb, not a noun. Add an adjective to clarify what is being done in a crampingly manner."}],"priority":"★★☆"},"related_words":{"derivatives":["cramp (noun, verb)","cramped (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (This word is not commonly found in standard CEFR vocabulary lists.)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Crampingly' is an advanced adverb used to describe actions done in a restrictive or spasmic manner. It's not a common word, so it's more likely to appear in specialized or descriptive writing. The word conveys a sense of discomfort or constraint in how something is done or arranged."},"example_sentences":[{"sentence":"The artist held the brush crampingly, his fingers stiff with cold.","translation":"そのアーティストは筆をけいれんするように握りしめ、指は寒さでこわばっていた。","type":"adverb","meaning_category":"Physical Restriction"},{"sentence":"The budget was crampingly tight, leaving little room for error.","translation":"予算は制限的に厳しく、誤りの余地はほとんどなかった。","type":"adverb","meaning_category":"Financial Restriction"},{"sentence":"The dancers moved crampingly, their movements restricted by the small stage.","translation":"ダンサーたちは窮屈に動き、その動きは小さな舞台によって制限されていた。","type":"adverb","meaning_category":"Spatial Restriction"}]}