{"word":"raunchily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"下品に、わいせつに、みだらに","english_definition":"In a raunchy manner; crudely sexual; lewdly.","examples":[{"sentence":"The comedian performed raunchily, telling explicit jokes.","translation":"そのコメディアンは、露骨なジョークを言って、下品に演じた。"},{"sentence":"The band played raunchily, with suggestive lyrics and provocative moves.","translation":"そのバンドは、性的な歌詞と挑発的な動きで、みだらに演奏した。"}],"collocations":["perform raunchily","dance raunchily","sing raunchily","dress raunchily"],"synonyms":["lewdly","crudely","obscenely","suggestively","smuttily","indecently","vulgarity"],"antonyms":["decently","modestly","tastefully","cleanly","respectably"]}],"etymology":{"value":"From 'raunchy' + '-ly'. 'Raunchy' originated in the mid-20th century, possibly from a combination of 'rancid' and 'unclean', initially meaning 'dirty' or 'disagreeable', later evolving to mean 'lewd' or 'crude'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɔːntʃɪli/","syllables":"raunch-i-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Raunchily' describes actions or behaviors that are crudely sexual, vulgar, or lewd. It is used to describe performances, jokes, or even clothing when they are considered sexually suggestive in a distasteful way. The term carries a negative connotation, implying a lack of refinement or decency.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She dressed raunchily for the job interview.","correct":"✓ She dressed inappropriately for the job interview.","note":"'Raunchily' implies a crude or vulgar sexuality, which is generally not appropriate for a job interview. 'Inappropriately' is a more suitable term to describe unsuitable attire."},{"incorrect":"✗ The food tasted raunchily.","correct":"✓ The food tasted rancid.","note":"'Raunchily' refers to sexual lewdness, not taste. 'Rancid' describes food that has a bad taste or smell due to spoilage."}],"priority":"★★☆"},"related_words":{"derivatives":["raunchy (adjective)","raunchiness (noun)"],"phrases":["raunchy humor","raunchy jokes","raunchy movies"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'raunchily' is used to describe something done in a way that is crude, vulgar, and sexually suggestive. It's not a common word and is usually used in more advanced or specialized contexts to describe performances, jokes, or behavior that is considered distastefully sexual. It carries a negative connotation. "},"example_sentences":[{"sentence":"The dancers moved raunchily across the stage, eliciting gasps from the audience.","translation":"ダンサーたちは舞台をみだらに動き回り、観客から息をのむ声を引き出した。","type":"general"},{"sentence":"He told the story raunchily, adding details that were unnecessary and offensive.","translation":"彼はその話を下品に語り、不必要で不快な詳細を加えた。","type":"general"}]}