{"word":"yantra","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヤントラ：幾何学模様を用いた瞑想の道具、または神格を表す図形","english_definition":"A geometric diagram, especially in the Tantric traditions of Hinduism, used as an aid to meditation or as a symbolic representation of a deity.","examples":[{"sentence":"The Sri Yantra is a complex geometric pattern used in meditation.","translation":"シュリー・ヤントラは、瞑想に用いられる複雑な幾何学模様です。"},{"sentence":"Each yantra is designed to resonate with a specific energy.","translation":"それぞれのヤントラは、特定のエネルギーと共鳴するように設計されています。"},{"sentence":"The yantra serves as a visual aid to focus the mind.","translation":"ヤントラは、心を集中させるための視覚的な補助として機能します。"}],"collocations":["Sri Yantra","Shiva Yantra","meditation yantra","geometric yantra","sacred yantra"],"synonyms":["mandala","geometric pattern","sacred diagram"],"antonyms":[]}],"etymology":{"value":"サンスクリット語の 'yantra' (यन्त्र) に由来し、「道具、機械、器具」を意味する。瞑想や儀式における象徴的な道具としての意味合いを持つ。","priority":"★★★"},"pronunciation":{"ipa":"/ˈjæntrə/","syllables":"yan-tra"},"inflection":{"notes":"複数形は yantras"},"usage_notes":{"explanation":"ヤントラは、ヒンドゥー教や仏教のタントラにおいて用いられる幾何学的な図形であり、特定の神格や宇宙の構造を象徴するとされます。瞑想の対象として用いられ、集中力を高め、精神的な洞察を深めるための道具として機能します。曼荼羅（mandala）と類似する点もありますが、ヤントラはより具体的な神格やエネルギーとの関連性が強い傾向があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a yantra in the church.","correct":"✓ I saw a yantra in the Hindu temple.","note":"ヤントラは主にヒンドゥー教や仏教の文脈で使用されます。"},{"incorrect":"✗ Yantra is a type of food.","correct":"✓ Yantra is a type of geometric diagram.","note":"ヤントラは食べ物ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["yantric (形容詞: ヤントラに関する)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"yantra\" refers to a specific type of geometric diagram used in certain religious traditions, primarily Hinduism and Buddhism, as a tool for meditation and spiritual practice. It's not a commonly used word in everyday conversation and is more likely to be encountered in contexts related to spirituality, art, or religious studies. Understanding the term requires some familiarity with these cultural and religious contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"She uses a yantra to aid her daily meditation practice.","translation":"彼女は毎日の瞑想を助けるためにヤントラを使用しています。","type":"noun","meaning_category":"瞑想の道具"},{"sentence":"The complex design of the yantra is believed to represent the cosmos.","translation":"ヤントラの複雑なデザインは、宇宙を表すと信じられています。","type":"noun","meaning_category":"象徴的な図形"},{"sentence":"Different yantras are associated with different deities and energies.","translation":"異なるヤントラは、異なる神々とエネルギーに関連付けられています。","type":"noun","meaning_category":"神格を表す図形"}]}