{"word":"Bultong","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A traditional type of preserved meat product from the Philippines, specifically the Cordillera region. It is made by salting, smoking, and air-drying pork or beef.","english_definition":"A type of dried meat product from the Philippines, specifically the Cordillera region, made by salting, smoking, and air-drying pork or beef.","examples":[{"sentence":"Bultong is a popular delicacy in the Mountain Province.","translation":"Bultongは、マウンテン州で人気のある珍味です。"},{"sentence":"We bought some bultong at the market to bring home as a souvenir.","translation":"お土産として持ち帰るために、市場でbultongを買いました。"}],"collocations":["eat bultong","make bultong","buy bultong","taste of bultong"],"synonyms":["tapuy","kinuday","etag"],"antonyms":[]}],"etymology":{"value":"The word 'bultong' comes from the local dialects of the Cordillera region in the Philippines.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbʊltɔŋ/","syllables":"Bul-tong"},"inflection":{"noun_plural":"bultongs"},"usage_notes":{"explanation":"Bultong is a specific type of preserved meat unique to the Cordillera region of the Philippines. It is often associated with special occasions and cultural traditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a bultong. It was made of chicken.","correct":"✓ I ate bultong. It was made of pork.","note":"Bultong is traditionally made from pork or beef, not chicken."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bultong' is a specialized term referring to a specific type of preserved meat from the Cordillera region of the Philippines. Understanding requires familiarity with Filipino cuisine and regional specialties. It is not a commonly used word outside of that context.","note":"This word is specific to a regional cuisine and culture."},"example_sentences":[{"sentence":"The bultong had a smoky and salty flavor.","translation":"そのbultongはスモーキーで塩辛い味がした。","type":"noun","meaning_category":"food"},{"sentence":"Bultong is often served during festivals in the Cordillera region.","translation":"Bultongは、コーディレラ地方の祭りの際に提供されることが多い。","type":"noun","meaning_category":"culture"}]}