{"word":"Church-approved","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"教会が公認した、教会によって承認された","english_definition":"Officially sanctioned or endorsed by a church, especially the Roman Catholic Church.","examples":[{"sentence":"The book is Church-approved and can be used in religious education.","translation":"その本は教会が公認しており、宗教教育で使用できます。"},{"sentence":"This is a Church-approved translation of the Bible.","translation":"これは教会が公認した聖書の翻訳です。"},{"sentence":"Only Church-approved charities receive funding from the diocese.","translation":"教区からの資金援助は、教会が公認した慈善団体のみが受けられます。"}],"collocations":["Church-approved curriculum (教会公認のカリキュラム)","Church-approved doctrine (教会公認の教義)","Church-approved organization (教会公認の組織)","Church-approved textbook (教会公認の教科書)"],"synonyms":["sanctioned","endorsed","authorized","official","canonical"],"antonyms":["unauthorized","unofficial","unapproved","non-canonical"]}],"etymology":{"value":"Combination of 'Church' (referring to a Christian religious organization, especially the Roman Catholic Church) and 'approved' (having or showing official acceptance or ratification).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃɜːrtʃ əˈpruːvd/","syllables":"Church-ap-proved"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"The term \"Church-approved\" typically refers to something that has been officially recognized or sanctioned by a church authority, often the Roman Catholic Church. It implies that the item or practice aligns with the church's doctrines, teachings, and standards. This term is often used in contexts related to religious education, literature, charities, and other activities associated with the church.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Church approved the building.","correct":"✓ The Church approved the building plans.","note":"'Church-approved' is usually used to describe plans, documents, or teachings, not physical buildings themselves."},{"incorrect":"✗ This is a church approved event.","correct":"✓ This is a Church-approved event.","note":"The hyphen is important to show that 'Church' modifies 'approved'. Also, capitalization of 'Church' is common when referring to the institution."}],"priority":"★★☆"},"related_words":{"derivatives":["approval (名詞: 承認)","approve (動詞: 承認する)","Church (名詞: 教会)"],"phrasal_verbs":[],"related_terms":["ecclesiastical","canonical","dogmatic","orthodox"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Church-approved' is a specialized term, often used within religious contexts, particularly those involving the Roman Catholic Church. It signifies that something has been officially sanctioned or endorsed by the Church, indicating alignment with its doctrines and standards. Due to its specific usage and context, it is more likely to be encountered by individuals familiar with religious terminology or those involved in religious activities or studies."},"example_sentences":[{"sentence":"The Church-approved curriculum ensures that students receive a comprehensive religious education.","translation":"教会が公認したカリキュラムは、生徒たちが包括的な宗教教育を受けられるようにします。","type":"adjective","meaning_category":"公認のカリキュラム"},{"sentence":"Only Church-approved charities are eligible to receive donations from the organization.","translation":"教会が公認した慈善団体のみが、その組織からの寄付を受け取る資格があります。","type":"adjective","meaning_category":"公認の慈善団体"},{"sentence":"The Church-approved translation of the Bible is widely used in schools and parishes.","translation":"教会が公認した聖書の翻訳は、学校や教区で広く使用されています。","type":"adjective","meaning_category":"公認の翻訳"}]}