{"word":"fluorometry","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"蛍光測光法、蛍光定量法","english_definition":"A method of quantitative analysis based on the measurement of fluorescence.","examples":[{"sentence":"Fluorometry is used to determine the concentration of a substance in a solution.","translation":"蛍光測光法は、溶液中の物質の濃度を決定するために使用されます。"},{"sentence":"The sensitivity of fluorometry makes it useful for detecting trace amounts of compounds.","translation":"蛍光測光法の感度により、微量の化合物の検出に役立ちます。"}],"collocations":["quantitative fluorometry (定量蛍光測光法)","fluorescence fluorometry (蛍光蛍光測光法)","atomic fluorometry (原子蛍光測光法)"],"synonyms":["spectrofluorometry","fluorescence spectroscopy"],"antonyms":[]}],"etymology":{"value":"'Fluoro-' (referring to fluorescence) + '-metry' (measurement).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌflʊəˈrɒmətri/","syllables":"flu-o-rom-e-try"},"inflection":{"noun_plural":"fluorometries"},"usage_notes":{"explanation":"Fluorometry is a technique used in analytical chemistry and biochemistry to measure the fluorescence of a sample. It's highly sensitive and can be used to quantify very small amounts of substances. The intensity of the emitted light is directly proportional to the concentration of the analyte, allowing for quantitative measurements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ fluorometry is the same as spectrophotometry.","correct":"✓ fluorometry measures fluorescence, while spectrophotometry measures absorbance.","note":"Fluorometry measures the emission of light by a substance, whereas spectrophotometry measures the absorption of light. They are different techniques."}],"priority":"★★☆"},"related_words":{"derivatives":["fluorometer (蛍光光度計)","fluorometric (蛍光測光の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Fluorometry is a scientific term used in chemistry and biology. It refers to a method for measuring the amount of light emitted by a substance when it is exposed to light. This technique is used to determine the concentration of certain substances in a sample. It requires a good understanding of scientific concepts and vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers used fluorometry to analyze the protein samples.","translation":"研究者たちは、蛍光測光法を用いてタンパク質サンプルを分析しました。","type":"general","meaning_category":"general"},{"sentence":"Fluorometry is a highly sensitive technique for detecting DNA.","translation":"蛍光測光法は、DNAを検出するための高感度な技術です。","type":"specific","meaning_category":"specific"}]}