{"word":"chasteness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"純潔、貞節、清純さ、慎み深さ","english_definition":"the state or quality of being chaste; purity, virginity, or abstention from sexual activity; modesty or simplicity.","examples":[{"sentence":"The painting depicted the goddess Diana as a symbol of chasteness.","translation":"その絵は女神ディアナを純潔の象徴として描いていた。"},{"sentence":"She was admired for her chasteness and devotion to her faith.","translation":"彼女は純潔さと信仰への献身で賞賛された。"},{"sentence":"The novel explores themes of chasteness and temptation.","translation":"その小説は純潔と誘惑というテーマを探求している。"}],"collocations":["maintain chasteness (純潔を保つ)","symbol of chasteness (純潔の象徴)","vow of chasteness (純潔の誓い)"],"synonyms":["purity","virginity","abstinence","celibacy","modesty","innocence","virtue"],"antonyms":["unchastity","impurity","promiscuity","licentiousness","lewdness"]}],"etymology":{"value":"Derived from 'chaste' + '-ness'. 'Chaste' comes from Old French 'chaste', from Latin 'castus' meaning 'pure, virtuous, morally correct'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃeɪstnəs/","syllables":"chaste-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Chasteness' is a formal term referring to the quality of being chaste, often associated with sexual purity or abstinence. It can also refer to simplicity or modesty in style or manner. It's not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed chasteness in his design by adding too many details.","correct":"✓ He showed simplicity in his design by avoiding unnecessary details.","note":"'Chasteness' in the sense of simplicity implies a lack of excess, not an abundance of details. Use 'simplicity' or 'restraint' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["chaste (adjective: pure, virtuous, abstaining from sexual activity)","chastely (adverb: in a chaste manner)"],"phrases":["vow of chastity"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chasteness' is a relatively uncommon and formal word that describes the state of being chaste, often in a moral or religious context. It implies purity, virginity, or abstinence from sexual activity, or a simple and modest style. It's more likely to be encountered in literature or historical texts than in everyday conversation. Understanding the related word 'chaste' is helpful for grasping the meaning of 'chasteness'."},"example_sentences":[{"sentence":"The nun took a vow of chasteness upon entering the convent.","translation":"その修道女は修道院に入る際に純潔の誓いを立てた。","type":"noun","meaning_category":"純潔の誓い"},{"sentence":"Her chasteness was seen as a virtue in that society.","translation":"彼女の純潔はその社会では美徳とみなされていた。","type":"noun","meaning_category":"美徳"},{"sentence":"The artist aimed for a sense of chasteness in the design of the building.","translation":"その建築家は建物のデザインに清純さを目指した。","type":"noun","meaning_category":"清純さ"}]}