{"word":"oomiak","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ウミアック：アラスカや北極圏に住むイヌイット、ユピックの人々が使う、骨組みにアザラシの皮などを張った大型のボート。家族や荷物の運搬に使われる。","english_definition":"An oomiak is a large, open skin boat used by Inuit and Yupik people, typically made of a wooden frame covered with sealskin. It is used for transporting families and goods.","examples":[{"sentence":"The family loaded their belongings into the oomiak for the journey.","translation":"家族は旅のためにウミアックに荷物を積み込んだ。"},{"sentence":"Oomiaks are essential for traditional Inuit whaling.","translation":"ウミアックは伝統的なイヌイットの捕鯨に不可欠である。"}],"collocations":["travel by oomiak","load an oomiak","traditional oomiak"],"synonyms":["umiak","skin boat","Inuit boat"],"antonyms":[]}],"etymology":{"value":"イヌイット語の'umiaq'に由来。","priority":"★★☆"},"pronunciation":{"ipa":"ˈuːmiæk","syllables":"oo-mi-ak"},"inflection":{"noun_plural":"oomiaks"},"usage_notes":{"explanation":"Oomiaks are traditionally used for hunting, fishing, and transportation in coastal areas. They are larger and more stable than kayaks, making them suitable for carrying multiple people and heavy loads. While modern materials are sometimes used, traditional construction methods are still practiced in some communities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He sailed in a kayak, which is a type of oomiak.","correct":"✓ He sailed in an oomiak, which is a type of large skin boat.","note":"Kayaks are smaller, single-person boats, while oomiaks are larger and carry multiple people."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"None (Specialized Vocabulary)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'oomiak' refers to a specific type of boat used by indigenous people in the Arctic. Understanding its meaning requires knowledge of Arctic cultures and traditional watercraft. It is not a commonly used word outside of specific contexts related to Arctic regions and anthropology."},"example_sentences":[{"sentence":"The hunters set out in their oomiaks to search for seals.","translation":"猟師たちはアザラシを探すためにウミアックで出発した。","type":"noun","meaning_category":"ボート"},{"sentence":"The oomiak provided a stable platform for whaling.","translation":"ウミアックは捕鯨のための安定した足場を提供した。","type":"noun","meaning_category":"ボート"}]}