{"word":"furrowingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"しわを寄せて、眉をひそめて、苦悩するように","english_definition":"In a manner that involves making furrows or wrinkles, especially on the forehead; in a troubled or worried way.","examples":[{"sentence":"He looked at the document furrowingly, trying to decipher the complex legal jargon.","translation":"彼は複雑な法律用語を解読しようと、書類に眉をひそめて目を通した。"},{"sentence":"She stared out the window furrowingly, lost in deep thought about the problem.","translation":"彼女は窓の外を苦悩するように見つめ、問題について深く考えていた。"}],"collocations":["look furrowingly","stare furrowingly","think furrowingly"],"synonyms":["worriedly","anxiously","pensively","thoughtfully","intently"],"antonyms":["unconcernedly","carelessly","indifferently"]}],"etymology":{"value":"Derived from the verb 'furrow' (to make a trench, groove, or wrinkle) and the suffix '-ingly' (indicating manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfʌroʊɪŋli/","syllables":"fur-row-ing-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Furrowingly' describes the manner in which someone performs an action, specifically indicating that they are doing so while furrowing their brow, usually due to worry, concentration, or confusion. It is not a commonly used word, and its usage often adds a sense of seriousness or concern to the description.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He furrowingly his brow.","correct":"He furrowed his brow. / He looked furrowingly.","note":"'Furrowingly' is an adverb and should modify a verb, not be used as a verb itself. The verb form is 'furrow'."}],"priority":"★★☆"},"related_words":{"derivatives":["furrow (noun, verb)","furrowed (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Furrowingly' is an advanced adverb that describes the act of doing something while furrowing one's brow, usually indicating worry or deep thought. It's not commonly used in everyday language and is more often found in literature or formal writing to add a specific nuance of concern or concentration."},"example_sentences":[{"sentence":"The detective examined the crime scene furrowingly, searching for any overlooked clue.","translation":"刑事は眉をひそめて犯罪現場を調べ、見落とされた手がかりがないか探した。","type":"adverb","meaning_category":"苦悩・集中"},{"sentence":"She listened to the explanation furrowingly, clearly not understanding the complex details.","translation":"彼女は複雑な詳細を理解していない様子で、説明に眉をひそめて耳を傾けた。","type":"adverb","meaning_category":"困惑・疑念"}]}