{"word":"tetrasome","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"四染色体性、四染色体","english_definition":"A cell or organism that has four copies of a particular chromosome instead of the usual two copies.","examples":[{"sentence":"The tetrasome condition can lead to genetic disorders.","translation":"四染色体性は遺伝性疾患につながる可能性があります。"},{"sentence":"Analysis revealed that the cell was tetrasome for chromosome 21.","translation":"分析の結果、その細胞は21番染色体について四染色体性であることが明らかになった。"}],"collocations":["chromosome tetrasome","tetrasome cell","tetrasome condition"],"synonyms":["none"],"antonyms":["disome","monosomy","nullisomy"]}],"etymology":{"value":"From tetra- (four) + -some (body).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛtrəˌsoʊm/","syllables":"tet-ra-some"},"inflection":{"noun_plural":"tetrasomes"},"usage_notes":{"explanation":"Tetrasomy is a type of aneuploidy, which is a condition where there is an abnormal number of chromosomes in a cell. In tetrasomy, a specific chromosome is present in four copies instead of the normal two. This can result in various genetic disorders and developmental abnormalities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tetrasome is when there are three chromosomes.","correct":"✓ The tetrasome is when there are four chromosomes.","note":"Tetrasomy refers to having four copies of a chromosome, not three. Having three copies is called trisomy."}],"priority":"★☆☆"},"related_words":{"derivatives":["tetrasomic (adjective)"],"related_terms":["aneuploidy","trisomy","monosomy","chromosome","genome"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in genetics and related scientific fields.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'tetrasome' is a specialized term used in the field of genetics. It refers to a condition where a cell or organism has four copies of a particular chromosome instead of the normal two. This concept is typically discussed in advanced biology or genetics courses and may not be familiar to the general public. Understanding the term requires knowledge of basic genetics and chromosome structure."},"example_sentences":[{"sentence":"The patient's cells were found to be tetrasome for chromosome 18.","translation":"患者の細胞は18番染色体について四染色体性であることが判明した。","type":"scientific","meaning_category":"genetics"},{"sentence":"Tetrasome individuals often exhibit a range of developmental abnormalities.","translation":"四染色体性の個体は、しばしばさまざまな発達異常を示す。","type":"scientific","meaning_category":"genetics"}]}