{"word":"gain-seeking","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"利益を追求する、利得を求める","english_definition":"Characterized by a desire to acquire gains or profits, often in a selfish or opportunistic manner.","examples":[{"sentence":"His gain-seeking behavior alienated his colleagues.","translation":"彼の利益追求的な行動は同僚を遠ざけた。"},{"sentence":"The company's gain-seeking strategies led to ethical compromises.","translation":"その会社の利益追求戦略は、倫理的な妥協につながった。"},{"sentence":"Gain-seeking motives can sometimes undermine long-term goals.","translation":"利益追求の動機は、長期的な目標を損なうことがある。"}],"collocations":["gain-seeking behavior","gain-seeking motives","gain-seeking activities","gain-seeking individuals","gain-seeking strategies"],"synonyms":["opportunistic","acquisitive","mercenary","self-seeking","profit-driven","materialistic"],"antonyms":["altruistic","selfless","philanthropic","charitable","benevolent"]}],"etymology":{"value":"The word is a compound of \"gain\" (from Old French \"gaaigne\", meaning profit or advantage) and \"seeking\" (from Old English \"sēcan\", meaning to look for or pursue).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡeɪnˌsiːkɪŋ/","syllables":"gain-seek-ing"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Gain-seeking\" describes actions or motivations primarily driven by the desire to acquire profit or advantage. It often carries a negative connotation, implying that the pursuit of gain is prioritized over ethical considerations or the well-being of others. The term is frequently used in discussions of economics, business ethics, and social behavior.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The gain-seeking person helped the poor.","correct":"✓ The altruistic person helped the poor.","note":"Gain-seeking implies a focus on personal profit, which is the opposite of helping others selflessly. Use \"altruistic\" or \"charitable\" instead."},{"incorrect":"✗ Gain-seeking is always good for society.","correct":"✓ Gain-seeking can sometimes be detrimental to society.","note":"While profit can drive innovation, unchecked gain-seeking can lead to exploitation and inequality. The statement should be nuanced."}],"priority":"★★☆"},"related_words":{"derivatives":["gainfully (adverb)","gainfulness (noun)"],"phrases":["rent-seeking (economic term for using resources to obtain economic gain without reciprocating any benefits to society through wealth creation)","profit maximization"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"gain-seeking\" is used to describe behaviors or strategies primarily motivated by the pursuit of profit or advantage. It often implies a self-interested approach where the acquisition of gains is prioritized, sometimes at the expense of ethical considerations or the welfare of others. This term is more common in academic, business, or ethical discussions rather than everyday conversation. Understanding the negative connotations associated with prioritizing personal gain is crucial for interpreting its usage correctly."},"example_sentences":[{"sentence":"The politician was accused of gain-seeking through insider trading.","translation":"その政治家はインサイダー取引を通じて利益を追求していると告発された。","type":"adjective","meaning_category":"利益を追求する"},{"sentence":"The company's gain-seeking approach led to environmental damage.","translation":"その会社の利益追求的なアプローチは環境破壊につながった。","type":"adjective","meaning_category":"利得を求める"},{"sentence":"Many economists argue that gain-seeking is a fundamental driver of economic growth.","translation":"多くの経済学者は、利益追求が経済成長の基本的な原動力であると主張している。","type":"adjective","meaning_category":"利益を追求する"}]}