{"word":"self-dominance","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己支配、自制心、克己心","english_definition":"The ability to control one's own impulses, emotions, and actions; self-control; willpower.","examples":[{"sentence":"Achieving self-dominance requires consistent effort and practice.","translation":"自己支配を達成するには、一貫した努力と訓練が必要です。"},{"sentence":"His self-dominance allowed him to remain calm under pressure.","translation":"彼の自制心のおかげで、彼はプレッシャーの下でも冷静さを保つことができました。"},{"sentence":"She demonstrated remarkable self-dominance by resisting the temptation.","translation":"彼女は誘惑に抵抗することで、目覚ましい克己心を示しました。"}],"collocations":["exercise self-dominance (自己支配を発揮する)","develop self-dominance (自己支配を養う)","lack self-dominance (自己支配を欠く)","show self-dominance (自己支配を示す)"],"synonyms":["self-control","self-discipline","willpower","self-mastery","self-command","restraint","composure"],"antonyms":["impulsiveness","lack of control","self-indulgence","weakness","abandonment","unrestraint"]}],"etymology":{"value":"The word is formed by combining \"self\" (referring to oneself) and \"dominance\" (the state of having control or power). Thus, self-dominance literally means having control or power over oneself.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˈdɒmɪnəns/","syllables":"self-dom-i-nance"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Self-dominance\" refers to the ability to regulate one's own behavior, emotions, and desires. It is often associated with maturity, responsibility, and the capacity to make rational decisions. While it can sometimes overlap with \"self-discipline\" and \"willpower,\" self-dominance often implies a broader and more comprehensive control over one's entire being.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a good self-dominance in the office.","correct":"✓ He demonstrates good self-dominance in the office.","note":"\"Self-dominance\" is a quality or attribute that one possesses and demonstrates, rather than something one has \"in\" a particular place. It's better to use verbs like \"demonstrate,\" \"exercise,\" or \"show\" to describe its presence."},{"incorrect":"✗ She is very self-dominance.","correct":"✓ She has a lot of self-dominance. / ✓ She is very self-controlled.","note":"\"Self-dominance\" is a noun, not an adjective. To describe someone who possesses this quality, use phrases like \"has self-dominance\" or use the adjective \"self-controlled\"."}],"priority":"★★☆"},"related_words":{"derivatives":["self-dominate (verb - to control oneself)","dominant (adjective - exerting control or influence)","dominate (verb - to control or influence)","dominance (noun - control or power)"],"phrasal_verbs":null,"related_concepts":["self-efficacy","emotional intelligence","delayed gratification","executive function","mindfulness","self-regulation"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. The concept is more commonly expressed using synonyms like \"self-control\" or \"self-discipline.\"","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Self-dominance\" is a more formal and less frequently used term for the ability to control one's emotions, impulses, and actions. It's similar to \"self-control\" or \"self-discipline\" but can imply a more comprehensive mastery over oneself. The word is often used in discussions about personal development, psychology, or leadership. Because it's not a common word, it's important to understand its meaning in context.","example_sentences":[{"sentence":"Through years of training, the athlete developed remarkable **self-dominance**.","translation":"長年の訓練を通して、その運動選手は目覚ましい自己支配を身につけた。","type":"example","meaning_category":"general"},{"sentence":"Effective leadership requires **self-dominance** and the ability to make rational decisions.","translation":"効果的なリーダーシップには、自己支配と合理的な意思決定能力が必要です。","type":"example","meaning_category":"leadership"},{"sentence":"The therapist worked with the patient to improve their **self-dominance** over addictive behaviors.","translation":"セラピストは、患者が依存性のある行動に対する自己支配を改善できるよう支援しました。","type":"example","meaning_category":"therapy"}]}}