{"word":"vitriolate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人やものを)硫酸塩で処理する","english_definition":"To treat or combine with a vitriolic substance or a sulfate.","examples":[{"sentence":"The chemist vitriolated the metal to test its resistance to corrosion.","translation":"化学者は金属の耐腐食性をテストするために、その金属を硫酸塩で処理した。"},{"sentence":"The process involves vitriolating the solution to extract the desired compound.","translation":"そのプロセスでは、目的の化合物を抽出するために溶液を硫酸塩で処理する。"}],"collocations":["vitriolate a metal","vitriolate a solution"],"synonyms":["sulfate","treat with sulfate"],"antonyms":[]},{"part_of_speech":"verb","transitivity":"vt","definition":"(人やものを)痛烈に批判する、酷評する","english_definition":"To criticize (someone or something) harshly or severely; to attack with vitriol.","examples":[{"sentence":"The critic vitriolated the author's new book in a scathing review.","translation":"評論家は痛烈なレビューで著者の新刊を酷評した。"},{"sentence":"He vitriolated his opponent's policies during the debate.","translation":"彼は討論中に相手の政策を痛烈に批判した。"}],"collocations":["vitriolate a book","vitriolate a policy","vitriolate an opponent"],"synonyms":["denounce","lambaste","castigate","excoriate","berate","vilify"],"antonyms":["praise","commend","laud","extol"]}],"etymology":{"value":"From 'vitriol,' referring to sulfuric acid or sharp, caustic criticism, plus the suffix '-ate,' indicating to treat or affect with.","priority":"★★☆"},"pronunciation":{"ipa":"ˈvɪtriəˌleɪt","syllables":"vi-tri-a-late"},"inflection":{"verb_forms":{"present_simple":["vitriolate","vitriolates"],"past_simple":"vitriolated","past_participle":"vitriolated","present_participle":"vitriolating"}},"usage_notes":{"explanation":"'Vitriolate' has two primary meanings: one related to chemical treatment with sulfates, and another referring to harsh and bitter criticism. The context usually clarifies which meaning is intended. The critical sense is more commonly encountered in figurative or literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist vitriolated the canvas with bright colors.","correct":"✓ The artist saturated the canvas with bright colors.","note":"'Vitriolate' in the sense of treating with sulfates is not appropriate for describing artistic application of colors. 'Saturate' would be more fitting."},{"incorrect":"✗ He vitriolated his friend for helping him.","correct":"✓ He thanked his friend for helping him.","note":"Vitriolate implies harsh criticism, so it would be inappropriate to use it in a context of gratitude."}],"priority":"★☆☆"},"related_words":{"derivatives":["vitriolic (adjective: bitter, caustic, sharply critical)","vitriol (noun: sulfuric acid; bitter criticism or malice)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'vitriolate' is relatively rare and has both a technical (chemical) and a figurative (critical) meaning. Understanding requires a strong vocabulary and ability to discern context. The figurative sense, implying harsh and scathing criticism, is more commonly encountered in advanced literature and academic writing."},"example_sentences":[{"sentence":"The alchemist attempted to vitriolate the base metal in hopes of transmuting it into gold.","translation":"錬金術師は卑金属を金に変えることを期待して、その金属を硫酸塩で処理しようとした。","type":"verb (vt)","meaning_category":"硫酸塩で処理する"},{"sentence":"The political commentator vitriolated the government's new economic policy, calling it a disaster.","translation":"政治評論家は政府の新たな経済政策を酷評し、それを災害と呼んだ。","type":"verb (vt)","meaning_category":"痛烈に批判する"}]}