{"word":"air-quality-sensitive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"空気質に敏感な、空気質の変化に影響を受けやすい","english_definition":"Susceptible to changes or variations in air quality; easily affected by air pollution or allergens in the air.","examples":[{"sentence":"People who are air-quality-sensitive may experience respiratory problems on days with high pollution levels.","translation":"空気質に敏感な人は、汚染レベルが高い日に呼吸器系の問題を起こすことがあります。"},{"sentence":"Air-quality-sensitive individuals should monitor air quality reports and take necessary precautions.","translation":"空気質に敏感な人は、空気質に関する情報を監視し、必要な予防措置を講じるべきです。"}],"collocations":["air-quality-sensitive individuals","air-quality-sensitive groups","air-quality-sensitive populations"],"synonyms":["reactive to air quality","susceptible to air pollution","vulnerable to air quality changes"],"antonyms":["air-quality-insensitive","resistant to air pollution"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'air quality' (referring to the condition of the air) and 'sensitive' (meaning easily affected or responsive).","priority":"N/A"},"pronunciation":{"ipa":"/ˈɛər ˈkwɒlɪti ˈsɛnsɪtɪv/","syllables":"air-qual-i-ty-sen-si-tive"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more air-quality-sensitive, most air-quality-sensitive)."},"usage_notes":{"explanation":"This term is often used in environmental health and medical contexts to describe individuals or groups who are particularly vulnerable to the negative effects of poor air quality. This can include people with asthma, allergies, or other respiratory conditions.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ air quality sensitive","correct":"✓ air-quality-sensitive","note":"The hyphenation helps to clarify that 'air-quality' is acting as a single adjective modifying 'sensitive'."}],"priority":"N/A"},"related_words":{"derivatives":["air quality","sensitive","sensitivity"],"related_terms":["air pollution","asthma","allergies","respiratory problems","environmental health"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to technical or medical contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'air-quality-sensitive' describes individuals who are easily affected by changes in air quality, particularly air pollution. This term is often used in medical or environmental contexts to refer to people with conditions like asthma or allergies that make them more vulnerable to poor air quality. It's important to monitor air quality reports and take precautions if you are air-quality-sensitive."},"example_sentences":[{"sentence":"Children and the elderly are often more air-quality-sensitive.","translation":"子供や高齢者は、しばしば空気質に敏感です。","type":"adjective","meaning_category":"Susceptible to air quality"},{"sentence":"The city issued an alert for air-quality-sensitive residents due to high ozone levels.","translation":"市は、高濃度のオゾンにより、空気質に敏感な住民に対して注意報を発令しました。","type":"adjective","meaning_category":"Susceptible to air quality"}]}