{"word":"Truncher","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, humorous) A person who eats noisily or greedily.","english_definition":"A person who eats noisily or greedily.","examples":[{"sentence":"He was such a truncher that everyone at the table could hear him chewing.","translation":"彼はとても音を立てて食べる人だったので、テーブルのみんなが彼の咀嚼音を聞くことができた。"},{"sentence":"Don't be such a truncher; try to eat more politely.","translation":"そんなに音を立てて食べないで。もっと上品に食べるようにして。"}],"collocations":["noisy truncher","greedy truncher"],"synonyms":["glutton","guzzler","chomper"],"antonyms":["nibbler","sipper"]}],"etymology":{"value":"Likely a blend of 'trench' (to eat heartily) and 'crunch' (to chew noisily). The word suggests someone who attacks their food aggressively and audibly.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrʌntʃər/","syllables":"trun-cher"},"inflection":{"noun_plural":"trunchers"},"usage_notes":{"explanation":"'Truncher' is a relatively rare and informal word, often used humorously to describe someone who eats in a loud or greedy manner. It is not a standard dictionary word but is understandable due to its descriptive nature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He trunchered the table.","correct":"✓ He was a truncher at the table.","note":"'Truncher' is a noun, not a verb. It describes a person, not an action."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not a standard word)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Truncher' is a rare and informal word, primarily understood through context and its suggestive combination of 'trench' and 'crunch.' It describes someone who eats noisily and greedily, a concept easily grasped but not commonly expressed with this specific term."},"example_sentences":[{"sentence":"The little boy was a real truncher, devouring his spaghetti with gusto.","translation":"その少年は本当に音を立てて食べる人で、スパゲッティを勢いよくむさぼり食っていた。","type":"noun","meaning_category":"noisy eater"},{"sentence":"Stop being such a truncher and try to chew with your mouth closed.","translation":"そんなに音を立てて食べるのはやめて、口を閉じて噛むようにして。","type":"noun","meaning_category":"greedy eater"}]}