{"word":"prochronic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(時間的に)時代錯誤の、時期尚早の、予定より早い","english_definition":"occurring or existing before its proper or expected time; anachronistic; premature.","examples":[{"sentence":"The prochronic appearance of smartphones in a historical drama would be jarring.","translation":"歴史ドラマにスマートフォンが時代錯誤的に登場すれば、不快感を与えるだろう。"},{"sentence":"His prochronic enthusiasm for the project was admirable, but ultimately unrealistic.","translation":"彼のプロジェクトに対する時期尚早な熱意は称賛に値するが、結局のところ非現実的だった。"}],"collocations":["prochronic appearance","prochronic enthusiasm","prochronic development"],"synonyms":["anachronistic","premature","untimely","early","out of time","out of date"],"antonyms":["anachronic","late","timely","appropriate","synchronous"]}],"etymology":{"value":"Derived from the Greek πρό (pro, \"before\") + χρόνος (chronos, \"time\") + -ικος (-ikos, adjectival suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈkrɒnɪk/","syllables":"pro-chron-ic"},"inflection":{"adjective_forms":{"comparative":"more prochronic","superlative":"most prochronic"}},"usage_notes":{"explanation":"\"Prochronic\" is used to describe something that appears or occurs earlier than it should, often creating a sense of being out of place or time. It is similar to \"anachronistic,\" but specifically emphasizes the temporal aspect of being too early, rather than simply being out of its historical context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The prochronic event happened after the scheduled time.","correct":"✓ The prochronic event happened before the scheduled time.","note":"\"Prochronic\" implies something happening *before* its expected time, not after."},{"incorrect":"✗ He was prochronic because he was always late.","correct":"✓ He was anachronic because his ideas were outdated.","note":"\"Prochronic\" refers to something being *too early*, while \"anachronic\" refers to something being *out of its historical context* or outdated."}],"priority":"★★☆"},"related_words":{"derivatives":["prochronism (noun: an instance of something being prochronic)"],"related_terms":["anachronism (noun: something out of its proper time)","chronology (noun: the arrangement of events in time)","synchronous (adjective: occurring at the same time)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Prochronic\" is a relatively rare and specialized term used to describe something that appears or occurs before its expected time. It is often used in academic or technical contexts, particularly when discussing historical accuracy or temporal anomalies. The word is formed from Greek roots, indicating its connection to concepts of time and order. Understanding the word requires a grasp of abstract temporal relationships and a familiarity with more advanced vocabulary. It is not commonly encountered in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The novel featured a prochronic depiction of technology that wouldn't exist for another century.","translation":"その小説は、あと1世紀は存在しない技術の時代錯誤的な描写を特徴としていた。","type":"adjective","meaning_category":"時代錯誤の"},{"sentence":"The prochronic implementation of the new system led to numerous unforeseen problems.","translation":"新しいシステムの時期尚早な導入は、数多くの予期せぬ問題を引き起こした。","type":"adjective","meaning_category":"時期尚早の"}]}