{"word":"Vinblastine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ビンブラスチン：ホジキン病、非ホジキンリンパ腫、乳癌、肺癌、カポジ肉腫などの治療に用いられる、ニチニチソウ由来の抗悪性腫瘍剤","english_definition":"An antineoplastic drug derived from the periwinkle plant, used to treat Hodgkin's disease, non-Hodgkin's lymphoma, breast cancer, lung cancer, Kaposi's sarcoma, and other cancers.","examples":[{"sentence":"Vinblastine is administered intravenously.","translation":"ビンブラスチンは静脈内投与される。"},{"sentence":"Side effects of vinblastine include nausea and hair loss.","translation":"ビンブラスチンの副作用には、吐き気や脱毛などがある。"}],"collocations":["vinblastine sulfate","vinblastine dosage","vinblastine side effects","administer vinblastine","vinblastine chemotherapy"],"synonyms":["VLB","Velban"],"antonyms":[]}],"etymology":{"value":"Derived from the plant *Vinca rosea* (periwinkle), from which it was first isolated. The name reflects its origin and chemical structure.","priority":"★★☆"},"pronunciation":{"ipa":"/vɪnˈblæstiːn/","syllables":"vin-blas-tine"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Vinblastine is a chemotherapy medication that belongs to the vinca alkaloid class of drugs. It works by disrupting microtubule assembly, which is essential for cell division, thereby inhibiting cancer cell growth. It is typically administered intravenously by medical professionals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Vinblastine is a type of vitamin.","correct":"✓ Vinblastine is a chemotherapy drug.","note":"Vinblastine is an antineoplastic drug, not a vitamin."},{"incorrect":"✗ Vinblastine can be taken orally.","correct":"✓ Vinblastine is administered intravenously.","note":"Vinblastine is usually given through intravenous injection."}],"priority":"★★☆"},"related_words":{"derivatives":["vincristine (another vinca alkaloid drug)","vinca alkaloids (class of drugs)"],"phrasal_verbs":[]},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in medical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Vinblastine is a technical term used in the field of medicine, specifically in oncology. It refers to a specific chemotherapy drug used to treat various types of cancer. Understanding its usage requires knowledge of medical terminology and cancer treatment protocols. It is not a word commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The oncologist prescribed vinblastine as part of the patient's chemotherapy regimen.","translation":"腫瘍医は、患者の化学療法レジメンの一部としてビンブラスチンを処方した。","type":"general","meaning_category":"medical"},{"sentence":"Research is ongoing to improve the efficacy and reduce the side effects of vinblastine.","translation":"ビンブラスチンの有効性を改善し、副作用を軽減するための研究が進行中である。","type":"research","meaning_category":"medical"}]}