{"word":"Russify","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ロシア化する、ロシア風にする","english_definition":"To make Russian in character; to bring under Russian influence or control; to cause to conform to Russian language, culture, or customs.","examples":[{"sentence":"The government attempted to Russify the ethnic minorities.","translation":"政府は少数民族をロシア化しようと試みた。"},{"sentence":"The region was Russified through the introduction of Russian language schools.","translation":"その地域は、ロシア語学校の導入によってロシア化された。"},{"sentence":"They tried to Russify their names to fit in better.","translation":"彼らはより馴染むために名前をロシア風にしようとした。"}],"collocations":["Russify a region","Russify a name","Russify a culture","Russify the education system"],"synonyms":["Russianize","Sovietize","assimilate","integrate"],"antonyms":["de-Russify","de-Sovietize","westernize","europeanize"]}],"etymology":{"value":"From 'Russian' + '-ify'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrʌsɪfaɪ/","syllables":"Rus-si-fy"},"inflection":{"verb_forms":{"present_simple":["Russify","Russifies"],"past_simple":"Russified","past_participle":"Russified","present_participle":"Russifying"}},"usage_notes":{"explanation":"'Russify' typically refers to the process of imposing Russian language, culture, or customs on a population or region. It often implies a deliberate policy or effort to assimilate non-Russian groups into Russian society. The term can have negative connotations, especially when it involves the suppression of local languages or cultures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ They russified the food by adding pasta.","correct":"✓ They Italianized the food by adding pasta.","note":"'Russify' should be used when making something Russian, not generally changing the cuisine."},{"incorrect":"✗ The city was russified after a big storm.","correct":"✓ The city was damaged after a big storm.","note":"'Russify' implies cultural or political influence, not physical damage."}],"priority":"★★☆"},"related_words":{"derivatives":["Russification (noun)","Russifier (noun)"],"related_terms":["Russian","Russia","Sovietize","Assimilation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Russify' is a specialized term referring to the process of making something Russian in character or bringing it under Russian influence. It is not a commonly used word in everyday conversation but is more likely to appear in historical or political contexts. Understanding the term requires knowledge of Russian history and cultural influence."},"example_sentences":[{"sentence":"The tsarist regime sought to Russify the Baltic provinces.","translation":"帝政ロシアはバルト地方をロシア化しようとした。","type":"verb","meaning_category":"ロシア化する"},{"sentence":"The policy of Russification aimed to suppress local cultures.","translation":"ロシア化政策は、現地の文化を抑圧することを目的としていた。","type":"noun (Russification)","meaning_category":"ロシア化"},{"sentence":"Some immigrants Russified their names to assimilate more easily.","translation":"移民の中には、より容易に同化するために名前をロシア風にした者もいた。","type":"verb","meaning_category":"ロシア風にする"}]}