{"word":"persistable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"永続化できる、持続可能な","english_definition":"Capable of being persisted; able to be stored and retrieved reliably over time.","examples":[{"sentence":"This data structure is persistable, allowing us to save it to disk.","translation":"このデータ構造は永続化可能であり、ディスクに保存することができます。"},{"sentence":"We need to ensure that the application state is persistable in case of a system failure.","translation":"システム障害が発生した場合に備えて、アプリケーションの状態が永続化可能であることを確認する必要があります。"}],"collocations":["persistable data","persistable object","persistable state"],"synonyms":["durable","persistent","savable"],"antonyms":["transient","temporary","volatile"]}],"etymology":{"value":"The word \"persistable\" is formed by combining the verb \"persist\" with the suffix \"-able\", indicating the capability of persisting.","priority":"★★★"},"pronunciation":{"ipa":"/pərˈsɪstəbəl/","syllables":"per-sis-ta-ble"},"inflection":{"adjective_forms":{"comparative":"more persistable","superlative":"most persistable"}},"usage_notes":{"explanation":"\"Persistable\" is commonly used in computer science and software engineering to describe data or objects that can be stored in a non-volatile memory (e.g., a hard drive or database) and retrieved later. It emphasizes the ability to maintain data integrity and availability over time, even across system restarts or failures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The persistable of the data is important.","correct":"✓ The persistence of the data is important.","note":"\"Persistable\" is an adjective, while \"persistence\" is the noun form referring to the quality or state of being persistent."}],"priority":"★★☆"},"related_words":{"derivatives":["persist (verb)","persistence (noun)","persistently (adverb)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Persistable\" is a technical term, primarily used in computing contexts. It refers to the characteristic of data or objects that allows them to be reliably stored and retrieved over extended periods. It implies a level of durability and the ability to survive system interruptions or shutdowns without data loss. Understanding this term is essential for those working with databases, data storage, and software architecture.","priority":"★★★"},"example_sentences":[{"sentence":"The configuration settings are stored in a persistable format.","translation":"構成設定は永続化可能な形式で保存されます。","type":"adjective","meaning_category":"永続化できる"},{"sentence":"Making the game state persistable allows players to resume their progress later.","translation":"ゲームの状態を永続化可能にすることで、プレイヤーは後で進行状況を再開できます。","type":"adjective","meaning_category":"永続化できる"}]}