{"word":"allergenize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"アレルゲン化する、アレルギー反応を引き起こすようにする","english_definition":"To cause to become allergenic; to treat or modify (a substance) so that it becomes capable of causing an allergic reaction.","examples":[{"sentence":"The process of roasting peanuts can allergenize certain proteins.","translation":"ピーナッツを焙煎する過程で、特定のタンパク質がアレルゲン化されることがある。"},{"sentence":"Some researchers are studying how food processing techniques can allergenize previously harmless substances.","translation":"一部の研究者は、食品加工技術が以前は無害だった物質をどのようにアレルゲン化するかを研究している。"}],"collocations":["allergenize a protein (タンパク質をアレルゲン化する)","allergenize a food (食品をアレルゲン化する)"],"synonyms":["sensitize","immunize (in a specific context)"],"antonyms":["deallergenize","hypoallergenize"]},{"part_of_speech":"verb","transitivity":"vt","definition":"（人）をアレルギー体質にする、アレルギー反応を起こしやすくする","english_definition":"To make (a person or animal) susceptible to an allergic reaction.","examples":[{"sentence":"Early exposure to certain substances may allergenize infants.","translation":"特定の物質への早期暴露は、乳幼児をアレルギー体質にする可能性がある。"},{"sentence":"Genetic factors can predispose individuals to be easily allergenized.","translation":"遺伝的要因は、個人が容易にアレルギー体質になる素因となる可能性がある。"}],"collocations":["allergenize an infant (乳児をアレルギー体質にする)","allergenize a child (子供をアレルギー体質にする)"],"synonyms":["sensitize","predispose"],"antonyms":["desensitize"]}],"etymology":{"value":"Formed from 'allergen' (a substance that causes an allergic reaction) and the suffix '-ize' (to cause to become).","priority":"☆☆☆"},"pronunciation":{"ipa":"/əˈlɜːrdʒənaɪz/","syllables":"al-ler-gen-ize"},"inflection":{"verb_forms":{"present_simple":["allergenize","allergenizes"],"past_simple":"allergenized","past_participle":"allergenized","present_participle":"allergenizing"}},"usage_notes":{"explanation":"The term 'allergenize' is primarily used in scientific and medical contexts to describe the process by which a substance becomes capable of triggering an allergic reaction, or the process by which an individual becomes more susceptible to allergic reactions. It is not a commonly used word in everyday conversation.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor allergenized the patient.","correct":"✓ The doctor tested the patient for allergens. / ✓ The doctor determined that the patient was allergic to certain substances.","note":"Doctors don't 'allergenize' patients; they test for allergies or determine sensitivities. 'Allergenize' describes the process of a substance becoming allergenic or a person becoming susceptible, not a medical procedure. "},{"incorrect":"✗ The food was allergenized, so I ate it.","correct":"✓ The food contained allergens, so I avoided it.","note":"If food is 'allergenized' (contains allergens), you would avoid it if you have allergies. The sentence implies the opposite."}],"priority":"☆☆☆"},"related_words":{"derivatives":["allergen (名詞: アレルゲン)","allergenic (形容詞: アレルギー性の)","allergy (名詞: アレルギー)","allergy-prone (形容詞: アレルギーを起こしやすい)"],"phrasal_verbs":[],"related_concepts":["hypersensitivity","immune response","anaphylaxis","cross-reactivity"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"Low frequency - Primarily used in scientific and medical literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Allergenize' is a technical term used in scientific and medical contexts. It describes the process of making something allergenic (capable of causing an allergic reaction) or making someone more susceptible to allergies. This word is not commonly used in everyday language and is more likely to be encountered in scientific papers, medical journals, or discussions related to food science and immunology. Understanding the term requires a good grasp of the concept of allergens and allergic reactions."},"example_sentences":[{"sentence":"Industrial processes can inadvertently allergenize food proteins, increasing the risk of allergic reactions.","translation":"工業プロセスは、不注意に食品タンパク質をアレルゲン化し、アレルギー反応のリスクを高める可能性がある。","type":"verb (vt)","meaning_category":"アレルゲン化する"},{"sentence":"Researchers are investigating whether early exposure to certain environmental factors can allergenize children to common allergens.","translation":"研究者たちは、特定の環境因子への早期暴露が、子供たちを一般的なアレルゲンに対してアレルギー体質にするかどうかを調査している。","type":"verb (vt)","meaning_category":"アレルギー体質にする"},{"sentence":"The study aimed to understand how different cooking methods might allergenize the proteins in shellfish.","translation":"その研究は、さまざまな調理方法がどのように貝類のタンパク質をアレルゲン化するのかを理解することを目的としていた。","type":"verb (vt)","meaning_category":"アレルゲン化する"}]}