{"word":"steelified","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"鋼鉄のようにされた、鋼鉄のような特性を持つ","english_definition":"Made to resemble or possess the properties of steel; hardened or strengthened like steel.","examples":[{"sentence":"The knight's steelified armor gleamed in the sunlight.","translation":"騎士の鋼鉄のようにされた鎧は太陽光の中で輝いた。"},{"sentence":"The steelified resolve of the team helped them win the championship.","translation":"チームの鋼鉄のように固い決意が、彼らの優勝を助けた。"}],"collocations":["steelified armor","steelified resolve","steelified structure"],"synonyms":["hardened","strengthened","fortified","reinforced","tempered"],"antonyms":["weakened","softened","vulnerable"]}],"etymology":{"value":"Derived from the verb 'steelify,' which means to convert into steel or to impart the qualities of steel.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstiːlɪfaɪd/","syllables":"stee-li-fied"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Steelified' is often used metaphorically to describe something that has been made strong, resilient, or unyielding, similar to the properties of steel. It can also refer to a literal process of making something steel-like.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The steelified building was made of wood.","correct":"The steelified building was reinforced with steel.","note":"'Steelified' implies the presence or properties of steel, so it's more appropriate to use it when steel is involved in some way."}],"priority":"★☆☆"},"related_words":{"derivatives":["steelify (verb)","steelification (noun)"],"related_terms":["steel","iron","metal","armor","fortification"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Steelified' is a relatively uncommon word, generally used in descriptive or figurative contexts to convey the idea of something being made strong or resilient like steel. It is more often found in literature or technical descriptions. Understanding the properties of steel (strength, hardness) is helpful in interpreting the meaning of 'steelified.'"},"example_sentences":[{"sentence":"The artist created a steelified sculpture that could withstand harsh weather.","translation":"その芸術家は、厳しい天候に耐えられる鋼鉄のようにされた彫刻を制作した。","type":"adjective","meaning_category":"Hardened/Strengthened"},{"sentence":"Years of hardship had given him a steelified spirit.","translation":"長年の苦難が彼に鋼鉄のように固い精神を与えた。","type":"adjective","meaning_category":"Resilient/Unyielding"}]}