{"word":"resegregates","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び分離する、再分離する","english_definition":"To segregate again; to separate again after a period of integration or desegregation.","examples":[{"sentence":"The school board feared that the new policy would resegregate the schools.","translation":"教育委員会は、新しい政策が学校を再び分離させるのではないかと懸念した。"},{"sentence":"Economic factors can resegregate neighborhoods over time.","translation":"経済的要因は、時間の経過とともに地域社会を再分離させる可能性がある。"}],"collocations":["resegregate schools","resegregate neighborhoods","resegregate communities"],"synonyms":["resort","separate","divide","isolate"],"antonyms":["integrate","desegregate","unite","combine"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning 'again') to the verb 'segregate' (meaning 'to separate or divide').","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːˈsɛɡrɪɡeɪts/","syllables":"re-seg-re-gates"},"inflection":{"verb_forms":{"present_simple":["resegregates"],"past_simple":"resegregated","past_participle":"resegregated","present_participle":"resegregating"}},"usage_notes":{"explanation":"'Resegregates' is primarily used in the context of social issues, particularly concerning race, ethnicity, or socioeconomic status. It describes the process of a previously integrated or desegregated system or community reverting to a state of separation. The term often carries negative connotations, implying a step backward in social progress.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city resegregates because of the new law.","correct":"✓ The city resegregated because of the new law.","note":"The past tense 'resegregated' should be used to indicate that the action of resegregation has already occurred."},{"incorrect":"✗ The community is resegregating by itself.","correct":"✓ The community is resegregating due to various factors.","note":"Resegregation usually occurs due to specific factors or policies, not spontaneously. Providing context adds clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["resegregation (noun)","resegregated (adjective)"],"antonyms":["integration","desegregation"],"related_concepts":["segregation","discrimination","social inequality","racial bias"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized vocabulary related to social issues.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Resegregates' is a complex term used in discussions about social and political issues, particularly those related to race and inequality. It means that a place or system that was once integrated (where different groups were mixed together) has become separated again. This often happens in schools or neighborhoods. The word is not commonly used in everyday conversation, but it's important to understand in the context of social justice and history.","priority":"★★☆"},"example_sentences":[{"sentence":"The study found that housing patterns often resegregate communities along racial lines.","translation":"その研究は、住宅パターンが人種によって地域社会を再分離させることが多いことを発見した。","type":"verb","meaning_category":"再び分離する"},{"sentence":"Many fear that changes in school zoning will resegregate the city's public schools.","translation":"多くの人々は、学区の変更が市内の公立学校を再分離させるのではないかと懸念している。","type":"verb","meaning_category":"再び分離する"},{"sentence":"After years of integration efforts, some neighborhoods are unfortunately resegregating.","translation":"長年の統合努力の後、残念ながら一部の地域社会は再分離している。","type":"verb","meaning_category":"再び分離する"}]}