{"word":"bandgap","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"バンドギャップ（半導体や絶縁体における、電子が存在できないエネルギー範囲）","english_definition":"The energy range in a solid where no electron states can exist.","examples":[{"sentence":"The bandgap of silicon is about 1.1 eV.","translation":"シリコンのバンドギャップは約1.1 eVです。"},{"sentence":"The bandgap determines the color of the LED.","translation":"バンドギャップはLEDの色を決定します。"},{"sentence":"Direct bandgap semiconductors are suitable for lasers.","translation":"直接バンドギャップ半導体はレーザーに適しています。"}],"collocations":["direct bandgap","indirect bandgap","bandgap energy","wide bandgap semiconductor","narrow bandgap semiconductor"],"synonyms":["energy gap"],"antonyms":[]}],"etymology":{"value":"'Band' refers to the energy bands of electrons in a solid, and 'gap' refers to the energy range where no electron states are allowed.","priority":"★★★"},"pronunciation":{"ipa":"ˈbændˌɡæp","syllables":"band-gap"},"inflection":{"noun_plural":"bandgaps"},"usage_notes":{"explanation":"The bandgap is a fundamental property of semiconductors and insulators. It determines the electrical and optical properties of the material. The size of the bandgap dictates whether a material is a conductor, semiconductor, or insulator.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The band gap is measured in volts.","correct":"✓ The bandgap is measured in electron volts (eV).","note":"Bandgaps are measured in units of energy, typically electron volts (eV)."},{"incorrect":"✗ Metals have a large bandgap.","correct":"✓ Metals have no bandgap (or overlapping bands).","note":"Metals are conductors and have no bandgap or overlapping bands, allowing electrons to move freely."}],"priority":"★★☆"},"related_words":{"derivatives":["band structure","energy band","semiconductor","insulator","valence band","conduction band"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bandgap' is a technical term used in solid-state physics and materials science. It refers to the energy range where no electron states can exist in a solid material. Understanding this term requires knowledge of quantum mechanics and solid-state physics concepts such as energy bands, valence bands, and conduction bands. It is primarily used in scientific and engineering contexts when discussing the properties of semiconductors, insulators, and other materials."},"example_sentences":[{"sentence":"The **bandgap** of this material makes it suitable for solar cells.","translation":"この材料のバンドギャップは、太陽電池に適しています。","type":"noun","meaning_category":"バンドギャップ"},{"sentence":"Engineers are trying to create materials with tunable **bandgaps**.","translation":"エンジニアは、調整可能なバンドギャップを持つ材料を作成しようとしています。","type":"noun","meaning_category":"バンドギャップ"},{"sentence":"The **bandgap** energy is crucial for determining the material's optical properties.","translation":"バンドギャップエネルギーは、材料の光学特性を決定するために重要です。","type":"noun","meaning_category":"バンドギャップ"}]}