{"word":"Vouchering","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(会計) 伝票処理、証拠書類の整理・保管","english_definition":"The process of assembling and verifying supporting documents for accounting transactions; the act of creating and managing vouchers.","examples":[{"sentence":"Proper vouchering is essential for maintaining accurate financial records.","translation":"適切な伝票処理は、正確な財務記録を維持するために不可欠です。"},{"sentence":"The auditor reviewed the vouchering process to ensure compliance with regulations.","translation":"監査人は、規制遵守を確実にするために伝票処理プロセスをレビューしました。"}],"collocations":["vouchering process","vouchering system","vouchering documents","expense vouchering"],"synonyms":["documentation","record-keeping","verification","validation"],"antonyms":[]},{"part_of_speech":"verb","definition":"(会計) 伝票を作成する、証拠書類を添付する","english_definition":"To create a voucher for an expense or transaction; to attach supporting documents to a voucher.","examples":[{"sentence":"All expenses must be vouchered before reimbursement.","translation":"すべての費用は、払い戻しの前に伝票処理されなければなりません。"},{"sentence":"The accounts payable clerk is responsible for vouchering invoices.","translation":"買掛金担当者は、請求書の伝票処理を担当します。"}],"collocations":["voucher expenses","voucher invoices","voucher payments"],"synonyms":["document","record","verify","validate"],"antonyms":[]}],"etymology":{"value":"Derived from the word 'voucher,' which comes from the Old French 'voucher' meaning 'to summon (to court), to call upon,' ultimately from Latin 'vocare' meaning 'to call.' The '-ing' suffix denotes the process or action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvaʊtʃərɪŋ/","syllables":"vouch-er-ing"},"inflection":{"verb_forms":{"present_participle":"vouchering","past_simple":"vouchered","past_participle":"vouchered"},"noun_plural":"voucherings"},"usage_notes":{"explanation":"'Vouchering' is primarily used in accounting and finance contexts. It refers to the systematic process of collecting, organizing, and verifying documents that support financial transactions. This ensures accuracy, transparency, and compliance with accounting standards. The term can also refer to the act of creating individual vouchers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The vouchering was done by the manager.","correct":"✓ The vouchering process was overseen by the manager.","note":"'Vouchering' itself is the process, not the action of a person. Use 'vouchering process' to describe what the manager oversees."},{"incorrect":"✗ He is vouchering the money.","correct":"✓ He is vouchering the expenses.","note":"'Vouchering' refers to the documentation of expenses, not the money itself. Use 'documenting' or 'recording' if referring to the money."}],"priority":"★★☆"},"related_words":{"derivatives":["voucher","voucherable"],"phrasal_verbs":[],"related_concepts":["accounts payable","general ledger","audit trail","internal controls","GAAP (Generally Accepted Accounting Principles)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vouchering' is a specialized term primarily used in accounting and finance. It describes the detailed process of collecting, verifying, and documenting financial transactions with supporting evidence. This ensures that financial records are accurate and compliant with accounting standards. The term is more commonly encountered in professional contexts related to auditing, accounts payable, and financial management. Understanding this term is crucial for those working directly with financial documentation and compliance.","word_family":["voucher"]},"example_sentences":[{"sentence":"The company implemented a new vouchering system to streamline expense reporting.","translation":"会社は経費報告を効率化するために新しい伝票処理システムを導入しました。","type":"noun","meaning_category":"伝票処理"},{"sentence":"She is responsible for vouchering all invoices before payment.","translation":"彼女は支払い前にすべての請求書を伝票処理する責任があります。","type":"verb","meaning_category":"伝票を作成する"},{"sentence":"The auditor examined the vouchering procedures to ensure accuracy.","translation":"監査人は、正確性を確保するために伝票処理手順を調べました。","type":"noun","meaning_category":"伝票処理"},{"sentence":"All supporting documents must be attached when vouchering expenses.","translation":"経費を伝票処理する際は、すべての証拠書類を添付する必要があります。","type":"verb","meaning_category":"伝票を作成する"}]}