{"word":"capacity-building","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"能力構築、能力開発","english_definition":"The process by which individuals, organizations, institutions and societies develop abilities (individually and collectively) to perform functions, solve problems and set and achieve objectives.","examples":[{"sentence":"The organization is involved in capacity-building projects in developing countries.","translation":"その組織は発展途上国における能力構築プロジェクトに関わっている。"},{"sentence":"Capacity-building is essential for sustainable development.","translation":"能力構築は持続可能な開発に不可欠である。"},{"sentence":"The workshop focused on capacity-building for local communities.","translation":"そのワークショップは地域社会のための能力構築に焦点を当てた。"}],"collocations":["capacity-building project","capacity-building program","institutional capacity-building","human capacity-building","local capacity-building"],"synonyms":["development","empowerment","training","skill-building","improvement"],"antonyms":["capacity destruction","weakening","degradation"]}],"etymology":{"value":"The term 'capacity-building' emerged in the late 20th century, particularly within international development and organizational management contexts. It combines the concepts of 'capacity' (the ability to do something) and 'building' (the act of creating or improving something).","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈpæsəti ˌbɪldɪŋ/","syllables":"ca-pac-i-ty-build-ing"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"'Capacity-building' refers to activities that strengthen the skills, competencies, and resources of individuals, organizations, or communities. It is often used in the context of international development, public health, and organizational development. The goal is to enable the recipients to be more effective and self-sufficient in the long term. It emphasizes sustainable solutions rather than short-term fixes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The capacity-building was very useful.","correct":"✓ The capacity-building program was very useful.","note":"'Capacity-building' is a process, so it's better to refer to a 'capacity-building program,' 'project,' or 'initiative' rather than using 'capacity-building' alone as the subject."},{"incorrect":"✗ We need to capacity-build the community.","correct":"✓ We need to undertake capacity-building in the community. / ✓ We need to build the capacity of the community.","note":"'Capacity-building' is primarily used as a noun. To use it as a verb, rephrase the sentence or use 'build capacity' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["capacity (noun)","build (verb)","building (noun)"],"phrases":["institutional strengthening","organizational development","human resource development","skills transfer"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively frequent in specific contexts (international development, NGOs).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Capacity-building' is a term used to describe the process of helping individuals, organizations, or communities improve their abilities and resources. It is often used in discussions about international development, where the goal is to help developing countries become more self-sufficient. The term implies a long-term, sustainable approach to development, focusing on empowering local actors rather than simply providing aid. It's a more complex term, generally used in professional or academic contexts."},"example_sentences":[{"sentence":"The project aims to promote sustainable agriculture through capacity-building.","translation":"そのプロジェクトは能力構築を通して持続可能な農業を促進することを目的としている。","type":"noun","meaning_category":"能力構築"},{"sentence":"Effective capacity-building requires a long-term commitment.","translation":"効果的な能力構築には長期的なコミットメントが必要である。","type":"noun","meaning_category":"能力構築"},{"sentence":"We are investing in capacity-building to improve healthcare services.","translation":"私たちは医療サービスを改善するために能力構築に投資している。","type":"noun","meaning_category":"能力構築"}]}