{"word":"wearisomely","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"退屈に、うんざりするほどに、疲れるほどに","english_definition":"in a tiresome, boring, or fatiguing manner.","examples":[{"sentence":"He repeated the same story wearisomely, again and again.","translation":"彼は同じ話をうんざりするほど何度も繰り返した。"},{"sentence":"The lecture dragged on wearisomely, and many students started to doze off.","translation":"講義は退屈なほど長引き、多くの学生が居眠りを始めた。"},{"sentence":"She explained the complicated process wearisomely, step by step.","translation":"彼女は複雑なプロセスを疲れるほどに、段階的に説明した。"}],"collocations":["wearisomely long","wearisomely slow","wearisomely repetitive"],"synonyms":["tediously","monotonously","tiresomely","boringly","dullly","exhaustingly"],"antonyms":["interestingly","engagingly","excitingly"]}],"etymology":{"value":"「wearisome」に接尾辞「-ly」が付いた形。「wearisome」は「weary」に「-some」が付いた形。「weary」は古英語の「wērig」（疲れた）に由来。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈwɪəri.səm.li/","syllables":"wea-ri-some-ly"},"inflection":{"notes":"Adverbs do not typically inflect. This word does not have different forms based on tense, number, or gender."},"usage_notes":{"explanation":"「wearisomely」は、何かを退屈に、疲れるほどに、またはうんざりするほどに行う様子を表します。通常、行動やプロセスが非常に長く、単調で、興味をそそらないことを示唆します。この単語は、話者または書き手がその行動やプロセスに不満または疲労を感じていることを暗示することがよくあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She wearisomely is working.","correct":"✓ She is working wearisomely.","note":"Adverbs of manner (like wearisomely) usually go after the verb or after the object if there is one. They rarely go between the subject and the verb."},{"incorrect":"✗ The wearisomely task.","correct":"✓ The wearisome task.","note":"`wearisomely` is an adverb and modifies verbs, adjectives, or other adverbs. To describe a tiring task, use the adjective `wearisome`."}],"priority":"★★☆"},"related_words":{"derivatives":["wearisome (形容詞: 退屈な、うんざりさせる、疲れる)","weary (形容詞: 疲れた、うんざりした；動詞: 疲れさせる、うんざりさせる)","weariness (名詞: 疲労、倦怠感、うんざり)"],"phrasal_verbs":[],"related_concepts":["ennui","boredom","fatigue","monotony"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"wearisomely\" is an adverb that describes something done in a way that causes weariness or boredom. It's not a common word, so it's more likely to be found in advanced texts or when someone wants to emphasize the tiring or monotonous nature of an action. For example, if someone \"wearisomely explained\" something, it means they explained it in a way that was long, tedious, and likely made the listener feel tired or bored. The word is formed from the adjective \"wearisome,\" which means causing weariness."},"example_sentences":[{"sentence":"The speaker droned on wearisomely, his voice a monotone that lulled half the audience to sleep.","translation":"講演者は退屈そうに長々と話し続け、その単調な声は聴衆の半分を眠りに誘った。","type":"adverb","meaning_category":"退屈に"},{"sentence":"He repeated the instructions wearisomely, as if he didn't expect anyone to understand them.","translation":"彼はまるで誰も理解できないだろうとでも言うかのように、うんざりした様子で指示を繰り返した。","type":"adverb","meaning_category":"うんざりするほどに"},{"sentence":"The old man recounted his war stories wearisomely, each detail repeated verbatim from the last telling.","translation":"老人は自分の戦争体験を疲れるほどに語り、細部は前回話したときと全く同じだった。","type":"adverb","meaning_category":"疲れるほどに"}]}