{"word":"dahingegangen","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(formal) deceased, passed away, gone (used to describe someone who has died)","english_definition":"(formal) having died; deceased; passed away.","examples":[{"sentence":"Der dahingegangene König wurde von seinem Sohn beerbt.","translation":"The deceased king was succeeded by his son.","english_translation":"The deceased king was succeeded by his son."},{"sentence":"Wir gedenken der dahingegangenen Opfer des Krieges.","translation":"We commemorate the deceased victims of the war.","english_translation":"We commemorate the deceased victims of the war."}],"collocations":["der/die Dahingegangene (the deceased)","im Gedenken an die Dahingegangenen (in memory of the deceased)"],"synonyms":["verstorben","tot","entschlafen"],"antonyms":["lebend","am Leben"],"notes":"This word is a past participle used as an adjective. It is a formal and somewhat euphemistic way to refer to someone who has died."}],"etymology":{"value":"'Dahingegangen' is the past participle of the verb 'dahingehen' (to pass away, to depart). It is composed of 'da' (there), 'hin' (away), and 'gehen' (to go).","priority":"N/A"},"pronunciation":{"ipa":"/daˈhɪnɡəˌɡaŋən/","syllables":"da-hin-ge-gan-gen"},"inflection":{"notes":"This is a past participle used as an adjective, so it will inflect according to gender, number, and case."},"usage_notes":{"explanation":"'Dahingegangen' is a formal term used to describe someone who has died. It is often found in obituaries, official announcements, or when speaking respectfully about the deceased. It is more formal than 'verstorben' (deceased) and less direct than 'tot' (dead).","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Der dahingegangene ist sehr traurig.","correct":"Die Nachricht vom Dahingegangenen ist sehr traurig.","note":"'Dahingegangen' is an adjective describing the deceased person, not a noun referring to the person themselves. In the incorrect sentence, it's used as a noun. The corrected sentence uses 'Dahingegangenen' (genitive case) to refer to the news about the deceased."}],"priority":"N/A"},"related_words":{"derivatives":["dahingehen (verb: to pass away)"],"related_terms":["verstorben (adjective: deceased)","tot (adjective: dead)","entschlafen (verb: to fall asleep (euphemism for death))"]},"level_frequency":{"priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Dahingegangen' is a formal and somewhat archaic term for 'deceased'. It's not commonly used in everyday conversation but appears in formal contexts like obituaries or legal documents. Understanding its meaning is essential for comprehending formal German texts related to death and mourning."},"example_sentences":[{"sentence":"Die Trauerfeier für den dahingegangenen Professor findet am Freitag statt.","translation":"The funeral service for the deceased professor will take place on Friday.","type":"adjective","meaning_category":"deceased"},{"sentence":"In seinem Testament gedachte er seiner dahingegangenen Frau.","translation":"In his will, he commemorated his deceased wife.","type":"adjective","meaning_category":"deceased"}]}