{"word":"Djerib","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A unit of land area used in some parts of the Middle East, particularly in Turkey and Lebanon. Its exact size varies depending on the region, but it is typically around 1000 square meters or 0.1 hectares.","english_definition":"A unit of land area used in some parts of the Middle East, particularly in Turkey and Lebanon. Its exact size varies depending on the region, but it is typically around 1000 square meters or 0.1 hectares.","examples":[{"sentence":"The farmer owned several djeribs of land.","translation":"その農家は数ジェリブの土地を所有していた。"},{"sentence":"The price of land is often quoted per djerib in this region.","translation":"この地域では、土地の価格はしばしばジェリブ単位で提示される。"}],"collocations":["own djeribs of land","price per djerib"],"synonyms":["donum (another Middle Eastern land unit)"],"antonyms":[]}],"etymology":{"value":"The origin of the word 'djerib' is likely from Arabic or Turkish, reflecting its usage in those regions.","priority":"★★☆"},"pronunciation":{"ipa":"ˈdʒɛrɪb","syllables":"Dje-rib"},"inflection":{"noun_plural":"djeribs"},"usage_notes":{"explanation":"The 'djerib' is a traditional unit of land measurement, and its precise value can vary significantly from one locality to another. When encountering this unit, it's important to ascertain the specific regional definition to understand the actual area being referenced. It is not a standardized international unit.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The area is exactly one djerib everywhere.","correct":"✓ The area of a djerib varies by region.","note":"The size of a djerib is not consistent across all regions."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["hectare","acre","square meter","donum"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Djerib' is a specialized term referring to a unit of land measurement primarily used in parts of the Middle East. Understanding its meaning requires familiarity with regional land measurement systems, as its exact size varies. It's not a commonly used word outside of specific contexts related to land ownership or agriculture in those regions."},"example_sentences":[{"sentence":"The agricultural project required the allocation of 50 djeribs of land.","translation":"その農業プロジェクトは50ジェリブの土地の割り当てを必要とした。","type":"noun","meaning_category":"land area"},{"sentence":"Land prices are soaring, with a djerib now costing a fortune.","translation":"土地の価格が高騰しており、現在では1ジェリブが莫大な費用がかかる。","type":"noun","meaning_category":"land area"}]}