{"word":"condyloid","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"顆状の、顆に似た","english_definition":"Resembling a condyle; having a condyle.","examples":[{"sentence":"The condyloid process of the mandible articulates with the temporal bone.","translation":"下顎の顆状突起は側頭骨と関節する。"},{"sentence":"A condyloid joint allows movement in two planes.","translation":"顆状関節は2つの面での動きを可能にする。"}],"collocations":["condyloid process","condyloid joint","condyloid fossa"],"synonyms":["ellipsoidal","ovoid"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'kondylos' meaning knuckle or rounded projection, combined with the suffix '-oid' meaning resembling.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒndɪlɔɪd/","syllables":"con-dy-loid"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms (more condyloid, most condyloid), but they are rarely used."},"usage_notes":{"explanation":"'Condyloid' is primarily used in anatomical and medical contexts to describe structures that resemble or are associated with condyles (rounded projections on bones that articulate with other bones). It is most commonly found describing joints or processes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The condyloid was fractured.","correct":"✓ The condyloid process was fractured.","note":"'Condyloid' is an adjective, not a noun. It needs to modify a noun, such as 'process' or 'joint'."}],"priority":"★☆☆"},"related_words":{"derivatives":["condyle (noun): A rounded protuberance at the end of some bones, forming an articulation with another bone."],"related_terms":["epicondyle (noun): A prominence above or on a condyle."]},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specialized medical or anatomical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Condyloid' is a technical term primarily used in anatomy and medicine. Understanding requires familiarity with basic anatomical terminology, particularly the concept of a 'condyle' as a rounded projection on a bone. The word is typically encountered in textbooks, research papers, or clinical settings related to musculoskeletal anatomy.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **condyloid** joint of the wrist allows for flexion, extension, abduction, and adduction.","translation":"手首の顆状関節は、屈曲、伸展、外転、および内転を可能にする。","type":"adjective","meaning_category":"顆状の"},{"sentence":"The surgeon examined the **condyloid** process for any signs of fracture.","translation":"外科医は骨折の兆候がないか顆状突起を調べた。","type":"adjective","meaning_category":"顆状の"}]}