{"word":"Omnicorporeal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Possessing or relating to all bodies or physical matter; encompassing all physical forms or substances.","english_definition":"Relating to or comprising all bodies or physical matter; all-encompassing in physical form or substance.","examples":[{"sentence":"The concept of an omnicorporeal being is often explored in science fiction, where entities can exist in any physical form.","translation":"全身体的な存在という概念は、実体がどんな物理的な形でも存在できるサイエンスフィクションでよく探求されます。"},{"sentence":"His research focused on the omnicorporeal nature of dark matter and its interaction with known physical structures.","translation":"彼の研究は、暗黒物質の全身体的な性質と、既知の物理構造との相互作用に焦点を当てていました。"}],"collocations":["omnicorporeal being","omnicorporeal nature","omnicorporeal existence"],"synonyms":["panphysical","universal physical","all-embodied"],"antonyms":["incorporeal","nonphysical","immaterial"]}],"etymology":{"value":"The word \"omnicorporeal\" is derived from the Latin words \"omni-\" meaning \"all\" and \"corporeal\" meaning \"relating to the body or physical matter.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌɒmnikɔːrˈpɔːriəl/","syllables":"om-ni-cor-po-re-al"},"inflection":{"notes":"The word 'omnicorporeal' is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Omnicorporeal\" is a relatively rare and technical term, primarily used in philosophical, scientific, or science fiction contexts to describe something that encompasses all physical bodies or matter. It is often used to explore concepts of beings or entities that are not limited by a single physical form.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The omnicorporeal spirit roamed the earth.","correct":"✓ The incorporeal spirit roamed the earth.","note":"'Omnicorporeal' refers to something physical, while 'incorporeal' refers to something non-physical or spiritual. Make sure to use the correct term based on the context."}],"priority":"★★☆"},"related_words":{"derivatives":["omnicorporeality (noun): The state or quality of being omnicorporeal."],"related_terms":["corporeal","incorporeal","omni-"]},"level_frequency":{"frequency_google_ngram":"Very Low Frequency - This term is not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Omnicorporeal' is a high-level term that is rarely used in everyday language. It is most often found in academic or specialized contexts, such as philosophy, theoretical physics, or science fiction. Understanding this word requires a strong grasp of Latin roots and abstract concepts related to physicality and existence."},"example_sentences":[{"sentence":"The scientist theorized about an omnicorporeal entity that could manipulate all forms of matter.","translation":"科学者は、あらゆる形態の物質を操作できる全身体的な実体について理論を立てました。","type":"general","meaning_category":"encompassing all physical forms"},{"sentence":"The artwork explored the idea of an omnicorporeal universe, where all objects were interconnected.","translation":"そのアート作品は、すべての物体が相互接続された全身体的な宇宙というアイデアを探求しました。","type":"artistic","meaning_category":"relating to all physical matter"}]}