{"word":"polyphobic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"複数の恐怖症を持つ、または複数のものに対して嫌悪感や恐怖心を持つ","english_definition":"Having multiple phobias; exhibiting aversion or fear towards multiple things.","examples":[{"sentence":"The doctor diagnosed him as polyphobic after identifying several irrational fears.","translation":"医師は、いくつかの非合理的な恐怖症を特定した後、彼を多重恐怖症と診断した。"},{"sentence":"Modern society seems to be becoming increasingly polyphobic, with anxieties surrounding various aspects of life.","translation":"現代社会は、生活のさまざまな側面に対する不安を抱え、ますます多重恐怖症的になっているようだ。"}],"collocations":["polyphobic tendencies","polyphobic individual","polyphobic society"],"synonyms":["multiphibic","panphobic"],"antonyms":["monophobic (having only one phobia)"],"notes":"This term is relatively rare and often used in psychological contexts or to describe societal anxieties."}],"etymology":{"value":"Derived from 'poly-' (meaning 'many' or 'multiple') and '-phobic' (relating to phobia or fear).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒlɪˈfoʊbɪk/","syllables":"pol-y-pho-bic"},"inflection":{"notes":"Adjective; no specific inflectional forms."},"usage_notes":{"explanation":"'Polyphobic' describes a state of having multiple phobias or a general tendency to exhibit fear or aversion towards many things. It is not as commonly used as 'phobic' or specific phobia names (e.g., 'arachnophobic').","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is polyphobic of spiders.","correct":"✓ He is polyphobic. / ✓ He has a phobia of spiders.","note":"'Polyphobic' describes the state of having multiple phobias, not the object of a single phobia. To describe a fear of spiders, use 'arachnophobic' or 'He has a phobia of spiders'."}],"priority":"★★☆"},"related_words":{"derivatives":["polyphobia (noun: the condition of having multiple phobias)","phobia (noun: persistent, excessive, unrealistic fear of an object, person, animal, activity or situation)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'polyphobic' is a relatively uncommon term used to describe someone who has multiple phobias, or irrational fears. The prefix 'poly-' means 'many,' and '-phobic' relates to fear or aversion. This word is most often encountered in psychological or academic contexts when discussing anxiety disorders or societal fears. It is important to differentiate it from having a single, specific phobia. "},"example_sentences":[{"sentence":"The therapist worked with the polyphobic patient to address each of their fears individually.","translation":"セラピストは、多重恐怖症の患者と協力して、それぞれの恐怖に個別に対処した。","type":"general","meaning_category":"multiple phobias"},{"sentence":"Some argue that the media contributes to a polyphobic culture by constantly highlighting potential dangers.","translation":"メディアが潜在的な危険性を常に強調することで、多重恐怖症的な文化を助長していると主張する人もいる。","type":"societal","meaning_category":"societal fears"}]}