{"word":"Troper","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Internet slang) A user or editor of TV Tropes, a wiki website that catalogs tropes and conventions in creative works.","english_definition":"(Internet slang) A user or editor of TV Tropes, a wiki website that catalogs tropes and conventions in creative works.","examples":[{"sentence":"As a Troper, I spend way too much time on that site.","translation":"Troperとして、私はあのサイトで時間を使いすぎている。"},{"sentence":"Many Tropers contribute to the wiki by adding new examples and editing existing pages.","translation":"多くのTroperが、新しい例を追加したり、既存のページを編集したりして、wikiに貢献している。"}],"collocations":["active Troper","dedicated Troper","TV Tropes Troper"],"synonyms":["TV Tropes user","TV Tropes editor"],"antonyms":[]}],"etymology":{"value":"Derived from the name of the website TV Tropes, where the users are known as Tropers. The term 'trope' itself refers to a commonly recurring literary or rhetorical device, motif or cliché in creative works.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtroʊpər/","syllables":"tro-per"},"inflection":{"noun_plural":"Tropers"},"usage_notes":{"explanation":"'Troper' is a specific term used within the TV Tropes community and online fandoms familiar with the site. It refers exclusively to individuals who actively engage with the TV Tropes wiki, whether by browsing, editing, or contributing content. It's not a general term for internet users or wiki contributors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a troper of Wikipedia.","correct":"✓ He's an editor of Wikipedia.","note":"'Troper' specifically refers to users of TV Tropes, not other wikis like Wikipedia."},{"incorrect":"✗ She's a troper in the military.","correct":"✓ She's a soldier in the military.","note":"'Troper' is unrelated to military terms. A soldier would be the correct term."}],"priority":"★★☆"},"related_words":{"derivatives":["trope (noun: a commonly recurring literary or rhetorical device, motif or cliché in creative works.)","tropes (noun: plural of trope)","troping (verb: the act of identifying and cataloging tropes)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specific to internet slang and TV Tropes community)","frequency_google_ngram":"Low (Specific to online communities)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Troper' is a niche term primarily used within the TV Tropes community. Understanding its meaning requires familiarity with the TV Tropes website and its focus on cataloging tropes in various media. While not a common word, it's essential for communication within that specific online context."},"example_sentences":[{"sentence":"The Troper community is known for its extensive knowledge of narrative conventions.","translation":"Troperコミュニティは、物語の慣習に関する豊富な知識で知られている。","type":"noun","meaning_category":"TV Tropes user"},{"sentence":"As a long-time Troper, she has contributed thousands of edits to the wiki.","translation":"長年のTroperとして、彼女はwikiに数千もの編集を貢献してきた。","type":"noun","meaning_category":"TV Tropes editor"}]}