{"word":"accelerograph","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"強震計、加速度記録計","english_definition":"An instrument that measures and records strong ground motion, especially during earthquakes.","examples":[{"sentence":"The accelerograph recorded the peak ground acceleration during the earthquake.","translation":"強震計は地震中の最大地動加速度を記録した。"},{"sentence":"Accelerographs are crucial for understanding the behavior of structures during seismic events.","translation":"強震計は地震時の構造物の挙動を理解する上で非常に重要である。"}],"collocations":["peak ground acceleration","seismic event","strong motion","earthquake engineering"],"synonyms":["seismograph","accelerometer","strong-motion seismograph"],"antonyms":[]},{"part_of_speech":"noun","definition":"加速度記録","english_definition":"A record produced by an accelerograph, showing the acceleration of the ground over time.","examples":[{"sentence":"The accelerograph showed a significant spike in acceleration during the main shock.","translation":"加速度記録は本震時に加速度の著しい急上昇を示した。"},{"sentence":"Engineers analyzed the accelerograph to assess the seismic forces on the building.","translation":"エンジニアは加速度記録を分析して、建物にかかる地震力を評価した。"}],"collocations":["ground motion","time history","seismic analysis","structural response"],"synonyms":["acceleration record","seismogram"],"antonyms":[]}],"etymology":{"value":"Derived from 'accelerate' (to increase speed) + '-graph' (something written or recorded).","priority":"★★☆"},"pronunciation":{"ipa":"/əkˈsɛlərəˌɡræf/","syllables":"ac-cel-er-o-graph"},"inflection":{"noun_plural":"accelerographs"},"usage_notes":{"explanation":"An accelerograph is a specific type of seismograph designed to measure strong ground motion, typically during earthquakes. It is crucial for earthquake engineering and structural analysis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The seismograph was used to measure the acceleration.","correct":"✓ The accelerograph was used to measure the acceleration.","note":"While both seismographs and accelerographs record ground motion, accelerographs are specifically designed for strong motion and acceleration measurements."}],"priority":"★★☆"},"related_words":{"derivatives":["accelerogram","accelerometer","seismology","earthquake engineering"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'accelerograph' refers to a specialized instrument used in seismology and earthquake engineering. It measures and records strong ground motion during seismic events. The data obtained from accelerographs, known as accelerograms, are essential for analyzing structural responses to earthquakes and improving building designs to withstand seismic forces. This term is primarily used in technical and scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The **accelerograph** at the base of the building provided valuable data about the earthquake's impact.","translation":"建物の基礎にある強震計は、地震の影響に関する貴重なデータを提供した。","type":"noun","meaning_category":"instrument"},{"sentence":"Analysis of the **accelerograph** revealed the duration and intensity of the shaking.","translation":"強震計の分析により、揺れの持続時間と強度が明らかになった。","type":"noun","meaning_category":"record"}]}