{"word":"unsittingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"不適切に、ふさわしくなく、場違いに","english_definition":"in an inappropriate or unsuitable manner; unbecomingly.","examples":[{"sentence":"He was unsittingly dressed for the formal occasion.","translation":"彼はそのフォーマルな場にふさわしくない服装をしていた。"},{"sentence":"She behaved unsittingly at the funeral.","translation":"彼女は葬儀で不適切な振る舞いをした。"},{"sentence":"The comedian spoke unsittingly about the tragedy.","translation":"そのコメディアンはその悲劇について場違いな発言をした。"}],"collocations":["behave unsittingly","dress unsittingly","speak unsittingly"],"synonyms":["inappropriately","unsuitably","improperly","unbecomingly","indecorously","tastelessly"],"antonyms":["appropriately","suitably","properly","becomingly","decorously"]},{"part_of_speech":"adverb","definition":"不釣合いに、似つかわしくなく","english_definition":"in a way that does not match or harmonize with something else.","examples":[{"sentence":"The modern building was unsittingly placed in the historic district.","translation":"その近代的な建物は、歴史地区に不釣合いに建てられていた。"},{"sentence":"The loud music played unsittingly in the quiet library.","translation":"その騒々しい音楽は、静かな図書館では似つかわしくなかった。"}],"collocations":["placed unsittingly","played unsittingly"],"synonyms":["discordantly","jarringly","incongruously","inharmoniously"],"antonyms":["harmoniously","congruously"]}],"etymology":{"value":"The word \"unsittingly\" is formed by adding the suffix \"-ly\" to the adjective \"unsitting.\" \"Unsitting\" is derived from \"un-\" (meaning \"not\") and \"sitting\" (meaning \"suitable\" or \"appropriate\"). Thus, \"unsittingly\" means \"not in a suitable or appropriate manner.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈsɪtɪŋli/","syllables":"un-sit-ting-ly"},"inflection":{"notes":"As an adverb, \"unsittingly\" does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Unsittingly\" is an adverb that describes an action or behavior that is not appropriate or suitable for a particular situation or context. It implies a lack of decorum, taste, or judgment. The word is relatively formal and not commonly used in everyday conversation. It is often used to describe behavior that is considered offensive, disrespectful, or out of place.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unsittingly to wear jeans to the wedding.","correct":"✓ He was unsittingly dressed to wear jeans to the wedding. / ✓ It was unsitting of him to wear jeans to the wedding.","note":"The adverb \"unsittingly\" modifies a verb or describes how something is done. It does not directly modify a noun or express an opinion about someone. To express that someone's behavior is unsitting, use \"It was unsitting of him/her to...\" or rephrase the sentence to use \"unsittingly\" to modify the verb."},{"incorrect":"✗ The music was played unsitting.","correct":"✓ The music was played unsittingly.","note":"Remember to use the adverbial form \"unsittingly\" to modify the verb \"played.\""}],"priority":"★★☆"},"related_words":{"derivatives":["unsitting (adjective): inappropriate, unsuitable, unbecoming","unfit (adjective): not suitable or good enough for a particular purpose or activity","unbecoming (adjective): not appropriate or attractive; not fitting or suitable"],"synonyms":["inappropriately","unsuitably","improperly","unbecomingly","indecorously","tastelessly"],"antonyms":["appropriately","suitably","properly","becomingly","decorously"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unsittingly\" is a formal adverb that means \"in an inappropriate or unsuitable manner.\" It's used to describe actions or behaviors that are not fitting for a particular situation. Because it's a relatively uncommon word, it's more likely to appear in formal writing or speech. When you see \"unsittingly,\" think of something being done in a way that is out of place or lacking in good taste."},"example_sentences":[{"sentence":"The clown joked unsittingly about the serious matter.","translation":"その道化師は深刻な問題について場違いな冗談を言った。","type":"general","meaning_category":"不適切に"},{"sentence":"The bright colors clashed unsittingly with the somber atmosphere.","translation":"その鮮やかな色彩は、陰鬱な雰囲気と不釣り合いに調和していなかった。","type":"general","meaning_category":"不釣合いに"}]}