{"word":"Polonized","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"ポーランド化する、ポーランド風にする、ポーランド語化する","english_definition":"To make or become Polish in character or form; to convert to Polish language, culture, or customs.","examples":[{"sentence":"The government attempted to Polonize the Ukrainian population.","translation":"政府はウクライナ人住民をポーランド化しようと試みた。"},{"sentence":"Over time, the family became completely Polonized.","translation":"時が経つにつれて、その家族は完全にポーランド化した。"},{"sentence":"The region was heavily Polonized during the interwar period.","translation":"その地域は戦間期に大きくポーランド化された。"}],"collocations":["become Polonized","attempt to Polonize","heavily Polonized"],"synonyms":["Polishify","assimilate","convert","adopt Polish culture"],"antonyms":["Russify","Germanize"]},{"part_of_speech":"adjective","definition":"ポーランド化された、ポーランド風になった、ポーランド語化された","english_definition":"Having been made or become Polish in character or form; converted to Polish language, culture, or customs.","examples":[{"sentence":"The Polonized nobility adopted Polish customs and language.","translation":"ポーランド化した貴族はポーランドの習慣と言語を採用した。"},{"sentence":"Many families in the region are now fully Polonized.","translation":"その地域の多くの家族は現在完全にポーランド化されている。"},{"sentence":"The Polonized version of the name is easier to pronounce for Polish speakers.","translation":"その名前のポーランド語化されたバージョンは、ポーランド語話者にとって発音しやすい。"}],"collocations":["fully Polonized","partially Polonized","highly Polonized"],"synonyms":["Polish","assimilated","converted"],"antonyms":["Russian","German"]}],"etymology":{"value":"The word 'Polonized' is derived from 'Poland' + '-ize' (a suffix indicating the process of making or becoming something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɒlənaɪzd/","syllables":"Po-lon-ized"},"inflection":{"verb_forms":{"present_simple":["Polonize","Polonizes"],"past_simple":"Polonized","past_participle":"Polonized","present_participle":"Polonizing"},"adjective_forms":{}},"usage_notes":{"explanation":"'Polonized' refers to the process of adopting or being forced to adopt Polish language, culture, and customs. It often implies a historical or political context where non-Polish populations were influenced or pressured to become more Polish. The term can be used to describe individuals, families, regions, or even aspects of culture that have undergone this transformation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He Polonized to Poland.","correct":"✓ He Polonized his name.","note":"'Polonize' takes an object that is being transformed, not a place. It's about making something *into* Polish form."},{"incorrect":"✗ The city was Polonized by Polish.","correct":"✓ The city was Polonized by the Polish government.","note":"'Polonize' describes a process, so the agent doing the Polonizing should be specified (e.g., government, institution, etc.)."}],"priority":"★★☆"},"related_words":{"derivatives":["Polonization (noun: ポーランド化)","Polonizer (noun: ポーランド化する人)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (主に歴史的文脈で使用)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polonized' is a term primarily used in historical and cultural contexts to describe the process of something or someone becoming more Polish. It often involves adopting the Polish language, customs, and cultural identity. The word is relatively uncommon in everyday conversation but may appear in discussions of Polish history, cultural assimilation, or national identity. Understanding the term requires some familiarity with Polish history and the concept of cultural influence."},"example_sentences":[{"sentence":"The Lithuanian nobility gradually became Polonized over several centuries.","translation":"リトアニアの貴族は数世紀にわたって徐々にポーランド化した。","type":"verb","meaning_category":"ポーランド化する"},{"sentence":"The Polonized surnames are common in the region.","translation":"その地域ではポーランド語化された姓が一般的である。","type":"adjective","meaning_category":"ポーランド化された"},{"sentence":"The government implemented policies to Polonize the education system.","translation":"政府は教育制度をポーランド化するための政策を実施した。","type":"verb","meaning_category":"ポーランド化する"}]}