{"word":"Flossing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歯科)フロスをすること、フロスがけ","english_definition":"The act of cleaning between your teeth using dental floss.","examples":[{"sentence":"Regular flossing is important for good oral hygiene.","translation":"定期的なフロスがけは、良好な口腔衛生のために重要です。"},{"sentence":"He hates flossing, but he knows he should do it more often.","translation":"彼はフロスがけが嫌いだが、もっと頻繁にすべきだとわかっている。"}],"collocations":["dental flossing","daily flossing","regular flossing"],"synonyms":["interdental cleaning"],"antonyms":[]},{"part_of_speech":"verb","definition":"(動詞のflossの現在分詞)フロスをする、フロスがけをする","english_definition":"Present participle of floss: to clean between your teeth using dental floss.","examples":[{"sentence":"She's flossing her teeth before bed.","translation":"彼女は寝る前に歯をフロスがけしている。"},{"sentence":"He recommends flossing at least once a day.","translation":"彼は少なくとも1日に1回はフロスがけすることを勧めている。"}],"collocations":["flossing teeth","flossing daily","flossing regularly"],"synonyms":["cleaning between teeth"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'floss,' which comes from the noun 'floss' referring to the silky thread used for cleaning teeth. The noun 'floss' originally referred to silk fibers used in sewing.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflɒsɪŋ/","syllables":"floss-ing"},"inflection":{"verb_forms":{"present_participle":"flossing"}},"usage_notes":{"explanation":"'Flossing' refers to the action of using dental floss to remove plaque and food particles from between teeth and under the gumline. It is a key component of oral hygiene, often recommended by dentists alongside brushing. As a noun, it refers to the activity itself, while as a verb (present participle), it describes the act in progress.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am flossing my teeth with toothbrush.","correct":"✓ I am flossing my teeth with dental floss.","note":"Flossing requires dental floss, not a toothbrush."},{"incorrect":"✗ He is flossing his teeth by brush.","correct":"✓ He is flossing his teeth with dental floss.","note":"Use 'with dental floss' to specify the tool."}],"priority":"★★☆"},"related_words":{"derivatives":["floss (noun): デンタルフロス、(動詞)フロスをする","flosser (noun): フロスをする人、フロス用具"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively low frequency, but common in discussions about dental hygiene.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Flossing' means cleaning between your teeth with a special thread called dental floss. It helps remove food and plaque that your toothbrush can't reach. It's important for keeping your teeth and gums healthy. You can say 'I am flossing my teeth' to mean you are currently cleaning between your teeth with floss.","priority":"★★★"},"example_sentences":[{"sentence":"After brushing, she always makes sure to do some flossing.","translation":"歯磨きの後、彼女は必ずフロスがけをするようにしている。","type":"noun","meaning_category":"フロスをすること"},{"sentence":"Flossing helps prevent cavities and gum disease.","translation":"フロスがけは虫歯や歯周病の予防に役立つ。","type":"noun","meaning_category":"フロスをすること"},{"sentence":"He is flossing his teeth carefully to remove all the food particles.","translation":"彼は食べかすをすべて取り除くために、丁寧に歯をフロスがけしている。","type":"verb (present participle)","meaning_category":"フロスをする"},{"sentence":"The dentist recommended flossing every night before bed.","translation":"歯科医は毎晩寝る前にフロスがけすることを勧めた。","type":"verb (gerund implied)","meaning_category":"フロスをすること"}]}