{"word":"encaustically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"蝋画法で、蝋画のように","english_definition":"In a manner relating to or using encaustic painting techniques; in the style of encaustic painting.","examples":[{"sentence":"The painting was created encaustically, resulting in a unique texture and vibrant colors.","translation":"その絵は蝋画法で制作され、独特の質感と鮮やかな色彩を生み出している。"},{"sentence":"She applied the paint encaustically, building up layers of wax and pigment.","translation":"彼女は蝋画法で絵の具を塗り重ね、蝋と顔料の層を築き上げた。"}],"collocations":["painted encaustically","applied encaustically","created encaustically"],"synonyms":["with wax","using wax","in wax"],"antonyms":[]}],"etymology":{"value":"Derived from 'encaustic,' which comes from the Greek word 'enkaustikos' meaning 'to burn in,' referring to the process of burning wax to fuse it to a surface. The adverbial form '-ally' is added to indicate the manner of doing something.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈkɔːstɪkli/","syllables":"en-caus-ti-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Encaustically' describes the method or style of painting using heated beeswax mixed with colored pigments. This technique results in durable and luminous artworks. The adverb is relatively rare in everyday conversation and is primarily used in art-related contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist painted encaustic.","correct":"✓ The artist painted encaustically.","note":"'Encaustic' is an adjective or noun; 'encaustically' is the adverb that describes how the painting was done."}],"priority":"★☆☆"},"related_words":{"derivatives":["encaustic (adjective, noun)","encaustics (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'encaustically' is a specialized term primarily used in the context of art history and painting techniques. It describes the manner in which something is done using the encaustic method, which involves heated beeswax and pigments. Due to its specific usage, it is not commonly encountered in general conversation or writing. Understanding the term requires familiarity with art terminology and historical painting practices."},"example_sentences":[{"sentence":"The ancient Egyptian Fayum portraits were painted encaustically on wooden panels.","translation":"古代エジプトのファイユームの肖像画は、木製のパネルに蝋画法で描かれていた。","type":"adverb","meaning_category":"manner of painting"},{"sentence":"She restored the damaged fresco encaustically, carefully blending the new wax with the old.","translation":"彼女は損傷したフレスコ画を蝋画法で修復し、新しい蝋を古い蝋と注意深くブレンドした。","type":"adverb","meaning_category":"method of restoration"}]}