{"word":"hydrocholecystis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"胆嚢水腫","english_definition":"Distension of the gallbladder with clear, watery fluid.","examples":[{"sentence":"Hydrocholecystis can be caused by obstruction of the cystic duct.","translation":"胆嚢水腫は、胆嚢管の閉塞によって引き起こされる可能性があります。"}],"collocations":["acute hydrocholecystis","chronic hydrocholecystis"],"synonyms":["gallbladder hydrops"],"antonyms":[]}],"etymology":{"value":"'Hydro-' refers to water or fluid, 'chole-' refers to bile or gallbladder, and '-cystis' refers to a bladder or sac. Thus, hydrocholecystis literally means a gallbladder filled with fluid.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪdroʊˌkoʊlɪsɪˈstaɪsɪs/","syllables":"hy-dro-cho-le-cys-tis"},"inflection":{"noun_plural":"hydrocholecystides (rare)"},"usage_notes":{"explanation":"Hydrocholecystis is a condition where the gallbladder becomes abnormally distended with a clear, non-bile fluid. This is typically due to a blockage in the cystic duct, which prevents bile from entering or leaving the gallbladder. The trapped bile is gradually reabsorbed, leaving a clear, watery fluid.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["cholecystitis","cholecystectomy","cholecystography"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Hydrocholecystis is a medical term referring to the distension of the gallbladder with clear fluid, typically resulting from cystic duct obstruction. Understanding this term requires familiarity with medical terminology related to the biliary system."},"example_sentences":[{"sentence":"The ultrasound revealed hydrocholecystis, indicating a blockage in the cystic duct.","translation":"超音波検査で胆嚢水腫が明らかになり、胆嚢管の閉塞を示唆していました。","type":"noun","meaning_category":"medical condition"},{"sentence":"In cases of hydrocholecystis, surgical intervention may be necessary to prevent complications.","translation":"胆嚢水腫の場合、合併症を防ぐために外科的介入が必要になることがあります。","type":"noun","meaning_category":"medical condition"}]}