{"word":"pseudomnesia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"偽記憶、虚偽記憶","english_definition":"A condition in which a person has false memories or believes that they remember events that never actually happened.","examples":[{"sentence":"His account of the event was dismissed as pseudomnesia.","translation":"彼の出来事の説明は偽記憶として退けられた。"},{"sentence":"The patient's pseudomnesia made it difficult to determine the true sequence of events.","translation":"患者の偽記憶により、出来事の真の順序を特定することが困難になった。"}],"collocations":["develop pseudomnesia","experience pseudomnesia","report pseudomnesia"],"synonyms":["false memory","confabulation","memory distortion","memory illusion"],"antonyms":["accurate memory","true memory"]}],"etymology":{"value":"From Greek pseudo- (false) + mnēmē (memory).","priority":"★★☆"},"pronunciation":{"ipa":"ˌsjuːdoʊmˈniːziə","syllables":"pseu-do-mne-sia"},"inflection":{"noun_plural":"pseudomnesias"},"usage_notes":{"explanation":"Pseudomnesia refers to the psychological phenomenon where an individual genuinely believes in the authenticity of memories that are either entirely fabricated or significantly distorted from reality. It's important to distinguish pseudomnesia from intentional deception or lying, as individuals experiencing pseudomnesia are not consciously aware that their memories are false. This phenomenon can arise from various factors, including suggestion, imagination, or psychological trauma.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was suffering from pseudomnesia and couldn't remember anything.","correct":"✓ He was suffering from pseudomnesia and had false memories of the event.","note":"Pseudomnesia involves false memories, not a complete loss of memory. It's about remembering things incorrectly, not not remembering anything at all."},{"incorrect":"✗ She admitted to pseudomnesia.","correct":"✓ She was diagnosed with pseudomnesia.","note":"Pseudomnesia is a condition that is diagnosed, not something one admits to, as it is not intentional."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudomnemonic (adjective)"],"phrasal_verbs":[],"related_terms":["cryptomnesia","déjà vu","paramnesia"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pseudomnesia' is a highly specialized term in psychology referring to false or distorted memories that an individual genuinely believes to be true. It's a complex phenomenon distinct from lying or simple memory errors, often arising from suggestion, trauma, or other psychological factors. Understanding this term requires a strong grasp of psychological concepts and terminology."},"example_sentences":[{"sentence":"The psychologist studied the patient's pseudomnesia to understand the origins of the false memories.","translation":"心理学者は、偽の記憶の起源を理解するために、患者の偽記憶を研究した。","type":"general","meaning_category":"偽記憶"},{"sentence":"Through therapy, she began to distinguish between her real memories and instances of pseudomnesia.","translation":"セラピーを通して、彼女は自分の本当の記憶と偽記憶の事例を区別し始めた。","type":"general","meaning_category":"偽記憶"}]}