{"word":"Prussianised","priority":"低","meanings":[{"part_of_speech":"verb (past participle)","definition":"プロシア化された、プロシア風にされた","english_definition":"Having been made similar to Prussia, especially in terms of militarism, authoritarianism, or efficiency.","examples":[{"sentence":"The education system was Prussianised to emphasize discipline and obedience.","translation":"教育システムは、規律と服従を重視するようにプロシア化された。"},{"sentence":"Critics argued that the country's culture was being Prussianised by the new regime.","translation":"批評家たちは、国の文化が新体制によってプロシア化されていると主張した。"}],"collocations":["Prussianised education","Prussianised military","Prussianised bureaucracy"],"synonyms":["militarized","standardized","disciplined","regimented"],"antonyms":["liberalized","decentralized","democratized"]},{"part_of_speech":"verb (past tense)","definition":"プロシア化した、プロシア風にした","english_definition":"To make something similar to Prussia, especially in terms of militarism, authoritarianism, or efficiency.","examples":[{"sentence":"The government Prussianised the civil service to improve its effectiveness.","translation":"政府は公務員の効率を改善するためにプロシア化した。"},{"sentence":"The factory owner Prussianised his workforce to increase productivity.","translation":"工場主は生産性を高めるために労働者をプロシア化した。"}],"collocations":["Prussianised the army","Prussianised the administration","Prussianised the industry"],"synonyms":["militarized","standardized","disciplined","regimented"],"antonyms":["liberalized","decentralized","democratized"]}],"etymology":{"value":"Derived from the word 'Prussian', referring to Prussia, a historical German state known for its militarism and efficiency, and the suffix '-ise' (or '-ize' in American English), meaning 'to make or become'.","priority":"中"},"pronunciation":{"ipa":"/ˈprʌʃənaɪzd/","syllables":"prus-shan-aised"},"inflection":{"verb_forms":{"present_simple":["Prussianise","Prussianises"],"past_simple":"Prussianised","past_participle":"Prussianised","present_participle":"Prussianising"}},"usage_notes":{"explanation":"'Prussianised' refers to the act of making something more like Prussia, particularly in terms of its emphasis on military discipline, centralized authority, and bureaucratic efficiency. It often carries a negative connotation, suggesting an overemphasis on these aspects at the expense of individual freedom or creativity.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"The country was Prussianised with freedom and democracy.","correct":"The country was Prussianised with strict rules and regulations.","note":"Prussianisation typically involves increased control and discipline, not freedom and democracy."}],"priority":"低"},"related_words":{"derivatives":["Prussianisation (noun)","Prussianism (noun)"],"phrases":["Prussian blue (a type of blue pigment)"],"priority":"低"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"低"},"readability_explanation":{"level":"C1","text":"The word 'Prussianised' is a relatively uncommon term that refers to the process of making something more like Prussia, a historical German state known for its militarism, authoritarianism, and efficiency. It is often used in historical or political contexts to describe the imposition of strict discipline and centralized control. Understanding this word requires knowledge of Prussian history and culture."},"example_sentences":[{"sentence":"The school system was Prussianised to instill obedience in the students.","translation":"学校制度は、生徒に服従を植え付けるためにプロシア化された。","type":"general","meaning_category":"プロシア化された"},{"sentence":"Critics claimed that the reforms Prussianised the healthcare system.","translation":"改革は医療制度をプロシア化したと批評家は主張した。","type":"general","meaning_category":"プロシア化した"}]}