{"word":"phosphatidylethanolamine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ホスファチジルエタノールアミン（PE）：細胞膜に存在するリン脂質の一種。特に脳、神経組織、細菌膜に豊富。","english_definition":"A type of phospholipid found in cell membranes, especially abundant in the brain, nervous tissue, and bacterial membranes. Also known as cephalin.","examples":[{"sentence":"Phosphatidylethanolamine is a major component of neuronal membranes.","translation":"ホスファチジルエタノールアミンは、神経細胞膜の主要な構成要素です。"},{"sentence":"PE plays a crucial role in membrane fusion and cell signaling.","translation":"PEは、膜融合や細胞シグナル伝達において重要な役割を果たします。"}],"collocations":["cell membrane","lipid bilayer","membrane fusion","cell signaling","brain lipid","nervous tissue"],"synonyms":["cephalin"],"antonyms":[]}],"etymology":{"value":"'Phosphatidyl-' はリン酸基とグリセロール骨格を持つことを示し、'ethanolamine' はエタノールアミンという極性頭部基を持つことを示す。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌfɒsfəˌtaɪdɪlˌeθəˈnɒləmiːn/","syllables":"phos-pha-ti-dyl-e-tha-nol-a-mine"},"inflection":{"notes":"不加算名詞"},"usage_notes":{"explanation":"ホスファチジルエタノールアミン（PE）は、細胞膜の構造と機能に不可欠なリン脂質です。特に神経系において重要な役割を果たし、膜の安定性、タンパク質の局在化、細胞シグナル伝達に関与します。また、血液凝固にも関わっています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Phosphatidylethanolamine is a protein.","correct":"✓ Phosphatidylethanolamine is a phospholipid.","note":"ホスファチジルエタノールアミンはタンパク質ではなく、リン脂質です。"},{"incorrect":"✗ PE is only found in plant cells.","correct":"✓ PE is found in both animal and plant cells, as well as bacteria.","note":"PEは動物細胞、植物細胞、細菌にも存在します。"}],"priority":"★☆☆"},"related_words":{"derivatives":["phospholipid","phosphatidylcholine","phosphatidylserine","ethanolamine"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Phosphatidylethanolamine (PE) is a complex molecule, specifically a phospholipid, that is a key structural component of cell membranes, particularly in the brain and nervous system. It plays a vital role in various cellular processes, including membrane fusion, protein localization, and cell signaling. Understanding PE is important in the context of biochemistry, cell biology, and neuroscience."},"example_sentences":[{"sentence":"The distribution of phosphatidylethanolamine in the cell membrane is asymmetric.","translation":"細胞膜におけるホスファチジルエタノールアミンの分布は非対称的である。","type":"noun","meaning_category":"リン脂質"},{"sentence":"Phosphatidylethanolamine synthesis is regulated by several enzymes.","translation":"ホスファチジルエタノールアミンの合成は、いくつかの酵素によって調節されている。","type":"noun","meaning_category":"リン脂質"},{"sentence":"Studies have shown that phosphatidylethanolamine is involved in apoptosis.","translation":"研究により、ホスファチジルエタノールアミンはアポトーシスに関与していることが示されている。","type":"noun","meaning_category":"リン脂質"}]}