{"word":"Barbet","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ゴシキドリ（科）の鳥","english_definition":"Any of numerous tropical birds of the family Capitonidae, having a stout body, large head, and brightly colored plumage.","examples":[{"sentence":"The Crimson-fronted Barbet is a colorful bird found in Central America.","translation":"ベニビタイゴシキドリは、中央アメリカで見られるカラフルな鳥です。"},{"sentence":"Barbets are known for their distinctive calls.","translation":"ゴシキドリは、特徴的な鳴き声で知られています。"}],"collocations":["Crimson-fronted Barbet","African Barbet","Asian Barbet","habitat of barbet","diet of barbet"],"synonyms":["Capitonid"],"antonyms":[]},{"part_of_speech":"noun","definition":"（歴史的な）巻き毛のスパニエル犬の一種","english_definition":"An old breed of medium-sized water dog with a long, thick, curly coat.","examples":[{"sentence":"The Barbet is a versatile water dog.","translation":"バーベットは用途の広い水猟犬です。"},{"sentence":"Barbets were originally used for retrieving waterfowl.","translation":"バーベットはもともと水鳥を回収するために使われていました。"}],"collocations":["French Barbet","water dog","dog breed"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From French barbet, from barbe (“beard”), referring to the bristly feathers around the beak of some species, or the long hair of the dog breed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɑːrbɪt/","syllables":"bar-bet"},"inflection":{"noun_plural":"Barbets"},"usage_notes":{"explanation":"The term \"Barbet\" refers to two distinct things: a family of brightly colored tropical birds and a breed of water dog. Context is crucial to understanding which meaning is intended. The bird is more commonly known as a \"barbet\", while the dog breed is typically referred to as a \"Barbet\" with a capital letter.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Barbet flying in the forest, it had long fur.","correct":"✓ I saw a Barbet flying in the forest, it had bright feathers.","note":"Birds have feathers, not fur. The dog breed has fur."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["toucan","woodpecker"],"dog_breeds":["poodle","spaniel"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Barbet\" has two uncommon meanings. One refers to a family of tropical birds, and the other to a rare breed of water dog. Both meanings are relatively specialized, so encountering the word depends on the context of the discussion (e.g., ornithology or dog breeds). Understanding the context is essential to correctly interpret the intended meaning.","example_sentences":[]},"example_sentences":[{"sentence":"The **Barbet** is prized for its intelligence and retrieving abilities.","translation":"バーベットはその知性と回収能力で重宝されています。","type":"noun","meaning_category":"Dog breed"},{"sentence":"Many species of **barbet** nest in tree holes.","translation":"多くのゴシキドリの種は木の穴に巣を作ります。","type":"noun","meaning_category":"Bird"}]}