{"word":"mentees","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) メンティー、指導を受ける人、助言を受ける人","english_definition":"(plural) individuals being mentored; those receiving guidance or advice from a mentor.","examples":[{"sentence":"The program pairs experienced professionals with mentees seeking career advice.","translation":"そのプログラムでは、経験豊富な専門家とキャリアに関するアドバイスを求めているメンティーをペアにします。"},{"sentence":"Our mentees have shown significant growth in their skills and confidence.","translation":"私たちのメンティーは、スキルと自信において著しい成長を見せています。"},{"sentence":"She enjoys working with her mentees and helping them achieve their goals.","translation":"彼女はメンティーたちと協力し、彼らが目標を達成するのを助けることを楽しんでいます。"}],"collocations":["new mentees (新しいメンティー)","current mentees (現在のメンティー)","potential mentees (将来のメンティー)","successful mentees (成功したメンティー)","mentoring program for mentees (メンティーのためのメンター制度プログラム)"],"synonyms":["protégés","apprentices","trainees","pupils","students","learners"],"antonyms":["mentors","advisors","guides","instructors"]}],"etymology":{"value":"'Mentee' is derived from 'mentor,' a term originating from the character Mentor in Homer's Odyssey. Mentor was entrusted with the education and guidance of Telemachus. 'Mentee' emerged as the reciprocal term to describe the individual being mentored.","priority":"★★☆"},"pronunciation":{"ipa":"/mɛnˈtiːz/","syllables":"men-teez"},"inflection":{"noun_plural":"mentees"},"usage_notes":{"explanation":"'Mentees' refers specifically to the group of people who are receiving guidance, advice, and support from a mentor. It is the plural form of 'mentee,' and is used when referring to more than one person. The term is common in professional development, educational, and personal growth contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The mentee's mentors.","correct":"✓ The mentees' mentors.","note":"When referring to the mentors of multiple mentees, use the plural possessive form 'mentees'.'"},{"incorrect":"✗ Mentees is important for career growth.","correct":"✓ Mentoring is important for career growth. / ✓ Mentees are important for career growth.","note":"'Mentees' is a plural noun and requires a plural verb form. If referring to the concept of being a mentee, use 'mentoring' or rephrase the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["mentee (singular noun)","mentor (noun)","mentorship (noun)","mentoring (noun/verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency; usage is increasing in professional and educational contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Mentees' is the plural form of 'mentee,' referring to multiple individuals who are being guided or advised by a mentor. This term is commonly used in professional and educational settings where mentorship programs are in place. Understanding this term is helpful for comprehending discussions about career development, skill-building, and personal growth within structured mentorship relationships."},"example_sentences":[{"sentence":"The company's leadership program aims to develop future leaders by pairing them with experienced mentors and providing support to the **mentees**.","translation":"その会社のリーダーシッププログラムは、経験豊富なメンターとペアを組ませ、**メンティー**をサポートすることで、将来のリーダーを育成することを目的としています。","type":"noun","meaning_category":"指導を受ける人たち"},{"sentence":"We held a special workshop for our new **mentees** to help them get the most out of the mentoring relationship.","translation":"メンター制度の関係を最大限に活用できるよう、新しい**メンティー**のために特別なワークショップを開催しました。","type":"noun","meaning_category":"指導を受ける人たち"},{"sentence":"The success of the mentoring program is often measured by the progress and achievements of the **mentees**.","translation":"メンター制度プログラムの成功は、多くの場合、**メンティー**の進歩と成果によって測られます。","type":"noun","meaning_category":"指導を受ける人たち"}]}