{"word":"executory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(法律) 未履行の、未完了の","english_definition":"(of a contract, deed, etc.) not yet fully performed or completed.","examples":[{"sentence":"The contract is executory until both parties have fulfilled their obligations.","translation":"契約は両当事者が義務を履行するまで未履行である。"},{"sentence":"An executory interest is a future interest in property that will vest only upon the occurrence of a specific event.","translation":"未履行権益とは、特定の事象が発生した場合にのみ確定する財産における将来の権益である。"}],"collocations":["executory contract (未履行契約)","executory interest (未履行権益)","executory agreement (未履行合意)"],"synonyms":["unperformed","incomplete","outstanding","pending"],"antonyms":["executed","performed","completed","fulfilled"]}],"etymology":{"value":"Late Middle English: from Anglo-Norman French ex(s)ecutorie, from late Latin exsecutorius, from exsequi ‘follow up, carry out’ (see execute).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪɡˈzekjətɔːri/","syllables":"ex-e-cu-to-ry"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more executory, most executory)."},"usage_notes":{"explanation":"The term \"executory\" is primarily used in legal contexts, especially when discussing contracts, trusts, and estates. It describes something that is not yet fully carried out or completed. In contract law, an executory contract is one where significant obligations remain to be performed by both parties. In property law, it can refer to interests that are contingent upon future events.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The executory is finished.","correct":"✓ The contract is executed.","note":"\"Executory\" means not yet completed, so it cannot be \"finished.\" Use \"executed\" to indicate completion."},{"incorrect":"✗ He has executory skills.","correct":"✓ He has executive skills.","note":"\"Executory\" relates to unfulfilled obligations, not skills. Use \"executive\" to refer to skills related to management and leadership."}],"priority":"★☆☆"},"related_words":{"derivatives":["execute (verb)","execution (noun)","executor (noun)","executrix (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized legal vocabulary)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"executory\" is a specialized term primarily used in legal contexts. It describes something that is not yet fully performed or completed, such as a contract where both parties still have obligations to fulfill. Understanding this term requires familiarity with legal concepts and terminology. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The lease agreement remained executory until the tenant took possession of the property.","translation":"賃貸契約は、テナントが物件を占有するまで未履行のままであった。","type":"adjective","meaning_category":"未履行の"},{"sentence":"The trust contained an executory provision that would distribute assets upon the beneficiary's 25th birthday.","translation":"信託には、受益者の25歳の誕生日に資産を分配するという未履行の条項が含まれていた。","type":"adjective","meaning_category":"未履行の"},{"sentence":"Despite the initial agreement, the contract was deemed executory due to outstanding conditions.","translation":"当初の合意にもかかわらず、未解決の条件により、契約は未履行とみなされた。","type":"adjective","meaning_category":"未履行の"}]}