{"word":"Zeppelin","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ツェッペリン (硬式飛行船)","english_definition":"A type of rigid airship named after the German Count Ferdinand von Zeppelin; typically large, cigar-shaped, and powered by engines.","examples":[{"sentence":"The Hindenburg was a famous Zeppelin that crashed in 1937.","translation":"ヒンデンブルク号は1937年に墜落した有名なツェッペリン飛行船だった。"},{"sentence":"Zeppelins were used for passenger transport and military purposes in the early 20th century.","translation":"ツェッペリン飛行船は20世紀初頭に旅客輸送と軍事目的で使用された。"}],"collocations":["Zeppelin airship","Zeppelin flight","Zeppelin raid"],"synonyms":["airship","dirigible"],"antonyms":[]},{"part_of_speech":"noun","definition":"(口語) ツェッペリン飛行船に似たもの、巨大な葉巻型のもの","english_definition":"(colloquial) Something resembling a Zeppelin airship in shape or size; a large, cigar-shaped object.","examples":[{"sentence":"The submarine was like a Zeppelin underwater.","translation":"その潜水艦は水中のツェッペリン飛行船のようだった。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Count Ferdinand von Zeppelin (1838–1917), a German general and pioneer of airship development. He patented his design for a rigid airship in 1895.","priority":"★★★"},"pronunciation":{"ipa":"/ˈzɛpəlɪn/","syllables":"zep-pe-lin"},"inflection":{"noun_plural":"Zeppelins"},"usage_notes":{"explanation":"'Zeppelin' specifically refers to rigid airships designed and popularized by Count Ferdinand von Zeppelin. While 'airship' is a more general term, 'Zeppelin' implies a particular construction and historical context. The word is often associated with the early 20th century and the era of airship travel.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an air balloon. It was a Zeppelin.","correct":"✓ I saw an airship. It was a Zeppelin.","note":"'Zeppelin' is a specific type of 'airship,' not an 'air balloon.'"},{"incorrect":"✗ Zeppelins are still commonly used for air travel today.","correct":"✓ Zeppelins were commonly used for air travel in the early 20th century.","note":"Zeppelins are not a common mode of transportation today."}],"priority":"★★☆"},"related_words":{"derivatives":["Zeppelin NT (New Technology - a modern type of Zeppelin)"],"idioms_phrases":[],"related_terms":["airship","dirigible","Hindenburg","rigid airship"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but recognizable due to historical significance and the band Led Zeppelin.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'Zeppelin' refers to a specific type of rigid airship, historically significant in the early 20th century. While not a common term in everyday conversation, it is recognizable due to its association with historical events and the rock band Led Zeppelin. Understanding its specific meaning as a rigid airship, rather than a generic balloon, is key."},"example_sentences":[{"sentence":"The **Zeppelin** soared majestically through the sky.","translation":"ツェッペリン飛行船が空を雄大に舞い上がった。","type":"noun","meaning_category":"rigid airship"},{"sentence":"The **Zeppelin** company pioneered air travel in the early 1900s.","translation":"ツェッペリン社は1900年代初頭に空の旅の先駆けとなった。","type":"noun","meaning_category":"rigid airship"},{"sentence":"He dreamed of flying across the Atlantic in a **Zeppelin**.","translation":"彼はツェッペリン飛行船で大西洋を横断するのを夢見ていた。","type":"noun","meaning_category":"rigid airship"}]}