{"word":"tartufishly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"偽善的に、信心ぶって、ごまかしながら","english_definition":"In a hypocritical or sanctimonious manner; with affected piety or morality.","examples":[{"sentence":"He smiled tartufishly, pretending to be concerned.","translation":"彼は心配しているふりをして、偽善的に微笑んだ。"},{"sentence":"She acted tartufishly, lecturing others on morality while secretly engaging in questionable behavior.","translation":"彼女は、秘密裡に怪しげな行動をしながら、道徳について他人に説教し、信心ぶった態度をとった。"}],"collocations":["smile tartufishly","act tartufishly","behave tartufishly","speak tartufishly"],"synonyms":["hypocritically","sanctimoniously","piously","deceitfully","dishonestly","insincerely","affectedly"],"antonyms":["sincerely","honestly","genuinely","authentically"]}],"etymology":{"value":"Derived from the character Tartuffe in Molière's play of the same name, who is a hypocritical religious figure.","priority":"★★☆"},"pronunciation":{"ipa":"/tɑːrˈtuːfɪʃli/","syllables":"tar-tu-fish-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Tartufishly' describes actions or behaviors that are characterized by hypocrisy or false piety. It suggests that someone is pretending to be morally upright or religious while their true intentions or actions contradict this facade. The term is relatively uncommon in everyday conversation but is used in literary or analytical contexts to describe such behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He tartufishly smiled sincere.","correct":"✓ He smiled tartufishly, pretending to be sincere.","note":"The adverb 'tartufishly' modifies the verb 'smiled' and describes the manner of smiling. It does not directly modify the adjective 'sincere'."},{"incorrect":"✗ She is a tartufishly person.","correct":"✓ She is a tartufish person. / ✓ She acted tartufishly.","note":"'Tartufishly' is an adverb, not an adjective. The adjectival form is 'tartufish'."}],"priority":"★☆☆"},"related_words":{"derivatives":["tartufe (noun)","tartuffe (noun)","tartufish (adjective)","tartuffery (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'tartufishly' is a sophisticated term used to describe behavior characterized by hypocrisy and sanctimony, drawing its meaning from the character Tartuffe in Molière's play. It is not commonly used in everyday language and is more likely to appear in literary or analytical contexts where nuanced descriptions of insincere behavior are required. Understanding the historical and literary context of the word is essential for its correct usage."},"example_sentences":[{"sentence":"The politician spoke tartufishly about family values while his own personal life was in disarray.","translation":"その政治家は、自身の私生活が混乱しているにもかかわらず、家族の価値観について偽善的に語った。","type":"adverb","meaning_category":"hypocritically"},{"sentence":"He bowed tartufishly to the bishop, concealing his contempt.","translation":"彼は軽蔑を隠しながら、司教に信心ぶった態度で頭を下げた。","type":"adverb","meaning_category":"sanctimoniously"},{"sentence":"She presented her arguments tartufishly, feigning concern for the environment while promoting policies that would harm it.","translation":"彼女は、環境を害する政策を推進しながら、環境への関心を装い、偽善的に議論を展開した。","type":"adverb","meaning_category":"deceitfully"}]}