{"word":"Kantism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"カント主義、カント哲学","english_definition":"The philosophical system of Immanuel Kant, or adherence to its principles.","examples":[{"sentence":"Kantism had a profound influence on subsequent philosophical thought.","translation":"カント主義は、その後の哲学思想に深い影響を与えた。"},{"sentence":"He is a strong proponent of Kantism.","translation":"彼はカント主義の強力な支持者である。"}],"collocations":["ethical Kantism","transcendental Kantism","neo-Kantism"],"synonyms":["Kantianism","Kantian philosophy"],"antonyms":[]}],"etymology":{"value":"Named after Immanuel Kant, with the suffix '-ism' indicating a system of thought or doctrine.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkæntɪzəm/","syllables":"Kan-tism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Kantism refers to the philosophical ideas and principles developed by Immanuel Kant. It encompasses various aspects of his thought, including epistemology, ethics, and aesthetics. Kant's critical philosophy sought to reconcile rationalism and empiricism, emphasizing the role of both reason and experience in shaping our understanding of the world.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He studies Kantist.","correct":"✓ He studies Kantism.","note":"'Kantist' is not a standard term. Use 'Kantism' to refer to the philosophy itself."}],"priority":"★★☆"},"related_words":{"derivatives":["Kantian (adjective, noun)","neo-Kantian (adjective, noun)"],"phrases":["categorical imperative","transcendental idealism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Kantism' refers to the philosophical system of Immanuel Kant. It's a term primarily used in academic and philosophical contexts. Understanding requires familiarity with basic philosophical concepts and the history of philosophy."},"example_sentences":[{"sentence":"The core of Kantism lies in the concept of transcendental idealism.","translation":"カント主義の核心は、超越論的観念論の概念にある。","type":"general","meaning_category":"カント哲学"},{"sentence":"Critics of Kantism often question the practicality of the categorical imperative.","translation":"カント主義の批判者たちは、しばしば定言命法の現実性について疑問を呈する。","type":"general","meaning_category":"カント哲学"}]}