{"word":"tribular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"苦難に満ちた、苦痛を与える、悩みの種となる","english_definition":"Full of tribulation; causing distress or suffering.","examples":[{"sentence":"The tribular journey tested their resilience.","translation":"その苦難に満ちた旅は彼らの回復力を試した。"},{"sentence":"He described his tribular childhood in vivid detail.","translation":"彼は苦痛に満ちた子供時代を鮮明に描写した。"}],"collocations":["tribular times","tribular experiences","tribular events"],"synonyms":["distressing","troublesome","afflictive","arduous","difficult","painful"],"antonyms":["pleasant","easy","comfortable","joyful"]}],"etymology":{"value":"Late Latin *tribularis*, from Latin *tribulum* ('threshing sledge', a type of agricultural tool used for separating grain from husks, which metaphorically suggests a source of distress), from *terere* ('to rub, wear away').","priority":"★★☆"},"pronunciation":{"ipa":"ˈtrɪbjʊlər","syllables":"trib-u-lar"},"inflection":{"notes":"Comparative and superlative forms are 'more tribular' and 'most tribular', respectively, as it's not a commonly inflected adjective."},"usage_notes":{"explanation":"'Tribular' is a relatively rare and formal word, primarily used in literary or historical contexts to describe situations or experiences characterized by significant hardship, suffering, or distress. It emphasizes the presence of tribulation, which implies a period of testing or adversity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The tribular weather made it hard to enjoy the beach.","correct":"The troublesome weather made it hard to enjoy the beach.","note":"'Tribular' is best used for situations involving deep emotional or existential distress, not just inconvenience."}],"priority":"★☆☆"},"related_words":{"derivatives":["tribulation (noun): a cause or state of great trouble or suffering."],"phrases":["tribular period"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tribular' is a rare and sophisticated word used to describe something filled with tribulation or causing distress. It's not commonly used in everyday conversation but might appear in literature or formal writing. Understanding its meaning requires familiarity with the related word 'tribulation,' which refers to a state of great trouble or suffering."},"example_sentences":[{"sentence":"The early settlers faced a tribular existence in the harsh wilderness.","translation":"初期の入植者たちは、厳しい荒野で苦難に満ちた生活を送った。","type":"adjective","meaning_category":"苦難に満ちた"},{"sentence":"His tribular experiences shaped him into a compassionate leader.","translation":"彼の苦痛に満ちた経験は、彼を思いやりのあるリーダーへと成長させた。","type":"adjective","meaning_category":"苦痛を与える"}]}