{"word":"hectogramme","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘクトグラム (100グラム)","english_definition":"a unit of mass equal to 100 grams","examples":[{"sentence":"I need 2 hectogrammes of cheese.","translation":"チーズを2ヘクトグラムください。"},{"sentence":"The recipe calls for 1 hectogramme of flour.","translation":"レシピには小麦粉1ヘクトグラムが必要です。"}],"collocations":["weigh in hectogrammes","a few hectogrammes","measured in hectogrammes"],"synonyms":["100 grams"],"antonyms":[]}],"etymology":{"value":"Derived from the metric prefix 'hecto-' (meaning hundred) and 'gramme' (the base unit of mass in the metric system).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛktəɡræm/","syllables":"hec-to-gram"},"inflection":{"noun_plural":"hectogrammes"},"usage_notes":{"explanation":"A hectogramme is a metric unit of mass, equivalent to 100 grams or approximately 3.5 ounces. It is not a commonly used unit in everyday conversation, but it may appear in recipes or scientific contexts. The spelling 'hectogramme' is more common in British English, while 'hectogram' is more common in American English, although both are understandable.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need 2 hectogrammes of sugar, please. Can you weigh it in pounds?","correct":"✓ I need 2 hectogrammes of sugar, please. Can you weigh it in grams?","note":"Hectogrammes are part of the metric system, so it's more appropriate to ask for the weight in grams rather than pounds (which is part of the imperial system)."},{"incorrect":"✗ The recipe calls for 1 hectogramme of flour, or about 4 ounces.","correct":"✓ The recipe calls for 1 hectogramme of flour, or about 3.5 ounces.","note":"1 hectogramme is approximately 3.5 ounces, not 4. It's important to use the correct conversion factor."}],"priority":"★★☆"},"related_words":{"derivatives":["hecto- (prefix meaning hundred)","gramme (unit of mass)","kilogramme (1000 grams)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'hectogramme' refers to a unit of mass in the metric system, specifically 100 grams. It is formed by combining the prefix 'hecto-' (meaning hundred) with 'gramme'. Although not frequently used in everyday contexts, it is important to understand its meaning when encountered in recipes or technical documents. It is more commonly used in scientific or specialized fields where precise measurements are necessary.","priority":"★★☆"},"example_sentences":[{"sentence":"The cheese was sold in 2-hectogramme blocks.","translation":"そのチーズは2ヘクトグラムのブロックで販売されていました。","type":"noun","meaning_category":"mass"},{"sentence":"For this recipe, you'll need 5 hectogrammes of potatoes.","translation":"このレシピでは、ジャガイモ5ヘクトグラムが必要です。","type":"noun","meaning_category":"mass"},{"sentence":"The package weighed just under one hectogramme.","translation":"そのパッケージの重さは1ヘクトグラム弱でした。","type":"noun","meaning_category":"mass"}]}