{"word":"supermundane","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"超俗的な、世俗を超越した、世俗を超越しているかのように見える","english_definition":"Transcending the mundane; existing above or beyond the ordinary or worldly.","examples":[{"sentence":"The artist's work had a supermundane quality, as if inspired by a higher power.","translation":"その芸術家の作品には、まるでより高次の力に触発されたかのような、超俗的な性質があった。"},{"sentence":"The philosopher sought supermundane wisdom through meditation and contemplation.","translation":"その哲学者は、瞑想と熟考を通じて、世俗を超越した知恵を求めた。"},{"sentence":"Her beauty was almost supermundane, ethereal and otherworldly.","translation":"彼女の美しさはほとんど超俗的で、この世のものとは思えないほどだった。"}],"collocations":["supermundane beauty","supermundane wisdom","supermundane realm","supermundane experience"],"synonyms":["transcendental","ethereal","otherworldly","spiritual","celestial","sublime"],"antonyms":["mundane","worldly","earthly","secular","profane"]}],"etymology":{"value":"\"super-\" (above, beyond) + \"mundane\" (worldly, earthly).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsuːpərˈmʌndeɪn/","syllables":"su-per-mun-dane"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more supermundane' and 'most supermundane' respectively."},"usage_notes":{"explanation":"\"Supermundane\" is used to describe something that is above or beyond the ordinary, everyday world. It often implies a spiritual or ethereal quality. It is a relatively rare word, often found in philosophical, artistic, or spiritual contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The supermundane tasks of daily life.","correct":"✓ The mundane tasks of daily life.","note":"\"Supermundane\" is the opposite of \"mundane.\" Use \"mundane\" to describe ordinary tasks."},{"incorrect":"✗ He lived a supermundane life, always attending parties.","correct":"✓ He lived a worldly life, always attending parties.","note":"\"Supermundane\" implies a detachment from worldly pleasures. Use \"worldly\" or \"hedonistic\" to describe someone who enjoys such things."}],"priority":"★★☆"},"related_words":{"derivatives":["supermundanely (adverb)"],"phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'supermundane' is a relatively rare and sophisticated term, typically used in philosophical, spiritual, or artistic contexts. It describes something that transcends the ordinary or worldly, often implying a connection to a higher or more spiritual realm. Because of its specialized usage and relatively low frequency, it is considered a C1 level word."},"example_sentences":[{"sentence":"The guru's teachings focused on achieving a supermundane state of consciousness.","translation":"その導師の教えは、世俗を超越した意識状態の達成に焦点を当てていた。","type":"adjective","meaning_category":"超俗的な"},{"sentence":"The music had a supermundane quality that transported the listener to another realm.","translation":"その音楽には、聴き手を別の領域へと誘うような、超俗的な性質があった。","type":"adjective","meaning_category":"超俗的な"},{"sentence":"She sought solace in the supermundane beauty of nature.","translation":"彼女は自然の世俗を超越した美しさに慰めを求めた。","type":"adjective","meaning_category":"超俗的な"}]}