{"word":"Kedushah","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(ユダヤ教) ケドゥシャー：礼拝において、特にアミダー（主要な祈り）の中で唱えられる、神の聖性を賛美する祈り。","english_definition":"(Judaism) Kedushah: A prayer recited during worship services, particularly within the Amidah (the main prayer), that praises God's holiness.","examples":[{"sentence":"The congregation recited the Kedushah in unison.","translation":"会衆は一斉にケドゥシャーを唱えた。"},{"sentence":"The Kedushah is a central part of the Sabbath morning service.","translation":"ケドゥシャーは安息日の朝の礼拝の中心的な部分である。"}],"collocations":["recite the Kedushah (ケドゥシャーを唱える)","say the Kedushah (ケドゥシャーを唱える)","Kedushah prayer (ケドゥシャーの祈り)","Kedushah service (ケドゥシャーの礼拝)"],"synonyms":["Holiness prayer","Sanctification prayer"],"antonyms":[]}],"etymology":{"value":"ヘブライ語の「קְדוּשָּׁה‎ (k'dushah)」に由来し、「聖性、神聖さ、清さ」を意味する。これは、「קָדוֹשׁ (kadosh)」(聖なる、神聖な)という語根から派生している。","priority":"★★★"},"pronunciation":{"ipa":"/kəˈduːʃɑː/","syllables":"Keh-doo-shah"},"inflection":{"noun_plural":"Kedushot (複数形は「Kedushot」)"},"usage_notes":{"explanation":"「**Kedushah**」は、ユダヤ教の礼拝において非常に重要な祈りであり、神の聖性を公に宣言するものです。通常、ミ二ャン（10人以上の成人ユダヤ教徒の定足数）が存在する場合にのみ唱えられます。アミダーの中で唱えられる場合、会衆と礼拝の先導者が交互に聖句を唱える形式をとることが多いです。ケドゥシャーは、神の聖なる性質を認識し、それを礼拝者自身の生活に取り入れることを目的としています。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Kedushah is a story from the Torah.","correct":"✓ The Kedushah is a prayer praising God's holiness.","note":"ケドゥシャーはトーラー（モーセ五書）の物語ではなく、神の聖性を賛美する祈りです。"},{"incorrect":"✗ Only the rabbi can say the Kedushah.","correct":"✓ The Kedushah is recited by the congregation and the prayer leader.","note":"ケドゥシャーはラビ（ユダヤ教の教師・律法解釈者）だけでなく、会衆と礼拝の先導者によって唱えられます。"},{"incorrect":"✗ Kedushah is said in every Jewish prayer.","correct":"✓ Kedushah is said in specific prayers, particularly the Amidah, when a minyan is present.","note":"ケドゥシャーはすべてのユダヤ教の祈りで唱えられるわけではなく、特定の祈り、特にミ二ャンが存在するアミダーの中で唱えられます。"}],"priority":"★★☆"},"related_words":{"derivatives":["Kadosh (聖なる、神聖な)","Kiddush (聖別、聖餐)","Kiddushin (婚約、結婚の聖別)"],"phrases":["Kedoshim Tihyu (聖なる者となれ - レビ記の一節)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"比較的低い (Relatively low) - ユダヤ教の文脈でのみ頻繁に使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Kedushah**」は、ユダヤ教の礼拝において重要な意味を持つ祈りの名前です。この祈りは、神の聖性を賛美し、会衆全体で唱えられることが多いです。特に、アミダーという主要な祈りの中で唱えられ、ミ二ャン（10人以上の成人ユダヤ教徒の定足数）が必要とされます。この祈りは、神の神聖な性質を認識し、それを礼拝者自身の生活に取り入れることを目的としています。ユダヤ教の専門的な用語であるため、一般的な英語の語彙ではありません。"},"example_sentences":[{"sentence":"During the Amidah, the chazzan (cantor) led the congregation in the **Kedushah**.","translation":"アミダーの間、ハッザン（詠唱者）が会衆を率いてケドゥシャーを唱えた。","type":"noun","meaning_category":"祈り"},{"sentence":"The **Kedushah** is a powerful expression of faith and unity within the Jewish community.","translation":"ケドゥシャーは、ユダヤ人コミュニティにおける信仰と団結の力強い表現である。","type":"noun","meaning_category":"祈り"},{"sentence":"The children listened attentively as their parents recited the words of the **Kedushah**.","translation":"子供たちは両親がケドゥシャーの言葉を唱えるのを注意深く聞いていた。","type":"noun","meaning_category":"祈り"}]}