{"word":"nonomad","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(造語)特定の場所に定住し、デジタル技術を使って仕事をする人","english_definition":"(neologism) A person who chooses to live and work in a single, fixed location, utilizing digital technology to perform their job.","examples":[{"sentence":"Unlike digital nomads who travel constantly, a nonomad prefers to establish roots in one place.","translation":"絶えず旅をするデジタルノマドとは異なり、ノノマドはある特定の場所に根を下ろすことを好む。"},{"sentence":"The rise of remote work has enabled more people to become nonomads, contributing to local economies.","translation":"リモートワークの普及により、より多くの人々がノノマドになり、地域経済に貢献している。"}],"collocations":["digital nonomad","location-independent nonomad","settled nonomad"],"synonyms":["location-independent professional","remote worker (with fixed location)","settled digital worker"],"antonyms":["digital nomad","nomad","traveler"]},{"part_of_speech":"adjective","definition":"(造語)特定の場所に定住し、デジタル技術を使って仕事をするライフスタイルに関する","english_definition":"(neologism) Relating to a lifestyle of living and working in a single, fixed location while utilizing digital technology.","examples":[{"sentence":"The nonomad lifestyle offers stability and community connection.","translation":"ノノマドのライフスタイルは、安定と地域社会とのつながりを提供する。"},{"sentence":"She embraced a nonomad approach to work, finding a balance between flexibility and rootedness.","translation":"彼女は仕事に対してノノマド的なアプローチを採用し、柔軟性と根付くことのバランスを見つけた。"}],"collocations":["nonomad lifestyle","nonomad approach","nonomad community"],"synonyms":["location-dependent remote","settled remote"],"antonyms":["nomadic","location-independent"]}],"etymology":{"value":"A blend of 'no' and 'nomad,' coined to contrast with the digital nomad lifestyle. It emphasizes staying in one place rather than constant travel.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnoʊˌnæd/","syllables":"no-nom-ad"},"inflection":{"noun_plural":"nonomads"},"usage_notes":{"explanation":"'Nonomad' is a relatively new term used to describe individuals who work remotely but choose to remain in one location. It is often used in contrast to 'digital nomad,' who travels frequently. The term highlights the desire for stability and community connection while still benefiting from the flexibility of remote work.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a nomad, working from home.","correct":"✓ She is a nonomad, working from home.","note":"A 'nomad' implies travel, while a 'nonomad' works remotely from a fixed location."},{"incorrect":"✗ Nonomadding is the new trend.","correct":"✓ The nonomad lifestyle is the new trend.","note":"Use 'nonomad' as a noun or adjective, not a verb."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["digital nomad","remote work","location independence","telecommuting","remote worker","distributed workforce"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (new term)","frequency_google_ngram":"Low frequency (new term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonomad' is a recently coined term that describes someone who works remotely using technology but prefers to stay in one place. It's the opposite of a 'digital nomad,' who travels and works from different locations. The term is used to highlight the choice of stability and connection to a specific community while still enjoying the benefits of remote work. Understanding this term requires familiarity with the concept of digital nomadism and remote work trends."},"example_sentences":[{"sentence":"As a nonomad, she enjoys the flexibility of remote work while building strong local connections.","translation":"ノノマドとして、彼女はリモートワークの柔軟性を享受しながら、地域との強いつながりを築いている。","type":"noun","meaning_category":"person"},{"sentence":"The nonomad trend is changing how people think about work and community.","translation":"ノノマドというトレンドは、人々の仕事とコミュニティに対する考え方を変えつつある。","type":"adjective","meaning_category":"lifestyle"}]}