{"word":"unbanishable","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"Not able to be banished; that cannot be banished.","english_definition":"Not able to be banished; incapable of being exiled or expelled.","examples":[{"sentence":"His reputation was so strong that he was virtually unbanishable from the community.","translation":"彼の評判は非常に高かったため、事実上、コミュニティから追放することは不可能でした。"},{"sentence":"The mythical creature was said to be unbanishable, bound to the land by ancient magic.","translation":"その神話上の生き物は、古代の魔法によって土地に縛られており、追放することは不可能だと言われていました。"}],"collocations":["virtually unbanishable","legally unbanishable","practically unbanishable"],"synonyms":["inescapable","irremovable","indelible","unexilable"],"antonyms":["banishable","exilable","removable"]}],"etymology":{"value":"Formed from 'un-' (not) + 'banishable' (able to be banished).","notes":"The word follows a standard pattern of negation in English, combining a negative prefix with an existing adjective.","priority":"medium"},"pronunciation":{"ipa":"/ʌnˈbænɪʃəbəl/","syllables":"un-ban-ish-a-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are rarely used with 'unbanishable' due to its absolute meaning.","comparative":"more unbanishable","superlative":"most unbanishable"},"usage_notes":{"explanation":"'Unbanishable' is a relatively rare word, typically used in contexts where the possibility or threat of banishment is relevant. It often appears in discussions of law, politics, or fantasy literature. The term implies a state of being immune to banishment due to legal protections, social standing, or supernatural forces.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"He is unbanished.","correct":"He is unbanishable.","note":"'Unbanished' means 'not banished' (i.e., not currently in exile), while 'unbanishable' means 'incapable of being banished'."}],"priority":"medium"},"related_words":{"derivatives":["unbanish (verb): to restore someone from banishment","banish (verb): to expel from a place or country","banishment (noun): the act of banishing"],"related_terms":["exile","expulsion","deportation"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","notes":"The word is not commonly used in everyday language.","priority":"high"},"readability_explanation":{"level":"C2","text":"'Unbanishable' is a complex word due to its rarity and the legal/political context it often appears in. Understanding the base word 'banish' and the negative prefix 'un-' is essential to comprehending its meaning. It is most likely to be encountered in advanced texts dealing with law, history, or fantasy.","priority":"high"},"example_sentences":[{"sentence":"The king declared that no member of the royal family was unbanishable, regardless of their crimes.","translation":"王は、いかなる犯罪を犯しても王室のメンバーは追放できないと宣言した。","type":"general","meaning_category":"incapable of being banished"},{"sentence":"Due to his diplomatic immunity, he was practically unbanishable from the host country.","translation":"彼の外交特権により、彼は事実上ホスト国から追放することは不可能だった。","type":"legal/political","meaning_category":"immune from banishment"},{"sentence":"In the fantasy novel, the protagonist discovered he was unbanishable from the magical realm.","translation":"そのファンタジー小説の中で、主人公は自分が魔法の領域から追放できないことに気づいた。","type":"fantasy","meaning_category":"protected from banishment by magic"}]}