{"word":"pinfire","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ピン打ち式（雷管式）の弾薬、またはそれを用いる銃","english_definition":"A type of cartridge in which the priming compound is ignited by striking a small pin that protrudes radially from the side of the cartridge case; also, a firearm that uses such cartridges.","examples":[{"sentence":"The pinfire cartridge was a popular early form of self-contained ammunition.","translation":"ピン打ち式弾薬は、初期の一般的な自給式弾薬の一形態でした。"},{"sentence":"Pinfire revolvers were common in Europe in the mid-19th century.","translation":"ピン打ち式リボルバーは、19世紀半ばのヨーロッパで一般的でした。"}],"collocations":["pinfire cartridge","pinfire revolver","pinfire mechanism"],"synonyms":["Lefaucheux cartridge"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ピン打ち式の","english_definition":"Relating to or using a pinfire cartridge.","examples":[{"sentence":"He collected pinfire guns and ammunition.","translation":"彼はピン打ち式の銃と弾薬を収集していました。"}],"collocations":["pinfire gun","pinfire ammunition"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'pinfire' comes from the pin that protrudes from the side of the cartridge. This pin is struck by the hammer of the firearm, igniting the priming compound inside the cartridge.","priority":"★★☆"},"pronunciation":{"ipa":"ˈpɪnˌfaɪər","syllables":"pin-fire"},"inflection":{"noun_plural":"pinfires"},"usage_notes":{"explanation":"Pinfire cartridges and firearms are considered obsolete, but they are of historical interest. The pinfire system was invented by Casimir Lefaucheux in the 1830s, and it was one of the first successful self-contained cartridge designs.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pinfire' refers to a specific, obsolete type of firearm cartridge where a pin protruding from the side is struck to ignite the gunpowder. Understanding this term requires knowledge of historical firearm technology. It is not commonly used in modern contexts outside of historical discussions or collecting."},"example_sentences":[{"sentence":"The museum displayed a collection of antique pinfire pistols.","translation":"博物館には、アンティークのピン打ち式ピストルのコレクションが展示されていました。","type":"noun","meaning_category":"ピン打ち式銃"},{"sentence":"Pinfire cartridges are easily identifiable by the small pin sticking out of the side.","translation":"ピン打ち式弾薬は、側面から突き出た小さなピンで簡単に見分けることができます。","type":"noun","meaning_category":"ピン打ち式弾薬"}]}