{"word":"throwout","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(印刷)折り込みページ、見開きページ","english_definition":"(printing) a page that is larger than the standard size of the book or magazine and is folded in to fit.","examples":[{"sentence":"The map was printed as a throwout in the guidebook.","translation":"その地図はガイドブックの折り込みページとして印刷された。"}],"collocations":[],"synonyms":["gatefold","foldout"],"antonyms":[]},{"part_of_speech":"noun","definition":"(野球)キャッチャーから他の塁への送球によるアウト","english_definition":"(baseball) an out made by a catcher throwing to another base to retire a runner.","examples":[{"sentence":"The catcher made a great throwout to second base.","translation":"キャッチャーはセカンドへ素晴らしい送球をしてアウトにした。"}],"collocations":[],"synonyms":["caught stealing"],"antonyms":[]}],"etymology":{"value":"The term 'throwout' combines the verb 'throw' and the preposition 'out'. In printing, it refers to a page that is 'thrown out' or extended beyond the standard page size. In baseball, it refers to throwing a runner 'out' at a base.","priority":"★★☆"},"pronunciation":{"ipa":"ˈθroʊˌaʊt","syllables":"throw-out"},"inflection":{"noun_plural":"throwouts"},"usage_notes":{"explanation":"The word \"throwout\" has two distinct meanings, one in printing and the other in baseball. In printing, it refers to a foldout page. In baseball, it describes a specific play where a runner is thrown out. The context usually makes the meaning clear.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The book had a big throw out with pictures.","correct":"✓ The book had a big throwout with pictures.","note":"The correct term is 'throwout' (one word) when referring to a foldout page in a book."}],"priority":"★★☆"},"related_words":{"derivatives":["throw (verb)","out (preposition)"],"phrasal_verbs":["throw out (to discard, to expel)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'throwout' is a technical term with specific meanings in printing and baseball. It is not a common word in everyday conversation. The printing definition refers to a page that folds out, while the baseball definition refers to a specific play. Understanding the context is crucial to interpreting the meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The magazine included a beautiful throwout of the city skyline.","translation":"その雑誌には、都市のスカイラインの美しい折り込みページが含まれていた。","type":"noun","meaning_category":"printing"},{"sentence":"The catcher's quick throwout prevented the runner from stealing second.","translation":"キャッチャーの素早い送球で、ランナーは二塁を盗むことができなかった。","type":"noun","meaning_category":"baseball"}]}