{"word":"preoccupier","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"占有者、先住者","english_definition":"One who occupies or takes possession of something before others; a prior occupant.","examples":[{"sentence":"The preoccupier of the land had certain rights.","translation":"その土地の先住者には一定の権利があった。"},{"sentence":"The issue of the preoccupier's claim was central to the dispute.","translation":"先住者の権利の主張が、紛争の中心だった。"}],"collocations":["prior preoccupier","original preoccupier"],"synonyms":["occupant","inhabitant","resident","settler","squatter"],"antonyms":["evictee","dispossessor"]}],"etymology":{"value":"Derived from 'preoccupy', which comes from the prefix 'pre-' (before) and 'occupy' (to take possession of).","priority":"★★★"},"pronunciation":{"ipa":"/priːˈɒkjʊpaɪər/","syllables":"pre-oc-cu-pi-er"},"inflection":{"noun_plural":"preoccupiers"},"usage_notes":{"explanation":"'Preoccupier' is a relatively uncommon word, often used in legal or historical contexts to refer to someone who occupied land or a position before someone else. It emphasizes the temporal aspect of occupation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The preoccupier was very preoccupied.","correct":"✓ The preoccupier was very concerned about the land rights.","note":"'Preoccupier' refers to the person who occupies, while 'preoccupied' means being absorbed in thought. Don't confuse the two."}],"priority":"★★☆"},"related_words":{"derivatives":["preoccupy","preoccupation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'preoccupier' is a formal term, typically used in legal or historical contexts to denote someone who has taken possession of something, especially land, before others. It implies a prior claim based on earlier occupancy. Due to its specialized usage, it is more likely to be encountered in advanced texts or discussions related to property rights, historical settlements, or legal disputes."},"example_sentences":[{"sentence":"As the original preoccupier of the territory, the tribe asserted its ancestral rights.","translation":"その地域のもともとの先住者として、その部族は先祖伝来の権利を主張した。","type":"noun","meaning_category":"占有者"},{"sentence":"The court had to consider the rights of the preoccupier before making a decision about the land ownership.","translation":"裁判所は、土地の所有権に関する決定を下す前に、先住者の権利を考慮しなければならなかった。","type":"noun","meaning_category":"占有者"}]}