{"word":"hydroplanula","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヒドロ虫類のプラヌラ幼生の一種で、水中で浮遊生活を送るもの。","english_definition":"A type of planula larva found in some hydrozoans, characterized by its planktonic, free-swimming existence.","examples":[{"sentence":"The hydroplanula is the dispersal stage for many colonial hydrozoans.","translation":"ヒドロプラヌラは、多くの群体性ヒドロ虫にとって分散段階である。"},{"sentence":"Hydroplanulae swim freely in the water column before settling and metamorphosing.","translation":"ヒドロプラヌラは、定着して変態する前に、水中で自由に泳ぐ。"}],"collocations":["planktonic hydroplanula","hydroplanula larva","settling hydroplanula","hydroplanula dispersal"],"synonyms":["planula","larva"],"antonyms":[]}],"etymology":{"value":"\"hydro-\" (水) + \"planula\" (プラヌラ幼生) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪdroʊˈplænjʊlə/","syllables":"hy-dro-plan-u-la"},"inflection":{"noun_plural":"hydroplanulae"},"usage_notes":{"explanation":"Hydroplanulaは、特にヒドロ虫類の生活環における浮遊幼生段階を指す専門用語である。生物学、海洋学の文脈で用いられる。","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["hydrozoan","planula","planktonic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Hydroplanula\" is a specialized term used in marine biology and zoology to describe a specific larval stage in the life cycle of hydrozoans (a class of marine invertebrates). This term is not commonly encountered outside of scientific literature and academic contexts. Understanding the term requires familiarity with invertebrate zoology, larval biology, and marine ecology. The word is composed of \"hydro-\" (referring to water) and \"planula\" (a type of larva), indicating its aquatic nature and larval stage. Due to its highly specific and technical nature, it is not typically part of general English vocabulary."},"example_sentences":[{"sentence":"The researchers studied the dispersal patterns of hydroplanulae in the coastal waters.","translation":"研究者たちは沿岸水域におけるヒドロプラヌラの分散パターンを研究した。","type":"noun","meaning_category":"ヒドロ虫類のプラヌラ幼生"},{"sentence":"Settlement cues influence the metamorphosis of hydroplanulae into benthic polyps.","translation":"定着の合図は、ヒドロプラヌラから底生ポリプへの変態に影響を与える。","type":"noun","meaning_category":"ヒドロ虫類のプラヌラ幼生"}]}