{"word":"hypnotisability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"催眠感受性、被暗示性","english_definition":"The degree to which a person is susceptible to hypnosis.","examples":[{"sentence":"Her hypnotisability was assessed using the Stanford Hypnotic Susceptibility Scale.","translation":"彼女の催眠感受性は、スタンフォード催眠感受性スケールを用いて評価された。"},{"sentence":"Individuals with high hypnotisability often experience more vivid hypnotic phenomena.","translation":"催眠感受性の高い人は、より鮮明な催眠現象を経験することが多い。"},{"sentence":"Hypnotisability is a relatively stable trait, but it can be influenced by situational factors.","translation":"催眠感受性は比較的安定した特性であるが、状況要因によって影響を受ける可能性がある。"}],"collocations":["high hypnotisability (高い催眠感受性)","low hypnotisability (低い催眠感受性)","assess hypnotisability (催眠感受性を評価する)","measure hypnotisability (催眠感受性を測定する)","Stanford Hypnotic Susceptibility Scale (スタンフォード催眠感受性スケール)"],"synonyms":["hypnotic susceptibility","suggestibility"],"antonyms":["hypnotic resistance"],"notes":"Also spelled as hypnotizability."}],"etymology":{"value":"From 'hypnotisable' (or 'hypnotizable') + '-ability'. 'Hypnotisable' is derived from 'hypnotize' + '-able'. 'Hypnotize' comes from 'hypnosis', which originates from the Greek word 'hypnos' (sleep).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɪpnətaɪzəˈbɪləti/","syllables":"hyp-no-ti-sa-bi-li-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Hypnotisability' refers to the extent to which an individual is responsive to hypnotic suggestions. It is a spectrum, with some people being highly susceptible and others being resistant to hypnosis. Assessment scales, such as the Stanford Hypnotic Susceptibility Scale, are used to measure this trait. It is important to note that hypnotisability is not related to gullibility or suggestibility in everyday life.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hypnotisability is the same as intelligence.","correct":"✓ Hypnotisability is not the same as intelligence.","note":"Hypnotisability is distinct from intelligence or gullibility."},{"incorrect":"✗ You can increase your hypnotisability with practice.","correct":"✓ Hypnotisability is considered a relatively stable trait.","note":"While some factors can influence hypnotic response, hypnotisability is generally considered a stable trait."}],"priority":"★☆☆"},"related_words":{"derivatives":["hypnosis (名詞: 催眠)","hypnotic (形容詞: 催眠の、催眠的な；名詞: 催眠薬)","hypnotize (動詞: 催眠術をかける)","hypnotist (名詞: 催眠術師)","hypnotizable (形容詞: 催眠にかかりやすい)","hypnotizability (名詞: 催眠感受性 - alternative spelling)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypnotisability' is a specialized term primarily used in psychology and related fields. It refers to an individual's capacity to enter a hypnotic state and respond to suggestions. Understanding this term requires familiarity with the concepts of hypnosis and psychological traits. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"Research suggests that hypnotisability is a predictor of success in hypnotherapy.","translation":"研究によると、催眠感受性は催眠療法の成功の予測因子となる。","type":"general","meaning_category":"催眠感受性"},{"sentence":"The study aimed to explore the neural correlates of hypnotisability using fMRI.","translation":"その研究は、fMRIを用いて催眠感受性の神経相関を調査することを目的とした。","type":"research context","meaning_category":"催眠感受性"},{"sentence":"Differences in hypnotisability may explain why some people benefit more from hypnosis than others.","translation":"催眠感受性の違いは、催眠療法からより多くの恩恵を受ける人がいる理由を説明するかもしれない。","type":"clinical context","meaning_category":"催眠感受性"}]}