{"word":"twig-green","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"小枝のような緑色の、若枝の緑色をした","english_definition":"Having a green color resembling that of a twig or young branch.","examples":[{"sentence":"The dress was a beautiful twig-green, perfect for spring.","translation":"そのドレスは美しい小枝のような緑色で、春にぴったりだった。"},{"sentence":"She painted the walls a soft twig-green to create a calming atmosphere.","translation":"彼女は穏やかな雰囲気を作り出すために、壁を柔らかい若枝の緑色に塗った。"}],"collocations":["twig-green dress","twig-green paint","twig-green leaves"],"synonyms":["sap-green","verdant","spring green","leaf green"],"antonyms":["brown","grey","withered"],"notes":"Often used to describe colors in fashion, interior design, or nature writing."}],"etymology":{"value":"A compound word formed by combining 'twig' (a small branch or shoot) and 'green' (the color).","priority":"★★★"},"pronunciation":{"ipa":"/ˈtwɪɡˌɡriːn/","syllables":"twig-green"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Twig-green' is a descriptive adjective that evokes a specific shade of green, reminiscent of young, fresh twigs. It is not a commonly used word, but it is effective in creating a vivid image.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The twig-green were beautiful.","correct":"✓ The twig-green color was beautiful.","note":"'Twig-green' is an adjective, so it needs a noun to modify."}],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★★★"},"readability_explanation":{"level":"C1","text":"'Twig-green' is a relatively uncommon adjective used to describe a specific shade of green, similar to the color of young twigs. It is most likely to be encountered in descriptive writing, particularly in contexts related to nature, fashion, or design. Understanding the meaning of 'twig' and 'green' separately helps to infer the meaning of the compound word."},"example_sentences":[{"sentence":"The artist used a twig-green hue to capture the freshness of the new leaves.","translation":"その芸術家は、新しい葉の新鮮さを捉えるために、小枝のような緑色を使った。","type":"general","meaning_category":"descriptive"},{"sentence":"The interior designer chose a twig-green wallpaper for the bedroom.","translation":"インテリアデザイナーは、寝室に若枝の緑色の壁紙を選んだ。","type":"general","meaning_category":"descriptive"}]}