{"word":"tomb-strewn","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"墓が散在している、墓だらけの","english_definition":"covered or scattered with tombs or graves.","examples":[{"sentence":"The tomb-strewn battlefield was a somber reminder of the war's cost.","translation":"墓が散在する戦場は、戦争の代償を痛ましく思い出させた。"},{"sentence":"They walked through the tomb-strewn cemetery, reading the names on the headstones.","translation":"彼らは墓だらけの墓地を歩き、墓石の名前を読んでいた。"}],"collocations":["tomb-strewn field","tomb-strewn landscape","tomb-strewn cemetery"],"synonyms":["grave-dotted","grave-scattered","tomb-filled"],"antonyms":[],"notes":"Often used in a literary or descriptive context to evoke a sense of history, loss, or solemnity."}],"etymology":{"value":"Derived from 'tomb' (a burial place) and 'strewn' (scattered or spread).","priority":"★★★"},"pronunciation":{"ipa":"/ˈtuːmˌstruːn/","syllables":"tomb-strewn"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Tomb-strewn' is a descriptive adjective used to depict a landscape or area that is characterized by the presence of numerous tombs or graves. It often carries a connotation of historical significance, solemnity, or desolation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city was tomb-strewn.","correct":"✓ The cemetery was tomb-strewn.","note":"'Tomb-strewn' is generally used to describe areas specifically associated with burial, such as cemeteries, battlefields, or ancient ruins, not general urban areas."}],"priority":"★★☆"},"related_words":{"derivatives":["tomb","strewn"],"related_forms":["grave","burial ground","necropolis"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tomb-strewn' is a relatively uncommon and literary adjective. Its use suggests a high level of vocabulary and an understanding of descriptive language. It is not typically encountered in everyday conversation or writing but is more likely to appear in historical texts, gothic literature, or evocative descriptions of landscapes with a strong sense of history or death."},"example_sentences":[{"sentence":"The ancient battlefield, now tomb-strewn, whispered tales of forgotten heroes.","translation":"古代の戦場は、今や墓だらけで、忘れられた英雄たちの物語を囁いていた。","type":"descriptive","meaning_category":"landscape"},{"sentence":"A tomb-strewn hillside marked the site of the plague victims' mass burial.","translation":"墓だらけの丘の中腹は、ペスト犠牲者の集団埋葬地の場所を示していた。","type":"historical","meaning_category":"location"}]}