{"word":"daytime-sensitive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"昼間に影響を受けやすい、昼間の影響を受ける、日中の時間帯に特有の反応を示す","english_definition":"Reacting or responding in a specific way during the daytime; affected by or designed for use during daylight hours.","examples":[{"sentence":"The plant's growth is daytime-sensitive, requiring direct sunlight for photosynthesis.","translation":"その植物の成長は昼間に影響を受けやすく、光合成のために直射日光を必要とする。"},{"sentence":"The security system has daytime-sensitive settings to adjust for the amount of natural light.","translation":"そのセキュリティシステムには、自然光の量に合わせて調整する昼間対応の設定がある。"},{"sentence":"This medication is daytime-sensitive and should be taken in the morning for optimal effectiveness.","translation":"この薬は昼間に影響を受けやすく、効果を最大限に発揮するために朝に服用する必要がある。"}],"collocations":["daytime-sensitive medication","daytime-sensitive settings","daytime-sensitive plant","daytime-sensitive operation"],"synonyms":["light-dependent","diurnal","sunlight-reactive","time-of-day-dependent"],"antonyms":["nighttime-sensitive","light-independent","nocturnal"]}],"etymology":{"value":"The word is formed by combining 'daytime' (referring to the period when the sun is above the horizon) with 'sensitive' (easily affected or responsive).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdeɪˌtaɪm ˈsɛnsɪtɪv/","syllables":"day-time sen-si-tive"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Daytime-sensitive' is used to describe something that has a particular reaction or function specifically during the day. This can relate to biological processes, technological settings, or other phenomena that are influenced by daylight or the time of day.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sensor is sensitive to daytime.","correct":"✓ The sensor is daytime-sensitive.","note":"Using 'sensitive to daytime' is grammatically correct but doesn't convey the specific meaning of being designed or reacting in a particular way during the day. 'Daytime-sensitive' is a compound adjective that succinctly expresses this idea."}],"priority":"★★☆"},"related_words":{"derivatives":["daytime","sensitive"],"phrasal_verbs":[],"related_terms":["light-sensitive","time-sensitive","diurnal","nocturnal"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'daytime-sensitive' is a compound adjective used to describe something that is specifically affected by or designed for use during the daytime. It is often used in technical or scientific contexts. Understanding the term requires knowledge of both 'daytime' and 'sensitive' and the ability to combine them into a single concept."},"example_sentences":[{"sentence":"The solar panel's efficiency is daytime-sensitive, peaking during the hours of maximum sunlight.","translation":"そのソーラーパネルの効率は昼間に影響を受けやすく、日照時間が最大になる時間にピークを迎える。","type":"general","meaning_category":"general"},{"sentence":"The camera has a daytime-sensitive filter to improve image quality in bright conditions.","translation":"そのカメラには、明るい状況での画質を向上させる昼間対応のフィルターが付いている。","type":"technical","meaning_category":"technical"},{"sentence":"The flower's petals are daytime-sensitive, opening in the morning and closing in the evening.","translation":"その花の花びらは昼間に影響を受けやすく、朝に開き、夕方に閉じる。","type":"biological","meaning_category":"biological"}]}