{"word":"uncringing","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(人や態度が)卑屈でない、へつらわない、臆することのない","english_definition":"Not cringing; not behaving in a servile or obsequious manner; not shrinking back in fear or embarrassment.","examples":[{"sentence":"He gave an uncringing speech, standing up for his beliefs.","translation":"彼は自分の信念を擁護し、臆することなく演説を行った。"},{"sentence":"Her uncringing attitude impressed everyone in the room.","translation":"彼女の卑屈にならない態度は、部屋にいた全員に感銘を与えた。"},{"sentence":"The reporter asked uncringing questions, refusing to be intimidated.","translation":"その記者は臆することなく質問をし、脅迫されることを拒んだ。"}],"collocations":["uncringing attitude","uncringing honesty","uncringing defiance","uncringing gaze","uncringing manner"],"synonyms":["unflinching","unyielding","resolute","bold","fearless","assertive","forthright","dignified","proud","independent"],"antonyms":["cringing","servile","obsequious","fawning","submissive","timid","cowardly","shrinking","deferential"]},{"part_of_speech":"verb (present participle)","definition":"cringe しないこと","english_definition":"The act of not cringing; refraining from servile or fearful behavior.","examples":[{"sentence":"Uncringing in the face of adversity, she continued to fight for her rights.","translation":"逆境に臆することなく、彼女は自分の権利のために戦い続けた。"},{"sentence":"His uncringing before authority made him a popular figure.","translation":"権力者の前で彼が卑屈にならないことが、彼を人気者にした。"}],"collocations":["uncringing before authority","uncringing in the face of danger","uncringing in the face of criticism"],"synonyms":["not cringing","refraining from cringing","avoiding cringing"],"antonyms":["cringing","shrinking","flinching"]}],"etymology":{"value":"接頭辞 \"un-\" (否定) + \"cringing\" (卑屈な、すくみ上がる)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈkrɪndʒɪŋ/","syllables":"un-cring-ing"},"inflection":{"adjective_forms":{"comparative":"more uncringing","superlative":"most uncringing"},"verb_forms":{"present_participle":"uncringing"}},"usage_notes":{"explanation":"\"Uncringing\" describes someone or something that is the opposite of \"cringing.\" Cringing implies behaving in a servile, fearful, or embarrassed manner, often shrinking back or showing excessive deference. Therefore, \"uncringing\" suggests a lack of such behavior, indicating boldness, assertiveness, and a refusal to be intimidated or subservient. It often carries a positive connotation, implying strength of character and integrity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was uncringing with the boss.","correct":"✓ He was uncringing before the boss. / ✓ He maintained an uncringing attitude towards the boss.","note":"While \"uncringing\" can describe a person's general demeanor, it's often used with prepositions like \"before\" or in phrases like \"uncringing attitude towards\" to specify the context. Using \"with\" is less common and can sound awkward."},{"incorrect":"✗ The uncringing dog hid under the table.","correct":"✓ The bold dog did not hide under the table.","note":"\"Uncringing\" implies a lack of fear or servility. A dog hiding under the table is likely exhibiting fear, so \"uncringing\" would be an inappropriate descriptor. Use a word like \"bold\" or \"fearless\" to describe a dog that doesn't hide."}],"priority":"★★☆"},"related_words":{"derivatives":["uncringingly (adverb)"],"antonyms":["cringing","servile","obsequious","fawning","submissive","deferential"],"synonyms":["unflinching","unyielding","resolute","bold","fearless","assertive","forthright","dignified","proud","independent"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (rare and sophisticated vocabulary)","frequency_google_ngram":"Low frequency - Not a common word, but understandable in context.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Uncringing\" is a relatively uncommon word that means the opposite of \"cringing.\" To understand it, you need to know that \"cringing\" means to shrink back in fear or embarrassment, or to behave in a servile way. Therefore, \"uncringing\" describes someone who is bold, assertive, and doesn't act in a subservient or fearful manner. It's often used to describe someone who stands up for their beliefs or refuses to be intimidated. Because it's not a frequently used word, it's more likely to appear in formal writing or when a speaker wants to use precise and sophisticated language."},"example_sentences":[{"sentence":"The activist delivered an uncringing condemnation of the government's policies.","translation":"その活動家は政府の政策を臆することなく非難した。","type":"adjective","meaning_category":"卑屈でない"},{"sentence":"Despite the threats, she remained uncringing in her pursuit of justice.","translation":"脅迫にもかかわらず、彼女は正義の追求において臆することなく行動し続けた。","type":"adjective","meaning_category":"臆することのない"},{"sentence":"His uncringing honesty often made him unpopular, but he was respected for his integrity.","translation":"彼の卑屈にならない正直さは、しばしば彼を不人気にしたが、彼の誠実さは尊敬された。","type":"adjective","meaning_category":"へつらわない"},{"sentence":"The witness gave an uncringing testimony, despite being intimidated by the defendant.","translation":"証人は被告に脅迫されたにもかかわらず、臆することなく証言を行った。","type":"adjective","meaning_category":"臆することのない"}]}