{"word":"unlibellously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"Without making libelous statements; in a manner that does not involve defamation or false and damaging statements about someone.","english_definition":"In a manner that avoids libel; without making defamatory statements.","examples":[{"sentence":"The journalist reported the story unlibellously, carefully verifying all facts before publishing.","translation":"そのジャーナリストは、出版前にすべての事実を注意深く検証し、名誉毀損にならないように記事を報道した。"},{"sentence":"He spoke unlibellously about his former colleague, focusing on professional disagreements rather than personal attacks.","translation":"彼は以前の同僚について、個人的な攻撃ではなく、職業上の意見の相違に焦点を当て、名誉毀損にならないように話した。"}],"collocations":["report unlibellously","speak unlibellously","write unlibellously","act unlibellously"],"synonyms":["non-defamatorily","fairly","accurately","truthfully","objectively"],"antonyms":["libellously","defamatorily","falsely","inaccurately","unfairly"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'libellously', which is derived from 'libel' (a published false statement that is damaging to a person's reputation) and the suffix '-ously' (in a manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnlaɪˈbɛləsli/","syllables":"un-li-bel-lous-ly"},"inflection":{"notes":"Adverbs do not typically inflect. This word does not have different forms.","adverb_forms":{}},"usage_notes":{"explanation":"'Unlibellously' is used to describe actions, particularly in journalism, writing, or speaking, that are conducted in a way that avoids making false and damaging statements about someone. It emphasizes the care taken to ensure accuracy and avoid defamation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unlibellously wrote the story, but it was still biased.","correct":"✓ He wrote the story unlibellously, but it was still biased.","note":"The adverb 'unlibellously' should be placed to modify the verb 'wrote', indicating how the action was performed, not as a separate clause. The correct sentence emphasizes that the writing was done without libel, even if bias was present."},{"incorrect":"✗ The report was unlibellous, so he was sued.","correct":"✓ The report was libellous, so he was sued. / ✓ The report was not libellous, so he was not sued.","note":"'Unlibellous' means not containing libel. If someone is sued, it implies the content was libellous, not unlibellous. The sentence should be corrected to reflect this logic."}],"priority":"★★☆"},"related_words":{"derivatives":["libel (noun)","libellous (adjective)","libellously (adverb)","libeler (noun)","nonlibelous (adjective)"],"phrases":["without libel","free from defamation","not defamatory"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - The word is rare and primarily used in legal or journalistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unlibellously' is a complex word used in formal contexts, especially in law and journalism, to describe the act of communicating information without making defamatory statements. Understanding this word requires knowledge of legal concepts related to libel and defamation. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The biography was carefully researched to ensure that it presented the subject's life unlibellously.","translation":"その伝記は、被写体の人生を名誉毀損にならないように注意深く調査された。","type":"adverb","meaning_category":"avoiding defamation"},{"sentence":"She insisted that the article be written unlibellously, even if it meant omitting some sensational details.","translation":"彼女は、センセーショナルな詳細をいくつか省略することになっても、記事が名誉毀損にならないように書かれることを主張した。","type":"adverb","meaning_category":"without making false statements"}]}