{"word":"Bismillah","priority":"★★☆","meanings":[{"part_of_speech":"interjection","definition":"神の御名において（慈悲あまねく慈愛深きアッラーの御名において）","english_definition":"In the name of God (Allah); a phrase recited before starting something, especially by Muslims.","examples":[{"sentence":"Bismillah ir-Rahman ir-Rahim, let's begin this important project.","translation":"慈悲あまねく慈愛深きアッラーの御名において、この重要なプロジェクトを始めましょう。"},{"sentence":"He said 'Bismillah' before taking the first bite of his meal.","translation":"彼は食事の最初の一口を食べる前に「ビスミッラー」と言った。"}],"collocations":["recite Bismillah","say Bismillah before eating","begin with Bismillah"],"synonyms":["In the name of Allah","Bi ismi-llāhi r-raḥmāni r-raḥīm (Arabic)"],"antonyms":[]},{"part_of_speech":"noun","definition":"（イスラム教で）「神の御名において」という言葉、またはそれを記したカリグラフィー","english_definition":"The phrase 'In the name of God' in Islam, or a calligraphic representation of it.","examples":[{"sentence":"The mosque was decorated with beautiful Bismillah calligraphy.","translation":"モスクは美しいビスミッラーのカリグラフィーで飾られていた。"},{"sentence":"Many Muslims keep a Bismillah plaque in their homes.","translation":"多くのイスラム教徒は家にビスミッラーの飾り額を飾っている。"}],"collocations":["Bismillah calligraphy","Bismillah plaque","display Bismillah"],"synonyms":["Islamic calligraphy","Basmala"],"antonyms":[]}],"etymology":{"value":"アラビア語の بِسْمِ ٱللَّٰهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ (bismi-llāhi r-raḥmāni r-raḥīmi) に由来し、「慈悲あまねく慈愛深きアッラーの御名において」という意味。イスラム教において非常に重要なフレーズであり、クルアーンの各章（第9章を除く）の冒頭に記されている。","priority":"★★★"},"pronunciation":{"ipa":"/bɪsˈmɪllɑː/","syllables":"Bis-mil-lah"},"inflection":{"notes":"変化しません。"},"usage_notes":{"explanation":"「**Bismillah**」は、イスラム教徒が何かを始める際に神（アッラー）の祝福を祈るために唱える言葉です。文字通りには「神の御名において」という意味で、特に食事の前や重要な行動を開始する際に使われます。また、美しいカリグラフィーのモチーフとしても用いられ、家やモスクの装飾としてよく見られます。このフレーズは、イスラム教徒の日常生活において、神への感謝と信仰を示す重要な表現です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He said Bismillah after finishing the meal.","correct":"✓ He said Bismillah before starting the meal.","note":"Bismillahは何かを始める前に唱えます。"},{"incorrect":"✗ Bismillah is a name of God.","correct":"✓ Bismillah is a phrase invoking the name of God.","note":"Bismillahは神の名前そのものではなく、神の名を唱えるフレーズです。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrases":["Bismillah ir-Rahman ir-Rahim (بِسْمِ ٱللَّٰهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ) - The full Arabic phrase meaning 'In the name of God, the Most Gracious, the Most Merciful'","Alhamdulillah (ٱلْحَمْدُ لِلَّٰهِ) - Praise be to God","Subhanallah (سُبْحَانَ ٱللَّٰهِ) - Glory be to God","Insha'Allah (إِنْ شَاءَ ٱللَّٰهُ) - If God wills"],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 主にイスラム教徒のコミュニティで使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Bismillah**」は、イスラム教徒が何かを始める際に使う言葉で、「神の御名において」という意味です。これは、神の祝福を祈るための表現であり、特に食事の前や重要な行動の開始時に使われます。また、美しいアラビア文字で書かれた装飾としても見られます。イスラム教の文化や信仰を理解する上で重要な言葉です。"},"example_sentences":[{"sentence":"Before starting the meeting, he quietly recited 'Bismillah'.","translation":"会議を始める前に、彼は静かに「ビスミッラー」と唱えた。","type":"interjection","meaning_category":"神の御名において"},{"sentence":"The artist created a stunning Bismillah design for the mosque's entrance.","translation":"その芸術家はモスクの入り口のために見事なビスミッラーのデザインを作成した。","type":"noun","meaning_category":"「神の御名において」という言葉、またはそれを記したカリグラフィー"}]}