{"word":"korup","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of traditional longboat used in the Pacific Northwest by indigenous peoples, particularly the Nuu-chah-nulth (Nootka) and related groups.","english_definition":"A type of traditional longboat used in the Pacific Northwest by indigenous peoples, particularly the Nuu-chah-nulth (Nootka) and related groups.","examples":[{"sentence":"The skilled craftsmen carved the korup from a single cedar log.","translation":"熟練した職人たちは、一本の杉の丸太からコルプを彫り出した。"}],"collocations":["cedar korup","Nuu-chah-nulth korup","carved korup"],"synonyms":["canoe","longboat"],"antonyms":[]}],"etymology":{"value":"Likely derived from the Nuu-chah-nulth language. Precise origin and meaning within the language may require further linguistic research.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkoʊrʌp/","syllables":"ko-rup"},"inflection":{"noun_plural":"korups"},"usage_notes":{"explanation":"The term 'korup' specifically refers to the traditional longboats of the indigenous peoples of the Pacific Northwest, particularly those crafted by the Nuu-chah-nulth. These boats were essential for transportation, fishing, whaling, and warfare.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a korup in the Mediterranean Sea.","correct":"✓ I saw a traditional longboat in the Mediterranean Sea.","note":"'Korup' is specific to the Pacific Northwest; using a more general term like 'longboat' is appropriate for other regions."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["Nuu-chah-nulth","canoe","longboat","cedar","indigenous","Pacific Northwest"]},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'korup' is a specialized term referring to a specific type of boat used by indigenous peoples of the Pacific Northwest. Understanding this word requires knowledge of the cultural and historical context of the region."},"example_sentences":[{"sentence":"The museum displayed a meticulously restored korup, showcasing the craftsmanship of the Nuu-chah-nulth people.","translation":"博物館には、細心の注意を払って修復されたコルプが展示されており、ヌーチャヌルス族の職人技を紹介していた。","type":"noun","meaning_category":"traditional boat"},{"sentence":"Using a korup, the tribe members navigated the treacherous waters to reach their fishing grounds.","translation":"部族のメンバーは、コルプを使って危険な海域を航行し、漁場にたどり着いた。","type":"noun","meaning_category":"traditional boat"}]}