{"word":"pound-foolish","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(金銭に関して)大きな損を避けようとして、小さな節約にこだわること。全体的な利益を損なうような、些細なことに気を取られること。","english_definition":"Economical in small matters but wasteful in large ones; penny-wise and pound-foolish.","examples":[{"sentence":"The company was pound-foolish, cutting back on essential maintenance to save a few dollars, which eventually led to costly repairs.","translation":"その会社は、数ドルの節約のために不可欠なメンテナンスを削減するという、目先の小さな利益にとらわれた行動をとったため、最終的に高額な修理費が発生した。"},{"sentence":"He was pound-foolish to spend hours searching for a cheaper gas station when his time could have been used more productively.","translation":"彼は、自分の時間をより生産的に使うことができたはずなのに、安いガソリンスタンドを探すために何時間も費やすという、目先の小さな利益にとらわれた行動をとった。"},{"sentence":"Investing in quality materials might seem expensive initially, but it's pound-foolish to opt for cheaper alternatives that will need replacing sooner.","translation":"高品質の素材に投資することは最初は高くつくように見えるかもしれないが、より早く交換が必要になる安価な代替品を選ぶことは、全体的な利益を損なうような、目先の小さな利益にとらわれた行動だ。"}],"collocations":["penny-wise and pound-foolish","being pound-foolish with finances","pound-foolish decisions","pound-foolish policies"],"synonyms":["penny-wise and pound-foolish","short-sighted","improvident","unthrifty","wasteful"],"antonyms":["penny-wise and pound-wise","thrifty","prudent","frugal","economical"]}],"etymology":{"value":"この表現は、英国の通貨単位であるポンド（pound）とペニー（penny）を対比させたもので、小さな金額であるペニーを節約することには熱心だが、大きな金額であるポンドを無駄にすることには無頓着であることを意味する。","priority":"★★★"},"pronunciation":{"ipa":"/ˌpaʊndˈfuːlɪʃ/","syllables":"pound-fool-ish"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**pound-foolish**」は、金銭的な判断において、大きな損失を避けるよりも、小さな節約に固執する傾向を指す言葉です。これは、全体的な利益や効率を無視して、目の前のわずかなコスト削減に焦点を当てる場合に当てはまります。しばしば「penny-wise and pound-foolish」というフレーズで使われます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is pound-foolish because he doesn't spend any money.","correct":"✓ He is pound-foolish because he buys cheap things that break quickly.","note":"単に倹約家であることと、pound-foolishであることは異なります。pound-foolishは、長期的な視点で見ると損をするような節約をすることです。"},{"incorrect":"✗ She is pound-foolish to invest in the stock market.","correct":"✓ It would be pound-foolish to neglect necessary repairs on her house to invest in the stock market.","note":"投資自体は必ずしもpound-foolishではありません。必要なこと（家の修理など）を怠って投資をするような場合に、pound-foolishと言えます。"},{"incorrect":"✗ He is pound-foolish to buy expensive clothes.","correct":"✓ He is pound-foolish to buy cheap clothes that fall apart after a few washes.","note":"高価なものを買うことが必ずしもpound-foolishではありません。安価だがすぐに壊れるものを買う方が、結果的に損をする場合にpound-foolishと言えます。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":["penny-wise and pound-foolish"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**pound-foolish**」は、お金の使い方について、小さな金額を節約しようとするあまり、大きな損失を招いてしまうことを指す言葉です。たとえば、少しでも安いガソリンスタンドを探して遠くまで運転する人が、ガソリン代や時間を考えると、結局損をしてしまうような場合に使われます。この言葉は、目先の利益にとらわれず、長期的な視点を持つことの重要性を示唆しています。"},"example_sentences":[{"sentence":"It's **pound-foolish** to skip regular car maintenance to save money, as it can lead to major breakdowns and expensive repairs later.","translation":"お金を節約するために定期的な車のメンテナンスを怠ることは、後で大きな故障や高額な修理につながる可能性があるため、全体的な利益を損なうような、目先の小さな利益にとらわれた行動だ。","type":"adjective","meaning_category":"金銭に関して"},{"sentence":"The government's decision to cut funding for education in order to reduce taxes was seen by many as **pound-foolish**.","translation":"税金を減らすために教育への資金提供を削減するという政府の決定は、多くの人によって、全体的な利益を損なうような、目先の小さな利益にとらわれた行動だと見なされた。","type":"adjective","meaning_category":"金銭に関して"},{"sentence":"Being **pound-foolish** can lead to significant financial problems in the long run.","translation":"目先の小さな利益にとらわれた行動は、長期的には重大な経済問題につながる可能性がある。","type":"adjective","meaning_category":"金銭に関して"}]}