{"word":"subformatively","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"形成的に下位に、または形成的な方法で下位に。","english_definition":"In a subformative manner; in a way that is subordinate in terms of formation or structure.","examples":[{"sentence":"The elements were arranged subformatively, with the core components taking precedence.","translation":"要素は形成的に下位に配置され、中核となるコンポーネントが優先されました。"},{"sentence":"The data was analyzed subformatively to identify underlying patterns.","translation":"データを形成的に下位に分析して、根本的なパターンを特定しました。"}],"collocations":["arranged subformatively","analyzed subformatively"],"synonyms":["subordinately","secondarily"],"antonyms":["primarily","fundamentally"]}],"etymology":{"value":"Derived from 'subformative' (formed below or secondarily) + '-ly' (adverbial suffix).","priority":"★★★"},"pronunciation":{"ipa":"/sʌbˈfɔːrmətɪvli/","syllables":"sub-for-ma-tive-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"The word 'subformatively' is a relatively rare adverb used to describe how something is done in a way that is subordinate or secondary in terms of its formation or structure. It's often used in technical or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was subformatively built.","correct":"✓ The building was built subformatively.","note":"Adverbs typically modify verbs, adjectives, or other adverbs. Ensure the placement reflects the intended modification. In this case, it modifies how the building was built."}],"priority":"★☆☆"},"related_words":{"derivatives":["subformative (adjective)","subformation (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Subformatively' is a highly specialized term rarely encountered outside of technical or academic writing. Understanding requires familiarity with the concept of hierarchical structures and subordinate relationships. Its usage implies a deliberate and structured approach where elements are intentionally arranged or analyzed in a secondary or supportive role."},"example_sentences":[{"sentence":"The research data was categorized subformatively to reveal deeper insights.","translation":"より深い洞察を明らかにするために、研究データは形成的に下位に分類されました。","type":"adverb","meaning_category":"manner"},{"sentence":"The architectural design integrated the secondary elements subformatively to complement the primary structure.","translation":"建築設計は、主要な構造を補完するために、二次的な要素を形成的に下位に統合しました。","type":"adverb","meaning_category":"manner"}]}