{"word":"hepatotoxemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"肝臓毒血症：肝臓の毒素が血液中に存在する状態。特に、妊娠末期の羊に見られる妊娠中毒症（妊娠高血圧症候群）に関連して発生する。","english_definition":"A condition in which toxins from the liver are present in the blood, especially occurring in ewes in late pregnancy in association with pregnancy toxemia (pregnancy-induced hypertension).","examples":[{"sentence":"Hepatotoxemia is a serious complication of pregnancy toxemia in sheep.","translation":"肝臓毒血症は、羊の妊娠中毒症の深刻な合併症です。"},{"sentence":"Early diagnosis and treatment are crucial for managing hepatotoxemia.","translation":"肝臓毒血症の管理には、早期の診断と治療が不可欠です。"}],"collocations":["pregnancy toxemia","liver dysfunction","metabolic disorder"],"synonyms":["hepatic encephalopathy","liver failure"],"antonyms":[]}],"etymology":{"value":"\"hepato-\" (肝臓) + \"toxemia\" (毒血症) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɛpətəʊtɒˈksiːmiə/","syllables":"he-pa-to-tox-e-mi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hepatotoxemia is a relatively rare but serious condition, primarily associated with pregnancy in sheep. It is characterized by the presence of liver toxins in the bloodstream, leading to liver dysfunction and metabolic disturbances.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["hepatotoxic (肝毒性の)","toxemia (毒血症)"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学専門用語","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Hepatotoxemia is a highly specialized medical term referring to a specific condition involving liver toxins in the blood, particularly in pregnant sheep. Due to its technical nature, it is primarily encountered in veterinary medicine and related scientific contexts. Understanding requires a strong background in biology and medicine."},"example_sentences":[{"sentence":"The veterinarian suspected hepatotoxemia based on the ewe's clinical signs and bloodwork.","translation":"獣医は、その雌羊の臨床徴候と血液検査に基づいて肝臓毒血症を疑った。","type":"medical","meaning_category":"diagnosis"},{"sentence":"Treatment for hepatotoxemia typically involves supportive care and measures to reduce liver toxin levels.","translation":"肝臓毒血症の治療は通常、支持療法と肝臓毒素レベルを低下させるための対策を伴う。","type":"medical","meaning_category":"treatment"}]}