{"word":"Metaluminate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A compound containing a metal and aluminate, often with a complex structure.","english_definition":"A chemical compound containing a metal element and an aluminate anion (AlO₂⁻ or Al(OH)₄⁻), often forming complex structures or mixed oxides.","examples":[{"sentence":"Calcium metaluminate is used in some types of cement.","translation":"メタアルミン酸カルシウムは、ある種のセメントに使用されます。"},{"sentence":"The crystal structure of sodium metaluminate has been studied extensively.","translation":"メタアルミン酸ナトリウムの結晶構造は、広範囲に研究されています。"}],"collocations":["calcium metaluminate","sodium metaluminate","synthesis of metaluminate","crystal structure of metaluminate"],"synonyms":["aluminate","aluminate compound"],"antonyms":[]}],"etymology":{"value":"Formed by combining 'metal' and 'aluminate'. 'Metal' refers to any element that is typically shiny, conductive, and malleable. 'Aluminate' refers to a compound containing an aluminum oxide anion.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈtæljuːmɪneɪt/","syllables":"me-tal-u-mi-nate"},"inflection":{"noun_plural":"metaluminates"},"usage_notes":{"explanation":"Metaluminates are often used in industrial applications such as cement production, catalysis, and as components in advanced materials. The specific properties of a metaluminate depend on the metal and the structure of the compound.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Metal aluminate is a type of metal.","correct":"✓ Metal aluminate is a compound containing a metal and aluminate.","note":"Metal aluminate is a compound, not a type of metal itself."}],"priority":"★★☆"},"related_words":{"derivatives":["aluminate","aluminum","metal"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'metaluminate' refers to a specific type of chemical compound. Understanding it requires knowledge of chemistry, specifically the nature of metal elements and aluminate anions. It is typically encountered in scientific or technical contexts related to materials science, inorganic chemistry, or industrial chemistry.","priority":"★★☆"},"example_sentences":[{"sentence":"The synthesis of barium metaluminate was achieved through a solid-state reaction.","translation":"メタアルミン酸バリウムの合成は、固相反応によって達成されました。","type":"noun","meaning_category":"chemical compound"},{"sentence":"Strontium metaluminate exhibits excellent luminescent properties.","translation":"メタアルミン酸ストロンチウムは、優れた発光特性を示します。","type":"noun","meaning_category":"chemical compound"}]}