{"word":"dioeciousness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"雌雄異株性（しゆういしゅせい）","english_definition":"The state or condition of being dioecious; having male and female reproductive organs in separate individuals.","examples":[{"sentence":"Dioeciousness is a reproductive strategy found in many plant and animal species.","translation":"雌雄異株性は、多くの植物および動物種に見られる繁殖戦略です。"},{"sentence":"The evolution of dioeciousness has been studied extensively in flowering plants.","translation":"雌雄異株性の進化は、顕花植物において広く研究されてきました。"}],"collocations":["obligate dioeciousness","facultative dioeciousness"],"synonyms":["gonochorism","unisexuality"],"antonyms":["monoeciousness","hermaphroditism"]}],"etymology":{"value":"Derived from the term 'dioecious', which comes from the Greek words 'di-' (two) and 'oikos' (house), referring to the separate 'houses' (individuals) for male and female reproductive organs.","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈiːʃəsnəs/","syllables":"di-oe-cious-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Dioeciousness' refers specifically to the biological condition where male and female reproductive organs are found in separate individuals. This is a key concept in botany and zoology, particularly when discussing reproductive strategies and evolutionary biology. It is often contrasted with 'monoeciousness' (having both male and female reproductive organs on the same individual) and 'hermaphroditism' (having both male and female reproductive organs within the same flower or organism).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant shows dioecious.","correct":"✓ The plant shows dioeciousness. / ✓ The plant is dioecious.","note":"'Dioecious' is an adjective, while 'dioeciousness' is the noun. Use the correct form depending on the sentence structure."}],"priority":"★★☆"},"related_words":{"derivatives":["dioecious (adjective)"],"related_terms":["monoecious","hermaphrodite","gonochoristic"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in scientific and academic contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Dioeciousness' is a technical term used in biology, specifically in botany and zoology, to describe the condition of having male and female reproductive organs in separate individuals. Understanding this term requires a background in biology or related fields. It is often discussed in the context of plant and animal reproduction, genetics, and evolutionary biology."},"example_sentences":[{"sentence":"The high incidence of dioeciousness in island floras suggests an adaptive advantage in certain environments.","translation":"島の植物相における雌雄異株性の高い発生率は、特定の環境における適応上の利点を示唆しています。","type":"general","meaning_category":"general"},{"sentence":"Studies on the genetic basis of dioeciousness are crucial for understanding the evolution of plant reproductive systems.","translation":"雌雄異株性の遺伝的基盤に関する研究は、植物の生殖系の進化を理解する上で重要です。","type":"scientific","meaning_category":"scientific"}]}