{"word":"Notorieties","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"悪名高い人々 (複数形)","english_definition":"plural of notoriety: people who are famous for something bad.","examples":[{"sentence":"The museum exhibit featured portraits of historical notorieties.","translation":"その博物館の展示では、歴史的な悪名高い人々の肖像画が展示されていた。"},{"sentence":"The tabloids are filled with stories about current notorieties.","translation":"大衆紙は、最近の悪名高い人々についての記事で溢れている。"}],"collocations":["historical notorieties (歴史的な悪名高い人々)","current notorieties (最近の悪名高い人々)","a gallery of notorieties (悪名高い人々のギャラリー)"],"synonyms":["infamous people","villains","scoundrels","reprobates","wrongdoers"],"antonyms":["celebrities","heroes","luminaries","virtuous people"]}],"etymology":{"value":"「notoriety」の複数形。「notoriety」は、中世ラテン語の「notorietas」（周知であること、有名であること）から派生し、ラテン語の「notorius」（周知の、有名な）に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnoʊtəˈraɪətiːz/","syllables":"no-to-ri-e-ties"},"inflection":{"noun_plural":"Notorieties is already a plural form."},"usage_notes":{"explanation":"\"Notorieties\" is the plural form of \"notoriety,\" which refers to the state of being famous or well-known for something bad. The word is used to describe people who are infamous or have a bad reputation. It is not commonly used as \"famous people\" but rather \"famous for bad reasons\".","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The notorieties were celebrated for their achievements.","correct":"✓ The celebrities were celebrated for their achievements.","note":"\"Notorieties\" refers to people known for bad things, while \"celebrities\" are known for positive achievements."},{"incorrect":"✗ She collected autographs from all the notorieties.","correct":"✓ She collected autographs from all the celebrities.","note":"Autographs are typically sought from people admired, not those known for negative reasons."}],"priority":"★★☆"},"related_words":{"derivatives":["notoriety (名詞: 悪名)","notorious (形容詞: 悪名高い)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Notorieties\" is a plural noun that refers to multiple people who are famous for negative reasons. It's not a commonly used word, and it's more formal than simply saying \"bad people.\" It implies that these individuals have gained a certain level of fame or recognition because of their misdeeds or negative actions. Understanding the word requires a good grasp of vocabulary and the ability to distinguish between fame and infamy."},"example_sentences":[{"sentence":"The book detailed the lives of several historical notorieties.","translation":"その本は、数人の歴史的な悪名高い人々の生涯を詳しく記述した。","type":"noun","meaning_category":"悪名高い人々"},{"sentence":"The conference focused on the impact of modern notorieties on society.","translation":"その会議は、現代の悪名高い人々が社会に与える影響に焦点を当てた。","type":"noun","meaning_category":"悪名高い人々"}]}