{"word":"tradition-directed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"伝統指向の、伝統に重きを置く","english_definition":"Characterized by a strong adherence to and respect for traditions, customs, and established ways of doing things.","examples":[{"sentence":"The society was largely tradition-directed, with customs dictating many aspects of daily life.","translation":"その社会は大部分が伝統指向であり、習慣が日常生活の多くの側面を規定していた。"},{"sentence":"His upbringing was tradition-directed, emphasizing the importance of family history and cultural heritage.","translation":"彼の育ちは伝統指向であり、家族の歴史と文化遺産の重要性を強調していた。"}],"collocations":["tradition-directed society","tradition-directed upbringing","tradition-directed values"],"synonyms":["conservative","conventional","traditionalistic","custom-bound"],"antonyms":["modern","progressive","innovative","forward-thinking"],"notes":"This term is often used in sociological or anthropological contexts to describe cultures or individuals that prioritize tradition over innovation."}],"etymology":{"value":"Formed by combining 'tradition' (from Latin 'traditio', meaning 'a handing down') with 'directed' (implying guidance or orientation).","priority":"N/A"},"pronunciation":{"ipa":"/trəˌdɪʃən dɪˈrɛktɪd/","syllables":"tra-di-tion-di-rect-ed"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be modified by adverbs (e.g., 'very tradition-directed')."},"usage_notes":{"explanation":"'Tradition-directed' describes something that is guided or influenced significantly by tradition. It is often used to describe societies, individuals, or practices that place a high value on maintaining established customs and beliefs.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The tradition-directed person is always against changes.","correct":"A tradition-directed person may be resistant to change, but not always.","note":"While tradition-directed individuals often value stability, it is not accurate to assume they are always opposed to change."}],"priority":"N/A"},"related_words":{"derivatives":["tradition (noun)","directed (adjective)"],"related_concepts":["traditionalism","cultural conservatism","social norms"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - The term is relatively specialized.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'tradition-directed' describes a strong focus on tradition. It's used to describe people or societies that highly value customs and established ways of doing things. The word implies a conscious effort to maintain these traditions."},"example_sentences":[{"sentence":"The small village maintained a tradition-directed lifestyle, largely untouched by modern influences.","translation":"その小さな村は、現代の影響をほとんど受けず、伝統指向のライフスタイルを維持していた。","type":"adjective","meaning_category":"伝統指向の"},{"sentence":"His art reflected a tradition-directed approach, drawing heavily on ancestral techniques and themes.","translation":"彼の芸術は伝統指向のアプローチを反映しており、祖先の技術とテーマを大きく取り入れていた。","type":"adjective","meaning_category":"伝統指向の"}]}