{"word":"acculturation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"文化変容、文化受容","english_definition":"the process of social, psychological, and cultural change that stems from the balancing of two cultures while adapting to the prevailing culture of the society.","examples":[{"sentence":"Acculturation can lead to changes in food habits.","translation":"文化変容は食習慣の変化につながることがある。"},{"sentence":"The acculturation process is often stressful for immigrants.","translation":"文化変容の過程は、移民にとってしばしばストレスとなる。"},{"sentence":"Language learning is an important part of acculturation.","translation":"言語学習は文化変容の重要な一部である。"}],"collocations":["cultural acculturation","psychological acculturation","acculturation process","acculturation strategy","acculturation stress"],"synonyms":["cultural assimilation","cultural adaptation","cultural exchange","cultural integration"],"antonyms":["cultural preservation","cultural isolation","cultural segregation"]}],"etymology":{"value":"From 'ac-' (variant of 'ad-' meaning 'to') + 'culture' + '-ation'.  Essentially, 'to culture' or 'to be cultured' in a new way.","priority":"★★★"},"pronunciation":{"ipa":"/əˌkʌltʃəˈreɪʃən/","syllables":"ac-cul-tur-a-tion"},"inflection":{"noun_plural":"acculturations (less common, usually used when referring to multiple instances or types of acculturation)"},"usage_notes":{"explanation":"Acculturation refers to the dual process of cultural and psychological change that occurs when different cultures interact. It involves not only adopting aspects of the new culture but also maintaining aspects of the original culture.  It's a complex process with varying degrees of adoption and retention.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Acculturation is the same as assimilation.","correct":"✓ Acculturation is related to assimilation, but it's a more complex process involving both adoption of the new culture and maintenance of the original culture.","note":"Assimilation implies a complete adoption of the new culture, while acculturation allows for the retention of aspects of the original culture."},{"incorrect":"✗ Acculturation only affects immigrants.","correct":"✓ Acculturation can affect any group that comes into contact with a different culture.","note":"While often discussed in the context of immigration, acculturation can also occur in other situations, such as colonization or globalization."}],"priority":"★★☆"},"related_words":{"derivatives":["acculturate (verb)","acculturated (adjective)"],"phrases":["reverse acculturation (when the dominant culture adopts elements of a minority culture)","selective acculturation (adopting some elements of the new culture while rejecting others)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in academic and social science contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Acculturation' is a term used to describe the changes that happen when people from different cultures come into contact with each other. It's not just about adopting the new culture, but also about keeping some parts of your original culture. This process can be complex and can affect many aspects of life, such as language, food, and social customs. It's often discussed in the context of immigration, but it can happen in other situations as well."},"example_sentences":[{"sentence":"The children of immigrants often experience faster acculturation than their parents.","translation":"移民の子供たちは、親よりも早く文化変容を経験することが多い。","type":"general","meaning_category":"general"},{"sentence":"Acculturation strategies can vary depending on individual and group factors.","translation":"文化変容戦略は、個人やグループの要因によって異なることがある。","type":"general","meaning_category":"general"},{"sentence":"Studies show that strong ethnic identity can buffer against acculturation stress.","translation":"研究によると、強い民族的アイデンティティは文化変容のストレスを軽減することができる。","type":"research","meaning_category":"research"}]}