{"word":"thixotropic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"チクソトロピー性の、揺変性の","english_definition":"(of certain gels or liquids) becoming less viscous when shaken or stirred.","examples":[{"sentence":"Thixotropic fluids are used in many applications, including paints and cosmetics.","translation":"チクソトロピー性流体は、塗料や化粧品を含む多くの用途で使用されています。"},{"sentence":"The mud exhibited thixotropic behavior.","translation":"その泥はチクソトロピー性を示した。"}],"collocations":["thixotropic fluid","thixotropic material","thixotropic behavior"],"synonyms":["shear-thinning"],"antonyms":["dilatant","rheopectic"]}],"etymology":{"value":"Derived from the Greek words 'thixis' (a touching or handling) and 'tropos' (a turning or change). Coined by Peterfi in 1927 to describe the reversible sol-gel transformation of bentonite suspensions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθɪksəˈtrɒpɪk/","syllables":"thix-o-trop-ic"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Thixotropic' describes materials that are viscous (thick) under static conditions but become less viscous (thinner) when agitated, shaken, or otherwise stressed. This property is useful in applications where a substance needs to be thick for stability but flow easily when applied.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The material is thixotropy.","correct":"✓ The material exhibits thixotropy. / ✓ The material is thixotropic.","note":"'Thixotropy' is the noun (the property itself), while 'thixotropic' is the adjective (describing something that has that property)."}],"priority":"★☆☆"},"related_words":{"derivatives":["thixotropy (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thixotropic' is a technical term used in chemistry, physics, and engineering to describe a specific property of certain fluids. It is not commonly used in everyday language. Understanding this term requires knowledge of fluid dynamics and material science."},"example_sentences":[{"sentence":"The drilling mud used in oil wells is often thixotropic to help carry cuttings to the surface.","translation":"油井で使用される掘削泥水は、切削屑を表面に運ぶのを助けるために、しばしばチクソトロピー性である。","type":"adjective","meaning_category":"describing a property"},{"sentence":"The artist preferred using thixotropic paints because they were easier to spread on the canvas.","translation":"そのアーティストは、キャンバスに広げやすいため、チクソトロピー性の塗料を使用することを好んだ。","type":"adjective","meaning_category":"describing a property"}]}