{"word":"infectiousness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"感染力、伝染性","english_definition":"The quality or state of being infectious; the ability to transmit a disease or infection to others.","examples":[{"sentence":"The infectiousness of the new variant is a major concern.","translation":"その新しい変異株の感染力が大きな懸念事項です。"},{"sentence":"The doctor explained the infectiousness period of the disease.","translation":"医師はその病気の感染期間について説明しました。"},{"sentence":"Handwashing is crucial to reduce the infectiousness of common illnesses.","translation":"手洗いは一般的な病気の感染力を低下させるために重要です。"}],"collocations":["high infectiousness (高い感染力)","low infectiousness (低い感染力)","degree of infectiousness (感染の程度)","period of infectiousness (感染期間)","reduce infectiousness (感染力を弱める)","measure infectiousness (感染力を測定する)"],"synonyms":["contagiousness","transmissibility","virulence","communicability"],"antonyms":["non-infectiousness","sterility","immunity"]}],"etymology":{"value":"The word \"infectiousness\" is derived from \"infectious,\" which comes from the Latin word \"inficere,\" meaning \"to taint, dye, or corrupt.\" The suffix \"-ness\" is added to form the noun, indicating the state or quality of being infectious.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈfɛkʃəsnəs/","syllables":"in-fec-tious-ness"},"inflection":{"noun_plural":"infectiousnesses (rarely used)"},"usage_notes":{"explanation":"\"Infectiousness\" refers specifically to the ability of a pathogen (like a virus or bacteria) to spread from one host to another. It's a key factor in understanding and controlling the spread of infectious diseases. It is often used in medical and epidemiological contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The infectiousness is very high, so wear a mask.","correct":"✓ The infectiousness is very high, so wear a mask.","note":"This sentence is grammatically correct. Common mistakes usually involve misunderstanding the concept of infectiousness itself or confusing it with other related terms like virulence (severity of the disease)."},{"incorrect":"✗ The infectiousness of the patient is good.","correct":"✓ The patient is not infectious. / ✓ The patient is no longer infectious.","note":"\"Good infectiousness\" is not a standard phrase. Instead, use phrases like \"not infectious\" or \"no longer infectious\" to indicate a lack of infectiousness."}],"priority":"★★☆"},"related_words":{"derivatives":["infectious (adjective)","infect (verb)","infection (noun)"],"phrasal_verbs":[],"related_terms":["contagion","epidemiology","pandemic","virulence","transmission","pathogen","disease","virus","bacteria"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing due to recent global health events.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"\"Infectiousness\" is a relatively complex term that is most often used in scientific or medical contexts. It describes how easily a disease can spread from one person to another. Understanding this term requires familiarity with concepts related to disease transmission and public health. The word itself is formed by adding the suffix \"-ness\" to the adjective \"infectious,\" which means capable of causing infection."},"example_sentences":[{"sentence":"The high **infectiousness** of the Delta variant led to a surge in cases.","translation":"デルタ株の高い感染力により、症例が急増しました。","type":"noun","meaning_category":"ability to spread disease"},{"sentence":"Scientists are studying the factors that contribute to the **infectiousness** of the virus.","translation":"科学者たちは、ウイルスの感染力に寄与する要因を研究しています。","type":"noun","meaning_category":"factors affecting disease spread"},{"sentence":"The **infectiousness** of the disease decreases after a week of treatment.","translation":"その病気の感染力は、1週間の治療後には低下します。","type":"noun","meaning_category":"change in disease spread"}]}