{"word":"overstater","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"誇張する人、大げさに言う人","english_definition":"A person who exaggerates or makes something seem more important or significant than it really is.","examples":[{"sentence":"He's a bit of an overstater, so don't believe everything he says.","translation":"彼は少しばかり誇張する人だから、彼の言うことをすべて信じない方が良い。"},{"sentence":"She accused him of being an overstater when he described the size of the fish he caught.","translation":"彼が釣った魚の大きさを説明したとき、彼女は彼を誇張する人だと非難した。"}],"collocations":["chronic overstater","habitual overstater","known overstater"],"synonyms":["exaggerator","embellisher","hyperbolizer","boaster","dramatist"],"antonyms":["understater","minimizer","downplayer"]}],"etymology":{"value":"The word 'overstater' is formed by combining the verb 'overstate' (to exaggerate) with the suffix '-er', which denotes a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərˈsteɪtər/","syllables":"o-ver-sta-ter"},"inflection":{"noun_plural":"overstaters"},"usage_notes":{"explanation":"'Overstater' is used to describe someone who habitually or frequently exaggerates facts or situations. It implies a tendency to make things sound more impressive, important, or dramatic than they actually are. The term is often used in a slightly negative way, suggesting that the person's statements should be taken with a grain of salt.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a big overstate.","correct":"He is a big overstater.","note":"'Overstate' is a verb. The noun form referring to a person is 'overstater'."},{"incorrect":"She is overstating person.","correct":"She is an overstating person. / She is an overstater.","note":"'Overstating' can be used as an adjective, but 'overstater' is the more common noun."}],"priority":"★★☆"},"related_words":{"derivatives":["overstate (verb): to exaggerate","overstatement (noun): an exaggeration","understate (verb): to present something as less significant than it is","understatement (noun): the presentation of something as less significant than it is"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'overstater' is a relatively uncommon word used to describe someone who exaggerates or makes things seem more important than they are. It's formed from the verb 'overstate' and the suffix '-er', which indicates a person who does something. Because it's not a frequently used word, it's more likely to be encountered in formal writing or discussions about communication styles. Understanding the meaning of 'overstate' is helpful in understanding 'overstater'."},"example_sentences":[{"sentence":"Critics often labeled the politician an overstater, especially when discussing economic growth.","translation":"批評家たちは、特に経済成長について議論する際、その政治家をしばしば誇張する人とレッテルを貼った。","type":"noun","meaning_category":"exaggerator"},{"sentence":"As a known overstater, his stories were always entertaining, if not entirely truthful.","translation":"誇張する人として知られているので、彼の話は完全に真実とは言えないまでも、いつも面白かった。","type":"noun","meaning_category":"exaggerator"}]}