{"word":"Delphian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"デルフォイの、デルフォイに関連する","english_definition":"Of or relating to Delphi or the oracle at Delphi.","examples":[{"sentence":"The Delphian oracle was consulted for guidance.","translation":"デルフォイの神託は導きを求めて相談された。"},{"sentence":"Delphian games were held to honor Apollo.","translation":"デルフォイ競技祭はアポロンを称えて開催された。"}],"collocations":["Delphian oracle","Delphian games","Delphian priestess"],"synonyms":["Pythian","oracular"],"antonyms":[]},{"part_of_speech":"adjective","definition":"あいまいな、謎めいた、二つ以上の意味に解釈できる","english_definition":"Ambiguous or obscure, like the pronouncements of the Delphic oracle.","examples":[{"sentence":"His Delphian pronouncements left us more confused than before.","translation":"彼の曖昧な発言は、私たちを以前よりも混乱させた。"},{"sentence":"The politician's Delphian statements avoided taking a clear position.","translation":"その政治家の曖昧な声明は、明確な立場を取ることを避けた。"}],"collocations":["Delphian pronouncements","Delphian statements","Delphian answer"],"synonyms":["ambiguous","obscure","equivocal","cryptic","enigmatic"],"antonyms":["clear","unambiguous","explicit"]}],"etymology":{"value":"Derived from Delphi, the ancient Greek city and site of the Temple of Apollo and its famous oracle.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdɛlfiən/","syllables":"Del-phi-an"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"'Delphian' primarily relates to Delphi, an ancient Greek city known for its oracle. It can also describe something ambiguous or difficult to interpret, reminiscent of the cryptic nature of the oracle's prophecies. The term is not commonly used in everyday conversation but appears in historical, literary, and academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He gave a Delphian explanation, so everyone understood perfectly.","correct":"✓ He gave a Delphian explanation, so no one understood what he meant.","note":"Delphian implies obscurity or ambiguity, not clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["Delphi (noun): The ancient Greek city."],"phrases":["Delphic oracle (noun): The oracle at Delphi, known for its ambiguous prophecies.)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Delphian' is relatively rare and is most often encountered in contexts related to ancient Greece, mythology, or literature. Understanding its connection to the Delphic oracle is key to grasping its meaning, especially when used to describe something ambiguous or enigmatic. Due to its specialized nature, it is not typically part of everyday vocabulary."},"example_sentences":[{"sentence":"The archaeologist uncovered artifacts from the Delphian sanctuary.","translation":"考古学者はデルフォイの聖域から出土品を発掘した。","type":"adjective","meaning_category":"Relating to Delphi"},{"sentence":"The guru's Delphian advice was open to multiple interpretations.","translation":"その導師の曖昧な助言は、複数の解釈が可能だった。","type":"adjective","meaning_category":"Ambiguous"}]}