{"word":"rectifiably","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"正当化できる形で、弁明できる形で","english_definition":"in a manner that can be justified or defended; in a way that is excusable.","examples":[{"sentence":"The company rectifiably dismissed the employee for gross misconduct.","translation":"会社は、重大な不正行為を理由に従業員を正当に解雇した。"},{"sentence":"His actions, while controversial, were rectifiably taken in the interest of national security.","translation":"彼の行動は物議を醸したが、国家安全保障のために正当化できるものであった。"}],"collocations":["rectifiably dismissed","rectifiably defended","rectifiably explained"],"synonyms":["justifiably","defensibly","excusably","vindication","legitimately","warrantedly"],"antonyms":["unjustifiably","indefensibly","inexcusably","illegitimately","unwarrantedly"]}],"etymology":{"value":"Derived from 'rectifiable,' meaning capable of being corrected or justified, plus the adverbial suffix '-ly.' 'Rectifiable' comes from 'rectify,' which originates from Latin 'rectus' (straight, right).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌrɛktɪˈfaɪəbli/","syllables":"rec-ti-fi-a-bly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Rectifiably' is used to describe actions, decisions, or situations that can be defended or shown to be right, even if they are controversial or initially seem wrong. It implies that there are valid reasons or justifications for the action or decision in question. It is a relatively formal word and is not commonly used in everyday conversation.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He rectifiably felt sad after the loss.","correct":"✓ He justifiably felt sad after the loss.","note":"'Rectifiably' is typically used for actions or decisions that require justification, not for emotions. 'Justifiably' is more appropriate for describing emotions that are warranted by a situation."},{"incorrect":"✗ The situation was rectifiably.","correct":"✓ The situation was rectifiable.","note":"'Rectifiably' is an adverb and should modify a verb, adjective, or another adverb. 'Rectifiable' is an adjective that can describe a situation."}],"priority":"☆☆☆"},"related_words":{"derivatives":["rectifiable (adjective)","rectify (verb)","rectification (noun)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'rectifiably' is a formal adverb that means 'in a way that can be justified.' It is used to describe actions or decisions that, although possibly controversial, can be shown to be right or reasonable given the circumstances. This word is not commonly used in everyday conversation and is more likely to appear in legal, academic, or formal writing contexts."},"example_sentences":[{"sentence":"The government's decision to increase taxes was rectifiably based on the urgent need to fund essential public services.","translation":"政府の増税決定は、不可欠な公共サービスへの資金提供の緊急の必要性に基づいて正当化された。","type":"adverb","meaning_category":"justifiably"},{"sentence":"Given the evidence presented, the jury rectifiably found the defendant guilty.","translation":"提示された証拠を考慮すると、陪審員は被告を有罪と正当に判断した。","type":"adverb","meaning_category":"justifiably"}]}