{"word":"reduction-protected","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(化学)還元保護された","english_definition":"(chemistry) Describes a molecule or substance that has been modified or treated to prevent or minimize reduction reactions.","examples":[{"sentence":"The reduction-protected gold nanoparticles exhibited enhanced stability in the biological environment.","translation":"還元保護された金ナノ粒子は、生物学的環境において強化された安定性を示した。"},{"sentence":"A reduction-protected electrode was used to improve the selectivity of the electrochemical sensor.","translation":"電気化学センサーの選択性を向上させるために、還元保護された電極が使用された。"}],"collocations":["reduction-protected nanoparticles","reduction-protected electrode","reduction-protected surface"],"synonyms":["reduction-resistant","reduction-stabilized"],"antonyms":["reduction-vulnerable","easily reduced"]}],"etymology":{"value":"The term combines \"reduction\" (a chemical process involving the gain of electrons) with \"protected\" (meaning shielded or defended).","priority":"N/A"},"pronunciation":{"ipa":"/rɪˈdʌkʃən prəˈtɛktɪd/","syllables":"re-duc-tion pro-tec-ted"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"In chemistry, 'reduction' refers to a chemical reaction where a substance gains electrons. A 'reduction-protected' substance is one that has been chemically modified or treated to resist or prevent this process. This is often done to stabilize the substance or to control its reactivity in specific applications. The term is commonly used in materials science, electrochemistry, and biochemistry.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The material is reduction protect.","correct":"The material is reduction-protected.","note":"The correct form is 'reduction-protected' with a hyphen."}]},"related_words":{"derivatives":["reduction","protection","protected"],"related_terms":["oxidation","redox","electrochemistry"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'reduction-protected' is a technical term used in chemistry and materials science. It describes a substance that has been treated to prevent or minimize reduction reactions. Understanding this term requires knowledge of basic chemical principles, particularly redox reactions."},"example_sentences":[{"sentence":"The synthesis of reduction-protected quantum dots allowed for their use in aqueous solutions.","translation":"還元保護された量子ドットの合成により、水溶液中での使用が可能になった。","type":"adjective","meaning_category":"chemical property"},{"sentence":"The reduction-protected polymer showed improved resistance to degradation.","translation":"還元保護されたポリマーは、分解に対する耐性が向上した。","type":"adjective","meaning_category":"material science"}]}