{"word":"Squillian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(SF) A fictional race of beings from the planet Squill in the *Hitchhiker's Guide to the Galaxy* series by Douglas Adams. They are known for their extreme litigiousness and unpleasant nature.","english_definition":"A fictional race of beings from the planet Squill in the *Hitchhiker's Guide to the Galaxy* series by Douglas Adams, known for their litigiousness.","examples":[{"sentence":"The lawyers were said to be as aggressive as Squillians.","translation":"弁護士たちはスクイリアン人と同じくらい攻撃的だと言われていた。"},{"sentence":"Avoid dealing with them; they're as bad as Squillians when it comes to contracts.","translation":"彼らとの取引は避けるべきだ。契約に関してはスクイリアン人と同じくらい厄介だ。"}],"collocations":["Squillian lawyers","as litigious as a Squillian"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the fictional planet 'Squill' in Douglas Adams' *Hitchhiker's Guide to the Galaxy* series. The name likely suggests something unpleasant or troublesome.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskwɪliən/","syllables":"Squil-li-an"},"inflection":{"noun_plural":"Squillians"},"usage_notes":{"explanation":"'Squillian' is primarily used within the context of the *Hitchhiker's Guide to the Galaxy* fandom. Outside of this context, it might be understood by those familiar with the series, often used to describe someone who is excessively litigious or unpleasant in legal matters.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Squill (planet name)"],"phrases":["Hitchhiker's Guide to the Galaxy"],"related_characters":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency outside of the context of the *Hitchhiker's Guide to the Galaxy* series.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Squillian' is highly specific to the science fiction context of Douglas Adams' *Hitchhiker's Guide to the Galaxy*. Understanding and usage require familiarity with this work. Outside of this context, the term is unlikely to be recognized or understood. When used, it typically serves as a humorous or satirical comparison to someone perceived as excessively litigious or unpleasant.","priority":"★★☆"},"example_sentences":[{"sentence":"The negotiation became a nightmare, with lawyers acting like stereotypical Squillians.","translation":"交渉は悪夢と化し、弁護士たちは典型的なスクイリアン人のように振る舞った。","type":"noun","meaning_category":"Fictional race"},{"sentence":"He was as difficult to deal with as a Squillian when it came to the terms of the agreement.","translation":"合意条件に関して、彼はスクイリアン人と同じくらい扱いにくかった。","type":"noun","meaning_category":"Figurative use for litigiousness"}]}