{"word":"superinjection","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"過剰注入、過量注入","english_definition":"The act of injecting an excessive amount of a substance.","examples":[{"sentence":"The engine failed due to superinjection of fuel.","translation":"燃料の過剰注入が原因でエンジンが故障した。"},{"sentence":"Superinjection of the drug led to adverse effects.","translation":"その薬物の過量注入は副作用を引き起こした。"}],"collocations":["fuel superinjection (燃料の過剰注入)","drug superinjection (薬物の過量注入)"],"synonyms":["overinjection","excessive injection"],"antonyms":["underinjection","insufficient injection"]},{"part_of_speech":"noun","definition":"(医学)過剰投与","english_definition":"The administration of a dose of medication or other substance that is higher than the recommended or safe amount.","examples":[{"sentence":"Superinjection can lead to toxicity and other health problems.","translation":"過剰投与は毒性やその他の健康問題を引き起こす可能性がある。"}],"collocations":["hormone superinjection (ホルモン過剰投与)","vitamin superinjection (ビタミン過剰投与)"],"synonyms":["overdose","overadministration"],"antonyms":["underdose","underadministration"]}],"etymology":{"value":"\"super-\" (over, above) + \"injection\" (the act of injecting).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsuːpərɪnˈdʒekʃən/","syllables":"su-per-in-jec-tion"},"inflection":{"noun_plural":"superinjections"},"usage_notes":{"explanation":"\"Superinjection\" refers to the act of injecting too much of a substance, whether it's fuel in an engine or a medication in a medical context. It generally carries a negative connotation due to the potential for adverse effects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The superinjection was helpful for the patient.","correct":"✓ The injection was helpful for the patient. / ✓ The correct dosage was helpful for the patient.","note":"Superinjection is generally harmful, so it's unlikely to be described as helpful. Use \"injection\" or specify the correct dosage instead."}],"priority":"★★☆"},"related_words":{"derivatives":["superinject (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Superinjection\" is a technical term primarily used in engineering and medicine to describe the act of injecting an excessive amount of a substance. It's not a common word in everyday conversation and is more likely to be encountered in specialized contexts. The prefix \"super-\" indicates \"over\" or \"excessive,\" and \"injection\" refers to the act of introducing a substance into something. Therefore, the word literally means \"over-injection.\" Understanding the context is crucial for interpreting its meaning accurately."},"example_sentences":[{"sentence":"The mechanic suspected fuel superinjection as the cause of the engine trouble.","translation":"整備士はエンジン故障の原因として燃料の過剰注入を疑った。","type":"noun","meaning_category":"過剰注入"},{"sentence":"Superinjection of insulin can lead to hypoglycemia.","translation":"インスリンの過剰投与は低血糖を引き起こす可能性がある。","type":"noun","meaning_category":"過剰投与"}]}