{"word":"wapentake","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) 古代イングランドにおける行政区画の一種。デンマークの影響を受けた地域（主にデーンロウ）で見られ、ノーサンブリアやイースト・アングリアにも存在した。シャイア（州）の下位区分であり、ハイド（土地評価単位）に基づいて組織された。","english_definition":"(historical) A division of some northern English counties, corresponding to the hundred in southern counties. It was a unit of local government in areas of Danelaw influence.","examples":[{"sentence":"The wapentake was an important administrative division in the Danelaw.","translation":"ワーペンテークはデーンロウにおいて重要な行政区分だった。"},{"sentence":"Each wapentake was responsible for raising troops and collecting taxes.","translation":"各ワーペンテークは兵士の徴集と税の徴収を担当していた。"}],"collocations":["wapentake court (ワーペンテーク裁判所)","Danelaw wapentakes (デーンロウのワーペンテーク)"],"synonyms":["hundred (同様の行政区画)"],"antonyms":[]}],"etymology":{"value":"古ノルド語の *vápnatak に由来し、「武器の接触」を意味する。これは、集会で武器を触れて合意や承認を示す儀式に由来すると考えられている。古英語の *wāpentac にも関連する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwæpənteɪk/","syllables":"wa-pen-take"},"inflection":{"noun_plural":"wapentakes"},"usage_notes":{"explanation":"「**wapentake**」は歴史的な用語であり、現代英語ではほとんど使用されません。主に歴史学の研究や、古代イングランドに関する文献で見られます。現代の行政区画とは異なり、ワーペンテークは軍事的な機能も持っていました。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The wapentake is a modern administrative division.","correct":"✓ The wapentake was a historical administrative division.","note":"ワーペンテークは現代の行政区画ではありません。"},{"incorrect":"✗ Wapentake only existed in southern England.","correct":"✓ Wapentakes existed primarily in northern and eastern England, influenced by the Danelaw.","note":"ワーペンテークは主にデーンロウの影響を受けた地域に存在しました。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**wapentake**」は、古代イングランドの行政区画を指す専門用語であり、現代英語ではほとんど使われません。この単語は、歴史的な文脈、特にデーンロウ（ヴァイキングの支配地域）に関する文献に登場します。一般の英語学習者には馴染みが薄く、歴史学や古英語に特化した学習者向けの語彙です。使用頻度が非常に低いため、積極的に覚える必要はありませんが、関連する歴史的背景を理解する上で役立つことがあります。"},"example_sentences":[{"sentence":"The Domesday Book recorded the landholdings within each wapentake.","translation":"ドゥームズデイ・ブックは各ワーペンテーク内の土地所有状況を記録した。","type":"noun","meaning_category":"行政区画"},{"sentence":"The wapentake court was responsible for resolving local disputes.","translation":"ワーペンテーク裁判所は地域紛争の解決を担当していた。","type":"noun","meaning_category":"行政区画"}]}