{"word":"self-poisoner","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A person who deliberately poisons themselves.","english_definition":"A person who intentionally ingests or uses a toxic substance to harm or kill themselves.","examples":[{"sentence":"The hospital staff worked tirelessly to save the self-poisoner's life.","translation":"病院のスタッフは、自殺を図った人を救うために懸命に働いた。"},{"sentence":"Support groups can provide assistance to self-poisoners and their families.","translation":"支援団体は、自殺を図った人とその家族に支援を提供することができる。"}],"collocations":["attempted self-poisoning","treat a self-poisoner","counsel a self-poisoner"],"synonyms":["suicidal person","one who attempts suicide by poisoning"],"antonyms":[],"notes":"This term is often used in medical or clinical contexts. It is important to use this term with sensitivity."}],"etymology":{"value":"Derived from 'self' + 'poison' + '-er' (agent noun suffix).","priority":"Low"},"pronunciation":{"ipa":"/ˌselfˈpɔɪzənər/","syllables":"self-poi-son-er"},"inflection":{"noun_plural":"self-poisoners"},"usage_notes":{"explanation":"The term 'self-poisoner' is a descriptive term, often used in medical or clinical settings to refer to someone who has attempted suicide by poisoning. It is important to use this term with sensitivity and awareness of the individual's mental health state.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a self-poison.","correct":"✓ He is a self-poisoner.","note":"'Self-poison' is not a common noun. Use 'self-poisoner' to refer to a person."}],"priority":"Low"},"related_words":{"derivatives":["self-poisoning (noun): The act of poisoning oneself.","poison (noun/verb): A substance that causes illness or death when ingested, inhaled, or absorbed; to administer poison to.","suicide (noun): The act of intentionally taking one's own life.","attempted suicide (noun): An unsuccessful suicide attempt."],"related_terms":["suicidal ideation","mental health","crisis intervention"],"priority":"Medium"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Rare","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'self-poisoner' is a relatively straightforward compound noun. It is most likely to be encountered in medical, psychological, or forensic contexts. The term is descriptive and its meaning can be readily understood from its component parts. However, due to the sensitive nature of the subject matter, it is important to use this term with care and consideration."},"example_sentences":[{"sentence":"The paramedics rushed to the scene to assist the self-poisoner.","translation":"救急隊員は、自殺を図った人を支援するために現場に急行した。","type":"general","meaning_category":"General Use"},{"sentence":"The psychiatrist specialized in treating self-poisoners with complex mental health issues.","translation":"精神科医は、複雑な精神衛生上の問題を抱える自殺を図った人の治療を専門としていた。","type":"medical","meaning_category":"Medical/Clinical"},{"sentence":"The study examined the prevalence of self-poisoning among young adults.","translation":"この研究では、若い成人における自殺企図の有病率を調査した。","type":"research","meaning_category":"Research"}]}