{"word":"fading-eyed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"目がぼやけている、視力が衰えている","english_definition":"Having eyes with diminishing or weakened vision; characterized by a loss of clarity or sharpness in sight.","examples":[{"sentence":"The old man was fading-eyed, struggling to read the small print.","translation":"その老人は目がぼやけていて、小さな文字を読むのに苦労していた。"},{"sentence":"She felt fading-eyed after staring at the computer screen for hours.","translation":"彼女は何時間もコンピュータの画面を見つめた後、目がぼやけてきた。"}],"collocations":["fading-eyed old man","fading-eyed gaze","fading-eyed vision"],"synonyms":["weak-eyed","dim-sighted","bleary-eyed","failing-sighted"],"antonyms":["sharp-eyed","clear-sighted","keen-eyed"]}],"etymology":{"value":"The term 'fading-eyed' is a compound adjective formed by combining the present participle of the verb 'fade' (fading) with the noun 'eyed'. It describes the characteristic of having eyes that are experiencing a decline in visual acuity or clarity.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈfeɪdɪŋˌaɪd/","syllables":"fay-ding-eyed"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns. Comparative and superlative forms are possible, such as 'more fading-eyed' and 'most fading-eyed', but these are less common."},"usage_notes":{"explanation":"'Fading-eyed' is a descriptive adjective used to depict a state of declining vision. It suggests a gradual loss of visual acuity, often associated with aging, fatigue, or prolonged strain on the eyes. The term is relatively uncommon in modern usage, with alternative expressions like 'weak-eyed' or 'dim-sighted' being more prevalent.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is fading eye.","correct":"✓ He is fading-eyed.","note":"'Fading-eyed' is a compound adjective and should be used as such."},{"incorrect":"✗ The fading-eyed person.","correct":"✓ The fading-eyed old man.","note":"It is often used to describe elderly people, so adding 'old' can provide a better context."}],"priority":"☆☆☆"},"related_words":{"derivatives":["fading (adjective, noun)","eyed (adjective)"],"phrasal_verbs":[],"related_terms":["weak-eyed","dim-sighted","bleary-eyed","failing vision","visual impairment"]},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'fading-eyed' is a relatively uncommon and descriptive adjective, typically used in literature or detailed descriptions to convey the idea of declining vision. It is not part of everyday vocabulary and may require a higher level of English proficiency to understand and use appropriately."},"example_sentences":[{"sentence":"The fading-eyed librarian squinted at the book's title.","translation":"目がぼやけている図書館員は、本のタイトルをしかめっ面で見た。","type":"adjective","meaning_category":"descriptive"},{"sentence":"Years of reading in poor light had left her fading-eyed.","translation":"長年の薄暗い場所での読書が、彼女の視力を衰えさせた。","type":"adjective","meaning_category":"descriptive"}]}