{"word":"monomode","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単一モードの、シングルモードの（光ファイバーなど）","english_definition":"Relating to or being an optical fiber or other waveguide that allows only one mode of propagation.","examples":[{"sentence":"Monomode fiber is used for long-distance communication.","translation":"シングルモードファイバーは長距離通信に使用されます。"},{"sentence":"The monomode laser provides a highly focused beam.","translation":"シングルモードレーザーは高度に集束されたビームを提供します。"}],"collocations":["monomode fiber","monomode laser","monomode waveguide"],"synonyms":["single-mode"],"antonyms":["multimode"]}],"etymology":{"value":"From 'mono-' (single) + 'mode' (a particular way of doing something; in physics, a specific pattern of electromagnetic radiation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɒnoʊˈmoʊd/","syllables":"mo-no-mode"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"\"Monomode\" specifically refers to systems, particularly in optics and telecommunications, where only one mode of light or signal propagates. This is in contrast to \"multimode\" systems, where multiple modes can propagate. Monomode fibers are preferred for long-distance communication due to lower signal degradation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The monomode cable was more cheaper than the multimode one.","correct":"✓ The monomode cable was cheaper than the multimode one.","note":"Avoid using 'more' with comparative adjectives ending in '-er'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["multimode","optical fiber","waveguide","mode","propagation"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency; technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Monomode\" is a technical term primarily used in the context of optical fibers and waveguides. It describes a system that supports only one mode of electromagnetic radiation. Understanding this term requires a basic knowledge of physics and telecommunications. It's typically encountered in specialized texts or discussions related to these fields."},"example_sentences":[{"sentence":"The **monomode** fiber optic cable provides a higher bandwidth capacity.","translation":"そのシングルモード光ファイバーケーブルは、より高い帯域幅容量を提供します。","type":"adjective","meaning_category":"single-mode"},{"sentence":"Using a **monomode** laser improves the precision of the measurement.","translation":"シングルモードレーザーを使用すると、測定の精度が向上します。","type":"adjective","meaning_category":"single-mode"}]}