{"word":"transfusion-incompatible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"輸血不適合の","english_definition":"(of blood or a blood product) not suitable for transfusion into a particular person, usually because of an incompatibility in blood type or antibodies.","examples":[{"sentence":"The patient experienced a severe transfusion reaction due to transfusion-incompatible blood.","translation":"患者は輸血不適合の血液による重度の輸血反応を起こした。"},{"sentence":"It is crucial to ensure that the donor blood is not transfusion-incompatible with the recipient.","translation":"ドナー血液がレシピエントと輸血不適合でないことを確認することが重要である。"}],"collocations":["transfusion-incompatible blood","transfusion-incompatible donor","transfusion-incompatible reaction"],"synonyms":["incompatible blood","mismatched blood"],"antonyms":["transfusion-compatible"],"related_terms":["blood type","antibody","transfusion reaction","agglutination"],"notes":"This term is primarily used in medical contexts.","medical_context":true}],"etymology":{"value":"Formed by combining \"transfusion\" (the process of transferring blood or blood products into a person's circulation intravenously), \"in-\" (a prefix meaning \"not\"), and \"compatible\" (able to exist or occur together without problems).","priority":"☆☆☆"},"pronunciation":{"ipa":"/trænsˈfjuːʒən ɪnkəmˈpætɪbəl/","syllables":"trans-fu-sion in-com-pat-i-ble"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term 'transfusion-incompatible' is used in medical settings to describe blood or blood products that cannot be safely transfused into a patient. This incompatibility is usually due to differences in blood types (e.g., ABO or Rh) or the presence of antibodies in the recipient's blood that would react with the donor's blood cells, leading to a potentially life-threatening transfusion reaction. Proper blood typing and crossmatching procedures are essential to prevent transfusion-incompatible events.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The blood was transfusion incompatible.","correct":"✓ The blood was transfusion-incompatible.","note":"The hyphen is important to correctly convey the meaning of the compound adjective."}],"priority":"☆☆☆"},"level_frequency":{"frequency_corpus":"Low frequency - primarily found in medical literature and discussions.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"transfusion-incompatible\" is a specialized medical term. It means that blood or blood products from a donor cannot be safely given to a recipient because there is a mismatch, usually due to blood type differences or antibodies. This can cause a serious reaction. This term is mostly used by doctors and medical professionals."},"example_sentences":[{"sentence":"The laboratory identified the donor unit as transfusion-incompatible with the patient's blood sample.","translation":"検査室は、ドナーユニットが患者の血液サンプルと輸血不適合であると特定した。","type":"adjective","meaning_category":"Medical Incompatibility"},{"sentence":"Administering transfusion-incompatible blood can lead to severe hemolytic reactions.","translation":"輸血不適合の血液を投与すると、重度の溶血反応を引き起こす可能性がある。","type":"adjective","meaning_category":"Medical Risk"}]}