{"word":"postscholastic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"大学卒業後の、卒業後の研究に関する","english_definition":"Relating to studies or activities undertaken after graduation, especially from a university.","examples":[{"sentence":"She pursued postscholastic research in astrophysics.","translation":"彼女は天体物理学の大学院後の研究を追求した。"},{"sentence":"Many postscholastic opportunities exist for recent graduates.","translation":"最近の卒業生には多くの大学院後の機会が存在する。"}],"collocations":["postscholastic research","postscholastic education","postscholastic opportunities"],"synonyms":["postgraduate","doctoral","post-doctoral"],"antonyms":["undergraduate","prescholastic"]}],"etymology":{"value":"'Post-' (after) + 'scholastic' (relating to schools or education).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpoʊstskəˈlæstɪk/","syllables":"post-scho-las-tic"},"inflection":{"notes":"Comparative and superlative forms are not commonly used for this adjective."},"usage_notes":{"explanation":"'Postscholastic' is typically used in academic or professional contexts to describe activities, studies, or opportunities that occur after the completion of a formal education, particularly at the university level. It is often used interchangeably with 'postgraduate' or 'postdoctoral,' although it can have a slightly broader scope.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a postscholastic degree in engineering.","correct":"✓ He has a postgraduate degree in engineering.","note":"'Postgraduate' is more commonly used to describe a degree obtained after graduation."}],"priority":"★☆☆"},"related_words":{"derivatives":["postscholastically"],"related_terms":["postgraduate","postdoctoral","scholastic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'postscholastic' is a relatively uncommon adjective used to describe activities or studies undertaken after completing formal education, particularly at the university level. It is most frequently encountered in academic or research contexts. Understanding the prefix 'post-' (meaning 'after') and the root word 'scholastic' (relating to education) can help in deciphering its meaning. It is often used synonymously with 'postgraduate' or 'postdoctoral', although it may have a slightly broader application."},"example_sentences":[{"sentence":"The university offers several postscholastic programs for professional development.","translation":"その大学は専門能力開発のためのいくつかの大学院後のプログラムを提供している。","type":"general","meaning_category":"education"},{"sentence":"Her postscholastic work focused on renewable energy sources.","translation":"彼女の大学院後の研究は再生可能エネルギー源に焦点を当てていた。","type":"research","meaning_category":"research"}]}