{"word":"swaggie","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(オーストラリア英語、古語) スワッグ（寝具や所持品を丸めたもの）を背負って徒歩で職を探す人、放浪者、流れ者","english_definition":"(Australian English, historical) A person who travels on foot carrying a swag (a bundle of belongings), typically looking for work; a tramp or vagrant.","examples":[{"sentence":"In the old days, swaggies were a common sight on Australian roads.","translation":"昔は、スワッギーはオーストラリアの道路でよく見かける光景だった。"},{"sentence":"The swaggie carried his meager possessions in a rolled-up blanket.","translation":"そのスワッギーはわずかな所持品を丸めた毛布に入れて運んでいた。"}],"collocations":["carry a swag","old swaggie","travelling swaggie"],"synonyms":["tramp","vagabond","hobo","drifter","wanderer","backpacker (modern usage, but different connotation)"],"antonyms":["settled worker","landowner"],"notes":"The term 'swaggie' is strongly associated with the historical period of rural Australia, particularly during times of economic hardship. While backpacking exists today, it is generally for leisure rather than necessity."}],"etymology":{"value":"Derived from 'swag', referring to the bundle of personal belongings carried by the person. The term emerged in the late 19th century in Australia.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈswɒɡi/","syllables":"swag-gie"},"inflection":{"noun_plural":"swaggies"},"usage_notes":{"explanation":"'Swaggie' is a term with strong historical and cultural connotations in Australia. It evokes images of itinerant workers and travelers during the late 19th and early 20th centuries, often associated with the outback and rural areas. The term is less commonly used today, as the lifestyle it describes is less prevalent, but it remains a significant part of Australian folklore and history.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a swaggie with a car.","correct":"✓ He was a swaggie carrying a swag.","note":"Swaggies are defined by traveling on foot and carrying their belongings. A person with a car would not be considered a swaggie."}],"priority":"★☆☆"},"related_words":{"derivatives":["swag (noun: bundle of belongings)"],"idioms_phrases":[],"related_terms":["Waltzing Matilda (famous Australian folk song about a swaggie)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Not applicable (historical/cultural term)","frequency_google_ngram":"Low frequency (historical context)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'swaggie' refers to a historical figure in Australia: a person who traveled the countryside on foot, carrying their belongings in a swag (a rolled-up bundle), typically looking for work. This term is not commonly used in modern English but is important for understanding Australian history and culture, particularly the era of rural exploration and economic hardship. Understanding the context of Australian history is essential to interpreting the meaning of 'swaggie'."},"example_sentences":[{"sentence":"The old photograph showed a group of swaggies camped by a billabong.","translation":"その古い写真には、ビラボン（水たまり）のそばでキャンプをしているスワッギーのグループが写っていた。","type":"noun","meaning_category":"Historical figure"},{"sentence":"Many Australian folk songs tell stories of the swaggie's life on the road.","translation":"多くのオーストラリアの民謡は、スワッギーの道中の生活について語っている。","type":"noun","meaning_category":"Cultural icon"}]}