{"word":"letter-learned","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"字面だけの知識しかない、表面的な知識しかない、実質的な理解を伴わない","english_definition":"knowing things only from books or formal study, without practical experience or real understanding; superficially learned.","examples":[{"sentence":"He was a letter-learned scholar, but lacked common sense.","translation":"彼は字面だけの知識しかない学者で、常識に欠けていた。"},{"sentence":"The theory sounded good, but it was too letter-learned to be applied in practice.","translation":"その理論は聞こえは良かったが、字面だけの知識に過ぎず、実際に応用することはできなかった。"}],"collocations":["letter-learned scholar","letter-learned knowledge","letter-learned approach","letter-learned arguments"],"synonyms":["bookish","pedantic","academic","theoretical","superficial","formalistic"],"antonyms":["experienced","practical","pragmatic","worldly","intuitive","knowledgeable"],"notes":"Often used in a derogatory or critical way, implying that the person lacks genuine understanding or practical skills."}],"etymology":{"value":"Formed from 'letter' (referring to written text) and 'learned' (having acquired knowledge through study). The term suggests that the knowledge is derived solely from written sources, without practical application or deeper understanding.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛtərˌlɜːrnd/","syllables":"let-ter-learn-ed"},"inflection":{"notes":"This is an adjective and does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"'Letter-learned' is used to describe someone whose knowledge is based primarily on books and formal education, rather than practical experience or genuine understanding. It often carries a negative connotation, implying that the person's knowledge is superficial and lacks real-world application. The term suggests a disconnect between theoretical knowledge and practical skills, indicating that the person may be overly reliant on bookish learning and lack common sense or the ability to think critically.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a letter-learned in medicine.","correct":"✓ He is letter-learned in medicine. / ✓ He has letter-learned knowledge of medicine.","note":"The term 'letter-learned' directly modifies a noun or is used with 'knowledge.' It doesn't require an article ('a') before it when describing someone's state. You can also say 'He has letter-learned knowledge of medicine.'"},{"incorrect":"✗ She is a very letter-learned person, which is good.","correct":"✓ She is a very bookish person, which is good.","note":"While 'letter-learned' isn't inherently negative, it often implies a lack of practical understanding. If you want to emphasize the positive aspects of someone's knowledge, 'bookish' or 'well-read' might be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["bookish","pedantic","academic","theoretical","superficial","formalistic","well-read","erudite"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Letter-learned' is a somewhat uncommon and sophisticated term used to describe someone whose knowledge is derived primarily from books and formal study, often implying a lack of practical experience or genuine understanding. It's more likely to be encountered in academic or literary contexts. The term suggests a contrast between theoretical knowledge and practical skills, and it can carry a slightly negative connotation, suggesting that the person's knowledge is superficial or impractical."},"example_sentences":[{"sentence":"The professor was letter-learned in ancient history, but struggled to relate it to modern events.","translation":"その教授は古代史においては字面だけの知識しかなかったが、それを現代の出来事と関連付けるのに苦労した。","type":"general","meaning_category":"字面だけの知識しかない"},{"sentence":"His letter-learned arguments failed to convince the jury, who valued practical evidence over theoretical claims.","translation":"彼の字面だけの知識による主張は、理論的な主張よりも実用的な証拠を重視する陪審員を納得させることができなかった。","type":"general","meaning_category":"表面的な知識しかない"},{"sentence":"She criticized the new policy as being too letter-learned and detached from the realities of everyday life.","translation":"彼女は新しい政策を、字面だけの知識に偏り、日常生活の現実からかけ離れていると批判した。","type":"general","meaning_category":"実質的な理解を伴わない"}]}