{"word":"cobwebbing","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に医学) 脳のMRI画像などで見られる、くも膜下出血後のくも膜の肥厚や癒着","english_definition":"(primarily in medicine) Thickening or adhesions of the arachnoid membrane following subarachnoid hemorrhage, as seen on MRI scans of the brain.","examples":[{"sentence":"The MRI showed evidence of cobwebbing in the basal cisterns, indicative of a previous subarachnoid hemorrhage.","translation":"MRI検査では、基底槽にくも膜下出血の既往を示すくも膜の肥厚が見られた。"}],"collocations":["arachnoid cobwebbing","basal cistern cobwebbing"],"synonyms":["arachnoid adhesions","leptomeningeal thickening"],"antonyms":[]},{"part_of_speech":"verb","definition":"(主に園芸) 植物がクモの巣状の糸を張ること","english_definition":"(primarily in horticulture) The act of a plant producing spiderweb-like threads, often as a defense mechanism or for support.","examples":[{"sentence":"The Sempervivum plant was cobwebbing extensively to protect itself from the harsh sunlight.","translation":"そのセンペルビウムは、強い日差しから身を守るために、広範囲にクモの巣状の糸を張っていた。"}],"collocations":["Sempervivum cobwebbing"],"synonyms":["spider webbing"],"antonyms":[]}],"etymology":{"value":"Derived from 'cobweb,' referring to the spiderweb-like appearance. The '-ing' suffix indicates a process or state.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒbˌwɛbɪŋ/","syllables":"cob-web-bing"},"inflection":{"verb_forms":{"present_simple":["cobwebs"],"past_simple":"cobwebbed","past_participle":"cobwebbed","present_participle":"cobwebbing"},"noun_plural":"cobwebbings"},"usage_notes":{"explanation":"'Cobwebbing' is a relatively uncommon term with specialized uses. In medicine, it refers to a specific finding on brain imaging related to previous subarachnoid hemorrhage. In horticulture, it describes a plant's production of spiderweb-like threads. Context is crucial to understanding the intended meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The old house was cobwebbing with dust.","correct":"✓ The old house was covered in cobwebs.","note":"'Cobwebbing' as a verb is not typically used to describe the accumulation of cobwebs. Instead, use 'covered in cobwebs' or 'full of cobwebs.'"},{"incorrect":"✗ The doctor said I had cobwebbing in my lungs.","correct":"✓ The doctor said I had cobwebbing in my brain.","note":"In a medical context, 'cobwebbing' typically refers to findings in the brain, not the lungs."}],"priority":"★★☆"},"related_words":{"derivatives":["cobweb (noun)","cobwebby (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cobwebbing' is a specialized term primarily used in medical and horticultural contexts. Its meaning is highly dependent on the field in which it is used. In medicine, it describes a specific finding on brain imaging related to subarachnoid hemorrhage. In horticulture, it refers to a plant's production of spiderweb-like threads. Due to its specialized nature, it is not a common term in general English usage."},"example_sentences":[{"sentence":"The neurosurgeon noted the presence of significant cobwebbing during the follow-up MRI.","translation":"脳神経外科医は、フォローアップMRI検査で顕著なクモ膜の肥厚の存在を確認した。","type":"noun","meaning_category":"Medical"},{"sentence":"The Sempervivum arachnoideum is known for its dense cobwebbing.","translation":"センペルビウム・アラクノイデウムは、密なクモの巣状の糸を張ることで知られている。","type":"verb","meaning_category":"Horticultural"}]}