{"word":"Turners","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(複数形) 旋盤工、旋盤職人 (Turner の複数形)","english_definition":"(plural) People who use a lathe to shape wood or metal; plural of Turner.","examples":[{"sentence":"The Turners were known for their craftsmanship.","translation":"その旋盤職人たちは、その職人技で知られていた。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(複数形) ターナー家の人々、ターナーという名前の人々 (Turner の複数形)","english_definition":"(plural) People with the last name Turner.","examples":[{"sentence":"The Turners will be hosting the party.","translation":"ターナー家がパーティーを主催する予定です。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(複数形) (歴史的な) ドイツの体操協会 (Turner の複数形)","english_definition":"(plural) (historical) Members of a German gymnastic association.","examples":[{"sentence":"The Turners were known for their athleticism.","translation":"そのドイツの体操協会は、その運動能力で知られていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the surname Turner, which originates from the occupation of a person who worked with a lathe, shaping wood or metal.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɜːrnərz/","syllables":"Tur-ners"},"inflection":{"noun_plural":"Turners"},"usage_notes":{"explanation":"'Turners' is primarily the plural form of the noun 'Turner'. It can refer to multiple people with the surname Turner, multiple individuals who are turners (i.e., lathe operators), or members of a historical German gymnastic association. The specific meaning depends on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is one of the Turner.","correct":"✓ He is one of the Turners.","note":"When referring to multiple people with the surname Turner, use the plural form."}],"priority":"★★☆"},"related_words":{"derivatives":["Turner (singular form)","turning (related to the process of using a lathe)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily as a surname.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Turners' is the plural form of 'Turner', which can refer to people with the surname Turner, or to people who operate a lathe (a machine for shaping wood or metal). Context is crucial to understanding the intended meaning. It can also refer to members of a historical German gymnastic association. Due to its multiple potential meanings and relatively low frequency, it is considered a B2 level word.","note":"This word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The Turners are a well-known family in this town.","translation":"ターナー家はこの町ではよく知られた家族です。","type":"noun","meaning_category":"ターナー家の人々"},{"sentence":"The Turners were skilled craftsmen, creating intricate designs.","translation":"その旋盤職人たちは熟練した職人で、複雑なデザインを作り出していた。","type":"noun","meaning_category":"旋盤職人"},{"sentence":"The Turners participated in the national gymnastics competition.","translation":"そのドイツの体操協会は、全国体操競技会に参加した。","type":"noun","meaning_category":"ドイツの体操協会"}]}