{"word":"filiality","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"孝行、親孝行","english_definition":"the condition or quality of being a son or daughter; the duties and affections of a son or daughter. More commonly, dutiful affection and respect toward parents.","examples":[{"sentence":"Filiality is highly valued in many Asian cultures.","translation":"孝行は多くのアジア文化で非常に重視されています。"},{"sentence":"He demonstrated his filiality by caring for his aging parents.","translation":"彼は年老いた両親の世話をすることで、孝行を示しました。"},{"sentence":"The concept of filiality extends beyond simple obedience.","translation":"孝行の概念は、単なる服従を超えて広がっています。"}],"collocations":["demonstrate filiality","practice filiality","value filiality","Confucian filiality"],"synonyms":["dutifulness","respect","deference","obedience","reverence"],"antonyms":["disobedience","disrespect","impiety"]}],"etymology":{"value":"Late Middle English: from Old French *filiacion*, from Late Latin *filiatio(n-)*, from Latin *filius* 'son'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɪliˈælɪti/","syllables":"fi-li-al-i-ty"},"inflection":{"noun_plural":"filiations"},"usage_notes":{"explanation":"\"Filiality\" refers to the virtue of showing respect, love, and obedience to one's parents and ancestors. It is a concept deeply rooted in Confucianism and is a central value in many East Asian cultures. The term implies not only obedience but also taking care of one's parents in their old age and honoring their memory after they have passed away. It is a more formal and less common word than \"parental love\" or \"respect for parents.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great filial.","correct":"✓ He showed great filiality.","note":"\"Filial\" is an adjective (e.g., filial duty), while \"filiality\" is the noun (the quality of being filial)."},{"incorrect":"✗ Filiality is only important for children.","correct":"✓ Filiality is important throughout one's life.","note":"Filiality extends beyond childhood and involves lifelong respect and care for parents. "}],"priority":"★★☆"},"related_words":{"derivatives":["filial (adjective: of or due from a son or daughter)"],"phrases":["filial piety (孝行)","filial duty (孝行の義務)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'filiality' is a formal term that refers to the virtue of respect, love, and obedience towards one's parents and ancestors. It is a concept strongly associated with Confucianism and East Asian cultures. The word is not commonly used in everyday conversation but is more often found in academic or philosophical discussions about family values and ethics. It implies a deep sense of duty and responsibility towards one's parents, extending beyond mere obedience to include care and honor throughout their lives."},"example_sentences":[{"sentence":"The film explored the theme of filiality within a modern family context.","translation":"その映画は、現代の家族の文脈における孝行というテーマを探求しました。","type":"noun","meaning_category":"孝行"},{"sentence":"Confucianism places great emphasis on filiality as a foundation for social harmony.","translation":"儒教は、社会の調和の基礎として孝行を非常に重視しています。","type":"noun","meaning_category":"孝行"},{"sentence":"Her actions were motivated by a strong sense of filiality and responsibility.","translation":"彼女の行動は、強い孝行心と責任感によって動機づけられていました。","type":"noun","meaning_category":"孝行"}]}