{"word":"plagihedral","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(結晶が)斜面を持つ、斜面で区切られた","english_definition":"(of a crystal) having faces inclined to each other; bounded by oblique faces.","examples":[{"sentence":"Plagihedral crystals are common in certain minerals.","translation":"斜面を持つ結晶は、特定の鉱物によく見られる。"},{"sentence":"The plagihedral form of the crystal was easily identifiable under the microscope.","translation":"その結晶の斜面形は、顕微鏡下で容易に識別できた。"}],"collocations":["plagihedral crystal","plagihedral form","plagihedral habit"],"synonyms":["oblique-faced","inclined-faced"],"antonyms":["euhedral","idioblastic"]}],"etymology":{"value":"Derived from the Greek words 'plagios' (oblique, sideways) and 'hedra' (face, base).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpleɪdʒiˈhiːdrəl/","syllables":"pla-gi-he-dral"},"inflection":{"notes":"Does not inflect (only used as an adjective)."},"usage_notes":{"explanation":"The term 'plagihedral' is primarily used in mineralogy and crystallography to describe crystals that have faces inclined to each other, resulting in a non-symmetrical or oblique shape. It is often contrasted with 'euhedral' crystals, which have well-developed, distinct faces.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plagihedral crystal was very symmetry.","correct":"✓ The plagihedral crystal lacked symmetry.","note":"Plagihedral crystals, by definition, lack symmetry due to their inclined faces."}],"priority":"★☆☆"},"related_words":{"derivatives":["plagihedrism (noun): the condition of being plagihedral"],"related_terms":["crystal habit","mineralogy","crystallography","euhedral","anhedral"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. Specialized term used in mineralogy and crystallography.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Plagihedral' is a technical term used in the fields of mineralogy and crystallography. It describes crystals that have faces inclined to each other, meaning the faces are not at right angles, resulting in an oblique or asymmetrical shape. This term is typically encountered in scientific literature or specialized discussions related to crystal structures and mineral identification."},"example_sentences":[{"sentence":"The quartz sample exhibited a distinct plagihedral structure.","translation":"その石英サンプルは明確な斜面構造を示した。","type":"descriptive","meaning_category":"crystal structure"},{"sentence":"Microscopic analysis revealed the plagihedral nature of the mineral grains.","translation":"顕微鏡分析により、その鉱物粒子の斜面性が明らかになった。","type":"scientific","meaning_category":"mineralogy"}]}