{"word":"Polycythaemic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"多血症の","english_definition":"Relating to or affected by polycythaemia (also spelled polycythemia), a condition marked by an abnormally increased concentration of hemoglobin in the blood, through either reduction of plasma volume or increase in red cell numbers.","examples":[{"sentence":"The patient was diagnosed with a polycythaemic condition.","translation":"その患者は多血症の状態と診断された。"},{"sentence":"Polycythaemic symptoms can include fatigue and dizziness.","translation":"多血症の症状には、疲労やめまいが含まれることがある。"}],"collocations":["polycythaemic patient","polycythaemic condition","polycythaemic symptoms"],"synonyms":["polycythemic"],"antonyms":["anaemic"]}],"etymology":{"value":"From the term 'polycythaemia' (or 'polycythemia') + '-ic'. 'Polycythaemia' is derived from Greek roots: 'poly-' (many), 'cyto-' (cell), and '-haemia' (blood condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒlɪsaɪˈθiːmɪk/","syllables":"pol-y-cy-thae-mic"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Polycythaemic' is an adjective used to describe something related to or affected by polycythaemia. It is often used in medical contexts when discussing patients, conditions, or symptoms associated with this blood disorder.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is polycythemia.","correct":"✓ He is polycythaemic. / ✓ He has polycythaemia.","note":"'Polycythaemia' is the noun (the condition), while 'polycythaemic' is the adjective (describing something related to the condition)."},{"incorrect":"✗ The polycythaemic is treated with medication.","correct":"✓ The polycythaemic patient is treated with medication.","note":"'Polycythaemic' is an adjective and needs to be followed by a noun (e.g., patient, condition)."}],"priority":"★★☆"},"related_words":{"derivatives":["polycythaemia (noun)","polycythemia (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polycythaemic' is a technical term used in medicine. It describes something related to polycythaemia, a condition where there is an abnormally high concentration of red blood cells in the blood. This term is primarily encountered in medical literature or when discussing specific medical diagnoses. Understanding this term requires a background in medical terminology."},"example_sentences":[{"sentence":"The polycythaemic changes in the blood were evident in the lab results.","translation":"血液中の多血症性の変化は、検査結果で明らかだった。","type":"adjective","meaning_category":"medical condition"},{"sentence":"The doctor suspected a polycythaemic disorder based on the patient's elevated hemoglobin levels.","translation":"医師は、患者のヘモグロビン値の上昇に基づいて、多血症性疾患を疑った。","type":"adjective","meaning_category":"medical condition"}]}