{"word":"guncotton","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"綿火薬、ニトロセルロース","english_definition":"a powerful explosive made by nitrating cotton.","examples":[{"sentence":"Guncotton is more powerful than gunpowder.","translation":"綿火薬は黒色火薬よりも強力である。"},{"sentence":"Guncotton was used in early explosives and propellants.","translation":"綿火薬は初期の爆薬や推進薬に使用された。"}],"collocations":["nitrated cotton","nitrocellulose explosive"],"synonyms":["nitrocellulose","pyroxylin"],"antonyms":[]}],"etymology":{"value":"Derived from \"gun\" (referring to its use as a propellant in firearms) and \"cotton\" (referring to the raw material used in its production).","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡʌnˌkɒtən","syllables":"gun-cot-ton"},"inflection":{"noun_plural":"guncottons (rarely used)"},"usage_notes":{"explanation":"Guncotton is a highly flammable and explosive substance. It is a type of nitrocellulose, produced by treating cotton with nitric acid and sulfuric acid. It was discovered in the mid-19th century and was initially used as a substitute for gunpowder. However, due to its instability and tendency to explode spontaneously, it was later replaced by more stable explosives. Today, guncotton is mainly used in the production of smokeless powder and other specialized explosives.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Guncotton is a type of gun powder.","correct":"✓ Guncotton is more powerful than gun powder.","note":"Guncotton is a different explosive from gunpowder, being more powerful. It is made from nitrated cotton, not a mixture of sulfur, charcoal, and potassium nitrate like gunpowder."}],"priority":"★☆☆"},"related_words":{"derivatives":["nitrocellulose","explosive","nitrate","cotton"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Guncotton is a specialized term referring to a specific type of explosive material, nitrocellulose. Understanding its composition, production, and historical usage requires a technical or historical context. It is not commonly encountered in everyday language, making it more suitable for advanced learners or those with a specific interest in chemistry, explosives, or military history."},"example_sentences":[{"sentence":"The chemist carefully prepared the guncotton in the laboratory.","translation":"化学者は実験室で慎重に綿火薬を準備した。","type":"noun","meaning_category":"explosive"},{"sentence":"Guncotton was a key ingredient in the development of smokeless powder.","translation":"綿火薬は無煙火薬の開発における重要な成分であった。","type":"noun","meaning_category":"explosive"}]}