{"word":"squaretail","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(魚類)ある種の魚の尾びれが四角いこと、またはそのような魚","english_definition":"A fish with a square-shaped tail. Often used to refer to specific species.","examples":[{"sentence":"The squaretail is a popular game fish in the region.","translation":"その地域では、四角い尾の魚は人気のゲームフィッシュです。"},{"sentence":"I caught a beautiful squaretail while fishing yesterday.","translation":"昨日釣りをしていて、美しい四角い尾の魚を捕まえました。"}],"collocations":["catch a squaretail","squaretail fishing"],"synonyms":["square-tailed fish"],"antonyms":[]},{"part_of_speech":"adjective","definition":"(魚類)尾びれが四角い","english_definition":"Having a square-shaped tail (referring to fish).","examples":[{"sentence":"The squaretail trout is known for its distinctive tail shape.","translation":"四角い尾のマスは、特徴的な尾の形で知られています。"}],"collocations":["squaretail trout"],"synonyms":["square-tailed"],"antonyms":[]}],"etymology":{"value":"Combination of \"square\" (referring to the shape) and \"tail\" (referring to the caudal fin of a fish).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskwɛərteɪl/","syllables":"square-tail"},"inflection":{"noun_plural":"squaretails"},"usage_notes":{"explanation":"The term \"squaretail\" is generally used to describe fish species that have a distinctly square-shaped caudal fin (tail fin). It is often used as a common name for certain types of trout or other fish species with this characteristic. The specific species referred to as \"squaretail\" can vary depending on the region.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a fish with a square tail. It was a squaretail's.","correct":"✓ I saw a fish with a square tail. It was a squaretail.","note":"The possessive form is not typically used. Use 'squaretail' as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"squaretail\" is a compound word describing a fish with a square-shaped tail. It's most often used by people who fish or study fish. If you're reading about fishing or fish biology, you might come across this word. It can be used as a noun to refer to a specific type of fish, or as an adjective to describe a fish with a square tail."},"example_sentences":[{"sentence":"The brook trout, also known as the eastern squaretail, is a popular sport fish.","translation":"ブルックトラウトは、イースタン・スクエアテールとしても知られており、人気のスポーツフィッシュです。","type":"noun","meaning_category":"fish species"},{"sentence":"The biologist identified the fish as a squaretail based on its caudal fin shape.","translation":"生物学者は、その魚の尾びれの形から、それをスクエアテールだと特定しました。","type":"noun","meaning_category":"fish species"},{"sentence":"The squaretail's habitat is threatened by pollution.","translation":"スクエアテールの生息地は汚染によって脅かされています。","type":"noun","meaning_category":"fish species"}]}