{"word":"dukkha","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(仏教) 苦、苦しみ、不満足、不安、欠陥、不完全さ。生存そのものが持つ根本的な苦悩。","english_definition":"(Buddhism) suffering, unsatisfactoriness, anxiety, stress. The fundamental unsatisfactoriness and painfulness of mundane existence.","examples":[{"sentence":"Dukkha is one of the three marks of existence in Buddhism.","translation":"苦は仏教における三相の一つです。"},{"sentence":"The Buddha taught that understanding dukkha is the first step towards enlightenment.","translation":"ブッダは、苦を理解することが悟りへの第一歩であると教えました。"},{"sentence":"Many people seek to escape dukkha through meditation and mindfulness.","translation":"多くの人々が瞑想やマインドフルネスを通じて苦から逃れようとします。"}],"collocations":["the nature of dukkha (苦の本質)","the end of dukkha (苦の終焉)","escape from dukkha (苦からの脱却)","the cessation of dukkha (苦の止滅)","causes of dukkha (苦の原因)"],"synonyms":["suffering","unsatisfactoriness","pain","misery","distress","anguish","sorrow","woe","affliction","unhappiness","anxiety","stress","discomfort","unease","disquiet","discontent","malaise"],"antonyms":["sukha (幸福、楽)","happiness","joy","contentment","pleasure","well-being","comfort","ease","satisfaction"],"notes":"Dukkha is a key concept in Buddhism, encompassing not only physical and emotional pain but also the subtle unsatisfactoriness inherent in all conditioned things. It is often translated as 'suffering,' but this is an incomplete translation as it includes a broader range of experiences."}],"etymology":{"value":"From Pali dukkha (दुक्ख) and Sanskrit duḥkha (दुःख), meaning 'suffering', 'pain', 'sorrow', 'unease'. The word is composed of 'dus' (difficult, bad) and 'kha' (empty, hollow, space). Thus, dukkha literally means 'difficult space' or 'empty space', suggesting a state of unease or discomfort.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʊkə/","syllables":"duk-kha"},"inflection":{"noun_plural":"dukkhas (though often used as an uncountable noun)"},"usage_notes":{"explanation":"'Dukkha' is a central concept in Buddhism, referring to the inherent unsatisfactoriness and suffering present in all forms of existence. It is not simply about physical or emotional pain, but also the subtle sense of unease and impermanence that pervades life. Understanding dukkha is considered the first noble truth and a crucial step towards liberation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Dukkha is just about feeling sad.","correct":"✓ Dukkha includes sadness, but it's also about the general unsatisfactoriness of life.","note":"Dukkha is more than just sadness; it's a broader concept encompassing all forms of suffering and unsatisfactoriness."},{"incorrect":"✗ I am trying to avoid dukkha by seeking pleasure.","correct":"✓ Buddhists believe that seeking pleasure is a temporary solution and doesn't eliminate the root causes of dukkha.","note":"Buddhism teaches that true liberation from dukkha comes from understanding its causes and practicing detachment, not simply seeking pleasure."}],"priority":"★★☆"},"related_words":{"derivatives":["dukkha-nirodha (苦滅) - the cessation of suffering","dukkha-samudaya (苦集) - the arising of suffering","dukkha-nirodha-gamini-patipada (苦滅道) - the path leading to the cessation of suffering"],"related_concepts":["The Four Noble Truths (四聖諦)","The Three Marks of Existence (三相)","Nirvana (涅槃)","Karma (業)","Rebirth (輪廻)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency (primarily used in religious or philosophical contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dukkha' is a complex philosophical term from Buddhism that describes the inherent suffering, unsatisfactoriness, and impermanence of existence. It goes beyond simple pain or sadness to encompass a deep sense of unease and the recognition that all conditioned things are ultimately unsatisfactory. Understanding 'dukkha' requires familiarity with Buddhist philosophy and concepts. It's not a word used in everyday conversation but is essential for discussing Buddhist teachings."},"example_sentences":[{"sentence":"The first noble truth acknowledges the existence of dukkha in all aspects of life.","translation":"第一の聖諦は、人生のあらゆる側面に苦が存在することを認めています。","type":"noun","meaning_category":"suffering"},{"sentence":"Through meditation, one can gain insight into the nature of dukkha and its causes.","translation":"瞑想を通して、人は苦の本質とその原因についての洞察を得ることができます。","type":"noun","meaning_category":"suffering"},{"sentence":"The path to enlightenment involves understanding and overcoming dukkha.","translation":"悟りへの道は、苦を理解し、克服することを含みます。","type":"noun","meaning_category":"suffering"}]}