{"word":"Treatyist","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"(Historical, Ireland) A supporter of the Anglo-Irish Treaty of 1921, which established the Irish Free State.","english_definition":"(Historical, Ireland) A supporter of the Anglo-Irish Treaty of 1921, which established the Irish Free State.","examples":[{"sentence":"During the Irish Civil War, the country was divided between Treatyists and Anti-Treatyists.","translation":"アイルランド内戦中、国は条約支持派と条約反対派に分裂した。"},{"sentence":"The Treatyists believed that the Anglo-Irish Treaty was the best path to eventual Irish independence.","translation":"条約支持派は、アングロ・アイリッシュ条約が最終的なアイルランド独立への最良の道であると信じていた。"}],"collocations":["Treatyist government","Pro-Treaty","Support the Treaty"],"synonyms":["Pro-Treaty","Free Stater"],"antonyms":["Anti-Treatyist"],"notes":"The term is specific to the historical context of the Irish Civil War."}],"etymology":{"value":"Derived from 'Treaty' (referring to the Anglo-Irish Treaty) + '-ist' (a suffix denoting a supporter or adherent).","priority":"Medium"},"pronunciation":{"ipa":"/ˈtriːtɪɪst/","syllables":"Treat-y-ist"},"inflection":{"noun_plural":"Treatyists"},"usage_notes":{"explanation":"'Treatyist' is a historical term used to describe those who supported the Anglo-Irish Treaty of 1921. They believed it was a pragmatic step towards greater Irish autonomy, even though it didn't immediately grant full independence. They formed the government of the Irish Free State.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"He is a treatyist in international law.","correct":"He is a proponent of treaties in international law.","note":"'Treatyist' specifically refers to the Irish historical context. Use 'proponent of treaties' or similar for general support of treaties."}],"priority":"Medium"},"related_words":{"derivatives":["Treaty (noun)","-ist (suffix)"],"related_terms":["Anglo-Irish Treaty","Irish Free State","Anti-Treatyist","Irish Civil War"]},"level_frequency":{"level":"C2","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'Treatyist' is a specialized historical term related to the Anglo-Irish Treaty and the subsequent Irish Civil War. Understanding requires knowledge of Irish history and the political divisions of the time. It's not a commonly used word outside of this specific context."},"example_sentences":[{"sentence":"The Treatyist faction ultimately prevailed in the Irish Civil War.","translation":"条約支持派は最終的にアイルランド内戦で勝利した。","type":"historical context","meaning_category":"supporter of the treaty"},{"sentence":"Many Treatyist leaders, like Michael Collins, were assassinated during the conflict.","translation":"マイケル・コリンズのような多くの条約支持派の指導者が紛争中に暗殺された。","type":"historical context","meaning_category":"supporter of the treaty"}]}