{"word":"Nonpurchasability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"購入不能性、非買性","english_definition":"The state or quality of being unable to be purchased.","examples":[{"sentence":"The nonpurchasability of the artifact made it a unique treasure.","translation":"その工芸品の購入不能性により、それは唯一無二の宝となった。"},{"sentence":"Due to legal restrictions, the land had nonpurchasability status.","translation":"法的制限により、その土地は購入不能な状態にあった。"}],"collocations":["nonpurchasability status","inherent nonpurchasability"],"synonyms":["unobtainability","unavailability"],"antonyms":["purchasability","availability"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'purchasability,' which itself is derived from 'purchasable' (able to be purchased) with the suffix '-ability' (denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˌpɜːrtʃəsəˈbɪləti/","syllables":"non-pur-chas-a-bil-i-ty"},"inflection":{"noun_plural":"Nonpurchasabilities"},"usage_notes":{"explanation":"'Nonpurchasability' refers to the condition where something cannot be bought, often due to legal, ethical, or practical reasons. It is a relatively uncommon word, typically used in formal or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonpurchasability is because of the price.","correct":"✓ The nonpurchasability is due to legal restrictions.","note":"'Nonpurchasability' implies an inherent or fundamental reason preventing purchase, not just high price. High price would simply mean it is unaffordable, not nonpurchasable."}],"priority":"★★☆"},"related_words":{"derivatives":["nonpurchasable (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nonpurchasability' is a complex word indicating that something cannot be bought. It is used in formal contexts, often legal or technical, to describe items or properties that are inherently restricted from sale. This word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The museum emphasized the nonpurchasability of the historical documents to ensure their preservation.","translation":"博物館は、歴史的文書の保存を確実にするために、それらが購入不能であることを強調した。","type":"noun","meaning_category":"購入不能性"},{"sentence":"The island's nonpurchasability was a key factor in maintaining its pristine environment.","translation":"その島の購入不能性は、その自然環境を維持するための重要な要素であった。","type":"noun","meaning_category":"購入不能性"}]}