{"word":"dysaesthesia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"異常感覚、感覚異常","english_definition":"An abnormal sensation; an unpleasant, abnormal sense of touch. It is a type of neuropathic pain.","examples":[{"sentence":"The patient reported experiencing dysaesthesia in their feet.","translation":"患者は足に異常感覚を経験していると報告した。"},{"sentence":"Dysaesthesia can be a symptom of various neurological disorders.","translation":"異常感覚は、さまざまな神経疾患の症状となりうる。"}],"collocations":["burning dysaesthesia","cutaneous dysaesthesia"],"synonyms":["paresthesia","allodynia","hyperalgesia"],"antonyms":[]}],"etymology":{"value":"From Greek 'dys-' (bad, difficult) + 'aesthesis' (sensation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪsɪsˈθiːziə/","syllables":"dys-aes-the-si-a"},"inflection":{"noun_plural":"dysaesthesias"},"usage_notes":{"explanation":"Dysaesthesia is a medical term used to describe an abnormal and unpleasant sensation. It is often associated with nerve damage or dysfunction. The sensation can vary, including burning, prickling, itching, or electric shock-like feelings. It is important to note that dysaesthesia is a subjective experience reported by the patient.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has dysesthesia in his brain.","correct":"✓ He has dysaesthesia in his feet.","note":"Dysaesthesia typically occurs in the extremities or skin, not directly in the brain itself. It is the result of nerve damage sending incorrect signals."},{"incorrect":"✗ Dysesthesia is a type of allergy.","correct":"✓ Dysaesthesia is a type of neuropathic pain.","note":"Dysaesthesia is related to nerve function and pain, not allergic reactions."}],"priority":"★★☆"},"related_words":{"derivatives":["dysaesthetic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dysaesthesia' is a highly specialized medical term referring to an abnormal, unpleasant sensation resulting from nerve damage or dysfunction. Understanding this term requires a strong grasp of medical terminology and neuropathology. It is not commonly used outside of medical contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"Peripheral neuropathy can cause dysaesthesia in the hands and feet.","translation":"末梢神経障害は手足に異常感覚を引き起こす可能性がある。","type":"general","meaning_category":"medical condition"},{"sentence":"The medication is intended to alleviate the symptoms of dysaesthesia.","translation":"その薬は異常感覚の症状を緩和することを目的としている。","type":"treatment","meaning_category":"medical treatment"},{"sentence":"Patients with fibromyalgia often experience widespread dysaesthesia.","translation":"線維筋痛症の患者は、しばしば広範囲の異常感覚を経験する。","type":"symptom","meaning_category":"symptom"}]}