{"word":"etymologists","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"語源学者（複数形）","english_definition":"plural of etymologist: a person who studies the origin and history of words.","examples":[{"sentence":"Etymologists trace the roots of words to ancient languages.","translation":"語源学者たちは、言葉のルーツを古代の言語に遡って調べています。"},{"sentence":"Some etymologists specialize in the origins of place names.","translation":"地名の起源を専門とする語源学者もいます。"}],"collocations":["leading etymologists","renowned etymologists","historical etymologists","comparative etymologists"],"synonyms":["linguists","philologists","lexicographers","word historians"],"antonyms":[]}],"etymology":{"value":"from etymologist, which is derived from etymology (the study of the origin of words) + -ist (a suffix denoting a person who practices or is concerned with something). Etymology comes from Greek etymon (true sense of a word) + -logia (study of).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛtɪˈmɒlədʒɪsts/","syllables":"et-y-mol-o-gists"},"inflection":{"noun_plural":"etymologists"},"usage_notes":{"explanation":"'Etymologists' refers specifically to multiple individuals who are experts in the field of etymology. They use historical and comparative linguistics to understand how words have changed in form and meaning over time.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is one of the famous etymologist.","correct":"✓ He is one of the famous etymologists.","note":"When using 'one of the,' the following noun should be plural."},{"incorrect":"✗ The etymologists is studying the word's origin.","correct":"✓ The etymologists are studying the word's origin.","note":"'Etymologists' is plural, so the verb should also be plural ('are' instead of 'is')."}],"priority":"★★☆"},"related_words":{"derivatives":["etymology","etymological","etymologize"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized vocabulary.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Etymologists' is a specialized term referring to experts in the study of word origins. Understanding this word requires familiarity with academic vocabulary related to linguistics and history. It is not commonly used in everyday conversation but is essential for discussing language evolution and historical linguistics."},"example_sentences":[{"sentence":"The conference brought together leading etymologists from around the world.","translation":"その会議には、世界中から一流の語源学者が集まりました。","type":"general","meaning_category":"group of experts"},{"sentence":"Etymologists often consult ancient texts to trace the development of words.","translation":"語源学者たちは、言葉の発展を辿るために古代の文献を参考にすることがよくあります。","type":"research","meaning_category":"research methods"},{"sentence":"A team of etymologists collaborated on the new dictionary.","translation":"語源学者たちのチームが、新しい辞書の作成で協力しました。","type":"collaboration","meaning_category":"teamwork"}]}