{"word":"Cartan","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"(数学) カルタン","english_definition":"A surname, particularly associated with several prominent French mathematicians.","examples":[{"sentence":"Élie Cartan made significant contributions to differential geometry and Lie group theory.","translation":"エリー・カルタンは、微分幾何学とリー群論に重要な貢献をした。"},{"sentence":"Henri Cartan was a leading figure in the development of complex analysis and algebraic topology.","translation":"アンリ・カルタンは、複素解析と代数的トポロジーの発展における指導的な人物だった。"}],"collocations":["Cartan matrix","Cartan subalgebra","Cartan decomposition","Cartan connection"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"A French surname, likely of occupational or locational origin.","priority":"N/A"},"pronunciation":{"ipa":"/kaʁ.tɑ̃/ (French)","syllables":"Car-tan"},"inflection":{},"usage_notes":{"explanation":"'Cartan' is primarily known as the surname of several influential French mathematicians, most notably Élie Cartan (1869-1951) and his son Henri Cartan (1904-2008). Their work has had a profound impact on various areas of mathematics. When used in mathematical contexts, 'Cartan' often refers to concepts or structures associated with their work.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Cartanian (adjective)"],"related_terms":["Lie group","Differential geometry","Algebraic topology","Complex analysis"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"Advanced","text":"The term 'Cartan' is highly specialized and primarily encountered in advanced mathematical contexts, particularly in discussions of Lie groups, differential geometry, and algebraic topology. Understanding the term requires familiarity with these areas of mathematics."},"example_sentences":[{"sentence":"The Cartan matrix encodes information about the root system of a Lie algebra.","translation":"カルタン行列は、リー代数のルート系に関する情報をエンコードする。","type":"mathematical term","meaning_category":"mathematics"},{"sentence":"Henri Cartan's work on sheaf theory revolutionized algebraic topology.","translation":"アンリ・カルタンの層理論に関する研究は、代数的トポロジーに革命をもたらした。","type":"person's name","meaning_category":"mathematics"}]}