{"word":"Socraticism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ソクラテス主義：ソクラテスの哲学と方法論、特に批判的思考、自己吟味、倫理的探求を重視する思想","english_definition":"The philosophical system and method of Socrates, emphasizing critical thinking, self-examination, and ethical inquiry.","examples":[{"sentence":"Socraticism emphasizes the importance of questioning assumptions.","translation":"ソクラテス主義は、前提を疑うことの重要性を強調する。"},{"sentence":"Through Socraticism, individuals can arrive at a deeper understanding of themselves and the world.","translation":"ソクラテス主義を通じて、個人は自身と世界に対するより深い理解に到達できる。"}],"collocations":["Socratic method (ソクラテス式問答法)","Socratic irony (ソクラテスの皮肉)","ethical Socraticism (倫理的なソクラテス主義)"],"synonyms":["Socratic philosophy","Socratic thought","elenchus"],"antonyms":["Sophism"],"related_terms":["Socrates","Plato","elenchus","dialectic","virtue","ethics","epistemology"]},{"part_of_speech":"noun","definition":"ソクラテス主義者：ソクラテスの教えに従う人、またはソクラテス的な方法で思考する人","english_definition":"An adherent of the teachings of Socrates; one who thinks in a Socratic manner.","examples":[{"sentence":"He is a Socraticism in his approach to problem-solving.","translation":"彼は問題解決への取り組みにおいてソクラテス主義者だ。"},{"sentence":"The professor encouraged his students to be Socraticisms in their pursuit of knowledge.","translation":"教授は学生たちに、知識の探求においてソクラテス主義者になるよう促した。"}],"collocations":["a true Socraticism (真のソクラテス主義者)"],"synonyms":["Socratic","Socratic philosopher"],"antonyms":[]}],"etymology":{"value":"Derived from \"Socrates\" (古希腊语: Σωκράτης, Sōkrátēs), the name of the ancient Greek philosopher, with the suffix \"-ism\" indicating a doctrine, principle, or system of belief.","priority":"★★★"},"pronunciation":{"ipa":"/səˈkrætɪˌsɪzəm/","syllables":"So-crat-i-cism"},"inflection":{"noun_plural":"Socraticisms (rarely used)"},"usage_notes":{"explanation":"\"Socraticism\" refers both to the philosophical system attributed to Socrates and to the practice of Socratic methods, such as questioning and self-reflection. It is often contrasted with Sophism, which Socrates opposed. The term can also describe a person who adheres to Socratic principles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced Socratic.","correct":"✓ He practiced Socraticism.","note":"\"Socratic\" is an adjective; the noun form referring to the philosophical system is \"Socraticism\"."},{"incorrect":"✗ Socraticism is a person.","correct":"✓ A Socraticism is a person who follows Socratic principles.","note":"\"Socraticism\" primarily refers to the philosophical system; a person who adheres to it is a \"Socraticism\" (though less common) or a \"Socratic philosopher\"."}],"priority":"★★☆"},"related_words":{"derivatives":["Socratic (adjective)","Socratically (adverb)"],"related_concepts":["dialectic","elenchus","maieutics","virtue ethics","epistemology","rationalism"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Socraticism\" is a term used in philosophy to describe the ideas and methods of Socrates. It involves critical thinking, questioning assumptions, and seeking ethical understanding. It can also refer to someone who follows Socrates' teachings. This word is mainly used in academic or philosophical discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The core of Socraticism lies in the pursuit of truth through dialogue.","translation":"ソクラテス主義の中核は、対話を通じた真実の探求にある。","type":"noun","meaning_category":"philosophical system"},{"sentence":"His teaching style was rooted in Socraticism, encouraging students to question everything.","translation":"彼の教育スタイルはソクラテス主義に根ざしており、学生にすべてのことを疑うよう促した。","type":"noun","meaning_category":"philosophical system"},{"sentence":"She considered herself a Socraticism, always challenging conventional wisdom.","translation":"彼女は自身をソクラテス主義者だと考え、常に従来の知恵に挑戦していた。","type":"noun","meaning_category":"adherent of Socrates' teachings"}]}