{"word":"Reifying","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"具体化する、実体化する、具象化する","english_definition":"To make (something abstract) more concrete or real.","examples":[{"sentence":"The software allows reifying abstract concepts into tangible objects.","translation":"そのソフトウェアは、抽象的な概念を具体的なオブジェクトに具体化することを可能にする。"},{"sentence":"The artist aimed at reifying emotions through sculpture.","translation":"その芸術家は彫刻を通して感情を具象化することを目指した。"}],"collocations":["reify a concept","reify an idea","reify a belief","reify an abstraction"],"synonyms":["concretize","materialize","embody","personify","objectify"],"antonyms":["abstract","conceptualize","idealize"]}],"etymology":{"value":"From Latin *rēs* (thing) + *-fy* (make).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈriːɪfaɪɪŋ/","syllables":"Ree-i-fy-ing"},"inflection":{"verb_forms":{"present_simple":["reify","reifies"],"past_simple":"reified","past_participle":"reified","present_participle":"reifying"}},"usage_notes":{"explanation":"'Reifying' is the present participle of the verb 'reify'. It is often used in philosophical, sociological, and computer science contexts to describe the process of treating an abstract concept as if it were a real, concrete thing. This can sometimes lead to misunderstandings or oversimplifications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is reifying the problem.","correct":"✓ He is reifying the abstract concept of justice.","note":"It's important to specify what is being reified. The direct object should be an abstract concept, idea, or belief, not a concrete object or problem."}],"priority":"★★☆"},"related_words":{"derivatives":["reification (noun): 具体化、実体化、具象化","reifier (noun): 具体化するもの、実体化するもの"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reifying' means to treat something abstract as if it were real or concrete. It's a more advanced word often used in academic or technical writing. For example, you might say someone is 'reifying' an idea if they are treating it as a solid, unchanging fact, even though it's just a concept. It's important to use this word carefully, as it implies a specific kind of transformation of an abstract idea into something more tangible or real in one's thinking or actions."},"example_sentences":[{"sentence":"The artist is reifying the feeling of loneliness through the stark imagery in the painting.","translation":"その画家は絵画の中の殺風景なイメージを通して孤独感を具象化している。","type":"verb","meaning_category":"具象化する"},{"sentence":"By focusing solely on test scores, the education system risks reifying academic achievement.","translation":"テストの点数だけに焦点を当てることで、教育システムは学業成績を実体化するリスクがある。","type":"verb","meaning_category":"実体化する"},{"sentence":"The process of reifying data can lead to a better understanding of complex systems.","translation":"データを具体化するプロセスは、複雑なシステムをより良く理解することにつながる可能性がある。","type":"verb","meaning_category":"具体化する"}]}