{"word":"uxorious","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"尻に敷かれている、恐妻家の","english_definition":"excessively fond of or submissive to one's wife.","examples":[{"sentence":"He was so uxorious that he let his wife make all the decisions.","translation":"彼はひどい恐妻家だったので、妻にすべての決定を任せていた。"},{"sentence":"Some might see him as uxorious, but he simply values his wife's opinion.","translation":"彼を恐妻家と見る人もいるかもしれないが、彼は単に妻の意見を尊重しているだけだ。"}],"collocations":["uxorious husband","uxorious man","excessively uxorious","become uxorious"],"synonyms":["submissive","henpecked","wife-ridden","dominated"],"antonyms":["domineering","assertive","independent"]}],"etymology":{"value":"From Latin 'uxorius' (excessively devoted to one's wife), from 'uxor' (wife).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌkˈsɔːriəs/","syllables":"uk-so-ri-ous"},"inflection":{"notes":"Adjective; comparative: more uxorious, superlative: most uxorious"},"usage_notes":{"explanation":"'Uxorious' describes a man who is excessively devoted to his wife, often to the point of being controlled or dominated by her. It often carries a negative connotation, suggesting a lack of independence or strength of character. The term is not commonly used in everyday conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is uxorious.","correct":"✓ He is uxorious.","note":"'Uxorious' specifically describes a man's behavior towards his wife, not the other way around."},{"incorrect":"✗ He is uxorious because he loves his wife.","correct":"✓ He is uxorious because he is excessively submissive to his wife.","note":"While love may be a factor, 'uxorious' implies excessive submissiveness, not just affection."}],"priority":"★★☆"},"related_words":{"derivatives":["uxoriously (adverb)","uxoriousness (noun)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'uxorious' is a relatively rare and formal term used to describe a man who is excessively devoted to his wife, often to the point of being submissive or allowing her to control him. It's not a common word in everyday conversation and is more likely to be found in literature or formal writing. Understanding the word requires a good vocabulary and an understanding of the nuances of marital relationships and power dynamics."},"example_sentences":[{"sentence":"The king was known for being uxorious, often yielding to his queen's demands.","translation":"その王は恐妻家として知られており、しばしば王妃の要求に屈していた。","type":"adjective","meaning_category":"尻に敷かれている"},{"sentence":"His uxorious behavior surprised many, as he had always seemed so independent before his marriage.","translation":"彼の恐妻家ぶりは、結婚前はとても自立しているように見えていたため、多くの人を驚かせた。","type":"adjective","meaning_category":"恐妻家の"},{"sentence":"Some historians argue that his uxorious nature influenced his political decisions.","translation":"一部の歴史家は、彼の恐妻家的な性格が彼の政治的決定に影響を与えたと主張している。","type":"adjective","meaning_category":"尻に敷かれている"}]}