{"word":"Regovernment","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The act or process of governing again, or forming a new government.","english_definition":"The act or process of governing again, often implying a change or restructuring of the existing government.","examples":[{"sentence":"The country is undergoing a regovernment after the revolution.","translation":"革命後、その国は再統治の過程を経ている。"},{"sentence":"The regovernment of the territory required international cooperation.","translation":"その地域の再統治には国際協力が必要だった。"}],"collocations":["political regovernment","economic regovernment","social regovernment"],"synonyms":["reorganization","restructuring","reformation","reestablishment"],"antonyms":["disgovernment","anarchy"]}],"etymology":{"value":"Formed by combining the prefix 're-' (again) with the noun 'government'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːˈɡʌvərnmənt/","syllables":"Ree-guv-ern-ment"},"inflection":{"noun_plural":"Regovernments"},"usage_notes":{"explanation":"'Regovernment' is a relatively rare word, typically used in political or historical contexts to describe the process of re-establishing or reforming a government, often after a period of instability or significant change. It implies a deliberate and structured effort to regain or redefine governance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The regovernment was quick and easy.","correct":"✓ The regovernance was quick and easy.","note":"'Regovernment' refers to the process, not the state of being governed. The word 're-governance' might be more appropriate in some contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["re-govern (verb)","government (noun)","governance (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Regovernment' is a complex term used in political science and history to describe the process of re-establishing or significantly reforming a government. It suggests a planned and structured effort to regain control or redefine governance after a period of instability or major change. This term is not commonly used in everyday language and is more frequently found in academic or specialized texts."},"example_sentences":[{"sentence":"The United Nations played a key role in the regovernment of the war-torn nation.","translation":"国連は、戦争で荒廃した国の再統治において重要な役割を果たした。","type":"noun","meaning_category":"Process of governing again"},{"sentence":"The new constitution was a crucial step in the country's regovernment efforts.","translation":"新憲法は、その国の再統治の取り組みにおける重要な一歩だった。","type":"noun","meaning_category":"Process of governing again"}]}