{"word":"pseudosatirically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"見せかけの風刺的に、擬似的に風刺を込めて","english_definition":"In a manner that is seemingly satirical but not genuinely so; in a way that imitates or pretends to be satirical.","examples":[{"sentence":"He delivered the speech pseudosatirically, affecting a tone of mockery but lacking real bite.","translation":"彼はそのスピーチを擬似的に風刺を込めて行い、嘲りの口調を装ったが、本当の痛烈さはなかった。"},{"sentence":"The article was written pseudosatirically, making it difficult to discern the author's true intentions.","translation":"その記事は見せかけの風刺を込めて書かれており、著者の真意を理解するのが難しかった。"}],"collocations":["deliver a speech pseudosatirically","write an article pseudosatirically"],"synonyms":["mock-satirically","quasi-satirically","ostensibly satirically"],"antonyms":["genuinely satirically","truly satirically","sincerely satirically"]}],"etymology":{"value":"The word is formed by combining \"pseudo-\" (meaning false or imitation) with \"satirically\" (in a satirical manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊsəˈtɪrɪkli/","syllables":"pseu-do-sa-tir-i-cal-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Pseudosatirically\" is used to describe something that appears to be satirical but is not genuinely so. It often implies a lack of depth, sincerity, or effectiveness in the satire. The term is relatively rare and is typically used in academic or critical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted pseudosatirically, but everyone knew he was serious.","correct":"✓ He acted satirically, but everyone knew he was serious.","note":"If the person was serious, then the action wasn't satirical at all, pseudo or otherwise. The correct word to use depends on whether the intent was satirical or not."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudosatire (noun)","pseudosatirical (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pseudosatirically\" is a rare and complex adverb. It describes something done in a way that appears to be satirical but lacks genuine satirical intent or effect. It's used in advanced academic or critical writing to denote a superficial or insincere attempt at satire. Understanding this word requires a strong grasp of both \"pseudo-\" (false) and \"satirically\" (in a satirical manner)."},"example_sentences":[{"sentence":"The comedian's routine was delivered pseudosatirically, with a veneer of irony that failed to mask the underlying prejudice.","translation":"そのコメディアンのルーティンは見せかけの風刺を込めて行われ、皮肉のベールで覆われていたが、根底にある偏見を隠すことはできなかった。","type":"adverb","meaning_category":"in a seemingly satirical manner"},{"sentence":"The author wrote the piece pseudosatirically, leaving readers unsure whether to laugh or be offended.","translation":"著者はその作品を擬似的に風刺を込めて書き、読者は笑うべきか、気分を害すべきか分からなくなった。","type":"adverb","meaning_category":"in a way that imitates satire"}]}