{"word":"Pertness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"生意気さ、厚かましさ、無遠慮さ、軽率さ","english_definition":"The quality of being pert; impudence; sauciness; liveliness.","examples":[{"sentence":"Her pertness often got her into trouble.","translation":"彼女の生意気さはしばしば彼女をトラブルに巻き込んだ。"},{"sentence":"He was taken aback by the pertness of her reply.","translation":"彼は彼女の返答の厚かましさに驚いた。"}],"collocations":["show pertness","display pertness","respond with pertness"],"synonyms":["impudence","sauce","cheekiness","impertinence","boldness","effrontery","flippancy"],"antonyms":["respectfulness","deference","submissiveness","modesty"]}],"etymology":{"value":"Derived from 'pert', meaning lively, jaunty, or impudent, with the suffix '-ness' indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɜːrtnəs/","syllables":"pert-ness"},"inflection":{"noun_plural":"pertnesses"},"usage_notes":{"explanation":"'Pertness' describes a specific kind of boldness or impudence that is often characterized by a lively or spirited manner. It can be seen as either charming or offensive, depending on the context and the recipient's tolerance. It often implies a lack of appropriate respect or seriousness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed pertness to his friend.","correct":"✓ He showed pertness toward his boss.","note":"Pertness is usually directed towards someone in authority or someone who deserves respect. Using it with a friend might be unusual unless the context implies a power dynamic or a breach of etiquette."},{"incorrect":"✗ The pertness of the situation was obvious.","correct":"✓ The seriousness of the situation was obvious.","note":"'Pertness' describes a behavior or quality of a person, not a situation. A situation might be serious, urgent, or critical, but not 'pert'."}],"priority":"★★☆"},"related_words":{"derivatives":["pert (adjective)","pertly (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pertness' is a relatively uncommon word that describes the quality of being 'pert,' which means displaying a lively, bold, or impudent manner. It is often used to describe someone who is being cheeky or disrespectful, especially to someone in authority. Understanding this word requires a good vocabulary and a grasp of nuanced social interactions."},"example_sentences":[{"sentence":"The student's pertness in questioning the teacher's authority surprised the class.","translation":"先生の権威に疑問を呈する生徒の生意気さはクラスを驚かせた。","type":"example","meaning_category":"impudence"},{"sentence":"Despite her young age, she answered with a pertness that showed both intelligence and confidence.","translation":"彼女は若いのにもかかわらず、知性と自信を示す生意気さで答えた。","type":"example","meaning_category":"boldness"},{"sentence":"His pertness was often mistaken for arrogance, but it was merely a defense mechanism.","translation":"彼の生意気さはしばしば傲慢と間違われたが、それは単なる防衛機制だった。","type":"example","meaning_category":"cheekiness"}]}