{"word":"refractile","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"屈折性の、光を屈折させる","english_definition":"Capable of refracting light; exhibiting refraction.","examples":[{"sentence":"The refractile index of the glass is high.","translation":"そのガラスの屈折率は高い。"},{"sentence":"Refractile bodies were observed under the microscope.","translation":"顕微鏡下で屈折性の物体が観察された。"}],"collocations":["refractile index","refractile bodies"],"synonyms":["refractive"],"antonyms":["opaque"],"notes":"Often used in scientific or technical contexts, especially in optics and microscopy."}],"etymology":{"value":"From Latin 'refractus', past participle of 'refringere' (to break back, refract), from 're-' (back) + 'frangere' (to break).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈfræktɪl/","syllables":"re-frac-tile"},"inflection":{"notes":"Adjective, so it can be modified by adverbs like 'very' or 'slightly'."},"usage_notes":{"explanation":"'Refractile' is a relatively uncommon word, primarily used in scientific and technical contexts when discussing the properties of materials that bend light. It is closely related to 'refraction' (the bending of light) and 'refractive index' (a measure of how much light bends when passing through a substance).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The refractile of the light was measured.","correct":"✓ The refraction of the light was measured.","note":"'Refractile' is an adjective, so it modifies a noun. 'Refraction' is the noun form referring to the phenomenon itself."}],"priority":"★★☆"},"related_words":{"derivatives":["refract (verb): to deflect from a straight path; to make a ray of light change direction when it enters at an angle","refraction (noun): the fact or phenomenon of light, radio waves, etc., being deflected in passing obliquely through the interface between one medium and another or through a medium of varying density","refractive (adjective): relating to or causing refraction"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily found in scientific texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Refractile' is a technical term used to describe something that has the ability to bend light. It is most commonly found in scientific contexts, such as physics, optics, and microscopy. Understanding this word requires familiarity with basic concepts in physics related to light and its interaction with different materials."},"example_sentences":[{"sentence":"The scientist studied the refractile properties of the new material.","translation":"科学者はその新素材の屈折特性を研究した。","type":"general","meaning_category":"general"},{"sentence":"Certain cellular structures appear refractile under phase contrast microscopy.","translation":"特定の細胞構造は位相差顕微鏡下で屈折性を示す。","type":"scientific","meaning_category":"scientific"}]}