{"word":"un-Latinised","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not having been made Latin in character or form; not conforming to Latin standards or practices.","english_definition":"Not having been made Latin in character or form; not conforming to Latin standards or practices.","examples":[{"sentence":"The un-Latinised regions of the empire retained their local customs.","translation":"帝国のラテン化されていない地域は、地元の習慣を保持していました。"},{"sentence":"His writing style remained un-Latinised, reflecting his preference for vernacular expression.","translation":"彼の文体はラテン化されず、地方の表現を好む彼の好みを反映していました。"}],"collocations":["un-Latinised language","un-Latinised culture","un-Latinised script","un-Latinised region"],"synonyms":["non-Latin","non-Roman","un-Romanized"],"antonyms":["Latinised","Romanized","Latinate"]}],"etymology":{"value":"Formed by adding the prefix \"un-\" (meaning 'not') to the word \"Latinised\" (meaning 'made Latin in character or form').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈlætɪnaɪzd/","syllables":"un-Lat-in-ised"},"inflection":{"notes":"This is an adjective, so it can have comparative and superlative forms, though they are rarely used: more un-Latinised, most un-Latinised."},"usage_notes":{"explanation":"The term \"un-Latinised\" is used to describe something that has not been influenced by Latin culture, language, or customs. It often refers to regions or languages that resisted Romanization or the adoption of Latin characteristics. The term is relatively uncommon and is mostly used in historical or linguistic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unlatinized language was easy to understand.","correct":"✓ The un-Latinised language was difficult to understand.","note":"Un-Latinised languages often retain complex grammatical structures and vocabulary that are unfamiliar to speakers of Latin-derived languages, making them harder to understand."},{"incorrect":"✗ He unlatinised the text.","correct":"✓ He de-Latinised the text.","note":"The verb form would be 'de-Latinise' or 'un-Latinise', not 'unlatinise'."}],"priority":"★★☆"},"related_words":{"derivatives":["Latinise (verb)","Latinisation (noun)","Latin (adjective, noun)"],"phrases":["Romanization","Cultural assimilation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"un-Latinised\" is a relatively uncommon term used in academic or historical contexts. It describes something that has not been influenced or made Latin in character. Understanding the prefix \"un-\" (meaning 'not') and the word \"Latinised\" (meaning 'made Latin') is essential to grasp its meaning. It is often used to describe regions, cultures, or languages that have resisted Roman or Latin influence."},"example_sentences":[{"sentence":"The remote villages remained largely un-Latinised despite Roman rule.","translation":"ローマの支配にもかかわらず、遠隔地の村々はほとんどラテン化されなかった。","type":"adjective","meaning_category":"not made Latin"},{"sentence":"Scholars study the un-Latinised inscriptions to understand the pre-Roman language.","translation":"学者たちはローマ以前の言語を理解するために、ラテン化されていない碑文を研究しています。","type":"adjective","meaning_category":"not conforming to Latin standards"},{"sentence":"The persistence of un-Latinised traditions highlights the diversity within the empire.","translation":"ラテン化されていない伝統の存続は、帝国内の多様性を強調しています。","type":"adjective","meaning_category":"not conforming to Latin practices"}]}