{"word":"Scientistic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"科学主義的な、科学万能主義的な","english_definition":"Characterized by scientism; excessively reliant on or imitative of the methods of the natural sciences.","examples":[{"sentence":"His scientistic approach to philosophy neglected the importance of subjective experience.","translation":"彼の科学主義的な哲学へのアプローチは、主観的な経験の重要性を無視した。"},{"sentence":"The article criticized the scientistic tendency to reduce all knowledge to quantifiable data.","translation":"その記事は、すべての知識を定量化可能なデータに還元しようとする科学万能主義的な傾向を批判した。"}],"collocations":["scientistic approach","scientistic worldview","scientistic bias","scientistic methodology"],"synonyms":["reductionist","positivistic","empiricist (in an extreme sense)"],"antonyms":["humanistic","interpretive","qualitative"]},{"part_of_speech":"adjective","definition":"科学の装いをした、科学を装って誤解を招くような","english_definition":"Presenting something as scientific when it does not meet scientific standards.","examples":[{"sentence":"The advertisement made scientistic claims about the product's effectiveness, but lacked any real evidence.","translation":"その広告は、製品の有効性について科学を装った主張をしたが、実際の証拠は何もなかった。"},{"sentence":"The theory was dismissed as scientistic because it was based on speculation rather than empirical data.","translation":"その理論は、経験的なデータではなく憶測に基づいていたため、科学を装っているとして退けられた。"}],"collocations":["scientistic claims","scientistic arguments","scientistic rhetoric"],"synonyms":["pseudo-scientific","quasi-scientific","unscientific"],"antonyms":["scientific","evidence-based","empirical"]}],"etymology":{"value":"Formed from 'scientism' + '-istic'. 'Scientism' itself is from 'science' + '-ism'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsaɪənˈtɪstɪk/","syllables":"sci-en-tis-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Scientistic' is generally used in a critical way to describe an over-reliance on scientific methods or a misrepresentation of something as scientific. It often implies that important aspects of a subject are being ignored or that scientific authority is being invoked inappropriately. It is important to distinguish 'scientistic' from 'scientific,' which refers to something that is based on or conforms to the principles and methods of science.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The scientific approach was scientistic.","correct":"✓ The scientific approach was rigorous. / ✓ The approach was scientistic because it ignored qualitative data.","note":"'Scientific' describes a valid application of science, while 'scientistic' implies an inappropriate or excessive application. Be sure to use the correct term based on whether the approach is valid or flawed."},{"incorrect":"✗ He had a scientistic understanding of art.","correct":"✓ He had a scientistic approach to art. / ✓ He had a simplistic understanding of art.","note":"'Scientistic' usually modifies an approach, method, or worldview, not a general understanding. If the understanding is overly simplistic, 'simplistic' may be a better choice."}],"priority":"★★☆"},"related_words":{"derivatives":["scientism","science","scientific","scientifically"],"phrases":["scientistic reductionism","scientistic positivism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Scientistic' is a relatively uncommon word used to describe something that inappropriately applies or mimics the methods of science. It often carries a negative connotation, suggesting that the approach is overly simplistic or ignores important aspects of the subject matter. It is typically used in academic or philosophical discussions."},"example_sentences":[{"sentence":"The author criticized the **scientistic** tendency to reduce complex social phenomena to simple equations.","translation":"著者（作者）は、複雑な社会現象を単純な方程式に還元しようとする科学万能主義的な傾向を批判した。","type":"adjective","meaning_category":"科学主義的な"},{"sentence":"The company's marketing campaign made **scientistic** claims about the health benefits of their product, despite lacking any scientific evidence.","translation":"その会社のマーケティングキャンペーンは、科学的根拠がないにもかかわらず、製品の健康上の利点について科学を装った主張をした。","type":"adjective","meaning_category":"科学を装った"}]}