{"word":"incommiscibility","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"非混和性、混ざり合わない性質","english_definition":"The property of two or more liquids being unable to mix to form a homogeneous mixture.","examples":[{"sentence":"The incommiscibility of oil and water is a well-known phenomenon.","translation":"油と水の非混和性はよく知られた現象です。"},{"sentence":"Due to their incommiscibility, these two solvents form separate layers.","translation":"それらの非混和性のため、これら二つの溶媒は分離した層を形成します。"}],"collocations":["exhibit incommiscibility","demonstrate incommiscibility"],"synonyms":["immiscibility","nonmiscibility","unmixability"],"antonyms":["miscibility","mixability"]}],"etymology":{"value":"Formed from \"in-\" (prefix meaning 'not'), \"miscibility\" (the ability to mix), and \"-ity\" (suffix denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌkɒmɪsɪˈbɪləti/","syllables":"in-com-is-ci-bil-i-ty"},"inflection":{"noun_plural":"incommiscibilities"},"usage_notes":{"explanation":"\"Incommiscibility\" is a scientific term, primarily used in chemistry and physics, to describe the inability of two or more liquids to form a homogeneous mixture when combined. Unlike \"miscible\" liquids, which blend completely, \"incommiscible\" liquids remain separate, often forming distinct layers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The incommiscibility is when two liquids mix.","correct":"✓ Incommiscibility is when two liquids do not mix.","note":"Incommiscibility means the inability to mix, not the ability to mix."}],"priority":"★★☆"},"related_words":{"derivatives":["incommiscible (adjective)"],"related_terms":["miscibility","immiscible","miscible"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Incommiscibility' is a technical term used in chemistry and physics to describe the property of liquids that do not mix to form a homogeneous solution. It is the opposite of 'miscibility'. This term is typically encountered in advanced scientific contexts."},"example_sentences":[{"sentence":"The experiment highlighted the incommiscibility of the two organic compounds.","translation":"その実験は、二つの有機化合物の非混和性を強調しました。","type":"scientific context","meaning_category":"general"},{"sentence":"Understanding the incommiscibility of certain fluids is crucial in industrial separation processes.","translation":"特定の流体の非混和性を理解することは、工業的な分離プロセスにおいて重要です。","type":"industrial application","meaning_category":"application"}]}