{"word":"inspectability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"検査可能性、点検可能性、調査可能性","english_definition":"The quality or state of being inspectable; the ability to be inspected, examined, or investigated.","examples":[{"sentence":"The inspectability of the software code is crucial for identifying potential vulnerabilities.","translation":"ソフトウェアコードの検査可能性は、潜在的な脆弱性を特定するために重要です。"},{"sentence":"The design of the machine allows for easy inspectability of all critical components.","translation":"その機械の設計は、すべての重要なコンポーネントの容易な点検可能性を可能にします。"},{"sentence":"Improved inspectability of the financial records will help prevent fraud.","translation":"財務記録の検査可能性を向上させることは、不正行為の防止に役立ちます。"}],"collocations":["improve inspectability (検査可能性を向上させる)","ensure inspectability (検査可能性を確保する)","high inspectability (高い検査可能性)","poor inspectability (低い検査可能性)"],"synonyms":["examinability","testability","scrutinizability","verifiability","auditability"],"antonyms":["uninspectability","unexaminability"]}],"etymology":{"value":"Derived from 'inspect' (to look at carefully) + '-able' (capable of being) + '-ity' (state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌspɛktəˈbɪləti/","syllables":"in-spec-ta-bil-i-ty"},"inflection":{"noun_plural":"inspectabilities (rarely used)"},"usage_notes":{"explanation":"'Inspectability' refers to how easily something can be examined or checked. It's often used in technical contexts like software development, engineering, and finance, where the ability to thoroughly inspect something is important for quality control, security, or compliance. It emphasizes the design or inherent properties that allow for effective inspection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inspectability is important for the product.","correct":"✓ Inspectability is important for the product.","note":"The article 'the' is generally not used before 'inspectability' unless referring to a specific instance of inspectability."},{"incorrect":"✗ The product has good inspection.","correct":"✓ The product has good inspectability.","note":"'Inspection' is the act of inspecting, while 'inspectability' is the quality of being inspectable."}],"priority":"★★☆"},"related_words":{"derivatives":["inspect (verb)","inspection (noun)","inspectable (adjective)","inspector (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Inspectability' is a formal term that describes how easily something can be examined or checked. It's often used in technical fields like software development or engineering when it's important to be able to thoroughly examine something to make sure it's working correctly or to find problems. It's not a common word in everyday conversation, but it's important to understand in those specific contexts."},"example_sentences":[{"sentence":"The high inspectability of the code allowed the team to quickly identify and fix the bug.","translation":"コードの高い検査可能性により、チームはバグを迅速に特定して修正することができました。","type":"general","meaning_category":"検査可能性"},{"sentence":"The new regulations require greater inspectability of financial transactions.","translation":"新しい規制では、金融取引のより高い検査可能性が求められています。","type":"finance","meaning_category":"検査可能性"},{"sentence":"The engineer focused on improving the inspectability of the bridge's support structure.","translation":"エンジニアは、橋の支持構造の検査可能性の向上に焦点を当てました。","type":"engineering","meaning_category":"検査可能性"}]}