{"word":"focally","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"焦点的に、焦点が合って、集中的に","english_definition":"In a focal manner; with focus; in a way that relates to a focus or focal point.","examples":[{"sentence":"The light was focally directed onto the painting.","translation":"光は絵に焦点的に当てられていた。"},{"sentence":"The study focally examined the effects of the drug.","translation":"その研究は、その薬の効果を焦点的に調べた。"},{"sentence":"The discussion focally addressed the key issues.","translation":"議論は、主要な問題に焦点を当てて行われた。"}],"collocations":["focally directed","focally examined","focally addressed","focally treated","focally enhanced"],"synonyms":["centrally","concentrically","pointedly","specifically","particularly","primarily"],"antonyms":["diffusely","generally","broadly","vaguely"]}],"etymology":{"value":"Derived from the adjective 'focal' (relating to a focus) with the addition of the adverbial suffix '-ly'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfoʊkəli/","syllables":"fo-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Focally' is used to describe actions or processes that are performed with a specific focus or directed towards a particular point or area. It indicates a concentrated or targeted approach. It is often used in technical or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The problem was focally, but not entirely, resolved.","correct":"✓ The problem was partially, but not entirely, resolved.","note":"'Focally' implies a focus on a specific point, not a degree of resolution. Use 'partially' or 'partly' to indicate incomplete resolution."},{"incorrect":"✗ The artist painted focally on the canvas.","correct":"✓ The artist focused on a specific area of the canvas.","note":"'Focally' describes how an action is performed, not the direct action itself. Use 'focused' or rephrase to emphasize the artist's concentration."}],"priority":"★★☆"},"related_words":{"derivatives":["focal (adjective)","focus (noun, verb)","focalize (verb)","focalization (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Focally' is an adverb that means 'with focus' or 'in a way that relates to a focus.' It's used in more formal or technical contexts to describe something done with a specific point or area of concentration. It's not a common word in everyday conversation, but you might encounter it in academic papers or technical manuals."},"example_sentences":[{"sentence":"The research team focally investigated the impact of the new policy on small businesses.","translation":"研究チームは、新しい政策が中小企業に与える影響を焦点的に調査した。","type":"general"},{"sentence":"The surgeon focally removed the tumor, minimizing damage to surrounding tissue.","translation":"外科医は、周囲の組織への損傷を最小限に抑えながら、腫瘍を焦点的に除去した。","type":"medical"},{"sentence":"The discussion focally centered on the ethical implications of the technology.","translation":"議論は、その技術の倫理的影響に焦点を当てて行われた。","type":"academic"}]}