{"word":"Homopolymerization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ホモ重合、単独重合","english_definition":"A polymerization reaction in which a polymer is formed from only one type of monomer.","examples":[{"sentence":"Homopolymerization of styrene yields polystyrene.","translation":"スチレンのホモ重合により、ポリスチレンが得られる。"},{"sentence":"Homopolymerization is a fundamental process in polymer chemistry.","translation":"ホモ重合は、高分子化学における基本的なプロセスである。"}],"collocations":["radical homopolymerization (ラジカルホモ重合)","cationic homopolymerization (カチオンホモ重合)","anionic homopolymerization (アニオンホモ重合)"],"synonyms":["self-polymerization"],"antonyms":["copolymerization"]},{"part_of_speech":"noun","definition":"単独重合体","english_definition":"A polymer made up of only one type of monomer.","examples":[{"sentence":"Polyethylene is a homopolymerization product of ethylene.","translation":"ポリエチレンはエチレンのホモ重合生成物である。"},{"sentence":"The properties of the homopolymerization product depend on the monomer used.","translation":"ホモ重合生成物の特性は、使用されるモノマーに依存する。"}],"collocations":["a vinyl homopolymerization (ビニルホモ重合体)","a condensation homopolymerization (縮合ホモ重合体)"],"synonyms":["homopolymer"],"antonyms":["copolymer"]}],"etymology":{"value":"The term 'homopolymerization' is derived from 'homo-' (meaning 'same' or 'single'), 'polymer' (a substance composed of large molecules or macromolecules composed of repeating structural units), and '-ization' (the process of becoming).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhoʊmoʊpəˌlɪmərɪˈzeɪʃən/","syllables":"ho-mo-pol-y-mer-i-za-tion"},"inflection":{"noun_plural":"homopolymerizations"},"usage_notes":{"explanation":"'Homopolymerization' refers to the process of forming a polymer from a single type of monomer. The resulting polymer is called a homopolymer. This process is fundamental in the production of many common plastics and synthetic materials. The reaction conditions and catalysts used can significantly affect the properties of the resulting homopolymer.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The homopolymerization made of two monomers.","correct":"✓ The homopolymerization is made of one monomer.","note":"Homopolymerization involves only one type of monomer. Using 'two monomers' indicates copolymerization."},{"incorrect":"✗ Homopolymerization is the same as polymerization.","correct":"✓ Homopolymerization is a type of polymerization.","note":"Homopolymerization is a specific type of polymerization where only one monomer is used. General polymerization can involve multiple monomers."}],"priority":"★★☆"},"related_words":{"derivatives":["homopolymer (単独重合体)","polymerization (重合)","monomer (単量体)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Homopolymerization' is a technical term used in chemistry, specifically in the field of polymer science. It describes the process where identical molecules (monomers) join together to form a long chain-like structure called a homopolymer. This term is typically encountered in scientific literature, textbooks, or technical discussions related to polymer synthesis and material science. Understanding this term requires a basic knowledge of chemistry and polymer concepts."},"example_sentences":[{"sentence":"The rate of homopolymerization depends on the reaction conditions and the type of monomer.","translation":"ホモ重合の速度は、反応条件とモノマーの種類に依存する。","type":"general","meaning_category":"Process"},{"sentence":"The resulting homopolymerization product exhibited high thermal stability.","translation":"得られたホモ重合生成物は、高い熱安定性を示した。","type":"product","meaning_category":"Product"},{"sentence":"Free-radical homopolymerization is a common method for synthesizing polymers.","translation":"ラジカルホモ重合は、ポリマーを合成するための一般的な方法である。","type":"method","meaning_category":"Method"}]}