{"word":"Hebraiser","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘブライ語化する人、ヘブライ語を支持する人","english_definition":"A person who Hebraises; one who favors or promotes Hebraism.","examples":[{"sentence":"He was a dedicated Hebraiser, advocating for the revival of Hebrew as a modern language.","translation":"彼は熱心なヘブライ語支持者であり、現代語としてのヘブライ語の復興を提唱していました。"}],"collocations":["dedicated Hebraiser","ardent Hebraiser"],"synonyms":["Hebraist","pro-Hebrew advocate"],"antonyms":["anti-Hebraist"]},{"part_of_speech":"verb","definition":"ヘブライ語化する","english_definition":"To render into Hebrew; to conform to Hebrew idiom.","examples":[{"sentence":"They sought to Hebraise their surnames upon immigrating to Israel.","translation":"彼らはイスラエルに移住する際に、姓をヘブライ語化しようとしました。"}],"collocations":["Hebraise a name","Hebraise a text"],"synonyms":["Hebrewize","translate into Hebrew"],"antonyms":["anglicize","latinize"]}],"etymology":{"value":"Formed from 'Hebrew' + '-ise'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhiːbraɪzər/","syllables":"He-brai-ser"},"inflection":{"noun_plural":"Hebraisers","verb_forms":{"present_simple":["Hebraise","Hebraises"],"past_simple":"Hebraised","past_participle":"Hebraised","present_participle":"Hebraising"}},"usage_notes":{"explanation":"The term 'Hebraiser' refers to someone who actively promotes or engages in the process of Hebraisation, which involves adopting or adapting something to conform to Hebrew language or culture. This can include translating texts into Hebrew, adopting Hebrew names, or advocating for the use of Hebrew in various contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Hebraizer of English literature.","correct":"✓ He is a translator of English literature into Hebrew.","note":"'Hebraiser' refers to someone who promotes Hebraism or converts something to Hebrew, not necessarily a translator of literature."}],"priority":"★☆☆"},"related_words":{"derivatives":["Hebraism","Hebraic","Hebrewize"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Hebraiser' is a relatively uncommon term referring to someone who advocates for or practices Hebraism, which is the adoption or promotion of Hebrew language and culture. It can also refer to the act of converting something into Hebrew. Due to its specialized meaning, it is more likely to be encountered in academic or historical contexts related to Hebrew language and culture."},"example_sentences":[{"sentence":"As a passionate Hebraiser, he dedicated his life to teaching Hebrew to immigrants.","translation":"情熱的なヘブライ語支持者として、彼は移民にヘブライ語を教えることに生涯を捧げました。","type":"noun","meaning_category":"ヘブライ語化する人"},{"sentence":"Many early Zionists chose to Hebraise their names to connect with their ancestral heritage.","translation":"初期のシオニストの多くは、祖先の遺産とのつながりを求めて、名前をヘブライ語化することを選びました。","type":"verb","meaning_category":"ヘブライ語化する"}]}