{"word":"nonchurch","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(日本のキリスト教における)無教会主義、または無教会主義者","english_definition":"(In Japanese Christianity) Mukyōkai-shugi (Nonchurch Movement), or a follower of Mukyōkai-shugi.","examples":[{"sentence":"The nonchurch movement emphasizes individual Bible study and direct experience of faith.","translation":"無教会主義運動は、個人の聖書研究と信仰の直接的な経験を重視する。"},{"sentence":"He was a prominent figure in the nonchurch movement.","translation":"彼は無教会主義運動の著名な人物だった。"}],"collocations":["nonchurch movement","nonchurch Christian","nonchurch theology"],"synonyms":["Mukyōkai","無教会","無教会主義"],"antonyms":["institutional church","教会"],"notes":"This term is specific to the Japanese Christian context and refers to a movement that rejects formal church structures."}],"etymology":{"value":"A direct translation of the Japanese term '無教会' (mukyōkai), meaning 'no church'.","priority":"★★★"},"pronunciation":{"ipa":"/nɒnˈtʃɜːrtʃ/","syllables":"non-church"},"inflection":{"noun_plural":"nonchurches"},"usage_notes":{"explanation":"The term 'nonchurch' refers to the Mukyōkai movement within Japanese Christianity. This movement emphasizes personal Bible study and spiritual experience over adherence to formal church structures and rituals. It is important to note that 'nonchurch' does not simply mean 'not attending church'; it represents a specific theological and historical position.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is nonchurch because he doesn't go to church.","correct":"✓ He is not affiliated with any church.","note":"'Nonchurch' has a specific theological meaning, so simply not attending church doesn't make someone 'nonchurch'."}],"priority":"★★☆"},"related_words":{"derivatives":["Mukyōkai (無教会)","無教会主義 (Mukyōkai-shugi)"],"related_concepts":["Christianity in Japan","Japanese religious movements"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to religious studies and Japanese culture.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'nonchurch' is a specialized term primarily used in the context of Japanese Christianity to describe the Mukyōkai movement. Understanding this term requires familiarity with Japanese religious history and theology. It signifies a rejection of traditional church structures in favor of individual spiritual practice and Bible study. It is not simply a synonym for 'not attending church'. Therefore, its usage is limited to discussions about this specific religious movement.","notes":"The term is not widely used outside of discussions about Japanese Christianity."},"example_sentences":[{"sentence":"The founder of the nonchurch movement believed that true faith could be found outside of established religious institutions.","translation":"無教会主義運動の創始者は、真の信仰は確立された宗教組織の外で見つけられると信じていた。","type":"noun","meaning_category":"無教会主義者"},{"sentence":"The nonchurch tradition emphasizes the importance of personal interpretation of scripture.","translation":"無教会主義の伝統は、聖書の個人的な解釈の重要性を強調する。","type":"adjective (attributive)","meaning_category":"無教会主義の"}]}