{"word":"domestic-themed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"家庭をテーマにした、家庭的なテーマの","english_definition":"Relating to or having a theme centered around the home, family, or household activities.","examples":[{"sentence":"The craft fair featured many domestic-themed items, such as handmade quilts and knitted blankets.","translation":"その手芸市では、手作りのキルトや編み物の毛布など、家庭をテーマにした商品がたくさん展示されていました。"},{"sentence":"She decorated her kitchen with domestic-themed artwork, including paintings of fruits and vegetables.","translation":"彼女はキッチンを、果物や野菜の絵など、家庭的なテーマのアート作品で飾りました。"},{"sentence":"The store sells domestic-themed decorations.","translation":"その店は家庭的なテーマの装飾品を販売しています。"}],"collocations":["domestic-themed crafts","domestic-themed decor","domestic-themed party","domestic-themed gifts"],"synonyms":["home-themed","family-oriented","household-related"],"antonyms":["commercial-themed","industrial-themed","foreign-themed"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"domestic\" (relating to the home or family) with \"themed\" (having a particular subject or idea).","priority":"★★☆"},"pronunciation":{"ipa":"/dəˈmɛstɪk θimd/","syllables":"do-mes-tic-themed"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Domestic-themed\" is used to describe something that relates to or is based on the idea of home, family, or household activities. It is commonly used to describe decorations, crafts, parties, or gifts that have a focus on these themes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The party was domestic themed.","correct":"✓ The party was domestic-themed.","note":"The hyphen is important to correctly form the compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["domestic (adjective)","theme (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'domestic-themed' is relatively straightforward, combining the familiar word 'domestic' with 'themed'. It implies a focus on home, family, and household activities, making it easily understandable for those with a good grasp of English vocabulary."},"example_sentences":[{"sentence":"The bakery offered a variety of domestic-themed cookies for the holidays.","translation":"そのパン屋は、休日向けに様々な家庭的なテーマのクッキーを提供しました。","type":"adjective","meaning_category":"家庭をテーマにした"},{"sentence":"She enjoys creating domestic-themed cross-stitch patterns as a hobby.","translation":"彼女は趣味として、家庭的なテーマのクロスステッチのパターンを作るのを楽しんでいます。","type":"adjective","meaning_category":"家庭的なテーマの"},{"sentence":"The charity auction included several domestic-themed gift baskets.","translation":"その慈善オークションには、いくつかの家庭的なテーマのギフトバスケットが含まれていました。","type":"adjective","meaning_category":"家庭的なテーマの"}]}