{"word":"repropagate","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び繁殖させる、再び広める","english_definition":"To propagate again; to cause to multiply or breed again; to disseminate or spread again.","examples":[{"sentence":"The gardener decided to repropagate the rare orchid to increase its numbers.","translation":"庭師は、その希少なランを増やそうと、再び繁殖させることに決めた。"},{"sentence":"The organization aims to repropagate the original message of the movement after it was distorted.","translation":"その組織は、運動の本来のメッセージが歪められた後、それを再び広めることを目指している。"}],"collocations":["repropagate a plant (植物を再び繁殖させる)","repropagate a message (メッセージを再び広める)","repropagate an idea (アイデアを再び広める)"],"synonyms":["reproduce","breed","multiply","disseminate","respread","recirculate"],"antonyms":["suppress","contain","extinguish"]}],"etymology":{"value":"The word \"repropagate\" is formed by adding the prefix \"re-\" (meaning \"again\" or \"anew\") to the word \"propagate.\" \"Propagate\" comes from the Latin word \"propagare,\" meaning \"to propagate, to spread, to extend,\" which in turn comes from \"propago,\" meaning \"offshoot, layer, cutting; progeny, offspring.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈprɒpəɡeɪt/","syllables":"re-prop-a-gate"},"inflection":{"verb_forms":{"present_simple":["repropagate","repropagates"],"past_simple":"repropagated","past_participle":"repropagated","present_participle":"repropagating"}},"usage_notes":{"explanation":"\"Repropagate\" implies a second or subsequent act of propagation. It suggests that something has already been propagated once, and now the intention is to propagate it again, often to reinforce or extend the initial propagation. The word can be used in both literal and figurative senses.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The news was repropagated by the media, but it was not true.","correct":"✓ The news was re-reported by the media, but it was not true.","note":"While \"repropagate\" can be used for spreading information, \"re-report\" is more common in the context of news. \"Repropagate\" is better suited for ideas or messages that need to be reinforced or spread more widely."}],"priority":"★☆☆"},"related_words":{"derivatives":["repropagation (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"repropagate\" is a relatively uncommon word that means to propagate again. It is formed by adding the prefix \"re-\" to the word \"propagate,\" which means to spread or disseminate. This word is most often used in technical or specialized contexts, such as botany or communications, where the idea of spreading or multiplying something again is relevant. It is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The conservationists are working to repropagate endangered plant species in the region.","translation":"保護活動家たちは、その地域で絶滅危惧種の植物を再び繁殖させる活動に取り組んでいる。","type":"verb","meaning_category":"繁殖させる"},{"sentence":"The political party sought to repropagate its core values after a period of internal conflict.","translation":"その政党は、内紛の期間を経て、その中核的価値観を再び広めようとした。","type":"verb","meaning_category":"広める"}]}