{"word":"backening","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(航海)風向きが逆転すること、またはその状態。船が風上に向かおうとする際に、風が船首から吹いてくる状態。","english_definition":"(Nautical) A shift in the wind direction in a counter-clockwise direction in the Northern Hemisphere (clockwise in the Southern Hemisphere). It can also refer to the state of being in such a wind shift, where the wind is blowing from ahead of the vessel.","examples":[{"sentence":"The sudden backening of the wind made it difficult to steer the sailboat.","translation":"風が急に逆転したため、ヨットの操縦が難しくなった。"},{"sentence":"Experienced sailors are wary of a backening wind, as it can signal an approaching storm.","translation":"経験豊富な船乗りは、風の逆転に警戒する。それは近づく嵐の前兆となり得るからだ。"}],"collocations":["wind backening","sudden backening","gradual backening"],"synonyms":["veering (opposite direction change)","wind shift","wind reversal"],"antonyms":["veering (wind direction change in a clockwise direction)"]},{"part_of_speech":"verb","definition":"(古語)風向きが逆転する (backenの現在分詞)","english_definition":"(Archaic) Present participle of the verb 'backen', meaning to shift in a counter-clockwise wind direction.","examples":[{"sentence":"The wind was backening, making it impossible to continue on the current course.","translation":"風向きが逆転しており、現在の航路を続けることが不可能になった。"}],"collocations":["wind is backening"],"synonyms":["shifting","reversing"],"antonyms":["veering"]}],"etymology":{"value":"Derived from the verb 'backen', which is related to 'back' in the sense of reversing or coming from behind. The nautical term specifically refers to the wind coming from ahead of the vessel.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbækənɪŋ/","syllables":"back-en-ing"},"inflection":{"verb_forms":{"present_participle":"backening"}},"usage_notes":{"explanation":"'Backening' is a nautical term primarily used to describe a specific change in wind direction. It's most commonly encountered in sailing contexts. The opposite of backening is 'veering', which describes a clockwise shift in wind direction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The backening of the sun made it hotter.","correct":"✓ The heat from the sun increased.","note":"'Backening' specifically refers to wind direction, not the sun or other phenomena."}],"priority":"★☆☆"},"related_words":{"derivatives":["backen (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Backening' is a specialized nautical term referring to a counter-clockwise shift in wind direction, particularly when it causes the wind to come from ahead of a sailing vessel. This term is primarily used by sailors and those familiar with sailing terminology. Understanding this term requires knowledge of nautical concepts and vocabulary. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The navigator noted the backening wind and adjusted the sails accordingly.","translation":"航海士は風の逆転に気づき、それに応じて帆を調整した。","type":"noun","meaning_category":"wind direction change"},{"sentence":"The captain warned the crew that the wind was backening and a change in course might be necessary.","translation":"船長は乗組員に、風向きが逆転しており、針路変更が必要になるかもしれないと警告した。","type":"verb","meaning_category":"wind direction change"}]}