{"word":"Inflamer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(文字通り) 炎症を引き起こすもの、燃え上がらせるもの","english_definition":"Something that causes inflammation or something that ignites or intensifies a fire.","examples":[{"sentence":"The chemical was an inflamer, causing severe burns.","translation":"その化学物質は炎症を引き起こすもので、重度の火傷を引き起こした。"},{"sentence":"Dry wood acts as an inflamer, quickly spreading the fire.","translation":"乾燥した木材は燃え上がりやすく、火を急速に広げる。"}],"collocations":["chemical inflamer","wood inflamer"],"synonyms":["igniter","combustible","irritant"],"antonyms":["extinguisher","soother"]},{"part_of_speech":"noun","definition":"(比喩的に) 扇動者、興奮させる人、感情を煽る人","english_definition":"A person or thing that stirs up strong feelings or passions, often negative ones.","examples":[{"sentence":"He was known as an inflamer, always stirring up trouble.","translation":"彼は扇動者として知られており、常に騒ぎを引き起こしていた。"},{"sentence":"The media can act as an inflamer, exaggerating events to create sensation.","translation":"メディアは扇動者として働き、センセーションを起こすために出来事を誇張することがある。"}],"collocations":["political inflamer","emotional inflamer"],"synonyms":["agitator","provocateur","rabble-rouser","instigator"],"antonyms":["pacifier","peacemaker"]}],"etymology":{"value":"Derived from the verb 'inflame,' which comes from Latin 'inflammare' (to set on fire). The noun 'inflamer' literally refers to something that sets fire, but it has also taken on a figurative meaning to describe someone who stirs up emotions or troubles.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈfleɪmər/","syllables":"in-fla-mer"},"inflection":{"noun_plural":"Inflamers"},"usage_notes":{"explanation":"'Inflamer' can refer to something that literally causes a fire or inflammation, but it's more commonly used figuratively to describe someone who stirs up trouble or strong emotions. The figurative use often carries a negative connotation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is an inflamer to good deeds.","correct":"✓ She is an inspiration to good deeds.","note":"'Inflamer' typically has a negative connotation, so it's not appropriate to use it in a positive context. Use 'inspiration' or a similar word instead."}],"priority":"★★☆"},"related_words":{"derivatives":["Inflame (verb)","Inflammation (noun)","Inflammatory (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'inflamer' has both a literal and a figurative meaning. Literally, it refers to something that causes inflammation or sets something on fire. Figuratively, it refers to someone who stirs up strong, often negative, emotions or trouble. This word is not very common and is usually encountered in more formal or literary contexts. It's important to understand the context to determine whether the word is being used literally or figuratively."},"example_sentences":[{"sentence":"The speaker was an inflamer, inciting the crowd to riot.","translation":"その講演者は扇動者であり、群衆を扇動して暴動を起こさせた。","type":"noun","meaning_category":"扇動者"},{"sentence":"Gasoline is a dangerous inflamer.","translation":"ガソリンは危険な発火物質である。","type":"noun","meaning_category":"発火物質"}]}