{"word":"Ontologism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"存在論主義（存在論的直観説）：人間の知識は、神の存在や本質に関する直接的な直観に基づいているという哲学的な理論。","english_definition":"A philosophical doctrine that human knowledge is based on an intuitive awareness of God or divine being.","examples":[{"sentence":"Ontologism posits that humans have an innate knowledge of God.","translation":"存在論主義は、人間が神についての生得的な知識を持っていると仮定する。"},{"sentence":"Some critics argue that ontologism blurs the line between faith and reason.","translation":"批評家の中には、存在論主義が信仰と理性の境界線を曖昧にすると主張する者もいる。"}],"collocations":["theory of ontologism","criticism of ontologism","defenders of ontologism"],"synonyms":["Intuitionism (in some contexts)","Idealism (related concept)"],"antonyms":["Empiricism","Rationalism","Skepticism"]}],"etymology":{"value":"Derived from 'ontology' (the study of being) + '-ism' (denoting a doctrine or system of thought).","priority":"★★☆"},"pronunciation":{"ipa":"/ɒnˈtɒləˌdʒɪzəm/","syllables":"on-tol-o-gism"},"inflection":{"noun_plural":"Ontologisms"},"usage_notes":{"explanation":"Ontologism is a specific philosophical position, primarily associated with 19th-century Catholic thinkers. It asserts that humans possess an immediate, intuitive knowledge of God's essence, which serves as the foundation for all other knowledge. This view contrasts with empiricism (knowledge from sensory experience) and rationalism (knowledge from reason). It's important to note that ontologism is a somewhat obscure and contested doctrine, and its precise definition can vary.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He studied ontologism as a branch of biology.","correct":"✓ He studied ontologism as a branch of philosophy.","note":"Ontologism is a philosophical, not a biological, concept."},{"incorrect":"✗ Ontologism is the belief that everything is relative.","correct":"✓ Ontologism is the belief that human knowledge is based on an intuitive awareness of God.","note":"Ontologism is specifically about the source of knowledge, not about relativism."}],"priority":"★★☆"},"related_words":{"derivatives":["ontological","ontology"],"phrasal_verbs":[],"related_concepts":["Idealism","Intuition","Divine illumination"]},"level_frequency":{"CEFR":"C2 (specialized philosophical vocabulary)","frequency_google_ngram":"Very low frequency. A specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ontologism' is a highly specialized term in philosophy, referring to the belief that humans have direct, intuitive knowledge of God's being. It's rarely used outside of philosophical discussions and requires a strong understanding of philosophical concepts like ontology, epistemology, and the history of philosophy."},"example_sentences":[{"sentence":"Augustine's philosophy contains elements that some scholars interpret as precursors to ontologism.","translation":"アウグスティヌスの哲学には、学者によっては存在論主義の先駆けと解釈される要素が含まれている。","type":"general","meaning_category":"philosophical doctrine"},{"sentence":"The Vatican condemned ontologism as incompatible with Catholic doctrine.","translation":"バチカンは存在論主義をカトリックの教義と相容れないものとして非難した。","type":"historical","meaning_category":"historical context"}]}