{"word":"Hemiope","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(obsolete) A kind of headache affecting only one side of the head; migraine.","english_definition":"(obsolete) A headache affecting only one side of the head; migraine.","examples":[{"sentence":"The patient complained of a severe hemiopie that made it difficult to concentrate.","translation":"患者は集中困難を引き起こす重度の片頭痛を訴えた。"}],"collocations":["severe hemiopie","chronic hemiopie"],"synonyms":["migraine","hemicrania"],"antonyms":[]}],"etymology":{"value":"Derived from Greek roots: 'hemi-' meaning 'half' and 'ops' meaning 'eye' or 'vision.' The term originally related to a visual defect affecting half of the visual field, but later became associated with hemicrania, a headache affecting one side of the head.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛmiˌoʊp/","syllables":"He-mi-ope"},"inflection":{"noun_plural":"hemiope"},"usage_notes":{"explanation":"The term 'hemiope' is largely obsolete in modern medical terminology.  'Migraine' or 'hemicrania' are the preferred terms for a headache affecting one side of the head.  The original meaning related to visual field defects, but this is rarely used now.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He suffered from hemiopie in his leg.","correct":"✓ He suffered from hemiopie, a headache on one side of his head.","note":"Hemiope refers to a headache, not a pain in the limbs."}],"priority":"☆☆☆"},"related_words":{"derivatives":["hemicrania","hemianopsia"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely rare.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Hemiope' is an archaic medical term, rarely used in contemporary English. Understanding its meaning requires familiarity with historical medical vocabulary and Greek root words. Modern terms like 'migraine' or 'hemicrania' are preferred in current medical contexts."},"example_sentences":[{"sentence":"The old medical text described the patient's condition as 'hemiope'.","translation":"その古い医学書は患者の状態を「ヘミオプ」と記述していた。","type":"noun","meaning_category":"medical condition"},{"sentence":"Although rarely used today, 'hemiope' once referred to a specific type of headache.","translation":"今日ではほとんど使われないが、「ヘミオプ」はかつて特定の種類の頭痛を指していた。","type":"noun","meaning_category":"historical term"}]}