{"word":"reclusely","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"隠遁して、世を避けて、人目を避けて","english_definition":"In a recluse-like manner; in seclusion; avoiding the company of others.","examples":[{"sentence":"He lived reclusely in a cabin in the woods, rarely seeing anyone.","translation":"彼は森の小屋に隠遁して暮らし、めったに誰にも会わなかった。"},{"sentence":"She spent her days reclusely, dedicating her time to writing and meditation.","translation":"彼女は世を避けて日々を過ごし、執筆と瞑想に時間を費やした。"}],"collocations":["live reclusely","spend time reclusely","behave reclusely"],"synonyms":["solitarily","privately","isolatedly","hermitically","secludedly"],"antonyms":["sociably","gregariously","publicly","openly"]}],"etymology":{"value":"Derived from 'recluse' (noun) + '-ly' (suffix forming adverbs). 'Recluse' comes from the Latin 'reclusus,' the past participle of 'recludere' meaning 'to shut up, enclose.'","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈkluːsli/","syllables":"re-cluse-ly"},"inflection":{"notes":"Adverb, no comparative or superlative forms."},"usage_notes":{"explanation":"'Reclusely' describes the manner in which someone lives or behaves when they deliberately avoid social interaction and prefer to be alone. It emphasizes the act of living in seclusion or like a recluse. It is not a commonly used word, but it accurately conveys the idea of a solitary and isolated existence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He reclusely is living in the mountains.","correct":"✓ He is living reclusely in the mountains.","note":"Adverbs of manner (like 'reclusely') usually come after the verb or after the object if there is one. Alternatively, you can say 'He lives reclusely...'."},{"incorrect":"✗ She felt reclusely after the incident.","correct":"✓ She felt reclusive after the incident.","note":"'Reclusely' is an adverb and describes how someone acts. 'Reclusive' is an adjective and describes someone's state or tendency."}],"priority":"★☆☆"},"related_words":{"derivatives":["recluse (noun): a person who lives a solitary life and tends to avoid other people.","reclusive (adjective): characteristic of a recluse; preferring to live in isolation."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reclusely' is an adverb that describes doing something in a way that avoids other people, like a recluse. It's not a common word, so you'll mostly find it in formal writing when describing someone who lives alone and doesn't want to be around others. Remember that it describes *how* someone lives or acts, not the person themselves; for that, you'd use 'reclusive'."},"example_sentences":[{"sentence":"The artist worked reclusely in his studio, rarely emerging to socialize.","translation":"そのアーティストはめったに社交のために姿を現さず、スタジオに引きこもって制作活動を行った。","type":"adverb","meaning_category":"世を避けて"},{"sentence":"After the scandal, she chose to live reclusely, away from the public eye.","translation":"スキャンダルの後、彼女は人目を避けて隠遁生活を送ることを選んだ。","type":"adverb","meaning_category":"人目を避けて"}]}