{"word":"transcreate","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(広告やマーケティングにおいて)ある言語から別の言語へ、単に翻訳するだけでなく、文化的なニュアンスや感情的な響きを考慮して、メッセージを再構築・創造すること。","english_definition":"(in advertising and marketing) to adapt a message from one language to another, while maintaining its intent, style, tone, and context. It involves recreating the message to resonate with the target audience's culture and emotions, rather than simply translating it word-for-word.","examples":[{"sentence":"The company decided to transcreate their slogan for the Japanese market to better connect with local consumers.","translation":"その会社は、現地の消費者にさらに繋がりを持てるように、日本市場向けにスローガンをトランスクリエイトすることに決定した。"},{"sentence":"Transcreation goes beyond translation; it's about capturing the essence of the brand in a new cultural context.","translation":"トランスクリエーションは翻訳を超えたものであり、新しい文化的背景の中でブランドの本質を捉えることである。"},{"sentence":"A successful transcreation will feel as natural and impactful in the target language as it does in the original.","translation":"成功したトランスクリエーションは、元の言語と同じくらい自然でインパクトのあるものとして、ターゲット言語で感じられるだろう。"}],"collocations":["transcreate a slogan (スローガンをトランスクリエイトする)","transcreate marketing materials (マーケティング資料をトランスクリエイトする)","transcreate advertising campaigns (広告キャンペーンをトランスクリエイトする)","transcreation process (トランスクリエーションのプロセス)","cultural transcreation (文化的なトランスクリエーション)"],"synonyms":["creative translation","cultural adaptation","localization","internationalization","cross-cultural marketing"],"antonyms":["literal translation","word-for-word translation"]},{"part_of_speech":"noun","definition":"トランスクリエイトすること、またはその成果物。","english_definition":"the act of transcreating, or the result of transcreating.","examples":[{"sentence":"The transcreation of the advertisement was so successful that it significantly increased sales in the new market.","translation":"その広告のトランスクリエーションは非常に成功し、新しい市場での売上を大幅に増加させた。"},{"sentence":"Effective transcreation requires a deep understanding of both the source and target cultures.","translation":"効果的なトランスクリエーションには、ソースとターゲットの両方の文化に対する深い理解が必要である。"}],"collocations":["successful transcreation (成功したトランスクリエーション)","effective transcreation (効果的なトランスクリエーション)","creative transcreation (創造的なトランスクリエーション)"],"synonyms":["creative adaptation","localized content"],"antonyms":["literal translation"]}],"etymology":{"value":"「translation」（翻訳）と「creation」（創造）を組み合わせた造語。","priority":"★★☆"},"pronunciation":{"ipa":"/trænz.kriˈeɪ.ʃən/","syllables":"trans-cre-a-tion"},"inflection":{"verb_forms":{"present_simple":["transcreate","transcreates"],"past_simple":"transcreated","past_participle":"transcreated","present_participle":"transcreating"},"noun_plural":"transcreations"},"usage_notes":{"explanation":"「**transcreate**」は、単なる翻訳を超えて、文化的な適合性や感情的な共鳴を重視する、広告・マーケティング分野で重要な概念です。直訳では意味が通じない、あるいは意図した効果が得られない場合に、メッセージを再構築します。ローカリゼーション（localization）と関連しますが、ローカリゼーションがより広範な適応（言語、日付形式、通貨など）を指すのに対し、トランスクリエーションはより創造的なプロセスに焦点を当てます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We just need to translate this ad, not transcreate it.","correct":"✓ We need to transcreate this ad, not just translate it, to make sure it resonates with the local audience.","note":"単なる翻訳では文化的なニュアンスが伝わらない場合、トランスクリエーションが必要であることを強調する。"},{"incorrect":"✗ Transcreation is the same as translation.","correct":"✓ Transcreation is different from translation; it involves recreating the message to fit the target culture.","note":"トランスクリエーションと翻訳の違いを明確にする。"}],"priority":"★★☆"},"related_words":{"derivatives":["transcreation (名詞: トランスクリエーション)","transcreator (名詞: トランスクリエイトする人)"],"related_terms":["localization","adaptation","culturalization","international marketing","cross-cultural communication"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2 (専門用語)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 専門分野で使われる用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**transcreate**」は、広告やマーケティングの世界で使われる専門的な言葉です。これは、ある言語から別の言語へメッセージを翻訳するだけでなく、そのメッセージが新しい文化の中で同じように感じられるように、内容やスタイルを大きく変えることを意味します。例えば、ジョークやスラングは文化によって違うので、そのまま翻訳しても意味が通じないことがあります。そこで、トランスクリエイトは、新しい文化に合った表現を使って、同じような感情や反応を引き出すようにします。これは、ただ言葉を置き換えるだけでなく、文化的な意味や感情を理解して、新しいメッセージを作り出す、とてもクリエイティブな作業です。"},"example_sentences":[{"sentence":"Our team will **transcreate** the website content to appeal to a German audience.","translation":"私たちのチームは、ドイツの視聴者にアピールするために、ウェブサイトのコンテンツをトランスクリエイトします。","type":"verb","meaning_category":"(広告やマーケティングにおいて)メッセージを再構築・創造すること"},{"sentence":"The **transcreation** of the campaign was so successful that it won several awards.","translation":"そのキャンペーンのトランスクリエーションは非常に成功し、いくつかの賞を受賞しました。","type":"noun","meaning_category":"トランスクリエイトすること、またはその成果物"},{"sentence":"It's important to **transcreate** the brand's voice to resonate with the local culture.","translation":"現地の文化に共鳴するように、ブランドの声をトランスクリエイトすることが重要です。","type":"verb","meaning_category":"(広告やマーケティングにおいて)メッセージを再構築・創造すること"},{"sentence":"The **transcreation** process requires a deep understanding of the target market.","translation":"トランスクリエーションのプロセスには、ターゲット市場の深い理解が必要です。","type":"noun","meaning_category":"トランスクリエイトすること、またはその成果物"}]}