{"word":"hyomandibula","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"（魚類の）舌顎骨（ぜつがくこつ）","english_definition":"A bone in the hyoid arch of fishes that supports the jaw and operculum.","examples":[{"sentence":"The hyomandibula plays a crucial role in jaw suspension in many fish species.","translation":"舌顎骨は多くの魚種において顎の懸垂において重要な役割を果たします。"}],"collocations":[],"synonyms":["hyomandibular"],"antonyms":[]}],"etymology":{"value":"From 'hyo-' (relating to the hyoid arch) + 'mandibula' (Latin for 'lower jaw').","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪoʊmænˈdɪbjʊlə/","syllables":"hy-o-man-dib-u-la"},"inflection":{"noun_plural":"hyomandibulae"},"usage_notes":{"explanation":"The hyomandibula is a key element in the skeletal structure of fish, particularly in the suspension of the jaws and the movement of the operculum (gill cover). Its morphology can vary significantly across different fish species, reflecting adaptations to different feeding strategies and environments.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["hyoid","mandible","operculum"],"related_terms":["branchial arch","gill arch"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'hyomandibula' is a specialized anatomical term primarily used in the context of ichthyology (the study of fish) and comparative anatomy. It refers to a specific bone in the hyoid arch of fishes. Understanding this term requires a background in biology or zoology. Due to its highly specific usage, it is not commonly encountered in general English.","priority":"★★☆"},"example_sentences":[{"sentence":"The fossilized hyomandibula provided valuable insights into the evolutionary history of jawed vertebrates.","translation":"化石化した舌顎骨は、顎口動物の進化の歴史に関する貴重な洞察を提供しました。","type":"scientific","meaning_category":"anatomy"},{"sentence":"Comparative studies of the hyomandibula in different fish species reveal diverse adaptations for feeding.","translation":"異なる魚種における舌顎骨の比較研究は、摂食のための多様な適応を示しています。","type":"scientific","meaning_category":"anatomy"}]}