{"word":"rosewater","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"バラ水","english_definition":"A fragrant liquid made by steeping rose petals in water, used in perfumes, cosmetics, and sometimes in cooking.","examples":[{"sentence":"She added a few drops of rosewater to the lotion.","translation":"彼女はローションにバラ水を数滴加えた。"},{"sentence":"The recipe calls for a teaspoon of rosewater.","translation":"レシピには小さじ一杯のバラ水が必要です。"},{"sentence":"Rosewater has a delicate floral scent.","translation":"バラ水は繊細な花の香りがします。"}],"collocations":["add rosewater","a drop of rosewater","rosewater scent","rosewater spray"],"synonyms":["rose essence","rose extract"],"antonyms":[]}],"etymology":{"value":"Compound of 'rose' and 'water'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈroʊzˌwɔtər/","syllables":"rose-wa-ter"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Rosewater is primarily used for its fragrance. It's a common ingredient in beauty products and some cuisines, especially Middle Eastern and South Asian. The quality and intensity of the rosewater can vary depending on the rose variety and the production method.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"I drink rosewater for thirst.","correct":"I drink water to quench my thirst.","note":"Rosewater is not typically consumed as a primary beverage for quenching thirst. It's used in small quantities for flavor or fragrance."}],"priority":"★★☆"},"related_words":{"derivatives":["rose","water"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"Rosewater is a relatively uncommon word referring to a specific fragrant liquid. It's generally understood by those familiar with cooking, cosmetics, or perfumes, but may not be known by everyone. Its use is often associated with specific cultural or culinary contexts. Understanding its meaning requires a certain level of vocabulary and cultural awareness."},"example_sentences":[{"sentence":"The pastry chef used rosewater to flavor the baklava.","translation":"パティシエはバクラヴァの風味付けにバラ水を使った。","type":"noun","meaning_category":"バラ水 (料理)"},{"sentence":"She spritzed rosewater on her face to refresh her skin.","translation":"彼女は肌をリフレッシュするために顔にバラ水をスプレーした。","type":"noun","meaning_category":"バラ水 (化粧品)"},{"sentence":"The air in the garden was filled with the scent of roses and rosewater.","translation":"庭の空気はバラとバラ水の香りで満たされていた。","type":"noun","meaning_category":"バラ水 (香り)"}]}