{"word":"Hebraic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ヘブライ語の、ヘブライ人の、ヘブライ文化の","english_definition":"of or relating to the Hebrews, their language, or their culture.","examples":[{"sentence":"Hebraic studies are an important part of understanding the history of the Middle East.","translation":"ヘブライ研究は、中東の歴史を理解する上で重要な部分です。"},{"sentence":"The Hebraic tradition emphasizes ethical monotheism.","translation":"ヘブライの伝統は、倫理的一神教を強調しています。"},{"sentence":"Many early Christian texts show the influence of Hebraic thought.","translation":"初期のキリスト教のテキストの多くは、ヘブライ思想の影響を示しています。"}],"collocations":["Hebraic language","Hebraic culture","Hebraic tradition","Hebraic studies","Hebraic literature","Hebraic origins","Hebraic roots"],"synonyms":["Jewish","Israelite","Hebrew"],"antonyms":["Gentile","non-Jewish"]}],"etymology":{"value":"From Hebrew עִבְרִי (ʿivri) meaning 'Hebrew', plus the suffix -ic.","priority":"★★★"},"pronunciation":{"ipa":"/hɪˈbreɪɪk/","syllables":"He-bra-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Hebraic' is used to describe things related to the ancient Hebrews, their language (Hebrew), and their culture. It is often used in academic or historical contexts. While 'Jewish' can sometimes be used similarly, 'Hebraic' typically refers to the ancient or historical aspects, whereas 'Jewish' has broader contemporary religious and cultural connotations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hebraic is a person.","correct":"✓ A Hebrew is a person. / Hebraic refers to things related to the Hebrews.","note":"'Hebraic' is an adjective, not a noun referring to a person. A person is a 'Hebrew' or 'Jew'."},{"incorrect":"✗ Hebraic religion is the same as modern Judaism in every way.","correct":"✓ Hebraic religion is an ancestor to modern Judaism, but has evolved over time.","note":"While Hebraic traditions are foundational to Judaism, modern Judaism has evolved significantly since ancient times."}],"priority":"★★☆"},"related_words":{"derivatives":["Hebraist (noun): a scholar of Hebrew language and literature.","Hebraism (noun): a characteristic feature of Hebrew language or culture; adherence to Hebrew customs or beliefs."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Hebraic' is primarily used in academic or scholarly contexts to describe elements related to the ancient Hebrews, their language, and their culture. It is less common in everyday conversation. Understanding its usage requires familiarity with historical and religious studies terminology. It's important to distinguish 'Hebraic' from 'Jewish,' as the former typically refers to the ancient aspects, while the latter has broader contemporary religious and cultural implications."},"example_sentences":[{"sentence":"The professor specialized in Hebraic languages and literature.","translation":"その教授はヘブライ語とその文学を専門としていました。","type":"adjective","meaning_category":"ヘブライ語の、ヘブライ文化の"},{"sentence":"Archaeological discoveries have shed light on Hebraic life in ancient Israel.","translation":"考古学的発見は、古代イスラエルにおけるヘブライ人の生活に光を当てました。","type":"adjective","meaning_category":"ヘブライ人の"},{"sentence":"The influence of Hebraic thought can be seen in the development of Western ethics.","translation":"ヘブライ思想の影響は、西洋倫理の発展に見ることができます。","type":"adjective","meaning_category":"ヘブライ文化の"}]}