{"word":"wazirship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"大臣の地位、宰相の地位、大臣の職務","english_definition":"The office, position, or dignity of a wazir (a high-ranking political advisor or minister, especially in some Muslim countries).","examples":[{"sentence":"He was elevated to the wazirship after years of loyal service.","translation":"彼は長年の忠実な奉仕の後、大臣の地位に昇進した。"},{"sentence":"The wazirship is a position of great power and responsibility.","translation":"大臣の地位は、大きな権力と責任を伴う地位である。"},{"sentence":"The intrigues surrounding the wazirship were a constant feature of court life.","translation":"大臣の地位をめぐる陰謀は、宮廷生活の絶え間ない特徴であった。"}],"collocations":["assume the wazirship (大臣の地位に就く)","be granted the wazirship (大臣の地位を授与される)","resign from the wazirship (大臣の地位を辞任する)","compete for the wazirship (大臣の地位を争う)"],"synonyms":["premiership","ministership","chancellorship","viziership"],"antonyms":[]}],"etymology":{"value":"From 'wazir' (a high-ranking official in some Muslim countries) + '-ship' (a suffix denoting a state, condition, office, or dignity). The term 'wazir' itself comes from Arabic 'wazīr' (burden-bearer, helper, minister).","priority":"★★☆"},"pronunciation":{"ipa":"/wəˈzɪərʃɪp/","syllables":"wa-zir-ship"},"inflection":{"noun_plural":"wazirships"},"usage_notes":{"explanation":"'Wazirship' specifically refers to the office or position held by a 'wazir,' which is a term used in some Muslim countries (historically and currently) for a high-ranking political advisor or minister. It implies a position of significant authority and responsibility within the government. The term is relatively rare in modern English usage, primarily appearing in historical or cultural contexts related to specific regions or countries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was appointed as wazirship.","correct":"✓ He was appointed to the wazirship.","note":"The correct preposition to use with 'appointed' in this context is 'to'. You are appointed *to* a position or office."},{"incorrect":"✗ The wazirship was very easy.","correct":"✓ The duties of the wazirship were very demanding.","note":"The 'wazirship' refers to the *position* itself, not the person holding it. To describe the difficulty, refer to the 'duties' or 'responsibilities' of the position."}],"priority":"★☆☆"},"related_words":{"derivatives":["wazir (noun: a high-ranking political advisor or minister)"],"phrasal_verbs":[],"related_terms":["vizier (variant spelling of wazir)","viziership (variant of wazirship)","emirate","sultanate","caliphate","sharia","minister","advisor","official","government","administration","diplomacy"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare - not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Extremely Low Frequency - Appears very infrequently in general English text.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'wazirship' is a specialized term primarily used in historical or cultural contexts related to specific Muslim countries. It refers to the office or position of a wazir, a high-ranking political advisor or minister. Due to its limited usage and specific cultural association, it is not commonly encountered in general English and would be considered advanced vocabulary."},"example_sentences":[{"sentence":"The power struggles within the palace often centered on who would secure the coveted wazirship.","translation":"宮殿内の権力闘争は、誰が切望された大臣の地位を確保するかに集中することが多かった。","type":"noun","meaning_category":"position/office"},{"sentence":"During his wazirship, he implemented significant reforms to the tax system.","translation":"彼の大臣在任中、彼は税制に重要な改革を実施した。","type":"noun","meaning_category":"time in office"},{"sentence":"The responsibilities of the wazirship included advising the sultan on matters of state and overseeing the administration of the kingdom.","translation":"大臣の職務には、スルタンに国政に関する助言を行い、王国の行政を監督することが含まれていた。","type":"noun","meaning_category":"responsibilities"}]}