{"word":"following-on","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(クリケット) フォローオン: あるチームが第1イニングで相手チームより大幅に少ない得点しか挙げられなかった場合に、相手チームのキャプテンの判断で、そのチームに第2イニングをすぐに始めさせること。","english_definition":"(Cricket) The situation in which a team batting second scores so many fewer runs than the team batting first that the captain of the first team can require them to bat again immediately.","examples":[{"sentence":"After being forced to follow-on, the team batted much better in their second innings.","translation":"フォローオンを強いられた後、そのチームは第2イニングでははるかに良いバッティングをした。"}],"collocations":["force the follow-on","avoid the follow-on"],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"後に続く、継続する","english_definition":"Following or continuing from something else.","examples":[{"sentence":"The following-on discussion focused on the points raised in the initial meeting.","translation":"その後の議論は、最初の会議で提起された点に焦点を当てた。"}],"collocations":[],"synonyms":["subsequent","ensuing","consequent"],"antonyms":["preceding","previous"]}],"etymology":{"value":"The term 'follow-on' in cricket comes from the idea of 'following on' from the first innings immediately into the second.","priority":"N/A"},"pronunciation":{"ipa":"/ˈfɒləʊɪŋ ɒn/","syllables":"fol-low-ing on"},"inflection":{"notes":"This word can function as a noun or an adjective. The noun form is specific to cricket. The adjective form is a compound adjective."},"usage_notes":{"explanation":"As a noun, 'following-on' is a specific term in cricket. As an adjective, it describes something that immediately follows or continues from something else.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["follow (verb)"],"phrasal_verbs":["follow up"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'following-on' is relatively specialized. Its meaning depends heavily on the context, particularly whether it is used in relation to cricket or in a more general sense of something that follows or continues."},"example_sentences":[{"sentence":"The captain decided to enforce the follow-on.","translation":"キャプテンはフォローオンを適用することを決定した。","type":"noun","meaning_category":"Cricket"},{"sentence":"The following-on research will build upon the findings of the initial study.","translation":"その後の研究は、最初の研究の発見に基づいて構築される。","type":"adjective","meaning_category":"Subsequent"}]}