{"word":"Sidechair","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"肘掛けのない椅子、脇椅子","english_definition":"A chair without arms, typically placed at the side of a table or room.","examples":[{"sentence":"He pulled up a sidechair to join the conversation.","translation":"彼は会話に加わるために脇椅子を引き寄せた。"},{"sentence":"The dining room was furnished with a table and four sidechairs.","translation":"食堂にはテーブルと4脚の肘掛けのない椅子が備え付けられていた。"}],"collocations":["dining sidechair","wooden sidechair","antique sidechair"],"synonyms":["chair","seat","stool"],"antonyms":["armchair","throne"]}],"etymology":{"value":"The term 'sidechair' likely originated from the placement of the chair at the side of a table or room, distinguishing it from armchairs or other more prominent seating options.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsaɪdˌtʃɛər/","syllables":"side-chair"},"inflection":{"noun_plural":"sidechairs"},"usage_notes":{"explanation":"A 'sidechair' is generally a simple, armless chair designed for functional seating. It is often used in dining rooms, waiting areas, or as extra seating in living spaces. The term emphasizes its utilitarian nature and lack of armrests.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I sat on the sidechair and relaxed my arms.","correct":"✓ I sat on the sidechair.","note":"Sidechairs do not have arms, so you cannot relax your arms on them."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'sidechair' refers to a specific type of chair – one without armrests. It's a fairly descriptive term, as these chairs are often placed to the side of tables or in less prominent positions than armchairs. Understanding the term helps in accurately describing furniture arrangements and interior design."},"example_sentences":[{"sentence":"The minimalist design featured a simple wooden table and four matching sidechairs.","translation":"ミニマリストデザインは、シンプルな木製テーブルと4脚の揃いの肘掛けのない椅子が特徴だった。","type":"noun","meaning_category":"furniture"},{"sentence":"She chose a set of antique sidechairs to complement the vintage dining table.","translation":"彼女はヴィンテージのダイニングテーブルに合うように、アンティークの肘掛けのない椅子のセットを選んだ。","type":"noun","meaning_category":"furniture"}]}