{"word":"subprofessionally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"専門家としてではなく、専門的な水準に達していない方法で","english_definition":"In a manner that is less than professional; not up to professional standards.","examples":[{"sentence":"The task was completed subprofessionally, resulting in several errors.","translation":"その作業は専門的な水準に達していない方法で完了されたため、いくつかのエラーが発生した。"},{"sentence":"He handled the client's concerns subprofessionally, which damaged the company's reputation.","translation":"彼はクライアントの懸念を専門家らしくない方法で処理したため、会社の評判を損なった。"}],"collocations":["handle something subprofessionally","complete a task subprofessionally","perform an action subprofessionally"],"synonyms":["amateurishly","inexpertly","unskillfully","poorly","incompetently"],"antonyms":["professionally","expertly","skillfully","competently"]}],"etymology":{"value":"\"sub-\" (下位の、劣る) + \"professionally\" (専門的に)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsʌb.prəˈfeʃ.ən.əl.i/","syllables":"sub-pro-fes-sion-al-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"The adverb \"subprofessionally\" describes an action or behavior that falls short of the expected standards of a professional. It implies a lack of skill, competence, or adherence to professional ethics. It is often used to criticize or negatively evaluate someone's performance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted very subprofessional.","correct":"✓ He acted very subprofessionally.","note":"\"Subprofessional\" is an adjective, while \"subprofessionally\" is an adverb. Use the adverb to modify a verb (acted)."},{"incorrect":"✗ The work was done in a subprofessional manner.","correct":"✓ The work was done subprofessionally.","note":"While \"in a subprofessional manner\" is grammatically correct, using the adverb \"subprofessionally\" is more concise and direct."}],"priority":"★★☆"},"related_words":{"derivatives":["subprofessional (adjective, noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"subprofessionally\" is used to describe something done without the skill or care expected of a professional. It's a formal word that is not commonly used in everyday conversation. You would typically find it in contexts where professional standards are being discussed or evaluated."},"example_sentences":[{"sentence":"The report was written subprofessionally, with numerous grammatical errors and inconsistencies.","translation":"その報告書は専門家らしくない方法で書かれており、多数の文法的な誤りや矛盾があった。","type":"general","meaning_category":"manner of performance"},{"sentence":"The customer service representative handled the complaint subprofessionally, escalating the situation unnecessarily.","translation":"その顧客サービス担当者は苦情を専門家らしくない方法で処理し、不必要に状況を悪化させた。","type":"business","meaning_category":"business context"},{"sentence":"The website was designed subprofessionally, lacking basic usability features and a modern aesthetic.","translation":"そのウェブサイトは専門家らしくない方法で設計されており、基本的なユーザビリティ機能や現代的な美観が欠けていた。","type":"technology","meaning_category":"technology context"}]}