{"word":"vehicle-friendly","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"車両に優しい、車両に適した、車両が利用しやすい","english_definition":"Designed or suitable for use by vehicles, or easily accessible to vehicles.","examples":[{"sentence":"The new road is very vehicle-friendly, with wide lanes and smooth surfaces.","translation":"新しい道路は、広い車線と滑らかな表面で、非常に車両に優しい。"},{"sentence":"The city is trying to become more vehicle-friendly by improving parking facilities.","translation":"市は駐車施設を改善することで、より車両が利用しやすい都市になろうとしている。"},{"sentence":"This website is vehicle-friendly, allowing users to easily find information about cars and motorcycles.","translation":"このウェブサイトは車両に特化しており、ユーザーが車やバイクに関する情報を簡単に見つけられるようになっている。"}],"collocations":["vehicle-friendly road","vehicle-friendly design","vehicle-friendly city","vehicle-friendly website","vehicle-friendly infrastructure"],"synonyms":["car-friendly","auto-friendly","accessible to vehicles","easy for vehicles"],"antonyms":["pedestrian-friendly","bike-friendly","vehicle-unfriendly","inaccessible to vehicles"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"vehicle\" with \"friendly.\" It describes something that is designed or adapted to be easily used or accessed by vehicles.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈviːɪkəl ˈfrendli/","syllables":"ve-hi-cle-friend-ly"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than forming comparative and superlative degrees (more vehicle-friendly, most vehicle-friendly)."},"usage_notes":{"explanation":"\"Vehicle-friendly\" is used to describe environments, designs, or policies that are convenient or suitable for vehicles, particularly cars and motorcycles. It can refer to physical infrastructure like roads and parking, or to digital interfaces like websites. The term often implies a focus on the needs of vehicle users.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The park is vehicle-friendly for walking.","correct":"✓ The park is pedestrian-friendly for walking.","note":"\"Vehicle-friendly\" refers to vehicles, not pedestrians. Use \"pedestrian-friendly\" for walking areas."},{"incorrect":"✗ The city is vehicle-friendly, so it is hard to walk.","correct":"✓ The city is vehicle-friendly, so it may be less convenient for pedestrians.","note":"A vehicle-friendly environment may not be as convenient for pedestrians or cyclists."}],"priority":"★★☆"},"related_words":{"derivatives":["vehicle-friendliness (noun)"],"phrasal_verbs":[],"related_terms":["pedestrian-friendly","bike-friendly","eco-friendly","user-friendly","accessible","car-centric","transit-oriented development (antonym in urban planning context)"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency, but increasing with discussions about urban planning and transportation.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Vehicle-friendly' describes something designed to be easily used by cars and other vehicles. It's common in discussions about city planning, road design, and transportation policies. It suggests that the needs of drivers have been considered in the design or planning of something. It's the opposite of 'pedestrian-friendly' or 'bike-friendly', which focus on the needs of people walking or cycling. "},"example_sentences":[{"sentence":"The new highway is designed to be vehicle-friendly, reducing travel time for commuters.","translation":"新しい高速道路は車両に優しい設計で、通勤者の移動時間を短縮する。","type":"general","meaning_category":"Road Design"},{"sentence":"The website offers a vehicle-friendly interface for browsing car models.","translation":"そのウェブサイトは、車種を閲覧するための車両に優しいインターフェースを提供する。","type":"general","meaning_category":"Website Design"},{"sentence":"The city council is debating whether to make the downtown area more vehicle-friendly or pedestrian-friendly.","translation":"市議会は、ダウンタウンエリアをより車両に優しくするか、歩行者に優しくするかを議論している。","type":"general","meaning_category":"Urban Planning"}]}