{"word":"methysergide","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"メチルセルジド：片頭痛の予防に使用されるエルゴットアルカロイド誘導体","english_definition":"An ergot alkaloid derivative used for the prophylaxis of migraine headaches.","examples":[{"sentence":"Methysergide is effective in preventing migraine attacks.","translation":"メチルセルジドは片頭痛の発作を予防するのに効果的です。"},{"sentence":"Long-term use of methysergide can lead to retroperitoneal fibrosis.","translation":"メチルセルジドの長期使用は、後腹膜線維症を引き起こす可能性があります。"}],"collocations":["methysergide maleate","methysergide therapy","side effects of methysergide"],"synonyms":["Sansert","Deseril","ergot derivative"],"antonyms":[]}],"etymology":{"value":"合成語。methyl- + lysergic acid + -ide","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɛθɪˈsɜːrdʒaɪd/","syllables":"meth-y-ser-gide"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Methysergide is a prescription medication primarily used to prevent severe migraine and cluster headaches. Due to potential serious side effects, such as fibrosis, it is typically reserved for patients who do not respond to other treatments. Regular monitoring by a physician is crucial during methysergide therapy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ methysergide is a painkiller.","correct":"✓ methysergide is a prophylactic medication for migraines.","note":"Methysergide is not a painkiller; it's a preventative medication for migraines."}],"priority":"★★☆"},"related_words":{"derivatives":["ergotamine","dihydroergotamine","lysergic acid diethylamide (LSD)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Methysergide is a highly specialized term referring to a specific medication. Understanding its use requires knowledge of medical terminology and migraine treatment protocols. It is not a word commonly encountered outside of medical contexts."},"example_sentences":[{"sentence":"The doctor prescribed methysergide to prevent her debilitating migraines.","translation":"医師は彼女の衰弱性の片頭痛を予防するためにメチルセルジドを処方しました。","type":"noun","meaning_category":"medication"},{"sentence":"Patients on long-term methysergide therapy require regular monitoring for fibrosis.","translation":"メチルセルジドを長期的に使用している患者は、線維症の定期的なモニタリングが必要です。","type":"noun","meaning_category":"medication"}]}