{"word":"supplier-managed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"サプライヤー管理の、供給者主導の","english_definition":"Describes a system or inventory where the supplier is responsible for managing the inventory levels and replenishment at the customer's location.","examples":[{"sentence":"We're implementing a supplier-managed inventory system to reduce our carrying costs.","translation":"在庫維持費を削減するために、サプライヤー管理の在庫システムを導入しています。"},{"sentence":"Under the supplier-managed agreement, they monitor our usage and automatically replenish stock.","translation":"サプライヤー管理契約に基づき、彼らは私たちの使用状況を監視し、自動的に在庫を補充します。"}],"collocations":["supplier-managed inventory (SMI)","supplier-managed system","supplier-managed agreement"],"synonyms":["vendor-managed","VMI (Vendor Managed Inventory)"],"antonyms":["customer-managed","buyer-managed"]}],"etymology":{"value":"Combination of 'supplier' (one who supplies goods or services) and 'managed' (controlled or directed).","priority":"N/A"},"pronunciation":{"ipa":"/səˈplaɪər ˈmænɪdʒd/","syllables":"sup-pli-er-man-aged"},"inflection":{"notes":"Adjective; does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Supplier-managed' typically refers to a specific business arrangement where the supplier takes on the responsibility of managing the inventory at the customer's location. This is often done to improve efficiency, reduce costs, and ensure a consistent supply of goods. It's commonly used in manufacturing and retail industries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inventory is supplier managed by us.","correct":"✓ The inventory is supplier-managed by them.","note":"The supplier, not the customer, manages the inventory in a supplier-managed system."}],"priority":"★☆☆"},"related_words":{"derivatives":["supplier","manage","management","inventory"],"phrasal_verbs":["N/A"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low, specific to business/supply chain contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'supplier-managed' is a specialized term used in business and supply chain management. It describes a situation where the supplier, rather than the customer, is responsible for monitoring and replenishing inventory levels at the customer's location. Understanding this term requires familiarity with business and logistics concepts."},"example_sentences":[{"sentence":"The benefits of a **supplier-managed** inventory include reduced stockouts and lower inventory holding costs.","translation":"サプライヤー管理の在庫の利点には、在庫切れの削減と在庫維持費の削減が含まれます。","type":"adjective","meaning_category":"Definition"},{"sentence":"We are transitioning to a **supplier-managed** system to streamline our supply chain.","translation":"サプライチェーンを効率化するために、サプライヤー管理システムに移行しています。","type":"adjective","meaning_category":"Implementation"}]}