{"word":"regressions","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"回帰、退行、後退","english_definition":"The act of returning to a former state or condition. In statistics, a method of determining a relationship between variables.","examples":[{"sentence":"The patient showed signs of regression after a brief period of improvement.","translation":"患者は一時的な改善の後、退行の兆候を示した。"},{"sentence":"Regression analysis is used to predict future trends.","translation":"回帰分析は将来の傾向を予測するために使用される。"}],"collocations":["linear regression (線形回帰)","multiple regression (重回帰)","age regression (年齢退行)","regression to the mean (平均への回帰)"],"synonyms":["relapse","reversion","decline","deterioration"],"antonyms":["improvement","progression","advancement"]},{"part_of_speech":"noun","definition":"(精神分析)退行","english_definition":"(Psychoanalysis) A return to a former or less developed state.","examples":[{"sentence":"Under stress, he experiences regression to childhood behaviors.","translation":"ストレス下で、彼は子供時代の行動への退行を経験する。"}],"collocations":["ego regression (自我の退行)"],"synonyms":["reversion","relapse"],"antonyms":["progression"]}],"etymology":{"value":"From Latin 'regressionem' (nominative 'regressio'), meaning 'a returning, going back,' from past participle stem of 'regredi' meaning 'to go back, return,' from 're-' meaning 'back' + 'gradi' meaning 'to step, go.'","priority":"★★★"},"pronunciation":{"ipa":"/rɪˈɡreʃənz/","syllables":"re-gres-sions"},"inflection":{"noun_plural":"regressions"},"usage_notes":{"explanation":"'Regressions' is the plural form of 'regression'. It can refer to multiple instances of returning to a former state, or to different types or applications of regression analysis. In a medical or psychological context, it refers to a worsening of a condition or a return to earlier behaviors. In statistics, it refers to different regression models or analyses.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The regression was lead to a better outcome.","correct":"✓ The regression led to a worse outcome.","note":"Regression typically implies a decline or return to a less desirable state, so it usually leads to a worse outcome. If the outcome is better, use words like 'improvement' or 'progression'."},{"incorrect":"✗ He used regressions to improve his health.","correct":"✓ He used therapy to address his regressions.","note":"Regression is a state, not something you actively 'use' to improve health. Therapy or other interventions are used to address regressions."}],"priority":"★★☆"},"related_words":{"derivatives":["regress (verb)","regressive (adjective)"],"phrases":["regression analysis","linear regression","multiple regression","age regression"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, common in academic and technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'regressions' is a technical term used in fields like statistics, psychology, and medicine. It refers to the process of returning to a previous state, often a less developed or less desirable one. In statistics, it specifically refers to a method used to model the relationship between variables. Understanding this word requires familiarity with these specific contexts."},"example_sentences":[{"sentence":"The economy experienced several regressions during the recession.","translation":"景気後退の間、経済はいくつかの後退を経験した。","type":"noun","meaning_category":"後退"},{"sentence":"The therapist explored the patient's childhood regressions.","translation":"セラピストは患者の子供時代の退行を探求した。","type":"noun","meaning_category":"(精神分析)退行"},{"sentence":"The statistical software provides tools for various types of regressions.","translation":"統計ソフトウェアは、さまざまな種類の回帰分析のためのツールを提供する。","type":"noun","meaning_category":"回帰"}]}