{"word":"Issedones","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"イッセドネス族：古代中央アジアに居住していた遊牧民族。","english_definition":"An ancient people of Central Asia mentioned by Herodotus and other classical authors. Their exact location is uncertain, but they are generally believed to have lived in what is now Kazakhstan or southwestern Siberia.","examples":[{"sentence":"Herodotus described the Issedones as living beyond the Scythians.","translation":"ヘロドトスはイッセドネス族をスキタイ人のさらに奥地に住む民族として記述した。"},{"sentence":"The customs of the Issedones, as reported by ancient writers, were quite unusual.","translation":"古代の著述家によって伝えられたイッセドネス族の風習は非常に独特であった。"}],"collocations":["Issedonian customs","Issedonian territory","Herodotus on the Issedones"],"synonyms":["(related terms) Scythians","Sarmatians","Massagetae"],"antonyms":[]},{"part_of_speech":"proper noun","definition":"イッセドネス族の言語または文化","english_definition":"Relating to the language or culture of the Issedones.","examples":[{"sentence":"Little is known about the Issedonian language.","translation":"イッセドネス族の言語についてはほとんど知られていない。"},{"sentence":"Archaeological finds may shed light on Issedonian culture.","translation":"考古学的発見はイッセドネス族の文化を明らかにするかもしれない。"}],"collocations":["Issedonian language","Issedonian culture","Issedonian artifacts"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Ancient Greek Ἰσσηδόνες (Issēdónes). The origin of the name is unknown.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈsɛdəˌniːz/","syllables":"Is-se-do-nes"},"inflection":{"notes":"Plural form of the noun is \"Issedones\". Adjective form is \"Issedonian\"."},"usage_notes":{"explanation":"The Issedones are primarily known from the writings of Herodotus, who described some of their customs, including ritual cannibalism and unusual burial practices. However, the accuracy of these accounts is debated, and very little is definitively known about them. Their location is also uncertain, with various theories placing them in different parts of Central Asia.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Issedone was a city.","correct":"✓ The Issedones were a people.","note":"The Issedones were a nomadic people, not a city or a single person."}],"priority":"★★☆"},"related_words":{"derivatives":["Issedonian (adjective, relating to the Issedones)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Primarily found in historical or academic texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"Issedones\" is highly specialized and primarily encountered in historical or archaeological contexts related to ancient Central Asia. Understanding requires familiarity with classical sources like Herodotus and a general knowledge of the geography and cultures of the region during antiquity. It is unlikely to be encountered outside of academic or specialized reading materials."},"example_sentences":[{"sentence":"According to Herodotus, the Issedones practiced a unique form of ancestor worship.","translation":"ヘロドトスによれば、イッセドネス族は独特の祖先崇拝を行っていた。","type":"noun","meaning_category":"遊牧民族"},{"sentence":"Scholars debate the precise location of Issedonian settlements.","translation":"学者たちはイッセドネス族の居住地の正確な位置について議論している。","type":"adjective","meaning_category":"文化・言語"}]}