{"word":"Squalene","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"スクワレン：主にサメの肝油や植物油に含まれるトリテルペン炭化水素。保湿剤や医薬品の中間体として利用される。","english_definition":"A triterpene hydrocarbon mainly found in shark liver oil and vegetable oils; used as a moisturizer and as an intermediate in pharmaceuticals.","examples":[{"sentence":"Squalene is a natural lipid produced by the human body.","translation":"スクワレンは人体で生成される天然の脂質です。"},{"sentence":"Squalene is often used in cosmetics for its moisturizing properties.","translation":"スクワレンは保湿特性のため、化粧品によく使用されます。"},{"sentence":"Olive oil is a good source of squalene.","translation":"オリーブオイルはスクワレンの良い供給源です。"}],"collocations":["shark liver squalene (サメ肝油由来のスクワレン)","vegetable squalene (植物由来のスクワレン)","squalene oil (スクワレンオイル)","squalene synthase (スクワレンシンターゼ、スクワレン合成酵素)"],"synonyms":["isoprene derivative","triterpene"],"antonyms":[]},{"part_of_speech":"noun","definition":"(代替スペル) squaleneの異綴り","english_definition":"Alternative spelling of squalene.","examples":[],"collocations":[],"synonyms":["squalene"],"antonyms":[]}],"etymology":{"value":"The name 'squalene' is derived from 'Squalus,' the genus name for sharks, as it was first isolated from shark liver oil.","priority":"★★★"},"pronunciation":{"ipa":"/ˈskweɪliːn/","syllables":"Squa-lene"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Squalene is a naturally occurring oil found in plants, animals, and humans. It's often harvested from shark livers, although plant-derived squalene is becoming more common due to sustainability concerns. Squalene is a key component in the synthesis of cholesterol and steroid hormones in the body. In cosmetics, it acts as an emollient and moisturizer.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Squalene is a vitamin.","correct":"✓ Squalene is a lipid.","note":"Squalene is a type of oil (lipid), not a vitamin."},{"incorrect":"✗ Squalene is only found in sharks.","correct":"✓ Squalene is found in sharks, plants, and humans.","note":"While first discovered in shark liver oil, squalene is also present in vegetable oils and produced by the human body."}],"priority":"★★☆"},"related_words":{"derivatives":["squalane (スクワラン：スクワレンを水素化して安定化させたもの)","squalene synthase (スクワレンシンターゼ、スクワレン合成酵素)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Squalene' is a technical term primarily used in the context of chemistry, biology, cosmetics, and health. Understanding requires knowledge of organic compounds and their sources. While the word itself isn't overly complex, the concepts associated with it are more advanced."},"example_sentences":[{"sentence":"The concentration of squalene in olive oil varies depending on the olive variety and growing conditions.","translation":"オリーブオイル中のスクワレン濃度は、オリーブの品種や栽培条件によって異なります。","type":"noun","meaning_category":"スクワレン"},{"sentence":"Hydrogenation of squalene produces squalane, a more stable ingredient used in skincare products.","translation":"スクワレンを水素化すると、スキンケア製品に使用される、より安定した成分であるスクワランが生成されます。","type":"noun","meaning_category":"スクワレン"},{"sentence":"Researchers are investigating the potential health benefits of dietary squalene.","translation":"研究者たちは、食事性スクワレンの潜在的な健康上の利点を調査しています。","type":"noun","meaning_category":"スクワレン"}]}