{"word":"overfamed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"過大評価された、名声が高すぎる","english_definition":"Having a reputation or fame that is greater than deserved.","examples":[{"sentence":"The critic argued that the artist was overfamed and that their work did not warrant such widespread acclaim.","translation":"評論家は、そのアーティストは過大評価されており、彼らの作品はそのような広範な称賛に値しないと主張した。"},{"sentence":"While the author's earlier novels were excellent, their later works were overfamed due to their previous success.","translation":"その作家の初期の小説は素晴らしかったが、後の作品は以前の成功のために過大評価された。"}],"collocations":["overfamed artist","overfamed celebrity","overfamed work"],"synonyms":["overrated","undeservedly famous","overhyped"],"antonyms":["underrated","underappreciated","obscure"]}],"etymology":{"value":"Derived from 'over-' (excessively) and 'famed' (famous).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərˈfeɪmd/","syllables":"o-ver-famed"},"inflection":{"notes":"The word 'overfamed' is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Overfamed' is used to describe someone or something whose reputation exceeds their actual merit or quality. It implies that their fame is disproportionate to their talent or achievements.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The overfamed of the movie was its special effects.","correct":"✓ The overfamed aspect of the movie was its special effects.","note":"'Overfamed' is an adjective, so it should describe a noun. The correct usage would be 'overfamed aspect' or 'overfamed reputation'."}],"priority":"★☆☆"},"related_words":{"derivatives":["overpraise","overestimate","overvalue"],"related":["famous","famed","renowned","celebrated"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Overfamed' is a relatively uncommon word used to describe someone or something that is considered to be more famous or well-regarded than they deserve. It is often used in critical contexts to express skepticism about the level of recognition someone has received."},"example_sentences":[{"sentence":"Many critics believe that the band's latest album is overfamed and lacks originality.","translation":"多くの評論家は、そのバンドの最新アルバムは過大評価されており、独創性に欠けていると考えている。","type":"adjective","meaning_category":"過大評価された"},{"sentence":"The overfamed actor struggled to live up to the public's high expectations.","translation":"その過大評価された俳優は、世間の高い期待に応えるのに苦労した。","type":"adjective","meaning_category":"名声が高すぎる"}]}