{"word":"floorshifts","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(主にオンラインコミュニティで使われるスラング) 人がある特定の瞬間に経験するアイデンティティの急激な変化。特に、複数の人格を持つ人が、ある人格から別の人格へと移行する際に使われる。","english_definition":"(Primarily slang used in online communities) A sudden shift in identity experienced by a person at a specific moment, especially used when someone with multiple personalities transitions from one personality to another.","examples":[{"sentence":"During the role-playing session, I experienced a floorshift and my character's persona completely changed.","translation":"ロールプレイングのセッション中、私はフロアシフトを経験し、私のキャラクターの人格が完全に変わりました。"},{"sentence":"Some members of the community use the term 'floorshift' to describe the rapid changes in their online personas.","translation":"コミュニティのメンバーの中には、オンラインでのペルソナの急速な変化を説明するために「フロアシフト」という用語を使用する人もいます。"}],"collocations":["experience a floorshift","describe a floorshift","sudden floorshift","rapid floorshift"],"synonyms":["identity shift","persona change","character shift"],"antonyms":["identity stability","persona consistency"]}],"etymology":{"value":"「フロアシフト」という言葉は、文字通りには「床の移動」を意味しますが、この文脈では、人のアイデンティティや人格が、まるで床が突然移動するかのように、予期せず、そして急激に変化することを比喩的に表現しています。この用語は、主にオンラインコミュニティやロールプレイングゲームなどで、自己表現やアイデンティティの流動性を議論する際に使われることが多いです。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflɔːrʃɪfts/","syllables":"floor-shifts"},"inflection":{"noun_plural":"floorshifts"},"usage_notes":{"explanation":"「floorshifts」という言葉は、主にオンラインコミュニティやロールプレイングゲームの文脈で使用されるスラングです。これは、人が経験するアイデンティティや人格の急激な変化を指し、特に複数の人格を持つ人が、ある人格から別の人格へと移行する際に使われます。この用語は、自己表現やアイデンティティの流動性を議論する際に、比喩的な表現として用いられることが多いです。ただし、この言葉は専門的な心理学の用語ではなく、一般的な会話やフォーマルな文脈では適切ではない場合があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company experienced a floorshift in its management structure.","correct":"✓ The company experienced a restructuring in its management structure.","note":"「floorshift」は主に個人のアイデンティティの変化を指すスラングであり、組織構造の変化を指す言葉としては不適切です。組織構造の変化には「restructuring（再構築）」などの言葉を使用します。"},{"incorrect":"✗ He had a floorshift in his career and became a doctor.","correct":"✓ He had a career change and became a doctor.","note":"「floorshift」はアイデンティティの急激な変化を指すスラングであり、キャリアの変化を指す言葉としては不適切です。キャリアの変化には「career change（キャリアチェンジ）」などの言葉を使用します。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["alter ego","persona","identity","role-playing","online community","multiple personalities","dissociative identity disorder"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - スラングであり、一般的な語彙ではない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「floorshifts」は、主にオンラインコミュニティやロールプレイングゲームで使用されるスラングで、人のアイデンティティや人格が急激に変化することを指します。特に、複数の人格を持つ人が、ある人格から別の人格へと移行する際に使われることが多いです。この言葉は、自己表現やアイデンティティの流動性を議論する際に、比喩的な表現として用いられます。ただし、これは専門的な心理学の用語ではなく、一般的な会話やフォーマルな文脈では適切ではない場合があります。"},"example_sentences":[{"sentence":"During the online game, she described experiencing a floorshift as her character suddenly adopted a new accent and mannerisms.","translation":"オンラインゲーム中、彼女は自分のキャラクターが突然新しいアクセントと話し方を身につけたとき、フロアシフトを経験したと説明しました。","type":"noun","meaning_category":"アイデンティティの変化"},{"sentence":"The forum members often discuss their floorshifts and how they manage the changes in their online personas.","translation":"フォーラムのメンバーは、しばしばフロアシフトと、オンラインでのペルソナの変化をどのように管理するかについて議論します。","type":"noun","meaning_category":"アイデンティティの変化"},{"sentence":"He felt a floorshift coming on and excused himself from the conversation to regain control of his identity.","translation":"彼はフロアシフトが起こりそうだと感じ、アイデンティティを制御するために会話から離れました。","type":"noun","meaning_category":"アイデンティティの変化"}]}