{"word":"Sogdian","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ソグド語（古代イラン語の一種）","english_definition":"An extinct Eastern Iranian language formerly spoken in Sogdiana, in present-day Uzbekistan and Tajikistan.","examples":[{"sentence":"Sogdian was an important language along the Silk Road.","translation":"ソグド語はシルクロードにおいて重要な言語でした。"}],"collocations":["Sogdian language","Old Sogdian","Late Sogdian"],"synonyms":["none"],"antonyms":["none"]},{"part_of_speech":"adjective","definition":"ソグドの、ソグド語の","english_definition":"Relating to Sogdiana, its people, or their language.","examples":[{"sentence":"Sogdian merchants traded extensively throughout Central Asia.","translation":"ソグドの商人は中央アジア全域で広範囲に交易を行っていました。"},{"sentence":"The Sogdian script was derived from the Syriac alphabet.","translation":"ソグド文字はシリア文字から派生しました。"}],"collocations":["Sogdian art","Sogdian culture","Sogdian merchants","Sogdian script"],"synonyms":["none"],"antonyms":["none"]}],"etymology":{"value":"From Sogdiana, the ancient region where the language was spoken. The name Sogdiana comes from the Old Persian 'Suguda'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɒɡdiən/","syllables":"Sog-di-an"},"inflection":{"notes":"The noun does not have a plural form when referring to the language itself. The adjective does not change form."},"usage_notes":{"explanation":"'Sogdian' refers to both the language and things related to the region of Sogdiana. As a noun, it refers to the language. As an adjective, it describes things related to Sogdiana, such as its people, culture, or language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He speak Sogdian.","correct":"✓ He speaks Sogdian.","note":"When referring to someone speaking the language, remember to use the correct verb conjugation (third-person singular 'speaks')."},{"incorrect":"✗ Sogdian are a language.","correct":"✓ Sogdian is a language.","note":"'Sogdian' (the language) is a singular noun and takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["Sogdiana (noun: the historical region)","Sogd (short form, less common)"],"phrasal_verbs":["none"]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Sogdian' is a specialized term related to the history and linguistics of Central Asia. It is primarily used in academic or historical contexts when discussing the Sogdiana region, its people, or their language. Understanding the term requires some background knowledge of the Silk Road and ancient Iranian languages."},"example_sentences":[{"sentence":"The study of Sogdian texts has provided valuable insights into the history of the Silk Road.","translation":"ソグド語の文献の研究は、シルクロードの歴史に関する貴重な洞察を提供してきました。","type":"noun","meaning_category":"ソグド語"},{"sentence":"Sogdian merchants played a crucial role in facilitating trade between East and West.","translation":"ソグドの商人は、東西間の貿易を促進する上で重要な役割を果たしました。","type":"adjective","meaning_category":"ソグドの"}]}