{"word":"ocellicyst","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of sensory structure found in some invertebrates, typically consisting of a small, fluid-filled sac containing light-sensitive cells and often associated with a pigmented spot or lens.","english_definition":"A simple eye or light-sensitive organ found in some invertebrates.","examples":[{"sentence":"The planarian uses its ocellicysts to detect light and dark.","translation":"プラナリアは、その眼点を使って明暗を感知する。"},{"sentence":"The ocellicyst of the jellyfish is a simple structure compared to the compound eye of an insect.","translation":"クラゲの眼点は、昆虫の複眼と比較して単純な構造である。"}],"collocations":["detect light with ocellicysts","simple ocellicyst structure","jellyfish ocellicyst","planarian ocellicyst"],"synonyms":["eyespot","simple eye"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'ocellus' (small eye) and 'cyst' (sac or bladder), reflecting its structure as a small, eye-like structure enclosed in a sac.","priority":"★★☆"},"pronunciation":{"ipa":"/oʊˈsɛlɪsɪst/","syllables":"o-cel-li-cyst"},"inflection":{"noun_plural":"ocellicysts"},"usage_notes":{"explanation":"Ocellicysts are primitive light-sensing organs found in various invertebrates. They are not capable of forming detailed images but can detect the presence and direction of light, aiding in navigation and orientation. The term is primarily used in zoology and invertebrate biology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ocellicyst is a complex eye like that of a vertebrate.","correct":"✓ The ocellicyst is a simple light-sensitive organ.","note":"Ocellicysts are simple structures, not complex eyes. They lack the sophisticated features of vertebrate eyes."}],"priority":"★☆☆"},"related_words":{"derivatives":["ocellus (small eye)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'ocellicyst' refers to a specialized biological structure found in certain invertebrates. Understanding this term requires a background in zoology or invertebrate biology. It is not a commonly used word and is primarily encountered in scientific literature.","priority":"★☆☆"},"example_sentences":[{"sentence":"The flatworm uses its **ocellicyst** to move away from bright light.","translation":"その扁形動物は、その眼点を使って明るい光から逃れる。","type":"general","meaning_category":"general"},{"sentence":"Researchers studied the structure of the **ocellicyst** in the larval stage of the marine worm.","translation":"研究者たちは、その海洋性ワームの幼生段階における眼点の構造を研究した。","type":"research","meaning_category":"research"}]}