{"word":"Wymote","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A portmanteau of Wii and remote, referring to the Wii Remote, the primary controller for the Nintendo Wii console.","english_definition":"A nickname for the Wii Remote, the main controller of the Nintendo Wii video game console.","examples":[{"sentence":"Pass me the Wymote, I want to play some Wii Sports.","translation":"Wiiスポーツをやりたいから、Wymoteを取って。"}],"collocations":["Wymote battery","Wymote cover","Wymote games"],"synonyms":["Wii Remote","Wiimote"],"antonyms":[]}],"etymology":{"value":"A blend of \"Wii\" (the name of the console) and \"remote\" (referring to the controller's function).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwaɪmoʊt/","syllables":"Wy-mote"},"inflection":{"noun_plural":"Wymotes"},"usage_notes":{"explanation":"The term 'Wymote' is informal and primarily used by gamers familiar with the Nintendo Wii. It's less common in official contexts or outside of gaming communities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I controlled the game with a regular remote.","correct":"✓ I controlled the game with a Wymote.","note":"Use 'Wymote' specifically when referring to the Wii Remote, not just any remote control."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Wymote' is a specialized term used within the context of the Nintendo Wii gaming console. Understanding requires familiarity with gaming culture and portmanteau words. It's not a widely used term outside of this specific context."},"example_sentences":[{"sentence":"The Wymote's motion controls made the game very immersive.","translation":"Wymoteのモーションコントロールのおかげで、ゲームは非常に没入感がありました。","type":"noun","meaning_category":"Controller"},{"sentence":"We need to buy new batteries for the Wymotes before the party.","translation":"パーティーの前にWymoteの新しい電池を買う必要があります。","type":"noun","meaning_category":"Controller"}]}