{"word":"prosection","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(解剖学)解剖実習、解剖展示","english_definition":"A dissection or demonstration of a dissection, especially for teaching purposes.","examples":[{"sentence":"The medical students attended a prosection to study the anatomy of the human body.","translation":"医学生たちは人体解剖学を学ぶために解剖実習に参加した。"},{"sentence":"The prosection revealed the intricate network of nerves and blood vessels.","translation":"解剖実習で、神経と血管の複雑なネットワークが明らかになった。"},{"sentence":"The professor used a prosection to illustrate the surgical procedure.","translation":"教授は解剖実習を用いて外科手術の手順を説明した。"}],"collocations":["attend a prosection","perform a prosection","study a prosection","anatomical prosection"],"synonyms":["dissection","anatomy demonstration","anatomical preparation"],"antonyms":[],"notes":"Prosection is often used in medical education to provide students with a pre-dissected specimen for study."}],"etymology":{"value":"From Latin 'pro-' (before, in front) + 'sectio' (a cutting, dividing), from 'secare' (to cut).","priority":"★★★"},"pronunciation":{"ipa":"/proʊˈsɛkʃən/","syllables":"pro-sec-tion"},"inflection":{"noun_plural":"prosections"},"usage_notes":{"explanation":"A \"prosection\" is a prepared dissection, often used in medical or veterinary education. Unlike a dissection where students perform the cutting themselves, a prosection is pre-dissected by an instructor or experienced individual. This allows students to focus on studying the anatomical structures without the time constraints or potential errors of performing the dissection themselves. Prosections are valuable tools for learning anatomy and surgical techniques.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The student did a prosection on the cadaver.","correct":"✓ The student studied the prosection of the cadaver.","note":"Students typically study a prosection that has already been prepared, rather than performing it themselves. Performing the dissection is simply a dissection, not a prosection."}],"priority":"★★☆"},"related_words":{"derivatives":["prosector (noun: a person who prepares a prosection)"],"related_terms":["dissection","anatomy","cadaver","specimen"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Prosection\" refers to a dissection that has been prepared in advance, usually by an instructor, for students to study. It's a term mainly used in medical and veterinary education. The purpose of a prosection is to allow students to examine anatomical structures without having to perform the dissection themselves, saving time and reducing the risk of errors. It's a more specialized term than \"dissection.\""},"example_sentences":[{"sentence":"The veterinary students examined the **prosection** of the equine limb to identify the muscles and tendons.","translation":"獣医学生たちは、筋肉と腱を特定するために、馬の四肢の解剖実習を調べた。","type":"noun","meaning_category":"解剖実習"},{"sentence":"The **prosection** allowed the students to visualize the complex arrangement of the abdominal organs.","translation":"解剖実習により、学生たちは腹部臓器の複雑な配置を視覚化することができた。","type":"noun","meaning_category":"解剖実習"},{"sentence":"The anatomy lab featured several **prosections** of different body regions.","translation":"解剖学実習室には、さまざまな身体領域の解剖実習がいくつか展示されていた。","type":"noun","meaning_category":"解剖展示"}]}