{"word":"Loricoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Relating to or resembling the Loricariidae family of fish.","english_definition":"Relating to or resembling the Loricariidae family of fish, characterized by their armored bodies.","examples":[{"sentence":"The loricoid catfish are a diverse group of fish found in South America.","translation":"ロリカリア科のナマズは、南米に生息する多様な魚のグループです。"},{"sentence":"Loricoid morphology includes bony plates covering the body.","translation":"ロリカリア科の形態には、体を覆う骨板が含まれます。"}],"collocations":["loricoid catfish","loricoid morphology","loricoid body plan"],"synonyms":["armored","plated"],"antonyms":[]}],"etymology":{"value":"Derived from Loricariidae (the family name) + -oid (suffix meaning 'resembling'). Loricariidae comes from Loricaria, a genus within the family, which refers to the fish's armor-like appearance.","priority":"★★☆"},"pronunciation":{"ipa":"/lɒˈrɪkɔɪd/","syllables":"Lo-ri-coid"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically 'more loricoid' and 'most loricoid' respectively."},"usage_notes":{"explanation":"'Loricoid' is primarily used in ichthyology (the study of fish) to describe characteristics or features that are typical of or similar to those found in the Loricariidae family of catfish. It is a technical term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The loricoid is a type of fish.","correct":"✓ A loricoid catfish is a type of fish.","note":"'Loricoid' is an adjective, not a noun. Use it to describe something, like 'loricoid catfish'."}],"priority":"★★☆"},"related_words":{"derivatives":["Loricariidae (family name)","Loricaria (genus name)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. A specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Loricoid' is a specialized term used in the field of ichthyology to describe features related to the Loricariidae family of catfish. Due to its technical nature and limited usage outside of scientific contexts, it requires a high level of vocabulary and scientific knowledge to understand and use correctly."},"example_sentences":[{"sentence":"The fossil exhibits loricoid features, suggesting it may be related to modern armored catfish.","translation":"その化石はロリカリア科の特徴を示しており、現代の鎧を着たナマズに関連している可能性を示唆しています。","type":"adjective","meaning_category":"Relating to Loricariidae"},{"sentence":"Loricoid odontodes (small tooth-like structures) play a role in defense.","translation":"ロリカリア科の歯状突起（小さな歯のような構造）は防御の役割を果たします。","type":"adjective","meaning_category":"Relating to Loricariidae"}]}