{"word":"repertorial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"レパートリーの、レパートリーに関する","english_definition":"relating to a repertoire; consisting of or suitable for a repertoire.","examples":[{"sentence":"The company has a strong repertorial tradition.","translation":"その劇団は強力なレパートリーの伝統を持っている。"},{"sentence":"He is a repertorial actor, capable of playing many roles.","translation":"彼は多くの役を演じることができるレパートリー俳優だ。"}],"collocations":["repertorial company","repertorial theatre","repertorial actor","repertorial system"],"synonyms":["stock","standard","established"],"antonyms":["experimental","novel","unconventional"]}],"etymology":{"value":"\"Repertorial\" is derived from \"repertory,\" which comes from the Late Latin word \"repertorium,\" meaning a list or inventory.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛpərˈtɔːriəl/","syllables":"re-per-to-ri-al"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"\"Repertorial\" is primarily used in the context of theater or performing arts to describe something related to a repertoire. A repertoire is a collection of plays, operas, or other performances that a company or performer is prepared to present. It can also refer to the skills or abilities that someone possesses.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The repertorial music was very modern.","correct":"The repertoire included modern music.","note":"\"Repertorial\" describes something *related* to a repertoire, not the content of the repertoire itself. Use \"repertoire\" to describe the collection of works."}],"priority":"★☆☆"},"related_words":{"derivatives":["repertory (noun)","repertoire (noun)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"repertorial\" is a specialized term primarily used in the context of theater and performing arts. It describes something related to a \"repertory,\" which is a collection of works (plays, operas, etc.) that a company or performer is prepared to present. Understanding this term requires familiarity with the vocabulary of the performing arts."},"example_sentences":[{"sentence":"The repertorial system allows the theater to offer a variety of performances.","translation":"レパートリーシステムにより、劇場は多様な公演を提供できる。","type":"adjective","meaning_category":"レパートリーに関する"},{"sentence":"She has extensive repertorial knowledge of classical music.","translation":"彼女はクラシック音楽に関する幅広いレパートリーの知識を持っている。","type":"adjective","meaning_category":"レパートリーに関する"}]}