{"word":"whitefishery","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"The practice of illegally catching and selling fish, especially whitefish, that are under the legal size or caught out of season.","english_definition":"The illegal practice of catching and selling undersized or out-of-season whitefish.","examples":[{"sentence":"The authorities are cracking down on whitefishery in the lake.","translation":"当局は湖での違法な白身魚漁の取り締まりを強化している。"},{"sentence":"Whitefishery is a serious threat to the whitefish population.","translation":"違法な白身魚漁は、白身魚の個体数にとって深刻な脅威である。"}],"collocations":["illegal whitefishery","combat whitefishery","whitefishery activities"],"synonyms":["illegal fishing","poaching","fish poaching"],"antonyms":[]}],"etymology":{"value":"A compound word formed from \"whitefish\" (a type of fish) and \"fishery\" (the practice of catching fish), with the implication of illegal or unsustainable fishing practices targeting whitefish.","priority":"N/A"},"pronunciation":{"ipa":"/ˈwaɪtˌfɪʃəri/","syllables":"white-fish-er-y"},"inflection":{"noun_plural":"whitefisheries"},"usage_notes":{"explanation":"The term \"whitefishery\" specifically refers to the illegal or unsustainable fishing of whitefish species. It often involves catching fish that are too small to be legally harvested or fishing during closed seasons when the fish are spawning. This practice can have a detrimental impact on the whitefish population and the overall ecosystem.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["whitefish","fishery","fishing","poaching"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word \"whitefishery\" is a specialized term related to illegal fishing practices targeting whitefish. Understanding it requires knowledge of both \"whitefish\" (a type of fish) and \"fishery\" (the industry or activity of catching fish). The term is typically used in contexts discussing conservation, law enforcement, and the sustainability of fish populations."},"example_sentences":[{"sentence":"The investigation revealed a widespread network of whitefishery operations.","translation":"調査により、広範囲にわたる違法な白身魚漁業のネットワークが明らかになった。","type":"noun","meaning_category":"Illegal fishing of whitefish"},{"sentence":"Efforts to combat whitefishery include increased patrols and stricter penalties.","translation":"違法な白身魚漁業と闘うための取り組みには、パトロールの強化とより厳格な罰則が含まれる。","type":"noun","meaning_category":"Illegal fishing of whitefish"}]}