{"word":"concretionary","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"凝結物を含む、凝結性の","english_definition":"Relating to or characterized by concretions (masses or lumps of mineral matter formed by the accumulation or precipitation of mineral constituents).","examples":[{"sentence":"The rock formation displayed concretionary structures.","translation":"その岩石構造は凝結構造を示していた。"},{"sentence":"Concretionary nodules were found within the sedimentary layers.","translation":"凝結性の団塊が堆積層の中で見つかった。"}],"collocations":["concretionary structure","concretionary nodule","concretionary limestone"],"synonyms":["nodular","agglomerated","clotted"],"antonyms":["disaggregated","dispersed"]}],"etymology":{"value":"Derived from 'concretion,' which comes from the Latin 'con' (together) and 'crescere' (to grow).","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈkriːʃənɛri/","syllables":"con-cre-tion-ar-y"},"inflection":{"notes":"Adjective; no comparative or superlative forms."},"usage_notes":{"explanation":"'Concretionary' is primarily used in geological contexts to describe rocks, sediments, or other formations that contain or are characterized by concretions. Concretions are localized concentrations of minerals that have precipitated from solution within a rock or sediment, often forming rounded or irregular masses.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The concretionary process is when something becomes abstract.","correct":"✓ The concretionary process is when mineral matter accumulates to form concretions.","note":"'Concretionary' relates to the formation of mineral concretions, not abstraction."}],"priority":"★☆☆"},"related_words":{"derivatives":["concretion (noun): a mass or lump of mineral matter.","concretionally (adverb): in a manner relating to concretions."],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'concretionary' is a technical term primarily used in geology and related fields. It describes something that contains or is characterized by concretions, which are masses of mineral matter formed by accumulation or precipitation. Understanding this term requires familiarity with geological processes and vocabulary."},"example_sentences":[{"sentence":"The sandstone exhibited a distinct concretionary texture due to the presence of iron oxide nodules.","translation":"その砂岩は、酸化鉄の団塊の存在により、明瞭な凝結性の組織を示していた。","type":"adjective","meaning_category":"geology"},{"sentence":"The paleontologist identified several concretionary fossils within the shale formation.","translation":"古生物学者は、頁岩層の中でいくつかの凝結性の化石を特定した。","type":"adjective","meaning_category":"geology"}]}