{"word":"codifications","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"成文化、法典化、体系化","english_definition":"The act or process of arranging laws or rules into a systematic code; the result of such a process.","examples":[{"sentence":"The codification of customary laws is a complex undertaking.","translation":"慣習法の成文化は複雑な事業である。"},{"sentence":"The codifications of the company's policies ensured consistency.","translation":"会社の方針の体系化は一貫性を保証した。"}],"collocations":["legal codification","policy codification","systematic codification"],"synonyms":["systematization","arrangement","organization","classification","compilation"],"antonyms":["disorganization","chaos","ambiguity"]}],"etymology":{"value":"The word 'codification' is derived from the verb 'codify,' which comes from the Latin 'codex' (book) + '-fy' (to make). It refers to the process of arranging laws or rules into a code, resembling a book.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒdɪfɪˈkeɪʃənz/","syllables":"co-di-fi-ca-tions"},"inflection":{"noun_plural":"codifications"},"usage_notes":{"explanation":"'Codifications' refers to multiple instances or examples of codification, which is the process of organizing and systematizing laws, rules, or principles into a coherent code. It is often used in legal, administrative, and technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The codification was made but there were many codifications.","correct":"✓ The codification was made, but there were many amendments needed.","note":"'Codification' is a process, so using 'many codifications' might not always be appropriate. Consider using 'amendments' or 'revisions' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["codify (verb)","code (noun)","codified (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Codifications' is a formal term referring to instances where laws, rules, or principles have been systematically organized into a code. This term is most often used in legal, administrative, and technical contexts where the organization and systematization of information is crucial. Understanding this term requires familiarity with formal and technical vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The various codifications of environmental regulations aimed to streamline compliance.","translation":"環境規制の様々な成文化は、法令遵守を効率化することを目的としていた。","type":"noun","meaning_category":"成文化"},{"sentence":"Multiple codifications were necessary to address the evolving needs of the industry.","translation":"業界の進化するニーズに対応するために、複数の体系化が必要だった。","type":"noun","meaning_category":"体系化"},{"sentence":"The historical codifications of Roman law have influenced legal systems worldwide.","translation":"ローマ法の歴史的な法典化は、世界中の法制度に影響を与えてきた。","type":"noun","meaning_category":"法典化"}]}