{"word":"crackableness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"割れやすさ、ひびが入りやすさ、破壊されやすさ","english_definition":"The quality or state of being crackable; the ease with which something can be cracked or broken.","examples":[{"sentence":"The crackableness of the ice made it dangerous to walk on.","translation":"氷の割れやすさが、歩くのを危険にした。"},{"sentence":"The material's crackableness was a major concern for the engineers.","translation":"その材料の割れやすさは、エンジニアにとって大きな懸念事項だった。"},{"sentence":"The crackableness of the nuts varied depending on their freshness.","translation":"ナッツの割れやすさは、その新鮮さによって異なっていた。"}],"collocations":["high crackableness (高い割れやすさ)","low crackableness (低い割れやすさ)","degree of crackableness (割れやすさの度合い)","assess the crackableness (割れやすさを評価する)","improve crackableness (割れやすさを改善する)"],"synonyms":["fragility","brittleness","vulnerability","susceptibility to cracking","fracturability"],"antonyms":["durability","strength","resistance to cracking","robustness"]}],"etymology":{"value":"Derived from the word 'crackable,' which is formed by combining 'crack' (to break or split) with the suffix '-able' (capable of being). The suffix '-ness' is then added to 'crackable' to form the noun 'crackableness,' indicating the quality or state of being crackable.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrækəbəlnəs/","syllables":"crack-a-ble-ness"},"inflection":{"noun_plural":"crackablenesses (rarely used)"},"usage_notes":{"explanation":"'Crackableness' is a relatively uncommon noun that describes the extent to which something is easily cracked or broken. It is often used in technical or scientific contexts when discussing the properties of materials. While 'fragility' and 'brittleness' are similar terms, 'crackableness' specifically emphasizes the tendency to form cracks.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The crackableness of the vase was very.","correct":"✓ The crackableness of the vase was very high.","note":"'Crackableness' is a noun, so it needs to be modified by an adjective like 'high,' 'low,' or 'significant,' rather than an adverb like 'very.'"},{"incorrect":"✗ Due to the crackableness, it broke easily.","correct":"✓ Due to its crackableness, it broke easily.","note":"'Crackableness' is a noun, so it needs a possessive pronoun like 'its' to properly connect it to the rest of the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["crack (verb, noun)","crackable (adjective)","cracked (adjective)","cracking (verb, adjective, noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare, technical vocabulary)","frequency_google_ngram":"Extremely rare (not commonly found in general text)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Crackableness' is a technical term used to describe how easily something can be cracked or broken. It's not a word you'd hear in everyday conversation, but you might encounter it in scientific or engineering contexts when discussing the properties of materials. It's similar to 'fragility' or 'brittleness,' but specifically focuses on the tendency to develop cracks. Because it's a specialized term, it's considered advanced vocabulary."},"example_sentences":[{"sentence":"The research focused on reducing the crackableness of the new alloy.","translation":"その研究は、新しい合金の割れやすさを減らすことに焦点を当てていた。","type":"general","meaning_category":"割れやすさ"},{"sentence":"The high crackableness of the old paint made it difficult to restore the mural.","translation":"古い塗料の割れやすさが、壁画の修復を困難にした。","type":"technical","meaning_category":"割れやすさ"},{"sentence":"Engineers tested the concrete for its crackableness under different stress conditions.","translation":"エンジニアは、異なる応力条件下でのコンクリートの割れやすさを試験した。","type":"scientific","meaning_category":"割れやすさ"}]}