{"word":"Ambassador","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"大使","english_definition":"an accredited diplomat sent by a country as its official representative to a foreign country.","examples":[{"sentence":"The U.S. Ambassador to Japan is a key figure in diplomatic relations.","translation":"駐日アメリカ大使は、外交関係における重要な人物です。"},{"sentence":"She was appointed as the Ambassador to the United Nations.","translation":"彼女は国連大使に任命されました。"},{"sentence":"The ambassador hosted a reception at the embassy.","translation":"大使は大使館でレセプションを主催しました。"}],"collocations":["Ambassador to (国名)","U.S. Ambassador","appoint an ambassador","former ambassador","chief ambassador"],"synonyms":["diplomat","envoy","representative","delegate","minister"],"antonyms":[]}],"etymology":{"value":"The word \"ambassador\" comes from the Old Occitan word \"ambaisador,\" which in turn comes from \"ambais,\" meaning \"service, mission.\" This originates from the Gaulish word \"ambactos,\" meaning \"servant, vassal.\"","priority":"★★☆"},"pronunciation":{"ipa":"/æmˈbæsədər/","syllables":"am-bas-sa-dor"},"inflection":{"noun_plural":"Ambassadors"},"usage_notes":{"explanation":"An \"Ambassador\" is the highest-ranking diplomatic representative sent by one country to another. They represent their country's interests and work to maintain positive relations. The term is capitalized as it is a title.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a embassador.","correct":"✓ She is an ambassador.","note":"Use \"an\" before \"ambassador\" because it starts with a vowel sound."},{"incorrect":"✗ The embassador spoke about the importance of education.","correct":"✓ The ambassador spoke about the importance of education.","note":"Correct spelling is \"ambassador\"."}],"priority":"★★☆"},"related_words":{"derivatives":["Ambassadorial (adjective)","Embassy (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"Ambassador\" refers to a high-ranking official who represents their country in another country. It's used in formal contexts related to diplomacy and international relations. Understanding this word helps in comprehending news and discussions about foreign policy and international affairs."},"example_sentences":[{"sentence":"The Ambassador presented his credentials to the President.","translation":"大使は大統領に信任状を捧呈しました。","type":"noun","meaning_category":"diplomacy"},{"sentence":"The Ambassador worked to improve trade relations between the two countries.","translation":"大使は両国間の貿易関係を改善するために尽力しました。","type":"noun","meaning_category":"international relations"},{"sentence":"The Ambassador's residence is located near the city center.","translation":"大使公邸は市の中心部の近くに位置しています。","type":"noun","meaning_category":"government"}]}