{"word":"hounds-berry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語)イヌホオズキの実","english_definition":"(archaic) the fruit of the black nightshade (Solanum nigrum)","examples":[{"sentence":"The children were warned not to eat the hounds-berry.","translation":"子供たちはイヌホオズキの実を食べないように警告された。"}],"collocations":[],"synonyms":["black nightshade berry","Solanum nigrum fruit"],"antonyms":[]}],"etymology":{"value":"\"Hounds-berry\" is a folk etymology. The name likely derives from a corruption of an older term or a regional dialect. The 'hounds' part may be a reference to the plant's poisonous nature, associating it with something dangerous or undesirable.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈhaʊndzˌbɛri/","syllables":"hounds-ber-ry"},"inflection":{"noun_plural":"hounds-berries"},"usage_notes":{"explanation":"The term \"hounds-berry\" is archaic and rarely used in modern English. It specifically refers to the berries of the black nightshade plant, which are poisonous. The plant and its berries are more commonly referred to as \"black nightshade\" or \"Solanum nigrum\".","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a hounds-berry and felt great!","correct":"✓ I ate a black nightshade berry and felt sick.","note":"Hounds-berries (black nightshade berries) are poisonous and should not be eaten. If ingested, they can cause illness."}],"priority":"★☆☆"},"related_words":{"derivatives":["nightshade","black nightshade","Solanum nigrum"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Hounds-berry\" is an archaic and obscure term for the berries of the black nightshade plant. Due to its rarity, it is unlikely to be encountered outside of historical texts or specialized botanical contexts. Understanding this term requires a familiarity with obsolete vocabulary and knowledge of plant nomenclature."},"example_sentences":[{"sentence":"In old herbals, hounds-berry was sometimes mentioned for its medicinal properties, despite its toxicity.","translation":"古い薬草書では、イヌホオズキの実は、その毒性にもかかわらず、薬効があるとして言及されることがあった。","type":"noun","meaning_category":"イヌホオズキの実"}]}