{"word":"Spanish-Moorish","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"スペイン・ムーア様式の、スペインとムーアの文化が融合した","english_definition":"Relating to or characteristic of the architectural style that developed in Spain under Moorish influence, combining elements of both Spanish and Moorish cultures.","examples":[{"sentence":"The Alhambra palace is a stunning example of Spanish-Moorish architecture.","translation":"アルハンブラ宮殿は、スペイン・ムーア様式の建築の素晴らしい例です。"},{"sentence":"The city is known for its Spanish-Moorish tiles and intricate designs.","translation":"その都市は、スペイン・ムーア様式のタイルと複雑なデザインで知られています。"},{"sentence":"Many old buildings in Andalusia feature Spanish-Moorish elements.","translation":"アンダルシアの多くの古い建物は、スペイン・ムーア様式の要素を取り入れています。"}],"collocations":["Spanish-Moorish architecture","Spanish-Moorish design","Spanish-Moorish style","Spanish-Moorish influence"],"synonyms":["Moorish Revival","Neo-Moorish","Hispano-Moresque"],"antonyms":[]}],"etymology":{"value":"Combination of 'Spanish' (relating to Spain) and 'Moorish' (relating to the Moors, the Muslim inhabitants of Spain and North Africa during the Middle Ages).","priority":"★★★"},"pronunciation":{"ipa":"/ˌspænɪʃ ˈmʊərɪʃ/","syllables":"Span-ish-Moor-ish"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"The term 'Spanish-Moorish' is primarily used in the context of art, architecture, and design to describe the unique blend of Spanish and Moorish cultural influences. It specifically refers to the period of Moorish rule in Spain (Al-Andalus) and the subsequent artistic and architectural styles that emerged.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The building is Spanish and Moorish.","correct":"✓ The building is Spanish-Moorish.","note":"'Spanish-Moorish' as a single adjective describes a specific combined style, not just two separate influences. Using 'Spanish and Moorish' implies two distinct elements rather than a fusion."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Moorish","Spanish","Al-Andalus","Mudéjar","Islamic architecture","Reconquista"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'Spanish-Moorish' describes a specific style resulting from the historical interaction between Spanish and Moorish cultures, particularly in architecture and design. Understanding this term requires knowledge of Spanish and Moorish history and their cultural exchange. It is commonly used in art history, architecture, and cultural studies contexts."},"example_sentences":[{"sentence":"The intricate stucco work is characteristic of Spanish-Moorish craftsmanship.","translation":"その複雑な漆喰細工は、スペイン・ムーア様式の職人技の特徴です。","type":"example","meaning_category":"general"},{"sentence":"The Spanish-Moorish garden featured a central fountain and geometric patterns.","translation":"そのスペイン・ムーア様式の庭園は、中央の噴水と幾何学模様が特徴でした。","type":"example","meaning_category":"general"},{"sentence":"Many tourists visit the Spanish-Moorish palaces in southern Spain.","translation":"多くの観光客が、スペイン南部のスペイン・ムーア様式の宮殿を訪れます。","type":"example","meaning_category":"general"}]}