{"word":"keyboard-oriented","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"キーボード操作を中心とした、キーボード操作に特化した","english_definition":"Designed or optimized for use primarily with a keyboard, rather than a mouse or other input device.","examples":[{"sentence":"This software is keyboard-oriented, allowing users to perform most tasks without using a mouse.","translation":"このソフトウェアはキーボード操作に特化しており、ユーザーはマウスを使わずにほとんどのタスクを実行できます。"},{"sentence":"Keyboard-oriented shortcuts can significantly increase productivity for experienced users.","translation":"キーボード操作に特化したショートカットは、熟練したユーザーの生産性を大幅に向上させることができます。"},{"sentence":"Many developers prefer keyboard-oriented text editors for coding.","translation":"多くの開発者は、コーディングにキーボード操作に特化したテキストエディタを好みます。"}],"collocations":["keyboard-oriented software","keyboard-oriented shortcuts","keyboard-oriented interface","keyboard-oriented design"],"synonyms":["keyboard-centric","keyboard-focused"],"antonyms":["mouse-oriented","GUI-oriented","touch-oriented"]}],"etymology":{"value":"The term is formed by combining 'keyboard' (referring to the input device) with 'oriented' (meaning directed or focused towards).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkiːbɔːrd ˈɔːriˌɛntɪd/","syllables":"key-board o-ri-ent-ed"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Keyboard-oriented' describes systems, software, or interfaces that are designed to be efficiently used with a keyboard. This often involves extensive use of keyboard shortcuts and commands, minimizing the need for mouse interaction. It is commonly used in the context of software development, system administration, and other tasks where speed and precision are important.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is keyboard oriented.","correct":"✓ The program is keyboard-oriented.","note":"The hyphen is important to correctly form the compound adjective."},{"incorrect":"✗ He is a keyboard-oriented person.","correct":"✓ He prefers keyboard-oriented software.","note":"The term typically describes software or interfaces, not people."}],"priority":"★★☆"},"related_words":{"derivatives":["orientation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'keyboard-oriented' is used to describe software or systems that are designed to be used primarily with a keyboard. This means that most functions can be accessed using keyboard shortcuts rather than a mouse. It is a technical term that is most commonly used in the context of software development and computer usage. Understanding this term requires a familiarity with computer terminology."},"example_sentences":[{"sentence":"The new operating system has a more keyboard-oriented interface.","translation":"新しいオペレーティングシステムは、よりキーボード操作に特化したインターフェースを備えています。","type":"general","meaning_category":"design"},{"sentence":"Keyboard-oriented users often find command-line interfaces more efficient.","translation":"キーボード操作に慣れたユーザーは、コマンドラインインターフェースの方が効率的だと感じることがよくあります。","type":"general","meaning_category":"preference"},{"sentence":"The text editor is designed to be fully keyboard-oriented, reducing the need for mouse clicks.","translation":"そのテキストエディタは、完全にキーボード操作に特化するように設計されており、マウスをクリックする必要性を減らしています。","type":"specific","meaning_category":"design"}]}