{"word":"nonbroodiness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"抱卵性がないこと、子育てをしない性質","english_definition":"The state or quality of not being broody; lacking the inclination to incubate eggs or care for young.","examples":[{"sentence":"Selective breeding has resulted in increased egg production but also increased nonbroodiness in many domestic fowl.","translation":"選択的な育種は、卵の生産量を増加させたが、多くの家禽において抱卵性の低下ももたらした。"},{"sentence":"The nonbroodiness of certain chicken breeds makes them more suitable for commercial egg farming.","translation":"特定の鶏の品種の非抱卵性は、商業的な養鶏により適している。"}],"collocations":["increased nonbroodiness","genetic nonbroodiness","selective breeding for nonbroodiness"],"synonyms":["lack of broodiness","absence of broodiness","non-incubatory behavior"],"antonyms":["broodiness","incubatory behavior","maternal instinct"]},{"part_of_speech":"noun","definition":"（比喩的に）思い悩まないこと、くよくよしない性質","english_definition":"(Figurative) The state of not dwelling on negative thoughts or emotions; a lack of melancholy or introspection.","examples":[{"sentence":"Her nonbroodiness allowed her to quickly overcome setbacks and move forward.","translation":"彼女のくよくよしない性格のおかげで、すぐに挫折を乗り越えて前進することができた。"},{"sentence":"His natural nonbroodiness was a great asset in his high-pressure job.","translation":"彼の生まれつきのくよくよしない性格は、プレッシャーの大きい仕事において大きな強みとなった。"}],"collocations":["emotional nonbroodiness","mental nonbroodiness","natural nonbroodiness"],"synonyms":["optimism","cheerfulness","lightheartedness","resilience"],"antonyms":["brooding","melancholy","introspection","pessimism"]}],"etymology":{"value":"Derived from \"broodiness\" (the state of being broody, from \"brood\" meaning to sit on eggs to hatch them), with the addition of the prefix \"non-\" indicating negation or absence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈbruːdɪnəs/","syllables":"non-broo-di-ness"},"inflection":{"noun_plural":"nonbroodinesses (rarely used)"},"usage_notes":{"explanation":"\"Nonbroodiness\" primarily refers to the lack of maternal instinct in birds, particularly chickens, to incubate eggs. In a figurative sense, it can describe a person's tendency not to dwell on negative thoughts or emotions. The figurative usage is less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hen showed high nonbroodiness.","correct":"✓ The hen exhibited high nonbroodiness.","note":"Use \"exhibited\" or \"displayed\" with nonbroodiness, as it's a characteristic being observed."},{"incorrect":"✗ His nonbroodiness made him a bad parent.","correct":"✓ His lack of parental instinct made him a bad parent.","note":"When referring to human parenting, it's better to use \"lack of parental instinct\" or similar phrases, as \"nonbroodiness\" is primarily associated with birds."}],"priority":"★★☆"},"related_words":{"derivatives":["broodiness","broody","non-broody"],"antonyms":["broodiness"],"related_concepts":["maternal instinct","incubation","egg production","poultry farming","animal behavior","psychological resilience","emotional regulation"]},"level_frequency":{"CEFR":"C2 (Rare and specialized vocabulary)","frequency_google_ngram":"Very Low Frequency (Specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonbroodiness\" is a specialized term primarily used in the context of poultry farming and animal behavior. It refers to the absence of the instinct in birds, especially hens, to incubate eggs and care for their young. Figuratively, it can describe a person's tendency not to dwell on negative emotions, but this usage is less common. Understanding this word requires familiarity with the concept of \"broodiness\" and the prefix \"non-\". It is not a word commonly encountered in everyday language."},"example_sentences":[{"sentence":"The farmer selected hens for their nonbroodiness to ensure continuous egg production.","translation":"農家は継続的な卵の生産を確実にするために、抱卵性のない雌鶏を選んだ。","type":"noun","meaning_category":"Lack of incubation instinct"},{"sentence":"Her nonbroodiness was a key factor in her ability to handle stressful situations without becoming overwhelmed.","translation":"彼女のくよくよしない性格は、ストレスの多い状況に圧倒されることなく対処できる重要な要素だった。","type":"noun (figurative)","meaning_category":"Lack of negative dwelling"}]}