{"word":"dismemberment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"四肢切断、ばらばらにすること、身体の一部を切り離すこと","english_definition":"The act of cutting off someone's limbs; the act of dividing or tearing something into pieces.","examples":[{"sentence":"Dismemberment was a common punishment in some historical periods.","translation":"四肢切断は、歴史上の一部の時代において一般的な刑罰でした。"},{"sentence":"The dismemberment of the statue left it unrecognizable.","translation":"その像がばらばらにされたため、原型をとどめていませんでした。"},{"sentence":"The victim's dismemberment was a gruesome crime scene.","translation":"被害者の身体がバラバラにされた現場は、ぞっとするような犯罪現場だった。"}],"collocations":["act of dismemberment","gruesome dismemberment","ritual dismemberment","surgical dismemberment"],"synonyms":["mutilation","amputation","fragmentation","partitioning","severance"],"antonyms":["reassembly","unification","integration","connection","joining"]}],"etymology":{"value":"From dis- (apart) + member (limb). Literally, to take apart limb from limb.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈmɛmbərmənt/","syllables":"dis-mem-ber-ment"},"inflection":{"noun_plural":"dismemberments"},"usage_notes":{"explanation":"'Dismemberment' usually refers to the violent act of separating limbs from a body, either of a human or animal. It can also refer to the act of breaking something into pieces. The term often carries a negative connotation due to its association with violence and destruction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The dismemberment of the company was a good thing.","correct":"✓ The breakup of the company was a good thing.","note":"While 'dismemberment' can technically refer to breaking something into pieces, it is usually associated with violence. Use 'breakup', 'division', or 'fragmentation' for non-violent contexts."},{"incorrect":"✗ He suffered a dismemberment in the accident.","correct":"✓ He suffered a dismembering injury in the accident. / ✓ He suffered a limb amputation in the accident.","note":"'Dismemberment' is the act itself, not the injury. Use 'dismembering injury' or 'limb amputation' to describe the injury."}],"priority":"★★☆"},"related_words":{"derivatives":["dismember (verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dismemberment' is a formal and infrequent word that refers to the violent act of cutting or tearing off limbs or dividing something into pieces. It is often used in contexts involving crime, history, or graphic descriptions. Due to its graphic nature, it is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The historical accounts described the dismemberment of the defeated enemy.","translation":"その歴史的記録には、敗北した敵の四肢切断が記されていた。","type":"noun","meaning_category":"四肢切断"},{"sentence":"The dismemberment of the organization led to its eventual collapse.","translation":"その組織の解体は、最終的な崩壊につながった。","type":"noun","meaning_category":"ばらばらにすること"},{"sentence":"The archaeologist found evidence of ritual dismemberment at the ancient site.","translation":"考古学者は、その古代遺跡で儀式的な四肢切断の証拠を発見した。","type":"noun","meaning_category":"四肢切断"}]}