{"word":"karyotype","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"核型、染色体核型","english_definition":"the number and appearance of chromosomes in the nucleus of a eukaryotic cell, also refers to a laboratory technique that produces an image of an individual's chromosomes.","examples":[{"sentence":"The karyotype showed that the fetus had trisomy 21, indicating Down syndrome.","translation":"核型分析の結果、胎児が21トリソミーであることが示され、ダウン症候群であることが示唆された。"},{"sentence":"A karyotype analysis can help identify chromosomal abnormalities.","translation":"核型分析は、染色体異常の特定に役立つ。"},{"sentence":"The patient's karyotype was normal, ruling out certain genetic disorders.","translation":"患者の核型は正常であり、特定の遺伝性疾患が除外された。"}],"collocations":["karyotype analysis","normal karyotype","abnormal karyotype","chromosome karyotype","human karyotype"],"synonyms":["chromosome map","idiogram"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'karyon' (kernel, nucleus) and 'typos' (type, form).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkærioʊˌtaɪp/","syllables":"kar-i-o-type"},"inflection":{"noun_plural":"karyotypes"},"usage_notes":{"explanation":"A karyotype is a visual representation of an individual's chromosomes, arranged in a standardized format. It is used to identify chromosomal abnormalities, such as aneuploidy (abnormal number of chromosomes), translocations (exchange of chromosomal segments), deletions (loss of chromosomal segments), and inversions (reversal of chromosomal segments). Karyotyping is an important diagnostic tool in genetics and medicine, used in prenatal diagnosis, cancer diagnosis, and the investigation of infertility or developmental disorders.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The karyotype is when you look at genes.","correct":"✓ The karyotype is when you look at chromosomes.","note":"Karyotyping involves examining chromosomes, not individual genes. Genes are located within chromosomes."},{"incorrect":"✗ Karyotype is used to find mutations in DNA sequence.","correct":"✓ Karyotype is used to find chromosomal abnormalities.","note":"Karyotyping detects large-scale chromosomal abnormalities, not small-scale DNA sequence mutations, which require other techniques like DNA sequencing."}],"priority":"★★★"},"related_words":{"derivatives":["karyotyping"],"related_terms":["chromosome","genetics","genome","aneuploidy","trisomy","monosomy","deletion","translocation","inversion","cytogenetics"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, specialized term.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"A **karyotype** is a specialized term used in biology and medicine. It refers to a picture of someone's chromosomes arranged in order. Doctors and scientists use karyotypes to look for problems with the chromosomes, like having too many or too few, or if parts of the chromosomes are in the wrong place. It's like a map of the chromosomes that helps them find genetic issues. Understanding this term requires some background knowledge in genetics."},"example_sentences":[{"sentence":"The doctor ordered a karyotype to determine if the patient had any chromosomal abnormalities.","translation":"医師は、患者に染色体異常がないかどうかを判断するために、核型分析を指示した。","type":"general"},{"sentence":"The karyotype revealed that the child had an extra copy of chromosome 21.","translation":"核型分析の結果、その子供には21番染色体が1本多いことが判明した。","type":"specific"},{"sentence":"Karyotyping is a standard procedure in prenatal genetic screening.","translation":"核型分析は、出生前遺伝子スクリーニングにおける標準的な手順である。","type":"technical"}]}