{"word":"Quadratures","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"求積法","english_definition":"A numerical method for approximating the definite integral of a function.","examples":[{"sentence":"Quadratures are used to approximate integrals when an analytical solution is not available.","translation":"求積法は、解析的な解が得られない場合に積分を近似するために使用されます。"}],"collocations":["Gaussian quadrature","numerical quadrature"],"synonyms":["Numerical integration"],"antonyms":[]}],"etymology":{"value":"From Latin 'quadratura', meaning 'squaring'. Historically, it refers to finding a square with the same area as a given shape, which is related to finding the area under a curve.","priority":"中"},"pronunciation":{"ipa":"/ˈkwɒdrətʃərz/","syllables":"quad-ra-tures"},"inflection":{"noun_plural":"quadratures"},"usage_notes":{"explanation":"'Quadratures' refers specifically to numerical methods for approximating definite integrals. It is often used in scientific computing and engineering.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"Quadrature is a type of geometry.","correct":"Quadrature is a numerical method for integration.","note":"Quadrature is related to integration, not geometry."}],"priority":"中"},"related_words":{"derivatives":["quadrature","Gaussian quadrature","numerical integration"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低","priority":"低"},"readability_explanation":{"level":"C1","text":"'Quadratures' is a technical term used in mathematics and numerical analysis, specifically referring to numerical methods for approximating definite integrals. It is commonly encountered in advanced scientific and engineering contexts where analytical solutions to integrals are not available. Understanding this term requires familiarity with calculus and numerical methods."},"example_sentences":[{"sentence":"Gaussian quadratures provide high accuracy with fewer evaluation points.","translation":"ガウス求積法は、より少ない評価点で高い精度を提供します。","type":"general","meaning_category":"求積法"},{"sentence":"The software uses adaptive quadratures to handle complex integrals.","translation":"そのソフトウェアは、複雑な積分を処理するために適応的な求積法を使用します。","type":"technical","meaning_category":"求積法"}]}