{"word":"hazel-hen","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヨーロッパ産の小型のキジ科の鳥、エゾライチョウ","english_definition":"A small grouse (Bonasa bonasia) of temperate and subarctic Europe and Asia, characterized by its mottled brown plumage and preference for hazel-dominated forests.","examples":[{"sentence":"The hazel-hen is a shy bird, often heard but rarely seen in the dense undergrowth.","translation":"エゾライチョウは臆病な鳥で、茂みの中で鳴き声はよく聞こえるが見かけることは稀だ。"},{"sentence":"Conservation efforts are underway to protect the habitat of the hazel-hen.","translation":"エゾライチョウの生息地を保護するための保全活動が進められている。"}],"collocations":["hazel-hen habitat","hazel-hen population","hazel-hen conservation"],"synonyms":["grouse","Bonasa bonasia"],"antonyms":[]}],"etymology":{"value":"'Hazel' refers to the bird's preference for hazel forests, and 'hen' is a general term for a female bird.","priority":"★★★"},"pronunciation":{"ipa":"/ˈheɪzəlˌhɛn/","syllables":"ha-zel-hen"},"inflection":{"noun_plural":"hazel-hens"},"usage_notes":{"explanation":"The term 'hazel-hen' specifically refers to the *Bonasa bonasia* species. It is a relatively uncommon term in general English, more often used in ornithology or conservation contexts.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":["hazel","hen"],"related_species":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hazel-hen' is a specialized term used primarily in the context of ornithology or wildlife conservation, referring to a specific species of grouse. Understanding of this term requires familiarity with bird species and ecological concepts."},"example_sentences":[{"sentence":"The forest provides ideal cover for the elusive hazel-hen.","translation":"その森は、なかなか姿を見せないエゾライチョウにとって理想的な隠れ場所となる。","type":"noun","meaning_category":"鳥"},{"sentence":"Researchers are studying the breeding habits of the hazel-hen in this region.","translation":"研究者たちはこの地域におけるエゾライチョウの繁殖習性を研究している。","type":"noun","meaning_category":"鳥"}]}