{"word":"non-reaction-induced","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"(化学、医学などで)反応によって引き起こされない、反応誘発性ではない","english_definition":"Not caused or induced by a reaction; not resulting from a reaction.","examples":[{"sentence":"The material is designed to be non-reaction-induced, ensuring stability in various environments.","translation":"その材料は、さまざまな環境での安定性を確保するために、非反応誘発性になるように設計されています。"},{"sentence":"We observed non-reaction-induced changes in the sample's properties.","translation":"サンプル特性における非反応誘発性の変化を観察しました。"}],"collocations":["non-reaction-induced change","non-reaction-induced degradation","non-reaction-induced process"],"synonyms":["reaction-independent","non-reactive","inert"],"antonyms":["reaction-induced","reactive"],"notes":"This term is primarily used in scientific and technical contexts, such as chemistry, materials science, and medicine."}],"etymology":{"value":"Formed by adding the prefix 'non-' to 'reaction-induced'.","priority":"low"},"pronunciation":{"ipa":"/ˌnɒn.riˈæk.ʃən ɪnˈdjuːst/","syllables":"non-re-ac-tion in-duced"},"inflection":{"notes":"Adjectives do not inflect in English, but this can be modified by adverbs such as 'more' or 'less'"},"usage_notes":{"explanation":"This term is used to describe phenomena, processes, or materials that do not undergo changes or are not created as a result of a chemical or physical reaction. It's often used to emphasize the stability or inertness of something in a reactive environment.","priority":"low"},"common_mistakes":{"examples":[{"incorrect":"The nonreaction induced material.","correct":"The non-reaction-induced material.","note":"Hyphens are important for clarity in compound adjectives."}],"priority":"low"},"related_words":{"derivatives":["reaction","induced"],"related_terms":["reaction-induced","reactionless"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in technical and scientific literature.","priority":"low"},"readability_explanation":{"level":"C2","text":"This term is highly specialized and technical, primarily used in scientific and engineering fields. It describes something that does not result from a reaction. Understanding requires knowledge of scientific terminology. "},"example_sentences":[{"sentence":"The experiment aimed to isolate the non-reaction-induced effects on the cell culture.","translation":"その実験は、細胞培養に対する非反応誘発性の影響を分離することを目的としていました。","type":"technical","meaning_category":"not caused by a reaction"},{"sentence":"The polymer's non-reaction-induced stability makes it suitable for high-temperature applications.","translation":"そのポリマーの非反応誘発性の安定性により、高温用途に適しています。","type":"technical","meaning_category":"not caused by a reaction"}]}