{"word":"anisometropia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"不同視","english_definition":"A condition in which the two eyes have unequal refractive power.","examples":[{"sentence":"Anisometropia can cause blurred vision and headaches.","translation":"不同視は、視力低下や頭痛を引き起こす可能性があります。"},{"sentence":"The doctor diagnosed her with anisometropia after a comprehensive eye exam.","translation":"医師は、包括的な眼科検査の後、彼女を不同視と診断しました。"}],"collocations":["correct anisometropia (不同視を矯正する)","diagnose anisometropia (不同視を診断する)","treat anisometropia (不同視を治療する)","anisometropia correction (不同視矯正)","high anisometropia (高度不同視)","mild anisometropia (軽度不同視)"],"synonyms":["unequal refraction","refractive error difference"],"antonyms":["isometropia (等屈折)"],"notes":"Anisometropia is often corrected with glasses or contact lenses. In some cases, surgery may be an option."}],"etymology":{"value":"From Greek 'aniso-' (unequal) + 'metron' (measure) + 'opia' (vision).","priority":"★★★"},"pronunciation":{"ipa":"/ˌænˌaɪsoʊməˈtroʊpiə/","syllables":"an-i-so-me-tro-pi-a"},"inflection":{"noun_plural":"anisometropias"},"usage_notes":{"explanation":"Anisometropia refers to a significant difference in the refractive error between the two eyes. This means that one eye may be nearsighted (myopic), farsighted (hyperopic), or have astigmatism, while the other eye has a different refractive error or normal vision. The condition can lead to various visual problems, including blurred vision, double vision, headaches, and eye strain. In children, uncorrected anisometropia can sometimes lead to amblyopia (lazy eye) in the eye with the higher refractive error.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has anisometropia in one eye.","correct":"✓ He has anisometropia.","note":"Anisometropia, by definition, affects both eyes, creating a difference *between* them. It's redundant to say 'in one eye'."},{"incorrect":"✗ Anisometropia is when your eyes are the same.","correct":"✓ Anisometropia is when your eyes are different.","note":"Anisometropia means *different* refractive power in each eye. The opposite (same refractive power) is isometropia."}],"priority":"★★☆"},"related_words":{"derivatives":["anisometropic (adjective)"],"other_related_terms":["ametropia (屈折異常)","myopia (近視)","hyperopia (遠視)","astigmatism (乱視)","amblyopia (弱視)","refraction (屈折)","diopter (ジオプター)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Technical/Medical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anisometropia' is a medical term describing a condition where the eyes have different refractive powers, meaning each eye needs a different prescription for optimal vision. This difference can lead to visual discomfort and other eye problems. Diagnosis and correction are typically managed by an eye care professional."},"example_sentences":[{"sentence":"Early detection of anisometropia in children is crucial to prevent amblyopia.","translation":"小児期の不同視の早期発見は、弱視を防ぐために重要です。","type":"general"},{"sentence":"The patient's anisometropia was corrected with customized contact lenses.","translation":"患者の不同視は、カスタムコンタクトレンズで矯正されました。","type":"treatment"},{"sentence":"Severe anisometropia can cause significant depth perception issues.","translation":"重度の不同視は、深刻な奥行き知覚の問題を引き起こす可能性があります。","type":"symptoms"}]}