{"word":"Slavocrat","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"奴隷制擁護論者、特にアメリカ合衆国において奴隷制の拡大を支持した者","english_definition":"an advocate of slavery, especially in the United States, who supported the expansion of slavery into new territories.","examples":[{"sentence":"The term 'Slavocrat' was used to criticize those who sought to expand slavery in the pre-Civil War United States.","translation":"「Slavocrat」という言葉は、南北戦争前の米国で奴隷制の拡大を求めた人々を批判するために使われた。"},{"sentence":"Slavocrats believed that the Southern economy depended on the institution of slavery.","translation":"奴隷制擁護論者は、南部経済は奴隷制の制度に依存していると信じていた。"}],"collocations":["Southern Slavocrat","pro-slavery advocate","expansionist Slavocrat"],"synonyms":["pro-slavery advocate","slavery apologist","defender of slavery"],"antonyms":["abolitionist","anti-slavery activist"]}],"etymology":{"value":"'Slavo-' (from 'slave' or 'slavery') + '-crat' (from '-cracy', meaning rule or power). Coined in the mid-19th century in the United States to describe those who held power and advocated for the continuation and expansion of slavery.","priority":"★★☆"},"pronunciation":{"ipa":"ˈsleɪvəˌkræt","syllables":"sla-vo-crat"},"inflection":{"noun_plural":"Slavocrats"},"usage_notes":{"explanation":"The term 'Slavocrat' is primarily historical, referring to a specific group of people in the United States before the Civil War. It is rarely used in contemporary contexts, except when discussing this historical period. The term carries a strong negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a slavocrat who fought for civil rights.","correct":"✓ He was a politician from the South during the pre-Civil War era.","note":"'Slavocrat' is strongly associated with the defense and expansion of slavery, so it would be contradictory to associate it with someone who fought for civil rights. It's better to describe the person's role more neutrally."}],"priority":"★☆☆"},"related_words":{"derivatives":["Slavocracy (noun: rule by slaveholders)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Historical term)","frequency_google_ngram":"Low frequency (historical term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Slavocrat' is a historical term used to describe individuals who advocated for the expansion of slavery in the United States before the Civil War. It is a complex term that requires an understanding of American history and the debates surrounding slavery. Due to its specialized and historical nature, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The newspapers of the time often used the term 'Slavocrat' to denounce politicians who supported the Confederacy.","translation":"当時の新聞は、しばしば「Slavocrat」という言葉を使って、南部連合を支持する政治家を非難した。","type":"noun","meaning_category":"historical"},{"sentence":"Historians debate the extent to which Slavocrats controlled the political agenda of the antebellum South.","translation":"歴史家たちは、奴隷制擁護論者が南北戦争前の南部の政治的議題をどの程度支配していたかについて議論している。","type":"noun","meaning_category":"historical"}]}