{"word":"brown-maned","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"たてがみが茶色の","english_definition":"having a brown mane (the long hair on the back of the neck of a horse, lion, etc.)","examples":[{"sentence":"The painting depicted a proud, brown-maned stallion.","translation":"その絵は誇らしげな茶色のたてがみの雄馬を描いていた。"},{"sentence":"We spotted a brown-maned lion resting in the shade.","translation":"日陰で休んでいる茶色のたてがみのライオンを見つけた。"}],"collocations":["brown-maned horse","brown-maned lion","brown-maned stallion"],"synonyms":["brown-haired (when referring to humans)"],"antonyms":[]}],"etymology":{"value":"Compound word formed from 'brown' (referring to the color) and 'maned' (having a mane).","priority":"★★★"},"pronunciation":{"ipa":"/ˌbraʊn ˈmeɪnd/","syllables":"brown-maned"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"This term is primarily descriptive, used to specify the color of the mane of an animal, most commonly horses and lions. It is not frequently used in everyday conversation but may appear in literature, animal descriptions, or scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The brown-mained horse.","correct":"✓ The brown-maned horse.","note":"'Maned' refers to having a mane, not 'mained'."}],"priority":"★★☆"},"related_words":{"derivatives":["mane (noun): the long hair on the back of the neck of a horse, lion, etc.","brown (adjective): of a color produced by mixing red, yellow, and blue or green"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Low frequency)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'brown-maned' is a descriptive adjective that combines the color 'brown' with the characteristic of having a 'mane.' It is used to describe animals, typically horses or lions, with a brown-colored mane. Due to its specific and descriptive nature, it is not commonly used in everyday conversation but is more likely to be found in written descriptions, literature, or specialized contexts related to animals."},"example_sentences":[{"sentence":"The wild mustang was easily identifiable by its striking brown-maned appearance.","translation":"その野生のムスタングは、印象的な茶色のたてがみの外見で容易に識別できた。","type":"adjective","meaning_category":"description"},{"sentence":"The artist carefully rendered the details of the brown-maned lion in his wildlife painting.","translation":"そのアーティストは、野生動物の絵の中で茶色のたてがみのライオンの細部を注意深く描写した。","type":"adjective","meaning_category":"description"}]}