{"word":"Perlite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"パーライト（真珠岩）：火山ガラスを高温で焼成して多孔質にしたもの。園芸用土壌改良材や断熱材として使用される。","english_definition":"A volcanic glass that expands when heated, creating a lightweight, porous material used for horticultural and insulation purposes.","examples":[{"sentence":"Perlite is often added to potting soil to improve drainage and aeration.","translation":"パーライトは、排水性と通気性を向上させるためによく鉢植えの土に添加されます。"},{"sentence":"The insulation in the walls is made of perlite.","translation":"壁の断熱材はパーライトでできています。"}],"collocations":["horticultural perlite (園芸用パーライト)","expanded perlite (発泡パーライト)","perlite insulation (パーライト断熱材)"],"synonyms":["expanded volcanic glass","horticultural grit"],"antonyms":[]}],"etymology":{"value":"フランス語の 'perle' (真珠) に由来し、その真珠のような光沢から名付けられた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɜːrlaɪt/","syllables":"Per-lite"},"inflection":{"noun_plural":"perlites"},"usage_notes":{"explanation":"Perlite is a generic term for a naturally occurring volcanic glass that has a high water content. It is expanded by heating to 850–900 °C (1,560–1,650 °F), at which point it expands 4–20 times its original volume. The expanded material is lightweight and porous, making it useful in horticulture for improving soil aeration and drainage, and in construction as insulation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to buy perlites for my plants.","correct":"✓ I need to buy perlite for my plants.","note":"Perlite is usually used as an uncountable noun, so the plural form is less common unless referring to different types or grades of perlite."}],"priority":"★☆☆"},"related_words":{"derivatives":["perlitic (形容詞: パーライト状の)"],"related_terms":["vermiculite (バーミキュライト：同様の園芸用土壌改良材)","pumice (軽石：同様の多孔質火山岩)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2 (専門的な文脈で使われる)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"Perlite is a specialized term referring to a type of volcanic glass that expands when heated. It is primarily used in gardening to improve soil drainage and aeration, and in construction as insulation. Due to its specific applications, it is not a commonly used word in everyday conversation, but understanding its meaning is helpful in contexts related to horticulture and building materials."},"example_sentences":[{"sentence":"The gardener mixed perlite with the soil to help the plants grow better.","translation":"庭師は植物の成長を助けるために、パーライトを土に混ぜました。","type":"noun","meaning_category":"園芸用土壌改良材"},{"sentence":"Perlite is an effective and lightweight insulation material.","translation":"パーライトは効果的で軽量な断熱材です。","type":"noun","meaning_category":"断熱材"}]}