{"word":"unemboweled","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(古風)内臓を取り除かれていない","english_definition":"(archaic) Not having had the entrails removed; with the bowels still inside.","examples":[{"sentence":"The unemboweled carcass lay on the battlefield.","translation":"内臓を取り除かれていない死骸が戦場に横たわっていた。"}],"collocations":[],"synonyms":["eviscerate (opposite)","disemboweled (opposite)"],"antonyms":["emboweled"],"notes":"This word is primarily found in historical or literary contexts."}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the past participle 'emboweled'. 'Embowel' means to remove the bowels or entrails from a body.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪmˈbaʊəld/","syllables":"un-em-bow-eled"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have plural forms."},"usage_notes":{"explanation":"The word 'unemboweled' is relatively rare and primarily used in historical or literary contexts to describe a body that has not been eviscerated (had its entrails removed). It is the direct opposite of 'emboweled' or 'disemboweled'.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["embowel (verb)","disembowel (verb)","embowelment (noun)","disembowelment (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unemboweled' is a highly uncommon word, primarily encountered in historical texts or literature dealing with graphic descriptions of violence or death. It simply means 'not having had the entrails removed'. Due to its rarity and specific context, it is not part of general vocabulary. Understanding the root word 'embowel' (to remove the entrails) is helpful in deciphering its meaning."},"example_sentences":[{"sentence":"The historian described the gruesome scene, noting the unemboweled bodies of the slain soldiers.","translation":"歴史家は、殺された兵士たちの内臓を取り除かれていない遺体について言及し、そのぞっとする光景を描写した。","type":"descriptive","meaning_category":"descriptive"}]}