{"word":"fortune-hunting","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"財産目当ての結婚、金持ち漁り","english_definition":"The act of seeking to marry a wealthy person in order to gain their fortune.","examples":[{"sentence":"Her family accused him of fortune-hunting when they learned of his engagement to their daughter.","translation":"彼が彼女たちの娘と婚約したことを知ったとき、彼女の家族は彼を財産目当てだと非難した。"},{"sentence":"The novel explores the themes of love, ambition, and fortune-hunting in high society.","translation":"その小説は、上流社会における愛、野心、そして金持ち漁りというテーマを探求している。"}],"collocations":["go fortune-hunting","accuse someone of fortune-hunting","fortune-hunting scheme"],"synonyms":["gold digging","opportunistic marriage","mercenary pursuit of wealth"],"antonyms":["marrying for love","altruistic relationship"]},{"part_of_speech":"adjective","definition":"財産目当ての、金持ち漁りの","english_definition":"Seeking to marry a wealthy person in order to gain their fortune.","examples":[{"sentence":"He was portrayed as a fortune-hunting social climber in the tabloids.","translation":"彼はタブロイド紙で財産目当ての成り上がり者として描かれた。"},{"sentence":"She rejected his advances, suspecting his fortune-hunting motives.","translation":"彼女は彼の財産目当ての動機を疑い、彼の求愛を拒絶した。"}],"collocations":["fortune-hunting motives","fortune-hunting scheme","fortune-hunting husband/wife"],"synonyms":["gold-digging","opportunistic","mercenary"],"antonyms":["loving","altruistic"]}],"etymology":{"value":"The term is a compound word formed from \"fortune\" (wealth, riches) and \"hunting\" (the act of seeking or pursuing). It literally means \"seeking fortune,\" but specifically refers to the pursuit of wealth through marriage.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɔːrtʃənˌhʌntɪŋ/","syllables":"for-tune-hunt-ing"},"inflection":{"notes":"The word does not change form based on grammatical context. It is used as is for both singular and plural nouns, and as an adjective."},"usage_notes":{"explanation":"\"Fortune-hunting\" typically carries a negative connotation, implying that the person is primarily interested in the wealth of their partner rather than genuine love or affection. It is often used in the context of social commentary or criticism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is fortune hunt.","correct":"✓ He is a fortune hunter.","note":"The correct noun form for a person who engages in fortune-hunting is \"fortune hunter.\" \"Fortune hunt\" is not a standard term."},{"incorrect":"✗ She is fortune-hunting for love.","correct":"✓ She is fortune-hunting for money.","note":"Fortune-hunting is specifically about seeking wealth, not love. If someone is seeking love, the term is not appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["fortune hunter (noun: a person who seeks wealth through marriage)"],"phrasal_verbs":[],"synonyms":["gold digger","social climber","opportunist","mercenary"],"antonyms":["philanthropist","altruist","lover"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"fortune-hunting\" describes the act of trying to marry someone rich primarily for their money. It's often used in stories or discussions about social class and relationships where someone's main goal is to gain wealth through marriage, rather than love. It's a more complex term, so you'll likely encounter it in advanced reading or discussions."},"example_sentences":[{"sentence":"Many novels depict characters engaged in **fortune-hunting** in the Victorian era.","translation":"多くの小説が、ヴィクトリア朝時代に財産目当ての結婚に奔走する人々を描いている。","type":"noun","meaning_category":"財産目当ての結婚"},{"sentence":"The press often criticized her for her perceived **fortune-hunting** behavior.","translation":"報道機関は、彼女の財産目当てと思われる行動をしばしば批判した。","type":"noun","meaning_category":"財産目当ての結婚"},{"sentence":"He was accused of having **fortune-hunting** motives when he started dating the wealthy heiress.","translation":"彼が裕福な相続人と付き合い始めたとき、財産目当ての動機があると非難された。","type":"adjective","meaning_category":"財産目当ての"}]}