{"word":"chazzen","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Jewish law) The right or privilege of taking a particular honor or role in a synagogue service, often acquired by making a donation.","english_definition":"In Jewish law, the right or privilege of performing a specific honor or role in a synagogue service, frequently obtained through a financial contribution.","examples":[{"sentence":"He acquired the chazzen for reciting the Haftarah by making a generous donation to the synagogue.","translation":"彼はシナゴーグに多額の寄付をすることで、ハフトラーを朗読するチャゼンを獲得した。"}],"collocations":["acquire chazzen","purchase chazzen","synagogue chazzen"],"synonyms":["honor","privilege","role","mitzvah"],"antonyms":[]}],"etymology":{"value":"Derived from the Hebrew word \"chazzan\" (חַזָּן), meaning cantor or leader of prayer. The term \"chazzen\" in this context refers to the right to perform a specific function, rather than the person performing it.","priority":"★★★"},"pronunciation":{"ipa":"/ˈxɑzən/","syllables":"chaz-zen"},"inflection":{"noun_plural":"chazzens"},"usage_notes":{"explanation":"The term \"chazzen\" in this specific context is a noun referring to the right or privilege, not the cantor themselves. It is a practice primarily within Orthodox Jewish communities. The acquisition of a chazzen is often a way for individuals to support the synagogue financially while also receiving a communal honor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The chazzen led the service, having purchased the chazzen last week.","correct":"✓ The cantor led the service, having purchased the chazzen last week.","note":"In this context, 'chazzen' refers to the right to lead the service, not the person. Use 'cantor' to refer to the person leading the service."}],"priority":"★★☆"},"related_words":{"derivatives":["chazzan (cantor)"],"phrases":["kibbud (honor)","aliyah (being called up to the Torah)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term \"chazzen\" in this context refers to a specific Jewish religious practice related to synagogue honors. Understanding requires familiarity with Jewish customs and terminology, making it suitable for advanced learners with specific cultural knowledge."},"example_sentences":[{"sentence":"The family bought the **chazzen** for the Yizkor service in memory of their loved ones.","translation":"その家族は、愛する人たちを偲んで、イズコール礼拝のチャゼンを購入した。","type":"noun","meaning_category":"Right/Privilege"},{"sentence":"Acquiring the **chazzen** is seen as a way to both honor the synagogue and participate actively in the service.","translation":"チャゼンを獲得することは、シナゴーグを尊重し、積極的に礼拝に参加する方法と見なされている。","type":"noun","meaning_category":"Right/Privilege"}]}