{"word":"incorruptive","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"腐敗しない、堕落しない、買収されない","english_definition":"not susceptible to corruption, decay, or bribery; morally pure","examples":[{"sentence":"He was known as an incorruptive judge who always upheld the law.","translation":"彼は常に法を遵守する、買収されない裁判官として知られていた。"},{"sentence":"The leader was praised for his incorruptive nature and dedication to public service.","translation":"その指導者は、腐敗しない性質と公務への献身を称賛された。"},{"sentence":"The ancient artifact was remarkably incorruptive, showing no signs of decay after centuries.","translation":"その古代の工芸品は驚くほど腐敗せず、何世紀も経っても腐敗の兆候が見られなかった。"}],"collocations":["incorruptive official","incorruptive leader","incorruptive judge","incorruptive nature","incorruptive spirit","incorruptive material"],"synonyms":["honest","upright","principled","virtuous","unbribable","pure","stainless","untainted","unspoiled","imperishable"],"antonyms":["corruptible","corrupt","dishonest","bribable","decaying","perishable"]}],"etymology":{"value":"Derived from the prefix 'in-' (not) + 'corruptive', which comes from 'corrupt' (to spoil, decay, or make immoral) + '-ive' (having the nature of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnkəˈrʌptɪv/","syllables":"in-cor-rup-tive"},"inflection":{"notes":"Adjective, no comparative or superlative forms typically used."},"usage_notes":{"explanation":"'Incorruptive' describes something or someone that cannot be corrupted, either morally or physically. Morally, it implies a strong resistance to bribery or unethical behavior. Physically, it suggests an immunity to decay or spoilage. The term is often used to describe individuals in positions of power or influence, emphasizing their integrity and honesty. It can also refer to materials or substances that do not decay or rot easily.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an incorruptive man, so he is very corrupt.","correct":"✓ He is an incorruptive man, so he is very honest.","note":"'Incorruptive' means not corrupt, so it is the opposite of 'corrupt'. Using both in the same sentence creates a contradiction."},{"incorrect":"✗ The incorruptive food stayed fresh for weeks.","correct":"✓ The non-perishable food stayed fresh for weeks.","note":"While 'incorruptive' can imply resistance to decay, it's more commonly used in a moral or ethical context. For food, 'non-perishable' or 'slow to spoil' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["incorruptibility (noun): the state of being incorruptible","corruption (noun): the act of corrupting or state of being corrupt","corrupt (adjective): dishonest or immoral","corrupt (verb): to make dishonest or immoral"],"antonyms":["corruptible (adjective): able to be corrupted","corrupt (adjective): dishonest or immoral"],"synonyms":["unbribable (adjective): not able to be bribed","untainted (adjective): not spoiled or corrupted"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Incorruptive' is a relatively advanced word that describes something or someone that is not susceptible to corruption, decay, or bribery. It is often used in formal contexts to describe individuals who are morally upright and resistant to unethical influences. Understanding this word requires a grasp of the prefix 'in-' (not) and the root word 'corrupt'. It is less commonly used in everyday conversation but is valuable for understanding complex texts and discussions about ethics and integrity."},"example_sentences":[{"sentence":"The investigator was known for his **incorruptive** dedication to uncovering the truth.","translation":"その捜査官は、真実を明らかにするための腐敗しない献身で知られていた。","type":"adjective","meaning_category":"morally pure"},{"sentence":"The ancient tomb contained an **incorruptive** sarcophagus made of a rare metal.","translation":"その古代の墓には、希少な金属で作られた腐敗しない石棺が含まれていた。","type":"adjective","meaning_category":"not decaying"},{"sentence":"The politician promised to lead an **incorruptive** government that served the people's interests.","translation":"その政治家は、国民の利益のために奉仕する、腐敗しない政府を率いることを約束した。","type":"adjective","meaning_category":"unbribable"}]}