{"word":"DDPEX","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"An acronym for Delivered Duty Paid, EXcluding VAT. An international trade term where the seller is responsible for all costs associated with delivering goods to the named place in the buyer's country, excluding value-added tax (VAT).","english_definition":"An international trade term specifying that the seller is responsible for all costs associated with delivering goods to the named place in the buyer's country, excluding value-added tax (VAT).","examples":[{"sentence":"The shipping agreement stated DDPEX, meaning we are responsible for the VAT upon arrival.","translation":"配送契約にはDDPEXと記載されており、到着時にVATを支払う責任があることを意味します。","type":"example"}],"collocations":["DDPEX shipment","DDPEX terms","DDPEX agreement"],"synonyms":["Delivered Duty Paid excluding VAT"],"antonyms":["DDP (Delivered Duty Paid)"]}],"etymology":{"value":"Acronym derived from 'Delivered Duty Paid, EXcluding VAT'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌdiːˌdiːˌpiːˈɛks/","syllables":"dee-dee-pee-ex"},"inflection":{"noun_plural":"DDPEXs"},"usage_notes":{"explanation":"DDPEX is used in international trade to define the responsibilities and costs associated with shipping goods. It is similar to DDP (Delivered Duty Paid) but specifically excludes the seller's responsibility for VAT, which becomes the buyer's responsibility.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"The seller is responsible for VAT under DDPEX.","correct":"The buyer is responsible for VAT under DDPEX.","note":"DDPEX specifically excludes the seller's responsibility for VAT."}],"priority":"Medium"},"related_words":{"acronyms":["DDP (Delivered Duty Paid)","VAT (Value Added Tax)","Incoterms (International Commercial Terms)"]},"level_frequency":{"level":"Advanced (Business/Trade)","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"Advanced","text":"DDPEX is a specialized term used in international trade. Understanding it requires familiarity with Incoterms and international shipping regulations. It's important to know that DDPEX places the responsibility for VAT on the buyer, unlike standard DDP terms."},"example_sentences":[{"sentence":"We agreed to DDPEX terms to avoid handling the VAT in their country.","translation":"相手の国でVATの処理を避けるために、DDPEX条件に合意しました。","type":"example"},{"sentence":"The DDPEX price includes all shipping and customs fees, but not the VAT.","translation":"DDPEX価格には、すべての送料と関税が含まれていますが、VATは含まれていません。","type":"example"}]}