{"word":"superinducement","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学) ある性質または事実が、他の性質または事実の存在に論理的に依存していること。上位の性質が下位の性質によって決定される関係。","english_definition":"(philosophy) The relationship in which one set of properties or facts logically depends on the existence of another set. A relation in which higher-level properties are determined by lower-level properties.","examples":[{"sentence":"The superinducement of mental states on physical states is a central topic in the philosophy of mind.","translation":"心的状態の物理的状態へのスーパー誘導は、心の哲学における中心的なトピックです。"},{"sentence":"Moral properties are often argued to supervene on descriptive properties.","translation":"道徳的性質は、記述的性質にスーパー誘導するとしばしば議論されます。"}],"collocations":["property superinducement","state superinducement","moral superinducement"],"synonyms":["supervenience","dependence","determination"],"antonyms":["independence","autonomy"]}],"etymology":{"value":"\"super-\" (上に) + \"inducement\" (誘導、誘因) から構成される。上位の性質が下位の性質によって誘導されるという概念を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərɪnˈdjuːsmənt/","syllables":"su-per-in-duce-ment"},"inflection":{"noun_plural":"superinducements"},"usage_notes":{"explanation":"\"Superinducement\" は、哲学、特に心の哲学や倫理学で用いられる専門用語です。あるレベルの性質（例えば、心的状態、道徳的性質）が、より基本的なレベルの性質（例えば、物理的状態、記述的性質）によって決定されるという関係を表します。この関係は、下位レベルの性質が変化すれば、上位レベルの性質も変化することを意味しますが、その逆は必ずしも真ではありません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The superinducement is when two things are similar.","correct":"✓ Superinducement is when one thing's properties are determined by another thing's properties.","note":"スーパー誘導は類似性ではなく、依存関係を表します。"},{"incorrect":"✗ Superinducement means the properties are identical.","correct":"✓ Superinducement means the properties of one thing are determined by the properties of another, but they are not necessarily identical.","note":"スーパー誘導は同一性ではなく、決定関係を表します。"}],"priority":"★★☆"},"related_words":{"derivatives":["supervene","supervenient"],"related_terms":["emergence","reductionism","physicalism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 哲学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**superinducement**」は、哲学で使われる難しい言葉で、あるものの性質が別のものの性質によって決まることを言います。たとえば、人の気持ち（心）は、その人の脳の状態（物理）によって決まると考えられています。もし脳の状態が変われば、気持ちも変わるかもしれません。この関係を「スーパー誘導」と言います。これは、気持ちと脳の状態が完全に同じものではないけれど、気持ちが脳の状態に依存していることを意味します。この言葉は、心の哲学や倫理学でよく使われます。"},"example_sentences":[{"sentence":"The problem of mental causation arises from the apparent superinducement of mental properties on physical properties.","translation":"心的因果の問題は、心的性質が物理的性質にスーパー誘導するという見かけ上の事実から生じる。","type":"general","meaning_category":"哲学"}]}