{"word":"underlessee","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"転借人、又貸しを受けた人","english_definition":"A person who leases property from a lessee.","examples":[{"sentence":"The underlessee was responsible for paying rent to the lessee, not the original landlord.","translation":"転借人は、元の家主ではなく、賃借人（又貸し人）に賃料を支払う責任がありました。"},{"sentence":"The rights of the underlessee are determined by the terms of the original lease and the sublease agreement.","translation":"転借人の権利は、元の賃貸契約および転貸借契約の条件によって決定されます。"}],"collocations":["sublease to an underlessee (転借人に転貸する)","rights of an underlessee (転借人の権利)","responsibilities of an underlessee (転借人の責任)"],"synonyms":["subtenant"],"antonyms":["lessor","landlord"]}],"etymology":{"value":"'Under-' (下位の) + 'lessee' (賃借人) から構成される。","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌʌndərleˈsiː/","syllables":"un-der-le-see"},"inflection":{"noun_plural":"underlessees"},"usage_notes":{"explanation":"An underlessee is someone who rents property from a lessee (the original tenant), not directly from the landlord. The underlessee's rights and responsibilities are governed by the terms of the sublease agreement and the original lease.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The underlessee pays rent directly to the landlord.","correct":"The underlessee pays rent to the lessee.","note":"Underlessees pay rent to the person who is subletting the property to them (the lessee), not the original landlord."}],"priority":"☆☆☆"},"related_words":{"derivatives":["underlease (名詞: 転貸借契約、又貸し)","lessee (名詞: 賃借人)","lessor (名詞: 賃貸人)","sublease (名詞/動詞: 転貸借)"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'underlessee' refers to an individual or entity that rents a property from a lessee (the original tenant), not directly from the property owner (landlord). This arrangement is called a sublease. The underlessee's rights and obligations are defined by the sublease agreement and the original lease, and they typically pay rent to the lessee, who then pays the landlord. This term is primarily used in legal and real estate contexts."},"example_sentences":[{"sentence":"The underlessee signed a contract to rent the apartment for six months.","translation":"転借人は、アパートを6ヶ月間借りる契約に署名しました。","type":"noun","meaning_category":"転借人"},{"sentence":"Before renting to an underlessee, the lessee must obtain permission from the landlord.","translation":"転借人に貸す前に、賃借人は家主から許可を得なければなりません。","type":"noun","meaning_category":"転借人"}]}