{"word":"Examinership","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(アイルランド法) 会社更生手続きの一種","english_definition":"(Irish law) A process of corporate rescue available in Ireland, similar to Chapter 11 bankruptcy in the United States, where an examiner is appointed to oversee the restructuring of a company.","examples":[{"sentence":"The company was placed into examinership to protect it from creditors.","translation":"その会社は債権者からの保護のために会社更生手続きに入った。"},{"sentence":"The examiner proposed a scheme of arrangement to save the business.","translation":"管財人は事業を救済するための整理計画を提案した。"},{"sentence":"Examinership allows a company breathing space to restructure its debts.","translation":"会社更生手続きは、会社が債務を再構築するための猶予期間を与える。"}],"collocations":["enter examinership","appoint an examiner","scheme of arrangement","creditor protection","restructure debts"],"synonyms":["corporate rescue","restructuring","insolvency procedure"],"antonyms":["liquidation","bankruptcy","receivership"]}],"etymology":{"value":"The term is specific to Irish law. It is derived from the role of the 'examiner' who is appointed to examine the company's affairs and propose a scheme of arrangement.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪɡˌzæmɪnərˈʃɪp/","syllables":"ex-am-in-er-ship"},"inflection":{"noun_plural":"Examinerships"},"usage_notes":{"explanation":"'Examinership' is a legal term unique to the Republic of Ireland. It is a formal process initiated when a company is facing financial difficulties but has a reasonable prospect of survival. An 'examiner' (usually an accountant or solicitor) is appointed by the court to investigate the company's affairs, formulate a plan to restructure the company's debts, and present this plan to the creditors for approval. If approved, the company can continue trading under the protection of the court, shielded from creditor action. It is similar in concept to Chapter 11 bankruptcy in the United States or administration in the UK, but with key differences in procedure and legal framework.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company declared bankruptcy through examinership.","correct":"✓ The company entered examinership to avoid bankruptcy.","note":"Examinership is a process *to avoid* bankruptcy, not a form of bankruptcy itself."},{"incorrect":"✗ Examinership is the same as liquidation.","correct":"✓ Examinership is a process of corporate rescue, whereas liquidation involves closing down the company.","note":"Examinership aims to save the company, while liquidation involves selling off its assets and closing down."}],"priority":"★★☆"},"related_words":{"derivatives":["examiner","scheme of arrangement","creditor","insolvency"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Legal Term)","frequency_google_ngram":"Low frequency - specific to Irish legal and business contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Examinership' is a specialized legal term used in Ireland to describe a process of corporate rescue. It involves appointing an 'examiner' to restructure a financially troubled company, providing it with legal protection from creditors while a plan for its survival is developed and voted on. Understanding this term requires knowledge of Irish corporate law and insolvency procedures. It is not commonly used outside of legal and business contexts within Ireland.","priority":"★★☆"},"example_sentences":[{"sentence":"The court approved the petition to place the company into examinership.","translation":"裁判所は会社を会社更生手続きに入れる申し立てを承認した。","type":"noun","meaning_category":"Company Rescue"},{"sentence":"The examinership process allowed the company to continue trading while it restructured its debts.","translation":"会社更生手続きにより、会社は債務を再構築しながら取引を継続することができた。","type":"noun","meaning_category":"Debt Restructuring"},{"sentence":"The examiner's report outlined a viable plan for the company's future.","translation":"管財人の報告書は、会社の将来のための実行可能な計画を概説した。","type":"noun","meaning_category":"Viable Plan"}]}