{"word":"Tartu","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"タルトゥ（エストニア第二の都市）","english_definition":"Tartu is the second-largest city of Estonia, after Tallinn. It is often considered the intellectual hub of the country, especially renowned for being a university town.","examples":[{"sentence":"Tartu is a beautiful city with a rich history.","translation":"タルトゥは豊かな歴史を持つ美しい都市です。"},{"sentence":"The University of Tartu is one of the oldest universities in Northern Europe.","translation":"タルトゥ大学は北ヨーロッパで最も古い大学の一つです。"}],"collocations":["University of Tartu","Tartu Old Town","Estonian National Museum in Tartu"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Tartu' is believed to be derived from the ancient Estonian Tarbatu, which referred to a fort.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɑːrtuː/","syllables":"Tar-tu"},"inflection":{},"usage_notes":{"explanation":"Tartu is a proper noun referring to a specific city in Estonia. It's known for its historical significance, particularly as a university town. When discussing Estonia or its cities, Tartu is a common reference point.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★☆"},"related_words":{"derivatives":["Tartuensis (Latin adjective referring to Tartu)"],"related_places":["Tallinn (capital of Estonia)","Estonia"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low, but significant in contexts related to Estonia.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Tartu' is a proper noun, specifically the name of a city in Estonia. Understanding its significance requires some knowledge of Estonian geography and culture. It is often mentioned in discussions about Estonian history, education, and culture, especially in relation to the University of Tartu. Therefore, familiarity with this term is more relevant for those with a specific interest in Estonia or Northern Europe.","priority":"★★☆"},"example_sentences":[{"sentence":"Many international students choose to study at the University of Tartu.","translation":"多くの留学生がタルトゥ大学で学ぶことを選びます。","type":"example","meaning_category":"City in Estonia"},{"sentence":"The architecture in Tartu's Old Town is well-preserved.","translation":"タルトゥの旧市街の建築はよく保存されています。","type":"example","meaning_category":"City in Estonia"}]}