{"word":"metallochromy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"金属光沢、金属彩、金属表面の虹色現象","english_definition":"The iridescence or play of colors on the surface of a metal, especially when produced by oxidation or thin films.","examples":[{"sentence":"The metallochromy on the antique sword was stunning.","translation":"そのアンティークの剣の金属光沢は素晴らしかった。"},{"sentence":"Metallochromy can be observed on the surface of tarnished silver.","translation":"金属彩は、変色した銀の表面で観察できる。"}],"collocations":["observe metallochromy","artificial metallochromy","natural metallochromy"],"synonyms":["iridescence","opalescence","goniochromism"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'metallon' (metal) and 'chroma' (color).","priority":"★★☆"},"pronunciation":{"ipa":"/məˈtæləˌkroʊmi/","syllables":"me-tal-lo-chro-my"},"inflection":{"noun_plural":"metallochromies"},"usage_notes":{"explanation":"Metallochromy refers to the optical phenomenon where a metal surface exhibits a range of colors due to thin film interference, oxidation, or other surface treatments. It is often observed in antique metals, artificially created coatings, or naturally occurring mineral formations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metallochromy was very loud.","correct":"✓ The metallochromy was very vibrant.","note":"Metallochromy refers to color, not sound; use adjectives related to visual appearance."}],"priority":"★☆☆"},"related_words":{"derivatives":["metallochrome (adjective: displaying metallochromy; noun: a substance that displays metallochromy)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Metallochromy is a technical term referring to the iridescent colors seen on metal surfaces, often due to oxidation or thin films. It is a niche term used in materials science, art conservation, and related fields. Understanding the term requires a background in optics or materials science.","priority":"★☆☆"},"example_sentences":[{"sentence":"The artist used a special technique to create artificial metallochromy on the sculpture.","translation":"その芸術家は、彫刻に人工的な金属光沢を作り出すために特別な技術を使った。","type":"general","meaning_category":"Art/Science"},{"sentence":"The rainbow-like metallochromy on the old bronze statue was caused by years of oxidation.","translation":"古い青銅像に見られる虹のような金属彩は、長年の酸化によって引き起こされた。","type":"general","meaning_category":"Materials Science"}]}