{"word":"subfractionally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"ごくわずかに、極めて小さい割合で","english_definition":"in a manner that involves very small fractions or portions; to a degree that is extremely small or insignificant.","examples":[{"sentence":"The market share increased subfractionally, barely making a difference.","translation":"市場占有率はごくわずかに増加し、ほとんど変化をもたらさなかった。"},{"sentence":"The data was analyzed subfractionally to identify even the smallest trends.","translation":"データは、ごくわずかな傾向さえも特定するために、極めて小さい割合で分析された。"}],"collocations":["increase subfractionally","decrease subfractionally","analyze subfractionally","divide subfractionally"],"synonyms":["minutely","infinitesimally","negligibly","marginally","imperceptibly"],"antonyms":["substantially","significantly","considerably","markedly"]}],"etymology":{"value":"The word is formed by adding the suffix '-ly' to the adjective 'subfractional.' 'Subfractional' itself is derived from 'sub-' (meaning 'under' or 'less than') and 'fractional' (relating to fractions). Thus, 'subfractionally' means 'in a manner that is less than fractional' or 'in very small portions.'","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˈfrækʃənəli/","syllables":"sub-frac-tion-al-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"'Subfractionally' is used to describe changes, divisions, or analyses that occur in extremely small increments or portions. It emphasizes the insignificance or minuteness of the quantity or degree involved. It is often used in technical or scientific contexts where precision is important, but can also be used more generally to describe anything that changes or is divided into very small parts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The price changed subfractional.","correct":"✓ The price changed subfractionally.","note":"'Subfractional' is an adjective, while 'subfractionally' is an adverb. Use the adverb to modify a verb. "},{"incorrect":"✗ The data was subfractionally, but significantly different.","correct":"✓ The data was subfractionally different, but still significant.","note":"The adverb should directly modify the adjective it is intended to describe."}],"priority":"★★☆"},"related_words":{"derivatives":["subfraction (noun): a fraction of a fraction; a very small part.","subfractional (adjective): relating to or being a very small fraction or part."],"related_terms":["fractionally","partially","slightly","minimally"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Subfractionally' is a relatively rare and technical word. It means 'in a very small or insignificant way, like a tiny fraction.' It is used to describe something that changes or is divided into extremely small parts. Because of its specific meaning and infrequent use, it is more likely to be encountered in specialized or technical contexts rather than everyday conversation."},"example_sentences":[{"sentence":"The temperature increased subfractionally each day.","translation":"気温は毎日ごくわずかに上昇した。","type":"adverb","meaning_category":"degree of increase"},{"sentence":"The sample was divided subfractionally for detailed analysis.","translation":"サンプルは詳細な分析のために極めて小さい割合で分割された。","type":"adverb","meaning_category":"degree of division"},{"sentence":"The error rate decreased subfractionally after the update.","translation":"アップデート後、エラー率はごくわずかに減少した。","type":"adverb","meaning_category":"degree of decrease"}]}