{"word":"restoratives","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"滋養回復剤、回復薬","english_definition":"something that makes you feel better or more energetic after being tired or ill.","examples":[{"sentence":"After a long illness, she needed restoratives to regain her strength.","translation":"長患いの後、彼女は体力を回復するために滋養回復剤を必要とした。"},{"sentence":"The spa offered a range of restoratives to help guests relax and rejuvenate.","translation":"そのスパは、ゲストがリラックスして若返るのを助けるための様々な回復薬を提供した。"}],"collocations":["take restoratives","offer restoratives","natural restoratives"],"synonyms":["tonic","remedy","reviver","stimulant","elixir"],"antonyms":["toxin","depressant"]},{"part_of_speech":"adjective","definition":"回復力のある、滋養のある","english_definition":"having the ability to restore health, strength, or well-being.","examples":[{"sentence":"Restorative sleep is essential for physical and mental health.","translation":"回復力のある睡眠は、肉体的および精神的な健康に不可欠である。"},{"sentence":"The restorative powers of nature can help heal both the body and the mind.","translation":"自然の回復力は、体と心の両方を癒すのに役立つ。"}],"collocations":["restorative sleep","restorative powers","restorative effect"],"synonyms":["healing","rejuvenating","invigorating","refreshing","therapeutic"],"antonyms":["harmful","damaging","debilitating"]}],"etymology":{"value":"The word \"restorative\" comes from the Latin word \"restaurare,\" meaning \"to restore.\" It has been used in English since the 15th century to describe things that bring back health or strength.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈstɔːrətɪvz/","syllables":"re-stor-a-tives"},"inflection":{"noun_plural":"restoratives","notes":"This word is most commonly used in its plural form."},"usage_notes":{"explanation":"\"Restoratives\" typically refers to things that help restore health, strength, or well-being. As a noun, it refers to specific items like tonics or remedies. As an adjective, it describes something that has a restorative effect, such as restorative sleep or restorative practices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He drank a restorative.","correct":"✓ He drank a restorative tonic.","note":"While 'restorative' can be used as a noun, it often implies a specific type of restorative, such as a tonic, remedy, or elixir. Specifying the type can provide clarity."},{"incorrect":"✗ The medicine was very restorative.","correct":"✓ The medicine had a very restorative effect.","note":"When using 'restorative' as an adjective, it's more common to say something has a restorative effect rather than saying something is restorative."}],"priority":"★★☆"},"related_words":{"derivatives":["restore","restoration","restored"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"restoratives\" is relatively uncommon and is most often encountered in contexts related to health, wellness, and recovery. It refers to things that help restore one's health, strength, or well-being. Understanding the word requires a good vocabulary and familiarity with medical or wellness-related topics."},"example_sentences":[{"sentence":"After the marathon, the athletes relied on various restoratives to aid their recovery.","translation":"マラソンの後、アスリートたちは回復を助けるために様々な滋養回復剤に頼った。","type":"noun","meaning_category":"回復薬"},{"sentence":"The restorative yoga session helped release tension and promote relaxation.","translation":"その回復的なヨガのセッションは、緊張を解放し、リラックスを促進するのに役立った。","type":"adjective","meaning_category":"回復力のある"},{"sentence":"A warm bath with essential oils can be a powerful restorative after a stressful day.","translation":"エッセンシャルオイルを入れた温かいお風呂は、ストレスの多い一日の後に強力な回復剤となる。","type":"noun","meaning_category":"回復薬"},{"sentence":"The restorative properties of the herbal tea helped soothe her sore throat.","translation":"そのハーブティーの回復特性は、彼女の喉の痛みを和らげるのに役立った。","type":"adjective","meaning_category":"回復力のある"}]}