{"word":"petrification","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"石化、石化作用","english_definition":"The process of turning organic matter into stone or a substance resembling stone.","examples":[{"sentence":"The petrification of wood can create beautiful fossils.","translation":"木の石化は美しい化石を作り出すことがあります。"},{"sentence":"Petrification is a slow process that can take millions of years.","translation":"石化は数百万年かかることがある遅いプロセスです。"},{"sentence":"The museum displayed several examples of petrification.","translation":"博物館には石化の例がいくつか展示されていました。"}],"collocations":["process of petrification","complete petrification","gradual petrification","fossil petrification"],"synonyms":["fossilization","lithification","calcification","ossification"],"antonyms":["decomposition","decay","dissolution"]},{"part_of_speech":"noun","definition":"（比喩的に）硬直、無感覚、麻痺","english_definition":"(Figurative) The state of being paralyzed or unable to move or act, especially due to fear or shock.","examples":[{"sentence":"She stood in petrification as the car sped towards her.","translation":"車が彼女に向かってスピードを上げてきたとき、彼女は硬直して立っていた。"},{"sentence":"The news caused a moment of petrification among the crowd.","translation":"そのニュースは群衆の間に一瞬の麻痺を引き起こした。"},{"sentence":"He felt a sense of petrification when he realized the danger.","translation":"彼は危険を悟ったとき、無感覚を感じた。"}],"collocations":["state of petrification","moment of petrification","sense of petrification","emotional petrification"],"synonyms":["paralysis","immobility","stupefaction","torpor","inertia"],"antonyms":["animation","activity","movement","excitement"]}],"etymology":{"value":"From the Middle French 'pétrification', and directly from Late Latin 'petrificatio', from Latin 'petra' (rock) + 'facere' (to make).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɛtrɪfɪˈkeɪʃən/","syllables":"pet-ri-fi-ca-tion"},"inflection":{"noun_plural":"petrifications"},"usage_notes":{"explanation":"'Petrification' primarily refers to the natural process by which organic material is converted into stone, often seen in fossils. Figuratively, it describes a state of being paralyzed or immobilized, often due to intense fear or shock. The figurative sense retains the idea of becoming fixed and unmoving, similar to stone.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The petrification of the building was impressive.","correct":"The stonework of the building was impressive.","note":"'Petrification' refers to the process or result of organic matter turning into stone, not to stone buildings themselves. Use 'stonework', 'masonry', or similar terms for buildings made of stone."},{"incorrect":"He suffered from petrification after the accident, but he recovered quickly.","correct":"He suffered from shock after the accident, but he recovered quickly.","note":"While 'petrification' can describe a state of paralysis, it is less common than 'shock' or 'paralysis' itself in describing a temporary inability to move after an accident."}],"priority":"★★☆"},"related_words":{"derivatives":["petrify (verb)","petrified (adjective)"],"phrasal_verbs":[],"related_concepts":["fossil","mineralization","silicification","fossil fuels","geology"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Petrification' is a relatively advanced word primarily used in scientific or descriptive contexts. It refers to the process by which organic material transforms into stone, or a state of being immobilized due to fear or shock. Understanding this word requires a good grasp of scientific vocabulary and figurative language. It is less common in everyday conversation and more often found in academic or literary texts."},"example_sentences":[{"sentence":"The **petrification** process preserved the ancient forest in stunning detail.","translation":"石化の過程は古代の森を驚くほど詳細に保存しました。","type":"noun","meaning_category":"石化作用"},{"sentence":"The sudden loud noise caused a moment of **petrification** among the bystanders.","translation":"突然の大きな音は、傍観者の間に一瞬の硬直を引き起こしました。","type":"noun","meaning_category":"硬直"}]}