{"word":"Leonids","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"しし座流星群","english_definition":"A prolific meteor shower associated with the comet Tempel-Tuttle, which peaks in November.","examples":[{"sentence":"The Leonids meteor shower is known for its occasional meteor storms.","translation":"しし座流星群は、時折起こる流星嵐で知られています。"},{"sentence":"We watched the Leonids from a dark location to get the best view.","translation":"最高の眺めを得るために、暗い場所からしし座流星群を観察しました。"}],"collocations":["Leonids meteor shower","watch the Leonids","Leonids peak"],"synonyms":["meteor shower"],"antonyms":[]},{"part_of_speech":"noun","definition":"しし座流星群の流星","english_definition":"A meteor belonging to the Leonids meteor shower.","examples":[{"sentence":"Some Leonids appear very bright.","translation":"一部のしし座流星群の流星は非常に明るく見える。"}],"collocations":["bright Leonids"],"synonyms":["meteor"],"antonyms":[]}],"etymology":{"value":"Named after the constellation Leo (the Lion), from which the meteors appear to radiate.","priority":"★★★"},"pronunciation":{"ipa":"ˈliːənɪdz","syllables":"Le-o-nids"},"inflection":{"noun_plural":"Leonids"},"usage_notes":{"explanation":"The Leonids are best viewed after midnight, when the constellation Leo is high in the sky. They are known for their speed, as they enter the Earth's atmosphere traveling at about 71 kilometers per second.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Leonid last night. It was amazing!","correct":"✓ I saw a Leonid meteor last night. It was amazing!","note":"While technically correct, it's more common to specify 'Leonid meteor' to avoid ambiguity, as 'Leonid' primarily refers to the meteor shower itself."}],"priority":"★★☆"},"related_words":{"derivatives":["Leo","meteor","meteor shower","comet"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but well-known in astronomy contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Leonids' refers to a specific meteor shower that occurs annually in November. It's named after the constellation Leo because the meteors appear to originate from that area of the sky. The term is generally used in discussions about astronomy or stargazing.","priority":"★★☆"},"example_sentences":[{"sentence":"The peak of the Leonids meteor shower is expected next week.","translation":"来週はしし座流星群のピークが予想されています。","type":"noun","meaning_category":"Meteor Shower"},{"sentence":"During the Leonids, we saw several bright meteors streak across the sky.","translation":"しし座流星群の期間中、いくつかの明るい流星が空を横切るのを見ました。","type":"noun","meaning_category":"Meteor"}]}