{"word":"self-scanned","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"自分でスキャンした、または自己スキャンされた","english_definition":"Having been scanned by oneself, or referring to something that has been scanned by oneself.","examples":[{"sentence":"This is a self-scanned document, so there might be some imperfections.","translation":"これは自分でスキャンした書類なので、多少の不備があるかもしれません。"},{"sentence":"The library offers self-scanned options for digitizing old books.","translation":"図書館では、古い本をデジタル化するための自己スキャンオプションを提供しています。"}],"collocations":["self-scanned document","self-scanned image","self-scanned copy"],"synonyms":["personally scanned","user-scanned"],"antonyms":["professionally scanned","commercially scanned"]}],"etymology":{"value":"The word is formed by combining the prefix 'self-' meaning 'by oneself' with the past participle 'scanned' of the verb 'to scan'. It describes something that has been scanned by the person who possesses or uses it.","priority":"★★★"},"pronunciation":{"ipa":"/ˌselfˈskænd/","syllables":"self-scanned"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Self-scanned' is typically used to indicate that a document, image, or other item has been digitized by an individual using a personal scanner or a self-service scanning facility, as opposed to being scanned by a professional service. It often implies that the quality may vary or that the process was performed by a non-expert.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The self scanned document was blurry.","correct":"✓ The self-scanned document was blurry.","note":"The hyphen is important to connect 'self' and 'scanned' to form a single adjective describing the document."}],"priority":"★★★"},"related_words":{"derivatives":["scan","scanner","scanning","self"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The term 'self-scanned' is relatively straightforward. It means that someone has used a scanner to create a digital copy of something themselves, rather than having it done professionally. It's often used when discussing documents or images where the quality might not be as high as a professionally scanned version."},"example_sentences":[{"sentence":"I created a self-scanned version of the contract for my records.","translation":"記録のために、契約書の自己スキャン版を作成しました。","type":"adjective","meaning_category":"自分でスキャンした"},{"sentence":"The archive allows researchers to create self-scanned copies of fragile manuscripts.","translation":"アーカイブでは、研究者が壊れやすい原稿の自己スキャンコピーを作成できます。","type":"adjective","meaning_category":"自分でスキャンした"}]}