{"word":"Cuneiforms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"楔形文字","english_definition":"An ancient writing system that was used in the Middle East, especially by the Sumerians and Babylonians, consisting of wedge-shaped marks made on clay tablets.","examples":[{"sentence":"Cuneiforms were one of the earliest forms of writing.","translation":"楔形文字は、最も初期の文字体系の一つでした。"},{"sentence":"The Rosetta Stone helped scholars decipher Egyptian hieroglyphs, but it did not directly help with understanding cuneiforms.","translation":"ロゼッタ石は学者たちがエジプトの象形文字を解読するのに役立ちましたが、楔形文字の理解には直接的には役立ちませんでした。"}],"collocations":["cuneiform script","cuneiform tablet","decipher cuneiforms"],"synonyms":["wedge-shaped writing","ancient script"],"antonyms":[]}],"etymology":{"value":"From Latin 'cuneus' meaning 'wedge' + 'forma' meaning 'shape'.","priority":"★★★"},"pronunciation":{"ipa":"/kjuːˈniːɪfɔːrmz/","syllables":"cu-nei-i-forms"},"inflection":{"noun_plural":"cuneiforms"},"usage_notes":{"explanation":"'Cuneiforms' refers specifically to the writing system using wedge-shaped impressions. The term is typically used when discussing ancient Middle Eastern civilizations and their written records.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Cuneiforms are a type of alphabet.","correct":"✓ Cuneiforms are a type of writing system.","note":"Cuneiforms are not an alphabet, but rather a logographic or syllabic writing system."}],"priority":"★★☆"},"related_words":{"derivatives":["cuneiform (adjective, noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cuneiforms' is a specialized term related to ancient history and writing systems. It is typically encountered in academic contexts or when discussing Mesopotamian civilizations. Understanding the term requires knowledge of ancient history and writing systems."},"example_sentences":[{"sentence":"Archaeologists discovered numerous cuneiforms during the excavation of the ancient city.","translation":"考古学者たちは、古代都市の発掘中に多数の楔形文字を発見しました。","type":"noun","meaning_category":"Writing system"},{"sentence":"The cuneiforms on the tablet described the daily life of the Sumerians.","translation":"粘土板の楔形文字は、シュメール人の日常生活について記述していました。","type":"noun","meaning_category":"Writing system"}]}