{"word":"eulogizer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"賛辞を述べる人、賛美者、特に故人の追悼演説をする人","english_definition":"a person who delivers a eulogy; one who praises someone or something, especially in a formal speech at a funeral or memorial service.","examples":[{"sentence":"The family chose a close friend as the eulogizer for the deceased.","translation":"家族は故人の追悼演説者として親しい友人を選んだ。"},{"sentence":"He is known as a skilled eulogizer, capable of capturing the essence of a person's life in a few words.","translation":"彼は熟練した賛辞者として知られており、数少ない言葉で人の人生の本質を捉えることができる。"}],"collocations":["act as a eulogizer","skilled eulogizer","chief eulogizer"],"synonyms":["panegyrist","lauder","commender","praiser","celebrant","tributer"],"antonyms":["critic","detractor","censor","reviler"]}],"etymology":{"value":"\"eulogize\" (賛辞を述べる) + \"-er\" (～する人)。\"eulogize\" は、ギリシャ語の \"eulogia\" (良い言葉、賛辞) に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjuːləˌdʒaɪzər/","syllables":"eu-lo-gi-zer"},"inflection":{"noun_plural":"eulogizers"},"usage_notes":{"explanation":"\"Eulogizer\" は、特に葬儀や追悼式で、亡くなった人の生涯や功績を称える賛辞（eulogy）を述べる人を指します。より一般的には、何かまたは誰かを熱心に賞賛する人を指すこともあります。フォーマルな場面で使われることが多く、日常会話ではあまり一般的ではありません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was the best eulogizer ever. Her eulogy was so great.","correct":"✓ She was the best eulogist ever. Her eulogy was so great.","note":"\"Eulogist\" is a more common and generally preferred term for a person who delivers a eulogy. While \"eulogizer\" is acceptable, \"eulogist\" is more widely used."}],"priority":"★☆☆"},"related_words":{"derivatives":["eulogize (動詞: 賛辞を述べる)","eulogy (名詞: 賛辞、追悼演説)","eulogistic (形容詞: 賛辞的な)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Eulogizer\" is a relatively uncommon word that refers to someone who delivers a eulogy, which is a speech given at a funeral or memorial service to honor a deceased person. It's more formal than simply saying someone \"praised\" or \"honored\" the person. Because it's not a frequently used word, it's more likely to be encountered in formal writing or speeches related to funerals or memorial events."},"example_sentences":[{"sentence":"The renowned historian served as the eulogizer, delivering a moving tribute to the late president.","translation":"著名な歴史家が賛辞者として、故大統領への感動的な賛辞を述べた。","type":"noun","meaning_category":"追悼演説者"},{"sentence":"As a skilled eulogizer, she knew how to capture the essence of a person's life in a heartfelt speech.","translation":"熟練した賛辞者として、彼女は心からのスピーチで人の人生の本質を捉える方法を知っていた。","type":"noun","meaning_category":"賛美者"}]}