{"word":"unreviled","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(人や物が) 罵倒されない、非難されない、中傷されない","english_definition":"Not subjected to revilement; not vilified or abused with harsh language.","examples":[{"sentence":"The politician, despite his controversial policies, remained surprisingly unreviled by the public.","translation":"その政治家は、物議を醸す政策にもかかわらず、驚くほど国民から罵倒されずにいた。"},{"sentence":"The artist's early works, though unconventional, were largely unreviled by critics.","translation":"その芸術家の初期の作品は、型破りではあったが、批評家からほとんど非難されなかった。"},{"sentence":"Unlike other leaders who faced public scorn, he remained largely unreviled even after leaving office.","translation":"世間の軽蔑に直面した他の指導者とは異なり、彼は退任後もほとんど罵倒されずにいた。"}],"collocations":["remain unreviled","largely unreviled","generally unreviled"],"synonyms":["uncondemned","unscathed","unblamed","unattacked","unscorned"],"antonyms":["reviled","vilified","condemned","scorned","abused"]}],"etymology":{"value":"'Un-' (not) + 'reviled' (past participle of 'revile', meaning to criticize in an abusive or angrily insulting manner).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌn.rɪˈvaɪld/","syllables":"un-re-viled"},"inflection":{"notes":"Adjective; comparative and superlative forms are generally formed using 'more' and 'most' (e.g., more unreviled, most unreviled)."},"usage_notes":{"explanation":"'Unreviled' is a relatively uncommon word. It describes someone or something that has avoided being subjected to harsh criticism, verbal abuse, or scorn. It often implies a surprising or unexpected lack of negative reaction, especially when the subject might have been expected to attract such criticism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unreviled statue was admired by everyone.","correct":"✓ The statue, unreviled, was admired by everyone.","note":"The word 'unreviled' describes a lack of negative criticism, not necessarily a positive reception. While the statue might be admired, 'unreviled' simply means it wasn't criticized. A better word to use in this context might be 'admired' or 'praised'."},{"incorrect":"✗ He was unreviled for his crimes.","correct":"✓ He was reviled for his crimes.","note":"'Unreviled' means *not* reviled. If someone committed crimes, they would likely be reviled, not unreviled. The sentence should use 'reviled' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["revile (verb: to criticize in an abusive or angrily insulting manner)","revilement (noun: the act of reviling)"],"antonyms":["reviled (adjective: criticized in an abusive or angrily insulting manner)","vilified (adjective: spoken or written about in an abusively disparaging manner)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unreviled' is an advanced word that means not criticized or abused with harsh language. It's used to describe someone or something that, surprisingly, has not been subjected to negative attacks or scorn. The word implies an expectation that criticism might have been warranted, but for some reason, it didn't happen. Because of its rarity and nuanced meaning, it's more likely to be encountered in formal writing or academic contexts."},"example_sentences":[{"sentence":"Despite his controversial decisions, the CEO remained largely unreviled by the shareholders.","translation":"彼の物議を醸す決定にもかかわらず、CEOは株主からほとんど非難されずにいた。","type":"adjective","meaning_category":"Not criticized"},{"sentence":"The small town, unreviled by tourists, retained its authentic charm.","translation":"観光客から非難されることのなかったその小さな町は、その本物の魅力を保っていた。","type":"adjective","meaning_category":"Not scorned"},{"sentence":"Her controversial book, surprisingly, remained unreviled by religious groups.","translation":"彼女の物議を醸す本は、驚くべきことに、宗教団体から非難されずにいた。","type":"adjective","meaning_category":"Not abused"}]}