{"word":"subinferring","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(論理学)下位推論する","english_definition":"(logic) To infer a particular proposition from a universal proposition of the same quality.","examples":[{"sentence":"By subinferring from 'All swans are white' we can derive 'Some swans are white'.","translation":"「すべての白鳥は白い」から下位推論することで、「いくつかの白鳥は白い」を導き出すことができる。"}],"collocations":[],"synonyms":["inferring","deriving","deducing"],"antonyms":[],"notes":"Subinferring is a type of immediate inference. It involves moving from a universal proposition (e.g., 'All A are B') to a particular proposition of the same quality (e.g., 'Some A are B'). This is valid in traditional Aristotelian logic, but may not hold in modern predicate logic if the subject class is empty."}],"etymology":{"value":"The word is formed by combining the prefix 'sub-' (meaning 'under' or 'below') with the verb 'inferring'.","priority":"★★★"},"pronunciation":{"ipa":"sʌbɪnˈfɜːrɪŋ","syllables":"sub-in-fer-ring"},"inflection":{"verb_forms":{"present_simple":["subinfer","subinfers"],"past_simple":"subinferred","past_participle":"subinferred","present_participle":"subinferring"}},"usage_notes":{"explanation":"'Subinferring' is a technical term primarily used in the context of traditional Aristotelian logic. It refers to a specific type of logical inference where a particular statement is derived from a corresponding universal statement. This process is generally valid, but it's important to note that it relies on the assumption that the subject class is not empty. In modern predicate logic, this assumption may not always hold, which can affect the validity of the inference.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Subinferring is the same as generalizing.","correct":"Subinferring is the opposite of generalizing; it's specifying.","note":"Subinferring moves from a general statement to a specific one, not the other way around."}],"priority":"★☆☆"},"related_words":{"derivatives":["subinference (noun)"],"related_terms":["inference","deduction","logic","proposition","universal proposition","particular proposition","Aristotelian logic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. This is a specialized term used primarily in logic.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Subinferring' is a specialized term from logic. It means to derive a particular statement from a universal statement of the same type. For example, if you know that 'All dogs bark,' then you can subinfer that 'Some dogs bark.' This is a valid inference in traditional logic, but it assumes that there are actually dogs in existence. If there were no dogs, the inference wouldn't necessarily hold. This term is rarely used outside of formal logic discussions."},"example_sentences":[{"sentence":"When teaching logic, it's important to explain how to properly use subinferring.","translation":"論理学を教える際、下位推論を適切に使う方法を説明することが重要である。","type":"general","meaning_category":"explanation"},{"sentence":"By subinferring, we can move from the general claim to a specific instance.","translation":"下位推論によって、一般的な主張から特定の事例へと移行できる。","type":"general","meaning_category":"explanation"}]}