{"word":"autodialling","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にイギリス英語) オートダイヤル機能、自動ダイヤル機能","english_definition":"(chiefly British English) The process or facility of automatically dialling a telephone number.","examples":[{"sentence":"The phone system has autodialling.","translation":"その電話システムにはオートダイヤル機能がある。"},{"sentence":"Autodialling can save time when making many calls.","translation":"オートダイヤル機能は、多数の電話をかける際に時間を節約できる。"}],"collocations":["automatic autodialling","computer autodialling"],"synonyms":["automatic dialing","automated dialing"],"antonyms":["manual dialing"]}],"etymology":{"value":"'auto-' (automatic) + 'dialling' (the act of dialing a telephone number).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːtəʊˈdaɪəlɪŋ/","syllables":"au-to-di-al-ling"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Autodialling' refers to the automatic dialing of telephone numbers, often used in telemarketing or by businesses contacting many customers. It is more common in British English. The American English equivalent is 'automatic dialing' or 'automated dialing'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used autodialling to call each person by hand.","correct":"✓ He used autodialling to call each person automatically.","note":"Autodialling implies an automated process, not manual dialing."}],"priority":"★★☆"},"related_words":{"derivatives":["autodialler (noun): A device or software that performs autodialling."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Autodialling' is a term used to describe the automatic dialing of telephone numbers, often for telemarketing or business purposes. It's a technical term, so it's more common in business or IT contexts. It's more frequently used in British English; American English speakers often use 'automatic dialing' or 'automated dialing' instead."},"example_sentences":[{"sentence":"The company uses autodialling to contact potential customers.","translation":"その会社は、潜在的な顧客に連絡するためにオートダイヤル機能を使用している。","type":"noun","meaning_category":"自動ダイヤル機能"},{"sentence":"Autodialling software can greatly increase the efficiency of call centers.","translation":"オートダイヤルソフトウェアは、コールセンターの効率を大幅に向上させることができる。","type":"noun","meaning_category":"自動ダイヤル機能"}]}