{"word":"superrestriction","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)非常に厳しい制限、特別制限","english_definition":"An extremely strict limitation or restriction, especially one imposed by a court or regulatory body.","examples":[{"sentence":"The judge imposed a superrestriction on the defendant's travel, preventing them from leaving the country.","translation":"裁判官は被告の旅行に非常に厳しい制限を課し、出国を禁止した。"},{"sentence":"Due to repeated violations, the company is now under a superrestriction regarding its advertising practices.","translation":"度重なる違反のため、その会社は現在、広告活動に関して非常に厳しい制限を受けている。"}],"collocations":["impose a superrestriction","be under a superrestriction","superrestriction on travel","superrestriction on advertising"],"synonyms":["strict limitation","severe restriction","stringent constraint","prohibition","ban"],"antonyms":["freedom","liberty","unrestricted access","deregulation"]},{"part_of_speech":"noun","definition":"(プログラミング)スーパークラスに対する制約","english_definition":"(Programming) A constraint on a superclass, typically in object-oriented programming, limiting the types of subclasses that can inherit from it.","examples":[{"sentence":"The superrestriction on the base class ensures that only specific types of derived classes can be created.","translation":"基底クラスに対する制約により、特定の種類の派生クラスのみが作成可能になる。"},{"sentence":"By applying a superrestriction, the framework prevents developers from creating incompatible extensions.","translation":"制約を適用することで、フレームワークは開発者が互換性のない拡張機能を作成することを防ぐ。"}],"collocations":["apply a superrestriction","define a superrestriction","superrestriction on inheritance","type superrestriction"],"synonyms":["type constraint","inheritance restriction","class constraint"],"antonyms":["unrestricted inheritance","open inheritance"]}],"etymology":{"value":"The word is formed by combining \"super-\" (meaning above, beyond, or extremely) with \"restriction\" (meaning a limitation or constraint).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərɪˈstrɪkʃən/","syllables":"su-per-re-stric-tion"},"inflection":{"noun_plural":"superrestrictions"},"usage_notes":{"explanation":"The term \"superrestriction\" is relatively uncommon and context-dependent. In legal contexts, it signifies a particularly stringent or severe restriction. In programming, it refers to constraints placed on superclasses to control inheritance. The specific meaning depends heavily on the field in which it is used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The superrestriction was very liberate.","correct":"✓ The superrestriction was very limiting.","note":"\"Superrestriction\" implies a limitation, so it cannot be \"liberate\" (freeing). Use words like \"limiting,\" \"strict,\" or \"constraining\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":["restrict","restriction","super-"],"related_terms":["constraint","limitation","prohibition","regulation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Not commonly used in general conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"superrestriction\" is a technical term that is not frequently used in everyday language. It is used to describe a very strict or severe limitation, especially in legal or technical contexts. Understanding this word requires a good grasp of the meanings of \"super-\" and \"restriction\" and the ability to infer the combined meaning from context.","priority":"★★☆"},"example_sentences":[{"sentence":"The government imposed a superrestriction on the export of sensitive technology.","translation":"政府は機密技術の輸出に非常に厳しい制限を課した。","type":"noun","meaning_category":"Legal/Regulatory"},{"sentence":"The type system uses superrestrictions to enforce type safety during inheritance.","translation":"型システムは、継承時の型安全性を確保するために制約を使用する。","type":"noun","meaning_category":"Programming"}]}