{"word":"Menticide","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"精神破壊、洗脳","english_definition":"The systematic and intentional undermining of a person's or group's sense of identity and mental capabilities, often through psychological manipulation and indoctrination.","examples":[{"sentence":"The regime used menticide to control the population's thoughts and beliefs.","translation":"その政権は精神破壊を用いて国民の思考と信念を支配した。"},{"sentence":"The cult employed techniques of menticide to brainwash new recruits.","translation":"そのカルト教団は新入信者を洗脳するために精神破壊のテクニックを用いた。"}],"collocations":["practice menticide","employ menticide","techniques of menticide","effects of menticide"],"synonyms":["brainwashing","mind control","thought reform","psychological manipulation","indoctrination"],"antonyms":["enlightenment","education","critical thinking","free thought"]}],"etymology":{"value":"Coinage from 'menti-' (relating to the mind) and '-cide' (killing), modeled after homicide, suicide, etc. Coined by psychiatrist Joost Meerloo in his 1956 book 'The Rape of the Mind'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈmɛntɪsaɪd","syllables":"men-ti-cide"},"inflection":{"noun_plural":"menticides"},"usage_notes":{"explanation":"'Menticide' refers to the deliberate and systematic destruction of a person's or group's mind, often through psychological means. It involves undermining their sense of self, identity, and ability to think critically. The term is often used in the context of political oppression, cults, and other situations where individuals or groups seek to control the thoughts and beliefs of others.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He committed menticide on himself.","correct":"✓ He was subjected to menticide.","note":"Menticide is something done *to* someone, not something they commit themselves, unlike suicide or homicide."},{"incorrect":"✗ The debate was a form of menticide.","correct":"✓ The debate was a form of psychological manipulation.","note":"Menticide implies a systematic and intentional effort to destroy someone's mind, not just a vigorous debate or disagreement."}],"priority":"★★☆"},"related_words":{"derivatives":["menticidal (adjective)"],"phrasal_verbs":[],"related_concepts":["gaslighting","propaganda","thought control","coercive persuasion"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Menticide' is a relatively rare and complex term that describes the systematic destruction of a person's mind and sense of self. It is often used in academic or specialized contexts to discuss psychological manipulation, brainwashing, and thought control. Understanding this word requires a grasp of abstract concepts related to psychology, politics, and social control."},"example_sentences":[{"sentence":"The totalitarian regime used propaganda and psychological manipulation as tools of menticide.","translation":"全体主義体制は、プロパガンダと心理操作を精神破壊の道具として使用した。","type":"noun","meaning_category":"destruction of mind"},{"sentence":"Survivors of cults often require extensive therapy to recover from the menticide they experienced.","translation":"カルトの生存者は、経験した精神破壊から回復するために、広範囲なセラピーを必要とすることが多い。","type":"noun","meaning_category":"destruction of mind"},{"sentence":"The constant barrage of misinformation was a form of menticide aimed at eroding public trust.","translation":"絶え間ない誤情報の洪水は、国民の信頼を損なうことを目的とした精神破壊の一形態だった。","type":"noun","meaning_category":"destruction of mind"}]}