{"word":"bibliolater","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"聖書絶対主義者、聖書を文字通りに解釈し、絶対的な権威を認める人","english_definition":"One who engages in bibliolatry; one who excessively reveres the Bible or other books.","examples":[{"sentence":"He was accused of being a bibliolater because he refused to consider any interpretation of the scripture that wasn't literal.","translation":"彼は聖書を文字通りに解釈しない解釈を一切認めなかったため、聖書絶対主義者だと非難された。"},{"sentence":"Some critics argue that certain religious groups are bibliolaters, focusing too much on the text and not enough on its spirit.","translation":"一部の批評家は、特定の宗教団体は聖書絶対主義者であり、テキストに焦点を当てすぎて、その精神に十分注意を払っていないと主張している。"}],"collocations":["extreme bibliolater","strict bibliolater","literal bibliolater"],"synonyms":["scripturalist","fundamentalist","literalist"],"antonyms":["liberal interpreter","critical reader"]},{"part_of_speech":"noun","definition":"書物崇拝者、書物を過度に崇拝する人","english_definition":"One who excessively reveres books.","examples":[{"sentence":"He was such a bibliolater that he treated every book as if it were a sacred object.","translation":"彼は書物崇拝者だったので、すべての本を神聖な物のように扱った。"},{"sentence":"The old professor was a bibliolater, surrounded by stacks of books he could never bear to part with.","translation":"その老教授は書物崇拝者で、手放すことのできない本の山に囲まれていた。"}],"collocations":["avid bibliolater","passionate bibliolater","dedicated bibliolater"],"synonyms":["book worshiper","book lover (excessive)","bibliophile (excessive)"],"antonyms":["book hater","misobook"]}],"etymology":{"value":"From 'biblio-' (book) + '-later' (worshipper), derived from Greek 'biblion' (book) and 'latreia' (worship).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbɪbliˈɒlətər/","syllables":"bib-li-ol-a-ter"},"inflection":{"noun_plural":"bibliolaters"},"usage_notes":{"explanation":"The term 'bibliolater' is often used critically to describe someone who treats a text, especially the Bible, with excessive reverence, sometimes to the point of ignoring context or critical analysis. It can also refer more generally to someone who excessively reveres books.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a bibliolater, so he always read books.","correct":"✓ He is a bibliolater, so he treats books as sacred objects.","note":"The term implies excessive reverence, not just reading books."},{"incorrect":"✗ Bibliolater is a type of book.","correct":"✓ A bibliolater is a person who excessively reveres books.","note":"Bibliolater is a person, not a type of book."}],"priority":"★☆☆"},"related_words":{"derivatives":["bibliolatry (noun: excessive worship of books or the Bible)","bibliolatrous (adjective: characterized by bibliolatry)"],"phrases":["bibliolatrous tendencies","bibliolatrous interpretations"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bibliolater' is a relatively uncommon word used to describe someone who excessively reveres books, especially the Bible. It is often used in a critical context to suggest that someone is too focused on the literal interpretation of a text without considering its broader context or meaning. The word is derived from Greek roots, combining 'biblio-' (book) and '-later' (worshipper)."},"example_sentences":[{"sentence":"The professor warned against becoming a bibliolater, emphasizing the importance of critical thinking.","translation":"教授は聖書絶対主義者になることを戒め、批判的思考の重要性を強調した。","type":"noun","meaning_category":"聖書絶対主義者"},{"sentence":"As a self-proclaimed bibliolater, he spent his life collecting rare and ancient books.","translation":"自称書物崇拝者として、彼は生涯をかけて希少な古書を収集した。","type":"noun","meaning_category":"書物崇拝者"}]}