{"word":"infra-angelic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(theology) Lower than or beneath the angels; pertaining to a state or condition below that of angels.","english_definition":"(theology) Situated below or inferior to the angels; pertaining to a state or condition beneath that of angels.","examples":[{"sentence":"The infra-angelic realm is often associated with human existence in theological contexts.","translation":"神学的な文脈では、天使よりも低い領域はしばしば人間の存在と関連付けられます。"},{"sentence":"Some philosophical traditions posit a hierarchy of beings, with humans occupying an infra-angelic position.","translation":"一部の哲学的伝統では、存在の階層を仮定し、人間は天使よりも低い位置を占めています。"}],"collocations":["infra-angelic state","infra-angelic realm","infra-angelic being"],"synonyms":["sub-angelic","lower than angels"],"antonyms":["super-angelic","angelic","higher than angels"]}],"etymology":{"value":"The term is formed by combining the prefix 'infra-' (meaning below or beneath) with 'angelic' (relating to angels).","priority":"★★★"},"pronunciation":{"ipa":"ˌɪnfrə ænˈdʒɛlɪk","syllables":"in-fra-an-gel-ic"},"inflection":{},"usage_notes":{"explanation":"'Infra-angelic' is primarily used in theological or philosophical discussions to describe beings or states that are considered lower or inferior to angels in a hierarchical structure. It is not a commonly used term in everyday language.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["infra- (prefix meaning below)","angelic (adjective relating to angels)"],"related_terms":["angelology","hierarchy of angels","spiritual beings"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in specialized theological or philosophical contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'infra-angelic' is highly specialized and primarily found in theological or philosophical texts. Understanding requires knowledge of hierarchical models of spiritual beings and the prefix 'infra-'. Due to its limited use and specific context, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"In certain theological frameworks, humans are considered to exist in an infra-angelic condition, striving for spiritual elevation.","translation":"特定の神学的な枠組みでは、人間は精神的な向上を目指して、天使よりも低い状態で存在すると考えられています。","type":"adjective","meaning_category":"theological context"},{"sentence":"The philosopher described the material world as an infra-angelic sphere, distant from divine perfection.","translation":"その哲学者は、物質世界を神の完璧さから遠い、天使よりも低い領域として説明しました。","type":"adjective","meaning_category":"philosophical context"}]}