{"word":"portendance","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"予兆、前兆、兆候","english_definition":"An indication or omen of something about to happen, especially something momentous or calamitous.","examples":[{"sentence":"The dark clouds gathering on the horizon had a portendance of a severe storm.","translation":"地平線に集まる暗い雲は、激しい嵐の前兆だった。"},{"sentence":"The sudden drop in the stock market had a portendance of an economic downturn.","translation":"株式市場の突然の下落は、景気後退の兆候だった。"},{"sentence":"Some people believe that black cats crossing your path have a portendance of bad luck.","translation":"黒猫が道を横切ると不運の前兆だと信じる人もいる。"}],"collocations":["a portendance of doom (破滅の前兆)","a portendance of disaster (災害の前兆)","a portendance of change (変化の兆候)","a portendance of things to come (来たるべきものの前兆)"],"synonyms":["omen","augury","presage","prognostic","foreboding","harbinger","sign","indication","warning"],"antonyms":["reassurance","certainty","confirmation"]}],"etymology":{"value":"Derived from 'portend,' which comes from the Latin 'portendere,' meaning 'to indicate beforehand, to foretell.' 'Portendere' is composed of 'por-' (forward) and 'tendere' (to stretch, extend).","priority":"★★☆"},"pronunciation":{"ipa":"/pɔrˈtɛndəns/","syllables":"por-ten-dance"},"inflection":{"noun_plural":"portendances"},"usage_notes":{"explanation":"'Portendance' is a formal word that suggests a significant or ominous foreshadowing. It is often used in literature or formal speech to create a sense of anticipation or dread. While synonyms like 'sign' or 'indication' can be used in everyday conversation, 'portendance' carries a heavier, more dramatic weight.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The portendance was obvious, so everyone ignored it.","correct":"✓ The portendance was obvious, but everyone ignored it.","note":"The sentence should indicate that despite the obvious warning, people still ignored it, creating a sense of impending doom."},{"incorrect":"✗ The portendance of the good news made everyone happy.","correct":"✓ The harbinger of the good news made everyone happy.","note":"'Portendance' usually implies a negative or ominous event. For good news, use 'harbinger' or 'omen' in a positive context."}],"priority":"★☆☆"},"related_words":{"derivatives":["portend (verb: to be a sign or warning that something momentous or calamitous is likely to happen)","portent (noun: a sign or warning that something momentous or calamitous is likely to happen)","portentous (adjective: of or like a portent; ominous)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Portendance' is a relatively uncommon and formal word, generally used in literary or academic contexts. It signifies an omen or indication, especially of something significant or ominous about to occur. The word is best understood and used by those with a strong vocabulary and a good understanding of nuanced language. It is not typically used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The eerie silence before the storm had a chilling portendance.","translation":"嵐の前の不気味な静けさは、身の毛もよだつ前兆だった。","type":"noun","meaning_category":"予兆・前兆"},{"sentence":"The prophet claimed to see portendances of the kingdom's downfall in the stars.","translation":"預言者は、星の中に王国の崩壊の兆候を見たと言った。","type":"noun","meaning_category":"予兆・前兆"},{"sentence":"The economic indicators had a portendance of a looming recession.","translation":"経済指標は、差し迫った景気後退の兆候を示していた。","type":"noun","meaning_category":"兆候"}]}