{"word":"interferometer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"干渉計","english_definition":"An instrument that uses the interference of light waves to make precise measurements of distances, thicknesses, and other physical quantities.","examples":[{"sentence":"The interferometer is used to measure the wavelength of light.","translation":"その干渉計は光の波長を測定するために使われる。"},{"sentence":"Astronomers use interferometers to observe distant stars.","translation":"天文学者たちは遠い星を観測するために干渉計を使う。"},{"sentence":"The LIGO interferometer detected gravitational waves.","translation":"LIGO干渉計は重力波を検出した。"}],"collocations":["optical interferometer (光干渉計)","radio interferometer (電波干渉計)","Michelson interferometer (マイケルソン干渉計)","gravitational wave interferometer (重力波干渉計)"],"synonyms":["interferometric device"],"antonyms":[]}],"etymology":{"value":"The word \"interferometer\" is derived from \"interference\" (the superposition of waves) and \"-meter\" (an instrument for measuring).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərfəˈrɒmɪtər/","syllables":"in-ter-fer-om-e-ter"},"inflection":{"noun_plural":"interferometers"},"usage_notes":{"explanation":"An interferometer works by splitting a beam of light into two or more paths, then recombining them. The interference pattern created when the beams recombine reveals information about the differences in the path lengths, which can be used to measure distances, refractive indices, and other physical quantities with high precision.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The interferometers are using to measure the distance.","correct":"✓ Interferometers are used to measure the distance.","note":"\"Interferometers\" is plural, so the plural form of the verb \"to be\" (are) should be used."}],"priority":"★☆☆"},"related_words":{"derivatives":["interferometry (干渉法)","interferometric (干渉法の)"],"related_terms":["optics (光学)","wave interference (波の干渉)","diffraction (回折)"],"priority":"★★☆"},"level_frequency":{"level":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"An interferometer is a scientific instrument that uses the phenomenon of wave interference to make very precise measurements. It splits a beam of light or other wave into multiple paths, then recombines them. The resulting interference pattern provides information about the differences in the path lengths, allowing for highly accurate measurements of distance, thickness, refractive index, and other physical properties. They are used in various fields, including astronomy, physics, and engineering."},"example_sentences":[{"sentence":"The **interferometer** at the observatory is used to study distant galaxies.","translation":"天文台の干渉計は遠い銀河を研究するために使われている。","type":"noun","meaning_category":"instrument"},{"sentence":"The **interferometer**'s data provided crucial evidence for the existence of gravitational waves.","translation":"その干渉計のデータは重力波の存在に対する重要な証拠を提供した。","type":"noun","meaning_category":"instrument"},{"sentence":"Scientists are developing new types of **interferometers** for medical imaging.","translation":"科学者たちは医療画像処理のための新しい種類の干渉計を開発している。","type":"noun","meaning_category":"instrument"}]}