{"word":"cypselomorphic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(鳥類学) アマツバメ目の鳥類に特有の、またはそれらに類似した。特に、足の構造や形態に関して用いられる。","english_definition":"(Ornithology) Pertaining to, or resembling, the swifts (order Apodiformes, formerly Cypselomorphae), especially in terms of foot structure and morphology.","examples":[{"sentence":"The cypselomorphic feet of swifts are adapted for clinging to vertical surfaces.","translation":"アマツバメ目の鳥類の持つcypselomorphicな足は、垂直面に掴まることに適応している。"}],"collocations":["cypselomorphic feet","cypselomorphic morphology"],"synonyms":["apodiform","swift-like"],"antonyms":[]}],"etymology":{"value":"Derived from the now-obsolete taxonomic grouping 'Cypselomorphae' (formerly used to classify swifts and related birds) + '-morphic' (having the form of). 'Cypselus' is a genus of swifts, from Greek 'kupselos' (swift).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪpsɪloʊˈmɔːrfɪk/","syllables":"cyp-se-lo-mor-phic"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"This term is primarily used in ornithology to describe the unique foot structure of swifts and related birds. Their feet are adapted for clinging rather than perching, with all four toes pointing forward or being able to rotate forward. The term highlights the morphological adaptations specific to this group of birds.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cypselomorphic bird flew gracefully through the air.","correct":"✓ The swift flew gracefully through the air.","note":"'Cypselomorphic' describes a specific anatomical feature, not the overall appearance or behavior of the bird. Using 'swift' is more appropriate in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["Cypselomorphae (obsolete taxonomic grouping)","apodiform (related term for the order Apodiformes)"],"phrases":["cypseloid (related term)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized term)","frequency_google_ngram":"Very low frequency - a specialized term used in ornithology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'cypselomorphic' is a highly specialized term used primarily within the field of ornithology. It describes the unique foot structure and morphology characteristic of swifts (order Apodiformes). Understanding this term requires familiarity with avian anatomy and taxonomic classifications. It is not commonly used outside of specialized scientific contexts."},"example_sentences":[{"sentence":"The museum exhibit detailed the cypselomorphic adaptations of swift feet.","translation":"博物館の展示では、アマツバメの足のcypselomorphicな適応について詳しく説明していた。","type":"adjective","meaning_category":"ornithology"},{"sentence":"A key feature used to classify birds in the Cypselomorphae group was their cypselomorphic foot structure.","translation":"Cypselomorphae群の鳥類を分類するために用いられた重要な特徴は、彼らのcypselomorphicな足の構造であった。","type":"adjective","meaning_category":"ornithology"}]}