{"word":"usufructuaries","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 用益権者 (財産から利益を得る権利を持つ人) の複数形","english_definition":"plural of usufructuary: a person who has the right to enjoy the use and advantages of another's property short of the destruction or alienation of the substance","examples":[{"sentence":"The usufructuaries were entitled to the income from the estate.","translation":"その用益権者たちは、その地所からの収入を得る権利を有していた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'usufructuary,' which comes from the Latin 'ususfructus' (use and enjoyment of fruits), from 'usus' (use) + 'fructus' (fruit, enjoyment).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjuːzʊˈfrʌktʃuˌɛriz/","syllables":"u-su-fruct-u-ar-ies"},"inflection":{"noun_plural":"usufructuaries"},"usage_notes":{"explanation":"'Usufructuaries' refers to multiple individuals or entities holding a usufruct, which is a legal right to enjoy the benefits and profits of property that is not their own, without damaging or diminishing its value. This term is primarily used in legal and financial contexts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["usufruct (noun): the right to enjoy the use and advantages of another's property","usufructuary (adjective): relating to usufruct"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'usufructuaries' is a highly specialized legal term referring to multiple holders of a usufruct, which is the right to enjoy the use and advantages of something belonging to another. It is rarely encountered outside of legal or financial discussions."},"example_sentences":[{"sentence":"The agreement specified the rights of the usufructuaries.","translation":"その合意は、用益権者たちの権利を明記していた。","type":"noun","meaning_category":"legal"},{"sentence":"Several usufructuaries benefited from the agricultural land.","translation":"数名の用益権者がその農地から利益を得ていた。","type":"noun","meaning_category":"legal"}]}