{"word":"malleablize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(材料を)可鍛性にする、展性にする","english_definition":"To make (a material) malleable; to render capable of being shaped or formed, especially by hammering or pressure.","examples":[{"sentence":"The blacksmith heated the iron to malleablize it before shaping it into a horseshoe.","translation":"鍛冶屋は、蹄鉄の形にする前に、鉄を可鍛性にするために加熱した。"},{"sentence":"The process involves heating the metal to malleablize it for easier manipulation.","translation":"その工程では、より簡単に操作できるように、金属を可鍛性にするために加熱する。"}],"collocations":["malleablize metal (金属を可鍛性にする)","malleablize iron (鉄を可鍛性にする)","malleablize clay (粘土を可鍛性にする)"],"synonyms":["soften","plasticize","temper","ductilize"],"antonyms":["harden","stiffen","rigidify"]}],"etymology":{"value":"Derived from 'malleable' (capable of being shaped) + '-ize' (a suffix indicating to make or become).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmæliəblaɪz/","syllables":"mal-le-a-blize"},"inflection":{"verb_forms":{"present_simple":["malleablize","malleablizes"],"past_simple":"malleablized","past_participle":"malleablized","present_participle":"malleablizing"}},"usage_notes":{"explanation":"'Malleablize' is a relatively uncommon verb that specifically refers to the process of making a material malleable, meaning capable of being shaped or formed, often by hammering or pressure. It is most often used in technical or industrial contexts when discussing materials science or manufacturing processes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist malleablized his emotions into the sculpture.","correct":"✓ The artist channeled his emotions into the sculpture.","note":"'Malleablize' refers to physical materials, not abstract concepts like emotions. Use 'channel' or another appropriate verb instead."},{"incorrect":"✗ The clay was already malleablized when I bought it.","correct":"✓ The clay was already malleable when I bought it.","note":"If the clay is already capable of being shaped, the adjective 'malleable' is more appropriate than the verb 'malleablized'."}],"priority":"★★☆"},"related_words":{"derivatives":["malleable (adjective: capable of being shaped)","malleability (noun: the quality of being malleable)"],"related_terms":["ductile (adjective: capable of being drawn into wires)","plastic (adjective: capable of being molded or shaped)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Malleablize' is a technical term used to describe the process of making a material malleable, meaning capable of being shaped or formed, often by hammering or pressure. It is primarily used in contexts related to materials science, engineering, or manufacturing. The word is not commonly encountered in everyday language. Understanding the root word 'malleable' is crucial for comprehending the meaning of 'malleablize.'"},"example_sentences":[{"sentence":"The high temperature is necessary to malleablize the alloy.","translation":"合金を可鍛性にするためには高温が必要である。","type":"verb","meaning_category":"可鍛性にする"},{"sentence":"They malleablized the gold by repeatedly heating and hammering it.","translation":"彼らは金を繰り返し加熱し、ハンマーで叩いて可鍛性にした。","type":"verb","meaning_category":"可鍛性にする"},{"sentence":"The process to malleablize the polymer involves adding specific plasticizers.","translation":"ポリマーを可鍛性にするプロセスには、特定の可塑剤の添加が含まれる。","type":"verb","meaning_category":"可鍛性にする"}]}