{"word":"Metaphysicianism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"形而上学主義：形而上学的な概念や理論を重視する立場、または形而上学的な探求に過度な重要性を置く傾向。","english_definition":"An emphasis on metaphysical concepts and theories; the tendency to place excessive importance on metaphysical inquiry.","examples":[{"sentence":"His philosophical approach was criticized as leaning too heavily towards metaphysicianism, neglecting practical applications.","translation":"彼の哲学的なアプローチは、形而上学主義に偏りすぎており、実用的な応用を軽視していると批判された。"},{"sentence":"The debate centered on whether the author's work represented genuine philosophical insight or mere metaphysicianism.","translation":"議論は、著者の作品が真の哲学的洞察を表しているのか、単なる形而上学主義を表しているのかという点に集中した。"}],"collocations":["philosophical metaphysicianism (哲学的な形而上学主義)","pure metaphysicianism (純粋な形而上学主義)","abstract metaphysicianism (抽象的な形而上学主義)"],"synonyms":["metaphysics","abstract philosophy","speculative thought"],"antonyms":["empiricism","positivism","pragmatism"]}],"etymology":{"value":"\"Metaphysician\"（形而上学者）に \"-ism\"（主義、傾向）を付加した造語。形而上学（metaphysics）の研究者や信奉者の立場や傾向を示す。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌmɛtəfɪˈzɪʃənɪzəm/","syllables":"me-ta-phy-si-cian-i-sm"},"inflection":{"noun_plural":"Metaphysicianisms (複数形は稀)"},"usage_notes":{"explanation":"「Metaphysicianism」は、形而上学的な思考や理論を過度に重視する傾向を指す言葉であり、しばしば批判的な意味合いで使用されます。実証的な証拠や現実的な応用を軽視し、抽象的で思弁的な議論に偏っていると見なされる場合に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scientist dismissed the theory as pure metaphysicianism because it lacked any empirical support.","correct":"✓ The scientist dismissed the theory as pure metaphysics because it lacked any empirical support.","note":"この文脈では、理論自体が経験的裏付けを欠いているため、単に「metaphysics（形而上学）」と表現する方が適切です。「metaphysicianism」は、形而上学への過度な傾倒を批判する際に用いる言葉です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["metaphysician (形而上学者)","metaphysical (形而上学的な)","metaphysics (形而上学)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Metaphysicianism」は、形而上学的な概念や理論を過度に重視する傾向を指す、非常に専門的な用語です。この言葉は、実証的な証拠や現実的な応用を軽視し、抽象的で思弁的な議論に偏っていると見なされる場合に、しばしば批判的な意味合いで使用されます。哲学的な議論や学術的な文脈で用いられることが多く、日常会話ではほとんど使用されません。"},"example_sentences":[{"sentence":"The philosopher's work was criticized for its excessive focus on metaphysicianism and lack of practical relevance.","translation":"その哲学者の作品は、形而上学主義への過度な偏りと実用性の欠如で批判された。","type":"noun","meaning_category":"形而上学主義"},{"sentence":"Some scholars argue that certain schools of thought represent a form of metaphysicianism, disconnected from empirical reality.","translation":"一部の学者は、特定の学派が経験的現実から切り離された形而上学主義の一形態を表していると主張している。","type":"noun","meaning_category":"形而上学主義"}]}