{"word":"operatory","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(歯科医院などの)診療室、手術室","english_definition":"A room or area in a dental or medical office where dental or medical procedures are performed.","examples":[{"sentence":"The dentist asked the assistant to prepare the operatory for the next patient.","translation":"歯科医はアシスタントに、次の患者のために診療室の準備をするように頼んだ。"},{"sentence":"The operatory was equipped with the latest dental technology.","translation":"その診療室には最新の歯科医療技術が装備されていた。"},{"sentence":"The patient was escorted to the operatory for their appointment.","translation":"患者は予約のために診療室へ案内された。"}],"collocations":["dental operatory","medical operatory","prepare the operatory","clean the operatory","operatory equipment"],"synonyms":["treatment room","examination room","procedure room","clinic room","surgical suite"],"antonyms":[]}],"etymology":{"value":"Derived from \"operate\" + \"-ory\" (suffix indicating a place or thing associated with the root word).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɒpərəˌtɔːri/","syllables":"op-er-a-to-ry"},"inflection":{"noun_plural":"operatories"},"usage_notes":{"explanation":"The term \"operatory\" is primarily used in the context of dental and medical practices. It refers specifically to the room where procedures are carried out. It is more precise than a general term like \"room\" or \"office.\"","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor's operatory is very big office.","correct":"✓ The doctor's operatory is a very big room.","note":"'Operatory' is a specific type of room, not a general office. While it might be part of an office, it's the procedure room itself."},{"incorrect":"✗ I went to the operatory to pay my bill.","correct":"✓ I went to the reception desk to pay my bill.","note":"The operatory is for treatment, not administrative tasks like paying bills."}],"priority":"★★☆"},"related_words":{"derivatives":["operate","operation","operative"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'operatory' is a specialized term primarily used in dental and medical settings. It refers to the specific room where medical or dental procedures are performed. Understanding this term requires some familiarity with medical or dental environments."},"example_sentences":[{"sentence":"The dental hygienist meticulously cleaned each instrument in the **operatory**.","translation":"歯科衛生士は診療室内の各器具を丁寧に清掃した。","type":"noun","meaning_category":"診療室"},{"sentence":"The new **operatory** design improved workflow and patient comfort.","translation":"新しい診療室のデザインは、作業効率と患者の快適性を向上させた。","type":"noun","meaning_category":"診療室"},{"sentence":"The doctor reviewed the patient's chart before entering the **operatory**.","translation":"医師は診療室に入る前に患者のカルテを確認した。","type":"noun","meaning_category":"診療室"}]}