{"word":"zoopsychologist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"動物心理学者","english_definition":"A psychologist who studies the behavior and mental processes of animals.","examples":[{"sentence":"The zoopsychologist conducted experiments to understand canine cognition.","translation":"その動物心理学者は、犬の認知を理解するために実験を行った。"},{"sentence":"Zoopsychologists often work in zoos or research facilities.","translation":"動物心理学者は、しばしば動物園や研究施設で働く。"}],"collocations":["animal behavior","animal cognition","comparative psychology","veterinary behaviorist"],"synonyms":["animal behaviorist","comparative psychologist"],"antonyms":[]}],"etymology":{"value":"The word \"zoopsychologist\" is formed from the combination of \"zoo-\" (referring to animals), \"psycho-\" (referring to the mind or mental processes), and \"-logist\" (a person who studies a particular subject).","priority":"★★☆"},"pronunciation":{"ipa":"ˌzoʊ.oʊ.saɪˈkɑː.lə.dʒɪst","syllables":"zo-o-sy-chol-o-gist"},"inflection":{"noun_plural":"zoopsychologists"},"usage_notes":{"explanation":"A zoopsychologist is a professional who applies psychological principles to the study of animal behavior. They may investigate various aspects of animal cognition, emotion, and social behavior. Their work can contribute to animal welfare, conservation efforts, and our understanding of the evolution of behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ zoopsychology","correct":"✓ zoopsychologist","note":"\"Zoopsychology\" is the field of study, while \"zoopsychologist\" is the person who practices it."}],"priority":"★★☆"},"related_words":{"derivatives":["zoopsychology"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"zoopsychologist\" refers to a specialized psychologist who focuses on the study of animal behavior and mental processes. This field combines zoology and psychology to understand how animals think, feel, and behave. Zoopsychologists often conduct research, work in animal care settings, or contribute to conservation efforts by applying their knowledge of animal behavior. The term is relatively uncommon in everyday conversation but is used within academic and professional contexts related to animal studies."},"example_sentences":[{"sentence":"The zoo hired a zoopsychologist to improve the well-being of the animals.","translation":"動物園は動物たちの幸福度を向上させるために動物心理学者を雇った。","type":"noun","meaning_category":"animal welfare"},{"sentence":"Zoopsychologists use various methods to study animal behavior, including observation and experimentation.","translation":"動物心理学者は、観察や実験など、さまざまな方法を用いて動物の行動を研究する。","type":"noun","meaning_category":"animal behavior research"}]}