{"word":"mutagenically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"突然変異誘発的に、変異原的に","english_definition":"In a manner that causes or relates to mutagenesis (the process by which the genetic information of an organism is changed, resulting in a mutation).","examples":[{"sentence":"The cells were treated mutagenically to induce genetic changes.","translation":"遺伝的変化を誘発するために、細胞は突然変異誘発的に処理された。"},{"sentence":"Certain chemicals can act mutagenically, increasing the risk of mutations.","translation":"特定の化学物質は突然変異誘発的に作用し、突然変異のリスクを高める可能性がある。"}],"collocations":["treated mutagenically","act mutagenically"],"synonyms":["mutationally","genetically"],"antonyms":[]}],"etymology":{"value":"Derived from 'mutagenic' (capable of causing mutation) and the suffix '-ally' (in a specified manner).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmjuːtəˈdʒɛnɪkli/","syllables":"mu-ta-gen-i-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Mutagenically' describes the manner in which something causes mutations. It is primarily used in scientific and technical contexts, especially in genetics, biology, and related fields. The term implies that the action or substance in question has the capability to induce changes in the genetic material of an organism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The virus affected the cells mutagenic.","correct":"✓ The virus affected the cells mutagenically.","note":"'Mutagenic' is an adjective, while 'mutagenically' is an adverb. Use the adverb to describe how something is acting or affecting something else."}],"priority":"★★☆"},"related_words":{"derivatives":["mutagen (noun): A chemical or physical agent that causes mutations.","mutagenic (adjective): Capable of causing mutation.","mutagenesis (noun): The process by which genetic information is changed, resulting in a mutation.","mutation (noun): The changing of the structure of a gene, resulting in a variant form that may be transmitted to subsequent generations, caused by alteration of single base units in DNA, or the deletion, insertion, or rearrangement of larger sections of genes or chromosomes."],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'mutagenically' is a technical term used in the fields of genetics and biology. It describes something that causes mutations, which are changes in the genetic material of an organism. This word is not commonly used in everyday language and is typically found in scientific literature or discussions related to genetics, molecular biology, and toxicology. Understanding this word requires a basic knowledge of genetics and the processes that can alter DNA or RNA."},"example_sentences":[{"sentence":"The researchers exposed the bacteria mutagenically to UV radiation.","translation":"研究者たちは細菌を突然変異誘発的に紫外線に暴露した。","type":"adverb","meaning_category":"mutation induction"},{"sentence":"The chemical compound was tested to determine if it acted mutagenically on the cells.","translation":"その化合物が細胞に突然変異誘発的に作用するかどうかを判定するために試験された。","type":"adverb","meaning_category":"mutation risk"}]}