{"word":"medium-intensity","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"中程度の強度の、中強度の","english_definition":"having a level of intensity that is neither high nor low; moderate in strength or degree.","examples":[{"sentence":"The doctor recommended medium-intensity exercise for her health.","translation":"医者は彼女の健康のために中強度の運動を勧めた。"},{"sentence":"This workout is designed for medium-intensity cardio.","translation":"このワークアウトは中強度の有酸素運動のために設計されている。"},{"sentence":"We are using medium-intensity lighting for the stage.","translation":"舞台照明には中程度の強さの照明を使用している。"}],"collocations":["medium-intensity exercise","medium-intensity workout","medium-intensity cardio","medium-intensity training","medium-intensity lighting","medium-intensity activity"],"synonyms":["moderate-intensity","mid-intensity"],"antonyms":["high-intensity","low-intensity"]}],"etymology":{"value":"Combination of 'medium' (indicating a middle level or degree) and 'intensity' (referring to the strength or force of something).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌmiːdiəm ɪnˈtɛnsɪti/","syllables":"me-di-um in-ten-si-ty"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Medium-intensity' is used to describe something that is neither very strong nor very weak. It is commonly used in the context of physical activity and exercise, but can also be applied to other areas like lighting or sound. It indicates a level that is in the middle range.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I prefer a medium intensity exercise.","correct":"✓ I prefer medium-intensity exercise.","note":"'Medium-intensity' is a compound adjective and should be hyphenated when it precedes the noun it modifies. Also, 'exercise' is often used as an uncountable noun in this context."}],"priority":"☆☆☆"},"related_words":{"derivatives":["intensity","medium","high-intensity","low-intensity"],"related_terms":["moderate","cardio","exercise","workout","training","lighting"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (fitness, health).","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"'Medium-intensity' is a term used to describe something that has a level of strength or force that is neither very high nor very low. It's often used in fitness to describe workouts that are not too easy and not too difficult. If you see this term, it means something is in the middle range of strength or effort."},"example_sentences":[{"sentence":"The fitness tracker monitors whether you are doing low, medium or high-intensity activity.","translation":"フィットネストラッカーは、低強度、中強度、高強度の活動をしているかどうかを監視します。","type":"adjective","meaning_category":"degree of intensity"},{"sentence":"For best results, combine both medium-intensity steady state cardio with high-intensity interval training.","translation":"最良の結果を得るには、中強度の定常状態有酸素運動と高強度のインターバルトレーニングを組み合わせます。","type":"adjective","meaning_category":"exercise type"},{"sentence":"The study investigated the benefits of medium-intensity exercise on cardiovascular health.","translation":"この研究では、中強度の運動が心血管の健康に及ぼす影響について調査しました。","type":"adjective","meaning_category":"exercise benefit"}]}