{"word":"uncourtlike","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"宮廷らしくない、礼儀正しくない、洗練されていない","english_definition":"Not befitting or characteristic of a court; lacking in the manners, elegance, or sophistication expected in a royal court.","examples":[{"sentence":"His uncourtlike behavior offended the queen.","translation":"彼の宮廷らしくない振る舞いは女王の気分を害した。"},{"sentence":"The peasant's uncourtlike manners were evident in his clumsy bow.","translation":"その農民の宮廷らしくない態度は、彼の不器用なお辞儀に明らかだった。"},{"sentence":"She found his uncourtlike honesty refreshing, compared to the flattery of the courtiers.","translation":"彼女は廷臣たちのへつらいに比べて、彼の宮廷らしくない正直さを新鮮に感じた。"}],"collocations":["uncourtlike behavior","uncourtlike manners","uncourtlike honesty","uncourtlike appearance"],"synonyms":["boorish","crude","inelegant","unsophisticated","rustic","gauche"],"antonyms":["courtly","refined","elegant","sophisticated","urbane","polished"]}],"etymology":{"value":"\"un-\" (否定の接頭辞) + \"courtlike\" (宮廷のような)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈkɔːrtlaɪk/","syllables":"un-court-like"},"inflection":{"adjective_forms":{"comparative":"more uncourtlike","superlative":"most uncourtlike"}},"usage_notes":{"explanation":"\"Uncourtlike\" describes something that is not in keeping with the expected standards of behavior, appearance, or manners in a royal court. It suggests a lack of refinement, elegance, or sophistication. It is often used to contrast someone or something with the perceived norms of courtly life.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted uncourtlike at the party.","correct":"✓ He behaved in an uncourtlike manner at the party.","note":"\"Uncourtlike\" is an adjective and should modify a noun. To describe how someone acted, use \"in an uncourtlike manner\" or rephrase the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["courtlike (形容詞: 宮廷のような、礼儀正しい)","courtliness (名詞: 宮廷的な礼儀正しさ、上品さ)"],"phrases":["behave in an uncourtlike manner","display uncourtlike qualities"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"uncourtlike\" is a relatively uncommon word that describes something that is not typical or appropriate for a royal court. It implies a lack of refinement, elegance, or proper manners. It is often used to contrast someone's behavior or appearance with the expected norms of courtly life. Understanding this word requires a good vocabulary and an understanding of the social expectations of historical royal courts."},"example_sentences":[{"sentence":"His uncourtlike attire, consisting of simple homespun clothes, stood out among the richly dressed nobles.","translation":"彼の宮廷らしくない服装、つまり簡素な自家製の服は、豪華な服を着た貴族たちの中で際立っていた。","type":"adjective","meaning_category":"服装"},{"sentence":"The king was amused by the jester's uncourtlike jokes, which poked fun at the royal family.","translation":"王は、王室をからかう道化師の宮廷らしくない冗談に楽しんだ。","type":"adjective","meaning_category":"ユーモア"},{"sentence":"Her uncourtlike directness, though sometimes startling, was appreciated by those tired of political games.","translation":"彼女の宮廷らしくない率直さは、時には驚くべきものであったが、政治的な駆け引きにうんざりしていた人々には感謝された。","type":"adjective","meaning_category":"性格"}]}