{"word":"diathetic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(化学、医学) ジアテース性の、ジアテースに関連する","english_definition":"Relating to or characterized by diathesis.","examples":[{"sentence":"The diathetic constitution of the patient made them susceptible to various illnesses.","translation":"その患者のジアテース体質は、彼らを様々な病気に罹りやすくした。"}],"collocations":["diathetic constitution","diathetic condition"],"synonyms":["predisposed","susceptible","vulnerable"],"antonyms":["resistant","immune"]},{"part_of_speech":"adjective","definition":"(言語学、まれ) 態に関連する","english_definition":"Relating to grammatical voice or diathesis.","examples":[{"sentence":"The diathetic properties of the verb determine its transitivity.","translation":"その動詞の態的特性は、その他動性を決定する。"}],"collocations":["diathetic alternation","diathetic verb"],"synonyms":["voice-related","transitivity-related"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek διάθεσις (diáthesis, “arrangement, condition, disposition”), from διατίθημι (diatíthēmi, “to arrange, put in order”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪəˈθɛtɪk/","syllables":"di-a-thet-ic"},"inflection":{"notes":"Adjective, comparative and superlative forms are diathetic, more diathetic, most diathetic"},"usage_notes":{"explanation":"The term \"diathetic\" is primarily used in medical and chemical contexts to describe conditions or substances related to diathesis (a predisposition towards certain diseases or conditions). Its linguistic usage is rare, referring to grammatical voice or diathesis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The diathetic music created a peaceful atmosphere.","correct":"✓ The soothing music created a peaceful atmosphere.","note":"\"Diathetic\" is not typically used to describe music or atmosphere. Use words like \"soothing,\" \"calming,\" or \"peaceful\" instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["diathesis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Diathetic\" is a technical term primarily used in medical and linguistic contexts. It refers to a predisposition to certain conditions or relates to grammatical voice. Due to its specialized usage, it's not commonly encountered in general English. Understanding requires knowledge of related concepts like \"diathesis\" in medicine or grammatical voice in linguistics."},"example_sentences":[{"sentence":"The patient's **diathetic** predisposition made them more likely to develop allergies.","translation":"その患者のジアテース的な素因は、彼らをアレルギーを発症しやすくした。","type":"adjective","meaning_category":"medical"},{"sentence":"The **diathetic** alternation of the verb changes its meaning slightly.","translation":"その動詞の態的交替は、その意味をわずかに変える。","type":"adjective","meaning_category":"linguistic"}]}