{"word":"townhome","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"タウンホーム、連棟式住宅","english_definition":"a house that is joined to other similar houses in a row.","examples":[{"sentence":"We are looking to buy a townhome in the suburbs.","translation":"郊外にタウンホームを買おうと思っています。"},{"sentence":"The townhomes in this neighborhood are all very well-maintained.","translation":"この近所のタウンホームはすべて手入れが行き届いています。"},{"sentence":"A townhome is a good option for people who want more space than an apartment but don't want to deal with a large yard.","translation":"タウンホームは、アパートよりも広いスペースが欲しいけれど、広い庭の手入れをしたくない人にとって良い選択肢です。"}],"collocations":["buy a townhome (タウンホームを買う)","rent a townhome (タウンホームを借りる)","townhome community (タウンホームのコミュニティ)","new townhome development (新しいタウンホーム開発)"],"synonyms":["row house","townhouse","condominium (sometimes)"],"antonyms":["single-family home","detached house"],"notes":"A townhome typically shares one or two walls with adjacent units, and the owner owns both the interior and exterior of the unit, as well as the land it sits on. This differs from a condominium, where the owner typically only owns the interior space and shares ownership of the common areas."}],"etymology":{"value":"The word 'townhome' is a relatively recent term, likely developed in the late 20th century to differentiate a specific type of attached housing from older terms like 'row house' or 'townhouse.' It combines 'town' (referring to a residential area) and 'home' (referring to a dwelling).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtaʊnhoʊm/","syllables":"town-home"},"inflection":{"noun_plural":"townhomes"},"usage_notes":{"explanation":"The term 'townhome' is often used interchangeably with 'townhouse,' but there can be subtle differences depending on the region and the specific development. Generally, a townhome implies ownership of the land beneath the unit, whereas a townhouse may or may not include land ownership. In some areas, 'townhome' is used to describe newer, more upscale attached housing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I live in a townhome's apartment.","correct":"✓ I live in a townhome.","note":"A townhome is a type of house, not an apartment. Therefore, you don't live in a townhome's apartment; you live in a townhome."},{"incorrect":"✗ Townhomes are same as apartments.","correct":"✓ Townhomes are different from apartments.","note":"Townhomes and apartments are different types of housing. Townhomes typically have multiple floors and direct exterior access, while apartments are usually located within a larger building."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["townhouse","row house","condominium","apartment","single-family home","detached house"],"priority":"★★☆"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively common, but less frequent than 'townhouse' or 'apartment'.","priority":"★★☆"},"readability_explanation":{"level":"B1","text":"A \"townhome\" is a type of house that is connected to other houses next to it in a row. It's like a house, but it shares walls with its neighbors. You usually own the townhome and the land it's on. It's different from an apartment, where you rent a space in a building and don't own the land.","priority":"★★☆"},"example_sentences":[{"sentence":"The new development features modern townhomes with attached garages.","translation":"その新しい開発地には、ガレージ付きのモダンなタウンホームがあります。","type":"general","meaning_category":"連棟式住宅"},{"sentence":"Living in a townhome offers a sense of community.","translation":"タウンホームに住むことは、コミュニティ意識をもたらします。","type":"general","meaning_category":"連棟式住宅"},{"sentence":"We decided to downsize from a large house to a more manageable townhome.","translation":"私たちは大きな家から、より管理しやすいタウンホームにダウングレードすることにしました。","type":"general","meaning_category":"連棟式住宅"}]}