{"word":"upperworks","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(船の)上部構造、上甲板構造","english_definition":"the parts of a ship or boat above the main deck.","examples":[{"sentence":"The ship's upperworks were heavily damaged by the storm.","translation":"その船の上部構造は嵐によってひどく損傷した。"},{"sentence":"The crew worked to repair the upperworks after the battle.","translation":"乗組員は戦闘後、上部構造の修理に努めた。"}],"collocations":["ship's upperworks","boat's upperworks"],"synonyms":["superstructure","topside"],"antonyms":["hull","keel"]},{"part_of_speech":"noun","definition":"(比喩的に)目立つ部分、表面的な部分","english_definition":"(figuratively) the visible or prominent parts of something; the superficial aspects.","examples":[{"sentence":"The upperworks of the plan looked good, but the details were lacking.","translation":"計画の表面的な部分は良く見えたが、詳細が不足していた。"},{"sentence":"He only understands the upperworks of the problem, not the underlying causes.","translation":"彼は問題の表面的な部分しか理解しておらず、根本的な原因は理解していない。"}],"collocations":["the upperworks of a plan","the upperworks of a problem"],"synonyms":["surface","facade","appearance"],"antonyms":["foundation","core","essence"]}],"etymology":{"value":"'Upper' + 'works'. Refers to the structures built on top of the hull of a ship.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌpərˌwɜːrks/","syllables":"up-per-works"},"inflection":{"noun_plural":"upperworks (usually treated as singular in nautical contexts, but plural form is also used.)"},"usage_notes":{"explanation":"The term 'upperworks' is primarily used in nautical contexts to refer to the parts of a ship above the main deck. Figuratively, it can refer to the visible or superficial aspects of something, as opposed to the underlying or fundamental aspects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The upperwork of the building was impressive.","correct":"✓ The superstructure of the building was impressive.","note":"'Upperworks' is typically used for ships, not buildings. Use 'superstructure' for buildings."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Upperworks' is a specialized term primarily used in nautical contexts to describe the parts of a ship or boat above the main deck. It can also be used figuratively to refer to the superficial or visible aspects of something, as opposed to the underlying or fundamental aspects. Understanding this term requires some familiarity with nautical terminology or abstract conceptualization.","priority":"★★☆"},"example_sentences":[{"sentence":"The storm caused significant damage to the ship's **upperworks**.","translation":"嵐は船の上部構造に重大な損害を与えた。","type":"noun","meaning_category":"nautical"},{"sentence":"He only understands the **upperworks** of the theory, not the underlying principles.","translation":"彼はその理論の表面的な部分しか理解しておらず、根底にある原則は理解していない。","type":"noun","meaning_category":"figurative"}]}