{"word":"polygrammatic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(linguistics) having multiple possible grammatical analyses or interpretations; ambiguous in grammatical structure.","english_definition":"(linguistics) capable of being analyzed or interpreted in more than one grammatical way; grammatically ambiguous.","examples":[{"sentence":"The sentence 'Visiting relatives can be boring' is polygrammatic because it can mean either 'The act of visiting relatives is boring' or 'Relatives who are visiting are boring.'","translation":"「親戚を訪ねることは退屈だ」という文は、文法的に複数の解釈が可能であり、「親戚を訪ねるという行為は退屈だ」または「訪ねてくる親戚は退屈だ」のどちらの意味にもなり得ます。"},{"sentence":"Polygrammatic constructions often lead to humorous misunderstandings.","translation":"文法的に複数の解釈が可能な構造は、しばしばユーモラスな誤解につながります。"}],"collocations":["polygrammatic sentence","polygrammatic construction","grammatical ambiguity"],"synonyms":["ambiguous","amphibologous","structurally ambiguous"],"antonyms":["unambiguous","monogrammatic"]}],"etymology":{"value":"Derived from 'poly-' (meaning 'many') + 'grammatic' (relating to grammar).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒlɪɡrəˈmætɪk/","syllables":"pol-y-gram-mat-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, beyond comparative and superlative forms (more polygrammatic, most polygrammatic)."},"usage_notes":{"explanation":"The term 'polygrammatic' is primarily used in linguistics to describe sentences or constructions that have more than one possible grammatical analysis. This ambiguity arises from the structure of the sentence itself, rather than from the meaning of individual words. It is a specific type of ambiguity, distinct from lexical ambiguity (where a single word has multiple meanings).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The word is polygrammatic because it has many meanings.","correct":"✓ The word is polysemous because it has many meanings.","note":"'Polygrammatic' refers to grammatical ambiguity, while 'polysemous' refers to a word having multiple meanings."},{"incorrect":"✗ The text was polygrammatic, making it hard to read.","correct":"✓ The text was ambiguous, making it hard to read.","note":"While 'polygrammatic' implies ambiguity, it specifically refers to grammatical structure. 'Ambiguous' is a more general term."}],"priority":"★★☆"},"related_words":{"derivatives":["polygrammatism (noun)"],"phrasal_verbs":[],"related_terms":["ambiguity","syntax","grammar","polysemy","amphiboly"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - a technical term used primarily in linguistics.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Polygrammatic' is a technical term used in linguistics to describe sentences or phrases that can be understood in multiple ways due to their grammatical structure. It's a specific type of ambiguity that arises from how the words are arranged and related to each other, rather than from the words themselves having multiple meanings. Understanding this term requires a solid grasp of grammatical concepts and linguistic analysis."},"example_sentences":[{"sentence":"The linguist identified several polygrammatic sentences in the corpus.","translation":"言語学者は、コーパスの中に文法的に複数の解釈が可能な文をいくつか特定しました。","type":"general","meaning_category":"linguistics"},{"sentence":"The polygrammatic nature of the poem added to its complexity and richness.","translation":"その詩の文法的に複数の解釈が可能な性質が、その複雑さと豊かさを増していました。","type":"literary analysis","meaning_category":"linguistics"}]}