{"word":"Hemidysergia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"片側性不全麻痺：身体の片側の運動協調の障害を指す医学用語。","english_definition":"A medical term referring to impaired motor coordination on one side of the body.","examples":[{"sentence":"The patient exhibited hemidysergia following the stroke, affecting their ability to perform fine motor tasks on the left side.","translation":"脳卒中後、患者は片側性不全麻痺を示し、左側の細かい運動作業を行う能力に影響を与えた。"}],"collocations":["exhibit hemidysergia","post-stroke hemidysergia","mild hemidysergia","severe hemidysergia"],"synonyms":["hemiparesis","unilateral incoordination"],"antonyms":["bilateral coordination","full motor control"]}],"etymology":{"value":"The term is derived from the following Greek roots: 'hemi-' (meaning half or one side), 'dys-' (meaning impaired or difficult), and 'ergasia' (meaning action or work).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛmiˌdɪsˈɜːrdʒiə/","syllables":"he-mi-dys-er-gi-a"},"inflection":{"noun_plural":"hemidysergias"},"usage_notes":{"explanation":"Hemidysergia is a specific type of motor impairment that affects the coordination and control of movements on one side of the body. It is often associated with neurological conditions such as stroke, traumatic brain injury, or cerebral palsy. The severity of hemidysergia can vary, ranging from mild clumsiness to significant difficulty with motor tasks.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has hemidysergia on both sides of their body.","correct":"✓ The patient has hemidysergia on one side of their body.","note":"Hemidysergia, by definition, affects only one side of the body. If both sides are affected, it would be a different condition."}],"priority":"★★☆"},"related_words":{"derivatives":["dysergia","hemiplegia","paresis"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hemidysergia' is a highly technical medical term used to describe motor incoordination affecting one side of the body. Understanding requires familiarity with medical terminology and neurological conditions. It is not a term commonly used outside of healthcare settings.","priority":"★★☆"},"example_sentences":[{"sentence":"Physical therapy is crucial in managing hemidysergia and improving motor function.","translation":"理学療法は、片側性不全麻痺の管理と運動機能の改善に不可欠である。","type":"general","meaning_category":"medical treatment"},{"sentence":"The neurologist diagnosed the patient with hemidysergia following a comprehensive neurological examination.","translation":"神経科医は、包括的な神経学的検査の後、患者を片側性不全麻痺と診断した。","type":"diagnosis","meaning_category":"medical diagnosis"}]}