{"word":"restringersi","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(riflessivo) 縮む、小さくなる、狭くなる、減る、少なくなる、規模が縮小する、範囲が狭まる、活動が制限される、控える、自制する","english_definition":"(reflexive) to shrink, become smaller, narrower, or reduced in size, scope, or activity; to restrain oneself, to hold back.","examples":[{"sentence":"Il maglione si è ristretto dopo il lavaggio.","translation":"そのセーターは洗濯後縮んでしまった。"},{"sentence":"L'azienda si è ristretta a causa della crisi economica.","translation":"その会社は経済危機のために規模を縮小した。"},{"sentence":"Devi restringerti nelle spese se vuoi risparmiare.","translation":"もし貯金したいなら、出費を控えるべきだ。"},{"sentence":"Mi sono dovuto restringere per far entrare tutti in macchina.","translation":"全員を車に乗せるために、私は身を縮めなければならなかった。"}],"collocations":["restringersi nelle spese (出費を控える)","restringersi in un angolo (隅に身を寄せる)","restringersi il mercato (市場が縮小する)","restringersi la scelta (選択肢が狭まる)"],"synonyms":["diminuire","ridursi","contrarsi","limitarsi","moderarsi","contenersi"],"antonyms":["allargarsi","espandersi","aumentare","ampliarsi"]}],"etymology":{"value":"Dal latino 'restringere', composto di 're-' (di nuovo, indietro) e 'stringere' (stringere, legare).","priority":"N/A"},"pronunciation":{"ipa":"/reˈstrin.d͡ʒer.si/","syllables":"re-strin-ger-si"},"inflection":{"verb_forms":{"presente":"mi restringo, ti restringi, si restringe, ci restringiamo, vi restringete, si restringono","passato_prossimo":"mi sono ristretto/a, ti sei ristretto/a, si è ristretto/a, ci siamo ristretti/e, vi siete ristretti/e, si sono ristretti/e","imperfetto":"mi restringevo, ti restringevi, si restringeva, ci restringevamo, vi restringevate, si restringevano","futuro_semplice":"mi stringerò, ti stringerai, si stringerà, ci stringeremo, vi stringerete, si stringeranno","congiuntivo_presente":"che io mi restringa, che tu ti restringa, che lui si restringa, che noi ci restringiamo, che voi vi restringiate, che loro si restringano","congiuntivo_imperfetto":"che io mi restringessi, che tu ti restringessi, che lui si restringesse, che noi ci restringessimo, che voi vi restringeste, che loro si restringessero","condizionale_presente":"mi restringerei, ti restringeresti, si restringerebbe, ci restringeremmo, vi restringereste, si restringerebbero","imperativo":"restringiti, restringetevi"},"notes":"È un verbo riflessivo. Il participio passato è 'ristretto/a/i/e' e concorda in genere e numero con il soggetto."},"usage_notes":{"explanation":"'Restringersi' è un verbo riflessivo che indica un'azione compiuta dal soggetto su se stesso, nel senso di ridurre le proprie dimensioni fisiche o metaforiche. Può riferirsi a oggetti che si rimpiccioliscono, aziende che riducono le proprie attività, o persone che limitano le proprie spese o si trattengono dal fare qualcosa.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"*restringere","correct":"restringersi","note":"'Restringere' (senza 'si') è un verbo transitivo che significa 'restringere qualcosa', mentre 'restringersi' è un verbo riflessivo che significa 'diventare più stretto/piccolo'."}],"priority":"N/A"},"related_words":{"derivatives":["ristretto (aggettivo: stretto, limitato; sostantivo: tipo di caffè)","restringimento (sostantivo: restringimento, riduzione)","strettamente (avverbio: strettamente, rigorosamente)"],"related_verbs":["stringere (stringere, legare)","ridurre (ridurre)","limitare (limitare)"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relativamente frequente","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Restringersi' è un verbo riflessivo che indica un processo di riduzione o limitazione. Può essere usato in contesti fisici (un tessuto che si restringe) o metaforici (un'azienda che si restringe). La comprensione richiede una buona conoscenza della grammatica italiana, in particolare dei verbi riflessivi e del loro uso in diversi contesti."},"example_sentences":[{"sentence":"Dopo il lavaggio, la lana si è ristretta molto.","translation":"After washing, the wool shrank a lot.","type":"example","meaning_category":"Shrinking"},{"sentence":"L'orario di lavoro si è ristretto a causa della crisi.","translation":"Working hours have been reduced due to the crisis.","type":"example","meaning_category":"Reduction"},{"sentence":"Mi devo restringere con la dieta per entrare nel vestito.","translation":"I have to restrain myself with the diet to fit into the dress.","type":"example","meaning_category":"Restraint"}]}