{"word":"SinglePrecision","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"単精度 (コンピュータ)","english_definition":"(computing) A floating-point format that occupies one storage unit (typically 32 bits).","examples":[{"sentence":"The variable was declared as SinglePrecision.","translation":"その変数は単精度として宣言されました。"}],"collocations":["single-precision floating point","single-precision arithmetic"],"synonyms":[],"antonyms":["double precision"]},{"part_of_speech":"adjective","definition":"単精度の","english_definition":"Relating to or using single precision.","examples":[{"sentence":"The singleprecision calculations were faster but less accurate.","translation":"単精度の計算は高速だが、精度が低い。"}],"collocations":["single-precision variable","single-precision number"],"synonyms":[],"antonyms":["double-precision"]}],"etymology":{"value":"Combination of 'single' and 'precision', referring to the use of a single storage unit to represent a floating-point number, offering a specific level of precision.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɪŋɡəl prɪˈsɪʒən/","syllables":"sin-gle-pre-ci-sion"},"inflection":{},"usage_notes":{"explanation":"'SinglePrecision' refers to a specific floating-point format in computing. It is less precise than 'DoublePrecision' but requires less memory and can be processed faster. It is often used when memory is limited or speed is critical, and high precision is not required.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["precision","doubleprecision","floating-point"],"related_terms":["float (data type)"]},"level_frequency":{},"readability_explanation":{"level":"Advanced","text":"'SinglePrecision' is a technical term used in computer science and programming, specifically related to floating-point number representation. It refers to a data type that uses a single unit of storage (typically 32 bits) to represent a number with a certain level of precision. It's less precise than 'DoublePrecision' but requires less memory. Understanding this term is important for programmers working with numerical computations where memory usage and processing speed are factors."},"example_sentences":[{"sentence":"Using SinglePrecision can significantly reduce memory usage in large datasets.","translation":"単精度を使用すると、大規模なデータセットでのメモリ使用量を大幅に削減できます。","type":"general","meaning_category":"memory usage"},{"sentence":"The graphics card supports both SinglePrecision and DoublePrecision floating-point calculations.","translation":"そのグラフィックスカードは、単精度と倍精度の浮動小数点計算の両方をサポートしています。","type":"technical","meaning_category":"floating-point calculations"}]}