{"word":"nondeceleration","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"減速しないこと、または減速の欠如","english_definition":"The absence of deceleration; the state of not slowing down.","examples":[{"sentence":"The car maintained a nondeceleration state despite the driver releasing the accelerator.","translation":"運転手がアクセルを離したにもかかわらず、車は減速しない状態を維持した。"},{"sentence":"The rocket experienced nondeceleration in the vacuum of space.","translation":"ロケットは宇宙空間の真空中で減速を経験しなかった。"}],"collocations":["maintain nondeceleration","experience nondeceleration"],"synonyms":["constant speed","uniform motion","lack of deceleration"],"antonyms":["deceleration","slowing down","retardation"]}],"etymology":{"value":"\"non-\" (否定接頭辞) + \"deceleration\" (減速)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒndiˌsɛləˈreɪʃən/","syllables":"non-de-cel-e-ra-tion"},"inflection":{"noun_plural":"nondecelerations"},"usage_notes":{"explanation":"\"Nondeceleration\" is a formal term primarily used in technical or scientific contexts, such as physics, engineering, or automotive technology. It describes a situation where an object or vehicle does not decrease its speed. It's less common in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nondeceleration was caused by the brakes failing.","correct":"✓ The nondeceleration was due to the brakes failing.","note":"\"Caused by\" implies a direct action leading to nondeceleration, whereas \"due to\" indicates the reason for the lack of deceleration."},{"incorrect":"✗ The car showed nondeceleration.","correct":"✓ The car exhibited nondeceleration.","note":"\"Exhibited\" is a more formal and appropriate verb for describing a technical characteristic."}],"priority":"★☆☆"},"related_words":{"derivatives":["decelerate (verb): 減速する","deceleration (noun): 減速","acceleration (noun): 加速","non- (prefix): ～でない"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Nondeceleration\" is a highly technical term used to describe the absence of slowing down. It is most often encountered in scientific or engineering contexts, such as discussing the motion of objects in physics or the performance of vehicles. The word is formed by adding the prefix \"non-\" to \"deceleration,\" which means slowing down. Because of its specialized use, it is not a common word in everyday language and is typically only used by experts in relevant fields."},"example_sentences":[{"sentence":"The study investigated the effects of nondeceleration on high-speed train travel.","translation":"その研究は、高速鉄道の移動における減速しないことの影響を調査した。","type":"noun","meaning_category":"減速しないこと"},{"sentence":"The experiment aimed to achieve nondeceleration of the projectile in a controlled environment.","translation":"その実験は、制御された環境下で投射体の減速しない状態を達成することを目的とした。","type":"noun","meaning_category":"減速しないこと"}]}