{"word":"self-diffusion","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己拡散","english_definition":"The random movement of atoms or molecules within a pure substance due to thermal energy.","examples":[{"sentence":"Self-diffusion is an important phenomenon in materials science.","translation":"自己拡散は材料科学において重要な現象です。"},{"sentence":"The rate of self-diffusion increases with temperature.","translation":"自己拡散の速度は温度とともに増加します。"}],"collocations":["diffusion coefficient","activation energy","tracer diffusion"],"synonyms":["atomic diffusion","intrinsic diffusion"],"antonyms":[]}],"etymology":{"value":"The term 'self-diffusion' is derived from the combination of 'self' referring to the substance itself, and 'diffusion' which describes the process of particles spreading out.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌself.dɪˈfjuː.ʒən/","syllables":"self-di-fu-sion"},"inflection":{"noun_plural":"self-diffusions"},"usage_notes":{"explanation":"Self-diffusion is a fundamental concept in physics, chemistry, and materials science. It describes the movement of atoms or molecules within a substance of the same type. This movement occurs even in the absence of a concentration gradient and is driven by thermal energy. It is often studied using isotopic tracers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Self-diffusion only happens in mixtures.","correct":"✓ Self-diffusion happens in pure substances.","note":"Self-diffusion occurs within a pure substance, not a mixture."},{"incorrect":"✗ Self-diffusion is caused by a concentration gradient.","correct":"✓ Self-diffusion occurs even without a concentration gradient.","note":"Self-diffusion is driven by thermal energy, not a concentration gradient."}],"priority":"★★☆"},"related_words":{"derivatives":["diffusion","diffusion coefficient","tracer diffusion"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-diffusion' is a technical term used in science, particularly in physics, chemistry, and materials science. It refers to the movement of atoms or molecules within a pure substance due to thermal energy. Understanding this concept requires some background knowledge in these fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The study of self-diffusion provides insights into the mobility of atoms in solids.","translation":"自己拡散の研究は、固体中の原子の移動度に関する洞察を提供する。","type":"general","meaning_category":"scientific study"},{"sentence":"The activation energy for self-diffusion is a key parameter in determining the rate of atomic transport.","translation":"自己拡散の活性化エネルギーは、原子輸送の速度を決定する重要なパラメータである。","type":"technical","meaning_category":"physics/chemistry"}]}