{"word":"Clunisian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"クリュニー修道会（またはその系統の修道会）の、クリュニー修道会に関する","english_definition":"Relating to the Benedictine abbey of Cluny or its associated monastic order.","examples":[{"sentence":"Clunisian architecture is characterized by its grand scale and elaborate decoration.","translation":"クリュニー様式の建築は、その壮大な規模と精巧な装飾によって特徴づけられる。"},{"sentence":"The Clunisian reforms aimed to restore the Benedictine order to its original strictness.","translation":"クリュニー改革は、ベネディクト会を本来の厳格さに戻すことを目的としていた。"}],"collocations":["Clunisian order","Clunisian reforms","Clunisian architecture"],"synonyms":["Benedictine (related)"],"antonyms":[]},{"part_of_speech":"noun","definition":"クリュニー修道会の修道士","english_definition":"A monk belonging to the Cluniac order.","examples":[{"sentence":"The Clunisians were known for their elaborate liturgy and devotion to prayer.","translation":"クリュニー会の修道士たちは、その手の込んだ典礼と祈りへの献身で知られていた。"}],"collocations":["Clunisian monk"],"synonyms":["Cluniac monk"],"antonyms":[]}],"etymology":{"value":"From Cluny, the name of the town in France where the abbey was founded, + -ian.","priority":"★★★"},"pronunciation":{"ipa":"/kluːˈniːʒən/","syllables":"Clu-ni-sian"},"inflection":{"notes":"Adjective: Clunisian (no comparative or superlative forms). Noun: Clunisian (plural: Clunisians)"},"usage_notes":{"explanation":"The term \"Clunisian\" refers specifically to the Benedictine abbey of Cluny, founded in 910 in France, and the monastic order associated with it. The Clunisian order was known for its strict adherence to the Benedictine Rule, its elaborate liturgy, and its influence on the Church in the Middle Ages. The term is often used in historical and architectural contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Clunisian monks were Franciscan.","correct":"✓ The Clunisian monks were Benedictine.","note":"Clunisian monks were a branch of the Benedictine order, not Franciscan."}],"priority":"★★★"},"related_words":{"derivatives":["Cluny","Cluniac"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★★"},"readability_explanation":{"level":"C1","text":"The term \"Clunisian\" is a specialized term primarily encountered in historical or religious contexts, specifically when discussing the Cluniac order of Benedictine monks and their influence during the Middle Ages. Understanding requires familiarity with medieval history and monastic orders.","priority":"★★★"},"example_sentences":[{"sentence":"The **Clunisian** reforms had a significant impact on the structure of the medieval Church.","translation":"クリュニー改革は、中世教会の構造に大きな影響を与えた。","type":"adjective","meaning_category":"relating to Cluny"},{"sentence":"The **Clunisians** established numerous priories throughout Europe.","translation":"クリュニー会はヨーロッパ中に数多くの小修道院を設立した。","type":"noun","meaning_category":"member of the Cluniac order"}]}