{"word":"glandulation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学)腺毛、腺点、腺状突起","english_definition":"(botany) The presence or development of glands, or gland-like structures, on a plant surface.","examples":[{"sentence":"The glandulation on the leaves is a key characteristic for identifying this species.","translation":"葉の腺毛は、この種を識別するための重要な特徴です。"}],"collocations":["foliar glandulation","stem glandulation"],"synonyms":["glandularity","glandulosity"],"antonyms":[]}],"etymology":{"value":"From Latin 'glandula' (small gland) + '-ation' (a suffix denoting a process or state).","priority":"★★★"},"pronunciation":{"ipa":"ˌɡlændjuˈleɪʃən","syllables":"glan-du-la-tion"},"inflection":{"noun_plural":"glandulations"},"usage_notes":{"explanation":"'Glandulation' is a botanical term referring to the presence or formation of glands or gland-like structures on a plant. It is often used in plant identification and description.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant has a lot of glandulation, so it's very smooth.","correct":"✓ The plant has a lot of glandulation, so it may feel sticky or rough.","note":"Glandulation refers to the presence of glands, which often secrete substances, making the surface sticky or rough, not smooth."}],"priority":"★★☆"},"related_words":{"derivatives":["glandular","glandulose","glandiferous"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Glandulation' is a specialized botanical term. It refers to the presence of glands or gland-like structures on a plant's surface. Understanding this term requires knowledge of botanical terminology. It is not commonly used outside of botany.","priority":"★★☆"},"example_sentences":[{"sentence":"The degree of glandulation varies among different cultivars of the same species.","translation":"腺毛の程度は、同じ種の異なる栽培品種間で異なります。","type":"noun","meaning_category":"botany"},{"sentence":"Microscopic examination revealed the presence of dense glandulation on the sepal margins.","translation":"顕微鏡検査により、萼片の縁に密な腺毛の存在が明らかになった。","type":"noun","meaning_category":"botany"}]}