{"word":"poultryist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"養鶏業者、家禽飼育者","english_definition":"A person who raises poultry, especially for commercial purposes.","examples":[{"sentence":"The poultryist carefully monitors the health of his chickens.","translation":"その養鶏業者は鶏の健康状態を注意深く監視している。"},{"sentence":"Local poultryists supply eggs to the market.","translation":"地元の養鶏業者が市場に卵を供給している。"}],"collocations":["small-scale poultryist","commercial poultryist"],"synonyms":["chicken farmer","poultry farmer","poultry keeper"],"antonyms":[]}],"etymology":{"value":"The word 'poultryist' is derived from 'poultry' (domesticated birds kept for eggs or meat) and the suffix '-ist' (denoting a person engaged in a particular activity or profession).","priority":"★★★"},"pronunciation":{"ipa":"ˈpoʊltriɪst","syllables":"poul-try-ist"},"inflection":{"noun_plural":"poultryists"},"usage_notes":{"explanation":"The term 'poultryist' is a specific term that refers to someone involved in raising poultry, often on a commercial scale. It is less common than 'poultry farmer' but is still a valid and recognized term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a poultry.","correct":"✓ He is a poultryist.","note":"'Poultry' refers to the birds themselves, while 'poultryist' refers to the person who raises them."}],"priority":"★★☆"},"related_words":{"derivatives":["poultry (noun: 家禽)","poultry farming (noun: 養鶏)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'poultryist' is a specialized term referring to a person who raises poultry, particularly for commercial purposes. It's not a commonly used word in everyday conversation, but it is relevant in agricultural or farming contexts. Understanding this word helps in comprehending discussions related to poultry farming and the individuals involved in this industry."},"example_sentences":[{"sentence":"The experienced poultryist knew exactly how to manage the flock during the heatwave.","translation":"経験豊富な養鶏業者は、熱波の間、鶏の群れをどのように管理するかを正確に知っていた。","type":"noun","meaning_category":"養鶏業者"},{"sentence":"Many small-scale poultryists are struggling to compete with larger commercial operations.","translation":"多くの小規模養鶏業者は、大規模な商業経営との競争に苦労している。","type":"noun","meaning_category":"養鶏業者"}]}