{"word":"segregasi","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"隔離、分離、人種隔離","english_definition":"the action or state of setting someone or something apart from other people or things or being set apart. Often refers to the separation of people based on race, ethnicity, religion, or other factors.","examples":[{"sentence":"Kebijakan segregasi di sekolah-sekolah publik dinyatakan ilegal.","translation":"Segregation policies in public schools have been declared illegal."}],"collocations":["segregasi rasial (racial segregation)","segregasi gender (gender segregation)","segregasi agama (religious segregation)","kebijakan segregasi (segregation policy)","praktik segregasi (segregation practice)","menentang segregasi (oppose segregation)","mengakhiri segregasi (end segregation)"],"synonyms":["pemisahan","diskriminasi","apartheid (khusus untuk segregasi rasial)","isolasi"],"antonyms":["integrasi","inklusi","persatuan","kesetaraan"],"notes":"Segregasi seringkali dikaitkan dengan ketidaksetaraan dan diskriminasi. Istilah 'apartheid' secara khusus merujuk pada sistem segregasi rasial yang pernah diterapkan di Afrika Selatan."}],"etymology":{"value":"Berakar dari kata Latin 'segregare', yang berarti 'memisahkan dari kawanan' (to set apart from the flock). 'Se-' berarti 'terpisah' dan 'grex' berarti 'kawanan' atau 'kelompok'.","priority":"★★☆"},"pronunciation":{"ipa":"/se.ɡreˈɡa.si/","syllables":"se-gre-ga-si"},"inflection":{"noun_plural":"segregasi-segregasi (jarang digunakan)"},"usage_notes":{"explanation":"'Segregasi' mengacu pada pemisahan atau pengasingan kelompok-kelompok orang berdasarkan karakteristik tertentu. Ini sering kali merupakan hasil dari kebijakan atau praktik diskriminatif dan dapat terjadi di berbagai bidang kehidupan, termasuk pendidikan, perumahan, pekerjaan, dan layanan publik.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Integrasi adalah kebalikan dari segregasi.","correct":"✓ Integrasi adalah lawan dari segregasi.","note":"Kata 'kebalikan' kurang tepat dalam konteks ini. 'Lawan' lebih sesuai untuk menggambarkan hubungan antara integrasi dan segregasi."},{"incorrect":"✗ Segregasi hanya terjadi pada masa lalu.","correct":"✓ Segregasi masih terjadi dalam berbagai bentuk saat ini.","note":"Meskipun segregasi rasial formal telah banyak diatasi, bentuk-bentuk segregasi lain masih ada, seperti segregasi ekonomi atau perumahan."}],"priority":"★★☆"},"related_words":{"derivatives":["tersegregasi (segregated)","mensegregasi (to segregate)"],"related_concepts":["diskriminasi","prejudice","stereotip","kesetaraan","keadilan sosial","hak asasi manusia"],"priority":"★★☆"},"level_frequency":{"level":"C1","frequency_google_ngram":"Cukup sering digunakan dalam konteks akademis, politik, dan sosial.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Segregasi' adalah kata yang digunakan untuk menggambarkan pemisahan orang berdasarkan ras, agama, jenis kelamin, atau faktor lainnya. Ini sering kali merupakan hasil dari diskriminasi dan ketidaksetaraan. Kata ini penting untuk memahami isu-isu sosial dan politik yang berkaitan dengan hak asasi manusia dan keadilan sosial."},"example_sentences":[{"sentence":"Segregasi perumahan menyebabkan kurangnya akses ke pendidikan berkualitas bagi banyak anak.","translation":"Housing segregation leads to a lack of access to quality education for many children.","type":"noun","meaning_category":"pemisahan"},{"sentence":"Pemerintah berupaya untuk menghapus segregasi di semua sektor masyarakat.","translation":"The government is working to eliminate segregation in all sectors of society.","type":"noun","meaning_category":"penghapusan pemisahan"},{"sentence":"Segregasi berdasarkan status sosial ekonomi masih menjadi tantangan di banyak kota.","translation":"Segregation based on socioeconomic status remains a challenge in many cities.","type":"noun","meaning_category":"pemisahan berdasarkan status sosial ekonomi"}]}