{"word":"pseudoconservatively","priority":"低","meanings":[{"part_of_speech":"adverb","definition":"見せかけの保守主義的に、疑似保守的に","english_definition":"In a manner that outwardly appears conservative but does not genuinely adhere to conservative principles.","examples":[{"sentence":"He pseudoconservatively argued for lower taxes while simultaneously supporting policies that benefited only the wealthy.","translation":"彼は見せかけの保守主義的に減税を主張したが、同時に富裕層だけが得をする政策を支持していた。"},{"sentence":"The politician pseudoconservatively appealed to traditional values to gain votes, but his actions betrayed his true intentions.","translation":"その政治家は票を得るために疑似保守的に伝統的価値観に訴えたが、彼の行動は彼の真の意図を裏切っていた。"}],"collocations":["act pseudoconservatively","argue pseudoconservatively","speak pseudoconservatively"],"synonyms":["ostensibly conservatively","superficially conservatively","apparently conservatively","seemingly conservatively"],"antonyms":["genuinely conservatively","truly conservatively","authentically conservatively"]}],"etymology":{"value":"\"pseudo-\" (偽の) + \"conservatively\" (保守的に)","priority":"低"},"pronunciation":{"ipa":"/ˌsjuːdoʊkənˈsɜːrvətɪvli/","syllables":"pseu-do-con-ser-va-tive-ly"},"inflection":{},"usage_notes":{"explanation":"This adverb is used to describe actions or speech that appear conservative on the surface but are not genuinely aligned with conservative principles. It often implies hypocrisy or insincerity.","priority":"中"},"common_mistakes":{},"related_words":{"derivatives":["pseudoconservative (adjective, noun)","pseudoconservatism (noun)"],"related_terms":["conservative","liberal","moderate","political spectrum"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'pseudoconservatively' is a complex term used to describe actions or statements that superficially appear to be conservative but lack genuine adherence to conservative principles. It is often used in political or social commentary to critique individuals or groups perceived as insincere or hypocritical in their conservatism. The word combines 'pseudo-' (meaning false or imitation) with 'conservatively' (in a conservative manner), indicating a deceptive or superficial form of conservatism. Understanding this word requires a grasp of political ideologies and critical thinking skills."},"example_sentences":[{"sentence":"The media criticized the senator for pseudoconservatively supporting environmental regulations while accepting large donations from oil companies.","translation":"メディアは、その上院議員が石油会社から多額の寄付を受けながら、見せかけの保守主義的に環境規制を支持していると批判した。","type":"example","meaning_category":"偽の保守主義"},{"sentence":"He pseudoconservatively presented himself as a champion of traditional family values, but his personal life told a different story.","translation":"彼は疑似保守的に伝統的な家族の価値観の擁護者として振る舞ったが、彼の私生活は異なる物語を語っていた。","type":"example","meaning_category":"偽の保守主義"},{"sentence":"The organization was accused of pseudoconservatively promoting policies that ultimately benefited only a small elite.","translation":"その組織は、最終的に少数のエリート層だけが得をする政策を疑似保守的に推進していると非難された。","type":"example","meaning_category":"偽の保守主義"}]}