{"word":"love-darting","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(動物行動学)一部の巻貝やナメクジなどに見られる求愛行動の一種で、交尾前に配偶者が相手に粘液で覆われた石灰質の針（愛の矢）を突き刺す行為","english_definition":"(zoology) A courtship behavior observed in some snails and slugs, where a calcareous or chitinous dart (the love dart) covered in mucus is stabbed into the body of the partner before mating.","examples":[{"sentence":"Love-darting is a fascinating example of sexual selection in invertebrates.","translation":"愛の矢の射込みは、無脊椎動物における性選択の興味深い例です。"},{"sentence":"The purpose of love-darting is still debated among scientists.","translation":"愛の矢の射込みの目的については、科学者の間でまだ議論が続いています。"},{"sentence":"Some species of snails engage in love-darting rituals that can last for hours.","translation":"一部のカタツムリの種は、数時間続く愛の矢の射込み儀式を行います。"}],"collocations":["engage in love-darting","love-darting behavior","love-darting ritual","love-darting mechanism","love-darting success","love-darting frequency"],"synonyms":["darting","courtship behavior","mating ritual"],"antonyms":[]}],"etymology":{"value":"「love dart」という言葉に由来し、これは巻貝やナメクジが交尾前に相手に突き刺す矢のような構造物を指します。この行動を動名詞化したものが「love-darting」です。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlʌvˌdɑːrtɪŋ/","syllables":"love-dart-ing"},"inflection":{"noun_plural":"love-dartings"},"usage_notes":{"explanation":"「**love-darting**」は、特定の種類の巻貝やナメクジに見られる特殊な求愛行動を指す専門用語です。一般的には動物行動学や生物学の文脈で使用されます。日常会話で使われることはほとんどありません。この行動の目的は、配偶者の受精成功率を高めることだと考えられていますが、正確なメカニズムはまだ完全には解明されていません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The birds were love-darting in the garden.","correct":"✓ The snails were love-darting in the garden.","note":"Love-dartingは特定の種類の巻貝やナメクジに見られる行動であり、鳥類には見られません。"},{"incorrect":"✗ Love-darting is a sign of aggression in snails.","correct":"✓ Love-darting is a courtship behavior in snails.","note":"Love-dartingは求愛行動であり、攻撃的な行動ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["love dart (名詞: 愛の矢)"],"phrases":["sexual selection","courtship ritual","mating behavior","invertebrate zoology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**love-darting**」は、カタツムリやナメクジなどの一部の無脊椎動物に見られる特殊な求愛行動を指す専門用語です。生物学、特に動物行動学の分野で使われます。この行動は、交尾前に配偶者が相手に粘液で覆われた石灰質の針（愛の矢）を突き刺すというものです。この単語は一般的な会話ではほとんど使われず、専門的な文脈でのみ使用されます。そのため、理解するには生物学的な知識が必要です。"},"example_sentences":[{"sentence":"The researchers studied the effects of love-darting on reproductive success in snails.","translation":"研究者たちは、カタツムリの繁殖成功に対する愛の矢の射込みの影響を研究しました。","type":"noun","meaning_category":"求愛行動"},{"sentence":"Love-darting is a complex behavior involving hormonal and neurological processes.","translation":"愛の矢の射込みは、ホルモンおよび神経学的プロセスを含む複雑な行動です。","type":"noun","meaning_category":"求愛行動"},{"sentence":"The love-darting ritual can vary significantly between different species of snails.","translation":"愛の矢の射込み儀式は、カタツムリの種によって大きく異なる場合があります。","type":"noun","meaning_category":"求愛行動"}]}