{"word":"necrotised","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"intransitive","definition":"壊死した、壊死を起こした","english_definition":"(of tissue or bone) to die prematurely; to become affected by necrosis.","examples":[{"sentence":"The tissue around the wound necrotised due to lack of blood supply.","translation":"傷口周辺の組織は血流不足のため壊死した。"},{"sentence":"If left untreated, the infected bone will necrotise.","translation":"もし治療せずに放置すれば、感染した骨は壊死するだろう。"}],"collocations":["necrotised tissue","necrotised bone","begin to necrotise"],"synonyms":["decayed","died","mortified","gangrenous"],"antonyms":["healthy","living","viable"]}],"etymology":{"value":"'Necrotise' is derived from 'necrosis,' which comes from the Greek word 'nekros' meaning 'dead body' or 'corpse.' The suffix '-ise' (or '-ize' in American English) is used to form verbs indicating the process of becoming something. Therefore, 'necrotise' means 'to become necrotic' or 'to undergo necrosis.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnekrətaɪzd/","syllables":"nec-ro-tised"},"inflection":{"verb_forms":{"present_simple":["necrotise","necrotises"],"past_simple":"necrotised","past_participle":"necrotised","present_participle":"necrotising"}},"usage_notes":{"explanation":"'Necrotise' refers specifically to the process of necrosis, which is the premature death of cells or tissues. It is often used in medical contexts to describe the condition of tissue or bone that has died due to injury, infection, or lack of blood supply. The term is more common in British English; American English often uses 'necrotize.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The wound was necrotised, so it was healing well.","correct":"✓ The wound was necrotised, so it needed treatment.","note":"Necrosis is a negative condition indicating tissue death, not healing. A necrotised wound requires medical intervention."},{"incorrect":"✗ The plant was necrotised by the sun.","correct":"✓ The plant was damaged by the sun.","note":"'Necrotise' is usually reserved for animal tissue or bone. For plants, terms like 'damaged,' 'wilted,' or 'burned' are more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["necrosis (noun: the death of most or all of the cells in an organ or tissue due to disease, injury, or failure of the blood supply)","necrotic (adjective: relating to or affected by necrosis)","necrotizing (adjective: causing necrosis)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Necrotise' is a technical term primarily used in medical and biological contexts to describe the process by which living tissue dies prematurely, known as necrosis. Understanding this word requires familiarity with medical terminology and concepts related to cell death and tissue damage. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The surgeon had to remove the necrotised tissue to prevent further infection.","translation":"外科医は、さらなる感染を防ぐために壊死した組織を除去しなければならなかった。","type":"verb","meaning_category":"壊死した"},{"sentence":"Without proper treatment, the burn wound began to necrotise.","translation":"適切な治療をしなければ、火傷の傷は壊死し始めた。","type":"verb","meaning_category":"壊死を起こした"}]}