{"word":"assertorically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"断定的に、主張的に","english_definition":"In an assertoric manner; in a way that states something as a fact or belief.","examples":[{"sentence":"He stated his opinion assertorically, leaving no room for doubt.","translation":"彼は自分の意見を断定的に述べ、疑いの余地を残さなかった。"},{"sentence":"The philosopher presented his argument assertorically, as if it were self-evident.","translation":"その哲学者は、まるで自明のことであるかのように、自分の議論を断定的に提示した。"}],"collocations":["state assertorically","present assertorically","argue assertorically"],"synonyms":["dogmatically","categorically","emphatically","positively","confidently"],"antonyms":["tentatively","hesitantly","questioningly"]}],"etymology":{"value":"From 'assertoric' (relating to assertion) + '-ally' (forming adverbs). 'Assertoric' comes from Medieval Latin 'assertorius', from Latin 'assertus', past participle of 'asserere' (to assert).","priority":"★★☆"},"pronunciation":{"ipa":"/əˌsɜːrˈtɒrɪkli/","syllables":"a-sser-tor-i-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Assertorically' describes the manner in which something is stated or presented. It implies a firm and confident declaration, often without providing extensive justification or evidence. The term is often used in philosophical or academic contexts to describe statements presented as established facts or beliefs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The evidence was presented assertorically, but it was weak.","correct":"✓ The claim was presented assertorically, but the evidence was weak.","note":"'Assertorically' describes how something is stated, not the nature of the evidence itself. It's more appropriate to say the 'claim' or 'argument' was presented assertorically. Evidence can be weak or strong, but it doesn't assert."},{"incorrect":"✗ He assertorically asked a question.","correct":"✓ He confidently asked a question.","note":"'Assertorically' implies a statement, not a question. Questions, by nature, are not assertions. 'Confidently' would be a more suitable adverb to describe how a question is asked."}],"priority":"★★☆"},"related_words":{"derivatives":["assertoric (adjective)","assert (verb)","assertion (noun)","assertive (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Assertorically' is an advanced term used to describe the manner of stating something as a fact or belief, often without providing extensive justification. It is typically found in academic or philosophical contexts. Understanding this word requires a strong vocabulary and comprehension of abstract concepts related to argumentation and rhetoric."},"example_sentences":[{"sentence":"The politician assertorically declared that his policies would solve the country's problems.","translation":"その政治家は、自分の政策が国の問題を解決すると断定的に宣言した。","type":"general","meaning_category":"断定的に述べる"},{"sentence":"The professor assertorically presented the theory, without acknowledging any counterarguments.","translation":"教授は反論を認めず、その理論を断定的に提示した。","type":"academic","meaning_category":"主張的に提示する"}]}