{"word":"re-residence","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"再居住、再定住","english_definition":"The act of living in a place again after having lived elsewhere.","examples":[{"sentence":"The family's re-residence in their hometown brought back many memories.","translation":"家族が故郷に再居住したことで、多くの思い出が蘇った。"},{"sentence":"The re-residence program aims to help former residents return to the area.","translation":"再居住プログラムは、以前の住民が地域に戻るのを支援することを目的としています。"}],"collocations":["encourage re-residence","facilitate re-residence","plan for re-residence"],"synonyms":["relocation","repatriation","return","re-settlement"],"antonyms":["emigration","departure","abandonment"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning 'again') to the word 'residence' (meaning 'the place where one lives').","priority":"★★☆"},"pronunciation":{"ipa":"/riːˈrɛzɪdəns/","syllables":"re-res-i-dence"},"inflection":{"noun_plural":"re-residences"},"usage_notes":{"explanation":"'Re-residence' is a relatively uncommon word, but it is used to describe the act of returning to live in a place where one previously lived. It is often used in the context of urban planning or community development, when discussing efforts to attract former residents back to a particular area.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The re-residence was successful.","correct":"✓ The re-residence program was successful.","note":"'Re-residence' refers to the act or process, not the residents themselves. Use it to describe the action of re-establishing a home in a place."}],"priority":"★☆☆"},"related_words":{"derivatives":["resident","reside","residency"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 're-residence' is a formal term used to describe the act of returning to live in a place where one previously resided. It is often used in academic or professional contexts related to urban planning, demography, or sociology. Understanding the prefix 're-' is helpful in deciphering the meaning of this word.","priority":"★★☆"},"example_sentences":[{"sentence":"The government is promoting re-residence in rural areas to combat population decline.","translation":"政府は人口減少に対抗するため、農村地域への再居住を促進しています。","type":"noun","meaning_category":"再居住"},{"sentence":"The city council hopes that the new development will encourage re-residence among young professionals.","translation":"市議会は、新しい開発が若い専門家の間で再居住を促進することを期待しています。","type":"noun","meaning_category":"再居住"}]}