{"word":"multiparient","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"多産婦の、経産婦の","english_definition":"Having borne more than one child.","examples":[{"sentence":"The study focused on multiparient women to assess the risk of postpartum complications.","translation":"その研究は、産後合併症のリスクを評価するために、経産婦の女性に焦点を当てた。"},{"sentence":"Multiparient mothers often have shorter labor times compared to first-time mothers.","translation":"経産婦の母親は、初産の母親に比べて陣痛時間が短いことが多い。"}],"collocations":["multiparient woman","multiparient mother","multiparient patient"],"synonyms":["pluriparous","multipara"],"antonyms":["nulliparous","primiparous"]}],"etymology":{"value":"'Multi-' (many) + 'parient' (bearing offspring). 'Parient' is derived from Latin 'parere' (to give birth).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmʌltɪˈpeəriənt/","syllables":"mul-ti-pa-ri-ent"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"The term 'multiparient' is primarily used in medical and biological contexts to describe a female (usually human or animal) who has given birth to more than one offspring. It is more technical than simply saying 'has had multiple children'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The multiparient dog gave birth to a single puppy.","correct":"✓ The multiparient dog gave birth to several puppies.","note":"While a multiparient animal can give birth to a single offspring in a particular instance, the term implies that it has given birth to multiple offspring in its lifetime."}],"priority":"★☆☆"},"related_words":{"derivatives":["multiparity (noun): The condition of having borne more than one child."],"related_terms":["primiparous (adjective): Having borne one child.","nulliparous (adjective): Never having borne a child."]},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in medical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Multiparient' is a technical term used in medicine and biology to describe a female who has given birth to more than one child. It's more precise than saying 'has had multiple children' and is typically found in scientific or medical contexts. Understanding this term is helpful for reading scientific literature related to obstetrics and gynecology."},"example_sentences":[{"sentence":"The study compared the outcomes of primiparous and multiparient women.","translation":"その研究は、初産婦と経産婦の転帰を比較した。","type":"general","meaning_category":"経産婦の"},{"sentence":"Multiparient animals often exhibit different maternal behaviors compared to first-time mothers.","translation":"経産婦の動物は、初産の母親とは異なる母性行動を示すことが多い。","type":"biological","meaning_category":"多産婦の"}]}