{"word":"mydriatic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"散瞳（さんどう）性の、瞳孔を散大させる","english_definition":"causing dilation of the pupil of the eye.","examples":[{"sentence":"Mydriatic eye drops are used to dilate the pupils during an eye exam.","translation":"散瞳薬の点眼薬は、眼科検査中に瞳孔を散大させるために使用されます。"},{"sentence":"The doctor prescribed a mydriatic solution.","translation":"医師は散瞳薬を処方しました。"}],"collocations":["mydriatic eye drops","mydriatic agent","mydriatic effect"],"synonyms":["pupil-dilating"],"antonyms":["miotic"]},{"part_of_speech":"noun","definition":"散瞳薬","english_definition":"an agent that induces dilation of the pupil.","examples":[{"sentence":"The optometrist used a mydriatic to examine the back of my eye.","translation":"検眼医は私の眼底を検査するために散瞳薬を使用しました。"},{"sentence":"Be careful when using a mydriatic as it can blur your vision.","translation":"散瞳薬を使用する際は、視界がぼやける可能性があるため注意してください。"}],"collocations":["use a mydriatic","effects of mydriatics"],"synonyms":["pupil dilator"],"antonyms":["miotic"]}],"etymology":{"value":"From the Greek word 'mydriasis' meaning excessive dilation of the pupil, which is derived from 'mydros' meaning red-hot mass of metal or coal.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪdriˈætɪk/","syllables":"my-dri-at-ic"},"inflection":{"notes":"The word 'mydriatic' can function as both an adjective and a noun, so there are no separate inflectional forms."},"usage_notes":{"explanation":"'Mydriatic' refers to substances or medications that cause the pupil of the eye to widen or dilate. These are commonly used in eye exams to allow doctors to better view the retina and other structures at the back of the eye. As an adjective, it describes something that has the property of causing dilation. As a noun, it refers to the substance itself.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used mydriatic to make my eyes smaller.","correct":"✓ I used a miotic to make my eyes smaller.","note":"Mydriatics dilate the pupils, while miotics constrict them. Using the wrong term would indicate the opposite effect."},{"incorrect":"✗ The doctor gave me mydriatic for my headache.","correct":"✓ The doctor gave me a pain reliever for my headache.","note":"Mydriatics are specifically for dilating pupils and are not used to treat headaches."}],"priority":"★★☆"},"related_words":{"derivatives":["mydriasis (noun: excessive dilation of the pupil)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'mydriatic' is a technical term used in the field of ophthalmology. It refers to a substance that causes the dilation of the pupil. It is primarily used by medical professionals and those studying eye care. General understanding of this word is not expected outside of these contexts."},"example_sentences":[{"sentence":"The ophthalmologist administered a **mydriatic** solution to prepare for the retinal examination.","translation":"眼科医は網膜検査の準備のために散瞳薬を投与しました。","type":"noun","meaning_category":"散瞳薬"},{"sentence":"The **mydriatic** effect can cause temporary sensitivity to light.","translation":"散瞳効果により、一時的に光に敏感になることがあります。","type":"adjective","meaning_category":"散瞳性の"}]}