{"word":"Atticizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"アッティカ風にする、アッティカ方言で書く","english_definition":"To make Attic in style or language; to write or speak in the Attic dialect.","examples":[{"sentence":"The author was Atticizing his prose to emulate the classical Greek style.","translation":"その著者は、古典ギリシャのスタイルを模倣するために、散文をアッティカ風にしていた。"}],"collocations":[],"synonyms":["Hellenizing","Classicizing"],"antonyms":[]},{"part_of_speech":"noun","definition":"アッティカ風にすること、アッティカ方言の使用","english_definition":"The act of making Attic in style or language; the use of the Attic dialect.","examples":[{"sentence":"His Atticizing was evident in the purity of his vocabulary and syntax.","translation":"彼のアッティカ風の表現は、語彙と構文の純粋さに明らかだった。"}],"collocations":[],"synonyms":["Hellenization","Classicization"],"antonyms":[]}],"etymology":{"value":"From the term 'Attic', referring to Attica, the region around Athens in ancient Greece, known for its classical Greek dialect and style.","priority":"★★★"},"pronunciation":{"ipa":"/ˈætɪsaɪzɪŋ/","syllables":"At-ti-ciz-ing"},"inflection":{"verb_forms":{"present_simple":["Atticizes"],"past_simple":"Atticized","past_participle":"Atticized","present_participle":"Atticizing"},"noun_plural":[]},"usage_notes":{"explanation":"'Atticizing' refers to the practice of emulating the classical Greek style, particularly the dialect and literary style of Attica (the region around Athens). It is often used in the context of literature, rhetoric, and art.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Attic (adjective, noun)","Atticism (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Atticizing' is a specialized term primarily encountered in academic contexts related to classical studies, literature, and linguistics. It denotes the deliberate imitation of the Attic Greek dialect and style, which was considered the purest form of classical Greek. The term is not commonly used in everyday language."},"example_sentences":[{"sentence":"The Renaissance scholars were keen on Atticizing their Latin prose.","translation":"ルネサンスの学者たちは、ラテン語の散文をアッティカ風にすることに熱心だった。","type":"verb","meaning_category":"アッティカ風にする"},{"sentence":"His Atticizing gave his speeches a certain elegance and authority.","translation":"彼のアッティカ風の表現は、彼のスピーチにある種のエレガンスと権威を与えた。","type":"noun","meaning_category":"アッティカ風にすること"}]}