{"word":"white-gloved","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"白い手袋をはめた","english_definition":"Wearing white gloves.","examples":[{"sentence":"The butler was a tall, dignified man, always white-gloved and impeccably polite.","translation":"その執事は背が高く、威厳のある男で、いつも白い手袋をはめ、非の打ち所がないほど礼儀正しかった。"},{"sentence":"A white-gloved waiter served the champagne.","translation":"白い手袋をはめたウェイターがシャンパンを給仕した。"}],"collocations":["white-gloved waiter","white-gloved service","white-gloved butler"],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"（サービスなどが）非常に丁寧な、高級な","english_definition":"Characterized by extreme politeness, formality, or meticulousness, often associated with high-end service.","examples":[{"sentence":"The restaurant offered white-gloved service, attending to every detail of the diners' experience.","translation":"そのレストランは、客の体験のあらゆる細部にまで気を配る、非常に丁寧なサービスを提供していた。"},{"sentence":"The event was a white-gloved affair, with every guest treated like royalty.","translation":"そのイベントは、すべてのゲストが王族のように扱われる、高級な催しだった。"}],"collocations":["white-gloved service","white-gloved treatment","white-gloved affair"],"synonyms":["formal","meticulous","high-end","refined","elegant"],"antonyms":["casual","informal","unrefined"]}],"etymology":{"value":"The term is a compound adjective formed by combining \"white\" and \"gloved.\" It literally describes someone wearing white gloves, but the association with formality and high-end service likely stems from the historical use of white gloves as part of formal attire for servants and those in positions of service.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwaɪtˌɡlʌvd/","syllables":"white-gloved"},"inflection":{"notes":"Adjective; does not inflect for number or gender."},"usage_notes":{"explanation":"The adjective \"white-gloved\" can be used literally to describe someone wearing white gloves. However, it is often used figuratively to describe a service or event that is extremely formal, meticulous, and high-end. The association comes from the historical use of white gloves as part of formal attire for those in service positions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The white-gloved worker was very friendly.","correct":"✓ The white-gloved waiter was very friendly.","note":"While \"white-gloved\" can be used literally, it's more common to specify the person's role (e.g., waiter, butler) when describing someone wearing white gloves. If you mean to convey high-end service, focus on describing the service itself."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["glove","white","formal","service","butler","waiter"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"white-gloved\" is a relatively sophisticated adjective. At its most literal, it simply means wearing white gloves. However, it's more often used figuratively to describe something characterized by extreme formality, meticulousness, and high-end service. The figurative meaning is derived from the historical association of white gloves with formal service roles. Understanding the figurative use requires a grasp of the historical context and an understanding of how adjectives can be used to convey more than just literal descriptions."},"example_sentences":[{"sentence":"The museum tour was led by a **white-gloved** docent.","translation":"美術館のツアーは、白い手袋をはめた学芸員によって案内された。","type":"literal","meaning_category":"Wearing white gloves"},{"sentence":"The five-star hotel is known for its **white-gloved** service.","translation":"その五つ星ホテルは、非常に丁寧なサービスで知られている。","type":"figurative","meaning_category":"High-end service"},{"sentence":"The antique shop owner carefully handled the delicate porcelain with **white-gloved** hands.","translation":"その骨董品店のオーナーは、白い手袋をはめた手で、その繊細な磁器を丁寧に扱った。","type":"literal","meaning_category":"Wearing white gloves"},{"sentence":"The charity gala was a **white-gloved** affair, complete with a string quartet and gourmet cuisine.","translation":"その慈善ガラは、弦楽四重奏団とグルメ料理が揃った、高級な催しだった。","type":"figurative","meaning_category":"High-end event"}]}