{"word":"Unjocoseness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of not being jocular or humorous; seriousness.","english_definition":"The state or quality of lacking humor or playfulness; seriousness.","examples":[{"sentence":"The unjocoseness of the situation was apparent to everyone in the room.","translation":"その場の誰もが、状況の深刻さを理解していた。"},{"sentence":"His unjocoseness made it difficult to connect with him on a personal level.","translation":"彼の真面目さのせいで、個人的なレベルで彼と繋がるのが難しかった。"}],"collocations":["extreme unjocoseness","pervading unjocoseness","general unjocoseness"],"synonyms":["seriousness","gravity","solemnity","earnestness","lack of humor"],"antonyms":["jocoseness","humor","playfulness","lightheartedness"]}],"etymology":{"value":"Formed by adding the prefix \"un-\" (meaning 'not') to \"jocoseness,\" which itself is derived from \"jocose\" (meaning 'given to joking; playful or humorous').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈdʒoʊkoʊsnəs/","syllables":"un-jo-co-ness"},"inflection":{"noun_plural":"unjocosenesses (rarely used)"},"usage_notes":{"explanation":"\"Unjocoseness\" is a relatively uncommon word used to describe the absence of humor or lightheartedness. It emphasizes a state of seriousness or solemnity. It is often used in formal or literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unjocoseness of the clown was surprising.","correct":"✓ The lack of jocoseness of the clown was surprising.","note":"Clowns are expected to be humorous, so describing a clown as 'unjocoseness' is contradictory. It is better to describe the lack of humor in the clown."}],"priority":"★☆☆"},"related_words":{"derivatives":["unjocose (adjective: not jocular or humorous)","jocoseness (noun: the quality of being jocular or humorous)","jocose (adjective: given to joking; playful or humorous)","jocular (adjective: fond of or characterized by joking; humorous or playful)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (rare and formal vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unjocoseness\" is a formal and rare word meaning the absence of humor or playfulness. It is used to describe a situation or person that is serious and lacks lightheartedness. Because it is uncommon, it is more likely to be encountered in written texts, particularly those with a formal or academic tone. Understanding the word requires familiarity with its root, \"jocose,\" and the negative prefix \"un-\". "},"example_sentences":[{"sentence":"The unjocoseness of the funeral reflected the deep sorrow of the attendees.","translation":"葬儀の厳粛さは、参列者の深い悲しみを反映していた。","type":"noun","meaning_category":"seriousness"},{"sentence":"Despite his attempts to lighten the mood, the unjocoseness of the committee meeting persisted.","translation":"彼の場を和ませようとする試みにもかかわらず、委員会の会議の深刻さは続いた。","type":"noun","meaning_category":"lack of humor"}]}