{"word":"Unbuildability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"建築不可能性、建設不可能性","english_definition":"The state or quality of being impossible to build; the inability to be built.","examples":[{"sentence":"The unbuildability of the design was due to the unstable foundation.","translation":"その設計の建築不可能性は、不安定な基礎が原因だった。"},{"sentence":"They had to abandon the project because of the unbuildability of the proposed structure.","translation":"彼らは提案された構造物の建設不可能性のためにプロジェクトを断念せざるを得なかった。"}],"collocations":["assess unbuildability","demonstrate unbuildability","technical unbuildability","economic unbuildability"],"synonyms":["impossibility of construction","infeasibility of building","non-constructibility"],"antonyms":["buildability","constructibility"]}],"etymology":{"value":"Formed from \"un-\" (not) + \"buildable\" (capable of being built) + \"-ity\" (state or quality).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌʌnbɪldəˈbɪləti/","syllables":"un-build-a-bil-i-ty"},"inflection":{"noun_plural":"Unbuildabilities (rare)"},"usage_notes":{"explanation":"\"Unbuildability\" is a relatively rare and technical term, primarily used in engineering, architecture, and construction contexts. It refers to situations where, due to various factors (such as geological constraints, economic limitations, or design flaws), a proposed structure or design cannot be realistically or safely built.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unbuildability was because of the weather.","correct":"✓ The unbuildability was due to the weather.","note":"\"Due to\" is generally preferred over \"because of\" when referring to the cause of a state or condition like unbuildability."},{"incorrect":"✗ The project had unbuildability.","correct":"✓ The project suffered from unbuildability. / ✓ The project was deemed unbuildable.","note":"It's more common to say a project \"suffers from unbuildability\" or is \"deemed unbuildable\" rather than saying it \"has unbuildability.\""}],"priority":"☆☆☆"},"related_words":{"derivatives":["unbuildable (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Unbuildability\" is a complex and rare word, typically used in specialized fields like architecture and engineering. It describes the condition where a proposed structure or design cannot be constructed due to various limitations. Understanding this term requires familiarity with technical vocabulary and abstract concepts related to construction and feasibility."},"example_sentences":[{"sentence":"The engineer's report highlighted the unbuildability of the skyscraper on the marshland.","translation":"エンジニアの報告書は、湿地帯におけるその超高層ビルの建築不可能性を強調した。","type":"noun","meaning_category":"建築不可能性"},{"sentence":"The economic unbuildability of the project led to its cancellation.","translation":"そのプロジェクトの経済的な建設不可能性が、その中止につながった。","type":"noun","meaning_category":"建設不可能性"}]}