{"word":"introvertiert","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"内向的な、内向性の","english_definition":"(of a person) predominantly concerned with their own thoughts and feelings rather than with external things.","examples":[{"sentence":"Er ist ein introvertierter Mensch.","translation":"彼は内向的な人です。"},{"sentence":"Introvertierte Menschen brauchen Zeit für sich allein, um sich zu erholen.","translation":"内向的な人は、回復するために一人で時間が必要です。"},{"sentence":"Sie ist sehr introvertiert und spricht nicht gern vor großen Gruppen.","translation":"彼女はとても内向的で、大勢のグループの前で話すことを好みません。"}],"collocations":["introvertierte Persönlichkeit (内向的な性格)","introvertiert sein (内向的である)","introvertierte Veranlagung (内向的な性質)"],"synonyms":["zurückhaltend","verschlossen","in sich gekehrt","eigensinnig"],"antonyms":["extrovertiert","aufgeschlossen","kontaktfreudig","gesellig"]},{"part_of_speech":"adjective","definition":"(心理学で)内向性の、内向的な","english_definition":"(in psychology) characterized by or exhibiting introversion.","examples":[{"sentence":"Introvertierte Menschen bevorzugen oft Einzelarbeit.","translation":"内向的な人はしばしば単独での作業を好みます。"},{"sentence":"Die introvertierte Haltung des Patienten erschwert die Therapie.","translation":"患者の内向的な態度は治療を困難にします。"}],"collocations":["introvertierte Haltung (内向的な態度)","introvertiertes Verhalten (内向的な行動)"],"synonyms":["nachdenklich","besonnen"],"antonyms":["impulsiv","spontan"]}],"etymology":{"value":"Das Wort 'introvertiert' stammt vom lateinischen 'intro' (nach innen) und 'vertere' (wenden) ab. Es wurde von dem Schweizer Psychiater Carl Jung geprägt, um einen Persönlichkeitstyp zu beschreiben, der seine Energie hauptsächlich aus der inneren Welt bezieht.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntroːvɛʁˈtiːɐ̯t/","syllables":"in-tro-ver-tiert"},"inflection":{"notes":"Adjektivdeklination (強変化、弱変化、混合変化)"},"usage_notes":{"explanation":"'Introvertiert' beschreibt eine Persönlichkeit, die ihre Energie hauptsächlich aus der inneren Welt bezieht. Introvertierte Menschen sind oft ruhig, nachdenklich und bevorzugen es, Zeit allein oder in kleinen Gruppen zu verbringen. Sie sind nicht unbedingt schüchtern, sondern laden ihre Batterien eher durch Zeit für sich allein auf, im Gegensatz zu Extrovertierten, die Energie aus sozialen Interaktionen ziehen.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Er ist introvertiert, aber er hasst Menschen.","correct":"Er ist introvertiert, aber das bedeutet nicht, dass er Menschen hasst.","note":"Introversion bedeutet nicht, dass jemand Menschen hasst. Es bedeutet lediglich, dass soziale Interaktionen anstrengender sein können und Zeit allein zur Erholung benötigt wird。"},{"incorrect":"Sie ist introvertiert, also kann sie keine Führungskraft sein.","correct":"Sie ist introvertiert, aber das bedeutet nicht, dass sie keine Führungskraft sein kann.","note":"Introvertierte können ausgezeichnete Führungskräfte sein, da sie oft gute Zuhörer sind und sorgfältig über Entscheidungen nachdenken。"}],"priority":"★★☆"},"related_words":{"derivatives":["Introversion (内向性)","Extrovertiert (外向的な)","Ambivertiert (両向的な)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Mittlere Häufigkeit","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"Das Wort 'introvertiert' wird verwendet, um Menschen zu beschreiben, die eher ruhig und nachdenklich sind und ihre Energie aus der Zeit beziehen, die sie alleine verbringen. Sie sind nicht unbedingt schüchtern, sondern bevorzugen oft ruhigere Umgebungen und tiefere Gespräche. Es ist wichtig zu verstehen, dass Introversion eine Persönlichkeitseigenschaft und keine Krankheit ist.","priority":"★★★"},"example_sentences":[{"sentence":"Viele kreative Menschen sind introvertiert.","translation":"多くのクリエイティブな人々は内向的です。","type":"general","meaning_category":"内向的な性格"},{"sentence":"Er hat eine introvertierte Art, aber er ist sehr intelligent.","translation":"彼は内向的な性格ですが、とても知的です。","type":"general","meaning_category":"内向的な性格"},{"sentence":"Introvertierte Menschen sind oft gute Zuhörer.","translation":"内向的な人はしばしば聞き上手です。","type":"general","meaning_category":"内向的な性格"}]}