{"word":"sylvites","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(鉱物学) シルバイト (塩化カリウムの鉱物)","english_definition":"(mineralogy) A mineral, potassium chloride (KCl), occurring in evaporite deposits.","examples":[{"sentence":"Sylvite is an important source of potassium for fertilizers.","translation":"シルバイトは肥料のカリウムの重要な源である。"}],"collocations":["sylvite ore (シルバイト鉱石)","potash sylvite (カリウムシルバイト)"],"synonyms":["potassium chloride","KCl"],"antonyms":[]}],"etymology":{"value":"Derived from 'sylvin', an older name for the mineral, which comes from the Latin 'sal sylvius' (Sylvius' salt), named after the Dutch chemist Franciscus Sylvius (Franz de le Boë).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪlvaɪts/","syllables":"syl-vites"},"inflection":{"noun_plural":"sylvites"},"usage_notes":{"explanation":"'Sylvite' is primarily used in geological and mineralogical contexts. It refers specifically to the mineral form of potassium chloride. The term is most often encountered in discussions about potash mining and fertilizer production.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Sylvites are used as a building material.","correct":"✓ Sylvite is used as a source of potassium.","note":"Sylvite is not a building material; it's a source of potassium used in fertilizers."}],"priority":"★☆☆"},"related_words":{"derivatives":["sylvin (older name for sylvite)","halite (another evaporite mineral often found with sylvite)","potash (general term for potassium-containing salts)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sylvite' is a technical term used in geology and chemistry, specifically referring to the mineral form of potassium chloride. Understanding this term requires a background in earth sciences or chemistry. It's not a word commonly used in everyday language."},"example_sentences":[{"sentence":"The sylvite deposits in Saskatchewan are among the largest in the world.","translation":"サスカチュワン州のシルバイト鉱床は世界最大級である。","type":"noun","meaning_category":"mineralogy"},{"sentence":"The chemical formula for sylvite is KCl.","translation":"シルバイトの化学式はKClである。","type":"noun","meaning_category":"chemistry"}]}