{"word":"cotransubstantiate","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(神学)共体変化説を唱える、共体変化説を支持する","english_definition":"To assert or support the doctrine of cotransubstantiation.","examples":[{"sentence":"Some theologians cotransubstantiate the elements of communion.","translation":"一部の神学者は聖餐の要素の共体変化説を唱える。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"verb","transitivity":"vi","definition":"(神学)共体変化する","english_definition":"To undergo cotransubstantiation.","examples":[{"sentence":"According to the doctrine, the bread and wine cotransubstantiate with the body and blood of Christ.","translation":"その教義によれば、パンとワインはキリストの体と血と共体変化する。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"co- + transubstantiate","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌkoʊtrænsəbˈstænʃieɪt/","syllables":"co-tran-sub-stan-ti-ate"},"inflection":{"verb_forms":{"present_simple":["cotransubstantiate","cotransubstantiates"],"past_simple":"cotransubstantiated","past_participle":"cotransubstantiated","present_participle":"cotransubstantiating"}},"usage_notes":{"explanation":"'Cotransubstantiate' is a term primarily used in theological discussions, specifically related to the Eucharist or Holy Communion. It refers to the doctrine of cotransubstantiation, which posits that during the Eucharist, the substance of the bread and wine coexist with the substance of the body and blood of Christ, rather than being entirely replaced (as in transubstantiation). This term is relatively rare outside of theological contexts.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["cotransubstantiation (noun)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'cotransubstantiate' is a highly specialized term primarily used in theological discourse. It relates to the doctrine of cotransubstantiation, a concept concerning the nature of the Eucharist in Christian theology. Understanding this word requires familiarity with theological concepts and vocabulary. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The reformers debated whether to transubstantiate or cotransubstantiate the communion elements.","translation":"改革者たちは、聖餐の要素を実体変化させるか、共体変化させるかを議論した。","type":"verb","meaning_category":"共体変化説を唱える"},{"sentence":"Some believe that the bread and wine cotransubstantiate, remaining bread and wine while also being the body and blood of Christ.","translation":"パンとワインは共体変化し、パンとワインのままでありながら、キリストの体と血でもあると信じる人もいる。","type":"verb","meaning_category":"共体変化する"}]}