{"word":"crosswiseness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of being crosswise; the extent to which something is oriented or arranged in a crosswise manner.","english_definition":"The state or quality of being crosswise.","examples":[{"sentence":"The crosswiseness of the threads in the fabric added to its strength.","translation":"生地の糸が交差していることで、強度が増した。"},{"sentence":"The engineer checked the crosswiseness of the beams to ensure structural integrity.","translation":"エンジニアは、構造的な完全性を確保するために、梁の交差状態を確認した。"}],"collocations":["check the crosswiseness","measure the crosswiseness","adjust the crosswiseness"],"synonyms":["transversality","perpendicularity","obliqueness"],"antonyms":["parallelism","longitudinality"]}],"etymology":{"value":"Derived from 'crosswise' (adverb or adjective indicating a direction or arrangement at right angles) + '-ness' (suffix denoting a state, quality, or condition).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkrɔswaɪznəs/","syllables":"cross-wise-ness"},"inflection":{"noun_plural":"crosswisenesses"},"usage_notes":{"explanation":"'Crosswiseness' is a relatively uncommon noun that describes the degree to which something is arranged or oriented in a crosswise direction. It is often used in technical or descriptive contexts where the precise orientation of elements is important.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The crosswiseness was very cross.","correct":"✓ The crosswiseness of the arrangement was carefully considered.","note":"'Crosswiseness' refers to the arrangement, not a feeling or emotion. It describes the quality of being crosswise."}],"priority":"★☆☆"},"related_words":{"derivatives":["crosswise (adverb, adjective)"],"related_terms":["transverse","perpendicular","oblique"]},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Crosswiseness' is a technical term describing the degree to which something is arranged or oriented in a crosswise direction. It is rarely used in everyday language and is more common in technical or descriptive contexts where precise orientation is important. Understanding requires familiarity with the root word 'crosswise' and the function of the '-ness' suffix."},"example_sentences":[{"sentence":"The careful attention to the crosswiseness of the fibers improved the material's resistance to tearing.","translation":"繊維の交差状態に注意を払うことで、材料の引裂抵抗が向上した。","type":"descriptive","meaning_category":"arrangement"},{"sentence":"The software calculated the optimal crosswiseness for the antenna array.","translation":"ソフトウェアは、アンテナアレイの最適な交差状態を計算した。","type":"technical","meaning_category":"orientation"}]}