{"word":"Lodeman","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語)水先案内人、導き手、羅針盤","english_definition":"(archaic) A pilot; a guide; a loadstone or magnet.","examples":[{"sentence":"The lodeman guided the ship safely through the treacherous waters.","translation":"水先案内人は危険な水域を安全に船を導いた。"},{"sentence":"The lodeman's knowledge of the stars was invaluable to the sailors.","translation":"水先案内人の星の知識は船乗りにとって非常に貴重だった。"}],"collocations":["wise lodeman","experienced lodeman"],"synonyms":["guide","pilot","leader","loadstone","magnet"],"antonyms":["follower","lost"],"notes":"The term is archaic and rarely used in modern English. It can also refer to a loadstone or magnet, something that attracts or guides."}],"etymology":{"value":"From Middle English 'lodeman', combining 'lode' (way, course) and 'man' (person). Related to the word 'loadstone', a naturally magnetized mineral used as a compass.","priority":"★★☆"},"pronunciation":{"ipa":"ˈloʊdˌmæn","syllables":"lode-man"},"inflection":{"noun_plural":"lodemen"},"usage_notes":{"explanation":"'Lodeman' is an archaic term primarily used in historical contexts, especially those involving seafaring. It refers to a person who guides or leads, particularly a ship's pilot. It can also refer to a loadstone, a magnetic rock used for navigation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a lodeman to fix the car.","correct":"✓ He used a mechanic to fix the car.","note":"'Lodeman' refers to a guide or pilot, not a mechanic."}],"priority":"☆☆☆"},"related_words":{"derivatives":["lodestar","loadstone"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'lodeman' is archaic and rarely encountered in modern English. Understanding requires familiarity with historical seafaring terminology and vocabulary. It would typically only be found in specialized texts or historical literature."},"example_sentences":[{"sentence":"The captain trusted the lodeman's expertise to navigate the ship safely.","translation":"船長は船を安全に航行させるために、水先案内人の専門知識を信頼した。","type":"noun","meaning_category":"guide"},{"sentence":"In ancient times, sailors relied on the lodeman to find their way across the seas.","translation":"古代、船乗りは海を渡るために水先案内人に頼っていた。","type":"noun","meaning_category":"guide"},{"sentence":"The lodeman pointed towards the North Star, ensuring the ship stayed on course.","translation":"水先案内人は北極星を指し、船がコースから外れないようにした。","type":"noun","meaning_category":"guide"}]}