{"word":"ungarnered","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"収穫されていない、集められていない","english_definition":"Not gathered; uncollected; not harvested.","examples":[{"sentence":"The ungarnered crops lay rotting in the fields.","translation":"収穫されなかった作物が畑で腐っていた。"},{"sentence":"Ungarnered wisdom is of little use to anyone.","translation":"集められていない知恵は誰にとってもほとんど役に立たない。"}],"collocations":["ungarnered crops","ungarnered fruit","ungarnered knowledge","ungarnered resources"],"synonyms":["uncollected","unharvested","unreaped","unpicked","unobtained"],"antonyms":["garnered","collected","harvested","reaped","picked","obtained"]}],"etymology":{"value":"\"Ungarnered\" is formed by adding the prefix \"un-\" (meaning \"not\") to the past participle \"garnered\" of the verb \"garner.\" The verb \"garner\" comes from the Old French word \"grenier,\" meaning \"granary\" or \"barn.\" Ultimately, it traces back to the Latin word \"granarium,\" which is derived from \"granum\" meaning \"grain.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈɡɑːrnərd/","syllables":"un-gar-nerd"},"inflection":{"notes":"Since it's an adjective, its inflections are limited to comparative and superlative forms (more ungarnered, most ungarnered), though these are rarely used."},"usage_notes":{"explanation":"\"Ungarnered\" is a relatively rare word, primarily used in formal or literary contexts. It describes something that has not been gathered or collected, often referring to crops that have not been harvested. It can also be used metaphorically to describe knowledge, resources, or other things that have not been acquired or utilized. The word emphasizes the state of being uncollected or unutilized, suggesting a potential loss or waste.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He ungarnered the information from the internet.","correct":"✓ He garnered the information from the internet.","note":"\"Ungarnered\" means *not* collected. To say someone collected information, use \"garnered.\""},{"incorrect":"✗ The field was full of ungarnered animals.","correct":"✓ The field was full of unharvested crops.","note":"\"Ungarnered\" typically refers to crops, knowledge, or resources, not animals."}],"priority":"★★☆"},"related_words":{"derivatives":["garner (verb, noun)","garnering (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"ungarnered\" is relatively uncommon and is typically found in more formal or literary contexts. It means \"not gathered\" or \"uncollected.\" Understanding the prefix \"un-\" and the root word \"garner\" (to gather or collect) is helpful in deciphering its meaning. It is not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The poet lamented the ungarnered potential of the lost generation.","translation":"詩人は失われた世代の収穫されなかった可能性を嘆いた。","type":"adjective","meaning_category":"metaphorical"},{"sentence":"The farmer worried about the ungarnered wheat due to the impending storm.","translation":"農家は近づく嵐のため、収穫されていない小麦を心配した。","type":"adjective","meaning_category":"crops"},{"sentence":"Much of the world's ungarnered solar energy could be used to power homes and businesses.","translation":"世界の収穫されていない太陽エネルギーの多くは、家庭や企業に電力を供給するために使用できる。","type":"adjective","meaning_category":"resources"}]}