{"word":"music-copying","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"The act or profession of creating written copies of musical scores or parts.","english_definition":"The act or profession of creating written copies of musical scores or parts.","examples":[{"sentence":"Music-copying was a vital skill before the advent of widespread music printing.","translation":"音楽のコピーは、音楽印刷が広く普及する前は不可欠なスキルでした。"},{"sentence":"The music-copying industry has largely been replaced by digital notation software.","translation":"音楽コピー業界は、主にデジタル楽譜作成ソフトウェアに取って代わられました。"}],"collocations":["professional music-copying","handwritten music-copying","digital music-copying"],"synonyms":["music transcription","music notation","score copying"],"antonyms":[]}],"etymology":{"value":"Combination of 'music' and 'copying'. Reflects the historical practice of manually copying musical scores.","priority":"2"},"pronunciation":{"ipa":"/ˈmjuːzɪkˌkɒpiɪŋ/","syllables":"mu-sic-cop-y-ing"},"inflection":{"noun_plural":"music-copyings (rarely used)"},"usage_notes":{"explanation":"The term 'music-copying' refers to the manual or digital process of creating copies of musical scores. Historically, this was a skilled profession involving meticulous handwriting. Today, it often involves using music notation software.","priority":"3"},"common_mistakes":{"examples":[],"priority":"1"},"related_words":{"derivatives":["music copyist","copyist"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"1"},"readability_explanation":{"level":"C1","text":"The term 'music-copying' describes the activity of creating copies of musical scores, either by hand or using digital tools. This was a significant profession before the widespread availability of printed music. Today, the term is less common due to the prevalence of digital notation software, but it still refers to the process of creating musical scores. Understanding the term requires some familiarity with music history and the evolution of music notation. "},"example_sentences":[{"sentence":"The art of music-copying required precision and a deep understanding of musical notation.","translation":"音楽コピーの技術には、正確さと音楽記譜法の深い理解が必要でした。","type":"noun","meaning_category":"Act of copying music"},{"sentence":"With the rise of computers, music-copying became more accessible to amateur musicians.","translation":"コンピュータの普及により、音楽コピーはアマチュアの音楽家にとってより身近なものになりました。","type":"noun","meaning_category":"Act of copying music"}]}