{"word":"phalansterian","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(社会主義の)ファランステール主義の、ファランステールに関連する","english_definition":"Of or relating to a phalanstery or phalansteries; of or relating to the social theories of Charles Fourier.","examples":[{"sentence":"phalansterian communities","translation":"ファランステール主義の共同体"},{"sentence":"phalansterian ideals","translation":"ファランステール主義の理想"}],"collocations":["phalansterian community","phalansterian socialism","phalansterian movement"],"synonyms":["Fourierist","utopian socialist"],"antonyms":[]}],"etymology":{"value":"From phalanstery + -an. Phalanstery is from French phalanstère, from phalange (phalanx) + -stère (from monastere, monastery).","priority":"★★☆"},"pronunciation":{"ipa":"/fəˌlænˈstɪəriən/","syllables":"pha-lan-ste-ri-an"},"inflection":{"notes":"This word is an adjective, so it has comparative and superlative forms, but they are rarely used. More common is to use 'more phalansterian' and 'most phalansterian'."},"usage_notes":{"explanation":"The term 'phalansterian' is specifically linked to the utopian socialist theories of Charles Fourier, who advocated for the organization of society into self-sufficient communities called phalansteries. The word is not commonly used outside of historical or academic contexts related to socialism and utopianism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He described his political views as phalanstery.","correct":"✓ He described his political views as phalansterian.","note":"'Phalanstery' is a noun referring to the community itself, while 'phalansterian' is the adjective describing something related to phalansteries or Fourier's theories."}],"priority":"★★☆"},"related_words":{"derivatives":["phalanstery","Fourierism","Fourierist"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'phalansterian' is a specialized term related to the history of socialist thought, specifically referring to the ideas of Charles Fourier and the planned communities called phalansteries. It is rarely used outside of academic discussions of utopian socialism."},"example_sentences":[{"sentence":"The book explores the influence of phalansterian ideas on early American socialist movements.","translation":"その本は、初期のアメリカ社会主義運動に対するファランステール主義の思想の影響を探求している。","type":"adjective","meaning_category":"relating to phalansteries"},{"sentence":"They attempted to create a phalansterian society based on cooperation and shared resources.","translation":"彼らは協力と資源の共有に基づいたファランステール主義の社会を創造しようと試みた。","type":"adjective","meaning_category":"relating to phalansteries"}]}