{"word":"atheromatous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アテローム性の、粥腫性の","english_definition":"Relating to or characterized by atheroma; affected with atheroma.","examples":[{"sentence":"The patient was diagnosed with atheromatous disease.","translation":"患者はアテローム性疾患と診断された。"},{"sentence":"Atheromatous plaques were found in the arteries.","translation":"動脈にアテローム性プラークが見つかった。"}],"collocations":["atheromatous plaque","atheromatous disease","atheromatous lesion"],"synonyms":["atherosclerotic"],"antonyms":[]}],"etymology":{"value":"From atheroma + -tous.  Atheroma comes from Greek ἀθήρα (athḗra) meaning 'gruel, porridge'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæθəˈrɒmətəs/","syllables":"ath-er-o-ma-tous"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It has comparative and superlative forms, but they are rarely used (more atheromatous, most atheromatous)."},"usage_notes":{"explanation":"'Atheromatous' specifically refers to the presence or characteristics of atheroma, which is a degenerative accumulation of lipid-containing plaques on the innermost layer of the artery wall (intima). It is a key feature of atherosclerosis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artery was atheroma.","correct":"✓ The artery was atheromatous.","note":"'Atheroma' is the noun (the plaque itself), while 'atheromatous' is the adjective describing something related to or affected by atheroma."}],"priority":"★★☆"},"related_words":{"derivatives":["atheroma","atherosclerosis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'atheromatous' is a highly specialized medical term. It is used to describe conditions or features related to atheroma, which are fatty deposits in the arteries. Understanding this word requires a strong background in biology or medicine. It's not commonly used outside of medical contexts."},"example_sentences":[{"sentence":"The atheromatous changes in the aorta were significant.","translation":"大動脈のアテローム性変化は著しかった。","type":"adjective","meaning_category":"describing disease"},{"sentence":"An atheromatous embolism can cause serious complications.","translation":"アテローム塞栓症は深刻な合併症を引き起こす可能性がある。","type":"adjective","meaning_category":"describing embolism"}]}