{"word":"pest-susceptible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"害虫に弱い、害虫に侵されやすい","english_definition":"Likely to be affected by pests; vulnerable to pest infestations.","examples":[{"sentence":"This variety of apple tree is pest-susceptible and requires regular spraying.","translation":"この品種のリンゴの木は害虫に弱く、定期的な噴霧が必要です。"},{"sentence":"Pest-susceptible crops can suffer significant yield losses if not properly managed.","translation":"害虫に弱い作物は、適切に管理しないと収穫量が大幅に減少する可能性があります。"},{"sentence":"The researchers are studying ways to make these pest-susceptible plants more resistant.","translation":"研究者たちは、これらの害虫に弱い植物をより抵抗性にする方法を研究しています。"}],"collocations":["pest-susceptible crops (害虫に弱い作物)","pest-susceptible plants (害虫に弱い植物)","pest-susceptible variety (害虫に弱い品種)"],"synonyms":["vulnerable to pests","prone to infestation","susceptible to insects","liable to pest damage"],"antonyms":["pest-resistant","pest-tolerant","insect-resistant","resistant to pests"]}],"etymology":{"value":"The word is formed by combining 'pest' (an annoying or destructive insect or other animal that attacks crops, food, or livestock) and 'susceptible' (likely or liable to be influenced or harmed by a particular thing).","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɛst səˈsɛptəbəl/","syllables":"pest-suh-sep-tuh-bul"},"inflection":{"notes":"Adjectives do not typically inflect in English. Comparative and superlative forms are 'more pest-susceptible' and 'most pest-susceptible', respectively."},"usage_notes":{"explanation":"'Pest-susceptible' is commonly used in agricultural and horticultural contexts to describe plants, crops, or other organisms that are easily damaged or infested by pests. It highlights the need for protective measures to prevent pest-related losses.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is susceptible for pests.","correct":"✓ The plant is susceptible to pests.","note":"The correct preposition to use with 'susceptible' in this context is 'to', not 'for'."},{"incorrect":"✗ This crop is very pest susceptible.","correct":"✓ This crop is very pest-susceptible.","note":"The hyphen is important to correctly form the compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["susceptibility (名詞: 感受性、影響されやすさ)"],"phrasal_verbs":[],"related_terms":["pest control (害虫駆除)","pest management (害虫管理)","insecticide (殺虫剤)","herbicide (除草剤)","fungicide (殺菌剤)"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, primarily used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pest-susceptible' is a technical term commonly used in agriculture, horticulture, and related fields. It describes organisms, particularly plants, that are easily affected or damaged by pests. Understanding this term is important for those working in these fields to assess risks and implement appropriate protective measures. It is a compound adjective, meaning it combines two words to create a single descriptive term. The term is relatively infrequent in general conversation but essential in specific professional contexts."},"example_sentences":[{"sentence":"The new breed of wheat is less pest-susceptible than older varieties.","translation":"その新しい小麦の品種は、古い品種よりも害虫に侵されにくい。","type":"adjective","meaning_category":"害虫に弱い"},{"sentence":"Farmers must carefully monitor pest-susceptible fields for early signs of infestation.","translation":"農家は、害虫に弱い畑を注意深く監視して、初期の兆候がないか確認する必要があります。","type":"adjective","meaning_category":"害虫に弱い"},{"sentence":"The study identified several pest-susceptible genes in the tomato genome.","translation":"その研究では、トマトのゲノムにおけるいくつかの害虫に弱い遺伝子が特定されました。","type":"adjective","meaning_category":"害虫に弱い"}]}