{"word":"Sociosexualities","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)社会性的指向：社会、文化、および関係の文脈における人間の性的行動、態度、およびアイデンティティの多様な表現。","english_definition":"(plural) The diverse expressions of human sexual behavior, attitudes, and identities within social, cultural, and relational contexts.","examples":[{"sentence":"Sociosexualities encompass a wide range of behaviors and attitudes towards casual sex, commitment, and relationships.","translation":"社会性的指向は、カジュアルなセックス、コミットメント、および関係に対する幅広い行動と態度を包含する。"},{"sentence":"Research on sociosexualities explores how cultural norms influence individual sexual expression.","translation":"社会性的指向に関する研究は、文化的規範が個人の性的表現にどのように影響するかを探求する。"},{"sentence":"Understanding sociosexualities requires considering the intersection of gender, race, class, and other social factors.","translation":"社会性的指向を理解するには、ジェンダー、人種、階級、およびその他の社会的要因の交差点を考慮する必要がある。"}],"collocations":["study of sociosexualities (社会性的指向の研究)","diversity of sociosexualities (社会性的指向の多様性)","influence on sociosexualities (社会性的指向への影響)"],"synonyms":["sexual behaviors","sexual attitudes","sexual identities","sexual practices","relationship orientations"],"antonyms":["asexuality (無性愛)","celibacy (禁欲)"]}],"etymology":{"value":"\"Socio-\" (社会) + \"sexualities\" (性的指向の複数形)。社会的な文脈における多様な性的表現を指す複合語。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsoʊsioʊsekʃuˈælətiz/","syllables":"so-ci-o-sex-u-al-i-ties"},"inflection":{"noun_plural":"Sociosexualities"},"usage_notes":{"explanation":"\"Sociosexualities\"は、社会、文化、歴史的文脈における人間の性的行動、態度、およびアイデンティティの多様性を指す学術的な用語です。この用語は、個人の性的指向だけでなく、社会的な規範や期待がどのように性的行動に影響を与えるかを強調します。研究分野として、ジェンダー、人種、階級などの社会的な要因が性的表現にどのように影響するかを探求します。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Sociosexuality is only about casual sex.","correct":"✓ Sociosexuality encompasses a wide range of sexual behaviors and attitudes, including but not limited to casual sex.","note":"社会性的指向はカジュアルなセックスだけを指すのではなく、コミットメント、関係、性的アイデンティティなど、より広範な性的行動と態度を含む。"},{"incorrect":"✗ Sociosexualities are determined solely by individual choice.","correct":"✓ Sociosexualities are influenced by both individual choices and social factors.","note":"社会性的指向は個人の選択だけでなく、文化的規範、社会的期待、および歴史的文脈によって影響を受ける。"}],"priority":"★★☆"},"related_words":{"derivatives":["sociosexual (形容詞：社会性的)","sociosexuality (名詞：社会性的指向)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 学術的な文脈で使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Sociosexualities\"は、社会的な文脈における人間の性的行動、態度、およびアイデンティティの多様性を指す専門用語です。この用語は、個人の性的指向だけでなく、社会的な規範や期待がどのように性的表現に影響を与えるかを強調します。研究分野として、ジェンダー、人種、階級などの社会的な要因が性的表現にどのように影響するかを探求します。この用語は、学術的な文脈で主に使用されます。"},"example_sentences":[{"sentence":"The study of sociosexualities reveals the complex interplay between individual desires and social norms.","translation":"社会性的指向の研究は、個人の欲求と社会的規範との間の複雑な相互作用を明らかにする。","type":"noun","meaning_category":"社会性的指向の研究"},{"sentence":"Cultural differences significantly shape the expression of sociosexualities across different societies.","translation":"文化的な違いは、異なる社会における社会性的指向の表現を大きく形作る。","type":"noun","meaning_category":"社会性的指向の表現"},{"sentence":"Understanding sociosexualities is crucial for promoting inclusivity and challenging harmful stereotypes.","translation":"社会性的指向を理解することは、包括性を促進し、有害な固定観念に挑戦するために不可欠である。","type":"noun","meaning_category":"社会性的指向の理解"}]}