{"word":"metrorrhea","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不正性器出血、子宮不正出血","english_definition":"Uterine bleeding occurring at irregular intervals, especially between the expected menstrual periods.","examples":[{"sentence":"The patient presented with metrorrhea and abdominal pain.","translation":"患者は不正性器出血と腹痛を訴えて来院した。"},{"sentence":"Metrorrhea can be a symptom of various underlying conditions.","translation":"不正性器出血は、さまざまな基礎疾患の症状である可能性がある。"}],"collocations":["experience metrorrhea (不正性器出血を経験する)","cause metrorrhea (不正性器出血を引き起こす)","treat metrorrhea (不正性器出血を治療する)"],"synonyms":["uterine bleeding","abnormal uterine bleeding","intermenstrual bleeding"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'metra' (uterus) and 'rhein' (to flow).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmiːtrəˈriːə/","syllables":"me-tro-rrhe-a"},"inflection":{"noun_plural":"metrorrheas"},"usage_notes":{"explanation":"Metrorrhea refers to any uterine bleeding that occurs outside of the normal menstrual cycle. It is a symptom, not a disease itself, and can indicate a variety of underlying conditions, ranging from hormonal imbalances to more serious issues like uterine fibroids or cancer. It is important to consult a healthcare professional for diagnosis and treatment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She has metrorrhea for a week now, so she took some pain killers.","correct":"✓ She has had metrorrhea for a week now, so she should consult a doctor.","note":"Metrorrhea is a symptom that requires medical evaluation, not just pain management. Self-treating with painkillers is not appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["menorrhagia (過多月経)","oligomenorrhea (稀発月経)","amenorrhea (無月経)"],"medical_terms":["endometrial hyperplasia (子宮内膜増殖症)","uterine fibroids (子宮筋腫)","endometrial cancer (子宮内膜がん)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Metrorrhea' is a medical term referring to uterine bleeding that occurs at irregular intervals, especially between expected menstrual periods. It is a symptom that can be caused by various underlying conditions and requires medical evaluation. This term is primarily used in medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Persistent metrorrhea prompted further investigation by the gynecologist.","translation":"持続的な不正性器出血のため、婦人科医によるさらなる検査が行われた。","type":"general","meaning_category":"symptom"},{"sentence":"Hormonal imbalances are a common cause of metrorrhea in women of reproductive age.","translation":"ホルモンバランスの乱れは、生殖年齢の女性における不正性器出血の一般的な原因である。","type":"general","meaning_category":"cause"}]}