{"word":"semipatriot","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"半愛国者：部分的に、または条件付きで自国を支持する人。愛国心を行動や信念の選択的基準として用いる人。","english_definition":"A person who supports their country partially or conditionally; someone whose patriotism is a selective criterion for actions or beliefs.","examples":[{"sentence":"He was labeled a semipatriot for criticizing the government's policies while still claiming to love his country.","translation":"彼は政府の政策を批判しながらも、自国を愛していると主張したため、半愛国者というレッテルを貼られた。"},{"sentence":"The article discussed the rise of semipatriots who question traditional values but still feel a sense of national identity.","translation":"その記事では、伝統的な価値観に疑問を抱きながらも、国民としてのアイデンティティを感じている半愛国者の台頭について論じている。"}],"collocations":["conditional support","selective patriotism","questioning nationalism","critical patriot"],"synonyms":["conditional patriot","selective nationalist","critical supporter","qualified patriot"],"antonyms":["patriot","nationalist","chauvinist","jingoist"]}],"etymology":{"value":"\"semi-\"（半分、部分的）と \"patriot\"（愛国者）の組み合わせ。","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmiˈpeɪtriət/","syllables":"se-mi-pa-tri-ot"},"inflection":{"noun_plural":"semipatriots"},"usage_notes":{"explanation":"\"semipatriot\"は、完全な愛国者とは異なり、自国への支持が条件付きであるか、選択的である人物を指す言葉です。この用語は、政府の政策や社会の価値観に対して批判的な見方を持ちながらも、自国に対する一定の愛着や責任感を持っている人を指すことがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a semipatriot because he always agrees with the government.","correct":"✓ He is not a semipatriot because he always agrees with the government.","note":"半愛国者は政府に批判的な場合があるため、常に政府に同意する人は半愛国者とは言えません。"},{"incorrect":"✗ Semipatriots are always traitors.","correct":"✓ Semipatriots are not necessarily traitors.","note":"半愛国者は必ずしも裏切り者ではありません。彼らは自国を愛していますが、批判的な視点も持っています。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["patriotism","nationalism","critic","dissent","loyalty","allegiance"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"\"Semipatriot\" is a term used to describe someone who is patriotic to some extent, but not entirely or unconditionally. They may have criticisms or reservations about their country's policies or actions, which distinguishes them from staunch nationalists or patriots. This word is not commonly used and may require some understanding of political nuances to fully grasp its meaning."},"example_sentences":[{"sentence":"The political commentator described the senator as a semipatriot because he often voted against his party's national defense bills.","translation":"その政治評論家は、上院議員がしばしば党の国防法案に反対票を投じるため、彼を半愛国者だと評した。","type":"noun","meaning_category":"conditional support"},{"sentence":"Some viewed his protests as unpatriotic, while others saw him as a semipatriot trying to improve the country from within.","translation":"彼の抗議活動を非愛国的だと見る人もいれば、国内から国を改善しようとする半愛国者だと見る人もいた。","type":"noun","meaning_category":"critical patriot"}]}