{"word":"formfehlerhaft","language":"de","meanings":[{"part_of_speech":"adjective","definition":"形式的な誤りがある、手続き上の欠陥がある","english_definition":"formally defective; containing a procedural error; invalid due to a formal mistake","examples":[{"sentence":"Der Antrag wurde als formfehlerhaft abgelehnt.","translation":"The application was rejected as formally defective.","english_translation":"The application was rejected as formally defective."},{"sentence":"Die Wahl war formfehlerhaft, daher muss sie wiederholt werden.","translation":"The election was flawed due to procedural errors, so it must be repeated.","english_translation":"The election was flawed due to procedural errors, so it must be repeated."}],"collocations":["ein formfehlerhafter Antrag (a formally defective application)","eine formfehlerhafte Wahl (a flawed election)","formfehlerhaft sein (to be formally defective)","als formfehlerhaft ablehnen (to reject as formally defective)"],"synonyms":["ungültig","fehlerhaft","nicht rechtsgültig","formal fehlerhaft"],"antonyms":["gültig","rechtsgültig","formell korrekt"],"notes":"This term is often used in legal and administrative contexts."}],"etymology":{"value":"Composed of 'Form' (form), 'Fehler' (error), and '-haft' (suffix indicating a quality or characteristic).","priority":"medium"},"pronunciation":{"ipa":"ˈfɔʁmˌfeːlɐhaft","syllables":"Form-feh-ler-haft"},"inflection":{"notes":"Adjective inflection follows standard German adjective declension rules."},"usage_notes":{"explanation":"'Formfehlerhaft' describes something that is invalid or defective because it does not meet the required formal criteria or procedures. It is commonly used in legal, administrative, and bureaucratic contexts.","priority":"high"},"related_words":{"derivatives":["Formfehler (formal error, procedural defect)"]},"level_frequency":{"level":"C1-C2","frequency":"low"},"readability_explanation":{"level":"C1","text":"The word 'formfehlerhaft' is a relatively complex German adjective used in formal contexts, particularly in law and administration. It describes something that is invalid because it contains a formal error or doesn't meet the required procedural standards. Understanding this word requires a good grasp of German legal and administrative terminology."},"example_sentences":[{"sentence":"Aufgrund eines formfehlerhaften Antrags konnte die Baugenehmigung nicht erteilt werden.","translation":"Due to a formally defective application, the building permit could not be issued.","english_translation":"Due to a formally defective application, the building permit could not be issued."},{"sentence":"Das Gericht erklärte den Vertrag für formfehlerhaft und somit ungültig.","translation":"The court declared the contract formally defective and therefore invalid.","english_translation":"The court declared the contract formally defective and therefore invalid."}]}