{"word":"grass-eater","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"草食動物","english_definition":"An animal that feeds primarily on grass.","examples":[{"sentence":"Cows are grass-eaters.","translation":"牛は草食動物です。"},{"sentence":"Many herbivores, such as horses and sheep, are grass-eaters.","translation":"馬や羊のような多くの草食動物は、草食動物です。"}],"collocations":["primary grass-eater","common grass-eater"],"synonyms":["herbivore","grazer"],"antonyms":["carnivore","meat-eater"]},{"part_of_speech":"noun","definition":"(俗語) おとなしい人、競争心のない人、特に男性","english_definition":"(slang) A docile, uncompetitive person, especially a man.","examples":[{"sentence":"He's such a grass-eater; he never stands up for himself.","translation":"彼はとてもおとなしい人で、決して自分のために立ち上がらない。"},{"sentence":"In the business world, you can't be a grass-eater if you want to succeed.","translation":"ビジネスの世界では、成功したいならおとなしい人ではいけない。"}],"collocations":["typical grass-eater","complete grass-eater"],"synonyms":["pushover","doormat","milquetoast"],"antonyms":["assertive","aggressive","go-getter"]}],"etymology":{"value":"The term is a compound word formed by combining 'grass' and 'eater,' literally referring to something that eats grass. The slang meaning likely evolved from the idea that grass-eaters are passive and non-threatening.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡræsˌiːtər/","syllables":"grass-eat-er"},"inflection":{"noun_plural":"grass-eaters"},"usage_notes":{"explanation":"The term 'grass-eater' has two distinct meanings. The primary meaning refers to animals that eat grass. The slang meaning is derogatory and refers to someone who is seen as weak, passive, and lacking ambition. The slang usage is more common in informal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a grass eater, so he eats meat.","correct":"✓ He is a meat-eater, so he eats meat.","note":"Grass-eaters do not eat meat; they eat grass. Meat-eaters eat meat."},{"incorrect":"✗ She called him a grass-eater because he was eating grass.","correct":"✓ She called him a grass-eater because he was not assertive.","note":"The slang term 'grass-eater' is used to describe someone's personality, not their diet."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'grass-eater' has two meanings, one literal and one figurative. The literal meaning refers to an animal that eats grass, which is straightforward. The figurative meaning is slang and refers to a person who is seen as docile, uncompetitive, or lacking assertiveness. Understanding the context is crucial to interpreting the intended meaning. The slang usage may not be familiar to all English speakers.","priority":"★☆☆"},"example_sentences":[{"sentence":"The plains were filled with grass-eaters like bison and antelope.","translation":"平原はバイソンやアンテロープのような草食動物でいっぱいだった。","type":"noun","meaning_category":"草食動物"},{"sentence":"He's such a grass-eater; he always lets people walk all over him.","translation":"彼はとてもおとなしい人で、いつも人にいいようにされてしまう。","type":"noun","meaning_category":"おとなしい人"}]}