{"word":"catechetical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"問答形式の、教理問答の","english_definition":"Relating to or resembling catechesis; employing or consisting of questions and answers.","examples":[{"sentence":"The priest used a catechetical method to teach the children about their faith.","translation":"司祭は子供たちに信仰について教えるために、問答形式の方法を用いた。"},{"sentence":"The catechetical instruction prepared the students for confirmation.","translation":"教理問答による指導は、生徒たちを堅信礼の準備をさせた。"}],"collocations":["catechetical instruction","catechetical method","catechetical school"],"synonyms":["didactic","instructional","educational","interrogative"],"antonyms":[],"notes":"Often used in a religious context, especially Christianity."}],"etymology":{"value":"From Late Latin *catecheticus*, from Greek *katēchētikos* 'oral instruction', from *katēkhein* 'to teach orally, instruct', from *kata-* 'down' + *ēkhein* 'to sound'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkætɪˈkɛtɪkəl/","syllables":"cat-e-chet-i-cal"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Catechetical' refers to something that is structured as a series of questions and answers, especially for instructional purposes. It is most commonly used in the context of religious education.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The catechetical exam was easy.","correct":"The catechism exam was easy.","note":"'Catechetical' describes the *method*, while 'catechism' is the *content* or the book containing the questions and answers."}],"priority":"★★☆"},"related_words":{"derivatives":["catechesis (noun): religious instruction given to a person preparing for baptism or confirmation.","catechism (noun): a summary of the principles of Christian religion in the form of questions and answers, used for the instruction of Christians.","catechist (noun): a teacher of the principles of Christian religion, especially by means of questions and answers."],"priority":"★★★"},"level_frequency":{"priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'catechetical' is a relatively uncommon word, primarily used in religious or educational contexts to describe a question-and-answer based method of teaching. It is derived from 'catechesis,' which refers to oral religious instruction. Understanding the word requires familiarity with the concept of religious education and instructional methods."},"example_sentences":[{"sentence":"The professor adopted a catechetical approach to engage the students in active learning.","translation":"教授は学生をアクティブラーニングに参加させるために、問答形式のアプローチを採用した。","type":"adjective","meaning_category":"問答形式の"},{"sentence":"Catechetical sermons were common in the early church.","translation":"教理問答形式の説教は、初期の教会で一般的だった。","type":"adjective","meaning_category":"教理問答の"}]}