{"word":"Astakiwi","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(trademark) A food product containing astaxanthin, typically derived from Haematococcus pluvialis microalgae, and New Zealand kiwifruit.","english_definition":"A brand name for a food product containing astaxanthin and New Zealand kiwifruit.","examples":[{"sentence":"Astakiwi is marketed as a health supplement due to the antioxidant properties of astaxanthin.","translation":"アスタキウィは、アスタキサンチンの抗酸化作用により、健康補助食品として販売されています。"}],"collocations":["Astakiwi supplement","Astakiwi capsule"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"A portmanteau of 'astaxanthin' and 'kiwi', reflecting the key ingredients of the product.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæstəˈkiːwiː/","syllables":"As-ta-ki-wi"},"inflection":{"noun_plural":"Astakiwis"},"usage_notes":{"explanation":"'Astakiwi' is primarily used as a proper noun to refer to the specific branded product. It is not a generic term for astaxanthin or kiwifruit.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought some astakiwi to make a smoothie.","correct":"✓ I bought some Astakiwi to make a smoothie.","note":"Always capitalize 'Astakiwi' as it is a brand name."},{"incorrect":"✗ Astakiwi is a type of kiwifruit.","correct":"✓ Astakiwi is a product containing kiwifruit and astaxanthin.","note":"Astakiwi is not a type of kiwifruit; it's a product that includes kiwifruit as an ingredient."}],"priority":"★★☆"},"related_words":{"derivatives":["astaxanthin","kiwifruit"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily associated with product marketing and related discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Astakiwi' is a specialized term referring to a specific branded food product. Understanding its meaning requires familiarity with the ingredients (astaxanthin and kiwifruit) and the context of health supplements and branded products. It's not a commonly used word outside of marketing and related discussions.","priority":"★★★"},"example_sentences":[{"sentence":"The health benefits of Astakiwi are attributed to its high astaxanthin content.","translation":"アスタキウィの健康効果は、アスタキサンチンの含有量が多いことに起因すると考えられています。","type":"noun","meaning_category":"food product"},{"sentence":"You can purchase Astakiwi online or at select health food stores.","translation":"アスタキウィはオンラインまたは一部の健康食品店で購入できます。","type":"noun","meaning_category":"food product"}]}