{"word":"bagoong","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"バゴーン：フィリピン料理で、発酵させた魚やエビで作られる調味料。塩辛のようなもの。","english_definition":"Bagoong: A Philippine condiment made by fermenting fish or shrimp with salt.","examples":[{"sentence":"Bagoong is often eaten with green mangoes.","translation":"バゴーンはしばしば青マンゴーと一緒に食べられます。"},{"sentence":"The distinct smell of bagoong filled the kitchen.","translation":"バゴーン独特の匂いが台所に広がった。"}],"collocations":["eat with bagoong (バゴーンと一緒に食べる)","smell of bagoong (バゴーンの匂い)","make bagoong (バゴーンを作る)"],"synonyms":["fish paste","shrimp paste"],"antonyms":[]}],"etymology":{"value":"タガログ語の「bagoong」に由来。","priority":"★★★"},"pronunciation":{"ipa":"/bɐˈɡoʊ.ɔŋ/","syllables":"ba-go-ong"},"inflection":{"noun_plural":"bagoongs"},"usage_notes":{"explanation":"Bagoong is a staple condiment in Filipino cuisine, similar to fish sauce or shrimp paste used in other Southeast Asian countries. It's known for its strong, pungent smell and salty, umami flavor. It is often used as a dipping sauce, a flavor enhancer in cooked dishes, or eaten with rice and vegetables.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I don't like the taste of bagoong because it's too sweet.","correct":"✓ I don't like the taste of bagoong because it's too salty.","note":"Bagoong is known for its saltiness, not sweetness."},{"incorrect":"✗ Bagoong is a type of cheese.","correct":"✓ Bagoong is a type of fermented fish or shrimp paste.","note":"Bagoong is made from fish or shrimp, not cheese."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_dishes":["Kare-kare (カレカレ: 牛肉とピーナッツソースのシチューで、バゴーンを添えて食べる)","Pinakbet (ピナクベット: 野菜の煮込みで、バゴーンで味付けされる)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Not applicable (specific cultural food term)","frequency_google_ngram":"Low frequency (specific cultural food term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Bagoong is a specific culinary term referring to a fermented fish or shrimp paste widely used in Filipino cuisine. Understanding this term requires familiarity with Filipino food culture. It's primarily encountered in discussions or recipes related to Filipino dishes. Due to its cultural specificity, it's not typically part of general English vocabulary. The term's comprehension relies on cultural context rather than linguistic complexity."},"example_sentences":[{"sentence":"Many Filipinos enjoy eating green mangoes with **bagoong**.","translation":"多くのフィリピン人は青マンゴーをバゴーンと一緒に食べるのを楽しんでいます。","type":"noun","meaning_category":"調味料"},{"sentence":"The aroma of **bagoong** filled the air as my grandmother cooked.","translation":"祖母が料理をすると、バゴーンの香りが漂った。","type":"noun","meaning_category":"調味料"},{"sentence":"Some versions of **bagoong** are made with shrimp, while others are made with fish.","translation":"バゴーンにはエビで作られたものもあれば、魚で作られたものもあります。","type":"noun","meaning_category":"調味料"}]}