{"word":"criticality-related","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"臨界に関連する、臨界状態に関連する","english_definition":"Relating to or associated with criticality, a state in which a nuclear chain reaction is self-sustaining.","examples":[{"sentence":"The report discussed several criticality-related incidents at the facility.","translation":"その報告書では、施設で発生したいくつかの臨界関連の事象について議論された。"},{"sentence":"Safety measures are crucial to prevent criticality-related accidents.","translation":"臨界関連の事故を防ぐためには、安全対策が不可欠である。"},{"sentence":"The study focused on the criticality-related aspects of nuclear fuel storage.","translation":"その研究は、核燃料貯蔵の臨界関連の側面に焦点を当てた。"}],"collocations":["criticality-related accident","criticality-related safety","criticality-related analysis","criticality-related risk","criticality-related concerns"],"synonyms":["nuclear-criticality-related","chain-reaction-related"],"antonyms":["non-criticality-related"]}],"etymology":{"value":"Formed by combining \"criticality\" (the state of being critical, especially in a nuclear context) with \"related\" (connected or associated).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌkrɪtɪˈkæləti rɪˈleɪtɪd/","syllables":"cri-ti-cal-i-ty re-lat-ed"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"The term \"criticality-related\" is highly specialized, primarily used in the context of nuclear engineering and physics. It refers to anything that pertains to the condition of criticality, where a nuclear chain reaction becomes self-sustaining. This term is often found in technical reports, safety assessments, and scientific literature concerning nuclear reactors, nuclear fuel storage, and other nuclear processes. It emphasizes the connection to the specific state of criticality and its implications.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The criticality-related is important.","correct":"✓ Criticality-related safety is important.","note":"\"Criticality-related\" is an adjective and must be followed by a noun. It cannot stand alone as a subject or object. "},{"incorrect":"✗ The accident was criticality.","correct":"✓ The accident was criticality-related.","note":"\"Criticality\" is a state or condition. To describe something associated with that state, use \"criticality-related.\""}],"priority":"☆☆☆"},"related_words":{"derivatives":["criticality","related"],"phrasal_verbs":[],"related_terms":["nuclear","chain reaction","reactor","fissile","neutron","moderator","control rod","safety"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2 (Highly specialized vocabulary)","frequency_google_ngram":"Very low frequency - Primarily used in specialized technical and scientific contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term \"criticality-related\" is a highly technical term used almost exclusively in the field of nuclear science and engineering. Understanding this term requires familiarity with the concept of nuclear criticality, which is a state where a nuclear chain reaction is self-sustaining. Therefore, this term is only appropriate for use in contexts where the audience has a strong background in nuclear physics or related fields."},"example_sentences":[{"sentence":"The investigation focused on identifying the causes of the criticality-related event.","translation":"調査は、臨界関連の事象の原因特定に焦点を当てた。","type":"adjective","meaning_category":"relating to criticality"},{"sentence":"The new regulations address several criticality-related safety concerns.","translation":"新しい規制は、いくつかの臨界関連の安全上の懸念事項に対処する。","type":"adjective","meaning_category":"relating to criticality"},{"sentence":"A detailed criticality-related analysis was performed to assess the risk.","translation":"リスクを評価するために、詳細な臨界関連の分析が実施された。","type":"adjective","meaning_category":"relating to criticality"}]}