{"word":"non-sporicidal","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"胞子を殺菌しない、殺胞子性がない","english_definition":"Not having the ability to kill spores.","examples":[{"sentence":"This disinfectant is non-sporicidal, so it won't eliminate all types of bacteria.","translation":"この消毒剤は非殺胞子性なので、すべての種類の細菌を排除するわけではありません。"},{"sentence":"For general cleaning, a non-sporicidal cleaner may be sufficient, but in healthcare settings, sporicidal agents are often necessary.","translation":"一般的な清掃には、非殺胞子性のクリーナーで十分かもしれませんが、医療現場では、殺胞子性の薬剤が必要になることがよくあります。"}],"collocations":["non-sporicidal disinfectant","non-sporicidal cleaner","non-sporicidal activity"],"synonyms":["non-sterilizing","non-disinfecting (in some contexts)"],"antonyms":["sporicidal","sterilizing"],"related_terms":["bactericidal","virucidal","fungicidal","disinfectant","sterilant","spore"]}],"etymology":{"value":"Prefix 'non-' (not) + 'sporicidal' (capable of killing spores).","priority":"medium"},"pronunciation":{"ipa":"/ˌnɒn spɔːˈrɪsaɪdl/","syllables":"non-spo-ri-ci-dal"},"inflection":{},"usage_notes":{"explanation":"'Non-sporicidal' refers to agents or processes that do not kill bacterial or fungal spores. Spores are highly resistant forms of microorganisms, making them difficult to eradicate. Therefore, non-sporicidal methods are generally less effective for complete sterilization.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"This is a non-sporicidal spore.","correct":"This is a non-sporicidal disinfectant.","note":"'Non-sporicidal' describes the property of a substance (like a disinfectant), not the spore itself."}],"priority":"medium"},"level_frequency":{"frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'non-sporicidal' is a technical term used in fields like microbiology, healthcare, and sanitation. It describes substances or processes that do not kill spores, which are resistant forms of bacteria and fungi. Understanding this term is important in contexts where complete sterilization is necessary, as non-sporicidal methods may not be sufficient."},"example_sentences":[{"sentence":"The hospital uses a sporicidal cleaner in operating rooms and a non-sporicidal one in general patient areas.","translation":"病院では、手術室では殺胞子性のクリーナーを使用し、一般の患者エリアでは非殺胞子性のクリーナーを使用しています。","type":"example","meaning_category":"usage in healthcare"},{"sentence":"While alcohol-based hand sanitizers are effective against many bacteria and viruses, they are typically non-sporicidal.","translation":"アルコールベースの手指消毒剤は多くの細菌やウイルスに対して効果的ですが、通常は非殺胞子性です。","type":"example","meaning_category":"effectiveness of sanitizers"}]}