{"word":"Pseudophenocryst","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"仮晶、偽斑晶","english_definition":"A mineral or rock fragment that resembles a phenocryst (a large, early-formed crystal in a porphyritic igneous rock) but is not actually a phenocryst. It may be a xenocryst (a foreign crystal incorporated into the magma) or an aggregate of smaller crystals that appear as a single, larger crystal.","examples":[{"sentence":"The large crystals in this rock were initially identified as phenocrysts, but further analysis revealed them to be pseudophenocrysts.","translation":"この岩石中の大きな結晶は、当初は斑晶として識別されましたが、さらなる分析により、仮晶であることが明らかになりました。"},{"sentence":"The pseudophenocrysts in the lava flow are composed of fine-grained quartz and feldspar.","translation":"溶岩流中の偽斑晶は、細粒の石英と長石で構成されています。"}],"collocations":["identify as pseudophenocryst","composed of pseudophenocrysts","distinguish from phenocrysts"],"synonyms":["xenocryst","aggregate crystal"],"antonyms":["phenocryst"]}],"etymology":{"value":"The word \"pseudophenocryst\" is derived from the Greek words \"pseudo\" (meaning false or fake), \"pheno\" (short for phenos, meaning appearing or visible), and \"cryst\" (short for crystal). Thus, it literally means a 'false appearing crystal'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈfɛnəˌkrɪst/","syllables":"pseu-do-phe-no-cryst"},"inflection":{"noun_plural":"pseudophenocrysts"},"usage_notes":{"explanation":"Pseudophenocrysts are important in petrology because they can be mistaken for true phenocrysts, leading to incorrect interpretations of the origin and evolution of igneous rocks. Careful examination, often involving microscopy and chemical analysis, is needed to distinguish them.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock contained many phenocrysts, all of which were pseudophenocrysts.","correct":"✓ The rock contained many large crystals, all of which turned out to be pseudophenocrysts.","note":"Avoid using \"phenocrysts\" and \"pseudophenocrysts\" in the same phrase if the point is that they are *not* true phenocrysts."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudo- (prefix meaning false or fake)","phenocryst","porphyritic"],"related_terms":["xenolith","glomerocryst"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in geological and petrological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"pseudophenocryst\" is a technical term used in geology, specifically in the study of igneous rocks. It refers to a mineral or rock fragment that looks like a phenocryst (a large crystal in a porphyritic rock) but is not one. This distinction is important for understanding the rock's formation history. To understand this term, one should have a background in geology or mineralogy. It is not a term used in everyday language."},"example_sentences":[{"sentence":"Microscopic analysis revealed that the apparent phenocrysts were actually pseudophenocrysts composed of fine-grained plagioclase.","translation":"顕微鏡分析により、見かけ上の斑晶は、実際には細粒の斜長石で構成された仮晶であることが明らかになりました。","type":"noun","meaning_category":"geology"},{"sentence":"The presence of pseudophenocrysts in the volcanic rock suggested a complex history of magma mixing.","translation":"火山岩中の偽斑晶の存在は、マグマ混合の複雑な歴史を示唆していました。","type":"noun","meaning_category":"geology"}]}