{"word":"bleezy","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(Slang) High, intoxicated, or under the influence of drugs, especially marijuana.","english_definition":"(Slang) Intoxicated or under the influence of drugs, especially marijuana; high.","examples":[{"sentence":"He was feeling bleezy after smoking that joint.","translation":"彼はそのジョイントを吸った後、気分がハイになっていた。"},{"sentence":"They were all bleezy at the party.","translation":"彼らは皆、パーティーで酔っ払っていた。"}],"collocations":["get bleezy","feel bleezy"],"synonyms":["high","stoned","intoxicated","wasted","lit"],"antonyms":["sober","straight"]}],"etymology":{"value":"Likely a blend or alteration of 'blazed' (a slang term for being high) and possibly influenced by words like 'dizzy' or 'easy'. The exact origin is uncertain, but it's relatively recent slang.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbliːzi/","syllables":"blee-zy"},"inflection":{},"usage_notes":{"explanation":"'Bleezy' is a slang term, primarily used in informal contexts, to describe the state of being high or intoxicated, especially from marijuana. It's more common among younger speakers and in specific subcultures. Use with caution in formal settings.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["blazed","high","stoned","baked"]},"level_frequency":{"CEFR":"N/A (Slang)","frequency_google_ngram":"Low frequency (Slang)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Bleezy' is a slang term and not part of standard English vocabulary. Its meaning is context-dependent and primarily understood within specific subcultures or communities that use this slang. It's crucial to be aware of the audience and setting before using such terms.","note":"This word is slang and not appropriate for formal contexts."},"example_sentences":[{"sentence":"After a few hits, he started feeling bleezy.","translation":"数回吸った後、彼は気分がハイになり始めた。","type":"adjective","meaning_category":"Intoxicated"},{"sentence":"They spent the evening listening to music and getting bleezy.","translation":"彼らは音楽を聴きながら、ハイになって夜を過ごした。","type":"adjective","meaning_category":"Intoxicated"}]}