{"word":"Twice-Sacrificed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(ファンタジーまたは神話で)二度犠牲にされた、二重の犠牲を払った","english_definition":"(In fantasy or mythology) Having been sacrificed twice; having undergone a double sacrifice.","examples":[{"sentence":"The Twice-Sacrificed King was a figure of immense power and sorrow.","translation":"二度犠牲にされた王は、絶大な力と悲しみの象徴だった。"},{"sentence":"Legends spoke of the Twice-Sacrificed hero who returned to save his people.","translation":"伝説は、民を救うために帰還した二度犠牲にされた英雄について語っていた。"}],"collocations":["Twice-Sacrificed King","Twice-Sacrificed Hero","the fate of the Twice-Sacrificed"],"synonyms":["double-sacrificed","re-sacrificed"],"antonyms":["un-sacrificed","once-sacrificed"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'twice' (meaning two times) with 'sacrificed' (meaning having been offered as a sacrifice). The term is primarily used in fantasy or mythological contexts to denote a character or entity that has undergone the act of sacrifice on two separate occasions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtwaɪs ˈsækrɪfaɪst/","syllables":"twice-sac-ri-ficed"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. It can be used to modify nouns."},"usage_notes":{"explanation":"'Twice-Sacrificed' is a descriptive term typically found in fantasy literature, games, or mythology. It implies a significant level of suffering, importance, or unique status for the character or entity being described. The double sacrifice often suggests a deeper connection to divine or supernatural forces, or a heightened sense of tragedy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was twice sacrifice.","correct":"✓ He was twice sacrificed.","note":"The correct form is 'sacrificed,' which is the past participle used as an adjective."},{"incorrect":"✗ The twice sacrificed.","correct":"✓ The twice-sacrificed hero.","note":"'Twice-sacrificed' is an adjective and needs to be followed by a noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["sacrifice","sacrificial","twice"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specific to fantasy/mythology)","frequency_google_ngram":"Very Low (Specific to fantasy/mythology)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Twice-Sacrificed' is relatively complex and specific, primarily used within the context of fantasy or mythology. It requires an understanding of the concept of sacrifice and the ability to interpret the significance of a double sacrifice. Due to its niche usage, it is more likely to be encountered by advanced readers familiar with these genres."},"example_sentences":[{"sentence":"The Twice-Sacrificed Queen was remembered for her ultimate act of devotion.","translation":"二度犠牲にされた女王は、彼女の究極の献身行為によって記憶されていた。","type":"adjective","meaning_category":"fantasy/mythology"},{"sentence":"The prophecy foretold the coming of the Twice-Sacrificed one who would restore balance to the world.","translation":"予言は、世界のバランスを回復する二度犠牲にされた者の到来を予告した。","type":"adjective","meaning_category":"fantasy/mythology"}]}