{"word":"mundanization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"世俗化、平凡化、日常化","english_definition":"The process of making something ordinary or commonplace; the act of removing the extraordinary, spiritual, or sacred aspects from something.","examples":[{"sentence":"The mundanization of religious rituals has led to a decline in their perceived significance.","translation":"宗教儀式の世俗化は、その重要性の認識の低下につながった。"},{"sentence":"The mundanization of space travel has made it seem less like a dream and more like a routine activity.","translation":"宇宙旅行の日常化は、それを夢というよりも日常的な活動のように感じさせるようになった。"},{"sentence":"Some fear the mundanization of art, with mass production and commercialization overshadowing creativity.","translation":"大量生産と商業化が創造性を覆い隠し、芸術が平凡化することを恐れる人もいる。"}],"collocations":["process of mundanization","cultural mundanization","social mundanization"],"synonyms":["secularization","trivialization","commonplaceness","routinization","demystification","desacralization"],"antonyms":["sacralization","spiritualization","mystification","elevation","ennoblement"]}],"etymology":{"value":"Derived from 'mundane,' meaning 'worldly' or 'ordinary,' with the suffix '-ization' indicating a process or transformation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmʌndənaɪˈzeɪʃən/","syllables":"mun-dan-i-za-tion"},"inflection":{"noun_plural":"mundanizations"},"usage_notes":{"explanation":"'Mundanization' refers to the process by which something loses its special, sacred, or extraordinary qualities and becomes ordinary or commonplace. It is often used in sociological, religious, and cultural contexts to describe the shift from the sacred to the secular or the exceptional to the routine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mundanization of the event made it more exciting.","correct":"✓ The mundanization of the event made it less exciting.","note":"Mundanization typically reduces excitement or specialness, not increases it."},{"incorrect":"✗ He was mundanizing his life by taking on new challenges.","correct":"✓ He was mundanizing his life by sticking to routine tasks.","note":"Mundanization involves making things routine, not challenging."}],"priority":"★★☆"},"related_words":{"derivatives":["mundane (adjective)","mundanely (adverb)"],"phrasal_verbs":[],"related_concepts":["secularism","desacralization","rationalization","bureaucratization"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mundanization' describes the process of something becoming ordinary or commonplace, losing its special or sacred qualities. It's often used in discussions about culture, religion, or society when something that was once seen as extraordinary becomes routine or secular. The word implies a loss of uniqueness or significance."},"example_sentences":[{"sentence":"The **mundanization** of celebrity culture has made it difficult to distinguish genuine talent from manufactured fame.","translation":"有名人文化の世俗化により、真の才能と作られた名声を区別することが難しくなった。","type":"noun","meaning_category":"世俗化・日常化"},{"sentence":"Critics argue that the **mundanization** of education has led to a focus on standardized testing rather than critical thinking.","translation":"批評家たちは、教育の平凡化が批判的思考よりも標準化されたテストに焦点を当てることにつながったと主張している。","type":"noun","meaning_category":"世俗化・日常化"},{"sentence":"The **mundanization** of once-revolutionary ideas can occur as they become integrated into mainstream society.","translation":"かつて革命的だったアイデアの日常化は、それらが主流社会に統合されるにつれて起こりうる。","type":"noun","meaning_category":"世俗化・日常化"}]}