{"word":"entrainment","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(物理学)引き込み現象、巻き込み現象","english_definition":"The synchronization of two or more rhythmic processes.","examples":[{"sentence":"The entrainment of circadian rhythms to the light-dark cycle is essential for health.","translation":"概日リズムが明暗サイクルに引き込まれることは、健康にとって不可欠です。"},{"sentence":"Entrainment can be observed in various physical systems, such as coupled oscillators.","translation":"引き込み現象は、結合された振動子のような様々な物理システムで観察できます。"}],"collocations":["circadian entrainment","neural entrainment","oscillator entrainment"],"synonyms":["synchronization","coupling","locking"],"antonyms":["desynchronization"]},{"part_of_speech":"noun","definition":"(心理学)同調現象、共鳴現象","english_definition":"The process by which one person's behavior or physiology becomes synchronized with that of another person.","examples":[{"sentence":"Social entrainment plays a crucial role in building rapport and trust.","translation":"社会的同調は、親密さや信頼関係を築く上で重要な役割を果たします。"},{"sentence":"Musical entrainment can lead to a shared emotional experience among listeners.","translation":"音楽的同調は、聴衆の間で感情的な体験を共有することにつながる可能性があります。"}],"collocations":["social entrainment","physiological entrainment","musical entrainment"],"synonyms":["synchrony","attunement","resonance"],"antonyms":["dissociation","discordance"]},{"part_of_speech":"noun","definition":"(気象学)巻き込み (雲物理学における、周囲の乾燥空気の雲への取り込み)","english_definition":"The process by which ambient air is drawn into a cloud.","examples":[{"sentence":"Entrainment can significantly affect the development and dissipation of clouds.","translation":"巻き込みは、雲の発達と消散に大きな影響を与える可能性があります。"},{"sentence":"The rate of entrainment is an important parameter in cloud models.","translation":"巻き込み率は、雲モデルにおける重要なパラメータです。"}],"collocations":["cloud entrainment","turbulent entrainment"],"synonyms":["ingestion","incorporation"],"antonyms":["detrainment"]}],"etymology":{"value":"From French *entraîner*, meaning 'to pull along, draw in, train'. From *en-* (in) + *traîner* (to drag, pull), from Vulgar Latin *traginare*, from Latin *trahere* (to draw, pull).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈtreɪnmənt/","syllables":"en-train-ment"},"inflection":{"noun_plural":"entrainments"},"usage_notes":{"explanation":"The term \"entrainment\" refers to the synchronization or coordination of two or more independent processes. In physics, it describes the locking of frequencies between oscillators. In psychology, it refers to the synchronization of behaviors or physiological processes between individuals. In meteorology, it describes the mixing of ambient air into a cloud. The specific meaning depends on the context in which the term is used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The entrainment of the train was delayed.","correct":"✓ The train was delayed.","note":"'Entrainment' refers to a synchronization process, not to a train itself. Using it in place of 'train' is incorrect."},{"incorrect":"✗ He was entrained by the music.","correct":"✓ He was moved by the music. / ✓ He experienced entrainment with the music.","note":"While you can experience 'entrainment with' music (referring to the synchronization of your body or emotions with the music), saying someone is 'entrained by' music is not the standard way to express being moved or affected by it."}],"priority":"★★☆"},"related_words":{"derivatives":["entrain (verb)","entrained (adjective)"],"related_terms":["synchronization","coupling","resonance","attunement"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Entrainment' is a technical term used in various fields like physics, psychology, and meteorology. It generally refers to the process of two or more things becoming synchronized or coordinated. In physics, it might describe oscillators locking into the same frequency. In psychology, it can refer to people's behaviors or physiological processes becoming synchronized. In meteorology, it describes the mixing of air into clouds. Understanding the specific context is crucial to interpreting the meaning of 'entrainment' correctly."},"example_sentences":[{"sentence":"The **entrainment** of the heart rate to the rhythm of music can promote relaxation.","translation":"心拍数が音楽のリズムに同調することで、リラックス効果を促進することができます。","type":"noun","meaning_category":"同調現象 (心理学)"},{"sentence":"The **entrainment** of the jet stream can influence weather patterns over long distances.","translation":"ジェット気流の巻き込みは、長距離にわたって気象パターンに影響を与える可能性があります。","type":"noun","meaning_category":"巻き込み (気象学)"},{"sentence":"The **entrainment** between the two oscillators resulted in a stable, synchronized system.","translation":"2つの振動子間の引き込みにより、安定した同期システムが実現しました。","type":"noun","meaning_category":"引き込み現象 (物理学)"}]}