{"word":"All-Souls","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"万霊節","english_definition":"a day of prayer for the souls of the dead, observed by some Christians on November 2","examples":[{"sentence":"All-Souls' Day is observed on November 2nd.","translation":"万霊節は11月2日に祝われます。"},{"sentence":"Many people visit cemeteries on All-Souls' Day.","translation":"多くの人々が万霊節に墓地を訪れます。"}],"collocations":["All-Souls' Day mass","All-Souls' Day service"],"synonyms":["Day of the Dead"],"antonyms":[]}],"etymology":{"value":"\"All Souls\" refers to all the souls of the faithful departed. The day is dedicated to remembering and praying for those who have died.","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːl soʊlz/","syllables":"All-Souls"},"inflection":{"noun_plural":"N/A"},"usage_notes":{"explanation":"All-Souls' Day is a Christian holiday, particularly observed in the Catholic tradition, for remembering and praying for the dead. It follows All Saints' Day (November 1). It is a day for reflection and remembrance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ All Soul's Day","correct":"✓ All Souls' Day","note":"The correct spelling is \"All Souls' Day\" (plural)."},{"incorrect":"✗ I'm going to All-Soul.","correct":"✓ I'm going to All-Souls' Day service.","note":"It's more common to refer to the All-Souls' Day service or activities rather than just \"All-Soul\"."}],"priority":"★★☆"},"related_words":{"derivatives":["All Saints' Day"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"\"All-Souls' Day\" is a religious holiday observed primarily by Christians, especially Catholics, to commemorate and pray for the souls of the dead. It's a day of remembrance and reflection, often involving visits to cemeteries and special church services. The term itself implies a focus on all souls, rather than a specific individual or event. Understanding the cultural and religious context is essential for interpreting its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The church held a special mass for All-Souls' Day.","translation":"教会は万霊節の特別なミサを開催しました。","type":"noun","meaning_category":"万霊節"},{"sentence":"On All-Souls' Day, families often light candles at the graves of their loved ones.","translation":"万霊節には、家族はしばしば愛する人の墓にろうそくを灯します。","type":"noun","meaning_category":"万霊節"}]}