{"word":"water-stable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"水に対して安定な、水中で安定な","english_definition":"Resistant to degradation or decomposition in the presence of water; able to maintain its structure or properties when exposed to water.","examples":[{"sentence":"This new material is highly water-stable, making it ideal for marine applications.","translation":"この新しい材料は非常に水に対して安定であり、海洋用途に最適です。"},{"sentence":"The water-stable coating prevents the metal from rusting.","translation":"その水中で安定なコーティングは金属が錆びるのを防ぎます。"},{"sentence":"We need to develop water-stable catalysts for this reaction.","translation":"この反応のために、水に対して安定な触媒を開発する必要があります。"}],"collocations":["highly water-stable","chemically water-stable","thermally water-stable"],"synonyms":["hydrolytically stable","water-resistant","moisture-resistant"],"antonyms":["water-unstable","hydrolytically unstable"],"related_terms":["hydrolysis","stability","degradation","decomposition"]}],"etymology":{"value":"The term is formed by combining \"water\" (referring to the liquid H₂O) and \"stable\" (meaning resistant to change or deterioration).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈwɔːtərˌsteɪbəl/","syllables":"wa-ter-sta-ble"},"inflection":{"notes":"Adjective, no specific inflectional forms."},"usage_notes":{"explanation":"The term 'water-stable' is primarily used in scientific and technical contexts, particularly in chemistry, materials science, and engineering. It describes substances or materials that do not readily react with water or break down in aqueous environments. The degree of water stability can vary, and it is often quantified by measuring the rate of hydrolysis or degradation in water under specific conditions.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The compound is water stable.","correct":"✓ The compound is water-stable.","note":"The hyphen is important to indicate that 'water' and 'stable' are acting as a single compound adjective modifying the noun."}],"priority":"☆☆☆"},"related_words":{"derivatives":["water stability (noun)"],"related_scientific_terms":["hydrolytic stability","chemical stability","thermal stability"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'water-stable' is a technical term used in scientific and engineering fields. It describes materials or substances that do not easily degrade or decompose when exposed to water. Understanding this term requires knowledge of basic chemistry and materials science concepts."},"example_sentences":[{"sentence":"The newly synthesized polymer is remarkably water-stable, even at high temperatures.","translation":"新しく合成されたポリマーは、高温でも驚くほど水に対して安定である。","type":"general","meaning_category":"general"},{"sentence":"The water-stable metal-organic framework (MOF) shows promise for use in water purification.","translation":"その水に対して安定な金属有機構造体（MOF）は、水質浄化への利用が期待される。","type":"scientific","meaning_category":"scientific"}]}