{"word":"undertrading","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(経済)過少取引、不十分な取引","english_definition":"The act of trading less than is optimal or expected.","examples":[{"sentence":"The company's undertrading led to significant financial losses.","translation":"その会社の過少取引は、重大な財政的損失につながった。"},{"sentence":"The market analyst pointed to undertrading as a sign of investor uncertainty.","translation":"市場アナリストは、投資家の不確実性の兆候として過少取引を指摘した。"}],"collocations":["market undertrading","company undertrading","cause of undertrading","effect of undertrading"],"synonyms":["underinvestment","underutilization"],"antonyms":["overtrading","overinvestment"]},{"part_of_speech":"verb","definition":"(動詞の現在分詞形)過少取引する","english_definition":"Present participle of undertrade: to trade less than is optimal or expected.","examples":[{"sentence":"The firm is undertrading its assets, leading to lower returns.","translation":"その会社は資産を過少取引しており、収益の低下につながっている。"},{"sentence":"They were accused of undertrading to manipulate the market.","translation":"彼らは市場を操作するために過少取引を行っていると非難された。"}],"collocations":["undertrading assets","undertrading shares","undertrading securities"],"synonyms":["underinvesting","underutilizing"],"antonyms":["overtrading","overinvesting"]}],"etymology":{"value":"Formed by combining the prefix 'under-' (meaning 'less than' or 'below') with the noun 'trading' or the verb 'to trade'.","priority":"★★☆"},"pronunciation":{"ipa":"ˌʌndərˈtreɪdɪŋ","syllables":"un-der-tra-ding"},"inflection":{"verb_forms":{"present_participle":"undertrading"},"noun_plural":"undertradings"},"usage_notes":{"explanation":"'Undertrading' refers to a situation where an individual, company, or market is not engaging in as much trading activity as would be beneficial or expected. This can be due to various factors, such as lack of information, risk aversion, or market manipulation. It often implies a missed opportunity for profit or growth.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The undertrading of the company was a success.","correct":"✓ The company's avoidance of risk led to undertrading, which was not a success.","note":"Undertrading is generally seen as a negative outcome, not a success. It implies a failure to maximize potential gains."},{"incorrect":"✗ He is undertrading because he is overconfident.","correct":"✓ He is undertrading because he is risk-averse.","note":"Undertrading is more likely to be caused by risk aversion or lack of information, rather than overconfidence."}],"priority":"★★☆"},"related_words":{"derivatives":["undertrade (verb)","undertrader (noun)"],"phrases":["underperforming","undervalued"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Undertrading' is a specialized term primarily used in economics and finance. It describes the state of trading less than is considered optimal or expected, often leading to missed opportunities or financial losses. Understanding this term requires familiarity with basic economic principles and market dynamics. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The fund manager was criticized for undertrading during the market rally.","translation":"そのファンドマネージャーは、市場の急騰中に過少取引を行ったとして批判された。","type":"noun","meaning_category":"過少取引"},{"sentence":"The company's stock price suffered due to its undertrading of available assets.","translation":"その会社の株価は、利用可能な資産の過少取引により低迷した。","type":"noun","meaning_category":"過少取引"},{"sentence":"The analyst suggested that the company was undertrading, failing to capitalize on market opportunities.","translation":"アナリストは、その会社が過少取引を行っており、市場機会を活かせていないと示唆した。","type":"verb (present participle)","meaning_category":"過少取引する"}]}