{"word":"barricaded-looking","meanings":[{"part_of_speech":"adjective","definition":"バリケードで防御されたように見える、要塞化されたように見える","english_definition":"appearing as if protected or fortified with barricades; resembling a barricade.","examples":[{"sentence":"The house had a barricaded-looking entrance, with boarded-up windows and a heavy gate.","translation":"その家は、板でふさがれた窓と重い門があり、まるでバリケードで防御されたような外観の入り口だった。"},{"sentence":"The shop's front was barricaded-looking after the riots, with metal shutters covering the windows.","translation":"暴動の後、その店の正面は窓を覆う金属製のシャッターが設置され、まるで要塞化されたような外観になっていた。"}],"collocations":["barricaded-looking building","barricaded-looking entrance","barricaded-looking windows"],"synonyms":["fortified-looking","defended-looking","protected-looking","walled-off","blockaded"],"antonyms":["open-looking","unprotected","undefended","exposed"],"related_words":["barricade (noun/verb)","barricaded (adjective)"],"usage_notes":{"explanation":"This adjective describes something that appears to be heavily defended or blocked off, often suggesting a sense of danger or insecurity. It implies the presence of barriers or fortifications, real or perceived.","priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Relatively uncommon, but understandable in context.","priority":"★☆☆"}}],"etymology":{"value":"Derived from the word 'barricade,' meaning a defensive barrier, and the suffix '-looking,' indicating appearance.","priority":"★☆☆"},"pronunciation":{"notes":"Pronunciation would follow the pattern of 'barricaded' + 'looking.'"},"inflection":{"notes":"This is an adjective and does not inflect."},"common_mistakes":{},"readability_explanation":{"level":"C1","text":"This word is relatively uncommon and would likely be understood by advanced English speakers. The meaning is fairly transparent based on its component parts ('barricaded' and 'looking')."},"example_sentences":[{"sentence":"The embassy had a distinctly barricaded-looking perimeter, with concrete barriers and armed guards.","translation":"その大使館は、コンクリートの障壁と武装警備員が配置され、明らかにバリケードで防御されたような外観の境界線を持っていた。","type":"general"},{"sentence":"The protestors created a barricaded-looking street by piling up trash and debris.","translation":"抗議者たちは、ゴミや瓦礫を積み上げて、バリケードで防御されたような通りを作り出した。","type":"general"}]}