{"word":"violability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"侵害されやすさ、侵されやすさ、犯されやすさ","english_definition":"The state of being violable; susceptibility to being violated, infringed, or desecrated.","examples":[{"sentence":"The violability of personal data in the digital age is a growing concern.","translation":"デジタル時代における個人データの侵害されやすさは、ますます懸念事項となっている。"},{"sentence":"The violability of the treaty was evident as soon as one of the signatories began to disregard its terms.","translation":"署名国の一つが条項を無視し始めるとすぐに、その条約の侵されやすさが明らかになった。"},{"sentence":"The violability of their borders made them vulnerable to attack.","translation":"彼らの国境の侵されやすさは、彼らを攻撃に対して脆弱にした。"}],"collocations":["high violability","low violability","potential violability","inherent violability"],"synonyms":["vulnerability","susceptibility","fragility","defenselessness","openness","permeability"],"antonyms":["inviolability","security","protection","invulnerability","impregnability"]}],"etymology":{"value":"Derived from 'violable,' which comes from the Latin 'violare' meaning 'to treat with violence, injure, outrage, desecrate.' The suffix '-ability' denotes the capacity or state of being able to be violated.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌvaɪəˈləbɪləti/","syllables":"vi-o-la-bil-i-ty"},"inflection":{"noun_plural":"violabilities"},"usage_notes":{"explanation":"'Violability' refers specifically to the potential or actual state of something being open to violation, whether it's a physical boundary, a law, a principle, or personal data. It emphasizes the lack of protection or the presence of weaknesses that make something susceptible to being breached or infringed upon. It is often used in discussions of security, ethics, and law.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The violability of the fortress was surprising.","correct":"✓ The vulnerability of the fortress was surprising.","note":"'Vulnerability' is a more common and often more appropriate term to describe the weakness of a physical structure like a fortress. 'Violability' is better suited for abstract concepts or rules."},{"incorrect":"✗ The violability was high due to the strong security measures.","correct":"✓ The violability was low despite the weak security measures.","note":"Violability is inversely related to security measures. Strong security implies low violability, and vice versa."}],"priority":"★☆☆"},"related_words":{"derivatives":["violable (adjective)","violate (verb)","violation (noun)","inviolability (noun)","inviolable (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Violability' is a relatively uncommon and abstract noun. It is most often encountered in academic, legal, or technical contexts when discussing the security or ethical implications of systems, data, or boundaries. It implies a state of being open to potential harm or infringement. Understanding this word requires a solid grasp of abstract concepts and a familiarity with formal language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The report highlighted the violability of the voting system to cyber attacks.","translation":"その報告書は、投票システムがサイバー攻撃に対して侵害されやすいことを強調した。","type":"noun","meaning_category":"susceptibility to attack"},{"sentence":"The violability of patient confidentiality is a major ethical concern in healthcare.","translation":"患者の機密性の侵害されやすさは、医療における主要な倫理的懸念事項である。","type":"noun","meaning_category":"susceptibility to breach of confidentiality"},{"sentence":"The violability of international law is a constant challenge for global governance.","translation":"国際法の侵害されやすさは、グローバル・ガバナンスにとって絶え間ない課題である。","type":"noun","meaning_category":"susceptibility to infringement"}]}