{"word":"Intransmissible","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"伝染しない、感染しない、伝達できない","english_definition":"Not capable of being transmitted or passed on, especially a disease or genetic trait.","examples":[{"sentence":"The common cold is highly transmissible, but this new variant is intransmissible.","translation":"普通の風邪は非常に伝染しやすいですが、この新しい変異株は伝染しません。"},{"sentence":"Scientists are working to develop intransmissible forms of the virus.","translation":"科学者たちは、ウイルスの伝染しない形態を開発するために取り組んでいます。"},{"sentence":"The disease is intransmissible through casual contact.","translation":"その病気は、通常の接触では伝染しません。"},{"sentence":"This genetic mutation is intransmissible to offspring.","translation":"この遺伝子変異は子孫に伝達されません。"}],"collocations":["intransmissible disease","intransmissible virus","intransmissible infection","intransmissible mutation","intransmissible form"],"synonyms":["non-contagious","non-infectious","untransmittable","non-communicable"],"antonyms":["transmissible","contagious","infectious","communicable"]}],"etymology":{"value":"Formed from the prefix 'in-' (not) + 'transmissible' (capable of being transmitted).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntrænzˈmɪsɪbəl/","syllables":"in-trans-mis-si-ble"},"inflection":{"adjective_forms":{"comparative":"more intransmissible","superlative":"most intransmissible"}},"usage_notes":{"explanation":"'Intransmissible' is used to describe something that cannot be passed from one person or thing to another. It is often used in the context of diseases, genetic traits, or other conditions that can be transmitted. The word emphasizes the lack of ability to spread or be passed on.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The intransmissible disease spread rapidly.","correct":"✓ The transmissible disease spread rapidly.","note":"'Intransmissible' means it cannot spread, so it's contradictory to say it spread rapidly. Use 'transmissible' instead."},{"incorrect":"✗ The virus is intransmissible, so there is no need for precautions.","correct":"✓ The virus is thought to be intransmissible, but precautions are still recommended.","note":"Even if something is believed to be intransmissible, it's wise to take precautions until it's definitively proven."}],"priority":"★★☆"},"related_words":{"derivatives":["transmissible (adjective: capable of being transmitted)","transmission (noun: the act of transmitting)","transmit (verb: to pass on or spread)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'intransmissible' is a technical term often used in medical or scientific contexts. It means that something, such as a disease or genetic trait, cannot be passed from one person or thing to another. Understanding this word requires a good grasp of scientific vocabulary and the ability to understand complex concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The new strain of bacteria is reportedly intransmissible to humans.","translation":"その新しい細菌株は、人間には伝染しないと報告されています。","type":"general","meaning_category":"non-contagious"},{"sentence":"Researchers confirmed that the modified gene was intransmissible to future generations.","translation":"研究者たちは、改変された遺伝子が将来の世代に伝達されないことを確認しました。","type":"scientific","meaning_category":"non-hereditary"},{"sentence":"Despite the initial concerns, the illness proved to be intransmissible through normal social interactions.","translation":"当初の懸念にもかかわらず、その病気は通常の社会的な交流を通じては伝染しないことが判明しました。","type":"medical","meaning_category":"non-infectious"}]}