{"word":"dermoplasty","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"皮膚移植（術）","english_definition":"Surgical repair of the skin, involving grafting of skin from one part of the body to another, or from another person.","examples":[{"sentence":"Dermoplasty is often used to treat severe burns.","translation":"皮膚移植は重度の火傷の治療によく用いられます。"},{"sentence":"The patient underwent dermoplasty to repair the damaged tissue.","translation":"患者は損傷した組織を修復するために皮膚移植を受けました。"}],"collocations":["undergo dermoplasty (皮膚移植を受ける)","perform dermoplasty (皮膚移植を行う)","dermoplasty procedure (皮膚移植手術)","dermoplasty graft (皮膚移植片)"],"synonyms":["skin graft","skin grafting","cutaneous graft","integumentoplasty"],"antonyms":[]}],"etymology":{"value":"'Dermo-' comes from the Greek 'derma' meaning skin. '-plasty' comes from the Greek 'plassein' meaning to mold or shape surgically.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɜːrmoʊˌplæsti/","syllables":"der-mo-plas-ty"},"inflection":{"noun_plural":"dermoplasties"},"usage_notes":{"explanation":"Dermoplasty is a surgical procedure involving the transplantation of skin. It is often used in cases of burns, injuries, or other conditions where skin has been damaged or lost. The procedure aims to restore the skin's function and appearance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a dermoplasty on his heart.","correct":"✓ He had a dermoplasty on his leg.","note":"Dermoplasty is specifically for skin repair, not for internal organs like the heart."},{"incorrect":"✗ Dermoplasty is a treatment for cancer.","correct":"✓ Dermoplasty can be used to repair skin damaged by cancer treatment.","note":"Dermoplasty is not a primary treatment for cancer itself, but it can be used to repair skin damaged by cancer treatments like radiation or surgery."}],"priority":"★★☆"},"related_words":{"derivatives":["dermoplastic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dermoplasty' is a specialized medical term referring to skin grafting. It's primarily used in medical contexts and may not be widely understood by the general public. Understanding this term requires a background in medical terminology or a specific interest in surgical procedures.","priority":"★★☆"},"example_sentences":[{"sentence":"The burn victim required extensive dermoplasty to cover the damaged areas.","translation":"その火傷の被害者は、損傷した部位を覆うために広範囲の皮膚移植を必要としました。","type":"general","meaning_category":"skin grafting"},{"sentence":"Dermoplasty can improve the appearance and function of scarred tissue.","translation":"皮膚移植は、瘢痕組織の外観と機能を改善することができます。","type":"general","meaning_category":"skin grafting"}]}