{"word":"subterritory","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"下位領域、下位区分、小区分","english_definition":"A subdivision of a territory; a smaller area within a larger territory.","examples":[{"sentence":"The country was divided into territories, and each territory was further divided into subterritories.","translation":"その国はいくつかの領域に分割され、各領域はさらに下位領域に分割された。"},{"sentence":"Each sales representative was responsible for a specific subterritory within the region.","translation":"各営業担当者は、その地域内の特定の小区分を担当していた。"}],"collocations":["sales subterritory (販売小区分)","administrative subterritory (行政小区分)","regional subterritory (地域小区分)"],"synonyms":["subdivision","district","sector","zone","area","region"],"antonyms":["territory","region"],"notes":"Often used in business, politics, and geography to describe smaller areas within larger administrative or geographical divisions."}],"etymology":{"value":"Formed by combining the prefix 'sub-' (meaning 'under' or 'below') with the noun 'territory'.","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˈtɛrɪtɔːri/","syllables":"sub-ter-ri-to-ry"},"inflection":{"noun_plural":"subterritories"},"usage_notes":{"explanation":"The term 'subterritory' is used to denote a geographical or administrative area that is a part of a larger territory. It implies a hierarchical structure where the subterritory is subordinate to the main territory. The specific meaning can vary depending on the context in which it is used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subterritory is bigger than the territory.","correct":"✓ The territory is bigger than the subterritory.","note":"A subterritory is always smaller than the territory it is a part of."}],"priority":"★☆☆"},"related_words":{"derivatives":["territory","territorial","subregion","subarea"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Subterritory' is a relatively uncommon word used to describe a smaller area within a larger territory. It's often used in formal contexts like business, politics, or geography. Understanding the prefix 'sub-' is helpful to grasp the meaning of the word."},"example_sentences":[{"sentence":"The company divided its market into several territories, each with multiple subterritories.","translation":"会社は市場をいくつかの領域に分割し、各領域に複数の下位領域を設けた。","type":"general","meaning_category":"下位領域"},{"sentence":"Our team is responsible for the northern subterritory of the region.","translation":"私たちのチームは、その地域の北部の小区分を担当している。","type":"business","meaning_category":"販売小区分"},{"sentence":"The political party focused its campaign efforts on key subterritories within the state.","translation":"その政党は、州内の主要な小区分に選挙活動の焦点を当てた。","type":"politics","meaning_category":"行政小区分"}]}