{"word":"nonlarcenous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"窃盗的でない、盗みに関係しない","english_definition":"Not involving or characterized by larceny (theft).","examples":[{"sentence":"The transaction was deemed nonlarcenous because the individual had permission to use the property.","translation":"その取引は、個人がその財産を使用する許可を得ていたため、窃盗的ではないと見なされました。"},{"sentence":"A nonlarcenous act is one that does not involve the unlawful taking of someone else's property.","translation":"非窃盗的な行為とは、他人の財産を不法に奪うことを伴わない行為です。"}],"collocations":["nonlarcenous behavior","nonlarcenous activity","nonlarcenous transaction"],"synonyms":["honest","lawful","legal","non-thieving"],"antonyms":["larcenous","thieving","dishonest","unlawful","illegal"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to 'larcenous'. 'Larcenous' itself comes from 'larceny', which is derived from the Old French 'larrecin' meaning 'theft'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈlɑːrsənəs/","syllables":"non-lar-ce-nous"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs (e.g., 'very nonlarcenous') and can appear in comparative and superlative forms, though these are rare (more nonlarcenous, most nonlarcenous)."},"usage_notes":{"explanation":"'Nonlarcenous' is a relatively uncommon word, primarily used in legal or formal contexts. It is used to describe actions, behaviors, or situations that do not involve theft or larceny. The term is often used to clarify that an action, while potentially questionable, does not meet the specific legal definition of larceny.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was arrested for a nonlarcenous crime.","correct":"✓ He was arrested for a crime that was nonlarcenous. / ✓ He was arrested for a crime that was not larceny.","note":"It's more common to say that the crime 'was not larceny' or to specify the actual crime if it's nonlarcenous. Using 'nonlarcenous crime' is less direct."}],"priority":"★☆☆"},"related_words":{"derivatives":["larceny (noun: theft of personal property)","larcenous (adjective: relating to or involving larceny)"],"antonyms":["criminal","dishonest","illegal","unethical"],"related_legal_terms":["embezzlement","fraud","conversion","misappropriation"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Primarily used in legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nonlarcenous' is a technical term primarily used in legal contexts to describe something that does not involve theft or larceny. It is formed by adding the prefix 'non-' to 'larcenous', which means 'relating to theft'. This term is used to differentiate actions that might be questionable or unlawful but do not specifically involve the unlawful taking of someone else's property. Due to its specific and technical usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The auditor determined that the accounting error was unintentional and therefore nonlarcenous.","translation":"監査人は、会計上の誤りは意図的ではなく、したがって窃盗的ではないと判断しました。","type":"adjective","meaning_category":"Not involving theft"},{"sentence":"Even though the employee misused company resources, the act was deemed nonlarcenous because there was no intent to permanently deprive the company of its assets.","translation":"従業員が会社のリソースを不正に使用したとしても、会社から資産を永久に奪う意図がなかったため、その行為は非窃盗的であると見なされました。","type":"adjective","meaning_category":"Not involving theft"}]}