{"word":"epilation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"脱毛（毛根からの除去）","english_definition":"The removal of hair by pulling it out from the roots.","examples":[{"sentence":"She opted for epilation to remove unwanted facial hair.","translation":"彼女は不要な顔の毛を脱毛することにした。"},{"sentence":"Epilation can provide longer-lasting results compared to shaving.","translation":"脱毛は、シェービングに比べて長持ちする結果をもたらすことがある。"},{"sentence":"The salon offers various methods of epilation, including waxing and threading.","translation":"そのサロンでは、ワックス脱毛や糸脱毛など、さまざまな脱毛方法を提供している。"}],"collocations":["wax epilation (ワックス脱毛)","laser epilation (レーザー脱毛)","threading epilation (糸脱毛)","electric epilation (電気脱毛)"],"synonyms":["hair removal","depilation","waxing","threading","sugaring"],"antonyms":["shaving","trimming"]},{"part_of_speech":"noun","definition":"脱毛（医学的な意味合い）","english_definition":"The process or an instance of removing hair, especially in a medical or cosmetic context.","examples":[{"sentence":"Epilation is sometimes used to treat certain skin conditions.","translation":"脱毛は、特定の皮膚疾患の治療に使用されることがある。"},{"sentence":"The dermatologist recommended epilation for the patient's hirsutism.","translation":"皮膚科医は、患者の多毛症に対して脱毛を勧めた。"}],"collocations":["medical epilation (医療脱毛)","cosmetic epilation (美容脱毛)"],"synonyms":["hair removal","depilation"],"antonyms":["hair growth"]}],"etymology":{"value":"Derived from the French word 'épilation', which comes from the Latin 'epilare' meaning 'to pluck out hair'. 'E-' means 'out' and 'pilus' means 'hair'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛpɪˈleɪʃən/","syllables":"e-pi-la-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Epilation' refers specifically to hair removal that extracts the entire hair, including the root, unlike 'depilation' which removes hair at the skin's surface (e.g., shaving). Epilation methods include waxing, threading, sugaring, electrolysis, and laser hair removal. The term is often used in the context of cosmetic procedures or medical treatments for conditions like hirsutism (excessive hair growth).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"She used depilation to remove hair from the root.","correct":"She used epilation to remove hair from the root.","note":"'Epilation' specifically refers to hair removal from the root, while 'depilation' refers to surface hair removal."},{"incorrect":"Epilation is the same as shaving.","correct":"Epilation is different from shaving because it removes the hair from the root.","note":"Shaving is a form of depilation, not epilation, as it only removes the hair at the surface."}],"priority":"★★☆"},"related_words":{"derivatives":["epilate (verb: to remove hair by the root)","epilator (noun: a device used for epilation)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Epilation' is a more technical term for hair removal that involves removing the entire hair from the root. It's often used in professional or medical contexts when discussing different hair removal methods. It's important to distinguish it from 'depilation,' which refers to methods that only remove hair at the surface of the skin, like shaving. Understanding the difference is key to using the term correctly."},"example_sentences":[{"sentence":"Laser **epilation** is a popular method for long-term hair reduction.","translation":"レーザー脱毛は、長期的な減毛のための一般的な方法です。","type":"noun","meaning_category":"脱毛（毛根からの除去）"},{"sentence":"The effectiveness of **epilation** can vary depending on the individual's hair type and skin sensitivity.","translation":"脱毛の有効性は、個人の毛質や肌の敏感さによって異なる場合があります。","type":"noun","meaning_category":"脱毛（毛根からの除去）"},{"sentence":"She decided to try **epilation** instead of shaving to avoid ingrown hairs.","translation":"彼女は埋没毛を避けるために、シェービングの代わりに脱毛を試すことにした。","type":"noun","meaning_category":"脱毛（毛根からの除去）"}]}