{"word":"fanal","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(航海用語)船尾灯、灯台","english_definition":"A ship's stern light; a lighthouse.","examples":[{"sentence":"The fanal guided the ship safely into the harbor.","translation":"船尾灯が船を安全に港へと導いた。"},{"sentence":"The sailors relied on the fanal to navigate through the dark night.","translation":"船乗りたちは暗い夜を航海するために船尾灯を頼りにした。"}],"collocations":["stern fanal","harbor fanal"],"synonyms":["stern light","lighthouse","beacon"],"antonyms":[]}],"etymology":{"value":"From Spanish 'farol' or Italian 'fanale', both derived from the Greek 'phanos' meaning 'torch' or 'lamp'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfænəl/","syllables":"fa-nal"},"inflection":{"noun_plural":"fanals"},"usage_notes":{"explanation":"'Fanal' is a somewhat archaic or technical term, primarily used in nautical contexts. It refers specifically to a light used for signaling or guidance, especially on ships or at harbors. While 'lighthouse' and 'beacon' are more common terms for coastal lights, 'fanal' emphasizes the light's function as a navigational aid.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fanal was used to cook food on the ship.","correct":"✓ The fanal guided the ship safely.","note":"'Fanal' refers to a light, not a cooking device."},{"incorrect":"✗ The fanal shined brightly on the mountain.","correct":"✓ The lighthouse shined brightly on the mountain.","note":"'Lighthouse' is more common for a light on land."}],"priority":"★★☆"},"related_words":{"derivatives":["fanariote (related to Phanar district of Istanbul, historically important for Greek Orthodox Church)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Fanal' is a relatively rare word, primarily encountered in historical or nautical literature. It specifically denotes a light used for navigation, such as a stern light on a ship or a harbor light. Understanding its meaning requires familiarity with maritime terminology and historical contexts. It is not part of everyday vocabulary.","note":"This word is not commonly used in modern English."},"example_sentences":[{"sentence":"The captain adjusted the fanal to improve visibility.","translation":"船長は視界を改善するために船尾灯を調整した。","type":"noun","meaning_category":"ship's stern light"},{"sentence":"The ancient port was known for its impressive fanal.","translation":"その古代の港は印象的な灯台で知られていた。","type":"noun","meaning_category":"lighthouse"}]}