{"word":"prolactinemic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having abnormally high levels of prolactin in the blood.","english_definition":"Relating to or characterized by hyperprolactinemia, a condition of having abnormally high levels of prolactin in the blood.","examples":[{"sentence":"The patient was diagnosed as prolactinemic after blood tests revealed elevated prolactin levels.","translation":"血液検査でプロラクチン値の上昇が認められた後、患者はプロラクチン血症と診断された。"}],"collocations":["prolactinemic state","prolactinemic patient","prolactinemic condition"],"synonyms":["hyperprolactinemic"],"antonyms":["hypoprolactinemic (having abnormally low levels of prolactin)"]}],"etymology":{"value":"Derived from 'prolactin' (a hormone) + '-emic' (relating to the blood).","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˌlæk.tɪˈniː.mɪk/","syllables":"pro-lac-ti-ne-mic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Prolactinemic' is a medical term specifically used to describe a condition or state related to elevated levels of prolactin in the blood. It is often used in the context of diagnosing and discussing hyperprolactinemia.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said I was prolactin.","correct":"✓ The doctor said I was prolactinemic.","note":"'Prolactin' is the hormone, while 'prolactinemic' is the adjective describing the condition of having high levels of the hormone."}],"priority":"★★☆"},"related_words":{"derivatives":["prolactin (noun): A hormone that promotes milk production.","hyperprolactinemia (noun): The condition of having abnormally high levels of prolactin in the blood."],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Prolactinemic' is a specialized medical term used to describe a condition characterized by elevated levels of prolactin in the blood. Understanding this term requires familiarity with medical terminology and endocrinology. It is primarily used in clinical settings and scientific literature related to hormone imbalances."},"example_sentences":[{"sentence":"The prolactinemic woman experienced irregular menstrual cycles.","translation":"プロラクチン血症の女性は、不規則な月経周期を経験した。","type":"adjective","meaning_category":"Medical Condition"},{"sentence":"Treatment options for prolactinemic patients include medication and, in some cases, surgery.","translation":"プロラクチン血症患者の治療選択肢には、薬物療法と、場合によっては手術が含まれる。","type":"adjective","meaning_category":"Medical Condition"}]}