{"word":"counterassociation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(心理学) 反対連想、対抗連想：ある刺激が特定の反応や連想を引き起こすのを抑制または弱めるような連想。","english_definition":"(psychology) An association that inhibits or weakens a particular response or association to a stimulus.","examples":[{"sentence":"The therapist used counterassociation techniques to help the patient overcome their fear of dogs.","translation":"セラピストは、患者が犬への恐怖を克服するのを助けるために、反対連想のテクニックを使用した。"},{"sentence":"Counterassociation can be a useful tool in breaking negative thought patterns.","translation":"反対連想は、否定的な思考パターンを打ち破るための有用なツールとなり得る。"}],"collocations":["form a counterassociation (反対連想を形成する)","develop a counterassociation (反対連想を発達させる)","use counterassociation techniques (反対連想のテクニックを使用する)"],"synonyms":["inhibitory association","negative association"],"antonyms":["association","positive association"]}],"etymology":{"value":"'counter-' (反対) + 'association' (連想)","priority":"★★★"},"pronunciation":{"ipa":"/ˌkaʊntərəsosiˈeɪʃən/","syllables":"coun-ter-as-so-ci-a-tion"},"inflection":{"noun_plural":"counterassociations"},"usage_notes":{"explanation":"'Counterassociation' is a term primarily used in psychology, particularly in the context of learning and behavior modification. It refers to the process of creating a new association that opposes or weakens an existing one. This can be used to reduce unwanted behaviors or thoughts by associating them with something negative or incompatible.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The counterassociation was very associate.","correct":"✓ The counterassociation was very strong.","note":"'Associate' is a verb or adjective, not appropriate to describe the strength of a counterassociation. Use 'strong' or 'weak' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["counterassociate (verb)"],"related_terms":["association","conditioning","behavior modification","cognitive therapy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Counterassociation' is a specialized term used in psychology. It describes a mental process where a new connection is formed in the brain to weaken or oppose an existing connection. This is often used in therapy to help people change unwanted behaviors or thoughts by creating new, opposing associations. The concept is complex and requires an understanding of basic psychological principles.","priority":"★★☆"},"example_sentences":[{"sentence":"Through repeated pairings of the unwanted behavior with an unpleasant stimulus, a strong counterassociation was formed.","translation":"望ましくない行動と不快な刺激を繰り返し組み合わせることで、強力な反対連想が形成された。","type":"general","meaning_category":"psychology"},{"sentence":"The goal of the therapy was to establish a counterassociation between the patient's anxiety and the feared object.","translation":"セラピーの目標は、患者の不安と恐れている対象との間に反対連想を確立することであった。","type":"therapy","meaning_category":"psychology"}]}