{"word":"orthodoxize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"正統化する、正統的なものにする","english_definition":"To make orthodox; to bring into conformity with orthodox beliefs or practices.","examples":[{"sentence":"The reformers sought to orthodoxize religious practices.","translation":"改革者たちは宗教的慣習を正統化しようと努めた。"},{"sentence":"The party leadership attempted to orthodoxize political thought.","translation":"党の指導部は政治思想を正統化しようと試みた。"}],"collocations":["orthodoxize beliefs","orthodoxize practices","orthodoxize thought"],"synonyms":["standardize","conform","regulate","canonize"],"antonyms":["heterodoxize","deviate","secularize"]},{"part_of_speech":"verb","transitivity":"vi","definition":"正統的なものになる、正統的な見解に従う","english_definition":"To become orthodox; to conform to orthodox beliefs or practices.","examples":[{"sentence":"Over time, the movement began to orthodoxize.","translation":"時が経つにつれて、その運動は正統化し始めた。"},{"sentence":"The community orthodoxized its views on marriage.","translation":"そのコミュニティは結婚に関する見解を正統化した。"}],"collocations":["orthodoxize over time","orthodoxize views","orthodoxize practices"],"synonyms":["conform","adhere","comply"],"antonyms":["deviate","diverge"]}],"etymology":{"value":"From 'orthodox' (meaning conforming to established doctrine especially in religion) + '-ize' (a suffix used to form verbs indicating to make or become).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɔːrθədɒksaɪz/","syllables":"or-tho-dox-ize"},"inflection":{"verb_forms":{"present_simple":["orthodoxize","orthodoxizes"],"past_simple":"orthodoxized","past_participle":"orthodoxized","present_participle":"orthodoxizing"}},"usage_notes":{"explanation":"'Orthodoxize' implies a process of making something conform to a set of established beliefs or practices, often within a religious, political, or ideological context. It suggests a deliberate effort to standardize or regulate something according to a specific doctrine or tradition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The new law orthodoxized the society.","correct":"✓ The new law helped orthodoxize the society's practices.","note":"'Orthodoxize' typically refers to specific beliefs or practices rather than an entire society. It's more accurate to say the law helped to orthodoxize specific aspects of society. "},{"incorrect":"✗ He is orthodoxizing his opinion.","correct":"✓ He is trying to orthodoxize his opinion.","note":"The continuous tense suggests an ongoing effort or attempt to make something orthodox, rather than a completed state. Using 'trying to orthodoxize' clarifies the intention."}],"priority":"★★☆"},"related_words":{"derivatives":["orthodoxization (noun): The process of making something orthodox.","orthodox (adjective): Conforming to what is traditionally accepted as right or true; established and approved.","orthodoxy (noun): Authorized or generally accepted theory, doctrine, or practice."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Orthodoxize' is a relatively uncommon word that means to make something conform to orthodox or traditionally accepted beliefs and practices. It is often used in contexts discussing religion, politics, or ideology, where there is an effort to standardize or regulate beliefs and practices according to a specific doctrine. The word implies a deliberate process of bringing something into alignment with established norms or traditions."},"example_sentences":[{"sentence":"The church sought to orthodoxize the interpretation of scripture.","translation":"教会は聖書の解釈を正統化しようと努めた。","type":"verb","meaning_category":"正統化する"},{"sentence":"The political party orthodoxized its platform to appeal to a broader base.","translation":"その政党は、より幅広い層にアピールするために、政策綱領を正統化した。","type":"verb","meaning_category":"正統化する"},{"sentence":"Over time, the movement orthodoxized, becoming more rigid in its beliefs.","translation":"時が経つにつれて、その運動は正統化し、信念においてより硬直的になった。","type":"verb","meaning_category":"正統的なものになる"}]}