{"word":"Coigns","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(建築)化粧石、隅石：建物の角や開口部の縁に使われる、異素材または異なる仕上げの石やレンガ。","english_definition":"(architecture) A cornerstone or quoin; a projecting angle. Specifically, dressed stones at the corners of buildings, often contrasting in material or finish with the wall.","examples":[{"sentence":"The building featured prominent coigns made of white limestone.","translation":"その建物は白い石灰岩で作られた目立つ隅石が特徴だった。"},{"sentence":"The coigns added a decorative element to the otherwise plain facade.","translation":"隅石は、それ以外は簡素なファサードに装飾的な要素を加えた。"}],"collocations":["corner coigns","decorative coigns","stone coigns","brick coigns"],"synonyms":["cornerstone","quoin","arris","angle"],"antonyms":[]}],"etymology":{"value":"中英語の「coign, coigne」は、古フランス語の「coing, coin」（角、隅、刻印）に由来し、さらにラテン語の「cuneus」（くさび）に遡る。これは、隅石が建物の角を固定するためにくさびのような役割を果たすことに由来する。","priority":"★★★"},"pronunciation":{"ipa":"/kɔɪnz/","syllables":"coigns (1 syllable)"},"inflection":{"noun_plural":"Coigns"},"usage_notes":{"explanation":"「**Coigns**」は建築用語であり、日常会話ではあまり使われません。建物の角や開口部の縁に使われる化粧石や隅石を指します。これらの石は、構造的な役割を果たすだけでなく、装飾的な要素としても機能します。異なる素材や仕上げを使用することで、建物の外観にアクセントを加えることができます。単数形は「coign」です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The coigns were made of wood.","correct":"✓ The coigns were made of stone or brick.","note":"Coigns are typically made of stone or brick, not wood. Wood might be used for decorative trim, but not for structural coigns."},{"incorrect":"✗ The coigns are only for decoration and have no structural purpose.","correct":"✓ The coigns can be decorative, but they also provide structural support.","note":"While coigns can be decorative, they also often provide structural support to the corners of a building."}],"priority":"★★☆"},"related_words":{"derivatives":["quoin (単数形)"],"phrasal_verbs":[],"related_terms":["cornerstone","lintel","jamb","architrave"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な語彙)","frequency_google_ngram":"低頻度 (Low frequency) - 建築関連の専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Coigns**」は建築用語で、建物の角や窓、ドアなどの開口部の縁に使われる、特別な形に加工された石やレンガのことを指します。これらの石は、建物の構造を強化するだけでなく、装飾的な役割も果たします。建築やデザインに関する専門的な文章で使われることが多い単語です。日常会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The architect specified that the **coigns** should be made of a contrasting color to highlight the building's corners.","translation":"建築家は、建物の角を強調するために、隅石を対照的な色で作るように指定した。","type":"noun","meaning_category":"建築"},{"sentence":"The restoration project included repairing the damaged **coigns** on the historic building.","translation":"修復プロジェクトには、歴史的建造物の損傷した隅石の修理が含まれていた。","type":"noun","meaning_category":"建築"},{"sentence":"The **coigns** were carefully placed to ensure the structural integrity of the wall.","translation":"壁の構造的完全性を確保するために、隅石は慎重に配置された。","type":"noun","meaning_category":"建築"}]}