{"word":"Substratosphere","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(航空)亜成層圏：成層圏の下部領域で、対流圏界面より上かつオゾン層が顕著になるまでの高度範囲。","english_definition":"(Aviation) The lower region of the stratosphere, above the tropopause and below the region where the ozone layer becomes significant.","examples":[{"sentence":"Commercial airliners often fly in the substratosphere to avoid turbulence.","translation":"商業旅客機は、乱気流を避けるために亜成層圏を飛行することが多い。"},{"sentence":"The substratosphere is characterized by stable air and increasing temperature with altitude.","translation":"亜成層圏は、安定した空気と高度の上昇に伴う温度上昇を特徴とする。"}],"collocations":["fly in the substratosphere (亜成層圏を飛行する)","substratospheric flight (亜成層圏飛行)","lower substratosphere (下部亜成層圏)","upper substratosphere (上部亜成層圏)"],"synonyms":["lower stratosphere"],"antonyms":["troposphere","stratosphere"]}],"etymology":{"value":"The word is formed by combining \"sub-\" (meaning below or under) with \"stratosphere\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌsʌbˈstrætəˌsfɪər/","syllables":"sub-stra-to-sphere"},"inflection":{"noun_plural":"substratospheres"},"usage_notes":{"explanation":"The term \"substratosphere\" is not as commonly used as \"stratosphere\" itself. It is primarily used in aviation and atmospheric science contexts to refer to the lower portion of the stratosphere where commercial aircraft often fly to avoid turbulence associated with the troposphere.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The substratosphere is the same as the troposphere.","correct":"✓ The substratosphere is above the troposphere.","note":"The substratosphere is a layer above the troposphere, not the same as it."},{"incorrect":"✗ Substratosphere is where most weather occurs.","correct":"✓ Most weather occurs in the troposphere.","note":"Most weather phenomena occur in the troposphere, not the substratosphere."}],"priority":"★★☆"},"related_words":{"derivatives":["stratosphere","troposphere","tropopause","ozone layer"],"related_terms":["atmospheric science","aviation","aerodynamics","meteorology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"substratosphere\" refers to the lower part of the stratosphere, a layer of the atmosphere above the troposphere. It's a technical term used in aviation and atmospheric science to describe the region where commercial airplanes often fly to avoid turbulence. Understanding this term requires knowledge of atmospheric layers and related scientific concepts."},"example_sentences":[{"sentence":"Scientists are studying the composition of the air in the substratosphere.","translation":"科学者たちは亜成層圏の空気の組成を研究している。","type":"general","meaning_category":"atmospheric science"},{"sentence":"Flying in the substratosphere allows for smoother journeys due to less turbulence.","translation":"亜成層圏を飛行することで、乱気流が少ないため、よりスムーズな旅が可能になる。","type":"aviation","meaning_category":"aviation"}]}