{"word":"neologian","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"新語造語者、新語使用者、新語研究者","english_definition":"A person who coins or uses new words or meanings.","examples":[{"sentence":"The neologian's latest creation was quickly adopted by the tech community.","translation":"その新語造語者の最新の造語は、すぐにテクノロジーコミュニティに採用された。"},{"sentence":"As a neologian, she is always looking for ways to make language more expressive.","translation":"新語研究者として、彼女は常に言語をより表現力豊かにする方法を探している。"}],"collocations":["modern neologian","linguistic neologian","prolific neologian"],"synonyms":["coiner","lexicographer","linguist"],"antonyms":["purist","traditionalist"]}],"etymology":{"value":"From 'neology' (the introduction or use of new words or new senses of existing words) + '-ian' (suffix indicating a person associated with something). 'Neology' is derived from Greek 'neos' (new) and 'logos' (word, speech).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌniːəˈloʊdʒən/","syllables":"ne-o-lo-gi-an"},"inflection":{"noun_plural":"neologians"},"usage_notes":{"explanation":"The term 'neologian' refers to someone involved with neologisms, whether by creating, popularizing, or studying them. It's often used in the context of linguistics, literature, or technology, where new words are frequently introduced.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a neologian of classical literature.","correct":"✓ He is a scholar of classical literature.","note":"'Neologian' specifically refers to someone dealing with new words, not someone studying classical literature. Use 'scholar' or 'expert' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["neology (noun: the creation or use of new words or meanings)","neologic (adjective: relating to neology)","neological (adjective: relating to neology)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Neologian' is a relatively uncommon word that describes someone who creates, uses, or studies new words. It's most often encountered in discussions about language, linguistics, or areas where new terminology is common, such as technology or science. Because it's not a frequently used word, it may be unfamiliar to many English speakers."},"example_sentences":[{"sentence":"The internet has spawned a new generation of neologians, constantly inventing new slang.","translation":"インターネットは新語造語者の新しい世代を生み出し、常に新しいスラングを生み出している。","type":"general","meaning_category":"新語造語者"},{"sentence":"Some critics dismissed his writing as pretentious due to his frequent use of neologisms, but others praised him as a linguistic neologian.","translation":"彼の頻繁な新語の使用のため、批評家の中には彼の文章を気取っていると却下する人もいたが、言語の新語造語者として彼を称賛する人もいた。","type":"general","meaning_category":"新語使用者"},{"sentence":"The professor, a renowned neologian, dedicated his life to studying the evolution of language and the birth of new vocabulary.","translation":"著名な新語研究者である教授は、言語の進化と新しい語彙の誕生を研究することに生涯を捧げた。","type":"general","meaning_category":"新語研究者"}]}