{"word":"hysterisch","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"ヒステリックな、取り乱した、大騒ぎする","english_definition":"hysterical; uncontrollably emotional; excessively agitated","examples":[{"sentence":"Sie wurde hysterisch, als sie die Nachricht hörte.","translation":"彼女はその知らせを聞いてヒステリックになった。"},{"sentence":"Beruhige dich! Sei nicht so hysterisch!","translation":"落ち着け！そんなにヒステリックになるな！"},{"sentence":"Die hysterische Reaktion der Medien war übertrieben.","translation":"メディアのヒステリックな反応は誇張されていた。"}],"collocations":["hysterisch werden (ヒステリックになる)","hysterisch lachen (ヒステリックに笑う)","hysterisch schreien (ヒステリックに叫ぶ)","hysterische Anfälle (ヒステリックな発作)"],"synonyms":["aufgeregt","überdreht","ausser sich","unbeherrscht","nervös"],"antonyms":["ruhig","gelassen","besonnen","beherrscht"]}],"etymology":{"value":"Das Wort stammt von dem griechischen Wort 'hystera' (Gebärmutter) ab. Früher glaubte man, dass Hysterie eine Krankheit sei, die nur Frauen betrifft und durch Probleme mit der Gebärmutter verursacht wird.","priority":"N/A"},"pronunciation":{"ipa":"/hʏsˈteːʁɪʃ/","syllables":"hys-te-risch"},"inflection":{"adjective_forms":{"comparative":"hysterischer","superlative":"am hysterischsten"}},"usage_notes":{"explanation":"'Hysterisch' beschreibt einen Zustand extremer Aufregung, Angst oder Trauer, oft in einer Weise, die übertrieben oder unkontrolliert wirkt. Es kann sich auf Personen oder Situationen beziehen. Der Begriff hat eine problematische Geschichte, da er früher mit der Vorstellung verbunden war, dass Hysterie eine spezifische weibliche Krankheit sei. Heutzutage wird der Begriff jedoch geschlechtsneutral verwendet, obwohl er immer noch eine negative Konnotation haben kann.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Er war hysterisch über den Film.","correct":"Er war aufgeregt wegen des Films.","note":"'Hysterisch' impliziert einen Kontrollverlust. Wenn jemand nur begeistert ist, ist 'aufgeregt' eine bessere Wahl."}],"priority":"N/A"},"related_words":{"derivatives":["Hysterie (名詞:ヒステリー)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"N/A","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Hysterisch' bedeutet, dass jemand sehr aufgeregt, ängstlich oder traurig ist und sich nicht mehr kontrollieren kann. Es ist ein starkes Wort und sollte nicht leichtfertig verwendet werden, da es eine negative Bedeutung haben kann. Es ist wichtig zu beachten, dass der Begriff eine problematische Geschichte hat und früher mit der Vorstellung verbunden war, dass Hysterie eine spezifische weibliche Krankheit sei."},"example_sentences":[{"sentence":"Die Fans waren hysterisch vor Freude, als ihre Mannschaft gewann.","translation":"ファンはチームが勝ったとき、喜びでヒステリックになった。","type":"adjective","meaning_category":"取り乱した"},{"sentence":"Die hysterische Reaktion der Börse auf die Nachricht war unbegründet.","translation":"証券取引所のそのニュースに対するヒステリックな反応は根拠がなかった。","type":"adjective","meaning_category":"大騒ぎする"}]}