{"word":"amphipathic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"両親媒性の、親水性と疎水性の両方の性質を持つ","english_definition":"having both hydrophilic (water-attracting) and hydrophobic (water-repelling) parts.","examples":[{"sentence":"Phospholipids are amphipathic molecules.","translation":"リン脂質は両親媒性分子です。"},{"sentence":"Amphipathic molecules are essential for cell membrane structure.","translation":"両親媒性分子は細胞膜の構造に不可欠です。"}],"collocations":["amphipathic molecule","amphipathic lipid","amphipathic helix"],"synonyms":["amphiphilic"],"antonyms":["hydrophilic","hydrophobic"]}],"etymology":{"value":"Derived from the Greek words 'amphi' (meaning 'both') and 'pathos' (meaning 'feeling' or 'suffering'), combined with '-ic' (forming an adjective). The 'pathos' part is used here in the sense of 'affinity' or 'tendency'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæmfɪˈpæθɪk/","syllables":"am-phi-path-ic"},"inflection":{"notes":"Adjective; comparative and superlative forms are possible (more amphipathic, most amphipathic) but less common."},"usage_notes":{"explanation":"'Amphipathic' describes molecules that have both a polar (hydrophilic) region and a nonpolar (hydrophobic) region. This dual nature is crucial for the formation of biological membranes and the behavior of lipids in aqueous solutions. It's a term primarily used in chemistry, biology, and related scientific fields.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The protein is amphipathic because it likes water.","correct":"✓ The protein is amphipathic because it has both water-loving and water-repelling parts.","note":"Amphipathic doesn't mean 'liking water'; it means having both hydrophilic and hydrophobic regions."}],"priority":"★★☆"},"related_words":{"derivatives":["amphipathicity (noun)"],"phrasal_verbs":[],"related_terms":["hydrophilic","hydrophobic","lipid","micelle","phospholipid","cell membrane"]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized scientific term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amphipathic' is a technical term used in science, particularly in chemistry and biology. It describes molecules that have two distinct regions: one that attracts water (hydrophilic) and one that repels water (hydrophobic). This dual property is essential for the structure and function of cell membranes and other biological structures. Understanding this term requires some background knowledge in science.","priority":"★★☆"},"example_sentences":[{"sentence":"Detergents are often amphipathic, allowing them to dissolve both oily and watery substances.","translation":"洗剤はしばしば両親媒性であり、油性と水性の両方の物質を溶解させることができます。","type":"general","meaning_category":"general"},{"sentence":"The amphipathic nature of bile salts helps in the emulsification of fats during digestion.","translation":"胆汁酸の両親媒性は、消化中の脂肪の乳化を助けます。","type":"biological","meaning_category":"biological"},{"sentence":"Researchers are studying novel amphipathic polymers for drug delivery systems.","translation":"研究者たちは、薬物送達システムのための新規な両親媒性ポリマーを研究しています。","type":"chemical","meaning_category":"chemical"}]}