{"word":"non-respiratory-depressant","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"呼吸抑制作用のない","english_definition":"Not causing respiratory depression (a decrease in the rate and depth of breathing).","examples":[{"sentence":"This medication is a non-respiratory-depressant, making it safer for patients with breathing difficulties.","translation":"この薬は呼吸抑制作用がないため、呼吸困難のある患者にとってより安全です。"}],"collocations":["non-respiratory-depressant drug","non-respiratory-depressant medication","non-respiratory-depressant effect"],"synonyms":["respiratory-sparing","non-sedating","non-narcotic"],"antonyms":["respiratory-depressant"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the term 'respiratory-depressant'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒn rɪˈspɪrətəri dɪˈprɛsənt/","syllables":"non-re-spir-a-to-ry-di-pres-sant"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"This term is primarily used in medical contexts to describe substances or medications that do not suppress or reduce the rate and depth of breathing. It is often used in contrast to medications that do have respiratory-depressant effects, such as opioids or sedatives.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ This is a non respiratory depressant.","correct":"✓ This is a non-respiratory-depressant.","note":"The correct spelling includes hyphens to clearly indicate that the entire phrase 'respiratory-depressant' is being negated."}],"priority":"☆☆☆"},"related_words":{"derivatives":["respiratory (adjective: relating to respiration or breathing)","depression (noun: a reduction in functional activity)","respiratory depression (noun: a decrease in the rate and depth of breathing)"],"phrases":["central respiratory drive","opioid-induced respiratory depression"],"priority":"☆☆☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical or scientific contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-respiratory-depressant' is a specialized medical term indicating that a substance does not cause a decrease in breathing rate or depth. It is primarily used in healthcare settings and technical literature to describe medications or treatments that are safer for patients at risk of respiratory issues. Understanding this term requires a background in medical terminology or a specific interest in pharmacology and respiratory physiology."},"example_sentences":[{"sentence":"The new analgesic is advertised as a non-respiratory-depressant.","translation":"その新しい鎮痛剤は、呼吸抑制作用がないと宣伝されている。","type":"adjective","meaning_category":"medical"},{"sentence":"We chose a non-respiratory-depressant anesthetic for the patient with COPD.","translation":"COPDの患者には、呼吸抑制作用のない麻酔薬を選んだ。","type":"adjective","meaning_category":"medical"}]}