{"word":"cross-dyeing","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"交差染色、異種繊維混紡染色","english_definition":"A dyeing process in which a fabric made of two or more different fibers is dyed in a single bath, with each fiber taking up a different dye or color.","examples":[{"sentence":"Cross-dyeing can create interesting heathered or mottled effects in fabrics.","translation":"交差染色は、生地に興味深い霜降りやまだら模様の効果を生み出すことができます。"},{"sentence":"The label indicates that the shirt was created using cross-dyeing techniques.","translation":"ラベルには、そのシャツが交差染色技術を用いて作られたことが示されています。"}],"collocations":["achieve cross-dyeing effects","cross-dyeing techniques","fabric cross-dyeing"],"synonyms":["differential dyeing","union dyeing"],"antonyms":[]}],"etymology":{"value":"The term 'cross-dyeing' comes from the fact that different fibers 'cross' each other in a fabric, and each takes a different dye.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈkrɒsˌdaɪɪŋ/","syllables":"cross-dye-ing"},"inflection":{"noun_plural":"cross-dyeings"},"usage_notes":{"explanation":"Cross-dyeing is used to create multicolored or patterned effects in fabrics made from a blend of different fibers. It is also used to achieve solid colors in fabrics where one fiber is difficult to dye.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ cross dyeing fabric","correct":"✓ cross-dyed fabric","note":"When used as an adjective, 'cross-dyed' is the correct form."}],"priority":"☆☆☆"},"related_words":{"derivatives":["cross-dyed (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Cross-dyeing' is a technical term used in the textile industry. It refers to a specific dyeing process used on fabrics made from a blend of different fibers, where each fiber absorbs a different dye, creating a multicolored effect. Understanding this term requires some knowledge of textile manufacturing and dyeing processes."},"example_sentences":[{"sentence":"The designer used cross-dyeing to create a unique gradient effect on the scarf.","translation":"デザイナーは交差染色を用いて、スカーフに独特のグラデーション効果を生み出した。","type":"noun","meaning_category":"交差染色"},{"sentence":"This cross-dyed sweater has a subtle, heathered appearance.","translation":"この交差染色されたセーターは、微妙な霜降り模様がある。","type":"adjective (cross-dyed)","meaning_category":"交差染色された"}]}