{"word":"state-socialist","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"国家社会主義の","english_definition":"relating to or characteristic of state socialism.","examples":[{"sentence":"The country adopted a state-socialist economic model.","translation":"その国は国家社会主義的な経済モデルを採用した。"}],"collocations":["state-socialist economy","state-socialist policies"],"synonyms":["statist","command economy"],"antonyms":["free-market","capitalist"]},{"part_of_speech":"noun","definition":"国家社会主義者","english_definition":"an advocate or supporter of state socialism.","examples":[{"sentence":"He was a staunch state-socialist, believing in government control of the economy.","translation":"彼は熱心な国家社会主義者で、政府による経済統制を信じていた。"}],"collocations":["devout state-socialist","ardent state-socialist"],"synonyms":["statist","collectivist"],"antonyms":["libertarian","individualist"]}],"etymology":{"value":"'state'（国家）+ 'socialist'（社会主義者）の合成語。国家が経済を統制し、社会主義的な目標を追求する体制を支持するイデオロギーを指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsteɪt ˈsoʊʃəlɪst/","syllables":"state-so-cial-ist"},"inflection":{"noun_plural":"state-socialists"},"usage_notes":{"explanation":"'state-socialist'は、国家が経済を主導的に管理し、資源を配分する社会主義の一形態を指します。この用語は、政府が広範な経済的権限を持つ体制を特徴づけるために使用されます。しばしば、計画経済や国有企業が中心となる経済システムと関連付けられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a state socialist. He believes in minimal government.","correct":"✓ He is a state socialist. He believes in strong government control.","note":"国家社会主義は政府の強力な関与を支持するため、最小限の政府を信じるという記述は矛盾します。"},{"incorrect":"✗ State socialism is the same as democratic socialism.","correct":"✓ State socialism is different from democratic socialism, which emphasizes democratic control over the economy.","note":"国家社会主義と民主社会主義は異なります。民主社会主義は経済に対する民主的な統制を重視します。"}],"priority":"★★☆"},"related_words":{"derivatives":["state socialism","socialism","statism","communism"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'state-socialist' refers to an economic and political system where the state controls the means of production and distribution, aiming to achieve socialist goals. This often involves centralized planning and state ownership of industries. It's important to distinguish this from other forms of socialism, such as democratic socialism, which emphasizes democratic control and decentralized decision-making. The term is often used in political and economic discussions, particularly when analyzing historical or contemporary political systems."},"example_sentences":[{"sentence":"The government implemented state-socialist policies to redistribute wealth.","translation":"政府は富を再分配するために国家社会主義政策を実施した。","type":"adjective","meaning_category":"relating to state socialism"},{"sentence":"Many criticized the state-socialist for advocating authoritarian control.","translation":"多くの人が、権威主義的な統制を擁護する国家社会主義者を批判した。","type":"noun","meaning_category":"an advocate of state socialism"}]}