{"word":"Christianism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"キリスト教主義、キリスト教の教義・原則","english_definition":"The principles or doctrines of Christianity. Often used to emphasize the ideology or system of beliefs rather than the religion itself.","examples":[{"sentence":"He advocated for a return to traditional Christianism in public life.","translation":"彼は公的生活における伝統的なキリスト教主義への回帰を提唱した。"},{"sentence":"The debate centered on whether the new policy aligned with fundamental Christianism.","translation":"議論は、その新しい政策が基本的なキリスト教主義と一致するかどうかに集中した。"},{"sentence":"Some scholars distinguish between the teachings of Jesus and later interpretations of Christianism.","translation":"一部の学者は、イエスの教えと後のキリスト教主義の解釈を区別する。"}],"collocations":["fundamental Christianism (根本的なキリスト教主義)","traditional Christianism (伝統的なキリスト教主義)","early Christianism (初期キリスト教主義)"],"synonyms":["Christianity","Christian doctrine","Christian principles","Christian ideology"],"antonyms":["paganism","secularism","atheism"]}],"etymology":{"value":"The term 'Christianism' is derived from 'Christian' with the addition of the suffix '-ism,' which denotes a system of beliefs or a doctrine. It is often used to refer to the ideological or systematic aspects of Christianity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɪstʃənɪzəm/","syllables":"chris-tian-ism"},"inflection":{"noun_plural":"Christianisms (rarely used)"},"usage_notes":{"explanation":"'Christianism' is often used to refer to the ideological aspects or the system of beliefs within Christianity, rather than the religion itself. It can be used to discuss the principles, doctrines, and interpretations of Christian teachings. The term is less common than 'Christianity' but can be useful when emphasizing the ideological or systematic nature of Christian beliefs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices Christianism as his religion.","correct":"✓ He practices Christianity as his religion.","note":"'Christianity' is the more common and general term for the religion. 'Christianism' is more specific to the ideology or doctrines."},{"incorrect":"✗ The Christianism people are very kind.","correct":"✓ Christian people are very kind.","note":"Use 'Christian' as an adjective to describe people who follow Christianity."}],"priority":"★★☆"},"related_words":{"derivatives":["Christian (adjective, noun)","Christianity (noun)","Christianize (verb)","Christianist (noun, adjective)"],"phrases":["Christian doctrine","Christian principles","Christian ideology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Christianism' is a term used to describe the principles, doctrines, or ideology of Christianity. It is less common than 'Christianity,' which refers to the religion itself. 'Christianism' is often used in academic or theological contexts to discuss the system of beliefs and interpretations within Christianity. It is important to distinguish between 'Christianism' and 'Christianity,' as the former emphasizes the ideological aspects, while the latter refers to the broader religion.","example_sentences":[{"sentence":"The philosopher analyzed the core tenets of Christianism in his book.","translation":"その哲学者は著書の中でキリスト教主義の中核となる教義を分析した。","type":"noun","meaning_category":"キリスト教主義の教義"},{"sentence":"The political movement sought to implement policies based on Christianism.","translation":"その政治運動はキリスト教主義に基づく政策を実行しようとした。","type":"noun","meaning_category":"キリスト教主義の原則"},{"sentence":"Scholars debated the various interpretations of Christianism throughout history.","translation":"学者たちは歴史を通じてキリスト教主義の様々な解釈について議論した。","type":"noun","meaning_category":"キリスト教主義の解釈"}]}}