{"word":"knotter","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(機械)結び目を作る装置、結び機","english_definition":"A mechanical device that ties knots, especially in agricultural machinery such as balers.","examples":[{"sentence":"The knotter on the baler was malfunctioning, causing the bales to come apart.","translation":"ベーラーの結び機が故障していたため、ベールがばらけてしまった。"},{"sentence":"He had to adjust the knotter to ensure the twine was tied tightly.","translation":"彼は、より糸がしっかりと結ばれるように、結び機を調整する必要があった。"}],"collocations":["baler knotter","twine knotter","automatic knotter"],"synonyms":["knotting device","knotting mechanism"],"antonyms":[]},{"part_of_speech":"noun","definition":"(人)結び目を作る人、結び職人","english_definition":"A person who ties knots, especially as a profession or craft.","examples":[{"sentence":"The fisherman was a skilled knotter, able to tie various knots quickly and efficiently.","translation":"その漁師は熟練した結び職人で、さまざまな結び目を素早く効率的に結ぶことができた。"},{"sentence":"The sailor learned to be a good knotter during his time at sea.","translation":"その船乗りは、海上生活の間に優れた結び職人になることを学んだ。"}],"collocations":["skilled knotter","experienced knotter"],"synonyms":["knot tyer","knot maker"],"antonyms":[]}],"etymology":{"value":"Derived from the word 'knot' (a fastening made by intertwining a piece or pieces of string, rope, etc.) with the addition of the suffix '-er' (indicating a person or thing that performs the action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnɒtər/","syllables":"knot-ter"},"inflection":{"noun_plural":"knotters"},"usage_notes":{"explanation":"The term 'knotter' can refer to either a mechanical device or a person skilled in tying knots. The context usually makes it clear which meaning is intended. In agricultural contexts, it almost always refers to the mechanical device on a baler or similar machine. In maritime or craft contexts, it usually refers to a person.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The knotter was a person who made knots of wood.","correct":"✓ The knotter was a person who tied knots.","note":"'Knotter' refers to someone who ties knots, not someone who makes knots out of wood (which would be a wood carver or sculptor)."},{"incorrect":"✗ The baler's knotter is making the bales square.","correct":"✓ The baler's knotter is tying the bales.","note":"The knotter ties the bales, it doesn't shape them. The overall design of the baler determines the shape of the bales."}],"priority":"★★☆"},"related_words":{"derivatives":["knot (noun)","knotty (adjective)","knotting (verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Knotter' is a relatively specialized term. It refers to either a machine that ties knots, often found in agricultural equipment, or a person skilled at tying knots. Understanding this word requires some familiarity with either mechanics or crafts involving rope or twine. The context will usually indicate which meaning is intended.","priority":"★★☆"},"example_sentences":[{"sentence":"The farmer replaced the broken knotter on his hay baler.","translation":"農夫は干し草ベーラーの壊れた結び機を交換した。","type":"noun","meaning_category":"結び目を作る装置"},{"sentence":"The experienced sailor was a skilled knotter.","translation":"その経験豊富な船乗りは熟練した結び職人だった。","type":"noun","meaning_category":"結び目を作る人"}]}