{"word":"Pseudo-mexican","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(Derogatory) Describes something that inaccurately or superficially imitates Mexican culture, often in a stereotypical or inauthentic way.","english_definition":"Describing something that falsely or superficially imitates Mexican culture, often in a stereotypical or inauthentic way.","examples":[{"sentence":"The restaurant's 'Mexican' food was just pseudo-mexican slop.","translation":"そのレストランの「メキシコ」料理は、ただのニセメキシコ風の粗末な食べ物だった。"},{"sentence":"The decor was pseudo-mexican, all sombreros and serapes.","translation":"内装はニセメキシコ風で、ソンブレロとセラペだらけだった。"}],"collocations":["pseudo-mexican food","pseudo-mexican decor","pseudo-mexican restaurant"],"synonyms":["inauthentic","fake","stereotypical","ersatz","imitation"],"antonyms":["authentic","genuine","real","traditional"]},{"part_of_speech":"noun","definition":"(Derogatory) Something that is inaccurately or superficially presented as Mexican.","english_definition":"Something that is falsely or superficially presented as Mexican.","examples":[{"sentence":"This isn't real Mexican food, it's just pseudo-mexican.","translation":"これは本物のメキシコ料理ではなく、ただのニセメキシコ風だ。"}],"collocations":[],"synonyms":["imitation","fake","ersatz"],"antonyms":["authentic","genuine"]}],"etymology":{"value":"Formed by combining the prefix 'pseudo-' (meaning false or imitation) with the adjective 'Mexican'.","priority":"Medium"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈmɛksɪkən/","syllables":"pseu-do-mex-i-can"},"inflection":{"noun_plural":"pseudo-mexicans"},"usage_notes":{"explanation":"The term 'pseudo-mexican' is often used in a derogatory or critical way to describe something that is seen as a poor or inaccurate representation of Mexican culture. It implies that the item or experience is not authentic and relies on stereotypes.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"This is a pseudo-Mexican dish, it's very authentic.","correct":"This is a pseudo-Mexican dish, it's very inauthentic.","note":"'Pseudo-' implies inauthenticity, so it cannot be used with 'authentic'."}],"priority":"Medium"},"related_words":{"derivatives":["pseudo (prefix)","Mexican"],"related_terms":["Tex-Mex (often considered a distinct cuisine, but can sometimes be described as pseudo-mexican by purists)","Americanized Mexican food"]},"level_frequency":{"frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Pseudo-mexican' is a critical term used to describe something that is presented as Mexican but is considered inauthentic or stereotypical. It's often used to criticize food, decor, or cultural representations that are seen as lacking genuine Mexican cultural elements. The prefix 'pseudo-' indicates that something is not what it claims to be."},"example_sentences":[{"sentence":"The restaurant served pseudo-mexican food that tasted nothing like authentic Mexican cuisine.","translation":"そのレストランは、本場のメキシコ料理とは似ても似つかないニセメキシコ風の料理を出していた。","type":"adjective","meaning_category":"inauthentic"},{"sentence":"The tourist shop was full of pseudo-mexican souvenirs.","translation":"そのお土産屋はニセメキシコ風のお土産でいっぱいだった。","type":"adjective","meaning_category":"inauthentic"}]}