{"word":"chirotony","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(キリスト教)聖職按手、叙聖","english_definition":"The laying on of hands to ordain someone to a clerical office, especially a bishop, priest, or deacon.","examples":[{"sentence":"The chirotony of the new bishop was a solemn and beautiful ceremony.","translation":"新しい司教の叙聖は、厳粛で美しい儀式でした。"}],"collocations":["perform chirotony","receive chirotony"],"synonyms":["ordination","consecration","investiture"],"antonyms":["laicization"]}],"etymology":{"value":"Derived from the Greek word χειροτονία (cheirotonia), meaning 'election by show of hands', from χείρ (cheir, 'hand') + τείνω (teinō, 'to stretch out'). Originally referring to a vote taken by raising hands, it came to denote ordination by the laying on of hands.","priority":"★★★"},"pronunciation":{"ipa":"/kaɪˈrɒtəni/","syllables":"ki-rot-o-ny"},"inflection":{"noun_plural":"chirotonies"},"usage_notes":{"explanation":"Chirotony is a specific term used within certain Christian traditions, particularly Eastern Orthodox and some Catholic churches, to refer to the rite of ordaining someone to a clerical office. It involves the laying on of hands by a bishop, signifying the transmission of spiritual authority and grace. The term is not commonly used in everyday English but is important in theological and liturgical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The chirotony was performed by the priest.","correct":"✓ The chirotony was performed by the bishop.","note":"Chirotony, the ordination of clergy, must be performed by a bishop, not a priest."}],"priority":"★★☆"},"related_words":{"derivatives":["chirothesia (minor ordination)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'chirotony' is a highly specialized term used primarily in theological and liturgical contexts within certain Christian traditions. It refers specifically to the rite of ordination by the laying on of hands. Due to its limited usage, it is not generally encountered in everyday English and would be considered advanced vocabulary."},"example_sentences":[{"sentence":"The candidate prepared himself spiritually for the chirotony.","translation":"その候補者は、叙聖に向けて精神的な準備をしました。","type":"noun","meaning_category":"聖職按手"},{"sentence":"The ceremony of chirotony was conducted with great reverence.","translation":"叙聖の儀式は、非常に敬虔な気持ちで行われました。","type":"noun","meaning_category":"聖職按手"}]}