{"word":"dysthanasia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"尊厳死、安楽死の反対概念としての苦痛死、延命治療","english_definition":"The act of prolonging the process of dying as much as possible, usually with the use of extraordinary measures; the opposite of euthanasia.","examples":[{"sentence":"The family decided against dysthanasia and opted for palliative care.","translation":"家族は苦痛死を避けることを決め、緩和ケアを選んだ。"},{"sentence":"Some ethicists argue that modern medicine often leads to dysthanasia rather than a peaceful death.","translation":"倫理学者の中には、現代医学は安らかな死ではなく、しばしば苦痛死につながると主張する者もいる。"}],"collocations":["avoid dysthanasia (苦痛死を避ける)","dysthanasia vs. euthanasia (苦痛死 vs. 安楽死)","medical dysthanasia (医学的苦痛死)"],"synonyms":["prolongation of dying","aggressive treatment at end of life","futile medical intervention"],"antonyms":["euthanasia","assisted suicide","palliative care"]},{"part_of_speech":"noun","definition":"(比喩的に) 苦痛を伴う、あるいは不快な状況の継続","english_definition":"(Figuratively) The continuation of a painful or unpleasant situation.","examples":[{"sentence":"The project became a form of dysthanasia, dragging on with no clear end in sight.","translation":"そのプロジェクトは苦痛死のような状態になり、明確な終わりが見えないまま長引いた。"}],"collocations":["organizational dysthanasia (組織的な苦痛死)"],"synonyms":["prolonged suffering","drawn-out agony"],"antonyms":["resolution","termination"]}],"etymology":{"value":"Derived from the Greek words 'dys-' (bad, difficult) + 'thanatos' (death) + '-ia' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪsθəˈneɪziə/","syllables":"dys-tha-na-sia"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Dysthanasia' is a term used in medical ethics and bioethics to describe the act of excessively prolonging life, often through aggressive medical interventions, even when there is little hope of recovery and the patient is experiencing significant suffering. It is often contrasted with 'euthanasia,' which refers to the act of intentionally ending a life to relieve suffering. The term can also be used metaphorically to describe situations that are prolonged and painful.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed dysthanasia on the patient.","correct":"✓ The doctor practiced dysthanasia by aggressively treating the patient.","note":"Dysthanasia is a process or practice, not an action performed directly on a patient. It's the result of medical interventions that prolong dying. You 'practice' or 'engage in' dysthanasia. "},{"incorrect":"✗ Dysthanasia is the same as euthanasia.","correct":"✓ Dysthanasia is the opposite of euthanasia.","note":"Dysthanasia and euthanasia are opposing concepts. Dysthanasia prolongs life, while euthanasia ends it."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dysthanasia' is a complex term primarily used in medical and ethical contexts. It describes the practice of excessively prolonging the dying process, often through aggressive medical interventions, even when there is little hope of recovery and the patient is experiencing significant suffering. It is the opposite of euthanasia, which is intentionally ending a life to relieve suffering. The term can also be used metaphorically to describe situations that are prolonged and painful. Understanding this term requires familiarity with medical ethics and end-of-life care discussions."},"example_sentences":[{"sentence":"The ethical debate centers on the distinction between euthanasia and **dysthanasia**.","translation":"倫理的な議論は、安楽死と苦痛死の区別を中心に展開される。","type":"noun","meaning_category":"medical ethics"},{"sentence":"The hospital's policy aimed to prevent **dysthanasia** by promoting palliative care.","translation":"病院の方針は、緩和ケアを推進することで苦痛死を防ぐことを目的としていた。","type":"noun","meaning_category":"medical policy"},{"sentence":"The prolonged legal battle became a form of **dysthanasia** for the company.","translation":"長引く法廷闘争は、その会社にとって苦痛死のような状態になった。","type":"noun","meaning_category":"metaphorical"}]}