{"word":"Atsara","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A Philippine relish made from pickled green papaya.","english_definition":"A pickle made from shredded unripe papaya, carrots, bell peppers, onions, garlic, ginger, raisins, and chili peppers in a sweet-sour vinegar solution.","examples":[{"sentence":"Atsara is often served as a side dish with grilled or fried foods.","translation":"アツァラは、焼き物や揚げ物の付け合わせとしてよく出されます。"},{"sentence":"My grandmother makes the best atsara in the family.","translation":"私の祖母は、家族の中で一番美味しいアツァラを作ります。"}],"collocations":["green papaya atsara","homemade atsara","serve with atsara"],"synonyms":["pickled papaya","papaya relish"],"antonyms":[]}],"etymology":{"value":"Likely derived from the Indian achar (pickle), reflecting historical trade and cultural exchanges.","priority":"★★☆"},"pronunciation":{"ipa":"/ɑːtˈsɑːrə/","syllables":"At-sa-ra"},"inflection":{"notes":"It is a noun, and the plural form is 'atsaras' but it is not commonly used."},"usage_notes":{"explanation":"Atsara is a popular condiment in the Philippines, often used to balance the richness of fried or grilled dishes. It is known for its sweet, sour, and slightly spicy flavor.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a atsara.","correct":"✓ I ate atsara.","note":"'Atsara' is treated as a mass noun in many contexts, so the article 'a' is often omitted."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_dishes":["kinilaw","lechon","adobo"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. It is specific to Philippine cuisine.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"Atsara is a specific type of Philippine pickle. It is made from unripe papaya and other vegetables. It is often served as a side dish. Understanding this word requires knowledge of Philippine cuisine.","priority":"★☆☆"},"example_sentences":[{"sentence":"She prepared a large jar of atsara for the fiesta.","translation":"彼女は祭りのために大きなアツァラの瓶を用意しました。","type":"noun","meaning_category":"Philippine relish"},{"sentence":"The atsara added a refreshing tang to the grilled pork.","translation":"アツァラは、焼き豚にさわやかな風味を加えました。","type":"noun","meaning_category":"Philippine relish"}]}