{"word":"musteloid","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"イタチ科に似た、またはイタチ科の","english_definition":"Resembling or related to the Mustelidae family.","examples":[{"sentence":"The animal had musteloid features.","translation":"その動物はイタチ科のような特徴を持っていた。"},{"sentence":"Musteloid carnivores are known for their playful behavior.","translation":"イタチ科の肉食動物は、その遊び好きな行動で知られている。"}],"collocations":["musteloid family","musteloid characteristics","musteloid species"],"synonyms":["weasel-like","ferret-like","badger-like"],"antonyms":[]},{"part_of_speech":"noun","definition":"イタチ科の動物","english_definition":"An animal belonging to the Mustelidae family.","examples":[{"sentence":"Otters are musteloids adapted to aquatic life.","translation":"カワウソは水生生活に適応したイタチ科の動物である。"},{"sentence":"The museum displayed various musteloids from the region.","translation":"博物館はその地域の様々なイタチ科の動物を展示した。"}],"collocations":["various musteloids","different musteloids","rare musteloids"],"synonyms":["weasel","ferret","badger","otter","mink"],"antonyms":[]}],"etymology":{"value":"From Mustelidae + -oid. Mustelidae is derived from Mustela (the genus of weasels) + -idae (a standard suffix for zoological families).","priority":"★★☆"},"pronunciation":{"ipa":"/mʌˈstɛlɔɪd/","syllables":"mus-tel-oid"},"inflection":{"noun_plural":"musteloids"},"usage_notes":{"explanation":"The term \"musteloid\" is used in zoology to refer to animals belonging to the family Mustelidae, which includes weasels, badgers, otters, ferrets, and related species. It can be used as both an adjective to describe characteristics resembling these animals and as a noun to refer to a member of this family.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The musteloid is a type of feline.","correct":"✓ The musteloid is not a type of feline; it belongs to the Mustelidae family.","note":"Musteloids are often confused with other small carnivores, but they are distinct from felines (cats)."},{"incorrect":"✗ Musteloids are only found in cold climates.","correct":"✓ Musteloids are found in a variety of climates, not just cold ones.","note":"While some musteloids are adapted to cold climates, the family as a whole is found in diverse environments."}],"priority":"★★☆"},"related_words":{"derivatives":["Mustelidae (イタチ科)","musteline (イタチ科の)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"musteloid\" is a technical term used in zoology. It refers to animals belonging to the family Mustelidae, which includes a variety of carnivorous mammals such as weasels, badgers, otters, and ferrets. Understanding the term requires some familiarity with biological classification. It is more commonly used in scientific or educational contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The scientist studied the musteloid's behavior in the wild.","translation":"科学者は野生におけるイタチ科動物の行動を研究した。","type":"noun","meaning_category":"イタチ科の動物"},{"sentence":"The musteloid family is diverse and includes many different species.","translation":"イタチ科は多様であり、多くの異なる種を含む。","type":"adjective","meaning_category":"イタチ科の"}]}