{"word":"price-controlled","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"価格統制された、価格規制された","english_definition":"Subject to government-imposed price controls.","examples":[{"sentence":"The government implemented price-controlled measures to stabilize the cost of essential goods.","translation":"政府は生活必需品の価格を安定させるために価格統制措置を実施した。"},{"sentence":"In a price-controlled economy, market forces are often suppressed.","translation":"価格統制された経済では、市場原理が抑制されることが多い。"},{"sentence":"Price-controlled items may experience shortages if the set price is too low.","translation":"価格統制された品目は、設定価格が低すぎると品不足になる可能性がある。"}],"collocations":["price-controlled goods","price-controlled economy","implement price-controlled measures","remove price controls"],"synonyms":["price-regulated","regulated price","controlled price"],"antonyms":["free-market price","unregulated price","market-driven price"]}],"etymology":{"value":"The term is a compound of 'price' and 'controlled', indicating that the price is subject to control by an external entity, typically a government.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpraɪs kənˌtroʊld/","syllables":"price-con-trolled"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Price-controlled' refers to a situation where the government or another authority sets a specific price or range of prices for certain goods or services, overriding the natural forces of supply and demand. This is often done to protect consumers from high prices or to ensure the availability of essential items. However, price controls can also lead to unintended consequences such as shortages, black markets, and reduced quality.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The price controlled market.","correct":"✓ The price-controlled market.","note":"'Price-controlled' is a compound adjective and should be hyphenated when used before a noun. Without the hyphen, the sentence structure is incorrect."},{"incorrect":"✗ The government price controlled the goods.","correct":"✓ The government imposed price controls on the goods.","note":"'Price-controlled' is an adjective, not a verb. To describe the action of controlling prices, use the phrase 'impose price controls'."}],"priority":"★★☆"},"related_words":{"derivatives":["price control (noun)","decontrol (verb - to remove price controls)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'price-controlled' is used in economics and political science to describe markets where prices are set by a governing body rather than by supply and demand. It is generally used in discussions about economic policy and the effects of government intervention in markets. Understanding this term requires familiarity with basic economic concepts. "},"example_sentences":[{"sentence":"The government's decision to make fuel a price-controlled commodity sparked debate among economists.","translation":"燃料を価格統制商品とするという政府の決定は、経済学者の間で議論を呼んだ。","type":"adjective","meaning_category":"Describing government intervention"},{"sentence":"Price-controlled rents can lead to a shortage of available housing units.","translation":"価格統制された家賃は、利用可能な住宅ユニットの不足につながる可能性がある。","type":"adjective","meaning_category":"Describing economic effects"},{"sentence":"Many developing nations have experimented with price-controlled agricultural products.","translation":"多くの発展途上国が価格統制された農産物を試験的に導入してきた。","type":"adjective","meaning_category":"Describing economic policy"}]}