{"word":"historicocritical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"歴史的・批判的な、歴史的批判主義の","english_definition":"Relating to or employing the historical-critical method.","examples":[{"sentence":"The historicocritical approach to biblical studies seeks to understand the Bible in its historical context.","translation":"聖書研究における歴史的批判的アプローチは、聖書をその歴史的文脈の中で理解しようとする。"},{"sentence":"His historicocritical analysis of the text revealed previously unnoticed layers of meaning.","translation":"彼のテキストの歴史的批判的分析は、これまで気づかれなかった意味の層を明らかにした。"}],"collocations":["historicocritical method","historicocritical analysis","historicocritical interpretation"],"synonyms":["historical-critical","historical and critical"],"antonyms":[],"notes":"Often used in academic contexts, particularly in theology and literary studies."}],"etymology":{"value":"Formed by combining 'historical' and 'critical'.","priority":"★★★"},"pronunciation":{"ipa":"/hɪˌstɒrɪkoʊˈkrɪtɪkəl/","syllables":"his-tor-i-co-crit-i-cal"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms, which are rarely used for this word."},"usage_notes":{"explanation":"The term 'historicocritical' typically refers to a method of analysis that combines historical investigation with critical evaluation. It is often applied to the study of texts, particularly religious or literary works, to understand their origins, authorship, and meaning within their historical context, while also critically assessing their claims and interpretations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ historico critical","correct":"✓ historicocritical","note":"The word is typically written as one word, not two separate words."},{"incorrect":"✗ Using a historical method.","correct":"✓ Using a historicocritical method.","note":"The historicocritical method is a specific approach that combines historical analysis with critical evaluation, and is not simply a historical method."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["historical criticism","higher criticism","source criticism","form criticism","redaction criticism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'historicocritical' is a specialized term primarily used in academic and scholarly contexts, particularly in fields like theology, biblical studies, and literary criticism. It describes a method of analysis that combines historical investigation with critical evaluation to understand texts or events within their specific historical context. Due to its specialized nature, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The professor advocated for a more nuanced historicocritical reading of the ancient text.","translation":"教授は、古代のテキストに対する、よりニュアンスのある歴史的批判的な解釈を提唱した。","type":"adjective","meaning_category":"歴史的・批判的な"},{"sentence":"A historicocritical examination of the documents revealed inconsistencies in the official narrative.","translation":"文書の歴史的批判的な調査により、公式の記述に矛盾があることが明らかになった。","type":"adjective","meaning_category":"歴史的・批判的な"}]}