{"word":"griefful","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"悲しみに満ちた、悲しみを表す","english_definition":"full of grief; expressing grief.","examples":[{"sentence":"She gave him a griefful look.","translation":"彼女は彼に悲しみに満ちた表情を向けた。"},{"sentence":"The griefful news spread quickly through the village.","translation":"その悲しみに満ちた知らせは村中にすぐに広まった。"},{"sentence":"His griefful heart ached for his lost love.","translation":"彼の悲しみに満ちた心は、失われた愛のために痛んだ。"}],"collocations":["griefful look","griefful heart","griefful news"],"synonyms":["sorrowful","mournful","sad","heartbroken","dolorous","lamenting","woeful"],"antonyms":["joyful","happy","cheerful","content","elated"]}],"etymology":{"value":"\"Grief\" + \"-ful\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡriːffʊl/","syllables":"griefful"},"inflection":{"adjective_forms":{"comparative":"more griefful","superlative":"most griefful"}},"usage_notes":{"explanation":"\"Griefful\" is a relatively uncommon adjective that describes someone or something filled with or expressing grief. It emphasizes the presence and manifestation of sorrow. While similar to \"sorrowful\" or \"mournful\", \"griefful\" can sometimes imply a more intense or overwhelming sense of grief. It's often used to describe expressions, emotions, or situations marked by deep sadness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was griefful for the party.","correct":"✓ He was griefful after hearing the news.","note":"\"Griefful\" describes a state of being filled with grief due to a specific cause or event. It's not typically used to express a general feeling about something unrelated to loss or sadness."},{"incorrect":"✗ The griefful is hard to bear.","correct":"✓ The grief is hard to bear.","note":"\"Griefful\" is an adjective. The correct noun form is \"grief.\""}],"priority":"★★☆"},"related_words":{"derivatives":["grief (noun): intense sorrow, especially caused by someone's death.","grieve (verb): to feel intense sorrow.","grievous (adjective): very serious or painful.","griefless (adjective): without grief."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Not typically found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency - The word is not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"griefful\" is not commonly used in modern English. It is an adjective that means \"full of grief\" or \"expressing grief.\" It is more formal and less frequently encountered than synonyms like \"sorrowful\" or \"mournful.\" Understanding its meaning requires a strong vocabulary and familiarity with less common words. Due to its infrequent usage, it is more likely to be found in literature or formal writing rather than everyday conversation."},"example_sentences":[{"sentence":"Her griefful eyes reflected the pain of her loss.","translation":"彼女の悲しみに満ちた目は、喪失の痛みを映し出していた。","type":"adjective","meaning_category":"悲しみに満ちた"},{"sentence":"The griefful melody of the song brought tears to my eyes.","translation":"その歌の悲しみに満ちたメロディーは、私の目に涙を誘った。","type":"adjective","meaning_category":"悲しみを表す"},{"sentence":"The mourners wore griefful expressions as they gathered at the funeral.","translation":"葬儀に集まった弔問客は、悲しみに満ちた表情をしていた。","type":"adjective","meaning_category":"悲しみを表す"}]}