{"word":"endocranium","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"内頭蓋、脳函の内面","english_definition":"The inner surface of the skull; the part of the skull that encloses the brain.","examples":[{"sentence":"The endocranium provides a protective cavity for the brain.","translation":"内頭蓋は脳のための保護腔を提供する。"},{"sentence":"Researchers studied the endocranium of fossil hominids to understand brain evolution.","translation":"研究者たちは脳の進化を理解するために化石人類の内頭蓋を研究した。"}],"collocations":["endocranial cast","endocranial volume","study of the endocranium"],"synonyms":["inner skull","cranial cavity lining"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'endon' (within) and 'kranion' (skull).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛndoʊˈkreɪniəm/","syllables":"en-do-cra-ni-um"},"inflection":{"noun_plural":"endocrania or endocraniums"},"usage_notes":{"explanation":"The term 'endocranium' is primarily used in the fields of anatomy, paleontology, and anthropology when referring to the inner surface of the skull or the cranial cavity itself. It is often studied to infer information about the brain size and structure of extinct species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ectocranium is the inner surface of the skull.","correct":"✓ The endocranium is the inner surface of the skull.","note":"The ectocranium refers to the outer surface of the skull, while the endocranium refers to the inner surface."}],"priority":"★★☆"},"related_words":{"derivatives":["endocranial (adjective)"],"phrasal_verbs":[],"related_terms":["ectocranium (outer surface of the skull)","cranium (skull)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Endocranium' is a technical term primarily used in scientific contexts, specifically within fields like anatomy, paleontology, and anthropology. It refers to the inner surface of the skull, which is crucial for understanding brain size and structure, especially in extinct species. Due to its specialized usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The shape of the endocranium can provide clues about the brain's development.","translation":"内頭蓋の形状は脳の発達に関する手がかりを提供する可能性がある。","type":"general","meaning_category":"anatomy"},{"sentence":"Scientists created an endocranial cast to examine the brain of the ancient hominid.","translation":"科学者たちは古代人類の脳を調べるために内頭蓋の鋳型を作成した。","type":"specific","meaning_category":"paleontology"}]}