{"word":"preenrollment","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"事前登録、入学前登録","english_definition":"The act or process of registering or enrolling in something (such as a course, program, or school) in advance of the official or regular enrollment period.","examples":[{"sentence":"Preenrollment for the summer camp begins next week.","translation":"サマーキャンプの事前登録は来週から始まります。"},{"sentence":"Students are encouraged to complete their preenrollment online.","translation":"学生はオンラインで事前登録を済ませることを推奨されています。"},{"sentence":"The preenrollment period allows the school to plan resources effectively.","translation":"事前登録期間により、学校はリソースを効果的に計画できます。"}],"collocations":["online preenrollment (オンライン事前登録)","early preenrollment (早期事前登録)","complete preenrollment (事前登録を完了する)","preenrollment form (事前登録用紙)","preenrollment process (事前登録プロセス)","preenrollment period (事前登録期間)"],"synonyms":["advance registration","early registration","preregistration"],"antonyms":["late enrollment","post-enrollment"]},{"part_of_speech":"verb","definition":"事前登録する","english_definition":"To register or enroll in something in advance of the official or regular enrollment period.","examples":[{"sentence":"You can preenroll for the course through the university website.","translation":"大学のウェブサイトからコースの事前登録ができます。"},{"sentence":"We allow students to preenroll to secure their spot in the class.","translation":"クラスの席を確保するために、学生は事前登録できます。"}],"collocations":["preenroll online (オンラインで事前登録する)","preenroll early (早期に事前登録する)"],"synonyms":["preregister","register in advance","enroll early"],"antonyms":["enroll late","register later"]}],"etymology":{"value":"The word \"preenrollment\" is formed by adding the prefix \"pre-\" (meaning \"before\" or \"in advance\") to the word \"enrollment.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːɪnˈroʊlmənt/","syllables":"pre-en-roll-ment"},"inflection":{"noun_plural":"preenrollments","verb_forms":{"present_simple":["preenroll","preenrolls"],"past_simple":"preenrolled","past_participle":"preenrolled","present_participle":"preenrolling"}},"usage_notes":{"explanation":"\"Preenrollment\" refers to the process of registering or enrolling in something before the regular or official enrollment period. It is commonly used in the context of education (schools, courses, programs), but can also apply to other areas where advance registration is required or offered. The verb form, \"preenroll,\" is less common but perfectly valid.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to pre-enrollment for the class.","correct":"✓ I need to preenroll for the class. / ✓ I need to complete my preenrollment for the class.","note":"\"Preenrollment\" is a noun, so it needs a verb like \"complete\" or \"do.\" \"Preenroll\" is the verb form. Alternatively, use \"preregister\"."},{"incorrect":"✗ The preenrollment is free, but the enrollment costs money.","correct":"✓ The preenrollment is free, but the regular enrollment costs money.","note":"Adding \"regular\" clarifies the contrast between preenrollment and the standard enrollment process."}],"priority":"★★☆"},"related_words":{"derivatives":["enrollment","enroll","preregistration","preregister"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"preenrollment\" is a compound word that combines \"pre-\" (meaning before) and \"enrollment\" (the process of officially registering). It refers to the act of signing up for something, like a class or program, before the usual registration period. This is often done to secure a spot or take advantage of early registration benefits. While not a super common word, it's easily understood in contexts related to education and registration.","priority":"★★☆"},"example_sentences":[{"sentence":"The university offers a discount for students who complete their **preenrollment** by May 1st.","translation":"大学は5月1日までに事前登録を完了した学生に割引を提供しています。","type":"noun","meaning_category":"事前登録"},{"sentence":"You can **preenroll** for the workshop online to guarantee your place.","translation":"ワークショップの席を確保するために、オンラインで事前登録できます。","type":"verb","meaning_category":"事前登録する"},{"sentence":"The **preenrollment** process includes submitting your application and paying a deposit.","translation":"事前登録プロセスには、申請書の提出とデポジットの支払いが含まれます。","type":"noun","meaning_category":"事前登録"},{"sentence":"Many parents **preenroll** their children in daycare well in advance.","translation":"多くの親は、かなり前から子供たちを保育園に事前登録します。","type":"verb","meaning_category":"事前登録する"}]}