{"word":"SABME","priority":"☆☆☆","meanings":[{"part_of_speech":"acronym","definition":"Set Asynchronous Balanced Mode Extended","english_definition":"An X.25 protocol command used to establish a connection in Asynchronous Balanced Mode Extended, a communication mode where both stations can initiate transmission.","examples":[{"sentence":"The DTE sent a SABME command to the DCE to initiate the connection.","translation":"DTEはDCEにSABMEコマンドを送信して接続を開始しました。"}],"collocations":["send SABME","issue SABME","SABME frame","SABME command"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Acronym derived from **S**et **A**synchronous **B**alanced **M**ode **E**xtended.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsæbmi/","syllables":"SAB-ME"},"inflection":{},"usage_notes":{"explanation":"SABME is primarily used in the context of X.25 communication protocols, specifically within the LAPB (Link Access Procedure, Balanced) data link layer. It's a command frame sent to establish a connection where both devices have equal transmission privileges. This is different from other modes where one device is designated as primary and the other as secondary. After sending SABME, the sender expects an Unnumbered Acknowledgment (UA) frame as a response to confirm the establishment of the link.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"acronyms":["LAPB","X.25","UA","DISC","DM"],"related_terms":["Asynchronous Balanced Mode (ABM)","HDLC (High-Level Data Link Control)"]},"level_frequency":{},"readability_explanation":{"level":"Advanced","text":"SABME is a technical term specific to X.25 networking. Understanding it requires familiarity with data communication protocols, particularly those related to packet switching and link layer operations. It's not a term used in general conversation and is mostly encountered in networking documentation or academic contexts."},"example_sentences":[{"sentence":"The router initiated the connection by sending a SABME frame.","translation":"ルータはSABMEフレームを送信して接続を開始しました。","type":"example","meaning_category":"Networking"},{"sentence":"After sending the SABME, the system waits for a UA response.","translation":"SABMEを送信した後、システムはUA応答を待ちます。","type":"example","meaning_category":"Networking Protocol"}]}