{"word":"renunciator","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(法律)権利放棄者、拒否者","english_definition":"A person who renounces or rejects something, especially a right or belief.","examples":[{"sentence":"The renunciator signed the document to formally give up his claim.","translation":"権利放棄者は、自身の主張を正式に放棄するために書類に署名した。"},{"sentence":"As a renunciator of violence, he advocated for peaceful solutions.","translation":"暴力の拒否者として、彼は平和的な解決策を提唱した。"}],"collocations":["voluntary renunciator","legal renunciator","renunciator of violence","renunciator of faith"],"synonyms":["rejector","denier","disclaimer","abandoner","forsaker"],"antonyms":["claimant","acceptor","adopter","believer"]}],"etymology":{"value":"Derived from the verb 'renounce', which comes from Old French 'renoncier', from Latin 'renuntiare' meaning 'to announce against, disclaim'. The suffix '-ator' indicates a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈnʌnsieɪtər/","syllables":"re-nun-ci-a-tor"},"inflection":{"noun_plural":"renunciators"},"usage_notes":{"explanation":"'Renunciator' is primarily used in legal or formal contexts to describe someone who has formally given up a right, claim, or belief. It emphasizes the act of renunciation itself. The term is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a renunciator of his family.","correct":"✓ He is a renunciator of his inheritance.","note":"'Renunciator' is typically used in the context of legal rights, claims, or beliefs, not personal relationships. A more appropriate term for abandoning one's family would be 'deserter' or 'abandoner'."},{"incorrect":"✗ She is a renunciator, so she is happy.","correct":"✓ She is a renunciator of material possessions, so she is content.","note":"Being a 'renunciator' does not necessarily imply happiness. It simply means that someone has given up something. The consequence of that action might be contentment, but that needs to be specified."}],"priority":"★★☆"},"related_words":{"derivatives":["renounce (verb)","renunciation (noun)"],"related_terms":["abjurer","apostate","defector","deserter"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'renunciator' is a formal and relatively uncommon term. It is primarily used in legal or philosophical contexts to refer to someone who formally rejects or abandons a claim, right, belief, or principle. Understanding the word requires a strong vocabulary and familiarity with formal language. It is not typically encountered in everyday conversation or general reading material."},"example_sentences":[{"sentence":"The document identified him as the sole renunciator of the estate.","translation":"その書類は彼を遺産の唯一の権利放棄者として特定した。","type":"legal context","meaning_category":"legal rights"},{"sentence":"As a renunciator of worldly pleasures, he sought a life of simplicity.","translation":"世俗的な快楽の拒否者として、彼は質素な生活を求めた。","type":"philosophical context","meaning_category":"beliefs"},{"sentence":"The renunciator signed the agreement, relinquishing all future claims to the property.","translation":"権利放棄者は契約書に署名し、その財産に対する将来のすべての請求権を放棄した。","type":"legal context","meaning_category":"legal claims"}]}