{"word":"Betweenness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"中間性、間にあること、中間の状態","english_definition":"The state or condition of being in the middle or intermediate position; the quality of being between two things.","examples":[{"sentence":"The betweenness of the object made it difficult to categorize.","translation":"その物の中間性により、分類が困難になった。"},{"sentence":"The concept of betweenness is central to understanding this philosophical argument.","translation":"中間性という概念は、この哲学的議論を理解する上で中心となる。"},{"sentence":"The betweenness centrality of a node in a network measures its importance in connecting other nodes.","translation":"ネットワークにおけるノードの中間中心性は、他のノードを接続する上でのその重要性を測る。"}],"collocations":["betweenness centrality (中間中心性)","state of betweenness (中間状態)","sense of betweenness (中間にあるという感覚)"],"synonyms":["intermediacy","middle ground","interposition","mediation","centrality"],"antonyms":["extremity","end","edge"]}],"etymology":{"value":"Derived from the word 'between' by adding the suffix '-ness', which indicates a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/bɪˈtwiːnnəs/","syllables":"be-tween-ness"},"inflection":{"noun_plural":"betweennesses"},"usage_notes":{"explanation":"'Betweenness' is often used in academic or technical contexts to describe a position or quality that lies in the middle of two extremes. In social sciences and network analysis, it can refer to a specific measure of centrality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The betweenness is very high.","correct":"✓ The betweenness centrality is very high.","note":"When referring to a specific measure in network analysis, it's better to specify 'betweenness centrality' rather than just 'betweenness'."}],"priority":"★☆☆"},"related_words":{"derivatives":["between (preposition, adverb)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Betweenness' is a relatively uncommon noun primarily used in academic or technical discussions. It describes the state of being in an intermediate position or having qualities that lie between two distinct entities or concepts. Its usage often implies a nuanced understanding of relationships and positions within a given context, making it more suitable for advanced learners and specialized fields like network analysis or philosophy."},"example_sentences":[{"sentence":"The art installation explored the betweenness of physical and digital space.","translation":"そのアートインスタレーションは、物理的な空間とデジタル空間の中間性を探求した。","type":"general","meaning_category":"中間性"},{"sentence":"The betweenness centrality of this actor in the social network is quite high.","translation":"ソーシャルネットワークにおけるこのアクターの中間中心性は非常に高い。","type":"technical","meaning_category":"中間性 (ネットワーク分析)"}]}