{"word":"unpantheistic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"汎神論的でない","english_definition":"Not pantheistic; opposed to or lacking pantheism.","examples":[{"sentence":"The philosopher presented an unpantheistic view of the universe, emphasizing the separation between God and creation.","translation":"その哲学者は、神と創造の分離を強調し、宇宙の非汎神論的な見解を示した。"},{"sentence":"The artist's work reflects an unpantheistic sensibility, focusing on individual human experiences rather than a divine presence in nature.","translation":"その芸術家の作品は、自然の中に神の存在を見るのではなく、個々の人間の経験に焦点を当て、非汎神論的な感性を反映している。"}],"collocations":["unpantheistic view","unpantheistic approach","unpantheistic perspective"],"synonyms":["nonpantheistic","antitheistic","deistic"],"antonyms":["pantheistic"]},{"part_of_speech":"adjective","definition":"汎神論の要素を含まない","english_definition":"Lacking the elements or characteristics of pantheism.","examples":[{"sentence":"While the poem celebrates nature, its message is ultimately unpantheistic, as it attributes the beauty to a single creator.","translation":"その詩は自然を称賛しているが、そのメッセージは、美しさを単一の創造主に帰するため、最終的には非汎神論的である。"},{"sentence":"The theology of this religion is largely unpantheistic, although it does acknowledge the interconnectedness of all things.","translation":"この宗教の神学は、すべてのものの相互接続性を認めているものの、大部分は非汎神論的である。"}],"collocations":["largely unpantheistic","essentially unpantheistic","mostly unpantheistic"],"synonyms":["non-pantheistic","partially non-pantheistic"],"antonyms":["pantheistic"]}],"etymology":{"value":"The word is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"pantheistic\". \"Pantheistic\" itself comes from \"pantheism\", which is derived from the Greek words \"pan\" (all) and \"theos\" (god).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˌpænθiˈɪstɪk/","syllables":"un-pan-the-is-tic"},"inflection":{"adjective_forms":{"comparative":"more unpantheistic","superlative":"most unpantheistic"}},"usage_notes":{"explanation":"\"Unpantheistic\" is used to describe something that is not related to or does not contain the beliefs of pantheism. It is used in philosophical, religious, and artistic contexts to differentiate viewpoints or works that do not equate God with the universe or nature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The book is unpantheistic, so it must be atheistic.","correct":"✓ The book is unpantheistic, meaning it doesn't equate God with the universe, but it might still be theistic.","note":"Being unpantheistic does not necessarily mean being atheistic. It simply means not holding the belief that God is identical with the universe. A belief system can be theistic (believing in a God) and still be unpantheistic (believing in a God separate from the universe)."},{"incorrect":"✗ Pantheistic and unpantheistic are the same.","correct":"✓ Pantheistic and unpantheistic are opposites.","note":"Pantheistic and unpantheistic are antonyms. Pantheistic means that God is everything, and unpantheistic means that God is not everything."}],"priority":"★★☆"},"related_words":{"derivatives":["unpantheistically"],"related_terms":["pantheism","theism","atheism","deism","monotheism","polytheism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unpantheistic\" is a complex term used primarily in philosophical and theological discussions. It describes a viewpoint or belief system that does not align with pantheism, which is the belief that God is identical with the universe or nature. Understanding this word requires familiarity with abstract concepts and nuanced distinctions between different religious and philosophical perspectives."},"example_sentences":[{"sentence":"The author argues for an unpantheistic understanding of spirituality.","translation":"著者（作者）は、精神性の非汎神論的な理解を主張している。","type":"general","meaning_category":"general"},{"sentence":"The unpantheistic elements in his art reflect his rejection of nature worship.","translation":"彼の芸術における非汎神論的な要素は、彼の自然崇拝の拒絶を反映している。","type":"general","meaning_category":"general"}]}