{"word":"Pan-Slavism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"汎スラヴ主義","english_definition":"A political ideology and movement that promotes the unity and cooperation of all Slavic peoples.","examples":[{"sentence":"Pan-Slavism was a significant force in the Balkans during the 19th and 20th centuries.","translation":"汎スラヴ主義は、19世紀と20世紀のバルカン半島において重要な勢力だった。"},{"sentence":"The idea of Pan-Slavism aimed to unite Slavic nations under a common cultural and political identity.","translation":"汎スラヴ主義の理念は、スラヴ民族を共通の文化的、政治的アイデンティティの下に団結させることを目指していた。"}],"collocations":["promote Pan-Slavism","Pan-Slavism movement","ideology of Pan-Slavism"],"synonyms":["Slavic unity","Slavophilism"],"antonyms":[]}],"etymology":{"value":"'Pan-' comes from the Greek word meaning 'all' or 'every'. 'Slav' refers to Slavic peoples. The '-ism' suffix denotes a doctrine, principle, or ideology.","priority":"★★★"},"pronunciation":{"ipa":"/pænˈslɑːvɪzəm/","syllables":"Pan-Slav-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Pan-Slavism is a historical and political movement emphasizing the shared heritage and potential unity of Slavic peoples. It has manifested in various forms, ranging from cultural cooperation to political unification efforts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Pan-Slavism is only a cultural movement.","correct":"✓ Pan-Slavism is a political and cultural movement.","note":"Pan-Slavism has both political and cultural dimensions."}],"priority":"★★☆"},"related_words":{"derivatives":["Pan-Slavic (adjective)"],"phrases":["Slavic peoples","Slavic languages"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Pan-Slavism is a complex historical and political concept. It refers to the movement advocating for the unity and cooperation of Slavic peoples, often with political implications. Understanding this term requires knowledge of European history, particularly concerning the Balkans and Eastern Europe. It is not a commonly used term in everyday conversation but is significant in historical and political contexts."},"example_sentences":[{"sentence":"The concept of Pan-Slavism played a role in the events leading up to World War I.","translation":"汎スラヴ主義の概念は、第一次世界大戦に至る出来事において役割を果たした。","type":"general","meaning_category":"historical context"},{"sentence":"Advocates of Pan-Slavism sought to foster closer ties between Slavic nations.","translation":"汎スラヴ主義の提唱者たちは、スラヴ諸国間のより緊密な関係を育むことを目指した。","type":"general","meaning_category":"advocacy"}]}