{"word":"commandatory","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"推奨的な、命令的な、委任的な","english_definition":"expressing or containing a command, recommendation, or mandate; having the nature of a commendation or entrustment.","examples":[{"sentence":"The document contained commandatory language urging compliance.","translation":"その文書には、遵守を強く促す推奨的な文言が含まれていた。"},{"sentence":"The governor's message was commandatory in tone, demanding immediate action.","translation":"知事のメッセージは命令的な口調で、即時行動を要求していた。"},{"sentence":"The commandatory letter entrusted him with the responsibility of managing the project.","translation":"委任状は彼にプロジェクトの管理責任を委ねた。"}],"collocations":["commandatory language (推奨的な文言)","commandatory tone (命令的な口調)","commandatory letter (委任状)","commandatory power (委任権限)"],"synonyms":["mandatory","imperative","directive","recommendatory","entrusting","commending"],"antonyms":["discretionary","optional","voluntary","permissive","suggestive"]}],"etymology":{"value":"Late Middle English: from late Latin 'commendatorius', from Latin 'commendare' (see commend). The spelling was altered in the 16th century to conform to 'command'.","priority":"★★★"},"pronunciation":{"ipa":"/kəˈmændətɔːri/","syllables":"com-man-da-to-ry"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more commandatory' and 'most commandatory', respectively, though these are rarely used."},"usage_notes":{"explanation":"'Commandatory' is a relatively rare word. It can describe something that expresses a command or order, but it is more often used to describe something that is recommendatory or that entrusts someone with a responsibility. It is often found in legal or formal contexts. Be careful not to confuse it with 'mandatory,' which means required or obligatory.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rules were commandatory, so we had a choice to follow them.","correct":"✓ The rules were mandatory, so we had no choice but to follow them.","note":"'Commandatory' implies a recommendation or entrustment, not a requirement. Use 'mandatory' to indicate something that is required."},{"incorrect":"✗ He received a commandatory award for his service.","correct":"✓ He received a commendatory award for his service.","note":"'Commandatory' relates to a command or recommendation. 'Commendatory' is used to describe something that expresses praise or approval."}],"priority":"★★☆"},"related_words":{"derivatives":["command (noun, verb)","commend (verb)","commendation (noun)","mandatory (adjective)","recommend (verb)","recommendation (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The word is rarely used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Commandatory' is a relatively rare and formal word. It is used to describe something that expresses a command, recommendation, or entrustment. Because of its infrequent use and formal nature, it is best suited for advanced learners or those working with legal or historical texts. It is important to distinguish it from more common words like 'mandatory' and 'commendatory'."},"example_sentences":[{"sentence":"The judge issued a commandatory order to ensure compliance with the court's decision.","translation":"裁判官は、裁判所の決定の遵守を確実にするために、命令的な命令を発した。","type":"adjective","meaning_category":"命令的な"},{"sentence":"The report included a commandatory section urging the adoption of new safety measures.","translation":"報告書には、新しい安全対策の採用を促す推奨的なセクションが含まれていた。","type":"adjective","meaning_category":"推奨的な"},{"sentence":"The king sent a commandatory decree, entrusting the duke with the governance of the province.","translation":"王は委任状を送り、公爵に州の統治を委ねた。","type":"adjective","meaning_category":"委任的な"}]}