{"word":"patriarchism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"家父長制主義、家長主義","english_definition":"A political theory that sees the state as a family writ large, with the ruler as father.","examples":[{"sentence":"Patriarchism was a dominant ideology in many pre-modern societies.","translation":"家父長制主義は、多くの前近代社会において支配的なイデオロギーでした。"},{"sentence":"The concept of patriarchism is often associated with the divine right of kings.","translation":"家父長制主義の概念は、しばしば王権神授説と関連付けられます。"}],"collocations":["political patriarchism","social patriarchism","historical patriarchism"],"synonyms":["paternalism","autocracy","despotism"],"antonyms":["egalitarianism","matriarchy","democracy"]}],"etymology":{"value":"Derived from 'patriarch,' meaning the male head of a family or tribe, and '-ism,' denoting a belief system or ideology.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpeɪtriˈɑːrkɪzəm/","syllables":"pa-tri-ar-ki-zum"},"inflection":{"noun_plural":"patriarchisms"},"usage_notes":{"explanation":"Patriarchism is a political philosophy that argues for a hierarchical social structure where authority rests with a male figure, often seen as a 'father' figure. It's distinct from patriarchy, which is a broader sociological term referring to male dominance in society. Patriarchism specifically justifies this dominance through a familial analogy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Patriarchism is the same as patriarchy.","correct":"✓ Patriarchism is a political philosophy justifying patriarchy.","note":"Patriarchism is a justification for patriarchy, not patriarchy itself."}],"priority":"★★☆"},"related_words":{"derivatives":["patriarch","patriarchal","patriarchy"],"related_terms":["divine right of kings","feudalism","absolutism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Patriarchism' is a complex term referring to a specific political theory where the state is viewed as a large family, with the ruler as the father figure. It's often discussed in the context of historical political thought and is less commonly used in everyday conversation. Understanding it requires familiarity with political philosophy and historical contexts."},"example_sentences":[{"sentence":"Historically, patriarchism provided a justification for absolute monarchy.","translation":"歴史的に、家父長制主義は絶対君主制の正当化を提供しました。","type":"general","meaning_category":"historical context"},{"sentence":"Critics of patriarchism argue that it reinforces unequal power dynamics.","translation":"家父長制主義の批判者たちは、それが不平等な権力構造を強化すると主張します。","type":"critical","meaning_category":"criticism"}]}