{"word":"definable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"定義可能な、定義できる、明確に定義できる","english_definition":"capable of being defined; able to be clearly and precisely described or explained.","examples":[{"sentence":"The term 'art' is not easily definable.","translation":"「芸術」という用語は容易に定義できない。","note":"This sentence shows that the term is difficult to define, but not necessarily impossible."},{"sentence":"The boundaries of the property are clearly definable.","translation":"その不動産の境界は明確に定義できる。","note":"This sentence indicates that the boundaries can be defined without ambiguity."},{"sentence":"A definable goal is easier to achieve than a vague one.","translation":"定義可能な目標は、曖昧な目標よりも達成しやすい。","note":"This sentence emphasizes the importance of having a clear and measurable goal."}],"collocations":["easily definable","clearly definable","precisely definable","poorly definable","hardly definable"],"synonyms":["explicable","explainable","describable","identifiable","ascertainable"],"antonyms":["indefinable","vague","ambiguous","obscure","nebulous"]}],"etymology":{"value":"From 'define' + '-able'. 'Define' comes from Latin 'definire' (to limit, determine, explain).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈfaɪnəbəl/","syllables":"de-fin-a-ble"},"inflection":{"notes":"The comparative and superlative forms are 'more definable' and 'most definable', respectively, as it's a longer adjective."},"usage_notes":{"explanation":"'Definable' is used to describe something that can be clearly and accurately described or explained. It often implies that the subject has distinct characteristics or boundaries that can be identified. It's important in contexts where clarity and precision are needed, such as science, law, and mathematics. The opposite, 'indefinable', suggests something is too complex, abstract, or subjective to be clearly defined.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The feeling was definable, but I couldn't express it.","correct":"✓ The feeling was identifiable, but I couldn't express it.","note":"While 'definable' means capable of being defined, in this context 'identifiable' (able to be recognized) is a better fit, as the speaker recognizes the feeling but struggles to articulate its definition."},{"incorrect":"✗ The concept is definable to everyone.","correct":"✓ The concept is definable by experts. / ✓ The concept is easy to define.","note":"'Definable' describes the inherent quality of being able to be defined, not who can define it. To indicate ease of definition, use 'easy to define'."}],"priority":"★★☆"},"related_words":{"derivatives":["define (verb)","definition (noun)","definitely (adverb)","indefinable (adjective)","definiteness (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in academic and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Definable' means something can be clearly described or explained. It's used when precision is important. For example, a 'definable goal' is one that is clear and measurable. The opposite is 'indefinable', which means something is too vague or complex to be clearly described."},"example_sentences":[{"sentence":"The scientist sought to establish definable criteria for the experiment.","translation":"科学者は実験のための定義可能な基準を確立しようとした。","type":"adjective","meaning_category":"定義可能な"},{"sentence":"Although emotions are complex, some aspects are definable and measurable.","translation":"感情は複雑だが、いくつかの側面は定義可能で測定可能である。","type":"adjective","meaning_category":"定義可能な"},{"sentence":"The legal contract requires all terms to be definable and unambiguous.","translation":"その法的契約は、すべての条項が定義可能かつ明確であることを要求している。","type":"adjective","meaning_category":"定義可能な"}]}