{"word":"flush-cut","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"（切断面が）平らな、面一の、ツライチの","english_definition":"(of a cut) made so that the cut surface is level with the surrounding surface.","examples":[{"sentence":"a flush-cut saw","translation":"ツライチ鋸"},{"sentence":"The carpenter made a flush-cut to remove the excess wood.","translation":"大工は余分な木材を取り除くためにツライチカットをした。"}],"collocations":["flush-cut saw","flush-cut pliers","flush-cut blade"],"synonyms":["level","even","smooth","coplanar"],"antonyms":["protruding","uneven","raised"]},{"part_of_speech":"verb","definition":"（～を）ツライチに切る","english_definition":"to cut (something) so that the cut surface is level with the surrounding surface.","examples":[{"sentence":"Flush-cut the dowels after the glue dries.","translation":"接着剤が乾いたら、ダボをツライチに切ってください。"}],"collocations":["flush-cut the edges","flush-cut the nails"],"synonyms":["cut level","cut even","trim flush"],"antonyms":["leave protruding"]}],"etymology":{"value":"'Flush' (level, even) + 'cut' (to divide or separate with a sharp-edged instrument). The term describes a cut that results in a surface being level with an adjacent surface.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflʌʃˌkʌt/","syllables":"flush-cut"},"inflection":{"notes":"The term 'flush-cut' can function as both an adjective and a verb. As an adjective, it describes the type of cut. As a verb, it describes the action of making such a cut. It does not typically inflect for number or tense in the same way as regular nouns or verbs, but can be used in different tenses (e.g., flush-cutting, flush-cut)."},"usage_notes":{"explanation":"'Flush-cut' is a technical term primarily used in woodworking, construction, electronics, and other fields where precise cutting is required. It indicates that the cutting process aims to leave the remaining material perfectly level with the surrounding surface, without any protrusion or indentation. The term is often used to describe tools specifically designed for this type of cut, such as flush-cut saws or flush-cut pliers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I cut it flush, but it wasn't flush-cut.","correct":"✓ I cut it flush, but the cut wasn't flush. / ✓ I made a flush cut, but it wasn't perfectly flush.","note":"The term 'flush-cut' describes the *type* of cut. If the cut isn't actually level, it's not a true flush cut. You can say you *tried* to make a flush cut, but it wasn't successful."},{"incorrect":"✗ He flush-cutted the wire.","correct":"✓ He flush-cut the wire.","note":"'Flush-cut' as a verb doesn't typically take the '-ed' ending for the past tense. 'Flush-cut' remains the same in the past tense."}],"priority":"★★☆"},"related_words":{"derivatives":["flush (adjective, noun, verb)","cut (verb, noun)"],"phrasal_verbs":[],"related_terms":["coping saw","Japanese saw","dowel","trim","chamfer","bevel"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical vocabulary, not typically included in CEFR levels)","frequency_google_ngram":"Low frequency (Specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Flush-cut' is a specialized term primarily used in technical contexts, particularly woodworking, construction, and electronics. It refers to a cut that leaves the surface perfectly level with the surrounding material. Understanding this term requires familiarity with these fields and the concept of precise cutting techniques. While not part of general vocabulary, it's essential for those working in related industries.","priority":"★★☆"},"example_sentences":[{"sentence":"Use a **flush-cut** saw to trim the edge of the veneer.","translation":"ベニヤ板の端をトリミングするには、ツライチ鋸を使用してください。","type":"adjective","meaning_category":"平らな"},{"sentence":"She **flush-cut** the wires to ensure a clean connection.","translation":"彼女はきれいな接続を確保するために、ワイヤーをツライチに切った。","type":"verb","meaning_category":"ツライチに切る"},{"sentence":"The **flush-cut** finish gave the project a professional look.","translation":"ツライチ仕上げは、プロジェクトにプロフェッショナルな外観を与えた。","type":"adjective","meaning_category":"平らな"}]}