{"word":"hydrozoon","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヒドロ虫","english_definition":"A class (Hydrozoa) of relatively simple invertebrate animals of the phylum Cnidaria (formerly Coelenterata), typically having both a hydroid and medusa stage in their life cycle.","examples":[{"sentence":"Hydras and Portuguese man-of-war are examples of hydrozoans.","translation":"ヒドラやカツオノエボシはヒドロ虫の例です。"}],"collocations":["marine hydrozoon","freshwater hydrozoon"],"synonyms":["hydroid","cnidarian"],"antonyms":[]}],"etymology":{"value":"From hydro- + zoon, reflecting their aquatic nature and animal classification.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪdroʊˈzoʊən/","syllables":"hy-dro-zo-on"},"inflection":{"noun_plural":"hydrozoans"},"usage_notes":{"explanation":"The term 'hydrozoon' is primarily used in a scientific or zoological context. It refers to a specific class within the phylum Cnidaria, characterized by a life cycle that often includes both polyp (hydroid) and medusa (jellyfish-like) forms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ hydrozoan are invertebrates.","correct":"✓ Hydrozoans are invertebrates.","note":"'Hydrozoan' is a countable noun, so it needs a plural form ('hydrozoans') when referring to the class in general."}],"priority":"★★☆"},"related_words":{"derivatives":["hydrocoral","hydromedusa","hydroid"],"phylum":"Cnidaria","classes":["Anthozoa (corals and sea anemones)","Scyphozoa (true jellyfish)","Cubozoa (box jellyfish)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hydrozoon' is a technical term used in biology and zoology. It refers to a specific class of aquatic animals within the phylum Cnidaria. Understanding this term requires familiarity with basic biological classification and zoological terminology. It's not a word commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"The marine environment supports a diverse range of hydrozoans.","translation":"海洋環境は多様なヒドロ虫を支えている。","type":"noun","meaning_category":"ヒドロ虫"},{"sentence":"Some hydrozoans form colonies of specialized polyps.","translation":"一部のヒドロ虫は特殊化したポリプのコロニーを形成する。","type":"noun","meaning_category":"ヒドロ虫"}]}