{"word":"underchord","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(音楽)下属和音","english_definition":"(music) A chord whose root is a fifth below the tonic, or a fourth above it.","examples":[{"sentence":"The progression moved from the tonic to the underchord, creating a surprising harmonic shift.","translation":"その進行は主音から下属和音に移り、驚くべき和声の変化を生み出した。"}],"collocations":["tonic to underchord","underchord progression"],"synonyms":["subdominant","IV chord"],"antonyms":["dominant","V chord"]},{"part_of_speech":"noun","definition":"(音楽、まれ)低音の和音、低い和音","english_definition":"(music, rare) A chord in a low register; a chord with a low bass note.","examples":[{"sentence":"The piece featured a series of deep underchords that resonated throughout the hall.","translation":"その曲は、ホール全体に響き渡る一連の深い低音の和音を特徴としていた。"}],"collocations":["deep underchord","low underchord"],"synonyms":["bass chord","low chord"],"antonyms":["high chord","treble chord"]}],"etymology":{"value":"'Under-' (below) + 'chord'. The term reflects the chord's position in relation to the tonic in musical harmony.","priority":"★★★"},"pronunciation":{"ipa":"ˈʌndərˌkɔːrd","syllables":"un-der-chord"},"inflection":{"noun_plural":"underchords"},"usage_notes":{"explanation":"'Underchord' typically refers to the subdominant chord, which is a fundamental element in tonal music. It's less common than terms like 'subdominant' or 'IV chord', but it provides a descriptive alternative. In rare cases, it might refer to a chord with a particularly low bass note.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The underchord was played in a major key, making it sound sad.","correct":"✓ The underchord was played in a minor key, making it sound sad.","note":"Underchords, like other chords, can be major or minor. Minor keys often evoke sadness."},{"incorrect":"✗ Underchord is the same as a dominant.","correct":"✓ Underchord is the same as a subdominant.","note":"The underchord is the subdominant, not the dominant. The dominant is a fifth above the tonic."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["subdominant","tonic","dominant","chord progression","harmony","IV chord"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Underchord' is a musical term referring to the subdominant chord, which is built on the fourth degree of the scale. It's a less common term than 'subdominant' but describes the chord's position relative to the tonic (the main key of the piece). It can also, rarely, refer to a chord with a very low bass note. Understanding this term requires a basic knowledge of music theory."},"example_sentences":[{"sentence":"The composer used an unexpected underchord to create tension in the melody.","translation":"作曲家は、予期せぬ下属和音を使用して、メロディーに緊張感を生み出した。","type":"noun","meaning_category":"下属和音"},{"sentence":"The deep underchord resonated powerfully in the cathedral.","translation":"深い低音の下属和音が大聖堂に力強く響き渡った。","type":"noun","meaning_category":"低音の和音"}]}