{"word":"itemizers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(米国英語) 項目別控除を選択する納税者","english_definition":"(US English) Taxpayers who choose to itemize deductions on their tax return instead of taking the standard deduction.","examples":[{"sentence":"More taxpayers are taking the standard deduction since the tax law changes, so fewer are itemizers.","translation":"税法改正以来、標準控除を選択する納税者が増えており、項目別控除を選択する納税者は減少している。"}],"collocations":["itemize deductions","standard deduction","tax return","taxpayers"],"synonyms":["taxpayer who itemizes","deduction itemizer"],"antonyms":["standard deduction taker"]},{"part_of_speech":"noun","definition":"項目をリスト化する人、詳細に記述する人","english_definition":"Someone who lists items or details in a specific way.","examples":[{"sentence":"The accountant was a meticulous itemizer, ensuring every expense was accounted for.","translation":"その会計士は細心の注意を払って項目をリスト化し、すべての費用が説明されるようにした。"}],"collocations":["meticulous itemizer","detail-oriented","expense tracking"],"synonyms":["lister","detailer","enumerator"],"antonyms":["generalizer"]}],"etymology":{"value":"The word 'itemizers' is derived from the verb 'itemize,' which means to list or detail items. The suffix '-er' is added to indicate a person who performs the action of itemizing.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaɪtəmaɪzərz/","syllables":"I-te-mi-zers"},"inflection":{"noun_plural":"itemizers"},"usage_notes":{"explanation":"'Itemizers' primarily refers to taxpayers in the United States who choose to list individual deductions on their tax returns instead of taking the standard deduction. This is a specific term related to tax law. In a broader sense, it can also refer to someone who meticulously lists or details items in any context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The itemizers are always richer than standard deduction takers.","correct":"✓ It's not always the case that itemizers are richer than standard deduction takers; it depends on their individual circumstances.","note":"Whether someone itemizes or takes the standard deduction depends on their individual financial situation, not necessarily their overall wealth."}],"priority":"★★☆"},"related_words":{"derivatives":["itemize (verb)","itemization (noun)","item (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'itemizers' is a specialized term primarily used in the context of US tax law. It refers to taxpayers who choose to list individual deductions on their tax returns instead of taking the standard deduction. Understanding this term requires familiarity with tax concepts and terminology. Outside of the tax context, it can refer to someone who meticulously lists items, but this usage is less common."},"example_sentences":[{"sentence":"The tax advisor recommended that the client become itemizers to reduce their tax liability.","translation":"税務アドバイザーは、クライアントが税負担を軽減するために項目別控除を選択することを推奨した。","type":"noun","meaning_category":"Taxation"},{"sentence":"The meticulous itemizers in the inventory department ensured accurate records of all supplies.","translation":"在庫管理部門の細心の注意を払う項目別リスト作成者は、すべての物資の正確な記録を保証した。","type":"noun","meaning_category":"General Listing"}]}