{"word":"Commolition","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) Violent agitation; disturbance; commotion.","english_definition":"A state of violent agitation or disturbance; a commotion.","examples":[{"sentence":"The commolition in the streets made it difficult to sleep.","translation":"街の騒動でなかなか寝付けなかった。"}],"collocations":[],"synonyms":["commotion","disturbance","agitation","tumult","uproar"],"antonyms":["peace","calm","tranquility"]}],"etymology":{"value":"Derived from the Latin word 'commotio', meaning 'a moving, agitation, commotion'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒməˈlɪʃən/","syllables":"com-mo-li-tion"},"inflection":{"noun_plural":"commolitions"},"usage_notes":{"explanation":"'Commolition' is a relatively rare and somewhat archaic word. It is often used to describe a state of social or political unrest, or a significant disturbance of any kind. It is similar in meaning to 'commotion' but may imply a greater degree of violence or disorder.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The commolition was caused by the demolition of the building.","correct":"✓ The commotion was caused by the demolition of the building.","note":"'Commolition' refers to the disturbance or agitation, while 'demolition' refers to the act of tearing down a building. They are related in concept but have distinct meanings."}],"priority":"★☆☆"},"related_words":{"derivatives":["commote (verb, rare): to agitate or disturb violently"],"related_terms":["commotion","demolition"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Commolition' is a rare and advanced word that describes a state of violent disturbance or agitation. It is not commonly used in modern English, and understanding it requires a strong vocabulary. It is often found in older texts or in more formal writing. It is related to the more common word 'commotion', but implies a greater degree of intensity or violence."},"example_sentences":[{"sentence":"The unexpected announcement caused a commolition among the shareholders.","translation":"その予期せぬ発表は株主たちの間に騒動を引き起こした。","type":"noun","meaning_category":"disturbance"},{"sentence":"The commolition of the crowd made it difficult to hear the speaker.","translation":"群衆の騒ぎで講演者の声を聞き取るのが難しかった。","type":"noun","meaning_category":"agitation"}]}