{"word":"simal","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学) 地球の地殻を構成する層の一つで、主にケイ素 (silicon) とマグネシウム (magnesium) から成る層。大陸地殻の下部や海洋地殻を構成する。","english_definition":"(geology) The lower layer of the Earth's crust, consisting mainly of silicon and magnesium. It underlies the sial and forms the ocean floors.","examples":[{"sentence":"The simal is denser than the sial.","translation":"シマルはシアルよりも密度が高い。"},{"sentence":"Oceanic crust is primarily composed of simal.","translation":"海洋地殻は主にシマルで構成されている。"}],"collocations":["sial and simal","composition of simal","density of simal"],"synonyms":["oceanic crust","basaltic layer"],"antonyms":["sial"]}],"etymology":{"value":"Derived from 'si' for silicon and 'mal' for magnesium, the two main elements composing the layer.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsaɪmæl/","syllables":"si-mal"},"inflection":{"noun_plural":"simals"},"usage_notes":{"explanation":"The term 'simal' is primarily used in geology to describe the composition of a specific layer of the Earth's crust. It is often contrasted with 'sial', which is another layer richer in silicon and aluminum. The term is less commonly used in modern geology, with more precise compositional descriptions being preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The simal is on top of the sial.","correct":"✓ The simal is below the sial.","note":"Simal underlies the sial layer."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["sial","crust","mantle","lithosphere","silicon","magnesium"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Simal' is a technical term used in geology to refer to the lower layer of the Earth's crust, primarily composed of silicon and magnesium. Understanding this term requires knowledge of basic geological concepts and Earth's structure. It is not commonly used outside of geological contexts."},"example_sentences":[{"sentence":"The Mohorovičić discontinuity marks the boundary between the crust and the mantle, lying beneath the simal.","translation":"モホロビチッチ不連続面は、地殻とマントルの境界を示し、シマルの下に位置する。","type":"noun","meaning_category":"geology"},{"sentence":"Studies of seismic waves help geologists understand the properties of the simal.","translation":"地震波の研究は、地質学者がシマルの特性を理解するのに役立つ。","type":"noun","meaning_category":"geology"}]}