{"word":"carpel","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"心皮","english_definition":"The female reproductive organ of a flower, consisting of the stigma, style, and ovary. One or more carpels form a pistil.","examples":[{"sentence":"The pistil of this flower is composed of multiple fused carpels.","translation":"この花の子房は複数の心皮が融合してできています。"},{"sentence":"Each carpel contains one or more ovules.","translation":"それぞれの心皮は一つ以上の胚珠を含んでいます。"}],"collocations":["fused carpels","free carpels","apocarpous (having separate carpels)","syncarpous (having fused carpels)"],"synonyms":["pistil (when referring to the entire structure)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'karpos' meaning 'fruit'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɑːrpəl/","syllables":"car-pel"},"inflection":{"noun_plural":"carpels"},"usage_notes":{"explanation":"A carpel is a fundamental unit of the pistil, the female part of a flower. The pistil may consist of a single carpel (simple pistil) or multiple fused carpels (compound pistil). The ovary at the base of the carpel contains the ovules, which, upon fertilization, develop into seeds. The style is a stalk connecting the ovary to the stigma, which receives pollen.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The stamen is the female part of the flower; it contains the carpels.","correct":"The pistil is the female part of the flower; it contains the carpels.","note":"Stamens are the male reproductive organs of a flower, while carpels are part of the pistil, the female reproductive organ."}],"priority":"★★☆"},"related_words":{"derivatives":["apocarpous","syncarpous","pistil","ovary","stigma","style","ovule"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Carpel' is a botanical term referring to the basic structural unit of a flower's pistil, the female reproductive organ. Understanding this term requires familiarity with plant anatomy and reproductive biology. The pistil can be composed of one or more carpels, which may be free (separate) or fused. The carpel encloses the ovules, which develop into seeds after fertilization. This term is typically encountered in advanced biology courses or botanical literature."},"example_sentences":[{"sentence":"The botanist carefully examined the carpel structure to classify the plant species.","translation":"植物学者は植物の種類を分類するために心皮の構造を注意深く調べました。","type":"scientific","meaning_category":"botany"},{"sentence":"The number of carpels in a flower can be a key characteristic in plant identification.","translation":"花の中の心皮の数は、植物を識別する上で重要な特徴となることがあります。","type":"scientific","meaning_category":"botany"}]}