{"word":"sporocarpium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"胞子果、特に水生シダ類に見られる構造","english_definition":"A structure enclosing sori, especially in aquatic ferns.","examples":[{"sentence":"The sporocarpium protects the sori from desiccation.","translation":"胞子果は、乾燥から胞子嚢群を保護します。"},{"sentence":"The morphology of the sporocarpium is important for species identification.","translation":"胞子果の形態は、種の識別に重要です。"}],"collocations":["aquatic fern sporocarpium (水生シダの胞子果)","sporocarpium morphology (胞子果の形態)","sporocarpium development (胞子果の発生)"],"synonyms":["sorus","fruiting body"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'sporos' (seed) and 'karpos' (fruit), combined with the suffix '-ium' indicating a structure or part.","priority":"★★☆"},"pronunciation":{"ipa":"ˌspɔːroʊˈkɑːrpiəm","syllables":"spo-ro-car-pi-um"},"inflection":{"noun_plural":"sporocarpia or sporocarpiums"},"usage_notes":{"explanation":"The term 'sporocarpium' is primarily used in botany, specifically when discussing ferns, and most often aquatic ferns. It refers to a specialized structure that encloses and protects the sori (clusters of sporangia, which produce spores). The shape, size, and structure of the sporocarpium can be important characteristics for identifying different species of ferns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sporocarpium is a type of root.","correct":"✓ The sporocarpium is a structure enclosing sori.","note":"A sporocarpium is not a root; it is a structure that encloses sori (clusters of sporangia)."},{"incorrect":"✗ Sporocarpium are found in all plants.","correct":"✓ Sporocarpia are found in some ferns, especially aquatic ferns.","note":"Sporocarpia are not found in all plants; they are specific to certain ferns, particularly aquatic ones."}],"priority":"★★☆"},"related_words":{"derivatives":["sporocarp (shortened form)","sorus","sporangium"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'sporocarpium' is a highly specialized botanical term, primarily encountered in academic or technical literature concerning ferns, particularly aquatic ferns. Understanding requires a background in botany or plant biology. The concept involves recognizing specialized reproductive structures in plants.","priority":"★★☆"},"example_sentences":[{"sentence":"The Marsilea species is characterized by its unique sporocarpium.","translation":"マルシレア種は、その独特な胞子果によって特徴づけられます。","type":"noun","meaning_category":"botany"},{"sentence":"The sporocarpium provides a protective environment for the developing spores.","translation":"胞子果は、発達中の胞子に保護環境を提供します。","type":"noun","meaning_category":"botany"}]}