{"word":"digoxin","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"ジゴキシン (強心配糖体の一種で、心不全や不整脈の治療に用いられる薬)","english_definition":"A cardiac glycoside drug used in the treatment of heart failure and certain types of irregular heartbeats.","examples":[{"sentence":"Digoxin helps to control the heart rate in patients with atrial fibrillation.","translation":"ジゴキシンは、心房細動の患者の心拍数をコントロールするのに役立ちます。"},{"sentence":"The doctor prescribed digoxin to improve the heart's pumping ability.","translation":"医師は、心臓のポンプ機能を改善するためにジゴキシンを処方しました。"},{"sentence":"Patients taking digoxin need regular blood tests to monitor the drug's levels.","translation":"ジゴキシンを服用している患者は、薬のレベルを監視するために定期的な血液検査が必要です。"}],"collocations":["digoxin toxicity (ジゴキシン中毒)","digoxin level (ジゴキシン濃度)","prescribe digoxin (ジゴキシンを処方する)","take digoxin (ジゴキシンを服用する)","digoxin therapy (ジゴキシン療法)"],"synonyms":["Lanoxin (商品名)"],"antonyms":[]}],"etymology":{"value":"Derived from Digitalis (genus of plants from which it is extracted) + -oxin (common suffix for glycosides). Digitalis comes from Latin digitus (finger), referring to the shape of the flower.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈdʒɒksɪn/","syllables":"di-gox-in"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Digoxin is a medication used to treat heart failure and certain irregular heartbeats (arrhythmias). It works by increasing the force of the heart's contractions and slowing down the heart rate. Because digoxin can have serious side effects, including toxicity, it is important for patients taking this medication to be closely monitored by a healthcare professional. Regular blood tests are necessary to ensure that the digoxin level in the blood remains within the therapeutic range.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I take digoxin for my headache.","correct":"✓ I take digoxin for my heart failure.","note":"Digoxin is specifically used for heart conditions, not headaches."},{"incorrect":"✗ Digoxin is safe for everyone.","correct":"✓ Digoxin can have serious side effects and requires monitoring.","note":"Digoxin is not safe for everyone and needs to be prescribed and monitored by a doctor."}],"priority":"★★☆"},"related_words":{"derivatives":["digitalis (ジギタリス)","cardiac glycoside (強心配糖体)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency, primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Digoxin is a specialized term primarily encountered in medical or pharmaceutical contexts. It refers to a specific type of medication used to treat heart conditions. Understanding its function and potential side effects requires a certain level of medical knowledge. Therefore, it is more likely to be understood by healthcare professionals or individuals with a strong interest in medicine."},"example_sentences":[{"sentence":"The cardiologist recommended starting her on a low dose of digoxin.","translation":"心臓専門医は、彼女に低用量のジゴキシンから始めることを勧めました。","type":"noun","meaning_category":"medication"},{"sentence":"Symptoms of digoxin toxicity can include nausea, vomiting, and visual disturbances.","translation":"ジゴキシン中毒の症状には、吐き気、嘔吐、視覚障害などがあります。","type":"noun","meaning_category":"side effects"},{"sentence":"Digoxin is derived from the foxglove plant.","translation":"ジゴキシンは、キツネノテブクロ（フォックスグローブ）という植物から抽出されます。","type":"noun","meaning_category":"origin"}]}