{"word":"miscredit","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"誤って信用する、誤って評価する、誤った情報に基づいて信用する","english_definition":"To credit wrongly; to attribute wrongly. To believe something based on incorrect or misleading information.","examples":[{"sentence":"The historian miscredited the source of the quote, leading to inaccuracies in the book.","translation":"歴史家は引用元の出典を誤って信用したため、書籍に不正確な記述が生じた。"},{"sentence":"The company was miscredited for its success; the real innovation came from a small research team.","translation":"その会社は成功したと誤って評価された。真の革新は小規模な研究チームから生まれたものだった。"},{"sentence":"Don't miscredit rumors; always verify information before believing it.","translation":"噂を誤って信用しないでください。信じる前に必ず情報を確認してください。"}],"collocations":["miscredit a source","miscredit information","miscredit someone's work","miscredit a rumor"],"synonyms":["mistrust","disbelieve","misjudge","misinterpret","misattribute"],"antonyms":["credit","believe","trust","attribute correctly"]}],"etymology":{"value":"\"Mis-\" (wrongly) + \"credit\" (to believe or attribute).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɪsˈkrɛdɪt/","syllables":"mis-cred-it"},"inflection":{"verb_forms":{"present_simple":["miscredit","miscredits"],"past_simple":"miscredited","past_participle":"miscredited","present_participle":"miscrediting"}},"usage_notes":{"explanation":"\"Miscredit\" implies a wrong or inaccurate attribution of belief or trust. It often suggests that someone is giving credit or credence where it is not deserved or based on false information. It is less common than \"misattribute\" but carries a similar sense of incorrect assignment or belief.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I miscredited him for the crime.","correct":"✓ I wrongly accused him of the crime. / ✓ I misattributed the crime to him.","note":"\"Miscredit\" is less about accusing someone of a crime and more about wrongly believing or trusting something. Use \"wrongly accuse\" or \"misattribute\" instead."},{"incorrect":"✗ The evidence was miscredited by the jury.","correct":"✓ The evidence was misinterpreted by the jury.","note":"If the evidence was misunderstood, \"misinterpreted\" is more appropriate. \"Miscredited\" suggests the jury wrongly believed the evidence was valid."}],"priority":"★★☆"},"related_words":{"derivatives":["miscrediting","miscredited"],"related_terms":["discredit","credit","misattribute","mistrust","misbelieve"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Miscredit\" is a relatively uncommon word that means to wrongly believe or trust something, often based on incorrect information. It is used in formal contexts to describe situations where credit or belief is misplaced due to misunderstanding or misinformation. It is important to distinguish it from similar terms like \"discredit\" (to doubt or reject) and \"misattribute\" (to wrongly assign)."},"example_sentences":[{"sentence":"The journalist miscredited the anonymous source, leading to a retraction of the article.","translation":"ジャーナリストは匿名の情報源を誤って信用し、記事の撤回につながった。","type":"verb","meaning_category":"誤って信用する"},{"sentence":"The success of the project was miscredited to the CEO, when it was actually the team's hard work.","translation":"プロジェクトの成功はCEOの功績と誤って評価されたが、実際はチームの努力によるものだった。","type":"verb","meaning_category":"誤って評価する"},{"sentence":"She miscredited the rumor about the company's financial troubles, causing her to sell her stock prematurely.","translation":"彼女は会社の財政難に関する噂を誤って信用し、時期尚早に株を売ってしまった。","type":"verb","meaning_category":"誤った情報に基づいて信用する"}]}