{"word":"leptorrhiny","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"細鼻、狭鼻 (鼻の幅が狭いこと)","english_definition":"The condition of having a narrow nose.","examples":[{"sentence":"Leptorrhiny is more common in people of European descent.","translation":"細鼻はヨーロッパ系の祖先を持つ人々に多く見られます。"},{"sentence":"Anthropologists sometimes use the nasal index to classify populations, with leptorrhiny being one category.","translation":"人類学者は、鼻の指標を使って集団を分類することがあり、細鼻はそのカテゴリーの一つです。"}],"collocations":["nasal index","dolichocephaly"],"synonyms":["narrow nose"],"antonyms":["platyrrhiny"],"notes":"Often used in anthropology and physical anthropology to describe nasal morphology.","etymology":{"value":"From Greek 'leptos' (λεπτός) meaning 'thin, delicate' + 'rhis' (ῥίς) meaning 'nose' + '-ia' suffix indicating a condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɛptəˈraɪni/","syllables":"lep-to-rhi-ny"},"inflection":{"noun_plural":"leptorrhinies"},"usage_notes":{"explanation":"'Leptorrhiny' is a technical term, primarily used in anthropology and physical anthropology, to describe the characteristic of having a narrow nose. It is often contrasted with 'platyrrhiny,' which describes a broad, flat nose. The term is rarely used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor diagnosed him with leptorrhiny.","correct":"✓ The anthropologist classified him as having leptorrhiny.","note":"'Leptorrhiny' is a descriptive term, not a diagnosis. It's used for classification in anthropology, not typically in medical contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["leptorrhine (adjective: having a narrow nose)","platyrrhiny (noun: broad-nosedness; antonym)","mesorrhiny (noun: intermediate nasal width)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (highly specialized term)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Leptorrhiny' is a highly specialized term primarily used in the fields of anthropology and physical anthropology. It describes the characteristic of having a narrow nose and is used in the classification of human populations based on nasal morphology. Due to its technical nature and limited use outside of these specific fields, it is considered a high-level vocabulary word. Understanding requires familiarity with anthropological terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The skull exhibited characteristics of leptorrhiny, indicating possible European ancestry.","translation":"その頭蓋骨は細鼻の特徴を示しており、ヨーロッパ系の祖先を持つ可能性を示唆していました。","type":"descriptive","meaning_category":"narrow nose"},{"sentence":"The nasal index, calculated from measurements of the skull, confirmed the presence of leptorrhiny.","translation":"頭蓋骨の測定値から計算された鼻の指標は、細鼻の存在を確認しました。","type":"scientific","meaning_category":"narrow nose"}]}]}