{"word":"Cunjah","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(Jamaican slang) a skillful ganja roller; a person who is adept at rolling cannabis cigarettes (spliffs).","english_definition":"A person skilled at rolling marijuana cigarettes.","examples":[{"sentence":"Ask Ras Bobo; he's a real Cunjah, he can roll the perfect spliff every time.","translation":"ラス・ボボに聞いてみな。彼は本物のCunjahだ。いつも完璧なスプリフを巻けるんだ。"},{"sentence":"Only a true Cunjah can roll a chalice like that.","translation":"真のCunjahだけがあのようなチャリスを巻けるのだ。"}],"collocations":["roll a cunjah","true cunjah","real cunjah"],"synonyms":["spliff roller","ganja roller","weed roller"],"antonyms":[]}],"etymology":{"value":"Likely a Jamaican patois word with possible roots in African languages, but the exact origin is uncertain. It is associated with the Rastafarian culture and the use of ganja (marijuana) for spiritual and medicinal purposes.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌndʒɑː/","syllables":"Cun-jah"},"inflection":{"notes":"Singular noun. Plural form is likely 'Cunjahs', but the singular form is more commonly used."},"usage_notes":{"explanation":"'Cunjah' is a slang term primarily used in Jamaican Patois and within Rastafarian culture. It specifically refers to someone highly skilled in the art of rolling ganja (marijuana) into spliffs or other smoking devices. The term carries a connotation of respect for the skill and artistry involved.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a cunjah of cars.","correct":"✓ He's a skilled mechanic.","note":"'Cunjah' specifically refers to someone skilled at rolling marijuana. It cannot be used for other skills."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["ganja","spliff","chalice","Rastafarian","irie"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency - Primarily used within specific subcultures.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cunjah' is a highly specialized slang term originating from Jamaican Patois and Rastafarian culture. Its use is limited to contexts where cannabis use and Rastafarian traditions are understood. Due to its cultural specificity and slang nature, it is not appropriate for general use and requires a high level of cultural understanding to use correctly."},"example_sentences":[{"sentence":"The elders recognized him as a Cunjah for the way he prepared the herb.","translation":"長老たちは、彼がハーブを準備する方法を見て、彼をCunjahだと認めた。","type":"noun","meaning_category":"skillful ganja roller"},{"sentence":"A true Cunjah knows the best way to mix tobacco and ganja in a spliff.","translation":"真のCunjahは、スプリフの中でタバコとガンジャを混ぜる最良の方法を知っている。","type":"noun","meaning_category":"skillful ganja roller"}]}