{"word":"coracoacromial","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"烏口肩峰の","english_definition":"Relating to both the coracoid process and the acromion of the scapula.","examples":[{"sentence":"The coracoacromial ligament connects the coracoid process to the acromion.","translation":"烏口肩峰靭帯は烏口突起と肩峰を繋いでいる。"},{"sentence":"Coracoacromial arch impingement can cause shoulder pain.","translation":"烏口肩峰アーチのインピンジメントは肩の痛みを引き起こす可能性がある。"}],"collocations":["coracoacromial ligament","coracoacromial arch","coracoacromial space"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'coracoid' (referring to the coracoid process of the scapula), 'acromion' (referring to the acromion of the scapula), and the suffix '-al' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɔːrəkəʊəˈkroʊmiəl/","syllables":"co-ra-co-a-cro-mi-al"},"inflection":{},"usage_notes":{"explanation":"The term 'coracoacromial' is primarily used in anatomical and medical contexts to describe structures or conditions related to both the coracoid process and the acromion of the scapula (shoulder blade). It is often used to describe the coracoacromial ligament or the coracoacromial arch, which are important structures in the shoulder joint.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["coracoid","acromion"],"related_terms":["scapula","shoulder","ligament","arch"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical and anatomical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'coracoacromial' is a specialized anatomical term used in medical and scientific contexts. It refers to structures or conditions that relate to both the coracoid process and the acromion of the scapula. Due to its specific and technical nature, it is not commonly used in everyday language and is primarily encountered in medical or anatomical discussions. Understanding the term requires knowledge of basic shoulder anatomy.","target_audience":"Medical professionals, anatomy students, and those studying related fields."},"example_sentences":[{"sentence":"The **coracoacromial** ligament was found to be thickened during the surgery.","translation":"手術中に烏口肩峰靭帯が肥厚していることがわかった。","type":"adjective","meaning_category":"Anatomical"},{"sentence":"Surgical release of the **coracoacromial** ligament is sometimes performed to treat shoulder impingement.","translation":"肩のインピンジメントを治療するために、烏口肩峰靭帯の手術的切離術が時々行われる。","type":"adjective","meaning_category":"Medical"}]}