{"word":"geostrophic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"地衡の、地衡流の","english_definition":"Relating to or denoting a current or wind in which the Coriolis force and the pressure gradient are in balance.","examples":[{"sentence":"The geostrophic wind is a theoretical wind that results from the balance between the Coriolis effect and the pressure gradient force.","translation":"地衡風は、コリオリ力と気圧傾度力のバランスから生じる理論的な風です。"},{"sentence":"Geostrophic currents are important in ocean circulation.","translation":"地衡流は海洋循環において重要です。"}],"collocations":["geostrophic wind","geostrophic current","geostrophic balance","geostrophic flow","geostrophic approximation"],"synonyms":["gradient wind"],"antonyms":[]}],"etymology":{"value":"The term 'geostrophic' is derived from the Greek words 'geo' (earth) and 'strophe' (turning). It refers to the balance of forces that causes the turning motion of winds and currents due to the Earth's rotation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒiːoʊˈstrɒfɪk/","syllables":"ge-o-stro-phic"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Geostrophic' is a term primarily used in meteorology and oceanography to describe a state of balance between the Coriolis force (caused by the Earth's rotation) and the pressure gradient force. This balance results in winds and currents that flow parallel to isobars (lines of constant pressure) or isopycnals (lines of constant density). The geostrophic approximation is a simplification that neglects other forces such as friction and is often used to understand large-scale atmospheric and oceanic movements.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The geotropic wind is similar to geostrophic wind.","correct":"✓ The geostrophic wind is influenced by the Coriolis effect.","note":"Geotropic refers to growth or movement of a plant in response to gravity, while geostrophic refers to the balance of forces affecting winds and currents."}],"priority":"★☆☆"},"related_words":{"derivatives":["geostrophy (noun): The state of geostrophic balance.","ageostrophic (adjective): Not geostrophic; deviating from geostrophic balance."],"related_terms":["Coriolis effect","pressure gradient force","isobar","isopycnal"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'geostrophic' is a specialized term used in the fields of meteorology and oceanography. It describes a state of equilibrium where the Coriolis force and the pressure gradient force are balanced. This balance is crucial for understanding large-scale movements in the atmosphere and oceans. The concept involves understanding the interplay of physical forces on a rotating planet, making it an advanced topic.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **geostrophic** wind flows parallel to the isobars.","translation":"地衡風は等圧線に平行に流れます。","type":"adjective","meaning_category":"地衡風"},{"sentence":"**Geostrophic** currents play a significant role in the redistribution of heat in the oceans.","translation":"地衡流は海洋における熱の再分配に重要な役割を果たします。","type":"adjective","meaning_category":"地衡流"},{"sentence":"The **geostrophic** approximation simplifies the equations of motion in fluid dynamics.","translation":"地衡近似は流体運動力学における運動方程式を単純化します。","type":"adjective","meaning_category":"地衡近似"}]}