{"word":"alpenstock","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アルペンストック（登山杖）","english_definition":"A long staff with an iron point, used by mountain climbers.","examples":[{"sentence":"He used an alpenstock to help him climb the steep slope.","translation":"彼は急な斜面を登るのにアルペンストックを使った。"},{"sentence":"The alpenstock provided stability on the icy trail.","translation":"アルペンストックは凍った道で安定性をもたらした。"}],"collocations":["use an alpenstock","carry an alpenstock","sturdy alpenstock","traditional alpenstock"],"synonyms":["walking stick","hiking staff","trekking pole"],"antonyms":[]}],"etymology":{"value":"From German Alpenstock, from Alpen (Alps) + Stock (stick).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈælpənstɒk/","syllables":"al-pen-stock"},"inflection":{"noun_plural":"alpenstocks"},"usage_notes":{"explanation":"An alpenstock is a traditional tool used in mountaineering, especially in the Alps. It is a long, sturdy staff, typically made of wood, with a metal tip for added grip. While modern trekking poles are more common today, alpenstocks are still used by some climbers and hikers, particularly in historical contexts or for traditional mountaineering.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a trekking pole, which is an alpenstock.","correct":"✓ He used a trekking pole, similar to an alpenstock.","note":"While both are used for hiking, an alpenstock is a specific type of long staff, often wooden, while trekking poles are usually lighter and adjustable. They are similar but not identical."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["trekking pole","ice axe","crampons"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'alpenstock' is a specialized term related to mountaineering. It refers to a specific type of long staff used for support and balance while hiking or climbing in mountainous regions, particularly the Alps. Because it's a niche term, it's not commonly used in everyday conversation and is more likely to be encountered in literature or discussions about mountaineering history and equipment."},"example_sentences":[{"sentence":"The old mountaineer still preferred his trusty alpenstock over modern trekking poles.","translation":"その年老いた登山家は、現代的なトレッキングポールよりも、いまだに信頼できるアルペンストックを好んだ。","type":"noun","meaning_category":"登山杖"},{"sentence":"With his alpenstock firmly planted, he navigated the rocky terrain.","translation":"彼はアルペンストックをしっかりと地面に突き立て、岩だらけの地形を進んだ。","type":"noun","meaning_category":"登山杖"}]}