{"word":"exuberancy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(活力・熱意などの)有り余るばかりの状態、旺盛、豊富","english_definition":"the quality of being full of energy, excitement, and cheerfulness; ebullience.","examples":[{"sentence":"Her exuberancy was infectious, filling the room with laughter.","translation":"彼女の有り余る活力は伝染し、部屋を笑いで満たした。"},{"sentence":"The exuberancy of youth is often tempered by the realities of adulthood.","translation":"若さの旺盛さは、しばしば大人の現実によって和らげられる。"},{"sentence":"The garden was a riot of color, reflecting the exuberancy of nature.","translation":"庭は色彩の奔流で、自然の豊かさを反映していた。"}],"collocations":["youthful exuberancy (若々しい活力)","natural exuberancy (自然の豊かさ)","overflowing with exuberancy (活力に満ち溢れている)","exuberancy of spirit (精神の旺盛さ)","show exuberancy (活力を示す)"],"synonyms":["ebullience","vivacity","enthusiasm","vitality","effervescence","liveliness","zest","animation","high spirits","joie de vivre"],"antonyms":["apathy","lethargy","listlessness","depression","subduedness","restraint"]},{"part_of_speech":"noun","definition":"(植物の)繁茂、旺盛な成長","english_definition":"the state of growing strongly and healthily; luxuriance.","examples":[{"sentence":"The exuberancy of the tropical vegetation was breathtaking.","translation":"熱帯植物の繁茂ぶりは息をのむほどだった。"},{"sentence":"The flowers displayed an exuberancy of color and form.","translation":"花々は色彩と形の旺盛な成長を見せていた。"}],"collocations":["vegetative exuberancy (植物の繁茂)","tropical exuberancy (熱帯の繁茂)"],"synonyms":["luxuriance","profusion","abundance","lushness","rankness","vigour","flourishing"],"antonyms":["scarcity","sparseness","meagerness","barrenness"]}],"etymology":{"value":"Late Latin *exuberantia*, from Latin *exuberare* 'to be very abundant or copious,' from *ex-* 'out' + *uber* 'udder, fertile, abundant'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪɡˈzuːbərənsi/","syllables":"ex-u-ber-an-cy"},"inflection":{"notes":"This is a noun, so it primarily exists in singular form. The plural form, 'exuberancies,' is rare and usually refers to multiple instances or types of exuberance."},"usage_notes":{"explanation":"'Exuberancy' describes a state of overflowing energy, enthusiasm, or growth. It can apply to people, describing their lively and cheerful nature, or to plants, describing their lush and abundant growth. It often suggests a sense of unrestrained or unrestrainable vitality.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She has a lot of exuberance for her new job.","correct":"✓ She has a lot of enthusiasm for her new job.","note":"While 'exuberance' and 'enthusiasm' are similar, 'exuberance' implies a more overflowing and unrestrained energy. 'Enthusiasm' is often more appropriate for describing passion for a specific activity or object."},{"incorrect":"✗ The exuberancy of the forest made it difficult to navigate.","correct":"✓ The density of the forest made it difficult to navigate.","note":"'Exuberancy' refers to the abundant growth, but 'density' more directly describes how closely packed the vegetation is, which is what makes navigation difficult."}],"priority":"★★☆"},"related_words":{"derivatives":["exuberant (adjective)","exuberantly (adverb)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, more common in formal writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Exuberancy' is a more advanced word that describes a state of being full of energy, excitement, and good cheer, or the lush growth of plants. It's not a word you'll hear in everyday conversation very often, but you might encounter it in more formal writing or when someone is trying to express a strong sense of vitality or abundance. Think of it as a step up from words like 'enthusiasm' or 'liveliness'."},"example_sentences":[{"sentence":"The team celebrated their victory with unrestrained exuberancy.","translation":"チームは勝利を抑制のきかない活力で祝った。","type":"general","meaning_category":"旺盛な活力"},{"sentence":"The exuberancy of the rainforest is essential for maintaining global biodiversity.","translation":"熱帯雨林の繁茂は、地球の生物多様性を維持するために不可欠である。","type":"general","meaning_category":"植物の繁茂"},{"sentence":"His exuberancy made him a popular and engaging speaker.","translation":"彼の旺盛な活力は、彼を人気があり魅力的な講演者にした。","type":"general","meaning_category":"旺盛な活力"},{"sentence":"The exuberancy of her personality shone through in every performance.","translation":"彼女の性格の旺盛さは、あらゆるパフォーマンスで輝きを放った。","type":"general","meaning_category":"旺盛な活力"}]}