{"word":"pancratiastic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"古代ギリシアのパンクラチオン（格闘技）に関する、またはそれに適した","english_definition":"Of or pertaining to the pancratium, an athletic contest of the ancient Greeks combining boxing and wrestling; suitable for the pancratium.","examples":[{"sentence":"The pancratiastic events were a highlight of the ancient Olympic games.","translation":"古代オリンピック大会では、パンクラチオン競技が目玉の一つでした。"},{"sentence":"He developed a pancratiastic style of fighting that incorporated both striking and grappling techniques.","translation":"彼は打撃と組み技の両方を取り入れたパンクラチオン様式の格闘スタイルを開発しました。"}],"collocations":["pancratiastic contest","pancratiastic style","pancratiastic skills"],"synonyms":["athletic","combative","pugilistic","wrestling"],"antonyms":["non-athletic","peaceful"]}],"etymology":{"value":"Derived from the Greek word \"pankration\" (παγκράτιον), meaning \"all-strength\" or \"all-power,\" combined with the suffix \"-astic,\" indicating relation or suitability.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpæŋkrəˈtɪæstɪk/","syllables":"pan-cra-ti-as-tic"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term \"pancratiastic\" is primarily used in historical or academic contexts when discussing the ancient Greek sport of pankration. It describes something related to or suitable for this specific athletic event, which combined elements of boxing and wrestling. It is not commonly used in modern, everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a pancratiastic breakfast.","correct":"✓ He had a hearty breakfast.","note":"\"Pancratiastic\" refers to the ancient Greek sport, not to the size or nature of a meal."},{"incorrect":"✗ The pancratiastic music played during the ceremony.","correct":"✓ The athletic music played during the ceremony.","note":"\"Pancratiastic\" relates to the sport, not to music. Use \"athletic\" or another descriptive adjective instead."}],"priority":"★★☆"},"related_words":{"derivatives":["pankration (noun): an athletic contest of the ancient Greeks combining boxing and wrestling"],"phrases":["pancratiastic combat","pancratiastic training"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare; not included in CEFR vocabulary lists)","frequency_google_ngram":"Extremely rare; usage is almost exclusively limited to academic or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pancratiastic\" is a highly specialized term primarily used in historical or academic discussions related to the ancient Greek sport of pankration. Due to its limited usage and specific context, it is considered a high-level vocabulary word. Understanding requires familiarity with ancient Greek history and athletic contests."},"example_sentences":[{"sentence":"The museum exhibit featured artifacts related to pancratiastic competitions.","translation":"博物館の展示では、パンクラチオン競技に関連する工芸品が展示されていました。","type":"adjective","meaning_category":"パンクラチオンに関する"},{"sentence":"His pancratiastic training regimen prepared him for the rigors of mixed martial arts.","translation":"彼のパンクラチオン式のトレーニング計画は、彼を総合格闘技の過酷さに備えさせました。","type":"adjective","meaning_category":"パンクラチオンに適した"}]}