{"word":"Lipometabolism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脂質代謝","english_definition":"The metabolic processes involving lipids (fats), including their synthesis, breakdown, transport, and utilization in the body.","examples":[{"sentence":"Lipometabolism is crucial for energy production and storage.","translation":"脂質代謝は、エネルギーの産生と貯蔵に不可欠です。"},{"sentence":"Disorders in lipometabolism can lead to various health problems.","translation":"脂質代謝の障害は、さまざまな健康問題を引き起こす可能性があります。"}],"collocations":["disorders of lipometabolism (脂質代謝異常)","regulation of lipometabolism (脂質代謝の調節)","role of lipometabolism (脂質代謝の役割)"],"synonyms":["fat metabolism","lipid metabolism"],"antonyms":[]}],"etymology":{"value":"Derived from 'lipo-' (prefix denoting fat or lipids) + 'metabolism' (the sum of chemical processes occurring within a living organism).","priority":"★★★"},"pronunciation":{"ipa":"/ˌlɪpoʊməˈtæbəlɪzəm/","syllables":"li-po-me-tab-o-lism"},"inflection":{"noun_plural":"lipometabolisms"},"usage_notes":{"explanation":"Lipometabolism refers to the complex biochemical pathways that handle lipids within an organism. This includes processes such as lipogenesis (fat synthesis), lipolysis (fat breakdown), beta-oxidation (fatty acid oxidation), and the transport of lipids via lipoproteins.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Lipometabolism is the same as carbohydrate metabolism.","correct":"✓ Lipometabolism is distinct from carbohydrate metabolism, focusing specifically on lipids.","note":"Lipometabolism specifically concerns lipids, while carbohydrate metabolism involves carbohydrates. They are separate but interconnected metabolic pathways."}],"priority":"★★☆"},"related_words":{"derivatives":["lipometabolic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Lipometabolism is a technical term used in biology and medicine to describe the metabolic processes involving lipids (fats). It is a complex topic that involves the synthesis, breakdown, transport, and utilization of fats in the body. Understanding lipometabolism is important for understanding various health conditions related to lipid imbalances.","priority":"★★☆"},"example_sentences":[{"sentence":"The study investigated the effects of exercise on lipometabolism.","translation":"その研究は、運動が脂質代謝に及ぼす影響を調査しました。","type":"general","meaning_category":"脂質代謝"},{"sentence":"Genetic factors can significantly influence lipometabolism.","translation":"遺伝的要因は脂質代謝に大きな影響を与える可能性があります。","type":"general","meaning_category":"脂質代謝"},{"sentence":"Insulin plays a key role in the regulation of lipometabolism.","translation":"インスリンは脂質代謝の調節において重要な役割を果たします。","type":"general","meaning_category":"脂質代謝"}]}