{"word":"citator","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)先行判例索引、判例検索システム","english_definition":"A tool used in legal research to track the history of a case and its treatment by subsequent cases and other legal authorities.","examples":[{"sentence":"Use a citator to determine if the case is still good law.","translation":"その判例が現在も有効かどうかを判断するために、先行判例索引を使用してください。"},{"sentence":"The citator provides a list of cases that have cited the original case.","translation":"その先行判例索引は、元の判例を引用した判例の一覧を提供します。"}],"collocations":["legal citator","case citator","online citator","Shepard's Citations","KeyCite"],"synonyms":["case law index","legal research tool"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'cite,' with the suffix '-ator' indicating an agent or instrument.","priority":"★★☆"},"pronunciation":{"ipa":"ˈsaɪteɪtər","syllables":"ci-ta-tor"},"inflection":{"noun_plural":"citators"},"usage_notes":{"explanation":"A citator is an essential tool for legal research. It allows researchers to determine whether a case is still considered good law (i.e., whether it has been overturned or questioned by subsequent cases). It also provides references to other cases and legal materials that have cited the case, allowing researchers to find additional relevant authorities. Shepard's Citations and KeyCite are well-known examples of citators.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a citation to find the case.","correct":"✓ I used a citator to find the case.","note":"A 'citation' is the reference to a legal authority, while a 'citator' is the tool used to find information about that authority."}],"priority":"★★☆"},"related_words":{"derivatives":["cite","citation","citing"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'citator' is a specialized legal term. It refers to a tool used by legal professionals to trace the history and validity of legal cases. Understanding this term requires familiarity with legal research practices."},"example_sentences":[{"sentence":"The lawyer consulted the citator to ensure the precedent was still valid.","translation":"弁護士は、判例がまだ有効であることを確認するために、先行判例索引を参照した。","type":"noun","meaning_category":"legal research"},{"sentence":"The online citator provided a comprehensive overview of the case's subsequent history.","translation":"オンラインの先行判例索引は、その判例のその後の経緯の包括的な概要を提供した。","type":"noun","meaning_category":"legal research"}]}