{"word":"adeemed","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"(法律) (遺贈が)消滅した、無効になった","english_definition":"(of a bequest or legacy) failed because the property has been disposed of or is no longer in the testator's possession at the time of death.","examples":[{"sentence":"The specific bequest of the antique car was adeemed when the testator sold it before his death.","translation":"そのアンティークカーの特定遺贈は、遺言者が死亡前にそれを売却したため、消滅した。"},{"sentence":"Because the shares of stock were sold before the testator's death, the bequest was adeemed.","translation":"株式が遺言者の死亡前に売却されたため、その遺贈は消滅した。"}],"collocations":["be adeemed","specific legacy is adeemed","ademption by extinction","ademption by satisfaction"],"synonyms":["extinguished","revoked","lapsed","nullified","invalidated"],"antonyms":["vested","valid","subsisting"]}],"etymology":{"value":"From Middle English ademe, from Anglo-Norman ademer, from Old French adesmer, from a- + desmer, from des- + esmer (“to estimate, value”), from Latin aestimare (“to value”).","priority":"★★☆"},"pronunciation":{"ipa":"/əˈdiːmd/","syllables":"a-deemed"},"inflection":{"verb_forms":{"present_simple":["adeem","adeems"],"past_simple":"adeemed","past_participle":"adeemed","present_participle":"adeeming"}},"usage_notes":{"explanation":"'Adeemed' is a legal term specifically related to wills and estates. It describes the situation where a specific item or property that was intended to be given to someone in a will is no longer part of the estate at the time of the testator's death. This usually happens because the testator sold, gave away, or destroyed the item before they died. As a result, the intended beneficiary does not receive that specific item, and usually, they do not receive anything in its place. There are different types of ademption, such as ademption by extinction (the item no longer exists) and ademption by satisfaction (the beneficiary has already received the gift during the testator's lifetime).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inheritance was adeemed because it was unfair.","correct":"✓ The inheritance was adeemed because the property was sold before death.","note":"Ademption occurs due to the specific property no longer being in the estate, not because of fairness issues."},{"incorrect":"✗ The will was adeemed.","correct":"✓ The specific bequest was adeemed.","note":"It is the specific bequest or legacy that is adeemed, not the entire will."}],"priority":"★★☆"},"related_words":{"derivatives":["ademption (noun)"],"phrasal_verbs":[],"legal_terms":["bequest","legacy","testator","will","estate","devise"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Specialized legal term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Adeemed' is a technical legal term that you will only encounter in the context of wills, estates, and inheritance law. It refers to a situation where a specific gift (bequest or legacy) mentioned in a will cannot be given to the intended beneficiary because the property no longer exists in the testator's estate at the time of their death. Understanding this term requires familiarity with legal concepts and terminology related to estate planning and probate. It's not a word used in everyday conversation."},"example_sentences":[{"sentence":"The antique clock specifically mentioned in the will was adeemed because the testator had sold it years before his death.","translation":"遺言に具体的に記載されていたアンティークの時計は、遺言者が亡くなる数年前に売却していたため、消滅した。","type":"verb","meaning_category":"消滅した"},{"sentence":"Due to the ademption of the property, the beneficiary received nothing in its place.","translation":"財産の消滅により、受益者はその代わりとして何も受け取らなかった。","type":"verb (passive)","meaning_category":"無効になった"},{"sentence":"The court determined that the gift was adeemed by extinction when the house was destroyed in a fire.","translation":"裁判所は、家が火災で焼失したため、その贈与は消滅により無効になったと判断した。","type":"verb (passive)","meaning_category":"消滅した"}]}