{"word":"acetylic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アセチル基を含む、またはアセチル基に由来する","english_definition":"Relating to or derived from the acetyl group.","examples":[{"sentence":"Acetylic compounds are important in organic chemistry.","translation":"アセチル化合物は有機化学において重要である。"}],"collocations":["acetylic acid","acetylic derivative"],"synonyms":["acetylated"],"antonyms":[]}],"etymology":{"value":"Formed from 'acetyl' (referring to the acetyl group) and the suffix '-ic' (denoting relationship or derivation).","priority":"★★★"},"pronunciation":{"ipa":"/əˌsɛtɪˈlɪk/","syllables":"a-cet-yl-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative forms, which are not common for this word."},"usage_notes":{"explanation":"'Acetylic' is a technical term primarily used in chemistry. It describes substances or compounds that contain or are related to the acetyl group (CH3CO-). Its usage is confined to scientific or technical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The food had an acetylic taste.","correct":"✓ The food had a vinegary or acidic taste.","note":"'Acetylic' refers to a chemical property, not a taste. Use descriptive terms like 'vinegary' or 'acidic' for taste. "},{"incorrect":"✗ Acetylic is a type of metal.","correct":"✓ Acetyl is a chemical group.","note":"'Acetylic' describes a chemical property or compound related to the acetyl group, which is not a metal."}],"priority":"★★☆"},"related_words":{"derivatives":["acetyl (noun: the acetyl group)","acetylation (noun: the process of introducing an acetyl group into a molecule)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily found in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Acetylic' is a highly specialized term used almost exclusively within the field of chemistry. It describes the properties or characteristics of compounds related to the acetyl group. Due to its technical nature, it is unlikely to be encountered outside of scientific contexts. Understanding requires a background in organic chemistry."},"example_sentences":[{"sentence":"The acetylic derivative showed enhanced reactivity.","translation":"そのアセチル誘導体は反応性が向上していることを示した。","type":"adjective","meaning_category":"chemical property"},{"sentence":"Acetylic modifications are crucial in many biological processes.","translation":"アセチル修飾は多くの生物学的プロセスにおいて重要である。","type":"adjective","meaning_category":"chemical property"}]}