{"word":"philanthropise","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"慈善活動を行う、博愛主義を実践する","english_definition":"to engage in philanthropy; to do charitable work.","examples":[{"sentence":"She decided to philanthropise by donating a large sum to the local hospital.","translation":"彼女は地元の病院に多額の寄付をすることで慈善活動を行うことに決めた。"},{"sentence":"He philanthropised throughout his life, supporting various educational causes.","translation":"彼は生涯を通じて慈善活動を行い、様々な教育関連の活動を支援した。"}],"collocations":["philanthropise by donating","philanthropise through volunteering"],"synonyms":["donate","contribute","give","aid","assist","support","do good"],"antonyms":["hoard","withhold","be miserly"]},{"part_of_speech":"verb","transitivity":"vt","definition":"慈善活動を通じて～を支援する、博愛主義的に～を援助する","english_definition":"to support or assist (something) through philanthropy.","examples":[{"sentence":"The foundation aims to philanthropise education in developing countries.","translation":"その財団は発展途上国の教育を慈善活動を通じて支援することを目指している。"},{"sentence":"He used his wealth to philanthropise the arts, ensuring their survival for future generations.","translation":"彼は自分の富を使って芸術を博愛主義的に援助し、将来の世代のために芸術が存続することを保証した。"}],"collocations":["philanthropise education","philanthropise the arts","philanthropise research"],"synonyms":["fund","subsidize","sponsor","back","promote","champion"],"antonyms":["defund","undermine","hinder","oppose"]}],"etymology":{"value":"Derived from 'philanthropy' + '-ise' (suffix used to form verbs). 'Philanthropy' comes from Greek 'philanthrōpia', meaning 'love of mankind' (from 'philos' meaning 'loving' + 'anthrōpos' meaning 'man, human being').","priority":"★★☆"},"pronunciation":{"ipa":"/fɪˈlænθrəpaɪz/","syllables":"phi-lan-thro-pise"},"inflection":{"verb_forms":{"present_simple":["philanthropise","philanthropises"],"past_simple":"philanthropised","past_participle":"philanthropised","present_participle":"philanthropising"}},"usage_notes":{"explanation":"'Philanthropise' is a verb that means to engage in philanthropic activities, which involve donating money, time, or resources to charitable causes. It can be used intransitively (without a direct object) to describe the act of doing charitable work in general, or transitively (with a direct object) to describe the act of supporting a specific cause or organization through philanthropy. It is a less common word than 'donate' or 'give', but it provides a more specific and formal way to describe charitable actions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a philanthropising person.","correct":"✓ He is a philanthropic person. / ✓ He is a philanthropist.","note":"The adjective form is 'philanthropic', and the noun form (person who does philanthropy) is 'philanthropist'. 'Philanthropising' is the present participle of the verb 'philanthropise'."},{"incorrect":"✗ She philanthropises to the poor.","correct":"✓ She philanthropises by helping the poor. / ✓ She donates to the poor.","note":"'Philanthropise' describes the act of doing philanthropy in general. To specify who or what is being helped, use 'by' + gerund or a more common verb like 'donate' or 'help'."}],"priority":"★★☆"},"related_words":{"derivatives":["philanthropy (noun: the desire to promote the welfare of others, expressed especially by the generous donation of money to good causes.)","philanthropic (adjective: seeking to promote the welfare of others; charitable; generous.)","philanthropist (noun: a person who seeks to promote the welfare of others, especially by donating money to good causes.)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Philanthropise' is a relatively uncommon and formal verb that means to engage in philanthropy, which is the act of giving money, time, or resources to charitable causes. It is often used in the context of wealthy individuals or organizations who are actively involved in supporting various social or humanitarian efforts. The word is derived from 'philanthropy', which comes from Greek roots meaning 'love of mankind'. Understanding this word requires a good grasp of vocabulary related to charity, generosity, and social responsibility."},"example_sentences":[{"sentence":"Many wealthy individuals choose to philanthropise by establishing charitable foundations.","translation":"多くの富裕層は慈善財団を設立することで慈善活動を行うことを選択する。","type":"verb (vi)","meaning_category":"慈善活動を行う"},{"sentence":"The organization aims to philanthropise scientific research in the field of renewable energy.","translation":"その組織は再生可能エネルギー分野の科学研究を慈善活動を通じて支援することを目指している。","type":"verb (vt)","meaning_category":"慈善活動を通じて～を支援する"},{"sentence":"He decided to philanthropise his alma mater by funding a new scholarship program.","translation":"彼は母校に新しい奨学金プログラムを資金提供することで慈善活動を行うことに決めた。","type":"verb (vt)","meaning_category":"慈善活動を通じて～を支援する"},{"sentence":"By establishing a trust, she was able to philanthropise throughout her retirement years.","translation":"信託を設立することで、彼女は引退後の年月を通じて慈善活動を行うことができた。","type":"verb (vi)","meaning_category":"慈善活動を行う"}]}