{"word":"cosmetician","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"美容師、エステティシャン、化粧品販売員","english_definition":"A person skilled in giving cosmetic treatments, such as facials, manicures, and applying makeup.","examples":[{"sentence":"The cosmetician gave her a facial and applied makeup for the wedding.","translation":"美容師は彼女にフェイシャルを施し、結婚式のためにメイクをした。"},{"sentence":"She works as a cosmetician at a local salon.","translation":"彼女は地元のサロンで美容師として働いている。"},{"sentence":"The cosmetician recommended a new skincare routine.","translation":"美容師は新しいスキンケアルーチンを勧めた。"}],"collocations":["licensed cosmetician (資格のある美容師)","professional cosmetician (プロの美容師)","consult with a cosmetician (美容師に相談する)","hire a cosmetician (美容師を雇う)"],"synonyms":["beautician","esthetician","makeup artist","cosmetologist"],"antonyms":[]}],"etymology":{"value":"The word \"cosmetician\" comes from \"cosmetic,\" which is derived from the Greek word \"kosmētikos,\" meaning \"skilled in adornment.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒzməˈtɪʃən/","syllables":"cos-me-ti-cian"},"inflection":{"noun_plural":"cosmeticians"},"usage_notes":{"explanation":"A cosmetician is a professional who provides cosmetic treatments to clients. This can include skincare, makeup application, hair removal, and other beauty services. The term is often used interchangeably with \"beautician\" or \"esthetician,\" although there may be slight differences in the specific services offered. In some regions, cosmeticians are required to be licensed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a cosmetic.","correct":"✓ She is a cosmetician.","note":"\"Cosmetic\" is an adjective or a noun referring to makeup or beauty products, while \"cosmetician\" is a person who provides beauty services."},{"incorrect":"✗ I need to go to the cosmetic for a haircut.","correct":"✓ I need to go to the hairdresser/hair stylist for a haircut.","note":"Cosmeticians generally do not cut hair. Haircuts are typically done by hairdressers or hair stylists."}],"priority":"★★☆"},"related_words":{"derivatives":["cosmetic (adjective, noun)","cosmetology (noun)","cosmetological (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"cosmetician\" refers to a person who is trained and skilled in providing cosmetic treatments. They might work in a salon, spa, or department store, offering services like facials, makeup application, and skincare advice. It's important to distinguish this word from \"cosmetic,\" which refers to the products they use."},"example_sentences":[{"sentence":"The **cosmetician** helped me choose the right foundation for my skin type.","translation":"美容師は私の肌のタイプに合ったファンデーションを選ぶのを手伝ってくれた。","type":"noun","meaning_category":"美容師"},{"sentence":"Many **cosmeticians** need to be licensed in order to practice legally.","translation":"多くの美容師は、合法的に業務を行うために免許が必要です。","type":"noun","meaning_category":"美容師"},{"sentence":"She went to the **cosmetician** for a pre-wedding facial.","translation":"彼女は結婚式前のフェイシャルを受けるために美容師のところへ行った。","type":"noun","meaning_category":"美容師"}]}