{"word":"isotherm","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"等温線","english_definition":"a line on a map or chart connecting areas of equal temperature.","examples":[{"sentence":"The isotherms on the weather map showed a cold front approaching.","translation":"天気図上の等温線は寒冷前線が接近していることを示していた。"},{"sentence":"Isotherms are used to visualize temperature gradients.","translation":"等温線は温度勾配を視覚化するために使用される。"}],"collocations":["draw an isotherm (等温線を描く)","isotherm map (等温線図)","temperature isotherm (温度等温線)"],"synonyms":["equal temperature line"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'isos' (equal) and 'thermos' (heat).","priority":"★★★"},"pronunciation":{"ipa":"ˈaɪsəθɜːrm/","syllables":"I-so-therm","audio_url":null},"inflection":{"noun_plural":"isotherms"},"usage_notes":{"explanation":"Isotherms are commonly used in meteorology, climatology, and geography to represent temperature distributions. They help in identifying temperature gradients, fronts, and other thermal patterns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The isobars were close together, indicating a strong isotherm.","correct":"The isotherms were close together, indicating a strong temperature gradient.","note":"Isobars represent pressure, not temperature. Isotherms represent temperature."}],"priority":"★★☆"},"related_words":{"derivatives":["isothermal (adjective: 等温の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Isotherm' is a specialized term primarily used in scientific contexts, specifically in fields like meteorology and climatology. It refers to a line connecting points of equal temperature on a map. Understanding this term requires a basic knowledge of map reading and scientific terminology related to weather and climate. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The spacing of the isotherms indicated a rapid change in temperature.","translation":"等温線の間隔は、温度の急激な変化を示していた。","type":"scientific","meaning_category":"temperature representation"},{"sentence":"Scientists analyzed the isotherm patterns to understand the effects of climate change.","translation":"科学者たちは、気候変動の影響を理解するために等温線のパターンを分析した。","type":"scientific","meaning_category":"climate analysis"}]}