{"word":"Impropriation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な文脈で)教会財産の私有化、特に修道院の財産を世俗の所有者が取得すること。","english_definition":"(in a historical context) The act of appropriating ecclesiastical property to private use, especially the seizure of monastic property by a lay person.","examples":[{"sentence":"The impropriation of monastic lands was a significant event in the English Reformation.","translation":"修道院領の私有化は、イングランドの宗教改革における重要な出来事でした。"},{"sentence":"The Crown's impropriation of church revenues led to widespread resentment.","translation":"王室による教会収入の私有化は、広範な反感につながりました。"}],"collocations":["impropriation of land","impropriation of revenues","royal impropriation"],"synonyms":["appropriation","secularization","confiscation","usurpation"],"antonyms":["restoration","restitution"]}],"etymology":{"value":"Late Middle English: from Old French, from late Latin 'impropriare', from 'in-' (expressing direction 'towards') + 'proprius' (one's own). The sense is 'to make (something) one's own'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˌproʊpriˈeɪʃən/","syllables":"im-pro-pri-a-tion"},"inflection":{"noun_plural":"impropriations"},"usage_notes":{"explanation":"The term \"impropriation\" is primarily used in historical contexts, particularly when discussing the dissolution of the monasteries in England and the subsequent transfer of church property to private individuals or the Crown. It refers to the act of taking something that was previously held by the church and making it one's own private property. The word is not commonly used in modern English outside of historical or legal discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company's impropriation of the technology was illegal.","correct":"✓ The company's misappropriation of the technology was illegal.","note":"In modern contexts referring to the illegal taking of property, \"misappropriation\" is the more appropriate term. \"Impropriation\" is specific to historical ecclesiastical contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["impropriate (verb)","impropriator (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Impropriation' is a specialized historical term referring to the appropriation of church property for private use, especially during the Dissolution of the Monasteries. Its usage is limited to academic or historical discussions. Understanding requires familiarity with historical contexts and legal terminology."},"example_sentences":[{"sentence":"The impropriation of tithes by lay rectors was a common practice in the medieval period.","translation":"世俗のレクトールによる十分の一税の私有化は、中世において一般的な慣習でした。","type":"noun","meaning_category":"私有化"},{"sentence":"The documents detailed the impropriation of land belonging to the abbey.","translation":"その文書は、修道院に属する土地の私有化について詳しく述べていました。","type":"noun","meaning_category":"私有化"}]}