{"word":"Acutance","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(写真)隣接する2つの領域間の境界における知覚される鮮明さの客観的な尺度。","english_definition":"An objective measure of the sharpness of the perceived edge detail in an image; the edge gradient between two adjacent areas.","examples":[{"sentence":"The acutance of this lens is very high, resulting in sharp images.","translation":"このレンズの鮮鋭度は非常に高く、シャープな画像が得られます。"},{"sentence":"Increasing the acutance can make an image appear sharper, but it can also amplify noise.","translation":"鮮鋭度を上げると画像がよりシャープに見えることがありますが、ノイズも増幅される可能性があります。"}],"collocations":["high acutance","low acutance","increase acutance","decrease acutance","lens acutance","image acutance"],"synonyms":["sharpness","definition","edge contrast","crispness"],"antonyms":["blurriness","softness"]}],"etymology":{"value":"Derived from 'acute', referring to sharpness or keenness.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈkjuːtəns/","syllables":"a-cu-tance"},"inflection":{"noun_plural":"acutances"},"usage_notes":{"explanation":"Acutance is a measurement related to image sharpness, but distinct from resolution. Resolution refers to the ability to distinguish fine details, while acutance describes the abruptness of the transition between regions of different tones. High acutance gives an impression of sharpness, even if the resolution is not particularly high.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The resolution is the same as acutance.","correct":"✓ Resolution and acutance are related but different concepts.","note":"Resolution refers to the ability to resolve fine details, while acutance refers to the perceived sharpness of edges."}],"priority":"★★☆"},"related_words":{"derivatives":["acute (adjective)","acutely (adverb)"],"related_terms":["resolution","sharpness","contrast","MTF (Modulation Transfer Function)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Acutance' is a technical term used in photography and image processing. It refers to the perceived sharpness of an image, specifically the abruptness of the transition between different tones or colors at an edge. It's a more subjective measure than resolution, which refers to the ability to distinguish fine details. High acutance makes an image appear sharper, even if the resolution isn't particularly high.","priority":"★★☆"},"example_sentences":[{"sentence":"The software allows you to adjust the acutance of the image.","translation":"そのソフトウェアでは、画像の鮮鋭度を調整できます。","type":"general","meaning_category":"general"},{"sentence":"This lens is known for its excellent acutance, producing very crisp images.","translation":"このレンズは優れた鮮鋭度で知られており、非常に鮮明な画像を生成します。","type":"technical","meaning_category":"technical"}]}