{"word":"Coryphaenid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Zoology) A fish of the family Coryphaenidae, especially of the genus Coryphaena.","english_definition":"A fish of the family Coryphaenidae, especially of the genus Coryphaena.","examples":[{"sentence":"The coryphaenid is a popular game fish due to its fast growth and fighting ability.","translation":"シイラ科の魚は、成長が早く、引きが強いため、人気のゲームフィッシュです。"}],"collocations":["coryphaenid fish","coryphaenid species"],"synonyms":["dolphin fish","mahi-mahi","dorado"],"antonyms":[]}],"etymology":{"value":"From the family name Coryphaenidae, derived from Coryphaena (genus name) + -idae (zoological suffix indicating a family). Coryphaena comes from Greek koryphaina (κορυφαινα) meaning 'dolphin fish,' from koryphe (κορυφή) meaning 'summit, top, crest.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒrɪˈfiːnɪd/","syllables":"Co-ry-phae-nid"},"inflection":{"noun_plural":"Coryphaenids"},"usage_notes":{"explanation":"The term 'coryphaenid' is primarily used in scientific or zoological contexts when referring to fish belonging to the Coryphaenidae family. The more common names 'mahi-mahi' or 'dolphin fish' are typically used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I caught a coryphaenid, it was delicious.","correct":"✓ I caught a mahi-mahi, it was delicious.","note":"In casual conversation, use the common name 'mahi-mahi' instead of 'coryphaenid'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Coryphaena (genus)","Coryphaenidae (family)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Coryphaenid' is a scientific term used to refer to fish in the family Coryphaenidae. It is not commonly used in everyday language. If you are not a marine biologist or someone with a specific interest in fish taxonomy, you are unlikely to encounter or need this word frequently. The more common names 'mahi-mahi' or 'dolphin fish' are generally preferred. "},"example_sentences":[{"sentence":"Several coryphaenid species exhibit rapid growth rates.","translation":"いくつかのシイラ科の種は、急速な成長率を示します。","type":"noun","meaning_category":"Zoology"},{"sentence":"The study focused on the migratory patterns of coryphaenids in the Pacific Ocean.","translation":"その研究は、太平洋におけるシイラ科魚類の回遊パターンに焦点を当てていました。","type":"noun","meaning_category":"Zoology"}]}