{"word":"Homesteaders","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(米国史)ホームステッド法に基づいて公有地に入植した人々","english_definition":"People who settled on public land under the Homestead Act in the United States.","examples":[{"sentence":"The homesteaders built their homes and farms on the prairie.","translation":"ホームステッダーたちは大草原に家と農場を建てた。"},{"sentence":"Many homesteaders faced hardship and challenges in establishing their claims.","translation":"多くのホームステッダーは、権利を確立する上で苦難と課題に直面した。"}],"collocations":["Homestead Act","settle the land","claim land","build a homestead"],"synonyms":["settlers","pioneers","frontiersmen","land claimants","land seekers"],"antonyms":[]}],"etymology":{"value":"From 'homestead' (a house and its surrounding land) + '-er' (suffix denoting a person associated with something). The term arose in the context of the Homestead Act of 1862 in the United States, which encouraged westward expansion by granting land to settlers who agreed to live on and cultivate it.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhoʊmˌstɛd.ərz/","syllables":"home-stead-ers"},"inflection":{"noun_plural":"Homesteaders"},"usage_notes":{"explanation":"'Homesteaders' specifically refers to people who took advantage of the Homestead Act in the United States. It is a historical term tied to the westward expansion and settlement of the American frontier. The term implies a certain level of self-sufficiency and resilience, as these individuals were responsible for building their own homes and farms in often harsh conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The homesteaders were all rich and powerful.","correct":"✓ The homesteaders were often poor and seeking opportunity.","note":"Homesteaders were typically not wealthy; they were often seeking a chance to own land and improve their economic situation."},{"incorrect":"✗ Homesteaders only lived in the East Coast.","correct":"✓ Homesteaders primarily settled in the Midwest and Western United States.","note":"Homesteading was associated with the westward expansion of the United States."}],"priority":"★★☆"},"related_words":{"derivatives":["homestead (noun: a house and its surrounding land)","homesteading (noun: the act of settling on and cultivating land under the Homestead Act)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency; primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Homesteaders' refers to people who settled on land granted by the U.S. government under the Homestead Act of 1862. These individuals typically moved to the American West to claim and cultivate land, build homes, and establish farms. The term is primarily used in historical contexts when discussing the westward expansion of the United States. Understanding this term requires knowledge of American history and the Homestead Act.","priority":"★★☆"},"example_sentences":[{"sentence":"The **homesteaders** faced many hardships, including droughts and conflicts with Native Americans.","translation":"ホームステッダーたちは、干ばつやネイティブアメリカンとの紛争など、多くの苦難に直面した。","type":"noun","meaning_category":"people who settled on public land"},{"sentence":"Many **homesteaders** came from Europe seeking a better life in America.","translation":"多くのホームステッダーは、より良い生活を求めてヨーロッパからアメリカに来た。","type":"noun","meaning_category":"people who settled on public land"},{"sentence":"The stories of the **homesteaders** are an important part of American history.","translation":"ホームステッダーたちの物語は、アメリカの歴史の重要な一部である。","type":"noun","meaning_category":"people who settled on public land"}]}