{"word":"aristocratization","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"貴族化、貴族階級化","english_definition":"The process or act of becoming aristocratic; the adoption or imposition of aristocratic qualities or structures.","examples":[{"sentence":"The aristocratization of the bureaucracy led to increased corruption.","translation":"官僚機構の貴族化は、汚職の増加につながった。"},{"sentence":"Some historians argue that the Meiji Restoration involved a process of aristocratization of the samurai class.","translation":"一部の歴史家は、明治維新には武士階級の貴族化の過程が含まれていたと主張している。"},{"sentence":"The aristocratization of culture can lead to a disconnect between the elite and the general population.","translation":"文化の貴族化は、エリート層と一般大衆の間の乖離につながる可能性がある。"}],"collocations":["cultural aristocratization (文化の貴族化)","social aristocratization (社会の貴族化)","economic aristocratization (経済の貴族化)"],"synonyms":["ennoblement","gentrification","elitism"],"antonyms":["democratization","popularization","proletarianization"]}],"etymology":{"value":"「aristocratize」（貴族化する）に接尾辞「-ation」（～化）が付いたもの。","priority":"中"},"pronunciation":{"ipa":"/əˌrɪstəkrətaɪˈzeɪʃən/","syllables":"a-ris-to-cra-ti-za-tion"},"inflection":{"noun_plural":"aristocratizations"},"usage_notes":{"explanation":"「aristocratization」は、社会、文化、経済などの様々な分野において、貴族的な性質や構造が広がる、または導入される過程を指す言葉です。しばしば、権力や富が少数のエリート層に集中し、一般大衆との格差が拡大する状況を批判的に表現するために用いられます。また、特定の文化や趣味が、一部の富裕層や知識層によって独占され、大衆から乖離していく現象を指す場合もあります。","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"The aristocratization of the company made it more efficient.","correct":"The professionalization of the company made it more efficient.","note":"「aristocratization」は、必ずしも良い意味合いを持つとは限りません。効率化を意味する場合は、「professionalization」（専門化）などの言葉を使う方が適切です。"},{"incorrect":"The aristocratization of the food made it more accessible to everyone.","correct":"The popularization of the food made it more accessible to everyone.","note":"「aristocratization」は、一般大衆への普及とは逆の意味合いを持ちます。より多くの人が利用できるようになる場合は、「popularization」（大衆化）などの言葉を使う方が適切です。"}],"priority":"低"},"related_words":{"derivatives":["aristocratize (動詞: 貴族化する)","aristocrat (名詞: 貴族)","aristocracy (名詞: 貴族階級、貴族政治)","aristocratic (形容詞: 貴族的な)"],"priority":"中"},"level_frequency":{"frequency_google_ngram":"低頻度","priority":"低"},"readability_explanation":{"level":"C2","text":"「aristocratization」は、社会科学や歴史学などの分野で使われる専門用語であり、一般的にはあまり使われません。意味を理解するには、貴族階級の特性や、社会における権力構造の変化に関する知識が必要です。文章の中でこの言葉が出てきた場合は、文脈から意味を推測するか、辞書などで確認することをお勧めします。"},"example_sentences":[{"sentence":"The aristocratization of education has created a system where privilege is perpetuated.","translation":"教育の貴族化は、特権が永続化されるシステムを作り出した。","type":"noun","meaning_category":"貴族化"},{"sentence":"Critics argue that the museum's focus on high art represents an aristocratization of culture.","translation":"批評家たちは、美術館が高級芸術に焦点を当てることは、文化の貴族化を意味すると主張している。","type":"noun","meaning_category":"貴族化"},{"sentence":"The aristocratization of the legal profession has made it difficult for people from working-class backgrounds to succeed.","translation":"法曹界の貴族化は、労働者階級出身の人々が成功することを困難にしている。","type":"noun","meaning_category":"貴族化"}]}