{"word":"Caucon","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Greek mythology) A son of Celaenus and father of Mestra. He is sometimes considered the founder of the Eleusinian Mysteries.","english_definition":"In Greek mythology, Caucon was a figure associated with the Eleusinian Mysteries. He was said to be the son of Celaenus and the father of Mestra. Some accounts credit him as a founder or early participant in the Eleusinian Mysteries.","examples":[{"sentence":"Caucon is a relatively obscure figure in Greek mythology, primarily known for his connection to the Eleusinian Mysteries.","translation":"カウコンはギリシア神話では比較的あいまいな人物であり、主にエレウシスの秘儀との関連で知られています。"}],"collocations":["Eleusinian Mysteries","Greek mythology","son of Celaenus","father of Mestra"],"synonyms":["N/A"],"antonyms":["N/A"]}],"etymology":{"value":"The etymology of the name 'Caucon' is uncertain, but it is likely of Greek origin, possibly related to words associated with religious rituals or initiation.","priority":"N/A"},"pronunciation":{"ipa":"/ˈkɔːkɒn/","syllables":"Cau-con"},"inflection":{"notes":"Proper noun, typically not inflected."},"usage_notes":{"explanation":"Caucon is a minor figure in Greek mythology. His significance lies mainly in his alleged role in the Eleusinian Mysteries, an important and secretive religious cult in ancient Greece. Information about him is scarce and often contradictory.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"related_figures":["Celaenus","Mestra"],"related_concepts":["Eleusinian Mysteries"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"Caucon is a figure from Greek mythology, specifically associated with the Eleusinian Mysteries. Understanding references to Caucon requires familiarity with Greek mythology and ancient Greek religious practices, making it a topic for advanced learners or those with a specific interest in classical studies."},"example_sentences":[{"sentence":"According to some accounts, Caucon initiated the rites of the Eleusinian Mysteries.","translation":"いくつかの記述によれば、カウコンはエレウシスの秘儀の儀式を始めたとされています。","type":"mythological reference","meaning_category":"founder of mysteries"},{"sentence":"The role of Caucon in the Eleusinian cult remains a subject of scholarly debate.","translation":"エレウシス崇拝におけるカウコンの役割は、学術的な議論の対象であり続けています。","type":"historical context","meaning_category":"historical figure"}]}