{"word":"morcellation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"細切（さいせつ）; 特に外科手術において、組織や臓器を小さく切断して除去すること","english_definition":"The act of cutting or fragmenting tissue or an organ into smaller pieces, especially for removal during surgery, often laparoscopically.","examples":[{"sentence":"Uterine morcellation can be performed laparoscopically.","translation":"子宮細切術は腹腔鏡下で行うことができる。"},{"sentence":"Morcellation allows for the removal of large tissue masses through small incisions.","translation":"細切術により、小さな切開から大きな組織塊を除去することができる。"},{"sentence":"The use of power morcellators has been associated with the spread of occult cancer.","translation":"パワー細切機の使用は、潜在性癌の拡散と関連している。"}],"collocations":["uterine morcellation (子宮細切術)","power morcellation (パワー細切術)","laparoscopic morcellation (腹腔鏡下細切術)","tissue morcellation (組織細切術)"],"synonyms":["fragmentation","mincing","slicing","chopping"],"antonyms":["en bloc resection (一括切除)"],"notes":"Morcellation is often used in minimally invasive surgery to remove large masses through small incisions. However, it has risks, particularly the potential for spreading undetected cancer cells."}],"etymology":{"value":"Derived from the French word 'morceau,' meaning 'piece' or 'fragment,' with the addition of the suffix '-ation,' indicating a process or action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɔːrsəˈleɪʃən/","syllables":"mor-cel-la-tion"},"inflection":{"noun_plural":"morcellations"},"usage_notes":{"explanation":"Morcellation is a surgical technique used to reduce the size of tissue or organs for easier removal, especially in minimally invasive procedures. It's important to note the associated risks, particularly the potential spread of malignant cells if the tissue being morcellated contains undetected cancer.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed a morcellation on the tumor before removing it whole.","correct":"✓ The doctor performed morcellation on the tumor to break it into smaller pieces for removal.","note":"Morcellation involves breaking the tissue into smaller pieces, so it cannot be removed whole after morcellation."}],"priority":"★☆☆"},"related_words":{"derivatives":["morcellate (verb: to perform morcellation)","morcellator (noun: a device used for morcellation)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Morcellation' is a technical term used in surgery. It refers to the process of cutting a large piece of tissue or an organ into smaller pieces so that it can be removed through a small incision, often during laparoscopic surgery. This technique is used to minimize the size of the incision needed for surgery, but it also has some risks, such as the potential for spreading cancer cells if the tissue being cut contains undetected cancer."},"example_sentences":[{"sentence":"During the laparoscopic hysterectomy, the uterus underwent **morcellation** to facilitate its removal.","translation":"腹腔鏡下子宮摘出術中、子宮の除去を容易にするために子宮細切術が行われた。","type":"noun","meaning_category":"surgical procedure"},{"sentence":"The surgeon used a power **morcellator** to perform the **morcellation** of the fibroid.","translation":"外科医は、線維腫の細切術を行うためにパワー細切機を使用した。","type":"noun","meaning_category":"surgical procedure"},{"sentence":"**Morcellation** of the spleen is sometimes necessary during a splenectomy.","translation":"脾臓摘出術中に脾臓の細切術が必要になることがある。","type":"noun","meaning_category":"surgical procedure"}]}