{"word":"conventional-flow","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"慣習電流（正孔が正電荷を運ぶと仮定した電流の流れ）","english_definition":"The flow of electrical current assuming that positive charges are the moving charge carriers.","examples":[{"sentence":"Conventional-flow assumes that current flows from the positive terminal to the negative terminal.","translation":"慣習電流は、電流が正の端子から負の端子へ流れると仮定する。"}],"collocations":["conventional-flow direction","conventional-flow theory"],"synonyms":["positive current flow"],"antonyms":["electron-flow"]},{"part_of_speech":"adjective","definition":"慣習電流の、慣習電流に基づく","english_definition":"Relating to or based on the assumption that positive charges are the moving charge carriers in an electric current.","examples":[{"sentence":"Conventional-flow analysis is often used in circuit diagrams.","translation":"慣習電流解析は、回路図でよく使用される。"}],"collocations":["conventional-flow circuit","conventional-flow diagram"],"synonyms":["positive-current-based"],"antonyms":["electron-flow-based"]}],"etymology":{"value":"The term 'conventional-flow' arose from the early understanding of electricity, where it was assumed that positive charges were the carriers of current. This convention was established before the discovery of the electron.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈvɛnʃənəl ˌfloʊ/","syllables":"con-ven-tion-al flow"},"inflection":{"noun_plural":"conventional-flows"},"usage_notes":{"explanation":"Conventional-flow is a model used to describe the direction of electric current in a circuit. It assumes that positive charges are moving from the positive terminal to the negative terminal. This is opposite to the actual flow of electrons, which move from the negative terminal to the positive terminal. Despite this difference, conventional-flow is still widely used in circuit analysis and diagrams because it simplifies many calculations and concepts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Conventional flow is the same as electron flow.","correct":"✓ Conventional flow is opposite to electron flow.","note":"Conventional flow and electron flow are opposite directions. Conventional flow assumes positive charges move, while electron flow describes the movement of electrons."}],"priority":"★★☆"},"related_words":{"derivatives":["conventional","flow","electron-flow","current","circuit"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'conventional-flow' refers to a model used in electrical engineering and physics to describe the direction of electric current in a circuit. It's based on the historical assumption that positive charges are the moving charge carriers, which is opposite to the actual flow of electrons. Understanding this concept is important for interpreting circuit diagrams and analyzing electrical systems, although it's a more advanced topic typically encountered in higher education or professional contexts."},"example_sentences":[{"sentence":"The circuit diagram uses **conventional-flow** to indicate the direction of current.","translation":"その回路図は、電流の方向を示すために慣習電流を使用している。","type":"noun","meaning_category":"電流の流れ"},{"sentence":"**Conventional-flow** is a useful simplification for many circuit calculations.","translation":"慣習電流は、多くの回路計算にとって有用な簡略化である。","type":"noun","meaning_category":"電流の流れ"},{"sentence":"The textbook explains both **conventional-flow** and electron flow.","translation":"その教科書は、慣習電流と電子の流れの両方を説明している。","type":"noun","meaning_category":"電流の流れ"}]}