{"word":"photosensitizer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"光増感剤、光感受性物質","english_definition":"A substance that increases the sensitivity of a material to electromagnetic radiation, such as light. In photodynamic therapy, it is a non-toxic dye or chemical that becomes toxic when exposed to light.","examples":[{"sentence":"The photosensitizer is activated by exposure to a specific wavelength of light.","translation":"その光増感剤は、特定の波長の光にさらされることで活性化されます。"},{"sentence":"Photosensitizers are used in photodynamic therapy to destroy cancer cells.","translation":"光増感剤は、光線力学療法でがん細胞を破壊するために使用されます。"},{"sentence":"Some photosensitizers can cause skin sensitivity to sunlight.","translation":"一部の光増感剤は、日光に対する皮膚の感受性を引き起こす可能性があります。"}],"collocations":["photodynamic therapy (PDT)","activate a photosensitizer","inject a photosensitizer","topical photosensitizer"],"synonyms":["photosensitizing agent","photochemical agent"],"antonyms":[]}],"etymology":{"value":"\"photo-\" (light) + \"sensitizer\" (something that makes something else sensitive).","priority":"★★★"},"pronunciation":{"ipa":"/ˌfoʊtoʊˈsɛnsɪtaɪzər/","syllables":"pho-to-sen-si-ti-zer"},"inflection":{"noun_plural":"photosensitizers"},"usage_notes":{"explanation":"A photosensitizer is a molecule that absorbs light and then transfers that energy to another molecule, causing a chemical change. In medicine, they are used in photodynamic therapy (PDT) to treat certain cancers and other conditions. The photosensitizer is administered to the patient and then a specific wavelength of light is applied to the affected area. The light activates the photosensitizer, which then produces a form of oxygen that is toxic to cells, leading to the destruction of the targeted tissue.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient was injected with photosensitive.","correct":"✓ The patient was injected with a photosensitizer.","note":"\"Photosensitive\" means sensitive to light, while \"photosensitizer\" is the substance that makes something sensitive to light."}],"priority":"★★☆"},"related_words":{"derivatives":["photosensitize (verb)","photosensitization (noun)","photosensitive (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"photosensitizer\" is a technical term primarily used in scientific and medical contexts. It refers to a substance that increases sensitivity to light, often used in treatments like photodynamic therapy (PDT) to target and destroy specific cells. Understanding requires a background in chemistry or biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The effectiveness of the photosensitizer depends on the wavelength of light used.","translation":"光増感剤の有効性は、使用する光の波長に依存します。","type":"general","meaning_category":"General usage"},{"sentence":"Researchers are developing new photosensitizers with improved targeting capabilities.","translation":"研究者たちは、標的化能力が向上した新しい光増感剤を開発しています。","type":"research","meaning_category":"Research and development"},{"sentence":"The photosensitizer is administered intravenously before the light treatment.","translation":"光増感剤は、光治療の前に静脈内投与されます。","type":"medical","meaning_category":"Medical procedure"}]}