{"word":"Whitmanesque","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ホイットマン風の、ウォルト・ホイットマンに似た、ウォルト・ホイットマンの影響を受けた","english_definition":"resembling or characteristic of Walt Whitman or his works, especially in being free-verse, expansive, and democratic in spirit.","examples":[{"sentence":"The poem had a Whitmanesque quality, celebrating the common man and the beauty of nature.","translation":"その詩はホイットマン風の趣があり、庶民と自然の美しさを称賛していた。"},{"sentence":"The author's Whitmanesque style was evident in his long, rambling sentences and his inclusive vision.","translation":"著者のホイットマン風の文体は、彼の長くてとりとめのない文章と、包括的なビジョンに明らかだった。"}],"collocations":["Whitmanesque poetry (ホイットマン風の詩)","Whitmanesque style (ホイットマン風の文体)","Whitmanesque vision (ホイットマン風のビジョン)","Whitmanesque catalog (ホイットマン風の列挙)"],"synonyms":["expansive","lyrical","democratic","inclusive","free-verse"],"antonyms":["restrictive","formal","conventional","structured"]},{"part_of_speech":"noun","definition":"ホイットマン風の作品、ウォルト・ホイットマンに似た人","english_definition":"a work or person resembling Walt Whitman or his works.","examples":[{"sentence":"Her latest novel is a Whitmanesque exploration of American identity.","translation":"彼女の最新の小説は、アメリカのアイデンティティに関するホイットマン風の探求である。"},{"sentence":"He fancied himself a Whitmanesque figure, wandering the country and celebrating its diversity.","translation":"彼は自分自身をホイットマン風の人物だと考え、国を放浪し、その多様性を称賛していた。"}],"collocations":["a Whitmanesque figure (ホイットマン風の人物)","a Whitmanesque work (ホイットマン風の作品)"],"synonyms":["imitator of Whitman","follower of Whitman"],"antonyms":[]}],"etymology":{"value":"「Whitman」（ウォルト・ホイットマン）に接尾辞「-esque」が付いたもの。「-esque」は「～のような、～風の」という意味を表す。","priority":"★★★"},"pronunciation":{"ipa":"/ˌwɪtmənˈesk/","syllables":"Whit-man-esque"},"inflection":{"notes":"形容詞・名詞として使用。形容詞は比較変化なし。名詞は可算名詞。"},"usage_notes":{"explanation":"「**Whitmanesque**」は、主にウォルト・ホイットマンの作品やスタイルを彷彿とさせるものに対して使われます。具体的には、自由詩（free verse）の形式、広大で包括的なテーマ、民主主義的な精神、自然や人間の多様性を肯定的に捉える姿勢などが特徴です。文学的な文脈で使われることが多いですが、比喩的に、ある人物の性格や行動がホイットマンに似ている場合にも使われます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting had a Whitmanesque feel, even though Whitman never painted.","correct":"✓ The painting had a Whitmanesque feel, suggesting a vastness and appreciation for the common person.","note":"ホイットマンは画家ではないので、絵画に「Whitmanesque」を使う場合は、彼の詩のテーマやスタイルとの関連性を示す必要があります。"},{"incorrect":"✗ He wrote in Whitmanesque, but his poems were very short.","correct":"✓ He wrote in a Whitmanesque style, but his poems were very short.","note":"「Whitmanesque」を副詞的に使うことは一般的ではありません。スタイルを指す場合は、「in a Whitmanesque style」のように表現します。"}],"priority":"★★☆"},"related_words":{"derivatives":["Whitman (ウォルト・ホイットマン)","-esque (～風の)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 文学や芸術に関わる分野で使われる専門的な語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Whitmanesque**」は、アメリカの詩人ウォルト・ホイットマンの特徴や作風に似ていることを表す言葉です。ホイットマンの詩は、自由詩（free verse）という形式で書かれ、自然や人間、特に普通の人々への賛美を歌っています。また、彼の詩は非常に広範囲なテーマを扱い、民主主義的な精神に満ちています。したがって、「Whitmanesque」な作品やスタイルとは、これらの特徴を備えているものを指します。文学や芸術の分野で使われることが多く、日常会話ではあまり使われません。"},"example_sentences":[{"sentence":"The novel's sprawling narrative and celebration of American life felt distinctly Whitmanesque.","translation":"その小説の広大な物語とアメリカの生活の称賛は、明らかにホイットマン風だった。","type":"adjective","meaning_category":"ホイットマン風の"},{"sentence":"Her poems are often described as Whitmanesque in their use of free verse and vivid imagery.","translation":"彼女の詩は、自由詩の使用と鮮やかなイメージにおいて、しばしばホイットマン風だと評される。","type":"adjective","meaning_category":"ホイットマン風の"},{"sentence":"He adopted a Whitmanesque persona, embracing the open road and the spirit of adventure.","translation":"彼はホイットマン風の人物像を採用し、開かれた道と冒険の精神を受け入れた。","type":"adjective","meaning_category":"ホイットマン風の"},{"sentence":"The artist's vast canvases and inclusive themes were reminiscent of Whitmanesque poetry.","translation":"その芸術家の広大なキャンバスと包括的なテーマは、ホイットマン風の詩を彷彿とさせた。","type":"adjective","meaning_category":"ホイットマン風の"}]}