{"word":"unabusively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"虐待的でなく、乱用せずに","english_definition":"In a manner that is not abusive; without mistreating or exploiting.","examples":[{"sentence":"The children were treated unabusively by their foster parents.","translation":"子供たちは里親に虐待されることなく育てられた。"},{"sentence":"The company handled the situation unabusively, ensuring fairness to all employees.","translation":"会社は状況を虐待的に扱うことなく、すべての従業員に公平であることを保証した。"}],"collocations":["treat someone unabusively (誰かを虐待せずに扱う)","handle a situation unabusively (状況を虐待的に扱うことなく処理する)"],"synonyms":["respectfully","kindly","gently","fairly","non-exploitatively"],"antonyms":["abusively","exploitatively","mistreatingly"]}],"etymology":{"value":"接頭辞 un- (否定) + abusively (abusivelyを参照).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnəˈbjuːsɪvli/","syllables":"un-a-bu-sive-ly"},"inflection":{"notes":"adverb, no comparative or superlative forms"},"usage_notes":{"explanation":"\"Unabusively\" is the adverbial form of \"unabusive,\" meaning in a way that avoids abuse. It describes actions or behaviors that are free from mistreatment, exploitation, or any form of abuse. It is often used to emphasize the positive and respectful nature of interactions or treatments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unabusively used his power.","correct":"✓ He used his power unabusively.","note":"Adverbs often modify verbs and are placed either before or after the verb, or at the end of the sentence for emphasis. Placing it in the middle of the verb and its object is less common and can sound awkward."}],"priority":"★★★"},"related_words":{"derivatives":["unabusive (adjective)","abuse (verb, noun)","abusively (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (rare)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unabusively\" is a relatively rare and complex term. It is formed by adding the prefix \"un-\" to \"abusively,\" which means \"in a manner that is not abusive.\" To understand this word, one must first understand the meaning of \"abuse\" and \"abusively.\" It is typically used in formal or legal contexts to describe actions that are free from any form of mistreatment or exploitation. Due to its rarity and complexity, it is more likely to be encountered by advanced English speakers or in specialized texts."},"example_sentences":[{"sentence":"The therapist worked unabusively with the patient, ensuring a safe and supportive environment.","translation":"セラピストは患者を虐待的に扱うことなく、安全で支援的な環境を確保した。","type":"general","meaning_category":"manner of treatment"},{"sentence":"The company's policies were designed to treat all employees unabusively, regardless of their position.","translation":"会社のポリシーは、役職に関係なく、すべての従業員を虐待的に扱うことなく扱うように設計されていた。","type":"business","meaning_category":"business ethics"}]}