{"word":"compunctive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(文法) 反実仮想の、仮定法の","english_definition":"(grammar) expressing a wish or condition contrary to fact; subjunctive.","examples":[{"sentence":"The compunctive mood is used to express hypothetical situations.","translation":"反実仮想法は、仮定的な状況を表現するために使用されます。"},{"sentence":"The sentence 'If I were you' uses the compunctive mood.","translation":"「もし私があなたなら」という文は、反実仮想法を使用しています。"}],"collocations":["compunctive mood","compunctive clause"],"synonyms":["subjunctive","hypothetical","conditional"],"antonyms":["indicative","declarative"]}],"etymology":{"value":"Derived from Latin 'compunctus', past participle of 'compungere' meaning 'to prick sharply, sting', influenced by 'subjunctive'. The grammatical sense developed through the idea of something 'pricking' or 'moving' the mind to consider a hypothetical or contrary-to-fact situation.","priority":"★★☆"},"pronunciation":{"ipa":"/kəmˈpʌŋktɪv/","syllables":"com-punc-tive"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Comjunctive' is a relatively rare term, primarily used in grammatical discussions to refer to the subjunctive mood or constructions expressing hypothetical or counterfactual conditions. It is often used interchangeably with 'subjunctive,' although 'subjunctive' is the more common term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The compunctive verb is always in the past tense.","correct":"✓ The compunctive mood often involves past tense forms to express hypothetical situations, but not always.","note":"While past tense forms are common in subjunctive constructions, the compunctive mood encompasses various forms and tenses used to express hypothetical or counterfactual conditions."}],"priority":"★☆☆"},"related_words":{"derivatives":["compunction (noun): a feeling of guilt or moral scruple that prevents or follows the doing of something bad."],"related_terms":["subjunctive mood","conditional clause","hypothetical"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Comjunctive' is a technical term primarily used in advanced grammatical discussions. It refers to the subjunctive mood, which expresses hypothetical or counterfactual conditions. Due to its specialized usage, it is not commonly encountered outside of linguistic contexts. Understanding this term requires a strong grasp of grammatical concepts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The use of 'were' instead of 'was' in the 'if' clause is an example of the compunctive mood.","translation":"「もし～なら」の節で「was」の代わりに「were」を使うのは、反実仮想法の例です。","type":"adjective","meaning_category":"grammatical"},{"sentence":"The compunctive form of the verb indicates a condition contrary to fact.","translation":"動詞の反実仮想形は、事実に反する条件を示します。","type":"adjective","meaning_category":"grammatical"}]}