{"word":"yam-root","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヤムイモの根","english_definition":"The edible starchy tuberous root of various plants in the genus Dioscorea, widely grown in tropical and subtropical regions.","examples":[{"sentence":"Yam-root is a staple food in many Caribbean countries.","translation":"ヤムイモの根は多くのカリブ海諸国で主食です。"},{"sentence":"She prepared a delicious dish with yam-root and spices.","translation":"彼女はヤムイモの根とスパイスでおいしい料理を作りました。"}],"collocations":["cook yam-root","eat yam-root","grow yam-root","harvest yam-root"],"synonyms":["yam","sweet potato (often used interchangeably, but they are different)"],"antonyms":[]}],"etymology":{"value":"Compound word combining 'yam' (from Portuguese inhame or Spanish ñame, ultimately from West African languages) and 'root' (from Old English rōt).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjæmˌruːt/","syllables":"yam-root"},"inflection":{"noun_plural":"yam-roots"},"usage_notes":{"explanation":"'Yam-root' specifically refers to the root vegetable itself. While 'yam' is often used as a general term, specifying 'yam-root' can emphasize the part of the plant being discussed, especially in culinary contexts. In some regions, 'yam' is used interchangeably with 'sweet potato,' but they are botanically distinct.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought yams, but they were orange inside, so they must be yam-roots.","correct":"✓ I bought yams, but they were orange inside, so they must be sweet potatoes.","note":"Orange flesh usually indicates a sweet potato, not a true yam. Yams typically have white, purple, or reddish flesh."},{"incorrect":"✗ Yam-roots are the same as potatoes.","correct":"✓ Yam-roots are different from potatoes.","note":"Yam-roots and potatoes are different vegetables, although they are both tubers."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["yam","sweet potato","tuber","root vegetable","Dioscorea"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Yam-root' refers to the edible root of the yam plant, a starchy vegetable common in tropical regions. It's often confused with sweet potatoes, although they are different. The term is used in culinary and agricultural contexts. Understanding this term requires some familiarity with different types of root vegetables and their regional uses."},"example_sentences":[{"sentence":"The farmer harvested a large quantity of yam-root from his field.","translation":"農家は畑から大量のヤムイモの根を収穫しました。","type":"general","meaning_category":"agricultural"},{"sentence":"This recipe calls for grated yam-root as a key ingredient.","translation":"このレシピでは、すりおろしたヤムイモの根が主要な材料として必要です。","type":"culinary","meaning_category":"cooking"},{"sentence":"Yam-root is a good source of dietary fiber and vitamins.","translation":"ヤムイモの根は食物繊維とビタミンの良い供給源です。","type":"nutritional","meaning_category":"health"}]}