{"word":"media-insensitive","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"メディアに依存しない、メディアの種類に影響されない","english_definition":"Not affected by or dependent on the type of media used; able to function regardless of the specific medium.","examples":[{"sentence":"The application is designed to be media-insensitive, working equally well with text, images, or video.","translation":"そのアプリケーションはメディアの種類に影響されないように設計されており、テキスト、画像、またはビデオのいずれでも同様に動作します。"},{"sentence":"A media-insensitive codec can handle various input formats without requiring specific preprocessing.","translation":"メディアの種類に依存しないコーデックは、特定の前処理を必要とせずに、さまざまな入力形式を処理できます。"}],"collocations":["media-insensitive application","media-insensitive codec","media-insensitive design","media-insensitive format"],"synonyms":["media-independent","format-agnostic","device-agnostic"],"antonyms":["media-specific","media-dependent"]}],"etymology":{"value":"\"media\" + \"insensitive\". \"Media\" refers to the means of communication, and \"insensitive\" means not affected by or responsive to. Thus, \"media-insensitive\" describes something that is not influenced by the specific type of media.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmiːdiə ɪnˈsɛnsətɪv/","syllables":"me-di-a in-sen-si-tive"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"\"Media-insensitive\" is often used in technical contexts, particularly in software development, hardware design, and data processing, to describe systems or components that can operate effectively regardless of the input or output medium. It highlights the versatility and adaptability of a technology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The software is not media-sensitive.","correct":"✓ The software is media-insensitive.","note":"\"Media-sensitive\" implies that the software *is* affected by the media, the opposite of what is intended."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["media","insensitive","media-independent","format-agnostic"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Media-insensitive\" is a technical term describing something designed to work the same way regardless of the type of media it interacts with (e.g., text, images, video). It's often used in computer science and engineering. Understanding this term requires familiarity with technical vocabulary."},"example_sentences":[{"sentence":"The new operating system is designed to be media-insensitive, ensuring compatibility across different file types.","translation":"新しいオペレーティングシステムは、メディアの種類に依存しないように設計されており、さまざまなファイルタイプ間の互換性を保証します。","type":"adjective","meaning_category":"メディアに依存しない"},{"sentence":"A media-insensitive approach to data storage allows for seamless integration of information from various sources.","translation":"データストレージに対するメディアの種類に依存しないアプローチにより、さまざまなソースからの情報をシームレスに統合できます。","type":"adjective","meaning_category":"メディアの種類に影響されない"}]}