{"word":"Hindustani","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヒンドゥスターニー語","english_definition":"A lingua franca of northern India and Pakistan, a mixture of Hindi and Urdu.","examples":[{"sentence":"Hindustani is widely spoken in the region.","translation":"ヒンドゥスターニー語はその地域で広く話されています。"}],"collocations":["speak Hindustani","learn Hindustani"],"synonyms":["Hindi-Urdu"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ヒンドゥスターニー語の、ヒンドゥスターンの","english_definition":"Of or relating to Hindustani language or Hindustan.","examples":[{"sentence":"Hindustani music is very popular.","translation":"ヒンドゥスターニー音楽はとても人気があります。"}],"collocations":["Hindustani music","Hindustani culture"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Hindustan, the historical name for the northern part of the Indian subcontinent.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɪnduˈstɑːni/","syllables":"Hin-du-sta-ni"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hindustani is considered a lingua franca, a common language used by people who speak different native languages. It's closely related to both Hindi and Urdu, and the spoken forms are often mutually intelligible. The formal written forms, however, differ significantly, with Hindi using Devanagari script and drawing vocabulary from Sanskrit, while Urdu uses Perso-Arabic script and borrows from Persian and Arabic.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I speak Hindi, so I understand Hindustani perfectly.","correct":"✓ I speak Hindi, so I understand Hindustani quite well.","note":"While Hindi and Hindustani are very similar, they are not exactly the same. There might be some differences in vocabulary and expressions."}],"priority":"★★☆"},"related_words":{"derivatives":["Hindi","Urdu","Hindustan"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Hindustani' refers to a language variety spoken in northern India and Pakistan. It's a mix of Hindi and Urdu. The term is also used to describe things related to this language or the region of Hindustan. It's not a very common word, so you might not hear it often unless you're studying languages or cultures of that area."},"example_sentences":[{"sentence":"Many Bollywood films use Hindustani, making them accessible to a wide audience.","translation":"多くのボリウッド映画はヒンドゥスターニー語を使用しており、幅広い観客がアクセスできるようになっています。","type":"noun","meaning_category":"language"},{"sentence":"The concert featured a blend of Hindustani and Western musical styles.","translation":"コンサートでは、ヒンドゥスターニーと西洋の音楽スタイルが融合されていました。","type":"adjective","meaning_category":"related to language/region"}]}