{"word":"piarhemic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(rare) Relating to or characterized by the presence of an excess of fat in the blood.","english_definition":"Relating to or characterized by the presence of an excess of fat in the blood.","examples":[{"sentence":"The patient's blood sample was described as piarhemic due to the high concentration of lipids.","translation":"患者の血液サンプルは、脂質濃度が高いため、ピアヘミックであると記述されました。"}],"collocations":["piarhemic blood","piarhemic condition","piarhemic sample"],"synonyms":["lipemic","hyperlipemic","fatty"],"antonyms":["hypolipemic"],"notes":"This term is relatively rare and primarily used in medical or scientific contexts."}],"etymology":{"value":"Derived from the Greek words 'piar' (fat) and 'haima' (blood), combined with the suffix '-ic' indicating relationship or characteristic.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaɪərˈhiːmɪk/","syllables":"pi-ar-he-mic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'piarhemic' is used to describe a condition where there is an abnormally high level of fat in the blood. This can be observed in blood samples, which may appear milky or cloudy. It is often associated with certain medical conditions or dietary factors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The blood was piarhemia.","correct":"✓ The blood was piarhemic.","note":"'Piarhemia' is the noun form referring to the condition itself, while 'piarhemic' is the adjective describing something related to that condition."}],"priority":"★★☆"},"related_words":{"derivatives":["piarhemia (noun): The condition of having an excess of fat in the blood."],"related_medical_terms":["hyperlipidemia","hypertriglyceridemia","lipemia"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in specialized medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'piarhemic' is a highly specialized medical term used to describe a blood condition characterized by an excess of fat. Due to its technical nature and infrequent use outside of medical contexts, it is considered a high-level vocabulary word. Understanding requires familiarity with basic medical terminology and Greek root words."},"example_sentences":[{"sentence":"The laboratory analysis revealed a distinctly piarhemic serum sample.","translation":"検査室での分析により、明らかにピアヘミックな血清サンプルが明らかになった。","type":"general","meaning_category":"medical condition"},{"sentence":"Dietary changes were recommended to reduce the piarhemic state of the patient.","translation":"患者のピアヘミックな状態を軽減するために、食生活の変更が推奨された。","type":"general","meaning_category":"medical condition"}]}