{"word":"Eir","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(北欧神話) エイル：北欧神話に登場する、医療や癒やしを司る女神。","english_definition":"(Norse mythology) Eir is a Norse goddess associated with medical skill and healing.","examples":[{"sentence":"Eir was known for her exceptional healing abilities.","translation":"エイルは彼女の卓越した癒やしの能力で知られていた。"},{"sentence":"People would pray to Eir for good health and recovery from illness.","translation":"人々は健康と病気からの回復を祈ってエイルに祈った。"}],"collocations":["goddess Eir (女神エイル)","invoke Eir (エイルに祈る)","Eir's healing powers (エイルの癒やしの力)"],"synonyms":["healer","physician","goddess of healing"],"antonyms":[],"notes":"Eir is often depicted as a handmaiden of the goddess Frigg. She is mentioned in the Prose Edda and the Poetic Edda."}],"etymology":{"value":"The name Eir is believed to derive from the Old Norse word 'eir', meaning 'help' or 'mercy'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈeɪr/","syllables":"Air (1 syllable)"},"inflection":{"notes":"Proper noun, does not inflect."},"usage_notes":{"explanation":"Eir is a relatively minor figure in Norse mythology compared to gods like Odin or Thor. However, her role as a goddess of healing made her important to the people of the time. Information about Eir is limited, and much of what is known comes from the Eddas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Eir was a giant.","correct":"✓ Eir was a goddess.","note":"Eir is a goddess, not a giant."},{"incorrect":"✗ Eir is the god of healing.","correct":"✓ Eir is the goddess of healing.","note":"Eir is a female deity, a goddess."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_figures":["Frigg (女神フリッグ：Eirはフリッグの侍女とされる)","Mengloth (女神メングロート：一部の研究者はEirと同一視する)"],"priority":"★★☆"},"level_frequency":{"rarity":"Rare","notes":"Eir is not a commonly discussed figure outside of the context of Norse mythology.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'Eir' refers to a specific figure in Norse mythology, making it a niche topic. Understanding requires familiarity with Norse mythology and its characters. The information available is limited, adding to the complexity for those unfamiliar with the subject matter."},"example_sentences":[{"sentence":"In Norse mythology, Eir is the goddess of healing.","translation":"北欧神話では、エイルは癒やしの女神です。","type":"definition"},{"sentence":"People prayed to Eir for relief from their ailments.","translation":"人々は病気からの回復をエイルに祈りました。","type":"example"}]}