{"word":"pujah","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"プージャ：ヒンドゥー教の礼拝儀式","english_definition":"A prayer ritual performed by Hindus to host, honour and worship one or more deities, or to spiritually celebrate an event.","examples":[{"sentence":"The family performed a pujah to celebrate the birth of their child.","translation":"家族は子供の誕生を祝うためにプージャを行った。"},{"sentence":"The temple holds a daily pujah for the deity.","translation":"寺院では毎日、神のためにプージャが行われる。"}],"collocations":["perform a pujah","attend a pujah","daily pujah","special pujah"],"synonyms":["worship","prayer","ceremony","ritual"],"antonyms":[]}],"etymology":{"value":"Derived from Sanskrit 'pūjā' (पूजा), meaning reverence, honour, worship, adoration.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpuːdʒɑː/","syllables":"pu-jah"},"inflection":{"noun_plural":"pujahs"},"usage_notes":{"explanation":"'Pujah' refers specifically to the Hindu ritual of worship. It involves making offerings, chanting mantras, and performing other ritualistic actions to honor a deity or celebrate a spiritual event. It is a central practice in Hinduism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ They went to the church for pujah.","correct":"✓ They went to the temple for pujah.","note":"Pujah is a Hindu ritual, so it takes place in a Hindu temple, not a church."},{"incorrect":"✗ He did pujah to God.","correct":"✓ He performed a pujah to the deity.","note":"'Perform' is a more appropriate verb to use with pujah."}],"priority":"★★☆"},"related_words":{"derivatives":["pūjāri (priest who performs the pujah)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pujah' is a specialized term referring to a Hindu religious ritual. Understanding its meaning requires familiarity with Hindu religious practices. The word is not commonly used outside of contexts related to Hinduism or religious studies."},"example_sentences":[{"sentence":"The priest led the devotees in a beautiful pujah.","translation":"司祭は信者たちを美しいプージャへと導いた。","type":"noun","meaning_category":"礼拝儀式"},{"sentence":"During the pujah, offerings of flowers and fruits were made.","translation":"プージャの間、花や果物の捧げ物がされた。","type":"noun","meaning_category":"礼拝儀式"},{"sentence":"The annual Durga pujah is a major festival in West Bengal.","translation":"毎年恒例のドゥルガー・プージャは、西ベンガル州の主要な祭りである。","type":"noun","meaning_category":"礼拝儀式"}]}