{"word":"mispersuade","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人を)誤って説得する、間違った方向に説得する","english_definition":"To persuade wrongly; to convince to a wrong course of action or belief.","examples":[{"sentence":"The con artist mispersuaded the elderly woman into investing her life savings in a fraudulent scheme.","translation":"詐欺師は、その高齢女性を誤って説得し、彼女の生涯の貯蓄を不正な計画に投資させた。"},{"sentence":"He was mispersuaded by his friends to skip class and go to the beach.","translation":"彼は友人に誤って説得され、授業をサボってビーチに行くことになった。"},{"sentence":"Don't let yourself be mispersuaded by false advertising.","translation":"誤った広告に誤って説得されないようにしてください。"}],"collocations":["mispersuade someone into (doing something)","be mispersuaded by"],"synonyms":["mislead","deceive","dissuade","misguide"],"antonyms":["persuade","convince","encourage"]}],"etymology":{"value":"The word 'mispersuade' is formed by adding the prefix 'mis-' (meaning wrongly or badly) to the word 'persuade'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɪspərˈsweɪd/","syllables":"mis-per-swade"},"inflection":{"verb_forms":{"present_simple":["mispersuade","mispersuades"],"past_simple":"mispersuaded","past_participle":"mispersuaded","present_participle":"mispersuading"}},"usage_notes":{"explanation":"'Mispersuade' implies that the persuasion led someone to a negative or incorrect outcome. It suggests a fault in the persuasion process, whether intentional or unintentional. It is less common than 'mislead' but more specific in that it involves the act of persuasion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He mispersuaded to do it.","correct":"✓ He mispersuaded her to do it.","note":"'Mispersuade' requires a direct object (the person being persuaded) and often a prepositional phrase indicating the action they are persuaded into."},{"incorrect":"✗ I was mispersuaded of the truth.","correct":"✓ I was mispersuaded into believing a lie.","note":"The preposition 'into' is typically used to indicate the resulting action or belief."}],"priority":"★★☆"},"related_words":{"derivatives":["mispersuasion (noun)"],"phrasal_verbs":[],"related_verbs":["persuade","dissuade","mislead","convince"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'mispersuade' is a relatively uncommon word that means to persuade someone wrongly or into a mistaken course of action. It's formed by adding the prefix 'mis-' to 'persuade,' indicating that the persuasion has a negative or incorrect outcome. This word is more likely to be encountered in formal writing or discussions about ethics, manipulation, or deception."},"example_sentences":[{"sentence":"The advertisement was designed to mispersuade consumers into buying a product they didn't need.","translation":"その広告は、消費者を誤って説得し、必要のない製品を購入させるように設計されていた。","type":"verb","meaning_category":"wrongly persuade"},{"sentence":"She felt she had been mispersuaded by her financial advisor.","translation":"彼女は、自分のファイナンシャルアドバイザーに誤って説得されたと感じた。","type":"verb","meaning_category":"wrongly persuade"},{"sentence":"It's easy to be mispersuaded by charismatic speakers who don't have your best interests at heart.","translation":"あなたの最善の利益を考えていないカリスマ的な話し手に誤って説得されるのは簡単だ。","type":"verb","meaning_category":"wrongly persuade"}]}