{"word":"arbitrario","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"恣意的な、独断的な、根拠のない","english_definition":"based on random choice or personal whim, rather than any reason or system.","examples":[{"sentence":"La decisión fue completamente arbitraria.","translation":"その決定は完全に恣意的だった。"},{"sentence":"No me gusta que seas tan arbitrario.","translation":"あなたがそんなに独断的なのが好きではない。"},{"sentence":"El precio es arbitrario y no se basa en el costo real.","translation":"その価格は恣意的で、実際のコストに基づいているわけではない。"}],"collocations":["decisión arbitraria (恣意的な決定)","poder arbitrario (独断的な権力)","acto arbitrario (恣意的な行為)","detención arbitraria (不当な逮捕)"],"synonyms":["subjetivo","discrecional","caprichoso","infundado","injustificado","autocrático","despótico"],"antonyms":["razonable","justificado","fundamentado","objetivo","sistemático"]}],"etymology":{"value":"Del latín 'arbitrarius', derivado de 'arbiter' (juez, árbitro). Originalmente, se refería a algo que dependía del juicio de un árbitro, pero con el tiempo adquirió el significado de algo que se basa en la voluntad personal y no en la razón.","priority":"★★☆"},"pronunciation":{"ipa":"/aɾ.βiˈtɾa.ɾjo/","syllables":"ar-bi-tra-rio"},"inflection":{"gender":"masculine","number":"singular"},"usage_notes":{"explanation":"'Arbitrario' se utiliza para describir acciones, decisiones o reglas que no tienen una base lógica o justa, y que parecen basarse en el capricho o la voluntad de una persona o grupo. Implica una falta de consideración por los hechos o principios objetivos.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"*La ley es arbitraria porque es muy estricta.*","correct":"*La ley es injusta porque es muy estricta.*","note":"'Arbitrario' se refiere a la falta de base lógica, no necesariamente a la severidad. 'Injusto' sería más apropiado en este caso."},{"incorrect":"*Su comportamiento es arbitrario, siempre sigue las reglas.*","correct":"*Su comportamiento es impredecible, nunca sigue las reglas.*","note":"'Arbitrario' implica una falta de sistema o razón, no necesariamente una falta de cumplimiento de las reglas. 'Impredecible' sería más apropiado."}],"priority":"★★☆"},"related_words":{"derivatives":["arbitrariamente (adv.)","arbitrariedad (sust.)"],"phrases":["Poder arbitrario (arbitrary power)","Detención arbitraria (arbitrary detention)"],"priority":"★★☆"},"level_frequency":{"level":"B2","frequency_corpus":"Relatively frequent in legal and political contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Arbitrario' es una palabra que se usa para describir algo que no tiene una razón lógica o justa. Es como si alguien tomara una decisión sin pensar en las consecuencias o en lo que es correcto. Por ejemplo, si un profesor decide dar una buena nota a un estudiante solo porque le gusta, eso sería una decisión 'arbitraria'."},"example_sentences":[{"sentence":"El gobierno tomó medidas arbitrarias contra los manifestantes.","translation":"The government took arbitrary measures against the protesters.","type":"example","meaning_category":"acción sin justificación"},{"sentence":"La selección de los candidatos fue totalmente arbitraria.","translation":"The selection of candidates was completely arbitrary.","type":"example","meaning_category":"decisión sin base lógica"},{"sentence":"Es arbitrario que unos tengan tantos privilegios y otros tan pocos.","translation":"It is arbitrary that some have so many privileges and others so few.","type":"example","meaning_category":"falta de equidad"}]}