{"word":"intrafirm","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"企業内の、企業内で行われる","english_definition":"occurring within a firm or between different parts of the same firm.","examples":[{"sentence":"Intrafirm trade accounts for a significant portion of international commerce.","translation":"企業内貿易は国際商取引の重要な部分を占めています。"},{"sentence":"The study examined intrafirm knowledge transfer.","translation":"その研究は企業内の知識移転を調査しました。"},{"sentence":"Intrafirm communication is essential for efficient operations.","translation":"効率的な運営には企業内コミュニケーションが不可欠です。"}],"collocations":["intrafirm trade","intrafirm transactions","intrafirm communication","intrafirm knowledge transfer","intrafirm relationships"],"synonyms":["internal","within the company","in-house"],"antonyms":["interfirm","external","outsourced"]}],"etymology":{"value":"\"Intra-\" (内部) + \"firm\" (企業)","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntrəˈfɜːrm/","syllables":"in-tra-firm"},"inflection":{"notes":"変化なし"},"usage_notes":{"explanation":"\"Intrafirm\" is used to describe activities, relationships, or processes that occur within the boundaries of a single company. It is often contrasted with \"interfirm,\" which refers to activities or relationships between different companies. It is commonly used in economics, business, and management contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The intrafirm between the two companies was successful.","correct":"✓ The interfirm collaboration between the two companies was successful.","note":"\"Intrafirm\" refers to activities within a single company, not between companies. Use \"interfirm\" for collaborations between different companies."}],"priority":"★★☆"},"related_words":{"derivatives":["intrafirm trade","intrafirm transaction","intrafirm transfer"],"related_terms":["firm","multinational corporation","vertical integration","transfer pricing"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'intrafirm' is a specialized term primarily used in business, economics, and management contexts. It describes activities or relationships that occur within the boundaries of a single company, as opposed to those between different companies. Understanding this term requires familiarity with business concepts and academic vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The company implemented new policies to improve intrafirm communication.","translation":"その会社は企業内コミュニケーションを改善するために新しい方針を実施しました。","type":"general","meaning_category":"企業内の"},{"sentence":"Intrafirm trade allows multinational corporations to optimize their supply chains.","translation":"企業内貿易により、多国籍企業はサプライチェーンを最適化できます。","type":"economics","meaning_category":"企業内で行われる"},{"sentence":"The research focused on the impact of intrafirm knowledge sharing on innovation.","translation":"その研究は、企業内の知識共有がイノベーションに与える影響に焦点を当てました。","type":"business","meaning_category":"企業内の"}]}