{"word":"DOJ","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"アメリカ合衆国司法省 (United States Department of Justice)","english_definition":"The United States Department of Justice; the federal executive department responsible for the enforcement of the law and administration of justice in the United States.","examples":[{"sentence":"The DOJ is investigating the company for antitrust violations.","translation":"司法省は、その会社を独占禁止法違反で調査している。"},{"sentence":"The Attorney General heads the DOJ.","translation":"司法長官が司法省を率いている。"}],"collocations":["DOJ investigation (司法省の調査)","DOJ lawsuit (司法省の訴訟)","DOJ guidelines (司法省のガイドライン)"],"synonyms":["Department of Justice","Justice Department"],"antonyms":[]}],"etymology":{"value":"An acronym formed from the initial letters of the words in 'Department of Justice'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdiː.oʊˈdʒeɪ/","syllables":"dee-oh-jay"},"inflection":{"notes":"It's a proper noun, so it doesn't have plural or other inflections."},"usage_notes":{"explanation":"'DOJ' is an acronym that refers to the United States Department of Justice. It is commonly used in news reports, legal documents, and other contexts related to law enforcement and legal matters in the United States.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The DOJ are investigating the case.","correct":"✓ The DOJ is investigating the case.","note":"Although 'Department' refers to a collection of people, it is treated as a singular entity, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["Justice Department","Attorney General","FBI","DEA"],"phrases":["DOJ antitrust division","DOJ civil rights division"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively frequent in US-related news and legal contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'DOJ' is an acronym standing for the United States Department of Justice. This term is frequently encountered in news articles, legal documents, and discussions pertaining to law enforcement and legal proceedings within the United States. Understanding this abbreviation is crucial for comprehending discussions related to legal actions, investigations, and policy decisions made by the U.S. government's legal arm."},"example_sentences":[{"sentence":"The DOJ announced indictments against several individuals involved in the scheme.","translation":"司法省はその計画に関与した数名の個人に対する起訴を発表した。","type":"noun","meaning_category":"アメリカ合衆国司法省"},{"sentence":"The DOJ's antitrust division is reviewing the proposed merger.","translation":"司法省の独占禁止部門は、提案された合併を審査している。","type":"noun","meaning_category":"アメリカ合衆国司法省"}]}