{"word":"microculture","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"小規模文化、微小文化：特定の集団や組織内における、より大きな文化とは異なる独自の価値観、規範、行動様式。","english_definition":"A small group within a larger culture that shares distinct values, norms, and behaviors that set them apart.","examples":[{"sentence":"The software development team developed its own microculture, characterized by late-night coding sessions and a shared love of science fiction.","translation":"そのソフトウェア開発チームは、深夜のコーディングセッションとSFへの共通の愛を特徴とする独自の小規模文化を築き上げた。"},{"sentence":"Within the university, each department has its own microculture, influencing how faculty interact and conduct research.","translation":"大学内では、各学科が独自の小規模文化を持ち、教員の交流や研究の進め方に影響を与えている。"},{"sentence":"The microculture of the online gaming community fostered a sense of belonging and shared identity among its members.","translation":"オンラインゲームコミュニティの小規模文化は、メンバー間に帰属意識と共通のアイデンティティを育んだ。"}],"collocations":["develop a microculture (小規模文化を築く)","foster a microculture (小規模文化を育む)","influence a microculture (小規模文化に影響を与える)","organizational microculture (組織内の小規模文化)","team microculture (チーム内の小規模文化)","online microculture (オンラインの小規模文化)"],"synonyms":["subculture","group culture","local culture","niche culture"],"antonyms":["macroculture","dominant culture","mainstream culture"]},{"part_of_speech":"noun","definition":"（微生物学）微生物の微小培養環境。","english_definition":"(Microbiology) A small, controlled environment for culturing microorganisms.","examples":[{"sentence":"The researchers used a microculture to study the growth of bacteria under different conditions.","translation":"研究者たちは、異なる条件下でのバクテリアの成長を研究するために、微小培養環境を使用した。"},{"sentence":"Microcultures allow for precise control over the nutrients and temperature available to the microorganisms.","translation":"微小培養環境は、微生物が利用できる栄養素と温度を正確に制御することを可能にする。"}],"collocations":["create a microculture (微小培養環境を作る)","maintain a microculture (微小培養環境を維持する)","study a microculture (微小培養環境を研究する)"],"synonyms":["microbial culture","small-scale culture"],"antonyms":[]}],"etymology":{"value":"\"micro-\"（小さい）+ \"culture\"（文化、培養）の組み合わせ。社会学的な意味では、1970年代頃から使われ始めた。微生物学的な意味では、より早い時期から使われていた可能性がある。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmaɪkroʊˌkʌltʃər/","syllables":"mi-cro-cul-ture"},"inflection":{"noun_plural":"microcultures"},"usage_notes":{"explanation":"「**microculture**」は、社会学や組織論の分野では、大規模な文化（macroculture）の中に存在する、特定のグループや組織に特有の文化を指します。これは、共通の価値観、信念、行動様式によって特徴づけられます。一方、微生物学の分野では、微生物を培養するための微小な環境を指します。文脈によって意味が異なるため、注意が必要です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company tried to impose a microculture from the top down.","correct":"✓ The company tried to change the microculture from the top down.","note":"小規模文化は自然発生的に生まれることが多く、トップダウンで「impose（押し付ける）」することは難しい。変えようと試みる場合は \"change\" が適切。"},{"incorrect":"✗ The microculture was so small it could only be seen with a microscope.","correct":"✓ The microculture was so distinct it was almost like a separate world.","note":"社会学的な意味での小規模文化は、物理的な大きさではなく、その独自性によって特徴づけられる。"}],"priority":"★★☆"},"related_words":{"derivatives":["multicultural","cross-cultural","subculture","counterculture"],"phrases":["organizational culture","corporate culture","team dynamics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 専門用語に近い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**microculture**」は、主に社会学や組織論で使われる言葉で、大きな文化の中にある、特定のグループだけの小さな文化のことを指します。例えば、会社の中のチームや、趣味のグループなど、共通のルールや考え方を持っている集まりのことです。微生物学では、微生物を育てるための小さな環境を指します。少し難しい言葉ですが、文脈を理解すれば意味を把握できます。"},"example_sentences":[{"sentence":"The hospital's nursing staff had a strong microculture of teamwork and patient care.","translation":"その病院の看護スタッフは、チームワークと患者ケアという強い小規模文化を持っていた。","type":"noun","meaning_category":"社会学・組織論"},{"sentence":"The scientist created a microculture to observe the bacteria's response to antibiotics.","translation":"科学者は、抗生物質に対するバクテリアの反応を観察するために、微小培養環境を作製した。","type":"noun","meaning_category":"微生物学"},{"sentence":"Understanding the microculture of a workplace is essential for effective management.","translation":"職場の小規模文化を理解することは、効果的な経営に不可欠である。","type":"noun","meaning_category":"社会学・組織論"},{"sentence":"The online forum developed a unique microculture with its own slang and inside jokes.","translation":"そのオンラインフォーラムは、独自のスラングと内輪ネタを持つユニークな小規模文化を発展させた。","type":"noun","meaning_category":"社会学・組織論"}]}