{"word":"noneffeteness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of not being effete; lacking in weakness, decadence, or over-refinement.","english_definition":"The absence of effeminacy or decadence; the state of being strong, vigorous, and not excessively refined.","examples":[{"sentence":"His noneffeteness was evident in his robust physique and unwavering determination.","translation":"彼の非軟弱さは、彼の頑健な体格と揺るぎない決意に明らかだった。"},{"sentence":"The society valued noneffeteness, emphasizing physical strength and moral fortitude.","translation":"その社会は非軟弱さを重んじ、体力と道徳的な不屈の精神を強調した。"}],"collocations":["demonstrate noneffeteness","value noneffeteness","lack noneffeteness"],"synonyms":["vigor","robustness","strength","fortitude","resilience"],"antonyms":["effeminacy","decadence","weakness","delicacy"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'effeteness'. 'Effeteness' comes from 'effete', which is derived from Latin 'effetus', meaning 'exhausted' or 'worn out'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnɪˈfiːtnəs/","syllables":"non-ef-fete-ness"},"inflection":{"noun_plural":"noneffetenesses (rarely used)"},"usage_notes":{"explanation":"'Noneffeteness' is a relatively rare and formal word. It is used to describe the absence of qualities associated with being effete, such as weakness, over-refinement, or decadence. The term is often used in discussions of societal values, physical strength, or moral character.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a great noneffete.","correct":"✓ He showed great noneffeteness.","note":"'Noneffeteness' is a noun, so it should be used as such in a sentence. 'Noneffete' is an adjective, but it doesn't fit well in this context."},{"incorrect":"✗ The noneffeteness of the flower was surprising.","correct":"✓ The resilience of the flower was surprising.","note":"'Noneffeteness' is typically used to describe people or societies, not inanimate objects like flowers. Using a word like 'resilience' would be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["non-effete (adjective)"],"phrasal_verbs":[],"related_terms":["effete","effeminacy","decadence","robustness","vigor"]},"level_frequency":{"CEFR":"C2 (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Noneffeteness' is a rare and sophisticated word that describes the absence of weakness or decadence. It's the opposite of being 'effete,' which means depleted, worn out, or over-refined. This word is most often found in formal writing or discussions about societal values and character. Because of its rarity, it's best used when a precise and elevated tone is desired."},"example_sentences":[{"sentence":"The leader's emphasis on physical training aimed to cultivate noneffeteness among the soldiers.","translation":"その指導者の体力トレーニングの重視は、兵士たちの間に非軟弱さを育むことを目的としていた。","type":"noun","meaning_category":"absence of weakness"},{"sentence":"The historical account praised the noneffeteness of the early pioneers, who faced harsh conditions with unwavering resolve.","translation":"その歴史的記述は、初期の開拓者たちの非軟弱さを称賛した。彼らは厳しい状況に揺るぎない決意で立ち向かった。","type":"noun","meaning_category":"absence of decadence"},{"sentence":"Critics argued that the modern emphasis on comfort and convenience was eroding the nation's noneffeteness.","translation":"批評家たちは、現代の快適さと利便性の重視が、国家の非軟弱さを蝕んでいると主張した。","type":"noun","meaning_category":"absence of over-refinement"}]}