{"word":"pasturewise","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"牧草地に関して、牧草地の観点から","english_definition":"With regard to pasture; from the point of view of pasture.","examples":[{"sentence":"Pasturewise, the land is well-suited for grazing.","translation":"牧草地の観点からすると、その土地は放牧に適している。"},{"sentence":"Pasturewise management is essential for sustainable farming.","translation":"牧草地に関する管理は、持続可能な農業に不可欠である。"}],"collocations":["pasturewise management","pasturewise suitable"],"synonyms":["regarding pasture","in terms of pasture"],"antonyms":[]}],"etymology":{"value":"Formed from 'pasture' + 'wise'. The suffix '-wise' indicates direction, position, manner, relation, or respect.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpæstʃərwaɪz/","syllables":"pas-ture-wise"},"inflection":{"notes":"As an adverb, it does not inflect."},"usage_notes":{"explanation":"'Pasturewise' is a relatively uncommon adverb used to specify that a statement or consideration is being made specifically in relation to pasture, its management, or its characteristics. It is often used in agricultural or environmental contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The farmer is pasturewise.","correct":"✓ The farmer is knowledgeable about pasture.","note":"'Pasturewise' is an adverb, not an adjective. It modifies a verb or describes the perspective from which something is viewed, not a person or thing directly."}],"priority":"★☆☆"},"related_words":{"derivatives":["pasture (noun)","-wise (suffix)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pasturewise' is a niche term primarily used in agricultural or ecological discussions. It indicates a perspective specifically focused on pasture and its attributes. Due to its specialized usage, it is not commonly encountered in general English conversation or writing."},"example_sentences":[{"sentence":"Pasturewise, the new fencing system has greatly improved grazing efficiency.","translation":"牧草地の観点から見ると、新しいフェンスシステムは放牧効率を大幅に改善した。","type":"adverb","meaning_category":"牧草地に関して"},{"sentence":"The soil composition, pasturewise, is ideal for supporting a variety of grasses.","translation":"土壌の組成は、牧草地の観点から見ると、多様な草の育成に理想的である。","type":"adverb","meaning_category":"牧草地の観点から"}]}