{"word":"doublelunged","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"having exceptionally large or powerful lungs; capable of great endurance or exertion, especially in activities requiring strong breathing.","english_definition":"Possessing unusually strong or large lungs, enabling great endurance, especially in activities requiring powerful breathing.","examples":[{"sentence":"The doublelunged athlete easily outpaced his competitors in the swimming race.","translation":"その肺活量の多い選手は、水泳レースで競争相手を容易に上回った。"},{"sentence":"Only a doublelunged climber could survive at that altitude without supplemental oxygen.","translation":"補助酸素なしでその高度で生き残ることができるのは、肺活量の多い登山家だけだろう。"}],"collocations":["doublelunged swimmer","doublelunged climber","doublelunged athlete","doublelunged singer"],"synonyms":["strong-lunged","powerful-lunged","deep-chested","robust","vigorous"],"antonyms":["weak-lunged","feeble","frail"]}],"etymology":{"value":"Combination of 'double' (meaning twice or twofold) and 'lunged' (referring to the lungs). The term implies lungs that are significantly larger or more efficient than normal, effectively providing 'double' the capacity or power.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʌbəlˈlʌŋd/","syllables":"dub-ble-lunged"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'doublelunged' is often used figuratively to describe someone with exceptional stamina or the ability to exert themselves greatly, particularly in activities that heavily rely on respiratory capacity. It is not a medical term and is more commonly found in descriptive or narrative contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is doublelunged because he has two lungs.","correct":"✓ He is doublelunged because his lungs are exceptionally strong and large.","note":"The term does not simply mean having two lungs (which is normal for humans), but rather having lungs that are unusually powerful or large."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["lung capacity","stamina","endurance","respiratory system","aerobic capacity"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard language learning contexts)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Doublelunged' is a relatively uncommon adjective used to describe someone with exceptionally strong or large lungs, enabling great endurance, particularly in activities requiring powerful breathing. It's often used figuratively to describe someone with great stamina. Because it's not a common term, understanding its meaning relies on knowing the individual words 'double' and 'lunged' and inferring the combined meaning. It's more likely to be encountered in literature or specialized contexts related to sports or physical endurance.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **doublelunged** freediver held his breath for an astonishing ten minutes.","translation":"その肺活量の多いフリーダイバーは驚くべき10分間息を止めた。","type":"adjective","meaning_category":"having strong lungs"},{"sentence":"She was a **doublelunged** singer, capable of hitting notes that others couldn't sustain.","translation":"彼女は肺活量の多い歌手で、他の人が維持できない音程を出すことができた。","type":"adjective","meaning_category":"having strong lungs"}]}