{"word":"Crambinae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A subfamily of moths in the family Crambidae, commonly known as grass moths or snout moths.","english_definition":"A subfamily of moths in the family Crambidae, commonly known as grass moths or snout moths.","examples":[{"sentence":"The Crambinae are a diverse group of moths found worldwide.","translation":"Crambinaeは世界中で見られる多様なガのグループです。"},{"sentence":"Many Crambinae larvae are pests of grasses and cereal crops.","translation":"多くのCrambinaeの幼虫は、草や穀物の害虫です。"}],"collocations":["grass moths","snout moths","Crambidae family","larval pests"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the genus name *Crambus*, which is of uncertain origin, possibly related to a Germanic word for 'wrinkle' or 'fold', referring to the folded wings of these moths. The suffix '-inae' is a standard zoological suffix indicating a subfamily.","priority":"☆☆☆"},"pronunciation":{"ipa":"/kræmˈbaɪniː/","syllables":"Cram-bi-nae"},"inflection":{"noun_plural":"None (already plural, referring to a group)"},"usage_notes":{"explanation":"*Crambinae* refers specifically to a taxonomic grouping of moths. It's primarily used in scientific contexts, such as entomology or agricultural studies. The term may not be familiar to the general public.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Crambidae (family)","Crambus (genus)"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency (scientific context only)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Crambinae' is a highly specialized term used within the field of entomology to refer to a specific subfamily of moths. Understanding this term requires familiarity with biological taxonomy and the classification of insects. Its usage is limited to scientific research, academic publications, and specialized discussions among entomologists. General readers are unlikely to encounter this term.","priority":"☆☆☆"},"example_sentences":[{"sentence":"Studies on the population dynamics of Crambinae are essential for effective pest management in grasslands.","translation":"草原における効果的な害虫管理には、Crambinaeの個体数動態に関する研究が不可欠です。","type":"scientific","meaning_category":"entomology"},{"sentence":"The taxonomy of Crambinae has been revised several times due to the difficulty in distinguishing species based on morphology alone.","translation":"Crambinaeの分類は、形態だけでは種を区別することが難しいため、何度か改訂されています。","type":"scientific","meaning_category":"entomology"}]}