{"word":"microchemistry","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"微量化学、微量分析","english_definition":"The branch of chemistry that deals with the identification, separation, and quantitative determination of very small amounts of substances.","examples":[{"sentence":"Microchemistry is essential for analyzing trace amounts of pollutants in water samples.","translation":"微量化学は、水サンプル中の微量の汚染物質を分析するために不可欠です。"},{"sentence":"The development of microchemistry techniques has revolutionized forensic science.","translation":"微量化学技術の開発は、法医学を革新しました。"}],"collocations":["trace analysis","quantitative analysis","qualitative analysis","chemical analysis","analytical chemistry"],"synonyms":["trace analysis","microanalysis"],"antonyms":["macrochemistry","large-scale chemistry"]},{"part_of_speech":"noun","definition":"微量化学実験","english_definition":"A chemical experiment performed with very small quantities of materials.","examples":[{"sentence":"The student performed a microchemistry experiment to determine the concentration of the unknown solution.","translation":"学生は未知の溶液の濃度を決定するために微量化学実験を行った。"}],"collocations":["chemical experiment","laboratory experiment","chemical reaction","titration","spectroscopy"],"synonyms":["small-scale experiment"],"antonyms":["large-scale experiment"]}],"etymology":{"value":"Derived from the Greek prefix 'micro-' meaning 'small' and 'chemistry'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪkroʊˈkemɪstri/","syllables":"mi-cro-chem-is-try"},"inflection":{"noun_plural":"microchemistries"},"usage_notes":{"explanation":"Microchemistry focuses on analyzing extremely small samples, often in microliter or even nanoliter volumes. This field is crucial when dealing with limited sample availability, such as in forensic science, environmental monitoring, and biomedical research. It requires specialized techniques and equipment to accurately measure and identify substances at such low concentrations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Microchemistry is the study of large molecules.","correct":"✓ Microchemistry is the study of very small amounts of substances.","note":"Microchemistry deals with small quantities, not large molecules (macromolecules)."},{"incorrect":"✗ Use macrochemistry techniques for microchemistry experiments.","correct":"✓ Use specialized microchemistry techniques for microchemistry experiments.","note":"Microchemistry requires specialized techniques different from those used in macrochemistry."}],"priority":"★★☆"},"related_words":{"derivatives":["microchemical (adjective)","microchemist (noun)"],"related_fields":["analytical chemistry","spectroscopy","chromatography","forensic science","environmental science"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Microchemistry' is a specialized term referring to the branch of chemistry focused on analyzing very small amounts of substances. It's used in contexts where sample size is limited, requiring precise and sensitive analytical techniques. Understanding this term requires familiarity with basic chemistry concepts and an awareness of its applications in fields like forensic science and environmental monitoring."},"example_sentences":[{"sentence":"The forensic scientist used microchemistry to analyze the trace evidence found at the crime scene.","translation":"法医学者は、犯罪現場で見つかった微量の証拠を分析するために微量化学を使用した。","type":"general"},{"sentence":"Microchemistry techniques are essential for studying rare biological samples.","translation":"微量化学技術は、希少な生物学的サンプルを研究するために不可欠です。","type":"application"},{"sentence":"The development of new microchemistry methods has improved the sensitivity of environmental monitoring.","translation":"新しい微量化学的手法の開発により、環境モニタリングの感度が向上した。","type":"development"}]}