{"word":"strych","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(有機化学) ストリクニン (C₂₁H₂₂N₂O₂)","english_definition":"(organic chemistry) strychnine (C₂₁H₂₂N₂O₂). A very bitter, colorless, poisonous, crystalline alkaloid used as a pesticide, particularly for killing rodents.","examples":[{"sentence":"Strych is a highly toxic substance.","translation":"ストリクニンは非常に有毒な物質です。"},{"sentence":"Strych was historically used as a stimulant, but its use is now restricted due to its toxicity.","translation":"ストリクニンは歴史的に刺激剤として使用されていましたが、その毒性のために現在では使用が制限されています。"}],"collocations":["strych poisoning (ストリクニン中毒)"],"synonyms":["strychnine"],"antonyms":[]}],"etymology":{"value":"Derived from strychnine, which comes from the genus name *Strychnos*, from Ancient Greek *στρύχνος* (strúkhnos), a name used for various poisonous plants.","priority":"★★☆"},"pronunciation":{"ipa":"/strɪk/","syllables":"strych (1 syllable)"},"inflection":{"noun_plural":"strychs"},"usage_notes":{"explanation":"'Strych' is a less common, shortened form of 'strychnine'. It refers specifically to the chemical compound. Its usage is primarily in technical or scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used strych as medicine.","correct":"✓ He used strychnine as medicine. (Historically, but highly discouraged now)","note":"Strychnine is highly toxic and not used as medicine today. Historically, it was used in very small doses for some conditions, but this is no longer standard practice."}],"priority":"★★☆"},"related_words":{"derivatives":["strychnine"],"related_terms":["alkaloid","poison","toxic","pesticide"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Strych' is a highly technical term referring to the chemical compound strychnine. It is rarely used outside of scientific or specialized contexts. Understanding requires advanced knowledge of chemistry and toxicology."},"example_sentences":[{"sentence":"The analysis revealed the presence of strych in the sample.","translation":"分析により、サンプル中にストリクニンの存在が明らかになった。","type":"noun","meaning_category":"ストリクニン"},{"sentence":"Strych acts as a neurotoxin, affecting the central nervous system.","translation":"ストリクニンは神経毒として作用し、中枢神経系に影響を与える。","type":"noun","meaning_category":"ストリクニン"}]}