{"word":"spitchcocking","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(料理) スピッチコックにする (鶏などを縦に開いて焼く調理法)","english_definition":"(cooking) Preparing (a fowl) for cooking by splitting it down the backbone and grilling it.","examples":[{"sentence":"He was spitchcocking a chicken for dinner.","translation":"彼は夕食に鶏をスピッチコックにしていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term \"spitchcock\" is of obscure origin, possibly a combination of \"spit\" (referring to roasting on a spit) and \"cock\" (referring to a male chicken). The \"-ing\" suffix denotes the action of doing something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspɪtʃˌkɒkɪŋ/","syllables":"spitch-cock-ing"},"inflection":{"verb_forms":{"present_simple":["spitchcocks"],"past_simple":"spitchcocked","past_participle":"spitchcocked","present_participle":"spitchcocking"}},"usage_notes":{"explanation":"\"Spitchcocking\" refers to a specific method of preparing poultry, typically chicken, by splitting it open along the backbone, flattening it, and then grilling or broiling it. It's a relatively uncommon term, primarily used in culinary contexts.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["spitchcock (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Spitchcocking\" is a very specialized culinary term. It refers to a specific method of preparing poultry, particularly chicken, by splitting it open along the backbone, flattening it, and then grilling or broiling it. Due to its highly specific and uncommon nature, it's not typically encountered outside of professional cooking or historical culinary texts."},"example_sentences":[{"sentence":"The chef demonstrated the art of spitchcocking a pheasant.","translation":"シェフはキジをスピッチコックにする技術を実演した。","type":"verb","meaning_category":"スピッチコックにする"}]}