{"word":"diplasic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(病理学) 二重形成の、異形成と正常構造が混在する","english_definition":"(pathology) Relating to or characterized by diplasia, a condition in which abnormal cells are present along with normal cells.","examples":[{"sentence":"The biopsy revealed a diplasic lesion in the tissue sample.","translation":"生検の結果、組織サンプルに二重形成病変が認められた。"},{"sentence":"Diplasic changes can be indicative of early stages of cancer development.","translation":"二重形成の変化は、癌発生の初期段階を示唆することがある。"}],"collocations":["diplasic lesion","diplasic tissue","diplasic changes"],"synonyms":["dysplastic","neoplastic","hyperplastic"],"antonyms":["normal","healthy","non-diplasic"]}],"etymology":{"value":"Derived from the Greek words 'di-' (meaning 'double' or 'two') and 'plasia' (meaning 'formation' or 'development').","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈpleɪzɪk/","syllables":"di-pla-sic"},"inflection":{"notes":"Adjective, no common inflections beyond comparative/superlative (more diplasic, most diplasic), which are rarely used."},"usage_notes":{"explanation":"'Diplasic' is a term used in pathology to describe a condition where both normal and abnormal (dysplastic) cells are present in a tissue sample. It is often used to describe lesions or changes observed during biopsies or other medical examinations. The term indicates a mixed cellular population, suggesting a potential transition or coexistence of healthy and diseased cells.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said the cells were completely diplasic.","correct":"✓ The doctor said the cells showed diplasic changes.","note":"'Diplasic' describes a state of mixed cells, not a complete transformation. Use 'diplasic changes' or 'diplasic lesion' to indicate the presence of both normal and abnormal cells."}],"priority":"★☆☆"},"related_words":{"derivatives":["diplasy (noun): The condition of having diplasic cells."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary, used in medical contexts)","frequency_google_ngram":"Very low frequency - Primarily used in medical or scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Diplasic' is a highly specialized term used in the field of pathology. It describes a condition where both normal and abnormal cells are present in a tissue sample. This term is typically encountered in medical reports, research papers, or textbooks related to histology, oncology, or diagnostic pathology. Understanding this term requires a background in cell biology and pathology. It is not commonly used in general conversation or non-medical contexts."},"example_sentences":[{"sentence":"Histological analysis revealed a small diplasic area within the esophageal lining.","translation":"組織学的分析により、食道内膜に小さな二重形成領域が認められた。","type":"scientific","meaning_category":"pathology"},{"sentence":"The presence of diplasic cells raised concerns about potential malignant transformation.","translation":"二重形成細胞の存在は、潜在的な悪性転換への懸念を高めた。","type":"medical","meaning_category":"pathology"}]}