{"word":"unprismatically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"プリズムを通さずに、またはプリズムのような効果なしに","english_definition":"Without using a prism; in a way that does not involve or resemble the effects of a prism.","examples":[{"sentence":"The light passed unprismatically through the plain glass.","translation":"光は普通のガラスをプリズムを通さずに通過した。"},{"sentence":"The story was told unprismatically, presenting the facts plainly.","translation":"物語はプリズムを通さずに語られ、事実をありのままに提示した。"}],"collocations":["pass unprismatically","describe unprismatically","view unprismatically"],"synonyms":["directly","plainly","clearly","without refraction"],"antonyms":["prismatically","refractively"]}],"etymology":{"value":"Derived from \"un-\" (not), \"prismatically\" (in a way that involves a prism or its effects), and ultimately from \"prism\" (a transparent solid body used for dispersing light).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnprɪzˈmætɪkli/","syllables":"un-prism-at-i-cal-ly"},"inflection":{"notes":"Adverb, no inflections"},"usage_notes":{"explanation":"\"Unprismatically\" is used to describe something that occurs without the use of a prism or without exhibiting the effects typically associated with prisms, such as the separation of light into its constituent colors. It is relatively rare and often used in technical or descriptive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The image was unprismatically clear.","correct":"✓ The image was prismatically clear.","note":"If an image is clear due to the use of a prism, it should be described as \"prismatically clear,\" not \"unprismatically clear.\""}],"priority":"★★☆"},"related_words":{"derivatives":["unprismatic (adjective)","prism (noun)","prismatic (adjective)","prismatically (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unprismatically\" is a highly specialized term, primarily used in technical or scientific contexts related to optics or descriptive writing where the absence of prismatic effects is relevant. Due to its rarity and specific application, it is unlikely to be encountered outside of advanced or specialized texts."},"example_sentences":[{"sentence":"The light from the laser passed unprismatically through the air, maintaining its coherence.","translation":"レーザーからの光は大気中をプリズムを通さずに通過し、そのコヒーレンスを維持した。","type":"adverb","meaning_category":"optics"},{"sentence":"The author chose to present the events unprismatically, avoiding any subjective interpretation.","translation":"著者は出来事をプリズムを通さずに提示することを選び、主観的な解釈を避けた。","type":"adverb","meaning_category":"descriptive writing"}]}