{"word":"Wickape","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(rare) A type of small, mischievous, and often malevolent spirit or creature in folklore.","english_definition":"A type of small, mischievous, and often malevolent spirit or creature in folklore.","examples":[{"sentence":"The old stories warned of the Wickape, who would lead travelers astray in the woods.","translation":"古い物語は、森の中で旅人を迷わせるウィカペについて警告していた。"}],"collocations":["wickape lore","wickape legends","wickape sightings"],"synonyms":["goblin","imp","sprite","gremlin"],"antonyms":[]}],"etymology":{"value":"Origin is obscure; possibly a regional or dialectal term. Likely a constructed word, combining 'wicked' and 'ape' to suggest a mischievous, ape-like creature.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈwɪkˌeɪp/","syllables":"Wick-ape"},"inflection":{"noun_plural":"Wickapes"},"usage_notes":{"explanation":"The term 'Wickape' is not widely recognized and may be specific to certain regions or folklore traditions. It generally describes a small, troublesome spirit or creature, often associated with forests or wild places. Its usage is rare in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The wickape is a large and friendly creature.","correct":"✓ The wickape is a small and mischievous creature.","note":"Wickapes are typically depicted as small and mischievous, not large and friendly."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - extremely rare word.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Wickape' is a very rare and obscure word, likely encountered only in specific folklore contexts. Understanding requires familiarity with folklore tropes and the ability to infer meaning from context. Due to its rarity, it is not suitable for general English language learners."},"example_sentences":[{"sentence":"Local legends spoke of the wickape hiding in the hollows of old trees.","translation":"地元の伝説では、ウィカペが古い木の空洞に隠れていると言われていた。","type":"noun","meaning_category":"folklore creature"}]}