{"word":"ichneumous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"寄生蜂に似た、寄生蜂のような","english_definition":"Resembling or pertaining to ichneumon wasps; parasitic.","examples":[{"sentence":"The ichneumous insects laid their eggs inside the caterpillar.","translation":"その寄生蜂のような昆虫は、イモムシの中に卵を産み付けた。"},{"sentence":"Ichneumous behavior is a common strategy in certain insect species.","translation":"寄生蜂のような行動は、特定の昆虫種において一般的な戦略である。"}],"collocations":["ichneumous wasp","ichneumous behavior"],"synonyms":["parasitic","parasitical"],"antonyms":["nonparasitic"]}],"etymology":{"value":"Derived from the genus name *Ichneumon*, which comes from the Greek word *ichneumōn* (ἰχνεύμων), meaning 'tracker' or 'footstep follower'. This refers to the behavior of some ichneumon wasps that track down their hosts.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˈnjuːməs/","syllables":"ich-neu-mous"},"inflection":{"notes":"Adjective; comparative and superlative forms (more ichneumous, most ichneumous) exist but are rarely used."},"usage_notes":{"explanation":"The term \"ichneumous\" is primarily used in entomology to describe organisms or behaviors related to ichneumon wasps, which are known for their parasitic habits. It is a relatively uncommon word, mainly encountered in scientific or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant showed ichneumous characteristics.","correct":"✓ The plant showed parasitic characteristics.","note":"\"Ichneumous\" specifically relates to ichneumon wasps or their parasitic behavior, and should not be used to describe parasitic behavior in plants or other organisms."}],"priority":"★☆☆"},"related_words":{"derivatives":["ichneumon (noun): A type of parasitic wasp.","Ichneumonidae (noun): The family of ichneumon wasps."],"related_terms":["parasitoid","parasite"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very low frequency; technical term)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"ichneumous\" is a highly specialized term primarily used in the field of entomology. It describes characteristics or behaviors related to ichneumon wasps, which are known for their parasitic nature. Due to its specific and technical usage, it is unlikely to be encountered outside of scientific contexts. Understanding the term requires familiarity with the biology and behavior of ichneumon wasps."},"example_sentences":[{"sentence":"The ichneumous wasp skillfully deposited its eggs into the unsuspecting caterpillar.","translation":"その寄生蜂は、気づいていないイモムシの中に巧みに卵を産み付けた。","type":"adjective","meaning_category":"寄生蜂に似た"},{"sentence":"Ichneumous wasps play a significant role in controlling populations of other insects.","translation":"寄生蜂は、他の昆虫の個体数を制御する上で重要な役割を果たしている。","type":"adjective","meaning_category":"寄生蜂のような"}]}