{"word":"design-time","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(ソフトウェア開発において)設計時、開発時","english_definition":"Relating to the period when a software application is being designed and developed, as opposed to when it is running.","examples":[{"sentence":"The design-time experience for this control is very intuitive.","translation":"このコントロールの設計時の操作性は非常に直感的です。"},{"sentence":"These properties can only be configured at design-time.","translation":"これらのプロパティは設計時にのみ構成できます。"},{"sentence":"The design-time environment provides tools for creating user interfaces.","translation":"設計時環境は、ユーザーインターフェイスを作成するためのツールを提供します。"}],"collocations":["design-time environment","design-time properties","design-time support","design-time experience","design-time configuration"],"synonyms":["development-time"],"antonyms":["run-time"]},{"part_of_speech":"noun","definition":"(ソフトウェア開発において)設計時、開発時","english_definition":"The period when a software application is being designed and developed.","examples":[{"sentence":"The error occurs at design-time, not run-time.","translation":"エラーは実行時ではなく、設計時に発生します。"},{"sentence":"Design-time is when the developer creates the application's structure.","translation":"設計時とは、開発者がアプリケーションの構造を作成する時期です。"}],"collocations":["at design-time","during design-time"],"synonyms":["development phase"],"antonyms":["run-time"]}],"etymology":{"value":"A compound word formed by combining \"design\" and \"time\", indicating the time period when the design of a software application takes place.","priority":"☆☆☆"},"pronunciation":{"ipa":"/dɪˈzaɪn taɪm/","syllables":"de-sign-time"},"inflection":{"notes":"It is generally used as an uninflected adjective or noun."},"usage_notes":{"explanation":"\"Design-time\" refers to the phase of software development when the application's structure, user interface, and properties are being defined and configured. It contrasts with \"run-time\", which is when the application is executing. Design-time tools and features are used to facilitate the development process. It is commonly used in the context of Integrated Development Environments (IDEs) and visual programming tools.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The design time error.","correct":"✓ The design-time error.","note":"It is a compound word, so it should be written with a hyphen."},{"incorrect":"✗ Design time is more important than run time.","correct":"✓ Design-time is more important than run-time.","note":"When used as an adjective, it should be written with a hyphen."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["run-time","compile-time","development","software development","IDE (Integrated Development Environment)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"\"Design-time\" is a technical term used in software development to describe the period when the software is being designed and developed, as opposed to when it is running (run-time). It refers to the environment and tools used by developers during this phase, such as IDEs and visual designers. Understanding this term is important for those working in software development or related fields."},"example_sentences":[{"sentence":"The visual designer allows developers to create user interfaces at **design-time**.","translation":"ビジュアルデザイナーを使用すると、開発者は**設計時**にユーザーインターフェイスを作成できます。","type":"noun","meaning_category":"開発時"},{"sentence":"The **design-time** properties of the component can be customized in the property grid.","translation":"コンポーネントの**設計時**プロパティは、プロパティグリッドでカスタマイズできます。","type":"adjective","meaning_category":"設計時"},{"sentence":"Many errors can be caught at **design-time** rather than at run-time.","translation":"多くのエラーは、実行時ではなく**設計時**に検出できます。","type":"noun","meaning_category":"開発時"}]}