{"word":"three-iron","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"3番アイアン (ゴルフクラブの一種)","english_definition":"a golf club with a relatively angled face, numbered 3, used for hitting the ball a long distance from the fairway.","examples":[{"sentence":"He used a three-iron to hit the ball over the trees.","translation":"彼は3番アイアンを使ってボールを木の上を越えるように打った。"},{"sentence":"The three-iron is good for shots of around 180 yards.","translation":"3番アイアンは、およそ180ヤードのショットに適している。"}],"collocations":["play with a three-iron (3番アイアンでプレーする)","use a three-iron (3番アイアンを使う)"],"synonyms":["golf club","iron"],"antonyms":[]}],"etymology":{"value":"'Three' refers to the club's number, indicating its loft angle and expected distance. 'Iron' refers to the traditional material used to make the clubhead.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈθriːˌaɪərn/","syllables":"three-i-ron"},"inflection":{"noun_plural":"three-irons"},"usage_notes":{"explanation":"A three-iron is a type of golf club used for long-distance shots from the fairway. It has a lower loft angle than higher-numbered irons, resulting in a lower trajectory and greater distance. However, three-irons are less commonly used by amateur golfers today, as they are more difficult to hit consistently than hybrid clubs or fairway woods.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used three iron to hit the ball.","correct":"✓ He used a three-iron to hit the ball.","note":"'Three-iron' is a specific noun referring to the club, so it typically requires an article ('a' or 'the')."},{"incorrect":"✗ I have three-irons in my bag.","correct":"✓ I have a three-iron in my bag.","note":"If you are referring to having a single three-iron, use the singular form. If you have multiple three-irons (which is uncommon), use the plural 'three-irons'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["golf club","iron","driver","putter","wedge","fairway wood","hybrid"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'three-iron' refers to a specific type of golf club. Understanding its use requires familiarity with golf terminology. It's less common in everyday conversation but relevant in the context of golf. The term is straightforward once the basic concept of golf clubs and their numbering system is understood."},"example_sentences":[{"sentence":"The golfer selected his **three-iron** for the long approach shot.","translation":"そのゴルファーは、長いアプローチショットのために3番アイアンを選んだ。","type":"noun","meaning_category":"golf club"},{"sentence":"With a powerful swing, she sent the ball soaring with her **three-iron**.","translation":"力強いスイングで、彼女は3番アイアンでボールを高く飛ばした。","type":"noun","meaning_category":"golf club"}]}