{"word":"proletarianization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"プロレタリア化：より多くの人々が賃金労働者階級（プロレタリアート）になる過程。特に、以前は独立していた自営業者や農民が、資本主義経済の発展により、自分の生産手段を失い、賃金労働者として働くことを余儀なくされること。","english_definition":"The process whereby more and more people are forced to become wage laborers (proletariat). Specifically, it refers to the process by which previously independent self-employed individuals or farmers lose their means of production due to the development of a capitalist economy and are forced to work as wage laborers.","examples":[{"sentence":"The proletarianization of farmers led to increased urbanization.","translation":"農民のプロレタリア化は、都市化の進展につながった。"},{"sentence":"Globalization has accelerated the proletarianization of workers in developing countries.","translation":"グローバル化は、発展途上国の労働者のプロレタリア化を加速させている。"},{"sentence":"The decline of small businesses contributes to the proletarianization of the middle class.","translation":"中小企業の衰退は、中間層のプロレタリア化に寄与する。"}],"collocations":["accelerated proletarianization (加速されたプロレタリア化)","increased proletarianization (増加したプロレタリア化)","the process of proletarianization (プロレタリア化の過程)","the consequences of proletarianization (プロレタリア化の結果)"],"synonyms":["laborization","working-class formation"],"antonyms":["embourgeoisement","aristocratization","de-proletarianization"]},{"part_of_speech":"noun","definition":"（比喩的に）専門職やホワイトカラー労働者が、単純労働化、低賃金化、不安定化される過程。仕事の自律性や専門性が失われ、管理・監督が強化される状況を指す。","english_definition":"(Figuratively) The process by which professional or white-collar workers experience deskilling, wage stagnation, and job insecurity. It refers to a situation where job autonomy and expertise are lost, and management and supervision are strengthened.","examples":[{"sentence":"The proletarianization of teaching has led to increased stress and burnout among educators.","translation":"教員のプロレタリア化は、教育者のストレスと燃え尽き症候群の増加につながっている。"},{"sentence":"The rise of automation is contributing to the proletarianization of many white-collar jobs.","translation":"自動化の進展は、多くのホワイトカラーの仕事のプロレタリア化に寄与している。"},{"sentence":"Some argue that the gig economy represents a new form of proletarianization.","translation":"ギグエコノミーは、プロレタリア化の新しい形態を表していると主張する人もいる。"}],"collocations":["the proletarianization of labor (労働のプロレタリア化)","the proletarianization of work (仕事のプロレタリア化)","the proletarianization of the middle class (中間層のプロレタリア化)","the proletarianization of professions (専門職のプロレタリア化)"],"synonyms":["deskilling","degradation of labor","Taylorization"],"antonyms":["professionalization","upskilling"]}],"etymology":{"value":"「proletarianize」（プロレタリア化する）という動詞に、名詞を作る接尾辞「-ation」が付いたもの。proletarianize は、proletarian（プロレタリア）に動詞を作る接尾辞「-ize」が付いた形。proletarian は、ラテン語の「proletarius」（子孫しか持たない市民、無産市民）に由来。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌproʊˌlɛtəriənaɪˈzeɪʃən/","syllables":"pro-le-tar-i-an-i-za-tion"},"inflection":{"noun_plural":"proletarianizations (まれに複数形が使われることがある)"},"usage_notes":{"explanation":"「**proletarianization**」は、マルクス主義の社会学や経済学でよく使われる専門用語です。資本主義の発展に伴い、より多くの人々が自分の生産手段を失い、賃金労働者として雇用されるようになる過程を指します。現代では、伝統的なブルーカラー労働者だけでなく、専門職やホワイトカラー労働者も、仕事の単純化や低賃金化、不安定化によってプロレタリア化されるという議論もあります。この言葉は、社会階層の変化や労働条件の悪化を批判的に分析する際に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The proletarianization is good for the economy.","correct":"✓ The proletarianization can have negative consequences for workers.","note":"プロレタリア化は、労働者の権利や生活水準の低下を伴う可能性があるため、必ずしも肯定的な現象とは限りません。"},{"incorrect":"✗ Proletarianization means everyone becomes rich.","correct":"✓ Proletarianization means more people become wage laborers.","note":"プロレタリア化は、富の分配の不均衡を拡大させる可能性があります。"}],"priority":"★☆☆"},"related_words":{"derivatives":["proletarianize (動詞: プロレタリア化する)","proletarian (名詞/形容詞: プロレタリア、プロレタリアの)","proletariat (名詞: プロレタリアート、労働者階級)"],"related_concepts":["class struggle (階級闘争)","capitalism (資本主義)","means of production (生産手段)","alienation (疎外)","exploitation (搾取)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (アカデミックな文脈でのみ使用)","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**proletarianization**」は、社会科学や経済学で使われる専門的な言葉で、一般的にはあまり使われません。これは、社会の中で、より多くの人が自分の土地や道具などの生産手段を持たなくなり、会社や他人からお金をもらって働くようになることを意味します。昔は農家や自営業だった人が、工場などで働くようになるイメージです。最近では、専門的な仕事をしている人も、仕事の内容が簡単になったり、給料が上がりにくくなったりすることも、この言葉で説明されることがあります。この言葉は、社会の変化を分析するときに使われます。"},"example_sentences":[{"sentence":"The **proletarianization** of the peasantry was a major factor in the Russian Revolution.","translation":"農民のプロレタリア化は、ロシア革命の主要な要因であった。","type":"noun","meaning_category":"歴史的文脈"},{"sentence":"Some sociologists argue that the **proletarianization** of the middle class is a growing trend in developed countries.","translation":"一部の社会学者は、中間層のプロレタリア化が先進国で増加傾向にあると主張している。","type":"noun","meaning_category":"現代社会"},{"sentence":"Technological advancements can lead to the **proletarianization** of skilled workers as their jobs become automated.","translation":"技術の進歩は、熟練労働者の仕事が自動化されるにつれて、彼らのプロレタリア化につながる可能性がある。","type":"noun","meaning_category":"技術と労働"}]}