{"word":"Pseudo-messianic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"偽メシア的な、自称メシア的な","english_definition":"Falsely or spuriously claiming to be the messiah or having messianic qualities.","examples":[{"sentence":"The cult leader exhibited pseudo-messianic behavior, convincing followers he was divinely appointed.","translation":"そのカルトの指導者は偽メシア的な振る舞いを見せ、自分は神から任命されたと信者に信じ込ませた。"},{"sentence":"Some political figures are accused of fostering a pseudo-messianic image to gain popular support.","translation":"一部の政治家は、大衆の支持を得るために偽メシア的なイメージを助長していると非難されている。"}],"collocations":["pseudo-messianic leader","pseudo-messianic movement","pseudo-messianic claims","pseudo-messianic complex"],"synonyms":["self-proclaimed messianic","false messianic","quasi-messianic"],"antonyms":["authentically messianic","genuinely messianic"]}],"etymology":{"value":"The word is formed by combining \"pseudo-\" (from Greek ψευδής (pseudḗs) meaning \"false\") with \"messianic\" (relating to the Messiah).","priority":"★★☆"},"pronunciation":{"ipa":"ˌsjuːdoʊmɛsiˈænɪk","syllables":"pseu-do-mes-si-an-ic"},"inflection":{"notes":"Adjective, no inflections"},"usage_notes":{"explanation":"The term \"pseudo-messianic\" is used to describe individuals, groups, or ideas that falsely claim or imitate messianic qualities or roles. This often involves claims of special divine favor, unique insight, or the ability to bring salvation or profound change. It is often used in a critical or skeptical context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a pseudo-messianic, everyone followed him blindly.","correct":"✓ He was pseudo-messianic; everyone followed him blindly.","note":"The term is an adjective, so it describes the person. The semicolon provides a link between the description and the result."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudo (prefix meaning false or fake)","messianic (relating to the Messiah)","messianism (belief in a messiah)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"pseudo-messianic\" is a relatively complex term used to describe something that falsely claims to be messianic or to have messianic qualities. It combines the prefix \"pseudo-\" (meaning false or fake) with \"messianic\" (relating to the Messiah). Understanding the term requires familiarity with the concept of a messiah and the ability to recognize when someone or something is falsely claiming that role. It is often used in discussions of religion, politics, and cults."},"example_sentences":[{"sentence":"The dictator's speeches took on a pseudo-messianic tone, promising a utopian future.","translation":"その独裁者の演説は偽メシア的な口調を帯び、ユートピア的な未来を約束した。","type":"adjective","meaning_category":"偽メシア的な"},{"sentence":"Critics accused the self-help guru of promoting a pseudo-messianic philosophy.","translation":"批評家たちは、その自己啓発の指導者が偽メシア的な哲学を推進していると非難した。","type":"adjective","meaning_category":"偽メシア的な"}]}