{"word":"Unduloid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(数学)定平均曲率を持つ回転面。カテナリーを軸に沿って回転させることで得られる。","english_definition":"(mathematics) A surface of revolution with constant mean curvature, obtained by rotating a catenary about an axis.","examples":[{"sentence":"The unduloid is a minimal surface related to the catenoid and helicoid.","translation":"ウンドロイドは、カテノイドやヘリコイドと関連する極小曲面です。"}],"collocations":["constant mean curvature","surface of revolution","catenary"],"synonyms":["surface of Delaunay"],"antonyms":[]}],"etymology":{"value":"The term \"unduloid\" comes from the Latin word \"unda\" meaning \"wave,\" referring to the wave-like appearance of the surface.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌndjʊlɔɪd/","syllables":"un-du-loid"},"inflection":{"noun_plural":"unduloids"},"usage_notes":{"explanation":"Unduloids are a type of surface studied in differential geometry. They are characterized by their constant mean curvature and their generation by rotating a catenary. The shape of the unduloid depends on the distance between the axis of rotation and the catenary.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["catenoid","helicoid","minimal surface"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'unduloid' is highly specialized and primarily used within the field of differential geometry. Understanding requires familiarity with concepts such as surfaces of revolution, constant mean curvature, and catenaries. It is unlikely to be encountered outside of advanced mathematical contexts."},"example_sentences":[{"sentence":"The unduloid is one of the surfaces of revolution with constant mean curvature.","translation":"ウンドロイドは、定平均曲率を持つ回転面の一つです。","type":"definition","meaning_category":"mathematics"},{"sentence":"The shape of the unduloid depends on the parameters of the generating catenary.","translation":"ウンドロイドの形状は、生成するカテナリーのパラメータに依存します。","type":"example","meaning_category":"mathematics"}]}