{"word":"re-embattle","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び戦闘態勢を整える、再び要塞化する","english_definition":"To fortify again; to restore to a state of military readiness.","examples":[{"sentence":"The troops re-embattled the city after the initial assault.","translation":"軍隊は最初の攻撃の後、都市を再び要塞化した。"},{"sentence":"They needed time to re-embattle their defenses before the next wave of attacks.","translation":"彼らは次の攻撃の波が来る前に、防御を再び戦闘態勢に整える時間が必要だった。"}],"collocations":["re-embattle defenses","re-embattle a city","re-embattle troops"],"synonyms":["refortify","reinforce","rearm","reposition","redeploy"],"antonyms":["abandon","retreat","demilitarize"]}],"etymology":{"value":"\"re-\" (again) + \"embattle\" (to prepare for battle, fortify). The term 'embattle' itself comes from 'battle', reflecting the act of preparing for or engaging in combat.","priority":"★★☆"},"pronunciation":{"ipa":"/riːɪmˈbætəl/","syllables":"re-im-bat-tle"},"inflection":{"verb_forms":{"present_simple":["re-embattle","re-embattles"],"past_simple":"re-embattled","past_participle":"re-embattled","present_participle":"re-embattling"}},"usage_notes":{"explanation":"\"Re-embattle\" is a relatively rare and formal term, primarily used in military or historical contexts. It describes the action of preparing a defensive position or military force for renewed combat. The word emphasizes the restoration of a state of readiness after a previous engagement or period of vulnerability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company re-embattled its marketing strategy.","correct":"✓ The company revised its marketing strategy.","note":"\"Re-embattle\" is specific to military or defensive contexts. For business or strategic adjustments, use terms like \"revise,\" \"retool,\" or \"restrategize.\""},{"incorrect":"✗ They re-embattled the argument.","correct":"✓ They renewed the argument.","note":"\"Re-embattle\" is not typically used for abstract concepts like arguments or debates. Use \"renew,\" \"reignite,\" or \"revisit\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":["embattle (verb: to prepare for battle, fortify)","battlement (noun: a defensive wall with alternating high and low sections)"],"phrases":["re-embattlement (noun: the act of re-embattling)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare, specialized vocabulary)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"re-embattle\" is a formal and uncommon term, primarily used in military or historical contexts. It means to prepare again for battle or to refortify a position. Understanding this word requires a strong vocabulary and familiarity with military terminology. It is not typically used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"After suffering heavy losses, the general ordered his troops to re-embattle along the riverbank.","translation":"甚大な損害を受けた後、将軍は軍隊に川岸に沿って再び戦闘態勢を整えるよう命じた。","type":"verb (vt)","meaning_category":"再び戦闘態勢を整える"},{"sentence":"The castle was re-embattled with stronger walls and towers.","translation":"その城はより強固な壁と塔で再び要塞化された。","type":"verb (vt)","meaning_category":"再び要塞化する"},{"sentence":"The surviving soldiers quickly re-embattled their positions, anticipating another assault.","translation":"生き残った兵士たちは、次の攻撃を予測して、迅速に陣地を再び戦闘態勢に整えた。","type":"verb (vt)","meaning_category":"再び戦闘態勢を整える"}]}