{"word":"iotacisms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"イオタシズム（古代ギリシア語のイオタの発音が変化した結果、異なる綴りの単語が同じ発音になる現象）","english_definition":"The historical change in the pronunciation of ancient Greek, whereby several different spellings came to be pronounced identically as /i/ (the sound of 'i' in 'machine').","examples":[{"sentence":"Iotacisms in Byzantine Greek made it difficult to distinguish between certain words based on pronunciation alone.","translation":"ビザンティン・ギリシア語におけるイオタシズムは、発音だけに基づいて特定の単語を区別することを困難にした。"}],"collocations":["Byzantine iotacisms","ancient Greek iotacisms"],"synonyms":["vocalization","sound shift"],"antonyms":[]}],"etymology":{"value":"Derived from 'iotacism,' which comes from the Greek word 'iota' (ἰῶτα), the name of the Greek letter 'ι'. The suffix '-ism' indicates a linguistic feature or phenomenon.","priority":"★★★"},"pronunciation":{"ipa":"/aɪˈoʊtəsɪzəmz/","syllables":"I-o-ta-ci-sms"},"inflection":{"noun_plural":"iotacisms"},"usage_notes":{"explanation":"'Iotacisms' refers specifically to the linguistic phenomenon in ancient and Byzantine Greek where various vowel and diphthong spellings converged to be pronounced as /i/. This can cause ambiguity in texts if relying solely on pronunciation. It is mainly a term used in historical linguistics and the study of ancient Greek.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The iotacisms caused the alphabet to change.","correct":"✓ The iotacisms caused pronunciation to change.","note":"Iotacisms primarily affect pronunciation, not the spelling of the alphabet itself."}],"priority":"★★☆"},"related_words":{"derivatives":["iotacism (singular form)","iota (Greek letter)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. A specialized term in linguistics.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Iotacisms' is a technical term used in the study of ancient Greek linguistics. It describes the phenomenon where different vowel sounds merged into a single /i/ sound. Understanding this term requires familiarity with historical linguistics and ancient Greek phonology."},"example_sentences":[{"sentence":"The study of iotacisms helps us understand the evolution of Greek pronunciation.","translation":"イオタシズムの研究は、ギリシア語の発音の進化を理解するのに役立つ。","type":"noun","meaning_category":"linguistics"},{"sentence":"Many spelling errors in Byzantine texts can be attributed to iotacisms.","translation":"ビザンティン時代のテキストにおける多くのスペルミスは、イオタシズムに起因すると考えられる。","type":"noun","meaning_category":"linguistics"}]}