{"word":"electroconvulsive","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"電気けいれん性の、電気ショック療法の","english_definition":"Relating to or involving electroconvulsive therapy (ECT).","examples":[{"sentence":"Electroconvulsive therapy is sometimes used to treat severe depression.","translation":"電気けいれん療法は、時に重度のうつ病の治療に用いられる。"}],"collocations":["electroconvulsive therapy","electroconvulsive treatment"],"synonyms":["ECT","electroshock"],"antonyms":[]}],"etymology":{"value":"The term is derived from \"electro-\" (referring to electricity) and \"convulsive\" (referring to convulsions or seizures). It describes the nature of the therapy, which involves inducing controlled seizures using electrical currents.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌlɛktroʊkənˈvʌlsɪv/","syllables":"e-lec-tro-con-vul-sive"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term \"electroconvulsive\" is almost exclusively used in the context of \"electroconvulsive therapy\" (ECT), a psychiatric treatment in which seizures are electrically induced in patients to provide relief from mental disorders. It is important to note that while ECT has a history of controversy, it remains a valid and sometimes life-saving treatment option for certain severe mental illnesses when other treatments have failed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He received electroconvulsive yesterday.","correct":"✓ He received electroconvulsive therapy yesterday.","note":"The term is almost always used in conjunction with \"therapy\" or \"treatment.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["electroconvulsively (adverb)"],"phrasal_verbs":[],"related_terms":["electroconvulsive therapy (ECT)","electroshock therapy","psychiatry","seizure","depression","mental disorder"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"electroconvulsive\" is a technical term primarily used in medical and psychiatric contexts. It is generally encountered in discussions about mental health treatment options, specifically electroconvulsive therapy (ECT). Understanding the term requires some familiarity with medical terminology and psychiatric treatment modalities. It is not a word commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The psychiatrist recommended electroconvulsive therapy for the patient's severe depression.","translation":"精神科医は、患者の重度のうつ病に対して電気けいれん療法を推奨した。","type":"general","meaning_category":"medical"},{"sentence":"Electroconvulsive treatment can be effective in cases where medication is not working.","translation":"電気けいれん療法は、薬物療法が効果を発揮しない場合に有効となりうる。","type":"general","meaning_category":"medical"}]}