{"word":"peelers","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)皮むき器","english_definition":"(plural) A tool used for removing the skin of fruits and vegetables.","examples":[{"sentence":"She used peelers to prepare the carrots for the salad.","translation":"彼女はサラダのために皮むき器を使ってニンジンを準備した。"}],"collocations":["vegetable peelers","potato peelers","fruit peelers"],"synonyms":["paring knife","vegetable scraper"],"antonyms":[]},{"part_of_speech":"noun","definition":"(複数形, スラング, イギリス英語)警察官","english_definition":"(plural, slang, British English) Police officers.","examples":[{"sentence":"The peelers arrived on the scene to control the crowd.","translation":"警察官たちが群衆を制御するために現場に到着した。"}],"collocations":[],"synonyms":["cops","police","bobbies"],"antonyms":[]}],"etymology":{"value":"1.  From the verb 'peel', referring to the action of removing the skin. 2. (Slang) Named after Sir Robert Peel, who established the Metropolitan Police Force in London in 1829.","priority":"★★☆"},"pronunciation":{"ipa":"ˈpiːlərz","syllables":"pee-lers"},"inflection":{"noun_plural":"peelers"},"usage_notes":{"explanation":"The word \"peelers\" has two distinct meanings. The first and more common meaning refers to kitchen utensils used for peeling fruits and vegetables. The second meaning, a slang term for police officers, is primarily used in British English and is derived from Sir Robert Peel, who founded the Metropolitan Police Force in London.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"I saw a peeler in the kitchen.","correct":"I saw a peeler in the kitchen. (If referring to a single peeling tool) / I saw some peelers in the kitchen. (If referring to multiple peeling tools)","note":"When referring to the kitchen utensil, use the singular form 'peeler' for one item and 'peelers' for multiple items. When referring to police officers, 'peelers' is always plural."}],"priority":"★★☆"},"related_words":{"derivatives":["peel (verb, noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"peelers\" can be confusing due to its two different meanings. The primary meaning refers to kitchen tools used for peeling vegetables and fruits, while the slang term refers to police officers, particularly in British English. Context is crucial in determining the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"She bought new vegetable peelers for her kitchen.","translation":"彼女は台所用に新しい野菜の皮むき器を買った。","type":"noun","meaning_category":"kitchen utensil"},{"sentence":"The peelers were called to the scene after the disturbance.","translation":"騒動の後、警察官たちが現場に呼ばれた。","type":"noun","meaning_category":"police officers (slang)"}]}