{"word":"chlorella","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"クロレラ","english_definition":"a single-celled green alga containing high levels of chlorophyll, protein, vitamins, and minerals, often consumed as a dietary supplement.","examples":[{"sentence":"Chlorella is known for its detoxifying properties.","translation":"クロレラは解毒作用があることで知られています。"},{"sentence":"Many people take chlorella supplements for its health benefits.","translation":"多くの人が健康のためにクロレラのサプリメントを摂取しています。"}],"collocations":["chlorella supplement","chlorella powder","chlorella tablets","organic chlorella"],"synonyms":["algae","spirulina"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'chloros' (green) and 'ella' (small), referring to its small size and green color.","priority":"★★☆"},"pronunciation":{"ipa":"/kləˈrɛlə/","syllables":"Chlo-rel-la"},"inflection":{"noun_plural":"chlorellas"},"usage_notes":{"explanation":"Chlorella is primarily used as a dietary supplement due to its high nutrient content. It is often marketed as a detoxifying agent and a source of vitamins and minerals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I eat chlorella every day for protein.","correct":"✓ I take chlorella supplements every day for protein.","note":"While you can eat chlorella directly, it's more common to take it in supplement form (tablets, powder, etc.)."},{"incorrect":"✗ Chlorella is a bacteria.","correct":"✓ Chlorella is an alga.","note":"Chlorella is a type of single-celled green algae, not a bacteria."}],"priority":"★★☆"},"related_words":{"derivatives":["chlorellaceae (family of algae including chlorella)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily in health and nutrition contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Chlorella' is a specialized term primarily used in the context of health, nutrition, and dietary supplements. It refers to a specific type of green algae known for its high nutrient content. Understanding its usage requires some familiarity with health and wellness vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The smoothie contained spinach, kale, and a teaspoon of **chlorella** powder.","translation":"そのスムージーには、ほうれん草、ケール、そして小さじ一杯のクロレラパウダーが入っていました。","type":"noun","meaning_category":"algae"},{"sentence":"Some studies suggest that **chlorella** can help remove heavy metals from the body.","translation":"いくつかの研究では、クロレラが体から重金属を取り除くのに役立つ可能性があると示唆されています。","type":"noun","meaning_category":"algae"},{"sentence":"She adds **chlorella** to her daily diet for its nutritional benefits.","translation":"彼女は栄養上の利点のために、毎日の食事にクロレラを加えています。","type":"noun","meaning_category":"algae"}]}