{"word":"hardnose","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(軽蔑的に)厳格な人、冷酷な人、情け容赦のない人","english_definition":"(disapproving) a tough, uncompromising person; someone who is stern and shows little emotion or sympathy.","examples":[{"sentence":"The boss is a real hardnose; he doesn't care about anyone's feelings.","translation":"ボスは本当に冷酷な人で、誰の気持ちも気にしない。"},{"sentence":"You have to be a hardnose to succeed in this business.","translation":"このビジネスで成功するには、情け容赦のない人になる必要がある。"},{"sentence":"She's known as a hardnose negotiator.","translation":"彼女は冷酷な交渉人として知られている。"}],"collocations":["a real hardnose","a tough hardnose","a hardnose negotiator","a hardnose boss","a hardnose attitude","a hardnose approach"],"synonyms":["tough guy","strict disciplinarian","iron fist","uncompromising person","ruthless person","heartless person"],"antonyms":["softie","pushover","compassionate person","sympathetic person"]},{"part_of_speech":"adjective","definition":"厳格な、冷酷な、情け容赦のない","english_definition":"tough, uncompromising, and showing little emotion or sympathy.","examples":[{"sentence":"He took a hardnose approach to the problem.","translation":"彼はその問題に対して厳格なアプローチを取った。"},{"sentence":"The company adopted a hardnose policy towards absenteeism.","translation":"会社は欠勤に対して情け容赦のない方針を採用した。"},{"sentence":"She has a reputation for being a hardnose manager.","translation":"彼女は冷酷なマネージャーという評判がある。"}],"collocations":["hardnose approach","hardnose policy","hardnose attitude","hardnose tactics","hardnose stance","hardnose management"],"synonyms":["tough","strict","uncompromising","ruthless","stern","heartless"],"antonyms":["soft","lenient","compassionate","sympathetic"]}],"etymology":{"value":"'Hard' + 'nose'. The term likely originated from the image of someone with a stern, unyielding facial expression, particularly around the nose. The 'hard' implies a lack of softness or compassion, while the 'nose' perhaps alludes to a rigid or inflexible demeanor.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɑːrdnoʊz/","syllables":"hard-nose"},"inflection":{"noun_plural":"hardnoses","adjective_forms":{"comparative":null,"superlative":null}},"usage_notes":{"explanation":"'Hardnose' is typically used in a negative or disapproving context to describe someone who is perceived as overly strict, unemotional, and unwilling to compromise. It often implies that the person is more concerned with achieving results than with the well-being or feelings of others. The adjective form is less common than the noun form, but it carries the same negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a hardnose, so he's very popular.","correct":"✓ He's a hardnose, so people are often intimidated by him.","note":"'Hardnose' generally implies a lack of popularity due to the person's strict and uncompromising nature."},{"incorrect":"✗ She's a hardnose because she's very emotional.","correct":"✓ She's a hardnose because she's very unemotional.","note":"'Hardnose' implies a lack of emotion or sympathy, not an abundance of it."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hardnose' is a relatively uncommon word used to describe someone who is seen as very strict and not willing to compromise. It's often used in a negative way, suggesting the person is tough and unemotional. It's more common in informal settings. Understanding the negative connotation is important.","priority":"★★☆"},"example_sentences":[{"sentence":"The new manager is a hardnose who expects everyone to work long hours.","translation":"新しいマネージャーは、誰もが長時間働くことを期待する冷酷な人だ。","type":"noun","meaning_category":"厳格な人"},{"sentence":"The company took a hardnose approach to cutting costs.","translation":"会社はコスト削減に情け容赦のないアプローチを取った。","type":"adjective","meaning_category":"厳格な"},{"sentence":"You have to be a bit of a hardnose to survive in this industry.","translation":"この業界で生き残るには、少し冷酷になる必要がある。","type":"noun","meaning_category":"厳格な人"},{"sentence":"She's known for her hardnose negotiating tactics.","translation":"彼女は冷酷な交渉術で知られている。","type":"adjective","meaning_category":"厳格な"}]}