{"word":"Arabia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アラビア (アラビア半島)","english_definition":"a peninsula in southwestern Asia, bounded by the Red Sea and the Gulf of Aden on the west, the Arabian Sea on the south, and the Gulf of Oman and the Persian Gulf on the east.","examples":[{"sentence":"Saudi Arabia occupies most of the Arabian Peninsula.","translation":"サウジアラビアはアラビア半島の大部分を占めている。"},{"sentence":"Ancient Arabia was a major trading hub.","translation":"古代のアラビアは主要な貿易拠点だった。"}],"collocations":["Arabian Peninsula","Saudi Arabia","Arabian Desert","Arabian Sea","Arabian culture","Arabian horse"],"synonyms":["Arabian Peninsula"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'Arabia', from Greek 'Arabia', possibly from Arabic 'ʿarab' (عَرَب) meaning 'arid land' or 'desert'.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈreɪbiə/","syllables":"A-ra-bi-a"},"inflection":{"noun_plural":"Arabias"},"usage_notes":{"explanation":"'Arabia' typically refers to the geographical region of the Arabian Peninsula. It can also refer to the historical and cultural area associated with the Arab people. When referring to specific countries within the peninsula, it's better to use their individual names (e.g., Saudi Arabia, Yemen, Oman).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to Arabia next year to visit pyramids.","correct":"✓ I am going to Egypt next year to visit pyramids.","note":"Pyramids are primarily located in Egypt, not Arabia (the Arabian Peninsula)."},{"incorrect":"✗ Arabia is a country.","correct":"✓ Arabia is a region.","note":"Arabia is a geographical region, not a single country. It comprises multiple countries."}],"priority":"★★☆"},"related_words":{"derivatives":["Arabian (adjective: relating to Arabia; noun: a person from Arabia)","Arabic (noun: the language of Arabs; adjective: relating to the Arabic language)","Arab (noun: a person of Arab descent)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Moderate frequency","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Arabia' refers to the Arabian Peninsula, a large area in the Middle East. It's not a country itself, but a region containing countries like Saudi Arabia, Yemen, Oman, and others. The word is often used in historical or geographical contexts.","priority":"★★★"},"example_sentences":[{"sentence":"The climate in Arabia is generally hot and dry.","translation":"アラビアの気候は一般的に高温で乾燥している。","type":"general","meaning_category":"climate"},{"sentence":"Many important trade routes passed through Arabia in ancient times.","translation":"古代には多く重要な交易路がアラビアを通っていた。","type":"historical","meaning_category":"history"},{"sentence":"The culture of Arabia is rich and diverse.","translation":"アラビアの文化は豊かで多様だ。","type":"cultural","meaning_category":"culture"},{"sentence":"Oil is a major export from Saudi Arabia, located on the Arabian Peninsula.","translation":"石油はアラビア半島に位置するサウジアラビアの主要な輸出品だ。","type":"economic","meaning_category":"economy"}]}