{"word":"listful","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"Containing or characterized by lists; tending to make lists.","english_definition":"Inclined to make lists; full of lists.","examples":[{"sentence":"She is a listful person, always organizing her tasks into neat lists.","translation":"彼女はリストを作るのが好きな人で、いつも自分のタスクをきちんとリストに整理しています。"},{"sentence":"The project manager's listful approach ensured that no detail was overlooked.","translation":"プロジェクトマネージャーのリストを多用するアプローチのおかげで、細部も見落とされることはありませんでした。"}],"collocations":["listful approach","listful mind","listful planner"],"synonyms":["organized","methodical","systematic","structured"],"antonyms":["disorganized","chaotic","unstructured"]},{"part_of_speech":"adjective","definition":"Abounding in or full of items that could be listed.","english_definition":"Having many things that could be put on a list.","examples":[{"sentence":"The antique shop was listful with fascinating items from different eras.","translation":"そのアンティークショップは、さまざまな時代の魅力的な品々でリストが埋め尽くされそうでした。"},{"sentence":"Her mind was listful of ideas for her next novel.","translation":"彼女の頭の中は、次の小説のアイデアでリストが埋め尽くされそうでした。"}],"collocations":["listful shop","listful mind","listful inventory"],"synonyms":["abundant","plentiful","copious","numerous"],"antonyms":["scarce","lacking","deficient"]}],"etymology":{"value":"Formed by adding the suffix '-ful' (meaning 'full of') to the noun 'list'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪstfʊl/","syllables":"list-ful"},"inflection":{"notes":"Adjective; comparative and superlative forms (more listful, most listful) are possible but less common."},"usage_notes":{"explanation":"'Listful' describes something that either contains many lists or is characterized by the creation and use of lists. It can also describe something that has a lot of items that could be put on a list. It is not a very common word, so it is best used in contexts where its meaning is clear.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The listful was very long.","correct":"✓ The list was very long.","note":"'Listful' is an adjective, not a noun. Use 'list' as the noun."},{"incorrect":"✗ She is very listful.","correct":"✓ She is very fond of making lists. / ✓ She is a listful person.","note":"'Listful' describes a tendency or characteristic, not a current action. Use a phrase like 'fond of making lists' or 'a listful person' to describe someone who likes making lists."}],"priority":"★★☆"},"related_words":{"derivatives":["list (noun)","listless (adjective)"],"phrases":["make a list","to-do list"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Listful' is a relatively uncommon word that describes something characterized by or full of lists, or having many items that could be listed. It is best used in formal or descriptive contexts where its meaning is clear. Because it is not widely used, consider whether a more common synonym might be more effective in conveying your intended meaning."},"example_sentences":[{"sentence":"The office was organized in a highly listful manner, with every task meticulously documented.","translation":"オフィスは非常にリスト化された方法で整理されており、すべてのタスクが細心の注意を払って文書化されていました。","type":"adjective","meaning_category":"Containing lists"},{"sentence":"Her notebook was listful of potential business ventures.","translation":"彼女のノートは、潜在的なビジネスベンチャーのリストでいっぱいでした。","type":"adjective","meaning_category":"Full of items for a list"}]}