{"word":"Collenchyma","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学) 厚角組織：植物の支持組織の一種で、細胞壁が不均一に厚くなっており、成長中の茎や葉柄などに柔軟性と強度を与える。","english_definition":"(Botany) A type of plant tissue that provides support, with cells that have irregularly thickened cell walls, providing flexibility and strength to growing stems and petioles.","examples":[{"sentence":"Collenchyma is found beneath the epidermis in stems and petioles.","translation":"厚角組織は、茎や葉柄の表皮の下に見られる。"},{"sentence":"The unevenly thickened cell walls of collenchyma provide mechanical support.","translation":"厚角組織の不均一に厚くなった細胞壁は、機械的な支持を提供する。"}],"collocations":["collenchyma cell (厚角細胞)","angular collenchyma (角隅厚角組織)","lacunar collenchyma (空隙厚角組織)","lamellar collenchyma (板状厚角組織)"],"synonyms":["supporting tissue","mechanical tissue"],"antonyms":["parenchyma","sclerenchyma"]}],"etymology":{"value":"ギリシャ語の 'kolla' (接着剤) + 'enchyma' (注入) に由来し、細胞壁が厚く接着している様子を表している。","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈlɛŋkɪmə/","syllables":"col-len-chy-ma"},"inflection":{"noun_plural":"collenchymas / collenchyma"},"usage_notes":{"explanation":"Collenchyma is a living tissue, meaning its cells are alive at maturity. It is particularly important in providing support to young, growing plant parts. Unlike sclerenchyma, collenchyma allows for continued growth and flexibility.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Collenchyma is a type of vascular tissue.","correct":"✓ Collenchyma is a type of supporting tissue.","note":"Collenchyma is a supporting tissue, not a vascular tissue (like xylem or phloem)."},{"incorrect":"✗ Collenchyma cells have evenly thickened cell walls.","correct":"✓ Collenchyma cells have unevenly thickened cell walls.","note":"The key characteristic of collenchyma is the uneven or irregular thickening of the cell walls."}],"priority":"★★☆"},"related_words":{"derivatives":["collenchymatous (形容詞: 厚角組織の、厚角組織から成る)"],"phrases":["mechanical strength","plant anatomy","cell wall thickening"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な植物学の文脈)","frequency_google_ngram":"低頻度 (Low frequency) - 植物学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Collenchyma' is a specialized term in plant biology referring to a supporting tissue in plants. It's characterized by living cells with unevenly thickened cell walls, providing flexibility and support to young plant parts. This term is typically encountered in advanced biology or botany contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The celery's crisp texture is due to its prominent collenchyma tissue.","translation":"セロリのパリッとした食感は、顕著な厚角組織によるものである。","type":"general","meaning_category":"組織構造"},{"sentence":"Collenchyma allows young stems to bend without breaking.","translation":"厚角組織は若い茎が折れることなく曲がることを可能にする。","type":"function","meaning_category":"機能"},{"sentence":"Microscopic analysis revealed the presence of angular collenchyma in the leaf petioles.","translation":"顕微鏡分析により、葉柄に角隅厚角組織の存在が明らかになった。","type":"analysis","meaning_category":"分析"}]}