{"word":"stochastically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"確率的に、偶然的に","english_definition":"In a stochastic manner; involving chance or probability.","examples":[{"sentence":"The model was stochastically generated to simulate random events.","translation":"そのモデルは、ランダムな事象をシミュレートするために確率的に生成された。"},{"sentence":"The algorithm stochastically selects a subset of features for training.","translation":"そのアルゴリズムは、トレーニングのために特徴のサブセットを確率的に選択する。"},{"sentence":"The system behaves stochastically, making precise predictions impossible.","translation":"そのシステムは確率的に動作するため、正確な予測は不可能である。"}],"collocations":["stochastically generated","stochastically selected","stochastically modeled","stochastically independent"],"synonyms":["randomly","probabilistically","fortuitously","indeterminately"],"antonyms":["deterministically","predictably","certainly"]}],"etymology":{"value":"Derived from 'stochastic,' which comes from the Greek 'stokhos' meaning 'aim' or 'guess.' It refers to a process or system that involves randomness or probability.","priority":"★★☆"},"pronunciation":{"ipa":"/stoʊˈkæstɪkli/","syllables":"sto-chas-ti-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Stochastically' is used to describe processes or models that incorporate randomness or probability. It is often used in fields like statistics, physics, finance, and computer science to indicate that outcomes are not entirely predictable but rather subject to chance. It is the adverbial form of the adjective 'stochastic.'","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The data was stochastically, so we couldn't analyze it.","correct":"✓ The data was stochastic, so we couldn't analyze it deterministically.","note":"'Stochastically' is an adverb, modifying a verb. 'Stochastic' is an adjective, describing a noun. The sentence should use 'stochastic' to describe the data and 'deterministically' to describe the analysis."},{"incorrect":"✗ We stochastically decided to go to the beach.","correct":"✓ We randomly decided to go to the beach.","note":"While 'stochastically' implies randomness, it's generally used in technical or scientific contexts. For everyday situations, 'randomly' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["stochastic (adjective)","stochasticity (noun)"],"related_terms":["random variable","probability distribution","Markov process","Monte Carlo method"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'stochastically' describes something done in a way that involves randomness or probability. It's often used in technical fields like math, science, and finance to explain that something isn't predictable but has a chance element. For example, a 'stochastically generated' model means the model was created using random processes. It's a more formal and precise way of saying 'randomly.'"},"example_sentences":[{"sentence":"The particles moved stochastically due to Brownian motion.","translation":"粒子はブラウン運動により確率的に移動した。","type":"adverb","meaning_category":"random movement"},{"sentence":"The initial conditions were stochastically varied to test the robustness of the system.","translation":"システムの堅牢性をテストするために、初期条件を確率的に変化させた。","type":"adverb","meaning_category":"random variation"},{"sentence":"The model parameters were stochastically optimized using a genetic algorithm.","translation":"モデルパラメータは、遺伝的アルゴリズムを用いて確率的に最適化された。","type":"adverb","meaning_category":"random optimization"}]}