{"word":"all-season","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"全天候型の、オールシーズンの","english_definition":"Suitable for use in all seasons.","examples":[{"sentence":"These are all-season tires, so you don't need to change them for winter.","translation":"これらはオールシーズンタイヤなので、冬用に交換する必要はありません。"},{"sentence":"She bought an all-season jacket that she can wear year-round.","translation":"彼女は一年中着られる全天候型ジャケットを買いました。"}],"collocations":["all-season tires","all-season jacket","all-season coat","all-season use"],"synonyms":["year-round","versatile","multi-season"],"antonyms":["seasonal","winter","summer"]},{"part_of_speech":"noun","definition":"全天候型製品","english_definition":"A product designed for use in all seasons.","examples":[{"sentence":"The store sells a variety of all-seasons, including tires and clothing.","translation":"その店では、タイヤや衣類など、さまざまな全天候型製品を販売しています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Combination of 'all' and 'season', indicating suitability for all seasons of the year.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɔːlˌsiːzən/","syllables":"all-sea-son"},"inflection":{"notes":"Adjective: all-season (no comparative or superlative forms). Noun: all-seasons (plural)."},"usage_notes":{"explanation":"'All-season' is commonly used to describe products, especially tires and clothing, that are designed to be used throughout the year, regardless of weather conditions. It implies versatility and adaptability.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This tire is all season.","correct":"✓ This is an all-season tire.","note":"When used as an adjective, 'all-season' typically modifies a noun. It is not usually used alone as a predicate adjective."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["seasonal","winter tires","summer tires"],"priority":"★★☆"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively common, especially in the context of automotive and clothing.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"The term 'all-season' means that something can be used during all times of the year, regardless of the weather. It's often used to describe tires or clothing that are designed to be versatile and adaptable to different conditions. For example, 'all-season tires' are made to work well in both warm and cold weather, so you don't have to change them when winter comes."},"example_sentences":[{"sentence":"These all-season tires provide good traction in both wet and dry conditions.","translation":"これらのオールシーズンタイヤは、濡れた路面でも乾いた路面でも優れたトラクションを発揮します。","type":"adjective","meaning_category":"全天候型"},{"sentence":"She invested in an all-season coat that would keep her warm in the winter and dry in the spring.","translation":"彼女は冬は暖かく、春は乾いた状態を保つことができる全天候型コートに投資しました。","type":"adjective","meaning_category":"全天候型"}]}