{"word":"carpingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"あら探しをするように、けちをつけて、文句ばかり言って","english_definition":"in a fault-finding, critical, or complaining manner.","examples":[{"sentence":"He spoke carpingly about the new policy, finding fault with every detail.","translation":"彼は新しい政策について、あらゆる細部に文句をつけ、あら探しをするように話した。"},{"sentence":"She carpingly criticized his work, even though it was clear he had put in a lot of effort.","translation":"彼女は彼の仕事に、彼が多くの努力を払ったことが明らかであるにもかかわらず、けちをつけて批判した。"}],"collocations":["speak carpingly","criticize carpingly","complain carpingly","comment carpingly"],"synonyms":["critically","fault-findingly","captiously","cavilingly","nitpickingly","querulously","grumblingly"],"antonyms":["approvingly","complimentarily","praisingly","supportively"]}],"etymology":{"value":"The word 'carpingly' is derived from the verb 'carp,' which means to find fault or complain pettily. The suffix '-ingly' turns the verb into an adverb, indicating the manner in which the action is performed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɑːrpɪŋli/","syllables":"car-ping-ly"},"inflection":{"notes":"As an adverb, 'carpingly' does not have different forms for tense or number."},"usage_notes":{"explanation":"'Carpingly' describes a way of speaking or behaving that is characterized by persistent and petty criticism. It suggests a negative and often annoying attitude, where the person focuses on minor flaws rather than appreciating the overall value or effort. This word is often used to describe someone who is habitually critical and difficult to please.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She carpingly smiled at him.","correct":"✓ She smiled carpingly at him.","note":"The adverb 'carpingly' should modify verbs related to criticism or complaint, not actions like smiling. A carping smile is possible, but less common than carping criticism."},{"incorrect":"✗ He was carping.","correct":"✓ He was carpingly critical.","note":"'Carping' is the adjective form, while 'carpingly' is the adverb. To describe someone's general tendency to carp, use the adjective. To describe the manner in which they perform an action, use the adverb."}],"priority":"★★☆"},"related_words":{"derivatives":["carp (verb: to find fault or complain pettily; noun: a type of fish)","carper (noun: one who carps)","carping (adjective: fault-finding; critical)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - The word 'carpingly' is not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Carpingly' is an advanced word that describes a specific style of criticism: petty, persistent, and often annoying. It's not a word you'll encounter frequently in everyday conversation, but it's useful for describing someone who habitually finds fault with minor details. Understanding this word can help you express nuanced observations about people's behavior and communication styles."},"example_sentences":[{"sentence":"The reviewer carpingly dissected the film, focusing on minor plot holes and ignoring its artistic merits.","translation":"批評家は映画をあら探しするように分析し、些細なプロットの穴に焦点を当て、芸術的な価値を無視した。","type":"adverb","meaning_category":"criticizing"},{"sentence":"He carpingly pointed out every typo in the report, making it difficult to focus on the important information.","translation":"彼は報告書のすべての誤字をけちをつけて指摘し、重要な情報に集中することを困難にした。","type":"adverb","meaning_category":"fault-finding"},{"sentence":"She carpingly questioned every decision, creating a negative atmosphere in the meeting.","translation":"彼女はすべての決定にあら探しをするように質問し、会議に否定的な雰囲気を作り出した。","type":"adverb","meaning_category":"complaining"}]}