{"word":"Uncanonisation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"聖人列福の取り消し、聖人剥奪","english_definition":"The act of removing someone from the list of recognized saints.","examples":[{"sentence":"The uncanonisation of the controversial saint caused significant debate within the church.","translation":"その物議を醸す聖人の聖人剥奪は、教会内で大きな議論を引き起こした。"}],"collocations":[],"synonyms":["decertification","delisting"],"antonyms":["canonisation","sainthood"]}],"etymology":{"value":"Derived from \"uncanonize\", which is formed by adding the prefix \"un-\" (meaning 'not' or 'reversal') to \"canonize\" (to declare someone a saint).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnkəˌnɒnaɪˈzeɪʃən/","syllables":"un-ca-non-i-sa-tion"},"inflection":{"noun_plural":"Uncanonisations"},"usage_notes":{"explanation":"This term is relatively rare, as the process of uncanonizing a saint is uncommon. It typically occurs when new information comes to light that casts doubt on the individual's worthiness of sainthood.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["uncanonize (verb)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'uncanonisation' is a highly specialized term primarily used within religious or historical contexts. It refers to the formal removal of someone from the list of recognized saints by a church. Due to its specific and infrequent usage, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The historical records suggested the possibility of the king's uncanonisation due to his controversial actions during his reign.","translation":"その歴史的記録は、その王の治世中の物議を醸す行動のために、彼の聖人剥奪の可能性を示唆した。","type":"noun","meaning_category":"聖人剥奪"},{"sentence":"Theologians discussed the criteria that would justify the uncanonisation of a previously recognized saint.","translation":"神学者は、以前に認められた聖人の聖人剥奪を正当化する基準について議論した。","type":"noun","meaning_category":"聖人剥奪"}]}