{"word":"ESF","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(European Social Fundの略)欧州社会基金","english_definition":"(abbreviation for European Social Fund) a fund in the European Union that aims to improve employment opportunities in member states.","examples":[{"sentence":"The project was co-funded by the ESF.","translation":"そのプロジェクトはESFによって共同出資された。"}],"collocations":["ESF funding","ESF project"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(Emergency Support Functionの略)緊急支援機能","english_definition":"(abbreviation for Emergency Support Function) a grouping of governmental and certain private-sector capabilities into an organizational structure to provide support, resources, program implementation, and services to save lives, protect property and the environment, and meet basic human needs.","examples":[{"sentence":"ESF #6 provides mass care, emergency assistance, housing, and human services to disaster survivors.","translation":"ESF #6は、災害生存者に大量のケア、緊急支援、住宅、および人的サービスを提供する。"}],"collocations":["ESF #6 (Mass Care, Emergency Assistance, Housing, and Human Services)","ESF #8 (Public Health and Medical Services)"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(École Supérieure de Fonderieの略)フランスの鋳造高等専門学校","english_definition":"(abbreviation for École Supérieure de Fonderie) a French graduate school specializing in foundry.","examples":[{"sentence":"He graduated from ESF in 1985.","translation":"彼は1985年にESFを卒業した。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Acronym derived from the initial letters of the respective full names (European Social Fund, Emergency Support Function, École Supérieure de Fonderie).","priority":"★★★"},"pronunciation":{"ipa":"/ˌiːˌɛsˈɛf/","syllables":"E-S-F"},"inflection":{"notes":"It is an acronym, so it does not have plural forms."},"usage_notes":{"explanation":"ESF is an acronym that can refer to multiple organizations or functions, depending on the context. It is important to know the context to understand which ESF is being referred to.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ESF are funding the project.","correct":"✓ The ESF is funding the project.","note":"ESF is treated as a singular entity, so the verb should be in the singular form."}],"priority":"★★★"},"related_words":{"derivatives":[],"related_acronyms":["EU (European Union)","FEMA (Federal Emergency Management Agency)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"ESF is an acronym that has different meanings depending on the context. The most common meaning is European Social Fund, which is related to employment opportunities in the EU. Another meaning is Emergency Support Function, which is used in disaster relief. It's essential to know the context to understand the meaning of ESF.","priority":"★★★"},"example_sentences":[{"sentence":"The ESF provides funding for training programs.","translation":"ESFは研修プログラムに資金を提供しています。","type":"noun","meaning_category":"European Social Fund"},{"sentence":"ESF #8 is responsible for coordinating medical services during a disaster.","translation":"ESF #8は、災害時の医療サービスの調整を担当しています。","type":"noun","meaning_category":"Emergency Support Function"}]}