{"word":"metagelatin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"メタゲラチン：ゲラチンが変性したもので、冷水に溶けやすく、ゼリーを形成する能力を失っている。","english_definition":"A denatured form of gelatin that is soluble in cold water and has lost its ability to form a gel.","examples":[{"sentence":"The metagelatin was easily dissolved in the cold water.","translation":"メタゲラチンは冷水に容易に溶解した。"},{"sentence":"Heating gelatin for an extended period can result in the formation of metagelatin.","translation":"ゲラチンを長時間加熱すると、メタゲラチンが生成される可能性がある。"}],"collocations":["cold-water soluble metagelatin","formation of metagelatin","denatured metagelatin"],"synonyms":["denatured gelatin","hydrolyzed gelatin"],"antonyms":["native gelatin"]}],"etymology":{"value":"'Meta-' (ギリシャ語で「変化」を意味する接頭辞) + 'gelatin'。ゲラチンの構造が変化した状態を表す。","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌmɛtəˈdʒɛlətɪn/","syllables":"me-ta-ge-la-tin"},"inflection":{"noun_plural":"metagelatins"},"usage_notes":{"explanation":"メタゲラチンは、通常のゲラチンが熱や酸、アルカリなどの影響を受けて変性した状態を指します。この変性により、ゲラチンは冷水に溶けやすくなり、ゼリーを形成する能力を失います。食品産業や製薬産業において、ゲラチンの品質管理や特性評価の際に重要な概念となります。","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gelatin formed a strong gel even after being heated, so it must be metagelatin.","correct":"✓ The gelatin did not form a gel after being heated, so it must be metagelatin.","note":"メタゲラチンはゼリーを形成する能力を失っているため、加熱後に強いゲルを形成する場合はメタゲラチンではありません。"},{"incorrect":"✗ Metagelatin is used to make strong jellies.","correct":"✓ Gelatin is used to make strong jellies; metagelatin cannot form a gel.","note":"メタゲラチンはゲルを形成できないため、ゼリーの製造には使用されません。"}],"priority":"☆☆☆"},"related_words":{"derivatives":["gelatin","hydrolysis","denaturation"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「**metagelatin**」は、ゲラチンが変性した状態を指す専門用語です。ゲラチンは、コラーゲンを部分的に加水分解して得られるタンパク質であり、加熱や酸、アルカリなどの影響を受けると、その構造が変化します。この変性したゲラチンがメタゲラチンです。メタゲラチンは、通常のゲラチンとは異なり、冷水に溶けやすく、ゼリーを形成する能力を失っています。食品科学や製薬学などの分野で、ゲラチンの品質管理や特性評価に関連して使用されます。専門的な知識が必要となるため、一般的には馴染みのない用語です。"},"example_sentences":[{"sentence":"The sample was identified as metagelatin due to its lack of gelling ability.","translation":"そのサンプルは、ゲル化能力がないため、メタゲラチンであると特定された。","type":"noun","meaning_category":"変性ゲラチン"},{"sentence":"The research focused on the factors that contribute to the conversion of gelatin to metagelatin.","translation":"その研究は、ゲラチンからメタゲラチンへの変換に寄与する要因に焦点を当てた。","type":"noun","meaning_category":"変性ゲラチン"}]}