{"word":"philodoxer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"独断家、自己の意見を絶対視する人","english_definition":"a lover of his own opinion; one who is opinionated or dogmatic.","examples":[{"sentence":"The professor warned his students against becoming philodoxers, urging them to remain open to new ideas.","translation":"教授は学生たちに独断家にならないよう警告し、新しい考えに常に心を開くように促した。"},{"sentence":"He was criticized for being a philodoxer, unwilling to consider alternative viewpoints.","translation":"彼は代替案を考慮しようとせず、独断家であると批判された。"}],"collocations":["a confirmed philodoxer","an incorrigible philodoxer"],"synonyms":["dogmatist","opinionated person","doctrinaire","bigot"],"antonyms":["skeptic","agnostic","open-minded person","inquirer"]},{"part_of_speech":"noun","definition":"（軽蔑的に）知識を軽視して意見を重視する人","english_definition":"(derogatory) one who loves opinion more than knowledge.","examples":[{"sentence":"In his philosophical treatise, he argued that philodoxers often mistake their beliefs for truth.","translation":"彼の哲学論文の中で、彼は独断家がしばしば自分の信念を真実と誤解していると論じた。"},{"sentence":"The philosopher warned against the dangers of philodoxers leading society, as they prioritize belief over reason.","translation":"その哲学者は、独断家が社会を率いることの危険性を警告した。彼らは理性よりも信念を優先するからである。"}],"collocations":["a dangerous philodoxer","a self-proclaimed philodoxer"],"synonyms":["sophist","rhetorician","believer","zealot"],"antonyms":["philosopher","rationalist","intellectual"]}],"etymology":{"value":"Derived from the Greek words 'philos' (loving) and 'doxa' (opinion).","priority":"★★★"},"pronunciation":{"ipa":"/fɪˈlɒdɒksər/","syllables":"phi-lo-dox-er"},"inflection":{"noun_plural":"philodoxers"},"usage_notes":{"explanation":"The term 'philodoxer' is often used in philosophical or academic contexts to describe someone who is overly attached to their own opinions, sometimes to the detriment of reason or knowledge. It carries a negative connotation, implying a lack of intellectual humility or a resistance to changing one's mind in the face of evidence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a philodoxer because he is very intelligent.","correct":"✓ He is a philodoxer because he is unwilling to consider other viewpoints.","note":"Philodoxy is not about intelligence, but about being overly attached to one's own opinions and unwilling to consider alternatives."},{"incorrect":"✗ Philodoxers are always right.","correct":"✓ Philodoxers are often wrong because they are not open to new information.","note":"The term 'philodoxer' implies a negative trait, suggesting a lack of open-mindedness and a tendency to cling to incorrect beliefs."}],"priority":"★★☆"},"related_words":{"derivatives":["philodoxy (noun: love of opinion)"],"related_concepts":["dogmatism","opinionatedness","confirmation bias","intellectual humility"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Philodoxer' is a relatively rare and sophisticated term, primarily used in philosophical or academic discussions. It describes someone who is excessively fond of their own opinions, often to the point of being closed-minded or dogmatic. Understanding this word requires a grasp of abstract concepts and a familiarity with philosophical discourse. It is not typically encountered in everyday language."},"example_sentences":[{"sentence":"The debate was unproductive because both participants were stubborn philodoxers.","translation":"その討論は、参加者双方が頑固な独断家であったため、非生産的だった。","type":"noun","meaning_category":"自己の意見を絶対視する人"},{"sentence":"The article criticized the politician for being a philodoxer who ignored expert advice.","translation":"その記事は、専門家のアドバイスを無視する独断家であるとして、その政治家を批判した。","type":"noun","meaning_category":"知識を軽視して意見を重視する人"}]}