{"word":"nonvariation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"不変、非変異、変化がないこと","english_definition":"The state or quality of not varying; absence of variation or change.","examples":[{"sentence":"The nonvariation in the experimental results was unexpected.","translation":"実験結果における不変性は予想外だった。"},{"sentence":"The principle of nonvariation is crucial in certain scientific models.","translation":"不変性の原理は、特定の科学モデルにおいて重要である。"},{"sentence":"The nonvariation of the gene sequence across generations suggests a strong selective pressure.","translation":"世代を超えた遺伝子配列の不変性は、強い選択圧を示唆している。"}],"collocations":["principle of nonvariation (不変性の原理)","genetic nonvariation (遺伝的不変性)","experimental nonvariation (実験的不変性)"],"synonyms":["constancy","invariance","uniformity","stability","immutability"],"antonyms":["variation","change","mutation","alteration"]}],"etymology":{"value":"\"non-\"（否定の接頭辞）+ \"variation\"（変異、変化）","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnveəriˈeɪʃən/","syllables":"non-var-i-a-tion"},"inflection":{"noun_plural":"nonvariations"},"usage_notes":{"explanation":"\"Nonvariation\" is a formal term, often used in scientific, mathematical, or philosophical contexts. It refers to the lack of change or deviation in a particular property, quantity, or system. It's the opposite of \"variation,\" which implies differences or changes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-variation is good for the experiment.","correct":"✓ The lack of variation is good for the experiment.","note":"While \"nonvariation\" is a valid term, \"lack of variation\" might sound more natural in some contexts. Consider the audience and the specific nuance you want to convey."},{"incorrect":"✗ The nonvariation of the data was surprising.","correct":"✓ The invariance of the data was surprising.","note":"In some scientific fields, \"invariance\" might be a more commonly used synonym for \"nonvariation.\""}],"priority":"★★☆"},"related_words":{"derivatives":["nonvariant (形容詞: 不変の)"],"synonyms":["invariance","constancy","uniformity"],"antonyms":["variation","change","mutation"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonvariation\" is a relatively uncommon and formal term that describes the absence of change or variation. It is often used in scientific, mathematical, or philosophical contexts to emphasize the stability or consistency of a particular system or property. Understanding the term requires a good vocabulary and familiarity with abstract concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The **nonvariation** of the control group's results provided a baseline for comparison.","translation":"対照群の結果の不変性は、比較のための基準を提供した。","type":"noun","meaning_category":"不変性 (実験)"},{"sentence":"Mathematical models often rely on the assumption of **nonvariation** under certain transformations.","translation":"数学モデルはしばしば、特定の変換下での不変性の仮定に依存する。","type":"noun","meaning_category":"不変性 (数学)"},{"sentence":"The **nonvariation** in the species' morphology over millions of years is remarkable.","translation":"数百万年にわたる種の形態の不変性は注目に値する。","type":"noun","meaning_category":"不変性 (生物学)"}]}