{"word":"steam-lancing","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(工業)蒸気ランス法、蒸気ランス処理","english_definition":"An industrial process using a high-pressure steam jet to cut or clean materials, especially in foundries and metalworking.","examples":[{"sentence":"Steam-lancing is used to remove unwanted material from castings.","translation":"蒸気ランス法は、鋳物から不要な物質を除去するために使用されます。"},{"sentence":"The foundry uses steam-lancing to clean the inside of the pipes.","translation":"その鋳造所では、蒸気ランス法を使ってパイプの内側を清掃します。"}],"collocations":["use steam-lancing","perform steam-lancing","steam-lancing process","industrial steam-lancing"],"synonyms":["water jet cutting","hydro-lancing"],"antonyms":[]}],"etymology":{"value":"Combination of 'steam' (water in a gaseous state) and 'lancing' (cutting or piercing with a lance or similar tool), reflecting the process of using a high-pressure steam jet as a cutting or cleaning tool.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstiːmˌlænsɪŋ/","syllables":"steam-lanc-ing"},"inflection":{"noun_plural":"steam-lancings"},"usage_notes":{"explanation":"'Steam-lancing' is a specialized term primarily used in industrial contexts, particularly in foundries and metalworking. It refers to the process of using a high-pressure jet of steam to cut, clean, or remove materials. The term is relatively uncommon in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used steam-lancing to clean my kitchen.","correct":"✓ I used a steam cleaner to clean my kitchen.","note":"Steam-lancing is generally an industrial process, not for household cleaning. Use 'steam cleaner' for household applications."},{"incorrect":"✗ Steam-lancing is the same as sandblasting.","correct":"✓ Steam-lancing uses high-pressure steam, while sandblasting uses abrasive particles.","note":"Steam-lancing uses high-pressure steam, while sandblasting uses abrasive particles propelled by compressed air."}],"priority":"★★☆"},"related_words":{"derivatives":["steam","lance","lancing"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical vocabulary)","frequency_google_ngram":"Low frequency (Specific industrial term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Steam-lancing' is a highly technical term specific to industrial processes. Understanding requires familiarity with manufacturing and metalworking contexts. It involves the use of high-pressure steam jets for cutting or cleaning, primarily in foundries. Due to its specialized nature, it's not commonly encountered outside of these fields."},"example_sentences":[{"sentence":"The steel mill uses steam-lancing to remove scale from the newly produced sheets.","translation":"その製鉄所では、蒸気ランス法を使って製造されたばかりの鋼板からスケールを除去します。","type":"noun","meaning_category":"industrial process"},{"sentence":"Effective steam-lancing requires careful control of steam pressure and nozzle distance.","translation":"効果的な蒸気ランス法には、蒸気圧とノズル距離の慎重な制御が必要です。","type":"noun","meaning_category":"industrial process"}]}