{"word":"indocile","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"言うことを聞かない、しつけにくい、手に負えない","english_definition":"unwilling to be taught or led; stubborn; intractable; difficult to manage or discipline.","examples":[{"sentence":"The indocile child refused to obey his parents.","translation":"その言うことを聞かない子供は、両親の言うことを拒んだ。"},{"sentence":"An indocile horse can be dangerous to ride.","translation":"しつけにくい馬は乗るのが危険なことがある。"},{"sentence":"His indocile nature made him a difficult student.","translation":"彼の手に負えない性質は、彼を扱いにくい生徒にした。"}],"collocations":["indocile child","indocile horse","indocile nature","indocile spirit","indocile temperament"],"synonyms":["unruly","disobedient","rebellious","stubborn","intractable","wayward","willful","unmanageable","insubordinate"],"antonyms":["docile","obedient","tractable","manageable","submissive"]}],"etymology":{"value":"Derived from Latin 'indocilis', meaning 'not easily taught'. 'In-' means 'not', and 'docilis' means 'easily taught' (from 'docere' meaning 'to teach').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪndɒsaɪl/","syllables":"in-doc-ile"},"inflection":{"notes":"Adjective; comparative: more indocile, superlative: most indocile"},"usage_notes":{"explanation":"'Indocile' describes someone or something that is resistant to being taught, trained, or controlled. It often implies a stubborn or rebellious nature. It is a more formal word than 'disobedient' or 'unruly'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dog was indocile because it was tired.","correct":"✓ The dog was disobedient because it was tired.","note":"'Indocile' suggests a more inherent resistance to being taught or led, while 'disobedient' simply means not following instructions at a particular time."},{"incorrect":"✗ The indocile student was praised for his creativity.","correct":"✓ The rebellious student was praised for his creativity.","note":"While 'indocile' can sometimes overlap with 'rebellious', 'rebellious' better captures the idea of actively opposing authority or norms, which might be linked to creativity."}],"priority":"★☆☆"},"related_words":{"derivatives":["indocility (noun): the state of being indocile"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Indocile' is a relatively rare and formal word that describes someone or something that is difficult to teach, manage, or control. It suggests a stubborn or rebellious nature and resistance to instruction or guidance. It's not commonly used in everyday conversation but may appear in literature or formal writing."},"example_sentences":[{"sentence":"The trainer struggled with the indocile lion during the circus act.","translation":"その調教師は、サーカスの演技中に、言うことを聞かないライオンに苦労した。","type":"adjective","meaning_category":"difficult to manage"},{"sentence":"Her indocile spirit made it difficult for her to conform to societal expectations.","translation":"彼女の手に負えない精神は、彼女が社会の期待に従うことを困難にした。","type":"adjective","meaning_category":"rebellious"},{"sentence":"Despite numerous attempts, the farmer couldn't break the indocile horse.","translation":"数多くの試みにもかかわらず、その農夫は、しつけにくい馬を慣らすことができなかった。","type":"adjective","meaning_category":"stubborn"}]}