{"word":"owner-installed","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"オーナー自身が設置した、所有者が自分で取り付けた","english_definition":"Installed by the owner of the property or item, rather than by a professional.","examples":[{"sentence":"The solar panels were owner-installed to save on labor costs.","translation":"人件費を節約するために、ソーラーパネルはオーナー自身が設置した。"},{"sentence":"The owner-installed security system wasn't as reliable as a professionally installed one.","translation":"オーナー自身が設置したセキュリティシステムは、専門業者が設置したものほど信頼性が高くなかった。"},{"sentence":"We found several owner-installed modifications to the plumbing that didn't meet code.","translation":"配管には、オーナー自身が設置した、規定に適合しない改造がいくつか見つかった。"}],"collocations":["owner-installed solar panels","owner-installed security system","owner-installed modifications","owner-installed equipment"],"synonyms":["self-installed","DIY installed"],"antonyms":["professionally installed","contractor-installed"]}],"etymology":{"value":"Combination of 'owner' (the person who owns something) and 'installed' (put in place or fixed in position).","priority":"low"},"pronunciation":{"ipa":null,"syllables":"own-er-in-stalled"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"This term is commonly used in contexts such as home improvement, real estate, and insurance, to describe installations or modifications done by the property owner themselves, often without professional help. It can imply cost savings but also potentially lower quality or compliance with regulations.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The owner installed it by himself.","correct":"✓ The solar panel was owner-installed.","note":"'Owner-installed' is an adjective describing the item. 'He installed it himself' is a correct alternative phrasing."}],"priority":"low"},"related_words":{"derivatives":["owner (noun)","install (verb)","installation (noun)","DIY (Do-It-Yourself) (adjective/noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"low"},"readability_explanation":{"level":"B2","text":"The term 'owner-installed' is a compound adjective that describes something that has been installed by the owner of a property or item, rather than by a professional. It is commonly used in contexts where the installation method is relevant, such as when discussing the quality, safety, or compliance of an installation. Understanding this term requires familiarity with the individual words 'owner' and 'installed', as well as the concept of self-installation or DIY (Do-It-Yourself) projects."},"example_sentences":[{"sentence":"The house had owner-installed flooring in the living room.","translation":"その家のリビングルームには、オーナー自身が設置した床材が使われていた。","type":"adjective","meaning_category":"general"},{"sentence":"The insurance company wouldn't cover the damage caused by the owner-installed wiring.","translation":"保険会社は、オーナー自身が設置した配線が原因で発生した損害については補償しなかった。","type":"adjective","meaning_category":"insurance"}]}