{"word":"lupulinic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ホップのルプリンに関する、またはルプリンに由来する","english_definition":"Relating to or derived from lupulin, the yellowish powder in hops.","examples":[{"sentence":"Lupulinic acids contribute to the bitterness of beer.","translation":"ルプリン酸はビールの苦味に寄与する。"},{"sentence":"The lupulinic glands are found on the hop cones.","translation":"ルプリン腺はホップの毬果に見られる。"}],"collocations":["lupulinic acid","lupulinic gland"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'lupulin', the active ingredient in hops, with the suffix '-ic' indicating 'relating to'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌluːpjʊˈlɪnɪk/","syllables":"lu-pu-lin-ic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Lupulinic' is a technical term primarily used in the context of brewing and botany, specifically referring to the chemical compounds and structures found in lupulin, the resinous powder produced by hop plants. It is not a commonly used word outside of these specialized fields.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["lupulin","lupulone","humulone"],"related_terms":["hop","beer","brewing"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'lupulinic' is highly specialized and technical, primarily used in brewing science and botany. Understanding requires familiarity with the composition and properties of hops, specifically the lupulin glands and their chemical constituents. Due to its limited application, it is not typically encountered in general English contexts."},"example_sentences":[{"sentence":"The aroma of this beer is heavily influenced by the lupulinic oils from the Cascade hops.","translation":"このビールの香りは、カスケードホップのルプリン油に大きく影響されている。","type":"adjective","meaning_category":"Relating to lupulin"},{"sentence":"Analysis of the lupulinic content helps determine the quality of the hops.","translation":"ルプリン含有量の分析は、ホップの品質を判断するのに役立つ。","type":"adjective","meaning_category":"Relating to lupulin"}]}