{"word":"semipastorally","priority":"Low","meanings":[{"part_of_speech":"adverb","definition":"部分的に牧歌的に。牧歌的な要素を一部含んで。","english_definition":"In a manner that is partly pastoral; with some pastoral elements.","examples":[{"sentence":"The scene was depicted semipastorally, blending rural simplicity with hints of modern life.","translation":"その場面は、田舎の素朴さと現代生活のヒントを混ぜ合わせ、部分的に牧歌的に描かれていた。"},{"sentence":"The garden was designed semipastorally, featuring both cultivated areas and wild, natural sections.","translation":"その庭園は、栽培されたエリアと野生の自然なセクションの両方を特徴とし、部分的に牧歌的に設計されていた。"}],"collocations":["depicted semipastorally","designed semipastorally","arranged semipastorally"],"synonyms":["partially pastorally","somewhat idyllically","partly rurally"],"antonyms":["urbanly","industrially","metropolitanly"]}],"etymology":{"value":"The word is formed by combining \"semi-\" (meaning partly or half) with \"pastorally\" (in a pastoral manner), indicating a partial or incomplete adherence to pastoral ideals or characteristics.","priority":"Medium"},"pronunciation":{"ipa":"/ˌsɛmipaˈstɔːrəli/","syllables":"se-mi-pas-tor-al-ly"},"inflection":{"notes":"Adverbs do not typically inflect.","adverb_forms":[]},"usage_notes":{"explanation":"The adverb \"semipastorally\" is used to describe something that exhibits some, but not all, of the characteristics of a pastoral setting or style. It suggests a blend of pastoral elements with other influences, creating a nuanced or mixed atmosphere.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was semipastoral, it showed some city elements.","correct":"✓ The painting was depicted semipastorally; it showed some city elements.","note":"The adverb 'semipastorally' should be used to modify the verb, not the noun. Use the adjective 'semipastoral' to describe the noun."}],"priority":"Low"},"related_words":{"derivatives":["semipastoral (adjective)","pastoral (adjective, noun)","pastorally (adverb)"],"related_concepts":["pastoralism","idyll","bucolic"],"priority":"Medium"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"The word 'semipastorally' is a niche adverb used to describe something done in a manner that is partly pastoral. It is not commonly used and would be understood primarily by those with a strong vocabulary and understanding of literary or artistic terms.","priority":"Low"},"example_sentences":[{"sentence":"The landscape was treated semipastorally, with manicured lawns giving way to untamed meadows.","translation":"その風景は、手入れの行き届いた芝生が手付かずの牧草地に変わるように、部分的に牧歌的に扱われていた。","type":"adverb","meaning_category":"Partly pastoral"}]}