{"word":"salary-based","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"給与制の、年俸制の","english_definition":"Determined or calculated according to a fixed salary, rather than hourly wages or commission.","examples":[{"sentence":"The company offers a salary-based compensation package.","translation":"その会社は給与制の報酬制度を提供しています。"},{"sentence":"He prefers a salary-based job to one that relies on commissions.","translation":"彼は歩合制の仕事よりも給与制の仕事を好みます。"},{"sentence":"Salary-based employees typically receive benefits such as health insurance and paid time off.","translation":"給与制の従業員は通常、健康保険や有給休暇などの福利厚生を受けます。"}],"collocations":["salary-based job","salary-based compensation","salary-based position","salary-based employee","salary-based income"],"synonyms":["salaried","fixed-salary","annual-salary"],"antonyms":["hourly","commission-based","wage-based"]}],"etymology":{"value":"The term 'salary-based' is a compound adjective formed by combining the noun 'salary' with the suffix '-based,' indicating that something is determined or calculated on the basis of a salary.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsæləriˌbeɪst/","syllables":"sal-a-ry-based"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Salary-based' is used to describe jobs, compensation packages, or income that are calculated or determined based on a fixed salary. This contrasts with hourly wages, where employees are paid for each hour worked, or commission-based compensation, where earnings depend on sales or performance. Salary-based positions often offer more stability and predictability in income compared to other forms of compensation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is salary based.","correct":"✓ He is a salary-based employee. / ✓ His job is salary-based.","note":"'Salary-based' is an adjective and needs to modify a noun. It cannot be used alone to describe a person."},{"incorrect":"✗ The salary based is good.","correct":"✓ The salary-based compensation is good.","note":"'Salary-based' needs to modify a noun to describe what is based on a salary."}],"priority":"★★☆"},"related_words":{"derivatives":["salary","salaried"],"phrasal_verbs":[],"related_concepts":["wage","commission","hourly rate","annual income","compensation package","benefits","payroll"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but common in business and HR contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Salary-based' is a term used to describe a job or compensation where you receive a fixed amount of money regularly (usually annually, divided into smaller payments). This is different from getting paid by the hour or earning commission based on sales. It's commonly used in business and human resources contexts.","priority":"★★★"},"example_sentences":[{"sentence":"Our company offers a generous salary-based compensation package with excellent benefits.","translation":"当社は、優れた福利厚生を備えた、手厚い給与制の報酬制度を提供しています。","type":"example","meaning_category":"給与制の報酬制度"},{"sentence":"Many professionals prefer salary-based positions for the stability and predictability they offer.","translation":"多くの専門家は、給与制の仕事が提供する安定性と予測可能性を好みます。","type":"example","meaning_category":"給与制の仕事"},{"sentence":"The salary-based income allows him to plan his finances more effectively.","translation":"給与制の収入により、彼はより効果的に財政計画を立てることができます。","type":"example","meaning_category":"給与制の収入"}]}