{"word":"antidromy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学) (火成岩における)斑晶の結晶面が、基質を構成する鉱物の流れ構造と逆向きに配列する現象。","english_definition":"(geology) A phenomenon in igneous rocks where phenocrysts are oriented with their crystal faces opposite to the flow structure of the groundmass minerals.","examples":[{"sentence":"The antidromy observed in the granite sample suggests complex magmatic processes.","translation":"その花崗岩のサンプルに見られる反流構造は、複雑なマグマのプロセスを示唆している。"}],"collocations":["exhibit antidromy","observe antidromy","antidromy in granite","antidromy in igneous rocks"],"synonyms":["counterflow orientation","reverse alignment"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'anti' (against) and 'dromos' (running), referring to the 'running against' or 'opposite direction' of the phenocrysts compared to the groundmass flow.","priority":"★★☆"},"pronunciation":{"ipa":"/ænˈtɪdrəmi/","syllables":"an-ti-dro-my"},"inflection":{"noun_plural":"antidromies"},"usage_notes":{"explanation":"Antidromy is a specific geological term used to describe a particular alignment of crystals in igneous rocks. It is relatively rare and indicates specific conditions during the rock's formation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock showed antidromy because it cooled quickly.","correct":"✓ The rock showed antidromy, suggesting complex magmatic processes.","note":"Antidromy is not directly caused by cooling rate but by more complex factors in magma flow and crystallization."}],"priority":"★☆☆"},"related_words":{"derivatives":["antidromic (adjective)"],"phrases":["flow structure","groundmass","phenocryst","igneous rock","magmatic processes"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a specialized geological term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Antidromy' is a highly specialized geological term referring to the reverse alignment of phenocrysts relative to the flow structure in igneous rocks. Understanding this term requires a background in geology and petrology. It describes a specific textural feature that provides insights into the magmatic processes during rock formation."},"example_sentences":[{"sentence":"Microscopic analysis revealed clear antidromy in the porphyritic texture of the basalt.","translation":"顕微鏡分析により、玄武岩の斑状組織に明瞭な反流構造が認められた。","type":"technical","meaning_category":"geology"},{"sentence":"The presence of antidromy suggests that the phenocrysts crystallized early and were subsequently reoriented by magma flow.","translation":"反流構造の存在は、斑晶が早期に結晶化し、その後マグマの流れによって再配向されたことを示唆している。","type":"technical","meaning_category":"geology"}]}