{"word":"hypnotizability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"催眠感受性、被暗示性","english_definition":"The degree to which a person is susceptible to hypnosis.","examples":[{"sentence":"Her high hypnotizability made her an excellent subject for the study.","translation":"彼女の高い催眠感受性により、彼女は研究の優れた被験者となった。"},{"sentence":"Hypnotizability varies greatly from person to person.","translation":"催眠感受性は人によって大きく異なる。"},{"sentence":"Researchers use standardized scales to measure hypnotizability.","translation":"研究者たちは催眠感受性を測定するために標準化された尺度を用いる。"}],"collocations":["high hypnotizability (高い催眠感受性)","low hypnotizability (低い催眠感受性)","measure hypnotizability (催眠感受性を測定する)","assess hypnotizability (催眠感受性を評価する)","test for hypnotizability (催眠感受性をテストする)"],"synonyms":["suggestibility","susceptibility to hypnosis"],"antonyms":["resistance to hypnosis","hypnotic insensitivity"]}],"etymology":{"value":"\"Hypnotizability\" is derived from \"hypnotize\" (to induce hypnosis) + \"-ability\" (suffix indicating capacity or tendency). \"Hypnotize\" comes from \"hypnosis,\" which is named after Hypnos, the Greek god of sleep.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɪp.nə.taɪ.zəˈbɪl.ə.ti/","syllables":"hyp-no-ti-za-bil-i-ty"},"inflection":{"noun_plural":"hypnotizabilities (rarely used)"},"usage_notes":{"explanation":"\"Hypnotizability\" refers to the inherent capacity of an individual to experience hypnotic effects. It is considered a relatively stable trait, meaning that a person's level of hypnotizability tends to remain consistent over time. It is typically assessed using standardized scales or tests, such as the Stanford Hypnotic Susceptibility Scale (SHSS) or the Harvard Group Scale of Hypnotic Susceptibility (HGSHS). High hypnotizability does not necessarily equate to being easily manipulated or controlled; rather, it indicates a greater capacity for focused attention, absorption, and imaginative involvement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The hypnotizability of the situation was high.","correct":"✓ The hypnotizability of the subject was high.","note":"\"Hypnotizability\" refers to a characteristic of a person, not a situation. It describes how easily a person can be hypnotized, not the hypnotic quality of a situation."},{"incorrect":"✗ Hypnotizability can be increased with practice.","correct":"✓ While some studies suggest limited trainability, hypnotizability is generally considered a stable trait.","note":"While some techniques may enhance hypnotic responsiveness, core hypnotizability is generally considered a relatively stable trait that is not easily altered through practice."}],"priority":"★★☆"},"related_words":{"derivatives":["hypnotize (verb: to induce hypnosis)","hypnosis (noun: the state of being hypnotized)","hypnotic (adjective: relating to hypnosis)","hypnotist (noun: a person who induces hypnosis)","suggestibility (noun: the quality of being easily influenced by suggestions)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Hypnotizability\" is a specialized term primarily used in psychology and related fields. It refers to an individual's capacity to experience the effects of hypnosis. Understanding this term requires familiarity with the concept of hypnosis and its applications in research and therapy. The word itself is complex, consisting of multiple syllables and derived from other related terms like \"hypnosis\" and \"hypnotize.\" Its use is generally limited to contexts where hypnosis and suggestibility are being discussed in a scientific or clinical manner."},"example_sentences":[{"sentence":"The study aimed to determine the correlation between personality traits and hypnotizability.","translation":"その研究は、性格特性と催眠感受性の相関関係を明らかにすることを目的としていた。","type":"general","meaning_category":"general"},{"sentence":"Individuals with high hypnotizability often report vivid and immersive hypnotic experiences.","translation":"催眠感受性の高い人は、鮮やかで没入感のある催眠体験を報告することが多い。","type":"general","meaning_category":"general"},{"sentence":"The assessment of hypnotizability is a crucial step in many clinical hypnosis protocols.","translation":"催眠感受性の評価は、多くの臨床催眠プロトコルにおいて重要なステップである。","type":"clinical","meaning_category":"clinical"}]}