{"word":"airproofs","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 気密性のあるもの、気密構造","english_definition":"plural of airproof: objects or structures that are impermeable to air or gas.","examples":[{"sentence":"The container is made of special airproofs to keep the food fresh.","translation":"その容器は食品を新鮮に保つために特別な気密性のある素材で作られている。"},{"sentence":"The laboratory requires airproofs to prevent contamination.","translation":"その実験室は汚染を防ぐために気密構造を必要とする。"}],"collocations":["airproof container","airproof seal","airproof construction"],"synonyms":["airtight","sealed","impermeable"],"antonyms":["permeable","leaky","ventilated"]}],"etymology":{"value":"Derived from 'airproof', which combines 'air' (referring to the atmosphere or gases) and 'proof' (meaning resistant or impervious to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛərˌpruːfs/","syllables":"air-proofs"},"inflection":{"noun_plural":"airproofs"},"usage_notes":{"explanation":"'Airproofs' is the plural form of 'airproof', which is less commonly used as a noun. It typically refers to multiple items or features that are designed to be airtight. The singular form 'airproof' is more frequently used as an adjective.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The airproofs is important for preserving food.","correct":"✓ The airproof is important for preserving food. / ✓ Airproof containers are important for preserving food.","note":"When referring to the general concept of being airproof, use the singular form 'airproof' as an adjective. When referring to multiple airproof items, use the plural 'airproofs' or a more descriptive phrase like 'airproof containers'."}],"priority":"★★☆"},"related_words":{"derivatives":["airproof (adjective: 気密の)","airproof (noun: 気密性)"],"phrasal_verbs":[],"related_terms":["airtight","sealant","insulation"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'airproofs' is a technical term used to describe multiple items or structures that are designed to be airtight. It is less common than the adjective 'airproof' or related terms like 'airtight'. It's typically encountered in contexts related to food preservation, laboratory equipment, or construction where preventing air or gas leakage is crucial."},"example_sentences":[{"sentence":"The museum used special airproofs to protect the artifacts from environmental damage.","translation":"博物館は、環境による損傷から工芸品を保護するために特別な気密構造を使用した。","type":"noun","meaning_category":"気密構造"},{"sentence":"We need to order more airproofs for the storage of sensitive materials.","translation":"機密物質の保管のため、より多くの気密性のあるものを注文する必要がある。","type":"noun","meaning_category":"気密性のあるもの"}]}