{"word":"pallholder","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"One who holds a pall, especially at a funeral.","english_definition":"A person who holds one of the corners or sides of a pall, especially at a funeral.","examples":[{"sentence":"The Duke of Edinburgh's pallholders included members of the Royal Marines.","translation":"エディンバラ公の霊柩を覆う布を持つ人々には、王室海兵隊のメンバーが含まれていました。"},{"sentence":"As a mark of respect, several senior officers served as pallholders at the general's funeral.","translation":"敬意を表して、数人の上級士官が将軍の葬儀で霊柩を覆う布を持ちました。"}],"collocations":["act as pallholder","serve as pallholder","honorary pallholder"],"synonyms":["pallbearer"],"antonyms":[]}],"etymology":{"value":"Combination of 'pall' (a cloth spread over a coffin) and 'holder' (one who holds).","priority":"★★☆"},"pronunciation":{"ipa":"ˈpɔːlˌhoʊldər","syllables":"pall-hold-er"},"inflection":{"noun_plural":"pallholders"},"usage_notes":{"explanation":"A 'pallholder' is distinct from a 'pallbearer,' though the terms are sometimes used interchangeably. A pallbearer typically helps carry the coffin, while a pallholder simply holds the pall (the cloth covering the coffin).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a pallbearer, pallholding the coffin.","correct":"✓ He was a pallholder, holding the pall over the coffin.","note":"Pallholders hold the pall, not the coffin itself."}],"priority":"★★☆"},"related_words":{"derivatives":["pall","holder","pallbearer"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pallholder' refers to a specific role in a funeral ceremony. It's not a common word in everyday conversation but may be encountered in obituaries, news reports about funerals, or in literature describing funeral rites. Understanding the distinction between 'pallholder' and 'pallbearer' requires some familiarity with funeral customs."},"example_sentences":[{"sentence":"Several members of the veteran's unit acted as pallholders during the ceremony.","translation":"ベテラン部隊の数人のメンバーが式典で霊柩を覆う布を持つ役割を務めました。","type":"noun","meaning_category":"funeral role"},{"sentence":"The family requested that close friends serve as honorary pallholders.","translation":"家族は親しい友人に名誉霊柩布保持者として務めるよう依頼しました。","type":"noun","meaning_category":"funeral role"}]}