{"word":"pro-competitive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"競争促進的な、競争を促進する","english_definition":"Designed to promote or enhance competition in a market.","examples":[{"sentence":"The merger was approved because it was deemed to be pro-competitive.","translation":"その合併は競争促進的であるとみなされたため、承認されました。"},{"sentence":"The new regulations are intended to create a more pro-competitive environment for small businesses.","translation":"新しい規制は、中小企業にとってより競争促進的な環境を作り出すことを目的としています。"},{"sentence":"These policies are designed to be pro-competitive and benefit consumers.","translation":"これらの政策は、競争促進的であり、消費者に利益をもたらすように設計されています。"}],"collocations":["pro-competitive policy","pro-competitive effect","pro-competitive merger","pro-competitive regulation","pro-competitive environment"],"synonyms":["competition-enhancing","competition-promoting"],"antonyms":["anti-competitive","monopolistic"]},{"part_of_speech":"adjective","definition":"競争を支持する、競争を擁護する","english_definition":"Supporting or advocating for competition.","examples":[{"sentence":"The organization is pro-competitive and believes in fair market practices.","translation":"その組織は競争を支持しており、公正な市場慣行を信じています。"},{"sentence":"The government should adopt a pro-competitive stance in international trade negotiations.","translation":"政府は国際貿易交渉において競争を擁護する姿勢をとるべきです。"}],"collocations":["pro-competitive stance","pro-competitive advocate"],"synonyms":["competition-supporting","competition-advocating"],"antonyms":["anti-competitive"]}],"etymology":{"value":"The term is formed by combining the prefix 'pro-' (meaning 'in favor of' or 'supporting') with the word 'competitive'. It indicates actions or policies that are in favor of or designed to enhance competition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊkəmˈpɛtɪtɪv/","syllables":"pro-com-pet-i-tive"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Pro-competitive' is used to describe something that encourages or supports competition in a market. It is often used in the context of antitrust law, economics, and business strategy. The term suggests that the action or policy in question will lead to a more competitive market, typically benefiting consumers through lower prices, higher quality, or greater innovation. It is the opposite of 'anti-competitive', which refers to actions or policies that reduce competition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company's pro-competition practices were questioned.","correct":"✓ The company's pro-competitive practices were questioned.","note":"The correct term is 'pro-competitive,' not 'pro-competition.'"},{"incorrect":"✗ The merger was pro-competitive for the company, but not for consumers.","correct":"✓ The merger was pro-competitive, but its benefits for consumers were questionable.","note":"'Pro-competitive' generally implies benefits for consumers through increased competition, so it's unusual for it to be solely beneficial to a company without benefiting consumers."}],"priority":"★★☆"},"related_words":{"derivatives":["pro-competitively (adverb)"],"phrases":["anti-competitive","competition","competitive advantage","market competition"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in specialized contexts such as economics and law.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pro-competitive' is a term used in economics and law to describe actions or policies that are intended to increase competition in a market. It is often used in discussions about antitrust regulations, mergers, and market structures. The term implies that the action or policy will lead to a more competitive market, which is generally seen as beneficial for consumers. Understanding this term requires some knowledge of economics and market dynamics."},"example_sentences":[{"sentence":"The government's decision to deregulate the industry was seen as a **pro-competitive** move.","translation":"政府が業界の規制緩和を決定したことは、競争促進的な動きと見なされました。","type":"adjective","meaning_category":"競争促進的な"},{"sentence":"The company argued that its new product was **pro-competitive** because it offered consumers more choices.","translation":"その会社は、新製品が消費者により多くの選択肢を提供するため、競争促進的であると主張しました。","type":"adjective","meaning_category":"競争促進的な"},{"sentence":"The competition authority investigated whether the merger would have a **pro-competitive** or anti-competitive effect.","translation":"競争当局は、その合併が競争促進的な効果を持つか、それとも反競争的な効果を持つかを調査しました。","type":"adjective","meaning_category":"競争促進的な"}]}