{"word":"stonefly","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"カワゲラ","english_definition":"an insect with long antennae and two pairs of membranous wings, typically found near fast-flowing streams and rivers.","examples":[{"sentence":"Stoneflies are an important food source for fish in many rivers.","translation":"カワゲラは多くの川で魚の重要な食料源です。"},{"sentence":"The presence of stoneflies indicates good water quality.","translation":"カワゲラの存在は良好な水質を示します。"}],"collocations":["stonefly nymph (カワゲラの幼虫)","stonefly larvae (カワゲラの幼虫)","stonefly fishing (カワゲラを使った釣り)"],"synonyms":["None (specific synonyms, but may be referred to as aquatic insects)"],"antonyms":["None (as it is a specific type of insect)"]}],"etymology":{"value":"The name 'stonefly' comes from the fact that the nymphs (larvae) of these insects are often found clinging to stones in streams and rivers.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstoʊnflaɪ/","syllables":"stone-fly"},"inflection":{"noun_plural":"stoneflies"},"usage_notes":{"explanation":"Stoneflies are often used as indicators of water quality because they are sensitive to pollution. Their presence suggests a healthy aquatic environment. They are also important in the food chain, serving as food for fish and other aquatic animals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a stoneflys near the river.","correct":"✓ I saw some stoneflies near the river. / ✓ I saw a stonefly near the river.","note":"Stonefly is a countable noun, so it needs to be pluralized or used with an article (a/an)."}],"priority":"★☆☆"},"related_words":{"derivatives":["None (few direct derivatives)"],"phrasal_verbs":["None"],"related_terms":["mayfly (カゲロウ - another aquatic insect)","caddisfly (トビケラ - another aquatic insect)","aquatic insect (水生昆虫)"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Stonefly' refers to a specific type of insect commonly found near rivers and streams. It's a term often used in ecological contexts, particularly when discussing water quality and aquatic ecosystems. Understanding this term is useful for those interested in biology, ecology, or fly fishing.","priority":"★★☆"},"example_sentences":[{"sentence":"The angler used a stonefly imitation to catch trout.","translation":"釣り人はカワゲラの模倣フライを使ってマスを釣った。","type":"noun","meaning_category":"Insect"},{"sentence":"Scientists monitor stonefly populations to assess river health.","translation":"科学者たちは川の健康状態を評価するためにカワゲラの個体数を監視する。","type":"noun","meaning_category":"Ecology"}]}