{"word":"Colubrids","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ナミヘビ科のヘビ類","english_definition":"A family of snakes (Colubridae) that is the largest snake family, containing about two-thirds of all living snake species. They are found on every continent except Antarctica.","examples":[{"sentence":"Colubrids exhibit a wide range of sizes, colors, and behaviors.","translation":"ナミヘビ科のヘビは、大きさ、色、行動において幅広い多様性を示す。"},{"sentence":"Many colubrids are non-venomous or have venom that is not harmful to humans.","translation":"多くのナミヘビ科のヘビは毒を持たないか、人間に有害ではない毒を持っている。"}],"collocations":["non-venomous colubrids (無毒のナミヘビ科)","colubrid snakes (ナミヘビ科のヘビ)","colubrid species (ナミヘビ科の種)"],"synonyms":["snakes","reptiles"],"antonyms":[]}],"etymology":{"value":"The word \"colubrid\" comes from the Latin word \"coluber,\" meaning \"snake\" or \"serpent.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɒljuːbrɪdz/","syllables":"co-lu-brids"},"inflection":{"noun_plural":"Colubrids"},"usage_notes":{"explanation":"\"Colubrids\" refers specifically to members of the Colubridae family. While some colubrids are venomous, most are either non-venomous or possess venom that is not dangerous to humans. This family is incredibly diverse, encompassing a wide variety of snake types with different habitats and diets.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Colubrids are all poisonous.","correct":"✓ Not all colubrids are poisonous. Many are non-venomous.","note":"While some colubrids are venomous, many are not, or their venom is not dangerous to humans."}],"priority":"★★☆"},"related_words":{"derivatives":["Colubridae (ナミヘビ科)"],"phrases":[]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term \"colubrids\" is a scientific term used to refer to snakes belonging to the Colubridae family. This family is the largest snake family and includes a wide variety of snake species. The term is typically used in scientific or zoological contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Researchers studied the behavior of various colubrids in their natural habitat.","translation":"研究者たちは、自然の生息地における様々なナミヘビ科のヘビの行動を研究した。","type":"general","meaning_category":"General"},{"sentence":"The pet store specializes in exotic colubrids.","translation":"そのペットショップは、珍しいナミヘビ科のヘビを専門に扱っている。","type":"general","meaning_category":"General"}]}