{"word":"agpaitic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(岩石が)アグパイト組織の","english_definition":"(of an igneous rock) containing alkali-rich minerals in such proportions that the ratio of (Na₂O + K₂O)/Al₂O₃ is greater than unity.","examples":[{"sentence":"Agpaitic rocks are characterized by a high content of rare elements.","translation":"アグパイト組織の岩石は、希土類元素の含有量が高いことで特徴付けられる。"}],"collocations":[],"synonyms":["miaskitic","peralkaline"],"antonyms":["miaskitic","peraluminous"]}],"etymology":{"value":"Derived from 'Agpaite', a term coined by V.M. Goldschmidt in 1921, from Greenlandic 'agpat' (guillemot, a type of seabird) because the first discovered agpaitic rocks were found near guillemot colonies. The suffix '-ic' is added to form the adjective.","priority":"★★★"},"pronunciation":{"ipa":"/æɡˈpeɪɪtɪk/","syllables":"ag-pai-it-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'agpaitic' is primarily used in geology and petrology to describe a specific type of igneous rock with a particular chemical composition. It's a relatively technical term, not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["agpaite"],"related_terms":["igneous rock","nepheline syenite","peralkaline rock"]},"level_frequency":{"frequency_google_ngram":"Very low frequency. Primarily used in geological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Agpaitic' is a highly specialized geological term used to describe igneous rocks with a specific chemical composition, characterized by a high ratio of alkali oxides to alumina. Its usage is confined to technical and scientific contexts within geology and petrology."},"example_sentences":[{"sentence":"The Ilimaussaq complex in Greenland is famous for its diverse suite of agpaitic rocks.","translation":"グリーンランドのイリマウサク複合岩体は、多様なアグパイト組織の岩石群で有名である。","type":"adjective","meaning_category":"geology"}]}