{"word":"Coppelia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"コッペリア (バレエ作品)","english_definition":"A comic ballet in three acts first performed in 1870, with music by Léo Delibes and choreography originally by Arthur Saint-Léon.","examples":[{"sentence":"She danced the role of Swanilda in Coppelia.","translation":"彼女はコッペリアでスワニルダ役を踊った。"},{"sentence":"Coppelia is a popular ballet for all ages.","translation":"コッペリアはあらゆる年齢層に人気のバレエだ。"}],"collocations":["Coppelia ballet","Coppelia performance","Coppelia Act I","Coppelia Act II","Coppelia Act III"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"コッペリア (女性名)","english_definition":"A feminine given name, derived from the ballet Coppélia.","examples":[{"sentence":"Coppelia is a rare and beautiful name.","translation":"コッペリアは珍しく美しい名前だ。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Coppélia' is derived from the name of the character in the ballet, a life-size mechanical doll created by Dr. Coppélius. The name itself may be a derivation of the Greek name 'Sophia,' meaning 'wisdom.'","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈpeɪliə/","syllables":"Cop-pe-li-a"},"inflection":{"notes":"Noun. Plural form is Coppélias."},"usage_notes":{"explanation":"'Coppelia' primarily refers to the ballet. When used as a name, it is usually a feminine given name, inspired by the ballet. The ballet is known for its cheerful music and story, making the name associated with beauty and art.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["Coppélius (character in the ballet)","Swanilda (main character in the ballet)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Coppelia' is a word most commonly associated with the ballet of the same name. It refers to a specific work of art and is therefore more likely to be encountered in contexts related to ballet, music, or theater. It can also be used as a given name, although this is much less common. Understanding the reference to the ballet is key to interpreting the word's meaning. "},"example_sentences":[{"sentence":"The local ballet company is performing Coppelia next month.","translation":"地元のバレエ団が来月コッペリアを上演する。","type":"noun","meaning_category":"Ballet"},{"sentence":"She named her daughter Coppelia after her favorite ballet.","translation":"彼女は娘を、お気に入りのバレエにちなんでコッペリアと名付けた。","type":"noun","meaning_category":"Name"}]}