{"word":"parthenocarpy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"単為結果 (たんいけっか): 受精なしに果実が発達する現象。種なし果実の形成を指すことが多い。","english_definition":"The development of fruit without fertilization; often results in seedless fruit.","examples":[{"sentence":"Parthenocarpy is common in some varieties of bananas and pineapples.","translation":"単為結果は、バナナやパイナップルのいくつかの品種で一般的です。"},{"sentence":"Growers sometimes induce parthenocarpy in tomatoes to ensure fruit production in unfavorable conditions.","translation":"栽培者は、不利な条件下での果実生産を確実にするために、トマトで単為結果を誘発することがあります。"}],"collocations":["induce parthenocarpy (単為結果を誘導する)","artificial parthenocarpy (人工単為結果)","natural parthenocarpy (自然単為結果)"],"synonyms":["seedless fruit development","virgin fruit production"],"antonyms":["sexual reproduction (有性生殖)","fertilization (受精)"]}],"etymology":{"value":"ギリシャ語の 'parthenos' (乙女、処女) + 'karpos' (果実) に由来。受精なしに果実が形成される様子を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɑːrθɪnoʊˈkɑːrpi/","syllables":"par-the-no-car-py"},"inflection":{"noun_plural":"parthenocarpies"},"usage_notes":{"explanation":"Parthenocarpy is a botanical term primarily used in scientific and agricultural contexts. It refers to the natural or artificially induced development of fruit without prior fertilization of the ovules. This process leads to seedless fruits, which are often desirable for commercial purposes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Parthenocarpy is a type of seed.","correct":"✓ Parthenocarpy is a process that results in seedless fruit.","note":"Parthenocarpy is a process, not a type of seed."},{"incorrect":"✗ All fruits are produced by parthenocarpy.","correct":"✓ Some fruits are produced by parthenocarpy.","note":"Not all fruits are produced by parthenocarpy; many require fertilization."}],"priority":"★★☆"},"related_words":{"derivatives":["parthenocarpic (形容詞: 単為結果性の)"],"related_terms":["apomixis (無配生殖): 受精なしに種子を生産する別の生殖方法。","auxin (オーキシン): 単為結果を誘導するために使用される植物ホルモン。","gibberellin (ジベレリン): 単為結果を誘導するために使用される植物ホルモン。"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な語彙)","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Parthenocarpy' is a specialized term in botany that describes the development of fruit without fertilization, resulting in seedless fruit. This phenomenon can occur naturally or be induced artificially through hormonal treatments. It's a term primarily used in scientific and agricultural discussions. Understanding the etymology (Greek roots meaning 'virgin fruit') can aid in remembering the term's meaning."},"example_sentences":[{"sentence":"The seedless nature of many commercial bananas is due to parthenocarpy.","translation":"多くの商業用バナナの種なしの性質は、単為結果によるものです。","type":"general","meaning_category":"seedless fruit"},{"sentence":"Scientists are studying the genetic mechanisms that control parthenocarpy in various plant species.","translation":"科学者たちは、さまざまな植物種における単為結果を制御する遺伝的メカニズムを研究しています。","type":"scientific","meaning_category":"genetic mechanisms"},{"sentence":"Applying certain plant hormones can induce parthenocarpy in tomatoes, leading to seedless fruits.","translation":"特定の植物ホルモンを適用すると、トマトで単為結果を誘導し、種なし果実につながる可能性があります。","type":"agricultural","meaning_category":"hormonal induction"}]}