{"word":"Sipibo","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"シピボ族 (ペルーのアマゾン地域に住む先住民族)","english_definition":"An indigenous people living along the Ucayali River in the Peruvian Amazon.","examples":[{"sentence":"The Sipibo people are known for their intricate pottery and textiles.","translation":"シピボ族は、その複雑な陶器や織物で知られています。"},{"sentence":"Sipibo art often features geometric patterns representing their cosmology.","translation":"シピボの芸術は、彼らの宇宙観を表す幾何学的なパターンを特徴とすることが多いです。"}],"collocations":["Sipibo language (シピボ語)","Sipibo art (シピボの芸術)","Sipibo culture (シピボの文化)","Sipibo community (シピボのコミュニティ)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The origin of the name 'Sipibo' is not definitively known, but it is believed to be derived from their own language or a related indigenous language.","priority":"★☆☆"},"pronunciation":{"ipa":"/siˈpiːboʊ/","syllables":"Si-pi-bo"},"inflection":{"notes":"Proper nouns do not typically inflect."},"usage_notes":{"explanation":"'Sipibo' refers specifically to the indigenous people of that name living in the Peruvian Amazon. It is important to use the term respectfully and accurately.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Sipibo are a tribe in Africa.","correct":"✓ The Sipibo are a people in the Peruvian Amazon.","note":"The Sipibo are located in South America, not Africa."}],"priority":"★☆☆"},"related_words":{"derivatives":["Shipibo-Conibo (シピボ・コニボ - より大きな民族グループ)","Conibo (コニボ族 - シピボ族と関連のある民族)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sipibo' is a proper noun referring to a specific indigenous group in the Peruvian Amazon. Understanding this term requires some knowledge of South American indigenous cultures. It is not a commonly used word, but important in contexts discussing the Amazon region, indigenous peoples, or related cultural studies."},"example_sentences":[{"sentence":"The shaman of the Sipibo community led the ceremony.","translation":"シピボのコミュニティのシャーマンが儀式を執り行った。","type":"proper noun","meaning_category":"民族"},{"sentence":"Researchers are studying the traditional medicine practices of the Sipibo.","translation":"研究者たちはシピボ族の伝統的な医療慣習を研究しています。","type":"proper noun","meaning_category":"民族"}]}