{"word":"chemosensory","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"化学感覚の、化学受容性の","english_definition":"relating to the ability of an organism to detect and respond to chemical stimuli in its environment.","examples":[{"sentence":"Chemosensory systems are crucial for detecting food, avoiding toxins, and social communication.","translation":"化学感覚システムは、食物の検出、毒素の回避、および社会的コミュニケーションに不可欠です。"},{"sentence":"The chemosensory receptors in the nose and mouth allow us to perceive flavors and odors.","translation":"鼻と口の化学感覚受容体により、味と匂いを認識することができます。"}],"collocations":["chemosensory receptors","chemosensory neurons","chemosensory system","chemosensory perception","chemosensory cues"],"synonyms":["chemical sensing","chemical perception"],"antonyms":[]}],"etymology":{"value":"Derived from 'chemo-' (referring to chemicals) and 'sensory' (relating to the senses).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkiːmoʊˈsɛnsəri/","syllables":"kee-moh-sen-suh-ree"},"inflection":{"notes":"Adjective, no specific inflections"},"usage_notes":{"explanation":"'Chemosensory' refers to the ability of an organism to detect and respond to chemical stimuli. This includes senses like taste and smell, but also the detection of chemicals by other cells in the body. It's a term often used in biology, neuroscience, and related fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant has chemosensory abilities to move towards the sun.","correct":"✓ The plant has photosensory abilities to move towards the sun.","note":"Plants use photosensory abilities (light sensing) to move towards the sun, not chemosensory abilities."}],"priority":"★☆☆"},"related_words":{"derivatives":["chemosensation (名詞: 化学感覚)","chemoreceptor (名詞: 化学受容体)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chemosensory' is a technical term used in scientific contexts, particularly in biology and neuroscience, to describe the ability to detect and respond to chemical stimuli. It is not commonly used in everyday language. Understanding this term requires knowledge of basic biology and sensory systems."},"example_sentences":[{"sentence":"The nematode uses chemosensory cues to locate its food source.","translation":"その線虫は、化学感覚的な手がかりを使って食物源の位置を特定します。","type":"general","meaning_category":"general"},{"sentence":"Chemosensory dysfunction can affect taste and smell, impacting quality of life.","translation":"化学感覚機能不全は、味覚と嗅覚に影響を与え、生活の質に影響を与える可能性があります。","type":"medical","meaning_category":"medical"}]}