{"word":"undertow","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"引き波、底引き波","english_definition":"a subsurface current that is near shore and that pulls objects out to sea","examples":[{"sentence":"The undertow is very strong today; it's not safe to swim.","translation":"今日は引き波がとても強いので、泳ぐのは危険です。"},{"sentence":"He was caught in the undertow and pulled out to sea.","translation":"彼は引き波に巻き込まれて沖に流された。"},{"sentence":"Be aware of the undertow when swimming in the ocean.","translation":"海で泳ぐときは引き波に注意してください。"}],"collocations":["strong undertow (強い引き波)","caught in an undertow (引き波に巻き込まれる)","undertow current (引き波の流れ)","dangerous undertow (危険な引き波)"],"synonyms":["rip current","backwash","ebb tide"],"antonyms":["onshore current","incoming tide"]}],"etymology":{"value":"'Undertow' is a compound word formed from 'under' and 'tow'. 'Under' refers to being beneath the surface, and 'tow' implies being pulled or dragged. The term describes the current's action of pulling objects under the surface and away from the shore.","priority":"★★☆"},"pronunciation":{"ipa":"ˈʌndərtoʊ","syllables":"un-der-tow"},"inflection":{"noun_plural":"undertows"},"usage_notes":{"explanation":"'Undertow' refers to a specific type of current that occurs near the shore. It's important to distinguish it from a 'rip current,' which is a strong, localized current flowing away from the shore. While both can be dangerous, rip currents are more surface-oriented and visible, whereas undertows are subsurface and less noticeable. Despite the common misconception, undertows don't typically pull people directly under the water but rather pull them away from the shore.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He drowned because of the undercurrent.","correct":"✓ He drowned because of the undertow.","note":"'Undercurrent' refers to a general current below the surface, while 'undertow' specifically refers to the near-shore current pulling seaward."},{"incorrect":"✗ The undertow pulled him under the water.","correct":"✓ The undertow pulled him away from the shore.","note":"Undertows primarily pull objects away from the shore, not necessarily directly under the water."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["rip current","current","tide","shorebreak","surf"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Undertow' refers to a specific type of current found near shorelines. It's a potentially dangerous subsurface current that pulls objects, including swimmers, away from the beach and out to sea. Understanding the behavior of undertows is crucial for beach safety, as they can be difficult to spot and overpower even strong swimmers. It's important to differentiate it from other types of currents, such as rip currents, which have distinct characteristics and require different escape strategies. The term is often used in safety warnings and educational materials related to ocean swimming.","priority":"★★☆"},"example_sentences":[{"sentence":"The lifeguard warned swimmers about the strong **undertow**.","translation":"ライフガードは遊泳者に強い引き波について警告した。","type":"noun","meaning_category":"引き波"},{"sentence":"Many inexperienced swimmers underestimate the power of the **undertow**.","translation":"多くの経験の浅い遊泳者は引き波の力を過小評価している。","type":"noun","meaning_category":"引き波"},{"sentence":"If caught in an **undertow**, swim parallel to the shore to escape.","translation":"引き波に巻き込まれた場合は、岸と平行に泳いで脱出してください。","type":"noun","meaning_category":"引き波"}]}