{"word":"herbage","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"牧草、草本、草地","english_definition":"vegetation, especially grass, suitable for grazing animals; grassland; pasture.","examples":[{"sentence":"The field was rich with herbage, providing ample food for the cattle.","translation":"その牧草地は草が豊かで、牛に十分な食料を提供していた。"},{"sentence":"The herbage was lush and green after the spring rains.","translation":"春の雨の後、牧草は青々と茂っていた。"},{"sentence":"The farmer relied on the quality of the herbage to sustain his livestock.","translation":"その農家は家畜を養うために牧草の質に頼っていた。"}],"collocations":["rich herbage (豊かな牧草)","lush herbage (青々とした牧草)","grazing herbage (放牧用の草)","quality of herbage (牧草の質)"],"synonyms":["grass","pasture","fodder","forage","vegetation","greensward"],"antonyms":[],"related_terms":["herbivore","herbaceous","pastoral","grazing"],"notes":"Primarily used in agricultural or ecological contexts."}],"etymology":{"value":"From Old French *erbage*, from *erbe* (herb), ultimately from Latin *herba* (grass, herb).","priority":"★★☆"},"pronunciation":{"ipa":"ˈhɜːrbɪdʒ","syllables":"her-bage"},"inflection":{"noun_plural":"herbages (rarely used)"},"usage_notes":{"explanation":"'Herbage' refers specifically to vegetation used as food by grazing animals. It is often used in agricultural contexts when discussing the management of pastureland or the nutritional value of feed for livestock. While it can generally refer to any vegetation, it is most commonly associated with grasses and other plants suitable for grazing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The herbage in my garden is growing very well.","correct":"The plants/vegetation in my garden are growing very well.","note":"'Herbage' is typically used in the context of livestock grazing or pastureland, not for general garden plants."}],"priority":"★☆☆"},"related_words":{"derivatives":["herbaceous (adjective: 草本の)"],"related_terms":["herbivore (noun: 草食動物)","pasture (noun: 牧草地)","fodder (noun: 家畜の飼料)","forage (noun/verb: (家畜の)飼料、飼料を探す)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Herbage' is a relatively uncommon word that refers to vegetation, especially grass, that is suitable for grazing animals. It is most often used in agricultural or ecological contexts when discussing pastureland, livestock feed, or the management of grazing resources. It is not typically used to describe general garden plants or other types of vegetation outside of these specific contexts."},"example_sentences":[{"sentence":"The quality of the herbage directly affects the health and productivity of the sheep.","translation":"牧草の質は羊の健康と生産性に直接影響する。","type":"general","meaning_category":"牧草の質"},{"sentence":"Sustainable grazing practices help to maintain the diversity of plant species in the herbage.","translation":"持続可能な放牧慣行は、牧草地の植物種の多様性を維持するのに役立つ。","type":"general","meaning_category":"持続可能な放牧"},{"sentence":"The farmer carefully managed the herbage to ensure a consistent supply of feed for his cattle throughout the year.","translation":"農家は一年を通して牛に安定した飼料を供給するために、牧草を注意深く管理した。","type":"general","meaning_category":"牧草の管理"}]}