{"word":"unmassed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not massed; not gathered together in a mass; dispersed.","english_definition":"Not formed into a mass; scattered; dispersed.","examples":[{"sentence":"The troops were unmassed to reduce their vulnerability to artillery fire.","translation":"砲火に対する脆弱性を減らすため、軍隊は分散配置された。"},{"sentence":"The unmassed flowers created a more natural, less formal garden appearance.","translation":"密集していない花々は、より自然で、形式ばらない庭の外観を作り出した。"}],"collocations":["unmassed troops","unmassed flowers","unmassed formation"],"synonyms":["dispersed","scattered","spread out","distributed"],"antonyms":["massed","gathered","concentrated","assembled"]}],"etymology":{"value":"Formed by adding the prefix \"un-\" (meaning 'not') to the past participle \"massed\" of the verb \"mass\" (to gather together in a mass).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈmæst/","syllables":"un-massed"},"inflection":{"notes":"Comparative and superlative forms are not typically used with 'unmassed'."},"usage_notes":{"explanation":"'Unmassed' describes something that is the opposite of being gathered or concentrated into a group or mass. It implies a state of being spread out or dispersed. It is often used in military contexts to describe troops that are not in a tight formation, or in gardening to describe plants that are not planted close together.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unmassed crowd was difficult to control.","correct":"✓ The massed crowd was difficult to control.","note":"'Unmassed' implies a dispersed group, so it wouldn't be used to describe a crowd that is difficult to control due to its size or density. 'Massed' would be more appropriate in that context."}],"priority":"★☆☆"},"related_words":{"derivatives":["unmass (verb): to separate or disperse from a mass","mass (verb): to gather together in a mass","mass (noun): a large body of matter with no definite shape"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unmassed' is a relatively uncommon word that means 'not gathered together in a mass' or 'dispersed'. It's formed by adding the prefix 'un-' to 'massed', which is the past participle of the verb 'mass' (to gather together). This word is most often encountered in technical or descriptive contexts, such as military strategy or gardening, where the arrangement or distribution of elements is important."},"example_sentences":[{"sentence":"The general ordered the troops to be unmassed across the field.","translation":"将軍は軍隊に野原に分散配置するよう命じた。","type":"adjective","meaning_category":"Dispersed"},{"sentence":"Unmassed planting of wildflowers creates a more natural meadow effect.","translation":"野生の花の分散植栽は、より自然な草原効果を生み出す。","type":"adjective","meaning_category":"Dispersed"}]}