{"word":"outdreamt","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)の夢を越える、(人)よりもっと素晴らしい夢を見る、(人)の夢を打ち破る","english_definition":"To surpass in dreaming; to have a more vivid or imaginative dream than someone else; to exceed someone's dreams in reality.","examples":[{"sentence":"The reality of winning the championship outdreamt all their expectations.","translation":"優勝したという現実は、彼らの期待をはるかに超えるものだった。"},{"sentence":"The beauty of the landscape outdreamt anything she could have imagined.","translation":"その風景の美しさは、彼女が想像しうるどんなものよりも素晴らしかった。"},{"sentence":"He had outdreamt his rivals with his innovative designs.","translation":"彼は革新的なデザインでライバルたちの夢を打ち破った。"}],"collocations":["outdreamt expectations","outdreamt rivals","outdreamt imagination"],"synonyms":["surpass","exceed","outdo","transcend","eclipse"],"antonyms":["underachieve","fall short","disappoint"]}],"etymology":{"value":"The word 'outdreamt' is formed by combining the prefix 'out-' (meaning 'more than' or 'surpassing') with the verb 'dreamt' (the past tense and past participle of 'dream'). It suggests exceeding or surpassing someone in the realm of dreams or aspirations.","priority":"★★★"},"pronunciation":{"ipa":"/ˌaʊtˈdrɛmt/","syllables":"out-dreamt"},"inflection":{"verb_forms":{"present_simple":["outdream","outdreams"],"past_simple":"outdreamt","past_participle":"outdreamt","present_participle":"outdreaming"}},"usage_notes":{"explanation":"'Outdreamt' is a relatively rare and evocative verb that implies not only dreaming but also surpassing or exceeding someone else's dreams, either in the intensity of the dream itself or in the reality that unfolds. It often suggests a sense of wonder or unexpected success that goes beyond what was initially hoped for.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She outdreamed him in reality.","correct":"✓ The reality outdreamt his dreams.","note":"The subject of 'outdreamt' should be the thing that surpasses the dreams, not the person who is being surpassed."},{"incorrect":"✗ He outdreamt to become a doctor.","correct":"✓ He outdreamt his rivals and became a doctor.","note":"'Outdreamt' requires a direct object, which is what is being surpassed. It's not typically used with an infinitive ('to become')."}],"priority":"★★☆"},"related_words":{"derivatives":["outdreaming (present participle)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR levels)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Outdreamt' is a sophisticated verb used to describe a situation where reality exceeds or surpasses someone's dreams or expectations. It is not a common word and is typically found in literary or creative contexts. The word implies a sense of wonder and unexpected success. It's important to understand that the subject of 'outdreamt' is what exceeds the dreams, not the person who is dreaming."},"example_sentences":[{"sentence":"The success of the project outdreamt all their initial hopes.","translation":"プロジェクトの成功は、彼らの当初の希望をすべて上回った。","type":"verb","meaning_category":"夢を越える"},{"sentence":"The beauty of the island easily outdreamt her expectations.","translation":"その島の美しさは、彼女の期待を容易に上回った。","type":"verb","meaning_category":"夢を越える"},{"sentence":"The young artist had outdreamt his mentors with his unique style.","translation":"その若いアーティストは、独自のスタイルで師匠たちの夢を打ち破った。","type":"verb","meaning_category":"夢を打ち破る"}]}