{"word":"Judaisation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ユダヤ化、ユダヤ教化","english_definition":"The process of causing something or someone to become Jewish or to adopt Jewish characteristics.","examples":[{"sentence":"The Judaisation of Jerusalem is a contentious issue.","translation":"エルサレムのユダヤ化は議論の的となる問題だ。"},{"sentence":"Some scholars argue that there was a Judaisation of certain aspects of Roman culture.","translation":"一部の学者は、ローマ文化のある側面がユダヤ化されたと主張している。"}],"collocations":["Judaisation of culture","Judaisation of territory"],"synonyms":["Jewish conversion","Hebraization"],"antonyms":["De-Judaisation","Assimilation"]},{"part_of_speech":"noun","definition":"（特にイスラエルにおいて）非ユダヤ的なものをユダヤ的なものに変える政策または過程","english_definition":"A policy or process of transforming something non-Jewish into something Jewish, especially in Israel.","examples":[{"sentence":"Critics argue that the government's policies amount to a Judaisation of the education system.","translation":"批判者たちは、政府の政策が教育制度のユダヤ化に相当すると主張している。"}],"collocations":["Political Judaisation","Cultural Judaisation"],"synonyms":["Israelization","Hebraization"],"antonyms":["Secularization"]}],"etymology":{"value":"From 'Judaize' + '-ation'. 'Judaize' comes from Medieval Latin 'Judaizare', from Late Latin 'Judaeus' (Jew).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒuːdeɪɪˈzeɪʃən/","syllables":"Ju-dai-i-sa-tion"},"inflection":{"noun_plural":"Judaisations"},"usage_notes":{"explanation":"'Judaisation' refers to the process of making something or someone more Jewish in character or religion. It can refer to a historical process, a cultural shift, or a deliberate policy. The term is often used in political contexts, particularly in discussions about Israel and its policies. It can carry negative connotations, especially when used to describe the imposition of Jewish identity or practices on others.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Judaisation was happened quickly.","correct":"✓ The Judaisation happened quickly.","note":"'Judaisation' is a noun, so it should not be used as a verb. Use 'happened' as the verb in the sentence."},{"incorrect":"✗ They are Judaisating the city.","correct":"✓ They are Judaizing the city.","note":"The verb form is 'Judaize', not 'Judaisate'."}],"priority":"★★☆"},"related_words":{"derivatives":["Judaize (verb)","Judaizer (noun)"],"phrases":["Process of Judaisation","Policy of Judaisation"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Judaisation' is a complex term often used in academic or political discussions. It refers to the process of making something more Jewish in character, religion, or culture. Due to its sensitive and often politicized nature, it's important to understand the context in which it is used. The term can evoke strong reactions, especially in discussions about cultural identity and political power.","priority":"★★☆"},"example_sentences":[{"sentence":"The archaeological findings sparked debate about the Judaisation of the region during the Iron Age.","translation":"その考古学的発見は、鉄器時代におけるその地域のユダヤ化についての議論を巻き起こした。","type":"noun","meaning_category":"Historical/Cultural Process"},{"sentence":"The proposed law was criticized as a form of Judaisation of the legal system.","translation":"その提案された法律は、法制度のユダヤ化の一形態として批判された。","type":"noun","meaning_category":"Political Policy"},{"sentence":"The university's increasing focus on Jewish studies has been described by some as a Judaisation of the curriculum.","translation":"大学がユダヤ学の研究にますます焦点を当てることは、カリキュラムのユダヤ化だと一部の人々によって評されている。","type":"noun","meaning_category":"Cultural Shift"}]}