{"word":"Ovariosteresis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)卵巣摘出術、卵巣除去術","english_definition":"surgical removal of the ovaries; ovariectomy.","examples":[{"sentence":"Ovariosteresis is a surgical procedure performed to remove the ovaries.","translation":"卵巣摘出術は、卵巣を除去するために行われる外科手術です。"},{"sentence":"Bilateral ovariosteresis results in the loss of ovarian hormones.","translation":"両側の卵巣摘出術は、卵巣ホルモンの喪失をもたらします。"}],"collocations":["bilateral ovariosteresis (両側卵巣摘出術)","unilateral ovariosteresis (片側卵巣摘出術)"],"synonyms":["ovariectomy","oophorectomy","gonadectomy"],"antonyms":["ovariosuspension","ovariotomy"]}],"etymology":{"value":"The term \"ovariosteresis\" is derived from the Greek words \"ovarion\" (ovary) and \"steresis\" (removal).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊˌværi.oʊstəˈriːsɪs/","syllables":"O-var-i-o-ste-re-sis"},"inflection":{"noun_plural":"ovariostereses"},"usage_notes":{"explanation":"\"Ovariosteresis\" is a formal medical term for the surgical removal of the ovaries. It's often used interchangeably with \"ovariectomy\" and \"oophorectomy.\" The procedure can be unilateral (one ovary removed) or bilateral (both ovaries removed).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed a ovariosteresis on the uterus.","correct":"✓ The doctor performed an ovariosteresis to remove the ovaries.","note":"Ovariosteresis involves removing the ovaries, not operating on the uterus directly."}],"priority":"★☆☆"},"related_words":{"derivatives":["ovariectomy","oophorectomy"],"phrasal_verbs":[]},"level_frequency":{"frequency_google_ngram":"Low frequency. More common in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ovariosteresis' is a technical medical term referring to the surgical removal of the ovaries. It's synonymous with 'ovariectomy' and 'oophorectomy.' This term is primarily used in medical literature and discussions. Understanding this term is essential for those in the medical field or when reading medical reports related to gynecological procedures."},"example_sentences":[{"sentence":"The patient underwent ovariosteresis due to ovarian cancer.","translation":"患者は卵巣癌のため卵巣摘出術を受けた。","type":"noun","meaning_category":"卵巣摘出術"},{"sentence":"Ovariosteresis can lead to hormonal changes in women.","translation":"卵巣摘出術は女性のホルモンバランスの変化を引き起こす可能性がある。","type":"noun","meaning_category":"卵巣摘出術"}]}