{"word":"mutation-specific","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"特定の変異に特有の、特定の変異にのみ関連する","english_definition":"Relating to or targeting a specific mutation; unique to or associated only with a particular mutation.","examples":[{"sentence":"This mutation-specific antibody only binds to the protein when the specific mutation is present.","translation":"この変異特異的抗体は、特定の変異が存在する場合にのみタンパク質に結合します。"},{"sentence":"Mutation-specific therapies are being developed to target cancer cells with specific genetic mutations.","translation":"特定の遺伝子変異を持つ癌細胞を標的とする変異特異的治療法が開発されています。"},{"sentence":"The diagnostic test is mutation-specific, allowing for precise identification of the genetic alteration.","translation":"この診断テストは変異特異的であり、遺伝的変化を正確に特定することができます。"}],"collocations":["mutation-specific antibody (変異特異的抗体)","mutation-specific therapy (変異特異的療法)","mutation-specific diagnostic (変異特異的診断)","mutation-specific inhibitor (変異特異的阻害剤)","mutation-specific PCR (変異特異的PCR)"],"synonyms":["mutation-selective","mutation-targeted","mutation-dependent"],"antonyms":["non-mutation-specific","mutation-independent","wild-type-specific"]}],"etymology":{"value":"The term is formed by combining 'mutation' (a change in the genetic material of an organism) and 'specific' (clearly defined or identified).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmjuːˈteɪʃən spəˈsɪfɪk/","syllables":"mu-ta-tion spe-ci-fic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Mutation-specific' is commonly used in the context of genetics, molecular biology, and medicine to describe something that is designed to interact with or target a particular genetic mutation. This term implies a high degree of selectivity and precision. It is often used when discussing therapies, diagnostics, or research tools that are designed to distinguish between cells or organisms with and without the specific mutation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The drug is specific to mutations.","correct":"✓ The drug is mutation-specific.","note":"The correct term is 'mutation-specific,' not 'specific to mutations.' Although the meaning is similar, 'mutation-specific' is the more conventional and precise term."}],"priority":"★★☆"},"related_words":{"derivatives":["mutation (名詞: 変異)","specific (形容詞: 特定の)","specificity (名詞: 特異性)"],"phrases":["targeted therapy (分子標的治療)","personalized medicine (個別化医療)","precision medicine (精密医療)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'mutation-specific' is a technical term used in genetics, molecular biology, and medicine. It refers to something that is uniquely designed to interact with or target a particular genetic mutation. Understanding this term requires knowledge of basic genetics and molecular biology concepts. It's often used in discussions about targeted therapies, diagnostics, and research tools that can distinguish between cells or organisms based on the presence or absence of a specific mutation."},"example_sentences":[{"sentence":"The company is developing a mutation-specific inhibitor to block the activity of the mutated protein.","translation":"その会社は、変異タンパク質の活性を阻害する変異特異的阻害剤を開発しています。","type":"general","meaning_category":"Targeted therapy"},{"sentence":"Mutation-specific PCR can be used to detect the presence of a specific genetic alteration in a sample.","translation":"変異特異的PCRは、サンプル中の特定の遺伝的変化の存在を検出するために使用できます。","type":"diagnostic","meaning_category":"Diagnostic testing"},{"sentence":"The mutation-specific antibody is a valuable tool for studying the function of the mutated protein.","translation":"この変異特異的抗体は、変異タンパク質の機能を研究するための貴重なツールです。","type":"research","meaning_category":"Research tool"}]}