{"word":"masculine-centered","priority":"2","meanings":[{"part_of_speech":"adjective","definition":"男性中心の、男性本位の","english_definition":"Focused on, biased towards, or privileging men and masculinity; androcentric.","examples":[{"sentence":"The company culture is very masculine-centered, with little consideration for the needs of female employees.","translation":"その会社の文化は非常に男性中心で、女性従業員のニーズはほとんど考慮されていません。"},{"sentence":"The curriculum was criticized for being too masculine-centered and neglecting the contributions of women.","translation":"そのカリキュラムは男性中心すぎると批判され、女性の貢献を無視しているとされました。"},{"sentence":"A masculine-centered perspective can lead to biased research and policy-making.","translation":"男性中心の視点は、偏った研究や政策決定につながる可能性があります。"}],"collocations":["masculine-centered society","masculine-centered culture","masculine-centered perspective","masculine-centered approach","masculine-centered worldview"],"synonyms":["androcentric","male-dominated","male-oriented","patriarchal"],"antonyms":["feminine-centered","gynocentric","egalitarian","gender-neutral"],"related_terms":["masculinity","androcentrism","patriarchy","gender bias","sexism"]}],"etymology":{"value":"Combination of 'masculine' (relating to men or boys) and 'centered' (having as the center of attention or interest).","priority":"2"},"pronunciation":{"ipa":"/ˈmæskjəlɪn ˈsentərd/","syllables":"mas-cu-line-cen-tered"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'masculine-centered' is used to describe systems, perspectives, or environments that prioritize men, their experiences, and their values. It often implies a lack of consideration for or marginalization of women and other gender identities. It is often used in discussions of gender equality and social justice.","priority":"3"},"common_mistakes":{"examples":[{"incorrect":"masculine centered","correct":"masculine-centered","note":"The hyphen is important to indicate that it is a compound adjective."},{"incorrect":"masculinist-centered","correct":"masculine-centered","note":"'Masculinist' refers to a specific ideology, while 'masculine-centered' is a more general descriptive term."}],"priority":"2"},"level_frequency":{"frequency_corpus":"Relatively infrequent, used in academic and social commentary.","priority":"1"},"readability_explanation":{"level":"C1","text":"The term 'masculine-centered' is typically used in academic or sociological contexts. Understanding requires familiarity with concepts of gender studies and critical analysis of social structures."},"example_sentences":[{"sentence":"The field of medicine has historically been masculine-centered, leading to gaps in research on women's health.","translation":"医学の分野は歴史的に男性中心であり、女性の健康に関する研究のギャップにつながっています。"},{"sentence":"Moving away from a masculine-centered approach requires a conscious effort to include diverse perspectives.","translation":"男性中心のアプローチから脱却するには、多様な視点を取り入れるための意識的な努力が必要です。"},{"sentence":"The novel critiques the masculine-centered values of traditional society.","translation":"その小説は、伝統的な社会の男性中心の価値観を批判しています。"}]}