{"word":"Maumets","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(archaic) A false idol or object of false worship; a term formerly used by Christians to refer to Muhammad or Islam.","english_definition":"(archaic) A false idol or object of false worship; a term formerly used by Christians to refer to Muhammad or Islam.","examples":[{"sentence":"In medieval literature, Maumets were often depicted as demonic figures.","translation":"中世文学では、Maumetsはしばしば悪魔的な姿として描かれていた。"},{"sentence":"The term 'Maumet' was used to denigrate Islamic beliefs.","translation":"「Maumet」という言葉は、イスラム教の信仰を中傷するために使われた。"}],"collocations":["false Maumet","worship Maumets"],"synonyms":["idol","false god","pagan deity"],"antonyms":[]}],"etymology":{"value":"Derived from the Old French 'Mahomet', a variant of 'Muhammad'. It was used in a derogatory way by Christians during the Middle Ages to refer to Muhammad and, by extension, to any idol or object of false worship associated with non-Christian religions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɔːmɪts/","syllables":"Mau-mets"},"inflection":{"noun_plural":"Maumets"},"usage_notes":{"explanation":"The term 'Maumet' is archaic and highly offensive. It reflects a historical misunderstanding and prejudice against Islam. It is rarely used today except in historical contexts or when discussing the history of religious intolerance. Using this term can be considered extremely disrespectful and should be avoided in contemporary discourse.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He worshipped the Maumet as a true god.","correct":"✓ He worshipped the idol as a true god.","note":"'Maumet' is an offensive term and should not be used to describe genuine religious worship. Use 'idol' or 'false god' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["Mahomet (variant spelling, also archaic)"],"phrases":["Maumetry (archaic term for Islam or idolatry)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency (Archaic term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Maumet' is an archaic and offensive term primarily found in historical texts. Understanding its meaning requires knowledge of medieval history and religious biases. Due to its derogatory nature, it is essential to approach this word with caution and avoid using it in modern contexts. Its usage is limited to academic or historical discussions where the context is clearly understood.","warning":"This term is highly offensive and should be used with extreme caution, if at all."},"example_sentences":[{"sentence":"The medieval poem described the destruction of the 'Maumets' by Christian knights.","translation":"その中世の詩は、キリスト教騎士による「Maumets」の破壊を描写していた。","type":"noun","meaning_category":"false idol (historical context)"}]}