{"word":"Substantivism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"実体主義：経済人類学において、経済は社会や文化に埋め込まれており、市場原理や合理的な選択だけでは説明できないとする考え方。","english_definition":"(Economic anthropology) the theory that economies are embedded in society and culture, and cannot be understood solely in terms of market principles or rational choice.","examples":[{"sentence":"Substantivism argues that formal economic models are inappropriate for analyzing non-market societies.","translation":"実体主義は、形式的な経済モデルは市場経済ではない社会の分析には不適切であると主張する。"},{"sentence":"The substantivist approach emphasizes the social and cultural context of economic activities.","translation":"実体主義的アプローチは、経済活動の社会的、文化的背景を強調する。"}],"collocations":["substantivist approach","substantivist perspective","formalism vs. substantivism"],"synonyms":["embedded economy","cultural economics"],"antonyms":["formalism (in economic anthropology)"]},{"part_of_speech":"noun","definition":"実体主義：哲学において、実体（substance）が独立して存在し、属性や関係に依存しないとする立場。","english_definition":"(Philosophy) the view that substances exist independently and are not reducible to their attributes or relations.","examples":[{"sentence":"Substantivism in metaphysics posits that individual objects have inherent properties that define them.","translation":"形而上学における実体主義は、個々の物体はそれらを定義する固有の特性を持つと仮定する。"},{"sentence":"Critics of substantivism argue that it leads to an overly atomistic view of reality.","translation":"実体主義の批判者たちは、それが現実の過度に原子論的な見方につながると主張する。"}],"collocations":["metaphysical substantivism","substance ontology"],"synonyms":["substantialism","realism (in some contexts)"],"antonyms":["relationism","anti-realism (in some contexts)"]}],"etymology":{"value":"Derived from 'substantive' (having substance) + '-ism' (doctrine or theory).","priority":"★★☆"},"pronunciation":{"ipa":"/səbˈstæntɪvɪzəm/","syllables":"sub-stan-ti-vi-sm"},"inflection":{"noun_plural":"Substantivisms"},"usage_notes":{"explanation":"'Substantivism' has distinct meanings in economic anthropology and philosophy. In economic anthropology, it contrasts with formalism. In philosophy, it relates to the nature of substance and its independence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Substantivism is the same as Marxism.","correct":"✓ Substantivism is a distinct approach in economic anthropology, different from Marxism.","note":"Substantivism is not the same as Marxism, although both critique aspects of capitalism."}],"priority":"★★☆"},"related_words":{"derivatives":["substantivist (adjective, noun)","substance","substantial"],"related_concepts":["formalism (economic anthropology)","embeddedness","substance (philosophy)","ontology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Substantivism' is a complex term with specific meanings in different academic fields. In economic anthropology, it's about understanding economies within their social and cultural contexts, not just as markets. In philosophy, it's about whether things exist independently of their properties. It's not a common word in everyday use."},"example_sentences":[{"sentence":"The substantivism-formalism debate shaped the field of economic anthropology.","translation":"実体主義と形式主義の論争は経済人類学の分野を形作った。","type":"noun","meaning_category":"Economic Anthropology"},{"sentence":"Some philosophers reject substantivism in favor of a more relational view of reality.","translation":"現実のより関係的な見方を支持して、実体主義を拒否する哲学者もいる。","type":"noun","meaning_category":"Philosophy"}]}