{"word":"inscriptive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"刻まれた、記された、碑文の、銘文の","english_definition":"Of or relating to inscriptions; bearing an inscription; engraved or written.","examples":[{"sentence":"The museum displayed several inscriptive stones from ancient civilizations.","translation":"その博物館には古代文明のいくつかの碑文が刻まれた石が展示されていた。"},{"sentence":"The archaeologist carefully studied the inscriptive details on the artifact.","translation":"考古学者はその人工物の碑文の詳細を注意深く研究した。"}],"collocations":["inscriptive art","inscriptive evidence","inscriptive text"],"synonyms":["engraved","written","carved","lettered","epigraphic"],"antonyms":["unwritten","blank","plain"]}],"etymology":{"value":"From Latin 'inscriptivus', related to 'inscribere' (to write in or on), from 'in-' (in, on) + 'scribere' (to write).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈskrɪptɪv/","syllables":"in-scrip-tive"},"inflection":{"notes":"Comparative and superlative forms are 'more inscriptive' and 'most inscriptive', respectively, as it's a descriptive adjective."},"usage_notes":{"explanation":"'Inscriptive' is primarily used in academic or formal contexts to describe something that contains or pertains to inscriptions. It's less common in everyday conversation. It often appears in discussions of archaeology, history, or art history.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inscriptive painting was beautiful.","correct":"✓ The painting with the inscription was beautiful.","note":"'Inscriptive' describes something relating to an inscription, not something that is an inscription itself. If you mean the painting has an inscription, say 'the painting with the inscription'."},{"incorrect":"✗ He made an inscriptive speech.","correct":"✓ He gave a descriptive speech.","note":"'Inscriptive' relates to writing or engraving; for a detailed speech, use 'descriptive'."}],"priority":"★★☆"},"related_words":{"derivatives":["inscription (noun): something that is inscribed","inscribe (verb): to write or carve (words or symbols) on something"],"related_terms":["epigraphy (noun): the study of inscriptions"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'inscriptive' is a relatively uncommon adjective used to describe something that relates to or contains inscriptions, which are writings or engravings on objects or surfaces. It is most often encountered in academic or specialized contexts, such as archaeology or art history, when discussing artifacts or historical objects with written text. Because of its specific usage and low frequency, it is considered a more advanced vocabulary word."},"example_sentences":[{"sentence":"The archaeologist examined the inscriptive surface of the ancient tablet.","translation":"考古学者は古代の粘土板の碑文が刻まれた表面を調べた。","type":"general"},{"sentence":"The inscriptive nature of the monument provided valuable historical context.","translation":"その記念碑の碑文的な性質は、貴重な歴史的背景を提供した。","type":"academic"},{"sentence":"The artist incorporated inscriptive elements into the sculpture.","translation":"その芸術家は彫刻に碑文的な要素を取り入れた。","type":"art history"}]}