{"word":"endemiology","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"風土病学、地方病学","english_definition":"The study of the causes and distribution of endemic diseases.","examples":[{"sentence":"Endemiology is crucial for understanding the spread of malaria in certain regions.","translation":"風土病学は、特定の地域におけるマラリアの蔓延を理解するために重要である。"},{"sentence":"The endemiology of cholera in developing countries is a complex issue.","translation":"発展途上国におけるコレラの風土病学は複雑な問題である。"}],"collocations":["study of endemiology","endemiology of disease"],"synonyms":["epidemiology","disease ecology"],"antonyms":[]}],"etymology":{"value":"The word \"endemiology\" is derived from the Greek words \"endemos\" (native, indigenous) and \"-logia\" (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛndɪmiˈɒlədʒi/","syllables":"en-de-mi-ol-o-gy"},"inflection":{"noun_plural":"endemiologies"},"usage_notes":{"explanation":"Endemiology is a branch of epidemiology that focuses specifically on diseases that are constantly present in a particular geographic area or population. It involves studying the factors that contribute to the persistence and spread of these endemic diseases.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Endemiology is the same as epidemiology.","correct":"✓ Endemiology is a subfield of epidemiology.","note":"Endemiology focuses on endemic diseases, while epidemiology is a broader field that includes all types of diseases."}],"priority":"★★☆"},"related_words":{"derivatives":["endemic (adjective)","epidemiology (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Endemiology is a specialized term in the field of public health and epidemiology. It refers to the study of endemic diseases, which are diseases that are constantly present in a particular geographic area or population. Understanding the term requires a background in medical or public health terminology."},"example_sentences":[{"sentence":"The professor specialized in the endemiology of tropical diseases.","translation":"その教授は熱帯病の風土病学を専門としていた。","type":"noun","meaning_category":"風土病学"},{"sentence":"Research in endemiology helps to develop effective control strategies.","translation":"風土病学の研究は、効果的な制御戦略の開発に役立つ。","type":"noun","meaning_category":"風土病学"}]}