{"word":"Jelutong","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ジュルトン（マレー半島原産のゴムノキの一種、およびその木材）","english_definition":"A type of softwood tree native to Malaysia and other parts of Southeast Asia; also the wood from this tree.","examples":[{"sentence":"Jelutong wood is often used for pattern making due to its fine grain and stability.","translation":"ジュルトンの木材は、木目が細かく安定しているため、模型製作によく使用されます。"},{"sentence":"The sculpture was carved from a single piece of jelutong.","translation":"その彫刻は一本のジュルトンの木から彫られました。"}],"collocations":["jelutong wood","jelutong tree","carve jelutong","jelutong carving"],"synonyms":["Dyera costulata"],"antonyms":[]}],"etymology":{"value":"マレー語の「jelutong」に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɛlətɒŋ/","syllables":"je-lu-tong"},"inflection":{"noun_plural":"jelutongs"},"usage_notes":{"explanation":"Jelutong is primarily known as the name of a tree species and its wood. It is valued for its workability and is often used in carving, pattern making, and other applications where a fine-grained, stable wood is required.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a furniture made of jeluton.","correct":"✓ I bought a furniture made of jelutong.","note":"Correct spelling is 'jelutong'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"None (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Jelutong' is a specialized term referring to a specific type of tree and its wood, primarily used in contexts related to woodworking, forestry, or botany. It is not a common word in everyday conversation. Understanding its meaning requires familiarity with tropical hardwoods or related fields."},"example_sentences":[{"sentence":"The model airplane was crafted from lightweight jelutong.","translation":"その模型飛行機は軽量なジュルトン材で作られていました。","type":"noun","meaning_category":"木材"},{"sentence":"The jelutong tree can grow to a considerable height in its native rainforest environment.","translation":"ジュルトンの木は、原産の熱帯雨林環境でかなりの高さまで成長することがあります。","type":"noun","meaning_category":"樹木"}]}