{"word":"cross-corporate","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"企業間の、企業を跨ぐ、企業を横断する","english_definition":"Involving or relating to more than one corporation.","examples":[{"sentence":"The project required cross-corporate collaboration to succeed.","translation":"そのプロジェクトは成功するために企業間の連携を必要とした。"},{"sentence":"A cross-corporate task force was formed to address the industry-wide issue.","translation":"業界全体の問題に対処するために、企業を横断するタスクフォースが結成された。"},{"sentence":"We are exploring cross-corporate synergies to improve efficiency.","translation":"効率を改善するために、企業間の相乗効果を探っています。"}],"collocations":["cross-corporate collaboration (企業間連携)","cross-corporate task force (企業横断型タスクフォース)","cross-corporate synergies (企業間の相乗効果)","cross-corporate initiative (企業間イニシアチブ)","cross-corporate project (企業間プロジェクト)","cross-corporate partnership (企業間パートナーシップ)"],"synonyms":["inter-company","inter-corporate","multi-corporate"],"antonyms":["intra-corporate","internal"],"notes":"Often used in the context of business, management, and economics."}],"etymology":{"value":"Formed by combining \"cross-\" (indicating something that traverses or involves multiple entities) and \"corporate\" (relating to a corporation or corporations).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkrɒs ˈkɔːrpərət/","syllables":"cross-cor-po-rate"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"'Cross-corporate' describes activities, relationships, or initiatives that involve multiple separate companies. It emphasizes the collaboration or interaction between different corporate entities rather than activities within a single company. It is commonly used in business and management contexts to describe strategies, projects, or partnerships that span organizational boundaries.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The corporate-cross project was successful.","correct":"✓ The cross-corporate project was successful.","note":"The correct order is 'cross-corporate' as it describes something that involves multiple corporations. 'Corporate-cross' is not a standard term."},{"incorrect":"✗ We need to improve our cross corporate communication.","correct":"✓ We need to improve our cross-corporate communication.","note":"'Cross-corporate' is a compound adjective and should be written as one word or hyphenated."}],"priority":"★★☆"},"related_words":{"derivatives":["cross-corporately (adverb)"],"phrasal_verbs":[],"related_terms":["corporate","corporation","inter-organizational","collaboration","partnership","synergy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in business and academic contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'cross-corporate' is used in business and management contexts to describe activities or relationships that involve multiple companies. It is generally understood by professionals in these fields but may not be familiar to the general public. The term implies collaboration or interaction between different corporate entities, often with the goal of achieving mutual benefits or addressing common challenges."},"example_sentences":[{"sentence":"The merger created a new cross-corporate entity with significant market power.","translation":"その合併は、大きな市場力を持つ新しい企業間組織を生み出した。","type":"adjective","meaning_category":"企業間の"},{"sentence":"Cross-corporate training programs can help employees develop a broader perspective.","translation":"企業間の研修プログラムは、従業員がより広い視野を養うのに役立つ。","type":"adjective","meaning_category":"企業を跨ぐ"},{"sentence":"The success of the venture depended on effective cross-corporate communication.","translation":"その事業の成功は、効果的な企業間コミュニケーションにかかっていた。","type":"adjective","meaning_category":"企業を横断する"}]}