{"word":"airmarker","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A marker, usually a large symbol or text painted on the ground or a rooftop, used to provide visual navigation information to pilots.","english_definition":"A visual aid for aerial navigation, typically consisting of a large symbol or text painted on a surface visible from the air.","examples":[{"sentence":"The old airmarker on the factory roof was faded and difficult to read.","translation":"工場屋上の古いエアーマーカーは色あせていて読みにくかった。"},{"sentence":"Airmarkers were essential navigational tools before the widespread adoption of GPS.","translation":"GPSが広く普及する前は、エアーマーカーは不可欠な航行ツールだった。"}],"collocations":["rooftop airmarker","ground airmarker","navigation airmarker","historic airmarker"],"synonyms":["aerial marker","navigation aid","ground symbol"],"antonyms":[]}],"etymology":{"value":"Combination of 'air' (referring to the sky or aviation) and 'marker' (something used to indicate a location or direction).","priority":"N/A"},"pronunciation":{"ipa":"ˈɛərˌmɑːrkər","syllables":"air-mark-er"},"inflection":{"noun_plural":"airmarkers"},"usage_notes":{"explanation":"Airmarkers are visual aids designed to be seen from the air, helping pilots navigate by identifying towns, landmarks, or providing directional information. They were particularly important in the early days of aviation before advanced electronic navigation systems became common.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'airmarker' refers to a visual sign placed on the ground or a building roof to help pilots navigate. These markers were especially important in the early days of aviation before the development of modern electronic navigation systems. They typically consist of large, easily visible symbols or text indicating the name of a town, a direction, or other navigational information. Because of the historical context and specialized usage, this term is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The pilot used the **airmarker** to confirm their position over the small town.","translation":"パイロットはエアーマーカーを使って、小さな町の上空での自分の位置を確認した。","type":"noun","meaning_category":"navigation aid"},{"sentence":"Many **airmarkers** from the 1930s are now being restored as historical landmarks.","translation":"1930年代のエアーマーカーの多くは、現在、歴史的建造物として修復されている。","type":"noun","meaning_category":"historical landmark"}]}