{"word":"boraginaceous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ムラサキ科の","english_definition":"belonging or pertaining to the Boraginaceae family of plants, characterized by rough, hairy leaves and often coiled flower clusters.","examples":[{"sentence":"The forget-me-not is a boraginaceous plant.","translation":"勿忘草はムラサキ科の植物です。"},{"sentence":"Many boraginaceous plants are known for their medicinal properties.","translation":"多くのムラサキ科植物は薬効があることで知られています。"}],"collocations":["boraginaceous plant","boraginaceous flower","boraginaceous herb"],"synonyms":["borage family","Boraginaceae"],"antonyms":[]}],"etymology":{"value":"New Latin Boraginaceae + -ous. Boraginaceae is derived from Borago, the genus name for borage, a common herb, + -aceae, the standard suffix for plant families.","priority":"★☆☆"},"pronunciation":{"ipa":"/bəˌrædʒɪˈneɪʃəs/","syllables":"bo-rag-i-na-ceous"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Boraginaceous' is a relatively uncommon term used in botany and horticulture to describe plants belonging to the Boraginaceae family. These plants often have distinctive coiled flower clusters (scorpioid cymes) and hairy leaves. The term is primarily used in scientific or technical contexts.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The boraginaceous are beautiful.","correct":"✓ Boraginaceous plants are beautiful.","note":"'Boraginaceous' is an adjective, so it needs to modify a noun (e.g., 'boraginaceous plants')."}],"priority":"★☆☆"},"related_words":{"derivatives":["Boraginaceae (noun: the borage family)","borage (noun: a specific boraginaceous herb)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'boraginaceous' is highly specialized and primarily used within the fields of botany and horticulture. It describes plants belonging to the Boraginaceae family, which are characterized by specific botanical features. Due to its technical nature, this word is unlikely to be encountered in general English contexts."},"example_sentences":[{"sentence":"The herb garden featured several boraginaceous species, including borage and comfrey.","translation":"そのハーブ園には、ボリジやコンフリーなど、いくつかのムラサキ科の植物種がありました。","type":"general","meaning_category":"descriptive"},{"sentence":"The rough, hairy leaves are a characteristic feature of boraginaceous plants.","translation":"ざらざらとした毛深い葉は、ムラサキ科植物の特徴的な特徴です。","type":"botanical","meaning_category":"descriptive"}]}