{"word":"Bosniac","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ボシュニャク人（ボスニア・ヘルツェゴビナの主要民族の一つで、主にイスラム教を信仰する人々）","english_definition":"A member of the predominantly Muslim people inhabiting Bosnia and Herzegovina; a Bosnian Muslim.","examples":[{"sentence":"He identifies as a Bosniac.","translation":"彼は自身をボシュニャク人と認識している。"},{"sentence":"Many Bosniacs suffered greatly during the Bosnian War.","translation":"ボスニア紛争中、多くのボシュニャク人が大きな苦しみを受けた。"}],"collocations":["Bosniac culture","Bosniac language","Bosniac history","Bosniac identity"],"synonyms":["Bosnian Muslim"],"antonyms":["Serb","Croat"]},{"part_of_speech":"adjective","definition":"ボシュニャク人の、ボシュニャク人に関する","english_definition":"Relating to Bosniacs or their culture.","examples":[{"sentence":"Bosniac literature often reflects the experiences of war and displacement.","translation":"ボシュニャク文学は、戦争や故郷喪失の経験を反映することが多い。"},{"sentence":"The Bosniac community is working to preserve its traditions.","translation":"ボシュニャク人コミュニティは、その伝統を守るために活動している。"}],"collocations":["Bosniac culture","Bosniac traditions","Bosniac community","Bosniac heritage"],"synonyms":["Bosnian Muslim"],"antonyms":["Serbian","Croatian"]}],"etymology":{"value":"Derived from 'Bosnia,' the region they inhabit, with the suffix '-ac' indicating belonging or origin. The term gained prominence in the 1990s to distinguish Bosnian Muslims from Bosnian Serbs and Bosnian Croats.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbɒzniæk/","syllables":"Bos-ni-ac"},"inflection":{"noun_plural":"Bosniacs","adjective_forms":{"comparative":"","superlative":""}},"usage_notes":{"explanation":"'Bosniac' is primarily used to refer to Bosnian Muslims, distinguishing them from Bosnian Serbs (Orthodox Christians) and Bosnian Croats (Catholics). The term emphasizes cultural and ethnic identity, particularly in the context of the Bosnian War and its aftermath. It is important to use the term respectfully and avoid generalizations or stereotypes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Bosnian, but not Bosniac.","correct":"✓ He is a Bosnian Serb. / ✓ He is a Bosniac.","note":"'Bosnian' is a general term for people from Bosnia and Herzegovina, while 'Bosniac' specifically refers to Bosnian Muslims. A Bosnian who is not Muslim would likely identify as a Serb or Croat."},{"incorrect":"✗ All Bosnians are Bosniacs.","correct":"✓ Some Bosnians are Bosniacs.","note":"Not all Bosnians are Bosniacs. Bosnia and Herzegovina is a multi-ethnic country."}],"priority":"★★☆"},"related_words":{"derivatives":["Bosnia","Bosnian","Bosnian Muslim"],"phrases":["Ethnic cleansing","Bosnian War","Srebrenica massacre"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in contexts related to Balkan history and politics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Bosniac' refers specifically to Bosnian Muslims, distinguishing them from other ethnic groups in Bosnia and Herzegovina (Serbs and Croats). It's crucial to understand the historical and political context in which this term is used, particularly concerning the Bosnian War and ethnic tensions in the region. The word is most often encountered in discussions of Balkan history, politics, and culture. Using the term correctly demonstrates sensitivity to the complex ethnic landscape of the area."},"example_sentences":[{"sentence":"The **Bosniac** community in Sarajevo is vibrant and culturally rich.","translation":"サラエボのボシュニャク人コミュニティは活気に満ちており、文化的に豊かである。","type":"noun","meaning_category":"民族"},{"sentence":"The **Bosniac** language is closely related to Serbian and Croatian.","translation":"ボシュニャク語はセルビア語やクロアチア語と密接に関連している。","type":"adjective","meaning_category":"民族の"},{"sentence":"Many **Bosniacs** celebrate Eid al-Fitr at the end of Ramadan.","translation":"多くのボシュニャク人はラマダンの終わりにイード・アル＝フィトルを祝う。","type":"noun","meaning_category":"民族"}]}