{"word":"Azoturia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アゾツリア、腰萎え (馬の病気)","english_definition":"A disease of horses characterized by stiffness and pain in the muscles of the hindquarters, often occurring after a period of rest followed by exercise. It is associated with the accumulation of glycogen in the muscles.","examples":[{"sentence":"The horse was diagnosed with azoturia after showing signs of stiffness and reluctance to move.","translation":"その馬は、硬直と動きを嫌がる兆候を示した後、アゾツリアと診断された。"}],"collocations":["Equine Azoturia","Monday Morning Disease"],"synonyms":["Equine Rhabdomyolysis","Tying-up"],"antonyms":[]}],"etymology":{"value":"The term 'azoturia' is derived from 'azoto-' referring to nitrogen (specifically, an excess of nitrogenous compounds in the urine) and '-uria' denoting the presence of a substance in the urine. However, the name is a misnomer as the condition is not primarily related to excess nitrogen in the urine, but rather to muscle damage.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæzoʊˈtʊəriə/","syllables":"a-zo-tu-ri-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Azoturia, also known as 'tying-up' or 'Monday morning disease,' primarily affects horses. It's characterized by muscle stiffness, pain, and reluctance to move, often following a period of rest and then exercise. The condition is linked to glycogen accumulation in muscles and muscle damage. While the name suggests excess nitrogen in the urine, this is not the primary cause or symptom.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The horse has azoturia, so it needs more protein.","correct":"✓ The horse has azoturia, so it needs a carefully managed diet with balanced electrolytes and potentially vitamin E and selenium supplementation, as well as controlled exercise.","note":"Azoturia is not directly caused by protein deficiency; it's related to glycogen metabolism and muscle damage. Treatment involves managing diet and exercise, not simply increasing protein intake."}],"priority":"★★☆"},"related_words":{"derivatives":["Rhabdomyolysis","Myoglobinuria"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized Veterinary Term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Azoturia' is a specialized veterinary term referring to a muscle disease in horses. It's characterized by stiffness and pain, often occurring after rest followed by exercise. The name is somewhat misleading as it suggests a nitrogen imbalance, but the condition is actually related to muscle glycogen metabolism. Understanding this term requires knowledge of equine health and veterinary medicine."},"example_sentences":[{"sentence":"Proper management and diet can help prevent recurrent episodes of azoturia in horses.","translation":"適切な管理と食事は、馬のアゾツリアの再発を防ぐのに役立ちます。","type":"noun","meaning_category":"Disease"}]}