{"word":"compurgatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(歴史的な法律用語)潔白の誓いを立てる、または潔白の誓いによって証明される","english_definition":"(historical legal term) relating to or established by compurgation (the clearing of an accused person by oaths of support from a group).","examples":[{"sentence":"The accused was subject to a compurgatory oath.","translation":"被告は潔白の誓いを立てることを求められた。"},{"sentence":"Compurgatory evidence was presented to the court.","translation":"潔白の誓いによる証拠が法廷に提出された。"}],"collocations":["compurgatory oath","compurgatory evidence","compurgatory witness"],"synonyms":["oath-based","vindicatory","exculpatory"],"antonyms":["incriminating","condemnatory"]}],"etymology":{"value":"Derived from the word 'compurgation', which comes from the Latin 'com-' (together) + 'purgare' (to cleanse, purify).","priority":"★★☆"},"pronunciation":{"ipa":"/kəmˈpɜːrɡətɔːri/","syllables":"com-pur-ga-to-ry"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Compurgatory' is an adjective specifically related to the historical legal practice of compurgation, where an accused person could be cleared of charges by taking an oath of innocence supported by a group of oath-helpers (compurgators) who swore to the accused's credibility. The term is rarely used in modern legal contexts, as compurgation is an obsolete practice.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The compurgatory was found guilty.","correct":"✓ The defendant was subject to a compurgatory oath.","note":"'Compurgatory' is an adjective, not a noun. It describes something related to compurgation, such as an oath or evidence."}],"priority":"★★★"},"related_words":{"derivatives":["compurgation (noun): The act of clearing an accused person by oaths of support.","compurgator (noun): A person who swears to the credibility of an accused person in compurgation."],"related_legal_terms":["oath","testimony","affidavit","evidence"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare - historical term)","frequency_google_ngram":"Very low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Compurgatory' is a highly specialized and archaic legal term. Understanding it requires knowledge of historical legal practices, specifically the concept of compurgation. Due to its limited usage and historical context, it is not commonly encountered in general language. The word primarily appears in academic or historical texts concerning legal history."},"example_sentences":[{"sentence":"The trial relied heavily on compurgatory procedures, with the defendant presenting numerous oath-helpers.","translation":"裁判は潔白の誓いの手続きに大きく依存しており、被告は多数の誓約協力者を提示した。","type":"adjective","meaning_category":"Historical Legal"},{"sentence":"Compurgatory laws were eventually replaced by more modern systems of justice.","translation":"潔白の誓いによる法律は、最終的により近代的な司法制度に取って代わられた。","type":"adjective","meaning_category":"Historical Legal"}]}