{"word":"roseolas","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"バラ疹（突発性発疹）","english_definition":"A mild viral infection, primarily affecting infants and young children, characterized by a high fever followed by a distinctive rash of small, pink, flat or slightly raised spots on the trunk.","examples":[{"sentence":"The doctor diagnosed the baby with roseolas.","translation":"医師は赤ちゃんをバラ疹と診断した。"},{"sentence":"Roseolas typically affects children between six months and two years old.","translation":"バラ疹は通常、生後6か月から2歳までの子供に発症する。"}],"collocations":["contract roseolas (バラ疹に感染する)","diagnose roseolas (バラ疹と診断する)","symptoms of roseolas (バラ疹の症状)","roseolas rash (バラ疹の発疹)"],"synonyms":["exanthem subitum","sixth disease"],"antonyms":[]}],"etymology":{"value":"The term 'roseolas' is derived from the Latin word 'roseus,' meaning 'rosy' or 'rose-colored,' referring to the characteristic pink or rose-colored rash associated with the disease.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌroʊziˈoʊləz/","syllables":"ro-se-o-las"},"inflection":{"noun_plural":"roseolas (always plural)"},"usage_notes":{"explanation":"'Roseolas' is a medical term that refers specifically to the viral infection known as exanthem subitum or sixth disease. It is almost always used in the plural form because the disease is characterized by multiple spots or lesions. It's important to note that this is a specific medical condition and not a general term for any kind of rash.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a roseola.","correct":"✓ He has roseolas.","note":"Roseolas is almost always used in the plural form."},{"incorrect":"✗ Roseolas is a serious disease.","correct":"✓ Roseolas is generally a mild disease.","note":"Roseolas is typically a mild, self-limiting illness."}],"priority":"★★☆"},"related_words":{"derivatives":["roseola (singular form, rarely used)"],"medical_terms":["exanthem subitum (synonym)","sixth disease (synonym)","HHV-6 (Human herpesvirus 6, one of the viruses that can cause roseolas)","HHV-7 (Human herpesvirus 7, another virus that can cause roseolas)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Roseolas' is a medical term referring to a specific viral infection, primarily affecting young children. It is characterized by a sudden high fever followed by a distinctive rash. The term is typically encountered in medical contexts or when discussing childhood illnesses. Due to its specialized nature, it is not part of everyday vocabulary. Understanding the term is important for healthcare professionals and parents seeking information about common childhood diseases."},"example_sentences":[{"sentence":"The child developed a high fever, which is a common initial symptom of roseolas.","translation":"その子供は高熱を発症したが、これはバラ疹の一般的な初期症状である。","type":"general"},{"sentence":"Roseolas is usually diagnosed based on the characteristic rash that appears after the fever subsides.","translation":"バラ疹は通常、熱が下がった後に現れる特徴的な発疹に基づいて診断される。","type":"diagnosis"},{"sentence":"Although roseolas can be unsettling for parents, it is generally a mild and self-limiting illness.","translation":"バラ疹は親にとっては不安になることがあるが、一般的には軽度で自然に治る病気である。","type":"prognosis"}]}