{"word":"Hildebrandine","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ヒルデブランド改革に関連する、またはヒルデブランド改革を支持する","english_definition":"Relating to or supporting the Hildebrandine Reforms.","examples":[{"sentence":"The Hildebrandine party advocated for papal supremacy.","translation":"ヒルデブランド党は教皇至上主義を唱えた。"},{"sentence":"Hildebrandine decrees aimed to eliminate simony and clerical marriage.","translation":"ヒルデブランドの勅令は、聖職売買と聖職者の結婚を排除することを目的としていた。"}],"collocations":["Hildebrandine Reforms","Hildebrandine party","Hildebrandine decrees"],"synonyms":["Gregorian"],"antonyms":[]}],"etymology":{"value":"Named after Pope Gregory VII, originally Hildebrand of Sovana.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɪldəˈbrændiːn/","syllables":"Hil-de-bran-dine"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"Used primarily in historical contexts when discussing the reforms initiated by Pope Gregory VII (formerly Hildebrand) in the 11th century. These reforms aimed to establish papal authority and combat corruption within the Church.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Hildebrandine monk before the reforms.","correct":"✓ He was a monk before the Hildebrandine Reforms.","note":"The reforms themselves are Hildebrandine, not people before them."}],"priority":"★★☆"},"related_words":{"derivatives":["Hildebrand (noun: historical figure)","Gregorian Reforms (synonym)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"This term is highly specialized and used in the context of medieval European history, specifically regarding the reforms enacted by Pope Gregory VII. It's unlikely to be encountered outside of academic or historical discussions. Understanding requires knowledge of 11th-century church history and the Investiture Controversy."},"example_sentences":[{"sentence":"The Hildebrandine papacy sought to assert its authority over secular rulers.","translation":"ヒルデブランドの教皇権は、世俗の支配者に対する権威を主張しようとした。","type":"adjective","meaning_category":"historical"},{"sentence":"Hildebrandine ideals influenced canon law for centuries.","translation":"ヒルデブランドの理想は、何世紀にもわたって教会法に影響を与えた。","type":"adjective","meaning_category":"historical"}]}