{"word":"pollakiuria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"頻尿 (ひんにょう): 異常に頻繁に排尿すること。ただし、1回あたりの尿量は正常範囲内である。","english_definition":"The need to urinate abnormally frequently during the day or night, but in normal or less-than-normal volumes. It is distinguished from polyuria, which is excessive production of urine.","examples":[{"sentence":"Pollakiuria can be a symptom of a urinary tract infection.","translation":"頻尿は尿路感染症の症状である可能性がある。"},{"sentence":"The patient complained of pollakiuria and nocturia.","translation":"患者は頻尿と夜間頻尿を訴えた。"}],"collocations":["experience pollakiuria (頻尿を経験する)","suffer from pollakiuria (頻尿に苦しむ)","cause pollakiuria (頻尿を引き起こす)","treat pollakiuria (頻尿を治療する)"],"synonyms":["frequent urination","increased urinary frequency"],"antonyms":["oliguria (乏尿)","anuria (無尿)","polyuria (多尿)"]},{"part_of_speech":"noun","definition":"(獣医学) (小動物において) 少量ずつ頻繁に排尿すること。","english_definition":"(In veterinary medicine, especially in small animals) abnormally frequent urination of small amounts.","examples":[{"sentence":"Pollakiuria is a common sign of cystitis in cats.","translation":"頻尿は猫の膀胱炎の一般的な兆候です。"}],"collocations":["feline pollakiuria (猫の頻尿)","canine pollakiuria (犬の頻尿)"],"synonyms":["frequent urination (small animals)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'pollakis' (often) and 'ouria' (urination).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒləkiˈjʊəriə/","syllables":"pol-la-ki-u-ri-a"},"inflection":{"noun_plural":"pollakiurias"},"usage_notes":{"explanation":"Pollakiuria is characterized by frequent urination with normal or small volumes each time, differentiating it from polyuria, where the total urine volume is abnormally high. It is often a symptom of underlying conditions such as urinary tract infections, bladder irritation, or prostate issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Pollakiuria is the same as polyuria.","correct":"✓ Pollakiuria is frequent urination of small amounts, while polyuria is excessive urine production.","note":"Pollakiuria and polyuria are different conditions. Pollakiuria is frequent urination of small amounts, while polyuria is the production of abnormally large volumes of urine. It's important to distinguish between the two for accurate diagnosis and treatment."}],"priority":"★★☆"},"related_words":{"derivatives":["pollakiuric (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pollakiuria' is a medical term referring to abnormally frequent urination, but with normal or small amounts of urine passed each time. It's different from 'polyuria,' which means producing a lot of urine overall. If someone experiences pollakiuria, it could be a sign of a health problem like a urinary tract infection or bladder issue. This term is mainly used in medical settings."},"example_sentences":[{"sentence":"The patient presented with symptoms of dysuria and pollakiuria.","translation":"患者は排尿困難と頻尿の症状を呈した。","type":"medical","meaning_category":"頻尿"},{"sentence":"In veterinary medicine, pollakiuria is a common complaint in cats with feline lower urinary tract disease (FLUTD).","translation":"獣医学では、頻尿は猫下部尿路疾患（FLUTD）の猫によく見られる症状です。","type":"veterinary","meaning_category":"頻尿 (獣医学)"}]}