{"word":"Mortifier","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"One who mortifies; one who subdues or destroys the force of the passions or appetites.","english_definition":"A person who subjects themselves to severe self-discipline, especially as a form of religious devotion.","examples":[{"sentence":"The monk was known as a mortifier of the flesh.","translation":"その僧侶は肉欲を抑制する者として知られていた。"}],"collocations":["mortifier of the flesh","religious mortifier"],"synonyms":["ascetic","penitent","self-denier"],"antonyms":["hedonist","indulger"]},{"part_of_speech":"noun","definition":"Something that mortifies; that which subdues or destroys.","english_definition":"Something that causes feelings of shame or humiliation.","examples":[{"sentence":"The public scandal was a great mortifier to the family.","translation":"その公的なスキャンダルは家族にとって大きな屈辱だった。"}],"collocations":["great mortifier","public mortifier"],"synonyms":["humiliation","embarrassment","disgrace"],"antonyms":["pride","honor"]},{"part_of_speech":"noun","definition":"(rare) A device or substance used to mortify or subdue.","english_definition":"(archaic) A device or substance used to subdue or deaden.","examples":[{"sentence":"(Historical context needed to understand this usage)","translation":"（この用法を理解するには歴史的背景が必要）"}],"collocations":[],"synonyms":["subduer","deadener"],"antonyms":[]}],"etymology":{"value":"From Middle English, from Old French, from Late Latin mortificare (“to cause death, put to death”), from Latin mortuus (“dead”) + facere (“to make”).","priority":"Medium"},"pronunciation":{"ipa":"/ˈmɔːrtɪfaɪər/","syllables":"mor-ti-fi-er"},"inflection":{"noun_plural":"Mortifiers"},"usage_notes":{"explanation":"The word 'mortifier' has a strong connotation of religious asceticism or extreme self-denial. In modern usage, it's more common to encounter the word in historical or religious contexts. The sense of something causing shame is more often expressed using words like 'humiliating' or 'embarrassing'.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He was a mortifier of his friends.","correct":"He was a source of embarrassment to his friends.","note":"Using 'mortifier' to describe someone who embarrasses others is technically correct but sounds archaic. Use 'source of embarrassment' instead."}],"priority":"Low"},"related_words":{"derivatives":["mortify","mortification"],"phrasal_verbs":[],"related_terms":["asceticism","penance","self-denial"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"The word 'mortifier' is relatively uncommon in modern English. It is most likely to be encountered in historical, religious, or literary contexts. Understanding requires a grasp of the concept of mortification, which involves subduing one's desires and passions, often for religious reasons. The word can also refer to something that causes shame or humiliation, but this usage is less frequent."},"example_sentences":[{"sentence":"Saint Francis was a famous mortifier of the flesh, enduring many hardships for his faith.","translation":"聖フランチェスコは肉欲を抑制する者として有名で、信仰のために多くの苦難に耐えた。","type":"noun","meaning_category":"Religious ascetic"},{"sentence":"Failing the exam was a mortifier for the usually high-achieving student.","translation":"試験に落ちることは、普段は優秀な学生にとって屈辱だった。","type":"noun","meaning_category":"Cause of humiliation"}]}