{"word":"gastrocnemian","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"腓腹筋（ひふくきん）","english_definition":"The chief muscle of the calf of the leg, which flexes the knee and foot. It runs from just above the knee to the heel and is involved in standing, walking, running, and jumping.","examples":[{"sentence":"The gastrocnemian muscle is essential for plantar flexion of the foot.","translation":"腓腹筋は足底屈に不可欠な筋肉です。"},{"sentence":"He strained his gastrocnemian while sprinting.","translation":"彼は短距離走中に腓腹筋を痛めた。"}],"collocations":["gastrocnemius muscle","gastrocnemius strain","tear in gastrocnemius"],"synonyms":["calf muscle"],"antonyms":[]},{"part_of_speech":"adjective","definition":"腓腹筋の","english_definition":"Relating to the gastrocnemius muscle.","examples":[{"sentence":"Gastrocnemian pain can be caused by overuse.","translation":"腓腹筋の痛みは使いすぎによって引き起こされることがあります。"},{"sentence":"The gastrocnemian muscle is located on the posterior aspect of the lower leg.","translation":"腓腹筋は下腿の後面に位置しています。"}],"collocations":["gastrocnemian muscle"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Greek γαστήρ (gastḗr, \"belly, stomach\") + κνήμη (knḗmē, \"leg, shin\"), referring to the muscle's belly-like shape and its location on the leg.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡæstrɒkˈniːmiən/","syllables":"gas-troc-ne-mi-an"},"inflection":{"notes":"Plural form of the noun is gastrocnemii."},"usage_notes":{"explanation":"The term \"gastrocnemian\" is primarily used in anatomical and medical contexts. It refers specifically to the large muscle located at the back of the lower leg, commonly known as the calf muscle. While \"calf muscle\" is more commonly used in everyday language, \"gastrocnemian\" is the precise anatomical term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He pulled his gastrocnemius's muscle.","correct":"✓ He pulled his gastrocnemius muscle.","note":"The correct phrasing is \"gastrocnemius muscle,\" not \"gastrocnemius's muscle.\" The term \"gastrocnemius\" functions as an adjective describing the type of muscle."},{"incorrect":"✗ Gastrocnemian is a bone.","correct":"✓ Gastrocnemian is a muscle.","note":"Gastrocnemian refers to a muscle, not a bone."}],"priority":"★★☆"},"related_words":{"derivatives":["gastrocnemius (singular form of the noun)"],"phrases":["gastrocnemius recession (surgical procedure to lengthen the gastrocnemius muscle)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical and anatomical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"gastrocnemian\" is a technical term used in anatomy and medicine to refer to the calf muscle. It is not commonly used in everyday language. Understanding this word is important in contexts related to human anatomy, physiology, and medical discussions involving the lower leg. It's derived from Greek roots, reflecting its scientific origin."},"example_sentences":[{"sentence":"The doctor examined the patient's gastrocnemian for signs of injury.","translation":"医師は患者の腓腹筋を診察し、怪我の兆候がないか確認した。","type":"noun","meaning_category":"腓腹筋"},{"sentence":"Stretching the gastrocnemian can help relieve calf tightness.","translation":"腓腹筋をストレッチすることで、ふくらはぎの張りを和らげることができます。","type":"noun","meaning_category":"腓腹筋"},{"sentence":"Gastrocnemian strains are common in athletes.","translation":"腓腹筋の肉離れはアスリートによく見られます。","type":"adjective","meaning_category":"腓腹筋の"}]}