{"word":"Averroism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アヴェロエス主義：13世紀から16世紀にかけてのヨーロッパで広まった、イスラムの哲学者アヴェロエス（イブン・ルシュド）の哲学思想に基づく学説。アリストテレス哲学の解釈において、信仰と理性の分離、魂の不死の否定、二重真理説（哲学的な真理と宗教的な真理は矛盾しうる）などを主張した。","english_definition":"A philosophical school of thought based on the writings of Averroes (Ibn Rushd), a medieval Andalusian-Arab philosopher. It emphasizes the separation of faith and reason, denies personal immortality, and proposes the doctrine of double truth (philosophical truth and religious truth can be contradictory).","examples":[{"sentence":"Averroism had a significant impact on medieval European thought.","translation":"アヴェロエス主義は中世ヨーロッパの思想に大きな影響を与えた。"},{"sentence":"The doctrine of double truth is a key tenet of Averroism.","translation":"二重真理説はアヴェロエス主義の重要な教義である。"}],"collocations":["Latin Averroism (ラテン・アヴェロエス主義)"],"synonyms":["Latin Aristotelianism"],"antonyms":[]}],"etymology":{"value":"アヴェロエスのラテン語名 Averroes に由来する。アヴェロエスは、12世紀のアンダルシア（イスラム支配下のイベリア半島）で活躍した哲学者、医学者、法学者。彼の著作はラテン語に翻訳され、ヨーロッパの大学で広く研究された。","priority":"★★☆"},"pronunciation":{"ipa":"əˈvɛroʊɪzəm/","syllables":"A-ver-ro-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"「**Averroism**」は、歴史的な文脈でのみ使われる専門用語です。哲学史、特に中世ヨーロッパの思想史を扱う場合に登場します。現代の日常会話で使われることはまずありません。アヴェロエス主義は、キリスト教神学とアリストテレス哲学の調和を図ろうとしたトマス・アクィナスなどのスコラ学者とは対照的な立場を取りました。信仰と理性の関係、哲学と宗教の関係を考察する上で重要な概念です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an Averroism.","correct":"✓ He is an Averroist.","note":"アヴェロエス主義者を指す場合は、Averroist を使います。Averroism は主義そのものを指します。"},{"incorrect":"✗ Averroism is a religion.","correct":"✓ Averroism is a philosophical school of thought.","note":"アヴェロエス主義は宗教ではなく、哲学的な学説です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Averroist (名詞/形容詞: アヴェロエス主義者、アヴェロエス主義の)","Averroistic (形容詞: アヴェロエス主義的な)"],"related_concepts":["Scholasticism (スコラ学)","Thomism (トマス主義)","Double Truth Theory (二重真理説)","Aristotelianism (アリストテレス主義)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (哲学・歴史の専門分野)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Averroism**」は、中世ヨーロッパの哲学史における専門用語であり、一般的には馴染みのない言葉です。アヴェロエス（イブン・ルシュド）というイスラム哲学者の思想に基づき、特にアリストテレス哲学の解釈において、信仰と理性の分離や二重真理説を主張しました。この概念は、中世のスコラ哲学やキリスト教神学との関係で議論されることが多く、哲学史の研究者や専門家向けの用語と言えます。日常会話や一般的な文章で使われることはほとんどありません。"},"example_sentences":[{"sentence":"The condemnation of Averroism in 1277 marked a turning point in medieval intellectual history.","translation":"1277年のアヴェロエス主義の断罪は、中世の知的歴史における転換点となった。","type":"noun","meaning_category":"学説"},{"sentence":"Some scholars argue that Averroism paved the way for the scientific revolution.","translation":"一部の研究者は、アヴェロエス主義が科学革命への道を開いたと主張している。","type":"noun","meaning_category":"学説"},{"sentence":"The Averroist interpretation of Aristotle differed significantly from that of Thomas Aquinas.","translation":"アヴェロエス主義的なアリストテレスの解釈は、トマス・アクィナスの解釈とは大きく異なっていた。","type":"adjective (Averroist)","meaning_category":"アヴェロエス主義の"}]}