{"word":"Naphtols","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ナフトール類 (ナフタレン環にヒドロキシル基が結合した化合物群)","english_definition":"A group of organic compounds consisting of naphthalene with a hydroxyl group attached.","examples":[{"sentence":"Naphtols are used in the production of dyes.","translation":"ナフトール類は染料の製造に使用される。"},{"sentence":"Alpha-naphtol is a common type of naphtol.","translation":"α-ナフトールは一般的なナフトールの一種である。"}],"collocations":["alpha-naphtol","beta-naphtol","naphtol derivatives","naphtol dyes"],"synonyms":["hydroxynaphthalenes"],"antonyms":[]}],"etymology":{"value":"Derived from 'naphthalene' and '-ol' (a suffix used in chemical nomenclature to denote an alcohol).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnæfθɔlz/","syllables":"Naph-thols"},"inflection":{"noun_plural":"Naphtols"},"usage_notes":{"explanation":"'Naphtols' refers to a class of chemical compounds. It is a plural form, as it describes a group of related substances. The singular form is 'naphtol'. These compounds are important in organic chemistry, particularly in the synthesis of dyes and other organic materials.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used naphtol to dye the fabric, but it's naphtols.","correct":"✓ I used naphtol to dye the fabric.","note":"Use the singular form 'naphtol' when referring to the substance in general or a specific instance, not the plural 'naphtols'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Naphthalene","Phenol","Alpha-naphtol","Beta-naphtol"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Naphtols' are a group of chemical compounds related to naphthalene and phenol. They are primarily encountered in advanced chemistry contexts, particularly in discussions of organic synthesis and dye production. Understanding requires familiarity with basic organic chemistry nomenclature."},"example_sentences":[{"sentence":"The synthesis of azo dyes often involves naphtols as key intermediates.","translation":"アゾ染料の合成には、ナフトール類が重要な中間体として関与することが多い。","type":"noun","meaning_category":"chemical compounds"},{"sentence":"Different isomers of naphtols exhibit varying reactivity in chemical reactions.","translation":"ナフトール類の異性体は、化学反応において異なる反応性を示す。","type":"noun","meaning_category":"chemical compounds"}]}