{"word":"biometry","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"生体測定学、バイオメトリクス","english_definition":"The measurement and statistical analysis of unique physical or behavioral characteristics (such as fingerprints or voice patterns) especially as a means of verifying personal identity.","examples":[{"sentence":"Biometry is increasingly used for security purposes.","translation":"バイオメトリクスはセキュリティ目的での利用が増加している。"},{"sentence":"Fingerprint scanning is a common form of biometry.","translation":"指紋スキャンは一般的なバイオメトリクスの形態である。"},{"sentence":"Facial recognition is another example of biometry.","translation":"顔認識はバイオメトリクスの別の例である。"}],"collocations":["biometric data (生体認証データ)","biometric identification (生体認証)","biometric system (生体認証システム)","biometric technology (生体認証技術)","facial biometry (顔の生体認証)","voice biometry (声の生体認証)"],"synonyms":["biometrics","biometric identification","physiological biometry","behavioral biometry"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'bios' (life) and 'metron' (measure).","priority":"★★☆"},"pronunciation":{"ipa":"/baɪˈɒmətri/","syllables":"bi-om-e-try"},"inflection":{"noun_plural":"biometries"},"usage_notes":{"explanation":"'Biometry' refers to the field of study and the techniques used to measure and statistically analyze biological data, especially for identifying individuals. It encompasses various methods, including fingerprint scanning, facial recognition, iris scanning, voice recognition, and gait analysis. The term is often used interchangeably with 'biometrics,' although 'biometry' can also refer more broadly to statistical methods in biological research.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used biometry to unlock my phone.","correct":"✓ I used biometrics to unlock my phone.","note":"While 'biometry' is the study of measuring biological data, 'biometrics' is the specific application of these measurements for identification and authentication."}],"priority":"★★☆"},"related_words":{"derivatives":["biometric (adjective)"],"phrasal_verbs":[],"related_terms":["biostatistics","bioinformatics","biomedical engineering"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing due to technology advancements.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Biometry' is a technical term referring to the science of measuring and statistically analyzing biological characteristics for identification purposes. It is commonly used in security and technology contexts. Understanding this term requires familiarity with scientific and technological vocabulary."},"example_sentences":[{"sentence":"The airport implemented a new biometry system for faster passport control.","translation":"空港は、より迅速なパスポート管理のために新しい生体認証システムを導入した。","type":"noun","meaning_category":"生体測定学"},{"sentence":"Biometry is used in forensic science to identify individuals from biological samples.","translation":"バイオメトリクスは、法医学において、生物学的サンプルから個人を特定するために使用される。","type":"noun","meaning_category":"生体測定学"},{"sentence":"The accuracy of biometry systems is constantly improving.","translation":"生体認証システムの精度は常に向上している。","type":"noun","meaning_category":"生体測定学"}]}