{"word":"Ruanas","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A ruana is a poncho-like outer garment, typically made of wool, and characteristic of the Andes region, particularly in Colombia and Venezuela.","english_definition":"A poncho-like outer garment, typically made of wool, and characteristic of the Andes region, particularly in Colombia and Venezuela.","examples":[{"sentence":"The villagers wore colorful ruanas to protect themselves from the cold mountain air.","translation":"村人たちは、山の冷たい空気から身を守るために、色とりどりのルアナを身に着けていた。"}],"collocations":["wear a ruana","traditional ruana","wool ruana"],"synonyms":["poncho","cloak","cape"],"antonyms":[]}],"etymology":{"value":"The word 'ruana' is believed to originate from the Chibcha language, spoken by the indigenous people of the Andes.","priority":"★★☆"},"pronunciation":{"ipa":"/ruˈɑːnəz/","syllables":"ru-a-nas"},"inflection":{"noun_plural":"Ruanas"},"usage_notes":{"explanation":"Ruanas are often associated with rural communities and are considered a symbol of Andean culture. They are practical garments used for warmth and protection against the elements.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a ruana made of cotton.","correct":"✓ I bought a ruana made of wool.","note":"Ruanas are traditionally made of wool, so specifying cotton would be unusual."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'ruanas' refers to a specific type of garment from the Andes region. Understanding this word requires some cultural awareness of South American clothing traditions. It's not a commonly used word outside of contexts discussing Andean culture or fashion.","priority":"★★☆"},"example_sentences":[{"sentence":"During the festival, many people sported vibrant ruanas.","translation":"祭り期間中、多くの人々が鮮やかなルアナを身につけていた。","type":"noun","meaning_category":"Clothing"},{"sentence":"The artisan carefully wove the intricate patterns into the ruana.","translation":"職人はルアナに複雑な模様を丁寧に織り込んだ。","type":"noun","meaning_category":"Clothing"}]}