{"word":"Treasonless","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Free from or without treason; not involving or characterized by treason.","english_definition":"Not involving or characterized by treason; free from treasonous acts or thoughts.","examples":[{"sentence":"The king declared a treasonless era, promising amnesty to former rebels.","translation":"王は反逆のない時代を宣言し、以前の反逆者への恩赦を約束した。"},{"sentence":"He lived a treasonless life, always loyal to his country.","translation":"彼は常に国に忠実な、反逆とは無縁の人生を送った。"}],"collocations":["treasonless act","treasonless behavior","treasonless society"],"synonyms":["loyal","faithful","patriotic","non-traitorous","devoted"],"antonyms":["treasonous","traitorous","disloyal","rebellious"],"notes":"This word is relatively rare and often used in formal or legal contexts."}],"etymology":{"value":"Formed by adding the suffix '-less' (meaning 'without') to the noun 'treason'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtriːzənləs/","syllables":"trea-son-less"},"inflection":{"adjective_forms":{"comparative":"more treasonless","superlative":"most treasonless"}},"usage_notes":{"explanation":"'Treasonless' describes a state or quality of being free from treason. It's used to emphasize the absence of betrayal or disloyalty, particularly towards one's country or sovereign.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a treasonless.","correct":"✓ He was treasonless.","note":"'Treasonless' is an adjective, not a noun. Avoid using it as a noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["treason (noun): The crime of betraying one's country, especially by attempting to kill or overthrow the sovereign or government.","treasonous (adjective): Involving or guilty of treason; traitorous.","traitor (noun): A person who betrays their country or cause.","traitorous (adjective): Guilty of or involving betrayal or treason."],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Treasonless' is an advanced word indicating the absence of treason. It's not commonly used in everyday language but may appear in legal, historical, or political contexts. Understanding 'treason' is essential to grasp the meaning of 'treasonless'."},"example_sentences":[{"sentence":"The citizens pledged a treasonless oath to the new government.","translation":"市民たちは新政府に反逆しない誓いを立てた。","type":"adjective","meaning_category":"absence of treason"},{"sentence":"His actions were deemed treasonless by the court.","translation":"彼の行動は裁判所によって反逆的ではないと判断された。","type":"adjective","meaning_category":"absence of treason"}]}