{"word":"panphenomenalism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学) 汎現象主義：意識が宇宙全体に遍在するという形而上学的見解。汎心論の一種で、物理的な世界はすべて意識的な性質を持つと主張する。","english_definition":"(Philosophy) The metaphysical view that phenomenal consciousness is ubiquitous throughout the universe. It is a form of panpsychism that specifically asserts that all physical things have phenomenal properties.","examples":[{"sentence":"Some philosophers advocate panphenomenalism as a way to solve the hard problem of consciousness.","translation":"一部の哲学者は、意識のハードプロブレムを解決する方法として汎現象主義を提唱している。"},{"sentence":"Panphenomenalism suggests that even fundamental particles possess some form of consciousness.","translation":"汎現象主義は、素粒子でさえ何らかの形の意識を持っていることを示唆している。"}],"collocations":["argue for panphenomenalism","support panphenomenalism","the implications of panphenomenalism"],"synonyms":["panpsychism","hylozoism"],"antonyms":["materialism","eliminative materialism","epiphenomenalism"]}],"etymology":{"value":"\"pan-\" (all, every) + \"phenomenal\" (relating to phenomena or experience) + \"-ism\" (doctrine, belief).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæn.fɪˈnɒm.ɪ.nəl.ɪ.zəm/","syllables":"pan-phe-nom-e-nal-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Panphenomenalism is a philosophical position within the broader framework of panpsychism. It specifically focuses on phenomenal properties (qualitative, subjective experiences) being fundamental and universally present. It differs from other forms of panpsychism in its specific emphasis on phenomenal consciousness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Panphenomenalism is the same as materialism.","correct":"✓ Panphenomenalism is the opposite of materialism.","note":"Panphenomenalism posits that consciousness is fundamental, while materialism asserts that only matter is fundamental."}],"priority":"★☆☆"},"related_words":{"derivatives":["panpsychism","phenomenal","phenomenology"],"related_concepts":["the hard problem of consciousness","qualia","subjective experience"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Panphenomenalism is an advanced philosophical concept. Understanding it requires familiarity with philosophy of mind, metaphysics, and specifically the problem of consciousness. The term itself is complex and not commonly used outside of academic philosophical discussions."},"example_sentences":[{"sentence":"Critics of panphenomenalism question how individual micro-consciousnesses combine to form macro-consciousness.","translation":"汎現象主義の批判者たちは、個々の微小な意識がどのように結合してマクロ意識を形成するのか疑問視している。","type":"philosophical discussion","meaning_category":"philosophical concept"},{"sentence":"The philosopher explored the implications of panphenomenalism for our understanding of the universe.","translation":"その哲学者は、宇宙の理解に対する汎現象主義の含意を探求した。","type":"philosophical exploration","meaning_category":"philosophical concept"}]}