{"word":"tube-drawing","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"管引き、パイプ引き","english_definition":"A metalworking process used to reduce the diameter and wall thickness of a tube by pulling it through a die.","examples":[{"sentence":"Tube-drawing is used to manufacture seamless tubes with precise dimensions.","translation":"管引きは、精密な寸法のシームレス管を製造するために使用されます。"},{"sentence":"The tube-drawing process can be repeated multiple times to achieve the desired size.","translation":"管引きプロセスは、目的のサイズを達成するために複数回繰り返すことができます。"}],"collocations":["cold tube-drawing","hot tube-drawing","tube-drawing machine","tube-drawing process","seamless tube-drawing"],"synonyms":["pipe drawing"],"antonyms":[]}],"etymology":{"value":"The term is a compound of 'tube' (a long, hollow cylinder) and 'drawing' (the process of pulling a material through a die to reduce its size).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtjuːbˌdrɔːɪŋ/","syllables":"tube-draw-ing"},"inflection":{"noun_plural":"tube-drawings"},"usage_notes":{"explanation":"Tube-drawing is a specialized metal forming process. It is mainly used in manufacturing metal tubes, especially when high precision and good surface finish are required.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ tube drawing","correct":"✓ tube-drawing","note":"Hyphenation is preferred when used as a compound noun or adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":["drawbench","die","mandrel"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Tube-drawing is a technical term used in the field of metalworking. It refers to the process of reducing the diameter and wall thickness of a tube by pulling it through a die. This process is often used to create seamless tubes with precise dimensions and a good surface finish. Understanding this term requires some familiarity with manufacturing processes and materials science."},"example_sentences":[{"sentence":"The company specializes in precision tube-drawing for aerospace applications.","translation":"その会社は、航空宇宙用途向けの精密管引きを専門としています。","type":"noun","meaning_category":"管引き"},{"sentence":"The efficiency of the tube-drawing process was improved by using a new lubricant.","translation":"新しい潤滑剤を使用することにより、管引きプロセスの効率が向上しました。","type":"noun","meaning_category":"管引き"}]}