{"word":"inferiorly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"劣って、下等に、見劣りして","english_definition":"in an inferior manner or position; in a way that is lower in status, quality, or importance.","examples":[{"sentence":"The product was made inferiorly, resulting in many defects.","translation":"その製品は劣悪に製造されたため、多くの欠陥が生じた。"},{"sentence":"He felt inferiorly to his older brother, who was more successful.","translation":"彼は、より成功している兄に対して劣等感を抱いていた。"},{"sentence":"The team played inferiorly in the second half of the game.","translation":"チームは試合の後半で劣ったプレーをした。"}],"collocations":["act inferiorly","behave inferiorly","perform inferiorly","made inferiorly"],"synonyms":["poorly","badly","shoddily","substandardly","second-rate","deficiently"],"antonyms":["superiorly","excellently","admirably","outstandingly"]}],"etymology":{"value":"Derived from the adjective 'inferior' and the suffix '-ly'. 'Inferior' comes from the Latin 'inferior,' meaning 'lower' or 'underneath.'","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈfɪəriərli/","syllables":"in-fe-ri-or-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Inferiorly' is used to describe actions or qualities that are performed or exist in a manner that is lower in quality, status, or importance compared to something else. It often implies a negative comparison. It is not as commonly used as its adjective form, 'inferior.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company treats its employees inferiorly than others.","correct":"✓ The company treats its employees more inferiorly than others. / ✓ The company treats its employees in an inferior manner compared to others.","note":"When making a comparison, it's better to use 'more inferiorly' or rephrase the sentence to use 'in an inferior manner.'"},{"incorrect":"✗ He is inferiorly than her in math.","correct":"✓ He is inferior to her in math.","note":"When comparing people or things, use the adjective 'inferior' with 'to,' not the adverb 'inferiorly.'"}],"priority":"★★☆"},"related_words":{"derivatives":["inferior (adjective)","inferiority (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'inferiorly' is an adverb that describes something done in a way that is of lower quality or status. It's not a common word, and you'll mostly find it in formal writing or speech when someone wants to emphasize that something is being done poorly or is of lower quality compared to something else. It's important to use it correctly to avoid sounding awkward or unnatural. Remember that it describes how something is done, not the thing itself."},"example_sentences":[{"sentence":"The cheaper materials were used, causing the product to perform inferiorly.","translation":"より安価な材料が使用されたため、製品の性能が劣った。","type":"adverb","meaning_category":"performance"},{"sentence":"The workers were treated inferiorly compared to their colleagues in other departments.","translation":"労働者は、他の部署の同僚と比較して劣った扱いを受けた。","type":"adverb","meaning_category":"treatment"},{"sentence":"The team was playing inferiorly and lost the match.","translation":"チームは劣ったプレーをして試合に負けた。","type":"adverb","meaning_category":"performance"}]}