{"word":"compromissary","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"仲裁の、委任仲裁の","english_definition":"Relating to or involving compromise or arbitration.","examples":[{"sentence":"The compromissary clause in the contract stipulated that all disputes would be settled through arbitration.","translation":"契約の仲裁条項には、すべての紛争は仲裁によって解決されると規定されていた。"},{"sentence":"A compromissary agreement was reached between the two parties to avoid a lengthy legal battle.","translation":"長期にわたる法廷闘争を避けるため、両当事者間で仲裁合意が成立した。"}],"collocations":["compromissary clause","compromissary agreement","compromissary power"],"synonyms":["arbitral","mediatory","conciliatory"],"antonyms":[]}],"etymology":{"value":"From the Latin word 'compromissum', meaning 'a joint promise to abide by the decision of an arbitrator'.","priority":"★★★"},"pronunciation":{"ipa":"/kəmˈprɒmɪˌsɛri/","syllables":"com-pro-mis-sa-ry"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"The term 'compromissary' is relatively formal and often used in legal or contractual contexts. It indicates a willingness to resolve disputes through compromise or arbitration, rather than through litigation. It's often seen in clauses that specify how disagreements will be handled.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The compromissary decision was easy to make.","correct":"✓ The compromise decision was easy to make.","note":"'Compromissary' refers to arbitration or compromise mechanisms, not the decision itself. Use 'compromise' to describe the nature of the decision."}],"priority":"★★☆"},"related_words":{"derivatives":["compromise (noun/verb)","arbitration (noun)","arbitrator (noun)"],"phrases":["compromissary clause","compromissary submission"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Compromissary' is a specialized term primarily used in legal and formal contexts related to arbitration and dispute resolution. Understanding this term requires familiarity with legal terminology and the concept of arbitration as an alternative to litigation. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The parties signed a compromissary agreement to resolve their differences.","translation":"当事者たちは、意見の相違を解決するために仲裁合意書に署名した。","type":"adjective","meaning_category":"仲裁の合意"},{"sentence":"The contract included a compromissary clause requiring arbitration for any disputes.","translation":"契約には、紛争が発生した場合の仲裁を義務付ける仲裁条項が含まれていた。","type":"adjective","meaning_category":"仲裁条項"}]}