{"word":"Hyacinthian","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ヒヤシンスのような、ヒヤシンス色の","english_definition":"Resembling the hyacinth flower, especially in color.","examples":[{"sentence":"The painting featured hyacinthian hues of purple and blue.","translation":"その絵画は、紫と青のヒヤシンスのような色合いを特徴としていた。"}],"collocations":["hyacinthian blue","hyacinthian purple"],"synonyms":["violet","lavender","lilac"],"antonyms":[]},{"part_of_speech":"adjective","definition":"美少年のような、ヒヤシンスのように美しい","english_definition":"Resembling Hyacinthus, a beautiful youth in Greek mythology; beautiful and youthful.","examples":[{"sentence":"The young actor had a hyacinthian beauty that captivated audiences.","translation":"その若い俳優は、観客を魅了するヒヤシンスのような美しさを持っていた。"}],"collocations":[],"synonyms":["beautiful","youthful","handsome"],"antonyms":[]}],"etymology":{"value":"From Hyacinthus, a beautiful youth in Greek mythology who was accidentally killed by Apollo and from whose blood the hyacinth flower sprang.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪəˈsɪnθiən/","syllables":"hy-a-cin-thi-an"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"The term 'Hyacinthian' is relatively rare and is primarily used in literary or artistic contexts. It can refer to the color of hyacinths or, more figuratively, to a youthful and beautiful person, reminiscent of the mythological figure Hyacinthus.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Hyacinth (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Hyacinthian' is a rare and sophisticated term, primarily used in literary or artistic contexts. It refers either to the color of hyacinths or to a youthful and beautiful person, reminiscent of the mythological figure Hyacinthus. Due to its infrequent use and connection to classical mythology, it is considered a high-level vocabulary word.","priority":"★☆☆"},"example_sentences":[{"sentence":"The garden was filled with hyacinthian blooms in the spring.","translation":"春には、庭はヒヤシンスのような花でいっぱいになった。","type":"adjective","meaning_category":"ヒヤシンスのような"},{"sentence":"He possessed a hyacinthian grace that made him a favorite subject for artists.","translation":"彼は、彼を芸術家のお気に入りの被写体にするヒヤシンスのような優雅さを持っていた。","type":"adjective","meaning_category":"美少年のような"}]}