{"word":"overreligion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"過度な宗教心、宗教への過剰な傾倒","english_definition":"Excessive or exaggerated religious zeal or devotion.","examples":[{"sentence":"His overreligion alienated him from his more secular friends.","translation":"彼の過度な宗教心は、彼をより世俗的な友人たちから遠ざけた。"},{"sentence":"The community struggled with the leader's overreligion, which led to intolerance.","translation":"そのコミュニティは、指導者の過度な宗教心に苦しみ、それが不寛容につながった。"}],"collocations":["excessive religiosity","fanatical devotion","extreme piety"],"synonyms":["religious fanaticism","zealotry","excessive piety"],"antonyms":["secularism","atheism","agnosticism","irreligion"]},{"part_of_speech":"noun","definition":"過剰な宗教的儀式や規則","english_definition":"An excessive amount of religious rituals, rules, or practices.","examples":[{"sentence":"The village suffered under the weight of overreligion, with constant demands for attendance at services.","translation":"その村は、絶え間ない礼拝への参加要求など、過剰な宗教的儀式に苦しんだ。"},{"sentence":"The new reforms aimed to reduce the burden of overreligion on the citizens.","translation":"新しい改革は、市民に対する過剰な宗教的負担を軽減することを目的とした。"}],"collocations":["excessive ritualism","burdensome practices","strict observances"],"synonyms":["ritualism","legalism","formalism"],"antonyms":["religious freedom","spiritual liberty"]}],"etymology":{"value":"Derived from the prefix 'over-' (excessive) combined with 'religion'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərɪˈlɪdʒən/","syllables":"o-ver-re-li-gion"},"inflection":{"noun_plural":"overreligions"},"usage_notes":{"explanation":"'Overreligion' is typically used to describe a state or practice of religion that is perceived as excessive, fanatical, or burdensome. It often carries a negative connotation, suggesting that the religious devotion or practices are harmful or detrimental.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced overreligion every day.","correct":"✓ He displayed overreligion every day.","note":"'Overreligion' is a state or characteristic, not an action to be practiced. Use verbs like 'display', 'exhibit', or 'show' instead."},{"incorrect":"✗ The overreligion made her happy.","correct":"✓ Her overreligion made her isolated.","note":"'Overreligion' often implies negative consequences, such as isolation or intolerance. While it could theoretically make someone happy, it's more commonly associated with negative outcomes."}],"priority":"★★☆"},"related_words":{"derivatives":["overreligious (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'overreligion' is a relatively uncommon term used to describe an excessive or exaggerated form of religious devotion or practice. It often implies a negative judgment about the intensity or nature of the religious belief. The term is typically used in discussions about the potential harms of religious extremism or the burdens of strict religious observance. Understanding the term requires a grasp of the prefix 'over-' and the concept of religion, as well as an awareness of the potential for religious practices to be viewed as excessive or harmful."},"example_sentences":[{"sentence":"The scholar argued that the community's problems stemmed from an excess of overreligion.","translation":"その学者は、コミュニティの問題は過度な宗教心から生じていると主張した。","type":"noun","meaning_category":"過度な宗教心"},{"sentence":"Many felt that the constant rituals were a form of overreligion that stifled personal growth.","translation":"多くの人が、絶え間ない儀式は個人の成長を妨げる過剰な宗教的儀式の一形態だと感じていた。","type":"noun","meaning_category":"過剰な宗教的儀式"}]}