{"word":"Bussing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（主にアメリカ英語）人種統合を目的としたバス通学","english_definition":"(mainly US) The practice of transporting students by bus to schools so as to redress prior racial segregation of schools, or to overcome the effects of residential segregation.","examples":[{"sentence":"Bussing was a controversial policy aimed at achieving racial balance in schools.","translation":"バス通学は、学校における人種間のバランスを実現することを目的とした物議を醸す政策でした。"},{"sentence":"The debate over bussing continues to highlight the complexities of addressing educational inequality.","translation":"バス通学に関する議論は、教育における不平等の問題に取り組むことの複雑さを浮き彫りにし続けています。"}],"collocations":["school bussing","anti-bussing","court-ordered bussing"],"synonyms":["school integration","desegregation"],"antonyms":["segregation"],"related_words":["desegregation","integration","racial balance","school district","segregation"],"usage_notes":"Bussing is a term primarily used in the United States to describe the practice of assigning and transporting students to schools outside of their immediate neighborhoods to promote racial integration. It was particularly prevalent in the 1970s and 1980s and often met with strong opposition. The term is less commonly used today as other methods of promoting diversity in schools have been adopted.","level_frequency":{"frequency_google_ngram":"Low frequency - historically significant but less common in contemporary usage.","CEFR":"C2"},"readability_explanation":{"level":"C1","text":"'Bussing' refers to a specific historical policy in the US aimed at integrating schools by transporting students of different races to achieve a more balanced racial mix. Understanding this term requires knowledge of US history and social issues related to segregation and civil rights. Due to its specific context and historical relevance, it's considered a more advanced vocabulary term."}}],"etymology":{"value":"Derived from the verb 'bus,' referring to transportation by bus. The addition of '-ing' transforms it into a noun describing the activity or practice of transporting students by bus for the purpose of school desegregation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʌsɪŋ/","syllables":"bus-sing"},"inflection":{"noun_plural":"bussings"},"common_mistakes":{"examples":[{"incorrect":"✗ Bussing is a popular method for all students.","correct":"✓ Bussing was a policy to integrate schools.","note":"Bussing specifically refers to the policy of transporting students for racial integration, not general school transportation."},{"incorrect":"✗ Bussing is still widely used today.","correct":"✓ Bussing was more common in the past.","note":"Bussing is less prevalent today than it was in the past."}]},"example_sentences":[{"sentence":"The implementation of bussing led to protests and resistance in some communities.","translation":"バス通学の実施は、一部の地域社会で抗議や抵抗を引き起こしました。","type":"noun","meaning_category":"Racial Integration"},{"sentence":"The goal of bussing was to provide equal educational opportunities for all students, regardless of their race.","translation":"バス通学の目的は、人種に関係なく、すべての学生に平等な教育機会を提供することでした。","type":"noun","meaning_category":"Educational Equality"}]}