{"word":"Alkaptonuria","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アルカプトン尿症","english_definition":"A rare inherited metabolic disorder in which the body cannot properly process the amino acids tyrosine and phenylalanine, resulting in the accumulation of homogentisic acid.","examples":[{"sentence":"Alkaptonuria is characterized by the excretion of homogentisic acid in the urine, which turns dark upon exposure to air.","translation":"アルカプトン尿症は、尿中のホモゲンチジン酸の排泄を特徴とし、これは空気にさらされると黒ずみます。"},{"sentence":"Treatment for alkaptonuria focuses on managing symptoms and preventing complications.","translation":"アルカプトン尿症の治療は、症状の管理と合併症の予防に焦点を当てています。"}],"collocations":["genetic disorder","metabolic disorder","homogentisic acid","urine discoloration","joint pain","arthritis"],"synonyms":["ochronosis","black urine disease"],"antonyms":[]}],"etymology":{"value":"The term \"alkaptonuria\" is derived from the Arabic word \"al-qali\" (meaning alkali) and the Greek word \"kaptein\" (meaning to devour). It refers to the alkali-binding property of homogentisic acid and its supposed ability to 'devour' cartilage.","priority":"★★☆"},"pronunciation":{"ipa":"ˌælkæptoʊˈnjʊəriə","syllables":"al-kap-to-nu-ri-a"},"inflection":{"noun_plural":"alkaptonurias"},"usage_notes":{"explanation":"Alkaptonuria is a rare genetic disorder, so it is primarily encountered in medical or scientific contexts. It is important to use the correct spelling and pronunciation when discussing this condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ alkaptonuera","correct":"✓ alkaptonuria","note":"Correct spelling is crucial in medical terminology."}],"priority":"★★☆"},"related_words":{"derivatives":["homogentisic acid","tyrosine","phenylalanine","ochronotic arthropathy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Alkaptonuria is a highly specialized medical term. Understanding requires knowledge of genetics, metabolism, and medical terminology. The term is primarily used in scientific and medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Patients with alkaptonuria often develop ochronotic arthropathy later in life.","translation":"アルカプトン尿症の患者は、しばしば晩年にオクロノーシス性関節症を発症します。","type":"general","meaning_category":"medical condition"},{"sentence":"Genetic testing can confirm the diagnosis of alkaptonuria.","translation":"遺伝子検査はアルカプトン尿症の診断を確定することができます。","type":"diagnosis","meaning_category":"medical testing"},{"sentence":"The study investigated the long-term effects of nitisinone on patients with alkaptonuria.","translation":"その研究は、アルカプトン尿症の患者に対するニティシノンの長期的な影響を調査しました。","type":"treatment","meaning_category":"medical treatment"}]}