{"word":"chromatophilous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(細胞や組織が)染色しやすい、色素親和性の","english_definition":"(of a cell or tissue) readily stained; having an affinity for stains or dyes.","examples":[{"sentence":"Chromatophilous bacteria are easily visible under a microscope after staining.","translation":"染色しやすい細菌は、染色後、顕微鏡下で容易に観察できる。"},{"sentence":"The chromatophilous nature of certain cells aids in their identification.","translation":"特定の細胞の染色親和性は、それらの識別に役立つ。"}],"collocations":["chromatophilous bacteria (染色しやすい細菌)","chromatophilous cells (染色しやすい細胞)","chromatophilous tissue (染色しやすい組織)"],"synonyms":["stainable","dye-receptive","tinctorial"],"antonyms":["chromatophobic","stain-resistant"]}],"etymology":{"value":"Derived from the Greek words 'chromato-' (color) + '-philous' (loving, having an affinity for).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkroʊməˈtɒfɪləs/","syllables":"chro-ma-to-phi-lous"},"inflection":{"notes":"Adjective; comparative and superlative forms are more chromatophilous, most chromatophilous."},"usage_notes":{"explanation":"The term \"chromatophilous\" is primarily used in biological and medical contexts to describe cells, tissues, or organisms that readily absorb or bind to stains or dyes. This property is crucial for microscopic examination and identification of these structures. The opposite of chromatophilous is chromatophobic, which describes structures that resist staining.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The chromatophilous is used to stain cells.","correct":"✓ A chromatophilous stain is used to stain cells.","note":"Chromatophilous is an adjective, not a noun. It describes something that has an affinity for stains, not the stain itself."}],"priority":"★★☆"},"related_words":{"derivatives":["chromatophilia (noun: the property of being easily stained)","chromatophobe (noun: a cell or tissue that does not stain easily; adjective: chromatophobic)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"chromatophilous\" is a technical term used in biology and medicine. It describes cells or tissues that easily absorb stains or dyes, making them visible under a microscope. This term is not commonly used in everyday language and is typically encountered in scientific or medical contexts. Understanding this term requires knowledge of basic biological concepts related to cell staining and microscopy."},"example_sentences":[{"sentence":"The pathologist noted the presence of highly chromatophilous cells in the biopsy sample.","translation":"病理医は、生検サンプル中に高度に染色しやすい細胞の存在を指摘した。","type":"general","meaning_category":"染色しやすい細胞"},{"sentence":"Certain fungi exhibit chromatophilous characteristics, aiding in their identification.","translation":"特定の菌類は染色親和性の特徴を示し、それらの識別に役立つ。","type":"general","meaning_category":"色素親和性"}]}