{"word":"Tainui","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(ニュージーランドのマオリ族の)タイヌイ族、またはタイヌイ族の祖先が乗ってきたとされる伝説のカヌー","english_definition":"(in Māori culture) The name of a Māori iwi (tribe) located in the Waikato region of New Zealand, or the ancestral waka (canoe) that brought their ancestors to New Zealand.","examples":[{"sentence":"The Tainui people are the tangata whenua (people of the land) of the Waikato region.","translation":"タイヌイ族はワイカト地方のタンガタ・ウェヌア（その土地の民）です。"},{"sentence":"According to tradition, the Tainui waka landed at Kawhia Harbour.","translation":"伝承によれば、タイヌイのカヌーはカウヒア港に到着しました。"}],"collocations":["Tainui waka (タイヌイのカヌー)","Tainui tribe (タイヌイ族)","Waikato-Tainui (ワイカト-タイヌイ)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Tainui' is of Māori origin. The etymology is debated, but it is believed to be derived from words relating to the canoe's journey or its significance to the people.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtaɪnuːi/","syllables":"Tai-nu-i"},"inflection":{"notes":"Proper noun, does not inflect"},"usage_notes":{"explanation":"'Tainui' refers to both a specific Māori tribe (iwi) and the ancestral canoe that is central to their history and identity. When referring to the tribe, it's important to capitalize the name. The term 'Waikato-Tainui' is also commonly used, referring to a confederation of tribes in the Waikato region descended from the original Tainui settlers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tainui is a famous canoe.","correct":"✓ The Tainui is a famous canoe.","note":"'Tainui' is a proper noun and should be capitalized when referring to the canoe or the tribe."}],"priority":"★★☆"},"related_words":{"derivatives":["Waikato-Tainui (ワイカト-タイヌイ)","Māori (マオリ)","iwi (部族)","waka (カヌー)","tangata whenua (土地の人々)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (specific cultural term)","frequency_google_ngram":"Relatively low, specific to New Zealand context.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tainui' is a culturally specific term referring to a Māori tribe and their ancestral canoe in New Zealand. Understanding this term requires knowledge of Māori history and culture. It is primarily encountered in contexts related to New Zealand history, anthropology, or Māori studies. The term is often associated with the Waikato region of New Zealand.","priority":"★★☆"},"example_sentences":[{"sentence":"The history of the Tainui people is closely linked to the Waikato River.","translation":"タイヌイ族の歴史は、ワイカト川と密接に結びついています。","type":"noun","meaning_category":"Tribe"},{"sentence":"The Tainui waka is said to have carried kūmara (sweet potato) to New Zealand.","translation":"タイヌイのカヌーは、クマラ（サツマイモ）をニュージーランドに運んだと言われています。","type":"noun","meaning_category":"Canoe"}]}