{"word":"Normanism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ノルマンディズム：ノルマン人の特徴、習慣、または言語的影響。特に、ノルマンディー公ギヨーム（ウィリアム征服王）による1066年のイングランド征服に起因する、英語へのフランス語（ノルマン・フランス語）からの借用語や文化的影響を指す。","english_definition":"A characteristic, custom, or linguistic influence of the Normans; especially, a word or cultural influence from French (specifically Norman French) into English resulting from the Norman conquest of England in 1066 by William the Conqueror.","examples":[{"sentence":"The word 'castle' is a Normanism, derived from the Old Norman French 'castel'.","translation":"「castle（城）」という単語はノルマンディズムであり、古ノルマン・フランス語の「castel」に由来する。"},{"sentence":"Many legal terms in English are Normanisms, reflecting the Norman influence on English law.","translation":"英語の多くの法律用語はノルマンディズムであり、英語の法律に対するノルマン人の影響を反映している。"},{"sentence":"The architectural style of many English cathedrals shows Normanisms, such as rounded arches and massive structures.","translation":"多くのイングランドの聖堂の建築様式は、丸いアーチや巨大な構造など、ノルマンディズムを示している。"}],"collocations":["linguistic Normanism (言語的なノルマンディズム)","cultural Normanism (文化的なノルマンディズム)","legal Normanism (法律的なノルマンディズム)","architectural Normanism (建築的なノルマンディズム)"],"synonyms":["French influence (フランス語の影響)","Norman influence (ノルマン人の影響)","Gallicism (ガリア主義、フランス語特有の表現)"],"antonyms":[]}],"etymology":{"value":"「Norman」+「-ism」。ノルマン人（Norman）に関連する特徴や影響を示す接尾辞「-ism」が付いたもの。","priority":"★★★"},"pronunciation":{"ipa":"ˈnɔːrmənɪzəm","syllables":"Nor-man-i-sm"},"inflection":{"noun_plural":"Normanisms"},"usage_notes":{"explanation":"「Normanism」は、主に歴史的および言語学的な文脈で使用される専門用語です。1066年のノルマン・コンクエスト以降の英語への影響を議論する際に特に役立ちます。この用語は、特定の単語、フレーズ、または文化的な慣習がノルマン人の起源を持つことを指摘するために使用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The use of Latin phrases in English is a Normanism.","correct":"✓ The use of Latin phrases in English is a Latinism.","note":"ラテン語由来の表現は「Latinism」と呼びます。ノルマン・フランス語（古フランス語）由来の表現を「Normanism」と呼びます。"},{"incorrect":"✗ Shakespeare's plays are full of Normanisms.","correct":"✓ Shakespeare's plays contain many words of Norman origin.","note":"シェイクスピアの時代には、ノルマン・フランス語の影響はすでに英語に深く浸透していたため、「Normanism」という用語を使うよりも、「Norman origin（ノルマン起源）」という表現を使う方が適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Norman (ノルマン人、ノルマンディーの)","Normanize (ノルマン化する)"],"phrasal_verbs":[],"related_terms":["Norman Conquest (ノルマン・コンクエスト)","Norman French (ノルマン・フランス語)","Anglo-Norman (アングロ・ノルマン語)","French influence on English (英語へのフランス語の影響)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Normanism」は、英語の歴史や言語学を専門的に学ぶ人が使う言葉です。1066年のノルマン・コンクエスト（ノルマンディー公ギヨームによるイングランド征服）以降に、英語に入ってきたフランス語（特にノルマン・フランス語）からの単語や文化的な影響を指します。例えば、「castle（城）」という単語はノルマン・フランス語から来たものです。この言葉は、英語の歴史や言語の変化を詳しく説明するときに使われます。"},"example_sentences":[{"sentence":"The prevalence of words related to law and governance with French roots is a clear example of Normanism in the English language.","translation":"法律や統治に関連するフランス語の語源を持つ言葉の普及は、英語におけるノルマンディズムの明確な例である。","type":"noun","meaning_category":"言語的影響"},{"sentence":"The architectural style of many castles in England reflects Normanism, with its emphasis on strong fortifications and imposing structures.","translation":"イングランドの多くの城の建築様式は、強固な要塞と印象的な構造を重視するノルマンディズムを反映している。","type":"noun","meaning_category":"文化的影響"},{"sentence":"Scholars study Normanisms to understand the complex linguistic history of the English language.","translation":"学者は、英語の複雑な言語史を理解するためにノルマンディズムを研究する。","type":"noun","meaning_category":"言語的影響"}]}