{"word":"gender-negative","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ジェンダー規範や期待に否定的な影響を与える、またはそれを強化する","english_definition":"Having a negative impact on, or reinforcing negative stereotypes or expectations related to gender.","examples":[{"sentence":"The advertisement was criticized for being gender-negative, as it portrayed women in stereotypical roles.","translation":"その広告は、女性をステレオタイプな役割で描いているとして、ジェンダーに否定的であると批判された。"},{"sentence":"Some argue that traditional fairy tales can be gender-negative because they often depict passive princesses and brave princes.","translation":"伝統的な童話は、受動的な王女と勇敢な王子を描くことが多いため、ジェンダーに否定的であると主張する人もいる。"},{"sentence":"The school is trying to address gender-negative attitudes among students through educational programs.","translation":"学校は、教育プログラムを通じて、生徒間のジェンダーに否定的な態度に対処しようとしている。"}],"collocations":["gender-negative stereotypes","gender-negative attitudes","gender-negative impact","gender-negative portrayal","gender-negative representation"],"synonyms":["sexist","gender-biased","misogynistic","misandristic","gender-insensitive"],"antonyms":["gender-positive","gender-neutral","gender-inclusive","gender-affirming"]},{"part_of_speech":"adjective","definition":"ジェンダー平等や多様性を促進しない、または阻害する","english_definition":"Not promoting or hindering gender equality and diversity.","examples":[{"sentence":"The company's policies were seen as gender-negative because they did not offer equal opportunities for women in leadership positions.","translation":"その会社のポリシーは、女性にリーダーシップの地位への平等な機会を提供していなかったため、ジェンダーに否定的であると見なされた。"},{"sentence":"The lack of representation of diverse genders in the media can be gender-negative, reinforcing the idea that certain genders are more important or visible than others.","translation":"メディアにおける多様なジェンダーの表現の欠如は、特定のジェンダーが他のジェンダーよりも重要または目立つという考えを強化し、ジェンダーに否定的になる可能性がある。"}],"collocations":["gender-negative policies","gender-negative practices","gender-negative environment","gender-negative culture"],"synonyms":["inequitable","discriminatory","unfair","biased"],"antonyms":["equitable","inclusive","fair","unbiased"]}],"etymology":{"value":"「gender」（社会的性別）と「negative」（否定的な）の組み合わせ。ジェンダーに関する否定的な影響や態度を示すために作られた比較的新しい言葉。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈdʒɛndər ˈnɛɡətɪv/","syllables":"gen-der-neg-a-tive"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**gender-negative**」は、ジェンダーに関する固定観念を強化したり、ジェンダー平等や多様性を阻害するような状況、態度、表現などを指す言葉です。広告、メディア、教育、職場環境など、さまざまな文脈で使用されます。より直接的な表現である「sexist」（性差別的な）や「gender-biased」（ジェンダーに偏った）と同様の意味合いを持ちますが、「gender-negative」はより広範な影響や結果を指すことがあります。ジェンダーに関する議論や分析において、特定の行動や表現がジェンダーに与える影響を評価する際に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was gender-negative for all genders.","correct":"✓ The movie was gender-negative because it reinforced harmful stereotypes about women.","note":"「gender-negative」は、特定のジェンダーに対する否定的な影響を強調するために使われることが多いため、「すべてのジェンダーに対して」という表現は不適切です。特定のジェンダーに対する影響を具体的に記述する方が適切です。"},{"incorrect":"✗ Gender-negative is the same as gender-neutral.","correct":"✓ Gender-negative is the opposite of gender-positive.","note":"「gender-negative」は「gender-neutral」（ジェンダー中立）とは反対の意味です。「gender-neutral」は、ジェンダーによる区別をしないことを意味しますが、「gender-negative」は、ジェンダーに関する否定的な影響や態度を指します。"},{"incorrect":"✗ The policy was gender-negative, so it was illegal.","correct":"✓ The policy was gender-negative, and it may have violated anti-discrimination laws.","note":"「gender-negative」であること自体が必ずしも違法であるとは限りません。しかし、ジェンダー差別禁止法に違反する可能性があることを示唆する場合には、より慎重な表現を使うべきです。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["sexism","gender bias","misogyny","misandry","gender stereotype","gender equality","gender diversity","gender-positive","gender-neutral","gender-inclusive","gender-affirming"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低い (Relatively low frequency) - 専門的な議論や学術的な文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**gender-negative**」は、ジェンダーに関する固定観念を強めたり、ジェンダーの平等や多様性を妨げるような状況や考え方を表す言葉です。例えば、広告で女性が家事だけをしているように描かれている場合、それは「gender-negative」な表現と言えます。この言葉は、ジェンダーに関する議論で、何が問題なのかを指摘するために使われます。似た言葉に「sexist（性差別的な）」がありますが、「gender-negative」はより広い意味で、ジェンダーに関する否定的な影響全般を指します。専門的な文章や議論でよく使われる言葉です。"},"example_sentences":[{"sentence":"The study revealed the gender-negative effects of certain media portrayals on young girls' self-esteem.","translation":"その研究は、特定のメディア描写が若い女性の自尊心に与えるジェンダーに否定的な影響を明らかにした。","type":"adjective","meaning_category":"ジェンダー規範や期待に否定的な影響を与える"},{"sentence":"The company's hiring practices were criticized for being gender-negative, as they favored male candidates over equally qualified female candidates.","translation":"その会社の採用慣行は、同等の資格を持つ女性候補者よりも男性候補者を優遇しているとして、ジェンダーに否定的であると批判された。","type":"adjective","meaning_category":"ジェンダー平等や多様性を促進しない"}]}