{"word":"he-mannish","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Resembling or characteristic of He-Man, particularly in terms of exaggerated musculature or masculinity.","english_definition":"Having qualities associated with the cartoon character He-Man, such as excessive muscularity or hyper-masculinity.","examples":[{"sentence":"The bodybuilder had a he-mannish physique, with bulging muscles and a powerful stance.","translation":"そのボディービルダーは、盛り上がった筋肉と力強い姿勢で、まるでヒーマンのような体格をしていた。"},{"sentence":"The costume was a bit too he-mannish for my taste; it lacked subtlety.","translation":"そのコスチュームは私の好みには少しヒーマンっぽすぎた。繊細さに欠ける。"}],"collocations":["he-mannish physique","he-mannish costume","he-mannish appearance"],"synonyms":["hypermasculine","overly muscular","brawny","beefy"],"antonyms":["effeminate","delicate","understated"]}],"etymology":{"value":"Derived from the name of the cartoon character He-Man, known for his exaggerated muscularity, combined with the suffix '-ish', indicating resemblance or characteristic.","priority":"Medium"},"pronunciation":{"ipa":"/ˈhiːˌmænɪʃ/","syllables":"he-man-nish"},"inflection":{"adjective_forms":{"comparative":"more he-mannish","superlative":"most he-mannish"}},"usage_notes":{"explanation":"The term 'he-mannish' is typically used informally to describe someone or something that resembles the cartoon character He-Man, often implying an exaggerated or cartoonish level of muscularity or masculinity. It can be used humorously or critically, depending on the context.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ He described the car as he-mannish, but it was actually quite delicate.","correct":"✓ He described the car as macho, but it was actually quite delicate.","note":"'He-mannish' is typically used to describe physical appearance or costumes, not inanimate objects like cars. 'Macho' would be a more appropriate term in this context."}],"priority":"Low"},"related_words":{"derivatives":["He-Man (noun): The cartoon character from which the term is derived."],"phrasal_verbs":[],"priority":"Low"},"level_frequency":{"CEFR":"Not applicable (informal, niche term)","frequency_google_ngram":"Very low frequency","priority":"Low"},"readability_explanation":{"level":"C1","text":"'He-mannish' is an informal term used to describe something that resembles the cartoon character He-Man, known for his exaggerated muscularity and hyper-masculine appearance. It's not a commonly used word and is primarily understood in contexts where the reference to He-Man is clear. The term is often used humorously or critically to describe someone or something that is perceived as overly muscular or masculine in a cartoonish way."},"example_sentences":[{"sentence":"The wrestler's over-the-top persona and physique made him look almost he-mannish.","translation":"そのレスラーの誇張された個性と体格は、彼をほとんどヒーマンのように見せた。","type":"descriptive","meaning_category":"Resembling He-Man"},{"sentence":"The artist's rendering of the hero was intentionally he-mannish, emphasizing his strength and power.","translation":"アーティストによるヒーローの描写は意図的にヒーマン風で、彼の強さと力を強調していた。","type":"descriptive","meaning_category":"Resembling He-Man"}]}