{"word":"sopited","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(古語)静められた、なだめられた、眠らされた","english_definition":"(archaic) calmed, soothed, or put to sleep.","examples":[{"sentence":"The child was sopited by the lullaby.","translation":"その子は子守唄によって眠らされた。"},{"sentence":"His anger was sopited by her gentle words.","translation":"彼の怒りは彼女の優しい言葉によって鎮められた。"}],"collocations":[],"synonyms":["soothed","calmed","pacified","lulled","tranquilized"],"antonyms":["agitated","aroused","disturbed","excited"]}],"etymology":{"value":"Derived from the verb 'sopite', which comes from the Latin 'sopitus', the past participle of 'sopire' meaning 'to lull to sleep, to quiet'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈsɒpɪtɪd","syllables":"sop-i-ted"},"inflection":{"notes":"This is the past participle used as an adjective."},"usage_notes":{"explanation":"'Sopited' is an archaic term, meaning it is no longer in common use. It describes a state of being calmed, soothed, or put to sleep, often implying a gentle or gradual process. It is more commonly found in older literature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The loud music sopited the baby.","correct":"✓ The loud music agitated the baby.","note":"'Sopited' means to calm or soothe, so loud music would have the opposite effect."}],"priority":"★☆☆"},"related_words":{"derivatives":["sopite (verb): to lull to sleep, to quiet","sopitive (adjective): tending to soothe or calm"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare; not in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency; rare in modern usage.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sopited' is a rare and archaic word, meaning it's unlikely to be encountered outside of older texts. It describes something that has been calmed or put to sleep. Because of its rarity, it's not part of standard vocabulary lists and would be considered advanced vocabulary. Understanding the word requires knowledge of Latin roots and an understanding of historical language use."},"example_sentences":[{"sentence":"The storm eventually sopited, leaving a peaceful calm in its wake.","translation":"嵐はやがて静まり、その跡には穏やかな静けさが残った。","type":"adjective","meaning_category":"calmed"},{"sentence":"She felt sopited by the gentle rhythm of the train.","translation":"彼女は列車の穏やかなリズムに心が安らいだ。","type":"adjective","meaning_category":"soothed"}]}