{"word":"misdevoted","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"誤って捧げられた、不適切に費やされた","english_definition":"Having been wrongly or inappropriately dedicated or applied.","examples":[{"sentence":"His misdevoted efforts yielded no positive results.","translation":"彼の誤った努力は、何の肯定的な結果ももたらさなかった。"},{"sentence":"She felt her talents were misdevoted to such a trivial task.","translation":"彼女は自分の才能が、そのような取るに足らない仕事に誤って費やされていると感じた。"}],"collocations":["misdevoted efforts","misdevoted talents","misdevoted resources"],"synonyms":["misapplied","misused","wasted","squandered"],"antonyms":["well-spent","appropriately used","correctly applied"]}],"etymology":{"value":"'mis-' (wrongly) + 'devoted' (dedicated).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɪsdɪˈvoʊtɪd/","syllables":"mis-de-vot-ed"},"inflection":{"notes":"This word primarily functions as an adjective. It can also be the past participle of the verb 'misdevote', though the verb itself is very rare."},"usage_notes":{"explanation":"'Misdevoted' is used to describe something, typically effort, resources, or talent, that has been dedicated or applied in a way that is inappropriate, ineffective, or wasteful. It suggests a sense of regret or criticism about the allocation of something valuable. The term is relatively uncommon.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He misdevoted to the project.","correct":"✓ His efforts were misdevoted to the project.","note":"'Misdevoted' is primarily an adjective describing the state of something (like efforts or resources) rather than a verb of action. It's better to use a verb like 'misapply' or 'waste' if you want to describe the action of misdirecting something."}],"priority":"★★☆"},"related_words":{"derivatives":["misdevote (verb, rare): to wrongly dedicate or apply something"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Misdevoted' is a relatively uncommon word used to describe something valuable (like time, effort, or resources) that has been applied in an inappropriate or wasteful way. It implies a sense of regret or criticism about how something was used. Because of its infrequent usage, it's generally encountered in more formal or literary contexts."},"example_sentences":[{"sentence":"The company's misdevoted funds led to its eventual bankruptcy.","translation":"その会社の誤って費やされた資金が、最終的な倒産につながった。","type":"adjective","meaning_category":"不適切に費やされた"},{"sentence":"Many felt that the government's resources were misdevoted to unnecessary projects.","translation":"多くの人が、政府の資源が不必要なプロジェクトに誤って費やされていると感じた。","type":"adjective","meaning_category":"誤って捧げられた"}]}