{"word":"conflict-driven","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"紛争駆動型の、対立を原動力とする","english_definition":"Driven or motivated by conflict; characterized by or resulting from conflict.","examples":[{"sentence":"The company's culture became conflict-driven after the merger, with departments constantly competing for resources.","translation":"合併後、会社の文化は紛争駆動型になり、各部署が常に資源を奪い合うようになった。"},{"sentence":"His conflict-driven management style created a tense and unproductive work environment.","translation":"彼の紛争駆動型の経営スタイルは、緊張感があり、生産性の低い職場環境を生み出した。"},{"sentence":"The plot of the movie was conflict-driven, with constant clashes between the main characters.","translation":"その映画のプロットは紛争駆動型で、主人公たちの間で絶え間ない衝突が起こった。"}],"collocations":["conflict-driven narrative (紛争駆動型の物語)","conflict-driven plot (紛争駆動型のプロット)","conflict-driven management (紛争駆動型の経営)","conflict-driven culture (紛争駆動型の文化)","conflict-driven approach (紛争駆動型のアプローチ)"],"synonyms":["antagonistic","combative","contentious","discordant","confrontational"],"antonyms":["cooperative","harmonious","collaborative","peaceful","conciliatory"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'conflict' (a state of disagreement or argument) and 'driven' (motivated or propelled by).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɒnflɪkt ˌdrɪvn/","syllables":"con-flict-dri-ven"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with this compound adjective."},"usage_notes":{"explanation":"'Conflict-driven' describes something that is primarily motivated or characterized by conflict. It often implies that conflict is a central or defining aspect. It can be used to describe narratives, management styles, organizational cultures, or any situation where conflict is a primary force.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The project was driven by conflict.","correct":"✓ The project was conflict-driven.","note":"When used as an adjective before a noun, it should be hyphenated. When used after a verb, the hyphen is not necessary."},{"incorrect":"✗ He is a conflict driven person.","correct":"✓ He is a conflict-driven person.","note":"Hyphenate when used as a compound adjective modifying a noun."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Conflict-driven' is a more advanced term used to describe situations, narratives, or approaches that are primarily motivated or characterized by conflict. It implies that conflict is a central or defining aspect. This term is less common in everyday conversation and more likely to be found in academic or professional contexts when discussing strategy, management, or storytelling."},"example_sentences":[{"sentence":"The novel's conflict-driven plot kept readers on the edge of their seats.","translation":"その小説の紛争駆動型のプロットは、読者をハラハラさせた。","type":"adjective","meaning_category":"narrative"},{"sentence":"A conflict-driven approach to negotiation can sometimes lead to a breakdown in communication.","translation":"交渉における紛争駆動型のアプローチは、時にコミュニケーションの崩壊につながる可能性がある。","type":"adjective","meaning_category":"approach"},{"sentence":"The company's conflict-driven culture made it difficult to retain employees.","translation":"その会社の紛争駆動型の文化は、従業員の維持を困難にした。","type":"adjective","meaning_category":"culture"}]}