{"word":"adverbiality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"副詞的性質、副詞性","english_definition":"The state or quality of being adverbial; the characteristic of a word, phrase, or clause that functions as an adverb.","examples":[{"sentence":"The adverbiality of the phrase is determined by its function in the sentence.","translation":"その句の副詞性は、文におけるその機能によって決定される。"},{"sentence":"The clause exhibits adverbiality by modifying the verb.","translation":"その節は動詞を修飾することによって副詞性を示す。"}],"collocations":["express adverbiality (副詞性を表す)","demonstrate adverbiality (副詞性を示す)","analyze adverbiality (副詞性を分析する)"],"synonyms":["adverbial nature","adverbial function","adverbial quality"],"antonyms":[]}],"etymology":{"value":"Formed from 'adverbial' + '-ity'. 'Adverbial' comes from 'adverb' + '-ial'.","priority":"★★★"},"pronunciation":{"ipa":"/ædˌvɜːrbiˈæləti/","syllables":"ad-ver-bi-al-i-ty"},"inflection":{"noun_plural":"adverbialities"},"usage_notes":{"explanation":"'Adverbiality' refers to the property of something acting as an adverb. It's often used in linguistic analysis to describe how a phrase or clause modifies a verb, adjective, or another adverb, indicating manner, time, place, cause, or other circumstances. This term is common in grammatical discussions and linguistic theory.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The adverbiality is a adverb.","correct":"✓ The adverbiality is a property of an adverbial phrase or clause.","note":"Adverbiality is a quality or characteristic, not the adverb itself."},{"incorrect":"✗ Adverbiality only modifies nouns.","correct":"✓ Adverbiality modifies verbs, adjectives, or other adverbs.","note":"Adverbiality never modifies nouns."}],"priority":"★★☆"},"related_words":{"derivatives":["adverb","adverbial"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in academic and linguistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Adverbiality' is a technical term used in linguistics to describe the function of a word, phrase, or clause that acts like an adverb. It refers to the characteristic of modifying a verb, adjective, or another adverb by providing information about manner, time, place, cause, or other circumstances. This term is primarily encountered in advanced grammatical discussions and linguistic theory, making it suitable for those with a strong background in language analysis."},"example_sentences":[{"sentence":"The prepositional phrase 'in the morning' exhibits adverbiality by specifying when the action occurs.","translation":"前置詞句「in the morning（朝に）」は、動作がいつ起こるかを特定することによって副詞性を示す。","type":"noun","meaning_category":"副詞的性質"},{"sentence":"The adverbiality of the clause 'because it was raining' explains the reason for the cancellation.","translation":"節「because it was raining（雨が降っていたので）」の副詞性は、キャンセル理由を説明する。","type":"noun","meaning_category":"副詞的性質"}]}