{"word":"Checkerspot","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(チョウ)ヒョウモンチョウ亜科のチョウ","english_definition":"Any of various butterflies of the tribe Melitaeini, in the subfamily Nymphalinae. They are typically orange, yellow, and brown with black markings.","examples":[{"sentence":"The Edith's Checkerspot is a threatened species of butterfly.","translation":"エディスヒョウモンチョウは絶滅危惧種のチョウです。"},{"sentence":"Checkerspots are known for their striking patterns.","translation":"ヒョウモンチョウ亜科のチョウは、その印象的な模様で知られています。"}],"collocations":["Edith's Checkerspot","Gabb's Checkerspot","Variable Checkerspot","Checkerspot butterfly"],"synonyms":["butterfly","fritillary"],"antonyms":[]}],"etymology":{"value":"The name \"checkerspot\" refers to the checkerboard-like pattern of dark and light spots on the wings of these butterflies.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtʃɛkərˌspɑt/","syllables":"check-er-spot"},"inflection":{"noun_plural":"Checkerspots"},"usage_notes":{"explanation":"\"Checkerspot\" refers to a group of butterflies within the tribe Melitaeini. They are known for their intricate patterns of spots and lines, resembling a checkerboard. Different species of checkerspots can be found in various regions, and some are of conservation concern due to habitat loss and other environmental factors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a checkerspot fly.","correct":"✓ I saw a checkerspot butterfly fly.","note":"While 'checkerspot' is the name of the butterfly, adding 'butterfly' can clarify the meaning, especially for those unfamiliar with the term."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["Edith's Checkerspot (Euphydryas editha)","Gabb's Checkerspot (Dymasia gabbii)","Variable Checkerspot (Euphydryas chalcedona)"],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term \"checkerspot\" is a specific term used to describe a group of butterflies characterized by their distinctive checkerboard-like wing patterns. Understanding the term requires some familiarity with butterfly taxonomy or entomology. The term is not commonly used in everyday conversation but is more likely to appear in scientific or nature-related contexts."},"example_sentences":[{"sentence":"The meadow was filled with colorful wildflowers and Checkerspot butterflies.","translation":"その牧草地は色とりどりの野花とヒョウモンチョウ亜科のチョウでいっぱいでした。","type":"noun","meaning_category":"butterfly"},{"sentence":"Conservation efforts are crucial to protect the habitat of the threatened Checkerspot species.","translation":"絶滅危惧種のヒョウモンチョウ亜科のチョウの生息地を保護するためには、保護活動が不可欠です。","type":"noun","meaning_category":"butterfly"}]}