{"word":"indexterity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不器用さ、ぎこちなさ","english_definition":"Lack of dexterity; awkwardness; clumsiness.","examples":[{"sentence":"His indexterity made simple tasks difficult.","translation":"彼の不器用さのせいで、簡単な作業も難しくなった。"},{"sentence":"The surgeon's indexterity was a cause for concern.","translation":"その外科医の不器用さは懸念の原因となった。"}],"collocations":["physical indexterity","manual indexterity"],"synonyms":["clumsiness","awkwardness","ineptitude","gaucheness"],"antonyms":["dexterity","skill","adroitness","gracefulness"]}],"etymology":{"value":"\"Indexterity\" is formed by adding the prefix \"in-\" (meaning \"not\") to \"dexterity.\" \"Dexterity\" comes from the Latin word \"dexter,\" meaning \"skillful\" or \"right-handed.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌdɛkˈstɛrɪti/","syllables":"in-dex-ter-i-ty"},"inflection":{"noun_plural":"indexterities"},"usage_notes":{"explanation":"\"Indexterity\" is the opposite of \"dexterity.\" It describes a lack of skill, grace, or coordination, particularly in the use of the hands or body. It is less commonly used than its antonym, \"dexterity,\" but it is useful for describing someone who is noticeably clumsy or uncoordinated.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of indexterity in the sport.","correct":"✓ He showed a lot of indexterity in handling the equipment.","note":"\"Indexterity\" is usually used to describe a lack of fine motor skills or coordination, not general athletic ability."},{"incorrect":"✗ Her indexterity was charming.","correct":"✓ Her awkwardness was charming.","note":"While theoretically possible, it's rare to describe indexterity as charming. \"Awkwardness\" is a more common and natural choice in such a context."}],"priority":"★☆☆"},"related_words":{"derivatives":["indexterous (adjective)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"indexterity\" is a relatively uncommon word that means a lack of skill or grace, especially in the use of the hands or body. It is the opposite of \"dexterity.\" You might encounter it in formal writing or discussions about physical abilities. Because it is not frequently used, it is considered a more advanced vocabulary word."},"example_sentences":[{"sentence":"The child's indexterity made it difficult for him to tie his shoelaces.","translation":"その子供は不器用だったので、靴ひもを結ぶのが難しかった。","type":"example","meaning_category":"lack of skill"},{"sentence":"Due to her indexterity, she often spilled drinks.","translation":"彼女は不器用なので、よく飲み物をこぼした。","type":"example","meaning_category":"clumsiness"}]}