{"word":"unprofessionally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"プロらしくなく、専門家らしくなく、未熟に","english_definition":"in a manner that is not professional; lacking the standards, skills, or behavior expected of a professional.","examples":[{"sentence":"He behaved unprofessionally during the meeting.","translation":"彼は会議中にプロらしくない振る舞いをした。"},{"sentence":"The task was handled unprofessionally, leading to several errors.","translation":"その仕事は未熟に扱われたため、いくつかのエラーが発生した。"},{"sentence":"She was criticized for acting unprofessionally on social media.","translation":"彼女はソーシャルメディアでのプロらしくない行動を批判された。"}],"collocations":["behave unprofessionally","handle unprofessionally","act unprofessionally","dress unprofessionally","speak unprofessionally","treat unprofessionally"],"synonyms":["amateurishly","inexpertly","incompetently","carelessly","irresponsibly","unethically"],"antonyms":["professionally","expertly","competently","carefully","responsibly","ethically"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to the adverb 'professionally'. 'Professionally' comes from 'professional', which relates to a profession or occupation requiring specialized knowledge and training.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnprəˈfɛʃənəli/","syllables":"un-pro-fes-sion-al-ly"},"inflection":{"notes":"Since it's an adverb, there are no inflections for number or gender. It modifies verbs, adjectives, or other adverbs."},"usage_notes":{"explanation":"'Unprofessionally' describes actions, behaviors, or methods that do not meet the expected standards of a professional. This can include a lack of skill, knowledge, or ethical conduct. It often implies a failure to maintain appropriate decorum or standards in a work or business setting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted unprofessionally, that's why he was fired.","correct":"✓ He acted unprofessionally; that's why he was fired. / ✓ He acted unprofessionally, so he was fired.","note":"When using 'that's why' to explain a consequence, it often follows a semicolon or is separated into a new sentence. Alternatively, 'so' can be used as a conjunction.","priority":"★★★"},{"incorrect":"✗ The unprofessionally behavior was not accepted.","correct":"✓ The unprofessional behavior was not accepted.","note":"'Unprofessionally' is an adverb, so it modifies verbs, adverbs or adjectives. To modify the noun 'behavior', you need the adjective 'unprofessional'.","priority":"★★★"}],"priority":"★★★"},"related_words":{"derivatives":["unprofessional (adjective)","unprofessionalism (noun)","professionally (adverb)","professional (adjective/noun)","profession (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but understood in professional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unprofessionally' is used to describe actions or behavior that do not meet the standards expected in a professional environment. It implies a lack of skill, competence, or ethical conduct. It is commonly used in business, legal, or academic settings to criticize or describe inappropriate behavior.","priority":"★★☆"},"example_sentences":[{"sentence":"The customer service representative handled the complaint unprofessionally, making the situation worse.","translation":"その顧客サービス担当者は苦情をプロらしくなく処理し、状況を悪化させた。","type":"adverb","meaning_category":"manner of handling"},{"sentence":"He dressed unprofessionally for the job interview, which made a poor first impression.","translation":"彼は就職面接にプロらしくない服装で現れ、悪い第一印象を与えた。","type":"adverb","meaning_category":"manner of dressing"},{"sentence":"The manager spoke unprofessionally to his employees, creating a hostile work environment.","translation":"そのマネージャーは従業員にプロらしくない口調で話し、敵対的な職場環境を作り出した。","type":"adverb","meaning_category":"manner of speaking"},{"sentence":"The report was written unprofessionally, with many grammatical errors and inconsistencies.","translation":"その報告書はプロらしくなく書かれており、多くの文法的な誤りや矛盾があった。","type":"adverb","meaning_category":"manner of writing"}]}