{"word":"Thelyblast","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Botany) A type of inflorescence in which the terminal flower blooms first, inhibiting further elongation of the main axis. Subsequent flowers develop on lateral branches below.","english_definition":"(Botany) An inflorescence in which the terminal flower opens first and inhibits further elongation of the main axis, with subsequent flowers developing on lateral branches below.","examples":[{"sentence":"The cymose inflorescence of chickweed is a thelyblast.","translation":"ミドリハコベの集散花序はテリーブラストである。"}],"collocations":[],"synonyms":["cymose inflorescence"],"antonyms":["raceme"],"notes":"The term is relatively uncommon outside of specialized botanical contexts."}],"etymology":{"value":"From Ancient Greek θῆλυς (thêlus, “female”) + βλαστός (blastós, “sprout, bud”). The etymology is not directly related to the meaning of the inflorescence type but is a historical term.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈθɛlɪˌblæst/","syllables":"The-ly-blast"},"inflection":{"noun_plural":"Thelyblasts"},"usage_notes":{"explanation":"Thelyblast is a botanical term describing a specific type of cymose inflorescence. It is not commonly used in general conversation.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_terms":["cyme","inflorescence"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'thelyblast' is highly specialized and primarily used within the field of botany to describe a specific type of inflorescence. Its usage is rare outside of academic or technical contexts related to plant morphology. Understanding this term requires a strong background in botanical terminology."},"example_sentences":[{"sentence":"The thelyblast structure is characteristic of several Caryophyllaceae species.","translation":"テリーブラスト構造は、ナデシコ科のいくつかの種に特徴的である。","type":"technical","meaning_category":"botany"}]}