{"word":"vasoparesis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"血管麻痺（けっかんまひ）：血管の収縮能力の低下または喪失。これにより、血管が適切に収縮できなくなり、血圧の低下や組織への血液供給の障害を引き起こす可能性がある。","english_definition":"Paralysis of vasomotor nerves resulting in dilatation of blood vessels.","examples":[{"sentence":"Vasoparesis can lead to severe hypotension.","translation":"血管麻痺は重度の低血圧を引き起こす可能性がある。"},{"sentence":"The patient exhibited signs of vasoparesis following the spinal cord injury.","translation":"その患者は脊髄損傷後、血管麻痺の兆候を示した。"}],"collocations":["develop vasoparesis (血管麻痺を発症する)","severe vasoparesis (重度の血管麻痺)","treat vasoparesis (血管麻痺を治療する)"],"synonyms":["vasomotor paralysis","vascular paralysis"],"antonyms":["vasoconstriction"],"notes":"Vasoparesis is often associated with conditions such as sepsis, spinal cord injury, and certain medications."}],"etymology":{"value":"The term \"vasoparesis\" is derived from the combination of \"vaso-\" (referring to blood vessels) and \"paresis\" (meaning partial paralysis or weakness).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌveɪzoʊpəˈriːsɪs/","syllables":"va-so-pa-re-sis"},"inflection":{"noun_plural":"vasopareses"},"usage_notes":{"explanation":"Vasoparesis is a medical term primarily used in clinical and research settings. It describes a specific physiological condition involving the loss of vasomotor control, which can have significant implications for blood pressure regulation and tissue perfusion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor diagnosed him with vasodilation instead of vasoparesis.","correct":"✓ The doctor diagnosed him with vasoparesis.","note":"Vasodilation (血管拡張) is the widening of blood vessels, while vasoparesis is the paralysis of vasomotor nerves, leading to the inability of blood vessels to constrict properly. These are distinct conditions."}],"priority":"★☆☆"},"related_words":{"derivatives":["vasoparetic (adjective: relating to or characterized by vasoparesis)"],"related_terms":["vasodilation (血管拡張)","vasoconstriction (血管収縮)","hypotension (低血圧)","sepsis (敗血症)","spinal cord injury (脊髄損傷)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Vasoparesis\" is a highly specialized medical term that refers to the paralysis or weakening of the vasomotor nerves, which control the constriction and dilation of blood vessels. This condition can lead to impaired blood pressure regulation and reduced blood flow to tissues. Due to its technical nature, the term is primarily encountered in medical literature and clinical settings. Understanding this term requires a solid foundation in physiology and medical terminology."},"example_sentences":[{"sentence":"Sepsis-induced vasoparesis contributes to distributive shock.","translation":"敗血症によって誘発される血管麻痺は、分布性ショックの一因となる。","type":"medical condition","meaning_category":"pathophysiology"},{"sentence":"The patient's vasoparesis was managed with vasopressor medications.","translation":"その患者の血管麻痺は、昇圧剤で管理された。","type":"medical treatment","meaning_category":"clinical management"}]}