{"word":"solemnize","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(結婚・契約・宗教的儀式など)を厳粛に行う、正式に執り行う、祝う","english_definition":"to perform (a marriage or other ceremony) with proper ceremony; to celebrate or commemorate in a formal or dignified manner.","examples":[{"sentence":"The priest solemnized the marriage in the village church.","translation":"司祭は村の教会で結婚式を厳粛に執り行った。"},{"sentence":"The treaty was solemnized with a formal signing ceremony.","translation":"条約は正式な署名式典をもって厳粛に締結された。"},{"sentence":"They solemnized the occasion with a moment of silence.","translation":"彼らは沈黙のひとときをもってその機会を厳粛に祝った。"}],"collocations":["solemnize a marriage (結婚式を厳粛に執り行う)","solemnize a contract (契約を厳粛に締結する)","solemnize an occasion (機会を厳粛に祝う)","solemnize a religious rite (宗教儀式を厳粛に執り行う)"],"synonyms":["celebrate","commemorate","observe","perform","officiate","sanctify","hallow","dedicate"],"antonyms":["desecrate","profane","disregard","ignore"]}],"etymology":{"value":"late 15th century: from Old French solemniser, from medieval Latin solemnizare, from Latin sollemnis ‘annual, religious, formal’ (see solemn).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɒləmnaɪz/","syllables":"so-lem-nize"},"inflection":{"verb_forms":{"present_simple":["solemnize","solemnizes"],"past_simple":"solemnized","past_participle":"solemnized","present_participle":"solemnizing"}},"usage_notes":{"explanation":"'Solemnize' implies a formal and dignified performance of a ceremony or event, often with religious or legal significance. It suggests a sense of reverence and importance attached to the occasion. The word is typically used in contexts involving marriages, contracts, religious rites, or other significant events that are treated with great respect and formality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They solemnized the party with loud music and dancing.","correct":"✓ They celebrated the party with loud music and dancing.","note":"'Solemnize' implies a dignified and formal occasion, not a lively and informal one. 'Celebrate' is more appropriate for a party with music and dancing."},{"incorrect":"✗ The couple wanted to solemnize their love without any ceremony.","correct":"✓ The couple wanted to celebrate their love without any ceremony.","note":"'Solemnize' inherently involves a ceremony. If there's no ceremony, 'celebrate' is a better choice."}],"priority":"★★☆"},"related_words":{"derivatives":["solemn (adjective: serious, dignified, formal)","solemnity (noun: the state or quality of being solemn; a solemn event or ceremony)","solemnization (noun: the act of solemnizing)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Solemnize' is a formal word that means to perform a ceremony (like a wedding) in a serious and respectful way. It suggests that the event is important and should be treated with dignity. You might see it used when talking about religious or legal ceremonies. It's not a word you'd use in everyday conversation, but it's important to understand its meaning in formal contexts."},"example_sentences":[{"sentence":"The judge solemnized the agreement between the two companies.","translation":"裁判官は2社間の合意を厳粛に承認した。","type":"verb","meaning_category":"契約を厳粛に執り行う"},{"sentence":"The ancient ritual was solemnized by the high priest.","translation":"古代の儀式は、大祭司によって厳粛に執り行われた。","type":"verb","meaning_category":"宗教的儀式を厳粛に執り行う"},{"sentence":"The anniversary of the battle was solemnized with a parade.","translation":"その戦いの記念日は、パレードで厳粛に祝われた。","type":"verb","meaning_category":"機会を厳粛に祝う"}]}