{"word":"urinaemia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"尿毒症","english_definition":"A toxic condition resulting from kidney disease in which there is retention in the bloodstream of waste products normally excreted in the urine.","examples":[{"sentence":"Urinaemia can lead to serious health complications if left untreated.","translation":"尿毒症は放置すると深刻な健康上の合併症を引き起こす可能性があります。"},{"sentence":"The patient was diagnosed with urinaemia after blood tests revealed high levels of urea and creatinine.","translation":"血液検査で尿素とクレアチニンの値が高いことが判明し、患者は尿毒症と診断されました。"}],"collocations":["chronic urinaemia (慢性尿毒症)","acute urinaemia (急性尿毒症)","severe urinaemia (重症尿毒症)","treat urinaemia (尿毒症を治療する)","diagnose urinaemia (尿毒症を診断する)"],"synonyms":["uremia","azotemia","renal failure","kidney failure"],"antonyms":[]}],"etymology":{"value":"From the combination of 'urine' (尿) and '-emia' (血液の状態を示す接尾辞).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjʊərɪˈniːmiə/","syllables":"u-ri-nae-mi-a"},"inflection":{"noun_plural":"urinaemias"},"usage_notes":{"explanation":"Urinaemia (or uremia) refers to the buildup of toxic waste products in the blood due to kidney dysfunction. It is a serious medical condition that requires prompt diagnosis and treatment. The terms urinaemia and uremia are often used interchangeably.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has urinaemia but their kidneys are functioning normally.","correct":"✓ The patient has urinaemia because their kidneys are not functioning properly.","note":"Urinaemia is caused by kidney dysfunction, so normal kidney function would contradict the diagnosis."}],"priority":"★☆☆"},"related_words":{"derivatives":["uremic (形容詞: 尿毒症の、尿毒症性の)","uremia (名詞: 尿毒症 - urinaemia の同義語)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - 医学用語 (Low frequency - medical term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Urinaemia' is a medical term referring to the presence of toxic waste products in the blood due to kidney failure. It is a serious condition requiring medical intervention. The term is primarily used in medical contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The doctor suspected urinaemia based on the patient's symptoms and ordered blood tests.","translation":"医師は患者の症状から尿毒症を疑い、血液検査を指示した。","type":"general","meaning_category":"diagnosis"},{"sentence":"Dialysis is a common treatment for urinaemia to remove waste products from the blood.","translation":"透析は、血液から老廃物を除去するための尿毒症の一般的な治療法です。","type":"treatment","meaning_category":"treatment"},{"sentence":"If left untreated, urinaemia can lead to coma and death.","translation":"放置すると、尿毒症は昏睡や死に至る可能性があります。","type":"complication","meaning_category":"complication"}]}