{"word":"relament","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(rare, nonstandard) to lament again; to express sorrow or regret repeatedly.","english_definition":"(rare, nonstandard) To lament again or repeatedly.","examples":[{"sentence":"He relamented his lost opportunities, dwelling on them day after day.","translation":"彼は失われた機会を繰り返し嘆き、毎日それらに思いを馳せていた。"},{"sentence":"She relamented the past, unable to move forward.","translation":"彼女は過去を繰り返し嘆き、前進することができなかった。"}],"collocations":["relament a loss","relament a mistake","relament the past"],"synonyms":["lament repeatedly","bewail again","deplore again"],"antonyms":["rejoice","celebrate","forget"]}],"etymology":{"value":"Formed by adding the prefix 're-' (again) to 'lament'. This construction is rare, and the word is not widely recognized or used.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːləˈmɛnt/","syllables":"re-la-ment"},"inflection":{"verb_forms":{"present_simple":["relament","relaments"],"past_simple":"relamented","past_participle":"relamented","present_participle":"relamenting"}},"usage_notes":{"explanation":"'Relament' is a rare and somewhat nonstandard word. It is formed logically but is not in common usage. It suggests a repeated or renewed act of lamenting. It's important to note that standard English speakers would more likely use phrases like 'lament again' or 'repeatedly lament' instead of 'relament'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I relamented my decision, so I changed it.","correct":"✓ I regretted my decision, so I changed it.","note":"Use 'regret' instead of 'relament' for a more common and natural expression."},{"incorrect":"✗ She relaments the loss of her pet every day.","correct":"✓ She laments the loss of her pet every day. / ✓ She repeatedly laments the loss of her pet.","note":"Use 'lament' or 'repeatedly laments' for a more standard and understandable sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["lament","lamentation","lamentable"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Very low frequency - the word is rare and not widely recognized.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Relament' is a rare and non-standard word. Its meaning is relatively straightforward to infer from its components ('re-' + 'lament'), but it is not a word that would typically be used in either formal or informal contexts. Standard alternatives such as 'lament again' or 'repeatedly lament' are preferred. Understanding this word is more about recognizing its potential meaning than actively using it."},"example_sentences":[{"sentence":"Though not commonly used, one could say he relamented his youthful indiscretions in his old age.","translation":"一般的には使われないが、彼は晩年に若い頃の無分別な行為を繰り返し嘆いたと言うことができるだろう。","type":"verb","meaning_category":"to lament again"},{"sentence":"She relamented the passing of time, wishing she could relive her youth.","translation":"彼女は時の流れを繰り返し嘆き、青春時代を再び生きることができたらと願った。","type":"verb","meaning_category":"to express sorrow repeatedly"}]}