{"word":"Non-Malayan","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"マレー人ではない、マレー半島またはマレー諸島に関連しない","english_definition":"Not of Malayan origin or relating to the Malay Peninsula or Malay Archipelago.","examples":[{"sentence":"The policy affected both Malayan and Non-Malayan residents.","translation":"その政策は、マレー人居住者と非マレー人居住者の両方に影響を与えた。"},{"sentence":"The study compared the cultural practices of Malayan and Non-Malayan communities in the region.","translation":"その研究は、その地域におけるマレー人コミュニティと非マレー人コミュニティの文化的慣習を比較した。"}],"collocations":["Non-Malayan citizen","Non-Malayan culture","Non-Malayan ethnicity"],"synonyms":["Non-Malay","Of different origin"],"antonyms":["Malayan"],"notes":"Often used in contexts discussing demographics, cultural studies, or policies in regions with significant Malay populations."}],"etymology":{"value":"Formed by adding the prefix 'non-' to 'Malayan'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌnɒn məˈleɪən/","syllables":"Non-Ma-lay-an"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'Non-Malayan' is used to differentiate individuals, cultures, or things that are not of Malay origin or associated with the Malay Peninsula and Malay Archipelago. It is often used in contexts where it is necessary to distinguish between Malay and other groups.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The Non-Malayan is from Malaysia.","correct":"✓ The Non-Malayan is not of Malay ethnicity, but may be from Malaysia.","note":"Being from Malaysia does not automatically make someone Malayan. 'Non-Malayan' indicates someone not of Malay ethnicity or origin."}],"priority":"N/A"},"related_words":{"derivatives":["Malayan","Malay","Non-Malay"],"related_terms":["Malay Peninsula","Malay Archipelago"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'Non-Malayan' is relatively straightforward but requires an understanding of the term 'Malayan'. It is used in academic or formal contexts when differentiating between Malay and other groups is necessary. It is not a common term in everyday conversation."},"example_sentences":[{"sentence":"The museum featured artifacts from both Malayan and Non-Malayan cultures.","translation":"その博物館には、マレー文化と非マレー文化の両方の工芸品が展示されていた。","type":"general","meaning_category":"Cultural distinction"},{"sentence":"The government implemented policies to support Non-Malayan businesses.","translation":"政府は、非マレー人企業を支援するための政策を実施した。","type":"general","meaning_category":"Policy context"}]}