{"word":"Tripersonalism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"三位人格説：三位一体の神を三つの別個の人格を持つ存在として捉える異端の教義","english_definition":"The heretical doctrine that the Trinity consists of three separate persons, rather than one God in three persons.","examples":[{"sentence":"Tripersonalism was condemned as a heresy by the early Church councils.","translation":"三位人格説は初期の教会会議によって異端として非難された。"},{"sentence":"Some critics accuse certain theological viewpoints of leaning towards tripersonalism.","translation":"一部の批評家は、特定の神学的見解が三位人格説に傾倒していると非難している。"}],"collocations":["fall into tripersonalism","avoid tripersonalism","accused of tripersonalism"],"synonyms":["tritheism"],"antonyms":["modalism","monarchianism","unitarianism"]}],"etymology":{"value":"'Tri-' (three) + 'personal' (relating to a person) + '-ism' (doctrine or belief).","priority":"中"},"pronunciation":{"ipa":"/traɪˌpɜːrsənəlɪzəm/","syllables":"tri-per-son-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Tripersonalism is considered a heresy within mainstream Christian theology because it compromises the unity of God. Orthodox Trinitarian doctrine affirms that the Father, Son, and Holy Spirit are distinct persons but are one God, indivisible in essence.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"Tripersonalism is the orthodox view of the Trinity.","correct":"Tripersonalism is a heretical view of the Trinity.","note":"Tripersonalism is considered a heresy, not an orthodox view."}],"priority":"中"},"related_words":{"derivatives":["tripersonal (adjective)"],"related_terms":["Trinity","hypostasis","modalism","tritheism"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"低"},"readability_explanation":{"level":"C2","text":"Tripersonalism is a theological term that is rarely used outside of discussions about Christian doctrine. Understanding requires familiarity with Trinitarian theology and the history of Christian heresies."},"example_sentences":[{"sentence":"The theologian argued that the proposed doctrine risked falling into tripersonalism.","translation":"その神学者は、提案された教義が三位人格説に陥る危険性があると主張した。","type":"theological","meaning_category":"heresy"},{"sentence":"Early Church Fathers wrote extensively against tripersonalism and similar heresies.","translation":"初期の教父たちは、三位人格説や同様の異端に対して広範囲にわたって書いた。","type":"historical","meaning_category":"heresy"}]}