{"word":"short-burst","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"短時間で集中的に行われる、短時間の","english_definition":"lasting a short time but very intense; done in short, concentrated periods.","examples":[{"sentence":"The training program uses short-burst exercises to improve fitness.","translation":"そのトレーニングプログラムは、フィットネスを向上させるために短時間の集中的な運動を使用しています。"},{"sentence":"We need a short-burst solution to address the immediate problem.","translation":"当面の課題に対処するためには、短時間で効果を発揮する解決策が必要です。"},{"sentence":"The athlete is known for their short-burst speed.","translation":"その選手は、短距離での瞬発力で知られています。"}],"collocations":["short-burst exercise","short-burst training","short-burst solution","short-burst activity","short-burst performance","short-burst effort"],"synonyms":["brief","intense","concentrated","rapid","quick","fleeting"],"antonyms":["long-term","sustained","prolonged","continuous","extended"]},{"part_of_speech":"noun","definition":"短時間の集中、短時間の活動","english_definition":"a short period of intense activity or concentration.","examples":[{"sentence":"The project requires several short-bursts of focused work.","translation":"そのプロジェクトでは、集中的な作業を何度か短時間行う必要があります。"},{"sentence":"He prefers to work in short-bursts rather than long stretches.","translation":"彼は、長時間続けるよりも、短時間で集中して作業することを好みます。"},{"sentence":"The team achieved significant progress through short-bursts of innovation.","translation":"チームは、短期間の集中的な革新を通じて、目覚ましい進歩を遂げました。"}],"collocations":["in short-bursts","short-burst of activity","short-burst of energy","short-burst of innovation","short-burst of effort","short-burst of concentration"],"synonyms":["spurt","burst","outburst","spell","period","bout"],"antonyms":["long period","sustained effort","continuous activity"]}],"etymology":{"value":"The term is a combination of 'short' and 'burst', indicating a brief and sudden release or period of activity.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌʃɔːrt ˈbɜːrst/","syllables":"short-burst"},"inflection":{"notes":"This word is typically used as an adjective or a noun. It doesn't have typical inflections like verb conjugations or plural forms, but the noun can be pluralized as 'short-bursts'."},"usage_notes":{"explanation":"'Short-burst' describes something that is characterized by being brief and intense. It is often used in contexts related to physical activity, problem-solving, or project management where concentrated effort is applied over a short duration. The term emphasizes the intensity and brevity of the action or period.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The long-burst activity was tiring.","correct":"✓ The sustained activity was tiring.","note":"'Long-burst' is not a common or standard term. Use 'sustained' or 'prolonged' to describe something that lasts a long time."},{"incorrect":"✗ He did a short-burst of work for hours.","correct":"✓ He did short-bursts of work for a few minutes each time.","note":"'Short-burst' implies a brief duration. If the activity lasted for hours, it's not a short-burst activity."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["burst","short","intense","brief","rapid","concentrated","spurt","outburst"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing in specific contexts like fitness and project management.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Short-burst' is a compound term used to describe activities or efforts that are characterized by being both brief and intense. It is used to convey the idea of something happening quickly and with a high degree of concentration or energy. This term is commonly used in fields such as fitness, sports, and project management to describe activities that are performed in short, focused intervals. Understanding the term requires recognizing the combination of 'short' and 'burst' to mean a brief, intense period of activity."},"example_sentences":[{"sentence":"The sprinter used short-burst acceleration to win the race.","translation":"その短距離走者は、レースに勝つために短時間の加速を利用しました。","type":"adjective","meaning_category":"Intense activity"},{"sentence":"The team worked in short-bursts to meet the deadline.","translation":"チームは締め切りに間に合わせるために、短時間で集中的に作業しました。","type":"noun","meaning_category":"Concentrated effort"},{"sentence":"Short-burst training can be very effective for building muscle.","translation":"短時間の集中トレーニングは、筋肉を増強するのに非常に効果的です。","type":"adjective","meaning_category":"Intense training"},{"sentence":"The company needed a short-burst marketing campaign to boost sales.","translation":"会社は売上を伸ばすために、短期間の集中的なマーケティングキャンペーンを必要としていました。","type":"adjective","meaning_category":"Concentrated effort"}]}