{"word":"coreigns","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"複数の統治者が同時に同じ国または地域を統治する形態、共同統治者たち","english_definition":"Multiple rulers reigning simultaneously over the same country or territory; the joint rulers themselves.","examples":[{"sentence":"The Roman Empire was sometimes ruled by coreigns.","translation":"ローマ帝国は時に共同統治者たちによって統治された。"},{"sentence":"The system of coreigns ensured stability during the transition period.","translation":"共同統治者の制度は移行期における安定を確保した。"}],"collocations":["joint rule","dual monarchy","shared sovereignty"],"synonyms":["joint rulers","co-rulers","joint sovereigns"],"antonyms":["sole ruler","autocrat"]},{"part_of_speech":"noun","definition":"(歴史的な用法) 共同統治者として君臨した人物","english_definition":"(historical usage) A person who reigned as a joint ruler.","examples":[{"sentence":"Edward and Richard were coreigns for a brief period.","translation":"エドワードとリチャードは短い期間、共同統治者だった。"}],"collocations":[],"synonyms":["co-ruler","joint sovereign"],"antonyms":["sole ruler"]}],"etymology":{"value":"'co-' (共に) + 'reign' (統治) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌkoʊˈreɪnz/","syllables":"co-reigns"},"inflection":{"noun_plural":"coreigns"},"usage_notes":{"explanation":"'Coreigns' は、複数の君主が同時に統治する状態またはその統治者たちを指す言葉です。歴史的な文脈でよく使用され、現代ではあまり一般的ではありません。","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["co-regency","reign"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'coreigns' refers to a situation where two or more individuals simultaneously hold the position of sovereign ruler over a territory. This concept is relatively rare in modern political systems but has occurred in various historical contexts, such as in certain periods of the Roman Empire or in some forms of dual monarchies. Understanding this term requires familiarity with political science and history, particularly concerning forms of government and succession. The word is not commonly used in everyday conversation, making it more relevant for academic or specialized discussions."},"example_sentences":[{"sentence":"The study examines the effectiveness of coreigns in maintaining political stability.","translation":"その研究は、政治的安定を維持する上での共同統治者の有効性を検証する。","type":"noun","meaning_category":"共同統治者たち"},{"sentence":"The history books detail the challenges faced by the coreigns during their shared rule.","translation":"歴史書には、共同統治者たちが共同統治期間中に直面した課題が詳しく書かれている。","type":"noun","meaning_category":"共同統治者たち"}]}