{"word":"pumpkin-headed","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"かぼちゃ頭の、頭が大きく不格好な","english_definition":"Having a head that is large and ungainly, resembling a pumpkin in shape.","examples":[{"sentence":"The scarecrow was a pumpkin-headed figure in the field.","translation":"その案山子は畑でかぼちゃ頭の姿をしていた。"},{"sentence":"He drew a cartoon of a pumpkin-headed man.","translation":"彼はかぼちゃ頭の男の漫画を描いた。"}],"collocations":["a pumpkin-headed scarecrow (かぼちゃ頭の案山子)","a pumpkin-headed figure (かぼちゃ頭の人物)"],"synonyms":["blockhead","lumpish","gourd-headed"],"antonyms":[],"notes":"Often used in a humorous or derogatory way."},{"part_of_speech":"adjective","definition":"(比喩的に)頭の鈍い、愚鈍な","english_definition":"(Figurative) Stupid; unintelligent.","examples":[{"sentence":"Don't be so pumpkin-headed! Think before you act.","translation":"そんなに頭が鈍いな！行動する前に考えろ。"},{"sentence":"He's a nice guy, but a bit pumpkin-headed when it comes to math.","translation":"彼はいいやつだが、数学に関しては少し頭が鈍い。"}],"collocations":["pumpkin-headed fool (かぼちゃ頭の馬鹿)","pumpkin-headed idiot (かぼちゃ頭の阿呆)"],"synonyms":["dull-witted","thick-headed","boneheaded","stupid","foolish"],"antonyms":["intelligent","smart","clever","bright"],"notes":"Used as an insult or to express frustration."}],"etymology":{"value":"A compound word formed from 'pumpkin' (a large, round fruit) and 'headed' (having a head). The literal meaning refers to the shape of the head, while the figurative meaning derives from the association of a large, empty pumpkin with a lack of intelligence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʌmpkɪnˌhɛdɪd/","syllables":"pump-kin-head-ed"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'pumpkin-headed' can be used literally to describe something with a head shaped like a pumpkin, but it is more often used figuratively as an insult to imply that someone is stupid or foolish. The literal meaning is less common and usually found in descriptive contexts, while the figurative meaning is more common in informal speech and writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is pumpkin-head.","correct":"✓ He is pumpkin-headed.","note":"The correct form is 'pumpkin-headed' (adjective). 'Pumpkin-head' can be used as a noun, but 'pumpkin-headed' is the more common adjectival form."},{"incorrect":"✗ She is a pumpkin-headed person with great intelligence.","correct":"✓ She is a person with great intelligence.","note":"Using 'pumpkin-headed' to describe someone with great intelligence is contradictory, as the term implies a lack of intelligence."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["gourd-headed","blockhead","thick-headed","boneheaded"],"priority":"★☆☆"},"level_frequency":{"CEFR":"(Not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pumpkin-headed' is a relatively uncommon compound adjective. It has both a literal and a figurative meaning. The literal meaning refers to a head that resembles a pumpkin in shape, which is rare. The figurative meaning is used as an insult to describe someone as stupid or unintelligent. Because of its dual meaning and potentially offensive nature, it is more likely to be encountered by advanced English learners.","priority":"★☆☆"},"example_sentences":[{"sentence":"The artist created a whimsical, pumpkin-headed character for the children's book.","translation":"そのアーティストは子供向けの本のために、風変わりなかぼちゃ頭のキャラクターを作った。","type":"adjective","meaning_category":"Large head"},{"sentence":"Stop being so pumpkin-headed and listen to my instructions!","translation":"そんなに頭が鈍いのはやめて、私の指示を聞きなさい！","type":"adjective","meaning_category":"Stupid"}]}