{"word":"system-managed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"システムによって管理される、システム管理の","english_definition":"Controlled or handled by a system, especially a computer system or automated process.","examples":[{"sentence":"The database uses system-managed storage to optimize performance.","translation":"そのデータベースは、パフォーマンスを最適化するためにシステム管理ストレージを使用しています。"},{"sentence":"These resources are system-managed and cannot be directly modified by the user.","translation":"これらのリソースはシステムによって管理されており、ユーザーが直接変更することはできません。"},{"sentence":"The system-managed backup process ensures data integrity.","translation":"システム管理のバックアッププロセスにより、データの整合性が確保されます。"}],"collocations":["system-managed storage","system-managed resources","system-managed process","system-managed memory","system-managed environment"],"synonyms":["automated","computer-controlled","automatically managed","self-managed (in some contexts)"],"antonyms":["user-managed","manually managed","human-controlled"]}],"etymology":{"value":"Derived from the combination of 'system' (a set of things working together as parts of a mechanism or an interconnecting network) and 'managed' (controlled or directed), indicating that the control and direction are provided by a system.","priority":"N/A"},"pronunciation":{"ipa":"/ˈsɪstəm ˈmænɪdʒd/","syllables":"sys-tem-man-aged"},"inflection":{"notes":"Adjective; no specific inflectional forms."},"usage_notes":{"explanation":"'System-managed' generally refers to processes, resources, or configurations that are automatically handled by a computer system or software, rather than requiring manual intervention. It implies a level of automation and efficiency in the management of these elements. The term is commonly used in technical contexts, such as database management, operating systems, and cloud computing.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The system is manage by itself.","correct":"✓ The system is system-managed. / ✓ The system manages itself.","note":"'System-managed' is an adjective describing the system. The verb 'manage' requires an agent. If the system is doing the managing, use 'The system manages itself.'"},{"incorrect":"✗ The system-manage process.","correct":"✓ The system-managed process.","note":"'System-managed' is an adjective, so it must be written with the '-ed' ending to correctly modify the noun 'process'."}],"priority":"N/A"},"related_words":{"derivatives":["system (noun)","manage (verb)","management (noun)","self-managed (adjective)"],"phrasal_verbs":["N/A"]},"level_frequency":{"CEFR":"C1 (Technical context)","frequency_google_ngram":"Low frequency (Technical term)","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'System-managed' is a technical term used to describe something that is automatically controlled or handled by a computer system or software. It implies that the management of a particular process, resource, or configuration is automated and does not require manual intervention. This term is commonly found in documentation related to computer systems, databases, and cloud computing. Understanding this term requires familiarity with technical concepts related to system administration and automation."},"example_sentences":[{"sentence":"The cloud platform offers system-managed scaling to handle fluctuating workloads.","translation":"クラウドプラットフォームは、変動するワークロードに対応するために、システム管理のスケーリングを提供します。","type":"adjective","meaning_category":"システム管理の"},{"sentence":"System-managed keys provide enhanced security for sensitive data.","translation":"システム管理のキーは、機密データのセキュリティを強化します。","type":"adjective","meaning_category":"システム管理の"},{"sentence":"The operating system provides system-managed virtual memory.","translation":"そのオペレーティングシステムは、システム管理の仮想メモリを提供します。","type":"adjective","meaning_category":"システム管理の"}]}