{"word":"unpatriarchally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"非家父長制的に、家父長制に反対して","english_definition":"In a manner that is not patriarchal; in opposition to or rejecting patriarchal principles.","examples":[{"sentence":"The organization aims to operate unpatriarchally, with shared leadership and decision-making.","translation":"その組織は、リーダーシップと意思決定を共有し、非家父長制的に運営することを目指しています。"},{"sentence":"She approached the project unpatriarchally, seeking input from all team members regardless of their position.","translation":"彼女は、役職に関係なくチームメンバー全員から意見を求め、そのプロジェクトに非家父長制的に取り組みました。"}],"collocations":["act unpatriarchally","organize unpatriarchally","lead unpatriarchally"],"synonyms":["egalitarianly","non-hierarchically","democratically","inclusively"],"antonyms":["patriarchally","hierarchically","authoritarianly"]}],"etymology":{"value":"Derived from 'un-' (not), 'patriarchal' (relating to a system of society or government controlled by men), and '-ly' (forming an adverb).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnpeɪtriˈɑːrkəli/","syllables":"un-pa-tri-ar-chal-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Unpatriarchally' describes actions or methods that actively avoid or oppose traditional patriarchal structures. It suggests a commitment to equality and shared power. The word is often used in discussions about social justice, feminism, and organizational structures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She managed the company unpatriarchal.","correct":"✓ She managed the company unpatriarchally.","note":"'Unpatriarchal' is an adjective; the adverb form 'unpatriarchally' is needed to modify the verb 'managed'."}],"priority":"★★☆"},"related_words":{"derivatives":["unpatriarchal (adjective)","patriarchy (noun)","patriarchal (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unpatriarchally' is a complex word used to describe actions or systems that are not based on traditional male-dominated power structures. It implies a conscious effort to create a more equal and inclusive environment. This word is typically found in academic or specialized discussions about gender equality and social justice.","priority":"★☆☆"},"example_sentences":[{"sentence":"They restructured the organization to operate more unpatriarchally.","translation":"彼らは組織を再構築し、より非家父長制的に運営するようにしました。","type":"adverb","meaning_category":"manner"},{"sentence":"She spoke unpatriarchally about the need for equal representation in government.","translation":"彼女は政府における平等な代表の必要性について、家父長制に反対する立場で語った。","type":"adverb","meaning_category":"opposition"}]}