{"word":"un-enriched","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"濃縮されていない、強化されていない","english_definition":"Not having undergone enrichment; not having had something added to increase its value or quality.","examples":[{"sentence":"This is un-enriched flour, containing only the nutrients naturally present in the wheat.","translation":"これは未濃縮の小麦粉で、小麦に自然に含まれる栄養素のみを含んでいます。"},{"sentence":"The un-enriched uranium cannot be used directly in most nuclear reactors.","translation":"未濃縮ウランは、ほとんどの原子炉で直接使用することはできません。"}],"collocations":["un-enriched flour","un-enriched uranium"],"synonyms":["natural","unprocessed","unfortified"],"antonyms":["enriched","fortified","enhanced"]}],"etymology":{"value":"Prefix 'un-' (not) + 'enriched' (past participle of 'enrich', meaning to improve or enhance the quality of something).","priority":"medium"},"pronunciation":{"ipa":"/ˌʌnɪnˈrɪtʃt/","syllables":"un-en-riched"},"inflection":{"notes":"This is an adjective and does not have different forms other than comparative/superlative, which are rarely used."},"usage_notes":{"explanation":"'Un-enriched' typically refers to something that has not had its nutritional value or concentration of a substance increased through artificial means. It is often used in the context of food products (like flour) or nuclear materials (like uranium).","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"The un-enriched food was very tasty.","correct":"The un-enriched food was bland.","note":"Un-enriched foods often lack the enhanced flavors or nutrients of enriched foods, so they are usually not described as 'very tasty'."}],"priority":"medium"},"related_words":{"derivatives":["enrich (verb)","enrichment (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"B2","text":"The word 'un-enriched' means that something has not been improved or enhanced by adding something extra. It's often used to describe food or materials that are in their natural state without any added nutrients or substances. For example, 'un-enriched flour' is flour that hasn't had extra vitamins added to it. The prefix 'un-' indicates the opposite of 'enriched'."},"example_sentences":[{"sentence":"We chose un-enriched rice because we prefer its natural flavor.","translation":"自然な風味を好むので、未濃縮米を選びました。","type":"adjective","meaning_category":"Food"},{"sentence":"The reactor uses slightly un-enriched uranium as fuel.","translation":"その原子炉は、燃料としてわずかに未濃縮ウランを使用しています。","type":"adjective","meaning_category":"Nuclear Materials"}]}