{"word":"Diasper","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A rare mineral, an aluminum oxide hydroxide, AlO(OH). It occurs in orthorhombic crystals and is a component of bauxite and other aluminum-rich rocks.","english_definition":"A mineral consisting of hydrated aluminum oxide, AlO(OH), that occurs in thin, flattened crystals or foliated masses. It is a component of bauxite and other aluminum-rich rocks.","examples":[{"sentence":"The diasper crystals were small and colorless.","translation":"そのダイアスポアの結晶は小さく無色だった。"},{"sentence":"Diasper is an important ore of aluminum.","translation":"ダイアスポアはアルミニウムの重要な鉱石である。"}],"collocations":["diasper crystal","diasper ore","aluminum diasper"],"synonyms":["hydrated aluminum oxide"],"antonyms":[]}],"etymology":{"value":"From the Greek word 'diaspeirein' meaning 'to scatter', referring to its tendency to decrepitate (crackle and burst) when heated.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈæspər/","syllables":"Di-as-per"},"inflection":{"noun_plural":"Diaspers"},"usage_notes":{"explanation":"Diasper is primarily a geological term. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a diasper in my garden.","correct":"✓ I found a rock in my garden.","note":"Finding diasper in a typical garden is highly unlikely. It's a mineral found in specific geological formations."}],"priority":"★★☆"},"related_words":{"derivatives":["diasporite"],"related_minerals":["Bauxite","Gibbsite","Boehmite"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. Primarily a geological term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Diasper' is a technical term used in geology and mineralogy. It refers to a specific mineral composed of hydrated aluminum oxide. Due to its specialized nature, it is not part of common vocabulary and is typically encountered in scientific or technical contexts. Understanding requires familiarity with basic concepts in earth science.","priority":"★☆☆"},"example_sentences":[{"sentence":"The chemical formula of diasper is AlO(OH).","translation":"ダイアスポアの化学式はAlO(OH)です。","type":"technical","meaning_category":"mineral composition"},{"sentence":"Diasper is often found in association with other aluminum hydroxides.","translation":"ダイアスポアは他の水酸化アルミニウムと共に見つかることが多いです。","type":"geological","meaning_category":"occurrence"}]}