{"word":"Hicksite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヒックス派：19世紀にアメリカのクエーカー教徒の間で起こった分離運動の支持者。イライアス・ヒックスの教えに共鳴し、より自由主義的な神学、奴隷制度への反対、聖書のリテラルな解釈への抵抗を特徴とする。","english_definition":"A follower of the Hicksite movement, a 19th-century schism within the Religious Society of Friends (Quakers) in the United States. Hicksites adhered to the teachings of Elias Hicks, emphasizing a more liberal theology, opposition to slavery, and a resistance to literal interpretations of the Bible.","examples":[{"sentence":"The Hicksites were known for their strong stance against slavery.","translation":"ヒックス派は奴隷制度に対する強い姿勢で知られていた。"},{"sentence":"The Hicksite separation led to a division within the Quaker community.","translation":"ヒックス派の分離は、クエーカー教徒のコミュニティ内の分裂につながった。"}],"collocations":["Hicksite Quaker","Hicksite separation","Hicksite theology"],"synonyms":["Liberal Quaker"],"antonyms":["Orthodox Quaker"]},{"part_of_speech":"adjective","definition":"ヒックス派の：ヒックス派の教義または原則に関連する。","english_definition":"Relating to or characteristic of the Hicksites or their doctrines.","examples":[{"sentence":"Hicksite beliefs differed significantly from those of Orthodox Quakers.","translation":"ヒックス派の信念は、正統派クエーカー教徒の信念とは大きく異なっていた。"},{"sentence":"The Hicksite meeting house was a center of abolitionist activity.","translation":"ヒックス派の集会所は、奴隷制度廃止運動の中心地だった。"}],"collocations":["Hicksite beliefs","Hicksite meeting","Hicksite principles"],"synonyms":["Liberal Quaker"],"antonyms":["Orthodox Quaker"]}],"etymology":{"value":"Named after Elias Hicks (1748-1830), an American Quaker preacher whose liberal theological views led to the schism within the Religious Society of Friends.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhɪksaɪt/","syllables":"Hick-site"},"inflection":{"noun_plural":"Hicksites"},"usage_notes":{"explanation":"The term \"Hicksite\" specifically refers to the members of the faction that split from the main body of Quakers in the 19th century due to theological and social differences. The Hicksite-Orthodox split was a significant event in Quaker history.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Hicksite Quaker from the orthodox branch.","correct":"✓ He is a Hicksite Quaker.","note":"Hicksite and Orthodox are opposing branches; one cannot be both."}],"priority":"★★☆"},"related_words":{"derivatives":["Hicksism (the theological and social views of the Hicksites)"],"related_terms":["Quaker","Religious Society of Friends","Elias Hicks","Orthodox Quaker","Abolitionism","Theology"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency. A specialized term related to religious history.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Hicksite\" is a specialized historical term referring to a specific group within the Quaker religious movement. Understanding its meaning requires knowledge of 19th-century American religious history and the divisions within the Religious Society of Friends. The term is not commonly used outside of historical or religious contexts."},"example_sentences":[{"sentence":"The Hicksite Quakers emphasized the importance of inner light and individual conscience.","translation":"ヒックス派のクエーカー教徒は、内なる光と個人の良心の重要性を強調した。","type":"noun","meaning_category":"Quaker faction"},{"sentence":"Hicksite theology was considered more liberal than that of the Orthodox Quakers.","translation":"ヒックス派の神学は、正統派クエーカー教徒の神学よりも自由主義的であると考えられていた。","type":"adjective","meaning_category":"Relating to Hicksites"}]}