{"word":"unpath","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(道などを)取り消す、道をなくす、(比喩的に)進路を断つ","english_definition":"To remove a path; to make a pathless or trackless area; to figuratively remove a course or direction.","examples":[{"sentence":"The forest grew back quickly, unpathing the old logging trails.","translation":"森林はすぐに生い茂り、古い伐採路を消した。"},{"sentence":"The storm unpathed the beach, washing away all signs of the previous day's visitors.","translation":"嵐は海岸の道を消し去り、前日の訪問者の痕跡をすべて洗い流した。"},{"sentence":"His decision to quit his job unpathed his career, leaving him unsure of what to do next.","translation":"彼が仕事を辞める決断をしたことで、彼のキャリアの道は断たれ、次に何をすべきかわからなくなった。"}],"collocations":["unpath a trail","unpath a career","unpath a route"],"synonyms":["obliterate","erase","remove","block","disrupt"],"antonyms":["create","establish","develop","pave","construct"]},{"part_of_speech":"adjective","definition":"道のない、踏み荒らされていない、人跡未踏の","english_definition":"Without a path; not traversed or explored; trackless.","examples":[{"sentence":"They ventured into the unpath forest, where few had dared to tread.","translation":"彼らはほとんど人が足を踏み入れたことのない、道のない森に足を踏み入れた。"},{"sentence":"The unpath wilderness offered a sense of solitude and adventure.","translation":"道のない荒野は、孤独と冒険の感覚を与えてくれた。"}],"collocations":["unpath forest","unpath wilderness","unpath territory"],"synonyms":["trackless","untrodden","unexplored","pathless","remote"],"antonyms":["traversed","explored","pathed","well-trodden"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not' or 'opposite of') to the word 'path'.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈpæθ/","syllables":"un-path"},"inflection":{"verb_forms":{"present_simple":["unpath","unpaths"],"past_simple":"unpathed","past_participle":"unpathed","present_participle":"unpathing"},"adjective_forms":{}},"usage_notes":{"explanation":"'Unpath' is a relatively rare word. As a verb, it suggests the act of removing or obliterating a path, either literally or figuratively. As an adjective, it describes something that lacks a path or has not been traversed. It often evokes a sense of wilderness, unexplored territory, or a disrupted course.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unpathed road was easy to follow.","correct":"✓ The unpathed area was difficult to traverse.","note":"'Unpath' implies the absence of a path, so an 'unpathed road' is contradictory. Use it to describe areas without paths."},{"incorrect":"✗ He unpathed his way through the crowd.","correct":"✓ He made his way through the crowd.","note":"'Unpath' is not typically used to describe movement through a crowd. Use phrases like 'made his way' or 'pushed through' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["path (noun)","pathless (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unpath' is a relatively uncommon word, primarily used in descriptive or literary contexts to convey the absence of a path or the act of removing one. Understanding the prefix 'un-' and the base word 'path' is key to grasping its meaning. It's more likely to be encountered in advanced reading materials or creative writing.","priority":"★★☆"},"example_sentences":[{"sentence":"The dense vegetation quickly unpathed the hiking trail after years of neglect.","translation":"手入れを何年も怠った結果、密生した植生がハイキングコースをすぐに消してしまった。","type":"verb","meaning_category":"取り消す（道）"},{"sentence":"They explored the unpath regions of the Amazon rainforest.","translation":"彼らはアマゾンの熱帯雨林の道のない地域を探検した。","type":"adjective","meaning_category":"道のない"},{"sentence":"The floodwaters unpathed the riverbank, leaving behind a barren landscape.","translation":"洪水は川岸の道を消し去り、不毛な風景を残した。","type":"verb","meaning_category":"取り消す（道）"},{"sentence":"The unpath terrain made the journey challenging and unpredictable.","translation":"道のない地形は、旅を困難で予測不可能にした。","type":"adjective","meaning_category":"道のない"}]}