{"word":"unfrothed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"泡立てられていない、泡立っていない","english_definition":"Not frothed; not having been made frothy or foamy.","examples":[{"sentence":"She preferred her milk unfrothed in her coffee.","translation":"彼女はコーヒーに泡立てていないミルクを入れるのが好きだった。"},{"sentence":"The unfrothed egg whites were added to the mixture.","translation":"泡立てられていない卵白が混合物に加えられた。"}],"collocations":["unfrothed milk","unfrothed egg whites"],"synonyms":["flat","unfoamy","unbubbly"],"antonyms":["frothed","foamy","bubbly"]}],"etymology":{"value":"Derived from the verb 'froth' (to produce or cause to produce a mass of small bubbles) with the prefix 'un-' (not).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈfrɒθt/","syllables":"un-frothed"},"inflection":{"notes":"This is the past participle of 'unfroth', used as an adjective. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Unfrothed' is primarily used to describe liquids or mixtures that have not undergone the process of frothing, which involves creating a light, airy, and bubbly texture. It is often used in culinary contexts to specify that an ingredient has not been whipped or aerated.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unfrothed coffee was very creamy.","correct":"✓ The unfoamed coffee was very creamy.","note":"'Unfrothed' specifically refers to the absence of froth, while 'creamy' describes texture. While unfrothed milk can contribute to creaminess, the terms are not interchangeable."}],"priority":"★★☆"},"related_words":{"derivatives":["froth (noun, verb)","frothy (adjective)","unfroth (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unfrothed' is a relatively uncommon word, primarily used in culinary or technical contexts to describe something that has not been made foamy or bubbly. Understanding its meaning requires familiarity with the word 'froth' and the prefix 'un-'. It is not typically encountered in everyday conversation."},"example_sentences":[{"sentence":"The barista served the latte with unfrothed milk, as requested.","translation":"バリスタはリクエスト通り、泡立てていないミルクでラテを提供した。","type":"adjective","meaning_category":"not frothed"},{"sentence":"She added unfrothed cream to her dessert for a richer flavor.","translation":"彼女はより濃厚な風味を出すために、泡立てていないクリームをデザートに加えた。","type":"adjective","meaning_category":"not frothed"}]}