{"word":"resort-loving","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"リゾート地を愛する、リゾート地が好きでたまらない","english_definition":"Having a strong fondness for or enjoyment of resorts.","examples":[{"sentence":"She's a resort-loving traveler who always seeks out the best beaches.","translation":"彼女はリゾート地を愛する旅行者で、いつも最高のビーチを探し求めている。"},{"sentence":"They are resort-loving families who enjoy spending their vacations in luxurious hotels.","translation":"彼らはリゾート地を愛する家族で、豪華なホテルで休暇を過ごすのを楽しんでいる。"},{"sentence":"As a resort-loving person, he always looks for destinations with excellent amenities.","translation":"リゾート地を愛する人として、彼は常に優れたアメニティを備えた目的地を探している。"}],"collocations":["resort-loving traveler","resort-loving family","resort-loving person"],"synonyms":["resort enthusiast","resort aficionado","resort devotee"],"antonyms":["resort-hating","resort-averse","anti-resort"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"resort\" (a place providing recreation and entertainment especially to vacationers) with \"loving\" (feeling or showing love and great care).","priority":"N/A"},"pronunciation":{"ipa":"/rɪˈzɔːrt ˈlʌvɪŋ/","syllables":"re-sort-lov-ing"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Resort-loving\" is a descriptive adjective often used to characterize individuals or groups who have a particular fondness for vacationing in resorts. It implies a preference for the amenities, relaxation, and recreational activities typically associated with resort destinations.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a resort loving.","correct":"✓ He is resort-loving.","note":"The hyphen is important to connect the two words into a single adjective. Also, 'loving' should not be used as a noun in this context."},{"incorrect":"✗ They are resort love people.","correct":"✓ They are resort-loving people.","note":"The correct form is 'resort-loving' as a compound adjective modifying 'people'."}],"priority":"N/A"},"related_words":{"derivatives":["resort (noun)","loving (adjective)"],"phrasal_verbs":[],"related_adjectives":["beach-loving","travel-loving","sun-loving"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. This is not a common word, but its meaning is easily understood.","priority":"N/A"},"readability_explanation":{"level":"B1","text":"The word \"resort-loving\" is easy to understand if you know the words \"resort\" and \"loving.\" A \"resort\" is a place where people go to relax and have fun on vacation. \"Loving\" means liking something very much. So, \"resort-loving\" describes someone who really likes going to resorts for vacations."},"example_sentences":[{"sentence":"The resort-loving couple booked a suite with an ocean view.","translation":"そのリゾート地を愛するカップルは、オーシャンビューのスイートを予約した。","type":"adjective","meaning_category":"fondness for resorts"},{"sentence":"Many resort-loving tourists visit the island every year.","translation":"多くのリゾート地を愛する観光客が毎年その島を訪れる。","type":"adjective","meaning_category":"fondness for resorts"},{"sentence":"She described herself as a resort-loving individual who enjoys spa treatments and fine dining.","translation":"彼女は自身を、スパトリートメントや高級料理を楽しむリゾート地を愛する人だと表現した。","type":"adjective","meaning_category":"fondness for resorts"}]}