{"word":"push-down","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(計算機科学で)プッシュダウン式の、後入れ先出し式の","english_definition":"(computer science) relating to a system that stores information in a way that the most recently added item is the first one retrieved.","examples":[{"sentence":"a push-down automaton","translation":"プッシュダウンオートマトン"}],"collocations":[],"synonyms":["LIFO (last-in, first-out)"],"antonyms":["FIFO (first-in, first-out)"]},{"part_of_speech":"noun","definition":"(計算機科学で)プッシュダウン方式","english_definition":"(computer science) A method of storing and retrieving data in which the last item stored is the first one retrieved.","examples":[{"sentence":"The compiler uses a push-down stack to manage function calls.","translation":"コンパイラはプッシュダウンスタックを使って関数呼び出しを管理する。"}],"collocations":[],"synonyms":["LIFO (last-in, first-out)"],"antonyms":["FIFO (first-in, first-out)"]}],"etymology":{"value":"The term 'push-down' is derived from the action of pushing data onto a stack, where the last item pushed down is the first one that can be retrieved.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpʊʃˌdaʊn/","syllables":"push-down"},"inflection":{},"usage_notes":{"explanation":"In computer science, 'push-down' refers to a data structure or system that operates on a last-in, first-out (LIFO) principle. This means that the most recently added item is the first one to be retrieved. The term is commonly used in the context of push-down automata, which are a type of automaton that uses a stack to store information.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["pushdown automaton","pushdown stack"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Push-down' is a technical term primarily used in computer science, specifically in the context of data structures and automata theory. It describes a system where the last item added is the first one retrieved, similar to a stack of plates where you take the top one first. This concept is fundamental to understanding how certain types of algorithms and computer systems manage data.","priority":"★★★"},"example_sentences":[{"sentence":"The algorithm uses a push-down stack to keep track of function calls.","translation":"そのアルゴリズムは、関数呼び出しを追跡するためにプッシュダウンスタックを使用します。","type":"noun","meaning_category":"計算機科学"},{"sentence":"A push-down automaton is more powerful than a finite automaton.","translation":"プッシュダウンオートマトンは、有限オートマトンよりも強力です。","type":"adjective","meaning_category":"計算機科学"}]}