{"word":"gyrodyne","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ジャイロダイン：回転翼機の一種で、ローターは主に離着陸時に使用し、水平飛行時にはプロペラやジェットエンジンによって推進力を得るもの","english_definition":"A type of rotorcraft that uses a rotor for vertical takeoff and landing, but uses propellers or jet engines for forward propulsion in horizontal flight.","examples":[{"sentence":"The gyrodyne combines the vertical lift capabilities of a helicopter with the forward speed of a fixed-wing aircraft.","translation":"ジャイロダインは、ヘリコプターの垂直離着陸能力と固定翼機の水平飛行速度を兼ね備えています。"},{"sentence":"Early gyrodyne designs faced challenges in terms of complexity and efficiency.","translation":"初期のジャイロダイン設計は、複雑さと効率の面で課題に直面しました。"}],"collocations":["compound gyrodyne","experimental gyrodyne","gyrodyne aircraft"],"synonyms":["rotorcraft","compound helicopter"],"antonyms":[]}],"etymology":{"value":"「gyro-」（回転）と「-dyne」（力）の組み合わせ。ヘリコプターのように回転翼で揚力を得るが、推進力は別の機構で得ることから。","priority":"★★☆"},"pronunciation":{"ipa":"ˈdʒaɪrəˌdaɪn","syllables":"gy-ro-dyne"},"inflection":{"noun_plural":"gyrodynes"},"usage_notes":{"explanation":"ジャイロダインは、ヘリコプターと固定翼機のハイブリッドのような航空機です。垂直離着陸にはヘリコプターのようにローターを使用しますが、前進するためにはプロペラやジェットエンジンを使います。この設計により、ヘリコプターよりも高速で効率的な飛行が可能になります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gyrodyne is a type of helicopter with fixed wings.","correct":"✓ The gyrodyne is a type of rotorcraft that uses a rotor for lift and propellers for forward thrust.","note":"ジャイロダインは固定翼を持ちませんが、ローターで揚力を得て、プロペラで推進力を得ます。"},{"incorrect":"✗ Gyrodynes are commonly used in commercial aviation.","correct":"✓ Gyrodynes are not as commonly used as helicopters or fixed-wing aircraft.","note":"ジャイロダインは、ヘリコプターや固定翼機ほど一般的ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["autogyro","helicopter","rotorcraft"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な航空用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**gyrodyne**」は、航空工学の専門用語で、ローターを使って垂直離着陸を行い、プロペラやジェットエンジンで水平飛行を行う航空機を指します。ヘリコプターと固定翼機の特性を組み合わせたもので、一般的な単語ではありません。航空や工学分野の文脈で登場する可能性があります。"},"example_sentences":[{"sentence":"The **gyrodyne** achieved a higher forward speed compared to traditional helicopters.","translation":"そのジャイロダインは、従来のヘリコプターと比較してより高い前進速度を達成しました。","type":"noun","meaning_category":"航空機"},{"sentence":"Engineers are exploring new designs for **gyrodynes** to improve their efficiency.","translation":"エンジニアたちは、効率を向上させるためにジャイロダインの新しい設計を研究しています。","type":"noun","meaning_category":"航空機"}]}