{"word":"Samoyed","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"サモエド (犬種)","english_definition":"a breed of dog with a thick, white coat, originally bred in Siberia.","examples":[{"sentence":"The Samoyed is known for its friendly and gentle temperament.","translation":"サモエドはその友好的で穏やかな気質で知られています。"},{"sentence":"She adopted a Samoyed puppy from the local animal shelter.","translation":"彼女は地元の動物保護施設からサモエドの子犬を引き取りました。"}],"collocations":["Samoyed dog","Samoyed puppy","white Samoyed","Samoyed breed"],"synonyms":["none (specific synonyms for a dog breed)"],"antonyms":["none (antonyms are not applicable for dog breeds)"]},{"part_of_speech":"noun","definition":"サモエド人 (民族)","english_definition":"a member of an indigenous group of people inhabiting northern Russia and Siberia.","examples":[{"sentence":"The Samoyed people traditionally herded reindeer.","translation":"サモエド人は伝統的にトナカイを飼育していました。"},{"sentence":"Samoyed languages belong to the Uralic language family.","translation":"サモエド諸語はウラル語族に属します。"}],"collocations":["Samoyed language","Samoyed culture","Samoyedic peoples"],"synonyms":["none (specific synonyms for an ethnic group)"],"antonyms":["none (antonyms are not applicable for ethnic groups)"]},{"part_of_speech":"adjective","definition":"サモエドの、サモエド人(族)の、サモエド語の","english_definition":"relating to the Samoyed people, their languages, or their culture.","examples":[{"sentence":"Samoyed culture is rich in folklore and traditions.","translation":"サモエドの文化は民話や伝統が豊かです。"},{"sentence":"He is studying Samoyed languages at the university.","translation":"彼は大学でサモエド語を研究しています。"}],"collocations":["Samoyed language","Samoyed culture","Samoyed people"],"synonyms":["Samoyedic"],"antonyms":["none (antonyms are not applicable for ethnic groups)"]}],"etymology":{"value":"Named after the Samoyedic peoples of Siberia, who originally bred the dog.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsæməjɛd/","syllables":"Sa-mo-yed"},"inflection":{"noun_plural":"Samoyeds"},"usage_notes":{"explanation":"The term \"Samoyed\" can refer to three related but distinct concepts: a breed of dog, an ethnic group of people, and the languages spoken by that group. Context is important to determine which meaning is intended. When referring to the dog, it is often capitalized. When referring to the people or their language, it can be capitalized or not, but is often capitalized when referring to the ethnic group specifically.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a samoyed running in the park.","correct":"✓ I saw a Samoyed running in the park.","note":"When referring to the dog breed, capitalize the first letter. When referring to the people, it may or may not be capitalized, but is often capitalized for the ethnic group specifically."}],"priority":"★★☆"},"related_words":{"derivatives":["Samoyedic (adjective, noun)"],"phrasal_verbs":["none"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in contexts related to dog breeds or Siberian cultures.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"Samoyed\" refers to a specific dog breed, an ethnic group in Siberia, and related languages. Understanding which meaning is intended depends on the context. It's important to note the capitalization when referring to the dog breed. The word is not commonly used in everyday conversation but appears in specialized contexts related to dogs or Siberian cultures."},"example_sentences":[{"sentence":"The fluffy white **Samoyed** bounded through the snow.","translation":"ふわふわの白いサモエドが雪の中を跳ね回った。","type":"noun","meaning_category":"犬種"},{"sentence":"The **Samoyed** people have a rich cultural heritage.","translation":"サモエド人は豊かな文化遺産を持っています。","type":"noun","meaning_category":"民族"},{"sentence":"He is studying the **Samoyed** language.","translation":"彼はサモエド語を研究しています。","type":"adjective","meaning_category":"言語"}]}