{"word":"intercomparison","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"相互比較、機関間比較","english_definition":"A comparison of measurements or results obtained by different instruments, methods, or laboratories, typically for the purpose of quality control or standardization.","examples":[{"sentence":"The intercomparison exercise revealed significant discrepancies between the laboratories.","translation":"その機関間比較演習は、研究所間で重大な食い違いがあることを明らかにした。"},{"sentence":"An intercomparison of satellite data with ground-based measurements is essential for validating climate models.","translation":"気候モデルを検証するためには、衛星データと地上測定値との相互比較が不可欠である。"},{"sentence":"The study involved an intercomparison of different analytical techniques.","translation":"その研究では、さまざまな分析手法の相互比較が行われた。"}],"collocations":["intercomparison exercise","intercomparison study","intercomparison program","intercomparison of data","intercomparison results","laboratory intercomparison"],"synonyms":["comparison","cross-validation","benchmarking","correlation"],"antonyms":[]}],"etymology":{"value":"\"Inter-\" (between, among) + \"comparison\" (the act of comparing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərkəmˈpærɪsən/","syllables":"in-ter-com-par-i-son"},"inflection":{"noun_plural":"intercomparisons"},"usage_notes":{"explanation":"\"Intercomparison\" refers to the process of comparing results or measurements obtained by different entities (instruments, methods, laboratories, etc.). It is often used in scientific and technical contexts to assess the accuracy, reliability, and consistency of data. The goal is to identify and correct any systematic errors or biases.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intercomparison was between the data.","correct":"✓ The intercomparison was of the data.","note":"Use \"intercomparison of\" to indicate what is being compared."},{"incorrect":"✗ We did an intercompare.","correct":"✓ We did an intercomparison.","note":"\"Intercomparison\" is a noun. \"Intercompare\" is not a standard English word."}],"priority":"★★☆"},"related_words":{"derivatives":["compare","comparison"],"phrases":["cross-validation","benchmarking"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, used in specialized fields.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"intercomparison\" is a technical term used to describe the process of comparing measurements or results from different sources to ensure consistency and accuracy. It's commonly used in scientific, engineering, and quality control contexts. Understanding this word is helpful for interpreting technical reports and research papers in these fields."},"example_sentences":[{"sentence":"The **intercomparison** of the instruments showed that one was consistently underreporting the concentration.","translation":"機器の相互比較により、1つが一貫して濃度を過小報告していることがわかった。","type":"noun","meaning_category":"相互比較"},{"sentence":"An international **intercomparison** program was established to improve the accuracy of ozone measurements.","translation":"オゾン測定の精度を向上させるために、国際的な機関間比較プログラムが設立された。","type":"noun","meaning_category":"機関間比較"},{"sentence":"The results of the **intercomparison** will be published in a peer-reviewed journal.","translation":"相互比較の結果は、査読付きジャーナルに掲載される予定である。","type":"noun","meaning_category":"相互比較"}]}