{"word":"physostomous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(魚類が)浮き袋と消化管が繋がっている","english_definition":"(of fishes) having an open duct (the pneumatic duct) connecting the swim bladder and the alimentary canal.","examples":[{"sentence":"Physostomous fishes can regulate the amount of gas in their swim bladder by gulping air at the surface or releasing it through the pneumatic duct.","translation":"有管鰾の魚類は、水面で空気を飲み込んだり、気道を通じて空気を放出したりすることで、浮き袋内のガス量を調節できます。"}],"collocations":["physostomous fish","physostomous swim bladder"],"synonyms":["open swim bladder"],"antonyms":["physoclistous"],"notes":"The opposite of physostomous is physoclistous, where the swim bladder is closed and gas exchange occurs through the blood."}],"etymology":{"value":"From Greek 'physa' (bladder) + 'stoma' (mouth).","priority":"★★☆"},"pronunciation":{"ipa":"/faɪˈsɒstəməs/","syllables":"phy-so-sto-mous"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms (more physostomous, most physostomous), but these are rarely used."},"usage_notes":{"explanation":"'Physostomous' is a technical term used in ichthyology (the study of fish) to describe a specific anatomical feature related to the swim bladder. It is primarily used in scientific contexts.","priority":"★★☆"},"related_words":{"derivatives":["Physostomi (obsolete taxonomic grouping of physostomous fishes)"],"related_terms":["swim bladder","pneumatic duct","physoclistous"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Physostomous' is a highly specialized term used in zoology, specifically when describing the anatomy of fish. Understanding this term requires familiarity with fish anatomy and physiology. It is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"The goldfish is a classic example of a physostomous fish.","translation":"金魚は有管鰾の魚の典型的な例です。","type":"example","meaning_category":"example"},{"sentence":"The presence of a pneumatic duct is a key characteristic of physostomous fish.","translation":"気道の存在は、有管鰾の魚の重要な特徴です。","type":"characteristic","meaning_category":"characteristic"}]}