{"word":"mercenariness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"金銭至上主義、拝金主義、打算性","english_definition":"The state or quality of being primarily concerned with making money at the expense of ethics or other values.","examples":[{"sentence":"His actions were driven by pure mercenariness.","translation":"彼の行動は純粋な金銭至上主義に突き動かされていた。"},{"sentence":"The mercenariness of the company's policies was widely criticized.","translation":"その会社の政策の拝金主義は広く批判された。"},{"sentence":"She accused him of mercenariness in his business dealings.","translation":"彼女は彼の商取引における打算性を非難した。"}],"collocations":["pure mercenariness (純粋な金銭至上主義)","sheer mercenariness (全くの金銭至上主義)","driven by mercenariness (金銭至上主義に突き動かされる)"],"synonyms":["greed","avarice","cupidity","materialism","venality","opportunism"],"antonyms":["altruism","generosity","selflessness","philanthropy"]}],"etymology":{"value":"Derived from 'mercenary,' which comes from the Latin 'mercenarius,' meaning 'working for pay, hired.' The suffix '-ness' is added to form the noun, indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɜːrsəˈnerinəs/","syllables":"mer-ce-nar-i-ness"},"inflection":{"noun_form":"uncountable"},"usage_notes":{"explanation":"'Mercenariness' describes a strong focus on financial gain, often implying a willingness to compromise moral principles or exploit others for profit. It is typically used in a negative context to criticize someone's behavior or motivations. The term suggests that financial considerations are prioritized above all else, even at the expense of ethical considerations or the well-being of others.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a great mercenariness to help others.","correct":"✓ He showed a great generosity to help others.","note":"'Mercenariness' has a negative connotation, indicating selfishness and greed. Use 'generosity' or 'altruism' to describe helping others. "},{"incorrect":"✗ The mercenariness is not good for society.","correct":"✓ Mercenariness is not good for society.","note":"'Mercenariness' is an uncountable noun, so it doesn't take an article ('a' or 'the') when referring to the general concept."}],"priority":"★★☆"},"related_words":{"derivatives":["mercenary (adjective, noun)","mercenarily (adverb)"],"phrases":["a mercenary attitude","a mercenary approach","a mercenary motive"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mercenariness' is a complex term that describes a state of being driven by the desire for financial gain, often at the expense of ethics or other values. It implies a negative judgment about someone's motivations, suggesting they prioritize money above all else. Understanding this word requires a good grasp of abstract concepts and nuanced vocabulary. It is not a commonly used word, so it is more likely to be encountered in formal writing or discussions about ethics and business.","priority":"★★☆"},"example_sentences":[{"sentence":"The film portrays the ruthless mercenariness of the corporate world.","translation":"その映画は企業社会の無慈悲な金銭至上主義を描いている。","type":"general","meaning_category":"金銭至上主義"},{"sentence":"Critics condemned the politician's blatant mercenariness.","translation":"評論家たちはその政治家の露骨な拝金主義を非難した。","type":"general","meaning_category":"拝金主義"},{"sentence":"The artist refused to compromise his vision for the sake of mercenariness.","translation":"その芸術家は金銭至上主義のために自分のビジョンを妥協することを拒否した。","type":"general","meaning_category":"打算性"}]}