{"word":"Lockdown-era","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ロックダウン時代（ロックダウン期間中）の、ロックダウン時代特有の","english_definition":"Relating to or characteristic of the period of lockdowns, especially those imposed during a pandemic (such as the COVID-19 pandemic).","examples":[{"sentence":"The lockdown-era saw a surge in online shopping.","translation":"ロックダウン時代には、オンラインショッピングが急増した。"},{"sentence":"Many people developed new hobbies during the lockdown-era.","translation":"多くの人々がロックダウン時代に新しい趣味を始めた。"},{"sentence":"Lockdown-era restrictions had a significant impact on the economy.","translation":"ロックダウン時代の規制は経済に大きな影響を与えた。"}],"collocations":["lockdown-era trends","lockdown-era challenges","lockdown-era habits","lockdown-era policies"],"synonyms":["pandemic-era","quarantine-era"],"antonyms":["post-pandemic","pre-lockdown"]},{"part_of_speech":"noun","definition":"ロックダウン時代","english_definition":"The period of time characterized by widespread lockdowns, often in response to a pandemic.","examples":[{"sentence":"The lockdown-era is remembered for its social isolation.","translation":"ロックダウン時代は、社会的孤立が特徴的だったと記憶されている。"},{"sentence":"Many businesses struggled to survive the lockdown-era.","translation":"多くの企業がロックダウン時代を生き残るのに苦労した。"}],"collocations":["during the lockdown-era","the end of the lockdown-era","life in the lockdown-era"],"synonyms":["pandemic period","quarantine time"],"antonyms":["post-lockdown period","pre-lockdown days"]}],"etymology":{"value":"A compound word formed by combining \"lockdown\" (referring to a state of confinement or restricted movement) and \"era\" (referring to a period of time). It gained prominence during the COVID-19 pandemic when lockdowns were widely implemented.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɒkdaʊn ˈɪərə/","syllables":"lock-down-e-ra"},"inflection":{"notes":"As a compound word, its inflection follows standard English rules. The plural form (when used as a noun) is \"lockdown-eras\"."},"usage_notes":{"explanation":"\"Lockdown-era\" is primarily used to describe events, trends, or characteristics specific to the period when lockdowns were prevalent, particularly during the COVID-19 pandemic. It often implies a sense of disruption, adaptation, and unique social or economic conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ the lock down era","correct":"✓ the lockdown-era","note":"It's important to use the hyphen to correctly form the compound adjective/noun."},{"incorrect":"✗ lockdown era's","correct":"✓ lockdown-era","note":"When used as an adjective, it doesn't take an apostrophe to show possession."}],"priority":"★★☆"},"related_words":{"derivatives":["lockdown","era"],"phrasal_verbs":[],"related_terms":["pandemic","quarantine","social distancing","remote work","telecommuting"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specific to recent events)","frequency_google_ngram":"Relatively low frequency, but increasing during and after the COVID-19 pandemic.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"lockdown-era\" refers to a specific period of time when lockdowns were common, especially during the COVID-19 pandemic. It's used to describe things that happened or were typical during that time. Understanding the term requires knowledge of the context of widespread lockdowns and their effects on society. It is commonly used in news articles, academic papers, and discussions about the pandemic's impact.","priority":"★★☆"},"example_sentences":[{"sentence":"The lockdown-era saw a dramatic shift towards remote work.","translation":"ロックダウン時代には、リモートワークへの劇的な移行が見られた。","type":"adjective","meaning_category":"Describing a trend during lockdowns"},{"sentence":"Many small businesses struggled to survive during the lockdown-era.","translation":"多くの小規模企業がロックダウン時代を生き残るのに苦労した。","type":"noun","meaning_category":"Referring to the period of lockdowns"},{"sentence":"Lockdown-era innovations included new forms of online entertainment.","translation":"ロックダウン時代の革新には、新しい形態のオンラインエンターテイメントが含まれていた。","type":"adjective","meaning_category":"Describing innovations during lockdowns"}]}