{"word":"five-act","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"5幕構成の","english_definition":"Consisting of five acts, especially referring to a play.","examples":[{"sentence":"Shakespeare's Hamlet is a famous five-act tragedy.","translation":"シェイクスピアのハムレットは有名な5幕構成の悲劇です。"},{"sentence":"Many classical dramas follow a five-act structure.","translation":"多くの古典劇は5幕構成に従っています。"}],"collocations":["five-act play","five-act structure","five-act drama"],"synonyms":["multi-act"],"antonyms":["one-act"],"notes":"Typically refers to a dramatic work, such as a play or opera, divided into five distinct acts. Often associated with classical or traditional dramatic structure.","related_terms":["act","play","drama","tragedy","comedy"]}],"etymology":{"value":"Combination of 'five' and 'act', indicating the number of acts in a play or other dramatic work.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfaɪv ækt/","syllables":"five-act"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'five-act' is specifically used to describe plays or dramas that are divided into five acts. This structure was common in classical and Shakespearean plays. The five acts typically follow a pattern: exposition, rising action, climax, falling action, and resolution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was five-act long.","correct":"✓ The movie was five acts long.","note":"'Five-act' describes the structure of the play, not the length.  To describe the length, use 'five acts long'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'five-act' is a specialized term used in the context of dramatic literature. It refers to plays or dramas that are structured into five distinct acts, each contributing to the overall narrative arc. Understanding this term requires familiarity with basic dramatic terminology and classical play structures."},"example_sentences":[{"sentence":"The director chose to stage the play in its original five-act format.","translation":"監督は、その劇をオリジナルの5幕構成で上演することを選びました。","type":"general","meaning_category":"general usage"},{"sentence":"The five-act structure allows for a detailed exploration of the characters' motivations.","translation":"5幕構成は、登場人物の動機を詳細に探求することを可能にします。","type":"general","meaning_category":"general usage"}]}