{"word":"treason-haunted","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"反逆の疑念に取り憑かれた、裏切りに悩まされた","english_definition":"Haunted or troubled by the suspicion or fear of treason or betrayal.","examples":[{"sentence":"The king lived in a treason-haunted court, constantly fearing conspiracies against his rule.","translation":"王は反逆の疑念に取り憑かれた宮廷で暮らし、常に自身の支配に対する陰謀を恐れていた。"},{"sentence":"The general's treason-haunted mind made him distrust every member of his staff.","translation":"将軍の裏切りに悩まされた心は、彼にスタッフ全員を疑わせた。"}],"collocations":["treason-haunted court (反逆の疑念に取り憑かれた宮廷)","treason-haunted mind (裏切りに悩まされた心)","treason-haunted atmosphere (反逆の疑念に満ちた雰囲気)"],"synonyms":["suspicious","distrustful","paranoid","betrayal-ridden"],"antonyms":["trusting","confident","secure","loyal"]},{"part_of_speech":"adjective","definition":"反逆の歴史や記憶に悩まされた","english_definition":"Characterized by a history or memory of treason, leading to a sense of unease or fear.","examples":[{"sentence":"The castle, treason-haunted for centuries, held many dark secrets within its walls.","translation":"その城は何世紀にもわたって反逆の歴史に悩まされ、その壁の中に多くの暗い秘密を抱えていた。"},{"sentence":"The region remained treason-haunted long after the rebellion was crushed.","translation":"その地域は反乱が鎮圧された後も、長い間反逆の記憶に悩まされた。"}],"collocations":["treason-haunted castle (反逆の歴史に悩まされた城)","treason-haunted region (反逆の記憶に悩まされた地域)","treason-haunted past (反逆の歴史)"],"synonyms":["ill-fated","doomed","cursed","tainted"],"antonyms":["blessed","fortunate","auspicious"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"treason\" (the crime of betraying one's country, especially by attempting to overthrow the government) and \"haunted\" (persistently troubled or disturbed by memories, fears, or spirits). The combination suggests a state of being constantly troubled by the fear or presence of treason.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtriːzənˌhɔːntɪd/","syllables":"trea-son-haunt-ed"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations. It can be used in comparative and superlative forms (more treason-haunted, most treason-haunted), although this is rare."},"usage_notes":{"explanation":"\"Treason-haunted\" is a relatively uncommon and evocative adjective, often used in literary or historical contexts to describe a place, person, or atmosphere deeply affected by the fear or memory of treason. It suggests a pervasive sense of distrust, suspicion, and unease. The word is particularly effective in conveying a sense of paranoia or historical burden.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The treason-haunted event was a disaster.","correct":"✓ The treasonous event was a disaster.","note":"\"Treason-haunted\" describes a state of being troubled by treason, while \"treasonous\" describes an action or person that constitutes treason. Use \"treasonous\" to describe the event itself. "},{"incorrect":"✗ He was treason-haunted of his friends.","correct":"✓ He was treason-haunted by his friends' actions.","note":"The correct preposition to use with \"haunted\" in this context is \"by.\" Also, \"treason-haunted\" usually refers to a general sense of unease rather than a direct action by someone."}],"priority":"★★☆"},"related_words":{"derivatives":["treason (名詞: 反逆)","haunted (形容詞: 取り憑かれた)","treasonous (形容詞: 反逆的な)"],"phrases":["haunted by betrayal","plagued by suspicion"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (This word is not commonly found in CEFR vocabulary lists.)","frequency_google_ngram":"Low frequency - This is a relatively rare and specialized word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Treason-haunted\" is a complex adjective that combines the concept of \"treason\" (betrayal of one's country) with \"haunted\" (persistently troubled or disturbed). The word is used to describe a state or situation where the fear, suspicion, or memory of treason is a constant and unsettling presence. It suggests a deep-seated sense of distrust and paranoia, often in historical or political contexts. Understanding the individual components of the word is key to grasping its overall meaning."},"example_sentences":[{"sentence":"The old palace was treason-haunted, whispers of past conspiracies echoing through its halls.","translation":"その古い宮殿は反逆の疑念に取り憑かれており、過去の陰謀の囁きがそのホールに響き渡っていた。","type":"adjective","meaning_category":"反逆の疑念に取り憑かれた"},{"sentence":"His reign was treason-haunted, marked by constant plots and betrayals.","translation":"彼の治世は反逆の疑念に取り憑かれており、絶え間ない陰謀と裏切りによって特徴づけられていた。","type":"adjective","meaning_category":"反逆の疑念に取り憑かれた"},{"sentence":"The city, treason-haunted after the failed rebellion, remained under strict military control.","translation":"その都市は、失敗した反乱の後、反逆の記憶に悩まされ、厳重な軍事統制下に置かれた。","type":"adjective","meaning_category":"反逆の歴史や記憶に悩まされた"}]}