{"word":"smooth-fronted","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(動物学) 滑らかな額を持つ","english_definition":"(zoology) Having a smooth forehead, lacking prominent ridges or projections.","examples":[{"sentence":"The smooth-fronted caiman is smaller than the spectacled caiman.","translation":"ヘサキコビトカイマンはメガネカイマンよりも小さい。"},{"sentence":"This species is characterized by its smooth-fronted skull.","translation":"この種は、滑らかな額を持つ頭蓋骨によって特徴付けられる。"}],"collocations":["smooth-fronted caiman","smooth-fronted turtle"],"synonyms":["flat-fronted","unridged"],"antonyms":["ridged","rough-fronted"]}],"etymology":{"value":"Combination of 'smooth' and 'fronted', indicating a smooth forehead or frontal area.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsmuːθ ˈfrʌntɪd/","syllables":"smooth-front-ed"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"Primarily used in zoology to describe animals, particularly reptiles, that lack prominent ridges or projections on their forehead. It is a descriptive term used to differentiate species.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The smooth-fronted car.","correct":"The car has a smooth front.","note":"'Smooth-fronted' is mainly used in zoological contexts, not for general descriptions of objects."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'smooth-fronted' is a specialized adjective primarily used in zoology to describe animals with a smooth forehead, lacking prominent ridges or projections. It is not commonly used in everyday language and is therefore more appropriate for advanced learners or those with a specific interest in zoology."},"example_sentences":[{"sentence":"The smooth-fronted Amazon parrots are known for their intelligence.","translation":"ヘサキボウシインコは知能が高いことで知られている。","type":"adjective","meaning_category":"滑らかな額を持つ"},{"sentence":"Distinguishing between caiman species can be done by observing the presence or absence of a ridge on their snout; the smooth-fronted caiman lacks this feature.","translation":"カイマンの種を区別するには、鼻の隆起の有無を観察することで可能であり、ヘサキコビトカイマンにはこの特徴がない。","type":"adjective","meaning_category":"滑らかな額を持つ"}]}