{"word":"ficin","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A proteolytic enzyme derived from the latex of fig trees (Ficus species), used in various industrial and biomedical applications.","english_definition":"A proteolytic enzyme obtained from fig latex.","examples":[{"sentence":"Ficin is used in the preparation of meat tenderizers.","translation":"フィシンは食肉軟化剤の調製に使用されます。"},{"sentence":"The enzymatic activity of ficin is similar to that of papain.","translation":"フィシンの酵素活性はパパインの活性と類似しています。"}],"collocations":["ficin activity","purified ficin","ficin digestion","ficin treatment"],"synonyms":["fig protease","fig peptidase"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name of fig trees, *Ficus*.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfaɪsɪn/","syllables":"fi-cin"},"inflection":{"noun_plural":"ficins"},"usage_notes":{"explanation":"Ficin is primarily used in industrial and research contexts. It's known for its broad specificity in hydrolyzing peptide bonds. Applications include meat tenderization, protein hydrolysis, and cell dissociation in laboratory settings. It is less commonly encountered in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["papain","bromelain","protease","enzyme","Ficus"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Ficin\" is a technical term primarily encountered in biochemistry, food science, and related fields. It refers to a specific enzyme derived from fig trees. Understanding and use of this term are generally limited to individuals with advanced knowledge in these areas."},"example_sentences":[{"sentence":"The research paper investigated the effects of ficin on collagen degradation.","translation":"その研究論文では、コラーゲンの分解に対するフィシンの影響が調査された。","type":"noun","meaning_category":"enzyme"},{"sentence":"Ficin is sometimes used in cell culture to detach cells from the substrate.","translation":"フィシンは、細胞培養において、細胞を基質から剥離させるために使用されることがある。","type":"noun","meaning_category":"enzyme"}],"japanese_reading":"フィシン"}