{"word":"pseudosacrilegiously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"冒涜的であるかのように見せかけて、偽りの冒涜をもって","english_definition":"In a manner that falsely or superficially resembles sacrilege; appearing sacrilegious without genuine intent or effect.","examples":[{"sentence":"The comedian bowed pseudosacrilegiously before the image of the saint, eliciting gasps from some and laughter from others.","translation":"そのコメディアンは、聖人の像の前で冒涜的であるかのように偽って頭を下げ、一部の人々からは息をのむ声が上がり、他の人々からは笑いが起こった。"},{"sentence":"The band's performance, while energetic, was only pseudosacrilegiously rebellious, lacking any real challenge to societal norms.","translation":"そのバンドの演奏は、エネルギッシュではあったものの、社会規範への真の挑戦を欠いており、偽りの冒涜的な反抗に過ぎなかった。"}],"collocations":["bow pseudosacrilegiously","act pseudosacrilegiously","behave pseudosacrilegiously","speak pseudosacrilegiously"],"synonyms":["mockingly","irreverently","disrespectfully","blasphemously (but insincerely)","sacrilegiously (but superficially)"],"antonyms":["reverently","respectfully","piously","devoutly"]}],"etymology":{"value":"Formed by combining \"pseudo-\" (false, fake) with \"sacrilegiously\" (in a sacrilegious manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊsəˌkrɪlɪˈdʒəsli/","syllables":"pseu-do-sac-ri-le-gious-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"The adverb \"pseudosacrilegiously\" describes actions or behaviors that mimic or imitate sacrilege (the violation or profanation of something sacred) but lack genuine intent or effect. It suggests a superficial or insincere display of disrespect towards something considered sacred or revered. The term is often used to critique or satirize attempts at rebellion or shock value that are perceived as shallow or contrived.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted sacrilegiously, but it was pseudosacrilegious.","correct":"✓ He acted sacrilegiously, but it was only pseudosacrilegious.","note":"The first part of the sentence implies genuine sacrilege, which contradicts the meaning of 'pseudosacrilegious'. Using 'only' clarifies that the action merely appeared sacrilegious."},{"incorrect":"✗ The church was pseudosacrilegiously decorated for Halloween.","correct":"✓ The church was ironically decorated for Halloween.","note":"'Pseudosacrilegiously' implies a false or superficial sacrilege, not simply an inappropriate or unconventional decoration. 'Ironically' better conveys the intended meaning of a humorous or unexpected contrast."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudosacrilege (noun)","pseudosacrilegious (adjective)"],"related_terms":["sacrilege","blasphemy","irreverence","profanity","mockery","parody","satire"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pseudosacrilegiously\" is a complex term used to describe actions that appear to be sacrilegious (disrespectful or offensive to sacred things) but are not genuinely so. It implies a superficial or insincere imitation of sacrilege, often for comedic or satirical effect. Understanding this word requires a strong grasp of both the concept of sacrilege and the function of the prefix \"pseudo-\" (meaning false or fake). It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The performance artist danced pseudosacrilegiously on the altar, but it was clear she meant no real harm.","translation":"そのパフォーマンスアーティストは祭壇の上で冒涜的であるかのように踊ったが、彼女が本当に危害を加えるつもりがないことは明らかだった。","type":"adverb","meaning_category":"False sacrilege"},{"sentence":"He presented his argument pseudosacrilegiously, knowing it would provoke a reaction without truly offending anyone.","translation":"彼は、誰かを本当に不快にさせることなく反応を引き起こすだろうと知りながら、冒涜的であるかのように偽って彼の主張を提示した。","type":"adverb","meaning_category":"Insincere disrespect"},{"sentence":"The film depicted the historical event pseudosacrilegiously, using humor to critique the established narrative.","translation":"その映画は、確立された物語を批判するためにユーモアを用いて、歴史的出来事を冒涜的であるかのように偽って描いた。","type":"adverb","meaning_category":"Superficial irreverence"}]}