{"word":"fractionator","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"分別蒸留塔、分留塔","english_definition":"A distillation column used to separate a liquid mixture into its component parts or fractions based on differences in boiling points.","examples":[{"sentence":"The crude oil is fed into a fractionator to separate it into gasoline, kerosene, and other products.","translation":"原油は、ガソリン、灯油、その他の製品に分離するために分別蒸留塔に供給されます。"}],"collocations":["crude oil fractionator","vacuum fractionator"],"synonyms":["distillation column","distillation tower","fractionating column"],"antonyms":[]}],"etymology":{"value":"The word \"fractionator\" is derived from \"fractionate,\" which means to separate into fractions.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈfrækʃəneɪtər/","syllables":"frac-tion-a-tor"},"inflection":{"noun_plural":"fractionators"},"usage_notes":{"explanation":"A fractionator is a key component in oil refineries and chemical plants. It works by heating a liquid mixture, causing the components with lower boiling points to vaporize and rise up the column. As the vapor cools, different fractions condense at different heights in the column, allowing for separation.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["fractionate (verb)","fractionation (noun)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term \"fractionator\" refers to a specialized piece of equipment used in industrial processes, particularly in the petroleum and chemical industries. It's a type of distillation column designed to separate different components of a liquid mixture based on their boiling points. Due to its technical nature, this term is more likely to be encountered in scientific or engineering contexts."},"example_sentences":[{"sentence":"The efficiency of the fractionator is crucial for the overall output of the refinery.","translation":"分別蒸留塔の効率は、精油所の全体的な生産量にとって非常に重要です。","type":"noun","meaning_category":"分留塔"},{"sentence":"Modern fractionators are equipped with sophisticated control systems to optimize the separation process.","translation":"最新の分別蒸留塔には、分離プロセスを最適化するための高度な制御システムが装備されています。","type":"noun","meaning_category":"分留塔"}]}