{"word":"orangery","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"オレンジ園、オレンジ栽培所、またはオレンジなどの柑橘類を栽培する温室、特に歴史的な建物に付属するもの","english_definition":"a greenhouse or conservatory, typically attached to a historic building, used for growing oranges and other citrus fruits.","examples":[{"sentence":"The orangery was filled with the scent of citrus blossoms.","translation":"オレンジ園は柑橘系の花の香りで満たされていた。"},{"sentence":"Many stately homes feature an orangery for growing exotic fruits.","translation":"多くの壮大な家には、珍しい果物を栽培するためのオレンジ栽培所がある。"},{"sentence":"The orangery provided a warm environment for the citrus trees during the winter months.","translation":"オレンジ栽培所は、冬の間、柑橘類の木々に暖かい環境を提供した。"}],"collocations":["historic orangery","large orangery","beautiful orangery","restored orangery","orangery cafe","orangery restaurant"],"synonyms":["conservatory","greenhouse","hothouse","glasshouse"],"antonyms":[]}],"etymology":{"value":"17世紀にフランス語の「orangerie」から英語に入った。「orangerie」は「オレンジの木を育てる場所」を意味し、「orange」（オレンジ）に場所を示す接尾辞「-erie」が付いたもの。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɒrəndʒəri/","syllables":"o-ran-ge-ry"},"inflection":{"noun_plural":"orangeries"},"usage_notes":{"explanation":"An **orangery** is more than just a greenhouse; it's often an architectural feature of a grand estate. Historically, it was a status symbol, demonstrating the owner's wealth and ability to cultivate exotic fruits in a colder climate. Modern orangeries may be used for a wider variety of plants or even as event spaces.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I grow tomatoes in my orangery.","correct":"✓ I grow oranges and lemons in my orangery. / ✓ I grow tomatoes in my greenhouse.","note":"While you *can* grow tomatoes in an orangery, the term specifically implies the cultivation of citrus fruits. Using 'greenhouse' is more general. "},{"incorrect":"✗ The orangery is a small shed in the garden.","correct":"✓ The orangery is a large, ornate building attached to the main house.","note":"Orangeries are typically substantial structures, often architecturally significant, not small sheds."}],"priority":"★★☆"},"related_words":{"derivatives":["orange (名詞: オレンジ)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門的な語彙)","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"orangery\" refers to a type of building, similar to a greenhouse, that was historically used to grow citrus fruits like oranges and lemons, especially in colder climates. These buildings were often part of large estates and were designed to protect the plants during the winter. The term is not commonly used in everyday conversation but may appear in historical contexts or when discussing architecture and gardening.","priority":"★★☆"},"example_sentences":[{"sentence":"The wedding reception was held in the beautifully decorated orangery.","translation":"結婚披露宴は美しく装飾されたオレンジ栽培所で行われた。","type":"noun","meaning_category":"建物"},{"sentence":"The head gardener carefully tended to the citrus trees in the orangery.","translation":"主任庭師はオレンジ栽培所の柑橘類の木々を注意深く手入れした。","type":"noun","meaning_category":"建物"},{"sentence":"The orangery's glass walls allowed plenty of sunlight to reach the plants.","translation":"オレンジ栽培所のガラスの壁は、植物に十分な日光が当たるようにした。","type":"noun","meaning_category":"建物"}]}