{"word":"linguacious","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"おしゃべりな、口数の多い、弁の立つ","english_definition":"given to much talking; talkative; fluent in speech.","examples":[{"sentence":"She was a linguacious child, always asking questions and telling stories.","translation":"彼女はおしゃべりな子供で、いつも質問したり物語を話したりしていた。"},{"sentence":"The linguacious politician was known for his long and engaging speeches.","translation":"その弁の立つ政治家は、長くて人を引き込む演説で知られていた。"}],"collocations":["linguacious person","linguacious speaker","linguacious conversation","linguacious debate"],"synonyms":["talkative","loquacious","garrulous","voluble","chatty","effusive","articulate","fluent"],"antonyms":["taciturn","reticent","reserved","quiet","silent","concise"],"notes":"Often used to describe someone who is not only talkative but also eloquent and articulate."}],"etymology":{"value":"From Latin 'linguax' (talkative), from 'lingua' (tongue).","priority":"★★★"},"pronunciation":{"ipa":"/lɪŋˈɡweɪʃəs/","syllables":"lin-gua-cious"},"inflection":{"notes":"Comparative: more linguacious, Superlative: most linguacious"},"usage_notes":{"explanation":"'Linguacious' is a relatively uncommon word, more formal than 'talkative' or 'chatty'. It implies a natural ease and fluency in speaking.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a linguacious writer, expressing himself beautifully in his novels.","correct":"✓ He was a gifted writer, expressing himself beautifully in his novels.","note":"'Linguacious' refers to spoken language, not written language. Use 'gifted', 'eloquent', or 'articulate' for writing. "},{"incorrect":"✗ The library was linguacious with students studying.","correct":"✓ The library was filled with the sound of students studying.","note":"'Linguacious' describes a person, not a place. A place can be noisy or filled with sounds, but it cannot be linguacious."}],"priority":"★★☆"},"related_words":{"derivatives":["lingua (tongue)","linguistics (言語学)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Linguacious' is an advanced word that describes someone who is very talkative and fluent in speech. It's not a common word, so you'll mostly find it in formal writing or when someone wants to sound sophisticated. It's similar to 'talkative' but implies a higher level of eloquence and ease with language. Think of it as someone who not only talks a lot but also talks well."},"example_sentences":[{"sentence":"The professor was known for his linguacious lectures, which captivated students for hours.","translation":"その教授は、学生を何時間も魅了する、おしゃべりな講義で知られていた。","type":"general","meaning_category":"おしゃべりな"},{"sentence":"Despite his shy demeanor, he proved to be quite linguacious once the conversation turned to his favorite subject.","translation":"内気な態度にもかかわらず、会話が彼の好きな話題になると、彼はとてもおしゃべりであることがわかった。","type":"general","meaning_category":"口数の多い"},{"sentence":"Her linguacious nature made her a natural fit for a career in public relations.","translation":"彼女の弁の立つ性質は、彼女を広報のキャリアに自然に適合させた。","type":"general","meaning_category":"弁の立つ"}]}