{"word":"quietistic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"静寂主義の、無抵抗主義の、運命に身を任せる","english_definition":"characterized by or advocating a passive, contemplative approach to life, often involving withdrawal from worldly affairs and acceptance of things as they are.","examples":[{"sentence":"His quietistic beliefs led him to avoid political involvement.","translation":"彼の静寂主義的な信念は、彼を政治的な関与を避けるように導いた。"},{"sentence":"The artist's work reflects a quietistic acceptance of the natural world.","translation":"その芸術家の作品は、自然界を静寂主義的に受け入れることを反映している。"},{"sentence":"Some critics view the novel's protagonist as embodying a quietistic resignation to fate.","translation":"批評家の中には、その小説の主人公を運命に対する静寂主義的な諦めの体現と見なす者もいる。"}],"collocations":["quietistic approach","quietistic resignation","quietistic acceptance","quietistic philosophy","quietistic tendencies"],"synonyms":["passive","contemplative","resigned","fatalistic","non-resistant","inactive","withdrawn","detached"],"antonyms":["active","engaged","involved","resistant","dynamic","assertive"]}],"etymology":{"value":"「quietism」+「-istic」。quietismは、17世紀にフランスで広まったキリスト教の神秘主義の一派に由来する。ラテン語の「quietus」（静かな、休息している）から派生。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkwaɪ.əˈtɪstɪk/","syllables":"qui-e-tis-tic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**quietistic**」は、静寂主義、無抵抗主義、運命に身を任せる態度を特徴とするもの、またはそれを支持するものを指す形容詞です。この言葉は、しばしば宗教的または哲学的文脈で使用され、行動や努力よりも内省や受容を重視する考え方を表します。政治や社会問題への関与を避け、現状を受け入れる姿勢を指すこともあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a very quietistic personality, always talking and being active.","correct":"✓ He had a quietistic personality, preferring contemplation and avoiding action.","note":"静寂主義的な性格は、活動的であることとは対照的です。内省的で、行動を避ける傾向があります。"},{"incorrect":"✗ The quietistic movement was known for its violent protests.","correct":"✓ The quietistic movement was known for its passive resistance.","note":"静寂主義的な運動は、暴力的な抗議ではなく、無抵抗や受容を特徴とします。"}],"priority":"★★☆"},"related_words":{"derivatives":["quietism (名詞: 静寂主義、無抵抗主義)","quietist (名詞: 静寂主義者、無抵抗主義者)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**quietistic**」は、あまり一般的ではない単語で、哲学や宗教の文脈でよく使われます。これは、人生に対する受動的で瞑想的なアプローチを意味し、しばしば世俗的な事柄からの撤退や物事をあるがままに受け入れることを伴います。たとえば、政治的な活動を避けたり、社会的な問題に関与しない態度を指すことがあります。この単語を使うときは、それが通常、積極的な行動よりも内省を重視する特定の哲学的な立場を表すことを理解しておくことが重要です。"},"example_sentences":[{"sentence":"The monk lived a quietistic life of prayer and meditation.","translation":"その僧侶は、祈りと瞑想の静寂主義的な生活を送った。","type":"adjective","meaning_category":"静寂主義的な"},{"sentence":"Her quietistic philosophy emphasized inner peace over worldly success.","translation":"彼女の静寂主義的な哲学は、世俗的な成功よりも内なる平和を重視した。","type":"adjective","meaning_category":"無抵抗主義的な"},{"sentence":"The government's inaction was seen by some as a quietistic acceptance of the status quo.","translation":"政府の不作為は、現状に対する静寂主義的な受容であると一部の人々には見なされた。","type":"adjective","meaning_category":"運命に身を任せる"}]}