{"word":"Masaridid","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A wasp belonging to the family Masarididae, a group of wasps known for feeding their larvae with pollen and nectar, unlike most other wasps which are carnivorous.","english_definition":"A wasp belonging to the family Masarididae, characterized by feeding their larvae with pollen and nectar.","examples":[{"sentence":"The Masaridid wasp is an interesting example of a vegetarian wasp.","translation":"Masarididハチは、ベジタリアンハチの興味深い例です。"}],"collocations":["Masaridid wasp","Masaridid larvae"],"synonyms":["pollen wasp"],"antonyms":[]}],"etymology":{"value":"Derived from the family name Masarididae.","priority":"N/A"},"pronunciation":{"ipa":"/məˈsærɪdɪd/","syllables":"ma-sar-i-did"},"inflection":{"noun_plural":"Masaridids"},"usage_notes":{"explanation":"Masaridids are unique among wasps because they provision their young with pollen and nectar, similar to bees. They are solitary wasps, meaning they do not form colonies like honeybees or some other wasp species.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Masarididae"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'Masaridid' refers to a specific family of wasps known for their unique dietary habits. Understanding this term requires a background in entomology or a general knowledge of wasp biology. The text uses scientific terminology and assumes a certain level of familiarity with biological classifications."},"example_sentences":[{"sentence":"The Masaridid wasp is a fascinating example of an insect with a vegetarian diet.","translation":"Masarididハチは、菜食の食生活を持つ昆虫の魅力的な例です。","type":"noun","meaning_category":"Insect"},{"sentence":"Researchers are studying the pollen-collecting behavior of Masaridid wasps.","translation":"研究者たちは、Masarididハチの花粉収集行動を研究しています。","type":"noun","meaning_category":"Insect Behavior"}]}