{"word":"proterandrousness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"雄性先熟性、雄ずい先熟","english_definition":"The condition of being proterandrous; the state of having functional stamens before functional pistils.","examples":[{"sentence":"Proterandrousness is a common strategy in flowering plants to promote cross-pollination.","translation":"雄性先熟性は、被子植物において異花受粉を促進するための一般的な戦略です。"}],"collocations":["exhibit proterandrousness","observe proterandrousness","study proterandrousness"],"synonyms":["protandry","dichogamy"],"antonyms":[]}],"etymology":{"value":"From 'proterandrous' (having stamens that mature before the pistils) + '-ness' (suffix indicating a state or condition). 'Proterandrous' is derived from Greek 'proteros' (earlier) + 'aner, andros' (man, male).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊtərˈændrəsnəs/","syllables":"pro-ter-an-drous-ness"},"inflection":{"noun_plural":"proterandrousnesses (rarely used)"},"usage_notes":{"explanation":"'Proterandrousness' refers specifically to the state or condition of a plant being proterandrous, meaning its stamens (male reproductive organs) mature and release pollen before its pistils (female reproductive organs) are receptive. This mechanism prevents self-pollination and encourages cross-pollination, promoting genetic diversity. It is a term primarily used in botany and plant biology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The proterandrousness of the flower made it difficult to self-pollinate.","correct":"✓ The proterandry of the flower made it difficult to self-pollinate.","note":"While 'proterandrousness' is technically correct, 'proterandry' is the more commonly used and accepted term to describe the condition."}],"priority":"★☆☆"},"related_words":{"derivatives":["proterandrous (adjective)","protandry (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Proterandrousness' is a highly specialized term in botany, referring to the condition where the male reproductive organs (stamens) of a plant mature before the female reproductive organs (pistils). This prevents self-pollination and promotes cross-pollination. It is rarely used outside of scientific contexts. The more common term is 'protandry'."},"example_sentences":[{"sentence":"The proterandrousness of the species ensures outcrossing.","translation":"その種の雄性先熟性は他家受粉を保証する。","type":"noun","meaning_category":"雄性先熟性"},{"sentence":"The degree of proterandrousness varied among the different cultivars.","translation":"雄性先熟性の程度は、異なる栽培品種間で異なっていた。","type":"noun","meaning_category":"雄性先熟性"}]}