{"word":"sacrum","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"仙骨","english_definition":"a triangular bone in the lower back formed from fused vertebrae and situated between the hip bones of the pelvis.","examples":[{"sentence":"The sacrum articulates with the hip bones to form the sacroiliac joints.","translation":"仙骨は寛骨と関節して仙腸関節を形成する。"},{"sentence":"Pain in the lower back can sometimes be attributed to issues with the sacrum.","translation":"腰の痛みは、仙骨の問題に起因することがある。"}],"collocations":["sacral vertebrae","sacroiliac joint","lower back pain","spinal column"],"synonyms":["os sacrum","sacral bone"],"antonyms":[]}],"etymology":{"value":"From Latin *os sacrum*, literally 'sacred bone'. The reason for this name is uncertain, but theories include that it was the part of the body offered in sacrifices, or that it was thought to house the soul.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈseɪkrəm/","syllables":"sa-crum"},"inflection":{"noun_plural":"sacrums or sacra (Latin plural)"},"usage_notes":{"explanation":"The *sacrum* is a crucial part of the spine, connecting it to the pelvis. It provides stability and support to the upper body. Medical professionals often refer to it when discussing lower back pain or pelvic issues.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sacrum is in the upper back.","correct":"✓ The sacrum is in the lower back.","note":"The sacrum is located at the base of the spine, in the lower back, not the upper back."},{"incorrect":"✗ Sacrum is a muscle.","correct":"✓ Sacrum is a bone.","note":"The sacrum is a bone, specifically a bone formed by fused vertebrae."}],"priority":"★★☆"},"related_words":{"derivatives":["sacral (adjective): relating to the sacrum"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term *sacrum* is a technical term primarily used in medical and anatomical contexts. Understanding its meaning is essential for those studying anatomy, medicine, or related fields. It refers to a specific bone structure at the base of the spine, and its function and location are important for understanding lower back and pelvic anatomy.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor examined the patient's sacrum to assess the cause of their back pain.","translation":"医師は患者の腰痛の原因を評価するために仙骨を診察した。","type":"noun","meaning_category":"anatomy"},{"sentence":"The sacrum is formed by the fusion of five sacral vertebrae.","translation":"仙骨は5つの仙椎の融合によって形成される。","type":"noun","meaning_category":"anatomy"},{"sentence":"Injuries to the sacrum can affect the stability of the pelvis.","translation":"仙骨の損傷は骨盤の安定性に影響を与える可能性がある。","type":"noun","meaning_category":"medicine"}]}