{"word":"shoemaking","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"靴作り、製靴業","english_definition":"the craft or industry of making shoes.","examples":[{"sentence":"He has been involved in shoemaking for over 20 years.","translation":"彼は20年以上靴作りに携わっています。"},{"sentence":"Shoemaking is a traditional craft that requires great skill.","translation":"靴作りは高度な技術を要する伝統的な工芸です。"}],"collocations":["traditional shoemaking (伝統的な靴作り)","handmade shoemaking (手作りの靴作り)","industrial shoemaking (工業的な靴作り)"],"synonyms":["cobbling","bootmaking"],"antonyms":[]}],"etymology":{"value":"\"Shoemaking\" is a compound word formed from \"shoe\" and \"making\". \"Shoe\" comes from Old English \"scōh\", and \"making\" is the present participle of \"make\", from Old English \"macian\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈʃuːˌmeɪkɪŋ/","syllables":"shoe-mak-ing"},"inflection":{"noun_plural":"shoemakings (rarely used)"},"usage_notes":{"explanation":"\"Shoemaking\" refers to the process, skill, or industry involved in creating shoes. It encompasses both traditional handmade methods and modern industrial production. It is often used to describe the craft or business of making shoes rather than a single instance of making a shoe.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is good at shoe making.","correct":"✓ He is good at shoemaking.","note":"\"Shoemaking\" as one word is generally preferred when referring to the craft or industry. \"Shoe making\" (two words) can be used, but it's less common and might refer more directly to the act of making a shoe."}],"priority":"★★☆"},"related_words":{"derivatives":["shoemaker (靴職人)","shoe (靴)","make (作る)"],"related_terms":["cobbler (靴の修理職人)","leatherwork (革細工)","footwear (履物)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 特定の分野や趣味に関連する語彙。","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Shoemaking\" is a term referring to the craft or industry of making shoes. It's a compound word that combines \"shoe\" and \"making.\" While not a commonly used word in everyday conversation, it's relevant when discussing traditional crafts, fashion, or manufacturing. It's more specific than simply saying \"making shoes,\" as it implies a profession or skill.","priority":"★★☆"},"example_sentences":[{"sentence":"The art of shoemaking has been passed down through generations in his family.","translation":"靴作りの技術は彼の家族の中で何世代にもわたって受け継がれてきました。","type":"general","meaning_category":"靴作り"},{"sentence":"Modern shoemaking often involves automated processes and synthetic materials.","translation":"現代の靴作りは、多くの場合、自動化されたプロセスと合成材料を使用します。","type":"general","meaning_category":"靴作り"},{"sentence":"He enrolled in a course to learn the basics of shoemaking.","translation":"彼は靴作りの基礎を学ぶためにコースに登録しました。","type":"general","meaning_category":"靴作り"}]}