{"word":"UV-vulnerable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"紫外線に弱い、紫外線によって損傷を受けやすい","english_definition":"Susceptible to damage or harm from ultraviolet (UV) radiation.","examples":[{"sentence":"The material is UV-vulnerable and should not be exposed to direct sunlight for extended periods.","translation":"その素材は紫外線に弱いため、直射日光に長時間さらすべきではありません。"},{"sentence":"Certain types of plastic are UV-vulnerable and can become brittle over time.","translation":"特定の種類のプラスチックは紫外線に弱く、時間の経過とともに脆くなる可能性があります。"},{"sentence":"The UV-vulnerable coating needs to be reapplied regularly to maintain its protective properties.","translation":"紫外線に弱いコーティングは、保護特性を維持するために定期的に再塗布する必要があります。"}],"collocations":["UV-vulnerable material (紫外線に弱い素材)","UV-vulnerable plastic (紫外線に弱いプラスチック)","UV-vulnerable coating (紫外線に弱いコーティング)","UV-vulnerable skin (紫外線に弱い肌)"],"synonyms":["UV-sensitive","susceptible to UV radiation","sensitive to UV light"],"antonyms":["UV-resistant","UV-stable","UV-protected"]}],"etymology":{"value":"The term is formed by combining 'UV' (ultraviolet) with 'vulnerable' (capable of being wounded or damaged).","priority":"★★★"},"pronunciation":{"ipa":"ˌjuːˈviː ˈvʌlnərəbəl","syllables":"U-V-vul-ner-a-ble"},"inflection":{"notes":"Since it is an adjective, it can be used to modify nouns and can be used in comparative and superlative forms, although these are less common (more UV-vulnerable, most UV-vulnerable)."},"usage_notes":{"explanation":"'UV-vulnerable' describes a substance or organism that is easily harmed by ultraviolet radiation. It is often used in the context of materials science, dermatology, and environmental science.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The UV-vulnerable is a problem.","correct":"✓ UV vulnerability is a problem.","note":"'UV-vulnerable' is an adjective; use the noun form 'UV vulnerability' if you need a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["vulnerability (名詞: 脆弱性、弱さ)","UV radiation (名詞: 紫外線)","UV resistance (名詞: 紫外線耐性)"],"phrasal_verbs":[],"related_concepts":["photodegradation (光分解)","sunscreen (日焼け止め)","ozone layer (オゾン層)"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'UV-vulnerable' is a technical term used to describe materials or organisms that are easily damaged by ultraviolet (UV) radiation. It's commonly used in scientific and technical contexts, such as materials science or dermatology, to indicate a lack of resistance to UV light. Understanding the term requires familiarity with basic scientific concepts related to light and materials."},"example_sentences":[{"sentence":"The old paint was UV-vulnerable, causing it to fade quickly in the sun.","translation":"古い塗料は紫外線に弱く、太陽の下で急速に色褪せてしまった。","type":"adjective","meaning_category":"紫外線に弱い"},{"sentence":"Scientists are studying ways to make crops less UV-vulnerable.","translation":"科学者たちは、作物を紫外線に弱くなくする方法を研究している。","type":"adjective","meaning_category":"紫外線に弱い"},{"sentence":"The document warned that prolonged exposure could damage the UV-vulnerable components of the device.","translation":"その文書は、長時間の暴露がデバイスの紫外線に弱い部品を損傷する可能性があると警告した。","type":"adjective","meaning_category":"紫外線に弱い"}]}