{"word":"epimyocardium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"心外膜心筋","english_definition":"The outer layer of the myocardium, adjacent to the epicardium.","examples":[{"sentence":"The epimyocardium is essential for proper heart function.","translation":"心外膜心筋は適切な心臓機能に不可欠です。"},{"sentence":"Inflammation of the epimyocardium can lead to serious cardiac complications.","translation":"心外膜心筋の炎症は、深刻な心臓合併症を引き起こす可能性があります。"}],"collocations":["epimyocardial cells","epimyocardial inflammation"],"synonyms":["outer myocardium"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek roots 'epi-' (upon, above), 'myo-' (muscle), and 'cardium' (heart).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛpɪˌmaɪoʊˈkɑːrdiəm/","syllables":"e-pi-my-o-car-di-um"},"inflection":{"noun_plural":"epimyocardia"},"usage_notes":{"explanation":"The term 'epimyocardium' is primarily used in medical and anatomical contexts to specifically refer to the outermost layer of the heart muscle. It is important in understanding cardiac physiology and pathology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The epicardium is the same as the epimyocardium.","correct":"✓ The epimyocardium is the outer layer of the myocardium, adjacent to the epicardium.","note":"The epimyocardium is a layer of the myocardium, while the epicardium is the outermost layer of the heart itself."}],"priority":"★★☆"},"related_words":{"derivatives":["myocardium","epicardium","endocardium"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Very low frequency - primarily used in medical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Epimyocardium' is a highly specialized term used in cardiology and anatomy. It refers to the outermost layer of the heart muscle (myocardium), specifically the part closest to the epicardium (the outer covering of the heart). Due to its specific and technical nature, it is not commonly encountered outside of medical or scientific literature."},"example_sentences":[{"sentence":"The study focused on the structural changes within the epimyocardium following myocardial infarction.","translation":"その研究は、心筋梗塞後の心外膜心筋内の構造変化に焦点を当てました。","type":"noun","meaning_category":"anatomical structure"},{"sentence":"Epimyocardial fibrosis was observed in patients with hypertrophic cardiomyopathy.","translation":"肥大型心筋症の患者において、心外膜心筋線維症が観察されました。","type":"noun","meaning_category":"medical condition"}]}