{"word":"Paleocrystal","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A crystal that formed long ago, typically within a rock matrix, and provides information about the conditions present at the time of its formation.","english_definition":"A crystal formed in the geological past, often enclosed within a larger rock or mineral, preserving information about ancient environments or processes.","examples":[{"sentence":"The paleocrystal contained inclusions that revealed the composition of the magma from which it crystallized.","translation":"その古結晶には、結晶化したマグマの組成を示す包有物が含まれていた。"},{"sentence":"Analysis of the paleocrystals helped scientists reconstruct the temperature and pressure conditions of the ancient Earth.","translation":"古結晶の分析は、科学者が古代地球の温度と圧力条件を再構築するのに役立った。"}],"collocations":["analyze a paleocrystal (古結晶を分析する)","study paleocrystals (古結晶を研究する)","paleocrystal inclusions (古結晶包有物)","paleocrystal formation (古結晶形成)"],"synonyms":["ancient crystal","fossil crystal","relict crystal"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'palaios' (ancient) and 'krystallos' (crystal).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpeɪlioʊˈkrɪstəl/","syllables":"pa-le-o-crys-tal"},"inflection":{"noun_plural":"paleocrystals"},"usage_notes":{"explanation":"Paleocrystals are valuable in geological and geochemical research because they can preserve information about past environments that would otherwise be lost due to weathering, metamorphism, or other geological processes. They are often studied using techniques such as electron microscopy, mass spectrometry, and X-ray diffraction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock was filled with paleocrystals, making it easy to break.","correct":"✓ The rock was filled with large crystals, making it easy to break.","note":"Paleocrystals are not necessarily large or make rocks easy to break. The term refers to their age and information content, not their physical properties."}],"priority":"★☆☆"},"related_words":{"derivatives":["paleocrystalline (adjective)"],"related_terms":["geochronology","petrology","mineralogy","inclusion","isotope geochemistry"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Specialized geological term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Paleocrystal' is a specialized term used in geology and mineralogy to describe crystals that formed in the distant past. These crystals are often found within other rocks and minerals and can provide valuable information about the Earth's ancient environments and geological processes. The term is typically encountered in advanced scientific literature and discussions within the field of geology."},"example_sentences":[{"sentence":"The geochronologist dated the zircon paleocrystal to over 4 billion years old.","translation":"地質年代学者は、ジルコンの古結晶の年代を40億年以上と推定した。","type":"scientific","meaning_category":"age determination"},{"sentence":"Fluid inclusions within the paleocrystal revealed the composition of the hydrothermal fluids present during its formation.","translation":"古結晶内の流体包有物は、その形成時に存在した熱水流体の組成を明らかにした。","type":"scientific","meaning_category":"composition analysis"},{"sentence":"The paleocrystal's isotopic signature provided insights into the mantle source from which it originated.","translation":"古結晶の同位体シグネチャは、それが由来するマントル源についての洞察を提供した。","type":"scientific","meaning_category":"origin tracing"}]}