{"word":"vagabondized","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"放浪生活を送った、浮浪者として暮らした","english_definition":"To wander from place to place without a home or job; to live as a vagabond.","examples":[{"sentence":"He vagabondized through Europe for several years after college.","translation":"彼は大学卒業後、数年間ヨーロッパを放浪した。"},{"sentence":"She vagabondized around the country, experiencing different cultures.","translation":"彼女は国中を放浪し、さまざまな文化を体験した。"}],"collocations":["vagabondize through","vagabondize around"],"synonyms":["wander","roam","ramble","drift","travel","jaunt"],"antonyms":["settle","stay","remain"]},{"part_of_speech":"verb","transitivity":"vt","definition":"（場所）を放浪した、浮浪者として（場所）を歩き回った","english_definition":"To travel or wander through (a place) as a vagabond.","examples":[{"sentence":"They vagabondized the countryside, sleeping under the stars.","translation":"彼らは田舎を放浪し、星空の下で眠った。"},{"sentence":"He vagabondized the streets of the city, searching for a purpose.","translation":"彼は目的を探して、街の通りを放浪した。"}],"collocations":["vagabondize the countryside","vagabondize the streets"],"synonyms":["traverse","explore","journey through","travel across"],"antonyms":["stay in","remain in"]}],"etymology":{"value":"'Vagabond' + '-ize'. 'Vagabond' comes from the Late Latin 'vagabundus' meaning 'wandering'. The suffix '-ize' is used to form verbs, meaning 'to make, to treat, or to become'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvæɡəbɒndaɪzd/","syllables":"vag-a-bond-ized"},"inflection":{"verb_forms":{"present_simple":["vagabondize","vagabondizes"],"past_simple":"vagabondized","past_participle":"vagabondized","present_participle":"vagabondizing"}},"usage_notes":{"explanation":"'Vagabondized' is the past simple and past participle of the verb 'vagabondize'. It describes the act of living as a vagabond, wandering without a fixed home or job. It can be used intransitively (without a direct object) to describe someone's lifestyle, or transitively (with a direct object) to describe wandering through a particular place.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He vagabondized to find a job.","correct":"✓ He vagabondized, trying to find a job.","note":"The main action is the wandering, not the job search. Use a gerund or infinitive to show the purpose of wandering."},{"incorrect":"✗ She vagabondized because she was very poor.","correct":"✓ She vagabondized because she had no money.","note":"Poverty can be a *reason* for vagabonding, but the verb describes the act of wandering itself. The sentence should focus on the lack of money as the cause."}],"priority":"★☆☆"},"related_words":{"derivatives":["vagabond (noun, adjective)","vagabondage (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Very low frequency - a relatively rare word.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Vagabondized' is a relatively uncommon word that describes the act of living as a vagabond, wandering without a fixed home or job. It is derived from the noun 'vagabond' and the verb-forming suffix '-ize'. The word implies a lifestyle of wandering, often without a clear purpose or destination. It is more likely to be found in literature or historical contexts than in everyday conversation."},"example_sentences":[{"sentence":"Having lost his fortune, he vagabondized through the country, relying on the kindness of strangers.","translation":"財産を失った彼は、見知らぬ人々の親切に頼りながら、国中を放浪した。","type":"verb (vi)","meaning_category":"放浪生活を送った"},{"sentence":"The artist vagabondized the remote landscapes, seeking inspiration for his paintings.","translation":"その芸術家は絵のインスピレーションを求めて、人里離れた風景を放浪した。","type":"verb (vt)","meaning_category":"（場所）を放浪した"}]}