{"word":"Marianolatrist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"マリア崇拝者、聖母マリアを過度に崇拝する人","english_definition":"One who worships or venerates the Virgin Mary to an excessive degree.","examples":[{"sentence":"Some critics have accused the church of being Marianolatrist.","translation":"一部の批評家は、教会がマリア崇拝的であると非難している。"},{"sentence":"He was labeled a Marianolatrist due to his fervent devotion to Mary.","translation":"彼は聖母マリアへの熱烈な献身から、マリア崇拝者というレッテルを貼られた。"}],"collocations":["extreme Marianolatrist","accused of being Marianolatrist"],"synonyms":["Mariolater","Mary worshipper"],"antonyms":["iconoclast","Mary denier"]}],"etymology":{"value":"'Mariano-' (of or pertaining to the Virgin Mary) + '-latry' (worship) + '-ist' (a person who practices or believes in something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛəriˌænɒˈlætrɪst/","syllables":"Ma-ri-a-no-la-trist"},"inflection":{"noun_plural":"Marianolatrists"},"usage_notes":{"explanation":"The term 'Marianolatrist' is often used pejoratively to criticize what is perceived as excessive or inappropriate veneration of the Virgin Mary, especially within certain denominations of Christianity. It suggests that the individual places Mary on a level close to or equal to God, which is considered heretical by some.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Marianolatry.","correct":"✓ He is a Marianolatrist.","note":"'Marianolatry' is the worship itself, while 'Marianolatrist' is the person who practices it."}],"priority":"★★☆"},"related_words":{"derivatives":["Marianolatry (noun: マリア崇拝、聖母マリアの過度な崇拝)","Mariology (noun: マリア論、聖母マリアに関する神学)","Marian (adjective: 聖母マリアに関する、聖母マリアの)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Marianolatrist' is a specialized term referring to someone who excessively worships the Virgin Mary. It is often used critically to suggest that the person's devotion borders on idolatry. The word is not commonly used outside of theological or historical discussions."},"example_sentences":[{"sentence":"The theologian argued that the artist's depiction of Mary was verging on Marianolatrist.","translation":"神学者は、その芸術家によるマリアの描写はマリア崇拝に近づいていると主張した。","type":"noun","meaning_category":"マリア崇拝者"},{"sentence":"Some viewed his intense prayers to Mary as evidence that he was a Marianolatrist.","translation":"彼のマリアへの熱心な祈りは、彼がマリア崇拝者である証拠だと見る人もいた。","type":"noun","meaning_category":"マリア崇拝者"}]}