{"word":"Manichaeanize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"（人、世界観、状況などを）マニ教的に解釈する、善悪二元論的に捉える","english_definition":"To interpret (a person, worldview, situation, etc.) in a Manichaean manner; to view as a struggle between good and evil.","examples":[{"sentence":"The media tends to Manichaeanize political debates, portraying them as a simple battle between right and wrong.","translation":"メディアは政治討論をマニ教的に解釈し、単純な善悪の戦いとして描く傾向がある。"},{"sentence":"It's dangerous to Manichaeanize complex social issues, as it oversimplifies the underlying causes.","translation":"複雑な社会問題をマニ教的に捉えるのは危険だ。根本的な原因を単純化してしまうからだ。"},{"sentence":"He warned against Manichaeanizing the conflict, arguing that both sides had legitimate grievances.","translation":"彼は紛争をマニ教的に捉えることに警告し、双方に正当な不満があると主張した。"}],"collocations":["Manichaeanize a situation (状況をマニ教的に解釈する)","Manichaeanize a conflict (紛争をマニ教的に解釈する)","Manichaeanize the world (世界をマニ教的に解釈する)"],"synonyms":["dichotomize","polarize","oversimplify","dualize"],"antonyms":["complexify","nuance","contextualize"]}],"etymology":{"value":"From 'Manichaean' (relating to Manichaeism, a dualistic religious philosophy) + '-ize' (a suffix indicating to make or become).","priority":"★★☆"},"pronunciation":{"ipa":"/məˌnɪkiˈeɪənaɪz/","syllables":"ma-nich-ae-an-ize"},"inflection":{"verb_forms":{"present_simple":["Manichaeanize","Manichaeanizes"],"past_simple":"Manichaeanized","past_participle":"Manichaeanized","present_participle":"Manichaeanizing"}},"usage_notes":{"explanation":"'Manichaeanize' is a relatively rare verb that describes the act of viewing something through the lens of Manichaeism, a dualistic religion that posits a fundamental struggle between good and evil. It often implies an oversimplified or polarized view of a situation, conflict, or worldview. The term is often used critically to suggest that someone is reducing a complex issue to a simplistic dichotomy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist Manichaeanized his paintings.","correct":"✓ The artist's paintings were Manichaean in style.","note":"While 'Manichaeanize' is a verb, it describes the act of interpreting something in a Manichaean way, not the act of making something Manichaean. In this case, it's better to use the adjective 'Manichaean' to describe the style of the paintings."},{"incorrect":"✗ They Manichaeanize the problem by ignoring the grey areas.","correct":"✓ They Manichaeanize the problem by ignoring the gray areas.","note":"Be mindful of the spelling of 'gray' (American English) or 'grey' (British English)."}],"priority":"★★☆"},"related_words":{"derivatives":["Manichaean (adjective, noun)","Manichaeism (noun)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (very advanced vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Manichaeanize' is a complex and infrequent verb. It means to interpret something in a way that reflects the dualistic principles of Manichaeism, a historical religious system that saw the world as a battleground between good and evil. Using this word implies that someone is simplifying a complex situation into a basic conflict between opposing forces. It's a sophisticated term often used in academic or analytical contexts."},"example_sentences":[{"sentence":"Critics accused the government of Manichaeanizing the debate on immigration.","translation":"批評家たちは政府が移民に関する議論をマニ教的に解釈していると非難した。","type":"verb","meaning_category":"善悪二元論的に捉える"},{"sentence":"By Manichaeanizing the issue, the politician appealed to voters' emotions rather than their reason.","translation":"問題をマニ教的に捉えることで、その政治家は有権者の理性よりも感情に訴えた。","type":"verb","meaning_category":"善悪二元論的に捉える"},{"sentence":"It is important to avoid Manichaeanizing history, as it often leads to a distorted understanding of the past.","translation":"歴史をマニ教的に捉えることを避けることが重要だ。過去の歪んだ理解につながることが多いからだ。","type":"verb","meaning_category":"善悪二元論的に捉える"}]}