{"word":"comprehensibility","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"理解可能性、分かりやすさ","english_definition":"the quality of being easy to understand.","examples":[{"sentence":"The comprehensibility of the instructions was poor.","translation":"その説明書の理解可能性は低かった。"},{"sentence":"We need to improve the comprehensibility of our website.","translation":"ウェブサイトの分かりやすさを改善する必要がある。"},{"sentence":"The comprehensibility of his lecture suffered from his use of jargon.","translation":"彼の講義は専門用語の使用により、分かりやすさが損なわれた。"}],"collocations":["improve comprehensibility (理解可能性を向上させる)","ensure comprehensibility (理解可能性を確保する)","lack of comprehensibility (理解可能性の欠如)","high/low comprehensibility (高い/低い理解可能性)"],"synonyms":["intelligibility","clarity","lucidity","accessibility","understandability"],"antonyms":["incomprehensibility","obscurity","ambiguity","vagueness"]}],"etymology":{"value":"\"Comprehensibility\" is derived from \"comprehensible,\" which comes from the Latin \"comprehendere\" (to grasp, seize, understand). The suffix \"-ibility\" indicates the quality or state of being.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɒmprɪˌhɛnsɪˈbɪləti/","syllables":"com-pre-hen-si-bil-i-ty"},"inflection":{"noun_plural":"comprehensibilities (rarely used)"},"usage_notes":{"explanation":"\"Comprehensibility\" refers to the degree to which something can be understood. It is often used in the context of written or spoken communication, instructions, or complex systems. High comprehensibility means that the information is easy to grasp, while low comprehensibility indicates that it is difficult to understand. It is often used in technical writing, education, and communication studies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The comprehensibility is very important.","correct":"✓ Comprehensibility is very important.","note":"While grammatically correct, it's more common to use 'comprehensibility' as a general concept rather than referring to a specific instance. Consider rephrasing if needed."},{"incorrect":"✗ The comprehensibility of the book was very comprehend.","correct":"✓ The comprehensibility of the book was very high. / ✓ It was easy to comprehend the book.","note":"'Comprehend' is a verb, not an adjective. Use 'high' or 'low' to describe the level of comprehensibility or rephrase to use 'comprehend' as a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["comprehensible (adjective: 理解可能な、分かりやすい)","incomprehensible (adjective: 理解不能な、分かりにくい)","comprehend (verb: 理解する、把握する)","comprehension (noun: 理解、把握)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, used in academic and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Comprehensibility\" is a relatively advanced word that describes how easy something is to understand. It's often used in formal writing or when discussing complex topics. If something has high comprehensibility, it means it's clear and easy to follow. If it has low comprehensibility, it's difficult to understand. You'll often see this word used when talking about instructions, documents, or explanations.","priority":"★★☆"},"example_sentences":[{"sentence":"The **comprehensibility** of the user manual is crucial for the product's success.","translation":"製品の成功には、ユーザーマニュアルの理解可能性が非常に重要だ。","type":"noun","meaning_category":"分かりやすさ"},{"sentence":"The professor focused on improving the **comprehensibility** of his lectures.","translation":"教授は講義の分かりやすさを向上させることに重点を置いた。","type":"noun","meaning_category":"理解可能性"},{"sentence":"A lack of **comprehensibility** can lead to frustration and confusion.","translation":"理解可能性の欠如は、不満や混乱につながる可能性がある。","type":"noun","meaning_category":"分かりやすさ"}]}