{"word":"Paramimia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)表情の異常、感情と一致しない表情","english_definition":"(medicine) The abnormal expression of emotion, especially facial expression, that does not match the emotion being experienced.","examples":[{"sentence":"Paramimia can be a symptom of neurological disorders.","translation":"表情麻痺は神経疾患の症状である可能性があります。"},{"sentence":"The patient exhibited paramimia, smiling when discussing sad events.","translation":"患者は悲しい出来事について話す際に笑顔を見せるなど、表情麻痺を示した。"}],"collocations":["facial paramimia (顔面表情麻痺)","emotional paramimia (感情性表情麻痺)"],"synonyms":["affective flattening","emotional dysregulation","incongruent affect"],"antonyms":[],"notes":"Often associated with neurological or psychiatric conditions."}],"etymology":{"value":"Derived from the Greek words 'para' (beside, abnormal) and 'mimos' (imitator, actor).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəˈmɪmiə/","syllables":"par-a-mim-i-a"},"inflection":{"noun_plural":"paramimias"},"usage_notes":{"explanation":"'Paramimia' is a medical term used to describe the incongruence between a person's expressed emotion (typically facial expression) and their internally experienced emotion. It is not simply the suppression of emotion, but rather the expression of an emotion that is inappropriate for the situation. It can be a subtle symptom and requires careful observation to detect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was just being dramatic, not paramimia.","correct":"✓ He was just being dramatic, not exhibiting paramimia.","note":"Paramimia is a medical symptom, not a behavior choice."},{"incorrect":"✗ She has paramimia because she is shy.","correct":"✓ She might be shy, but paramimia is usually related to a medical condition.","note":"Shyness is a personality trait, while paramimia is a symptom of a potential underlying medical issue."}],"priority":"★★☆"},"related_words":{"derivatives":["paramimic (adjective)"],"related_terms":["apraxia","prosopagnosia","schizophrenia","autism spectrum disorder"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. A specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Paramimia' is a specialized medical term referring to the disconnect between a person's felt emotion and their outward expression, particularly facial expression. It's often associated with neurological or psychiatric conditions. This term is not commonly used outside of medical or psychological contexts. Understanding requires a strong vocabulary and familiarity with medical terminology."},"example_sentences":[{"sentence":"The neurologist noted the patient's paramimia during the examination.","translation":"神経科医は診察中に患者の表情麻痺に気づいた。","type":"medical","meaning_category":"medical symptom"},{"sentence":"Paramimia can make it difficult to understand a person's true feelings.","translation":"表情麻痺は人の本当の気持ちを理解することを困難にする可能性がある。","type":"general","meaning_category":"general description"}]}