{"word":"geoselenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"地球と月に関する、地球と月の","english_definition":"Relating to both the Earth and the Moon.","examples":[{"sentence":"The geoselenic orbit is a complex calculation.","translation":"地球月軌道は複雑な計算です。"},{"sentence":"Geoselenic space research is still in its early stages.","translation":"地球月空間の研究はまだ初期段階にあります。"}],"collocations":["geoselenic orbit","geoselenic space"],"synonyms":["Earth-Moon","terrestrial-lunar"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words \"geo\" (earth) and \"seleno\" (moon), with the suffix \"-ic\" indicating relationship or connection.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒiːoʊsɪˈliːnɪk/","syllables":"ge-o-se-le-nic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'geoselenic' is primarily used in scientific or technical contexts, particularly when discussing orbital mechanics, space exploration, or astronomical phenomena involving both the Earth and the Moon. It is not a commonly used word in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["geocentric","selenocentric","Earth","Moon"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'geoselenic' is a highly specialized word used in technical and scientific fields, particularly those related to space exploration and astronomy. It describes something that pertains to both the Earth and the Moon. Due to its limited usage, it is unlikely to be encountered outside of these specific contexts."},"example_sentences":[{"sentence":"The stability of a geoselenic transfer orbit is crucial for efficient lunar missions.","translation":"効率的な月面ミッションには、地球月遷移軌道の安定性が重要です。","type":"adjective","meaning_category":"Relating to both Earth and Moon"},{"sentence":"Studies of geoselenic gravitational interactions help refine our understanding of celestial mechanics.","translation":"地球月重力相互作用の研究は、天体力学の理解を深めるのに役立ちます。","type":"adjective","meaning_category":"Relating to both Earth and Moon"}]}