{"word":"byliner","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"署名記事、署名欄","english_definition":"A printed line of text accompanying a news story, article, or other piece of writing, giving the author's name. The article itself that has the author's name printed with it.","examples":[{"sentence":"She's hoping to get more byliners in the newspaper.","translation":"彼女は新聞にもっと多くの署名記事を載せてもらうことを望んでいる。"},{"sentence":"The editor insisted on a byliner for the investigative report.","translation":"編集者はその調査報道に署名記事をつけるよう主張した。"},{"sentence":"A byliner can help a journalist build their reputation.","translation":"署名記事はジャーナリストが評判を築くのに役立つ。"}],"collocations":["get a byliner","earn a byliner","a prominent byliner","a coveted byliner"],"synonyms":["signature","credit","author's name"],"antonyms":["anonymous article","unsigned article"]},{"part_of_speech":"noun","definition":"署名記事を書く記者、署名記事を多く書く人","english_definition":"A journalist or writer who regularly writes articles with their name printed alongside them.","examples":[{"sentence":"He's a well-known byliner in the political section.","translation":"彼は政治欄でよく知られた署名記事を書く記者だ。"},{"sentence":"The magazine relies on experienced byliners to attract readers.","translation":"その雑誌は読者を引きつけるために経験豊富な署名記事を書く人に頼っている。"},{"sentence":"She's a rising byliner in the world of investigative journalism.","translation":"彼女は調査報道の世界で頭角を現している署名記事を書く記者だ。"}],"collocations":["a famous byliner","a respected byliner","a seasoned byliner","a rising byliner"],"synonyms":["columnist","reporter","journalist","writer"],"antonyms":["anonymous writer"]}],"etymology":{"value":"'By-' (near, beside) + 'line' (a line of text). Refers to the line 'by [author's name]' printed with an article.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbaɪˌlaɪnər/","syllables":"by-lin-er"},"inflection":{"noun_plural":"byliners"},"usage_notes":{"explanation":"The term 'byliner' has two closely related meanings: the line of text that gives the author's name, and the journalist who writes articles with their name attached. The context usually makes it clear which meaning is intended. It is often used in discussions about journalism, writing, and media.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a byline article.","correct":"✓ He wrote a byliner. / ✓ He wrote an article with a byline.","note":"'Byliner' is the noun, not an adjective. You can't write a 'byline article'. Instead, use 'byliner' as a noun, or say 'an article with a byline'."},{"incorrect":"✗ She's a byliner for her blog posts.","correct":"✓ She includes her name as the author of her blog posts.","note":"While technically correct, 'byliner' is more commonly used in the context of journalism and formal publications, not personal blogs. Using a more general description might be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["byline (noun: the line of text giving the author's name)"],"phrases":["op-ed (opposite the editorial page; an opinion article)","masthead (the title of a newspaper or magazine)","attribution (giving credit to the source of information)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. Used primarily in contexts related to journalism and publishing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Byliner' is a word primarily used in the context of journalism and publishing. It refers either to the line of text that states the author's name on an article, or to the journalist who writes articles with their name attached. Understanding this word requires familiarity with the structure and conventions of news media. It is not a common word in everyday conversation."},"example_sentences":[{"sentence":"The young reporter was thrilled to see her first **byliner** in the national newspaper.","translation":"その若い記者は全国紙に初めて自分の署名記事が載ったのを見て感激した。","type":"noun","meaning_category":"署名記事"},{"sentence":"As a seasoned **byliner**, she had a strong following of readers who trusted her reporting.","translation":"ベテランの署名記事記者として、彼女には自分の報道を信頼する読者の強い支持があった。","type":"noun","meaning_category":"署名記事を書く記者"},{"sentence":"Getting a **byliner** on the front page is a major accomplishment for any journalist.","translation":"一面に署名記事を載せることは、どのジャーナリストにとっても大きな功績だ。","type":"noun","meaning_category":"署名記事"},{"sentence":"The magazine hired several new **byliners** to expand its coverage of international affairs.","translation":"その雑誌は国際情勢の報道を拡大するために数人の新しい署名記事記者を雇った。","type":"noun","meaning_category":"署名記事を書く記者"},{"sentence":"Her **byliner** appeared above a hard-hitting exposé on government corruption.","translation":"彼女の署名記事は政府の汚職に関する痛烈な暴露記事の上に掲載された。","type":"noun","meaning_category":"署名記事"}]}