{"word":"avidez","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(医学)アビディティー、親和力","english_definition":"(medicine) avidity, the overall strength of binding between an antibody and an antigen; it is related to both the affinity between the binding sites and antigen and the valencies of the antibody and antigen.","examples":[{"sentence":"The avidity of the antibody was measured using an ELISA assay.","translation":"抗体のアビディティーはELISAアッセイを用いて測定された。"},{"sentence":"High avidity antibodies are generally more effective at neutralizing pathogens.","translation":"アビディティーの高い抗体は、一般的に病原体を中和するのに効果的である。"}],"collocations":["antibody avidity","high avidity","low avidity","avidity assay","measure avidity"],"synonyms":["binding strength","functional affinity","binding affinity"],"antonyms":[]}],"etymology":{"value":"Derived from 'avid', meaning eager or greedy, reflecting the strong binding desire of the antibody to the antigen.","priority":"N/A"},"pronunciation":{"ipa":"/əˈvɪdɪtiː/","syllables":"a-vid-i-ty"},"inflection":{"noun_plural":"avidities"},"usage_notes":{"explanation":"In immunology, avidity refers to the overall strength of the antibody-antigen complex. It's not just about how well a single binding site interacts (affinity), but also how many binding sites there are and how they work together. High avidity antibodies are generally more effective in fighting off infections.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["avid (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in scientific and medical contexts.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Avidity' is a technical term primarily used in immunology and related fields. It refers to the overall binding strength between an antibody and an antigen, taking into account both the affinity of individual binding sites and the number of binding sites involved. Understanding this term requires a background in immunology or a related scientific discipline."},"example_sentences":[{"sentence":"The test measures the avidity of IgG antibodies to rubella virus.","translation":"この検査は、風疹ウイルスに対するIgG抗体のアビディティーを測定する。","type":"noun","meaning_category":"親和力"},{"sentence":"Avidity maturation is a process that improves the antibody response over time.","translation":"アビディティー成熟は、時間の経過とともに抗体応答を改善するプロセスである。","type":"noun","meaning_category":"親和力"}]}