{"word":"non-militants","meanings":[{"part_of_speech":"noun","definition":"非戦闘員、非軍事活動家","english_definition":"People who are not involved in fighting or military activities; individuals who do not support or engage in aggressive or violent actions for political or social goals.","examples":[{"sentence":"The organization focuses on supporting non-militants affected by the conflict.","translation":"その組織は、紛争の影響を受けた非戦闘員の支援に重点を置いています。"},{"sentence":"Efforts are being made to distinguish between militants and non-militants in the region.","translation":"その地域では、戦闘員と非戦闘員を区別する取り組みが行われています。"},{"sentence":"The peace talks aim to protect the rights of non-militants.","translation":"和平交渉は、非戦闘員の権利を保護することを目的としています。"}],"collocations":["support non-militants","protect non-militants","distinguish between militants and non-militants","rights of non-militants","aid to non-militants"],"synonyms":["civilians","non-combatants","peaceful citizens","non-violent individuals"],"antonyms":["militants","combatants","fighters","soldiers"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to 'militants'. 'Militant' comes from the Latin word 'militans', the present participle of 'militare', meaning 'to serve as a soldier'. Therefore, 'non-militants' literally means 'not serving as a soldier' or 'not engaging in militant activities'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈmɪlɪtənts/","syllables":"non-mil-i-tants"},"inflection":{"noun_plural":"non-militants"},"usage_notes":{"explanation":"The term 'non-militants' is used to differentiate between those who are actively involved in violent or aggressive actions (militants) and those who are not. It is often used in the context of conflicts, political movements, or social activism to distinguish between those who use violence and those who do not. The term is important for legal, ethical, and humanitarian reasons, as non-militants are generally afforded greater protection under international law and ethical considerations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-militant group used violence.","correct":"✓ The non-militant group advocated for peaceful solutions.","note":"Non-militant groups, by definition, do not use violence. Using 'non-militant' and 'violence' in the same context is contradictory."},{"incorrect":"✗ All people in the region are non-militants.","correct":"✓ There are both militants and non-militants in the region.","note":"Assuming everyone in a conflict zone is a non-militant is inaccurate. It's important to recognize that both groups may be present."}],"priority":"★★☆"},"related_words":{"derivatives":["non-militant (adjective)","militant (noun, adjective)","militarism (noun)"],"antonyms":["militant","combatant","belligerent"],"related_concepts":["civilian protection","humanitarian law","conflict resolution","peacebuilding","non-violence"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, used in specific contexts related to conflict and activism.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-militants' refers to people who are not involved in fighting or using violence, especially in political or social conflicts. It's a term used to distinguish them from 'militants,' who are actively engaged in aggressive actions. The word is often used in discussions about war, terrorism, or social movements where it's important to differentiate between those who are peaceful and those who are not. Understanding this term is crucial for comprehending complex issues related to conflict and human rights.","priority":"★★☆"},"example_sentences":[{"sentence":"The aid organization provided food and shelter to the **non-militants** displaced by the war.","translation":"その援助団体は、戦争によって家を失った非戦闘員に食料と住居を提供しました。","type":"noun","meaning_category":"people not involved in fighting"},{"sentence":"It is crucial to protect **non-militants** during armed conflicts.","translation":"武力紛争中に非戦闘員を保護することが重要です。","type":"noun","meaning_category":"people not involved in fighting"},{"sentence":"The government is working to ensure the safety of **non-militants** in the region.","translation":"政府は、その地域の非戦闘員の安全を確保するために取り組んでいます。","type":"noun","meaning_category":"people not involved in fighting"}]}