{"word":"Zionism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"シオニズム：ユダヤ人の民族自決権を支持し、イスラエルをユダヤ人のための国家として建設・維持しようとする運動、またはそのイデオロギー。","english_definition":"A political movement and ideology that supports the establishment and development of a Jewish state in the historical Land of Israel (roughly corresponding to modern-day Israel, the West Bank, and Gaza).","examples":[{"sentence":"Zionism emerged in the late 19th century as a response to antisemitism in Europe.","translation":"シオニズムは、19世紀後半にヨーロッパにおける反ユダヤ主義への対応として登場した。"},{"sentence":"Modern Zionism is concerned with the security and well-being of the State of Israel.","translation":"現代のシオニズムは、イスラエルの安全と福祉に関心を寄せている。"},{"sentence":"There are various forms of Zionism, ranging from secular to religious.","translation":"シオニズムには、世俗的なものから宗教的なものまで、さまざまな形態がある。"}],"collocations":["political Zionism (政治的シオニズム)","religious Zionism (宗教的シオニズム)","cultural Zionism (文化的シオニズム)","labor Zionism (労働シオニズム)","anti-Zionism (反シオニズム)"],"synonyms":["Jewish nationalism","Israelism"],"antonyms":["anti-Zionism","post-Zionism"]},{"part_of_speech":"noun","definition":"シオニズム支持、シオニストの主義。","english_definition":"Support for the state of Israel.","examples":[{"sentence":"He expressed his strong Zionism by actively participating in pro-Israel organizations.","translation":"彼は親イスラエル団体に積極的に参加することで、強いシオニズムの意思を表明した。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term \"Zionism\" was coined in 1890 by Nathan Birnbaum, derived from \"Zion,\" a biblical term referring to Jerusalem and the Land of Israel.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈzaɪənɪzəm/","syllables":"Zi-on-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Zionism is a complex and often controversial topic. It encompasses a wide range of views and approaches regarding the establishment and nature of a Jewish state. It is important to distinguish between Zionism as a historical movement and contemporary political debates surrounding Israel.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Zionism is only a religious movement.","correct":"✓ Zionism is a political and ideological movement with religious dimensions for some adherents.","note":"While some forms of Zionism are religiously motivated, it is primarily a political and national movement."},{"incorrect":"✗ All Jews are Zionists.","correct":"✓ Not all Jews are Zionists; there is a diversity of views on Zionism within the Jewish community.","note":"There are Jews who oppose Zionism or have differing views on its implementation."}],"priority":"★★☆"},"related_words":{"derivatives":["Zionist (noun/adjective)","Zionistically (adverb)","anti-Zionism (noun)","anti-Zionist (noun/adjective)"],"phrasal_verbs":null,"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency, but important in political and historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Understanding \"Zionism\" requires knowledge of history, politics, and ideology. It is a term often used in discussions about the Middle East and Jewish identity. The term itself can be emotionally charged, so it's important to approach discussions about Zionism with sensitivity and awareness of different perspectives."},"example_sentences":[{"sentence":"The early pioneers of Zionism sought to create agricultural settlements in Palestine.","translation":"シオニズムの初期の開拓者たちは、パレスチナに農業入植地を建設しようとした。","type":"noun","meaning_category":"運動・イデオロギー"},{"sentence":"His views on the Israeli-Palestinian conflict are heavily influenced by his Zionism.","translation":"彼のイスラエル・パレスチナ紛争に対する見解は、彼のシオニズムに大きく影響されている。","type":"noun","meaning_category":"支持・主義"}]}