{"word":"deprostrate","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)をうつ伏せの状態から起こす、(人)を謙譲の姿勢から立ち上がらせる","english_definition":"To raise (someone) from a prostrate position; to cause (someone) to rise from a humble or submissive posture.","examples":[{"sentence":"The king deprostrated the kneeling knight, signaling his forgiveness.","translation":"王はひざまずく騎士を立ち上がらせ、許しを示した。"},{"sentence":"After the ceremony, the priest deprostrated the worshippers.","translation":"儀式の後、司祭は信者たちをうつ伏せの状態から起こした。"}],"collocations":["deprostrate someone from the ground","deprostrate a supplicant"],"synonyms":["raise","elevate","lift up","stand up"],"antonyms":["prostrate","lay down","abase","humble"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(物)をうつ伏せの状態から立て直す","english_definition":"To restore (something) to an upright position from a prostrate or fallen state.","examples":[{"sentence":"They deprostrated the fallen statue after the storm.","translation":"彼らは嵐の後、倒れた像を立て直した。"}],"collocations":["deprostrate a statue","deprostrate a fallen object"],"synonyms":["restore","re-erect","set upright"],"antonyms":["overturn","topple","fell"]}],"etymology":{"value":"Formed from the prefix 'de-' (meaning 'from' or 'remove') and 'prostrate' (meaning 'lying face down').","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈprɒstreɪt/","syllables":"de-pros-trate"},"inflection":{"verb_forms":{"present_simple":["deprostrate","deprostrates"],"past_simple":"deprostrated","past_participle":"deprostrated","present_participle":"deprostrating"}},"usage_notes":{"explanation":"'Deprostrate' is a relatively rare and formal word. It is most often used in religious or ceremonial contexts to describe the act of raising someone from a prostrate position, which is a posture of submission or reverence. It can also be used more generally to describe restoring something to an upright position.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor deprostrated the patient on the table.","correct":"✓ The doctor positioned the patient on the table.","note":"'Deprostrate' implies raising someone from a prostrate position, not placing them in one. Use 'positioned' or 'placed' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["deprostration (noun): The act of deprostrating or the state of being deprostrated.","prostrate (verb/adjective): To lay oneself face down in humility or submission; lying face down.","prostration (noun): The act of prostrating oneself; a state of exhaustion or submission."],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Deprostrate' is a formal and uncommon word, primarily used in specific contexts such as religious ceremonies or historical descriptions. It means to raise someone from a prostrate position (lying face down) or to restore something to an upright position. Due to its rarity and specific usage, it is not typically encountered in everyday language."},"example_sentences":[{"sentence":"The priest deprostrated the initiate after the vows were spoken.","translation":"司祭は誓いが述べられた後、入門者をうつ伏せの状態から起こした。","type":"verb","meaning_category":"うつ伏せの状態から起こす"},{"sentence":"Workers carefully deprostrated the ancient column, ensuring it wasn't damaged further.","translation":"作業員たちは古代の円柱を慎重に立て直し、それ以上の損傷がないようにした。","type":"verb","meaning_category":"立て直す"}]}