{"word":"Sphingids","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"スズメガ (蛾の一種)","english_definition":"A family of moths (Sphingidae) characterized by their large size, streamlined bodies, narrow wings, and ability to hover while feeding on nectar.","examples":[{"sentence":"The Sphingids are known for their strong flight and nocturnal habits.","translation":"スズメガは、その強い飛行能力と夜行性で知られています。"},{"sentence":"Many Sphingids have long proboscises for reaching nectar deep inside flowers.","translation":"多くのスズメガは、花の奥深くの蜜に届くための長い口吻を持っています。"}],"collocations":["hawk moth","hummingbird moth","sphinx moth","nectar feeding","nocturnal moth"],"synonyms":["hawk moth","sphinx moth"],"antonyms":[]},{"part_of_speech":"noun","definition":"スズメガの幼虫","english_definition":"The larvae of Sphingid moths, often characterized by a horn or spine at the posterior end.","examples":[{"sentence":"The Sphingids caterpillar can be a pest on certain plants.","translation":"スズメガの幼虫は、特定の植物にとって害虫となることがあります。"}],"collocations":["hornworm","tomato hornworm","manduca"],"synonyms":["hornworm"],"antonyms":[]}],"etymology":{"value":"Derived from the family name Sphingidae, which comes from the resemblance of some species' caterpillars to the Sphinx, due to their posture when disturbed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsfɪndʒɪdz/","syllables":"Sphin-gids"},"inflection":{"noun_plural":"Sphingids"},"usage_notes":{"explanation":"'Sphingids' refers to the family Sphingidae, encompassing various species of moths commonly known as hawk moths or sphinx moths. The term can also refer to the caterpillars of these moths, which are often called hornworms due to the presence of a horn-like projection on their posterior end.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Sphingid caterpillar with no horn.","correct":"✓ I saw a Sphingid caterpillar. (the horn is a common but not universal feature)","note":"While many Sphingid caterpillars have horns, not all do. So, saying 'a Sphingid caterpillar' is generally correct, even if the horn isn't visible. Describing the horn is additional information."}],"priority":"★☆☆"},"related_words":{"derivatives":["Sphingidae (family name)","hornworm (caterpillar)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sphingids' is a scientific term referring to a family of moths. Understanding this term requires familiarity with biological classifications and entomology. The term is primarily used in scientific contexts or by individuals with a specific interest in moths and insects."},"example_sentences":[{"sentence":"The diversity of Sphingids is remarkable, with species adapted to various habitats around the world.","translation":"スズメガの多様性は目覚ましく、世界中の様々な生息地に適応した種が存在します。","type":"noun","meaning_category":"moths"},{"sentence":"The tomato hornworm, a type of Sphingids caterpillar, can quickly defoliate tomato plants.","translation":"トマトホーンワームはスズメガの幼虫の一種で、トマトの葉をすぐに食べ尽くすことがあります。","type":"noun","meaning_category":"caterpillar"}]}