{"word":"disconnector","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(電気) 断路器、遮断器","english_definition":"A switch used to isolate a circuit or piece of equipment from a power source. It is designed to be opened only after the current has been interrupted by other means.","examples":[{"sentence":"The technician used a disconnector to safely isolate the transformer before performing maintenance.","translation":"技術者は、メンテナンスを行う前に、断路器を使用して変圧器を安全に隔離しました。"},{"sentence":"Disconnectors are essential for ensuring the safety of personnel working on electrical systems.","translation":"断路器は、電気システムで作業する人員の安全を確保するために不可欠です。"},{"sentence":"The disconnector switch was clearly labeled to prevent accidental operation.","translation":"断路器のスイッチには、誤操作を防ぐために明確なラベルが貼られていました。"}],"collocations":["operate a disconnector","install a disconnector","test a disconnector","high-voltage disconnector","grounding disconnector"],"synonyms":["isolator","isolating switch","disconnect switch"],"antonyms":["connector","circuit breaker (in some contexts)"]},{"part_of_speech":"noun","definition":"(一般的な意味) 分離するもの、切り離すもの","english_definition":"Something that disconnects or separates.","examples":[{"sentence":"The new policy acted as a disconnector between the company and its employees.","translation":"新しいポリシーは、会社と従業員を切り離すものとして機能しました。"},{"sentence":"Lack of communication can be a disconnector in any relationship.","translation":"コミュニケーション不足は、あらゆる関係において分離要因となりえます。"}],"collocations":["social disconnector","emotional disconnector"],"synonyms":["separator","divider","isolator"],"antonyms":["connector","linker","integrator"]}],"etymology":{"value":"The word 'disconnector' is formed by adding the prefix 'dis-' (meaning 'apart' or 'away') to the word 'connector'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪskəˈnɛktər/","syllables":"dis-con-nec-tor"},"inflection":{"noun_plural":"disconnectors"},"usage_notes":{"explanation":"The term 'disconnector' primarily refers to a specific type of electrical switch used for isolating circuits. It's crucial to understand that a disconnector is not designed to interrupt current; it's only operated after the current has been stopped by a circuit breaker or other interrupting device. In a more general sense, 'disconnector' can refer to anything that separates or isolates.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The disconnector tripped and shut off the power.","correct":"✓ The circuit breaker tripped and shut off the power.","note":"Disconnectors are not designed to trip or interrupt current. Circuit breakers perform this function."},{"incorrect":"✗ Use the disconnector to turn off the power.","correct":"✓ Use the circuit breaker to turn off the power, then use the disconnector to isolate the circuit.","note":"Disconnectors should only be operated after the circuit is de-energized."}],"priority":"★★☆"},"related_words":{"derivatives":["disconnect (verb)","disconnection (noun)","connector (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2 (technical contexts)","frequency_google_ngram":"Low frequency (primarily used in technical fields)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Disconnector' is a technical term primarily used in electrical engineering. It refers to a switch that isolates a circuit or equipment from a power source. It's important to note that disconnectors are not designed to interrupt current; they are used for isolation purposes after the current has been stopped by other devices like circuit breakers. In a more general sense, it can refer to anything that separates or disconnects, but this usage is less common."},"example_sentences":[{"sentence":"The electrician opened the **disconnector** to safely work on the power lines.","translation":"電気技師は、電線で安全に作業するために断路器を開けました。","type":"noun","meaning_category":"(電気) 断路器"},{"sentence":"A lack of trust can be a significant **disconnector** in a team environment.","translation":"信頼の欠如は、チーム環境において重大な分離要因となりえます。","type":"noun","meaning_category":"(一般的な意味) 分離するもの"}]}