{"word":"schizocyte","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"分裂赤血球、破砕赤血球","english_definition":"A fragmented red blood cell; a red blood cell that has been damaged or broken apart.","examples":[{"sentence":"The presence of schizocytes in a blood smear can indicate microangiopathic hemolytic anemia.","translation":"血液塗抹標本中の分裂赤血球の存在は、微小血管症性溶血性貧血を示唆する可能性がある。"}],"collocations":["schizocyte count (分裂赤血球数)","schizocyte formation (分裂赤血球形成)","peripheral blood smear schizocytes (末梢血塗抹標本分裂赤血球)"],"synonyms":["fragmented red cell","helmet cell"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「schizo-」（分裂）と「-cyte」（細胞）の組み合わせに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskɪzəˌsaɪt/","syllables":"skiz-o-cyte"},"inflection":{"noun_plural":"schizocytes"},"usage_notes":{"explanation":"Schizocytes are abnormal red blood cell fragments. Their presence in a peripheral blood smear is a significant finding that can indicate various underlying medical conditions, particularly those involving microangiopathic hemolytic anemia (MAHA). MAHA is characterized by the destruction of red blood cells as they pass through damaged or narrowed blood vessels. The mechanical trauma causes the red blood cells to fragment, resulting in the formation of schizocytes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Schistocyte is the same as schizocyte.","correct":"✓ Schizocyte is the correct term for a fragmented red blood cell.","note":"While 'schistocyte' is sometimes used interchangeably, 'schizocyte' is the preferred and more accurate term for a fragmented red blood cell."}],"priority":"☆☆☆"},"related_words":{"derivatives":["schistocyte (関連用語として使用されることがあるが、厳密には異なる)","hemolysis (溶血)","anemia (貧血)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 医学用語","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"A **schizocyte** is a fragmented red blood cell, often observed in blood smears. Its presence typically indicates microangiopathic hemolytic anemia (MAHA), a condition where red blood cells are damaged as they pass through small, damaged blood vessels. The term is derived from Greek roots, signifying 'split cell.' While sometimes used interchangeably with 'schistocyte,' 'schizocyte' is the more accurate term. Its identification is crucial in diagnosing certain medical conditions.","priority":"★★☆"},"example_sentences":[{"sentence":"The pathologist identified numerous schizocytes in the patient's blood sample.","translation":"病理医は患者の血液サンプル中に多数の分裂赤血球を確認した。","type":"medical","meaning_category":"分裂赤血球"},{"sentence":"Elevated schizocyte counts can be a sign of thrombotic thrombocytopenic purpura (TTP).","translation":"分裂赤血球数の増加は、血栓性血小板減少性紫斑病（TTP）の兆候である可能性がある。","type":"medical","meaning_category":"分裂赤血球"}]}