{"word":"alignment-sensitive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"配置に敏感な、アライメントに依存する","english_definition":"Describing something whose functionality or performance is significantly affected by the precision of its alignment or arrangement.","examples":[{"sentence":"This optical instrument is highly alignment-sensitive; even slight misalignments can degrade its performance.","translation":"この光学機器は配置に非常に敏感であり、わずかなずれでも性能が低下する可能性があります。"},{"sentence":"The success of the experiment is alignment-sensitive, requiring careful calibration of the components.","translation":"実験の成功はアライメントに依存しており、コンポーネントの慎重な校正が必要です。"},{"sentence":"The manufacturing process for these microchips is alignment-sensitive, demanding high precision equipment.","translation":"これらのマイクロチップの製造プロセスは配置に敏感であり、高精度の機器が必要です。"}],"collocations":["highly alignment-sensitive","extremely alignment-sensitive","alignment-sensitive system","alignment-sensitive component","alignment-sensitive process"],"synonyms":["position-dependent","orientation-dependent","placement-sensitive","calibration-dependent"],"antonyms":["alignment-insensitive","alignment-tolerant","robust","insensitive to misalignment"]}],"etymology":{"value":"Formed by combining 'alignment' (the state of being in proper relative position) with 'sensitive' (easily affected or influenced). The hyphen connects the two words to create a compound adjective.","priority":"N/A"},"pronunciation":{"ipa":"/əˈlaɪnmənt ˈsɛnsətɪv/","syllables":"a-lign-ment sen-si-tive"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms, which are less common for compound adjectives like this one. More often, 'more alignment-sensitive' and 'most alignment-sensitive' would be used."},"usage_notes":{"explanation":"'Alignment-sensitive' is used to describe systems, processes, or components where the correct relative positioning of parts is crucial for proper function. It implies that even small deviations from the ideal alignment can lead to significant performance degradation or failure. This term is commonly used in fields such as optics, engineering, and manufacturing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The machine is alignment sensitive.","correct":"✓ The machine is alignment-sensitive.","note":"The hyphen is important to show that 'alignment' and 'sensitive' are combined to form a single adjective modifying 'machine'."},{"incorrect":"✗ The alignment-sensitive of the device is high.","correct":"✓ The alignment sensitivity of the device is high.","note":"'Alignment-sensitive' is an adjective. To refer to the degree to which something is sensitive to alignment, use the noun 'alignment sensitivity'."}],"priority":"★★☆"},"related_words":{"derivatives":["alignment sensitivity (noun)"],"phrasal_verbs":[],"related_terms":["alignment","sensitive","calibration","precision","tolerance"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Alignment-sensitive' is a technical term used to describe something that is easily affected by how well its parts are lined up or positioned. If something is alignment-sensitive, it means that even small errors in alignment can cause problems with how it works. This term is often used in engineering, optics, and manufacturing where precise positioning is important. Understanding this term requires some familiarity with technical concepts related to precision and calibration."},"example_sentences":[{"sentence":"The laser system is highly alignment-sensitive and requires careful setup.","translation":"そのレーザーシステムは配置に非常に敏感であり、慎重なセットアップが必要です。","type":"adjective","meaning_category":"アライメントに依存する"},{"sentence":"The effectiveness of the sensor is alignment-sensitive, so it must be precisely positioned.","translation":"センサーの有効性はアライメントに依存するため、正確に配置する必要があります。","type":"adjective","meaning_category":"配置に敏感な"},{"sentence":"Due to the alignment-sensitive nature of the device, regular calibration is necessary.","translation":"デバイスの配置に敏感な性質のため、定期的な校正が必要です。","type":"adjective","meaning_category":"アライメントに依存する"}]}