{"word":"cranioplasty","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"頭蓋形成術、頭蓋骨修復術","english_definition":"surgical repair of a defect or deformity of the skull.","examples":[{"sentence":"The patient underwent cranioplasty to repair the skull defect.","translation":"患者は頭蓋骨の欠損を修復するために頭蓋形成術を受けた。"},{"sentence":"Cranioplasty can improve both the appearance and the function of the skull.","translation":"頭蓋形成術は、頭蓋骨の外観と機能の両方を改善することができる。"}],"collocations":["perform cranioplasty (頭蓋形成術を行う)","undergo cranioplasty (頭蓋形成術を受ける)","cranioplasty procedure (頭蓋形成術)","titanium cranioplasty (チタン製頭蓋骨修復術)"],"synonyms":["skull repair","craniofacial reconstruction"],"antonyms":[]}],"etymology":{"value":"From 'cranio-' (referring to the skull) + '-plasty' (surgical repair).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkreɪniəˌplæsti/","syllables":"cra-ni-o-plas-ty"},"inflection":{"noun_plural":"cranioplasties"},"usage_notes":{"explanation":"Cranioplasty is a surgical procedure performed to repair defects or deformities in the skull. These defects can arise from trauma, previous surgeries (such as craniectomy), infections, or congenital conditions. The procedure typically involves using a bone graft, a synthetic material (like titanium or acrylic), or the patient's own bone to reconstruct the missing or damaged portion of the skull. The goals of cranioplasty are to protect the brain, restore the skull's natural contour, and improve neurological function and cosmetic appearance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor did a cranioplast.","correct":"✓ The doctor performed a cranioplasty.","note":"'Cranioplasty' is the name of the procedure, not the object. Use 'perform' or 'did a cranioplasty procedure'."},{"incorrect":"✗ Cranioplasty is for brain surgery.","correct":"✓ Cranioplasty is for skull repair.","note":"Cranioplasty focuses on repairing the skull, not directly on brain surgery, although it can protect the brain."}],"priority":"★★☆"},"related_words":{"derivatives":["cranium (skull)","craniectomy (surgical removal of part of the skull)","craniofacial (relating to the skull and face)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cranioplasty' is a specialized medical term referring to the surgical repair of skull defects or deformities. The procedure aims to restore the skull's protective function and aesthetic appearance. It is typically performed by neurosurgeons or craniofacial surgeons. Understanding this term requires familiarity with medical terminology related to the skull and surgical procedures."},"example_sentences":[{"sentence":"Following the traumatic brain injury, the patient required a cranioplasty to replace the missing section of skull.","translation":"外傷性脳損傷の後、患者は頭蓋骨の欠損部分を置き換えるために頭蓋形成術を必要とした。","type":"medical","meaning_category":"頭蓋形成術"},{"sentence":"The neurosurgeon explained the risks and benefits of cranioplasty to the patient and their family.","translation":"脳神経外科医は、患者とその家族に頭蓋形成術のリスクと利点を説明した。","type":"medical","meaning_category":"頭蓋形成術"}]}