{"word":"Esquimau","priority":"低","meanings":[{"part_of_speech":"noun","definition":"エスキモー (現在では差別的とみなされることがある)","english_definition":"(now often considered offensive) a member of an indigenous people inhabiting northern Canada, Alaska, Greenland, and eastern Siberia, traditionally living by hunting and fishing.","examples":[{"sentence":"The term Esquimau is sometimes used to refer to Inuit and Yupik peoples.","translation":"「Esquimau」という言葉は、イヌイットやユピックの人々を指すために使われることがあります。"},{"sentence":"Many prefer to be called Inuit rather than Esquimau.","translation":"多くの人々は、Esquimauと呼ばれるよりもイヌイットと呼ばれることを好みます。"}],"collocations":[],"synonyms":["Inuit","Yupik"],"antonyms":[],"notes":"The term 'Esquimau' is considered offensive by some Inuit and Yupik people, who prefer to be called Inuit or Yupik. Use with caution.","usage":"The term is falling out of favor due to its potentially offensive nature.","alternatives":["Inuit","Yupik"]}],"etymology":{"value":"由来は明らかではありませんが、アルゴンキン語族の言語に由来すると考えられています。おそらく「スノーシューを作る人」または「生肉を食べる人」を意味する言葉から来ている可能性があります。しかし、その語源については論争があり、一部の人々はその語源が侮辱的であると考えています。","priority":"中"},"pronunciation":{"ipa":"/ˈɛskɪməʊ/","syllables":"Es-qui-mau"},"inflection":{"noun_plural":"Esquimaux or Esquimau"},"usage_notes":{"explanation":"「Esquimau」という言葉は、かつてはカナダ北部、アラスカ、グリーンランド、シベリア東部に住む先住民族を指す一般的な用語でしたが、現在では差別的であると見なされることが多くなっています。多くのイヌイットやユピックの人々は、この言葉を侮辱的であると感じており、代わりに「イヌイット」または「ユピック」と呼ばれることを好みます。そのため、「Esquimau」という言葉の使用は避けるべきであり、代わりに適切な民族名を使用することが推奨されます。","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"✗ All Esquimaux live in igloos.","correct":"✓ Some Inuit people live in igloos.","note":"Esquimauという言葉自体を避けるべきです。イグルーに住むのは一部のイヌイットの人々です。"},{"incorrect":"✗ It's okay to use the term Esquimau.","correct":"✓ It's generally better to use the term Inuit or Yupik.","note":"Esquimauという言葉は避けるべきです。"}],"priority":"高"},"related_words":{"derivatives":[],"related_terms":["Inuit","Yupik","Aleut"],"priority":"高"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"比較的低い","priority":"低"},"readability_explanation":{"level":"C1","text":"「Esquimau」は、かつて北極圏に住む先住民族を指すために使われた言葉ですが、現在では差別的であると見なされることが多いため、使用は避けるべきです。代わりに「イヌイット」または「ユピック」という言葉を使用することが推奨されます。この言葉の歴史的背景と、なぜ不適切と見なされるのかを理解することが重要です。"},"example_sentences":[{"sentence":"The term 'Esquimau' is considered outdated and potentially offensive.","translation":"「Esquimau」という言葉は時代遅れであり、潜在的に侮辱的であると考えられています。","type":"説明","meaning_category":"差別的とみなされることがある"},{"sentence":"It's more respectful to refer to them as Inuit or Yupik.","translation":"彼らをイヌイットまたはユピックと呼ぶ方がより敬意を払っています。","type":"説明","meaning_category":"代替用語"}]}