{"word":"subcollegial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"大学レベルに満たない、または大学の基準に達していない","english_definition":"Not of college level or standard.","examples":[{"sentence":"The remedial courses were designed for students with subcollegial skills.","translation":"その補習コースは、大学レベルに満たないスキルを持つ学生のために設計された。"},{"sentence":"The curriculum was criticized for being subcollegial and not preparing students for higher education.","translation":"そのカリキュラムは、大学レベルに満たず、学生を高等教育の準備ができていないと批判された。"}],"collocations":["subcollegial skills","subcollegial curriculum","subcollegial level","subcollegial education"],"synonyms":["pre-collegiate","non-collegiate","remedial"],"antonyms":["collegiate","college-level"]}],"etymology":{"value":"\"sub-\" (下位の) + \"collegial\" (大学の)","priority":"★★★"},"pronunciation":{"ipa":"/sʌb.kəˈliː.dʒɪ.əl/","syllables":"sub-col-le-gi-al"},"inflection":{},"usage_notes":{"explanation":"\"Subcollegial\" is often used in educational contexts to describe work, skills, or programs that are below the expected level for college or university students. It implies a need for improvement or further development to meet collegiate standards.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["subcollege"],"related_terms":["collegiate","college"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word \"subcollegial\" is a technical term used in educational settings to describe something that is below the level expected for college or university work. It is not a commonly used word in everyday conversation. Understanding this word requires a good grasp of academic vocabulary."},"example_sentences":[{"sentence":"The writing samples revealed a subcollegial understanding of grammar and composition.","translation":"その作文サンプルは、文法と構成に関する大学レベルに満たない理解を示していた。","type":"adjective","meaning_category":"大学レベルに満たない"},{"sentence":"Many students enter college with subcollegial reading abilities, requiring them to take developmental courses.","translation":"多くの学生が大学レベルに満たない読解力で大学に入学するため、能力開発コースを受講する必要がある。","type":"adjective","meaning_category":"大学レベルに満たない"}]}