{"word":"remanence","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"残留磁気、残留分極","english_definition":"the magnetism remaining in a ferromagnetic substance after the magnetizing field has been removed. Also, the polarization remaining in a ferroelectric substance after the electric field has been removed.","examples":[{"sentence":"The remanence of the magnetic tape allows it to store data even when not powered.","translation":"磁気テープの残留磁気により、電源が入っていなくてもデータを保存できます。"},{"sentence":"High remanence is desirable in permanent magnets.","translation":"高い残留磁気は永久磁石において望ましい。"}],"collocations":["magnetic remanence","remanent magnetization","isothermal remanent magnetization (IRM)","anhysteretic remanent magnetization (ARM)","saturation remanence"],"synonyms":["residual magnetism","remanent magnetization","retentivity"],"antonyms":["coercivity","saturation magnetization"]},{"part_of_speech":"noun","definition":"(一般的に) 残留、残存","english_definition":"the state of remaining or being left over; a residue.","examples":[{"sentence":"There was a remanence of sadness in her eyes, even years after the event.","translation":"出来事から何年も経った後でも、彼女の目には悲しみの残滓があった。"},{"sentence":"The remanence of the old tradition was still visible in their customs.","translation":"古い伝統の残存は、彼らの習慣の中にまだ見られた。"}],"collocations":["remanence of a feeling","remanence of a memory","remanence of a tradition"],"synonyms":["residue","remainder","vestige","trace","survival"],"antonyms":["absence","disappearance"]}],"etymology":{"value":"From Latin *remanentia*, from *remanens*, present participle of *remanere* 'to remain'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛmənəns/","syllables":"rem-a-nence"},"inflection":{"noun_plural":"remanences"},"usage_notes":{"explanation":"'Remanence' primarily refers to the residual magnetism in ferromagnetic materials or residual polarization in ferroelectric materials. In a broader sense, it can refer to anything that remains or persists after something else has been removed or ceased. The term is most commonly used in physics, materials science, and engineering contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The remanence was very loud.","correct":"✓ The remanence was very strong.","note":"'Remanence' refers to a quantity or degree of something remaining, not a sound. Use 'strong', 'high', or similar adjectives to describe the level of remanence."},{"incorrect":"✗ The remanence of the food was delicious.","correct":"✓ The remains of the food were delicious.","note":"'Remanence' is not usually used to describe leftover food. Use 'remains' or 'leftovers' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["remanent (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Remanence' is a technical term primarily used in physics and materials science to describe the residual magnetism or polarization in certain materials. It can also be used more broadly to describe something that remains or persists. The term is not commonly used in everyday language and is more likely to be encountered in specialized contexts. Understanding the specific context is crucial for interpreting the meaning of 'remanence' correctly."},"example_sentences":[{"sentence":"The high remanence of the alloy made it suitable for use in permanent magnets.","translation":"その合金の高い残留磁気は、永久磁石での使用に適していた。","type":"technical","meaning_category":"残留磁気"},{"sentence":"The remanence of the trauma lingered in her dreams.","translation":"トラウマの残滓が彼女の夢に残り続けた。","type":"general","meaning_category":"残存"}]}