{"word":"Magnetofluiddynamics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"磁性流体力学","english_definition":"The study of the dynamics of electrically conducting fluids in the presence of magnetic fields.","examples":[{"sentence":"Magnetofluiddynamics is used to study the behavior of plasma in fusion reactors.","translation":"磁性流体力学は、核融合炉におけるプラズマの挙動を研究するために使用されます。"},{"sentence":"The equations of magnetofluiddynamics combine the Navier-Stokes equations of fluid dynamics with Maxwell's equations of electromagnetism.","translation":"磁性流体力学の方程式は、流体力学のナビエ-ストークス方程式と電磁気学のマクスウェル方程式を組み合わせたものです。"}],"collocations":["MHD generator (MHD発電機)","MHD instability (MHD不安定性)","MHD simulation (MHDシミュレーション)"],"synonyms":["MHD","hydromagnetics"],"antonyms":[]}],"etymology":{"value":"The term is a combination of 'magneto-' (referring to magnetic fields), 'fluid' (referring to fluids), and 'dynamics' (referring to the study of motion).","priority":"★★☆"},"pronunciation":{"ipa":"/maɡˌniːtoʊˌfluːɪd daɪˈnæmɪks/","syllables":"mag-ne-to-flu-id dy-na-mics"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Magnetofluiddynamics (MHD) is a complex field that studies the interaction between magnetic fields and electrically conducting fluids, such as plasmas, liquid metals, and electrolytes. It is used in astrophysics, geophysics, engineering, and other fields to understand and model various phenomena.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Magnetofluiddynamic is a fascinating subject.","correct":"✓ Magnetofluiddynamics is a fascinating subject.","note":"Magnetofluiddynamics is a field of study, and the name itself is plural in form, even though it refers to a singular subject."}],"priority":"★★☆"},"related_words":{"derivatives":["magnetofluid (名詞: 磁性流体)"],"phrasal_verbs":[],"related_terms":["plasma physics","fluid dynamics","electromagnetism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Magnetofluiddynamics is a highly specialized term used in physics and engineering. It describes the study of how magnetic fields affect fluids that can conduct electricity. This field combines principles from fluid dynamics and electromagnetism to understand complex phenomena in plasmas, liquid metals, and other conductive fluids. It's a term typically encountered in advanced scientific contexts."},"example_sentences":[{"sentence":"The researchers used magnetofluiddynamics to model the behavior of the solar wind.","translation":"研究者たちは、太陽風の挙動をモデル化するために磁性流体力学を使用しました。","type":"noun","meaning_category":"field of study"},{"sentence":"The magnetofluiddynamics equations are complex and often require numerical solutions.","translation":"磁性流体力学の方程式は複雑で、数値解を必要とすることがよくあります。","type":"noun","meaning_category":"equations"}]}