{"word":"self-witness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己証言、自己観察、自己認識","english_definition":"The act or capacity of observing and reflecting on one's own thoughts, feelings, and experiences. It involves a detached awareness of oneself and one's internal states.","examples":[{"sentence":"Through meditation, he developed a strong sense of self-witness, allowing him to observe his thoughts without judgment.","translation":"瞑想を通して、彼は強い自己証言の感覚を養い、自分の思考を判断せずに観察することができた。"},{"sentence":"The therapist encouraged her to cultivate self-witness as a way to understand her emotional triggers.","translation":"セラピストは、彼女が感情的な引き金を理解する方法として、自己証言を育むように勧めました。"},{"sentence":"Self-witness involves stepping back from your immediate experience and observing it as if you were an outside observer.","translation":"自己証言とは、直接的な経験から一歩引き、まるで外部の観察者のようにそれを観察することです。"}],"collocations":["cultivate self-witness (自己証言を育む)","develop self-witness (自己証言を発達させる)","practice self-witness (自己証言を実践する)","sense of self-witness (自己証言の感覚)","detached self-witness (客観的な自己証言)"],"synonyms":["self-observation","self-awareness","introspection","mindfulness","reflective awareness"],"antonyms":["self-absorption","self-oblivion","unawareness","impulsivity"]},{"part_of_speech":"verb","definition":"自己証言する、自己観察する","english_definition":"To observe and reflect on one's own thoughts, feelings, and experiences.","examples":[{"sentence":"She learned to self-witness during moments of anxiety, which helped her manage her panic attacks.","translation":"彼女は不安な瞬間に自己証言することを学び、それがパニック発作を管理するのに役立った。"},{"sentence":"By self-witnessing, he gained a deeper understanding of his motivations and behaviors.","translation":"自己証言することによって、彼は自分の動機と行動についてより深い理解を得た。"},{"sentence":"It's important to self-witness without judgment, simply observing what arises in your mind.","translation":"判断せずに自己証言することが重要であり、単に心に浮かぶものを観察するだけです。"}],"collocations":["self-witness thoughts (思考を自己証言する)","self-witness feelings (感情を自己証言する)","self-witness experiences (経験を自己証言する)","self-witness without judgment (判断せずに自己証言する)"],"synonyms":["self-observe","reflect on oneself","introspect","be mindful of oneself"],"antonyms":["be self-absorbed","be oblivious to oneself","act impulsively"]}],"etymology":{"value":"A compound word formed from \"self\" (referring to oneself) and \"witness\" (to observe or attest). The concept draws from psychological and philosophical traditions emphasizing self-awareness and detached observation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˈwɪtnəs/","syllables":"self-wit-ness"},"inflection":{"noun_plural":"self-witnesses","verb_forms":{"present_simple":["self-witness","self-witnesses"],"past_simple":"self-witnessed","past_participle":"self-witnessed","present_participle":"self-witnessing"}},"usage_notes":{"explanation":"\"Self-witness\" refers to the ability to observe one's own thoughts and feelings from a detached perspective. It's a key concept in mindfulness and self-awareness practices, often used in therapy and personal development. The goal is to observe without judgment, allowing for a clearer understanding of oneself. It can be used as both a noun (the act or capacity) and a verb (the act of observing).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good self-witnesser.","correct":"✓ He is good at self-witnessing.","note":"While \"self-witnesser\" might be understood, it's more common to say \"He is good at self-witnessing\" or \"He has a strong sense of self-witness.\""},{"incorrect":"✗ Self-witnessing is about judging yourself.","correct":"✓ Self-witnessing is about observing yourself without judgment.","note":"A key aspect of self-witness is non-judgmental observation. It's about noticing thoughts and feelings without labeling them as good or bad."}],"priority":"★★☆"},"related_words":{"derivatives":["self-aware","mindfulness","introspection","reflection","self-regulation"],"related_concepts":["mindfulness meditation","cognitive behavioral therapy (CBT)","dialectical behavior therapy (DBT)","emotional regulation","self-compassion"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Primarily used in psychological and philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Self-witness\" is a term used in psychology and philosophy to describe the ability to observe one's own thoughts and feelings from a detached perspective. It's about being aware of what's happening inside you without getting carried away by it. Think of it as watching your thoughts and emotions as if they were passing clouds. This skill is often developed through practices like mindfulness meditation and can be helpful for managing stress and understanding your own behavior.","priority":"★★☆"},"example_sentences":[{"sentence":"Through consistent practice, she developed the ability to **self-witness** her anxiety and prevent it from escalating.","translation":"一貫した実践を通して、彼女は自分の不安を**自己証言**し、エスカレートするのを防ぐ能力を開発しました。","type":"verb","meaning_category":"自己観察する"},{"sentence":"**Self-witness** allows you to observe your thoughts and emotions without getting caught up in them.","translation":"**自己証言**により、思考や感情に巻き込まれることなく観察できます。","type":"noun","meaning_category":"自己認識"},{"sentence":"The therapist taught him techniques for cultivating **self-witness** during stressful situations.","translation":"セラピストは、ストレスの多い状況で**自己証言**を育むためのテクニックを彼に教えました。","type":"noun","meaning_category":"自己認識"},{"sentence":"By learning to **self-witness**, you can gain a better understanding of your own patterns of behavior.","translation":"**自己証言**することを学ぶことで、あなた自身の行動パターンをよりよく理解することができます。","type":"verb","meaning_category":"自己観察する"}]}