{"word":"de-idealization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"脱理想化、理想化解除","english_definition":"The process of removing or reducing the idealized qualities or perceptions of someone or something; the act of ceasing to view someone or something as perfect or flawless.","examples":[{"sentence":"The de-idealization of historical figures often occurs as new information comes to light.","translation":"歴史上の人物の脱理想化は、新しい情報が明らかになるにつれてしばしば起こる。"},{"sentence":"The therapy helped him through the de-idealization of his parents, allowing him to see them as flawed individuals.","translation":"そのセラピーは、彼が両親の脱理想化を乗り越えるのを助け、彼らを欠点のある個人として見ることができるようにした。"},{"sentence":"De-idealization is a necessary step in forming realistic expectations in relationships.","translation":"脱理想化は、人間関係において現実的な期待を形成するために必要なステップである。"}],"collocations":["process of de-idealization","undergo de-idealization","de-idealization of a person","de-idealization of a concept","de-idealization in relationships"],"synonyms":["disillusionment","demystification","debunking","realization","sobering up"],"antonyms":["idealization","romanticization","idolization","veneration"]}],"etymology":{"value":"The word is formed by adding the prefix 'de-' (meaning 'removal of' or 'reversal') to the word 'idealization'. 'Idealization' itself comes from 'ideal', which has roots in the Greek word 'idea' (form, pattern).","priority":"★★☆"},"pronunciation":{"ipa":"/diːˌaɪˌdiːəlaɪˈzeɪʃən/","syllables":"de-i-de-al-i-za-tion"},"inflection":{"noun_plural":"de-idealizations"},"usage_notes":{"explanation":"'De-idealization' refers to the process of moving away from an idealized or overly positive view of someone or something. It often involves recognizing flaws, limitations, or negative aspects that were previously ignored or minimized. This process can be painful but is often necessary for developing a more realistic and balanced perspective. It is commonly discussed in the context of psychology, relationships, and the analysis of historical or cultural figures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is de-idealizing his life.","correct":"✓ He is undergoing de-idealization of his life.","note":"'De-idealization' is a process, so use it with verbs like 'undergo' or 'experience' rather than directly acting upon something."},{"incorrect":"✗ The de-idealization made him very ideal.","correct":"✓ The de-idealization made him less idealistic.","note":"'De-idealization' leads to a reduction in idealism, not an increase in it."}],"priority":"★★☆"},"related_words":{"derivatives":["de-idealize (verb)","idealization (noun)","idealize (verb)","ideal (adjective/noun)","idealistic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'De-idealization' is a complex term that refers to the process of ceasing to view someone or something as perfect or flawless. It involves recognizing and accepting the imperfections and limitations of the subject. This term is often used in psychological contexts to describe a shift in perspective that can lead to more realistic expectations and healthier relationships. It is not a commonly used word in everyday conversation, but it is important for understanding certain psychological and philosophical concepts."},"example_sentences":[{"sentence":"The **de-idealization** of political leaders is a common phenomenon in modern democracies.","translation":"政治指導者の脱理想化は、現代の民主主義において一般的な現象である。","type":"noun","meaning_category":"general"},{"sentence":"Through therapy, she began the **de-idealization** of her abusive partner.","translation":"セラピーを通して、彼女は虐待的なパートナーの脱理想化を始めた。","type":"noun","meaning_category":"psychological"},{"sentence":"The **de-idealization** process can be difficult, but it is essential for personal growth.","translation":"脱理想化のプロセスは難しいかもしれませんが、個人の成長には不可欠です。","type":"noun","meaning_category":"personal growth"}]}