{"word":"neglector","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"怠慢な人、無視する人、育児放棄者","english_definition":"a person who neglects someone or something; especially, a parent who fails to provide proper care and attention to their child.","examples":[{"sentence":"He was labeled a neglector for failing to pay attention to his duties.","translation":"彼は自分の義務に注意を払わなかったため、怠慢な人だと見なされた。"},{"sentence":"The social worker identified her as a neglector of her children's basic needs.","translation":"ソーシャルワーカーは、彼女が子供たちの基本的なニーズを無視していると判断した。"}],"collocations":["child neglector (児童虐待者)","duty neglector (義務怠慢者)"],"synonyms":["derelict","remiss","lax","careless","irresponsible"],"antonyms":["caregiver","attentive person","responsible person"]}],"etymology":{"value":"The word 'neglector' is formed by adding the suffix '-or' to the verb 'neglect'. The suffix '-or' is used to denote a person who performs the action of the verb. So, 'neglector' is someone who neglects.","priority":"★★☆"},"pronunciation":{"ipa":"/nɪˈɡlektər/","syllables":"ne-glec-tor"},"inflection":{"noun_plural":"neglectors"},"usage_notes":{"explanation":"'Neglector' is typically used to describe someone who consistently fails to provide adequate care, attention, or resources to someone or something they are responsible for. It often carries a negative connotation, especially when referring to child neglect.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is a neglector of his health, he eats well and exercises regularly.","correct":"He is neglectful of his health, he doesn't eat well and doesn't exercise regularly.","note":"'Neglector' refers to the *person* who neglects. 'Neglectful' is the adjective to describe the *act* of neglecting. The sentence also needs to be corrected to reflect the meaning of neglect."}],"priority":"★★☆"},"related_words":{"derivatives":["neglect (verb, noun)","neglectful (adjective)","neglectfully (adverb)","neglectfulness (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'neglector' is a relatively uncommon noun that refers to a person who neglects their responsibilities or duties. It is often used in legal or social work contexts, particularly when discussing child neglect or elder abuse. The word implies a consistent failure to provide adequate care or attention to someone or something under one's responsibility."},"example_sentences":[{"sentence":"The court deemed him a neglector and removed his children from his care.","translation":"裁判所は彼を育児放棄者とみなし、彼の子供たちを彼のケアから引き離した。","type":"noun","meaning_category":"育児放棄者"},{"sentence":"As a chronic neglector of his studies, he consistently failed his exams.","translation":"彼は慢性的に勉強を怠る人だったので、常に試験に落ちていた。","type":"noun","meaning_category":"怠慢な人"},{"sentence":"The animal shelter rescued several pets from a known animal neglector.","translation":"動物保護施設は、動物虐待者として知られている人物から数匹のペットを救出した。","type":"noun","meaning_category":"怠慢な人"}]}