{"word":"semiprofane","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"（場所、物、時間などが）半分神聖で、半分世俗的な","english_definition":"partly sacred and partly secular.","examples":[{"sentence":"The chapel was used for both religious ceremonies and community events, making it a semiprofane space.","translation":"その礼拝堂は宗教的な儀式と地域社会のイベントの両方に使用され、半分神聖で半分世俗的な空間となっていた。"}],"collocations":["semiprofane space","semiprofane ritual"],"synonyms":["partly sacred","quasi-religious","secularized sacred"],"antonyms":["wholly sacred","completely profane"]}],"etymology":{"value":"semi- (半分) + profane (神聖でない)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmiːproʊˈfeɪn/","syllables":"se-mi-pro-fane"},"inflection":{"notes":"比較変化なし"},"usage_notes":{"explanation":"主に、伝統的な宗教的意味合いを持ちながら、世俗的な目的にも使用される場所、物、または時間を指すために使用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The semiprofane book contained only religious texts.","correct":"✓ The religious book contained both sacred and secular texts.","note":"semiprofaneは、完全に神聖なものには適用されません。"},{"incorrect":"✗ He was semiprofane in his beliefs.","correct":"✓ He had mixed religious and secular beliefs.","note":"人の信念を表現する際には、混合した信念があることを示す別の表現を使用する方が適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":["semisacred"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Semiprofane' is a relatively uncommon word used to describe something that is partly sacred and partly secular. It is most often used in academic or specialized contexts when discussing spaces, objects, or times that have both religious and non-religious significance. It's important to understand the nuances of this word, as it implies a blend of the sacred and the secular, rather than something that is purely one or the other."},"example_sentences":[{"sentence":"The ancient temple, now a museum, has become a semiprofane site, attracting tourists and scholars alike.","translation":"博物館となった古代寺院は、観光客や学者を引きつけ、半分神聖で半分世俗的な場所となっている。","type":"adjective","meaning_category":"場所"},{"sentence":"The annual harvest festival, while rooted in religious tradition, is now a semiprofane celebration involving the entire community.","translation":"毎年恒例の収穫祭は、宗教的な伝統に根ざしているものの、今では地域社会全体が参加する半分神聖で半分世俗的なお祝いとなっている。","type":"adjective","meaning_category":"時間"},{"sentence":"The artifacts displayed in the exhibit were treated with reverence, reflecting their semiprofane status.","translation":"展示されている工芸品は、その半分神聖な状態を反映して、敬意をもって扱われた。","type":"adjective","meaning_category":"物"}]}