{"word":"celestialize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"天国化する、理想化する、神聖化する","english_definition":"to regard or represent as heavenly or ideal; to deify or sanctify.","examples":[{"sentence":"The artist celestialized the landscape in his painting, making it appear otherworldly.","translation":"その画家は絵の中で風景を天国化し、別世界のように見せた。"},{"sentence":"Some cultures celestialize their ancestors, worshipping them as deities.","translation":"一部の文化では祖先を天国化し、神として崇拝する。"},{"sentence":"The movie celestialized the hero's actions, portraying him as a flawless individual.","translation":"その映画は主人公の行動を理想化し、欠点のない人物として描いた。"}],"collocations":["celestialize a person (人を神聖化する)","celestialize a place (場所を天国化する)","celestialize an idea (考えを理想化する)"],"synonyms":["deify","glorify","idealize","sanctify","apotheosize"],"antonyms":["debase","degrade","vilify"]},{"part_of_speech":"verb","transitivity":"vt","definition":"天上のものにする、天国に送る","english_definition":"to cause to become heavenly; to transport to heaven.","examples":[{"sentence":"In some religious beliefs, death is seen as a process of celestializing the soul.","translation":"一部の宗教的信念では、死は魂を天上のものにする過程と見なされている。"},{"sentence":"The angel celestialized the dying man, leading him to paradise.","translation":"天使は死にかけている男を天国に送り、楽園へと導いた。"}],"collocations":["celestialize the soul (魂を天上のものにする)","celestialize the dead (死者を天国に送る)"],"synonyms":["exalt","uplift","spiritualize","transport to heaven"],"antonyms":["condemn","damnation"]}],"etymology":{"value":"From 'celestial' (heavenly) + '-ize' (to make or become).","priority":"★★☆"},"pronunciation":{"ipa":"/səˈlɛstiəˌlaɪz/","syllables":"ce-les-ti-a-lize"},"inflection":{"verb_forms":{"present_simple":["celestialize","celestializes"],"past_simple":"celestialized","past_participle":"celestialized","present_participle":"celestializing"}},"usage_notes":{"explanation":"'Celestialize' is a relatively rare word, primarily used in literary or religious contexts. It implies elevating something or someone to a divine or idealized status. It can also refer to the act of transforming something into a heavenly form or transporting it to heaven.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist celestialized the painting with bright colors.","correct":"✓ The artist idealized the painting with bright colors.","note":"'Celestialize' implies making something heavenly or divine, not just beautiful or colorful. 'Idealize' is a more appropriate word for simply making something appear perfect or beautiful."}],"priority":"★☆☆"},"related_words":{"derivatives":["celestial (adjective: heavenly)","celestiality (noun: the state of being celestial)","celestialization (noun: the act of celestializing)"],"related_concepts":["apotheosis (the elevation of someone to divine status)","deification (the act of making someone a god)","sanctification (the act of making something holy)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Celestialize' is a sophisticated word that means to represent something as heavenly, ideal, or divine. It is not commonly used in everyday language and is more often found in literary, religious, or philosophical contexts. Understanding the word requires a grasp of abstract concepts such as idealization, deification, and the nature of the celestial realm. It is more likely to be encountered in advanced texts or discussions.","example_sentences":[]}}