{"word":"Adlay","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ハトムギ (薏苡)","english_definition":"A tall, tropical, Asian grass (Coix lacryma-jobi) bearing bead-like grains; also, the grains themselves, used as food.","examples":[{"sentence":"Adlay is often used in traditional medicine.","translation":"ハトムギは伝統医学でよく使われます。"},{"sentence":"Some people enjoy adlay in their soup.","translation":"スープにハトムギを入れて楽しむ人もいます。"}],"collocations":["adlay tea","adlay porridge","cooked adlay"],"synonyms":["Job's tears","Coix seed"],"antonyms":[]}],"etymology":{"value":"The name \"adlay\" is of uncertain origin, but is likely derived from a local name used in the Philippines or other parts of Southeast Asia where the plant is cultivated.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈædleɪ/","syllables":"Ad-lay"},"inflection":{"noun_plural":"Adlays"},"usage_notes":{"explanation":"Adlay is primarily used to refer to the grain-producing plant *Coix lacryma-jobi* or its edible grains. It's often used in health foods and traditional medicine. The terms \"adlay\" and \"Job's tears\" are often used interchangeably, although \"Job's tears\" can also refer to the ornamental beads produced by some varieties of the plant.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate adlays for dinner.","correct":"✓ I ate adlay for dinner.","note":"When referring to the grain as a food item in general, use the singular form 'adlay' as it is often treated as an uncountable noun. If referring to individual grains, 'adlay seeds' would be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["coixol (a chemical compound found in adlay)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Adlay' is a specialized term referring to a grain-producing plant, *Coix lacryma-jobi*, and its edible grains. It's primarily encountered in contexts related to health foods, traditional medicine, or botany. Due to its specific usage, it's not a common word in general English conversation, but understanding its meaning is useful in specialized contexts."},"example_sentences":[{"sentence":"The health benefits of adlay are well-documented in some studies.","translation":"ハトムギの健康上の利点は、いくつかの研究で十分に文書化されています。","type":"noun","meaning_category":"grain"},{"sentence":"Adlay is a common ingredient in Asian herbal remedies.","translation":"ハトムギはアジアの漢方薬によく使われる材料です。","type":"noun","meaning_category":"grain"}]}