{"word":"blue-annealed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"青焼きされた、青色焼鈍された","english_definition":"(of metal) having been subjected to a process of annealing in which the metal is heated to a high temperature in a non-oxidizing atmosphere, resulting in a bluish surface oxide layer.","examples":[{"sentence":"The blue-annealed steel sheet had a distinctive color.","translation":"その青焼きされた鋼板は独特の色をしていた。"},{"sentence":"Blue-annealed metal is often used for decorative purposes.","translation":"青色焼鈍された金属は、装飾目的でよく使用される。"}],"collocations":["blue-annealed steel","blue-annealed sheet metal"],"synonyms":["oxidized","heat-treated"],"antonyms":["untreated","unprocessed"]}],"etymology":{"value":"The term 'blue-annealed' comes from the bluish appearance of the metal surface after the annealing process. The 'blue' refers to the color of the oxide layer formed during heating, and 'annealed' refers to the heat treatment process itself, which softens the metal and relieves internal stresses.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbluː əˈniːld/","syllables":"blue-an-nealed"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Blue-annealed' describes metal that has undergone a specific type of heat treatment. This process involves heating the metal to a high temperature in a controlled atmosphere to achieve certain properties, such as increased ductility or a specific surface finish. The resulting bluish color is a characteristic feature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metal was blue-anneal.","correct":"✓ The metal was blue-annealed.","note":"'Blue-annealed' is an adjective, so it should be used to describe a noun. 'Blue-anneal' is not a standard term."}],"priority":"★☆☆"},"related_words":{"derivatives":["annealing","anneal"],"phrasal_verbs":[],"related_terms":["heat treatment","metalworking","oxidation"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Blue-annealed' is a technical term used in metallurgy and metalworking. It refers to a specific type of heat treatment process applied to metals, resulting in a bluish surface oxide layer. Understanding this term requires knowledge of materials science and manufacturing processes. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The manufacturer used blue-annealed springs in the clock mechanism.","translation":"製造業者は、時計の機構に青焼きされたバネを使用した。","type":"adjective","meaning_category":"青焼きされた"},{"sentence":"Blue-annealed finishes are known for their corrosion resistance.","translation":"青色焼鈍された仕上げは、耐食性で知られている。","type":"adjective","meaning_category":"青色焼鈍された"}]}