{"word":"unacclimation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"順応解除、非順応化：ある環境への順応状態が失われること。","english_definition":"The loss of acclimation to a particular environment.","examples":[{"sentence":"After returning from the mountains, they experienced unacclimation to the lower altitude.","translation":"山から帰ってきた後、彼らは低地への順応解除を経験した。"},{"sentence":"Unacclimation can occur rapidly when the environmental stressor is removed.","translation":"環境ストレス要因が取り除かれると、順応解除は急速に起こりうる。"}],"collocations":["experience unacclimation","rapid unacclimation","reverse acclimation"],"synonyms":["deacclimation","loss of acclimation"],"antonyms":["acclimation","adaptation"]}],"etymology":{"value":"\"un-\" (否定) + \"acclimation\" (順応)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˌæklɪˈmeɪʃən/","syllables":"un-ac-cli-ma-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Unacclimation\" refers to the process where an organism loses its adaptation or acclimation to a specific environment. It is the reverse process of acclimation. It is less commonly used than \"acclimation\".","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unacclimation was very acclimated.","correct":"✓ The unacclimation was very rapid.","note":"\"Unacclimation\" is the loss of acclimation, so it cannot be \"acclimated\". Use words like \"rapid\" to describe the speed of unacclimation."}],"priority":"★☆☆"},"related_words":{"derivatives":["acclimation","acclimate","deacclimation"],"related_terms":["adaptation","environment","physiology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unacclimation\" is a relatively uncommon term referring to the loss of adaptation to a specific environment. It's essentially the opposite of acclimation, which is the process of adapting to a new environment. Understanding the base word \"acclimation\" is crucial for comprehending \"unacclimation.\" This word is more likely to appear in scientific or technical contexts related to biology, physiology, or environmental science."},"example_sentences":[{"sentence":"The athletes experienced rapid unacclimation after returning to sea level.","translation":"選手たちは海面高度に戻った後、急速な順応解除を経験した。","type":"general","meaning_category":"loss of adaptation"},{"sentence":"Unacclimation can lead to decreased performance in previously adapted environments.","translation":"順応解除は、以前に順応していた環境でのパフォーマンス低下につながる可能性がある。","type":"general","meaning_category":"loss of adaptation"}]}