{"word":"henhawk","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アメリカ合衆国で、主にハトやニワトリを捕食する、ある種のタカに対する一般的な名称。","english_definition":"A general name in the United States for certain hawks, especially those that prey on pigeons and poultry.","examples":[{"sentence":"The henhawk swooped down and snatched a chicken from the yard.","translation":"ヘンホークが急降下して、庭からニワトリをさらっていった。"}],"collocations":["chicken hawk"],"synonyms":["chicken hawk","Cooper's hawk","sharp-shinned hawk","red-tailed hawk"],"antonyms":[]}],"etymology":{"value":"'Hen'（ニワトリ）と 'hawk'（タカ）の組み合わせ。ニワトリを捕食するタカを指すことから。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛnˌhɔk/","syllables":"hen-hawk"},"inflection":{"noun_plural":"henhawks"},"usage_notes":{"explanation":"'Henhawk' は、特定の種類のタカを指すのではなく、ニワトリやハトなどの家禽を捕食するタカの総称として使われることが多いです。そのため、地域や文脈によって指すタカの種類が異なる場合があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a henhawk flying in the ocean.","correct":"✓ I saw a henhawk flying over the fields.","note":"Henhawks are typically found in areas where they can prey on birds and small animals, such as fields, forests, and near farms, not typically over the ocean."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'henhawk' is a regional and somewhat informal term, primarily used in the United States, to refer to various species of hawks that are known to prey on poultry. It's not a scientifically precise term, so its usage can be ambiguous. Understanding its meaning requires some familiarity with regional dialects and knowledge of bird species."},"example_sentences":[{"sentence":"Farmers often worry about henhawks preying on their chickens.","translation":"農家はしばしばヘンホークがニワトリを襲うことを心配している。","type":"general","meaning_category":"general"},{"sentence":"The old-timer called every hawk he saw near the farm a henhawk.","translation":"その老人は農場の近くで見かけるタカをすべてヘンホークと呼んだ。","type":"general","meaning_category":"general"}]}