{"word":"suspendable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"停止できる、中断できる、保留できる、一時的に無効にできる","english_definition":"Capable of being suspended; able to be temporarily stopped, interrupted, or invalidated.","examples":[{"sentence":"The membership was deemed suspendable due to repeated violations of the club rules.","translation":"会員資格は、クラブ規則の度重なる違反により、停止可能と判断された。"},{"sentence":"Whether the game is suspendable due to weather conditions is up to the referee's discretion.","translation":"天候状況により試合を中断できるかどうかは、審判の裁量に委ねられている。"},{"sentence":"The account is suspendable if fraudulent activity is detected.","translation":"不正な活動が検出された場合、アカウントは停止可能です。"}],"collocations":["suspendable license (停止可能な免許)","suspendable account (停止可能なアカウント)","suspendable activity (中断可能な活動)","suspendable clause (保留可能な条項)","suspendable sentence (執行猶予可能な刑)"],"synonyms":["interruptible","stoppable","revocable","deferrable","postponable","removable","terminable"],"antonyms":["unsuspendable","permanent","irrevocable","continuous","uninterruptible","indefinite"]}],"etymology":{"value":"The word 'suspendable' is formed by adding the suffix '-able' to the verb 'suspend'. 'Suspend' comes from the Latin word 'suspendere', meaning 'to hang up, delay, or hold back'. The suffix '-able' indicates capability or suitability for the action described by the verb.","priority":"★★☆"},"pronunciation":{"ipa":"/səˈspɛndəbəl/","syllables":"sus-pend-a-ble"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Suspendable' describes something that has the property of being able to be suspended. Suspension implies a temporary cessation or interruption, not a permanent one. The term is often used in legal, administrative, or technical contexts to indicate that something can be put on hold or temporarily disabled under certain conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The suspendable of the meeting was decided.","correct":"✓ The suspension of the meeting was decided.","note":"'Suspendable' is an adjective, not a noun. Use the noun 'suspension' instead. "},{"incorrect":"✗ The contract is suspendable permanently.","correct":"✓ The contract is suspendable temporarily.","note":"'Suspendable' implies a temporary state. If something is suspended permanently, it's more accurate to say it's terminated or cancelled."}],"priority":"★★☆"},"related_words":{"derivatives":["suspend (verb)","suspension (noun)","suspendability (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Suspendable' is a relatively formal and uncommon word. It means that something is capable of being temporarily stopped or put on hold. It's often used in legal or technical contexts. Because it's not a frequently used word, it's more common to use phrases like 'can be suspended' or 'is able to be suspended' instead. Understanding the root word 'suspend' and the suffix '-able' is helpful in understanding the meaning of 'suspendable'."},"example_sentences":[{"sentence":"The employee's access to the system was suspendable pending the investigation.","translation":"調査中、従業員によるシステムへのアクセスは停止可能であった。","type":"adjective","meaning_category":"capable of being stopped"},{"sentence":"The rule is suspendable in cases of emergency with the approval of the director.","translation":"その規則は、緊急の場合には、部長の承認を得て保留することができる。","type":"adjective","meaning_category":"capable of being interrupted"},{"sentence":"The service is suspendable for maintenance purposes.","translation":"そのサービスは、メンテナンスのために停止可能です。","type":"adjective","meaning_category":"capable of being temporarily invalidated"}]}