{"word":"Satelloid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(天文学)小惑星帯に存在する、惑星の重力の影響を受けつつも、安定した軌道を周回する比較的小さな天体。","english_definition":"(Astronomy) A relatively small celestial body in the asteroid belt that orbits the sun in a stable orbit while being influenced by the gravity of a planet.","examples":[{"sentence":"The discovery of several satelloids has provided new insights into the dynamics of the asteroid belt.","translation":"いくつかのサテロイドの発見は、小惑星帯の力学に関する新たな洞察をもたらした。"},{"sentence":"Satelloids are thought to be captured asteroids that have been gravitationally bound to a planet.","translation":"サテロイドは、惑星に重力的に束縛された捕獲された小惑星であると考えられている。"}],"collocations":["asteroid satelloid","inner satelloid","outer satelloid","minor planet satelloid"],"synonyms":["quasi-satellite"],"antonyms":[]}],"etymology":{"value":"\"Satellite\"と\"-oid\"（～のようなもの）の組み合わせ。衛星に似た天体であることを示す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsætəˌlɔɪd/","syllables":"sat-el-loid"},"inflection":{"noun_plural":"satelloids"},"usage_notes":{"explanation":"サテロイドは、惑星の衛星とは異なり、惑星の重力の影響を受けつつも、太陽の周りを直接公転する天体です。準衛星（quasi-satellite）と似た概念ですが、より安定した軌道を持つものを指すことが多いです。小惑星帯に存在するものが知られています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The satelloid orbits directly around the planet.","correct":"✓ The satelloid orbits the sun while being influenced by the planet.","note":"サテロイドは惑星の周りを直接公転するのではなく、太陽の周りを公転しつつ、惑星の重力の影響を受けます。"},{"incorrect":"✗ Satelloids are just another name for moons.","correct":"✓ Satelloids are distinct from moons, as they orbit the sun directly.","note":"サテロイドは月（moon）とは異なり、太陽の周りを公転します。"}],"priority":"★★☆"},"related_words":{"derivatives":["satellite","asteroid","planetoid"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 天文学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Satelloid**」は天文学で使われる専門的な言葉で、小惑星帯にある天体のことを指します。惑星の重力の影響を受けながらも、太陽の周りを回るという特徴があります。準衛星（quasi-satellite）と似ていますが、サテロイドの方がより安定した軌道を持っています。この言葉は一般的な会話ではほとんど使われず、天文学の研究や議論の中で使われることが多いです。"},"example_sentences":[{"sentence":"Researchers are studying the orbital characteristics of several newly discovered satelloids.","translation":"研究者たちは、新たに発見されたいくつかのサテロイドの軌道特性を研究している。","type":"noun","meaning_category":"天文学"}]}