{"word":"Gammoner","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"(UK, derogatory) A person, typically older and male, who expresses strong, often reactionary, opinions, especially on social and political issues, often associated with a nostalgic view of the past.","english_definition":"(UK, derogatory) A person, typically older and male, who expresses strong, often reactionary, opinions, especially on social and political issues, often associated with a nostalgic view of the past.","examples":[{"sentence":"He's a typical gammoner, always complaining about political correctness.","translation":"彼は典型的なガンモナーで、いつもポリティカル・コレクトネスについて不満を言っている。"},{"sentence":"The article criticized the gammoners for their outdated views.","translation":"その記事は、時代遅れの考え方を持つガンモナーたちを批判した。"}],"collocations":["typical gammoner","outdated views of gammoners","criticize gammoners"],"synonyms":["reactionary","right-winger","old-fashioned conservative"],"antonyms":["progressive","liberal","left-winger"]}],"etymology":{"value":"The term 'gammon' is British slang for the lower part of the face, typically red when someone is angry or expressing strong opinions. The suffix '-er' is added to form a noun referring to a person.","priority":"Medium"},"pronunciation":{"ipa":"/ˈɡæmənər/","syllables":"Gam-mon-er"},"inflection":{"noun_plural":"Gammoners"},"usage_notes":{"explanation":"'Gammoner' is a derogatory term used in the UK to describe someone, usually an older, white male, who holds strong, often right-wing, opinions. It is often associated with Brexit and a nostalgic view of Britain's past. The term is considered offensive.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"He is a gammoner because he likes ham.","correct":"He is a gammoner because he expresses right-wing opinions.","note":"The term 'gammoner' is not related to the food 'gammon' (ham). It refers to someone with certain political views."}],"priority":"Medium"},"related_words":{"derivatives":["gammon (noun, slang for face)"],"phrases":["gammon-faced (adjective)"]},"level_frequency":{"frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Gammoner' is a derogatory slang term primarily used in the UK. It refers to a person, typically an older, white male, who expresses strong, often reactionary, political opinions, particularly those associated with right-wing or conservative views. The term is often used in a pejorative way to criticize or mock such individuals. Understanding the term requires familiarity with contemporary British political discourse and slang."},"example_sentences":[{"sentence":"The panel discussion was dominated by gammoners spouting outdated views on immigration.","translation":"パネルディスカッションは、移民に関する時代遅れの考えをまくしたてるガンモナーたちに支配されていた。","type":"noun","meaning_category":"derogatory term"},{"sentence":"Many younger voters see the older generation as a bunch of gammoners clinging to a bygone era.","translation":"多くの若い有権者は、上の世代を過ぎ去った時代にしがみつくガンモナーの集団と見ている。","type":"noun","meaning_category":"derogatory term"}]}