{"word":"sultanating","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(rare, nonstandard) Present participle of sultanate.","english_definition":"(rare, nonstandard) Present participle of sultanate. To rule as a sultan; to form or be part of a sultanate.","examples":[{"sentence":"The small island was sultanating under the rule of a local chieftain.","translation":"その小さな島は、地元の首長の支配下でスルタン国を形成していた。"},{"sentence":"He was accused of sultanating his own little empire within the company.","translation":"彼は会社内で自分の小さな帝国をスルタン国のように支配していると非難された。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'sultanate', with the addition of the '-ing' suffix to form the present participle.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈsʌltənˌeɪtɪŋ/","syllables":"sul-tan-at-ing"},"inflection":{"verb_forms":{"present_participle":"sultanating"}},"usage_notes":{"explanation":"'Sultanating' is a very rare and nonstandard verb form. It is derived from the noun 'sultanate,' which refers to a state or territory ruled by a sultan. The verb form is used to describe the act of ruling as a sultan or forming a sultanate. Its usage is highly uncommon and may be considered incorrect in formal writing.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["sultanate","sultan"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Extremely low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'sultanating' is a rare and non-standard verb form. It is derived from 'sultanate', which refers to a territory ruled by a sultan. The verb form is used to describe the act of ruling as a sultan or forming a sultanate. Its usage is highly uncommon and may be considered incorrect in formal writing. Understanding requires familiarity with the term 'sultanate' and the process of verb formation through the addition of '-ing'."},"example_sentences":[{"sentence":"The region was slowly sultanating as various tribes consolidated power.","translation":"その地域は、さまざまな部族が権力を統合するにつれて、徐々にスルタン国を形成していった。","type":"verb","meaning_category":"Forming a sultanate"},{"sentence":"He enjoyed sultanating over his subordinates, making arbitrary decisions.","translation":"彼は部下をスルタンのように支配し、恣意的な決定を下すことを楽しんだ。","type":"verb","meaning_category":"Ruling like a sultan"}]}