{"word":"isohemolysis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"同種溶血","english_definition":"The lysis of red blood cells by an isoantibody.","examples":[{"sentence":"Isohemolysis can occur in hemolytic transfusion reactions.","translation":"同種溶血は溶血性輸血反応で起こることがあります。"},{"sentence":"The presence of isohemolysis indicates an incompatibility between the donor and recipient blood.","translation":"同種溶血の存在は、ドナーとレシピエントの血液の間に不適合性があることを示しています。"}],"collocations":["hemolytic transfusion reaction","blood incompatibility"],"synonyms":["allohemolysis"],"antonyms":[]}],"etymology":{"value":"From 'iso-' (same), 'hemo-' (blood), and 'lysis' (breakdown).","priority":"★★★"},"pronunciation":{"ipa":"/ˌaɪsoʊhiˈmɒlɪsɪs/","syllables":"i-so-he-mol-y-sis"},"inflection":{"noun_plural":"isohemolyses"},"usage_notes":{"explanation":"Isohemolysis refers to the destruction of red blood cells due to antibodies (isoantibodies) reacting with antigens on the red blood cells of another individual of the same species. This is commonly encountered in blood transfusions or during pregnancy when the mother's antibodies attack the fetal red blood cells.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ isohemolysis is caused by autoantibodies.","correct":"✓ isohemolysis is caused by isoantibodies.","note":"Isohemolysis is caused by isoantibodies (antibodies against antigens from the same species), not autoantibodies (antibodies against the body's own antigens)."},{"incorrect":"✗ isohemolysis is a type of autoimmune disease.","correct":"✓ isohemolysis is a result of incompatibility between individuals of the same species.","note":"Isohemolysis is not an autoimmune disease; it results from an immune response to foreign antigens within the same species."}],"priority":"★★☆"},"related_words":{"derivatives":["isohemolytic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Isohemolysis is a highly specialized term in medicine, specifically related to blood transfusions and immunology. Understanding this term requires a strong background in biology and medicine, particularly in the areas of blood types, antibodies, and immune responses. It is not commonly used outside of professional medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Severe cases of isohemolysis can lead to jaundice and anemia.","translation":"重度の同種溶血は黄疸や貧血を引き起こす可能性があります。","type":"general","meaning_category":"medical"},{"sentence":"The Coombs test can be used to detect isohemolysis in newborns.","translation":"クームス試験は、新生児の同種溶血を検出するために使用できます。","type":"diagnostic","meaning_category":"medical"},{"sentence":"Prevention of isohemolysis is crucial in blood transfusion protocols.","translation":"同種溶血の予防は、輸血プロトコルにおいて非常に重要です。","type":"prevention","meaning_category":"medical"}]}