{"word":"antherid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学)造精器、精子器","english_definition":"the male sex organ of algae, mosses, ferns, fungi, and other nonflowering plants.","examples":[{"sentence":"The antherid produces sperm cells.","translation":"造精器は精細胞を生成する。"},{"sentence":"The structure of the antherid varies among different plant groups.","translation":"造精器の構造は植物群によって異なる。"}],"collocations":["antherid cell","antherid development","antherid wall"],"synonyms":["male reproductive organ","spermatogonium"],"antonyms":["archegonium (造卵器)"]}],"etymology":{"value":"Derived from the Greek words 'antheros' (flowering) and '-idion' (diminutive suffix), referring to the small, flower-like structure where male gametes are produced in non-flowering plants.","priority":"★★☆"},"pronunciation":{"ipa":"/ænˈθɛrɪd/","syllables":"an-ther-id"},"inflection":{"noun_plural":"antheridia"},"usage_notes":{"explanation":"An antherid is a specialized structure found in non-flowering plants (such as algae, mosses, ferns, and fungi) that produces sperm cells. It is the male counterpart to the archegonium, which produces egg cells. The antherid's structure can vary significantly between different plant groups.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The antherid is the female reproductive organ.","correct":"✓ The antherid is the male reproductive organ.","note":"The antherid is specifically the male reproductive organ; the female counterpart is the archegonium."}],"priority":"★★☆"},"related_words":{"derivatives":["antheridiophore (造精器柄)"],"related_terms":["archegonium (造卵器)","gametophyte (配偶体)","spermatozoid (精子)"],"priority":"★★☆"},"level_frequency":{"level":"Specialized vocabulary (植物学)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antherid' is a technical term used in botany to describe the male reproductive organ in non-flowering plants. It is primarily encountered in specialized texts and academic discussions related to plant biology and reproduction. Understanding this term requires familiarity with basic plant anatomy and reproductive processes."},"example_sentences":[{"sentence":"In mosses, the antherid is typically located within a specialized structure called the perigonium.","translation":"コケ類では、造精器は通常、囲精器と呼ばれる特殊な構造の中に位置する。","type":"scientific","meaning_category":"location"},{"sentence":"The release of sperm from the antherid is often triggered by environmental cues such as water availability.","translation":"造精器からの精子の放出は、しばしば水の利用可能性などの環境的合図によって引き起こされる。","type":"scientific","meaning_category":"function"},{"sentence":"The development of the antherid is a crucial step in the life cycle of many non-vascular plants.","translation":"造精器の発達は、多くの非維管束植物のライフサイクルにおける重要なステップである。","type":"scientific","meaning_category":"development"}]}