{"word":"pledgee","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(担保権者)質権者、抵当権者、譲渡担保権者","english_definition":"The person or entity to whom a pledge is made; the party who receives a pledge as security for a debt or obligation.","examples":[{"sentence":"The bank acted as the pledgee in the loan agreement.","translation":"銀行は、融資契約において質権者として行動した。"},{"sentence":"The pledgee has the right to sell the pledged assets if the pledgor defaults.","translation":"質権者は、質権設定者が債務不履行に陥った場合、担保に供された資産を売却する権利を有する。"}],"collocations":["act as pledgee","rights of the pledgee","obligations of the pledgee"],"synonyms":["secured creditor","mortgagee","chargee"],"antonyms":["pledgor"]},{"part_of_speech":"noun","definition":"(入会候補者)誓約者、(特に)フラタニティやソロリティの入会候補者","english_definition":"A person who has pledged to join a fraternity, sorority, or other organization, but has not yet been fully initiated.","examples":[{"sentence":"The pledgees were required to complete a series of tasks before initiation.","translation":"入会候補者は、入会儀式前に一連の課題を完了する必要があった。"},{"sentence":"Being a pledgee is a demanding but rewarding experience.","translation":"入会候補者であることは、大変だがやりがいのある経験だ。"}],"collocations":["pledgee period","pledgee class","pledgee training"],"synonyms":["prospective member","candidate","initiate"],"antonyms":["member"]}],"etymology":{"value":"From 'pledge' (noun or verb) + '-ee' (suffix indicating the recipient of an action).","priority":"★★☆"},"pronunciation":{"ipa":"/plɛˈdʒiː/","syllables":"pledg-ee"},"inflection":{"noun_plural":"pledgees"},"usage_notes":{"explanation":"The term 'pledgee' has two distinct meanings depending on the context. In a financial or legal context, it refers to the party who receives a pledge as security for a debt. In the context of fraternities, sororities, or other organizations, it refers to a person who has promised to join but has not yet been fully initiated.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pledger of the fraternity.","correct":"✓ He is a pledgee of the fraternity.","note":"'Pledger' is incorrect. The correct term for someone who has pledged to join a fraternity is 'pledgee'."},{"incorrect":"✗ The pledgee must give the loan.","correct":"✓ The pledgor must give the loan.","note":"The 'pledgor' gives the pledge, while the 'pledgee' receives it as security."}],"priority":"★★☆"},"related_words":{"derivatives":["pledge","pledgor","pledgeship"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pledgee' is a relatively uncommon word with two distinct meanings depending on the context. In finance, it refers to the party receiving the pledge (security). In the context of fraternities and sororities, it refers to a person who has committed to joining but is not yet a full member. Be mindful of the context to understand the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"As the pledgee, the lender had the right to seize the collateral if the borrower defaulted.","translation":"質権者として、貸し手は借り手が債務不履行に陥った場合、担保を差し押さえる権利を有していた。","type":"noun","meaning_category":"担保権者"},{"sentence":"The pledgees spent weeks learning about the history and values of the sorority.","translation":"入会候補者たちは、ソロリティの歴史と価値観について学ぶのに数週間を費やした。","type":"noun","meaning_category":"入会候補者"}]}