{"word":"Listeriosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"リステリア症","english_definition":"An infection caused by the bacterium Listeria monocytogenes, typically caused by eating contaminated food.","examples":[{"sentence":"Listeriosis can be particularly dangerous for pregnant women, newborns, and individuals with weakened immune systems.","translation":"リステリア症は、特に妊婦、新生児、免疫力が低下している人に危険を及ぼす可能性があります。"},{"sentence":"The food recall was initiated due to concerns about potential Listeriosis contamination.","translation":"食品のリコールは、リステリア症汚染の可能性への懸念から開始されました。"}],"collocations":["foodborne listeriosis","neonatal listeriosis","invasive listeriosis"],"synonyms":["Listeria infection"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name Listeria (named after Joseph Lister, a pioneer of antiseptic surgery) and the suffix -osis (denoting a disease or condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɪˌstɪəriˈoʊsɪs/","syllables":"Lis-te-ri-o-sis"},"inflection":{"noun_plural":"Listerioses (rare)"},"usage_notes":{"explanation":"Listeriosis is a relatively rare but serious infection. It's important to note that symptoms can vary, and in some cases, the infection can be asymptomatic. Diagnosis typically involves blood or cerebrospinal fluid cultures. Prevention focuses on proper food handling and preparation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Listeriosis is caused by a virus.","correct":"✓ Listeriosis is caused by bacteria.","note":"Listeriosis is a bacterial infection, not a viral one."},{"incorrect":"✗ Listeriosis only affects pregnant women.","correct":"✓ Listeriosis can be more severe in pregnant women, but it can affect anyone.","note":"While pregnant women are at higher risk, Listeriosis can affect anyone, especially those with weakened immune systems."}],"priority":"★★☆"},"related_words":{"derivatives":["Listeria (noun: the genus of bacteria that causes Listeriosis)","Listerial (adjective: relating to Listeria or Listeriosis)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Listeriosis is a medical term referring to an infection caused by the Listeria monocytogenes bacterium. This infection is typically contracted through the consumption of contaminated food. The term is primarily used in medical and scientific contexts, as well as in public health advisories related to food safety. Understanding this term is important for those in healthcare, food industry, and individuals seeking information on foodborne illnesses.","priority":"★★★"},"example_sentences":[{"sentence":"The elderly patient was diagnosed with listeriosis after consuming contaminated cheese.","translation":"高齢の患者は、汚染されたチーズを摂取した後、リステリア症と診断されました。","type":"medical","meaning_category":"infection"},{"sentence":"Public health officials issued a warning about the risk of listeriosis from improperly processed deli meats.","translation":"公衆衛生当局は、不適切に加工されたデリミートからのリステリア症のリスクについて警告を発しました。","type":"public health","meaning_category":"food safety"},{"sentence":"Pregnant women are advised to avoid certain foods to minimize the risk of contracting listeriosis.","translation":"妊婦は、リステリア症に感染するリスクを最小限に抑えるために、特定の食品を避けるように助言されています。","type":"medical advice","meaning_category":"prevention"}]}