{"word":"Benjaminite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ベニヤミン族の人、ベニヤミン族の男性","english_definition":"A member of the tribe of Benjamin.","examples":[{"sentence":"He was a Benjaminite, descended from Kish.","translation":"彼はキシュの子孫であるベニヤミン族の人だった。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"ベニヤミン族の、ベニヤミン族に関する","english_definition":"Of or pertaining to the tribe of Benjamin.","examples":[{"sentence":"The Benjaminite territory was located north of Judah.","translation":"ベニヤミン族の領土はユダの北に位置していた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the name of the tribe of Benjamin, one of the twelve tribes of Israel, + -ite (suffix indicating membership or origin).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɛndʒəmɪˌnaɪt/","syllables":"Ben-ja-min-ite"},"inflection":{"noun_plural":"Benjaminites"},"usage_notes":{"explanation":"The term \"Benjaminite\" is primarily used in historical and religious contexts, specifically when referring to the ancient Israelite tribe of Benjamin, one of the twelve tribes descended from Jacob (also known as Israel) in the Hebrew Bible. The tribe is named after Benjamin, Jacob's youngest son.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["Benjamin (noun: ベニヤミン)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Benjaminite\" refers to a member of the tribe of Benjamin, one of the twelve tribes of Israel in the Hebrew Bible. It is used in historical and religious contexts to identify individuals or things associated with this specific tribe. The word is formed by adding the suffix \"-ite\" to the name \"Benjamin\", indicating membership or origin. Understanding the term requires familiarity with the biblical history of ancient Israel.","priority":"★★☆"},"example_sentences":[{"sentence":"Saul, the first king of Israel, was a **Benjaminite**.","translation":"イスラエル初代の王であるサウルは、ベニヤミン族の人だった。","type":"noun","meaning_category":"人"},{"sentence":"The city of Jericho was located within **Benjaminite** territory.","translation":"エリコの町はベニヤミン族の領土内に位置していた。","type":"adjective","meaning_category":"部族に関する"}]}