{"word":"quasi-exterritorial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"準治外法権の","english_definition":"having a status resembling extraterritoriality; enjoying certain immunities and privileges similar to those granted to foreign diplomats, but not to the same extent.","examples":[{"sentence":"The international organization's headquarters enjoyed quasi-exterritorial status.","translation":"その国際機関の本部は準治外法権的な地位を享受していた。"},{"sentence":"The agreement granted the peacekeeping force quasi-exterritorial rights.","translation":"その合意は、平和維持部隊に準治外法権的な権利を付与した。"}],"collocations":["quasi-exterritorial status","quasi-exterritorial rights","quasi-exterritorial privileges"],"synonyms":["semi-exterritorial"],"antonyms":["fully territorial"],"notes":"This term is often used in international law and diplomacy to describe situations where certain entities or locations are granted some, but not all, of the immunities and privileges associated with extraterritoriality."}],"etymology":{"value":"The term is formed by combining \"quasi-\" (meaning \"resembling\" or \"seemingly\") with \"exterritorial,\" indicating a status that is similar to, but not fully, extraterritoriality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪˌɛksˌtɛrɪˈtɔːriəl/","syllables":"quasi-ex-ter-ri-to-ri-al"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Quasi-exterritorial\" describes a situation where a location or entity has some, but not all, of the rights and immunities of extraterritoriality. This is often granted to international organizations, peacekeeping forces, or other entities that require certain protections to operate effectively, but are still subject to the laws of the host country to some extent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The embassy had full quasi-exterritorial rights.","correct":"✓ The embassy had extraterritorial rights.","note":"Embassies typically have extraterritorial rights, not quasi-exterritorial rights. Quasi-exterritoriality implies a limited form of extraterritoriality."}],"priority":"★☆☆"},"related_words":{"derivatives":["quasi (adverb, adjective): seemingly, almost","exterritorial (adjective): outside the territory of a state"],"phrases":["extraterritoriality (noun): the state of being exempt from local law"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"quasi-exterritorial\" is a specialized term used in international law and diplomacy. It describes a situation where an entity or location has some, but not all, of the immunities and privileges associated with extraterritoriality. Understanding this term requires a good grasp of international relations and legal concepts. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The UN compound was granted quasi-exterritorial status by the host nation.","translation":"国連施設は、ホスト国から準治外法権的な地位を認められた。","type":"general"},{"sentence":"The visiting scientists were given quasi-exterritorial privileges to facilitate their research.","translation":"訪問中の科学者たちは、研究を円滑に進めるために準治外法権的な特権を与えられた。","type":"specific"}]}