{"word":"fermentative","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"発酵性の、発酵を引き起こす、発酵に関連する","english_definition":"Capable of causing or undergoing fermentation; relating to fermentation.","examples":[{"sentence":"The bacteria are fermentative, producing lactic acid.","translation":"そのバクテリアは発酵性であり、乳酸を生成する。"},{"sentence":"Fermentative processes are used in the production of many foods.","translation":"発酵プロセスは多くの食品の製造に利用されている。"}],"collocations":["fermentative bacteria (発酵性細菌)","fermentative process (発酵プロセス)","fermentative ability (発酵能力)","fermentative capacity (発酵能)"],"synonyms":["zymotic"],"antonyms":["non-fermentative"]}],"etymology":{"value":"From 'ferment' + '-ative'. 'Ferment' comes from Latin 'fermentum' (leaven), from 'fervere' (to boil). '-ative' is a suffix denoting a tendency or capacity.","priority":"★★☆"},"pronunciation":{"ipa":"/fərˈmɛntətɪv/","syllables":"fer-men-ta-tive"},"inflection":{"notes":"Adjectives do not inflect in English, but can be used in comparative and superlative forms (more fermentative, most fermentative)."},"usage_notes":{"explanation":"'Fermentative' is primarily used in scientific and technical contexts, especially in biology, chemistry, and food science. It describes the ability of a substance or organism to cause or undergo fermentation, a metabolic process that converts carbohydrates to acids, gases, or alcohol in the absence of oxygen or with very little oxygen. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fermentative food was delicious.","correct":"✓ The fermented food was delicious.","note":"Use 'fermented' to describe food that has undergone fermentation. 'Fermentative' describes the ability to cause fermentation."}],"priority":"★★☆"},"related_words":{"derivatives":["ferment (verb, noun)","fermentation (noun)","fermented (adjective)"],"phrases":["fermentative metabolism","fermentative pathway"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'fermentative' is a technical term primarily used in scientific contexts, especially in biology, chemistry, and food science. It describes something that is capable of causing or undergoing fermentation. Due to its specialized usage, it is not commonly encountered in everyday language. Understanding its meaning requires familiarity with the concept of fermentation itself, which is a metabolic process that converts carbohydrates to acids, gases, or alcohol. Therefore, a higher level of English proficiency is needed to comprehend and use this word accurately."},"example_sentences":[{"sentence":"The yeast strain exhibited strong fermentative activity.","translation":"その酵母菌株は強い発酵活性を示した。","type":"adjective","meaning_category":"発酵を引き起こす"},{"sentence":"Some bacteria are fermentative and can produce various byproducts.","translation":"一部の細菌は発酵性であり、さまざまな副産物を生成することができる。","type":"adjective","meaning_category":"発酵性の"},{"sentence":"The fermentative capacity of the culture was tested in the laboratory.","translation":"その培養物の発酵能は実験室で試験された。","type":"adjective","meaning_category":"発酵に関連する"}]}