{"word":"leaving-centered","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(主に心理学や社会学で)去ること、離れること、手放すことを中心に据えた、またはそれらに焦点を当てた","english_definition":"(primarily in psychology or sociology) focused on or prioritizing the act of leaving, departing, or letting go.","examples":[{"sentence":"The therapy group adopted a leaving-centered approach to help members cope with the end of their relationships.","translation":"そのセラピーグループは、メンバーが人間関係の終わりにうまく対処できるよう、去ることを中心としたアプローチを採用した。"},{"sentence":"The social worker provided leaving-centered counseling to the family as they prepared to move to a new city.","translation":"ソーシャルワーカーは、家族が新しい都市へ引っ越す準備をするにあたり、去ることを中心としたカウンセリングを提供した。"},{"sentence":"The research explored the effectiveness of leaving-centered strategies in reducing anxiety associated with relocation.","translation":"その研究は、転居に伴う不安を軽減する上での、去ることを中心とした戦略の有効性を調査した。"}],"collocations":["leaving-centered therapy","leaving-centered counseling","leaving-centered approach","leaving-centered strategy","leaving-centered perspective"],"synonyms":["departure-focused","separation-oriented","relocation-centered","transition-focused","exit-oriented"],"antonyms":["arrival-centered","staying-focused","retention-oriented","attachment-centered"]}],"etymology":{"value":"「leaving」（去ること、離れること）と「centered」（中心に置かれた、焦点を当てられた）の組み合わせ。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈliːvɪŋ ˌsentərd/","syllables":"leav-ing-cen-tered"},"inflection":{"notes":"複合形容詞のため、比較変化はありません。"},"usage_notes":{"explanation":"「**leaving-centered**」は、特定の状況やプロセスにおいて「去る」という行為、またはその後の移行に重点を置くことを意味する専門的な用語です。心理学、社会学、組織行動などの分野で、変化、喪失、移行に関連する感情的、社会的、または実践的な側面に対処する際に使用されます。この用語は、単に物理的な移動だけでなく、人間関係の終焉、キャリアの変化、または人生の段階の移行など、より抽象的な「去る」という概念にも適用できます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company had a leaving-centered party for the employee.","correct":"✓ The company had a farewell party for the employee.","note":"「leaving-centered」は、イベント自体ではなく、アプローチや戦略を説明するために使用されます。従業員の送別会には「farewell party」が適切です。"},{"incorrect":"✗ He was very leaving-centered and didn't care about the new place.","correct":"✓ He was focused on leaving and didn't care about the new place.","note":"人の性格や態度を説明するのではなく、プロセスや戦略を説明するために「leaving-centered」を使用します。"}],"priority":"★★☆"},"related_words":{"derivatives":["leaving (動名詞: 去ること、出発)","centered (形容詞: 中心に置かれた、焦点を当てられた)"],"phrasal_verbs":["N/A"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門的な文脈でのみ使用されるため)","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**leaving-centered**」は、心理学や社会学などの専門分野で使われる言葉で、何かを「去る」という行為に焦点を当てていることを意味します。例えば、人間関係が終わるときに、その「別れ」という過程を重視したカウンセリングやアプローチを「leaving-centered」と表現します。日常会話ではあまり使いませんが、専門的な文脈で、特定の状況における「去ること」の重要性を強調したい場合に用います。"},"example_sentences":[{"sentence":"The program provides leaving-centered support to help individuals adjust to life after incarceration.","translation":"そのプログラムは、個人が投獄後の生活に適応できるよう、去ることを中心としたサポートを提供している。","type":"adjective","meaning_category":"心理学・社会学"},{"sentence":"A leaving-centered curriculum was designed to prepare students for the transition from high school to college.","translation":"生徒が高等学校から大学への移行に備えるため、去ることを中心としたカリキュラムが設計された。","type":"adjective","meaning_category":"教育"},{"sentence":"The organization developed a leaving-centered plan to assist employees who were being laid off.","translation":"その組織は、解雇される従業員を支援するため、去ることを中心とした計画を策定した。","type":"adjective","meaning_category":"組織行動"}]}