{"word":"Mongolo-Manchurian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"モンゴル・満州の、モンゴル・満州系の","english_definition":"Relating to both Mongolia and Manchuria, or to the peoples or languages of those regions.","examples":[{"sentence":"The Mongolo-Manchurian languages share certain linguistic features.","translation":"モンゴル・満州語族は、特定の言語的特徴を共有している。"},{"sentence":"The region has a rich history influenced by both Mongolo-Manchurian and Chinese cultures.","translation":"この地域は、モンゴル・満州と中国の両方の文化の影響を受けた豊かな歴史を持っている。"}],"collocations":["Mongolo-Manchurian languages","Mongolo-Manchurian culture","Mongolo-Manchurian region"],"synonyms":["Mongol-Manchu","Mongolian-Manchurian"],"antonyms":[]}],"etymology":{"value":"The term combines \"Mongolo-\" referring to Mongolia, and \"Manchurian\" referring to Manchuria, reflecting the historical and cultural connections between these regions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɒŋɡəloʊ mænˈtʃʊəriən/","syllables":"Mon-go-lo-Man-chu-ri-an"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"The term 'Mongolo-Manchurian' is used in historical, linguistic, and anthropological contexts to describe shared characteristics or connections between Mongolia and Manchuria. It can refer to languages, cultures, or peoples of these regions. The term may sometimes carry historical or political connotations, so it should be used with sensitivity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Mongolo-Manchurian is a person.","correct":"✓ A Mongolo-Manchurian person is from the region.","note":"'Mongolo-Manchurian' is an adjective, not a noun referring to a person. To refer to a person, use 'a Mongolo-Manchurian person' or specify their ethnicity (e.g., Mongol, Manchu)."}],"priority":"★★☆"},"related_words":{"derivatives":["Mongol","Manchurian","Mongolia","Manchuria"],"phrases":[]},"level_frequency":{"frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Mongolo-Manchurian' is a specialized term used in academic and historical contexts. It refers to the regions of Mongolia and Manchuria and their related cultures, languages, or peoples. Due to its specific usage and potential for misinterpretation, it is important to use this term with care and in appropriate contexts."},"example_sentences":[{"sentence":"Scholars study the Mongolo-Manchurian influences on the art of the Liao dynasty.","translation":"学者たちは、遼の時代の芸術に対するモンゴル・満州の影響を研究している。","type":"adjective","meaning_category":"Relating to Mongolia and Manchuria"},{"sentence":"The Mongolo-Manchurian languages are part of a larger Altaic language family theory.","translation":"モンゴル・満州語族は、より大きなアルタイ語族の理論の一部である。","type":"adjective","meaning_category":"Relating to the languages of Mongolia and Manchuria"}]}