{"word":"bispore","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学) 2つの胞子を持つ構造、特に特定の菌類に見られる","english_definition":"(biology) A structure containing two spores, especially in certain fungi.","examples":[{"sentence":"The bispore asci are characteristic of this fungal species.","translation":"この菌類種の特徴は、2つの胞子を持つ子のう胞です。"}],"collocations":["bispore ascus","bispore formation"],"synonyms":["diaspore"],"antonyms":[]}],"etymology":{"value":"'bi-' (two) + 'spore'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbaɪspɔːr/","syllables":"bi-spore"},"inflection":{"noun_plural":"bispores"},"usage_notes":{"explanation":"'Bispore' is a technical term used in mycology (the study of fungi) to describe a structure, typically an ascus (a sac-like structure containing spores), that contains two spores instead of the more common four or eight. It's important to note that this term is specific to certain types of fungi.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant has bispores.","correct":"✓ The fungus has bispores.","note":"'Bispores' are generally associated with fungi, not plants."}],"priority":"★☆☆"},"related_words":{"derivatives":["bisporic (adjective: relating to or having two spores)"],"related_terms":["ascus","spore","fungus","mycology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. A specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bispore' is a highly specialized term used in the field of mycology. Understanding requires familiarity with basic biological concepts such as spores and asci, as well as a knowledge of fungal reproductive structures. The term is unlikely to be encountered outside of scientific contexts related to fungi.","priority":"★★☆"},"example_sentences":[{"sentence":"The presence of bispore asci is a key characteristic used to identify this species of fungus.","translation":"二胞子嚢の存在は、この種の菌類を特定するために使用される重要な特徴です。","type":"noun","meaning_category":"biology"}]}