{"word":"Tiercels","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"plural of tiercel","english_definition":"plural form of tiercel, which refers to the male of certain species of falcon and hawk, especially the peregrine falcon, that is about one-third smaller than the female.","examples":[{"sentence":"The tiercels are known for their agility in flight.","translation":"雄のハヤブサ（tiercel）は、飛行中の敏捷性で知られています。"}],"collocations":["tiercel peregrine","young tiercels"],"synonyms":["male falcon","male hawk"],"antonyms":["female falcon","falcon (female)"]}],"etymology":{"value":"From Old French tercel, meaning 'one third', referring to the male falcon being about one-third smaller than the female.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɪərsəlz/","syllables":"Tier-cels"},"inflection":{"noun_plural":"Tiercels"},"usage_notes":{"explanation":"'Tiercels' is specifically used in the context of falconry and ornithology to distinguish male falcons, particularly peregrine falcons, from the larger females. It is not a commonly used word outside of these fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tiercels are very big birds.","correct":"✓ The tiercels are smaller than the females.","note":"Tiercels, by definition, are smaller than the female falcons."}],"priority":"★★☆"},"related_words":{"derivatives":["tiercel"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tiercels' is a specialized term primarily used in falconry and ornithology to refer to male falcons that are smaller than their female counterparts. Due to its specific usage, it is not a common word and is typically encountered in texts related to birds of prey or falconry practices."},"example_sentences":[{"sentence":"Experienced falconers can easily distinguish the tiercels from the larger females.","translation":"経験豊富な鷹匠は、雄のハヤブサ（tiercel）をより大きな雌から容易に見分けることができます。","type":"noun","meaning_category":"male falcon"},{"sentence":"The tiercels often exhibit remarkable aerial displays during courtship.","translation":"雄のハヤブサ（tiercel）は、求愛中に注目に値する空中ディスプレイをしばしば披露します。","type":"noun","meaning_category":"male falcon"}]}