{"word":"Blatchang","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A condiment made from dried shrimp, garlic, chili, and spices, popular in Burmese cuisine.","english_definition":"A Burmese condiment made from dried shrimp, garlic, chili, and spices.","examples":[{"sentence":"She added a spoonful of Blatchang to her rice.","translation":"彼女はご飯にブラチャンをスプーン一杯加えた。"},{"sentence":"Blatchang is often eaten with rice and vegetables.","translation":"ブラチャンはしばしばご飯や野菜と一緒に食べられる。"}],"collocations":["eat with rice","add to dishes","Burmese cuisine"],"synonyms":["Ngapi jaw","dried shrimp relish"],"antonyms":[]}],"etymology":{"value":"Derived from Burmese culinary traditions, reflecting the ingredients and preparation methods common in Burmese cuisine.","priority":"★☆☆"},"pronunciation":{"ipa":"/blætʃæŋ/","syllables":"blat-chang"},"inflection":{"noun_plural":"Blatchangs"},"usage_notes":{"explanation":"Blatchang is a flavorful condiment used to enhance the taste of various dishes. It is a staple in Burmese cuisine and is often homemade.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I don't like Blatchang because it's too sweet.","correct":"✓ I don't like Blatchang because it's too spicy.","note":"Blatchang is typically spicy, not sweet."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Blatchang is a specialized culinary term primarily used within the context of Burmese cuisine. Understanding and use of this term requires familiarity with Burmese food culture. It is not commonly used outside of this context."},"example_sentences":[{"sentence":"The aroma of Blatchang filled the kitchen as she prepared dinner.","translation":"夕食の準備をしていると、ブラチャンの香りが台所に広がった。","type":"noun","meaning_category":"condiment"},{"sentence":"Many Burmese restaurants offer Blatchang as a side dish.","translation":"多くのビルマ料理レストランでは、ブラチャンを付け合わせとして提供している。","type":"noun","meaning_category":"condiment"}]}