{"word":"solid-ported","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(機械工学)ソリッドポート式の、ソリッドポート構造の","english_definition":"(Mechanical Engineering) Describes a device or system that utilizes solid ports, typically referring to a specific design or construction method.","examples":[{"sentence":"The solid-ported rotary valve offers improved sealing compared to traditional designs.","translation":"そのソリッドポート式ロータリーバルブは、従来の設計に比べてシール性が向上しています。"},{"sentence":"This engine features a solid-ported intake system for enhanced performance.","translation":"このエンジンは、性能向上のためにソリッドポート式吸気システムを備えています。"}],"collocations":["solid-ported rotary valve","solid-ported intake system","solid-ported engine"],"synonyms":["N/A"],"antonyms":["N/A"]}],"etymology":{"value":"The term 'solid-ported' is a compound word combining 'solid' and 'ported'. 'Solid' refers to the material construction, emphasizing the use of solid components. 'Ported' indicates the presence of ports or openings for fluid or gas flow.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɒlɪd ˈpɔːrtɪd/","syllables":"sol-id-port-ed"},"inflection":{"notes":"This is an adjective, so it does not inflect."},"usage_notes":{"explanation":"'Solid-ported' is a technical term primarily used in mechanical engineering, particularly in the context of engines, valves, and other fluid control systems. It describes a design where ports (openings for fluid or gas flow) are created within solid components, often to improve sealing, reduce leakage, or enhance performance. The term is not commonly used outside of specialized engineering contexts.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["port","solid","rotary valve"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'solid-ported' is a specialized technical term used primarily in mechanical engineering. Understanding it requires familiarity with the concepts of ports (openings for fluid flow) and solid construction methods in mechanical systems. It is not a term commonly encountered in general English. Therefore, a high level of technical knowledge is necessary to fully comprehend its meaning and application."},"example_sentences":[{"sentence":"The efficiency of the solid-ported pump is significantly higher than that of conventional designs.","translation":"そのソリッドポート式ポンプの効率は、従来の設計よりも大幅に高いです。","type":"adjective","meaning_category":"Technical Specification"},{"sentence":"Engineers are experimenting with solid-ported injectors to reduce fuel consumption.","translation":"エンジニアたちは、燃料消費量を削減するためにソリッドポート式インジェクターを試作しています。","type":"adjective","meaning_category":"Technical Specification"}]}