{"word":"opsonic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"オプソニン作用の、オプソニンに関する","english_definition":"Relating to or promoting opsonization.","examples":[{"sentence":"Opsonic antibodies enhance phagocytosis.","translation":"オプソニン抗体は食作用を促進する。"}],"collocations":["opsonic activity","opsonic antibody","opsonic index"],"synonyms":["immunizing","sensitizing"],"antonyms":[]}],"etymology":{"value":"Derived from 'opsonin', which comes from the Greek 'opsōneîn' meaning 'to prepare food for'. This refers to the opsonins' role in preparing pathogens for phagocytosis, making them more palatable to phagocytes.","priority":"★★☆"},"pronunciation":{"ipa":"/ɒpˈsɒnɪk/","syllables":"op-son-ic"},"inflection":{"notes":"Adjective; no comparative or superlative forms."},"usage_notes":{"explanation":"'Opsonic' is a technical term used in immunology. It describes substances or processes that enhance phagocytosis, the process by which cells engulf and destroy pathogens or other particles. It's often used in the context of antibodies or complement proteins that coat pathogens, making them more easily recognized and ingested by phagocytes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The opsonic effect was reduced by the antibiotic.","correct":"✓ The opsonic activity was reduced by the antibiotic.","note":"'Opsonic effect' is less common than 'opsonic activity'. It's better to use 'opsonic activity' to describe the function. Antibiotics don't directly affect the opsonic effect."}],"priority":"★☆☆"},"related_words":{"derivatives":["opsonin (noun): A substance (e.g., an antibody or complement protein) that binds to foreign microorganisms or cells, making them more susceptible to phagocytosis.","opsonization (noun): The process by which a pathogen is marked for ingestion and destruction by a phagocyte."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Opsonic' is a highly specialized term within the field of immunology. Understanding its meaning requires familiarity with concepts such as phagocytosis, antibodies, and complement systems. It's primarily encountered in scientific literature, research papers, and advanced textbooks on immunology and microbiology. Its usage is limited to contexts where the enhancement of phagocytosis is specifically relevant.","priority":"★☆☆"},"example_sentences":[{"sentence":"The serum exhibited strong opsonic properties against the bacteria.","translation":"その血清は、その細菌に対して強いオプソニン作用を示した。","type":"adjective","meaning_category":"オプソニン作用の"},{"sentence":"Deficiency in certain complement components can impair opsonic function.","translation":"特定の補体成分の欠乏は、オプソニン機能を損なう可能性がある。","type":"adjective","meaning_category":"オプソニンに関する"}]}