{"word":"underdrudgery","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"下積み労働、つまらない雑用、苦役の下での労働","english_definition":"Labor performed under conditions of drudgery; menial, tedious, or unpleasant work performed in a subordinate position.","examples":[{"sentence":"He started in the company doing underdrudgery, but quickly rose through the ranks.","translation":"彼は会社で下積み労働から始めたが、すぐに昇進した。"},{"sentence":"The interns were assigned to underdrudgery tasks, such as filing and making coffee.","translation":"インターンたちは、ファイル整理やコーヒー作りといった下積み労働の仕事に割り当てられた。"},{"sentence":"She felt trapped in underdrudgery, with no opportunity for advancement.","translation":"彼女は昇進の機会もなく、下積み労働に閉じ込められていると感じた。"}],"collocations":["perform underdrudgery","assigned to underdrudgery","escape underdrudgery","underdrudgery tasks","underdrudgery work"],"synonyms":["menial labor","grunt work","toil","servitude","chores","donkeywork"],"antonyms":["executive work","managerial duties","creative work","fulfilling work","skilled labor"]},{"part_of_speech":"noun","definition":"苦役状態、単調で退屈な労働環境","english_definition":"The state or condition of being subjected to drudgery; a situation characterized by monotonous and unpleasant labor.","examples":[{"sentence":"He wanted to escape the underdrudgery of his factory job.","translation":"彼は工場での単調で退屈な労働環境から抜け出したかった。"},{"sentence":"The software was designed to alleviate the underdrudgery of data entry.","translation":"そのソフトウェアは、データ入力の単調で退屈な労働環境を軽減するために設計された。"},{"sentence":"She found the underdrudgery of her daily routine unbearable.","translation":"彼女は毎日のルーチンの単調で退屈な労働環境に耐えられなかった。"}],"collocations":["escape the underdrudgery","alleviate the underdrudgery","end the underdrudgery","the underdrudgery of daily routine","the underdrudgery of factory work"],"synonyms":["tedium","monotony","boredom","routine","grind","dullness"],"antonyms":["excitement","stimulation","variety","challenge","interest"]}],"etymology":{"value":"Derived from 'under' (meaning beneath or subordinate) and 'drudgery' (meaning hard, menial, or monotonous work). The term combines the sense of being in a lower position with the nature of the work being tedious and unpleasant.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈdrʌdʒəri/","syllables":"un-der-drud-ger-y"},"inflection":{"noun_plural":"underdrudgeries"},"usage_notes":{"explanation":"'Underdrudgery' refers to work that is not only tedious and unpleasant (drudgery) but also performed in a subordinate or lower-status position. It often implies a lack of opportunity for advancement or personal fulfillment. The term is relatively uncommon but can be useful to describe situations where someone is stuck doing menial tasks with little hope of improvement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was doing under drudgery work.","correct":"✓ He was doing underdrudgery.","note":"'Underdrudgery' is a noun, so it doesn't need 'work' after it. You can also say 'He was doing underdrudgery tasks' or 'He was doing underdrudgery work'."},{"incorrect":"✗ The underdrudgery was very exciting.","correct":"✓ The underdrudgery was very tedious.","note":"'Underdrudgery' inherently implies tediousness and unpleasantness, so 'exciting' is contradictory."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["drudgery","menial labor","grunt work","toil","servitude","chores","donkeywork"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Underdrudgery' is a relatively rare and sophisticated term used to describe menial, tedious, and unpleasant work performed in a subordinate position. Its usage often implies a lack of opportunity for advancement or personal fulfillment. Understanding this term requires a strong grasp of vocabulary and an ability to infer meaning from context. It is not typically encountered in everyday language but may appear in literature or professional contexts when discussing workplace dynamics and social hierarchies."},"example_sentences":[{"sentence":"Many young professionals start their careers with underdrudgery before moving into more challenging roles.","translation":"多くの若い専門家は、より挑戦的な役割に移る前に、下積み労働からキャリアをスタートさせる。","type":"general","meaning_category":"下積み労働"},{"sentence":"The new software aimed to eliminate much of the underdrudgery associated with manual data processing.","translation":"新しいソフトウェアは、手動データ処理に伴う多くの単調な作業を排除することを目的としていた。","type":"general","meaning_category":"苦役状態"},{"sentence":"She felt stuck in underdrudgery, with no clear path to promotion or professional growth.","translation":"彼女は昇進や専門的な成長への明確な道筋がなく、下積み労働に閉じ込められていると感じていた。","type":"general","meaning_category":"下積み労働"}]}