{"word":"subcollege","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に大学内で)下位の学群、学部内の分科組織、あるいは小規模な教育機関","english_definition":"A smaller, constituent academic unit within a larger college or university; a subdivision of a faculty or department; or a minor educational institution.","examples":[{"sentence":"The university's engineering department was divided into several subcolleges, each specializing in a different area.","translation":"その大学の工学部は、それぞれ異なる分野を専門とするいくつかの下位学群に分かれていた。"},{"sentence":"The subcollege offered specialized courses not available in the main university curriculum.","translation":"その下位学群は、大学の主要なカリキュラムでは利用できない専門コースを提供していた。"}],"collocations":["academic subcollege","department subcollege","university subcollege"],"synonyms":["department","division","school","faculty","institute"],"antonyms":["college","university"]}],"etymology":{"value":"Formed by combining the prefix 'sub-' (meaning 'under', 'below', or 'subordinate') with the noun 'college'.","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˈkɒlɪdʒ/","syllables":"sub-col-lege"},"inflection":{"noun_plural":"subcolleges"},"usage_notes":{"explanation":"The term 'subcollege' is not widely used and may not be recognized in all contexts. It generally refers to a smaller academic unit within a larger college or university. The exact meaning can vary depending on the institution. It can refer to a subdivision of a faculty or department, or a smaller, more specialized educational institution affiliated with a larger university.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is studying at the subcollege of science.","correct":"✓ He is studying in the subcollege of science. / ✓ He is studying at the science subcollege.","note":"The preposition 'in' or 'at' is more appropriate than 'at the' when referring to studying within a subcollege. The order of words might also need adjustment depending on the context."}],"priority":"★☆☆"},"related_words":{"derivatives":["subcollegiate (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'subcollege' is relatively uncommon and may require some background knowledge of academic organizational structures to fully understand. It refers to a smaller unit within a larger college or university, similar to a department or division. The specific meaning can vary depending on the context and the institution using the term."},"example_sentences":[{"sentence":"The medical school operated as a subcollege within the larger university system.","translation":"その医学校は、より大規模な大学システム内の下位学群として運営されていた。","type":"noun","meaning_category":"下位の学群"},{"sentence":"Each subcollege had its own dean and administrative staff.","translation":"各下位学群には、独自の学部長と管理スタッフがいた。","type":"noun","meaning_category":"下位の学群"}]}