{"word":"Amalekite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アマレク人：古代イスラエル人の敵対民族","english_definition":"A member of an ancient nomadic people who inhabited the Negev desert and parts of the Sinai Peninsula, and were traditional enemies of the Israelites.","examples":[{"sentence":"The Amalekites were known for their fierce resistance against the Israelites.","translation":"アマレク人は、イスラエル人に対する激しい抵抗で知られていた。"},{"sentence":"According to the Hebrew Bible, God commanded the Israelites to exterminate the Amalekites.","translation":"ヘブライ聖書によれば、神はイスラエル人にアマレク人を根絶するよう命じた。"}],"collocations":["defeat the Amalekites (アマレク人を打ち負かす)","exterminate the Amalekites (アマレク人を根絶する)","war against the Amalekites (アマレク人との戦い)"],"synonyms":["none"],"antonyms":["none"]}],"etymology":{"value":"Derived from the Hebrew word 'Amaleq' (עֲמָלֵק), which is the name of the eponymous ancestor of the Amalekites. The meaning of the name is uncertain, but some scholars suggest it may be related to the Hebrew word for 'dwelling in a valley'.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈmælɪkaɪt/","syllables":"A-ma-le-kite"},"inflection":{"noun_plural":"Amalekites"},"usage_notes":{"explanation":"The term 'Amalekite' refers specifically to this ancient people mentioned in the Hebrew Bible. It often carries a negative connotation due to their historical role as enemies of the Israelites. The term is primarily used in historical or religious contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an Amalek.","correct":"✓ He is an Amalekite.","note":"'Amalek' refers to the ancestor or the nation, while 'Amalekite' refers to an individual member of the nation."}],"priority":"★★☆"},"related_words":{"derivatives":["Amalek (noun: アマレク - アマレク人の祖先または国)"],"phrases":["Remember what the Amalekites did to you (アマレク人があなたにしたことを忘れないでください - 聖書の引用)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very low frequency, specific historical/religious term)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 聖書や歴史関連の文脈でのみ使用される。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Amalekite' is a highly specific term referring to an ancient people mentioned in the Hebrew Bible. Understanding requires familiarity with biblical history and religious texts. The term is rarely used outside of these contexts.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The Israelites fought many battles against the **Amalekites**.","translation":"イスラエル人はアマレク人との間で多くの戦いを繰り広げた。","type":"noun","meaning_category":"民族"},{"sentence":"The Bible describes the **Amalekites** as a ruthless enemy.","translation":"聖書はアマレク人を冷酷な敵として描写している。","type":"noun","meaning_category":"民族"}]}