{"word":"tachyphrenia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"思考加速症、思考奔逸","english_definition":"A condition in which thoughts race and flit from one idea to another quickly.","examples":[{"sentence":"Tachyphrenia is a symptom of mania.","translation":"思考加速は躁病の症状の一つです。"},{"sentence":"The patient exhibited tachyphrenia during the interview.","translation":"患者は面談中に思考加速を示した。"}],"collocations":["experience tachyphrenia","exhibit tachyphrenia","suffer from tachyphrenia"],"synonyms":["racing thoughts","flight of ideas"],"antonyms":["bradyphrenia","slowed thinking"]}],"etymology":{"value":"From Greek 'tachys' (fast) + 'phren' (mind) + '-ia' (condition).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtækɪˈfriːniə/","syllables":"ta-chy-phre-ni-a"},"inflection":{"noun_plural":"tachyphrenias"},"usage_notes":{"explanation":"Tachyphrenia is a medical term primarily used in psychiatry to describe a rapid flow of thought. It is often associated with mental health conditions such as mania, bipolar disorder, and certain anxiety disorders. It is characterized by an accelerated pace of thinking, making it difficult for the individual to focus on a single thought or idea.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He had tachyphrenia and could not move.","correct":"✓ He had tachyphrenia and his thoughts were racing.","note":"Tachyphrenia affects thought processes, not physical movement."},{"incorrect":"✗ Tachyphrenia is a type of phobia.","correct":"✓ Tachyphrenia is a condition of rapid thought.","note":"Tachyphrenia is related to thought speed, not fear."}],"priority":"★★☆"},"related_words":{"derivatives":["tachyphrenic (adjective)"],"phrases":["flight of ideas","racing thoughts"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. Primarily used in medical and psychiatric contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tachyphrenia' is a specialized term used in the fields of psychiatry and psychology to describe an abnormally rapid rate of thought. It's not commonly used in everyday conversation but is important in clinical settings for diagnosing and understanding certain mental health conditions. The word is derived from Greek roots, indicating 'fast mind.'"},"example_sentences":[{"sentence":"The psychiatrist noted the patient's tachyphrenia during the mental status examination.","translation":"精神科医は精神状態検査中に患者の思考加速に注目した。","type":"clinical context","meaning_category":"rapid thought"},{"sentence":"Tachyphrenia can make it difficult to follow a coherent train of thought.","translation":"思考加速は一貫した思考の流れを追うことを困難にする可能性がある。","type":"general description","meaning_category":"difficulty focusing"},{"sentence":"Medication can sometimes help to manage the symptoms of tachyphrenia.","translation":"薬物療法は思考加速の症状を管理するのに役立つことがある。","type":"treatment context","meaning_category":"symptom management"}]}