{"word":"Jacksonian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ジャクソン大統領の、アンドリュー・ジャクソンに関連する","english_definition":"Relating to Andrew Jackson, seventh president of the United States (1829-1837), or his policies and era.","examples":[{"sentence":"The Jacksonian era was marked by increased democracy and westward expansion.","translation":"ジャクソン時代は、民主主義の拡大と西部への拡大によって特徴づけられました。"},{"sentence":"Jacksonian democracy emphasized the common man's participation in government.","translation":"ジャクソン流民主主義は、一般の人々の政治参加を重視しました。"}],"collocations":["Jacksonian democracy","Jacksonian era","Jacksonian policies"],"synonyms":["Democratic","Populist"],"antonyms":["Aristocratic","Elitist"]},{"part_of_speech":"noun","definition":"ジャクソン支持者、ジャクソン主義者","english_definition":"A supporter of Andrew Jackson or Jacksonian principles.","examples":[{"sentence":"The Jacksonians believed in limited government and states' rights.","translation":"ジャクソン支持者たちは、小さな政府と州の権利を信じていました。"}],"collocations":["Follower of Jackson","Supporter of Jacksonian Democracy"],"synonyms":["Democrat","Populist"],"antonyms":["Whig","National Republican"]}],"etymology":{"value":"Named after Andrew Jackson, the seventh President of the United States.","priority":"★★★"},"pronunciation":{"ipa":"/dʒækˈsoʊniən/","syllables":"Jack-so-ni-an"},"inflection":{"notes":"Adjective and noun forms exist. Noun form is typically capitalized."},"usage_notes":{"explanation":"The term 'Jacksonian' generally refers to the political and social ideas associated with Andrew Jackson's presidency. It often implies a belief in greater democracy for the common man, westward expansion, and a strong executive branch. The term is primarily used in historical and political contexts when discussing American history.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Jacksonian artist.","correct":"✓ He was an artist during the Jacksonian era.","note":"Unless the artist's work directly reflects Jacksonian ideals, it's better to say they were an artist 'during the Jacksonian era' rather than a 'Jacksonian artist'."}],"priority":"★★☆"},"related_words":{"derivatives":["Jacksonianism (noun: the principles and policies of Andrew Jackson)"],"phrases":["Era of the Common Man"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent, primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Jacksonian' is primarily used in the context of American history and political science. Understanding requires familiarity with the presidency of Andrew Jackson and the key tenets of Jacksonian democracy, such as popular sovereignty, westward expansion, and a strong executive branch. The term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The **Jacksonian** Democrats championed the cause of the common man.","translation":"ジャクソン流民主主義者たちは、一般の人々の大義を擁護しました。","type":"adjective","meaning_category":"Relating to Andrew Jackson"},{"sentence":"As a **Jacksonian**, he opposed the national bank.","translation":"ジャクソン主義者として、彼は国立銀行に反対しました。","type":"noun","meaning_category":"Supporter of Andrew Jackson"}]}