{"word":"brachycranic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"短頭の、短頭型の","english_definition":"Having a short, broad head; pertaining to or characterized by brachycrania.","examples":[{"sentence":"The skeleton was identified as brachycranic.","translation":"その骨格は短頭型であると特定された。"},{"sentence":"Brachycranic skulls are more rounded in shape.","translation":"短頭型の頭蓋骨はより丸みを帯びた形をしている。"}],"collocations":["brachycranic skull","brachycranic index"],"synonyms":["brachycephalic"],"antonyms":["dolichocranic","dolichocephalic"]}],"etymology":{"value":"From Greek brachys 'short' + kranion 'skull'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌbrækɪˈkreɪnɪk/","syllables":"bra-chy-cra-nic"},"inflection":{"notes":"Comparative and superlative forms are possible (more brachycranic, most brachycranic) but rarely used."},"usage_notes":{"explanation":"'Brachycranic' is a technical term used in anthropology and related fields to describe a skull shape that is short and broad. It is often used interchangeably with 'brachycephalic', although 'brachycranic' specifically refers to the cranial vault, while 'brachycephalic' refers to the head as a whole.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The baby's head is brachycranic, so we should worry.","correct":"✓ The baby's head is slightly brachycranic, which is normal for some ethnicities.","note":"Brachycephaly (and brachycrania) can be normal variations, especially in certain ethnic groups. It is not necessarily a cause for concern unless accompanied by other symptoms."}],"priority":"★☆☆"},"related_words":{"derivatives":["brachycrania (noun): The condition of having a short, broad head.","brachycephalic (adjective): Having a short, broad head (often used interchangeably).","cephalic index (noun): A measure of head shape, used to classify heads as brachycephalic, dolichocephalic, or mesocephalic."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Brachycranic' is a specialized term primarily used in anthropology and medicine to describe a skull shape characterized by its breadth being significantly greater than its length. This term is often used in the context of cranial measurements and indices to classify different head shapes. Understanding this term requires familiarity with anatomical terminology and anthropological concepts related to human variation. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"Anthropological studies often classify skulls based on whether they are dolichocranic, mesocranic, or brachycranic.","translation":"人類学の研究では、頭蓋骨が長頭型、中頭型、または短頭型であるかに基づいて分類されることが多い。","type":"adjective","meaning_category":"anthropology"},{"sentence":"The brachycranic index of the skull was calculated to be 85.","translation":"その頭蓋骨の短頭指数は85と計算された。","type":"adjective","meaning_category":"anthropology"}]}