{"word":"immanency","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"内在、内包、遍在","english_definition":"The state or condition of being immanent; inherence. The philosophical doctrine that God is present everywhere and in everything.","examples":[{"sentence":"The immanency of God is a central concept in many religions.","translation":"神の遍在性は多くの宗教において中心的な概念です。"},{"sentence":"He discussed the immanency of the divine in nature.","translation":"彼は自然における神性の内在について議論した。"},{"sentence":"The poem explores the immanency of beauty in everyday life.","translation":"その詩は日常生活における美の遍在性を探求している。"}],"collocations":["divine immanency (神の遍在)","immanency of God (神の遍在)","philosophical immanency (哲学的な内在)"],"synonyms":["inherence","indwelling","presence","pervasion","omnipresence"],"antonyms":["transcendence","otherness","exteriority"]}],"etymology":{"value":"From Late Latin *immanentia*, from *immanens* (present everywhere, indwelling), present participle of *immanere* (to remain in, dwell in), from *in-* (in) + *manere* (to remain).","priority":"★★★"},"pronunciation":{"ipa":"ˈɪmənənsi","syllables":"im-ma-nen-cy"},"inflection":{"noun_plural":"immanencies"},"usage_notes":{"explanation":"The word 'immanency' refers to the state of being immanent, meaning present within something or pervading throughout. It is often used in philosophical or theological contexts to describe the presence of God or a divine force within the world and its creations, as opposed to being separate or transcendent. It can also refer to the inherence of a quality or characteristic within something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The immanence of the problem was obvious.","correct":"✓ The immediacy of the problem was obvious.","note":"'Immanency' refers to being present within something, while 'immediacy' refers to being immediate or urgent. Use 'immediacy' when referring to the urgency or obviousness of a problem."},{"incorrect":"✗ The immanency of the event surprised everyone.","correct":"✓ The imminence of the event surprised everyone.","note":"'Immanency' refers to being present within, while 'imminence' refers to something being about to happen. Use 'imminence' when referring to an event that is about to occur."}],"priority":"★★☆"},"related_words":{"derivatives":["immanent (adjective)","immanently (adverb)"],"phrasal_verbs":[],"related_concepts":["pantheism","panentheism","theism","naturalism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in philosophical and theological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Immanency' is a relatively advanced term, primarily used in philosophical and theological discussions. It refers to the idea that something, often a divine presence or principle, is inherent and present within the world and its phenomena, rather than being separate or external. Understanding this term requires familiarity with abstract concepts and philosophical vocabulary."},"example_sentences":[{"sentence":"The philosopher argued for the immanency of reason in the natural world.","translation":"その哲学者は自然界における理性の内在性を主張した。","type":"general","meaning_category":"philosophical concept"},{"sentence":"The artist sought to capture the immanency of beauty in ordinary objects.","translation":"その芸術家は日常の物体における美の遍在性を捉えようとした。","type":"general","meaning_category":"artistic expression"},{"sentence":"The theologian explored the doctrine of divine immanency in relation to human experience.","translation":"その神学者は人間の経験に関連して神の遍在性の教義を探求した。","type":"general","meaning_category":"theological concept"}]}