{"word":"presurprise","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A surprise that was planned or anticipated beforehand.","english_definition":"A surprise that is not entirely unexpected, often because of hints or prior knowledge.","examples":[{"sentence":"The party wasn't a complete surprise; it was more of a presurprise since I knew something was up.","translation":"パーティーは完全なサプライズではなかった。何かが起こることは知っていたので、どちらかというと予定調和的なサプライズだった。"},{"sentence":"She called it a surprise party, but with all the planning emails, it felt more like a presurprise.","translation":"彼女はそれをサプライズパーティーと呼んだが、計画に関するメールがたくさんあったので、予定調和的なサプライズのように感じられた。"}],"collocations":["planned presurprise","anticipated presurprise","organized presurprise"],"synonyms":["semi-surprise","expected surprise","foreseen surprise"],"antonyms":["genuine surprise","complete surprise","total surprise"]}],"etymology":{"value":"Formed by adding the prefix 'pre-' (meaning 'before' or 'prior to') to the word 'surprise'. Indicates a surprise that is known or expected to some degree in advance.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːsərˈpraɪz/","syllables":"pre-sur-prise"},"inflection":{"noun_plural":"presurprises"},"usage_notes":{"explanation":"The term 'presurprise' is often used humorously or ironically to describe a situation where a surprise is not truly surprising because the recipient has some prior knowledge or expectation of it. It implies a level of anticipation that diminishes the element of genuine surprise.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ It was a total presurprise.","correct":"✓ It was a presurprise. / ✓ It was almost a surprise.","note":"'Presurprise' implies that it was not a complete or total surprise, so using 'total' with it is contradictory."},{"incorrect":"✗ I was completely presurprised.","correct":"✓ I was somewhat expecting it. / ✓ I had a feeling something was going to happen.","note":"'Presurprise' is a noun, not a verb or adjective that describes a state of being. Instead, describe the feeling of anticipation."}],"priority":"★★☆"},"related_words":{"derivatives":["pre-surprise (hyphenated form)"],"phrases":["not really a surprise","kind of expected","sort of a surprise"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Presurprise' is a relatively uncommon word that describes a situation where a surprise is somewhat expected or anticipated. It's often used humorously to point out that the surprise was not entirely unexpected. The word combines 'pre-' (meaning 'before') and 'surprise', indicating that some element of the surprise was known beforehand."},"example_sentences":[{"sentence":"The 'surprise' party was a bit of a presurprise, since I saw the decorations being put up earlier.","translation":"「サプライズ」パーティーは、少し予定調和的だった。なぜなら、以前に飾り付けがされているのを見たからだ。","type":"noun","meaning_category":"anticipated surprise"},{"sentence":"It wasn't a shock when he proposed; it was more of a presurprise after dating for ten years.","translation":"彼がプロポーズしたとき、それは衝撃ではなかった。10年間付き合っていたので、どちらかというと予定調和的なサプライズだった。","type":"noun","meaning_category":"anticipated surprise"}]}