{"word":"pseudopregnancy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"想像妊娠、偽妊娠","english_definition":"A condition in female mammals (including humans) in which the body simulates pregnancy, even though the individual is not pregnant.","examples":[{"sentence":"She exhibited all the signs of pregnancy, but it turned out to be pseudopregnancy.","translation":"彼女は妊娠の兆候をすべて示したが、それは想像妊娠だと判明した。"},{"sentence":"Pseudopregnancy can occur in dogs after their estrus cycle.","translation":"犬では発情期の後に想像妊娠が起こることがある。"}],"collocations":["experience pseudopregnancy","diagnose pseudopregnancy","hormonal changes in pseudopregnancy"],"synonyms":["false pregnancy","phantom pregnancy"],"antonyms":[]},{"part_of_speech":"noun","definition":"（比喩的に）何かを期待している状態だが、実際には何も起こらないこと","english_definition":"(Figuratively) A state of anticipating something that does not actually occur.","examples":[{"sentence":"The project felt like a pseudopregnancy; much anticipation, but no real outcome.","translation":"そのプロジェクトは想像妊娠のように感じられた。期待は大きかったが、実際には何も成果はなかった。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"\"pseudo-\" (偽の) + \"pregnancy\" (妊娠)","priority":"★★★"},"pronunciation":{"ipa":"ˌsuːdoʊˈprɛɡnənsi","syllables":"pseu-do-preg-nan-cy"},"inflection":{"noun_plural":"pseudopregnancies"},"usage_notes":{"explanation":"\"Pseudopregnancy\" refers to a condition where a female exhibits signs and symptoms of pregnancy without actually being pregnant. This is most commonly observed in animals, especially dogs, but can also occur in humans. Figuratively, it can describe a situation where there's much anticipation or expectation of something that ultimately doesn't materialize.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is having a pseudopregnancy.","correct":"✓ She is experiencing pseudopregnancy.","note":"Use \"experiencing\" or \"suffering from\" to describe the condition rather than \"having\"."},{"incorrect":"✗ Pseudopregnancy only happens to humans.","correct":"✓ Pseudopregnancy is more common in animals, especially dogs, but can also occur in humans.","note":"Correct the misconception that it only happens to humans."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudo- (prefix meaning false or fake)","pregnant (adjective: being in a state of pregnancy)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Pseudopregnancy\" is a specialized term primarily used in medical or veterinary contexts. It describes a condition where a female animal or human displays symptoms of pregnancy without actually being pregnant. The term is formed from the prefix \"pseudo-\" meaning false, and \"pregnancy\". Understanding this term requires some background knowledge in biology or medicine. It can also be used metaphorically to describe situations where there is anticipation without a real outcome."},"example_sentences":[{"sentence":"The vet confirmed that the dog was experiencing pseudopregnancy.","translation":"獣医は犬が想像妊娠を起こしていることを確認した。","type":"medical","meaning_category":"想像妊娠"},{"sentence":"Her symptoms closely mimicked those of early pregnancy, but it was just pseudopregnancy.","translation":"彼女の症状は妊娠初期のものとよく似ていたが、それはただの想像妊娠だった。","type":"medical","meaning_category":"想像妊娠"},{"sentence":"The project's initial excitement turned out to be a pseudopregnancy, with no tangible results.","translation":"プロジェクトの当初の興奮は想像妊娠に終わり、具体的な成果はなかった。","type":"figurative","meaning_category":"比喩的"}]}