{"word":"allochiral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(分子などが)アロキラルの、互いに重ね合わせることができない鏡像異性体の","english_definition":"(of a molecule, etc.) chiral; not superimposable on its mirror image.","examples":[{"sentence":"Allochiral molecules are of great importance in chemistry and biology.","translation":"アロキラルな分子は化学や生物学において非常に重要である。"},{"sentence":"The two forms of an allochiral molecule are called enantiomers.","translation":"アロキラルな分子の2つの形態はエナンチオマーと呼ばれる。"}],"collocations":["allochiral molecule","allochiral compound","allochiral structure"],"synonyms":["chiral","dissymmetric"],"antonyms":["achiral","symmetric"]}],"etymology":{"value":"The term 'allochiral' is derived from the Greek words 'allos' (other) and 'cheir' (hand), referring to the 'other-handedness' of chiral molecules.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæləˈkaɪrəl/","syllables":"al-lo-chi-ral"},"inflection":{"notes":"Adjective; comparative and superlative forms are generally not used."},"usage_notes":{"explanation":"'Allochiral' is a term used in chemistry, particularly stereochemistry, to describe molecules that are chiral, meaning they are non-superimposable on their mirror images. These molecules exist as enantiomers, which are mirror images of each other. The term is often used interchangeably with 'chiral,' although 'chiral' is more common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The allochiral molecule is superimposable on its mirror image.","correct":"✓ The allochiral molecule is not superimposable on its mirror image.","note":"Allochiral molecules, by definition, are not superimposable on their mirror images."}],"priority":"★☆☆"},"related_words":{"derivatives":["chirality (名詞: キラリティー、掌性)","enantiomer (名詞: エナンチオマー、鏡像異性体)","stereochemistry (名詞: 立体化学)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'allochiral' is a highly specialized term primarily used within the field of chemistry, specifically stereochemistry. It describes the property of a molecule being non-superimposable on its mirror image, a concept central to understanding enantiomers and chiral compounds. Due to its technical nature, it is not commonly encountered outside of advanced scientific contexts."},"example_sentences":[{"sentence":"The drug exhibits allochiral properties, leading to different biological effects for each enantiomer.","translation":"その薬はアロキラルな特性を示し、各エナンチオマーに対して異なる生物学的効果をもたらす。","type":"general","meaning_category":"general"},{"sentence":"The synthesis of a specific allochiral compound is a challenging task in organic chemistry.","translation":"特定のアロキラル化合物の合成は、有機化学において困難な課題である。","type":"technical","meaning_category":"technical"}]}