{"word":"agrarianize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"農業化する、農村化する","english_definition":"to transform (something, such as an economy or society) into an agrarian one; to make agricultural.","examples":[{"sentence":"The government sought to agrarianize the economy by promoting small-scale farming.","translation":"政府は小規模農業を奨励することで経済を農業化しようとした。"},{"sentence":"The plan was to agrarianize the region, turning industrial land back into farmland.","translation":"その計画は、工業用地を農地に転換し、その地域を農村化することだった。"}],"collocations":["agrarianize the economy (経済を農業化する)","agrarianize a region (地域を農村化する)","agrarianize society (社会を農業化する)"],"synonyms":["ruralize","agriculturalize","farm","cultivate"],"antonyms":["industrialize","urbanize"]},{"part_of_speech":"verb","transitivity":"vi","definition":"農業化される、農村化される","english_definition":"to become agrarian; to adopt an agricultural way of life.","examples":[{"sentence":"The population began to agrarianize as they discovered fertile land.","translation":"肥沃な土地を発見すると、人々は農業化し始めた。"},{"sentence":"Over time, the community started to agrarianize, shifting away from hunting and gathering.","translation":"時が経つにつれて、そのコミュニティは狩猟採集から離れ、農業化し始めた。"}],"collocations":["agrarianize slowly (ゆっくりと農業化する)","agrarianize rapidly (急速に農業化する)"],"synonyms":["become rural","become agricultural"],"antonyms":["become industrialized","become urbanized"]}],"etymology":{"value":"Derived from 'agrarian' (relating to land or its cultivation) and the suffix '-ize' (to make or become).","priority":"★★☆"},"pronunciation":{"ipa":"/əˈɡreəriənaɪz/","syllables":"a-gre-ar-i-an-ize"},"inflection":{"verb_forms":{"present_simple":["agrarianize","agrarianizes"],"past_simple":"agrarianized","past_participle":"agrarianized","present_participle":"agrarianizing"}},"usage_notes":{"explanation":"'Agrarianize' is a relatively uncommon verb that describes the process of making something more agricultural or rural. It can refer to transforming an economy, society, or region to be more focused on agriculture. It is often used in discussions of economic development, land use, and historical changes in societies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They are trying to agrarianize the city with skyscrapers.","correct":"✓ They are trying to agrarianize the region by promoting farming.","note":"'Agrarianize' implies a shift towards agriculture, so it's not appropriate to use it in the context of a city with skyscrapers. It's better used when referring to rural or agricultural development."}],"priority":"★★☆"},"related_words":{"derivatives":["agrarianization (noun: the process of becoming agrarian)","agrarian (adjective: relating to land or its cultivation)","agriculture (noun: the science or practice of farming)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Agrarianize' is a specialized term used to describe the process of making something more agricultural or rural. It is not commonly used in everyday conversation but may be encountered in academic or technical contexts related to economics, history, or land use. Understanding the term requires familiarity with the concept of agrarian societies and the process of shifting towards an agricultural economy."},"example_sentences":[{"sentence":"The government's policy aimed to agrarianize the remote provinces.","translation":"政府の政策は、遠隔地の州を農業化することを目的としていた。","type":"verb","meaning_category":"農業化する"},{"sentence":"The community began to agrarianize after receiving training in sustainable farming techniques.","translation":"そのコミュニティは、持続可能な農業技術の訓練を受けた後、農業化し始めた。","type":"verb","meaning_category":"農業化される"}]}