{"word":"fistulatous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"瘻管のある、瘻孔のある、管状の","english_definition":"relating to or having the form of a fistula; hollow and cylindrical.","examples":[{"sentence":"The doctor described the wound as fistulatous.","translation":"医者はその傷を瘻孔があると説明した。"},{"sentence":"The plant has fistulatous stems.","translation":"その植物は管状の茎を持っている。"}],"collocations":["fistulatous tract","fistulatous opening","fistulatous lesion"],"synonyms":["tubular","hollow","sinuous"],"antonyms":["solid","compact"]}],"etymology":{"value":"Derived from the Latin word \"fistula,\" meaning a pipe or tube.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɪstjʊlətəs/","syllables":"fis-tu-la-tous"},"inflection":{"notes":"Comparative and superlative forms are not commonly used."},"usage_notes":{"explanation":"The term \"fistulatous\" is primarily used in medical and botanical contexts. In medicine, it describes conditions or wounds characterized by fistulas (abnormal connections between two body parts). In botany, it describes plant structures that are hollow and tube-like.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The solid structure was fistulatous.","correct":"✓ The hollow structure was fistulatous.","note":"Fistulatous implies a hollow, tube-like structure, so it cannot describe something solid."}],"priority":"★☆☆"},"related_words":{"derivatives":["fistula (noun): an abnormal or surgically made passage between a hollow or tubular organ and the body surface, or between two hollow or tubular organs.","fistulectomy (noun): surgical removal of a fistula.","fistulography (noun): X-ray examination of a fistula."]},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fistulatous' is a technical term primarily used in medical and botanical contexts. It describes something that has the characteristics of a fistula (an abnormal connection between two body parts) or is hollow and tube-like. Due to its specialized usage, it is not commonly encountered in general English. Understanding requires knowledge of related medical or botanical terminology."},"example_sentences":[{"sentence":"The surgeon identified a fistulatous connection between the bladder and the intestine.","translation":"外科医は膀胱と腸の間の瘻孔性のつながりを特定した。","type":"medical","meaning_category":"瘻孔のある"},{"sentence":"The celery stalk is characteristically fistulatous.","translation":"セロリの茎は特徴的に管状である。","type":"botanical","meaning_category":"管状の"}]}