{"word":"anisocytosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不同赤血球症：赤血球の大きさが異常に不均一な状態","english_definition":"A condition characterized by red blood cells of unequal size.","examples":[{"sentence":"Anisocytosis is often seen in cases of anemia.","translation":"不同赤血球症は、しばしば貧血の場合に見られる。"},{"sentence":"The blood test revealed anisocytosis.","translation":"血液検査で不同赤血球症が明らかになった。"}],"collocations":["diagnose anisocytosis (不同赤血球症を診断する)","mild anisocytosis (軽度の不同赤血球球症)","severe anisocytosis (重度の不同赤血球症)"],"synonyms":["red cell size variation","poikilocytosis (related, but refers to shape variation)"],"antonyms":[]}],"etymology":{"value":"Derived from Greek: 'aniso-' (unequal) + 'cyto-' (cell) + '-osis' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænaɪsoʊsaɪˈtoʊsɪs/","syllables":"a-ni-so-cy-to-sis"},"inflection":{"notes":"Plural form is 'anisocytoses'."},"usage_notes":{"explanation":"Anisocytosis is a descriptive term used in hematology to indicate abnormal variation in the size of red blood cells (erythrocytes). It is not a disease itself but a finding that can indicate underlying medical conditions, most commonly anemia. The size variation is quantified using the red cell distribution width (RDW) in a complete blood count (CBC).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Anisocytosis is a disease.","correct":"✓ Anisocytosis is a condition or finding, not a disease itself.","note":"Anisocytosis is a descriptive term for a blood cell abnormality, not a specific disease. It indicates an underlying issue."}],"priority":"★★☆"},"related_words":{"derivatives":["anisocytic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anisocytosis' is a technical term used in medicine, specifically in hematology. It refers to the presence of red blood cells of varying sizes in a blood sample. This condition is usually identified during a complete blood count (CBC) and is often associated with anemia or other blood disorders. Understanding this term requires a background in biology or medicine."},"example_sentences":[{"sentence":"The patient's blood smear showed significant anisocytosis, indicating a possible iron deficiency.","translation":"患者の血液塗抹標本は、顕著な不同赤血球症を示しており、鉄欠乏の可能性を示唆していた。","type":"medical","meaning_category":"hematology"},{"sentence":"Elevated RDW values often correlate with the presence of anisocytosis in peripheral blood.","translation":"RDW値の上昇は、しばしば末梢血中の不同赤血球症の存在と相関する。","type":"medical","meaning_category":"hematology"}]}