{"word":"compound lens","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"複合レンズ","english_definition":"A lens consisting of two or more simple lenses combined to correct aberrations.","examples":[{"sentence":"The camera uses a compound lens to reduce chromatic aberration.","translation":"そのカメラは、色収差を低減するために複合レンズを使用しています。"},{"sentence":"Compound lenses are commonly used in microscopes and telescopes.","translation":"複合レンズは、顕微鏡や望遠鏡で一般的に使用されています。"}],"collocations":["achromatic compound lens (アクロマート複合レンズ)","compound microscope lens (複合顕微鏡レンズ)"],"synonyms":["multiple lens","complex lens"],"antonyms":["simple lens"]},{"part_of_speech":"noun","definition":"複眼レンズ","english_definition":"A lens that mimics the structure of an insect's compound eye, consisting of many small lenses.","examples":[{"sentence":"Researchers are developing compound lenses inspired by insect eyes for advanced imaging.","translation":"研究者たちは、高度なイメージングのために昆虫の眼に触発された複合レンズを開発しています。"}],"collocations":["artificial compound lens (人工複眼レンズ)","insect-eye compound lens (昆虫の眼の複合レンズ)"],"synonyms":["artificial compound eye","micro lens array"],"antonyms":[]}],"etymology":{"value":"The term 'compound lens' comes from the combination of 'compound' meaning 'composed of two or more parts' and 'lens' referring to a piece of transparent material used to focus light.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒmpaʊnd lɛnz/","syllables":"com-pound lens"},"inflection":{"noun_plural":"compound lenses"},"usage_notes":{"explanation":"A 'compound lens' generally refers to a lens system made up of multiple lens elements. This design is used to minimize optical aberrations such as chromatic aberration, spherical aberration, and distortion. The term can also refer to lenses that mimic the structure of insect eyes, which consist of numerous tiny lenses. The specific meaning depends on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The compound lens is more simple than a single lens.","correct":"✓ The compound lens is more complex than a single lens.","note":"Compound lenses are more complex, not simpler, due to their multiple elements."},{"incorrect":"✗ Compound lens are used to magnify images.","correct":"✓ Compound lenses are used to magnify images.","note":"'Compound lenses' is plural, so the verb should be 'are'."}],"priority":"★★☆"},"related_words":{"derivatives":["compound (adjective)","lens (noun)","optics (noun)","optical (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'compound lens' refers to a lens system that uses multiple lens elements to correct optical aberrations. This is a more advanced concept in optics compared to a simple lens. The term can also refer to lenses mimicking insect eyes, which is a specialized area. Understanding requires some knowledge of optics and lens design.","priority":"★★☆"},"example_sentences":[{"sentence":"The telescope uses a **compound lens** to achieve high magnification and clarity.","translation":"その望遠鏡は、高倍率と鮮明さを実現するために複合レンズを使用しています。","type":"noun","meaning_category":"一般複合レンズ"},{"sentence":"The **compound lens** in the microscope allows for detailed observation of cells.","translation":"顕微鏡の複合レンズにより、細胞の詳細な観察が可能になります。","type":"noun","meaning_category":"一般複合レンズ"},{"sentence":"Researchers are exploring the use of **compound lenses** inspired by insect eyes for drone cameras.","translation":"研究者たちは、ドローンカメラのために昆虫の眼に触発された複合レンズの使用を模索しています。","type":"noun","meaning_category":"複眼レンズ"}]}