{"word":"well-obeyed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(規則、法律などが)よく守られている、きちんと遵守されている","english_definition":"(of a rule, law, etc.) followed carefully and consistently; properly adhered to.","examples":[{"sentence":"The traffic laws in this city are well-obeyed.","translation":"この都市の交通法規はよく守られている。"},{"sentence":"The safety regulations in the factory are well-obeyed by all employees.","translation":"工場の安全規則はすべての従業員によってきちんと遵守されている。"},{"sentence":"It is important that the rules of the game are well-obeyed to ensure fair play.","translation":"公正なプレイを確保するためには、ゲームのルールがよく守られることが重要である。"}],"collocations":["well-obeyed laws (よく守られている法律)","well-obeyed rules (よく守られている規則)","well-obeyed regulations (よく守られている規則)","widely well-obeyed (広くよく守られている)"],"synonyms":["carefully followed","strictly adhered to","duly observed","faithfully complied with","respected"],"antonyms":["poorly obeyed","disregarded","violated","ignored","flouted"]}],"etymology":{"value":"The word is a compound adjective formed by combining the adverb 'well' with the past participle 'obeyed'. 'Well' indicates a high degree or quality, and 'obeyed' signifies that something has been followed or complied with.","priority":"★★★"},"pronunciation":{"ipa":"/ˌwɛl əˈbeɪd/","syllables":"well-o-beyed"},"inflection":{"notes":"Compound adjective. Does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Well-obeyed' is used to describe rules, laws, or regulations that are consistently and carefully followed. It emphasizes the degree to which something is adhered to. It is often used to highlight the effectiveness of a rule or law in maintaining order or safety. The term suggests a positive outcome resulting from adherence to the rules.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The rule was very obeyed.","correct":"✓ The rule was well-obeyed.","note":"'Well-obeyed' is a single compound adjective, not a verb phrase. Use it as a single unit to describe something that is followed carefully."},{"incorrect":"✗ The well obey rules.","correct":"✓ The well-obeyed rules.","note":"'Well-obeyed' is an adjective and should be used to modify a noun. 'Well obey' is grammatically incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["obedience (名詞: 服従)","obedient (形容詞: 服従的な)","obey (動詞: 服従する)"],"phrasal_verbs":[],"related_concepts":["compliance","adherence","observance","respect for the law","rule of law"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. More common in formal writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Well-obeyed' is a relatively formal and uncommon term used to describe rules or laws that are consistently and carefully followed. It is typically found in more formal writing or speech, such as legal or academic contexts. The term emphasizes the degree to which something is adhered to and suggests a positive outcome resulting from compliance. Understanding this term requires a good command of English vocabulary and grammar.","priority":"★★☆"},"example_sentences":[{"sentence":"The school's code of conduct is generally well-obeyed by the students.","translation":"学校の行動規範は、一般的に生徒によってよく守られている。","type":"adjective","meaning_category":"きちんと遵守されている"},{"sentence":"In countries where traffic laws are well-obeyed, there are fewer accidents.","translation":"交通法規がよく守られている国では、事故が少ない。","type":"adjective","meaning_category":"きちんと遵守されている"},{"sentence":"The company's safety protocols are well-obeyed, ensuring a safe working environment.","translation":"会社の安全プロトコルはよく守られており、安全な作業環境を確保している。","type":"adjective","meaning_category":"きちんと遵守されている"}]}