{"word":"resublimation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再昇華","english_definition":"The process of a substance transitioning directly from the gaseous phase back to the solid phase, without passing through the liquid phase. The reverse of sublimation.","examples":[{"sentence":"Resublimation is used in certain industrial processes to purify substances.","translation":"再昇華は、特定の工業プロセスにおいて物質を精製するために使用される。"},{"sentence":"Frost formation on a cold window is an example of resublimation of water vapor.","translation":"冷たい窓に霜が形成されるのは、水蒸気の再昇華の例である。"}],"collocations":["frost formation","industrial purification","deposition"],"synonyms":["deposition","desublimation"],"antonyms":["sublimation"],"related_terms":["sublimation","phase transition","triple point","deposition"]}],"etymology":{"value":"The word 'resublimation' is formed by adding the prefix 're-' (meaning 'again' or 'back') to the word 'sublimation'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːsʌblɪˈmeɪʃən/","syllables":"re-sub-li-ma-tion"},"inflection":{"noun_plural":"resublimations"},"usage_notes":{"explanation":"'Resublimation' is a scientific term primarily used in chemistry and physics to describe a specific type of phase transition. It is the direct conversion of a gas to a solid. In everyday language, the term 'deposition' is often used more broadly to describe the same phenomenon.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Resublimation is the same as melting.","correct":"Resublimation is the process of a gas directly becoming a solid.","note":"Resublimation is not melting; melting is the transition from solid to liquid."}],"priority":"★☆☆"},"related_words":{"derivatives":["resublime (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Resublimation' is a specialized term in chemistry and physics describing the phase transition from a gas directly to a solid. It's not commonly used in everyday language. Understanding requires knowledge of phase transitions and scientific vocabulary."},"example_sentences":[{"sentence":"The formation of snowflakes involves the resublimation of water vapor in the atmosphere.","translation":"雪の結晶の形成には、大気中の水蒸気の再昇華が関与している。","type":"noun","meaning_category":"scientific process"},{"sentence":"Resublimation can be used to create thin films of certain materials.","translation":"再昇華は、特定の材料の薄膜を作成するために使用できる。","type":"noun","meaning_category":"industrial application"}]}