{"word":"nonsyntonically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"非同調的に","english_definition":"In a manner that is not syntonic; not tuned to the same frequency or resonance.","examples":[{"sentence":"The two circuits were coupled nonsyntonically, resulting in poor signal transfer.","translation":"その二つの回路は非同調的に結合されており、信号伝達が不十分だった。"}],"collocations":[],"synonyms":["asynchronously","discordantly","inharmoniously"],"antonyms":["syntonically","harmoniously","resonantly"]}],"etymology":{"value":"Derived from \"nonsyntonic,\" which is formed from the prefix \"non-\" (meaning \"not\") and \"syntonic\" (meaning \"tuned to the same frequency\").","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌsɪnˈtɒnɪkli/","syllables":"non-syn-ton-i-cal-ly"},"inflection":{},"usage_notes":{"explanation":"This term is highly technical, primarily used in the fields of radio engineering and electronics to describe circuits or systems that are not tuned to the same resonant frequency.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["nonsyntonic (adjective)","syntonic (adjective)","syntonize (verb)"],"related_terms":["resonance","frequency","circuit","tuning"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'nonsyntonically' is a highly specialized term used in technical contexts, particularly in electrical engineering and radio technology. It describes a state where two or more circuits or systems are not tuned to the same resonant frequency, leading to inefficient signal transfer or interference. Understanding this term requires a background in physics or engineering."},"example_sentences":[{"sentence":"The receiver was deliberately designed to operate nonsyntonically with the transmitter to avoid interference from other signals.","translation":"受信機は、他の信号からの干渉を避けるために、送信機と非同調的に動作するように意図的に設計された。","type":"general","meaning_category":"technical"}]}