{"word":"illiquidity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"流動性の欠如、換金性の低さ、資金繰りの悪化","english_definition":"The state of not being easily converted into cash; a lack of liquid assets; a situation where a company or individual does not have enough cash to meet immediate obligations.","examples":[{"sentence":"The company's illiquidity made it difficult to pay its suppliers.","translation":"その会社の流動性不足により、仕入先への支払いが困難になった。"},{"sentence":"The illiquidity of the real estate market meant that it took a long time to sell the property.","translation":"不動産市場の流動性の低さは、物件の売却に時間がかかることを意味した。"},{"sentence":"The bank faced a crisis due to the illiquidity of its assets.","translation":"その銀行は資産の流動性不足により危機に直面した。"}],"collocations":["face illiquidity (流動性不足に直面する)","cause illiquidity (流動性不足を引き起こす)","overcome illiquidity (流動性不足を克服する)","severe illiquidity (深刻な流動性不足)","market illiquidity (市場の流動性不足)"],"synonyms":["insolvency","cash flow problems","lack of liquidity","financial distress","financial difficulties"],"antonyms":["liquidity","solvency","cash flow","financial stability"]}],"etymology":{"value":"From 'illiquid' (not liquid) + '-ity' (a suffix denoting a state or condition). 'Illiquid' is formed from the prefix 'il-' (not) + 'liquid' (easily converted to cash).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪlɪˈkwɪdɪti/","syllables":"il-li-quid-i-ty"},"inflection":{"noun_plural":"illiquidities (rarely used)"},"usage_notes":{"explanation":"'Illiquidity' refers to the state of not having enough liquid assets (cash or assets easily converted to cash) to meet short-term obligations. It is often used in financial contexts to describe the situation of companies, banks, or markets. It is distinct from 'insolvency,' which means being unable to pay debts even if assets were liquidated. Illiquidity is a temporary condition, while insolvency is a more serious, potentially terminal, state.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company had a lot of liquidity, leading to illiquidity.","correct":"✓ The company had a lack of liquidity, leading to illiquidity.","note":"'Illiquidity' means a lack of liquidity, so it cannot be caused by having a lot of liquidity. The correct phrasing is to say there was a 'lack of liquidity.'"},{"incorrect":"✗ Illiquidity is the same as bankruptcy.","correct":"✓ Illiquidity can lead to bankruptcy, but they are not the same.","note":"'Illiquidity' is not the same as 'bankruptcy.' Illiquidity is a short-term cash flow problem, while bankruptcy is a legal declaration of being unable to pay debts."}],"priority":"★★☆"},"related_words":{"derivatives":["illiquid (adjective: not easily converted into cash)","liquidity (noun: the availability of liquid assets)","liquidate (verb: to convert assets into cash)"],"idioms_phrases":["illiquidity trap (流動性の罠 - 金融政策が無効になる状況)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized financial term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Illiquidity' is a formal term used in finance and economics to describe a situation where an asset cannot be quickly sold or converted into cash without significant loss of value. It also refers to a situation where a company or individual does not have enough cash on hand to meet their immediate financial obligations. This term is commonly used in discussions about financial markets, corporate finance, and personal finance. Understanding 'illiquidity' is important for anyone involved in managing finances or investing. It is a more specific term than simply saying 'lack of money.'"},"example_sentences":[{"sentence":"The fund experienced significant **illiquidity** during the market downturn.","translation":"そのファンドは市場低迷期に深刻な流動性不足を経験した。","type":"noun","meaning_category":"流動性の欠如"},{"sentence":"The **illiquidity** of certain investments made it difficult to rebalance the portfolio.","translation":"特定の投資の流動性の低さが、ポートフォリオのリバランスを困難にした。","type":"noun","meaning_category":"換金性の低さ"},{"sentence":"The company's **illiquidity** was a major concern for its creditors.","translation":"その会社の流動性不足は、債権者にとって大きな懸念事項だった。","type":"noun","meaning_category":"資金繰りの悪化"}]}