{"word":"Semi-Saxon","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"中期英語の、または中期英語に関連する","english_definition":"Of or relating to Middle English.","examples":[{"sentence":"The Semi-Saxon period saw significant changes in the English language.","translation":"準サクソン時代には、英語に大きな変化が見られました。"}],"collocations":["Semi-Saxon period","Semi-Saxon texts"],"synonyms":["Middle English"],"antonyms":[]}],"etymology":{"value":"The term 'Semi-Saxon' was historically used to describe the English language of the 12th and 13th centuries, after the Norman Conquest but before the emergence of what is typically considered Middle English. It reflects a transitional phase where Old English was heavily influenced by Norman French.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmi ˈsæksən/","syllables":"Se-mi-Sax-on"},"inflection":{},"usage_notes":{"explanation":"The term 'Semi-Saxon' is somewhat outdated and less commonly used in modern linguistics. It refers to the English language during a transitional period after the Norman Conquest (1066) but before the full development of Middle English. This period is characterized by the decline of Old English grammatical features and the increasing influence of Norman French vocabulary and syntax.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Saxon","Anglo-Saxon","Middle English"],"phrases":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'Semi-Saxon' is a historical linguistic term referring to the transitional phase of the English language between Old English and Middle English, specifically after the Norman Conquest. It's less commonly used in modern linguistics, but understanding its historical context can provide insight into the evolution of the English language. The term indicates a period where Old English was significantly influenced by Norman French, leading to the development of Middle English.","priority":"★★☆"},"example_sentences":[{"sentence":"The Peterborough Chronicle is a key text from the Semi-Saxon period.","translation":"ピーターバラ年代記は、準サクソン時代の重要なテキストです。","type":"example","meaning_category":"historical context"}]}