{"word":"technocentrism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"技術中心主義、技術至上主義：技術が社会や環境問題の解決策の中心であると信じるイデオロギー。技術開発を重視し、自然や社会への影響を軽視する傾向がある。","english_definition":"An ideology that believes that technology is the central means of solving social and environmental problems, emphasizing technological development and often downplaying its impact on nature and society.","examples":[{"sentence":"Technocentrism often leads to the belief that any problem can be solved with the right technological innovation.","translation":"技術中心主義は、適切な技術革新があればどんな問題でも解決できるという信念につながることが多い。"},{"sentence":"Critics argue that technocentrism ignores the underlying social and economic causes of environmental issues.","translation":"批評家たちは、技術中心主義が環境問題の根本的な社会的・経済的原因を無視していると主張する。"},{"sentence":"The government's technocentric approach to climate change focuses on carbon capture technologies rather than reducing consumption.","translation":"政府の気候変動に対する技術中心的なアプローチは、消費を減らすよりも炭素回収技術に焦点を当てている。"}],"collocations":["technocentric approach (技術中心的なアプローチ)","technocentric view (技術中心的な見方)","technocentric solution (技術中心的な解決策)","environmental technocentrism (環境技術中心主義)"],"synonyms":["technological determinism","technology-driven approach"],"antonyms":["ecocentrism","anthropocentrism","biocentrism"]},{"part_of_speech":"noun","definition":"(より広義に)技術が社会の進歩と発展に不可欠であると信じる考え方。","english_definition":"(More broadly) The belief that technology is essential for societal progress and development.","examples":[{"sentence":"Technocentrism is deeply embedded in modern society, influencing everything from education to healthcare.","translation":"技術中心主義は現代社会に深く根付いており、教育から医療まであらゆるものに影響を与えている。"},{"sentence":"The rise of Silicon Valley is a testament to the power of technocentrism in driving economic growth.","translation":"シリコンバレーの台頭は、経済成長を牽引する技術中心主義の力の証である。"}],"collocations":["embrace technocentrism (技術中心主義を受け入れる)","promote technocentrism (技術中心主義を推進する)"],"synonyms":["technological optimism","faith in technology"],"antonyms":["technological pessimism","skepticism about technology"]}],"etymology":{"value":"'Techno-' はギリシャ語の 'techne' (技術、技能) から派生し、'-centrism' は中心を意味する。したがって、'technocentrism' は技術を中心とする考え方を意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌteknəʊˈsɛntrɪzəm/","syllables":"tech-no-cen-trism"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"Technocentrism は、技術が社会や環境問題の解決策として最も重要であると考えるイデオロギーです。これは、技術開発を重視し、技術がもたらす可能性のある負の影響を軽視する傾向があります。環境問題の文脈では、技術中心主義は、汚染を削減したり、資源をより効率的に使用したりするための技術革新に焦点を当てる一方で、消費パターンやライフスタイルの変化を軽視することがあります。技術中心主義の反対は、自然と人間の相互依存性を強調する ecocentrism です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Technocentrism is a good thing always.","correct":"✓ Technocentrism is not always a good thing. / ✓ Technocentrism can be beneficial in some cases.","note":"技術中心主義は常に良いとは限りません。技術的な解決策が常に最善とは限らず、倫理的、社会的、環境的影響を考慮する必要があります。"},{"incorrect":"✗ Technocentrism is the same as using technology.","correct":"✓ Technocentrism is a belief system that prioritizes technology as the primary solution.","note":"技術を使うことと技術中心主義は異なります。技術中心主義は、技術が問題解決の主要な手段であるという信念体系です。"}],"priority":"★★☆"},"related_words":{"derivatives":["technocentric (形容詞: 技術中心的な)"],"related_terms":["ecocentrism (生態中心主義)","anthropocentrism (人間中心主義)","environmentalism (環境保護主義)","sustainability (持続可能性)","technology assessment (技術評価)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 学術的な文脈や専門分野でよく使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**technocentrism**」は、技術が社会や環境の問題を解決する上で最も重要な手段であると信じる考え方です。この言葉は、特に環境問題に関連して、技術的な解決策を重視し、社会的な変化や価値観の転換を軽視する傾向を批判的に議論する際に使われます。例えば、気候変動に対する技術中心主義的なアプローチは、再生可能エネルギー技術の開発に焦点を当てる一方で、消費を減らすための政策をあまり重視しないかもしれません。この言葉を理解するには、技術が持つ可能性と限界の両方を認識し、社会全体としての価値観や行動の変化の重要性を理解することが大切です。"},"example_sentences":[{"sentence":"The company's **technocentrism** led them to invest heavily in automation, even though it resulted in job losses.","translation":"その会社の技術中心主義は、たとえ失業につながったとしても、自動化への多額の投資につながった。","type":"noun","meaning_category":"技術中心主義"},{"sentence":"Critics of **technocentrism** argue that it often overlooks simpler, more sustainable solutions.","translation":"技術中心主義の批判者たちは、それがよりシンプルで持続可能な解決策を見過ごすことが多いと主張する。","type":"noun","meaning_category":"技術中心主義"},{"sentence":"A **technocentric** approach to healthcare might prioritize advanced medical devices over preventative care.","translation":"医療に対する技術中心的なアプローチは、予防医療よりも高度な医療機器を優先するかもしれない。","type":"adjective (technocentric)","meaning_category":"技術中心的な"},{"sentence":"While technology can play a role in addressing environmental challenges, relying solely on **technocentrism** is insufficient.","translation":"技術は環境問題への取り組みにおいて役割を果たすことができるが、技術中心主義だけに頼るだけでは不十分である。","type":"noun","meaning_category":"技術中心主義"}]}