{"word":"alloantibody","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"同種抗体、同種異系抗体","english_definition":"An antibody produced by one individual that reacts with an antigen from another individual of the same species.","examples":[{"sentence":"Alloantibodies can develop during pregnancy when fetal blood cells enter the maternal circulation.","translation":"同種抗体は、胎児の血液細胞が母体循環に入るときに妊娠中に発生することがあります。"},{"sentence":"The presence of alloantibodies can complicate blood transfusions and organ transplantation.","translation":"同種抗体の存在は、輸血や臓器移植を複雑にする可能性があります。"}],"collocations":["alloantibody screening (同種抗体スクリーニング)","alloantibody identification (同種抗体同定)","develop alloantibodies (同種抗体を産生する)","presence of alloantibodies (同種抗体の存在)"],"synonyms":["isoantibody"],"antonyms":[]}],"etymology":{"value":"\"Allo-\" (ギリシャ語の \"allos\" = 他の) + \"antibody\" (抗体)","priority":"★★★"},"pronunciation":{"ipa":"/ˌæloʊˈæntɪˌbɒdi/","syllables":"al-lo-an-ti-bo-dy"},"inflection":{"noun_plural":"alloantibodies"},"usage_notes":{"explanation":"Alloantibodies are antibodies produced by an individual against antigens (alloantigens) present in other individuals of the same species but absent in themselves. They are commonly encountered in the context of blood transfusions, pregnancy, and organ transplantation. The presence of alloantibodies can cause adverse reactions, such as hemolytic transfusion reactions or rejection of transplanted organs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Autoantibody is the same as alloantibody.","correct":"✓ Autoantibodies react with self-antigens, while alloantibodies react with antigens from other individuals of the same species.","note":"Autoantibodies react against the body's own tissues, whereas alloantibodies react against foreign antigens from the same species."},{"incorrect":"✗ Alloantibodies are only found in pregnant women.","correct":"✓ Alloantibodies can be found in individuals who have been exposed to foreign antigens through blood transfusions, pregnancy, or organ transplantation.","note":"While pregnancy is a common cause, alloantibodies can also develop after blood transfusions or organ transplants."}],"priority":"★★☆"},"related_words":{"derivatives":["alloantigen (同種抗原)","alloimmunization (同種免疫)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Alloantibody' is a specialized term in immunology, referring to antibodies produced by one individual that target antigens from another individual of the same species. These antibodies are significant in medical contexts such as blood transfusions, organ transplantation, and pregnancy, where they can cause adverse reactions. Understanding this term requires a background in basic immunology and its applications in clinical medicine.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient developed alloantibodies after multiple blood transfusions.","translation":"その患者は複数回の輸血後に同種抗体を産生した。","type":"general","meaning_category":"Immunology"},{"sentence":"Alloantibody screening is crucial before organ transplantation to prevent rejection.","translation":"拒絶反応を防ぐために、臓器移植前に同種抗体スクリーニングが不可欠である。","type":"medical","meaning_category":"Transplantation"},{"sentence":"Maternal alloantibodies can cross the placenta and cause hemolytic disease of the fetus and newborn.","translation":"母体の同種抗体は胎盤を通過し、胎児および新生児の溶血性疾患を引き起こす可能性がある。","type":"medical","meaning_category":"Pregnancy"}]}