{"word":"oligopoly","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"寡占（かせん）","english_definition":"A market structure in which a few firms dominate.","examples":[{"sentence":"The airline industry is often cited as an example of an oligopoly.","translation":"航空業界は、しばしば寡占の例として挙げられます。"},{"sentence":"In an oligopoly, firms are highly interdependent.","translation":"寡占市場では、企業は相互に強く依存しています。"},{"sentence":"The government regulates oligopolies to prevent anti-competitive practices.","translation":"政府は、反競争的な行為を防ぐために寡占を規制します。"}],"collocations":["duopoly (複占)","market concentration (市場集中)","price fixing (価格カルテル)","collusion (共謀)","game theory (ゲーム理論)","oligopolistic competition (寡占的競争)"],"synonyms":["market domination by a few","limited competition","concentrated market"],"antonyms":["perfect competition","monopolistic competition","atomistic competition"]}],"etymology":{"value":"From the Greek words 'oligos' (meaning 'few') and 'polein' (meaning 'to sell').","priority":"★★★"},"pronunciation":{"ipa":"/ˌɒlɪˈɡɒpəli/","syllables":"ol-i-gop-o-ly"},"inflection":{"noun_plural":"oligopolies"},"usage_notes":{"explanation":"An oligopoly is a market situation where a small number of firms control the majority of the market share. These firms are aware of each other's actions and must consider how their own decisions will affect their competitors. This interdependence often leads to strategic behavior, such as price fixing or collusion, which can harm consumers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company has a oligopoly in the market.","correct":"✓ The company has an oligopoly in the market.","note":"'Oligopoly' begins with a vowel sound, so use the indefinite article 'an'."},{"incorrect":"✗ Oligopoly is when there are many sellers.","correct":"✓ Oligopoly is when there are few sellers.","note":"Oligopoly is characterized by a small number of sellers, not many."}],"priority":"★★☆"},"related_words":{"derivatives":["oligopolistic (adjective)"],"related_terms":["monopoly","duopoly","competition","market structure","cartel"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively common in business and economics contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Oligopoly' describes a situation in economics where only a few companies control most of the sales in a market. Because there are so few players, each company's actions can greatly affect the others. This can lead to complex strategies and sometimes even agreements between companies to control prices or limit competition, which governments often try to prevent."},"example_sentences":[{"sentence":"The telecommunications industry in many countries is an oligopoly.","translation":"多くの国の電気通信産業は寡占市場です。","type":"example","meaning_category":"General Example"},{"sentence":"Oligopolies can lead to higher prices for consumers due to reduced competition.","translation":"寡占は、競争の減少により、消費者にとってより高い価格につながる可能性があります。","type":"example","meaning_category":"Consequences"},{"sentence":"Regulators often scrutinize mergers in oligopolistic industries to prevent further market concentration.","translation":"規制当局は、市場のさらなる集中を防ぐために、寡占産業における合併をしばしば精査します。","type":"example","meaning_category":"Regulation"}]}