{"word":"database-driven","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"データベース駆動型の、データベースに基づいた","english_definition":"(of a computer program or website) designed to retrieve and present information from a database.","examples":[{"sentence":"This is a database-driven website, so the content is easily updated.","translation":"これはデータベース駆動型のウェブサイトなので、コンテンツの更新が簡単です。"},{"sentence":"The application is database-driven, allowing for efficient data management.","translation":"このアプリケーションはデータベース駆動型であり、効率的なデータ管理が可能です。"}],"collocations":["database-driven application (データベース駆動型アプリケーション)","database-driven website (データベース駆動型ウェブサイト)","database-driven system (データベース駆動型システム)"],"synonyms":["data-driven"],"antonyms":["static"],"notes":["Typically used in the context of software development and web design."]}],"etymology":{"value":"The term is formed by combining 'database' (a structured collection of data) with 'driven' (powered or controlled by). It signifies that the system's functionality and content are primarily determined by the data stored in a database.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdeɪtəˌbeɪs ˈdrɪvən/","syllables":"da-ta-base driv-en"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns."},"usage_notes":{"explanation":"'Database-driven' describes a system or application where the data stored in a database dictates the content and functionality. This approach allows for dynamic content updates and efficient data management. It contrasts with static systems where content is hardcoded and requires manual updates.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The website is database drive.","correct":"✓ The website is database-driven.","note":"The correct form is 'database-driven,' using the past participle of 'drive' as an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["database (名詞: データベース)","data (名詞: データ)","driven (形容詞: 駆動された)"],"related_concepts":["SQL (Structured Query Language)","database management system (DBMS)","dynamic website","content management system (CMS)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent, primarily used in technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'database-driven' is primarily used in technical contexts, specifically related to software development and web design. It indicates that a program or website retrieves its information from a database, allowing for dynamic and easily updated content. Understanding this term requires familiarity with basic database concepts."},"example_sentences":[{"sentence":"Our new e-commerce platform is fully database-driven, providing real-time inventory updates.","translation":"当社の新しいeコマースプラットフォームは完全にデータベース駆動型であり、リアルタイムの在庫更新を提供します。","type":"adjective","meaning_category":"General"},{"sentence":"A database-driven content management system makes it easier for non-technical users to update the website.","translation":"データベース駆動型のコンテンツ管理システムにより、技術者以外のユーザーでもウェブサイトの更新が容易になります。","type":"adjective","meaning_category":"Web Development"}]}