{"word":"Joual","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ケベック・フランス語の口語変種、特に労働者階級が話す、多くの英語からの借用語や文法的な簡略化を含むもの","english_definition":"A working-class dialect of Quebec French characterized by numerous anglicisms and grammatical simplifications.","examples":[{"sentence":"Joual is often looked down upon by speakers of standard French.","translation":"ジュアルはしばしば標準フランス語の話し手から見下される。"},{"sentence":"Many Quebecois artists have used Joual in their works to represent the working class.","translation":"多くのケベックのアーティストは、労働者階級を表現するために作品の中でジュアルを使用した。"}],"collocations":["speak Joual","in Joual","Joual accent","Joual slang"],"synonyms":["Quebec French (colloquial)","Canadian French (non-standard)"],"antonyms":["Standard French","Metropolitan French","Parisian French"]}],"etymology":{"value":"元々は「cheval」（馬）という言葉の口語的な発音に由来する。この発音は、標準フランス語の発音とは異なるため、ケベック・フランス語の口語変種を特徴づけるものとして認識された。","priority":"★★☆"},"pronunciation":{"ipa":"/ʒwal/","syllables":"Jou-al"},"inflection":{"noun_plural":"(通常は不可算名詞として扱われるため、複数形は一般的ではない)"},"usage_notes":{"explanation":"Joual は、ケベック・フランス語の中でも特に口語的で、英語の影響を強く受けた変種を指します。しばしば労働者階級によって話され、文法的な簡略化や英語からの借用語（anglicisms）を多く含みます。標準フランス語話者からは批判的に見られることもありますが、ケベックのアイデンティティや文化を表現する手段としても認識されています。文学や音楽などの芸術作品で、リアリズムや社会的なメッセージを伝えるために用いられることがあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm learning Joual in school.","correct":"✓ I'm learning French in school. (and I'm exposed to Joual outside of school)","note":"学校でJoualを正式に教えることは一般的ではありません。フランス語を学びながら、日常会話やメディアを通じてJoualに触れることが多いでしょう。"},{"incorrect":"✗ Joual is the official language of Quebec.","correct":"✓ French is the official language of Quebec.","note":"ケベック州の公用語はフランス語であり、Joual はその口語変種です。"}],"priority":"★★☆"},"related_words":{"derivatives":["anglicism (名詞: 英語からの借用語)","Quebecism (名詞: ケベック特有の表現)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"(CEFRレベルに該当する教材は少ない)","frequency_google_ngram":"低頻度 (Low frequency) - 特定の地域や文化に関連する専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Joual**」は、カナダのケベック州で話されているフランス語の一種で、特に労働者階級の人々が使う、英語の影響を強く受けた話し方を指します。標準的なフランス語とは発音や言葉遣いが異なり、英語からの借用語も多く含まれています。この言葉は、ケベックの文化やアイデンティティを理解する上で重要な要素の一つですが、標準フランス語を話す人からは批判的に見られることもあります。文学や映画などの芸術作品で、ケベックの社会や文化を描写するために使われることがあります。"},"example_sentences":[{"sentence":"The play was written entirely in Joual to reflect the lives of working-class Quebecers.","translation":"その劇は、ケベックの労働者階級の人々の生活を反映するために、すべてジュアルで書かれた。","type":"noun","meaning_category":"ケベック・フランス語の口語変種"},{"sentence":"Understanding Joual is essential for truly understanding Quebec culture.","translation":"ジュアルを理解することは、ケベック文化を真に理解するために不可欠である。","type":"noun","meaning_category":"ケベック・フランス語の口語変種"}]}