{"word":"gravity-unaffected","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"重力の影響を受けない、重力の影響を受けにくい","english_definition":"Not affected or negligibly affected by gravity; not subject to the usual effects of gravitational force.","examples":[{"sentence":"The astronaut experienced a gravity-unaffected environment inside the space station.","translation":"宇宙飛行士は宇宙ステーション内で重力の影響を受けない環境を経験した。"},{"sentence":"In a gravity-unaffected state, objects float freely.","translation":"重力の影響を受けない状態では、物体は自由に浮遊する。"},{"sentence":"Scientists are studying gravity-unaffected processes to understand fundamental physics.","translation":"科学者たちは基礎物理学を理解するために、重力の影響を受けないプロセスを研究している。"}],"collocations":["gravity-unaffected environment (重力の影響を受けない環境)","gravity-unaffected state (重力の影響を受けない状態)","gravity-unaffected conditions (重力の影響を受けない条件)","gravity-unaffected processes (重力の影響を受けないプロセス)","gravity-unaffected motion (重力の影響を受けない運動)"],"synonyms":["weightless","zero-gravity","microgravity","free-floating","buoyant"],"antonyms":["gravity-affected","weighted","grounded","heavy","gravitational"],"notes":"This term is often used in the context of space exploration, physics experiments, and simulations where the effects of gravity are minimized or eliminated."}],"etymology":{"value":"Formed by combining \"gravity\" (the force of attraction between objects with mass), \"un-\" (a prefix meaning \"not\"), and \"affected\" (influenced or acted upon).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡrævɪti ʌnəˈfɛktɪd/","syllables":"grav-i-ty un-a-fec-ted"},"inflection":{"notes":"The word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term 'gravity-unaffected' is used to describe situations or objects where the force of gravity has a minimal or negligible impact. This can occur in space, in specialized laboratory settings, or in theoretical models where gravity is intentionally ignored. It's important to note that complete absence of gravity is rare; the term usually implies a significant reduction in its effects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The experiment was gravity unaffected.","correct":"✓ The experiment was gravity-unaffected.","note":"The hyphen is important to connect 'gravity' and 'unaffected' as a single adjective modifying the noun."},{"incorrect":"✗ The gravity unaffected object fell slowly.","correct":"✓ The gravity-unaffected object floated slowly.","note":"Objects that are truly gravity-unaffected do not 'fall'; they float or drift."}],"priority":"★★☆"},"related_words":{"derivatives":["unaffected (形容詞: 影響を受けていない)","gravity (名詞: 重力)","affected (形容詞: 影響を受けた)"],"related_terms":["weightlessness","zero gravity","microgravity","freefall","buoyancy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized vocabulary related to physics and space exploration.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gravity-unaffected' is a technical term describing something not influenced by gravity. It's used in scientific contexts like space exploration or physics experiments where gravity's effects are minimized. It implies a state where objects float or move without the usual downward pull. This term is not commonly used in everyday conversation and is more likely to appear in scientific or technical writing."},"example_sentences":[{"sentence":"The experiment aimed to simulate gravity-unaffected conditions to study plant growth in space.","translation":"その実験は、宇宙での植物の成長を研究するために、重力の影響を受けない条件をシミュレートすることを目的とした。","type":"adjective","meaning_category":"重力の影響を受けない"},{"sentence":"The researchers observed unique fluid dynamics in the gravity-unaffected environment.","translation":"研究者たちは、重力の影響を受けない環境で独特な流体ダイナミクスを観察した。","type":"adjective","meaning_category":"重力の影響を受けない"},{"sentence":"The satellite's orbit was designed to minimize any gravity-unaffected disturbances.","translation":"衛星の軌道は、重力の影響を受けないあらゆる擾乱を最小限に抑えるように設計された。","type":"adjective","meaning_category":"重力の影響を受けない"}]}