{"word":"figurativism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"比喩主義、形象主義（芸術における、具象的な形態やイメージを重視する傾向）","english_definition":"An artistic movement or tendency that emphasizes the representation of recognizable objects or figures.","examples":[{"sentence":"Figurativism experienced a revival in the late 20th century as a reaction against abstract art.","translation":"形象主義は、抽象芸術への反動として20世紀後半に復興を経験した。"},{"sentence":"His paintings are characterized by a strong commitment to figurativism.","translation":"彼の絵画は、形象主義への強いコミットメントによって特徴づけられる。"}],"collocations":["return to figurativism (形象主義への回帰)","elements of figurativism (形象主義の要素)"],"synonyms":["representationalism","realism"],"antonyms":["abstract art","non-representational art"]}],"etymology":{"value":"'Figurative'（比喩的な、形象的な）に '-ism'（主義、傾向）が付いたもの。","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɪɡjərətɪvɪzəm/","syllables":"fig-u-ra-tiv-ism"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"Figurativism is a broad term encompassing any art that retains strong references to the real world and, in particular, to the human figure. It stands in contrast to abstract art, which seeks to move away from direct representation. Figurativism can include a wide range of styles, from highly realistic depictions to more stylized or expressive representations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a big fan of figurativist.","correct":"✓ He is a big fan of figurativism.","note":"Figurativism is the noun (the art movement). Figurativist would be an artist who practices figurativism."}],"priority":"★★★"},"related_words":{"derivatives":["figurative (形容詞: 比喩的な、形象的な)","figure (名詞: 図、姿、人物)","figuration (名詞: 形象化、形象)"],"related_terms":["representational art","realism","portraiture","genre painting"]},"level_frequency":{"level":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 美術史や芸術批評の文脈で使われる専門用語。"},"readability_explanation":{"level":"C1","text":"'Figurativism' refers to art that clearly depicts recognizable objects or people. It's the opposite of abstract art, which doesn't try to show things as they appear in reality. Figurativism can include realistic paintings or sculptures, as well as more stylized or expressive artworks, as long as they maintain a connection to the real world. This term is often used in discussions about art history and art criticism."},"example_sentences":[{"sentence":"The museum's exhibition showcased the evolution of figurativism in modern sculpture.","translation":"その美術館の展示会では、現代彫刻における形象主義の進化が紹介された。","type":"noun","meaning_category":"芸術運動"},{"sentence":"Despite the rise of abstraction, many artists continued to explore the possibilities of figurativism.","translation":"抽象主義の台頭にもかかわらず、多くのアーティストは形象主義の可能性を探求し続けた。","type":"noun","meaning_category":"芸術傾向"}]}