{"word":"prothallus","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"前葉体（ぜんようたい）: シダ植物やコケ植物などの配偶体世代の植物体。胞子から発芽し、配偶子（卵と精子）を形成する。","english_definition":"The gametophyte stage in the life cycle of ferns and other pteridophytes. It develops from a spore and produces gametes (eggs and sperm).","examples":[{"sentence":"The fern prothallus is a small, heart-shaped structure.","translation":"シダの前葉体は小さく、ハート型の構造をしている。"},{"sentence":"Sperm from the prothallus fertilizes the egg, leading to the sporophyte generation.","translation":"前葉体からの精子が卵を受精させ、胞子体世代につながる。"}],"collocations":["fern prothallus","heart-shaped prothallus","prothallus development","prothallus fertilization"],"synonyms":["gametophyte"],"antonyms":["sporophyte"]}],"etymology":{"value":"Derived from the Greek words 'pro' (before) and 'thallos' (young shoot or sprout), referring to its position as the structure that develops before the main plant body.","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈθæləs/","syllables":"pro-thal-lus"},"inflection":{"noun_plural":"prothalli or prothalluses"},"usage_notes":{"explanation":"The term 'prothallus' is primarily used in botany to describe the gametophyte generation of ferns and related plants. It is a small, often heart-shaped structure that develops from a spore and produces the gametes necessary for sexual reproduction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The prothallus is the dominant stage in the fern life cycle.","correct":"✓ The sporophyte is the dominant stage in the fern life cycle.","note":"The sporophyte is the dominant, recognizable stage of a fern. The prothallus is small and short-lived."}],"priority":"★★☆"},"related_words":{"derivatives":["prothallial (adjective: relating to a prothallus)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily a botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Prothallus' is a specialized botanical term referring to the gametophyte stage of ferns and related plants. Understanding the concept requires familiarity with plant life cycles and reproductive strategies. It's not a term commonly encountered outside of botany or related fields."},"example_sentences":[{"sentence":"The **prothallus** of a fern is typically only a few millimeters in size.","translation":"シダの前葉体は通常、数ミリメートルの大きさしかない。","type":"noun","meaning_category":"Description"},{"sentence":"Water is required for the sperm to swim from the **prothallus** to the egg.","translation":"精子が前葉体から卵まで泳ぐためには水が必要である。","type":"noun","meaning_category":"Function"},{"sentence":"The **prothallus** represents the haploid stage in the fern's life cycle.","translation":"前葉体はシダのライフサイクルにおける半数体段階を表す。","type":"noun","meaning_category":"Life Cycle"}]}