{"word":"pericementum","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"歯根膜（しこんまく）","english_definition":"The membrane covering the root of a tooth and attaching it to the periodontal ligament.","examples":[{"sentence":"The pericementum is essential for tooth attachment and support.","translation":"歯根膜は歯の付着と支持に不可欠です。"},{"sentence":"Inflammation of the pericementum can lead to tooth mobility.","translation":"歯根膜の炎症は歯の動揺につながる可能性があります。"}],"collocations":["pericementum inflammation (歯根膜炎)","pericementum fibers (歯根膜線維)"],"synonyms":["periodontal membrane","dental periosteum"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'peri' (around), 'cement' (cement), and '-um' (a suffix denoting a structure or tissue).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɛrɪsɪˈmɛntəm/","syllables":"per-i-ce-men-tum"},"inflection":{"noun_plural":"pericementa (less common)"},"usage_notes":{"explanation":"'Pericementum' is a technical term used in dentistry and related fields to refer to the membrane surrounding the root of a tooth. It's crucial for understanding tooth structure and periodontal health.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pericementum is made of enamel.","correct":"✓ The pericementum is a membrane surrounding the tooth root.","note":"The pericementum is not made of enamel; enamel covers the crown of the tooth, not the root."}],"priority":"★★☆"},"related_words":{"derivatives":["periodontal (adjective: relating to the tissues surrounding the teeth)","cementum (noun: a bone-like tissue covering the root of a tooth)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Technical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pericementum' is a specialized term used in the context of dentistry and anatomy. Understanding this term requires a background in these fields. It refers to the membrane that surrounds the root of a tooth and connects it to the jawbone. This term is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The health of the pericementum is vital for maintaining tooth stability.","translation":"歯の安定を維持するためには、歯根膜の健康が不可欠です。","type":"noun","meaning_category":"Anatomy"},{"sentence":"Damage to the pericementum can result in tooth loss.","translation":"歯根膜の損傷は歯の喪失につながる可能性があります。","type":"noun","meaning_category":"Pathology"}]}