{"word":"inedibles","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"食べられないもの、食用に適さないもの（複数形）","english_definition":"Things that are not suitable or safe for eating.","examples":[{"sentence":"The garbage bin was full of inedibles.","translation":"ゴミ箱は食べられないものでいっぱいだった。"},{"sentence":"The chef separated the edibles from the inedibles.","translation":"シェフは食べられるものと食べられないものを分けた。"}],"collocations":["separate the edibles from the inedibles (食べられるものと食べられないものを分ける)"],"synonyms":["non-edibles","unconsumables","non-food items"],"antonyms":["edibles","food","sustenance"]}],"etymology":{"value":"'In-' (否定) + 'edible' (食べられる) + '-s' (複数形)","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˈɛdəbəlz/","syllables":"in-ed-i-bles"},"inflection":{"noun_plural":"inedibles"},"usage_notes":{"explanation":"'Inedibles' is the plural form of 'inedible', which refers to something that cannot be eaten, either because it is poisonous, unpalatable, or simply not meant to be consumed as food. It is often used in contexts where it is necessary to distinguish between what is safe to eat and what is not.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The inedible.","correct":"✓ The inedibles.","note":"'Inedibles' is typically used in the plural form to refer to a collection of items that are not edible."}],"priority":"★★☆"},"related_words":{"derivatives":["inedible (adjective: 食べられない、食用に適さない)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'inedibles' refers to things that you cannot eat. It is used when talking about a group of items that are not suitable for consumption, often because they are toxic, spoiled, or simply not food. You might see this word used in a cooking context, a survival guide, or a discussion about waste management."},"example_sentences":[{"sentence":"The forest floor was littered with inedibles, such as poisonous mushrooms and decaying leaves.","translation":"森の地面は、毒キノコや腐った葉などの食べられないもので散らかっていた。","type":"noun","meaning_category":"食べられないもの"},{"sentence":"It's important to teach children the difference between edibles and inedibles when foraging for food.","translation":"食料を求めて歩き回るとき、子供たちに食べられるものと食べられないものの違いを教えることが重要だ。","type":"noun","meaning_category":"食べられないもの"}]}