{"word":"noncleistogamic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学)閉鎖花を受粉しない、開放花を受粉する","english_definition":"(botany) Not cleistogamous; having flowers that are open and pollinated by external agents.","examples":[{"sentence":"Noncleistogamic flowers are often brightly colored to attract pollinators.","translation":"開放花を受粉する花は、しばしば受粉媒介者を引き付けるために鮮やかな色をしている。"}],"collocations":["noncleistogamic flower","noncleistogamic species"],"synonyms":["chasmogamous","open-pollinated"],"antonyms":["cleistogamic"]}],"etymology":{"value":"Derived from the prefix 'non-' (meaning 'not'), combined with 'cleistogamic'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌklaɪstəˈɡæmɪk/","syllables":"non-clei-sto-gam-ic"},"inflection":{"notes":"Adjective; comparative and superlative forms are formed regularly (more noncleistogamic, most noncleistogamic)."},"usage_notes":{"explanation":"This term is used in botany to describe plants that produce flowers that open and are pollinated by external agents such as insects, wind, or water. It is the opposite of cleistogamy, where flowers are self-pollinated without opening.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is non-cleistogamy.","correct":"✓ The plant is noncleistogamic.","note":"'Noncleistogamy' is a noun, while 'noncleistogamic' is an adjective. Ensure the correct form is used based on the context."}],"priority":"★★☆"},"related_words":{"derivatives":["cleistogamy","chasmogamy"],"related_terms":["autogamy","geitonogamy","xenogamy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'noncleistogamic' is a specialized botanical adjective describing plants that produce open, chasmogamous flowers, which are pollinated by external agents. Understanding this term requires familiarity with botanical concepts such as pollination strategies and floral morphology. It is primarily used in academic and research contexts related to plant biology and ecology."},"example_sentences":[{"sentence":"The noncleistogamic nature of these violets allows for greater genetic diversity through cross-pollination.","translation":"これらのスミレの開放花受粉の性質は、異種受粉を通じてより大きな遺伝的多様性を可能にする。","type":"general","meaning_category":"botany"},{"sentence":"While some species exhibit cleistogamy, others rely on noncleistogamic reproduction to ensure seed production.","translation":"いくつかの種は閉鎖花受粉を示す一方、他の種は種子生産を確実にするために開放花受粉に依存している。","type":"comparative","meaning_category":"botany"}]}