{"word":"re-rectify","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び修正する、再調整する、再矯正する","english_definition":"To rectify again; to correct or adjust something that has previously been rectified, possibly imperfectly or in a way that has become unsatisfactory.","examples":[{"sentence":"The engineer had to re-rectify the alignment of the telescope after the earthquake.","translation":"地震の後、エンジニアは望遠鏡の配置を再調整する必要があった。"},{"sentence":"The software automatically re-rectifies image distortion.","translation":"そのソフトウェアは自動的に画像の歪みを再修正する。"},{"sentence":"After the initial calibration failed, they decided to re-rectify the instrument.","translation":"最初の較正が失敗した後、彼らはその機器を再調整することに決めた。"}],"collocations":["re-rectify an image (画像を再修正する)","re-rectify a mistake (間違いを再修正する)","re-rectify an alignment (配置を再調整する)","re-rectify a problem (問題を再修正する)"],"synonyms":["recorrect","readjust","realign","recalibrate","remedy","fix"],"antonyms":["distort","misalign","damage"]}],"etymology":{"value":"接頭辞 \"re-\" (再び) + 動詞 \"rectify\" (修正する、正す)","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːˈrɛktɪfaɪ/","syllables":"re-rec-ti-fy"},"inflection":{"verb_forms":{"present_simple":["re-rectify","re-rectifies"],"past_simple":"re-rectified","past_participle":"re-rectified","present_participle":"re-rectifying"}},"usage_notes":{"explanation":"\"re-rectify\" は、すでに一度修正されたものを再び修正することを意味します。最初の修正が不完全であったり、何らかの理由で修正が不適切になった場合に使用されます。技術的な文脈や、正確さが重要な状況でよく見られます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I re-rectified the problem twice, but it still persists.","correct":"✓ I re-rectified the problem twice, but it still persists. (This is grammatically correct, but consider if a different word would be more appropriate.)","note":"While grammatically correct, consider if a stronger word like 'completely rectified,' 'thoroughly corrected,' or 'resolved' would be more appropriate to convey the persistence of the problem despite repeated attempts to fix it."},{"incorrect":"✗ He re-rectified the situation by apologizing.","correct":"✓ He rectified the situation by apologizing.","note":"If the situation was never previously rectified, simply use 'rectified' without the 're-' prefix."}],"priority":"★☆☆"},"related_words":{"derivatives":["rectify (修正する)","rectification (修正)"],"related_terms":["correct","adjust","align","calibrate","repair","remedy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低い (Low) - 専門的な文脈で使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"re-rectify\" is a relatively uncommon and specialized term. It implies that something has been previously rectified (corrected or adjusted), but that further rectification is necessary. This might be because the initial rectification was insufficient, or because the situation has changed since the first rectification. The term is most likely to be encountered in technical or formal contexts where precision is important. Understanding the base word \"rectify\" is essential for grasping the meaning of \"re-rectify.\""},"example_sentences":[{"sentence":"The lens distortion was initially corrected, but the software had to re-rectify it for optimal results.","translation":"レンズの歪みは最初修正されたが、最適な結果を得るためにソフトウェアはそれを再修正する必要があった。","type":"general","meaning_category":"再修正する"},{"sentence":"The surveyor had to re-rectify the map after discovering a new error in the data.","translation":"測量技師はデータに新たな誤りを発見した後、地図を再修正する必要があった。","type":"technical","meaning_category":"再調整する"},{"sentence":"The manufacturing process includes a step to re-rectify any imperfections in the product's surface.","translation":"製造プロセスには、製品表面の欠陥を再修正する工程が含まれている。","type":"manufacturing","meaning_category":"再矯正する"}]}