{"word":"non-intellectuals","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非知識人、知的な活動に関心がない人々","english_definition":"People who are not interested in or engaged in intellectual pursuits; those who do not prioritize or value intellectual activities.","examples":[{"sentence":"The politician appealed to non-intellectuals with simple messages.","translation":"その政治家は、わかりやすいメッセージで非知識層に訴えかけた。"},{"sentence":"The book was written for non-intellectuals who want to understand basic economics.","translation":"その本は、基本的な経済学を理解したい非知識層に向けて書かれた。"},{"sentence":"He felt out of place among the intellectuals, identifying more with non-intellectuals.","translation":"彼は知識人の中にいることに場違いな感じがし、むしろ非知識人との一体感を覚えた。"}],"collocations":["appeal to non-intellectuals (非知識層に訴えかける)","cater to non-intellectuals (非知識層のニーズに応える)","reach non-intellectuals (非知識層に届ける)","target non-intellectuals (非知識層をターゲットにする)"],"synonyms":["common people","average citizens","laypersons","general public","ordinary people"],"antonyms":["intellectuals","academics","scholars","thinkers","eggheads"],"related_terms":["anti-intellectualism","intellectual","intellect"],"usage_notes":{"explanation":"The term 'non-intellectuals' is often used to describe people who do not prioritize or engage in intellectual pursuits. It can sometimes carry a negative connotation, implying a lack of intelligence or education, but it more accurately describes a difference in interests and priorities. The term is often used in discussions about politics, culture, and education to describe a particular segment of the population.","priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"}}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'intellectuals'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnɪnˈtelɪktʃuəlz/","syllables":"non-in-tel-lec-tu-als"},"inflection":{"noun_plural":"non-intellectuals"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non-intellectual.","correct":"✓ He is a non-intellectual person. / ✓ He is not an intellectual.","note":"While 'non-intellectual' can be used as a noun, it's more common and natural to use it as an adjective modifying a noun (e.g., 'non-intellectual person'). Alternatively, you can use the phrase 'not an intellectual'."}],"priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'non-intellectuals' refers to people who are not particularly interested in or focused on intellectual activities. It's a term often used in discussions about society, politics, and culture to describe a group of people who may have different priorities or interests than those who are considered 'intellectuals.' The word itself is formed by simply adding 'non-' to 'intellectuals,' indicating the opposite. It's important to note that this term can sometimes be seen as negative, implying a lack of intelligence, but it's more accurately used to describe a difference in interests and values."},"example_sentences":[{"sentence":"The movie was designed to appeal to non-intellectuals seeking simple entertainment.","translation":"その映画は、単純な娯楽を求める非知識層にアピールするように作られた。","type":"general"},{"sentence":"Many politicians try to connect with non-intellectuals by emphasizing common values and practical solutions.","translation":"多くの政治家は、共通の価値観と現実的な解決策を強調することで、非知識層とのつながりを築こうとする。","type":"political"},{"sentence":"The author deliberately avoided complex language to make the book accessible to non-intellectuals.","translation":"著者は、非知識層にも読みやすくするために、意図的に複雑な言葉を避けた。","type":"literary"}]}