{"word":"disembalm","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(死体を)防腐処理を取り除く、(比喩的に)保存状態を悪化させる","english_definition":"to remove embalming fluids from (a corpse); to reverse the process of embalming; (figuratively) to undo or reverse a process of preservation, causing deterioration.","examples":[{"sentence":"The museum curator decided to disembalm the ancient mummy to study its original state.","translation":"博物館の学芸員は、古代ミイラの元の状態を研究するために、防腐処理を取り除くことを決定した。"},{"sentence":"(Figurative) The historian sought to disembalm the romanticized narrative of the war, revealing its brutal realities.","translation":"(比喩的に) 歴史家は、戦争のロマンチックな物語から防腐処理を取り除き、その残酷な現実を明らかにした。"}],"collocations":["disembalm a corpse (死体の防腐処理を取り除く)","disembalm a narrative (物語の防腐処理を取り除く)"],"synonyms":["de-embalm","unembalm","deteriorate","degrade"],"antonyms":["embalm","preserve","conserve"]}],"etymology":{"value":"The word 'disembalm' is formed by adding the prefix 'dis-' (meaning 'opposite of' or 'undoing') to the word 'embalm'. 'Embalm' comes from the Old French 'embaumer', which in turn comes from 'baum', meaning 'balsam', referring to the aromatic resin used in the embalming process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪsɪmˈbɑːm/","syllables":"dis-em-balm"},"inflection":{"verb_forms":{"present_simple":["disembalm","disembalms"],"past_simple":"disembalmed","past_participle":"disembalmed","present_participle":"disembalming"}},"usage_notes":{"explanation":"'Disembalm' is a relatively rare word, primarily used in contexts related to the removal of embalming fluids from a corpse. It can also be used figuratively to describe the act of stripping away artificial or idealized elements from something, revealing its true, often less appealing, nature. The figurative usage is even less common than the literal one.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist disembalmed the painting with a solvent.","correct":"✓ The artist restored the painting with a solvent.","note":"'Disembalm' is specifically related to removing embalming fluids or figuratively undoing a preservation process. 'Restore' is more appropriate for artwork. "},{"incorrect":"✗ The corpse was disembalming naturally.","correct":"✓ The corpse was decomposing naturally.","note":"'Disembalm' is an active process. Decomposition is the natural breakdown of organic matter."}],"priority":"★★☆"},"related_words":{"derivatives":["embalm (verb: to preserve a corpse with chemicals)","embalmer (noun: a person who embalms corpses)","embalming (noun: the process of preserving a corpse)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (Very rare, specialized vocabulary)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Disembalm' is a highly specialized and uncommon word. It refers to the act of removing embalming fluids from a corpse, or figuratively, stripping away artificial or idealized elements to reveal a less appealing truth. Due to its rarity and specific context, it's unlikely to be encountered outside of specialized fields such as forensic science, history, or literature dealing with themes of decay and disillusionment."},"example_sentences":[{"sentence":"After years of being embalmed, the mummy was carefully disembalmed to allow for carbon dating.","translation":"何年も防腐処理されていたミイラは、炭素年代測定のために慎重に防腐処理を取り除かれた。","type":"verb (vt)","meaning_category":"remove embalming fluids"},{"sentence":"The documentary disembalmed the myth of the Wild West, showing the harsh realities of frontier life.","translation":"そのドキュメンタリーは西部開拓時代の神話から防腐処理を取り除き、フロンティア生活の厳しい現実を示した。","type":"verb (vt)","meaning_category":"figurative - remove idealized elements"}]}