{"word":"organization-oriented","meanings":[{"part_of_speech":"adjective","definition":"組織志向の、組織重視の","english_definition":"Focused on the needs, goals, and priorities of an organization, rather than individual desires or external factors.","examples":[{"sentence":"She is an organization-oriented manager who always puts the company's interests first.","translation":"彼女は常に会社の利益を最優先する組織志向のマネージャーだ。"},{"sentence":"The project requires organization-oriented individuals who can work effectively within a team.","translation":"そのプロジェクトには、チーム内で効果的に働くことができる組織志向の人が必要だ。"},{"sentence":"His decisions are always organization-oriented, even if they are not popular with everyone.","translation":"彼の決定は、たとえ皆に人気がなくても、常に組織志向だ。"}],"collocations":["organization-oriented approach (組織志向のアプローチ)","organization-oriented culture (組織志向の文化)","organization-oriented strategy (組織志向の戦略)","organization-oriented leadership (組織志向のリーダーシップ)"],"synonyms":["company-focused","corporate-minded","team-oriented","mission-driven"],"antonyms":["individualistic","self-centered","independent","autonomously-driven"],"related_words":["organization","orientation","teamwork","collaboration","corporate culture"],"level_frequency":{},"usage_notes":{"explanation":"'Organization-oriented' describes someone or something that prioritizes the well-being and success of a group or company over personal gain or external influences. It suggests a focus on teamwork, collaboration, and achieving common goals.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The organization-oriented person always agrees with everything the boss says.","correct":"The organization-oriented person considers the company's needs when making decisions.","note":"Being organization-oriented doesn't mean blindly agreeing; it means considering the organization's best interests."},{"incorrect":"Organization-oriented is the same as being a workaholic.","correct":"Organization-oriented means prioritizing the company's goals, not necessarily working excessively.","note":"It's about focus, not just working long hours."}],"priority":"★★☆"},"etymology":{"value":"Combination of 'organization' (from Greek 'organon' meaning 'tool' or 'instrument') and 'oriented' (from Latin 'oriens' meaning 'rising', referring to the East). Thus, 'organization-oriented' means 'directed or focused towards the organization'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrɡənəˈzeɪʃən ˈɔːrientɪd/","syllables":"or-ga-ni-za-tion o-ri-ent-ed"},"inflection":{"notes":"This is an adjective and does not inflect."},"readability_explanation":{"level":"B2","text":"'Organization-oriented' is a compound adjective that describes someone who prioritizes the needs and goals of a company or group. It suggests a focus on teamwork and achieving common objectives, rather than individual desires. This term is often used in business and management contexts."},"example_sentences":[{"sentence":"The company seeks organization-oriented employees who are dedicated to achieving its strategic objectives.","translation":"会社は、戦略目標の達成に専念する組織志向の従業員を求めている。","type":"general","meaning_category":"general"},{"sentence":"An organization-oriented approach is crucial for effective project management.","translation":"効果的なプロジェクト管理には、組織志向のアプローチが不可欠だ。","type":"approach","meaning_category":"approach"},{"sentence":"The new CEO is implementing an organization-oriented culture to improve teamwork and collaboration.","translation":"新しいCEOは、チームワークとコラボレーションを改善するために、組織志向の文化を導入している。","type":"culture","meaning_category":"culture"}]}]}