{"word":"terrage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(農業)段々畑、階段状の地形","english_definition":"Land formed into terraces or a series of level platforms resembling steps, especially for agriculture.","examples":[{"sentence":"The terrage allowed them to cultivate the steep hillside.","translation":"その段々畑のおかげで、彼らは急な丘の中腹を耕作することができた。"},{"sentence":"Ancient terrage systems are still used in some parts of the world.","translation":"古代の段々畑システムは、世界のいくつかの地域で今も使用されている。"}],"collocations":["agricultural terrage","ancient terrage","hillside terrage"],"synonyms":["terrace","contour farming","step farming"],"antonyms":[]}],"etymology":{"value":"Derived from 'terrace' with a suffix indicating a formed or arranged state.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtɛrɪdʒ/","syllables":"ter-rage"},"inflection":{"noun_plural":"terrages"},"usage_notes":{"explanation":"'Terrage' specifically refers to land that has been deliberately shaped into terraces, often for agricultural purposes. It emphasizes the artificial or modified nature of the terrain.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The terrage was very flat.","correct":"✓ The terrace was very flat.","note":"'Terrage' refers to the entire system of terraces, while 'terrace' refers to a single level or platform."}],"priority":"★★☆"},"related_words":{"derivatives":["terrace","terraced","terracing"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Terrage' is a specialized term primarily used in the context of agriculture and landscape architecture to describe land that has been formed into terraces. It is less commonly used than 'terrace' and typically appears in technical or academic discussions related to land management and cultivation techniques. Understanding this term requires familiarity with advanced vocabulary related to geography and agriculture."},"example_sentences":[{"sentence":"The intricate terrage transformed the rugged landscape into fertile farmland.","translation":"複雑な段々畑が、険しい地形を肥沃な農地に変えた。","type":"noun","meaning_category":"段々畑"},{"sentence":"The efficiency of the terrage system allowed for intensive cultivation of crops.","translation":"段々畑システムの効率性により、集約的な作物の栽培が可能になった。","type":"noun","meaning_category":"段々畑"}]}