{"word":"glucose","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"グルコース、ブドウ糖","english_definition":"A simple sugar with the molecular formula C6H12O6; a major source of energy for the body's cells.","examples":[{"sentence":"Glucose is the primary source of energy for the brain.","translation":"グルコースは脳の主要なエネルギー源です。"},{"sentence":"The doctor measured the patient's blood glucose levels.","translation":"医者は患者の血糖値を測定しました。"},{"sentence":"Plants produce glucose through photosynthesis.","translation":"植物は光合成を通してグルコースを生成します。"}],"collocations":["blood glucose (血糖)","glucose level (グルコース値)","glucose metabolism (グルコース代謝)","glucose tolerance (グルコース耐性)","glucose solution (グルコース溶液)","glucose test (グルコース検査)"],"synonyms":["dextrose","blood sugar"],"antonyms":[],"related_terms":["fructose","sucrose","carbohydrate","insulin","glycogen"]}],"etymology":{"value":"From French 'glucose', coined by Dumas in 1838, from Greek 'glykys' meaning 'sweet'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡluːkoʊs/","syllables":"glu-cose"},"inflection":{"noun_plural":"glucoses"},"usage_notes":{"explanation":"'Glucose' is a monosaccharide, a simple sugar that is an important energy source in living organisms. It is often referred to as blood sugar because it circulates in the blood. In medicine, glucose levels are carefully monitored, especially in individuals with diabetes. In everyday language, it's often used interchangeably with 'sugar,' although technically, sugar refers to a broader category of carbohydrates.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to take glucose for my insulin.","correct":"✓ I need to take insulin to regulate my glucose.","note":"Insulin is taken to regulate glucose levels, not the other way around."},{"incorrect":"✗ Glucose is a type of protein.","correct":"✓ Glucose is a type of carbohydrate.","note":"Glucose is a simple sugar, which is a type of carbohydrate, not a protein."}],"priority":"★★☆"},"related_words":{"derivatives":["glucoside","glucogenesis","glycolysis"],"related_terms":["carbohydrate","sugar","fructose","sucrose","lactose","insulin","glycogen","diabetes","hyperglycemia","hypoglycemia"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common in scientific and medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Glucose' is a scientific term referring to a type of sugar that is a primary source of energy for the body. It is often discussed in the context of health, nutrition, and biology. Understanding this term is important for comprehending discussions about diabetes, metabolism, and the role of carbohydrates in the diet. While not a term used in everyday casual conversation, it is common in health-related articles and discussions."},"example_sentences":[{"sentence":"The athlete drank a glucose solution for a quick energy boost.","translation":"その運動選手は、素早くエネルギーを補給するためにグルコース溶液を飲んだ。","type":"general","meaning_category":"energy source"},{"sentence":"High blood glucose levels can be a sign of diabetes.","translation":"高血糖値は糖尿病の兆候である可能性がある。","type":"medical","meaning_category":"medical condition"},{"sentence":"During photosynthesis, plants convert carbon dioxide and water into glucose and oxygen.","translation":"光合成中、植物は二酸化炭素と水をグルコースと酸素に変換する。","type":"biology","meaning_category":"biological process"}]}