{"word":"婆娑羅","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"伝統や権威にとらわれず、自由奔放な振る舞いをすること。また、そのさまや、そのような人。南北朝時代に現れた、既存の秩序を無視した行動様式や美意識を指す。","english_definition":"A state of being free and unrestrained, not bound by tradition or authority; also, a person who embodies such behavior. Refers to a lifestyle and aesthetic that emerged during the Nanboku-chō period, characterized by disregard for existing order.","examples":[{"sentence":"婆娑羅大名","translation":"Basara daimyo (a daimyo who behaved in a flamboyant and unconventional manner)."},{"sentence":"婆娑羅の美意識","translation":"Basara aesthetic (an aesthetic characterized by extravagance and disregard for traditional norms)."}],"collocations":["婆娑羅大名 (basara daimyo)","婆娑羅の美意識 (basara aesthetic)","婆娑羅を気取る (to act in a basara style)"],"synonyms":["異端","反骨","傾奇者","アウトロー"],"antonyms":["従順","保守的","伝統的"],"notes":"婆娑羅は、単なる反逆や無秩序ではなく、独自の美意識や価値観に基づいた行動を指す点が特徴です。"}],"etymology":{"value":"サンスクリット語の「vajra（金剛杵）」が語源とする説が有力。金剛杵は仏教において煩悩を打ち砕く武器であり、そこから転じて既存の価値観や権威を打ち破るという意味合いを持つようになったとされる。","priority":"★★★"},"pronunciation":{"ipa":"/basara/","syllables":"ba-sa-ra"},"inflection":{"notes":"名詞なので活用はありません。"},"usage_notes":{"explanation":"「婆娑羅」は、南北朝時代に現れた社会現象であり、単なる反体制的な行動ではなく、独自の美意識や価値観に基づいた自由奔放な振る舞いを指します。現代では、既存の枠にとらわれない、個性的なスタイルや生き方を形容する言葉として用いられることがあります。ただし、ネガティブな意味合いで使われることもあり、文脈によって解釈が異なります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"彼は婆娑羅な人だ。（意味：彼はだらしない人だ。）","correct":"彼は型破りな人だ。（意味：He is an unconventional person.）","note":"婆娑羅は、だらしなさや無秩序とは異なります。独自の美意識や価値観に基づいた行動を指します。"},{"incorrect":"婆娑羅は現代の若者の間で流行している。（意味：Basara is popular among young people today.）","correct":"婆娑羅の精神は現代の若者にも通じるものがある。（意味：The spirit of basara resonates with young people today.）","note":"婆娑羅は特定のファッションや文化を指すものではありません。既存の価値観にとらわれない精神性を指します。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"historical_terms":["南北朝時代","金剛杵"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"「婆娑羅」は、歴史的な背景を持つ言葉であり、現代ではあまり一般的ではありません。南北朝時代に現れた、既存の秩序を無視した自由奔放な振る舞いを指します。単なる反逆や無秩序ではなく、独自の美意識や価値観に基づいた行動を意味する点が特徴です。現代では、型破りなスタイルや生き方を形容する言葉として用いられることがありますが、文脈によってはネガティブな意味合いを持つこともあります。"},"example_sentences":[{"sentence":"彼は婆娑羅を気取って奇抜な服装をしている。","translation":"He is dressing in an eccentric style, trying to be basara.","type":"example","meaning_category":"自由奔放な振る舞い"},{"sentence":"この時代の文化は婆娑羅の精神に彩られている。","translation":"The culture of this era is colored by the spirit of basara.","type":"example","meaning_category":"既存の秩序を無視した行動様式"},{"sentence":"婆娑羅大名は、従来の権威を無視して独自の勢力を築いた。","translation":"The basara daimyo ignored traditional authority and built their own power.","type":"example","meaning_category":"南北朝時代の武将"}]}