{"word":"mockish","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"嘲笑的な、軽蔑的な、からかうような","english_definition":"inclined to mock; given to ridicule or derision; somewhat mocking.","examples":[{"sentence":"He had a mockish grin on his face.","translation":"彼は嘲笑的な笑みを浮かべていた。"},{"sentence":"Her mockish tone made it clear she didn't take him seriously.","translation":"彼女の軽蔑的な口調は、彼女が彼を真剣に受け止めていないことを明らかにした。"},{"sentence":"The play was full of mockish humor.","translation":"その劇は嘲笑的なユーモアに満ちていた。"}],"collocations":["mockish humor","mockish grin","mockish tone","mockish laughter"],"synonyms":["mocking","sarcastic","derisive","scornful","contemptuous","ridiculing"],"antonyms":["respectful","admiring","approving","deferential","reverent"]}],"etymology":{"value":"\"Mock\" + \"-ish\".  \"Mock\" comes from Old French mocquer, meaning \"to deride, jeer.\" The suffix \"-ish\" indicates a tendency toward or a slight degree of the root word's quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɒkɪʃ/","syllables":"mock-ish"},"inflection":{"notes":"Comparative and superlative forms are typically \"more mockish\" and \"most mockish,\" respectively, as it is not a core adjective."},"usage_notes":{"explanation":"\"Mockish\" describes a mild or subtle form of mocking. It suggests a tendency to mock or a quality that is somewhat mocking, but not necessarily overtly or aggressively so. It often implies a playful or teasing element, although it can also indicate a more dismissive or contemptuous attitude.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The mockish sun shone brightly.","correct":"✓ The sun shone brightly.","note":"\"Mockish\" is used to describe behavior or attitudes, not inanimate objects like the sun. It is not appropriate to describe the quality of sunlight. "},{"incorrect":"✗ He gave a mockish apology, which was very sincere.","correct":"✓ He gave a mocking apology, which was insincere.","note":"A mockish apology is inherently insincere. If the apology is sincere, \"mockish\" is not the correct word."}],"priority":"★★☆"},"related_words":{"derivatives":["mock (verb, noun, adjective)","mockingly (adverb)","mockery (noun)"],"phrasal_verbs":[],"related_adjectives":["sarcastic","ironic","satirical","cynical"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Mockish\" is a relatively uncommon word used to describe something that is somewhat mocking or inclined to mock. It implies a subtle or mild form of ridicule. Because of its relative rarity, it is more likely to be encountered in advanced texts or used by writers aiming for a specific tone. Understanding the root word \"mock\" is helpful in deciphering its meaning."},"example_sentences":[{"sentence":"His mockish comments were intended to be humorous, but they offended some people.","translation":"彼の嘲笑的なコメントはユーモラスな意図があったが、何人かの人を不快にさせた。","type":"general","meaning_category":"嘲笑的な"},{"sentence":"There was a mockish quality to her imitation of the teacher.","translation":"彼女の先生の物真似には、からかうようなところがあった。","type":"general","meaning_category":"軽蔑的な"},{"sentence":"The mockish tone in his voice suggested he wasn't taking the situation seriously.","translation":"彼の声のからかうような口調は、彼がその状況を真剣に受け止めていないことを示唆していた。","type":"general","meaning_category":"からかうような"}]}