{"word":"heroologist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"英雄学者、英雄研究者：英雄や英雄譚を専門的に研究する人。","english_definition":"A scholar who studies heroes and hero myths.","examples":[{"sentence":"The heroologist presented a new interpretation of the epic poem.","translation":"その英雄学者は、その叙事詩の新しい解釈を発表した。"},{"sentence":"Heroologists often draw from various disciplines, including literature, history, and psychology.","translation":"英雄学者たちは、文学、歴史、心理学など、さまざまな分野から知識を引き出すことが多い。"}],"collocations":["study of heroes","myth analysis","heroic narrative"],"synonyms":["mythologist","scholar of mythology","hero scholar"],"antonyms":[]}],"etymology":{"value":"\"Hero-\" (英雄) + \"-ology\" (～学)","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɪəroʊˈɒlədʒɪst/","syllables":"he-ro-ol-o-gist"},"inflection":{"noun_plural":"heroologists"},"usage_notes":{"explanation":"\"Heroologist\" is a relatively uncommon term, primarily used in academic or scholarly contexts. It refers to someone who studies heroes, often in a mythological or literary sense.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["heroology (英雄学)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'heroologist' is a specialized term used in academic fields such as mythology, literature, and cultural studies. It refers to a scholar who studies heroes and their narratives. Due to its specific and academic nature, it is not commonly encountered in everyday language. Understanding the word requires familiarity with the suffix '-ology,' which denotes a field of study or science."},"example_sentences":[{"sentence":"The conference featured several prominent heroologists discussing the role of the hero in modern society.","translation":"その会議では、数名の著名な英雄学者が、現代社会における英雄の役割について議論した。","type":"noun","meaning_category":"英雄研究者"},{"sentence":"As a heroologist, she focused on the psychological aspects of heroic figures.","translation":"英雄学者として、彼女は英雄的人物の心理的側面に焦点を当てた。","type":"noun","meaning_category":"英雄研究者"}]}