{"word":"unanecdotal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"逸話的でない、逸話に基づかない","english_definition":"Not based on or consisting of anecdotes.","examples":[{"sentence":"The study provided unanecdotal evidence to support the theory.","translation":"その研究は、その理論を裏付ける逸話的でない証拠を提供した。"},{"sentence":"We need unanecdotal data to make informed decisions.","translation":"十分な情報に基づいて意思決定を行うためには、逸話に基づかないデータが必要である。"}],"collocations":["unanecdotal evidence","unanecdotal data","unanecdotal information"],"synonyms":["factual","objective","empirical","statistical","systematic"],"antonyms":["anecdotal","subjective","personal","informal"]}],"etymology":{"value":"接頭辞 un- (否定) + anecdotal (逸話的な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnˌænɪkˈdəʊtl/","syllables":"un-an-ec-do-tal"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"'Unanecdotal' is used to describe information or evidence that is not based on personal stories or individual experiences. It emphasizes the use of objective, factual, or statistical data. It is often used in academic, scientific, or professional contexts where reliable and unbiased information is crucial.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The report was unanecdotal, filled with personal stories.","correct":"✓ The report was anecdotal, filled with personal stories.","note":"'Unanecdotal' means not based on anecdotes, so it's contradictory to say a report filled with personal stories is unanecdotal."},{"incorrect":"✗ Use unanecdotal when you want to tell a story.","correct":"✓ Use anecdotal when you want to tell a story.","note":"'Anecdotal' is used when telling a story, while 'unanecdotal' is used when avoiding stories and relying on facts."}],"priority":"★★★"},"related_words":{"derivatives":["anecdote (名詞: 逸話)","anecdotally (副詞: 逸話的に)","anecdotal (形容詞: 逸話的な)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unanecdotal' is a relatively rare and sophisticated word. It means 'not based on anecdotes.' An anecdote is a short, often personal story used to illustrate a point. Therefore, 'unanecdotal' refers to information or evidence that is factual, objective, and not reliant on individual stories. It's commonly used in academic or professional settings where rigorous evidence is required. Understanding the root word 'anecdote' is key to grasping the meaning of 'unanecdotal.'"},"example_sentences":[{"sentence":"The scientist presented unanecdotal evidence from a large-scale study.","translation":"科学者は大規模な研究から得られた逸話的でない証拠を提示した。","type":"general","meaning_category":"general"},{"sentence":"The policy decision was based on unanecdotal data analysis.","translation":"その政策決定は、逸話に基づかないデータ分析に基づいて行われた。","type":"general","meaning_category":"general"},{"sentence":"The article emphasized the importance of unanecdotal reporting.","translation":"その記事は、逸話に基づかない報道の重要性を強調した。","type":"general","meaning_category":"general"}]}