{"word":"horopter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ホロプター：両眼視において、一点を固視したとき、両眼の網膜上の対応点に像を結ぶ点の軌跡。","english_definition":"(In binocular vision) the locus of points in space that project to corresponding points on the retinas of both eyes when fixating on a particular point.","examples":[{"sentence":"The Vieth-Müller circle is a theoretical horopter.","translation":"ヴィエス＝ミュラー円は理論的なホロプターである。"},{"sentence":"Points on the horopter are seen as single.","translation":"ホロプター上の点は単一に見える。"}],"collocations":["true horopter","empirical horopter","theoretical horopter","Vieth-Müller circle","Hering-Hillebrand horopter deviation"],"synonyms":["Vieth-Müller circle"],"antonyms":[]},{"part_of_speech":"noun","definition":"(まれ) ホロプター上の点","english_definition":"(rare) A point on the horopter.","examples":[{"sentence":"The object was located on the horopter.","translation":"対象物はホロプター上に位置していた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'ὅρος' (horos) meaning 'boundary, limit' and 'ὀπτήρ' (optēr) meaning 'observer'.","priority":"★★☆"},"pronunciation":{"ipa":"/hɔˈrɒptər/","syllables":"ho-rop-ter"},"inflection":{"noun_plural":"horopters"},"usage_notes":{"explanation":"The horopter is a concept in binocular vision that describes the location of objects that will be seen as single images, not double. It is not a fixed surface but varies depending on the fixation point. The theoretical horopter is often approximated by the Vieth-Müller circle, but the empirical horopter, determined experimentally, often deviates from this theoretical circle.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["horopteric (adjective)"],"phrasal_verbs":[],"related_terms":["binocular vision","stereopsis","retina","fixation point","diplopia"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'horopter' is a highly specialized term primarily used in the fields of vision science, ophthalmology, and related areas. It refers to the set of points in space that stimulate corresponding retinal points in both eyes when a person fixates on a specific point. Understanding the horopter requires knowledge of binocular vision, stereopsis, and the geometry of the visual system. It is unlikely to be encountered outside of technical or academic contexts related to vision. The concept is complex and involves both theoretical models (e.g., the Vieth-Müller circle) and empirical measurements, which often deviate from the theoretical predictions."},"example_sentences":[{"sentence":"The patient's horopter was measured to assess their binocular vision.","translation":"患者の両眼視機能を評価するために、ホロプターが測定された。","type":"noun","meaning_category":"両眼視における点の軌跡"},{"sentence":"Objects lying on the horopter appear single, while those off the horopter may cause diplopia.","translation":"ホロプター上にある物体は単一に見え、ホロプターから外れた物体は複視を引き起こす可能性がある。","type":"noun","meaning_category":"両眼視における点の軌跡"}]}