{"word":"Faeculence","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"濁り、不純物、特に液体の底に沈殿した汚物","english_definition":"Turbidity; foul matter; sediment; especially, foul matter deposited at the bottom of a liquid.","examples":[{"sentence":"The faeculence in the water made it undrinkable.","translation":"水中の濁りがそれを飲めなくした。"},{"sentence":"The faeculence settled at the bottom of the jar.","translation":"汚物が瓶の底に沈殿した。"}],"collocations":["faeculence of water","faeculence in solution"],"synonyms":["sediment","dregs","lees","turbidity","impurity"],"antonyms":["clarity","purity"]}],"etymology":{"value":"From Latin 'faex' (dregs, sediment) + '-ulence' (state or quality of being).","priority":"★★☆"},"pronunciation":{"ipa":"ˈfiːkjʊləns","syllables":"fee-kyuh-luhns"},"inflection":{"noun_plural":"faeculences"},"usage_notes":{"explanation":"'Faeculence' refers to the condition of being turbid or containing impurities, often with a connotation of foulness or filth. It is typically used to describe liquids that have sediment or dregs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The faeculence of the idea made it unpopular.","correct":"✓ The absurdity of the idea made it unpopular.","note":"'Faeculence' refers to physical turbidity or foulness, not abstract concepts. Use 'absurdity' or another appropriate term for ideas."}],"priority":"★☆☆"},"related_words":{"derivatives":["faeculent (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Faeculence' is a technical term referring to the condition of being turbid or containing impurities, particularly in liquids. It is a rarely used word, typically found in scientific or technical contexts when describing the physical properties of substances. Understanding this word requires a strong vocabulary and familiarity with scientific terminology."},"example_sentences":[{"sentence":"The scientist observed the faeculence in the sample under a microscope.","translation":"科学者は顕微鏡でサンプル中の濁りを観察した。","type":"noun","meaning_category":"濁り、不純物"},{"sentence":"The faeculence of the river water indicated significant pollution.","translation":"川の水の濁りは重大な汚染を示していた。","type":"noun","meaning_category":"濁り、不純物"}]}