{"word":"unisexuality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"単一性、単一性愛、男女両用性","english_definition":"The state or quality of being unisex; the characteristic of being suitable for or common to both sexes.","examples":[{"sentence":"The unisexuality of the clothing line made it popular among young people.","translation":"その衣料品ラインの男女両用性（ユニセックス性）が、若者の間で人気を博した。"},{"sentence":"The trend towards unisexuality in fashion is becoming more prevalent.","translation":"ファッションにおけるユニセックス化の傾向はますます一般的になっている。"}],"collocations":["unisexuality in fashion","unisexuality in design","promote unisexuality"],"synonyms":["androgyny","gender neutrality","unisex design"],"antonyms":["gender-specific","sex-specific","gendered"]},{"part_of_speech":"noun","definition":"(生物学)単性生殖、単為生殖","english_definition":"(biology) Reproduction involving only one sex or parent; asexual reproduction.","examples":[{"sentence":"Unisexuality is common in some plant species.","translation":"単性生殖は、一部の植物種によく見られる。"},{"sentence":"The organism reproduces through unisexuality, without the need for a mate.","translation":"その生物は、配偶者を必要とせずに、単性生殖によって繁殖する。"}],"collocations":["unisexuality in plants","unisexuality in animals","asexual reproduction"],"synonyms":["asexuality","parthenogenesis"],"antonyms":["bisexuality","sexual reproduction"]}],"etymology":{"value":"From 'unisexual' + '-ity'. 'Unisexual' is derived from 'uni-' (meaning 'one' or 'single') + 'sexual'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjuːnɪsekʃuˈæləti/","syllables":"u-ni-sex-u-al-i-ty"},"inflection":{"noun_plural":"unisexualities (rarely used)"},"usage_notes":{"explanation":"The term 'unisexuality' has two main meanings: one related to gender neutrality and the other related to biological reproduction. In the context of fashion, design, and culture, it refers to the characteristic of being suitable for or common to both sexes. In biology, it refers to reproduction involving only one sex or parent, which is also known as asexual reproduction or parthenogenesis. The context usually clarifies which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unisexuality person.","correct":"✓ The unisexual person.","note":"'Unisexuality' is a noun, referring to the quality or state. 'Unisexual' is an adjective, describing a person, thing, or design. To describe a person who is androgynous or prefers unisex styles, use 'unisexual' as an adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":["unisexual (adjective)","unisex (adjective)"],"phrases":["unisex clothing","unisex design","unisex salon"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unisexuality' is a term with two primary meanings, one referring to gender neutrality and the other to asexual reproduction. In cultural contexts, it describes something suitable for both sexes, like unisex clothing. In biology, it refers to reproduction involving only one parent. Understanding the context is key to interpreting the intended meaning. The word itself is relatively uncommon and more frequently encountered in academic or specialized discussions."},"example_sentences":[{"sentence":"The store promoted the unisexuality of its new clothing line.","translation":"その店は、新しい衣料品ラインの男女両用性（ユニセックス性）を宣伝した。","type":"noun","meaning_category":"gender neutrality"},{"sentence":"Unisexuality allows some species to reproduce rapidly in favorable conditions.","translation":"単性生殖は、一部の種が好ましい条件下で急速に繁殖することを可能にする。","type":"noun","meaning_category":"asexual reproduction"}]}