{"word":"reefing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(帆船の)縮帆","english_definition":"The process of reducing the area of a sail, usually by folding or rolling part of it up.","examples":[{"sentence":"Reefing is necessary in strong winds to prevent damage to the sail and rigging.","translation":"強風下では、帆や索具の損傷を防ぐために縮帆が必要です。"},{"sentence":"The crew practiced reefing the mainsail before heading out to sea.","translation":"乗組員は出航前にメインセールの縮帆を練習しました。"}],"collocations":["single reefing","double reefing","slab reefing","roller reefing"],"synonyms":["furling","shortening sail"],"antonyms":["unreefing","full sail"]},{"part_of_speech":"verb","definition":"(帆)を縮める","english_definition":"To reduce the area of a sail by folding or rolling part of it up.","examples":[{"sentence":"We need to start reefing the sails as the wind is picking up.","translation":"風が強くなってきたので、帆を縮め始める必要があります。"},{"sentence":"The captain ordered the crew to reef the jib.","translation":"船長は乗組員にジブを縮めるように命じました。"}],"collocations":["reef a sail","reef down","reef in"],"synonyms":["furl","shorten sail"],"antonyms":["unreef","unfurl"]}],"etymology":{"value":"From the verb 'reef', which comes from Middle Dutch 'rif', meaning 'rib' or 'reef'. The nautical sense developed from the idea of taking in a 'rib' or fold of the sail.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈriːfɪŋ/","syllables":"reef-ing"},"inflection":{"verb_forms":{"present_participle":"reefing","past_simple":"reefed","past_participle":"reefed"},"noun_plural":"reefings"},"usage_notes":{"explanation":"'Reefing' refers specifically to the act of reducing sail area on a boat. It's a crucial skill for sailors to manage the boat safely in varying wind conditions. The term can be used as both a verb (the act of reefing) and a noun (the process or the mechanism used for reefing).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ We are roofing the sails.","correct":"✓ We are reefing the sails.","note":"'Reefing' (sailing term) is sometimes confused with 'roofing' (related to roofs of buildings)."},{"incorrect":"✗ He is reefing to the sail.","correct":"✓ He is reefing the sail.","note":"'Reef' is a transitive verb, so it takes a direct object (the sail)."}],"priority":"★☆☆"},"related_words":{"derivatives":["reef (noun: part of a sail that can be reefed; a ridge of rock or coral near the surface of the water)","reefer (noun: a sailor who reefs sails; a type of jacket worn by sailors)"],"phrasal_verbs":["reef down (to reduce sail area significantly)","reef in (to bring in a portion of the sail for reefing)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency. Specialized nautical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reefing' is a specialized nautical term referring to the process of reducing the size of a sail on a boat. This is typically done in strong winds to maintain control and prevent damage to the sail or rigging. The word can function as both a verb, describing the action of reducing sail area, and a noun, referring to the process itself. Understanding this term requires familiarity with sailing terminology and practices."},"example_sentences":[{"sentence":"The sailors were busy reefing the sails in preparation for the approaching storm.","translation":"船員たちは近づく嵐に備えて帆を縮める作業に忙しかった。","type":"verb","meaning_category":"To reduce sail area"},{"sentence":"Roller reefing makes it easier to reduce sail area single-handed.","translation":"ローラー縮帆は、一人で帆の面積を減らすのを容易にする。","type":"noun","meaning_category":"The process of reducing sail area"}]}