{"word":"Reventure","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A 2D action-adventure video game developed by Pixelatto.","english_definition":"A 2D action-adventure video game developed by Pixelatto, known for its multiple endings and humorous gameplay.","examples":[{"sentence":"I spent hours playing Reventure, trying to unlock all the endings.","translation":"私は何時間もReventureをプレイして、すべてのエンディングをアンロックしようとしました。"},{"sentence":"Reventure's gameplay is unique because every decision can lead to a different ending.","translation":"Reventureのゲームプレイは、すべての決定が異なるエンディングにつながる可能性があるため、ユニークです。"}],"collocations":["play Reventure","Reventure ending","Reventure gameplay","Reventure review"],"synonyms":["Pixelatto's Reventure"],"antonyms":[]}],"etymology":{"value":"A portmanteau of 're-' (again) and 'adventure', suggesting a repeated or branching adventure.","priority":"★★☆"},"pronunciation":{"ipa":"/riːˈvɛntʃər/","syllables":"re-ven-ture"},"inflection":{},"usage_notes":{"explanation":"'Reventure' is primarily used as a proper noun to refer to the video game. It can also be used more generally to describe a game with similar mechanics (multiple endings based on player choices), but this is less common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to reventure.","correct":"✓ I'm going to play Reventure.","note":"'Reventure' is a noun (the name of the game), not a verb. Use 'play Reventure' to indicate playing the game."}],"priority":"★★☆"},"related_words":{"derivatives":["re-adventure (a similar concept, but not the specific game)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Reventure' is the name of a specific video game. Understanding its meaning requires familiarity with video game culture. The game is known for its branching narrative and multiple endings based on player choices. When discussing video games, 'Reventure' is a specific reference.","priority":"★★★"},"example_sentences":[{"sentence":"Have you tried playing Reventure yet? It's got tons of different endings.","translation":"Reventureをプレイしたことはありますか？たくさんの異なるエンディングがあります。","type":"noun","meaning_category":"Video Game"},{"sentence":"The humor in Reventure is one of its strongest points.","translation":"Reventureのユーモアはその最も強い点の1つです。","type":"noun","meaning_category":"Video Game"}]}