{"word":"graduations","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"卒業式、卒業","english_definition":"The ceremony of conferring degrees or diplomas, as at a college or school; the act of graduating.","examples":[{"sentence":"The graduations will be held in June.","translation":"卒業式は6月に行われます。"},{"sentence":"She attended several graduations this year.","translation":"彼女は今年、いくつかの卒業式に出席しました。"}],"collocations":["attend graduations (卒業式に出席する)","graduations ceremony (卒業式典)","high school graduations (高校の卒業式)","college graduations (大学の卒業式)"],"synonyms":["commencement","graduation ceremony"],"antonyms":[]},{"part_of_speech":"noun","definition":"目盛り、段階","english_definition":"A scale of degrees; a series of marks at regular intervals.","examples":[{"sentence":"The graduations on the thermometer were easy to read.","translation":"温度計の目盛りは読みやすかった。"},{"sentence":"The graduations on the measuring cup help you measure accurately.","translation":"計量カップの目盛りは正確な計量を助けます。"}],"collocations":["thermometer graduations (温度計の目盛り)","measuring cup graduations (計量カップの目盛り)"],"synonyms":["markings","divisions","increments"],"antonyms":[]}],"etymology":{"value":"The word \"graduations\" is derived from the verb \"graduate,\" which comes from the Latin word \"gradus,\" meaning \"step\" or \"degree.\" It originally referred to the steps taken to achieve a degree or diploma.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡrædʒuˈeɪʃənz/","syllables":"grad-u-a-tions"},"inflection":{"noun_plural":"graduations"},"usage_notes":{"explanation":"The word \"graduations\" is the plural form of \"graduation.\" It can refer to multiple graduation ceremonies or to the markings on a scale. When referring to graduation ceremonies, it implies that there are several events taking place. When referring to markings, it implies a series of divisions or increments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to a graduation.","correct":"✓ I am going to a graduation ceremony. / ✓ I am going to graduations.","note":"If you're attending multiple ceremonies, use \"graduations.\" If it's a single event, \"graduation ceremony\" is more specific."},{"incorrect":"✗ The graduation were held in the auditorium.","correct":"✓ The graduations were held in the auditorium.","note":"\"Graduations\" is plural, so use the plural verb \"were.\""}],"priority":"★★☆"},"related_words":{"derivatives":["graduate (verb, noun)","graduated (adjective)","graduation (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"The word \"graduations\" has two main meanings. One meaning refers to the ceremonies where students receive their diplomas or degrees after completing their studies. For example, you might say, \"The graduations are held in June.\" The other meaning refers to the markings on a scale, like on a thermometer or measuring cup. For example, \"The graduations on the thermometer show the temperature.\" It's important to understand the context to know which meaning is intended."},"example_sentences":[{"sentence":"The university holds two graduations each year.","translation":"その大学は毎年2回卒業式を行います。","type":"noun","meaning_category":"卒業式"},{"sentence":"The graduations on the ruler are in centimeters and inches.","translation":"定規の目盛りはセンチメートルとインチで表示されています。","type":"noun","meaning_category":"目盛り"}]}