{"word":"gastrolavage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"胃洗浄","english_definition":"The process of washing out the stomach, typically via a tube inserted through the nose or mouth.","examples":[{"sentence":"Gastrolavage is sometimes used in cases of poisoning to remove ingested toxins.","translation":"胃洗浄は、摂取された毒素を除去するために、中毒の場合に時々使用されます。"},{"sentence":"The doctor recommended gastrolavage to clear the stomach contents.","translation":"医師は胃の内容物を除去するために胃洗浄を推奨しました。"}],"collocations":["perform gastrolavage","undergo gastrolavage","emergency gastrolavage"],"synonyms":["stomach pumping","gastric lavage","lavage"],"antonyms":[]}],"etymology":{"value":"From gastro- (stomach) + lavage (washing).","priority":"★★★"},"pronunciation":{"ipa":"ˌɡæstroʊləˈvɑːʒ","syllables":"gas-tro-la-vage"},"inflection":{"noun_plural":"gastrolavages"},"usage_notes":{"explanation":"Gastrolavage is a medical procedure primarily used to empty the stomach of ingested substances, such as poisons or overdoses of medication. It is less commonly used now due to the availability of other treatments and concerns about its effectiveness and potential complications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a gastrolavage on his leg.","correct":"✓ He had a gastrolavage.","note":"Gastrolavage is specifically a procedure performed on the stomach, not other body parts."}],"priority":"★★☆"},"related_words":{"derivatives":["gastric","lavage"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gastrolavage' is a technical medical term referring to the procedure of washing out the stomach. It's typically encountered in medical contexts or discussions about emergency treatments for poisoning or overdose. Understanding this term requires a familiarity with medical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"Emergency personnel performed a gastrolavage to remove the pills from the patient's stomach.","translation":"救急隊員は、患者の胃から錠剤を除去するために胃洗浄を実施しました。","type":"medical","meaning_category":"胃洗浄"},{"sentence":"Gastrolavage is not always effective and carries certain risks.","translation":"胃洗浄は必ずしも効果的ではなく、特定のリスクを伴います。","type":"medical","meaning_category":"胃洗浄"}]}