{"word":"God-wrought","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"神によって作られた、神の業による","english_definition":"Made or caused by God; divinely created or inspired.","examples":[{"sentence":"The beauty of the sunset seemed God-wrought, a masterpiece of divine artistry.","translation":"夕焼けの美しさは神の業によるかのようで、神聖な芸術の傑作だった。"},{"sentence":"Many believed the healing was God-wrought, a miracle beyond human understanding.","translation":"多くの人々は、その癒しは神の業によるものであり、人間の理解を超えた奇跡だと信じていた。"}],"collocations":["God-wrought miracle (神の業による奇跡)","God-wrought creation (神の業による創造)","God-wrought beauty (神の業による美しさ)"],"synonyms":["divine","heavenly","miraculous","supernatural","divinely inspired"],"antonyms":["man-made","artificial","natural","secular"]}],"etymology":{"value":"'God' + 'wrought'. 'Wrought' is an archaic past participle of 'work', meaning 'worked' or 'fashioned'. Thus, 'God-wrought' literally means 'worked by God' or 'fashioned by God'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɒdˌrɔːt/","syllables":"God-wrought"},"inflection":{"notes":"This word does not inflect, as it is an adjective."},"usage_notes":{"explanation":"'God-wrought' is a relatively rare and somewhat archaic term, primarily used in literary or religious contexts to emphasize the divine origin or nature of something. It suggests that something is not merely natural or man-made, but is the direct result of God's action or creation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The machine was God-wrought.","correct":"✓ The invention was seen as God-wrought by some.","note":"'God-wrought' is typically used to describe things that are seen as inherently divine or miraculous, not everyday objects. It is more fitting for describing natural wonders, spiritual experiences, or events believed to be interventions by God."}],"priority":"★☆☆"},"related_words":{"derivatives":["None - the word itself is a compound of basic elements."],"related_concepts":["divine intervention","creationism","theology","providence"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (too rare to be included in CEFR levels)","frequency_google_ngram":"Extremely low frequency - Primarily found in older literature or religious texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'God-wrought' is a sophisticated and rare term that combines religious and archaic language. It implies a belief in divine creation or intervention and is typically used in formal or literary contexts. Understanding requires familiarity with both religious concepts and the older usage of 'wrought.'"},"example_sentences":[{"sentence":"The stained glass windows of the cathedral were a God-wrought spectacle, illuminating the interior with ethereal light.","translation":"大聖堂のステンドグラスの窓は神の業による光景であり、内部を幽玄な光で照らしていた。","type":"adjective","meaning_category":"神によって作られた"},{"sentence":"The sudden end to the drought was seen by the villagers as a God-wrought blessing.","translation":"干ばつの突然の終わりは、村人たちによって神の業による恵みと見なされた。","type":"adjective","meaning_category":"神の業による"}]}