{"word":"content-oriented","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"コンテンツ重視の、内容重視の","english_definition":"Focused on the content or subject matter rather than other aspects such as style or presentation.","examples":[{"sentence":"The website is content-oriented, providing in-depth information on various topics.","translation":"そのウェブサイトはコンテンツ重視で、様々なトピックに関する詳細な情報を提供しています。"},{"sentence":"A content-oriented approach is crucial for academic writing.","translation":"内容重視のアプローチは学術的な文章において重要です。"},{"sentence":"The course is content-oriented, so expect a lot of reading and research.","translation":"このコースは内容重視なので、たくさんの読書と研究を覚悟してください。"}],"collocations":["content-oriented website","content-oriented marketing","content-oriented approach","content-oriented design","content-oriented strategy"],"synonyms":["information-focused","subject-driven","knowledge-based","substance-oriented"],"antonyms":["style-oriented","design-oriented","presentation-focused"]},{"part_of_speech":"adjective","definition":"(ウェブデザインなどで)コンテンツを中心に設計された","english_definition":"(In web design, etc.) Designed with the primary focus on the content itself.","examples":[{"sentence":"The website has a clean, content-oriented design that makes it easy to find information.","translation":"そのウェブサイトは、情報を見つけやすいように、すっきりとしたコンテンツ重視のデザインになっています。"},{"sentence":"We opted for a content-oriented layout to highlight the quality of our articles.","translation":"記事の質を強調するために、コンテンツ重視のレイアウトを選びました。"}],"collocations":["content-oriented layout","content-oriented design","content-oriented website"],"synonyms":["content-centric","content-focused"],"antonyms":["design-centric","visually-oriented"]}],"etymology":{"value":"Combination of 'content' (the subject matter) and 'oriented' (directed or focused).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈkɒntent ˈɔːrientɪd/","syllables":"con-tent o-ri-ent-ed"},"inflection":{"notes":"Adjectives do not inflect in English, but can be used in comparative and superlative forms (more content-oriented, most content-oriented)."},"usage_notes":{"explanation":"'Content-oriented' describes something that prioritizes the information or subject matter being conveyed. This term is often used in the context of websites, marketing, or education, where the emphasis is on the quality and relevance of the content rather than purely aesthetic or stylistic elements. It implies a focus on providing valuable and informative material to the audience.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The article was very content, oriented.","correct":"✓ The article was very content-oriented.","note":"Hyphenate the term 'content-oriented' when using it as a compound adjective before a noun."},{"incorrect":"✗ The website is content and oriented.","correct":"✓ The website is content-oriented.","note":"'Content-oriented' is a single adjective describing the website's focus."}],"priority":"☆☆☆"},"related_words":{"derivatives":["content (noun, adjective)","orientation (noun)"],"phrases":["content marketing","content strategy","content management system (CMS)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in specialized contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Content-oriented' is a term used to describe something that focuses primarily on the information or subject matter it presents, rather than on its appearance or style. It's often used in contexts like web design, marketing, or education to indicate that the main goal is to provide valuable and informative material. For example, a 'content-oriented website' would prioritize clear and detailed information over flashy graphics or animations."},"example_sentences":[{"sentence":"The company adopted a content-oriented marketing strategy to attract customers.","translation":"その会社は、顧客を引きつけるために、コンテンツ重視のマーケティング戦略を採用しました。","type":"general","meaning_category":"Focus on content"},{"sentence":"The professor's lectures are highly content-oriented, covering a wide range of topics in detail.","translation":"その教授の講義は非常に内容重視で、幅広いトピックを詳細に扱っています。","type":"general","meaning_category":"Focus on content"},{"sentence":"We need a content-oriented approach to redesigning the website.","translation":"ウェブサイトを再設計するには、コンテンツ重視のアプローチが必要です。","type":"design","meaning_category":"Design focus"}]}