{"word":"Casebearer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ミノガ","english_definition":"A moth larva of the family Coleophoridae, that lives in a portable case made from silk and other materials.","examples":[{"sentence":"The casebearer larvae feed on various plants, causing damage to foliage.","translation":"ミノガの幼虫は様々な植物を食べて、葉に被害を与える。"},{"sentence":"The small, mobile cases of casebearers are often seen on the leaves of trees.","translation":"ミノガの小さくて移動可能な巣は、しばしば木の葉の上に見られる。"}],"collocations":["casebearer larva","casebearer moth","control of casebearers","casebearer damage"],"synonyms":["Coleophorid larva"],"antonyms":[]}],"etymology":{"value":"From 'case' (referring to the protective case the larva creates) + 'bearer' (one who carries).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkeɪsˌbe(ə)rər/","syllables":"case-bear-er"},"inflection":{"noun_plural":"casebearers"},"usage_notes":{"explanation":"'Casebearer' refers specifically to the larval stage of moths in the family Coleophoridae. The larvae are known for constructing and carrying a protective case, which they enlarge as they grow. This case is made from silk and various materials found in their environment, such as leaves, twigs, or even sand grains.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a casebearer flying around my garden.","correct":"✓ I saw a casebearer case on the leaves in my garden.","note":"Casebearers are larvae, not adult moths. The case is what is typically observed. Adult casebearer moths are small and less noticeable."},{"incorrect":"✗ Casebearers are beneficial insects.","correct":"✓ Casebearers can be pests in gardens and orchards.","note":"Casebearers can cause damage to plants by feeding on their leaves, so they are generally considered pests."}],"priority":"★★☆"},"related_words":{"derivatives":["case (noun): the protective structure made by the larva","bear (verb): to carry"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'casebearer' is a specialized term used in entomology and horticulture. Understanding it requires knowledge of insect life cycles and plant pests. The word itself is descriptive, but its specific meaning is not commonly known outside of these fields."},"example_sentences":[{"sentence":"The apple orchard was infested with casebearer larvae.","translation":"そのリンゴ園はミノガの幼虫に侵されていた。","type":"general","meaning_category":"pest"},{"sentence":"The casebearer's case was made of small pieces of birch bark.","translation":"そのミノガの巣は白樺の樹皮の小片で作られていた。","type":"general","meaning_category":"description"},{"sentence":"Controlling casebearers is important for maintaining healthy foliage.","translation":"ミノガの防除は、健康な葉を維持するために重要である。","type":"horticulture","meaning_category":"pest control"}]}