{"word":"quadrupeds","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"四足動物","english_definition":"an animal which has four feet","examples":[{"sentence":"Horses, dogs, and cats are all quadrupeds.","translation":"馬、犬、猫はすべて四足動物です。"},{"sentence":"The zoology textbook had a section on quadrupeds.","translation":"その動物学の教科書には四足動物の章があった。"}],"collocations":["mammalian quadrupeds","herbivorous quadrupeds","domestic quadrupeds"],"synonyms":["four-footed animal","tetrapod"],"antonyms":["biped","bird","fish","insect"]}],"etymology":{"value":"From Latin 'quadrupedus', from 'quadru-' (four) + 'ped-' (foot).","priority":"★★☆"},"pronunciation":{"ipa":"ˈkwɒdruːpɛdz","syllables":"quad-ru-peds"},"inflection":{"noun_plural":"quadrupeds"},"usage_notes":{"explanation":"'Quadrupeds' is a formal term, often used in scientific or educational contexts. In everyday conversation, 'four-legged animals' is more common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The quadrupeds are walking on it's four legs.","correct":"✓ The quadrupeds are walking on their four legs.","note":"Quadrupeds is plural, so the possessive pronoun should be 'their'."}],"priority":"★★☆"},"related_words":{"derivatives":["quadrupedal (adjective: using four limbs for locomotion)"],"related_terms":["tetrapod (a more general term including amphibians, reptiles, birds, and mammals with four limbs or descended from four-limbed ancestors)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Quadrupeds' is a relatively formal and technical term used to describe animals that walk on four legs. While the concept is simple, the word itself is not commonly used in everyday conversation. It's more likely to appear in scientific, zoological, or educational contexts. A simpler alternative is 'four-legged animals'. Understanding this word helps in comprehending more complex texts related to animal biology and classification."},"example_sentences":[{"sentence":"The museum exhibit featured various skeletons of extinct quadrupeds.","translation":"その博物館の展示では、絶滅した様々な四足動物の骨格が展示されていた。","type":"general"},{"sentence":"Many mammalian quadrupeds are well-adapted to terrestrial environments.","translation":"多くの哺乳類の四足動物は、陸上環境によく適応している。","type":"scientific"},{"sentence":"The farmer kept several quadrupeds, including cows and horses.","translation":"その農家は牛や馬を含むいくつかの四足動物を飼っていた。","type":"general"}]}