{"word":"pintail","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"オナガガモ","english_definition":"A slender, elegant duck (Anas acuta) with a long, pointed tail, especially the male.","examples":[{"sentence":"The male pintail is easily recognized by its long, graceful tail.","translation":"オスのオナガガモは、長く優雅な尾で簡単に見分けられます。"},{"sentence":"Pintails are migratory birds, traveling long distances each year.","translation":"オナガガモは渡り鳥で、毎年長距離を移動します。"}],"collocations":["northern pintail","duck species","migratory bird","waterfowl"],"synonyms":["Anas acuta"],"antonyms":[]}],"etymology":{"value":"The name \"pintail\" comes from the Old English word \"pinn,\" meaning \"pin,\" and \"tail,\" referring to the male duck's elongated, pointed tail feathers.","priority":"★★☆"},"pronunciation":{"ipa":"ˈpɪnteɪl","syllables":"pin-tail"},"inflection":{"noun_plural":"pintails"},"usage_notes":{"explanation":"The term \"pintail\" is primarily used to refer to the Northern Pintail (Anas acuta), a specific species of duck. It is most often used in ornithology, hunting, and wildlife conservation contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a bird with a long tail, it must be a pintail.","correct":"✓ I saw a duck with a long pointed tail; it might be a pintail.","note":"While a long tail is characteristic, other ducks can have long tails. It must be a duck, and the tail must be distinctively pointed to be a likely pintail."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["mallard","teal","wigeon"],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pintail' refers to a specific type of duck, the Northern Pintail (Anas acuta). The name comes from the long, pointed tail of the male. This word is most likely to be encountered in contexts related to birdwatching, hunting, or wildlife conservation. Understanding this term requires some familiarity with bird identification."},"example_sentences":[{"sentence":"We spotted a pair of pintails feeding in the marsh.","translation":"私たちは湿地で餌を食べているつがいのオナガガモを見つけました。","type":"noun","meaning_category":"bird identification"},{"sentence":"The conservation efforts are aimed at protecting the pintail population.","translation":"保護活動は、オナガガモの個体数を保護することを目的としています。","type":"noun","meaning_category":"wildlife conservation"}]}