{"word":"subpartitioned","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(コンピューター) パーティションをさらに細かく分割する","english_definition":"(computing) To divide a partition into smaller partitions.","examples":[{"sentence":"The hard drive was subpartitioned to better organize the data.","translation":"ハードドライブは、データをより良く整理するために、さらに細かくパーティション分割された。"},{"sentence":"We subpartitioned the database to improve query performance.","translation":"クエリのパフォーマンスを向上させるために、データベースをさらに細かくパーティション分割した。"}],"collocations":["subpartitioned hard drive","subpartitioned database"],"synonyms":["divided","segmented"],"antonyms":["merged","combined"]}],"etymology":{"value":"The word 'subpartitioned' is formed by adding the prefix 'sub-' (meaning 'under' or 'smaller') to the word 'partitioned'. It indicates a further division of an already partitioned entity.","priority":"★★☆"},"pronunciation":{"ipa":"/sʌb.pɑrˈtɪʃənd/","syllables":"sub-par-ti-tioned"},"inflection":{"verb_forms":{"present_simple":["subpartition","subpartitions"],"past_simple":"subpartitioned","past_participle":"subpartitioned","present_participle":"subpartitioning"}},"usage_notes":{"explanation":"'Subpartitioned' is primarily used in the context of computer science, specifically in disk management and database design. It describes the action of dividing an existing partition into smaller, more manageable units. This is often done to improve performance, organization, or security.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cake was subpartitioned among the guests.","correct":"✓ The cake was divided among the guests.","note":"'Subpartitioned' is specific to computer science contexts. For general division, use 'divided'."}],"priority":"★★☆"},"related_words":{"derivatives":["subpartition (noun)","partition (noun, verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'subpartitioned' is a technical term primarily used in computer science. It refers to the act of further dividing an already existing partition, typically in the context of hard drives or databases. Understanding this term requires familiarity with basic computer science concepts. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The system administrator subpartitioned the drive to create separate volumes for different operating systems.","translation":"システム管理者は、異なるオペレーティングシステム用に個別のボリュームを作成するために、ドライブをさらに細かくパーティション分割した。","type":"verb","meaning_category":"computer science"},{"sentence":"A subpartitioned table can improve query performance by allowing the database to access only the relevant data.","translation":"細かくパーティション分割されたテーブルは、データベースが関連データのみにアクセスできるようにすることで、クエリのパフォーマンスを向上させることができる。","type":"adjective","meaning_category":"computer science"}]}