{"word":"wrapping-gown","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"バスローブ、湯上り着","english_definition":"A loose, robe-like garment worn after a bath or shower, or while relaxing at home.","examples":[{"sentence":"She put on her wrapping-gown after her bath.","translation":"彼女はお風呂上がりにバスローブを着た。"},{"sentence":"He likes to wear his wrapping-gown while reading the newspaper.","translation":"彼は新聞を読むときにバスローブを着るのが好きだ。"}],"collocations":["wear a wrapping-gown","put on a wrapping-gown","fluffy wrapping-gown","silk wrapping-gown"],"synonyms":["bathrobe","dressing gown","housecoat","loungewear"],"antonyms":[]}],"etymology":{"value":"The term combines 'wrapping,' referring to the act of wrapping oneself in the garment, and 'gown,' indicating a long, loose robe.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈræpɪŋ ɡaʊn/","syllables":"rap-ping gown"},"inflection":{"noun_plural":"wrapping-gowns"},"usage_notes":{"explanation":"A wrapping-gown is typically made of absorbent material like terrycloth or soft fabrics like silk or cotton. It is designed for comfort and convenience, often worn to dry off after bathing or as a comfortable outer layer while lounging.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I wear a wrapping-gown to sleep.","correct":"✓ I wear pajamas to sleep.","note":"Wrapping-gowns are generally worn after bathing or while relaxing, not typically as sleepwear. Pajamas are more suitable for sleeping."},{"incorrect":"✗ He wore a wrapping-gown to the party.","correct":"✓ He wore a suit to the party.","note":"Wrapping-gowns are casual garments and not appropriate for formal occasions like parties."}],"priority":"★★☆"},"related_words":{"derivatives":["wrap","gown"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"A \"wrapping-gown\" is a type of clothing you wear after taking a bath or shower. It's like a comfortable robe that helps you dry off and keeps you warm. It's not something you usually wear outside; it's more for relaxing at home. Think of it as a cozy cover-up for when you're not quite ready to get dressed. It's often made of soft, absorbent material like terrycloth."},"example_sentences":[{"sentence":"She slipped into her fluffy wrapping-gown after a long, hot bath.","translation":"彼女は長くて熱いお風呂上がりに、ふわふわのバスローブを羽織った。","type":"noun","meaning_category":"バスローブ"},{"sentence":"He enjoys wearing his silk wrapping-gown while sipping his morning coffee.","translation":"彼は朝のコーヒーを飲みながら、シルクのバスローブを着るのを楽しんでいる。","type":"noun","meaning_category":"湯上り着"}]}