{"word":"pengangguran","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"失業、失業状態、失業者数","english_definition":"unemployment; the state of being unemployed; the number of unemployed people.","examples":[{"sentence":"Tingkat pengangguran di negara ini meningkat tajam.","translation":"この国の失業率は急激に増加している。","note":"The unemployment rate in this country is increasing sharply."},{"sentence":"Pemerintah berupaya mengatasi masalah pengangguran.","translation":"政府は失業問題の解決に取り組んでいる。","note":"The government is trying to solve the unemployment problem."},{"sentence":"Banyak lulusan baru menghadapi kesulitan mencari pekerjaan karena pengangguran.","translation":"多くの新卒者は失業のため、仕事を見つけるのに苦労している。","note":"Many new graduates face difficulties finding jobs because of unemployment."}],"collocations":["tingkat pengangguran (失業率)","masalah pengangguran (失業問題)","mengatasi pengangguran (失業を克服する)","angka pengangguran (失業率)","penyebab pengangguran (失業の原因)"],"synonyms":["ketidakkerjaan (よりフォーマルな表現)"],"antonyms":["pekerjaan (仕事)","keterpekerjaan (雇用)"],"related_words":["menganggur (失業している、動詞)","penganggur (失業者、人)"]}],"etymology":{"value":"Derived from the verb 'menganggur' (to be unemployed, to be idle), which in turn comes from 'anggur' (idle, free). The prefix 'pe(ng)-' is added to form a noun indicating a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/pə.ŋaŋ.ɡʊ.ran/","syllables":"pe-ngang-gu-ran"},"inflection":{"notes":"This is a noun, so it does not inflect for tense or person. The plural is typically indicated by context or repetition (e.g., 'pengangguran-pengangguran' although this is less common)."},"usage_notes":{"explanation":"'Pengangguran' refers to the general condition or phenomenon of unemployment. It can also refer to the number or percentage of people who are unemployed. It is a common term used in economics, politics, and social discussions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Saya adalah pengangguran.","correct":"Saya seorang penganggur.","note":"'Saya adalah pengangguran' is grammatically correct but less common. 'Saya seorang penganggur' (I am an unemployed person) is more natural when referring to oneself as an unemployed individual."},{"incorrect":"Pengangguran itu baik.","correct":"Pengangguran itu buruk.","note":"'Pengangguran itu baik' (Unemployment is good) is logically incorrect in most contexts. Unemployment is generally considered a negative economic and social issue."}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"High frequency in Indonesian texts related to economics and social issues.","priority":"★★☆"},"readability_explanation":{"level":"B1","text":"'Pengangguran' is a common word in Indonesian that refers to unemployment. It's used to talk about the state of being without a job, or the number of people who don't have jobs. You'll often see it in news articles or discussions about the economy.","priority":"★★★"},"example_sentences":[{"sentence":"Peningkatan pengangguran dapat menyebabkan masalah sosial.","translation":"An increase in unemployment can lead to social problems.","type":"general","meaning_category":"Unemployment as a problem"},{"sentence":"Pemerintah sedang mencari solusi untuk mengurangi pengangguran.","translation":"The government is looking for solutions to reduce unemployment.","type":"government","meaning_category":"Government efforts"},{"sentence":"Pengangguran di kalangan pemuda adalah perhatian utama.","translation":"Unemployment among young people is a major concern.","type":"youth","meaning_category":"Unemployment among youth"}]}