{"word":"antiholiday","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"祝日・休日を批判的に捉える立場、または祝日・休日を避ける行動","english_definition":"An attitude or action that opposes or avoids holidays, often due to commercialization, stress, or personal reasons.","examples":[{"sentence":"Some people adopt an antiholiday stance, refusing to participate in the commercial aspects of Christmas.","translation":"クリスマスを商業的な側面から拒否し、祝日を批判的に捉える人もいる。"},{"sentence":"Her antiholiday sentiment stemmed from bad childhood experiences.","translation":"彼女の祝日嫌いは、幼少期の悪い経験から来ている。"},{"sentence":"They planned an antiholiday getaway, choosing a remote location far from any celebrations.","translation":"彼らは祝日を避ける旅行を計画し、お祝いから遠く離れた人里離れた場所を選んだ。"}],"collocations":["adopt an antiholiday stance","antiholiday sentiment","antiholiday getaway","antiholiday philosophy","embrace antiholiday","antiholiday attitude"],"synonyms":["holiday aversion","holiday avoidance","holiday skepticism"],"antonyms":["holiday spirit","holiday cheer","holiday enthusiasm"]},{"part_of_speech":"adjective","definition":"祝日・休日を批判的に捉える、または祝日・休日を避ける","english_definition":"Characterized by opposition to or avoidance of holidays.","examples":[{"sentence":"The movie had an antiholiday theme, focusing on the stress and expectations surrounding Christmas.","translation":"その映画は、クリスマスのプレッシャーと期待に焦点を当てた、祝日を批判的に捉えるテーマを持っていた。"},{"sentence":"They decorated their house with antiholiday decorations, such as black Christmas trees.","translation":"彼らは黒いクリスマスツリーなど、祝日を批判的に捉えた装飾で家を飾った。"},{"sentence":"The store promoted an antiholiday sale, offering discounts on items unrelated to traditional holiday gifts.","translation":"その店は、伝統的なホリデーギフトとは関係のない商品の割引を提供する、祝日を避けるセールを宣伝した。"}],"collocations":["antiholiday theme","antiholiday decorations","antiholiday sale","antiholiday message","antiholiday campaign","antiholiday event"],"synonyms":["holiday-opposing","holiday-avoiding","holiday-critical"],"antonyms":["holiday-themed","holiday-related","holiday-celebratory"]}],"etymology":{"value":"The word is formed by combining the prefix 'anti-' (meaning against or opposed to) with the word 'holiday'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈhɑlədeɪ/","syllables":"an-ti-hol-i-day"},"inflection":{"noun_plural":"antiholidays"},"usage_notes":{"explanation":"'Antiholiday' refers to a critical or avoidant stance towards holidays, often due to the commercialization, stress, or forced cheer associated with them. It can describe a personal philosophy, specific actions taken to avoid holiday celebrations, or themes in media that critique holiday traditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm very antiholiday because I love holidays.","correct":"✓ I'm very antiholiday because I dislike the commercialism of holidays.","note":"'Antiholiday' implies a negative or critical view of holidays, so it's contradictory to say you are antiholiday because you love holidays. Instead, clarify the reason for your antiholiday stance, such as disliking the commercial aspects. "},{"incorrect":"✗ She has an antiholiday spirit.","correct":"✓ She has an antiholiday attitude.","note":"'Spirit' is usually associated with positive feelings, especially during holidays. Use 'attitude' or 'sentiment' to describe a negative or critical view of holidays."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["commercialization of holidays","holiday stress","holiday blues","Grinch (character who hates Christmas)","alternative celebrations","minimalism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antiholiday' is a relatively uncommon word that describes an attitude or behavior that opposes or avoids holidays. This opposition often stems from a dislike of the commercialization, stress, or forced cheer associated with holidays. The word can be used as both a noun and an adjective. Understanding the prefix 'anti-' (meaning against) is helpful in deciphering the word's meaning."},"example_sentences":[{"sentence":"The book explores the reasons behind the growing antiholiday sentiment in modern society.","translation":"その本は、現代社会における祝日を批判的に捉える感情が高まっている背景にある理由を探求している。","type":"noun","meaning_category":"祝日・休日を批判的に捉える立場"},{"sentence":"The company launched an antiholiday marketing campaign, appealing to consumers who reject traditional holiday spending.","translation":"その会社は、伝統的な祝日の出費を拒否する消費者にアピールする、祝日を避けるマーケティングキャンペーンを開始した。","type":"adjective","meaning_category":"祝日・休日を批判的に捉える"}]}