{"word":"Caffeism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カフェイン中毒、カフェイン過剰摂取","english_definition":"A condition resulting from excessive caffeine intake, characterized by symptoms such as anxiety, insomnia, rapid heartbeat, and digestive issues.","examples":[{"sentence":"He was experiencing caffeism after drinking too many energy drinks.","translation":"彼はエナジードリンクを飲みすぎたため、カフェイン中毒の症状が出ていた。"},{"sentence":"Symptoms of caffeism can include nervousness and difficulty concentrating.","translation":"カフェイン中毒の症状には、神経過敏や集中困難などが含まれる。"}],"collocations":["caffeism symptoms (カフェイン中毒の症状)","mild caffeism (軽度のカフェイン中毒)","severe caffeism (重度のカフェイン中毒)","caffeism treatment (カフェイン中毒の治療)"],"synonyms":["caffeine intoxication","caffeine overdose","caffeine-induced anxiety"],"antonyms":["caffeine withdrawal","caffeine deficiency"]}],"etymology":{"value":"Derived from 'caffeine' (the stimulant found in coffee, tea, etc.) and '-ism' (a suffix indicating a condition or state).","priority":"★★☆"},"pronunciation":{"ipa":"ˈkæfiˌɪzəm","syllables":"caf-fe-ism"},"inflection":{"noun_plural":"caffeisms"},"usage_notes":{"explanation":"'Caffeism' refers specifically to the negative physiological and psychological effects caused by consuming too much caffeine. It is more formal and clinical than simply saying someone is 'over-caffeinated'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have caffeism because I like coffee.","correct":"✓ I have caffeism because I drink too much coffee.","note":"Caffeism is a condition caused by *excessive* caffeine intake, not simply liking or consuming coffee in moderation."},{"incorrect":"✗ Caffeism is cured by drinking more coffee.","correct":"✓ Caffeism is treated by reducing or eliminating caffeine intake.","note":"Caffeism is treated by *reducing* caffeine, not increasing it."}],"priority":"★★☆"},"related_words":{"derivatives":["caffeinated (adjective: containing caffeine)","decaffeinated (adjective: having caffeine removed)"],"phrases":["caffeine withdrawal (カフェイン離脱症状)","caffeine dependence (カフェイン依存症)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Caffeism' is a relatively uncommon and technical term referring to a condition caused by excessive caffeine consumption. It's used in medical or health-related contexts to describe the symptoms and effects of caffeine overdose. Understanding the term implies a knowledge of the effects of caffeine and related health vocabulary."},"example_sentences":[{"sentence":"She suspected she had caffeism due to her constant jitters and insomnia.","translation":"彼女は絶え間ない震えと不眠のため、カフェイン中毒ではないかと疑った。","type":"noun","meaning_category":"カフェイン中毒"},{"sentence":"Doctors warned about the dangers of caffeism, especially among young people consuming energy drinks.","translation":"医師たちは、特にエナジードリンクを摂取する若者の間で、カフェイン中毒の危険性について警告した。","type":"noun","meaning_category":"カフェイン中毒"},{"sentence":"Reducing caffeine intake is the best way to alleviate the symptoms of caffeism.","translation":"カフェインの摂取量を減らすことが、カフェイン中毒の症状を緩和する最良の方法である。","type":"noun","meaning_category":"カフェイン中毒"}]}