{"word":"Biblism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"聖書至上主義、聖書原理主義","english_definition":"The belief that the Bible is the literal word of God and is inerrant in all matters of faith and practice.","examples":[{"sentence":"Biblism is often associated with a conservative approach to interpreting scripture.","translation":"聖書至上主義は、聖書の解釈に対する保守的なアプローチと関連付けられることが多いです。"},{"sentence":"Critics argue that biblism can lead to a rigid and inflexible worldview.","translation":"批判者たちは、聖書至上主義が硬直的で柔軟性のない世界観につながる可能性があると主張しています。"}],"collocations":["strict biblism","fundamentalist biblism","literal biblism"],"synonyms":["scriptural literalism","fundamentalism","scripturalism"],"antonyms":["liberal theology","higher criticism","historical criticism"]}],"etymology":{"value":"From 'Bible' + '-ism'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbɪblɪzəm/","syllables":"Bib-lism"},"inflection":{"noun_plural":"Biblisms"},"usage_notes":{"explanation":"'Biblism' refers to the belief that the Bible is the literal and inerrant word of God. It is often used in discussions about religious interpretation and can carry connotations of rigidity or fundamentalism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices Biblism by reading other religious texts.","correct":"✓ He practices Biblism by strictly adhering to the Bible.","note":"Biblism involves strict adherence to the Bible, not exploring other religious texts."},{"incorrect":"✗ Biblism is about understanding the historical context of the Bible.","correct":"✓ Biblism is about believing the Bible is literally true.","note":"Biblism focuses on the literal truth of the Bible, not its historical context."}],"priority":"★★☆"},"related_words":{"derivatives":["Biblical (adjective)","Biblicist (noun)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Biblism' is a term used in religious studies and theology to describe the belief that the Bible is the literal word of God and is without error. It is often discussed in the context of different approaches to interpreting scripture, and it can be associated with conservative or fundamentalist viewpoints. Understanding this term requires familiarity with religious and theological concepts."},"example_sentences":[{"sentence":"The professor discussed the different interpretations of scripture, including biblism and historical criticism.","translation":"教授は、聖書至上主義や歴史的批判を含む、聖書のさまざまな解釈について議論しました。","type":"general","meaning_category":"Definition"},{"sentence":"Some argue that biblism can lead to a narrow understanding of faith.","translation":"聖書至上主義は、信仰の狭い理解につながる可能性があると主張する人もいます。","type":"general","meaning_category":"Definition"}]}