{"word":"sun-centered","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"太陽中心の、太陽を中心とする","english_definition":"having the sun as the center","examples":[{"sentence":"The sun-centered model of the solar system replaced the earth-centered model.","translation":"太陽系における太陽中心モデルは、地球中心モデルに取って代わった。"},{"sentence":"Copernicus proposed a sun-centered theory.","translation":"コペルニクスは太陽中心説を提唱した。"}],"collocations":["sun-centered model","sun-centered theory","sun-centered system"],"synonyms":["heliocentric"],"antonyms":["earth-centered","geocentric"]}],"etymology":{"value":"'Sun' + 'centered'.  Refers to the astronomical model where the sun, rather than the earth, is at the center of the solar system or universe.","priority":"★★★"},"pronunciation":{"ipa":"ˈsʌnˌsentərd","syllables":"sun-cen-tered"},"inflection":{},"usage_notes":{"explanation":"The term 'sun-centered' is most commonly used in the context of astronomy and historical scientific theories. It describes a model where the sun is at the center, as opposed to the older geocentric (earth-centered) model. It's often used when discussing the shift in scientific understanding brought about by figures like Copernicus and Galileo.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The universe is sun-centered now.","correct":"✓ Our solar system is sun-centered.","note":"While we now know our solar system is sun-centered, the universe itself does not have a single center."}],"priority":"★★☆"},"related_words":{"derivatives":["heliocentricity (太陽中心説)"],"related_terms":["solar system","Copernicus","Galileo","astronomy","geocentric","earth-centered"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific or historical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'sun-centered' is a specialized term primarily used in the context of astronomy and the history of science. It refers to the model of the solar system (or universe) where the sun, rather than the earth, is at the center. Understanding this term requires some familiarity with scientific concepts and historical context. It is not a commonly used term in everyday conversation."},"example_sentences":[{"sentence":"The transition to a sun-centered view of the universe was a major shift in scientific thinking.","translation":"宇宙に対する太陽中心的な見方への移行は、科学的思考における大きな転換期だった。","type":"general","meaning_category":"general"},{"sentence":"Early astronomers struggled to reconcile observations with the sun-centered model.","translation":"初期の天文学者たちは、観測結果と太陽中心モデルとを調和させるのに苦労した。","type":"scientific","meaning_category":"scientific"},{"sentence":"The acceptance of the sun-centered system faced resistance from religious authorities.","translation":"太陽中心系の受け入れは、宗教当局からの抵抗に直面した。","type":"historical","meaning_category":"historical"}]}