{"word":"astragalus","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"キバナオウギ属の植物、ゲンゲ属の植物","english_definition":"a large genus of about 3,000 species of herbs and small shrubs, belonging to the legume family (Fabaceae) and native to temperate regions of the Northern Hemisphere. Some species are used in traditional medicine.","examples":[{"sentence":"Astragalus is used in traditional Chinese medicine.","translation":"キバナオウギは伝統的な中国医学で用いられています。"},{"sentence":"Some species of Astragalus are poisonous to livestock.","translation":"キバナオウギ属の植物の中には家畜にとって有毒な種もあります。"}],"collocations":["Astragalus root (キバナオウギの根)","Astragalus membranaceus (キバナオウギ)","Astragalus extract (キバナオウギ抽出物)"],"synonyms":["milk-vetch","locoweed"],"antonyms":[]},{"part_of_speech":"noun","definition":"距骨 (きょこつ)","english_definition":"the talus bone in the ankle.","examples":[{"sentence":"The astragalus articulates with the tibia and fibula.","translation":"距骨は脛骨および腓骨と関節しています。"},{"sentence":"He fractured his astragalus in the fall.","translation":"彼は転倒で距骨を骨折しました。"}],"collocations":["fractured astragalus (距骨骨折)"],"synonyms":["talus"],"antonyms":[]}],"etymology":{"value":"From Latin astragalus, from Ancient Greek ἀστράγαλος (astrágalos, “anklebone, vertebra; a plant of the pea family”). The botanical sense is probably due to the shape of the seed pods of some species.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈstræɡələs/","syllables":"as-trag-a-lus"},"inflection":{"noun_plural":"astragaluses or astragali"},"usage_notes":{"explanation":"The word \"astragalus\" has two distinct meanings: one referring to a genus of plants, and the other referring to the talus bone in the ankle. The context usually makes it clear which meaning is intended. When referring to the plant, it's often used in discussions of traditional medicine or botany. When referring to the bone, it's typically found in medical or anatomical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I took astragalus for my ankle pain.","correct":"✓ I took astragalus extract for my immune system. / ✓ I injured my astragalus.","note":"Make sure to use \"astragalus\" in the correct context. If you're talking about ankle pain, you likely mean you injured your astragalus bone. If you're talking about taking it as a supplement, you're referring to the plant extract. Be specific to avoid confusion."}],"priority":"★★☆"},"related_words":{"derivatives":["astragalar (adjective: relating to the astragalus bone)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"astragalus\" is a technical term that can refer to either a genus of plants or a specific bone in the ankle. The plant-related meaning is often encountered in discussions of herbal medicine or botany, while the bone-related meaning is found in medical or anatomical contexts. Due to its specialized nature and dual meanings, it's considered a more advanced vocabulary word.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor examined the X-ray to check for fractures in the **astragalus**.","translation":"医師はX線写真を調べて、距骨の骨折がないか確認しました。","type":"noun","meaning_category":"距骨"},{"sentence":"**Astragalus** is known for its immune-boosting properties in traditional medicine.","translation":"キバナオウギは伝統医学において免疫力を高める特性で知られています。","type":"noun","meaning_category":"キバナオウギ属の植物"}]}