{"word":"forewarns","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)に(危険など)を事前に警告する、前もって注意する","english_definition":"to warn (someone) in advance about an impending danger or problem.","examples":[{"sentence":"The weather forecast forewarns us of a severe storm.","translation":"天気予報は私たちにひどい嵐が来ることを事前に警告している。"},{"sentence":"I tried to forewarn him about the risks, but he wouldn't listen.","translation":"私は彼に危険について前もって警告しようとしたが、彼は聞こうとしなかった。"},{"sentence":"She forewarned her friend about the potential problems with the new job.","translation":"彼女は友人に新しい仕事の潜在的な問題について前もって注意した。"}],"collocations":["forewarn someone of something","forewarn someone about something","forewarn of danger","forewarn of risks","forewarn of consequences"],"synonyms":["warn","alert","caution","advise","notify","apprise"],"antonyms":["surprise","ambush","deceive","mislead"]}],"etymology":{"value":"\"Fore-\" (before) + \"warn\" (to give notice of danger).","priority":"★★☆"},"pronunciation":{"ipa":"/fɔːrˈwɔːrnz/","syllables":"fore-warns"},"inflection":{"verb_forms":{"present_simple":["forewarns"],"past_simple":"forewarned","past_participle":"forewarned","present_participle":"forewarning"}},"usage_notes":{"explanation":"\"Forewarn\" means to warn someone about something before it happens, especially something dangerous or unpleasant. It implies giving advance notice so that the person can prepare or take action to avoid the potential problem. It is often used in formal or serious contexts. The verb \"forewarns\" is the third-person singular simple present indicative form of \"forewarn.\"","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He forewarned to me about the danger.","correct":"✓ He forewarned me about the danger.","note":"The correct structure is \"forewarn someone about something\" or \"forewarn someone of something.\" The preposition \"to\" is not used directly after \"forewarn.\""},{"incorrect":"✗ She forewarned of the storm will come.","correct":"✓ She forewarned that the storm would come. / ✓ She forewarned us of the coming storm.","note":"When followed by a clause, use \"that.\" Alternatively, use \"of\" followed by a noun phrase."}],"priority":"★★☆"},"related_words":{"derivatives":["forewarning (noun: a warning given in advance)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"forewarns\" is a relatively formal and infrequent word. It means to warn someone about something before it happens. Because it is not commonly used in everyday conversation, it is more likely to be encountered in written texts, such as news articles, reports, or literature. Understanding this word is useful for comprehending more complex and formal English texts."},"example_sentences":[{"sentence":"The doctor forewarns the patient of potential side effects from the medication.","translation":"医師は患者に薬の潜在的な副作用について事前に警告する。","type":"verb","meaning_category":"事前に警告する"},{"sentence":"The intelligence agency forewarns the government of possible terrorist attacks.","translation":"諜報機関は政府に起こりうるテロ攻撃について前もって警告する。","type":"verb","meaning_category":"前もって注意する"},{"sentence":"The guide forewarns hikers of the dangers of the mountain trail.","translation":"ガイドはハイカーに登山道の危険について事前に警告する。","type":"verb","meaning_category":"事前に警告する"}]}