{"word":"dromical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Relating to or exhibiting dromomania.","english_definition":"Relating to or exhibiting dromomania.","examples":[{"sentence":"The patient exhibited dromical tendencies, frequently expressing a desire to wander.","translation":"その患者は放浪癖の傾向を示し、頻繁に放浪願望を表明した。"}],"collocations":["dromical behavior","dromical tendencies"],"synonyms":["wandering","roaming","nomadic"],"antonyms":["sedentary","stationary"]}],"etymology":{"value":"Derived from 'dromomania', a historical term for an uncontrollable urge to wander.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdrɒmɪkəl/","syllables":"drom-i-cal"},"inflection":{"adjective_forms":{"comparative":"more dromical","superlative":"most dromical"}},"usage_notes":{"explanation":"'Dromical' is a relatively rare adjective used to describe something related to dromomania, an outdated term for an excessive urge to wander. It is more commonly used in medical or psychological contexts when discussing historical cases or conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dromical weather made me want to stay inside.","correct":"✓ The stormy weather made me want to stay inside.","note":"'Dromical' refers to a psychological urge to wander, not weather conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["dromomania (noun: an excessive urge to wander)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dromical' is a rare and specialized term, primarily used in historical or psychological contexts to describe something related to dromomania, an outdated term for an uncontrollable urge to wander. Due to its limited usage, it is not commonly encountered in general English. Understanding the term requires familiarity with the historical concept of dromomania."},"example_sentences":[{"sentence":"His dromical impulses led him to travel the world.","translation":"彼の放浪癖が彼を世界旅行へと導いた。","type":"adjective","meaning_category":"Relating to dromomania"},{"sentence":"The doctor noted the patient's dromical behavior during the assessment.","translation":"医師は評価中に患者の放浪癖の行動に注目した。","type":"adjective","meaning_category":"Exhibiting dromomania"}]}