{"word":"anathematically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"呪いをもって、破門をもって、激しく非難して","english_definition":"In a manner involving or expressing a strong curse or condemnation; in a way that relates to or involves an anathema.","examples":[{"sentence":"The politician was anathematically denounced by his opponents.","translation":"その政治家は、対立者によって激しく非難された。"},{"sentence":"The heretical teachings were anathematically rejected by the church.","translation":"その異端の教えは、教会によって破門をもって拒否された。"}],"collocations":["anathematically denounce","anathematically reject","anathematically condemn"],"synonyms":["cursingly","damningly","execrably","abominably"],"antonyms":["approvingly","favorably","laudably"]}],"etymology":{"value":"Derived from 'anathema' (something or someone vehemently disliked or cursed) + '-tically' (forming adverbs). 'Anathema' comes from Late Latin, from Greek 'anathēma' (something dedicated, especially to evil; something accursed), from 'anatithenai' (to set up, dedicate).","priority":"★★☆"},"pronunciation":{"ipa":"/əˌnæθəˈmætɪkli/","syllables":"a-nath-e-mat-i-cal-ly"},"inflection":{"notes":"Adverb; does not inflect."},"usage_notes":{"explanation":"'Anathematically' is used to describe actions or statements done with strong condemnation or as if placing a curse. It implies a vehement rejection or denunciation. It is a relatively rare word, more often found in formal or literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke anathematicly about the proposal.","correct":"✓ He spoke anathematically about the proposal.","note":"Correct spelling is 'anathematically', not 'anathematicly'."}],"priority":"★★☆"},"related_words":{"derivatives":["anathema (noun: a strong curse; something intensely disliked)","anathematize (verb: to curse; to denounce vehemently)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Anathematically' is an advanced word that means 'in a manner of strong condemnation or cursing.' It is not commonly used in everyday language and is typically found in formal writing or speech where the speaker wants to emphasize intense disapproval or rejection. Understanding the root word 'anathema' (something or someone intensely disliked or cursed) is helpful in grasping the meaning of 'anathematically'."},"example_sentences":[{"sentence":"The proposed changes were anathematically opposed by the traditionalists.","translation":"提案された変更は、伝統主義者によって激しく反対された。","type":"general","meaning_category":"strong condemnation"},{"sentence":"The dictator's policies were anathematically condemned by the international community.","translation":"その独裁者の政策は、国際社会によって激しく非難された。","type":"political","meaning_category":"political condemnation"}]}