{"word":"Sicanian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"シカニア人：古代シチリアに居住していた民族","english_definition":"An ancient people who inhabited Sicily, believed to be one of the earliest inhabitants of the island.","examples":[{"sentence":"The Sicanians were eventually displaced by other groups, including the Sicels and Greeks.","translation":"シカニア人は最終的に、シケル人やギリシャ人を含む他の集団によって追いやられた。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"シカニア人の、シカニア人に関する","english_definition":"Relating to the Sicanians.","examples":[{"sentence":"Sicanian artifacts have been found in various archaeological sites across Sicily.","translation":"シカニア人の遺物は、シチリア各地の様々な遺跡で発見されている。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin Sicani, from Ancient Greek Sikanói (Σικανοί).","priority":"★★★"},"pronunciation":{"ipa":"/sɪˈkeɪniən/","syllables":"Si-ca-ni-an"},"inflection":{},"usage_notes":{"explanation":"The Sicanians are considered one of the three indigenous peoples of Sicily before the arrival of the Greeks. Their origins are debated, with some theories suggesting they migrated from the Iberian Peninsula.","priority":"★★☆"},"common_mistakes":{},"related_words":["Sicel","Sicilian","Elymians"],"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'Sicanian' refers to an ancient people of Sicily, a topic typically encountered in historical or archaeological contexts. Understanding requires familiarity with ancient history and the various peoples who inhabited Sicily.","priority":"★☆☆"},"example_sentences":[{"sentence":"Archaeological evidence suggests that the Sicanian culture flourished in Sicily during the Bronze Age.","translation":"考古学的証拠は、シカニア文化が青銅器時代にシチリアで栄えたことを示唆している。","type":"adjective","meaning_category":"シカニア人の"},{"sentence":"The Sicanians left behind a rich legacy of art and architecture.","translation":"シカニア人は、芸術と建築の豊かな遺産を残した。","type":"noun","meaning_category":"シカニア人"}]}