{"word":"sensile","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"感覚のある、知覚力のある","english_definition":"Capable of feeling or sensation; having the faculty of sense or perception.","examples":[{"sentence":"The plant's sensile leaves closed when touched.","translation":"その植物の感覚のある葉は触れると閉じた。"},{"sentence":"All animals are sensile beings.","translation":"全ての動物は感覚のある存在である。"}],"collocations":["sensile leaf","sensile organism"],"synonyms":["sensitive","perceptive","sentient","conscious"],"antonyms":["insensate","insensitive","unfeeling","unconscious"]}],"etymology":{"value":"From Latin *sensibilis* (perceptible by the senses), from *sensus* (sense).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛnsaɪl/","syllables":"sen-sile"},"inflection":{"notes":"Comparative and superlative forms (more sensile, most sensile) are possible but rare."},"usage_notes":{"explanation":"'Sensile' is a relatively uncommon word, primarily used in scientific or technical contexts to describe something that is capable of sensation or perception. It is often used in biology to describe organisms or parts of organisms that respond to stimuli.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was sensile to the earthquake.","correct":"✓ The building was sensitive to the earthquake.","note":"'Sensile' refers to the ability to feel or perceive, while 'sensitive' can also refer to being easily affected or responsive to something. In this context, 'sensitive' is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["sensibility (名詞: 感覚、感受性)","sense (名詞: 感覚)","sensory (形容詞: 感覚の)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sensile' is a rare and technical word, primarily encountered in scientific or philosophical texts. It describes the capacity for sensation or feeling. Due to its infrequent use, it is not typically part of general vocabulary and is more likely to be understood by those with advanced knowledge in specific fields."},"example_sentences":[{"sentence":"The experiment aimed to determine how the sensile neurons reacted to different stimuli.","translation":"その実験は、感覚ニューロンが異なる刺激にどのように反応するかを決定することを目的とした。","type":"adjective","meaning_category":"感覚のある"},{"sentence":"The researcher studied the sensile properties of the plant's root system.","translation":"研究者は、その植物の根系の感覚特性を研究した。","type":"adjective","meaning_category":"知覚力のある"}]}