{"word":"quadridentate","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(化学)四座配位子の、４つの原子で金属イオンに配位する","english_definition":"(chemistry) (of a ligand) having four atoms that coordinate to a central metal ion.","examples":[{"sentence":"Ethylenediaminetetraacetic acid (EDTA) is a common quadridentate ligand.","translation":"エチレンジアミン四酢酸(EDTA)は一般的な四座配位子です。"}],"collocations":["quadridentate ligand (四座配位子)"],"synonyms":["tetradentate"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin words 'quadri-' (meaning 'four') and 'dentate' (meaning 'toothed' or 'having teeth'), referring to the four 'teeth' or points of attachment to a metal ion.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkwɒdrɪˈdɛnteɪt/","syllables":"quad-ri-den-tate"},"inflection":{"notes":"Does not inflect, as it is an adjective."},"usage_notes":{"explanation":"In chemistry, a quadridentate ligand is a molecule or ion that binds to a central metal atom through four atoms. These four atoms are electron donors, forming coordinate bonds with the metal. Quadridentate ligands are important in coordination chemistry and are used in various applications, including catalysis and metal extraction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The quadridentate ligand has three binding sites.","correct":"✓ The quadridentate ligand has four binding sites.","note":"Quadridentate ligands, by definition, have four binding sites."}],"priority":"★☆☆"},"related_words":{"derivatives":["ligand","coordination complex","chelate"],"related_terms":["bidentate","tridentate","pentadentate","hexadentate"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized chemical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Quadridentate' is a specialized term used in chemistry, specifically in the field of coordination chemistry. It describes a type of ligand that can bind to a central metal ion through four points of attachment. Understanding this term requires a background in chemistry, particularly knowledge of ligands, coordination complexes, and bonding. The term is not commonly encountered outside of technical or academic contexts related to chemistry."},"example_sentences":[{"sentence":"The quadridentate ligand coordinates strongly to the metal center.","translation":"その四座配位子は金属中心に強く配位する。","type":"general","meaning_category":"General"},{"sentence":"This complex utilizes a quadridentate Schiff base ligand.","translation":"この錯体は四座のシッフ塩基配位子を利用している。","type":"specific","meaning_category":"Specific example"}]}