{"word":"Pluckerian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(数学)プリュッカー座標に関する、またはプリュッカー座標を用いる","english_definition":"Relating to or using Plücker coordinates (a way of representing lines in projective space).","examples":[{"sentence":"The Pluckerian embedding maps the Grassmannian into projective space.","translation":"プリュッカー埋め込みはグラスマン多様体を射影空間に写像する。"}],"collocations":["Pluckerian coordinates","Pluckerian embedding","Pluckerian relations"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Julius Plücker, a 19th-century German mathematician who developed Plücker coordinates.","priority":"★★★"},"pronunciation":{"ipa":"/plʊˈkɪəriən/","syllables":"pluck-er-i-an"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'Pluckerian' is highly specialized and primarily used within the field of mathematics, specifically in projective geometry and related areas. It refers to concepts, methods, or objects associated with Plücker coordinates, which provide a way to represent lines and higher-dimensional subspaces in projective spaces. The term is rarely encountered outside of mathematical contexts.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Plücker coordinates","Plücker matrix","Plücker relation"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Pluckerian' is a highly technical term used in advanced mathematics, particularly in projective geometry. Understanding it requires familiarity with concepts such as projective space, Grassmannians, and coordinate systems. It is unlikely to be encountered outside of specialized mathematical literature or discussions.","priority":"★★★"},"example_sentences":[{"sentence":"The Pluckerian relations provide necessary and sufficient conditions for a set of numbers to be the Plucker coordinates of a line.","translation":"プリュッカー関係は、ある数の集合が直線のプリュッカー座標であるための必要十分条件を与える。","type":"adjective","meaning_category":"数学"}]}