{"word":"unsubduedly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"抑制されずに、征服されずに、屈することなく","english_definition":"In an unsubdued manner; without being subdued, conquered, or restrained.","examples":[{"sentence":"She spoke unsubduedly, her voice ringing with defiance.","translation":"彼女は抑制されずに話し、その声は反抗に満ちていた。"},{"sentence":"The forest grew unsubduedly, a testament to nature's power.","translation":"その森は征服されることなく生い茂り、自然の力を証明していた。"},{"sentence":"He lived unsubduedly, refusing to conform to societal expectations.","translation":"彼は屈することなく生き、社会の期待に従うことを拒んだ。"}],"collocations":["speak unsubduedly","grow unsubduedly","live unsubduedly"],"synonyms":["unrestrainedly","unconqueredly","unyieldingly","defiantly","boldly","freely"],"antonyms":["subduedly","restrainedly","conqueredly","yieldingly","meekly","timidly"]}],"etymology":{"value":"Derived from the adjective 'unsubdued' (not subdued, conquered, or restrained) with the addition of the adverbial suffix '-ly'. 'Unsubdued' is formed by the prefix 'un-' (not) and the past participle 'subdued' of the verb 'subdue' (to conquer, restrain).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnsəbˈdjuːɪdli/","syllables":"un-sub-du-ed-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Unsubduedly' describes an action or state that is characterized by a lack of restraint, control, or subjugation. It suggests a sense of freedom, defiance, or natural power. The word is relatively uncommon and often used in literary or descriptive contexts to emphasize the unrestrained or unconquered nature of something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unsubduedly the enemy.","correct":"✓ He unsubdued the enemy.","note":"'Unsubduedly' is an adverb, so it modifies verbs, adjectives, or other adverbs. 'Unsubdued' can be used as a verb, but it's not standard usage. It's better to use 'did not subdue'."},{"incorrect":"✗ The unsubduedly spirit.","correct":"✓ The unsubdued spirit.","note":"'Unsubduedly' is an adverb and cannot modify a noun directly. Use the adjective 'unsubdued' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["unsubdued (adjective)","subdue (verb)","subduedly (adverb)","subdued (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unsubduedly' is an advanced word that means 'in a way that is not controlled, conquered, or restrained.' It's used to describe actions or states that are free from any form of subjugation or suppression. Because it's not a common word, it's usually found in formal writing or literature to create a strong image of freedom or defiance. For example, 'She spoke unsubduedly' means she spoke without holding back or being intimidated."},"example_sentences":[{"sentence":"The river flowed unsubduedly through the valley, carving its path over centuries.","translation":"その川は何世紀にもわたって谷を流れ、その道を切り開きながら、征服されることなく流れた。","type":"adverb","meaning_category":"unrestrainedly"},{"sentence":"He fought unsubduedly for his beliefs, never wavering in his conviction.","translation":"彼は自身の信念のために屈することなく戦い、その信念が揺らぐことはなかった。","type":"adverb","meaning_category":"unyieldingly"},{"sentence":"The wild horses ran unsubduedly across the plains, their manes flowing in the wind.","translation":"野生の馬たちは平原を抑制されずに走り、たてがみが風になびいていた。","type":"adverb","meaning_category":"freely"}]}