{"word":"Clomiphene","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"クロミフェン (排卵誘発剤)","english_definition":"A synthetic nonsteroidal antiestrogen used to induce ovulation in women who do not ovulate regularly but desire to become pregnant.","examples":[{"sentence":"Clomiphene is often prescribed to women with polycystic ovary syndrome (PCOS) to help them conceive.","translation":"クロミフェンは、多嚢胞性卵巣症候群（PCOS）の女性が妊娠するために処方されることが多いです。"},{"sentence":"The doctor recommended a course of clomiphene to stimulate ovulation.","translation":"医師は排卵を刺激するためにクロミフェンの投与を勧めました。"}],"collocations":["clomiphene citrate","clomiphene therapy","prescribe clomiphene","take clomiphene"],"synonyms":["Clomid","Serophene"],"antonyms":[]}],"etymology":{"value":"Derived from chemical nomenclature.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkloʊmɪfiːn/","syllables":"clo-mi-phene"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Clomiphene is a medication primarily used to treat infertility in women by inducing ovulation. It works by blocking estrogen receptors in the hypothalamus, which stimulates the release of hormones that promote ovulation. It is typically taken orally for a short period each month.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I take clomiphene for headache.","correct":"✓ I take clomiphene to help me ovulate.","note":"Clomiphene is specifically for inducing ovulation, not for headaches or other conditions."},{"incorrect":"✗ Clomiphene is safe for all women.","correct":"✓ Clomiphene should only be taken under medical supervision.","note":"Clomiphene has potential side effects and is not suitable for all women. It should only be taken under the guidance of a healthcare professional."}],"priority":"★★☆"},"related_words":{"derivatives":["clomiphene citrate"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Clomiphene is a medication used to treat infertility in women who have problems with ovulation. It works by stimulating the release of hormones necessary for ovulation. This medication requires a prescription and should be taken under the supervision of a doctor due to potential side effects and the need for monitoring. It is commonly used in cases of polycystic ovary syndrome (PCOS) and other ovulatory disorders."},"example_sentences":[{"sentence":"The fertility specialist prescribed clomiphene to help regulate her menstrual cycle.","translation":"不妊治療専門医は、彼女の月経周期を調整するためにクロミフェンを処方しました。","type":"noun","meaning_category":"排卵誘発剤"},{"sentence":"She underwent clomiphene therapy for six months without success.","translation":"彼女はクロミフェン療法を6ヶ月間受けましたが、成功しませんでした。","type":"noun","meaning_category":"排卵誘発剤"}]}