{"word":"diplomatics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"外交学、外交術","english_definition":"The art and practice of conducting negotiations between nations; skill in handling affairs without arousing hostility; the study of diplomatic documents.","examples":[{"sentence":"Diplomatics is essential for maintaining peaceful international relations.","translation":"外交学は平和的な国際関係を維持するために不可欠です。"},{"sentence":"He is known for his diplomatics in resolving conflicts.","translation":"彼は紛争解決における外交術で知られています。"},{"sentence":"The professor specializes in diplomatics and international law.","translation":"その教授は外交学と国際法を専門としています。"}],"collocations":["international diplomatics","political diplomatics","diplomatics and negotiation","practice of diplomatics"],"synonyms":["diplomacy","negotiation","statecraft","foreign policy","international relations"],"antonyms":["war","conflict","hostility"]},{"part_of_speech":"noun","definition":"古文書学、古文書判読学","english_definition":"The study and interpretation of old documents, especially charters and diplomas.","examples":[{"sentence":"Diplomatics helps historians verify the authenticity of ancient texts.","translation":"古文書学は歴史家が古代文書の真正性を検証するのに役立ちます。"},{"sentence":"The scholar used diplomatics to analyze the medieval manuscript.","translation":"その学者は古文書学を用いて中世写本を分析しました。"},{"sentence":"Diplomatics involves understanding the historical context of documents.","translation":"古文書学は文書の歴史的背景を理解することを含みます。"}],"collocations":["historical diplomatics","medieval diplomatics","diplomatics analysis","diplomatics research"],"synonyms":["paleography","archival science","document analysis","historical criticism"],"antonyms":[]}],"etymology":{"value":"From French 'diplomatique', from Latin 'diplomaticus', from Greek 'diplōmatikos' (relating to a diploma or official document), from 'diplōma' (a folded paper, license, charter). The sense evolved from the study of historical documents to the art of negotiation between nations.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪpləˈmætɪks/","syllables":"dip-lo-mat-ics"},"inflection":{"noun_form":"plural in form, but can be singular in meaning (the study of)"},"usage_notes":{"explanation":"The term 'diplomatics' has two main meanings. In the context of international relations, it refers to the art and skill of conducting negotiations between countries. In the context of historical studies, it refers to the study and analysis of old documents to determine their authenticity and historical significance. Be mindful of the context to understand the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is good at diplomatic.","correct":"✓ He is good at diplomatics. / ✓ He is good at diplomacy.","note":"'Diplomatic' is an adjective, while 'diplomatics' is a noun referring to the skill or study of diplomacy. 'Diplomacy' is also a noun and often used interchangeably with 'diplomatics' in the context of international relations."},{"incorrect":"✗ The diplomatics are important.","correct":"✓ Diplomatics is important.","note":"Although 'diplomatics' is plural in form, when referring to the study or skill, it often takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["diplomatic (adjective): relating to diplomacy","diplomacy (noun): the art of conducting negotiations","diplomat (noun): an official engaged in diplomacy"],"phrases":["diplomatic immunity","diplomatic relations","diplomatic corps"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Diplomatics' is a specialized term that can refer to either the practice of international negotiation or the study of historical documents. Understanding the context is crucial to interpreting its meaning correctly. In international relations, it describes the skills and strategies used by diplomats to manage relationships between countries. In historical studies, it denotes the scholarly analysis of old documents to verify their authenticity and historical value. This term is more commonly encountered in academic or professional settings related to these fields."},"example_sentences":[{"sentence":"The success of the peace talks depended on careful diplomatics.","translation":"和平交渉の成功は、慎重な外交術にかかっていた。","type":"noun","meaning_category":"外交術"},{"sentence":"Diplomatics is crucial for understanding medieval charters.","translation":"古文書学は中世の勅許状を理解するために不可欠である。","type":"noun","meaning_category":"古文書学"},{"sentence":"His diplomatics skills helped to de-escalate the tension.","translation":"彼の外交術は緊張を緩和するのに役立った。","type":"noun","meaning_category":"外交術"},{"sentence":"The course covers diplomatics and international law.","translation":"そのコースでは、外交学と国際法を扱います。","type":"noun","meaning_category":"外交学"}]}