{"word":"dextrogyrate","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"右旋性の、右旋光性の","english_definition":"Rotating clockwise; specifically, rotating the plane of polarized light to the right.","examples":[{"sentence":"Dextrogyrate compounds are often found in nature.","translation":"右旋性化合物は自然界によく見られる。"},{"sentence":"The solution is dextrogyrate, indicating the presence of a specific isomer.","translation":"その溶液は右旋性であり、特定の異性体の存在を示している。"}],"collocations":["dextrogyrate compound","dextrogyrate sugar","dextrogyrate solution"],"synonyms":["clockwise","right-rotating"],"antonyms":["levogyrate","left-rotating"]}],"etymology":{"value":"From 'dextro-' (right) + 'gyrate' (to rotate).","priority":"★★★"},"pronunciation":{"ipa":"/ˌdɛkstroʊˈdʒaɪreɪt/","syllables":"dex-tro-gy-rate"},"inflection":{"notes":"Comparative and superlative forms are possible (more dextrogyrate, most dextrogyrate), but less common."},"usage_notes":{"explanation":"'Dextrogyrate' describes a molecule or substance that rotates plane-polarized light clockwise. This property is important in chemistry and physics, particularly in the study of chiral molecules. It is often abbreviated as '(+)'. The opposite of dextrogyrate is 'levogyrate', which rotates light counterclockwise.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The dextrogyrate is on the left.","correct":"The dextrogyrate compound rotates light to the right.","note":"'Dextrogyrate' is an adjective, not a noun. It describes something that rotates light to the right."}],"priority":"★★☆"},"related_words":{"derivatives":["dextrorotation (noun): the rotation of plane-polarized light to the right","gyrate (verb): to rotate or revolve quickly; to spiral"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized scientific vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'dextrogyrate' is a technical term used in chemistry and physics to describe substances that rotate plane-polarized light clockwise. It is derived from 'dextro-' (meaning right) and 'gyrate' (meaning to rotate). Understanding this term requires a background in these scientific fields. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The enzyme preferentially binds to the dextrogyrate isomer of the substrate.","translation":"その酵素は基質の右旋性異性体への結合を優先する。","type":"adjective","meaning_category":"右旋性"},{"sentence":"The specific rotation of the dextrogyrate form was determined using a polarimeter.","translation":"右旋性型の旋光度は、偏光計を用いて決定された。","type":"adjective","meaning_category":"右旋性"}]}