{"word":"Shelbiana","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A place name, specifically a community in Pike County, Kentucky, United States.","english_definition":"A community located in Pike County, Kentucky, United States.","examples":[{"sentence":"We drove through Shelbiana on our way to the mountains.","translation":"私たちは山に向かう途中でシェルビアナを通り過ぎました。"},{"sentence":"Shelbiana is a small community with a rich history.","translation":"シェルビアナは豊かな歴史を持つ小さなコミュニティです。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Likely derived from a combination of names or a descriptive term related to the local area's history or geography. Further research would be needed to determine the exact origin.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌʃɛlˈbiː.ænə/","syllables":"Shel-bi-a-na"},"inflection":{},"usage_notes":{"explanation":"'Shelbiana' is primarily used as a proper noun to refer to the specific location in Kentucky. It may also appear in contexts related to local news, history, or events associated with the community.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_places":["Pike County, Kentucky"],"related_terms":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to the Pike County, Kentucky area.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Shelbiana' is a proper noun referring to a specific place. Its usage is limited to contexts related to that location, making it less common in general English. Understanding its meaning requires knowledge of geography or specific references to Pike County, Kentucky."},"example_sentences":[{"sentence":"The post office in Shelbiana serves the surrounding rural areas.","translation":"シェルビアナの郵便局は周辺の農村地域にサービスを提供しています。","type":"noun","meaning_category":"Place Name"},{"sentence":"The annual Shelbiana Homecoming is a popular event for former residents.","translation":"毎年恒例のシェルビアナ・ホームカミングは、かつての住民にとって人気のあるイベントです。","type":"noun","meaning_category":"Place Name"}]}