{"word":"Bannimus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(擬人化された)インターネット上の禁止措置、アカウント停止","english_definition":"(Personified) The act of being banned or account suspension on the internet.","examples":[{"sentence":"Bannimus has struck again, silencing another user for violating the terms of service.","translation":"バニマスが再び襲来し、利用規約に違反した別のユーザーを沈黙させた。"},{"sentence":"Fear of Bannimus keeps many users in line.","translation":"バニマスへの恐怖が、多くのユーザーを従順にさせている。"}],"collocations":["Fear of Bannimus","Bannimus strikes","Invoke Bannimus"],"synonyms":["Banhammer","Account Suspension","Shadowban"],"antonyms":["Unban","Account Restoration"]}],"etymology":{"value":"A humorous personification of the act of being banned, combining 'ban' with a Latin-sounding suffix '-imus' to create a mock-Latin name, suggesting a powerful or divine entity responsible for administering bans.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbænɪməs/","syllables":"Ban-ni-mus"},"inflection":{"noun_plural":"Bannimuses"},"usage_notes":{"explanation":"'Bannimus' is a humorous, informal term, often used in online communities to refer to the act of being banned or the entity (usually moderators or administrators) responsible for issuing bans. It's not a standard English word and is primarily used in internet slang.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bannimus was very quiet.","correct":"✓ The ban was very quiet.","note":"'Bannimus' refers to the act of banning itself, not a person. If you mean to say that the person who issued the ban was quiet, use 'The administrator was very quiet.'"},{"incorrect":"✗ I bannimus you!","correct":"✓ I ban you!","note":"'Bannimus' is a noun, not a verb. The verb form is 'ban'."}],"priority":"★☆☆"},"related_words":{"derivatives":["ban","banned","banning","banhammer"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily internet slang.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Bannimus' is a highly specialized and informal term, primarily used within specific online communities. Understanding it requires familiarity with internet culture and slang. It is not suitable for general English communication. It is a humorous personification of the act of being banned, so it is used to lighten the mood around the topic of being banned from online platforms."},"example_sentences":[{"sentence":"The moderators invoked Bannimus on the troll who was disrupting the chat.","translation":"モデレーターはチャットを妨害していた荒らしにバニマスを発動した。","type":"noun","meaning_category":"Internet slang"},{"sentence":"Many fear the wrath of Bannimus in the online forum.","translation":"多くの人がオンラインフォーラムでバニマスの怒りを恐れている。","type":"noun","meaning_category":"Internet slang"}]}