{"word":"Homophiles","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"同性愛を好む人々、同性愛者（特に1950年代から1960年代にかけて、同性愛者の権利運動において使われた言葉）","english_definition":"People who are attracted to members of the same sex; homosexuals (especially as a term used in the homophile movement of the 1950s and 1960s to promote acceptance and understanding of homosexuality).","examples":[{"sentence":"The homophile movement sought to normalize homosexuality through education and advocacy.","translation":"同性愛を好む人々の運動は、教育と擁護を通じて同性愛を正常化しようとしました。"},{"sentence":"Early homophile organizations provided support and community for gay individuals.","translation":"初期の同性愛者の組織は、ゲイの人々に支援とコミュニティを提供しました。"}],"collocations":["homophile movement (同性愛を好む人々の運動)","homophile organization (同性愛を好む人々の組織)"],"synonyms":["homosexuals","gays","lesbians"],"antonyms":["heterosexuals"],"notes":"The term 'homophile' is less commonly used today, having been largely replaced by terms like 'gay,' 'lesbian,' or 'LGBTQ+'. It is primarily used in a historical context to refer to the early gay rights movement."}],"etymology":{"value":"Derived from the Greek words 'homo' (same) and 'phile' (lover, friend), combined to mean 'lover of the same.'","priority":"★★★"},"pronunciation":{"ipa":"ˈhoʊməˌfaɪlz","syllables":"ho-mo-philes"},"inflection":{"noun_plural":"Homophiles"},"usage_notes":{"explanation":"'Homophiles' is a term that was used in the mid-20th century to describe people who experience same-sex attraction. It was adopted by early gay rights organizations as a way to present homosexuality as a form of love and friendship, rather than a pathology or deviance. The term is now largely historical, with 'gay,' 'lesbian,' and 'LGBTQ+' being the preferred terms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Homophiles is a new term for transgender people.","correct":"✓ Homophiles was a term used for homosexual people in the mid-20th century.","note":"'Homophiles' specifically refers to people attracted to the same sex, not transgender individuals."}],"priority":"★★☆"},"related_words":{"derivatives":["homophile (adjective)"],"related_terms":["homosexuality","LGBTQ+","gay rights movement"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in historical or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Homophiles' is a term primarily encountered in historical discussions of the gay rights movement. It refers to individuals attracted to the same sex and was used by early advocacy groups to promote understanding and acceptance. While less common today, understanding the term provides insight into the evolution of LGBTQ+ rights and terminology."},"example_sentences":[{"sentence":"The Mattachine Society was one of the earliest homophile organizations in the United States.","translation":"マタシン協会は、米国で最も初期の同性愛を好む人々の組織の一つでした。","type":"noun","meaning_category":"同性愛者（歴史的な文脈）"},{"sentence":"Homophile activists sought to change public perceptions of homosexuality.","translation":"同性愛を好む活動家は、同性愛に対する世間の認識を変えようとしました。","type":"noun","meaning_category":"同性愛者（歴史的な文脈）"}]}