{"word":"skiter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(スコットランド方言、古語) おしゃべりな人、軽薄な人、ゴシップ好き","english_definition":"(Scottish dialect, archaic) A frivolous, gossiping person; a chatterer.","examples":[{"sentence":"She was known as a skiter in the village, always spreading rumors.","translation":"彼女は村ではおしゃべりな人として知られており、いつも噂を広めていた。"},{"sentence":"He dismissed the report as the work of a skiter.","translation":"彼はその報告を、おしゃべりな人の仕業として無視した。"}],"collocations":["a notorious skiter (悪名高いおしゃべり)"],"synonyms":["gossip","chatterbox","telltale","blabbermouth","windbag"],"antonyms":["reticent person","secretive person"]},{"part_of_speech":"verb","definition":"(スコットランド方言、古語) 軽薄な話をする、ゴシップを広める、無駄話をする","english_definition":"(Scottish dialect, archaic) To talk frivolously; to gossip; to chatter idly.","examples":[{"sentence":"Stop skiting and get back to work!","translation":"無駄話はやめて、仕事に戻りなさい！"},{"sentence":"They spent the afternoon skiting about their neighbors.","translation":"彼らは午後を近所の人たちのゴシップ話をして過ごした。"}],"collocations":["skite about (～についてゴシップを言う)"],"synonyms":["gossip","chatter","prattle","blather","babble"],"antonyms":["be silent","keep quiet"]}],"etymology":{"value":"Middle English 'skite' (to eject forcibly, to void excrement), of Scandinavian origin; related to Old Norse 'skíta' (to defecate). The sense of 'chatter idly' likely developed from the idea of something being ejected or spilled out uncontrollably.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskaɪtər/","syllables":"ski-ter"},"inflection":{"verb_forms":{"present_simple":["skiter","skiters"],"past_simple":"skited","past_participle":"skited","present_participle":"skiting"}},"usage_notes":{"explanation":"The word 'skiter' is primarily found in Scottish dialects and older literature. It refers to someone who talks a lot, often about unimportant or trivial matters, and especially someone who spreads gossip. As a verb, 'to skiter' means to engage in such talk. It is not commonly used in modern standard English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a skiter in the company, always working hard.","correct":"✓ He is a hard worker in the company.","note":"'Skiter' refers to someone who gossips or chatters idly, not someone who works hard."},{"incorrect":"✗ She skited the news on television.","correct":"✓ She reported the news on television.","note":"'Skite' as a verb means to gossip or chatter idly, not to report news."}],"priority":"★☆☆"},"related_words":{"derivatives":["skite (noun: boastful talk; verb: to boast)","skitish (adjective: lively, playful, or nervous)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly used in standard English)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Skiter' is a rare word, primarily found in Scottish dialects and older texts. It describes someone who is prone to idle chatter and gossip. Due to its limited usage, it's unlikely to be encountered in everyday conversation or standard written English. Understanding its meaning requires familiarity with regional dialects or historical literature."},"example_sentences":[{"sentence":"The old woman was known as a terrible skiter, always spreading rumors around the village.","translation":"その老婆はひどいおしゃべりとして知られており、いつも村中に噂を広めていた。","type":"noun","meaning_category":"おしゃべりな人"},{"sentence":"He warned her not to skiter about his private affairs.","translation":"彼は彼女に自分の私生活についてゴシップを広めないように警告した。","type":"verb","meaning_category":"ゴシップを広める"}]}