{"word":"Arabism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アラブ主義、アラブ民族主義","english_definition":"a political ideology that asserts the unity and importance of the Arab nation.","examples":[{"sentence":"Arabism played a significant role in the decolonization of the Middle East.","translation":"アラブ主義は中東の脱植民地化において重要な役割を果たした。"},{"sentence":"The Ba'ath Party was a strong proponent of Arabism.","translation":"バアス党はアラブ主義の強力な支持者だった。"}],"collocations":["pan-Arabism (汎アラブ主義)","Arab nationalism (アラブ民族主義)"],"synonyms":["Arab nationalism","Pan-Arabism"],"antonyms":["regionalism","sectarianism"]},{"part_of_speech":"noun","definition":"アラブ文化、アラブ的特徴、アラブの言語・文学・芸術など","english_definition":"the characteristics, language, literature, art, etc., of the Arab people.","examples":[{"sentence":"The conference focused on various aspects of Arabism, including its rich literary tradition.","translation":"会議では、豊かな文学的伝統を含む、アラブ主義の様々な側面が焦点となった。"},{"sentence":"The museum showcases the diverse expressions of Arabism through art and artifacts.","translation":"その博物館は、芸術や工芸品を通して、アラブ主義の多様な表現を紹介している。"}],"collocations":["expressions of Arabism","aspects of Arabism"],"synonyms":["Arab culture","Arab heritage"],"antonyms":["Western culture","foreign culture"]}],"etymology":{"value":"'Arab' + '-ism'.  Derived from the word 'Arab', referring to the people and culture of the Arab world, combined with the suffix '-ism', which denotes a doctrine, principle, or ideology.","priority":"★★★"},"pronunciation":{"ipa":"/ˈærəbɪzəm/","syllables":"A-ra-bism"},"inflection":{"noun_plural":"Arabisms (rarely used)"},"usage_notes":{"explanation":"'Arabism' can refer to both a political ideology (Arab nationalism) and the broader cultural characteristics of the Arab world.  The specific meaning depends on the context.  It is often used in discussions of Middle Eastern politics, history, and culture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Arabism.","correct":"✓ He is an Arab nationalist.","note":"'Arabism' is an ideology or cultural characteristic, not a person. To describe a person who supports Arabism, use 'Arab nationalist' or 'supporter of Arabism'."}],"priority":"★★☆"},"related_words":{"derivatives":["Arab (noun, adjective)","Arabist (noun: scholar of Arab language and culture)","Arabize (verb: to make something Arab in character)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Relatively low frequency. Used primarily in academic or political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Arabism' is a term used in political and cultural discussions, particularly when referring to the ideology of Arab unity or the cultural attributes of the Arab world. Understanding this term requires familiarity with Middle Eastern history and politics. It is not commonly used in everyday conversation.","example_sentences":[]},"example_sentences":[{"sentence":"The rise of Arabism in the 20th century challenged colonial powers.","translation":"20世紀におけるアラブ主義の台頭は、植民地勢力に挑戦した。","type":"noun","meaning_category":"アラブ主義（政治的イデオロギー）"},{"sentence":"The conference explored the influence of Arabism on contemporary art.","translation":"会議では、現代アートに対するアラブ主義の影響が探求された。","type":"noun","meaning_category":"アラブ文化"}]}