{"word":"diabetes","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"糖尿病","english_definition":"A disease in which the body's ability to produce or respond to insulin is impaired, resulting in abnormal metabolism of carbohydrates and elevated levels of glucose in the blood.","examples":[{"sentence":"He was diagnosed with diabetes at the age of 50.","translation":"彼は50歳で糖尿病と診断された。"},{"sentence":"Diabetes can lead to serious health complications if left untreated.","translation":"糖尿病は放置すると深刻な健康上の合併症を引き起こす可能性がある。"},{"sentence":"Managing diabetes involves monitoring blood sugar levels and making lifestyle changes.","translation":"糖尿病の管理には、血糖値のモニタリングと生活習慣の改善が含まれる。"}],"collocations":["type 1 diabetes (1型糖尿病)","type 2 diabetes (2型糖尿病)","gestational diabetes (妊娠糖尿病)","diabetes mellitus (糖尿病)","diabetes management (糖尿病管理)","diabetes prevention (糖尿病予防)","diabetes complications (糖尿病合併症)"],"synonyms":["hyperglycemia (高血糖)","insulin resistance (インスリン抵抗性)"],"antonyms":["hypoglycemia (低血糖)"],"related_medical_terms":["insulin (インスリン)","glucose (グルコース)","blood sugar (血糖)","HbA1c (ヘモグロビンA1c)","neuropathy (神経障害)","retinopathy (網膜症)","nephropathy (腎症)"]}],"etymology":{"value":"The word 'diabetes' comes from the Greek word διαβήτης (diabētēs), meaning 'a siphon' – referring to the excessive urination characteristic of the disease. Aretaeus of Cappadocia, a Greek physician, is credited with coining the term in the 1st century AD. The term 'mellitus', meaning 'honey-sweet', was added in the 17th century to distinguish the condition from diabetes insipidus, another disease with excessive urination but without high glucose levels.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪəˈbiːtiːz/","syllables":"di-a-be-tes"},"inflection":{"noun_plural":"None (uncountable in general usage, though 'diabeteses' can be found rarely in older texts)"},"usage_notes":{"explanation":"'Diabetes' is generally used as an uncountable noun when referring to the disease in general. When specifying a type of diabetes (e.g., type 1, type 2), it remains uncountable. It is important to specify the type of diabetes when discussing specific cases, as the causes, treatments, and management strategies can differ significantly between types.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a diabetes.","correct":"✓ He has diabetes.","note":"'Diabetes' is generally used as an uncountable noun, so the article 'a' is not used."},{"incorrect":"✗ Diabetis is a serious disease.","correct":"✓ Diabetes is a serious disease.","note":"The correct spelling is 'diabetes'."},{"incorrect":"✗ People with diabetes must watch their sugar.","correct":"✓ People with diabetes must watch their blood sugar levels.","note":"While understandable, it's more accurate to say 'blood sugar levels' as diabetes specifically affects blood glucose levels."}],"priority":"★★☆"},"related_words":{"derivatives":["diabetic (adjective: relating to or suffering from diabetes; noun: a person with diabetes)","pre-diabetic (adjective: having higher than normal blood sugar levels, but not high enough to be diagnosed with diabetes; noun: a person with pre-diabetes)"],"related_medical_specialties":["endocrinology (内分泌学)","diabetology (糖尿病学)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively high frequency in medical and health-related contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Diabetes' is a medical term referring to a group of diseases that affect how the body uses blood sugar (glucose). It's important to understand that there are different types of diabetes, such as type 1, type 2, and gestational diabetes. People with diabetes need to manage their blood sugar levels through diet, exercise, and sometimes medication like insulin. If not managed properly, diabetes can lead to serious health problems. The word itself is derived from Greek, meaning 'to pass through,' referring to the increased urination that is a common symptom.","example_sentences":[{"sentence":"Regular exercise can help prevent type 2 **diabetes**.","translation":"定期的な運動は2型糖尿病の予防に役立つ。","type":"noun","meaning_category":"disease"},{"sentence":"The doctor recommended a special diet for her **diabetes**.","translation":"医師は彼女の糖尿病のために特別な食事療法を勧めた。","type":"noun","meaning_category":"disease"},{"sentence":"Many people with **diabetes** need to take insulin injections.","translation":"多くの糖尿病患者はインスリン注射を必要とする。","type":"noun","meaning_category":"disease"}]}}