{"word":"nonprofessionalism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"プロ意識の欠如、非専門性、素人っぽさ","english_definition":"behavior or actions that do not meet the standards expected of a professional person; lack of professional skill or competence.","examples":[{"sentence":"His nonprofessionalism was evident in his sloppy work and lack of punctuality.","translation":"彼のプロ意識の欠如は、彼のずさんな仕事と時間にルーズな点に明らかだった。"},{"sentence":"The manager addressed the team about the increasing nonprofessionalism in their communication with clients.","translation":"マネージャーは、クライアントとのコミュニケーションにおけるプロ意識の欠如が増加していることについてチームに話をした。"},{"sentence":"The company's reputation suffered due to the nonprofessionalism of some of its employees.","translation":"一部の従業員のプロ意識の欠如により、会社の評判は損なわれた。"}],"collocations":["demonstrate nonprofessionalism (プロ意識の欠如を示す)","signs of nonprofessionalism (プロ意識の欠如の兆候)","address nonprofessionalism (プロ意識の欠如に対処する)","combat nonprofessionalism (プロ意識の欠如と戦う)","avoid nonprofessionalism (プロ意識の欠如を避ける)"],"synonyms":["amateurism","incompetence","inexperience","unskillfulness","lack of professionalism","poor performance","carelessness","negligence"],"antonyms":["professionalism","competence","expertise","skillfulness","diligence","responsibility"]}],"etymology":{"value":"\"Non-\" (否定の接頭辞) + \"professionalism\" (プロ意識)。","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnprəˈfɛʃənəlɪzəm/","syllables":"non-pro-fes-sion-al-is-m"},"inflection":{"noun_plural":"nonprofessionalisms (まれ)"},"usage_notes":{"explanation":"\"Nonprofessionalism\" refers to the opposite of \"professionalism.\" It describes behaviors, attitudes, or actions that are considered inappropriate or unacceptable in a professional setting. This can include things like being late, dressing inappropriately, gossiping, not following instructions, or lacking the necessary skills for the job. It is often used in the context of work, education, or other situations where a certain level of expertise and conduct is expected.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a nonprofessional attitude.","correct":"✓ He showed nonprofessionalism. / ✓ He showed a lack of professionalism.","note":"\"Nonprofessionalism\" is a noun. While \"nonprofessional\" can be used as an adjective, it's more common to use \"a lack of professionalism\" or rephrase the sentence. "},{"incorrect":"✗ The nonprofessionalism of the team was because they were new.","correct":"✓ The team's nonprofessionalism was due to their inexperience.","note":"Avoid using \"because\" directly after \"nonprofessionalism.\" Use \"due to\" or rephrase the sentence to be more clear."}],"priority":"★★☆"},"related_words":{"derivatives":["nonprofessional (adjective, noun)","professionalism (noun)","professional (adjective, noun)"],"antonyms":["professionalism","competence","expertise","skillfulness"],"synonyms":["amateurism","incompetence","inexperience"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonprofessionalism\" is a formal term used to describe the lack of qualities and behaviors expected in a professional environment. It implies a failure to meet the standards of competence, ethics, and conduct associated with a particular profession or role. This word is typically used in discussions about workplace performance, ethical breaches, or educational settings where professional standards are being taught and evaluated."},"example_sentences":[{"sentence":"The consultant's lack of preparation and disregard for deadlines were clear examples of nonprofessionalism.","translation":"コンサルタントの準備不足と締め切りを無視する態度は、プロ意識の欠如の明確な例だった。","type":"noun","meaning_category":"lack of professional conduct"},{"sentence":"The training program aims to reduce nonprofessionalism among new employees by teaching them the company's code of conduct.","translation":"この研修プログラムは、新入社員に会社の行動規範を教えることで、プロ意識の欠如を減らすことを目的としている。","type":"noun","meaning_category":"lack of professional conduct"},{"sentence":"Complaints about nonprofessionalism in the customer service department led to a review of their training procedures.","translation":"顧客サービス部門におけるプロ意識の欠如に関する苦情により、彼らの研修手順の見直しが行われた。","type":"noun","meaning_category":"lack of professional conduct"}]}