{"word":"axioms","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"公理、自明の理","english_definition":"a statement or proposition that is regarded as being established, accepted, or self-evidently true.","examples":[{"sentence":"The axiom that 'the whole is greater than the part' is generally accepted.","translation":"「全体は部分よりも大きい」という公理は一般的に受け入れられている。"},{"sentence":"Euclid's axioms formed the basis of geometry for centuries.","translation":"ユークリッドの公理は何世紀にもわたって幾何学の基礎を形成した。"},{"sentence":"We must start from certain basic axioms before we can prove anything.","translation":"何かを証明するためには、まずいくつかの基本的な公理から始めなければならない。"}],"collocations":["basic axioms","mathematical axioms","logical axioms","self-evident axioms","fundamental axioms","start from axioms","derive from axioms","establish axioms","accept axioms","build upon axioms"],"synonyms":["postulate","principle","premise","assumption","self-evident truth","fundamental truth","underlying principle","basic truth"],"antonyms":["theorem","corollary","conclusion","derived statement","hypothesis","conjecture"]},{"part_of_speech":"noun","definition":"(一般的な)原理、原則","english_definition":"a general principle or rule.","examples":[{"sentence":"The country's foreign policy is based on the axiom of non-interference.","translation":"その国の外交政策は、不干渉の原則に基づいている。"},{"sentence":"One of the key axioms of modern economics is that people act rationally.","translation":"現代経済学の重要な原理の一つは、人々は合理的に行動するというものだ。"}],"collocations":["key axioms","fundamental axioms","underlying axioms","basic axioms","general axioms","political axioms","economic axioms","social axioms","cultural axioms","moral axioms"],"synonyms":["principle","rule","law","maxim","dictum","tenet","doctrine","precept","canon"],"antonyms":["exception","deviation","irregularity"]}],"etymology":{"value":"Derived from the Greek word 'axioma' (ἀξίωμα), meaning 'that which is thought worthy or fit' or 'that which commends itself as evident'. This comes from 'axios' (ἄξιος), meaning 'worthy'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈæksiəmz/","syllables":"ax-i-oms"},"inflection":{"noun_plural":"axioms","noun_singular":"axiom"},"usage_notes":{"explanation":"'Axioms' are fundamental assumptions or statements that are taken to be true without proof. They serve as the starting points for reasoning and deduction in various fields, particularly mathematics, logic, and philosophy. In mathematics, axioms are the basic building blocks upon which theorems and proofs are constructed. In a more general sense, 'axioms' can refer to fundamental principles or rules that guide thought or action.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The theory is based on several hypothesis.","correct":"✓ The theory is based on several axioms.","note":"'Hypothesis' (仮説) is a proposition made as a basis for reasoning, without any assumption of its truth. 'Axiom' (公理) is self-evidently true and accepted without proof."},{"incorrect":"✗ Axioms are always easy to understand.","correct":"✓ Axioms are considered self-evident, but their implications may not always be easy to understand.","note":"While axioms are considered self-evident, their implications and the systems built upon them can be complex and challenging to understand."}],"priority":"★★☆"},"related_words":{"derivatives":["axiomatic (adjective): self-evident or unquestionable.","axiomatize (verb): to express in terms of axioms."],"related_concepts":["postulate (仮定): similar to an axiom, but may be specific to a particular theory.","theorem (定理): a statement that can be proven based on axioms and other theorems.","lemma (補題): a minor result used in proving a larger theorem.","corollary (系): a result that follows directly from a theorem."]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in academic and technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Axioms' are fundamental truths or assumptions that are accepted without proof and serve as the basis for reasoning and building more complex systems of thought. The term is commonly used in mathematics, logic, and philosophy to refer to these foundational principles. Understanding axioms is essential for grasping the structure and validity of arguments and theories in these fields. While the concept of an axiom is relatively straightforward, applying it in practice and understanding its implications can require advanced reasoning skills."},"example_sentences":[{"sentence":"The entire system of Euclidean geometry is built upon a set of five basic **axioms**.","translation":"ユークリッド幾何学の体系全体は、5つの基本的な公理に基づいて構築されている。","type":"noun","meaning_category":"公理 (mathematical)"},{"sentence":"It is an **axiom** of democracy that all citizens are equal before the law.","translation":"すべての市民は法の前に平等であるというのが、民主主義の公理である。","type":"noun","meaning_category":"原理 (political)"},{"sentence":"We must question the **axioms** upon which our beliefs are based.","translation":"私たちは、自分たちの信念の基盤となっている公理に疑問を抱かなければならない。","type":"noun","meaning_category":"原理 (philosophical)"},{"sentence":"The principle of supply and demand is a fundamental **axiom** in economics.","translation":"需要と供給の原則は、経済学における基本的な公理である。","type":"noun","meaning_category":"原理 (economic)"},{"sentence":"The **axioms** of set theory are used to define the fundamental properties of sets.","translation":"集合論の公理は、集合の基本的な特性を定義するために使用される。","type":"noun","meaning_category":"公理 (set theory)"}]}