{"word":"rheumatalgia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"リウマチ痛、関節痛","english_definition":"Pain resembling rheumatism, especially pain in the muscles or joints.","examples":[{"sentence":"He suffered from rheumatalgia in his knees.","translation":"彼は膝にリウマチ痛を患っていた。"},{"sentence":"The doctor diagnosed her with rheumatalgia.","translation":"医者は彼女をリウマチ痛と診断した。"}],"collocations":[],"synonyms":["arthralgia","myalgia","rheumatic pain"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'rheuma' (a flux or flow) + 'algia' (pain).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌruːmətˈældʒiə/","syllables":"rheu-ma-tal-gi-a"},"inflection":{"noun_plural":"rheumatalgias"},"usage_notes":{"explanation":"'Rheumatalgia' is a relatively uncommon term, often used interchangeably with 'rheumatic pain' or more general terms like 'joint pain' or 'muscle pain'. It specifically refers to pain that resembles the pain caused by rheumatism, a disease causing inflammation and pain in the joints, muscles, or fibrous tissue.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has rheumatalgia in his leg, it must be fracture.","correct":"✓ He has rheumatalgia in his leg, it might be arthritis.","note":"Rheumatalgia is a type of pain, not a bone fracture. It is more closely associated with conditions like arthritis or muscle inflammation."}],"priority":"★☆☆"},"related_words":{"derivatives":["rheumatic","rheumatism","neuralgia"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Rheumatalgia' is a specialized medical term referring to pain that resembles the pain of rheumatism, typically affecting muscles or joints. It is not commonly used in everyday language and is more likely to be encountered in medical contexts. Understanding requires familiarity with medical terminology related to pain and musculoskeletal conditions."},"example_sentences":[{"sentence":"The elderly patient complained of persistent rheumatalgia in her shoulders and back.","translation":"その高齢患者は、肩と背中の持続的なリウマチ痛について訴えた。","type":"general","meaning_category":"リウマチ痛"},{"sentence":"Rheumatalgia can be a symptom of various underlying conditions, including arthritis and fibromyalgia.","translation":"リウマチ痛は、関節炎や線維筋痛症を含む様々な基礎疾患の症状である可能性がある。","type":"medical","meaning_category":"リウマチ痛"}]}