{"word":"Polariscope","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"偏光器、検偏光器","english_definition":"An instrument for detecting polarization in a beam of light, or for examining the effects of polarization on a substance.","examples":[{"sentence":"The polariscope is used to analyze the stress distribution in transparent materials.","translation":"偏光器は、透明材料の応力分布を分析するために使用されます。"},{"sentence":"A geologist might use a polariscope to identify minerals.","translation":"地質学者は、鉱物を特定するために偏光器を使用するかもしれません。"}],"collocations":["use a polariscope","examine with a polariscope","analyze with a polariscope"],"synonyms":["polarimeter"],"antonyms":[]}],"etymology":{"value":"'Polariscope' is derived from 'polarize' (to cause to vibrate in a definite pattern) + '-scope' (instrument for viewing).","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈlærɪskoʊp/","syllables":"po-lar-i-scope"},"inflection":{"noun_plural":"Polariscopes"},"usage_notes":{"explanation":"A polariscope is an optical instrument used to observe the effects of polarized light passing through a substance. It is commonly used in mineralogy, materials science, and quality control to identify materials, analyze stress, and detect imperfections.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a telescope to see the crystal structure.","correct":"✓ I used a polariscope to see the crystal structure.","note":"A telescope is for viewing distant objects, while a polariscope is for analyzing polarized light properties of materials."}],"priority":"★★☆"},"related_words":{"derivatives":["polarization","polarized","polarizing"],"related_scientific_terms":["birefringence","optical activity"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A polariscope is a scientific instrument used to study how light behaves when it passes through certain materials. It's mainly used by scientists and engineers to check the quality of materials or to learn more about their structure. If you're not in a technical field, you might not come across this word often."},"example_sentences":[{"sentence":"The engineer used a polariscope to check for stress concentrations in the glass.","translation":"エンジニアは、ガラスの応力集中を確認するために偏光器を使用しました。","type":"general","meaning_category":"instrument usage"},{"sentence":"By using a polariscope, the mineralogist could identify the type of crystal.","translation":"偏光器を使用することで、鉱物学者は結晶の種類を特定できました。","type":"scientific","meaning_category":"mineral identification"}]}