{"word":"adempted","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(法律) (遺贈された財産が)消滅した、無効になった","english_definition":"(law) (of a legacy) having been taken away or nullified because the specific property bequeathed is no longer in the testator's possession at the time of death.","examples":[{"sentence":"The bequest of the antique car was adempted because the testator sold it before his death.","translation":"そのアンティークカーの遺贈は、遺言者が亡くなる前にそれを売却したため、消滅した。"},{"sentence":"An adempted legacy means the beneficiary will not receive the specified property.","translation":"消滅した遺贈とは、受益者が指定された財産を受け取れないことを意味する。"}],"collocations":["adempted legacy","adempted bequest"],"synonyms":["nullified","revoked","extinguished","invalidated"],"antonyms":["valid","subsisting","in force"]}],"etymology":{"value":"From the past participle of the verb 'adempt', which comes from Latin 'adimere' meaning 'to take away'. 'Ad-' (to) + 'emere' (to take, buy).","priority":"★★★"},"pronunciation":{"ipa":"/əˈdɛmptɪd/","syllables":"a-demp-ted"},"inflection":{"notes":"This is the past participle form of the verb 'adempt' and is used as an adjective."},"usage_notes":{"explanation":"'Adempted' is a legal term specifically used in the context of wills and inheritance. It describes a situation where a specific item or property that was intended to be bequeathed to someone is no longer part of the deceased person's estate at the time of their death. This can happen if the item was sold, destroyed, or otherwise disposed of before the person died. As a result, the intended beneficiary does not receive that particular item. It is important to note that ademption usually applies to specific bequests, not general bequests (e.g., a sum of money).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The contract was adempted due to a breach of agreement.","correct":"✓ The contract was terminated due to a breach of agreement.","note":"'Adempted' specifically refers to the nullification of a bequest in a will, not the termination of a contract. Use 'terminated' or 'cancelled' for contracts."},{"incorrect":"✗ The inheritance was adempted because the heir refused it.","correct":"✓ The inheritance was disclaimed because the heir refused it.","note":"If an heir refuses an inheritance, it is 'disclaimed', not 'adempted'. Ademption occurs when the property is no longer part of the estate."}],"priority":"★★☆"},"related_words":{"derivatives":["ademption (noun): The act or fact of an adempted legacy.","adempt (verb): To revoke or nullify a legacy by disposing of the property before death."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized legal vocabulary)","frequency_google_ngram":"Very low frequency - Specialized legal term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Adempted' is a specialized legal term used in wills and estates. It describes a situation where a specific item or property that was meant to be given to someone in a will is no longer available because the person who wrote the will no longer owned it at the time of their death. This could be because they sold it, gave it away, or it was destroyed. Because the item is no longer part of the estate, the person who was supposed to receive it does not get it. This term is only used in legal contexts related to wills and inheritance."},"example_sentences":[{"sentence":"Because the testator no longer owned the shares of stock, the bequest was considered **adempted**.","translation":"遺言者が株式を所有していなかったため、その遺贈は消滅したとみなされた。","type":"adjective","meaning_category":"(法律) (遺贈された財産が)消滅した、無効になった"},{"sentence":"The court ruled that the legacy was **adempted** due to the sale of the property.","translation":"裁判所は、財産の売却により、その遺贈は消滅したと判決を下した。","type":"adjective","meaning_category":"(法律) (遺贈された財産が)消滅した、無効になった"}]}