{"word":"Epicism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"エピクロス主義、エピクロス学派","english_definition":"The philosophical system of Epicurus, emphasizing pleasure as the greatest good, but defining pleasure as freedom from pain and disturbance.","examples":[{"sentence":"Epicism was a popular philosophy in ancient Greece and Rome.","translation":"エピクロス主義は古代ギリシャとローマで人気のある哲学でした。"},{"sentence":"Critics often misunderstand Epicism as advocating for hedonism.","translation":"批判者たちはしばしばエピクロス主義を快楽主義を擁護するものとして誤解します。"}],"collocations":["Epicurean philosophy","Epicurean ethics","Hellenistic philosophy"],"synonyms":["Epicureanism","Epicurean philosophy"],"antonyms":["Stoicism","asceticism"]}],"etymology":{"value":"From Epicurus (Greek Ἐπίκουρος), the founder of the philosophy, + -ism.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɛpɪsɪzəm/","syllables":"Ep-i-cis-m"},"inflection":{"noun_plural":"Epicisms"},"usage_notes":{"explanation":"Epicism is often used interchangeably with Epicureanism. It refers to the philosophical system developed by Epicurus, which aimed to achieve happiness through tranquility and the absence of pain, rather than through the pursuit of sensual pleasures. It's important to distinguish Epicism from simple hedonism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced epicism by indulging in every pleasure.","correct":"✓ He misunderstood epicism by indulging in every pleasure.","note":"Epicism is not about indulging in every pleasure, but about achieving a state of tranquility and freedom from pain."}],"priority":"★★☆"},"related_words":{"derivatives":["Epicurean (adjective, noun)","Epicureanism (noun)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Epicism' refers to the philosophy of Epicurus, which focuses on achieving happiness through minimizing pain and maximizing tranquility. It's different from simply seeking pleasure; it's about a balanced and thoughtful approach to life. This term is more common in philosophical discussions."},"example_sentences":[{"sentence":"The principles of Epicism guided his life towards simplicity and contentment.","translation":"エピクロス主義の原則は、彼の人生をシンプルさと満足へと導いた。","type":"general","meaning_category":"philosophical system"},{"sentence":"Some scholars argue that Epicism was a precursor to modern humanism.","translation":"一部の学者は、エピクロス主義が現代の人道主義の前身であると主張している。","type":"academic","meaning_category":"historical context"}]}