{"word":"turnsheet","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(アニメーション制作で)タイムシート、撮影指示書","english_definition":"(In animation production) A time sheet, also known as an exposure sheet or X-sheet, which is a document used to plan and record the timing and camera instructions for each frame of animation.","examples":[{"sentence":"The animator carefully filled out the turnsheet to ensure the timing of the character's movements was correct.","translation":"アニメーターは、キャラクターの動きのタイミングが正確になるように、ターンシートを注意深く記入した。"},{"sentence":"The director reviewed the turnsheet to check the camera angles and exposure settings for each scene.","translation":"監督は、各シーンのカメラアングルと露出設定を確認するために、ターンシートを見直した。"}],"collocations":["fill out a turnsheet (ターンシートを記入する)","review a turnsheet (ターンシートを見直す)","create a turnsheet (ターンシートを作成する)","animation turnsheet (アニメーションのターンシート)","exposure sheet (エクスポージャーシート、ターンシートの別名)","X-sheet (Xシート、ターンシートの別名)"],"synonyms":["exposure sheet","X-sheet","time sheet"],"antonyms":[]}],"etymology":{"value":"Probably a combination of 'turn' (referring to the turning of pages or frames) and 'sheet' (referring to the paper document).","priority":"★★★"},"pronunciation":{"ipa":"/ˈtɜːrnʃiːt/","syllables":"turn-sheet"},"inflection":{"noun_plural":"turnsheets"},"usage_notes":{"explanation":"A 'turnsheet' is a specialized term used primarily in the field of animation. It is a crucial document for planning and executing the timing and camera movements in animated productions. It is also known as an exposure sheet or X-sheet.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The turnsheet was used to record the dialogue.","correct":"✓ The turnsheet was used to record the timing of the animation and camera instructions.","note":"Turnsheets are primarily for timing and camera instructions, not dialogue. Dialogue is recorded in a separate script or dialogue sheet."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["animation","time sheet","exposure sheet","X-sheet","camera instructions","timing","frame","scene"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Turnsheet' is a technical term used in animation. It refers to a document that specifies the timing and camera instructions for each frame of animation. Understanding this term requires familiarity with animation production processes."},"example_sentences":[{"sentence":"The experienced animator quickly scanned the turnsheet before starting work on the scene.","translation":"熟練したアニメーターは、シーンの作業を開始する前に、ターンシートを素早く確認した。","type":"noun","meaning_category":"アニメーション制作"},{"sentence":"Without a detailed turnsheet, the animation would be chaotic and out of sync.","translation":"詳細なターンシートがなければ、アニメーションは混乱し、同期が取れなくなるだろう。","type":"noun","meaning_category":"アニメーション制作"}]}