{"word":"single-shooting","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(映画・テレビ制作における)シングル撮影、単独撮影","english_definition":"A method of filming or shooting a scene in which only one camera is used.","examples":[{"sentence":"The film was made using single-shooting, which allowed for more flexibility in post-production.","translation":"その映画はシングル撮影で作られたため、ポストプロダクションでの柔軟性が高まりました。"},{"sentence":"Single-shooting is often preferred for scenes with complex camera movements.","translation":"シングル撮影は、複雑なカメラワークを伴うシーンでよく好まれます。"}],"collocations":["single-shooting technique","single-shooting method","use single-shooting"],"synonyms":["single-camera shooting","one-camera shooting"],"antonyms":["multi-camera shooting"]},{"part_of_speech":"adjective","definition":"(映画・テレビ制作において)シングル撮影の、単独撮影の","english_definition":"Relating to or using a method of filming or shooting a scene in which only one camera is used.","examples":[{"sentence":"This is a single-shooting scene, so we need to be very precise with each take.","translation":"これはシングル撮影のシーンなので、各テイクで非常に正確である必要があります。"},{"sentence":"The director decided to use a single-shooting approach for this project.","translation":"監督はこのプロジェクトでシングル撮影のアプローチを採用することにしました。"}],"collocations":["single-shooting style","single-shooting approach","single-shooting setup"],"synonyms":["single-camera","one-camera"],"antonyms":["multi-camera"]}],"etymology":{"value":"Combination of 'single' (meaning one) and 'shooting' (referring to the act of filming).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪŋɡəl ˈʃuːtɪŋ/","syllables":"sin-gle-shoot-ing"},"inflection":{"noun_plural":"single-shootings"},"usage_notes":{"explanation":"'Single-shooting' refers to a filming technique where only one camera is used to capture a scene. This method is often used in film and television production to allow for greater control over the camera angles and movements, and to provide more flexibility in post-production. It contrasts with multi-camera shooting, where multiple cameras are used simultaneously.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We used single shooting to film the live concert.","correct":"✓ We used multi-camera shooting to film the live concert.","note":"Live concerts typically use multi-camera setups to capture different angles simultaneously."},{"incorrect":"✗ The single-shooting was very expensive.","correct":"✓ The single-camera shooting was very expensive.","note":"While 'single-shooting' is correct, 'single-camera shooting' is a more common and clearer term."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["multi-camera shooting","film production","camera angle","scene","take","post-production"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Single-shooting' is a term used in film and television production to describe the technique of using only one camera to film a scene. This method allows for more precise control over camera angles and movements, but it can be more time-consuming than using multiple cameras. The term is most often encountered in discussions about filmmaking techniques or in the context of film production.","priority":"★★☆"},"example_sentences":[{"sentence":"The director chose single-shooting to achieve a specific visual style.","translation":"監督は特定の視覚スタイルを実現するためにシングル撮影を選びました。","type":"general","meaning_category":"Technique"},{"sentence":"Single-shooting requires more takes to capture all the necessary angles.","translation":"シングル撮影では、必要なすべてのアングルを捉えるためにより多くのテイクが必要です。","type":"general","meaning_category":"Technique"},{"sentence":"The documentary was filmed using a single-shooting setup.","translation":"そのドキュメンタリーはシングル撮影のセットアップで撮影されました。","type":"general","meaning_category":"Setup"}]}