{"word":"numismatologist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"貨幣研究家、古銭研究家、貨幣学者","english_definition":"A person who studies or collects coins, paper money, and medals.","examples":[{"sentence":"The numismatologist examined the ancient coin with great care.","translation":"その貨幣研究家は古代のコインを細心の注意を払って調べた。"},{"sentence":"He is a renowned numismatologist, specializing in Roman currency.","translation":"彼はローマの通貨を専門とする、有名な貨幣研究家です。"},{"sentence":"The museum hired a numismatologist to curate their coin collection.","translation":"博物館は、コインコレクションを管理するために貨幣研究家を雇った。"}],"collocations":["expert numismatologist","leading numismatologist","consulting numismatologist","amateur numismatologist"],"synonyms":["coin expert","currency scholar","medalist"],"antonyms":[]}],"etymology":{"value":"The word \"numismatologist\" is derived from \"numismatology,\" which comes from the Greek word \"νόμισμα\" (nómisma), meaning \"coin\" or \"currency,\" and \"-logy,\" which means \"the study of.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnjuːmɪzməˈtɒlədʒɪst/","syllables":"nu-mis-ma-tol-o-gist"},"inflection":{"noun_plural":"numismatologists"},"usage_notes":{"explanation":"A numismatologist is someone who studies coins, paper money, tokens, and medals. This study involves understanding the history, metallurgy, design, and economic context of these objects. Numismatologists may work in museums, universities, or as private collectors and researchers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a numismatic.","correct":"✓ He is a numismatologist.","note":"\"Numismatic\" is an adjective referring to coins or numismatics, while \"numismatologist\" is the noun referring to a person who studies numismatics."},{"incorrect":"✗ She studies numismatology. She is a numismatologist.","correct":"✓ She studies numismatics. She is a numismatologist.","note":"The field of study is called \"numismatics,\" not \"numismatology.\""}],"priority":"★★☆"},"related_words":{"derivatives":["numismatic (adjective: relating to coins or medals)","numismatics (noun: the study or collection of coins, paper money, and medals)","numismatography (noun: the writing of books or articles on numismatics)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"numismatologist\" refers to a specialist in the field of numismatics, which is the study and collection of coins, paper money, and medals. This term is highly specialized and primarily used in academic or professional contexts related to history, archaeology, and economics. Understanding the word requires familiarity with the broader field of numismatics and its associated terminology."},"example_sentences":[{"sentence":"The auction featured several rare coins, attracting numismatologists from around the world.","translation":"そのオークションにはいくつかの珍しいコインが出品され、世界中の貨幣研究家が集まった。","type":"general","meaning_category":"definition"},{"sentence":"As a numismatologist, she has published extensively on the history of coinage in ancient Greece.","translation":"貨幣研究家として、彼女は古代ギリシャの貨幣の歴史について広範な論文を発表している。","type":"professional","meaning_category":"definition"},{"sentence":"The experienced numismatologist could identify the origin and value of the coin at a glance.","translation":"経験豊富な貨幣研究家は、一目でコインの起源と価値を識別できた。","type":"expert","meaning_category":"definition"}]}