{"word":"questioners","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"質問者、尋問者","english_definition":"People who ask questions, especially in a formal or official context.","examples":[{"sentence":"The questioners pressed the witness for more details.","translation":"質問者たちは証人にもっと詳しい情報を求めて追及した。"},{"sentence":"The panel of questioners included experts in various fields.","translation":"質問者団には、さまざまな分野の専門家が含まれていた。"}],"collocations":["a panel of questioners","the chief questioner","relentless questioners"],"synonyms":["interrogators","examiners","inquirers","pollsters"],"antonyms":["answerers","respondents"]}],"etymology":{"value":"The word 'questioner' is derived from the verb 'question', which comes from the Latin word 'quaestionarius', meaning 'one who puts to the question, torturer'. The suffix '-er' is added to denote a person who performs the action.","priority":"N/A"},"pronunciation":{"ipa":"/ˈkwɛstʃənərz/","syllables":"ques-tion-ers"},"inflection":{"noun_plural":"questioners"},"usage_notes":{"explanation":"'Questioners' refers to individuals who pose questions, often in a structured setting like a trial, interview, or survey. The term implies a more formal or deliberate act of questioning compared to simply asking a question in casual conversation.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The questioners was very persistent.","correct":"The questioners were very persistent.","note":"'Questioners' is a plural noun, so it requires a plural verb form ('were')."},{"incorrect":"He is a good questioner because he asks many questions.","correct":"He is a good questioner because he asks insightful questions.","note":"Being a good questioner involves more than just asking many questions; it requires asking thoughtful and relevant questions."}],"priority":"N/A"},"related_words":{"derivatives":["question (noun, verb)","questioning (adjective, noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'questioners' is relatively formal and is used in contexts where people are systematically asking questions, such as in legal, academic, or investigative settings. It implies a role or profession related to questioning. Understanding the context is crucial for interpreting the meaning accurately."},"example_sentences":[{"sentence":"The **questioners** at the press conference were eager to learn more about the new policy.","translation":"記者会見での質問者たちは、新しい政策についてもっと知りたがっていた。","type":"noun","meaning_category":"質問者"},{"sentence":"The **questioners** in the debate challenged the candidate's stance on key issues.","translation":"討論会の質問者たちは、候補者の主要な問題に対する姿勢に異議を唱えた。","type":"noun","meaning_category":"質問者"}]}