{"word":"Hypaesthesia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"感覚鈍麻、知覚減退","english_definition":"A decreased sensitivity to touch, pain, temperature, or other sensory stimuli.","examples":[{"sentence":"The patient reported hypaesthesia in his left arm after the injury.","translation":"患者は負傷後、左腕の感覚鈍麻を訴えた。"},{"sentence":"Hypaesthesia can be a symptom of nerve damage or certain medical conditions.","translation":"感覚鈍麻は神経損傷または特定の病気の症状である可能性がある。"}],"collocations":["peripheral hypaesthesia","localized hypaesthesia","hypaesthesia of the skin"],"synonyms":["numbness","reduced sensation","sensory loss","blunted sensation"],"antonyms":["hyperesthesia","hyperalgesia"]}],"etymology":{"value":"From Greek ὑπό (hypo-) meaning 'under, below' and αἴσθησις (aísthēsis) meaning 'sensation, perception'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpɪsˈθiːziə/","syllables":"hy-pis-thee-zi-a"},"inflection":{"noun_plural":"hypaesthesias"},"usage_notes":{"explanation":"Hypaesthesia refers specifically to a reduction in sensitivity to stimuli. It is important to distinguish it from anesthesia (complete loss of sensation) and paraesthesia (abnormal sensation, such as tingling or prickling). It is a symptom, not a disease itself, and can indicate underlying neurological or vascular issues.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has hyperesthesia, so he can't feel anything.","correct":"✓ He has hypaesthesia, so he can't feel things as strongly.","note":"Hyperesthesia is increased sensitivity, whereas hypaesthesia is decreased sensitivity."}],"priority":"★☆☆"},"related_words":{"derivatives":["hypaesthetic (adjective)"],"medical_terms":["anesthesia","paraesthesia","hyperesthesia","analgesia"]},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypaesthesia' is a medical term referring to a decreased sensitivity to sensory stimuli such as touch or temperature. It is typically used in clinical settings when describing a patient's symptoms related to nerve function or neurological conditions. Understanding this term is important for healthcare professionals and those studying medicine or related fields."},"example_sentences":[{"sentence":"The neurologist tested for hypaesthesia by gently touching the patient's skin.","translation":"神経科医は患者の皮膚を優しく触診することで、感覚鈍麻の検査を行った。","type":"general","meaning_category":"general"},{"sentence":"Diabetes can cause peripheral neuropathy, leading to hypaesthesia in the feet.","translation":"糖尿病は末梢神経障害を引き起こし、足の感覚鈍麻につながる可能性がある。","type":"medical","meaning_category":"medical"}]}