{"word":"contra-indicant","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"禁忌（きんき）となるもの、禁忌事項","english_definition":"A factor that renders a particular treatment or procedure inadvisable.","examples":[{"sentence":"Pregnancy is a contra-indicant for many medications.","translation":"妊娠は多くの薬の禁忌事項です。"},{"sentence":"Allergies are important contra-indicants to consider before prescribing antibiotics.","translation":"抗生物質を処方する前に、アレルギーは考慮すべき重要な禁忌事項です。"}],"collocations":["absolute contra-indicant (絶対的禁忌)","relative contra-indicant (相対的禁忌)"],"synonyms":["contraindication","precaution","warning"],"antonyms":["indication"]}],"etymology":{"value":"Derived from 'contra-' (against) + 'indicant' (something that indicates).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒntrəˈɪndɪkənt/","syllables":"con-tra-in-di-cant"},"inflection":{"noun_plural":"contra-indicants"},"usage_notes":{"explanation":"A 'contra-indicant' is a specific factor or condition that makes a particular treatment, medication, or procedure potentially harmful or inappropriate. It is crucial to identify contra-indicants before proceeding with any medical intervention to avoid adverse effects. The term is primarily used in medical and healthcare contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor ignored the patient's contra-indicant and prescribed the medication.","correct":"✓ The doctor ignored the patient's contraindication and prescribed the medication.","note":"'Contraindication' is the more commonly used term, while 'contra-indicant' is less frequent but still valid."}],"priority":"★★☆"},"related_words":{"derivatives":["contraindicate (verb)","contraindication (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Contra-indicant' refers to a specific reason why a particular medical treatment or procedure should not be used because it could be harmful. It's a term used in medical settings to highlight potential risks. For example, if someone has a certain allergy, a medication containing that substance would be a contra-indicant. Understanding this term is important in healthcare to ensure patient safety."},"example_sentences":[{"sentence":"The patient's history of liver disease was a significant contra-indicant for the surgery.","translation":"患者の肝疾患の病歴は、手術の重要な禁忌事項でした。","type":"noun","meaning_category":"禁忌事項"},{"sentence":"Due to the potential for adverse reactions, this medication has several contra-indicants.","translation":"副作用の可能性があるため、この薬にはいくつかの禁忌事項があります。","type":"noun","meaning_category":"禁忌事項"}]}