{"word":"Indiamen","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"東インド会社所属の大型商船","english_definition":"Large, heavily armed merchant ships used by European East India Companies, particularly the British East India Company, for trade with India and the Far East.","examples":[{"sentence":"The Indiamen were vital for transporting goods like tea, spices, and silk from India to Europe.","translation":"インディアメンは、茶、香辛料、絹などの商品をインドからヨーロッパへ輸送する上で不可欠でした。"},{"sentence":"Many Indiamen were larger and more heavily armed than warships of the time.","translation":"多くのインディアメンは、当時の軍艦よりも大きく、重武装でした。"}],"collocations":["East Indiaman","British East Indiaman","trade with India","merchant ship","armed merchantman"],"synonyms":["East Indiaman","merchant vessel"],"antonyms":[]},{"part_of_speech":"noun","definition":"(集合的に)東インド会社所属の船舶群","english_definition":"Collectively, the fleet of ships belonging to or chartered by the East India Company.","examples":[{"sentence":"The arrival of the Indiamen in London was a major economic event.","translation":"ロンドンへのインディアメンの到着は、主要な経済イベントでした。"},{"sentence":"The Indiamen faced many dangers on their voyages, including storms and pirates.","translation":"インディアメンは航海中、嵐や海賊など多くの危険に直面しました。"}],"collocations":["fleet of Indiamen","arrival of Indiamen","voyages of Indiamen"],"synonyms":["East India Company fleet","merchant fleet"],"antonyms":[]}],"etymology":{"value":"Derived from \"India\" (referring to trade with India and the East) and \"-men\" (plural of \"man\", referring to ships).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɪndiəmən/","syllables":"In-di-a-men"},"inflection":{"noun_plural":"Indiamen"},"usage_notes":{"explanation":"\"Indiamen\" specifically refers to the large merchant ships used by the East India Companies, especially the British East India Company. These ships were not only used for trade but were also heavily armed to protect against pirates and enemy nations. The term is often used in historical contexts related to the Age of Sail and the history of trade between Europe and Asia.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Indiaman was a small fishing boat.","correct":"✓ The Indiaman was a large merchant ship.","note":"Indiamen were large, heavily armed merchant ships, not small fishing boats."},{"incorrect":"✗ Indiamen were primarily used for passenger transport.","correct":"✓ Indiamen were primarily used for transporting goods.","note":"While they sometimes carried passengers, Indiamen were primarily used for transporting goods."}],"priority":"★★☆"},"related_words":{"derivatives":["East India Company","merchant ship","maritime trade","Age of Sail"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Indiamen\" refers to a specific type of historical vessel, large merchant ships used by the East India Companies (particularly the British) for trade with India and the Far East. Understanding this term requires familiarity with maritime history and the historical context of European trade with Asia. It is not a commonly used word in modern English.","priority":"★★☆"},"example_sentences":[{"sentence":"The British East Indiamen dominated the trade routes between London and Bombay.","translation":"イギリス東インド会社のインディアメンが、ロンドンとボンベイ間の貿易ルートを支配していました。","type":"noun","meaning_category":"東インド会社所属の大型商船"},{"sentence":"The Indiamen often sailed in convoys for protection against pirates.","translation":"インディアメンはしばしば海賊からの保護のために船団を組んで航海しました。","type":"noun","meaning_category":"東インド会社所属の船舶群"}]}