{"word":"pastorally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"牧師として、牧会的に","english_definition":"In a manner relating to the duties of a pastor; in a way that provides spiritual guidance and care.","examples":[{"sentence":"He served the congregation pastorally for over 30 years.","translation":"彼は30年以上にわたり、牧師として教区民に牧会的に奉仕した。"},{"sentence":"The bishop addressed the priests, urging them to minister pastorally to their communities.","translation":"司教は司祭たちに、それぞれの地域社会に牧会的に奉仕するよう促した。"},{"sentence":"She approached the situation pastorally, offering comfort and support to those affected.","translation":"彼女はその状況に牧会的に取り組み、影響を受けた人々に慰めと支援を提供した。"}],"collocations":["serve pastorally","minister pastorally","approach pastorally","guide pastorally","care pastorally"],"synonyms":["spiritually","religiously","ecclesiastically","ministerially","clerically"],"antonyms":["secularly","worldly","materially"]}],"etymology":{"value":"Derived from 'pastoral' + '-ly'. 'Pastoral' comes from Latin 'pastoralis,' relating to shepherds or the care of flocks, and by extension, to the spiritual care of people.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpæstərəli/","syllables":"pas-tor-al-ly"},"inflection":{"notes":"Adverb, does not inflect."},"usage_notes":{"explanation":"'Pastorally' describes actions or behaviors performed in the role of a pastor, emphasizing spiritual guidance, care, and support. It is often used in religious contexts to describe how clergy members interact with their congregations or communities. The term implies a gentle, caring, and supportive approach, similar to how a shepherd cares for their flock.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The landscape was pastorally.","correct":"✓ The landscape was pastoral.","note":"'Pastorally' is an adverb, used to describe how something is done. 'Pastoral' is an adjective, used to describe a noun (e.g., a pastoral landscape)."},{"incorrect":"✗ He acted pastoral.","correct":"✓ He acted pastorally.","note":"'Pastoral' is an adjective, not an adverb. To describe how he acted, use the adverb 'pastorally'."}],"priority":"★★☆"},"related_words":{"derivatives":["pastoral (adjective, noun)","pastor (noun)","pastorate (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pastorally' is an adverb that describes actions done in the manner of a pastor. A pastor is a religious leader who provides spiritual guidance and care to a congregation. Therefore, 'pastorally' means doing something with that same kind of care, support, and spiritual guidance. It's often used in religious contexts to describe how someone ministers to others, offering comfort and support in a gentle and caring way. Because it's related to religious leadership and care, it's not a very common word in everyday conversation, but it's important to understand its meaning in religious or spiritual discussions."},"example_sentences":[{"sentence":"The priest visited the sick parishioner, offering comfort pastorally.","translation":"司祭は病気の信徒を訪問し、牧会的に慰めを与えた。","type":"adverb","meaning_category":"牧会的に慰める"},{"sentence":"She approached the counseling session pastorally, creating a safe space for the client to share their feelings.","translation":"彼女はカウンセリング・セッションに牧会的に取り組み、クライアントが自分の気持ちを安心して打ち明けられる安全な空間を作り出した。","type":"adverb","meaning_category":"牧会的に取り組む"},{"sentence":"He guided the youth group pastorally, helping them navigate difficult life decisions.","translation":"彼は青年グループを牧会的に指導し、彼らが難しい人生の決断をするのを助けた。","type":"adverb","meaning_category":"牧会的に指導する"}]}