{"word":"orientation-dependent","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"方向依存性のある、配向に依存する","english_definition":"Relating to or characterized by a property or behavior that varies depending on the direction or alignment of something.","examples":[{"sentence":"The material's conductivity is orientation-dependent; it conducts electricity better along one axis than another.","translation":"その材料の伝導率は方向依存性があり、ある軸に沿っての方が別の軸よりも電気を通しやすい。"},{"sentence":"The strength of the signal received is orientation-dependent, so the antenna must be carefully aligned.","translation":"受信する信号の強度は方向依存性があるため、アンテナを慎重に調整する必要がある。"},{"sentence":"The binding affinity of the antibody is orientation-dependent, meaning it binds more strongly when aligned in a specific way.","translation":"その抗体の結合親和性は方向依存性があり、特定の方向に整列されたときにより強く結合することを意味する。"}],"collocations":["orientation-dependent behavior","orientation-dependent property","orientation-dependent effect","orientation-dependent response","highly orientation-dependent"],"synonyms":["anisotropic","direction-sensitive","alignment-dependent","position-dependent"],"antonyms":["isotropic","orientation-independent","direction-independent"]}],"etymology":{"value":"The term is formed by combining 'orientation' (the direction or alignment of something) with 'dependent' (contingent upon or determined by something else).","priority":"N/A"},"pronunciation":{"ipa":"/ˌɔːriənˈteɪʃən dɪˈpɛndənt/","syllables":"o-ri-en-ta-tion-de-pen-dent"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with this particular adjective."},"usage_notes":{"explanation":"'Orientation-dependent' is a technical term often used in scientific and engineering contexts to describe phenomena where the outcome or behavior is influenced by the spatial arrangement or alignment of components. It is commonly found in physics, materials science, biology, and related fields.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The results are orientation dependent of the sample.","correct":"✓ The results are orientation-dependent on the sample.","note":"The correct preposition to use with 'orientation-dependent' is 'on'. Alternatively, you can say 'The results are dependent on the orientation of the sample'."}],"priority":"N/A"},"related_words":{"derivatives":["orientation","dependent","dependence"],"related_terms":["anisotropy","crystallography","alignment","directionality"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Orientation-dependent' is a specialized term used in technical fields to describe something whose properties or behavior change based on its direction or alignment. It's often used when discussing materials, signals, or biological interactions where the spatial arrangement matters. You'll typically encounter this word in scientific papers, engineering reports, or technical manuals."},"example_sentences":[{"sentence":"The efficiency of the solar panel is orientation-dependent; it produces the most energy when facing directly towards the sun.","translation":"そのソーラーパネルの効率は方向依存性があり、太陽に直接向いているときに最もエネルギーを生成する。","type":"general","meaning_category":"general"},{"sentence":"The catalytic activity of the enzyme is orientation-dependent, requiring the substrate to bind in a specific configuration.","translation":"その酵素の触媒活性は方向依存性があり、基質が特定の配置で結合する必要がある。","type":"scientific","meaning_category":"scientific"},{"sentence":"The magnetic properties of the crystal are highly orientation-dependent due to its anisotropic structure.","translation":"その結晶の磁気特性は、その異方性構造のために高度に方向依存性がある。","type":"physics","meaning_category":"physics"}]}