{"word":"prepatrician","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"パトリキ（貴族）階級以前の、またはパトリキ階級に関係しない","english_definition":"Existing or relating to a time before the patrician class, or not relating to the patrician class.","examples":[{"sentence":"The prepatrician inhabitants of Rome were mostly plebeians.","translation":"ローマのパトリキ階級以前の住民は、ほとんどが平民であった。"},{"sentence":"Archaeological evidence suggests a complex social structure in the prepatrician era.","translation":"考古学的証拠は、パトリキ階級以前の時代に複雑な社会構造が存在したことを示唆している。"}],"collocations":["prepatrician society","prepatrician era","prepatrician Rome"],"synonyms":["pre-aristocratic","pre-noble"],"antonyms":["patrician","aristocratic","noble"]}],"etymology":{"value":"\"pre-\" (以前の) + \"patrician\" (貴族の)","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːpəˈtrɪʃən/","syllables":"pre-pa-tri-cian"},"inflection":{},"usage_notes":{"explanation":"The term \"prepatrician\" is primarily used in historical contexts, particularly when discussing the social and political structures of ancient Rome. It refers to the period or social groups that existed before the establishment or dominance of the patrician class. It is relatively uncommon in modern usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The prepatrician government was very democratic.","correct":"✓ The prepatrician society was not necessarily democratic; it predated the fully developed political systems of later Rome.","note":"The term refers to a time before the established political systems, so attributing modern political characteristics may be inaccurate."}],"priority":"★★☆"},"related_words":{"derivatives":["patrician (noun, adjective)","plebeian (noun, adjective)"],"historical_terms":["Roman Republic","Senate","Twelve Tables"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'prepatrician' is a specialized term used in historical or academic contexts, specifically when discussing the social and political structures of ancient Rome before the rise of the patrician class. It is not commonly used in everyday language and requires a solid understanding of Roman history to fully grasp its meaning. Therefore, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The prepatrician tribes of Latium had their own distinct cultures and traditions.","translation":"ラティウムのパトリキ階級以前の部族は、それぞれ独自の文化と伝統を持っていた。","type":"adjective","meaning_category":"historical context"},{"sentence":"Understanding the prepatrician social dynamics is crucial for interpreting early Roman history.","translation":"パトリキ階級以前の社会力学を理解することは、初期のローマ史を解釈する上で非常に重要である。","type":"adjective","meaning_category":"academic/historical analysis"}]}