{"word":"Pseudo-miltonic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ミルトン風の、ミルトンの文体を模倣した","english_definition":"Resembling or imitating the style of John Milton, especially his elevated and elaborate language, complex sentence structure, and use of classical allusions.","examples":[{"sentence":"The poem was written in a Pseudo-miltonic style, with long, flowing sentences and ornate vocabulary.","translation":"その詩は、長く流れるような文と華麗な語彙を用いた、ミルトン風の文体で書かれていた。"},{"sentence":"His Pseudo-miltonic prose was impressive, though sometimes difficult to understand.","translation":"彼のミルトン風の散文は、理解するのが難しいこともあったが、印象的だった。"}],"collocations":["Pseudo-miltonic style","Pseudo-miltonic verse","Pseudo-miltonic prose","Pseudo-miltonic language"],"synonyms":["Miltonian","Miltonesque"],"antonyms":[]}],"etymology":{"value":"\"Pseudo-\"（偽の、似非の）+ \"Miltonic\"（ジョン・ミルトンに関する、ミルトン風の）。ジョン・ミルトンの文体を模倣しているが、完全にミルトンの域には達していないことを示す。","priority":"★★★"},"pronunciation":{"ipa":"ˌsjuːdoʊmɪlˈtɒnɪk","syllables":"pseu-do-mil-ton-ic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"Pseudo-miltonic\"は、ジョン・ミルトンの文学的なスタイルを模倣していることを指す形容詞です。特に、ミルトンの叙事詩『失楽園』(Paradise Lost)のような、壮大で格調高い文体、複雑な構文、古典的な引用などを特徴とします。この用語は、ミルトンのスタイルを意識的に取り入れているものの、完全にミルトンのレベルには達していない作品や文体を指す際に使われます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The author is Pseudo-miltonic.","correct":"✓ The author writes in a Pseudo-miltonic style.","note":"\"Pseudo-miltonic\"は文体を指す形容詞であり、人を直接修飾することは稀です。文体を説明する際に使用します。"},{"incorrect":"✗ He is a Pseudo-miltonic poet, so he is fake.","correct":"✓ He is a Pseudo-miltonic poet, meaning he imitates Milton's style.","note":"\"Pseudo-\"は「偽の」という意味を持つことがありますが、\"Pseudo-miltonic\"の場合は、単にミルトンのスタイルを模倣していることを意味し、必ずしも否定的な意味合いを持つわけではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["Miltonic","Miltonian","Miltonesque"],"related_terms":["Paradise Lost","John Milton","Epic poetry","Blank verse"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門的な文学用語)","frequency_google_ngram":"低頻度 (Low frequency) - 文学研究や批評で使われる専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Pseudo-miltonic\"は、ジョン・ミルトンの文体を模倣したものを指す、文学的な専門用語です。ミルトンの特徴である、壮大なスケール、複雑な構文、古典的な引用などを意識的に取り入れているものの、完全にミルトンのレベルには達していない作品や文体を指します。この単語を理解するには、ミルトンの作品、特に『失楽園』の特徴を知っている必要があります。文学研究や批評において、特定の文体を分析・評価する際に用いられます。"},"example_sentences":[{"sentence":"The novel's opening chapter is written in a deliberately Pseudo-miltonic style.","translation":"その小説の冒頭の章は、意図的にミルトン風の文体で書かれている。","type":"adjective","meaning_category":"文体模倣"},{"sentence":"While ambitious, the poem's Pseudo-miltonic language feels somewhat forced.","translation":"野心的ではあるものの、その詩のミルトン風の言葉遣いはやや不自然に感じられる。","type":"adjective","meaning_category":"文体模倣"},{"sentence":"The critic described the play's dialogue as having a Pseudo-miltonic grandeur.","translation":"評論家は、その劇の対話がミルトン風の壮大さを持っていると評した。","type":"adjective","meaning_category":"文体模倣"}]}