{"word":"wood-keyed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(音楽)木製のキーを持つ楽器の","english_definition":"(music) Having keys made of wood. This term is primarily used to describe certain types of musical instruments, especially keyboard instruments such as organs or some early pianos.","examples":[{"sentence":"The wood-keyed organ produced a warm, mellow tone.","translation":"木製のキーを持つオルガンは、暖かくまろやかな音色を奏でた。"},{"sentence":"He preferred the feel of the wood-keyed piano to the ivory-keyed one.","translation":"彼は象牙のキーを持つピアノよりも、木製のキーを持つピアノの感触を好んだ。"}],"collocations":["wood-keyed organ","wood-keyed piano","wood-keyed instrument"],"synonyms":["wooden-keyed","wood key","wood key instrument"],"antonyms":["ivory-keyed","plastic-keyed","metal-keyed"]}],"etymology":{"value":"The term 'wood-keyed' is a compound word derived from 'wood,' referring to the material, and 'keyed,' indicating that the instrument has keys. It directly describes the construction of the instrument's keys.","priority":"N/A"},"pronunciation":{"ipa":"/ˈwʊdˌkiːd/","syllables":"wood-keyed"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'wood-keyed' is relatively niche and is primarily used in discussions about musical instruments, particularly in historical contexts or when specifying the type of material used for the keys. It helps to differentiate instruments with wooden keys from those with keys made of other materials like ivory, plastic, or metal.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The wood-keyed is beautiful.","correct":"✓ The wood-keyed organ is beautiful.","note":"'Wood-keyed' is an adjective, so it needs to modify a noun (e.g., organ, piano, instrument)."},{"incorrect":"✗ He played the wood-key.","correct":"✓ He played the wood-keyed piano.","note":"'Wood-keyed' is an adjective describing the piano, not a noun itself."}],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["keyboard instrument","organ","piano","harpsichord","clavichord","ivory-keyed","plastic-keyed"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - This term is not commonly used in general conversation but may appear in specialized texts about music.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Wood-keyed' is a specialized term primarily used in the context of musical instruments. It describes instruments, such as organs or pianos, that have keys made of wood rather than other materials like ivory or plastic. Understanding this term requires some familiarity with musical instrument terminology and historical construction methods."},"example_sentences":[{"sentence":"The museum displayed a rare wood-keyed clavichord from the 18th century.","translation":"博物館には、18世紀の珍しい木製のキーを持つクラビコードが展示されていた。","type":"adjective","meaning_category":"楽器のキーの材質"},{"sentence":"Many musicians appreciate the unique tactile feel of a wood-keyed piano.","translation":"多くの音楽家が、木製のキーを持つピアノ独特の触感を評価している。","type":"adjective","meaning_category":"楽器のキーの材質"}]}