{"word":"Non-Hispanic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非ヒスパニックの","english_definition":"Not of Hispanic origin or descent.","examples":[{"sentence":"The study focused on Non-Hispanic white individuals.","translation":"その研究は非ヒスパニック系の白人個人に焦点を当てた。"},{"sentence":"The majority of the population is Non-Hispanic.","translation":"人口の大多数は非ヒスパニックである。"}],"collocations":["Non-Hispanic Black","Non-Hispanic White","Non-Hispanic Asian"],"synonyms":["non-Latino"],"antonyms":["Hispanic","Latino"]},{"part_of_speech":"noun","definition":"非ヒスパニックの人","english_definition":"A person who is not of Hispanic origin or descent.","examples":[{"sentence":"The survey included both Hispanics and Non-Hispanics.","translation":"その調査にはヒスパニックと非ヒスパニックの両方が含まれていた。"},{"sentence":"Non-Hispanics make up a significant portion of the electorate.","translation":"非ヒスパニックは有権者のかなりの部分を占めている。"}],"collocations":[],"synonyms":["non-Latino"],"antonyms":["Hispanic","Latino"]}],"etymology":{"value":"Formed by adding the prefix \"non-\" to \"Hispanic\".","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒn hɪˈspænɪk/","syllables":"Non-His-pan-ic"},"inflection":{},"usage_notes":{"explanation":"Used in demographic and statistical contexts to differentiate individuals of Hispanic origin from those who are not. It's often used in the United States.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["Hispanic","Latino","Latina"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"This term is primarily used in demographic and statistical contexts, especially in the United States, to differentiate between people of Hispanic origin and those who are not. It is often used in surveys, reports, and academic studies. Understanding this term is important for interpreting data related to ethnicity and race in the US. It's a formal term and not typically used in everyday conversation."},"example_sentences":[{"sentence":"The data showed a disparity in income between Hispanic and Non-Hispanic households.","translation":"データはヒスパニック世帯と非ヒスパニック世帯の間の収入格差を示した。","type":"adjective","meaning_category":"describing a group"},{"sentence":"The study compared health outcomes among Hispanics, Non-Hispanics, and other racial groups.","translation":"その研究は、ヒスパニック、非ヒスパニック、および他の人種グループ間の健康状態を比較した。","type":"noun","meaning_category":"referring to a person or group"}]}