{"word":"non-normalized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"正規化されていない、標準化されていない","english_definition":"Not brought into conformity with a standard or norm; not adjusted to a standard scale or range.","examples":[{"sentence":"The data was in a non-normalized format, making it difficult to analyze.","translation":"データは非正規化形式であったため、分析が困難でした。"},{"sentence":"The non-normalized values showed a wide range of variation.","translation":"非正規化された値は、幅広い変動を示しました。"},{"sentence":"We need to convert the non-normalized database to a normalized one for better performance.","translation":"パフォーマンス向上のため、非正規化データベースを正規化されたデータベースに変換する必要があります。"}],"collocations":["non-normalized data","non-normalized database","non-normalized format","non-normalized value"],"synonyms":["unnormalized","unstandardized","raw","original"],"antonyms":["normalized","standardized"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'normalized'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈnɔːrməlaɪzd/","syllables":"non-nor-mal-ized"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"\"Non-normalized\" is commonly used in technical fields such as computer science, statistics, and data analysis to describe data or systems that have not been adjusted to a standard scale or format. It often implies that further processing or transformation is required before the data can be effectively used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The data is non normalize.","correct":"The data is non-normalized.","note":"Ensure the correct form of the adjective 'non-normalized' is used."}],"priority":"★★☆"},"related_words":{"derivatives":["normalization (noun)","normalize (verb)"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-normalized' is a technical term, primarily used in fields like computer science and statistics. It describes data or systems that haven't been adjusted to fit a standard scale or format. Understanding this term requires familiarity with the concept of normalization within the specific field of use."},"example_sentences":[{"sentence":"The machine learning model performed poorly with non-normalized input features.","translation":"機械学習モデルは、非正規化された入力特徴量ではパフォーマンスが低かった。","type":"adjective","meaning_category":"Describing data"},{"sentence":"The database schema was designed with non-normalized tables to optimize read operations.","translation":"データベーススキーマは、読み取り操作を最適化するために、非正規化テーブルで設計されました。","type":"adjective","meaning_category":"Describing databases"},{"sentence":"Using non-normalized data can lead to biased results in statistical analysis.","translation":"非正規化データを使用すると、統計分析で偏った結果が生じる可能性があります。","type":"adjective","meaning_category":"Describing data analysis"}]}