{"word":"laissez-faireism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自由放任主義、レッセ・フェール主義","english_definition":"a policy or attitude of letting things take their own course, without interfering.","examples":[{"sentence":"Laissez-faireism in economic policy led to deregulation of the industry.","translation":"経済政策における自由放任主義は、産業の規制緩和につながった。"},{"sentence":"The government adopted a laissez-faireism approach to the problem.","translation":"政府はその問題に対して自由放任主義的なアプローチを採用した。"}],"collocations":["economic laissez-faireism (経済的自由放任主義)","pure laissez-faireism (純粋な自由放任主義)"],"synonyms":["non-interventionism","free market policy","liberalism"],"antonyms":["interventionism","regulation","protectionism"]}],"etymology":{"value":"フランス語の「laissez faire」（なすがままにさせよ）に由来する。これは「laisser faire, laisser passer」（なすがままにさせよ、通過するがままにさせよ）というフレーズから来ており、18世紀のフランスの重商主義に対する反対運動の中で生まれた。経済活動に対する政府の干渉を最小限にすべきだという考え方を表す。","priority":"★★★"},"pronunciation":{"ipa":"/ˌleɪseɪˌfeərɪzəm/","syllables":"lai-say-fair-i-zem"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"「**laissez-faireism**」は、特に経済において、政府やその他の組織が干渉することなく、物事が自然な成り行きに任されるべきであるという信条または政策を指します。これは、市場が自己調整能力を持ち、干渉が非効率や不均衡を生む可能性があるという考えに基づいています。ただし、完全な自由放任主義は現実には存在せず、通常、法制度や契約の執行など、政府による一定の役割が想定されます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He believes in laissez-faireism in all aspects of life, including healthcare.","correct":"✓ He believes in laissez-faireism in economic matters, but not in healthcare.","note":"自由放任主義は主に経済政策に関連する概念であり、医療のような分野に適用するのは適切でない場合があります。"},{"incorrect":"✗ Laissez-faireism means there are no laws or regulations at all.","correct":"✓ Laissez-faireism means minimal government intervention, but there are still laws and regulations to protect property rights and enforce contracts.","note":"自由放任主義は政府の介入を最小限にすることを意味しますが、法や規制が全くないわけではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["laissez-faire (形容詞/名詞: 自由放任の、自由放任主義の)"],"phrases":["laissez-faire economics (自由放任経済)","laissez-faire capitalism (自由放任資本主義)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門的な文脈で使われる)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 専門的な経済学や政治学の文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**laissez-faireism**」は、政府が経済活動にできるだけ介入しないようにするという考え方です。これは、市場が自分でうまく調整できるから、政府が何かをする必要はない、という考えに基づいています。この言葉は、経済や政治について話すときに使われます。例えば、「その国は自由放任主義の政策をとっている」のように使います。少し難しい言葉ですが、経済のニュースや記事を読むときに出てくることがあります。"},"example_sentences":[{"sentence":"The economist advocated for a return to laissez-faireism.","translation":"その経済学者は自由放任主義への回帰を主張した。","type":"noun","meaning_category":"自由放任主義"},{"sentence":"Critics argued that laissez-faireism led to exploitation of workers.","translation":"批判者たちは、自由放任主義が労働者の搾取につながると主張した。","type":"noun","meaning_category":"自由放任主義"},{"sentence":"The company operated under a policy of laissez-faireism, allowing employees to make their own decisions.","translation":"その会社は自由放任主義のポリシーの下で運営されており、従業員が自分で決定を下すことを許可していた。","type":"noun","meaning_category":"自由放任主義"}]}