{"word":"cancerousness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"癌性であること、癌のような性質、悪性度","english_definition":"The state or quality of being cancerous; the degree to which something is malignant or resembles cancer.","examples":[{"sentence":"The cancerousness of the tumor was determined by a biopsy.","translation":"腫瘍の癌性は生検によって決定された。"},{"sentence":"Scientists are studying the factors that contribute to the cancerousness of certain substances.","translation":"科学者たちは、特定の物質の癌性に寄与する要因を研究している。"},{"sentence":"The level of cancerousness in the cells indicated an aggressive form of the disease.","translation":"細胞の癌性のレベルは、攻撃的な形態の疾患を示していた。"}],"collocations":["degree of cancerousness","level of cancerousness","assess the cancerousness","determine the cancerousness"],"synonyms":["malignancy","malignance","carcinogenicity","tumorousness","neoplasticity"],"antonyms":["benignancy","noncancerousness","healthiness"]},{"part_of_speech":"noun","definition":"（比喩的に）有害性、破壊性、腐敗性","english_definition":"(Figuratively) The quality of being harmful, destructive, or corrupting.","examples":[{"sentence":"The cancerousness of his influence spread throughout the organization.","translation":"彼の有害な影響は組織全体に広がった。"},{"sentence":"They fought against the cancerousness of corruption in the government.","translation":"彼らは政府の腐敗の有害性と闘った。"},{"sentence":"The cancerousness of hate speech can poison a society.","translation":"ヘイトスピーチの破壊性は社会を毒する可能性がある。"}],"collocations":["cancerousness of corruption","cancerousness of hate","cancerousness of influence"],"synonyms":["harmfulness","destructiveness","corruptness","toxicity","virulence"],"antonyms":["beneficiality","wholesomeness","goodness"]}],"etymology":{"value":"Formed from 'cancerous' (adjective) + '-ness' (suffix indicating a state or quality). 'Cancerous' comes from 'cancer' (Latin for 'crab', referring to the crab-like appearance of some tumors) + '-ous' (suffix indicating possession or resemblance).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkænsərəsnəs/","syllables":"can-cer-ous-ness"},"inflection":{"noun_plural":"cancerousnesses (rarely used)"},"usage_notes":{"explanation":"'Cancerousness' refers to the quality or state of being cancerous, often used in a medical context to describe the degree of malignancy of a tumor or cells. Figuratively, it can describe something harmful or destructive, similar to how cancer spreads and damages the body. The word is relatively uncommon, with 'malignancy' being a more frequently used synonym in medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cancerousness was very happy.","correct":"✓ The cancerousness was very high.","note":"'Cancerousness' is a quality or state, not a feeling or emotion. Use it with adjectives like 'high,' 'low,' 'significant,' etc., to describe the degree of malignancy. "},{"incorrect":"✗ The cancerousness is a person.","correct":"✓ The cancerousness is a characteristic of the tumor.","note":"'Cancerousness' is an abstract noun referring to a quality, not a person or thing. It describes a property of something else, such as a tumor or cells."}],"priority":"★☆☆"},"related_words":{"derivatives":["cancerous (adjective)","cancer (noun)","carcinoma (noun)","oncology (noun)","malignant (adjective)","benign (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cancerousness' is a technical term primarily used in medical and scientific contexts. It refers to the degree to which something is cancerous or malignant. The word is relatively rare in general usage and is more commonly found in specialized literature related to oncology and pathology. Understanding its figurative use requires a high level of abstract reasoning and familiarity with the concept of cancer as a metaphor for something harmful or destructive."},"example_sentences":[{"sentence":"The pathologist assessed the cancerousness of the tissue sample under the microscope.","translation":"病理医は顕微鏡下で組織サンプルの癌性を評価した。","type":"noun","meaning_category":"Malignancy"},{"sentence":"The cancerousness of the policy was evident in its long-term negative effects.","translation":"その政策の癌性は、その長期的な悪影響に明らかだった。","type":"noun","meaning_category":"Harmfulness"},{"sentence":"Reducing the cancerousness of the environment is crucial for public health.","translation":"環境の癌性を減らすことは、公衆衛生にとって非常に重要である。","type":"noun","meaning_category":"Harmfulness"}]}