{"word":"tertianship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"第三者の立場、仲裁者の地位","english_definition":"The state or condition of being a third party or mediator; the position of an arbitrator.","examples":[{"sentence":"The judge assumed tertianship in the dispute.","translation":"裁判官はその紛争において第三者の立場を引き受けた。"},{"sentence":"His tertianship was crucial for reaching a settlement.","translation":"彼の仲裁者の地位は和解に達するために重要だった。"}],"collocations":["assume tertianship","exercise tertianship","crucial tertianship"],"synonyms":["mediation","arbitration","neutrality","impartiality"],"antonyms":["partisanship","bias","partiality"]}],"etymology":{"value":"From the Latin 'tertius' meaning 'third', combined with '-ship' indicating a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɜːrʃənʃɪp/","syllables":"ter-ti-an-ship"},"inflection":{"noun_plural":"tertianships"},"usage_notes":{"explanation":"'Tertianship' refers to the role or condition of being a neutral third party, often involved in mediating or arbitrating disputes. It emphasizes impartiality and the aim to facilitate a resolution between conflicting parties. While not a commonly used word, it precisely describes this specific role.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed tertianship towards his friend.","correct":"✓ He showed impartiality towards his friend.","note":"'Tertianship' refers to a role or position, not a personal quality. Use 'impartiality' to describe unbiased behavior. "},{"incorrect":"✗ The tertianship solved the problem.","correct":"✓ The mediator solved the problem.","note":"Use 'mediator' or 'arbitrator' to refer to the person fulfilling the role, rather than 'tertianship' which is the state or position itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["tertiary (adjective: third in order or level)","tertiary sector (noun: the service sector of the economy)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tertianship' is a formal and uncommon term denoting the role or state of being a neutral third party, typically in a mediation or arbitration context. It implies a position of impartiality aimed at facilitating resolution between disputing parties. Due to its specialized usage, it is more likely to be encountered in legal or formal settings. Understanding the etymology from 'tertius' (third) aids in grasping its meaning. It is important to distinguish it from personal qualities like impartiality, which describes behavior, whereas 'tertianship' describes a role or position. "},"example_sentences":[{"sentence":"The organization sought a respected figure to assume tertianship in the labor negotiations.","translation":"その組織は労働交渉において仲裁者の地位を引き受ける尊敬される人物を探した。","type":"noun","meaning_category":"仲裁者の地位"},{"sentence":"Effective tertianship requires a deep understanding of both sides of the argument.","translation":"効果的な第三者の立場には、議論の両側の深い理解が必要である。","type":"noun","meaning_category":"第三者の立場"}]}