{"word":"Vidya","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Sanskrit) knowledge, learning, science, philosophy. It connotes correct knowledge, clarity, whether technical, scientific, arts, or spiritual.","english_definition":"(Sanskrit) knowledge, learning, science, philosophy. It connotes correct knowledge, clarity, whether technical, scientific, arts, or spiritual.","examples":[{"sentence":"In Hinduism, Vidya is often contrasted with Avidya (ignorance).","translation":"ヒンドゥー教では、VidyaはしばしばAvidya（無知）と対比されます。"},{"sentence":"The pursuit of Vidya is considered essential for spiritual progress.","translation":"Vidyaの追求は、精神的な進歩に不可欠であると考えられています。"}],"collocations":["pursuit of Vidya","path of Vidya","source of Vidya","true Vidya","higher Vidya"],"synonyms":["jnana","gyan","wisdom","understanding","erudition"],"antonyms":["Avidya","ignorance","nescience"]}],"etymology":{"value":"From the Sanskrit word विद्या (vidyā), meaning 'knowledge, science, learning'. It is derived from the root vid- 'to know'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈvɪdjə/","syllables":"Vid-ya"},"inflection":{"notes":"It is a noun, so it doesn't inflect."},"usage_notes":{"explanation":"Vidya is a Sanskrit term with deep philosophical and spiritual significance in Hinduism, Buddhism, and Jainism. It refers to true and correct knowledge, encompassing not only factual information but also understanding, wisdom, and spiritual insight. It is often contrasted with Avidya, which represents ignorance, illusion, and a lack of understanding of the true nature of reality. The pursuit of Vidya is considered essential for liberation (moksha) and spiritual growth.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have much vidya about computers.","correct":"✓ I have much knowledge about computers.","note":"In English, use 'knowledge' instead of 'vidya' in general contexts. 'Vidya' is more appropriate when discussing Hindu or Buddhist philosophy."},{"incorrect":"✗ Vidya is bad.","correct":"✓ Avidya is bad.","note":"Vidya is considered good, representing true knowledge. Avidya represents ignorance, which is considered negative."}],"priority":"★★☆"},"related_words":{"derivatives":["Vidyalaya (school, place of knowledge)","Vidyarthi (student, seeker of knowledge)","Avidya (ignorance)"],"phrases":["Vidya dadati vinyam (Knowledge gives humility)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in religious or philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Vidya' is a Sanskrit term referring to knowledge, learning, and wisdom, especially in a spiritual or philosophical context. It's a concept found in Hinduism, Buddhism, and Jainism, often contrasted with 'Avidya' (ignorance). Understanding 'Vidya' requires familiarity with these religious and philosophical traditions. It's not typically used in everyday English conversation; instead, 'knowledge' or 'wisdom' would be more appropriate. Its usage is generally limited to discussions of Eastern philosophy or religion."},"example_sentences":[{"sentence":"The ancient texts emphasize the importance of attaining Vidya for self-realization.","translation":"古代の文献は、自己実現のためにVidyaを習得することの重要性を強調しています。","type":"noun","meaning_category":"knowledge"},{"sentence":"Through meditation and study, one can overcome Avidya and achieve Vidya.","translation":"瞑想と学習を通して、人はAvidyaを克服し、Vidyaを達成することができます。","type":"noun","meaning_category":"knowledge"},{"sentence":"The guru imparted the sacred Vidya to his disciples.","translation":"導師は弟子たちに神聖なVidyaを伝えました。","type":"noun","meaning_category":"knowledge"}]}