{"word":"antifideism","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"反信仰主義：信仰や宗教的信念に反対する立場。特に、理性や証拠に基づかない信仰を批判する。","english_definition":"Opposition to fideism, especially the view that reason and evidence are unnecessary or inappropriate for religious belief.","examples":[{"sentence":"Antifideism argues that religious beliefs should be subject to rational scrutiny.","translation":"反信仰主義は、宗教的信念は合理的な吟味に服すべきだと主張する。"},{"sentence":"Some forms of antifideism reject all religious belief as irrational.","translation":"反信仰主義のいくつかの形態は、すべての宗教的信念を非合理的であるとして拒否する。"}],"collocations":["rational scrutiny (合理的な吟味)","religious belief (宗教的信念)","reject belief (信念を拒否する)"],"synonyms":["skepticism","rationalism","atheism","secularism"],"antonyms":["fideism","theism","religious belief"]}],"etymology":{"value":"\"anti-\"（反対）+ \"fideism\"（信仰主義）","priority":"中"},"pronunciation":{"ipa":"/ˌæntiˈfaɪdiɪzəm/","syllables":"an-ti-fi-dei-i-zm"},"inflection":{"notes":"名詞（可算/不可算）"},"usage_notes":{"explanation":"Antifideism is a philosophical stance that opposes fideism, which is the view that faith is independent of reason, or that reason is even hostile to faith and thus faith is superior. Antifideists typically argue that religious beliefs should be rationally justifiable or at least not contradict reason. It is often associated with atheism, agnosticism, and secularism, but it can also be held by theists who believe that reason and faith are compatible.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"✗ Antifideism is a type of faith.","correct":"✓ Antifideism is opposition to faith.","note":"Antifideism is the opposition to faith, not a type of faith itself."},{"incorrect":"✗ Antifideism means believing in all religions.","correct":"✓ Antifideism means opposing faith, especially when it contradicts reason.","note":"Antifideism opposes faith that is not based on reason, not the belief in all religions."}],"priority":"中"},"related_words":{"derivatives":["antifideist (反信仰主義者)"],"related_terms":["fideism (信仰主義)","rationalism (合理主義)","skepticism (懐疑主義)","atheism (無神論)","agnosticism (不可知論)"],"priority":"高"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低","priority":"低"},"readability_explanation":{"level":"C2","text":"Antifideism is a complex philosophical term that refers to the opposition to fideism. Fideism is the view that faith is independent of reason. Therefore, antifideism asserts that religious beliefs should be subject to rational scrutiny and not be accepted without evidence or justification. This term is typically encountered in philosophical or theological discussions.","priority":"高"},"example_sentences":[{"sentence":"His antifideism led him to question the basis of all religious claims.","translation":"彼の反信仰主義は、すべての宗教的主張の根拠を疑問視させた。","type":"general","meaning_category":"一般的な使用例"},{"sentence":"Antifideism is often associated with the Enlightenment emphasis on reason.","translation":"反信仰主義は、しばしば啓蒙主義における理性の重視と関連付けられる。","type":"historical context","meaning_category":"歴史的背景"},{"sentence":"The debate between fideism and antifideism continues to shape discussions about the role of religion in society.","translation":"信仰主義と反信仰主義の間の議論は、社会における宗教の役割に関する議論を形成し続けている。","type":"contemporary relevance","meaning_category":"現代的な関連性"}]}