{"word":"desanctification","priority":"low","meanings":[{"part_of_speech":"noun","definition":"The act of removing the sacred status or character from something; the process of making something unholy or profane.","english_definition":"The act of divesting of sacredness or consecration; the act of making unholy or profane.","examples":[{"sentence":"The desanctification of the temple was a deliberate act of sacrilege.","translation":"その神殿の脱聖化は、意図的な冒涜行為であった。"},{"sentence":"Some argue that the commercialization of religious holidays leads to their desanctification.","translation":"宗教的な祝日の商業化は、それらの脱聖化につながると主張する人もいる。"}],"collocations":["act of desanctification","process of desanctification","cultural desanctification","religious desanctification"],"synonyms":["deconsecration","profanation","sacrilege","desecration","defilement"],"antonyms":["sanctification","consecration","blessing","veneration"]}],"etymology":{"value":"Formed from the prefix 'de-' (reversal or removal), 'sanctification' (the act of making holy), and ultimately from Latin 'sanctus' (holy).","priority":"medium"},"pronunciation":{"ipa":"/diːˌsæŋktɪfɪˈkeɪʃən/","syllables":"de-sanc-ti-fi-ca-tion"},"inflection":{"noun_plural":"desanctifications"},"usage_notes":{"explanation":"'Desanctification' refers to the reversal of sanctification. It implies a deliberate act or process that removes the sacred or holy status from something previously considered consecrated. It is often associated with religious contexts but can also be used more broadly to describe the loss of reverence or respect for something.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The desanctification was a good thing for the community.","correct":"The desanctification was seen as a negative event by the community.","note":"Desanctification typically carries a negative connotation, implying a loss of something valued or sacred."}],"priority":"low"},"related_words":{"derivatives":["desanctify (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"low"},"readability_explanation":{"level":"C2","text":"'Desanctification' is a relatively rare and complex term referring to the act of removing the sacred status from something. It is most often used in religious or historical contexts. Understanding this word requires a solid grasp of the word 'sanctification' and the prefix 'de-' indicating reversal or negation."},"example_sentences":[{"sentence":"The destruction of the ancient artifacts represented a profound act of desanctification.","translation":"古代の工芸品の破壊は、深遠な脱聖化の行為を意味した。","type":"general","meaning_category":"removal of sacred status"},{"sentence":"Some scholars argue that modern society is experiencing a widespread desanctification of traditional values.","translation":"一部の学者は、現代社会は伝統的な価値観の広範な脱聖化を経験していると主張している。","type":"cultural","meaning_category":"loss of reverence"}]}