{"word":"fromfile","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Unix) fromfile ユーティリティ","english_definition":"(Unix) A utility that creates a file containing a list of file names.","examples":[{"sentence":"The fromfile command is used to create a file containing a list of file names.","translation":"fromfileコマンドは、ファイル名のリストを含むファイルを作成するために使用されます。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(Python) fromfile 関数","english_definition":"(Python) A function in the NumPy library that creates an array from data in a file.","examples":[{"sentence":"The numpy.fromfile function can be used to efficiently read data from a binary file into an array.","translation":"numpy.fromfile関数を使用すると、バイナリファイルから配列にデータを効率的に読み込むことができます。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Combination of 'from' and 'file'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/frɒmfaɪl/","syllables":"from-file"},"inflection":{"noun_plural":"fromfiles"},"usage_notes":{"explanation":"'fromfile' is a term used in computing, specifically in Unix-like operating systems and in the Python programming language with the NumPy library. It refers to a utility or function that reads data or file names from a file to perform a specific task.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"Advanced","text":"'fromfile' is a technical term primarily encountered in computing contexts, particularly in Unix/Linux environments and Python programming using the NumPy library. Its usage is limited to these specific domains, making it less common in general English. Understanding its meaning requires familiarity with command-line utilities or Python programming concepts."},"example_sentences":[{"sentence":"Use the `fromfile` utility to generate a list of image files for processing.","translation":"`fromfile`ユーティリティを使用して、処理する画像ファイルのリストを生成します。","type":"noun","meaning_category":"Unix utility"},{"sentence":"The `numpy.fromfile` function allows you to load binary data directly into a NumPy array.","translation":"`numpy.fromfile`関数を使用すると、バイナリデータをNumPy配列に直接ロードできます。","type":"noun","meaning_category":"Python function"}]}