{"word":"goby","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ハゼ（鱥）","english_definition":"A fish of the family Gobiidae, typically small, bottom-dwelling, and often found in marine or brackish waters.","examples":[{"sentence":"The tide pool was teeming with small gobies.","translation":"その潮だまりは小さなハゼでいっぱいだった。"},{"sentence":"Gobies are often used as bait fish.","translation":"ハゼはしばしば餌魚として使われる。"},{"sentence":"The yellow goby is a brightly colored fish found in coral reefs.","translation":"キイロハゼはサンゴ礁で見られる鮮やかな色の魚である。"}],"collocations":["small goby","yellow goby","goby fish","goby species","goby population"],"synonyms":["mudskipper (一部のハゼ)"],"antonyms":[]}],"etymology":{"value":"From Latin gobius, from Ancient Greek κωβιός (kōbiós), a kind of small fish.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡoʊbi/","syllables":"go-by"},"inflection":{"noun_plural":"gobies"},"usage_notes":{"explanation":"Gobies are a very diverse family of fish, with many different species found all over the world. They are typically small and bottom-dwelling, and are often found in marine or brackish waters. Some species are also found in freshwater. They are an important part of the food chain in many ecosystems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a gobyes in the aquarium.","correct":"✓ I saw some gobies in the aquarium.","note":"'Goby' is a countable noun, so use the plural form 'gobies' when referring to more than one."}],"priority":"★☆☆"},"related_words":{"derivatives":["gobiid (adjective, relating to gobies or the Gobiidae family)"],"phrases":[]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'goby' refers to a type of fish. It's not a very common word unless you're interested in marine biology or fishing. The term is mostly used in scientific or specialized contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The scuba diver spotted a colorful goby hiding among the rocks.","translation":"スキューバダイバーは岩の間に隠れているカラフルなハゼを見つけた。","type":"noun","meaning_category":"fish"},{"sentence":"Many species of gobies are adapted to living in intertidal zones.","translation":"多くの種類のハゼは潮間帯での生活に適応している。","type":"noun","meaning_category":"fish"},{"sentence":"The aquarium featured a variety of small gobies from different regions.","translation":"その水族館は様々な地域からの小さなハゼを展示していた。","type":"noun","meaning_category":"fish"}]}