{"word":"un-Eucharistically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"Not in a Eucharistic manner; not relating to or characteristic of the Eucharist (Holy Communion).","english_definition":"In a way that is not related to or characteristic of the Eucharist (Holy Communion); not in a manner that reflects the principles or significance of the Eucharist.","examples":[{"sentence":"The bread was consumed un-Eucharistically, without reverence or spiritual reflection.","translation":"パンは、敬意や精神的な反省もなく、聖体拝領の精神に反して消費された。"},{"sentence":"He approached the sacrament un-Eucharistically, treating it as a mere ritual rather than a profound spiritual experience.","translation":"彼は聖餐に聖体拝領の精神に反して取り組み、それを深遠な精神的経験としてではなく、単なる儀式として扱った。"}],"collocations":["treat something un-Eucharistically","consume something un-Eucharistically","approach something un-Eucharistically"],"synonyms":["irreverently","disrespectfully","profanely","secularly","materialistically"],"antonyms":["reverently","respectfully","devoutly","spiritually","sacramentally"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the adverb 'Eucharistically'. 'Eucharistically' is derived from 'Eucharist', which comes from the Greek word 'eucharistia' meaning 'thanksgiving'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌn.juː.kəˈrɪs.tɪ.kli/","syllables":"un-Eu-cha-ris-ti-cal-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"The adverb 'un-Eucharistically' describes actions or attitudes that are contrary to the spirit and meaning of the Eucharist, which is a central sacrament in Christianity. It implies a lack of reverence, spiritual understanding, or appreciation for the sacredness of the Eucharist. The term is relatively rare and primarily used in theological or religious contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted un-Eucharistic.","correct":"✓ He acted un-Eucharistically.","note":"'Un-Eucharistic' is an adjective, whereas 'un-Eucharistically' is the adverb. Use the adverb to modify a verb (action)."},{"incorrect":"✗ The event was un-Eucharistically.","correct":"✓ The event was conducted un-Eucharistically.","note":"Ensure the adverb modifies a verb, describing how an action was performed, rather than simply describing a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["Eucharist (noun)","Eucharistic (adjective)","Eucharistically (adverb)","un-Eucharistic (adjective)"],"phrases":["celebrate the Eucharist","receive the Eucharist","Eucharistic adoration"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare, specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'un-Eucharistically' is a highly specialized and uncommon term. It is primarily used in theological or religious discussions to describe actions or attitudes that are contrary to the spirit and meaning of the Eucharist (Holy Communion). Understanding this word requires familiarity with Christian theology and the significance of the Eucharist as a sacrament. Because of its rarity and specific context, it is unlikely to be encountered outside of religious or academic settings."},"example_sentences":[{"sentence":"The meal was prepared and consumed un-Eucharistically, without any prayer or blessing.","translation":"食事は祈りや祝福もなく、聖体拝領の精神に反して準備され、消費された。","type":"adverb","meaning_category":"Manner of action"},{"sentence":"He treated the sacred elements un-Eucharistically, showing no respect for their spiritual significance.","translation":"彼は神聖な要素を聖体拝領の精神に反して扱い、それらの精神的な意義に対する敬意を示さなかった。","type":"adverb","meaning_category":"Manner of action"},{"sentence":"The service was conducted un-Eucharistically, focusing on social issues rather than spiritual reflection.","translation":"礼拝は聖体拝領の精神に反して行われ、精神的な反省よりも社会問題に焦点が当てられた。","type":"adverb","meaning_category":"Manner of action"}]}