{"word":"word-juggling","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"言葉遊び、言葉の曲芸、言葉を巧みに操ること","english_definition":"The clever and skillful use of words, often in a playful or deceptive way.","examples":[{"sentence":"The politician's speech was full of word-juggling, making it difficult to understand his true intentions.","translation":"その政治家の演説は言葉遊びに満ちており、彼の真意を理解するのは困難だった。"},{"sentence":"The comedian's word-juggling kept the audience laughing throughout the show.","translation":"そのコメディアンの言葉遊びは、ショーの間中、観客を笑わせ続けた。"},{"sentence":"Effective advertising often involves word-juggling to create memorable and persuasive slogans.","translation":"効果的な広告は、記憶に残る説得力のあるスローガンを作成するために、言葉遊びを伴うことが多い。"}],"collocations":["clever word-juggling","political word-juggling","verbal word-juggling","literary word-juggling"],"synonyms":["verbal dexterity","linguistic manipulation","rhetorical skill","artful language","sophistry"],"antonyms":["plain speaking","straightforward language","direct communication","unadorned language"]},{"part_of_speech":"verb","definition":"言葉遊びをする、言葉を巧みに操る","english_definition":"To use words in a clever and skillful way, often to entertain or deceive.","examples":[{"sentence":"The lawyer was accused of word-juggling to confuse the jury.","translation":"弁護士は、陪審員を混乱させるために言葉遊びをしていると非難された。"},{"sentence":"The writer word-juggled with metaphors and similes to create vivid imagery.","translation":"作家は、鮮やかなイメージを作り出すために、比喩や直喩を使って言葉遊びをした。"},{"sentence":"He enjoys word-juggling in his writing, creating puns and double entendres.","translation":"彼は文章の中で言葉遊びを楽しみ、駄洒落や二重の意味を作り出している。"}],"collocations":["word-juggling with metaphors","word-juggling to deceive","word-juggling for entertainment","word-juggling in writing"],"synonyms":["manipulate language","play with words","use rhetoric","employ sophistry","be verbally dexterous"],"antonyms":["speak plainly","communicate directly","use simple language","avoid ambiguity"]}],"etymology":{"value":"The term is a compound of 'word,' referring to language, and 'juggling,' which implies skillful manipulation and entertainment.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːrdˌdʒʌɡlɪŋ/","syllables":"word-jug-gling"},"inflection":{"noun_plural":"word-jugglings (rarely used)"},"usage_notes":{"explanation":"'Word-juggling' typically refers to the skillful and often deceptive use of language. It can be used positively to describe clever and entertaining uses of words, such as in comedy or literature, or negatively to describe manipulative or misleading language, such as in politics or advertising. The term implies a level of artistry and control over language.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is good at word-juggling with the truth.","correct":"✓ He is good at word-juggling, bending the truth to his advantage.","note":"The phrase 'word-juggling with the truth' is redundant. It's better to say 'He is good at word-juggling, bending the truth to his advantage.'"},{"incorrect":"✗ The speech was full of word-juggling and made no sense.","correct":"✓ The speech was full of word-juggling and lacked substance.","note":"'Made no sense' is too general. 'Lacked substance' or 'was superficial' is more specific and appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["word-juggler (noun: a person who is skilled at word-juggling)"],"phrases":["play on words","verbal gymnastics","rhetorical flourish","linguistic acrobatics"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. The term is not commonly used in everyday conversation but is more likely to appear in academic or literary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Word-juggling' is a term that describes the skillful and often playful manipulation of language. It implies a high level of verbal dexterity and can be used to describe both positive and negative uses of language. The term is not commonly used in everyday conversation but is more likely to appear in academic or literary contexts. Understanding the nuances of this term requires a strong vocabulary and an appreciation for the art of rhetoric."},"example_sentences":[{"sentence":"The lawyer's closing argument was a masterful display of word-juggling.","translation":"弁護士の最終弁論は、言葉遊びの見事な披露だった。","type":"noun","meaning_category":"言葉を巧みに操ること"},{"sentence":"The poet is known for word-juggling with metaphors and similes.","translation":"その詩人は、比喩や直喩を使った言葉遊びで知られている。","type":"verb","meaning_category":"言葉遊びをする"},{"sentence":"Political debates often involve word-juggling to avoid direct answers.","translation":"政治討論では、直接的な答えを避けるために言葉遊びがよく使われる。","type":"noun","meaning_category":"言葉を巧みに操ること"},{"sentence":"The comedian's act relied heavily on word-juggling and puns.","translation":"そのコメディアンの芸は、言葉遊びと駄洒落に大きく依存していた。","type":"noun","meaning_category":"言葉を巧みに操ること"}]}