{"word":"Dzungar","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ジュンガル人（17世紀から18世紀にかけて存在したオイラト族の遊牧民国家、およびその構成員）","english_definition":"A member of a western Mongolian group, the Oirat people, who formed a powerful nomadic empire in the 17th and 18th centuries. Also refers to the Dzungar language or the Dzungaria region.","examples":[{"sentence":"The Dzungars were known for their fierce warriors and skilled horsemanship.","translation":"ジュンガル人は、その勇敢な戦士と熟練した騎馬術で知られていた。"},{"sentence":"The Dzungar Khanate posed a significant threat to the Qing dynasty.","translation":"ジュンガル・ハン国は、清朝にとって重大な脅威であった。"}],"collocations":["Dzungar Khanate","Dzungar genocide","Dzungar language","Dzungar people","History of the Dzungars"],"synonyms":["Oirat","Kalmyk","Choros"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ジュンガル人の、ジュンガル人に関する","english_definition":"Relating to the Dzungar people, their language, or their history.","examples":[{"sentence":"Dzungar history is a complex and often tragic part of Central Asian history.","translation":"ジュンガルの歴史は、中央アジアの歴史の複雑で、しばしば悲劇的な一部である。"},{"sentence":"Dzungar culture was a blend of Mongolian and Tibetan influences.","translation":"ジュンガル文化は、モンゴルとチベットの影響が混ざり合ったものであった。"}],"collocations":["Dzungar culture","Dzungar empire","Dzungar war"],"synonyms":["Oirat"],"antonyms":[]}],"etymology":{"value":"「Dzungar」という名前は、モンゴル語の「左翼」を意味する「Züüngar」に由来する。これは、オイラト族が軍事編成において左翼を担当していたことに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒʊŋɡɑːr/","syllables":"Dzung-gar"},"inflection":{"notes":"名詞の複数形は Dzungars。形容詞は変化しません。"},"usage_notes":{"explanation":"「**Dzungar**」は、歴史的な文脈で使われることがほとんどです。17世紀から18世紀にかけて中央アジアに存在したジュンガル・ハン国とその人々を指します。ジュンガル人は、清朝との間で激しい戦争を繰り広げ、最終的に清朝によって滅ぼされました。この歴史的な背景を理解することが、この単語を正しく理解するために重要です。現代では、ジュンガル人の直接の子孫は、カルムイク人などとして知られています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Dzungar is a country in Central Asia.","correct":"✓ The Dzungars were a people who formed a nomadic empire in Central Asia.","note":"Dzungar は国名ではなく、民族集団の名前です。"},{"incorrect":"✗ The Dzungars still exist as a distinct nation today.","correct":"✓ The Dzungars were largely destroyed in the 18th century, although some descendants exist today as part of other groups like the Kalmyks.","note":"ジュンガル人は歴史的に存在した民族であり、現代では別の民族集団の一部として存在しています。"}],"priority":"★★☆"},"related_words":{"derivatives":["Dzungaria (ジュンガル盆地)","Oirat (オイラト)","Kalmyk (カルムイク)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 歴史的な文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Dzungar**」という言葉は、中央アジアの歴史、特に17世紀から18世紀にかけてのジュンガル・ハン国に関連する歴史的な用語です。ジュンガル人はオイラト・モンゴル人の一部であり、清朝との間で重要な紛争を繰り広げました。この言葉は、歴史的な文脈以外ではほとんど使用されず、その使用には中央アジアの歴史に関するある程度の知識が必要です。"},"example_sentences":[{"sentence":"The Qing dynasty's expansion led to conflicts with the **Dzungar** Khanate.","translation":"清朝の拡大は、ジュンガル・ハン国との紛争につながった。","type":"noun","meaning_category":"民族集団"},{"sentence":"The **Dzungar** genocide was a tragic event in the 18th century.","translation":"ジュンガル人の虐殺は、18世紀の悲劇的な出来事であった。","type":"adjective","meaning_category":"ジュンガル人に関する"},{"sentence":"The **Dzungars** controlled a vast territory in Central Asia.","translation":"ジュンガル人は中央アジアの広大な領土を支配していた。","type":"noun (plural)","meaning_category":"民族集団"}]}