{"word":"readvocation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再召集、再招集、再度の呼び出し","english_definition":"The act of calling back or summoning again; a second vocation or calling.","examples":[{"sentence":"The readvocation of the committee members was necessary to address the urgent issue.","translation":"緊急の問題に対処するため、委員会メンバーの再召集が必要だった。"},{"sentence":"After a period of inactivity, the readvocation of the project team signaled renewed commitment.","translation":"活動休止期間を経て、プロジェクトチームの再招集は新たな決意を示すものだった。"}],"collocations":["readvocation of members","readvocation of a team","urgent readvocation"],"synonyms":["recall","resummons","reconvening"],"antonyms":["discharge","dismissal"]}],"etymology":{"value":"The word 'readvocation' is formed by adding the prefix 're-' (meaning again or anew) to the word 'advocation,' which itself comes from the Latin 'advocare' (to call to one's aid). Therefore, 'readvocation' literally means 'to call again' or 'to summon again.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːædvəˈkeɪʃən/","syllables":"re-ad-vo-ca-tion"},"inflection":{"noun_plural":"readvocations"},"usage_notes":{"explanation":"'Readvocation' is a relatively rare word, primarily used in formal or technical contexts. It signifies the act of calling someone back to a duty, role, or position they previously held. It often implies a renewed or repeated summoning after a period of absence or inactivity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The readvocation was very simple.","correct":"✓ The readvocation process was very simple.","note":"'Readvocation' refers to the act itself, not the process. Use 'readvocation process' or similar to describe the steps involved."},{"incorrect":"✗ He was readvocated to the job.","correct":"✓ He was readvocated for the job. / ✓ He was recalled to the job.","note":"Use 'readvocated for' to indicate the reason for the readvocation. Alternatively, use a more common verb like 'recalled'."}],"priority":"★☆☆"},"related_words":{"derivatives":["re- (prefix meaning again)","advocation (noun: the act of advocating or calling to)","advocate (noun/verb: a person who supports or recommends; to support or recommend publicly)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Readvocation' is a formal and uncommon word. It is best used in professional or academic contexts when describing the act of recalling or summoning someone back to a role or duty after a period of absence. It is not suitable for general conversation and should be replaced with simpler terms like 'recall' or 'resummons' in informal settings."},"example_sentences":[{"sentence":"The company announced the readvocation of retired engineers to assist with the new project.","translation":"会社は、新しいプロジェクトを支援するために、退職したエンジニアの再召集を発表した。","type":"noun","meaning_category":"再召集"},{"sentence":"The readvocation of the emergency response team was triggered by the escalating crisis.","translation":"緊急対応チームの再招集は、エスカレートする危機によって引き起こされた。","type":"noun","meaning_category":"再招集"}]}