{"word":"non-voter","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"投票しない人、棄権者","english_definition":"a person who does not vote in an election.","examples":[{"sentence":"The campaign aims to encourage non-voters to participate in the election.","translation":"そのキャンペーンは、棄権者に選挙への参加を促すことを目的としている。"},{"sentence":"Many non-voters feel that their vote doesn't make a difference.","translation":"多くの棄権者は、自分の一票が変化をもたらさないと感じている。"},{"sentence":"Understanding the reasons behind non-voting is crucial for improving voter turnout.","translation":"投票しない理由を理解することは、投票率を向上させるために重要である。"}],"collocations":["registered non-voter (登録されている棄権者)","habitual non-voter (常習的な棄権者)","potential non-voter (潜在的な棄権者)","target non-voters (ターゲットとなる棄権者)"],"synonyms":["abstainer","electorate dropout","disengaged voter"],"antonyms":["voter","elector","participant"],"related_terms":["voter turnout","election","suffrage","apathy","political participation"]}],"etymology":{"value":"'Non-' (否定の接頭辞) + 'voter' (投票者)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈvoʊtər/","syllables":"non-vot-er"},"inflection":{"noun_plural":"non-voters"},"usage_notes":{"explanation":"The term 'non-voter' refers to individuals who are eligible to vote but choose not to participate in elections. Reasons for not voting can vary widely, including apathy, disillusionment with the political process, logistical barriers, or a belief that their vote will not make a difference. Understanding the demographics and motivations of non-voters is a key focus for political campaigns and researchers aiming to increase voter turnout and ensure broader representation in government.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non voter of the election.","correct":"✓ He is a non-voter in the election.","note":"Use 'in' to specify the election. Alternatively, 'He is a non-voter.' is also correct."},{"incorrect":"✗ Non voters are not important to consider.","correct":"✓ Non-voters are important to consider.","note":"The statement itself is incorrect. Non-voters are important to consider in political analysis."}],"priority":"★★☆"},"related_words":{"derivatives":["non-voting (adj.)"],"related_terms":["voter","voting","election","abstain","apathy","suffrage","political participation","disenfranchisement"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in political discussions.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term 'non-voter' is used to describe someone who chooses not to vote in an election. It's a straightforward term, but understanding the context in which it's used is important. Often, discussions about non-voters involve analyzing reasons for their lack of participation and strategies to encourage them to vote. The word itself is not complex, but the underlying political and social issues can be.","priority":"★★★"},"example_sentences":[{"sentence":"The study examined the attitudes of young non-voters towards politics.","translation":"その研究は、若い棄権者の政治に対する態度を調査した。","type":"general","meaning_category":"general"},{"sentence":"Political parties are trying to appeal to non-voters with promises of change.","translation":"政党は、変化の約束によって棄権者にアピールしようとしている。","type":"political","meaning_category":"political"},{"sentence":"The low voter turnout was attributed to a large number of non-voters.","translation":"低い投票率は、多数の棄権者がいたことに起因するとされた。","type":"statistical","meaning_category":"statistical"}]}