{"word":"Indamine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A brand name for a type of thiazide-like diuretic medication, also known as indapamide.","english_definition":"A brand name for a type of thiazide-like diuretic medication, also known as indapamide. It is used to treat high blood pressure and edema.","examples":[{"sentence":"My doctor prescribed Indamine to help lower my blood pressure.","translation":"私の医者は血圧を下げるためにインダミンを処方しました。"}],"collocations":["take Indamine","Indamine tablet","Indamine dosage"],"synonyms":["Indapamide"],"antonyms":[]}],"etymology":{"value":"Derived from the chemical structure of the drug.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɪndəmiːn/","syllables":"In-da-mine"},"inflection":{},"usage_notes":{"explanation":"'Indamine' is a brand name, so it is capitalized. It is often used interchangeably with the generic name 'indapamide', but 'indapamide' is the preferred term in formal medical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I take indamine for my headache.","correct":"✓ I take indamine for my high blood pressure.","note":"Indamine is a diuretic and is used to treat high blood pressure and edema, not headaches."}],"priority":"★★★"},"related_words":{"derivatives":["Indapamide","Diuretic","Thiazide"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★★★"},"readability_explanation":{"level":"C1","text":"'Indamine' is a specific medication used to treat high blood pressure. It is a brand name, and the generic name is 'indapamide'. This word is typically encountered in medical contexts or when discussing prescription medications."},"example_sentences":[{"sentence":"The pharmacist confirmed that Indamine was the correct medication for my condition.","translation":"薬剤師は、インダミンが私の症状に合った正しい薬であることを確認しました。","type":"noun","meaning_category":"medication"},{"sentence":"Before starting Indamine, I discussed potential side effects with my doctor.","translation":"インダミンを開始する前に、潜在的な副作用について医師と話し合いました。","type":"noun","meaning_category":"medication"}]}