{"word":"twice-blamed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"二重に非難される、二度責められる","english_definition":"Being blamed or criticized twice; doubly blamed.","examples":[{"sentence":"The project manager felt twice-blamed when the project failed, as he was blamed for both the planning and the execution.","translation":"プロジェクトマネージャーは、計画と実行の両方で非難されたため、プロジェクトが失敗したとき、二重に責められていると感じた。"}],"collocations":["twice-blamed victim","twice-blamed for failure"],"synonyms":["doubly criticized","repeatedly blamed"],"antonyms":["praised","commended"]}],"etymology":{"value":"Formed from 'twice' and 'blamed'. 'Twice' refers to occurring two times or doubled. 'Blamed' is the past participle of 'blame', meaning to assign responsibility for a fault or wrong.","priority":"N/A"},"pronunciation":{"ipa":"/ˌtwaɪsˈbleɪmd/","syllables":"twice-blamed"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative constructions (e.g., 'more twice-blamed')."},"usage_notes":{"explanation":"The term 'twice-blamed' is relatively uncommon and often used in contexts where someone feels unfairly or excessively criticized. It suggests a situation where blame is layered or repeated, possibly unjustly.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He was twice blame for the mistake.","correct":"✓ He was twice blamed for the mistake.","note":"'Blamed' is the past participle and should be used with an auxiliary verb (e.g., 'was')."},{"incorrect":"✗ She felt twice blaming after the incident.","correct":"✓ She felt twice-blamed after the incident.","note":"'Twice-blamed' is the correct form to describe the state of being blamed twice."}],"priority":"N/A"},"related_words":{"derivatives":["blame","blamed","twice","double-blame"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'twice-blamed' is a complex adjective indicating that someone has been blamed or criticized on two separate occasions or for two distinct reasons. The word is not commonly used and would likely appear in more sophisticated writing or speech. Understanding requires a grasp of both 'twice' and 'blamed' and how they combine to create this specific meaning."},"example_sentences":[{"sentence":"The whistleblower felt twice-blamed: first for the company's actions, and then for revealing them.","translation":"内部告発者は、まず会社の行動について、次にそれを明らかにしたことについて、二重に非難されていると感じた。","type":"adjective","meaning_category":"二重に非難される"},{"sentence":"As the project lead, she was twice-blamed when the initiative failed to meet its objectives.","translation":"プロジェクトリーダーとして、彼女はイニシアチブが目標を達成できなかったとき、二重に非難された。","type":"adjective","meaning_category":"二重に非難される"}]}