{"word":"underprotection","priority":"low","meanings":[{"part_of_speech":"noun","definition":"保護不足、過小保護","english_definition":"Insufficient protection; the state of not being adequately protected.","examples":[{"sentence":"The child suffered from underprotection due to neglect.","translation":"その子供はネグレクトにより保護不足に苦しんだ。"},{"sentence":"The witness claimed underprotection by the police.","translation":"その証人は警察による保護が不十分だと主張した。"},{"sentence":"The endangered species faces underprotection in its natural habitat.","translation":"その絶滅危惧種は自然生息地において保護不足に直面している。"}],"collocations":["child underprotection (児童保護不足)","witness underprotection (証人保護不足)","environmental underprotection (環境保護不足)"],"synonyms":["lack of protection","insufficient safeguarding","inadequate defense"],"antonyms":["overprotection","excessive protection"]},{"part_of_speech":"noun","definition":"(法律) 法の下の保護の欠如、平等な保護の欠如","english_definition":"(Law) The state of not receiving equal protection under the law.","examples":[{"sentence":"The lawsuit alleged underprotection based on racial discrimination.","translation":"その訴訟は人種差別に基づく保護の欠如を主張した。"},{"sentence":"The group argued that they were experiencing underprotection under the current legislation.","translation":"そのグループは、現在の法律の下で保護が不十分であると主張した。"}],"collocations":["equal underprotection (平等な保護の欠如)","legal underprotection (法的保護の欠如)"],"synonyms":["unequal protection","lack of equal protection"],"antonyms":["equal protection","fair treatment"]}],"etymology":{"value":"'Under-' (不足) + 'protection' (保護)","priority":"medium"},"pronunciation":{"ipa":"/ˌʌndərprəˈtekʃən/","syllables":"un-der-pro-tec-tion"},"inflection":{"noun_plural":"underprotections"},"usage_notes":{"explanation":"'Underprotection' refers to a situation where something or someone is not adequately protected from harm or danger. It can apply to various contexts, including child welfare, environmental conservation, and legal rights. In legal contexts, it often refers to a violation of equal protection under the law.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The underprotection of the environment is a serious problem.","correct":"The lack of protection for the environment is a serious problem.","note":"While 'underprotection' is a valid word, using phrases like 'lack of protection' can sometimes sound more natural."}],"priority":"low"},"related_words":{"derivatives":["protect","protection","underprotected"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"'Underprotection' is a relatively uncommon word that describes a situation where something or someone is not adequately protected. It's often used in discussions about legal rights, child welfare, or environmental conservation. The word is formed by adding the prefix 'under-' to 'protection,' indicating a deficiency or lack of protection. Understanding the contexts in which this word is used requires a good grasp of abstract concepts and specialized vocabulary."},"example_sentences":[{"sentence":"The report highlighted the underprotection of whistleblowers in the workplace.","translation":"その報告書は職場における内部告発者の保護不足を強調した。","type":"noun","meaning_category":"保護不足"},{"sentence":"Critics argue that current regulations lead to the underprotection of marine ecosystems.","translation":"批評家たちは、現在の規制が海洋生態系の保護不足につながると主張している。","type":"noun","meaning_category":"保護不足"},{"sentence":"The lawyer argued that his client suffered from underprotection under the current laws.","translation":"弁護士は、彼の依頼人が現在の法律の下で保護不足に苦しんでいると主張した。","type":"noun","meaning_category":"法的保護の欠如"}]}