{"word":"Bayesian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ベイズの、ベイズ統計の","english_definition":"Relating to or using Bayes' theorem or Bayesian statistics.","examples":[{"sentence":"Bayesian methods are used in machine learning.","translation":"ベイズ的な手法は機械学習で用いられます。"},{"sentence":"The Bayesian approach provides a framework for updating beliefs in light of new evidence.","translation":"ベイズ的アプローチは、新たな証拠に照らして信念を更新するための枠組みを提供します。"}],"collocations":["Bayesian inference (ベイズ推論)","Bayesian network (ベイズネットワーク)","Bayesian statistics (ベイズ統計)","Bayesian analysis (ベイズ分析)","Bayesian model (ベイズモデル)"],"synonyms":["probabilistic","statistical"],"antonyms":[]}],"etymology":{"value":"Named after Thomas Bayes (c. 1701–1761), an English statistician, philosopher, and Presbyterian minister who formulated Bayes' theorem.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbeɪziən/","syllables":"Bay-si-an"},"inflection":{"notes":"This word typically functions as an adjective. It can sometimes be used as a noun to refer to someone who uses Bayesian methods, but this is less common."},"usage_notes":{"explanation":"'Bayesian' refers to concepts, methods, or models that utilize Bayes' theorem, a fundamental principle in probability theory. Bayes' theorem describes how to update the probability of a hypothesis based on new evidence. Bayesian approaches are widely used in statistics, machine learning, and other fields where reasoning under uncertainty is important.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Baysean statistics is difficult.","correct":"✓ Bayesian statistics is difficult.","note":"The correct spelling is 'Bayesian', not 'Baysean'."},{"incorrect":"✗ He is a Bayes person.","correct":"✓ He is a Bayesian.","note":"While less common, 'Bayesian' can be used as a noun to refer to a person who uses Bayesian methods. However, 'Bayes person' is not standard."}],"priority":"★★☆"},"related_words":{"derivatives":["Bayes' theorem (ベイズの定理)","Bayesianism (ベイズ主義)"],"phrases":["prior probability (事前確率)","posterior probability (事後確率)","likelihood (尤度)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Bayesian' is a technical term primarily used in statistics, probability theory, and related fields like machine learning. It describes methods or approaches that use Bayes' theorem to update probabilities based on new evidence. Understanding the term requires some familiarity with probability and statistics. While not a common word in everyday conversation, it is essential in specific academic and professional contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Bayesian methods are particularly useful when dealing with incomplete or uncertain data.","translation":"ベイズ的な手法は、不完全または不確かなデータを扱う際に特に役立ちます。","type":"adjective","meaning_category":"Methodology"},{"sentence":"A Bayesian network is a probabilistic graphical model that represents the conditional dependencies between variables.","translation":"ベイズネットワークは、変数間の条件付き依存関係を表す確率的グラフィカルモデルです。","type":"adjective","meaning_category":"Modeling"},{"sentence":"She is a strong proponent of the Bayesian approach to statistical inference.","translation":"彼女は統計的推論に対するベイズ的アプローチの強力な支持者です。","type":"adjective","meaning_category":"Statistics"}]}