{"word":"Phoresis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"担送、匍匐輸送：ある生物が別の生物に付着して運ばれる共生関係の一種","english_definition":"A type of symbiosis in which one organism (the phoretic) is transported by another organism (the host), typically without either organism being harmed or benefited.","examples":[{"sentence":"Phoresis is commonly observed with mites attaching to insects for dispersal.","translation":"担送は、分散のために昆虫に付着するダニによく見られる。"},{"sentence":"The pseudoscorpion exhibits phoresis by clinging to larger insects.","translation":"カニムシは、より大きな昆虫にしがみつくことによって担送を示す。"}],"collocations":["exhibit phoresis","phoretic mite","phoretic relationship","obligate phoresis","facultative phoresis"],"synonyms":["transportation","dispersal","hitchhiking"],"antonyms":["parasitism","mutualism"]},{"part_of_speech":"noun","definition":"（電気泳動における）電気浸透","english_definition":"(In electrophoresis) The movement of a liquid relative to a stationary solid phase under the influence of an applied electric field.","examples":[{"sentence":"Electroosmotic flow can cause phoresis of molecules in electrophoresis.","translation":"電気浸透流は、電気泳動における分子の担送を引き起こす可能性がある。"}],"collocations":["electroosmotic phoresis","capillary electrophoresis","microchip electrophoresis"],"synonyms":["electroosmosis","electroosmotic flow"]}],"etymology":{"value":"From Greek 'phoreō' (φορέω) meaning 'to carry' or 'bear'.","priority":"★★★"},"pronunciation":{"ipa":"/fəˈriːsɪs/","syllables":"pho-re-sis"},"inflection":{"noun_plural":"phoreses"},"usage_notes":{"explanation":"In biology, phoresis describes a symbiotic relationship where one organism uses another for transportation. This is distinct from parasitism (where one benefits at the expense of the other) and mutualism (where both benefit). In the context of electrophoresis, phoresis refers to the movement of a liquid due to an electric field, influencing the movement of molecules.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mite is a parasite because it exhibits phoresis.","correct":"✓ The mite exhibits phoresis, which is a form of symbiosis distinct from parasitism.","note":"Phoresis is a type of symbiosis, but not parasitism. Parasitism involves harm to the host, while phoresis typically does not."}],"priority":"★☆☆"},"related_words":{"derivatives":["phoretic (adjective)"],"related_terms":["symbiosis","parasitism","mutualism","commensalism","electrophoresis","electroosmosis"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Phoresis' is a technical term primarily used in biology and chemistry. In biology, it refers to a specific type of symbiotic relationship where one organism hitches a ride on another for transportation, without causing harm or benefit to the host. In chemistry, particularly in the context of electrophoresis, it refers to the movement of a liquid under the influence of an electric field. Understanding this term requires a background in either of these fields."},"example_sentences":[{"sentence":"Many insects facilitate the phoresis of mites, aiding in their dispersal to new habitats.","translation":"多くの昆虫はダニの担送を促進し、新しい生息地への分散を助ける。","type":"noun","meaning_category":"Biology"},{"sentence":"Electroosmotic phoresis is a crucial factor to consider in microchip electrophoresis.","translation":"電気浸透担送は、マイクロチップ電気泳動において考慮すべき重要な要素である。","type":"noun","meaning_category":"Chemistry"}]}