{"word":"waham","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Islam) Weakness, frailty, or love of the world that causes Muslims to lose sight of the afterlife and become weak.","english_definition":"A term used in Islam to describe a state of weakness, frailty, or excessive love of worldly possessions and life, which causes Muslims to lose sight of the importance of the afterlife and spiritual matters, leading to a decline in their strength and unity.","examples":[{"sentence":"The Imam warned the congregation about the dangers of waham, urging them to focus on their spiritual development.","translation":"イマームは会衆にワハムの危険性について警告し、精神的な成長に集中するように促した。"},{"sentence":"Some scholars believe that waham is a major cause of the decline in the Muslim world's influence.","translation":"一部の学者は、ワハムがイスラム世界の勢力衰退の主な原因であると考えている。"}],"collocations":["dangers of waham","cause of waham","overcome waham","avoid waham"],"synonyms":["worldliness","materialism","negligence","heedlessness"],"antonyms":["asceticism","piety","devotion","mindfulness"]}],"etymology":{"value":"Derived from Arabic وھم (wahm), meaning illusion, delusion, or weakness.","priority":"★★★"},"pronunciation":{"ipa":"/wɑːˈhɑːm/","syllables":"wa-ham"},"inflection":{"notes":"Singular noun. No plural form is commonly used."},"usage_notes":{"explanation":"'Waham' is a concept often discussed in Islamic sermons and writings, particularly when addressing issues of moral and spiritual decline. It is seen as a condition that can affect both individuals and entire communities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The waham of the building collapsed.","correct":"The building collapsed.","note":"'Waham' refers to a state of mind or condition, not a physical object. Therefore, it cannot be used to describe the collapse of a building."},{"incorrect":"He is suffering from waham because he has a cold.","correct":"He is suffering from waham because he is too attached to worldly things.","note":"'Waham' is not related to physical illness but to spiritual or moral weakness due to excessive attachment to worldly life."}],"priority":"★★☆"},"related_words":{"derivatives":["wahmi (adjective: illusory, imaginary)"],"phrases":["Dunya (the world)","Akhirah (the afterlife)","Zuhd (asceticism)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used within Islamic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Waham' is a term used within Islamic discourse to describe a state of spiritual weakness caused by excessive attachment to worldly life. It is a relatively abstract concept and requires an understanding of Islamic values to fully grasp its meaning. The term is not commonly used outside of religious or scholarly discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The scholar spoke at length about how waham can lead to the corruption of society.","translation":"学者は、ワハムが社会の腐敗につながる可能性について詳しく語った。","type":"noun","meaning_category":"spiritual weakness"},{"sentence":"Many Islamic leaders warn against the dangers of succumbing to waham in the pursuit of wealth and power.","translation":"多くのイスラム指導者は、富と権力を追求する際にワハムに屈することの危険性について警告している。","type":"noun","meaning_category":"spiritual weakness"}]}