{"word":"transliteration","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"翻字、音訳","english_definition":"The process of transferring a word from the alphabet of one language to another, typically by replacing letters with corresponding letters or combinations of letters. It aims to represent the pronunciation of the original word as closely as possible in the target language.","examples":[{"sentence":"The transliteration of the Russian word 'Здравствуйте' is 'Zdravstvuyte'.","translation":"ロシア語の単語「Здравствуйте」の翻字は「Zdravstvuyte」です。"},{"sentence":"Transliteration is important for representing names and places in different languages.","translation":"翻字は、異なる言語で名前や場所を表現するために重要です。"},{"sentence":"There are different systems of transliteration for the same language.","translation":"同じ言語でも、異なる翻字システムが存在します。"}],"collocations":["system of transliteration","standard transliteration","romanization (a specific type of transliteration to the Roman alphabet)"],"synonyms":["romanization","transcription","phonetic transcription"],"antonyms":["translation (翻訳)"],"related_words":["transliterate (verb: 翻字する)","transliterated (adjective: 翻字された)"]}],"etymology":{"value":"From 'trans-' (across, beyond) + 'literation' (writing letters).","priority":"★★☆"},"pronunciation":{"ipa":"/trænzˌlɪtəˈreɪʃən/","syllables":"trans-lit-er-a-tion"},"inflection":{"noun_plural":"transliterations"},"usage_notes":{"explanation":"Transliteration focuses on representing the letters or sounds of a word in another alphabet, whereas translation focuses on conveying the meaning. Transliteration is often used when a direct translation is not possible or when the pronunciation of the original word is important. Romanization is a specific type of transliteration that converts non-Latin scripts into the Latin (Roman) alphabet.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Transliteration is the same as translation.","correct":"Transliteration is not the same as translation; it focuses on representing the sounds or letters, not the meaning.","note":"Transliteration and translation are different processes. Transliteration focuses on representing the letters or sounds, while translation focuses on conveying the meaning."}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Transliteration' is a process of converting text from one writing system to another based on phonetic or letter correspondence. It's different from 'translation,' which focuses on meaning. Transliteration is useful for representing names or words when a direct translation isn't possible, aiming to preserve the original pronunciation as closely as possible. Different systems may exist for the same language, and it's often used in academic or linguistic contexts."},"example_sentences":[{"sentence":"The document included a transliteration of the ancient text.","translation":"その文書には、古代のテキストの翻字が含まれていました。","type":"example"},{"sentence":"She used a standard system of transliteration to convert the Cyrillic text to Roman letters.","translation":"彼女はキリル文字のテキストをローマ字に変換するために、標準的な翻字システムを使用しました。","type":"example"},{"sentence":"The library catalog provides both the original script and the transliteration for each book.","translation":"図書館の目録には、各書籍の元の文字と翻字の両方が記載されています。","type":"example"}]}