{"word":"sociometry","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"社会測定学、ソシオメトリー","english_definition":"a quantitative method for measuring social relationships.","examples":[{"sentence":"Sociometry can be used to study group dynamics in the classroom.","translation":"社会測定学は、教室での集団力学を研究するために使用できます。"},{"sentence":"The sociometry test revealed the popular members of the team.","translation":"社会測定学テストは、チームの人気メンバーを明らかにしました。"}],"collocations":["sociometric test (社会測定テスト)","sociometric analysis (社会測定分析)","apply sociometry (社会測定学を適用する)","sociometric data (社会測定データ)"],"synonyms":["social network analysis","relationship mapping"],"antonyms":[]}],"etymology":{"value":"'socio-' (社会) + '-metry' (測定) から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsoʊsiˈɒmətri/","syllables":"so-ci-om-e-try"},"inflection":{"noun_plural":"sociometries"},"usage_notes":{"explanation":"Sociometry is a method developed by Jacob L. Moreno to quantitatively assess social relationships within a group. It involves asking individuals to identify those they prefer to work with, associate with, or avoid. The results are then often visualized in a sociogram, a graphical representation of social links. It is used in various fields such as education, psychology, and sociology to understand group dynamics, identify isolates, and promote social cohesion.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used sociology to analyze the group.","correct":"✓ He used sociometry to analyze the group.","note":"Sociology is the study of society, while sociometry is a specific method for measuring social relationships within a group."},{"incorrect":"✗ The sociometry was very social.","correct":"✓ The sociometry results showed the social structure.","note":"Sociometry is a method, not a characteristic. The results of sociometry can reveal social characteristics."}],"priority":"★★☆"},"related_words":{"derivatives":["sociometric (adjective: 社会測定の)","sociogram (noun: ソシオグラム、社会関係図)"],"phrases":["social network analysis (社会ネットワーク分析)","group dynamics (集団力学)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Sociometry is a specialized term referring to a research method used to measure social relationships within a group. It involves individuals indicating their preferences for interaction with others, and the data is then analyzed to understand group dynamics and social structures. This term is primarily used in academic and research contexts within fields like sociology, psychology, and education."},"example_sentences":[{"sentence":"The teacher used sociometry to understand the social dynamics of her classroom.","translation":"先生は、教室の社会力学を理解するために社会測定法を使用しました。","type":"general"},{"sentence":"A sociogram is a visual representation of the data collected through sociometry.","translation":"ソシオグラムは、社会測定法を通じて収集されたデータの視覚的な表現です。","type":"definition"},{"sentence":"Sociometry can help identify isolated individuals within a group.","translation":"社会測定法は、グループ内の孤立した個人を特定するのに役立ちます。","type":"application"},{"sentence":"The researchers applied sociometry to analyze the team's communication patterns.","translation":"研究者たちは、チームのコミュニケーションパターンを分析するために社会測定法を適用しました。","type":"research"},{"sentence":"Sociometry is a tool for improving social cohesion in organizations.","translation":"社会測定法は、組織における社会的結束を改善するためのツールです。","type":"benefit"}]}