{"word":"nodical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(天文学)交点に関する、交点周期の","english_definition":"Relating to a node, especially the ascending or descending node of an orbit; relating to the nodical period.","examples":[{"sentence":"The nodical period of the Moon is shorter than its sidereal period due to the precession of the lunar orbit.","translation":"月の交点周期は、月軌道の歳差運動のため、恒星周期よりも短い。"},{"sentence":"Nodical precession affects the orientation of a satellite's orbit over time.","translation":"交点歳差は、時間の経過とともに衛星軌道の向きに影響を与える。"}],"collocations":["nodical period","nodical precession","nodical cycle"],"synonyms":["orbital","astronomical","nodal"],"antonyms":[]}],"etymology":{"value":"Derived from 'node' (Latin nodus, 'knot') + '-ical'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnɒdɪkəl/","syllables":"no-di-cal"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Nodical' is a technical term primarily used in astronomy and related fields. It refers to phenomena associated with the nodes of an orbit, particularly the points where an orbiting body crosses a reference plane, such as the ecliptic. The nodical period is the time it takes for an orbiting body to return to the same node.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nodical day was very long.","correct":"✓ The sidereal day was very long.","note":"'Nodical' refers to orbital nodes, not to days. Use 'sidereal' for the length of a day relative to the stars."}],"priority":"★☆☆"},"related_words":{"derivatives":["node","nodal"],"phrases":["ascending node","descending node","nodical period","nodical cycle"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'nodical' is highly specialized and primarily used within the context of astronomy and orbital mechanics. It describes properties or periods related to the nodes of an orbit, which are the points where an orbiting object crosses a reference plane. Understanding this term requires a solid foundation in astronomical concepts."},"example_sentences":[{"sentence":"The satellite's nodical period is carefully calculated to maintain its orbital stability.","translation":"衛星の交点周期は、軌道の安定性を維持するために慎重に計算される。","type":"adjective","meaning_category":"交点周期の"},{"sentence":"Nodical variations in the Earth's orbit affect long-term climate patterns.","translation":"地球の軌道の交点変動は、長期的な気候パターンに影響を与える。","type":"adjective","meaning_category":"交点に関する"}]}