{"word":"Schwanpan","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(German, regional) A type of flat, wide pan used for cooking, especially for making pancakes or similar dishes.","english_definition":"A type of flat, wide pan used for cooking, especially for making pancakes or similar dishes, common in some regions of Germany.","examples":[{"sentence":"Sie benutzte eine Schwanpan, um die Pfannkuchen zu backen.","translation":"She used a Schwanpan to bake the pancakes."}],"collocations":["Pfannkuchen in der Schwanpan backen (bake pancakes in the Schwanpan)","eine große Schwanpan (a large Schwanpan)"],"synonyms":["Pfannkuchenpfanne (pancake pan)","Bratpfanne (frying pan)"],"antonyms":[]}],"etymology":{"value":"Likely a regional German term, possibly derived from the shape or origin of the pan. Further research needed to confirm the exact etymology.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈʃvaːnpaːn/","syllables":"Schwan-pan"},"inflection":{"noun_plural":"Schwanpannen"},"usage_notes":{"explanation":"The term 'Schwanpan' is primarily used in specific regions of Germany and might not be widely understood throughout the country. It refers to a particular type of pan suitable for cooking pancakes or similar dishes. It is important to note that this term might be considered dialectal or regional.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a schwanpan for cooking soup.","correct":"✓ I bought a pot for cooking soup.","note":"A Schwanpan is specifically for flat foods like pancakes, not for liquids like soup."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_nouns":["Pfannkuchen (pancake)","Pfanne (pan)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, regional term.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Schwanpan' is a regional German term for a specific type of flat pan used for cooking pancakes or similar dishes. It is not a widely known word, even within Germany, and is more likely to be encountered in specific regional contexts or older cookbooks. Understanding this term requires some familiarity with regional German dialects and culinary traditions."},"example_sentences":[{"sentence":"Meine Oma hat immer die besten Kartoffelpuffer in ihrer alten Schwanpan gemacht.","translation":"My grandma always made the best potato pancakes in her old Schwanpan.","type":"noun","meaning_category":"cooking pan"}]}