{"word":"Cryptoprocta","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"フォッサ (マダガスカルに生息する食肉類)","english_definition":"A genus of euplerid carnivores native to Madagascar, containing the fossa (Cryptoprocta ferox) and the extinct giant fossa (Cryptoprocta spelea).","examples":[{"sentence":"The Cryptoprocta is a unique predator found only in Madagascar.","translation":"クリプトプロクタはマダガスカルにのみ生息する珍しい捕食動物です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Ancient Greek words κρυπτός (kryptós, “hidden”) and πρωκτός (prōktós, “anus”), referring to the animal's concealed anus.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrɪptoʊˈprɒktə/","syllables":"cryp-to-proc-ta"},"inflection":{"noun_plural":"Cryptoproctas"},"usage_notes":{"explanation":"'Cryptoprocta' is a scientific genus name, primarily used in zoology and related fields. In general conversation, the common name 'fossa' is preferred.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Cryptoprocta ferox (fossa)","Cryptoprocta spelea (giant fossa - extinct)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Cryptoprocta' is a scientific term referring to a genus of carnivores native to Madagascar. It's rarely used outside of scientific contexts. The common name 'fossa' is much more frequently used in general discussions about the animal."},"example_sentences":[{"sentence":"The genus Cryptoprocta includes two known species: the extant Cryptoprocta ferox and the extinct Cryptoprocta spelea.","translation":"クリプトプロクタ属には、現生のクリプトプロクタ・フェロックスと絶滅したクリプトプロクタ・スペレアの2種が知られています。","type":"scientific","meaning_category":"taxonomy"},{"sentence":"Research on Cryptoprocta genetics has revealed important insights into the evolution of Malagasy carnivores.","translation":"クリプトプロクタの遺伝学に関する研究は、マダガスカルの食肉類の進化に関する重要な洞察を明らかにしました。","type":"scientific","meaning_category":"zoology"}]}