{"word":"tanzy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"タンジー：キク科ヨモギギク属の多年草。","english_definition":"A perennial, herbaceous flowering plant in the aster family (Asteraceae), native to temperate Europe and Asia.","examples":[{"sentence":"The garden was filled with the strong scent of tanzy.","translation":"庭はタンジーの強い香りで満たされていた。"}],"collocations":["grow tanzy","tanzy tea"],"synonyms":["tansy"],"antonyms":[]}],"etymology":{"value":"The word \"tanzy\" comes from the Medieval Latin word \"tanacetum,\" which is derived from the Ancient Greek word \"athanasia,\" meaning \"immortality.\" This is likely due to the plant's long-lasting flowers and perceived medicinal properties.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtænzi/","syllables":"tan-zy"},"inflection":{"noun_plural":"tanzies"},"usage_notes":{"explanation":"Tanzy is primarily used as a noun to refer to the plant itself. It's not a commonly used word in everyday conversation but may appear in botanical or gardening contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She put tanzy in the soup for flavor.","correct":"✓ She used tansy leaves in the soup for flavor.","note":"While tansy was historically used as a flavoring, it's now known to be toxic in large quantities. It's better to specify 'tansy leaves' to avoid any confusion about its safe usage."}],"priority":"★★☆"},"related_words":{"derivatives":["tanacetum (genus name)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very low frequency)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Tanzy\" refers to a specific plant, so understanding requires some botanical knowledge. It's not a common word, and usage is typically limited to contexts involving gardening, herbalism, or botany.","priority":"★★☆"},"example_sentences":[{"sentence":"The medieval garden featured a variety of herbs, including tanzy, for medicinal purposes.","translation":"中世の庭には、薬用としてタンジーを含む様々なハーブが植えられていた。","type":"noun","meaning_category":"plant"},{"sentence":"Bees were attracted to the bright yellow flowers of the tanzy.","translation":"ハチはタンジーの鮮やかな黄色の花に引き寄せられた。","type":"noun","meaning_category":"plant"}]}