{"word":"footier","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(comparative of footy) More footy; pertaining to or resembling footy (Australian Rules football or association football).","english_definition":"(comparative of footy) More like footy; more related to or characteristic of footy (Australian Rules football or association football).","examples":[{"sentence":"This game is even footier than the last one, with more contested marks and hard tackles.","translation":"この試合は、前回の試合よりもさらにフッティー（オーストラリアンフットボールまたはサッカー）らしく、競り合いや激しいタックルが多い。"},{"sentence":"The new stadium has a footier atmosphere, with better sightlines and closer proximity to the field.","translation":"新しいスタジアムは、より見やすく、フィールドに近いので、フッティー（オーストラリアンフットボールまたはサッカー）らしい雰囲気がある。"}],"collocations":["footier game","footier atmosphere","footier style"],"synonyms":["more footy-like","more football-oriented","more soccer-related"],"antonyms":["less footy","less football-oriented","less soccer-related"]}],"etymology":{"value":"Derived from 'footy' (Australian Rules football or association football) + '-ier' (comparative suffix).","priority":"N/A"},"pronunciation":{"ipa":"/ˈfʊtiər/","syllables":"foo-ti-er"},"inflection":{"adjective_forms":{"comparative":"footier","superlative":"footiest"}},"usage_notes":{"explanation":"'Footier' is a comparative adjective primarily used in Australian English, referring to something that is more related to, characteristic of, or resembling 'footy' (which typically means Australian Rules football or, less commonly, association football/soccer). It's used to describe something that embodies the qualities of the sport to a greater degree.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ This cake is footier than that one.","correct":"✓ This game is footier than that one.","note":"'Footier' should only be used in the context of football (Australian Rules or association football) or related concepts."}],"priority":"N/A"},"related_words":{"derivatives":["footy","footiest"],"phrasal_verbs":[],"related_terms":["football","soccer","AFL (Australian Football League)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Footier' is a comparative adjective derived from 'footy,' which is a colloquial term for Australian Rules football or, sometimes, soccer. It means 'more like footy' or 'more related to footy.' It's primarily used in Australian English. The word is not commonly found in formal contexts or outside of Australia."},"example_sentences":[{"sentence":"The second half was much **footier**, with end-to-end action.","translation":"後半はよりフッティー（サッカーまたはオーストラリアンフットボール）らしく、エンドツーエンドのアクションが繰り広げられた。","type":"adjective","meaning_category":"Relating to footy"},{"sentence":"The new coach wants to create a **footier** culture at the club.","translation":"新しいコーチは、クラブにもっとフッティー（サッカーまたはオーストラリアンフットボール）らしい文化を築きたいと考えている。","type":"adjective","meaning_category":"Relating to footy"}]}