{"word":"stagehand","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"舞台係、舞台裏方","english_definition":"a person who works backstage or handles scenery and props during a theatrical production.","examples":[{"sentence":"The stagehands worked quickly to change the scenery between acts.","translation":"舞台係たちは幕間に舞台装置を素早く転換した。"},{"sentence":"A skilled stagehand can make a big difference in the smoothness of a performance.","translation":"熟練した舞台係は、公演のスムーズさに大きな違いをもたらすことができる。"}],"collocations":["backstage crew","theater crew","scenery mover","prop handler"],"synonyms":["stage technician","theater technician","grip","rigger"],"antonyms":[],"notes":["Stagehands are essential for the technical aspects of a performance."]}],"etymology":{"value":"Combination of \"stage\" (the area where a performance takes place) and \"hand\" (referring to a worker or helper).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsteɪdʒhænd/","syllables":"stage-hand"},"inflection":{"noun_plural":"stagehands"},"usage_notes":{"explanation":"A \"stagehand\" is a crucial member of any theater production, responsible for the physical aspects of the show that the audience doesn't typically see. They move scenery, handle props, set up lighting, and ensure the smooth operation of backstage elements. The term is generally used for those working directly on the stage or in the immediate backstage area.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He's a stagehand in the movie set.","correct":"He's a stagehand on the movie set.","note":"While \"in the movie set\" is not incorrect, \"on the movie set\" is more common when referring to working on a film production."}],"priority":"★★☆"},"related_words":{"derivatives":["stagecraft","stage manager","backstage","props","scenery","lighting","sound"],"phrases":["strike the set","cue","wings","fly system"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in contexts related to theater and performance.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"stagehand\" is relatively straightforward. It refers to someone who works behind the scenes in a theater, moving scenery and handling props. Understanding the word requires familiarity with the basic vocabulary of theater, such as \"stage,\" \"backstage,\" \"scenery,\" and \"props.\" It is not a very common word in everyday conversation, but it is frequently used in contexts related to theater, film, and live performance.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **stagehands** efficiently changed the set during the intermission.","translation":"舞台係たちは休憩時間中に効率的に舞台セットを転換した。","type":"general","meaning_category":"general"},{"sentence":"As a **stagehand**, he was responsible for ensuring all the props were in the correct place.","translation":"舞台係として、彼はすべての小道具が正しい場所にあることを確認する責任があった。","type":"general","meaning_category":"general"},{"sentence":"The **stagehand** carefully adjusted the lighting before the curtain rose.","translation":"舞台係は幕が上がる前に照明を注意深く調整した。","type":"general","meaning_category":"general"}]}