{"word":"Prejudgments","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"先入観、偏見、予断","english_definition":"Opinions or judgments formed beforehand or without due examination.","examples":[{"sentence":"Her decisions were often influenced by her prejudgments about people.","translation":"彼女の決断は、人々に対する先入観によってしばしば影響を受けた。"},{"sentence":"We must try to avoid making prejudgments based on appearances.","translation":"外見に基づいて先入観を持つことを避けるように努めなければならない。"},{"sentence":"The committee's prejudgments made it difficult to have an open discussion.","translation":"委員会の先入観のせいで、率直な議論をすることが難しかった。"}],"collocations":["avoid prejudgments","base on prejudgments","overcome prejudgments","challenge prejudgments"],"synonyms":["bias","preconception","prejudice","assumption","forejudgment"],"antonyms":["objectivity","impartiality","fairness","open-mindedness"]}],"etymology":{"value":"The word 'prejudgment' is formed by combining the prefix 'pre-' (meaning before) with the word 'judgment'. It suggests a judgment made before having all the relevant facts or evidence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˈdʒʌdʒmənts/","syllables":"pre-judg-ments"},"inflection":{"noun_plural":"prejudgments"},"usage_notes":{"explanation":"'Prejudgments' refers to opinions or decisions made prematurely, often without sufficient evidence or a fair hearing. It implies a lack of objectivity and can lead to unfair treatment or misunderstandings. It is often used in the context of social biases, legal proceedings, or personal relationships.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He made a prejudgment about the situation after hearing only one side of the story.","correct":"✓ He made a prejudgment about the situation after hearing only one side of the story.","note":"The spelling 'prejudgment' is correct. There are no common misspellings, but it's important to distinguish it from 'prejudice', which is a related but distinct term."}],"priority":"★☆☆"},"related_words":{"derivatives":["prejudge (verb): to form a judgment on beforehand","prejudiced (adjective): having or showing a dislike or distrust that is derived from prejudice; biased"],"phrases":["jumping to conclusions","making assumptions","having a bias"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'prejudgments' refers to forming opinions or making decisions before having all the necessary information or evidence. It suggests a lack of fairness and objectivity. This word is often used in discussions about bias, discrimination, and critical thinking. Understanding this term is important for analyzing arguments and recognizing potential unfairness in decision-making processes."},"example_sentences":[{"sentence":"The judge was careful not to let his personal prejudgments influence the trial.","translation":"裁判官は、個人的な先入観が裁判に影響を与えないように注意した。","type":"general","meaning_category":"general"},{"sentence":"It's important to challenge our own prejudgments to promote fairness and understanding.","translation":"公平さと理解を促進するためには、私たち自身の先入観に挑戦することが重要だ。","type":"general","meaning_category":"general"},{"sentence":"The media's portrayal of the issue was often based on prejudgments rather than factual reporting.","translation":"メディアによる問題の描写は、事実に基づいた報道というよりは、先入観に基づいていることが多かった。","type":"general","meaning_category":"general"}]}