{"word":"Britophile","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"イギリス（特にイギリス文化）を愛好する人、イギリスびいきの人","english_definition":"A person who is fond of or admires Britain and British things.","examples":[{"sentence":"He's a confirmed Britophile, always watching British TV shows and reading British literature.","translation":"彼は筋金入りのイギリスびいきで、いつもイギリスのテレビ番組を見て、イギリス文学を読んでいる。"},{"sentence":"The conference attracted many Britophiles from around the world.","translation":"その会議には世界中から多くのイギリスびいきが集まった。"},{"sentence":"As a Britophile, she decorated her home with British antiques and artwork.","translation":"イギリスびいきとして、彼女は家をイギリスのアンティークや美術品で飾った。"}],"collocations":["avid Britophile (熱心なイギリスびいき)","confirmed Britophile (筋金入りのイギリスびいき)","self-confessed Britophile (自称イギリスびいき)"],"synonyms":["Anglophile"],"antonyms":["Britophobe"],"related_words":["Anglophilia (イギリス愛好)","Britophobia (イギリス嫌悪)"],"usage_notes":{"explanation":"'Britophile' is a more recent and less common term than 'Anglophile', but it carries a similar meaning. It specifically refers to someone who loves or admires Britain, its culture, and its people. The term can be used to describe someone who is interested in British history, literature, music, film, or any other aspect of British culture. It's often used in a positive or neutral way, but can sometimes be used humorously or critically.","priority":"★★☆"}}],"etymology":{"value":"The word 'Britophile' is formed from 'Brit(ain)' and '-phile' (from Greek 'philos' meaning 'loving').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbrɪtəfaɪl/","syllables":"Brit-o-phile"},"inflection":{"noun_plural":"Britophiles"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. Less common than 'Anglophile'.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Britophile' describes someone who has a strong liking for Britain and British culture. It's similar to 'Anglophile', but 'Britophile' is a more specific and modern term. You might use it to describe someone who enjoys British TV shows, music, or history. It's not a very common word, so you might not hear it often, but it's useful to know if you're talking about someone who is a big fan of Britain."},"example_sentences":[{"sentence":"The museum curator was a dedicated **Britophile**, specializing in 18th-century British art.","translation":"その美術館の学芸員は熱心なイギリスびいきで、18世紀のイギリス美術を専門としていた。","type":"noun","meaning_category":"イギリス愛好家"},{"sentence":"Many **Britophiles** enjoy visiting historical sites in England and Scotland.","translation":"多くのイギリスびいきは、イングランドやスコットランドの史跡を訪れるのを楽しんでいる。","type":"noun","meaning_category":"イギリス愛好家"},{"sentence":"She considered herself a **Britophile** after living in London for several years.","translation":"彼女はロンドンに数年住んだ後、自分をイギリスびいきだと考えるようになった。","type":"noun","meaning_category":"イギリス愛好家"}]}