{"word":"sun-tolerant","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(植物が)日当たりの良い場所でも生育できる、日差しに強い","english_definition":"(of a plant) able to tolerate or thrive in full sun or sunny conditions.","examples":[{"sentence":"These flowers are sun-tolerant and will bloom best in a sunny spot.","translation":"これらの花は日当たりに強く、日当たりの良い場所で最もよく咲きます。"},{"sentence":"Choose sun-tolerant plants for your south-facing garden.","translation":"南向きの庭には、日当たりの良い場所でも育つ植物を選びましょう。"},{"sentence":"This variety of grass is sun-tolerant and drought-resistant.","translation":"この種類の草は日当たりに強く、干ばつにも強いです。"}],"collocations":["sun-tolerant plants (日当たりの良い場所でも育つ植物)","sun-tolerant flowers (日当たりの良い場所でも育つ花)","sun-tolerant groundcover (日当たりの良い場所でも育つグランドカバー)"],"synonyms":["sun-loving","full-sun","heat-tolerant"],"antonyms":["shade-tolerant","shade-loving"],"notes":"Typically used to describe plants that can withstand direct sunlight for extended periods without damage."}],"etymology":{"value":"A compound adjective formed by combining 'sun' (referring to sunlight) and 'tolerant' (able to endure or withstand).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsʌnˌtɒlərənt/","syllables":"sun-tol-er-ant"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms (more sun-tolerant, most sun-tolerant)."},"usage_notes":{"explanation":"The term 'sun-tolerant' is primarily used in gardening and botany to describe plants that can withstand prolonged exposure to direct sunlight without suffering damage such as leaf burn or stunted growth. It is important to note that 'sun-tolerant' does not necessarily mean 'sun-loving'; some plants may simply be able to survive in full sun, while others thrive and bloom best in such conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is sun-tolerant, so I put it in the basement.","correct":"✓ The plant is sun-tolerant, so I put it in a sunny spot.","note":"Sun-tolerant plants need sunlight, so placing them in a dark location like a basement would be counterproductive."},{"incorrect":"✗ All plants are sun-tolerant.","correct":"✓ Some plants are sun-tolerant, while others prefer shade.","note":"Not all plants can tolerate full sun; some require shade or partial shade to thrive."}],"priority":"★★☆"},"related_words":{"derivatives":["sun-tolerance (noun: the ability to tolerate sun)"],"related_terms":["full sun (noun: direct sunlight for at least six hours per day)","partial sun (noun: direct sunlight for 3-6 hours per day)","shade-tolerant (adjective: able to tolerate shade)","drought-tolerant (adjective: able to tolerate drought)","heat-tolerant (adjective: able to tolerate heat)"],"priority":"★★★"},"level_frequency":{"notes":"This term is relatively specialized and primarily used in gardening and botany contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Sun-tolerant' is a word used to describe plants that can handle a lot of direct sunlight. If a plant is labeled as 'sun-tolerant,' it means you can plant it in a sunny spot in your garden without worrying about it getting damaged by the sun. It's a helpful term for gardeners to know when choosing the right plants for their gardens."},"example_sentences":[{"sentence":"This succulent is highly **sun-tolerant** and requires very little watering.","translation":"この多肉植物は非常に日当たりに強く、ほとんど水やりを必要としません。","type":"adjective","meaning_category":"日当たりの良い場所でも生育できる"},{"sentence":"Before planting, check if the plant is **sun-tolerant** or prefers shade.","translation":"植える前に、その植物が日当たりに強いか、日陰を好むかを確認してください。","type":"adjective","meaning_category":"日差しに強い"},{"sentence":"Many **sun-tolerant** herbs, such as rosemary and thyme, thrive in hot, dry climates.","translation":"ローズマリーやタイムなど、多くの日当たりの良い場所でも育つハーブは、暑くて乾燥した気候でよく育ちます。","type":"adjective","meaning_category":"日当たりの良い場所でも生育できる"}]}