{"word":"Carpathian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"カルパティア山脈の、カルパティア地方の","english_definition":"relating to the Carpathian Mountains or the region around them.","examples":[{"sentence":"The Carpathian region is known for its beautiful landscapes.","translation":"カルパティア地方はその美しい景観で知られています。"},{"sentence":"Carpathian forests are home to many species of wildlife.","translation":"カルパティアの森林は多くの野生生物種の生息地です。"}],"collocations":["Carpathian Mountains (カルパティア山脈)","Carpathian region (カルパティア地方)","Carpathian forest (カルパティアの森)"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"カルパティア山脈出身の人","english_definition":"a person from the Carpathian Mountains region.","examples":[{"sentence":"The Carpathians have a rich cultural heritage.","translation":"カルパティアの人々は豊かな文化遺産を持っています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the name of the Carpathian Mountains, which is of uncertain origin. Possible sources include Proto-Indo-European *kerp- 'to harvest, pluck' or Dacian *karpat- 'stone, rock'.","priority":"★★★"},"pronunciation":{"ipa":"/kɑːrˈpeɪθiən/","syllables":"Car-pa-thi-an"},"inflection":{"notes":"The noun form is plural only (Carpathians)."},"usage_notes":{"explanation":"The term \"Carpathian\" is primarily used to describe things related to the Carpathian Mountains, a major mountain range in Central and Eastern Europe. It can refer to geographical features, people, or cultural aspects of the region.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Carpathian mountain.","correct":"✓ He is from the Carpathian Mountains.","note":"\"Carpathian\" is an adjective, not a noun describing a mountain. Use \"from the Carpathian Mountains\" to indicate origin."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"Carpathian\" is typically used in contexts related to geography, history, or culture when discussing the Carpathian Mountains region. It is not a commonly used word in everyday conversation but is more likely to appear in academic or travel-related texts. Understanding the term requires some familiarity with European geography."},"example_sentences":[{"sentence":"The **Carpathian** wolf is a subspecies of the gray wolf found in the Carpathian Mountains.","translation":"カルパティアオオカミは、カルパティア山脈に生息するハイイロオオカミの亜種です。","type":"adjective","meaning_category":"カルパティア山脈の"},{"sentence":"Folk traditions are still very much alive among the **Carpathians**.","translation":"カルパティアの人々の間では、民俗伝統が今もなお息づいています。","type":"noun","meaning_category":"カルパティア山脈出身の人"}]}