{"word":"Arianize","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"アーリア化する、アーリア人化する（特にナチス・ドイツにおいて、非アーリア人から財産や権利を奪い、アーリア人の手に移すこと）","english_definition":"To subject to Arianization, especially in Nazi Germany, to transfer property or businesses from non-Aryans to Aryans.","examples":[{"sentence":"The Nazis began to Arianize Jewish businesses in the 1930s.","translation":"ナチスは1930年代にユダヤ人のビジネスをアーリア化し始めた。"},{"sentence":"Many families lost their homes and livelihoods as a result of Arianization policies.","translation":"多くの家族がアーリア化政策の結果として家と生活手段を失った。"}],"collocations":["Arianize a business (ビジネスをアーリア化する)","Arianize property (財産をアーリア化する)"],"synonyms":["expropriate","confiscate","nationalize","Aryanize"],"antonyms":["de-Arianize","restitute","return"],"usage_notes":"This term is strongly associated with the policies of Nazi Germany and carries a negative connotation. It refers to the forced transfer of assets and rights from Jewish people and other groups deemed 'non-Aryan' to 'Aryan' ownership."}],"etymology":{"value":"Derived from 'Aryan,' referring to the Nazi racial ideology of a superior race, combined with the suffix '-ize,' indicating a process of making something Aryan.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɛəriənaɪz/","syllables":"A-ri-an-ize"},"inflection":{"verb_forms":{"present_simple":["Arianize","Arianizes"],"past_simple":"Arianized","past_participle":"Arianized","present_participle":"Arianizing"}},"related_words":{"derivatives":["Arianization (noun)"],"related_concepts":["Aryan","Nazi Germany","Holocaust","racial ideology","expropriation"]},"level_frequency":{"frequency_google_ngram":"Very low frequency. The term is primarily used in historical contexts related to Nazi Germany.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Arianize' is a specialized term primarily encountered in historical contexts, specifically when discussing Nazi Germany's policies. It refers to the forced transfer of property and businesses from Jewish people and other groups deemed 'non-Aryan' to those considered 'Aryan.' Understanding this term requires knowledge of the historical context and the racial ideology of the Nazi regime."},"example_sentences":[{"sentence":"The government implemented laws to Arianize all Jewish-owned businesses.","translation":"政府はユダヤ人所有のすべてのビジネスをアーリア化するための法律を施行した。","type":"verb","meaning_category":"アーリア化する"},{"sentence":"Arianizing property was a key component of the Nazi regime's persecution of Jews.","translation":"財産をアーリア化することは、ナチス政権によるユダヤ人迫害の重要な要素だった。","type":"verb","meaning_category":"アーリア化する"}]}