{"word":"unbaptize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"洗礼を取り消す、洗礼の効力をなくす","english_definition":"To revoke or undo a baptism; to remove or negate the effects of baptism.","examples":[{"sentence":"He jokingly threatened to unbaptize his children if they misbehaved.","translation":"彼は冗談で、子供たちが悪い子にしていたら洗礼を取り消すと脅した。"},{"sentence":"The idea of unbaptizing someone is controversial within religious circles.","translation":"誰かの洗礼を取り消すという考えは、宗教界では議論の的となっている。"}],"collocations":["unbaptize someone","attempt to unbaptize","the concept of unbaptizing"],"synonyms":["de-baptize","revoke baptism","negate baptism"],"antonyms":["baptize","christen"]},{"part_of_speech":"verb","transitivity":"vt","definition":"（比喩的に）以前の状態に戻す、初期の状態に戻す","english_definition":"(Figuratively) To revert something to its original or initial state; to undo the effects of a previous action or event.","examples":[{"sentence":"It's impossible to unbaptize the past, no matter how much we regret it.","translation":"過去をどれだけ後悔しても、過去をなかったことにすることはできない。"},{"sentence":"You can't unbaptize that decision; you have to live with the consequences.","translation":"その決定を取り消すことはできない。結果を受け入れて生きていくしかない。"}],"collocations":["unbaptize the past","unbaptize a decision","unbaptize an action"],"synonyms":["undo","reverse","nullify","invalidate"],"antonyms":["affirm","validate","confirm"]}],"etymology":{"value":"The word \"unbaptize\" is formed by adding the prefix \"un-\" (meaning 'not' or 'undoing') to the word \"baptize.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈbæptaɪz/","syllables":"un-bap-tize"},"inflection":{"verb_forms":{"present_simple":["unbaptize","unbaptizes"],"past_simple":"unbaptized","past_participle":"unbaptized","present_participle":"unbaptizing"}},"usage_notes":{"explanation":"The word \"unbaptize\" is rarely used in a literal, religious context, as most Christian denominations believe that baptism is a permanent sacrament. Its usage is more common in a figurative sense, meaning to undo or reverse a previous action or decision. The concept is often used humorously or sarcastically to express the impossibility of reversing certain events.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wanted to unbaptize from the church.","correct":"✓ He wanted to leave the church.","note":"The correct way to express leaving a church is to say 'leave the church' or 'resign from the church.' 'Unbaptize' is not typically used to describe leaving a religious institution."},{"incorrect":"✗ They tried to unbaptize the mistake.","correct":"✓ They tried to correct the mistake. / ✓ They tried to undo the mistake.","note":"In a figurative sense, use 'undo' or 'correct' instead of 'unbaptize' when referring to rectifying a mistake."}],"priority":"★★☆"},"related_words":{"derivatives":["unbaptism (noun, rare): the act of unbaptizing"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unbaptize\" is a relatively rare and complex term. Its literal meaning refers to the act of reversing or nullifying a baptism, a Christian sacrament. However, due to the theological belief in the permanence of baptism in many denominations, the term is more often used figuratively to describe the undoing of a past action or decision. Understanding the word requires a grasp of religious concepts and the ability to interpret figurative language. It is not typically encountered in everyday conversation or writing and is more likely to appear in theological discussions or philosophical contexts."},"example_sentences":[{"sentence":"Some radical groups have called for the unbaptizing of individuals who no longer adhere to the faith.","translation":"一部の過激派グループは、もはや信仰を守らない人々の洗礼を取り消すことを求めている。","type":"verb (vt)","meaning_category":"洗礼を取り消す"},{"sentence":"You can't simply unbaptize a bad decision; you have to learn from it.","translation":"悪い決断を簡単に無かったことにはできない。そこから学ばなければならない。","type":"verb (vt)","meaning_category":"（比喩的に）以前の状態に戻す"}]}