{"word":"Pokan","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Japanese slang) A state of being absent-minded, spacey, or out of it. Often used to describe someone who is easily distracted or makes silly mistakes due to lack of focus.","english_definition":"A Japanese slang term describing a state of being absent-minded, spacey, or out of it. It refers to someone who is easily distracted or makes silly mistakes due to a lack of focus.","examples":[{"sentence":"彼女はいつもポカンとしている。","translation":"She is always pokan.","english_sentence":"She is always absent-minded."},{"sentence":"彼はポカンとしていて、話を聞いていないようだった。","translation":"He was pokan and didn't seem to be listening.","english_sentence":"He was spacey and didn't seem to be listening."},{"sentence":"ポカンとしていたら、電車を乗り過ごしてしまった。","translation":"Because I was pokan, I missed my train stop.","english_sentence":"Because I was absent-minded, I missed my train stop."}],"collocations":["ポカンとする (to be absent-minded)","ポカンと口を開ける (to gape)","ポカン顔 (a blank expression)"],"synonyms":["ぼんやり","うっかり","上の空","멍 (Korean equivalent)"],"antonyms":["集中","真剣","注意深い"],"notes":"This word is often used in casual conversation and anime/manga. It describes a temporary state of mind rather than a permanent personality trait."}],"etymology":{"value":"Onomatopoeic word representing a blank or dazed expression.","priority":"N/A"},"pronunciation":{"ipa":"/po̞ka̠ɴ/","syllables":"po-kan"},"inflection":{"notes":"It's primarily used as a noun or adverbial noun (used with する)."},"usage_notes":{"explanation":"'Pokan' is a versatile slang term. It can describe a person's state of mind, their facial expression, or the reason for a mistake. It implies a temporary lack of focus or awareness. It's more informal than 'ぼんやり' or 'うっかり'.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"彼はポカンな人です。","correct":"彼はポカンとしている人です。","note":"It's more natural to say 'ポカンとしている' rather than 'ポカンな' to describe someone's state."}],"priority":"N/A"},"related_words":{"derivatives":["ポカンとする (verb)","ポカンと (adverb)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"Intermediate","text":"'Pokan' is a slang word, so it's not typically taught in formal Japanese classes. However, it's common in casual conversation, anime, and manga. Understanding it will help you better understand informal Japanese. It describes a state of being absent-minded or dazed."},"example_sentences":[{"sentence":"先生の話を聞いている間、ずっとポカンとしていた。","translation":"I was pokan the whole time while listening to the teacher.","type":"Example","meaning_category":"Absent-minded"},{"sentence":"彼はポカンと口を開けて、驚いていた。","translation":"He was gaping in surprise.","type":"Example","meaning_category":"Dazed"},{"sentence":"ポカンとしていたせいで、財布を忘れてしまった。","translation":"Because I was absent-minded, I forgot my wallet.","type":"Example","meaning_category":"Absent-minded"}]}