{"word":"grassroots-promoted","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"草の根運動によって推進された、市民運動によって推進された","english_definition":"Driven or supported by ordinary people or local communities, rather than by established political or corporate entities.","examples":[{"sentence":"The grassroots-promoted initiative aimed to improve local parks.","translation":"その草の根運動によって推進された取り組みは、地元の公園を改善することを目的としていた。"},{"sentence":"A grassroots-promoted campaign led to the election of a new mayor.","translation":"市民運動によって推進されたキャンペーンが、新しい市長の選出につながった。"}],"collocations":["grassroots-promoted campaign (草の根運動によって推進されたキャンペーン)","grassroots-promoted initiative (草の根運動によって推進されたイニシアチブ)","grassroots-promoted movement (草の根運動によって推進された運動)"],"synonyms":["community-driven","bottom-up","citizen-led","locally-supported"],"antonyms":["top-down","centrally-controlled","corporate-sponsored","government-led"]}],"etymology":{"value":"The term combines 'grassroots,' referring to the ordinary people or local communities, with 'promoted,' indicating that something has been advanced or supported.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡræsˌruːts prəˈmoʊtɪd/","syllables":"grass-roots pro-mo-ted"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns."},"usage_notes":{"explanation":"'Grassroots-promoted' is used to describe initiatives, campaigns, or movements that originate from and are primarily supported by ordinary citizens or local communities. It emphasizes that the driving force comes from the ground level rather than from established authorities or organizations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The project was promoted by grassroots.","correct":"✓ The project was grassroots-promoted.","note":"'Grassroots' is a noun, while 'grassroots-promoted' is an adjective describing the project."}],"priority":"★★☆"},"related_words":{"derivatives":["grassroots (noun, adjective)","promote (verb)","promotion (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Grassroots-promoted' is a compound adjective that describes something supported by regular people rather than large organizations. It's often used in political or community contexts to show that an idea or project came from the community itself. Understanding this term helps in recognizing the origin and support base of various initiatives."},"example_sentences":[{"sentence":"The grassroots-promoted environmental project received widespread support.","translation":"その草の根運動によって推進された環境プロジェクトは、広範な支持を得た。","type":"adjective","meaning_category":"市民運動によって推進された"},{"sentence":"A grassroots-promoted petition gathered thousands of signatures.","translation":"市民運動によって推進された請願書は、数千もの署名を集めた。","type":"adjective","meaning_category":"市民運動によって推進された"}]}