{"word":"fuzee","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"(花火の)導火線、(鉄道の)発煙筒","english_definition":"A coloured flare used as a signal, especially on railways; a fuse.","examples":[{"sentence":"The railway worker lit a fuzee to warn the oncoming train.","translation":"鉄道作業員は、近づいてくる列車に警告するために発煙筒に火をつけた。"},{"sentence":"The fuzee burned brightly, signaling the danger ahead.","translation":"発煙筒は明るく燃え、前方の危険を知らせた。"}],"collocations":["railway fuzee","warning fuzee","burning fuzee"],"synonyms":["flare","fuse","signal flare"],"antonyms":[]},{"part_of_speech":"noun","definition":"(古語) 糸巻き車、(古語) 紡錘","english_definition":"(archaic) The cone or grooved pulley of a watch or clock, designed to equalize the power of the mainspring.","examples":[{"sentence":"The watchmaker carefully adjusted the fuzee to ensure accurate timekeeping.","translation":"時計職人は、正確な計時を保証するために、香箱真を注意深く調整した。"},{"sentence":"The antique clock featured an intricately crafted fuzee.","translation":"そのアンティーク時計は、精巧に作られた香箱真を備えていた。"}],"collocations":["watch fuzee","clock fuzee","fuzee movement"],"synonyms":["fusee","cone pulley"],"antonyms":[]}],"etymology":{"value":"From French 'fusée', meaning 'rocket, spindle', from Latin 'fusus' meaning 'spindle'.","priority":"Medium"},"pronunciation":{"ipa":"/fjuːˈziː/","syllables":"fu-zee"},"inflection":{"noun_plural":"fuzees"},"usage_notes":{"explanation":"The word 'fuzee' has two main meanings, one related to signaling devices like flares, and the other to a mechanical component in older timekeeping devices. The signaling meaning is more common in modern usage, particularly in contexts related to railways. The mechanical meaning is mostly encountered in historical or technical contexts.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"I used a fuzee to light the campfire.","correct":"I used a match/lighter to light the campfire.","note":"Fuzees are typically used for signaling, not for starting fires."}],"priority":"Low"},"related_words":{"derivatives":["fusee (alternative spelling for the mechanical component)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'fuzee' is relatively uncommon and may be unfamiliar to many English speakers. Its primary modern usage is in the context of railway signaling, referring to a colored flare used to warn of danger. The older meaning, referring to a component in clocks and watches, is even less common and mostly found in specialized or historical texts. Understanding the context is crucial to interpreting the intended meaning of 'fuzee'."},"example_sentences":[{"sentence":"The engineer placed a burning fuzee on the track to stop the train.","translation":"機関士は列車を止めるために、燃えている発煙筒を線路に置いた。","type":"noun","meaning_category":"signaling device"},{"sentence":"The intricate design of the fuzee in the antique watch was remarkable.","translation":"アンティーク時計の香箱真の複雑なデザインは注目に値した。","type":"noun","meaning_category":"mechanical component"}]}