{"word":"quarter-cast","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(演劇、映画) クォーターキャスト: 役柄の4分の1が、その役柄の人種または民族グループの俳優によって演じられること。","english_definition":"(theater, film) A situation in which one quarter of the roles are cast with actors of the racial or ethnic group that the roles are written for.","examples":[{"sentence":"The director aimed for a quarter-cast to ensure some representation of the culture.","translation":"監督は、文化のいくらかの表現を確実にするために、クォーターキャストを目指した。"}],"collocations":["achieve a quarter-cast","aim for a quarter-cast"],"synonyms":[],"antonyms":[]},{"part_of_speech":"verb","definition":"(演劇、映画) クォーターキャストする: 役柄の4分の1を、その役柄の人種または民族グループの俳優によって配役すること。","english_definition":"(theater, film) To cast one quarter of the roles with actors of the racial or ethnic group that the roles are written for.","examples":[{"sentence":"They decided to quarter-cast the play to address diversity concerns.","translation":"彼らは多様性の懸念に対処するために、その劇をクォーターキャストすることにした。"}],"collocations":["quarter-cast a play","quarter-cast a movie"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term is derived from the idea of casting one-quarter of the roles with actors of a specific racial or ethnic background.","priority":"N/A"},"pronunciation":{"ipa":"/ˈkwɔːrtərˌkæst/","syllables":"quar-ter-cast"},"inflection":{"verb_forms":{"present_simple":["quarter-cast","quarter-casts"],"past_simple":"quarter-casted","past_participle":"quarter-casted","present_participle":"quarter-casting"}},"usage_notes":{"explanation":"This term is relatively new and specific to discussions about representation and diversity in casting, particularly in theater and film. It implies a limited effort to include actors from specific racial or ethnic groups.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["color-blind casting","race-conscious casting"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'quarter-cast' is a specialized term related to casting practices in theater and film, specifically addressing representation and diversity. It refers to casting one-quarter of the roles with actors who belong to the racial or ethnic group for which the roles were originally written. This term is used in discussions about casting practices and diversity in the entertainment industry."},"example_sentences":[{"sentence":"The production company was criticized for only quarter-casting the main roles.","translation":"その制作会社は、主要な役柄のクォーターキャストしか行わなかったことで批判された。","type":"general","meaning_category":"Casting practices"}]}