{"word":"incrustive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"覆い隠すような、付着性の、表面を覆うような","english_definition":"Having the quality of covering or encrusting; forming a crust or coating on a surface.","examples":[{"sentence":"The incrustive growth of barnacles covered the hull of the ship.","translation":"フジツボの付着性の成長が船の船体を覆った。"},{"sentence":"An incrustive layer of calcium carbonate formed on the inside of the pipe.","translation":"炭酸カルシウムの表面を覆う層がパイプの内側に形成された。"}],"collocations":["incrustive layer (覆い隠す層)","incrustive growth (付着性の成長)","incrustive deposit (表面を覆う堆積物)"],"synonyms":["encrusting","coating","overlaying","covering","adhering"],"antonyms":["uncovered","exposed","bare"]},{"part_of_speech":"adjective","definition":"（鉱物などが）染み込むような、浸透性の","english_definition":"(Of minerals, etc.) tending to permeate or infiltrate.","examples":[{"sentence":"The incrustive minerals filled the cracks in the rock.","translation":"染み込むような鉱物が岩のひび割れを埋めた。"}],"collocations":["incrustive mineral (染み込む鉱物)"],"synonyms":["permeating","infiltrating","impregnating"],"antonyms":[]}],"etymology":{"value":"Derived from \"incrust\" (to cover with a crust or hard coating), which comes from the Latin \"incrustare\" (to overlay with a crust), from \"in-\" (in, on) + \"crusta\" (crust).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈkrʌstɪv/","syllables":"in-crus-tive"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more incrustive' and 'most incrustive', respectively."},"usage_notes":{"explanation":"\"Incrustive\" describes something that has the characteristic of forming a crust or coating on a surface, or of permeating something. It often refers to the way certain substances, like minerals or biological growths, cover or penetrate other materials.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The paint was very incrustive on the wall.","correct":"✓ The paint formed an incrustive layer on the wall.","note":"\"Incrustive\" describes the property of forming a crust or coating, not the degree to which something is covered. It's better to say the paint 'formed an incrustive layer' or 'created an incrustation'."}],"priority":"★★☆"},"related_words":{"derivatives":["incrust (verb: to cover with a crust or hard coating; noun: an encrustation)","incrustation (noun: a crust or hard coating on something)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Incrustive' is a relatively uncommon word used to describe something that has the quality of forming a crust or coating on a surface, or of permeating something. It is often used in scientific or technical contexts to describe the way certain substances cover or penetrate other materials. Understanding the word requires a good vocabulary and an understanding of the concept of encrustation."},"example_sentences":[{"sentence":"The geologist examined the incrustive deposits in the cave.","translation":"地質学者は洞窟内の表面を覆う堆積物を調べた。","type":"adjective","meaning_category":"覆い隠すような"},{"sentence":"The incrustive nature of the algae caused the rocks to become slippery.","translation":"藻類の付着性の性質により、岩が滑りやすくなった。","type":"adjective","meaning_category":"付着性の"},{"sentence":"The incrustive minerals slowly filled the porous stone.","translation":"染み込む鉱物がゆっくりと多孔質の石を埋めた。","type":"adjective","meaning_category":"浸透性の"}]}