{"word":"craggy-faced","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(人について)ごつごつした顔つきの、険しい顔つきの、しわくちゃの","english_definition":"(of a person) having a rugged, rough, or furrowed face; often suggesting age, experience, or a hard life.","examples":[{"sentence":"The old sailor had a craggy-faced appearance that told tales of years at sea.","translation":"その老船員は、長年の航海生活を物語るような、ごつごつした顔つきをしていた。"},{"sentence":"The prospector's craggy-faced visage hinted at the hardships he had endured in the mountains.","translation":"その探鉱者の険しい顔つきは、彼が山中で耐え忍んだ苦難を物語っていた。"},{"sentence":"He was a craggy-faced man with eyes that twinkled with humor.","translation":"彼は、ユーモアの光を宿した瞳を持つ、しわくちゃの顔をした男だった。"}],"collocations":["craggy-faced old man","craggy-faced sailor","craggy-faced prospector","craggy-faced appearance","craggy-faced visage"],"synonyms":["rugged-faced","weather-beaten","furrowed","lined","rough-hewn","worn"],"antonyms":["smooth-faced","unlined","youthful","baby-faced","delicate"],"notes":"The term often implies a certain strength, resilience, or character etched onto the face by time and experience."}],"etymology":{"value":"Combination of 'craggy' (resembling a crag, a steep rugged rock or cliff) and 'faced' (having a face of a particular type). The 'craggy' part suggests a surface that is uneven, rough, and full of projections, metaphorically applied to the features of a face.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkræɡi feɪst/","syllables":"crag-gy-faced"},"inflection":{"notes":"Adjective; does not inflect for number or gender."},"usage_notes":{"explanation":"'Craggy-faced' is used to describe someone whose face has a rough, uneven texture, often due to age, exposure to the elements, or a life of hardship. It's more descriptive than simply saying someone is old or wrinkled, as it evokes a specific image of a face that is strong, weathered, and full of character. The term is usually reserved for men, though it can be applied to women as well.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The mountain was craggy-faced.","correct":"The mountain was craggy.","note":"'Craggy-faced' is specifically for describing people. For landscapes, use 'craggy' alone."},{"incorrect":"He had a craggy face, so he used a lot of moisturizer.","correct":"He had a craggy face, which suggested a life of hard work.","note":"The term implies a certain ruggedness and history, not something to be 'fixed' with moisturizer. The second sentence better reflects the connotation."}],"priority":"★★☆"},"related_words":{"derivatives":["crag (noun: a steep, rugged rock or cliff)","cragginess (noun: the quality of being craggy)"],"related_terms":["weather-beaten","rugged","lined","furrowed","rough","worn","etched"],"priority":"★★☆"},"level_frequency":{"level":"C1","frequency_google_ngram":"Relatively low frequency; more common in literature and descriptive writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Craggy-faced' is an advanced adjective used to vividly describe a person's face. It suggests a face that is rough, uneven, and marked by lines and wrinkles, often implying age, resilience, and a life lived outdoors or through hardship. It's not a common term in everyday conversation, but is more often found in descriptive writing to create a strong image in the reader's mind. Understanding the word requires a good vocabulary and an appreciation for figurative language."},"example_sentences":[{"sentence":"The **craggy-faced** fisherman hauled in his nets, his eyes squinting against the harsh sun.","translation":"ごつごつした顔つきの漁師は、強い日差しに目を細めながら、網を引き上げた。","type":"adjective","meaning_category":"physical appearance"},{"sentence":"His **craggy-faced** features were a testament to years spent battling the elements.","translation":"彼の険しい顔つきは、何年も自然と闘ってきたことの証だった。","type":"adjective","meaning_category":"physical appearance, experience"},{"sentence":"Despite his **craggy-faced** exterior, he possessed a gentle and kind heart.","translation":"ごつごつした顔つきの外見にもかかわらず、彼は優しく親切な心を持っていた。","type":"adjective","meaning_category":"physical appearance, contrast"}]}