{"word":"metamorphism","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"変成作用、変成（岩）","english_definition":"The process by which rocks are changed in mineralogy, texture, and sometimes chemical composition due to changes in temperature, pressure, and/or chemically active fluids. Also, the state of a rock that has undergone such changes.","examples":[{"sentence":"Metamorphism can transform shale into slate.","translation":"変成作用は頁岩を粘板岩に変えることができる。"},{"sentence":"Regional metamorphism occurs over large areas, often associated with mountain building.","translation":"広域変成作用は、広大な地域で起こり、しばしば造山運動と関連する。"},{"sentence":"Contact metamorphism results from the heat of an igneous intrusion.","translation":"接触変成作用は、火成岩の貫入熱によって生じる。"}],"collocations":["regional metamorphism (広域変成作用)","contact metamorphism (接触変成作用)","dynamic metamorphism (動的変成作用)","burial metamorphism (埋没変成作用)","prograde metamorphism (累進変成作用)","retrograde metamorphism (退行変成作用)","metamorphic rock (変成岩)"],"synonyms":["transformation","alteration","change"],"antonyms":["igneous process","sedimentary process"]},{"part_of_speech":"noun","definition":"（生物学における）変態","english_definition":"(Biology) A transformation or dramatic change in form or structure, especially in insects and amphibians during development.","examples":[{"sentence":"The tadpole undergoes metamorphism to become a frog.","translation":"オタマジャクシは変態を経てカエルになる。"},{"sentence":"Insect metamorphism can be complete or incomplete.","translation":"昆虫の変態は完全変態または不完全変態でありうる。"}],"collocations":["complete metamorphism (完全変態)","incomplete metamorphism (不完全変態)"],"synonyms":["transformation","development","evolution"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'meta' (meaning change) and 'morphe' (meaning form), combined with the suffix '-ism' (denoting a process or condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛtəˈmɔːrfɪzəm/","syllables":"met-a-mor-phism"},"inflection":{"noun_plural":"metamorphisms"},"usage_notes":{"explanation":"In geology, 'metamorphism' refers to the process that changes existing rocks. In biology, it describes the transformation of an organism's form during development. The geological usage is far more common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Metamorphism is when a rock melts.","correct":"✓ Metamorphism is when a rock changes due to heat and pressure without melting.","note":"Melting results in igneous rocks, not metamorphic rocks. Metamorphism involves changes without melting."},{"incorrect":"✗ Metamorphosis is the geological process of rock change.","correct":"✓ Metamorphism is the geological process of rock change.","note":"'Metamorphosis' is primarily used in biology to describe the transformation of organisms, while 'metamorphism' is used in geology."}],"priority":"★★☆"},"related_words":{"derivatives":["metamorphic (adjective: relating to metamorphism or metamorphic rocks)","metamorphose (verb: to undergo metamorphism or transformation)","metamorphism (noun: the state of having undergone metamorphism)"],"phrasal_verbs":[],"related_terms":["protolith (原岩)","foliation (片理)","schistosity (片状構造)","gneissic banding (縞状構造)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Metamorphism' is a scientific term referring to the process where rocks change their form and mineral composition due to heat, pressure, or chemical activity. It's also used in biology to describe the transformation of an organism's shape, like a caterpillar becoming a butterfly. The word comes from Greek roots meaning 'change of form.' It's mostly used in science and geology contexts.","priority":"★★★"},"example_sentences":[{"sentence":"The high pressure and temperature caused metamorphism in the rocks deep underground.","translation":"高圧と高温が地下深くに存在する岩石に変成作用を引き起こした。","type":"noun","meaning_category":"Geology"},{"sentence":"The amphibian undergoes a complete metamorphism during its life cycle.","translation":"その両生類は、ライフサイクルの中で完全な変態を遂げる。","type":"noun","meaning_category":"Biology"},{"sentence":"Metamorphism can create valuable minerals such as garnet.","translation":"変成作用は、ガーネットのような貴重な鉱物を作り出すことができる。","type":"noun","meaning_category":"Geology"},{"sentence":"The metamorphism of the sedimentary rock resulted in a harder, more durable material.","translation":"堆積岩の変成作用により、より硬く、耐久性のある物質が生成された。","type":"noun","meaning_category":"Geology"},{"sentence":"Insecticides can disrupt the normal metamorphism of insect larvae.","translation":"殺虫剤は、昆虫の幼虫の正常な変態を妨げることがある。","type":"noun","meaning_category":"Biology"}]}