{"word":"self-igniting","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"自然発火性の、自己着火性の","english_definition":"Capable of igniting spontaneously; able to catch fire without an external source of ignition.","examples":[{"sentence":"Some materials are self-igniting under certain conditions.","translation":"ある種の物質は特定の条件下で自然発火性を持つ。"},{"sentence":"The chemical reaction was self-igniting, causing a rapid increase in temperature.","translation":"その化学反応は自己着火性があり、急激な温度上昇を引き起こした。"}],"collocations":["self-igniting material","self-igniting substance","self-igniting reaction"],"synonyms":["spontaneously combustible","pyrophoric"],"antonyms":["non-flammable","non-combustible"]}],"etymology":{"value":"Derived from the combination of 'self-' (referring to oneself or itself) and 'igniting' (the process of catching fire).","priority":"★★★"},"pronunciation":{"ipa":"/ˌself.ɪɡˈnaɪ.tɪŋ/","syllables":"self-ig-nit-ing"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Self-igniting' describes substances or processes that can start burning on their own, without needing a spark or flame. It's often used in chemistry, engineering, and safety contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The wood was self-ignited by the sun.","correct":"✓ The wood was ignited by the sun.","note":"'Self-igniting' means it happens without an external source. If the sun caused the ignition, it's not self-igniting."}],"priority":"★★☆"},"related_words":{"derivatives":["self-ignition (noun): The act or process of self-igniting.","ignite (verb): To catch fire or cause to catch fire.","ignition (noun): The act of setting something on fire or starting to burn."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'self-igniting' is a technical term used to describe materials or processes that can start burning on their own. It is commonly encountered in scientific or technical contexts. Understanding this term requires a good grasp of scientific vocabulary and concepts related to combustion."},"example_sentences":[{"sentence":"The improperly stored rags became self-igniting due to the buildup of heat.","translation":"不適切に保管されたぼろきれは、熱の蓄積により自然発火性になった。","type":"adjective","meaning_category":"describing a material"},{"sentence":"The experiment demonstrated the self-igniting properties of the new compound.","translation":"その実験は、新しい化合物の自己着火性特性を実証した。","type":"adjective","meaning_category":"describing a property"}]}