{"word":"stereophotograph","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"立体写真、ステレオ写真","english_definition":"A photograph taken with a stereoscopic camera, producing a stereoscopic effect when viewed with a stereoscope or other special device.","examples":[{"sentence":"The museum displayed a collection of stereophotographs from the 19th century.","translation":"その博物館は19世紀の立体写真のコレクションを展示していた。"},{"sentence":"He enjoyed viewing stereophotographs of exotic landscapes.","translation":"彼は異国情緒あふれる風景の立体写真を鑑賞するのを楽しんだ。"}],"collocations":["view a stereophotograph","stereophotograph collection","19th-century stereophotograph"],"synonyms":["stereogram","stereo image","3D photograph"],"antonyms":["monoscopic photograph","2D photograph"]}],"etymology":{"value":"The word \"stereophotograph\" is a combination of \"stereo-\" (from Greek \"stereos\" meaning solid or three-dimensional), \"photo-\" (from Greek \"phos\" meaning light), and \"-graph\" (from Greek \"graphein\" meaning to write or draw). Thus, it literally means a three-dimensional picture written by light.","priority":"★★★"},"pronunciation":{"ipa":"/ˌstɛriːəˈfoʊtəˌɡræf/","syllables":"ste-re-o-pho-to-graph"},"inflection":{"noun_plural":"stereophotographs"},"usage_notes":{"explanation":"A \"stereophotograph\" consists of two photographs taken from slightly different angles, mimicking the perspective of human eyes. When viewed through a stereoscope or other special device, the brain combines these two images into a single, three-dimensional image, creating a sense of depth and realism. The term is often used interchangeably with \"stereogram,\" although a stereogram can also refer to a single image that creates a 3D effect without requiring a stereoscope.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I took a stereophotograph with my regular camera.","correct":"✓ I took a stereophotograph with a stereoscopic camera.","note":"Stereophotographs require a stereoscopic camera, which has two lenses to capture images from slightly different perspectives. A regular camera cannot produce a true stereophotograph."},{"incorrect":"✗ This stereophotograph looks flat.","correct":"✓ This stereophotograph looks flat without a stereoscope.","note":"Stereophotographs are designed to be viewed with a stereoscope or other special device to create the 3D effect. Without such a device, they will appear as two separate, slightly different images."}],"priority":"★★☆"},"related_words":{"derivatives":["stereoscopic (adjective: relating to or creating a three-dimensional effect)","stereoscopy (noun: the technique of creating or viewing stereoscopic images)","stereoscope (noun: a device for viewing stereoscopic photographs)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"stereophotograph\" is a technical term referring to a specific type of photograph that creates a three-dimensional effect when viewed through a special device. It is not commonly used in everyday conversation but is more likely to appear in contexts related to photography, visual arts, or historical archives. Understanding the term requires familiarity with the concept of stereoscopy and the technology used to create and view such images."},"example_sentences":[{"sentence":"The old stereophotograph showed a bustling street scene from the early 20th century.","translation":"その古い立体写真は、20世紀初頭のにぎやかな街の様子を映し出していた。","type":"example"},{"sentence":"Viewing the stereophotograph through the stereoscope, I felt as if I were actually there.","translation":"立体写真をステレオスコープを通して見ると、まるで実際にそこにいるかのように感じられた。","type":"example"},{"sentence":"The library has a large collection of stereophotographs documenting local history.","translation":"その図書館には、地域の歴史を記録した立体写真の大きなコレクションがある。","type":"example"}]}