{"word":"parascene","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ギリシア劇場の)舞台の左右にある建物、舞台袖","english_definition":"In ancient Greek theaters, either of two buildings flanking the stage; a side building or wing of the stage.","examples":[{"sentence":"The actors entered from the parascene.","translation":"役者たちは舞台袖から登場した。"},{"sentence":"The parascene provided a backdrop for the play.","translation":"舞台袖は劇の背景を提供した。"}],"collocations":["enter from the parascene","exit to the parascene","the left parascene","the right parascene"],"synonyms":["side building","stage wing","wing"],"antonyms":["stage","orchestra"]}],"etymology":{"value":"From Ancient Greek παρασκήνιον (paraskḗnion), from παρά (pará, “beside, near”) + σκηνή (skēnḗ, “stage, scene”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpærəˌsiːn/","syllables":"par-a-scene"},"inflection":{"noun_plural":"parascenes"},"usage_notes":{"explanation":"The term \"parascene\" is primarily used in the context of ancient Greek theatre architecture. It refers specifically to the structures on either side of the stage (skēnḗ). These structures served various functions, including providing entrances and exits for actors, offering a backdrop for the performance, and potentially housing stage machinery. The parascene is a key element in understanding the physical layout and performance practices of ancient Greek drama.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The parascene was in the center of the stage.","correct":"✓ The parascene was on the side of the stage.","note":"The parascene is located on the sides of the stage, not in the center."},{"incorrect":"✗ The parascene was used for the chorus.","correct":"✓ The orchestra was used for the chorus.","note":"The orchestra, not the parascene, was the space for the chorus."}],"priority":"★☆☆"},"related_words":{"derivatives":["parascenia (plural of parascenium, sometimes used synonymously but less common)"],"related_terms":["skene (stage building)","proscenium (the part of a theater stage in front of the curtain)","orchestra (the circular space in front of the stage where the chorus performed)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency - specialized architectural and theatrical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"parascene\" is a specialized term related to ancient Greek theatre architecture. It refers to the side buildings or wings flanking the stage (skēnḗ). Understanding this term requires knowledge of ancient Greek theatre design and terminology. It is not commonly used outside of academic or specialized contexts. Therefore, it is considered a high-level vocabulary word.","priority":"★☆☆"},"example_sentences":[{"sentence":"The actors made their grand entrance from the left parascene.","translation":"役者たちは左の舞台袖から華々しく登場した。","type":"noun","meaning_category":"舞台袖"},{"sentence":"The design of the parascene influenced the acoustics of the ancient theater.","translation":"舞台袖のデザインは古代劇場の音響に影響を与えた。","type":"noun","meaning_category":"舞台の左右にある建物"}]}