{"word":"unpugnaciously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"非好戦的に、けんか腰でなく、平和的に","english_definition":"in a non-combative or non-aggressive manner; without a readiness to fight or argue.","examples":[{"sentence":"He approached the negotiation unpugnaciously, seeking a peaceful resolution.","translation":"彼は平和的な解決を求めて、その交渉に非好戦的に臨んだ。"},{"sentence":"She unpugnaciously presented her arguments, focusing on common ground rather than conflict.","translation":"彼女は対立点ではなく共通点に焦点を当て、けんか腰にならずに自分の主張を述べた。"}],"collocations":["act unpugnaciously","speak unpugnaciously","behave unpugnaciously","approach unpugnaciously"],"synonyms":["peacefully","amicably","non-aggressively","mildly","gently","placidly"],"antonyms":["pugnaciously","aggressively","belligerently","combatively","contentiously"]}],"etymology":{"value":"「un-」(否定) + 「pugnacious」(好戦的な) + 「-ly」(副詞化)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌn.pʌɡˈneɪ.ʃəs.li/","syllables":"un-pug-na-cious-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Unpugnaciously\" describes the manner in which an action is performed, indicating a lack of aggression or a desire to avoid conflict. It is the opposite of \"pugnaciously,\" which means in a combative or argumentative way. The word is relatively rare and formal, often used in contexts where the avoidance of conflict is emphasized.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unpugnaciously attitude was helpful.","correct":"✓ His unpugnacious attitude was helpful.","note":"\"unpugnaciously\" is an adverb, so it modifies a verb, adjective, or another adverb, not a noun. The adjective form \"unpugnacious\" should be used to describe a noun. "},{"incorrect":"✗ She approached the problem unpugnacious.","correct":"✓ She approached the problem unpugnaciously.","note":"\"Unpugnacious\" is an adjective, whereas \"unpugnaciously\" is an adverb. Since it is modifying the verb \"approached\", the adverb form should be used."}],"priority":"★★☆"},"related_words":{"derivatives":["pugnacious (adjective: 好戦的な)","pugnacity (noun: 好戦性)","unpugnacious (adjective: 非好戦的な)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unpugnaciously\" is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"pugnaciously,\" which itself means \"in a combative or argumentative manner.\" Therefore, \"unpugnaciously\" means \"in a manner that is not combative or argumentative.\" It describes someone who avoids fights or arguments and prefers a peaceful approach. This word is relatively uncommon and is used in formal contexts to emphasize the absence of aggression or hostility.","priority":"★☆☆"},"example_sentences":[{"sentence":"The diplomats worked unpugnaciously to find common ground and avoid escalating the conflict.","translation":"外交官たちは共通点を見つけ、紛争の激化を避けるために非好戦的に尽力した。","type":"adverb","meaning_category":"非好戦的に"},{"sentence":"Even when provoked, she responded unpugnaciously, maintaining a calm and respectful demeanor.","translation":"挑発されても、彼女は冷静で敬意を払った態度を維持し、けんか腰にならずに応じた。","type":"adverb","meaning_category":"非好戦的に"}]}