{"word":"Upwheel","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A wheel that is located above other wheels, or that is oriented in an upward direction.","english_definition":"A wheel positioned above other wheels or oriented upwards.","examples":[{"sentence":"The design incorporates an upwheel to improve stability.","translation":"その設計には、安定性を向上させるためのアップホイールが組み込まれています。"},{"sentence":"The upwheel must be properly aligned for optimal performance.","translation":"最適なパフォーマンスを得るには、アップホイールを適切に調整する必要があります。"}],"collocations":["upwheel alignment","upwheel design","upwheel mechanism"],"synonyms":["overhead wheel","upper wheel"],"antonyms":["downwheel","lower wheel"]}],"etymology":{"value":"Combination of 'up' and 'wheel', indicating the wheel's position or orientation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌpwiːl/","syllables":"up-wheel"},"inflection":{"noun_plural":"upwheels"},"usage_notes":{"explanation":"The term 'upwheel' is relatively uncommon and may be specific to certain technical or engineering contexts. It refers to a wheel that is positioned higher than other wheels in a system or one that is oriented in an upward direction. Its usage is often found in specialized fields where the vertical positioning of wheels is significant.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The car has an upwheel for steering.","correct":"✓ The car has a steering wheel.","note":"'Upwheel' is not a standard term for a steering wheel. Use 'steering wheel' instead."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Upwheel' is a technical term that is not commonly used in everyday language. It is typically found in engineering or mechanical contexts where the position of a wheel relative to others is important. Understanding the term requires some familiarity with technical vocabulary."},"example_sentences":[{"sentence":"The conveyor belt system uses an upwheel to guide the materials.","translation":"コンベヤーベルトシステムは、材料を誘導するためにアップホイールを使用しています。","type":"noun","meaning_category":"Wheel position"},{"sentence":"The upwheel's diameter affects the speed of the mechanism.","translation":"アップホイールの直径は、メカニズムの速度に影響を与えます。","type":"noun","meaning_category":"Wheel orientation"}]}