{"word":"spermalist","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"(historical) A person who believed in the theory of preformationism, specifically the idea that a fully formed, miniature human (a homunculus) existed within the sperm.","english_definition":"(historical) A proponent of spermatism, the preformationist theory that the complete organism is preformed in the sperm.","examples":[{"sentence":"The spermalists argued that the female only provided nourishment for the preformed homunculus.","translation":"精子論者たちは、女性はあらかじめ形成されたホムンクルスに栄養を与えるだけだと主張した。"},{"sentence":"Spermalist theories were eventually superseded by epigenetic views of development.","translation":"精子論の理論は、最終的に発生における後成説的な見解に取って代わられた。"}],"collocations":["spermalist theory","opponents of spermalism"],"synonyms":["spermist","animalculist"],"antonyms":["ovist (believer in the egg as the preformed entity)"]}],"etymology":{"value":"From 'sperm' (seed) + '-alist' (one who believes in or advocates).","priority":"Medium"},"pronunciation":{"ipa":"/ˈspɜːrməlɪst/","syllables":"sper-ma-list"},"inflection":{"noun_plural":"spermalists"},"usage_notes":{"explanation":"The term 'spermalist' refers to a historical scientific viewpoint that is no longer considered valid. It is primarily used in the context of the history of biology and embryology.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a spermalist, so he doesn't believe in genetics.","correct":"✓ He was a spermalist; the theory is outdated.","note":"Spermalism is an outdated theory, so it's incorrect to refer to someone as a current believer."}],"priority":"Medium"},"related_words":{"derivatives":["spermatism","preformationism","homunculus"],"related_concepts":["epigenesis","ovism","embryology","history of science"],"priority":"Medium"},"level_frequency":{"frequency_google_ngram":"Very Low","priority":"High"},"readability_explanation":{"level":"C2","text":"The word 'spermalist' is a technical term related to the history of science, specifically the now-discredited theory of preformationism. It is unlikely to be encountered outside of academic or historical contexts. Understanding requires familiarity with the history of biology and the concept of preformationism.","priority":"High"},"example_sentences":[{"sentence":"The spermalist view of reproduction dominated scientific thought for a time.","translation":"生殖に関する精子論者の見解は、一時的に科学的な思考を支配した。","type":"general","meaning_category":"historical theory"},{"sentence":"Leeuwenhoek's observations of sperm contributed to the rise of spermalist ideas.","translation":"レーウェンフックの精子の観察は、精子論の思想の台頭に貢献した。","type":"historical","meaning_category":"historical context"}]}