{"word":"Sizarship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(特にダブリン大学トリニティ・カレッジにおける)授業料免除奨学生の地位、またはその奨学金","english_definition":"A scholarship or position at certain universities (especially Trinity College, Dublin) that provides free or reduced-cost tuition and sometimes other benefits to students of limited financial means.","examples":[{"sentence":"He obtained a Sizarship at Trinity College, which allowed him to study without paying tuition fees.","translation":"彼はトリニティ・カレッジで授業料免除奨学生の地位を得て、授業料を払わずに勉強することができた。"},{"sentence":"The Sizarship competition is highly competitive.","translation":"授業料免除奨学生の選考は非常に競争率が高い。"}],"collocations":["obtain a Sizarship","compete for a Sizarship","hold a Sizarship","Sizarship examination"],"synonyms":["scholarship","bursary","fellowship","grant"],"antonyms":[]}],"etymology":{"value":"The term 'sizar' is believed to derive from 'size', referring to the portion of food or drink that a student received at a reduced price or for free. The suffix '-ship' denotes a state, condition, or office.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsaɪzərʃɪp/","syllables":"Si-zer-ship"},"inflection":{"noun_plural":"Sizarships"},"usage_notes":{"explanation":"A 'Sizarship' is a specific type of scholarship primarily associated with Trinity College, Dublin, though similar arrangements may have existed or continue to exist at other universities. It is designed to assist students who may not have the financial resources to afford tuition. Historically, Sizars performed certain duties in exchange for their benefits, but this is not always the case today. The term and the system it represents are relatively uncommon outside of the context of these specific universities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He received a scholarship, it was a sizarship.","correct":"✓ He received a sizarship.","note":"'Sizarship' is a specific type of scholarship, so it's more accurate to use the specific term when applicable."},{"incorrect":"✗ Sizarships are available at all universities.","correct":"✓ Sizarships are primarily associated with Trinity College, Dublin.","note":"Sizarships are not universally available; they are specific to certain institutions."}],"priority":"★☆☆"},"related_words":{"derivatives":["sizar (noun: a student holding a sizarship)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Very rare - specific to certain academic institutions)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sizarship' refers to a specific type of scholarship, primarily at Trinity College, Dublin, awarded to students from lower-income backgrounds. It provides financial assistance, often in the form of free or reduced tuition. The term is quite specialized and not commonly used outside of the context of these particular academic institutions. Understanding the historical context and the specific universities where it applies is essential for comprehension."},"example_sentences":[{"sentence":"Earning a Sizarship was a significant achievement for him, as it meant he could afford to attend university.","translation":"授業料免除奨学生の地位を得ることは彼にとって大きな成果だった。なぜなら、大学に通う費用を捻出できるようになったからだ。","type":"noun","meaning_category":"scholarship"},{"sentence":"The requirements for a Sizarship include academic excellence and demonstrated financial need.","translation":"授業料免除奨学生の要件には、優れた学業成績と経済的必要性の証明が含まれる。","type":"noun","meaning_category":"scholarship"}]}