{"word":"vice-deity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"副神、代理神","english_definition":"A deity who acts as a representative or subordinate to a higher deity.","examples":[{"sentence":"In some polytheistic religions, certain deities serve as vice-deities, managing specific aspects of the world under the authority of a supreme god.","translation":"多神教の宗教によっては、特定の神々が副神として、最高神の権威の下で世界の特定の側面を管理する。"},{"sentence":"The concept of a vice-deity is often used to explain the complex hierarchy within a pantheon.","translation":"副神という概念は、しばしば神殿内の複雑な階層を説明するために用いられる。"}],"collocations":["act as a vice-deity","serve as a vice-deity","a pantheon of vice-deities"],"synonyms":["demigod","minor deity","subordinate deity"],"antonyms":["supreme deity","primary deity"]}],"etymology":{"value":"The term is a combination of 'vice-' (meaning 'in place of' or 'subordinate') and 'deity' (meaning 'god' or 'goddess'). It suggests a deity who holds a position secondary to a more powerful or principal deity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvaɪs ˈdiːɪti/","syllables":"vice-de-i-ty"},"inflection":{"noun_plural":"vice-deities"},"usage_notes":{"explanation":"The term 'vice-deity' is used to describe a deity that is subordinate to a higher-ranking god or goddess within a pantheon. These deities often have specific roles or responsibilities and act as intermediaries between the supreme deity and the mortal world. The concept is common in polytheistic religions and mythologies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The vice-deity was more powerful than the main god.","correct":"✓ The vice-deity was less powerful than the main god.","note":"A vice-deity is, by definition, subordinate to the main deity and therefore less powerful."}],"priority":"★★☆"},"related_words":{"derivatives":["vicegerent (noun: a person appointed to exercise delegated power on behalf of a ruler or official)","deity (noun: a god or goddess)","pantheon (noun: all the gods of a people or religion collectively)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'vice-deity' refers to a god or goddess that is subordinate to a more powerful deity. This concept is often found in polytheistic religions where a hierarchy of gods exists. Understanding this term requires familiarity with religious studies and mythology. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"As a vice-deity, she governed the realm of the sea under the authority of the chief god.","translation":"副神として、彼女は最高神の権威の下で海の領域を統治した。","type":"general"},{"sentence":"The ancient texts describe several vice-deities, each responsible for different aspects of nature.","translation":"古代の文献には、それぞれが自然の異なる側面を担当するいくつかの副神が記述されている。","type":"general"}]}