{"word":"antagonistical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"対立的な、反抗的な、敵対的な","english_definition":"showing or feeling active opposition or hostility toward someone or something.","examples":[{"sentence":"His antagonistical attitude made it difficult to negotiate.","translation":"彼の敵対的な態度のせいで交渉は難航した。"},{"sentence":"She had an antagonistical relationship with her boss.","translation":"彼女は上司と敵対的な関係にあった。"},{"sentence":"The two groups have taken antagonistical positions on the issue.","translation":"その問題について、二つのグループは対立的な立場を取っている。"}],"collocations":["antagonistical attitude (敵対的な態度)","antagonistical relationship (敵対的な関係)","antagonistical position (対立的な立場)","antagonistical behavior (敵対的な行動)","antagonistical approach (敵対的なアプローチ)"],"synonyms":["antagonistic","hostile","opposing","adversarial","belligerent","combative","confrontational"],"antonyms":["friendly","cooperative","harmonious","amicable","agreeable"]}],"etymology":{"value":"\"Antagonistical\" is formed by adding the suffix \"-ical\" to \"antagonist\". \"Antagonist\" comes from the Greek word \"antagonistes,\" meaning \"opponent, rival,\" which is derived from \"antagonizesthai,\" meaning \"to struggle against.\" The suffix \"-ical\" is used to form adjectives indicating a quality or relation.","priority":"★★☆"},"pronunciation":{"ipa":"/ænˌtæɡəˈnɪstɪkəl/","syllables":"an-tag-o-nis-ti-cal"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"\"Antagonistical\" is an adjective that describes someone or something showing active opposition or hostility. It is closely related to \"antagonistic,\" and while both words have similar meanings, \"antagonistical\" is less commonly used. It emphasizes a disposition or behavior that is actively confrontational or resistant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was very antagonistical with the plan.","correct":"✓ He was very antagonistic to the plan. / ✓ He was very antagonistical towards the plan.","note":"When using \"antagonistical,\" it is often followed by \"towards\" to indicate the object of the hostility. \"Antagonistic\" can be followed by \"to.\" Both require a preposition. However, \"antagonistic\" is more commonly used. "},{"incorrect":"✗ She acted antagonistical.","correct":"✓ She acted antagonistically. / ✓ She acted in an antagonistical manner.","note":"To describe how someone acted, use the adverb \"antagonistically\" or the phrase \"in an antagonistical manner.\" \"Antagonistical\" itself is an adjective and needs a noun to modify."}],"priority":"★★☆"},"related_words":{"derivatives":["antagonism (名詞: 敵意、反感、対立)","antagonize (動詞: 敵に回す、反感を買う、怒らせる)","antagonist (名詞: 敵対者、反対者、(物語の)悪役)","antagonistic (形容詞: 敵対的な、反抗的な)","antagonistically (副詞: 敵対的に、反抗的に)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare usage, but understanding may be required in advanced texts)","frequency_google_ngram":"Low frequency - The word \"antagonistic\" is much more common.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Antagonistical\" is a less common synonym for \"antagonistic,\" meaning showing active opposition or hostility. It is used to describe attitudes, behaviors, or relationships characterized by conflict or resistance. While its meaning is similar to \"antagonistic,\" it is used less frequently, and understanding it is more relevant for advanced English comprehension. The more common term is \"antagonistic.\""},"example_sentences":[{"sentence":"The politician's antagonistical remarks sparked a heated debate.","translation":"その政治家の敵対的な発言は激しい議論を引き起こした。","type":"adjective","meaning_category":"敵対的な"},{"sentence":"Their antagonistical approach to problem-solving only made things worse.","translation":"彼らの問題解決に対する敵対的なアプローチは事態を悪化させただけだった。","type":"adjective","meaning_category":"敵対的な"},{"sentence":"The two companies had an antagonistical history, marked by years of legal battles.","translation":"その二つの会社は、長年の法廷闘争によって特徴づけられる敵対的な歴史を持っていた。","type":"adjective","meaning_category":"敵対的な"}]}