{"word":"undernam","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語)午後の軽食、軽い夕食","english_definition":"(archaic) An afternoon snack or light supper.","examples":[{"sentence":"In days of old, a simple undernam would suffice to stave off hunger before the evening meal.","translation":"昔は、夕食までの空腹を満たすには、簡単な午後の軽食で十分だった。"}],"collocations":[],"synonyms":["afternoon snack","light supper","collation"],"antonyms":["breakfast","dinner"]}],"etymology":{"value":"Derived from Middle English 'undern', referring to the third hour of the day (approximately 9 a.m.), and 'nam', meaning 'to take' or 'seize'. Originally, it referred to a morning meal or drink, but later shifted to an afternoon snack.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌndərˌnæm/","syllables":"un-der-nam"},"inflection":{"noun_plural":"undernams"},"usage_notes":{"explanation":"'Undernam' is an archaic term rarely used in modern English. It historically referred to a light meal taken in the afternoon, similar to a snack or light supper. Its usage is primarily found in historical texts or when attempting to evoke a sense of old-fashioned language.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I had an undernam for breakfast.","correct":"✓ I had an undernam in the afternoon.","note":"'Undernam' refers to an afternoon snack, not breakfast."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (archaic)","frequency_google_ngram":"Extremely low.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Undernam' is an archaic word, meaning it is very old and rarely used in modern English. It refers to a light meal or snack taken in the afternoon. Because of its rarity, it is typically encountered only in historical contexts or literature. Understanding this word requires a strong grasp of historical language usage."},"example_sentences":[{"sentence":"The weary travelers paused for an undernam before continuing their journey.","translation":"疲れた旅人たちは旅を続ける前に、午後の軽食のために休憩した。","type":"noun","meaning_category":"afternoon snack"},{"sentence":"She prepared a simple undernam of bread and cheese.","translation":"彼女はパンとチーズの簡単な午後の軽食を用意した。","type":"noun","meaning_category":"light supper"}]}