{"word":"nonnomad","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"定住者、遊牧民でない人","english_definition":"A person who does not live a nomadic lifestyle; a settled person.","examples":[{"sentence":"The rise of agriculture led to a shift from nomadic to nonnomadic societies.","translation":"農業の発展は、遊牧社会から定住社会への移行をもたらした。"},{"sentence":"Most people today are nonnomads, living in cities and towns.","translation":"今日、ほとんどの人は都市や町に住む定住者である。"}],"collocations":["settled person","sedentary individual"],"synonyms":["settler","resident","inhabitant"],"antonyms":["nomad","wanderer","migrant"]},{"part_of_speech":"adjective","definition":"定住性の、遊牧的でない","english_definition":"Not nomadic; characterized by a settled lifestyle.","examples":[{"sentence":"Nonnomadic cultures tend to develop more complex social structures.","translation":"定住文化は、より複雑な社会構造を発展させる傾向がある。"},{"sentence":"The transition to a nonnomadic existence allowed for the accumulation of wealth and resources.","translation":"定住生活への移行は、富と資源の蓄積を可能にした。"}],"collocations":["settled","sedentary","stationary"],"synonyms":["settled","sedentary","fixed"],"antonyms":["nomadic","migratory","wandering"]}],"etymology":{"value":"Derived from \"nomad\" with the addition of the prefix \"non-\", indicating negation or absence.","priority":"★★★"},"pronunciation":{"ipa":"/nɒnˈnoʊmæd/","syllables":"non-no-mad"},"inflection":{"noun_plural":"nonnomads"},"usage_notes":{"explanation":"The term \"nonnomad\" is primarily used in anthropological, sociological, and historical contexts to contrast settled populations with nomadic ones. It emphasizes the lifestyle and societal structures associated with settled living, such as agriculture, urbanization, and the development of complex social hierarchies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non nomad person.","correct":"✓ He is a nonnomad.","note":"The word \"nonnomad\" already implies a person, so adding \"person\" is redundant."},{"incorrect":"✗ The non-nomad life is easier.","correct":"✓ The nonnomadic life is easier.","note":"When used as an adjective, the correct form is \"nonnomadic\"."}],"priority":"★★☆"},"related_words":{"derivatives":["nomad","nomadic","nomadism"],"related_concepts":["sedentary","settled","agriculture","urbanization"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonnomad\" is a relatively uncommon term, mainly used in academic or specialized discussions about different lifestyles and societal structures. It is generally understood as the opposite of \"nomad,\" referring to people who live in a fixed location rather than migrating from place to place. Understanding this word requires some familiarity with concepts in anthropology, sociology, or history.","priority":"★☆☆"},"example_sentences":[{"sentence":"Archaeological evidence suggests that the area was inhabited by both nomadic and nonnomadic groups.","translation":"考古学的証拠は、その地域が遊牧民と定住者の両方のグループによって居住されていたことを示唆している。","type":"general","meaning_category":"General"},{"sentence":"The development of agriculture was a key factor in the transition from nomadic to nonnomadic societies.","translation":"農業の発展は、遊牧社会から定住社会への移行における重要な要素であった。","type":"historical","meaning_category":"Historical"},{"sentence":"Nonnomadic populations tend to have more elaborate systems of governance and social organization.","translation":"定住人口は、より精巧な統治システムと社会組織を持つ傾向がある。","type":"sociological","meaning_category":"Sociological"}]}