{"word":"music-secondary","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A music genre that is a subgenre or derivative of another, more established music genre.","english_definition":"A musical genre that is a subcategory or derivative of a primary or more established genre.","examples":[{"sentence":"Grunge is a music-secondary genre that evolved from punk rock and heavy metal.","translation":"グランジは、パンクロックやヘビーメタルから派生した音楽の二次ジャンルです。"},{"sentence":"Chillwave is a music-secondary genre, building upon elements of electronica and dream pop.","translation":"チルウェイブは、エレクトロニカやドリームポップの要素を基に構築された音楽の二次ジャンルです。"}],"collocations":["secondary genre","subgenre","derivative genre","music genre"],"synonyms":["subgenre","derivative genre"],"antonyms":["primary genre","mainstream genre"]}],"etymology":{"value":"The term combines 'music,' referring to the art form, with 'secondary,' indicating a subordinate or derivative status.","priority":"N/A"},"pronunciation":{"ipa":"/ˈmjuːzɪk ˌsɛkənˌdɛri/","syllables":"mu-sic sec-on-da-ry"},"inflection":{"noun_plural":"music-secondaries"},"usage_notes":{"explanation":"The term 'music-secondary' is used to describe genres that are not considered primary or mainstream genres but rather are offshoots or combinations of existing genres. It helps categorize music more specifically.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ This band plays music secondary.","correct":"✓ This band plays a music-secondary genre.","note":"It's important to use the term as a noun or adjective describing a genre, not as an adverb."},{"incorrect":"✗ Music-secondary is more popular than rock.","correct":"✓ A music-secondary genre is more popular than rock.","note":"'Music-secondary' refers to a category of genres, not a specific genre itself."}],"priority":"N/A"},"related_words":{"derivatives":["subgenre","derivative","genre"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. It is a descriptive term rather than a commonly used genre label.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Music-secondary' is a term used to describe a subcategory of music genres that are derived from more established or primary genres. It's a descriptive term used in music analysis and discussion to categorize music more specifically than just using broad genre labels."},"example_sentences":[{"sentence":"Dubstep is often considered a music-secondary genre, evolving from UK garage and drum and bass.","translation":"ダブステップは、UKガラージやドラムンベースから派生した音楽の二次ジャンルと見なされることが多いです。","type":"noun","meaning_category":"genre classification"},{"sentence":"Many experimental bands explore music-secondary genres to create unique sounds.","translation":"多くの実験的なバンドは、ユニークなサウンドを作成するために、音楽の二次ジャンルを探求しています。","type":"noun","meaning_category":"genre exploration"}]}