{"word":"plasticimeter","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"可塑性計：物質の可塑性を測定する器具","english_definition":"An instrument for measuring the plasticity of a substance.","examples":[{"sentence":"The plasticimeter is used to determine the consistency of clay.","translation":"可塑性計は粘土の硬さを測定するために使用されます。"},{"sentence":"The readings from the plasticimeter helped to optimize the manufacturing process.","translation":"可塑性計からの読み取り値は、製造プロセスを最適化するのに役立ちました。"}],"collocations":["use a plasticimeter","plasticimeter reading","measure with a plasticimeter"],"synonyms":["viscometer","rheometer"],"antonyms":[]}],"etymology":{"value":"\"plastic\"（可塑性）+ \"-i-\"（連結）+ \"-meter\"（計器）","priority":"★★★"},"pronunciation":{"ipa":"/ˌplæstɪˈsɪmɪtər/","syllables":"plas-ti-sim-e-ter"},"inflection":{"noun_plural":"plasticimeters"},"usage_notes":{"explanation":"A plasticimeter is a scientific instrument used to measure the plasticity or consistency of materials, particularly those that exhibit plastic behavior. It is commonly used in industries such as ceramics, food processing, and polymer manufacturing to ensure product quality and consistency.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plasticimeter measures elasticity.","correct":"✓ The plasticimeter measures plasticity.","note":"Plasticity and elasticity are different properties. Plasticity refers to the ability of a material to undergo permanent deformation without breaking, while elasticity refers to its ability to return to its original shape after deformation."}],"priority":"★★☆"},"related_words":{"derivatives":["plasticity","plastic","meter"],"related_terms":["rheology","viscosity","consistency"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'plasticimeter' refers to a specialized instrument used to measure the plasticity of materials. Understanding its function requires knowledge of material science and engineering principles. It is not commonly encountered outside of technical contexts."},"example_sentences":[{"sentence":"The engineer used a plasticimeter to assess the workability of the clay mixture.","translation":"エンジニアは粘土混合物の加工性を評価するために可塑性計を使用しました。","type":"general","meaning_category":"measurement"},{"sentence":"Data from the plasticimeter helped refine the formula for the new polymer.","translation":"可塑性計からのデータは、新しいポリマーの処方を改良するのに役立ちました。","type":"technical","meaning_category":"research"}]}