{"word":"neighborstained","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(造語)隣人に汚された、隣人によって汚染された、隣人との関係によって汚された","english_definition":"(neologism) stained or tainted by one's neighbors or neighborhood; having one's character or reputation negatively affected by association with neighbors.","examples":[{"sentence":"The once pristine reputation of the street was now neighborstained by the recent scandal.","translation":"かつては申し分のなかったその通りの評判は、最近のスキャンダルによって隣人関係によって汚されてしまった。"},{"sentence":"He felt his own integrity was neighborstained simply by living next door to such a disreputable character.","translation":"彼は、そのような評判の悪い人物の隣に住んでいるだけで、自分の誠実さが隣人によって汚されたと感じた。"}],"collocations":["neighborstained reputation","neighborstained integrity","neighborstained community"],"synonyms":["tainted","contaminated","besmirched","defiled","sullied","disgraced"],"antonyms":["unblemished","pristine","untainted","unaffected"]}],"etymology":{"value":"A blend of 'neighbor' and 'stained'. A neologism likely created to express the idea of being negatively affected or tainted by one's neighbors or neighborhood.","priority":"★★★"},"pronunciation":{"ipa":"/ˈneɪbərˌsteɪnd/","syllables":"neigh-bor-stained"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used predicatively with a linking verb (e.g., 'is neighborstained'). It does not have typical comparative or superlative forms (e.g., *more neighborstained, *most neighborstained)."},"usage_notes":{"explanation":"'Neighborstained' is a relatively rare and likely recently coined word. It is used to describe a situation where someone or something has been negatively affected or tainted by their association with neighbors or the surrounding neighborhood. It carries a connotation of moral or reputational damage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The paint was neighborstained.","correct":"✓ The reputation was neighborstained.","note":"'Neighborstained' is typically used to describe abstract qualities like reputation, integrity, or a community's character, rather than physical objects."},{"incorrect":"✗ He neighborstained the community.","correct":"✓ The community was neighborstained by his actions.","note":"'Neighborstained' is typically used as an adjective to describe something that has been affected, rather than as a verb to describe the act of affecting something."}],"priority":"★★☆"},"related_words":{"derivatives":["neighbor (noun)","stain (verb, noun)","stained (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (neologism, not in standard CEFR vocabulary)","frequency_google_ngram":"Very low (likely too rare to appear in Google Ngram)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Neighborstained' is a complex and uncommon word. Understanding it requires recognizing the combination of 'neighbor' and 'stained' and inferring the meaning from the context. It is likely to be encountered only in advanced texts or creative writing where the author is aiming for a specific effect. The word carries a strong negative connotation and implies a loss of purity or reputation due to association with undesirable elements in the neighborhood."},"example_sentences":[{"sentence":"The small town's idyllic image was neighborstained by the arrival of a controversial factory.","translation":"その小さな町の牧歌的なイメージは、物議を醸す工場の到来によって、隣人関係によって汚されてしまった。","type":"adjective","meaning_category":"汚染された"},{"sentence":"Despite his best efforts, his family name remained neighborstained due to his father's past misdeeds.","translation":"彼の最善の努力にもかかわらず、彼の家族の名前は父親の過去の不正行為のために、隣人関係によって汚されたままだった。","type":"adjective","meaning_category":"汚染された"},{"sentence":"The artist explored themes of community and how shared spaces can become neighborstained by conflict and neglect.","translation":"そのアーティストは、コミュニティのテーマと、共有スペースが紛争と無視によってどのように隣人関係によって汚されるかを考察した。","type":"adjective","meaning_category":"汚染された"}]}