{"word":"equiprobability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"等確率、各事象が等しい確率で起こること","english_definition":"The state of being equally probable; the condition where each event has the same probability of occurring.","examples":[{"sentence":"The equiprobability of each outcome is a key assumption in many statistical tests.","translation":"各結果の等確率は、多くの統計的検定における重要な仮定です。"},{"sentence":"In a fair coin toss, heads and tails have equiprobability.","translation":"公正なコイントスでは、表と裏は等確率です。"},{"sentence":"The principle of equiprobability is fundamental to classical probability theory.","translation":"等確率の原理は、古典的な確率論の基礎です。"}],"collocations":["assume equiprobability (等確率を仮定する)","principle of equiprobability (等確率の原理)","test for equiprobability (等確率を検定する)"],"synonyms":["equal probability","uniform probability"],"antonyms":["unequal probability","non-equiprobability"]}],"etymology":{"value":"Derived from 'equi-' (equal) + 'probability' (the extent to which something is likely to occur).","priority":"★★☆"},"pronunciation":{"ipa":"ˌekwɪˌprɒbəˈbɪləti","syllables":"e-qui-pro-ba-bi-li-ty"},"inflection":{"noun_plural":"equiprobabilities"},"usage_notes":{"explanation":"'Equiprobability' is a term primarily used in probability theory and statistics. It refers to situations where all possible outcomes of an event have an equal chance of occurring. This assumption simplifies many calculations and is foundational to understanding basic probability concepts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The equiprobability is when one outcome is more likely.","correct":"✓ Equiprobability is when all outcomes are equally likely.","note":"Equiprobability means equal likelihood, not unequal."},{"incorrect":"✗ Equiprobability is not important in statistics.","correct":"✓ Equiprobability is an important assumption in many statistical tests.","note":"Equiprobability is a key assumption in various statistical analyses."}],"priority":"★★☆"},"related_words":{"derivatives":["equiprobable (adjective)"],"phrases":["equally likely","uniform distribution"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Equiprobability' is a term used in mathematics and statistics to describe situations where all possible outcomes of an event have an equal chance of occurring. This concept is often used as a starting point for understanding probability and is essential for certain statistical tests. It's a more advanced term, so it's typically encountered in higher-level math or statistics courses."},"example_sentences":[{"sentence":"Assuming **equiprobability**, the probability of rolling any specific number on a fair six-sided die is 1/6.","translation":"等確率を仮定すると、公正な6面サイコロで特定の数字を出す確率は1/6です。","type":"example","meaning_category":"definition"},{"sentence":"The **equiprobability** of events is a crucial factor in determining the validity of a random sample.","translation":"事象の等確率は、ランダムサンプルの妥当性を判断する上で重要な要素です。","type":"example","meaning_category":"definition"},{"sentence":"Violations of **equiprobability** can lead to biased results in statistical analyses.","translation":"等確率の違反は、統計分析において偏った結果につながる可能性があります。","type":"example","meaning_category":"definition"}]}