{"word":"thrombophlebitis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"血栓性静脈炎","english_definition":"inflammation of a vein associated with thrombus (blood clot) formation.","examples":[{"sentence":"She was diagnosed with thrombophlebitis in her leg.","translation":"彼女は脚の血栓性静脈炎と診断された。"},{"sentence":"Symptoms of thrombophlebitis include pain, swelling, and redness.","translation":"血栓性静脈炎の症状には、痛み、腫れ、発赤などがある。"}],"collocations":["superficial thrombophlebitis (表在性血栓性静脈炎)","deep vein thrombophlebitis (深部静脈血栓性静脈炎)","septic thrombophlebitis (化膿性血栓性静脈炎)"],"synonyms":["phlebitis","venous thrombosis"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'thrombo-' (clot), 'phleb-' (vein), and '-itis' (inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθrɒmbəflɪˈbaɪtɪs/","syllables":"throm-bo-phle-bi-tis"},"inflection":{"noun_plural":"thrombophlebitides (rare)"},"usage_notes":{"explanation":"Thrombophlebitis refers to the inflammation of a vein caused by a blood clot. It can occur in superficial veins (superficial thrombophlebitis) or deep veins (deep vein thrombophlebitis, DVT). DVT is a more serious condition because the clot can travel to the lungs, causing a pulmonary embolism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ thrombophlebitis is a bacteria infection.","correct":"✓ thrombophlebitis is caused by a blood clot.","note":"Thrombophlebitis is caused by a blood clot, not a bacterial infection, although infection can sometimes be a contributing factor."}],"priority":"★★☆"},"related_words":{"derivatives":["thrombotic (adjective: relating to or resulting from thrombosis)","thrombus (noun: a blood clot formed in situ within the vascular system of the body and impeding blood flow)","phlebitis (noun: inflammation of a vein)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thrombophlebitis' is a medical term referring to the inflammation of a vein caused by a blood clot. It's important to understand that this condition involves both inflammation and the presence of a clot. The term is typically used in medical contexts and may not be commonly encountered in everyday conversation. Superficial thrombophlebitis affects veins near the skin's surface, while deep vein thrombophlebitis (DVT) affects deeper veins and is a more serious condition due to the risk of pulmonary embolism."},"example_sentences":[{"sentence":"The patient presented with symptoms consistent with thrombophlebitis.","translation":"患者は血栓性静脈炎に一致する症状を呈した。","type":"general","meaning_category":"general"},{"sentence":"Treatment for thrombophlebitis may include anticoagulants and compression stockings.","translation":"血栓性静脈炎の治療には、抗凝固薬や圧迫ストッキングが含まれる場合がある。","type":"treatment","meaning_category":"treatment"},{"sentence":"Deep vein thrombophlebitis can lead to serious complications if left untreated.","translation":"深部静脈血栓性静脈炎は、治療せずに放置すると重篤な合併症を引き起こす可能性がある。","type":"complications","meaning_category":"complications"}]}