{"word":"tomb-making","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"墓作り、墓石製作","english_definition":"The act or process of constructing tombs or tombstones.","examples":[{"sentence":"Tomb-making was a respected profession in ancient Egypt.","translation":"古代エジプトでは、墓作りは尊敬される職業でした。"},{"sentence":"He dedicated his life to tomb-making, creating beautiful memorials for the deceased.","translation":"彼は墓作りに生涯を捧げ、故人のために美しい記念碑を作りました。"}],"collocations":["tomb-making industry","art of tomb-making"],"synonyms":["tomb construction","tombstone carving"],"antonyms":[]}],"etymology":{"value":"Compound word formed from \"tomb\" and \"making\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtuːmˌmeɪkɪŋ/","syllables":"tomb-mak-ing"},"inflection":{"noun_plural":"tomb-makings"},"usage_notes":{"explanation":"This term is relatively rare and specific, primarily used in historical or archaeological contexts, or when discussing the craft of creating tombs. It implies the physical act of building or crafting a tomb, rather than the general concept of burial or commemoration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is in tomb-making business.","correct":"✓ He is in the tomb-making business.","note":"Use the definite article 'the' to specify the tomb-making business as a particular industry or field."}],"priority":"★☆☆"},"related_words":{"derivatives":["tomb","making"],"related_terms":["tombstone","crypt","mausoleum","sepulcher"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'tomb-making' is specialized and not commonly used in everyday conversation. It is more likely to appear in historical texts, archaeological reports, or discussions related to funerary practices and the construction of burial sites. Understanding requires familiarity with the concept of tombs and the process of their creation."},"example_sentences":[{"sentence":"Archaeological evidence suggests that tomb-making techniques varied significantly across different cultures.","translation":"考古学的証拠は、墓作りの技術が異なる文化間で大きく異なっていたことを示唆しています。","type":"noun","meaning_category":"墓作り"},{"sentence":"The art of tomb-making involved intricate carvings and detailed inscriptions.","translation":"墓作りの芸術には、複雑な彫刻と詳細な碑文が含まれていました。","type":"noun","meaning_category":"墓石製作"}]}