{"word":"Digamists","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Plural form of digamist; A person who practices or advocates digamy (a second marriage after being widowed or divorced).","english_definition":"Plural of digamist: A person who practices or advocates digamy (marriage to a second spouse after the death or divorce of the first).","examples":[{"sentence":"The community included several digamists, reflecting changing social norms.","translation":"そのコミュニティには、変化する社会規範を反映して、数人の重婚者が含まれていた。"}],"collocations":["group of digamists","religious digamists","historical digamists"],"synonyms":["successive spouses","remarried individuals"],"antonyms":["monogamist","bachelor","spinster"]}],"etymology":{"value":"From 'digamist', which comes from the Greek 'di-' (twice) + 'gamos' (marriage) + '-ist' (a person who does or believes).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɪɡəmɪsts/","syllables":"Dig-a-mists"},"inflection":{"noun_plural":"Digamists"},"usage_notes":{"explanation":"'Digamists' refers to multiple individuals who either practice or support the practice of digamy. Digamy is distinct from bigamy, which is being married to two people at the same time. Digamy involves marrying again after the death or divorce of a previous spouse.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The digamists is a common practice.","correct":"✓ Digamy is a common practice.","note":"'Digamists' is plural and refers to people. 'Digamy' is the practice itself."},{"incorrect":"✗ Digamists are illegal.","correct":"✓ Digamy is legal in most places.","note":"Digamy (remarriage after death or divorce of a spouse) is legal, unlike bigamy (being married to multiple people at the same time)."}],"priority":"★★☆"},"related_words":{"derivatives":["digamy","digamous"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Digamists' refers to multiple people who practice digamy, which is the act of marrying again after a previous marriage has ended due to death or divorce. This term is not commonly used in everyday language and is more often found in discussions about marriage, history, or social norms. It is important to differentiate it from bigamy, which is illegal in many countries and involves being married to more than one person at the same time."},"example_sentences":[{"sentence":"The study focused on the experiences of digamists in the 19th century.","translation":"その研究は、19世紀の重婚者の経験に焦点を当てた。","type":"noun","meaning_category":"people who practice digamy"},{"sentence":"Many digamists find happiness in their subsequent marriages.","translation":"多くの重婚者は、その後の結婚に幸せを見出す。","type":"noun","meaning_category":"people who practice digamy"}]}