{"word":"pyrgocephaly","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"塔状頭蓋、尖頭頭蓋","english_definition":"A congenital malformation of the skull characterized by a tower-like or cone-shaped head, resulting from premature fusion of the coronal suture and sometimes other sutures.","examples":[{"sentence":"Pyrgocephaly is a type of craniosynostosis.","translation":"塔状頭蓋は頭蓋骨縫合早期癒合症の一種である。"},{"sentence":"Surgical intervention is often required to correct pyrgocephaly.","translation":"塔状頭蓋を矯正するには、外科的介入が必要となることが多い。"}],"collocations":["correct pyrgocephaly (塔状頭蓋を矯正する)","treat pyrgocephaly (塔状頭蓋を治療する)","diagnose pyrgocephaly (塔状頭蓋を診断する)"],"synonyms":["turricephaly","oxycephaly","acrocephaly"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'pyrgos' (πύργος) meaning 'tower', 'kephale' (κεφαλή) meaning 'head', and '-ia' indicating a condition.","priority":"★★☆"},"pronunciation":{"ipa":"ˌpɪrɡoʊˈsɛfəli","syllables":"pyr-go-ceph-a-ly"},"inflection":{"noun_plural":"pyrgocephalies"},"usage_notes":{"explanation":"Pyrgocephaly is a relatively rare condition and is a specific type of craniosynostosis where the skull takes on a tower-like shape. It is important to note that while pyrgocephaly, turricephaly, oxycephaly, and acrocephaly are sometimes used interchangeably, there can be subtle distinctions in their specific presentations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said the baby had pyrgocephalic.","correct":"✓ The doctor said the baby had pyrgocephaly.","note":"'Pyrgocephaly' is the noun (the condition), while 'pyrgocephalic' would be the adjective (describing something related to the condition)."},{"incorrect":"✗ Pyrgocephaly is caused by the brain growing too fast.","correct":"✓ Pyrgocephaly is caused by premature fusion of certain skull sutures.","note":"The cause of pyrgocephaly is the premature fusion of cranial sutures, not the brain growing too fast."}],"priority":"★★☆"},"related_words":{"derivatives":["pyrgocephalic (adjective: relating to or having pyrgocephaly)","craniosynostosis (noun: premature fusion of cranial sutures)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pyrgocephaly' is a highly specialized medical term referring to a specific congenital skull malformation. Understanding this term requires familiarity with medical terminology related to congenital conditions and skeletal anatomy. It is primarily used within medical contexts. "},"example_sentences":[{"sentence":"The infant was diagnosed with pyrgocephaly based on physical examination and imaging studies.","translation":"その乳児は、身体検査と画像検査に基づいて塔状頭蓋と診断された。","type":"noun","meaning_category":"medical condition"},{"sentence":"Early diagnosis of pyrgocephaly is crucial for timely intervention.","translation":"塔状頭蓋の早期診断は、タイムリーな介入のために重要である。","type":"noun","meaning_category":"medical condition"},{"sentence":"The surgical team planned a complex procedure to correct the pyrgocephaly.","translation":"外科チームは、塔状頭蓋を矯正するための複雑な手術を計画した。","type":"noun","meaning_category":"medical condition"}]}