{"word":"fribbleism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The act of behaving foolishly or frivolously; a trivial or nonsensical action or statement.","english_definition":"Foolish or frivolous behavior; a trivial or nonsensical action or statement.","examples":[{"sentence":"His speech was full of fribbleisms, making it difficult to take him seriously.","translation":"彼の演説はくだらないことばかりで、真剣に受け止めるのが難しかった。"},{"sentence":"She dismissed the argument as mere fribbleism.","translation":"彼女はその議論を単なるくだらないこととして退けた。"}],"collocations":["utter a fribbleism","engage in fribbleism","dismiss as fribbleism"],"synonyms":["folly","frivolity","nonsense","triviality","silliness"],"antonyms":["seriousness","wisdom","gravity"]}],"etymology":{"value":"Derived from the verb 'fribble,' meaning to behave in a frivolous or foolish manner.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfrɪbəlɪzəm/","syllables":"frib-ble-ism"},"inflection":{"noun_plural":"fribbleisms"},"usage_notes":{"explanation":"'Fribbleism' is a relatively rare word used to describe actions or statements that are considered trivial, foolish, or lacking in seriousness. It is often used to dismiss or criticize someone's behavior or ideas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fribbleism of the situation made everyone laugh.","correct":"✓ The frivolity of the situation made everyone laugh.","note":"'Fribbleism' refers to the act or statement itself, not the quality of the situation. 'Frivolity' is more appropriate to describe the situation's quality."}],"priority":"★★☆"},"related_words":{"derivatives":["fribble (verb, noun)","fribbler (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Fribbleism' is a rare and sophisticated word used to describe foolish or frivolous behavior. It is not commonly used in everyday conversation and is more likely to be found in literary or academic contexts. Understanding its meaning can help in comprehending complex texts and nuanced arguments."},"example_sentences":[{"sentence":"The politician's speech was criticized for its reliance on empty rhetoric and fribbleisms.","translation":"その政治家の演説は、空虚な美辞麗句とくだらないことばかりに頼っていると批判された。","type":"noun","meaning_category":"foolish behavior"},{"sentence":"The committee dismissed his proposal as a fribbleism, lacking any practical value.","translation":"委員会は彼の提案を、何の実際的な価値もないくだらないこととして退けた。","type":"noun","meaning_category":"trivial statement"}]}