{"word":"autofermentation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己発酵：体内でエタノールが生成されるまれな病状","english_definition":"A rare medical condition in which ethanol is produced within the body due to endogenous fermentation by bacteria or fungi in the digestive system.","examples":[{"sentence":"Autofermentation syndrome can cause a person to become intoxicated without consuming alcohol.","translation":"自己発酵症候群は、人がアルコールを摂取しなくても酔っぱらった状態になる原因となる。"},{"sentence":"Diagnosis of autofermentation syndrome often involves testing for elevated blood alcohol levels and identifying the causative microorganisms in the gut.","translation":"自己発酵症候群の診断には、しばしば血中アルコール濃度の上昇の検査と、腸内の原因となる微生物の特定が含まれる。"}],"collocations":["autofermentation syndrome","gut fermentation syndrome","endogenous ethanol production"],"synonyms":["gut fermentation syndrome","endogenous ethanol production"],"antonyms":[]}],"etymology":{"value":"The term 'autofermentation' is derived from 'auto-' (self) + 'fermentation' (a metabolic process that produces chemical changes in organic substrates through the action of enzymes).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɔːtoʊˌfɜːrmenˈteɪʃən","syllables":"au-to-fer-men-ta-tion"},"inflection":{"noun_plural":"autofermentations"},"usage_notes":{"explanation":"Autofermentation is a rare and often misunderstood condition. It is important to differentiate it from other causes of intoxication. Diagnosis requires careful medical evaluation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has autofermentation because they drank too much.","correct":"✓ The patient has autofermentation, which causes them to become intoxicated even without drinking alcohol.","note":"Autofermentation is not caused by drinking alcohol; it's a condition where the body produces alcohol internally."}],"priority":"★★☆"},"related_words":{"derivatives":["fermentation","ethanol","microorganism","gut microbiome"],"related_terms":["alcohol","intoxication","yeast","bacteria"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Autofermentation' refers to a rare medical condition. This condition involves the body's own digestive system producing alcohol due to the overgrowth of certain bacteria or fungi. This can lead to intoxication without the consumption of alcoholic beverages. Understanding this term requires a good grasp of medical terminology and biological processes."},"example_sentences":[{"sentence":"The doctor suspected autofermentation when the patient's blood alcohol levels were elevated despite denying alcohol consumption.","translation":"医師は、患者がアルコール摂取を否定しているにもかかわらず血中アルコール濃度が高かったため、自己発酵を疑った。","type":"medical","meaning_category":"medical condition"},{"sentence":"Research into autofermentation aims to understand the specific microbial imbalances that lead to endogenous ethanol production.","translation":"自己発酵の研究は、内因性エタノール産生につながる特定の微生物の不均衡を理解することを目的としている。","type":"scientific","meaning_category":"research"}]}