{"word":"Exopterygotism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不完全変態","english_definition":"A type of insect development in which the insect goes through several nymphal stages and gradually develops wings and other adult features during these stages. The nymphal stages resemble smaller, wingless versions of the adult.","examples":[{"sentence":"Insects exhibiting exopterygotism include grasshoppers, termites, and true bugs.","translation":"不完全変態を示す昆虫には、バッタ、シロアリ、カメムシなどが含まれます。"}],"collocations":["exopterygote insect","incomplete metamorphosis"],"synonyms":["hemimetabolism","paurometabolism"],"antonyms":["endopterygotism"]}],"etymology":{"value":"From the Greek words 'exo' (outside), 'pteryx' (wing), and 'gotism' (condition). Refers to the development of wings externally.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛksɒpˈtɛrɪɡɒtɪzəm/","syllables":"ex-op-ter-y-go-tism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Exopterygotism describes a specific type of insect development where the young (nymphs) gradually transform into adults through a series of molts. Nymphs resemble adults but lack fully developed wings and reproductive organs. This contrasts with endopterygotism, where insects undergo complete metamorphosis with distinct larval and pupal stages.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Exopterygotism is when insects have a pupal stage.","correct":"Exopterygotism is when insects gradually develop into adults through nymphal stages without a pupal stage.","note":"Exopterygotism does not involve a pupal stage; that is characteristic of endopterygotism."}],"priority":"★★☆"},"related_words":{"derivatives":["exopterygote (noun, adjective)"],"phrasal_verbs":null,"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency. Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Exopterygotism' is a technical term used in entomology (the study of insects) to describe a specific type of insect development. It refers to insects that undergo incomplete metamorphosis, where the young nymphs gradually develop into adults without a distinct pupal stage. This term is primarily used in scientific contexts and is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The study focused on the developmental stages of insects exhibiting exopterygotism.","translation":"その研究は、不完全変態を示す昆虫の発達段階に焦点を当てました。","type":"scientific","meaning_category":"general"},{"sentence":"Exopterygotism is a characteristic feature of hemipteran insects.","translation":"不完全変態は、半翅目昆虫の特徴的な特徴です。","type":"scientific","meaning_category":"characteristic"}]}