{"word":"Angioma","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"血管腫","english_definition":"A benign tumor consisting of blood vessels or lymphatic vessels.","examples":[{"sentence":"The doctor diagnosed a small angioma on her skin.","translation":"医者は彼女の皮膚に小さな血管腫があると診断した。"},{"sentence":"Angiomas are usually harmless and do not require treatment.","translation":"血管腫は通常無害で、治療を必要としません。"}],"collocations":["skin angioma","liver angioma","cherry angioma","spider angioma"],"synonyms":["hemangioma","lymphangioma"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'angeion' (vessel) and '-oma' (tumor).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌændʒiˈoʊmə/","syllables":"An-gi-o-ma"},"inflection":{"noun_plural":"angiomas"},"usage_notes":{"explanation":"An angioma is a benign tumor composed of blood vessels (hemangioma) or lymphatic vessels (lymphangioma). They can occur anywhere in the body but are most commonly found on the skin. Many angiomas are congenital, meaning they are present at birth. They are usually harmless and may disappear on their own, but some may require medical treatment if they cause complications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She has an angioma in her brain, it's very dangerous.","correct":"✓ She has an angioma in her brain; it requires monitoring, but many are benign.","note":"While brain angiomas can be serious, many are benign and manageable with monitoring or treatment. Avoid exaggerating the danger without proper medical context."}],"priority":"★★☆"},"related_words":{"derivatives":["angiogenesis","angioplasty","angiography"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Angioma' is a medical term referring to a benign tumor of blood or lymph vessels. It's more commonly used in medical contexts or discussions about specific health conditions. Understanding this term is helpful for comprehending medical reports or discussions related to vascular abnormalities.","priority":"★★☆"},"example_sentences":[{"sentence":"The dermatologist identified the red spot as a cherry angioma.","translation":"皮膚科医はその赤い点を、老人性血管腫と診断した。","type":"medical","meaning_category":"vascular tumor"},{"sentence":"A liver angioma was detected during the routine ultrasound.","translation":"定期的な超音波検査で、肝血管腫が発見された。","type":"medical","meaning_category":"vascular tumor"}]}