{"word":"Cyclohexene","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"シクロヘキセン：6個の炭素原子が環状に結合し、そのうちの2個の炭素原子間に二重結合を持つ環状オレフィン","english_definition":"A cyclic olefin with six carbon atoms bonded in a ring, with a double bond between two of the carbon atoms.","examples":[{"sentence":"Cyclohexene is a colorless liquid with a characteristic odor.","translation":"シクロヘキセンは特徴的な臭いを持つ無色の液体です。"},{"sentence":"Cyclohexene can be hydrogenated to form cyclohexane.","translation":"シクロヘキセンは水素化されてシクロヘキサンを生成することができます。"}],"collocations":["hydrogenation of cyclohexene","reaction of cyclohexene","synthesis of cyclohexene"],"synonyms":["1,2,3,4-Tetrahydrobenzene","Tetrahydrobenzene"],"antonyms":[]}],"etymology":{"value":"'Cyclo-' (環状) + 'hex-' (6つの炭素原子) + '-ene' (二重結合を持つ)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsaɪkloʊˈhɛksiːn/","syllables":"cy-clo-hex-ene"},"inflection":{"noun_plural":"cyclohexenes"},"usage_notes":{"explanation":"Cyclohexene is a cyclic alkene, meaning it contains a carbon-carbon double bond within a six-membered ring. It is more reactive than cyclohexane due to the presence of the double bond. It is used as an intermediate in the production of various chemicals, including adipic acid and caprolactam, which are used in the manufacture of nylon.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Cyclohexene is a aromatic compound.","correct":"✓ Cyclohexene is an alicyclic compound.","note":"Cyclohexene is not aromatic because it does not follow Huckel's rule (4n+2 pi electrons in a cyclic, planar, conjugated system). It is an alicyclic compound, meaning it is a non-aromatic cyclic compound."}],"priority":"★★☆"},"related_words":{"derivatives":["cyclohexane","benzene","alkene","olefin"],"related_compounds":["adipic acid","caprolactam","nylon"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in chemistry and chemical engineering contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cyclohexene' is a chemical term referring to a specific cyclic hydrocarbon. It's primarily encountered in chemistry and related scientific fields. Understanding requires knowledge of organic chemistry nomenclature and structural concepts. The word itself breaks down into recognizable parts: 'cyclo-' indicates a ring structure, 'hex-' indicates six carbon atoms, and '-ene' indicates the presence of a carbon-carbon double bond.","priority":"★★☆"},"example_sentences":[{"sentence":"The catalytic hydrogenation of cyclohexene yields cyclohexane.","translation":"シクロヘキセンの接触水素化はシクロヘキサンを生成します。","type":"scientific","meaning_category":"chemical reaction"},{"sentence":"Cyclohexene is a common starting material in organic synthesis.","translation":"シクロヘキセンは有機合成における一般的な出発物質です。","type":"scientific","meaning_category":"chemical synthesis"},{"sentence":"The spectrum of cyclohexene shows characteristic peaks due to the double bond.","translation":"シクロヘキセンのスペクトルは、二重結合に起因する特徴的なピークを示します。","type":"scientific","meaning_category":"spectroscopy"}]}