{"word":"endurableness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"耐久性、我慢強さ、持続性","english_definition":"the quality of being able to last or withstand wear, pressure, or damage; the ability to tolerate hardship or pain; the capacity to last for a long time.","examples":[{"sentence":"The endurableness of the material makes it ideal for outdoor use.","translation":"その素材の耐久性により、屋外での使用に最適です。"},{"sentence":"Her endurableness during the marathon was truly impressive.","translation":"マラソン中の彼女の我慢強さは本当に印象的でした。"},{"sentence":"The endurableness of their friendship has been tested over many years.","translation":"彼らの友情の持続性は長年にわたって試されてきました。"}],"collocations":["material endurableness (素材の耐久性)","physical endurableness (肉体的な我慢強さ)","emotional endurableness (精神的な我慢強さ)","long-term endurableness (長期的な持続性)"],"synonyms":["durability","resilience","stamina","fortitude","persistence","tenacity"],"antonyms":["fragility","weakness","impermanence"]}],"etymology":{"value":"Derived from the word 'endurable,' which comes from 'endure.' 'Endure' originates from the Latin 'indurare,' meaning 'to harden.' The suffix '-ness' is added to 'endurable' to form the noun 'endurableness.'","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈdʊərəbəlnəs/","syllables":"en-dur-a-ble-ness"},"inflection":{"noun_plural":"endurablenesses (rarely used)"},"usage_notes":{"explanation":"'Endurableness' refers to the quality or state of being endurable. It encompasses both the physical property of withstanding wear and tear and the mental or emotional capacity to withstand hardship or pain. While 'durability' is often used for physical objects, 'endurableness' can apply to both physical and abstract concepts. It is a less common word than 'durability' or 'endurance,' but it specifically emphasizes the inherent quality of being able to endure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The endurableness of the car is very good endurance.","correct":"✓ The endurableness of the car is very good. / ✓ The car has very good endurance.","note":"Avoid using 'endurableness' and 'endurance' in the same sentence to describe the same quality. Choose one or the other for clarity."},{"incorrect":"✗ He showed great endurableness to finish the race.","correct":"✓ He showed great endurance to finish the race.","note":"'Endurance' is more commonly used to describe a person's ability to withstand hardship. 'Endurableness' is more about the inherent quality of being able to endure."}],"priority":"★★☆"},"related_words":{"derivatives":["endurable (adjective: 耐えられる、我慢できる)","endure (verb: 耐える、我慢する、持続する)","endurance (noun: 忍耐力、耐久力)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Rare, technical or philosophical contexts)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Endurableness' is a somewhat uncommon word that describes the quality of being able to withstand hardship, damage, or wear. It is often used in technical or formal contexts to emphasize the inherent ability of something to last or endure over time. While 'durability' is a more common synonym, 'endurableness' specifically highlights the capacity to endure challenges or difficult conditions. It can be used to describe both physical objects and abstract qualities like resilience or fortitude."},"example_sentences":[{"sentence":"The manufacturer focused on improving the endurableness of the product to increase its lifespan.","translation":"製造業者は製品の寿命を延ばすために、製品の耐久性を向上させることに注力しました。","type":"noun","meaning_category":"durability"},{"sentence":"The endurableness of the human spirit is often tested in times of crisis.","translation":"人間の精神の我慢強さは、危機の時に試されることがよくあります。","type":"noun","meaning_category":"resilience"},{"sentence":"The scientist studied the endurableness of the new material under extreme conditions.","translation":"科学者は極限状態における新素材の耐久性を研究しました。","type":"noun","meaning_category":"resistance"}]}