{"word":"unhydrogenated","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"not hydrogenated; not having undergone hydrogenation.","english_definition":"Not having been subjected to hydrogenation, a chemical process in which hydrogen is added to a substance.","examples":[{"sentence":"This product contains unhydrogenated vegetable oil.","translation":"この製品には、水素添加されていない植物油が含まれています。"},{"sentence":"Choose unhydrogenated fats over hydrogenated ones for better health.","translation":"より健康のために、水素添加された脂肪よりも水素添加されていない脂肪を選びましょう。"}],"collocations":["unhydrogenated vegetable oil","unhydrogenated fat","unhydrogenated oil"],"synonyms":["non-hydrogenated"],"antonyms":["hydrogenated","partially hydrogenated"],"related_terms":["hydrogenation","saturated fat","trans fat"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to 'hydrogenated', which itself comes from 'hydrogen' and the suffix '-ate' (indicating a chemical process).","priority":"low"},"pronunciation":{"ipa":"/ˌʌnhaɪˈdrɒdʒəneɪtɪd/","syllables":"un-hy-dro-ge-nat-ed"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Unhydrogenated' is primarily used in the context of food products, particularly fats and oils. It indicates that the substance has not been processed with hydrogenation, a process often used to solidify liquid oils and increase their shelf life. However, hydrogenation can create trans fats, which are considered unhealthy. Therefore, 'unhydrogenated' is often seen as a desirable quality in food products.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The unhydrogenated oil is bad for you.","correct":"The hydrogenated oil is bad for you.","note":"It's important to understand that hydrogenated oils are generally considered less healthy due to the potential presence of trans fats, while unhydrogenated oils are often preferred."}],"priority":"low"},"related_words":{"derivatives":["unhydrogenatedly"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"relatively low","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'unhydrogenated' is a technical term primarily used in the context of food science and nutrition. It signifies the absence of hydrogenation, a chemical process that adds hydrogen to unsaturated fats to solidify them. Understanding this term requires familiarity with basic chemistry and nutrition concepts, making it suitable for advanced English learners or those with a specific interest in these fields. The presence of 'un-' as a prefix indicates negation, which can aid in comprehension."},"example_sentences":[{"sentence":"The label clearly states that the margarine is made with unhydrogenated sunflower oil.","translation":"ラベルには、そのマーガリンが水素添加されていないヒマワリ油で作られていることが明確に記載されています。","type":"general","meaning_category":"food labeling"},{"sentence":"Consumers are increasingly seeking products with unhydrogenated fats due to health concerns.","translation":"消費者は健康上の懸念から、水素添加されていない脂肪を含む製品をますます求めるようになっています。","type":"general","meaning_category":"health and nutrition"}]}