{"word":"white-eyes","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"メジロ (鳥)","english_definition":"Any of various small passerine birds of the genus Zosterops, having a conspicuous ring of white feathers around the eyes.","examples":[{"sentence":"The silvereye, also known as the white-eye, is a common garden bird in Australia.","translation":"メジロとしても知られるsilvereyeは、オーストラリアでよく見られる庭の鳥です。"},{"sentence":"White-eyes are known for their sweet song and their habit of feeding on nectar.","translation":"メジロは、甘い鳴き声と蜜を食べる習性で知られています。"}],"collocations":["silvereye (別名)","Japanese white-eye (特に日本のメジロ)","Zosterops (属名)"],"synonyms":["silvereye","wax-eye (ニュージーランド)"],"antonyms":[]},{"part_of_speech":"noun","definition":"(俗語) 白人","english_definition":"(slang, derogatory) A white person.","examples":[{"sentence":"(Caution: Offensive) Some people use the term 'white-eyes' as a derogatory term for white people.","translation":"（注意：侮辱的）一部の人々は「white-eyes」という言葉を白人に対する侮辱的な用語として使用します。"}],"collocations":[],"synonyms":["cracker (offensive)","honky (offensive)","whitey (offensive)"],"antonyms":[]}],"etymology":{"value":"The name 'white-eye' refers to the prominent ring of white feathers around the eyes of birds in the Zosterops genus.","priority":"★★★"},"pronunciation":{"ipa":"/ˈwaɪtˌaɪz/","syllables":"white-eyes"},"inflection":{"noun_plural":"white-eyes"},"usage_notes":{"explanation":"The term 'white-eyes' primarily refers to birds of the genus *Zosterops*, known for their distinctive white rings around their eyes. However, it is crucial to be aware that in some contexts, particularly in slang, it can be used as a derogatory term for white people. Therefore, context is essential when interpreting the meaning of this word. When referring to the bird, the term is generally acceptable. When referring to people, it is highly offensive.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"I saw a white-eye at the zoo, it was a very beautiful bird.","correct":"I saw a white-eye at the zoo; it was a very beautiful bird.","note":"Corrected sentence uses a semicolon to separate two independent clauses."},{"incorrect":"There are many white-eyes in my garden, I like to feed them.","correct":"There are many white-eyes in my garden; I like to feed them.","note":"Corrected sentence uses a semicolon to separate two independent clauses."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["Zosterops japonicus (Japanese white-eye)","Zosterops lateralis (Silvereye)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"white-eyes\" primarily refers to a type of bird with distinctive white rings around its eyes. However, it's important to be aware that this term can also be used as a derogatory slang term for white people, which is highly offensive. Therefore, context is crucial when encountering this word. If you're discussing birds, it's a normal term, but if you're discussing people, be very careful as it could be offensive."},"example_sentences":[{"sentence":"The **white-eyes** flitted among the branches, searching for nectar.","translation":"メジロが枝の間を飛び回り、蜜を探していた。","type":"noun","meaning_category":"bird"},{"sentence":"(Caution: Offensive) Some people consider the term **white-eyes** to be a racial slur.","translation":"（注意：侮辱的）一部の人々は「white-eyes」という言葉を人種差別的な中傷と見なしている。","type":"noun","meaning_category":"derogatory slang"}]}