{"word":"fissiparism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"分裂性、分派主義","english_definition":"The tendency of an organization, political party, etc., to break up into smaller factions.","examples":[{"sentence":"The party was plagued by fissiparism, with different factions constantly vying for power.","translation":"その党は分裂性に悩まされ、異なる派閥が常に権力を争っていた。"},{"sentence":"Fissiparism within the movement weakened its overall impact.","translation":"運動内の分裂性は、その全体的な影響力を弱めた。"}],"collocations":["political fissiparism","ideological fissiparism","factional fissiparism"],"synonyms":["factionalism","splintering","fragmentation","division"],"antonyms":["unity","cohesion","integration"]}],"etymology":{"value":"From 'fissiparous', meaning reproducing by fission, plus '-ism', indicating a doctrine, principle, or practice. 'Fissiparous' is derived from Latin 'fissus' (split) and 'parere' (to produce).","priority":"★★☆"},"pronunciation":{"ipa":"/fɪˈsɪpərɪzəm/","syllables":"fis-sip-a-ri-zem"},"inflection":{"noun_plural":"fissiparisms"},"usage_notes":{"explanation":"'Fissiparism' describes the tendency of groups to break into smaller, often conflicting, factions. It is often used in political science, sociology, and organizational studies to describe internal divisions and power struggles. The term highlights the process of splitting or fragmenting, often due to ideological differences or personal ambitions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fissiparism was a good thing for the party.","correct":"✓ The fissiparism was detrimental to the party.","note":"Fissiparism is almost always considered a negative trait, leading to weakness and disunity."},{"incorrect":"✗ Fissiparism is when people agree on everything.","correct":"✓ Fissiparism is when people disagree and split into factions.","note":"Fissiparism is characterized by disagreement and division, not agreement."}],"priority":"★☆☆"},"related_words":{"derivatives":["fissiparous (adjective: reproducing by fission; tending to break into parts)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fissiparism' is a term used to describe the tendency of groups, especially political or social organizations, to break apart into smaller, often conflicting, subgroups or factions. It suggests a state of internal division and fragmentation, often driven by ideological differences or power struggles. Understanding this term is useful for analyzing the dynamics of groups and organizations that are prone to internal conflict and splitting.","priority":"★★☆"},"example_sentences":[{"sentence":"The constant infighting and fissiparism within the rebel group made it difficult for them to achieve their goals.","translation":"反乱グループ内の絶え間ない内紛と分裂性は、彼らが目標を達成することを困難にした。","type":"general","meaning_category":"division"},{"sentence":"Historians attribute the decline of the empire to the growing fissiparism among its ruling elite.","translation":"歴史家たちは、帝国の衰退を支配層の間で高まる分裂性のせいだと考えている。","type":"historical","meaning_category":"fragmentation"},{"sentence":"The company's culture of competition fostered a sense of fissiparism, with different departments working against each other rather than collaborating.","translation":"会社の競争文化は、分裂性を助長し、異なる部門が協力するのではなく、互いに対立し合った。","type":"organizational","meaning_category":"internal conflict"}]}