{"word":"anti-music","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"音楽の原則や慣習に反する音楽、または音楽とみなされない音の組み合わせ","english_definition":"Music that rejects the principles and conventions of traditional music, or a combination of sounds not considered to be music.","examples":[{"sentence":"Some avant-garde composers create anti-music by using unconventional instruments and techniques.","translation":"一部の前衛的な作曲家は、型破りな楽器や技法を用いて反音楽を創造する。"},{"sentence":"The performance was described as anti-music due to its lack of melody and rhythm.","translation":"その演奏は、旋律とリズムの欠如から反音楽と評された。"}],"collocations":["avant-garde anti-music (前衛的な反音楽)","experimental anti-music (実験的な反音楽)"],"synonyms":["noise music","sound art","dissonance"],"antonyms":["traditional music","classical music","popular music"]}],"etymology":{"value":"「anti-」（反対の）と「music」（音楽）の組み合わせ。既存の音楽に対する反発や否定を意味する。","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈmjuːzɪk/","syllables":"an-ti-mu-sic"},"inflection":{"noun_plural":"anti-musics"},"usage_notes":{"explanation":"「**anti-music**」は、既存の音楽の概念や構造を意図的に否定または逸脱する音楽を指す言葉です。旋律、ハーモニー、リズムといった伝統的な音楽の要素を欠いているか、あるいは極端に歪めていることが特徴です。ノイズミュージックやサウンドアートといったジャンルと関連付けられることが多いです。この用語は、必ずしも否定的な意味合いを持つわけではなく、実験的で前衛的な芸術表現として捉えられることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I enjoy listening to anti-music every day.","correct":"✓ I enjoy listening to noise music/experimental music every day.","note":"「anti-music」は特定のジャンルを指すよりも、既存の音楽に対する反発という概念を指すため、日常的に好んで聴く音楽を表現する場合には、より具体的なジャンル名（ノイズミュージック、実験音楽など）を使う方が適切です。"},{"incorrect":"✗ Anti-music is the same as bad music.","correct":"✓ Anti-music is an intentional rejection of traditional musical elements.","note":"「anti-music」は、単に「下手な音楽」や「悪い音楽」という意味ではありません。伝統的な音楽の要素を意図的に拒否または破壊しようとする試みを指します。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["noise music","sound art","avant-garde music","experimental music","dissonance"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**anti-music**」は、伝統的な音楽のルールや期待に反する音楽を指す専門的な用語です。これは、メロディーやハーモニー、リズムといった要素を意図的に排除したり、極端に歪めたりすることで実現されます。ノイズミュージックや実験音楽といったジャンルがこれに該当します。この用語は、単に「悪い音楽」という意味ではなく、既存の音楽に対する批判的な姿勢や、新しい表現の探求を意味することがあります。音楽理論や芸術史の文脈で使われることが多い言葉です。"},"example_sentences":[{"sentence":"The concert featured a piece of anti-music that challenged the audience's perception of sound.","translation":"そのコンサートでは、聴衆の音の認識に挑戦する反音楽の作品が演奏された。","type":"noun","meaning_category":"音楽"},{"sentence":"Some critics argue that anti-music is not truly music, but rather a form of sound art.","translation":"一部の評論家は、反音楽は真の音楽ではなく、サウンドアートの一形態であると主張する。","type":"noun","meaning_category":"音楽"}]}