{"word":"arrangable","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"配置可能な、整理可能な、手配可能な","english_definition":"Capable of being arranged; able to be put in order or organized; able to be planned or prepared.","examples":[{"sentence":"The furniture is easily arrangable to suit different needs.","translation":"家具はさまざまなニーズに合わせて簡単に配置可能です。"},{"sentence":"The meeting is arrangable for next week, depending on everyone's availability.","translation":"会議は、皆の都合がつけば来週に手配可能です。"},{"sentence":"These flowers are arrangable into a beautiful bouquet.","translation":"これらの花は美しい花束にアレンジ可能です。"}],"collocations":["easily arrangable (簡単に配置可能)","readily arrangable (容易に手配可能)","furniture arrangable (配置可能な家具)","meeting arrangable (手配可能な会議)"],"synonyms":["organizable","manageable","adjustable","adaptable","plannable","preparable"],"antonyms":["unarrangeable","unorganizable","unmanageable","inflexible"]}],"etymology":{"value":"The word 'arrangable' is formed by adding the suffix '-able' to the verb 'arrange'. 'Arrange' comes from the Old French word 'arranger', meaning 'to put in order'.","priority":"★★★"},"pronunciation":{"ipa":"/əˈreɪndʒəbəl/","syllables":"ar-range-a-ble"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs (e.g., 'easily arrangable') but does not have different forms for tense or number."},"usage_notes":{"explanation":"'Arrangable' is used to describe something that can be put into a specific order or can be organized in a particular way. It also implies that something can be planned or prepared. The word is not as common as 'arrange', 'arrangement', or 'arranged', but it is useful in specific contexts where the capability of being arranged is emphasized.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The arrangable of the books was difficult.","correct":"✓ The arrangement of the books was difficult.","note":"'Arrangable' is an adjective, not a noun. Use 'arrangement' as the noun."},{"incorrect":"✗ The event was arrangable by him.","correct":"✓ The event could be arranged by him. / ✓ He could arrange the event.","note":"'Arrangable' describes the *thing* that can be arranged, not the *person* doing the arranging. Use a modal verb like 'could' or rephrase the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["arrange (verb)","arrangement (noun)","arranged (adjective)"],"phrasal_verbs":[],"related_adjectives":["adjustable","manageable","adaptable","organizable"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Arrangable' is a less common adjective that describes something that can be arranged or organized. It's useful when you want to emphasize the capability of being arranged, such as furniture that can be easily rearranged or a meeting that can be scheduled. Remember that it's an adjective, so it modifies a noun. It's not as frequently used as 'arrange' or 'arrangement', so make sure the context calls for this specific emphasis."},"example_sentences":[{"sentence":"The modular shelving units are highly arrangable, allowing for customized storage solutions.","translation":"モジュール式の棚ユニットは非常に配置可能で、カスタマイズされたストレージソリューションが可能です。","type":"adjective","meaning_category":"配置可能な"},{"sentence":"With a flexible schedule, the appointments are easily arrangable to fit your needs.","translation":"柔軟なスケジュールにより、お客様のニーズに合わせて簡単に予約を手配できます。","type":"adjective","meaning_category":"手配可能な"},{"sentence":"The pieces of the puzzle are arrangable to form a complete picture.","translation":"パズルのピースは、配置することで完全な絵を形作ることができます。","type":"adjective","meaning_category":"整理可能な"}]}