{"word":"isopathic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"同種療法の、病気の原因物質から作られた薬を用いる","english_definition":"relating to or involving isopathy, a system of therapy that treats disease with remedies prepared from the causative agent of the disease or from substances produced by the disease.","examples":[{"sentence":"Isopathic remedies are prepared from the actual disease-causing agent.","translation":"同種療法薬は、実際に病気を引き起こす原因物質から調合されます。"},{"sentence":"The isopathic approach contrasts with conventional medicine.","translation":"同種療法のアプローチは、従来の医学とは対照的です。"}],"collocations":["isopathic remedy","isopathic treatment","isopathic medicine"],"synonyms":["auto-isopathic"],"antonyms":["allopathic","homeopathic"]}],"etymology":{"value":"Derived from the Greek words 'isos' (equal, similar) and 'pathos' (suffering, disease).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaɪsoʊˈpæθɪk/","syllables":"i-so-path-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"Isopathy is a system of alternative medicine that differs from homeopathy. While both use highly diluted substances, isopathy uses substances that cause or are related to the disease, whereas homeopathy uses substances that cause similar symptoms in a healthy person. Isopathy is not widely recognized or accepted by the medical community.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The doctor prescribed an isopathic antibiotic.","correct":"The doctor prescribed an antibiotic.","note":"Antibiotics are typically associated with allopathic medicine, not isopathic medicine."}],"priority":"★☆☆"},"related_words":{"derivatives":["isopathy (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Isopathic' is a specialized term primarily used within the context of alternative medicine, specifically referring to isopathy. Understanding requires familiarity with concepts of alternative medicine and the differences between isopathy, homeopathy, and allopathy. Due to its limited usage and specialized context, it's not commonly encountered in general English texts."},"example_sentences":[{"sentence":"Some practitioners use isopathic treatments for allergies.","translation":"アレルギーに対して同種療法的な治療を行う開業医もいます。","type":"adjective","meaning_category":"同種療法の"},{"sentence":"The isopathic principle involves treating like with like, using the disease agent itself.","translation":"同種療法の原理は、病気の原因物質そのものを使って、同類をもって同類を治療することを含みます。","type":"adjective","meaning_category":"同種療法の"}]}