{"word":"self-induction","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己誘導","english_definition":"The induction of an electromotive force (EMF) in a circuit by the change in current in the same circuit.","examples":[{"sentence":"Self-induction plays a crucial role in the operation of inductors.","translation":"自己誘導はインダクタの動作において重要な役割を果たします。"},{"sentence":"The magnitude of self-induction is quantified by the inductance of the circuit.","translation":"自己誘導の大きさは、回路のインダクタンスによって定量化されます。"},{"sentence":"Self-induction can cause voltage spikes in circuits when the current is rapidly switched.","translation":"自己誘導は、電流が急速に切り替えられるときに、回路に電圧スパイクを引き起こす可能性があります。"}],"collocations":["high self-induction","low self-induction","coefficient of self-induction","mutual induction (相互誘導)"],"synonyms":["inductance","magnetic induction"],"antonyms":["capacitance","resistance"],"related_terms":["inductor","electromotive force (EMF)","magnetic field","Faraday's law of induction"]}],"etymology":{"value":"The term 'self-induction' is derived from the fact that the induction of an electromotive force occurs within the same circuit due to its own changing current.","priority":"★★★"},"pronunciation":{"ipa":"/ˌself ɪnˈdʌkʃən/","syllables":"self-in-duc-tion"},"inflection":{"noun_plural":"self-inductions"},"usage_notes":{"explanation":"Self-induction is a fundamental concept in electromagnetism and is essential for understanding the behavior of circuits containing inductors. It is the phenomenon where a changing current in a circuit induces an electromotive force (EMF) in the same circuit. This EMF opposes the change in current, as described by Lenz's law. The inductance (L) of a circuit quantifies the amount of self-induction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The circuit has a lot of self-inductance.","correct":"✓ The circuit has high self-induction.","note":"While 'self-inductance' is sometimes used informally, 'self-induction' is the more precise term for the phenomenon itself. 'Inductance' refers to the property of the circuit. 'High' or 'low' are more appropriate adjectives to describe the degree of self-induction."},{"incorrect":"✗ Self-induction only happens in different circuits.","correct":"✓ Self-induction happens within the same circuit.","note":"Self-induction specifically refers to the induction within the *same* circuit, as opposed to mutual induction, which occurs between two separate circuits."}],"priority":"★★☆"},"related_words":{"derivatives":["self-induced (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - primarily used in technical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-induction' refers to the process where a changing electric current in a circuit creates a voltage (electromotive force) within that same circuit. This effect is crucial in understanding how inductors work in electronic devices. The amount of self-induction is measured by the circuit's inductance. This term is mainly used in physics and electrical engineering contexts."},"example_sentences":[{"sentence":"The **self-induction** in the coil opposes the increasing current.","translation":"コイル内の自己誘導は、増加する電流に反対します。","type":"noun","meaning_category":"physics"},{"sentence":"Calculating the **self-induction** of a complex circuit can be challenging.","translation":"複雑な回路の自己誘導を計算するのは難しい場合があります。","type":"noun","meaning_category":"electrical engineering"},{"sentence":"The **self-induction** effect becomes more pronounced at higher frequencies.","translation":"自己誘導効果は、高周波数になるほど顕著になります。","type":"noun","meaning_category":"physics"}]}