{"word":"Inklusion","priority":"★★★","meanings":[{"part_of_speech":"noun","gender":"feminine","definition":"包括、インクルージョン：あらゆる人々が社会に平等に参加できること。特に、障害を持つ人々が差別されずに、教育、雇用、社会生活などあらゆる分野で共に生活できる状態を指す。","english_definition":"Inclusion: the practice or policy of providing equal access to opportunities and resources for people who might otherwise be excluded or marginalized, such as those having physical or mental disabilities; especially the integration of students with disabilities into the regular education classroom.","examples":[{"sentence":"Die Inklusion von Menschen mit Behinderung ist ein wichtiges Ziel unserer Gesellschaft.","translation":"障害を持つ人々のインクルージョンは、私たちの社会の重要な目標です。"},{"sentence":"Inklusion in der Schule bedeutet, dass alle Kinder, unabhängig von ihren Fähigkeiten, gemeinsam lernen.","translation":"学校におけるインクルージョンとは、すべての子どもたちが、能力に関わらず、共に学ぶことを意味します。"},{"sentence":"Das Unternehmen setzt sich für Inklusion am Arbeitsplatz ein.","translation":"その企業は職場におけるインクルージョンに尽力しています。"}],"collocations":["soziale Inklusion (社会的インクルージョン)","Inklusion in der Bildung (教育におけるインクルージョン)","Inklusion am Arbeitsplatz (職場におけるインクルージョン)","Inklusion fördern (インクルージョンを促進する)","Inklusion leben (インクルージョンを実践する)"],"synonyms":["Integration","Einbeziehung","Teilhabe","Eingliederung"],"antonyms":["Exklusion","Ausgrenzung","Diskriminierung"]}],"etymology":{"value":"ラテン語の\"inclusio\"（含むこと、包含）に由来する。英語の\"inclusion\"と同語源。","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnkluˈzi̯oːn/","syllables":"In-klu-si-on"},"inflection":{"declension":"Inklusion (nominative), Inklusion (genitive), Inklusion (dative), Inklusion (accusative)"},"usage_notes":{"explanation":"\"Inklusion\"は、単に「含める」という意味ではなく、すべての人が平等な権利を持ち、差別なく社会に参加できる状態を指します。特に、障害を持つ人々が社会から排除されることなく、共に生活できる社会を目指す概念として重要視されています。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Die Integration ist dasselbe wie Inklusion.","correct":"Inklusion geht über Integration hinaus.","note":"Integration（統合）は、特定のグループを既存の社会構造に組み込むことを指しますが、Inklusion（包括）は、社会構造自体を変革し、すべての人が最初から平等に参加できる状態を目指します。"},{"incorrect":"Inklusion bedeutet, dass alle gleich behandelt werden.","correct":"Inklusion bedeutet, dass alle bedarfsgerecht behandelt werden.","note":"Inklusionは、すべての人を同じように扱うのではなく、それぞれのニーズに合わせて支援を提供し、平等な機会を保障することを意味します。"}],"priority":"★★☆"},"related_words":{"derivatives":["inklusiv (形容詞: 包括的な)","inkludieren (動詞: 含む、包含する)"],"compound_words":["Inklusionspädagogik (インクルーシブ教育学)","Inklusionsvereinbarung (インクルージョン協定)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"比較的高頻度 (Relatively high frequency) - 特に教育、社会学、政治の分野でよく使われる。","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Inklusion\"は、すべての人々が社会に平等に参加できることを意味する言葉です。特に、障害を持つ人々が差別されずに、教育や仕事など、あらゆる分野で共に生活できる状態を目指す考え方です。単に「含める」だけでなく、社会の仕組み自体を変えて、誰もが最初から参加しやすいようにすることが重要です。"},"example_sentences":[{"sentence":"Die UN-Behindertenrechtskonvention fordert die Inklusion von Menschen mit Behinderungen in allen Lebensbereichen.","translation":"国連障害者権利条約は、障害を持つ人々の生活のあらゆる分野におけるインクルージョンを求めています。","type":"general","meaning_category":"包括、インクルージョン"},{"sentence":"Die Schule arbeitet an einem Konzept zur Inklusion von Kindern mit sonderpädagogischem Förderbedarf.","translation":"その学校は、特別な教育的支援を必要とする子どものインクルージョンに関するコンセプトを策定しています。","type":"education","meaning_category":"教育におけるインクルージョン"},{"sentence":"Inklusion bedeutet, Barrieren abzubauen und eine inklusive Gesellschaft zu schaffen.","translation":"インクルージョンとは、バリアを取り除き、インクルーシブな社会を創造することを意味します。","type":"social","meaning_category":"社会的なインクルージョン"}]}