{"word":"provisionary","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"仮の、暫定的な、一時的な","english_definition":"arranged or established for the time being; temporary.","examples":[{"sentence":"The government formed a provisionary committee to handle the crisis.","translation":"政府は危機に対処するために仮の委員会を組織した。"},{"sentence":"They reached a provisionary agreement, pending further negotiations.","translation":"彼らはさらなる交渉を待つ間、暫定的な合意に達した。"},{"sentence":"A provisionary license was issued to allow him to operate temporarily.","translation":"彼が一時的に営業できるように仮免許が発行された。"}],"collocations":["provisionary government (仮政府)","provisionary agreement (暫定合意)","provisionary measures (暫定措置)","provisionary license (仮免許)","provisionary arrangements (暫定的な取り決め)","provisionary period (試用期間、仮の期間)"],"synonyms":["temporary","interim","provisional","tentative","conditional","transitional","stopgap"],"antonyms":["permanent","definitive","final","absolute"]}],"etymology":{"value":"late 15th century, from Medieval Latin *provisionarius*, from Latin *provisio* (see provision).","priority":"★★☆"},"pronunciation":{"ipa":"/prəˈvɪʒənəri/","syllables":"pro-vi-sion-a-ry"},"inflection":{"notes":"Adjective only, no comparative or superlative forms."},"usage_notes":{"explanation":"'Provisionary' is used to describe something that is not yet finalized or permanent, but is intended to serve a purpose until a more permanent solution is found. It implies a degree of uncertainty and the possibility of change. It is often used in formal or official contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The provisionary plan is very detailed and unlikely to change.","correct":"✓ The provisional plan is subject to change based on feedback.","note":"A provisionary plan is, by definition, subject to change. Describing it as 'unlikely to change' is contradictory."},{"incorrect":"✗ He made a provisionary decision, so it is final.","correct":"✓ He made a provisional decision, but it is not yet final.","note":"A provisionary decision is not final; it is subject to review and possible alteration."}],"priority":"★★☆"},"related_words":{"derivatives":["provision (名詞: 供給、備え、条項)","provisional (形容詞: 仮の、暫定的な - より一般的)","provisionally (副詞: 仮に、暫定的に)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Provisionary' is a relatively formal word that means 'temporary' or 'arranged for the present time'. It suggests that something is in place as a short-term solution until a more permanent arrangement can be made. This word is less common than 'provisional', but they share a similar meaning. It is often used in legal, political, or administrative contexts."},"example_sentences":[{"sentence":"The new government established a provisionary council to oversee elections.","translation":"新政府は選挙を監督するために仮の評議会を設立した。","type":"adjective","meaning_category":"仮の"},{"sentence":"A provisionary budget was approved until the full financial plan could be finalized.","translation":"完全な財務計画が最終決定されるまで、暫定予算が承認された。","type":"adjective","meaning_category":"暫定的な"},{"sentence":"The provisionary ceasefire agreement helped to reduce violence in the region.","translation":"暫定的な停戦合意は、地域での暴力を減らすのに役立った。","type":"adjective","meaning_category":"一時的な"}]}