{"word":"indecencies","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"わいせつな行為、下品な言動、不作法","english_definition":"plural form of indecency: acts, words, or images that are morally offensive, especially those relating to sexual matters.","examples":[{"sentence":"The report detailed numerous indecencies committed by the soldiers.","translation":"報告書には、兵士たちによって行われた数多くのわいせつな行為が詳細に記述されていた。"},{"sentence":"The play was criticized for its indecencies and vulgar language.","translation":"その劇は、わいせつな内容と下品な言葉遣いで批判された。"},{"sentence":"He was arrested for public indecencies.","translation":"彼は公然わいせつ罪で逮捕された。"}],"collocations":["public indecencies (公然わいせつ行為)","sexual indecencies (性的わいせつ行為)","moral indecencies (道徳的にわいせつな行為)"],"synonyms":["obscenities","improprieties","vulgarities","lewdness","smut"],"antonyms":["decencies","proprieties","morality","respectability"]}],"etymology":{"value":"'Indecency' is derived from the prefix 'in-' (not) combined with 'decency' (behavior that conforms to accepted standards of morality or respectability). The plural form 'indecencies' refers to multiple instances of such behavior.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈdiːsənsiz/","syllables":"in-de-cen-cies"},"inflection":{"noun_plural":"indecencies"},"usage_notes":{"explanation":"'Indecencies' is a plural noun referring to multiple instances of indecent behavior, actions, or expressions. It is often used in formal or legal contexts to describe actions that violate moral or societal standards, particularly those related to sexual matters or public behavior. The term implies a violation of what is considered proper, respectful, or morally acceptable.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He committed an indecencies.","correct":"✓ He committed an indecency. / ✓ He committed indecencies.","note":"'Indecencies' is the plural form and should be used when referring to multiple instances. Use 'indecency' for a single instance."},{"incorrect":"✗ The indecencies was shocking.","correct":"✓ The indecencies were shocking.","note":"'Indecencies' is a plural noun, so it requires a plural verb form."}],"priority":"★★☆"},"related_words":{"derivatives":["indecency (noun: a single instance of indecent behavior)","indecent (adjective: violating standards of decency)","decent (adjective: conforming to accepted standards of morality or respectability)"],"phrases":["gross indecency (a legal term for certain sexual offenses)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'indecencies' is a formal term referring to multiple instances of behavior, actions, or expressions that are considered morally offensive, particularly those related to sexual matters or public behavior. It is often used in legal or formal contexts. Understanding this word requires a good grasp of abstract concepts related to morality and societal standards."},"example_sentences":[{"sentence":"The museum removed several paintings due to concerns about public indecencies.","translation":"美術館は、公然わいせつに関する懸念から、いくつかの絵画を撤去した。","type":"noun","meaning_category":"わいせつな行為"},{"sentence":"The report detailed a series of indecencies that occurred within the prison.","translation":"報告書は、刑務所内で発生した一連のわいせつな行為を詳細に記述した。","type":"noun","meaning_category":"わいせつな行為"},{"sentence":"The politician was accused of various financial indecencies.","translation":"その政治家は、さまざまな金融上の不正行為で告発された。","type":"noun","meaning_category":"不作法"},{"sentence":"The performer's act was criticized for its numerous indecencies.","translation":"そのパフォーマーの演技は、数多くのわいせつな行為で批判された。","type":"noun","meaning_category":"わいせつな行為"}]}