{"word":"geomantical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"地相術の、風水（地理風水）の","english_definition":"Relating to geomancy; pertaining to divination by means of figures or lines on the earth, or by geographic features.","examples":[{"sentence":"The geomantical chart was used to determine the best location for the building.","translation":"その地相術の図は、建物の最適な場所を決定するために使用されました。"},{"sentence":"They consulted a geomantical expert before starting construction.","translation":"彼らは建設を始める前に、風水の専門家に相談しました。"}],"collocations":["geomantical chart","geomantical expert","geomantical principles"],"synonyms":["divinatory","oracular"],"antonyms":[],"notes":"Often associated with traditional Chinese and other cultures' practices of selecting auspicious locations."}],"etymology":{"value":"Derived from 'geomancy' + '-ical'. 'Geomancy' comes from Greek 'geo-' (earth) + 'manteia' (divination).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒiːoʊmænˈtɪkəl/","syllables":"ge-o-man-ti-cal"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"'Geomantical' is used to describe something related to the practice of geomancy, which is a form of divination that interprets markings on the ground or the arrangement of geographical features to gain insights or make predictions. It is often associated with finding auspicious locations for buildings, graves, or other structures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used geomantical to find the treasure.","correct":"✓ He used geomancy to find the treasure.","note":"'Geomancy' is the noun (the practice itself), while 'geomantical' is the adjective (describing something related to the practice)."},{"incorrect":"✗ The geomantical is important for building.","correct":"✓ Geomancy is important for building. / ✓ Geomantical principles are important for building.","note":"'Geomantical' is an adjective and needs a noun to modify. 'Geomancy' is the noun and can stand alone as the subject."}],"priority":"★☆☆"},"related_words":{"derivatives":["geomancy","geomancer"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'geomantical' is a specialized term related to the practice of geomancy, which involves divination through interpreting earth formations or geographic features. It is typically encountered in contexts discussing traditional beliefs, architecture, or cultural practices related to site selection and spatial arrangement. Due to its specific and somewhat esoteric nature, it is not a commonly used word. "},"example_sentences":[{"sentence":"The ancient temple was built according to strict geomantical rules.","translation":"その古代寺院は厳格な風水の規則に従って建てられました。","type":"general","meaning_category":"general"},{"sentence":"The architect considered the geomantical aspects of the site before designing the house.","translation":"建築家は家を設計する前に、その場所の風水的な側面を考慮しました。","type":"general","meaning_category":"general"}]}