{"word":"patroonship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) パトロンシップ：オランダ西インド会社がニューネーデルラント植民地において、特定の条件を満たす入植者に与えた大規模な土地所有権および統治権。","english_definition":"(historical) A landholding in the Dutch colony of New Netherland granted to individuals who met certain conditions, including bringing a certain number of settlers to the colony. It also conferred certain manorial rights to the patroon.","examples":[{"sentence":"The Van Rensselaer family held a vast patroonship along the Hudson River.","translation":"ヴァン・レンセラー家はハドソン川沿いに広大なパトロンシップを所有していた。"},{"sentence":"The patroonship system aimed to encourage settlement in New Netherland.","translation":"パトロンシップ制度は、ニューネーデルラントへの入植を奨励することを目的としていた。"}],"collocations":["establish a patroonship","grant a patroonship","inherit a patroonship","the patroonship system"],"synonyms":["manorial estate","land grant","feudal holding"],"antonyms":[]}],"etymology":{"value":"オランダ語の「patroonschap」から派生。これは「patroon」（パトロン、後援者）に由来し、ラテン語の「patronus」（保護者、後援者）に遡る。","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈtruːnʃɪp/","syllables":"pa-troon-ship"},"inflection":{"noun_plural":"patroonships"},"usage_notes":{"explanation":"「**patroonship**」は、17世紀のオランダ植民地ニューネーデルラント（現在のニューヨーク州周辺）に存在した独特の土地所有制度を指す歴史的な用語です。オランダ西インド会社が、植民地への入植を促進するために導入しました。パトロン（patroon）は、50人以上の入植者を自費で連れてくることを条件に、広大な土地を与えられ、その土地の統治権や裁判権など、封建的な領主のような権利を認められました。この制度は、植民地社会の階層構造に影響を与えましたが、成功したパトロンシップは少数にとどまりました。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wanted to buy a patroonship in New England.","correct":"✓ He wanted to buy a patroonship in New Netherland.","note":"パトロンシップ制度はニューネーデルラント（現在のニューヨーク州周辺）に特有の制度であり、ニューイングランド（現在の米国北東部）には存在しませんでした。"},{"incorrect":"✗ The patroon was elected by the settlers.","correct":"✓ The patroon was the owner of the land and had governing rights.","note":"パトロンは入植者によって選出されるのではなく、土地の所有者であり、統治権を持っていました。"}],"priority":"★★☆"},"related_words":{"derivatives":["patroon (名詞: パトロン、後援者、パトロンシップの領主)","manor (名詞: 荘園、領地)","feudalism (名詞: 封建制度)","colonization (名詞: 植民地化)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 歴史研究や専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**patroonship**」は、17世紀のオランダ植民地ニューネーデルラントにおける特定の土地所有制度を指す歴史用語であり、現代英語の日常会話ではほとんど使用されません。この単語は、歴史学、特にアメリカ史や植民地時代の研究において現れます。理解のためには、当時の植民地政策、土地制度、社会構造に関する知識が必要です。パトロンシップ制度は、オランダ西インド会社が植民地への入植を促進するために導入したもので、パトロンと呼ばれる特定の個人に広大な土地と統治権を与えるものでした。"},"example_sentences":[{"sentence":"The only successful **patroonship** was Rensselaerswyck, owned by the Van Rensselaer family.","translation":"唯一成功したパトロンシップは、ヴァン・レンセラー家が所有していたレンセラーズウィックだった。","type":"noun","meaning_category":"土地所有権"},{"sentence":"The **patroonship** system ultimately failed to attract enough settlers to New Netherland.","translation":"パトロンシップ制度は最終的に、ニューネーデルラントに十分な入植者を引きつけることができなかった。","type":"noun","meaning_category":"土地所有権"}]}