{"word":"retinasphalt","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, humorous) The dark, sticky residue left on the road after a vehicle has run over an animal; roadkill remains.","english_definition":"(slang, humorous) The dark, sticky residue left on the road after a vehicle has run over an animal; roadkill remains.","examples":[{"sentence":"The highway was marked with streaks of retinasphalt after the morning commute.","translation":"朝の通勤後、高速道路には動物が轢かれた跡であるレティナアスファルトの筋が残っていた。"},{"sentence":"He swerved to avoid creating more retinasphalt.","translation":"彼はレティナアスファルトを増やさないように急ハンドルを切った。"}],"collocations":["streaks of retinasphalt","avoid creating retinasphalt"],"synonyms":["roadkill","splatter","gore","pavement pizza"],"antonyms":[]}],"etymology":{"value":"A blend of \"retina\" (referring to the eyes of the animal) and \"asphalt\" (the road surface).","priority":"★★★"},"pronunciation":{"ipa":"/ˌrɛtɪˈnæsfɔlt/","syllables":"re-ti-nas-phalt"},"inflection":{"noun_plural":"retinasphalts"},"usage_notes":{"explanation":"This is a slang term, often used humorously or euphemistically to describe roadkill remains. It is not a formal or scientific term.","priority":"★★★"},"common_mistakes":{},"related_words":{},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'retinasphalt' is a humorous and informal term, not typically found in formal writing or conversation. Understanding requires familiarity with slang and an understanding of the blend of \"retina\" and \"asphalt\" to create the meaning. Its use is generally limited to specific contexts where dark humor or euphemism is appropriate."},"example_sentences":[{"sentence":"The grim reality of rural highways often includes patches of retinasphalt.","translation":"地方の高速道路の陰惨な現実には、しばしばレティナアスファルトの跡が含まれる。","type":"noun","meaning_category":"roadkill remains"},{"sentence":"Drivers should be cautious to avoid contributing to the retinasphalt on the roads.","translation":"運転者は道路上のレティナアスファルトを増やさないように注意すべきだ。","type":"noun","meaning_category":"roadkill remains"}]}