{"word":"Doric","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ドーリア式の、ドーリア人の","english_definition":"relating to or characteristic of the Dorians or their dialect of Greek; relating to or denoting the simplest of the classical orders of architecture, characterized by heavy columns with plain, saucer-shaped capitals and no base.","examples":[{"sentence":"Doric columns","translation":"ドーリア式の円柱"},{"sentence":"Doric architecture","translation":"ドーリア建築"}],"collocations":["Doric order","Doric column","Doric dialect"],"synonyms":[],"antonyms":[],"notes":"Often used in the context of architecture to describe a specific style of columns and buildings."},{"part_of_speech":"noun","definition":"ドーリア方言","english_definition":"the dialect of ancient Greek spoken by the Dorians.","examples":[{"sentence":"He studied Doric to understand ancient texts.","translation":"彼は古代の文献を理解するためにドーリア方言を研究した。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin Doricus, from Greek Dōrikos, from Dōrieus (Δωριεύς), the name of a Greek tribe.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdɔːrɪk/","syllables":"Dor-ic"},"inflection":{},"usage_notes":{"explanation":"'Doric' refers to the Dorians, an ancient Greek tribe, and is most commonly used to describe a specific style of architecture characterized by simplicity and strength. It can also refer to the Doric dialect of ancient Greek.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The building was decorated in Ionic Doric style.","correct":"The building was decorated in Doric style.","note":"Doric and Ionic are distinct architectural styles, so they cannot be combined."}],"priority":"★★☆"},"related_words":{"derivatives":["Dorian"],"related_terms":["Ionic","Corinthian"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Doric' is primarily used in historical or architectural contexts. Understanding requires familiarity with ancient Greek history and classical architecture. The term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The Parthenon in Athens features Doric columns.","translation":"アテネのパルテノン神殿はドーリア式の円柱を特徴とする。","type":"adjective","meaning_category":"architecture"},{"sentence":"The inscription was written in the Doric dialect.","translation":"碑文はドーリア方言で書かれていた。","type":"noun","meaning_category":"language"}]}