{"word":"Holometaboly","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"完全変態","english_definition":"A type of insect metamorphosis in which the insect passes through a larval stage, then enters an inactive state called a pupa (or chrysalis) before its final molt into the adult form.","examples":[{"sentence":"Holometaboly is a characteristic of advanced insect groups like beetles, flies, and butterflies.","translation":"完全変態は、甲虫、ハエ、チョウなどの高度な昆虫グループの特徴です。"},{"sentence":"The process of holometaboly allows for a complete reorganization of the insect's body plan.","translation":"完全変態のプロセスは、昆虫の体の構造の完全な再編成を可能にします。"}],"collocations":["complete metamorphosis","pupal stage","larval stage","adult stage"],"synonyms":["complete metamorphosis"],"antonyms":["hemimetaboly","incomplete metamorphosis"]}],"etymology":{"value":"From the Greek words 'holo' (whole, complete), 'meta' (change), and 'bolos' (throw).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɒləməˈtæbəli/","syllables":"ho-lo-me-tab-o-ly"},"inflection":{"noun_plural":"holometabolies"},"usage_notes":{"explanation":"Holometaboly is a biological term specifically used in entomology to describe a type of insect development. It is contrasted with hemimetaboly (incomplete metamorphosis).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Holometaboly is when insects grow bigger without changing form.","correct":"✓ Holometaboly is when insects undergo complete metamorphosis.","note":"Holometaboly involves significant changes in form, not just size."}],"priority":"★★☆"},"related_words":{"derivatives":["holometabolous (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Holometaboly' is a scientific term used in biology, specifically entomology, to describe the complete metamorphosis process in insects. This term is typically found in advanced scientific texts or discussions related to insect biology. Understanding this term requires a solid foundation in biological concepts."},"example_sentences":[{"sentence":"Beetles exhibit **holometaboly**, undergoing a dramatic transformation from larva to adult.","translation":"甲虫は完全変態を示し、幼虫から成虫への劇的な変化を遂げます。","type":"general","meaning_category":"definition"},{"sentence":"The evolutionary success of many insect groups is attributed to **holometaboly**.","translation":"多くの昆虫グループの進化的成功は、完全変態に起因すると考えられています。","type":"scientific","meaning_category":"evolution"}]}