{"word":"pantagraph","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"パンタグラフ：縮尺を拡大・縮小して図形を複写する機械、鉄道車両の集電装置","english_definition":"(1) A mechanical linkage connected in a manner based on parallelograms so that the movement of one pen, when tracing an image, produces identical movements in a second pen. If a line drawing is traced by the first point, an identical, enlarged, or miniaturized copy will be drawn by a pen fixed to the other point. (2) A diamond-shaped frame used on electric locomotives and streetcars to collect current from an overhead wire.","examples":[{"sentence":"The artist used a pantagraph to create a large-scale version of the original sketch.","translation":"そのアーティストはパンタグラフを使って、元のスケッチを拡大したバージョンを作成した。"},{"sentence":"The train's pantagraph extended upward to connect with the overhead power line.","translation":"列車のパンタグラフは、架線に接続するために上方に伸びた。"}],"collocations":["drawing pantagraph","railway pantagraph","raise the pantagraph","lower the pantagraph"],"synonyms":["reducing glass","copying machine","current collector"],"antonyms":[]},{"part_of_speech":"verb","definition":"パンタグラフで複写する","english_definition":"To copy (a drawing, etc.) with a pantagraph.","examples":[{"sentence":"The architect pantagraphed the blueprint to create a smaller version for the client.","translation":"建築家は、クライアントのために青写真をパンタグラフで複写して、より小さいバージョンを作成した。"}],"collocations":[],"synonyms":["copy","reproduce","duplicate"],"antonyms":[]}],"etymology":{"value":"From French 'pantographe', from Greek 'panto-' (all) + 'graphō' (I write).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpæntəˌɡræf/","syllables":"pan-ta-graph"},"inflection":{"noun_plural":"pantagraphs","verb_forms":{"present_simple":["pantagraph","pantagraphs"],"past_simple":"pantagraphed","past_participle":"pantagraphed","present_participle":"pantagraphing"}},"usage_notes":{"explanation":"The term 'pantagraph' can refer to either the drawing instrument or the current collector on electric trains. Context is crucial to understanding which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The train's pantagraph was broken, so it couldn't conduct electricity.","correct":"✓ The train's pantograph was broken, so it couldn't conduct electricity.","note":"The correct spelling is 'pantograph', not 'pantagraph'."}],"priority":"★★☆"},"related_words":{"derivatives":["pantographic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pantagraph' is relatively uncommon. It refers to either a mechanical device for copying drawings at different scales or the apparatus on top of an electric train that collects power from overhead lines. Understanding the context is essential to determine the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The engineer adjusted the pantagraph to ensure proper contact with the power line.","translation":"エンジニアは、架線との適切な接触を確保するためにパンタグラフを調整した。","type":"noun","meaning_category":"railway集電装置"},{"sentence":"Using the pantagraph, she accurately reproduced the intricate design.","translation":"彼女はパンタグラフを使って、複雑なデザインを正確に複写した。","type":"noun","meaning_category":"図形複写機械"},{"sentence":"He carefully pantagraphed the original document to create an exact replica.","translation":"彼は注意深く元の文書をパンタグラフで複写して、正確な複製を作成した。","type":"verb","meaning_category":"パンタグラフで複写する"}]}