{"word":"Acromania","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"異常な手足への執着、または手足の巨大化への妄想","english_definition":"An abnormal obsession with one's limbs, or a delusion that one's limbs are becoming enlarged.","examples":[{"sentence":"The patient's acromania led him to constantly measure his hands and feet.","translation":"その患者の肢端肥大症への妄想は、彼に絶えず手足を測定させることになった。"},{"sentence":"Acromania is a rare psychological condition often associated with body dysmorphic disorder.","translation":"肢端肥大症への妄想は、身体醜形障害と関連することが多いまれな心理状態である。"}],"collocations":["develop acromania","suffer from acromania","treat acromania"],"synonyms":["body dysmorphic disorder","somatoparaphrenia"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'acro-' (meaning 'extremity' or 'limb') and '-mania' (meaning 'madness' or 'obsession').","priority":"★★★"},"pronunciation":{"ipa":"/ˌækroʊˈmeɪniə/","syllables":"ac-ro-ma-ni-a"},"inflection":{"noun_plural":"acromanias"},"usage_notes":{"explanation":"Acromania is a relatively rare and specific term, primarily used in psychological or medical contexts. It describes a mental state characterized by either an excessive preoccupation with one's limbs or a delusional belief that one's limbs are growing abnormally large. It's often considered a symptom or manifestation of a broader psychological disorder, such as body dysmorphic disorder or a psychotic condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was diagnosed with acromania due to his large hands.","correct":"✓ He was diagnosed with acromegaly due to his large hands.","note":"Acromania is a psychological condition, while acromegaly is a physical condition causing enlarged limbs. Use the correct term based on the context."},{"incorrect":"✗ Her acromania made her very athletic.","correct":"✓ Her athletic training made her very muscular.","note":"Acromania is a mental obsession, not a physical attribute that enhances athleticism."}],"priority":"★★☆"},"related_words":{"derivatives":["acromaniac (noun: a person suffering from acromania)"],"phrasal_verbs":[],"related_medical_terms":["acromegaly (a hormonal disorder that results in the enlargement of bones in the hands, feet, and face)","body dysmorphic disorder (a mental disorder characterized by obsessive preoccupation with a perceived flaw in appearance)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare, specialized term)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Acromania' is a highly specialized term primarily used in the fields of psychology and medicine. It refers to a mental condition where an individual has an abnormal obsession with their limbs or a delusional belief that their limbs are becoming enlarged. Understanding this term requires a strong grasp of psychological terminology and concepts. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The psychiatrist explored the possibility of acromania as part of the patient's overall assessment.","translation":"精神科医は、患者の全体的な評価の一環として、肢端肥大症への妄想の可能性を探った。","type":"noun","meaning_category":"psychological condition"},{"sentence":"His persistent complaints about the size of his hands led doctors to suspect acromania.","translation":"彼の手の大きさについての執拗な訴えから、医師たちは肢端肥大症への妄想を疑った。","type":"noun","meaning_category":"psychological condition"}]}