{"word":"underhousemaid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"下働きのお手伝いさん、下級メイド","english_definition":"A female servant in a large house who is of a lower rank than a housemaid, typically performing more menial tasks.","examples":[{"sentence":"The underhousemaid was responsible for cleaning the less visible areas of the house.","translation":"下働きのお手伝いさんは、家のあまり目立たない場所の掃除を担当していた。"},{"sentence":"In the hierarchy of the household staff, the underhousemaid was near the bottom.","translation":"家政婦の階層において、下働きのお手伝いさんは最下層に近い存在だった。"}],"collocations":["household staff","domestic service","below stairs"],"synonyms":["scullery maid","maidservant","domestic helper"],"antonyms":["housekeeper","lady's maid"]}],"etymology":{"value":"The term is formed by combining \"under-\" (indicating a subordinate position) with \"housemaid\" (a female domestic servant).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈhaʊsmeɪd/","syllables":"un-der-house-maid"},"inflection":{"noun_plural":"underhousemaids"},"usage_notes":{"explanation":"The term \"underhousemaid\" refers to a specific role within the domestic staff of a large household, typically in the past. The underhousemaid performed tasks that were considered less desirable or more physically demanding than those of a regular housemaid. This position was common in large estates and wealthy households.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an underhousemaid.","correct":"✓ She is an underhousemaid.","note":"The term specifically refers to a female servant. Use 'manservant' or a more general term like 'domestic worker' for a male."}],"priority":"★★☆"},"related_words":{"derivatives":["housemaid","maidservant","domestic servant","scullery maid"],"related_occupations":["butler","cook","housekeeper","lady's maid","footman"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - This term is not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"underhousemaid\" is a historical term referring to a specific type of domestic servant. Understanding the word requires knowledge of historical social structures and the roles within large households. The word is not commonly used in modern English, so familiarity with it suggests a higher level of vocabulary and cultural understanding."},"example_sentences":[{"sentence":"The underhousemaid scrubbed the floors and cleaned the grates.","translation":"下働きのお手伝いさんは床を磨き、火格子を掃除した。","type":"example","meaning_category":"Typical tasks"},{"sentence":"The new underhousemaid was quickly overwhelmed by the amount of work.","translation":"新しい下働きのお手伝いさんはすぐに仕事の量に圧倒された。","type":"example","meaning_category":"Job experience"}]}