{"word":"piercer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(人)ピアッサー、ピアスを開ける人","english_definition":"A person who performs body piercings, especially professionally.","examples":[{"sentence":"She went to a professional piercer to get her nose pierced.","translation":"彼女は鼻にピアスを開けてもらうためにプロのピアッサーのところへ行った。"},{"sentence":"The piercer used sterile equipment to minimize the risk of infection.","translation":"ピアッサーは感染のリスクを最小限に抑えるために滅菌された器具を使用した。"}],"collocations":["professional piercer (プロのピアッサー)","body piercer (ボディピアッサー)"],"synonyms":["body modification artist","piercing technician"],"antonyms":[]},{"part_of_speech":"noun","definition":"(物)穴あけ器、穿孔器、突き刺す道具","english_definition":"A tool or device used for piercing or making holes.","examples":[{"sentence":"The leather piercer made clean holes in the belt.","translation":"その革用穴あけ器はベルトにきれいな穴を開けた。"},{"sentence":"He used an ice piercer to break up the ice in his drink.","translation":"彼は飲み物の中の氷を砕くためにアイスピッカーを使った。"}],"collocations":["ice piercer (アイスピッカー)","leather piercer (革用穴あけ器)"],"synonyms":["awl","punch","drill","spike"],"antonyms":[]}],"etymology":{"value":"The word \"piercer\" is derived from the verb \"pierce,\" which comes from Old French \"percier,\" meaning \"to bore through, penetrate.\" The suffix \"-er\" is added to indicate a person or thing that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪərsər/","syllables":"pier-cer"},"inflection":{"noun_plural":"piercers"},"usage_notes":{"explanation":"The term \"piercer\" can refer to either a person who performs piercings or a tool used for piercing. When referring to a person, it usually implies someone who does piercings professionally, especially body piercings. When referring to a tool, it describes something designed for making holes or penetrating materials. Context is key to understanding which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a very good piercing.","correct":"✓ She is a very good piercer.","note":"\"Piercing\" is the act of making a hole, while \"piercer\" is the person who does it."},{"incorrect":"✗ He used a needle as a piercer.","correct":"✓ He used a needle to pierce the fabric.","note":"While a needle can be used for piercing, it's not typically referred to as a \"piercer.\" A more specific tool name might be appropriate, or the verb \"pierce\" can be used."}],"priority":"★★☆"},"related_words":{"derivatives":["pierce (verb: to make a hole in something)","piercing (noun: the act of making a hole; a piece of jewelry worn in a hole in the body; adjective: sharp, penetrating)"],"phrasal_verbs":[],"related_nouns":["awl","drill","punch","spike"],"related_adjectives":["sharp","penetrating"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"piercer\" has two main meanings: a person who performs body piercings (like ear or nose piercings) and a tool used for making holes. When talking about someone who gives piercings as a job, you'd call them a \"piercer.\" If you're talking about a tool used to make a hole in something, like leather or ice, that's also a \"piercer.\" It's important to understand the context to know which meaning is being used."},"example_sentences":[{"sentence":"The experienced piercer carefully marked the spot before inserting the needle.","translation":"熟練したピアッサーは針を刺す前に注意深く場所をマークした。","type":"noun (person)","meaning_category":"ピアッサー"},{"sentence":"A leather piercer is essential for crafting high-quality belts.","translation":"革用穴あけ器は高品質のベルトを作るのに不可欠だ。","type":"noun (tool)","meaning_category":"穴あけ器"},{"sentence":"Before getting a piercing, make sure the piercer is licensed and uses sterile equipment.","translation":"ピアスを開ける前に、ピアッサーが免許を持っていて、滅菌された器具を使用していることを確認してください。","type":"noun (person)","meaning_category":"ピアッサー"},{"sentence":"The ice piercer made it easy to break up the large block of ice.","translation":"アイスピッカーのおかげで、大きな氷の塊を簡単に砕くことができた。","type":"noun (tool)","meaning_category":"穴あけ器"}]}