{"word":"dicots","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"双子葉植物","english_definition":"A flowering plant with two cotyledons (seed leaves) in its seed.","examples":[{"sentence":"Roses, sunflowers, and beans are dicots.","translation":"バラ、ヒマワリ、豆は双子葉植物です。"},{"sentence":"Dicots typically have net-like veins in their leaves.","translation":"双子葉植物は通常、葉に網状の葉脈があります。"}],"collocations":["dicot plant","dicot seedling","dicot leaf","dicot root"],"synonyms":["dicotyledon","magnoliopsida"],"antonyms":["monocot"],"scientific_classification":{"kingdom":"Plantae","clade":"Eudicots"},"related_terms":["cotyledon","monocot","eudicot","angiosperm","plant taxonomy"]}],"etymology":{"value":"Derived from 'di-' (meaning 'two') and 'cotyledon' (seed leaf), referring to the two seed leaves present in the embryo.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdaɪkɒts/","syllables":"di-cots"},"inflection":{"noun_plural":"dicots"},"usage_notes":{"explanation":"'Dicots' is a shortened, informal term for 'dicotyledons'. The term refers to a major group of flowering plants characterized by having two cotyledons (seed leaves) within their seeds. While the term 'dicot' is still widely used, modern plant classification often uses the term 'eudicot' to refer to the majority of plants traditionally classified as dicots, as some plants previously classified as dicots are now known to be more closely related to monocots.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Dicots is a type of plant.","correct":"✓ Dicots are a type of plant.","note":"'Dicots' is a plural noun, so it requires a plural verb."},{"incorrect":"✗ Dicot have two cotyledons.","correct":"✓ Dicots have two cotyledons.","note":"'Dicot' is singular, but in this context, we're talking about dicots in general, so the plural form 'dicots' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["dicotyledon (noun)","eudicot (noun)"],"related_terms":["monocot (noun)","cotyledon (noun)","angiosperm (noun)","plant (noun)"]},"level_frequency":{"level":"High school biology","frequency_google_ngram":"Relatively infrequent in general text, common in botany and biology contexts.","priority":"★★☆"},"readability_explanation":{"level":"High school biology","text":"'Dicots' refers to a group of flowering plants that have two seed leaves (cotyledons) inside their seeds. This is a term commonly used in biology classes when learning about plant classification. Dicots often have leaves with net-like veins and flower parts in multiples of four or five. Examples include roses, sunflowers, and oak trees. The term 'eudicot' is a more precise term used in modern botany to refer to most, but not all, plants previously classified as dicots."},"example_sentences":[{"sentence":"The vast majority of flowering plants are either dicots or monocots.","translation":"顕花植物の大部分は双子葉植物か単子葉植物のどちらかです。","type":"general"},{"sentence":"A key characteristic of dicots is the presence of two cotyledons in the seed.","translation":"双子葉植物の重要な特徴は、種子の中に2つの子葉が存在することです。","type":"characteristic"},{"sentence":"Many common garden plants, such as tomatoes and petunias, are dicots.","translation":"トマトやペチュニアなど、多くの一般的な園芸植物は双子葉植物です。","type":"example"},{"sentence":"The vascular bundles in dicot stems are typically arranged in a ring.","translation":"双子葉植物の茎における維管束は、通常、リング状に配置されています。","type":"anatomy"},{"sentence":"Compared to monocots, dicots often have more complex leaf structures.","translation":"単子葉植物と比較して、双子葉植物はより複雑な葉の構造を持っていることが多いです。","type":"comparison"}]}