{"word":"Sat-chit-ananda","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"サット・チット・アーナンダ：存在（Sat）、意識（Chit）、至福（Ananda）からなる、ヒンドゥー哲学における究極の実在、ブラフマン（宇宙の根本原理）の状態を示す複合語。真我の体験を表す。","english_definition":"Sat-chit-ananda: A composite Sanskrit word describing the nature of Brahman (the ultimate reality) in Hindu philosophy, consisting of Sat (truth, being), Chit (consciousness), and Ananda (bliss). It represents the experience of the true self.","examples":[{"sentence":"The sage meditated deeply, seeking to realize Sat-chit-ananda.","translation":"賢者はサット・チット・アーナンダを悟ろうと深く瞑想した。"},{"sentence":"Sat-chit-ananda is the ultimate goal of spiritual practice.","translation":"サット・チット・アーナンダは精神修養の究極の目標である。"}],"collocations":["realize Sat-chit-ananda (サット・チット・アーナンダを悟る)","experience Sat-chit-ananda (サット・チット・アーナンダを体験する)","Sat-chit-ananda Brahman (サット・チット・アーナンダ・ブラフマン)"],"synonyms":["Brahman","Atman","Self-realization","Enlightenment"],"antonyms":["Maya (illusion)","Avidya (ignorance)"]}],"etymology":{"value":"サンスクリット語の複合語で、Sat（सत्）は「真実、存在」、Chit（चित्）は「意識、知性」、Ananda（आनन्द）は「至福、喜び」を意味する。これら3つの言葉が組み合わさることで、ブラフマン（宇宙の根本原理）の本質的な性質を表している。","priority":"★★★"},"pronunciation":{"ipa":"/ˌsʌt ˌtʃɪt ɑːˈnʌndə/","syllables":"Sat-chit-a-nan-da"},"inflection":{"notes":"名詞なので、複数形はありません。"},"usage_notes":{"explanation":"「**Sat-chit-ananda**」は、ヒンドゥー哲学、特にヴェーダーンタ学派において重要な概念です。これは、ブラフマン（宇宙の根本原理）の本質的な性質を表現する複合語であり、真我（アートマン）の体験を指します。Sat（存在）は永遠の真実、Chit（意識）は純粋な意識、Ananda（至福）は無限の喜びを表し、これらが一体となった状態がサット・チット・アーナンダです。この状態を理解し、体験することが、精神的な探求の最終目標とされます。瞑想やヨーガなどの実践を通じて、個々の意識が普遍的な意識と一体化し、サット・チット・アーナンダの状態を体験することが目指されます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Sat-chit-ananda is a god in Hinduism.","correct":"✓ Sat-chit-ananda is a description of Brahman in Hinduism.","note":"サット・チット・アーナンダはヒンドゥー教における神の名前ではなく、ブラフマン（宇宙の根本原理）の状態を説明する言葉です。"},{"incorrect":"✗ Sat-chit-ananda can be achieved through material wealth.","correct":"✓ Sat-chit-ananda can be achieved through spiritual practices.","note":"サット・チット・アーナンダは物質的な豊かさではなく、精神的な実践を通じて達成されるとされます。"}],"priority":"★★☆"},"related_words":{"derivatives":["Sat (存在)","Chit (意識)","Ananda (至福)","Brahman (宇宙の根本原理)","Atman (真我)","Yoga (ヨーガ)","Meditation (瞑想)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 哲学、宗教関連の文献でのみ見られる。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Sat-chit-ananda**」は、ヒンドゥー哲学における高度な概念であり、サンスクリット語に由来する専門用語です。この言葉は、ブラフマン（宇宙の根本原理）の本質的な性質、すなわち「真実、意識、至福」が一体となった状態を表します。この概念を理解するには、ヴェーダーンタ哲学の基礎知識や、アートマン（真我）とブラフマンの関係性についての理解が不可欠です。瞑想やヨーガなどの精神的な実践を通じて、個々の意識が普遍的な意識と一体化し、サット・チット・アーナンダの状態を体験することが目指されます。この用語は、哲学や宗教の研究者、または深い精神的な探求に関心のある人々にとって重要です。"},"example_sentences":[{"sentence":"The guru spoke of Sat-chit-ananda as the ultimate reality.","translation":"グル（導師）はサット・チット・アーナンダを究極の実在として語った。","type":"noun","meaning_category":"究極の実在"},{"sentence":"Through meditation, one can experience the bliss of Sat-chit-ananda.","translation":"瞑想を通じて、人はサット・チット・アーナンダの至福を体験することができる。","type":"noun","meaning_category":"至福の状態"},{"sentence":"Sat-chit-ananda is the goal of self-realization in Advaita Vedanta.","translation":"サット・チット・アーナンダはアドヴァイタ・ヴェーダーンタにおける自己実現の目標である。","type":"noun","meaning_category":"自己実現の目標"}]}