{"word":"unextradited","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(人が)引き渡されなかった、送還されなかった","english_definition":"Not extradited; not handed over to another jurisdiction for trial or punishment.","examples":[{"sentence":"He remained unextradited, living freely in a country without an extradition treaty.","translation":"彼は犯罪人引渡し条約のない国で自由に暮らし、引き渡されることはなかった。"},{"sentence":"The suspect was unextradited due to lack of sufficient evidence.","translation":"容疑者は十分な証拠がないため、引き渡されなかった。"}],"collocations":["remain unextradited","be unextradited due to","unextradited fugitive"],"synonyms":["not surrendered","not delivered up"],"antonyms":["extradited","surrendered"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the word 'extradited'. 'Extradited' comes from 'extradite', which originates from the Latin 'ex-' (out of) and 'tradere' (to hand over).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪkˈstrædəted/","syllables":"un-ex-tra-di-ted"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"'Unextradited' is used to describe a person who is not subject to extradition, meaning they are not handed over by one country or jurisdiction to another for legal proceedings (such as a trial) or punishment. This often occurs because there is no extradition treaty between the countries involved, or because legal or political factors prevent the extradition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unextradited of the criminal was a relief to him.","correct":"✓ The fact that the criminal was unextradited was a relief to him.","note":"'Unextradited' is an adjective, not a noun. You can't say 'the unextradited'. Instead, use a phrase like 'the fact that he was unextradited'."},{"incorrect":"✗ He was unextradited to the country he committed the crime.","correct":"✓ He was unextradited to the country where he committed the crime.","note":"While the meaning might be understood, the more natural phrasing is 'the country where he committed the crime'."}],"priority":"★☆☆"},"related_words":{"derivatives":["extradite (verb: to hand over a person to another jurisdiction)","extradition (noun: the act of extraditing)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unextradited' is a relatively uncommon word that describes someone who has not been handed over to another country or legal jurisdiction for trial or punishment. It's usually used in legal or political contexts. You'll most likely encounter it in news reports or legal documents dealing with international law or criminal justice. Understanding the base word 'extradite' is helpful for grasping the meaning of 'unextradited'."},"example_sentences":[{"sentence":"The fugitive remained unextradited, living in a country that offered him political asylum.","translation":"その逃亡者は政治亡命を認める国に住み、引き渡されることはなかった。","type":"adjective","meaning_category":"not handed over"},{"sentence":"Despite the international arrest warrant, the suspect remained unextradited due to legal loopholes.","translation":"国際逮捕状が出ているにもかかわらず、容疑者は法の抜け穴により引き渡されなかった。","type":"adjective","meaning_category":"not handed over"}]}