{"word":"brazing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ろう付け (接合する金属よりも融点の低い合金を溶かして接合する方法)","english_definition":"A metal-joining process whereby a filler metal is heated above melting point and distributed between two or more close-fitting parts by capillary action.","examples":[{"sentence":"Brazing is often used to join dissimilar metals.","translation":"ろう付けは異種金属を接合する際によく用いられる。"},{"sentence":"The strength of a brazed joint depends on the filler metal used.","translation":"ろう付け継手の強度は、使用されるろう材に依存する。"}],"collocations":["brazing alloy (ろう材)","brazing process (ろう付けプロセス)","brazing technique (ろう付け技術)","torch brazing (トーチろう付け)","furnace brazing (炉中ろう付け)"],"synonyms":["soldering (はんだ付け)","welding (溶接)"],"antonyms":[]},{"part_of_speech":"verb","definition":"ろう付けする","english_definition":"To join (metal parts) by brazing.","examples":[{"sentence":"The copper pipes were brazed together.","translation":"銅管はろう付けによって接合された。"},{"sentence":"He is brazing a fitting onto the pipe.","translation":"彼はパイプに継手をろう付けしている。"}],"collocations":["braze together (一緒にろう付けする)","braze onto (～にろう付けする)"],"synonyms":["solder (はんだ付けする)","weld (溶接する)"],"antonyms":[]}],"etymology":{"value":"The word \"braze\" is derived from the Middle English word \"brasen,\" meaning \"to cover or ornament with brass.\" This, in turn, comes from the Old English word \"bræs,\" which referred to brass or bronze. Although brazing doesn't necessarily involve brass, the term likely originated because brass was a common filler metal in early brazing processes.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbreɪzɪŋ/","syllables":"braz-ing"},"inflection":{"noun_plural":"brazings","verb_forms":{"present_simple":["braze","brazes"],"past_simple":"brazed","past_participle":"brazed","present_participle":"brazing"}},"usage_notes":{"explanation":"Brazing is a joining process similar to soldering, but it uses higher temperatures (above 450°C or 842°F) and produces stronger joints. The filler metal (brazing alloy) melts and flows into the joint by capillary action, creating a metallurgical bond between the parts being joined. Brazing is commonly used to join dissimilar metals or thin materials that would be difficult to weld. It's important to distinguish brazing from welding, where the base metals themselves are melted.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I brazed the metal with solder.","correct":"✓ I soldered the metal. / ✓ I brazed the metal with a brazing alloy.","note":"Solder is used in soldering, while a brazing alloy is used in brazing. Using solder for brazing is incorrect."},{"incorrect":"✗ Brazing is the same as welding.","correct":"✓ Brazing is similar to welding, but it doesn't melt the base metals.","note":"Brazing does not melt the base metals, unlike welding."}],"priority":"★★☆"},"related_words":{"derivatives":["braze (verb, noun)","brazed (adjective)","brazeable (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"brazing\" refers to a specific metal-joining process. It's a technical term primarily used in engineering, manufacturing, and related fields. Understanding the term requires familiarity with metalworking processes and materials science. The key distinction between brazing and similar processes like soldering and welding is the temperature used and whether the base metals are melted.","priority":"★★☆"},"example_sentences":[{"sentence":"The technician is skilled in brazing aluminum components.","translation":"その技術者はアルミニウム部品のろう付けに熟練している。","type":"verb","meaning_category":"ろう付けする"},{"sentence":"Brazing provides a strong and leak-proof joint for refrigeration systems.","translation":"ろう付けは、冷凍システムに強固で漏れのない接合を提供する。","type":"noun","meaning_category":"ろう付け"},{"sentence":"The bicycle frame was carefully brazed together by hand.","translation":"自転車のフレームは手作業で丁寧にろう付けされた。","type":"verb","meaning_category":"ろう付けする"},{"sentence":"Proper surface preparation is crucial for successful brazing.","translation":"適切な表面処理は、ろう付けを成功させるために不可欠である。","type":"noun","meaning_category":"ろう付け"}]}