{"word":"non-modal","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"様相性を持たない、様相を表さない","english_definition":"Not relating to or expressing modality (possibility, necessity, obligation, etc.).","examples":[{"sentence":"Non-modal logic deals with statements that are either true or false, without considering degrees of possibility.","translation":"非様相論理は、可能性の程度を考慮せずに、真または偽のいずれかであるステートメントを扱います。"},{"sentence":"This verb is non-modal; it doesn't express any sense of obligation or permission.","translation":"この動詞は非様相動詞であり、義務や許可の意味を表しません。"}],"collocations":["non-modal verb (非様相動詞)","non-modal logic (非様相論理)","non-modal sentence (非様相文)"],"synonyms":["non-modalized","non-modifying"],"antonyms":["modal"],"notes":["Often used in linguistics and logic to describe elements that do not express modality."]}],"etymology":{"value":"Prefix 'non-' (meaning 'not') + 'modal' (relating to modality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈmoʊdl/","syllables":"non-mo-dal"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'non-modal' is primarily used in linguistics, philosophy, and logic to distinguish elements that do not express modality from those that do. Modality refers to linguistic devices that indicate possibility, necessity, obligation, permission, ability, etc. For example, modal verbs like 'can', 'must', 'should' express modality, whereas regular verbs like 'eat', 'sleep', 'walk' are typically non-modal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The modal verb is non-modal.","correct":"✓ The main verb is non-modal.","note":"Modal verbs, by definition, express modality and are therefore not non-modal. The term applies to verbs that do not express modality."}],"priority":"★★☆"},"related_words":{"derivatives":["modality (名詞: 様相性)","modal (形容詞: 様相的な)","non (接頭辞: ～でない)"],"related_terms":["modal verb (助動詞)","epistemic modality (認識的様相)","deontic modality (義務的様相)","alethic modality (真理的様相)"]},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic contexts related to linguistics, logic, and philosophy.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-modal' is a technical term used in linguistics and logic to describe something that does not express modality. Modality refers to the expression of possibility, necessity, permission, obligation, ability, etc. If something is 'non-modal,' it simply means it doesn't have those features. For example, a 'non-modal verb' is a verb that doesn't indicate possibility or obligation, unlike 'can' or 'must'. This term is mostly used in academic discussions about language and logic."},"example_sentences":[{"sentence":"The sentence 'The cat is on the mat' is a simple non-modal statement.","translation":"「猫はマットの上にいる」という文は、単純な非様相文です。","type":"adjective","meaning_category":"Describing a statement"},{"sentence":"Identifying non-modal verbs is crucial for understanding the core meaning of a sentence.","translation":"非様相動詞を特定することは、文の核心的な意味を理解するために重要です。","type":"adjective","meaning_category":"Describing a verb"}]}