{"word":"bisection","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"二等分、二分","english_definition":"the division of something into two equal parts.","examples":[{"sentence":"The bisection of the angle was done with a compass and straightedge.","translation":"その角の二等分は、コンパスと定規で行われた。"},{"sentence":"Bisection is a common technique in numerical analysis.","translation":"二分法は数値解析における一般的な手法である。"}],"collocations":["angle bisection (角の二等分)","line bisection (線分の二等分)","bisection method (二分法)"],"synonyms":["halving","division in half","bisecting"],"antonyms":["trisection (三等分)","quadrisection (四等分)"]},{"part_of_speech":"noun","definition":"(数学)二分法","english_definition":"a root-finding method that repeatedly bisects an interval and then selects a subinterval in which a root must lie for further processing.","examples":[{"sentence":"The bisection method guarantees convergence to a root.","translation":"二分法は根への収束を保証する。"},{"sentence":"Bisection is a simple but relatively slow method for finding roots.","translation":"二分法は単純だが、根を求めるには比較的遅い方法である。"}],"collocations":["bisection algorithm (二分法アルゴリズム)","bisection search (二分探索)","interval bisection (区間二分)"],"synonyms":["binary search","dichotomy method"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin words 'bi-' (two) and 'sectio' (cutting), meaning 'cutting into two'.","priority":"★★☆"},"pronunciation":{"ipa":"/baɪˈsekʃən/","syllables":"bi-sec-tion"},"inflection":{"noun_plural":"bisections"},"usage_notes":{"explanation":"'Bisection' refers to the act of dividing something into two equal parts. In mathematics, particularly in numerical analysis, it specifically refers to the bisection method, an algorithm used to find the roots of a function. The term is most commonly used in mathematical and technical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He performed a trisection on the line.","correct":"✓ He performed a bisection on the line.","note":"'Trisection' means dividing into three parts, while 'bisection' means dividing into two equal parts."},{"incorrect":"✗ The bisection was not equal.","correct":"✓ The bisection was not equal. / ✓ The two parts after bisection were not equal.","note":"Bisection inherently implies equal parts. If the parts are unequal, it's simply a division, not a bisection."}],"priority":"★★☆"},"related_words":{"derivatives":["bisect (verb: to divide into two equal parts)","bisector (noun: a line that divides something into two equal parts)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in technical and mathematical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bisection' is a technical term that refers to dividing something into two equal parts. It's commonly used in mathematics, especially in numerical analysis, where it describes a method for finding the roots of a function. Because it's a specialized term, it's more likely to be encountered in advanced academic or technical contexts rather than in everyday conversation. Understanding the term is essential for anyone studying mathematics, computer science, or related fields."},"example_sentences":[{"sentence":"The **bisection** of the line segment created two congruent segments.","translation":"その線分の二等分は、二つの合同な線分を作り出した。","type":"noun","meaning_category":"二等分"},{"sentence":"The **bisection** method is a reliable way to approximate the root of an equation.","translation":"二分法は、方程式の根を近似するための信頼できる方法である。","type":"noun","meaning_category":"二分法"},{"sentence":"We used angle **bisection** to construct a 45-degree angle.","translation":"角度の二等分を用いて、45度の角を作図した。","type":"noun","meaning_category":"二等分"}]}