{"word":"stanzaically","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"詩のスタンザ（連）の形式で、またはスタンザに関して","english_definition":"In or relating to the form of stanzas in poetry; in a stanzaic manner.","examples":[{"sentence":"The poem is structured stanzaically, with each verse presenting a distinct image.","translation":"その詩はスタンザ形式で構成されており、各節が明確なイメージを提示している。"},{"sentence":"He analyzed the poem stanzaically, examining the rhyme scheme and meter of each stanza.","translation":"彼は詩をスタンザごとに分析し、各スタンザの韻律構成と韻脚を調べた。"}],"collocations":["structured stanzaically","analyzed stanzaically","organized stanzaically"],"synonyms":["verse-by-verse","sectionally","segmentally"],"antonyms":["prosaically","continuously"]}],"etymology":{"value":"\"stanzaic\" (スタンザの、スタンザに関する) + \"-ally\" (～的に)","priority":"★★☆"},"pronunciation":{"ipa":"/stænˈzeɪɪkəli/","syllables":"stan-zai-i-cal-ly"},"inflection":{"notes":"This word is an adverb and does not inflect."},"usage_notes":{"explanation":"The adverb \"stanzaically\" is used to describe something that is done or structured in relation to stanzas, which are groups of lines forming a division of a poem. It is often used in literary analysis or when describing the structure of a poem.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The novel was written stanzaically.","correct":"✓ The novel was written in chapters.","note":"\"Stanzaically\" refers specifically to poetry and should not be used to describe prose. Novels are typically divided into chapters, not stanzas."}],"priority":"★☆☆"},"related_words":{"derivatives":["stanza (名詞: スタンザ、連)","stanzaic (形容詞: スタンザの、スタンザに関する)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"stanzaically\" is a specialized term related to poetry analysis and is not commonly used in everyday language. It is primarily encountered in academic or literary contexts when discussing the structure and form of poems. Understanding this word requires familiarity with the concept of stanzas in poetry."},"example_sentences":[{"sentence":"The ballad is arranged stanzaically, with each stanza telling a part of the story.","translation":"そのバラードはスタンザ形式で構成されており、各スタンザが物語の一部を語っている。","type":"general","meaning_category":"structure"},{"sentence":"She examined the poem stanzaically, noting the shifts in tone and imagery from one stanza to the next.","translation":"彼女は詩をスタンザごとに調べ、あるスタンザから次のスタンザへのトーンとイメージの変化に注目した。","type":"analysis","meaning_category":"analysis"}]}