{"word":"self-inoculation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己接種、自家接種","english_definition":"The act of inoculating oneself, especially with a disease-causing agent.","examples":[{"sentence":"The doctor warned against self-inoculation due to the risk of complications.","translation":"医師は合併症のリスクがあるため、自己接種をしないように警告した。"},{"sentence":"Historically, self-inoculation was sometimes practiced to develop immunity to certain diseases.","translation":"歴史的には、特定の病気に対する免疫を獲得するために自己接種が実践されることがあった。"}],"collocations":["perform self-inoculation","risk of self-inoculation","method of self-inoculation"],"synonyms":["auto-inoculation"],"antonyms":[]}],"etymology":{"value":"'Self-' (自分自身) + 'inoculation' (接種) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌselfɪˌnɒkjʊˈleɪʃən/","syllables":"self-in-oc-u-la-tion"},"inflection":{"noun_plural":"self-inoculations"},"usage_notes":{"explanation":"Self-inoculation is the act of deliberately introducing a pathogen (disease-causing agent) into one's own body, typically to induce a mild form of the disease and develop immunity. This practice carries significant risks and is generally discouraged by medical professionals. It is distinct from vaccination, which uses weakened or inactive pathogens to stimulate the immune system safely.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He tried self-inoculation with a vaccine.","correct":"✓ He tried self-inoculation with a disease-causing agent.","note":"Self-inoculation typically involves using a disease-causing agent, not a vaccine. Vaccines are a safer and more controlled method of immunization."}],"priority":"★★☆"},"related_words":{"derivatives":["inoculation","vaccination","immunization"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-inoculation' refers to the act of intentionally infecting oneself with a disease-causing agent. This is usually done in an attempt to gain immunity, but it is a risky practice and not recommended by medical professionals. It's important to distinguish this from vaccination, which is a safe and controlled way to build immunity. The term is relatively uncommon and mainly used in medical or historical contexts."},"example_sentences":[{"sentence":"During the smallpox epidemic, some people attempted self-inoculation to gain immunity.","translation":"天然痘の流行中、免疫を獲得するために自己接種を試みる人がいた。","type":"noun","meaning_category":"自己接種"},{"sentence":"The dangers of self-inoculation far outweigh any potential benefits.","translation":"自己接種の危険性は、潜在的な利益をはるかに上回る。","type":"noun","meaning_category":"自己接種"}]}