{"word":"bacteriolysin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"細菌溶解素","english_definition":"A substance capable of causing the lysis (disintegration or dissolution) of bacteria.","examples":[{"sentence":"Bacteriolysin is an antibody that can destroy bacteria.","translation":"細菌溶解素は細菌を破壊できる抗体です。"},{"sentence":"The presence of bacteriolysin indicates an immune response to a bacterial infection.","translation":"細菌溶解素の存在は、細菌感染に対する免疫反応を示しています。"}],"collocations":["serum bacteriolysin","complement-dependent bacteriolysin","release of bacteriolysin"],"synonyms":["bacteriolytic antibody","bacterial lysin"],"antonyms":[]}],"etymology":{"value":"From 'bacteria' + 'lysin' (from Greek 'lysis' meaning 'a loosening').","priority":"★★★"},"pronunciation":{"ipa":"/bækˌtɪəriˈɒlɪsɪn/","syllables":"bac-te-ri-o-ly-sin"},"inflection":{"noun_plural":"bacteriolysins"},"usage_notes":{"explanation":"Bacteriolysin is typically used in the context of immunology and microbiology, referring to substances, often antibodies, that can cause bacterial cells to break down. It is a technical term and not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bacteriolysin was used to grow bacteria.","correct":"✓ The bacteriolysin was used to kill bacteria.","note":"Bacteriolysin kills or lyses bacteria, it does not promote growth."}],"priority":"★☆☆"},"related_words":{"derivatives":["bacteriolysis (noun: the dissolution or destruction of bacteria)","lysin (noun: a substance capable of causing lysis)","bacteriolytic (adjective: relating to bacteriolysis)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - a specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bacteriolysin' is a highly specialized term used in microbiology and immunology. It refers to a substance, usually an antibody, that causes the lysis (breakdown) of bacteria. This term is unlikely to be encountered outside of scientific literature or advanced studies in these fields. Understanding requires knowledge of basic immunology and microbiology concepts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The experiment tested the effectiveness of the serum bacteriolysin against different strains of E. coli.","translation":"その実験では、さまざまな大腸菌株に対する血清細菌溶解素の有効性をテストしました。","type":"scientific","meaning_category":"Definition"},{"sentence":"Complement activation leads to the formation of bacteriolysin, which destroys the bacterial cell membrane.","translation":"補体活性化は細菌溶解素の形成につながり、細菌の細胞膜を破壊します。","type":"scientific","meaning_category":"Function"}]}