{"word":"polynoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(生物学) 多毛類の、多数の剛毛を持つ","english_definition":"(zoology) Belonging or pertaining to the Polynoidae, a family of marine worms characterized by numerous bristles or setae.","examples":[{"sentence":"The polynoid worm crawled along the ocean floor.","translation":"その多毛類の虫は海底を這って進んだ。"}],"collocations":[],"synonyms":["chaetiferous","setigerous"],"antonyms":[]}],"etymology":{"value":"From the family name Polynoidae, itself derived from Greek roots: 'poly' (many) + 'noos' (mind, thought) + '-id' (suffix indicating belonging to a group). The 'noos' part is somewhat obscure in its connection to the worms' characteristics.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɒlɪnɔɪd/","syllables":"pol-y-noid"},"inflection":{"notes":"Adjective, no standard inflections beyond comparative/superlative (more polynoid, most polynoid), which are rarely used."},"usage_notes":{"explanation":"'Polynoid' is a technical term used primarily in zoology, specifically when discussing or describing marine worms belonging to the family Polynoidae (scale worms). It refers to the presence of numerous chaetae (bristles) on the worm's body.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The polynoid is a type of insect.","correct":"✓ The polynoid is a type of worm.","note":"Polynoids are marine worms, not insects."}],"priority":"★★☆"},"related_words":{"derivatives":["Polynoidae (family name)"],"phrasal_verbs":[],"related_terms":["scale worm","marine worm","chaetae","setae"]},"level_frequency":{"CEFR":"N/A (specialized term)","frequency_google_ngram":"Very low frequency - a specialized zoological term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Polynoid' is a highly specialized term used in the field of zoology to describe certain marine worms. Understanding and using this term requires advanced knowledge of biology and taxonomy. It is unlikely to be encountered outside of scientific contexts. The term refers to the characteristic of having numerous bristles or setae, which is a defining feature of worms in the Polynoidae family."},"example_sentences":[{"sentence":"The biologist identified the specimen as a polynoid worm due to its distinctive scales and numerous chaetae.","translation":"生物学者は、その標本を、特徴的な鱗と多数の剛毛を持つ多毛類であると同定した。","type":"adjective","meaning_category":"Descriptive (zoology)"}]}