{"word":"harmins","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(薬学)ハルミン類：主に熱帯植物に含まれる、モノアミン酸化酵素阻害作用を持つアルカロイドの一種","english_definition":"A class of alkaloids, primarily found in tropical plants, that act as monoamine oxidase inhibitors.","examples":[{"sentence":"Harmins are being studied for their potential therapeutic applications.","translation":"ハルミン類は、その潜在的な治療応用について研究されている。"}],"collocations":["monoamine oxidase inhibitor","alkaloid","tropical plant"],"synonyms":["N/A"],"antonyms":["N/A"]}],"etymology":{"value":"Derived from the plant *Peganum harmala*, from which these alkaloids were first isolated.","priority":"N/A"},"pronunciation":{"ipa":"ˈhɑːrmɪnz","syllables":"har-mins"},"inflection":{"noun_plural":"harmins"},"usage_notes":{"explanation":"Harmins are a group of naturally occurring beta-carboline alkaloids known for their psychoactive properties. They are found in various plants, most notably *Peganum harmala* (Syrian rue) and *Banisteriopsis caapi*, which is used in the preparation of ayahuasca. These compounds act as reversible inhibitors of monoamine oxidase A (MAO-A), which can lead to increased levels of neurotransmitters like serotonin, dopamine, and norepinephrine in the brain.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["harmine","harmaline","tetrahydroharmine"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Harmins' refers to a specific group of alkaloids found in certain plants. These alkaloids are notable for their MAO-inhibiting properties, which affect neurotransmitter levels in the brain. The term is primarily used in pharmacology and related scientific fields. Understanding requires a background in chemistry or pharmacology.","priority":"N/A"},"example_sentences":[{"sentence":"The study investigated the effects of harmins on serotonin levels in the brain.","translation":"その研究では、ハルミン類が脳内のセロトニンレベルに与える影響を調査した。","type":"noun","meaning_category":"pharmacology"}]}