{"word":"mulligan","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ゴルフで)打ち直し、無罰打の再試行","english_definition":"(in golf) an extra stroke allowed after a poor shot, not counted on the scorecard; a second chance to perform an action, especially after the first attempt went wrong.","examples":[{"sentence":"He took a mulligan on the first tee because he sliced his drive into the woods.","translation":"彼は最初のティーで、ドライブを森に打ち込んでしまったので、打ち直しをした。"},{"sentence":"I wish I could get a mulligan on that presentation; it was a disaster.","translation":"あのプレゼンをやり直せたらいいのに。ひどい出来だった。"}],"collocations":["take a mulligan","use a mulligan","get a mulligan","grant a mulligan"],"synonyms":["redo","retake","second chance","do-over"],"antonyms":[]},{"part_of_speech":"noun","definition":"(料理)各種の材料を使ったシチューやスープ","english_definition":"a stew or soup made from a variety of ingredients, often leftovers.","examples":[{"sentence":"The hoboes shared a mulligan they had cooked over a campfire.","translation":"浮浪者たちはキャンプファイヤーで調理した寄せ集めのシチューを分け合った。"}],"collocations":["hobo mulligan"],"synonyms":["stew","soup","hotchpotch"],"antonyms":[]}],"etymology":{"value":"起源ははっきりしないが、ゴルフの打ち直しの意味では、19世紀後半から20世紀初頭にかけてのアメリカで生まれたとされる。有力な説としては、カナダ人のアマチュアゴルファー、David Mulliganに由来するというものがある。彼が不注意なショットを打った際に、同伴者に頼んで打ち直しをさせてもらったことがきっかけで広まったとされる。シチューの意味は、放浪者や野宿者が寄せ集めの材料で作ったことからきている。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmʌlɪɡən/","syllables":"mul-li-gan"},"inflection":{"noun_plural":"mulligans"},"usage_notes":{"explanation":"「**mulligan**」という単語は、主にゴルフ用語として使われ、打ち損じた場合にペナルティなしで打ち直すことができる「打ち直し」を意味します。非公式なゲームでよく認められます。また、比喩的に、失敗した試みをやり直す「二度目のチャンス」という意味でも使われます。料理用語としては、様々な材料を寄せ集めて作ったシチューやスープを指しますが、この用法はゴルフ用語ほど一般的ではありません。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used his mulligan on the second hole, so he couldn't use it again.","correct":"✓ There's no limit to how many mulligans you can use in this game.","note":"Mulligans are not always limited to one per round, it depends on the rules agreed upon before the game."},{"incorrect":"✗ I need a mulligan on my exam.","correct":"✓ I wish I could get a mulligan on that exam.","note":"The term 'mulligan' is typically used in informal contexts. For a formal situation like an exam, 'retake' or 'second chance' would be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Not applicable (specialized vocabulary)","frequency_google_ngram":"低頻度 (Low frequency) - 主にゴルフ関連の文脈で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**mulligan**」は、主にゴルフ用語として使われる専門的な単語です。ゴルフで打ち損じた場合に、ペナルティなしで打ち直すことができる「打ち直し」を意味します。比喩的には、失敗した試みをやり直す「二度目のチャンス」という意味でも使われます。ゴルフをしない人には馴染みのない単語かもしれません。"},"example_sentences":[{"sentence":"Since it was just a practice round, he allowed himself a **mulligan** on the tee shot.","translation":"練習ラウンドだったので、彼はティーショットで打ち直しを許可した。","type":"noun","meaning_category":"ゴルフの打ち直し"},{"sentence":"After the disastrous interview, she wished she could have a **mulligan**.","translation":"ひどい面接の後、彼女はやり直せたらいいのにと思った。","type":"noun","meaning_category":"二度目のチャンス"},{"sentence":"The campers cooked up a hearty **mulligan** with whatever vegetables they could find.","translation":"キャンパーたちは見つけられる限りの野菜を使って、ボリュームのある寄せ集めシチューを作った。","type":"noun","meaning_category":"寄せ集めシチュー"}]}