{"word":"deacetylate","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"脱アセチル化する","english_definition":"To remove an acetyl group from a molecule.","examples":[{"sentence":"Histone deacetylases deacetylate histones.","translation":"ヒストン脱アセチル化酵素はヒストンを脱アセチル化する。"},{"sentence":"Deacetylation of lysine residues can alter protein function.","translation":"リジン残基の脱アセチル化は、タンパク質の機能を変化させる可能性がある。"}],"collocations":["deacetylate histones","deacetylate proteins"],"synonyms":["remove acetyl group"],"antonyms":["acetylate"]}],"etymology":{"value":"From the prefix 'de-' (removal) + 'acetylate' (to introduce an acetyl group).","priority":"★★★"},"pronunciation":{"ipa":"/diːəˈsɛtɪleɪt/","syllables":"de-a-ce-tyl-ate"},"inflection":{"verb_forms":{"present_simple":["deacetylate","deacetylates"],"past_simple":"deacetylated","past_participle":"deacetylated","present_participle":"deacetylating"}},"usage_notes":{"explanation":"'Deacetylate' is a technical term used in biochemistry and molecular biology to describe the removal of an acetyl group (CH3CO) from a molecule. This process is often catalyzed by enzymes called deacetylases. Deacetylation can affect the structure and function of proteins, particularly histones, which play a crucial role in gene regulation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The enzyme deacetylated.","correct":"✓ The enzyme deacetylated the protein.","note":"'Deacetylate' is a transitive verb, so it requires a direct object (what is being deacetylated)."},{"incorrect":"✗ Deacetylation is the addition of an acetyl group.","correct":"✓ Deacetylation is the removal of an acetyl group.","note":"Deacetylation is the *removal* of an acetyl group, not the addition."}],"priority":"★★☆"},"related_words":{"derivatives":["deacetylation (noun: the process of removing an acetyl group)","deacetylase (noun: an enzyme that removes acetyl groups)","acetylate (verb: to add an acetyl group)","acetylation (noun: the process of adding an acetyl group)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Deacetylate' is a specialized term primarily encountered in advanced scientific contexts, specifically within biochemistry and molecular biology. It describes the process of removing an acetyl group from a molecule, often a protein like a histone. Understanding this term requires familiarity with basic chemical concepts and biological processes related to gene regulation and protein modification. Its usage is typically confined to research papers, textbooks, and scholarly discussions within these fields."},"example_sentences":[{"sentence":"HDAC inhibitors block the ability of histone deacetylases to **deacetylate** histones.","translation":"HDAC阻害剤は、ヒストン脱アセチル化酵素がヒストンを脱アセチル化する能力を阻害する。","type":"verb","meaning_category":"脱アセチル化する"},{"sentence":"The **deacetylated** form of the protein is more stable.","translation":"そのタンパク質の脱アセチル化された形態はより安定である。","type":"verb (past participle as adjective)","meaning_category":"脱アセチル化された"},{"sentence":"Further studies are needed to determine the effects of this compound on the **deacetylation** of specific proteins.","translation":"この化合物が特定のタンパク質の脱アセチル化に及ぼす影響を判断するためには、さらなる研究が必要である。","type":"related word (deacetylation)","meaning_category":"脱アセチル化 (名詞)"}]}