{"word":"poechoric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(統計学) 2つの変数間の相関が、それらの変数が他の変数と共有する相関によってのみ説明されること。つまり、直接的な因果関係がないこと。","english_definition":"(statistics) describing a correlation between two variables that is only explained by the correlations these variables share with other variables, and not by any direct causal relationship between them.","examples":[{"sentence":"The poechoric relationship between ice cream sales and crime rates is explained by the common variable of warm weather.","translation":"アイスクリームの売上と犯罪率の間のポエコロ的な関係は、温暖な気候という共通の変数によって説明される。"}],"collocations":["poechoric correlation","poechoric relationship"],"synonyms":["spurious correlation","indirect correlation"],"antonyms":["direct correlation","causal relationship"]}],"etymology":{"value":"The term 'poechoric' was coined by Paul Meehl, combining 'poe' (from Edgar Allan Poe, known for detective stories with misleading clues) and 'choric' (related to correlation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpoʊɪˈkɔːrɪk/","syllables":"poe-cho-ric"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'poechoric' is primarily used in statistics and psychology to describe a specific type of correlation that appears to exist between two variables but is actually due to their shared relationship with one or more other variables. It highlights the importance of considering potential confounding variables when interpreting correlations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The poechoric variable caused the increase in sales.","correct":"✓ The confounding variable created a poechoric relationship between the two variables.","note":"'Poechoric' describes a relationship, not a variable. It's the confounding variable that creates the poechoric relationship."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["confounding variable","spurious relationship","correlation","causation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Poechoric' is a highly specialized term used in statistics and research methodology. It describes a situation where two variables appear to be correlated, but this correlation is misleading because it's actually caused by both variables being related to a third, unmeasured variable (a confounding variable). Understanding this concept is crucial for avoiding incorrect causal inferences in research.","priority":"★★☆"},"example_sentences":[{"sentence":"Researchers identified a poechoric relationship between television viewing and obesity, explained by a lack of physical activity.","translation":"研究者らは、テレビ視聴と肥満の間にポエコロ的な関係があることを特定し、それは運動不足によって説明される。","type":"example","meaning_category":"statistics"}]}