{"word":"nonlubriciously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"In a manner that is not lubricating; without lubrication.","english_definition":"In a way that does not provide or involve lubrication.","examples":[{"sentence":"The gears were grinding nonlubriciously, causing excessive wear.","translation":"ギアは潤滑なしに回転し、過度の摩耗を引き起こしていました。"},{"sentence":"The door hinge moved nonlubriciously, producing a loud squeaking sound.","translation":"ドアの蝶番は潤滑なしに動き、大きなきしみ音を出していました。"}],"collocations":["operate nonlubriciously","move nonlubriciously","grind nonlubriciously"],"synonyms":["dryly","frictionally"],"antonyms":["lubriciously","smoothly"]}],"etymology":{"value":"Formed by adding the prefix \"non-\" (not) to the adverb \"lubriciously.\" The word \"lubriciously\" comes from \"lubricious,\" which is derived from Latin \"lubricus\" (slippery).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌnɒnluːˈbrɪʃəsli/","syllables":"non-lu-bri-cious-ly"},"inflection":{"notes":"Adverb - no inflection"},"usage_notes":{"explanation":"The word \"nonlubriciously\" is primarily used in technical or descriptive contexts to indicate the absence of lubrication. It is relatively uncommon in everyday language. It emphasizes the lack of smoothness or ease of movement due to the absence of a lubricating substance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The machine ran nonlubricant.","correct":"✓ The machine ran nonlubriciously.","note":"\"Nonlubricant\" is typically used as an adjective or noun referring to a substance that is not a lubricant. The adverb form \"nonlubriciously\" is needed to describe how the machine ran."}],"priority":"★☆☆"},"related_words":{"derivatives":["lubricious (adjective)","lubriciously (adverb)","lubricate (verb)","lubrication (noun)","nonlubricant (adjective/noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency - very rare word.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Nonlubriciously' is a technical term used to describe movement or operation without lubrication. It is a relatively rare word, primarily found in engineering or scientific contexts. Understanding its meaning requires knowledge of the root word 'lubricious' and the negative prefix 'non-'. It indicates a lack of smoothness or ease of movement due to the absence of lubrication."},"example_sentences":[{"sentence":"The piston moved nonlubriciously within the cylinder, leading to increased friction.","translation":"ピストンはシリンダー内で潤滑なしに動き、摩擦が増加しました。","type":"adverb","meaning_category":"without lubrication"},{"sentence":"Operating the mechanism nonlubriciously can cause significant damage over time.","translation":"機構を潤滑なしに操作すると、時間の経過とともに重大な損傷を引き起こす可能性があります。","type":"adverb","meaning_category":"without lubrication"}]}