{"word":"degomme","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(繊維から)糊抜きする、脱糊する","english_definition":"To remove gum or size from (textiles).","examples":[{"sentence":"The silk fabric was degummed to improve its softness.","translation":"絹織物は、その柔らかさを向上させるために糊抜きされた。"}],"collocations":["degum silk","degum cotton"],"synonyms":["desize"],"antonyms":[]}],"etymology":{"value":"Derived from the French word 'dégommer', which means 'to ungum' or 'to remove gum'.","priority":"★★★"},"pronunciation":{"ipa":"/deɪˈɡɒm/","syllables":"de-gom"},"inflection":{"verb_forms":{"present_simple":["degomme","degommes"],"past_simple":"degommed","past_participle":"degommed","present_participle":"degomming"}},"usage_notes":{"explanation":"'Degomme' is a technical term primarily used in the textile industry. It refers to the process of removing natural gums or sizing agents from fabrics, especially silk. This process enhances the fabric's texture, feel, and ability to absorb dyes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to degomme the stain from the shirt.","correct":"✓ I need to remove the stain from the shirt.","note":"'Degomme' specifically refers to removing gum or size from textiles, not general stain removal."}],"priority":"★★☆"},"related_words":{"derivatives":["degumming (noun): The process of removing gum from textiles."],"related_terms":["sizing (noun): A substance used to stiffen or glaze fabric, paper, or yarn.","textile (noun): A type of cloth or woven fabric."]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Degomme' is a specialized term used within the textile industry to describe the process of removing natural gums or sizing agents from fabrics. It is not commonly used in general conversation or writing. Understanding this term requires familiarity with textile manufacturing processes."},"example_sentences":[{"sentence":"The process of degomming silk involves boiling the fabric in a solution of soap and water.","translation":"絹の糊抜き工程では、石鹸と水の溶液で織物を煮沸する。","type":"verb","meaning_category":"remove gum from textiles"},{"sentence":"Proper degomming is essential for achieving the desired softness and luster in silk fabrics.","translation":"適切な糊抜きは、絹織物で望ましい柔らかさと光沢を実現するために不可欠である。","type":"verb","meaning_category":"remove gum from textiles"}]}