{"word":"Iberia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"イベリア半島","english_definition":"a peninsula in southwestern Europe, comprising Spain and Portugal","examples":[{"sentence":"Iberia is known for its diverse cultures and landscapes.","translation":"イベリア半島は多様な文化と景観で知られています。"}],"collocations":["Iberian Peninsula","History of Iberia","Culture of Iberia"],"synonyms":["Iberian Peninsula"],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史) 古代イベリア (現在のジョージア)","english_definition":"an ancient kingdom in the Caucasus region, corresponding roughly to modern-day Georgia","examples":[{"sentence":"Ancient Iberia played a significant role in the history of the Caucasus.","translation":"古代イベリアはコーカサス地方の歴史において重要な役割を果たしました。"}],"collocations":["Ancient Iberia","Kingdom of Iberia","History of Iberia"],"synonyms":["Kingdom of Iberia"],"antonyms":[]},{"part_of_speech":"noun","definition":"(航空会社) イベリア航空 (スペインの航空会社)","english_definition":"the flag carrier airline of Spain","examples":[{"sentence":"Iberia offers flights to destinations around the world.","translation":"イベリア航空は世界中の目的地へのフライトを提供しています。"}],"collocations":["Iberia Airlines","Iberia flight","Iberia booking"],"synonyms":["Iberia Airlines"],"antonyms":[]}],"etymology":{"value":"The name \"Iberia\" is of uncertain origin. One theory suggests it comes from the Iberian people, who inhabited the peninsula in ancient times. Another theory links it to the Ebro River (Iber in Latin). For the ancient kingdom in the Caucasus, the origin is also debated, possibly related to a local term.","priority":"★★☆"},"pronunciation":{"ipa":"/aɪˈbɪəriə/","syllables":"I-be-ri-a"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"\"Iberia\" has multiple meanings, referring to the Iberian Peninsula (Spain and Portugal), an ancient kingdom in the Caucasus (modern-day Georgia), or the Spanish airline, Iberia Airlines. Context is crucial to determine the intended meaning. When referring to the peninsula, it is often called the \"Iberian Peninsula\" for clarity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to visit Iberia next year, which is a country.","correct":"✓ I am going to visit Iberia next year, which is a peninsula containing Spain and Portugal.","note":"Iberia is a peninsula, not a country. Spain and Portugal are countries located on the Iberian Peninsula."}],"priority":"★★☆"},"related_words":{"derivatives":["Iberian (adjective, noun)"],"phrases":["Iberian Peninsula","Iberia Airlines"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, used in specific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"Iberia\" is used in several contexts, most commonly referring to the Iberian Peninsula, which includes Spain and Portugal. It can also refer to an ancient kingdom in the Caucasus region or the Spanish airline Iberia. Understanding the context is important to interpret the meaning correctly. It is typically encountered in geographical, historical, or travel-related content."},"example_sentences":[{"sentence":"The Iberian Peninsula has a rich history influenced by various cultures.","translation":"イベリア半島は、多様な文化の影響を受けた豊かな歴史を持っています。","type":"noun","meaning_category":"Iberian Peninsula"},{"sentence":"Iberia was an important kingdom in the ancient Caucasus.","translation":"イベリアは古代コーカサスにおける重要な王国でした。","type":"noun","meaning_category":"Ancient Kingdom"},{"sentence":"Iberia offers direct flights from Madrid to many Latin American cities.","translation":"イベリア航空は、マドリードから多くの中南米都市への直行便を提供しています。","type":"noun","meaning_category":"Airline"}]}