{"word":"cleithrum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"鎖骨（さこつ）の先祖にあたる骨。魚類や爬虫類、鳥類に見られる。","english_definition":"A bone present in the pectoral girdle of fish, reptiles, and birds, which is an ancestral bone to the clavicle (collarbone).","examples":[{"sentence":"The cleithrum is a significant bone in the evolution of the shoulder girdle.","translation":"肩帯の進化において、烏口鎖骨は重要な骨である。"},{"sentence":"In many fish species, the cleithrum is a large and prominent bone.","translation":"多くの魚種において、烏口鎖骨は大きく目立つ骨である。"}],"collocations":[],"synonyms":["clavicle (哺乳類)","scapula","coracoid"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'kleithron' (κλεῖθρον), meaning 'bar, bolt, key,' referring to its shape or function in the pectoral girdle.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈklaɪθrəm/","syllables":"clei-thrum"},"inflection":{"noun_plural":"cleithra"},"usage_notes":{"explanation":"The cleithrum is primarily a term used in zoology and comparative anatomy when discussing the skeletal structure of animals other than mammals. In mammals, the clavicle (collarbone) and scapula perform similar functions, but the cleithrum is not present.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cleithrum is the same as the human collarbone.","correct":"✓ The cleithrum is an ancestral bone to the human collarbone.","note":"The cleithrum is not the same as the human collarbone, but it is an evolutionary precursor to it."}],"priority":"★☆☆"},"related_words":{"derivatives":["postcleithrum","supracleithrum"],"related_terms":["pectoral girdle","clavicle","scapula","coracoid"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'cleithrum' is a specialized anatomical term primarily used in the context of zoology and comparative anatomy. It refers to a specific bone in the pectoral girdle of non-mammalian vertebrates. Understanding this term requires a background in biology or zoology. It is not commonly used in general conversation or writing."},"example_sentences":[{"sentence":"The size and shape of the **cleithrum** can vary significantly between different species of fish.","translation":"烏口鎖骨の大きさや形は、魚の種類によって大きく異なることがある。","type":"noun","meaning_category":"anatomy"},{"sentence":"Researchers studied the **cleithrum** of ancient reptiles to understand the evolution of the shoulder.","translation":"研究者たちは肩の進化を理解するために、古代爬虫類の烏口鎖骨を研究した。","type":"noun","meaning_category":"evolutionary biology"}]}