{"word":"Typhemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A rare condition characterized by the presence of toxins in the blood due to a metabolic disorder related to the amino acid tyrosine.","english_definition":"A rare metabolic disorder characterized by the presence of toxins in the blood due to a defect in tyrosine metabolism.","examples":[{"sentence":"The infant was diagnosed with typhemia after showing signs of liver dysfunction.","translation":"その乳児は肝機能障害の兆候を示した後、チーフェミアと診断された。"},{"sentence":"Early detection and dietary management are crucial in managing typhemia.","translation":"チーフェミアの管理には早期発見と食事療法が不可欠である。"}],"collocations":["diagnose typhemia","treat typhemia","manage typhemia","genetic typhemia"],"synonyms":["Tyrosinemia"],"antonyms":[]}],"etymology":{"value":"Derived from 'tyro-' referring to tyrosine, 'ph-' relating to presence, and '-emia' denoting a condition in the blood.","priority":"★★☆"},"pronunciation":{"ipa":"/taɪˈfiːmiə/","syllables":"ty-phe-mi-a"},"inflection":{"noun_plural":"typhemias"},"usage_notes":{"explanation":"Typhemia is a very rare medical condition, primarily discussed in medical and scientific contexts. It is often used interchangeably with tyrosinemia, although typhemia is a more general term referring to the presence of tyrosine-related toxins in the blood.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor suspected typhemia because of the patient's high blood sugar.","correct":"✓ The doctor suspected typhemia because of the patient's liver dysfunction and elevated tyrosine levels.","note":"Typhemia is related to tyrosine metabolism, not blood sugar levels. Symptoms and diagnostic indicators are specific to tyrosine-related metabolic issues."}],"priority":"★★☆"},"related_words":{"derivatives":["tyrosinemia (related metabolic disorder)","tyrosine (amino acid)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (very specialized medical vocabulary)","frequency_google_ngram":"Extremely low frequency - primarily found in medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Typhemia' is a highly specialized medical term referring to a rare metabolic disorder. Understanding this term requires a background in biochemistry or medicine, specifically related to amino acid metabolism and genetic disorders. It is not part of general vocabulary and is primarily used in medical or research contexts."},"example_sentences":[{"sentence":"The genetic testing confirmed the diagnosis of typhemia.","translation":"遺伝子検査によりチーフェミアの診断が確定した。","type":"noun","meaning_category":"medical condition"},{"sentence":"Treatment for typhemia often involves a special diet low in tyrosine and phenylalanine.","translation":"チーフェミアの治療には、通常、チロシンとフェニルアラニンの少ない特別食が含まれる。","type":"noun","meaning_category":"medical condition"}]}