{"word":"conciliator","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"調停者、仲裁人、懐柔者","english_definition":"a person who mediates between disputing people or groups.","examples":[{"sentence":"He acted as a conciliator between the management and the union.","translation":"彼は経営陣と労働組合の間の調停者として行動した。"},{"sentence":"The conciliator tried to find common ground between the parties.","translation":"調停者は当事者間の共通点を見つけようとした。"},{"sentence":"She is known as a skilled conciliator in international disputes.","translation":"彼女は国際紛争における熟練した調停者として知られている。"}],"collocations":["act as a conciliator","skilled conciliator","neutral conciliator","independent conciliator"],"synonyms":["mediator","arbitrator","peacemaker","intercessor","negotiator"],"antonyms":["agitator","instigator","troublemaker"]}],"etymology":{"value":"Late Middle English: from Latin conciliator, from conciliare ‘to conciliate’.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈsɪliˌeɪtər/","syllables":"con-cil-i-a-tor"},"inflection":{"noun_plural":"conciliators"},"usage_notes":{"explanation":"A 'conciliator' is someone who tries to bring opposing sides together to reach an agreement. They are neutral and aim to find a solution that satisfies both parties. The role of a conciliator is often less formal than that of an arbitrator, and they may focus more on facilitating communication and understanding.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He was a good communicator, therefore he was a good concentrator.","correct":"He was a good communicator, therefore he was a good conciliator.","note":"'Concentrator' (someone who focuses intently) is different from 'conciliator' (someone who mediates disputes)."},{"incorrect":"She used coercion as a conciliator.","correct":"She used persuasion as a conciliator.","note":"Conciliators rely on persuasion and diplomacy, not coercion."}],"priority":"★★☆"},"related_words":{"derivatives":["conciliate (verb): to stop someone from being angry; to gain (something, such as goodwill) by pleasing acts","conciliation (noun): the action of mediating between two disputing people or groups"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'conciliator' refers to someone who helps to resolve disputes between people or groups. It's a more formal word than 'mediator' or 'peacemaker' and is often used in legal or political contexts. Understanding the word requires a good vocabulary and an understanding of conflict resolution processes."},"example_sentences":[{"sentence":"An independent conciliator was appointed to resolve the labor dispute.","translation":"労働争議を解決するために、独立した調停者が任命された。","type":"general","meaning_category":"調停者"},{"sentence":"The president attempted to act as a conciliator in the ongoing political crisis.","translation":"大統領は進行中の政治危機において調停者として行動しようと試みた。","type":"general","meaning_category":"調停者"},{"sentence":"Her calm demeanor made her an effective conciliator.","translation":"彼女の穏やかな態度は、彼女を効果的な調停者にした。","type":"general","meaning_category":"調停者"}]}