{"word":"Plasmons","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"プラズモン（金属などの固体中の自由電子の集団振動の量子）","english_definition":"A quantum of plasma oscillation. Plasmons are collective oscillations of the electron density in a solid, such as a metal.","examples":[{"sentence":"Plasmons are used in various applications, including surface plasmon resonance (SPR) sensing.","translation":"プラズモンは、表面プラズモン共鳴（SPR）センシングを含む様々な応用で使用される。"},{"sentence":"The energy of a plasmon is quantized.","translation":"プラズモンのエネルギーは量子化されている。"}],"collocations":["surface plasmons","bulk plasmons","plasmon resonance","plasmon excitation","plasmon decay"],"synonyms":["collective excitation","electron oscillation","quantum of plasma"],"antonyms":[]}],"etymology":{"value":"Derived from 'plasma' (ionized gas) and '-on' (suffix denoting a particle or quantum).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈplæzmɒnz/","syllables":"Plas-mons"},"inflection":{"noun_plural":"plasmons"},"usage_notes":{"explanation":"'Plasmons' refers to the plural form of 'plasmon'. A plasmon is a collective excitation of electrons in a solid or plasma. It is a quasiparticle resulting from the quantization of plasma oscillations. Plasmons can be either surface plasmons (confined to a surface) or bulk plasmons (propagating through the bulk material). They are important in various fields, including physics, materials science, and nanotechnology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plasmon are excited by the light.","correct":"✓ The plasmons are excited by the light.","note":"Since we are talking about multiple quanta of plasma oscillation, the plural form 'plasmons' should be used with the plural verb 'are'."}],"priority":"★★☆"},"related_words":{"derivatives":["plasmonic (adjective)","plasmonics (noun)"],"related_terms":["surface plasmon resonance (SPR)","localized surface plasmon resonance (LSPR)","plasma","electron","photon"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Plasmons' are a complex concept related to the quantum behavior of electrons in materials. Understanding them requires knowledge of solid-state physics and quantum mechanics. The term is primarily used in scientific and technical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The study investigated the properties of surface plasmons in thin metal films.","translation":"その研究では、薄膜金属における表面プラズモンの特性を調査した。","type":"scientific","meaning_category":"physics"},{"sentence":"Plasmons can be used to enhance light-matter interactions at the nanoscale.","translation":"プラズモンは、ナノスケールでの光と物質の相互作用を強化するために使用できる。","type":"scientific","meaning_category":"nanotechnology"},{"sentence":"The researchers observed strong plasmon resonance in the gold nanoparticles.","translation":"研究者らは、金ナノ粒子において強いプラズモン共鳴を観察した。","type":"scientific","meaning_category":"materials science"}]}