{"word":"picketers","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ピケを張る人々、ピケット隊","english_definition":"People participating in a picket line; those who are picketing.","examples":[{"sentence":"The picketers marched in front of the factory, carrying signs.","translation":"ピケット隊は工場前を行進し、プラカードを掲げていた。"},{"sentence":"The police tried to control the crowd of picketers.","translation":"警察はピケット隊の群衆を制御しようとした。"},{"sentence":"Negotiations continued despite the presence of picketers outside the building.","translation":"建物の外にピケット隊がいるにもかかわらず、交渉は続けられた。"}],"collocations":["join the picketers (ピケット隊に加わる)","a line of picketers (ピケット隊の列)","peaceful picketers (平和的なピケット隊)","angry picketers (怒ったピケット隊)"],"synonyms":["demonstrators","protesters","strikers"],"antonyms":["scabs","strikebreakers"],"related_words":["picket","picket line","picketing"]}],"etymology":{"value":"The word 'picketers' is derived from 'picket,' which originally referred to a pointed stake used in military defenses. In the context of labor disputes, 'picket' came to mean a person stationed to dissuade others from entering a workplace, and 'picketers' are those individuals acting collectively.","priority":"N/A"},"pronunciation":{"ipa":"/ˈpɪkɪtərz/","syllables":"pic-ket-ers"},"inflection":{"noun_plural":"picketers"},"usage_notes":{"explanation":"'Picketers' specifically refers to individuals involved in picketing, which is a form of protest often used by striking workers. They typically stand or march near a workplace to discourage people from crossing the picket line, either to work (strikebreakers) or to conduct business. The term carries connotations of labor disputes and collective action.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The picketers was very loud.","correct":"The picketers were very loud.","note":"'Picketers' is a plural noun, so it requires a plural verb ('were')."},{"incorrect":"He is a picketer since yesterday.","correct":"He has been a picketer since yesterday.","note":"When indicating a state that began in the past and continues to the present, use the present perfect tense ('has been')."}],"priority":"N/A"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily associated with news and discussions of labor disputes.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'picketers' refers to a group of people who are participating in a picket line. A picket line is a protest, often by striking workers, where they stand or march near a workplace to discourage others from entering. This word is typically used in the context of labor disputes, strikes, and union activities. Understanding this term requires familiarity with these concepts."},"example_sentences":[{"sentence":"The **picketers** chanted slogans outside the factory gates.","translation":"ピケット隊は工場門の外でスローガンを唱えた。","type":"noun","meaning_category":"protesters"},{"sentence":"Local residents showed their support for the **picketers** by bringing them food and water.","translation":"地元の住民は食べ物や水をピケット隊に差し入れ、彼らを支援した。","type":"noun","meaning_category":"protesters"},{"sentence":"The company hired security guards to monitor the **picketers**.","translation":"会社はピケット隊を監視するために警備員を雇った。","type":"noun","meaning_category":"protesters"}]}