{"word":"stigmatizing","priority":"★☆☆","meanings":[{"part_of_speech":"verb (present participle)","definition":"(人や集団を)汚名を着せる、不名誉にする、社会的に排除するような扱いをする","english_definition":"describing someone or something as worthy of disgrace or great disapproval; treating someone unfairly or as if they are not very good, for example because of their race or a health problem.","examples":[{"sentence":"Stigmatizing mental illness prevents people from seeking help.","translation":"精神疾患に汚名を着せることは、人々が助けを求めるのを妨げる。"},{"sentence":"The media is often accused of stigmatizing certain groups in society.","translation":"メディアは、社会のある特定のグループに汚名を着せていると非難されることが多い。"},{"sentence":"We need to stop stigmatizing people living with HIV/AIDS.","translation":"HIV/AIDSと共に生きる人々に汚名を着せるのをやめる必要がある。"}],"collocations":["stigmatizing language (汚名を着せるような言葉)","stigmatizing attitudes (汚名を着せるような態度)","stigmatizing stereotypes (汚名を着せるような固定観念)","stigmatizing behavior (汚名を着せるような行動)","stigmatizing labels (汚名を着せるようなレッテル)"],"synonyms":["discrediting","disgracing","shaming","ostracizing","marginalizing","labeling","stereotyping"],"antonyms":["respecting","accepting","validating","normalizing","including","embracing"]}],"etymology":{"value":"The word 'stigmatize' comes from the Greek word 'stigma', which originally referred to a mark or brand burned into the skin of slaves or criminals. Over time, the meaning evolved to refer to any mark of disgrace or infamy.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstɪɡmətaɪzɪŋ/","syllables":"stig-ma-tiz-ing"},"inflection":{"verb_forms":{"present_simple":["stigmatize","stigmatizes"],"past_simple":"stigmatized","past_participle":"stigmatized","present_participle":"stigmatizing"}},"usage_notes":{"explanation":"'Stigmatizing' refers to the act of attaching a negative label or stereotype to a person or group, leading to social exclusion, discrimination, and prejudice. It often involves associating certain characteristics or conditions with shame, disgrace, or moral inferiority. This can have serious consequences for the well-being and opportunities of those who are stigmatized. The term is frequently used in discussions related to mental health, physical disabilities, diseases, socioeconomic status, and other social issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The stigmatizing of mental health is a big problem.","correct":"✓ The stigmatization of mental health is a big problem.","note":"'Stigmatizing' is the present participle or gerund form of the verb. The noun form is 'stigmatization'."},{"incorrect":"✗ Don't stigmatize to people with addiction.","correct":"✓ Don't stigmatize people with addiction.","note":"The verb 'stigmatize' is directly followed by the person or group being stigmatized."},{"incorrect":"✗ The society is stigmatizing of mental illness.","correct":"✓ The society is stigmatizing mental illness. / ✓ The society is stigmatized by mental illness.","note":"The correct usage is either 'The society is stigmatizing mental illness' (active voice) or 'The society is stigmatized by mental illness' (passive voice)."}],"priority":"★★☆"},"related_words":{"derivatives":["stigma (名詞: 汚名、烙印)","stigmatization (名詞: 汚名を着せること)","stigmatized (形容詞: 汚名を着せられた)","stigmatic (形容詞: 汚名に関する、汚名を帯びた)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stigmatizing' means to treat a person or group of people unfairly by disapproving of them or judging them negatively, often because they have a particular characteristic or condition (like a mental illness or a disease). It involves creating a negative stereotype and associating shame or disgrace with that characteristic. This can lead to discrimination and social exclusion. The word is often used in discussions about social justice and equality.","priority":"★★☆"},"example_sentences":[{"sentence":"The article discussed the dangers of stigmatizing obesity.","translation":"その記事は、肥満に汚名を着せることの危険性について論じた。","type":"verb (present participle)","meaning_category":"汚名を着せる"},{"sentence":"Stigmatizing addiction prevents people from seeking treatment.","translation":"依存症に汚名を着せることは、人々が治療を求めるのを妨げる。","type":"verb (present participle)","meaning_category":"汚名を着せる"},{"sentence":"We must challenge stigmatizing attitudes towards refugees.","translation":"難民に対する汚名を着せるような態度に異議を唱えなければならない。","type":"adjective (as part of 'stigmatizing attitudes')","meaning_category":"汚名を着せる"},{"sentence":"The campaign aims to reduce stigmatizing language in healthcare.","translation":"そのキャンペーンは、医療における汚名を着せるような言葉を減らすことを目的としている。","type":"adjective (as part of 'stigmatizing language')","meaning_category":"汚名を着せる"}]}