{"word":"Unctuosity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(人や態度などの)油断のなさ、ごますり、追従、媚びへつらい","english_definition":"The quality or characteristic of being unctuous; excessive piousness or moralistic fervor; insincere earnestness.","examples":[{"sentence":"His unctuosity was evident in the way he constantly agreed with everything the boss said.","translation":"彼のごますりぶりは、上司の言うことに常に同意する態度に明らかだった。"},{"sentence":"The politician's unctuosity during the campaign was off-putting to many voters.","translation":"選挙運動中の政治家の媚びへつらいは、多くの有権者にとって不快だった。"},{"sentence":"I couldn't stand the unctuosity of the salesman; he was so obviously trying to flatter me.","translation":"私はセールスマンの油断のなさに我慢できなかった。彼は明らかに私にお世辞を言おうとしていた。"}],"collocations":["display unctuosity","obsequious unctuosity","affected unctuosity","insincere unctuosity"],"synonyms":["obsequiousness","servility","sycophancy","fawning","ingratiation","smarm","oiliness","greasiness","fulsomeness"],"antonyms":["sincerity","genuineness","honesty","candor","frankness","forthrightness"]}],"etymology":{"value":"From Late Latin *unctuositas*, from Latin *unctuosus* (“oily, greasy”), from *unctus*, past participle of *unguere* (“to anoint, smear with oil”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌŋktʃuˈɒsɪti/","syllables":"unc-tu-o-si-ty"},"inflection":{"noun_plural":"unctuosities"},"usage_notes":{"explanation":"'Unctuosity' describes behavior or qualities that are excessively flattering, ingratiating, or insincerely earnest. It often implies a desire to gain favor or advantage through flattery or obsequiousness. The term carries a negative connotation, suggesting a lack of sincerity and an excess of artificiality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unctuosity of the oil made it difficult to handle.","correct":"✓ The viscosity of the oil made it difficult to handle.","note":"'Unctuosity' refers to a characteristic of people or behavior, not the physical properties of substances. Use 'viscosity' or 'oiliness' to describe the texture of oil."},{"incorrect":"✗ She admired his unctuosity in dealing with difficult clients.","correct":"✓ She admired his diplomacy in dealing with difficult clients.","note":"'Unctuosity' is generally negative. If you want to express admiration for someone's skill in handling people, use 'diplomacy' or 'tact' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["unctuous (adjective)","unctuously (adverb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unctuosity' is a relatively uncommon word that describes the quality of being excessively flattering or insincerely earnest, often to gain favor. It's a more sophisticated way to describe someone who is overly obsequious or fawning. The word carries a negative connotation, implying a lack of sincerity. It is more likely to be encountered in formal writing or sophisticated conversation."},"example_sentences":[{"sentence":"The manager's unctuosity towards the CEO was noticed by everyone in the office.","translation":"マネージャーのCEOに対するごますりぶりは、オフィスにいる全員に気づかれていた。","type":"general","meaning_category":"ごますり"},{"sentence":"Her unctuosity was a clear attempt to manipulate the situation to her advantage.","translation":"彼女の媚びへつらいは、状況を自分に有利に操ろうとする明らかな試みだった。","type":"general","meaning_category":"媚びへつらい"},{"sentence":"The actor's unctuosity in accepting the award seemed forced and unnatural.","translation":"俳優が賞を受け入れる際のごますりぶりは、不自然でわざとらしかった。","type":"general","meaning_category":"ごますり"}]}