{"word":"non-weapon","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非兵器、武器ではないもの","english_definition":"An object or device that is not designed or intended to be used as a weapon.","examples":[{"sentence":"The police determined that the object found at the scene was a non-weapon.","translation":"警察は、現場で発見された物体が非兵器であると判断した。"},{"sentence":"The museum exhibit featured a variety of non-weapon tools used by early humans.","translation":"博物館の展示では、初期の人類が使用したさまざまな非兵器の道具が展示されていました。"}],"collocations":["non-weapon item","non-weapon tool","considered a non-weapon"],"synonyms":["tool","implement","device"],"antonyms":["weapon","arm","ordnance"]},{"part_of_speech":"adjective","definition":"非兵器の、武器として使用されない","english_definition":"Not designed or intended for use as a weapon.","examples":[{"sentence":"The company specializes in the development of non-weapon technologies.","translation":"その会社は、非兵器技術の開発を専門としています。"},{"sentence":"The police are trained to distinguish between weapon and non-weapon objects.","translation":"警察官は、武器と非兵器の物体を区別するように訓練されています。"}],"collocations":["non-weapon technology","non-weapon use","non-weapon application"],"synonyms":["non-military","civilian"],"antonyms":["military","weaponized"]}],"etymology":{"value":"The word 'non-weapon' is formed by adding the prefix 'non-' (meaning 'not') to the word 'weapon'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒnˈwɛpən/","syllables":"non-weap-on"},"inflection":{"noun_plural":"non-weapons"},"usage_notes":{"explanation":"'Non-weapon' is used to describe objects, technologies, or items that are not designed or intended to be used for causing harm or as instruments of war. It is often used in legal, security, and technological contexts to differentiate between items that are dangerous and those that are not.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a non weapon to defend himself.","correct":"✓ He used a non-weapon object to defend himself.","note":"It's better to specify what kind of non-weapon was used, like 'non-weapon object' or 'non-weapon tool' for clarity."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"B2","text":"The term 'non-weapon' is relatively straightforward. It simply means something that is not a weapon. It's often used in contexts where it's important to distinguish between items that could be used to cause harm and those that are harmless. For example, in security checks, officials need to determine whether an object is a weapon or a non-weapon. The word is formed by adding the prefix 'non-' to 'weapon', which is a common way to negate the meaning of a word."},"example_sentences":[{"sentence":"The police confirmed that the item was a **non-weapon**.","translation":"警察は、そのアイテムが非兵器であることを確認しました。","type":"noun","meaning_category":"非兵器"},{"sentence":"The company focuses on developing **non-weapon** technologies for civilian use.","translation":"その会社は、民生用向けの非兵器技術の開発に力を入れています。","type":"adjective","meaning_category":"非兵器の"}]}