{"word":"deadfalls","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"落とし穴、罠、待ち伏せ場所","english_definition":"A trap for animals, typically consisting of a heavy weight that is released to crush or trap the animal.","examples":[{"sentence":"The trappers set deadfalls in the forest to catch bears.","translation":"猟師たちはクマを捕まえるために森に落とし穴を仕掛けた。"},{"sentence":"Ancient hunters used deadfalls to hunt large game.","translation":"古代の狩猟者たちは大きな獲物を狩るために落とし穴を使った。"}],"collocations":["set a deadfall","spring a deadfall","animal caught in a deadfall"],"synonyms":["trap","snare","pitfall","ambush"],"antonyms":[]}],"etymology":{"value":"The word \"deadfall\" is a compound of \"dead\" and \"fall\", referring to the lethal falling weight used in the trap.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdɛdˌfɔlz/","syllables":"dead-falls"},"inflection":{"noun_plural":"deadfalls"},"usage_notes":{"explanation":"\"Deadfalls\" refers specifically to a type of trap that uses a falling weight to capture or kill an animal. It is often used in the context of hunting or trapping. The term can also be used metaphorically to describe a situation that is dangerous or likely to cause someone to fail.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They built deadfalls to protect their house.","correct":"✓ They built fences to protect their house.","note":"Deadfalls are used for trapping animals, not for general protection of property."}],"priority":"★★★"},"related_words":{"derivatives":["deadfall (singular noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"deadfalls\" refers to a specific type of trap used in hunting. It is not a commonly used word outside of contexts related to trapping, hunting, or survival skills. Understanding the term requires knowledge of historical hunting methods and vocabulary related to trapping.","priority":"★★☆"},"example_sentences":[{"sentence":"The old hunting manual described how to construct effective deadfalls.","translation":"その古い狩猟マニュアルには、効果的な落とし穴の作り方が記述されていた。","type":"noun","meaning_category":"trap"},{"sentence":"The forest was full of hidden deadfalls, making it dangerous to traverse.","translation":"その森は隠された落とし穴でいっぱいで、横断するのは危険だった。","type":"noun","meaning_category":"trap"}]}