{"word":"superdiabolical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"極めて悪魔的な、極悪非道な","english_definition":"extremely diabolical; exceedingly wicked or evil.","examples":[{"sentence":"The villain's plan was superdiabolical, designed to cause maximum chaos.","translation":"悪役の計画は極めて悪魔的で、最大限の混乱を引き起こすように設計されていた。"},{"sentence":"He concocted a superdiabolical scheme to steal the priceless artifact.","translation":"彼はその非常に貴重な工芸品を盗むための極悪非道な計画を練り上げた。"}],"collocations":["superdiabolical plan","superdiabolical scheme","superdiabolical plot"],"synonyms":["extremely evil","fiendish","atrocious","nefarious","wicked","devilish"],"antonyms":["benevolent","kind","good","angelic"]}],"etymology":{"value":"\"super-\" (超、非常に) + \"diabolical\" (悪魔的な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsuːpərˌdaɪəˈbɒlɪkəl/","syllables":"su-per-di-a-bol-i-cal"},"inflection":{"adjective_forms":{"comparative":"more superdiabolical","superlative":"most superdiabolical"}},"usage_notes":{"explanation":"\"Superdiabolical\" is a strong adjective used to describe something that is extremely evil or wicked. It intensifies the meaning of \"diabolical,\" suggesting a level of malevolence that is exceptionally high. This word is often used in fictional contexts to describe the plans or actions of villains.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a superdiabolical person with many friends.","correct":"✓ He is a diabolical person with no friends.","note":"\"Superdiabolical\" implies extreme wickedness, which is less likely to be associated with someone who has many friends. It's more fitting for describing actions or plans rather than people directly."}],"priority":"★★☆"},"related_words":{"derivatives":["diabolical","diabolically"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'superdiabolical' is a high-level adjective indicating something extremely evil or wicked. It's formed by adding 'super-' to 'diabolical' to intensify the meaning. This word is rarely used in everyday conversation and is more common in literature or dramatic contexts to describe exceptionally malicious plans or characters. Understanding this word requires a strong vocabulary and familiarity with the nuances of advanced English.","priority":"★☆☆"},"example_sentences":[{"sentence":"The mad scientist unveiled his superdiabolical invention, designed to enslave humanity.","translation":"その狂った科学者は、人類を奴隷にするように設計された、彼の極悪非道な発明を発表した。","type":"adjective","meaning_category":"極めて悪魔的な"},{"sentence":"Her superdiabolical plot involved manipulating the stock market for personal gain.","translation":"彼女の極悪非道な計画には、個人的な利益のために株式市場を操作することが含まれていた。","type":"adjective","meaning_category":"極悪非道な"}]}