{"word":"Hanoverianize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ハノーファー朝風にする、ハノーファー朝のやり方を取り入れる、ハノーファー朝の特性を付与する","english_definition":"To make something Hanoverian in character or style; to bring something into conformity with Hanoverian practices or principles.","examples":[{"sentence":"The architect sought to Hanoverianize the building's facade, incorporating elements of Georgian design.","translation":"建築家は、ジョージ王朝時代のデザイン要素を取り入れ、建物のファサードをハノーファー朝風にしようとした。"},{"sentence":"Critics accused the government of attempting to Hanoverianize the legal system.","translation":"批判家たちは、政府が法制度をハノーファー朝風にしようと試みていると非難した。"}],"collocations":["Hanoverianize the architecture","Hanoverianize the government","Hanoverianize the culture"],"synonyms":["Anglicize","Europeanize","Modernize"],"antonyms":["De-Europeanize","Traditionalize"]}],"etymology":{"value":"The word is derived from 'Hanoverian' (relating to the House of Hanover, a German royal dynasty that ruled Great Britain from 1714 to 1901) and the suffix '-ize' (meaning 'to make or become').","priority":"★★☆"},"pronunciation":{"ipa":"/həˈnoʊvəriənaɪz/","syllables":"ha-no-ve-ri-an-ize"},"inflection":{"verb_forms":{"present_simple":["Hanoverianize","Hanoverianizes"],"past_simple":"Hanoverianized","past_participle":"Hanoverianized","present_participle":"Hanoverianizing"}},"usage_notes":{"explanation":"'Hanoverianize' is a relatively rare word. It is used to describe the process of adapting or transforming something to reflect the characteristics, style, or principles associated with the House of Hanover, particularly in the context of British history and culture.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist Hanoverianized his painting with bright colors.","correct":"✓ The artist modernized his painting with bright colors.","note":"Using 'modernized' is more appropriate in this context, as 'Hanoverianize' refers to a specific historical style."}],"priority":"★☆☆"},"related_words":{"derivatives":["Hanoverian (adjective, noun)","Hanoverianism (noun)"],"related_terms":["Georgian (relating to the reigns of George I, George II, George III, and George IV of the House of Hanover)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Hanoverianize' is a specialized term related to a specific period in British history. Understanding its meaning requires knowledge of the House of Hanover and its influence on British culture. The word is rarely used in general contexts."},"example_sentences":[{"sentence":"The new administration sought to Hanoverianize the colonial governance structures.","translation":"新政権は植民地統治機構をハノーファー朝風にしようとした。","type":"verb","meaning_category":"ハノーファー朝風にする"},{"sentence":"The architecture was Hanoverianized during the reign of George I.","translation":"その建築はジョージ1世の治世中にハノーファー朝風にされた。","type":"verb","meaning_category":"ハノーファー朝風にする"}]}