{"word":"Struldbrug","priority":"低","meanings":[{"part_of_speech":"noun","definition":"(ガリヴァー旅行記に登場する)不死の人間。ただし、不老ではないため、年老いていくにつれて苦しみが増す。","english_definition":"(In Gulliver's Travels) an immortal human being; however, they do not have eternal youth, and their suffering increases as they age.","examples":[{"sentence":"The Struldbrugs in Swift's Gulliver's Travels are not enviable creatures.","translation":"スウィフトの『ガリヴァー旅行記』に登場するストラルドブルグは、羨ましい存在ではない。"},{"sentence":"The idea of being a Struldbrug, living forever but growing old, is a frightening one.","translation":"ストラルドブルグのように、永遠に生きるが老いていくという考えは、恐ろしいものである。"}],"collocations":["become a Struldbrug (ストラルドブルグになる)","live like a Struldbrug (ストラルドブルグのように生きる)","the fate of a Struldbrug (ストラルドブルグの運命)"],"synonyms":["immortal","undying","eternally living"],"antonyms":["mortal","dying","transient"]}],"etymology":{"value":"ジョナサン・スウィフトの『ガリヴァー旅行記』に登場する架空の言葉。語源は不明だが、古英語や古ノルド語に由来する要素が含まれている可能性があるという説がある。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstrʌldbrʌɡ/","syllables":"Struld-brug"},"inflection":{"notes":"複数形は Struldbrugs"},"usage_notes":{"explanation":"「**Struldbrug**」は、ジョナサン・スウィフトの風刺小説『ガリヴァー旅行記』に登場する、ラグナグ島に住む不死の人間を指す固有名詞です。ただし、ストラルドブルグは不死ではあるものの不老ではなく、年を取るにつれて肉体的・精神的に衰え、苦しみが増していきます。そのため、不死の存在に対する皮肉や警鐘として用いられることが多い言葉です。一般的には、文学作品や哲学的な議論の中で、不死の概念について考察する際に言及されることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wants to be a Struldbrug because he wants to live forever young.","correct":"✓ He doesn't understand the true nature of a Struldbrug; they are immortal but not eternally young.","note":"ストラルドブルグは不死ではあるものの、不老ではないという点が重要です。"},{"incorrect":"✗ Struldbrugs are happy to live forever.","correct":"✓ Struldbrugs are often miserable due to their endless aging and suffering.","note":"ストラルドブルグは、老いによる苦しみのため、必ずしも幸福とは限りません。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["immortality (不死)","eternal youth (不老)","Gulliver's Travels (ガリヴァー旅行記)","Jonathan Swift (ジョナサン・スウィフト)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"該当なし (文学作品に特有の語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 一般的な語彙ではない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Struldbrug**」は、ジョナサン・スウィフトの『ガリヴァー旅行記』に登場する架空の種族の名前です。彼らは不死ですが、若さを保つことはできません。そのため、年老いていくにつれて、ますます惨めになっていきます。この単語は、不死の概念が必ずしも望ましいものではないことを示す比喩として使われることがあります。この単語は、文学や哲学の高度な議論でのみ使用される可能性が高く、一般的な会話では使用されません。"},"example_sentences":[{"sentence":"The author used the Struldbrugs as a commentary on the human desire for immortality.","translation":"作者はストラルドブルグを、人間の不死への願望に対する批評として用いた。","type":"noun","meaning_category":"不死の人間"},{"sentence":"The prospect of becoming a Struldbrug, living forever in a state of decay, is a chilling one.","translation":"ストラルドブルグになり、朽ち果てた状態で永遠に生きるという見込みは、身の毛もよだつものだ。","type":"noun","meaning_category":"不死の人間"},{"sentence":"Unlike the elves in Tolkien's works, the Struldbrugs do not possess eternal youth along with their immortality.","translation":"トールキンの作品に登場するエルフとは異なり、ストラルドブルグは不死とともに永遠の若さを持っているわけではない。","type":"noun","meaning_category":"不死の人間"}]}