{"word":"Terrijo","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Slang, derogatory) A foreigner, typically referring to a non-Japanese person. Often used in a discriminatory or offensive manner.","english_definition":"(Slang, derogatory) A foreigner, typically referring to a non-Japanese person. Often used in a discriminatory or offensive manner.","examples":[{"sentence":"Some people use the term 'Terrijo' to insult foreigners.","translation":"一部の人々は「テリジョ」という言葉を使って外国人を侮辱する。"},{"sentence":"It's important to avoid using derogatory terms like 'Terrijo'.","translation":"「テリジョ」のような侮蔑的な言葉を使うことは避けるべきだ。"}],"collocations":[],"synonyms":["Gaijin (外人)","foreigner","outsider"],"antonyms":["Japanese","local"],"notes":"This term is highly offensive and should be avoided."}],"etymology":{"value":"Likely a corruption or alteration of 'Terrestrial' or a similar foreign-sounding word, combined with a Japanese-sounding suffix. The exact origin is unclear, but it emerged as a derogatory term for foreigners.","priority":"★☆☆"},"pronunciation":{"ipa":"/teɾiʑo/","syllables":"Te-ri-jo"},"inflection":{},"usage_notes":{"explanation":"'Terrijo' is a highly offensive and discriminatory term used to refer to foreigners, particularly non-Japanese people. Its use is strongly discouraged as it promotes prejudice and disrespect. It is important to use respectful and inclusive language when referring to people of different nationalities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ 'Terrijo' is a polite way to refer to foreigners.","correct":"✓ 'Terrijo' is a derogatory term for foreigners and should not be used.","note":"'Terrijo' is never a polite or acceptable term."}],"priority":"★★★"},"related_words":{"derivatives":[],"phrases":[],"related_terms":["Gaijin (外人) - A more common, but sometimes still considered insensitive, term for foreigner."]},"level_frequency":{"frequency_google_ngram":"Low frequency due to its derogatory nature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Terrijo' is a highly offensive slur used to denigrate foreigners. Understanding its meaning is crucial to recognizing and combating prejudice, but using the term itself is unacceptable. It is essential to promote respectful and inclusive language when discussing people of different nationalities."},"example_sentences":[{"sentence":"Using the word 'Terrijo' is considered extremely offensive.","translation":"「テリジョ」という言葉を使うことは非常に侮辱的だと考えられている。","type":"statement","meaning_category":"offensive term"},{"sentence":"We should avoid using derogatory terms like 'Terrijo' to refer to people from other countries.","translation":"私たちは他の国の人々を指すのに「テリジョ」のような侮蔑的な言葉を使うべきではない。","type":"recommendation","meaning_category":"avoidance of offensive language"}]}