{"word":"thromboarteritis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"血栓性動脈炎","english_definition":"inflammation of an artery accompanied by the formation of a thrombus (blood clot).","examples":[{"sentence":"Thromboarteritis can lead to serious complications if left untreated.","translation":"血栓性動脈炎は、放置すると重篤な合併症を引き起こす可能性があります。"}],"collocations":["thromboarteritis obliterans (閉塞性血栓性血管炎)"],"synonyms":["arteritis","vasculitis"],"antonyms":[]}],"etymology":{"value":"Derived from \"thrombo-\" (referring to a thrombus or blood clot), \"arter-\" (referring to an artery), and \"-itis\" (denoting inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθrɒmboʊɑːrtəˈraɪtɪs/","syllables":"throm-bo-ar-ter-i-tis"},"inflection":{"noun_plural":"thromboarteritides (rare)"},"usage_notes":{"explanation":"Thromboarteritis is a medical term specifically describing the inflammation of an artery coupled with the formation of a blood clot. It is often used in the context of specific conditions like thromboangiitis obliterans (Buerger's disease).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Thromboarteritis is a virus.","correct":"✓ Thromboarteritis is an inflammation of an artery.","note":"Thromboarteritis is an inflammatory condition, not an infectious disease caused by a virus."}],"priority":"★★☆"},"related_words":{"derivatives":["thromboangiitis (血栓血管炎)","arteritis (動脈炎)","thrombosis (血栓症)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. This is a specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Thromboarteritis\" is a highly specialized medical term referring to inflammation of an artery accompanied by a blood clot. Understanding requires knowledge of medical terminology related to blood vessels and inflammation. It is not commonly used outside of medical contexts."},"example_sentences":[{"sentence":"The patient was diagnosed with thromboarteritis in the lower extremities.","translation":"患者は下肢の血栓性動脈炎と診断されました。","type":"medical","meaning_category":"inflammation and clotting"},{"sentence":"Treatment for thromboarteritis typically involves managing the inflammation and preventing further clot formation.","translation":"血栓性動脈炎の治療は通常、炎症の管理とさらなる血栓形成の予防を含みます。","type":"medical","meaning_category":"treatment"}]}