{"word":"antineutrality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"中立でないこと、中立に反対すること、非中立性","english_definition":"Opposition to neutrality; the state of not being neutral.","examples":[{"sentence":"The country's antineutrality stance was evident in its support for the allied forces.","translation":"その国の非中立的な立場は、連合軍への支持において明らかだった。"},{"sentence":"His antineutrality was a result of his strong moral convictions.","translation":"彼の非中立性は、彼の強い道徳的信念の結果だった。"}],"collocations":["adopt an antineutrality stance","express antineutrality","policy of antineutrality"],"synonyms":["partisanship","bias","non-neutrality","opposition to neutrality"],"antonyms":["neutrality","impartiality","objectivity"]}],"etymology":{"value":"'Anti-' (反対) + 'neutrality' (中立性)","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiːnuːˈtræləti/","syllables":"an-ti-neu-tral-i-ty"},"inflection":{"noun_plural":"antineutralities"},"usage_notes":{"explanation":"'Antineutrality' refers to the active opposition to neutrality, rather than simply lacking neutrality. It implies a deliberate stance against being neutral, often in favor of a particular side or viewpoint.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The country claimed antineutrality, but continued to trade with both sides.","correct":"✓ The country claimed non-neutrality, but continued to trade with only one side.","note":"'Antineutrality' implies active opposition, so trading with both sides would contradict that. Non-neutrality is more accurate."}],"priority":"★★☆"},"related_words":{"derivatives":["antineutral (adjective)"],"related_terms":["non-neutrality","bias","partisanship"]},"level_frequency":{"frequency_google_ngram":"Low Frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Antineutrality' is a relatively uncommon term that describes the active opposition to neutrality. It is often used in political or philosophical contexts to describe a stance against impartiality or objectivity. Understanding this word requires familiarity with the concept of neutrality and the prefix 'anti-'. "},"example_sentences":[{"sentence":"The politician's speech revealed a clear antineutrality toward the proposed legislation.","translation":"その政治家の演説は、提案された法律に対する明確な非中立性を示した。","type":"noun","meaning_category":"非中立性"},{"sentence":"The organization's antineutrality on the issue led to significant controversy.","translation":"その組織のその問題に対する非中立性は、重大な論争を引き起こした。","type":"noun","meaning_category":"非中立性"}]}