{"word":"tormentedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"苦悩して、苦しみながら、責めさいなまれて","english_definition":"In a tormented manner; experiencing or characterized by severe physical or mental suffering.","examples":[{"sentence":"He paced tormentedly, unable to find a solution.","translation":"彼は解決策を見つけられず、苦悩しながら歩き回った。"},{"sentence":"She cried out tormentedly in her sleep.","translation":"彼女は眠りの中で苦しげに叫んだ。"},{"sentence":"The artist stared at the canvas, tormentedly searching for inspiration.","translation":"その芸術家はキャンバスを見つめ、苦しみながらインスピレーションを探していた。"}],"collocations":["tormentedly cry","tormentedly pace","tormentedly search","tormentedly whisper","tormentedly remember"],"synonyms":["agonizingly","painfully","miserably","distressingly","torturously","anguishedly"],"antonyms":["peacefully","calmly","happily","comfortably"]}],"etymology":{"value":"The word \"tormentedly\" is derived from the word \"tormented,\" which is the past participle of the verb \"torment.\" \"Torment\" comes from the Old French word \"tormenter,\" which in turn comes from the Latin word \"tormentum,\" meaning an instrument of torture. The suffix \"-edly\" is added to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/tɔːrˈmɛntɪdli/","syllables":"tor-men-ted-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Tormentedly\" describes actions or states of being that are characterized by intense suffering, whether physical or, more commonly, mental or emotional. It suggests a state of being deeply troubled or afflicted. It is often used to describe someone who is struggling with inner demons, painful memories, or overwhelming feelings of distress.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He smiled tormentedly.","correct":"He smiled sadly/bitterly.","note":"Smiling is generally associated with happiness. \"Tormentedly\" implies suffering, so it is more appropriate to use adverbs like \"sadly\" or \"bitterly\" to describe a smile that conveys negative emotions."},{"incorrect":"She lived tormentedly ever after.","correct":"She lived miserably ever after.","note":"\"Tormentedly\" implies a more active and intense form of suffering. \"Miserably\" is more suitable for describing a general state of unhappiness over a long period."}],"priority":"★☆☆"},"related_words":{"derivatives":["torment (noun, verb)","tormented (adjective)","tormentor (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"tormentedly\" is an adverb that describes an action done in a way that shows great mental or physical suffering. It's not a common word, and you'll usually find it in literature or formal writing to emphasize the intense pain or distress someone is experiencing. Because it's not a frequently used word, it's more suitable for advanced learners.","priority":"★☆☆"},"example_sentences":[{"sentence":"He gripped the photograph, staring at it tormentedly.","translation":"彼は写真を握りしめ、苦悩しながらそれを見つめた。","type":"adverb","meaning_category":"suffering"},{"sentence":"She whispered his name tormentedly, tears streaming down her face.","translation":"彼女は苦しげに彼の名前を囁き、涙が顔を伝った。","type":"adverb","meaning_category":"suffering"},{"sentence":"The prisoner tossed and turned tormentedly in his cell.","translation":"囚人は独房の中で苦しみながら寝返りを打った。","type":"adverb","meaning_category":"suffering"}]}