{"word":"Edwardean","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"エドワード朝（1901年 - 1910年）の、またはエドワード朝時代に特徴的な","english_definition":"Of or relating to the reign of King Edward VII of Great Britain (1901-1910), or characteristic of that period.","examples":[{"sentence":"The novel evokes an Edwardean atmosphere of upper-class society.","translation":"その小説は、上流社会のエドワード朝時代の雰囲気を呼び起こす。"},{"sentence":"Edwardean architecture is known for its elegance and grandeur.","translation":"エドワード朝の建築は、その優雅さと壮大さで知られている。"}],"collocations":["Edwardean era","Edwardean architecture","Edwardean society","Edwardean style"],"synonyms":["early 20th century","turn-of-the-century","pre-war"],"antonyms":["Victorian","Georgian"]},{"part_of_speech":"adjective","definition":"ジョナサン・エドワーズ（1703年 - 1758年）の、またはジョナサン・エドワーズの神学に関連する","english_definition":"Of or relating to Jonathan Edwards (1703-1758) or his theology.","examples":[{"sentence":"Edwardean theology emphasizes the sovereignty of God and the depravity of man.","translation":"エドワーズの神学は、神の主権と人間の堕落を強調する。"},{"sentence":"The Edwardean revival had a profound impact on American religious life.","translation":"エドワーズの信仰復興運動は、アメリカの宗教生活に深い影響を与えた。"}],"collocations":["Edwardean theology","Edwardean revival","Edwardean Calvinism"],"synonyms":["Calvinistic","Puritanical"],"antonyms":[]}],"etymology":{"value":"Derived from the name 'Edward,' referring either to King Edward VII of Great Britain or to the theologian Jonathan Edwards, with the suffix '-ean' indicating association or relation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌedˈwɔːrdiən/","syllables":"Ed-ward-e-an"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'Edwardean' can refer to two distinct contexts: the Edwardean era in British history (early 20th century) or the theological views of Jonathan Edwards (18th century). The context usually clarifies which meaning is intended. When referring to the historical period, it describes aspects of British culture, society, and style during the reign of Edward VII. When referring to Jonathan Edwards, it describes his specific theological doctrines and their influence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The house was built in Edwardian style, making it Edwardean.","correct":"✓ The house was built in Edwardian style, making it Edwardian.","note":"'Edwardian' is the more common and widely accepted term for the historical period. 'Edwardean' is less frequently used in this context. When referring to Jonathan Edwards' theology, 'Edwardean' is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["Edwardian (adjective, noun)","Edwardsian (less common variant)"],"phrases":["Edwardean theology","Edwardean era","Edwardean revival"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Edwardean' is relatively uncommon and specialized. It requires understanding of either British history (the Edwardian era) or American religious history (Jonathan Edwards). It is most likely to be encountered in academic or historical contexts. The distinction between 'Edwardean' and 'Edwardian' can be subtle, with 'Edwardian' being the more common term for the historical period.","priority":"★☆☆"},"example_sentences":[{"sentence":"The museum features a collection of Edwardean clothing and accessories.","translation":"その博物館には、エドワード朝時代の衣服やアクセサリーのコレクションが展示されている。","type":"adjective","meaning_category":"Edward VII's reign"},{"sentence":"Edwardean Calvinism emphasized the importance of personal conversion.","translation":"エドワーズ派のカルヴァン主義は、個人的な回心の重要性を強調した。","type":"adjective","meaning_category":"Jonathan Edwards' theology"}]}