{"word":"centuriation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ローマの)土地測量、区画整理","english_definition":"The division of land into squares or rectangles, especially as practiced by the ancient Romans for agricultural and urban planning.","examples":[{"sentence":"The centuriation of the Roman countryside is still visible in some areas.","translation":"古代ローマの地方における土地測量は、いくつかの地域で今でも見ることができる。"},{"sentence":"Archaeologists study centuriation patterns to understand Roman land use.","translation":"考古学者は、ローマの土地利用を理解するために土地測量のパターンを研究する。"}],"collocations":["Roman centuriation","land centuriation","centuriation pattern"],"synonyms":["land division","land survey","cadastration","gridding"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'centuria,' meaning a group of one hundred, referring to the division of land into units of 100 heredia (a unit of land measurement).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛntʃʊriˈeɪʃən/","syllables":"cen-tu-ri-a-tion"},"inflection":{"noun_plural":"centuriations"},"usage_notes":{"explanation":"Centuriation refers specifically to the Roman practice of dividing land into a grid system for agricultural and urban purposes. It is characterized by the creation of square or rectangular plots, often based on multiples of the actus quadratus (a Roman unit of area). The term is primarily used in historical and archaeological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The centuriation of the building was impressive.","correct":"✓ The layout of the building was impressive.","note":"Centuriation refers to land division, not the layout of a building."}],"priority":"★★★"},"related_words":{"derivatives":["centuria (Roman military unit or land division)","centuriate (verb: to divide into centuries or hundreds)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Centuriation' is a specialized term primarily used in the context of Roman history and archaeology. It refers to the systematic division of land into a grid-like pattern, a practice common in ancient Roman land management. Understanding this term requires familiarity with Roman history and land surveying techniques."},"example_sentences":[{"sentence":"The Roman centuriation system facilitated efficient agricultural production.","translation":"ローマの土地測量システムは、効率的な農業生産を促進した。","type":"noun","meaning_category":"land division"},{"sentence":"Centuriation lines are still visible on aerial photographs of the region.","translation":"土地測量の線は、その地域の航空写真で今でも見ることができる。","type":"noun","meaning_category":"land division"}]}