{"word":"Glauconiidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A family of snakes, commonly known as blind snakes or worm snakes, belonging to the infraorder Scolecophidia. They are small, burrowing snakes found in Africa and Asia.","english_definition":"A family of snakes, commonly known as blind snakes or worm snakes, belonging to the infraorder Scolecophidia. They are small, burrowing snakes found in Africa and Asia.","examples":[{"sentence":"The Glauconiidae family includes several genera of blind snakes.","translation":"メクラヘビ科には、いくつかのメクラヘビ属が含まれています。"}],"collocations":[],"synonyms":["blind snakes","worm snakes"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Glauconia' + '-idae' (a suffix used to form taxonomic family names). The genus name 'Glauconia' likely comes from a personal name or a descriptive term related to the snake's appearance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡlɔːkoʊˈnaɪɪdiː/","syllables":"Glau-co-ni-i-dae"},"inflection":{"noun_plural":"Glauconiids"},"usage_notes":{"explanation":"'Glauconiidae' is a taxonomic term used in zoology to classify a specific family of snakes. It is most commonly encountered in scientific literature or discussions related to herpetology and snake taxonomy.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Glauconia (genus)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in scientific contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Glauconiidae' is a technical term used in the field of zoology, specifically in the classification of snakes. Understanding this term requires familiarity with biological taxonomy and the naming conventions used in zoological classification. It is not commonly used outside of scientific or specialist contexts."},"example_sentences":[{"sentence":"Researchers are studying the evolutionary relationships within the Glauconiidae family.","translation":"研究者たちは、メクラヘビ科内の進化関係を研究しています。","type":"noun","meaning_category":"snake family"},{"sentence":"The distribution of Glauconiidae snakes is primarily limited to tropical regions of Africa and Asia.","translation":"メクラヘビ科の分布は、主にアフリカとアジアの熱帯地域に限定されています。","type":"noun","meaning_category":"snake family"}]}