{"word":"grunges","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"グランジ (音楽のジャンル、またはそのスタイル)","english_definition":"plural form of grunge. A subgenre of alternative rock that emerged during the mid-1980s in the Pacific Northwest region of the United States, particularly in Seattle, Washington.","examples":[{"sentence":"Many bands played grunges in the 90s.","translation":"多くのバンドが90年代にグランジを演奏した。"},{"sentence":"He likes listening to grunges.","translation":"彼はグランジを聴くのが好きだ。"}],"collocations":["grunge music","grunge band","grunge fashion"],"synonyms":["alternative rock","Seattle sound"],"antonyms":[]}],"etymology":{"value":"The origin of the word \"grunge\" is uncertain, but it is thought to have originated as slang for \"dirt\" or \"grime.\" It was first used in the context of music to describe the dirty, distorted sound of bands like Nirvana and Soundgarden.","priority":"★★☆"},"pronunciation":{"ipa":"/ɡrʌndʒɪz/","syllables":"grung-es"},"inflection":{"noun_plural":"grunges"},"usage_notes":{"explanation":"\"Grunges\" is the plural form of \"grunge.\" Grunge refers to a subgenre of alternative rock music characterized by its distorted guitar sounds, angsty lyrics, and a generally unpolished aesthetic. It also refers to the fashion style associated with the music, which typically includes ripped jeans, flannel shirts, and combat boots.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["grunge (noun, adjective)","grungy (adjective)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"\"Grunges\" is the plural form of \"grunge,\" which refers to a specific subgenre of alternative rock music popular in the 1990s, particularly in Seattle. It's also associated with a specific fashion style. Understanding the term requires knowledge of music genres and cultural trends of that era."},"example_sentences":[{"sentence":"The concert featured several grunges bands from the Pacific Northwest.","translation":"そのコンサートでは、太平洋岸北西部のいくつかのグランジバンドが演奏された。","type":"noun","meaning_category":"音楽ジャンル"},{"sentence":"She collected old grunges records.","translation":"彼女は古いグランジのレコードを集めた。","type":"noun","meaning_category":"音楽ジャンル"}]}