{"word":"ecotype","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"生態型：特定の環境条件に適応した、同一種内の遺伝的に異なる個体群","english_definition":"A genetically distinct population within a species that is adapted to specific local environmental conditions.","examples":[{"sentence":"The coastal ecotype of this plant is more salt-tolerant than the inland ecotype.","translation":"この植物の沿岸生態型は、内陸生態型よりも塩分耐性が高い。"},{"sentence":"Different ecotypes of the same species can exhibit significant variations in morphology and physiology.","translation":"同じ種の異なる生態型は、形態や生理において著しい変異を示すことがある。"},{"sentence":"The study examined the genetic differences between several ecotypes of the grass species.","translation":"その研究では、そのイネ科植物のいくつかの生態型間の遺伝的差異を調べた。"}],"collocations":["coastal ecotype (沿岸生態型)","inland ecotype (内陸生態型)","alpine ecotype (高山生態型)","local ecotype (地域生態型)","ecotype variation (生態型変異)","ecotype adaptation (生態型適応)","genetic ecotype (遺伝的生態型)"],"synonyms":["local race","physiological race","biotype","deme"],"antonyms":["(typical) species","generalist species"],"notes":"Ecotypes can eventually diverge enough to become distinct species. The term is often used in botany and ecology.","field":"ecology, botany, genetics"}],"etymology":{"value":"Derived from 'eco-' (referring to ecology or environment) and 'type' (referring to a distinct form or variety).","priority":"★★★"},"pronunciation":{"ipa":"ˈiːkoʊtaɪp","syllables":"e-co-type"},"inflection":{"noun_plural":"ecotypes"},"usage_notes":{"explanation":"An ecotype is a population adapted to a specific environment. These adaptations are heritable, meaning they are passed down through generations. Ecotypes are often studied to understand the mechanisms of adaptation and the role of natural selection in shaping biodiversity. The concept is important in conservation biology, as preserving ecotypes helps maintain genetic diversity within species.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ecotype was the same as the species.","correct":"✓ The ecotype is a subgroup within the species.","note":"An ecotype is a population within a species, not the species itself. It's a more specific classification. "},{"incorrect":"✗ Ecotypes are only caused by environmental factors, not genetics.","correct":"✓ Ecotypes are a result of both environmental factors and genetics.","note":"Ecotypes are genetically distinct populations that have adapted to their environment. Both genetics and environment play a role."}],"priority":"★★☆"},"related_words":{"derivatives":["ecotypic (adjective)","ecocline (noun: a gradual change in ecotypes over an environmental gradient)"],"related_terms":["adaptation","natural selection","speciation","phenotype","genotype","population genetics","environmental gradient"],"priority":"★★★"},"level_frequency":{"frequency_corpus":"Relatively low frequency in general language, but common in ecology and botany literature.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Ecotype' is a specialized term used in ecology and botany to describe a population within a species that has evolved specific adaptations to its local environment. Understanding this term requires knowledge of basic ecological and genetic concepts such as adaptation, natural selection, and genetic variation. It is not typically encountered in everyday language but is important for understanding ecological processes and biodiversity."},"example_sentences":[{"sentence":"The serpentine soil ecotype of *Eschscholzia californica* (California poppy) exhibits tolerance to high concentrations of heavy metals.","translation":"*Eschscholzia californica*（カリフォルニアポピー）の蛇紋岩土壌生態型は、高濃度の重金属に対する耐性を示す。","type":"example","meaning_category":"adaptation to soil"},{"sentence":"Researchers are studying the genetic basis of cold tolerance in alpine ecotypes of *Arabidopsis thaliana*.","translation":"研究者たちは、*Arabidopsis thaliana*（シロイヌナズナ）の高山生態型における耐寒性の遺伝的基盤を研究している。","type":"example","meaning_category":"adaptation to climate"},{"sentence":"Conservation efforts often focus on preserving distinct ecotypes to maintain genetic diversity within a species.","translation":"保全活動は、種内の遺伝的多様性を維持するために、明確な生態型を保護することに焦点を当てることが多い。","type":"example","meaning_category":"conservation biology"}]}