{"word":"non-vehicular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"車両ではない、車両を使用しない","english_definition":"Not relating to or involving vehicles.","examples":[{"sentence":"The city promotes non-vehicular transportation such as cycling and walking.","translation":"その都市は、サイクリングやウォーキングといった非車両交通を推進している。"},{"sentence":"This area is designated for non-vehicular traffic only.","translation":"このエリアは、車両以外の通行のみに指定されている。"},{"sentence":"They are developing non-vehicular routes for pedestrians and cyclists.","translation":"彼らは歩行者や自転車利用者のための非車両ルートを開発している。"}],"collocations":["non-vehicular traffic","non-vehicular transportation","non-vehicular area","non-vehicular route"],"synonyms":["pedestrian","bicycle-related","car-free"],"antonyms":["vehicular"],"related_words":["vehicle","pedestrian","bicycle","transportation"],"usage_notes":{"explanation":"'Non-vehicular' is used to describe things that are not related to or do not involve vehicles, especially motor vehicles. It often refers to activities, areas, or routes designed for pedestrians, cyclists, or other forms of transportation that do not use motorized vehicles.","priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'non-vehicular' is a formal term used to describe something that does not involve vehicles. It's often used in urban planning, transportation, and environmental contexts to distinguish between areas or modes of transport that are car-free or do not rely on motorized vehicles. Understanding this term is useful for comprehending discussions about sustainable transportation and pedestrian-friendly infrastructure.","priority":"★★☆"},"example_sentences":[{"sentence":"The park offers a network of non-vehicular paths for walking and jogging.","translation":"その公園は、ウォーキングやジョギングのための非車両パスのネットワークを提供している。","type":"adjective","meaning_category":"車両ではない"},{"sentence":"The city is investing in non-vehicular infrastructure to reduce carbon emissions.","translation":"その都市は、炭素排出量を削減するために非車両インフラに投資している。","type":"adjective","meaning_category":"車両を使用しない"}]}],"etymology":{"value":"The word 'non-vehicular' is formed by adding the prefix 'non-' (meaning 'not') to the word 'vehicular' (relating to vehicles).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnviˈhɪkjʊlər/","syllables":"non-ve-hic-u-lar"},"inflection":{},"common_mistakes":{}}