{"word":"Anthypophora","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A figure of speech in which one makes an objection and then answers it oneself.","english_definition":"A figure of speech in which a person introduces an objection to his own statement and then answers it.","examples":[{"sentence":"The lawyer used anthypophora in his closing argument, raising potential doubts about his client's alibi before refuting them.","translation":"弁護士は最終弁論でアンティポフォラを使用し、クライアントのアリバイに対する潜在的な疑念を提起してから、それらを反論した。"}],"collocations":["use anthypophora","employ anthypophora","anthypophora in rhetoric"],"synonyms":["hypophora","subjectio","ratiocinatio"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ἀνθυποφορά (anthupophorá), from ἀντί (antí, “against”) + ὑπό (hupó, “under”) + φορός (phorós, “bearing”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænθɪˈpɒfərə/","syllables":"An-thy-po-pho-ra"},"inflection":{"noun_plural":"anthypophoras"},"usage_notes":{"explanation":"Anthypophora is a rhetorical device often used to anticipate and address potential counterarguments, making an argument appear more thorough and persuasive. It is similar to hypophora, but anthypophora specifically involves the speaker raising and answering their own objections.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used hypophora, which is when you ask a question and answer it.","correct":"✓ He used anthypophora, which is when you raise and answer your own objections.","note":"Hypophora is asking a question and answering it. Anthypophora is raising an objection to your own statement and answering it."}],"priority":"★★☆"},"related_words":{"derivatives":["anthypophoric (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Anthypophora is a sophisticated rhetorical device used in formal speaking and writing. It involves presenting an objection to one's own argument and then refuting it. This technique is used to anticipate and address potential criticisms, making the argument more robust. Understanding and using anthypophora requires a high level of rhetorical skill and awareness."},"example_sentences":[{"sentence":"One might ask, 'Is this plan too risky?' The answer is no, because we have carefully considered all potential outcomes.","translation":"「この計画はリスクが高すぎるのではないか」と問う人がいるかもしれない。答えはノーだ。なぜなら、私たちは起こりうるすべての結果を慎重に検討してきたからだ。","type":"example","meaning_category":"rhetorical device"}]}