{"word":"blind-your-eyes","priority":"N/A","meanings":[{"part_of_speech":"idiom","definition":"(idiomatic) to deliberately ignore something, especially something bad or wrong, that you know is happening","english_definition":"To intentionally disregard or overlook something, particularly something negative or unethical, despite being aware of its occurrence.","examples":[{"sentence":"The company chose to blind-your-eyes to the environmental damage caused by their factory.","translation":"その会社は、自社の工場が引き起こす環境破壊を意図的に無視することを選んだ。"},{"sentence":"He couldn't blind-your-eyes to the suffering of the refugees any longer.","translation":"彼はもはや難民の苦しみを無視することはできなかった。"},{"sentence":"The government has been accused of blind-your-eyes to corruption within its ranks.","translation":"政府は、その組織内の腐敗を無視していると非難されている。"}],"collocations":["turn a blind eye","choose to blind-your-eyes","can't blind-your-eyes","blind-your-eyes to corruption","blind-your-eyes to injustice"],"synonyms":["turn a blind eye","disregard","overlook","ignore","condone","wink at"],"antonyms":["acknowledge","confront","address","recognize","investigate"]}],"etymology":{"value":"The idiom 'blind-your-eyes' is a variation of the more common idiom 'turn a blind eye.' It suggests a deliberate act of closing one's eyes to avoid seeing something undesirable. The etymology traces back to the idea of physically shutting one's eyes to avoid witnessing something unpleasant or morally wrong.","priority":"N/A"},"pronunciation":{"ipa":"/ˌblaɪnd jʊər ˈaɪz/","syllables":"blind-your-eyes"},"inflection":{},"usage_notes":{"explanation":"The idiom 'blind-your-eyes' is used to describe the act of intentionally ignoring something, often something morally questionable or outright wrong. It implies a conscious decision to avoid acknowledging or addressing a problem. The phrase is often used in contexts where someone is aware of wrongdoing but chooses to do nothing about it, either out of self-interest, fear, or a desire to avoid conflict. It is often used in a critical or accusatory manner.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He blind-your-eyes the problem.","correct":"✓ He turned a blind eye to the problem. / ✓ He chose to blind-your-eyes to the problem.","note":"The idiom is 'turn a blind eye' or 'blind-your-eyes to something.' It requires a verb like 'turn,' 'choose,' or 'decide' to be grammatically correct."},{"incorrect":"✗ She blind-your-eyes.","correct":"✓ She turned a blind eye. / ✓ She chose to blind-your-eyes to the situation.","note":"The idiom usually needs an object or a prepositional phrase to specify what is being ignored."}],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_idioms":["turn a blind eye","look the other way"],"priority":"N/A"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively infrequent compared to 'turn a blind eye'.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The idiom 'blind-your-eyes' is a more emphatic and less common variant of 'turn a blind eye.' It means to deliberately ignore something, usually something bad or wrong, that you know is happening. It is used to express disapproval of someone's choice to ignore a problem or wrongdoing. The phrase suggests a conscious decision to avoid seeing or acknowledging something unpleasant or unethical. It is often used in formal or critical contexts."},"example_sentences":[{"sentence":"The authorities seemed to blind-your-eyes to the illegal activities taking place in the neighborhood.","translation":"当局はその近隣で行われている違法行為を無視しているようだった。","type":"idiom","meaning_category":"deliberately ignoring something bad"},{"sentence":"It's unethical to blind-your-eyes to the suffering of others.","translation":"他者の苦しみを無視するのは非倫理的だ。","type":"idiom","meaning_category":"deliberately ignoring suffering"},{"sentence":"The company can't blind-your-eyes to the safety concerns raised by its employees.","translation":"会社は従業員から提起された安全上の懸念を無視することはできない。","type":"idiom","meaning_category":"deliberately ignoring safety concerns"}]}