{"word":"tanproof","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Resistant to tanning or the effects of tanning.","english_definition":"Resistant to tanning or the effects of tanning, often referring to materials or sunscreens.","examples":[{"sentence":"This fabric is tanproof, so it won't fade in the sun.","translation":"この生地は日焼けに強いので、日光で色あせません。"},{"sentence":"The sunscreen claims to be tanproof, but I still got a little color.","translation":"その日焼け止めは日焼けを防ぐと謳っているが、それでも少し日焼けした。"}],"collocations":["tanproof fabric","tanproof sunscreen","tanproof material"],"synonyms":["sun-resistant","fade-resistant","UV-resistant"],"antonyms":["tan-promoting","sun-sensitive"]}],"etymology":{"value":"Likely a compound word formed from 'tan' (referring to the darkening of skin due to sun exposure) and 'proof' (meaning resistant or impervious to).","priority":"N/A"},"pronunciation":{"ipa":"/ˈtænˌpruːf/","syllables":"tan-proof"},"inflection":{"adjective_forms":{"comparative":"more tanproof","superlative":"most tanproof"}},"usage_notes":{"explanation":"'Tanproof' is a descriptive term used to indicate a material's or product's ability to resist tanning or the effects of sun exposure. It is commonly used in the context of fabrics, sunscreens, and other items designed to protect against UV radiation.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ This shirt is completely tanproof, I never get any color.","correct":"✓ This shirt is highly tanproof, but some UV rays may still penetrate.","note":"While 'tanproof' suggests a high level of resistance, it's important to acknowledge that no material or product can guarantee complete protection from sun exposure."}],"priority":"N/A"},"related_words":{"derivatives":["tan","proof","sunproof","waterproof"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - not a commonly used word.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Tanproof' is a compound adjective that describes something resistant to tanning or the effects of sun exposure. It is often used in marketing materials for fabrics or sunscreens. The word is relatively straightforward, combining the familiar terms 'tan' and 'proof'. Understanding its meaning requires knowledge of the individual components and their combined effect."},"example_sentences":[{"sentence":"The new line of swimwear is made from a tanproof material.","translation":"新しい水着のラインは、日焼けに強い素材で作られています。","type":"adjective","meaning_category":"sun protection"},{"sentence":"She applied a tanproof sunscreen before going to the beach.","translation":"彼女はビーチに行く前に、日焼けを防ぐ日焼け止めを塗った。","type":"adjective","meaning_category":"sun protection"}]}