{"word":"barbarisation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"野蛮化、粗野化、文化の退廃","english_definition":"The act or process of making something or someone barbarous; a decline from a state of civilization.","examples":[{"sentence":"The barbarisation of society is a serious concern.","translation":"社会の野蛮化は深刻な懸念事項です。"},{"sentence":"Some historians argue that the late Roman Empire suffered from barbarisation.","translation":"一部の歴史家は、後期ローマ帝国が野蛮化に苦しんだと主張しています。"},{"sentence":"The constant exposure to violence in media can lead to the barbarisation of young minds.","translation":"メディアにおける暴力への絶え間ない露出は、若い精神の野蛮化につながる可能性があります。"}],"collocations":["cultural barbarisation (文化の野蛮化)","social barbarisation (社会の野蛮化)","moral barbarisation (道徳の野蛮化)","process of barbarisation (野蛮化の過程)"],"synonyms":["degeneration","decline","degradation","brutalization","savagery","primitivization"],"antonyms":["civilization","cultivation","refinement","humanization"]}],"etymology":{"value":"Derived from 'barbarize' (verb) + '-ation' (suffix indicating a process or result). 'Barbarize' comes from 'barbarous' (adjective), which ultimately comes from the Greek 'barbaros' meaning 'foreign, uncivilized'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbɑːrbəraɪˈzeɪʃən/","syllables":"bar-ba-ri-sa-tion"},"inflection":{"noun_plural":"barbarisations"},"usage_notes":{"explanation":"'Barbarisation' refers to the process by which something becomes more crude, savage, or uncivilized. It often implies a loss of cultural or moral values. The term is often used in historical or sociological contexts to describe the decline of societies or cultures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The barbarisation is happening because of the weather.","correct":"✓ The barbarisation is happening because of the lack of education and social programs.","note":"Barbarisation is a complex social process, not usually caused by simple factors like weather. It is more often linked to social, economic, and political factors."},{"incorrect":"✗ He supported barbarisation to make the country stronger.","correct":"✓ He supported strict policies that some critics described as leading to barbarisation.","note":"Supporting 'barbarisation' directly is unlikely. The term usually carries negative connotations, so it's more common to see it used critically to describe the effects of certain policies."}],"priority":"★☆☆"},"related_words":{"derivatives":["barbarize (verb)","barbarous (adjective)","barbarian (noun)","barbarity (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Barbarisation' is a relatively uncommon and abstract noun that describes the process of becoming more crude, savage, or uncivilized. It is often used in academic or historical contexts to discuss the decline of societies or cultures. Understanding this word requires a good grasp of abstract concepts and a familiarity with historical and sociological discourse."},"example_sentences":[{"sentence":"The economic crisis led to the barbarisation of political discourse.","translation":"経済危機は政治的議論の野蛮化につながった。","type":"general","meaning_category":"decline of civilization"},{"sentence":"Critics accused the government of promoting the barbarisation of education.","translation":"批評家たちは政府が教育の野蛮化を推進していると非難した。","type":"general","meaning_category":"decline of civilization"},{"sentence":"The novel explores the themes of war and the barbarisation of human nature.","translation":"その小説は、戦争と人間の本性の野蛮化というテーマを探求している。","type":"literary","meaning_category":"decline of civilization"}]}