{"word":"epilepsy-inducing","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"てんかん発作を誘発するような、光過敏性発作を引き起こすような","english_definition":"Capable of triggering epileptic seizures, especially in individuals with photosensitive epilepsy. Often refers to rapidly flashing or strobing lights or patterns.","examples":[{"sentence":"The video game contained epilepsy-inducing flashing lights.","translation":"そのビデオゲームには、てんかん発作を誘発するような点滅する光が含まれていた。"},{"sentence":"The concert's light show was described as epilepsy-inducing by some attendees.","translation":"そのコンサートの照明ショーは、一部の参加者からてんかん発作を誘発するようだと評された。"},{"sentence":"Please be aware that this content may be epilepsy-inducing for some viewers.","translation":"このコンテンツは、一部の視聴者にとっててんかん発作を誘発する可能性があることにご注意ください。"}],"collocations":["epilepsy-inducing lights","epilepsy-inducing patterns","epilepsy-inducing content"],"synonyms":["seizure-inducing","photosensitive","strobing","flashing"],"antonyms":["calming","soothing","stable","non-flickering"]}],"etymology":{"value":"The term is formed by combining 'epilepsy' (a neurological disorder characterized by seizures) with 'inducing' (causing or bringing about). Therefore, 'epilepsy-inducing' literally means 'causing or bringing about epilepsy or epileptic seizures'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛpɪˈlɛpsi ɪnˈdjuːsɪŋ/","syllables":"ep-i-lep-sy in-du-cing"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb or noun."},"usage_notes":{"explanation":"'Epilepsy-inducing' is used to describe visual stimuli, such as rapidly flashing lights or patterns, that can trigger seizures in individuals with photosensitive epilepsy. It is often used in warnings or disclaimers for videos, games, and other media. The term is relatively recent, reflecting increased awareness of photosensitive epilepsy and the need to protect susceptible individuals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was epilepsy.","correct":"✓ The movie was epilepsy-inducing.","note":"'Epilepsy' is a noun (the condition itself), while 'epilepsy-inducing' is an adjective describing something that causes seizures."},{"incorrect":"✗ The lights were induced epilepsy.","correct":"✓ The lights were epilepsy-inducing.","note":"The correct form is 'epilepsy-inducing' as an adjective modifying the noun 'lights'."}],"priority":"★★☆"},"related_words":{"derivatives":["epilepsy","induce","photosensitive epilepsy","seizure"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Relatively modern term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'epilepsy-inducing' is a technical adjective used to describe content or stimuli that can trigger seizures in people with photosensitive epilepsy. It is commonly used in warnings for video games, movies, and other visual media that contain rapidly flashing lights or patterns. Understanding this term requires knowledge of epilepsy and the concept of induction (causing something to happen)."},"example_sentences":[{"sentence":"The website includes a warning about potentially epilepsy-inducing content.","translation":"そのウェブサイトには、てんかん発作を誘発する可能性のあるコンテンツに関する警告が含まれています。","type":"general","meaning_category":"general"},{"sentence":"The researchers studied the effects of epilepsy-inducing visual stimuli on brain activity.","translation":"研究者たちは、てんかん発作を誘発する視覚刺激が脳活動に与える影響を研究しました。","type":"scientific","meaning_category":"scientific"},{"sentence":"Many older arcade games have epilepsy-inducing flashing effects.","translation":"多くの古いアーケードゲームには、てんかん発作を誘発する点滅効果があります。","type":"cultural","meaning_category":"cultural"}]}