{"word":"sensationalized","priority":"★★☆","meanings":[{"part_of_speech":"verb (past participle)","definition":"(ニュース・記事などを)扇情的に報道する、誇張して伝える、大げさに表現する","english_definition":"present information about (something) in a way that provokes public interest and excitement, at the expense of accuracy.","examples":[{"sentence":"The media sensationalized the story to attract more viewers.","translation":"メディアは視聴者数を増やすために、その話を扇情的に報道した。"},{"sentence":"The article sensationalized the dangers of the new drug.","translation":"その記事は新薬の危険性を誇張して伝えた。"},{"sentence":"The incident was sensationalized by the tabloids.","translation":"その事件はタブロイド紙によって扇情的に報道された。"}],"collocations":["sensationalize a story (話を扇情的に報道する)","sensationalize the news (ニュースを扇情的に報道する)","sensationalize an event (出来事を扇情的に報道する)"],"synonyms":["exaggerate","overstate","dramatize","embellish","inflate","hype"],"antonyms":["understate","downplay","minimize","report factually","present accurately"]},{"part_of_speech":"adjective","definition":"扇情的な、誇張された、大げさな","english_definition":"presented in a way that is intended to provoke public interest and excitement, often at the expense of accuracy.","examples":[{"sentence":"The sensationalized news reports caused widespread panic.","translation":"扇情的なニュース報道は広範囲にわたるパニックを引き起こした。"},{"sentence":"The film was criticized for its sensationalized violence.","translation":"その映画は扇情的な暴力描写で批判された。"},{"sentence":"He accused the media of providing a sensationalized account of the events.","translation":"彼はメディアが事件を扇情的に報道していると非難した。"}],"collocations":["sensationalized news (扇情的なニュース)","sensationalized reporting (扇情的な報道)","sensationalized account (扇情的な記述)","sensationalized version (扇情的なバージョン)"],"synonyms":["exaggerated","overstated","dramatic","embellished","inflated","hyped"],"antonyms":["understated","downplayed","factual","accurate"]}],"etymology":{"value":"The word \"sensationalize\" is derived from \"sensational,\" which originally meant \"causing intense excitement, interest, or shock.\" The suffix \"-ize\" means \"to make or become.\" Therefore, \"sensationalize\" means to make something sensational, often by exaggerating or distorting the facts.","priority":"★★☆"},"pronunciation":{"ipa":"/sɛnˈseɪʃənəˌlaɪzd/","syllables":"sen-sa-tion-a-lized"},"inflection":{"verb_forms":{"present_simple":["sensationalize","sensationalizes"],"past_simple":"sensationalized","past_participle":"sensationalized","present_participle":"sensationalizing"},"adjective_forms":{"comparative":null,"superlative":null}},"usage_notes":{"explanation":"The word \"sensationalized\" is often used in a critical context to describe media coverage that is seen as biased, exaggerated, or designed to provoke an emotional response rather than inform the public accurately. It implies a lack of objectivity and a focus on creating a dramatic or exciting narrative, even if it means distorting the truth. The term can be applied to various forms of media, including news articles, television reports, and social media posts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The story was sensationalized, so it was very truth.","correct":"✓ The story was sensationalized, so it was not very truthful.","note":"Sensationalizing a story implies a lack of truthfulness or accuracy. Therefore, it is contradictory to say that a sensationalized story is \"very truth.\" Instead, it would be more accurate to say that it is \"not very truthful\" or \"inaccurate.\""},{"incorrect":"✗ The media sensationalized, and everyone was scared.","correct":"✓ The media sensationalized the story, and everyone was scared.","note":"When using \"sensationalize\" as a verb, it typically requires a direct object (what is being sensationalized). In this case, \"the story\" should be included to clarify what the media sensationalized."},{"incorrect":"✗ The sensationalized news made people sensation.","correct":"✓ The sensationalized news made people feel sensational. / ✓ The sensationalized news caused a sensation.","note":"\"Sensation\" is a noun, not a verb or adjective in this context. To describe how people felt, you can use the verb \"feel\" followed by the adjective \"sensational\" or say that the news \"caused a sensation.\""}],"priority":"★★☆"},"related_words":{"derivatives":["sensational (adjective)","sensationalism (noun)","sensationalist (noun/adjective)","sensationalizing (verb - present participle)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in discussions about media bias.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"sensationalized\" describes the act of presenting information in a way that is intended to create excitement or shock, often by exaggerating or distorting the facts. It's usually used to criticize media or other sources of information for prioritizing entertainment or emotional impact over accuracy. Understanding this word requires a good grasp of nuanced language and the ability to recognize bias in reporting. It is more commonly used in formal writing and discussions about media ethics.","priority":"★★☆"},"example_sentences":[{"sentence":"The tabloid newspaper **sensationalized** the celebrity's personal life to sell more copies.","translation":"そのタブロイド紙は、より多くの部数を売るために、有名人の私生活を扇情的に報道した。","type":"verb (past participle)","meaning_category":"扇情的に報道する"},{"sentence":"The documentary was criticized for its **sensationalized** portrayal of the events.","translation":"そのドキュメンタリーは、出来事を扇情的に描いたとして批判された。","type":"adjective","meaning_category":"扇情的な"},{"sentence":"The media often **sensationalizes** crime stories to attract a larger audience.","translation":"メディアはより多くの視聴者を引きつけるために、犯罪話を扇情的に報道することがよくある。","type":"verb (present simple)","meaning_category":"扇情的に報道する"},{"sentence":"The **sensationalized** headlines created unnecessary fear among the public.","translation":"扇情的な見出しは、一般の人々に不必要な恐怖を引き起こした。","type":"adjective","meaning_category":"扇情的な"},{"sentence":"The politician accused his opponents of **sensationalizing** the issue for political gain.","translation":"その政治家は、対立候補が政治的利益のために問題を扇情的に報道していると非難した。","type":"verb (present participle)","meaning_category":"扇情的に報道する"}]}