{"word":"FTC","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"連邦取引委員会 (Federal Trade Commission) - 米国の消費者保護と公正な競争を促進する政府機関","english_definition":"Federal Trade Commission: an independent agency of the US government whose principal mission is the promotion of consumer protection and the elimination and prevention of anticompetitive business practices, such as monopolies.","examples":[{"sentence":"The FTC is investigating the company for deceptive advertising practices.","translation":"連邦取引委員会は、その企業の欺瞞的な広告慣行について調査している。"},{"sentence":"The FTC filed a lawsuit against the company for violating antitrust laws.","translation":"連邦取引委員会は、独占禁止法違反でその企業を提訴した。"},{"sentence":"The FTC's mission is to protect consumers and promote competition.","translation":"連邦取引委員会の使命は、消費者を保護し、競争を促進することである。"}],"collocations":["FTC investigation (FTC調査)","FTC lawsuit (FTC訴訟)","FTC guidelines (FTCガイドライン)","FTC regulations (FTC規制)","FTC complaint (FTCへの苦情)","FTC settlement (FTCとの和解)"],"synonyms":["Federal Trade Commission"],"antonyms":[]}],"etymology":{"value":"An acronym for Federal Trade Commission.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛfˌtiːˈsiː/","syllables":"EF-TEE-SEE"},"inflection":{"notes":"It is an initialism, so it does not inflect."},"usage_notes":{"explanation":"The FTC is a key regulatory body in the United States. It's important to understand its role in consumer protection and antitrust enforcement. When you see 'FTC' in news articles or business contexts, it's almost always referring to the Federal Trade Commission.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The FCT investigated the company.","correct":"✓ The FTC investigated the company.","note":"The correct acronym is FTC (Federal Trade Commission), not FCT."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_organizations":["Department of Justice (DOJ)","Consumer Financial Protection Bureau (CFPB)"],"related_terms":["antitrust","consumer protection","deceptive advertising","monopoly"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Moderately frequent in business and legal contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"Understanding 'FTC' is crucial for comprehending discussions about business regulation, consumer rights, and antitrust issues in the United States. While the acronym itself is simple, the concepts it represents are often complex and require some background knowledge of economics and law. The FTC plays a significant role in shaping the business landscape and protecting consumers from unfair practices."},"example_sentences":[{"sentence":"The FTC has the authority to issue cease and desist orders.","translation":"連邦取引委員会は、差し止め命令を発行する権限を持っている。","type":"noun","meaning_category":"連邦取引委員会"},{"sentence":"The company agreed to a settlement with the FTC to resolve the allegations.","translation":"その企業は、申し立てを解決するために連邦取引委員会との和解に合意した。","type":"noun","meaning_category":"連邦取引委員会"},{"sentence":"The FTC is cracking down on online scams.","translation":"連邦取引委員会は、オンライン詐欺の取り締まりを強化している。","type":"noun","meaning_category":"連邦取引委員会"}]}