{"word":"truth-guarding","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(論理学で)真理保存的な、真理を保証する","english_definition":"(In logic) Preserving truth; said of an inference or argument that guarantees the truth of the conclusion if the premises are true.","examples":[{"sentence":"A valid deductive argument is truth-guarding: if its premises are true, its conclusion must also be true.","translation":"妥当な演繹的議論は真理保存的である。前提が真であれば、結論も必ず真である。"},{"sentence":"The rule of modus ponens is truth-guarding.","translation":"肯定式は真理保存的な規則である。"}],"collocations":["truth-guarding argument","truth-guarding inference","truth-guarding logic"],"synonyms":["truth-preserving","valid","sound"],"antonyms":["truth-defeating","invalid","unsound"]}],"etymology":{"value":"'Truth' + 'guarding'.  Refers to the property of a logical argument or inference that 'guards' or preserves the truth from the premises to the conclusion.","priority":"★★★"},"pronunciation":{"ipa":"ˈtruːθˌɡɑːrdɪŋ","syllables":"truth-guard-ing"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'truth-guarding' is primarily used in the field of logic and philosophy to describe arguments or inferences that are deductively valid. A truth-guarding argument ensures that if the premises are true, the conclusion must also be true. This is a key concept in evaluating the soundness and validity of logical reasoning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The statement is truth-guarding.","correct":"✓ The argument is truth-guarding.","note":"'Truth-guarding' describes an argument or inference, not a statement itself. A statement can be true or false, but it doesn't 'guard' truth."}],"priority":"★★☆"},"related_words":{"derivatives":["truth","guard","validity","soundness","deduction","inference"],"phrases":["modus ponens","deductive argument","logical consequence"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized term used primarily in logic and philosophy.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Truth-guarding' is a term used in logic to describe an argument or inference. If an argument is 'truth-guarding', it means that if the starting statements (premises) are true, then the ending statement (conclusion) must also be true. It's like a guarantee that truth is preserved throughout the argument. This term is mainly used by people who study logic and philosophy.","priority":"★★★"},"example_sentences":[{"sentence":"A truth-guarding argument is essential for establishing reliable knowledge.","translation":"信頼できる知識を確立するためには、真理保存的な議論が不可欠である。","type":"general","meaning_category":"general usage"},{"sentence":"The professor explained the importance of truth-guarding inferences in mathematical proofs.","translation":"教授は、数学的証明における真理保存的な推論の重要性を説明した。","type":"academic","meaning_category":"academic context"}]}