{"word":"Zerubbabel","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ゼルバベル：旧約聖書に登場する人物。バビロン捕囚から帰還したユダヤ人の指導者で、第二神殿の再建を主導した。","english_definition":"A figure in the Old Testament, the leader of the Jewish people who returned from the Babylonian exile and oversaw the rebuilding of the Second Temple in Jerusalem.","examples":[{"sentence":"Zerubbabel was a key figure in the restoration of Jerusalem after the Babylonian exile.","translation":"ゼルバベルはバビロン捕囚後のエルサレム再建における重要な人物でした。"},{"sentence":"The Book of Ezra describes Zerubbabel's role in rebuilding the Temple.","translation":"エズラ記はゼルバベルの神殿再建における役割を記述しています。"}],"collocations":["Zerubbabel's Temple (ゼルバベルの神殿)","the lineage of Zerubbabel (ゼルバベルの血統)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"ヘブライ語の זְרֻבָּבֶל (Zərubbāḇel) に由来し、「バビロンで蒔かれた種」または「バビロンの子孫」を意味する。これは、彼がバビロンで生まれたことを示唆している。","priority":"★★☆"},"pronunciation":{"ipa":"/zəˈrʌbəbəl/","syllables":"ze-rub-ba-bel"},"inflection":{},"usage_notes":{"explanation":"ゼルバベルは、ユダヤ教とキリスト教の聖書において重要な人物であり、バビロン捕囚からの帰還と第二神殿の再建に関連付けられています。彼の名前は、バビロンでの彼のルーツを反映しています。","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_figures":["Joshua (ヨシュア): ゼルバベルと共に神殿再建を主導した大祭司。","Ezra (エズラ): バビロンから帰還した祭司で律法学者。ゼルバベルの時代より後。","Nehemiah (ネヘミヤ): エルサレムの城壁再建を主導した総督。ゼルバベルの時代より後。"],"priority":"★★☆"},"level_frequency":{"CEFR":"","frequency_google_ngram":"低頻度 (Low frequency) - 聖書や歴史に関する文脈でのみ見られる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"ゼルバベルは、旧約聖書に登場する人物で、バビロン捕囚から帰還したユダヤ人の指導者です。彼は第二神殿の再建を主導したことで知られています。聖書や歴史的な文脈でのみ言及される、専門的な語彙です。彼の役割や歴史的背景を理解するには、聖書や関連する歴史書を読む必要があります。"},"example_sentences":[{"sentence":"Zerubbabel, along with Joshua the High Priest, led the effort to rebuild the Temple in Jerusalem.","translation":"ゼルバベルは大祭司ヨシュアと共に、エルサレムの神殿再建の取り組みを主導しました。","type":"historical context","meaning_category":"歴史的背景"},{"sentence":"The genealogy of Jesus in the Gospel of Matthew traces back to Zerubbabel.","translation":"マタイによる福音書におけるイエスの系図は、ゼルバベルまで遡ります。","type":"religious significance","meaning_category":"宗教的意義"}]}