{"word":"US-based","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"米国に拠点を置く、米国を拠点とする","english_definition":"having a base or headquarters in the United States.","examples":[{"sentence":"We are a US-based company with offices worldwide.","translation":"当社は米国を拠点とする企業で、世界中にオフィスがあります。"},{"sentence":"The study was conducted by a US-based research institute.","translation":"その調査は、米国に拠点を置く研究機関によって実施されました。"},{"sentence":"Many US-based tech companies are expanding their operations overseas.","translation":"多くの米国を拠点とするテクノロジー企業が、海外での事業を拡大しています。"}],"collocations":["US-based company (米国を拠点とする会社)","US-based organization (米国を拠点とする組織)","US-based research (米国を拠点とする研究)","US-based operations (米国を拠点とする事業)","US-based headquarters (米国を拠点とする本社)"],"synonyms":["American-based","United States-based"],"antonyms":["foreign-based","overseas-based","international-based"]}],"etymology":{"value":"The term is a combination of \"US\" (an abbreviation for United States) and \"based\" (meaning having a base or headquarters).","priority":"★★★"},"pronunciation":{"ipa":"/ˌjuːˌɛs ˈbeɪst/","syllables":"US-based"},"inflection":{"notes":"This is an adjective and does not inflect (change form) for number or gender."},"usage_notes":{"explanation":"\"US-based\" is used to specify that an entity (company, organization, research, etc.) has its primary operations, headquarters, or foundation within the United States. It is commonly used to distinguish entities from those based in other countries.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is based US.","correct":"✓ The company is US-based. / ✓ The company is based in the US.","note":"The correct usage is \"US-based\" as a compound adjective before the noun it modifies, or \"based in the US\" after the noun."},{"incorrect":"✗ US based company","correct":"✓ US-based company","note":"When used as an adjective before a noun, it is typically hyphenated."}],"priority":"★★☆"},"related_words":{"derivatives":["US (United States)","based (adjective)"],"phrasal_verbs":[],"related_terms":["American","domestic","national","local"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately Frequent","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term \"US-based\" is a compound adjective used to describe something that has its headquarters or primary operations located in the United States. It is commonly used in business, news, and academic contexts to specify the location of an organization, company, or research project. Understanding this term requires familiarity with the abbreviation \"US\" for the United States and the meaning of \"based\" as having a foundation or headquarters.","priority":"★★★"},"example_sentences":[{"sentence":"The US-based tech giant announced record profits this quarter.","translation":"その米国を拠点とするテクノロジー大手は、今四半期に過去最高の利益を発表しました。","type":"example","meaning_category":"General"},{"sentence":"Many US-based startups are attracted to Silicon Valley for its venture capital opportunities.","translation":"多くの米国を拠点とするスタートアップ企業が、ベンチャーキャピタルの機会を求めてシリコンバレーに惹きつけられています。","type":"example","meaning_category":"Business"},{"sentence":"The research was funded by a US-based foundation dedicated to environmental conservation.","translation":"その研究は、環境保護に特化した米国を拠点とする財団によって資金提供されました。","type":"example","meaning_category":"Research"}]}