{"word":"cohabitant","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"同棲者、同居人","english_definition":"A person who lives with another in a sexual relationship without being married. More generally, a person who lives in the same residence as another.","examples":[{"sentence":"They are cohabitants.","translation":"彼らは同棲者です。"},{"sentence":"The law protects the rights of cohabitants in certain situations.","translation":"法律は特定の状況において同棲者の権利を保護します。"},{"sentence":"She listed her boyfriend as a cohabitant on the rental agreement.","translation":"彼女は賃貸契約書にボーイフレンドを同居人として記載しました。"}],"collocations":["common-law cohabitant","domestic cohabitant","cohabitant agreement"],"synonyms":["partner","domestic partner","live-in lover","roommate","housemate"],"antonyms":["spouse","tenant","stranger"]}],"etymology":{"value":"From 'co-' (together) + 'habitant' (dweller), from Latin 'cohabitare' (to dwell together).","priority":"★★★"},"pronunciation":{"ipa":"/koʊˈhæbɪtənt/","syllables":"co-hab-i-tant"},"inflection":{"noun_plural":"cohabitants"},"usage_notes":{"explanation":"'Cohabitant' refers to someone who lives with another person, often in a romantic or sexual relationship, without being married. It can also refer to anyone who lives in the same residence. The term is often used in legal and social contexts to define the rights and responsibilities of individuals living together.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"They are just cohabitants, not a couple.","correct":"They are cohabitants, which means they are a couple living together.","note":"'Cohabitant' implies a couple living together, so saying they are 'not a couple' is contradictory."},{"incorrect":"She is my cohabitant, but we are just friends.","correct":"She is my roommate, we are just friends.","note":"'Cohabitant' usually implies a romantic relationship. If they are just friends, 'roommate' or 'housemate' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["cohabit (verb)","cohabitation (noun)"],"phrasal_verbs":[],"related_terms":["common-law marriage","domestic partnership"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'cohabitant' is used to describe someone who lives with another person in a relationship, especially a romantic one, without being married. It's a formal term often used in legal or official contexts. The word is not very common in everyday conversation, but it's important to understand its meaning in formal settings.","priority":"★★☆"},"example_sentences":[{"sentence":"As cohabitants, they shared the responsibility of maintaining the household.","translation":"同棲者として、彼らは家計を維持する責任を分担しました。","type":"noun","meaning_category":"同棲者"},{"sentence":"The law recognizes certain rights for long-term cohabitants.","translation":"法律は長期の同棲者に対して特定の権利を認めています。","type":"noun","meaning_category":"同棲者"},{"sentence":"The couple decided to become cohabitants after dating for two years.","translation":"そのカップルは2年間交際した後、同棲することを決めました。","type":"noun","meaning_category":"同棲者"}]}