{"word":"ethologist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"動物行動学者","english_definition":"A scientist who studies animal behavior, especially in a natural environment.","examples":[{"sentence":"The ethologist observed the chimpanzees in their natural habitat.","translation":"その動物行動学者はチンパンジーを自然の生息地で観察した。"},{"sentence":"Ethologists study the social structures of various animal species.","translation":"動物行動学者たちは様々な動物種の社会構造を研究する。"}],"collocations":["study animal behavior","observe animals","conduct research","field study","comparative ethology"],"synonyms":["animal behaviorist","zoologist"],"antonyms":[]}],"etymology":{"value":"The word \"ethologist\" comes from the Greek words \"ethos\" meaning \"character\" or \"habit,\" and \"-logist\" meaning \"one who studies.\" It reflects the study of animal behavior and habits.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈθɒlədʒɪst/","syllables":"e-thol-o-gist"},"inflection":{"noun_plural":"ethologists"},"usage_notes":{"explanation":"An ethologist focuses on the scientific and objective study of animal behavior, often emphasizing evolutionary and ecological contexts. The field often involves observing animals in their natural environments to understand their behaviors in relation to survival and reproduction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a ethology.","correct":"✓ She is an ethologist.","note":"'Ethology' is the study itself, while 'ethologist' is the person who studies it. Use the correct noun form."},{"incorrect":"✗ Ethologists only study domestic animals.","correct":"✓ Ethologists study both domestic and wild animals.","note":"Ethologists study a wide range of animals, not just domestic ones. Many focus on wild animals in their natural habitats."}],"priority":"★☆☆"},"related_words":{"derivatives":["ethology (noun: 動物行動学)","ethological (adjective: 動物行動学的な)"],"related_fields":["zoology","behavioral ecology","animal psychology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"An \"ethologist\" is a scientist who studies how animals behave, especially in their natural environments. They look at things like how animals find food, interact with each other, and raise their young. Ethologists often compare the behaviors of different species to understand how these behaviors evolved over time. This field is important for understanding not only animals but also aspects of human behavior.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **ethologist** spent years observing the gorillas in the Rwandan rainforest.","translation":"その動物行動学者はルワンダの熱帯雨林でゴリラを長年観察した。","type":"general","meaning_category":"general"},{"sentence":"As an **ethologist**, she is interested in the communication methods of dolphins.","translation":"動物行動学者として、彼女はイルカのコミュニケーション方法に関心がある。","type":"general","meaning_category":"general"},{"sentence":"The **ethologist's** research shed light on the complex social lives of wolves.","translation":"その動物行動学者の研究は、オオカミの複雑な社会生活に光を当てた。","type":"research","meaning_category":"research"}]}