{"word":"folklorists","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"民俗学者","english_definition":"People who study folklore. Folklore is the traditional beliefs, customs, and stories of a community, passed through the generations by word of mouth.","examples":[{"sentence":"Folklorists collect and analyze traditional stories and customs.","translation":"民俗学者は伝統的な物語や風習を収集し分析する。"},{"sentence":"Many folklorists focus on specific regions or cultural groups.","translation":"多くの民俗学者は特定の地域や文化集団に焦点を当てる。"}],"collocations":["study folklore","collect folklore","analyze folklore","cultural traditions","oral traditions","traditional beliefs"],"synonyms":["ethnologists","anthropologists","cultural historians","mythologists"],"antonyms":[]}],"etymology":{"value":"The word 'folklorists' is derived from 'folklore,' which combines 'folk' (people) and 'lore' (knowledge or traditions). The suffix '-ist' indicates a person who studies or is an expert in a particular field.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfoʊklɔːrɪsts/","syllables":"folk-lor-ists"},"inflection":{"noun_plural":"folklorists","noun_singular":"folklorist"},"usage_notes":{"explanation":"'Folklorists' refers specifically to individuals engaged in the academic or scholarly study of folklore. The term implies a systematic and analytical approach to understanding traditional beliefs and practices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a folklorist, he studies folklores.","correct":"✓ He is a folklorist, he studies folklore.","note":"'Folklore' is generally used as a non-count noun, so it doesn't usually take a plural form."},{"incorrect":"✗ She is a folklorist, she likes folk.","correct":"✓ She is a folklorist, she studies folk culture.","note":"'Folk' refers to people, whereas 'folklore' refers to the traditions and beliefs of those people."}],"priority":"★★☆"},"related_words":{"derivatives":["folklore","folkloristic","folkloristics"],"phrases":["fieldwork","oral tradition","cultural heritage","ethnography"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'folklorists' is a specialized term used in academic contexts, particularly in the fields of anthropology, history, and cultural studies. It refers to scholars who study folklore, which includes the traditional beliefs, customs, and stories of a community. Understanding this term requires familiarity with academic vocabulary and an understanding of cultural studies.","priority":"★★☆"},"example_sentences":[{"sentence":"The panel included several prominent folklorists who discussed the importance of preserving oral traditions.","translation":"そのパネルには、口頭伝承を保存することの重要性について議論する著名な民俗学者が数名含まれていた。","type":"general"},{"sentence":"Folklorists often conduct fieldwork to gather firsthand accounts of local customs.","translation":"民俗学者は、地元の風習に関する直接的な説明を収集するために、しばしばフィールドワークを行う。","type":"general"},{"sentence":"The conference brought together folklorists from around the world to share their research.","translation":"その会議には、研究を共有するために世界中の民俗学者が集まった。","type":"general"}]}