{"word":"underhiring","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(人事) 採用不足、必要人数よりも少ない人数しか採用しないこと","english_definition":"The practice of hiring fewer employees than are needed to meet the demands of a business or organization.","examples":[{"sentence":"The company's underhiring strategy led to overworked employees and decreased productivity.","translation":"その会社の採用不足戦略は、従業員の過労と生産性の低下につながった。"},{"sentence":"Underhiring can save money in the short term, but it often results in higher turnover rates.","translation":"採用不足は短期的にはコスト削減になるかもしれないが、多くの場合、離職率の上昇につながる。"},{"sentence":"To avoid underhiring, businesses should carefully assess their staffing needs and plan accordingly.","translation":"採用不足を避けるために、企業は人員配置のニーズを慎重に評価し、それに応じて計画を立てるべきだ。"}],"collocations":["avoid underhiring (採用不足を避ける)","consequences of underhiring (採用不足の結果)","effects of underhiring (採用不足の影響)","address underhiring (採用不足に対処する)","combat underhiring (採用不足と闘う)","correct underhiring (採用不足を是正する)"],"synonyms":["staffing shortage","understaffing","personnel deficit"],"antonyms":["overhiring","overstaffing","staffing surplus"]},{"part_of_speech":"verb","definition":"(人事) (必要人数よりも)少ない人数しか採用しない","english_definition":"To hire fewer employees than are needed to meet the demands of a business or organization.","examples":[{"sentence":"The department was underhiring due to budget constraints.","translation":"その部署は予算の制約のために採用不足だった。"},{"sentence":"If you underhire, your existing employees will be stretched too thin.","translation":"採用不足になると、既存の従業員が過度に負担を強いられることになる。"},{"sentence":"Companies that consistently underhire risk losing valuable talent to competitors.","translation":"常に採用不足の企業は、貴重な人材を競合他社に奪われるリスクがある。"}],"collocations":["consistently underhire (常に採用不足である)","tend to underhire (採用不足になりがちである)","choose to underhire (採用不足を選ぶ)","decide to underhire (採用不足を決定する)"],"synonyms":["understaff","hire insufficiently"],"antonyms":["overhire","overstaff"]}],"etymology":{"value":"The word \"underhiring\" is formed by combining the prefix \"under-\" (meaning \"too little\" or \"not enough\") with the word \"hiring\" (the act of employing someone). It's a relatively recent term that has gained prominence with increased focus on workforce management and its impact on business outcomes.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌʌndərˈhaɪərɪŋ/","syllables":"un-der-hi-ring"},"inflection":{"noun_plural":"underhirings","verb_forms":{"present_simple":["underhire","underhires"],"past_simple":"underhired","past_participle":"underhired","present_participle":"underhiring"}},"usage_notes":{"explanation":"\"Underhiring\" is a term used in human resources and business management to describe a situation where an organization doesn't hire enough employees to meet its operational needs. This can lead to various problems such as increased workload for existing employees, decreased productivity, burnout, and higher employee turnover. It's often a result of cost-cutting measures or a failure to accurately forecast staffing requirements. The opposite of underhiring is \"overhiring,\" where an organization hires more employees than it needs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is under hire new employees.","correct":"✓ The company is underhiring new employees.","note":"\"Underhire\" is not commonly used as a separate verb. The correct term is \"underhiring,\" which functions as both a noun and a verb (present participle)."},{"incorrect":"✗ Under hiring is bad for business.","correct":"✓ Underhiring is bad for business.","note":"When used as a noun, it should be one word: \"underhiring.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["understaffed (形容詞: 人員不足の)","understaffing (名詞: 人員不足)","staffing levels (名詞: 従業員数)","workforce planning (名詞: 人員計画)","talent acquisition (名詞: 人材獲得)"],"phrasal_verbs":["N/A"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to discussions around workforce management.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"underhiring\" refers to the practice where a company or organization hires fewer employees than are necessary to adequately handle its workload and operational demands. This can occur due to budget constraints, poor planning, or an inaccurate assessment of staffing needs. The consequences of underhiring often include increased stress and burnout among existing employees, reduced productivity, lower quality of work, and higher employee turnover rates. Addressing underhiring requires a careful analysis of workload, employee capacity, and strategic workforce planning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The consulting firm warned the hospital about the dangers of underhiring nurses.","translation":"そのコンサルティング会社は、病院に対し看護師の採用不足の危険性について警告した。","type":"noun","meaning_category":"採用不足"},{"sentence":"They decided to underhire this quarter due to unexpected financial losses.","translation":"彼らは予想外の財務損失のため、今四半期は採用不足にすることを決定した。","type":"verb","meaning_category":"(必要人数よりも)少ない人数しか採用しない"},{"sentence":"One of the biggest challenges facing small businesses is avoiding underhiring during periods of rapid growth.","translation":"中小企業が直面する最大の課題の1つは、急速な成長期に採用不足を避けることだ。","type":"noun","meaning_category":"採用不足"},{"sentence":"The team was constantly underhiring, leading to a high level of employee dissatisfaction.","translation":"そのチームは常に採用不足であり、従業員の不満が高まっていた。","type":"verb","meaning_category":"(必要人数よりも)少ない人数しか採用しない"}]}