{"word":"historicodogmatic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"歴史的教義学の、歴史的教義学的な","english_definition":"Relating to or combining historical and dogmatic (theological) approaches, especially in the study of religious doctrines.","examples":[{"sentence":"The author employed a historicodogmatic method to analyze the development of the Trinity doctrine.","translation":"著者（著述家）は、三位一体の教義の発展を分析するために、歴史的教義学的な方法を採用しました。"}],"collocations":["historicodogmatic approach","historicodogmatic analysis","historicodogmatic study"],"synonyms":["historical-dogmatic","historical-theological"],"antonyms":["ahistorical","non-dogmatic"]}],"etymology":{"value":"Combination of 'historical' and 'dogmatic'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/hɪˌstɒrɪkoʊdɒɡˈmætɪk/","syllables":"hi-stor-i-co-dog-mat-ic"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"The term 'historicodogmatic' is primarily used in theological and academic contexts to describe a method or perspective that integrates historical analysis with dogmatic (doctrinal) considerations. It is often used when studying the development and interpretation of religious beliefs and doctrines over time, considering both their historical context and their theological significance.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["historicodogmatically"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'historicodogmatic' is a highly specialized term primarily used in academic and theological discussions. It combines the concepts of historical analysis and dogmatic theology, suggesting an approach that considers both the historical development and the doctrinal content of religious beliefs. Due to its specific and technical nature, it is unlikely to be encountered outside of these specialized contexts."},"example_sentences":[{"sentence":"His historicodogmatic research provided new insights into the evolution of Christian theology.","translation":"彼の歴史的教義学的研究は、キリスト教神学の進化に新たな洞察を与えた。","type":"adjective","meaning_category":"Relating to historical and dogmatic approaches"}]}