{"word":"witch-finding","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"魔女狩り","english_definition":"The act of identifying and persecuting people believed to be witches.","examples":[{"sentence":"Witch-finding was a dark chapter in European history.","translation":"魔女狩りはヨーロッパの歴史における暗黒の時代でした。"},{"sentence":"The methods used in witch-finding were often cruel and unjust.","translation":"魔女狩りで用いられた方法はしばしば残酷で不当でした。"}],"collocations":["witch-finding methods","witch-finding trials","witch-finding craze"],"synonyms":["witch hunt","persecution of witches"],"antonyms":[]}],"etymology":{"value":"Compound of 'witch' and 'finding'. Reflects the historical practice of identifying individuals believed to be witches.","priority":"★★☆"},"pronunciation":{"ipa":"ˈwɪtʃˌfaɪndɪŋ","syllables":"witch-find-ing"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Witch-finding' typically refers to the historical practice of identifying and prosecuting individuals believed to be witches, particularly during periods of intense witch hunts. It can also be used metaphorically to describe any form of persecution based on unsubstantiated accusations or beliefs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The witch-finding was a good thing.","correct":"✓ Witch-finding was a terrible period in history.","note":"Witch-finding is generally viewed negatively due to its association with injustice and cruelty."}],"priority":"★☆☆"},"related_words":{"derivatives":["witchfinder"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Witch-finding' is a term that refers to the historical practice of identifying and persecuting people believed to be witches. It's often used in the context of historical discussions or when drawing parallels to modern-day situations where people are unfairly targeted based on unsubstantiated accusations. The term carries a negative connotation due to the injustice and cruelty associated with historical witch hunts."},"example_sentences":[{"sentence":"The era of witch-finding in Salem is a well-known example of mass hysteria.","translation":"セーラムにおける魔女狩りの時代は、集団ヒステリーのよく知られた例です。","type":"noun","meaning_category":"魔女狩り"},{"sentence":"The witch-finding methods of the time were based on superstition and fear.","translation":"当時の魔女狩りの方法は、迷信と恐怖に基づいていました。","type":"noun","meaning_category":"魔女狩り"}]}