{"word":"dizygotic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"二卵性の","english_definition":"(of twins) developed from two separately fertilized eggs; fraternal.","examples":[{"sentence":"Dizygotic twins are no more genetically similar than ordinary siblings.","translation":"二卵性双生児は、通常の兄弟姉妹と遺伝的に大差ありません。"},{"sentence":"The study focused on comparing the traits of monozygotic and dizygotic twins.","translation":"その研究は、一卵性双生児と二卵性双生児の特性を比較することに焦点を当てました。"}],"collocations":["dizygotic twins (二卵性双生児)"],"synonyms":["fraternal","non-identical"],"antonyms":["monozygotic","identical"]}],"etymology":{"value":"From di- (two) + zygote + -ic.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪzaɪˈɡɒtɪk/","syllables":"di-zy-got-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Dizygotic' is a term used in biology and genetics to describe twins who develop from two separate eggs fertilized by two separate sperm. They are also known as fraternal or non-identical twins. They share approximately 50% of their genes, just like regular siblings. The term is often used in contrast to 'monozygotic', which refers to identical twins who develop from a single fertilized egg.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Dizygotic twins are always the same sex.","correct":"Dizygotic twins can be the same sex or different sexes.","note":"Dizygotic twins can be either the same sex or different sexes, unlike monozygotic twins who are always the same sex."}],"priority":"★★☆"},"related_words":{"derivatives":["dizygosity (noun)"],"phrasal_verbs":[],"related_terms":["zygote","monozygotic","fraternal twins","twins"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dizygotic' is a scientific term primarily used in the context of biology, genetics, and medical studies. It refers to twins that originate from two distinct eggs fertilized by two different sperm cells. Understanding this term requires some background knowledge in genetics and reproductive biology, making it suitable for advanced learners or those with specific interests in these fields."},"example_sentences":[{"sentence":"The incidence of dizygotic twinning varies among different populations.","translation":"二卵性双生児の発生率は、異なる集団間で異なります。","type":"general","meaning_category":"occurrence"},{"sentence":"Unlike monozygotic twins, dizygotic twins do not share identical DNA.","translation":"一卵性双生児とは異なり、二卵性双生児は同一のDNAを共有しません。","type":"comparison","meaning_category":"genetics"}]}