{"word":"Myomotomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"子宮筋腫切除術","english_definition":"A surgical procedure in which uterine fibroids are removed while leaving the uterus in place.","examples":[{"sentence":"Myomotomy is a fertility-sparing procedure for women with uterine fibroids.","translation":"子宮筋腫切除術は、子宮筋腫のある女性にとって妊孕性を温存する手術です。"},{"sentence":"The patient underwent a myomotomy to remove several large fibroids.","translation":"患者は、いくつかの大きな筋腫を除去するために子宮筋腫切除術を受けた。"}],"collocations":["abdominal myomotomy","laparoscopic myomotomy","hysteroscopic myomotomy"],"synonyms":["fibroidectomy"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'myo-' meaning muscle, 'oma' meaning tumor, and '-tomy' meaning cutting.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪ.oʊˈmɒt.ə.mi/","syllables":"My-o-mot-o-my"},"inflection":{"noun_plural":"Myomotomies"},"usage_notes":{"explanation":"Myomotomy is a surgical option for women who wish to preserve their fertility and have symptomatic uterine fibroids. Different approaches exist, including abdominal, laparoscopic, and hysteroscopic myomotomy, depending on the size, number, and location of the fibroids.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Myomectomy is the same as hysterectomy.","correct":"✓ Myomotomy is different from hysterectomy; myomotomy removes fibroids while preserving the uterus, whereas hysterectomy removes the entire uterus.","note":"Myomotomy preserves the uterus, while hysterectomy removes it."}],"priority":"★★☆"},"related_words":{"derivatives":["myoma","myomatous","myomectomy","hysterectomy"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Myomotomy is a specialized medical term referring to the surgical removal of uterine fibroids. This term is primarily used within medical contexts and is not commonly encountered in general conversations. Understanding this term requires a background in medical terminology or specific knowledge related to women's health.","priority":"★★☆"},"example_sentences":[{"sentence":"The surgeon recommended a myomotomy to address the patient's heavy bleeding.","translation":"外科医は、患者の重い出血に対処するために子宮筋腫切除術を推奨した。","type":"medical","meaning_category":"surgical procedure"},{"sentence":"Laparoscopic myomotomy allows for a minimally invasive approach to fibroid removal.","translation":"腹腔鏡下子宮筋腫切除術は、筋腫除去への低侵襲アプローチを可能にする。","type":"medical","meaning_category":"surgical procedure"}]}