{"word":"nesters","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"Plural form of 'nester'. A person who settles on unoccupied land, especially in the western United States.","english_definition":"Plural of nester: A person who settles on unoccupied land, especially in the western United States.","examples":[{"sentence":"The conflict between the ranchers and the nesters escalated over water rights.","translation":"牧場主と入植者の間の対立は、水利権をめぐって激化した。"},{"sentence":"The arrival of the nesters changed the landscape of the prairie.","translation":"入植者の到来は、大草原の景観を変えた。"}],"collocations":["prairie nesters","homestead nesters","land nesters"],"synonyms":["settlers","homesteaders","pioneers","squatters"],"antonyms":["ranchers","landowners"]},{"part_of_speech":"noun","definition":"Plural form of 'nester'. An animal that builds or occupies a nest.","english_definition":"Plural of nester: An animal that builds or occupies a nest.","examples":[{"sentence":"The forest was full of nesters, from birds to squirrels.","translation":"その森は、鳥からリスまで、巣を作る動物でいっぱいだった。"},{"sentence":"We observed several nesters preparing their homes for the winter.","translation":"私たちは、冬に向けて巣を準備しているいくつかの動物を観察した。"}],"collocations":["bird nesters","squirrel nesters","insect nesters"],"synonyms":["nest builders","nest inhabitants"],"antonyms":["migrants","wanderers"]}],"etymology":{"value":"'Nester' is derived from 'nest,' referring to the act of settling down and building a home.","priority":"Medium"},"pronunciation":{"ipa":"/ˈnɛstərz/","syllables":"nes-ters"},"inflection":{"noun_plural":"nesters"},"usage_notes":{"explanation":"The term 'nesters' primarily refers to settlers in the western United States who established homesteads, often in conflict with established ranchers. It can also refer to animals that build or inhabit nests, though this usage is less common.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The nesters are building a new city.","correct":"The settlers are building a new city.","note":"'Nesters' specifically refers to those settling on unoccupied land, not general city builders."}],"priority":"Low"},"related_words":{"derivatives":["nest","nesting"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'nesters' is relatively uncommon. It refers to people who settle on unoccupied land, especially in the western United States. It can also refer to animals that build nests, but this is less common. Understanding the historical context of land settlement in the US is helpful for interpreting this word."},"example_sentences":[{"sentence":"The nesters built their homes on the open prairie.","translation":"入植者たちは、開けた大草原に家を建てた。","type":"noun","meaning_category":"Settlers"},{"sentence":"The bird nesters filled the trees with their songs.","translation":"巣を作る鳥たちは、歌で木々を満たした。","type":"noun","meaning_category":"Animals that build nests"}]}