{"word":"perukeless","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Without a peruke (wig).","english_definition":"Lacking a peruke; not wearing a wig.","examples":[{"sentence":"The portrait depicted the judge perukeless, revealing a close-cropped head of grey hair.","translation":"その肖像画は、裁判官がかつらを着けていない姿を描いており、短く刈り込んだ白髪頭を露わにしていた。"},{"sentence":"He felt liberated going perukeless in the privacy of his own home.","translation":"彼は自宅で誰にも見られずにかつらを外して過ごすことに解放感を感じた。"}],"collocations":["perukeless head","perukeless appearance","go perukeless"],"synonyms":["unwigged","unperuked"],"antonyms":["peruked","wigged"]},{"part_of_speech":"adjective","definition":"Not characteristic of perukes.","english_definition":"Not resembling or typical of a peruke.","examples":[{"sentence":"The artist aimed for a more natural look, resulting in a perukeless style of portraiture.","translation":"そのアーティストはより自然な外観を目指し、その結果、かつららしくない肖像画のスタイルになった。"},{"sentence":"The modern hairstyle was perukeless in its simplicity and lack of artifice.","translation":"その現代的なヘアスタイルは、シンプルさと技巧のなさがかつららしくなかった。"}],"collocations":["perukeless style","perukeless design","perukeless aesthetic"],"synonyms":["natural","unaffected","simple"],"antonyms":["artificial","ornate","elaborate"]}],"etymology":{"value":"Formed from \"peruke\" (a type of wig, from French \"perruque,\" from Italian \"perrucca\") + \"-less\" (without).","priority":"★★★"},"pronunciation":{"ipa":"/pəˈruːkləs/","syllables":"pe-ruke-less"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more perukeless' and 'most perukeless', respectively, although these are rarely used."},"usage_notes":{"explanation":"'Perukeless' is a relatively rare word primarily used in historical or descriptive contexts to indicate the absence of a peruke, a type of wig that was fashionable in the 17th and 18th centuries. It can also be used more figuratively to describe something that lacks the artificial or ornate qualities associated with perukes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was perukelessly walking down the street.","correct":"✓ He was walking down the street perukeless.","note":"'Perukeless' is an adjective, not an adverb. To describe the manner of walking, use a different construction."},{"incorrect":"✗ The perukelessness of the portrait was striking.","correct":"✓ The absence of a peruke in the portrait was striking.","note":"'Perukelessness' is a possible but very rare noun form. It's generally better to use a phrase like 'the absence of a peruke'."}],"priority":"★☆☆"},"related_words":{"derivatives":["peruke (noun): a wig, especially a long, full wig formerly worn by men"],"phrases":["without a peruke","lacking a peruke"],"related_concepts":["wig","hairpiece","fashion history","17th century","18th century"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Perukeless' is a niche word, primarily encountered in historical texts or discussions about fashion history. Its meaning is relatively straightforward to deduce from its components ('peruke' + '-less'), but its limited usage makes it unlikely to be familiar to most English speakers."},"example_sentences":[{"sentence":"The actor's decision to appear perukeless in the historical drama was a bold choice.","translation":"俳優が時代劇でかつらを着けないことを決めたのは大胆な選択だった。","type":"adjective","meaning_category":"Without a peruke"},{"sentence":"The modern design aesthetic is perukeless in its simplicity, eschewing elaborate ornamentation.","translation":"現代的なデザイン美学はシンプルさにおいてかつららしくなく、手の込んだ装飾を避けている。","type":"adjective","meaning_category":"Not characteristic of perukes"}]}