{"word":"contouring","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(化粧における)コントゥアリング、陰影メイク: 顔の立体感を強調するために、シェーディングやハイライトなどの化粧品を使用するテクニック","english_definition":"A makeup technique that uses cosmetics to define, enhance, and sculpt the structure of the face or other parts of the body. It involves using shades that are darker than your skin tone to define areas and lighter shades to highlight them.","examples":[{"sentence":"Contouring can dramatically change the appearance of your face.","translation":"コントゥアリングは顔の印象を劇的に変えることができます。"},{"sentence":"She learned contouring techniques from a YouTube tutorial.","translation":"彼女はYouTubeのチュートリアルでコントゥアリングのテクニックを学びました。"},{"sentence":"Proper contouring can enhance your cheekbones and jawline.","translation":"適切なコントゥアリングは、頬骨や顎のラインを強調することができます。"}],"collocations":["face contouring (フェイスコントゥアリング)","body contouring (ボディコントゥアリング)","contouring brush (コントゥアリングブラシ)","contouring palette (コントゥアリングパレット)","contouring kit (コントゥアリングキット)","cream contouring (クリームコントゥアリング)","powder contouring (パウダーコントゥアリング)"],"synonyms":["shading","sculpting","highlighting","shaping","defining"],"antonyms":["none (as it's a specific technique)"]},{"part_of_speech":"verb","definition":"(他動詞) (化粧で)コントゥアリングする、陰影をつける","english_definition":"To apply makeup using the contouring technique.","examples":[{"sentence":"She contoured her face to make her cheekbones appear higher.","translation":"彼女は頬骨を高く見せるために顔にコントゥアリングを施しました。"},{"sentence":"He contoured his jawline to create a more defined look.","translation":"彼はよりシャープな印象にするために顎のラインにコントゥアリングを施しました。"},{"sentence":"Many makeup artists contour the nose to make it appear slimmer.","translation":"多くのメイクアップアーティストは、鼻を細く見せるためにコントゥアリングをします。"}],"collocations":["contour the face (顔にコントゥアリングをする)","contour the nose (鼻にコントゥアリングをする)","contour the cheekbones (頬骨にコントゥアリングをする)","contour the jawline (顎のラインにコントゥアリングをする)"],"synonyms":["shade","sculpt","highlight","shape","define"],"antonyms":["none (as it's a specific technique)"]}],"etymology":{"value":"The term 'contouring' is derived from the word 'contour,' which refers to the outline or shape of something. In makeup, contouring involves creating shadows and highlights to alter the perceived shape of the face or body.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈkɒntʊrɪŋ/","syllables":"con-tour-ing"},"inflection":{"noun_plural":"contourings (rarely used)","verb_forms":{"present_simple":["contour","contours"],"past_simple":"contoured","past_participle":"contoured","present_participle":"contouring"}},"usage_notes":{"explanation":"Contouring is a makeup technique used to enhance facial features by creating shadows and highlights. It involves using products that are darker (contour) and lighter (highlight) than your natural skin tone to create the illusion of depth and dimension. It's a popular technique used by makeup artists and enthusiasts alike to sculpt and define the face.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I contoured with a blush.","correct":"✓ I contoured with a contour shade/product.","note":"Blush is typically used for adding color to the cheeks, not for creating shadows. Contouring requires a shade darker than your skin tone."},{"incorrect":"✗ Contouring is only for professional makeup artists.","correct":"✓ Contouring can be done by anyone with practice.","note":"While professional makeup artists are skilled in contouring, anyone can learn and practice the technique."},{"incorrect":"✗ You should contour your whole face every day.","correct":"✓ Contouring is optional and depends on the desired look.","note":"Contouring is not a necessary step in every makeup routine and depends on personal preference."}],"priority":"☆☆☆"},"related_words":{"derivatives":["contour (noun, verb)","contoured (adjective)"],"related_terms":["highlighting","strobing","baking","makeup","cosmetics","bronzer","highlighter","foundation","concealer"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Relatively low frequency, but increasing due to popularity of makeup tutorials.","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"'Contouring' is a specialized term related to makeup application. It refers to the technique of using dark and light makeup shades to sculpt and define facial features. This technique creates the illusion of depth and dimension, enhancing the natural contours of the face. It's commonly discussed in beauty blogs, makeup tutorials, and among makeup enthusiasts. Understanding this term requires some familiarity with makeup terminology and techniques."},"example_sentences":[{"sentence":"She used a dark shade to **contour** her cheekbones.","translation":"彼女は頬骨に陰影をつけるために濃い色のシェードを使いました。","type":"verb","meaning_category":"陰影をつける"},{"sentence":"The **contouring** palette included both matte and shimmer shades.","translation":"そのコントゥアリングパレットには、マットとシマーの両方のシェードが含まれていました。","type":"noun","meaning_category":"陰影メイク"},{"sentence":"Many tutorials demonstrate how to **contour** different face shapes.","translation":"多くのチュートリアルで、さまざまな顔の形にコントゥアリングする方法が紹介されています。","type":"verb","meaning_category":"陰影をつける"},{"sentence":"Effective **contouring** can make your face look slimmer.","translation":"効果的なコントゥアリングは、顔をよりスリムに見せることができます。","type":"noun","meaning_category":"陰影メイク"}]}