{"word":"verticality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"垂直であること、垂直性、垂直方向への広がり、垂直構造","english_definition":"the state or quality of being vertical; the extent or degree to which something is vertical; the upward reach or extent of something; a vertical structure or arrangement.","examples":[{"sentence":"The architect emphasized the verticality of the skyscraper's design.","translation":"建築家は、その超高層ビルのデザインの垂直性を強調した。"},{"sentence":"The climbers were impressed by the sheer verticality of the cliff face.","translation":"登山家たちは、崖のむき出しの垂直性に感銘を受けた。"},{"sentence":"The city is known for its dramatic verticality, with tall buildings dominating the skyline.","translation":"その都市は、高層ビルが空を覆い、劇的な垂直性で知られている。"},{"sentence":"The artist explored the theme of verticality in his sculptures.","translation":"その芸術家は、彫刻作品の中で垂直性というテーマを探求した。"}],"collocations":["emphasize verticality (垂直性を強調する)","sheer verticality (むき出しの垂直性)","dramatic verticality (劇的な垂直性)","sense of verticality (垂直感覚)","structural verticality (構造的な垂直性)"],"synonyms":["perpendicularity","uprightness","erectness","height","altitude","elevation"],"antonyms":["horizontality","flatness","levelness"]},{"part_of_speech":"noun","definition":"（ビジネスにおける）垂直統合","english_definition":"(in business) the integration of different stages of production or distribution within a single company.","examples":[{"sentence":"The company achieved greater efficiency through verticality, controlling all aspects of the supply chain.","translation":"その会社は、サプライチェーンのあらゆる側面を管理することで、垂直統合を通じて効率性を高めた。"},{"sentence":"Verticality allows the business to reduce costs and improve quality control.","translation":"垂直統合により、企業はコストを削減し、品質管理を向上させることができる。"},{"sentence":"The trend towards verticality is reshaping the industry.","translation":"垂直統合への流れが業界を再構築している。"}],"collocations":["business verticality (ビジネスにおける垂直統合)","supply chain verticality (サプライチェーンの垂直統合)","achieve verticality (垂直統合を達成する)","increase verticality (垂直統合を強化する)"],"synonyms":["vertical integration"],"antonyms":["horizontal integration"]}],"etymology":{"value":"Derived from 'vertical' (adjective) + '-ity' (suffix denoting a state or quality). 'Vertical' comes from Latin 'verticalis', from 'vertex' (highest point, summit).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɜːrtɪˈkæləti/","syllables":"ver-ti-cal-i-ty"},"inflection":{"notes":"Plural form: verticalities"},"usage_notes":{"explanation":"'Verticality' refers to the quality of being vertical, emphasizing the upward direction or the arrangement of something in an upright manner. In architectural contexts, it often describes the visual impact of tall structures. In a business context, 'verticality' refers to the degree to which a company controls multiple stages of its supply chain, also known as vertical integration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The verticality of the building was impressive high.","correct":"✓ The verticality of the building was impressively high.","note":"'Verticality' is a noun, so it should be modified by an adverb ('impressively') rather than an adjective ('impressive'). However, it's more natural to say 'The building was impressively tall.'"},{"incorrect":"✗ The company has a good verticality in the market.","correct":"✓ The company has a strong vertical integration in the market.","note":"When referring to business integration, the term 'vertical integration' is more common and precise than 'verticality'."}],"priority":"★★☆"},"related_words":{"derivatives":["vertical (adjective, noun)","vertically (adverb)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, more common in specialized contexts (architecture, business).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'verticality' is a relatively advanced term, primarily used in specialized contexts such as architecture, design, and business. It refers to the quality or state of being vertical, or the extent to which something is vertically integrated. Understanding the term requires a grasp of abstract concepts related to spatial orientation and business strategy. It's not commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The cathedral's soaring verticality created a sense of awe and reverence.","translation":"その大聖堂のそびえ立つ垂直性は、畏敬の念を起こさせた。","type":"noun","meaning_category":"垂直性 (architecture)"},{"sentence":"The company's verticality allowed it to control costs from raw materials to retail.","translation":"その会社の垂直統合により、原材料から小売までのコストを管理することができた。","type":"noun","meaning_category":"垂直統合 (business)"},{"sentence":"The artist used lines to emphasize the verticality of the trees in the landscape.","translation":"その芸術家は、線を使って風景の中の木の垂直性を強調した。","type":"noun","meaning_category":"垂直性 (art)"},{"sentence":"The sheer verticality of the mountain face presented a formidable challenge to the climbers.","translation":"その山のむき出しの垂直性は、登山家にとって手ごわい挑戦となった。","type":"noun","meaning_category":"垂直性 (geography)"}]}