{"word":"Sphingidae","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"スズメガ科","english_definition":"A family of moths, commonly known as hawk moths, sphinx moths, or hornworms.","examples":[{"sentence":"The Sphingidae family includes some of the fastest flying moths.","translation":"スズメガ科には、最も速く飛ぶ蛾が含まれています。"}],"collocations":["hawk moth","sphinx moth","hornworm"],"synonyms":["hawk moths","sphinx moths","hornworms"],"antonyms":[]}],"etymology":{"value":"Derived from the genus Sphinx, which was named by Carl Linnaeus in 1758. The name refers to the sphinx-like posture of the larvae when disturbed.","priority":"★★☆"},"pronunciation":{"ipa":"/sfɪnˈdʒiːdiː/","syllables":"Sphin-gi-dae"},"inflection":{"noun_plural":"Sphingidae (科名のため複数形は通常使われません)"},"usage_notes":{"explanation":"'Sphingidae' is a taxonomic family name, so it is always capitalized. It refers to the entire family of hawk moths. When referring to a single moth within this family, you would use a specific genus and species name.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ A Sphingidae is flying around my garden.","correct":"✓ A hawk moth is flying around my garden.","note":"Use the common name 'hawk moth' or a specific genus/species name when referring to a single moth. 'Sphingidae' refers to the entire family."}],"priority":"★★☆"},"related_words":{"derivatives":["sphinx moth","hawk moth","hornworm"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sphingidae' is a scientific term used to refer to a specific family of moths. It's not a word you would typically encounter in everyday conversation. Understanding this term requires some knowledge of biology and taxonomy. When discussing these moths in a general context, it's more common to use the terms 'hawk moths' or 'sphinx moths.'"},"example_sentences":[{"sentence":"Many species within the Sphingidae family are known for their long proboscises.","translation":"スズメガ科の多くの種は、長い口吻で知られています。","type":"general","meaning_category":"description"},{"sentence":"The larvae of some Sphingidae species are agricultural pests.","translation":"スズメガ科の一部の種の幼虫は、農業害虫です。","type":"ecology","meaning_category":"ecological role"},{"sentence":"Studies of Sphingidae moths have contributed to our understanding of insect flight.","translation":"スズメガ科の蛾の研究は、昆虫の飛行に関する私たちの理解に貢献しています。","type":"research","meaning_category":"scientific study"}]}