{"word":"Negotiables","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"交渉可能なもの、交渉の余地があるもの","english_definition":"Items or terms that can be discussed and potentially changed during a negotiation.","examples":[{"sentence":"Salary and benefits are often negotiables when accepting a job offer.","translation":"給与と福利厚生は、求人のオファーを受ける際に交渉可能なことが多いです。"},{"sentence":"The price of the car and the financing terms were negotiables.","translation":"車の価格と融資条件は交渉可能でした。"},{"sentence":"In contract negotiations, some clauses are negotiables while others are non-negotiable.","translation":"契約交渉では、一部の条項は交渉可能ですが、そうでないものもあります。"}],"collocations":["negotiable terms (交渉可能な条件)","negotiable points (交渉可能な点)","negotiable items (交渉可能な項目)","highly negotiable (非常に交渉の余地がある)","somewhat negotiable (ある程度交渉の余地がある)"],"synonyms":["bargainable","flexible","adjustable","open to discussion"],"antonyms":["non-negotiable","fixed","inflexible","unalterable"]}],"etymology":{"value":"The word 'negotiable' comes from the Latin word 'negotiari,' meaning 'to carry on business.' The suffix '-able' indicates the capacity or suitability for being negotiated.","priority":"★★☆"},"pronunciation":{"ipa":"/nɪˈɡoʊʃiəbəlz/","syllables":"ne-go-tia-bles"},"inflection":{"noun_plural":"Negotiables"},"usage_notes":{"explanation":"'Negotiables' refers to the specific aspects or terms of a deal, agreement, or contract that are open to discussion and modification. It implies a willingness from at least one party to consider changes to the initial proposal. Understanding which elements are negotiables is crucial for successful negotiation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The negotiables were very non-negotiable.","correct":"✓ The negotiable items were surprisingly fixed.","note":"This mistake involves a contradiction. If something is 'negotiable,' it cannot simultaneously be 'non-negotiable.'"},{"incorrect":"✗ I'm not sure what are the negotiables.","correct":"✓ I'm not sure what the negotiables are.","note":"The correct sentence structure is important for clarity. 'What the negotiables are' is the subject of the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["negotiate (verb: 交渉する)","negotiation (noun: 交渉)","negotiator (noun: 交渉者)","negotiability (noun: 交渉可能性)","negotiable (adjective: 交渉可能な)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in business and legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Negotiables' is a term primarily used in business, legal, and diplomatic contexts. It refers to the specific elements or terms within a proposal, agreement, or contract that are open to discussion, modification, or compromise during negotiations. The term implies a willingness from at least one party to consider changes to the initial conditions. Understanding which elements are negotiables and which are non-negotiable is a key aspect of successful negotiation strategies. The term is more common in formal settings and written communication related to deal-making and dispute resolution."},"example_sentences":[{"sentence":"The closing date for the sale is one of the key negotiables.","translation":"売買のクロージング日は、主要な交渉項目の1つです。","type":"noun","meaning_category":"交渉可能なもの"},{"sentence":"Let's identify the negotiables before we start the discussion.","translation":"議論を始める前に、交渉可能なものを特定しましょう。","type":"noun","meaning_category":"交渉可能なもの"},{"sentence":"The company is willing to discuss the negotiables in the contract.","translation":"会社は契約における交渉可能なものを議論する用意があります。","type":"noun","meaning_category":"交渉可能なもの"}]}