{"word":"transudate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"滲出液（しんしゅつえき）","english_definition":"A fluid that has passed through a membrane or has been extruded from a tissue; it is a filtrate of blood plasma with low protein content.","examples":[{"sentence":"A pleural effusion may be either a transudate or an exudate.","translation":"胸水は滲出液または漏出液のいずれかであり得る。"},{"sentence":"Transudates are typically caused by systemic conditions that alter hydrostatic or osmotic pressures.","translation":"滲出液は通常、静水圧または浸透圧を変化させる全身状態によって引き起こされる。"}],"collocations":["pleural transudate (胸膜滲出液)","peritoneal transudate (腹膜滲出液)","ascitic transudate (腹水滲出液)"],"synonyms":["serous fluid","effusion","filtrate"],"antonyms":["exudate"]},{"part_of_speech":"verb","definition":"滲出する（しんしゅつする）","english_definition":"To pass through a membrane or tissue; to exude as a transudate.","examples":[{"sentence":"The fluid transudated from the capillaries into the surrounding tissue.","translation":"液体は毛細血管から周囲組織に滲出した。"}],"collocations":[],"synonyms":["exude","seep","ooze","filter","percolate"],"antonyms":[]}],"etymology":{"value":"From Latin *trans-* (across, through) + *sudare* (to sweat).","priority":"★★★"},"pronunciation":{"ipa":"ˈtrænsjuːdeɪt","syllables":"tran-su-date"},"inflection":{"noun_plural":"transudates","verb_forms":{"present_simple":["transudate","transudates"],"past_simple":"transudated","past_participle":"transudated","present_participle":"transudating"}},"usage_notes":{"explanation":"A transudate is a fluid that passes through a membrane because of pressure differences. It has a low protein content compared to an exudate, which is a fluid that leaks around cells of the blood vessels due to inflammation. Transudates are often associated with systemic diseases affecting fluid balance, such as heart failure, liver failure, or kidney disease.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The wound was filled with transudate, indicating infection.","correct":"The wound was filled with exudate, indicating infection.","note":"Transudates are not typically associated with infection. Exudates are more commonly associated with inflammation and infection."}],"priority":"★★☆"},"related_words":{"derivatives":["transudation (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Transudate' is a technical term primarily used in medical contexts to describe a type of fluid that passes through a membrane due to pressure differences. It's important to understand that transudates have a low protein content and are different from exudates, which are associated with inflammation. This term is more likely to be encountered in medical literature or discussions among healthcare professionals."},"example_sentences":[{"sentence":"The doctor suspected a cardiac problem when he found a large transudate in the patient's abdomen.","translation":"医師は、患者の腹部に大量の滲出液を発見した際、心臓の問題を疑った。","type":"noun","meaning_category":"滲出液"},{"sentence":"In cases of nephrotic syndrome, protein loss can lead to transudation of fluid into tissues.","translation":"ネフローゼ症候群の場合、タンパク質の喪失は組織への液体の滲出につながる可能性がある。","type":"noun","meaning_category":"滲出液"},{"sentence":"The fluid began to transudate through the damaged tissue.","translation":"液体が損傷した組織から滲出し始めた。","type":"verb","meaning_category":"滲出する"}]}