{"word":"valuably","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"貴重に、価値のあるように、有益に","english_definition":"in a valuable or useful manner; in a way that provides benefit or worth.","examples":[{"sentence":"The experience gained during the internship was valuably applied to her future career.","translation":"インターンシップで得られた経験は、彼女の将来のキャリアに貴重に活かされました。"},{"sentence":"He valuably contributed to the project with his expertise.","translation":"彼は自身の専門知識でプロジェクトに有益に貢献しました。"},{"sentence":"The information was valuably presented, making it easy to understand.","translation":"その情報は価値のあるように提示され、理解しやすくなりました。"}],"collocations":["contribute valuably","apply valuably","present valuably","use valuably","serve valuably"],"synonyms":["usefully","beneficially","profitably","advantageously","helpfully","significantly","importantly"],"antonyms":["uselessly","worthlessly","ineffectively"]}],"etymology":{"value":"The word 'valuably' is formed by adding the suffix '-ly' to the adjective 'valuable'. 'Valuable' comes from 'value', which originates from the Old French word 'valoir', meaning 'to be worth'. The suffix '-ly' transforms adjectives into adverbs, indicating the manner in which something is done.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvæljuəbli/","syllables":"val-u-a-bly"},"inflection":{"notes":"As an adverb, 'valuably' does not have different inflections."},"usage_notes":{"explanation":"'Valuably' is an adverb that describes how something is done in a way that is valuable, useful, or beneficial. It emphasizes the worth or importance of an action or contribution. It is often used to highlight the positive impact or significance of someone's efforts or the effectiveness of a particular method or approach.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She valuably is a member of the team.","correct":"✓ She is a valuable member of the team.","note":"'Valuably' is an adverb and should be used to modify a verb, adjective, or another adverb. 'Valuable' is an adjective and should be used to describe a noun. In this case, 'member' is a noun, so 'valuable' is the correct word to use."},{"incorrect":"✗ He valuably gave his time to the charity.","correct":"✓ He valuable gave his time to the charity. / ✓ He gave his time valuably to the charity.","note":"The first sentence is incorrect because 'valuably' is placed before the verb 'gave' and it doesn't modify the verb. The second sentence is correct because 'valuably' modifies 'gave'. The third sentence is also correct because 'valuably' modifies the whole phrase, and is placed at the end of the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["valuable (adjective)","value (noun, verb)","invaluable (adjective)","valuableness (noun)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Valuably' is an adverb that means 'in a valuable way' or 'in a way that provides benefit'. It is used to describe how an action or contribution is useful or important. Because it is not a very common word, it is more likely to be encountered in advanced texts or formal contexts. It is important to distinguish it from the adjective 'valuable', which describes something that has worth. For example, 'He contributed valuably to the project' means that his contribution was useful and important, while 'He is a valuable member of the team' means that he is a member who is considered to be important or useful."},"example_sentences":[{"sentence":"The research team valuably used the new data to improve their model.","translation":"研究チームは、新しいデータを貴重に活用してモデルを改善しました。","type":"adverb","meaning_category":"貴重に活用する"},{"sentence":"She valuably shared her insights during the meeting, leading to a breakthrough.","translation":"彼女は会議中に貴重な洞察を共有し、画期的な進展につながりました。","type":"adverb","meaning_category":"有益に共有する"},{"sentence":"The software update valuably improved the system's performance.","translation":"ソフトウェアのアップデートにより、システムのパフォーマンスが有益に向上しました。","type":"adverb","meaning_category":"有益に向上させる"}]}