{"word":"ante-Nicaean","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ニカイア公会議以前の","english_definition":"Of or pertaining to the period before the Council of Nicaea (325 AD).","examples":[{"sentence":"The ante-Nicaean Fathers are important sources for understanding early Christian theology.","translation":"ニカイア公会議以前の教父たちは、初期キリスト教神学を理解するための重要な情報源である。"}],"collocations":["ante-Nicaean Fathers","ante-Nicaean period","ante-Nicaean Christianity"],"synonyms":["pre-Nicene"],"antonyms":["post-Nicene","Nicaean"]}],"etymology":{"value":"\"ante-\" (before) + \"Nicaean\" (relating to Nicaea, the site of the Council of Nicaea).","priority":"★★★"},"pronunciation":{"ipa":"/ˌænti naɪˈsiːən/","syllables":"an-te-Ni-cae-an"},"inflection":{"notes":"This word does not inflect."},"usage_notes":{"explanation":"The term \"ante-Nicaean\" is primarily used in historical and theological contexts to refer to the period, people, and ideas that existed before the Council of Nicaea in 325 AD. This council was significant in establishing Christian doctrine, particularly regarding the nature of Jesus Christ.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ante-Nicene council...","correct":"✓ The ante-Nicaean period/fathers...","note":"There was no \"ante-Nicene council.\" The term refers to the time before the Council of Nicaea."}],"priority":"★★☆"},"related_words":{"derivatives":["Nicaea","Nicene","post-Nicene"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"ante-Nicaean\" is a specialized term used in the context of early Christian history and theology. It refers to the time period before the Council of Nicaea in 325 AD, a significant event in the development of Christian doctrine. Understanding this term requires familiarity with Christian history and theological concepts. It is not commonly used outside of academic or religious discussions. "},"example_sentences":[{"sentence":"The writings of the **ante-Nicaean** theologians provide valuable insights into the development of Christian thought.","translation":"ニカイア公会議以前の神学者たちの著作は、キリスト教思想の発展に関する貴重な洞察を提供する。","type":"adjective","meaning_category":"historical"},{"sentence":"The **ante-Nicaean** period was characterized by a diversity of theological viewpoints.","translation":"ニカイア公会議以前の時代は、多様な神学的視点が特徴であった。","type":"adjective","meaning_category":"historical"}]}