{"word":"dendrography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"樹木誌、樹木記述学","english_definition":"the description of trees.","examples":[{"sentence":"Dendrography is essential for understanding forest ecosystems.","translation":"樹木誌は森林生態系を理解する上で不可欠である。"},{"sentence":"The dendrography of the region is well-documented.","translation":"その地域の樹木誌はよく記録されている。"}],"collocations":["regional dendrography","comparative dendrography"],"synonyms":["dendrology","arboriculture"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'dendron' (δένδρον) meaning 'tree', and 'graphia' (γραφία) meaning 'description' or 'writing'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɛndˈrɒɡrəfi/","syllables":"den-dro-gra-phy"},"inflection":{"noun_plural":"dendrographies"},"usage_notes":{"explanation":"Dendrography is a descriptive science focused on the characteristics and classification of trees. It often involves detailed documentation of tree species, their distribution, and their ecological roles. It is related to dendrology, which is the broader scientific study of trees, and arboriculture, which is the cultivation of trees and shrubs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He studied dendrography to become a gardener.","correct":"✓ He studied arboriculture to become a gardener.","note":"Arboriculture is the practice of cultivating and managing trees, which is more directly related to gardening than dendrography, which is descriptive."}],"priority":"★☆☆"},"related_words":{"derivatives":["dendrographer (noun: a person who studies or writes about dendrography)"],"related_terms":["dendrology (noun: the scientific study of trees)","arboriculture (noun: the cultivation of trees and shrubs)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dendrography' is a specialized term referring to the description of trees, often used in ecological and botanical contexts. It involves detailed documentation and classification of tree species. The term is relatively rare in general usage, primarily appearing in academic or scientific literature related to forestry, botany, or ecology."},"example_sentences":[{"sentence":"The old book contained detailed dendrography of local tree species.","translation":"その古い本には、地元の樹木の詳細な樹木誌が記載されていた。","type":"general","meaning_category":"description of trees"},{"sentence":"Understanding dendrography helps in identifying different types of forests.","translation":"樹木誌を理解することは、さまざまな種類の森林を特定するのに役立つ。","type":"general","meaning_category":"description of trees"}]}