{"word":"polygamodioecious","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学) 雌雄異株と両性花を持つ個体が混在する植物の、または、雄株、雌株、両性花を持つ株が混在する植物の","english_definition":"(botany) Having some plants with only male flowers, some with only female flowers, and some with hermaphrodite flowers.","examples":[{"sentence":"The plant species is described as polygamodioecious.","translation":"その植物種は雌雄異株と両性花を持つと記述されている。"},{"sentence":"Polygamodioecious plants exhibit a complex reproductive strategy.","translation":"雌雄異株と両性花を持つ植物は複雑な繁殖戦略を示す。"}],"collocations":["polygamodioecious species","polygamodioecious plant","polygamodioecious population"],"synonyms":["subdioecious"],"antonyms":["dioecious","monoecious"]}],"etymology":{"value":"'poly-' (many) + 'gam(o)-' (sexual reproduction) + 'dioecious' (having male and female reproductive organs on separate plants).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒlɪˌɡæmədaɪˈiːʃəs/","syllables":"pol-y-gam-o-di-oe-cious"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Polygamodioecious' is a botanical term used to describe a specific type of plant reproductive system. It indicates that within a population of a plant species, there are some individual plants that bear only male flowers, some that bear only female flowers, and some that bear hermaphrodite (bisexual) flowers. This is a more complex system than either dioecy (where plants are strictly either male or female) or monoecy (where both male and female flowers occur on the same plant).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is polygamodioecious, so it can self-pollinate.","correct":"✓ The plant is polygamodioecious, so some individuals can self-pollinate, but others cannot.","note":"Only the hermaphrodite flowers can self-pollinate. Male and female flowers on separate plants require cross-pollination."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["dioecious","monoecious","polygamous","hermaphrodite","subdioecious"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"This word is highly specialized and primarily used in botanical contexts. Understanding requires knowledge of plant reproductive systems."},"example_sentences":[{"sentence":"The evolutionary advantage of being polygamodioecious is still debated among botanists.","translation":"雌雄異株と両性花を持つことの進化上の利点は、植物学者の間でまだ議論されている。","type":"general","meaning_category":"general"},{"sentence":"In a polygamodioecious species, the ratio of male, female, and hermaphrodite plants can vary greatly.","translation":"雌雄異株と両性花を持つ種では、雄株、雌株、両性花の比率が大きく異なる場合がある。","type":"example","meaning_category":"example"}]}