{"word":"De-funding","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"資金援助の停止、資金打ち切り","english_definition":"The act of withdrawing financial support from something, typically a government program or organization.","examples":[{"sentence":"The de-funding of the arts program led to its closure.","translation":"その芸術プログラムへの資金援助の停止は、閉鎖につながった。"},{"sentence":"There is a debate over the de-funding of the police department.","translation":"警察署への資金援助の停止について議論がある。"},{"sentence":"The university faced severe budget cuts and de-funding of several research projects.","translation":"その大学は深刻な予算削減といくつかの研究プロジェクトへの資金援助の停止に直面した。"}],"collocations":["de-funding of (something)"],"synonyms":["defunding","budget cuts","financial withdrawal","disinvestment"],"antonyms":["funding","investment","financial support","subsidization"]}],"etymology":{"value":"「de-」 (否定または除去) + 「funding」 (資金援助)","priority":"★★★"},"pronunciation":{"ipa":"/diːˈfʌndɪŋ/","syllables":"de-fund-ing"},"inflection":{"noun_plural":"de-fundings"},"usage_notes":{"explanation":"'De-funding' refers to the action of taking away financial resources. It is often used in political and economic contexts to describe the reduction or elimination of funding for specific programs, organizations, or initiatives. The term carries a negative connotation, suggesting a loss of support or resources.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The de-funding was happened suddenly.","correct":"✓ The de-funding happened suddenly.","note":"'De-funding' is a noun, so it should be used as the subject of the sentence, not as a verb. Use 'happened' as the verb."},{"incorrect":"✗ They are de-funding to the program.","correct":"✓ They are de-funding the program.","note":"When using 'de-funding' as a verb (though less common), it is transitive and requires a direct object. The preposition 'to' is not needed."}],"priority":"★★☆"},"related_words":{"derivatives":["defund (verb)","funded (adjective)","funding (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'De-funding' is a term used to describe the act of removing financial support from a program, organization, or initiative. It often implies a deliberate decision to reduce or eliminate funding, typically due to budgetary constraints, policy changes, or disagreements over the effectiveness or purpose of the entity being defunded. The term is commonly used in political and economic discussions. Understanding the context in which 'de-funding' is used is crucial, as it often carries significant implications for the affected parties."},"example_sentences":[{"sentence":"The community protested the de-funding of the local library.","translation":"地域住民は、地元の図書館への資金援助の停止に抗議した。","type":"noun","meaning_category":"資金援助の停止"},{"sentence":"The government announced the de-funding of several environmental projects.","translation":"政府は、いくつかの環境プロジェクトへの資金援助の停止を発表した。","type":"noun","meaning_category":"資金援助の停止"},{"sentence":"The de-funding decision was met with strong opposition from advocacy groups.","translation":"資金援助停止の決定は、擁護団体からの強い反対に遭った。","type":"noun","meaning_category":"資金援助の停止"}]}