{"word":"Poikilothermism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"変温性","english_definition":"The state of having a body temperature that varies with the temperature of the surrounding environment.","examples":[{"sentence":"Poikilothermism is a characteristic of reptiles and amphibians.","translation":"変温性は爬虫類と両生類の特徴です。"},{"sentence":"The degree of poikilothermism can vary among different species.","translation":"変温性の程度は種によって異なります。"}],"collocations":["exhibit poikilothermism","degree of poikilothermism","advantage of poikilothermism"],"synonyms":["cold-bloodedness","ectothermy"],"antonyms":["homeothermism","endothermy"]}],"etymology":{"value":"From Greek poikilos (varied) + therme (heat) + -ism (state, condition).","priority":"★★★"},"pronunciation":{"ipa":"/pɔɪˌkɪləˈθɜːrmɪzəm/","syllables":"poi-ki-lo-ther-mism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Poikilothermism refers to the biological characteristic of organisms whose internal temperature varies considerably. These organisms rely on external sources of heat to regulate their body temperature. It is often contrasted with homeothermism, the ability to maintain a stable internal body temperature.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Poikilothermism animals are always slow.","correct":"✓ Poikilothermic animals are often slow.","note":"Poikilothermism is a state or condition; poikilothermic is the adjective describing the animal. Also, while many poikilotherms have slower metabolisms, it's not universally true."}],"priority":"★★☆"},"related_words":{"derivatives":["poikilotherm (noun: a poikilothermic organism)","poikilothermic (adjective: having a variable body temperature)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Poikilothermism is a technical term used in biology to describe the condition of an organism whose internal body temperature varies significantly with environmental temperature. Understanding this term requires a background in biology or zoology. It's contrasted with homeothermism, which describes organisms that maintain a stable internal temperature. The concept is important in understanding the physiology and ecology of various animal groups, particularly reptiles, amphibians, and fish."},"example_sentences":[{"sentence":"The survival of poikilothermism animals in cold climates depends on behavioral adaptations.","translation":"変温性動物が寒冷地で生き残るには、行動適応が重要です。","type":"general","meaning_category":"general"},{"sentence":"Poikilothermism offers an energetic advantage in environments with limited resources.","translation":"変温性は、資源が限られた環境ではエネルギー的に有利です。","type":"advantage","meaning_category":"advantage"}]}