{"word":"vaccinization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ワクチン接種、予防接種","english_definition":"the act or process of vaccinating; inoculation with a vaccine to protect against a particular disease.","examples":[{"sentence":"The vaccinization program aimed to protect the population from the flu.","translation":"そのワクチン接種プログラムは、国民をインフルエンザから守ることを目的としていた。"},{"sentence":"Mass vaccinization is essential to control the spread of infectious diseases.","translation":"集団ワクチン接種は、感染症の蔓延を抑制するために不可欠である。"},{"sentence":"The government launched a vaccinization campaign to combat measles.","translation":"政府は麻疹と闘うためにワクチン接種キャンペーンを開始した。"}],"collocations":["mass vaccinization (集団ワクチン接種)","vaccinization program (ワクチン接種プログラム)","vaccinization campaign (ワクチン接種キャンペーン)","vaccinization rate (ワクチン接種率)","childhood vaccinization (小児ワクチン接種)"],"synonyms":["vaccination","immunization","inoculation"],"antonyms":[],"related_terms":["vaccine","vaccinate","immunize"]}],"etymology":{"value":"The word \"vaccinization\" is derived from \"vaccine,\" which comes from the Latin word \"vacca\" meaning \"cow.\" This is because the first vaccine, developed by Edward Jenner, used cowpox to protect against smallpox. The suffix \"-ization\" indicates the process or act of doing something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvæksɪnaɪˈzeɪʃən/","syllables":"vac-ci-ni-za-tion"},"inflection":{"noun_plural":"vaccinizations"},"usage_notes":{"explanation":"\"Vaccinization\" is often used interchangeably with \"vaccination\" and \"immunization.\" While all three terms refer to the process of conferring immunity to a disease, \"vaccination\" specifically refers to the administration of a vaccine, while \"immunization\" refers to the process by which a person becomes immune, which can occur through vaccination or exposure to the disease. \"Vaccinization\" emphasizes the process of administering the vaccine to a population or group.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The vaccinization is very important.","correct":"✓ Vaccinization is very important.","note":"\"Vaccinization\" is a noun, referring to the process itself. The article 'the' is not typically used unless referring to a specific, previously mentioned vaccinization program."},{"incorrect":"✗ He got a vaccinization for the flu.","correct":"✓ He got a vaccination for the flu.","note":"While 'vaccinization' refers to the process, 'vaccination' is more commonly used to refer to the act of receiving a vaccine."}],"priority":"★★☆"},"related_words":{"derivatives":["vaccinate (verb)","vaccine (noun)","immunization (noun)","immunize (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to global health events.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"vaccinization\" refers to the process of giving a vaccine to someone. It's a more formal term than \"vaccination\" but means essentially the same thing: the act of protecting someone from a disease by injecting them with a vaccine. You'll often see it used when talking about large-scale efforts to vaccinate a whole population.","priority":"★★☆"},"example_sentences":[{"sentence":"The success of the vaccinization campaign led to a significant decrease in cases of the disease.","translation":"ワクチン接種キャンペーンの成功により、その病気の症例数が大幅に減少した。","type":"general","meaning_category":"vaccination process"},{"sentence":"The government invested heavily in the vaccinization of its citizens.","translation":"政府は国民のワクチン接種に多額の投資を行った。","type":"general","meaning_category":"vaccination process"},{"sentence":"The vaccinization rate among children has improved in recent years.","translation":"子供たちのワクチン接種率は近年改善されている。","type":"statistics","meaning_category":"vaccination rate"}]}