{"word":"epistemology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"認識論、知識論","english_definition":"the theory of knowledge, especially with regard to its methods, validity, and scope. Epistemology is the investigation of what distinguishes justified belief from opinion.","examples":[{"sentence":"Epistemology is a branch of philosophy concerned with the nature and scope of knowledge.","translation":"認識論は、知識の性質と範囲に関わる哲学の一分野です。"},{"sentence":"The professor's lecture focused on different epistemological perspectives.","translation":"教授の講義は、さまざまな認識論的視点に焦点を当てていました。"},{"sentence":"One of the central questions in epistemology is how we can know anything at all.","translation":"認識論における中心的な問いの一つは、そもそもどのようにして何かを知ることができるのかということです。"}],"collocations":["theory of knowledge","epistemological inquiry","epistemological perspective","scope of knowledge","nature of knowledge"],"synonyms":["theory of knowledge","philosophy of knowledge"],"antonyms":["ontology","metaphysics"]}],"etymology":{"value":"Derived from the Greek words 'episteme' (knowledge) and 'logos' (reason/study).","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌpɪstəˈmɒlədʒi/","syllables":"e-pis-te-mol-o-gy"},"inflection":{"noun_plural":"epistemologies"},"usage_notes":{"explanation":"Epistemology is a branch of philosophy that studies the nature of knowledge, justification, and belief. It seeks to answer questions such as: What is knowledge? How is knowledge acquired? What can we know? How do we know what we know? What are the limits of knowledge? It is distinct from ontology (the study of being) and metaphysics (the study of reality).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a good epistemology about cars.","correct":"✓ He has a good understanding of cars.","note":"Epistemology is a formal area of philosophy, not a general term for understanding."},{"incorrect":"✗ Epistemology is the same as opinion.","correct":"✓ Epistemology is the study of justified belief, which is different from opinion.","note":"Epistemology distinguishes justified belief from mere opinion."}],"priority":"★★☆"},"related_words":{"derivatives":["epistemological (adjective)","epistemologist (noun)"],"phrases":["justified true belief","rationalism","empiricism","skepticism"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Epistemology' is a complex philosophical term referring to the study of knowledge. It involves examining what knowledge is, how we acquire it, and how we can differentiate between justified belief and mere opinion. This term is generally used in academic or philosophical contexts when discussing the nature and limits of human understanding."},"example_sentences":[{"sentence":"The course explored various approaches to epistemology, including rationalism and empiricism.","translation":"そのコースでは、合理主義や経験主義など、認識論へのさまざまなアプローチを探求しました。","type":"general","meaning_category":"study of knowledge"},{"sentence":"His epistemological stance is that knowledge is primarily derived from sensory experience.","translation":"彼の認識論的立場は、知識は主に感覚経験から得られるというものです。","type":"specific","meaning_category":"philosophical stance"},{"sentence":"The debate centered on the epistemological problem of how to justify our beliefs about the external world.","translation":"その議論は、外部世界についての私たちの信念をどのように正当化するかという認識論的な問題を中心に展開されました。","type":"complex","meaning_category":"philosophical problem"}]}