{"word":"remilitarizes","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再軍備する、再軍事化する","english_definition":"To militarize again; to restore military presence or capability to (a place or entity).","examples":[{"sentence":"The treaty forbade Germany from remilitarizing the Rhineland.","translation":"その条約はドイツがラインラントを再軍備することを禁じた。"},{"sentence":"The government is accused of remilitarizing the police force.","translation":"政府は警察を再軍事化していると非難されている。"}],"collocations":["remilitarize a zone","remilitarize a border","remilitarize the police"],"synonyms":["rearms","rebuilds military","restores military presence"],"antonyms":["demilitarizes","disarms"]}],"etymology":{"value":"The word is formed by adding the prefix \"re-\" (meaning again) to \"militarize\", which means to equip with military resources or to imbue with a military character.","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːˈmɪlɪtəraɪzɪz/","syllables":"re-mil-i-ta-ri-zes"},"inflection":{"verb_forms":{"present_simple":["remilitarizes"],"past_simple":"remilitarized","past_participle":"remilitarized","present_participle":"remilitarizing"}},"usage_notes":{"explanation":"'Remilitarizes' is used in the context of restoring military presence, capabilities, or characteristics to a place, entity, or organization after a period of demilitarization or disarmament. It often carries a negative connotation, implying a return to aggressive or hostile policies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country remilitarize after the war.","correct":"✓ The country remilitarized after the war.","note":"The past tense 'remilitarized' should be used to describe an action that happened in the past."},{"incorrect":"✗ Remilitarizes is a good thing for peace.","correct":"✓ Remilitarizing is not a good thing for peace.","note":"Remilitarization is often seen as a threat to peace, not a promoter of it."}],"priority":"★★☆"},"related_words":{"derivatives":["remilitarization (noun)","remilitarized (adjective)","militarize (verb)","militarization (noun)","military (adjective, noun)"],"phrases":["arms race","military build-up","security dilemma"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'remilitarizes' is a relatively complex term used in political and military contexts. It refers to the act of restoring military capabilities or presence to an area or entity, often after a period of demilitarization. Understanding this word requires familiarity with concepts of international relations, military strategy, and historical conflicts."},"example_sentences":[{"sentence":"The international community condemned the country's decision to remilitarize its border region.","translation":"国際社会は、その国が国境地域を再軍備するという決定を非難した。","type":"general"},{"sentence":"The remilitarizes of the island chain raised concerns among neighboring nations.","translation":"その島嶼の再軍事化は、近隣諸国の間で懸念を引き起こした。","type":"political"},{"sentence":"The treaty explicitly forbade the remilitarizes of the demilitarized zone.","translation":"その条約は、非武装地帯の再軍備を明示的に禁じていた。","type":"legal"}]}