{"word":"pulvination","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学) 葉や花弁が日没時に垂れ下がり、夜明けに再び立ち上がる現象、就眠運動","english_definition":"The diurnal (day/night) movement of plant leaves or petals, drooping at night and rising again in the morning; also known as nyctinasty.","examples":[{"sentence":"Pulvination is a common adaptation in plants to conserve water and protect against temperature extremes.","translation":"就眠運動は、植物が水分を節約し、極端な温度から身を守るための一般的な適応です。"},{"sentence":"The bean plant exhibits clear pulvination, with its leaves folding downwards each evening.","translation":"インゲン豆は明瞭な就眠運動を示し、葉は毎晩下向きに折り畳まれます。"}],"collocations":["exhibit pulvination","observe pulvination","nyctinastic movement","leaf pulvination"],"synonyms":["nyctinasty","sleep movement","diurnal leaf movement"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'pulvinus,' meaning 'cushion' or 'pillow.' This refers to the swollen base of the leaf or leaflet stalk (petiole or petiolule) called the pulvinus, which is responsible for the movement.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpʌlvɪˈneɪʃən/","syllables":"pul-vi-na-tion"},"inflection":{"noun_plural":"pulvinations"},"usage_notes":{"explanation":"Pulvination is a biological phenomenon primarily observed in plants, where leaves or petals undergo diurnal movements, typically drooping at night and rising during the day. This movement is controlled by specialized structures called pulvini, located at the base of the leaf or leaflet stalk. The term is often used interchangeably with 'nyctinasty,' although pulvination specifically refers to the mechanism involving pulvini.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant's pulvination is due to gravity.","correct":"✓ The plant's pulvination is due to changes in turgor pressure within the pulvinus.","note":"Pulvination is not caused by gravity but by changes in turgor pressure within the cells of the pulvinus. "},{"incorrect":"✗ Pulvination only occurs in tropical plants.","correct":"✓ Pulvination can occur in various plant species across different climates.","note":"While common in some tropical species, pulvination is not limited to tropical plants and can be found in plants from various climates."}],"priority":"★★☆"},"related_words":{"derivatives":["pulvinus (noun: a swollen motor organ at the base of a plant leaf or leaflet)","nyctinastic (adjective: relating to nyctinasty)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pulvination' is a specialized botanical term referring to the day/night movements of plant leaves or petals, controlled by a structure called the pulvinus. This is an advanced term typically encountered in botany or plant physiology contexts. Understanding requires familiarity with plant anatomy and physiology.","priority":"★★☆"},"example_sentences":[{"sentence":"The sensitive plant is well-known for its rapid pulvination response to touch.","translation":"オジギソウは、触覚に対する迅速な就眠運動反応でよく知られています。","type":"noun","meaning_category":"botany"},{"sentence":"Research suggests that pulvination may help plants reduce water loss during the night.","translation":"研究によると、就眠運動は植物が夜間の水分損失を減らすのに役立つ可能性があることが示唆されています。","type":"noun","meaning_category":"botany"},{"sentence":"The rhythmic pulvination of clover leaves is a fascinating example of plant adaptation.","translation":"クローバーの葉のリズミカルな就眠運動は、植物の適応の魅力的な例です。","type":"noun","meaning_category":"botany"}]}