{"word":"golden-toned","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"金色がかった色合いの、黄金色の色調の","english_definition":"having a color or tone reminiscent of gold; having a golden hue or quality.","examples":[{"sentence":"The sunset cast a golden-toned light over the landscape.","translation":"夕日は、風景に金色がかった光を投げかけた。"},{"sentence":"She admired the golden-toned furniture in the antique shop.","translation":"彼女はアンティークショップで金色がかった色調の家具に見とれた。"},{"sentence":"The photograph had a warm, golden-toned quality.","translation":"その写真には、温かく、黄金色の色調があった。"}],"collocations":["golden-toned skin (金色がかった肌)","golden-toned hair (金色がかった髪)","golden-toned light (金色がかった光)","golden-toned photograph (金色がかった写真)","golden-toned sunset (金色がかった夕焼け)"],"synonyms":["gold-colored","gilded","auric","yellowish-gold","gold-tinged"],"antonyms":["silver-toned","gray-toned","pale","dull"],"notes":"Often used to describe light, skin, hair, or photographs."}],"etymology":{"value":"Combination of 'golden' (related to gold) and 'toned' (having a particular tone or color).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡoʊldən toʊnd/","syllables":"gol-den-toned"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more golden-toned, most golden-toned)."},"usage_notes":{"explanation":"'Golden-toned' is used to describe something that has a color or quality similar to gold. It often implies warmth, richness, and a pleasant aesthetic quality. It is commonly used to describe visual elements like light, skin, hair, or photographs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The golden tone sunset was beautiful.","correct":"✓ The golden-toned sunset was beautiful.","note":"'Golden-toned' is a compound adjective, so it should be hyphenated when used before a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["golden (adjective)","tone (noun)","tonality (noun)"],"related_terms":["golden hour (写真における日の出直後と日の入り直前の時間帯)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but understandable in context.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Golden-toned' is a descriptive adjective used to convey a visual impression of something that has a color or quality resembling gold. It is generally understood in contexts describing visual arts, photography, or descriptions of physical appearances. The word is not commonly used in everyday conversation but is readily understood by native speakers."},"example_sentences":[{"sentence":"The artist used a golden-toned glaze to give the painting a warm glow.","translation":"画家は、絵に温かい輝きを与えるために、金色がかった釉薬を使用した。","type":"adjective","meaning_category":"describing color"},{"sentence":"Her golden-toned skin was the result of many hours spent in the sun.","translation":"彼女の金色がかった肌は、太陽の下で何時間も過ごした結果だった。","type":"adjective","meaning_category":"describing skin"},{"sentence":"The photographer preferred to shoot during the golden hour to capture the golden-toned light.","translation":"写真家は、金色がかった光を捉えるために、ゴールデンアワーに撮影することを好んだ。","type":"adjective","meaning_category":"describing light"}]}