{"word":"incontraction","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A word or phrase that is not a contraction.","english_definition":"A word or phrase that is not formed by shortening and combining two or more words, typically by omitting one or more letters and replacing them with an apostrophe.","examples":[{"sentence":"\"Cannot\" is an incontraction, while \"can't\" is a contraction.","translation":"「Cannot」は短縮形ではない単語ですが、「can't」は短縮形です。"},{"sentence":"The teacher asked the students to identify the incontractions in the text.","translation":"先生は生徒たちに、テキスト中の短縮形ではない単語を特定するように求めました。"}],"collocations":["identify an incontraction","recognize an incontraction","list incontractions","distinguish between contractions and incontractions"],"synonyms":["full form","uncontracted form"],"antonyms":["contraction"]}],"etymology":{"value":"Formed by adding the prefix \"in-\" (meaning \"not\") to the word \"contraction.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnkənˈtrækʃən/","syllables":"in-con-trac-tion"},"inflection":{"noun_plural":"incontractions"},"usage_notes":{"explanation":"\"Incontraction\" is primarily used in linguistic contexts, especially when discussing grammar, morphology, or language analysis. It serves as a technical term to differentiate between full, unshortened forms of words and their contracted counterparts. It is less common in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The word 'it's' is an incontraction.","correct":"✓ The word 'it's' is a contraction.","note":"Ensure you correctly identify contractions (shortened forms with apostrophes) versus incontractions (full, unshortened forms)."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["contraction","apostrophe","morphology","linguistics"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Incontraction\" is a term used in grammar and linguistics to describe a word that is not a contraction. A contraction is a shortened form of a word or phrase, where letters are omitted and replaced with an apostrophe (e.g., \"can't\" for \"cannot\"). Therefore, an incontraction is the full, unshortened form (e.g., \"cannot\"). This term is more likely to be encountered in academic or educational contexts related to language study."},"example_sentences":[{"sentence":"The essay required students to differentiate between contractions and incontractions.","translation":"そのエッセイでは、学生は短縮形と非短縮形を区別する必要がありました。","type":"noun","meaning_category":"grammar"},{"sentence":"An incontraction is the full form of a word before it's shortened.","translation":"非短縮形とは、単語が短縮される前の完全な形のことです。","type":"noun","meaning_category":"linguistics"}]}