{"word":"Homocercality","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(魚類の)尾びれが上下対称であること、同尾性","english_definition":"The state or condition of having a homocercal tail (a tail fin that is symmetrical externally, with the vertebral column not extending into the upper lobe).","examples":[{"sentence":"The teleost fishes exhibit homocercality, which allows for greater speed and maneuverability.","translation":"真骨魚類は同尾性を示し、それによってより大きな速度と操縦性を可能にする。"}],"collocations":["exhibit homocercality","possess homocercality"],"synonyms":["homocercal tail","symmetrical tail fin"],"antonyms":["heterocercality"]},{"part_of_speech":"noun","definition":"同尾類の特性","english_definition":"The characteristic of having a homocercal tail.","examples":[{"sentence":"Homocercality is an adaptation that evolved in more advanced fish species.","translation":"同尾性は、より進化した魚種で進化した適応である。"}],"collocations":["evolution of homocercality","advantages of homocercality"],"synonyms":["homocercal condition","homocercal nature"],"antonyms":["heterocercal condition"]}],"etymology":{"value":"Derived from 'homocercal,' which comes from the Greek words 'homos' (same) and 'cercal' (tail), plus the suffix '-ity' indicating a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"ˌhoʊmoʊsərˈkælɪti","syllables":"ho-mo-cer-cal-i-ty"},"inflection":{"noun_plural":"homocercalities"},"usage_notes":{"explanation":"'Homocercality' is a technical term used primarily in zoology and ichthyology (the study of fish). It describes the condition where a fish's tail fin is symmetrical in appearance, with the vertebral column ending at the base of the tail rather than extending into one of the lobes. This type of tail provides greater efficiency in swimming and maneuverability compared to heterocercal tails, which are asymmetrical.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fish has heterocercality, meaning its tail is symmetrical.","correct":"✓ The fish has homocercality, meaning its tail is symmetrical.","note":"Make sure to use the correct term. Heterocercality refers to an asymmetrical tail, while homocercality refers to a symmetrical tail."}],"priority":"★★☆"},"related_words":{"derivatives":["homocercal (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a specialized term used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Homocercality' is a highly specialized term used in the field of zoology, specifically when describing the tail structure of fish. It refers to the condition of having a symmetrical tail fin, where the vertebral column does not extend into either lobe of the tail. Understanding this term requires a background in biology or zoology. It is not commonly used outside of scientific or academic contexts."},"example_sentences":[{"sentence":"The evolution of **homocercality** in teleosts was a key factor in their diversification.","translation":"真骨魚類における**同尾性**の進化は、彼らの多様化の重要な要因であった。","type":"noun","meaning_category":"symmetry of tail fin"},{"sentence":"**Homocercality** allows for more efficient swimming compared to the heterocercal tail found in sharks.","translation":"**同尾性**は、サメに見られる異尾に比べて、より効率的な遊泳を可能にする。","type":"noun","meaning_category":"symmetry of tail fin"}]}