{"word":"cosmocrat","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"世界主義者、世界市民の支持者","english_definition":"An advocate of cosmocracy; a supporter of world government or global citizenship.","examples":[{"sentence":"He envisions a future ruled by cosmocrats, where national boundaries are irrelevant.","translation":"彼は国家の境界が無意味な、世界主義者によって統治される未来を思い描いている。"},{"sentence":"Cosmocrats believe in global cooperation and shared responsibility for the planet.","translation":"世界主義者は、地球に対する国際協力と責任の共有を信じている。"}],"collocations":["global cosmocrat","idealistic cosmocrat","future cosmocrat"],"synonyms":["world citizen","globalist","universalist"],"antonyms":["nationalist","isolationist","patriot"]}],"etymology":{"value":"Derived from \"cosmo-\" (referring to the cosmos or world) and \"-crat\" (referring to a ruler or advocate of a particular form of government).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɒzməkræt/","syllables":"cos-mo-crat"},"inflection":{"noun_plural":"cosmocrats"},"usage_notes":{"explanation":"The term \"cosmocrat\" is often used in political philosophy and discussions about global governance. It implies a belief in transcending national interests for the greater good of humanity and the planet.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a cosmocrat of France.","correct":"✓ He is a cosmocrat.","note":"Cosmocrats are not tied to a specific nation; they advocate for a global perspective."}],"priority":"★★☆"},"related_words":{"derivatives":["cosmocracy (noun: 世界政府、世界統治)","cosmocratic (adjective: 世界主義の、世界統治の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"cosmocrat\" is a relatively rare term, primarily used in political and philosophical discussions concerning global governance and world citizenship. It suggests a perspective that prioritizes the interests of the entire world over individual nations. Understanding this term requires familiarity with concepts of globalism and political ideologies.","priority":"★★☆"},"example_sentences":[{"sentence":"The conference brought together cosmocrats from various fields to discuss global challenges.","translation":"その会議には、さまざまな分野の世界主義者が集まり、地球規模の課題について話し合った。","type":"noun","meaning_category":"世界主義者"},{"sentence":"Cosmocrats argue that global problems require global solutions.","translation":"世界主義者は、地球規模の問題には地球規模の解決策が必要だと主張する。","type":"noun","meaning_category":"世界主義者"}]}