{"word":"hypokinetic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"運動低下の、運動減少性の","english_definition":"Relating to or characterized by decreased motor function or activity.","examples":[{"sentence":"Hypokinetic disorders are often associated with Parkinson's disease.","translation":"運動低下症候群は、しばしばパーキンソン病と関連付けられます。"},{"sentence":"The patient exhibited hypokinetic symptoms, including slow movement and rigidity.","translation":"患者は、緩慢な動きと硬直を含む運動低下の症状を示しました。"}],"collocations":["hypokinetic disorder","hypokinetic symptoms","hypokinetic state"],"synonyms":["bradykinetic","akinetic"],"antonyms":["hyperkinetic"],"related_medical_terms":["Parkinson's disease","bradykinesia","akinesia","rigidity"],"field_of_application":["neurology","medicine","physiology"]}],"etymology":{"value":"From the Greek words 'hypo-' (meaning 'under' or 'below') and 'kinetic' (meaning 'relating to motion').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊkɪˈnɛtɪk/","syllables":"hy-po-ki-net-ic"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are 'more hypokinetic' and 'most hypokinetic', respectively, although these are not commonly used."},"usage_notes":{"explanation":"'Hypokinetic' describes a condition or state characterized by reduced movement or motor activity. It is frequently used in the context of neurological disorders, particularly those affecting the basal ganglia, such as Parkinson's disease. The term emphasizes the reduction in movement, as opposed to 'hyperkinetic', which indicates excessive movement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The patient is hypokinetic, so they should exercise more vigorously.","correct":"The patient is hypokinetic, so they should engage in carefully monitored and tailored exercises to improve motor function.","note":"While exercise is often beneficial, the approach for hypokinetic patients needs to be carefully managed and tailored to their specific condition. Vigorous exercise might not be appropriate initially."},{"incorrect":"Hypokinetic means the same as paralyzed.","correct":"Hypokinetic means reduced movement, while paralysis means complete loss of movement.","note":"Hypokinesia is a reduction in movement, not a complete absence of it, which is paralysis."}],"priority":"★★☆"},"related_words":{"derivatives":["hypokinesia (noun: reduced movement or motor activity)"],"antonyms":["hyperkinetic (adjective: characterized by excessive movement)","hyperkinesia (noun: excessive movement or motor activity)"],"related_terms":["akinesia (noun: complete loss of movement)","bradykinesia (noun: slowness of movement)"]},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hypokinetic' is a specialized medical term used to describe a condition characterized by reduced or decreased movement. It is often used in the context of neurological disorders, particularly those affecting motor function. Understanding this term requires a basic knowledge of medical terminology and physiology. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"Deep brain stimulation can sometimes alleviate hypokinetic symptoms in Parkinson's patients.","translation":"脳深部刺激療法は、パーキンソン病患者の運動低下症状を緩和することがあります。","type":"adjective","meaning_category":"medical"},{"sentence":"The study investigated the effects of a new drug on hypokinetic gait patterns.","translation":"その研究は、新しい薬が運動低下歩行パターンに及ぼす影響を調査しました。","type":"adjective","meaning_category":"medical"}]}