{"word":"Catoquina","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Pharmacology) A proprietary name for a drug containing hyoscyamine, scopolamine, and atropine, used as an antispasmodic and anticholinergic.","english_definition":"A proprietary name for a drug containing hyoscyamine, scopolamine, and atropine, used as an antispasmodic and anticholinergic.","examples":[{"sentence":"The doctor prescribed Catoquina to alleviate the patient's abdominal cramps.","translation":"医師は患者の腹部痙攣を緩和するためにカトキーナを処方した。"}],"collocations":["prescribe Catoquina","take Catoquina","Catoquina dosage"],"synonyms":["antispasmodic","anticholinergic"],"antonyms":[]}],"etymology":{"value":"Likely a constructed name by the pharmaceutical company, possibly combining elements to suggest its function or ingredients.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌkætoʊˈkwaɪnə/","syllables":"Ca-to-qui-na"},"inflection":{"noun_plural":"Catoquinas"},"usage_notes":{"explanation":"Catoquina is a brand name, so its usage is primarily in medical contexts or when referring to the specific medication. It's important to note that medications with similar compositions might be available under different brand names or as generic drugs.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I take catoquina for headaches.","correct":"✓ I take catoquina for abdominal cramps.","note":"Catoquina is primarily used for gastrointestinal issues, not headaches."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["hyoscyamine","scopolamine","atropine","anticholinergic","antispasmodic"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Catoquina' is a specialized term primarily encountered in medical or pharmaceutical contexts. Understanding its usage requires familiarity with pharmacology and drug classifications. It's not a word commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The patient reported relief from intestinal spasms after taking Catoquina.","translation":"患者はカトキーナ服用後、腸の痙攣が緩和されたと報告した。","type":"noun","meaning_category":"Medication"},{"sentence":"Catoquina contains a combination of anticholinergic agents.","translation":"カトキーナは抗コリン作用薬の組み合わせを含む。","type":"noun","meaning_category":"Medication Composition"}]}