{"word":"front-illuminated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"前面照明の、フロントライト式の","english_definition":"Lit from the front; having a light source positioned in front of the subject or object being viewed.","examples":[{"sentence":"The e-reader used a front-illuminated display, making it easy to read in the dark.","translation":"その電子書籍リーダーはフロントライト式のディスプレイを採用しており、暗闇でも読みやすかった。"},{"sentence":"Unlike backlit screens, front-illuminated displays direct light onto the screen's surface.","translation":"バックライト式の画面とは異なり、フロントライト式のディスプレイは光を画面の表面に当てます。"}],"collocations":["front-illuminated display (フロントライト式ディスプレイ)","front-illuminated screen (フロントライト式画面)"],"synonyms":["frontlit"],"antonyms":["backlit","edge-lit"]},{"part_of_speech":"adjective","definition":"(写真撮影で)被写体の正面から照明を当てられた","english_definition":"(In photography) illuminated by a light source placed in front of the subject.","examples":[{"sentence":"The portrait was taken with a front-illuminated flash.","translation":"そのポートレートは、被写体の正面からフラッシュを当てて撮影された。"}],"collocations":["front-illuminated photograph (正面照明で撮影された写真)"],"synonyms":["frontlit"],"antonyms":["backlit"]}],"etymology":{"value":"「front」（正面）と「illuminated」（照らされた）の複合語。","priority":"☆☆☆"},"pronunciation":{"ipa":null,"syllables":"front-il-lu-mi-nat-ed"},"inflection":{},"usage_notes":{"explanation":"「front-illuminated」は、主に電子書籍リーダーのディスプレイ技術や写真撮影の照明方法を説明する際に使用されます。電子書籍リーダーの場合、バックライト式（backlit）とは異なり、画面の表面に光を当てる方式を指します。写真撮影では、被写体の正面から光を当てる照明方法を意味します。","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["illumination (照明)","illuminate (照らす)"],"related_terms":["backlit","edge-lit"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'front-illuminated' is technical and primarily used in the context of display technology (especially e-readers) and photography. It describes a method of lighting where the light source is positioned in front of the object or subject, rather than behind it (backlit) or from the edges (edge-lit). Understanding this term requires familiarity with these technologies."},"example_sentences":[{"sentence":"The new e-reader features a front-illuminated screen for comfortable reading in any lighting conditions.","translation":"新しい電子書籍リーダーは、どんな照明条件でも快適に読書ができるように、フロントライト式の画面を備えています。","type":"adjective","meaning_category":"前面照明の"},{"sentence":"The photographer used a front-illuminated setup to minimize shadows on the model's face.","translation":"写真家は、モデルの顔の影を最小限に抑えるために、正面照明のセットアップを使用しました。","type":"adjective","meaning_category":"写真撮影で"}]}