{"word":"engine-focused","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"エンジンに特化した、エンジン中心の、エンジンに重点を置いた","english_definition":"Concentrating on or primarily related to engines; having engines as the main focus.","examples":[{"sentence":"The company is engine-focused, designing and manufacturing high-performance engines for various applications.","translation":"その会社はエンジンに特化しており、様々な用途向けの高性能エンジンを設計・製造しています。"},{"sentence":"The new curriculum is engine-focused, providing students with in-depth knowledge of engine technology.","translation":"新しいカリキュラムはエンジン中心であり、学生にエンジン技術に関する深い知識を提供します。"},{"sentence":"The research project is engine-focused, aiming to improve the efficiency and reduce the emissions of internal combustion engines.","translation":"その研究プロジェクトはエンジンに重点を置いており、内燃機関の効率を改善し、排出量を削減することを目指しています。"}],"collocations":["engine-focused design (エンジンに特化した設計)","engine-focused research (エンジンに重点を置いた研究)","engine-focused company (エンジン中心の会社)","engine-focused curriculum (エンジンに特化したカリキュラム)","engine-focused approach (エンジンに重点を置いたアプローチ)"],"synonyms":["engine-centric","engine-oriented","engine-specific","engine-related","engine-based"],"antonyms":["general","broad","holistic","system-wide"]}],"etymology":{"value":"The term 'engine-focused' is a compound adjective formed by combining the noun 'engine' with the past participle 'focused'. It describes something that has a primary or central emphasis on engines.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛndʒɪn ˈfoʊkəst/","syllables":"en-gine-fo-cused"},"inflection":{"notes":"Adjective, no specific inflections"},"usage_notes":{"explanation":"'Engine-focused' is used to describe projects, companies, curricula, or approaches that primarily concentrate on engines. It implies a specialized or dedicated focus on engine technology, design, manufacturing, or research. The term is commonly used in engineering, manufacturing, and automotive contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is focus on engine.","correct":"✓ The company is engine-focused. / ✓ The company is focused on engines.","note":"The correct phrase is 'engine-focused' or 'focused on engines'. Using 'focus on engine' is grammatically incorrect."},{"incorrect":"✗ The engine focus design.","correct":"✓ The engine-focused design.","note":"When using 'engine-focused' as an adjective before a noun, it should be hyphenated to indicate that it's a compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["focus","focused","engine"],"related_terms":["engine","internal combustion engine","engine technology","engine design","engine manufacturing","engine research"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'engine-focused' is a specialized adjective used to describe something that is primarily concerned with or centered around engines. It is commonly found in technical or engineering contexts where the emphasis is on engine technology, design, or performance. Understanding this term requires familiarity with technical language and the concept of specialization within a particular field.","priority":"★★☆"},"example_sentences":[{"sentence":"The startup is developing an engine-focused AI solution for optimizing fuel efficiency.","translation":"そのスタートアップは、燃料効率を最適化するためのエンジンに特化したAIソリューションを開発しています。","type":"adjective","meaning_category":"エンジンに特化した"},{"sentence":"The university offers an engine-focused degree program in mechanical engineering.","translation":"その大学は、機械工学におけるエンジンに重点を置いた学位プログラムを提供しています。","type":"adjective","meaning_category":"エンジンに重点を置いた"},{"sentence":"The company's engine-focused strategy has led to significant advancements in engine technology.","translation":"その会社のエンジン中心の戦略は、エンジン技術における著しい進歩をもたらしました。","type":"adjective","meaning_category":"エンジン中心の"}]}