{"word":"nonpartner","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"パートナーではない人、提携関係にない人","english_definition":"A person who is not a partner, especially in a business or romantic relationship.","examples":[{"sentence":"As a nonpartner, he didn't have the same level of access to company information.","translation":"非パートナーとして、彼は会社情報へのアクセスレベルが同じではありませんでした。"},{"sentence":"The event was open to partners and nonpartners alike.","translation":"イベントはパートナーと非パートナーの両方に開放されていました。"},{"sentence":"She clarified that she was attending as a nonpartner, not representing any specific organization.","translation":"彼女は特定の組織を代表するのではなく、非パートナーとして参加することを明らかにしました。"}],"collocations":["potential nonpartner","current nonpartner","former nonpartner","associate nonpartner","business nonpartner","romantic nonpartner"],"synonyms":["unaffiliated","independent","outsider","non-member","non-associate"],"antonyms":["partner","associate","affiliate","member"]},{"part_of_speech":"adjective","definition":"パートナーシップの一部ではない、提携関係にない","english_definition":"Not being part of a partnership or alliance.","examples":[{"sentence":"The nonpartner companies were invited to bid on the project.","translation":"提携関係にない企業は、プロジェクトへの入札に招待されました。"},{"sentence":"We need to consider the impact on both partner and nonpartner organizations.","translation":"パートナー組織と非パートナー組織の両方への影響を考慮する必要があります。"},{"sentence":"The nonpartner status allowed them greater flexibility in their business dealings.","translation":"非パートナーのステータスにより、ビジネス取引においてより大きな柔軟性が得られました。"}],"collocations":["nonpartner company","nonpartner organization","nonpartner status","nonpartner agreement","nonpartner vendor","nonpartner client"],"synonyms":["unaffiliated","independent","non-associated","external","third-party"],"antonyms":["partnered","affiliated","associated","internal"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'partner'.","priority":"★★★"},"pronunciation":{"ipa":"/nɒnˈpɑːrtnər/","syllables":"non-part-ner"},"inflection":{"noun_plural":"nonpartners"},"usage_notes":{"explanation":"'Nonpartner' is a straightforward term used to describe someone or something that is not part of a partnership. The context usually clarifies whether it refers to a business, romantic, or other type of partnership. It is often used in contrast to 'partner' to distinguish between those who are part of a formal or informal agreement and those who are not.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non-partner of the company.","correct":"✓ He is a nonpartner in the company. / ✓ He is not a partner in the company.","note":"While 'nonpartner of the company' is understandable, it's more common to use 'nonpartner in the company' or simply state that someone 'is not a partner' in the company."},{"incorrect":"✗ The non-partner agreement was signed.","correct":"✓ The nonpartner agreement was signed.","note":"Hyphenation is generally not required for compound words formed with 'non-' unless it's followed by a proper noun or creates ambiguity."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["partner","partnership","associate","affiliate","member","outsider"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'nonpartner' is relatively straightforward. It simply means 'not a partner'. The difficulty might arise in understanding the specific context of the partnership being referred to (e.g., business, romantic, etc.). It's useful to understand the meaning of 'partner' itself to fully grasp the meaning of 'nonpartner'. The word is more common in business and formal contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The company invited both partners and nonpartners to the conference.","translation":"会社はパートナーと非パートナーの両方を会議に招待しました。","type":"noun","meaning_category":"General"},{"sentence":"As a nonpartner, she did not receive profit sharing.","translation":"非パートナーとして、彼女は利益分配を受けませんでした。","type":"noun","meaning_category":"Business"},{"sentence":"The nonpartner organizations collaborated on the project.","translation":"非パートナー組織がプロジェクトで協力しました。","type":"adjective","meaning_category":"General"},{"sentence":"The nonpartner status allowed the company to maintain its independence.","translation":"非パートナーのステータスにより、会社は独立性を維持することができました。","type":"adjective","meaning_category":"Business"}]}