{"word":"practicum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"実習、実地研修","english_definition":"a college or university course, often in a professional field, that provides students with supervised practical experience.","examples":[{"sentence":"She completed a practicum at the local hospital as part of her nursing program.","translation":"彼女は看護プログラムの一環として、地元の病院で実習を修了しました。"},{"sentence":"The education students are required to complete a practicum in a classroom setting.","translation":"教育学部の学生は、教室環境での実習を修了する必要があります。"},{"sentence":"His practicum involved working with children with special needs.","translation":"彼の実習は、特別なニーズを持つ子供たちとの活動を含んでいました。"}],"collocations":["complete a practicum","participate in a practicum","clinical practicum","teaching practicum","social work practicum"],"synonyms":["internship","apprenticeship","clinical placement","fieldwork","training program"],"antonyms":[]}],"etymology":{"value":"Late Latin, from Greek *praktikos* (practical) + *-um* (suffix forming nouns).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpræktɪkəm/","syllables":"prac-ti-cum"},"inflection":{"noun_plural":"practicums or practica"},"usage_notes":{"explanation":"A \"practicum\" is a specific type of educational experience that emphasizes hands-on learning and practical application of theoretical knowledge. It's commonly found in professional fields like education, nursing, social work, and counseling. The key difference between a practicum and a general internship is that a practicum is usually a required component of a formal academic program and is closely supervised by both the educational institution and the placement site. The goal is to provide students with a structured and supported environment in which to develop their professional skills.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I did a practice at the hospital.","correct":"✓ I did a practicum at the hospital.","note":"\"Practice\" refers to the general act of doing something repeatedly to improve, while \"practicum\" is a specific, structured educational experience."},{"incorrect":"✗ He's doing an internship, it's the same as a practicum.","correct":"✓ He's doing an internship, but it might not be as structured or supervised as a practicum.","note":"While both involve practical experience, a practicum is typically more closely tied to an academic program and has more formal supervision."}],"priority":"★★☆"},"related_words":{"derivatives":["practical","practice","practitioner"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"practicum\" refers to a specific type of educational experience where students gain practical skills in their field of study under supervision. It is most often used in professional programs like nursing, teaching, or social work. Because it is a specialized term, it is not commonly used outside of academic or professional contexts."},"example_sentences":[{"sentence":"The counseling program requires students to complete a 600-hour practicum.","translation":"カウンセリングプログラムでは、学生は600時間の実習を修了する必要があります。","type":"noun","meaning_category":"実習"},{"sentence":"During her practicum, she learned how to effectively manage a classroom.","translation":"彼女は実習中に、効果的に教室を運営する方法を学びました。","type":"noun","meaning_category":"実習"},{"sentence":"The social work practicum provides students with valuable experience in community outreach.","translation":"ソーシャルワークの実習は、学生に地域社会へのアウトリーチにおける貴重な経験を提供します。","type":"noun","meaning_category":"実習"}]}