{"word":"pre-enclosure","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"囲い込み以前の、囲い込み運動以前の","english_definition":"Relating to the period before the enclosure movement, especially in England.","examples":[{"sentence":"The pre-enclosure landscape was characterized by open fields and common land.","translation":"囲い込み以前の景観は、開放耕地と共有地によって特徴づけられていた。"},{"sentence":"Pre-enclosure agricultural practices relied heavily on communal farming.","translation":"囲い込み以前の農業慣行は、共同農業に大きく依存していた。"}],"collocations":["pre-enclosure landscape","pre-enclosure farming","pre-enclosure society"],"synonyms":["pre-industrial","pre-modern"],"antonyms":["post-enclosure"],"notes":"This term primarily refers to the historical period in England before the widespread enclosure of common lands."}],"etymology":{"value":"Derived from the prefix 'pre-' (before) and the noun 'enclosure' (the act of enclosing land).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːɪnˈkloʊʒər/","syllables":"pre-en-clo-sure"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'pre-enclosure' is used to describe conditions, practices, or landscapes that existed before the enclosure movement, particularly in England. This movement involved the privatization of common lands, which had significant social and economic impacts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pre-enclosure was a time of great prosperity.","correct":"✓ The pre-enclosure period was a time of great prosperity for some.","note":"'Pre-enclosure' is an adjective, so it needs to modify a noun. Using it as a noun is incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["enclosure","enclosed"],"related_terms":["enclosure movement","common land","open field system"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in historical or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pre-enclosure' is a specialized term used in historical and academic contexts, particularly when discussing the enclosure movement in England. It describes conditions or practices that existed before the privatization of common lands. Understanding this term requires familiarity with historical context and economic concepts."},"example_sentences":[{"sentence":"The study examined the social structures of pre-enclosure villages.","translation":"その研究は、囲い込み以前の村落の社会構造を調査した。","type":"adjective","meaning_category":"囲い込み以前の"},{"sentence":"Pre-enclosure farming methods were less efficient than those that followed.","translation":"囲い込み以前の農業方法は、その後に続いた方法よりも効率が悪かった。","type":"adjective","meaning_category":"囲い込み以前の"}]}