{"word":"synemmenon","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical, music theory) In ancient Greek music theory, a conjunct tetrachord.","english_definition":"In ancient Greek music theory, a conjunct tetrachord.","examples":[{"sentence":"The synemmenon was one of the three genera of tetrachords in the Greek system.","translation":"シュネメンノンは、ギリシャの音楽体系におけるテトラコードの3つの属のうちの1つでした。","note":"Translation provided for context, as this is a technical term."}],"collocations":["tetrachord synemmenon","genus synemmenon"],"synonyms":["conjunct tetrachord"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek συνεμμένον (sunemménon), neuter form of συνεμμένος (sunemménos, “joined together, conjunct”), past participle of συνάπτω (sunáptō, “I join together”).","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˈnɛmənɒn/","syllables":"sy-nem-me-non"},"inflection":{"noun_plural":"synemmena"},"usage_notes":{"explanation":"The term 'synemmenon' is specific to ancient Greek music theory and refers to a particular type of tetrachord (a sequence of four notes) that is conjunct, meaning it shares a note with the tetrachord above or below it. It is a technical term and not commonly used outside of historical musicological contexts.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"related_terms":["tetrachord","genus","diatonic","chromatic","enharmonic"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'synemmenon' is a highly specialized term from ancient Greek music theory. Understanding it requires familiarity with concepts such as tetrachords and genera within that system. It is unlikely to be encountered outside of academic discussions of historical musicology."},"example_sentences":[{"sentence":"The ancient Greeks used the synemmenon to modulate between different modes.","translation":"古代ギリシャ人は、異なる旋法間を転調するためにシュネメンノンを使用した。","type":"noun","meaning_category":"music theory"}]}