{"word":"monomorphous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単一形態の、単形性の","english_definition":"Having or existing in only one form or shape.","examples":[{"sentence":"The bacterial colony was monomorphous, with all cells exhibiting the same morphology.","translation":"その細菌コロニーは単形性で、すべての細胞が同じ形態を示していた。"},{"sentence":"Monomorphous populations are less adaptable to environmental changes.","translation":"単形性の個体群は、環境変化への適応性が低い。"}],"collocations":["monomorphous population","monomorphous colony","monomorphous structure"],"synonyms":["uniform","homogeneous","isomorphic"],"antonyms":["polymorphous","heterogeneous","multiform"]}],"etymology":{"value":"Derived from the Greek words 'monos' (single, alone) and 'morphe' (form, shape).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɒnəˈmɔːrfəs/","syllables":"mo-no-mor-phous"},"inflection":{"adjective_forms":{"comparative":"more monomorphous","superlative":"most monomorphous"}},"usage_notes":{"explanation":"'Monomorphous' is often used in scientific contexts, particularly in biology and materials science, to describe something that exists in a single, consistent form. It is the opposite of 'polymorphous,' which describes something that can exist in multiple forms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The virus is monomorphic, so it changes forms easily.","correct":"✓ The virus is polymorphic, so it changes forms easily.","note":"Monomorphic means existing in only one form, whereas polymorphic means existing in multiple forms."}],"priority":"★★☆"},"related_words":{"derivatives":["monomorphism (noun): The condition of being monomorphous.","monomorphically (adverb): In a monomorphous manner."],"related_terms":["isomorphism (noun): Similarity of form or structure.","morphology (noun): The study of the forms of things."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monomorphous' is a technical term used in scientific and academic contexts to describe something that has only one form or shape. It is often used in contrast to 'polymorphous,' which describes something that has multiple forms. Understanding this word requires a strong vocabulary and familiarity with scientific concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The crystal structure of the compound was found to be monomorphous under the given conditions.","translation":"その化合物の結晶構造は、特定の条件下では単形性であることが判明した。","type":"general","meaning_category":"single form"},{"sentence":"The species exhibits a monomorphous life cycle, with no distinct larval stages.","translation":"その種は、明確な幼生段階のない単形性のライフサイクルを示す。","type":"biology","meaning_category":"single form"},{"sentence":"The monomorphous appearance of the metal surface suggested a high degree of uniformity.","translation":"金属表面の単形的な外観は、高度な均一性を示唆していた。","type":"materials science","meaning_category":"single form"}]}