{"word":"Predisponency","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of being predisposed; a predisposition or tendency.","english_definition":"A state of being predisposed; susceptibility.","examples":[{"sentence":"His predisponency to illness made him cautious about traveling during flu season.","translation":"彼は病気にかかりやすい体質なので、インフルエンザの季節に旅行することを慎重に考えていた。"},{"sentence":"The study examined the genetic predisponency for certain diseases.","translation":"その研究では、特定の病気に対する遺伝的な素因が調査された。"}],"collocations":["genetic predisponency","predisponency to illness","predisponency to a certain behavior"],"synonyms":["predisposition","susceptibility","tendency","inclination","propensity"],"antonyms":["immunity","resistance","aversion"]}],"etymology":{"value":"Derived from 'predispose,' with the suffix '-ency' indicating a state or quality. 'Predispose' comes from the prefix 'pre-' (before) and 'dispose' (to arrange, set in order), suggesting a prior arrangement or inclination.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːdɪˈspoʊnənsi/","syllables":"pre-dis-po-nen-cy"},"inflection":{"noun_plural":"predisponencies"},"usage_notes":{"explanation":"'Predisponency' is a formal term that refers to the state of being predisposed to something, typically a condition, behavior, or trait. It often implies a vulnerability or susceptibility. While 'predisposition' is a more commonly used synonym, 'predisponency' emphasizes the state or quality of being predisposed, rather than the inclination itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a predisponency of getting sick.","correct":"✓ He had a predisponency to getting sick.","note":"Use 'to' rather than 'of' to indicate what someone is predisposed to."},{"incorrect":"✗ The predisponency was caused by bad luck.","correct":"✓ The predisponency was caused by genetics.","note":"Predisponency usually refers to an inherent or biological factor, not just bad luck."}],"priority":"★★☆"},"related_words":{"derivatives":["predispose (verb)","predisposed (adjective)","predisposition (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - A relatively rare word, primarily used in scientific or medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Predisponency' is a relatively uncommon and formal noun that describes the state of being likely to experience or exhibit something due to inherent factors. It's often used in scientific or medical contexts to refer to a genetic or biological susceptibility to a particular condition or disease. Because of its formality and specific usage, it is more likely to be encountered in advanced academic or professional settings."},"example_sentences":[{"sentence":"The patient's family history revealed a strong predisponency for heart disease.","translation":"患者の家族歴から、心臓病に対する強い素因が明らかになった。","type":"noun","meaning_category":"素因"},{"sentence":"Environmental factors can exacerbate a genetic predisponency to allergies.","translation":"環境要因は、アレルギーに対する遺伝的な素因を悪化させる可能性がある。","type":"noun","meaning_category":"素因"},{"sentence":"Researchers are studying the predisponency of certain populations to develop specific types of cancer.","translation":"研究者たちは、特定の集団が特定の種類のがんを発症しやすい素因を研究している。","type":"noun","meaning_category":"素因"}]}