{"word":"Hepatolenticular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"肝レンズ核の、肝レンズ核変性症の","english_definition":"Relating to the liver and the lenticular nucleus (a part of the brain); relating to hepatolenticular degeneration (Wilson's disease).","examples":[{"sentence":"The patient showed signs of hepatolenticular degeneration.","translation":"患者は肝レンズ核変性症の兆候を示した。"},{"sentence":"Hepatolenticular disease can cause neurological symptoms.","translation":"肝レンズ核疾患は神経症状を引き起こす可能性がある。"}],"collocations":["hepatolenticular degeneration","hepatolenticular disease"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'hepato-' (relating to the liver) + 'lenticular' (relating to the lenticular nucleus, a lens-shaped structure in the brain).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɛpətəʊlɛnˈtɪkjʊlər/","syllables":"he-pa-to-len-tic-u-lar"},"inflection":{},"usage_notes":{"explanation":"'Hepatolenticular' is primarily used in medical contexts to describe conditions affecting both the liver and the lenticular nucleus of the brain, most notably Wilson's disease (hepatolenticular degeneration).","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["hepatolenticularly"],"related_terms":["Wilson's disease","Kayser-Fleischer ring"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'hepatolenticular' is a highly specialized medical term. It is primarily encountered in the context of medical literature or discussions related to Wilson's disease or similar conditions affecting the liver and brain. Understanding requires familiarity with medical terminology."},"example_sentences":[{"sentence":"The diagnosis of hepatolenticular degeneration was confirmed by genetic testing.","translation":"遺伝子検査により、肝レンズ核変性症の診断が確定した。","type":"adjective","meaning_category":"医学"},{"sentence":"Neurological examination revealed signs consistent with hepatolenticular involvement.","translation":"神経学的検査により、肝レンズ核の関与と一致する兆候が明らかになった。","type":"adjective","meaning_category":"医学"}]}