{"word":"Holotype","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(生物学)正基準標本：新種記載の際に、研究者が指定する唯一の標本。その種を代表するものとして扱われる。","english_definition":"(in biology) the single specimen designated as the type specimen of a species or subspecies by the original author at the time of publication.","examples":[{"sentence":"The holotype of this newly discovered beetle species is stored in the museum's collection.","translation":"この新しく発見された甲虫の正基準標本は、博物館のコレクションに保管されています。"},{"sentence":"Researchers carefully examined the holotype to confirm the species' characteristics.","translation":"研究者たちは、その種の特徴を確認するために正基準標本を注意深く調べました。"}],"collocations":["designate a holotype (正基準標本を指定する)","examine a holotype (正基準標本を調べる)","store a holotype (正基準標本を保管する)","the holotype specimen (正基準標本の標本)"],"synonyms":["type specimen","lectotype (選定基準標本 - ホロタイプがない場合などに選ばれる)","neotype (新基準標本 - ホロタイプとレクトタイプがない場合などに選ばれる)"],"antonyms":[]}],"etymology":{"value":"「holotype」は、ギリシャ語の「holos」（全体、完全）と「typos」（型、標本）に由来する。新種を定義する「完全な標本」という意味合い。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɒlətaɪp/","syllables":"ho-lo-type"},"inflection":{"noun_plural":"holotypes"},"usage_notes":{"explanation":"「**Holotype**（正基準標本）」は、生物学、特に分類学において非常に重要な概念です。新種を記載する際に、研究者はその種を代表する標本を一つ指定します。これがホロタイプです。ホロタイプは、その種の定義の基礎となり、他の標本と比較するための基準となります。もしホロタイプが失われたり、不適切だと判断されたりした場合、レクトタイプ（lectotype）やネオタイプ（neotype）といった別の基準標本が指定されることがあります。ホロタイプは、種のアイデンティティを確立し、分類学的な混乱を避けるために不可欠な役割を果たします。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The paratype is the most important specimen.","correct":"✓ The holotype is the most important specimen.","note":"ホロタイプが新種を定義する上で最も重要な標本であり、パラタイプはホロタイプを補完する役割です。"},{"incorrect":"✗ We can use any specimen as the holotype.","correct":"✓ The holotype must be designated by the original author.","note":"ホロタイプは、新種を記載した最初の研究者によって指定される必要があります。後から別の標本をホロタイプとして指定することはできません。"},{"incorrect":"✗ The holotype can be replaced at any time.","correct":"✓ The holotype can only be replaced under specific circumstances (e.g., loss or destruction) with a lectotype or neotype.","note":"ホロタイプは、紛失や破損など特別な場合にのみ、レクトタイプやネオタイプによって置き換えられます。"}],"priority":"★★☆"},"related_words":{"derivatives":["paratype (副基準標本 - ホロタイプ以外の、新種記載時に参照された標本)","allotype (異型標本 - ホロタイプと異なる性別の標本)","lectotype (選定基準標本 - ホロタイプがない場合などに選ばれる)","neotype (新基準標本 - ホロタイプとレクトタイプがない場合などに選ばれる)","topotype (産地基準標本 - ホロタイプと同じ産地で採取された標本)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門的な生物学の文脈)","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Holotype**（正基準標本）」は、生物学、特に新種の生物を特定する際に使われる専門用語です。新種の生物を初めて発表する研究者が、その種を代表するものとして指定する、たった一つの標本のことを指します。この標本は、その種の「公式な」代表として扱われ、他の標本と比較する際の基準となります。もしこのホロタイプがなくなったり、状態が悪かったりした場合には、別の標本が選ばれることもあります。生物学の研究論文や博物館の展示などで見かけることがあります。"},"example_sentences":[{"sentence":"The designated **holotype** is crucial for future research on this species.","translation":"指定された正基準標本は、この種の将来の研究にとって非常に重要です。","type":"noun","meaning_category":"正基準標本"},{"sentence":"Researchers compared the newly collected specimens with the existing **holotype**.","translation":"研究者たちは、新しく収集された標本を既存の正基準標本と比較しました。","type":"noun","meaning_category":"正基準標本"},{"sentence":"The location of the **holotype** is carefully documented to ensure its accessibility.","translation":"正基準標本の場所は、アクセスを容易にするために注意深く記録されています。","type":"noun","meaning_category":"正基準標本"}]}