{"word":"closeable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"閉じることができる、閉鎖可能な","english_definition":"capable of being closed; designed to be closed.","examples":[{"sentence":"The windows are closeable to keep out the cold.","translation":"窓は寒さを防ぐために閉じることができます。"},{"sentence":"This container is closeable, so it's perfect for storing leftovers.","translation":"この容器は閉じることができるので、残り物を保存するのに最適です。"},{"sentence":"The website has a closeable pop-up ad.","translation":"そのウェブサイトには閉じることができるポップアップ広告があります。"}],"collocations":["closeable container (閉じることができる容器)","closeable window (閉じることができる窓)","closeable lid (閉じることができる蓋)","closeable door (閉じることができるドア)"],"synonyms":["sealable","shutterable","fastenable"],"antonyms":["uncloseable","non-closeable","openable"]},{"part_of_speech":"adjective","definition":"（プログラム、ウィンドウなどが）閉じることができる、終了可能な","english_definition":"(of a program, window, etc.) able to be closed or terminated.","examples":[{"sentence":"The application is easily closeable with a single click.","translation":"そのアプリケーションはワンクリックで簡単に閉じることができます。"},{"sentence":"Make sure the dialog box is closeable before deploying the software.","translation":"ソフトウェアを展開する前に、ダイアログボックスが閉じられることを確認してください。"}],"collocations":["closeable window (閉じることができるウィンドウ)","closeable tab (閉じることができるタブ)","closeable application (閉じることができるアプリケーション)"],"synonyms":["terminable","exitable","dismissable"],"antonyms":["non-closeable","unclosable"]}],"etymology":{"value":"The word \"closeable\" is formed by adding the suffix \"-able\" to the verb \"close.\" The suffix \"-able\" indicates the capability or possibility of being acted upon, so \"closeable\" means \"capable of being closed.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkloʊzəbəl/","syllables":"clo-sa-ble"},"inflection":{"notes":"This is an adjective, so it does not inflect for tense or number. Comparative and superlative forms are more closeable, most closeable, or more easily closeable, most easily closeable."},"usage_notes":{"explanation":"The adjective \"closeable\" describes something that has the ability to be closed. It is often used to describe physical objects like containers, windows, and doors, but it can also be applied to digital interfaces like windows and applications. It emphasizes the feature of being able to be shut or terminated.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The closeable is very important for the container.","correct":"✓ The fact that the container is closeable is very important.","note":"\"Closeable\" is an adjective, so it needs to modify a noun. It cannot stand alone as a noun. You can rephrase the sentence to use a noun phrase."},{"incorrect":"✗ The door is close.","correct":"✓ The door is closeable. / ✓ The door is closed.","note":"\"Close\" can be an adjective, but it means \"near.\" \"Closeable\" means \"able to be closed,\" and \"closed\" means \"in the state of being closed.\""}],"priority":"★★☆"},"related_words":{"derivatives":["close (verb, noun, adjective, adverb)","closed (adjective)","closure (noun)"],"antonyms":["uncloseable","non-closeable","openable"],"related_concepts":["sealable","shutterable","fastenable","terminable","exitable","dismissable"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"closeable\" is an adjective that describes something that can be closed. It's formed by adding the suffix \"-able\" to the verb \"close,\" indicating capability. You'll often see it used to describe containers, windows, or even software applications that can be shut or terminated. It's not a very common word, but it's useful for specifying this particular feature."},"example_sentences":[{"sentence":"The lunchbox has a **closeable** compartment for drinks.","translation":"その弁当箱には飲み物用の閉じることができる区画があります。","type":"adjective","meaning_category":"閉じることができる"},{"sentence":"Is the error message box **closeable**?","translation":"そのエラーメッセージボックスは閉じることができますか？","type":"adjective","meaning_category":"終了可能な"},{"sentence":"The **closeable** nature of the bag makes it ideal for travel.","translation":"そのバッグの閉じることができる性質は、旅行に最適です。","type":"adjective","meaning_category":"閉じることができる性質"}]}