{"word":"obstination","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"頑固、強情、強情さ、意固地","english_definition":"the quality or state of being obstinate; stubbornness.","examples":[{"sentence":"His obstination prevented him from accepting good advice.","translation":"彼の頑固さが、良いアドバイスを受け入れることを妨げた。"},{"sentence":"She showed great obstination in refusing to change her mind.","translation":"彼女は考えを変えることを拒否する際に、強い頑固さを示した。"},{"sentence":"The project failed due to the obstination of the team leader.","translation":"そのプロジェクトは、チームリーダーの頑固さのために失敗した。"}],"collocations":["sheer obstination (全くの頑固さ)","stubborn obstination (頑固な強情さ)","unyielding obstination (譲らない頑固さ)","blind obstination (盲目的な頑固さ)"],"synonyms":["stubbornness","intransigence","inflexibility","pertinacity","tenacity","willfulness","pigheadedness","mulishness"],"antonyms":["compliance","acquiescence","amenability","tractability","docility","flexibility"]}],"etymology":{"value":"Late Middle English: from Old French, from Latin obstinatio(n-), from obstinare ‘persist, be determined’ (see obstinate).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒbstɪˈneɪʃən/","syllables":"ob-sti-na-tion"},"inflection":{"noun_plural":"obstinations (rarely used)"},"usage_notes":{"explanation":"\"Obstination\" refers to the quality of being stubbornly resistant to change or persuasion. It is a more formal and less common word than \"stubbornness\". It often implies a negative judgment, suggesting that the person's stubbornness is unreasonable or harmful. It can also be used to describe a determined persistence, but this is less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed obstination to help.","correct":"✓ He showed obstination in refusing to help. / ✓ He was obstinate in his refusal to help.","note":"\"Obstination\" is a noun and typically requires a preposition like \"in\" or \"to\" to connect it to a verb or action. It's often better to rephrase the sentence to use the adjective \"obstinate\"."},{"incorrect":"✗ She had a obstination.","correct":"✓ She had obstination.","note":"\"Obstination\" is generally used as an uncountable noun, so the indefinite article \"a\" is not used."}],"priority":"★☆☆"},"related_words":{"derivatives":["obstinate (adjective: 頑固な、強情な)","obstinately (adverb: 頑固に、強情に)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"obstination\" is a formal noun that describes the quality of being stubborn or resistant to change. It is not a common word, and you are more likely to encounter the adjective \"obstinate.\" It implies a negative judgment about someone's stubbornness, suggesting that it is unreasonable or harmful. The word is derived from Latin and has a long history in English, but it is not frequently used in modern conversation or writing. Understanding the word can help you appreciate more nuanced and sophisticated language use.","example_sentences":[]},"example_sentences":[{"sentence":"The negotiator's obstination made it impossible to reach an agreement.","translation":"交渉担当者の頑固さが、合意に達することを不可能にした。","type":"general","meaning_category":"頑固さ"},{"sentence":"Her obstination in adhering to the old methods hindered progress.","translation":"彼女が古い方法に固執する頑固さは、進歩を妨げた。","type":"general","meaning_category":"強情"},{"sentence":"Despite the evidence, their obstination remained unshaken.","translation":"証拠があるにもかかわらず、彼らの頑固さは揺るがなかった。","type":"general","meaning_category":"意固地"}]}