{"word":"thyrse","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学) 円錐花序（えんすいかじょ）：主軸に多数の花がつき、それが円錐状に集まった花序。ブドウやライラックの花穂など。","english_definition":"(botany) a dense, conical flower cluster, such as that of the lilac or grape, in which the main stem is branched and the branchlets are repeatedly branched and end in flowers.","examples":[{"sentence":"The lilac displays a beautiful thyrse in the spring.","translation":"ライラックは春に美しい円錐花序を見せる。"},{"sentence":"The grape's flower cluster is a classic example of a thyrse.","translation":"ブドウの花の集まりは、円錐花序の典型的な例である。"}],"collocations":["lilac thyrse","grape thyrse","dense thyrse","terminal thyrse"],"synonyms":["panicle","raceme","flower cluster","inflorescence"],"antonyms":[]}],"etymology":{"value":"Derived from the Ancient Greek word θύρσος (thyrsos), which referred to a staff wreathed with ivy and vine leaves, carried by Dionysus (Bacchus) and his followers. The botanical term was likely inspired by the staff's appearance, with its dense clustering of leaves and vines.","priority":"★★☆"},"pronunciation":{"ipa":"/θɜːrs/","syllables":"thyrse (one syllable)"},"inflection":{"noun_plural":"thyrses"},"usage_notes":{"explanation":"The term \"thyrse\" is primarily used in botanical contexts to describe a specific type of inflorescence. It's not a common word in everyday conversation. When discussing plant structures, using the term \"flower cluster\" or providing a visual description might be more accessible to a general audience.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The thyrse was red and round.","correct":"✓ The flower cluster was red and round.","note":"While technically correct in a botanical context, using 'flower cluster' is more easily understood by non-botanists."}],"priority":"★☆☆"},"related_words":{"derivatives":["thyrsiform (adjective: shaped like a thyrse)"],"phrasal_verbs":[],"related_terms":["inflorescence","panicle","raceme"]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency - Primarily used in botanical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"thyrse\" is a technical term used in botany to describe a specific type of flower cluster. It's unlikely to be encountered outside of specialized scientific or horticultural contexts. Understanding the term requires familiarity with botanical terminology related to plant morphology. For general audiences, using more common terms like \"flower cluster\" or providing a descriptive explanation is recommended.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Buddleja davidii, or butterfly bush, is characterized by its long, showy thyrses.","translation":"フサフジウツギ（バタフライブッシュ）は、長く見栄えのする円錐花序が特徴である。","type":"noun","meaning_category":"botany"},{"sentence":"The terminal thyrse of the plant was particularly dense and fragrant.","translation":"その植物の頂端の円錐花序は、特に密集していて香りが高かった。","type":"noun","meaning_category":"botany"}]}