{"word":"glazing-bar","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築)グレージングバー、ガラス固定用部材：ガラス板を支えるために使用される、細長い部材のこと。通常、窓や天窓などの構造物において、ガラスを固定し、水密性を保つ役割を果たす。","english_definition":"A long, narrow strip of wood or metal used to support panes of glass in a window, skylight, or other glazed structure. It helps to hold the glass in place and maintain a weather-tight seal.","examples":[{"sentence":"The old greenhouse needed new glazing-bars to prevent the glass panes from falling out.","translation":"古い温室は、ガラス板が落ちないように新しいグレージングバーが必要だった。"},{"sentence":"The architect specified aluminum glazing-bars for the modern skylight design.","translation":"建築家は、モダンな天窓のデザインにアルミニウム製のグレージングバーを指定した。"},{"sentence":"Replacing the rotten glazing-bars is essential for maintaining the integrity of the Victorian conservatory.","translation":"腐ったグレージングバーの交換は、ビクトリア朝の温室の完全性を維持するために不可欠である。"}],"collocations":["aluminum glazing-bar","wooden glazing-bar","replace glazing-bar","rotten glazing-bar","install glazing-bar"],"synonyms":["muntin","sash bar","window bar","glass support"],"antonyms":[]}],"etymology":{"value":"「glazing」はガラスを取り付けること、「bar」は細長い部材を意味する。ガラスを固定するために使用される部材であることから、この名がついた。","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡleɪzɪŋ bɑːr/","syllables":"glaz-ing-bar"},"inflection":{"noun_plural":"glazing-bars"},"usage_notes":{"explanation":"「glazing-bar」は、主に建築や建設の分野で使用される専門用語である。窓、天窓、温室などのガラス構造物において、ガラス板を支え、固定するために用いられる部材を指す。材質は木材、アルミニウム、スチールなど様々であり、デザインや構造に応じて選択される。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a glazing bar to clean the windows.","correct":"✓ He used a glazing bar to support the windows.","note":"グレージングバーはガラスを支えるためのもので、清掃用具ではない。"},{"incorrect":"✗ The glazing bar was made of plastic, so it broke easily.","correct":"✓ The glazing bar was made of weak plastic, so it broke easily.","note":"グレージングバーは強度が必要な部材であるため、通常は耐久性のある素材が使用される。プラスチック製の場合、耐久性が低い可能性がある。"}],"priority":"★☆☆"},"related_words":{"derivatives":["glaze","glazing","muntin","sash","window frame","skylight"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「glazing-bar」は、建築や建設分野で使われる専門用語で、窓や天窓などのガラスを支える細長い部材を指します。一般の会話ではあまり使われませんが、建築設計やガラス工事の際には重要な言葉です。ガラスを固定し、構造を安定させる役割があります。"},"example_sentences":[{"sentence":"The carpenter carefully installed the glazing-bars to ensure the glass panes were secure.","translation":"大工はガラス板が確実に固定されるように、慎重にグレージングバーを取り付けた。","type":"noun","meaning_category":"ガラス固定用部材"},{"sentence":"The greenhouse was constructed with sturdy wooden glazing-bars.","translation":"その温室は頑丈な木製のグレージングバーで建てられた。","type":"noun","meaning_category":"ガラス固定用部材"},{"sentence":"Over time, the glazing-bars had deteriorated and needed replacement.","translation":"時間が経つにつれて、グレージングバーは劣化し、交換が必要になった。","type":"noun","meaning_category":"ガラス固定用部材"}]}