{"word":"pyrolyzer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"熱分解装置、熱分解炉","english_definition":"An apparatus used for pyrolysis, the thermal decomposition of materials at elevated temperatures in an inert atmosphere.","examples":[{"sentence":"The pyrolyzer is used to convert biomass into bio-oil.","translation":"その熱分解装置は、バイオマスをバイオオイルに変換するために使用される。"},{"sentence":"The sample was analyzed using a gas chromatograph coupled with a pyrolyzer.","translation":"そのサンプルは、熱分解装置と結合されたガスクロマトグラフを使用して分析された。"}],"collocations":["gas chromatograph-pyrolyzer","bench-scale pyrolyzer","industrial pyrolyzer"],"synonyms":["pyrolysis reactor","thermal cracker"],"antonyms":[]}],"etymology":{"value":"Derived from 'pyrolysis' (the chemical decomposition of organic materials by heating in the absence of oxygen) and the suffix '-er' (denoting an agent or device).","priority":"★★☆"},"pronunciation":{"ipa":"ˈpaɪrəˌlaɪzər","syllables":"py-ro-ly-zer"},"inflection":{"noun_plural":"pyrolyzers"},"usage_notes":{"explanation":"A 'pyrolyzer' is a specific type of equipment designed to perform pyrolysis. It is commonly used in chemical research, waste treatment, and biomass conversion processes. The term often implies a controlled environment to ensure efficient and specific thermal decomposition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pyrolizer was used for combustion.","correct":"✓ The pyrolyzer was used for pyrolysis.","note":"Pyrolysis is distinct from combustion; it occurs in the absence of oxygen, while combustion requires oxygen."}],"priority":"★★☆"},"related_words":{"derivatives":["pyrolysis","pyrolyze"],"related_terms":["reactor","thermal decomposition","gas chromatography","biomass","bio-oil"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pyrolyzer' is a technical term primarily used in scientific and engineering contexts related to chemical processes and waste management. Understanding its meaning requires familiarity with the concept of pyrolysis and related scientific terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The laboratory's new pyrolyzer can process up to 10 kg of plastic waste per hour.","translation":"その研究所の新しい熱分解装置は、1時間あたり最大10kgのプラスチック廃棄物を処理できる。","type":"noun","meaning_category":"熱分解装置"},{"sentence":"Researchers are optimizing the operating conditions of the pyrolyzer to maximize bio-oil yield.","translation":"研究者たちは、バイオオイルの収量を最大化するために、熱分解装置の運転条件を最適化している。","type":"noun","meaning_category":"熱分解装置"}]}