{"word":"CPSU","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ソビエト連邦共産党 (Communist Party of the Soviet Union)","english_definition":"Communist Party of the Soviet Union; the ruling political party of the Soviet Union.","examples":[{"sentence":"The CPSU held power in the Soviet Union for over 70 years.","translation":"ソビエト連邦共産党は70年以上にわたりソビエト連邦で権力を握った。"},{"sentence":"The policies of the CPSU shaped Soviet society.","translation":"ソビエト連邦共産党の政策はソビエト社会を形作った。"}],"collocations":["CPSU Central Committee","CPSU Politburo","dissolution of the CPSU"],"synonyms":["Communist Party of the Soviet Union"],"antonyms":[]}],"etymology":{"value":"An acronym for Communist Party of the Soviet Union.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsiː.piː.esˈjuː/","syllables":"C-P-S-U"},"inflection":{"notes":"It is a proper noun, so there are no plural forms."},"usage_notes":{"explanation":"CPSU refers to the Communist Party of the Soviet Union, which was the sole ruling party of the Soviet Union from 1922 to 1990. It was a highly centralized and hierarchical organization that controlled all aspects of Soviet life, including politics, economics, culture, and ideology. The CPSU was dissolved in 1991 following the collapse of the Soviet Union.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The CPSU are a powerful party.","correct":"✓ The CPSU was a powerful party.","note":"CPSU is a singular noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["communist","communism","Soviet","Bolshevik"],"related_organizations":["Komsomol","Politburo","Central Committee"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"relatively low frequency after the collapse of the Soviet Union.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"CPSU is an acronym for the Communist Party of the Soviet Union. It is a historical term that is primarily relevant in the context of Soviet history and political science. Understanding the role and structure of the CPSU is essential for comprehending the history of the Soviet Union and the Cold War.","priority":"★★☆"},"example_sentences":[{"sentence":"The decline of the CPSU led to the collapse of the Soviet Union.","translation":"ソビエト連邦共産党の衰退はソビエト連邦の崩壊につながった。","type":"noun","meaning_category":"political party"},{"sentence":"Many Soviet citizens were members of the CPSU.","translation":"多くのソビエト市民がソビエト連邦共産党の党員だった。","type":"noun","meaning_category":"political party"}]}