{"word":"divisionist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"分裂主義者、分離主義者","english_definition":"An advocate of division or separation, especially of a political entity.","examples":[{"sentence":"The divisionists sought to break up the country into smaller, independent states.","translation":"分裂主義者たちは国をより小さな独立した国家に分裂させようとした。"},{"sentence":"He was labeled a divisionist for his controversial views on regional autonomy.","translation":"彼は地方自治に関する物議を醸す見解のために分裂主義者というレッテルを貼られた。"}],"collocations":["political divisionist","regional divisionist","national divisionist"],"synonyms":["separatist","secessionist","factionalist","dismemberment advocate"],"antonyms":["unionist","integrationist","unifier"]},{"part_of_speech":"adjective","definition":"分裂主義の、分離主義の","english_definition":"Relating to or promoting division or separation.","examples":[{"sentence":"The divisionist rhetoric fueled tensions between the different ethnic groups.","translation":"分裂主義的なレトリックは、異なる民族グループ間の緊張を煽った。"},{"sentence":"Divisionist policies can lead to instability and conflict within a nation.","translation":"分裂主義的な政策は、国家内の不安定と紛争につながる可能性がある。"}],"collocations":["divisionist policies","divisionist rhetoric","divisionist ideology"],"synonyms":["separatist","factional","fragmentary","splintering"],"antonyms":["unifying","integrative","harmonizing"]}],"etymology":{"value":"The word 'divisionist' is derived from 'division' (the act of dividing) with the suffix '-ist' indicating a person who advocates or supports a particular ideology or cause.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈvɪʒənɪst/","syllables":"di-vi-sion-ist"},"inflection":{"noun_plural":"divisionists"},"usage_notes":{"explanation":"'Divisionist' is often used in political contexts to describe individuals or groups who advocate for the separation of a region, country, or organization. It carries a negative connotation, implying that such division is harmful or disruptive. The term can also be used more broadly to describe anything that promotes division or discord.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a divisionism.","correct":"He is a divisionist.","note":"'Divisionism' is the ideology, while 'divisionist' is the person who adheres to it."},{"incorrect":"The divisionist is good for the country.","correct":"The divisionist's actions are harmful to the country.","note":"The term 'divisionist' often carries a negative connotation."}],"priority":"★★☆"},"related_words":{"derivatives":["division","divisive","divisionism"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'divisionist' is a relatively uncommon term, primarily used in political science and history contexts. It refers to someone who supports the division or separation of a political entity, such as a country or region. Understanding this word requires a good grasp of political vocabulary and an awareness of the negative connotations often associated with it."},"example_sentences":[{"sentence":"The government accused the opposition party of being divisionists, seeking to undermine national unity.","translation":"政府は野党を、国家の統一を弱体化させようとする分裂主義者だと非難した。","type":"noun","meaning_category":"分裂主義者"},{"sentence":"His divisionist views were met with strong opposition from those who believed in a united nation.","translation":"彼の分裂主義的な見解は、統一国家を信じる人々から強い反対を受けた。","type":"adjective","meaning_category":"分裂主義の"}]}