{"word":"unprenylated","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Not prenylated; lacking a prenyl group.","english_definition":"Describes a molecule, typically a protein, that has not undergone prenylation, a post-translational modification where a prenyl group is added.","examples":[{"sentence":"The unprenylated form of the protein is inactive.","translation":"そのタンパク質の非プレニル化型は不活性である。"},{"sentence":"Unprenylated proteins may have different cellular localization.","translation":"非プレニル化タンパク質は異なる細胞内局在を示す可能性がある。"}],"collocations":["unprenylated protein","unprenylated form","unprenylated state"],"synonyms":["deprenylated"],"antonyms":["prenylated"],"notes":"Prenylation is important for membrane association and protein-protein interactions."}],"etymology":{"value":"Formed from the prefix 'un-' (not), combined with 'prenylated' (having undergone prenylation).","priority":"Medium"},"pronunciation":{"ipa":"/ʌnˈprɛnɪleɪtɪd/","syllables":"un-pren-i-lay-ted"},"inflection":{"adjective_forms":{"comparative":"more unprenylated","superlative":"most unprenylated"}},"usage_notes":{"explanation":"This term is primarily used in biochemistry and molecular biology to describe proteins or other molecules that have not been modified by the addition of a prenyl group. Prenylation is a type of post-translational modification that is often important for the localization and function of proteins.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"✗ The protein is unprenyl.","correct":"✓ The protein is unprenylated.","note":"'Unprenyl' is not a correct term. Use 'unprenylated' to describe the state of lacking a prenyl group."}],"priority":"Medium"},"related_words":{"derivatives":["prenylation","prenylated","prenyl"],"related_terms":["post-translational modification","isoprenoid","G protein"]},"level_frequency":{"frequency_google_ngram":"Very Low - Primarily used in scientific literature.","priority":"Low"},"readability_explanation":{"level":"C2","text":"The term 'unprenylated' is highly specialized and primarily used within the fields of biochemistry and molecular biology. Understanding requires familiarity with post-translational modifications, particularly prenylation, and its effects on protein function and localization. Due to its technical nature, it is not commonly encountered outside of these scientific contexts."},"example_sentences":[{"sentence":"The study focused on the effects of inhibiting prenylation, leading to an accumulation of unprenylated proteins.","translation":"その研究は、プレニル化を阻害することの影響に焦点を当て、非プレニル化タンパク質の蓄積につながった。","type":"scientific","meaning_category":"biochemistry"},{"sentence":"Unprenylated Ras proteins are unable to properly localize to the cell membrane.","translation":"非プレニル化Rasタンパク質は、細胞膜に適切に局在化することができない。","type":"scientific","meaning_category":"molecular biology"}]}