{"word":"undeferred","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"延期されていない、繰り延べられていない","english_definition":"not deferred; not postponed or delayed.","examples":[{"sentence":"The undeferred maintenance tasks were completed on schedule.","translation":"延期されなかったメンテナンス作業は予定通りに完了した。"},{"sentence":"The payment was undeferred, so it was due immediately.","translation":"支払いは繰り延べられなかったので、すぐに支払う必要があった。"}],"collocations":["undeferred payment","undeferred maintenance","undeferred task"],"synonyms":["immediate","prompt","unpostponed","unscheduled"],"antonyms":["deferred","postponed","delayed","scheduled"]}],"etymology":{"value":"\"Undeferred\" is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"deferred.\" \"Deferred\" comes from the Latin word \"differre,\" meaning \"to carry away, postpone, delay.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪˈfɜːrd/","syllables":"un-de-ferred"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be part of a predicate adjective construction (e.g., \"The task is undeferred.\"). It does not have typical comparative or superlative forms (e.g., \"more undeferred,\" \"most undeferred\" are not standard usage)."},"usage_notes":{"explanation":"\"Undeferred\" is a relatively uncommon word, primarily used in formal or technical contexts. It emphasizes that something has not been delayed or postponed, often implying that it is proceeding as originally planned or scheduled. It is the direct opposite of \"deferred.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undeferred decision was made quickly.","correct":"✓ The decision was made quickly and was undeferred. / ✓ The immediate decision was made quickly.","note":"While grammatically correct, \"undeferred decision\" is less common and can sound awkward. It's often better to rephrase the sentence or use a more common synonym like \"immediate.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["defer (verb)","deferment (noun)","deference (noun)"],"antonyms":["deferred (adjective)"],"related_concepts":["scheduling","planning","project management"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"undeferred\" is a somewhat formal and uncommon term. It means that something has not been postponed or delayed. Because it is not frequently used, it is more likely to appear in technical or formal writing rather than everyday conversation. Understanding the prefix \"un-\" (meaning \"not\") and the base word \"deferred\" is helpful for grasping its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The undeferred project phase began immediately after approval.","translation":"延期されなかったプロジェクトのフェーズは承認後すぐに開始された。","type":"adjective","meaning_category":"not postponed"},{"sentence":"All undeferred payments are subject to standard interest rates.","translation":"すべての繰り延べられていない支払いは、標準金利の対象となります。","type":"adjective","meaning_category":"not delayed"},{"sentence":"The undeferred tasks were prioritized to ensure timely completion.","translation":"延期されなかったタスクは、タイムリーな完了を確実にするために優先順位が付けられました。","type":"adjective","meaning_category":"not postponed"}]}