{"word":"fungify","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"菌類に変える、菌類で覆う、菌類のようにする","english_definition":"To turn into fungus; to cover or impregnate with fungus; to make fungal in nature.","examples":[{"sentence":"The damp conditions caused the wood to fungify.","translation":"湿った状態が原因で木材が菌類化した。"},{"sentence":"Scientists are exploring ways to fungify waste materials.","translation":"科学者たちは廃棄物を菌類化する方法を研究している。"}],"collocations":["fungify waste (廃棄物を菌類化する)","fungify wood (木材を菌類化する)"],"synonyms":["mycify","inoculate with fungus"],"antonyms":[]}],"etymology":{"value":"\"fungus\" + \"-ify\" (～化する)","priority":"★★☆"},"pronunciation":{"ipa":"ˈfʌŋɡɪfaɪ","syllables":"fun-gi-fy"},"inflection":{"verb_forms":{"present_simple":["fungify","fungifies"],"past_simple":"fungified","past_participle":"fungified","present_participle":"fungifying"}},"usage_notes":{"explanation":"\"Fungify\" is a relatively rare verb that describes the process of something becoming fungal, either literally or figuratively. It can refer to the actual transformation into fungus or the act of treating something with fungus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist fungified his painting with mushrooms.","correct":"✓ The artist adorned his painting with mushrooms.","note":"\"Fungify\" implies a transformation or covering with fungus, not simply adding mushrooms as decoration."}],"priority":"★☆☆"},"related_words":{"derivatives":["fungification (名詞: 菌類化)"],"related_terms":["fungus","fungal","mycology"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Fungify\" is a specialized term primarily used in scientific or technical contexts related to mycology or environmental science. It describes the process of converting something into a fungal state or treating it with fungi. Due to its limited usage, it is not commonly encountered in general English. Understanding requires familiarity with scientific vocabulary and the concept of fungal processes."},"example_sentences":[{"sentence":"The researchers are trying to fungify agricultural waste to create biofuel.","translation":"研究者たちはバイオ燃料を作るために農業廃棄物を菌類化しようとしている。","type":"verb","meaning_category":"菌類に変える"},{"sentence":"The old bread had begun to fungify in the humid environment.","translation":"古いパンは湿気の多い環境で菌類化し始めていた。","type":"verb","meaning_category":"菌類で覆う"}]}