{"word":"papyroplastics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"紙塑、紙を素材とした立体造形","english_definition":"The art or process of creating three-dimensional forms using paper as the primary medium.","examples":[{"sentence":"Her papyroplastics sculptures were exhibited at the gallery.","translation":"彼女の紙塑彫刻はギャラリーで展示された。"},{"sentence":"He enjoys papyroplastics as a relaxing hobby.","translation":"彼はリラックスできる趣味として紙塑を楽しんでいる。"}],"collocations":["papyroplastics sculpture (紙塑彫刻)","papyroplastics art (紙塑芸術)","create papyroplastics (紙塑を制作する)"],"synonyms":["paper sculpture","paper art","papercraft"],"antonyms":[]}],"etymology":{"value":"Derived from \"papyro-\" (relating to paper, from Latin papyrus) and \"-plastics\" (relating to shaping or molding).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæpɪroʊˈplæstɪks/","syllables":"pa-py-ro-plas-tics"},"inflection":{"noun_plural":"papyroplastics"},"usage_notes":{"explanation":"\"Papyroplastics\" refers specifically to the art of creating three-dimensional objects from paper. It is a relatively niche term, often used in artistic or craft contexts. While \"papercraft\" is a broader term encompassing various paper-based crafts, \"papyroplastics\" emphasizes the sculptural and three-dimensional aspect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I made a papyroplastic out of clay.","correct":"✓ I made a papyroplastic out of paper.","note":"Papyroplastics must be made out of paper, not clay or other materials."}],"priority":"★☆☆"},"related_words":{"derivatives":["papyroplastic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"papyroplastics\" is a specialized term referring to the art of creating three-dimensional forms from paper. It is not commonly used in everyday language and is more likely to be encountered in art-related contexts. Understanding the etymology (paper + shaping) helps in grasping its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The artist is known for her intricate papyroplastics designs.","translation":"そのアーティストは、その複雑な紙塑デザインで知られている。","type":"general","meaning_category":"Art"},{"sentence":"Papyroplastics is a challenging but rewarding art form.","translation":"紙塑は挑戦的だがやりがいのある芸術形式だ。","type":"general","meaning_category":"Art"},{"sentence":"He experimented with different techniques in papyroplastics to achieve unique textures.","translation":"彼はユニークな質感を得るために、紙塑のさまざまな技法を試した。","type":"general","meaning_category":"Art"}]}