{"word":"reformer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"改革者、改良家、刷新者","english_definition":"a person who advocates or works for reform of something, especially a political or social institution or practice.","examples":[{"sentence":"He was a social reformer who fought for equal rights.","translation":"彼は平等な権利のために戦った社会改革者だった。"},{"sentence":"The new mayor promised to be a reformer and clean up the city government.","translation":"新しい市長は改革者となり、市役所を浄化すると約束した。"},{"sentence":"She is known as a reformer in the education system.","translation":"彼女は教育制度の改革者として知られている。"}],"collocations":["social reformer (社会改革者)","political reformer (政治改革者)","religious reformer (宗教改革者)","economic reformer (経済改革者)","education reformer (教育改革者)","zealous reformer (熱心な改革者)"],"synonyms":["innovator","pioneer","modernizer","progressive","revolutionary","radical","crusader","activist"],"antonyms":["conservative","reactionary","traditionalist","status quo advocate"]}],"etymology":{"value":"'Reformer' is derived from the verb 'reform,' which comes from the Latin 'reformare,' meaning 'to form again, reshape, correct, amend.' The suffix '-er' is added to denote a person who performs the action.","priority":"★★★"},"pronunciation":{"ipa":"/rɪˈfɔːrmər/","syllables":"re-form-er"},"inflection":{"noun_plural":"reformers"},"usage_notes":{"explanation":"A 'reformer' is someone who actively seeks to improve or change existing systems, institutions, or practices, often with the goal of making them more just, efficient, or equitable. The term typically implies a positive connotation, suggesting that the changes being advocated are beneficial. However, whether a person is considered a 'reformer' can depend on one's perspective and values. What one person sees as progress, another might see as detrimental.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good changer.","correct":"✓ He is a good reformer.","note":"'Changer' is not typically used to describe someone who advocates for systemic change. 'Reformer' is the more appropriate term."},{"incorrect":"✗ She reformed the country. She is a reformed.","correct":"✓ She reformed the country. She is a reformer.","note":"'Reformed' is the past participle of 'reform' and describes something that has been changed. 'Reformer' is the noun that describes the person who does the reforming."}],"priority":"★★☆"},"related_words":{"derivatives":["reform (verb, noun)","reformative (adjective)","reformatory (adjective, noun)","reformism (noun)"],"phrases":["reform movement (改革運動)","reform agenda (改革課題)","reform policy (改革政策)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Moderately frequent","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'reformer' refers to an individual who actively promotes and works towards significant changes in existing systems, institutions, or practices, often with the aim of improving them. This term is generally used in the context of political, social, economic, or religious domains. Understanding the word requires a grasp of abstract concepts such as social justice, progress, and systemic change. The word is more common in formal writing and discussions about history, politics, and social issues."},"example_sentences":[{"sentence":"Martin Luther was a religious reformer who challenged the authority of the Catholic Church.","translation":"マルティン・ルターはカトリック教会の権威に異議を唱えた宗教改革者だった。","type":"noun","meaning_category":"改革者"},{"sentence":"The reformer proposed a series of changes to the tax system.","translation":"その改革者は税制に対する一連の変更を提案した。","type":"noun","meaning_category":"改革者"},{"sentence":"Many people view her as a reformer who is fighting for the rights of marginalized communities.","translation":"多くの人々は彼女を、社会的に疎外されたコミュニティの権利のために戦っている改革者と見なしている。","type":"noun","meaning_category":"改革者"}]}