{"word":"sporulate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"(生物学)胞子を形成する、胞子を生じる","english_definition":"(of a bacterium, fungus, etc.) to form spores.","examples":[{"sentence":"Certain bacteria sporulate under stressful conditions.","translation":"特定の細菌は、ストレスの多い条件下で胞子を形成する。"},{"sentence":"The fungus began to sporulate after several days.","translation":"その菌類は数日後、胞子を生じ始めた。"}],"collocations":["begin to sporulate","sporulate readily","sporulate profusely"],"synonyms":["form spores","produce spores","germinate"],"antonyms":[],"scientific_field":"biology, microbiology"}],"etymology":{"value":"Derived from 'spore' + '-ulate' (suffix indicating a process or state).","priority":"★★☆"},"pronunciation":{"ipa":"ˈspɔːrjuˌleɪt","syllables":"spor-u-late"},"inflection":{"verb_forms":{"present_simple":["sporulate","sporulates"],"past_simple":"sporulated","past_participle":"sporulated","present_participle":"sporulating"}},"usage_notes":{"explanation":"'Sporulate' is a technical term primarily used in biology, particularly in microbiology and mycology, to describe the process by which certain organisms, such as bacteria, fungi, and some protozoa, form spores. Spores are reproductive structures that are highly resistant to environmental stress, allowing the organism to survive in unfavorable conditions. The term is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant sporulated flowers.","correct":"✓ The plant produced flowers.","note":"'Sporulate' refers specifically to the formation of spores, not flowers or other reproductive structures. Plants produce seeds or flowers, not spores. Fungi, bacteria and some other microorganisms sporulate."}],"priority":"★☆☆"},"related_words":{"derivatives":["sporulation (noun: the process of forming spores)","spore (noun: a reproductive structure adapted for dispersal and survival)"],"scientific_terms":["endospore (noun: a dormant, tough, and non-reproductive structure formed by some bacteria)","exospore (noun: a spore formed externally on a sporophore)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (technical vocabulary)","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'sporulate' is a technical term used in biology to describe the process of forming spores. Spores are reproductive structures produced by certain organisms like bacteria and fungi, which allow them to survive in harsh conditions. This term is not commonly used in everyday conversation and is primarily found in scientific contexts. Understanding this word requires a background in biology or related fields."},"example_sentences":[{"sentence":"The Bacillus bacteria began to sporulate when the nutrient supply was exhausted.","translation":"そのバチルス菌は、栄養供給が枯渇すると胞子形成を開始した。","type":"verb","meaning_category":"胞子形成"},{"sentence":"Microscopic examination revealed that the mold was actively sporulating.","translation":"顕微鏡検査により、そのカビが活発に胞子形成していることが明らかになった。","type":"verb","meaning_category":"胞子形成"}]}