{"word":"non-compactible","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(of a substance or object) Not able to be compacted; not capable of being compressed or made more dense.","english_definition":"Not able to be compacted; not capable of being compressed or made more dense.","examples":[{"sentence":"This type of waste is non-compactible and requires special disposal methods.","translation":"この種の廃棄物は圧縮不可能であり、特別な処分方法が必要です。"},{"sentence":"The material's non-compactible nature makes it ideal for applications where maintaining volume is crucial.","translation":"この材料の圧縮不可能な性質は、体積を維持することが重要な用途に最適です。"}],"collocations":["non-compactible waste","non-compactible material","non-compactible design"],"synonyms":["uncompactable","incompressible","non-compressible"],"antonyms":["compactible","compressible"],"related_terms":["compaction","compact","compress"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'compactible'.","priority":"Medium"},"pronunciation":{"ipa":"/ˌnɒn.kəmˈpæk.tɪ.bəl/","syllables":"non-com-pac-ti-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than forming comparative and superlative degrees (which is rare for this word)."},"usage_notes":{"explanation":"'Non-compactible' is a relatively technical term, often used in engineering, waste management, and materials science. It describes something that resists being made smaller or denser through compression.","priority":"Medium"},"level_frequency":{"frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'non-compactible' is a technical term used to describe materials or objects that cannot be easily compressed or made more dense. It is commonly used in fields such as waste management, engineering, and materials science. Understanding this word requires knowledge of the base word 'compactible' and the negative prefix 'non-'. "},"example_sentences":[{"sentence":"Due to its non-compactible nature, the packaging foam takes up a significant amount of space in landfills.","translation":"その圧縮不可能な性質のため、梱包材のフォームは埋め立て地でかなりのスペースを占めます。","type":"general"},{"sentence":"The design incorporates non-compactible elements to ensure structural integrity under pressure.","translation":"その設計は、圧力下での構造的完全性を確保するために、圧縮不可能な要素を組み込んでいます。","type":"technical"}]}