{"word":"boarishness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"無作法さ、粗野さ、下品さ、野蛮さ","english_definition":"The quality or state of being rude, coarse, and ill-mannered; boorish behavior.","examples":[{"sentence":"His boarishness at the dinner table was embarrassing.","translation":"彼の夕食の席での無作法さは恥ずかしかった。"},{"sentence":"She was offended by his boarishness and lack of social grace.","translation":"彼女は彼の無作法さと社交性の欠如に気分を害した。"},{"sentence":"The film portrays the character's journey from boarishness to refinement.","translation":"その映画は、登場人物が無作法から洗練へと変わる過程を描いている。"}],"collocations":["display boarishness","criticize for boarishness","overcome boarishness","boarishness and rudeness","boarishness and vulgarity"],"synonyms":["boorishness","rudeness","coarseness","vulgarity","ill-manneredness","uncouthness","churlishness","loutishness","cloddishness"],"antonyms":["refinement","civility","courtesy","politeness","sophistication","gracefulness"]}],"etymology":{"value":"The word \"boarishness\" is derived from \"boarish,\" which means resembling a boar (a wild pig) in appearance or behavior. The suffix \"-ness\" is added to form a noun indicating the quality or state of being boarish. The association with boars suggests uncouth, rude, and aggressive behavior.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɔːrɪʃnəs/","syllables":"boar-ish-ness"},"inflection":{"noun_plural":"boarishnesses (rarely used)"},"usage_notes":{"explanation":"\"Boarishness\" is a noun that describes the quality of being like a boar in a negative way, implying rudeness, lack of manners, and general uncouthness. It is often used to criticize someone's behavior, suggesting that they are acting in a crude or offensive manner. The word is relatively uncommon in everyday conversation but may be used in more formal or literary contexts to describe a character or situation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of boarish.","correct":"✓ He showed a lot of boarishness.","note":"\"Boarishness\" is a noun, so it should be used to describe a quality or state. \"Boarish\" is an adjective that describes someone or something exhibiting that quality. Therefore, the correct usage is \"boarishness\" in this context."},{"incorrect":"✗ The boarishness man offended everyone.","correct":"✓ The boarish man offended everyone.","note":"\"Boarishness\" is a noun and cannot directly modify the noun \"man.\" The adjective \"boarish\" should be used to describe the man."}],"priority":"★☆☆"},"related_words":{"derivatives":["boarish (adjective: resembling a boar; rude and ill-mannered)"],"related_terms":["boor (noun: a rude or ill-mannered person)","boorish (adjective: rude and ill-mannered)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (uncommon word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Boarishness\" is a relatively uncommon word that describes the quality of being rude, ill-mannered, and coarse, similar to the behavior associated with a boar (wild pig). It is used to describe someone who lacks social graces and exhibits uncouth behavior. Due to its infrequent use and somewhat formal tone, it is more likely to be encountered in literature or formal writing than in everyday conversation. Understanding the word requires a grasp of abstract nouns and the ability to infer meaning from context.","priority":"★☆☆"},"example_sentences":[{"sentence":"His **boarishness** at the party made everyone uncomfortable.","translation":"彼のパーティーでの無作法さは皆を不快にさせた。","type":"noun","meaning_category":"無作法さ"},{"sentence":"The critic condemned the film for its **boarishness** and lack of subtlety.","translation":"評論家はその映画の無作法さと繊細さの欠如を非難した。","type":"noun","meaning_category":"粗野さ"},{"sentence":"She couldn't tolerate his **boarishness** any longer and decided to end the relationship.","translation":"彼女は彼の無作法さにこれ以上耐えられず、関係を終わらせることにした。","type":"noun","meaning_category":"下品さ"}]}