{"word":"tucker-in","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にイギリス英語) 寝かしつけをする人、特に子供を寝かしつける親","english_definition":"(chiefly British) A person who tucks someone in, especially a parent who tucks their child into bed.","examples":[{"sentence":"My daughter always asks for me to be the tucker-in.","translation":"私の娘はいつも私に寝かしつけ役を頼みます。"},{"sentence":"The tucker-in read a bedtime story.","translation":"寝かしつけ役は寝る前の物語を読みました。"}],"collocations":["bedtime tucker-in"],"synonyms":["bedtime reader","parental caregiver"],"antonyms":[],"notes":"This term is primarily used in British English and emphasizes the act of tucking someone into bed."}],"etymology":{"value":"Derived from the verb phrase 'tuck in,' referring to the action of neatly arranging bedclothes around a person to make them comfortable and secure in bed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʌkər ɪn/","syllables":"tuck-er-in"},"inflection":{"noun_plural":"tucker-ins"},"usage_notes":{"explanation":"The term 'tucker-in' is a noun that refers to the person performing the act of 'tucking in' someone, usually a child. It is most commonly used in British English. It implies a caring and comforting action, often associated with bedtime routines.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good tuck-in.","correct":"✓ He is a good tucker-in.","note":"The correct form is 'tucker-in,' not 'tuck-in.'"},{"incorrect":"✗ I need a tucker in for my blanket.","correct":"✓ I need someone to tuck me in with my blanket.","note":"'Tucker-in' refers to the person doing the action, not an object."}],"priority":"★★☆"},"related_words":{"derivatives":["tuck (verb): to push the edges of something, especially cloth, in to make it neat or keep it in place.","tuck in (phrasal verb): to make someone comfortable in bed by arranging the sheets and blankets around them.","tucked in (adjective): describing someone who has been snugly arranged in bed.","tucking-in (noun): the act of tucking someone in."],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'tucker-in' is a specific noun that refers to someone who tucks another person (usually a child) into bed, ensuring they are comfortable and secure. While not a common term in all English-speaking regions, it is easily understood within the context of bedtime routines and parental care. The word is more prevalent in British English. Understanding the phrasal verb 'tuck in' is essential to grasping the meaning of 'tucker-in.'"},"example_sentences":[{"sentence":"She was a loving tucker-in to her grandchildren.","translation":"彼女は孫たちにとって愛情深い寝かしつけ役でした。","type":"noun","meaning_category":"person who tucks in"},{"sentence":"Being the tucker-in was his favorite part of the evening routine.","translation":"寝かしつけ役をすることは、彼にとって夕方のルーチンで一番好きなことでした。","type":"noun","meaning_category":"role in bedtime routine"}]}