{"word":"Urushiols","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ウルシオール類：ウルシ（漆）などの植物に含まれる油性の有機化合物群で、アレルギー反応（接触皮膚炎）を引き起こす。","english_definition":"A mixture of organic compounds with similar structures found in plants of the family Anacardiaceae, especially Toxicodendron spp. (poison ivy, poison oak, and poison sumac) and also in lacquer trees (urushi), that cause an allergic skin rash on contact (contact dermatitis).","examples":[{"sentence":"Urushiols are the active irritants in poison ivy.","translation":"ウルシオール類は、ツタウルシに含まれる活性刺激物質である。"},{"sentence":"Exposure to urushiols can cause a severe allergic reaction in sensitive individuals.","translation":"ウルシオール類への暴露は、敏感な人に重度のアレルギー反応を引き起こす可能性がある。"}],"collocations":["urushiol exposure (ウルシオール暴露)","urushiol allergy (ウルシオールアレルギー)","urushiol-induced dermatitis (ウルシオール誘発性皮膚炎)"],"synonyms":["allergenic phenols","catechols","alkylcatechols"],"antonyms":[]}],"etymology":{"value":"「Urushiol」は、日本語の「漆（うるし; urushi）」に由来する。ウルシの木から採取される樹液に含まれるアレルギーを引き起こす成分であることから命名された。","priority":"★★★"},"pronunciation":{"ipa":"/uːˈruːʃiˌɒlz/","syllables":"u-ru-shi-ols"},"inflection":{"noun_plural":"Urushiols"},"usage_notes":{"explanation":"「Urushiols」は、複数の異性体と類似化合物を含む混合物を指すため、通常は複数形で使用されます。単一の化合物ではなく、グループ全体を指す言葉として理解してください。アレルギー反応の程度は個人差が大きく、ウルシオールに対する感受性がない人もいます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I touched poison ivy and now I have urushiol.","correct":"✓ I touched poison ivy and now I have an urushiol-induced rash.","note":"ウルシオールは化合物名であり、発疹そのものを指すわけではありません。ウルシオールに触れた結果、発疹ができた、という文脈では「urushiol-induced rash（ウルシオール誘発性発疹）」などと表現します。"},{"incorrect":"✗ Urushiol is safe for everyone.","correct":"✓ Urushiol can cause allergic reactions in many people.","note":"ウルシオールはアレルギーを引き起こす可能性のある物質であり、安全ではありません。"},{"incorrect":"✗ Only poison ivy contains urushiol.","correct":"✓ Poison ivy, poison oak, and lacquer trees contain urushiol.","note":"ウルシオールはツタウルシだけでなく、ヌルデ属の他の植物やウルシの木にも含まれています。"}],"priority":"★★☆"},"related_words":{"derivatives":["urushiol (単数形: ウルシオール)","urushi (漆: ウルシオールを含む樹液)","Toxicodendron (ヌルデ属: ウルシオールを含む植物の属)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使用される語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Urushiols」は、ウルシ科の植物（ツタウルシ、ウルシなど）に含まれる油性化合物のグループを指す専門用語です。これらの化合物は、接触皮膚炎（アレルギー性発疹）を引き起こすことで知られています。この用語は、科学、医学、またはアレルギーに関する議論で遭遇する可能性が高く、一般的な会話ではあまり使用されません。アレルギー反応を引き起こす原因物質を特定する際に重要な語彙です。"},"example_sentences":[{"sentence":"The doctor confirmed that the patient's rash was caused by exposure to urushiols.","translation":"医師は、患者の発疹がウルシオール類への暴露によって引き起こされたことを確認した。","type":"noun","meaning_category":"アレルギー原因物質"},{"sentence":"Washing the affected area immediately after contact can help remove urushiols and reduce the severity of the reaction.","translation":"接触後すぐに患部を洗うことで、ウルシオール類を除去し、反応の重症度を軽減するのに役立つ。","type":"noun","meaning_category":"アレルギー原因物質"},{"sentence":"Some people are highly sensitive to urushiols, while others show no reaction at all.","translation":"ウルシオール類に対して非常に敏感な人もいれば、全く反応を示さない人もいる。","type":"noun","meaning_category":"アレルギー原因物質"}]}