{"word":"bombsite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"爆弾の爆発地点、爆弾の被害を受けた場所","english_definition":"A place where a bomb has exploded or where a bomb has caused damage.","examples":[{"sentence":"The bombsite was cordoned off by police.","translation":"爆弾の爆発地点は警察によって封鎖された。"},{"sentence":"Rescue workers searched the bombsite for survivors.","translation":"救助隊員は爆弾の被害を受けた場所で生存者を探した。"}],"collocations":["clear the bombsite","investigate the bombsite","search the bombsite"],"synonyms":["bomb crater","blast site","explosion site"],"antonyms":[]}],"etymology":{"value":"'Bomb' + 'site'. A compound word formed from the words 'bomb' and 'site', indicating the location of a bomb explosion.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈbɒm.saɪt/","syllables":"bom-bsite"},"inflection":{"noun_plural":"bombsites"},"usage_notes":{"explanation":"The term 'bombsite' is typically used in news reports, historical accounts, and other contexts where there is a need to refer to the location of a bomb explosion. It often implies a scene of destruction and danger.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The bomb site was very bomb.","correct":"The bombsite was very damaged.","note":"'Bombsite' refers to the location, not the state of being 'bomb'. Use 'damaged' or other descriptive adjectives to describe the condition."}],"priority":"☆☆☆"},"related_words":{"derivatives":["bomb","site"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'bombsite' is a compound noun referring to the location where a bomb has exploded, often implying destruction and danger. It is typically used in formal contexts such as news reports or historical accounts. Understanding the word requires knowledge of both 'bomb' and 'site' and the ability to combine their meanings. Due to its specific and often tragic context, it is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The documentary showed graphic images of the London bombsite during World War II.","translation":"そのドキュメンタリーは第二次世界大戦中のロンドンの爆撃現場の生々しい映像を映し出した。","type":"noun","meaning_category":"爆弾の爆発地点"},{"sentence":"Forensic teams carefully examined the bombsite for evidence.","translation":"鑑識チームは証拠を求めて爆弾の爆発地点を注意深く調べた。","type":"noun","meaning_category":"爆弾の被害を受けた場所"}]}