{"word":"infamy","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"悪名、不名誉、汚名","english_definition":"the state of being well known for some bad quality or deed.","examples":[{"sentence":"The attack on Pearl Harbor is a date that will live in infamy.","translation":"真珠湾攻撃は、悪名とともに生き続ける日となるだろう。"},{"sentence":"His name is synonymous with infamy.","translation":"彼の名前は悪名の代名詞となっている。"},{"sentence":"The dictator ruled with infamy and cruelty.","translation":"その独裁者は悪名と残虐さをもって支配した。"}],"collocations":["live in infamy (悪名とともに生きる)","synonymous with infamy (悪名の代名詞)","bring infamy (不名誉をもたらす)","national infamy (国民的な不名誉)"],"synonyms":["notoriety","dishonor","disgrace","shame","opprobrium","reproach","ignominy"],"antonyms":["honor","fame","repute","renown","glory"]}],"etymology":{"value":"Old French *infamie* (12c.) \"loss of reputation, dishonor, shame,\" from Latin *infamia* \"ill fame, bad reputation, dishonor, disgrace,\" from *infamis* \"of ill repute, infamous,\" from *in-* \"not, opposite of\" (see in- (1)) + *fama* \"report, reputation, fame,\" from PIE root *bha-* (2) \"to speak, tell, say\".","priority":"★★☆"},"pronunciation":{"ipa":"ˈɪnfəmi","syllables":"in-fa-my"},"inflection":{"noun_plural":"infamies"},"usage_notes":{"explanation":"\"Infamy\" refers to the state of being known for something extremely bad, evil, or shocking. It's a stronger term than \"notoriety,\" which simply means being well-known. Infamy specifically implies a negative reputation due to immoral or wicked actions. It is often used in historical contexts to describe individuals or events that are remembered for their negative impact.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He achieved infamy for his good deeds.","correct":"✓ He achieved fame for his good deeds.","note":"Infamy is only used for bad actions or qualities. Fame is used for good ones."},{"incorrect":"✗ The infamy of the situation was clear.","correct":"✓ The gravity of the situation was clear. / ✓ The infamy of his actions was clear.","note":"Infamy refers to the state of being known for bad actions, not the situation itself. Use 'gravity' or rephrase to focus on the actions."}],"priority":"★★☆"},"related_words":{"derivatives":["infamous (adjective: 悪名高い、不名誉な)","infamously (adverb: 悪名高く、不名誉にも)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, but used in formal and historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Infamy\" is a formal word that means being famous for something very bad. It's used to describe people or events that are remembered for their evil or shocking nature. It's not a common word in everyday conversation, but you might see it in books or articles about history or crime.","priority":"★★☆"},"example_sentences":[{"sentence":"Benedict Arnold is remembered in American history for his infamy as a traitor.","translation":"ベネディクト・アーノルドは、アメリカの歴史において、裏切り者としての悪名で記憶されている。","type":"general","meaning_category":"悪名"},{"sentence":"The serial killer's crimes brought him international infamy.","translation":"その連続殺人犯の犯罪は、彼に国際的な悪名をもたらした。","type":"general","meaning_category":"悪名"},{"sentence":"The company's unethical practices led to its infamy in the business world.","translation":"その会社の非倫理的な慣行は、ビジネス界における悪名につながった。","type":"general","meaning_category":"悪名"}]}