{"word":"puckfist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of knot or decorative knob, often made of rope or fabric.","english_definition":"A decorative knot or knob, often made of rope or fabric, used for ornamental purposes or as a handle.","examples":[{"sentence":"The curtain tiebacks were adorned with puckfist knots.","translation":"カーテンのタッセルは、パックフィストの結び目で飾られていました。"},{"sentence":"He crafted a puckfist knob for the end of his walking stick.","translation":"彼は杖の端にパックフィストのノブを作りました。"}],"collocations":["rope puckfist","fabric puckfist","decorative puckfist","puckfist knot","puckfist handle"],"synonyms":["monkey's fist","knot","knob","decorative knot"],"antonyms":[]},{"part_of_speech":"noun","definition":"(Nautical) A type of fender used on boats.","english_definition":"(Nautical) A type of fender, typically made of rope, used to protect a boat's hull from damage.","examples":[{"sentence":"The sailor used a puckfist as a fender to prevent the boat from scraping against the dock.","translation":"船乗りは、ボートがドックに擦れるのを防ぐために、パックフィストをフェンダーとして使用しました。"}],"collocations":["boat fender","rope fender","nautical puckfist"],"synonyms":["fender","bumper","rope fender"],"antonyms":[]}],"etymology":{"value":"Likely a combination of 'puck' (a round mass) and 'fist' (referring to its shape when tightly formed).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʌkˌfɪst/","syllables":"puck-fist"},"inflection":{"noun_plural":"puckfists"},"usage_notes":{"explanation":"The term 'puckfist' is relatively uncommon outside of specific contexts such as nautical or crafting communities. It primarily refers to a type of knot or knob, or a nautical fender.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a puckfist to hit the nail.","correct":"✓ He used a hammer to hit the nail.","note":"'Puckfist' is not a tool for hammering; it's a decorative knot or fender."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Puckfist' is a specialized term, primarily used in nautical or crafting contexts. It refers to a specific type of knot or fender, and its usage is limited to those familiar with these fields. Understanding requires domain-specific knowledge.","priority":"★★☆"},"example_sentences":[{"sentence":"She learned how to tie a puckfist knot at the craft fair.","translation":"彼女はクラフトフェアでパックフィストの結び方を習いました。","type":"noun","meaning_category":"knot"},{"sentence":"The boat was equipped with several puckfists to protect its sides.","translation":"そのボートには、側面を保護するためにいくつかのパックフィストが装備されていました。","type":"noun","meaning_category":"fender"}]}