{"word":"neuropterous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"脈翅目の、網翅目の","english_definition":"belonging or pertaining to the order Neuroptera (or formerly, the Neuroptera); having net-veined wings.","examples":[{"sentence":"Neuropterous insects are characterized by their delicate, net-like wings.","translation":"脈翅目の昆虫は、繊細な網状の翅を持つことで特徴付けられます。"},{"sentence":"Lacewings are a well-known example of neuropterous insects.","translation":"クサカゲロウは、よく知られた脈翅目の昆虫の例です。"}],"collocations":["neuropterous insect","neuropterous wings","neuropterous larva"],"synonyms":["net-winged"],"antonyms":[]}],"etymology":{"value":"From the New Latin Neuroptera, from Greek neuron 'nerve, sinew, tendon' + pteron 'wing'. Refers to the network of veins in the wings.","priority":"★★☆"},"pronunciation":{"ipa":"/njʊˈrɒptərəs/","syllables":"neu-rop-te-rous"},"inflection":{"notes":"This is an adjective and does not have plural forms."},"usage_notes":{"explanation":"The term 'neuropterous' is primarily used in scientific or technical contexts when discussing insects belonging to the order Neuroptera. It describes the wing structure of these insects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The butterfly is a neuropterous insect.","correct":"✓ The lacewing is a neuropterous insect.","note":"Butterflies belong to the order Lepidoptera, not Neuroptera. Lacewings are a common example of neuropterous insects."}],"priority":"★☆☆"},"related_words":{"derivatives":["Neuroptera (noun: 脈翅目、網翅目)"],"related_terms":["lacewing","antlion","mantidfly"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Neuropterous' is a technical term used in entomology (the study of insects). It describes insects belonging to the order Neuroptera, which are characterized by their net-like wings. This term is not commonly used in everyday language and is primarily found in scientific or educational contexts related to insects. Understanding this term requires a basic knowledge of insect classification and anatomy."},"example_sentences":[{"sentence":"The entomologist studied the intricate wing patterns of the neuropterous species.","translation":"昆虫学者は、その脈翅目の種の複雑な翅の模様を研究しました。","type":"general","meaning_category":"descriptive"},{"sentence":"Neuropterous larvae are often predatory, feeding on aphids and other small insects.","translation":"脈翅目の幼虫は捕食性であることが多く、アブラムシや他の小さな昆虫を捕食します。","type":"general","meaning_category":"biological"}]}