{"word":"fluid-compressed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Compressed by fluid pressure; specifically, pertaining to a state where a fluid's pressure is significantly increased, leading to a higher density and altered properties.","english_definition":"Describing a substance or system where a fluid is under high pressure, resulting in increased density and modified characteristics.","examples":[{"sentence":"The fluid-compressed hydraulic system provided immense power for the machinery.","translation":"流体圧縮された油圧システムは、機械に莫大なパワーを提供しました。"},{"sentence":"Fluid-compressed carbon dioxide exhibits properties distinct from its gaseous or liquid states.","translation":"流体圧縮された二酸化炭素は、気体または液体の状態とは異なる特性を示します。"},{"sentence":"Research is being conducted on fluid-compressed storage of energy.","translation":"エネルギーの流体圧縮貯蔵に関する研究が行われています。"}],"collocations":["fluid-compressed system","fluid-compressed storage","fluid-compressed gas","fluid-compressed state","fluid-compressed hydraulic"],"synonyms":["highly compressed","densified","pressurized","liquefied (in some contexts)"],"antonyms":["decompressed","rarefied","expanded","uncompressed"]}],"etymology":{"value":"Combination of 'fluid' (a substance capable of flowing) and 'compressed' (subjected to pressure).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfluːɪd kəmˈprest/","syllables":"flu-id com-prest"},"inflection":{"notes":"Adjective; does not inflect for number or gender."},"usage_notes":{"explanation":"'Fluid-compressed' is a technical term often used in engineering, physics, and chemistry. It describes a state where a fluid (liquid or gas) is subjected to high pressure, leading to a significant increase in its density and potentially altering its physical properties. The term is most often used when the compression has a significant effect on the fluid's behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The air was fluid-compressed, making it hard to breathe.","correct":"✓ The air was compressed, making it hard to breathe.","note":"'Fluid-compressed' implies a deliberate process of compression, not just any instance of compressed air."},{"incorrect":"✗ Fluid-compressed water is the same as regular water.","correct":"✓ Fluid-compressed water has different properties than regular water.","note":"Fluid compression alters the properties of the fluid, so it is not the same as the uncompressed state."}],"priority":"★☆☆"},"related_words":{"derivatives":["fluid","compressed","compression","fluid dynamics","supercritical fluid"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fluid-compressed' is a technical adjective used to describe a fluid that has been subjected to high pressure, causing it to become denser and potentially changing its properties. This term is commonly found in scientific and engineering contexts, particularly when discussing systems that utilize high-pressure fluids for energy storage or power transmission. Understanding this term requires a familiarity with basic concepts of fluid mechanics and thermodynamics."},"example_sentences":[{"sentence":"The fluid-compressed nitrogen was used in the experiment to simulate deep-sea conditions.","translation":"流体圧縮された窒素は、深海条件をシミュレートするために実験で使用されました。","type":"adjective","meaning_category":"Describing a state of high fluid pressure"},{"sentence":"Fluid-compressed air can be used as an energy storage medium.","translation":"流体圧縮された空気は、エネルギー貯蔵媒体として使用できます。","type":"adjective","meaning_category":"Describing a state of high fluid pressure"},{"sentence":"The properties of fluid-compressed methane are being studied for potential applications in fuel technology.","translation":"流体圧縮されたメタンの特性は、燃料技術への潜在的な応用に向けて研究されています。","type":"adjective","meaning_category":"Describing a state of high fluid pressure"}]}