{"word":"cross-fissured","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"交差する割れ目のある、交差状に亀裂が入った","english_definition":"Having fissures or cracks that intersect or cross each other.","examples":[{"sentence":"The geologist examined the cross-fissured rock formation.","translation":"地質学者は、交差状に亀裂が入った岩石の構造を調べた。"},{"sentence":"The dry riverbed was cross-fissured due to the lack of rain.","translation":"雨不足のため、乾燥した川床には交差する割れ目があった。"}],"collocations":["cross-fissured rock","cross-fissured surface","cross-fissured terrain"],"synonyms":["cracked","fractured","intersecting fissures","reticulated","crazed"],"antonyms":["smooth","unbroken","intact"]}],"etymology":{"value":"The term is a combination of \"cross\" (intersecting) and \"fissured\" (having fissures or cracks).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkrɒsˈfɪʃərd/","syllables":"cross-fis-sured"},"inflection":{"notes":"Does not inflect; it is an adjective."},"usage_notes":{"explanation":"This term is often used in geology, soil science, and materials science to describe surfaces or structures that have a network of intersecting cracks. It implies a pattern of fissures that are not parallel but rather form a grid or web-like structure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The table was cross-fissure.","correct":"✓ The table was cross-fissured.","note":"Remember to use the correct adjective form ending in '-ed'."}],"priority":"★☆☆"},"related_words":{"derivatives":["fissure (noun: a crack or opening)","fissured (adjective: having fissures)"],"related_terms":["fracture","crack","cleavage"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'cross-fissured' is a technical adjective used to describe surfaces or materials with intersecting cracks or fissures. It's commonly found in scientific or technical contexts, particularly in geology or materials science. Understanding the term requires familiarity with the concept of fissures and the spatial relationship of intersection."},"example_sentences":[{"sentence":"The clay soil was heavily cross-fissured after the drought.","translation":"干ばつの後、粘土質の土壌はひどく交差状にひび割れていた。","type":"general"},{"sentence":"Microscopic analysis revealed a cross-fissured pattern on the metal's surface.","translation":"顕微鏡分析により、金属表面に交差状の亀裂パターンが明らかになった。","type":"technical"}]}