{"word":"nondecorously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"礼儀をわきまえない様子で、上品でない様子で、不作法に","english_definition":"in a way that lacks decorum; without proper etiquette or good taste.","examples":[{"sentence":"He behaved nondecorously at the formal dinner, speaking loudly and interrupting others.","translation":"彼は正式な夕食会で、大声で話したり、他の人の話を遮ったりと、礼儀をわきまえない振る舞いをした。"},{"sentence":"The comedian joked nondecorously about sensitive topics, making some audience members uncomfortable.","translation":"そのコメディアンは、デリケートな話題について不作法なジョークを言い、一部の観客を不快にさせた。"}],"collocations":["behave nondecorously","speak nondecorously","act nondecorously"],"synonyms":["improperly","indecorously","unseemlily","inappropriately","rudely","badly","tastelessly","vulgarity"],"antonyms":["decorously","properly","appropriately","respectfully","tastefully","politely"]}],"etymology":{"value":"接頭辞 \"non-\" (～でない) + \"decorously\" (礼儀正しく)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈdekərəsli/","syllables":"non-de-co-rous-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Nondecorously\" describes actions or behaviors that violate social norms of politeness, good taste, or formality. It suggests a lack of respect for established customs or a disregard for what is considered appropriate in a given situation. It is the opposite of behaving \"decorously,\" which means acting in a dignified and socially acceptable manner.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She dressed nondecorously for the funeral.","correct":"✓ She dressed indecorously for the funeral.","note":"While 'nondecorously' is technically correct, 'indecorously' is a more common and natural-sounding way to express a lack of decorum in dress."},{"incorrect":"✗ The party was nondecorously.","correct":"✓ The party was conducted nondecorously.","note":"'Nondecorously' is an adverb and should modify a verb, not stand alone as a description of a noun. Use it to describe how something was done, not what something was."}],"priority":"★★☆"},"related_words":{"derivatives":["decorous (形容詞: 礼儀正しい、上品な)","decorum (名詞: 礼儀、作法、上品さ)","indecorous (形容詞: 礼儀を欠いた、下品な)","indecorously (副詞: 礼儀を欠いて、下品に)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (非常にまれな語彙)","frequency_google_ngram":"非常に低い頻度 (Very low frequency) - 専門的な文脈やフォーマルな文章でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Nondecorously\" is a relatively rare and formal word. It is used to describe behavior that lacks decorum, meaning it is impolite, inappropriate, or in bad taste. Because it is not commonly used, it is more likely to be encountered in formal writing or specialized contexts. It is formed by adding the prefix \"non-\" to \"decorously,\" which is the adverbial form of \"decorous.\""},"example_sentences":[{"sentence":"The protesters behaved nondecorously, shouting insults and disrupting the event.","translation":"抗議者たちは、侮辱的な言葉を叫び、イベントを妨害するなど、不作法な振る舞いをした。","type":"general","meaning_category":"礼儀をわきまえない様子で"},{"sentence":"The article described the politician's actions as nondecorously self-serving.","translation":"その記事は、政治家の行動を、礼儀をわきまえない自己中心的だと表現した。","type":"formal","meaning_category":"上品でない様子で"},{"sentence":"The children acted nondecorously at the wedding, running around and making noise during the ceremony.","translation":"子供たちは結婚式で、走り回ったり、式典中に騒いだりと、不作法な振る舞いをした。","type":"general","meaning_category":"不作法に"}]}