{"word":"untentacled","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"触手のない、触手が取り除かれた","english_definition":"Having no tentacles; having had the tentacles removed.","examples":[{"sentence":"The sea anemone appeared strange and vulnerable, untentacled and exposed on the rock.","translation":"そのイソギンチャクは奇妙で脆弱に見えた。触手がなくなり、岩の上でむき出しになっていた。"},{"sentence":"An untentacled jellyfish is unable to catch its prey effectively.","translation":"触手のないクラゲは、効果的に獲物を捕らえることができない。"}],"collocations":["untentacled creature","untentacled surface"],"synonyms":["tentacleless","exenterated"],"antonyms":["tentacled"],"notes":"Often used in scientific or descriptive contexts."}],"etymology":{"value":"Formed from the prefix 'un-' (meaning 'not') + 'tentacled' (having tentacles).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈtɛntəkəld/","syllables":"un-ten-ta-cled"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"'Untentacled' is a descriptive adjective, most frequently used in biological or zoological contexts to describe organisms that naturally lack tentacles or have had them removed (e.g., through injury or experimental manipulation). It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The untentacled feeling of the slime was unnerving.","correct":"✓ The texture of the slime was unnerving.","note":"'Untentacled' describes the absence of tentacles, not a feeling or texture. Using it to describe a sensation is incorrect."}],"priority":"★☆☆"},"related_words":{"derivatives":["tentacle (noun): a long, flexible appendage of an animal, especially around the mouth or head, used for feeling, grasping, or moving.","tentacled (adjective): having tentacles."],"related_terms":["appendage","protuberance","organism","invertebrate"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'untentacled' is a relatively uncommon and specialized term. It is primarily used in scientific or technical contexts, particularly in biology or zoology, to describe creatures or organisms that lack tentacles. Due to its limited usage, it is unlikely to be encountered in everyday conversation or general reading materials. Understanding the word requires familiarity with the term 'tentacle' and the function of the prefix 'un-' to negate the meaning of the root word."},"example_sentences":[{"sentence":"The scientist examined the untentacled specimen under the microscope.","translation":"科学者は顕微鏡で触手のない標本を調べた。","type":"descriptive","meaning_category":"scientific"},{"sentence":"After the accident, the sea creature was left damaged and untentacled.","translation":"事故の後、その海の生き物は損傷を受け、触手を失った。","type":"descriptive","meaning_category":"general"}]}