{"word":"astrochemistry","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"宇宙化学、天体化学","english_definition":"The study of the abundance and reactions of molecules in the Universe.","examples":[{"sentence":"Astrochemistry seeks to understand the formation, destruction, and excitation of molecules in space.","translation":"宇宙化学は、宇宙における分子の生成、破壊、励起の理解を目的とする。"},{"sentence":"Advances in observational astronomy have greatly aided the field of astrochemistry.","translation":"観測天文学の進歩は、宇宙化学の分野を大いに助けている。"}],"collocations":["interstellar astrochemistry (星間宇宙化学)","astrochemistry laboratory (宇宙化学実験室)","astrochemistry research (宇宙化学研究)"],"synonyms":["cosmochemistry","molecular astrophysics"],"antonyms":[]}],"etymology":{"value":"\"Astro-\" (星、天体) + \"chemistry\" (化学) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌæstroʊˈkemɪstri/","syllables":"as-tro-chem-is-try"},"inflection":{"noun_plural":"astrochemistries (まれに複数形が使われることがある)"},"usage_notes":{"explanation":"Astrochemistry is an interdisciplinary science that combines astronomy and chemistry. It focuses on the chemical composition of stars, planets, and interstellar space, as well as the chemical reactions that occur in these environments. It is closely related to cosmochemistry, which studies the chemical composition of meteorites and other extraterrestrial materials.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Astrochemistry is about the study of stars only.","correct":"✓ Astrochemistry is about the study of molecules in space, including those in stars, planets, and interstellar medium.","note":"Astrochemistry is not limited to stars; it also includes planets and the interstellar medium."}],"priority":"★★☆"},"related_words":{"derivatives":["astrochemical (形容詞: 宇宙化学の)","astrochemist (名詞: 宇宙化学者)"],"phrasal_verbs":[],"related_fields":["astrophysics","cosmology","spectroscopy","molecular physics"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Astrochemistry\" is a specialized term referring to the study of molecules in space. It involves understanding how these molecules form, react, and are distributed throughout the universe. This field requires knowledge of both astronomy and chemistry, making it a complex subject typically encountered in advanced scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The discovery of complex organic molecules in space is a major focus of modern **astrochemistry**.","translation":"宇宙における複雑な有機分子の発見は、現代の宇宙化学の主要な焦点である。","type":"noun","meaning_category":"宇宙化学"},{"sentence":"**Astrochemistry** plays a crucial role in understanding the origins of life in the universe.","translation":"宇宙化学は、宇宙における生命の起源を理解する上で重要な役割を果たす。","type":"noun","meaning_category":"宇宙化学"},{"sentence":"Researchers in **astrochemistry** use telescopes to observe the light emitted by molecules in space.","translation":"宇宙化学の研究者は、宇宙の分子から放出される光を観測するために望遠鏡を使用する。","type":"noun","meaning_category":"宇宙化学"}]}