{"word":"Samhain","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"サウィン（古代ケルト人の収穫祭・新年の祭り。現代のハロウィーンの起源）","english_definition":"An ancient Celtic festival marking the end of the harvest season and beginning of winter (considered the Celtic New Year), celebrated from sunset on October 31 to sunset on November 1.","examples":[{"sentence":"Samhain was one of the four major Celtic seasonal festivals.","translation":"サウィンはケルトの四大季節祭の一つだった。"},{"sentence":"Many Halloween traditions originate from Samhain.","translation":"ハロウィーンの多くの伝統はサウィンに由来する。"}],"cultural_context":"古代ケルト文化では、サウィンは現世と霊界の境界が最も薄くなる時と信じられ、先祖の霊を迎え入れると共に悪霊から身を守る儀式が行われた。かがり火を焚き、仮装をし、食物を供える習慣があった。","synonyms":["Celtic New Year","Halloween's precursor"]},{"part_of_speech":"noun","definition":"（現代のネオペイガン主義などで）サウィン祭（10月31日～11月1日に祝われる収穫祭・死者の祭り）","english_definition":"In modern pagan traditions (especially Wicca), a sabbat celebrated on October 31-November 1 as a festival of harvest and honoring the dead.","examples":[{"sentence":"Our coven will celebrate Samhain with a dumb supper this year.","translation":"私たちの集会では今年、無言の晩餐でサウィンを祝う予定です。"}],"cultural_context":"現代のウィッカやネオペイガニズムでは、サボット（祝祭日）の一つとして、先祖崇拝や収穫への感謝、冬の準備を意味する祭りとして継承されている。"}],"etymology":{"value":"古アイルランド語「Samain」から。語源は「夏の終わり」を意味する（sam「夏」 + fuin「終わり」）。11世紀の文献に確認できる。スコットランド・ゲール語では「Samhainn」、マン島語で「Sauin」、ウェールズ語で「Calan Gaeaf」と呼ばれる。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɑːwɪn/","syllables":"Sam-hain","note":"英語圏では「サウィン」「サウイン」と発音されることが多い。誤って「サムヘイン」と読まれないよう注意。"},"usage_notes":{"explanation":"1. 歴史的・人類学的文脈では古代ケルトの祭りを指す。\n2. 現代の異教復興運動（ネオペイガニズム）では現代的解釈で祝われる祭りを指す。\n3. 一般的なハロウィーン（Halloween）とは区別されるが、ハロウィーンの起源として言及される。\n4. 学術的文献では古い綴り「Samain」も見られる。","priority":"★★☆"},"common_mistakes":[{"incorrect":"✗ Samhain is just the pagan name for Halloween.","correct":"✓ Samhain is the ancient Celtic festival that influenced modern Halloween traditions.","note":"サウィンとハロウィーンは直接的に同一ではなく、影響関係にある"},{"incorrect":"✗ Pronounced as 'sam-hane'","correct":"✓ Pronounced as 'sow-in' or 'sah-win'","note":"発音の誤り（綴りに引きずられないこと）"}],"related_words":{"cultural_terms":[{"word":"Halloween","relation":"現代の祝祭（サウィンの影響を受けたキリスト教化した祭り）"},{"word":"All Saints' Day","relation":"諸聖人の日（11月1日、キリスト教がサウィンを転用したとする説あり）"},{"word":"Dumb Supper","relation":"無言の晩餐（現代のサウィン儀式で行われる先祖を偲ぶ食事）"}],"other_celtic_festivals":["Imbolc (2月1日)","Beltane (5月1日)","Lughnasadh (8月1日)"]},"cultural_significance":{"description":"サウィンは：\n1. ケルト文化研究において重要な季節祭\n2. 現代異教運動における主要な祝祭日\n3. ハロウィーン文化の起源理解に不可欠\n4. 死と再生のサイクルを象徴する祭り","priority":"★★★"},"example_sentences":[{"sentence":"The veil between worlds is thinnest at Samhain.","translation":"サウィンには世界の間のヴェールが最も薄くなる。","context":"スピリチュアルな文脈"},{"sentence":"We carve turnips for Samhain, not pumpkins.","translation":"サウィンではカボチャではなくカブを彫る。","context":"伝統的な習慣"},{"sentence":"Samhain marks the beginning of the dark half of the year.","translation":"サウィンは1年の暗い半分の始まりを示す。","context":"季節の変わり目"}]}