{"word":"prelatically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"司教的に、高位聖職者らしく","english_definition":"In a manner befitting a prelate; in a way that relates to or involves prelates or the prelacy.","examples":[{"sentence":"He spoke prelatically, emphasizing the importance of tradition and hierarchy.","translation":"彼は司教的に話し、伝統と階層の重要性を強調した。"},{"sentence":"The ceremony was conducted prelatically, with great pomp and reverence.","translation":"式典は司教的に、盛大な華やかさと敬意をもって執り行われた。"}],"collocations":["speak prelatically","conduct prelatically","behave prelatically"],"synonyms":["ecclesiastically","hierarchically","pontifically"],"antonyms":["laically","secularly"]}],"etymology":{"value":"Derived from 'prelatical' (adjective meaning 'relating to prelates or prelacy') + '-ly' (suffix forming adverbs). 'Prelatical' comes from 'prelate' (a high-ranking member of the clergy) + '-ical' (suffix forming adjectives). 'Prelate' ultimately derives from Late Latin 'praelatus', the past participle of 'praelare' (to prefer, put before), from Latin 'prae-' (before) + 'ferre' (to carry, bear).","priority":"★★☆"},"pronunciation":{"ipa":"/prɪˈlætɪkli/","syllables":"pre-lat-i-cal-ly"},"inflection":{"notes":"Adverb; does not inflect."},"usage_notes":{"explanation":"'Prelatically' is a relatively rare word used to describe actions, speech, or behavior that is characteristic of a prelate (a high-ranking member of the clergy, such as a bishop or archbishop). It suggests a certain formality, authority, and adherence to ecclesiastical traditions. The word is most often encountered in historical or religious contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He dressed prelatically in jeans and a t-shirt.","correct":"✓ He dressed formally, but not prelatically.","note":"'Prelatically' refers to the manner of behavior or speech, not just formal attire. It implies a specific religious or hierarchical context."}],"priority":"★☆☆"},"related_words":{"derivatives":["prelate (noun): A high-ranking member of the clergy, such as a bishop or archbishop.","prelatical (adjective): Relating to prelates or prelacy.","prelacy (noun): The office, rank, or system of prelates."],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare; not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Prelatically' is an advanced word rarely used in everyday conversation. It describes something done in a manner befitting a high-ranking member of the clergy, such as a bishop. Understanding this word requires familiarity with religious hierarchies and formal language. It is most likely to be encountered in academic or historical texts dealing with religious matters."},"example_sentences":[{"sentence":"The bishop addressed the congregation prelatically, emphasizing the importance of obedience to the church.","translation":"司教は司教的に会衆に語りかけ、教会への服従の重要性を強調した。","type":"adverb","meaning_category":"manner of speaking"},{"sentence":"The historical account describes how the ceremony was conducted prelatically, reflecting the power and authority of the church at that time.","translation":"その歴史的記録は、式典が司教的に執り行われ、当時の教会の権力と権威を反映していた様子を描写している。","type":"adverb","meaning_category":"manner of conducting a ceremony"}]}