{"word":"wreathingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"花輪のように、花輪で飾るように","english_definition":"In a wreath-like manner; in the manner of adorning with wreaths.","examples":[{"sentence":"The dancers moved wreathingly around the maypole.","translation":"踊り子たちはメイポール（五月柱）の周りを花輪のように動き回った。"},{"sentence":"The vines climbed wreathingly up the trellis.","translation":"つる植物はトレリスを花輪のように絡みつきながら登っていった。"}],"collocations":[],"synonyms":["circularly","ornamentally","decoratively"],"antonyms":[]}],"etymology":{"value":"Derived from the word 'wreath' (a circular arrangement of flowers, leaves, or other material) and the suffix '-ingly' (indicating a manner or way of doing something).","priority":"★★★"},"pronunciation":{"ipa":"/ˈriːðɪŋli/","syllables":"wreath-ing-ly"},"inflection":{"notes":"Adverb - no inflection"},"usage_notes":{"explanation":"'Wreathingly' is an adverb that describes an action or movement that resembles the shape or arrangement of a wreath, or the act of decorating something with wreaths. It is not a commonly used word, but it can be useful in descriptive writing to convey a sense of circularity, ornamentation, or festivity.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["wreath (noun)","wreathe (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The adverb 'wreathingly' is a rare and sophisticated term used to describe actions or arrangements that resemble a wreath. Due to its infrequent use, it is suitable for advanced English speakers and writers aiming for highly descriptive and evocative language. Understanding the base words 'wreath' and 'wreathe' is essential for grasping the meaning of 'wreathingly.'"},"example_sentences":[{"sentence":"The smoke rose wreathingly from the chimney, creating a picturesque scene.","translation":"煙突から煙が花輪のように立ち上り、絵のような風景を作り出した。","type":"descriptive","meaning_category":"manner of movement"},{"sentence":"The ivy coiled wreathingly around the ancient stone column.","translation":"ツタは古代の石柱に花輪のように巻き付いた。","type":"descriptive","meaning_category":"arrangement"}]}