{"word":"disaccharide","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"二糖類","english_definition":"Any of a class of sugars whose molecules contain two monosaccharide residues.","examples":[{"sentence":"Sucrose, lactose, and maltose are common disaccharides.","translation":"スクロース、ラクトース、およびマルトースは一般的な二糖類です。"},{"sentence":"Disaccharides must be broken down into monosaccharides before they can be absorbed by the body.","translation":"二糖類は、体内に吸収される前に単糖類に分解される必要があります。"}],"collocations":["common disaccharide","dietary disaccharide","hydrolyze disaccharide"],"synonyms":["biose"],"antonyms":["monosaccharide","polysaccharide"]}],"etymology":{"value":"From di- (two) + saccharide (sugar).","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈsækəraɪd/","syllables":"di-sac-cha-ride"},"inflection":{"noun_plural":"disaccharides"},"usage_notes":{"explanation":"Disaccharides are carbohydrates composed of two monosaccharides (simple sugars) joined by a glycosidic bond. They are a type of sugar that needs to be broken down into simpler sugars (monosaccharides) during digestion before they can be absorbed into the bloodstream. Common examples include sucrose (table sugar, made of glucose and fructose), lactose (milk sugar, made of glucose and galactose), and maltose (malt sugar, made of two glucose molecules).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Disaccharides are made of many monosaccharides.","correct":"✓ Disaccharides are made of two monosaccharides.","note":"Disaccharides consist of *two* monosaccharides, not many."},{"incorrect":"✗ Disaccharide is a type of protein.","correct":"✓ Disaccharide is a type of carbohydrate (sugar).","note":"Disaccharides are carbohydrates, specifically sugars, not proteins."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["monosaccharide","polysaccharide","carbohydrate","sucrose","lactose","maltose","glucose","fructose","galactose","glycosidic bond"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and educational contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'disaccharide' is a scientific term used in the context of chemistry, biology, and nutrition. It refers to a type of carbohydrate composed of two monosaccharide units linked together. Understanding this term requires a basic knowledge of carbohydrate chemistry and biological processes. It's commonly encountered in discussions about digestion, metabolism, and the nutritional content of foods.","priority":"★★★"},"example_sentences":[{"sentence":"The digestion of disaccharides involves the hydrolysis of the glycosidic bond.","translation":"二糖類の消化には、グリコシド結合の加水分解が伴います。","type":"general","meaning_category":"scientific"},{"sentence":"Individuals with lactose intolerance have difficulty digesting the disaccharide lactose.","translation":"乳糖不耐症の人は、二糖類であるラクトースの消化が困難です。","type":"medical","meaning_category":"medical"},{"sentence":"Disaccharides provide a quick source of energy after they are broken down into monosaccharides.","translation":"二糖類は、単糖類に分解された後、迅速なエネルギー源となります。","type":"nutritional","meaning_category":"nutritional"}]}