{"word":"costean","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学) 鉱脈や地層を調べるために地表を掘った溝、試掘溝","english_definition":"(geology) A trench dug at right angles to the strike of a vein or lode to explore it.","examples":[{"sentence":"The geologist examined the costean to determine the extent of the ore deposit.","translation":"地質学者は鉱床の広がりを調べるために試掘溝を調べた。"},{"sentence":"Several costeans were dug across the hillside to trace the mineral vein.","translation":"鉱脈を追跡するために、丘の斜面にいくつかの試掘溝が掘られた。"}],"collocations":["dig a costean","examine a costean","trace a vein with costeans"],"synonyms":["trench","test pit","prospect trench"],"antonyms":[]}],"etymology":{"value":"Cornish origin, from *cost*, meaning 'side' or 'edge', referring to the side of a hill or the edge of a vein.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒstiːən/","syllables":"cos-te-an"},"inflection":{"noun_plural":"costeans"},"usage_notes":{"explanation":"A costean is a specific type of trench used in geological exploration. It is dug perpendicular to the suspected strike of a mineral vein or lode to expose the subsurface and allow for direct examination of the geological structure and mineralization. Costeans are typically shallow and linear, designed to provide a cross-sectional view of the targeted feature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The costean was filled with water, making it impossible to see the minerals.","correct":"✓ The costean was filled with water, obscuring the minerals.","note":"While a costean might be filled with water, the issue is that the water obscures the minerals, not makes it impossible to see them in all cases."}],"priority":"☆☆☆"},"related_words":{"derivatives":["costeaning (noun: the process of digging costeans)"],"phrasal_verbs":[],"related_terms":["outcrop","vein","lode","mineralization","geological survey","trenching"]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'costean' is a technical term used in geology and mining. It refers to a trench that is dug to explore a mineral vein or lode. Understanding this word requires knowledge of geological exploration techniques. It is not commonly used outside of these specific fields."},"example_sentences":[{"sentence":"The initial geological survey recommended digging a costean to assess the potential of the site.","translation":"最初の地質調査では、その場所の可能性を評価するために試掘溝を掘ることを推奨した。","type":"noun","meaning_category":"geological exploration"},{"sentence":"By carefully examining the costean, the geologist was able to identify several promising ore samples.","translation":"地質学者は試掘溝を注意深く調べることで、有望な鉱石サンプルをいくつか特定することができた。","type":"noun","meaning_category":"geological exploration"}]}