{"word":"ricin","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"リシン (ヒマの種子に含まれる毒性の強いタンパク質)","english_definition":"a highly toxic protein derived from the castor bean.","examples":[{"sentence":"Ricin is a potent toxin that can be lethal even in small doses.","translation":"リシンは強力な毒素であり、少量でも致死的となる可能性がある。"},{"sentence":"Exposure to ricin can occur through inhalation, ingestion, or injection.","translation":"リシンへの暴露は、吸入、摂取、または注射によって起こりうる。"}],"collocations":["ricin poisoning (リシン中毒)","ricin attack (リシン攻撃)","detect ricin (リシンを検出する)","ricin toxin (リシン毒素)"],"synonyms":["toxalbumin"],"antonyms":[]},{"part_of_speech":"noun","definition":"リシン (特定の植物に含まれる類似のタンパク質毒素の総称)","english_definition":"any of a class of toxic proteins similar to ricin found in certain plants.","examples":[{"sentence":"Several plants contain ricin-like toxins that can be harmful if ingested.","translation":"いくつかの植物は、摂取すると有害となる可能性のあるリシン様の毒素を含んでいる。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from Latin *ricinus*, meaning 'castor bean'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈraɪsɪn/","syllables":"ri-cin"},"inflection":{"noun_plural":"ricins"},"usage_notes":{"explanation":"Ricin is a highly toxic protein found in castor beans. It inhibits protein synthesis and can be lethal if ingested, inhaled, or injected. Due to its toxicity and relative ease of production, it has been investigated for potential use as a bioweapon. The term 'ricin' can also refer to similar toxic proteins found in other plants, though the ricin from castor beans is the most well-known.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Ricin are a dangerous poison.","correct":"✓ Ricin is a dangerous poison.","note":"Ricin is an uncountable noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["ricinine (リシニン - リシンとは異なるカストール豆由来のアルカロイド)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Ricin is a highly poisonous substance found in castor beans. It is a complex protein that can stop cells from making proteins, leading to cell death. Because it is so toxic and relatively easy to make, it has been considered for use in terrorism. The word is not commonly used in everyday conversation, but it appears in discussions about poisons, terrorism, and security.","priority":"★★☆"},"example_sentences":[{"sentence":"The letter was found to contain traces of **ricin**.","translation":"その手紙からリシンの痕跡が見つかった。","type":"noun","meaning_category":"毒素"},{"sentence":"**Ricin** works by inhibiting protein synthesis in cells.","translation":"リシンは細胞内のタンパク質合成を阻害することによって作用する。","type":"noun","meaning_category":"毒素"},{"sentence":"Symptoms of **ricin** poisoning can vary depending on the route of exposure.","translation":"リシン中毒の症状は、暴露経路によって異なる場合がある。","type":"noun","meaning_category":"毒素"}]}