{"word":"Congruency","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"一致、調和、適合性、合同（数学）","english_definition":"The state of agreeing or corresponding; compatibility; the quality of being congruent.","examples":[{"sentence":"There is a high degree of congruency between their opinions.","translation":"彼らの意見の間には高い一致が見られる。"},{"sentence":"The congruency of the company's values with those of its employees is crucial for success.","translation":"企業の価値観と従業員の価値観の一致は、成功にとって非常に重要である。"},{"sentence":"In mathematics, congruency implies that two figures are identical in shape and size.","translation":"数学において、合同とは、二つの図形が形と大きさが同一であることを意味する。"}],"collocations":["value congruency (価値観の一致)","goal congruency (目標の一致)","high congruency (高い一致)","low congruency (低い一致)","data congruency (データの一貫性)","mathematical congruency (数学的な合同)"],"synonyms":["agreement","correspondence","harmony","accordance","compatibility","conformity","consistency","identity (mathematics)"],"antonyms":["incongruence","disagreement","discordance","incompatibility","disparity"]}],"etymology":{"value":"Late Middle English: from Latin congruentia, from congruere ‘agree, correspond’ (see congruent).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒŋɡruənsi/","syllables":"con-gru-en-cy"},"inflection":{"noun_plural":"congruencies"},"usage_notes":{"explanation":"\"**Congruency**\" refers to the state of being congruent, meaning things are in agreement, harmony, or correspondence. It's often used in contexts where alignment or compatibility is important, such as in business (values, goals), psychology (self-concept), and mathematics (geometric figures). In mathematics, specifically, \"congruency\" has a precise meaning, indicating that two figures are exactly the same in shape and size, although they may be oriented differently. The term is more formal and less frequently used in everyday conversation compared to words like \"agreement\" or \"harmony\".","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The congruency between the two people.","correct":"✓ The congruency between the two people's opinions.","note":"'Congruency' requires a specific aspect or element to be congruent *between* things. It's not just the existence of two entities, but the alignment of a shared characteristic."},{"incorrect":"✗ The congruency of the room was nice.","correct":"✓ The decor of the room had congruency.","note":"'Congruency' refers to a state of agreement or compatibility, not a quality of a single object. The decor *has* congruency or *demonstrates* congruency."},{"incorrect":"✗ They had a congruency.","correct":"✓ They had congruency in their goals.","note":"It's important to specify what aspect is congruent. 'They had a congruency' is vague and lacks meaning without further context."}],"priority":"★★☆"},"related_words":{"derivatives":["congruent (adjective: agreeing, corresponding, mathematically identical)","congruently (adverb: in a congruent manner)","incongruent (adjective: not congruent)","incongruently (adverb: in an incongruent manner)","incongruence (noun: the state of not being congruent)"],"related_terms":["congruence (noun: a synonym of congruency, often used interchangeably)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"**congruency**\" is a formal term that means things are in agreement or harmony. It's often used when talking about abstract ideas like values or goals, or in technical fields like mathematics. It's not a word you'd use in everyday conversation, but it's important to understand in academic or professional contexts. It's similar to \"agreement\" or \"harmony,\" but it suggests a more precise and structured alignment."},"example_sentences":[{"sentence":"The **congruency** between the company's mission statement and its actual practices was questionable.","translation":"企業のミッションステートメントと実際の慣行との一致は疑わしかった。","type":"noun","meaning_category":"agreement"},{"sentence":"The mathematical proof relied on the **congruency** of the two triangles.","translation":"その数学的な証明は、二つの三角形の合同性に依存していた。","type":"noun","meaning_category":"mathematics"},{"sentence":"For effective therapy, there needs to be **congruency** between the therapist's words and their actions.","translation":"効果的なセラピーのためには、セラピストの言葉と行動の一致が必要である。","type":"noun","meaning_category":"agreement"}]}