{"word":"unheaven","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"取り消す、元に戻す","english_definition":"To undo or reverse something that has been divinely ordained or blessed, or that seems perfect or heavenly.","examples":[{"sentence":"The sorcerer attempted to unheaven the celestial alignment, but his magic failed.","translation":"その魔法使いは天体の配置を元に戻そうとしたが、彼の魔法は失敗した。"},{"sentence":"Can we truly unheaven the past and erase its consequences?","translation":"私たちは本当に過去を取り消し、その結果を消し去ることができるのだろうか？"}],"collocations":["unheaven a blessing","unheaven a destiny","unheaven a miracle"],"synonyms":["undo","reverse","revoke","cancel","invalidate"],"antonyms":["ordain","bless","sanctify","establish"]},{"part_of_speech":"verb","definition":"堕落させる、不道徳にする、天国のような状態を損なう","english_definition":"To make something less heavenly or perfect; to corrupt or degrade something that was once pure or divine.","examples":[{"sentence":"The city's pollution threatened to unheaven the once pristine landscape.","translation":"都市の汚染は、かつて手つかずだった風景を堕落させる恐れがあった。"},{"sentence":"Greed and corruption unheavened the ideals of the revolution.","translation":"貪欲と腐敗は、革命の理想を堕落させた。"}],"collocations":["unheaven a paradise","unheaven an ideal","unheaven a reputation"],"synonyms":["corrupt","degrade","defile","pollute","taint"],"antonyms":["purify","elevate","ennoble","enhance"]}],"etymology":{"value":"Formed by adding the prefix 'un-' to 'heaven'. The prefix 'un-' indicates negation or reversal. Therefore, 'unheaven' implies the opposite of making something heavenly or reversing a heavenly state.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈhɛvən/","syllables":"un-heav-en"},"inflection":{"verb_forms":{"present_simple":["unheaven","unheavens"],"past_simple":"unheavened","past_participle":"unheavened","present_participle":"unheavening"}},"usage_notes":{"explanation":"'Unheaven' is a relatively rare and poetic word. It suggests a forceful or deliberate act of reversing or corrupting something that was once considered sacred, perfect, or heavenly. It can imply a sense of loss or desecration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The storm unheavened the crops.","correct":"✓ The storm ruined the crops.","note":"'Unheaven' is typically used in more metaphorical or abstract contexts, not for simple destruction. 'Ruined' is more appropriate for physical damage."},{"incorrect":"✗ She tried to unheaven her mistake.","correct":"✓ She tried to undo her mistake.","note":"'Undo' is a more common and direct way to express reversing a mistake. 'Unheaven' implies a deeper, more significant reversal."}],"priority":"★★☆"},"related_words":{"derivatives":["unheavenly (adjective): not heavenly; earthly or infernal"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Word not commonly found in CEFR levels)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unheaven' is a rare and sophisticated word, typically used in literary or philosophical contexts to describe the act of reversing or corrupting something that was once considered divine or perfect. Its usage requires a strong understanding of metaphor and abstract concepts. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The politician's scandal threatened to unheaven his previously spotless reputation.","translation":"その政治家のスキャンダルは、以前は非の打ちどころがなかった彼の評判を堕落させる恐れがあった。","type":"verb","meaning_category":"堕落させる"},{"sentence":"Some philosophers argue that technology is unheavening our connection to nature.","translation":"一部の哲学者は、テクノロジーが自然とのつながりを堕落させていると主張している。","type":"verb","meaning_category":"堕落させる"},{"sentence":"The treaty aimed to unheaven the injustices of the past.","translation":"その条約は、過去の不正を元に戻すことを目指していた。","type":"verb","meaning_category":"取り消す"}]}