{"word":"flavorings","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"風味料、香料、調味料","english_definition":"Substances added to food or drink to give it a particular taste or smell.","examples":[{"sentence":"Artificial flavorings are often used in processed foods.","translation":"人工香料は加工食品によく使われます。"},{"sentence":"The recipe calls for natural flavorings such as vanilla extract and lemon zest.","translation":"そのレシピでは、バニラエッセンスやレモンの皮などの天然香料が必要です。"},{"sentence":"Different flavorings can completely change the taste of a dish.","translation":"異なる風味料を使うことで、料理の味が全く変わることがあります。"}],"collocations":["natural flavorings (天然香料)","artificial flavorings (人工香料)","add flavorings (風味料を加える)","food flavorings (食品香料)","spice flavorings (スパイス香料)"],"synonyms":["seasonings","condiments","spices","extracts","essences","aromatics"],"antonyms":["unflavored","plain"],"related_words":["flavor (風味、味)","flavorful (風味豊かな)","flavorless (味気ない)"]}],"etymology":{"value":"The word \"flavoring\" is derived from \"flavor,\" which comes from the Old French word \"flavour,\" meaning \"smell, aroma.\" The suffix \"-ing\" indicates a substance or ingredient used to impart that flavor.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfleɪvərɪŋz/","syllables":"fla-vor-ings"},"inflection":{"noun_plural":"flavorings"},"usage_notes":{"explanation":"\"Flavorings\" refers to a wide range of substances used to enhance or alter the taste and aroma of food and beverages. These can be natural, derived from sources like fruits, spices, and herbs, or artificial, created synthetically. The term is generally used in the plural form because it refers to a category of ingredients rather than a single specific item.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I added a flavoring in the soup.","correct":"✓ I added some flavoring to the soup.","note":"When referring to flavorings in general, use the plural form and 'some' to indicate an unspecified amount."},{"incorrect":"✗ The flavoring is too strong.","correct":"✓ The flavorings are too strong.","note":"If referring to a blend or combination of flavorings, use the plural form."}],"priority":"★★☆"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively common, especially in cooking and food-related contexts.","priority":"★★☆"},"readability_explanation":{"level":"B1","text":"\"Flavorings\" are things you add to food to make it taste better or different. They can be things like spices, herbs, or extracts. You usually use more than one flavoring, so we often say \"flavorings\" instead of \"flavoring.\" Think of it like adding different colors to a painting to make it more interesting."},"example_sentences":[{"sentence":"The chef used a blend of exotic flavorings to create a unique dish.","translation":"シェフは独特な料理を作るために、エキゾチックな風味料のブレンドを使用しました。","type":"example"},{"sentence":"Many processed foods contain artificial flavorings to enhance their taste.","translation":"多くの加工食品には、味を良くするために人工香料が含まれています。","type":"example"},{"sentence":"She experimented with different flavorings until she found the perfect combination for her cake.","translation":"彼女はケーキに最適な組み合わせを見つけるまで、さまざまな風味料を試しました。","type":"example"}]}