{"word":"radiumization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"放射線照射（特に食品への放射線照射）","english_definition":"The process of treating something with ionizing radiation, especially food, to sterilize it or prolong its shelf life.","examples":[{"sentence":"Radiumization is used to kill bacteria in spices.","translation":"放射線照射はスパイス中のバクテリアを殺菌するために用いられる。"},{"sentence":"The radiumization of fruits can extend their storage time.","translation":"果物の放射線照射は保存期間を延ばすことができる。"}],"collocations":["food radiumization","spice radiumization"],"synonyms":["irradiation","radiation treatment","radiation processing"],"antonyms":[]}],"etymology":{"value":"Derived from 'radium' (a radioactive element) and the suffix '-ization' (the process of doing something). Although the term originally implied the use of radium itself, modern radiumization typically involves other sources of ionizing radiation, such as gamma rays or electron beams.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌreɪdiəmaɪˈzeɪʃən/","syllables":"ra-di-um-i-za-tion"},"inflection":{"noun_plural":"radiumizations"},"usage_notes":{"explanation":"'Radiumization' is a somewhat outdated term. The more common and accurate term is 'irradiation' or 'radiation processing.' While the term originally referred to treatment with radium, modern processes use other radiation sources. It is primarily used in the context of food preservation and sterilization.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The radiumization made the food radioactive.","correct":"✓ The irradiation did not make the food radioactive.","note":"Irradiation does not make food radioactive. The process uses ionizing radiation to kill microorganisms, but it does not leave any radioactive residue."}],"priority":"★★☆"},"related_words":{"derivatives":["irradiate","irradiation","radiation","radioactive"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Radiumization' refers to the process of treating something with ionizing radiation, particularly food, to sterilize it or extend its shelf life. While the term suggests the use of radium, modern applications use other radiation sources. It's important to note that this process does not make the food radioactive. The more common and contemporary term is 'irradiation' or 'radiation processing.'"},"example_sentences":[{"sentence":"The company uses radiumization to ensure the safety of its products.","translation":"その会社は製品の安全性を確保するために放射線照射を使用している。","type":"noun","meaning_category":"放射線照射"},{"sentence":"Radiumization helps to reduce the risk of foodborne illnesses.","translation":"放射線照射は食品由来の病気のリスクを減らすのに役立つ。","type":"noun","meaning_category":"放射線照射"}]}