{"word":"Arthrectomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"関節切除術","english_definition":"Surgical removal of a joint.","examples":[{"sentence":"An arthrectomy was performed to alleviate the patient's chronic pain.","translation":"患者の慢性的な痛みを軽減するために、関節切除術が行われた。"}],"collocations":[],"synonyms":["Joint resection","Excision arthroplasty"],"antonyms":["Arthroplasty","Arthrotomy"]}],"etymology":{"value":"From the Greek words 'arthro-' (joint) and '-ectomy' (surgical removal).","priority":"★★★"},"pronunciation":{"ipa":"/ɑːrˈθrɛktəmi/","syllables":"ar-threc-to-my"},"inflection":{"noun_plural":"arthrectomies"},"usage_notes":{"explanation":"Arthrectomy is a relatively rare surgical procedure, usually considered when other joint-preserving treatments have failed. It results in loss of joint function and is often followed by arthrodesis (joint fusion) or arthroplasty (joint replacement).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient had an arthrectomy of the knee, and now can run marathons.","correct":"✓ The patient had an arthroplasty of the knee, and now can run marathons.","note":"Arthrectomy involves removing the joint, which would prevent running marathons. Arthroplasty (joint replacement) is more likely in this scenario."}],"priority":"★★☆"},"related_words":{"derivatives":["arthro- (prefix: joint)","-ectomy (suffix: surgical removal)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Arthrectomy' is a highly specialized medical term referring to the surgical removal of a joint. It is typically encountered in medical contexts, such as surgical reports, orthopedic textbooks, or discussions among medical professionals. Due to its specific and technical nature, it is not part of general vocabulary. Understanding the term requires knowledge of medical terminology related to surgical procedures and joint anatomy."},"example_sentences":[{"sentence":"The severe infection necessitated an arthrectomy of the elbow joint.","translation":"重度の感染症のため、肘関節の関節切除術が必要となった。","type":"medical","meaning_category":"surgical removal of a joint"},{"sentence":"Following the arthrectomy, the patient underwent a rehabilitation program to regain strength.","translation":"関節切除術後、患者は筋力回復のためにリハビリプログラムを受けた。","type":"medical","meaning_category":"surgical removal of a joint"}]}