{"word":"campal","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(rare) A type of coarse woolen blanket or shawl, especially one made in India.","english_definition":"A coarse woolen blanket or shawl, especially one made in India.","examples":[{"sentence":"She wrapped herself in a warm campal to ward off the evening chill.","translation":"彼女は夕方の寒さをしのぐために、暖かいカンパルに身を包んだ。"}],"collocations":["woolen campal","Indian campal"],"synonyms":["blanket","shawl","wrap"],"antonyms":[]}],"etymology":{"value":"Likely derived from a regional Indian language. Further research needed for definitive origin.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkæmpəl/","syllables":"cam-pal"},"inflection":{"noun_plural":"campals"},"usage_notes":{"explanation":"The word 'campal' is relatively rare in modern English. It refers specifically to a type of coarse woolen blanket or shawl, often associated with India. It is more likely to be encountered in literature or historical contexts related to India.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She used a campal to pitch her tent.","correct":"✓ She used a tent to camp.","note":"'Campal' is a blanket, not camping equipment."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["pashmina","shawl","blanket","khadi"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'campal' is not commonly used in modern English. It is a specialized term referring to a specific type of woolen blanket or shawl, often of Indian origin. Its usage is primarily limited to contexts discussing Indian textiles or historical accounts. Due to its rarity, it is unlikely to be encountered in everyday conversation or general reading material."},"example_sentences":[{"sentence":"The villagers used campals to protect themselves from the harsh winter winds.","translation":"村人たちは、厳しい冬の風から身を守るためにカンパルを使った。","type":"noun","meaning_category":"blanket/shawl"},{"sentence":"He purchased a beautifully woven campal as a souvenir from his trip to India.","translation":"彼はインド旅行の土産として、美しく織られたカンパルを購入した。","type":"noun","meaning_category":"blanket/shawl"}]}