{"word":"Avidin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アビジン：卵白中に存在する糖タンパク質で、ビタミンB7であるビオチンと非常に強く結合する。","english_definition":"A glycoprotein present in egg white that binds very tightly to biotin (vitamin B7).","examples":[{"sentence":"Avidin is used in biochemistry and molecular biology for its strong affinity to biotin.","translation":"アビジンはビオチンに対する強い親和性のため、生化学および分子生物学で使用される。"}],"collocations":["avidin-biotin interaction","avidin-biotin complex","streptavidin"],"synonyms":["glycoprotein"],"antonyms":[]}],"etymology":{"value":"Derived from 'avid' (eager, greedy) + '-in' (suffix used for proteins). Refers to avidin's 'eager' or 'greedy' binding to biotin.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈævɪdɪn/","syllables":"Av-i-din"},"inflection":{"noun_plural":"Avidins"},"usage_notes":{"explanation":"Avidin is notable for its extremely high binding affinity to biotin (Vitamin B7). This strong interaction is widely exploited in various biochemical assays, diagnostics, and biotechnological applications. Streptavidin, a similar protein produced by Streptomyces bacteria, is also commonly used and is preferred in some applications due to its lack of glycosylation, resulting in lower non-specific binding.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Avidin is a vitamin.","correct":"✓ Avidin binds to a vitamin (biotin).","note":"Avidin is a protein, not a vitamin. It binds strongly to the vitamin biotin."}],"priority":"★☆☆"},"related_words":{"derivatives":["streptavidin","biotin"],"related_terms":["biochemistry","molecular biology","ELISA","immunohistochemistry"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency (scientific/technical context)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Avidin is a specialized term primarily encountered in the context of biochemistry, molecular biology, and related scientific fields. Understanding its function requires familiarity with basic concepts of protein-ligand interactions and the role of biotin in biological processes. The term is rarely used in general conversation or non-scientific contexts."},"example_sentences":[{"sentence":"The avidin-biotin system is a powerful tool in many biological assays.","translation":"アビジン-ビオチン系は、多くの生物学的アッセイにおける強力なツールである。","type":"noun","meaning_category":"biochemistry"},{"sentence":"Avidin is often used to purify biotinylated molecules.","translation":"アビジンは、ビオチン化された分子を精製するためによく使用される。","type":"noun","meaning_category":"molecular biology"}]}