{"word":"Mylar","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"マイラー：ポリエチレンテレフタレート (PET) フィルムの商品名、高い引張強度と絶縁性を持つ","english_definition":"a proprietary name for a polyester film made from polyethylene terephthalate (PET), known for its high tensile strength and insulating properties.","examples":[{"sentence":"Mylar is often used in balloons because it can hold helium for a long time.","translation":"マイラーはヘリウムを長時間保持できるため、風船によく使用されます。"},{"sentence":"The spacecraft's thermal insulation included layers of Mylar.","translation":"宇宙船の断熱材にはマイラーの層が含まれていました。"}],"collocations":["Mylar balloon","Mylar film","Mylar sheet","Mylar insulation"],"synonyms":["polyester film","PET film"],"antonyms":[]}],"etymology":{"value":"The name 'Mylar' is a trademark of DuPont Teijin Films.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmaɪlɑːr/","syllables":"My-lar"},"inflection":{"notes":"It is a noun, so it has no inflection."},"usage_notes":{"explanation":"Mylar is a specific type of polyester film known for its strength, durability, and insulating properties. It's used in a variety of applications, including balloons, packaging, and insulation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to buy some mylars for the party.","correct":"✓ I need to buy some Mylar balloons for the party.","note":"'Mylar' is a material, not the item itself. Specify 'Mylar balloons' or 'Mylar sheets' etc."}],"priority":"★★☆"},"related_words":{"derivatives":["Mylar balloon (マイラー風船)","PET (Polyethylene terephthalate)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Mylar' is a specific type of polyester film. It is a trademarked name, so it always starts with a capital letter. Its main uses are in products that require strength and insulation, such as balloons and some types of packaging. It is a technical term, so it is not used in everyday conversation. "},"example_sentences":[{"sentence":"The emergency blanket was made of a thin layer of Mylar.","translation":"その緊急用ブランケットは薄いマイラーの層でできていた。","type":"noun","meaning_category":"material"},{"sentence":"The company uses Mylar packaging to protect its products from moisture.","translation":"その会社は製品を湿気から守るためにマイラー包装を使用している。","type":"noun","meaning_category":"material"}]}