{"word":"pre-experiment","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"予備実験、事前実験","english_definition":"A preliminary experiment conducted before the main experiment, often to test procedures, equipment, or hypotheses.","examples":[{"sentence":"The researchers conducted a pre-experiment to ensure the equipment was functioning correctly.","translation":"研究者たちは、機器が正しく機能していることを確認するために予備実験を行った。"},{"sentence":"The pre-experiment helped them refine their methodology before the actual study.","translation":"事前実験は、実際の研究の前に彼らが方法論を洗練するのに役立った。"}],"collocations":["conduct a pre-experiment","run a pre-experiment","design a pre-experiment","pre-experiment results"],"synonyms":["pilot study","feasibility study","trial run","preliminary study"],"antonyms":["main experiment","post-experiment","follow-up experiment"]}],"etymology":{"value":"The word is formed by adding the prefix 'pre-' (meaning 'before') to the word 'experiment'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːɪkˈspɛrɪmənt/","syllables":"pre-ex-per-i-ment"},"inflection":{"noun_plural":"pre-experiments"},"usage_notes":{"explanation":"A 'pre-experiment' is a crucial step in research design, allowing researchers to identify and address potential issues before committing to the full-scale experiment. It helps in optimizing the experimental setup, refining procedures, and ensuring the validity and reliability of the results.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We did an experiment before the pre-experiment.","correct":"✓ We conducted a pilot study before the main experiment.","note":"The 'pre-experiment' is specifically a preliminary experiment, not just any experiment done beforehand. Use 'pilot study' or 'preliminary study' for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["pre-experimental (adjective)"],"related_terms":["experiment","pilot study","control group","variable","hypothesis","methodology"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized term used in research and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pre-experiment' refers to a trial run or preliminary test conducted before the main experiment. It's used to refine the experimental design, test equipment, and identify potential problems. This term is commonly used in research and academic settings."},"example_sentences":[{"sentence":"The pre-experiment revealed that the participants found the instructions confusing.","translation":"予備実験で、参加者が指示を混乱していることが明らかになった。","type":"noun","meaning_category":"予備実験"},{"sentence":"The pre-experiment was essential for validating the research protocol.","translation":"予備実験は、研究プロトコルを検証するために不可欠だった。","type":"noun","meaning_category":"事前実験"},{"sentence":"Based on the pre-experiment results, we adjusted the dosage of the medication.","translation":"予備実験の結果に基づいて、薬の投与量を調整した。","type":"noun","meaning_category":"事前実験"}]}