{"word":"Wycliffite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ウィクリフ派の人、ウィクリフの信奉者","english_definition":"A follower of John Wycliffe; a member of a religious movement in the 14th and 15th centuries that rejected papal authority and advocated for the translation of the Bible into the vernacular.","examples":[{"sentence":"The Wycliffites were persecuted for their beliefs.","translation":"ウィクリフ派の人々は、その信仰のために迫害された。"},{"sentence":"Many Wycliffites were burned at the stake for heresy.","translation":"多くのウィクリフ派の人々が異端の罪で火あぶりにされた。"}],"collocations":["Wycliffite beliefs","Wycliffite movement","Wycliffite Bible"],"synonyms":["Lollard"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ウィクリフ派の、ウィクリフ派に関する","english_definition":"Relating to or characteristic of John Wycliffe or the Wycliffites.","examples":[{"sentence":"Wycliffite doctrines challenged the authority of the Church.","translation":"ウィクリフ派の教義は教会の権威に異議を唱えた。"},{"sentence":"The Wycliffite translation of the Bible was widely circulated.","translation":"ウィクリフ派による聖書の翻訳は広く流布された。"}],"collocations":["Wycliffite doctrines","Wycliffite Bible","Wycliffite movement"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the name of John Wycliffe (c. 1320s–1384), an English theologian, philosopher, and reformer, with the suffix '-ite' indicating a follower or adherent.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɪklɪfaɪt/","syllables":"Wik-lif-fite"},"inflection":{"notes":"Plural form of the noun: Wycliffites. Adjective form does not change."},"usage_notes":{"explanation":"The term 'Wycliffite' refers to followers of John Wycliffe, a 14th-century English theologian who advocated for religious reforms, including translating the Bible into English. The Wycliffites challenged the authority of the papacy and promoted the idea that individuals should have direct access to the scriptures. The movement was influential in the later development of the Protestant Reformation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Wycliffite was a person.","correct":"✓ A Wycliffite was a person.","note":"'Wycliffite' is a noun that refers to a follower of Wycliffe, so it needs an article ('a' or 'the') when used as a singular countable noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["Wycliff (proper noun: referring to John Wycliffe)","Wycliffism (noun: the doctrines or principles of John Wycliffe)","Lollard (noun: a more general term for religious dissenters in England, often used interchangeably with Wycliffite, though Lollardy had broader origins)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized historical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Wycliffite' is a historical term referring to followers of John Wycliffe, a 14th-century English theologian and reformer. Understanding this word requires knowledge of medieval religious history and the context of the early challenges to the Catholic Church's authority. It is not a commonly used word in modern English.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **Wycliffites** faced severe persecution for translating the Bible into English.","translation":"ウィクリフ派の人々は、聖書を英語に翻訳したことで厳しい迫害を受けた。","type":"noun","meaning_category":"follower of John Wycliffe"},{"sentence":"**Wycliffite** ideas influenced later Protestant reformers.","translation":"ウィクリフ派の思想は、後のプロテスタントの改革者たちに影響を与えた。","type":"adjective","meaning_category":"relating to John Wycliffe"}]}