{"word":"hydrology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"水文学","english_definition":"the branch of science concerned with the properties, distribution, and effects of water on the earth's surface, in the soil and underlying rocks, and in the atmosphere.","examples":[{"sentence":"Hydrology is crucial for managing water resources.","translation":"水文学は水資源管理にとって非常に重要です。"},{"sentence":"The course covers various aspects of hydrology, including groundwater and surface water.","translation":"このコースでは、地下水や地表水など、水文学のさまざまな側面を扱います。"},{"sentence":"Hydrology studies the water cycle and its interaction with the environment.","translation":"水文学は、水の循環と環境との相互作用を研究します。"}],"collocations":["applied hydrology (応用水文学)","environmental hydrology (環境水文学)","groundwater hydrology (地下水水文学)","surface water hydrology (地表水水文学)","urban hydrology (都市水文学)","study of hydrology (水文学の研究)","principles of hydrology (水文学の原理)"],"synonyms":["water science","hydroscience"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hydro' (water) and 'logia' (study of).","priority":"★★★"},"pronunciation":{"ipa":"/haɪˈdrɒlədʒi/","syllables":"hy-drol-o-gy"},"inflection":{"noun_plural":"hydrologies (rarely used)"},"usage_notes":{"explanation":"Hydrology is a scientific field that focuses on the movement, distribution, and quality of water. It is an interdisciplinary field, drawing from geology, meteorology, environmental science, and engineering. It is essential for understanding and managing water resources, predicting floods, and addressing water-related environmental issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Hydrology is the study of the sea.","correct":"✓ Hydrology is the study of water on and below the Earth's surface, and in the atmosphere.","note":"Oceanography is the study of the sea."},{"incorrect":"✗ Hydrology is not important for flood prediction.","correct":"✓ Hydrology is very important for flood prediction.","note":"Hydrology provides the scientific basis for understanding and predicting floods."}],"priority":"★★☆"},"related_words":{"derivatives":["hydrologic (adjective: relating to hydrology)","hydrologist (noun: a scientist who studies hydrology)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Hydrology is a specialized term referring to the scientific study of water. It involves understanding how water moves on Earth, including rainfall, rivers, groundwater, and evaporation. This field is important for managing water resources, predicting floods, and dealing with water pollution. It's a more advanced topic, often encountered in science or environmental studies.","priority":"★★☆"},"example_sentences":[{"sentence":"The hydrologist used computer models to simulate the flow of water in the river.","translation":"その水文学者は、コンピューターモデルを使用して川の水の流れをシミュレーションしました。","type":"general","meaning_category":"study of water"},{"sentence":"The city hired a hydrology consultant to assess the impact of the new development on local water resources.","translation":"市は、新しい開発が地域の水資源に与える影響を評価するために、水文学コンサルタントを雇いました。","type":"applied","meaning_category":"water management"},{"sentence":"Understanding hydrology is crucial for designing effective irrigation systems.","translation":"水文学を理解することは、効果的な灌漑システムを設計する上で非常に重要です。","type":"practical","meaning_category":"engineering"}]}