{"word":"unbrilliantly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"輝かしくなく、見事にではなく、平凡に、つまらなく","english_definition":"In a manner that is not brilliant; without brilliance or excellence; ordinarily; dully.","examples":[{"sentence":"The play was unbrilliantly performed, lacking the spark and energy it needed.","translation":"その劇は輝きを欠いた平凡な演技で、必要な活気とエネルギーが不足していた。"},{"sentence":"He unbrilliantly completed the task, meeting the basic requirements but showing no particular skill or creativity.","translation":"彼はその課題を平凡にこなし、基本的な要件は満たしたが、特別なスキルや創造性は見られなかった。"},{"sentence":"The team played unbrilliantly, failing to impress the audience with their performance.","translation":"チームは平凡なプレーをし、そのパフォーマンスで観客を感動させることはできなかった。"}],"collocations":["perform unbrilliantly","complete unbrilliantly","play unbrilliantly","execute unbrilliantly","write unbrilliantly","speak unbrilliantly"],"synonyms":["ordinarily","dullly","banally","unimpressively","poorly","mediocrely","terribly","badly"],"antonyms":["brilliantly","excellently","superbly","wonderfully","impressively","remarkably","splendidly","magnificently"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the adverb 'brilliantly'. 'Brilliantly' comes from 'brilliant', which originates from the Italian word 'brillante' (shining, glittering), derived from 'brillare' (to shine).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈbrɪliəntli/","syllables":"un-bril-li-ant-ly"},"inflection":{"notes":"Adverbs do not typically inflect. This word does not have different forms based on tense or number."},"usage_notes":{"explanation":"'Unbrilliantly' is used to describe actions or performances that lack brilliance, skill, or excellence. It indicates something is done in an ordinary, unimpressive, or even poor manner. It's the direct opposite of doing something 'brilliantly'. This adverb is relatively rare and often implies a negative assessment of the quality of the action.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She unbrilliantly is a good student.","correct":"✓ She is unbrilliantly performing as a student.","note":"'Unbrilliantly' is an adverb and should modify a verb, not a noun or adjective directly. It describes how an action is performed, not what something is."},{"incorrect":"✗ The sun shone unbrilliantly today.","correct":"✓ The sun shone dimly today.","note":"While technically correct, using 'unbrilliantly' to describe the sun shining might sound awkward. A more common and natural word choice would be 'dimly'."}],"priority":"★★☆"},"related_words":{"derivatives":["unbrilliant (adjective: not brilliant)","brilliantly (adverb: in a brilliant manner)","brilliance (noun: the quality of being brilliant)","brilliant (adjective: exceptionally clever or talented; dazzlingly bright)"],"idioms_phrases":["There are no common idioms or phrases that include 'unbrilliantly' due to its rarity."],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Rare and specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unbrilliantly' is an uncommon adverb used to describe the manner in which something is done without brilliance or excellence. It's formed by adding the prefix 'un-' to 'brilliantly', making it a straightforward antonym. Its rarity makes it more suitable for advanced language users who need to express nuanced negative assessments of performance or actions. It's more frequently replaced by simpler, more common adverbs like 'poorly' or 'dullly'."},"example_sentences":[{"sentence":"The presentation was delivered unbrilliantly, failing to engage the audience.","translation":"そのプレゼンテーションは平凡な出来で、聴衆を引き込むことができなかった。","type":"general","meaning_category":"manner of performance"},{"sentence":"He unbrilliantly answered the questions, giving simple and uninspired responses.","translation":"彼は質問につまらなく答え、単純で刺激のない返答をした。","type":"general","meaning_category":"quality of response"},{"sentence":"The team executed the play unbrilliantly, resulting in a loss.","translation":"チームは平凡なプレーを実行し、その結果、敗北につながった。","type":"general","meaning_category":"quality of execution"}]}