{"word":"anti-tourism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"反観光、観光反対、観光客排斥","english_definition":"Opposition to tourism, especially mass tourism, due to its negative impacts on local communities, the environment, and culture.","examples":[{"sentence":"Anti-tourism sentiment is growing in cities like Barcelona and Venice.","translation":"バルセロナやベネチアのような都市では、反観光感情が高まっている。"},{"sentence":"The anti-tourism movement seeks to protect local residents' quality of life.","translation":"反観光運動は、地元住民の生活の質を守ることを目指している。"},{"sentence":"Overcrowding and rising prices are fueling anti-tourism protests.","translation":"過密状態と物価上昇が、反観光デモを煽っている。"}],"collocations":["anti-tourism movement","anti-tourism sentiment","anti-tourism protest","anti-tourism campaign","anti-tourism backlash"],"synonyms":["tourism opposition","tourism resistance","tourism criticism"],"antonyms":["pro-tourism","tourism promotion","tourism support"]},{"part_of_speech":"adjective","definition":"反観光の、観光に反対する","english_definition":"Opposing or critical of tourism, especially mass tourism.","examples":[{"sentence":"The city council is facing anti-tourism pressure from residents.","translation":"市議会は住民からの反観光圧力に直面している。"},{"sentence":"An anti-tourism group organized a demonstration against cruise ships.","translation":"反観光団体が、クルーズ船に対するデモを組織した。"},{"sentence":"The article discusses the anti-tourism effects of Airbnb.","translation":"その記事は、Airbnbの反観光的な影響について論じている。"}],"collocations":["anti-tourism policy","anti-tourism measures","anti-tourism group","anti-tourism activist"],"synonyms":["tourism-critical","tourism-opposing"],"antonyms":["pro-tourism","tourism-friendly"]}],"etymology":{"value":"'Anti-' (against) + 'tourism'. Reflects growing concerns about the negative impacts of mass tourism.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈtʊərɪzəm/","syllables":"an-ti-tour-ism"},"inflection":{"notes":"Typically used as a noun or adjective. No standard plural form for the noun (anti-tourism). Adjective form does not inflect."},"usage_notes":{"explanation":"'Anti-tourism' refers to the opposition to tourism, particularly when it is seen as excessive or harmful. This opposition often stems from concerns about environmental damage, cultural disruption, increased cost of living for locals, and overcrowding. The term is often used in the context of popular tourist destinations experiencing 'overtourism'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am very anti-tourism. I hate all tourists.","correct":"✓ I am against mass tourism because it harms the environment.","note":"It's important to specify which aspects of tourism are being opposed. Blanket statements can be misconstrued. Focus on the specific issues, such as 'mass tourism' or 'unsustainable tourism practices'."},{"incorrect":"✗ The city is very anti-tourist.","correct":"✓ The city is experiencing anti-tourism sentiment due to overtourism.","note":"'Anti-tourism' describes a sentiment or movement, not a characteristic of a place. It's more accurate to say a place 'is experiencing anti-tourism sentiment' or 'has anti-tourism policies'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"related_concepts":["overtourism","sustainable tourism","responsible tourism","community-based tourism","tourism gentrification"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in recent years.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anti-tourism' is a term used to describe opposition to tourism, especially when it negatively impacts local communities, the environment, or culture. It's a more complex concept than simply 'not liking tourists.' It involves understanding the systemic issues caused by mass tourism and advocating for more sustainable and responsible approaches. The term is often used in academic discussions, news reports about overtourism, and activist circles. Understanding the nuances of 'anti-tourism' requires a grasp of related concepts like 'overtourism' and 'sustainable tourism'."},"example_sentences":[{"sentence":"The rise of **anti-tourism** is a direct result of unsustainable tourism practices.","translation":"反観光の台頭は、持続不可能な観光慣行の直接的な結果である。","type":"noun","meaning_category":"反観光"},{"sentence":"The **anti-tourism** protests were organized by local residents concerned about rising rents.","translation":"反観光デモは、家賃の高騰を懸念する地元住民によって組織された。","type":"adjective","meaning_category":"反観光の"},{"sentence":"Many popular destinations are grappling with the challenges of **anti-tourism**.","translation":"多くの人気観光地が、反観光の課題に取り組んでいる。","type":"noun","meaning_category":"反観光"},{"sentence":"The city council is trying to balance the economic benefits of tourism with the growing **anti-tourism sentiment**.","translation":"市議会は、観光の経済的利益と高まる反観光感情とのバランスを取ろうとしている。","type":"noun","meaning_category":"反観光"},{"sentence":"An **anti-tourism** campaign aims to educate visitors about responsible travel.","translation":"反観光キャンペーンは、訪問者に責任ある旅行について啓発することを目指している。","type":"adjective","meaning_category":"反観光の"}]}