{"word":"rapport-driven","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"信頼関係主導の、親密な関係を重視する","english_definition":"Characterized by or emphasizing the development and maintenance of a positive and harmonious relationship, especially in a professional or interpersonal context.","examples":[{"sentence":"The sales team adopted a rapport-driven approach to build stronger customer relationships.","translation":"その営業チームは、より強固な顧客関係を築くために、信頼関係主導のアプローチを採用しました。"},{"sentence":"A rapport-driven therapist focuses on creating a safe and trusting environment for their patients.","translation":"信頼関係主導のセラピストは、患者のために安全で信頼できる環境を作ることに重点を置いています。"},{"sentence":"Effective communication in a rapport-driven workplace involves active listening and empathy.","translation":"信頼関係主導の職場における効果的なコミュニケーションには、積極的な傾聴と共感が含まれます。"}],"collocations":["rapport-driven approach","rapport-driven sales","rapport-driven therapy","rapport-driven communication","rapport-driven leadership"],"synonyms":["relationship-focused","connection-oriented","empathy-based","trust-based","people-centered"],"antonyms":["task-oriented","results-driven","impersonal","detached"]}],"etymology":{"value":"The term is formed by combining 'rapport' (a harmonious relationship) with 'driven' (motivated or guided by).","priority":"★★★"},"pronunciation":{"ipa":"/ræˈpɔːrˌdrɪvən/","syllables":"rap-port-dri-ven"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Rapport-driven' describes a method, strategy, or individual that prioritizes building and maintaining a strong, positive connection with others. It emphasizes the importance of mutual understanding, trust, and empathy in achieving goals or fostering positive interactions. This term is commonly used in fields such as sales, therapy, education, and leadership, where strong interpersonal relationships are crucial for success.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is rapport-driving.","correct":"✓ The company is rapport-driven.","note":"'Rapport-driven' is an adjective, not a verb. Use it to describe something that is characterized by a focus on rapport."},{"incorrect":"✗ He is a very rapport person.","correct":"✓ He is a very rapport-driven person.","note":"Use 'rapport-driven' to describe someone who emphasizes building rapport."}],"priority":"★★☆"},"related_words":{"derivatives":["rapport (noun): a close and harmonious relationship in which the people or groups concerned understand each other's feelings or ideas and communicate well."],"phrases":["build rapport","establish rapport","maintain rapport"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in usage.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'rapport-driven' is a compound adjective used to describe something that is motivated or guided by the desire to build and maintain a strong, positive relationship with others. It implies a focus on empathy, trust, and mutual understanding. This term is typically used in professional contexts, such as sales, therapy, or leadership, where strong interpersonal connections are important for achieving success. Understanding the meaning of 'rapport' is essential for comprehending this term."},"example_sentences":[{"sentence":"The company's success is attributed to its rapport-driven customer service.","translation":"その会社の成功は、信頼関係主導の顧客サービスに起因しています。","type":"general","meaning_category":"General"},{"sentence":"A rapport-driven teaching style can improve student engagement and learning outcomes.","translation":"信頼関係主導の教育スタイルは、生徒の関与と学習成果を向上させることができます。","type":"education","meaning_category":"Education"},{"sentence":"In a rapport-driven negotiation, both parties prioritize building a positive working relationship.","translation":"信頼関係主導の交渉では、両当事者が良好な協力関係の構築を優先します。","type":"business","meaning_category":"Business"}]}