{"word":"cyriological","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"relating to or dealing with church doctrine or theology.","english_definition":"Relating to or dealing with church doctrine or theology.","examples":[{"sentence":"The cyriological debates of the early church were often heated.","translation":"初期教会の教義に関する議論はしばしば白熱した。"},{"sentence":"He is a cyriological scholar with a deep understanding of Christian theology.","translation":"彼はキリスト教神学に対する深い理解を持つ教義学者である。"}],"collocations":["cyriological study","cyriological debate","cyriological scholar","cyriological treatise"],"synonyms":["theological","doctrinal","ecclesiastical","religious"],"antonyms":["secular","profane"]}],"etymology":{"value":"Derived from the Greek word 'kyrios' meaning 'lord' or 'master,' combined with '-logia' meaning 'study of.' Thus, cyriological relates to the study of the Lord, specifically in the context of church doctrine.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsaɪriəˈlɒdʒɪkəl/","syllables":"cy-ri-o-log-i-cal"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparative and superlative forms (which are rarely used for this word)."},"usage_notes":{"explanation":"'Cyriological' is a relatively uncommon term, primarily used in theological or academic contexts. It refers to the study or discussion of church doctrines, particularly those pertaining to the nature and role of Christ as Lord. It's often used in historical or analytical discussions of Christian theology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cyriological aspects of the novel were interesting.","correct":"✓ The theological aspects of the novel were interesting.","note":"Unless the novel specifically deals with church doctrine, 'theological' is a more appropriate and widely understood term."},{"incorrect":"✗ He has a strong cyriological opinion.","correct":"✓ He has a strong theological opinion.","note":"'Theological' is more commonly used to describe opinions related to religious beliefs."}],"priority":"★★☆"},"related_words":{"derivatives":["cyriology (noun): the study of church doctrine or theology.","kyrios (noun): Greek word for 'lord' or 'master,' often used in Christian contexts to refer to Christ."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'cyriological' is highly specialized and rarely encountered outside of advanced theological or academic discussions. Understanding requires familiarity with theological terminology and concepts. It is not suitable for general use."},"example_sentences":[{"sentence":"The professor's lecture focused on the cyriological implications of the Nicene Creed.","translation":"教授の講義はニカイア信条の教義的な意味合いに焦点を当てていた。","type":"adjective","meaning_category":"theological"},{"sentence":"A cyriological analysis of the text reveals its emphasis on Christ's divinity.","translation":"そのテキストの教義的分析は、キリストの神性に重点を置いていることを明らかにしている。","type":"adjective","meaning_category":"doctrinal"}]}