{"word":"Subordinationist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(キリスト教神学) 三位一体の位階説を唱える人","english_definition":"A person who believes in subordinationism, a theological doctrine that holds that Jesus Christ and/or the Holy Spirit are subordinate to God the Father in nature and being.","examples":[{"sentence":"The early church fathers were sometimes accused of being subordinationists.","translation":"初期の教父たちは、時に位階説者であると非難された。"}],"collocations":[],"synonyms":[],"antonyms":[],"notes":"Often used in the context of discussions about early Christian theology and the nature of the Trinity."},{"part_of_speech":"adjective","definition":"位階説の","english_definition":"Relating to or characterized by subordinationism.","examples":[{"sentence":"Subordinationist views were eventually rejected by mainstream Christian doctrine.","translation":"位階説的な見解は、最終的に主流のキリスト教の教義によって拒否された。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'subordination' (the act of subordinating) + '-ist' (a person who adheres to a particular doctrine or belief).","priority":"★★★"},"pronunciation":{"ipa":"/səˌbɔːrdɪˈneɪʃənɪst/","syllables":"sub-or-di-NA-tion-ist"},"inflection":{"noun_plural":"Subordinationists"},"usage_notes":{"explanation":"The term 'subordinationist' is typically used in a historical or theological context to describe those who held beliefs about the Trinity that were later deemed heretical by orthodox Christianity. It's important to use this term with sensitivity and accuracy, as it relates to complex and often contentious theological debates.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["subordination","subordinate","subordinationism"],"related_terms":["Arianism","Semi-Arianism","Trinity","Modalism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. This term is primarily used in theological or historical discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'subordinationist' is highly specialized and requires a strong understanding of Christian theology, particularly the doctrine of the Trinity. It is not commonly used outside of academic or theological contexts. Understanding the term requires familiarity with concepts such as the nature of God, the relationship between the Father, Son, and Holy Spirit, and the historical development of Christian doctrine."},"example_sentences":[{"sentence":"Some scholars argue that Origen held subordinationist views regarding the relationship between the Father and the Son.","translation":"一部の学者は、オリゲネスが父と子の関係に関して位階説的な見解を持っていたと主張している。","type":"general","meaning_category":"theological doctrine"},{"sentence":"The Nicene Creed was formulated in part to refute subordinationist teachings.","translation":"ニカイア信条は、部分的には位階説的な教えに反論するために作成された。","type":"historical","meaning_category":"historical context"}]}