{"word":"Oxfordist","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(歴史、文学) オックスフォード大学出身者、またはオックスフォード大学の学風を支持する人","english_definition":"A person who is, or supports the style of, Oxford University.","examples":[{"sentence":"He is an Oxfordist through and through, having spent his entire academic life at the university.","translation":"彼は筋金入りのオックスフォード大学信奉者で、学究生活のすべてを同大学で過ごした。"}],"collocations":["Oxfordist scholar","Oxfordist tradition"],"synonyms":["Oxonian"],"antonyms":["N/A"]},{"part_of_speech":"noun","definition":"(文学) シェイクスピアの正体はオックスフォード伯エドワード・ド・ヴェアであると主張する人","english_definition":"A proponent of the Oxfordian theory of Shakespeare authorship, which claims that Edward de Vere, 17th Earl of Oxford, was the true author of the works of William Shakespeare.","examples":[{"sentence":"The Oxfordists believe that there is compelling evidence linking the Earl of Oxford to the Shakespearean plays.","translation":"オックスフォード派は、オックスフォード伯とシェイクスピア劇を結びつける説得力のある証拠があると信じている。"}],"collocations":["Shakespeare Oxfordist","Oxfordian theory"],"synonyms":["Oxfordian","Vereian"],"antonyms":["Stratfordian"]}],"etymology":{"value":"Formed from 'Oxford' + '-ist'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɒksfərdɪst/","syllables":"Ox-ford-ist"},"inflection":{"noun_plural":"Oxfordists"},"usage_notes":{"explanation":"The term 'Oxfordist' has two distinct meanings. The first refers to someone associated with Oxford University. The second, and more controversial, refers to a supporter of the Oxfordian theory of Shakespearean authorship. Context is crucial to understanding which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Oxfordist from Cambridge.","correct":"✓ He is an Oxfordist from Oxford.","note":"Oxfordist refers to someone associated with Oxford, not Cambridge."}],"priority":"★★☆"},"related_words":{"derivatives":["Oxford","Oxfordian"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Oxfordist' is relatively uncommon. It can refer to someone associated with Oxford University or, more specifically, to someone who believes that Edward de Vere, Earl of Oxford, was the real author of Shakespeare's works. Understanding the context is essential to interpreting the intended meaning."},"example_sentences":[{"sentence":"As a lifelong Oxfordist, he defended the university's traditions fiercely.","translation":"生涯のオックスフォード大学信奉者として、彼は大学の伝統を激しく擁護した。","type":"noun","meaning_category":"Oxford University supporter"},{"sentence":"The Oxfordist presented new evidence to support the theory that the Earl of Oxford wrote Shakespeare's plays.","translation":"オックスフォード派は、オックスフォード伯がシェイクスピアの戯曲を書いたという説を裏付ける新たな証拠を提示した。","type":"noun","meaning_category":"Shakespeare authorship theory supporter"}]}