{"word":"practicant","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"実習生、研修生、修行者","english_definition":"A person who is actively engaged in a particular practice, discipline, or profession, especially one who is learning or undergoing training.","examples":[{"sentence":"She is a practicant in the hospital's nursing program.","translation":"彼女は病院の看護プログラムの実習生です。"},{"sentence":"He worked as a legal practicant before becoming a full-fledged lawyer.","translation":"彼は一人前の弁護士になる前に、法律の実習生として働いていました。"},{"sentence":"The yoga studio welcomes practicants of all levels.","translation":"そのヨガスタジオはあらゆるレベルの修行者を歓迎します。"}],"collocations":["medical practicant (医療実習生)","legal practicant (法律実習生)","yoga practicant (ヨガの修行者)","religious practicant (宗教の修行者)"],"synonyms":["trainee","intern","apprentice","novice","student","learner"],"antonyms":["expert","professional","master"]}],"etymology":{"value":"Derived from the word 'practice,' with the suffix '-ant' indicating a person who performs the action.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpræktɪkənt/","syllables":"prac-ti-cant"},"inflection":{"noun_plural":"practicants"},"usage_notes":{"explanation":"The term 'practicant' is used to describe someone who is actively involved in a particular field or discipline, often in a learning or training capacity. It implies a hands-on approach and active participation in the practice itself. It can be used in various contexts, including medicine, law, religion, and other fields.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a practice in the hospital.","correct":"✓ He is a practicant in the hospital.","note":"'Practice' is a noun referring to the activity itself, while 'practicant' is the person doing the activity."},{"incorrect":"✗ She is practicing as a doctor.","correct":"✓ She is a medical practicant.","note":"'Practicing' is the verb form, while 'practicant' is the noun form describing the person."}],"priority":"★★☆"},"related_words":{"derivatives":["practice (noun, verb)","practical (adjective)","practically (adverb)"],"related_terms":["internship","apprenticeship","training","residency"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'practicant' is a more formal and less common term for someone who is actively engaged in a practice, especially in a learning or training capacity. It is often used in professional or academic contexts to describe individuals undergoing training in a specific field, such as medicine or law. The term emphasizes the active participation and hands-on experience of the individual in the practice itself."},"example_sentences":[{"sentence":"As a medical practicant, she assisted the senior doctors in surgery.","translation":"医療実習生として、彼女は上級医師の手術を補助しました。","type":"example","meaning_category":"Medical Training"},{"sentence":"The legal practicant researched case law and drafted legal documents.","translation":"法律実習生は判例を調査し、法的文書を作成しました。","type":"example","meaning_category":"Legal Training"},{"sentence":"He is a dedicated yoga practicant who attends classes regularly.","translation":"彼は熱心なヨガの修行者で、定期的にクラスに参加しています。","type":"example","meaning_category":"Yoga Practice"}]}