{"word":"Hegelian-leaning","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"ヘーゲル主義に傾倒した、ヘーゲル主義的な傾向を持つ","english_definition":"Having a tendency towards or being influenced by Hegelianism, the philosophy of G.W.F. Hegel.","examples":[{"sentence":"The professor's lectures were often described as Hegelian-leaning, emphasizing dialectical reasoning.","translation":"その教授の講義は、弁証法的推論を強調する、ヘーゲル主義的な傾向があるとよく評された。"},{"sentence":"The author's Hegelian-leaning perspective shaped his interpretation of historical events.","translation":"その著者のヘーゲル主義的な視点は、彼の歴史的出来事の解釈を形作った。"}],"collocations":["Hegelian-leaning interpretation","Hegelian-leaning perspective","Hegelian-leaning analysis","Hegelian-leaning thought"],"synonyms":["Hegelian-influenced","Hegelian-inspired","Hegelian","dialectical"],"antonyms":["anti-Hegelian","non-Hegelian","un-Hegelian"]}],"etymology":{"value":"Formed by combining 'Hegelian' (referring to G.W.F. Hegel or his philosophy) with 'leaning' (indicating a tendency or inclination).","priority":"medium"},"pronunciation":{"ipa":"/hɪˈɡeɪliən ˈliːnɪŋ/","syllables":"He-ge-li-an Lean-ing"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Hegelian-leaning' is used to describe something that shows an affinity for or is influenced by the philosophical ideas of G.W.F. Hegel, particularly his emphasis on dialectics, historical progress, and the importance of reason. It suggests a tendency rather than a strict adherence to Hegelianism.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The Hegelian leaning philosopher.","correct":"The Hegelian-leaning philosopher.","note":"The hyphen is important to connect the two words and create a compound adjective."}],"priority":"low"},"related_words":{"derivatives":["Hegelianism (noun: the philosophy of G.W.F. Hegel)","Hegelian (adjective/noun: relating to or a follower of Hegel)","leaning (noun: a tendency or inclination)"],"phrases":["Hegelian dialectic","Hegelian idealism"],"priority":"medium"},"level_frequency":{"frequency_google_ngram":"Low frequency. This is a specialized term used primarily in academic or philosophical contexts.","priority":"low"},"readability_explanation":{"level":"C2","text":"The term 'Hegelian-leaning' is a complex adjective used to describe something that shows an inclination towards or is influenced by the philosophy of G.W.F. Hegel. It is primarily used in academic or philosophical discourse. Understanding the term requires familiarity with Hegelian philosophy, particularly concepts such as dialectics and historical progress. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The art critic offered a Hegelian-leaning critique of the modern sculpture, focusing on its historical context and dialectical tensions.","translation":"その美術評論家は、現代彫刻の歴史的背景と弁証法的緊張に焦点を当て、ヘーゲル主義的な傾向のある批評を行った。","type":"adjective","meaning_category":"philosophical influence"},{"sentence":"Her research on social movements adopted a Hegelian-leaning approach, emphasizing the role of ideas in shaping historical change.","translation":"彼女の社会運動に関する研究は、歴史的変化を形作る上での思想の役割を強調する、ヘーゲル主義的なアプローチを採用した。","type":"adjective","meaning_category":"methodological approach"}]}