{"word":"spareable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(時間・お金・物などが) 余裕のある、割ける、余分な","english_definition":"Available as an extra or substitute; able to be spared or given away.","examples":[{"sentence":"Do you have any spareable time this week to help me with the project?","translation":"今週、プロジェクトを手伝ってくれる余裕のある時間はありますか？"},{"sentence":"We need to find a spareable room to use as a temporary office.","translation":"一時的なオフィスとして使える余裕のある部屋を見つける必要があります。"},{"sentence":"Are there any spareable resources we can allocate to this task?","translation":"このタスクに割り当てることができる余裕のあるリソースはありますか？"}],"collocations":["spareable time (余裕のある時間)","spareable room (余裕のある部屋)","spareable resources (余裕のある資源)","spareable cash (余裕のある現金)","spareable parts (予備部品)"],"synonyms":["available","extra","additional","reserve","surplus","redundant"],"antonyms":["essential","necessary","required","indispensable","scarce","limited"]},{"part_of_speech":"adjective","definition":"(人・動物が) 助命に値する、見逃せる","english_definition":"Deserving to be spared or shown mercy; able to be forgiven or excused.","examples":[{"sentence":"The prisoner pleaded for his life, hoping he would be deemed spareable.","translation":"囚人は助命を嘆願し、見逃してもらえることを願った。"},{"sentence":"The injured animal looked up at the hunter, its eyes conveying a plea to be spareable.","translation":"怪我をした動物は猟師を見上げ、その目は助命を懇願しているようだった。"},{"sentence":"In the end, the judge found the defendant's actions understandable enough to be considered spareable.","translation":"最終的に、裁判官は被告の行動を、見逃すに値するほど理解できると判断した。"}],"collocations":["deemed spareable (助命に値すると判断される)","considered spareable (見逃せると思われる)","judged spareable (助命に値すると判断される)","found spareable (助命に値すると判断される)"],"synonyms":["forgivable","excusable","pardonable","remissible","venial","condonable"],"antonyms":["unforgivable","inexcusable","unpardonable","irremissible","incondonable"]}],"etymology":{"value":"The word \"spareable\" is derived from the verb \"spare\" by adding the suffix \"-able\". \"Spare\" comes from Old English \"sparian,\" meaning \"to refrain from harming or destroying; to use economically; to give up, let go.\" The suffix \"-able\" indicates the capability or suitability of being acted upon, in this case, being spared.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspɛərəbəl/","syllables":"spare-a-ble"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs (e.g., \"easily spareable\") and used in comparative and superlative forms (e.g., \"more spareable,\" \"most spareable\"), though these are less common."},"usage_notes":{"explanation":"The word \"spareable\" is not as commonly used as its root word \"spare.\" It is most often used to describe resources, time, or items that are available in excess or can be given away without causing hardship. It can also, though less frequently, refer to someone or something that deserves to be spared or shown mercy. The context usually clarifies which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a spareable car in the garage.","correct":"✓ He has a spare car in the garage.","note":"Use \"spare\" instead of \"spareable\" when referring to a car. \"Spare\" is more common and natural in this context."},{"incorrect":"✗ The criminal was spareable because of his age.","correct":"✓ The criminal was spared because of his age.","note":"Use \"spared\" (the past participle of \"spare\") to indicate that someone was shown mercy, rather than \"spareable.\""},{"incorrect":"✗ We have spareable money to invest.","correct":"✓ We have spare money to invest.","note":"Use \"spare\" instead of \"spareable\" when referring to money. \"Spare\" is more common and natural in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["spare (verb, noun, adjective)","sparing (adjective)","sparingly (adverb)","spareness (noun)"],"phrasal_verbs":["spare someone's feelings (〜の感情を害さないように気をつける)","spare no expense (費用を惜しまない)","spare the rod and spoil the child (可愛い子には旅をさせよ)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (The word is not common enough to be included in CEFR levels.)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'spareable' is relatively uncommon and may not be familiar to many English speakers. It is formed by adding the suffix '-able' to the verb 'spare,' indicating the capacity or suitability of being spared. It is used to describe something that is available as an extra or that can be given away without causing hardship, or to describe someone or something that deserves to be spared or shown mercy. Because of its relative rarity, it is more likely to be encountered in formal writing or specialized contexts."},"example_sentences":[{"sentence":"The company had a spareable budget this year, allowing them to invest in new technologies.","translation":"今年、会社には余裕のある予算があったため、新しい技術に投資することができた。","type":"adjective","meaning_category":"余裕のある"},{"sentence":"The defendant's youth made some jurors think he was spareable from a harsh sentence.","translation":"被告の若さから、一部の陪審員は彼が厳しい判決を免れるに値すると考えた。","type":"adjective","meaning_category":"助命に値する"},{"sentence":"With a spareable amount of time on our hands, we decided to explore the nearby town.","translation":"手元に余裕のある時間があったので、近くの町を散策することにした。","type":"adjective","meaning_category":"余裕のある"},{"sentence":"The organization was looking for spareable volunteers to help with the event.","translation":"その組織は、イベントを手伝ってくれる余裕のあるボランティアを探していた。","type":"adjective","meaning_category":"余裕のある"}]}