{"word":"heterologous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"異種の、異質の、異源の","english_definition":"derived from a different species or source; composed of dissimilar parts or elements.","examples":[{"sentence":"The heterologous protein was expressed in E. coli.","translation":"その異種タンパク質は大腸菌で発現された。"},{"sentence":"Heterologous transplantation can lead to rejection.","translation":"異種移植は拒絶反応を引き起こす可能性がある。"},{"sentence":"We used a heterologous expression system to study the gene.","translation":"その遺伝子を研究するために異種発現系を使用した。"}],"collocations":["heterologous expression","heterologous transplantation","heterologous system","heterologous DNA","heterologous protein"],"synonyms":["foreign","exogenous","different","dissimilar","unrelated"],"antonyms":["homologous","autologous","identical","similar","related"]}],"etymology":{"value":"Derived from the Greek words 'heteros' (ἕτερος) meaning 'other, different' and 'logos' (λόγος) meaning 'relation, proportion, reason'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛtəˈrɒləɡəs/","syllables":"het-er-ol-o-gous"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be modified by adverbs (e.g., very heterologous)."},"usage_notes":{"explanation":"'Heterologous' is often used in scientific and medical contexts to describe something that originates from a different source, especially a different species. It is commonly used in biology, genetics, and immunology to describe genes, proteins, tissues, or cells that are not native to the organism or system in which they are found.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The homologous protein was expressed in E. coli.","correct":"✓ The heterologous protein was expressed in E. coli.","note":"'Homologous' means similar or of the same origin, while 'heterologous' means of different origin. Using the wrong term can completely change the meaning of the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["heterology (noun): the study of differences or dissimilarities.","heterologous expression (noun): the expression of a gene in a host organism that does not normally express that gene.","heterologous transplantation (noun): the transplantation of tissue or an organ from a donor of one species to a recipient of another species."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily found in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'heterologous' is a technical term primarily used in scientific fields, especially biology and medicine. It describes something that comes from a different source or species. For example, if a human gene is inserted into a bacterium, the gene is said to be 'heterologous' in the bacterium. Understanding this word requires familiarity with scientific concepts and terminology. It's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The researchers used a heterologous system to produce the antibody.","translation":"研究者たちは、その抗体を生産するために異種系を使用した。","type":"adjective","meaning_category":"異種の"},{"sentence":"Heterologous prime-boost vaccination strategies are often more effective.","translation":"異種プライム・ブーストワクチン戦略は、しばしばより効果的である。","type":"adjective","meaning_category":"異種の"},{"sentence":"The heterologous expression of the gene allowed for detailed study of its function.","translation":"その遺伝子の異種発現は、その機能の詳細な研究を可能にした。","type":"adjective","meaning_category":"異種の"}]}