{"word":"prepubescence","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"思春期前期、思春期前","english_definition":"The period of life immediately preceding puberty.","examples":[{"sentence":"Prepubescence is characterized by a growth spurt and hormonal changes.","translation":"思春期前期は、成長の急増とホルモンの変化によって特徴づけられます。"},{"sentence":"During prepubescence, children may experience emotional and social changes.","translation":"思春期前期には、子供たちは感情的および社会的な変化を経験することがあります。"}],"collocations":["early prepubescence","late prepubescence","onset of prepubescence","signs of prepubescence"],"synonyms":["preteen","pre-adolescence"],"antonyms":["pubescence","adolescence"]}],"etymology":{"value":"Derived from the prefix 'pre-' (before) combined with 'pubescence' (the stage of becoming pubescent).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːpjuːˈbɛsns/","syllables":"pre-pu-bes-cence"},"inflection":{"noun_plural":"prepubescences"},"usage_notes":{"explanation":"'Prepubescence' refers to the developmental stage in children that occurs right before puberty begins. It is often marked by physical changes like the beginning of growth spurts and the development of secondary sexual characteristics, as well as emotional and social changes. The term is primarily used in medical and educational contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The child is in puberty, so it is prepubescence.","correct":"✓ The child is in prepubescence before puberty starts.","note":"Prepubescence comes before puberty, not during it."},{"incorrect":"✗ Prepubescence only affects girls.","correct":"✓ Prepubescence affects both boys and girls.","note":"Prepubescence is a stage of development that both boys and girls go through."}],"priority":"★★☆"},"related_words":{"derivatives":["prepubescent (adjective)"],"phrases":["early childhood","middle childhood","late childhood","adolescence"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Prepubescence' is a term used to describe the period of development that occurs right before puberty. It's a more technical term often used in medical or educational contexts to refer to the stage when a child's body begins to prepare for the changes of puberty. This stage involves hormonal changes and physical growth, but the individual has not yet entered puberty itself. It's less commonly used in everyday conversation."},"example_sentences":[{"sentence":"The doctor explained that the child's symptoms were normal for prepubescence.","translation":"医師は、子供の症状は思春期前期としては正常であると説明しました。","type":"general","meaning_category":"General Use"},{"sentence":"During prepubescence, children often experience a significant increase in height.","translation":"思春期前期には、子供たちは身長が著しく伸びることがよくあります。","type":"physical development","meaning_category":"Physical Development"},{"sentence":"Changes in mood and behavior can be common during prepubescence.","translation":"気分の変化や行動の変化は、思春期前期にはよく見られます。","type":"emotional/social","meaning_category":"Emotional/Social"}]}