{"word":"sublessee","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"転借人、又貸し人、下宿人","english_definition":"A person who leases property from a lessee.","examples":[{"sentence":"The sublessee was responsible for paying rent to the original tenant.","translation":"転借人は、元のテナントに賃料を支払う責任があった。"},{"sentence":"Before subletting, the tenant must obtain permission from the landlord and find a suitable sublessee.","translation":"又貸しする前に、テナントは家主の許可を得て、適切な転借人を見つけなければならない。"},{"sentence":"The sublessee signed a contract with the tenant, outlining the terms of the sublease.","translation":"転借人は、又貸しの条件を概説する契約書をテナントと締結した。"}],"collocations":["find a sublessee (転借人を見つける)","screen a sublessee (転借人を審査する)","sublessee agreement (転貸契約)","approve a sublessee (転借人を承認する)","potential sublessee (潜在的な転借人)"],"synonyms":["subtenant","underlessee"],"antonyms":["sublessor","tenant","landlord"]}],"etymology":{"value":"'Sub-' (under) + 'lessee' (a person who leases property).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsʌb.leˈsiː/","syllables":"sub-le-see"},"inflection":{"noun_plural":"sublessees"},"usage_notes":{"explanation":"A 'sublessee' is someone who rents property from a tenant, who is not the owner of the property. The original tenant then becomes the 'sublessor'. It is important to note that the sublessee's rights are typically dependent on the original lease agreement between the landlord and the tenant.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sublessee is responsible for paying rent to the landlord.","correct":"✓ The sublessee is responsible for paying rent to the tenant.","note":"The sublessee pays rent to the tenant (sublessor), not directly to the landlord."},{"incorrect":"✗ The sublessee has more rights than the original tenant.","correct":"✓ The sublessee typically has fewer rights than the original tenant.","note":"The sublessee's rights are derived from the original tenant's lease agreement."}],"priority":"★★☆"},"related_words":{"derivatives":["sublease (noun/verb)","sublessor (noun)","sublet (verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sublessee' refers to an individual who rents a property from a tenant, rather than directly from the property owner (landlord). This arrangement is known as a sublease, and it's crucial to understand that the sublessee's rights and obligations are governed by both the sublease agreement and the original lease between the landlord and the tenant. The sublessee typically pays rent to the tenant, who then pays the landlord. It's a somewhat specialized term, primarily used in legal and real estate contexts."},"example_sentences":[{"sentence":"The tenant carefully screened potential sublessees before making a decision.","translation":"テナントは、決定を下す前に、潜在的な転借人を注意深く審査した。","type":"general","meaning_category":"General Use"},{"sentence":"As a sublessee, she was bound by the terms of the original lease agreement.","translation":"転借人として、彼女は元の賃貸契約の条件に拘束されていた。","type":"legal","meaning_category":"Legal Context"},{"sentence":"The sublessee moved out before the end of the sublease term.","translation":"転借人は、転貸期間の終了前に引っ越した。","type":"real estate","meaning_category":"Real Estate"}]}