{"word":"Johannist","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A follower or adherent of Johannism, a form of Gnosticism centered around the figure of John the Baptist.","english_definition":"A follower or adherent of Johannism.","examples":[{"sentence":"The Johannists venerated John the Baptist as a higher prophet than Jesus.","translation":"ヨハンニストは、洗礼者ヨハネをイエスよりも高位の預言者として崇拝した。"}],"collocations":["Johannist sect","Johannist beliefs","Johannist tradition"],"synonyms":["Mandaean (related, but distinct)"],"antonyms":[]}],"etymology":{"value":"Derived from 'Johann,' referring to John the Baptist, and the suffix '-ist,' indicating a follower or believer.","priority":"★★☆"},"pronunciation":{"ipa":"/dʒoʊˈhænɪst/","syllables":"Jo-han-nist"},"inflection":{"noun_plural":"Johannists"},"usage_notes":{"explanation":"The term 'Johannist' is primarily used in historical and religious studies contexts to refer to members of Gnostic groups that revered John the Baptist. These groups often held beliefs distinct from mainstream Christianity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Johannist, so he celebrated Christmas.","correct":"✓ He was a Johannist, so he venerated John the Baptist.","note":"Johannists typically did not follow mainstream Christian practices like celebrating Christmas."}],"priority":"★★☆"},"related_words":{"derivatives":["Johannism (the religious beliefs and practices of Johannists)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Johannist' is a specialized term used in the context of religious history and Gnosticism. Understanding requires familiarity with Gnostic beliefs and the historical significance of John the Baptist within those traditions. It is not a commonly used word. "},"example_sentences":[{"sentence":"Historical accounts describe the Johannists as a secretive and distinct religious group.","translation":"歴史的記録は、ヨハンニストを秘密主義的で独特な宗教団体として記述している。","type":"noun","meaning_category":"Follower of Johannism"},{"sentence":"Some scholars believe that the Mandaeans are a surviving remnant of the ancient Johannists.","translation":"一部の学者は、マンダ教徒が古代ヨハンニストの生き残りであると考えている。","type":"noun","meaning_category":"Follower of Johannism"}]}