{"word":"Upcutting","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(木工)アップカット、上向き切削","english_definition":"A machining process where the cutting tool moves against the direction of feed. In woodworking, specifically, it refers to cutting with the saw blade teeth moving upwards, against the wood being fed into the saw.","examples":[{"sentence":"Upcutting can cause splintering on the top surface of the wood.","translation":"アップカットは木材の表面にささくれを生じさせる可能性がある。"}],"collocations":["table saw upcutting","router upcutting","circular saw upcutting"],"synonyms":["climb milling (metalworking)"],"antonyms":["downcutting"],"related_terms":["tearout","splintering","feed direction","cutting tool"],"notes":"Upcutting is generally avoided in woodworking unless specific results are desired, due to the increased risk of tearout and splintering.","usage_notes":"Upcutting is the opposite of downcutting, where the cutting tool moves in the same direction as the feed.","level_frequency":{"frequency_google_ngram":"Low frequency","CEFR":"None"},"readability_explanation":{"level":"C1","text":"'Upcutting' is a specialized term primarily used in woodworking and machining. It refers to a specific cutting technique where the cutting tool moves against the direction the material is being fed. Understanding this term requires familiarity with machining processes and terminology."},"example_sentences":[{"sentence":"The saw was set up for upcutting, which resulted in a rough edge.","translation":"その鋸はアップカット用に設定されており、結果として粗いエッジになった。","type":"technical","meaning_category":"Woodworking"},{"sentence":"He decided to try upcutting to minimize chipping on the underside of the laminate.","translation":"彼はラミネートの下面の欠けを最小限に抑えるために、アップカットを試すことにした。","type":"technical","meaning_category":"Woodworking"}]}],"etymology":{"value":"Derived from the combination of 'up' and 'cutting', indicating the direction of the cutting action relative to the workpiece.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌpˌkʌtɪŋ/","syllables":"up-cut-ting"},"inflection":{"noun_plural":"Upcuttings"},"related_words":{"derivatives":["upcut (adjective)"],"related_terms":["milling","machining","woodworking","sawing","routing"]}}