{"word":"roughened","priority":"★☆☆","meanings":[{"part_of_speech":"verb (past participle)","definition":"(表面が)粗くされた、ざらざらにされた、荒れた","english_definition":"having been made rough or uneven; having a coarse texture.","examples":[{"sentence":"His hands were roughened by years of manual labor.","translation":"彼の両手は何年もの肉体労働で荒れていた。"},{"sentence":"The skin on her face was roughened by the wind and sun.","translation":"彼女の顔の皮膚は風と太陽で荒れていた。"},{"sentence":"The surface of the wood had been roughened to provide a better grip.","translation":"木材の表面は、より良いグリップを提供するために粗くされていた。"}],"collocations":["roughened skin (荒れた肌)","roughened hands (荒れた手)","roughened surface (粗くされた表面)"],"synonyms":["coarsened","textured","uneven","abrasive"],"antonyms":["smoothed","polished","refined"]},{"part_of_speech":"adjective","definition":"(表面が)粗くされた、ざらざらにされた、荒れた","english_definition":"having a rough or uneven surface or texture.","examples":[{"sentence":"He ran his hand over the roughened stone wall.","translation":"彼はざらざらになった石壁に手を走らせた。"},{"sentence":"The artist preferred the roughened canvas for its texture.","translation":"そのアーティストは、その質感のために粗くされたキャンバスを好んだ。"}],"collocations":["roughened stone (粗くされた石)","roughened canvas (粗くされたキャンバス)"],"synonyms":["coarse","uneven","textured","abrasive"],"antonyms":["smooth","even","polished"]}],"etymology":{"value":"The word 'roughened' is the past participle and adjective form of the verb 'roughen,' which comes from 'rough.' 'Rough' itself has origins in Old English 'ruh,' meaning 'coarse, hairy, or shaggy.' The addition of '-en' to 'rough' to form 'roughen' indicates the process of becoming rough or making something rough.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈrʌfənd/","syllables":"rough-ened"},"inflection":{"notes":"'Roughened' is the past participle and adjective form of the verb 'roughen.' The verb 'roughen' inflects as follows: present: roughen, roughens; past: roughened; present participle: roughening."},"usage_notes":{"explanation":"'Roughened' is used to describe a surface or texture that has become rough or uneven, often due to wear, exposure, or intentional treatment. It can refer to physical objects (like stone or wood) or to skin and other biological surfaces. The term implies a change from a smoother state to a more coarse or irregular one.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The skin was roughened because of smooth cream.","correct":"✓ The skin was roughened because of harsh chemicals.","note":"'Roughened' implies a process that makes something rough, so it's usually caused by something abrasive or damaging, not something smoothing."},{"incorrect":"✗ He roughened the paper with a smooth stone.","correct":"✓ He roughened the paper with a rough stone.","note":"To roughen something, you typically use a rough object or abrasive material."}],"priority":"★☆☆"},"related_words":{"derivatives":["rough (adjective, noun, verb)","roughness (noun)","roughing (noun, verb)","roughshod (adjective, adverb)","roughen (verb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'roughened' describes something that has become rough or uneven. It's often used to describe surfaces that have been worn down or made coarse by exposure to the elements or by physical labor. It's a relatively uncommon word, so it's more likely to appear in descriptive writing or technical contexts where precise descriptions of textures are needed. Understanding the root word 'rough' is helpful for grasping the meaning of 'roughened.'"},"example_sentences":[{"sentence":"The sailor's face was weathered and his hands were roughened by years at sea.","translation":"その船乗りの顔は風雨にさらされ、両手は何年も海上で過ごしたことで荒れていた。","type":"adjective","meaning_category":"荒れた (肌、手)"},{"sentence":"The artist deliberately roughened the surface of the painting to create a textured effect.","translation":"そのアーティストは、質感のある効果を生み出すために、絵画の表面を意図的に粗くした。","type":"verb (past participle)","meaning_category":"粗くされた (表面)"},{"sentence":"The old leather jacket had a pleasingly roughened feel to it.","translation":"その古い革のジャケットは、心地よいざらざらした感触があった。","type":"adjective","meaning_category":"粗くされた (感触)"}]}