{"word":"nonshatter","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"粉砕しない、飛散しない","english_definition":"Not shattering; designed or treated to resist shattering.","examples":[{"sentence":"The nonshatter glass is used in car windshields for safety.","translation":"その飛散防止ガラスは安全のために車のフロントガラスに使用されている。"},{"sentence":"We need nonshatter containers for the hazardous materials.","translation":"有害物質のために飛散防止容器が必要です。"}],"collocations":["nonshatter glass","nonshatter container","nonshatter film"],"synonyms":["shatterproof","splinterproof","shatter-resistant"],"antonyms":["shatterable","fragile"]}],"etymology":{"value":"'non-' (否定) + 'shatter' (粉砕する)","priority":"★★★"},"pronunciation":{"ipa":"/nɒnˈʃætər/","syllables":"non-shat-ter"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Nonshatter' is typically used to describe materials or objects that are designed to resist breaking into small, sharp pieces upon impact. It is commonly used in contexts where safety is a concern, such as in vehicles, construction, or handling hazardous materials.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonshatter of the glass is important.","correct":"✓ The nonshatter property of the glass is important.","note":"'Nonshatter' is an adjective, so it should be used to describe a noun. 'Nonshatter property' or 'nonshatter quality' is more appropriate in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["nonshattering"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'nonshatter' is a technical term used to describe materials that do not break into sharp pieces when impacted. It is often used in the context of safety, such as in car windshields or protective eyewear. Understanding the meaning of 'non-' as a prefix meaning 'not' is helpful in understanding this word."},"example_sentences":[{"sentence":"The laboratory uses nonshatter vials for storing samples.","translation":"その研究所では、サンプルを保管するために飛散防止バイアルを使用しています。","type":"adjective","meaning_category":"飛散防止"},{"sentence":"This nonshatter screen protector prevents the phone from cracking easily.","translation":"この飛散防止スクリーンプロテクターは、電話が簡単にひび割れるのを防ぎます。","type":"adjective","meaning_category":"飛散防止"}]}