{"word":"pitch-blende","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ピッチブレンド（瀝青ウラン鉱）","english_definition":"A massive, black, mineral form of uraninite, UO2 with some U3O8, and a minor source of radium.","examples":[{"sentence":"Pitch-blende is a primary source of uranium.","translation":"ピッチブレンドはウランの主要な源です。"},{"sentence":"Marie Curie extracted radium from pitch-blende.","translation":"マリー・キュリーはピッチブレンドからラジウムを抽出しました。"}],"collocations":["uranium pitch-blende","extract radium from pitch-blende"],"synonyms":["uraninite","uranium ore"],"antonyms":[]},{"part_of_speech":"noun","definition":"（比喩的に）非常に暗い黒色","english_definition":"A very dark black color.","examples":[{"sentence":"The night sky was pitch-blende.","translation":"夜空は漆黒だった。"}],"collocations":["pitch-blende darkness","pitch-blende sky"],"synonyms":["jet black","ebony"],"antonyms":["snow-white","ivory"]}],"etymology":{"value":"From pitch (referring to its black, tar-like appearance) + blende (from German Blende, meaning 'deceiver', because it was thought to contain metals but did not yield them easily).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪtʃˌblɛnd/","syllables":"pitch-blende"},"inflection":{"noun_plural":"pitch-blendes"},"usage_notes":{"explanation":"Pitch-blende is primarily known as a mineral, a significant source of uranium and historically of radium. Its secondary meaning refers to a very dark, almost black color, reminiscent of the mineral's appearance. The term is relatively specialized and not commonly used outside of scientific or descriptive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a pitch-blende in my backyard, so I kept it as a souvenir.","correct":"✓ Handling pitch-blende requires special precautions due to its radioactivity.","note":"Pitch-blende is radioactive and should not be handled casually. Finding it in a backyard is highly unlikely and keeping it as a souvenir would be dangerous."},{"incorrect":"✗ The paint was pitch-blende, but it reflected light well.","correct":"✓ The paint was jet black and absorbed most of the light.","note":"Pitch-blende, in its color sense, implies a very dark black that absorbs light rather than reflects it. 'Jet black' is a more common and appropriate term for a very dark black."}],"priority":"★★☆"},"related_words":{"derivatives":["none"],"phrasal_verbs":[],"related_terms":["uranium","radium","radioactivity","mineralogy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pitch-blende' is a specialized term primarily used in the context of mineralogy and nuclear science. It refers to a specific type of uranium ore. The term is not commonly encountered in everyday language, and understanding its meaning requires some familiarity with scientific vocabulary. Outside of scientific contexts, it may be used descriptively to refer to a very dark black color, but this usage is less common.","priority":"★★☆"},"example_sentences":[{"sentence":"The geologist identified the sample as pitch-blende.","translation":"地質学者はそのサンプルをピッチブレンドだと特定した。","type":"noun","meaning_category":"Mineral"},{"sentence":"Marie Curie's research focused on extracting radioactive elements from pitch-blende.","translation":"マリー・キュリーの研究は、ピッチブレンドから放射性元素を抽出することに焦点を当てていた。","type":"noun","meaning_category":"Mineral"},{"sentence":"The cave was shrouded in pitch-blende darkness.","translation":"洞窟は漆黒の闇に包まれていた。","type":"noun","meaning_category":"Color"},{"sentence":"The artist used a pitch-blende pigment to create a deep, intense black in the painting.","translation":"画家は絵画に深く強烈な黒色を作り出すために、ピッチブレンド顔料を使用した。","type":"noun","meaning_category":"Color"}]}