{"word":"virulencia","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"病原性、毒性、悪性度","english_definition":"The degree of pathogenicity or disease-producing power of an infectious agent.","examples":[{"sentence":"La virulencia del virus ha disminuido con el tiempo.","translation":"The virulence of the virus has decreased over time."},{"sentence":"La alta virulencia de la cepa causó una rápida propagación de la enfermedad.","translation":"The high virulence of the strain caused a rapid spread of the disease."}],"collocations":["alta virulencia (high virulence)","baja virulencia (low virulence)","disminuir la virulencia (to decrease virulence)","aumentar la virulencia (to increase virulence)"],"synonyms":["patogenicidad","toxicidad","malignidad"],"antonyms":["atenuación","debilidad"]},{"part_of_speech":"noun","definition":"激しさ、猛烈さ、過激さ","english_definition":"The extreme severity or intensity of something, especially a disease or negative emotion.","examples":[{"sentence":"La virulencia del ataque fue impactante.","translation":"The virulence of the attack was shocking."},{"sentence":"Respondió con virulencia a las críticas.","translation":"He responded to the criticism with virulence."},{"sentence":"La virulencia de la tormenta causó graves daños.","translation":"The virulence of the storm caused serious damage."}],"collocations":["con virulencia (with virulence)","mostrar virulencia (to show virulence)","ataque con virulencia (attack with virulence)"],"synonyms":["intensidad","ferocidad","agresividad","vehemencia"],"antonyms":["suavidad","moderación","calma"]}],"etymology":{"value":"Del latín 'virulentia', derivado de 'virus' (veneno).","priority":"★★☆"},"pronunciation":{"ipa":"biɾulenθja","syllables":"vi-ru-len-cia"},"inflection":{"noun_gender":"feminine","noun_plural":"virulencias"},"usage_notes":{"explanation":"'Virulencia' se refiere tanto a la capacidad de un microorganismo para causar enfermedad como a la intensidad o severidad de algo, como un ataque o una emoción. En el contexto médico, se usa para describir qué tan dañino es un patógeno. En un contexto más general, se refiere a la fuerza o agresividad con la que se manifiesta algo.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"La virulencia del amor.","correct":"La intensidad del amor.","note":"'Virulencia' no se usa comúnmente para describir emociones positivas como el amor. Es más apropiado usar términos como 'intensidad' o 'pasión'."},{"incorrect":"El virus tiene mucha virulencia, pero no es contagioso.","correct":"El virus tiene mucha virulencia, pero poca contagiosidad.","note":"'Virulencia' se refiere a la severidad de la enfermedad, mientras que 'contagiosidad' se refiere a la facilidad con la que se propaga. Son conceptos distintos."}],"priority":"★★☆"},"related_words":{"derivatives":["virulento (virulent)"],"phrases":["con virulencia (with virulence)"],"priority":"★★☆"},"level_frequency":{"level":"C1","frequency_google_ngram":"Relatively low frequency, more common in scientific or medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Virulencia' is a term that can have two main meanings. In medical or biological contexts, it refers to the degree to which a pathogen can cause disease. In more general contexts, it refers to the intensity, severity, or bitterness of something, such as criticism or an attack. It is important to understand the context in which the word is used to determine its meaning. It is not a very common word in everyday conversation, but it is frequently used in scientific, medical, and journalistic contexts."},"example_sentences":[{"sentence":"La virulencia de la nueva cepa de gripe es preocupante.","translation":"The virulence of the new flu strain is concerning.","type":"noun","meaning_category":"病原性"},{"sentence":"El político respondió con virulencia a las acusaciones de corrupción.","translation":"The politician responded with virulence to the accusations of corruption.","type":"noun","meaning_category":"激しさ"}]}