{"word":"hosecock","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A valve on a water faucet to which a hose can be attached.","english_definition":"A faucet or valve to which a hose can be attached, typically for supplying water.","examples":[{"sentence":"He attached the garden hose to the hosecock to water the plants.","translation":"彼は植物に水をやるために、庭のホースをホースコックに取り付けた。"},{"sentence":"Make sure the hosecock is tightly closed to prevent leaks.","translation":"水漏れを防ぐために、ホースコックがしっかりと閉じていることを確認してください。"}],"collocations":["garden hose","water supply","plumbing","outdoor faucet"],"synonyms":["faucet","spigot","tap","valve"],"antonyms":[]}],"etymology":{"value":"Combination of 'hose' (a flexible tube for conveying fluids) and 'cock' (a valve or tap).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhoʊzˌkɑk/","syllables":"hose-cock"},"inflection":{"noun_plural":"hosecocks"},"usage_notes":{"explanation":"The term 'hosecock' is primarily used in plumbing and gardening contexts to refer to the valve that controls the water flow to which a hose is connected. It is often found outdoors for garden hoses or in utility areas for various water supply needs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to fix the hosecock because the hose is leaking.","correct":"✓ I need to fix the faucet because the hose is leaking at the connection.","note":"The hosecock itself isn't leaking, but the connection between the hose and the faucet might be. So, faucet is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["hose","cock","valve","faucet","spigot"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hosecock' is a technical term used in plumbing and gardening. It refers to a specific type of valve designed for attaching a hose. Understanding this term requires familiarity with basic plumbing terminology. While not commonly used in everyday conversation, it is essential in contexts related to water supply and gardening.","priority":"★★☆"},"example_sentences":[{"sentence":"The plumber replaced the old hosecock with a new one.","translation":"配管工は古いホースコックを新しいものと交換した。","type":"noun","meaning_category":"Plumbing"},{"sentence":"Ensure the hose is securely connected to the hosecock before turning on the water.","translation":"水を出す前に、ホースがホースコックにしっかりと接続されていることを確認してください。","type":"noun","meaning_category":"Gardening"}]}