{"word":"part-off","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(旋盤加工における)突っ切り、切断","english_definition":"A machining operation, especially on a lathe, in which a tool is used to cut through a rotating workpiece to separate a section from the remainder.","examples":[{"sentence":"The machinist performed a part-off operation to create the final component.","translation":"機械工は、最終部品を作成するために突っ切り作業を行った。"},{"sentence":"The automated lathe is equipped to handle complex part-off sequences.","translation":"その自動旋盤には、複雑な突っ切りシーケンスを処理する機能が備わっている。"}],"collocations":["part-off tool","part-off operation","automated part-off","CNC part-off"],"synonyms":["cutoff","separation","severance","machining cutoff"],"antonyms":["joining","welding","assembly"]},{"part_of_speech":"verb","definition":"(旋盤加工で)突っ切る、切断する","english_definition":"To separate a section from a workpiece using a cutting tool, typically on a lathe.","examples":[{"sentence":"The technician will part-off the excess material to achieve the desired length.","translation":"技術者は、目的の長さを得るために余分な材料を突っ切る予定だ。"},{"sentence":"The software controls the tool to precisely part-off each component.","translation":"そのソフトウェアは、各部品を正確に突っ切るように工具を制御する。"}],"collocations":["part-off material","part-off precisely","part-off automatically","part-off cleanly"],"synonyms":["cut off","separate","sever","machine off"],"antonyms":["join","weld","assemble"]}],"etymology":{"value":"The term 'part-off' is derived from the combination of 'part' (referring to a section of material) and 'off' (indicating separation or removal). It describes the action of separating a part from a larger piece of material.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɑːrt ɔf/","syllables":"part-off"},"inflection":{"verb_forms":{"present_simple":["part-off","parts-off"],"past_simple":"parted-off","past_participle":"parted-off","present_participle":"parting-off"}},"usage_notes":{"explanation":"'Part-off' is a technical term primarily used in machining and manufacturing contexts, specifically related to lathe operations. It refers to the process of using a cutting tool to separate a finished part from the remaining stock material. The term can function as both a noun (describing the operation itself) and a verb (describing the action of cutting off).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a saw to part-off the metal.","correct":"✓ He used a lathe to part-off the metal. / ✓ He used a saw to cut off the metal.","note":"'Part-off' specifically implies using a lathe. While a saw can cut off metal, 'part-off' is more precise in the context of lathe machining."},{"incorrect":"✗ The part-off was done by hand.","correct":"✓ The part-off operation was automated.","note":"While manual part-off is possible, modern machining often involves automated or CNC-controlled part-off operations."}],"priority":"★★☆"},"related_words":{"derivatives":["parting tool","cutoff tool","lathe","machining"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Part-off' is a specialized term used in engineering and manufacturing, particularly in the context of machining with lathes. It describes the process of cutting through a rotating workpiece to separate a finished part from the remaining material. This term is not commonly used in everyday language and is primarily found in technical documentation, engineering discussions, and manufacturing settings. Understanding this term requires familiarity with machining processes and equipment."},"example_sentences":[{"sentence":"The CNC lathe can automatically **part-off** the components to precise dimensions.","translation":"CNC旋盤は、部品を正確な寸法に自動的に突っ切ることができる。","type":"verb","meaning_category":"突っ切る"},{"sentence":"The **part-off** operation is crucial for efficient production of small parts.","translation":"突っ切り作業は、小型部品の効率的な生産に不可欠である。","type":"noun","meaning_category":"突っ切り"}]}