{"word":"diallelus","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"循環論法、相互依存性、相互定義","english_definition":"A logical fallacy in which the attempt to prove one statement presupposes the truth of another statement, which in turn presupposes the truth of the first statement; circular reasoning.","examples":[{"sentence":"The argument suffered from diallelus, as it assumed the conclusion in its premise.","translation":"その議論は前提の中に結論を仮定していたため、循環論法に陥っていた。"},{"sentence":"The definition of 'A' depends on 'B', and 'B' depends on 'A'; this is a clear example of diallelus.","translation":"「A」の定義は「B」に依存し、「B」は「A」に依存する。これは循環論法の明らかな例である。"}],"collocations":["fallacy of diallelus","commit diallelus","circular definition","vicious circle"],"synonyms":["circular reasoning","begging the question","circulus in probando","vicious circle"],"antonyms":["linear reasoning","independent proof"]}],"etymology":{"value":"Derived from the Greek word 'ἀλλήλων' (allēlōn), meaning 'of one another', combined with 'διά' (dia), meaning 'through'.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪəˈliːləs/","syllables":"di-al-le-lus"},"inflection":{"noun_plural":"dialleluses or dialleli (rare)"},"usage_notes":{"explanation":"'Diallelus' refers specifically to a type of logical fallacy where the proof of one statement relies on the truth of another, which in turn relies on the truth of the first. It's a form of circular reasoning, often subtle and difficult to detect. It is a formal fallacy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The two concepts are similar, so they are diallelus.","correct":"✓ The two concepts are defined in terms of each other, creating a diallelus.","note":"Diallelus is not simply similarity, but a specific type of circular dependency in definitions or proofs."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["begging the question","circular argument","tautology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Diallelus' is a term used in logic and philosophy to describe a specific type of circular reasoning. It occurs when two or more statements are used to prove each other, leading to a situation where no independent evidence supports either statement. This term is rarely used in everyday conversation but is important in formal logic and philosophical discussions."},"example_sentences":[{"sentence":"The philosopher argued that the system of ethics was based on a diallelus, making it ultimately unfounded.","translation":"その哲学者は、その倫理体系が循環論法に基づいているため、最終的には根拠がないと主張した。","type":"noun","meaning_category":"循環論法"},{"sentence":"The economic model was criticized for its diallelus, where growth was both the cause and effect of investment.","translation":"その経済モデルは、成長が投資の原因であり結果でもあるという循環論法であると批判された。","type":"noun","meaning_category":"循環論法"}]}