{"word":"tranchoir","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語) 食卓、食卓を覆う布、または食卓に供されるパン","english_definition":"(archaic) A trencher; a wooden platter or a piece of bread used as a plate in medieval times; also, a table or cloth for a table.","examples":[{"sentence":"The tranchoir was laden with roasted meats and fruits.","translation":"食卓はロースト肉と果物でいっぱいだった。"},{"sentence":"He wiped his hands on the tranchoir after the meal.","translation":"彼は食事の後、食卓を覆う布で手を拭いた。"}],"collocations":["lay the tranchoir","clear the tranchoir"],"synonyms":["trencher","table","tablecloth"],"antonyms":[]}],"etymology":{"value":"Old French *tranchier* (to cut), from Latin *truncare* (to cut off, mutilate), referring to the cutting of bread to serve as a plate.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtræntʃwɑːr/","syllables":"tran-choir"},"inflection":{"noun_plural":"tranchoirs"},"usage_notes":{"explanation":"'Tranchoir' is an archaic term, primarily used in historical contexts to describe a piece of bread or a wooden platter used as a plate during medieval times. It can also refer to the table itself or the cloth covering it. The term is rarely used in modern English.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["trencher"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word \"tranchoir\" is an archaic term, rarely used in modern English. It refers to a trencher, which is a piece of bread or a wooden platter used as a plate in medieval times. Understanding this word requires familiarity with historical contexts and archaic vocabulary. It is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"In the medieval feast, each guest had their own tranchoir.","translation":"中世の宴会では、各ゲストが自分の食卓を持っていた。","type":"noun","meaning_category":"食卓"},{"sentence":"The servant carefully laid the tranchoir before the king.","translation":"召使は王の前に丁寧に食卓を置いた。","type":"noun","meaning_category":"食卓"},{"sentence":"After the meal, the tranchoir was cleared of the remaining food.","translation":"食事の後、食卓から残りの食べ物が片付けられた。","type":"noun","meaning_category":"食卓"}]}