{"word":"palaeocrystallic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(地質学)古結晶質の","english_definition":"(geology) Relating to or having a texture in igneous rocks in which relatively large, early-formed crystals (phenocrysts) are surrounded by a finer-grained groundmass.","examples":[{"sentence":"The rock sample exhibited a palaeocrystallic texture, indicating a complex cooling history.","translation":"その岩石サンプルは古結晶質の組織を示しており、複雑な冷却の歴史を示唆していた。"}],"collocations":["palaeocrystallic texture","palaeocrystallic rock"],"synonyms":["porphyritic"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'palaios' (ancient), 'krystallos' (crystal), and the suffix '-ic' (relating to).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpæliːoʊkrɪˈstælɪk/","syllables":"pa-lae-o-crys-tal-lic"},"inflection":{"notes":"This word does not have common inflections as it is an adjective."},"usage_notes":{"explanation":"The term 'palaeocrystallic' is specifically used in geology to describe the texture of igneous rocks where larger, earlier-formed crystals are embedded in a finer-grained matrix. This texture indicates that the larger crystals had a period of slow cooling and growth before the remaining melt cooled more rapidly, forming the finer-grained groundmass.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The palaeocrystallic structure was observed in the sedimentary rock.","correct":"✓ The palaeocrystallic structure was observed in the igneous rock.","note":"Palaeocrystallic textures are specific to igneous rocks, not sedimentary rocks."}],"priority":"★★☆"},"related_words":{"derivatives":["palaeocrystal (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Palaeocrystallic' is a highly specialized term used within the field of geology to describe a specific type of rock texture. Understanding this term requires knowledge of petrology and the processes involved in the formation of igneous rocks. It is not commonly used outside of geological contexts."},"example_sentences":[{"sentence":"The geologist identified the rock as having a distinct palaeocrystallic structure.","translation":"地質学者はその岩石が明確な古結晶質の構造を持っていると特定した。","type":"general","meaning_category":"geological description"}]}