{"word":"receptively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"受容的に、快く受け入れて、素直に聞き入れて","english_definition":"in a way that shows willingness to receive new ideas or suggestions; in an open and responsive manner.","examples":[{"sentence":"The audience listened receptively to the speaker's ideas.","translation":"聴衆は講演者のアイデアを快く受け入れて聞いていた。"},{"sentence":"She responded receptively to the feedback on her work.","translation":"彼女は自分の仕事に対するフィードバックを素直に受け止めた。"},{"sentence":"He approached the discussion receptively, willing to consider alternative viewpoints.","translation":"彼は議論に受容的に取り組み、代替の視点を検討する意思があった。"}],"collocations":["listen receptively","respond receptively","approach receptively","treat receptively","view receptively","behave receptively"],"synonyms":["openly","willingly","amenably","responsively","attentively","appreciatively","favorably"],"antonyms":["unreceptively","dismissively","rejectingly","unwillingly","negatively","critically"]}],"etymology":{"value":"The word \"receptively\" is derived from the adjective \"receptive,\" which comes from the Latin word \"recipere,\" meaning \"to receive.\" The suffix \"-ly\" is added to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈsɛptɪvli/","syllables":"re-cep-tive-ly"},"inflection":{"notes":"As an adverb, \"receptively\" does not have different forms for tense or number."},"usage_notes":{"explanation":"\"Receptively\" describes the manner in which someone receives or responds to something, typically ideas, suggestions, or feedback. It implies an openness to new information and a willingness to consider different perspectives. The adverb emphasizes the positive and welcoming attitude of the subject.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She receptively the gift.","correct":"✓ She received the gift receptively.","note":"\"Receptively\" is an adverb and should modify a verb, adjective, or another adverb. It cannot directly act as a verb. You can say \"She received the gift receptively\" or \"She accepted the gift receptively.\""},{"incorrect":"✗ The room was receptively decorated.","correct":"✓ The room was attractively decorated.","note":"\"Receptively\" refers to a mental attitude. If you want to describe a room's decoration, use adjectives like \"attractively,\" \"invitingly,\" or \"pleasantly.\""},{"incorrect":"✗ He is a receptive person. He behaves receptive.","correct":"✓ He is a receptive person. He behaves receptively.","note":"\"Receptive\" is an adjective, while \"receptively\" is an adverb. Use the adverb to describe how someone behaves."}],"priority":"★★☆"},"related_words":{"derivatives":["receptive (adjective)","receptiveness (noun)","reception (noun)"],"phrases":["receptive to feedback","receptive to new ideas","receptive audience"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in academic and professional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"receptively\" is an adverb that means 'in a way that shows you are willing to consider new ideas or listen to someone.' It's often used in formal or academic contexts to describe how someone approaches discussions, feedback, or new information. Because it's not a very common word, it's more likely to be encountered in advanced reading or listening materials."},"example_sentences":[{"sentence":"The students listened receptively to the guest lecturer's presentation.","translation":"学生たちは客員講師のプレゼンテーションに受容的に耳を傾けた。","type":"example","meaning_category":"willingly listening"},{"sentence":"The company is trying to create a culture where employees respond receptively to constructive criticism.","translation":"会社は従業員が建設的な批判に受容的に対応する文化を築こうとしている。","type":"example","meaning_category":"open to feedback"},{"sentence":"She approached the negotiations receptively, hoping to find common ground.","translation":"彼女は共通点を見つけることを期待して、交渉に受容的に臨んだ。","type":"example","meaning_category":"willing to consider"}]}