{"word":"Foreshots","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(蒸留酒製造における) 初留液、ヘッド (有害なメタノールなどを多く含むため廃棄される部分)","english_definition":"The first portion of distillate collected during distillation, which contains volatile compounds that are often undesirable or toxic and are typically discarded.","examples":[{"sentence":"The foreshots were discarded due to their high concentration of methanol.","translation":"初留液はメタノールの濃度が高いため廃棄された。"},{"sentence":"Careful separation of the foreshots is crucial for producing a safe and high-quality spirit.","translation":"安全で高品質な蒸留酒を製造するためには、初留液の丁寧な分離が不可欠である。"}],"collocations":["discard the foreshots (初留液を捨てる)","separate the foreshots (初留液を分離する)","foreshots removal (初留液の除去)","methanol in foreshots (初留液中のメタノール)"],"synonyms":["heads","first runnings"],"antonyms":["hearts","tails"]}],"etymology":{"value":"Derived from 'fore-' (meaning 'before' or 'first') and 'shots' (referring to the portions of distillate collected during the distillation process).","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɔːrʃɑːts/","syllables":"fore-shots"},"inflection":{"noun_plural":"foreshots"},"usage_notes":{"explanation":"'Foreshots' refers specifically to the initial fraction of distillate collected during distillation, particularly in the context of spirits production. This fraction is typically high in volatile compounds like methanol, acetaldehyde, and ethyl acetate, which can be harmful or impart undesirable flavors. Therefore, foreshots are usually discarded to ensure the safety and quality of the final product. The term is most often used in the context of distilling alcoholic beverages, but it can also apply to other types of distillation processes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The foreshots are the best part of the whiskey.","correct":"✓ The foreshots are discarded because they contain harmful substances.","note":"Foreshots are not the best part; they are the first part and contain undesirable and potentially harmful compounds. They are always discarded. "},{"incorrect":"✗ Foreshots is used to flavor the spirit.","correct":"✓ Foreshots are discarded to prevent off-flavors in the spirit.","note":"Foreshots are not used to flavor the spirit. They are removed to avoid off-flavors."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["heads","hearts","tails","distillation","methanol","acetaldehyde","ethanol"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Foreshots' is a technical term used in the context of distillation, particularly in the production of alcoholic spirits. It refers to the first portion of liquid collected during the distillation process, which is high in volatile and often toxic compounds like methanol. Because these compounds are undesirable and potentially harmful, the foreshots are typically discarded. Understanding this term requires familiarity with the distillation process and the different fractions that are collected. It is not a commonly used word outside of this specific context."},"example_sentences":[{"sentence":"The distiller carefully monitored the temperature to ensure proper separation of the foreshots.","translation":"蒸留業者は、初留液を適切に分離するために温度を注意深く監視した。","type":"noun","meaning_category":"初留液"},{"sentence":"Due to the presence of methanol, the foreshots are not safe for consumption.","translation":"メタノールの存在により、初留液は摂取するには安全ではない。","type":"noun","meaning_category":"初留液"}]}