{"word":"spankings","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"おしりぺんぺん (体罰の一種)","english_definition":"plural of spanking: a punishment in which someone is hit on the buttocks with an open hand.","examples":[{"sentence":"The child received spankings for misbehaving.","translation":"その子供は行儀が悪かったため、おしりぺんぺんの体罰を受けた。"},{"sentence":"Spankings are a controversial form of discipline.","translation":"おしりぺんぺんは、議論の余地があるしつけの方法である。"}],"collocations":["give spankings","receive spankings"],"synonyms":["smacking","whipping","flogging"],"antonyms":[],"notes":"Often used in the plural, even when referring to a single instance."}],"etymology":{"value":"Derived from the verb 'spank,' which is of imitative origin, suggesting the sound of a slap.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspæŋkɪŋz/","syllables":"spank-ings"},"inflection":{"noun_plural":"spankings"},"usage_notes":{"explanation":"'Spankings' refers to the act of spanking as a form of punishment. It is often a controversial topic due to debates about its effectiveness and ethical implications as a disciplinary method. The term is usually used in the plural, even when referring to a single instance of the punishment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He gave a spanking to his son.","correct":"✓ He gave spankings to his son.","note":"While grammatically understandable, 'spankings' is more commonly used, even for a single instance."}],"priority":"★★☆"},"related_words":{"derivatives":["spank (verb)","spanker (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Spankings' refers to the act of hitting someone, usually a child, on their bottom as a form of punishment. It's often talked about in discussions about how to raise children and what's acceptable when disciplining them. Because it involves sensitive topics like physical punishment, it's a word that comes up in more complex conversations about parenting and ethics."},"example_sentences":[{"sentence":"The debate over the use of spankings in schools continues.","translation":"学校におけるおしりぺんぺんの使用に関する議論は続いている。","type":"noun","meaning_category":"体罰"},{"sentence":"Some parents believe that spankings are an effective disciplinary tool.","translation":"おしりぺんぺんが効果的なしつけの手段だと信じている親もいる。","type":"noun","meaning_category":"体罰"}]}