{"word":"subrogation","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(法律)代位、権利の代位取得","english_definition":"The substitution of one person or party for another with respect to certain rights or claims.","examples":[{"sentence":"The insurance company's right of subrogation allows it to pursue claims against the responsible party.","translation":"保険会社の代位権により、責任のある当事者に対して請求を追求することができます。"},{"sentence":"Subrogation is a common clause in insurance contracts.","translation":"代位は保険契約における一般的な条項です。"},{"sentence":"Through subrogation, the bank can step into the shoes of the borrower.","translation":"代位によって、銀行は借り手の立場を引き継ぐことができます。"}],"collocations":["right of subrogation (代位権)","exercise subrogation (代位を行使する)","insurance subrogation (保険代位)","contractual subrogation (契約上の代位)","equitable subrogation (衡平法上の代位)"],"synonyms":["substitution","succession","assignment","transfer"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from Latin subrogare ‘choose as a substitute’, from sub- ‘in place of’ + rogare ‘ask’.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌbrəˈɡeɪʃən/","syllables":"sub-ro-ga-tion"},"inflection":{"noun_plural":"subrogations"},"usage_notes":{"explanation":"**Subrogation** is a legal term referring to the substitution of one party for another in asserting a legal right or claim. It most commonly arises in insurance contexts, where an insurer pays out on a claim and then gains the right to pursue the at-fault party to recover the amount paid. This prevents the insured from receiving double compensation. Subrogation can also occur in other areas of law, such as banking and surety agreements. It is important to understand the specific terms and conditions outlined in the relevant contracts to determine the scope and limitations of subrogation rights.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The subrogation was done by the police.","correct":"✓ The subrogation was done by the insurance company.","note":"Subrogation is typically exercised by an insurance company or another entity that has compensated a party for a loss, not by law enforcement. "},{"incorrect":"✗ Subrogation means you get paid twice.","correct":"✓ Subrogation means the insurer can recover the money they paid you from the responsible party.","note":"Subrogation prevents double recovery. The insured is compensated, and the insurer seeks to recover their payout from the responsible party. "},{"incorrect":"✗ Subrogation is when you sue your own insurance company.","correct":"✓ Subrogation is when the insurance company sues the responsible party on your behalf.","note":"Subrogation involves the insurer pursuing a claim against the party that caused the loss, not against the insured. "}],"priority":"★★☆"},"related_words":{"derivatives":["subrogate (verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in legal and insurance contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"**Subrogation** is a specialized legal term that refers to the process where one party takes over the rights of another party to pursue a claim. This often happens in insurance, where the insurance company, after paying a claim to their customer, gains the right to sue the person who caused the damage to recover the money they paid out. Understanding this term is important in legal and insurance contexts to know who has the right to make a claim and how compensation is handled.","priority":"★☆☆"},"example_sentences":[{"sentence":"The insurance company pursued subrogation against the negligent driver.","translation":"保険会社は、過失運転者に対して代位権を行使した。","type":"general","meaning_category":"代位"},{"sentence":"Subrogation rights are outlined in the policy.","translation":"代位権は保険契約に明記されている。","type":"insurance","meaning_category":"代位"},{"sentence":"The bank sought subrogation after covering the debt.","translation":"銀行は債務を肩代わりした後、代位を求めた。","type":"banking","meaning_category":"代位"}]}