{"word":"rabblement","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語) 寄せ集めの群衆、下層民、暴徒","english_definition":"(archaic) A tumultuous crowd of people; the lowest class of people; a mob.","examples":[{"sentence":"The rabblement gathered in the town square, shouting their grievances.","translation":"寄せ集めの群衆が町の広場に集まり、不満を叫んだ。"},{"sentence":"The king feared the rabblement might rise up against his rule.","translation":"王は、下層民が彼の支配に対して立ち上がるのではないかと恐れた。"}],"collocations":["a gathering of rabblement","the unruly rabblement","the discontented rabblement"],"synonyms":["mob","crowd","riffraff","hoi polloi","lower class","commoners","throng","multitude"],"antonyms":["aristocracy","elite","upper class","gentry"],"notes":"This word is now considered archaic and is rarely used in modern English."}],"etymology":{"value":"From Middle English *rabelment*, from *rabelen* (to speak confusedly) + *-ment*. Compare *rabble*.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈræbəlmənt/","syllables":"rab-ble-ment"},"inflection":{"noun_plural":"rabblements"},"usage_notes":{"explanation":"'Rabblement' is an archaic term referring to a disorderly crowd, often of the lower classes. It carries a negative connotation, suggesting a lack of control and potential for violence or disruption. Due to its archaic nature, it is rarely used in contemporary English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The rabblement was very polite and orderly.","correct":"The crowd was very polite and orderly.","note":"'Rabblement' implies a disorderly crowd, so describing them as polite and orderly is contradictory."}],"priority":"★☆☆"},"related_words":{"derivatives":["rabble (noun): a disorderly crowd; (verb): to harass or attack as a mob"],"phrases":[]},"level_frequency":{"CEFR":"N/A (archaic)","frequency_google_ngram":"Very low (archaic)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Rabblement' is an archaic word, rarely used in modern English. It is most likely to be encountered in historical texts or literature. Understanding its meaning requires familiarity with older vocabulary and social contexts."},"example_sentences":[{"sentence":"The duke was unnerved by the sight of the angry rabblement outside his palace.","translation":"公爵は宮殿の外にいる怒った群衆を見て不安になった。","type":"noun","meaning_category":"tumultuous crowd"},{"sentence":"The speaker struggled to control the rabblement, whose shouts drowned out his words.","translation":"演説者は群衆を制御するのに苦労し、彼らの叫び声が彼の言葉をかき消した。","type":"noun","meaning_category":"disorderly crowd"}]}