{"word":"Stradivari","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"ストラディバリウス (楽器)","english_definition":"A violin, viola, cello, or other stringed instrument built by members of the Italian family Stradivari, particularly Antonio Stradivari, during the 17th and 18th centuries.","examples":[{"sentence":"The museum displays a Stradivari violin.","translation":"その博物館にはストラディバリウスのバイオリンが展示されている。"},{"sentence":"A Stradivari is known for its exceptional sound quality.","translation":"ストラディバリウスはその卓越した音質で知られている。"},{"sentence":"Owning a Stradivari is a dream for many musicians.","translation":"ストラディバリウスを所有することは多くの音楽家の夢である。"}],"collocations":["Stradivari violin","Stradivari cello","own a Stradivari","play a Stradivari","Stradivari instrument"],"synonyms":["Strad","Stradivarius"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ストラディバリウスの、ストラディバリウスのような","english_definition":"Resembling or characteristic of a Stradivarius instrument, especially in terms of sound quality.","examples":[{"sentence":"The luthier aimed to create a Stradivari sound.","translation":"その弦楽器製作者はストラディバリウスのような音を作り出すことを目指した。"},{"sentence":"The instrument had a Stradivari quality to its tone.","translation":"その楽器の音色にはストラディバリウスのような質があった。"}],"collocations":["Stradivari sound","Stradivari quality","Stradivari tone"],"synonyms":["Stradivarius-like"],"antonyms":[]}],"etymology":{"value":"Named after the Stradivari family, particularly Antonio Stradivari (1644–1737), the most famous member, who was an Italian luthier (stringed instrument maker) from Cremona.","priority":"★★★"},"pronunciation":{"ipa":"/ˌstrædɪˈvɑːri/","syllables":"Stra-di-va-ri"},"inflection":{"notes":"Plural form is Stradivaris or Stradivari. Often used attributively (e.g., Stradivari violin)."},"usage_notes":{"explanation":"'Stradivari' typically refers to instruments made by Antonio Stradivari, but can also include instruments made by other members of the Stradivari family. These instruments are highly valued for their craftsmanship and sound. The term is often used to describe anything of exceptional quality in the context of stringed instruments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a Stradivarius violin. It's very cheap.","correct":"✓ I have a Stradivarius violin. It's very valuable.","note":"Stradivarius instruments are extremely valuable, so claiming it's cheap is contradictory."},{"incorrect":"✗ He plays the Stradivariuses.","correct":"✓ He plays the Stradivari.","note":"When referring to a specific Stradivari instrument, the singular form is often used, even when discussing the type of instrument in general."}],"priority":"★★☆"},"related_words":{"derivatives":["Stradivarius (noun): A more common synonym for Stradivari.","luthier (noun): A maker of stringed instruments."],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, primarily used in contexts related to classical music and instrument collecting.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stradivari' refers to stringed instruments made by the Stradivari family, especially Antonio Stradivari, known for their exceptional quality and value. The term is most often encountered in discussions of classical music, instrument collecting, or high-end craftsmanship. Understanding this term requires familiarity with the world of fine musical instruments.","priority":"★★☆"},"example_sentences":[{"sentence":"The concert featured a performance on a genuine Stradivari cello.","translation":"そのコンサートでは、本物のストラディバリウスのチェロによる演奏が披露された。","type":"noun","meaning_category":"Instrument"},{"sentence":"Many experts have tried to replicate the unique varnish used on Stradivari instruments.","translation":"多くの専門家が、ストラディバリウスの楽器に使われた独特のニスを再現しようと試みてきた。","type":"adjective","meaning_category":"Characteristic"},{"sentence":"The auction included several rare Stradivaris.","translation":"そのオークションには、いくつかの希少なストラディバリウスが含まれていた。","type":"noun","meaning_category":"Instruments (plural)"}]}