{"word":"porte-cochere","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"車寄せ、玄関車寄せ","english_definition":"A covered entrance large enough for vehicles to pass through, typically leading to a building entrance.","examples":[{"sentence":"The hotel had an impressive porte-cochere where guests could alight from their cars under cover.","translation":"そのホテルには印象的な車寄せがあり、宿泊客は屋根の下で車から降りることができた。"},{"sentence":"The porte-cochere protected visitors from the rain as they entered the building.","translation":"車寄せは、建物に入る訪問者を雨から守った。"}],"collocations":["covered porte-cochere","grand porte-cochere","hotel porte-cochere","residential porte-cochere"],"synonyms":["carport","covered driveway","carriage porch"],"antonyms":["open-air entrance"]}],"etymology":{"value":"From French porte-cochère, from porte (door) + cochère (coach entrance), referring to a large gateway allowing carriages to enter a courtyard.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɔːrt koʊˈʃɛər/","syllables":"porte-co-chere"},"inflection":{"noun_plural":"porte-cocheres"},"usage_notes":{"explanation":"A porte-cochere is an architectural feature designed to provide sheltered access for vehicles and their passengers to a building's entrance. It is often found in hotels, mansions, and other large buildings. It differs from a carport in that it is typically part of the main structure and designed for temporary vehicle passage rather than long-term parking.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The portico was used as a porte-cochere.","correct":"✓ The porte-cochere was used for dropping off passengers.","note":"A portico is a colonnaded porch or entrance to a building, while a porte-cochere is specifically designed for vehicles to pass through."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'porte-cochere' is a relatively uncommon architectural term referring to a covered entrance that allows vehicles to pass through, providing shelter. It is most often encountered in descriptions of upscale hotels, historic mansions, or architecturally significant buildings. Understanding this term enhances comprehension of architectural descriptions and historical contexts."},"example_sentences":[{"sentence":"The mansion featured an elegant porte-cochere, allowing guests to arrive in style regardless of the weather.","translation":"その大邸宅は、天候に関わらずゲストがスタイリッシュに到着できる、エレガントな車寄せを備えていた。","type":"general","meaning_category":"general"},{"sentence":"The design plans included a porte-cochere to provide a convenient drop-off area for residents.","translation":"設計図には、居住者のための便利な降車場所を提供する車寄せが含まれていた。","type":"architectural","meaning_category":"architectural"}]}