{"word":"company-dominated","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"企業によって支配されている、企業の影響力が強い","english_definition":"Controlled or heavily influenced by a company or corporation.","examples":[{"sentence":"The union was accused of being company-dominated and not truly representing the workers.","translation":"その労働組合は、企業に支配され、真に労働者を代表していないと非難された。"},{"sentence":"Critics argued that the regulatory agency was company-dominated, leading to lax enforcement of environmental laws.","translation":"批評家たちは、その規制機関が企業に支配されており、環境法の執行が緩くなっていると主張した。"},{"sentence":"The media outlet was criticized for its company-dominated coverage of the industry.","translation":"そのメディアは、業界に関する報道が企業に支配されていると批判された。"}],"collocations":["company-dominated union (企業支配の労働組合)","company-dominated board (企業支配の取締役会)","company-dominated media (企業支配のメディア)","company-dominated culture (企業支配の文化)"],"synonyms":["company-controlled","company-influenced","corporation-dominated","corporation-controlled","corporation-influenced"],"antonyms":["independent","autonomous","worker-controlled","employee-controlled"]}],"etymology":{"value":"The word is formed by combining 'company' (referring to a business or corporation) with 'dominated' (meaning controlled or heavily influenced).","priority":"N/A"},"pronunciation":{"ipa":"/ˈkʌmpəniˌdɒmɪneɪtɪd/","syllables":"com-pa-ny-dom-i-nat-ed"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Company-dominated' is used to describe situations, organizations, or entities where a company or corporation exerts excessive control or influence. This often implies a lack of independence or objectivity. It is frequently used in negative contexts, suggesting that the company's interests are prioritized over those of other stakeholders (e.g., workers, the public, the environment).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company dominated the market, so it was company-dominated.","correct":"✓ Because the company dominated the market, the industry became company-dominated.","note":"The first sentence is redundant. The second sentence clarifies that the company's market dominance led to the industry being dominated by companies."},{"incorrect":"✗ The company-dominated is good for profits.","correct":"✓ A company-dominated market is good for profits.","note":"'Company-dominated' is an adjective and needs a noun to modify. 'Company dominance' could also be used."}],"priority":"★☆☆"},"related_words":{"derivatives":["dominate (verb)","domination (noun)","company (noun)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency. Used in specialized contexts (business, politics, labor relations).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Company-dominated' is a complex adjective used to describe situations where a company or corporation has excessive control or influence. It is typically used in critical or analytical contexts to suggest a lack of independence or objectivity. Understanding requires familiarity with concepts of corporate power, influence, and potential conflicts of interest. The word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The investigation revealed that the regulatory board was company-dominated, leading to biased decisions.","translation":"調査の結果、規制委員会が企業に支配されており、偏った決定につながっていたことが明らかになった。","type":"example","meaning_category":"Controlled by a company"},{"sentence":"The company-dominated culture stifled creativity and innovation among employees.","translation":"企業に支配された文化は、従業員の創造性と革新性を抑制した。","type":"example","meaning_category":"Influenced by a company"},{"sentence":"Critics argued that the proposed legislation would create a company-dominated market, harming consumers.","translation":"批評家たちは、提案された法律が企業支配の市場を生み出し、消費者に損害を与えると主張した。","type":"example","meaning_category":"Dominated by a company"}]}