{"word":"telegnostic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(超心理学)遠隔透視の、千里眼の","english_definition":"Relating to or having the ability of telegnosis (extrasensory perception of distant events or information).","examples":[{"sentence":"The telegnostic abilities of the psychic were tested.","translation":"その超能力者の遠隔透視能力がテストされた。"},{"sentence":"Some believe that telegnostic dreams can predict future events.","translation":"遠隔透視の夢は未来の出来事を予知できると信じる人もいる。"}],"collocations":["telegnostic ability","telegnostic dream","telegnostic powers"],"synonyms":["clairvoyant","extrasensory","psychic","telepathic"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'tele' (far off, at a distance) and 'gnosis' (knowledge).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɛlɪɡˈnɒstɪk/","syllables":"te-le-gnos-tic"},"inflection":{"notes":"Comparative and superlative forms are telegnostic, more telegnostic, most telegnostic."},"usage_notes":{"explanation":"The term 'telegnostic' is primarily used in the context of parapsychology and refers to the purported ability to gain knowledge of distant or unseen events through extrasensory perception. It is often associated with psychic abilities and clairvoyance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used telegnostic to fix the television.","correct":"✓ He claimed to have telegnostic abilities.","note":"'Telegnostic' describes a psychic ability, not a practical skill like repairing electronics."}],"priority":"★★☆"},"related_words":{"derivatives":["telegnosis (noun): the supposed ability to perceive distant events or information through extrasensory means."],"related_concepts":["clairvoyance","precognition","telepathy","extrasensory perception (ESP)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in specialized contexts related to parapsychology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Telegnostic' is a specialized term primarily used in the context of parapsychology to describe the ability to gain knowledge of distant events through extrasensory perception. Due to its specific and uncommon usage, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The scientist studied individuals who claimed to have telegnostic abilities.","translation":"その科学者は遠隔透視能力を持つと主張する人々を研究した。","type":"adjective","meaning_category":"遠隔透視の"},{"sentence":"Reports of telegnostic experiences are often met with skepticism.","translation":"遠隔透視の経験の報告はしばしば懐疑的に見られる。","type":"adjective","meaning_category":"遠隔透視の"}]}