{"word":"Shogun","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"将軍","english_definition":"A title applied to the chief military commanders of Japan from the 8th century to 1185, and then became the title of the military dictators of Japan during most of the period spanning from 1185 to 1868.","examples":[{"sentence":"The Shogun ruled Japan during the Edo period.","translation":"将軍は江戸時代に日本を統治した。"},{"sentence":"The power of the Shogun gradually declined over time.","translation":"将軍の権力は徐々に衰退していった。"}],"collocations":["Tokugawa Shogun (徳川将軍)","Ashikaga Shogun (足利将軍)","Minamoto Shogun (源氏将軍)"],"synonyms":["military dictator","warlord"],"antonyms":["Emperor (天皇)"]},{"part_of_speech":"noun","definition":"(比喩的に) 支配者、実力者","english_definition":"(figuratively) A powerful leader or figure who wields significant control or influence.","examples":[{"sentence":"He became the Shogun of the tech industry.","translation":"彼はテクノロジー業界の支配者となった。"}],"collocations":[],"synonyms":["leader","boss","chief","kingpin"],"antonyms":["follower","subordinate"]}],"etymology":{"value":"From Japanese 将軍 (shōgun), literally 'military commander'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈʃoʊɡʌn/","syllables":"sho-gun"},"inflection":{"noun_plural":"Shoguns"},"usage_notes":{"explanation":"\"Shogun\" refers specifically to the military dictators of Japan, especially during the Kamakura, Muromachi, and Edo periods. It's important to capitalize the word as it's a title. The term is often used in historical contexts or when discussing Japanese culture.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a shogun samurai.","correct":"✓ He was a samurai serving the Shogun.","note":"A shogun was not a samurai, but a higher-ranking leader to whom samurai pledged allegiance."}],"priority":"★★☆"},"related_words":{"derivatives":["Shogunate (幕府)"],"related_terms":["daimyo (大名)","samurai (侍)","bakufu (幕府)","Edo period (江戸時代)","Kamakura period (鎌倉時代)","Muromachi period (室町時代)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, mainly used in historical or cultural contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"Shogun\" is a historical term referring to the military dictators of Japan. Understanding its meaning requires some knowledge of Japanese history, particularly the periods when the Shogunate held power. The term is not commonly used in everyday conversation but appears in historical texts, documentaries, and discussions about Japanese culture. It is important to distinguish the Shogun from the Emperor, who was the symbolic head of state.","priority":"★★☆"},"example_sentences":[{"sentence":"The Tokugawa Shogunate ruled Japan for over 250 years.","translation":"徳川幕府は250年以上にわたり日本を統治した。","type":"historical context","meaning_category":"将軍"},{"sentence":"The Shogun held more power than the Emperor during that era.","translation":"その時代、将軍は天皇よりも大きな権力を持っていた。","type":"historical context","meaning_category":"将軍"},{"sentence":"The novel tells the story of a Westerner who becomes involved in the Shogun's court.","translation":"その小説は、将軍の宮廷に関わることになった西洋人の物語を描いている。","type":"cultural context","meaning_category":"将軍"},{"sentence":"He was considered the Shogun of the business world due to his influence.","translation":"彼はその影響力から、ビジネス界の将軍とみなされていた。","type":"figurative","meaning_category":"支配者"}]}