{"word":"verbalist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"言葉にこだわる人、言葉の字義解釈に固執する人","english_definition":"a person who is skilled in the use of words, or who pays excessive attention to words rather than to the substance or meaning of what is being said.","examples":[{"sentence":"He was accused of being a verbalist, more concerned with semantics than with practical solutions.","translation":"彼は言葉にこだわりすぎる人だと非難され、実際的な解決策よりも意味論にばかり気を取られていると言われた。"},{"sentence":"The debate devolved into a pointless argument between verbalists arguing over definitions.","translation":"その討論は、定義について議論する言葉にこだわる人々の間で、無意味な議論に堕落した。"}],"collocations":["skilled verbalist (熟練した言葉の使い手)","mere verbalist (単なる言葉の字義解釈者)"],"synonyms":["rhetorician","logophile","wordsmith","grammarian","pedant"],"antonyms":[]}],"etymology":{"value":"'Verbal'（言葉の）に '-ist'（～主義者、～専門家）を付けたもの。","priority":"★★☆"},"pronunciation":{"ipa":"ˈvɜːrbəlɪst","syllables":"ver-bal-ist"},"inflection":{"noun_plural":"verbalists"},"usage_notes":{"explanation":"'Verbalist' は、言葉の扱いに長けている人、または言葉の字義解釈に過度にこだわる人を指します。肯定的な意味合いで使われることは少なく、多くの場合、言葉遊びや形式主義に陥っているという批判的な意味合いで使用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He's a great communicator, a true verbalist.","correct":"He's a great communicator, a true wordsmith.","note":"'Verbalist' は、コミュニケーション能力が高い人を褒める言葉としては適切ではありません。より肯定的な意味合いを持つ 'wordsmith' を使う方が適切です。"},{"incorrect":"The verbalist explained the scientific theory with ease.","correct":"The scientist explained the scientific theory with ease.","note":"科学理論を説明する人を 'verbalist' と呼ぶのは不自然です。その分野の専門家（この場合は 'scientist'）を使う方が適切です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["verbal (形容詞: 言葉の、口頭の)","verbalize (動詞: 言葉で表現する)","verbalism (名詞: 言葉至上主義、形式主義)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「verbalist」という単語は、言葉を巧みに使う人、あるいは言葉の表面的な意味にこだわりすぎる人を指します。この単語は、しばしば批判的な意味合いで使用され、内容よりも言葉の形式に偏っているというニュアンスを含みます。例えば、議論において、本質的な問題ではなく言葉の定義にばかり固執する人を「verbalist」と呼ぶことがあります。日常会話ではあまり使われませんが、学術的な文脈や、言葉の重要性について議論する際に用いられることがあります。"},"example_sentences":[{"sentence":"The politician was criticized for being a verbalist, using eloquent language to obscure the truth.","translation":"その政治家は、真実を曖昧にするために雄弁な言葉を使う言葉の字義解釈者だと批判された。","type":"noun","meaning_category":"言葉にこだわる人"},{"sentence":"The lawyer's verbalist skills were evident in his closing argument, where he skillfully manipulated the language to sway the jury.","translation":"弁護士の言葉の字義解釈者としてのスキルは、最終弁論で明らかであり、彼は言葉を巧みに操って陪審員の心を動かした。","type":"noun","meaning_category":"言葉にこだわる人"}]}