{"word":"Nonprocurement","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(政府・企業などによる)非調達、不調達","english_definition":"The act or policy of not procuring or purchasing goods or services, typically by a government or corporation.","examples":[{"sentence":"The government announced a nonprocurement policy for certain types of equipment.","translation":"政府は、特定の種類の機器に対する不調達政策を発表した。"},{"sentence":"The company's nonprocurement decision was based on budget constraints.","translation":"会社の不調達決定は、予算の制約に基づいていた。"}],"collocations":["nonprocurement policy","nonprocurement decision","strategic nonprocurement"],"synonyms":["abstention from procurement","forgoing procurement","non-acquisition"],"antonyms":["procurement","acquisition","purchasing"]},{"part_of_speech":"adjective","definition":"非調達の、不調達に関する","english_definition":"Relating to the act or policy of not procuring or purchasing goods or services.","examples":[{"sentence":"The nonprocurement agreement aimed to reduce costs.","translation":"その非調達協定は、コスト削減を目的としていた。"},{"sentence":"We need to analyze the nonprocurement impact on local businesses.","translation":"地元の企業に対する不調達の影響を分析する必要がある。"}],"collocations":["nonprocurement agreement","nonprocurement impact","nonprocurement strategy"],"synonyms":["non-acquiring","non-purchasing"],"antonyms":["procurement-related","purchasing-related"]}],"etymology":{"value":"Formed by adding the prefix \"non-\" (meaning \"not\") to the word \"procurement\" (the act of obtaining or purchasing goods and services).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnprəˈkjʊərmənt/","syllables":"non-pro-cure-ment"},"inflection":{"noun_plural":"nonprocurements"},"usage_notes":{"explanation":"\"Nonprocurement\" refers to the deliberate decision or policy to refrain from purchasing or acquiring specific goods or services. It is often used in the context of government or corporate spending and can be driven by various factors such as budget limitations, strategic considerations, or policy changes. It is the opposite of \"procurement,\" which means the act of obtaining goods or services.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-procurement of the contract was surprising.","correct":"✓ The nonprocurement decision regarding the contract was surprising.","note":"It's better to specify that nonprocurement is a decision or policy to avoid ambiguity."},{"incorrect":"✗ The company decided to nonprocure the new software.","correct":"✓ The company decided against procuring the new software.","note":"\"Nonprocure\" is not typically used as a verb. Use \"decided against procuring\" or similar phrasing."}],"priority":"★★☆"},"related_words":{"derivatives":["procurement","procure","non-","non-payment","non-compliance"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonprocurement\" is a formal term referring to the decision not to buy goods or services, often used in business or government contexts. It's the opposite of \"procurement,\" which means buying things. You might see it in discussions about budgets or strategic planning. It's not a common word in everyday conversation, so it's more likely to appear in written reports or formal presentations."},"example_sentences":[{"sentence":"The city council voted for a temporary nonprocurement of new vehicles.","translation":"市議会は、新しい車両の不調達を一時的に行うことを決議した。","type":"noun","meaning_category":"非調達"},{"sentence":"The nonprocurement strategy was designed to stimulate local production.","translation":"その非調達戦略は、地元の生産を刺激するように設計されていた。","type":"adjective","meaning_category":"非調達の"}]}