{"word":"colourfast","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(布地などが)色落ちしない、耐変色の","english_definition":"(of a fabric or dye) not liable to fade or run.","examples":[{"sentence":"This shirt is made of colourfast material.","translation":"このシャツは色落ちしない素材でできている。"},{"sentence":"Make sure the fabric is colourfast before washing it.","translation":"洗濯する前に、生地が色落ちしないことを確認してください。"}],"collocations":["colourfast dye (色落ちしない染料)","colourfast fabric (色落ちしない生地)"],"synonyms":["fade-resistant","nonfading","durable color","color-stable"],"antonyms":["non-colourfast","fading","running"]},{"part_of_speech":"noun","definition":"色落ちしない染料、耐変色染料","english_definition":"A dye that does not fade or run.","examples":[{"sentence":"The manufacturer uses only the best colourfast dyes.","translation":"製造業者は最高の色落ちしない染料のみを使用しています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"\"colour\" + \"fast\".  \"Fast\" in this context means firmly fixed or resistant to fading or running.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkʌlərfæst/","syllables":"col-our-fast"},"inflection":{"notes":"The word 'colourfast' does not change form for pluralization or different tenses, as it is primarily used as an adjective. It can function as a noun, but this is less common and doesn't change the form."},"usage_notes":{"explanation":"\"Colourfast\" is primarily used to describe fabrics or dyes that are resistant to losing their color when washed, exposed to light, or subjected to other conditions. It is an important quality for textiles, ensuring that clothes and other items maintain their appearance over time. The British English spelling is 'colourfast', while the American English spelling is 'colorfast'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This fabric is very colourfastly.","correct":"✓ This fabric is very colourfast.","note":"'Colourfast' is an adjective, so it should not be used with the '-ly' suffix, which is typically used to form adverbs."},{"incorrect":"✗ The colourfast of this shirt is good.","correct":"✓ The colourfastness of this shirt is good.","note":"To refer to the property of being colourfast, use the noun 'colourfastness'."}],"priority":"★★☆"},"related_words":{"derivatives":["colourfastness (noun: the quality of being colourfast)","colorfast (American English spelling)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Colourfast' is a technical term used to describe materials, especially fabrics, that do not lose color easily when washed or exposed to light. It's a combination of 'colour' (the visual perception of different wavelengths of light) and 'fast' (meaning resistant or firmly fixed). If you see this term when buying clothes or fabrics, it means the item is designed to keep its color for a long time."},"example_sentences":[{"sentence":"The label says the dye is **colourfast**, so it shouldn't run in the wash.","translation":"ラベルには染料は色落ちしないと書いてあるので、洗濯しても色移りしないはずです。","type":"adjective","meaning_category":"色落ちしない"},{"sentence":"We need to use **colourfast** thread for this project to ensure the colors don't fade.","translation":"色が褪せないように、このプロジェクトでは色落ちしない糸を使う必要があります。","type":"adjective","meaning_category":"色落ちしない"},{"sentence":"The **colourfastness** of the fabric was tested before being used in production.","translation":"生産に使用する前に、生地の耐変色性がテストされました。","type":"related (colourfastness)","meaning_category":"色落ちしないこと"}]}