{"word":"De-marketize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"市場原理を適用しないようにする、市場化されたものを非市場化する","english_definition":"To remove from or protect from market forces; to reverse a process of marketization.","examples":[{"sentence":"The government decided to de-marketize the healthcare system to ensure equal access for all citizens.","translation":"政府は、すべての市民が平等に医療を受けられるように、医療制度を非市場化することを決定した。"},{"sentence":"Efforts to de-marketize education are aimed at reducing the influence of profit-driven motives.","translation":"教育の非市場化の取り組みは、利益追求の動機の影響を減らすことを目的としている。"}],"collocations":["de-marketize healthcare","de-marketize education","de-marketize public services"],"synonyms":["remove from market","non-marketize","decommodify"],"antonyms":["marketize","commodify","privatize"]}],"etymology":{"value":"Derived from the prefix 'de-' (meaning 'remove' or 'reverse') and 'marketize' (to subject to market forces).","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈmɑːrkɪtaɪz/","syllables":"de-mar-ket-ize"},"inflection":{"verb_forms":{"present_simple":["de-marketize","de-marketizes"],"past_simple":"de-marketized","past_participle":"de-marketized","present_participle":"de-marketizing"}},"usage_notes":{"explanation":"'De-marketize' is often used in discussions about public services, such as healthcare and education, where there is debate about the appropriate role of market forces. It implies a deliberate effort to move away from a market-based model.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city de-marketized.","correct":"✓ The city de-marketized the public transportation system.","note":"'De-marketize' is a transitive verb and usually requires a direct object (something that is being de-marketized)."},{"incorrect":"✗ De-marketizing is good.","correct":"✓ De-marketizing public services is a complex issue.","note":"When using 'de-marketizing' as a gerund (noun), it's important to provide context or specify what is being de-marketized."}],"priority":"★☆☆"},"related_words":{"derivatives":["de-marketization (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'De-marketize' is a specialized term used in economics and political science to describe the process of removing or reducing the influence of market forces in a particular sector or industry. It's often used in the context of public services like healthcare, education, or utilities, where there is debate about whether these services should be subject to market competition or provided as public goods. The term implies a deliberate policy decision to move away from a market-based model and towards a more state-controlled or non-profit approach."},"example_sentences":[{"sentence":"The proposal aims to de-marketize the water supply, ensuring it remains a public resource.","translation":"その提案は、水道供給を非市場化し、公共資源として維持することを目的としている。","type":"verb","meaning_category":"非市場化する"},{"sentence":"Some argue that de-marketizing essential services can lead to greater equity and accessibility.","translation":"不可欠なサービスを非市場化することで、より大きな公平性とアクセスしやすさにつながる可能性があると主張する人もいる。","type":"verb","meaning_category":"非市場化する"}]}