{"word":"industry-supported","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"産業界が支援する、業界の支援を受けた","english_definition":"Supported financially or otherwise by an industry or industries.","examples":[{"sentence":"The study was industry-supported and therefore potentially biased.","translation":"その研究は業界の支援を受けており、したがって偏っている可能性がある。"},{"sentence":"Industry-supported research often focuses on specific products or technologies.","translation":"業界の支援を受けた研究は、特定の製品または技術に焦点を当てることが多い。"},{"sentence":"The conference was industry-supported, allowing for lower registration fees.","translation":"会議は業界の支援を受けていたため、登録料を低く抑えることができた。"}],"collocations":["industry-supported research (業界支援の研究)","industry-supported program (業界支援のプログラム)","industry-supported initiative (業界支援のイニシアチブ)","industry-supported event (業界支援のイベント)"],"synonyms":["industry-funded","industry-sponsored"],"antonyms":["independently funded","government-funded","nonprofit-supported"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'industry' (referring to a specific branch of economic activity), 'supported' (meaning to provide assistance, especially financially), and the hyphen connecting them to indicate a single, combined attribute.","priority":"N/A"},"pronunciation":{"ipa":"/ɪnˈdʌstri səˈpɔːrtɪd/","syllables":"in-dus-try-sup-port-ed"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"'Industry-supported' is used to describe something that receives backing, typically financial, from one or more industries. This support can influence the direction, outcomes, or perception of the supported entity. It is often used in contexts such as research, education, or events, where the source of funding is relevant to understanding potential biases or priorities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The supported industry research.","correct":"✓ The industry-supported research.","note":"The adjective 'industry-supported' should precede the noun it modifies to correctly indicate that the research is supported by the industry."},{"incorrect":"✗ The research was support by industry.","correct":"✓ The research was supported by industry.","note":"'Supported' is the past participle form of the verb 'support' and is used to form the passive voice. 'Support' is the base form of the verb and is incorrect in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["industry","support","supported","funding","sponsored"],"phrases":["private sector funding","corporate sponsorship","commercial backing"],"priority":"N/A"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in academic and business contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'industry-supported' is a compound adjective indicating that something (e.g., research, a program, an event) receives funding or other forms of assistance from one or more industries. It's important to be aware that industry support can sometimes create a conflict of interest or bias, so the term is often used in contexts where transparency about funding sources is important. The level is C1 because it's not a common word in everyday conversation, but it's frequently used in more specialized or formal contexts like academic research or business reports."},"example_sentences":[{"sentence":"The university's engineering department has several industry-supported projects.","translation":"その大学の工学部には、業界が支援するプロジェクトがいくつかある。","type":"adjective","meaning_category":"general"},{"sentence":"The industry-supported study showed promising results for the new drug.","translation":"業界の支援を受けた研究は、その新薬について有望な結果を示した。","type":"adjective","meaning_category":"research"},{"sentence":"The conference relies heavily on industry-supported sponsorships to cover its costs.","translation":"会議は、費用を賄うために業界の支援を受けたスポンサーシップに大きく依存している。","type":"adjective","meaning_category":"events"}]}