{"word":"languaging","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"言語化、言語活動、言語使用","english_definition":"The process of using language; the act of expressing something in language.","examples":[{"sentence":"Languaging is a fundamental aspect of human communication.","translation":"言語化は人間のコミュニケーションの基本的な側面である。"},{"sentence":"The students explored different approaches to languaging their ideas.","translation":"学生たちは、自分たちの考えを言語化するためのさまざまなアプローチを探求した。"},{"sentence":"Effective languaging can improve understanding and collaboration.","translation":"効果的な言語化は、理解と協調を向上させることができる。"}],"collocations":["facilitate languaging (言語化を促進する)","support languaging (言語化を支援する)","promote languaging (言語化を促進する)","engage in languaging (言語化に取り組む)","process of languaging (言語化のプロセス)"],"synonyms":["articulation","expression","verbalization","communication","formulation"],"antonyms":["nonverbal communication","silence"]},{"part_of_speech":"verb","definition":"言語化する、言語を用いて表現する","english_definition":"To express something in language; to articulate or verbalize.","examples":[{"sentence":"She is languaging her feelings through poetry.","translation":"彼女は詩を通して自分の感情を言語化している。"},{"sentence":"The author is languaging complex ideas in a clear and accessible way.","translation":"著者は複雑なアイデアを明確でアクセスしやすい方法で言語化している。"},{"sentence":"We need to language our concerns more effectively.","translation":"私たちは、自分たちの懸念をより効果的に言語化する必要がある。"}],"collocations":["language feelings (感情を言語化する)","language ideas (アイデアを言語化する)","language thoughts (考えを言語化する)","language experiences (経験を言語化する)"],"synonyms":["articulate","express","verbalize","formulate","communicate"],"antonyms":["remain silent","suppress","withhold"]}],"etymology":{"value":"Derived from the word 'language' with the addition of '-ing' to denote a process or activity. The term emphasizes the dynamic and active nature of using language.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlæŋɡwɪdʒɪŋ/","syllables":"lan-gua-ging"},"inflection":{"verb_forms":{"present_simple":["languaging"],"past_simple":"languaged","past_participle":"languaged","present_participle":"languaging"}},"usage_notes":{"explanation":"'Languaging' is a term often used in academic and professional contexts to describe the active process of using language to create meaning, express ideas, and communicate with others. It emphasizes the dynamic and ongoing nature of language use, rather than viewing language as a static system. It can refer to both the act of speaking and writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The languaging of the book was difficult to understand.","correct":"✓ The language of the book was difficult to understand.","note":"'Languaging' refers to the process of using language, not the language itself. Use 'language' to describe the style or quality of the writing. "},{"incorrect":"✗ He is good at language.","correct":"✓ He is good at languaging his ideas.","note":"If you want to emphasize the ability to express ideas effectively, 'languaging' can be used. Otherwise, 'language' is more general."}],"priority":"★★☆"},"related_words":{"derivatives":["language","linguistics","languaged"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Languaging' is a more advanced term that refers to the active process of using language to express thoughts, ideas, and feelings. It's often used in academic or professional settings to emphasize the dynamic and ongoing nature of language use. It's not as common as 'language' itself, so it's important to understand the specific context in which it's used."},"example_sentences":[{"sentence":"The project aims to explore the different ways people are languaging their identities online.","translation":"このプロジェクトは、人々がオンラインで自分のアイデンティティをどのように言語化しているかを探求することを目的としている。","type":"noun","meaning_category":"言語化のプロセス"},{"sentence":"She is skillfully languaging her experiences to create vivid imagery in her writing.","translation":"彼女は自分の経験を巧みに言語化して、文章に鮮やかなイメージを作り出している。","type":"verb","meaning_category":"言語化する"},{"sentence":"The course focuses on improving students' languaging skills.","translation":"このコースは、学生の言語化スキルを向上させることに焦点を当てている。","type":"noun","meaning_category":"言語化スキル"}]}