{"word":"cyclosporous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having spores arranged in a circle.","english_definition":"Describing a structure or organism that has spores arranged in a circular pattern.","examples":[{"sentence":"The lichen exhibited a cyclosporous arrangement of spores.","translation":"その地衣類は、胞子が環状に配置されている様子を示した。"},{"sentence":"The cyclosporous nature of the fungus aided in its identification.","translation":"その菌類の環状胞子の性質が、その同定に役立った。"}],"collocations":["cyclosporous lichen","cyclosporous fungi","spore arrangement","circular spores"],"synonyms":["annular","circular-spored","ring-shaped"],"antonyms":["irregular","scattered","linear"]}],"etymology":{"value":"Derived from the combination of 'cyclo-' (from Greek 'kyklos' meaning 'circle') and 'sporous' (referring to spores).","priority":"★★★"},"pronunciation":{"ipa":"/saɪˈklɒspərəs/","syllables":"cy-clo-spo-rous"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"The term 'cyclosporous' is primarily used in botany and mycology to describe the arrangement of spores in certain organisms, particularly lichens and fungi. It indicates that the spores are not scattered randomly but are organized in a circular or ring-like pattern. This feature can be a key characteristic in identifying and classifying these organisms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bacteria were cyclosporous.","correct":"✓ The bacteria were spherical.","note":"'Cyclosporous' refers to spore arrangement, not the overall shape of an organism. Bacteria are typically described by shapes like spherical, rod-shaped, etc."},{"incorrect":"✗ The spores were cyclosporous.","correct":"✓ The spore arrangement was cyclosporous.","note":"It's the arrangement that is cyclosporous, not the spores themselves."}],"priority":"★★☆"},"related_words":{"derivatives":["cyclospore (noun: a spore arranged in a circle)","spore (noun: a reproductive unit of a fungus, plant, alga or protozoan)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency - specialized scientific term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Cyclosporous' is a technical term used in biology, specifically when describing the arrangement of spores in certain organisms like lichens and fungi. It means that the spores are arranged in a circular or ring-like pattern. This term is not commonly used in everyday language and is primarily found in scientific literature or specialized contexts. Understanding this term requires a background in biology or mycology."},"example_sentences":[{"sentence":"The cyclosporous arrangement of asci in the apothecium is a diagnostic feature of this lichen species.","translation":"子嚢盤における子嚢の環状配置は、この地衣類の診断上の特徴である。","type":"adjective","meaning_category":"Spore arrangement"},{"sentence":"Microscopic examination revealed the cyclosporous nature of the sporangia.","translation":"顕微鏡検査により、胞子嚢の環状胞子の性質が明らかになった。","type":"adjective","meaning_category":"Spore arrangement"}]}