{"word":"perissodactylic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"奇蹄目の、奇蹄類の","english_definition":"Relating to or belonging to the order Perissodactyla, which includes mammals with an odd number of toes on each foot, such as horses, rhinoceroses, and tapirs.","examples":[{"sentence":"Horses are perissodactylic mammals.","translation":"馬は奇蹄目の哺乳類です。"},{"sentence":"The perissodactylic family includes rhinoceroses.","translation":"奇蹄目の仲間にはサイが含まれます。"}],"collocations":["perissodactylic mammal","perissodactylic family","perissodactylic characteristics"],"synonyms":["odd-toed ungulate"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'perissos' (odd, extraordinary) + 'daktulos' (finger, toe).","priority":"★★☆"},"pronunciation":{"ipa":"/pəˌrɪsədoʊˈdæktɪlɪk/","syllables":"pe-ris-so-dac-ty-lic"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms (more perissodactylic, most perissodactylic), although they are rarely used."},"usage_notes":{"explanation":"'Perissodactylic' is a technical term used in zoology to classify mammals that belong to the order Perissodactyla. These animals are characterized by having an odd number of toes on their hind feet, with the middle toe being the largest and bearing the most weight. Examples include horses, rhinoceroses, and tapirs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ perissodactyl","correct":"✓ perissodactylic","note":"'Perissodactyl' is the noun (an animal of the order Perissodactyla), while 'perissodactylic' is the adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":["Perissodactyla (noun: the order of odd-toed ungulates)","perissodactyl (noun: an animal belonging to the order Perissodactyla)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'perissodactylic' is a highly specialized term used in the field of zoology. It is used to describe mammals belonging to the order Perissodactyla, which are characterized by having an odd number of toes on each foot. This word is unlikely to be encountered outside of scientific or academic contexts. Understanding this term requires knowledge of biological classification systems and mammalian anatomy."},"example_sentences":[{"sentence":"The evolutionary history of perissodactylic mammals is well-documented in the fossil record.","translation":"奇蹄目哺乳類の進化の歴史は、化石記録によく記録されています。","type":"adjective","meaning_category":"奇蹄目の"},{"sentence":"Perissodactylic animals are primarily herbivores.","translation":"奇蹄目の動物は主に草食動物です。","type":"adjective","meaning_category":"奇蹄目の"}]}