{"word":"frill-barking","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(Australian slang) ostentatious; showy; pretentious.","english_definition":"(Australian slang) Ostentatiously displaying wealth or status; showy; pretentious.","examples":[{"sentence":"He's got a frill-barking new car, but he can't even drive it properly.","translation":"彼はけばけばしい新車を手に入れたが、まともに運転することさえできない。"},{"sentence":"That's a bit frill-barking for a casual dinner, don't you think?","translation":"カジュアルな夕食にしては、少し派手すぎると思わない？"}],"collocations":["frill-barking car","frill-barking clothes","frill-barking lifestyle"],"synonyms":["ostentatious","showy","flashy","gaudy","pretentious","pompous"],"antonyms":["understated","modest","simple","unassuming"]}],"etymology":{"value":"Likely derived from the 'frills' and 'barking' (noise, showing off) associated with ostentatious displays. The exact origin is unclear, but it's a colorful term used in Australian English.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfrɪlˌbɑːkɪŋ/","syllables":"frill-bark-ing"},"inflection":{"adjective_forms":{"comparative":"more frill-barking","superlative":"most frill-barking"}},"usage_notes":{"explanation":"\"Frill-barking\" is an Australian slang term primarily used to describe something or someone that is excessively showy, ostentatious, or pretentious. It often implies a negative judgment about the display of wealth or status. It is not a commonly used word outside of Australia.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She's a very frill-barking person, so she is always happy.","correct":"✓ She's a very showy/ostentatious person.","note":"\"Frill-barking\" implies a negative judgment about the display of wealth or status, not just general happiness."},{"incorrect":"✗ The frill-barking tree was beautiful.","correct":"✓ The showy/ornate tree was beautiful.","note":"\"Frill-barking\" is generally used to describe displays of wealth or status, not natural beauty."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["showy","ostentatious","flashy","pretentious","larrikin (sometimes used in conjunction with the concept of showing off)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Australian slang, very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Frill-barking\" is a relatively rare Australian slang term, meaning ostentatious or showy. It is used to describe something that is excessively flashy or pretentious, often in a negative way. Understanding this word requires familiarity with Australian slang and a nuanced understanding of how language can be used to express disapproval of certain behaviors or displays. The word is not commonly used outside of Australia, so its usage is limited to specific contexts."},"example_sentences":[{"sentence":"His frill-barking attitude didn't impress anyone at the meeting.","translation":"彼のけばけばしい態度は会議の誰にも感銘を与えなかった。","type":"adjective","meaning_category":"ostentatious"},{"sentence":"The mansion was decorated in a frill-barking style.","translation":"その邸宅はけばけばしいスタイルで装飾されていた。","type":"adjective","meaning_category":"showy"}]}