{"word":"decalcifier","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脱灰剤、石灰除去剤","english_definition":"A substance used to remove calcium or lime scale.","examples":[{"sentence":"Use a decalcifier to clean your coffee machine.","translation":"コーヒーメーカーを掃除するには脱灰剤を使用してください。"},{"sentence":"The lab uses a special decalcifier for bone samples.","translation":"研究室では、骨のサンプルに特別な脱灰剤を使用しています。"}],"collocations":["coffee machine decalcifier (コーヒーメーカー用脱灰剤)","laboratory decalcifier (実験用脱灰剤)"],"synonyms":["descaler","lime scale remover"],"antonyms":[]}],"etymology":{"value":"'de-' (除去) + 'calcify' (石灰化する) + '-ier' (名詞接尾辞)","priority":"☆☆☆"},"pronunciation":{"ipa":"/diːˈkælsɪfaɪər/","syllables":"dee-cal-si-fi-er"},"inflection":{"noun_plural":"decalcifiers"},"usage_notes":{"explanation":"A decalcifier is a chemical agent used to remove calcium deposits or lime scale from a surface or substance. It is commonly used in household appliances like coffee machines and kettles to remove mineral buildup. In laboratory settings, decalcifiers are used to prepare bone samples for microscopic examination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a decalcifier to add calcium to my bones.","correct":"✓ I used a calcium supplement to add calcium to my bones.","note":"Decalcifiers remove calcium, so they are not used to add calcium to bones. Use a calcium supplement for that purpose."}],"priority":"☆☆☆"},"related_words":{"derivatives":["decalcification (脱灰)","calcify (石灰化する)","calcium (カルシウム)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'decalcifier' is a technical term primarily used in contexts involving chemistry, cleaning, or laboratory procedures. It refers to a substance that removes calcium or lime scale. Due to its specialized usage, it is not a common word in everyday conversation but is relevant in specific fields or when dealing with mineral buildup in appliances."},"example_sentences":[{"sentence":"The plumber recommended a strong decalcifier to clear the pipes.","translation":"配管工は、パイプをきれいにするために強力な脱灰剤を推奨しました。","type":"noun","meaning_category":"石灰除去剤"},{"sentence":"This decalcifier is safe to use on stainless steel.","translation":"この脱灰剤はステンレス鋼に使用しても安全です。","type":"noun","meaning_category":"脱灰剤"},{"sentence":"Regular use of a decalcifier can extend the life of your espresso machine.","translation":"脱灰剤を定期的に使用すると、エスプレッソマシンの寿命を延ばすことができます。","type":"noun","meaning_category":"脱灰剤"}]}