{"word":"deformative","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"変形させる、変形を引き起こす、形態形成的な","english_definition":"Causing or tending to cause deformation; relating to or involved in deformation.","examples":[{"sentence":"The deformative forces acting on the rock layers are immense.","translation":"その岩層に作用する変形力は非常に大きい。"},{"sentence":"Deformative processes can alter the landscape over time.","translation":"変形過程は、時間の経過とともに景観を変化させる可能性がある。"},{"sentence":"The experiment studies the deformative effects of stress on the material.","translation":"その実験では、材料に対する応力の変形効果を研究する。"}],"collocations":["deformative force (変形力)","deformative process (変形過程)","deformative effect (変形効果)","deformative stress (変形応力)","deformative mechanism (変形機構)"],"synonyms":["distorting","molding","shaping","altering","transformative"],"antonyms":["stabilizing","preserving","maintaining"]},{"part_of_speech":"adjective","definition":"(言語学) 屈折的な、語形変化を伴う","english_definition":"(linguistics) Characterized by inflection or changes in form to indicate grammatical function.","examples":[{"sentence":"Latin is a highly deformative language.","translation":"ラテン語は高度に屈折的な言語である。"},{"sentence":"Deformative languages often have complex verb conjugations.","translation":"屈折的な言語は、複雑な動詞の活用を持つことが多い。"},{"sentence":"The deformative nature of the language allows for flexible word order.","translation":"その言語の屈折的な性質により、柔軟な語順が可能になる。"}],"collocations":["deformative language (屈折言語)","deformative inflection (屈折)"],"synonyms":["inflectional","fusional"],"antonyms":["isolating","analytic"]}],"etymology":{"value":"From \"deform\" (to distort or change the shape of) + \"-ative\" (a suffix indicating a tendency or capability).","priority":"★★☆"},"pronunciation":{"ipa":"/diˈfɔːrmətɪv/","syllables":"de-for-ma-tive"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more deformative, most deformative)."},"usage_notes":{"explanation":"The word \"deformative\" is used to describe something that causes a change in shape or form. In a physical context, it refers to forces or processes that alter the structure of an object. In linguistics, it describes languages that use inflection (changes in word form) to indicate grammatical relationships.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The deformative of the metal was caused by heat.","correct":"✓ The deformation of the metal was caused by heat.","note":"\"Deformative\" is an adjective, while \"deformation\" is the noun referring to the process or result of being deformed. Use the correct part of speech for the context."}],"priority":"★★☆"},"related_words":{"derivatives":["deform (verb)","deformation (noun)","deformed (adjective)"],"related_terms":["morphology (形態学)","inflection (屈折)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"deformative\" is a technical term often used in scientific or academic contexts. It describes something that causes deformation, which is a change in shape or form. It can also refer to languages that use inflection. Understanding this word requires a good grasp of scientific and linguistic vocabulary."},"example_sentences":[{"sentence":"The **deformative** power of glaciers can carve deep valleys.","translation":"氷河の変形力は、深い谷を刻むことができる。","type":"adjective","meaning_category":"変形させる"},{"sentence":"English is less **deformative** than Latin.","translation":"英語はラテン語よりも屈折的ではない。","type":"adjective","meaning_category":"屈折的な"}]}