{"word":"outwiggle","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人を)よりうまくくねらせる、(人を)よりうまく揺らす、(人を)揺さぶりで出し抜く","english_definition":"To wiggle better or more than someone else; to surpass in wiggling. To outmaneuver or trick someone through wiggling or similar movements.","examples":[{"sentence":"She tried to outwiggle her opponent in the dance competition.","translation":"彼女はダンスコンテストで対戦相手よりも上手く体をくねらせようとした。"},{"sentence":"The worm outwiggled the fisherman's fingers and escaped.","translation":"その虫は釣り人の指を揺さぶりで出し抜き、逃げ出した。"}],"collocations":["outwiggle an opponent","outwiggle one's way out of a situation"],"synonyms":["outmaneuver","outsmart","surpass in wiggling"],"antonyms":["be worse at wiggling","be outwiggled"]}],"etymology":{"value":"Formed by combining the prefix \"out-\" (meaning to surpass or exceed) with the verb \"wiggle\" (meaning to move with short, irregular, quick movements from side to side).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊtˈwɪɡəl/","syllables":"out-wig-gle"},"inflection":{"verb_forms":{"present_simple":["outwiggle","outwiggles"],"past_simple":"outwiggled","past_participle":"outwiggled","present_participle":"outwiggling"}},"usage_notes":{"explanation":"\"Outwiggle\" is a relatively rare and somewhat humorous verb. It implies not just wiggling, but wiggling more effectively or successfully than someone else, often to gain an advantage or escape a situation. It can be used literally (in the context of a physical contest) or figuratively (to describe someone cleverly avoiding a problem).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The snake outwiggled from the box.","correct":"✓ The snake wiggled out of the box.","note":"\"Outwiggle\" implies a comparison or competition. If there's no opponent or context of surpassing, use \"wiggle\" instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["outwiggled","outwiggling"],"related":["wiggle","wiggling","wiggler"]},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Outwiggle\" is an uncommon and somewhat playful verb. It means to wiggle better than someone else, either literally or figuratively. Because it's not a standard word, understanding requires a good grasp of the prefix \"out-\" and the base verb \"wiggle.\" It's primarily used in creative or humorous contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The dancer tried to outwiggle the robot on stage.","translation":"ダンサーは舞台でロボットよりも上手く体をくねらせようとした。","type":"verb","meaning_category":"Surpassing in wiggling"},{"sentence":"He managed to outwiggle the security guards by slipping through the crowd.","translation":"彼は群衆の中をすり抜けることで、警備員を揺さぶりで出し抜くことに成功した。","type":"verb","meaning_category":"Outmaneuvering"}]}