{"word":"flane","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にフランス語圏)都市を気ままに歩き回る人、特に観察者として","english_definition":"(chiefly in French-speaking contexts) a lounger or stroller; a person who wanders about aimlessly but enjoyably, observing society and urban life.","examples":[{"sentence":"He fancied himself a flane, observing the city's inhabitants with detached amusement.","translation":"彼は気取り屋の都会の遊歩者として、都会の住民を冷静に面白がって観察していた。"},{"sentence":"The flane's perspective is essential to understanding the nuances of urban culture.","translation":"都会の文化のニュアンスを理解するには、都会の遊歩者の視点が不可欠である。"}],"collocations":["urban flane (都会の遊歩者)","modern flane (現代の遊歩者)"],"synonyms":["stroller","lounger","observer","wanderer","loafer"],"antonyms":[]}],"etymology":{"value":"フランス語の「flâneur」から。これは「flâner」（ぶらつく、気ままに歩く）という動詞に由来する。さらに遡ると、古ノルド語の「flana」（うろつく）に関連がある。19世紀のパリで、都市生活を観察し、批評する文学的な人物像として発展した。","priority":"★★☆"},"pronunciation":{"ipa":"/flɑːn/","syllables":"flane (1 syllable)"},"inflection":{"notes":"複数形は通常「flanes」ですが、フランス語の複数形「flâneurs」も使われることがあります。"},"usage_notes":{"explanation":"「**flane**」は、都市を目的もなく歩き回り、周囲の社会や文化を観察する人を指す、主にフランス語圏の概念です。単なる散歩者ではなく、都市生活の観察者、批評家としての意味合いが強いです。この言葉は、19世紀のパリで、都市化が進む社会を観察する文学的な人物像として生まれました。現代では、都市文化や社会学の研究において、特定の視点を持つ観察者を指す言葉として使われることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a flane in the countryside.","correct":"✓ He is a flane in the city.","note":"「flane」は都市環境を歩き回る人を指すため、田舎では使いません。"},{"incorrect":"✗ She is a flane because she is lost.","correct":"✓ She is a flane because she enjoys observing urban life.","note":"「flane」は目的もなく歩き回りますが、迷子になっているわけではありません。都市生活を観察することを楽しんでいます。"}],"priority":"★★☆"},"related_words":{"derivatives":["flânerie (名詞: 気ままな散歩、遊歩)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (特定の分野でのみ使用される専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 一般的な語彙ではない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**flane**」は、都市を気ままに歩き回り、周囲の社会や文化を観察する人を指す、フランス語由来の言葉です。単なる散歩者ではなく、都市生活の観察者、批評家としての意味合いが強い、やや専門的な言葉です。都市文化や社会学の研究で使われることがあります。日常会話ではあまり使われません。"},"example_sentences":[{"sentence":"The writer saw himself as a modern flane, documenting the changing face of the city.","translation":"その作家は、都市の変わりゆく姿を記録する現代の遊歩者であると自認していた。","type":"noun","meaning_category":"都市を気ままに歩き回る人"},{"sentence":"The flane's detached perspective allows for a unique understanding of urban dynamics.","translation":"遊歩者の客観的な視点は、都市のダイナミズムを独自に理解することを可能にする。","type":"noun","meaning_category":"都市を気ままに歩き回る人"}]}