{"word":"Deuteronomistic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"申命記的な、申命記史観の","english_definition":"Relating to or characteristic of the Deuteronomic history or theology.","examples":[{"sentence":"The Deuteronomistic Historian is believed to have compiled several books of the Old Testament.","translation":"申命記史家は旧約聖書のいくつかの書を編纂したと考えられている。"},{"sentence":"Deuteronomistic theology emphasizes obedience to God's laws and the consequences of disobedience.","translation":"申命記史観の神学は、神の律法への従順と不従順の結果を強調する。"}],"collocations":["Deuteronomistic History","Deuteronomistic Code","Deuteronomistic theology"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'Deuteronomy' (申命記) and the suffix '-istic', indicating a relationship or characteristic.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdjuːtərəˌnɒmɪˈstɪk/","syllables":"Du-ter-o-no-mis-tic"},"inflection":{},"usage_notes":{"explanation":"'Deuteronomistic' is primarily used in biblical studies and theology to describe aspects related to the book of Deuteronomy and the Deuteronomistic History (Deuteronomy, Joshua, Judges, Samuel, and Kings). It often refers to a specific theological perspective emphasizing covenant, law, and the consequences of obedience or disobedience to God.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Deuteronomy","Deuteronomist"],"related_terms":["Pentateuch","Torah","Biblical criticism"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'Deuteronomistic' is highly specialized and primarily used within academic and theological contexts. Understanding requires familiarity with biblical studies and theological terminology. The concept involves complex historical and theological interpretations of the Old Testament."},"example_sentences":[{"sentence":"Scholars debate the extent of the Deuteronomistic influence on the book of Kings.","translation":"学者たちは列王記に対する申命記的な影響の範囲について議論している。","type":"general","meaning_category":"relating to Deuteronomistic history"},{"sentence":"The Deuteronomistic perspective is evident in the emphasis on centralized worship in Jerusalem.","translation":"申命記的な視点は、エルサレムにおける中央集権的な礼拝の強調に明らかである。","type":"general","meaning_category":"relating to Deuteronomistic history"}]}