{"word":"Poetdom","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"詩人の世界、詩の世界、詩人の地位、詩人の領土","english_definition":"The realm or world of poets; the state or position of a poet; the territory or domain of a poet.","examples":[{"sentence":"He immersed himself in the poetdom of classical literature.","translation":"彼は古典文学の詩の世界に没頭した。"},{"sentence":"She aspired to achieve recognition in the poetdom.","translation":"彼女は詩人の世界で認められることを熱望した。"},{"sentence":"The poetdom of Shakespeare is vast and influential.","translation":"シェイクスピアの詩の世界は広大で影響力がある。"}],"collocations":["enter the poetdom","explore the poetdom","master the poetdom","the poetdom of Shakespeare","the poetdom of Romanticism"],"synonyms":["poetry world","verse realm","poetic sphere","lyrical domain"],"antonyms":["prose world","scientific domain"]}],"etymology":{"value":"Formed from 'poet' (from Old French 'poete', from Latin 'poeta', from Greek 'poētēs' meaning 'maker, author, poet') + '-dom' (suffix denoting a state, condition, or dominion).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpoʊɪtdəm/","syllables":"po-et-dom"},"inflection":{"noun_plural":"poetdoms"},"usage_notes":{"explanation":"'Poetdom' is a relatively rare and somewhat formal word. It refers to the collective world of poets, their works, and their influence. It can also refer to the status or position of being a poet. It is often used in literary criticism or discussions about poetry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a great poetdom.","correct":"✓ He is a great poet.","note":"'Poetdom' is a realm or state, not a person. Use 'poet' to refer to a person who writes poetry."},{"incorrect":"✗ The poetdom is writing a new poem.","correct":"✓ The poet is writing a new poem.","note":"'Poetdom' refers to the collective world or state, not an individual. Use 'poet' to refer to the individual writing."}],"priority":"★★☆"},"related_words":{"derivatives":["poet (noun: 詩人)","poetry (noun: 詩)","poetic (adjective: 詩的な)","poetically (adverb: 詩的に)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'poetdom' is a relatively uncommon term used to describe the world or realm of poets and poetry. It is often used in academic or literary contexts to discuss the collective influence, status, or domain of poets and their works. Because of its relative rarity, it is more likely to be encountered in advanced reading materials. It is important to understand that it refers to the collective sphere of poets rather than an individual poet."},"example_sentences":[{"sentence":"The young writer sought to find his place within the established poetdom.","translation":"その若い作家は、確立された詩の世界で自分の居場所を見つけようとした。","type":"noun","meaning_category":"詩人の世界"},{"sentence":"Her work explored the themes of love and loss within the vast poetdom of Romantic literature.","translation":"彼女の作品は、ロマン派文学の広大な詩の世界における愛と喪失のテーマを探求した。","type":"noun","meaning_category":"詩の世界"},{"sentence":"He felt a sense of belonging in the poetdom, surrounded by others who shared his passion for verse.","translation":"彼は、詩への情熱を共有する人々に囲まれ、詩の世界に属しているという感覚を覚えた。","type":"noun","meaning_category":"詩人の世界"}]}