{"word":"turf-laid","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"覆土された、芝が張られた","english_definition":"Covered with turf; having turf laid upon it.","examples":[{"sentence":"The newly turf-laid garden looked lush and green.","translation":"新たに芝が張られた庭は、青々として生い茂っているように見えた。"},{"sentence":"The turf-laid area provided a soft surface for the children to play on.","translation":"芝が張られた場所は、子供たちが遊ぶのに柔らかい表面を提供した。"}],"collocations":["newly turf-laid","freshly turf-laid","turf-laid garden","turf-laid area"],"synonyms":["grassed","sodded","lawned"],"antonyms":["bare","uncovered","unturfed"]}],"etymology":{"value":"The word is a compound of 'turf' (grass and the soil beneath it held together by its roots) and 'laid' (past participle of 'lay', meaning to place or put something down).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɜːrfˌleɪd/","syllables":"turf-laid"},"inflection":{"notes":"This is an adjective and does not have plural forms."},"usage_notes":{"explanation":"'Turf-laid' describes something that has had turf (sections of grass-covered soil) placed on it. It is commonly used to describe gardens, lawns, or other areas where grass is being established. The term implies a deliberate action of covering an area with turf for aesthetic or functional purposes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The turf-laid was beautiful.","correct":"✓ The turf-laid area was beautiful.","note":"'Turf-laid' is an adjective, so it needs to modify a noun. Using it as a noun is incorrect."},{"incorrect":"✗ The garden is turf laid.","correct":"✓ The garden is turf-laid.","note":"The correct form is 'turf-laid' as a compound adjective, not separate words."}],"priority":"★★☆"},"related_words":{"derivatives":["turf (noun)","lay (verb)","turfing (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Turf-laid' is a relatively uncommon adjective used to describe an area that has been covered with turf, which is grass and the soil attached to its roots. This term is most often encountered in contexts related to gardening, landscaping, or construction where the establishment of a lawn or grassy area is involved. Understanding this word requires familiarity with the concept of 'turf' and its application in creating green spaces."},"example_sentences":[{"sentence":"The golf course featured meticulously turf-laid greens.","translation":"そのゴルフコースは、細心の注意を払って芝が張られたグリーンが特徴だった。","type":"adjective","meaning_category":"description"},{"sentence":"After the construction, the builders ensured the area was turf-laid to restore the landscape.","translation":"建設後、建設業者たちは景観を復元するために、その地域に芝を張ることを徹底した。","type":"adjective","meaning_category":"restoration"}]}