{"word":"poloconic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(化学)ポロコニックな：複数の異なる繰り返し単位（通常は疎水性と親水性の両方）を含むポリマーの性質を表す。","english_definition":"(chemistry) Describing a polymer that contains multiple distinct repeating units, typically with both hydrophobic and hydrophilic characteristics.","examples":[{"sentence":"The poloconic copolymer exhibited excellent self-assembling properties in aqueous solution.","translation":"そのポロコニック共重合体は、水溶液中で優れた自己組織化特性を示した。"},{"sentence":"Poloconic surfactants are used in a variety of applications, including drug delivery and enhanced oil recovery.","translation":"ポロコニック界面活性剤は、薬物送達や石油増進回収など、さまざまな用途で使用されている。"}],"collocations":["poloconic copolymer","poloconic surfactant","poloconic structure","poloconic properties"],"synonyms":["amphiphilic","block copolymer","multi-block copolymer"],"antonyms":[]}],"etymology":{"value":"The term \"poloconic\" is derived from the combination of \"poly-\" (meaning many), and \"conic\" (referring to the cone-like shape that these molecules can form when self-assembling).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒləˈkɒnɪk/","syllables":"po-lo-con-ic"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"\"Poloconic\" is a relatively specialized term used in polymer chemistry and materials science. It describes polymers with a specific architecture that leads to interesting self-assembly behavior. These polymers often have both hydrophobic and hydrophilic segments, allowing them to form micelles, vesicles, and other structures in solution.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["polocon (noun, short for poloconic polymer)"],"related_terms":["polymer","copolymer","surfactant","self-assembly","micelle","hydrophobic","hydrophilic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Poloconic\" is a technical term primarily used in chemistry and materials science. It describes a type of polymer with multiple distinct repeating units, often with both hydrophobic (water-repelling) and hydrophilic (water-attracting) properties. These polymers are of interest due to their ability to self-assemble into complex structures in solution. Understanding this term requires a background in polymer chemistry."},"example_sentences":[{"sentence":"The synthesis of novel poloconic materials is crucial for developing advanced drug delivery systems.","translation":"新規なポロコニック材料の合成は、高度な薬物送達システムを開発するために重要である。","type":"adjective","meaning_category":"Describing a polymer with multiple repeating units"},{"sentence":"The researchers investigated the self-assembly behavior of a series of poloconic block copolymers.","translation":"研究者らは、一連のポロコニックブロック共重合体の自己組織化挙動を調査した。","type":"adjective","meaning_category":"Describing a polymer with multiple repeating units"}]}