{"word":"snufflingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"鼻をすする音を立てて、鼻をすすりながら","english_definition":"In a manner characterized by snuffling; with a snuffling sound.","examples":[{"sentence":"He spoke snufflingly, trying to hold back tears.","translation":"彼は鼻をすすりながら、涙をこらえようとして話した。"},{"sentence":"She walked away snufflingly, her nose red from the cold.","translation":"彼女は鼻をすすりながら歩き去った、寒さで鼻が赤くなっていた。"}],"collocations":[],"synonyms":["sniffingly","nasally"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'snuffle' (to draw air audibly up the nose) with the addition of the adverbial suffix '-ingly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsnʌflɪŋli/","syllables":"snuf-fling-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Snufflingly' describes the manner in which someone speaks or behaves when they are snuffling, typically due to a cold, allergies, or emotional distress. It emphasizes the audible drawing of air through the nose.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["snuffle (verb, noun)","snuffling (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Very rare, not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Snufflingly' is a relatively rare adverb describing an action performed while snuffling. It is most likely to be encountered in descriptive writing where the author aims to convey a specific sound and emotional state. Due to its specificity, it is not a common word in everyday conversation or general texts."},"example_sentences":[{"sentence":"The child, recovering from a cold, spoke snufflingly to his mother.","translation":"風邪から回復中の子供は、鼻をすすりながら母親に話しかけた。","type":"adverb","meaning_category":"鼻をすする音を立てて"},{"sentence":"He apologized snufflingly, clearly embarrassed by his outburst.","translation":"彼は鼻をすすりながら謝罪した、明らかに感情の爆発を恥じていた。","type":"adverb","meaning_category":"鼻をすすりながら"}]}