{"word":"vulturism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ハゲタカのような行為、強欲な搾取、他人の不幸につけ込む行為","english_definition":"behavior resembling that of a vulture, especially preying on the vulnerable or profiting from others' misfortunes; rapacious exploitation.","examples":[{"sentence":"The media's vulturism in covering the tragedy was widely criticized.","translation":"その悲劇を報道するメディアのハゲタカのような行為は広く批判された。"},{"sentence":"His vulturism in buying up distressed properties earned him many enemies.","translation":"困窮した不動産を買い占める彼の強欲な搾取は、多くの敵を作った。"},{"sentence":"Some saw the company's actions as mere vulturism, taking advantage of the smaller business's financial woes.","translation":"その会社の行動を、小規模企業の財政難につけ込んだ単なるハゲタカ行為だと見る者もいた。"}],"collocations":["media vulturism (メディアのハゲタカ行為)","financial vulturism (金融におけるハゲタカ行為)","corporate vulturism (企業のハゲタカ行為)","political vulturism (政治的なハゲタカ行為)"],"synonyms":["opportunism","predation","exploitation","parasitism","profiteering","rapacity","avarice"],"antonyms":["altruism","benevolence","charity","compassion","generosity","humanitarianism"]}],"etymology":{"value":"\"Vulturism\" derives from \"vulture,\" referring to the scavenging bird. The suffix \"-ism\" is added to denote a behavior, practice, or system resembling the characteristics of vultures, particularly their opportunistic and predatory feeding habits.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvʌltʃərɪzəm/","syllables":"vul-tur-ism"},"inflection":{"noun_plural":"vulturisms (rarely used)"},"usage_notes":{"explanation":"\"Vulturism\" describes actions that are seen as predatory, opportunistic, and exploitative, especially when they involve profiting from the misfortune or vulnerability of others. It often carries a strong negative connotation, implying a lack of empathy or ethical considerations. The term is frequently used in contexts such as media coverage of tragedies, financial dealings involving distressed assets, and political maneuvering. While the literal reference is to the scavenging behavior of vultures, the term is primarily used metaphorically to critique human behavior.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The vulturism was very kind.","correct":"✓ The vulturism was very cruel.","note":"Vulturism implies negative behavior, so it is inconsistent to describe it as kind. Use adjectives like 'cruel,' 'exploitative,' or 'opportunistic' instead."},{"incorrect":"✗ He showed vulturism to the poor.","correct":"✓ He showed vulturistic behavior to the poor.","note":"While 'vulturism' is the noun, 'vulturistic' can be used as an adjective to describe behavior. Alternatively, rephrase to use 'vulturism' as the subject: 'His vulturism targeted the poor.'"}]},"related_words":{"derivatives":["vulture (noun: ハゲタカ)","vulturistic (adjective: ハゲタカのような、強欲な)"],"related_concepts":["predatory lending (高利貸し)","disaster capitalism (災害資本主義)","ambulance chasing (不当な訴訟を誘発する行為)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Vulturism\" is a relatively uncommon term that describes exploitative and opportunistic behavior, particularly when someone profits from the misfortune of others. It's a metaphor derived from the scavenging habits of vultures. The term is typically used in critical contexts to condemn actions that lack empathy and ethical considerations. Understanding this word requires a good grasp of abstract concepts and metaphorical language."},"example_sentences":[{"sentence":"The politician was accused of **vulturism** for exploiting the crisis to gain support.","translation":"その政治家は、支持を得るために危機を利用したとして、ハゲタカのような行為だと非難された。","type":"noun","meaning_category":"強欲な搾取"},{"sentence":"Some investors engage in financial **vulturism**, buying up distressed debt at bargain prices.","translation":"一部の投資家は、金融におけるハゲタカ行為に従事し、不良債権を破格の値段で買い占める。","type":"noun","meaning_category":"強欲な搾取"},{"sentence":"The media's **vulturism** in sensationalizing the tragedy was widely condemned.","translation":"その悲劇をセンセーショナルに報道するメディアのハゲタカのような行為は広く非難された。","type":"noun","meaning_category":"他人の不幸につけ込む行為"}]}