{"word":"Pictorialism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ピクトリアリスム：19世紀末から20世紀初頭にかけて流行した写真芸術運動。絵画的な美しさを追求し、写真独自の表現を確立しようとした。","english_definition":"An international style and aesthetic movement that flourished in the late 19th and early 20th centuries, characterized by photographs that emulate painting and drawing through soft focus, manipulation of the print, and artistic subject matter.","examples":[{"sentence":"Pictorialism aimed to elevate photography to the status of fine art.","translation":"ピクトリアリスムは、写真をファインアートの地位に高めることを目指した。"},{"sentence":"Many pictorialist photographers used techniques such as gum bichromate printing to achieve painterly effects.","translation":"多くのピクトリアリスムの写真家は、絵画的な効果を得るために、ゴム印画法などの技法を用いた。"},{"sentence":"The Photo-Secession group, led by Alfred Stieglitz, was a prominent force in promoting Pictorialism in America.","translation":"アルフレッド・スティーグリッツが率いるフォト・セセッションは、アメリカでピクトリアリスムを推進する上で重要な勢力だった。"}],"collocations":["Pictorialist photographer (ピクトリアリスムの写真家)","Pictorialist style (ピクトリアリスムのスタイル)","Gum bichromate printing (ゴム印画法)","Photo-Secession (フォト・セセッション)","Soft focus (ソフトフォーカス)"],"synonyms":["art photography","artistic photography","aesthetic photography"],"antonyms":["straight photography","documentary photography"]}],"etymology":{"value":"The term 'Pictorialism' derives from 'pictorial,' meaning relating to or characteristic of painting or drawing. The suffix '-ism' indicates a style, movement, or principle.","priority":"★★☆"},"pronunciation":{"ipa":"/pɪkˈtɔːriəlɪzəm/","syllables":"pic-to-ri-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Pictorialism is a specific movement in the history of photography. It's important to distinguish it from general 'art photography,' as Pictorialism has particular characteristics and historical context. The movement emphasized the photographer's artistic vision and control over the final image, often through manipulation in the darkroom or during the printing process.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Pictorialism is the same as any artistic photograph.","correct":"✓ Pictorialism is a specific movement of artistic photography with distinct characteristics.","note":"Pictorialism is a specific movement, not just any artistic photograph. It has historical context and stylistic traits. "},{"incorrect":"✗ Pictorialism focuses on capturing reality objectively.","correct":"✓ Pictorialism focuses on subjective artistic expression and interpretation of reality.","note":"Pictorialism is characterized by artistic manipulation and subjective interpretation, not objective reality."}],"priority":"★★☆"},"related_words":{"derivatives":["pictorial (adjective: 絵画的な、図解の)","pictorially (adverb: 絵画的に、図解で)"],"phrasal_verbs":null,"priority":"★☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency. Specialized term in art history and photography.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pictorialism' is a specialized term related to the history of photography and art. It refers to a specific movement that aimed to make photographs look more like paintings. Understanding this term requires some knowledge of art history and photographic techniques. The key characteristics are the use of soft focus, manipulation of the printing process, and a focus on artistic subject matter rather than objective documentation."},"example_sentences":[{"sentence":"Early examples of Pictorialism often featured soft focus and romantic themes.","translation":"ピクトリアリスムの初期の例は、しばしばソフトフォーカスとロマンチックなテーマを特徴としていた。","type":"noun","meaning_category":"definition"},{"sentence":"Alfred Stieglitz was a leading figure in the Pictorialism movement.","translation":"アルフレッド・スティーグリッツは、ピクトリアリスム運動の指導的人物だった。","type":"noun","meaning_category":"definition"},{"sentence":"Pictorialism was eventually superseded by more modern photographic styles.","translation":"ピクトリアリスムは最終的に、より現代的な写真スタイルに取って代わられた。","type":"noun","meaning_category":"definition"}]}