{"word":"parapeito","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"手すり、欄干、胸壁","english_definition":"A low protective wall along the edge of a balcony, roof, bridge, or other structure.","examples":[{"sentence":"O parapeito da varanda era feito de ferro forjado.","translation":"The balcony's parapet was made of wrought iron."},{"sentence":"Ela se apoiou no parapeito e admirou a vista.","translation":"She leaned on the parapet and admired the view."},{"sentence":"O castelo tinha um alto parapeito para proteger os defensores.","translation":"The castle had a high parapet to protect the defenders."}],"collocations":["parapeito da varanda (balcony parapet)","apoiar-se no parapeito (to lean on the parapet)","parapeito de proteção (protective parapet)"],"synonyms":["balaustrada","guarda-corpo","muralha"],"antonyms":[]}],"etymology":{"value":"Originates from the verb 'parar' (to stop, to ward off) and 'peito' (chest), indicating something that stops or protects up to chest height.","priority":"★★☆"},"pronunciation":{"ipa":"/paɾaˈpejtu/","syllables":"pa-ra-pei-to"},"inflection":{"noun_plural":"parapeitos"},"usage_notes":{"explanation":"'Parapeito' refers to a low wall that serves as a protective barrier. It is commonly found on balconies, bridges, and roofs. It can also refer to the breastwork of a fortification.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"O parapeito estava muito baixo e perigoso.","correct":"O parapeito era muito baixo e perigoso.","note":"Use the correct verb tense to describe the state of the parapet."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["varanda (balcony)","muralha (wall)","ponte (bridge)","telhado (roof)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively common, especially in architectural and construction contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Parapeito' is a noun that refers to a low wall or barrier, typically found on balconies, bridges, or roofs. It's a common architectural feature designed for safety and protection.","priority":"★★☆"},"example_sentences":[{"sentence":"As crianças brincavam perto do parapeito da ponte.","translation":"The children were playing near the parapet of the bridge.","type":"example","meaning_category":"general"},{"sentence":"O parapeito impedia que as pessoas caíssem do terraço.","translation":"The parapet prevented people from falling off the terrace.","type":"example","meaning_category":"protection"},{"sentence":"O arquiteto projetou um parapeito moderno para o edifício.","translation":"The architect designed a modern parapet for the building.","type":"example","meaning_category":"architecture"}]}