{"word":"Remigrant","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"帰還移民、帰国者","english_definition":"A person who returns to live in their country of origin or former residence.","examples":[{"sentence":"The government offered incentives to remigrants to help rebuild the economy.","translation":"政府は経済再建を支援するため、帰還移民に奨励金を提供した。"},{"sentence":"Remigrants often bring new skills and perspectives that can benefit their home country.","translation":"帰還移民は、母国に役立つ新しいスキルや視点をもたらすことが多い。"}],"collocations":["returning remigrant","successful remigrant","skilled remigrant","encourage remigrants","support remigrants"],"synonyms":["returnee","repatriate","return migrant"],"antonyms":["emigrant","immigrant","expat"],"notes":"Often used in discussions about economic development and social reintegration."}],"etymology":{"value":"Formed from 're-' (again) + 'migrant' (a person who moves from one place to another).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈriːmaɪɡrənt/","syllables":"Ree-mi-grant"},"inflection":{"noun_plural":"Remigrants"},"usage_notes":{"explanation":"'Remigrant' specifically refers to someone who was an emigrant (left their country) and is now returning to live there. It is not simply someone who is migrating within a country.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a remigrant from Tokyo to Osaka.","correct":"✓ He is a migrant from Tokyo to Osaka.","note":"'Remigrant' implies a return to one's country of origin, not just any migration."},{"incorrect":"✗ She is an immigrant, not a remigrant.","correct":"✓ She is an immigrant, not a remigrant.","note":"'Immigrant' is someone who comes to live permanently in a foreign country, while 'remigrant' is someone who returns to their home country."}],"priority":"★★☆"},"related_words":{"derivatives":["remigrate (verb)","remigration (noun)"],"phrasal_verbs":[],"related_concepts":["brain drain","diaspora","repatriation","reverse migration"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'remigrant' is a relatively uncommon term used to describe someone who has emigrated from their country and is now returning to live there. It is often used in academic or formal contexts when discussing migration patterns and the impact of returning citizens on a country's economy and society. The term implies a cyclical movement of people, distinguishing it from simple immigration or emigration."},"example_sentences":[{"sentence":"The government hopes that the new policies will attract remigrants with valuable skills.","translation":"政府は、新しい政策が貴重なスキルを持つ帰還移民を引きつけることを期待している。","type":"general","meaning_category":"General Use"},{"sentence":"Many remigrants face challenges in reintegrating into their home country after years abroad.","translation":"多くの帰還移民は、海外で長年過ごした後、母国への再統合に苦労している。","type":"general","meaning_category":"Challenges of Remigration"},{"sentence":"The remigrant community has formed support groups to help newcomers adjust to life back home.","translation":"帰還移民コミュニティは、新しく帰国した人々が帰国後の生活に慣れるのを支援するためのサポートグループを設立した。","type":"community","meaning_category":"Community Support"}]}