{"word":"bickerer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"口論する人、言い争う人、些細なことで喧嘩する人","english_definition":"a person who engages in petty arguments or quarrels; someone who bickers.","examples":[{"sentence":"The couple were constant bickerers, always arguing over the smallest things.","translation":"その夫婦はいつも些細なことで言い争っていて、絶え間ない口論者だった。"},{"sentence":"He's such a bickerer; it's exhausting to be around him.","translation":"彼は本当に口論好きで、彼の周りにいると疲れる。"},{"sentence":"Don't be a bickerer; try to find common ground instead of arguing.","translation":"口論ばかりしないで、議論する代わりに共通点を見つけよう。"}],"collocations":["constant bickerer (絶え間ない口論者)","petty bickerer (些細なことで口論する人)","family of bickerers (口論好きな家族)"],"synonyms":["quarreler","arguer","disputant","wrangler","scrapper","contender"],"antonyms":["peacemaker","harmonizer","conciliator","mediator"]}],"etymology":{"value":"The word 'bickerer' is derived from the verb 'to bicker,' which comes from Middle English 'bikeren,' meaning 'to skirmish, quarrel.' The suffix '-er' is added to denote a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɪkərər/","syllables":"bik-er-er"},"inflection":{"noun_plural":"bickerers"},"usage_notes":{"explanation":"'Bickerer' specifically refers to someone who habitually engages in petty, often trivial, arguments. It implies a tendency to argue over small or unimportant matters, rather than serious or significant issues. The term often carries a negative connotation, suggesting that the person is annoying or difficult to deal with because of their argumentative nature.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a bicker.","correct":"✓ He is a bickerer.","note":"'Bicker' is a verb or a noun referring to the act of arguing. 'Bickerer' is the noun for the person who argues."},{"incorrect":"✗ She is a big bickerer.","correct":"✓ She is a frequent bickerer. / ✓ She is a constant bickerer.","note":"Use adjectives like 'frequent' or 'constant' to describe the degree of bickering, not 'big'."}],"priority":"★★☆"},"related_words":{"derivatives":["bicker (verb: to argue or quarrel about petty matters; noun: a petty argument or quarrel)","bickering (noun: petty arguing or quarreling)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - The word 'bickerer' is not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bickerer' is a noun that describes someone who often argues about small, unimportant things. It's not a very common word, but it's useful for describing someone who is always complaining or disagreeing over trivial matters. It suggests that the person enjoys arguing or is easily annoyed by minor things. You might use this word to describe a character in a story or to describe someone you know who is always arguing with others.","priority":"★★☆"},"example_sentences":[{"sentence":"The two roommates were constant bickerers, always fighting over whose turn it was to do the dishes.","translation":"その二人のルームメイトはいつも口論ばかりしていて、皿洗いをするのは誰の番かでいつも喧嘩していた。","type":"noun","meaning_category":"口論する人"},{"sentence":"She didn't want to be seen as a bickerer, so she tried to avoid arguing with her colleagues.","translation":"彼女は口論好きだと思われたくなかったので、同僚との議論を避けるようにした。","type":"noun","meaning_category":"口論する人"},{"sentence":"The committee was full of bickerers, making it difficult to reach any decisions.","translation":"委員会は口論好きな人ばかりで、なかなか決定を下すことができなかった。","type":"noun","meaning_category":"口論する人"}]}