{"word":"meristems","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(植物) 成長点","english_definition":"A region of plant tissue, found chiefly at the growing tips of roots and shoots and in the cambium, consisting of actively dividing cells forming new tissue.","examples":[{"sentence":"Meristems are responsible for plant growth.","translation":"成長点は植物の成長を担っている。"},{"sentence":"Apical meristems are located at the tips of roots and shoots.","translation":"頂端成長点は根と芽の先端に位置する。"}],"collocations":["apical meristem (頂端成長点)","lateral meristem (側生成長点)","root apical meristem (根端成長点)","shoot apical meristem (茎頂成長点)","vascular cambium (維管束形成層)","cork cambium (コルク形成層)"],"synonyms":["growing point","cambium","formative tissue"],"antonyms":["differentiated tissue","mature tissue"]}],"etymology":{"value":"Derived from the Greek word 'meristos' meaning 'divisible', referring to the actively dividing cells in these tissues.","priority":"★★★"},"pronunciation":{"ipa":"ˈmɛrɪˌstɛmz","syllables":"mer-i-stems"},"inflection":{"noun_plural":"meristems"},"usage_notes":{"explanation":"'Meristems' refers specifically to the plant tissue responsible for growth. They are areas of undifferentiated cells that can divide and differentiate into various plant tissues. There are different types of meristems, each with a specific location and function.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The meristem is mature tissue.","correct":"✓ The meristem is undifferentiated tissue.","note":"Meristems are characterized by undifferentiated cells, unlike mature tissues which have specialized functions."}],"priority":"★★☆"},"related_words":{"derivatives":["meristematic (adjective: relating to or composed of meristematic tissue)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in botany and plant biology contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Meristems' are specialized plant tissues where active cell division occurs, enabling plant growth. These tissues are found in areas like root and shoot tips. The term is primarily used in botany and plant science. Understanding meristems is crucial for comprehending plant development and tissue differentiation."},"example_sentences":[{"sentence":"The plant's height increased due to the activity of the apical meristems.","translation":"植物の高さは、頂端成長点の活動によって増加した。","type":"noun","meaning_category":"plant growth"},{"sentence":"Lateral meristems contribute to the widening of the plant stem.","translation":"側生成長点は、植物の茎の幅を広げることに貢献する。","type":"noun","meaning_category":"plant growth"},{"sentence":"Understanding meristems is essential for plant propagation and tissue culture.","translation":"成長点を理解することは、植物の繁殖と組織培養に不可欠である。","type":"noun","meaning_category":"plant biology"}]}