{"word":"monophyly","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"単系統（ある祖先とその全ての子孫を含む分類群であること）","english_definition":"the condition of a taxon being a clade, i.e., a group of organisms that consists of all the descendants of a common ancestor.","examples":[{"sentence":"The goal of systematics is to discover monophyletic groups.","translation":"系統学の目標は、単系統群を発見することです。"},{"sentence":"Monophyly is a desirable property for taxonomic groups.","translation":"単系統性は、分類群にとって望ましい性質です。"}],"collocations":["monophyletic group","test of monophyly","evidence for monophyly"],"synonyms":["clade","holophyly"],"antonyms":["polyphyly","paraphyly"]}],"etymology":{"value":"Derived from the Greek words 'monos' (μόνος) meaning 'single, alone' and 'phylon' (φῦλον) meaning 'tribe, race'.","priority":"★★★"},"pronunciation":{"ipa":"/məˈnɒfɪli/","syllables":"mo-no-phy-ly"},"inflection":{"noun_plural":"monophylies"},"usage_notes":{"explanation":"Monophyly is a fundamental concept in cladistics and phylogenetic systematics. A monophyletic group, also known as a clade, includes an ancestor and all of its descendants. This is in contrast to paraphyletic groups, which include an ancestor and some, but not all, of its descendants, and polyphyletic groups, which include organisms from multiple evolutionary lineages but not their common ancestor. The determination of monophyly relies on phylogenetic analysis using shared derived characters (synapomorphies).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Monophyly means that the group shares similar characteristics.","correct":"✓ Monophyly means that the group includes a common ancestor and all of its descendants.","note":"Monophyly is defined by common ancestry, not necessarily by shared characteristics, although shared derived characteristics (synapomorphies) are used to infer common ancestry."},{"incorrect":"✗ A species can be monophyletic.","correct":"✓ A group of species can be monophyletic.","note":"Monophyly applies to groups of organisms (taxa) rather than individual species. While a species can be part of a monophyletic group, the term itself describes the relationship among multiple species."}],"priority":"★★☆"},"related_words":{"derivatives":["monophyletic (adjective)"],"related_terms":["paraphyly","polyphyly","phylogeny","cladistics","taxonomy","systematics"],"priority":"★★★"},"level_frequency":{"level":"Specialized scientific vocabulary","frequency_google_ngram":"Low frequency. Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monophyly' is a technical term used in biology, specifically in the fields of systematics and evolutionary biology. It describes a group of organisms that includes a common ancestor and all of its descendants. Understanding this term requires familiarity with basic concepts of phylogenetic trees and evolutionary relationships. The opposite of monophyly includes paraphyly (where some descendants are excluded) and polyphyly (where the group does not share a single common ancestor)."},"example_sentences":[{"sentence":"Phylogenetic analyses confirmed the monophyly of the genus *Homo*.","translation":"系統解析により、ホモ属の単系統性が確認された。","type":"scientific","meaning_category":"taxonomy"},{"sentence":"Establishing the monophyly of a group is crucial for understanding its evolutionary history.","translation":"あるグループの単系統性を確立することは、その進化の歴史を理解するために重要である。","type":"scientific","meaning_category":"evolution"},{"sentence":"The study used molecular data to test the monophyly of the insect order.","translation":"その研究では、分子データを用いて昆虫目の単系統性を検証した。","type":"scientific","meaning_category":"genetics"}]}