{"word":"Frogfishes","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Plural form of frogfish. Frogfishes are any members of the anglerfish family Antennariidae, of the order Lophiiformes. They are known as anglerfishes because of their use of an illicium and esca to lure prey.","english_definition":"Plural of frogfish: Any members of the anglerfish family Antennariidae, of the order Lophiiformes. They are known as anglerfishes because of their use of an illicium and esca to lure prey.","examples":[{"sentence":"Frogfishes are masters of camouflage, blending seamlessly with their surroundings.","translation":"カエルアンコウ類はカモフラージュの達人であり、周囲の環境にシームレスに溶け込む。"},{"sentence":"Some frogfishes can change color to match their environment.","translation":"一部のカエルアンコウ類は、環境に合わせて色を変えることができる。"}],"collocations":["anglerfish family","marine fish","camouflage","lure prey"],"synonyms":["anglerfishes","Antennariidae"],"antonyms":[]}],"etymology":{"value":"From 'frog' (referring to their frog-like appearance) + 'fishes' (plural of fish).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfrɒɡˌfɪʃɪz/","syllables":"frog-fish-es"},"inflection":{"noun_plural":"Frogfishes"},"usage_notes":{"explanation":"'Frogfishes' is the plural form of 'frogfish,' referring to multiple fish of the family Antennariidae. They are known for their unique appearance and hunting techniques.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ frogfishs","correct":"✓ frogfishes","note":"The plural of frogfish is frogfishes, not frogfishs."}],"priority":"★★☆"},"related_words":{"derivatives":["frogfish","anglerfish","Antennariidae","illicium","esca"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Frogfishes' refers to a specific group of marine fish known for their camouflage and predatory behavior. Understanding this term requires some familiarity with marine biology and fish classification.","note":"This word is not commonly used in everyday language and is more likely to appear in scientific or specialized contexts."},"example_sentences":[{"sentence":"Divers often seek out frogfishes due to their unusual appearance.","translation":"ダイバーは、カエルアンコウ類の珍しい外見から、よく探し求める。","type":"noun","meaning_category":"marine biology"},{"sentence":"Frogfishes use a lure to attract smaller fish.","translation":"カエルアンコウ類は、ルアーを使ってより小さな魚を引き寄せる。","type":"noun","meaning_category":"marine biology"}]}