{"word":"elbower","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(まれ)ひじで押しのける人、ひじを使って進む人","english_definition":"(rare) A person who uses their elbows to push their way through a crowd or to gain an advantage.","examples":[{"sentence":"He was such an elbower that he managed to get to the front of the line.","translation":"彼はとてもひじで押しのける人だったので、列の先頭にたどり着くことができた。"},{"sentence":"Don't be an elbower; wait your turn.","translation":"ひじで押しのけないで、順番を待ちましょう。"}],"collocations":["pushy elbower","aggressive elbower"],"synonyms":["pusher","shover"],"antonyms":["patient person","courteous person"]},{"part_of_speech":"noun","definition":"(比喩的に)競争の激しい人、野心家","english_definition":"(figuratively) A highly competitive or ambitious person who disregards the feelings of others in order to succeed.","examples":[{"sentence":"In the corporate world, she was known as a ruthless elbower.","translation":"企業の世界では、彼女は冷酷な野心家として知られていた。"},{"sentence":"He's a real elbower, always trying to get ahead at any cost.","translation":"彼は本当に競争の激しい人で、常にどんな犠牲を払っても出世しようとしている。"}],"collocations":["ruthless elbower","ambitious elbower"],"synonyms":["go-getter","careerist","opportunist"],"antonyms":["team player","collaborator"]}],"etymology":{"value":"Derived from the word 'elbow' (the joint between the upper and lower arm) and the suffix '-er' (denoting a person who does something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈelboʊər/","syllables":"el-bow-er"},"inflection":{"noun_plural":"elbowers"},"usage_notes":{"explanation":"The word 'elbower' is relatively rare and somewhat informal. It describes someone who is either physically pushing their way through a crowd using their elbows or, more often, someone who is aggressively ambitious and willing to step on others to achieve their goals. The figurative meaning is more common than the literal one.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She elbowered her way to the front.","correct":"✓ She elbowed her way to the front.","note":"'Elbowered' is the past tense of the verb 'elbow', meaning to push with one's elbow. 'Elbower' is a noun referring to the person who does the elbowing."}],"priority":"★★☆"},"related_words":{"derivatives":["elbow (noun, verb)","elbowing (noun)"],"related_terms":["pushy","aggressive","ambitious","competitive"]},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Elbower' is a relatively uncommon word, mostly used figuratively to describe someone who is overly ambitious and willing to disregard others to achieve their goals. It implies a forceful and somewhat aggressive approach to competition. Understanding the word requires a grasp of the figurative use of language and an understanding of social dynamics related to ambition and competition."},"example_sentences":[{"sentence":"The concert was so crowded that you had to be an **elbower** to get near the stage.","translation":"コンサートはとても混んでいたので、ステージに近づくにはひじで押しのける人になる必要があった。","type":"noun","meaning_category":"physical pushing"},{"sentence":"He's a notorious **elbower** in the office, always trying to take credit for other people's work.","translation":"彼はオフィスでは悪名高い野心家で、常に他人の手柄を横取りしようとしている。","type":"noun","meaning_category":"figurative (ambitious)"}]}