{"word":"dissettlement","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)財産権の取り消し、権利剥奪、または財産処分の無効化","english_definition":"The act of unsettling or displacing; the undoing of a settlement, especially in a legal or proprietary context.","examples":[{"sentence":"The dissettlement of the estate led to years of legal battles.","translation":"その財産の権利剥奪は、長年の法廷闘争につながった。"},{"sentence":"The government's policy resulted in the dissettlement of many families.","translation":"政府の政策は、多くの家族の移住という結果になった。"}],"collocations":["dissettlement of property","dissettlement of an estate","cause dissettlement","legal dissettlement"],"synonyms":["displacement","unsettlement","dispossession","eviction","ousting","deprivation"],"antonyms":["settlement","establishment","arrangement","agreement","resolution"]},{"part_of_speech":"noun","definition":"(社会・精神的な)不安定化、混乱、動揺","english_definition":"A state of being unsettled or disturbed, either socially, emotionally, or mentally.","examples":[{"sentence":"The rapid changes in technology caused dissettlement among the workforce.","translation":"技術の急速な変化は、労働者の間に不安定感を引き起こした。"},{"sentence":"The constant political upheaval led to a general sense of dissettlement in the country.","translation":"絶え間ない政治的混乱は、国全体に不安定感をもたらした。"}],"collocations":["social dissettlement","emotional dissettlement","cause dissettlement","sense of dissettlement","general dissettlement"],"synonyms":["instability","disruption","turmoil","unease","anxiety","restlessness","disquiet"],"antonyms":["stability","peace","tranquility","contentment"]}],"etymology":{"value":"The word 'dissettlement' is formed by adding the prefix 'dis-' (meaning 'not' or 'opposite of') to the word 'settlement'. 'Settlement' itself comes from the verb 'to settle', which has roots in Old English and Proto-Germanic, originally meaning to make stable or secure. Therefore, 'dissettlement' literally means the opposite of settling, indicating a state of being unsettled or the act of undoing a settlement.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈsɛtəlmənt/","syllables":"dis-set-tle-ment"},"inflection":{"noun_plural":"dissettlements"},"usage_notes":{"explanation":"'Dissettlement' is a relatively uncommon word, often used in legal, historical, or sociological contexts. It refers to the process or state of being unsettled, displaced, or having a previous settlement or arrangement undone. It can apply to physical displacement (e.g., from land or property) or to more abstract forms of instability and disruption. The word carries a negative connotation, implying a loss of stability, security, or established rights.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The dissettlement of the argument led to a better understanding.","correct":"The resolution of the argument led to a better understanding.","note":"'Dissettlement' implies a negative disruption, not a positive resolution. Use 'resolution' or 'settlement' in the context of resolving an argument."},{"incorrect":"The family experienced dissettlement after moving into their new home.","correct":"The family experienced unsettlement after moving into their new home.","note":"'Dissettlement' is stronger and suggests a more formal or legal undoing of a settlement. 'Unsettlement' is more appropriate for general feelings of unease or adjustment after a move."}],"priority":"★★☆"},"related_words":{"derivatives":["dissettle (verb): to unsettle or displace","unsettlement (noun): a state of being unsettled or disturbed","settlement (noun): an agreement, arrangement, or established situation"],"antonyms":["settlement (noun): an agreement, arrangement, or established situation","establishment (noun): the act of establishing or setting up","stabilization (noun): the act of making something stable"],"related_concepts":["eviction","displacement","land rights","property law","social disruption","political instability"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dissettlement' is a formal and relatively rare term. It generally refers to the undoing of a settlement or established arrangement, often in a legal or social context. This can involve the loss of property, rights, or stability. The word implies a disruption and a negative impact on those affected. It is not commonly used in everyday conversation and is more likely to appear in academic or legal texts."},"example_sentences":[{"sentence":"The government's land reform policies led to the dissettlement of many indigenous communities.","translation":"政府の土地改革政策は、多くの先住民族コミュニティの権利剥奪につながった。","type":"noun","meaning_category":"legal/proprietary"},{"sentence":"The economic crisis caused widespread dissettlement and anxiety among the population.","translation":"経済危機は、国民の間に広範な不安定感と不安を引き起こした。","type":"noun","meaning_category":"social/emotional"},{"sentence":"The dissettlement of the will was challenged in court by the beneficiaries.","translation":"遺言の無効化は、受益者によって法廷で争われた。","type":"noun","meaning_category":"legal/proprietary"}]}