{"word":"men-of-the-earth","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(聖書)その土地の有力者たち、地元の有力者たち","english_definition":"(Biblical) The prominent or influential people of a land or region.","examples":[{"sentence":"The men-of-the-earth came to pay homage to the new king.","translation":"その土地の有力者たちは、新しい王に敬意を払うためにやってきた。"},{"sentence":"He consulted with the men-of-the-earth before making his decision.","translation":"彼は決定を下す前に、地元の有力者たちと相談した。"}],"collocations":["the men-of-the-earth gathered","the men-of-the-earth consulted"],"synonyms":["local leaders","influential people","prominent citizens"],"antonyms":["common people","ordinary citizens"]}],"etymology":{"value":"This phrase is derived from biblical texts, often referring to those who held power or influence within a particular region.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmen əv ðɪ ˈɜːθ/","syllables":"men-of-the-earth"},"inflection":{"noun_plural":"N/A (already plural)"},"usage_notes":{"explanation":"The term 'men-of-the-earth' is primarily used in a biblical or historical context to describe individuals who held significant social, economic, or political power within a specific geographic area. It is not commonly used in modern English.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a men-of-the-earth.","correct":"✓ He is one of the men-of-the-earth.","note":"The phrase is plural, so it requires a plural construction."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'men-of-the-earth' is a specialized phrase primarily found in biblical and historical texts. It refers to influential or powerful individuals within a specific region. Due to its limited usage and specific context, it is not commonly encountered in general English conversation or writing."},"example_sentences":[{"sentence":"The chronicles tell of how the men-of-the-earth pledged their allegiance to the conquering empire.","translation":"年代記には、その土地の有力者たちが征服帝国に忠誠を誓った経緯が記されている。","type":"noun","meaning_category":"influential people"},{"sentence":"In ancient times, the men-of-the-earth often controlled the local economy and resources.","translation":"古代において、その土地の有力者たちはしばしば地元の経済と資源を支配していた。","type":"noun","meaning_category":"influential people"}]}