{"word":"effusiometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"エフュージオメーター：気体の流出速度を測定する装置","english_definition":"An instrument for measuring the rate of effusion of a gas.","examples":[{"sentence":"The scientist used an effusiometer to determine the molar mass of the unknown gas.","translation":"科学者は未知の気体のモル質量を決定するためにエフュージオメーターを使用した。"}],"collocations":["use an effusiometer","calibrate an effusiometer","effusion rate measurement"],"synonyms":["Graham's law apparatus"],"antonyms":[]}],"etymology":{"value":"The word \"effusiometer\" is derived from \"effusion\" (the process of a gas escaping through a small hole) and \"-meter\" (an instrument for measuring).","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌfjuːziˈɒmɪtər/","syllables":"ef-fu-si-o-me-ter"},"inflection":{"noun_plural":"effusiometers"},"usage_notes":{"explanation":"An effusiometer is a specialized scientific instrument primarily used in chemistry and physics to measure the rate at which a gas escapes through a small opening into a vacuum. This measurement is crucial for determining properties of the gas, such as its molar mass, using Graham's Law of Effusion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The effusiometer measures gas density directly.","correct":"✓ The effusiometer measures the rate of effusion, which can be used to calculate gas density.","note":"Effusiometers measure the rate of effusion, not density directly. Density can be calculated from the effusion rate using Graham's Law."}],"priority":"★☆☆"},"related_words":{"derivatives":["effusion","effuse"],"related_terms":["Graham's Law","molar mass","gas","vacuum","diffusion"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'effusiometer' is a technical term used in chemistry and physics. It refers to a device used to measure the rate at which a gas escapes through a small hole. Understanding this term requires knowledge of gas behavior and related scientific principles. It is not commonly used outside of specialized scientific contexts."},"example_sentences":[{"sentence":"The laboratory's effusiometer was essential for conducting experiments on gas diffusion.","translation":"その研究所のエフュージオメーターは、気体拡散に関する実験を行う上で不可欠だった。","type":"example","meaning_category":"general"},{"sentence":"By using the effusiometer, researchers could verify Graham's Law of Effusion with different gases.","translation":"研究者たちはエフュージオメーターを使用することで、異なる気体を用いてグレアムの法則を検証することができた。","type":"example","meaning_category":"application"}]}