{"word":"maxillomandibular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"上顎下顎の、上顎と下顎に関する","english_definition":"Relating to both the maxilla (upper jaw) and the mandible (lower jaw).","examples":[{"sentence":"The patient underwent maxillomandibular fixation after the accident.","translation":"患者は事故後、上顎下顎固定術を受けた。"},{"sentence":"Maxillomandibular advancement can improve breathing in some patients with sleep apnea.","translation":"上顎下顎前方移動術は、睡眠時無呼吸症候群の一部の患者の呼吸を改善することができる。"}],"collocations":["maxillomandibular fixation (上顎下顎固定)","maxillomandibular advancement (上顎下顎前方移動術)","maxillomandibular surgery (上顎下顎手術)"],"synonyms":["craniofacial","oromaxillary"],"antonyms":[]}],"etymology":{"value":"Derived from 'maxilla' (upper jaw) and 'mandible' (lower jaw), combining their meanings.","priority":"★★★"},"pronunciation":{"ipa":"/mækˌsɪloʊmænˈdɪbjʊlər/","syllables":"max-il-lo-man-dib-u-lar"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'maxillomandibular' is primarily used in medical and dental contexts to describe procedures, conditions, or anatomical relationships involving both the upper and lower jaws. It is a technical term and not commonly used in everyday conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor examined the maxillomandibular but found nothing wrong.","correct":"✓ The doctor examined the maxillomandibular region but found nothing wrong.","note":"'Maxillomandibular' is an adjective and needs to modify a noun, such as 'region', 'area', or 'joint'."}],"priority":"★★☆"},"related_words":{"derivatives":["maxilla (上顎)","mandible (下顎)"],"related_terms":["orthognathic surgery (顎矯正手術)","craniofacial surgery (頭蓋顔面外科手術)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in specialized medical and dental literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Maxillomandibular' is a highly specialized term used in the fields of medicine and dentistry. It describes anything that relates to both the upper (maxilla) and lower (mandible) jaws. Due to its technical nature, it is not commonly encountered outside of professional or academic contexts related to these fields."},"example_sentences":[{"sentence":"The maxillomandibular complex plays a crucial role in facial aesthetics and function.","translation":"上顎下顎複合体は、顔面の美観と機能において重要な役割を果たします。","type":"general","meaning_category":"anatomy"},{"sentence":"He required maxillomandibular reconstruction following a severe injury.","translation":"彼は重傷を負った後、上顎下顎再建術を必要とした。","type":"medical","meaning_category":"surgery"}]}