{"word":"Cyprinidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"コイ科","english_definition":"The carp family, a family of freshwater fish, including carps, minnows, barbels, and related species.","examples":[{"sentence":"The Cyprinidae are the largest family of freshwater fishes.","translation":"コイ科は淡水魚の中で最大の科です。"},{"sentence":"Many species of Cyprinidae are popular in aquariums.","translation":"コイ科の多くの種は水族館で人気があります。"}],"collocations":["Cyprinidae family","Cyprinidae species","freshwater Cyprinidae"],"synonyms":["carp family"],"antonyms":[]}],"etymology":{"value":"From Latin Cyprinus (carp) + -idae (suffix used to form family names in biological classification).","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˈprɪnɪdiː/","syllables":"cy-prin-i-dae"},"inflection":{"noun_plural":"Cyprinidae (科名のため、複数形は通常使用されません)"},"usage_notes":{"explanation":"'Cyprinidae' is a scientific term used in biology to refer to the family of fish that includes carps, minnows, and related species. It is typically used in scientific contexts, such as research papers or educational materials.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Cyprinidaes are a big family.","correct":"✓ Cyprinidae is a big family.","note":"Cyprinidae is already a plural form representing the family, so adding an additional 's' is incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["Cyprinus (genus of carp)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cyprinidae' is a technical term used in the field of zoology and ichthyology. It refers specifically to the biological family of carp and minnow-like fishes. Understanding this term requires a background in biology or a specific interest in fish taxonomy. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The study focused on the genetic diversity within the Cyprinidae.","translation":"その研究はコイ科内の遺伝的多様性に焦点を当てた。","type":"noun","meaning_category":"コイ科"},{"sentence":"Several invasive species from the Cyprinidae family have impacted local ecosystems.","translation":"コイ科のいくつかの侵略的外来種が地域の生態系に影響を与えている。","type":"noun","meaning_category":"コイ科"}]}