{"word":"Angrist","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"ジョシュア・アングリスト：イスラエル生まれのアメリカ人経済学者。労働経済学、都市経済学、教育経済学の分野で著名。2021年にノーベル経済学賞を受賞。","english_definition":"Joshua Angrist: An Israeli-American economist known for his work in labor economics, urban economics, and the economics of education. He was awarded the Nobel Memorial Prize in Economic Sciences in 2021.","examples":[{"sentence":"Angrist's research focuses on the causal effects of education and labor market policies.","translation":"アングリストの研究は、教育と労働市場政策の因果効果に焦点を当てている。"},{"sentence":"The Nobel Prize was awarded to Angrist and his colleagues for their methodological contributions to the analysis of causal relationships.","translation":"ノーベル賞は、因果関係の分析への方法論的貢献に対して、アングリストと彼の同僚に授与された。"}],"collocations":["Joshua Angrist","Nobel Prize","labor economics","causal inference","instrumental variables"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"姓。起源は不明。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈæŋɡrɪst/","syllables":"An-grist"},"inflection":{},"usage_notes":{"explanation":"ジョシュア・アングリストは、経済学における因果推論の分野で大きな貢献をしたことで知られています。特に、操作変数法（Instrumental Variables）などの手法を用いて、政策や介入の効果を厳密に評価する研究を行っています。彼の研究は、教育政策、労働市場、都市経済など、幅広い分野に影響を与えています。","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Angrist-Imbens theorem"],"related_people":["Guido Imbens","David Card"],"related_fields":["Econometrics","Labor Economics","Causal Inference"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"ジョシュア・アングリストは、経済学者であり、2021年にノーベル経済学賞を受賞しました。彼の研究は、特に因果推論の方法論に焦点を当てており、教育や労働市場などの分野における政策の効果を評価するために使用されています。彼の名前は、経済学、特に応用計量経済学の分野で頻繁に言及されます。"},"example_sentences":[{"sentence":"Professor Angrist delivered a lecture on the impact of charter schools.","translation":"アングリスト教授は、チャータースクールの影響に関する講義を行った。","type":"example","meaning_category":"Academic Research"},{"sentence":"Angrist's work has significantly influenced the field of causal inference in economics.","translation":"アングリストの研究は、経済学における因果推論の分野に大きな影響を与えている。","type":"example","meaning_category":"Influence on Economics"}]}