{"word":"fettered","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"束縛された、拘束された、足かせをはめられた","english_definition":"Restrained with fetters; confined or restricted; not free.","examples":[{"sentence":"His mind was fettered by prejudice.","translation":"彼の心は偏見によって束縛されていた。"},{"sentence":"The prisoner was fettered and led away.","translation":"囚人は足かせをはめられ、連れ去られた。"},{"sentence":"A society fettered by tradition cannot progress.","translation":"伝統に束縛された社会は進歩できない。"}],"collocations":["fettered by tradition","fettered by rules","fettered by prejudice","fettered spirit"],"synonyms":["restrained","bound","shackled","hampered","constrained","restricted","confined"],"antonyms":["free","unrestrained","unbound","liberated","unfettered"]}],"etymology":{"value":"Derived from the verb 'fetter,' which comes from Old English 'feter,' meaning 'foot chain' or 'fetter.' Related to Old High German 'fazzara' and ultimately from a Proto-Germanic root.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɛtərd/","syllables":"fet-tered"},"inflection":{"notes":"This is the past participle form of the verb 'fetter' used as an adjective."},"usage_notes":{"explanation":"'Fettered' describes a state of being physically or metaphorically bound or restrained. While it can refer to literal chains or shackles, it is often used to describe restrictions on freedom, thought, or action. It implies a lack of autonomy or the presence of inhibiting forces.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He felt fettered to go to the party.","correct":"✓ He felt fettered by his responsibilities and couldn't go to the party.","note":"'Fettered' requires a preposition like 'by' to indicate what is causing the restraint. It's not typically used with an infinitive ('to go')."},{"incorrect":"✗ The fettered bird flew away.","correct":"✓ The unfettered bird flew away.","note":"A fettered bird would not be able to fly away. 'Fettered' implies restraint, so the opposite, 'unfettered,' would be more appropriate in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["fetter (verb): to restrain with chains or shackles; to impede or restrict.","fetters (noun): chains or shackles used to restrain a prisoner; anything that restrains or confines."],"idioms_phrases":["unfettered (adjective): not confined or restricted; free."],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in formal writing and literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fettered' is a more advanced word that describes being restrained or restricted, either physically with chains or metaphorically, such as being limited by rules or beliefs. It's not a common word in everyday conversation, but you might encounter it in literature, historical contexts, or discussions about freedom and limitations. It implies a significant lack of freedom or autonomy."},"example_sentences":[{"sentence":"The country's press was fettered by censorship laws.","translation":"その国の報道機関は検閲法によって束縛されていた。","type":"adjective","meaning_category":"束縛された (metaphorical)"},{"sentence":"The slaves were fettered with heavy chains.","translation":"奴隷たちは重い鎖で拘束されていた。","type":"adjective","meaning_category":"拘束された (physical)"},{"sentence":"She felt fettered by her family's expectations.","translation":"彼女は家族の期待に束縛されていると感じていた。","type":"adjective","meaning_category":"束縛された (metaphorical)"}]}