{"word":"Homolosine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学)ホモロサイン図法","english_definition":"(cartography) An equal-area composite map projection first proposed by Paul Goode in 1923, created by combining the Mollweide projection and the Sinusoidal projection.","examples":[{"sentence":"The Homolosine projection is often used for world maps showing area accurately.","translation":"ホモロサイン図法は、面積を正確に示す世界地図によく使用されます。"}],"collocations":["Goode homolosine projection","equal-area projection","world map"],"synonyms":["Goode interrupted projection"],"antonyms":[]}],"etymology":{"value":"Derived from a combination of 'homo-' (meaning 'same' or 'equal'), referring to equal area, and 'sinusoidal', one of the projections used in its creation.","priority":"★★★"},"pronunciation":{"ipa":"/hoʊˈmɒləˌsiːn/","syllables":"ho-mo-lo-sine"},"inflection":{},"usage_notes":{"explanation":"The Homolosine projection is a composite map projection, meaning it combines the properties of two different projections to minimize distortion. It's an equal-area projection, which means that it accurately represents the relative sizes of areas on the map, although it does distort shapes. It is often used for thematic maps where accurate area representation is important.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Mollweide projection","Sinusoidal projection","Goode projection"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The Homolosine projection is a complex cartographic concept primarily used in specialized fields like geography and cartography. Understanding it requires familiarity with different types of map projections and their properties, such as equal-area projections. It's not typically encountered in general contexts.","priority":"★★★"},"example_sentences":[{"sentence":"The Goode **Homolosine** projection is a type of pseudocylindrical, equal-area, composite map projection.","translation":"グードのホモロサイン図法は、擬円筒、正積、複合地図投影法の一種です。","type":"noun","meaning_category":"map projection"}]}