{"word":"disemic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"二つの意味を持つ、二重の意味を持つ","english_definition":"Having two meanings; double-meaning.","examples":[{"sentence":"The word 'bank' is disemic, as it can refer to a financial institution or the side of a river.","translation":"「bank」という言葉は、金融機関または川岸を指すため、二重の意味を持ちます。"},{"sentence":"The politician's statement was deliberately disemic, allowing for multiple interpretations.","translation":"政治家の声明は意図的に二重の意味を持たせており、複数の解釈が可能です。"}],"collocations":["disemic word","disemic statement","disemic phrase"],"synonyms":["ambiguous","equivocal","polysemous"],"antonyms":["monosemic","unambiguous","unequivocal"]}],"etymology":{"value":"Derived from the prefix 'di-' (meaning two) and 'semic' (relating to meaning).","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈsiːmɪk/","syllables":"di-se-mic"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used for 'disemic'."},"usage_notes":{"explanation":"'Disemic' is a relatively rare term, primarily used in linguistics and semantics to describe words or phrases that possess two distinct meanings. It is often used to analyze language where ambiguity or multiple interpretations are possible.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The disemic of the word made it difficult to understand.","correct":"✓ The disemy of the word made it difficult to understand.","note":"The correct noun form is 'disemy,' not 'disemic.'"},{"incorrect":"✗ The sentence was disemically interpreted.","correct":"✓ The sentence was interpreted disemically.","note":"'Disemically' is the adverbial form, though it is rarely used. It should modify the verb directly."}],"priority":"★☆☆"},"related_words":{"derivatives":["disemy (noun: the state of having two meanings)"],"phrases":["double entendre (a phrase or saying with two meanings, one of which is usually sexually suggestive)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Disemic' is a specialized term used in linguistics to describe words or phrases that have two distinct meanings. It is not commonly used in everyday language. Understanding this term requires familiarity with semantic analysis and linguistic theory."},"example_sentences":[{"sentence":"The linguist analyzed the disemic nature of the phrase.","translation":"言語学者はその句の二重の意味の性質を分析した。","type":"general","meaning_category":"linguistics"},{"sentence":"The author used disemic language to create layers of meaning in the text.","translation":"著者はテキストに意味の層を作るために二重の意味を持つ言葉を使用した。","type":"literature","meaning_category":"literature"}]}