{"word":"conventionalisation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"慣習化、因習化、定型化","english_definition":"The process by which something becomes conventional or standard; the act of making something conform to accepted practices or norms.","examples":[{"sentence":"The conventionalisation of language can lead to a loss of creativity.","translation":"言語の慣習化は創造性の喪失につながる可能性がある。"},{"sentence":"The conventionalisation of scientific methods ensures consistency in research.","translation":"科学的方法の慣習化は研究の一貫性を保証する。"},{"sentence":"The conventionalisation of certain gestures varies across cultures.","translation":"特定のジェスチャーの慣習化は文化によって異なる。"}],"collocations":["language conventionalisation (言語の慣習化)","social conventionalisation (社会的な慣習化)","cultural conventionalisation (文化的な慣習化)","process of conventionalisation (慣習化の過程)"],"synonyms":["standardisation","formalisation","routinisation","institutionalisation","codification"],"antonyms":["deconventionalisation","innovation","deviation","unorthodoxy"]}],"etymology":{"value":"The word 'conventionalisation' is derived from 'conventionalize', which comes from 'conventional' (adjective) + '-ize' (verb-forming suffix). 'Conventional' comes from 'convention', which ultimately derives from the Latin 'convenire' (to come together, agree).","priority":"★★★"},"pronunciation":{"ipa":"/kənˌvenʃənəlaɪˈzeɪʃən/","syllables":"con-ven-tion-al-i-sa-tion"},"inflection":{"noun_plural":"conventionalisations"},"usage_notes":{"explanation":"'Conventionalisation' refers to the process of something becoming conventional, meaning it conforms to established norms, customs, or practices. It often implies a transition from something novel or unique to something standardized and widely accepted. This term is frequently used in discussions about language, social behavior, and cultural practices. It can also refer to the act of making something conventional, such as when a new technology or practice is intentionally standardized.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The conventionalisation of the art was very bad.","correct":"✓ The conventionalisation of art can stifle creativity.","note":"The sentence should reflect the common understanding that over-conventionalisation might limit creativity rather than simply being 'bad'."},{"incorrect":"✗ Conventionalisation is good in all situations.","correct":"✓ Conventionalisation can be beneficial for consistency, but it can also limit innovation.","note":"The revised sentence acknowledges both the positive and negative aspects of conventionalisation."}],"priority":"★★☆"},"related_words":{"derivatives":["conventionalize (verb)","conventional (adjective)","convention (noun)","conventionality (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Conventionalisation' is a complex term that describes the process by which something becomes standard or accepted. It is often used in academic or formal contexts to discuss how practices, ideas, or behaviors become normalized over time. Understanding this word requires a good grasp of abstract concepts and the ability to analyze how social norms develop. It's not a word commonly used in everyday conversation, but it is important for understanding discussions about social and cultural change."},"example_sentences":[{"sentence":"The conventionalisation of the handshake as a greeting is a relatively recent phenomenon.","translation":"握手が挨拶として慣習化されたのは比較的最近の現象である。","type":"general","meaning_category":"general"},{"sentence":"The conventionalisation of certain file formats has made data sharing easier.","translation":"特定のファイル形式の慣習化により、データ共有が容易になった。","type":"technical","meaning_category":"technical"},{"sentence":"The study examines the conventionalisation of gender roles in advertising.","translation":"その研究は広告におけるジェンダー役割の慣習化を検証する。","type":"academic","meaning_category":"academic"}]}