{"word":"pearloyster","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"真珠貝","english_definition":"A bivalve mollusk of the family Pteriidae, several species of which produce pearls of commercial value.","examples":[{"sentence":"The diver searched the seabed for pearloysters.","translation":"ダイバーは海底で真珠貝を探した。"},{"sentence":"Pearloysters are cultivated in many parts of the world for pearl production.","translation":"真珠貝は真珠生産のために世界の多くの地域で養殖されている。"}],"collocations":["pearl oyster farm","pearl oyster shell","harvest pearloysters"],"synonyms":["pearl mussel","Pinctada"],"antonyms":[]},{"part_of_speech":"noun","definition":"(比喩的に)貴重なもの、価値あるものの源泉","english_definition":"(figuratively) A source of something valuable or precious.","examples":[{"sentence":"The library is a pearloyster of knowledge for the community.","translation":"図書館は地域社会にとって知識の真珠貝（貴重な源泉）である。"}],"collocations":["a pearloyster of wisdom","a pearloyster of opportunity"],"synonyms":["treasure trove","goldmine","source of wealth"],"antonyms":[]}],"etymology":{"value":"From 'pearl' + 'oyster'. The term combines the valuable product (pearl) with the type of shellfish that produces it (oyster).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɜːrlˌɔɪstər/","syllables":"pearl-oys-ter"},"inflection":{"noun_plural":"pearloysters"},"usage_notes":{"explanation":"'Pearloyster' specifically refers to the bivalve mollusks that produce commercially valuable pearls, mainly belonging to the Pteriidae family, especially the genus Pinctada. It is often used in contexts related to pearl farming, diving, and the pearl industry. Figuratively, it can represent a source of great value or richness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a pearl in an oyster.","correct":"✓ I found a pearl in a pearloyster.","note":"While pearls can occasionally be found in common oysters, the term 'pearloyster' specifically denotes the species known for pearl production."}],"priority":"★★☆"},"related_words":{"derivatives":["pearl","oyster","pearl farming","pearl diving"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pearloyster' is a compound noun that refers specifically to the type of oyster known for producing pearls. It is most often used in contexts relating to marine biology, pearl farming, or the jewelry industry. The figurative use of 'pearloyster' is less common but implies a rich source of valuable things. Understanding the specific biological reference is key to using the term accurately."},"example_sentences":[{"sentence":"The divers carefully collected the pearloysters from the ocean floor.","translation":"ダイバーたちは海底から慎重に真珠貝を収集した。","type":"noun","meaning_category":"Marine Biology"},{"sentence":"The cultured pearloysters produced high-quality pearls.","translation":"養殖された真珠貝は高品質の真珠を生産した。","type":"noun","meaning_category":"Pearl Farming"},{"sentence":"The museum displayed a rare collection of natural pearloysters.","translation":"博物館は天然の真珠貝の珍しいコレクションを展示した。","type":"noun","meaning_category":"Marine Biology"},{"sentence":"The university's research lab is a pearloyster of innovation in marine technology.","translation":"その大学の研究室は海洋技術における革新の真珠貝（源泉）である。","type":"noun","meaning_category":"Figurative"}]}