{"word":"undiscouragingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"落胆させずに、がっかりさせないように、意気消沈させないように","english_definition":"In a way that does not discourage or dishearten.","examples":[{"sentence":"She spoke undiscouragingly about the challenges ahead, focusing on the opportunities.","translation":"彼女は、今後の課題について、機会に焦点を当てて、落胆させることなく話しました。"},{"sentence":"The coach undiscouragingly reminded the team of their potential, even after a tough loss.","translation":"コーチは、厳しい敗北の後でも、チームの潜在能力を意気消沈させないように思い出させました。"}],"collocations":["speak undiscouragingly","remind undiscouragingly","act undiscouragingly"],"synonyms":["encouragingly","supportively","positively","optimistically"],"antonyms":["discouragingly","pessimistically","negatively"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'discouragingly'. 'Discouragingly' is formed from 'discourage' + '-ing' + '-ly'. 'Discourage' comes from Old French 'descoragier', meaning 'to deprive of courage'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪˈskʌrɪdʒɪŋli/","syllables":"un-dis-cour-ag-ing-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Undiscouragingly' is used to describe actions or manners that avoid causing someone to lose confidence or enthusiasm. It implies a supportive and positive approach, even when dealing with difficult or challenging situations. It is the opposite of 'discouragingly', which means in a way that causes someone to lose confidence or enthusiasm.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He undiscouragingly told her she was doing a bad job.","correct":"✓ He encouragingly told her how she could improve. / ✓ He told her in an undiscouraging way that she needed to improve.","note":"'Undiscouragingly' means 'in a way that does not discourage'. Therefore, it cannot be used to describe someone telling someone they are doing a bad job. Instead, rephrase to show encouragement or use a different construction."}],"priority":"★★☆"},"related_words":{"derivatives":["discourage (verb)","discouraging (adjective)","discouragement (noun)","encouragingly (adverb)","encourage (verb)","encouragement (noun)","undiscouraged (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'undiscouragingly' is a relatively uncommon adverb that means 'in a way that does not discourage'. It is formed by adding the prefix 'un-' to 'discouragingly', which is derived from the verb 'discourage'. Understanding the meaning of 'discourage' and the function of the prefix 'un-' is essential to comprehending the meaning of 'undiscouragingly'. This word is typically used in formal or written contexts to describe actions or speech that aim to maintain someone's confidence or enthusiasm despite challenges or setbacks."},"example_sentences":[{"sentence":"The teacher undiscouragingly guided the student through the difficult problem.","translation":"先生は生徒を落胆させずに、難しい問題を指導しました。","type":"general","meaning_category":"general"},{"sentence":"She undiscouragingly presented the project's shortcomings, emphasizing potential solutions.","translation":"彼女はプロジェクトの欠点を、潜在的な解決策を強調して、意気消沈させないように発表しました。","type":"general","meaning_category":"general"}]}