{"word":"examination-in-chief","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(法廷における)主尋問","english_definition":"(in law) the first questioning of a witness by the party on whose behalf the witness is called.","examples":[{"sentence":"The lawyer began the examination-in-chief of the key witness.","translation":"弁護士は、重要証人の主尋問を開始した。"},{"sentence":"During the examination-in-chief, the witness recounted the events of that night.","translation":"主尋問の間、証人はその夜の出来事を語った。"}],"collocations":["conduct an examination-in-chief (主尋問を行う)","lead an examination-in-chief (主尋問を主導する)","begin the examination-in-chief (主尋問を開始する)","undergo examination-in-chief (主尋問を受ける)"],"synonyms":["direct examination"],"antonyms":["cross-examination","re-examination"]}],"etymology":{"value":"A combination of 'examination', 'in', and 'chief', reflecting the primary or main examination of a witness.","priority":"★★★"},"pronunciation":{"ipa":"/ɪɡˌzæmɪˈneɪʃən ɪn ˈtʃiːf/","syllables":"ex-am-i-na-tion in chief"},"inflection":{"notes":"Plural: examinations-in-chief"},"usage_notes":{"explanation":"'Examination-in-chief' refers to the initial questioning of a witness by the party who called that witness to testify. The purpose is to elicit facts supporting the party's case. Leading questions (questions that suggest the answer) are generally not allowed during examination-in-chief, as the witness is expected to provide their own account.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The lawyer cross-examined his own witness in the examination-in-chief.","correct":"✓ The lawyer conducted the examination-in-chief of his own witness.","note":"Cross-examination is done by the opposing party, not the party who called the witness. Examination-in-chief is conducted by the party who called the witness."},{"incorrect":"✗ The examination-in-chief allowed leading questions.","correct":"✓ The examination-in-chief generally does not allow leading questions.","note":"Leading questions are typically prohibited during examination-in-chief."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["cross-examination (反対尋問)","re-examination (再尋問)","witness (証人)","testimony (証言)","evidence (証拠)","leading question (誘導尋問)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Examination-in-chief' is a legal term that refers to the initial questioning of a witness by the lawyer who called that witness to testify. It is a formal process in court aimed at eliciting facts that support the lawyer's case. The lawyer must avoid asking leading questions, which suggest the answer to the witness. This term is mainly used in legal settings and may not be familiar to the general public."},"example_sentences":[{"sentence":"The prosecutor began the examination-in-chief by asking the witness to describe what they saw.","translation":"検察官は、証人に何を見たかを説明させることから主尋問を始めた。","type":"noun","meaning_category":"主尋問"},{"sentence":"The defense attorney carefully prepared the witness for the examination-in-chief.","translation":"弁護人は、主尋問のために証人を注意深く準備した。","type":"noun","meaning_category":"主尋問"}]}