{"word":"Stylidium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"スティリディウム属：オーストラリアを中心に分布する、小さな草本植物の属。柱頭が特徴的で、昆虫に花粉を付着させるメカニズムを持つ。","english_definition":"A genus of small herbs found mainly in Australia, characterized by a sensitive trigger mechanism that deposits pollen on visiting insects.","examples":[{"sentence":"Stylidium is known for its unique pollination mechanism.","translation":"スティリディウム属は、その独特な受粉メカニズムで知られています。"},{"sentence":"Many species of Stylidium are endemic to Western Australia.","translation":"スティリディウム属の多くの種は、西オーストラリア固有のものです。"}],"collocations":["Stylidium flower (スティリディウムの花)","Stylidium pollination (スティリディウムの受粉)","Stylidium species (スティリディウムの種)"],"synonyms":["triggerplant"],"antonyms":[]}],"etymology":{"value":"新ラテン語の植物学名。'stylus'（ラテン語で「柱」の意）+ '-idium'（指小辞）に由来し、花の柱頭の形状にちなむ。","priority":"★★☆"},"pronunciation":{"ipa":"/staɪˈlɪdiəm/","syllables":"Sty-li-di-um"},"inflection":{"noun_plural":"Stylidiums or Stylidia"},"usage_notes":{"explanation":"'Stylidium' は植物学の専門用語であり、一般的にはあまり使われません。植物学や園芸の分野で、特定の植物について議論する際に使用されます。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Stylidium in my garden, it was very tall.","correct":"✓ I saw a Stylidium in my garden, it was very interesting.","note":"Stylidium species are typically small herbs, not tall plants. The interesting feature is their trigger mechanism."}],"priority":"★☆☆"},"related_words":{"derivatives":["Stylidiaceae (スティリディウム科)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Stylidium' is a technical term used in botany to refer to a genus of plants. It is unlikely to be encountered outside of specialized contexts related to botany, horticulture, or Australian flora. Understanding of this term requires a background in plant biology."},"example_sentences":[{"sentence":"The genus Stylidium exhibits a wide range of adaptations to nutrient-poor soils.","translation":"スティリディウム属は、栄養の乏しい土壌への幅広い適応を示しています。","type":"noun","meaning_category":"植物学"},{"sentence":"Conservation efforts are focused on protecting rare Stylidium species from habitat loss.","translation":"保全活動は、生息地の喪失から希少なスティリディウム属の種を保護することに焦点を当てています。","type":"noun","meaning_category":"植物学"}]}