{"word":"Agonistically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"闘争的に、論争的に、競争的に","english_definition":"In a manner that involves conflict, struggle, or competition; in an argumentative or combative way.","examples":[{"sentence":"The two politicians debated agonistically, each trying to undermine the other's arguments.","translation":"その二人の政治家は闘争的に議論し、互いの主張を弱めようとした。"},{"sentence":"The company was agonistically competing with its rivals for market share.","translation":"その会社は市場シェアをめぐってライバル企業と闘争的に競争していた。"},{"sentence":"He approached the discussion agonistically, ready to challenge every point.","translation":"彼はあらゆる点に異議を唱える覚悟で、その議論に闘争的に臨んだ。"}],"collocations":["compete agonistically","debate agonistically","approach agonistically","argue agonistically","respond agonistically"],"synonyms":["combatively","contentiously","belligerently","argumentatively","competitively","antagonistically","pugnaciously"],"antonyms":["peacefully","harmoniously","cooperatively","amicably","collaboratively"]}],"etymology":{"value":"The word is derived from 'agonistic,' which comes from the Greek word 'agonia' (ἀγωνία), meaning 'struggle' or 'contest.' The suffix '-ally' is added to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæɡənɪˈstɪkəli/","syllables":"a-gon-is-ti-cal-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Agonistically' describes actions or behaviors characterized by conflict, competition, or argument. It often implies a readiness to challenge or oppose others. The term is frequently used in contexts involving debates, sports, or business competition where there is a clear sense of rivalry. It is not commonly used in everyday conversation but is more often found in formal writing or discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She smiled agonistically.","correct":"✓ She smiled sarcastically.","note":"'Agonistically' implies conflict or competition, not a manner of smiling. Sarcasm might be a closer fit if the intention is to convey a negative or challenging emotion through a smile."},{"incorrect":"✗ They worked agonistically together.","correct":"✓ They worked competitively together.","note":"'Agonistically' implies opposition, so it's contradictory to say they worked 'agonistically together.' 'Competitively' would be more appropriate if they were striving against each other while working in the same group."}],"priority":"★★☆"},"related_words":{"derivatives":["agonistic (adjective)","agonism (noun)","antagonistic (adjective)","antagonistically (adverb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Agonistically' is an advanced term used to describe behavior characterized by conflict or competition. It is not commonly used in everyday language and is more frequently found in formal writing or academic discussions. Understanding the term requires a good grasp of vocabulary related to conflict and competition. The word is derived from 'agonistic,' which relates to struggle or contest, stemming from the Greek term 'agonia.'"},"example_sentences":[{"sentence":"The lawyers argued agonistically in court, each presenting evidence to support their client.","translation":"弁護士たちは法廷で闘争的に議論し、それぞれの依頼人を支持するために証拠を提示した。","type":"general","meaning_category":"闘争的に議論する"},{"sentence":"The two companies competed agonistically for the contract, each offering lower prices and better services.","translation":"その二つの会社は契約をめぐって闘争的に競争し、それぞれより低い価格とより良いサービスを提供した。","type":"business","meaning_category":"闘争的に競争する"},{"sentence":"He responded agonistically to the criticism, defending his work with great passion.","translation":"彼はその批判に闘争的に反応し、自身の仕事を強い情熱をもって擁護した。","type":"general","meaning_category":"闘争的に反応する"}]}