{"word":"Clonorchis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"肝吸虫（かんきゅうちゅう）","english_definition":"A genus of parasitic trematodes, specifically Clonorchis sinensis (Chinese liver fluke), that infects the liver of humans and other mammals.","examples":[{"sentence":"Clonorchis sinensis is a significant cause of liver disease in parts of Asia.","translation":"肝吸虫はアジアの一部の地域で肝疾患の重要な原因となっている。"}],"collocations":["Clonorchis sinensis (肝吸虫の学名)","Clonorchis infection (肝吸虫感染症)"],"synonyms":["Chinese liver fluke"],"antonyms":[]}],"etymology":{"value":"The name Clonorchis is derived from the Greek words 'clon' (branch), 'orchis' (testis), and 'is' (resembling), referring to the branched testes of the worm.","priority":"★★☆"},"pronunciation":{"ipa":"/kləˈnɔːrkɪs/","syllables":"Clo-nor-chis"},"inflection":{"noun_plural":"Clonorchis (often used as a singular collective noun)"},"usage_notes":{"explanation":"Clonorchis typically refers to the genus of liver flukes, with Clonorchis sinensis being the most well-known species. The term is primarily used in medical and scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Clonorchis is a bacteria.","correct":"✓ Clonorchis is a parasitic worm.","note":"Clonorchis is a type of parasitic worm, not a bacterium."}],"priority":"★★☆"},"related_words":{"derivatives":["Clonorchiasis (肝吸虫症)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Clonorchis' is a technical term used in the fields of medicine, parasitology, and biology. It refers to a genus of parasitic worms, particularly the Chinese liver fluke (Clonorchis sinensis), which can infect the liver. Understanding this term requires a background in these scientific disciplines. It is unlikely to be encountered in general conversation or non-specialized texts."},"example_sentences":[{"sentence":"Infection with Clonorchis sinensis can lead to serious liver damage.","translation":"肝吸虫症は重篤な肝障害を引き起こす可能性がある。","type":"medical","meaning_category":"parasitology"},{"sentence":"The life cycle of Clonorchis involves several intermediate hosts.","translation":"肝吸虫の生活環にはいくつかの宿主が関与する。","type":"scientific","meaning_category":"biology"}]}