{"word":"underfeathering","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(鳥類の)下毛、下羽","english_definition":"The soft layer of feathers closest to a bird's skin, providing insulation.","examples":[{"sentence":"The duck's underfeathering keeps it warm in the cold water.","translation":"カモの下毛は、冷たい水の中で体を暖かく保ちます。"},{"sentence":"Good underfeathering is essential for birds living in harsh climates.","translation":"厳しい気候に住む鳥にとって、良質な下毛は不可欠です。"}],"collocations":["dense underfeathering","soft underfeathering","thick underfeathering"],"synonyms":["down","plumage","underdown"],"antonyms":[]}],"etymology":{"value":"'Under-' (下の) + 'feathering' (羽毛)","priority":"★★★"},"pronunciation":{"ipa":"/ˈʌndərˌfɛðərɪŋ/","syllables":"un-der-feath-er-ing"},"inflection":{"noun_plural":"underfeatherings"},"usage_notes":{"explanation":"'Underfeathering' refers specifically to the soft, fluffy feathers located beneath the outer feathers of a bird. This layer provides insulation and helps regulate the bird's body temperature. It's a key adaptation for birds living in cold environments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bird lost its underfeathering during molting.","correct":"✓ The bird lost some of its underfeathering during molting.","note":"Underfeathering is a mass noun (uncountable), so you can't say 'its underfeathering' to mean all of it was lost. You would say 'some of its underfeathering' or 'a lot of its underfeathering' if referring to a portion being lost."}],"priority":"☆☆☆"},"related_words":{"derivatives":["feather","feathered","unfeathered"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Underfeathering' is a specialized term related to ornithology (the study of birds). It refers to the layer of soft, fluffy feathers underneath the outer feathers of a bird, which provides insulation. Understanding this term requires some knowledge of bird anatomy and physiology."},"example_sentences":[{"sentence":"The eider duck is known for its exceptionally warm underfeathering, which is harvested for down.","translation":"ケワタガモは、ダウンとして採取される非常に暖かい下毛で知られています。","type":"noun","meaning_category":"下毛"},{"sentence":"The quality of a bird's underfeathering can be an indicator of its overall health.","translation":"鳥の下毛の質は、その全体的な健康状態の指標となる可能性があります。","type":"noun","meaning_category":"下毛"}]}