{"word":"Plutarch","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"プルタルコス (古代ギリシャの著述家、伝記作家、倫理家)","english_definition":"A Greek biographer and essayist, known primarily for his 'Parallel Lives' and 'Moralia'.","examples":[{"sentence":"Plutarch's 'Parallel Lives' compares famous Greeks and Romans.","translation":"プルタルコスの『対比列伝』は、有名なギリシャ人とローマ人を比較している。"},{"sentence":"Plutarch's writings offer insights into ancient Greek and Roman culture.","translation":"プルタルコスの著作は、古代ギリシャとローマの文化への洞察を提供する。"}],"collocations":["Plutarch's Lives","Plutarch's Moralia","read Plutarch","study Plutarch","Plutarch's influence"],"synonyms":["none (proper noun)"],"antonyms":["none (proper noun)"]}],"etymology":{"value":"From Greek Πλούταρχος (Ploutarkhos), meaning 'ruler of wealth' or 'wealthy ruler'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpluːtɑːrk/","syllables":"Plu-tarch","audio_url":"https://example.com/plutarch_audio.mp3"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"Plutarch is primarily known for his biographical and philosophical works. His 'Parallel Lives' is a series of biographies comparing famous Greeks and Romans, often pairing them together to explore their common virtues and vices. His 'Moralia' is a collection of essays and treatises on a wide range of ethical, religious, and practical topics. Plutarch's writings are considered valuable sources for understanding ancient history, culture, and philosophy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Plutarch was a Roman emperor.","correct":"✓ Plutarch was a Greek writer and biographer.","note":"Plutarch was Greek, not Roman. He was a writer and biographer, not an emperor."},{"incorrect":"✗ Plutarch wrote only about Roman figures.","correct":"✓ Plutarch wrote about both Greek and Roman figures.","note":"Plutarch's 'Parallel Lives' includes biographies of both Greek and Roman figures, comparing them in pairs."}],"priority":"★★☆"},"related_words":{"derivatives":["Plutarchean (adjective: relating to Plutarch or his writings)"],"people_influenced":["Michel de Montaigne","William Shakespeare","Ralph Waldo Emerson"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (knowledge of classical literature)","frequency_google_ngram":"Relatively low frequency, primarily in academic or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Understanding 'Plutarch' requires familiarity with classical history and literature. He is a key figure in ancient Greek intellectual history, and his works are often studied in the context of understanding ancient ethics, politics, and biography. References to Plutarch generally assume a certain level of education and cultural literacy.","priority":"★★☆"},"example_sentences":[{"sentence":"Many historians consider Plutarch's biographies essential reading for understanding ancient Rome.","translation":"多くの歴史家は、プルタルコスの伝記を古代ローマを理解するための必読書と考えている。","type":"general","meaning_category":"biographer"},{"sentence":"Shakespeare drew heavily on Plutarch's 'Lives' for his Roman plays.","translation":"シェイクスピアは、自身のローマ劇のためにプルタルコスの『列伝』から多くを引用した。","type":"influence","meaning_category":"influence"},{"sentence":"Plutarch's essays in 'Moralia' cover a wide range of philosophical topics.","translation":"プルタルコスの『モラリア』のエッセイは、広範な哲学的なトピックを網羅している。","type":"works","meaning_category":"works"}]}