{"word":"Keystoner","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A resident of Pennsylvania; a Pennsylvanian.","english_definition":"A resident of or someone who is from the state of Pennsylvania.","examples":[{"sentence":"As a Keystoner, I'm proud of my state's history.","translation":"ペンシルベニア州民として、私は自分の州の歴史を誇りに思っています。"},{"sentence":"Many Keystoners enjoy visiting Philadelphia and Pittsburgh.","translation":"多くのペンシルベニア州民がフィラデルフィアやピッツバーグを訪れるのを楽しんでいます."}],"collocations":["Native Keystoner","Lifelong Keystoner"],"synonyms":["Pennsylvanian"],"antonyms":[]}],"etymology":{"value":"Derived from Pennsylvania being known as the 'Keystone State' due to its central role in the early United States.","priority":"Medium"},"pronunciation":{"ipa":"/ˈkiːˌstoʊnər/","syllables":"Key-ston-er"},"inflection":{"noun_plural":"Keystoners"},"usage_notes":{"explanation":"The term 'Keystoner' is primarily used to refer to people from Pennsylvania. The term is derived from the state's nickname, 'The Keystone State,' which reflects Pennsylvania's central geographic location among the original thirteen colonies and its significant role in the nation's founding.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He is a Keystoner from New York.","correct":"He is a New Yorker.","note":"Keystoner refers specifically to residents of Pennsylvania, not New York."}],"priority":"Low"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"B2","text":"The word 'Keystoner' refers to a person from Pennsylvania. It's derived from the state's nickname, 'The Keystone State,' reflecting its historical and geographical significance in the early United States. While not a commonly used term outside of Pennsylvania or historical contexts, understanding it provides insight into regional identity and history."},"example_sentences":[{"sentence":"The annual Keystoner picnic is a popular event in Harrisburg.","translation":"毎年恒例のキーストナーピクニックは、ハリスバーグで人気のイベントです。","type":"noun","meaning_category":"Resident of Pennsylvania"},{"sentence":"As a proud Keystoner, she always supports local businesses.","translation":"誇り高きキーストナーとして、彼女は常に地元の企業を支援しています。","type":"noun","meaning_category":"Resident of Pennsylvania"}]}