{"word":"unwretched","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"みじめでない、悲惨でない、不幸でない","english_definition":"Not wretched; not miserable or unhappy.","examples":[{"sentence":"Despite the challenges, she led an unwretched life, filled with small joys.","translation":"困難にもかかわらず、彼女は小さな喜びに満ちた、みじめでない人生を送った。"},{"sentence":"He found solace in his art, making his existence unwretched even in difficult times.","translation":"彼は芸術に慰めを見出し、困難な時でも自分の存在を悲惨なものにしないようにした。"}],"collocations":["unwretched life","unwretched existence","unwretched condition"],"synonyms":["happy","fortunate","blessed","contented","comfortable"],"antonyms":["wretched","miserable","unhappy","unfortunate","distressed"]}],"etymology":{"value":"\"Un-\" (否定接頭辞) + \"wretched\".","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈrɛtʃɪd/","syllables":"un-retch-ed"},"inflection":{"adjective_forms":{"comparative":"more unwretched","superlative":"most unwretched"}},"usage_notes":{"explanation":"\"Unwretched\" is the direct opposite of \"wretched.\" It describes a state or condition that is not miserable, unhappy, or unfortunate. It's a relatively uncommon word, often used in formal writing or to provide a specific contrast to a previously mentioned state of misery.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unwretched because he failed the exam.","correct":"✓ He was wretched because he failed the exam.","note":"\"Unwretched\" means not wretched. Failing an exam would likely make someone wretched, not unwretched."},{"incorrect":"✗ The unwretched old house stood on the hill.","correct":"✓ The wretched old house stood on the hill.","note":"Old houses in disrepair are often described as wretched, not unwretched."}],"priority":"★★☆"},"related_words":{"derivatives":["wretched (adjective)","wretchedly (adverb)","wretchedness (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Word not commonly found in CEFR vocabulary lists)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unwretched\" is an uncommon word that means 'not wretched'. It's formed by adding the prefix 'un-' to 'wretched', which means extremely unhappy or unfortunate. Because it's not frequently used, it's more likely to be encountered in formal writing or when a speaker/writer wants to emphasize the absence of misery. Understanding the meaning of 'wretched' is key to understanding 'unwretched'."},"example_sentences":[{"sentence":"She sought to create an unwretched existence for her children, despite their poverty.","translation":"彼女は貧困にもかかわらず、子供たちのためにみじめでない生活を築こうとした。","type":"adjective","meaning_category":"Not miserable"},{"sentence":"The goal of the social program was to make the lives of the poor less wretched and more unwretched.","translation":"その社会プログラムの目標は、貧しい人々の生活をよりみじめでなく、より不幸でないものにすることだった。","type":"adjective","meaning_category":"Not unhappy"}]}