{"word":"woolworker","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"羊毛加工業者、羊毛製品の職人","english_definition":"A person who works with wool, especially a textile worker who processes wool or makes woolen products.","examples":[{"sentence":"The woolworker carefully sorted the fleece before spinning it into yarn.","translation":"羊毛加工業者は、糸に紡ぐ前にフリースを注意深く選別した。"},{"sentence":"Medieval towns often had guilds of woolworkers who controlled the quality and price of woolen cloth.","translation":"中世の町には、羊毛の品質と価格を管理する羊毛加工業者のギルドがよくあった。"},{"sentence":"The woolworker used a spinning wheel to create yarn from the raw wool.","translation":"羊毛加工業者は、生の羊毛から糸を作るために紡ぎ車を使用した。"}],"collocations":["textile woolworker","skilled woolworker","independent woolworker"],"synonyms":["woolman","wool merchant","textile worker","spinner","weaver"],"antonyms":[]}],"etymology":{"value":"'Wool' + 'worker'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈwʊlwɜːrkər","syllables":"wool-work-er"},"inflection":{"noun_plural":"woolworkers"},"usage_notes":{"explanation":"The term 'woolworker' refers to someone involved in any stage of wool processing, from sorting raw wool to creating finished products like cloth or yarn. It is a relatively specific term, not commonly used in modern English outside of historical contexts or specialized industries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a wool worker in the factory.","correct":"✓ She is a woolworker in the factory.","note":"'Woolworker' is one word."}],"priority":"★☆☆"},"related_words":{"derivatives":["wool","worker","woolworking"],"phrases":["wool industry","wool trade"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'woolworker' is a specialized term referring to someone who works with wool. It is not a common word in everyday conversation and is more likely to be encountered in historical contexts or in discussions about the textile industry. Understanding the word requires knowledge of the individual components ('wool' and 'worker') and an understanding of how they combine to describe a specific occupation.","priority":"★★☆"},"example_sentences":[{"sentence":"The woolworker spent hours carding the wool to prepare it for spinning.","translation":"羊毛加工業者は、紡ぐ準備をするために何時間も羊毛を梳いた。","type":"general","meaning_category":"occupation"},{"sentence":"The town's economy depended on the skills of its woolworkers.","translation":"町の経済は、羊毛加工業者の技能に依存していた。","type":"historical","meaning_category":"economic importance"},{"sentence":"The woolworker's hands were rough from years of handling raw wool.","translation":"羊毛加工業者の手は、長年の生の羊毛の取り扱いで荒れていた。","type":"descriptive","meaning_category":"physical characteristic"}]}