{"word":"nebulizable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ネブライザーで噴霧できる、ネブライザーに適した","english_definition":"Suitable for administration via a nebulizer; capable of being converted into a fine spray for inhalation.","examples":[{"sentence":"This medication is available in a nebulizable solution.","translation":"この薬はネブライザー用の溶液として入手可能です。"},{"sentence":"The doctor prescribed a nebulizable bronchodilator for his asthma.","translation":"医師は彼の喘息のためにネブライザー用の気管支拡張剤を処方しました。"}],"collocations":["nebulizable solution","nebulizable medication","nebulizable bronchodilator"],"synonyms":["inhalable","aerosolizable"],"antonyms":["oral","injectable"]}],"etymology":{"value":"Derived from 'nebulize,' meaning to convert a liquid into a fine spray or mist, plus the suffix '-able,' indicating capability or suitability.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɛbjəlaɪˈzɑːbəl/","syllables":"neb-u-li-za-ble"},"inflection":{"notes":"Adjective; no comparative or superlative forms."},"usage_notes":{"explanation":"'Nebulizable' describes substances, typically medications, that are formulated to be administered using a nebulizer. Nebulizers transform liquid medications into a mist that can be easily inhaled into the lungs, making them suitable for treating respiratory conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nebulizable patient.","correct":"✓ The patient used a nebulizable solution.","note":"'Nebulizable' describes the solution, not the patient."}],"priority":"★★☆"},"related_words":{"derivatives":["nebulize (verb): to convert a liquid into a fine spray","nebulizer (noun): a device used to administer medication in the form of a mist"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nebulizable' is a specialized term primarily used in medical contexts. It describes a substance, usually a medication, that can be transformed into a mist or aerosol for inhalation via a nebulizer. Understanding this term requires familiarity with medical terminology and drug delivery methods. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The pharmacist confirmed that the antibiotic was available in a **nebulizable** form.","translation":"薬剤師は、その抗生物質がネブライザーで使用できる形態で入手可能であることを確認しました。","type":"adjective","meaning_category":"ネブライザーに適した"},{"sentence":"For young children, a **nebulizable** steroid may be easier to administer than an inhaler.","translation":"幼い子供にとって、ネブライザーで使用できるステロイドは吸入器よりも投与が容易かもしれません。","type":"adjective","meaning_category":"ネブライザーに適した"}]}