{"word":"StLG","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(German: Straßenverkehrs-Landesgesetze) State traffic laws (in Germany).","english_definition":"Abbreviation for 'Straßenverkehrs-Landesgesetze', which refers to the state traffic laws in Germany. Each state ('Land') within Germany has its own set of traffic regulations that supplement the federal traffic laws.","examples":[{"sentence":"Die StLG regeln spezifische Aspekte des Straßenverkehrs in den einzelnen Bundesländern.","translation":"The StLG regulate specific aspects of road traffic in the individual federal states."}],"collocations":["StLG Bayern","StLG Nordrhein-Westfalen","Änderung des StLG"],"synonyms":["Landesstraßenverkehrsgesetz","Straßenverkehrsrecht (Landesrecht)"],"antonyms":[]}],"etymology":{"value":"Acronym derived from the German term 'Straßenverkehrs-Landesgesetze'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌʃtraːsn̩fɛɐ̯ˈkeːɐ̯sˌlandəsɡəˌzɛt͡sə/","syllables":"Stra-ßen-ver-kehrs-Lan-des-ge-set-ze"},"inflection":{"noun_plural":"StLG"},"usage_notes":{"explanation":"The abbreviation 'StLG' is primarily used in legal and administrative contexts within Germany when referring to the state-level traffic laws. It's important to note that the specific content of the StLG varies from state to state.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Das StLG ist für alle Bundesländer gleich.","correct":"Das StLG ist je nach Bundesland unterschiedlich.","note":"The StLG differs from state to state."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["StVO (Straßenverkehrsordnung - Federal German traffic regulations)","Landesrecht (State law)","Bundesrecht (Federal law)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'StLG' is a legal abbreviation specific to the German legal system. Understanding it requires familiarity with the structure of German federalism and the division of legislative powers between the federal government and the individual states ('Länder'). It is used in legal documents, academic discussions of German law, and administrative contexts related to traffic regulations within a specific German state.","priority":"★★☆"},"example_sentences":[{"sentence":"Die genauen Bestimmungen zur Winterreifenpflicht sind im jeweiligen StLG festgelegt.","translation":"The exact provisions regarding the winter tire requirement are defined in the respective StLG.","type":"noun","meaning_category":"State traffic laws"}]}