{"word":"maturesco","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(slang, often derogatory) A man who is past his prime but still tries to act youthful, often by dating younger women or adopting youthful styles.","english_definition":"(slang, often derogatory) A man who is past his prime but still tries to act youthful, often by dating younger women or adopting youthful styles.","examples":[{"sentence":"He's a total maturesco, always trying to pick up girls half his age.","translation":"彼は完全なマチュレスコだ、いつも自分の半分の年齢の女の子をナンパしようとしている。"},{"sentence":"That guy is such a maturesco with his sports car and leather jacket.","translation":"あの男はスポーツカーと革のジャケットで、まるでマチュレスコだ。"}],"collocations":["act like a maturesco","a typical maturesco","dating a maturesco"],"synonyms":["oldster","aging playboy","cradle robber"],"antonyms":["young man","youth"]}],"etymology":{"value":"A blend of 'mature' and '-esco' (a suffix suggesting style or manner, often Italianate).","priority":"N/A"},"pronunciation":{"ipa":"/məˈtʃʊrɛskoʊ/","syllables":"ma-tur-es-co"},"inflection":{"noun_plural":"maturescos"},"usage_notes":{"explanation":"'Maturesco' is a slang term, often used in a derogatory way, to describe an older man who is trying to recapture his youth. The term implies that the man's behavior is somewhat pathetic or embarrassing. It is not a formal or widely accepted word.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ She's dating a maturesco, but he's actually quite mature.","correct":"✓ She's dating a maturesco, but he's surprisingly mature for his age.","note":"The term 'maturesco' implies a lack of maturity, so it's contradictory to say someone is 'actually quite mature' while calling them a 'maturesco'."}],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Slang term.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Maturesco' is a relatively rare slang term. Understanding requires familiarity with slang and some cultural awareness of stereotypes about aging men. It's not a word typically found in formal writing or everyday conversation.","priority":"N/A"},"example_sentences":[{"sentence":"He's trying too hard to be cool; he's turning into a maturesco.","translation":"彼はカッコよくなろうとしすぎている。マチュレスコになりつつある。","type":"noun","meaning_category":"derogatory term for an older man trying to be youthful"}]}