{"word":"Priapism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"持続勃起症：性的刺激とは無関係に、4時間以上持続する、痛みを伴う陰茎の勃起。","english_definition":"A prolonged erection of the penis, usually without sexual arousal. It is a painful condition that can last for several hours or more and is unrelated to sexual stimulation.","examples":[{"sentence":"He was rushed to the hospital due to priapism.","translation":"彼は持続勃起症のため、病院に緊急搬送された。"},{"sentence":"Priapism can be a side effect of certain medications.","translation":"持続勃起症は特定の薬の副作用である可能性がある。"},{"sentence":"If priapism is left untreated, it can lead to permanent damage.","translation":"持続勃起症を放置すると、永続的な損傷につながる可能性がある。"}],"collocations":["ischemic priapism","non-ischemic priapism","develop priapism","treat priapism","priapism treatment"],"synonyms":["persistent erection","prolonged erection"],"antonyms":[]}],"etymology":{"value":"ギリシャ神話の豊穣の神であるプリアポス（Priapus）に由来する。プリアポスは、常に勃起した状態で描かれることが多かった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpraɪ.ə.pɪzəm/","syllables":"Pri-a-pism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Priapism is a medical emergency that requires prompt treatment to prevent long-term complications, such as erectile dysfunction. There are two main types: ischemic (low-flow) and non-ischemic (high-flow). Ischemic priapism is more common and more serious.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has priapism for a long time.","correct":"✓ He has had priapism for a long time.","note":"持続勃起症が継続している状態を表すには、現在完了形を使うのが適切です。"},{"incorrect":"✗ Priapism is a normal erection.","correct":"✓ Priapism is not a normal erection.","note":"持続勃起症は性的刺激とは無関係に起こる異常な勃起であり、正常な勃起とは異なります。"}],"priority":"★★☆"},"related_words":{"derivatives":["priapic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Priapism is a medical term referring to a prolonged and painful erection of the penis that is not caused by sexual stimulation. It requires immediate medical attention to prevent permanent damage. The term comes from Priapus, a Greek god associated with fertility and characterized by a permanent erection.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor explained the risks and treatment options for priapism.","translation":"医師は持続勃起症のリスクと治療の選択肢について説明した。","type":"general","meaning_category":"medical condition"},{"sentence":"Certain blood disorders can increase the risk of developing priapism.","translation":"特定の血液疾患は、持続勃起症を発症するリスクを高める可能性がある。","type":"cause","meaning_category":"medical condition"},{"sentence":"Prompt treatment of priapism is essential to prevent permanent erectile dysfunction.","translation":"持続勃起症の迅速な治療は、永続的な勃起不全を防ぐために不可欠である。","type":"treatment","meaning_category":"medical condition"}]}