{"word":"aniconic","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"偶像崇拝を避ける、または偶像を用いない","english_definition":"Representing no physical likenesses of gods, idols, or other religious figures; avoiding the use of images or likenesses.","examples":[{"sentence":"Islam is generally aniconic, avoiding depictions of God or the Prophet Muhammad.","translation":"イスラム教は一般的に偶像崇拝を避け、神や預言者ムハンマドの描写を避けます。"},{"sentence":"Some branches of Judaism are aniconic, discouraging the creation of images of God.","translation":"ユダヤ教の一部の宗派は偶像崇拝を避け、神のイメージの作成を禁じています。"},{"sentence":"The abstract art in the temple was aniconic, representing spiritual concepts rather than physical forms.","translation":"寺院の抽象芸術は偶像を用いず、物理的な形ではなく精神的な概念を表していました。"}],"collocations":["aniconic art","aniconic representation","aniconic tradition","aniconic symbol","aniconic design"],"synonyms":["non-representational","abstract","symbolic","non-figurative"],"antonyms":["iconic","representational","figurative"]}],"etymology":{"value":"Derived from the prefix 'an-' (meaning 'without' or 'not') and 'iconic' (relating to icons or images).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪaɪˈkɒnɪk/","syllables":"a-i-con-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Aniconic' describes something that does not use or represent images, particularly in religious contexts. It is often used to describe religions or artistic traditions that avoid depicting deities or other sacred figures in physical form. The term emphasizes the absence of icons or likenesses.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The aniconic statue was very detailed.","correct":"The abstract statue was very detailed.","note":"An aniconic work would not be a statue, especially not a detailed one. Aniconic means without likenesses or images."},{"incorrect":"Aniconic art is easy to understand.","correct":"Aniconic art can be difficult to understand.","note":"Aniconic art is often abstract and symbolic, which can make it challenging to interpret."}],"priority":"★★☆"},"related_words":{"derivatives":["aniconism (noun): The practice or belief of avoiding images or likenesses.","icon (noun): A representation or image, especially of a religious figure.","iconoclasm (noun): The destruction of icons or images, especially for religious reasons."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'aniconic' is a specialized term primarily used in the context of art history, religious studies, and cultural analysis. It describes a style or tradition that avoids the use of images or likenesses, particularly in religious contexts. Understanding this term requires familiarity with abstract concepts and specialized vocabulary related to art and religion."},"example_sentences":[{"sentence":"The mosque's design is aniconic, featuring geometric patterns instead of human figures.","translation":"モスクのデザインは偶像を用いず、人物像の代わりに幾何学模様が特徴です。","type":"example","meaning_category":"religious design"},{"sentence":"Early Buddhist art was often aniconic, using symbols to represent the Buddha.","translation":"初期の仏教美術はしばしば偶像を用いず、シンボルを使って仏陀を表していました。","type":"example","meaning_category":"art history"},{"sentence":"The aniconic tradition in some cultures reflects a belief in the transcendence of the divine.","translation":"一部の文化における偶像を用いない伝統は、神の超越性への信念を反映しています。","type":"example","meaning_category":"cultural belief"}]}