{"word":"anamorphote","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"歪像図、歪像画","english_definition":"A distorted image that appears in its true shape when viewed from some unusual angle.","examples":[{"sentence":"The artist created an anamorphote on the sidewalk that could only be seen from a specific spot.","translation":"そのアーティストは、特定の場所からしか見えない歪像図を歩道に作成した。"},{"sentence":"Anamorphotes are often used in art and advertising to create surprising visual effects.","translation":"歪像図は、驚くべき視覚効果を生み出すために、芸術や広告でよく使用される。"}],"collocations":["create an anamorphote","view an anamorphote","anamorphotic art"],"synonyms":["distorted image","anamorphic image"],"antonyms":[]}],"etymology":{"value":"The word \"anamorphote\" comes from the French word \"anamorphose\", which itself comes from the Greek words \"ana-\" (meaning \"again\" or \"back\") and \"morphe\" (meaning \"form\" or \"shape\"). So, an anamorphote is essentially a re-formed or transformed shape.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænəˈmɔːrfət/","syllables":"a-na-mor-phote"},"inflection":{"noun_plural":"anamorphotes"},"usage_notes":{"explanation":"An anamorphote is a specific type of distorted image that requires the viewer to occupy a particular vantage point, or to use a special device (like a mirror), to see the image correctly. The distortion is intentional and designed to create a surprise or reveal a hidden image.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an anamorphote, but it wasn't distorted at all.","correct":"✓ I saw an anamorphote, but it didn't look like anything until I stood in the right spot.","note":"An anamorphote *is* distorted; that's the defining characteristic. It only appears correct from a specific viewpoint. "},{"incorrect":"✗ He painted a realistic portrait; it was a perfect anamorphote.","correct":"✓ He painted a realistic portrait.","note":"A realistic portrait is not an anamorphote. An anamorphote is intentionally distorted."}],"priority":"★★☆"},"related_words":{"derivatives":["anamorphosis (noun: the process of creating an anamorphote)","anamorphic (adjective: relating to or characterized by anamorphosis)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"anamorphote\" refers to a highly specialized type of distorted image that requires a specific viewing angle or device to be seen correctly. It's a technical term used in art, mathematics, and optics. Understanding the concept requires familiarity with perspective and visual perception. It is not a commonly used word. "},"example_sentences":[{"sentence":"The artist used mathematical formulas to create the complex anamorphote.","translation":"そのアーティストは、複雑な歪像図を作成するために数式を使用した。","type":"noun","meaning_category":"distorted image"},{"sentence":"From the correct angle, the seemingly random lines transformed into a recognizable image; it was a stunning anamorphote.","translation":"正しい角度から見ると、一見ランダムな線が認識可能な画像に変わった。それは見事な歪像図だった。","type":"noun","meaning_category":"distorted image"}]}