{"word":"diaphototropic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物が)光の方向に対して横方向に成長する性質を持つ","english_definition":"(of a plant) growing or turning at right angles to the direction of light.","examples":[{"sentence":"The leaves of this plant are diaphototropic, orienting themselves perpendicular to the light source.","translation":"この植物の葉はジアフォトトロピックで、光源に対して垂直になるように方向を変えます。"}],"collocations":["diaphototropic growth","diaphototropic leaves"],"synonyms":["transversely phototropic"],"antonyms":["orthophototropic","aphototropic"]}],"etymology":{"value":"Derived from the Greek words 'dia-' (through, across), 'photo-' (light), and 'tropos' (turning).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪəˌfoʊtəˈtroʊpɪk/","syllables":"di-a-pho-to-tro-pic"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"Diaphototropism is a type of phototropism where plant organs, such as leaves, orient themselves perpendicular (at a right angle) to the direction of the light source. This contrasts with orthophototropism, where growth is directly towards or away from the light.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The plant showed diaphototropism by growing towards the light.","correct":"The plant showed diaphototropism by growing perpendicular to the light.","note":"Diaphototropism is growth at a right angle to the light, not directly towards it."}],"priority":"★☆☆"},"related_words":{"derivatives":["phototropism","orthophototropic","aphototropic"],"related_terms":["tropism","photobiology","plant physiology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. This is a specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Diaphototropic' is a specialized term in plant biology describing growth orientation. It indicates that a plant or plant organ grows at a right angle (perpendicular) to the direction of light. This term is not commonly used outside of scientific or technical contexts related to botany and plant physiology."},"example_sentences":[{"sentence":"The diaphototropic orientation of the leaves maximizes light capture in shaded environments.","translation":"葉のジアフォトトロピックな方向は、日陰の環境での光の捕捉を最大化します。","type":"scientific","meaning_category":"plant physiology"},{"sentence":"Research suggests that diaphototropic responses are influenced by specific photoreceptors in plant cells.","translation":"研究によると、ジアフォトトロピックな反応は、植物細胞内の特定の光受容体によって影響を受けることが示唆されています。","type":"scientific","meaning_category":"plant physiology"}]}