{"word":"tyrannicidal","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"暴君を殺すこと、または暴君殺しを支持すること","english_definition":"Of or relating to the killing of a tyrant; advocating tyrannicide.","examples":[{"sentence":"The play explores tyrannicidal themes.","translation":"その劇は暴君殺しのテーマを探求している。"},{"sentence":"He held tyrannicidal views.","translation":"彼は暴君殺しを支持する考えを持っていた。"}],"collocations":["tyrannicidal act","tyrannicidal plot","tyrannicidal sentiment"],"synonyms":["assassinatory","revolutionary"],"antonyms":["pro-government","loyalist"]}],"etymology":{"value":"From tyrant + -i- + -cide.","priority":"★★★"},"pronunciation":{"ipa":"/tɪˌrænɪˈsaɪdl/","syllables":"ty-ran-ni-ci-dal"},"inflection":{"notes":"Comparative and superlative forms are possible, but rare (more tyrannicidal, most tyrannicidal)."},"usage_notes":{"explanation":"'Tyrannicidal' is a relatively rare word, primarily used in political or historical contexts to describe actions, ideas, or sentiments relating to the assassination of a tyrant. It often carries a strong moral or political charge, depending on one's view of the tyrant in question.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a tyrannicidal.","correct":"✓ He was a tyrannicide.","note":"'Tyrannicidal' is an adjective; the noun for someone who kills a tyrant is 'tyrannicide'."}],"priority":"★★☆"},"related_words":{"derivatives":["tyrannicide (noun: the killing of a tyrant; a person who kills a tyrant)","tyrant (noun: a cruel and oppressive ruler)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'tyrannicidal' is a sophisticated term used to describe something related to the act of killing a tyrant. It's not commonly used in everyday conversation but appears in historical, political, or philosophical discussions. Due to its specific and somewhat rare usage, it's considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The pamphlets contained tyrannicidal rhetoric, inciting citizens to overthrow the oppressive regime.","translation":"そのパンフレットには暴君殺しを煽るレトリックが含まれており、市民に圧政的な政権を打倒するよう扇動していた。","type":"adjective","meaning_category":"暴君を殺すこと、または暴君殺しを支持すること"},{"sentence":"Some historians view Brutus's actions as tyrannicidal, while others see him as a patriot.","translation":"ブルータスの行動を暴君殺しと見る歴史家もいれば、愛国者と見る歴史家もいる。","type":"adjective","meaning_category":"暴君を殺すこと、または暴君殺しを支持すること"}]}