{"word":"Onycholysis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"爪甲剥離症（そうこうはくりしょう）：爪が爪床（爪の皮膚）から剥がれる状態","english_definition":"The separation of the nail plate from the nail bed.","examples":[{"sentence":"Onycholysis can be caused by trauma, infection, or certain medical conditions.","translation":"爪甲剥離症は、外傷、感染症、または特定の病状によって引き起こされる可能性があります。"},{"sentence":"Treatment for onycholysis depends on the underlying cause.","translation":"爪甲剥離症の治療は、根本的な原因によって異なります。"}],"collocations":["traumatic onycholysis (外傷性爪甲剥離症)","onychomycosis-associated onycholysis (爪白癬関連爪甲剥離症)","drug-induced onycholysis (薬剤誘発性爪甲剥離症)"],"synonyms":["nail separation","detachment of nail","loosening of nail"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「onyx」（爪）+ 「lysis」（溶解、分離）に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒnɪˈkɒlɪsɪs/","syllables":"on-y-chol-y-sis"},"inflection":{"noun_plural":"onycholyses"},"usage_notes":{"explanation":"Onycholysis is a condition where the nail separates from the nail bed. The separation usually starts at the distal (free) edge of the nail and progresses proximally (towards the cuticle). It can affect fingernails or toenails. Common causes include trauma, fungal infections (onychomycosis), psoriasis, thyroid disorders, allergic reactions to nail products, and certain medications. Treatment focuses on addressing the underlying cause and protecting the affected nail.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have onycholysis on my finger.","correct":"✓ I have onycholysis on my fingernail.","note":"While 'finger' is understandable, it's more precise to say 'fingernail' or 'toenail' when referring to the nail affected by onycholysis."},{"incorrect":"✗ Onycholysis is contagious.","correct":"✓ Onychomycosis (a fungal infection) can cause onycholysis and is contagious.","note":"Onycholysis itself is not contagious. However, if it's caused by a fungal infection like onychomycosis, the fungal infection is contagious."}],"priority":"★★☆"},"related_words":{"derivatives":["onycholytic (形容詞: 爪甲剥離性の)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (医学用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学論文や専門的な文脈でのみ見られる。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Onycholysis**」は、爪が爪床から剥がれる医学的な状態を指す用語です。これは、外傷、感染症、皮膚疾患、または薬物反応など、さまざまな原因によって発生する可能性があります。一般の人が日常会話で使用する可能性は低いですが、医学や皮膚科学の分野では重要な用語です。原因を特定し、適切な治療を行うことが重要です。"},"example_sentences":[{"sentence":"She noticed onycholysis on several of her fingernails after using a new nail polish.","translation":"彼女は新しいマニキュアを使った後、いくつかの爪に爪甲剥離症があることに気づいた。","type":"noun","meaning_category":"爪の病気"},{"sentence":"The dermatologist diagnosed his condition as onychomycosis-associated onycholysis.","translation":"皮膚科医は彼の状態を爪白癬関連爪甲剥離症と診断した。","type":"noun","meaning_category":"爪の病気"},{"sentence":"Keeping the nails short and dry can help prevent further onycholysis.","translation":"爪を短く乾燥した状態に保つことは、さらなる爪甲剥離症の予防に役立つ。","type":"noun","meaning_category":"爪の病気"}]}