{"word":"above-reported","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"上記で報告された、前述の報告にある","english_definition":"Previously mentioned or reported; relating to information or events that have been reported earlier in the same document or conversation.","examples":[{"sentence":"The above-reported incident is still under investigation.","translation":"上記で報告された事件は、現在も調査中です。"},{"sentence":"Based on the above-reported data, we can conclude that...","translation":"上記で報告されたデータに基づいて、～という結論を出すことができます。"}],"collocations":["the above-reported data","the above-reported findings","the above-reported incident","as detailed in the above-reported study"],"synonyms":["previously reported","aforementioned","earlier reported","previously stated","as mentioned above"],"antonyms":["below-reported","subsequently reported","later reported"]},{"part_of_speech":"noun","definition":"上記報告","english_definition":"The report or information that has been previously mentioned.","examples":[{"sentence":"Please refer to the above-reported for more details.","translation":"詳細については、上記報告をご参照ください。"}],"collocations":["refer to the above-reported","see the above-reported"],"synonyms":["previous report","aforementioned report"]}],"etymology":{"value":"A compound word formed by combining \"above\" (referring to a position higher up or earlier) and \"reported\" (having been the subject of a report).","priority":"★★★"},"pronunciation":{"ipa":"/əˈbʌv rɪˈpɔːrtɪd/","syllables":"a-bove-re-port-ed"},"inflection":{"notes":"This word typically functions as an adjective modifying a noun. As an adjective, it does not inflect (i.e., it does not have comparative or superlative forms)."},"usage_notes":{"explanation":"\"Above-reported\" is a formal term often used in legal, academic, and professional contexts to refer back to information or events that have already been described or reported earlier in the same document or conversation. It helps to avoid repetition and maintain clarity. It is less common in informal speech or writing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The above reported data is inaccurate.","correct":"✓ The above-reported data is inaccurate.","note":"The hyphen is essential in \"above-reported\" when used as an adjective. Without the hyphen, it may be interpreted as \"data reported above\" which could have a different meaning."},{"incorrect":"✗ Please see the above reported.","correct":"✓ Please see the above-reported.","note":"The hyphen is essential in \"above-reported\" when used as a noun."}],"priority":"★★★"},"related_words":{"derivatives":["above","reported","report"],"related_terms":["aforementioned","foregoing","previous","earlier","subsequently reported","below-mentioned"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term \"above-reported\" is a formal and relatively uncommon way to refer to something that has been mentioned earlier in a text or conversation. It is most often used in professional, legal, or academic writing to avoid repetition and maintain a clear reference to previously discussed information. Because of its formality and limited use, it is considered a C1-level term in terms of readability and comprehension."},"example_sentences":[{"sentence":"The conclusions drawn from the above-reported study are significant.","translation":"上記で報告された研究から得られた結論は重要です。","type":"adjective","meaning_category":"Referencing previous information"},{"sentence":"Further analysis is needed to validate the findings of the above-reported.","translation":"上記報告の結果を検証するには、さらなる分析が必要です。","type":"noun","meaning_category":"Referencing previous report"}]}