{"word":"hydriatrist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)水療法医、水治療専門医","english_definition":"A physician specializing in hydriatrics (the treatment of disease by the internal and external use of water).","examples":[{"sentence":"The hydriatrist recommended a series of cold water immersions.","translation":"その水療法医は、一連の冷水浸漬を勧めた。"}],"collocations":["consult a hydriatrist","see a hydriatrist","hydriatrist's recommendation"],"synonyms":["hydrotherapist"],"antonyms":[]}],"etymology":{"value":"From 'hydriatrics' (the branch of medicine dealing with the use of water in the treatment of disease) + '-ist' (a suffix denoting a person who practices or is concerned with something).","priority":"★★☆"},"pronunciation":{"ipa":"/haɪˈdraɪətrɪst/","syllables":"hy-dri-a-trist"},"inflection":{"noun_plural":"hydriatrists"},"usage_notes":{"explanation":"The term 'hydriatrist' is relatively uncommon in modern medical practice, as hydriatrics has largely been integrated into broader fields like physical therapy and rehabilitation medicine. However, it may still be encountered in historical contexts or in discussions of alternative medicine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a hydriatic.","correct":"✓ He is a hydriatrist.","note":"'Hydriatic' is an adjective relating to hydriatrics or water cure, while 'hydriatrist' is the noun referring to the medical practitioner."}],"priority":"★★☆"},"related_words":{"derivatives":["hydriatric (adjective)","hydriatrics (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'hydriatrist' is a specialized term referring to a medical professional who practices hydriatrics, the treatment of disease through the use of water. This term is not commonly used in modern medicine, as the practice of hydriatrics has largely been integrated into other medical fields. Therefore, understanding and use of this word is generally limited to those with a strong background in medical history or alternative medicine. It is important to distinguish it from more common terms like 'physical therapist' or 'rehabilitation specialist,' which encompass a broader range of treatments.","note":"This word is not commonly used in modern English."},"example_sentences":[{"sentence":"In the early 20th century, many people sought the advice of a hydriatrist for various ailments.","translation":"20世紀初頭には、多くの人々が様々な病気について水療法医の助言を求めた。","type":"noun","meaning_category":"水療法医"},{"sentence":"The hydriatrist prescribed a regimen of hot and cold baths to improve circulation.","translation":"その水療法医は、血行を促進するために温水と冷水の入浴療法を処方した。","type":"noun","meaning_category":"水療法医"}]}