{"word":"Bechamel","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ベシャメルソース（バター、小麦粉、牛乳で作る白いソース）","english_definition":"A basic white sauce made with milk thickened with a white roux of butter and flour.","examples":[{"sentence":"I used Bechamel sauce as the base for my lasagna.","translation":"私はラザニアのベースとしてベシャメルソースを使いました。"},{"sentence":"Bechamel is one of the mother sauces of French cuisine.","translation":"ベシャメルはフランス料理の基本ソースの一つです。"}],"collocations":["make Bechamel sauce","Bechamel base","creamy Bechamel"],"synonyms":["white sauce"],"antonyms":[]}],"etymology":{"value":"ルイ14世の料理長であったルイ・ド・ベシャメルの名前に由来するとされるが、実際には彼以前から同様のソースが存在していたという説もある。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbeʃəˈmɛl/","syllables":"Bech-a-mel"},"inflection":{"noun_plural":"Bechamels"},"usage_notes":{"explanation":"Bechamel sauce is a fundamental sauce in classical French cooking. It's used as a base for many other sauces and dishes, such as gratins, lasagna, and creamed vegetables. The quality of the Bechamel depends on the quality of the ingredients and the technique used to make it. A smooth, lump-free sauce is the goal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I added too much flour and my bechamel was lumpy.","correct":"✓ I added too much flour and my Bechamel was lumpy.","note":"Bechamel is a proper noun derived from a person's name, so it should be capitalized."}],"priority":"★☆☆"},"related_words":{"derivatives":["roux (小麦粉とバターを炒めたもの)","mornay sauce (ベシャメルソースにチーズを加えたもの)","soubise sauce (ベシャメルソースにソテーした玉ねぎを加えたもの)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Bechamel\" refers to a specific type of white sauce used in cooking, particularly in French cuisine. Understanding this term is useful when following recipes or discussing culinary techniques. It's considered one of the \"mother sauces,\" meaning it's a foundational sauce from which many other sauces are derived. While not an everyday word, it's important for anyone interested in cooking or fine dining."},"example_sentences":[{"sentence":"She prepared a classic lasagna with layers of pasta, meat sauce, and creamy Bechamel.","translation":"彼女はパスタ、ミートソース、そしてクリーミーなベシャメルソースを重ねた伝統的なラザニアを作った。","type":"noun","meaning_category":"ベシャメルソース"},{"sentence":"The chef demonstrated how to make a smooth Bechamel sauce without any lumps.","translation":"シェフは、ダマのない滑らかなベシャメルソースの作り方を実演した。","type":"noun","meaning_category":"ベシャメルソース"}]}