{"word":"haemoglobinuria","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"血色素尿（症）","english_definition":"The presence of free hemoglobin in the urine.","examples":[{"sentence":"Haemoglobinuria can be caused by various medical conditions.","translation":"血色素尿は様々な病状によって引き起こされる可能性がある。"},{"sentence":"The doctor suspected haemoglobinuria based on the urine sample's color.","translation":"医師は尿サンプルの色から血色素尿を疑った。"}],"collocations":["paroxysmal cold haemoglobinuria","exercise-induced haemoglobinuria"],"synonyms":["hemoglobinuria"],"antonyms":[]}],"etymology":{"value":"From 'haemoglobin' (hemoglobin) + '-uria' (presence in urine).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːməˌɡloʊbɪˈnjʊəriə/","syllables":"hee-mo-glo-bi-nu-ri-a"},"inflection":{"noun_plural":"haemoglobinurias"},"usage_notes":{"explanation":"Haemoglobinuria refers to the condition where hemoglobin, the oxygen-carrying protein in red blood cells, is found in the urine. This is usually indicative of some underlying medical issue causing the breakdown of red blood cells (hemolysis). It is important to note that the spelling 'haemoglobinuria' is commonly used in British English, while 'hemoglobinuria' is the more common spelling in American English.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Haemoglobinuria is when there are red blood cells in the urine.","correct":"✓ Haemoglobinuria is when there is free hemoglobin in the urine.","note":"Haemoglobinuria is the presence of hemoglobin, not intact red blood cells (which would be hematuria)."}],"priority":"★★☆"},"related_words":{"derivatives":["haemoglobin (hemoglobin)","haemolysis (hemolysis)","hematuria"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Haemoglobinuria' is a medical term referring to the presence of free hemoglobin in the urine. It indicates that red blood cells are breaking down in the body, releasing hemoglobin, which is then filtered by the kidneys and excreted in the urine. This condition is often a sign of an underlying medical problem that requires diagnosis and treatment. The term is more commonly used in medical contexts and may not be familiar to the general public.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient's dark urine was a sign of possible haemoglobinuria.","translation":"患者の濃い色の尿は、血色素尿の可能性を示す兆候だった。","type":"general","meaning_category":"symptom"},{"sentence":"Laboratory tests confirmed the presence of haemoglobinuria.","translation":"臨床検査により、血色素尿の存在が確認された。","type":"medical","meaning_category":"diagnosis"}]}