{"word":"nonpolar","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(化学)無極性の","english_definition":"(chemistry) having no separation of charge; electrically neutral.","examples":[{"sentence":"Nonpolar solvents are used to dissolve nonpolar substances.","translation":"無極性溶媒は、無極性物質を溶解するために使用されます。"},{"sentence":"Oil is a nonpolar substance.","translation":"油は無極性物質です。"},{"sentence":"The molecule is nonpolar because the bond dipoles cancel each other out.","translation":"その分子は、結合双極子が互いに打ち消し合うため、無極性です。"}],"collocations":["nonpolar molecule (無極性分子)","nonpolar solvent (無極性溶媒)","nonpolar bond (無極性結合)","nonpolar substance (無極性物質)","nonpolar interaction (無極性相互作用)"],"synonyms":["apolar","hydrophobic"],"antonyms":["polar","hydrophilic"]}],"etymology":{"value":"Derived from the prefix 'non-' (meaning 'not') and 'polar' (having poles or separation of charge).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈpoʊlər/","syllables":"non-po-lar"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"In chemistry, 'nonpolar' refers to molecules or substances that do not have a significant dipole moment, meaning there is no separation of charge within the molecule. This is often due to symmetrical arrangement of atoms or similar electronegativity values between bonded atoms. Nonpolar substances tend to dissolve well in other nonpolar substances, following the principle of 'like dissolves like'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The water is nonpolar.","correct":"✓ Water is polar.","note":"Water is a classic example of a polar molecule due to its bent shape and the difference in electronegativity between oxygen and hydrogen."},{"incorrect":"✗ Nonpolar molecules dissolve in water.","correct":"✓ Nonpolar molecules do not dissolve well in water.","note":"Nonpolar molecules are hydrophobic and tend to avoid water, which is polar."}],"priority":"★★☆"},"related_words":{"derivatives":["nonpolarity (無極性)"],"phrases":["like dissolves like (類似のものは類似のものを溶かす)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low Frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Nonpolar' is a technical term used in chemistry to describe substances that do not have a separation of electrical charge. This means that the electrons in the molecule are shared equally, or that the shape of the molecule cancels out any uneven distribution of charge. It's the opposite of 'polar,' which describes substances with a positive and negative end. Understanding this term is important for comprehending how different substances interact with each other, especially in the context of solutions and chemical reactions."},"example_sentences":[{"sentence":"Hexane is a common **nonpolar** solvent used in organic chemistry.","translation":"ヘキサンは、有機化学で一般的に使用される無極性溶媒です。","type":"general","meaning_category":"無極性の"},{"sentence":"**Nonpolar** interactions play a crucial role in the folding of proteins.","translation":"無極性相互作用は、タンパク質の折り畳みにおいて重要な役割を果たします。","type":"scientific","meaning_category":"無極性の"},{"sentence":"The **nonpolar** nature of lipids allows them to form cell membranes.","translation":"脂質の無極性な性質により、細胞膜を形成することができます。","type":"biological","meaning_category":"無極性の"}]}