{"word":"Shoulderer","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"One who shoulders; one who puts something on their shoulder(s).","english_definition":"A person who carries something on their shoulder(s).","examples":[{"sentence":"The shoulderer carried the heavy sack of grain up the hill.","translation":"肩に担ぐ人は、重い穀物の袋を丘の上まで運びました。"},{"sentence":"He became a shoulderer of responsibility after his promotion.","translation":"彼は昇進後、責任を肩に担う人となりました。"}],"collocations":["heavy shoulderer","responsibility shoulderer"],"synonyms":["carrier","bearer"],"antonyms":[]},{"part_of_speech":"noun","definition":"One who pushes with the shoulder; one who jostles.","english_definition":"A person who pushes with their shoulder(s), often in a rude or aggressive manner.","examples":[{"sentence":"The shoulderer rudely pushed past me in the crowded hallway.","translation":"肩で押しのける人は、混雑した廊下で無作法に私を押しのけました。"},{"sentence":"Watch out for shoulderers in the busy market.","translation":"賑やかな市場では、肩で押しのける人に注意してください。"}],"collocations":["rude shoulderer","aggressive shoulderer"],"synonyms":["pusher","jostler"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'shoulder' + '-er' (suffix indicating a person who performs the action).","priority":"Medium"},"pronunciation":{"ipa":"/ˈʃoʊldərə(r)/","syllables":"shoul-der-er"},"inflection":{"noun_plural":"Shoulderers"},"usage_notes":{"explanation":"The word 'Shoulderer' is not very common. It can refer to someone who physically carries things on their shoulders or someone who pushes people with their shoulders. The precise meaning depends on the context.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He is a good shoulderer because he always helps others.","correct":"He is a good supporter because he always helps others.","note":"'Shoulderer' is not commonly used to describe someone who supports others; 'supporter' is more appropriate."}],"priority":"Low"},"related_words":{"derivatives":["shoulder","shouldering"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'Shoulderer' is relatively uncommon and its meaning can be inferred from the more common word 'shoulder'. It refers to someone who performs the action of shouldering, either carrying something on their shoulder or pushing with their shoulder. Context is important to determine the intended meaning."},"example_sentences":[{"sentence":"The construction worker was a shoulderer of heavy beams.","translation":"その建設作業員は重い梁を肩に担ぐ人だった。","type":"noun","meaning_category":"Carrier"},{"sentence":"The angry man was a shoulderer, pushing his way through the crowd.","translation":"怒った男は肩で人を押しのける人で、群衆の中を強引に進んだ。","type":"noun","meaning_category":"Pusher"}]}