{"word":"seneschalship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"執事職、家令職","english_definition":"The office, position, or term of a seneschal.","examples":[{"sentence":"He aspired to the seneschalship of the royal household.","translation":"彼は王室の家令職を熱望していた。"},{"sentence":"The seneschalship was a position of great power and responsibility.","translation":"家令職は大きな権力と責任を伴う地位だった。"}],"collocations":["hold the seneschalship","aspire to the seneschalship"],"synonyms":["stewardship","chambellanry","majordomo"],"antonyms":[]}],"etymology":{"value":"seneschal + -ship","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛnɪʃəlʃɪp/","syllables":"sen-e-schal-ship"},"inflection":{"noun_plural":"seneschalships"},"usage_notes":{"explanation":"The term 'seneschalship' refers specifically to the office or position held by a seneschal, who was a high-ranking official in a royal court or noble household. It denotes the responsibilities and authority associated with that role.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["seneschal"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'seneschalship' is a relatively rare and specialized term, primarily encountered in historical or literary contexts dealing with medieval or feudal societies. It refers to the position or office of a seneschal, who was a high-ranking official in a royal court or noble household, responsible for managing the estate and representing the lord. Understanding this word requires familiarity with historical social structures and administrative roles.","priority":"★☆☆"},"example_sentences":[{"sentence":"The duties of the seneschalship included overseeing the finances and managing the staff.","translation":"家令職の職務には、財政の監督と職員の管理が含まれていた。","type":"general","meaning_category":"執事職"},{"sentence":"The inheritance of the seneschalship was a matter of great importance to the family.","translation":"家令職の相続は、その家族にとって非常に重要な問題だった。","type":"general","meaning_category":"家令職"}]}