{"word":"cardianeuria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学) 心臓神経症","english_definition":"(medicine) A nervous condition affecting the heart.","examples":[{"sentence":"The patient was diagnosed with cardianeuria after experiencing chest pain and anxiety.","translation":"患者は、胸痛と不安を経験した後、心臓神経症と診断されました。"}],"collocations":[],"synonyms":["cardiac neurosis","neurocirculatory asthenia"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'cardia' (heart) and 'neuria' (nervous condition).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌkɑːrdiəˈnjʊəriə/","syllables":"car-di-a-neu-ri-a"},"inflection":{"noun_plural":"cardianeurias"},"usage_notes":{"explanation":"Cardianeuria is an outdated term for a condition now typically referred to as cardiac neurosis or neurocirculatory asthenia. It describes a state where a person experiences symptoms mimicking heart disease, such as chest pain, palpitations, and shortness of breath, but without any underlying organic heart problem. The symptoms are primarily psychological in origin, often related to anxiety or stress.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor treated the cardianeuria with surgery.","correct":"✓ The doctor treated the cardianeuria with therapy and medication to manage anxiety.","note":"Cardianeuria (cardiac neurosis) is not a structural heart problem and is treated with psychological and pharmacological interventions, not surgery."}],"priority":"★☆☆"},"related_words":{"derivatives":["cardiac","neurosis","neurocirculatory","asthenia"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - an outdated medical term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Cardianeuria' is a rare and somewhat archaic medical term. It refers to a condition where a person experiences symptoms similar to heart disease, but these symptoms are caused by psychological factors like anxiety rather than a physical problem with the heart. Because it's an older term, it's not commonly used in modern medicine."},"example_sentences":[{"sentence":"Although the term cardianeuria is rarely used today, it historically referred to patients with cardiac symptoms of psychological origin.","translation":"今日ではcardianeuriaという用語はめったに使用されませんが、歴史的には心理的な起源の心臓症状を持つ患者を指していました。","type":"general","meaning_category":"definition"}]}