{"word":"precolluding","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(rare) to collude in advance; to secretly cooperate or conspire before an event or action.","english_definition":"To collude before something happens; to engage in secret cooperation or conspiracy ahead of time.","examples":[{"sentence":"The companies were accused of precolluding to fix prices before the auction.","translation":"その企業は、オークション前に価格を操作するために事前に共謀したとして告発された。"},{"sentence":"It's difficult to prove that the politicians were precolluding, but the evidence suggests a coordinated effort.","translation":"政治家たちが事前に共謀していたことを証明するのは難しいが、証拠は組織的な努力を示唆している。"}],"collocations":["precolluding to fix prices","precolluding to rig an election","precolluding with competitors"],"synonyms":["conspiring beforehand","secretly cooperating in advance","plotting ahead of time"],"antonyms":["acting independently","competing openly"]}],"etymology":{"value":"Formed by adding the prefix 'pre-' (before) to the verb 'colluding' (conspiring; cooperating secretly or illegally).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːkəˈluːdɪŋ/","syllables":"pre-col-lud-ing"},"inflection":{"verb_forms":{"present_simple":["precollude","precolludes"],"past_simple":"precolluded","past_participle":"precolluded","present_participle":"precolluding"}},"usage_notes":{"explanation":"'Precolluding' is a relatively rare and specialized term. It specifically refers to the act of colluding (secretly conspiring or cooperating) *before* a particular event or action takes place. It emphasizes the planning and coordination aspect of collusion that occurs in advance. It is often used in contexts involving business, politics, or legal matters where secret agreements or conspiracies are suspected.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The teams were precolluding during the game.","correct":"✓ The teams were colluding during the game.","note":"'Precolluding' implies the collusion happened *before* the event (the game). If the collusion is happening *during* the game, use 'colluding'."},{"incorrect":"✗ It's impossible to precollude the future.","correct":"✓ It's impossible to predict the future.","note":"'Precollude' refers to conspiring or cooperating secretly, not predicting. Use 'predict' for foretelling the future."}],"priority":"★★☆"},"related_words":{"derivatives":["precollusion (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (very rare, specialized vocabulary)","frequency_google_ngram":"Extremely rare. Not commonly found in general text.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Precolluding' is a specialized term used to describe the act of secretly cooperating or conspiring *before* a specific event or action. It is a relatively rare word, primarily used in legal, business, or political contexts where there is suspicion of advanced planning for illegal or unethical activities. Understanding this word requires familiarity with the base word 'collude' and the prefix 'pre-'. Its usage is typically limited to formal or technical discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The investigation revealed that several banks were precolluding to manipulate interest rates.","translation":"調査により、いくつかの銀行が金利を操作するために事前に共謀していたことが明らかになった。","type":"verb","meaning_category":"conspire in advance"},{"sentence":"Critics accused the companies of precolluding to stifle competition in the market.","translation":"批評家たちは、企業が市場での競争を抑制するために事前に共謀したと非難した。","type":"verb","meaning_category":"secretly cooperate beforehand"}]}