{"word":"Anglomane","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"イギリスかぶれの人、イギリス好き","english_definition":"a person who is excessively fond of English things, customs, etc.","examples":[{"sentence":"He is such an Anglomane that he only drinks English tea.","translation":"彼はイギリスかぶれなので、イギリスの紅茶しか飲まない。"},{"sentence":"The Anglomane decorated his house with British flags and memorabilia.","translation":"そのイギリスかぶれの人は、家をイギリスの国旗や記念品で飾った。"}],"collocations":["extreme Anglomane","self-confessed Anglomane"],"synonyms":["Anglophile"],"antonyms":["Anglophobe"],"notes":"Often used in a slightly negative or humorous way."}],"etymology":{"value":"From French 'Anglomane', from 'Anglo-' (referring to England) + '-mane' (mania, excessive enthusiasm).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæŋɡləˌmeɪn/","syllables":"An-glo-mane"},"inflection":{"noun_plural":"Anglomanes"},"usage_notes":{"explanation":"'Anglomane' refers to someone with an excessive enthusiasm for English culture, customs, or things. It is similar to 'Anglophile' but often carries a slightly more negative connotation, suggesting an almost obsessive admiration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an Anglomaniac.","correct":"✓ He is an Anglomane.","note":"The correct term is 'Anglomane', not 'Anglomaniac' (though the latter is sometimes used informally)."},{"incorrect":"✗ She is Anglomane for French culture.","correct":"✓ She is Anglomane for English culture.","note":"'Anglomane' specifically refers to a fondness for English, not French, culture."}],"priority":"★★☆"},"related_words":{"derivatives":["Anglomania (noun: excessive fondness for English things)"],"related_terms":["Anglophile (noun: a person who admires English things)","Anglophobe (noun: a person who dislikes English things)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Rare","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anglomane' is a relatively uncommon word used to describe someone with an excessive fondness for English culture. It is more specialized than 'Anglophile' and often carries a slightly negative or humorous connotation. Understanding this word requires familiarity with prefixes like 'Anglo-' and '-mane'."},"example_sentences":[{"sentence":"The museum curator, an avowed Anglomane, filled the exhibit with artifacts from the Victorian era.","translation":"その博物館の学芸員は、自称イギリスかぶれで、展示をビクトリア朝時代の工芸品で埋め尽くした。","type":"example","meaning_category":"general"},{"sentence":"Some critics dismissed his work as mere Anglomania, lacking originality and depth.","translation":"一部の批評家は彼の作品を、独創性と深みに欠ける単なるイギリスかぶれだと切り捨てた。","type":"example","meaning_category":"criticism"}]}