{"word":"exudatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"滲出性の、滲出液を伴う","english_definition":"Relating to or characterized by exudation; tending to exude.","examples":[{"sentence":"The patient presented with an exudatory rash.","translation":"患者は滲出性の発疹を呈した。"},{"sentence":"Exudatory lesions were observed on the skin.","translation":"皮膚に滲出性の病変が認められた。"}],"collocations":["exudatory inflammation (滲出性炎症)","exudatory dermatitis (滲出性皮膚炎)","exudatory effusion (滲出性滲出液)"],"synonyms":["oozing","discharging","secreting","weeping"],"antonyms":["dry","non-exudative"]}],"etymology":{"value":"From Latin 'exsudare' (to sweat out), from 'ex-' (out) + 'sudare' (to sweat).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪɡˈzjuːdəˌtɔːri/","syllables":"ex-u-da-to-ry"},"inflection":{"notes":"Adjective, comparative and superlative forms exist but are not commonly used (more exudatory, most exudatory)."},"usage_notes":{"explanation":"'Exudatory' is primarily a medical term used to describe conditions involving the leakage or discharge of fluid (exudate) from tissues or surfaces. It is often used in the context of inflammation, skin conditions, or other medical issues where fluid accumulation is present.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The wound was exudatory and painful. I put a dry bandage on it.","correct":"✓ The wound was exudatory and painful. I put an absorbent bandage on it.","note":"If a wound is exudatory, a dry bandage is not appropriate, as it won't absorb the fluid. An absorbent bandage is needed."}],"priority":"★☆☆"},"related_words":{"derivatives":["exudate (名詞: 滲出液)","exude (動詞: 滲出する)","exudation (名詞: 滲出)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Exudatory' is a technical term primarily used in medical contexts. It describes a condition characterized by the oozing or discharge of fluid (exudate). Understanding this term requires familiarity with medical terminology and concepts related to inflammation and fluid dynamics in the body."},"example_sentences":[{"sentence":"The doctor diagnosed the condition as exudatory pharyngitis.","translation":"医師はその状態を滲出性咽頭炎と診断した。","type":"medical","meaning_category":"滲出性"},{"sentence":"Chronic venous insufficiency can lead to exudatory skin changes.","translation":"慢性静脈不全は滲出性の皮膚変化を引き起こす可能性がある。","type":"medical","meaning_category":"滲出性"}]}