{"word":"bottle-soaking","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"The act of soaking bottles, typically to clean or sterilize them.","english_definition":"The process of immersing bottles in liquid, usually water or a cleaning solution, for a period of time.","examples":[{"sentence":"The brewery uses a special solution for bottle-soaking to ensure all bottles are thoroughly sanitized.","translation":"その醸造所では、すべてのボトルが完全に消毒されるように、ボトル浸漬に特別な溶液を使用しています。"},{"sentence":"After the party, bottle-soaking was necessary to remove the stubborn stains.","translation":"パーティーの後、頑固な汚れを取り除くためにボトル浸漬が必要でした。"}],"collocations":["bottle-soaking solution","bottle-soaking process","automated bottle-soaking"],"synonyms":["bottle washing","bottle cleaning","bottle sterilizing"],"antonyms":[]},{"part_of_speech":"adjective","definition":"Relating to or used for the soaking of bottles.","english_definition":"Describing something that pertains to the soaking of bottles.","examples":[{"sentence":"The bottle-soaking machine is a crucial part of the bottling line.","translation":"ボトル浸漬機は、ボトリングラインの重要な部分です。"},{"sentence":"We need to improve our bottle-soaking techniques to reduce water usage.","translation":"水の消費量を削減するために、ボトル浸漬技術を改善する必要があります。"}],"collocations":["bottle-soaking machine","bottle-soaking techniques","bottle-soaking equipment"],"synonyms":["bottle-washing","bottle-cleaning"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'bottle' (a container) and 'soaking' (the act of immersing in liquid).","priority":"N/A"},"pronunciation":{"ipa":"/ˈbɒtəlˌsoʊkɪŋ/","syllables":"bot-tle-soak-ing"},"inflection":{"noun_plural":"bottle-soakings"},"usage_notes":{"explanation":"'Bottle-soaking' is a compound term that specifically refers to the process of soaking bottles. It is commonly used in contexts such as brewing, bottling plants, and recycling facilities where bottles need to be thoroughly cleaned or sterilized.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ I am bottle soaking the dishes.","correct":"✓ I am soaking the bottles.","note":"'Bottle-soaking' specifically refers to soaking bottles, not general dishware."}],"priority":"N/A"},"related_words":{"derivatives":["soak","soaking","bottle"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The term 'bottle-soaking' is a specific compound term used to describe the process of soaking bottles in liquid, usually for cleaning or sterilization purposes. It is most commonly encountered in industrial or commercial settings, such as breweries or recycling plants, where large quantities of bottles are processed. The term is relatively straightforward to understand, but its usage is limited to specific contexts."},"example_sentences":[{"sentence":"The company invested in a new bottle-soaking system to improve efficiency.","translation":"会社は効率を改善するために新しいボトル浸漬システムに投資しました。","type":"noun","meaning_category":"Act of soaking bottles"},{"sentence":"The effectiveness of the bottle-soaking process is regularly tested.","translation":"ボトル浸漬プロセスの有効性は定期的にテストされています。","type":"noun","meaning_category":"Act of soaking bottles"},{"sentence":"The bottle-soaking solution needs to be changed every week.","translation":"ボトル浸漬液は毎週交換する必要があります。","type":"adjective","meaning_category":"Relating to soaking bottles"}]}