{"word":"Photopolymerization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"光重合：光照射によってモノマーが重合してポリマーを生成するプロセス","english_definition":"A process in which light causes the polymerization of monomers to form a polymer.","examples":[{"sentence":"Photopolymerization is used in various applications, including 3D printing and coatings.","translation":"光重合は、3Dプリンティングやコーティングなど、さまざまな用途で使用されています。"},{"sentence":"The rate of photopolymerization depends on the intensity of the light source.","translation":"光重合の速度は、光源の強度に依存します。"}],"collocations":["radical photopolymerization (ラジカル光重合)","cationic photopolymerization (カチオン光重合)","photopolymerization process (光重合プロセス)","UV photopolymerization (紫外線光重合)"],"synonyms":["light-induced polymerization","photoinitiated polymerization"],"antonyms":["thermal polymerization"]}],"etymology":{"value":"'photo-' (光) + 'polymerization' (重合) から構成される。","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌfoʊtoʊpəˌlɪmərɪˈzeɪʃən/","syllables":"pho-to-po-ly-mer-i-za-tion"},"inflection":{"noun_plural":"Photopolymerizations"},"usage_notes":{"explanation":"Photopolymerization is a chemical process where light is used to initiate the polymerization of monomers. This process is commonly used in applications such as 3D printing (stereolithography), coatings, adhesives, and dental materials. The reaction typically involves a photoinitiator that absorbs light and generates reactive species (radicals or ions) that trigger the polymerization reaction.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Photopolymerisation is a type of polymerization which uses heat.","correct":"✓ Photopolymerization is a type of polymerization which uses light.","note":"Photopolymerization uses light, not heat, to initiate the polymerization process."}],"priority":"☆☆☆"},"related_words":{"derivatives":["photopolymer (光重合体)","photoinitiator (光開始剤)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"Photopolymerization is a technical term referring to a chemical process where light initiates the formation of polymers from monomers. It is commonly encountered in scientific and engineering contexts, particularly in fields like materials science, chemistry, and manufacturing. Understanding this term requires familiarity with basic concepts of polymer chemistry and the role of light in chemical reactions."},"example_sentences":[{"sentence":"The 3D printer uses photopolymerization to create objects layer by layer.","translation":"その3Dプリンターは、光重合を使用してオブジェクトを一層ずつ作成します。","type":"general","meaning_category":"光重合の応用"},{"sentence":"The efficiency of the photopolymerization process is crucial for industrial applications.","translation":"光重合プロセスの効率は、産業用途にとって非常に重要です。","type":"technical","meaning_category":"光重合の重要性"}]}