{"word":"pseudometamerism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学) 偽メタメリズム、不完全なメタメリズム: 体節構造が外見上は存在するものの、内部構造や発生過程において真のメタメリズムの条件を満たさない状態。","english_definition":"(biology) A condition resembling metamerism, but lacking the full characteristics of true metamerism; apparent segmentation that does not correspond to true metameric organization in terms of internal structure or developmental origin.","examples":[{"sentence":"Some annelids exhibit pseudometamerism, where the external segmentation does not match the internal organ arrangement.","translation":"環形動物の中には、外見上の体節構造が内部器官の配置と一致しない偽メタメリズムを示すものがいる。"},{"sentence":"The segmentation in tapeworms is often considered pseudometamerism because each segment is not a true metamere.","translation":"条虫の体節構造は、各体節が真のメタメアではないため、しばしば偽メタメリズムとみなされる。"}],"collocations":["exhibit pseudometamerism (偽メタメリズムを示す)","true metamerism vs. pseudometamerism (真のメタメリズムと偽メタメリズム)","evolution of pseudometamerism (偽メタメリズムの進化)"],"synonyms":["false metamerism","apparent segmentation"],"antonyms":["true metamerism","metamerism"]},{"part_of_speech":"noun","definition":"(鉱物学) 鉱物の擬似メタミクト化: 鉱物が放射線損傷などにより非晶質化する現象で、外見は結晶構造を保っているように見えるものの、実際には結晶構造が破壊されている状態。","english_definition":"(mineralogy) A state in which a mineral appears crystalline but has lost its true crystalline structure due to radiation damage or other factors, resulting in an amorphous state.","examples":[{"sentence":"Zircon can exhibit pseudometamerism due to the incorporation of radioactive elements.","translation":"ジルコンは、放射性元素を取り込むことによって擬似メタミクト化を示すことがある。"},{"sentence":"The pseudometamerism in some minerals can be detected using X-ray diffraction techniques.","translation":"一部の鉱物における擬似メタミクト化は、X線回折法を用いて検出することができる。"}],"collocations":["pseudometamerism in zircon (ジルコンにおける擬似メタミクト化)","radiation-induced pseudometamerism (放射線誘発性擬似メタミクト化)","detect pseudometamerism (擬似メタミクト化を検出する)"],"synonyms":["metamictization","amorphous state"],"antonyms":["crystalline state"]}],"etymology":{"value":"\"pseudo-\" (偽の) + \"metamerism\" (メタメリズム、体節構造) から構成される。生物学においては、真のメタメリズムとは異なる、外見上の体節構造を指す。鉱物学においては、鉱物が結晶構造を失っているにもかかわらず、外見上は結晶構造を保っているように見える状態を指す。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊməˈtæmərɪzəm/","syllables":"pseu-do-me-tam-er-ism"},"inflection":{"notes":"名詞であり、複数形は \"pseudometamerisms\"。"},"usage_notes":{"explanation":"「**pseudometamerism**」は、生物学と鉱物学の分野で使用される専門用語です。生物学では、体節構造が外見上は存在するものの、内部構造や発生過程において真のメタメリズムの条件を満たさない状態を指します。鉱物学では、鉱物が放射線損傷などにより非晶質化する現象で、外見は結晶構造を保っているように見えるものの、実際には結晶構造が破壊されている状態を指します。それぞれの分野で意味が異なるため、文脈に応じて適切な意味を理解する必要があります。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The worm showed metamerism, but it was pseudometamerism.","correct":"✓ The worm showed apparent metamerism, but it was pseudometamerism.","note":"「metamerism」と「pseudometamerism」は区別されるべき概念であり、真のメタメリズムでないことを強調する場合は「apparent metamerism」を使用する。"},{"incorrect":"✗ Pseudometamerism is a type of true metamerism.","correct":"✓ Pseudometamerism is not a type of true metamerism.","note":"「pseudometamerism」は「true metamerism」ではない。"}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudometameric (形容詞: 偽メタメリズムの)","metamerism (名詞: メタメリズム、体節構造)","metamere (名詞: メタメア、体節)","amorphous (形容詞: 非晶質の)","crystalline (形容詞: 結晶質の)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門分野でのみ使用される用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**pseudometamerism**」は、生物学や鉱物学で使われる専門的な言葉です。生物学では、体の構造が繰り返し現れるように見えるけれど、本当の意味での繰り返し構造（メタメリズム）ではない状態を指します。例えば、ミミズのように見えるけれど、体の内部構造が完全に同じ繰り返しではない場合に使われます。鉱物学では、鉱物が放射線などの影響で結晶構造を失っているのに、見た目は結晶の形を保っている状態を指します。どちらの場合も、「偽の」「見せかけの」という意味合いが含まれています。専門的な文脈以外ではほとんど使われません。"},"example_sentences":[{"sentence":"The tapeworm's segmentation is an example of **pseudometamerism**, as the segments are primarily for reproduction.","translation":"条虫の体節構造は、各体節が主に生殖に関与しているため、偽メタメリズムの例である。","type":"noun","meaning_category":"生物学"},{"sentence":"The **pseudometamerism** observed in the mineral was caused by long-term exposure to alpha radiation.","translation":"その鉱物に見られた擬似メタミクト化は、長期間のアルファ線照射によって引き起こされた。","type":"noun","meaning_category":"鉱物学"}]}