{"word":"Columnea","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"コルムネア属（イワタバコ科の植物の属）","english_definition":"A genus of epiphytic plants in the flowering plant family Gesneriaceae, native to tropical America.","examples":[{"sentence":"The Columnea plant is known for its trailing stems and brightly colored flowers.","translation":"コルムネア属の植物は、その垂れ下がる茎と鮮やかな色の花で知られています。"}],"synonyms":["goldfish plant","flying goldfish plant"],"antonyms":[]}],"etymology":{"value":"Named after Fabio Colonna (also known as Fabius Columnus), a 16th-century Italian botanist.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈlʌmniə/","syllables":"co-lum-ne-a"},"inflection":{"noun_plural":"Columneas"},"usage_notes":{"explanation":"Columnea is primarily used as a botanical term. In general conversation, it would be used when specifically discussing plants of this genus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a columnea in my garden.","correct":"✓ I have a Columnea in my house.","note":"Columneas are typically grown indoors, not in gardens, due to their epiphytic nature and sensitivity to cold temperatures."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["Gesneriaceae (イワタバコ科)","epiphyte (着生植物)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Columnea' is a technical term used in botany and horticulture. It is unlikely to be encountered in general conversation unless discussing specific plant species. Understanding requires familiarity with botanical nomenclature.","priority":"★★☆"},"example_sentences":[{"sentence":"The hanging basket was overflowing with a beautiful Columnea plant.","translation":"ハンギングバスケットは美しいコルムネア属の植物で溢れていました。","type":"noun","meaning_category":"植物の属"},{"sentence":"Different species of Columnea have varying flower colors, ranging from red to orange and yellow.","translation":"コルムネア属の異なる種は、赤からオレンジ、黄色まで、さまざまな花の色を持っています。","type":"noun","meaning_category":"植物の属"}]}