{"word":"SDR","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Special Drawing Rights) 特別引出権","english_definition":"(Special Drawing Rights) An international reserve asset created by the International Monetary Fund (IMF) to supplement the official reserves of member countries.","examples":[{"sentence":"The value of the SDR is based on a basket of five currencies.","translation":"SDRの価値は、5つの通貨のバスケットに基づいている。"},{"sentence":"The IMF allocates SDRs to member countries in proportion to their quotas.","translation":"IMFは、加盟国のクォータに比例してSDRを割り当てる。"}],"collocations":["SDR allocation (SDR割当)","SDR value (SDR価値)","IMF SDR (IMF特別引出権)"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(Software-Defined Radio) ソフトウェア無線","english_definition":"(Software-Defined Radio) A radio communication system where components that have been typically implemented in hardware (e.g. mixers, filters, amplifiers, modulators/demodulators, detectors, etc.) are instead implemented by means of software on a personal computer or embedded system.","examples":[{"sentence":"SDR technology allows for flexible radio configurations.","translation":"SDR技術は、柔軟な無線構成を可能にする。"},{"sentence":"He used an SDR to listen to amateur radio frequencies.","translation":"彼はSDRを使ってアマチュア無線の周波数を聴いた。"}],"collocations":["SDR receiver (SDR受信機)","SDR transceiver (SDRトランシーバー)","SDR software (SDRソフトウェア)"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(Sales Development Representative) Sales Development Representative","english_definition":"A Sales Development Representative (SDR) is a sales professional focused on outbound prospecting. They qualify leads and set up meetings for account executives.","examples":[{"sentence":"The SDR's main responsibility is to generate qualified leads.","translation":"SDRの主な責任は、質の高い見込み客を発掘することです。"},{"sentence":"Our company is hiring SDRs to expand our sales team.","translation":"当社は営業チームを拡大するためにSDRを募集しています。"}],"collocations":["Outbound SDR","Inbound SDR","SDR team"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Acronym for Special Drawing Rights or Software-Defined Radio or Sales Development Representative.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛs ˌdiː ˈɑːr/","syllables":"ES-DEE-AR"},"inflection":{"notes":"Noun, plural SDRs"},"usage_notes":{"explanation":"SDR has multiple meanings depending on the context. It is important to understand the context to determine the correct meaning. Special Drawing Rights refers to an international reserve asset. Software-Defined Radio refers to a radio communication system implemented in software. Sales Development Representative refers to a sales role focused on prospecting.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"Unknown","text":"SDR is an acronym with multiple meanings. The meaning depends on the context. It can refer to Special Drawing Rights (finance), Software-Defined Radio (technology), or Sales Development Representative (business)."},"example_sentences":[{"sentence":"The IMF uses SDRs to supplement member countries' reserves.","translation":"IMFは、SDRを使って加盟国の準備金を補完する。","type":"noun","meaning_category":"Special Drawing Rights"},{"sentence":"An SDR can be used to receive various radio signals.","translation":"SDRは、様々な無線信号を受信するために使用できる。","type":"noun","meaning_category":"Software-Defined Radio"},{"sentence":"The SDR contacted potential clients to schedule product demos.","translation":"SDRは見込み客に連絡を取り、製品デモのスケジュールを調整した。","type":"noun","meaning_category":"Sales Development Representative"}]}