{"word":"Perceivability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"知覚可能性、認識可能性、認知可能性","english_definition":"The quality or state of being perceivable; the extent to which something can be noticed or understood.","examples":[{"sentence":"The perceivability of the warning signs was poor due to the dim lighting.","translation":"薄暗い照明のため、警告標識の知覚可能性は低かった。"},{"sentence":"Improving the perceivability of the user interface is crucial for accessibility.","translation":"ユーザーインターフェースの認識可能性を向上させることは、アクセシビリティにとって非常に重要です。"},{"sentence":"The artist focused on enhancing the perceivability of subtle details in the painting.","translation":"その芸術家は、絵画の微妙な細部の認知可能性を高めることに焦点を当てました。"}],"collocations":["enhance perceivability (知覚可能性を高める)","improve perceivability (認識可能性を改善する)","poor perceivability (低い知覚可能性)","high perceivability (高い知覚可能性)","affect perceivability (知覚可能性に影響を与える)"],"synonyms":["noticeability","visibility","detectability","discernibility","comprehensibility","understandability"],"antonyms":["imperceptibility","invisibility","undetectability","incomprehensibility","obscurity"]}],"etymology":{"value":"Derived from the verb 'perceive' (to become aware of something through the senses) and the suffix '-ability' (denoting the capacity or quality of being able to do something or be done).","priority":"★★☆"},"pronunciation":{"ipa":"/pərˌsiːvəˈbɪləti/","syllables":"per-ceiv-a-bil-i-ty"},"inflection":{"noun_plural":"Perceivabilities (rarely used)"},"usage_notes":{"explanation":"'Perceivability' refers to how easily something can be noticed or understood. It is often used in contexts related to design, accessibility, and communication, where the goal is to ensure that information is clear and readily apparent to the intended audience. The term emphasizes the importance of making elements easily detectable through the senses or cognitive processes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The perceivability of the sound was very loud.","correct":"✓ The audibility of the sound was very high.","note":"'Perceivability' is a general term for being noticed. For sound, 'audibility' is more appropriate."},{"incorrect":"✗ The perceivability of the concept was very difficult.","correct":"✓ The comprehensibility of the concept was very low.","note":"For abstract concepts, 'comprehensibility' or 'understandability' is more fitting than 'perceivability'."}],"priority":"★★☆"},"related_words":{"derivatives":["perceivable (adjective: 知覚可能な、認識可能な)","perceive (verb: 知覚する、認識する)","perception (noun: 知覚、認識)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Perceivability' is a relatively advanced term that refers to how easily something can be noticed or understood. It's often used in technical or academic contexts, particularly in fields like design, accessibility, and psychology. The word emphasizes the quality of being easily sensed or cognitively processed. If something has high perceivability, it's easy to see, hear, or understand. If it has low perceivability, it's difficult to notice or comprehend."},"example_sentences":[{"sentence":"The perceivability of the text on the website was increased by using a larger font size.","translation":"ウェブサイト上のテキストの認識可能性は、より大きなフォントサイズを使用することで向上しました。","type":"noun","meaning_category":"認識可能性"},{"sentence":"The study examined the perceivability of different types of visual stimuli.","translation":"その研究では、さまざまな種類の視覚刺激の知覚可能性を調査しました。","type":"noun","meaning_category":"知覚可能性"},{"sentence":"The low perceivability of the hazard made it dangerous for pedestrians.","translation":"その危険の認知可能性が低かったため、歩行者にとって危険でした。","type":"noun","meaning_category":"認知可能性"}]}