{"word":"trust-controlling","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"信頼を操作する、信頼をコントロールする","english_definition":"Describes something or someone that manipulates or controls the trust of others.","examples":[{"sentence":"The trust-controlling tactics of the corporation were exposed in the documentary.","translation":"その企業の信頼を操作する戦術がドキュメンタリーで暴露された。"},{"sentence":"He was accused of trust-controlling behavior within the organization.","translation":"彼は組織内で信頼をコントロールするような行動をとったと非難された。"}],"collocations":["trust-controlling behavior","trust-controlling tactics","trust-controlling measures"],"synonyms":["manipulative","deceptive","controlling"],"antonyms":["honest","transparent","trustworthy"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'trust' (belief in the reliability, truth, ability, or strength of someone or something) and 'controlling' (exercising restraint or direction over; dominating).","priority":"★★★"},"pronunciation":{"ipa":"/ˈtrʌst kənˌtroʊlɪŋ/","syllables":"trust-con-trol-ling"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more trust-controlling, most trust-controlling), although these are less common."},"usage_notes":{"explanation":"'Trust-controlling' is a relatively uncommon term, often used in contexts where there is a deliberate attempt to manipulate or manage the trust of others, typically for personal or organizational gain. It carries a negative connotation, suggesting unethical or manipulative practices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The trust-controlling person is always honest.","correct":"✓ A trust-controlling person is rarely honest.","note":"Trust-controlling implies manipulation, so it's contradictory to associate it with honesty."}],"priority":"★★☆"},"related_words":{"derivatives":["trust","controlling","control","manipulation"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'trust-controlling' is complex and not commonly used. It describes actions or strategies aimed at manipulating or dominating the trust of others. This term is typically found in discussions about ethics, manipulation, or organizational behavior, and its understanding requires a high level of English proficiency."},"example_sentences":[{"sentence":"The politician's speech was filled with trust-controlling rhetoric designed to sway public opinion.","translation":"その政治家の演説は、世論を操作するために信頼をコントロールするようなレトリックで満ちていた。","type":"adjective","meaning_category":"manipulative"},{"sentence":"The company implemented trust-controlling measures to ensure customer loyalty.","translation":"その会社は顧客の忠誠心を確保するために、信頼をコントロールするような対策を実施した。","type":"adjective","meaning_category":"manipulative"}]}