{"word":"challengee","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"挑戦を受ける人、挑戦された人","english_definition":"A person who is challenged, especially in a competition or contest.","examples":[{"sentence":"The champion is ready to face any challengee.","translation":"チャンピオンはどんな挑戦者でも受けて立つ準備ができている。"},{"sentence":"The challengee must prove their skills to win.","translation":"挑戦を受けた人は勝つために自分のスキルを証明しなければならない。"},{"sentence":"In this debate, the challengee will have the opportunity to respond.","translation":"この討論会では、挑戦を受けた人が答える機会が与えられる。"}],"collocations":["face a challengee (挑戦者と対峙する)","defeat a challengee (挑戦者を打ち負かす)","the incumbent and the challengee (現職者と挑戦者)"],"synonyms":["opponent","competitor","contender"],"antonyms":["challenger"],"notes":"Often used in the context of elections, sports, or intellectual debates.","priority":"★★★"}],"etymology":{"value":"Derived from the verb 'challenge' by adding the suffix '-ee', indicating the recipient of the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtʃælənˈdʒiː/","syllables":"chal-len-gee"},"inflection":{"noun_plural":"challengees"},"usage_notes":{"explanation":"'Challengee' is a relatively uncommon word, but it is useful for clearly identifying the person who is being challenged. It is most often used in formal contexts or when it is important to distinguish between the person issuing the challenge (the challenger) and the person receiving it (the challengee).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is the challenger of the champion.","correct":"✓ He is the challengee of the champion.","note":"Incorrect use of 'challenger' instead of 'challengee'. 'Challenger' is the one issuing the challenge, not receiving it."}],"priority":"★☆☆"},"related_words":{"derivatives":["challenge (verb, noun)","challenger (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'challengee' is a specialized term primarily used in formal contexts such as legal, political, or competitive settings. It refers specifically to the individual or entity being challenged. Due to its limited usage and formal nature, it is more likely to be encountered in advanced reading materials or professional discussions. Understanding its meaning is crucial in contexts where distinguishing between the initiator and the recipient of a challenge is necessary."},"example_sentences":[{"sentence":"The incumbent senator prepared for a debate against their challengee.","translation":"現職の上院議員は、挑戦を受けた相手との討論会の準備をした。","type":"general","meaning_category":"politics"},{"sentence":"As the challengee, she had the burden of proof to defend her title.","translation":"挑戦を受けた側として、彼女は自分のタイトルを守るための立証責任があった。","type":"general","meaning_category":"sports"},{"sentence":"The challengee presented a strong counter-argument during the academic competition.","translation":"挑戦を受けた側は、学術コンテストで強力な反論を提示した。","type":"general","meaning_category":"academics"}]}