{"word":"militancies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"好戦性、戦闘性、過激主義","english_definition":"The quality or state of being militant; aggressive or combative behavior or attitude.","examples":[{"sentence":"The rise of political militancies is a cause for concern.","translation":"政治的過激主義の台頭は懸念の原因である。"},{"sentence":"Union militancies were common during the labor disputes.","translation":"労働争議の間、労働組合の戦闘性は一般的だった。"}],"collocations":["political militancies (政治的過激主義)","union militancies (労働組合の戦闘性)","religious militancies (宗教的過激主義)"],"synonyms":["aggressiveness","belligerence","combative spirit","extremism","radicalism"],"antonyms":["pacifism","nonviolence","peacefulness","moderation"]}],"etymology":{"value":"Derived from 'militant,' which comes from the Latin word 'militans,' the present participle of 'militare,' meaning 'to serve as a soldier.' The suffix '-ancy' denotes a state or quality.","priority":"★★★"},"pronunciation":{"ipa":"ˈmɪlɪtənsiz","syllables":"mil-i-tan-cies"},"inflection":{"noun_plural":"militancies"},"usage_notes":{"explanation":"'Militancies' refers to instances or expressions of militant behavior, attitudes, or actions. It often implies a readiness or willingness to use aggressive or combative tactics to achieve a goal or promote a cause. The term is often used in political, social, or religious contexts to describe movements or ideologies characterized by extremism or radicalism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The militancy is increasing in the region.","correct":"The militancy is increasing in the region. (uncountable) / Militant acts are increasing in the region.","note":"'Militancy' can be used as an uncountable noun to refer to the general state of being militant. 'Militancies' (plural) refers to specific instances or expressions of militant behavior."}],"priority":"★★☆"},"related_words":{"derivatives":["militant (adjective, noun)","militantly (adverb)"],"phrases":["armed militancy","violent militancy"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Militancies' is a term used to describe instances of aggressive or combative behavior, often in the context of political, social, or religious movements. It implies a willingness to use extreme or radical tactics to achieve a goal. The word is more commonly used in academic or journalistic contexts when discussing conflict, extremism, or social unrest."},"example_sentences":[{"sentence":"The government is trying to suppress various forms of militancies.","translation":"政府はさまざまな形態の過激主義を抑圧しようとしている。","type":"general","meaning_category":"過激主義"},{"sentence":"Historical analysis reveals patterns of militancies during periods of social upheaval.","translation":"歴史的分析は、社会的激変の時期における戦闘性のパターンを明らかにする。","type":"academic","meaning_category":"戦闘性"},{"sentence":"The report detailed the rise of religious militancies in the region.","translation":"報告書は、その地域における宗教的過激主義の台頭を詳述した。","type":"journalistic","meaning_category":"過激主義"}]}