{"word":"land-visiting","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に日本で)上陸観光、陸地観光","english_definition":"(mainly in Japan) sightseeing on land, especially when arriving by ship; land-based tourism.","examples":[{"sentence":"The cruise ship offered a land-visiting tour of Kyoto.","translation":"そのクルーズ船は京都の陸地観光ツアーを提供した。"},{"sentence":"Many tourists prefer land-visiting to staying on the ship.","translation":"多くの観光客は船に留まるよりも陸地観光を好む。"}],"collocations":["land-visiting tour (上陸観光ツアー)","land-visiting permit (上陸観光許可)"],"synonyms":["shore excursion","land tour"],"antonyms":["sea tour","cruise"],"notes":"This term is often used in the context of cruise ships and tourism in Japan, referring to excursions onto the land from a ship."}],"etymology":{"value":"A compound word formed from 'land' (referring to the earth or ground) and 'visiting' (the act of going to see a place). The specific use in tourism contexts likely developed with the growth of cruise ship travel.","priority":"★☆☆"},"pronunciation":{"ipa":"ˈlændˌvɪzɪtɪŋ","syllables":"land-vis-it-ing"},"inflection":{"noun_plural":"land-visitings"},"usage_notes":{"explanation":"'Land-visiting' is a relatively specific term, primarily used in the Japanese tourism industry to describe excursions from cruise ships onto the mainland. It emphasizes the aspect of exploring the land, as opposed to staying on the ship or engaging in sea-based activities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to land-visiting yesterday.","correct":"✓ I went on a land-visiting tour yesterday.","note":"'Land-visiting' is typically used as an adjective or part of a compound noun (e.g., 'land-visiting tour') rather than as a standalone verb or activity. To describe the action of going sightseeing on land, it's better to use phrases like 'went on a land tour' or 'went sightseeing on land'."}],"priority":"★☆☆"},"related_words":{"derivatives":["land (noun)","visit (verb, noun)","visiting (adjective)"],"broader_terms":["tourism","excursion","sightseeing"],"narrower_terms":["shore excursion","day trip"],"related_concepts":["cruise ship","port of call","tourist visa"]},"level_frequency":{"CEFR":"N/A (specific term)","frequency_google_ngram":"Low frequency (specific term)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Land-visiting' is a specialized term primarily used in the context of cruise ship tourism, especially in Japan. It refers to the activity of tourists going on excursions to explore the land after arriving by ship. While not a common word in everyday English, it's useful to understand in the context of travel and tourism, particularly when discussing cruise itineraries or shore excursions. It's often used to differentiate between activities on land and activities on the ship or at sea."},"example_sentences":[{"sentence":"The land-visiting options in Nagasaki included historical sites and gardens.","translation":"長崎での上陸観光の選択肢には、史跡や庭園が含まれていた。","type":"noun","meaning_category":"上陸観光"},{"sentence":"A land-visiting permit is required for some nationalities to disembark in Japan.","translation":"一部の国籍の人が日本で下船するには、上陸観光許可が必要です。","type":"noun","meaning_category":"上陸観光"}]}