{"word":"DNCRI","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学) デオキシヌクレオシド誘導体耐性細胞 (Deoxynucleoside Derivative-Resistant cells)","english_definition":"(Medicine) Deoxynucleoside Derivative-Resistant cells. A type of cell that exhibits resistance to deoxynucleoside derivatives.","examples":[{"sentence":"DNCRI cells were observed to have increased expression of certain genes.","translation":"DNCRI細胞は特定の遺伝子の発現が増加していることが観察された。"},{"sentence":"The mechanism of resistance in DNCRI cells is under investigation.","translation":"DNCRI細胞における耐性メカニズムが研究されている。"}],"collocations":["DNCRI cell line","DNCRI resistance mechanism","study of DNCRI cells"],"synonyms":["Deoxynucleoside Derivative-Resistant cells"],"antonyms":[]}],"etymology":{"value":"An acronym formed from the initial letters of 'Deoxynucleoside Derivative-Resistant'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdiːˌɛnˌsiːˌɑːrˈaɪ/","syllables":"dee-en-cee-ar-eye"},"inflection":{},"usage_notes":{"explanation":"'DNCRI' is a highly specialized term used primarily within the fields of medicine, biochemistry, and cell biology. It refers specifically to cells that have developed resistance to deoxynucleoside derivatives, which are often used in cancer therapies or antiviral treatments. The term is most commonly found in research papers, scientific publications, and technical discussions among experts in these fields.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["Deoxynucleoside","Drug resistance","Cancer cell","Cell line"]},"level_frequency":{"CEFR":"N/A (Specialized term)","frequency_google_ngram":"Very low frequency (Specialized term)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'DNCRI' is a technical acronym used in specialized medical and scientific contexts. Understanding this term requires advanced knowledge of cell biology, biochemistry, and pharmacology. It's typically encountered in research papers and scientific discussions related to drug resistance in cells. The full form, 'Deoxynucleoside Derivative-Resistant,' provides more context but still requires specialized knowledge to fully comprehend the concept."},"example_sentences":[{"sentence":"The researchers aimed to characterize the metabolic profile of DNCRI cells.","translation":"研究者たちは、DNCRI細胞の代謝プロファイルを特徴づけることを目指した。","type":"noun","meaning_category":"Medical research"},{"sentence":"DNCRI cells often exhibit altered DNA repair mechanisms.","translation":"DNCRI細胞は、しばしば変化したDNA修復メカニズムを示す。","type":"noun","meaning_category":"Cell biology"}]}