{"word":"target-shy","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(人や組織が)目標達成を避ける、目標設定に消極的な","english_definition":"Reluctant to set or pursue specific targets or goals, often due to fear of failure or accountability.","examples":[{"sentence":"The company's target-shy approach to sales quotas led to inconsistent performance.","translation":"その会社の目標設定に消極的な営業ノルマへの取り組みは、業績の不安定さにつながった。"},{"sentence":"He was a target-shy manager, preferring to maintain the status quo rather than risk ambitious projects.","translation":"彼は目標設定に消極的なマネージャーで、野心的なプロジェクトにリスクを冒すよりも現状維持を好んだ。"},{"sentence":"A target-shy organization can stagnate and lose its competitive edge.","translation":"目標設定に消極的な組織は、停滞し、競争力を失う可能性がある。"}],"collocations":["target-shy company","target-shy manager","target-shy approach","target-shy culture","become target-shy","remain target-shy"],"synonyms":["goal-averse","risk-averse","unambitious","non-committal","evasive","hesitant","reluctant"],"antonyms":["goal-oriented","ambitious","target-driven","results-oriented","proactive","aggressive"]},{"part_of_speech":"adjective","definition":"(システムや技術が)目標を正確に狙うことが苦手な、照準が甘い","english_definition":"(Of a system or technology) Not accurate or precise in hitting targets; having poor aim.","examples":[{"sentence":"The missile system was described as target-shy, often missing its intended destination.","translation":"そのミサイルシステムは、目標を正確に狙うことが苦手で、しばしば意図した目的地を外すと評された。"},{"sentence":"Early versions of the software were target-shy, producing inaccurate results.","translation":"そのソフトウェアの初期バージョンは、目標を正確に狙うことが苦手で、不正確な結果を生み出した。"}],"collocations":["target-shy missile","target-shy system","target-shy software","target-shy technology","demonstrate target-shyness"],"synonyms":["inaccurate","imprecise","unreliable","erratic","off-target","poorly aimed"],"antonyms":["accurate","precise","reliable","on-target","well-aimed"]}],"etymology":{"value":"A compound word formed by combining \"target\" (a goal or aim) and \"shy\" (reluctant or avoiding). The term implies an aversion or reluctance towards setting or achieving targets.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɑːrɡɪt ʃaɪ/","syllables":"tar-get-shy"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Target-shy\" describes a reluctance or avoidance of setting or pursuing specific goals. This can apply to individuals, organizations, or even technologies. When applied to people or organizations, it often indicates a fear of failure or accountability. When applied to systems or technologies, it describes a lack of precision or accuracy in hitting targets. The term is often used in business, management, and technology contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company was target shy.","correct":"✓ The company was target-shy.","note":"The word is a compound adjective and should be hyphenated. "},{"incorrect":"✗ He is target-shyness.","correct":"✓ He is target-shy.","note":"\"Target-shy\" is an adjective, not a noun. To express the quality of being target-shy as a noun, you could use \"a target-shy approach\" or \"target shyness\"."}],"priority":"★★☆"},"related_words":{"derivatives":["target shyness (noun: 目標設定を避けること、目標設定への消極性)"],"synonyms":["goal-averse","risk-averse","unambitious","non-committal","evasive","hesitant","reluctant"],"antonyms":["goal-oriented","ambitious","target-driven","results-oriented","proactive","aggressive"],"related_terms":["goal setting","performance management","accountability","risk aversion","strategic planning"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Relatively uncommon, but used in specific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Target-shy\" is a term used to describe a person, organization, or system that avoids setting or pursuing specific targets or goals. This avoidance can stem from a fear of failure, a lack of ambition, or a desire to avoid accountability. When used to describe a technology or system, it indicates a lack of precision or accuracy in hitting targets. The term is most commonly found in business, management, and technology contexts, and its meaning can be inferred from the combination of \"target\" and \"shy.\""},"example_sentences":[{"sentence":"The new CEO aimed to address the target-shy culture that had developed within the company.","translation":"新しいCEOは、社内に蔓延していた目標設定に消極的な文化に対処することを目指した。","type":"adjective","meaning_category":"目標達成を避ける"},{"sentence":"The missile defense system was criticized for being target-shy during the simulated attack.","translation":"そのミサイル防衛システムは、模擬攻撃中に目標を正確に狙うことが苦手であると批判された。","type":"adjective","meaning_category":"照準が甘い"}]}