{"word":"Un-wordsworthian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ワーズワース的でない、ワーズワースの作風や思想に反する","english_definition":"Not characteristic of or resembling the style, themes, or ideas of William Wordsworth.","examples":[{"sentence":"The poem's urban setting and cynical tone are decidedly un-Wordsworthian.","translation":"その詩の都会的な舞台設定とシニカルな口調は、明らかにワーズワース的ではない。"},{"sentence":"His later works became increasingly un-Wordsworthian in their focus on social issues.","translation":"彼の後期の作品は、社会問題に焦点を当てるにつれて、ますますワーズワース的ではなくなった。"}],"collocations":["un-Wordsworthian style","un-Wordsworthian themes","un-Wordsworthian sentiment"],"synonyms":["anti-Wordsworthian","non-Wordsworthian"],"antonyms":["Wordsworthian"]},{"part_of_speech":"adjective","definition":"ワーズワースが好みそうにない、ワーズワースが認めないであろう","english_definition":"Not in accordance with the tastes or principles of William Wordsworth.","examples":[{"sentence":"The modern city, with its noise and pollution, would be an un-Wordsworthian environment.","translation":"騒音と汚染に満ちた現代都市は、ワーズワースが好みそうにない環境だろう。"}],"collocations":["un-Wordsworthian environment","un-Wordsworthian subject matter"],"synonyms":["un-romantic","un-pastoral"],"antonyms":["Wordsworthian"]}],"etymology":{"value":"接頭辞 \"un-\" (否定) + Wordsworthian (ウィリアム・ワーズワースに関連する)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnˈwɜːrdzwɜːrθiən/","syllables":"Un-words-worth-i-an"},"inflection":{"adjective_forms":{"comparative":"more un-Wordsworthian","superlative":"most un-Wordsworthian"}},"usage_notes":{"explanation":"\"Un-Wordsworthian\" is used to describe something that contrasts with the typical style, themes, or values associated with the Romantic poet William Wordsworth. Wordsworth's poetry often celebrated nature, simple rural life, and profound emotional experiences. Therefore, something described as \"un-Wordsworthian\" might be urban, cynical, focused on social issues rather than nature, or lacking in emotional depth or spiritual reflection.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was very un-Wordsworthian, it had no trees.","correct":"✓ The painting was very un-Wordsworthian; it had no trees. / ✓ The painting was very un-Wordsworthian because it had no trees.","note":"When using \"un-Wordsworthian\" to describe something, ensure that the connection to Wordsworth's style or themes is clear. Use a semicolon or a conjunction like \"because\" to explain the contrast."}],"priority":"★★☆"},"related_words":{"derivatives":["Wordsworthian","Wordsworth","Wordsworthianism"],"related_terms":["Romanticism","Romantic poet","Nature poetry","Pastoral poetry"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized vocabulary related to literary criticism.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"Un-wordsworthian\" is a complex term primarily used in literary criticism. To understand it, one must first know about William Wordsworth, a famous Romantic poet known for his poems about nature, emotion, and the common person. Something \"Un-wordsworthian\" is the opposite of that – it doesn't fit with Wordsworth's style or ideas. It might be about cities instead of nature, or it might be cynical instead of emotional. This word is not common in everyday conversation, but it's useful when discussing literature or art that goes against Wordsworth's style."},"example_sentences":[{"sentence":"The gritty realism of the novel felt decidedly un-Wordsworthian.","translation":"その小説の生々しいリアリズムは、明らかにワーズワース的ではないと感じられた。","type":"adjective","meaning_category":"ワーズワース的でない"},{"sentence":"His later poems, with their political themes, were considered un-Wordsworthian by some critics.","translation":"彼の後期の詩は、その政治的なテーマのために、一部の批評家によってワーズワース的ではないと見なされた。","type":"adjective","meaning_category":"ワーズワース的でない"}]}