{"word":"Remittance","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"送金、送金額","english_definition":"A sum of money sent, especially by mail, in payment for goods or services or as a gift.","examples":[{"sentence":"He sends remittances to his family back home.","translation":"彼は故郷の家族に送金しています。"},{"sentence":"The country relies heavily on remittances from its workers abroad.","translation":"その国は海外労働者からの送金に大きく依存しています。"},{"sentence":"The remittance was made via online banking.","translation":"送金はオンラインバンキングを通じて行われました。"}],"collocations":["send a remittance","receive a remittance","family remittance","worker's remittance","overseas remittance","international remittance"],"synonyms":["money transfer","payment","transfer","wire transfer","funds transfer"],"antonyms":[]}],"etymology":{"value":"The word \"remittance\" comes from the Middle French word \"remettre,\" meaning \"to send back, transmit, refer, submit.\" This is derived from the Latin word \"remittere,\" which means \"to send back, relax, abate, forgive.\" The \"re-\" prefix means \"back,\" and \"mittere\" means \"to send.\"","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈmɪtəns/","syllables":"re-mit-tance"},"inflection":{"noun_plural":"Remittances"},"usage_notes":{"explanation":"\"Remittance\" refers to a sum of money that is sent, typically to another country, often by a foreign worker to their family. It is commonly used in the context of international finance and economics. The term emphasizes the act of sending money back to a recipient, often for support or payment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I received a remit.","correct":"✓ I received a remittance.","note":"\"Remit\" (verb) means to send money, whereas \"remittance\" (noun) is the actual money sent. Using \"remit\" as a noun is incorrect in this context."},{"incorrect":"✗ The remittance is very cheap.","correct":"✓ The remittance fee is very cheap.","note":"\"Remittance\" refers to the money being sent, not the cost of sending it. To refer to the cost, use \"remittance fee\" or \"transfer fee\"."},{"incorrect":"✗ He remitted a remittance.","correct":"✓ He sent a remittance.","note":"The verb form of sending money is \"remit,\" so you would \"send a remittance\"."}],"priority":"★★☆"},"related_words":{"derivatives":["remit (verb: to send money)","remitter (noun: one who sends money)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"remittance\" refers to money that is sent, often internationally, by someone working in a foreign country to their family back home. It's a common term in discussions about economics, migration, and international finance. You might see it in news articles or reports about developing countries that rely on money sent from workers abroad. It's important to use the word correctly as a noun, referring to the money itself, and not confuse it with the verb \"remit,\" which means to send the money."},"example_sentences":[{"sentence":"The country's economy benefits from the large inflow of remittances.","translation":"その国の経済は、多額の送金の流入から恩恵を受けています。","type":"noun","meaning_category":"送金"},{"sentence":"She uses the remittances to pay for her children's education.","translation":"彼女は送金を子供たちの教育費に充てています。","type":"noun","meaning_category":"送金"},{"sentence":"The government is working to reduce the cost of remittances.","translation":"政府は送金コストの削減に取り組んでいます。","type":"noun","meaning_category":"送金"}]}