{"word":"rebarbative","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"不快な、反発を覚える、忌まわしい","english_definition":"causing annoyance, irritation, or disgust; repellent.","examples":[{"sentence":"The movie's violence was rebarbative to many viewers.","translation":"その映画の暴力描写は多くの視聴者にとって不快だった。"},{"sentence":"His rebarbative personality made it difficult to work with him.","translation":"彼の反発を覚えるような性格のせいで、彼と働くのは困難だった。"},{"sentence":"The rebarbative smell of the factory permeated the neighborhood.","translation":"その工場の忌まわしい臭いが近所に染み渡った。"}],"collocations":["rebarbative personality","rebarbative behavior","rebarbative smell","rebarbative content"],"synonyms":["repellent","repulsive","disgusting","offensive","irritating","annoying","obnoxious","loathsome","abhorrent"],"antonyms":["attractive","appealing","pleasant","agreeable","delightful"]}],"etymology":{"value":"Late 19th century: from French rébarbatif, -ive, from rébarber ‘to bristle up, rebuff’, from re- (expressing intensive force) + barbe ‘beard’. The original sense was ‘bristling, rough’.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈbɑːrbətɪv/","syllables":"re-bar-ba-tive"},"inflection":{"adjective_forms":{"comparative":"more rebarbative","superlative":"most rebarbative"}},"usage_notes":{"explanation":"\"Rebarbative\" is a relatively uncommon word that describes something that causes strong dislike or aversion. It suggests a quality that is not merely unpleasant but actively repels or irritates. It is often used to describe aspects of personality, appearance, or content that are considered highly disagreeable. The word carries a stronger negative connotation than words like \"unpleasant\" or \"disagreeable.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rebarbative music made me feel calm.","correct":"✓ The rebarbative music made me feel agitated.","note":"\"Rebarbative\" implies a negative reaction, so it cannot be used to describe something that makes someone feel calm."},{"incorrect":"✗ He was rebarbative to her kindness.","correct":"✓ He was unresponsive to her kindness.","note":"\"Rebarbative\" describes the quality of something that causes aversion, not a person's reaction to something positive. Use \"unresponsive\" or \"unappreciative\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Rebarbative\" is a sophisticated word used to describe something extremely unpleasant or causing strong aversion. It suggests a quality that actively repels or irritates. It's not a commonly used word, so understanding its meaning can enhance comprehension of complex texts and nuanced expressions. It is more intense than simply saying something is \"unpleasant\" or \"disagreeable.\""},"example_sentences":[{"sentence":"The rebarbative architecture of the building clashed with the surrounding landscape.","translation":"その建物の不快な建築様式は周囲の景観と調和していなかった。","type":"adjective","meaning_category":"unpleasant"},{"sentence":"His rebarbative comments alienated many of his colleagues.","translation":"彼の反発を覚えるようなコメントは多くの同僚を遠ざけた。","type":"adjective","meaning_category":"offensive"},{"sentence":"The rebarbative nature of the subject matter made it difficult to study.","translation":"その主題の忌まわしい性質のせいで、勉強するのが困難だった。","type":"adjective","meaning_category":"disgusting"}]}