{"word":"unvitrified","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ガラス化されていない、陶化されていない","english_definition":"Not vitrified; not converted into glass or a glassy substance.","examples":[{"sentence":"The unvitrified clay remained porous.","translation":"その未ガラス化の粘土は多孔質のままでした。"},{"sentence":"Unvitrified ceramics are more susceptible to water damage.","translation":"未ガラス化のセラミックスは、水による損傷を受けやすい。"}],"collocations":["unvitrified clay","unvitrified ceramic","unvitrified material"],"synonyms":["nonvitrified","unglazed"],"antonyms":["vitrified","glazed"]}],"etymology":{"value":"\"un-\" (否定接頭辞) + \"vitrified\" (ガラス化した)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈvɪtrɪfaɪd/","syllables":"un-vit-ri-fied"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありますが、頻繁には使用されません。"},"usage_notes":{"explanation":"\"Unvitrified\" is used to describe materials, especially ceramics or clay, that have not undergone the process of vitrification. Vitrification is the process of converting a substance into a glassy or glass-like state, typically through high heat. Unvitrified materials are therefore more porous and less durable than their vitrified counterparts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The vitrified clay was unvitrified.","correct":"✓ The clay was not vitrified.","note":"Avoid double negatives. If something is not vitrified, simply state that it is not vitrified, rather than using \"unvitrified\" in a negative construction."}],"priority":"★★☆"},"related_words":{"derivatives":["vitrify (動詞: ガラス化する)","vitrification (名詞: ガラス化)","vitreous (形容詞: ガラス質の)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unvitrified\" is a technical term primarily used in the context of ceramics, materials science, and geology. It describes a substance that has not been transformed into a glassy or glass-like state through heating. Because it's a specialized term, it's not commonly encountered in everyday language. Understanding this word requires familiarity with the process of vitrification.","priority":"★★★"},"example_sentences":[{"sentence":"This type of unvitrified brick is not suitable for outdoor use in freezing climates.","translation":"この種の未ガラス化レンガは、寒冷地での屋外使用には適していません。","type":"adjective","meaning_category":"ガラス化されていない"},{"sentence":"The archaeologist discovered fragments of unvitrified pottery at the excavation site.","translation":"考古学者は発掘現場で未ガラス化の陶器の破片を発見しました。","type":"adjective","meaning_category":"陶化されていない"}]}