{"word":"lockpin","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(機械部品の)ロックピン、止めピン","english_definition":"A pin used to secure something in place, preventing movement or separation.","examples":[{"sentence":"The lockpin ensures the wheel stays securely attached.","translation":"ロックピンは車輪がしっかりと取り付けられた状態を保つことを保証します。"},{"sentence":"Always check the lockpin before operating the machinery.","translation":"機械を操作する前に必ずロックピンを確認してください。"}],"collocations":["safety lockpin","quick release lockpin","spring lockpin"],"synonyms":["fastener","cotter pin","detent pin","linchpin"],"antonyms":["(none commonly used)"]}],"etymology":{"value":"Derived from the combination of 'lock' (referring to securing or fastening) and 'pin' (a small, slender piece of metal or wood).","priority":"★★★"},"pronunciation":{"ipa":"/ˈlɒkˌpɪn/","syllables":"lock-pin"},"inflection":{"noun_plural":"lockpins"},"usage_notes":{"explanation":"A 'lockpin' is a specific type of pin designed to prevent unintended movement or separation of parts. It is commonly used in machinery, vehicles, and other equipment where secure fastening is critical. The term implies a higher degree of security compared to a simple pin.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Use a nail instead of a lockpin.","correct":"✓ Use a lockpin, not just a nail.","note":"A nail is not a suitable substitute for a lockpin because it does not provide the same level of secure fastening."},{"incorrect":"✗ The lockpin is optional.","correct":"✓ The lockpin is essential for safety.","note":"The lockpin is often a critical safety component and should not be considered optional."}],"priority":"★★☆"},"related_words":{"derivatives":["locking (adjective, noun)","pin (noun)"],"phrasal_verbs":["(none commonly used)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'lockpin' is a technical term, primarily used in engineering, mechanics, and related fields. Understanding its meaning requires some familiarity with mechanical components and fastening systems. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The mechanic replaced the worn-out lockpin on the brake caliper.","translation":"整備士はブレーキキャリパーの摩耗したロックピンを交換しました。","type":"noun","meaning_category":"mechanical part"},{"sentence":"Ensure the lockpin is properly seated to prevent accidental disengagement.","translation":"偶発的な離脱を防ぐために、ロックピンが適切に装着されていることを確認してください。","type":"noun","meaning_category":"mechanical part"}]}