{"word":"Equines","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ウマ科の動物（複数形）","english_definition":"Plural form of equine: Animals belonging to the family Equidae, which includes horses, zebras, and asses.","examples":[{"sentence":"The safari showcased a diverse range of African equines, including zebras and wild asses.","translation":"そのサファリでは、シマウマや野生のロバなど、多様なアフリカのウマ科動物が展示されていました。"},{"sentence":"Conservation efforts are crucial to protect endangered equines from habitat loss and poaching.","translation":"絶滅危惧種のウマ科動物を、生息地の喪失や密猟から守るための保護活動が重要です。"},{"sentence":"The study focused on the social behavior of equines in their natural habitat.","translation":"その研究は、自然環境におけるウマ科動物の社会行動に焦点を当てました。"}],"collocations":["African equines (アフリカのウマ科動物)","wild equines (野生のウマ科動物)","endangered equines (絶滅危惧種のウマ科動物)","domesticated equines (家畜化されたウマ科動物)"],"synonyms":["horses","zebras","asses","members of Equidae"],"antonyms":[],"related_terms":["equine (単数形)","Equidae (ウマ科)"]}],"etymology":{"value":"Derived from the Latin word 'equinus,' meaning 'of or belonging to a horse.'","priority":"★★★"},"pronunciation":{"ipa":"/ˈiːkwaɪnz/","syllables":"E-quines"},"inflection":{"noun_plural":"Equines is already a plural form. The singular form is 'equine'."},"usage_notes":{"explanation":"'Equines' refers specifically to animals within the Equidae family. While 'horses' is a more common term, 'equines' is used in scientific or zoological contexts when referring to the entire group, including zebras and asses.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The equines is grazing in the field.","correct":"The equines are grazing in the field.","note":"'Equines' is a plural noun, so it requires a plural verb ('are')."},{"incorrect":"Equines are only horses.","correct":"Equines include horses, zebras, and asses.","note":"'Equines' encompasses a broader group than just horses."}],"priority":"★★☆"},"related_words":{"derivatives":["equine (adjective: relating to horses or other members of the horse family; noun: a horse or other member of the horse family)","Equidae (noun: the taxonomic family that includes horses, zebras, asses, and related animals)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. More common in scientific or zoological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Equines' is a relatively formal term used in scientific or zoological contexts to refer to animals belonging to the family Equidae. This family includes horses, zebras, asses, and related species. While 'horses' is a more common term for everyday use, 'equines' is used when referring to the entire group collectively, especially in scientific writing or discussions about animal conservation and biology."},"example_sentences":[{"sentence":"Researchers studied the genetic diversity among different populations of equines.","translation":"研究者たちは、異なるウマ科動物の集団間の遺伝的多様性を研究しました。","type":"noun","meaning_category":"ウマ科動物"},{"sentence":"The sanctuary provides a safe haven for rescued equines, including horses and donkeys.","translation":"その保護区は、救出されたウマ科動物（馬やロバを含む）に安全な避難場所を提供しています。","type":"noun","meaning_category":"ウマ科動物"},{"sentence":"Understanding the behavior of equines is crucial for effective management and conservation strategies.","translation":"ウマ科動物の行動を理解することは、効果的な管理と保護戦略にとって重要です。","type":"noun","meaning_category":"ウマ科動物"}]}