{"word":"expatiative","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"詳細に述べる、説明的な、詳述的な","english_definition":"Characterized by expatiation; explanatory; descriptive; dwelling at length on a subject.","examples":[{"sentence":"The professor gave an expatiative lecture on the history of the Roman Empire.","translation":"教授はローマ帝国の歴史について詳細な講義を行った。"},{"sentence":"The book is an expatiative study of the causes of the French Revolution.","translation":"その本はフランス革命の原因に関する詳細な研究である。"},{"sentence":"His expatiative writing style made the complex topic easier to understand.","translation":"彼の詳細な記述スタイルは、複雑なトピックを理解しやすくした。"}],"collocations":["expatiative lecture (詳細な講義)","expatiative study (詳細な研究)","expatiative writing (詳細な記述)","expatiative explanation (詳細な説明)"],"synonyms":["detailed","descriptive","explanatory","elaborate","extensive","thorough"],"antonyms":["concise","brief","succinct","terse"]}],"etymology":{"value":"From the verb 'expatiate,' which comes from Latin 'ex-' (out) + 'spatiari' (to walk, spread out).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˈspeɪʃiətɪv/","syllables":"ex-pa-ti-a-tive"},"inflection":{"notes":"Adjectives do not inflect in English, but can form comparative and superlative degrees (more expatiative, most expatiative)."},"usage_notes":{"explanation":"'Expatiative' is used to describe something (like speech or writing) that is characterized by lengthy and detailed explanation or description. It suggests a thorough and comprehensive treatment of a subject, often involving a broad range of information and examples. It is a relatively formal word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The expatiative movie was too long and boring.","correct":"✓ The lengthy movie was too long and boring.","note":"'Expatiative' is more commonly used to describe explanations, lectures, or writing styles rather than general descriptions of movies or other entertainment. Use 'lengthy' or 'long' instead."},{"incorrect":"✗ He gave an expatiative answer to the simple question.","correct":"✓ He gave a detailed answer to the simple question.","note":"If the answer is simply detailed, 'detailed' is a more common and natural choice. 'Expatiative' suggests a more extensive and perhaps unnecessary level of detail."}],"priority":"★☆☆"},"related_words":{"derivatives":["expatiate (verb: to speak or write at length or in detail)","expatiation (noun: the act of expatiating; detailed explanation)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Expatiative' is a formal and uncommon word used to describe something that is characterized by detailed and lengthy explanation. It is typically used in academic or professional contexts to describe lectures, writings, or studies that thoroughly explore a topic. Because of its formality and relatively low frequency, it is more likely to be encountered in advanced reading materials or specialized discussions."},"example_sentences":[{"sentence":"The author's expatiative style provided a comprehensive overview of the subject matter.","translation":"著者による詳細な記述スタイルは、主題の包括的な概要を提供した。","type":"adjective","meaning_category":"descriptive"},{"sentence":"The expatiative report included numerous charts and graphs to support its findings.","translation":"その詳細な報告書には、調査結果を裏付けるための多数の図表が含まれていた。","type":"adjective","meaning_category":"detailed"},{"sentence":"Her expatiative explanation of the theory helped the students understand its complexities.","translation":"彼女によるその理論に関する詳細な説明は、学生たちがその複雑さを理解するのに役立った。","type":"adjective","meaning_category":"explanatory"}]}