{"word":"thermoforming","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"熱成形（ねつせいけい）","english_definition":"A manufacturing process where a plastic sheet is heated to a pliable forming temperature, formed to a specific shape in a mold, and trimmed to create a usable product.","examples":[{"sentence":"Thermoforming is commonly used to produce packaging for food and consumer goods.","translation":"熱成形は、食品や消費財の包装を製造するためによく使用されます。"},{"sentence":"The thermoforming process allows for the creation of complex shapes with relatively low tooling costs.","translation":"熱成形プロセスにより、比較的低いツーリングコストで複雑な形状を作成できます。"}],"collocations":["vacuum thermoforming","pressure thermoforming","twin-sheet thermoforming","thin-gauge thermoforming","thick-gauge thermoforming"],"synonyms":["vacuum forming","drape forming","pressure forming"],"antonyms":[]}],"etymology":{"value":"The term 'thermoforming' is derived from 'thermo' (heat) and 'forming' (shaping). It describes the process of using heat to form or shape plastic materials.","priority":"★★★"},"pronunciation":{"ipa":"/ˌθɜːrmoʊˈfɔːrmɪŋ/","syllables":"ther-mo-form-ing"},"inflection":{"noun_plural":"thermoformings"},"usage_notes":{"explanation":"Thermoforming is a versatile manufacturing process used to create a wide range of plastic products. It involves heating a plastic sheet until it becomes pliable, then stretching it over or into a mold. Once cooled, the plastic retains the shape of the mold. The process is cost-effective for large production runs and is used in various industries, including packaging, automotive, and aerospace.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Thermoform is a process...","correct":"✓ Thermoforming is a process...","note":"'Thermoform' is sometimes mistakenly used as the process name. 'Thermoforming' is the correct term for the process itself."}],"priority":"★★☆"},"related_words":{"derivatives":["thermoform (verb, noun)","thermoformed (adjective)","thermoformer (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Thermoforming is a manufacturing process that involves heating a plastic sheet to make it flexible, then shaping it using a mold. This process is commonly used to create packaging, automotive parts, and other plastic products. It's a cost-effective method for producing large quantities of items with consistent shapes. The heated plastic is either vacuumed or pressed into the mold to achieve the desired form.","priority":"★★☆"},"example_sentences":[{"sentence":"The company specializes in thermoforming custom plastic parts.","translation":"その会社は、カスタムプラスチック部品の熱成形を専門としています。","type":"noun","meaning_category":"熱成形"},{"sentence":"Vacuum thermoforming is a common method for producing plastic trays.","translation":"真空熱成形は、プラスチックトレイを製造するための一般的な方法です。","type":"noun","meaning_category":"熱成形"},{"sentence":"The thermoforming machine efficiently shapes the heated plastic sheets.","translation":"熱成形機は、加熱されたプラスチックシートを効率的に成形します。","type":"noun","meaning_category":"熱成形"}]}