{"word":"inutilized","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"活用されていない、利用されていない、使われていない","english_definition":"Not utilized; not put to use; left unused.","examples":[{"sentence":"The inutilized resources could be used to boost the economy.","translation":"その活用されていない資源は、経済を活性化させるために利用できる。"},{"sentence":"The inutilized land was overgrown with weeds.","translation":"その使われていない土地は雑草が生い茂っていた。"},{"sentence":"Many inutilized skills are lost over time.","translation":"多くの活用されていないスキルは、時間が経つにつれて失われる。"}],"collocations":["inutilized resources (活用されていない資源)","inutilized land (使われていない土地)","inutilized skills (活用されていないスキル)","inutilized potential (活用されていない潜在能力)","inutilized capacity (活用されていない能力)"],"synonyms":["unused","untapped","unexploited","idle","dormant","underutilized"],"antonyms":["utilized","used","exploited","tapped","active"]},{"part_of_speech":"verb (past participle)","definition":"活用されなかった、利用されなかった、使われなかった","english_definition":"(past participle of inutilize) not made useful; not utilized.","examples":[{"sentence":"The equipment remained inutilized due to lack of training.","translation":"その機器は、トレーニング不足のため活用されなかった。"},{"sentence":"The data was inutilized, leading to poor decision-making.","translation":"そのデータは活用されず、不適切な意思決定につながった。"}],"collocations":["remained inutilized (活用されなかった)","was left inutilized (活用されずに残された)"],"synonyms":["left unused","not exploited","not utilized"],"antonyms":["utilized","used","exploited"]}],"etymology":{"value":"\"In-\" (否定) + \"utilized\" (活用された)。つまり、「活用されていない」という意味を文字通り表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈjuːtɪlaɪzd/","syllables":"in-u-ti-lized"},"inflection":{"notes":"Regular adjective and past participle form."},"usage_notes":{"explanation":"\"**Inutilized**\" is a relatively uncommon word, often replaced by more common synonyms like \"unused,\" \"untapped,\" or \"underutilized.\" It emphasizes the state of being not utilized or not put to use. While grammatically correct, it can sound somewhat formal or less natural than its alternatives. In many cases, rephrasing the sentence to use a more common word or phrase may improve clarity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inutilized of the land was a waste.","correct":"✓ The non-utilization of the land was a waste. / ✓ The land being inutilized was a waste.","note":"\"Inutilized\" is an adjective or past participle, not a noun. To express the concept as a noun, use \"non-utilization\" or rephrase the sentence."},{"incorrect":"✗ The company inutilized the new technology.","correct":"✓ The company did not utilize the new technology.","note":"\"Inutilized\" is not typically used as a verb; instead, use the negative form \"did not utilize\" or \"failed to utilize.\""}],"priority":"★★☆"},"related_words":{"derivatives":["inutilization (名詞: 非活用)"],"synonyms":["unused","untapped","unexploited","underutilized","idle","dormant"],"antonyms":["utilized","used","exploited","tapped","active"]},"level_frequency":{"CEFR":"C2 (Very rare; more common alternatives exist.)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - より一般的な同義語が好まれる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"**Inutilized**\" is a formal and relatively rare word meaning \"not utilized\" or \"not put to use.\" It's often better to use more common synonyms like \"unused,\" \"untapped,\" or \"underutilized\" for clarity. The word is formed by adding the prefix \"in-\" (meaning \"not\") to the word \"utilized.\" It's mostly found in technical or formal contexts where a more precise term is desired. However, in most cases, simpler alternatives are preferred for better readability."},"example_sentences":[{"sentence":"The inutilized potential of the workforce was a concern for the management.","translation":"労働力の活用されていない潜在能力は、経営陣にとって懸念事項であった。","type":"adjective","meaning_category":"活用されていない"},{"sentence":"The data collected remained inutilized, failing to provide any insights.","translation":"収集されたデータは活用されず、何の洞察も提供できなかった。","type":"verb (past participle)","meaning_category":"活用されなかった"},{"sentence":"The inutilized equipment was eventually sold at auction.","translation":"その活用されていなかった機器は、最終的にオークションで売却された。","type":"adjective","meaning_category":"使われていない"}]}