{"word":"self-sealer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己封緘式封筒、自己接着式封筒","english_definition":"An envelope or other container that seals itself, typically by means of an adhesive strip that is covered until ready for use.","examples":[{"sentence":"I bought a pack of self-sealer envelopes to send out the invitations.","translation":"招待状を送るために自己封緘式封筒を1パック買った。"}],"collocations":["self-sealer envelope"],"synonyms":["self-adhesive envelope"],"antonyms":[]}],"etymology":{"value":"The term is a compound word derived from \"self\" (referring to the action being done by itself) and \"sealer\" (something that seals).","priority":"★★★"},"pronunciation":{"ipa":"/ˌselfˈsiːlər/","syllables":"self-seal-er"},"inflection":{"noun_plural":"self-sealers"},"usage_notes":{"explanation":"The term 'self-sealer' is commonly used in the context of mailing and packaging. It indicates a feature that allows the item to be sealed without needing additional adhesive or external sealing methods.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a self sealer to close this box.","correct":"✓ I need self-sealing tape to close this box.","note":"'Self-sealer' typically refers to the envelope itself, not the tape used to seal a box. Use 'self-sealing tape' for boxes."}],"priority":"★★☆"},"related_words":{"derivatives":["self-seal (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'self-sealer' is relatively straightforward. It describes an item that can seal itself, usually an envelope. The word is a compound, combining 'self' and 'sealer,' making it easy to understand its function. It is used in contexts related to mailing and office supplies."},"example_sentences":[{"sentence":"These self-sealer envelopes save a lot of time when sending out bulk mail.","translation":"これらの自己封緘式封筒は、大量の郵便物を送る際に多くの時間を節約できます。","type":"noun","meaning_category":"自己封緘式封筒"}]}