{"word":"cachaemic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)悪液質の、悪液質性の","english_definition":"(medicine) Relating to or suffering from cachexia.","examples":[{"sentence":"The patient presented with a cachaemic appearance, characterized by severe weight loss and muscle wasting.","translation":"その患者は、重度の体重減少と筋肉消耗を特徴とする悪液質性の外観を呈した。"}],"collocations":["cachaemic state","cachaemic appearance"],"synonyms":["cachectic","wasting","emaciated"],"antonyms":["healthy","robust"]}],"etymology":{"value":"From cachexia + -emic. Cachexia comes from Greek κακός (kakos, “bad”) + ἕξις (hexis, “condition”).","priority":"★★★"},"pronunciation":{"ipa":"/kəˈkiːmɪk/","syllables":"ca-chae-mic"},"inflection":{"notes":"Adjective; comparative and superlative forms are possible (more cachaemic, most cachaemic), but not common."},"usage_notes":{"explanation":"'Cachaemic' is a medical term primarily used to describe the condition or appearance of someone suffering from cachexia, a wasting syndrome characterized by loss of weight, muscle atrophy, fatigue, weakness, and significant loss of appetite in someone who is not actively trying to lose weight. It is often associated with chronic diseases such as cancer, AIDS, and heart failure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant looked cachaemic due to lack of sunlight.","correct":"✓ The plant looked withered due to lack of sunlight.","note":"'Cachaemic' specifically refers to a medical condition in humans or animals, not to plants or other non-living things. Use 'withered' or another appropriate term for plants."}],"priority":"★★☆"},"related_words":{"derivatives":["cachexia (noun): 悪液質"],"related_terms":["anorexia","malnutrition","wasting syndrome"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. Primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cachaemic' is a highly specialized medical term that describes the condition of someone suffering from cachexia. Cachexia is a wasting syndrome often associated with severe chronic illnesses. This term is rarely used outside of medical contexts. Understanding requires knowledge of advanced medical terminology."},"example_sentences":[{"sentence":"The cachaemic patient required nutritional support to improve their overall health.","translation":"その悪液質患者は、全体的な健康状態を改善するために栄養サポートを必要とした。","type":"adjective","meaning_category":"medical condition"},{"sentence":"The doctor noted the cachaemic signs during the physical examination.","translation":"医師は身体検査中に悪液質の兆候に気づいた。","type":"adjective","meaning_category":"medical condition"}]}