{"word":"Novatianism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ノバティアヌス主義：3世紀にローマで発生したキリスト教の異端。背教者（信仰を捨てた者）の再聖餐を拒否した。","english_definition":"A Christian heresy originating in the 3rd century in Rome, which refused readmission to communion of those who had apostatized (renounced their faith).","examples":[{"sentence":"Novatianism arose in response to what its followers saw as laxity in the church's treatment of those who had lapsed during persecution.","translation":"ノバティアヌス主義は、迫害中に信仰を捨てた者に対する教会の寛容な扱いに対する信奉者たちの反応として起こった。"},{"sentence":"Novatianism spread throughout the Roman Empire, establishing its own parallel churches.","translation":"ノバティアヌス主義はローマ帝国全体に広がり、独自の教会を設立した。"}],"collocations":["Novatianist church","Novatianist beliefs","oppose Novatianism"],"synonyms":["Puritanism","rigorism"],"antonyms":["Catholicism (in historical context)","lenient Christianity"]},{"part_of_speech":"noun","definition":"ノバティアヌス主義の信奉者","english_definition":"A follower of Novatianism.","examples":[{"sentence":"Novatianists were considered heretics by the mainstream church.","translation":"ノバティアヌス主義者は主流教会から異端者とみなされた。"},{"sentence":"Novatianists believed in a stricter form of Christian discipline.","translation":"ノバティアヌス主義者は、より厳格なキリスト教の規律を信じていた。"}],"collocations":["strict Novatianists","early Novatianists"],"synonyms":["Novatianist"],"antonyms":["orthodox Christian"]}],"etymology":{"value":"Named after Novatian, a Roman theologian and antipope in the 3rd century who founded the movement.","priority":"★★★"},"pronunciation":{"ipa":"/noʊˈveɪʃənɪzəm/","syllables":"No-va-ti-an-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Novatianism was a significant movement in the early church, reflecting debates about forgiveness, penance, and the nature of the church. It is important to understand the historical context in which it arose, particularly the persecutions of Christians under the Roman Empire.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Novatianism was a Jewish sect.","correct":"✓ Novatianism was a Christian heresy.","note":"Novatianism was a Christian movement, not Jewish."},{"incorrect":"✗ Novatianism is a modern religion.","correct":"✓ Novatianism was an early Christian movement.","note":"Novatianism is an ancient movement, not a modern one."}],"priority":"★★☆"},"related_words":{"derivatives":["Novatian (noun, adjective)","Novatianist (noun, adjective)"],"historical_context":["Decian persecution","lapsed Christians","penance","schism"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency - Primarily used in theological or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Novatianism' is a term primarily encountered in the study of early church history and theology. Understanding it requires knowledge of the historical context of the Roman Empire and the early Christian church, particularly the debates surrounding the treatment of those who had renounced their faith during periods of persecution. The term is not commonly used in everyday language."},"example_sentences":[{"sentence":"The teachings of Novatianism emphasized the purity of the church and the impossibility of second repentance for certain sins.","translation":"ノバティアヌス主義の教えは、教会の純粋さと、特定の罪に対する二度目の悔い改めの不可能さを強調した。","type":"noun","meaning_category":"ノバティアヌス主義"},{"sentence":"The Novatianists established their own bishops and congregations in opposition to the more lenient practices of the Catholic Church.","translation":"ノバティアヌス主義者は、カトリック教会のより寛容な慣習に対抗して、独自の司教と信徒を設立した。","type":"noun","meaning_category":"ノバティアヌス主義の信奉者"}]}