{"word":"cross-tine","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(農業)クロス状の刃を持つ耕耘機、またはその刃","english_definition":"A type of agricultural equipment, or a part of it, that uses tines arranged in a cross pattern for tilling soil.","examples":[{"sentence":"The cross-tine cultivator efficiently prepared the seedbed.","translation":"クロス刃耕耘機は効率的に種床を準備した。"},{"sentence":"He replaced the worn cross-tines on his rotary tiller.","translation":"彼はロータリー耕耘機の摩耗したクロス刃を交換した。"}],"collocations":["cross-tine cultivator","cross-tine tiller","rotary cross-tine"],"synonyms":["tiller","cultivator","rotavator"],"antonyms":[]}],"etymology":{"value":"Compound word combining 'cross' (referring to the cross-shaped arrangement) and 'tine' (a prong or tooth, especially on a fork or agricultural tool).","priority":"N/A"},"pronunciation":{"ipa":"/ˈkrɒsˌtaɪn/","syllables":"cross-tine"},"inflection":{"noun_plural":"cross-tines"},"usage_notes":{"explanation":"The term 'cross-tine' is specific to agricultural equipment. It describes a design where the tines (prongs) are arranged in a cross or intersecting pattern, which is used for breaking up and aerating soil. This design is often found on rotary tillers and cultivators.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["tine","rotary tiller","cultivator"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'cross-tine' is highly specialized and primarily used within the context of agriculture and farming equipment. It describes a specific design feature of tillers or cultivators, where the tines (prongs) are arranged in a cross-shaped pattern. Due to its technical nature, it is unlikely to be encountered outside of these specific contexts."},"example_sentences":[{"sentence":"The farmer adjusted the depth of the cross-tine cultivator for optimal soil preparation.","translation":"農家は最適な土壌準備のために、クロス刃耕耘機の深さを調整した。","type":"noun","meaning_category":"Agricultural equipment"}]}