{"word":"unreeler","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(機械)繰り出し機、巻き戻し機","english_definition":"A machine or device that unwinds or pays out something that is wound on a reel or spool.","examples":[{"sentence":"The unreeler smoothly dispensed the cable as the robot moved.","translation":"ロボットが動くにつれて、繰り出し機はケーブルをスムーズに送り出した。"},{"sentence":"The film unreeler in the projector ensures a constant feed of film.","translation":"プロジェクターのフィルム繰り出し機は、フィルムが常に供給されるようにする。"}],"collocations":["cable unreeler","film unreeler","wire unreeler"],"synonyms":["dispenser","payoff reel","unwinding machine"],"antonyms":["reeler","winder"]},{"part_of_speech":"noun","definition":"(人)繰り出す人、巻き戻す人","english_definition":"A person who unwinds or pays out something from a reel or spool.","examples":[{"sentence":"The unreeler carefully managed the tension as the wire was unwound.","translation":"繰り出し担当者は、ワイヤーが巻き戻される際に、注意深く張力を管理した。"}],"collocations":[],"synonyms":[],"antonyms":["reeler"]}],"etymology":{"value":"Derived from the verb 'unreel' (to unwind from a reel) with the addition of the suffix '-er' indicating an agent or device.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈriːlər/","syllables":"un-reel-er"},"inflection":{"noun_plural":"unreelers"},"usage_notes":{"explanation":"'Unreeler' refers to either a person or a machine that unwinds something from a reel or spool. The context usually makes it clear whether it is a person or a device. In technical contexts, it more commonly refers to the machine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unreeler was very tired after reeling all day.","correct":"✓ The unreeler was very tired after unreeling all day.","note":"The correct verb is 'unreel' (to unwind), not 'reel' (to wind)."},{"incorrect":"✗ The unreeler is broken, so the film is reeled backwards.","correct":"✓ The unreeler is broken, so the film is not unwinding properly.","note":"If the unreeler is broken, it won't reel backwards, but rather fail to unwind properly."}],"priority":"★☆☆"},"related_words":{"derivatives":["unreel (verb)","reel (noun, verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unreeler' is a technical term, primarily used in contexts involving machinery or processes where material is unwound from a reel or spool. It is not commonly used in everyday conversation. Understanding the term requires familiarity with the concept of reels and spools and the action of unwinding or paying out material from them."},"example_sentences":[{"sentence":"A specialized unreeler is used in the textile industry to handle large spools of yarn.","translation":"特殊な繰り出し機が、繊維産業で大きな糸巻きを扱うために使用されている。","type":"noun","meaning_category":"machine"},{"sentence":"The unreeler ensured the fiber optic cable was laid smoothly without kinks.","translation":"繰り出し担当者は、光ファイバーケーブルがよじれなくスムーズに敷設されるようにした。","type":"noun","meaning_category":"person"}]}