{"word":"clonability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"複製可能性、クローン化可能性","english_definition":"The ability to be cloned; the extent to which something can be cloned.","examples":[{"sentence":"The clonability of the gene was essential for the research.","translation":"その遺伝子の複製可能性は研究にとって不可欠だった。"},{"sentence":"Scientists are studying the clonability of various cell types.","translation":"科学者たちは様々な細胞型の複製可能性を研究している。"},{"sentence":"The high clonability of this software makes it vulnerable to piracy.","translation":"このソフトウェアの高い複製可能性は、著作権侵害に対して脆弱にしている。"}],"collocations":["high clonability (高い複製可能性)","low clonability (低い複製可能性)","assess clonability (複製可能性を評価する)","improve clonability (複製可能性を改善する)"],"synonyms":["replicability","duplicability","copyability"],"antonyms":["unclonability","non-replicability"]}],"etymology":{"value":"'Clone' (クローン) + '-ability' (～可能性)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkloʊnəˈbɪləti/","syllables":"clo-na-bil-i-ty"},"inflection":{"noun_plural":"clonabilities (まれに)"},"usage_notes":{"explanation":"'Clonability' refers to the capacity or potential of something, usually biological material (like genes, cells, or even entire organisms) or software, to be cloned or replicated. It's often used in scientific and technical contexts. The term implies that the process of cloning is feasible, although it might not necessarily be easy or efficient.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The clonability is very important for this project.","correct":"✓ The clonability of this gene is very important for this project.","note":"It's better to specify what is being cloned. Using 'the clonability of X' is more precise than just 'the clonability'."}],"priority":"★★☆"},"related_words":{"derivatives":["clone (動詞/名詞: クローン)","clonable (形容詞: 複製可能な)","unclonable (形容詞: 複製不可能な)","cloning (名詞: クローン化)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Clonability' is a technical term that refers to the ability of something to be cloned, meaning to create an identical copy. This term is most often used in scientific fields like biology and genetics, but it can also apply to software or other digital content. Understanding the term requires knowledge of the concept of cloning itself.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers investigated the clonability of the tumor cells.","translation":"研究者たちは腫瘍細胞の複製可能性を調査した。","type":"general","meaning_category":"複製可能性"},{"sentence":"The software's high clonability made it easy to distribute.","translation":"そのソフトウェアの高い複製可能性は、配布を容易にした。","type":"technical","meaning_category":"複製可能性"},{"sentence":"Factors affecting the clonability of stem cells are being actively studied.","translation":"幹細胞の複製可能性に影響を与える要因が活発に研究されている。","type":"scientific","meaning_category":"複製可能性"}]}