{"word":"connexive","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(論理学で) ある命題体系が、その体系内で、ある命題とその否定が同時に主張できない、または同時に否定できないという性質を持つこと。","english_definition":"(In logic) of or relating to a system of logic in which no proposition can be asserted together with its negation, nor can any proposition be denied together with its negation.","examples":[{"sentence":"Connexive logic aims to capture intuitions about the relationship between a proposition and its negation.","translation":"コネクシブ論理は、命題とその否定の関係に関する直観を捉えることを目的としています。"},{"sentence":"Some ancient logical systems can be interpreted as connexive logics.","translation":"古代の論理体系の中には、コネクシブ論理として解釈できるものもあります。"}],"collocations":["connexive logic","connexive implication","connexive principle"],"synonyms":["non-contradictory","consistent"],"antonyms":["non-connexive","inconsistent"]}],"etymology":{"value":"The term 'connexive' is derived from the Latin 'connectere', meaning 'to connect, to bind together'. It reflects the idea that in connexive logic, a proposition and its negation are connected in a specific way that prevents them from being simultaneously asserted or denied.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈnɛksɪv/","syllables":"con-nex-ive"},"inflection":{"notes":"Adjective, no specific inflectional forms."},"usage_notes":{"explanation":"'Connexive' is a technical term primarily used in the field of logic, particularly in discussions of non-classical logical systems. It describes a property of a logical system where certain relationships between a proposition and its negation are enforced, preventing self-contradictory assertions or denials. The concept is relatively niche and not commonly encountered outside of academic contexts related to logic and philosophy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The argument was connexive, therefore it was true.","correct":"✓ The argument was valid, therefore it was true.","note":"Connexivity is a property of a logical system, not of individual arguments. Validity is a more appropriate term to describe the correctness of an argument. "},{"incorrect":"✗ Connexive arguments are always easy to understand.","correct":"✓ Connexive logic can be complex and counterintuitive.","note":"Connexive logic is often complex and can challenge traditional logical intuitions."}],"priority":"★☆☆"},"related_words":{"derivatives":["connexivity (noun): the property of being connexive"],"related_terms":["logic","proposition","negation","assertion","denial","non-classical logic","relevance logic"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized term)","frequency_google_ngram":"Very low frequency - Primarily used in academic contexts related to logic.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'connexive' is highly specialized and is primarily encountered in advanced studies of logic and philosophy. It describes a specific property of logical systems that enforce certain relationships between a statement and its negation. Understanding this term requires a solid foundation in formal logic. It is not a term used in general language or introductory materials. "},"example_sentences":[{"sentence":"The connexive nature of the system ensures that contradictions are avoided.","translation":"その体系のコネクシブな性質により、矛盾が回避されます。","type":"adjective","meaning_category":"論理学"},{"sentence":"Researchers are exploring the implications of connexive logic for various philosophical problems.","translation":"研究者たちは、さまざまな哲学的問題に対するコネクシブ論理の影響を探求しています。","type":"adjective","meaning_category":"論理学"}]}