{"word":"Highholder","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A person who held land directly from the crown or a superior lord, especially in certain parts of Europe.","english_definition":"(historical) A person who held land directly from the crown or a superior lord, especially in certain parts of Europe.","examples":[{"sentence":"The highholders of the region enjoyed certain privileges due to their direct relationship with the king.","translation":"その地域のハイホルダーたちは、国王との直接的な関係により、特定の特権を享受していた。"}],"collocations":["highholder rights","highholder status","royal highholder"],"synonyms":["freeholder","landowner","vassal"],"antonyms":["tenant","serf"]}],"etymology":{"value":"Combination of \"high\" (referring to superior status or authority) and \"holder\" (one who holds land).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhaɪˌhoʊldər/","syllables":"High-hold-er"},"inflection":{"noun_plural":"highholders"},"usage_notes":{"explanation":"The term \"highholder\" is primarily historical and refers to a specific type of land tenure in certain European contexts. It denotes a landholder with a direct and privileged relationship to the crown or a superior lord, setting them apart from ordinary tenants or serfs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a highholder in the modern sense of property ownership.","correct":"✓ He was a highholder in the historical context of feudal land ownership.","note":"The term 'highholder' is specific to historical land tenure systems and not applicable to modern property ownership."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["freehold","land tenure","feudalism","manorialism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily a historical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"highholder\" is a specialized historical term referring to a type of landholder in feudal systems. Understanding requires familiarity with historical land tenure and social hierarchies. It is not commonly used in modern contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The records showed that the family had been highholders for generations.","translation":"記録によると、その家族は何世代にもわたってハイホルダーだった。","type":"noun","meaning_category":"historical land tenure"},{"sentence":"As a highholder, he had the right to appeal directly to the king.","translation":"ハイホルダーとして、彼は国王に直接訴える権利を持っていた。","type":"noun","meaning_category":"historical land tenure"}]}