{"word":"burstones","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural only) A hypothetical or fictional type of gemstone with explosive properties. This term is extremely rare and not found in standard dictionaries. Its meaning is derived from combining 'burst' (to explode) and 'stones' (gemstones).","english_definition":"(plural only) A hypothetical or fictional type of gemstone with explosive properties. This term is extremely rare and not found in standard dictionaries. Its meaning is derived from combining 'burst' (to explode) and 'stones' (gemstones).","examples":[{"sentence":"In the fantasy novel, the villain used burstones to destroy the castle walls.","translation":"そのファンタジー小説では、悪役がバーストーンを使って城壁を破壊した。"},{"sentence":"The legend spoke of burstones hidden deep within the volcano, capable of unleashing immense power.","translation":"その伝説は、火山の中に深く隠されたバーストーンについて語っており、それは途方もない力を解き放つことができるという。"}],"collocations":["fictional burstones","legendary burstones","powerful burstones"],"synonyms":["explosive gems","detonating stones"],"antonyms":[]}],"etymology":{"value":"A neologism combining 'burst' (to explode) and 'stones' (gemstones). The term is likely invented for fictional purposes.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbɜːrstəʊnz/","syllables":"burst-ones"},"inflection":{"noun_plural":"burstones (already plural)"},"usage_notes":{"explanation":"'Burstones' is a made-up word, primarily used in fantasy or science fiction contexts. It describes gemstones that have explosive capabilities. Due to its fictional nature, it is not part of standard English vocabulary.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a burstone in my backyard.","correct":"✓ (In a fictional context) I found a burstone in the game.","note":"Since burstones are fictional, finding one in reality is not possible. The term is appropriate only within a fictional narrative."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not a real word)","frequency_google_ngram":"Extremely rare (likely invented)","priority":"N/A"},"readability_explanation":{"level":"C2 (due to its rarity and fictional context)","text":"'Burstones' is a fictional term, so understanding it requires familiarity with fantasy and science fiction tropes. The word itself is straightforward, combining 'burst' and 'stones,' but its usage is limited to imaginative contexts.","note":"This term would likely only be encountered in fictional works or specialized discussions about world-building in fantasy/sci-fi."},"example_sentences":[{"sentence":"The dwarves mined deep, searching for the legendary burstones.","translation":"ドワーフたちは深く鉱山を掘り、伝説のバーストーンを探し求めた。","type":"noun","meaning_category":"fictional gemstone"},{"sentence":"The wizard warned that handling burstones was extremely dangerous.","translation":"魔法使いは、バーストーンの取り扱いは極めて危険だと警告した。","type":"noun","meaning_category":"fictional gemstone"}]}