{"word":"arachnoid","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"クモ膜の、クモ膜状の","english_definition":"Resembling a spider or a spider's web; relating to the arachnoid membrane.","examples":[{"sentence":"The arachnoid membrane is one of the three layers of the meninges.","translation":"クモ膜は髄膜の3つの層のうちの1つです。"},{"sentence":"Arachnoid cysts are fluid-filled sacs that can develop in the brain or spinal cord.","translation":"クモ膜嚢胞は、脳または脊髄に発生する可能性のある液体で満たされた嚢です。"}],"collocations":["arachnoid membrane","arachnoid cyst","arachnoid space"],"synonyms":["spiderlike","webby"],"antonyms":[]},{"part_of_speech":"noun","definition":"クモ膜","english_definition":"The delicate membrane forming the middle layer of the meninges, located between the dura mater and the pia mater.","examples":[{"sentence":"The arachnoid is avascular and lies between the dura and pia mater.","translation":"クモ膜は無血管であり、硬膜と軟膜の間に位置しています。"}],"collocations":["dura mater","pia mater","meninges"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ἀράχνη (arákhnē, \"spider, spiderweb\") + -ειδής (-eidḗs, \"-oid, having the form of\").","priority":"★★☆"},"pronunciation":{"ipa":"/əˈræknɔɪd/","syllables":"a-rach-noid"},"inflection":{"noun_plural":"arachnoids"},"usage_notes":{"explanation":"The term \"arachnoid\" refers to something that resembles a spider or a spider's web. In anatomy, it specifically refers to the arachnoid membrane, one of the three layers of the meninges that protect the brain and spinal cord.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has arachniditis.","correct":"✓ He has arachnoiditis.","note":"Arachnoiditis is the inflammation of the arachnoid membrane, not arachniditis. The correct spelling is crucial in medical contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["arachnoiditis (inflammation of the arachnoid membrane)","arachnology (the study of arachnids)"],"related_terms":["arachnid (member of the class Arachnida, including spiders, scorpions, mites, and ticks)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"arachnoid\" is a technical term primarily used in medical and biological contexts. It refers to something resembling a spider or spiderweb, most commonly the arachnoid membrane, which is a layer of the meninges surrounding the brain and spinal cord. Understanding this term requires some familiarity with anatomy or medical terminology. It is not typically encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The cerebrospinal fluid circulates in the subarachnoid space.","translation":"脳脊髄液はクモ膜下腔を循環する。","type":"adjective","meaning_category":"クモ膜の"},{"sentence":"The arachnoid is a delicate membrane.","translation":"クモ膜は繊細な膜である。","type":"noun","meaning_category":"クモ膜"}]}