{"word":"Kruger","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"クリューガー (姓)","english_definition":"A surname of German and Dutch origin.","examples":[{"sentence":"Kruger is a common surname in South Africa.","translation":"クリューガーは南アフリカで一般的な姓です。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"クリューガー国立公園 (南アフリカ共和国の国立公園)","english_definition":"A large national park in northeastern South Africa, one of the largest game reserves in Africa.","examples":[{"sentence":"We went on safari in Kruger National Park.","translation":"私たちはクリューガー国立公園でサファリに行きました。"},{"sentence":"Kruger is famous for its diverse wildlife.","translation":"クリューガーは多様な野生生物で有名です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The surname Kruger is of German and Dutch origin, derived from the Middle High German word 'kruog', meaning 'jug' or 'pitcher'. It was likely an occupational surname for a maker or seller of jugs. The Kruger National Park is named after Paul Kruger, the former president of the South African Republic.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkruːɡər/","syllables":"Kroo-ger"},"inflection":{},"usage_notes":{"explanation":"'Kruger' can refer to a surname or the Kruger National Park. When referring to the national park, it is often preceded by 'Kruger National Park'.","priority":"★★☆"},"common_mistakes":{},"related_words":{},"level_frequency":{},"readability_explanation":{"level":"B1","text":"'Kruger' is a proper noun, so it is always capitalized. It is most commonly known as the name of the Kruger National Park in South Africa, a famous wildlife reserve. It is also a surname of German and Dutch origin."},"example_sentences":[{"sentence":"Paul Kruger was a prominent figure in South African history.","translation":"ポール・クリューガーは南アフリカの歴史における著名な人物でした。","type":"proper noun","meaning_category":"姓"},{"sentence":"Many tourists visit Kruger National Park every year.","translation":"毎年多くの観光客がクリューガー国立公園を訪れます。","type":"proper noun","meaning_category":"国立公園"}]}