{"word":"critico-historical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"批判的歴史的、批評史的","english_definition":"Relating to or involving both critical analysis and historical context.","examples":[{"sentence":"The author adopted a critico-historical approach to the study of literature.","translation":"著者は文学の研究に批評史的なアプローチを採用した。"},{"sentence":"A critico-historical analysis reveals the complex layers of meaning in the text.","translation":"批評史的な分析は、テキストにおける意味の複雑な層を明らかにする。"}],"collocations":["critico-historical analysis","critico-historical approach","critico-historical method"],"synonyms":["critical-historical","historical-critical"],"antonyms":[]}],"etymology":{"value":"The term combines \"critical\" (relating to critical analysis) and \"historical\" (relating to history or historical context).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkrɪtɪkoʊ hɪˈstɒrɪkəl/","syllables":"cri-ti-co-his-tor-i-cal"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term \"critico-historical\" is used to describe a method or perspective that combines critical analysis with an understanding of historical context. It is often used in the humanities, such as literature, history, and philosophy, to analyze texts, events, or ideas in their historical context while also applying critical scrutiny.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The study was critico-historic.","correct":"✓ The study was critico-historical.","note":"The correct form is \"critico-historical,\" not \"critico-historic.\""}],"priority":"★★☆"},"related_words":{"derivatives":["critical","historical","criticism","history"],"related_terms":["historical criticism","critical theory","historiography"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"critico-historical\" is a specialized term used in academic contexts, particularly in the humanities. It refers to an approach that combines critical analysis with historical understanding. This term is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The critico-historical study examined the evolution of the novel in the 19th century.","translation":"その批評史的研究は、19世紀における小説の進化を調査した。","type":"general","meaning_category":"general"},{"sentence":"A critico-historical perspective is essential for understanding the political climate of the era.","translation":"批評史的な視点は、その時代の政治情勢を理解するために不可欠である。","type":"general","meaning_category":"general"}]}