{"word":"archconfraternity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（カトリック教会の）上位の信心会、総本山信心会","english_definition":"A confraternity to which others are aggregated; the chief confraternity of a particular name.","examples":[{"sentence":"The Archconfraternity of the Holy Family is based in Rome.","translation":"聖家族大信心会はローマに本部を置いています。"},{"sentence":"Many local confraternities were affiliated with the archconfraternity.","translation":"多くの地方信心会が、この総本山信心会と提携していました。"}],"collocations":["join an archconfraternity","member of an archconfraternity"],"synonyms":["confraternity","sodality","religious association"],"antonyms":[]}],"etymology":{"value":"\"arch-\" (chief, principal) + \"confraternity\" (a brotherhood, especially for religious purposes).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɑːrtʃkənfrəˈtɜːrnɪti/","syllables":"arch-con-fra-ter-ni-ty"},"inflection":{"noun_plural":"archconfraternities"},"usage_notes":{"explanation":"An \"archconfraternity\" is a leading or central confraternity, often serving as a model or governing body for other confraternities of the same name or devotion. It is primarily used within the context of the Catholic Church.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a member of the arch-confraternity.","correct":"✓ He is a member of the archconfraternity.","note":"The word is usually written as one word, without a hyphen."}],"priority":"★☆☆"},"related_words":{"derivatives":["confraternity"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"archconfraternity\" is a specialized term primarily used in the context of the Catholic Church to denote a chief or principal confraternity. Due to its specific religious and historical context, it is not commonly encountered in general English usage."},"example_sentences":[{"sentence":"The local chapter sought affiliation with the established archconfraternity.","translation":"地元の支部は、確立された総本山信心会との提携を模索しました。","type":"general","meaning_category":"religious association"},{"sentence":"The archconfraternity provided guidance to its associated local groups.","translation":"その総本山信心会は、関連する地元の団体に指導を提供しました。","type":"general","meaning_category":"religious association"}]}