{"word":"head-block","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(機械工学)シリンダーヘッド","english_definition":"(mechanical engineering) A cylinder head.","examples":[{"sentence":"The mechanic removed the head-block to access the engine's valves.","translation":"整備士はエンジンのバルブにアクセスするためにシリンダーヘッドを取り外した。"}],"collocations":["cylinder head","engine head"],"synonyms":["cylinder head"],"antonyms":[]}],"etymology":{"value":"Compound of 'head' and 'block', referring to the block at the head of an engine cylinder.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈhɛdˌblɒk/","syllables":"head-block"},"inflection":{"noun_plural":"head-blocks"},"usage_notes":{"explanation":"The term 'head-block' is often used interchangeably with 'cylinder head', particularly in older texts or by individuals with specific technical backgrounds. It refers to the detachable part of an internal combustion engine that sits above the cylinders, closing them and containing the valves, spark plugs, and combustion chambers.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The head-block was broken, so I replaced the whole engine.","correct":"✓ The head-block was cracked, so I had it repaired.","note":"While a damaged head-block can necessitate repairs, it doesn't always require replacing the entire engine."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'head-block' is a technical term primarily used in mechanical engineering, specifically concerning internal combustion engines. It refers to the cylinder head, which is a component that closes the top of the engine cylinders. Due to its specialized nature, it's not commonly encountered in everyday language and is more likely to appear in technical manuals or discussions among engineers and mechanics."},"example_sentences":[{"sentence":"The warped head-block caused a loss of compression in the engine.","translation":"歪んだシリンダーヘッドは、エンジンの圧縮損失を引き起こした。","type":"noun","meaning_category":"cylinder head"}]}