{"word":"Strabo","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ストラボーン：古代ギリシアの地理学者、歴史家、哲学者。特に地理学の分野で重要な貢献をした。","english_definition":"Strabo was a Greek geographer, philosopher, and historian who lived in Asia Minor during the transitional period of the Roman Republic into the Roman Empire. He is best known for his Geographica, a descriptive work presenting the history and characteristics of peoples and places from a Greco-Roman perspective.","examples":[{"sentence":"Strabo's 'Geographica' is a valuable source of information about the ancient world.","translation":"ストラボンの『地理誌』は古代世界に関する貴重な情報源です。"},{"sentence":"Strabo traveled extensively throughout the Roman Empire.","translation":"ストラボーンはローマ帝国内を広く旅しました。"}],"collocations":["Strabo's Geographica","ancient geographer Strabo"],"synonyms":["None (unique name)"],"antonyms":["None (unique name)"]}],"etymology":{"value":"The name 'Strabo' is of Greek origin, likely a nickname meaning 'squint-eyed' or 'cross-eyed'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstreɪboʊ/","syllables":"Stra-bo"},"inflection":{"notes":"Proper noun; no plural form."},"usage_notes":{"explanation":"Strabo is primarily known as the author of 'Geographica,' a monumental work that attempts to describe the known world of his time. His work is a valuable source of information for historians and geographers studying the ancient world, even though it contains some inaccuracies and biases. When referring to him, it's important to use the correct spelling and capitalization.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Strabo's geography","correct":"✓ Strabo's Geographica","note":"While Strabo wrote about geography, his main work is titled 'Geographica', not simply 'geography'."}],"priority":"★★☆"},"related_words":{"derivatives":["Strabonian (adjective: relating to Strabo or his work)"],"phrases":["Geographica (Strabo's main work)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Proper noun, not generally part of language proficiency levels)","frequency_google_ngram":"Low frequency (specific historical figure)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The name 'Strabo' refers to a specific historical figure, a Greek geographer and historian. Understanding references to Strabo requires knowledge of ancient history and geography. His work, 'Geographica,' is a complex text that provides insights into the ancient world but may contain inaccuracies. Discussions about Strabo often appear in academic contexts related to history, geography, and classical studies."},"example_sentences":[{"sentence":"**Strabo** was born in Amaseia, Pontus (modern-day Turkey).","translation":"ストラボーンはポントスのアマセイア（現在のトルコ）で生まれました。","type":"biographical fact","meaning_category":"biography"},{"sentence":"**Strabo**'s 'Geographica' provides detailed descriptions of various regions of the Roman Empire.","translation":"ストラボンの『地理誌』は、ローマ帝国の様々な地域に関する詳細な記述を提供しています。","type":"work description","meaning_category":"works"},{"sentence":"Historians often cite **Strabo** as a primary source for understanding ancient cultures.","translation":"歴史家は、古代文化を理解するための主要な情報源として、しばしばストラボーンを引用します。","type":"historical context","meaning_category":"historical significance"}]}