{"word":"Peppercornish","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(rare) Resembling or relating to Cornwall, England, and/or its people, with a particular emphasis on the region's distinctive culinary traditions, especially those involving pepper.","english_definition":"(rare) Of or pertaining to Cornwall, England, especially with regard to its cuisine, and with a notable presence of pepper.","examples":[{"sentence":"The chef prepared a Peppercornish-style pasty, seasoned generously with black pepper.","translation":"シェフは、黒胡椒をたっぷりと効かせた、ペッパーコーニッシュ風のパスティを作った。"},{"sentence":"The restaurant's Peppercornish seafood stew was a hit with the tourists.","translation":"そのレストランのペッパーコーニッシュ風シーフードシチューは観光客に大人気だった。"}],"collocations":["Peppercornish pasty","Peppercornish stew","Peppercornish cuisine"],"synonyms":["Cornish","Cornish-style"],"antonyms":[]}],"etymology":{"value":"A blend of 'peppercorn' (referring to the spice, black pepper) and 'Cornish' (referring to Cornwall, a county in England). The term suggests a culinary style or dish from Cornwall that is notably seasoned with peppercorns or black pepper.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌpepərˈkɔːrnɪʃ/","syllables":"Pep-per-cor-nish"},"inflection":{},"usage_notes":{"explanation":"'Peppercornish' is a rare and somewhat whimsical term, not widely recognized or used. It is most likely to be encountered in culinary contexts, referring to dishes or cooking styles that are both Cornish in origin and feature a significant amount of black pepper. Because it is not a standard term, its meaning can vary depending on the user, but it generally implies a fusion of Cornish culinary tradition with a peppery flavor profile.","priority":"★☆☆"},"common_mistakes":{},"related_words":{"derivatives":["peppercorn","Cornish"],"phrases":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Peppercornish' is a niche, rarely used term. Understanding requires knowledge of both Cornish cuisine and the use of peppercorns as a seasoning. Its meaning is context-dependent and may not be immediately clear to most English speakers."},"example_sentences":[{"sentence":"The menu featured a 'Peppercornish' lamb dish, promising a spicy twist on a traditional Cornish recipe.","translation":"メニューには「ペッパーコーニッシュ」ラム料理があり、伝統的なコーンウォール風レシピにスパイシーなひねりを加えることを約束していた。","type":"adjective","meaning_category":"cuisine"}]}