{"word":"marrano","priority":"低","meanings":[{"part_of_speech":"noun","definition":"(歴史)スペインまたはポルトガルにおいて、キリスト教に改宗したユダヤ人、またはその子孫。特に、ユダヤ教の信仰を秘密裏に保持している者。","english_definition":"(historical) A Jew in Spain or Portugal who converted to Christianity, or one of their descendants, especially one suspected of secretly continuing to practice Judaism.","examples":[{"sentence":"During the Spanish Inquisition, many marranos were persecuted.","translation":"スペイン異端審問の間、多くのマラーノが迫害された。"},{"sentence":"Some historians believe that many marranos maintained their Jewish identity in secret for generations.","translation":"一部の歴史家は、多くのマラーノが何世代にもわたってユダヤ人のアイデンティティを秘密裏に維持していたと考えている。"}],"collocations":["crypto-Jew","secret Jew","forced convert"],"synonyms":["converso (より一般的な用語)","crypto-Jew"],"antonyms":[]}],"etymology":{"value":"スペイン語の「marrano」（豚、侮蔑的な意味合いも含む）に由来する。改宗したユダヤ人を侮辱する意図で使用された。豚はユダヤ教の食規定で禁じられているため、キリスト教への改宗が表面的であるという侮蔑的な意味合いが込められている。","priority":"★★☆"},"pronunciation":{"ipa":"/məˈrænoʊ/","syllables":"ma-rra-no"},"inflection":{"noun_plural":"marranos"},"usage_notes":{"explanation":"「**Marrano**」は歴史的な用語であり、現代では一般的に使用されません。使用する場合は、歴史的な文脈に限定し、慎重な配慮が必要です。侮蔑的な意味合いを含むため、使用を避けることが推奨される場合もあります。より中立的な用語として「converso」が用いられることがあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a marrano because he doesn't like pork.","correct":"✗ He is a converso because he doesn't like pork.","note":"「marrano」は、キリスト教に改宗したユダヤ人、またはその子孫を指す歴史的な用語です。豚肉を嫌いなだけでは「marrano」とは言えません。また、現代では侮蔑的な意味合いを持つため、注意が必要です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["marranism (マラーノ主義、マラーノの慣習)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (歴史的な用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 歴史的な文脈以外ではほとんど使用されない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Marrano**」は、スペインとポルトガルの歴史における特定の集団を指す専門用語であり、現代の日常会話ではほとんど使用されません。この単語は、キリスト教に改宗したユダヤ人、特にユダヤ教の信仰を秘密裏に保持していると疑われた人々を指します。歴史的な文脈で使用する場合でも、侮蔑的な意味合いを持つ可能性があるため、注意が必要です。この単語の理解には、スペイン異端審問などの歴史的背景知識が不可欠です。"},"example_sentences":[{"sentence":"The history of the Iberian Peninsula is marked by the presence of conversos and marranos.","translation":"イベリア半島の歴史は、コンベルソとマラーノの存在によって特徴づけられる。","type":"noun","meaning_category":"歴史的な用語"},{"sentence":"Researching my family history, I discovered that some of my ancestors were likely marranos.","translation":"私の家族の歴史を調べているうちに、祖先の一部がマラーノであった可能性が高いことがわかった。","type":"noun","meaning_category":"歴史的な用語"}]}