{"word":"stereography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"立体写真術、立体図法","english_definition":"The art, science, or process of making stereoscopic representations or drawings; a method of representing three-dimensional objects on a two-dimensional surface.","examples":[{"sentence":"Stereography is used to create 3D images from two-dimensional photographs.","translation":"立体写真術は、二次元の写真から三次元の画像を作成するために使用されます。"},{"sentence":"The stereography of the mountain range was incredibly detailed.","translation":"その山脈の立体図法は信じられないほど詳細でした。"}],"collocations":["stereographic projection","stereographic image","applied stereography"],"synonyms":["stereoscopy","3D imaging","3D representation"],"antonyms":[]}],"etymology":{"value":"From stereo- (meaning 'solid' or 'three-dimensional') + -graphy (meaning 'drawing' or 'writing').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsteriˈɒɡrəfi/","syllables":"ste-re-og-ra-phy"},"inflection":{"noun_plural":"stereographies"},"usage_notes":{"explanation":"Stereography refers to the techniques used to create or represent three-dimensional images. It encompasses both the creation of stereoscopic images (viewed with special equipment to appear 3D) and the methods of projecting 3D objects onto a 2D plane, such as in maps or technical drawings. The term is less commonly used in everyday conversation compared to 'stereoscopy' or '3D imaging'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used stereography to take a picture of his family.","correct":"✓ He used a stereoscopic camera to take a picture of his family.","note":"Stereography is the technique, not the device. A stereoscopic camera is used to take stereoscopic pictures."},{"incorrect":"✗ The stereography was very colorful.","correct":"✓ The stereoscopic image was very colorful.","note":"Stereography is the process, the result is a stereoscopic image."}],"priority":"★★☆"},"related_words":{"derivatives":["stereographic (adjective)","stereographer (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stereography' is a technical term referring to the methods used to represent three-dimensional objects or scenes in two dimensions, or to create the illusion of depth. It is primarily used in technical, scientific, or artistic contexts related to imaging, mapping, and 3D representation. Understanding the term requires familiarity with concepts of spatial representation and visual perception."},"example_sentences":[{"sentence":"The cartographer used stereography to create a more realistic map.","translation":"その地図製作者は、より現実的な地図を作成するために立体図法を使用しました。","type":"general","meaning_category":"立体図法"},{"sentence":"Advances in stereography have led to more immersive virtual reality experiences.","translation":"立体写真術の進歩により、より没入感のあるバーチャルリアリティ体験が実現しました。","type":"technical","meaning_category":"立体写真術"},{"sentence":"The stereography of the protein structure allowed scientists to better understand its function.","translation":"タンパク質の構造の立体図法により、科学者はその機能をより良く理解することができました。","type":"scientific","meaning_category":"立体図法"}]}