{"word":"unselection","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"選ばれなかったこと、選択解除、選択から除外","english_definition":"The act of not selecting; the removal of something from a selection.","examples":[{"sentence":"The unselection of the candidate surprised many.","translation":"その候補者が選ばれなかったことは多くの人を驚かせた。"},{"sentence":"The unselection process was carefully reviewed to ensure fairness.","translation":"選択解除のプロセスは、公平性を確保するために慎重にレビューされた。"},{"sentence":"Unselection can occur due to various factors, including performance and availability.","translation":"選択解除は、パフォーマンスや可用性を含むさまざまな要因により発生する可能性がある。"}],"collocations":["unselection process (選択解除プロセス)","unselection criteria (選択解除基準)","unselection rate (選択解除率)"],"synonyms":["deselection","exclusion","rejection","elimination"],"antonyms":["selection","inclusion","choice","acceptance"]},{"part_of_speech":"名詞","definition":"(遺伝学)自然淘汰などによる選択の逆の過程","english_definition":"(Genetics) The opposite of selection, such as through natural selection.","examples":[{"sentence":"Unselection pressures can lead to genetic drift.","translation":"選択解除の圧力は遺伝的浮動につながる可能性がある。"},{"sentence":"The unselection of certain traits can be as important as the selection of others.","translation":"特定の特性の選択解除は、他の特性の選択と同じくらい重要になる可能性がある。"}],"collocations":["unselection pressure (選択解除圧力)","genetic unselection (遺伝的選択解除)"],"synonyms":["negative selection"],"antonyms":["selection","natural selection"]}],"etymology":{"value":"\"un-\" (否定の接頭辞) + \"selection\"","priority":"中"},"pronunciation":{"ipa":"/ˌʌnsɪˈlɛkʃən/","syllables":"un-se-lec-tion"},"inflection":{"notes":"複数形: unselections"},"usage_notes":{"explanation":"\"Unselection\" is a relatively uncommon word. It generally refers to the act of removing something or someone from a selection. In genetics, it refers to the opposite of selection, where certain traits are not favored and thus decrease in frequency. The context usually makes the meaning clear.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"The unselection was a surprise.","correct":"The unselection *of the candidate* was a surprise.","note":"It's better to specify what or who was unselected to avoid ambiguity."}],"priority":"低"},"related_words":{"derivatives":["unselected"],"related":["select","selection","deselect"]},"level_frequency":{"CEFR":"不明","frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"C2","text":"\"Unselection\" is a formal and relatively rare term. It is best understood in contrast to \"selection.\" It refers to the act or process of removing something from a selection or not choosing it in the first place. In genetic contexts, it refers to the lack of selection pressure for a trait, which can lead to its decline in a population."},"example_sentences":[{"sentence":"The unselection of that design element improved the overall aesthetic.","translation":"そのデザイン要素を選択解除したことで、全体的な美観が向上した。","type":"noun","meaning_category":"選択解除"},{"sentence":"The unselection of weaker employees was necessary for the company's survival.","translation":"企業の存続のためには、より弱い従業員の選択解除が必要だった。","type":"noun","meaning_category":"選択解除"},{"sentence":"Unselection pressures in the environment led to the decline of the species.","translation":"環境における選択解除の圧力により、その種の衰退につながった。","type":"noun","meaning_category":"遺伝学"}]}