{"word":"Puppify","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(主に画像や動画を)子犬のように可愛らしくする、子犬風に加工する","english_definition":"To make something (usually an image or video) appear cute or puppy-like, often through digital manipulation or filters.","examples":[{"sentence":"I used an app to puppify my cat's picture.","translation":"アプリを使って飼い猫の写真を子犬風に加工しました。"},{"sentence":"Let's puppify this video with some cute filters!","translation":"この動画を可愛いフィルターで子犬風に加工しよう！"}],"collocations":["puppify an image","puppify a video","puppify a photo","puppify with filters"],"synonyms":["make cute","add puppy features","apply puppy filter"],"antonyms":["uglify","make scary"]},{"part_of_speech":"noun","definition":"子犬風に加工すること、またはその加工されたもの","english_definition":"The act of making something puppy-like, or the result of such an action.","examples":[{"sentence":"The puppify effect made the baby look like a cartoon character.","translation":"子犬風加工の効果で、赤ちゃんが漫画のキャラクターのように見えた。"},{"sentence":"She's obsessed with the puppify feature on that app.","translation":"彼女はそのアプリの子犬風加工機能に夢中だ。"}],"collocations":["puppify effect","puppify feature","digital puppify"],"synonyms":["puppy filter","cute filter"]}],"etymology":{"value":"A neologism formed by combining \"puppy\" (a young dog) with the suffix \"-ify\" (to make or become).","priority":"★★★"},"pronunciation":{"ipa":"ˈpʌpɪfaɪ","syllables":"pup-pi-fy"},"inflection":{"verb_forms":{"present_simple":["puppify","puppifies"],"past_simple":"puppified","past_participle":"puppified","present_participle":"puppifying"},"noun_plural":"puppifies (rare)"},"usage_notes":{"explanation":"\"Puppify\" is a relatively new and informal term, primarily used in the context of digital image and video editing. It refers to the process of adding features or effects that resemble those of puppies, such as large eyes, floppy ears, or a generally cute and innocent appearance. The term is most commonly associated with mobile apps and social media filters.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I puppified my car.","correct":"✓ I made my car look cute with stickers.","note":"\"Puppify\" is typically used for living things, especially faces, not inanimate objects like cars."},{"incorrect":"✗ He is very puppified.","correct":"✓ He looks very cute.","note":"Avoid using \"puppified\" to describe a person's general state. It's usually applied to images or videos after editing."}],"priority":"★★☆"},"related_words":{"derivatives":["puppification (noun: the process of puppifying)"],"related_terms":["dogify","catify","beautify","cartoonify"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not a standard CEFR word)","frequency_google_ngram":"Low frequency (relatively new and niche term)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Puppify\" is a relatively new and informal word, meaning to make something look like a cute puppy, typically by using a filter or editing software on a photo or video. It's not a common word in formal contexts, but is understood within online communities and among users of social media and photo editing apps. The word is formed by adding the suffix \"-ify\" to the word \"puppy,\" which means to make or transform into something. It's mostly used in a lighthearted or humorous way."},"example_sentences":[{"sentence":"She used a filter on Snapchat to puppify her selfie.","translation":"彼女はスナップチャットのフィルターを使って自分の自撮り写真を子犬風に加工した。","type":"verb","meaning_category":"子犬風に加工する"},{"sentence":"The app has a new feature that lets you puppify any photo.","translation":"そのアプリにはどんな写真でも子犬風に加工できる新機能がある。","type":"verb","meaning_category":"子犬風に加工する"},{"sentence":"The puppify effect made the baby's eyes look huge and adorable.","translation":"子犬風加工の効果で、赤ちゃんの目が大きくてもっと可愛く見えた。","type":"noun","meaning_category":"子犬風に加工すること"}]}