{"word":"pentarchical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"五頭政治の、五人組による統治の","english_definition":"Of or relating to a pentarchy; ruled by five people.","examples":[{"sentence":"The Roman Empire was briefly pentarchical after the Tetrarchy collapsed.","translation":"テトラルキアが崩壊した後、ローマ帝国は一時的に五頭政治となった。"},{"sentence":"Some historians argue that the early church was effectively pentarchical.","translation":"初期の教会は事実上、五頭政治であったと主張する歴史家もいる。"}],"collocations":["pentarchical system","pentarchical rule"],"synonyms":["oligarchical","aristocratic"],"antonyms":["democratic","monarchical"]}],"etymology":{"value":"Derived from the Greek words 'penta' (five) and 'archē' (rule).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpentɑːrˈkɪkəl/","syllables":"pen-tar-chi-cal"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Pentarchical' is primarily used in historical and political contexts to describe systems or periods where power is shared among five individuals or entities. It is relatively rare in modern usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pentarchical government was very democratic.","correct":"✓ The pentarchical government was not very democratic.","note":"Pentarchical systems are typically oligarchical, not democratic, as power is concentrated among a few individuals."}],"priority":"★☆☆"},"related_words":{"derivatives":["pentarchy (noun): A government by five people.","pentarch (noun): One of five joint rulers."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pentarchical' is a specialized term used in political science and history. It describes a form of government where power is distributed among five rulers. Understanding this term requires familiarity with concepts of political organization and historical contexts where such systems have existed. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The Byzantine Empire experienced a period of quasi-pentarchical governance.","translation":"ビザンチン帝国は準五頭政治の統治期間を経験した。","type":"adjective","meaning_category":"五頭政治の"},{"sentence":"The agreement established a pentarchical council to oversee the region.","translation":"その合意により、地域を監督する五頭政治評議会が設立された。","type":"adjective","meaning_category":"五頭政治の"}]}