{"word":"micropopulation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(生物学)非常に小さな個体群、微小個体群","english_definition":"A very small, localized population of organisms.","examples":[{"sentence":"The island contains a micropopulation of a rare species of lizard.","translation":"その島には、希少なトカゲの微小個体群が生息している。"},{"sentence":"Genetic drift can have a significant impact on micropopulations.","translation":"遺伝的浮動は、微小個体群に大きな影響を与える可能性がある。"},{"sentence":"Conservation efforts are focused on protecting the remaining micropopulations of this endangered plant.","translation":"保全活動は、この絶滅危惧種の残された微小個体群の保護に重点を置いている。"}],"collocations":["isolated micropopulation (隔離された微小個体群)","small micropopulation (小さな微小個体群)","vulnerable micropopulation (脆弱な微小個体群)","island micropopulation (島の微小個体群)","local micropopulation (局所的な微小個体群)"],"synonyms":["small population","localized population","isolated group"],"antonyms":["large population","widespread population"]}],"etymology":{"value":"\"micro-\" (小さい) + \"population\" (個体群)","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪkroʊˌpɒpjʊˈleɪʃən/","syllables":"mi-cro-pop-u-la-tion"},"inflection":{"noun_plural":"micropopulations"},"usage_notes":{"explanation":"\"Micropopulation\" refers to a very small and often isolated group of organisms. Due to their small size, these populations are particularly vulnerable to genetic drift, inbreeding, and environmental changes, which can lead to a loss of genetic diversity and an increased risk of extinction. Conservation efforts often target micropopulations to prevent further decline and to promote their recovery.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The micropopulation is very big.","correct":"✓ The micropopulation is very small.","note":"Micropopulations, by definition, are small populations. Using \"big\" to describe them is contradictory."},{"incorrect":"✗ Micropopulations are not affected by genetic drift.","correct":"✓ Micropopulations are significantly affected by genetic drift.","note":"Small populations are more susceptible to genetic drift than larger populations."}],"priority":"★★☆"},"related_words":{"derivatives":["population","microorganism","microhabitat"],"related_terms":["genetic drift","inbreeding","bottleneck effect","founder effect","conservation biology","population genetics"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term \"micropopulation\" is used in biology to describe a very small group of organisms living in a specific area. Because these groups are small, they are more likely to be affected by things like random changes in their genes (genetic drift) or breeding with close relatives (inbreeding). This can make them more likely to disappear. Scientists who study conservation often focus on these small groups to help protect them."},"example_sentences":[{"sentence":"The researchers studied the genetic diversity within the island's **micropopulation** of finches.","translation":"研究者たちは、その島のフィンチの微小個体群内の遺伝的多様性を調査した。","type":"scientific"},{"sentence":"Habitat fragmentation has led to the creation of several isolated **micropopulations** of the endangered frog.","translation":"生息地の分断化は、絶滅危惧種のカエルのいくつかの隔離された微小個体群の生成につながった。","type":"ecological"},{"sentence":"The long-term survival of the species depends on the health and stability of its remaining **micropopulations**.","translation":"その種の長期的な生存は、残された微小個体群の健康と安定にかかっている。","type":"conservation"}]}