{"word":"biosystematy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"生物系統学","english_definition":"The study of the evolutionary relationships among organisms, with an emphasis on the processes responsible for diversification.","examples":[{"sentence":"Biosystematy uses various methods, including molecular data and morphological analysis, to understand species relationships.","translation":"生物系統学は、種の関係を理解するために、分子データや形態学的分析を含む様々な方法を使用します。"}],"collocations":["molecular biosystematy","plant biosystematy"],"synonyms":["systematics","taxonomy","phylogenetics"],"antonyms":[]}],"etymology":{"value":"'Bio-' (life) + 'systematy' (systematics, the study of the diversity of organisms and their relationships).","priority":"★★★"},"pronunciation":{"ipa":"/ˌbaɪoʊsɪstəˈmæti/","syllables":"bi-o-sys-te-ma-ty"},"inflection":{"noun_plural":"biosystematies"},"usage_notes":{"explanation":"Biosystematy is often used interchangeably with systematics or phylogenetics, but it specifically emphasizes the evolutionary processes that have led to the diversity of life. It integrates data from various fields, such as genetics, morphology, ecology, and biogeography.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Biosystematy is only about classifying organisms.","correct":"✓ Biosystematy is about understanding the evolutionary relationships and processes behind the diversity of organisms.","note":"Biosystematy is not just about classification, but also about understanding the evolutionary history and processes that have shaped the diversity of life."}],"priority":"★★☆"},"related_words":{"derivatives":["biosystematic (adjective)"],"phrases":["molecular phylogenetics","comparative genomics","population genetics"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Biosystematy is a specialized term used in biology to describe the study of the evolutionary relationships among organisms, focusing on the processes that drive diversification. It's an interdisciplinary field that combines data from various sources, such as genetics, morphology, and ecology, to understand how species evolve and relate to one another. This term is typically encountered in advanced biology courses or scientific literature.","priority":"★★★"},"example_sentences":[{"sentence":"The biosystematy of the genus *Rosa* is complex due to hybridization.","translation":"バラ属の生物系統学は、交雑のために複雑である。","type":"general","meaning_category":"evolutionary relationships"},{"sentence":"Molecular data plays a crucial role in modern biosystematy studies.","translation":"分子データは、現代の生物系統学研究において重要な役割を果たしている。","type":"general","meaning_category":"molecular data"}]}