{"word":"preceptor","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"指導者、教師、特に実践的な訓練を行う指導者（医学生、看護学生などに対する臨床指導医など）","english_definition":"A teacher or instructor, especially one who gives practical instruction; a tutor. Often used to refer to a clinical instructor for medical or nursing students.","examples":[{"sentence":"The medical student learned a great deal from her preceptor during the clinical rotation.","translation":"その医学生は臨床実習中に指導医から多くのことを学んだ。"},{"sentence":"The nursing preceptor guided the new graduate through her first few weeks on the job.","translation":"看護指導者は新卒者が就職して最初の数週間を過ごすのを指導した。"},{"sentence":"He served as a preceptor for several years, mentoring aspiring doctors.","translation":"彼は何年もの間、指導者として将来の医師たちの指導にあたった。"}],"collocations":["clinical preceptor (臨床指導医)","nursing preceptor (看護指導者)","medical preceptor (医学指導者)","preceptor program (指導者プログラム)","mentor and preceptor (指導者とメンター)"],"synonyms":["mentor","instructor","tutor","teacher","guide","coach"],"antonyms":["student","learner","trainee"]}],"etymology":{"value":"ラテン語の『praeceptor』に由来し、『praecipere』（教える、指示する）から派生。prae-（前に）+ capere（取る、持つ）が語源。つまり、「先んじて知識や指導を与える人」という意味合いを持つ。","priority":"★★★"},"pronunciation":{"ipa":"/priˈsɛptər/","syllables":"pre-cep-tor"},"inflection":{"noun_plural":"preceptors"},"usage_notes":{"explanation":"「**preceptor**」は、特に実践的な訓練や指導を行う人を指す言葉です。大学教授のような講義形式の教育者というよりは、むしろ、現場で直接指導する役割の人を指します。医学、看護学、教育学などの分野でよく用いられ、学生や研修生が実際の業務を通してスキルを習得するのをサポートします。メンターと似た意味合いを持ちますが、preceptorはより具体的な技能や知識の伝授に重点を置く傾向があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a preceptor at the university, giving lectures on history.","correct":"✓ She is a professor at the university, giving lectures on history.","note":"preceptorは講義を行う人ではなく、実践的な指導を行う人を指します。講義を行う場合はprofessorが適切です。"},{"incorrect":"✗ The student preceptor guided the experienced nurse.","correct":"✓ The nurse preceptor guided the student nurse.","note":"preceptorは指導する側、studentは指導を受ける側です。役割を混同しないようにしましょう。"}],"priority":"★★☆"},"related_words":{"derivatives":["precept (名詞: 教訓、戒律、原則)","preceptive (形容詞: 教訓的な、指導的な)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 特定の専門分野でよく使われる語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**preceptor**」は、特に医療や教育の分野で、実践的な指導を行う先生や指導者を指す言葉です。大学の講義をする教授というよりは、病院で医学生を指導する医師や、学校で実習生を指導するベテラン教師のようなイメージです。つまり、実際に現場で経験を積ませながら、具体的なスキルや知識を教える役割の人を指します。日常会話ではあまり使いませんが、専門的な文脈では重要な言葉です。"},"example_sentences":[{"sentence":"The new teachers were assigned a preceptor to help them navigate their first year.","translation":"新任教師たちは、最初の1年を乗り切るために指導教官が割り当てられた。","type":"noun","meaning_category":"指導者"},{"sentence":"As a preceptor, she provided valuable feedback to the student nurses.","translation":"指導者として、彼女は看護学生たちに貴重なフィードバックを提供した。","type":"noun","meaning_category":"指導者"},{"sentence":"The preceptor program aims to improve the quality of clinical education.","translation":"指導者プログラムは、臨床教育の質を向上させることを目的としている。","type":"noun","meaning_category":"指導者"}]}