{"word":"rheometry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"レオメトリー、レオロジー測定","english_definition":"The experimental technique of determining the rheological properties of a material.","examples":[{"sentence":"Rheometry is used to characterize the flow and deformation behavior of complex fluids.","translation":"レオメトリーは、複雑な流体の流れと変形の挙動を特徴づけるために使用されます。"},{"sentence":"Different rheometry techniques are suitable for different types of materials and flow conditions.","translation":"異なるレオメトリー技術は、異なる種類の材料および流れの条件に適しています。"}],"collocations":["viscosity measurement","elasticity measurement","flow curve","dynamic rheometry","rotational rheometry"],"synonyms":["rheological measurement","viscometry"],"antonyms":[]}],"etymology":{"value":"From 'rheo-' (Greek for 'flow') + '-metry' (measurement).","priority":"★★☆"},"pronunciation":{"ipa":"/riˈɒmətri/","syllables":"rhe-om-e-try"},"inflection":{"noun_plural":"rheometries"},"usage_notes":{"explanation":"Rheometry is a specialized field within rheology, focusing on the experimental techniques used to measure the rheological properties of materials. It involves using instruments called rheometers to apply controlled stresses or strains to a sample and measuring the resulting deformation or flow.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used rheometer to measure the viscosity.","correct":"✓ I used rheometry to measure the viscosity.","note":"Rheometry is the technique, while a rheometer is the instrument used in the technique."}],"priority":"★★☆"},"related_words":{"derivatives":["rheometer","rheological","rheology"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Rheometry is a technical term used in physics, engineering, and material science. It refers to the measurement of a material's flow and deformation properties. This term is typically encountered in scientific literature and technical discussions related to fluid mechanics and material characterization."},"example_sentences":[{"sentence":"The **rheometry** data provided valuable insights into the material's viscoelastic behavior.","translation":"レオメトリーのデータは、材料の粘弾性挙動に関する貴重な洞察を提供しました。","type":"general","meaning_category":"Definition"},{"sentence":"**Rheometry** techniques can be used to optimize the processing conditions for polymer melts.","translation":"レオメトリー技術は、ポリマー溶融物の加工条件を最適化するために使用できます。","type":"application","meaning_category":"Application"}]}