{"word":"Hogarthian","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ホガース風の、ホガースを思わせる","english_definition":"resembling or characteristic of the work of William Hogarth, especially in being satirical, moralizing, and depicting scenes of urban life.","examples":[{"sentence":"The novel's depiction of London society is Hogarthian in its detail and cynicism.","translation":"その小説のロンドン社会描写は、その詳細さと皮肉さにおいてホガース風である。"},{"sentence":"The political cartoon had a Hogarthian quality, with its exaggerated characters and biting social commentary.","translation":"その政治漫画は、誇張されたキャラクターと辛辣な社会批評によって、ホガース風の性質を持っていた。"}],"collocations":["Hogarthian satire","Hogarthian scene","Hogarthian detail","Hogarthian comedy","Hogarthian realism"],"synonyms":["satirical","moralizing","realistic","grotesque","caricatural"],"antonyms":["idealistic","romantic","flattering"]}],"etymology":{"value":"William Hogarth (1697-1764), an English painter, printmaker, pictorial satirist, social critic, and editorial cartoonist, + -ian.","priority":"★★★"},"pronunciation":{"ipa":"/hoʊˈɡɑːrθiən/","syllables":"Ho-garth-i-an"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Hogarthian' is used to describe something that resembles the style or themes of William Hogarth's art. This often includes satirical depictions of society, moral commentary, and realistic portrayals of urban life, often with grotesque or exaggerated elements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was very Hogarth.","correct":"✓ The painting was very Hogarthian.","note":"'Hogarth' is a proper noun (the artist's name). To use it as an adjective, you need the '-ian' suffix."}],"priority":"★★☆"},"related_words":{"derivatives":["Hogarth (noun: the artist himself)"],"priority":"★★★"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Hogarthian' is an adjective used to describe something that is similar to the style or themes found in the works of William Hogarth, an 18th-century English artist known for his satirical and moralizing depictions of society. Using this word implies that the subject has elements of social commentary, realism, and often a critical or humorous perspective on human behavior and urban life. It is not a commonly used word and is more often found in art criticism or historical discussions."},"example_sentences":[{"sentence":"The film's depiction of poverty and crime was described as intensely Hogarthian.","translation":"その映画における貧困と犯罪の描写は、非常にホガース風だと評された。","type":"adjective","meaning_category":"resembling Hogarth's style"},{"sentence":"The artist's Hogarthian prints offered a scathing critique of the upper classes.","translation":"そのアーティストのホガース風の版画は、上流階級に対する痛烈な批判を提供した。","type":"adjective","meaning_category":"resembling Hogarth's style"},{"sentence":"The play's Hogarthian characters were exaggerated and often morally dubious.","translation":"その劇のホガース風の登場人物は誇張されており、しばしば道徳的に疑わしかった。","type":"adjective","meaning_category":"resembling Hogarth's style"}]}