{"word":"serology","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"血清学、血清検査学","english_definition":"The scientific study of serum and other bodily fluids. In practice, it is the diagnostic identification of antibodies in serum.","examples":[{"sentence":"Serology tests can help diagnose infectious diseases.","translation":"血清学的検査は感染症の診断に役立ちます。"},{"sentence":"The serology lab performs a variety of tests on blood samples.","translation":"血清検査室では、血液サンプルに対して様々な検査が行われます。"},{"sentence":"Serology is an important tool in epidemiological studies.","translation":"血清学は疫学研究において重要なツールです。"}],"collocations":["serology test","serology lab","perform serology","serological marker","serological evidence"],"synonyms":["serum analysis","antibody testing","immunodiagnostics"],"antonyms":[]}],"etymology":{"value":"From 'serum' (Latin for whey, the watery part of milk) + '-ology' (from Greek 'logia' meaning study of).","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˈrɒlədʒi/","syllables":"se-rol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Serology is primarily used in medicine and veterinary medicine to identify antibodies and antigens, which can indicate the presence of an infection, autoimmune disease, or other immune-related conditions. It is also used in research to study immune responses. The term generally refers to tests performed on blood serum, but can also include tests on other bodily fluids.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor ordered a serology to check my liver function.","correct":"✓ The doctor ordered a liver function test. / ✓ The doctor ordered serology to check for specific antibodies.","note":"Serology is specifically for detecting antibodies or antigens, not for general organ function tests."},{"incorrect":"✗ Serology is the study of all blood cells.","correct":"✓ Serology is the study of serum and other bodily fluids, particularly for antibodies and antigens.","note":"The study of all blood cells is hematology, not serology."}],"priority":"★★☆"},"related_words":{"derivatives":["serological (adjective)","serologist (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Serology' is a specialized term used in the fields of medicine and biology. It refers to the study of serum, which is the fluid part of blood after clotting, and other bodily fluids. Serology tests are commonly used to identify antibodies and antigens, which can help diagnose diseases, especially infectious diseases and autoimmune disorders. Because it's a technical term, it's more likely to be encountered in scientific literature or medical settings rather than in everyday conversation."},"example_sentences":[{"sentence":"The **serology** results confirmed the presence of antibodies against the virus.","translation":"血清学的検査の結果、そのウイルスに対する抗体の存在が確認されました。","type":"noun","meaning_category":"血清学"},{"sentence":"The **serology** lab is equipped with advanced instruments for accurate testing.","translation":"その血清検査室には、正確な検査を行うための高度な機器が備わっています。","type":"noun","meaning_category":"血清検査学"},{"sentence":"**Serology** plays a crucial role in monitoring the spread of infectious diseases.","translation":"血清学は感染症の蔓延を監視する上で重要な役割を果たします。","type":"noun","meaning_category":"血清学"}]}