{"word":"diglottic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"二重言語の、二言語併用の","english_definition":"Relating to or characterized by diglossia (the use of two distinct varieties of a language within a speech community, one a high variety for formal contexts and the other a low variety for informal contexts).","examples":[{"sentence":"The sociolinguistic situation in the country is diglottic, with the standard language used in education and government, and the local dialect used at home.","translation":"その国の社会言語学的な状況は二重言語的であり、標準語は教育や政府で使用され、地元の言葉は家庭で使用されている。"}],"collocations":["diglottic situation","diglottic community","diglottic society"],"synonyms":["bilingual","multilingual"],"antonyms":["monolingual"]}],"etymology":{"value":"From 'diglossia' (formed from Greek 'di-' meaning 'two' and 'glossa' meaning 'tongue, language') + '-ic'.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈɡlɒtɪk/","syllables":"di-glot-tic"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more diglottic' and 'most diglottic', respectively."},"usage_notes":{"explanation":"'Diglottic' is used to describe situations, communities, or individuals where diglossia is present. Diglossia refers to the coexistence of two distinct varieties of the same language in a community, where each variety has a specific function. The 'high' variety is typically used in formal settings, such as education, government, and literature, while the 'low' variety is used in informal settings, such as home and casual conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country is diglottic because they speak two languages.","correct":"✓ The country is bilingual because they speak two languages.","note":"'Diglottic' specifically refers to the use of two varieties of the *same* language with distinct functions, not just any two languages. 'Bilingual' is the more general term for speaking two languages."}],"priority":"★★☆"},"related_words":{"derivatives":["diglossia (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Diglottic' is a specialized term primarily used in sociolinguistics. It describes a situation where two varieties of the same language are used in a community, each with distinct functions (a high variety for formal contexts and a low variety for informal contexts). It is not a commonly used word outside of academic discussions of language. Understanding the concept of diglossia is necessary to understand the meaning of 'diglottic'."},"example_sentences":[{"sentence":"Switzerland is not a diglottic country, as it has multiple official languages that are used in different regions.","translation":"スイスは二重言語の国ではありません。なぜなら、異なる地域で使用される複数の公用語があるからです。","type":"adjective","meaning_category":"二重言語の"},{"sentence":"The diglottic nature of Arabic is evident in the difference between Modern Standard Arabic and the various colloquial dialects.","translation":"アラビア語の二重言語的な性質は、現代標準アラビア語と様々な口語方言の間の違いに明らかです。","type":"adjective","meaning_category":"二重言語の"}]}