{"word":"malaceous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学)リンゴのような果実の、またはリンゴのような果実を持つ","english_definition":"Of or pertaining to plants of the apple family; resembling or having apples or pomes.","examples":[{"sentence":"The malaceous fruits are generally sweet and juicy.","translation":"リンゴのような果実は一般的に甘くてジューシーです。"},{"sentence":"Malaceous plants are often cultivated for their edible fruits.","translation":"リンゴのような植物は、食用果実のために栽培されることが多いです。"}],"collocations":["malaceous fruit","malaceous plant"],"synonyms":["pomaceous"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'malum' meaning 'apple'.","priority":"★★★"},"pronunciation":{"ipa":"/məˈleɪʃəs/","syllables":"ma-la-ce-ous"},"inflection":{},"usage_notes":{"explanation":"The term 'malaceous' is primarily used in botanical contexts to describe plants that bear fruits resembling apples or belonging to the apple family (Rosaceae, subfamily Maloideae). It is not a commonly used word in everyday language.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Malaceae (former name of the apple subfamily)","Malus (apple genus)"],"related_terms":["Rosaceae (rose family)","pome (fleshy fruit with a core containing seeds, like an apple)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Malaceous' is a technical term used in botany to describe plants bearing fruits similar to apples. Its usage is confined to specialized contexts, making it uncommon in general conversation. Understanding the term requires familiarity with botanical classifications and terminology."},"example_sentences":[{"sentence":"The pear is another example of a malaceous fruit.","translation":"ナシはリンゴのような果実の別の例です。","type":"adjective","meaning_category":"リンゴのような果実の"},{"sentence":"Many malaceous species are susceptible to similar diseases.","translation":"多くのリンゴのような種は、同様の病気にかかりやすいです。","type":"adjective","meaning_category":"リンゴのような果実を持つ"}]}