{"word":"onomomancy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"人名や地名などの名前の文字や音に基づいて運勢を占うこと、姓名判断","english_definition":"divination based on the letters and sounds of names (of people, places, etc.)","examples":[{"sentence":"Onomomancy was practiced in ancient times to determine a person's fate based on their name.","translation":"姓名判断は古代において、人の運命を名前に基づいて決定するために行われていた。"},{"sentence":"Some people believe in onomomancy and choose names for their children carefully.","translation":"姓名判断を信じ、子供の名前を注意深く選ぶ人もいる。"}],"collocations":["practice onomomancy (姓名判断を行う)","believe in onomomancy (姓名判断を信じる)"],"synonyms":["name divination"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「onoma」（名前）+ 「manteia」（占い）に由来","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒnəˈmɒmənsi/","syllables":"o-no-mo-man-cy"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"Onomomancy is a form of divination that interprets the hidden meaning or influence of names. It is often associated with numerology, where each letter is assigned a numerical value, and the sum is used to determine characteristics or predict future events.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Onomomancy is a science.","correct":"✓ Onomomancy is a form of divination.","note":"Onomomancy is considered a pseudoscience or a form of divination, not a science. It lacks empirical evidence. "},{"incorrect":"✗ I use onomomancy for medical diagnosis.","correct":"✓ I use onomomancy to understand personality traits.","note":"Onomomancy is used for understanding personality traits, predicting future events, or understanding hidden meanings, not for medical diagnosis."}],"priority":"★★☆"},"related_words":{"derivatives":["onomancer (姓名判断師)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Onomomancy is a specialized term referring to divination through names. It is not commonly used in everyday conversation, and understanding it requires familiarity with the concept of divination and etymology of the word. It's most likely encountered in contexts discussing historical or esoteric practices."},"example_sentences":[{"sentence":"The old book described various methods of onomomancy used in different cultures.","translation":"その古い本は、さまざまな文化で使用されている姓名判断のさまざまな方法について説明していた。","type":"general","meaning_category":"占い"},{"sentence":"She consulted an expert in onomomancy before naming her business.","translation":"彼女はビジネスの名前を付ける前に、姓名判断の専門家に相談した。","type":"general","meaning_category":"占い"}]}