{"word":"Futurisms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"未来派（Futurism）の複数の形態、または未来派の原則やスタイルの多様性。","english_definition":"Plural form of Futurism, referring to multiple forms or expressions of the Futurism movement, or the diverse principles and styles associated with it.","examples":[{"sentence":"The exhibition showcased various Futurisms, highlighting the movement's evolution across different countries.","translation":"その展覧会では様々な未来派が展示され、異なる国々における運動の進化が強調された。"},{"sentence":"Scholars debate the different Futurisms, analyzing how the movement adapted to various cultural and political contexts.","translation":"学者たちは様々な未来派について議論し、その運動がどのように多様な文化的、政治的背景に適応したかを分析している。"}],"collocations":["different Futurisms","various Futurisms","early Futurisms","later Futurisms","Italian Futurisms","Russian Futurisms"],"synonyms":["avant-gardism","modernisms","post-futurism"],"antonyms":["traditionalism","classicism"],"notes":"'Futurisms' is used to acknowledge the multifaceted nature of the Futurism movement, which manifested differently in various regions and periods."}],"etymology":{"value":"Derived from 'Futurism,' a term coined in the early 20th century to describe an artistic and social movement that emphasized speed, technology, youth, and violence, and objects such as the car, the airplane, and the industrial city. The suffix '-isms' indicates multiple manifestations or interpretations of the core principles.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfjuːtʃərɪzəmz/","syllables":"fu-tur-is-ms"},"inflection":{"noun_plural":"Futurisms"},"usage_notes":{"explanation":"'Futurisms' is used in academic or critical contexts to discuss the variations and developments within the broader Futurism movement. It acknowledges that Futurism was not a monolithic entity but rather a collection of related ideas and practices that evolved over time and in different geographical locations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a fan of Futurism, and he likes all futurisms.","correct":"✓ He is a fan of Futurism, and he likes all aspects of it.","note":"When referring to a general appreciation of the movement, 'Futurism' is more appropriate. 'Futurisms' is used when discussing specific variations or interpretations."}],"priority":"★★☆"},"related_words":{"derivatives":["Futurism","Futurist","Futuristic"],"related_movements":["Cubism","Constructivism","Expressionism","Dadaism"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Futurisms' is a term used in art history and cultural studies to refer to the diverse expressions and interpretations of the Futurism movement. It's used to acknowledge that Futurism wasn't a single, unified phenomenon but rather a collection of related ideas that evolved differently in various contexts. Understanding this term requires familiarity with art historical discourse and the complexities of the Futurism movement itself."},"example_sentences":[{"sentence":"The conference explored the diverse Futurisms that emerged in Europe and Russia during the early 20th century.","translation":"その会議では、20世紀初頭にヨーロッパとロシアで生まれた多様な未来派が探求された。","type":"academic","meaning_category":"diverse expressions of Futurism"},{"sentence":"Critics often distinguish between the radical Italian Futurisms and the more socially oriented Russian Futurisms.","translation":"批評家はしばしば、急進的なイタリア未来派と、より社会志向のロシア未来派を区別する。","type":"art historical","meaning_category":"regional variations of Futurism"}]}