{"word":"mind-sick","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"精神的に病んだ、憂鬱な、悩んでいる","english_definition":"Mentally or emotionally troubled; depressed or worried.","examples":[{"sentence":"He was mind-sick with grief after losing his wife.","translation":"彼は妻を亡くした後、悲しみに打ちひしがれていた。"},{"sentence":"The constant stress made her mind-sick and unable to focus.","translation":"絶え間ないストレスで彼女は精神的に病み、集中できなくなった。"},{"sentence":"She felt mind-sick after witnessing the accident.","translation":"彼女はその事故を目撃した後、精神的に苦しんだ。"}],"collocations":["mind-sick with grief (悲しみで精神的に病んだ)","mind-sick with worry (心配で精神的に病んだ)","feel mind-sick (精神的に病んだと感じる)"],"synonyms":["depressed","anxious","troubled","distressed","unhappy","melancholy","morbid"],"antonyms":["happy","content","peaceful","untroubled","healthy"],"notes":"This word often implies a deep emotional or psychological distress."}],"etymology":{"value":"A compound word formed by combining 'mind' (referring to the intellect or emotions) and 'sick' (referring to illness or distress).","priority":"★★★"},"pronunciation":{"ipa":"/ˈmaɪndˌsɪk/","syllables":"mind-sick"},"inflection":{"notes":"Since it's an adjective, it can be used to describe nouns. It doesn't have different forms like verbs do."},"usage_notes":{"explanation":"'Mind-sick' is used to describe someone who is suffering from mental or emotional distress. It suggests a state of being unwell in the mind, often due to worry, grief, or other negative emotions. It's not a commonly used word in modern English, but it effectively conveys a sense of deep mental suffering.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is mind-sicking.","correct":"✓ He is mind-sick.","note":"'Mind-sick' is an adjective, not a verb, so it doesn't have a present participle form like 'mind-sicking'."},{"incorrect":"✗ She has a mind-sick.","correct":"✓ She is mind-sick.","note":"'Mind-sick' is an adjective describing a state, not a noun. You wouldn't say 'she has a mind-sick' but rather 'she is mind-sick'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["sick at heart","heavy-hearted","downhearted","despondent"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively rare.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'mind-sick' is not commonly used in everyday language. It's more likely to be found in literature or formal writing to describe a state of deep mental or emotional distress. Understanding the meaning requires a good vocabulary and an understanding of figurative language."},"example_sentences":[{"sentence":"The horrors of war left many soldiers mind-sick and traumatized.","translation":"戦争の恐ろしさは多くの兵士を精神的に病ませ、トラウマを負わせた。","type":"general"},{"sentence":"She became mind-sick with anxiety as the deadline approached.","translation":"締め切りが近づくにつれて、彼女は不安で精神的に病んでいった。","type":"general"},{"sentence":"His mind-sick state prevented him from enjoying the simple pleasures of life.","translation":"彼の精神的に病んだ状態は、彼が人生のささやかな喜びを享受することを妨げた。","type":"general"}]}