{"word":"scampingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"軽率に、不注意に、ぞんざいに","english_definition":"In a careless, reckless, or irresponsible manner; hastily and without proper attention to detail.","examples":[{"sentence":"He did the work scampingly, resulting in many errors.","translation":"彼はその仕事をぞんざいに行ったため、多くの誤りが発生した。"},{"sentence":"The report was prepared scampingly and lacked important information.","translation":"その報告書は軽率に作成され、重要な情報が欠けていた。"},{"sentence":"She treated the delicate situation scampingly, causing further problems.","translation":"彼女はそのデリケートな状況を不注意に扱い、さらなる問題を引き起こした。"}],"collocations":["do something scampingly","prepare something scampingly","treat something scampingly"],"synonyms":["carelessly","recklessly","negligently","irresponsibly","hastily","sloppily","shoddily"],"antonyms":["carefully","attentively","thoroughly","meticulously","conscientiously"]}],"etymology":{"value":"Derived from the verb 'scamp,' meaning to do work carelessly or hastily, with the suffix '-ingly' added to form an adverb. The verb 'scamp' likely comes from a dialectal variant of 'scrape' or a related Scandinavian word, suggesting a sense of doing something superficially or incompletely.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskæmpɪŋli/","syllables":"scamp-ing-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Scampingly' describes the manner in which an action is performed, indicating a lack of care, attention, or responsibility. It suggests that the work or task was done quickly and without proper consideration, often leading to errors or negative consequences. The word is relatively uncommon in modern English but can be useful for emphasizing the poor quality or execution of something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He scampingly did his homework.","correct":"✓ He did his homework scampingly.","note":"Adverbs of manner like 'scampingly' typically follow the verb or the object of the verb. Placing it between the subject and verb can sound awkward."},{"incorrect":"✗ The scampingly work was rejected.","correct":"✓ The scampy work was rejected.","note":"'Scampingly' is an adverb and modifies a verb. To describe the work itself as careless, use the adjective 'scampy'."}],"priority":"★★☆"},"related_words":{"derivatives":["scamp (noun: a mischievous person; verb: to do work carelessly)","scampish (adjective: mischievous, playful)","scampy (adjective: careless, shoddy)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Scampingly' is a relatively rare adverb that means doing something in a careless or reckless way. It implies a lack of attention to detail and a tendency to rush through tasks without proper consideration. Because of its uncommon usage, it's more likely to be encountered in literature or formal writing rather than everyday conversation. Understanding its meaning can help you recognize and interpret nuanced descriptions of actions performed without due diligence."},"example_sentences":[{"sentence":"The project was completed so scampingly that it had to be redone from scratch.","translation":"そのプロジェクトはあまりにもぞんざいに完了されたため、最初からやり直す必要があった。","type":"adverb","meaning_category":"carelessly"},{"sentence":"The instructions were followed so scampingly that the equipment malfunctioned immediately.","translation":"指示があまりにも不注意に守られたため、機器はすぐに故障した。","type":"adverb","meaning_category":"recklessly"},{"sentence":"The accounts were managed so scampingly that discrepancies were discovered during the audit.","translation":"会計があまりにも軽率に管理されていたため、監査中に矛盾が発見された。","type":"adverb","meaning_category":"negligently"}]}