{"word":"Rudolphine","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ルドルフ2世に関連する、またはルドルフ2世の時代（主に16世紀後半から17世紀初頭）の","english_definition":"Relating to or characteristic of Rudolf II, Holy Roman Emperor, or his reign (primarily late 16th to early 17th century).","examples":[{"sentence":"The Rudolphine era was a time of great artistic and scientific flourishing in Prague.","translation":"ルドルフ朝時代は、プラハで芸術と科学が大きく繁栄した時代でした。"},{"sentence":"Rudolphine art is known for its Mannerist style and allegorical themes.","translation":"ルドルフ朝の芸術は、そのマニエリスム様式と寓意的なテーマで知られています。"}],"collocations":["Rudolphine art","Rudolphine period","Rudolphine Prague","Rudolphine court"],"synonyms":["Late Renaissance","Mannerist"],"antonyms":["None (generally used in a specific historical context)"]}],"etymology":{"value":"Named after Rudolf II, Holy Roman Emperor (1552-1612), who was a patron of the arts and sciences.","priority":"★★★"},"pronunciation":{"ipa":"/ˌruːˈdɒlfaɪn/","syllables":"Roo-dol-phine"},"inflection":{"notes":"Adjective, does not inflect"},"usage_notes":{"explanation":"The term \"Rudolphine\" is primarily used in historical and art historical contexts to describe things associated with the reign of Rudolf II. It often implies a connection to the artistic, scientific, and intellectual environment of Prague during that time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The style is very Rudolph.","correct":"✓ The style is Rudolphine.","note":"Use the adjective form \"Rudolphine\" rather than the proper noun \"Rudolf\" to describe the style or era."}],"priority":"★☆☆"},"related_words":{"derivatives":["Rudolf (proper noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Rudolphine\" is a specialized term primarily used in the context of art history and European history, specifically referring to the reign of Rudolf II, Holy Roman Emperor. It is not commonly encountered in everyday language and requires a familiarity with the historical period to understand its meaning fully. The term is often used to describe artistic styles, scientific advancements, and cultural characteristics of that era. "},"example_sentences":[{"sentence":"The National Gallery houses several important examples of **Rudolphine** painting.","translation":"国立美術館には、ルドルフ朝絵画の重要な作品がいくつか収蔵されています。","type":"adjective","meaning_category":"Relating to Rudolf II's era"},{"sentence":"Johannes Kepler worked as a mathematician in the **Rudolphine** court in Prague.","translation":"ヨハネス・ケプラーは、プラハのルドルフ朝宮廷で数学者として働いていました。","type":"adjective","meaning_category":"Relating to Rudolf II's era"}]}