{"word":"Hyperdoricism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A Doric form of speech or writing carried to excess.","english_definition":"An excessive use of Doric dialect features in speech or writing.","examples":[{"sentence":"The play was criticized for its hyperdoricism, making it difficult for non-Doric speakers to understand.","translation":"その劇は過度なドーリス方言の使用で批判され、ドーリス語を話さない人には理解が難しかった。"}],"collocations":["excessive Doric","exaggerated Doric","overuse of Doric"],"synonyms":["Doricism","dialectal excess","regionalism"],"antonyms":[]}],"etymology":{"value":"Derived from 'hyper-' (excessive) + 'Doric' (referring to the Doric dialect of ancient Greece) + '-ism' (a practice, usage, or characteristic).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpərˈdɔːrɪsɪzəm/","syllables":"hy-per-dor-i-ci-sm"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hyperdoricism refers to the exaggerated or excessive use of features specific to the Doric dialect, one of the major dialects of ancient Greek. Its use can make the text or speech seem overly regional or difficult to understand for those not familiar with Doric.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Doric","dialect","hyper-"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Hyperdoricism' is a highly specialized term related to linguistics, specifically the study of ancient Greek dialects. It describes the excessive use of Doric dialect features, which would primarily be relevant to scholars of classical languages and literature. Due to its niche usage, it's not commonly encountered. Understanding requires knowledge of linguistic terminology and ancient Greek dialects."},"example_sentences":[{"sentence":"The author's hyperdoricism in the poem created an authentic but challenging read.","translation":"詩における作者の過度なドーリス方言の使用は、本物でありながらも難しい読み物を作り出した。","type":"example","meaning_category":"general"}]}