{"word":"collocatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"共起的な、連語的な；コロケーション（語と語の慣用的な結びつき）に関する","english_definition":"Relating to or characterized by collocation; pertaining to the habitual juxtaposition of particular words with each other.","examples":[{"sentence":"The analysis focused on the collocatory patterns in the text.","translation":"その分析は、テキストにおける共起パターンに焦点を当てた。","note":"This sentence illustrates the use of 'collocatory' to describe patterns of word association."},{"sentence":"Collocatory information is crucial for natural language processing.","translation":"共起情報は自然言語処理にとって重要である。","note":"This sentence highlights the importance of collocation in NLP tasks."}],"collocations":["collocatory analysis","collocatory patterns","collocatory information","collocatory behaviour","collocatory restrictions"],"synonyms":["combinatory","associational","contextual","lexical","idiomatic"],"antonyms":["unrelated","independent","non-associative"]}],"etymology":{"value":"Derived from 'collocation' (the act of placing or arranging together, especially words or ideas).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒləˌkeɪtəri/","syllables":"col-lo-ca-to-ry"},"inflection":{"notes":"As an adjective, 'collocatory' has comparative and superlative forms, though they are rarely used: more collocatory, most collocatory."},"usage_notes":{"explanation":"'Collocatory' is primarily used in linguistics, computational linguistics, and natural language processing to describe phenomena related to collocation. It emphasizes the tendency of certain words to occur together more frequently than would be expected by chance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The collocatory of the words was interesting.","correct":"✓ The collocation of the words was interesting.","note":"The noun form is 'collocation', not 'collocatory'."}],"priority":"★★☆"},"related_words":{"derivatives":["collocation (noun)","collocate (verb)"],"phrases":["collocatory strength","collocatory range"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency (specialized vocabulary)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Collocatory' is a technical term used in linguistics and related fields. It describes something that is related to or characterized by collocation, which is the tendency of certain words to appear together frequently. Understanding this word requires familiarity with linguistic concepts."},"example_sentences":[{"sentence":"The researcher examined the collocatory behavior of adjectives and nouns in the corpus.","translation":"研究者は、コーパスにおける形容詞と名詞の共起的な振る舞いを調べた。","type":"adjective","meaning_category":"共起的な"},{"sentence":"Collocatory analysis can reveal subtle semantic relationships between words.","translation":"共起分析は、単語間の微妙な意味関係を明らかにすることができる。","type":"adjective","meaning_category":"共起的な"}]}