{"word":"continuances","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法廷での)延期、継続","english_definition":"The act or an instance of continuing, especially the adjournment of a legal case to a future date.","examples":[{"sentence":"The lawyer requested several continuances to prepare the case.","translation":"弁護士は事件の準備のために数回の延期を要請した。"},{"sentence":"The judge granted a continuance due to the defendant's illness.","translation":"裁判官は被告の病気のため、延期を認めた。"}],"collocations":["grant a continuance (延期を認める)","request a continuance (延期を要請する)","seek a continuance (延期を求める)"],"synonyms":["adjournment","postponement","rescheduling","deferral"],"antonyms":["trial","hearing","proceeding"]}],"etymology":{"value":"The word 'continuance' comes from the Middle English word 'continuance', which in turn comes from the Old French word 'continuer', meaning 'to continue'. The suffix '-ance' indicates a state or condition, so 'continuance' refers to the state of continuing or the act of continuing something.","priority":"★★★"},"pronunciation":{"ipa":"/kənˈtɪnjuənsɪz/","syllables":"con-tin-u-an-ces"},"inflection":{"noun_plural":"continuances"},"usage_notes":{"explanation":"'Continuance' is primarily used in legal contexts to refer to the postponement or adjournment of a trial or hearing to a later date. It is typically requested by one of the parties involved in the case and granted at the discretion of the judge. The plural form, 'continuances', refers to multiple instances of such postponements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The continuance of the project was successful.","correct":"✓ The continuation of the project was successful.","note":"'Continuance' refers to the adjournment of a legal case, while 'continuation' refers to the ongoing state of something. Use 'continuation' when referring to the ongoing progress of a project."},{"incorrect":"✗ They asked for a continue.","correct":"✓ They asked for a continuance.","note":"'Continuance' is the noun form referring to the adjournment. 'Continue' is a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["continue (verb)","continuation (noun)","continuous (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'continuance' is a formal legal term that refers to the adjournment or postponement of a legal proceeding to a later date. It is typically used in legal documents and discussions. Understanding this term is important for those involved in the legal field or when reading legal texts. The plural form, 'continuances,' simply indicates multiple instances of such postponements. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The court granted three **continuances** before the trial finally began.","translation":"裁判所は、裁判が最終的に始まるまでに3回の延期を認めた。","type":"noun","meaning_category":"延期"},{"sentence":"The defense attorney filed a motion for a **continuance** due to new evidence.","translation":"弁護側弁護士は、新たな証拠のために延期の申し立てを行った。","type":"noun","meaning_category":"延期"}]}