{"word":"oligochylia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学) リンパ液の不足、またはリンパ液の分泌不全","english_definition":"(medicine) A deficiency in chyle, or a defective secretion of chyle.","examples":[{"sentence":"Oligochylia can be a symptom of various underlying medical conditions.","translation":"オリゴカイリアは、さまざまな基礎疾患の症状である可能性があります。"}],"collocations":[],"synonyms":["chylodeficiency"],"antonyms":[]}],"etymology":{"value":"The word 'oligochylia' is derived from the Greek words 'oligo-' meaning 'few' or 'deficient', and 'chylos' meaning 'chyle'. The suffix '-ia' indicates a condition or state.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɒlɪɡoʊˈkaɪliə/","syllables":"ol-i-go-chy-li-a"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"Oligochylia is a rare medical term primarily used in the context of discussing lymphatic system disorders and nutritional deficiencies. It refers specifically to a condition where the production or presence of chyle is insufficient. Chyle is a milky fluid consisting of lymph and emulsified fats, formed in the small intestine during digestion and absorbed into the lymphatic system.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["oligo- (prefix meaning few or deficient)","chyle (the milky fluid formed in the small intestine during digestion)"],"related_medical_terms":["lymph","lymphatic system","malabsorption","steatorrhea"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Extremely low frequency. This is a rare medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Oligochylia' is a highly specialized medical term. Understanding its meaning requires knowledge of medical terminology related to the lymphatic system and digestion. It is unlikely to be encountered outside of medical contexts."},"example_sentences":[{"sentence":"The patient's symptoms suggested possible malabsorption leading to oligochylia.","translation":"患者の症状は、オリゴカイリアにつながる可能性のある吸収不良を示唆していました。","type":"medical","meaning_category":"lymphatic deficiency"},{"sentence":"Diagnosis of oligochylia requires specific laboratory tests to assess chyle production.","translation":"オリゴカイリアの診断には、カイロ産生を評価するための特定の臨床検査が必要です。","type":"medical","meaning_category":"lymphatic deficiency"}]}