{"word":"insectary","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"昆虫飼育室、昆虫飼育場","english_definition":"A building or room where insects are reared, especially for study or display.","examples":[{"sentence":"The university's insectary houses a wide variety of butterfly species.","translation":"その大学の昆虫飼育室には、多種多様な蝶が生息している。"},{"sentence":"The insectary provides a controlled environment for studying insect behavior.","translation":"昆虫飼育室は、昆虫の行動を研究するための制御された環境を提供する。"},{"sentence":"The botanical garden has an insectary where visitors can observe insects up close.","translation":"植物園には昆虫飼育室があり、訪問者は間近で昆虫を観察することができる。"}],"collocations":["build an insectary","maintain an insectary","visit an insectary","insectary specimens","insectary conditions"],"synonyms":["vivarium","terrarium","insect farm","insect house"],"antonyms":[]}],"etymology":{"value":"Derived from 'insect' and the suffix '-ary', indicating a place or thing associated with insects.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈsɛktəri/","syllables":"in-sec-ta-ry"},"inflection":{"noun_plural":"insectaries"},"usage_notes":{"explanation":"An 'insectary' is specifically a location dedicated to raising and studying insects. It often involves controlled conditions to facilitate research or public display. It is different from a general 'garden' or 'field' where insects might naturally occur.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The insectary was full of plants and flowers.","correct":"✓ The insectary was full of insects.","note":"While plants might be present to support the insects, the primary focus of an insectary is the insects themselves, not the plants."},{"incorrect":"✗ I found an insectary in my backyard.","correct":"✓ I found an insect in my backyard.","note":"An insectary is a structure or room, not a single insect."}],"priority":"★☆☆"},"related_words":{"derivatives":["insect","insecticide","insectivorous","entomology"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'insectary' is a specialized term, primarily used in scientific or educational contexts. It refers to a facility specifically designed for raising and studying insects. Understanding this word requires some familiarity with entomology or related fields."},"example_sentences":[{"sentence":"The research team built a new insectary to expand their study of local insect populations.","translation":"研究チームは、地域の昆虫個体群の研究を拡大するために、新しい昆虫飼育室を建設した。","type":"general","meaning_category":"昆虫飼育室"},{"sentence":"The insectary at the zoo allows visitors to learn about the life cycles of various insects.","translation":"動物園の昆虫飼育室では、訪問者はさまざまな昆虫のライフサイクルについて学ぶことができる。","type":"general","meaning_category":"昆虫飼育室"},{"sentence":"The controlled environment of the insectary helps prevent the spread of diseases among the insects.","translation":"昆虫飼育室の制御された環境は、昆虫間の病気の蔓延を防ぐのに役立つ。","type":"technical","meaning_category":"昆虫飼育室"}]}