{"word":"Cortinarius","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"フウセンタケ属","english_definition":"A very large genus of mushrooms in the order Agaricales, characterized by rusty-brown spores, a cortina (a cobweb-like partial veil), and often brightly colored caps and stems. Many species are poisonous.","examples":[{"sentence":"Many species of Cortinarius mushrooms are difficult to identify.","translation":"フウセンタケ属の多くの種は識別が難しい。"},{"sentence":"Some Cortinarius species contain orellanine, a deadly toxin.","translation":"フウセンタケ属の一部の種は、致命的な毒素であるコレラニンを含んでいる。"}],"collocations":["Cortinarius orellanus (ドクフウセンタケ)","Cortinarius rubellus (猛毒菌)","Cortinarius violaceus (ムラサキシメジ)"],"synonyms":["webcap"],"antonyms":[]},{"part_of_speech":"noun","definition":"フウセンタケ属のきのこ","english_definition":"A mushroom of the genus Cortinarius.","examples":[{"sentence":"The Cortinarius I found in the forest had a beautiful purple cap.","translation":"森で見つけたフウセンタケ属のきのこは、美しい紫色の傘を持っていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From New Latin, from cortina (curtain, veil), referring to the cobweb-like partial veil (cortina) that is characteristic of many species in this genus.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɔːrtɪˈneɪriəs/","syllables":"Cor-ti-na-ri-us"},"inflection":{"noun_plural":"Cortinarii (though often used as uncountable)"},"usage_notes":{"explanation":"Cortinarius is a large and complex genus of mushrooms, and identification to species level often requires microscopic examination and/or chemical tests. Many species are poisonous, and some are deadly, so it is crucial to avoid eating any Cortinarius mushroom unless you are absolutely certain of its identification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a Cortinarius and now I feel fine.","correct":"✓ I am an expert at mushroom identification and I am certain that the Cortinarius I ate was an edible species.","note":"Eating unidentified mushrooms is extremely dangerous. Do not consume any mushroom unless you are 100% sure of its identity."}],"priority":"★★☆"},"related_words":{"derivatives":["cortina (noun: the cobweb-like partial veil characteristic of Cortinarius mushrooms)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Cortinarius is a scientific term referring to a large genus of mushrooms. Due to the complexity of identifying species within this genus and the potential for toxicity, understanding requires advanced knowledge of mycology. It is not a term typically encountered in everyday language."},"example_sentences":[{"sentence":"The mycologist specialized in the study of the genus Cortinarius.","translation":"その菌学者はフウセンタケ属の研究を専門としていた。","type":"noun","meaning_category":"フウセンタケ属"},{"sentence":"The forest floor was covered with various species of Cortinarius after the rain.","translation":"雨の後、森の地面は様々な種類のフウセンタケ属のきのこで覆われていた。","type":"noun","meaning_category":"フウセンタケ属のきのこ"}]}