{"word":"dyspraxia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"発達性協調運動障害（DCD）","english_definition":"A condition affecting physical coordination. It causes a child to perform less well than expected in activities for their age, and appear to move clumsily. Dyspraxia is thought to be caused by a problem in the way the brain processes information, which results in messages not being properly transmitted. Also known as Developmental Coordination Disorder (DCD).","examples":[{"sentence":"He was diagnosed with dyspraxia at the age of seven.","translation":"彼は7歳の時に発達性協調運動障害と診断された。"},{"sentence":"Children with dyspraxia often struggle with tasks such as writing and tying shoelaces.","translation":"発達性協調運動障害を持つ子供たちは、書いたり靴紐を結んだりするような作業に苦労することが多い。"}],"collocations":["developmental dyspraxia","childhood dyspraxia","diagnosed with dyspraxia","living with dyspraxia","managing dyspraxia"],"synonyms":["developmental coordination disorder (DCD)"],"antonyms":[]}],"etymology":{"value":"From 'dys-' (meaning 'difficult' or 'impaired'), and 'praxis' (meaning 'performing an action').","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈpræksiə/","syllables":"dys-prax-i-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Dyspraxia, also known as Developmental Coordination Disorder (DCD), is a neurological condition that affects a person's ability to plan and coordinate physical movement. It is a lifelong condition and can affect people of all intellectual abilities. The severity of dyspraxia varies from person to person.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has dyspraxic.","correct":"✓ He has dyspraxia.","note":"'Dyspraxia' is a noun. 'Dyspraxic' can be used as an adjective, but it's less common. A more common way to say it is 'He has dyspraxia.'"},{"incorrect":"✗ Dyspraxia is a mental illness.","correct":"✓ Dyspraxia is a neurological condition.","note":"Dyspraxia is a condition that affects motor coordination and planning, not a mental illness."}],"priority":"★★☆"},"related_words":{"derivatives":["dyspraxic (adjective: relating to or affected by dyspraxia; noun: a person with dyspraxia)"],"phrasal_verbs":[],"related_medical_terms":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency. More common in medical or educational contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dyspraxia' is a medical term referring to a condition that affects coordination. It's not a common word in everyday conversation, but you might encounter it in discussions about child development, education, or health. It's important to remember that dyspraxia is a neurological condition, not a sign of low intelligence. Understanding this term helps in discussions about learning and developmental differences."},"example_sentences":[{"sentence":"Early intervention can help children with **dyspraxia** develop coping strategies.","translation":"早期介入は、発達性協調運動障害を持つ子供たちが対処戦略を開発するのに役立つ。","type":"noun","meaning_category":"medical condition"},{"sentence":"The therapist specializes in treating children with **dyspraxia**.","translation":"そのセラピストは、発達性協調運動障害を持つ子供たちの治療を専門としている。","type":"noun","meaning_category":"medical condition"},{"sentence":"His **dyspraxia** made it difficult for him to participate in sports.","translation":"彼の発達性協調運動障害は、彼がスポーツに参加することを困難にした。","type":"noun","meaning_category":"medical condition"}]}