{"word":"data-efficient","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"データ効率の良い、データ効率に優れた","english_definition":"Achieving good performance with a relatively small amount of training data.","examples":[{"sentence":"The new algorithm is very data-efficient, requiring only a few examples to learn.","translation":"その新しいアルゴリズムは非常にデータ効率が良く、学習に必要な例はわずかです。"},{"sentence":"Data-efficient methods are crucial for applications where labeled data is scarce.","translation":"データ効率の良い手法は、ラベル付きデータが不足しているアプリケーションにとって非常に重要です。"},{"sentence":"We need to develop more data-efficient models to reduce the cost of data collection.","translation":"データ収集のコストを削減するために、よりデータ効率の良いモデルを開発する必要があります。"}],"collocations":["data-efficient algorithm","data-efficient model","data-efficient learning","data-efficient approach","data-efficient method","data-efficient training"],"synonyms":["sample-efficient","resource-efficient","data-economical"],"antonyms":["data-intensive","data-hungry"]},{"part_of_speech":"adjective","definition":"(一般的に) 少ないリソースで効率的にタスクを実行できる","english_definition":"Generally, capable of performing a task efficiently with limited resources.","examples":[{"sentence":"This data-efficient approach reduces the computational cost significantly.","translation":"このデータ効率の良いアプローチは、計算コストを大幅に削減します。"}],"collocations":["data-efficient design","data-efficient implementation"],"synonyms":["resourceful","economical","efficient"],"antonyms":["wasteful","inefficient"]}],"etymology":{"value":"The term is formed by combining 'data' (referring to information used for analysis or computation) and 'efficient' (meaning capable of producing desired results with minimal waste of resources).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdeɪtə ɪˈfɪʃənt/","syllables":"da-ta-ef-fi-cient"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms: more data-efficient, most data-efficient."},"usage_notes":{"explanation":"'Data-efficient' is commonly used in the context of machine learning and artificial intelligence to describe algorithms or models that can achieve high accuracy or performance with a limited amount of training data. This is particularly important when labeled data is expensive or difficult to obtain. The term can also be used more broadly to describe any system or process that uses data resources effectively and avoids unnecessary data collection or processing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The model is data efficient.","correct":"✓ The model is data-efficient.","note":"It's important to use the hyphen to correctly form the compound adjective. Without the hyphen, the phrase can be misinterpreted."},{"incorrect":"✗ Data efficient is important for machine learning.","correct":"✓ Data efficiency is important for machine learning. / ✓ Data-efficient methods are important for machine learning.","note":"'Data efficient' is an adjective and needs to modify a noun. To refer to the concept in general, use the noun 'data efficiency'."}],"priority":"★★☆"},"related_words":{"derivatives":["data efficiency (noun)","data-inefficient (adjective)"],"phrasal_verbs":[],"related_concepts":["few-shot learning","transfer learning","meta-learning","active learning","semi-supervised learning"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Data-efficient' describes something that works well even when it doesn't have a lot of data to learn from. This is especially important in fields like artificial intelligence, where getting lots of labeled data can be expensive or difficult. A data-efficient algorithm can still do a good job, even if it only sees a few examples. Think of it like a student who can learn a lot from just a few lessons, compared to someone who needs many lessons to understand the same thing."},"example_sentences":[{"sentence":"The researchers developed a data-efficient algorithm for image recognition.","translation":"研究者たちは、画像認識のためのデータ効率の良いアルゴリズムを開発しました。","type":"general","meaning_category":"algorithm"},{"sentence":"This approach is more data-efficient than traditional supervised learning methods.","translation":"このアプローチは、従来の教師あり学習法よりもデータ効率が良いです。","type":"general","meaning_category":"approach"},{"sentence":"Data-efficient deep learning is a key area of research.","translation":"データ効率の良い深層学習は、重要な研究分野です。","type":"general","meaning_category":"research"},{"sentence":"The company is focused on building data-efficient AI solutions.","translation":"その企業は、データ効率の良いAIソリューションの構築に注力しています。","type":"general","meaning_category":"AI solutions"}]}