{"word":"hopperdozer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of agricultural machine used to apply insecticides or herbicides to crops. It typically consists of a hopper to hold the chemical, a spray boom, and a method of propulsion (tractor-mounted or self-propelled).","english_definition":"An agricultural machine for applying insecticides or herbicides to crops, typically consisting of a hopper for the chemical, a spray boom, and a method of propulsion.","examples":[{"sentence":"The farmer used a hopperdozer to spray the soybean field.","translation":"農家はホッパードーザーを使って大豆畑に農薬を散布した。"},{"sentence":"Modern hopperdozers are equipped with GPS for precise application.","translation":"現代のホッパードーザーには、正確な散布のためにGPSが搭載されている。"}],"collocations":["spray crops with a hopperdozer","tractor-mounted hopperdozer","self-propelled hopperdozer","hopperdozer application","hopperdozer maintenance"],"synonyms":["sprayer","crop duster","agricultural sprayer"],"antonyms":[]}],"etymology":{"value":"A compound word combining \"hopper\" (referring to the container for the chemical) and \"dozer\" (likely a shortened form of \"bulldozer\" or simply indicating a machine that moves across the field).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɒpərˌdoʊzər/","syllables":"hop-per-do-zer"},"inflection":{"noun_plural":"hopperdozers"},"usage_notes":{"explanation":"The term \"hopperdozer\" is somewhat dated and may not be widely used in modern agricultural contexts. More common terms include \"agricultural sprayer\" or simply \"sprayer.\" The machine is designed for efficient and even application of chemicals over large areas of farmland.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hopperdozer was used to harvest the crops.","correct":"✓ The hopperdozer was used to spray the crops.","note":"Hopperdozers are for spraying, not harvesting."}],"priority":"★★☆"},"related_words":{"derivatives":["hopper","dozer","sprayer"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hopperdozer' refers to a specialized piece of agricultural equipment. Understanding requires knowledge of farming practices and equipment. While the individual words 'hopper' and 'dozer' are relatively common, their combination into this specific term is less so. Therefore, comprehension requires a higher level of vocabulary and contextual knowledge."},"example_sentences":[{"sentence":"The old hopperdozer needed repairs before it could be used again.","translation":"古いホッパードーザーは再び使用する前に修理が必要だった。","type":"noun","meaning_category":"agricultural machine"},{"sentence":"The farmer carefully calibrated the hopperdozer to ensure even distribution of the herbicide.","translation":"農家は除草剤の均一な散布を確実にするために、ホッパードーザーを注意深く調整した。","type":"noun","meaning_category":"agricultural machine"}]}