{"word":"filletster","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A woodworking plane similar to a rabbet plane, but with an adjustable fence to control the width of the rabbet, and often an adjustable depth stop.","english_definition":"A specialized woodworking plane used for cutting rabbets (grooves) with precision. It features an adjustable fence to determine the width of the rabbet and often includes a depth stop for consistent depth.","examples":[{"sentence":"The cabinet maker used a filletster to create the precise rabbets needed for the drawer construction.","translation":"その家具職人は、引き出しを作るために必要な正確な溝を作るために、フィレットスターを使用した。"},{"sentence":"Adjusting the fence on the filletster allows for different widths of rabbets to be cut.","translation":"フィレットスターのフェンスを調整することで、さまざまな幅の溝を切ることができる。"}],"collocations":["use a filletster","adjust the filletster","filletster plane","wooden filletster","metal filletster"],"synonyms":["rabbet plane","rebate plane"],"antonyms":[]}],"etymology":{"value":"Combination of 'fillet' (a narrow band or strip) and '-ster' (a suffix indicating an agent or tool). The name reflects its function of creating a 'fillet' or rabbet along the edge of wood.","priority":"★★☆"},"pronunciation":{"ipa":"ˈfɪləstər","syllables":"fil-let-ster"},"inflection":{"noun_plural":"filletsters"},"usage_notes":{"explanation":"A filletster is a specialized tool primarily used in woodworking for creating rabbets, which are recessed grooves along the edge or face of a piece of wood. The adjustable fence and depth stop allow for precise and repeatable cuts, making it ideal for joinery and creating decorative edges. While similar to a rabbet plane, the filletster offers greater control and adjustability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a fillister to smooth the surface of the wood.","correct":"✓ He used a smoothing plane to smooth the surface of the wood.","note":"A filletster is for cutting rabbets, not for smoothing surfaces."},{"incorrect":"✗ The filletster is used for cutting curves.","correct":"✓ A compass plane is used for cutting curves.","note":"A filletster is for straight edges, not curves."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized woodworking term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'filletster' refers to a specialized woodworking hand plane used for cutting rabbets (grooves) with precision. Its key features include an adjustable fence, which controls the width of the rabbet, and often a depth stop, which ensures consistent depth. This tool is more advanced than a basic rabbet plane, offering greater control and accuracy for joinery and decorative work. Due to its specific application, the term is not commonly encountered outside of woodworking contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The craftsman carefully set the fence on the **filletster** before making the cut.","translation":"職人はカットする前に、フィレットスターのフェンスを注意深く設定した。","type":"noun","meaning_category":"tool"},{"sentence":"Using a **filletster** ensures a consistent rabbet depth for the cabinet door.","translation":"フィレットスターを使用することで、キャビネットのドアの溝の深さを一定に保つことができる。","type":"noun","meaning_category":"tool"}]}