{"word":"notan","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"日本のデザインの原理で、光と影の相互作用を研究するもの。特に、白黒の紙の切り抜きやデザインで、ポジティブな形とネガティブな形のバランスを強調する。","english_definition":"A Japanese design principle that explores the interaction between light and dark, especially in black and white paper cutouts or designs, emphasizing the balance between positive and negative space.","examples":[{"sentence":"The art student created a notan design using only black and white paper.","translation":"その美術学生は、白黒の紙だけを使ってノータンのデザインを作成した。"},{"sentence":"Notan is often used to teach students about composition and balance in art.","translation":"ノータンは、美術における構成とバランスについて学生に教えるためによく使われる。"}],"collocations":["create a notan","notan design","notan exercise","positive and negative notan"],"synonyms":["contrast design","light and dark composition"],"antonyms":[]}],"etymology":{"value":"日本語の「濃淡（ノウタン）」から来ており、濃い色と薄い色、つまり光と影の濃淡を意味する。","priority":"★★★"},"pronunciation":{"ipa":"/ˈnoʊtɑːn/","syllables":"no-tan"},"inflection":{"noun_plural":"notans"},"usage_notes":{"explanation":"Notan is a design concept that emphasizes the interplay of light and dark. It is often used as a starting point for more complex designs and can be created using various materials, though it is most commonly associated with black and white paper cutouts. The goal is to achieve a harmonious balance between the positive (dark) and negative (light) shapes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I made a nortan.","correct":"✓ I made a notan.","note":"The correct spelling is 'notan', not 'nortan'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["composition","balance","positive space","negative space","chiaroscuro"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'notan' is a specialized term primarily used in the context of art and design. Understanding it requires familiarity with design principles and Japanese art influences. It's not typically encountered in general English conversation."},"example_sentences":[{"sentence":"Creating a notan exercise helps develop an understanding of visual balance.","translation":"ノータンの演習を作成することは、視覚的なバランスの理解を深めるのに役立つ。","type":"noun","meaning_category":"design principle"},{"sentence":"The artist's notan skillfully used the contrast between black and white.","translation":"そのアーティストのノータンは、黒と白のコントラストを巧みに利用していた。","type":"noun","meaning_category":"design principle"}]}