{"word":"kleptophobia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"盗みに対する恐怖症、盗まれることへの恐怖症","english_definition":"An irrational fear of being robbed or of thieves.","examples":[{"sentence":"Her kleptophobia made her constantly check her purse.","translation":"彼女の盗みに対する恐怖症は、彼女に常に財布を確認させた。"},{"sentence":"Kleptophobia can cause significant anxiety in public places.","translation":"盗みに対する恐怖症は公共の場で大きな不安を引き起こす可能性がある。"}],"collocations":["suffer from kleptophobia","have kleptophobia","overcome kleptophobia"],"synonyms":["fear of theft","fear of burglars","fear of pickpockets"],"antonyms":["none (fearlessness is an antonym in a general sense)"]}],"etymology":{"value":"Derived from the Greek words 'klepto' (thief) and 'phobia' (fear).","priority":"★★☆"},"pronunciation":{"ipa":"ˌklɛptəˈfoʊbiə","syllables":"klep-to-pho-bi-a"},"inflection":{"noun_plural":"kleptophobias"},"usage_notes":{"explanation":"Kleptophobia is a specific phobia characterized by an overwhelming and irrational fear of being robbed or of thieves. It is more than just a general concern about theft; it is a persistent and excessive fear that can interfere with daily life.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am kleptophobic because I steal things.","correct":"✓ I have kleptophobia, which is the fear of being robbed.","note":"Kleptophobia is the fear of being robbed, not the compulsion to steal (which is kleptomania)."},{"incorrect":"✗ He is kleptophobic, so he locks everything.","correct":"✓ He has kleptophobia, so he obsessively locks everything.","note":"The correct usage is to say someone 'has kleptophobia' or 'suffers from kleptophobia.'"}],"priority":"★★☆"},"related_words":{"derivatives":["klepto- (prefix relating to theft)","phobia (suffix relating to fear)","kleptomaniac (a person with kleptomania, the compulsion to steal)"],"phobias":["agoraphobia (fear of open spaces)","claustrophobia (fear of enclosed spaces)","acrophobia (fear of heights)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Kleptophobia' is a specialized term referring to the irrational fear of being robbed or of thieves. It's a relatively uncommon word, primarily used in psychological or medical contexts when discussing specific phobias. Understanding the etymology (from Greek 'klepto' for thief and 'phobia' for fear) can aid in comprehension. The term is not typically encountered in everyday conversation."},"example_sentences":[{"sentence":"The therapist helped her manage her kleptophobia through cognitive behavioral therapy.","translation":"セラピストは認知行動療法を通じて、彼女が盗みに対する恐怖症を管理するのを助けた。","type":"general","meaning_category":"fear of theft"},{"sentence":"His kleptophobia was so severe that he avoided crowded places altogether.","translation":"彼の盗みに対する恐怖症は非常に重度であったため、彼は混雑した場所を完全に避けた。","type":"symptom","meaning_category":"fear of theft"}]}