{"word":"posthemiplegic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"片麻痺後の、片麻痺後遺症の","english_definition":"Relating to or characteristic of the condition following hemiplegia (paralysis of one side of the body).","examples":[{"sentence":"The patient exhibited posthemiplegic gait abnormalities.","translation":"患者は片麻痺後の歩行異常を示した。"},{"sentence":"Posthemiplegic shoulder pain is a common complication.","translation":"片麻痺後の肩の痛みは一般的な合併症である。"}],"collocations":["posthemiplegic gait","posthemiplegic shoulder pain","posthemiplegic spasticity"],"synonyms":["hemiplegic","paralytic"],"antonyms":["nonparalytic"]}],"etymology":{"value":"The term is derived from 'post-' (after), 'hemi-' (half), and 'plegic' (paralyzed). It indicates a condition or characteristic occurring after hemiplegia.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpoʊstˌhɛmiˈpliːdʒɪk/","syllables":"post-he-mi-ple-gic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Posthemiplegic' is used to describe conditions, symptoms, or characteristics that arise as a consequence of hemiplegia. It is commonly used in medical contexts to specify the origin or nature of a symptom or condition in patients who have experienced hemiplegia.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has posthemiplegia.","correct":"✓ The patient is posthemiplegic.","note":"'Posthemiplegia' is not a standard term. Use 'posthemiplegic' as an adjective to describe a condition or state after hemiplegia."}],"priority":"★★☆"},"related_words":{"derivatives":["hemiplegia (noun: paralysis of one side of the body)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'posthemiplegic' is a specialized medical term used to describe conditions or symptoms that occur after a person has experienced hemiplegia, which is paralysis of one side of the body. It is typically used in clinical or academic settings when discussing the long-term effects of hemiplegia. Understanding this term requires a basic knowledge of medical terminology. "},"example_sentences":[{"sentence":"The rehabilitation program focused on reducing posthemiplegic spasticity in the affected limb.","translation":"リハビリテーションプログラムは、患肢の片麻痺後の痙縮を軽減することに焦点を当てた。","type":"adjective","meaning_category":"片麻痺後の"},{"sentence":"Posthemiplegic depression can significantly impact a patient's quality of life.","translation":"片麻痺後のうつ病は、患者の生活の質に大きな影響を与える可能性がある。","type":"adjective","meaning_category":"片麻痺後の"}]}