{"word":"syndicalism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"サンディカリスム、労働組合至上主義：生産手段の労働者による直接管理と、政治的行動よりも経済的行動（特にゼネラルストライキ）を通じて社会変革を目指す政治・経済思想","english_definition":"a political and economic ideology advocating worker control of the means of production and social change through economic action, especially general strikes, rather than political action.","examples":[{"sentence":"Syndicalism was influential in early 20th-century labor movements.","translation":"サンディカリスムは20世紀初頭の労働運動に影響を与えた。"},{"sentence":"The core of syndicalism is the belief in the power of organized labor.","translation":"サンディカリスムの中核は、組織された労働者の力に対する信念である。"},{"sentence":"Critics of syndicalism argue that it is impractical and leads to economic chaos.","translation":"サンディカリスムの批判者たちは、それが非現実的であり、経済的混乱につながると主張する。"}],"collocations":["revolutionary syndicalism","anarcho-syndicalism","industrial syndicalism","general strike (サンディカリスムにおける重要な戦術)"],"synonyms":["labor movement","anarchism","socialism","communism"],"antonyms":["capitalism","state socialism","reformism"]}],"etymology":{"value":"フランス語の 'syndicalisme' から派生。'syndicat'（労働組合）に '-isme'（主義）が付いた形。'syndicat' は中世ラテン語の 'syndicatus'（代理人の職務）に由来し、最終的にはギリシャ語の 'syndikos'（弁護士、代表者）から来ている。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪndɪkəlɪzəm/","syllables":"syn-di-cal-ism"},"inflection":{"noun_plural":null,"notes":"不可算名詞"},"usage_notes":{"explanation":"Syndicalism is a radical political and economic ideology that emphasizes the role of labor unions in achieving social change. It advocates for the direct control of the means of production by workers, typically through a decentralized, worker-managed system. A key tactic often associated with syndicalism is the general strike, intended to paralyze the economy and force concessions from the ruling class. Syndicalism differs from traditional socialism and communism in its rejection of state control and its focus on direct action by workers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Syndicalism is the same as socialism.","correct":"✓ Syndicalism is a form of radical labor movement, distinct from state socialism.","note":"Syndicalism is related to socialism but differs in its emphasis on direct worker control rather than state control."},{"incorrect":"✗ Syndicalism is a political party.","correct":"✓ Syndicalism is an ideology that often rejects traditional political parties in favor of direct action.","note":"Syndicalists often distrust traditional political parties, preferring direct action such as strikes and workplace organizing."}],"priority":"★★☆"},"related_words":{"derivatives":["syndicalist (名詞/形容詞: サンディカリスム支持者、サンディカリスムの)"],"phrases":["anarcho-syndicalism (無政府サンディカリスム)","revolutionary syndicalism (革命的サンディカリスム)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**syndicalism**」は、労働組合が社会を変える力を持つと考える思想のことです。労働者が工場や会社を直接管理し、ゼネラルストライキのような方法で社会を変えようとします。政治的な活動よりも、労働者の直接的な行動を重視するのが特徴です。社会主義や共産主義と似ていますが、国家による管理ではなく、労働者自身による管理を目指す点が異なります。歴史的な文脈や、政治・経済に関する議論で使われることが多い専門用語です。"},"example_sentences":[{"sentence":"The IWW was heavily influenced by **syndicalism**.","translation":"世界産業労働組合（IWW）はサンディカリスムの影響を強く受けた。","type":"noun","meaning_category":"政治・経済思想"},{"sentence":"**Syndicalism** promotes worker solidarity and direct action.","translation":"サンディカリスムは労働者の団結と直接行動を推進する。","type":"noun","meaning_category":"政治・経済思想"},{"sentence":"Some historians argue that **syndicalism** failed because it lacked a coherent political strategy.","translation":"一部の歴史家は、サンディカリスムは一貫した政治戦略を欠いていたために失敗したと主張する。","type":"noun","meaning_category":"政治・経済思想"}]}