{"word":"nonadjustment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不適応、調整不良、未調整","english_definition":"The state or condition of not being adjusted; failure to adapt or conform.","examples":[{"sentence":"His nonadjustment to the new school was evident in his withdrawn behavior.","translation":"彼の新しい学校への不適応は、引きこもりがちな行動に明らかだった。"},{"sentence":"The machine's nonadjustment led to inconsistent results.","translation":"機械の調整不良は、一貫性のない結果につながった。"},{"sentence":"The company faced challenges due to the nonadjustment of its strategies to the changing market.","translation":"会社は、変化する市場への戦略の未調整のために課題に直面した。"}],"collocations":["social nonadjustment (社会的不適応)","emotional nonadjustment (情緒的不適応)","economic nonadjustment (経済的未調整)"],"synonyms":["maladjustment","inadaptation","lack of adaptation","failure to adjust","unconformity"],"antonyms":["adjustment","adaptation","conformity"]}],"etymology":{"value":"Formed by adding the prefix \"non-\" (meaning \"not\") to the word \"adjustment\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnədˈdʒʌstmənt/","syllables":"non-ad-just-ment"},"inflection":{"noun_plural":"nonadjustments"},"usage_notes":{"explanation":"\"Nonadjustment\" refers to the absence of adjustment or the failure to adapt to a new situation, environment, or standard. It often implies a negative consequence or difficulty arising from this lack of adaptation. It is commonly used in contexts relating to psychology, sociology, economics, and engineering.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-adjustment of the salary caused dissatisfaction.","correct":"✓ The lack of adjustment of the salary caused dissatisfaction.","note":"While \"nonadjustment\" is correct, \"lack of adjustment\" often sounds more natural in many contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["adjust","adjustment","maladjustment"],"antonyms":["adjustment","adaptation","conformity"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonadjustment\" is a formal term indicating a lack of adaptation or failure to adjust. It is generally used in academic or professional contexts, such as psychology, sociology, or economics, to describe a state where something or someone has not successfully adapted to new conditions or requirements. Due to its relatively low frequency and formal nature, it may not be commonly encountered in everyday language."},"example_sentences":[{"sentence":"The patient's nonadjustment to the prescribed medication was a cause for concern.","translation":"患者の処方薬への不適応は懸念の原因だった。","type":"medical","meaning_category":"failure to adapt"},{"sentence":"The economic nonadjustment following the recession led to widespread unemployment.","translation":"景気後退後の経済的未調整は、広範な失業につながった。","type":"economic","meaning_category":"lack of adjustment"},{"sentence":"His social nonadjustment made it difficult for him to form meaningful relationships.","translation":"彼の社会的不適応は、彼が有意義な関係を築くことを困難にした。","type":"social","meaning_category":"failure to conform"}]}