{"word":"permissibility","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"許容性、許容できること、許可されること","english_definition":"The quality or state of being permissible; allowability.","examples":[{"sentence":"The permissibility of using copyrighted material for educational purposes is often debated.","translation":"教育目的で著作権のある資料を使用することの許容性については、しばしば議論されます。"},{"sentence":"The permissibility of certain actions depends on the specific context and regulations.","translation":"特定の行為の許容性は、具体的な状況や規制によって異なります。"},{"sentence":"The ethical permissibility of the experiment was questioned by many scientists.","translation":"その実験の倫理的な許容性は、多くの科学者によって疑問視されました。"}],"collocations":["legal permissibility (法的許容性)","ethical permissibility (倫理的許容性)","moral permissibility (道徳的許容性)","question the permissibility (許容性を疑問視する)","determine the permissibility (許容性を判断する)","assess the permissibility (許容性を評価する)"],"synonyms":["allowability","legality","acceptability","admissibility","appropriateness","justifiability"],"antonyms":["impermissibility","unacceptability","illegality","inadmissibility","inappropriateness","unjustifiability"]}],"etymology":{"value":"Derived from 'permissible' (capable of being permitted) + '-ity' (a suffix denoting a state or quality). 'Permissible' comes from 'permit' (to allow) + '-ible' (capable of being). 'Permit' originates from Latin 'permittere' (to allow to pass through, let go, permit), from 'per-' (through) + 'mittere' (to send, let go).","priority":"★★☆"},"pronunciation":{"ipa":"/pərˌmɪsɪˈbɪləti/","syllables":"per-mis-si-bil-i-ty"},"inflection":{"noun_plural":"permissibilities (rarely used)"},"usage_notes":{"explanation":"'Permissibility' refers to the general concept of whether something is allowed or not. It is often used in formal contexts, such as legal, ethical, or regulatory discussions. It focuses on the principle or condition of being permissible, rather than a specific instance of permission.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The permissibility was granted by the council.","correct":"Permission was granted by the council.","note":"'Permissibility' is a state or quality, not something that can be granted. Use 'permission' instead to refer to the act of allowing something."},{"incorrect":"The permissibility of the action is depend on the rules.","correct":"The permissibility of the action depends on the rules.","note":"Ensure correct subject-verb agreement. 'Permissibility' is singular, so use 'depends'."}],"priority":"★★☆"},"related_words":{"derivatives":["permissible (adjective: allowable, permitted)","permissibly (adverb: in a permissible manner)","permit (verb: to allow; noun: a document granting permission)","permission (noun: authorization, consent to do something)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, more common in academic and legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Permissibility' is a formal noun that describes the state of being allowed or permitted. It is often used in legal, ethical, or academic discussions to analyze whether an action or practice is acceptable according to certain rules or principles. Because it is a more abstract and formal term, it is typically encountered in advanced texts and discussions rather than everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The environmental impact assessment will determine the permissibility of the proposed construction project.","translation":"環境影響評価によって、提案された建設プロジェクトの許容性が判断されます。","type":"noun","meaning_category":"許容性"},{"sentence":"The permissibility of data collection methods must be carefully considered to protect individual privacy.","translation":"個人のプライバシーを保護するために、データ収集方法の許容性を慎重に検討する必要があります。","type":"noun","meaning_category":"許容性"},{"sentence":"There is ongoing debate about the permissibility of using artificial intelligence in warfare.","translation":"戦争における人工知能の使用の許容性については、現在も議論が続いています。","type":"noun","meaning_category":"許容性"}]}