{"word":"re-sacralize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び神聖化する、再び神聖なものとする、神聖な意味や価値を回復させる","english_definition":"To make sacred again; to restore a sense of sacredness or religious significance to something.","examples":[{"sentence":"The community sought to re-sacralize the land after it had been desecrated.","translation":"地域社会は、その土地が冒涜された後、再び神聖化しようと努めた。"},{"sentence":"Some scholars argue that we need to re-sacralize nature in order to protect it.","translation":"一部の学者は、自然を保護するためには、自然を再び神聖化する必要があると主張している。"},{"sentence":"The ritual was intended to re-sacralize the ancient temple.","translation":"その儀式は、古代寺院を再び神聖化することを目的としていた。"}],"collocations":["re-sacralize the land","re-sacralize nature","re-sacralize a temple","re-sacralize a space","re-sacralize a tradition"],"synonyms":["consecrate again","resanctify","re-dedicate","re-spiritualize","restore sacredness"],"antonyms":["desecrate","profane","secularize"]},{"part_of_speech":"verb","transitivity":"vt","definition":"（社会的な意味で）再び尊重する、再び重要なものとみなす","english_definition":"To restore a sense of importance, value, or respect to something that has been devalued or trivialized.","examples":[{"sentence":"There's a movement to re-sacralize the role of teachers in society.","translation":"社会における教師の役割を再び尊重しようとする動きがある。"},{"sentence":"We need to re-sacralize the concept of public service.","translation":"私たちは公共サービスの概念を再び重要なものとみなす必要がある。"},{"sentence":"The artist aimed to re-sacralize everyday objects through his work.","translation":"そのアーティストは、自身の作品を通して日常の物を再び尊重することを目指した。"}],"collocations":["re-sacralize the role","re-sacralize the concept","re-sacralize the value","re-sacralize the importance"],"synonyms":["revalue","rehabilitate","restore respect","re-establish importance","re-elevate"],"antonyms":["devalue","trivialize","disrespect","degrade"]}],"etymology":{"value":"The word \"re-sacralize\" is formed by adding the prefix \"re-\" (meaning \"again\" or \"anew\") to the word \"sacralize.\" \"Sacralize\" comes from \"sacral,\" which is derived from the Latin word \"sacer,\" meaning \"sacred\" or \"holy.\"","priority":"★★☆"},"pronunciation":{"ipa":"/riːˈseɪkrəlaɪz/","syllables":"re-sa-cra-lize"},"inflection":{"verb_forms":{"present_simple":["re-sacralize","re-sacralizes"],"past_simple":"re-sacralized","past_participle":"re-sacralized","present_participle":"re-sacralizing"}},"usage_notes":{"explanation":"\"Re-sacralize\" implies a restoration of something's sacred or highly valued status. It can refer to a literal religious act or a more metaphorical restoration of respect or importance. The term is often used in discussions about environmentalism, social values, and cultural heritage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They are re-sacralizing the building for secular purposes.","correct":"✓ They are repurposing the building for secular purposes.","note":"\"Re-sacralize\" implies restoring sacredness, so it's contradictory to use it for secular purposes. \"Repurpose\" is more appropriate in this context."},{"incorrect":"✗ The re-sacralization was a quick and easy process.","correct":"✓ The re-sacralization was a deliberate and thoughtful process.","note":"Re-sacralization typically involves careful consideration and is not usually a quick or easy process."}],"priority":"★☆☆"},"related_words":{"derivatives":["re-sacralization (noun)"],"related_terms":["sacral","sacralize","sacred","desecrate","consecrate","sanctify"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"re-sacralize\" is a relatively uncommon and advanced term. It generally means to make something sacred again or to restore a sense of sacredness or deep respect to it. It is often used in academic or philosophical contexts when discussing the environment, culture, or social values. Understanding the prefix \"re-\" (again) and the root word \"sacralize\" (to make sacred) is helpful in grasping its meaning."},"example_sentences":[{"sentence":"The community worked together to re-sacralize the river, holding ceremonies to honor its importance to their history and well-being.","translation":"地域社会は協力して川を再び神聖化し、彼らの歴史と幸福にとっての重要性を称える儀式を行った。","type":"verb","meaning_category":"神聖化する"},{"sentence":"Activists are trying to re-sacralize the idea of voting, emphasizing its significance for democracy.","translation":"活動家たちは、投票という概念を再び尊重しようと努め、民主主義におけるその重要性を強調している。","type":"verb","meaning_category":"尊重する"},{"sentence":"The artist's installation aimed to re-sacralize the mundane, inviting viewers to find beauty and meaning in everyday objects.","translation":"そのアーティストのインスタレーションは、日常的なものを再び神聖化することを目指し、観客に日常の物の中に美しさや意味を見出すように促した。","type":"verb","meaning_category":"尊重する"}]}