{"word":"interpupil","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"瞳孔間の、瞳孔間距離の","english_definition":"Relating to or situated between the pupils of the eyes.","examples":[{"sentence":"The interpupil distance was measured to ensure proper alignment of the binoculars.","translation":"双眼鏡の適切なアライメントを保証するために、瞳孔間距離が測定されました。"},{"sentence":"The interpupil line is an imaginary line connecting the centers of the two pupils.","translation":"瞳孔間線は、2つの瞳孔の中心を結ぶ仮想の線です。"}],"collocations":["interpupil distance","interpupil line"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the prefix 'inter-' (between) and 'pupil' (the dark circular opening in the center of the iris of the eye).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntərˈpjuːpəl/","syllables":"in-ter-pu-pil"},"inflection":{},"usage_notes":{"explanation":"The term 'interpupil' is primarily used in the context of optics, ophthalmology, and optometry to describe measurements and relationships between the pupils of the eyes. It is often used to specify the distance between the pupils (interpupillary distance or IPD), which is important for correctly fitting eyeglasses, binoculars, and other optical devices.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["interpupillary (adjective)","pupil (noun)"],"related_terms":["PD (abbreviation for interpupillary distance)"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'interpupil' is a technical term primarily used in the fields of optics and ophthalmology. It refers to something located or related to the space between the pupils of the eyes. Understanding this term requires some familiarity with anatomical and optical concepts."},"example_sentences":[{"sentence":"The interpupil distance is a crucial measurement for fitting eyeglasses.","translation":"瞳孔間距離は、眼鏡を合わせるために重要な測定値です。","type":"general","meaning_category":"distance"},{"sentence":"The interpupil line should be parallel to the lens plane.","translation":"瞳孔間線はレンズ面に平行である必要があります。","type":"technical","meaning_category":"line"}]}