{"word":"Dictyopteran","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"網翅目の昆虫（ゴキブリ、カマキリ、シロアリなど）","english_definition":"An insect of the order Dictyoptera (cockroaches, mantises, termites, etc.).","examples":[{"sentence":"Dictyopterans are characterized by their membranous wings with a network of veins.","translation":"網翅目の昆虫は、網状の翅脈を持つ膜状の翅を特徴とする。"}],"collocations":[],"synonyms":["Dictyoptera"],"antonyms":[]}],"etymology":{"value":"From Dictyoptera, from Greek δίκτυον (diktyon, \"net\") + πτερόν (pteron, \"wing\"), referring to the net-like venation of the wings.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪktiˈɒptərən/","syllables":"dic-ty-op-ter-an"},"inflection":{"noun_plural":"Dictyopterans"},"usage_notes":{"explanation":"The term 'Dictyopteran' is often used in a taxonomic or scientific context. The classification of insects within Dictyoptera has been subject to revision, with some groups (especially termites) now often placed in separate orders.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Dictyoptera (order)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Dictyopteran' is a technical term used in entomology (the study of insects) to refer to insects belonging to the order Dictyoptera. This term is rarely used outside of scientific or academic contexts related to insect classification and biology. The order Dictyoptera historically included cockroaches, mantises, and termites, although modern classifications may separate termites into their own order. Understanding this term requires familiarity with biological taxonomy and insect morphology."},"example_sentences":[{"sentence":"The evolutionary relationships within the Dictyopteran clade are still being investigated.","translation":"網翅類クレード内の進化関係は、まだ調査中である。","type":"noun","meaning_category":"網翅目の昆虫"},{"sentence":"Many Dictyopteran species exhibit hemimetabolous development.","translation":"多くの網翅目の種は、不完全変態を示す。","type":"noun","meaning_category":"網翅目の昆虫"}]}