{"word":"filiating","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(filiateの現在分詞)提携する、加入する、系列に入れる","english_definition":"(present participle of filiate) to attach or associate oneself or a subsidiary body with a larger or controlling organization.","examples":[{"sentence":"The local club is filiating with the national organization.","translation":"その地元のクラブは全国組織と提携している。"},{"sentence":"They are filiating their company with a larger conglomerate.","translation":"彼らは自社をより大きな複合企業と系列に入れている。"}],"collocations":["filiating with","filiating to"],"synonyms":["associating","joining","linking","allying","connecting"],"antonyms":["separating","disaffiliating","detaching","isolating"]}],"etymology":{"value":"From the verb 'filiate,' which comes from the Latin 'filius' meaning 'son.' The original sense relates to establishing parentage or affiliation, which then extended to broader senses of association and connection.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɪlieɪtɪŋ/","syllables":"fil-i-a-ting"},"inflection":{"verb_forms":{"present_simple":["filiate","filiates"],"past_simple":"filiated","past_participle":"filiated","present_participle":"filiating"}},"usage_notes":{"explanation":"'Filiating' is the present participle of 'filiate,' indicating an ongoing action of becoming affiliated or associated with another organization. It suggests a process of establishing a formal connection or alliance. The term is often used in business, politics, and organizational contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is filiating to the success.","correct":"✓ The company is filiating with a larger corporation to ensure success.","note":"'Filiating' requires a direct object or a prepositional phrase indicating with whom or what the affiliation is being made. It's not used to describe a state of success directly. Instead, it describes the act of associating with another entity to achieve a goal, such as success."}],"priority":"★★☆"},"related_words":{"derivatives":["filiate (verb)","affiliation (noun)","affiliated (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Filiating' is a relatively formal term that describes the action of joining or associating with a larger organization. It is often used in business or organizational contexts to describe a formal relationship being established. Understanding this word requires a good grasp of formal vocabulary and the ability to understand complex organizational relationships."},"example_sentences":[{"sentence":"The university is filiating with several research institutions to expand its scientific capabilities.","translation":"その大学は科学的能力を拡大するために、いくつかの研究機関と提携している。","type":"verb","meaning_category":"提携する"},{"sentence":"By filiating with a well-known brand, the startup hopes to gain credibility and market access.","translation":"有名なブランドと提携することで、そのスタートアップ企業は信頼性と市場へのアクセスを得ることを期待している。","type":"verb","meaning_category":"系列に入れる"}]}