{"word":"glaucousness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（植物、果実などの）白粉を帯びた状態、灰緑色であること","english_definition":"The state or quality of being glaucous; having a powdery or waxy coating giving a frosted appearance, or being of a pale greyish or bluish-green color.","examples":[{"sentence":"The glaucousness of the plums gave them a beautiful, almost ethereal appearance.","translation":"そのプラムの白粉を帯びた様子が、それらに美しく、ほとんど非現実的な外観を与えていた。"},{"sentence":"The glaucousness of the leaves is a characteristic feature of this species.","translation":"その葉の灰緑色は、この種の特徴的な特徴である。"}],"collocations":["leaf glaucousness","fruit glaucousness","degree of glaucousness"],"synonyms":["bloom","waxiness","greyish-green color","bluish-green color"],"antonyms":["vividness","brightness","intensity"]}],"etymology":{"value":"Derived from 'glaucous', which comes from the Latin 'glaucus' and the Greek 'glaukos', meaning 'bluish-green' or 'greyish-green'. The suffix '-ness' is added to form the noun, indicating the state or quality of being glaucous.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡlɔːkəsnəs/","syllables":"glau-cous-ness"},"inflection":{"noun_plural":"glaucousnesses (rarely used)"},"usage_notes":{"explanation":"'Glaucousness' specifically refers to the powdery or waxy coating on plants or fruits, or the pale greyish or bluish-green color itself. It is most commonly used in botanical descriptions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The glaucousness of the sky was beautiful.","correct":"✓ The grey sky was beautiful.","note":"'Glaucousness' is typically used for describing plants, fruits, or other natural objects that have a powdery or waxy coating or a greyish-green color, not for general descriptions like the sky."}],"priority":"★☆☆"},"related_words":{"derivatives":["glaucous (adjective)"],"related_terms":["pruinose (adjective, similar meaning)","farinose (adjective, similar meaning)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Glaucousness' is a specialized term primarily used in botany to describe the powdery or waxy coating on plants or fruits, which gives them a frosted appearance, or the pale greyish or bluish-green color itself. It is not commonly used in everyday language. Understanding this term requires a strong vocabulary and familiarity with scientific or botanical descriptions."},"example_sentences":[{"sentence":"The degree of glaucousness varied among the different varieties of grapes.","translation":"白粉を帯びた状態の程度は、ブドウの異なる品種間で異なっていた。","type":"noun","meaning_category":"state of being glaucous"},{"sentence":"The glaucousness on the cabbage leaves protected them from the sun.","translation":"キャベツの葉の白粉が、それらを太陽から保護していた。","type":"noun","meaning_category":"powdery coating"}]}