{"word":"untrappable","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not able to be trapped; that cannot be caught in a trap.","english_definition":"Not capable of being trapped or caught in a trap, either literally or figuratively.","examples":[{"sentence":"The fox was untrappable, always managing to avoid the snares.","translation":"その狐は捕獲不可能で、常に罠を避けていた。"},{"sentence":"His argument was untrappable, leaving no room for counter-arguments.","translation":"彼の議論は反論の余地がなく、捕らえどころがなかった。"}],"collocations":["untrappable animal","untrappable argument","untrappable idea"],"synonyms":["inescapable","unavoidable","elusive","uncatchable"],"antonyms":["trappable","vulnerable","susceptible","catchable"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'trappable'. 'Trappable' is derived from 'trap' (a device to catch animals or people) with the suffix '-able' (meaning 'capable of being').","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈtræpəbəl/","syllables":"un-trap-pa-ble"},"inflection":{"adjective_forms":{"comparative":"more untrappable","superlative":"most untrappable"}},"usage_notes":{"explanation":"'Untrappable' is used to describe something that is very difficult or impossible to catch or ensnare, either physically (like an animal avoiding traps) or metaphorically (like an argument that is difficult to refute). It emphasizes the quality of being elusive or resistant to being confined or captured.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The untrappable animal was easily caught.","correct":"✓ The supposedly untrappable animal was easily caught.","note":"'Untrappable' means 'not able to be trapped,' so saying an untrappable animal was easily caught is a contradiction. You would need to use a word like 'supposedly' to indicate that it was thought to be untrappable but wasn't."}],"priority":"★★☆"},"related_words":{"derivatives":["trap","trappable","untrap"],"phrasal_verbs":[],"related_adjectives":["elusive","uncatchable","inescapable"],"related_nouns":["trap","snare"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Untrappable' is a relatively uncommon word that means something cannot be caught in a trap. It can be used literally to describe an animal that avoids traps or figuratively to describe an argument or idea that is difficult to refute or understand. Because it is not a common word, it may require a higher level of vocabulary knowledge to understand. The prefix 'un-' makes it clear that it is the opposite of 'trappable.'"},"example_sentences":[{"sentence":"The wily old coyote proved to be untrappable, evading every attempt to capture it.","translation":"そのずる賢い年老いたコヨーテは、捕獲不可能であることが証明され、あらゆる捕獲の試みをかわした。","type":"adjective","meaning_category":"Literal (animal)"},{"sentence":"The lawyer presented an untrappable defense, leaving the prosecution with no recourse.","translation":"弁護士は反論の余地のない弁護を展開し、検察側は打つ手なしとなった。","type":"adjective","meaning_category":"Figurative (argument)"}]}