{"word":"calentural","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(地域、特に熱帯地域が)熱病にかかりやすい、熱病を媒介する","english_definition":"(of a region, especially a tropical one) prone to or transmitting fevers.","examples":[{"sentence":"The coast was calentural and unhealthy.","translation":"その海岸は熱病にかかりやすく、不健康だった。"}],"synonyms":["feverish","malarial","tropical"],"antonyms":["healthy","temperate"]}],"etymology":{"value":"Derived from Spanish *calentura* meaning 'fever', ultimately from Latin *calere* meaning 'to be warm'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkæləntˈjʊərəl/","syllables":"ca-len-tur-al"},"inflection":{"notes":"Adjective, comparative and superlative forms are formed regularly (more calentural, most calentural)."},"usage_notes":{"explanation":"The word 'calentural' is relatively rare in modern English. It is primarily used to describe regions or climates that are conducive to the spread of fevers, particularly those associated with tropical diseases like malaria.","priority":"★★☆"},"related_words":{"derivatives":["calenture (noun: a tropical fever or delirium formerly attributed to exposure to the sun on board ship)"],"related_terms":["malaria","tropical disease","fever"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Calentural' is a rare and somewhat archaic word used to describe regions prone to causing fevers, especially tropical fevers. It is not commonly used in modern English. Its use is generally confined to historical or specialized contexts dealing with tropical medicine or descriptions of climates known for causing fever-related illnesses."},"example_sentences":[{"sentence":"The early settlers found the swampy lowlands to be decidedly calentural.","translation":"初期の入植者たちは、その湿地の低地が明らかに熱病にかかりやすいことに気づいた。","type":"adjective","meaning_category":"prone to fevers"},{"sentence":"The old maps warned of the calentural nature of the river delta.","translation":"古い地図は、その河口デルタ地帯が熱病を媒介する性質があることを警告していた。","type":"adjective","meaning_category":"transmitting fevers"}]}