{"word":"value-weighted","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"価値加重の、時価総額加重の","english_definition":"(of an index or portfolio) constructed by weighting each component by its market capitalization or other measure of value.","examples":[{"sentence":"The index is value-weighted, meaning that larger companies have a greater influence on its performance.","translation":"その指数は価値加重されており、つまり、より大きな企業がそのパフォーマンスに大きな影響を与えます。"},{"sentence":"Value-weighted portfolios are commonly used as benchmarks for investment performance.","translation":"価値加重ポートフォリオは、投資パフォーマンスのベンチマークとして一般的に使用されます。"}],"collocations":["value-weighted index (価値加重指数)","value-weighted portfolio (価値加重ポートフォリオ)","market value-weighted (時価総額加重)"],"synonyms":["market-cap weighted","capitalization-weighted"],"antonyms":["equally-weighted","price-weighted"]},{"part_of_speech":"adjective","definition":"価値によって重み付けされた","english_definition":"weighted according to value; having weights assigned based on the relative value of each item.","examples":[{"sentence":"The survey results were value-weighted to account for the different sizes of the participating companies.","translation":"調査結果は、参加企業の規模の違いを考慮するために、価値によって重み付けされました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term is formed by combining 'value' (referring to market capitalization or other measure of worth) and 'weighted' (indicating that items are given different importance based on their value).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvæljuːˌweɪtɪd/","syllables":"val-ue-weight-ed"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Value-weighted' is commonly used in finance and economics to describe indices or portfolios where the weight of each component is determined by its market capitalization (market value). This means that larger companies or assets have a greater influence on the overall index or portfolio performance. It can also be used more generally to describe any situation where items are weighted based on their relative value.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The value-weighted index gave a good return, however, it was not equally-weighted.","correct":"✓ The value-weighted index gave a good return; however, it was not equally-weighted.","note":"When using 'however' to connect two independent clauses, it should be preceded by a semicolon, not a comma."}],"priority":"★★☆"},"related_words":{"derivatives":["weight (名詞: 重み)","weighting (名詞: 重み付け)","market capitalization (名詞: 時価総額)"],"phrasal_verbs":[],"related_concepts":["index fund","exchange-traded fund (ETF)","benchmark","portfolio management"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, primarily used in financial and economic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'value-weighted' is primarily used in finance and economics. It describes a method of constructing an index or portfolio where each component's influence is proportional to its market value. This means larger, more valuable companies or assets have a greater impact on the index or portfolio's performance. Understanding this term is important for anyone analyzing financial markets or investment strategies."},"example_sentences":[{"sentence":"The S&P 500 is a **value-weighted** index of the 500 largest publicly traded companies in the United States.","translation":"S&P 500は、米国で公開取引されている500の最大の企業の価値加重指数です。","type":"adjective","meaning_category":"finance"},{"sentence":"We constructed a **value-weighted** portfolio to mirror the composition of the benchmark index.","translation":"ベンチマーク指数の構成を反映するために、価値加重ポートフォリオを構築しました。","type":"adjective","meaning_category":"finance"},{"sentence":"The **value-weighted** approach ensures that the index reflects the overall market sentiment more accurately.","translation":"価値加重アプローチにより、指数は市場全体のセンチメントをより正確に反映することが保証されます。","type":"adjective","meaning_category":"finance"}]}