{"word":"Falsifizierung","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学、科学) 反証可能性、反証主義","english_definition":"(philosophy, science) falsifiability, the possibility that a statement or hypothesis can be shown to be false by observation or experiment.","examples":[{"sentence":"Die Falsifizierung ist ein wichtiges Kriterium für wissenschaftliche Theorien.","translation":"反証可能性は科学理論にとって重要な基準である。"},{"sentence":"Popper betonte die Bedeutung der Falsifizierung für den Fortschritt der Wissenschaft.","translation":"ポパーは科学の進歩における反証可能性の重要性を強調した。"}],"collocations":["Falsifizierung einer Theorie (理論の反証)","Kriterium der Falsifizierung (反証可能性の基準)","Prinzip der Falsifizierung (反証可能性の原則)"],"synonyms":["Widerlegung","Entkräftung","Gegenbeweis"],"antonyms":["Verifizierung","Bestätigung","Beweis"]}],"etymology":{"value":"Von dem Verb 'falsifizieren' (falsifizieren) abgeleitet, das seinerseits vom lateinischen 'falsificare' (fälschen, verfälschen) stammt.","priority":"★★☆"},"pronunciation":{"ipa":"/falsifikat͡si̯oˈniːʁʊŋ/","syllables":"Fal-si-fi-zie-rung"},"inflection":{"noun_forms":{"singular":"die Falsifizierung","plural":"die Falsifizierungen"}},"usage_notes":{"explanation":"Der Begriff 'Falsifizierung' ist besonders in der Wissenschaftstheorie von Karl Popper von zentraler Bedeutung. Popper argumentierte, dass eine wissenschaftliche Theorie nicht durch Verifizierung (Bestätigung), sondern durch Falsifizierung (Widerlegung) geprüft werden sollte. Eine Theorie ist dann wissenschaftlich, wenn sie falsifizierbar ist, d.h. wenn es prinzipiell möglich ist, sie durch Beobachtungen oder Experimente zu widerlegen.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Die Verifizierung ist wichtiger als die Falsifizierung.","correct":"Die Falsifizierung ist wichtiger als die Verifizierung.","note":"Im Kontext der Popper'schen Wissenschaftstheorie ist die Falsifizierung wichtiger, da sie zur kritischen Prüfung und Weiterentwicklung von Theorien beiträgt."}],"priority":"★★☆"},"related_words":{"derivatives":["falsifizieren (verb: to falsify)","falsifizierbar (adjective: falsifiable)","Falsifikationismus (noun: falsificationism)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relativ selten, hauptsächlich in wissenschaftlichen und philosophischen Texten.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Falsifizierung' ist ein Fachbegriff aus der Wissenschaftstheorie, der die Möglichkeit beschreibt, eine Aussage oder Hypothese durch Beobachtung oder Experiment zu widerlegen. Es ist ein zentrales Konzept im Falsifikationismus von Karl Popper, der argumentierte, dass wissenschaftliche Theorien nicht durch Bestätigung, sondern durch die Möglichkeit der Widerlegung geprüft werden sollten. Dieser Begriff wird hauptsächlich in wissenschaftlichen, philosophischen und akademischen Kontexten verwendet."},"example_sentences":[{"sentence":"Die Möglichkeit der Falsifizierung unterscheidet wissenschaftliche Aussagen von pseudowissenschaftlichen Behauptungen.","translation":"反証可能性の有無が、科学的な主張と疑似科学的な主張を区別する。","type":"noun","meaning_category":"反証可能性"},{"sentence":"Die Theorie wurde durch neue experimentelle Daten einer Falsifizierung unterzogen.","translation":"その理論は、新しい実験データによって反証にかけられた。","type":"noun","meaning_category":"反証"}]}