{"word":"terrestricity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"陸上生活への適応性、陸生であること","english_definition":"The state or quality of being terrestrial; adaptation to terrestrial life.","examples":[{"sentence":"The terrestricity of amphibians varies greatly among species.","translation":"両生類の陸上生活への適応性は種によって大きく異なります。"},{"sentence":"Evolutionary changes have increased the terrestricity of certain crustaceans.","translation":"進化の変化により、特定の甲殻類の陸上生活への適応性が向上しました。"}],"collocations":["high terrestricity","degree of terrestricity"],"synonyms":["terrestrialism","land adaptation"],"antonyms":["aquaticity"]}],"etymology":{"value":"Formed from 'terrestrial' (relating to the earth) + '-icity' (a suffix denoting state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɛrəˈstrɪsɪti/","syllables":"ter-res-tric-i-ty"},"inflection":{"noun_plural":"terrestricities (rare)"},"usage_notes":{"explanation":"'Terrestricity' refers to the degree to which an organism is adapted to living on land. It is often used in biological contexts to describe the evolutionary transition from aquatic to terrestrial environments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The terrestricity of the planet is important for human life.","correct":"✓ The terrestrial nature of the planet is important for human life.","note":"When referring to the general characteristics of a planet, use 'terrestrial nature' or 'landmass' instead of 'terrestricity'. 'Terrestricity' is typically used to describe the adaptation of organisms."}],"priority":"★☆☆"},"related_words":{"derivatives":["terrestrial (adjective)","terrestrially (adverb)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Terrestricity' is a technical term used in biology and ecology to describe how well an organism is adapted to living on land. It's not a commonly used word and is primarily found in scientific literature. Understanding this term requires a good grasp of biology and evolutionary concepts."},"example_sentences":[{"sentence":"The study examined the correlation between terrestricity and respiratory adaptations in crabs.","translation":"その研究では、カニの陸上生活への適応性と呼吸器系の適応との相関関係を調べました。","type":"noun","meaning_category":"陸上生活への適応性"},{"sentence":"Increased terrestricity in some snail species is linked to shell modifications.","translation":"一部のカタツムリ種における陸上生活への適応性の向上は、殻の形状変化と関連しています。","type":"noun","meaning_category":"陸生であること"}]}