{"word":"non-surrenderable","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"譲渡不能な、放棄できない、明け渡し不能な","english_definition":"Not capable of being surrendered; that cannot be given up or relinquished.","examples":[{"sentence":"The right to free speech is considered a non-surrenderable right in many democracies.","translation":"言論の自由は、多くの民主主義国において譲渡不能な権利とみなされている。"},{"sentence":"The contract stipulated that the lease was non-surrenderable for the first five years.","translation":"契約書には、最初の5年間はリースを解約できないことが明記されていた。"},{"sentence":"Some believe that certain fundamental principles are non-surrenderable, regardless of the circumstances.","translation":"状況に関わらず、特定の基本原則は放棄できないと信じる人もいる。"}],"collocations":["non-surrenderable right (譲渡不能な権利)","non-surrenderable lease (解約できないリース)","non-surrenderable asset (放棄できない資産)"],"synonyms":["inalienable","non-transferable","irrevocable","unrelinquishable"],"antonyms":["surrenderable","transferable","relinquishable"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to 'surrenderable', which is derived from 'surrender' (to give up or relinquish something) and the suffix '-able' (indicating capability).","priority":"medium"},"pronunciation":{"ipa":"/ˌnɒn.səˈrɛn.də.rə.bəl/","syllables":"non-sur-ren-der-a-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with 'non-surrenderable' due to its absolute meaning."},"usage_notes":{"explanation":"'Non-surrenderable' is typically used in legal, political, or philosophical contexts to describe rights, agreements, or principles that cannot be given up or transferred to another party. It implies a strong sense of permanence and inviolability.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"The non-surrenderable of the property was a key point in the negotiation.","correct":"The non-surrenderability of the property was a key point in the negotiation.","note":"The noun form 'non-surrenderability' is more appropriate when referring to the quality or state of being non-surrenderable."}],"priority":"medium"},"related_words":{"derivatives":["non-surrenderability (noun: the state of being non-surrenderable)","surrender (verb: to give up; noun: the act of surrendering)","surrenderable (adjective: capable of being surrendered)"],"phrases":["non-surrender clause (譲渡不能条項)"],"priority":"medium"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"low"},"readability_explanation":{"level":"C1","text":"The word 'non-surrenderable' is a complex adjective used to describe something that cannot be given up or relinquished. It's often used in formal contexts like legal documents or philosophical discussions. Understanding the word requires familiarity with the base word 'surrender' and the negative prefix 'non-'. The suffix '-able' indicates that something is capable of being acted upon, but in this case, it's negated by 'non-'."},"example_sentences":[{"sentence":"The government declared that the nation's sovereignty was non-surrenderable.","translation":"政府は、国家の主権は譲渡不能であると宣言した。","type":"general"},{"sentence":"The terms of the trust specified that the beneficiary's rights were non-surrenderable.","translation":"信託の条件には、受益者の権利は放棄できないと明記されていた。","type":"legal"},{"sentence":"Many activists argue that basic human rights are non-surrenderable, even in times of crisis.","translation":"多くの活動家は、危機時においても基本的人権は放棄できないと主張している。","type":"political"}]}