{"word":"coincider","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(物理学で)同時計数回路、同時現象検出器","english_definition":"(physics) An electronic circuit that produces an output only when two or more input signals occur simultaneously or within a specified time interval.","examples":[{"sentence":"The coincider was used to detect simultaneous particle events.","translation":"その同時計数回路は、同時発生する粒子事象を検出するために使用された。"}],"collocations":["particle coincider","photon coincider"],"synonyms":["coincidence detector","AND gate (in digital logic)"],"antonyms":[]}],"etymology":{"value":"Derived from 'coincide' (to occur at the same time) with the suffix '-er' (indicating an agent or device).","priority":"★★☆"},"pronunciation":{"ipa":"/koʊɪnˈsaɪdər/","syllables":"co-in-cid-er"},"inflection":{"noun_plural":"coinciders"},"usage_notes":{"explanation":"The term 'coincider' is primarily used in physics, particularly in experimental particle physics and quantum optics. It refers to a device or circuit designed to identify events that happen at the same time, or within a very short time window. It's a specialized term and not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The coincider helped them agree.","correct":"✓ The coincider helped them detect simultaneous events.","note":"'Coincider' is a technical term related to simultaneous events in physics, not agreement between people."}],"priority":"★★☆"},"related_words":{"derivatives":["coincidence (noun): a remarkable concurrence of events or circumstances without apparent causal connection.","coincidental (adjective): resulting from a coincidence; occurring by chance.","coincide (verb): occur at the same time or simultaneously."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (highly specialized vocabulary)","frequency_google_ngram":"Very low frequency - Primarily used in technical contexts within physics.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Coincider' is a highly specialized term used in physics. It refers to a device that detects simultaneous events. Understanding this term requires a background in physics or electronics. It is not part of general vocabulary. If you encounter this word, it is likely in a technical or scientific context related to experimental physics.","priority":"★★☆"},"example_sentences":[{"sentence":"The quantum optics experiment used a coincider to measure photon correlations.","translation":"その量子光学実験では、同時計数回路を使用して光子の相関を測定した。","type":"noun","meaning_category":"Physics"},{"sentence":"The cosmic ray detector included a coincider to filter out background noise.","translation":"その宇宙線検出器には、バックグラウンドノイズを除去するための同時計数回路が含まれていた。","type":"noun","meaning_category":"Physics"}]}