{"word":"theater-in-the-round","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"円形劇場、中央舞台式劇場","english_definition":"a form of theatrical presentation in which the audience surrounds the stage on all sides.","examples":[{"sentence":"The play was performed in a theater-in-the-round, providing an intimate experience for the audience.","translation":"その劇は円形劇場で上演され、観客に親密な体験を提供した。"},{"sentence":"Theater-in-the-round allows for unique staging and audience interaction.","translation":"円形劇場は、独特の舞台演出と観客との交流を可能にする。"}],"collocations":["perform in a theater-in-the-round (円形劇場で上演する)","design a theater-in-the-round (円形劇場を設計する)","attend a theater-in-the-round (円形劇場に行く)"],"synonyms":["arena theater","central staging","circular theater"],"antonyms":["proscenium theater","thrust stage"],"notes":"Also known as arena theater or central staging."}],"etymology":{"value":"The term describes the physical arrangement of the theater, where the stage is surrounded by the audience, forming a circular or near-circular shape.","priority":"★☆☆"},"pronunciation":{"ipa":"ˈθiːətər ɪn ðə ˈraʊnd","syllables":"the-a-ter in the round"},"inflection":{"noun_plural":"theaters-in-the-round"},"usage_notes":{"explanation":"Theater-in-the-round is a type of stage configuration where the audience surrounds the stage on all sides. This creates a more intimate and immersive experience for the audience, as they are closer to the action and can see the performance from multiple angles. However, it also presents challenges for the director and actors, as they must ensure that all audience members have a good view and that the staging is effective from all sides.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a play in the theater in round.","correct":"✓ I saw a play in the theater-in-the-round.","note":"The correct term is 'theater-in-the-round,' not 'theater in round'."},{"incorrect":"✗ The theater in the round is a proscenium stage.","correct":"✓ The theater-in-the-round is not a proscenium stage.","note":"Theater-in-the-round is the opposite of a proscenium stage, where the audience faces the stage from one side only."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["stage","arena","theater","proscenium","thrust stage","black box theater"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Theater-in-the-round' refers to a specific type of theater where the stage is in the center, and the audience sits all around it. This setup makes the audience feel closer to the actors and the story. It's different from a regular theater where the audience sits only in front of the stage. Because of the unique layout, the actors have to make sure they're facing all directions so everyone can see them. This term is used in discussions about different kinds of theater designs and how they affect the viewing experience."},"example_sentences":[{"sentence":"The actors had to be aware of their movements at all times in the theater-in-the-round.","translation":"円形劇場では、俳優は常に自分の動きに気を配らなければならなかった。","type":"general"},{"sentence":"The director chose theater-in-the-round to create a more immersive experience.","translation":"演出家は、より没入感のある体験を作り出すために円形劇場を選んだ。","type":"general"},{"sentence":"Lighting is a challenge in theater-in-the-round because it must accommodate all viewing angles.","translation":"円形劇場では、照明はすべての視角に対応する必要があるため、課題となる。","type":"technical"}]}