{"word":"unfallibly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"必ず、間違いなく、確実に","english_definition":"in a way that is incapable of failing or being wrong; certainly; reliably.","examples":[{"sentence":"He unfallibly remembered every detail of the event.","translation":"彼はその出来事の細部を必ず覚えていた。"},{"sentence":"The system unfallibly detects any errors.","translation":"そのシステムはどんなエラーも必ず検出する。"},{"sentence":"She unfallibly knew what to say in any situation.","translation":"彼女はどんな状況でも必ず何を言うべきかを知っていた。"}],"collocations":["unfallibly accurate","unfallibly correct","unfallibly reliable","unfallibly effective"],"synonyms":["certainly","assuredly","definitely","infallibly","reliably","unerringly","unquestionably"],"antonyms":["fallibly","uncertainly","unreliably"]}],"etymology":{"value":"\"Infallibly\" is derived from \"infallible,\" which comes from the Latin word \"infallibilis.\" This is composed of \"in-\" (not) and \"fallibilis\" (liable to err), which itself comes from \"fallere\" (to deceive or fail). The adverbial form \"unfallibly\" is a less common variant of \"infallibly,\" emphasizing the certainty and lack of error.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈfælɪbəli/","syllables":"un-fal-li-bly"},"inflection":{"notes":"Adverb - no inflection"},"usage_notes":{"explanation":"\"Unfallibly\" is a less common synonym of \"infallibly.\" Both adverbs mean \"in a way that is incapable of failing or being wrong.\" \"Infallibly\" is more frequently used. \"Unfallibly\" can add a slightly stronger emphasis on the certainty and reliability. The choice between them often depends on stylistic preference.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She unfallibly makes mistakes.","correct":"✓ She never makes mistakes. / ✓ She infallibly gets everything right.","note":"\"Unfallibly\" implies a lack of error, so it cannot be used to describe someone who makes mistakes. Use a contrasting statement instead."},{"incorrect":"✗ The machine works unfallibly, but sometimes it breaks.","correct":"✓ The machine works reliably, but sometimes it breaks.","note":"\"Unfallibly\" implies a complete absence of failure, so it's contradictory to say it sometimes breaks. Use a weaker term like \"reliably\" instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["infallible (adjective)","infallibility (noun)"],"phrases":["unfallible memory","unfallible system","unfallible instinct"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unfallibly\" means \"in a way that cannot fail or be wrong.\" It's a formal word, not commonly used in everyday conversation. You might find it in academic writing or technical contexts where absolute certainty is emphasized. It's similar to \"infallibly\" but less common. It is used to describe something that always works or is always correct, without any possibility of error. For example, \"The machine unfallibly detects errors\" means the machine always finds errors and never misses any."},"example_sentences":[{"sentence":"The program unfallibly identifies the correct data.","translation":"そのプログラムは必ず正しいデータを識別する。","type":"adverb","meaning_category":"certainly"},{"sentence":"Her intuition unfallibly guided her to the right decision.","translation":"彼女の直感は必ず彼女を正しい決断へと導いた。","type":"adverb","meaning_category":"reliably"},{"sentence":"The security system unfallibly alerts the authorities in case of a breach.","translation":"そのセキュリティシステムは、違反があった場合、必ず当局に警告する。","type":"adverb","meaning_category":"assuredly"}]}