{"word":"low-roughage","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"低粗繊維の、低残渣の","english_definition":"(of food or a diet) containing little fiber, designed to reduce the amount of undigested material passing through the bowel.","examples":[{"sentence":"A low-roughage diet is often prescribed after bowel surgery.","translation":"低粗繊維食は、腸の手術後に処方されることが多い。"},{"sentence":"Patients with certain digestive conditions may benefit from a low-roughage diet.","translation":"特定の消化器疾患を持つ患者は、低粗繊維食から恩恵を受ける可能性がある。"}],"collocations":["low-roughage diet","low-fiber diet","low-residue diet"],"synonyms":["low-fiber","low-residue"],"antonyms":["high-roughage","high-fiber"]},{"part_of_speech":"noun","definition":"低粗繊維食","english_definition":"A diet low in fiber.","examples":[{"sentence":"The doctor recommended a low-roughage diet to help manage my symptoms.","translation":"医師は私の症状を管理するために、低粗繊維食を推奨しました。"}],"collocations":["be on a low-roughage diet"],"synonyms":["low-fiber diet","low-residue diet"],"antonyms":["high-roughage diet","high-fiber diet"]}],"etymology":{"value":"Combination of 'low' and 'roughage'. 'Roughage' refers to indigestible plant fiber.","priority":"★★★"},"pronunciation":{"ipa":"/ˌloʊ ˈrʌfɪdʒ/","syllables":"low-rough-age"},"inflection":{"notes":"Adjective and noun forms are generally invariable."},"usage_notes":{"explanation":"'Low-roughage' and 'low-fiber' are often used interchangeably. 'Low-residue' is a more general term that includes not only fiber but also other undigested materials. This type of diet is often prescribed for people with digestive problems, such as Crohn's disease, ulcerative colitis, or after surgery.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I eat low roughage for weight loss.","correct":"✓ I eat a low-roughage diet for my health.","note":"Low-roughage diets are generally not recommended for weight loss due to the importance of fiber for overall health and satiety. They are primarily used for specific medical conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["roughage","fiber","residue"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in medical or dietary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Low-roughage' refers to food or a diet that contains very little fiber. Fiber is the part of plant-based foods that the body can't digest. A low-roughage diet is sometimes recommended for people who have certain digestive problems or who are recovering from surgery. It helps to reduce the amount of undigested material that passes through the intestines. Examples of foods allowed on a low-roughage diet include white rice, white bread, and cooked vegetables without skins or seeds. This term is mostly used in medical or nutritional contexts.","priority":"★★★"},"example_sentences":[{"sentence":"After the surgery, he was put on a **low-roughage** diet to allow his digestive system to heal.","translation":"手術後、彼の消化器系を回復させるために、彼は低粗繊維食を与えられた。","type":"adjective","meaning_category":"dietary"},{"sentence":"A **low-roughage** meal might consist of chicken breast, mashed potatoes, and cooked carrots.","translation":"低粗繊維食は、鶏むね肉、マッシュポテト、煮たニンジンで構成されるかもしれない。","type":"adjective","meaning_category":"dietary"},{"sentence":"Following a **low-roughage** diet can help reduce symptoms of Crohn's disease.","translation":"低粗繊維食に従うことは、クローン病の症状を軽減するのに役立つ可能性がある。","type":"noun","meaning_category":"diet"}]}