{"word":"eccritic","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"文献批評家、テキスト批評家","english_definition":"A textual critic; one skilled in eccritics.","examples":[{"sentence":"The eccritic carefully examined the manuscript for errors.","translation":"その文献批評家は、誤りがないか原稿を注意深く調べた。"},{"sentence":"As an eccritic, she specialized in ancient Greek texts.","translation":"文献批評家として、彼女は古代ギリシャのテキストを専門としていた。"}],"collocations":["textual eccritic","manuscript eccritic"],"synonyms":["textual critic","philologist","editor"],"antonyms":[],"notes":"This term is relatively rare, with 'textual critic' being more common."}],"etymology":{"value":"Derived from Greek 'ekkritikos' meaning 'able to discern' or 'critical'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈkrɪtɪk/","syllables":"ec-crit-ic"},"inflection":{"noun_plural":"eccritics"},"usage_notes":{"explanation":"'Eccritic' is a specialized term referring to a person who practices textual criticism. Textual criticism involves analyzing and comparing different versions of a text to determine the most accurate or original form. This is often done with ancient or historical documents where multiple copies exist, and errors or variations may have accumulated over time. The term is less frequently used than 'textual critic' or 'philologist'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an eccritic of modern art.","correct":"✓ He was a critic of modern art.","note":"'Eccritic' specifically refers to textual criticism, not general art criticism."}],"priority":"★☆☆"},"related_words":{"derivatives":["eccritical (adjective)","eccritics (noun - the art or science of textual criticism)"],"related_terms":["textual criticism","philology","hermeneutics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'eccritic' is a highly specialized term used within academic circles, particularly in the fields of classical studies, literature, and history. It refers to someone who engages in textual criticism, which is the practice of analyzing and comparing different versions of a text to determine its most accurate or original form. Due to its niche usage, it is unlikely to be encountered outside of scholarly contexts. Understanding this word requires familiarity with the principles and methods of textual scholarship."},"example_sentences":[{"sentence":"The **eccritic** spent years comparing the various manuscripts of the play.","translation":"その文献批評家は何年もかけてその劇の様々な写本を比較した。","type":"noun","meaning_category":"文献批評家"},{"sentence":"The **eccritic's** work revealed several previously unknown details about the author's life.","translation":"その文献批評家の研究によって、これまで知られていなかった著者の生涯に関するいくつかの詳細が明らかになった。","type":"noun","meaning_category":"文献批評家"}]}