{"word":"centimeter-gram-second","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"センチメートル・グラム・秒系 (CGS単位系): 長さの単位にセンチメートル、質量の単位にグラム、時間の単位に秒を用いる単位系","english_definition":"A system of units of measurement based on the centimeter as the unit of length, the gram as the unit of mass, and the second as the unit of time.","examples":[{"sentence":"The centimeter-gram-second system was widely used in physics and chemistry before the adoption of the SI system.","translation":"センチメートル・グラム・秒系は、SI単位系が採用される以前は物理学や化学で広く使用されていました。"}],"collocations":["CGS system","CGS units","Gaussian CGS units","Electrostatic CGS units","Electromagnetic CGS units"],"synonyms":["CGS","CGS system of units"],"antonyms":["SI","International System of Units"]}],"etymology":{"value":"The term 'centimeter-gram-second' is derived directly from the base units used in the system: centimeter (cm) for length, gram (g) for mass, and second (s) for time.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛntɪˌmiːtər ˌɡræm ˈsɛkənd/","syllables":"cen-ti-me-ter-gram-sec-ond"},"inflection":{"noun_plural":"centimeter-gram-seconds"},"usage_notes":{"explanation":"The centimeter-gram-second (CGS) system is a system of physical units. It has been largely replaced by the International System of Units (SI), but it is still used in some fields of physics, particularly in electromagnetism and astrophysics. There are several variations of the CGS system, including Gaussian units, electrostatic units (ESU), and electromagnetic units (EMU).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used meters, grams, and seconds in my calculation.","correct":"✓ I used centimeters, grams, and seconds in my calculation.","note":"Ensure that you are using the correct units for the CGS system, which are centimeters, grams, and seconds."}],"priority":"★★★"},"related_words":{"derivatives":["CGS unit","Gaussian units","ESU","EMU"],"related_systems":["MKS (meter-kilogram-second) system","SI (International System of Units)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'centimeter-gram-second' refers to a system of units used in physics and chemistry. It's based on three fundamental units: the centimeter for measuring length, the gram for measuring mass, and the second for measuring time. Although it's less common now due to the widespread use of the SI system (International System of Units), you might still encounter it in older scientific literature or in specific fields like electromagnetism.","priority":"★★★"},"example_sentences":[{"sentence":"The magnetic field strength was measured in gauss, a CGS unit.","translation":"磁場の強さは、CGS単位であるガウスで測定されました。","type":"example","meaning_category":"CGS unit"},{"sentence":"Many older physics textbooks use the centimeter-gram-second system of units.","translation":"多くの古い物理学の教科書は、センチメートル・グラム・秒単位系を使用しています。","type":"example","meaning_category":"CGS system"},{"sentence":"Converting from CGS units to SI units can sometimes be complex.","translation":"CGS単位からSI単位への変換は、時に複雑になることがあります。","type":"example","meaning_category":"CGS to SI conversion"}]}