{"word":"Cagoulards","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"フランスの右翼秘密結社「カグール団」のメンバー","english_definition":"Members of 'La Cagoule', a French far-right terrorist group active in the 1930s.","examples":[{"sentence":"The Cagoulards were responsible for several bombings and assassinations.","translation":"カグール団はいくつかの爆破事件や暗殺事件の責任を負っていた。"},{"sentence":"The French government cracked down on the Cagoulards after their activities became widely known.","translation":"フランス政府はカグール団の活動が広く知られるようになった後、彼らを厳しく取り締まった。"}],"collocations":["Cagoulard activities","Cagoulard plot","Cagoulard network"],"synonyms":["members of La Cagoule"],"antonyms":[]}],"etymology":{"value":"'Cagoulard' derives from 'cagoule', a French word for a hood or cowl, referring to the hoods worn by members of the secret organization to conceal their identities.","priority":"★★★"},"pronunciation":{"ipa":"/kaɡulaʁ/","syllables":"Ca-gou-lards"},"inflection":{"noun_plural":"Cagoulards"},"usage_notes":{"explanation":"'Cagoulards' specifically refers to the members of the French far-right group 'La Cagoule'. It's a historical term associated with political violence in France during the interwar period.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a cagoulard of the French Resistance.","correct":"✓ He was a member of the French Resistance.","note":"Cagoulards were a far-right group, not associated with the French Resistance, which fought against the Nazi occupation."}],"priority":"★★☆"},"related_words":{"derivatives":["cagoule (hood)"],"related_historical_figures":["Eugène Deloncle (leader of La Cagoule)"],"related_organizations":["French Popular Front (political opponents of La Cagoule)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in historical contexts related to French history.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cagoulards' is a specialized term referring to members of a specific historical organization, 'La Cagoule'. Understanding this term requires knowledge of French history, particularly the interwar period and the rise of far-right groups. The term is rarely used outside of this historical context."},"example_sentences":[{"sentence":"The historian wrote about the violent actions of the Cagoulards.","translation":"歴史家はカグール団の暴力的な行動について書いた。","type":"noun","meaning_category":"member of a far-right group"},{"sentence":"The Cagoulards aimed to overthrow the French Third Republic.","translation":"カグール団はフランス第三共和政の打倒を目指した。","type":"noun","meaning_category":"member of a far-right group"}]}