{"word":"Ergoism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学) 自己の存在を唯一の確実な真理と見なす哲学説。自己の思考や意識のみを重視し、外部世界の存在や他者の意識を疑う立場。","english_definition":"(philosophy) The philosophical belief that one's own existence is the only certainty; the philosophical position that emphasizes one's own thoughts and consciousness, doubting the existence of the external world or the consciousness of others.","examples":[{"sentence":"Ergoism is a form of solipsism, focusing on the self as the sole source of knowledge.","translation":"エルゴイズムは独我論の一形態であり、自己を知識の唯一の源泉として重視する。"},{"sentence":"The ergoist rejects the idea of objective reality, asserting that only subjective experience is real.","translation":"エルゴイストは客観的現実という概念を否定し、主観的な経験のみが現実であると主張する。"}],"collocations":["philosophical ergoism","subjective ergoism","radical ergoism"],"synonyms":["solipsism","subjectivism","egoism"],"antonyms":["realism","objectivism","altruism"]}],"etymology":{"value":"ラテン語の「ergo」（したがって）に由来し、自己の思考から結論を導き出すという概念を強調する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɜːrɡoʊɪzəm/","syllables":"er-go-ism"},"inflection":{"noun_plural":"Ergoisms"},"usage_notes":{"explanation":"Ergoismは、哲学的な議論において、自己中心的な視点や独我論的な傾向を指す言葉として用いられることがあります。ただし、一般的な用語ではなく、哲学の専門的な文脈で使用されることが多いです。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices ergoism in his daily life by ignoring others.","correct":"✓ He exhibits ergoistic tendencies in his behavior.","note":"Ergoismは哲学的な立場を指す言葉であり、日常的な行動を指す言葉ではありません。日常的な行動を説明する場合は、「ergoistic tendencies（エルゴイズム的な傾向）」のような表現を使うのが適切です。"},{"incorrect":"✗ Ergoism is the same as egoism.","correct":"✓ Ergoism is related to egoism but focuses more on the certainty of one's own existence.","note":"Ergoismはegoism（利己主義）と関連がありますが、自己の利益を追求する利己主義とは異なり、自己の存在のみを確実なものと見なす哲学的な立場を指します。"}],"priority":"★★☆"},"related_words":{"derivatives":["ergoist (名詞: エルゴイスト)","ergoistic (形容詞: エルゴイズム的な)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 哲学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Ergoism」は、哲学の分野で使われる専門的な言葉で、自分の存在だけが確かだと考える考え方を指します。これは、外の世界や他の人の心が存在するかどうかを疑う考え方と関連しています。日常会話ではほとんど使われず、哲学の議論で出てくることがあります。"},"example_sentences":[{"sentence":"The philosopher explored the implications of Ergoism in modern ethics.","translation":"その哲学者は、現代倫理におけるエルゴイズムの含意を探求した。","type":"noun","meaning_category":"哲学説"},{"sentence":"Critics argue that Ergoism leads to a disconnect from reality.","translation":"批評家たちは、エルゴイズムは現実からの乖離につながると主張する。","type":"noun","meaning_category":"哲学説"}]}