{"word":"acanthocephalan","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"鉤頭動物","english_definition":"Any animal of the phylum Acanthocephala, parasitic worms characterized by the presence of an anterior proboscis armed with hooks, which it uses to penetrate the gut of its host.","examples":[{"sentence":"Acanthocephalans are endoparasites of fish, birds, and mammals.","translation":"鉤頭動物は、魚類、鳥類、哺乳類の内寄生生物である。"},{"sentence":"The acanthocephalan uses its hooked proboscis to attach to the intestinal wall.","translation":"鉤頭動物は、その鉤のある吻を使って腸壁に付着する。"}],"collocations":["acanthocephalan parasite","acanthocephalan infection","acanthocephalan proboscis"],"synonyms":["spiny-headed worm"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ἀκανθοκέφαλος (akanthoképhalos), from ἄκανθα (akantha, \"thorn, prickle\") + κεφαλή (kephalé, \"head\").","priority":"★★☆"},"pronunciation":{"ipa":"/əˌkænθoʊˈsɛfələn/","syllables":"a-can-tho-ceph-a-lan"},"inflection":{"noun_plural":"acanthocephalans"},"usage_notes":{"explanation":"Acanthocephalans are parasitic worms, so discussions of them often involve parasitology, zoology, or veterinary medicine. They are not commonly encountered outside of scientific contexts.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["acanthocephala (phylum name)","acanthocephalous (adjective)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"This word is highly technical and specific to the field of zoology and parasitology. It is unlikely to be encountered outside of academic or scientific contexts. Understanding requires knowledge of biological classification and parasitic worms."},"example_sentences":[{"sentence":"The study focused on the prevalence of acanthocephalan parasites in local fish populations.","translation":"その研究は、地元の魚の個体群における鉤頭動物の寄生虫の蔓延に焦点を当てていた。","type":"noun","meaning_category":"鉤頭動物"},{"sentence":"Acanthocephalan infections can cause significant health problems in livestock.","translation":"鉤頭動物による感染は、家畜に重大な健康上の問題を引き起こす可能性がある。","type":"noun","meaning_category":"鉤頭動物"}]}