{"word":"Anti-Teuton","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"反ドイツ的な、ドイツ人嫌いの","english_definition":"Opposed to Germany or Germans; exhibiting anti-German sentiment.","examples":[{"sentence":"The political cartoon was criticized for its Anti-Teuton imagery.","translation":"その政治漫画は、反ドイツ的なイメージが描かれているとして批判された。"},{"sentence":"During the war, Anti-Teuton sentiment was widespread.","translation":"戦時中、反ドイツ感情が広まった。"}],"collocations":["Anti-Teuton sentiment","Anti-Teuton propaganda","Anti-Teuton league"],"synonyms":["anti-German","Germanophobic"],"antonyms":["pro-German","Teutonophile"]},{"part_of_speech":"noun","definition":"反ドイツ主義者、ドイツ人嫌いの人","english_definition":"A person who opposes Germany or Germans; a person exhibiting anti-German sentiment.","examples":[{"sentence":"He was labeled an Anti-Teuton because of his outspoken criticism of German policies.","translation":"彼はドイツの政策に対する率直な批判から、反ドイツ主義者と見なされた。"}],"collocations":["outspoken Anti-Teuton","zealous Anti-Teuton"],"synonyms":["Germanophobe"],"antonyms":["Teutonophile"]}],"etymology":{"value":"\"Anti-\" (反対) + \"Teuton\" (ドイツ人、ゲルマン人)","priority":"★★★"},"pronunciation":{"ipa":"/ˌænti ˈtjuːtən/","syllables":"An-ti-Teu-ton"},"inflection":{"noun_plural":"Anti-Teutons"},"usage_notes":{"explanation":"The term \"Anti-Teuton\" is primarily historical and often associated with periods of conflict or tension involving Germany. It is a strong term that should be used with care, as it can be considered offensive. The adjective form describes something that expresses opposition to Germany or Germans, while the noun form refers to someone who holds such views.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an anti-teuton person.","correct":"✓ He is an Anti-Teuton.","note":"The term is already an adjective describing a person, so 'person' is redundant."},{"incorrect":"✗ Anti-teuton sentiments are good.","correct":"✓ Anti-Teuton sentiments are harmful.","note":"Expressing opinions on whether such sentiments are 'good' or 'bad' depends on personal values and historical context. The example is changed to reflect the generally negative connotation of such sentiments."}],"priority":"★☆☆"},"related_words":{"derivatives":["Anti-Teutonism (反ドイツ主義)"],"related_terms":["Teuton","German","Germanophobia","xenophobia"]},"level_frequency":{"frequency_google_ngram":"Low frequency - The term is relatively rare in modern usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Anti-Teuton\" refers to opposition to Germany or Germans. It is a relatively rare and historically loaded term, often associated with periods of conflict. It is important to use this term carefully, as it can be offensive. The adjective describes something expressing anti-German sentiment, while the noun refers to a person holding such views."},"example_sentences":[{"sentence":"The newspaper article reflected the Anti-Teuton mood of the time.","translation":"その新聞記事は当時の反ドイツ的な雰囲気を反映していた。","type":"adjective","meaning_category":"反ドイツ的な"},{"sentence":"He was known as an Anti-Teuton for his strong criticism of German nationalism.","translation":"彼はドイツのナショナリズムに対する強い批判から、反ドイツ主義者として知られていた。","type":"noun","meaning_category":"反ドイツ主義者"}]}