{"word":"Aqueity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"水っぽさ、水様性、水のような性質","english_definition":"The state of being aqueous or watery; wateriness.","examples":[{"sentence":"The aqueity of the solution was carefully measured.","translation":"その溶液の水っぽさが注意深く測定された。"},{"sentence":"The aqueity of the vitreous humor is essential for maintaining the eye's shape.","translation":"硝子体の水様性は、眼の形状を維持するために不可欠である。"}],"collocations":["measure the aqueity","determine the aqueity","high aqueity","low aqueity"],"synonyms":["wateriness","aqueousness","liquidity"],"antonyms":["thickness","viscosity","opacity"]}],"etymology":{"value":"Derived from the Latin word \"aqua\" meaning water, with the suffix \"-ity\" indicating a state or condition.","priority":"★★★"},"pronunciation":{"ipa":"/əˈkwiːɪti/","syllables":"a-que-i-ty"},"inflection":{"noun_plural":"Aqueities"},"usage_notes":{"explanation":"\"Aqueity\" is a relatively uncommon word, primarily used in scientific or technical contexts to describe the watery nature or consistency of a substance. It is most often encountered in discussions related to chemistry, biology, or medicine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The aqueity of the paint made it difficult to apply.","correct":"✓ The thinness of the paint made it difficult to apply.","note":"In general conversation, \"thinness\" or \"wateriness\" are more common and easily understood terms."}],"priority":"★☆☆"},"related_words":{"derivatives":["aqueous (adjective: 水性の、水のような)","aqua (noun: 水)","aquatic (adjective: 水生の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Aqueity\" is a technical term referring to the watery quality or consistency of something. It is rarely used in everyday language and is more commonly found in scientific or medical contexts. Understanding the word requires familiarity with scientific vocabulary and abstract concepts related to substance properties.","priority":"★★☆"},"example_sentences":[{"sentence":"The aqueity of the sample indicated a high water content.","translation":"その試料の水様性は、高い水分含有量を示していた。","type":"general","meaning_category":"水っぽさ"},{"sentence":"The aqueity of the eye drops made them easy to administer.","translation":"その点眼薬の水様性により、投与が容易になった。","type":"medical","meaning_category":"水様性"},{"sentence":"The scientist studied the aqueity of different solutions.","translation":"科学者はさまざまな溶液の水っぽさを研究した。","type":"scientific","meaning_category":"水のような性質"}]}