{"word":"Molotov","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"火炎瓶","english_definition":"A crude incendiary device typically consisting of a bottle filled with flammable liquid such as gasoline, with a means of ignition such as a gasoline-soaked rag stuffed in the bottle's neck that is lit just before being thrown.","examples":[{"sentence":"The protesters threw Molotov cocktails at the police.","translation":"抗議者たちは火炎瓶を警察に投げつけた。"},{"sentence":"The building was set on fire with a Molotov.","translation":"建物は火炎瓶で放火された。"}],"collocations":["Molotov cocktail","throw a Molotov","Molotov attack"],"synonyms":["firebomb","gasoline bomb","petrol bomb"],"antonyms":[]}],"etymology":{"value":"Named after Vyacheslav Molotov, a Soviet foreign minister during World War II. The name was coined by the Finns during the Winter War (1939-1940) as a mocking reference to Molotov, whom they blamed for the Soviet invasion. The 'Molotov cocktail' was presented as a 'drink to go with the food' (the food being the Soviet bombs).","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɒlətɒf/","syllables":"Mol-o-tov"},"inflection":{"noun_plural":"Molotovs"},"usage_notes":{"explanation":"The term 'Molotov' almost always refers to the incendiary device itself. It is rarely used in other contexts. The device is typically associated with protests, riots, or acts of war.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He ordered a Molotov at the bar.","correct":"✗ This is not a typical usage.","note":"'Molotov' refers specifically to the incendiary device and is not something one would order at a bar. This would be highly inappropriate and nonsensical."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["incendiary","bomb","weapon","protest","riot"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Molotov' refers to a specific type of weapon, a firebomb. It is typically used in the context of conflict, protests, or historical events. Understanding the term requires knowledge of its historical origin and association with political unrest. Due to its specific and often sensitive context, it is not a commonly used word in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The rioters were armed with Molotov cocktails and rocks.","translation":"暴徒たちは火炎瓶と石で武装していた。","type":"noun","meaning_category":"火炎瓶"},{"sentence":"The use of Molotov cocktails is illegal in many countries.","translation":"多くの国で火炎瓶の使用は違法である。","type":"noun","meaning_category":"火炎瓶"},{"sentence":"The Molotov exploded on impact, setting the car ablaze.","translation":"火炎瓶は衝突時に爆発し、車を炎上させた。","type":"noun","meaning_category":"火炎瓶"}]}