{"word":"ambulacrum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(棘皮動物の)歩帯","english_definition":"A radiating band in certain echinoderms, such as starfish and sea urchins, that bears tube feet.","examples":[{"sentence":"The starfish uses its tube feet, which extend from the ambulacrum, to move and grasp objects.","translation":"ヒトデは、歩帯から伸びる管足を使って移動したり、物をつかんだりする。"},{"sentence":"The ambulacrum in sea urchins contains pores through which the tube feet protrude.","translation":"ウニの歩帯には、管足が突き出るための孔がある。"}],"collocations":["ambulacral system","ambulacral groove","ambulacral plate"],"synonyms":["radial canal","tube feet row"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'ambulacrum,' meaning 'covered walk, alley,' from 'ambulare,' meaning 'to walk.' This refers to the area where the tube feet, used for walking, are located.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæmbjʊˈleɪkrəm/","syllables":"am-bu-la-crum"},"inflection":{"noun_plural":"ambulacra"},"usage_notes":{"explanation":"The term 'ambulacrum' is specific to echinoderms (starfish, sea urchins, sea cucumbers, etc.) and refers to the radial areas containing the tube feet, which are used for locomotion, feeding, and respiration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ambulacrum is a type of shell.","correct":"✓ The ambulacrum is a part of the body of echinoderms that contains tube feet.","note":"The ambulacrum is not a shell but a specific anatomical feature of echinoderms."}],"priority":"★☆☆"},"related_words":{"derivatives":["ambulacral (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ambulacrum' is a specialized term in zoology, specifically referring to the radial areas in echinoderms that contain the tube feet. Understanding this term requires knowledge of echinoderm anatomy and marine biology. It is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"The arrangement of the ambulacrum is a key characteristic in echinoderm classification.","translation":"歩帯の配置は、棘皮動物の分類における重要な特徴である。","type":"noun","meaning_category":"anatomy"},{"sentence":"The fossil shows clear evidence of the ambulacrum structure.","translation":"その化石は、歩帯構造の明確な証拠を示している。","type":"noun","meaning_category":"paleontology"}]}