{"word":"Catalinite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of opaque, fine-grained, dark-colored argillite or shale, often used for ornamental purposes. It is named after Santa Catalina Island, California, where it is found.","english_definition":"An opaque, fine-grained, dark-colored argillite or shale, often used for ornamental purposes, named after Santa Catalina Island, California.","examples":[{"sentence":"The museum displayed several artifacts made of Catalinite.","translation":"博物館には、カタリナイトで作られたいくつかの工芸品が展示されていました。"},{"sentence":"Catalinite was a popular material for carving among Native American tribes.","translation":"カタリナイトは、アメリカ先住民の部族の間で彫刻の材料として人気がありました。"}],"collocations":["Catalinite pipe","Catalinite carving","Catalinite artifact"],"synonyms":["argillite","shale","pipestone"],"antonyms":[]}],"etymology":{"value":"Named after Santa Catalina Island, California, where the material is found.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkætəˈlɪnaɪt/","syllables":"ca-ta-li-nite"},"inflection":{"noun_plural":"Catalinites"},"usage_notes":{"explanation":"Catalinite is primarily used in geological and archaeological contexts. It refers to a specific type of rock found on Santa Catalina Island and other locations, often used by Native American tribes for crafting pipes and other ornamental objects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The catalinite is a type of igneous rock.","correct":"✓ The catalinite is a type of sedimentary rock.","note":"Catalinite is a type of argillite or shale, which are sedimentary rocks, not igneous rocks."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Catalinite' is a specialized term used in geology and archaeology to refer to a specific type of argillite or shale. It is not a commonly used word and is primarily found in technical or academic contexts related to the study of rocks or Native American artifacts. Understanding this term requires a background in earth sciences or anthropology."},"example_sentences":[{"sentence":"The archaeologist identified the material as Catalinite based on its composition and origin.","translation":"考古学者は、その物質の組成と起源に基づいて、カタリナイトであると特定しました。","type":"noun","meaning_category":"Material identification"},{"sentence":"Native American artisans traditionally used Catalinite to create ceremonial pipes.","translation":"アメリカ先住民の職人は、伝統的にカタリナイトを儀式用のパイプを作るために使用していました。","type":"noun","meaning_category":"Cultural artifact"}]}