{"word":"Licury","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of palm tree (Syagrus coronata) native to Brazil, or its fruit.","english_definition":"A species of palm tree (Syagrus coronata) native to Brazil, or the fruit it produces.","examples":[{"sentence":"Licury palms are an important resource for local communities in Brazil.","translation":"リキュリヤシはブラジルの地域社会にとって重要な資源です。"},{"sentence":"The oil extracted from licury nuts is used in cosmetics and food products.","translation":"リキュリナッツから抽出される油は、化粧品や食品に使用されます。"}],"collocations":["licury palm","licury oil","licury nut"],"synonyms":["Syagrus coronata"],"antonyms":[]}],"etymology":{"value":"Derived from a local Brazilian indigenous language.","priority":"★★★"},"pronunciation":{"ipa":"/lɪˈkjʊəri/","syllables":"Li-cu-ry"},"inflection":{"noun_plural":"licuries"},"usage_notes":{"explanation":"Licury refers specifically to the Syagrus coronata palm and its fruit. It is not a widely known term outside of regions where the palm grows.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought some licury at the grocery store.","correct":"✓ I bought some licury nuts at the market.","note":"Licury is not commonly found in grocery stores outside of Brazil. Markets specializing in Brazilian products are more likely to carry it."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Licury' is a specialized term referring to a specific species of palm tree and its fruit, primarily found in Brazil. Due to its limited geographic distribution and specific usage, it is not a common word in general English vocabulary. Understanding its meaning requires knowledge of botany or Brazilian culture."},"example_sentences":[{"sentence":"The local community harvests licury nuts for their livelihood.","translation":"地域社会は生活のためにリキュリナッツを収穫します。","type":"noun","meaning_category":"fruit"},{"sentence":"Licury oil is known for its moisturizing properties in skincare products.","translation":"リキュリ油はスキンケア製品の保湿特性で知られています。","type":"noun","meaning_category":"oil"}]}