{"word":"English-opposing","meanings":[{"part_of_speech":"adjective","definition":"Opposing or against the English language, culture, or people.","english_definition":"Being in opposition to or against the English language, culture, or people.","examples":[{"sentence":"The political movement was described as English-opposing due to its stance on language policy.","translation":"その政治運動は、言語政策に関する姿勢から英語反対であると評された。"},{"sentence":"Some scholars argue that certain historical events fostered English-opposing sentiments in the region.","translation":"一部の学者は、特定の歴史的出来事がその地域で英語反対の感情を助長したと主張している。"}],"synonyms":["anti-English","Anglophobic","English-resistant"],"antonyms":["pro-English","Anglophile","English-supporting"]}],"etymology":{"value":"Formed by combining 'English' with 'opposing'.","priority":"3"},"pronunciation":{"ipa":"/ˈɪŋɡlɪʃ əˌpoʊzɪŋ/","syllables":"En-glish-op-pos-ing"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'English-opposing' is used to describe entities, ideologies, or actions that are in direct opposition to the English language, English culture, or the English people. It can be used in political, cultural, or linguistic contexts.","priority":"2"},"related_words":{"related_terms":["Anglophobia","anti-English sentiment","language policy"]},"level_frequency":{"frequency_google_ngram":"Low frequency. The term is relatively uncommon.","priority":"1"},"readability_explanation":{"level":"C1","text":"The word 'English-opposing' is a compound adjective that is relatively straightforward in meaning but may not be commonly encountered. It is generally used in academic or political discussions."},"example_sentences":[{"sentence":"The group's English-opposing rhetoric has drawn criticism from various sectors.","translation":"そのグループの英語反対のレトリックは、さまざまな分野から批判を浴びている。","type":"adjective","meaning_category":"Opposing English language/culture"},{"sentence":"The government's policies were seen as English-opposing, leading to protests.","translation":"政府の政策は英語反対と見なされ、抗議活動につながった。","type":"adjective","meaning_category":"Opposing English language/culture"}]}