{"word":"Dearworthiness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality of being worthy of being considered dear or beloved; the state of deserving affection or high regard.","english_definition":"The quality or state of being worthy of being considered dear or beloved.","examples":[{"sentence":"Her kindness and compassion demonstrated her dearworthiness to all who knew her.","translation":"彼女の優しさと慈悲深さは、彼女を知るすべての人に、彼女が愛されるに値することを示しました。"},{"sentence":"Despite his flaws, his genuine efforts to improve showed his dearworthiness.","translation":"欠点はあるものの、改善しようとする彼の真摯な努力は、彼が愛されるに値することを示していました。"}],"collocations":["demonstrate dearworthiness","prove dearworthiness","show dearworthiness","lack dearworthiness"],"synonyms":["lovability","worthiness","desirability","attractiveness","value","esteemability"],"antonyms":["unworthiness","despicableness","hatefulness"]}],"etymology":{"value":"Derived from the adjective 'dearworthy' (deserving of love or esteem), which combines 'dear' (beloved, precious) with 'worthy' (having worth or merit) and the suffix '-ness' (denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪərˌwɜːrðinəs/","syllables":"Dear-wor-thi-ness"},"inflection":{"noun_plural":"dearworthinesses (rarely used)"},"usage_notes":{"explanation":"'Dearworthiness' is a relatively uncommon and somewhat formal term. It is used to describe the inherent qualities or actions that make someone or something worthy of being cherished, loved, or highly valued. It emphasizes the deservingness of affection or respect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dearworthiness person.","correct":"✓ The dearworthy person.","note":"'Dearworthiness' is a noun (the quality), while 'dearworthy' is the adjective (describing the person possessing the quality)."},{"incorrect":"✗ He has much dearworthiness.","correct":"✓ He has great dearworthiness. / ✓ He possesses dearworthiness.","note":"Use 'great' or 'much' to quantify dearworthiness, or use verbs like 'possess' to describe having the quality."}],"priority":"★★☆"},"related_words":{"derivatives":["dearworthy (adjective: deserving of love or esteem)","dear (adjective: beloved, precious)","worthy (adjective: having worth or merit)","worthiness (noun: the state of being worthy)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dearworthiness' is a complex and uncommon noun that describes the quality of deserving love or high regard. It is formed by combining 'dearworthy' (an adjective meaning deserving of love) with the suffix '-ness,' which turns it into a noun. This word is not typically used in everyday conversation and is more likely to be found in formal writing or philosophical discussions about the nature of love and value. Understanding this word requires a strong vocabulary and the ability to recognize how suffixes change the meaning and function of words."},"example_sentences":[{"sentence":"The saint's selfless acts were a testament to her profound dearworthiness.","translation":"その聖人の無私の行為は、彼女の深い愛される価値の証でした。","type":"noun","meaning_category":"worthiness of love"},{"sentence":"The film explores the protagonist's journey to discover his own dearworthiness despite past mistakes.","translation":"その映画は、主人公が過去の過ちにもかかわらず、自分自身の愛される価値を発見する旅を描いています。","type":"noun","meaning_category":"deserving affection"}]}