{"word":"dotages","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"老いぼれ、老衰、盲愛","english_definition":"The period of life in which a person is old and weak; senility. Foolish affection; excessive fondness.","examples":[{"sentence":"He spent his dotages in a small cottage by the sea.","translation":"彼は晩年を海のそばの小さなコテージで過ごした。"},{"sentence":"The old king was in his dotages, easily manipulated by his advisors.","translation":"老王は老衰しており、顧問たちに容易に操られていた。"},{"sentence":"Her dotages for her grandchildren were evident in the lavish gifts she gave them.","translation":"彼女の孫たちへの盲愛は、彼らに与える気前の良い贈り物に明らかだった。"}],"collocations":["in one's dotages","dotages of old age","dotages of love"],"synonyms":["senility","decrepitude","imbecility","infatuation","fondness","weakness"],"antonyms":["youth","vigor","sanity","indifference","apathy"]}],"etymology":{"value":"Derived from 'dote,' meaning to be excessively fond or weak-minded, combined with the suffix '-age,' indicating a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdoʊtɪdʒɪz/","syllables":"do-tage-s"},"inflection":{"noun_plural":"dotages"},"usage_notes":{"explanation":"'Dotages' refers to the state of being senile or excessively fond. It is often used to describe the period of old age when someone is physically or mentally weak. It can also refer to foolish or excessive affection. The term is somewhat archaic and not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed dotages in his youth.","correct":"✓ He showed signs of weakness in his youth.","note":"'Dotages' typically refers to old age, not youth."},{"incorrect":"✗ Her dotages was strong.","correct":"✓ Her affection was strong.","note":"'Dotages' is a state, not a quality that can be strong."}],"priority":"★☆☆"},"related_words":{"derivatives":["dote (verb)","doting (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dotages' is a relatively uncommon word that refers to the state of being senile or excessively fond, typically associated with old age. It implies a decline in mental or physical faculties or an excessive display of affection. Due to its infrequent use and somewhat negative connotation, it is more likely to be encountered in literature or formal writing rather than everyday conversation."},"example_sentences":[{"sentence":"The memoirs revealed the king's increasing dotages in his final years.","translation":"その回顧録は、王の晩年の老衰がますます進んでいたことを明らかにした。","type":"noun","meaning_category":"老衰"},{"sentence":"Her dotages on her pet cat were a source of amusement to her friends.","translation":"彼女のペットの猫への盲愛は、友人たちの笑いの種だった。","type":"noun","meaning_category":"盲愛"},{"sentence":"In his dotages, he often confused the present with the past.","translation":"彼は老衰して、しばしば現在と過去を混同した。","type":"noun","meaning_category":"老いぼれ"}]}