{"word":"endolinguistic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"言語内部の、言語内的な","english_definition":"Relating to or existing within a language.","examples":[{"sentence":"The endolinguistic features of a dialect can reveal its historical development.","translation":"ある方言の言語内的特徴は、その歴史的発展を明らかにすることがある。"},{"sentence":"Endolinguistic analysis focuses on the relationships between different elements within a single language system.","translation":"言語内分析は、単一の言語システム内の異なる要素間の関係に焦点を当てる。"}],"collocations":["endolinguistic features","endolinguistic analysis","endolinguistic structure"],"synonyms":["intralingual","internal"],"antonyms":["exolinguistic","extralingual"]}],"etymology":{"value":"'endo-' (内部) + 'linguistic' (言語の)","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛndoʊlɪŋˈɡwɪstɪk/","syllables":"en-do-lin-guis-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Endolinguistic' refers to something that is internal to a specific language, often used in contrast to 'exolinguistic', which refers to external factors influencing a language. It's commonly used in linguistics to describe features, analyses, or structures that are examined within the language itself, without necessarily considering external influences.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The endolinguistic factors caused the language to change.","correct":"The endolinguistic features of the language changed over time.","note":"'Factors' is too broad; 'features' is more specific and appropriate in a linguistic context."}],"priority":"★☆☆"},"related_words":{"derivatives":["endolinguistics (noun)"],"related_terms":["intralingual","exolinguistic","linguistics"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized term used primarily in linguistics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Endolinguistic' is a specialized term used in linguistics. It describes elements or analyses that are internal to a language system, focusing on relationships and structures within that language. It is often contrasted with 'exolinguistic', which refers to external factors influencing a language. This term is typically encountered in academic or technical discussions related to language studies."},"example_sentences":[{"sentence":"The study examined the endolinguistic patterns of vowel shift in the dialect.","translation":"その研究は、その方言における母音推移の言語内的パターンを調査した。","type":"example","meaning_category":"Language analysis"},{"sentence":"Endolinguistic evidence suggests a common origin for these two languages.","translation":"言語内的な証拠は、これらの2つの言語が共通の起源を持つことを示唆している。","type":"example","meaning_category":"Language origin"}]}