{"word":"adhesion-dependent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"接着依存性の、細胞接着依存性の","english_definition":"Requiring cell adhesion for survival, growth, or other cellular processes.","examples":[{"sentence":"The growth of these cells is adhesion-dependent, meaning they cannot proliferate in suspension.","translation":"これらの細胞の成長は接着依存性であり、懸濁状態では増殖できないことを意味します。"},{"sentence":"Adhesion-dependent signaling pathways are crucial for proper tissue development.","translation":"接着依存性のシグナル伝達経路は、適切な組織の発達に不可欠です。"}],"collocations":["adhesion-dependent cell growth","adhesion-dependent signaling","adhesion-dependent survival"],"synonyms":["anchorage-dependent"],"antonyms":["adhesion-independent","anchorage-independent"]}],"etymology":{"value":"Composed of 'adhesion' (the act of sticking or adhering), 'dependent' (relying on something else), and the suffix '-ent' (indicating a state or condition).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ædˈhiːʒən dɪˈpɛndənt/","syllables":"ad-he-sion di-pen-dent"},"inflection":{"notes":"Does not inflect; it is an adjective."},"usage_notes":{"explanation":"'Adhesion-dependent' is primarily used in the context of cell biology and biomedical research. It describes cells or processes that require physical attachment to a substrate or other cells to function properly. This term is often used to distinguish between cells that can grow freely in suspension and those that need to be attached to a surface.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cells are adhesion dependent.","correct":"✓ The cells are adhesion-dependent.","note":"Hyphenation is important for clarity and correctness."},{"incorrect":"✗ Adhesion dependence.","correct":"✓ Adhesion-dependence.","note":"While 'adhesion dependence' might be understood, 'adhesion-dependence' is more precise and commonly used in scientific literature."}],"priority":"☆☆☆"},"related_words":{"derivatives":["adhesion","dependence","dependent"],"related_terms":["cell adhesion","focal adhesion","integrins","extracellular matrix (ECM)"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'adhesion-dependent' is a technical term used in cell biology. It means that something (usually a cell) needs to stick to something else in order to survive, grow, or work properly. If you see this term, it's likely in a scientific context dealing with how cells interact with their environment."},"example_sentences":[{"sentence":"Many types of cancer cells lose their adhesion-dependent growth requirements, allowing them to metastasize.","translation":"多くの種類の癌細胞は、接着依存性の成長要件を失い、転移できるようになります。","type":"scientific","meaning_category":"cell biology"},{"sentence":"The study investigated the adhesion-dependent mechanisms of cell migration.","translation":"その研究では、細胞遊走の接着依存性メカニズムが調査されました。","type":"scientific","meaning_category":"cell biology"}]}