{"word":"Pernio","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"しもやけ","english_definition":"An inflammatory skin condition caused by exposure to cold, damp conditions, resulting in itchy red or purple lesions, typically on the fingers, toes, or ears.","examples":[{"sentence":"She developed pernio on her toes after spending a day in the snow.","translation":"彼女は雪の中で一日過ごした後、足の指にしもやけができた。"},{"sentence":"Keeping your feet warm and dry can help prevent pernio.","translation":"足を暖かく乾燥させておくことは、しもやけの予防に役立つ。"}],"collocations":["develop pernio","treat pernio","prevent pernio","chronic pernio"],"synonyms":["chilblains"],"antonyms":[]}],"etymology":{"value":"From Latin *pernio*, meaning 'chilblain'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɜːrnioʊ/","syllables":"per-ni-o"},"inflection":{"noun_plural":"pernios"},"usage_notes":{"explanation":"Pernio, also known as chilblains, is a localized inflammatory condition that occurs due to exposure to cold and damp environments. It typically affects the extremities, such as fingers and toes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have pernio on my hand.","correct":"✓ I have pernio on my hands.","note":"Pernio usually affects multiple fingers or toes, so the plural form is often more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"NA","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Pernio' is a medical term for chilblains, a condition caused by exposure to cold, damp conditions. It's not a commonly used word in everyday conversation, but it might appear in medical contexts or articles about health and cold weather. The word is of Latin origin, reflecting its medical usage."},"example_sentences":[{"sentence":"The doctor diagnosed her with pernio and recommended a topical cream.","translation":"医者は彼女をしもやけと診断し、塗り薬を勧めた。","type":"noun","meaning_category":"medical condition"},{"sentence":"Pernio can be particularly bothersome during the winter months.","translation":"しもやけは特に冬の時期に悩ましいことがある。","type":"noun","meaning_category":"medical condition"}]}