{"word":"chria","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(修辞学で)逸話、格言、または類似の短い文章の拡張された説明または解説","english_definition":"(rhetoric) an expanded explanation or commentary on an anecdote, maxim, or similar short piece of writing.","examples":[{"sentence":"The student was asked to write a chria on the saying 'Honesty is the best policy.'","translation":"学生は「正直は最善の策」という格言についてchriaを書くように求められた。"}],"collocations":["write a chria","develop a chria","classical chria","rhetorical chria"],"synonyms":["elaboration","exposition","commentary","exegesis"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek χρεία (khreía, “use, need, application; a useful thing; a lesson, moral”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkraɪ.ə/","syllables":"chri-a"},"inflection":{"noun_plural":"chrias"},"usage_notes":{"explanation":"A chria is a specific type of rhetorical exercise that involves expanding on a brief statement to explore its meaning and implications. It typically includes elements such as an introduction, explanation, contrasting arguments, examples, testimony, and a conclusion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a chria about the history of the world.","correct":"✓ He wrote a chria about a specific saying.","note":"A chria is based on a short, pithy statement, not a broad topic."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["rhetoric","progymnasmata","maxim","anecdote"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in academic contexts related to classical rhetoric.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'chria' is specialized vocabulary primarily encountered in the study of classical rhetoric. It refers to a specific type of exercise where a short statement is expanded upon through various rhetorical techniques. Understanding this term requires familiarity with rhetorical theory."},"example_sentences":[{"sentence":"The ancient rhetoricians used the chria as a fundamental exercise in developing persuasive arguments.","translation":"古代の修辞家たちは、chriaを説得力のある議論を展開するための基本的な訓練として用いた。","type":"noun","meaning_category":"rhetoric"},{"sentence":"Her chria on the proverb was insightful and well-structured.","translation":"彼女の箴言に関するchriaは洞察力に富み、構成もしっかりしていた。","type":"noun","meaning_category":"rhetoric"}]}