{"word":"MSPhar","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Master of Science in Pharmacy (薬学修士)","english_definition":"A postgraduate academic master's degree awarded for studies in the field of pharmacy.","examples":[{"sentence":"She holds an MSPhar degree from a prestigious university.","translation":"彼女は名門大学で薬学修士号を取得しています。"},{"sentence":"The MSPhar program provides advanced training in pharmaceutical sciences.","translation":"薬学修士課程は、薬学における高度な訓練を提供します。"}],"collocations":["MSPhar degree","MSPhar program","earn an MSPhar","pursue an MSPhar"],"synonyms":["Master of Science in Pharmacy","MSc in Pharmacy"],"antonyms":[]}],"etymology":{"value":"An abbreviation of Master of Science in Pharmacy.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛmˌɛsˈfɑːr/","syllables":"em-es-phar"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"MSPhar is an abbreviation for Master of Science in Pharmacy, a postgraduate degree focusing on advanced studies and research in pharmaceutical sciences. It is commonly used in academic and professional contexts within the field of pharmacy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"She has a MSPhar degree.","correct":"She has an MSPhar degree.","note":"Use 'an' before MSPhar because it starts with a vowel sound."},{"incorrect":"MSPhars are in high demand.","correct":"Individuals with an MSPhar are in high demand.","note":"MSPhar is the degree itself, not the person holding the degree. Use a phrase like 'individuals with an MSPhar' to refer to people."}],"priority":"★★☆"},"related_words":{"derivatives":["PharmD (Doctor of Pharmacy)","PhD in Pharmacy (Doctor of Philosophy in Pharmacy)","Pharmacist","Pharmaceutical Sciences"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'MSPhar' stands for Master of Science in Pharmacy, a postgraduate degree for advanced study in pharmacy. It is a technical term used in academic and professional settings within the pharmaceutical field. Understanding this term requires familiarity with higher education qualifications and pharmaceutical sciences."},"example_sentences":[{"sentence":"The university offers a comprehensive MSPhar program covering various aspects of drug development.","translation":"その大学は、薬物開発の様々な側面を網羅する包括的な薬学修士課程を提供しています。","type":"noun","meaning_category":"Degree program"},{"sentence":"Earning an MSPhar can significantly enhance career prospects in the pharmaceutical industry.","translation":"薬学修士号を取得することは、製薬業界におけるキャリアの見通しを大幅に向上させる可能性があります。","type":"noun","meaning_category":"Academic qualification"}]}