{"word":"underdyeing","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"下染め（したぞめ）: 最終的な色を出す前に、布や糸などを最初に染めること。","english_definition":"The process of dyeing a fabric or yarn before applying a final, over-dye to achieve a desired color or effect. It's a base dyeing layer.","examples":[{"sentence":"Underdyeing with a lighter color can create interesting tonal variations in the final product.","translation":"より明るい色で下染めをすると、最終製品に面白い色調の変化を生み出すことができます。"},{"sentence":"The artisan used underdyeing to create a subtle, antique look on the fabric.","translation":"職人は下染めを使って、生地に微妙なアンティーク調の外観を作り出しました。"}],"collocations":["apply underdye","create underdye","underdye fabric","underdye yarn"],"synonyms":["base dyeing","pre-dyeing","ground dyeing"],"antonyms":["overdyeing","top dyeing"]},{"part_of_speech":"verb","definition":"下染めする：布や糸などを、最終的な色を出す前に最初に染める。","english_definition":"To dye a fabric or yarn as a base layer before applying a final, over-dye.","examples":[{"sentence":"She underdyed the silk fabric with a pale blue before adding the darker indigo.","translation":"彼女は濃いインディゴを加える前に、絹の生地を淡い青色で下染めしました。"},{"sentence":"The artist underdyed the canvas to create a warmer tone for the painting.","translation":"アーティストは絵画のために、より暖かい色調を作り出すためにキャンバスを下染めしました。"}],"collocations":["underdye with color","underdye fabric","underdye yarn"],"synonyms":["base dye","pre-dye","ground dye"],"antonyms":["overdye","top dye"]}],"etymology":{"value":"'Under-' (below, beneath) + 'dyeing' (the process of applying dye).","priority":"N/A"},"pronunciation":{"ipa":"/ˈʌndərˌdaɪɪŋ/","syllables":"un-der-dye-ing"},"inflection":{"verb_forms":{"present_simple":["underdye","underdyes"],"past_simple":"underdyed","past_participle":"underdyed","present_participle":"underdyeing"},"noun_plural":"underdyeings"},"usage_notes":{"explanation":"Underdyeing is a technique used in textile arts to achieve complex and nuanced color effects. It's often used when a single dye application won't produce the desired result. The underdye provides a base color that interacts with the over-dye, creating depth and dimension.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to overdye the fabric before underdyeing it.","correct":"✓ I'm going to underdye the fabric before overdyeing it.","note":"Underdyeing always comes before overdyeing."}],"priority":"N/A"},"related_words":{"derivatives":["underdyed"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Underdyeing' is a technical term related to dyeing processes. It refers to applying a base layer of dye to a material before applying a final, over-dye. It's used to create depth and complexity in the final color. Understanding this term requires some familiarity with textile arts or dyeing techniques."},"example_sentences":[{"sentence":"The artist used a yellow underdyeing to enhance the vibrancy of the red topcoat.","translation":"アーティストは、赤いトップコートの鮮やかさを高めるために、黄色の下染めを使用しました。","type":"noun","meaning_category":"下染め（名詞）"},{"sentence":"She plans to underdye the wool with a natural dye before weaving it into a tapestry.","translation":"彼女はタペストリーに織り込む前に、羊毛を天然染料で下染めする予定です。","type":"verb","meaning_category":"下染めする（動詞）"}]}