{"word":"subequality","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"準平等、部分的な平等、または完全な平等に至らない状態","english_definition":"A state of being less than fully equal, or a condition approaching equality but not quite reaching it.","examples":[{"sentence":"The new laws aimed to address the subequality in healthcare access between urban and rural populations.","translation":"新しい法律は、都市部と農村部の住民間の医療アクセスにおける準平等を是正することを目的としていた。"},{"sentence":"Despite progress, subequality persists in the workplace, with women often earning less than men for the same work.","translation":"進歩にもかかわらず、職場では準平等が依然として存在し、女性は同じ仕事に対して男性よりも収入が少ないことが多い。"}],"collocations":["address subequality","promote subequality","persistent subequality"],"synonyms":["partial equality","near equality","approaching equality"],"antonyms":["inequality","disparity","inequity"]}],"etymology":{"value":"The word \"subequality\" is formed by combining the prefix \"sub-\" (meaning \"under\" or \"less than\") with the word \"equality.\" It suggests a state that is beneath or short of full equality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌbɪˈkwɒləti/","syllables":"sub-e-qual-i-ty"},"inflection":{"noun_plural":"subequalities"},"usage_notes":{"explanation":"\"Subequality\" is often used in discussions of social justice, economics, and politics to describe situations where formal equality may exist (e.g., laws that treat everyone the same), but where underlying factors prevent true equality of opportunity or outcome. It highlights the gap between legal or theoretical equality and the lived experiences of different groups.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country achieved complete subequality after the revolution.","correct":"✓ The country achieved greater equality after the revolution.","note":"\"Subequality\" implies less than full equality. If complete equality is achieved, use \"equality\" instead."},{"incorrect":"✗ Subequality is better than equality.","correct":"✓ Equality is better than subequality.","note":"Equality is generally considered a more desirable state than subequality."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["equity","social justice","equal opportunity","affirmative action","disparate impact"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"subequality\" is a relatively uncommon term used to describe a state that is close to, but not quite, full equality. It's often used in academic or political discussions to highlight situations where there are still significant disparities despite efforts to promote equality. Understanding this word requires a grasp of abstract concepts related to social justice and fairness."},"example_sentences":[{"sentence":"The policy changes resulted in a noticeable improvement, but subequality remained a concern.","translation":"政策の変更により目に見える改善が見られたが、準平等は依然として懸念事項であった。","type":"noun","meaning_category":"準平等"},{"sentence":"Researchers studied the factors contributing to the persistence of subequality in educational outcomes.","translation":"研究者たちは、教育成果における準平等の持続に寄与する要因を研究した。","type":"noun","meaning_category":"準平等"}]}