{"word":"evangelization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"伝道、福音宣教","english_definition":"The act of preaching the gospel; the spreading of the Christian faith by preaching or personal witness.","examples":[{"sentence":"The evangelization of Africa began in the 19th century.","translation":"アフリカの伝道は19世紀に始まった。"},{"sentence":"He dedicated his life to the evangelization of the unreached.","translation":"彼は未到達の人々への伝道に生涯を捧げた。"},{"sentence":"The church supports various evangelization efforts around the world.","translation":"教会は世界中の様々な伝道活動を支援している。"}],"collocations":["new evangelization (新しい福音宣教)","primary evangelization (最初の福音宣教)","missionary evangelization (宣教師による福音宣教)","street evangelization (路上伝道)"],"synonyms":["proselytization","missionizing","preaching","conversion"],"antonyms":["deconversion","apostasy"]}],"etymology":{"value":"Late Latin *evangelizare* 'announce the gospel,' from Greek *euangelizesthai* 'bring good news,' from *euangelion* 'good news, gospel.'","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌvændʒəlɪˈzeɪʃən/","syllables":"e-van-ge-li-za-tion"},"inflection":{"noun_plural":"evangelizations"},"usage_notes":{"explanation":"\"Evangelization\" refers specifically to the act of spreading the Christian gospel. It often involves preaching, teaching, and personal witness to convert people to Christianity. The term is most commonly used within Christian contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The evangelization of the company led to increased profits.","correct":"✓ The marketing campaign led to increased profits.","note":"\"Evangelization\" is specific to religious conversion. Use a different term for promoting a product or idea."},{"incorrect":"✗ He evangelized his political beliefs to everyone he met.","correct":"✓ He promoted his political beliefs to everyone he met.","note":"Use a different term like \"promote\" or \"advocate\" when referring to spreading non-religious beliefs."}],"priority":"★★☆"},"related_words":{"derivatives":["evangelize (verb: 伝道する)","evangelist (noun: 伝道者)","evangelical (adjective/noun: 福音主義の/福音主義者)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Evangelization\" is a formal term primarily used in religious contexts, specifically referring to the act of spreading the Christian gospel. It involves actively trying to convert people to Christianity through preaching, teaching, and personal testimony. Due to its specific religious connotation, it is not commonly used in everyday conversation but is more likely to appear in religious texts, academic discussions on religion, or news reports about missionary work."},"example_sentences":[{"sentence":"The church organized an evangelization campaign to reach out to the local community.","translation":"教会は地域社会に働きかけるために伝道キャンペーンを企画した。","type":"noun","meaning_category":"伝道活動"},{"sentence":"Early Christians engaged in evangelization despite facing persecution.","translation":"初期のキリスト教徒は迫害に直面しながらも伝道活動に従事した。","type":"noun","meaning_category":"伝道活動"},{"sentence":"The goal of evangelization is to share the good news of Jesus Christ.","translation":"伝道の目的はイエス・キリストの良き知らせを分かち合うことである。","type":"noun","meaning_category":"伝道の目的"}]}