{"word":"twice-bereaved","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"二度喪失を経験した、二重に死別を経験した","english_definition":"having experienced the loss of two people through death.","examples":[{"sentence":"The twice-bereaved mother struggled to cope with her grief.","translation":"二度死別を経験した母親は、悲しみに耐えるのに苦労した。"},{"sentence":"Support groups are available for twice-bereaved individuals.","translation":"二重に死別を経験した人のための支援グループがあります。"}],"collocations":["twice-bereaved mother","twice-bereaved parent","twice-bereaved family","twice-bereaved individual"],"synonyms":["doubly bereaved","bereaved twice over"],"antonyms":[],"notes":"This term is often used to describe someone who has lost two close relatives or loved ones, typically parents or children."}],"etymology":{"value":"The word is formed by combining \"twice\" (meaning two times) with \"bereaved\" (meaning having suffered the loss of a loved one through death).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtwaɪs bɪˈriːvd/","syllables":"twice-be-reaved"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term 'twice-bereaved' is used to describe someone who has experienced the profound grief and loss associated with the death of two significant people in their life. It emphasizes the compounded sorrow and challenges faced by individuals in such circumstances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a twice bereaved.","correct":"✓ She is a twice-bereaved person. / ✓ She is twice-bereaved.","note":"'Twice-bereaved' is an adjective, so it needs to modify a noun (e.g., person, mother, parent) or stand alone as an adjective describing someone."}],"priority":"★★☆"},"related_words":{"derivatives":["bereaved","bereavement"],"phrases":["grief","loss","mourning","coping with grief"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. It is a specific term used in contexts related to grief and loss.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'twice-bereaved' is a relatively uncommon term used to describe someone who has experienced the death of two significant people in their life. It is often used in contexts related to grief counseling, support groups, or discussions about loss and bereavement. Understanding this word requires a good vocabulary and the ability to comprehend complex emotional states."},"example_sentences":[{"sentence":"The charity provides support for families, including those who are twice-bereaved.","translation":"その慈善団体は、二重に死別を経験した家族を含む家族を支援しています。","type":"general","meaning_category":"general"},{"sentence":"The twice-bereaved widow found solace in a support group.","translation":"二度死別を経験した未亡人は、支援グループで慰めを見つけた。","type":"specific","meaning_category":"specific"}]}