{"word":"Selamliks","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A type of formal greeting or visit in Ottoman Turkish culture, typically involving a visit from a male guest to the host's home.","english_definition":"A formal visit or greeting, especially in Ottoman Turkish culture, typically involving a male guest visiting the host's home.","examples":[{"sentence":"The selamliks were an important part of Ottoman social life.","translation":"セラームリクはオスマン帝国の社会生活の重要な一部でした。"},{"sentence":"He received many selamliks during the holy month of Ramadan.","translation":"彼はラマダンの聖なる月に多くのセラームリクを受けました。"}],"collocations":["receive selamliks","pay a selamlik","attend selamliks"],"synonyms":["visit","greeting","social call"],"antonyms":[]}],"etymology":{"value":"Derived from the Turkish word 'selamlık', which refers to the part of a house reserved for male guests in traditional Ottoman houses. The word 'selam' means 'greeting' or 'peace'.","priority":"★★☆"},"pronunciation":{"ipa":"/seˈlɑːmlɪks/","syllables":"se-lam-liks"},"inflection":{"noun_plural":"Selamliks"},"usage_notes":{"explanation":"'Selamliks' refers to a specific type of formal visit or greeting within the context of Ottoman Turkish culture. It's important to note the historical and cultural context when using this word. It is often associated with the social customs and traditions of the Ottoman Empire.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They exchanged selamliks at the airport.","correct":"✓ They exchanged greetings at the airport.","note":"'Selamliks' refers to a specific type of formal visit, not a general greeting. Use 'greetings' for a general exchange of pleasantries."}],"priority":"★★☆"},"related_words":{"derivatives":["selamlık (Turkish word for the part of the house reserved for male guests)","selam (Turkish word for greeting or peace)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Selamliks' is a specialized term related to Ottoman Turkish culture, referring to a formal type of visit or greeting. Due to its specific cultural and historical context, it is not a commonly used word. Understanding the Ottoman social customs is essential for comprehending its meaning."},"example_sentences":[{"sentence":"The selamliks were a way for men to socialize and conduct business.","translation":"セラームリクは男性が交流し、ビジネスを行う方法でした。","type":"noun","meaning_category":"formal visit"},{"sentence":"The architecture of the house included a designated area for selamliks.","translation":"その家の建築には、セラームリクのための指定されたエリアが含まれていました。","type":"noun","meaning_category":"formal visit"}]}