{"word":"Representee","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"被代表者、代理される人","english_definition":"A person or entity who is represented by an agent or representative.","examples":[{"sentence":"The lawyer has a duty to act in the best interests of their representee.","translation":"弁護士は、被代表者の最善の利益のために行動する義務がある。"},{"sentence":"The union acts as the representee for its members in negotiations with management.","translation":"労働組合は、経営陣との交渉において、組合員の被代表者として行動する。"},{"sentence":"The representee must provide clear instructions to their representative.","translation":"被代表者は、代表者に明確な指示を提供しなければならない。"}],"collocations":["act as representee","interests of the representee","obligations of the representee","rights of the representee"],"synonyms":["client","principal","ward","constituent"],"antonyms":["representative","agent","proxy"]}],"etymology":{"value":"Formed from the verb 'represent' and the suffix '-ee', indicating the recipient of the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛprɪzɛnˈtiː/","syllables":"re-pre-sen-tee"},"inflection":{"noun_plural":"representees"},"usage_notes":{"explanation":"'Representee' refers to the individual or group on whose behalf someone else (the representative) is acting. This term is commonly used in legal, business, and political contexts to denote the person or entity being represented. It emphasizes the relationship between the person being represented and their representative.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The representee represents the company.","correct":"✓ The representative represents the company.","note":"The representee is the one being represented, not the one doing the representing."},{"incorrect":"✗ The representee must to sign the contract.","correct":"✓ The representee must sign the contract.","note":"The infinitive form of a verb after a modal verb (must, should, can, etc.) does not require 'to'."}],"priority":"★★☆"},"related_words":{"derivatives":["represent","representation","representative"],"related_concepts":["agency","fiduciary duty","proxy","mandate"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'representee' is a formal and relatively uncommon word used to describe the person or entity being represented by someone else. It is most often encountered in legal or business contexts where the relationship between a representative and the person they represent is being discussed. Understanding this term requires a good grasp of legal and business vocabulary."},"example_sentences":[{"sentence":"As the representee, she had the final say in all decisions.","translation":"被代表者として、彼女はすべての決定において最終的な決定権を持っていた。","type":"general","meaning_category":"general"},{"sentence":"The representee's wishes were carefully considered by the lawyer.","translation":"弁護士は被代表者の意向を注意深く検討した。","type":"legal","meaning_category":"legal"},{"sentence":"The union acted as the representee for the workers during the negotiations.","translation":"労働組合は交渉中、労働者の被代表者として行動した。","type":"business","meaning_category":"business"}]}