{"word":"Piscataway","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ピスカタウェイ (アメリカ合衆国ニュージャージー州の地名)","english_definition":"A township in Middlesex County, New Jersey, United States.","examples":[{"sentence":"Piscataway is located in central New Jersey.","translation":"ピスカタウェイはニュージャージー州の中央部に位置しています。"},{"sentence":"I live in Piscataway.","translation":"私はピスカタウェイに住んでいます。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ピスカタウェイ族 (アメリカ先住民の部族)","english_definition":"An Algonquian-speaking Native American tribe historically located in the Maryland and Virginia areas of the United States.","examples":[{"sentence":"The Piscataway tribe is recognized by the state of Maryland.","translation":"ピスカタウェイ族はメリーランド州によって承認されています。"},{"sentence":"The Piscataway people have a rich history.","translation":"ピスカタウェイの人々は豊かな歴史を持っています。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"ピスカタウェイの、ピスカタウェイ族の","english_definition":"Relating to the township of Piscataway, New Jersey, or the Piscataway tribe.","examples":[{"sentence":"The Piscataway High School is a well-known school in the area.","translation":"ピスカタウェイ高校は、この地域ではよく知られた学校です。"},{"sentence":"Piscataway tribal customs are being revived.","translation":"ピスカタウェイ族の慣習が復活しつつあります。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name \"Piscataway\" is derived from the Algonquian language, possibly meaning \"dark river\" or \"place of the great deer.\"","priority":"★★☆"},"pronunciation":{"ipa":"/pɪˈskætəˌweɪ/","syllables":"Pis-cat-a-way"},"inflection":{},"usage_notes":{"explanation":"Piscataway can refer to a place (a township in New Jersey) or a group of people (a Native American tribe). Context is important to understand the intended meaning.","priority":"★★☆"},"common_mistakes":{},"related_words":{},"level_frequency":{},"readability_explanation":{"level":"B2","text":"'Piscataway' is a proper noun that refers to a specific location (a township in New Jersey) and a specific group of people (a Native American tribe). It's not a commonly used word unless you are discussing these specific topics. When encountered, understanding the context is key to knowing whether it refers to the place or the people."},"example_sentences":[{"sentence":"She grew up in Piscataway, New Jersey.","translation":"彼女はニュージャージー州のピスカタウェイで育ちました。","type":"noun","meaning_category":"place"},{"sentence":"The Piscataway tribe is working to preserve its cultural heritage.","translation":"ピスカタウェイ族は、その文化遺産の保存に努めています。","type":"noun","meaning_category":"people"},{"sentence":"The Piscataway River flows through the township.","translation":"ピスカタウェイ川は、その町を流れています。","type":"adjective","meaning_category":"relating to the place"}]}