{"word":"dite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学)二重鉱物、ダイアモンドと類似の鉱物","english_definition":"(geology) A mineral consisting of a dimorphous form of a substance, especially used to refer to a mineral similar to diamond.","examples":[{"sentence":"The geologist analyzed the newly discovered dite to determine its composition.","translation":"地質学者は、組成を特定するために、新しく発見されたditeを分析しました。"}],"collocations":[],"synonyms":["dimorphous mineral"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'dis' (double) referring to its dimorphous nature.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪt/","syllables":"dite"},"inflection":{"noun_plural":"dites"},"usage_notes":{"explanation":"'Dite' is a relatively rare term used in geology to describe a mineral that exists in two different crystalline forms. It is often used when referring to a mineral that shares similarities with diamond in its structure or properties.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He found a dite in his backyard and it was worth millions.","correct":"✓ He found a diamond in his backyard and it was worth millions.","note":"'Dite' is a rare mineralogical term, not commonly found. If someone finds a valuable gem, it is more likely to be a diamond or another well-known gemstone."}],"priority":"★★☆"},"related_words":{"derivatives":["dimorphous"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dite' is a technical term used in geology and mineralogy. It refers to a mineral that exists in a dimorphous form, meaning it has two different crystalline structures. This term is not commonly used outside of specialized scientific contexts. Understanding requires knowledge of mineralogy and crystallography."},"example_sentences":[{"sentence":"The mineral sample was identified as a form of dite, exhibiting unique optical properties.","translation":"その鉱物サンプルはditeの一種であると特定され、独特の光学特性を示していました。","type":"noun","meaning_category":"geology"}]}