{"word":"Hameln","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ハーメルン (ドイツの都市)","english_definition":"A town in Lower Saxony, Germany, known for the legend of the Pied Piper.","examples":[{"sentence":"Hameln is famous for the story of the Pied Piper.","translation":"ハーメルンは、ハーメルンの笛吹き男の物語で有名です。"},{"sentence":"We visited Hameln during our trip to Germany.","translation":"私たちはドイツ旅行中にハーメルンを訪れました。"}],"collocations":["Pied Piper of Hameln (ハーメルンの笛吹き男)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name Hameln is likely derived from the Old Saxon word 'hamelo', meaning 'crooked' or 'bent', referring to the town's location on a bend in the Weser River.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhaːməln/","syllables":"Ha-meln"},"inflection":{},"usage_notes":{"explanation":"Hameln is primarily known as the setting for the famous German legend of the Pied Piper (also known as the Rattenfänger von Hameln). The town's history and culture are deeply intertwined with this tale.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Hamelin (alternative spelling)"],"related_places":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency, primarily in contexts related to the Pied Piper legend.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Hameln' is a proper noun referring to a specific town in Germany. Understanding its significance requires familiarity with the famous folktale of the Pied Piper, which is central to the town's identity and history. The word is relatively uncommon outside of contexts discussing German folklore or travel to the region."},"example_sentences":[{"sentence":"The architecture in Hameln reflects its rich history.","translation":"ハーメルンの建築は、その豊かな歴史を反映しています。","type":"general","meaning_category":"general"},{"sentence":"Many tourists visit Hameln to see the sites associated with the Pied Piper legend.","translation":"多くの観光客がハーメルンの笛吹き男の伝説に関連する場所を見るためにハーメルンを訪れます。","type":"tourism","meaning_category":"tourism"}]}