{"word":"untranslatability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"翻訳不可能性、翻訳できないこと","english_definition":"The quality or state of being impossible to translate from one language to another.","examples":[{"sentence":"The untranslatability of certain cultural concepts poses a challenge for translators.","translation":"特定の文化的概念の翻訳不可能性は、翻訳者にとって課題となる。"},{"sentence":"Some argue that perfect translation is impossible due to the inherent untranslatability of language.","translation":"言語に内在する翻訳不可能性のため、完全な翻訳は不可能だと主張する人もいる。"},{"sentence":"The poem's beauty lies partly in its untranslatability, as the nuances are lost in translation.","translation":"その詩の美しさの一部は、翻訳不可能性にあり、ニュアンスは翻訳で失われる。"}],"collocations":["degree of untranslatability","cultural untranslatability","linguistic untranslatability","inherent untranslatability","pose a challenge of untranslatability"],"synonyms":["non-transferability","incommunicability"],"antonyms":["translatability"]},{"part_of_speech":"noun","definition":"ある言語から別の言語へ翻訳することが非常に困難であること","english_definition":"The extreme difficulty of translating something from one language into another.","examples":[{"sentence":"The expression's untranslatability made it difficult to convey the speaker's true feelings.","translation":"その表現の翻訳不可能性により、話者の真の気持ちを伝えるのが困難になった。"},{"sentence":"The translator struggled with the untranslatability of the idiom, eventually opting for a descriptive paraphrase.","translation":"翻訳者はそのイディオムの翻訳不可能性に苦労し、最終的には説明的な言い換えを選んだ。"}],"collocations":["face the untranslatability","struggle with untranslatability","overcome the untranslatability"],"synonyms":["extreme difficulty in translation","translation challenge"],"antonyms":["ease of translation"]}],"etymology":{"value":"Formed from \"un-\" (not) + \"translatability\" (the ability to be translated). \"Translatability\" comes from \"translate\" + \"-ability.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌntrænzˌleɪdəˈbɪləti/","syllables":"un-trans-la-ta-bil-i-ty"},"inflection":{"noun_plural":"untranslatabilities (rarely used)"},"usage_notes":{"explanation":"\"Untranslatability\" refers to the degree to which a text or concept is considered impossible or very difficult to translate accurately from one language to another. This can be due to various factors, including cultural differences, linguistic structures, or the unique way a concept is expressed in a particular language. It's often discussed in the context of translation studies, linguistics, and philosophy. The term suggests that some elements of language are deeply tied to their original cultural and linguistic context, making direct equivalence in another language unattainable.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The untranslatability is a big problem.","correct":"The untranslatability of the text is a big problem.","note":"It's better to specify what is untranslatable. Using 'the untranslatability' alone can be vague."},{"incorrect":"The word has untranslatability.","correct":"The word exhibits untranslatability. / The word possesses a degree of untranslatability.","note":"'Has untranslatability' is not idiomatic. Use 'exhibits' or 'possesses a degree of' to sound more natural."}],"priority":"★★☆"},"related_words":{"derivatives":["untranslatable (adjective)","translate (verb)","translation (noun)","translatability (noun)"],"related_concepts":["linguistic relativity","Sapir-Whorf hypothesis","cultural equivalence","semantic loss","idiom","cultural context"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Untranslatability\" is a complex term referring to the impossibility or extreme difficulty of accurately conveying the meaning of a text or concept from one language to another. This arises due to differences in linguistic structures, cultural context, or unique expressions within a language. It's a concept often discussed in advanced studies of translation, linguistics, and philosophy, highlighting the challenges in achieving perfect equivalence between languages.","priority":"★★☆"},"example_sentences":[{"sentence":"The **untranslatability** of the Japanese concept of 'wabi-sabi' makes it difficult to fully grasp in Western cultures.","translation":"日本の「侘寂」という概念の翻訳不可能性は、西洋文化で完全に理解することを難しくしている。","type":"noun","meaning_category":"impossibility to translate"},{"sentence":"The translator highlighted the **untranslatability** of the pun, as its humor relied on specific linguistic features.","translation":"翻訳者は、そのしゃれのユーモアが特定の言語的特徴に依存しているため、翻訳不可能性を強調した。","type":"noun","meaning_category":"difficulty to translate"},{"sentence":"Scholars debate the extent of **untranslatability** in literature, questioning whether any text can be perfectly rendered in another language.","translation":"学者は文学における翻訳不可能性の程度について議論し、いかなるテキストも別の言語で完全に表現できるのか疑問を呈している。","type":"noun","meaning_category":"theoretical concept"}]}