{"word":"kilogram-force","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"重量キログラム、キログラム重","english_definition":"A unit of force equal to the force exerted by one kilogram under standard gravity.","examples":[{"sentence":"The pressure was measured in kilogram-force per square centimeter.","translation":"圧力は平方センチメートルあたりの重量キログラムで測定されました。"},{"sentence":"The lifting capacity of the crane is 500 kilogram-force.","translation":"そのクレーンの持ち上げ能力は500重量キログラムです。"}],"collocations":["kilogram-force per square centimeter (kgf/cm²)","kilogram-force meter (kgf⋅m)"],"synonyms":["kilopond"],"antonyms":[],"notes":"It is a non-SI unit of force. Although deprecated, it is still used in some fields."}],"etymology":{"value":"Derived from 'kilogram' (a unit of mass) and 'force' (an interaction that, when unopposed, will change the motion of an object). It represents the force exerted by a mass of one kilogram due to standard gravity.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɪləˌɡræm ˌfɔrs/","syllables":"kil-o-gram force"},"inflection":{"noun_plural":"kilogram-forces"},"usage_notes":{"explanation":"Kilogram-force (kgf) is a unit of force defined as the force exerted by a mass of one kilogram in the standard Earth gravitational field (defined as exactly 9.80665 m/s²). It is a non-SI unit, and its use is generally discouraged in scientific and technical contexts in favor of the SI unit, the newton (N). However, it is still encountered in some engineering fields, particularly in older documents or in specific industries. 1 kgf is approximately equal to 9.80665 N.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mass was 10 kilogram-force.","correct":"✓ The force was 10 kilogram-force.","note":"Kilogram-force is a unit of force, not mass. Use 'kilogram' for mass."},{"incorrect":"✗ The object has a kilogram-force of 5 kg.","correct":"✓ The object has a weight of 5 kgf.","note":"Kilogram-force represents weight, which is a force, not mass."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["newton (N)","kilogram (kg)","force","weight","gravity","dyne"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Kilogram-force' is a unit of measurement for force, specifically the force exerted by one kilogram of mass due to gravity on Earth. It's an older unit and less common now, having been largely replaced by the 'newton' in scientific contexts. You'll mostly encounter it in engineering or older documents when discussing weight or force. It's important to remember that it measures force, not mass, and that 1 kilogram-force is roughly equal to 9.8 newtons."},"example_sentences":[{"sentence":"The tensile strength of the material was measured in kilogram-force per square millimeter.","translation":"材料の引張強度は平方ミリメートルあたりの重量キログラムで測定されました。","type":"example","meaning_category":"measurement"},{"sentence":"The hydraulic press exerted a force of 1000 kilogram-force.","translation":"その油圧プレスは1000重量キログラムの力を加えた。","type":"example","meaning_category":"force"},{"sentence":"The spring balance was calibrated in kilogram-force.","translation":"そのばねばかりは重量キログラムで校正されていた。","type":"example","meaning_category":"calibration"}]}