{"word":"cosmoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"宇宙に似た、宇宙的な","english_definition":"Resembling the universe; cosmic.","examples":[{"sentence":"The artist's work has a cosmoid quality, reflecting the vastness of space.","translation":"その芸術家の作品は、宇宙の広大さを反映した、宇宙的な質を持っている。"}],"collocations":[],"synonyms":["cosmic","universal"],"antonyms":["terrestrial","mundane"]},{"part_of_speech":"noun","definition":"コスモイド鱗（硬鱗の一種）","english_definition":"A type of scale found on some fish, characterized by a hard, enamel-like outer layer.","examples":[{"sentence":"The fossil showed evidence of cosmoid scales, indicating it was an ancient fish.","translation":"その化石はコスモイド鱗の証拠を示しており、古代魚であることを示唆していた。"}],"collocations":["cosmoid scale"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'cosmos' (universe) + '-oid' (resembling).","priority":"★★☆"},"pronunciation":{"ipa":"ˈkɒzmɔɪd","syllables":"cos-moid"},"inflection":{},"usage_notes":{"explanation":"The term 'cosmoid' has two primary uses: as an adjective describing something resembling the universe, and as a noun referring to a specific type of scale found on certain fish. The adjectival form is relatively rare. The noun form is more common in scientific contexts, specifically in zoology and paleontology.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["cosmos","cosmic","cosmology"],"related_terms":["ganoid (another type of fish scale)","placoid (another type of fish scale)"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'cosmoid' is a relatively uncommon term, primarily used in scientific or artistic contexts. As an adjective, it describes something resembling the universe. As a noun, it refers to a specific type of fish scale. Understanding its usage requires familiarity with scientific terminology or a broad vocabulary related to art and the universe."},"example_sentences":[{"sentence":"The design of the building was intended to have a cosmoid feel, with swirling patterns and reflective surfaces.","translation":"その建物のデザインは、渦巻く模様と反射面で、宇宙的な雰囲気を持つように意図されていた。","type":"adjective","meaning_category":"宇宙的な"},{"sentence":"Analysis of the fossilized fish revealed that it possessed cosmoid scales, a feature of ancient sarcopterygians.","translation":"その化石魚の分析により、古代の肉鰭類の特徴であるコスモイド鱗を持っていることが明らかになった。","type":"noun","meaning_category":"コスモイド鱗"}]}