{"word":"pharmacopoeic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"薬局方の、薬局方に関する","english_definition":"relating to or conforming to the standards and requirements of a pharmacopoeia.","examples":[{"sentence":"The substance is of pharmacopoeic quality.","translation":"その物質は薬局方品質です。"},{"sentence":"Pharmacopoeic standards ensure the safety and efficacy of medicines.","translation":"薬局方基準は医薬品の安全性と有効性を保証します。"}],"collocations":["pharmacopoeic quality","pharmacopoeic standard","pharmacopoeic grade"],"synonyms":["official","standardized","compendial"],"antonyms":["non-standard","unofficial"]}],"etymology":{"value":"Derived from \"pharmacopoeia,\" which comes from the Greek words \"pharmakon\" (drug) and \"poiein\" (to make).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɑːrməkəˈpiːɪk/","syllables":"phar-ma-co-poe-ic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"\"Pharmacopoeic\" is an adjective used to describe something that adheres to the standards set forth in a pharmacopoeia. A pharmacopoeia is an official publication containing a list of medicinal drugs with their effects and directions for their use. It also specifies the purity, quality, and strength of drugs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The drug is pharmacopoeia.","correct":"✓ The drug is pharmacopoeic.","note":"\"Pharmacopoeia\" is a noun (the book itself), while \"pharmacopoeic\" is the adjective (describing something that meets the book's standards)."},{"incorrect":"✗ The test must be done pharmacopoeically.","correct":"✓ The test must be done according to pharmacopoeic standards.","note":"While an adverbial form might seem logical, it's more common to express adherence to pharmacopoeic standards using a prepositional phrase."}],"priority":"★☆☆"},"related_words":{"derivatives":["pharmacopoeia"],"phrases":["according to the pharmacopoeia"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"pharmacopoeic\" is a technical term primarily used in the fields of pharmacy, medicine, and chemistry. It indicates conformity with the standards and requirements outlined in a pharmacopoeia, which is an official book listing medicinal drugs and their specifications. The term is not commonly used in everyday language. Understanding requires familiarity with pharmaceutical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The chemical's purity must meet pharmacopoeic requirements.","translation":"その化学物質の純度は薬局方の要件を満たさなければなりません。","type":"general","meaning_category":"quality"},{"sentence":"Only pharmacopoeic grade ingredients are used in the formulation.","translation":"製剤には薬局方グレードの成分のみが使用されています。","type":"specific","meaning_category":"ingredients"}]}