{"word":"unvomited","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"吐かれなかった、吐き出されなかった","english_definition":"Not vomited; not ejected from the stomach through the mouth.","examples":[{"sentence":"The poison remained unvomited in his stomach, causing further damage.","translation":"毒物は彼の胃の中に吐き出されずに残っており、さらなる損傷を引き起こした。"},{"sentence":"The medicine was designed to be absorbed quickly, so it would remain unvomited even if the patient felt nauseous.","translation":"その薬はすぐに吸収されるように設計されており、患者が吐き気を感じても吐き出されずに残るだろう。"}],"collocations":["unvomited food","unvomited medicine","remain unvomited"],"synonyms":["unregurgitated","unexpelled"],"antonyms":["vomited","regurgitated","expelled"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the past participle 'vomited' of the verb 'vomit'.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈvɒmɪtɪd/","syllables":"un-vom-it-ed"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"The word 'unvomited' is relatively rare and primarily used in medical or descriptive contexts to indicate that something has not been ejected from the stomach through vomiting. It often implies a contrast with a situation where vomiting would be expected or possible.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unvomited child was sleeping soundly.","correct":"✓ The child, having not vomited, was sleeping soundly.","note":"Using 'unvomited' to describe a child is unusual. It's more common to describe the *contents* as unvomited, rather than the person. A more natural phrasing would avoid the word altogether."}],"priority":"★☆☆"},"related_words":{"derivatives":["vomit (verb, noun)","vomiting (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unvomited' is a technical term, primarily encountered in medical or highly descriptive writing. It describes the state of something that has not been ejected from the stomach through vomiting. Due to its specialized usage, it is not commonly used in everyday language. Understanding the base word 'vomit' is essential to grasp the meaning of 'unvomited.'"},"example_sentences":[{"sentence":"The doctor checked to see if any of the medication had been unvomited.","translation":"医者は薬が吐き出されずに残っているかどうかを確認した。","type":"adjective","meaning_category":"medical"},{"sentence":"Despite feeling ill, the patient managed to keep the liquid unvomited.","translation":"気分が悪かったにもかかわらず、患者はどうにか液体を吐き出さずに済んだ。","type":"adjective","meaning_category":"descriptive"}]}