{"word":"graphonomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"筆跡学、筆跡鑑定","english_definition":"The study of handwriting, especially as a means of analyzing character or personality.","examples":[{"sentence":"Graphonomy is used in forensic science to identify handwriting.","translation":"筆跡学は、筆跡を特定するために法科学で使用されます。"},{"sentence":"Some people believe that graphonomy can reveal personality traits.","translation":"筆跡学は性格特性を明らかにすることができると信じている人もいます。"}],"collocations":["forensic graphonomy","apply graphonomy","graphonomy analysis"],"synonyms":["handwriting analysis","graphology"],"antonyms":[]}],"etymology":{"value":"From Greek 'grapho-' (writing) + '-nomy' (system of laws or knowledge).","priority":"★★☆"},"pronunciation":{"ipa":"/ɡræˈfɒnəmi/","syllables":"gra-phon-o-my"},"inflection":{"noun_plural":"graphonomies"},"usage_notes":{"explanation":"Graphonomy is often used interchangeably with graphology, but some sources distinguish them. Graphology is sometimes seen as broader, including character analysis, while graphonomy is more strictly the study of handwriting identification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Graphonomy is a science of drawing graphs.","correct":"✓ Graphonomy is a science of analyzing handwriting.","note":"Graphonomy is not related to drawing graphs; it's about handwriting analysis."}],"priority":"★☆☆"},"related_words":{"derivatives":["graphonomic (adjective)"],"related_fields":["forensic science","psychology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Graphonomy is a specialized term referring to the study of handwriting, particularly for identification purposes. It's primarily used in forensic contexts and is not a common term in everyday language. Understanding its distinction from graphology, which includes character analysis, is important in specialized fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The forensic expert used graphonomy to compare the signatures on the documents.","translation":"法医学の専門家は、筆跡学を用いて文書の署名を比較しました。","type":"noun","meaning_category":"筆跡鑑定"},{"sentence":"Graphonomy can help determine the authenticity of a handwritten note.","translation":"筆跡学は、手書きのメモの信憑性を判断するのに役立ちます。","type":"noun","meaning_category":"筆跡学"}]}