{"word":"disinfeudation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"封建的権利の剥奪、封土の解放","english_definition":"The act of depriving someone of their feudal rights or of releasing land from feudal obligations.","examples":[{"sentence":"The disinfeudation of the church lands was a key policy of the new government.","translation":"教会領の封建的権利の剥奪は、新政府の重要な政策であった。"},{"sentence":"Disinfeudation allowed landowners to have greater control over their property.","translation":"封土の解放により、地主は自身の財産に対するより大きな支配権を持つことができた。"}],"collocations":["land disinfeudation","church disinfeudation"],"synonyms":["alienation","deconsecration","liberation"],"antonyms":["infeudation","feudalization"]}],"etymology":{"value":"From 'dis-' (removal, negation) + 'infeudation' (the act of granting a fief).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪsɪnˌfjuːˈdeɪʃən/","syllables":"dis-in-feu-da-tion"},"inflection":{"noun_plural":"disinfeudations"},"usage_notes":{"explanation":"'Disinfeudation' refers to the historical process of removing feudal obligations or rights associated with land ownership. It often involved converting feudal tenures into freehold or other forms of ownership, granting greater autonomy to landowners. This term is primarily used in historical and legal contexts when discussing feudal systems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The disinfeudation was a quick process.","correct":"✓ The disinfeudation was a gradual process.","note":"Disinfeudation typically was a long and complex process, not a quick one."}],"priority":"★☆☆"},"related_words":{"derivatives":["disinfeudate (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'disinfeudation' is a highly specialized term related to feudal history. It describes the process of removing feudal ties or obligations from land. Due to its specific historical and legal context, it is unlikely to be encountered outside of academic or specialized texts. Understanding requires knowledge of feudal systems and land tenure.","priority":"★☆☆"},"example_sentences":[{"sentence":"The French Revolution led to the widespread disinfeudation of noble estates.","translation":"フランス革命は、貴族の領地の広範囲にわたる封建的権利の剥奪につながった。","type":"general","meaning_category":"historical context"},{"sentence":"Disinfeudation aimed to modernize land ownership laws.","translation":"封土の解放は、土地所有法を近代化することを目的としていた。","type":"general","meaning_category":"legal context"}]}