{"word":"intendency","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"（歴史的な行政区画）インテンデンシア；（スペイン植民地時代の）行政管区","english_definition":"A historical administrative division, especially in Spanish colonial territories; the office, jurisdiction, or term of an intendant.","examples":[{"sentence":"The intendency of Buenos Aires was an important administrative center.","translation":"ブエノスアイレスのインテンデンシアは重要な行政の中心地でした。"},{"sentence":"He served as intendant of the province, overseeing its administration.","translation":"彼は州のインテンダントとして、行政を監督しました。"}],"collocations":["intendency system","royal intendency","intendency of finance"],"synonyms":["province","district","region","governorate"],"antonyms":[]}],"etymology":{"value":"From Spanish *intendencia*, from *intendente* (intendant), ultimately from Latin *intendens*, present participle of *intendere* (to intend, to direct).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈtɛndənsi/","syllables":"in-ten-den-cy"},"inflection":{"noun_plural":"intendencies"},"usage_notes":{"explanation":"The term \"intendency\" primarily refers to a historical administrative division, particularly within the Spanish colonial system. It denotes both the territory governed and the office or jurisdiction of the intendant, who was a high-ranking official responsible for overseeing administration, finance, and justice within the region. The term is less commonly used in contemporary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intendency is a modern form of government.","correct":"✓ The intendency was a historical form of government.","note":"Intendencies are historical administrative divisions, not modern forms of government."},{"incorrect":"✗ He was the president of the intendency.","correct":"✓ He was the intendant of the intendency.","note":"The head of an intendency was called an intendant, not a president."}],"priority":"★★☆"},"related_words":{"derivatives":["intendant"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"intendency\" is a relatively uncommon term that refers to a specific type of historical administrative division, primarily associated with the Spanish colonial system. It is most likely to be encountered in historical texts or discussions related to colonial administration. Understanding the term requires some familiarity with historical administrative structures.","priority":"★★☆"},"example_sentences":[{"sentence":"The reforms aimed to strengthen the royal authority in the intendency.","translation":"改革はインテンデンシアにおける王室の権威を強化することを目的としていました。","type":"noun","meaning_category":"Historical administrative division"},{"sentence":"The intendant was responsible for collecting taxes within the intendency.","translation":"インテンダントはインテンデンシア内での税金徴収を担当していました。","type":"noun","meaning_category":"Office/Jurisdiction of an intendant"}]}