{"word":"Oleandrin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オレアンドリン：キョウチクトウに含まれる有毒な強心配糖体","english_definition":"Oleandrin is a toxic cardiac glycoside found in oleander plants.","examples":[{"sentence":"Oleandrin is a potent toxin that can cause serious health problems.","translation":"オレアンドリンは、深刻な健康問題を引き起こす可能性のある強力な毒素です。"},{"sentence":"Studies are being conducted to investigate the potential medicinal properties of oleandrin.","translation":"オレアンドリンの潜在的な薬効を調査するための研究が行われています。"}],"collocations":["oleander poisoning","cardiac glycoside","toxic compound"],"synonyms":["neriine"],"antonyms":[]}],"etymology":{"value":"Oleandrin is derived from the botanical name of the oleander plant, Nerium oleander, with the suffix '-in' indicating it is a chemical compound or substance extracted from the plant.","priority":"★★☆"},"pronunciation":{"ipa":"/oʊˈliːændrɪn/","syllables":"o-le-an-drin"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Oleandrin is primarily known for its toxicity. It affects the heart and can cause a range of symptoms from nausea and vomiting to cardiac arrest and death. Despite its toxicity, there has been some research into its potential use as a medicinal compound, particularly in cancer treatment, but these studies are still in early stages and its use is not approved for medical purposes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Oleandrin is safe to consume in small amounts.","correct":"✓ Oleandrin is toxic and should not be consumed.","note":"Oleandrin is a potent toxin, and any consumption can be dangerous."}],"priority":"★★☆"},"related_words":{"derivatives":["oleander","glycoside","cardiotoxic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Oleandrin is a specialized term related to botany, chemistry, and toxicology. It refers to a specific toxic compound found in oleander plants. Understanding this term requires knowledge of plant toxins and possibly some background in chemistry or pharmacology. It is not a commonly used word and is more likely to be encountered in scientific or medical contexts."},"example_sentences":[{"sentence":"The presence of oleandrin makes oleander plants poisonous to both humans and animals.","translation":"オレアンドリンの存在により、キョウチクトウは人間と動物の両方にとって有毒な植物となっています。","type":"noun","meaning_category":"toxic compound"},{"sentence":"Researchers are studying the effects of oleandrin on cancer cells in vitro.","translation":"研究者たちは、試験管内でオレアンドリンが癌細胞に与える影響を研究しています。","type":"noun","meaning_category":"toxic compound"}]}