{"word":"Gosala","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"(古代インドの)マッカリ・ゴーサラ：ジャイナ教の創始者マハーヴィーラの同時代人で、アージーヴィカ教の創始者。","english_definition":"Makkhali Gosala: An ascetic teacher in ancient India, a contemporary of Mahavira, the founder of Jainism, and the founder of the Ajivika sect.","examples":[{"sentence":"Gosala was a prominent figure in the religious landscape of ancient India.","translation":"ゴーサラは古代インドの宗教界における重要な人物でした。"},{"sentence":"The teachings of Gosala differed significantly from those of Mahavira.","translation":"ゴーサラの教えは、マハーヴィーラの教えとは大きく異なっていました。"}],"collocations":["founder of Ajivika","contemporary of Mahavira","ancient Indian ascetic"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name Gosala likely derives from 'go-sala', meaning 'cowshed' or 'cattle pen' in Sanskrit or Prakrit, possibly indicating his birthplace or early life.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡoʊsələ/","syllables":"Go-sa-la"},"inflection":{},"usage_notes":{"explanation":"Gosala is primarily known as the founder of the Ajivika school of philosophy, which was a fatalistic and deterministic belief system in ancient India. Information about his life and teachings comes mainly from Jain and Buddhist texts, which often present a biased view.","priority":"★★☆"},"common_mistakes":{},"related_words":{"related_terms":["Ajivika","Mahavira","Jainism","Indian philosophy","asceticism"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'Gosala' refers to a specific historical figure in ancient Indian religious history. Understanding its significance requires knowledge of the religious and philosophical landscape of that era, particularly the context of Jainism and the Ajivika school. The term is not commonly used outside of academic or historical discussions. "},"example_sentences":[{"sentence":"The Ajivika philosophy, founded by Gosala, emphasized determinism.","translation":"ゴーサラによって創始されたアージーヴィカ哲学は、決定論を強調しました。","type":"proper noun","meaning_category":"historical figure"},{"sentence":"Historical accounts of Gosala are often found in Jain and Buddhist scriptures.","translation":"ゴーサラに関する歴史的記述は、しばしばジャイナ教と仏教の聖典に見られます。","type":"proper noun","meaning_category":"historical figure"}]}