{"word":"dermatoscopy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"皮膚鏡検査（法）","english_definition":"A diagnostic technique that uses a dermatoscope to view skin lesions, especially in the diagnosis of melanoma.","examples":[{"sentence":"Dermatoscopy is a valuable tool for differentiating between benign and malignant skin lesions.","translation":"皮膚鏡検査は、良性および悪性の皮膚病変を区別するための貴重なツールです。"},{"sentence":"The doctor used dermatoscopy to examine the mole on my back.","translation":"医師は私の背中のほくろを皮膚鏡検査で調べました。"}],"collocations":["perform dermatoscopy","dermatoscopy examination","dermatoscopy image","dermatoscopy findings"],"synonyms":["epiluminescence microscopy","dermoscopy"],"antonyms":[]}],"etymology":{"value":"From 'derma' (skin) + 'scopy' (viewing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɜːrməˈtɒskəpi/","syllables":"der-ma-tos-co-py"},"inflection":{"noun_plural":"dermatoscopies"},"usage_notes":{"explanation":"Dermatoscopy is a non-invasive technique used by dermatologists to examine skin lesions in more detail than can be seen with the naked eye. It involves using a dermatoscope, a handheld device that provides magnification and polarized light to visualize subsurface structures of the skin. It is particularly useful in the early detection and diagnosis of skin cancer, especially melanoma.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ dermatoscopy is used for treat skin cancer.","correct":"✓ dermatoscopy is used for diagnosing skin cancer.","note":"Dermatoscopy is a diagnostic tool, not a treatment."}],"priority":"★★☆"},"related_words":{"derivatives":["dermatoscope","dermatoscopic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dermatoscopy' is a specialized term used in the field of dermatology. It refers to a specific diagnostic procedure, so understanding its meaning requires some familiarity with medical terminology."},"example_sentences":[{"sentence":"The dermatologist recommended dermatoscopy to evaluate the suspicious mole.","translation":"皮膚科医は、疑わしいほくろを評価するために皮膚鏡検査を推奨しました。","type":"general"},{"sentence":"Dermatoscopy can help distinguish between different types of skin cancer.","translation":"皮膚鏡検査は、さまざまな種類の皮膚がんを区別するのに役立ちます。","type":"medical"}]}