{"word":"Driftbolt","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に建設業) アンカーボルトの一種で、コンクリートや石材などの構造物に物を固定するために使用される。ドリフトピンを使用して拡張し、より強固な保持力を提供する。","english_definition":"(Primarily in construction) A type of anchor bolt used to secure objects to concrete, stone, or other structural materials. It uses a drift pin for expansion, providing a more robust hold.","examples":[{"sentence":"The construction crew used driftbolts to secure the steel beams to the concrete foundation.","translation":"建設作業員は、鋼鉄製の梁をコンクリートの基礎に固定するためにドリフトボルトを使用した。"},{"sentence":"Driftbolts are often preferred over standard anchor bolts in applications requiring high pull-out strength.","translation":"ドリフトボルトは、高い引き抜き強度が必要な用途で、標準的なアンカーボルトよりも好まれることが多い。"}],"collocations":["install driftbolts (ドリフトボルトを設置する)","tighten driftbolts (ドリフトボルトを締める)","secure with driftbolts (ドリフトボルトで固定する)","concrete driftbolt (コンクリート用ドリフトボルト)","steel driftbolt (鋼製ドリフトボルト)"],"synonyms":["anchor bolt","expansion bolt","sleeve anchor","wedge anchor"],"antonyms":[]}],"etymology":{"value":"「drift」（ドリフトピン）と「bolt」（ボルト）の組み合わせ。ドリフトピンを使用してボルトを拡張する構造に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdrɪftboʊlt/","syllables":"drift-bolt"},"inflection":{"noun_plural":"driftbolts"},"usage_notes":{"explanation":"「**Driftbolt**」は、建設業界で特定の種類のアンカーボルトを指す専門用語です。一般的な会話ではあまり使われません。主に技術文書、建設関連の仕様書、または建設作業員間のコミュニケーションで使用されます。ドリフトピンを使用する拡張機構を持つアンカーボルトを指す場合にのみ使用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a driftbolt to hang a picture on the wall.","correct":"✓ I used a screw/nail to hang a picture on the wall.","note":"ドリフトボルトは、重いものをコンクリートや石材に固定するために使用されるため、通常、壁に絵を飾るような軽い用途には適していません。"},{"incorrect":"✗ Driftbolts are the same as regular bolts.","correct":"✓ Driftbolts are a type of anchor bolt that uses a drift pin for expansion.","note":"ドリフトボルトは、拡張機構を持つ特殊なアンカーボルトであり、通常のボルトとは異なります。"}],"priority":"★★☆"},"related_words":{"derivatives":["drift pin (ドリフトピン)","anchor (アンカー)","bolt (ボルト)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 建設業界の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Driftbolt**」は、建設業界で使用される特殊なアンカーボルトを指す専門用語です。この単語は、建設プロジェクトの仕様書、技術文書、または建設作業員間のコミュニケーションで見られる可能性が高いです。一般的な読者には馴染みが薄く、建設関連の専門知識を持つ人にのみ理解されるでしょう。"},"example_sentences":[{"sentence":"The engineer specified the use of driftbolts for anchoring the bridge supports.","translation":"エンジニアは、橋の支柱を固定するためにドリフトボルトの使用を指定した。","type":"noun","meaning_category":"アンカーボルト"},{"sentence":"The installer hammered the drift pin into the driftbolt to expand it within the concrete.","translation":"設置者は、ドリフトボルトをコンクリート内で拡張するために、ドリフトピンを打ち込んだ。","type":"noun","meaning_category":"アンカーボルト"}]}