{"word":"attainting","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(archaic) to achieve (something); to reach (a goal).","english_definition":"(archaic) To achieve or accomplish something; to reach a goal or objective.","examples":[{"sentence":"He aimed at attaining the highest position in the company.","translation":"彼は会社で最高の地位を達成することを目指した。"},{"sentence":"She was determined to attain her dreams, no matter the cost.","translation":"彼女はどんな犠牲を払っても夢を達成しようと決意していた。"}],"collocations":["attain a goal","attain success","attain a position","attain knowledge"],"synonyms":["achieve","accomplish","reach","obtain","acquire","secure"],"antonyms":["fail","lose","miss"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(archaic, law) to condemn by attainder; to deprive of civil rights.","english_definition":"(archaic, law) To pronounce attainder on; to deprive of civil rights and property as a consequence of treason or felony.","examples":[{"sentence":"The king sought to attainting his enemies through legal means.","translation":"王は法的な手段を通じて敵を権利剥奪しようとした。"},{"sentence":"The act of attainting stripped him of his titles and lands.","translation":"権利剥奪の行為は彼から称号と土地を奪った。"}],"collocations":["attaint a person","attaint of treason","act of attainting"],"synonyms":["condemn","disgrace","dishonor","stigmatize"],"antonyms":["acquit","exonerate","vindicate"]}],"etymology":{"value":"From the Anglo-Norman French word 'atteindre,' meaning 'to touch, reach, or seize.' Ultimately from the Latin 'attingere,' meaning 'to touch, reach, or attain.' The legal sense derives from the idea of 'touching' or 'affecting' someone with infamy or legal disability.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈteɪntɪŋ/","syllables":"at-tain-ting"},"inflection":{"verb_forms":{"present_simple":["attaint","attaints"],"past_simple":"attainted","past_participle":"attainted","present_participle":"attainting"}},"usage_notes":{"explanation":"'Attainting' is the present participle and gerund form of the verb 'attaint.' The word has two primary meanings, one related to achievement and the other to legal condemnation. The achievement-related meaning is now quite archaic. The legal meaning refers to the act of pronouncing attainder, a now-obsolete legal process where a person was stripped of their civil rights and property, typically as a consequence of treason or felony.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is attainting her degree next year.","correct":"✓ She is attaining her degree next year.","note":"'Attainting' (with 't') is specifically related to the archaic legal term. For achieving something, use 'attaining' (without 't')."},{"incorrect":"✗ The company was attainting success.","correct":"✓ The company was attaining success.","note":"Again, for the general sense of achieving success, use 'attaining' (without 't')."}],"priority":"★★☆"},"related_words":{"derivatives":["attaint (noun): the state of being attainted; the legal consequence of attainder.","attainder (noun): the extinction of civil rights and capacities which takes place when a person who has committed treason or felony is sentenced to death or outlawed."],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Attainting' is a rare and archaic word, primarily used in historical or legal contexts. It refers to the act of achieving something (now archaic) or, more commonly, to the legal process of 'attainder,' where a person is stripped of their civil rights and property due to a serious crime like treason. Because of its specialized and historical usage, it is not commonly encountered in modern English. Understanding this word requires familiarity with historical legal concepts. It is important to distinguish it from the more common word 'attaining,' which means achieving or reaching a goal.","priority":"★☆☆"},"example_sentences":[{"sentence":"The king was accused of attainting his political rivals to consolidate power.","translation":"王は権力を固めるために政敵を権利剥奪したと非難された。","type":"verb","meaning_category":"legal condemnation"},{"sentence":"(Archaic) He was focused on attainting wisdom through years of study.","translation":"(古語) 彼は長年の研究を通して知恵を達成することに集中していた。","type":"verb","meaning_category":"achievement (archaic)"}]}