{"word":"cross-reactive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"交差反応性の、交差反応を示す","english_definition":"Capable of reacting with more than one antigen or antibody due to structural similarities.","examples":[{"sentence":"The antibody is cross-reactive with a similar protein from another species.","translation":"その抗体は、別の種の同様のタンパク質と交差反応性がある。"},{"sentence":"Cross-reactive antibodies can sometimes lead to false positive results in diagnostic tests.","translation":"交差反応性抗体は、診断検査で偽陽性の結果をもたらすことがある。"}],"collocations":["cross-reactive antibody","cross-reactive antigen","cross-reactive T cell","exhibit cross-reactivity","demonstrate cross-reactivity"],"synonyms":["cross-reacting","cross-react","reacting non-specifically"],"antonyms":["specific","non-reactive"]},{"part_of_speech":"adjective","definition":"（免疫学において）ある抗体またはT細胞が、本来の標的抗原に加えて、構造が類似した別の抗原にも反応する性質を持つこと。","english_definition":"(In immunology) Having the property of an antibody or T cell to react with an antigen that is structurally similar to the antigen that originally induced its production.","examples":[{"sentence":"Due to cross-reactivity, some individuals vaccinated against one virus may have partial immunity to related viruses.","translation":"交差反応性により、あるウイルスに対するワクチン接種を受けた一部の人は、関連するウイルスに対して部分的な免疫を持つ可能性がある。"},{"sentence":"Understanding cross-reactivity is important in vaccine development and diagnostic testing.","translation":"交差反応性を理解することは、ワクチン開発と診断検査において重要である。"}],"collocations":["cross-reactivity","cross-reaction","immune response","vaccine development","diagnostic testing"],"synonyms":["antigenic similarity","epitope sharing"],"antonyms":["antigen specificity","immune tolerance"]}],"etymology":{"value":"Derived from 'cross-' (indicating interaction or intersection) and 'reactive' (indicating the ability to react). The term describes the phenomenon where a substance reacts with multiple, similar targets.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrɒs.riˈæktɪv/","syllables":"cross-re-ac-tive"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more cross-reactive' and 'most cross-reactive', respectively."},"usage_notes":{"explanation":"'Cross-reactive' is primarily used in the context of immunology and biochemistry to describe the ability of an antibody, T cell, or other immune component to react with multiple antigens due to similarities in their structure. This can be beneficial, providing broader immunity, or detrimental, leading to autoimmune reactions or inaccurate test results. The term emphasizes the non-specific nature of the reaction, as it extends beyond the originally targeted antigen.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The drug is cross-reactive with the disease.","correct":"✓ The drug interacts with the disease.","note":"'Cross-reactive' typically applies to antibodies, antigens, or other immune components, not drugs. Use 'interacts' or another appropriate verb for drug interactions."},{"incorrect":"✗ The cross-reactive is high in this sample.","correct":"✓ The cross-reactivity is high in this sample.","note":"'Cross-reactive' is an adjective. The noun form, 'cross-reactivity,' should be used when referring to the property itself."}],"priority":"★★☆"},"related_words":{"derivatives":["cross-reactivity (noun)","cross-reaction (noun)","cross-react (verb)"],"phrasal_verbs":[],"related_terms":["antigen","antibody","epitope","immune response","immunology","specificity","affinity"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'cross-reactive' is a specialized term primarily used in immunology and related fields. It describes the ability of an antibody or other immune component to react with multiple antigens due to structural similarities. Understanding this term requires a background in immunology and biochemistry. The concept is crucial in understanding vaccine efficacy, diagnostic test accuracy, and autoimmune disorders. It is not commonly used in general conversation."},"example_sentences":[{"sentence":"The monoclonal antibody showed significant cross-reactive binding to several related proteins.","translation":"そのモノクローナル抗体は、いくつかの関連タンパク質に対して有意な交差反応性結合を示した。","type":"adjective","meaning_category":"Immunology"},{"sentence":"This cross-reactive response may provide broader protection against different strains of the virus.","translation":"この交差反応性応答は、ウイルスの異なる株に対するより広範な防御を提供する可能性がある。","type":"adjective","meaning_category":"Immunology"},{"sentence":"The researchers investigated the extent of cross-reactivity between the two antigens.","translation":"研究者たちは、2つの抗原間の交差反応性の程度を調査した。","type":"noun (cross-reactivity)","meaning_category":"Immunology"}]}