{"word":"scatologies","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"糞便学、排泄物に関する研究","english_definition":"The study of excrement, especially in medicine or zoology.","examples":[{"sentence":"The scientist specialized in scatologies to understand the diet of wild animals.","translation":"その科学者は野生動物の食性を理解するために、糞便学を専門としていた。"},{"sentence":"Scatologies can provide valuable insights into the health of an ecosystem.","translation":"糞便学は生態系の健康に関する貴重な洞察を提供することができる。"}],"collocations":["medical scatologies (医学糞便学)","zoological scatologies (動物学糞便学)","analyze scatologies (糞便学を分析する)"],"synonyms":["coprology","excrementology"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'skatos' (dung) and 'logia' (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌskæˈtɒlədʒiz/","syllables":"scat-o-lo-gies"},"inflection":{"noun_plural":"scatologies"},"usage_notes":{"explanation":"'Scatologies' refers to the scientific study of feces. It is used in various fields, including medicine, zoology, and ecology, to gather information about diet, health, and environmental conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is interested in scatology as a hobby.","correct":"✓ He is interested in scatology as a scientific field.","note":"Scatology is a scientific study, not typically a hobby. Using it in a hobby context might be seen as odd."}],"priority":"★☆☆"},"related_words":{"derivatives":["scatological (adjective: relating to scatology)","scatologist (noun: a person who studies scatology)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Scatologies' is a technical term used in scientific contexts, particularly in medicine, zoology, and ecology. It refers to the study of excrement to gain insights into various aspects of health, diet, and environmental conditions. Due to its specialized nature, it is not commonly used in everyday language."},"example_sentences":[{"sentence":"The researchers used scatologies to determine the presence of parasites in the bear population.","translation":"研究者たちは、クマの個体群における寄生虫の存在を特定するために糞便学を用いた。","type":"scientific","meaning_category":"study of excrement"},{"sentence":"Through scatologies, they were able to analyze the dietary habits of the endangered species.","translation":"糞便学を通して、彼らは絶滅危惧種の食生活を分析することができた。","type":"scientific","meaning_category":"study of excrement"}]}