{"word":"Gauzewing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ウスバカゲロウ","english_definition":"Any insect of the order Neuroptera, characterized by delicate, net-veined wings.","examples":[{"sentence":"The gauzewing flew gracefully around the garden.","translation":"ウスバカゲロウが庭の周りを優雅に飛んだ。"},{"sentence":"Gauzewings are beneficial insects, preying on aphids and other pests.","translation":"ウスバカゲロウは、アブラムシなどの害虫を捕食する有益な昆虫である。"}],"collocations":["green gauzewing","brown gauzewing","larval gauzewing"],"synonyms":["lacewing","neuropteran"],"antonyms":[]}],"etymology":{"value":"From 'gauze' (referring to the delicate, net-like wings) + 'wing'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡɔːzwɪŋ","syllables":"gauze-wing"},"inflection":{"noun_plural":"Gauzewings"},"usage_notes":{"explanation":"'Gauzewing' is a common name for insects in the order Neuroptera, particularly those with delicate, net-veined wings. They are often green or brown and are known for their beneficial role in gardens and agriculture as predators of aphids and other pests.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a gauze wing in my garden.","correct":"✓ I saw a gauzewing in my garden.","note":"'Gauzewing' is one word, not two separate words. 'Gauze wing' would refer to a wing made of gauze material, which is different."}],"priority":"★★☆"},"related_words":{"derivatives":["Neuroptera (order)","lacewing (synonym)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gauzewing' is a relatively uncommon word referring to a specific type of insect. Understanding the term requires some familiarity with insect classification and natural history. It's more likely to be encountered in scientific or nature-related contexts."},"example_sentences":[{"sentence":"The gardener was happy to see the gauzewing larvae, as they would help control the aphid population.","translation":"庭師はウスバカゲロウの幼虫を見て喜んだ。なぜなら、彼らはアブラムシの個体数を抑制するのに役立つからだ。","type":"noun","meaning_category":"insect"},{"sentence":"Many species of gauzewing are nocturnal.","translation":"多くの種類のウスバカゲロウは夜行性である。","type":"noun","meaning_category":"insect"}]}