{"word":"thumbpiece","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ドアなどの)親指で押す金具、押しボタン","english_definition":"A small lever or button on a door handle or other mechanism that is pressed with the thumb to operate it.","examples":[{"sentence":"The thumbpiece on the door handle was loose.","translation":"ドアハンドルの押しボタンが緩んでいた。"},{"sentence":"She pressed the thumbpiece to open the gate.","translation":"彼女は門を開けるために押しボタンを押した。"}],"collocations":["door thumbpiece","gate thumbpiece"],"synonyms":["button","lever","catch","latch"],"antonyms":[]}],"etymology":{"value":"'Thumb' + 'piece'. Literally, a piece that is operated by the thumb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈθʌmpis/","syllables":"thumb-piece"},"inflection":{"noun_plural":"thumbpieces"},"usage_notes":{"explanation":"A thumbpiece is typically a small, often rectangular or oval-shaped, component found on door handles or similar mechanisms. It is designed to be easily pressed or manipulated by the thumb to activate the latch or locking mechanism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used my finger to press the thumbpiece.","correct":"✓ I used my thumb to press the thumbpiece.","note":"The thumbpiece is designed to be operated by the thumb, so specify the thumb is used."}],"priority":"★☆☆"},"related_words":{"derivatives":["thumb (noun)","piece (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'thumbpiece' is a relatively uncommon word that refers to a specific part of a door or gate mechanism. It is most likely to be encountered in technical descriptions or when discussing hardware. Understanding the word requires a familiarity with the components of doors and gates.","priority":"★☆☆"},"example_sentences":[{"sentence":"The antique door had an ornate brass thumbpiece.","translation":"そのアンティークのドアには、華やかな真鍮製の押しボタンが付いていた。","type":"noun","meaning_category":"hardware"},{"sentence":"He jiggled the thumbpiece, but the door remained locked.","translation":"彼は押しボタンをガチャガチャいじったが、ドアはロックされたままだった。","type":"noun","meaning_category":"hardware"}]}