{"word":"Mesosoma","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"昆虫の体節における中体節。胸部と腹部の間の部分を指すことが多い。ハチやアリなどの腹部が細くなっている昆虫において、特に区別しやすい。","english_definition":"The middle section of the body of an insect, specifically the thorax plus the first abdominal segment. It is particularly distinct in insects such as bees and ants, where the abdomen is constricted.","examples":[{"sentence":"The mesosoma of the ant is connected to the metasoma by a narrow petiole.","translation":"そのアリの中体節は、細い腹柄によって後体節と繋がっている。"},{"sentence":"The shape and structure of the mesosoma are important characteristics for identifying different species of wasps.","translation":"中体節の形状と構造は、様々なハチの種を識別するための重要な特徴である。"}],"collocations":["mesosoma structure","mesosoma morphology","mesosoma length","mesosoma width"],"synonyms":["thorax","alitrunk"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「mesos」（中間の）と「soma」（体）に由来する。","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɛzoʊˈsoʊmə/","syllables":"Me-so-so-ma"},"inflection":{"noun_plural":"mesosomas or mesosomata"},"usage_notes":{"explanation":"「Mesosoma」は、昆虫学の専門用語であり、一般的には使われません。昆虫の体の構造を詳細に記述する際に用いられます。特にハチやアリなど、腹部がくびれている昆虫において、胸部と腹部の間の部分を指す言葉として重要です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mesosoma is the head of the insect.","correct":"✓ The mesosoma is the middle part of the insect's body, between the head and the abdomen.","note":"中体節は頭部ではなく、頭部と腹部の間の部分です。"},{"incorrect":"✗ Mesosoma is the same as abdomen.","correct":"✓ Mesosoma is not the same as the abdomen; it's the thorax plus the first abdominal segment.","note":"中体節は腹部（後体節）とは異なります。胸部と最初の腹部節を合わせたものです。"}],"priority":"★☆☆"},"related_words":{"derivatives":["mesosomal (形容詞: 中体節の)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Mesosoma」は、昆虫学において、昆虫の体の中間部分を指す専門用語です。特にハチやアリなどの特定の昆虫において、胸部と腹部の間の領域を指します。この用語は、昆虫の形態学的特徴を正確に記述するために使用され、一般の人が日常的に使用する言葉ではありません。昆虫学の研究や専門的な文脈で用いられることが多いです。"},"example_sentences":[{"sentence":"The smooth and shiny mesosoma is characteristic of this species of ant.","translation":"滑らかで光沢のある中体節は、この種のアリの特徴である。","type":"noun","meaning_category":"昆虫学"},{"sentence":"The researchers measured the length of the mesosoma to analyze the variation within the wasp population.","translation":"研究者たちは、ハチの個体群内の変動を分析するために、中体節の長さを測定した。","type":"noun","meaning_category":"昆虫学"}]}