{"word":"Internalities","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(経済学)内部性：経済活動が、その活動の主体内部に影響を及ぼすこと。外部性の反対。","english_definition":"(Economics) The effects of an economic activity that are confined within the entity undertaking the activity; the opposite of externalities.","examples":[{"sentence":"The company's investment in employee training created positive internalities, improving productivity and morale.","translation":"その会社の従業員研修への投資は、生産性と士気を向上させるというプラスの内部性を生み出した。"},{"sentence":"The decision to upgrade the factory equipment resulted in cost savings and increased efficiency, demonstrating positive internalities.","translation":"工場設備のアップグレードの決定は、コスト削減と効率向上をもたらし、プラスの内部性を示した。"}],"collocations":["positive internalities (プラスの内部性)","negative internalities (マイナスの内部性)","create internalities (内部性を生み出す)","internalize internalities (内部性を内部化する)"],"synonyms":["internal benefits","internal costs"],"antonyms":["externalities"]},{"part_of_speech":"noun","definition":"(心理学、社会学)個人の内面的な状態、感情、思考、信念など。","english_definition":"(Psychology, Sociology) The internal states of an individual, such as emotions, thoughts, and beliefs.","examples":[{"sentence":"Understanding the internalities of the patient is crucial for effective therapy.","translation":"効果的な治療のためには、患者の内面性を理解することが重要である。"},{"sentence":"The research explores the relationship between social media use and the internalities of adolescents.","translation":"この研究は、ソーシャルメディアの利用と青年の内面性の関係を探求している。"}],"collocations":["explore internalities (内面性を探求する)","understand internalities (内面性を理解する)","internalities and behavior (内面性と行動)"],"synonyms":["internal states","inner feelings","thoughts","beliefs"],"antonyms":["externalities","external factors"]}],"etymology":{"value":"Derived from 'internal' (existing or situated within) with the suffix '-ities' (used to form nouns denoting qualities, states, or conditions). The term is formed in analogy to 'externalities'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌtɜːrˈnælɪtiz/","syllables":"in-ter-nal-i-ties"},"inflection":{"noun_plural":"internalities"},"usage_notes":{"explanation":"'Internalities' is a relatively uncommon term, primarily used in economics to describe effects that remain within the entity undertaking an activity, in contrast to externalities, which affect third parties. It can also refer to the internal psychological or emotional states of an individual, though this usage is less frequent. The term is often used in academic or specialized contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company ignored the internalities of their actions on the environment.","correct":"✓ The company ignored the externalities of their actions on the environment.","note":"'Externalities' (effects on third parties) is more commonly discussed in the context of environmental impact than 'internalities' (effects within the company)."},{"incorrect":"✗ The therapist focused on the patient's externalities.","correct":"✓ The therapist focused on the patient's internalities.","note":"In a therapeutic context, focusing on 'internalities' (internal states) is more relevant than focusing on 'externalities' (external factors)."}],"priority":"★★☆"},"related_words":{"derivatives":["internal","internalize"],"related_terms":["externalities","internal factor","internal state"]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'internalities' is a specialized term primarily used in economics and sometimes in psychology or sociology. In economics, it refers to the effects of an economic activity that are confined within the entity undertaking the activity, contrasting with 'externalities' which affect external parties. In psychology or sociology, it can refer to the internal states of an individual, such as thoughts and feelings. Due to its specialized nature, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The firm's investment in research and development generated positive internalities by improving its technological capabilities.","translation":"その企業の研究開発への投資は、技術力を向上させることでプラスの内部性を生み出した。","type":"noun","meaning_category":"Economics"},{"sentence":"The therapist aimed to help the patient understand and manage their internalities, such as anxiety and depression.","translation":"セラピストは、患者が不安や抑うつなどの内面性を理解し、管理するのを助けることを目指した。","type":"noun","meaning_category":"Psychology"}]}