{"word":"semipiousness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"中途半端な信心深さ、見せかけだけの信心深さ","english_definition":"The quality or state of being only partially or superficially pious; a pretense of piety.","examples":[{"sentence":"His semipiousness was evident in his ostentatious displays of charity, which were clearly motivated by a desire for recognition rather than genuine compassion.","translation":"彼の見せかけだけの信心深さは、明らかに真の同情心ではなく、認知されたいという欲求に動機づけられた、これ見よがしの慈善活動に明らかだった。"},{"sentence":"The politician's semipiousness was exposed when his actions contradicted his supposedly deeply held religious beliefs.","translation":"政治家の見せかけだけの信心深さは、彼の行動が、深く信じているはずの宗教的信念と矛盾したときに暴露された。"}],"collocations":["display of semipiousness","act of semipiousness","mask of semipiousness"],"synonyms":["hypocrisy","sanctimony","affected piety","superficial piety","insincerity"],"antonyms":["sincerity","genuine piety","true devotion","authenticity"]}],"etymology":{"value":"The word is formed by combining the prefix 'semi-' (meaning 'partly' or 'half') with the noun 'piousness' (meaning 'the quality of being devoutly religious').","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmiˈpaɪəs.nəs/","syllables":"se-mi-pi-ous-ness"},"inflection":{"noun_plural":"semipiousnesses (rarely used)"},"usage_notes":{"explanation":"'Semipiousness' is used to describe a state where someone appears to be religious or devout but is not genuinely so. It often implies that the person is acting pious for personal gain or to impress others. The term carries a negative connotation, suggesting insincerity and hypocrisy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She showed great semipiousness by attending church every day.","correct":"✓ She showed great piety by attending church every day.","note":"If the person's devotion is genuine, use 'piety' instead of 'semipiousness'."},{"incorrect":"✗ The semipiousness of the situation made everyone uncomfortable.","correct":"✓ The hypocrisy of the situation made everyone uncomfortable.","note":"If you want to emphasize the hypocrisy rather than the superficial piety, use 'hypocrisy'."}],"priority":"★★☆"},"related_words":{"derivatives":["semipious (adjective)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'semipiousness' is a relatively rare and sophisticated term used to describe a superficial or insincere form of religious devotion. It is most often encountered in academic or literary contexts when discussing themes of hypocrisy, religious pretense, or the contrast between outward appearances and inner beliefs. Understanding this word requires a strong grasp of both the prefix 'semi-' and the concept of 'piousness,' as well as the ability to recognize subtle nuances of meaning and intent. It is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The televangelist's lavish lifestyle stood in stark contrast to his public displays of semipiousness.","translation":"テレビ伝道師の贅沢なライフスタイルは、彼の公の場での見せかけだけの信心深さとは対照的だった。","type":"general","meaning_category":"insincere piety"},{"sentence":"The novel satirizes the semipiousness of the Victorian upper class, who often used religion to justify their social standing.","translation":"その小説は、しばしば宗教を自分たちの社会的地位を正当化するために利用したヴィクトリア朝の上流階級の見せかけだけの信心深さを風刺している。","type":"literary","meaning_category":"hypocrisy"},{"sentence":"Her semipiousness was a carefully constructed facade, designed to conceal her true ambitions.","translation":"彼女の見せかけだけの信心深さは、彼女の真の野心を隠すために注意深く構築された見せかけだった。","type":"psychological","meaning_category":"pretense"}]}