{"word":"console-oriented","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"コンソール指向の、コンソールを重視した","english_definition":"Designed or optimized for use with a console, especially a command-line interface or a gaming console.","examples":[{"sentence":"The application is console-oriented, so it doesn't have a graphical user interface.","translation":"そのアプリケーションはコンソール指向なので、グラフィカルユーザーインターフェースを持っていません。"},{"sentence":"Many retro games are console-oriented and require specific controllers to play.","translation":"多くのレトロゲームはコンソール指向であり、プレイするには特定のコントローラーが必要です。"}],"collocations":["console-oriented application","console-oriented game","console-oriented design"],"synonyms":["command-line-based","terminal-based"],"antonyms":["GUI-oriented","graphical"],"notes":"This term is often used in the context of software development and gaming. It implies that the user interacts with the system primarily through text commands or a console interface, rather than through graphical elements."}],"etymology":{"value":"A compound word formed by combining 'console' (referring to a command-line interface or gaming console) and 'oriented' (directed or focused towards).","priority":"☆☆☆"},"pronunciation":{"ipa":"/kənˈsoʊl ˌɔːriˌɛntɪd/","syllables":"con-sole-o-ri-en-ted"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"'Console-oriented' describes something designed primarily for use with a text-based console or a gaming console. It emphasizes a focus on command-line interaction or gaming console hardware and software.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The console-oriented is very good.","correct":"✓ The console-oriented design is very good.","note":"'Console-oriented' is an adjective and needs to modify a noun."}],"priority":"☆☆☆"},"related_words":{"derivatives":["console","oriented"],"related_terms":["command-line interface (CLI)","terminal","gaming console","GUI-oriented"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Console-oriented' is a technical term describing something designed for use with a command-line interface or gaming console. It is commonly used in software development and gaming contexts. Understanding requires familiarity with command-line interfaces and gaming consoles."},"example_sentences":[{"sentence":"The developers created a console-oriented tool for system administration.","translation":"開発者はシステム管理用のコンソール指向のツールを作成しました。","type":"general","meaning_category":"software development"},{"sentence":"Retro gamers often prefer console-oriented games for their simplicity and direct control.","translation":"レトロゲーマーは、そのシンプルさと直接的な操作性から、コンソール指向のゲームを好むことが多いです。","type":"general","meaning_category":"gaming"}]}