{"word":"Cahenslyism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カヘンズリー主義：移民は出身国の文化や言語を維持すべきであるという考え。特に、カトリック教徒の移民がアメリカ合衆国などの新天地で、出身国の文化や言語を維持し、独自のコミュニティを形成することを支持する思想。","english_definition":"The belief that immigrants should maintain their native culture and language in their new country. Specifically, it refers to the idea that Catholic immigrants should maintain their native culture, language, and identity in countries like the United States, forming distinct ethnic communities.","examples":[{"sentence":"Cahenslyism was a controversial topic in the late 19th and early 20th centuries as the American Catholic Church sought to assimilate immigrants.","translation":"カヘンズリー主義は、アメリカのカトリック教会が移民の同化を模索していた19世紀後半から20世紀初頭にかけて、議論の的となる話題だった。"},{"sentence":"Critics of Cahenslyism argued that it hindered the integration of immigrants into American society.","translation":"カヘンズリー主義の批判者たちは、それが移民のアメリカ社会への統合を妨げていると主張した。"}],"collocations":["oppose Cahenslyism (カヘンズリー主義に反対する)","support Cahenslyism (カヘンズリー主義を支持する)","the debate over Cahenslyism (カヘンズリー主義をめぐる議論)"],"synonyms":["ethnic separatism","cultural preservation","cultural retention"],"antonyms":["assimilation","integration","Americanization"]}],"etymology":{"value":"ドイツの政治家ペーター・パウル・カヘンズリー（Peter Paul Cahensly, 1838-1923）の名前に由来する。彼は、移民の保護と支援を目的とした「聖ラファエル協会」を設立し、移民が新しい国で信仰と文化を守ることを提唱した。","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɑːənzliɪzəm/","syllables":"Ca-hens-ly-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"「**Cahenslyism**」は、歴史的な文脈で使用されることが多い専門用語です。主に19世紀後半から20世紀初頭にかけてのアメリカ合衆国における移民問題に関連して議論されました。現代では、多文化主義や文化的多様性の議論の中で言及されることがあります。この用語は、移民の文化保持の権利と、社会への統合の必要性という、相反する価値観の間の緊張関係を示唆しています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Cahenslyism is a type of religious practice.","correct":"✓ Cahenslyism is a belief about how immigrants should integrate into a new society.","note":"カヘンズリー主義は宗教的な慣習ではなく、移民がどのように新しい社会に統合されるべきかについての信念です。"},{"incorrect":"✗ Cahenslyism is about forcing immigrants to abandon their culture.","correct":"✓ Cahenslyism is about encouraging immigrants to maintain their culture.","note":"カヘンズリー主義は、移民に文化を放棄させることではなく、文化を維持することを奨励するものです。"}],"priority":"★★☆"},"related_words":{"derivatives":["Cahenslyist (カヘンズリー主義者)"],"related_concepts":["cultural pluralism","multiculturalism","nativism","xenophobia","immigration policy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (歴史、社会学などの専門分野)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Cahenslyism**」は、移民が新しい国で自分の文化や言語を維持すべきだという考え方を指す、専門的な歴史用語です。これは、19世紀後半から20世紀初頭にかけて、特にカトリックの移民がアメリカ合衆国のような国で自分たちの文化を守るべきかどうかという議論に関連して使われました。この言葉は、ドイツの政治家ペーター・パウル・カヘンズリーに由来し、移民の文化保持を支持する彼の活動を反映しています。ただし、この用語は、移民の統合を妨げると批判されることもありました。歴史や社会学の文脈で使われることが多く、日常会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The rise of nativism in the United States led to increased opposition to Cahenslyism.","translation":"アメリカにおける排外主義の高まりは、カヘンズリー主義への反対を強めることにつながった。","type":"general","meaning_category":"歴史的背景"},{"sentence":"Some historians argue that Cahenslyism was a response to the challenges faced by Catholic immigrants in a predominantly Protestant country.","translation":"一部の歴史家は、カヘンズリー主義は、主にプロテスタントの国でカトリックの移民が直面した課題への対応だったと主張している。","type":"general","meaning_category":"歴史的背景"},{"sentence":"The debate over Cahenslyism highlighted the tension between cultural preservation and assimilation.","translation":"カヘンズリー主義をめぐる議論は、文化の維持と同化の間の緊張を浮き彫りにした。","type":"general","meaning_category":"社会学的考察"}]}