{"word":"Zervanism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"ゼルヴァン教：ゾロアスター教の一異端で、至高の神アフラ・マズダーと悪神アンラ・マンユの起源を、時間（ゼルヴァン）という原理に求める教え。","english_definition":"A heterodox branch of Zoroastrianism that considers Time (Zurvan) to be the first principle from which the supreme god Ahura Mazda and the evil spirit Angra Mainyu originated.","examples":[{"sentence":"Zervanism posited Zurvan as the uncreated creator of both good and evil.","translation":"ゼルヴァン教は、善と悪の両方の創造主として、創造されざる存在であるゼルヴァンを想定した。"},{"sentence":"In Zervanism, the duality of Ahura Mazda and Angra Mainyu is seen as a consequence of Zurvan's desire for offspring.","translation":"ゼルヴァン教では、アフラ・マズダーとアンラ・マンユの二元性は、ゼルヴァンの子孫を求める願望の結果と見なされる。"}],"collocations":["Zervanite cosmology (ゼルヴァン教の宇宙論)","Zervanite myth (ゼルヴァン教の神話)","late Zervanism (後期ゼルヴァン教)"],"synonyms":["Zurvanism"],"antonyms":[]}],"etymology":{"value":"Derived from 'Zurvan', the name of the deity representing Time in this religious system, with the suffix '-ism' indicating a system of belief or practice.","priority":"★★☆"},"pronunciation":{"ipa":"/zərˈvɑːnɪzəm/","syllables":"Zer-van-ism"},"inflection":{"noun_plural":"Zervanisms"},"usage_notes":{"explanation":"Zervanism is a specific, and now largely historical, theological doctrine within Zoroastrianism. It is less commonly encountered than mainstream Zoroastrianism. The term is primarily used in academic and historical contexts when discussing ancient religious beliefs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Zervanism is a type of Christianity.","correct":"✓ Zervanism is a branch of Zoroastrianism.","note":"Zervanism is related to Zoroastrianism, not Christianity."}],"priority":"★☆☆"},"related_words":{"derivatives":["Zoroastrianism","Zurvan","Ahura Mazda","Angra Mainyu"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Zervanism' is a term primarily used in academic discussions of religious history and comparative religion. Understanding requires familiarity with Zoroastrianism and ancient religious concepts. Due to its specialized nature, it's rarely encountered outside of scholarly contexts."},"example_sentences":[{"sentence":"Scholars debate the exact nature and influence of Zervanism on mainstream Zoroastrian thought.","translation":"学者たちは、主流のゾロアスター教の思想に対するゼルヴァン教の正確な性質と影響について議論している。","type":"noun","meaning_category":"宗教・宗教学"},{"sentence":"Zervanism introduced a concept of Time as an ultimate, impersonal force.","translation":"ゼルヴァン教は、時間を究極の、人格を持たない力として概念化した。","type":"noun","meaning_category":"宗教・宗教学"}]}