{"word":"ameboidism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アメーバ運動、アメーバ様運動","english_definition":"The ability of a cell to alter its shape and move by extending and retracting pseudopods.","examples":[{"sentence":"Ameboidism is essential for the movement of immune cells like macrophages.","translation":"アメーバ運動は、マクロファージのような免疫細胞の移動に不可欠です。"},{"sentence":"Cancer cells can exhibit ameboidism, allowing them to invade tissues more effectively.","translation":"癌細胞はアメーバ運動を示すことがあり、それによって組織への侵入がより効果的になります。"}],"collocations":["exhibit ameboidism","cellular ameboidism","cancer cell ameboidism"],"synonyms":["amoeboid movement","cellular locomotion","pseudopodial movement"],"antonyms":["immotility","lack of movement"]}],"etymology":{"value":"Derived from 'amoeba' (referring to the single-celled organism known for this type of movement) and '-ism' (denoting a process, condition, or characteristic).","priority":"★★☆"},"pronunciation":{"ipa":"/əˈmiːbɔɪdɪzəm/","syllables":"a-me-boid-ism"},"inflection":{"noun_plural":"ameboidisms"},"usage_notes":{"explanation":"'Ameboidism' specifically refers to the type of movement characterized by the formation of pseudopods, similar to how amoebas move. It's often used in biological and medical contexts to describe the movement of cells, especially immune cells and cancer cells.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bacteria showed ameboidism.","correct":"✓ The cell showed ameboidism.","note":"Ameboidism refers to the movement of eukaryotic cells, not prokaryotic cells like bacteria."},{"incorrect":"✗ Ameboidism is the same as ciliary movement.","correct":"✓ Ameboidism is different from ciliary movement.","note":"Ameboidism involves pseudopods, while ciliary movement involves cilia."}],"priority":"★★☆"},"related_words":{"derivatives":["ameboid (adjective: resembling an amoeba or its movement)","amoeba (noun: a single-celled organism that moves by means of pseudopods)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ameboidism' is a technical term used in biology and medicine to describe a specific type of cell movement. It refers to the ability of a cell to change its shape and move by extending and retracting pseudopods, similar to how amoebas move. This term is typically encountered in advanced scientific texts and discussions related to cell biology, immunology, and cancer research. Understanding this term requires a background in biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The chemotactic gradient guides the ameboidism of neutrophils towards the site of infection.","translation":"走化性勾配は、好中球のアメーバ運動を感染部位へと誘導します。","type":"noun","meaning_category":"アメーバ運動"},{"sentence":"In vitro studies have shown that certain drugs can inhibit the ameboidism of metastatic cancer cells.","translation":"in vitro研究では、特定の薬剤が転移性癌細胞のアメーバ運動を阻害できることが示されています。","type":"noun","meaning_category":"アメーバ運動"},{"sentence":"Ameboidism allows immune cells to efficiently patrol tissues and engulf pathogens.","translation":"アメーバ運動により、免疫細胞は効率的に組織を巡回し、病原体を貪食することができます。","type":"noun","meaning_category":"アメーバ運動"}]}