{"word":"F-shaped","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"F字型をした、F字状の","english_definition":"Having the shape of the letter F.","examples":[{"sentence":"The seating arrangement was F-shaped, with the speaker at the head.","translation":"座席配置はF字型で、講演者が先頭にいた。"},{"sentence":"The building has an F-shaped footprint.","translation":"その建物はF字型の平面形状をしている。"}],"collocations":["F-shaped pattern (F字型のパターン)","F-shaped layout (F字型のレイアウト)","F-shaped curve (F字型の曲線)"],"synonyms":["angular","bent","crooked"],"antonyms":["straight","linear"]},{"part_of_speech":"adjective","definition":"(ウェブサイトのコンテンツ閲覧において) ユーザーがF字型にコンテンツを読み進める","english_definition":"(in web content viewing) describing the way users scan content in a pattern resembling the letter F, typically reading the top lines fully and then scanning down the left side.","examples":[{"sentence":"Studies show that users often read web pages in an F-shaped pattern.","translation":"調査によると、ユーザーはウェブページをF字型のパターンで読むことが多いことがわかっています。"},{"sentence":"Design your website with the F-shaped reading pattern in mind.","translation":"F字型の読書パターンを念頭に置いてウェブサイトをデザインしてください。"}],"collocations":["F-shaped pattern (F字型のパターン)","F-shaped reading pattern (F字型の読書パターン)","F-shaped layout (F字型のレイアウト)"],"synonyms":["scanning pattern","reading behavior"],"antonyms":[]}],"etymology":{"value":"The term comes from the observation that eye-tracking studies often reveal that users scan web pages in a pattern that resembles the letter 'F'. They typically read the first few lines of text fully, then scan down the left side of the page, reading less and less of each line.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɛfˌʃeɪpt/","syllables":"F-shaped"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term \"F-shaped\" has two primary meanings. The first is simply describing something that is physically shaped like the letter 'F'. The second, more specialized meaning, refers to a pattern of reading or scanning web content. This pattern is characterized by users reading the top lines of content fully and then scanning vertically down the left side, reading less and less of each subsequent line. This behavior is often observed in eye-tracking studies and is important for web designers to consider when structuring content.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The F shaped building was very modern.","correct":"✓ The F-shaped building was very modern.","note":"The hyphen is important to connect the two words and make it clear that it's a compound adjective describing the shape."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["eye tracking","web design","usability","user experience (UX)","scanning pattern"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, specific to web design and usability contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"F-shaped\" is used in two main contexts. Literally, it describes something that has the shape of the letter 'F'. More commonly, it refers to a specific pattern of how people read or scan web pages. This pattern involves reading the first few lines fully and then scanning down the left side, reading less and less of each line. This concept is important in web design because understanding this pattern can help designers create more effective layouts that guide users' attention to the most important information. Knowing the context is key to understanding the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The river followed an **F-shaped** course through the valley.","translation":"川は谷をF字型のコースで流れていた。","type":"descriptive","meaning_category":"Shape"},{"sentence":"We optimized the website layout for the **F-shaped** reading pattern.","translation":"ウェブサイトのレイアウトをF字型の読書パターンに合わせて最適化した。","type":"technical","meaning_category":"Web Usability"}]}