{"word":"sepion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"イカの甲","english_definition":"The internal shell of a cuttlefish, composed primarily of aragonite.","examples":[{"sentence":"The sepion is lightweight and porous, allowing the cuttlefish to control its buoyancy.","translation":"イカの甲は軽量で多孔質であり、イカが浮力を制御することを可能にする。"}],"collocations":["cuttlefish sepion","sepion bone"],"synonyms":["cuttlebone"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'sepia', referring to the cuttlefish and its ink.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛpiən/","syllables":"se-pi-on"},"inflection":{"noun_plural":"sepions"},"usage_notes":{"explanation":"'Sepion' is a technical term primarily used in scientific or zoological contexts when discussing cuttlefish anatomy. The more common term for the same object is 'cuttlebone', which is widely recognized and used by pet owners as a calcium supplement for birds and reptiles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a sepion on the beach, it was very hard.","correct":"✓ I found a cuttlebone on the beach, it was very hard.","note":"'Cuttlebone' is the more common term for the general public."}],"priority":"★★☆"},"related_words":{"derivatives":["sepia (noun: a brownish pigment derived from cuttlefish ink)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sepion' is a relatively uncommon term, mainly used in scientific or specialized contexts related to marine biology. It refers specifically to the internal shell of a cuttlefish. For general communication, 'cuttlebone' is the preferred and more widely understood term. Understanding 'sepion' indicates a higher level of vocabulary related to zoology or marine science."},"example_sentences":[{"sentence":"The chemical composition of the sepion is primarily calcium carbonate.","translation":"イカの甲の化学組成は主に炭酸カルシウムである。","type":"noun","meaning_category":"Anatomy"},{"sentence":"Researchers analyzed the structure of the sepion to understand cuttlefish buoyancy mechanisms.","translation":"研究者たちはイカの浮力メカニズムを理解するために、イカの甲の構造を分析した。","type":"noun","meaning_category":"Zoology"}]}