{"word":"Patricianism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"貴族政治、門閥政治、特権階級主義","english_definition":"Government by an aristocracy or privileged upper class; advocacy of such a system.","examples":[{"sentence":"The French Revolution was a revolt against patricianism.","translation":"フランス革命は貴族政治に対する反乱だった。"},{"sentence":"Some critics argue that the current political system still exhibits elements of patricianism.","translation":"現在の政治システムは依然として貴族政治の要素を示していると批判する人もいる。"}],"collocations":["aristocratic rule","elite governance","oligarchy","rule by the few"],"synonyms":["aristocracy","oligarchy","elitism"],"antonyms":["democracy","egalitarianism","populism"]},{"part_of_speech":"noun","definition":"（歴史的な意味で）古代ローマの貴族階級の制度、またはその支持","english_definition":"The system or support of the ancient Roman patrician class.","examples":[{"sentence":"Patricianism in ancient Rome was based on birth and land ownership.","translation":"古代ローマの貴族政治は、出生と土地所有に基づいていた。"}],"collocations":["Roman aristocracy","ancient Roman elite"],"synonyms":["Roman patriciate"],"antonyms":["plebeianism"]}],"etymology":{"value":"Derived from 'patrician,' referring to members of the original citizen families of ancient Rome. The suffix '-ism' denotes a system, principle, or ideology.","priority":"★★★"},"pronunciation":{"ipa":"/pəˈtrɪʃənɪzəm/","syllables":"pa-tri-cian-i-sm"},"inflection":{"noun_plural":"patricianisms"},"usage_notes":{"explanation":"'Patricianism' generally refers to a system where a small, privileged group (often based on birth, wealth, or social status) holds power and influence. It can describe historical systems like that of ancient Rome, or be used more broadly to critique contemporary societies where power is concentrated in the hands of a few.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was a patricianism, so everyone was equal.","correct":"✓ The country was a democracy, so everyone was supposed to be equal.","note":"Patricianism implies inequality, while democracy aims for equality."}],"priority":"★★☆"},"related_words":{"derivatives":["patrician (noun, adjective)","patriciate (noun)"],"phrases":["patrician class","patrician family"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Patricianism' is a complex term referring to government or social systems dominated by a small, elite group. It's often used in historical contexts (like ancient Rome) or to critically analyze modern power structures. Understanding this word requires familiarity with political and social theory.","priority":"★★☆"},"example_sentences":[{"sentence":"The decline of patricianism in Rome led to social unrest.","translation":"ローマにおける貴族政治の衰退は、社会不安につながった。","type":"historical context","meaning_category":"貴族政治の衰退"},{"sentence":"Critics accused the government of promoting a new form of patricianism.","translation":"批評家たちは政府が新たな形の門閥政治を推進していると非難した。","type":"contemporary critique","meaning_category":"現代社会への批判"}]}