{"word":"caribed","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(rare, dialectal) simple past tense and past participle of caribe (to criticize, scold, or nag)","english_definition":"(rare, dialectal) past tense and past participle of caribe (to criticize, scold, or nag). This usage is very uncommon and may be specific to certain dialects or regions.","examples":[{"sentence":"He caribed her for being late.","translation":"彼は彼女が遅刻したことを叱った。"},{"sentence":"She was constantly caribed by her mother.","translation":"彼女はいつも母親に小言を言われていた。"}],"collocations":["caribe someone for something"],"synonyms":["scolded","criticized","nagged","reprimanded","chided"],"antonyms":["praised","complimented","commended"]}],"etymology":{"value":"Likely derived from the verb 'caribe', which is a dialectal or regional term meaning 'to criticize, scold, or nag'. The origin of 'caribe' itself is uncertain, possibly related to regional slang or jargon.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkærɪbd/","syllables":"car-ibed"},"inflection":{"verb_forms":{"present_simple":["caribe","caribes"],"past_simple":"caribed","past_participle":"caribed","present_participle":"caribing"}},"usage_notes":{"explanation":"'Caribed' is a very rare and likely dialectal or regional form. It is the past tense and past participle of the verb 'caribe', which means to criticize, scold, or nag. The verb 'caribe' itself is not commonly used in standard English. If you encounter 'caribed', it's likely in a specific regional context or in older texts where dialectal terms were more prevalent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I caribed the car.","correct":"✓ (Assuming 'caribe' means 'criticize') I caribed him for damaging the car.","note":"'Caribe' (if used) would typically take a person as the object and a reason for the criticism. It's not used to describe actions performed on objects like cars."}],"priority":"★☆☆"},"related_words":{"derivatives":["caribe (verb: to criticize, scold, or nag)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (extremely rare)","frequency_google_ngram":"Very low frequency - likely not found in standard corpora.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Caribed' is a highly uncommon word, primarily found in specific dialects or regional contexts. It represents the past tense and past participle of 'caribe,' a verb meaning 'to criticize, scold, or nag.' Due to its rarity, it's unlikely to be encountered in standard English usage, and understanding its meaning requires familiarity with the regional or dialectal context in which it might appear. Its usage is so infrequent that it's not part of common English vocabulary. Therefore, it is important to confirm the context before using it. "},"example_sentences":[{"sentence":"Grandma caribed him for tracking mud into the house.","translation":"おばあちゃんは彼が家に泥を持ち込んだことを叱った。","type":"verb (past simple)","meaning_category":"scolded"},{"sentence":"She felt caribed by her teacher for not completing the assignment.","translation":"彼女は宿題を終えなかったことで先生に叱られたと感じた。","type":"verb (past participle)","meaning_category":"criticized"}]}