{"word":"liturgistical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"典礼の、典礼に関する","english_definition":"relating to liturgy or a particular form or system of public religious worship.","examples":[{"sentence":"The church's liturgistical practices were carefully observed.","translation":"その教会の典礼的な慣習は注意深く守られていた。"},{"sentence":"The music had a liturgistical quality, enhancing the solemnity of the service.","translation":"その音楽は典礼的な性質を持ち、礼拝の荘厳さを高めた。"}],"collocations":["liturgistical calendar","liturgistical music","liturgistical reforms","liturgistical tradition"],"synonyms":["ceremonial","ritualistic","sacramental","ecclesiastical","devotional"],"antonyms":["secular","profane","nonreligious"]}],"etymology":{"value":"\"liturgical\" + \"-ical\". \"Liturgical\" comes from Late Latin liturgicus, from Greek leitourgikos, meaning 'of or for public service', from leitourgia 'public service, ministry', from leitourgos 'one who performs public services', from leitos 'public' + ergon 'work'.","priority":"★★☆"},"pronunciation":{"ipa":"/lɪˈtɜːrdʒɪstɪkəl/","syllables":"li-tur-gis-ti-cal"},"inflection":{"notes":"Adjectives do not inflect in English, but can form comparative and superlative forms using 'more' and 'most' or '-er' and '-est' (though this is uncommon for this word)."},"usage_notes":{"explanation":"\"Liturgistical\" is used to describe things that are related to or part of a formal religious service or ritual. It's often used in the context of Christian worship, but can apply to other religions as well. It emphasizes the structured and prescribed nature of the worship.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The liturgistical was beautiful.","correct":"✓ The liturgy was beautiful.","note":"\"Liturgistical\" is an adjective and needs to modify a noun. \"Liturgy\" is the noun referring to the service itself."},{"incorrect":"✗ He is a liturgistical person.","correct":"✓ He is a liturgical person.","note":"While grammatically correct, \"liturgical person\" is not a common phrase. It would be better to say \"He is involved in liturgical practices\" or \"He is knowledgeable about liturgy.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["liturgy (noun: a form or formulary according to which public religious worship, especially Christian worship, is conducted)","liturgical (adjective: of or relating to liturgy)","liturgically (adverb: in a liturgistical manner)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"liturgistical\" is a formal and specialized term used to describe something related to the liturgy of a religious service. It is not commonly used in everyday conversation and is more likely to be found in academic or religious texts. Understanding this word requires familiarity with the concept of liturgy itself."},"example_sentences":[{"sentence":"The professor specialized in the study of liturgistical texts from the medieval period.","translation":"その教授は中世の典礼文書の研究を専門としていた。","type":"adjective","meaning_category":"典礼の"},{"sentence":"The new hymnal included several songs with a strong liturgistical character.","translation":"新しい賛美歌集には、強い典礼的性格を持つ歌がいくつか含まれていた。","type":"adjective","meaning_category":"典礼に関する"},{"sentence":"The liturgistical reforms aimed to make the service more accessible to modern congregations.","translation":"典礼改革は、現代の会衆にとって礼拝をより身近なものにすることを目指していた。","type":"adjective","meaning_category":"典礼の"}]}