{"word":"unposthumous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"死後に出版・発表・作成されたものではない、生前に発表・作成された","english_definition":"Not published, released, or created after death; done or existing during one's lifetime.","examples":[{"sentence":"The artist's unposthumous works were well-received during his lifetime.","translation":"その芸術家の生前に発表された作品は、彼の存命中に高く評価された。"},{"sentence":"This is an unposthumous collection of poems, published while the author was still alive.","translation":"これは作者が生前に出版された詩集である。"}],"collocations":["unposthumous work","unposthumous publication","unposthumous collection"],"synonyms":["antemortem","premortem","lifetime"],"antonyms":["posthumous"]},{"part_of_speech":"adjective","definition":"死後の名誉や評価を必要としない、生前に評価された","english_definition":"Not requiring posthumous recognition or fame; recognized or appreciated during one's lifetime.","examples":[{"sentence":"He was an unposthumous success, celebrated throughout his career.","translation":"彼は生前に成功を収め、キャリアを通じて称賛された。"},{"sentence":"Her achievements were unposthumous, widely acknowledged during her active years.","translation":"彼女の業績は生前に広く認められた。"}],"collocations":["unposthumous success","unposthumous recognition","unposthumous fame"],"synonyms":["living","contemporary","present"],"antonyms":["posthumous"]}],"etymology":{"value":"\"un-\" (否定の接頭辞) + \"posthumous\" (死後の)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnˈpɒstjʊməs/","syllables":"un-post-hu-mous"},"inflection":{"adjective_forms":{"comparative":"more unposthumous","superlative":"most unposthumous"}},"usage_notes":{"explanation":"\"unposthumous\" is a relatively rare word, primarily used in formal or academic contexts to emphasize that something occurred or was recognized during a person's lifetime, rather than after their death. It is often used to contrast with the more common term \"posthumous.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unposthumous novel was published after his death.","correct":"✓ The posthumous novel was published after his death.","note":"If the novel was published after the author's death, it is \"posthumous,\" not \"unposthumous.\""}],"priority":"★★☆"},"related_words":{"derivatives":["unposthumously"],"related_terms":["posthumous","antemortem"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unposthumous\" is a rare and sophisticated term, primarily encountered in academic or literary contexts. It signifies that something occurred or was recognized during a person's lifetime, as opposed to posthumously (after death). Understanding this word requires a strong grasp of prefixes and root words, as well as familiarity with formal vocabulary. Its usage is typically reserved for nuanced discussions about recognition, achievement, or creative works.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist enjoyed unposthumous acclaim, with exhibitions of his work celebrated while he was still alive.","translation":"その芸術家は生前に評価を受け、彼の作品展は存命中に称賛された。","type":"adjective","meaning_category":"生前に評価された"},{"sentence":"This is an unposthumous edition of his collected essays, published before his passing.","translation":"これは彼の生前に出版されたエッセイ集である。","type":"adjective","meaning_category":"生前に発表された"}]}