{"word":"tellability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"物語性、語りやすさ、語る価値","english_definition":"The quality of being interesting or significant enough to be worth telling as a story; the degree to which something is easily or effectively told as a story.","examples":[{"sentence":"The incident lacked tellability; it was simply too mundane to make a good story.","translation":"その出来事には物語性が欠けていた。ありふれていて良い話にはならなかった。"},{"sentence":"The tellability of her experiences made her a popular speaker.","translation":"彼女の経験の語りやすさが、彼女を人気のある講演者にした。"},{"sentence":"The researchers analyzed the tellability of different news stories to understand what makes them go viral.","translation":"研究者たちは、ニュース記事の物語性を分析して、何が記事を拡散させるのかを理解しようとした。"}],"collocations":["high tellability (高い物語性)","low tellability (低い物語性)","lack of tellability (物語性の欠如)","enhance tellability (物語性を高める)","assess tellability (物語性を評価する)"],"synonyms":["narrative potential","storyworthiness","engaging quality","dramatic appeal","interest value"],"antonyms":["mundanity","unremarkableness","insignificance","dullness"]},{"part_of_speech":"noun","definition":"(社会言語学)語りうる性質、語りうる条件","english_definition":"(Sociolinguistics) The properties or conditions that make a story worth telling in a particular social context.","examples":[{"sentence":"The tellability of a story depends on the audience and the social norms of the community.","translation":"物語の語りうる性質は、聴衆とコミュニティの社会的規範に依存する。"},{"sentence":"Labov's work on narrative analysis emphasizes the importance of tellability in understanding why people tell stories.","translation":"ラボフの物語分析の研究は、人々がなぜ物語を語るのかを理解する上で、語りうる性質の重要性を強調している。"}],"collocations":["social tellability (社会的な語りうる性質)","cultural tellability (文化的な語りうる性質)"],"synonyms":["narrative relevance","communicative value","social significance"],"antonyms":[]}],"etymology":{"value":"Formed from 'tellable' (capable of being told) + '-ity' (a suffix denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɛləˈbɪləti/","syllables":"tel-la-bil-i-ty"},"inflection":{"notes":"Uncountable noun."},"usage_notes":{"explanation":"'Tellability' refers to the inherent qualities of an event or experience that make it suitable and interesting for storytelling. It encompasses elements like novelty, emotional impact, significance, and relevance to the audience. In sociolinguistics, it also considers the social context and norms that influence whether a story is considered worth telling.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tellability was very high.","correct":"✓ The tellability of the story was very high.","note":"It's better to specify what possesses the tellability, rather than using 'tellability' as a subject on its own."}],"priority":"★★☆"},"related_words":{"derivatives":["tellable (adjective)","telling (adjective, noun)","retell (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tellability' is a concept used to describe how interesting or important a story is, making it worth sharing. It's about whether the story has elements that will capture the attention of listeners or readers. This word is often used in academic or analytical contexts when discussing narratives and storytelling. It considers whether a story is new, exciting, or relevant enough to be told. "},"example_sentences":[{"sentence":"The **tellability** of the witness's testimony was crucial to the outcome of the trial.","translation":"証人の証言の物語性が裁判の結果にとって重要だった。","type":"noun","meaning_category":"物語性"},{"sentence":"The movie's success was due in part to the inherent **tellability** of the historical events it depicted.","translation":"その映画の成功は、描かれた歴史的出来事の物語性にも一部起因していた。","type":"noun","meaning_category":"物語性"},{"sentence":"Researchers are studying the factors that contribute to the **tellability** of online content.","translation":"研究者たちは、オンラインコンテンツの物語性に貢献する要因を研究している。","type":"noun","meaning_category":"物語性"}]}