{"word":"conflict-promoting","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"紛争を助長する、対立を煽る、不和を招く","english_definition":"Tending to encourage or exacerbate conflict; designed or likely to cause disagreement or hostility.","examples":[{"sentence":"His inflammatory remarks were conflict-promoting and only served to escalate the tension.","translation":"彼の扇動的な発言は紛争を助長するもので、緊張をエスカレートさせるだけだった。"},{"sentence":"The new policy was seen as conflict-promoting because it unfairly favored one group over another.","translation":"新しい政策は、あるグループを不当に優遇するため、対立を煽るものと見なされた。"},{"sentence":"The article argued that certain media outlets were conflict-promoting by sensationalizing news stories.","translation":"その記事は、特定のメディアがニュースをセンセーショナルに報道することで対立を煽っていると主張した。"}],"collocations":["conflict-promoting behavior (紛争を助長する行動)","conflict-promoting policies (紛争を助長する政策)","conflict-promoting rhetoric (紛争を助長するレトリック)","conflict-promoting actions (紛争を助長する行動)","conflict-promoting environment (紛争を助長する環境)"],"synonyms":["divisive","inflammatory","provocative","antagonistic","discordant","contentious","belligerent","agitational"],"antonyms":["peaceful","harmonious","conciliatory","unifying","cooperative","amicable","collaborative"]}],"etymology":{"value":"The word is formed by combining 'conflict' (from Latin 'confligere', meaning 'to strike together') with 'promoting' (from Latin 'promovere', meaning 'to move forward, advance'). It describes something that actively encourages or advances conflict.","priority":"N/A"},"pronunciation":{"ipa":"/ˈkɒnflɪkt prəˈmoʊtɪŋ/","syllables":"con-flict pro-mo-ting"},"inflection":{"notes":"This is an adjective and does not inflect like a verb or noun."},"usage_notes":{"explanation":"'Conflict-promoting' is used to describe actions, policies, or rhetoric that are likely to increase disagreement, hostility, or open conflict between individuals or groups. It suggests an active role in encouraging or exacerbating conflict, rather than simply being a passive factor.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The conflict-promoting is bad.","correct":"Conflict-promoting behavior is bad.","note":"'Conflict-promoting' is an adjective and needs to modify a noun. Using it as a noun is grammatically incorrect."},{"incorrect":"He promoted conflict. It was conflict-promoting.","correct":"He promoted conflict. His actions were conflict-promoting.","note":"While 'He promoted conflict' is a valid sentence, using 'It was conflict-promoting' without a clear referent is vague. Specifying what 'it' refers to (e.g., 'His actions') makes the sentence clearer."}],"priority":"N/A"},"related_words":{"derivatives":["conflict (noun)","promote (verb)","promotion (noun)","conflict resolution (noun)","conflict management (noun)"],"phrases":["escalate conflict","fuel the flames","stir up trouble","sow discord","create division"],"priority":"N/A"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. This is a relatively uncommon term, typically used in academic or formal contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Conflict-promoting' is a complex adjective used to describe something that actively encourages or worsens conflict. It's often used in discussions about politics, social issues, or international relations. Understanding the word requires a good grasp of both 'conflict' and 'promote,' and the ability to understand how they combine to form a new meaning. Because it is a more advanced term, it is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The government's policies were seen as conflict-promoting, leading to widespread protests.","translation":"政府の政策は紛争を助長するものと見なされ、広範な抗議行動につながった。","type":"adjective","meaning_category":"紛争を助長する"},{"sentence":"Social media can be conflict-promoting when users spread misinformation and engage in personal attacks.","translation":"ソーシャルメディアは、ユーザーが誤った情報を拡散したり、個人攻撃を行ったりする場合、紛争を助長する可能性がある。","type":"adjective","meaning_category":"対立を煽る"},{"sentence":"The report criticized the media for its conflict-promoting coverage of the election.","translation":"報告書は、メディアの選挙報道が対立を煽るものであると批判した。","type":"adjective","meaning_category":"不和を招く"}]}