{"word":"Kiplingism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"キプリング主義：ラディヤード・キプリングの作品や思想に見られる特徴。大英帝国の擁護、白人至上主義、軍国主義、男らしさの強調などを含む。","english_definition":"The ideas and style associated with Rudyard Kipling, typically involving advocacy of British imperialism, the supposed superiority of the white race, militarism, and the idealization of masculine virtues.","examples":[{"sentence":"His views were often criticized as Kiplingism.","translation":"彼の見解はしばしばキプリング主義として批判された。"},{"sentence":"Kiplingism was prevalent in the literature of the late 19th and early 20th centuries.","translation":"キプリング主義は19世紀後半から20世紀初頭の文学に広まっていた。"}],"collocations":["Embodied Kiplingism","Criticized for Kiplingism","Associated with Kiplingism"],"synonyms":["Jingoism","Imperialism","Chauvinism","Militarism"],"antonyms":["Anti-imperialism","Pacifism","Cosmopolitanism"]}],"etymology":{"value":"ラディヤード・キプリング（Rudyard Kipling）の名前から派生。彼の作品や思想が特定のイデオロギーや価値観を代表するものとして認識されるようになったため。","priority":"★★★"},"pronunciation":{"ipa":"ˈkɪplɪŋɪzəm","syllables":"kip-ling-i-sm"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"「Kiplingism」は、ラディヤード・キプリングの作品や思想に見られる特定のイデオロギーや価値観を指す言葉です。大英帝国の擁護、白人至上主義、軍国主義、男らしさの強調などが含まれます。この言葉は、しばしば批判的な意味合いで使用され、キプリングの作品や思想に対する批判的な視点を表すために用いられます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He admired Kiplingism for its pacifist views.","correct":"✓ He admired Kiplingism for its strong sense of patriotism and duty.","note":"キプリング主義は平和主義とは対照的な、愛国心や義務感を強く強調する思想です。"},{"incorrect":"✗ Kiplingism is a celebration of diversity and multiculturalism.","correct":"✓ Kiplingism is often associated with a belief in the superiority of British culture and values.","note":"キプリング主義は多様性や多文化主義とは異なり、英国文化の優位性を信じる傾向があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["Kiplingesque (形容詞: キプリング風の)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 特定の文脈や学術的な議論で用いられる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Kiplingism」は、ラディヤード・キプリングの作品や思想に関連する特定のイデオロギーや価値観を指す専門的な言葉です。大英帝国の擁護、白人至上主義、軍国主義、男らしさの強調など、特定のテーマや視点を理解する必要があります。この言葉は、キプリングの作品や思想に対する批判的な視点を表すために用いられることが多く、歴史的、文学的な文脈で理解することが重要です。"},"example_sentences":[{"sentence":"The novel was criticized for its overt Kiplingism.","translation":"その小説は露骨なキプリング主義のために批判された。","type":"noun","meaning_category":"キプリング主義"},{"sentence":"His writings reflected a strong sense of Kiplingism, glorifying the British Empire.","translation":"彼の著作は、大英帝国を賛美する強いキプリング主義を反映していた。","type":"noun","meaning_category":"キプリング主義"}]}