{"word":"Straffordian","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ストラフォード伯（初代）に関連する、またはストラフォード伯（初代）に特徴的な","english_definition":"Of or pertaining to Thomas Wentworth, 1st Earl of Strafford (1593–1641), or his policies.","examples":[{"sentence":"The Straffordian policies were aimed at strengthening the power of the monarchy.","translation":"ストラフォード伯の政策は、君主制の権力を強化することを目的としていた。"},{"sentence":"A Straffordian approach to governance might involve a strong central authority.","translation":"統治に対するストラフォード伯的なアプローチは、強力な中央権力を伴う可能性がある。"}],"collocations":["Straffordian policies","Straffordian approach","Straffordian methods"],"synonyms":["Wentworthian"],"antonyms":[]}],"etymology":{"value":"Named after Thomas Wentworth, 1st Earl of Strafford, an English statesman.","priority":"★★★"},"pronunciation":{"ipa":"/stræfˈfɔːrdiən/","syllables":"Straf-for-di-an"},"inflection":{},"usage_notes":{"explanation":"This adjective is used to describe anything related to Thomas Wentworth, 1st Earl of Strafford, particularly his political strategies and governance style, which were characterized by a strong central authority and the enforcement of royal prerogative.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Strafford (noun)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'Straffordian' is a specialized term used in historical or political contexts, specifically when discussing the policies and governance style of Thomas Wentworth, 1st Earl of Strafford. It implies a strong, centralized, and sometimes authoritarian approach to governance. Due to its specific historical reference, it is not commonly used in everyday language."},"example_sentences":[{"sentence":"The historian analyzed the Straffordian methods of governance in early 17th-century England.","translation":"歴史家は、17世紀初頭のイングランドにおけるストラフォード伯の統治手法を分析した。","type":"adjective","meaning_category":"relating to Thomas Wentworth, 1st Earl of Strafford"}]}