{"word":"ghetto-dwellers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ゲットー居住者、ゲットーに住む人々","english_definition":"People who live in a ghetto; residents of a ghetto.","examples":[{"sentence":"Many ghetto-dwellers face systemic discrimination and poverty.","translation":"多くのゲットー居住者は、組織的な差別と貧困に直面しています。"},{"sentence":"The community organizations work to improve the lives of ghetto-dwellers.","translation":"地域団体は、ゲットー居住者の生活を向上させるために活動しています。"}],"collocations":["inner-city ghetto-dwellers","impoverished ghetto-dwellers"],"synonyms":["slum residents","underprivileged residents"],"antonyms":["affluent residents","suburbanites"]}],"etymology":{"value":"The term combines \"ghetto,\" referring to a segregated and often impoverished urban area, with \"dwellers,\" indicating inhabitants.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɛtoʊ ˈdwɛlərz/","syllables":"ghet-to-dwel-lers"},"inflection":{"noun_plural":"ghetto-dwellers"},"usage_notes":{"explanation":"The term \"ghetto-dwellers\" can be considered insensitive or pejorative, as it often carries negative connotations and stereotypes. It's generally better to use more neutral terms like \"residents of the ghetto\" or \"people living in the ghetto.\" The term highlights the socio-economic conditions and challenges faced by people living in these areas.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ghetto-dweller's houses were all the same.","correct":"✓ The houses of the ghetto-dwellers were all the same.","note":"When referring to the possessions or characteristics of multiple ghetto-dwellers, use the plural possessive form or rephrase to avoid the possessive altogether."}],"priority":"★★☆"},"related_words":{"derivatives":["ghetto","dwelling"],"phrases":["life in the ghetto","ghetto life"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"ghetto-dwellers\" refers to people who live in a ghetto, which is a part of a city where people from a particular group live, often because they are poor or face discrimination. This term can be seen as negative because it focuses on where people live rather than who they are. It is often better to use phrases like \"residents of the ghetto\" or \"people living in the ghetto\" instead.","priority":"★★☆"},"example_sentences":[{"sentence":"The social programs aim to support ghetto-dwellers in finding employment.","translation":"その社会プログラムは、ゲットー居住者が仕事を見つけるのを支援することを目的としています。","type":"noun","meaning_category":"ゲットー居住者"},{"sentence":"Many ghetto-dwellers lack access to quality education and healthcare.","translation":"多くのゲットー居住者は、質の高い教育や医療へのアクセスが不足しています。","type":"noun","meaning_category":"ゲットー居住者"}]}