{"word":"Counterengine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of engine designed to counteract or balance forces or movements, often used in specialized applications.","english_definition":"An engine designed to counteract or balance forces or movements, often used in specialized applications.","examples":[{"sentence":"The counterengine in the helicopter helps stabilize its flight.","translation":"ヘリコプターのカウンターエンジンは、飛行の安定に役立ちます。"},{"sentence":"This machine uses a counterengine to reduce vibrations.","translation":"この機械は、振動を軽減するためにカウンターエンジンを使用しています。"}],"collocations":["counterengine design","counterengine application","helicopter counterengine"],"synonyms":["balancing engine","opposing engine"],"antonyms":[]}],"etymology":{"value":"The term 'counterengine' is derived from 'counter,' meaning to oppose or balance, and 'engine,' referring to a machine that converts power into motion.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈkaʊntərˌɛndʒɪn/","syllables":"coun-ter-en-gine"},"inflection":{"noun_plural":"Counterengines"},"usage_notes":{"explanation":"The term 'counterengine' is not widely used and is typically found in technical contexts related to engineering and machinery. It describes an engine specifically designed to offset or balance forces or movements, such as vibrations or torque.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The car has a counterengine for speed.","correct":"✓ The car uses a regular engine for speed.","note":"Counterengines are not typically used for increasing speed but for balancing forces."}],"priority":"☆☆☆"},"related_words":{"derivatives":["counter","engine"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'counterengine' is a specialized term used in engineering contexts to describe an engine designed to counteract or balance forces. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The new helicopter design incorporates a counterengine to reduce rotor torque.","translation":"新しいヘリコプターの設計には、ローターのトルクを軽減するためのカウンターエンジンが組み込まれています。","type":"noun","meaning_category":"Engine Design"},{"sentence":"The counterengine in the vibration testing machine ensures accurate measurements.","translation":"振動試験機のカウンターエンジンは、正確な測定を保証します。","type":"noun","meaning_category":"Engineering Application"}]}