{"word":"strey","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"迷い出た家畜、はぐれ動物","english_definition":"A domestic animal that has strayed from its owner or home.","examples":[{"sentence":"The farmer found a strey sheep wandering in his field.","translation":"農夫は自分の畑で迷い出た羊を見つけた。"},{"sentence":"The local animal shelter often takes in streys.","translation":"地元の動物保護施設はよくはぐれ動物を引き取る。"}],"collocations":["strey animal","strey sheep","find a strey"],"synonyms":["stray","waif","wanderer"],"antonyms":["owned animal","domesticated animal"]},{"part_of_speech":"adjective","definition":"迷い出た、はぐれた","english_definition":"Having strayed; wandering; lost.","examples":[{"sentence":"A strey dog roamed the streets.","translation":"迷い犬が通りをうろついていた。"},{"sentence":"The strey kitten was cold and hungry.","translation":"はぐれた子猫は寒くてお腹が空いていた。"}],"collocations":["strey dog","strey cat","strey bullet"],"synonyms":["stray","lost","wandering"],"antonyms":["owned","homed"]}],"etymology":{"value":"From Middle English 'strai,' a variant of 'stray,' ultimately from Old French 'estraié,' past participle of 'estraier' meaning 'to stray.'","priority":"★★☆"},"pronunciation":{"ipa":"/streɪ/","syllables":"strey"},"inflection":{"noun_plural":"streys"},"usage_notes":{"explanation":"The word \"strey\" is an older or less common variant of \"stray,\" primarily used to describe domestic animals that have wandered away from their owners or homes. While \"stray\" is more frequently used in modern English, \"strey\" can still be found, especially in specific regional dialects or older texts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a strey person on the street.","correct":"✓ I saw a stray person on the street. / ✓ I saw a homeless person on the street.","note":"\"Strey\" is typically used for animals, not people. For people, use \"stray\" in a figurative sense or more appropriate terms like \"homeless.\""},{"incorrect":"✗ The strey cat was very friendly, so I took it home and streyed it.","correct":"✓ The stray cat was very friendly, so I took it home and cared for it.","note":"\"Strey\" describes the animal's state of being lost. To describe taking care of it, use verbs like \"cared for,\" \"rescued,\" or \"adopted.\""}],"priority":"★★☆"},"related_words":{"derivatives":["stray (more common variant)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Low frequency, not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"strey\" is a less common and somewhat archaic variant of \"stray,\" primarily used to describe domestic animals that have wandered away from their owners. While \"stray\" is more frequently encountered in modern English, understanding \"strey\" can be helpful for interpreting older texts or specific regional dialects. It's important to note that \"strey\" is generally not used to describe people; \"stray\" or other terms like \"homeless\" are more appropriate in those contexts."},"example_sentences":[{"sentence":"A strey calf was found near the riverbank.","translation":"迷い出た子牛が川岸の近くで見つかった。","type":"noun","meaning_category":"迷い出た家畜"},{"sentence":"The farmer was concerned about the strey animals during the storm.","translation":"農夫は嵐の間、はぐれた動物たちのことを心配していた。","type":"adjective","meaning_category":"迷い出た"}]}