{"word":"crafty-eyed","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ずる賢そうな目つきをした、悪賢そうな目をした","english_definition":"having eyes that suggest cunning, slyness, or deceptiveness.","examples":[{"sentence":"The old fox had a crafty-eyed look about him.","translation":"その年老いた狐は、ずる賢そうな目つきをしていた。"},{"sentence":"The salesman gave me a crafty-eyed smile, and I knew he was trying to trick me.","translation":"そのセールスマンは私に悪賢そうな笑みを浮かべ、私は彼が私を騙そうとしているのだとわかった。"},{"sentence":"She studied him with a crafty-eyed gaze, trying to discern his true intentions.","translation":"彼女は彼の本当の意図を見抜こうと、ずる賢そうな目つきで彼を観察した。"}],"collocations":["a crafty-eyed look","a crafty-eyed smile","a crafty-eyed gaze","crafty-eyed old man","crafty-eyed expression"],"synonyms":["sly-eyed","cunning-eyed","wily-eyed","shrewd-eyed","deceptive-eyed"],"antonyms":["honest-eyed","innocent-eyed","naive-eyed","trusting-eyed","sincere-eyed"]}],"etymology":{"value":"The word 'crafty-eyed' is a compound adjective formed by combining 'crafty' (meaning skilled in deception or cunning) and 'eyed' (having eyes of a particular kind). It describes someone whose eyes convey a sense of slyness or cunning.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkræfti aɪd/","syllables":"craft-y-eyed"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Crafty-eyed' is used to describe someone whose eyes give an impression of being cunning, sly, or deceptive. It suggests that the person is not straightforward and may be trying to hide something or manipulate a situation. The term often carries a negative connotation, implying a lack of trustworthiness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was crafty-eyed because he was happy.","correct":"✓ He was crafty-eyed because he was planning something.","note":"'Crafty-eyed' implies cunning or slyness, not happiness. It's used when someone appears to be scheming or deceptive."},{"incorrect":"✗ She had a crafty-eyed face.","correct":"✓ She had a crafty-eyed look.","note":"While 'crafty-eyed' describes the eyes, it's more common to say someone has a 'crafty-eyed look' or 'expression' rather than a 'crafty-eyed face'."}],"priority":"★★☆"},"related_words":{"derivatives":["crafty (adjective: cunning, sly, skilled in deception)","craftiness (noun: the quality of being crafty)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The adjective 'crafty-eyed' is used to describe someone whose eyes give the impression of being cunning, sly, or deceptive. It suggests a lack of straightforwardness and a potential for manipulation. It's not a very common word, so it's more likely to be encountered in literature or descriptive writing where the author wants to convey a specific impression of a character's personality."},"example_sentences":[{"sentence":"The swindler gave the detective a crafty-eyed stare.","translation":"詐欺師は刑事にずる賢そうな目で睨みつけた。","type":"adjective","meaning_category":"ずる賢そうな目つき"},{"sentence":"I didn't trust him; he had a crafty-eyed way of looking at people.","translation":"私は彼を信用しなかった。彼は人を悪賢そうな目つきで見る癖があった。","type":"adjective","meaning_category":"悪賢そうな目つき"},{"sentence":"The politician's crafty-eyed response made the reporter even more suspicious.","translation":"政治家の悪賢そうな目つきの返答は、記者をさらに疑心暗鬼にさせた。","type":"adjective","meaning_category":"ずる賢そうな目つき"}]}