{"word":"jocosity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"おどけ、ふざけ、冗談好き、陽気さ","english_definition":"the quality or state of being jocular; a playful or humorous disposition; a liking for joking.","examples":[{"sentence":"His speech was marked by a certain jocosity, which made the serious topic more palatable.","translation":"彼の演説はある種のおどけに彩られており、それによって深刻な話題がより受け入れやすくなった。"},{"sentence":"Despite the somber atmosphere, a hint of jocosity could be detected in his eyes.","translation":"陰鬱な雰囲気にもかかわらず、彼の目にはわずかなふざけが見て取れた。"},{"sentence":"The comedian's jocosity was infectious, and soon the entire audience was laughing.","translation":"そのコメディアンの陽気さは伝染しやすく、すぐに聴衆全体が笑っていた。"}],"collocations":["display jocosity (おどけを示す)","a hint of jocosity (わずかなふざけ)","infectious jocosity (伝染しやすい陽気さ)","characteristic jocosity (特徴的な陽気さ)"],"synonyms":["jocularity","humor","wit","playfulness","gaiety","merriment","cheerfulness","lightheartedness"],"antonyms":["seriousness","solemnity","gravity","earnestness","melancholy","sadness"]}],"etymology":{"value":"Derived from 'jocose,' which comes from the Latin word 'iocosus,' meaning 'full of jest or sport,' which in turn comes from 'iocus,' meaning 'jest' or 'joke.'","priority":"★★☆"},"pronunciation":{"ipa":"/dʒɒˈkɒsɪti/","syllables":"jo-cos-i-ty"},"inflection":{"noun_plural":"jocosities"},"usage_notes":{"explanation":"'Jocosity' refers to the quality of being jocular, which means being fond of or characterized by joking; it describes a playful and humorous disposition. It's a somewhat formal word, less commonly used in everyday conversation than synonyms like 'humor' or 'playfulness.' It often implies a deliberate or characteristic tendency to be humorous.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed jocosity towards the tragic event.","correct":"✓ He showed a lack of seriousness towards the tragic event.","note":"'Jocosity' implies a lightheartedness that is inappropriate in serious or tragic situations. It's better to say someone lacked seriousness or was insensitive. "},{"incorrect":"✗ The jocosity of the machine was impressive.","correct":"✓ The efficiency of the machine was impressive.","note":"'Jocosity' is a quality that applies to people or their behavior, not to inanimate objects. Use a more appropriate word to describe a machine's qualities."}],"priority":"★☆☆"},"related_words":{"derivatives":["jocose (adjective: playful or humorous)","jocular (adjective: fond of or characterized by joking; humorous or playful)","jocularly (adverb: in a jocular manner)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Not commonly used in general conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Jocosity' is a formal term that describes the quality of being humorous or playful. It is not a commonly used word, so it is more likely to be found in written texts or formal speech. It suggests a deliberate or characteristic tendency to be lighthearted and joking. If you want to express the same idea in a simpler way, you could use words like 'humor,' 'playfulness,' or 'wit.'"},"example_sentences":[{"sentence":"The professor's occasional jocosity made the lectures more engaging.","translation":"教授の時折のおどけが講義をより魅力的にした。","type":"noun","meaning_category":"陽気さ"},{"sentence":"His natural jocosity often diffused tense situations.","translation":"彼の生まれつきの陽気さは、しばしば緊迫した状況を和らげた。","type":"noun","meaning_category":"ふざけ"},{"sentence":"The author's jocosity is evident throughout the novel.","translation":"その作家の陽気さは小説全体を通して明らかである。","type":"noun","meaning_category":"おどけ"}]}