{"word":"toenailed","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(過去形、過去分詞) 斜め釘打ちされた、斜め釘打ちする","english_definition":"(past tense and past participle of toenail) fastened with nails driven in obliquely; to fasten with nails driven in obliquely.","examples":[{"sentence":"The boards were toenailed to the frame.","translation":"板はフレームに斜め釘打ちされた。"},{"sentence":"He toenailed the trim to the wall.","translation":"彼はトリムを壁に斜め釘打ちした。"}],"collocations":["toenail boards","toenail frame","toenail trim"],"synonyms":["angle-nailed","skew-nailed"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'toenail', which describes the technique of driving nails at an angle to join two pieces of wood. The term likely originated from the appearance of the nail resembling a toenail sticking out.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtoʊneɪld/","syllables":"toe-nailed"},"inflection":{"verb_forms":{"present_simple":["toenail","toenails"],"past_simple":"toenailed","past_participle":"toenailed","present_participle":"toenailing"}},"usage_notes":{"explanation":"'Toenailing' is a woodworking technique used to join two pieces of wood when you can't directly nail through one into the other. The nail is driven in at an angle, providing a strong hold. The past tense and past participle 'toenailed' describe something that has been joined using this method.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The wood was toenail.","correct":"✓ The wood was toenailed.","note":"'Toenail' is a verb, so you need the past participle 'toenailed' to describe the state of the wood."}],"priority":"★☆☆"},"related_words":{"derivatives":["toenail (noun: つま先の爪、動詞: 斜め釘打ちする)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Toenailed' is a specialized term in woodworking. It describes a specific method of joining wood pieces by driving nails in at an angle. Understanding this term requires some familiarity with carpentry or construction. The term is not commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The carpenter toenailed the baseboard to the wall studs.","translation":"大工は幅木を壁の間柱に斜め釘打ちした。","type":"verb","meaning_category":"斜め釘打ちする"},{"sentence":"The deck boards were carefully toenailed to the joists.","translation":"デッキの板は慎重に根太に斜め釘打ちされた。","type":"verb","meaning_category":"斜め釘打ちする"},{"sentence":"Once the frame was assembled, the panels were toenailed into place.","translation":"フレームが組み立てられると、パネルは斜め釘打ちで固定された。","type":"verb","meaning_category":"斜め釘打ちする"}]}