{"word":"Bornite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"斑銅鉱（はんどうこう）: 銅の硫化鉱物で、しばしば虹色の表面を持つ。","english_definition":"A sulfide mineral of copper, Cu5FeS4, often with iridescent tarnish.","examples":[{"sentence":"Bornite is an important ore of copper.","translation":"斑銅鉱は重要な銅の鉱石です。"}],"collocations":[],"synonyms":["Peacock Ore"],"antonyms":[]}],"etymology":{"value":"名前は、オーストリアの鉱物学者イグナツ・フォン・ボルン（Ignaz von Born, 1742–1791）に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɔːrnaɪt/","syllables":"Bor-nite"},"inflection":{"noun_plural":"Bornites"},"usage_notes":{"explanation":"Borniteは、化学式Cu5FeS4で表される銅の硫化鉱物です。新鮮な表面は青銅色から赤褐色ですが、空気や湿気にさらされると、さまざまな色の虹色の変色（tarnish）を生じることがよくあります。この変色により、「孔雀鉱石（Peacock Ore）」という別名でも知られています。Borniteは、銅の重要な鉱石であり、世界中のさまざまな場所で産出されます。","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["chalcopyrite (黄銅鉱)","chalcocite (輝銅鉱)","copper (銅)","sulfide (硫化物)"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"Bornite is a copper iron sulfide mineral with the chemical formula Cu5FeS4. It is a relatively rare mineral, but it is an important ore of copper. Bornite is typically found in hydrothermal veins and in sedimentary rocks. It is a dark brown to black mineral with a metallic luster. When exposed to air, bornite tarnishes to a variety of iridescent colors, including blue, purple, and green. This tarnish is caused by the oxidation of the copper and iron in the mineral. Bornite is sometimes called peacock ore because of its iridescent tarnish."},"example_sentences":[{"sentence":"The museum displayed a large specimen of bornite, its surface shimmering with iridescent colors.","translation":"博物館には大きな斑銅鉱の標本が展示されており、その表面は虹色に輝いていた。","type":"noun","meaning_category":"鉱物"},{"sentence":"Bornite is often found in association with other copper sulfide minerals, such as chalcopyrite and chalcocite.","translation":"斑銅鉱は、しばしば黄銅鉱や輝銅鉱などの他の銅硫化鉱物と共に見られる。","type":"noun","meaning_category":"鉱物"}]}