{"word":"Choragy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ギリシャ)合唱隊長職、合唱隊長としての奉仕","english_definition":"(in ancient Greece) the office of choragus; service as a choragus.","examples":[{"sentence":"His family had a tradition of serving in the choragy.","translation":"彼の家系には、合唱隊長職を務める伝統があった。"},{"sentence":"The expenses of the choragy were considerable.","translation":"合唱隊長職の費用はかなりのものだった。"}],"collocations":["perform choragy","serve in choragy"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Ancient Greek χορηγία (khorēgía, “leading of a chorus; equipment of a chorus”), from χορηγός (khorēgós, “leader of a chorus; provider of a chorus”), from χορός (khorós, “chorus”) + ἡγέομαι (hēgéomai, “I lead”).","priority":"★★★"},"pronunciation":{"ipa":"/kəˈreɪdʒi/","syllables":"ko-ray-ji"},"inflection":{"noun_plural":"choragies"},"usage_notes":{"explanation":"'Choragy' refers specifically to the role and responsibilities of a 'choragus' in ancient Greece. The choragus was a wealthy citizen who financed and trained a chorus for dramatic or musical competitions. The choragy was a civic duty and a way for wealthy individuals to gain prestige.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["choragus"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Choragy' is a highly specialized term related to ancient Greek society and theatrical practices. It is unlikely to be encountered outside of academic contexts focusing on classical history, drama, or music. Understanding requires familiarity with ancient Greek social structures and the role of wealthy citizens in supporting cultural events."},"example_sentences":[{"sentence":"The burden of the choragy often fell upon the wealthiest citizens of Athens.","translation":"合唱隊長職の負担は、しばしばアテネの最も裕福な市民にのしかかった。","type":"noun","meaning_category":"合唱隊長職"},{"sentence":"The choragy involved not only financial support but also the selection and training of the chorus.","translation":"合唱隊長職は、財政的支援だけでなく、合唱団の選抜と訓練も伴っていた。","type":"noun","meaning_category":"合唱隊長としての奉仕"}]}