{"word":"guaranteeship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"保証人であること、保証人の地位、保証の役割","english_definition":"The state or position of being a guarantor; the role or function of providing a guarantee.","examples":[{"sentence":"His guaranteeship of the loan allowed the company to secure funding.","translation":"彼のローンの保証人としての立場が、会社が資金を確保することを可能にした。"},{"sentence":"The guaranteeship provided by the government reduced the risk for investors.","translation":"政府によって提供された保証人の役割は、投資家にとってのリスクを軽減した。"}],"collocations":["offer guaranteeship","provide guaranteeship","accept guaranteeship"],"synonyms":["guaranty","suretyship","warranty"],"antonyms":[]}],"etymology":{"value":"'Guarantee' + '-ship'. The suffix '-ship' is used to denote a state, condition, office, or function.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡærənˈtiːʃɪp/","syllables":"ga-ran-tee-ship"},"inflection":{"noun_plural":"guaranteeships"},"usage_notes":{"explanation":"'Guaranteeship' refers to the state, position, or function of being a guarantor. It is relatively formal and less commonly used than 'guarantee' or 'surety'. It emphasizes the role and responsibility of the guarantor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a guaranteeship for the debt.","correct":"✓ He has a guarantee for the debt. / ✓ He provides guaranteeship for the debt.","note":"'Guaranteeship' is the state or role, not the document or agreement itself. Use 'guarantee' for the agreement or 'provides guaranteeship' to describe the action of being a guarantor."}],"priority":"★★☆"},"related_words":{"derivatives":["guarantee","guarantor","surety"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Guaranteeship' is a formal and relatively uncommon term referring to the state or position of being a guarantor. It implies a formal role and responsibility in providing a guarantee for something, such as a loan or obligation. The term is primarily used in legal or financial contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The bank required a guaranteeship before approving the loan.","translation":"銀行は融資を承認する前に保証人の地位を要求した。","type":"noun","meaning_category":"保証人の地位"},{"sentence":"The government's guaranteeship of the project encouraged investment.","translation":"政府のプロジェクトの保証人の役割は、投資を促進した。","type":"noun","meaning_category":"保証の役割"}]}