{"word":"pseudoevangelically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"疑似福音主義的に、見せかけの福音主義の立場で","english_definition":"In a manner that is falsely or superficially evangelical; appearing to be evangelical but lacking genuine commitment or understanding.","examples":[{"sentence":"The politician spoke pseudoevangelically, using religious language to appeal to voters without truly embracing the faith.","translation":"その政治家は疑似福音主義的に話し、宗教的な言葉を使って有権者に訴えかけたが、信仰を真に受け入れているわけではなかった。"},{"sentence":"The organization presented itself pseudoevangelically, but its actions contradicted its proclaimed values.","translation":"その組織は見せかけの福音主義の立場で自己を提示したが、その行動は公言された価値観と矛盾していた。"}],"collocations":["speak pseudoevangelically","present pseudoevangelically","act pseudoevangelically"],"synonyms":["hypocritically","superficially","falsely","ostensibly"],"antonyms":["genuinely","authentically","sincerely"]}],"etymology":{"value":"The word is formed by combining \"pseudo-\" (meaning false or deceptive) with \"evangelically\" (in an evangelical manner).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊɪˌvænˈdʒɛlɪkli/","syllables":"pseu-do-e-van-gel-i-cal-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"The term \"pseudoevangelically\" is used to describe actions, speech, or presentations that mimic or superficially resemble evangelical Christianity but lack genuine faith, commitment, or understanding of evangelical principles. It often implies a deceptive or manipulative intent, where religious language or imagery is used to achieve other goals, such as political gain or financial profit.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He evangelically spoke about the issue.","correct":"✓ He spoke evangelically about the issue. / He spoke pseudoevangelically about the issue.","note":"Ensure the correct meaning is conveyed. \"Evangelically\" means in a genuine evangelical manner, while \"pseudoevangelically\" implies insincerity or superficiality."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudoevangelical (adjective)","pseudoevangelicalism (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'pseudoevangelically' is a complex term used to describe something done in a way that appears to be evangelical but is not genuine. It's often used in critical contexts to point out hypocrisy or insincerity in religious expression. Understanding requires familiarity with both the prefix 'pseudo-' (meaning false or imitation) and the concept of evangelicalism."},"example_sentences":[{"sentence":"The company marketed its products pseudoevangelically, promising miraculous results without scientific backing.","translation":"その会社は疑似福音主義的に製品を販売し、科学的根拠なしに奇跡的な結果を約束した。","type":"adverb","meaning_category":"deceptive marketing"},{"sentence":"He approached the debate pseudoevangelically, cherry-picking scripture to support his pre-existing beliefs.","translation":"彼は疑似福音主義的に議論に臨み、自身の既存の信念を支持するために聖書の一部分だけを選び出した。","type":"adverb","meaning_category":"selective interpretation"}]}