{"word":"expiators","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 償いをする人、罪を償う人","english_definition":"(plural) those who make amends for sins or wrongdoing; those who atone.","examples":[{"sentence":"The monks were seen as expiators for the sins of the community.","translation":"その修道士たちは、共同体の罪を償う者と見なされていた。"},{"sentence":"The ritual involved expiators who would cleanse the land.","translation":"その儀式には、土地を清める償いをする人々が関わっていた。"}],"collocations":["act as expiators","become expiators","role of expiators"],"synonyms":["atoners","penitents","redeemers","propitiators"],"antonyms":["sinners","wrongdoers"]}],"etymology":{"value":"The word 'expiators' comes from 'expiator,' which is derived from the verb 'expiate.' 'Expiate' comes from the Latin 'expiare,' meaning 'to appease, propitiate, atone for,' from 'ex-' (thoroughly) + 'piare' (to appease, propitiate).","priority":"★★☆"},"pronunciation":{"ipa":"ˈɛkspiˌeɪtərz","syllables":"ex-pi-a-tors"},"inflection":{"noun_singular":"expiator"},"usage_notes":{"explanation":"'Expiators' refers to individuals who perform actions to make amends for sins, crimes, or other wrongdoings. This term is often used in religious or moral contexts where the act of expiation is seen as necessary for purification or redemption.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The expiators were exempt from punishment.","correct":"The expiators sought to remedy the wrongdoings.","note":"Expiators are not exempt from punishment; they are the ones trying to atone for wrongdoings."}],"priority":"★☆☆"},"related_words":{"derivatives":["expiate (verb): to atone for; to make amends for","expiation (noun): the act of atoning; the means by which atonement is made","expiatory (adjective): serving to expiate or atone"],"phrases":["expiatory sacrifice","expiatory offering"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - uncommon in general usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'expiators' is a relatively uncommon word that refers to individuals who perform acts of expiation, meaning they make amends for sins or wrongdoings. This word is often encountered in religious or philosophical contexts dealing with concepts of atonement, redemption, and moral purification. Understanding this term requires a grasp of abstract concepts related to guilt, repentance, and the process of seeking forgiveness or reconciliation."},"example_sentences":[{"sentence":"The ancient priests acted as expiators, performing rituals to cleanse the community of its sins.","translation":"古代の司祭たちは償いをする者として行動し、共同体の罪を清めるための儀式を行った。","type":"noun","meaning_category":"償いをする人"},{"sentence":"Many believed that acts of charity could transform wrongdoers into expiators.","translation":"多くの人が、慈善行為が罪人を償いをする人に変えることができると信じていた。","type":"noun","meaning_category":"償いをする人"}]}