{"word":"Siphonosome","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学)管クラゲ類の個虫群体における、栄養個虫、触手個虫、生殖個虫以外の部分。主に遊泳や浮遊、推進に関わる個虫の集合体。","english_definition":"(Zoology) In siphonophores, the part of the colony other than the pneumatophore (float), nectosome (swimming bells), and gonophores (reproductive zooids); it contains the gastrozooids (feeding zooids) and dactylozooids (defensive zooids).","examples":[{"sentence":"The siphonosome of the Portuguese man-of-war contains the long, venomous tentacles.","translation":"カツオノエボシの管状体には、長く有毒な触手が含まれている。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'siphon' (tube, pipe) and 'soma' (body), referring to the tubular or body-like structure of this part of the siphonophore colony.","priority":"☆☆☆"},"pronunciation":{"ipa":"/saɪˈfɒnəˌsoʊm/","syllables":"Si-pho-no-some"},"inflection":{"noun_plural":"siphonosomes"},"usage_notes":{"explanation":"The siphonosome is a key part of the complex colonial organism known as a siphonophore. It is responsible for feeding, defense, and other functions necessary for the survival of the colony. The specific structure and function of the siphonosome can vary depending on the species of siphonophore.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["siphonophore"],"related_terms":["nectosome","pneumatophore","gastrozooid","dactylozooid"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'siphonosome' is a specialized zoological term used to describe a specific part of a siphonophore colony. Understanding this term requires a background in zoology and invertebrate biology. It is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"The morphology of the siphonosome is crucial for the identification of different siphonophore species.","translation":"管状体の形態は、異なる管クラゲ類を識別するために重要である。","type":"scientific","meaning_category":"zoology"},{"sentence":"Researchers studied the feeding behavior of gastrozooids within the siphonosome.","translation":"研究者らは、管状体内の栄養個虫の摂食行動を研究した。","type":"scientific","meaning_category":"zoology"}]}