{"word":"Choanoflagellida","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"襟鞭毛虫類：動物に最も近縁な原生生物のグループ","english_definition":"A group of free-living unicellular and colonial flagellate eukaryotes considered to be the closest living relatives of the animals.","examples":[{"sentence":"Choanoflagellida are important for understanding the origin of multicellularity.","translation":"襟鞭毛虫類は多細胞生物の起源を理解する上で重要である。"},{"sentence":"Some species of Choanoflagellida form colonies.","translation":"襟鞭毛虫類の中には群体を形成する種もいる。"}],"collocations":["Choanoflagellida culture","Choanoflagellida evolution","study of Choanoflagellida"],"synonyms":["collared flagellates"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'choane' (funnel or collar) and 'flagellum' (whip), referring to the characteristic collar-like structure around the flagellum.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊˌænəfləˈdʒɛlɪdə/","syllables":"Cho-a-no-fla-gel-li-da"},"inflection":{"noun_plural":"Choanoflagellids"},"usage_notes":{"explanation":"Choanoflagellida are single-celled eukaryotes characterized by an ovoid or spherical cell body with a single flagellum surrounded by a collar of microvilli. They feed on bacteria and are found in marine and freshwater environments. Their importance lies in their close evolutionary relationship to animals, providing insights into the evolution of multicellularity and animal origins.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Choanoflagellida is a animal.","correct":"✓ Choanoflagellida is a protist.","note":"Choanoflagellida are protists, not animals, although they are closely related to animals."}],"priority":"★☆☆"},"related_words":{"derivatives":["choanocyte (襟細胞)"],"related_terms":["protist","eukaryote","flagellate","unicellular","colonial","metazoa"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Choanoflagellida' is a technical term used in biology to refer to a specific group of microorganisms. Understanding this term requires a background in biology or microbiology. The word itself is derived from Greek roots describing the cell's structure, which includes a 'collar' and a 'flagellum'. These organisms are significant in evolutionary biology because they are the closest known relatives to animals, offering insights into the origins of multicellular life."},"example_sentences":[{"sentence":"The study of Choanoflagellida provides valuable information about the evolution of animals.","translation":"襟鞭毛虫類の研究は、動物の進化に関する貴重な情報を提供する。","type":"scientific","meaning_category":"evolutionary biology"},{"sentence":"Researchers are using Choanoflagellida as a model organism to study the transition from unicellular to multicellular life.","translation":"研究者たちは襟鞭毛虫類を、単細胞生物から多細胞生物への移行を研究するためのモデル生物として使用している。","type":"research","meaning_category":"microbiology"}]}