{"word":"interpenetrative","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"相互浸透的な、相互に浸透し合う","english_definition":"Relating to or characterized by interpenetration; mutually penetrating.","examples":[{"sentence":"The artist explored the interpenetrative relationship between light and shadow.","translation":"その芸術家は光と影の相互浸透的な関係を探求した。"},{"sentence":"Their cultures are interpenetrative, with each influencing the other.","translation":"彼らの文化は相互浸透的であり、互いに影響し合っている。"}],"collocations":["interpenetrative relationship","interpenetrative forces","interpenetrative elements"],"synonyms":["intertwined","interwoven","intermixed","interfused"],"antonyms":["separate","distinct","isolated"]}],"etymology":{"value":"Formed from \"inter-\" (between, among) + \"penetrative\" (having the power to penetrate).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪntərˈpɛnɪtreɪtɪv","syllables":"in-ter-pen-e-tra-tive"},"inflection":{},"usage_notes":{"explanation":"'Interpenetrative' describes a situation where two or more things are so closely connected or mixed that they seem to pass into or through each other. It is often used in contexts involving art, culture, philosophy, or physics to describe complex relationships.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The interpenetrative of the two objects was clear.","correct":"✓ The interpenetration of the two objects was clear.","note":"'Interpenetrative' is an adjective. The noun form is 'interpenetration'."}],"priority":"★★☆"},"related_words":{"derivatives":["interpenetrate (verb)","interpenetration (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'interpenetrative' is a relatively advanced term used to describe the state of two or more things that are so closely connected or mixed that they appear to pass through each other. It's often used in academic or artistic contexts to describe complex relationships or interactions. Understanding this word requires a strong vocabulary and the ability to grasp abstract concepts."},"example_sentences":[{"sentence":"The novel explores the interpenetrative nature of memory and identity.","translation":"その小説は記憶とアイデンティティの相互浸透的な性質を探求している。","type":"general","meaning_category":"相互浸透的な"},{"sentence":"Quantum entanglement demonstrates an interpenetrative connection between particles.","translation":"量子エンタングルメントは粒子間の相互浸透的なつながりを示している。","type":"scientific","meaning_category":"相互浸透的な"}]}