{"word":"rostrolateral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(解剖学)吻側と外側両方の、またはそれらに関係する","english_definition":"(anatomy) Situated or relating to both the rostral (front) and lateral (side) aspects of a structure.","examples":[{"sentence":"The rostrolateral prefrontal cortex is involved in higher cognitive functions.","translation":"吻外側前頭前皮質は、高次認知機能に関与している。"}],"collocations":["rostrolateral prefrontal cortex"],"synonyms":["anterolateral","frontolateral"],"antonyms":["caudomedial","posteromedial"]}],"etymology":{"value":"Derived from the combination of 'rostral' (relating to the front or beak) and 'lateral' (relating to the side).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɒstroʊˈlætərəl/","syllables":"ros-tro-lat-er-al"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used for this word."},"usage_notes":{"explanation":"The term 'rostrolateral' is primarily used in anatomical and neuroanatomical contexts to describe the location of a structure that is both towards the front (rostral) and to the side (lateral) of a reference point. It is most frequently encountered in discussions of the brain, particularly the prefrontal cortex.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rostrolateral area is on the back of the brain.","correct":"✓ The rostrolateral area is on the front and side of the brain.","note":"'Rostral' refers to the front, not the back, of the brain."}],"priority":"★☆☆"},"related_words":{"derivatives":["rostral","lateral"],"related_terms":["dorsolateral","ventrolateral","medial","caudal"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - primarily used in specialized scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Rostrolateral' is a highly specialized term used in anatomy, particularly neuroanatomy. It describes a location that is both towards the front (rostral) and to the side (lateral) of a structure. Understanding this term requires familiarity with anatomical directional terminology. It is rarely encountered outside of scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Damage to the rostrolateral prefrontal cortex can impair decision-making abilities.","translation":"吻外側前頭前皮質の損傷は、意思決定能力を損なう可能性がある。","type":"general","meaning_category":"anatomy"}]}