{"word":"oneirocritical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"夢判断の、夢解釈の","english_definition":"Relating to the interpretation or analysis of dreams.","examples":[{"sentence":"The oneirocritical texts of ancient Greece provide insight into their beliefs about dreams.","translation":"古代ギリシャの夢解釈の文献は、夢に関する彼らの信念への洞察を提供する。"},{"sentence":"He approached the dream with a oneirocritical perspective, seeking its hidden meaning.","translation":"彼は夢に夢解釈的な視点からアプローチし、その隠された意味を探求した。"}],"collocations":["oneirocritical analysis","oneirocritical interpretation","oneirocritical perspective","oneirocritical method","oneirocritical tradition"],"synonyms":["dream-interpreting","dream-analyzing","symbolic","interpretive"],"antonyms":["literal","factual","objective"]}],"etymology":{"value":"Derived from Greek: 'oneiros' (dream) + 'kritikos' (able to discern, judging).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊˌnaɪroʊˈkrɪtɪkəl/","syllables":"o-nei-ro-crit-i-cal"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more oneirocritical, most oneirocritical)."},"usage_notes":{"explanation":"The term 'oneirocritical' is relatively rare and primarily used in academic or specialized contexts related to the study of dreams, psychology, or history. It specifically refers to the practice or theory of interpreting dreams to uncover hidden meanings or psychological insights.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a oneirocritical dream.","correct":"✓ He had a dream that required oneirocritical analysis.","note":"'Oneirocritical' describes the analysis or interpretation, not the dream itself."},{"incorrect":"✗ She is a oneirocritic person.","correct":"✓ She is an oneirocritic. / ✓ She is skilled in oneirocriticism.","note":"'Oneirocritic' is the noun referring to a person skilled in dream interpretation, while 'oneirocritical' is the adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["oneirocritic (noun: a dream interpreter)","oneirocriticism (noun: the practice of dream interpretation)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Very specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Oneirocritical' is a specialized term used in the context of dream interpretation and analysis. It describes something related to the process of discerning meaning from dreams, often involving symbolic or psychological interpretations. This word is not commonly used in everyday conversation and is more likely to be encountered in academic or scholarly discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The ancient Egyptians had a highly developed oneirocritical system.","translation":"古代エジプト人は高度に発達した夢解釈の体系を持っていた。","type":"adjective","meaning_category":"夢解釈の"},{"sentence":"His oneirocritical approach to understanding the patient's subconscious was innovative.","translation":"患者の潜在意識を理解するための彼の夢解釈的なアプローチは革新的だった。","type":"adjective","meaning_category":"夢解釈の"},{"sentence":"The book provides a oneirocritical analysis of several famous literary works.","translation":"その本は、いくつかの有名な文学作品の夢解釈的な分析を提供している。","type":"adjective","meaning_category":"夢解釈の"}]}