{"word":"drumfish","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(主に北米産の)イシモチ科の魚","english_definition":"Any of various fishes of the family Sciaenidae, which are capable of producing drumming or croaking sounds.","examples":[{"sentence":"The freshwater drumfish is a common catch in the Great Lakes.","translation":"淡水ドラムフィッシュは五大湖でよく獲れる魚です。"},{"sentence":"The black drumfish can grow to be quite large.","translation":"クログチはかなり大きくなることがあります。"}],"collocations":["freshwater drumfish","black drumfish","red drumfish"],"synonyms":["drum","croaker"],"antonyms":[]},{"part_of_speech":"noun","definition":"(特に)オオニベ (Argyrosomus japonicus)","english_definition":"Specifically, the Japanese meagre or Argyrosomus japonicus.","examples":[{"sentence":"Drumfish are popular in Japanese cuisine.","translation":"オオニベは日本料理で人気があります。"}],"collocations":[],"synonyms":["Japanese meagre"],"antonyms":[]}],"etymology":{"value":"The name \"drumfish\" comes from the drumming or croaking sounds that these fish make using their swim bladders.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdrʌmˌfɪʃ/","syllables":"drum-fish"},"inflection":{"noun_plural":"drumfishes or drumfish"},"usage_notes":{"explanation":"The term \"drumfish\" can refer to various species within the Sciaenidae family, known for their ability to produce drumming sounds. In some contexts, it may specifically refer to the Japanese meagre (Argyrosomus japonicus), particularly in culinary discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a drumfish in the ocean, it was a freshwater type.","correct":"✓ I saw a drumfish in the lake, it was a freshwater type.","note":"Freshwater drumfish are found in freshwater environments, not the ocean."}],"priority":"★★☆"},"related_words":{"derivatives":["drumming (noun: the act of making a drumming sound)"],"phrases":["fish","marine life","aquatic species"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"drumfish\" refers to a type of fish known for making drumming sounds. It's not a very common word, but you might encounter it in discussions about fishing, marine biology, or Japanese cuisine (specifically referring to Argyrosomus japonicus). It's helpful to know that it can refer to a broader category of fish or a specific species depending on the context."},"example_sentences":[{"sentence":"Fishermen often target drumfish in the coastal waters.","translation":"漁師は沿岸海域でよくドラムフィッシュを狙います。","type":"noun","meaning_category":"イシモチ科の魚"},{"sentence":"The chef prepared a delicious dish using drumfish.","translation":"シェフはドラムフィッシュを使った美味しい料理を作りました。","type":"noun","meaning_category":"オオニベ"}]}