{"word":"decentration","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"脱中心化、自己中心性からの脱却、客観視","english_definition":"The ability to consider multiple aspects of a situation; the ability to move away from an egocentric viewpoint.","examples":[{"sentence":"Decentration is a key aspect of cognitive development.","translation":"脱中心化は認知発達の重要な側面です。"},{"sentence":"The child's increasing decentration allowed them to understand different perspectives.","translation":"子供の脱中心化が進むにつれて、異なる視点を理解できるようになりました。"},{"sentence":"Successful negotiation requires decentration and empathy.","translation":"交渉を成功させるには、脱中心化と共感が必要です。"}],"collocations":["cognitive decentration (認知的な脱中心化)","social decentration (社会的な脱中心化)","develop decentration (脱中心化を発達させる)","achieve decentration (脱中心化を達成する)"],"synonyms":["objectivity","perspective-taking","cognitive flexibility","empathy","impartiality"],"antonyms":["egocentrism","centration","subjectivity","bias","self-centeredness"]},{"part_of_speech":"noun","definition":"（哲学・心理学における）自己中心性からの解放、自己の視点に固執しないこと","english_definition":"In philosophy and psychology, the process of moving away from a self-centered perspective and considering other viewpoints.","examples":[{"sentence":"Through decentration, individuals can overcome biases and prejudices.","translation":"脱中心化を通じて、個人は偏見や先入観を克服できます。"},{"sentence":"Decentration is essential for moral reasoning and ethical decision-making.","translation":"脱中心化は、道徳的な推論や倫理的な意思決定に不可欠です。"},{"sentence":"The therapist helped the patient develop decentration skills to improve their relationships.","translation":"セラピストは、患者が人間関係を改善するために脱中心化のスキルを身につけるのを支援しました。"}],"collocations":["develop decentration skills (脱中心化のスキルを身につける)","practice decentration (脱中心化を実践する)","promote decentration (脱中心化を促進する)","foster decentration (脱中心化を育む)"],"synonyms":["self-transcendence","detachment","impartiality","open-mindedness","altruism"],"antonyms":["narcissism","self-absorption","prejudice","intolerance","dogmatism"]}],"etymology":{"value":"Formed from 'de-' (meaning 'away from' or 'reversal of') and 'centration' (referring to a focus on one aspect or viewpoint). The term originates from developmental psychology, particularly the work of Jean Piaget.","priority":"★★☆"},"pronunciation":{"ipa":"/diːˌsɛnˈtreɪʃən/","syllables":"de-cen-tra-tion"},"inflection":{"noun_plural":"decentrations"},"usage_notes":{"explanation":"'Decentration' refers to the cognitive ability to consider multiple aspects of a problem or situation, rather than focusing solely on one aspect (centration). It also describes the ability to move away from an egocentric perspective and consider the viewpoints of others. This concept is particularly important in developmental psychology, where it marks a key stage in a child's cognitive growth. In philosophy and broader social contexts, decentration is valued as a means to overcome biases and promote understanding and empathy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The opposite of decentration is concentration.","correct":"✓ The opposite of decentration is centration or egocentrism.","note":"'Concentration' refers to focusing attention, while 'centration' (in Piaget's theory) and 'egocentrism' refer to focusing on a single aspect or viewpoint. 'Egocentrism' also implies an inability to see other perspectives."},{"incorrect":"✗ Decentration means being indecisive.","correct":"✓ Decentration means considering multiple perspectives before making a decision.","note":"Decentration involves considering various aspects, not lacking decisiveness. It promotes well-rounded decision-making."}],"priority":"★★☆"},"related_words":{"derivatives":["decentrate (verb: to move away from a central focus)","decentered (adjective: not focused on a single point)"],"related_concepts":["centration (focusing on one aspect)","egocentrism (self-centeredness)","perspective-taking (understanding others' viewpoints)","cognitive development (the development of cognitive abilities)","Piaget's theory of cognitive development (a theory explaining stages of cognitive growth)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic and professional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Decentration' is a term primarily used in psychology, philosophy, and education. It refers to the ability to think about multiple aspects of a situation or problem, rather than focusing on just one. It also means being able to understand that other people may have different perspectives than you do. It is an important concept for understanding cognitive development and social interactions. You'll most likely encounter this word in academic texts or discussions related to these fields."},"example_sentences":[{"sentence":"The therapist worked with the patient to develop **decentration** techniques to improve their interpersonal relationships.","translation":"セラピストは、患者が対人関係を改善するために、脱中心化のテクニックを開発するのを支援しました。","type":"noun","meaning_category":"脱中心化（人間関係）"},{"sentence":"**Decentration** allows children to understand that others may have different thoughts and feelings than they do.","translation":"脱中心化によって、子供たちは他者が自分とは異なる考えや感情を持っている可能性があることを理解できます。","type":"noun","meaning_category":"脱中心化（認知発達）"},{"sentence":"Effective leadership requires **decentration**, empathy, and the ability to consider multiple perspectives.","translation":"効果的なリーダーシップには、脱中心化、共感、そして複数の視点を考慮する能力が必要です。","type":"noun","meaning_category":"脱中心化（リーダーシップ）"}]}