{"word":"Apostille","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アポスティーユ：外国公文書の認証を不要とするハーグ条約に基づく外務省の証明","english_definition":"A certificate issued by a designated authority in a country, certifying that a document is a true copy of an original and that the signature, seal, and position of the person who signed the document are genuine. It is used to authenticate documents for use in foreign countries that are parties to the Hague Convention Abolishing the Requirement of Legalisation for Foreign Public Documents.","examples":[{"sentence":"To use the birth certificate in Spain, you'll need an Apostille.","translation":"出生証明書をスペインで使用するには、アポスティーユが必要です。"},{"sentence":"The lawyer obtained an Apostille for the notarized document.","translation":"弁護士は、公証された文書のアポスティーユを取得しました。"}],"collocations":["obtain an Apostille","issue an Apostille","request an Apostille","Apostille certificate","Apostille Convention","Hague Apostille Convention"],"synonyms":["authentication","legalization","certification"],"antonyms":[]}],"etymology":{"value":"フランス語の「apostille」から派生。これは古フランス語の「postille」（注釈、追記）に由来し、ラテン語の「postilla」（後に書かれたもの、追記）から来ています。元々は文書の末尾に追加された注釈や追記を意味していましたが、後に文書の真正性を証明する認証を指すようになりました。","priority":"★★☆"},"pronunciation":{"ipa":"/əˈpɒstiːl/","syllables":"a-pos-tille"},"inflection":{"noun_plural":"Apostilles"},"usage_notes":{"explanation":"「**Apostille**」は、ハーグ条約加盟国間で、公文書の認証手続きを簡略化するために用いられる証明書です。ある国の公文書（例：出生証明書、婚姻証明書、卒業証明書など）を別のハーグ条約加盟国で使用する際に、通常必要となる領事認証の代わりに、このアポスティーユを添付することで、その文書が正式なものであることを証明できます。アポスティーユは、文書の発行国の権限のある機関（通常は外務省）によって発行されます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to apostle my birth certificate.","correct":"✓ I need to get an Apostille for my birth certificate. / ✓ I need to have my birth certificate apostilled.","note":"「Apostille」は名詞であり、動詞として直接使用することは一般的ではありません。アポスティーユを取得する、または文書にアポスティーユを付与してもらう、という表現を使います。"},{"incorrect":"✗ The apostle is required for all international documents.","correct":"✓ An Apostille is required for documents used in Hague Convention countries.","note":"「apostle」は「使徒」という意味であり、「Apostille」とは全く異なる単語です。また、アポスティーユはすべての国際文書に必要なわけではなく、ハーグ条約加盟国で使用される公文書に適用されます。"},{"incorrect":"✗ Apostille is a type of visa.","correct":"✓ Apostille is a type of document authentication.","note":"アポスティーユはビザ（査証）ではありません。文書の認証の一種です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Hague Convention","legalization","authentication","notarization","consular authentication"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 特定の分野（法律、国際関係）でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Apostille**」は、国際的な文書認証に関する専門用語です。ハーグ条約によって定められた手続きで、ある国で発行された公文書が、別のハーグ条約加盟国で法的効力を持つことを証明するために使われます。例えば、海外で学校に入学したり、結婚したり、ビジネスを始めたりする際に、出生証明書や卒業証明書などの公文書にアポスティーユが必要になることがあります。これは、文書の信頼性を保証するための国際的な取り決めです。法律や国際関係の分野でよく使われる言葉なので、一般的には馴染みが薄いかもしれません。"},"example_sentences":[{"sentence":"She needed an **Apostille** for her marriage certificate to use it in Italy.","translation":"彼女はイタリアで婚姻証明書を使用するために、アポスティーユが必要だった。","type":"noun","meaning_category":"証明"},{"sentence":"The government agency is responsible for issuing **Apostilles**.","translation":"政府機関はアポスティーユの発行を担当している。","type":"noun","meaning_category":"証明"},{"sentence":"Make sure to check if the country requires an **Apostille** on your documents.","translation":"あなたの書類にアポスティーユが必要かどうか確認してください。","type":"noun","meaning_category":"証明"}]}