{"word":"speaker-centered","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"話者中心の","english_definition":"Focusing on the speaker's perspective, needs, or characteristics.","examples":[{"sentence":"The traditional lecture format is often speaker-centered, with the professor delivering information to passive students.","translation":"伝統的な講義形式はしばしば話者中心であり、教授が受動的な学生に情報を提供する。"},{"sentence":"A speaker-centered approach to communication may neglect the audience's understanding or interests.","translation":"コミュニケーションにおける話者中心のアプローチは、聴衆の理解や興味を無視する可能性がある。"}],"collocations":["speaker-centered approach","speaker-centered instruction","speaker-centered communication"],"synonyms":["egocentric","self-focused","speaker-oriented"],"antonyms":["audience-centered","listener-centered"],"related_terms":["speaker","audience","communication","perspective"]}],"etymology":{"value":"Derived from the combination of 'speaker' and 'centered,' indicating a focus on the speaker.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈspiːkərˌsentərd/","syllables":"speak-er-cen-tered"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"'Speaker-centered' describes something that prioritizes the speaker's viewpoint, goals, or attributes. It's often used in discussions about communication, education, and rhetoric to contrast with approaches that emphasize the audience or listener.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The presentation was very speaker-centered, so the audience was bored.","correct":"The presentation was too speaker-centered, so the audience was bored.","note":"'Speaker-centered' is often used critically, implying an imbalance. Using 'too' emphasizes this imbalance."}],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Speaker-centered' is a term used in academic or professional contexts, particularly in discussions about communication, education, or rhetoric. It describes an approach that prioritizes the speaker's perspective, needs, or characteristics, often to the detriment of the audience or listener. Understanding this term requires familiarity with abstract concepts and nuanced communication strategies."},"example_sentences":[{"sentence":"The conference adopted a more speaker-centered format this year, with fewer opportunities for audience interaction.","translation":"今年の会議は、聴衆との交流の機会が減り、より話者中心の形式を採用した。","type":"general","meaning_category":"Focus on the speaker"},{"sentence":"Critics argued that the politician's speech was too speaker-centered and failed to address the concerns of the voters.","translation":"批評家たちは、その政治家の演説は話者中心すぎ、有権者の懸念に対処できていないと主張した。","type":"critical","meaning_category":"Negative focus on speaker"}]}