{"word":"transmittability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"伝達性、伝染性","english_definition":"The ability to be transmitted or passed on from one person or thing to another. Often used in the context of diseases.","examples":[{"sentence":"The high transmittability of the virus caused a rapid spread of the infection.","translation":"そのウイルスの高い伝染性が、感染の急速な拡大を引き起こした。"},{"sentence":"Scientists are studying the transmittability of the new variant.","translation":"科学者たちは、その新しい変異株の伝染性を研究している。"},{"sentence":"Factors such as hygiene and social distancing can affect the transmittability of a disease.","translation":"衛生状態やソーシャルディスタンスなどの要因は、病気の伝染性に影響を与える可能性がある。"}],"collocations":["high transmittability","low transmittability","increase transmittability","reduce transmittability","viral transmittability","disease transmittability"],"synonyms":["contagiousness","infectiousness","communicability","spreadability"],"antonyms":["non-transmittability","non-contagious","non-infectious"]}],"etymology":{"value":"Formed from 'transmit' + '-ability'. 'Transmit' comes from Latin 'transmittere', meaning 'to send across'. '-ability' is a suffix indicating the capacity or quality of something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtrænzmɪtəˈbɪləti/","syllables":"trans-mit-ta-bil-i-ty"},"inflection":{"noun_plural":"transmittabilities"},"usage_notes":{"explanation":"'Transmittability' is most commonly used in medical and scientific contexts to describe how easily a disease or virus can spread. It is a key factor in understanding and controlling epidemics and pandemics. The term is often used in discussions about public health measures and the effectiveness of different interventions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The transmittability is very high of the virus.","correct":"✓ The transmittability of the virus is very high.","note":"The correct word order is 'the transmittability of the virus' rather than inverting the phrase."},{"incorrect":"✗ Transmittability is a verb.","correct":"✓ Transmittability is a noun.","note":"'Transmittability' is a noun, not a verb. The verb form is 'transmit'."}],"priority":"★★☆"},"related_words":{"derivatives":["transmit (verb)","transmission (noun)","transmissible (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Transmittability' refers to how easily something, especially a disease, can be passed from one person to another. It's a term often used by scientists and doctors when they talk about how quickly a virus or illness can spread. Understanding transmittability helps in taking steps to prevent the spread of diseases, like washing hands or wearing masks. It's a key concept in public health.","priority":"★★★"},"example_sentences":[{"sentence":"The transmittability of the Omicron variant is significantly higher than that of previous strains.","translation":"オミクロン変異株の伝染性は、以前の株よりも大幅に高い。","type":"general","meaning_category":"伝染性"},{"sentence":"Reducing the transmittability of the disease is crucial to preventing a widespread outbreak.","translation":"病気の伝染性を減らすことは、広範囲な発生を防ぐために不可欠である。","type":"general","meaning_category":"伝染性"},{"sentence":"The study focused on the factors that influence the transmittability of the infection.","translation":"その研究は、感染の伝染性に影響を与える要因に焦点を当てた。","type":"scientific","meaning_category":"伝染性"}]}