{"word":"microspectroscope","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"顕微分光器","english_definition":"An instrument that combines a microscope and a spectroscope, used to analyze the spectrum of light from a microscopic sample.","examples":[{"sentence":"The microspectroscope was used to identify the composition of the tiny crystal.","translation":"その微小な結晶の組成を特定するために、顕微分光器が使用された。"},{"sentence":"Forensic scientists use microspectroscopes to analyze trace evidence.","translation":"法科学者は、微量の証拠を分析するために顕微分光器を使用する。"}],"collocations":["use a microspectroscope","analyze with a microspectroscope","microspectroscopic analysis"],"synonyms":["spectromicroscope"],"antonyms":[]},{"part_of_speech":"noun","definition":"(古語)顕微鏡と分光器を組み合わせた初期の装置","english_definition":"(historical) An early instrument combining a microscope and spectroscope.","examples":[{"sentence":"Early microspectroscopes were difficult to use but provided valuable information.","translation":"初期の顕微分光器は使いにくかったが、貴重な情報を提供した。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'micro-' (small) + 'spectroscope' (an instrument for producing and observing spectra).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪkroʊˈspektrəˌskoʊp/","syllables":"mi-cro-spec-tro-scope"},"inflection":{"noun_plural":"microspectroscopes"},"usage_notes":{"explanation":"A microspectroscope is a specialized instrument used to obtain spectra from very small samples. It is commonly used in forensic science, materials science, and biology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used the microspectroscope to see the cells.","correct":"✓ I used the microspectroscope to analyze the light from the cells.","note":"A microspectroscope is used to analyze light, not to directly view objects like a microscope."}],"priority":"★★☆"},"related_words":{"derivatives":["microspectroscopy (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'microspectroscope' is a technical term used in scientific contexts. It refers to an instrument that combines the functions of a microscope and a spectroscope to analyze the spectral properties of microscopic samples. Understanding this word requires knowledge of both microscopy and spectroscopy.","priority":"★★☆"},"example_sentences":[{"sentence":"The **microspectroscope** allowed for the precise identification of pigments in the ancient manuscript.","translation":"その顕微分光器は、古代の原稿に含まれる色素の正確な特定を可能にした。","type":"noun","meaning_category":"instrument"},{"sentence":"**Microspectroscope** analysis confirmed the presence of lead in the paint sample.","translation":"顕微分光器による分析で、塗料サンプル中の鉛の存在が確認された。","type":"noun","meaning_category":"analysis"}]}