{"word":"enaltecerse","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(再帰動詞) 高ぶる、自尊心を高める、得意になる","english_definition":"(reflexive verb) to become proud, to become conceited, to praise oneself.","examples":[{"sentence":"No debes enaltecerte por tus logros, la humildad es importante.","translation":"You shouldn't become conceited about your achievements, humility is important.","type":"example"},{"sentence":"Se enalteció al recibir el premio.","translation":"He became proud upon receiving the award.","type":"example"}],"collocations":["enaltecerse por algo (to become proud of something)"],"synonyms":["engreírse","vanagloriarse","jactarse"],"antonyms":["humillarse","abajarse"],"related_words":["enaltecer (to praise, to exalt)","enaltecimiento (praise, exaltation)"]}],"etymology":{"value":"Derived from 'enaltecer' (to praise, to exalt) with the reflexive pronoun 'se'. 'Enaltecer' comes from 'en-' (prefix indicating putting into) + 'alto' (high) + '-ecer' (suffix indicating a process of becoming).","priority":"N/A"},"pronunciation":{"ipa":"/enalteˈθeɾse/ (Spain), /enalteˈseɾse/ (Latin America)","notes":"Pronunciation varies slightly between Spain and Latin America, particularly in the pronunciation of the 'c' before 'e'."},"inflection":{"verb_forms":{"infinitive":"enaltecerse","gerund":"enalteciéndose","participle":"enaltecido"}},"usage_notes":{"explanation":"'Enaltecerse' is a reflexive verb, meaning the action is performed by the subject upon themselves. It implies an increase in one's own pride or self-esteem, often to an excessive degree. It can carry a negative connotation, suggesting arrogance or vanity.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Yo enaltezo.","correct":"Yo me enaltezco.","note":"Since it is a reflexive verb, the reflexive pronoun ('me', 'te', 'se', 'nos', 'os', 'se') is required."}],"priority":"N/A"},"level_frequency":{"level":"B2-C1","notes":"The verb is not very common in everyday speech, but it is used in literature and formal contexts.","priority":"N/A"},"readability_explanation":{"level":"Advanced","text":"'Enaltecerse' is a reflexive verb that means to become proud or conceited, often in an excessive or arrogant way. It's important to remember to use the reflexive pronoun ('me', 'te', 'se', etc.) with this verb. The word is not commonly used in everyday conversation but may appear in more formal or literary contexts."}}