{"word":"bigamist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"重婚者","english_definition":"a person who commits bigamy","examples":[{"sentence":"He was exposed as a bigamist when his two wives met.","translation":"彼の2人の妻が出会ったとき、彼は重婚者であることが暴露された。"},{"sentence":"The bigamist was arrested and charged with two counts of marriage fraud.","translation":"その重婚者は逮捕され、2件の結婚詐欺で起訴された。"}],"collocations":["convicted bigamist","serial bigamist","accused bigamist"],"synonyms":["polygamist (more general term)"],"antonyms":["monogamist"],"related_words":["bigamy"]}],"etymology":{"value":"From 'bigamy' + '-ist'. 'Bigamy' comes from Medieval Latin 'bigamia', from Late Greek 'bigamos' ('twice married'), from 'bi-' ('two') + 'gamos' ('marriage').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɪɡəmɪst/","syllables":"bi-ga-mist"},"inflection":{"noun_plural":"bigamists"},"usage_notes":{"explanation":"A 'bigamist' is specifically someone who is married to two people at the same time. It is illegal in many countries. The term 'polygamist' is a broader term that refers to someone who has multiple spouses, which could be more than two.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is a bigamist because he has many girlfriends.","correct":"He is not a bigamist, but he is unfaithful.","note":"Bigamy specifically refers to being married to more than one person at the same time, not just having multiple romantic partners."}],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bigamist' refers to someone who is married to two people simultaneously, which is illegal in many places. It's not a common word in everyday conversation but appears in legal contexts or discussions about marriage and relationships. It's important to understand the legal and ethical implications of bigamy to fully grasp the meaning of this word."},"example_sentences":[{"sentence":"The detective discovered that the man was a bigamist, married to two women in different cities.","translation":"刑事はその男が重婚者で、異なる都市の2人の女性と結婚していることを発見した。","type":"general","meaning_category":"重婚者"},{"sentence":"She realized she was married to a bigamist when she found his other marriage certificate.","translation":"彼女は彼の別の婚姻証明書を見つけたとき、自分が重婚者と結婚していることに気づいた。","type":"general","meaning_category":"重婚者"}]}