{"word":"inFares","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(鉄道、バスなどの)運賃収入","english_definition":"The revenue generated from fares collected on public transportation systems such as trains and buses.","examples":[{"sentence":"The inFares for the month were higher than expected due to increased ridership.","translation":"乗客数の増加により、今月の運賃収入は予想を上回った。"},{"sentence":"A portion of the inFares is allocated to maintenance and operational costs.","translation":"運賃収入の一部は、メンテナンス費用と運営費用に割り当てられる。"}],"collocations":["monthly inFares","annual inFares","total inFares","increase in inFares","decrease in inFares"],"synonyms":["fare revenue","ticket sales","passenger revenue"],"antonyms":["operating costs","expenses"]}],"etymology":{"value":"A combination of 'in' (referring to income or revenue) and 'fares' (the money paid for transportation).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈfeərz/","syllables":"in-Fares"},"inflection":{"noun_plural":"inFares"},"usage_notes":{"explanation":"'inFares' is a specific term used in the context of public transportation finance. It refers to the total amount of money collected from passenger fares. It's often used in financial reports and discussions related to transportation budgets and revenue.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The inFares are used to pay salaries and buy new buses.","correct":"✓ The inFares are used to pay salaries and buy new buses.","note":"'inFares' is already plural, referring to the total revenue from fares. No need to make it plural again."}],"priority":"★★☆"},"related_words":{"derivatives":["fare","revenue","income","transportation","ridership"],"phrases":["fare box","revenue stream","public transport"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specialized contexts related to transportation finance.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'inFares' is a technical term primarily used in the context of public transportation finance. It refers to the total income generated from passenger fares. Understanding this term requires familiarity with financial vocabulary and the operations of public transportation systems. It is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The city's public transportation system relies heavily on inFares to cover its operational expenses.","translation":"その都市の公共交通システムは、運営費を賄うために運賃収入に大きく依存している。","type":"noun","meaning_category":"運賃収入"},{"sentence":"A decline in ridership has resulted in a significant drop in inFares.","translation":"乗客数の減少により、運賃収入が大幅に減少した。","type":"noun","meaning_category":"運賃収入"},{"sentence":"The transportation authority is exploring ways to increase inFares without raising ticket prices.","translation":"交通局は、チケット価格を上げずに運賃収入を増やす方法を模索している。","type":"noun","meaning_category":"運賃収入"}]}