{"word":"loppering","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(gardening) to cut away the unwanted branches or stems from (a tree or bush); to lop.","english_definition":"Present participle of the verb 'to lopper', meaning to cut away unwanted branches or stems from a tree or bush.","examples":[{"sentence":"He was loppering the apple tree to encourage more fruit.","translation":"彼はより多くの実がなるようにリンゴの木の枝を剪定していた。"},{"sentence":"She spent the afternoon loppering the overgrown hedge.","translation":"彼女は午後の時間を伸びすぎた生垣の剪定に費やした。"}],"collocations":["loppering branches","loppering trees","loppering hedges"],"synonyms":["pruning","trimming","cutting back","shearing"],"antonyms":["letting grow","allowing to spread"]}],"etymology":{"value":"Derived from the verb 'to lopper', which comes from 'lop', meaning to cut off branches. The suffix '-ing' indicates the present participle form of the verb.","priority":"★★★"},"pronunciation":{"ipa":"/ˈlɒpərɪŋ/","syllables":"lop-per-ing"},"inflection":{"verb_forms":{"present_participle":"loppering"}},"usage_notes":{"explanation":"'Loppering' is the present participle form of the verb 'to lopper', which is a less common variant of 'to lop'. It specifically refers to the action of cutting away branches or stems from trees or bushes, often in a gardening context. It implies a more deliberate and possibly heavier pruning than simply 'trimming'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The loppering was done by a professional.","correct":"✓ The lopping was done by a professional.","note":"'Loppering' is the action of cutting, while 'lopping' can be used as a noun to describe the act of cutting branches. Using 'lopping' as a noun is more common."},{"incorrect":"✗ He is loppering the grass.","correct":"✓ He is mowing the grass.","note":"'Loppering' is specifically for cutting branches and stems of trees and bushes, not for cutting grass. 'Mowing' is the correct term for cutting grass."}],"priority":"★★☆"},"related_words":{"derivatives":["lopper (noun: a tool for loppering)","lop (verb: to cut off branches)","lopping (noun: the act of cutting off branches)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (not commonly found in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Loppering' is a specialized term used in gardening and forestry. It refers to the activity of cutting away branches or stems from trees and bushes. This term is less common than 'pruning' or 'trimming', and its understanding requires some familiarity with gardening practices. It is typically encountered in texts related to horticulture, landscaping, or forestry. The '-ing' suffix indicates that it is the present participle form of the verb, describing an ongoing action."},"example_sentences":[{"sentence":"She was carefully loppering the rose bushes to improve their shape.","translation":"彼女はバラの木の形を整えるために注意深く剪定していた。","type":"verb","meaning_category":"gardening"},{"sentence":"The sound of loppering echoed through the orchard.","translation":"果樹園には剪定の音が響き渡っていた。","type":"verb","meaning_category":"gardening"},{"sentence":"He enjoys loppering in the garden.","translation":"彼は庭での剪定を楽しんでいる。","type":"verb","meaning_category":"gardening"}]}