{"word":"all-prolific","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"非常に多産な、あらゆる面で多産な","english_definition":"Extremely prolific in all aspects; producing abundantly in every way.","examples":[{"sentence":"The all-prolific artist created masterpieces in painting, sculpture, and music.","translation":"そのあらゆる面で多産な芸術家は、絵画、彫刻、音楽で傑作を生み出した。"},{"sentence":"Her all-prolific writing career spanned multiple genres and earned her numerous awards.","translation":"彼女のあらゆる面で多産な作家としてのキャリアは、複数のジャンルに及び、数々の賞を獲得した。"}],"collocations":["all-prolific artist","all-prolific writer","all-prolific creator"],"synonyms":["highly productive","extremely fruitful","abundantly creative","versatile and prolific"],"antonyms":["unproductive","sterile","limited","narrow"],"notes":"This word is a compound adjective, emphasizing prolificacy across various domains."}],"etymology":{"value":"Combination of \"all\" (meaning in every respect) and \"prolific\" (meaning producing much fruit or foliage or many offspring).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːl prəˈlɪfɪk/","syllables":"all-pro-lif-ic"},"inflection":{"notes":"Adjective, does not inflect"},"usage_notes":{"explanation":"'All-prolific' is used to describe someone or something that is not only prolific but also demonstrates prolificacy in a wide range of areas or aspects. It suggests a comprehensive and abundant output.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company was all-prolific in one area.","correct":"✓ The company was prolific in one area.","note":"'All-prolific' implies prolificacy across multiple areas, so using it to describe a single area is incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["prolific","prolifically","prolificacy"],"related_terms":["multi-talented","versatile","omnific"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized or literary usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'all-prolific' is a relatively uncommon and sophisticated adjective used to describe someone or something that is exceptionally productive and creative across a wide range of areas or domains. It is more often found in formal writing or specialized contexts where there is a need to emphasize comprehensive and abundant output. Understanding this term requires a good grasp of both 'all' and 'prolific' and the ability to combine their meanings to create a nuanced description."},"example_sentences":[{"sentence":"The all-prolific inventor patented hundreds of devices in various fields.","translation":"そのあらゆる面で多産な発明家は、様々な分野で数百ものデバイスの特許を取得した。","type":"adjective","meaning_category":"多産な"},{"sentence":"Her all-prolific career included writing novels, composing music, and directing films.","translation":"彼女のあらゆる面で多産なキャリアには、小説の執筆、作曲、映画監督が含まれていた。","type":"adjective","meaning_category":"多産な"}]}