{"word":"weight-affected","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Influenced or changed by weight, either positively or negatively.","english_definition":"Having been influenced or changed by weight, either positively or negatively.","examples":[{"sentence":"The study examined weight-affected health outcomes in elderly patients.","translation":"その研究では、高齢患者における体重の影響を受けた健康状態の結果を調査した。"},{"sentence":"The weight-affected performance of the bridge was a key concern for the engineers.","translation":"橋の重量の影響を受けた性能は、エンジニアにとって重要な懸念事項だった。"}],"collocations":["weight-affected health","weight-affected performance","weight-affected outcomes"],"synonyms":["weight-influenced","weight-dependent"],"antonyms":["weight-independent","weight-unaffected"]}],"etymology":{"value":"Combination of 'weight' and 'affected'. 'Weight' refers to the heaviness of an object or person. 'Affected' means influenced or changed by something.","priority":"N/A"},"pronunciation":{"ipa":"/ˈweɪt əˌfɛktɪd/","syllables":"weight-af-fect-ed"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Weight-affected' is a descriptive adjective often used in scientific or technical contexts to indicate that a particular characteristic, outcome, or performance is influenced by the weight of something. It can refer to both positive and negative influences.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The weight affected the structure.","correct":"The structure was weight-affected.","note":"'Weight-affected' is an adjective, so it should describe a noun, not act as a verb."}],"priority":"N/A"},"related_words":{"derivatives":["weight","affect","affected"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'weight-affected' is a technical adjective used to describe something that has been influenced or changed by weight. It is commonly found in scientific or engineering contexts where the impact of weight on a system or outcome is being discussed. The term is relatively straightforward in its meaning, but its use is typically confined to specialized fields."},"example_sentences":[{"sentence":"The weight-affected lifespan of the tires was shorter than expected.","translation":"タイヤの重量の影響を受けた寿命は予想よりも短かった。","type":"adjective","meaning_category":"influenced by weight"},{"sentence":"The weight-affected fuel efficiency of the vehicle was a significant factor.","translation":"車両の重量の影響を受けた燃料効率は重要な要素だった。","type":"adjective","meaning_category":"influenced by weight"}]}