{"word":"VASI","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"進入角指示灯 (Visual Approach Slope Indicator)","english_definition":"A system of lights arranged to provide visual descent guidance information during an approach to a runway.","examples":[{"sentence":"The VASI indicated that the aircraft was too low on approach.","translation":"VASIは、航空機が進入時に低すぎることを示していた。"},{"sentence":"Pilots rely on the VASI to maintain the correct glide path.","translation":"パイロットは正しいグライドパスを維持するためにVASIに頼っている。"}],"collocations":["VASI lights","VASI system","check the VASI","use the VASI","VASI angle"],"synonyms":["PAPI (Precision Approach Path Indicator)"],"antonyms":[]}],"etymology":{"value":"An acronym for Visual Approach Slope Indicator.","priority":"★★★"},"pronunciation":{"ipa":"/ˈveɪzi/","syllables":"VAY-zee"},"inflection":{"notes":"Plural: VASIs"},"usage_notes":{"explanation":"VASI is an airport lighting system that provides a visual indication of the correct approach slope to a runway. It uses combinations of red and white lights to signal whether the aircraft is on, above, or below the proper glide path. It is a less precise system than PAPI (Precision Approach Path Indicator).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The VASI were not working.","correct":"✓ The VASI was not working.","note":"When referring to the entire system as a unit, use the singular form 'VASI' with a singular verb. If referring to individual units, use the plural form 'VASIs'."},{"incorrect":"✗ He used the VASI's to land.","correct":"✓ He used the VASI to land.","note":"'VASI' is already plural in concept as it refers to a system of multiple lights. Do not add an extra 's' to make it possessive."}],"priority":"★★☆"},"related_words":{"derivatives":[],"acronyms":["PAPI (Precision Approach Path Indicator)","ALS (Approach Lighting System)","REIL (Runway End Identifier Lights)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to aviation contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"VASI (Visual Approach Slope Indicator) is a technical term used in aviation. It refers to a system of lights at an airport that helps pilots visually determine the correct angle of descent when approaching a runway. The lights display different colors (usually red and white) depending on the aircraft's position relative to the ideal glide path. Understanding VASI is important for pilots and those involved in air traffic control.","priority":"★★★"},"example_sentences":[{"sentence":"The pilot adjusted the aircraft's descent based on the VASI indications.","translation":"パイロットはVASIの指示に基づいて航空機の降下を調整した。","type":"general","meaning_category":"aviation"},{"sentence":"The VASI system is a crucial aid for safe landings, especially in low visibility conditions.","translation":"VASIシステムは、特に視界不良の状況下での安全な着陸のための重要な補助手段である。","type":"general","meaning_category":"aviation"},{"sentence":"Before landing, the co-pilot confirmed the correct VASI configuration.","translation":"着陸前に、副操縦士は正しいVASI構成を確認した。","type":"technical","meaning_category":"aviation"}]}