{"word":"littlenesses","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ささいなこと、些細なこと柄、つまらないこと、狭量、心の狭さ","english_definition":"The quality or state of being little; triviality; pettiness; meanness of spirit.","examples":[{"sentence":"He was bothered by the littlenesses of everyday life.","translation":"彼は日常生活の些細なことに悩まされていた。"},{"sentence":"She couldn't stand the littlenesses of her coworkers.","translation":"彼女は同僚たちの心の狭さに我慢できなかった。"},{"sentence":"Don't focus on the littlenesses; look at the bigger picture.","translation":"些細なことに気を取られず、もっと大きな全体像を見なさい。"}],"collocations":["everyday littlenesses (日々の些細なこと)","petty littlenesses (つまらないこと)","avoid the littlenesses (些細なことを避ける)"],"synonyms":["trivialities","pettinesses","insignificance","meanness","narrow-mindedness"],"antonyms":["magnanimity","generosity","importance","significance"]}],"etymology":{"value":"The word 'littlenesses' is derived from 'little' + '-ness' (suffix denoting a state or quality) + '-es' (plural suffix). 'Little' comes from Old English 'lȳtel', meaning 'small'. The suffix '-ness' transforms the adjective 'little' into the noun 'littleness', referring to the state or quality of being little. The plural form 'littlenesses' refers to multiple instances or aspects of this state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪtəlnəsɪz/","syllables":"lit-tle-ness-es"},"inflection":{"noun_plural":"littlenesses"},"usage_notes":{"explanation":"'Littlenesses' is a somewhat uncommon word, often used to describe the petty, insignificant, or mean aspects of something, whether it be a person's character, a situation, or everyday life. It often carries a negative connotation, suggesting that these small things are undesirable or bothersome.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The littleness are annoying.","correct":"✓ The littlenesses are annoying.","note":"'Littlenesses' is a plural noun, so it requires a plural verb ('are')."},{"incorrect":"✗ He focused on the littleness instead of the big picture.","correct":"✓ He focused on the littlenesses instead of the big picture.","note":"When referring to multiple trivial aspects, use the plural form 'littlenesses'."}],"priority":"★★☆"},"related_words":{"derivatives":["little (adjective)","littleness (noun - singular)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'littlenesses' is a relatively uncommon and abstract noun. It refers to the multiple instances or aspects of something being trivial, petty, or insignificant. Understanding this word requires a good grasp of abstract concepts and the ability to recognize the nuances of language. It is more likely to be encountered in formal writing or sophisticated discussions. "},"example_sentences":[{"sentence":"She tried to ignore the daily littlenesses that irritated her.","translation":"彼女は自分をイライラさせる日々の些細なことを無視しようとした。","type":"noun","meaning_category":"trivialities"},{"sentence":"He was a man who was not concerned with the littlenesses of life.","translation":"彼は人生の些細なことにこだわらない男だった。","type":"noun","meaning_category":"insignificance"},{"sentence":"The project was bogged down by the littlenesses of bureaucratic procedures.","translation":"そのプロジェクトは官僚的な手続きの些細なことで行き詰まってしまった。","type":"noun","meaning_category":"pettinesses"}]}