{"word":"belt-cutting","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(武道)段位剥奪、降格","english_definition":"The act of demoting someone in martial arts by removing their belt, signifying a loss of rank.","examples":[{"sentence":"The sensei performed a belt-cutting ceremony after the student's repeated misconduct.","translation":"先生は生徒の度重なる不正行為の後、段位剥奪の儀式を行った。"}],"collocations":["perform a belt-cutting","undergo belt-cutting"],"synonyms":["demotion","degradation","stripping of rank"],"antonyms":["promotion","ranking up"]},{"part_of_speech":"noun","definition":"(比喩)大幅な削減、特に予算や人員の削減","english_definition":"A significant reduction, especially in budget or personnel.","examples":[{"sentence":"The company announced belt-cutting measures to avoid bankruptcy.","translation":"会社は倒産を避けるために大幅な削減策を発表した。"}],"collocations":["implement belt-cutting","announce belt-cutting","face belt-cutting"],"synonyms":["downsizing","cost-cutting","retrenchment"],"antonyms":["expansion","growth","investment"]}],"etymology":{"value":"Derived from the literal act of cutting a martial arts belt to signify demotion. The metaphorical sense extends from this to represent any significant reduction or loss.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbeltˌkʌtɪŋ/","syllables":"belt-cut-ting"},"inflection":{"noun_plural":"belt-cuttings"},"usage_notes":{"explanation":"The term 'belt-cutting' is primarily used in two contexts: martial arts and business/economics. In martial arts, it refers to the actual or symbolic act of removing a belt to indicate demotion. In business, it's a metaphor for significant reductions, often implying a drastic measure to save money or resources. The metaphorical use is less common than terms like 'downsizing' or 'cost-cutting'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The belt-cutting was happy for the company.","correct":"✓ The belt-cutting was necessary for the company.","note":"'Belt-cutting' is rarely associated with positive emotions. It's usually a difficult but necessary action. Using it with words like 'happy' is generally incorrect."}],"priority":"★☆☆"},"related_words":{"derivatives":["belt (noun)","cut (verb)","cost-cutting (noun)","downsizing (noun)"],"phrasal_verbs":["cut back (verb)","cut down (verb)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Belt-cutting' is a relatively uncommon term, primarily used in specific contexts. It's most literal meaning relates to martial arts, where it signifies demotion. More broadly, it's used as a metaphor for significant reductions, especially in business. Understanding the context is crucial for interpreting the intended meaning. It's not a term typically encountered in everyday conversation."},"example_sentences":[{"sentence":"The martial arts school rarely resorted to belt-cutting, preferring to work with students to improve their skills.","translation":"その武道学校は段位剥奪に頼ることはほとんどなく、生徒のスキル向上のために協力することを好んだ。","type":"noun","meaning_category":"Martial Arts Demotion"},{"sentence":"The government announced belt-cutting measures across all departments to address the budget deficit.","translation":"政府は予算赤字に対処するため、すべての部門で大幅な削減策を発表した。","type":"noun","meaning_category":"Budget Reduction"}]}