{"word":"pseudosoph","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A false or pretended philosopher; one who makes a show of wisdom without possessing it.","english_definition":"A person who pretends to be a philosopher or wise person, but lacks genuine understanding or knowledge.","examples":[{"sentence":"The critic dismissed the author as a pseudosoph, claiming his ideas were shallow and derivative.","translation":"批評家は、その著者のアイデアは浅薄で独創性がないと主張し、偽哲学者として退けた。"},{"sentence":"Beware of those pseudosophs who use complex language to mask their lack of real insight.","translation":"真の洞察力の欠如を隠すために複雑な言葉を使う偽哲学者に注意してください。"}],"collocations":["intellectual poseur","armchair philosopher","pretentious thinker"],"synonyms":["sophist","intellectual fraud","fake philosopher","sham sage"],"antonyms":["true philosopher","genuine sage","real thinker"]}],"etymology":{"value":"From the Greek words 'pseudo-' (false) and 'sophos' (wise).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsjuːdəˌsɒf/","syllables":"pseu-do-soph"},"inflection":{"noun_plural":"pseudosophs"},"usage_notes":{"explanation":"The term 'pseudosoph' is used to describe someone who affects philosophical or intellectual airs without possessing genuine wisdom or understanding. It often carries a negative connotation, implying that the person is pretentious or insincere.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He was a true pseudosoph, always seeking knowledge.","correct":"He was a pseudosoph, always seeking to appear knowledgeable.","note":"Pseudosophs are not genuinely interested in knowledge, but in appearing wise."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudosophy (false philosophy)"],"related_terms":["sophistry","philosopher","intellectual","poseur"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. The word is rare and primarily used in academic or critical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pseudosoph' is a rare and sophisticated term used to describe someone who falsely claims to be a philosopher or wise person. The word is typically found in academic or critical writing where the author wishes to express disdain for someone's intellectual pretensions. Understanding the word requires a good grasp of Greek prefixes and root words, as well as a familiarity with philosophical concepts."},"example_sentences":[{"sentence":"The talk was full of jargon, making the speaker sound like a mere pseudosoph.","translation":"講演は専門用語だらけで、講演者はただの偽哲学者にしか聞こえなかった。","type":"example","meaning_category":"pretender to wisdom"},{"sentence":"He was accused of being a pseudosoph because his theories lacked empirical evidence.","translation":"彼の理論には実証的な証拠が欠けていたため、彼は偽哲学者であると非難された。","type":"example","meaning_category":"lacking genuine understanding"}]}