{"word":"Elend","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"A fictional character in Brandon Sanderson's Mistborn series.","english_definition":"A central character in Brandon Sanderson's Mistborn series, known for his intelligence, idealism, and later, his Allomantic abilities.","examples":[{"sentence":"Elend Venture is a nobleman who becomes emperor in the Mistborn series.","translation":"エレンド・ベンチャーは、ミストボーンシリーズで皇帝になる貴族です。"}],"collocations":["Elend Venture","Lord Elend","Emperor Elend"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Elend' is likely derived from Brandon Sanderson's creative naming conventions within the Mistborn universe, possibly drawing inspiration from existing names or languages.","priority":"N/A"},"pronunciation":{"ipa":"/ˈiːlənd/","syllables":"E-lend"},"inflection":{},"usage_notes":{"explanation":"Elend is a significant character in the Mistborn series, undergoing substantial development from a philosophical nobleman to a capable leader and Allomancer.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":[],"related_characters":["Vin","Kelsier","Sazed"],"related_terms":["Allomancy","Mistborn","Final Empire"]},"level_frequency":{},"readability_explanation":{"level":"N/A","text":"This entry describes a fictional character, so readability is less relevant than understanding the context of the Mistborn series."},"example_sentences":[{"sentence":"Vin fell in love with Elend despite his initial naivete.","translation":"ヴィンは、エレンドの最初の頃の世間知らずなところにもかかわらず、彼に恋をした。","type":"character description","meaning_category":"character relationship"},{"sentence":"Elend's idealism often clashed with the pragmatism of the world he inhabited.","translation":"エレンドの理想主義は、彼が住んでいた世界の現実主義と衝突することが多かった。","type":"character trait","meaning_category":"character trait"},{"sentence":"Elend's transformation into a Mistborn was a pivotal moment in the series.","translation":"エレンドがミストボーンに変身したことは、シリーズの重要な瞬間だった。","type":"plot point","meaning_category":"plot development"}]}