{"word":"inoperability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"手術不能、手術不適応","english_definition":"the state of being unsuitable for surgery; the condition of not being able to be operated on.","examples":[{"sentence":"The inoperability of the tumor was determined after extensive testing.","translation":"広範な検査の結果、その腫瘍は手術不能と判断された。"},{"sentence":"Due to the patient's advanced age and other health complications, inoperability was a major concern.","translation":"患者の高齢と他の健康上の合併症のため、手術不能であることが大きな懸念事項であった。"}],"collocations":["tumor inoperability (腫瘍の手術不能)","surgical inoperability (外科的手術不能)","assess inoperability (手術不能を評価する)","determine inoperability (手術不能を決定する)"],"synonyms":["irresectability","unsuitability for surgery"],"antonyms":["operability","resectability","suitability for surgery"]},{"part_of_speech":"noun","definition":"作動不能、機能不全","english_definition":"the state of not being able to function or operate.","examples":[{"sentence":"The inoperability of the machine caused a significant delay in production.","translation":"機械の作動不能により、生産に大幅な遅延が生じた。"},{"sentence":"The system's inoperability was due to a software malfunction.","translation":"システムの機能不全は、ソフトウェアの誤動作が原因であった。"}],"collocations":["system inoperability (システムの作動不能)","machine inoperability (機械の作動不能)","equipment inoperability (設備の作動不能)","cause inoperability (作動不能を引き起こす)"],"synonyms":["malfunction","failure","non-functionality","breakdown"],"antonyms":["operability","functionality","operationality"]}],"etymology":{"value":"Derived from 'in-' (not), 'operable' (capable of being operated on or functioning), and '-ity' (state or condition).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪnˌɑːpərəˈbɪləti/","syllables":"in-op-er-a-bil-i-ty"},"inflection":{"noun_plural":"inoperabilities (rare)"},"usage_notes":{"explanation":"'Inoperability' is most commonly used in medical contexts to describe a condition where surgery is not a viable option, often due to the location, size, or nature of a tumor or other medical issue, or due to the patient's overall health. It can also be used more broadly to describe the state of a machine, system, or process that is not functioning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The doctor said the tumor was inoperable, so it had no operability.","correct":"The doctor said the tumor was inoperable, meaning it had no operability.","note":"'Inoperable' is an adjective describing the tumor, while 'inoperability' is a noun describing the state. The first sentence is grammatically awkward. The second sentence clarifies the meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["inoperable (adjective: not able to be operated on or function)","operate (verb: to perform surgery or control the functioning of a machine)","operation (noun: a surgical procedure or the functioning of something)","operability (noun: the state of being able to be operated on or function)"],"phrasal_verbs":[],"related_medical_terms":["resection","metastasis","prognosis","palliative care","chemotherapy","radiation therapy"],"related_technical_terms":["downtime","maintenance","troubleshooting","system failure","hardware failure","software failure"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in specialized medical and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Inoperability' is a formal term primarily used in medical and technical contexts. It refers to the state of something being unable to be operated on (e.g., a tumor) or unable to function (e.g., a machine). Due to its specialized nature, it's not commonly encountered in everyday language. Understanding requires a strong vocabulary and familiarity with formal and technical terminology."},"example_sentences":[{"sentence":"The patient's advanced heart disease led to the inoperability of the aortic aneurysm.","translation":"患者の進行した心臓病が、大動脈瘤の手術不能につながった。","type":"noun","meaning_category":"medical"},{"sentence":"The prolonged power outage caused the inoperability of the entire network.","translation":"長時間の停電により、ネットワーク全体の作動不能が発生した。","type":"noun","meaning_category":"technical"},{"sentence":"The doctor explained the inoperability of the condition and discussed alternative treatment options.","translation":"医師は病状の手術不能について説明し、代替治療法について話し合った。","type":"noun","meaning_category":"medical"}]}