{"word":"concept-influenced","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"概念の影響を受けた、概念に左右された","english_definition":"Influenced or shaped by a particular concept or idea.","examples":[{"sentence":"Her art is concept-influenced, focusing on themes of identity and memory.","translation":"彼女の芸術は概念の影響を受けており、アイデンティティと記憶のテーマに焦点を当てています。"},{"sentence":"The design of the building is concept-influenced, drawing inspiration from nature.","translation":"その建物のデザインは概念に左右されており、自然からインスピレーションを得ています。"},{"sentence":"The research is concept-influenced, guided by a specific theoretical framework.","translation":"その研究は概念の影響を受けており、特定の理論的枠組みによって導かれています."}],"collocations":["concept-influenced art","concept-influenced design","concept-influenced research","concept-influenced approach","concept-influenced thinking"],"synonyms":["concept-driven","concept-based","idea-influenced","idea-driven","theoretically influenced"],"antonyms":["data-driven","evidence-based","empirical","objective","unbiased"]}],"etymology":{"value":"Combines \"concept\" (an abstract idea) with \"influenced\" (affected by something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒnsept ˌɪnfluənst/","syllables":"con-cept in-flu-enced"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"\"Concept-influenced\" describes something that has been shaped or affected by a particular concept or idea. It suggests that the concept has played a significant role in the development or creation of the subject. It's often used in academic or artistic contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The concept influenced is important.","correct":"✓ The concept that influenced the design is important.","note":"\"Concept-influenced\" is an adjective and should be used to describe a noun. It cannot stand alone as a subject. Instead use a relative clause to describe the concept itself."},{"incorrect":"✗ The work is influenced by concept.","correct":"✓ The work is concept-influenced. / ✓ The work is influenced by a concept.","note":"The correct form is \"concept-influenced\" or \"influenced by a concept\". Using \"influenced by concept\" is grammatically incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["concept","influence","conceptual","conceptualize","conceptualization"],"phrases":["influenced by","based on a concept","driven by an idea"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Concept-influenced\" is a more advanced term used to describe something that has been significantly affected or shaped by a particular concept or idea. It's often used in academic or artistic contexts to indicate that a specific concept has played a key role in the development or creation of something. Understanding this term requires a good grasp of abstract concepts and how they can influence tangible things."},"example_sentences":[{"sentence":"The project's success was largely due to its concept-influenced approach.","translation":"プロジェクトの成功は、その概念に左右されたアプローチによるところが大きかった。","type":"adjective","meaning_category":"influenced by a concept"},{"sentence":"Her paintings are highly concept-influenced, exploring complex philosophical ideas.","translation":"彼女の絵画は非常に概念の影響を受けており、複雑な哲学的アイデアを探求している。","type":"adjective","meaning_category":"shaped by a concept"},{"sentence":"The architectural design is concept-influenced, reflecting the principles of sustainable living.","translation":"その建築デザインは概念の影響を受けており、持続可能な生活の原則を反映している。","type":"adjective","meaning_category":"guided by a concept"}]}