{"word":"Hemangiomas","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"血管腫（けっかんしゅ）：血管内皮細胞が増殖してできる良性腫瘍","english_definition":"Benign tumors resulting from the proliferation of blood vessel endothelial cells.","examples":[{"sentence":"Hemangiomas are common in infants.","translation":"血管腫は乳児によく見られます。"},{"sentence":"The doctor diagnosed the skin lesion as a hemangioma.","translation":"医師はその皮膚病変を血管腫と診断しました。"}],"collocations":["infantile hemangioma (乳児血管腫)","capillary hemangioma (毛細血管腫)","cavernous hemangioma (海綿状血管腫)"],"synonyms":["vascular tumor","angioma"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の 'haima' (血) + 'angeion' (血管) + '-oma' (腫瘍) に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːmændiˈoʊməs/","syllables":"he-man-gi-o-mas"},"inflection":{"noun_plural":"hemangiomas"},"usage_notes":{"explanation":"Hemangiomas are benign vascular tumors that can occur anywhere in the body, but are most commonly found on the skin. They are often present at birth or appear shortly thereafter. Most hemangiomas are small and resolve on their own, but some may require treatment if they are large, located in a sensitive area, or causing complications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a hemangioma on his liver, it's a cancer.","correct":"✓ He has a hemangioma on his liver; it is usually benign, but further investigation is needed.","note":"Hemangiomas are usually benign, not cancerous. However, any lesion requires proper diagnosis."}],"priority":"★☆☆"},"related_words":{"derivatives":["hemangioma (単数形)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hemangiomas' refers to benign tumors made of blood vessels. They are often found in infants and usually disappear without treatment. However, some cases may require medical intervention, especially if the hemangioma is large or in a sensitive location. The term is technical and most commonly used in medical contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The pediatrician reassured the parents that the infant's hemangioma was likely to resolve on its own.","translation":"小児科医は、乳児の血管腫はおそらく自然に治癒すると両親に安心させた。","type":"general","meaning_category":"medical condition"},{"sentence":"Laser therapy is sometimes used to treat hemangiomas.","translation":"レーザー治療は、血管腫の治療に用いられることがある。","type":"treatment","meaning_category":"medical treatment"}]}