{"word":"phraseologist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"成句研究家、慣用句研究家、語法研究家","english_definition":"A person who studies or specializes in phraseology, the study of set or fixed expressions, idioms, and collocations in language.","examples":[{"sentence":"The phraseologist analyzed the use of idioms in the novel.","translation":"その成句研究家はその小説における慣用句の使用を分析した。"},{"sentence":"Phraseologists contribute to dictionaries by identifying and defining common phrases.","translation":"成句研究家は、一般的なフレーズを特定し定義することで、辞書の作成に貢献する。"}],"collocations":["lexical phraseology","contrastive phraseology","phraseological unit","theoretical phraseology"],"synonyms":["lexicographer","linguist","idiom expert","language scholar"],"antonyms":[]}],"etymology":{"value":"The word \"phraseologist\" is derived from \"phraseology\" (the study of phrases) + \"-ist\" (a suffix denoting a person engaged in a particular activity or field of study). \"Phraseology\" comes from \"phrase\" + \"-ology\" (the study of).","priority":"★★★"},"pronunciation":{"ipa":"/freɪˈziːˈɒlədʒɪst/","syllables":"phrase-ol-o-gist"},"inflection":{"noun_plural":"phraseologists"},"usage_notes":{"explanation":"A phraseologist is a specialist in phraseology, which is a branch of linguistics concerned with the study of phrases, idioms, and other fixed expressions. They often work on dictionaries, language teaching materials, and linguistic research projects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good phrase.","correct":"✓ He is a good phraseologist.","note":"'Phrase' refers to a group of words, while 'phraseologist' refers to a person who studies phrases."}],"priority":"★☆☆"},"related_words":{"derivatives":["phraseology","phraseological","phraseologism"],"phrases":["lexical phraseology","contrastive phraseology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"phraseologist\" is a specialized term used within the field of linguistics. It refers to someone who studies phraseology, which is the study of set phrases, idioms, and other fixed expressions in a language. This term is not commonly used in everyday conversation and is more likely to be encountered in academic or professional contexts related to language studies."},"example_sentences":[{"sentence":"As a phraseologist, she specialized in the study of idioms in different languages.","translation":"成句研究家として、彼女は様々な言語の慣用句の研究を専門としていた。","type":"general","meaning_category":"Definition"},{"sentence":"The phraseologist's expertise was crucial in compiling the new dictionary of idioms.","translation":"その成句研究家の専門知識は、新しい慣用句辞典の編集において非常に重要だった。","type":"professional","meaning_category":"Professional Context"}]}