{"word":"puffily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"ふっくらと、膨らんで、または息を切らして","english_definition":"In a puffed-up or inflated manner; also, in a breathless way.","examples":[{"sentence":"The actor spoke puffily, exaggerating his words.","translation":"その俳優は大げさに言葉を膨らませて、ふっくらと話した。"},{"sentence":"She described the event puffily, trying to make it sound more important than it was.","translation":"彼女はイベントを実際よりも重要に聞こえるように、息を切らしながら説明した。"},{"sentence":"He breathed puffily after climbing the stairs.","translation":"彼は階段を上った後、息を切らして呼吸した。"}],"collocations":["breathe puffily","speak puffily","describe puffily"],"synonyms":["inflatedly","breathlessly","windedly","pompously","bombastically"],"antonyms":["flatly","modestly","humbly"]}],"etymology":{"value":"Derived from the adjective 'puffy' (swollen, inflated) with the addition of the adverbial suffix '-ly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʌfɪli/","syllables":"puf-fi-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Puffily' is used to describe something that is done in an exaggerated or inflated manner, either literally (e.g., breathing) or figuratively (e.g., speaking). It can also describe the state of being puffed up or swollen. The word often carries a negative connotation, suggesting pretentiousness or artificiality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bread rose puffily in the oven.","correct":"✓ The bread rose nicely in the oven.","note":"While 'puffily' can describe something inflated, it often implies exaggeration or artificiality. 'Nicely' or 'well' is more appropriate for describing bread rising. "},{"incorrect":"✗ She looked puffily after her nap.","correct":"✓ Her face looked puffy after her nap.","note":"'Puffily' is an adverb and modifies verbs. To describe someone's appearance, use the adjective 'puffy'."}],"priority":"★☆☆"},"related_words":{"derivatives":["puffy (adjective)","puff (noun, verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Puffily' is a relatively uncommon adverb that describes actions performed in a puffed-up, exaggerated, or breathless manner. It is most often used in descriptive writing to convey a sense of pretentiousness or labored effort. Because of its relatively low frequency and nuanced meaning, it is more likely to be encountered by advanced English learners. "},"example_sentences":[{"sentence":"The politician spoke puffily about his accomplishments, exaggerating their importance.","translation":"政治家は自分の業績について、その重要性を誇張して、大げさに語った。","type":"general","meaning_category":"exaggerated manner"},{"sentence":"He climbed the hill puffily, stopping frequently to catch his breath.","translation":"彼は息を切らしながら丘を登り、頻繁に立ち止まって息を整えた。","type":"general","meaning_category":"breathless manner"},{"sentence":"The critic reviewed the play puffily, using overly ornate language.","translation":"評論家は演劇を大げさな言葉を使って、誇張して批評した。","type":"general","meaning_category":"exaggerated language"}]}