{"word":"thegnhood","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) アングロサクソン時代の領主の地位、または領主の集団","english_definition":"(historical) The rank or body of thegns in Anglo-Saxon England. A thegn was a member of the aristocracy and a retainer of the king or a great lord.","examples":[{"sentence":"Membership of the thegnhood was based on land ownership and service to the king.","translation":"領主の地位は土地所有と国王への奉仕に基づいていました。"},{"sentence":"The thegnhood played an important role in local government and defense.","translation":"領主の集団は地方政府と防衛において重要な役割を果たしました。"}],"collocations":["member of the thegnhood","thegnhood system","Anglo-Saxon thegnhood"],"synonyms":["aristocracy","nobility","landowners","retainers"],"antonyms":["peasantry","serfdom"]}],"etymology":{"value":"Derived from the Old English word 'þegn' (also spelled 'thegn'), meaning 'servant, attendant, retainer'. The suffix '-hood' denotes a state, condition, or group.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈθeɪnˌhʊd/","syllables":"thegn-hood"},"inflection":{"noun_plural":"thegnhoods"},"usage_notes":{"explanation":"'Thegnhood' refers specifically to the social and political structure of Anglo-Saxon England. It describes the status and collective body of thegns, who were important figures in the kingdom, holding land and providing service to the king or other powerful lords. The term is primarily used in historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a thegnhood of the king.","correct":"✓ He was a thegn of the king.","note":"'Thegnhood' refers to the rank or body of thegns, not an individual. Use 'thegn' for an individual member."}],"priority":"★★☆"},"related_words":{"derivatives":["thegn (noun: an Anglo-Saxon nobleman or retainer)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized historical term)","frequency_google_ngram":"Very low frequency - primarily used in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Thegnhood' is a specialized historical term referring to the rank or body of thegns in Anglo-Saxon England. Understanding this term requires knowledge of Anglo-Saxon history and social structures. It is not commonly used in modern English outside of academic or historical contexts."},"example_sentences":[{"sentence":"The power of the thegnhood grew significantly during the reign of King Edgar.","translation":"エドガー王の治世中、領主の地位は著しく増大しました。","type":"noun","meaning_category":"historical rank"},{"sentence":"The thegnhood was responsible for maintaining order and collecting taxes in their local areas.","translation":"領主の集団は、それぞれの地域で秩序を維持し、税を徴収する責任がありました。","type":"noun","meaning_category":"historical group"}]}