{"word":"circumplication","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古用法)回りくどい言い方、冗長な表現","english_definition":"(archaic) A roundabout way of speaking; circumlocution.","examples":[{"sentence":"The speaker's circumplication made it difficult to understand the main point.","translation":"話者の回りくどい言い方のために、要点を理解するのが難しかった。"}],"collocations":["use circumplication","avoid circumplication"],"synonyms":["circumlocution","periphrasis","verbosity","wordiness"],"antonyms":["brevity","conciseness","terseness"]},{"part_of_speech":"noun","definition":"(修辞学)ある概念を強調するために、複数の異なる方法で言い換えること","english_definition":"(rhetoric) The act of expressing the same idea in several different ways in order to emphasize it.","examples":[{"sentence":"The author used circumplication to ensure the reader fully grasped the importance of the theme.","translation":"著者は、読者がテーマの重要性を完全に理解できるように、複数の異なる方法で言い換えることによって強調した。"}],"collocations":["rhetorical circumplication","use circumplication for emphasis"],"synonyms":["amplification","elaboration","expansion"],"antonyms":["reduction","abridgment"]}],"etymology":{"value":"From Latin *circumplicatio*, from *circumplicare* ('to fold around'), from *circum* ('around') + *plicare* ('to fold').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɜːrkəmplɪˈkeɪʃən/","syllables":"cir-cum-pli-ca-tion"},"inflection":{"noun_plural":"circumplications"},"usage_notes":{"explanation":"The word \"circumplication\" is relatively rare in modern English. It primarily refers to either a roundabout way of speaking (circumlocution) or, in a rhetorical context, the technique of emphasizing a point by expressing it in multiple different ways. The rhetorical sense is less common than the general sense of circumlocution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used circumplication to simplify the explanation.","correct":"✓ He used circumplication to make the explanation more elaborate.","note":"Circumplication involves making something more complex or elaborate, not simpler."}],"priority":"★★☆"},"related_words":{"derivatives":["circumplicate (verb)","circumplicative (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Circumplication\" is a sophisticated term referring to either roundabout speech or a rhetorical technique of emphasizing a point through multiple restatements. Due to its rarity and specific contexts of use (linguistics, rhetoric), it is considered a high-level vocabulary word. Understanding its etymology (folding around) can aid in grasping its meaning of indirectness or layered expression."},"example_sentences":[{"sentence":"The politician's speech was filled with circumplication, making it difficult to discern his true intentions.","translation":"政治家の演説は回りくどい言い方で満ちており、彼の真の意図を理解することを困難にした。","type":"noun","meaning_category":"回りくどい言い方"},{"sentence":"The professor employed circumplication to ensure that every student understood the nuances of the complex theory.","translation":"教授は、すべての学生が複雑な理論のニュアンスを理解できるように、複数の異なる方法で言い換えることによって強調した。","type":"noun","meaning_category":"修辞学"}]}