{"word":"Apolline","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アポロ的な、アポロに似た、アポロに関する","english_definition":"Relating to Apollo or having characteristics of Apollo; harmonious, ordered, rational, calm, and balanced.","examples":[{"sentence":"The Apolline ideal of beauty emphasizes harmony and proportion.","translation":"アポロ的な美の理想は、調和と均整を強調する。"},{"sentence":"His Apolline nature contrasted sharply with her more Dionysian temperament.","translation":"彼のアポロ的な性質は、彼女のよりディオニュソス的な気質とは対照的だった。"}],"collocations":["Apolline art (アポロ的な芸術)","Apolline spirit (アポロ的な精神)","Apolline beauty (アポロ的な美しさ)","Apolline ideal (アポロ的な理想)"],"synonyms":["classical","harmonious","balanced","rational","ordered","serene"],"antonyms":["Dionysian","chaotic","irrational","disordered"]},{"part_of_speech":"proper noun","definition":"女性の名前","english_definition":"A female given name.","examples":[{"sentence":"Apolline is a rare and beautiful name.","translation":"アポリーヌは珍しくて美しい名前だ。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin Apollinus, pertaining to Apollo, the Greek and Roman god of light, music, poetry, and reason.","priority":"★★★"},"pronunciation":{"ipa":"/əˈpɒlaɪn/","syllables":"A-pol-line"},"inflection":{},"usage_notes":{"explanation":"The term 'Apolline' is often used in philosophical and artistic contexts to describe a set of values associated with the Greek god Apollo. It represents order, reason, harmony, and balance, in contrast to the 'Dionysian' which represents chaos, emotion, and ecstasy. When used as a proper noun, 'Apolline' is a relatively uncommon given name.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Apollo (noun): the Greek and Roman god","Apollonian (adjective): similar meaning to Apolline","Dionysian (adjective): the opposite of Apolline"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Rare","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Apolline' is a sophisticated term primarily encountered in discussions of philosophy, art, and literature. It describes qualities associated with the Greek god Apollo, such as order, reason, and harmony. It is not a commonly used word in everyday conversation. When used as a name, it is relatively rare."},"example_sentences":[{"sentence":"The museum showcased art that embodied the Apolline principles of clarity and form.","translation":"その美術館は、明瞭さと形式というアポロ的な原則を具現化した芸術を展示した。","type":"adjective","meaning_category":"アポロ的な"},{"sentence":"Apolline's calm demeanor made her an excellent mediator.","translation":"アポリーヌの穏やかな態度は、彼女を優れた調停者にした。","type":"proper noun","meaning_category":"人名"}]}