{"word":"unmobbed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"群衆に取り囲まれていない、騒がれていない","english_definition":"Not crowded or swarmed by a mob; free from being mobbed.","examples":[{"sentence":"The usually popular restaurant was surprisingly unmobbed on a Tuesday evening.","translation":"普段は人気のレストランが、火曜日の夜には驚くほど人が少なかった。"},{"sentence":"We found a quiet, unmobbed corner of the beach to relax.","translation":"リラックスするために、静かで人の少ないビーチの隅を見つけた。"}],"collocations":["unmobbed beach","unmobbed restaurant","unmobbed area"],"synonyms":["uncrowded","deserted","quiet","secluded","peaceful"],"antonyms":["mobbed","crowded","swarmed","packed","bustling"]}],"etymology":{"value":"The word 'unmobbed' is formed by adding the prefix 'un-' (meaning 'not') to the past participle 'mobbed' of the verb 'to mob'. 'Mob' originally referred to a disorderly crowd, and 'to mob' means to crowd around someone or something in an unruly way.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈmɒbd/","syllables":"un-mobbed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have comparative or superlative forms in common usage."},"usage_notes":{"explanation":"'Unmobbed' is a relatively uncommon word used to describe a place or thing that is not surrounded or overwhelmed by a crowd of people. It is the opposite of 'mobbed', which implies being crowded or swarmed by a mob. 'Unmobbed' suggests a sense of peace, quiet, and lack of disturbance from a large group of people.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The celebrity was unmobbed by fans.","correct":"✓ The celebrity was not mobbed by fans. / ✓ The celebrity was unbothered by fans.","note":"'Unmobbed' is usually used to describe a place or thing, not a person. To describe a person not being crowded by fans, use 'not mobbed' or a synonym like 'unbothered'."}],"priority":"★☆☆"},"related_words":{"derivatives":["mob (noun, verb)","mobbed (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in CEFR level vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unmobbed' is a less common word that means 'not crowded or swarmed by a mob'. It's used to describe a place or situation where there isn't a large, unruly crowd. Because it's not a frequently used word, understanding the meaning of its root word 'mob' and the prefix 'un-' is helpful. It is more likely to be encountered in descriptive writing where the author wants to emphasize the absence of a crowd."},"example_sentences":[{"sentence":"During the off-season, the island's beaches are delightfully unmobbed.","translation":"オフシーズンには、島のビーチは嬉しいほど人が少ない。","type":"adjective","meaning_category":"人が少ない"},{"sentence":"We were grateful to find an unmobbed cafe where we could actually have a conversation.","translation":"実際に会話ができる、人の少ないカフェを見つけることができて感謝した。","type":"adjective","meaning_category":"騒がしくない"}]}