{"word":"capitalists","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"資本家、資本主義者","english_definition":"A person who owns or controls a lot of capital, especially in a business or industry, and who favors or supports capitalism.","examples":[{"sentence":"The capitalists invested heavily in new technologies.","translation":"資本家たちは新しい技術に多額の投資を行った。"},{"sentence":"Some argue that capitalists exploit workers for profit.","translation":"資本家は利益のために労働者を搾取すると主張する人もいる。"},{"sentence":"The rise of capitalists led to significant economic changes.","translation":"資本家の台頭は、大きな経済変化をもたらした。"}],"collocations":["wealthy capitalists (裕福な資本家)","powerful capitalists (力のある資本家)","investing capitalists (投資する資本家)","early capitalists (初期の資本家)","modern capitalists (現代の資本家)"],"synonyms":["financier","investor","entrepreneur","industrialist","tycoon","magnate"],"antonyms":["worker","proletariat","socialist","communist"]},{"part_of_speech":"noun","definition":"資本主義を支持する人","english_definition":"An advocate or supporter of capitalism.","examples":[{"sentence":"He is a staunch capitalist and believes in free markets.","translation":"彼は断固たる資本主義者であり、自由市場を信じている。"},{"sentence":"Capitalists argue that competition drives innovation.","translation":"資本主義者は、競争がイノベーションを促進すると主張する。"},{"sentence":"The debate between capitalists and socialists continues today.","translation":"資本主義者と社会主義者の間の議論は今日まで続いている。"}],"collocations":["staunch capitalist (断固たる資本主義者)","ardent capitalist (熱心な資本主義者)","conservative capitalist (保守的な資本主義者)","liberal capitalist (リベラルな資本主義者)","socialist capitalist (社会主義的資本主義者)"],"synonyms":["free marketeer","laissez-faire economist","pro-business advocate"],"antonyms":["socialist","communist","anti-capitalist"]}],"etymology":{"value":"The word 'capitalist' comes from 'capital', which originally referred to the head of cattle or property. It evolved to mean wealth used to produce more wealth. The suffix '-ist' denotes a person who adheres to or is associated with a particular belief or practice. Thus, a 'capitalist' is someone associated with capital, either as an owner or a supporter of capitalism.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæpɪtəlɪsts/","syllables":"ca-pi-tal-ists"},"inflection":{"noun_plural":"capitalists"},"usage_notes":{"explanation":"'Capitalists' refers to individuals who possess significant capital and use it to generate more wealth, often through investment in businesses and industries. It can also refer to those who advocate for the capitalist economic system, which emphasizes private ownership and free markets. The term is often used in discussions about economic inequality and the role of wealth in society.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a capitalist, so he must be rich.","correct":"✓ He is a capitalist, but not all capitalists are rich.","note":"Being a capitalist does not automatically mean someone is wealthy. It implies they support or participate in capitalism, but their level of wealth can vary."},{"incorrect":"✗ Capitalists are always evil.","correct":"✓ Some people criticize capitalists, but not all capitalists are evil.","note":"It's a generalization to assume all capitalists are inherently negative. Opinions on capitalism vary widely."}],"priority":"★★☆"},"related_words":{"derivatives":["capital (noun)","capitalism (noun)","capitalistic (adjective)","capitalization (noun)"],"related_concepts":["free market","private ownership","investment","profit","economic inequality"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively frequent, especially in economic and political discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'capitalists' refers to individuals who own substantial capital, typically used for investment and production within a capitalist economic system. It can also describe those who support the principles of capitalism, such as free markets and private ownership. The term is often encountered in discussions about economics, politics, and social issues, particularly when analyzing wealth distribution and the dynamics of capitalist societies. Understanding the nuances of this word requires familiarity with economic and political concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The **capitalists** funded the construction of the new factory.","translation":"資本家たちは新しい工場の建設に資金を提供した。","type":"noun","meaning_category":"資本家"},{"sentence":"Many **capitalists** believe that deregulation is essential for economic growth.","translation":"多くの資本主義者は、規制緩和が経済成長に不可欠だと信じている。","type":"noun","meaning_category":"資本主義を支持する人"},{"sentence":"Critics often accuse **capitalists** of prioritizing profit over social welfare.","translation":"批判者たちはしばしば資本家が社会福祉よりも利益を優先すると非難する。","type":"noun","meaning_category":"資本家"}]}