{"word":"Percompound","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A chemical compound containing a higher proportion of a particular element or radical than other compounds of the same elements.","english_definition":"A chemical compound containing a higher proportion of a particular element or radical than other compounds of the same elements.","examples":[{"sentence":"Percompounds are often unstable due to the high concentration of the element.","translation":"過化合物は、その元素の高濃度のため不安定であることが多い。"}],"collocations":[],"synonyms":["Supercompound"],"antonyms":["Subcompound"]}],"etymology":{"value":"The term 'percompound' is derived from the prefix 'per-' meaning 'exceedingly' or 'completely', combined with 'compound', indicating a chemical substance composed of two or more elements.","priority":"★★★"},"pronunciation":{"ipa":"/pərˈkɒmpaʊnd/","syllables":"per-com-pound"},"inflection":{},"usage_notes":{"explanation":"The term 'percompound' is primarily used in chemistry to describe compounds with an unusually high proportion of a specific element or radical compared to other compounds formed by the same elements. These compounds often exhibit unique properties and behaviors due to their composition.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["per- (prefix indicating 'exceedingly' or 'completely')","compound (a substance composed of two or more elements)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"'Percompound' is a specialized term in chemistry, referring to a chemical compound that has a higher proportion of a particular element or radical compared to other compounds made of the same elements. It is not commonly used outside of advanced chemistry contexts."},"example_sentences":[{"sentence":"Hydrogen peroxide (H₂O₂) can be considered a percompound of oxygen compared to water (H₂O).","translation":"過酸化水素（H₂O₂）は、水（H₂O）と比較して酸素の過化合物と見なすことができる。","type":"noun","meaning_category":"Chemical Compound"}]}