{"word":"undutiable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"免税の、非課税の","english_definition":"Not subject to customs duty; exempt from import taxes.","examples":[{"sentence":"This item is undutiable because it falls under the free trade agreement.","translation":"この品物は自由貿易協定の対象となるため、免税です。"},{"sentence":"Personal effects are often undutiable when brought into a country temporarily.","translation":"個人的な所有物は、一時的に国に持ち込まれる場合、しばしば免税となります。"}],"collocations":["undutiable goods","undutiable items","declare undutiable"],"synonyms":["duty-free","exempt","non-taxable"],"antonyms":["dutiable","taxable"]}],"etymology":{"value":"The word 'undutiable' is formed by adding the prefix 'un-' (meaning 'not') to the word 'dutiable'. 'Dutiable' itself comes from 'duty,' referring to a tax or tariff levied on imports or exports.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈdjuːtiəbəl/","syllables":"un-du-ti-a-ble"},"inflection":{"notes":"Since it is an adjective, it can form comparative and superlative forms, though they are rarely used: more undutiable, most undutiable."},"usage_notes":{"explanation":"'Undutiable' is a relatively formal term primarily used in the context of international trade, customs regulations, and taxation. It specifically refers to goods or items that are not subject to import duties or taxes when crossing borders. The term is most often encountered in legal or official documentation related to trade and customs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undutiable is in the box.","correct":"✓ The undutiable item is in the box.","note":"'Undutiable' is an adjective, so it needs to modify a noun (e.g., 'item,' 'goods')."},{"incorrect":"✗ I undutiable the goods at customs.","correct":"✓ I declared the goods as undutiable at customs.","note":"'Undutiable' is an adjective, not a verb. You can 'declare' goods as undutiable."}],"priority":"★★☆"},"related_words":{"derivatives":["duty (noun)","dutiable (adjective)","duty-free (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'undutiable' is a specialized term used in international trade and customs. It means that something is not subject to import duties or taxes. Understanding this word requires familiarity with concepts of trade regulations and tariffs. It is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The antiques were declared undutiable due to their age and cultural significance.","translation":"その骨董品は、その年代と文化的な重要性から免税と申告されました。","type":"adjective","meaning_category":"免税の"},{"sentence":"Under the trade agreement, many agricultural products are undutiable.","translation":"貿易協定に基づき、多くの農産品は免税です。","type":"adjective","meaning_category":"免税の"},{"sentence":"Travelers are often allowed to bring a certain amount of undutiable personal items across the border.","translation":"旅行者は、一定量の免税の個人的な品物を国境を越えて持ち込むことが許可されることがよくあります。","type":"adjective","meaning_category":"免税の"}]}