{"word":"retardance","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(光学)リターダンス、遅延","english_definition":"The difference in optical path length experienced by two orthogonal polarization components of light as it propagates through an anisotropic material.","examples":[{"sentence":"The retardance of the waveplate is precisely controlled.","translation":"その波長板のリターダンスは正確に制御されている。"},{"sentence":"Measuring the retardance can reveal information about the material's birefringence.","translation":"リターダンスを測定することで、材料の複屈折に関する情報を知ることができる。"}],"collocations":["waveplate retardance","optical retardance","birefringence retardance","measure retardance","control retardance"],"synonyms":["phase shift","optical path difference","birefringence"],"antonyms":[]}],"etymology":{"value":"Derived from 'retard', meaning to delay or slow down, and the suffix '-ance', indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈtɑːrdəns/","syllables":"re-tar-dance"},"inflection":{"noun_plural":"retardances"},"usage_notes":{"explanation":"In optics, retardance refers to the phase difference between two orthogonal polarization components of light after passing through a birefringent material. It is often expressed in units of length (e.g., nanometers) or as a fraction of a wavelength. Retardance is a crucial property in many optical devices, such as waveplates and liquid crystal displays.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The retardance is measured in degrees.","correct":"✓ The retardance is often expressed as a phase shift in degrees, but it is fundamentally a difference in optical path length.","note":"Retardance is a path length difference, but can be related to a phase shift, which is measured in degrees or radians."}],"priority":"★★☆"},"related_words":{"derivatives":["retard (verb)","retarded (adjective)"],"related_terms":["birefringence","waveplate","polarization","optical path length","phase shift"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in technical contexts related to optics and materials science.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Retardance' is a technical term used in optics to describe how much one component of polarized light is slowed down compared to another component when passing through certain materials. It's important in technologies like LCD screens and scientific instruments.","priority":"★★☆"},"example_sentences":[{"sentence":"The **retardance** of the crystal was found to be 200 nm.","translation":"その結晶のリターダンスは200nmであることがわかった。","type":"general","meaning_category":"リターダンス"},{"sentence":"By adjusting the voltage, the **retardance** of the liquid crystal cell can be tuned.","translation":"電圧を調整することで、液晶セルのリターダンスを調整できる。","type":"technical","meaning_category":"リターダンス"}]}