{"word":"non-renderable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"表示できない、レンダリングできない","english_definition":"Unable to be displayed or rendered, typically referring to digital content or code.","examples":[{"sentence":"The browser couldn't display the image because it was in a non-renderable format.","translation":"ブラウザは、画像がレンダリングできない形式であったため、表示できませんでした。"},{"sentence":"The code contained errors that made it non-renderable.","translation":"コードには、レンダリングできなくなるエラーが含まれていました。"},{"sentence":"The font was non-renderable on the older operating system.","translation":"そのフォントは、古いオペレーティングシステムではレンダリングできませんでした。"}],"collocations":["non-renderable character","non-renderable image","non-renderable code","non-renderable format","non-renderable content"],"synonyms":["unrenderable","undisplayable","unviewable"],"antonyms":["renderable","displayable","viewable"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'renderable'. 'Renderable' comes from 'render', meaning 'to cause to become' or 'to represent in a visual or audible form'.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌnɒnˈrɛndərəbəl/","syllables":"non-ren-der-a-ble"},"inflection":{"notes":"As an adjective, 'non-renderable' does not have different forms for gender or number."},"usage_notes":{"explanation":"'Non-renderable' is commonly used in technical contexts related to web development, software engineering, and digital media. It describes elements that cannot be properly processed and displayed by a particular system or application.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"The file is unrenderable.","correct":"The file is non-renderable.","note":"While 'unrenderable' is sometimes used, 'non-renderable' is the more common and preferred term, especially in technical documentation."}],"priority":"★☆☆"},"related_words":{"derivatives":["render (verb, noun)","rendering (noun)","renderable (adjective)"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-renderable' is a technical term used to describe digital content or code that cannot be displayed or processed correctly by a computer system. It's often encountered in fields like web development, graphic design, and software engineering. Understanding this term requires familiarity with the concept of rendering, which refers to the process of converting data into a visual or audible form."},"example_sentences":[{"sentence":"The email client displayed a blank space where the non-renderable HTML tag was located.","translation":"メールクライアントは、レンダリングできないHTMLタグがあった場所に空白を表示しました。","type":"adjective","meaning_category":"表示できない"},{"sentence":"The software flagged the corrupted file as non-renderable.","translation":"ソフトウェアは、破損したファイルをレンダリングできないものとしてフラグを立てました。","type":"adjective","meaning_category":"レンダリングできない"}]}