{"word":"Fumariaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ケシ科の植物の一科。","english_definition":"a family of flowering plants now included in the Papaveraceae (poppy family), formerly treated as a separate family.","examples":[{"sentence":"The Fumariaceae family includes plants such as bleeding-hearts and corydalis.","translation":"ケシ科には、ケマンソウやキケマンなどの植物が含まれています。"}],"collocations":[],"synonyms":["Papaveraceae (in part)"],"antonyms":[]}],"etymology":{"value":"New Latin, from Fumaria (the type genus) + -aceae (standard suffix for plant families). Fumaria is derived from Latin fumus (smoke), possibly referring to the smoky or bluish-gray appearance of some species, or the acrid smell when crushed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfjuːˌmɛəriˈeɪsiːˌaɪ/","syllables":"Fu-ma-ri-a-ce-ae"},"inflection":{"notes":"Plural: Fumariaceae (科名なので複数形は一般的ではない)"},"usage_notes":{"explanation":"Fumariaceae was formerly recognized as a distinct family of flowering plants. However, modern phylogenetic studies have shown that it is nested within the Papaveraceae (poppy family). Therefore, it is now generally treated as a subfamily (Fumarioideae) within the Papaveraceae. The plants in this group are herbaceous and often have distinctive spurred flowers.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Fumarioideae (subfamily)","Fumaria (genus)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 植物学の専門用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「**Fumariaceae**」は、以前は独立した科として扱われていた植物のグループの名前です。しかし、最近の研究で、ケシ科（Papaveraceae）の一部であることがわかりました。そのため、現在ではケシ科の中の亜科（Fumarioideae）として分類されています。この単語は植物学の専門的な文脈でのみ使用されます。"},"example_sentences":[{"sentence":"The classification of plants in the former **Fumariaceae** family has been revised.","translation":"かつてケシ科に分類されていた植物の分類が見直されました。","type":"noun","meaning_category":"植物の科"},{"sentence":"Plants belonging to the **Fumariaceae** family are often characterized by their spurred flowers.","translation":"ケシ科に属する植物は、しばしば距のある花を特徴としています。","type":"noun","meaning_category":"植物の科"}]}