{"word":"radiotelephones","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"無線電話機","english_definition":"A telephone that transmits signals by radio waves rather than along a wire.","examples":[{"sentence":"Radiotelephones were once commonly used in vehicles before the widespread adoption of cellular phones.","translation":"無線電話機は、携帯電話が広く普及する前は、車両で一般的に使用されていました。"}],"collocations":["mobile radiotelephone","portable radiotelephone"],"synonyms":["wireless telephone","radio phone"],"antonyms":["landline telephone"]}],"etymology":{"value":"The word is a combination of 'radio' (referring to the use of radio waves) and 'telephone' (a device for transmitting speech).","priority":"★★☆"},"pronunciation":{"ipa":"ˌreɪdioʊˈtɛlɪfoʊnz","syllables":"ra-di-o-tel-e-phones"},"inflection":{"noun_plural":"radiotelephones"},"usage_notes":{"explanation":"'Radiotelephones' typically refers to older technologies that used radio waves for communication, often in a two-way radio system rather than a cellular network. The term is less common now due to the prevalence of cellular phones, which are also wireless but operate on different principles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I use radiotelephones to connect to the internet.","correct":"✓ I use a smartphone to connect to the internet.","note":"Radiotelephones are not used for internet access; smartphones are used for this purpose."}],"priority":"★★☆"},"related_words":{"derivatives":["radiotelephony (noun: the technology of radiotelephones)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Radiotelephones' refers to older wireless communication devices that used radio waves. This term is less common now because modern cellular phones have largely replaced them. Understanding this term requires knowledge of historical communication technology."},"example_sentences":[{"sentence":"During the emergency, they relied on radiotelephones to communicate.","translation":"緊急時には、彼らは無線電話機に頼って通信しました。","type":"noun","meaning_category":"device"},{"sentence":"The old radiotelephones had limited range compared to modern cell phones.","translation":"古い無線電話機は、現代の携帯電話に比べて通信範囲が限られていました。","type":"noun","meaning_category":"device"}]}