{"word":"Chiromegaly","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"手足の肥大症：先端巨大症の一症状で、特に手と足が異常に大きくなること。","english_definition":"A condition characterized by enlargement of the hands and feet, often associated with acromegaly.","examples":[{"sentence":"Chiromegaly can make it difficult to perform fine motor tasks.","translation":"手足の肥大症は、細かい運動作業を行うことを困難にする可能性がある。"},{"sentence":"The patient presented with symptoms of acromegaly, including noticeable chiromegaly.","translation":"その患者は、顕著な手足の肥大症を含む先端巨大症の症状を呈した。"}],"collocations":["associated with acromegaly","symptoms of chiromegaly","cause of chiromegaly"],"synonyms":["acromegaly (related condition)","gigantism (related condition)"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「cheir」（手）+「megas」（大きい）+「-ia」（状態を示す接尾辞）に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkaɪroʊˈmɛɡəli/","syllables":"ki-ro-meg-a-lee"},"inflection":{"noun_plural":"chiromegalies"},"usage_notes":{"explanation":"Chiromegaly is a specific physical manifestation, primarily the enlargement of the hands and feet, often linked to acromegaly, a hormonal disorder where the pituitary gland produces too much growth hormone. It's important to note that while chiromegaly involves enlarged hands and feet, acromegaly encompasses broader systemic effects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor diagnosed him with chiromegaly of the nose.","correct":"✓ The doctor diagnosed him with chiromegaly, affecting his hands and feet.","note":"Chiromegaly specifically refers to the enlargement of the hands and feet, not other body parts. If other body parts are enlarged, it may be a broader case of acromegaly or another condition."}],"priority":"★★☆"},"related_words":{"derivatives":["chiromegalic (adjective)"],"phrasal_verbs":[],"related_medical_terms":["acromegaly","gigantism","pituitary tumor","growth hormone"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Chiromegaly\" is a specialized medical term referring to the enlargement of the hands and feet, often associated with acromegaly. Understanding this term requires familiarity with medical terminology and related conditions. It is not commonly used outside of medical contexts."},"example_sentences":[{"sentence":"The excessive ring size was an early sign of chiromegaly.","translation":"指輪のサイズが大きすぎることは、手足の肥大症の初期の兆候であった。","type":"noun","meaning_category":"手足の肥大症"},{"sentence":"Chiromegaly can affect a person's ability to grip objects.","translation":"手足の肥大症は、人が物体を握る能力に影響を与える可能性がある。","type":"noun","meaning_category":"手足の肥大症"}]}