{"word":"illumination-induced","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"照明によって引き起こされる、光照射によって誘発される","english_definition":"Caused or induced by illumination or exposure to light.","examples":[{"sentence":"The experiment examined illumination-induced changes in the plant's growth patterns.","translation":"その実験では、照明によって誘発される植物の成長パターンの変化を調べた。"},{"sentence":"The scientist studied the illumination-induced degradation of the material.","translation":"科学者は、光照射によって誘発される材料の劣化を研究した。"}],"collocations":["illumination-induced damage","illumination-induced effects","illumination-induced reaction","illumination-induced changes"],"synonyms":["light-induced","photo-induced","radiation-induced"],"antonyms":["darkness-induced","shadow-induced"]}],"etymology":{"value":"The word is formed by combining \"illumination\" (the act of supplying with light) and \"induced\" (caused or brought about as a result of something).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌluːmɪˈneɪʃən ɪnˈdjuːst/","syllables":"il-lu-mi-na-tion in-dused"},"inflection":{"notes":"Adjectives do not typically inflect in English, though they can be modified by adverbs (e.g., 'very illumination-induced')."},"usage_notes":{"explanation":"This term is often used in scientific or technical contexts to describe phenomena or processes that are triggered or caused by exposure to light or other forms of illumination. It is used to specify that the effect being described is a direct result of the light exposure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The illumination induced.","correct":"✓ The illumination-induced effect.","note":"\"Illumination-induced\" is an adjective and needs to be followed by a noun to describe what is being induced by illumination."}],"priority":"★★☆"},"related_words":{"derivatives":["illumination","induce","induced"],"related_terms":["photodegradation","photoluminescence","photoelectric effect"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"illumination-induced\" is a technical adjective used to describe effects or changes that are caused by exposure to light or other forms of illumination. It is commonly used in scientific and technical writing, particularly in fields such as physics, chemistry, biology, and engineering, where the effects of light on materials and systems are studied. Understanding this term requires a familiarity with scientific vocabulary and concepts. It indicates a direct causal relationship between light exposure and the observed effect."},"example_sentences":[{"sentence":"The study investigated the illumination-induced isomerization of the molecule.","translation":"その研究では、照明によって誘発される分子の異性化を調査した。","type":"general","meaning_category":"general"},{"sentence":"Illumination-induced stress can affect the performance of solar cells.","translation":"照明によって誘発されるストレスは、太陽電池の性能に影響を与える可能性がある。","type":"technical","meaning_category":"technical"}]}