{"word":"morphotropic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(結晶構造または相構造が)組成の変化によって変化する、相境界を示す","english_definition":"Relating to a change in crystal structure or phase structure as a function of composition; exhibiting a phase boundary.","examples":[{"sentence":"The morphotropic phase boundary (MPB) is a key characteristic of high-performance piezoelectric materials.","translation":"モルフォトロピック相境界（MPB）は、高性能圧電材料の重要な特性です。"},{"sentence":"The material exhibits morphotropic behavior near the specified composition.","translation":"その材料は、特定の組成付近でモルフォトロピックな挙動を示します。"}],"collocations":["morphotropic phase boundary (MPB)","morphotropic transition","morphotropic behavior"],"synonyms":["phase-changing","structure-altering"],"antonyms":["isostructural","compositionally stable"]}],"etymology":{"value":"Derived from the Greek words 'morphē' (form, shape) and 'tropos' (turn, change), combined with '-ic' (relating to). Essentially, it describes a change in form or structure.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɔːrfoʊˈtrɑːpɪk/","syllables":"mor-pho-trop-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'morphotropic' is primarily used in materials science, particularly in the context of ferroelectrics, piezoelectrics, and related materials. It describes a situation where a small change in the chemical composition of a material leads to a significant change in its crystal structure and, consequently, its physical properties. The morphotropic phase boundary (MPB) is the region in the phase diagram where this structural transition occurs, and materials near the MPB often exhibit enhanced properties.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The material is morphotrophic.","correct":"✓ The material exhibits morphotropic behavior.","note":"'Morphotropic' is an adjective describing a property or behavior, not a state of being. So, it's more accurate to say a material 'exhibits morphotropic behavior' rather than 'is morphotropic'."}],"priority":"★★☆"},"related_words":{"derivatives":["morphotropy (noun)"],"related_terms":["ferroelectric","piezoelectric","phase boundary","crystal structure","composition"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Morphotropic' is a technical term used in materials science to describe materials that undergo a change in their crystal structure or phase when their composition is altered. This is particularly important in the study of ferroelectric and piezoelectric materials, where the morphotropic phase boundary (MPB) is a region in the material's phase diagram where its properties are significantly enhanced. This term is typically encountered in advanced scientific literature and research.","priority":"★★☆"},"example_sentences":[{"sentence":"The enhanced piezoelectric properties are observed near the morphotropic phase boundary.","translation":"強化された圧電特性は、モルフォトロピック相境界付近で観察されます。","type":"scientific","meaning_category":"phase transition"},{"sentence":"The study focuses on the morphotropic behavior of the lead-free perovskite material.","translation":"この研究は、鉛フリーペロブスカイト材料のモルフォトロピックな挙動に焦点を当てています。","type":"scientific","meaning_category":"material science"}]}