{"word":"assuetude","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"慣れ、習慣","english_definition":"habitual use or custom; the state of being accustomed to something.","examples":[{"sentence":"His assuetude to the city noises made it difficult to sleep in the countryside.","translation":"彼が都会の騒音に慣れきっていたため、田舎では眠るのが難しかった。"},{"sentence":"The prisoner's assuetude to confinement made it hard for him to adjust to freedom.","translation":"囚人が監禁生活に慣れてしまったため、自由な生活に適応するのが難しかった。"},{"sentence":"Through assuetude, she no longer noticed the smell of the factory.","translation":"慣れによって、彼女は工場の匂いをもう気にしなくなった。"}],"collocations":["fall into assuetude","through assuetude","long assuetude"],"synonyms":["habituation","accustomation","familiarity","custom","usage"],"antonyms":["inexperience","strangeness","unfamiliarity"]}],"etymology":{"value":"From Latin *assuetus*, the past participle of *assuescere* meaning 'to accustom'. This is formed from *ad-* ('to') + *suescere* ('to become accustomed'), related to *suus* ('one's own').","priority":"★★☆"},"pronunciation":{"ipa":"/əˈswɛtjʊd/","syllables":"as-sue-tude"},"inflection":{"noun_plural":"assuetudes"},"usage_notes":{"explanation":"*Assuetude* refers to the state of being accustomed to something, often to the point where it is no longer noticed or has a diminished effect. It is a somewhat formal and less common word than *habituation* or *accustomation*. It often implies a gradual process of becoming used to something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He suffered from assuetude after the accident.","correct":"✓ He suffered from PTSD after the accident.","note":"*Assuetude* describes the state of being accustomed, not suffering. Use *PTSD* (Post-Traumatic Stress Disorder) or other appropriate terms to describe suffering after an accident."},{"incorrect":"✗ The assuetude of the new technology made it easy to use.","correct":"✓ The familiarity with the new technology made it easy to use.","note":"While *assuetude* implies familiarity, it is often used to describe a state of being desensitized or less affected by something, not necessarily ease of use. *Familiarity* is a more direct term for ease of use due to understanding."}],"priority":"★☆☆"},"related_words":{"derivatives":["assuetudinal (adjective)"],"related_terms":["habituation","accustomation","desensitization"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"*Assuetude* is a formal and uncommon word referring to the state of being accustomed to something, often to the point of no longer noticing it or being affected by it. It is more frequently encountered in academic or specialized writing. It is related to the process of habituation, where repeated exposure to a stimulus results in a decreased response. Understanding this word requires a strong vocabulary and familiarity with formal language.","example_sentences":[]}}