{"word":"unbundling","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(主にビジネス) バンドルされたものを分離すること、抱き合わせ販売の解消、アンバンドリング","english_definition":"The process of separating components that were previously sold together as a bundle.","examples":[{"sentence":"The unbundling of cable TV channels allows consumers to choose only the channels they want.","translation":"ケーブルテレビチャンネルのアンバンドリングにより、消費者は必要なチャンネルだけを選択できるようになる。"},{"sentence":"The unbundling of financial services led to increased competition.","translation":"金融サービスのアンバンドリングは、競争の激化につながった。"},{"sentence":"Unbundling in education could mean students pay only for the courses they need.","translation":"教育におけるアンバンドリングは、学生が必要なコースのみに料金を支払うことを意味する可能性がある。"}],"collocations":["unbundling of services","unbundling of products","content unbundling","financial unbundling","regulatory unbundling"],"synonyms":["separation","disaggregation","decomposition","disentanglement"],"antonyms":["bundling","aggregation","integration"]},{"part_of_speech":"verb","definition":"(動詞の現在分詞形) バンドルされたものを分離する、抱き合わせ販売を解消する","english_definition":"Present participle of the verb 'unbundle': to separate components that were previously sold together as a bundle.","examples":[{"sentence":"The company is unbundling its software suite to offer individual applications.","translation":"その会社は、個々のアプリケーションを提供するために、ソフトウェアスイートをアンバンドリングしている。"},{"sentence":"We are unbundling the various services to provide more flexibility to our clients.","translation":"顧客により柔軟性を提供するために、さまざまなサービスをアンバンドリングしている。"}],"collocations":["unbundling services","unbundling products","unbundling content"],"synonyms":["separating","disaggregating","decomposing","disentangling"],"antonyms":["bundling","aggregating","integrating"]}],"etymology":{"value":"The word 'unbundling' is formed by adding the prefix 'un-' (meaning 'not' or 'opposite of') to the word 'bundling'. 'Bundling' refers to the practice of packaging several products or services together as a single combined unit. Therefore, 'unbundling' means the reverse of this process: separating the bundled items.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈbʌndlɪŋ/","syllables":"un-bun-dling"},"inflection":{"noun_plural":"unbundlings","verb_forms":{"present_simple":["unbundle","unbundles"],"past_simple":"unbundled","past_participle":"unbundled","present_participle":"unbundling"}},"usage_notes":{"explanation":"'Unbundling' is often used in business and economics to describe the process of breaking apart a previously combined product or service into its individual components. This can lead to increased competition, greater consumer choice, and more specialized offerings. The term is also used in other fields, such as education and technology, to describe the separation of previously integrated elements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unbundling made the product more expensive.","correct":"✓ The unbundling can sometimes make individual components more expensive, but it often increases consumer choice.","note":"Unbundling doesn't always lead to lower prices. While it can increase competition, it can also result in higher costs for individual components. The key benefit is increased choice and flexibility."},{"incorrect":"✗ He is unbundling to the package.","correct":"✓ He is unbundling the package.","note":"When using 'unbundling' as a verb, use 'unbundle' + the object being separated (e.g., 'unbundle the package'). The preposition 'to' is not needed."}],"priority":"★★☆"},"related_words":{"derivatives":["unbundle (verb)","bundle (noun, verb)","bundled (adjective)"],"related_terms":["disintermediation","vertical disintegration","modularization"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to changes in business models and technology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unbundling' refers to the process of taking something that was previously offered as a single package and separating it into individual parts. This often happens in business when companies decide to sell products or services separately instead of as a bundle. Understanding this term requires some familiarity with business and economic concepts. It's a more advanced term that's not commonly used in everyday conversation, but it's important in specific contexts."},"example_sentences":[{"sentence":"The **unbundling** of media content has disrupted traditional business models.","translation":"メディアコンテンツのアンバンドリングは、従来のビジネスモデルを破壊した。","type":"noun","meaning_category":"separation"},{"sentence":"The company is **unbundling** its services to offer more customized solutions.","translation":"その会社は、よりカスタマイズされたソリューションを提供するために、サービスをアンバンドリングしている。","type":"verb","meaning_category":"separating"},{"sentence":"The **unbundling** of software allows users to choose only the features they need.","translation":"ソフトウェアのアンバンドリングにより、ユーザーは必要な機能のみを選択できるようになる。","type":"noun","meaning_category":"separation"},{"sentence":"Regulatory **unbundling** can promote competition in the energy sector.","translation":"規制のアンバンドリングは、エネルギー部門における競争を促進する可能性がある。","type":"noun","meaning_category":"separation"}]}