{"word":"Astronavigation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"天測航法、天文航法","english_definition":"The technique of determining position by reference to celestial bodies.","examples":[{"sentence":"Astronavigation was essential for long sea voyages before the advent of GPS.","translation":"GPSが登場する前は、天測航法が長距離の航海に不可欠だった。"},{"sentence":"He studied astronavigation to become a certified navigator.","translation":"彼は認定航海士になるために天測航法を学んだ。"}],"collocations":["celestial navigation","star navigation","sextant","celestial bodies"],"synonyms":["celestial navigation","star navigation"],"antonyms":["electronic navigation","GPS navigation"]}],"etymology":{"value":"The word \"astronavigation\" is a combination of \"astro-\" (referring to stars or celestial bodies) and \"navigation\" (the process or activity of accurately ascertaining one's position and planning and following a route).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæstroʊnævɪˈɡeɪʃən/","syllables":"as-tro-nav-i-ga-tion"},"inflection":{"noun_plural":"Astronavigations (rarely used)"},"usage_notes":{"explanation":"Astronavigation is a specialized skill that requires knowledge of astronomy, mathematics, and the use of instruments such as sextants. While largely replaced by electronic navigation systems like GPS, it remains important as a backup method and for situations where electronic systems are unavailable or unreliable.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used astronavigation on his phone.","correct":"✓ He used GPS on his phone. / ✓ He used astronavigation with a sextant.","note":"Astronavigation requires physical instruments like a sextant, not a phone. Phones use GPS or other electronic navigation systems."},{"incorrect":"✗ Astronavigation is easy to learn.","correct":"✓ Astronavigation is challenging to learn.","note":"Astronavigation requires a deep understanding of astronomy and mathematics, making it a challenging skill to acquire."}],"priority":"★★☆"},"related_words":{"derivatives":["astronavigator (noun: 天測航法士)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Astronavigation is a technical term referring to the method of finding one's location by observing stars and other celestial bodies. This method was crucial for sailors before modern technology like GPS became available. It involves using instruments like a sextant and understanding astronomical principles. The word itself combines \"astro-\" (related to stars) and \"navigation\" (the act of finding your way)."},"example_sentences":[{"sentence":"Ancient mariners relied on astronavigation to chart their courses across the oceans.","translation":"古代の船乗りたちは、天測航法に頼って海を渡る航路を定めていた。","type":"general","meaning_category":"general"},{"sentence":"The pilot used astronavigation as a backup when the plane's GPS failed.","translation":"パイロットは、飛行機のGPSが故障した際に、バックアップとして天測航法を使用した。","type":"general","meaning_category":"general"}]}