{"word":"pushcard","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A small, often hand-drawn or printed card, typically used for advertising or promotional purposes, designed to be easily distributed or left in public places.","english_definition":"A small card, often hand-drawn or printed, used for advertising or promotion and designed for easy distribution.","examples":[{"sentence":"The band left pushcards at local cafes to promote their upcoming concert.","translation":"そのバンドは、近々開催されるコンサートを宣伝するために、地元のカフェにプッシュカードを置いた。"},{"sentence":"She created pushcards with her artwork and contact information to gain new clients.","translation":"彼女は新しい顧客を獲得するために、自分のアート作品と連絡先情報を記載したプッシュカードを作成した。"}],"collocations":["design a pushcard","distribute pushcards","leave pushcards","promote with pushcards"],"synonyms":["flyer","handbill","promotional card","business card"],"antonyms":["none (context dependent)"]}],"etymology":{"value":"Likely derived from the act of 'pushing' or promoting something using a small card. The term combines 'push' (to promote) and 'card' (a small piece of paper).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʊʃkɑːrd/","syllables":"push-card"},"inflection":{"noun_plural":"pushcards"},"usage_notes":{"explanation":"Pushcards are typically informal and low-cost marketing tools. They are often used by artists, musicians, small businesses, or individuals to spread information quickly and directly. They are less formal than business cards but more targeted than general flyers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"I printed a pushcard for my birthday party invitation.","correct":"I printed invitations for my birthday party.","note":"Pushcards are generally used for promotional purposes, not for personal invitations."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pushcard' refers to a small promotional card designed for easy distribution. It's a relatively niche term, primarily used in marketing or artistic contexts. Understanding its usage requires familiarity with promotional strategies and informal advertising methods."},"example_sentences":[{"sentence":"The artist designed a series of unique pushcards to showcase her latest paintings.","translation":"そのアーティストは、最新の絵画を紹介するために、一連のユニークなプッシュカードをデザインした。","type":"example","meaning_category":"promotional material"},{"sentence":"Volunteers distributed pushcards throughout the neighborhood to raise awareness for the local charity.","translation":"ボランティアたちは、地元の慈善団体の認知度を高めるために、近隣地域全体にプッシュカードを配布した。","type":"example","meaning_category":"advertising"}]}