{"word":"misseating","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(造語) 他人の咀嚼音や食事の様子に対する嫌悪感や不快感を引き起こす行為、またはそのような行為によって引き起こされる状態。","english_definition":"(Neologism) The act of eating in a way that triggers misophonia in others, or the state of being triggered by such an act.","examples":[{"sentence":"His loud chewing was a clear case of misseating, triggering my misophonia immediately.","translation":"彼の大きな咀嚼音は明らかにミスイーティングであり、私のミソフォニアをすぐに引き起こした。"},{"sentence":"Aware of her misophonia, he tried to avoid misseating around her.","translation":"彼女のミソフォニアを知っていたので、彼は彼女の周りでミスイーティングをしないように努めた。"},{"sentence":"The article discussed how to address misseating in public places to accommodate individuals with sound sensitivities.","translation":"その記事では、音に敏感な人に対応するために、公共の場所でのミスイーティングにどのように対処するかについて議論されていた。"}],"collocations":["trigger misophonia (ミソフォニアを引き起こす)","avoid misseating (ミスイーティングを避ける)","loud misseating (騒々しいミスイーティング)","subtle misseating (微妙なミスイーティング)"],"synonyms":["triggering eating sounds","offensive mastication","annoying eating habits"],"antonyms":["considerate eating","mindful eating","quiet eating"],"notes":"This is a relatively new term, primarily used in discussions about misophonia. It is not yet widely recognized in standard dictionaries."}],"etymology":{"value":"A neologism formed by combining \"mis-\" (meaning wrong or bad) with \"eating.\" It describes eating behaviors that are perceived as unpleasant or triggering to others, especially those with misophonia.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪsˈiːtɪŋ/","syllables":"mis-eat-ing"},"inflection":{"noun_plural":"misseatings (rarely used)"},"usage_notes":{"explanation":"\"Misseating\" is a term primarily used within the context of misophonia, a condition where specific sounds trigger strong negative emotions. It describes the act of eating in a way that is considered offensive or triggering to someone with misophonia. The term is not yet widely accepted or formally defined in standard dictionaries, but it is gaining traction in online discussions and articles related to misophonia.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was misseating the food.","correct":"✓ His eating was misseating. / ✓ He was eating in a way that was misseating.","note":"\"Misseating\" is typically used as a noun to describe the act or behavior, not as a verb to describe the action of eating itself. To describe someone performing the action, you would say they are \"eating in a way that is misseating\" or describe their eating as \"misseating.\""}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["misophonia (音嫌悪症)","trigger (引き金)","sound sensitivity (音への過敏症)","chewing sounds (咀嚼音)","eating habits (食習慣)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not a standard word)","frequency_google_ngram":"Low frequency (造語であり、一般的な単語ではない)","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"\"Misseating\" is a neologism, meaning it's a newly coined word. It's primarily used in discussions about misophonia, a condition where specific sounds trigger strong negative emotions. \"Misseating\" refers to the act of eating in a way that triggers these emotions in someone with misophonia. Because it's a relatively new and specialized term, it's not widely recognized and would likely only be understood by those familiar with misophonia. It is used as a noun to describe the action of eating in a way that is triggering to others. The word is formed by combining \"mis-\" with \"eating\", indicating an undesirable or problematic form of eating."},"example_sentences":[{"sentence":"The therapist suggested strategies to cope with the anxiety caused by his roommate's habitual misseating.","translation":"セラピストは、ルームメイトの習慣的なミスイーティングによって引き起こされる不安に対処するための戦略を提案した。","type":"noun","meaning_category":"不快な食事の仕方"},{"sentence":"She politely asked him to be more mindful of his misseating, as it was affecting her ability to concentrate.","translation":"彼女は彼に、彼のミスイーティングが彼女の集中力に影響を与えているため、もっと注意するように丁寧に頼んだ。","type":"noun","meaning_category":"不快な食事の仕方"}]}