{"word":"Nummulitidae","priority":"低","meanings":[{"part_of_speech":"noun","definition":"有孔虫の一種、ヌンムリテス科","english_definition":"A family of foraminifera characterized by their large, lenticular, multichambered tests, common in Eocene to Oligocene marine sediments.","examples":[{"sentence":"Nummulitidae are important index fossils for dating Paleogene marine strata.","translation":"ヌンムリテス科は、古第三紀の海洋地層の年代を特定するための重要な示準化石です。"}],"collocations":["Nummulitidae fossils","Nummulitidae limestone"],"synonyms":["foraminifera"],"antonyms":[]}],"etymology":{"value":"Derived from Nummulites, the type genus, which comes from Latin 'nummulus' (small coin) referring to their coin-like shape, and the suffix '-idae' indicating a family.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnʌmjʊˈlɪtɪdiː/","syllables":"Num-mu-li-ti-dae"},"inflection":{"noun_plural":"Nummulitids or Nummulitidae"},"usage_notes":{"explanation":"Nummulitidae refers to a specific family within the larger group of foraminifera. They are notable for their relatively large size and distinctive shape, resembling small coins. Their presence in sedimentary rocks is useful for biostratigraphy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Nummulites are a type of Nummulitidae species.","correct":"✓ Nummulites are a genus within the family Nummulitidae.","note":"Nummulites is a genus, while Nummulitidae is the family."}],"priority":"★★☆"},"related_words":{"derivatives":["Nummulites (genus)"],"related_terms":["foraminifera","fossil","Paleogene","biostratigraphy"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Nummulitidae' is a scientific term used in the fields of paleontology, geology, and micropaleontology. Understanding requires familiarity with taxonomic classifications and geological time scales. The word itself is derived from Latin and refers to a specific family of foraminifera characterized by their coin-like shape and importance in dating marine sediments."},"example_sentences":[{"sentence":"The abundance of Nummulitidae in the rock sample suggests it was formed during the Eocene epoch.","translation":"岩石サンプル中のヌンムリテス科の豊富さは、それが始新世に形成されたことを示唆しています。","type":"noun","meaning_category":"classification"},{"sentence":"Studies of Nummulitidae morphology can provide insights into past environmental conditions.","translation":"ヌンムリテス科の形態の研究は、過去の環境条件に関する洞察を提供することができます。","type":"noun","meaning_category":"research"},{"sentence":"The Nummulitidae are an extinct group of foraminifera that were widespread in ancient oceans.","translation":"ヌンムリテス科は、古代の海洋に広く分布していた有孔虫の絶滅したグループです。","type":"noun","meaning_category":"description"}]}