{"word":"Shavegrass","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トクサ（砥草）","english_definition":"A plant of the genus Equisetum, especially Equisetum hyemale, having rough, silica-rich stems formerly used for scouring and polishing.","examples":[{"sentence":"Shavegrass was once used to polish pewter.","translation":"トクサはかつてピューターを磨くために使われていました。"},{"sentence":"The rough texture of shavegrass makes it a natural abrasive.","translation":"トクサの粗い質感は、天然の研磨剤になります。"}],"collocations":["use shavegrass to polish","grow shavegrass","harvest shavegrass"],"synonyms":["horsetail","Equisetum hyemale","scouring rush"],"antonyms":[]}],"etymology":{"value":"The name 'shavegrass' comes from the plant's historical use for shaving or scouring surfaces due to its abrasive texture.","priority":"★★★"},"pronunciation":{"ipa":"/ˈʃeɪvˌɡræs/","syllables":"shave-grass"},"inflection":{"noun_plural":"shavegrasses"},"usage_notes":{"explanation":"'Shavegrass' is a common name for plants in the Equisetum genus, particularly Equisetum hyemale. These plants are known for their high silica content, which gives them a rough texture suitable for polishing and cleaning. The term is primarily used in contexts related to traditional uses of the plant.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I use shavegrass for my skin.","correct":"✓ I use shavegrass for polishing metal.","note":"Shavegrass is not typically used on skin; it's too abrasive."},{"incorrect":"✗ Shavegrass is a type of grass.","correct":"✓ Shavegrass is a type of horsetail.","note":"Shavegrass is not a true grass but a horsetail, a different type of plant."}],"priority":"★★☆"},"related_words":{"derivatives":["shave (verb)","grass (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shavegrass' refers to a specific plant, Equisetum hyemale, known for its abrasive properties. It's a relatively uncommon term, primarily encountered in contexts discussing historical uses of plants for cleaning or polishing. Understanding the term requires familiarity with botany and traditional crafts."},"example_sentences":[{"sentence":"Early settlers used shavegrass to scrub their pots and pans.","translation":"初期の入植者は、トクサを使って鍋やフライパンを磨いていました。","type":"general","meaning_category":"historical use"},{"sentence":"The stems of shavegrass are rich in silica, making them ideal for polishing.","translation":"トクサの茎はシリカが豊富で、研磨に最適です。","type":"botanical","meaning_category":"properties"}]}