{"word":"epistler","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"手紙を書く人、手紙の収集家、手紙に関する研究者","english_definition":"A writer of letters; a collector of letters; a scholar of letters.","examples":[{"sentence":"He was a prolific epistler, corresponding with many famous figures of his time.","translation":"彼は多作な手紙家で、当時の多くの著名人と文通していた。"},{"sentence":"As an epistler, she revealed her innermost thoughts and feelings.","translation":"手紙を書く人として、彼女は心の奥底にある考えや感情を明らかにした。"},{"sentence":"The epistler carefully archived the correspondence for future generations.","translation":"手紙の収集家は、将来の世代のために通信記録を注意深く保管した。"},{"sentence":"The epistler dedicated his life to studying the art of letter writing.","translation":"手紙に関する研究者は、手紙の書き方の研究に生涯を捧げた。"}],"collocations":["prolific epistler","dedicated epistler","avid epistler","noted epistler"],"synonyms":["correspondent","letter writer","pen pal","scribe","clerk"],"antonyms":[]}],"etymology":{"value":"From the word 'epistle,' meaning a letter, plus the suffix '-er,' indicating a person who does or is associated with something.","priority":"★★★"},"pronunciation":{"ipa":"/ɪˈpɪslər/","syllables":"e-pis-tler"},"inflection":{"noun_plural":"epistlers"},"usage_notes":{"explanation":"The term 'epistler' is relatively uncommon in modern English. It usually refers to someone who writes letters frequently, collects letters, or studies the art and history of letter writing. The word implies a certain level of dedication or expertise in the realm of letter writing and correspondence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is an epistler of emails.","correct":"✓ She is a frequent email correspondent.","note":"'Epistler' typically refers to someone who writes physical letters, not emails."},{"incorrect":"✗ He is an epistler in the company's marketing department.","correct":"✓ He is a correspondence clerk in the company's marketing department.","note":"'Epistler' is not usually used to describe someone who handles routine business correspondence."}],"priority":"★☆☆"},"related_words":{"derivatives":["epistle","epistolary","epistolography"],"phrases":["epistolary novel","epistolary tradition"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'epistler' is a relatively rare and specialized term. It is most likely to be encountered in academic or historical contexts, where the study or discussion of letter writing is relevant. Understanding the word requires familiarity with the term 'epistle' and the suffix '-er,' which denotes a person associated with a particular activity or field."},"example_sentences":[{"sentence":"The historian consulted numerous letters written by the famous epistler.","translation":"歴史家は、有名な手紙家の書いた多くの手紙を参考にした。","type":"general","meaning_category":"手紙を書く人"},{"sentence":"As a dedicated epistler, she maintained correspondence with friends and family around the world.","translation":"熱心な手紙家として、彼女は世界中の友人や家族と文通を続けた。","type":"general","meaning_category":"手紙を書く人"},{"sentence":"The museum acquired a collection of letters from a noted epistler of the 18th century.","translation":"博物館は、18世紀の著名な手紙家からの手紙のコレクションを入手した。","type":"general","meaning_category":"手紙の収集家"},{"sentence":"The epistler's study provided valuable insights into the social and political climate of the time.","translation":"手紙に関する研究者の研究は、当時の社会および政治情勢に関する貴重な洞察を提供した。","type":"general","meaning_category":"手紙に関する研究者"}]}