{"word":"single-leaded","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(主に建築で)単層の鉛ガラスで作られた、または単層の鉛ガラスを使用している","english_definition":"(chiefly of windows in buildings) made of or using a single layer of leaded glass.","examples":[{"sentence":"The house had single-leaded windows that were original to its construction.","translation":"その家には、建設当初からの単層の鉛ガラス窓があった。"},{"sentence":"He replaced the broken pane with single-leaded glass.","translation":"彼は壊れた窓ガラスを単層の鉛ガラスで交換した。"}],"collocations":["single-leaded window","single-leaded glass"],"synonyms":[],"antonyms":["double-leaded","triple-leaded"]}],"etymology":{"value":"'single' + 'leaded'. 'Leaded' refers to glass panes held together by lead cames (strips of lead).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪŋɡəl ˈlɛdɪd/","syllables":"sin-gle-lead-ed"},"inflection":{},"usage_notes":{"explanation":"The term 'single-leaded' is primarily used in architectural contexts to describe windows or glass structures where a single layer of leaded glass is used. It distinguishes this type of construction from double-leaded or triple-leaded windows, which offer better insulation and structural integrity.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["leaded glass","double-leaded","triple-leaded"],"related_terms":["stained glass","came"],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'single-leaded' is a technical term primarily used in architecture and construction. It refers to a type of window or glass structure that uses a single layer of leaded glass. Understanding this term requires familiarity with architectural terminology and construction methods."},"example_sentences":[{"sentence":"The antique shop specialized in restoring single-leaded windows from the Victorian era.","translation":"そのアンティークショップは、ビクトリア時代の単層の鉛ガラス窓の修復を専門としていた。","type":"example","meaning_category":"description"},{"sentence":"The architect specified single-leaded glass for the decorative panels in the lobby.","translation":"建築家は、ロビーの装飾パネルに単層の鉛ガラスを指定した。","type":"example","meaning_category":"specification"}]}