{"word":"Fogon","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(グアテマラにある)フォゴ山","english_definition":"Volcán de Fuego (also known as Chi Q'aq', or simply Fuego) is an active stratovolcano in Guatemala, close to the city of Antigua.","examples":[{"sentence":"Fogon is one of the most active volcanoes in Guatemala.","translation":"フォゴ山はグアテマラで最も活発な火山の一つです。"},{"sentence":"The eruption of Fogon in 2018 caused significant damage.","translation":"2018年のフォゴ山の噴火は甚大な被害をもたらしました。"}],"collocations":["Fogon eruption (フォゴ山の噴火)","Volcan Fogon (フォゴ山)"],"synonyms":["Volcán de Fuego","Chi Q'aq'"],"antonyms":[]}],"etymology":{"value":"The name 'Fuego' means 'fire' in Spanish, referring to the volcano's frequent eruptions.","priority":"★★☆"},"pronunciation":{"ipa":"/foˈɡon/","syllables":"Fo-gon"},"inflection":{"notes":"It is a proper noun, so it does not have plural forms."},"usage_notes":{"explanation":"'Fogon' refers specifically to the Volcán de Fuego in Guatemala. It is often used in news reports and geographical discussions about the region.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a fogon in Japan.","correct":"✓ I saw a volcano in Japan.","note":"'Fogon' specifically refers to the volcano in Guatemala, not just any volcano."}],"priority":"★★☆"},"related_words":{"derivatives":["volcanic","eruption","Guatemala"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Fogon' is a proper noun referring to a specific volcano in Guatemala. Understanding its meaning requires knowledge of geography and current events related to Central America. It is not a common word in general English conversation but may appear in news articles or documentaries about natural disasters or geological phenomena."},"example_sentences":[{"sentence":"The Volcán de Fuego, or Fogon, is visible from Antigua on a clear day.","translation":"晴れた日には、フォゴ山、すなわちフォゴ山はアンティグアから見ることができます。","type":"noun","meaning_category":"Volcano"},{"sentence":"Scientists are constantly monitoring Fogon for signs of increased activity.","translation":"科学者たちは活動が活発化する兆候がないか、フォゴ山を常に監視しています。","type":"noun","meaning_category":"Volcano"}]}