{"word":"Dynastid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(昆虫) カブトムシ亜科の昆虫","english_definition":"A beetle of the subfamily Dynastinae (formerly Dynastidae) in the family Scarabaeidae (scarab beetles).","examples":[{"sentence":"Dynastids are known for their impressive horns and large size.","translation":"カブトムシ亜科の昆虫は、その印象的な角と大きな体で知られています。"}],"collocations":["Dynastid beetle","Dynastid larva"],"synonyms":["rhinoceros beetle","scarab beetle"],"antonyms":[]}],"etymology":{"value":"Derived from Dynastinae, the scientific name of the subfamily.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdɪnəstɪd/","syllables":"Dy-nas-tid"},"inflection":{"noun_plural":"Dynastids"},"usage_notes":{"explanation":"'Dynastid' is a term used to refer to beetles belonging to the subfamily Dynastinae. These beetles are often large and characterized by prominent horns, especially in males. The term is more commonly used in scientific or entomological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a dynastid on the flower. It was a butterfly.","correct":"✓ I saw a dynastid on the flower. It was a beetle.","note":"Dynastids are beetles, not butterflies."}],"priority":"★★☆"},"related_words":{"derivatives":["Dynastinae (subfamily)","Scarabaeidae (family)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Dynastid' refers to a specific type of beetle within the Dynastinae subfamily. It is a technical term primarily used in scientific or entomological contexts. Understanding this word requires some familiarity with insect classification. The word itself is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The male Dynastid uses its horn to fight other males for mating rights.","translation":"雄のカブトムシ亜科の昆虫は、交尾の権利を求めて他の雄と戦うために角を使います。","type":"noun","meaning_category":"昆虫"},{"sentence":"Many species of Dynastids are found in tropical regions.","translation":"多くのカブトムシ亜科の昆虫は熱帯地域で見られます。","type":"noun","meaning_category":"昆虫"}]}