{"word":"timber-boring","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"木材を穿孔する、木材に穴を開ける","english_definition":"Describing organisms (typically insects or mollusks) that bore into timber, creating tunnels or holes.","examples":[{"sentence":"Timber-boring beetles can cause significant structural damage to wooden buildings.","translation":"木材を穿孔する甲虫は、木造建築物に重大な構造的損傷を与える可能性があります。"},{"sentence":"The presence of timber-boring organisms can weaken wooden structures over time.","translation":"木材を穿孔する生物の存在は、時間の経過とともに木造構造物を弱める可能性があります."}],"collocations":["timber-boring insects","timber-boring beetles","timber-boring mollusks","timber-boring damage","timber-boring pests"],"synonyms":["wood-boring","xylophagous"],"antonyms":[],"notes":"Often used in the context of pest control and structural engineering."}],"etymology":{"value":"Derived from the combination of 'timber' (wood used for building) and 'boring' (the act of making a hole by drilling or digging).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɪmbərˌbɔːrɪŋ/","syllables":"tim-ber-bor-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns."},"usage_notes":{"explanation":"The term 'timber-boring' is primarily used in technical contexts, such as entomology, construction, and forestry, to describe organisms that damage wood by boring into it. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The timber-boring was extensive.","correct":"✓ The timber-boring damage was extensive.","note":"'Timber-boring' is an adjective, not a noun. Use it to describe something, like 'timber-boring damage' or 'timber-boring insects.'"},{"incorrect":"✗ The timber is boring.","correct":"✓ The timber has timber-boring insects.","note":"'The timber is boring' implies the wood itself is dull. To indicate that the timber is being bored into, specify the cause, such as 'timber-boring insects' or 'timber-boring damage'."}],"priority":"★☆☆"},"related_words":{"derivatives":["timber (noun): wood prepared for use in building and carpentry.","bore (verb): to make a hole in something with a tool or by digging.","borer (noun): an insect or tool that bores into wood or other material.","woodworm (noun): the larva of a timber-boring beetle."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily found in technical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'timber-boring' is a specialized term used to describe organisms that bore into wood. It is most likely to be encountered in technical or scientific contexts related to construction, forestry, or entomology. Understanding this term requires a familiarity with technical vocabulary related to wood and pest control."},"example_sentences":[{"sentence":"The structural engineer identified extensive damage caused by timber-boring insects.","translation":"構造エンジニアは、木材を穿孔する昆虫によって引き起こされた広範囲な損傷を特定しました。","type":"adjective","meaning_category":"木材を穿孔する"},{"sentence":"Preventative treatments are essential to protect timber from timber-boring pests.","translation":"予防的処理は、木材を木材を穿孔する害虫から保護するために不可欠です。","type":"adjective","meaning_category":"木材を穿孔する"}]}