{"word":"nitriary","meanings":[{"part_of_speech":"noun","definition":"A place where saltpetre is made.","english_definition":"A place where saltpetre (potassium nitrate), an ingredient of gunpowder, is manufactured or found naturally.","examples":[{"sentence":"The old nitriary was abandoned long ago, its purpose forgotten by most.","translation":"その古い硝石製造所はとうの昔に放棄され、その目的はほとんどの人に忘れ去られていた。"},{"sentence":"Historically, nitriaries were important for supplying the raw materials for explosives.","translation":"歴史的に、硝石製造所は爆薬の原料を供給するために重要だった。"}],"synonyms":["saltpetre bed","nitrate works"],"antonyms":[]}],"etymology":{"value":"Derived from 'nitre' (a historical term for potassium nitrate or sodium nitrate) + '-ary' (a suffix denoting a place or thing associated with).","priority":"★★☆"},"pronunciation":{"ipa":"ˈnaɪtrɪˌɛri","syllables":"ni-tri-ar-y"},"inflection":{"noun_plural":"nitriaries"},"usage_notes":{"explanation":"The term 'nitriary' is somewhat archaic and specialized. It refers specifically to a location used for the production or natural occurrence of saltpetre, a key component in the manufacture of gunpowder and other explosives. The word is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nitriary was a place for growing plants.","correct":"✓ The nitriary was a place for making saltpetre.","note":"Nitriaries are for saltpetre production, not plant cultivation."}],"priority":"★★☆"},"related_words":{"derivatives":["nitre","nitrate","nitrification"],"related_terms":["saltpetre","gunpowder"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - specialized and archaic term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'nitriary' is a specialized and uncommon term, primarily encountered in historical or technical contexts related to the production of gunpowder or the study of nitrates. It refers to a place where saltpetre, a key ingredient in gunpowder, is manufactured or found naturally. Due to its limited usage, it is unlikely to be familiar to non-specialists. Understanding the etymology (related to 'nitre' and 'nitrate') can aid in deciphering its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The historical records mention a nitriary located near the old fort.","translation":"歴史的記録には、古い砦の近くに硝石製造所があったことが記されている。","type":"noun","meaning_category":"Place of saltpetre production"},{"sentence":"The soil in the abandoned nitriary was rich in nitrates.","translation":"放棄された硝石製造所の土壌は硝酸塩が豊富だった。","type":"noun","meaning_category":"Place of saltpetre production"}]}