{"word":"pordiosero","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"物乞い、乞食","english_definition":"beggar, mendicant","examples":[{"sentence":"El pordiosero extendió su mano pidiendo limosna.","translation":"The beggar extended his hand asking for alms."},{"sentence":"Muchos pordioseros duermen en las calles de la ciudad.","translation":"Many beggars sleep on the streets of the city."}],"collocations":["ser un pordiosero (to be a beggar)","vivir como un pordiosero (to live like a beggar)"],"synonyms":["mendigo","indigente","limosnero"],"antonyms":["rico","adinerado"]}],"etymology":{"value":"Derives from \"por Dios\", meaning \"for God\", which is a common phrase used by beggars when asking for alms.","priority":"★★☆"},"pronunciation":{"ipa":"/poɾˈðjosero/","syllables":"por-dio-se-ro"},"inflection":{"noun_gender":"masculine","noun_plural":"pordioseros"},"usage_notes":{"explanation":"The term \"pordiosero\" is used to describe someone who begs for money or food, often due to poverty. It can sometimes carry a negative connotation, implying a lack of self-sufficiency.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Él es un pordiosera.","correct":"Él es un pordiosero.","note":"\"Pordiosero\" is a masculine noun, so the correct form is \"pordiosero\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["pordiosería (beggary, the condition of being a beggar)"],"phrases":["Vivir de la pordiosería (to live by begging)"],"priority":"★★☆"},"level_frequency":{"level":"B2","frequency_corpus":"Low frequency"},"readability_explanation":{"level":"B2","text":"The word \"pordiosero\" is not commonly used in everyday conversation but is more often found in literature or formal contexts to describe a beggar. It's important to understand the cultural context, as the term can sometimes be seen as derogatory."},"example_sentences":[{"sentence":"El pordiosero pedía comida a las puertas de la iglesia.","translation":"The beggar was asking for food at the doors of the church.","type":"example","meaning_category":"beggar"},{"sentence":"La vida del pordiosero era dura y llena de dificultades.","translation":"The life of the beggar was hard and full of difficulties.","type":"example","meaning_category":"beggar"}]}