{"word":"tearthroat","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"感傷的な映画や小説、メロドラマ","english_definition":"A movie, play, or novel intended to elicit strong emotional responses, especially sadness or sympathy, from the audience.","examples":[{"sentence":"The movie was a real tearthroat; everyone in the theater was crying.","translation":"その映画は本当に感傷的で、劇場にいた誰もが泣いていた。"},{"sentence":"She enjoys reading tearthroats in her free time.","translation":"彼女は暇な時間に感傷的な小説を読むのを楽しんでいる。"}],"collocations":["classic tearthroat","romantic tearthroat","family tearthroat"],"synonyms":["melodrama","weepie","soap opera","sentimental story"],"antonyms":["comedy","farce","satire"]},{"part_of_speech":"adjective","definition":"感傷的な、涙を誘うような","english_definition":"Designed to evoke strong emotional responses, especially sadness or sympathy.","examples":[{"sentence":"It was a tearthroat story about a family overcoming adversity.","translation":"それは逆境を乗り越える家族についての感傷的な物語だった。"},{"sentence":"The tearthroat ending left the audience emotionally drained.","translation":"その涙を誘う結末は、観客を感情的に疲れさせた。"}],"collocations":["tearthroat movie","tearthroat ending","tearthroat scene"],"synonyms":["sentimental","emotional","melodramatic","heartrending","pathetic"],"antonyms":["humorous","funny","comedic","lighthearted"]}],"etymology":{"value":"A combination of 'tear' (referring to crying) and 'throat' (suggesting a strong emotional impact that affects the throat).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɪərˌθroʊt/","syllables":"tear-throat"},"inflection":{"notes":"The noun form is countable. The adjective form does not inflect."},"usage_notes":{"explanation":"'Tearthroat' is used to describe stories or movies that are intentionally designed to make the audience cry or feel strong emotions. It often implies a degree of manipulation or exaggeration in the emotional content. While the term is sometimes used neutrally, it can also carry a slightly negative connotation, suggesting that the work is overly sentimental or manipulative.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a tearthroat about his life.","correct":"✓ He wrote a tearjerker about his life.","note":"'Tearjerker' is a more common and widely understood synonym for a story designed to make people cry. 'Tearthroat' is less frequently used."},{"incorrect":"✗ The tearthroat was very happy.","correct":"✓ The story was very tearthroat.","note":"'Tearthroat' as an adjective describes the quality of the story, not the emotional state of the story itself."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"synonyms":["tearjerker","weepie","melodrama","soap opera"],"antonyms":["comedy","farce","satire"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tearthroat' is a relatively uncommon word used to describe a story, movie, or play that is designed to evoke strong emotions, particularly sadness. It implies that the work is intended to make the audience cry or feel deeply moved. It's often used to describe melodramatic or overly sentimental works. The word combines 'tear' (referring to crying) and 'throat' (suggesting a strong emotional impact)."},"example_sentences":[{"sentence":"The play was a classic tearthroat, complete with tragic love and untimely death.","translation":"その劇は、悲劇的な愛と早すぎる死を伴う、典型的な感傷的なメロドラマだった。","type":"noun","meaning_category":"感傷的な映画や小説"},{"sentence":"She admitted to enjoying tearthroat movies, even though they always made her cry.","translation":"彼女は、いつも泣いてしまうにもかかわらず、感傷的な映画を楽しむことを認めた。","type":"noun","meaning_category":"感傷的な映画や小説"},{"sentence":"The novel's tearthroat plot involved a long-lost child and a dying parent.","translation":"その小説の涙を誘うプロットは、長年行方不明だった子供と死にかけている親を含んでいた。","type":"adjective","meaning_category":"感傷的な、涙を誘うような"},{"sentence":"The tearthroat scene where the dog dies always gets to me.","translation":"犬が死ぬ涙を誘うシーンは、いつも私を感動させる。","type":"adjective","meaning_category":"感傷的な、涙を誘うような"}]}