{"word":"retentionist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"死刑存置論者、死刑制度維持論者","english_definition":"A person who supports the retention of capital punishment; an advocate for maintaining the death penalty.","examples":[{"sentence":"As a retentionist, he believes that the death penalty serves as a deterrent.","translation":"死刑存置論者として、彼は死刑が抑止力になると信じている。"},{"sentence":"The retentionists argued that abolishing the death penalty would lead to an increase in violent crime.","translation":"死刑存置論者たちは、死刑を廃止すれば凶悪犯罪が増加すると主張した。"}],"collocations":["strong retentionist","staunch retentionist","vocal retentionist","opponents of retentionists"],"synonyms":["capital punishment supporter","death penalty advocate"],"antonyms":["abolitionist","anti-death penalty activist"]},{"part_of_speech":"adjective","definition":"死刑存置を支持する、死刑制度維持の","english_definition":"Supporting the retention of capital punishment; advocating for maintaining the death penalty.","examples":[{"sentence":"The politician's retentionist stance was praised by some and criticized by others.","translation":"その政治家の死刑存置を支持する姿勢は、一部からは賞賛され、他の人々からは批判された。"},{"sentence":"The newspaper published a retentionist editorial arguing for the continued use of the death penalty.","translation":"その新聞は、死刑制度の継続的な使用を主張する死刑存置論的な社説を掲載した。"}],"collocations":["retentionist policy","retentionist argument","retentionist view","retentionist position"],"synonyms":["pro-death penalty","capital punishment supporting"],"antonyms":["abolitionist","anti-death penalty"]}],"etymology":{"value":"The word 'retentionist' is derived from 'retention' (the act of keeping something) and the suffix '-ist' (denoting a person who advocates or supports something). In this context, it refers to someone who supports the retention or maintenance of capital punishment.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈtɛnʃənɪst/","syllables":"re-ten-tion-ist"},"inflection":{"noun_plural":"retentionists","notes":"The word follows standard English inflection rules for nouns and adjectives."},"usage_notes":{"explanation":"'Retentionist' is used specifically in the context of the death penalty debate. It is a neutral term, though it can sometimes carry a slightly negative connotation depending on the speaker's views. It is important to use this term accurately to avoid misrepresenting someone's position on capital punishment. The term is contrasted with 'abolitionist,' which refers to someone who opposes the death penalty and advocates for its abolition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a retention.","correct":"✓ He is a retentionist.","note":"'Retention' is a noun referring to the act of retaining, while 'retentionist' is the noun referring to a person who supports retention of something (in this case, the death penalty)."},{"incorrect":"✗ She has a retention view on the death penalty.","correct":"✓ She has a retentionist view on the death penalty.","note":"'Retention' is a noun, while 'retentionist' is the adjective form used to describe the view or position."}],"priority":"★★☆"},"related_words":{"derivatives":["retention (noun)","retain (verb)"],"related_terms":["capital punishment","death penalty","abolitionist","deterrence"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Used primarily in academic or political discussions about capital punishment.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'retentionist' is a specialized term used in discussions about the death penalty. It refers to someone who supports keeping capital punishment as a legal penalty. The word is formed by adding the suffix '-ist' to 'retention,' which means the act of keeping or maintaining something. Understanding this word requires familiarity with the debate surrounding capital punishment and the different positions one can take on the issue. It is more commonly found in academic or political contexts.","example_sentences":[{"sentence":"The **retentionist** movement has seen a resurgence in some countries.","translation":"死刑存置運動は、一部の国で再燃している。","type":"noun","meaning_category":"Supporter of capital punishment"},{"sentence":"The **retentionist** argument often focuses on the concept of retribution.","translation":"死刑存置論者の主張は、しばしば報復の概念に焦点を当てている。","type":"adjective","meaning_category":"Supporting capital punishment"}]},"japanese_conjugation":{"noun":"死刑存置論者","adjective":"死刑存置の"}}