{"word":"disslander","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who insults or disparages the country or region they are from.","english_definition":"A person who speaks negatively or critically about their own country or region.","examples":[{"sentence":"He was labeled a dislander for his critical remarks about his hometown.","translation":"彼は故郷に対する批判的な発言で、ディスランダーというレッテルを貼られた。"},{"sentence":"Some view her as a dislander because she often highlights the negative aspects of her nation.","translation":"彼女は自国の否定的な側面を強調することが多いため、ディスランダーと見なす人もいる。"}],"collocations":["criticize one's own country","speak negatively about one's homeland","denigrate one's nation"],"synonyms":["critic","detractor","cynic"],"antonyms":["patriot","nationalist","supporter"]}],"etymology":{"value":"A blend of 'diss' (slang for disrespect or disparage) and 'lander' (referring to someone from a particular land or country).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈlændər/","syllables":"diss-lan-der"},"inflection":{"noun_plural":"disslanders"},"usage_notes":{"explanation":"'Disslander' is a relatively new and informal term, often used in online discussions or social media. It carries a negative connotation, implying that the person is disloyal or unappreciative of their own country or region.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a dislander because she lives abroad.","correct":"✓ She is a dislander because she constantly criticizes her country.","note":"Living abroad does not automatically make someone a dislander. The term refers to those who actively disparage their own country, not simply those who reside elsewhere."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Disslander' is an informal term used to describe someone who criticizes their own country or region. The term carries a negative connotation, suggesting disloyalty or a lack of appreciation for one's homeland. It's a blend of 'diss' (disrespect) and 'lander' (someone from a particular land)."},"example_sentences":[{"sentence":"The politician was accused of being a dislander after his controversial comments on national television.","translation":"その政治家は、全国テレビでの物議を醸す発言の後、ディスランダーであると非難された。","type":"noun","meaning_category":"critic of own country"},{"sentence":"Many online debates revolve around whether certain commentators are genuine critics or simply dislanders.","translation":"多くのオンライン討論は、特定のコメンテーターが本物の批評家なのか、単なるディスランダーなのかを巡って展開される。","type":"noun","meaning_category":"critic of own country"}]}