{"word":"non-adiabatic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"断熱的でない、非断熱的な","english_definition":"Not adiabatic; involving heat transfer or energy exchange with the surroundings.","examples":[{"sentence":"The process was non-adiabatic, with significant heat loss to the environment.","translation":"その過程は非断熱的であり、環境への熱損失が大きかった。"},{"sentence":"Non-adiabatic effects can be important in chemical reactions.","translation":"非断熱効果は化学反応において重要となりうる。"}],"collocations":["non-adiabatic process","non-adiabatic transition","non-adiabatic coupling","non-adiabatic effects"],"synonyms":["diabatic"],"antonyms":["adiabatic"],"related_terms":["adiabatic","heat transfer","thermodynamics"]}],"etymology":{"value":"The word 'non-adiabatic' is formed by adding the prefix 'non-' (meaning 'not') to 'adiabatic'. 'Adiabatic' itself comes from the Greek word 'adiabatos', meaning 'impassable' or 'not passing through'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˌædiəˈbætɪk/","syllables":"non-a-di-a-bat-ic"},"inflection":{},"usage_notes":{"explanation":"'Non-adiabatic' describes processes or systems where there is heat transfer or energy exchange with the surroundings. This contrasts with 'adiabatic' processes, where no heat is exchanged. Non-adiabatic processes are common in real-world scenarios, as perfect insulation is often impossible to achieve.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The reaction was adiabatic, despite significant heat release.","correct":"The reaction was non-adiabatic, due to significant heat release.","note":"Adiabatic processes involve no heat exchange, so a process with heat release is non-adiabatic."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["adiabatic","diabatic","heat","thermodynamics","energy transfer"]},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-adiabatic' is a technical term primarily used in physics, chemistry, and engineering. It describes processes where heat is exchanged with the surroundings, which is the opposite of an adiabatic process where no heat is exchanged. Understanding this term requires a background in thermodynamics or related fields."},"example_sentences":[{"sentence":"The compression of the gas was a non-adiabatic process because the container was not perfectly insulated.","translation":"その気体の圧縮は、容器が完全に断熱されていなかったため、非断熱的な過程であった。","type":"general","meaning_category":"general"},{"sentence":"Non-adiabatic transitions between electronic states can lead to complex chemical dynamics.","translation":"電子状態間の非断熱遷移は、複雑な化学ダイナミクスを引き起こす可能性がある。","type":"scientific","meaning_category":"scientific"}]}