{"word":"toxinaemia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"毒血症（血液中に毒素が存在する状態）","english_definition":"A condition in which toxins are present in the blood.","examples":[{"sentence":"The patient was diagnosed with toxinaemia due to a severe infection.","translation":"患者は重度の感染症による毒血症と診断された。"},{"sentence":"Toxinaemia can lead to organ damage if left untreated.","translation":"毒血症は治療せずに放置すると臓器障害を引き起こす可能性がある。"}],"collocations":["cause toxinaemia","treat toxinaemia","severe toxinaemia","acute toxinaemia"],"synonyms":["septicemia","blood poisoning"],"antonyms":[]}],"etymology":{"value":"From 'toxin' (毒素) + '-emia' (血液中の状態を示す接尾辞).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɒksɪˈniːmɪə/","syllables":"tox-i-nae-mi-a"},"inflection":{"noun_plural":"toxinaemias"},"usage_notes":{"explanation":"'Toxinaemia' is a medical term indicating the presence of toxins in the bloodstream. It is often used interchangeably with 'septicemia' or 'blood poisoning', although there may be subtle distinctions depending on the specific toxins and the source of the infection. It's important to note that this is a serious condition requiring prompt medical attention.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor suspected toxemia, but it was actually toxinaemia.","correct":"✓ The doctor suspected toxinaemia.","note":"'Toxemia' is an older term, often used specifically in the context of pregnancy (preeclampsia). 'Toxinaemia' is a more general term for toxins in the blood."}],"priority":"★☆☆"},"related_words":{"derivatives":["toxin","emia","toxic","septic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Toxinaemia' is a technical medical term referring to the presence of toxins in the bloodstream. It is a relatively rare term in general use but important in medical contexts. Understanding the term requires familiarity with medical terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"Prompt treatment is essential to prevent complications from toxinaemia.","translation":"毒血症による合併症を防ぐためには迅速な治療が不可欠です。","type":"general","meaning_category":"medical condition"},{"sentence":"The laboratory tests confirmed the presence of bacterial toxins in the patient's blood, indicating toxinaemia.","translation":"臨床検査の結果、患者の血液中に細菌毒素の存在が確認され、毒血症が示唆された。","type":"medical","meaning_category":"diagnosis"}]}