{"word":"Non-Spanish","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"スペイン語圏ではない、スペイン語を話さない、スペインの文化や起源を持たない","english_definition":"Not of Spanish origin, language, or culture; not related to Spain or the Spanish language.","examples":[{"sentence":"The website offers information in both Spanish and Non-Spanish languages.","translation":"そのウェブサイトはスペイン語とスペイン語以外の言語で情報を提供しています。"},{"sentence":"This section is for Non-Spanish speakers who are learning about Spanish culture.","translation":"このセクションは、スペイン文化について学んでいるスペイン語を話さない人々のためのものです。"},{"sentence":"The study compared the economic impact of Spanish and Non-Spanish tourism in the region.","translation":"その研究は、その地域におけるスペインとスペイン以外の観光の経済的影響を比較しました。"}],"collocations":["Non-Spanish speakers","Non-Spanish language","Non-Spanish culture","Non-Spanish origin","Non-Spanish countries"],"synonyms":["foreign","non-Hispanic","international"],"antonyms":["Spanish"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' to the word 'Spanish', indicating negation or absence of the qualities associated with 'Spanish'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn ˈspænɪʃ/","syllables":"Non-Span-ish"},"inflection":{"notes":"Since it's an adjective, it can be used to modify nouns."},"usage_notes":{"explanation":"\"Non-Spanish\" is used to categorize or differentiate something that is not related to Spain, the Spanish language, or Spanish culture. It's often used in contexts where a comparison or distinction is being made between Spanish and other things.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non spanish restaurant.","correct":"✓ The non-Spanish restaurant.","note":"Hyphenate 'non' with the adjective it modifies."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_adjectives":["Spanish"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"Non-Spanish\" is relatively straightforward. It is used to describe anything that is not related to Spain, the Spanish language, or Spanish culture. It is commonly used in contexts where a distinction is being made between things that are Spanish and things that are not."},"example_sentences":[{"sentence":"The museum features art from Spanish and Non-Spanish artists.","translation":"その美術館には、スペインとスペイン以外のアーティストの作品が展示されています。","type":"adjective","meaning_category":"Not of Spanish origin"},{"sentence":"We need to translate the document into several Non-Spanish languages.","translation":"ドキュメントをいくつかのスペイン語以外の言語に翻訳する必要があります。","type":"adjective","meaning_category":"Not of Spanish language"}]}