{"word":"escutcheons","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(盾形の)紋章板、名札、鍵穴覆い","english_definition":"(1) A shield or shield-shaped surface on which a coat of arms is depicted. (2) A metal plate used for protection or decoration around a keyhole, light switch, or other fitting.","examples":[{"sentence":"The family's escutcheon was prominently displayed above the fireplace.","translation":"その家族の紋章板は暖炉の上に目立つように飾られていた。"},{"sentence":"The antique door featured ornate escutcheons around the keyholes.","translation":"そのアンティークのドアは、鍵穴の周りに華やかな鍵穴覆いが付いていた。"}],"collocations":["coat of arms escutcheon","door escutcheon","keyhole escutcheon"],"synonyms":["shield","plaque","nameplate","keyhole cover"],"antonyms":[]}],"etymology":{"value":"From Old French 'escuchon', diminutive of 'escu' (shield), from Latin 'scutum' (shield).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈskʌtʃənz/","syllables":"es-cutch-eons"},"inflection":{"noun_plural":"escutcheons"},"usage_notes":{"explanation":"'Escutcheon' refers either to a shield-shaped display of a coat of arms, indicating lineage or heraldic significance, or to a protective or decorative plate around a keyhole or fitting. The heraldic sense is less common in modern usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The escutcheon was made of wood and paint.","correct":"✓ The escutcheon displayed the coat of arms.","note":"Ensure correct usage based on context; escutcheons can be decorative or functional."}],"priority":"★☆☆"},"related_words":{"derivatives":["escutcheoned (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'escutcheon' is relatively uncommon and specialized. It refers either to a shield-shaped display of a coat of arms, or a protective/decorative plate around a keyhole. Understanding requires knowledge of heraldry or architectural details."},"example_sentences":[{"sentence":"The knight's escutcheon bore the image of a griffin.","translation":"その騎士の紋章板にはグリフィンの絵が描かれていた。","type":"noun","meaning_category":"紋章板"},{"sentence":"The brass escutcheons on the drawers added an elegant touch to the antique desk.","translation":"引き出しの真鍮製の鍵穴覆いは、そのアンティークの机に優雅さを添えた。","type":"noun","meaning_category":"鍵穴覆い"}]}