{"word":"Isthmians","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(複数形)古代ギリシャのイストミア競技祭の参加者、またはイストミア地峡に住む人々","english_definition":"(plural) Participants in the ancient Greek Isthmian Games, or inhabitants of the Isthmus of Corinth.","examples":[{"sentence":"The Isthmians celebrated their athletic prowess at the games.","translation":"イストミアの人々は競技祭で彼らの優れた運動能力を称えました。"},{"sentence":"The city-state controlled by the Isthmians held a strategic position.","translation":"イストミアの人々によって支配された都市国家は戦略的な位置を占めていました。"}],"collocations":["Isthmian Games","Corinthian Isthmus"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'Isthmus', referring to the Isthmus of Corinth, where the Isthmian Games were held.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪsθmiənz/","syllables":"Isth-mi-ans"},"inflection":{"noun_plural":"Isthmians"},"usage_notes":{"explanation":"'Isthmian' can refer to something related to the Isthmus of Corinth or the Isthmian Games. 'Isthmians' as a plural noun specifically refers to the people associated with the Isthmus or the Games. It is a relatively rare term in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Isthmus","Isthmian"],"related_terms":["Panhellenic Games","Corinth"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Isthmians' is a specialized term related to ancient Greek history and geography. It refers to the people associated with the Isthmus of Corinth or the Isthmian Games. Due to its specific historical context, it is not commonly used in modern English. Understanding requires knowledge of ancient Greek history and geography."},"example_sentences":[{"sentence":"The **Isthmians** were known for their hospitality towards athletes competing in the games.","translation":"イストミアの人々は競技祭に参加する選手たちに対する手厚いもてなしで知られていました。","type":"noun","meaning_category":"People of Isthmus"},{"sentence":"As **Isthmians**, they had a unique perspective on trade and politics in the region.","translation":"イストミアの人々として、彼らはこの地域の貿易と政治について独特の視点を持っていました。","type":"noun","meaning_category":"People of Isthmus"}]}