{"word":"ox-harrow","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"牛に引かせる犂（すき）の一種","english_definition":"A type of harrow drawn by oxen.","examples":[{"sentence":"The farmer used an ox-harrow to prepare the field for planting.","translation":"農夫は牛に引かせる犂を使って、植え付けのために畑を準備した。"}],"collocations":["use an ox-harrow","pull an ox-harrow"],"synonyms":["harrow"],"antonyms":[]}],"etymology":{"value":"The term 'ox-harrow' is a compound word combining 'ox,' referring to the bovine animal used for traction, and 'harrow,' which is a farming implement used to break up and smooth the surface of the soil.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɒksˌhæroʊ/","syllables":"ox-har-row"},"inflection":{"noun_plural":"ox-harrows"},"usage_notes":{"explanation":"An 'ox-harrow' is a historical farming tool, and its use is less common in modern agriculture, where tractors and other machinery are prevalent. It specifically denotes a harrow that is designed to be pulled by oxen, distinguishing it from those pulled by other animals or machines.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a tractor-harrow pulled by oxen.","correct":"✓ He used an ox-harrow.","note":"An ox-harrow specifically implies that it is pulled by oxen. A 'tractor-harrow' would be pulled by a tractor."}],"priority":"★★☆"},"related_words":{"derivatives":["harrow","ox"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'ox-harrow' refers to a specific type of farming implement used historically. Understanding the term requires knowledge of both 'ox' (a draft animal) and 'harrow' (a farming tool). Its usage is limited to contexts discussing historical or traditional farming practices."},"example_sentences":[{"sentence":"In the old days, an ox-harrow was essential for preparing the soil.","translation":"昔は、牛に引かせる犂は土を準備するために不可欠だった。","type":"noun","meaning_category":"farming tool"}]}