{"word":"Unona","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A former genus of flowering plants in the family Annonaceae. Many species formerly classified under Unona have been reclassified into other genera.","english_definition":"A former genus of flowering plants in the family Annonaceae. Many species formerly classified under Unona have been reclassified into other genera.","examples":[{"sentence":"The genus Unona is no longer widely recognized.","translation":"ウノナ属はもはや広く認識されていません。"},{"sentence":"Several species once known as Unona are now in the genus Desmos.","translation":"かつてウノナとして知られていたいくつかの種は、現在ではデスモス属に分類されています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after the Moluccan name for a species in the genus.","priority":"★★★"},"pronunciation":{"ipa":"/juːˈnoʊnə/","syllables":"U-no-na"},"inflection":{},"usage_notes":{"explanation":"The term 'Unona' is primarily of historical or botanical interest, as the genus has been largely superseded by taxonomic revisions. When encountered, it usually refers to older botanical literature or discussions about plant classification.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Annonaceae (family)","Desmos (genus)"],"priority":"☆☆☆"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'Unona' is a botanical term referring to a former genus of plants. It is unlikely to be encountered outside of specialized botanical contexts or historical literature on plant classification. The term is relevant for those studying taxonomy or the history of botany.","note":"This word is highly specialized and not part of general vocabulary."},"example_sentences":[{"sentence":"The species was initially described as Unona discolor.","translation":"その種は当初、ウノナ・ディスカラーとして記載されました。","type":"botanical","meaning_category":"former genus"},{"sentence":"Taxonomic revisions have moved several Unona species to other genera within Annonaceae.","translation":"分類学的改正により、いくつかのウノナ種はバンレイシ科の他の属に移されました。","type":"botanical","meaning_category":"former genus"}]}