{"word":"squatter","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"不法占拠者、無断居住者","english_definition":"a person who unlawfully occupies an uninhabited building or unused land.","examples":[{"sentence":"The police evicted the squatters from the abandoned building.","translation":"警察は不法占拠者たちを廃墟から強制退去させた。"},{"sentence":"The land was occupied by squatters who built makeshift homes.","translation":"その土地は、仮設住宅を建てた不法占拠者たちによって占拠されていた。"},{"sentence":"The city is trying to deal with the growing problem of squatters.","translation":"市は、増加する不法占拠者の問題に対処しようとしている。"}],"collocations":["evict squatters (不法占拠者を立ち退かせる)","squatter settlement (不法占拠者の居住地)","illegal squatter (不法な不法占拠者)"],"synonyms":["trespasser","intruder","occupier (unauthorized)"],"antonyms":["landlord","owner","tenant"]},{"part_of_speech":"noun","definition":"(歴史的な意味合いで) (オーストラリア、ニュージーランドなどで) 無許可で公有地を占有し、牧畜を行った人","english_definition":"(historical) in Australia and New Zealand, a person who occupied a large tract of Crown land in order to graze livestock.","examples":[{"sentence":"The squatters established large sheep stations in the Australian outback.","translation":"不法占拠者たちはオーストラリアの奥地に大規模な羊牧場を設立した。"},{"sentence":"Many squatters eventually gained legal ownership of the land they occupied.","translation":"多くの不法占拠者は最終的に、占有していた土地の法的権利を得た。"},{"sentence":"The history of squatters is an important part of Australian colonial history.","translation":"不法占拠者の歴史は、オーストラリアの植民地時代の歴史の重要な一部である。"}],"collocations":["pastoral squatter (牧畜を行う不法占拠者)","early squatter (初期の不法占拠者)"],"synonyms":["pioneer","settler"],"antonyms":[]}],"etymology":{"value":"元々は「押しつぶす」や「しゃがむ」を意味する動詞「squat」から派生。土地に「しゃがみ込む」イメージから、不法に土地を占拠する人を指すようになった。オーストラリアやニュージーランドの歴史的な用法は、初期の入植者が無許可で土地を占有したことに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskwɒtər/","syllables":"squat-ter"},"inflection":{"noun_plural":"squatters"},"usage_notes":{"explanation":"「**squatter**」は、許可なく建物や土地を占拠する人を指す言葉です。現代では、多くの場合、放棄された建物や空き地に住む人を指し、多くの場合、違法行為とみなされます。ただし、歴史的な文脈では、特にオーストラリアやニュージーランドでは、初期の入植者が無許可で土地を占有し、牧畜を行った人々を指す場合があります。この歴史的な意味合いは、現代の不法占拠とは異なるニュアンスを持ちます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a squatter in my apartment.","correct":"✓ He is a squatter in the abandoned building.","note":"「squatter」は、通常、放棄された建物や未使用の土地を不法に占拠する人を指します。誰かの所有するアパートに不法に侵入した場合は、「trespasser (不法侵入者)」の方が適切です。"},{"incorrect":"✗ The squatters are very happy to live there.","correct":"✓ The squatters are trying to improve their living conditions.","note":"不法占拠者の生活環境はしばしば劣悪であり、「happy (幸せ)」という形容詞は不適切です。生活状況の改善を試みているという文脈の方がより適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":["squat (動詞: しゃがむ、不法占拠する; 名詞: しゃがむこと、不法占拠; 形容詞: 低くて幅広の)","squatting (名詞: 不法占拠)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"「**squatter**」は、許可なく空いている建物や土地に住む人を指す言葉です。これは通常、違法な行為とみなされます。歴史的には、特にオーストラリアやニュージーランドで、許可なく土地を占有して農業や牧畜を行った人々を指すこともありました。現代的な意味では、しばしば社会問題や住宅問題と関連して使われます。ニュースやドキュメンタリーなどで見かけることがあります。"},"example_sentences":[{"sentence":"The city council is debating how to deal with the squatter problem.","translation":"市議会は、不法占拠者の問題をどのように処理するかについて議論している。","type":"noun","meaning_category":"不法占拠者"},{"sentence":"The squatters built a community garden on the abandoned lot.","translation":"不法占拠者たちは、放棄された空き地に共同菜園を作った。","type":"noun","meaning_category":"不法占拠者"},{"sentence":"In the 19th century, squatters played a significant role in the development of Australia's agricultural industry.","translation":"19世紀には、不法占拠者たちはオーストラリアの農業産業の発展に重要な役割を果たした。","type":"noun","meaning_category":"(歴史的な)不法占拠者"}]}