{"word":"non-homopolymeric","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"非ホモポリマー性の","english_definition":"Not consisting of a homopolymer; not having a structure composed of identical repeating units.","examples":[{"sentence":"The material is described as non-homopolymeric, indicating a more complex structure.","translation":"その材料は非ホモポリマー性であると記述されており、より複雑な構造を示唆している。"},{"sentence":"Non-homopolymeric polysaccharides often exhibit diverse biological activities.","translation":"非ホモポリマー性の多糖類は、多様な生物活性を示すことが多い。"}],"collocations":["non-homopolymeric material","non-homopolymeric polysaccharide","non-homopolymeric structure"],"synonyms":["heteropolymeric","copolymeric"],"antonyms":["homopolymeric"],"notes":"Typically used in scientific or technical contexts, especially in chemistry, biology, and materials science."}],"etymology":{"value":"Formed by adding the prefix \"non-\" (meaning \"not\") to \"homopolymeric\".","priority":"low"},"pronunciation":{"ipa":"/ˌnɒnˌhoʊməpɒlɪˈmɛrɪk/","syllables":"non-ho-mo-pol-y-mer-ic"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"This term is used to describe polymers that are made up of different types of repeating units, as opposed to homopolymers, which are made up of only one type of repeating unit. It's a technical term primarily used in scientific and technical fields.","priority":"low"},"related_words":{"derivatives":["homopolymer","polymer","copolymer"],"related_terms":["polymerization","monomer","repeating unit"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in scientific literature.","priority":"low"},"readability_explanation":{"level":"C2","text":"This is a highly technical term used in chemistry and materials science. It refers to a polymer that is not a homopolymer, meaning it's composed of more than one type of repeating monomer unit. Understanding requires a background in polymer chemistry."},"example_sentences":[{"sentence":"The synthesized non-homopolymeric compound showed improved thermal stability.","translation":"合成された非ホモポリマー性化合物は、改善された熱安定性を示した。","type":"technical","meaning_category":"describing a material"},{"sentence":"Analysis revealed the sample to be a complex non-homopolymeric mixture.","translation":"分析により、サンプルが複雑な非ホモポリマー性混合物であることが明らかになった。","type":"scientific","meaning_category":"chemical composition"}]}