{"word":"gastritis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"胃炎","english_definition":"inflammation of the lining of the stomach.","examples":[{"sentence":"He was diagnosed with chronic gastritis.","translation":"彼は慢性胃炎と診断された。"},{"sentence":"Gastritis can be caused by bacterial infection or certain medications.","translation":"胃炎は細菌感染や特定の薬によって引き起こされることがある。"},{"sentence":"Symptoms of gastritis include abdominal pain, nausea, and vomiting.","translation":"胃炎の症状には腹痛、吐き気、嘔吐などがある。"}],"collocations":["acute gastritis (急性胃炎)","chronic gastritis (慢性胃炎)","erosive gastritis (びらん性胃炎)","gastritis symptoms (胃炎の症状)","gastritis treatment (胃炎の治療)","gastritis diet (胃炎の食事療法)"],"synonyms":["stomach inflammation","gastric inflammation"],"antonyms":[]}],"etymology":{"value":"From Greek 'gaster' (stomach) + '-itis' (inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ɡæˈstraɪtɪs/","syllables":"gas-tri-tis"},"inflection":{"noun_plural":"gastritides (less common), gastritises"},"usage_notes":{"explanation":"Gastritis refers to inflammation of the stomach lining. It can be acute (sudden onset) or chronic (long-lasting). Common causes include Helicobacter pylori (H. pylori) infection, overuse of nonsteroidal anti-inflammatory drugs (NSAIDs), excessive alcohol consumption, and stress. Diagnosis often involves endoscopy and biopsy. Treatment depends on the cause and may include antibiotics, acid-reducing medications, and lifestyle changes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a gastritis in my stomach.","correct":"✓ I have gastritis.","note":"Gastritis is the condition itself, so the article 'a' is not usually used unless specifying a particular type (e.g., 'I have a severe case of gastritis')."},{"incorrect":"✗ Gastritis is contagious.","correct":"✓ H. pylori infection, which can cause gastritis, is contagious.","note":"Gastritis itself is not contagious, but if it's caused by an H. pylori infection, that infection can be spread. Not all gastritis is caused by H. pylori."}],"priority":"★★☆"},"related_words":{"derivatives":["gastric (adjective: relating to the stomach)","gastroenteritis (noun: inflammation of the stomach and intestines)","gastropathy (noun: disease of the stomach)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gastritis' is a medical term referring to inflammation of the stomach lining. It's important to understand that while the term itself describes a condition, the causes can vary widely, from bacterial infections to lifestyle factors like diet and medication use. When discussing gastritis, it's often necessary to specify whether it's acute or chronic, and what the suspected cause is. This term is most likely to be encountered in medical settings or when discussing health-related topics.","priority":"★★☆"},"example_sentences":[{"sentence":"Long-term use of NSAIDs can lead to **gastritis**.","translation":"NSAIDsの長期使用は胃炎につながる可能性がある。","type":"noun","meaning_category":"inflammation of the stomach lining"},{"sentence":"The doctor performed an endoscopy to diagnose the **gastritis**.","translation":"医師は胃炎を診断するために内視鏡検査を行った。","type":"noun","meaning_category":"inflammation of the stomach lining"},{"sentence":"A bland diet is often recommended for people with **gastritis**.","translation":"胃炎の人には、刺激の少ない食事がよく推奨される。","type":"noun","meaning_category":"inflammation of the stomach lining"}]}