{"word":"idrofobia","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(医学) 狂犬病、恐水病","english_definition":"(medicine) rabies, hydrophobia","examples":[{"sentence":"L'idrofobia è una malattia virale che colpisce il sistema nervoso centrale.","translation":"狂犬病は中枢神経系に影響を与えるウイルス性の病気です。"}],"collocations":["avere l'idrofobia (狂犬病にかかる)","sintomi dell'idrofobia (狂犬病の症状)","vaccino contro l'idrofobia (狂犬病ワクチン)"],"synonyms":["rabbia"],"antonyms":[]}],"etymology":{"value":"Dal greco antico ὑδροφοβία (hudrophobía), composto di ὕδωρ (húdōr, \"acqua\") e φόβος (phóbos, \"paura\"), letteralmente \"paura dell'acqua\". Questo nome deriva dal fatto che uno dei sintomi più caratteristici della rabbia è la difficoltà e il dolore nella deglutizione, che porta il malato a evitare di bere.","priority":"★★☆"},"pronunciation":{"ipa":"/i.dro.foˈbi.a/","syllables":"i-dro-fo-bi-a"},"inflection":{"noun_forms":{"singular":"idrofobia","plural":"N/A (uncountable)"}},"usage_notes":{"explanation":"\"Idrofobia\" è un termine medico che si riferisce specificamente alla rabbia, una malattia virale mortale se non trattata. Il termine sottolinea uno dei sintomi più notevoli della malattia, ovvero la paura o l'avversione all'acqua, causata da spasmi muscolari alla gola che rendono difficile deglutire.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Ho l'idrofobia dell'altezza.","correct":"✓ Ho paura dell'altezza.","note":"\"Idrofobia\" si riferisce esclusivamente alla rabbia. Per altre paure, si usa il termine generico \"paura\" o il termine specifico per quella fobia (es. acrofobia per la paura dell'altezza)."}],"priority":"★★☆"},"related_words":{"derivatives":["idrofobo (agg. affetto da idrofobia, che ha paura dell'acqua)"],"phrasal_verbs":[],"related_medical_terms":["rabbia (rabbies)","virus della rabbia (rabies virus)","vaccinazione antirabbica (rabies vaccination)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Idrofobia\" è un termine medico specialistico che indica la rabbia, una malattia virale che colpisce il sistema nervoso. Il termine deriva dalla paura dell'acqua che si manifesta nei pazienti affetti da questa malattia a causa delle difficoltà di deglutizione. È importante usare questo termine nel contesto medico appropriato e non confonderlo con paure generiche.","italian_wikipedia_link":"https://it.wikipedia.org/wiki/Rabbia_(malattia)"},"example_sentences":[{"sentence":"L'idrofobia è quasi sempre fatale se non si interviene con la profilassi post-esposizione.","translation":"狂犬病は、曝露後の予防措置を講じなければ、ほぼ常に致命的です。","type":"noun","meaning_category":"狂犬病"},{"sentence":"I sintomi iniziali dell'idrofobia possono includere febbre, mal di testa e debolezza.","translation":"狂犬病の初期症状には、発熱、頭痛、脱力感などがあります。","type":"noun","meaning_category":"狂犬病"}]}