{"word":"polygenist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"多源論者、人類多起源説論者","english_definition":"A person who believes in polygenism, the theory that different races of humans originated from different ancestral lines or species.","examples":[{"sentence":"The polygenist argued that different races were fundamentally different species.","translation":"多源論者は、異なる人種は根本的に異なる種であると主張した。"},{"sentence":"Historically, polygenists used their theories to justify racial inequality.","translation":"歴史的に、多源論者は、人種間の不平等さを正当化するために彼らの理論を用いた。"}],"collocations":["leading polygenist","prominent polygenist","historical polygenist","scientific polygenist","argue as a polygenist","theories of polygenist"],"synonyms":["racial separatist","anti-monogenist"],"antonyms":["monogenist"],"notes":"Polygenism is now widely discredited as a pseudoscientific theory used to support racism."}],"etymology":{"value":"From 'poly-' (meaning 'many') + 'genesis' (meaning 'origin') + '-ist' (a suffix indicating a believer in a doctrine).","priority":"★★★"},"pronunciation":{"ipa":"/pəˈlɪdʒənɪst/","syllables":"pol-y-gen-ist"},"inflection":{"noun_plural":"polygenists"},"usage_notes":{"explanation":"The term 'polygenist' is primarily used in historical contexts when discussing the development of racial theories. It is important to approach this topic with sensitivity and awareness of its problematic history.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He considered himself a polygenetic.","correct":"✓ He considered himself a polygenist.","note":"'Polygenetic' refers to something having multiple origins, while 'polygenist' refers to a person who believes in polygenism."}],"priority":"★★☆"},"related_words":{"derivatives":["polygeny","polygenism"],"related_terms":["monogenism","monogenist","race theory","scientific racism"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency. The term is mostly used in academic or historical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Polygenist' is a term used to describe someone who believes that different races of humans have different origins. This idea, called polygenism, is not scientifically supported and has been used to justify racism. The word is mostly used when talking about the history of scientific racism."},"example_sentences":[{"sentence":"Some 19th-century scientists were polygenists, believing in separate origins for different races.","translation":"19世紀の科学者の中には、多源論者であり、異なる人種には異なる起源があると信じていた者がいた。","type":"noun","meaning_category":"多源論者"},{"sentence":"The polygenist's views were widely criticized for their racist implications.","translation":"その多源論者の見解は、その人種差別的な意味合いから広く批判された。","type":"noun","meaning_category":"多源論者"}]}