{"word":"hypermeter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(音楽)ハイパーメーター：通常の小節よりも高次の拍のグループ。通常、フレーズ構造における小節のグループ化を指す。","english_definition":"(Music) A hypermeter is a higher-level metric grouping of measures, as opposed to the beats within a measure. It typically refers to the grouping of measures in phrase structure.","examples":[{"sentence":"The hypermeter in this piece is four measures long.","translation":"この曲のハイパーメーターは4小節の長さです。"},{"sentence":"Analyzing the hypermeter reveals the underlying structure of the melody.","translation":"ハイパーメーターを分析することで、メロディーの根底にある構造が明らかになります。"}],"collocations":["hypermeter analysis (ハイパーメーター分析)","hypermeter structure (ハイパーメーター構造)","four-measure hypermeter (4小節のハイパーメーター)","eight-measure hypermeter (8小節のハイパーメーター)"],"synonyms":["phrase rhythm","macro-rhythm"],"antonyms":[]}],"etymology":{"value":"「hyper-」（超越した、より高い）と「meter」（韻律、拍子）の組み合わせに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˈmiːtər/","syllables":"hy-per-me-ter"},"inflection":{"noun_plural":"hypermeters"},"usage_notes":{"explanation":"ハイパーメーターは、音楽理論において、小節がより大きなグループ（ハイパー小節）を形成する構造を指します。通常の小節内の拍のグループ化と同様に、ハイパーメーターはフレーズの構造を理解する上で重要です。通常、強拍と弱拍のパターンを持ち、フレーズの開始や終止を強調します。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hypermeter is the same as the time signature.","correct":"✓ The hypermeter is a higher-level grouping of measures, while the time signature indicates the number of beats in a measure.","note":"拍子記号は小節内の拍数を定義しますが、ハイパーメーターは小節のグループ化を指します。"},{"incorrect":"✗ Hypermeter is only used in classical music.","correct":"✓ Hypermeter can be found in various genres of music, not just classical.","note":"ハイパーメーターの概念は、クラシック音楽だけでなく、ポピュラー音楽やジャズなど、さまざまなジャンルの音楽にも適用できます。"}],"priority":"★☆☆"},"related_words":{"derivatives":["hypermetric (形容詞: ハイパーメーターの)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 音楽理論の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**hypermeter**」は音楽理論で使われる専門用語で、通常の小節よりも大きな単位で拍をグループ化する概念を指します。これは、フレーズ構造を分析する際に、小節がどのようにまとまってより大きなリズムの単位を形成するかを理解するために用いられます。音楽をより深く理解するための概念ですが、日常会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The composer used a complex hypermeter to create a sense of tension and release.","translation":"作曲家は複雑なハイパーメーターを使用して、緊張感と解放感を生み出しました。","type":"noun","meaning_category":"音楽理論"},{"sentence":"By identifying the hypermeter, we can better understand the phrasing of the melody.","translation":"ハイパーメーターを特定することで、メロディーのフレージングをより良く理解することができます。","type":"noun","meaning_category":"音楽理論"}]}