{"word":"unhatchability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ふ化不能性、孵化しない性質","english_definition":"The quality or state of being unable to hatch.","examples":[{"sentence":"The unhatchability of the eggs was a major concern for the poultry farmer.","translation":"その卵の孵化不能性は、養鶏業者にとって大きな懸念事項でした。"},{"sentence":"Factors such as temperature and humidity can affect the unhatchability of bird eggs.","translation":"温度や湿気などの要因は、鳥の卵の孵化不能性に影響を与える可能性があります。"}],"collocations":["egg unhatchability","high unhatchability","low unhatchability","cause of unhatchability"],"synonyms":["non-viability","infertility","non-fertility"],"antonyms":["hatchability","fertility","viability"]}],"etymology":{"value":"Derived from \"un-\" (prefix meaning 'not'), \"hatchable\" (capable of being hatched), and \"-ity\" (suffix indicating a state or quality).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnhætʃəˈbɪləti/","syllables":"un-hatch-a-bil-i-ty"},"inflection":{"noun_plural":"unhatchabilities (rarely used)"},"usage_notes":{"explanation":"\"Unhatchability\" refers specifically to the inability of an egg to hatch, often due to factors such as infertility, improper incubation conditions, or genetic defects. It is commonly used in the context of poultry farming, ornithology, and reproductive biology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unhatchability was caused by the chicken.","correct":"✓ The unhatchability was caused by the hen's poor diet.","note":"The cause of unhatchability is usually a specific factor (e.g., diet, temperature) rather than the animal itself."},{"incorrect":"✗ The egg has unhatchability.","correct":"✓ The egg exhibits unhatchability.","note":"Use \"exhibits unhatchability\" or \"displays unhatchability\" rather than \"has unhatchability\"."}],"priority":"★★☆"},"related_words":{"derivatives":["unhatchable (adjective)","hatch (verb, noun)","hatchability (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Technical term)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unhatchability\" is a technical term used to describe the inability of an egg to hatch. It is primarily used in scientific or agricultural contexts, such as poultry farming or ornithology. The term is formed by adding the prefix \"un-\" to \"hatchability,\" indicating the opposite of being able to hatch. Understanding this term requires a relatively high level of vocabulary and familiarity with technical language."},"example_sentences":[{"sentence":"Research is being conducted to determine the causes of high unhatchability in certain bird species.","translation":"特定の鳥類の高い孵化不能性の原因を特定するための研究が行われています。","type":"noun","meaning_category":"Inability to hatch"},{"sentence":"The unhatchability rate was significantly reduced by improving the incubation conditions.","translation":"孵化条件を改善することで、孵化不能率は大幅に低下しました。","type":"noun","meaning_category":"Inability to hatch"}]}