{"word":"intellectualizing","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"知性化、理知化","english_definition":"A defense mechanism by which reasoning is used to block difficult emotions.","examples":[{"sentence":"Intellectualizing is a common defense mechanism used to avoid dealing with painful feelings.","translation":"知性化は、つらい感情に対処することを避けるために使われる一般的な防衛機制です。"},{"sentence":"By intellectualizing the situation, he distanced himself from the emotional impact.","translation":"状況を知性化することで、彼は感情的な影響から距離を置きました。"}],"collocations":["defense mechanism","emotional detachment","cognitive appraisal"],"synonyms":["rationalization","abstraction","conceptualization"],"antonyms":["emotional expression","feeling","experiencing emotions"]},{"part_of_speech":"verb","definition":"知性化する、理知化する","english_definition":"To engage in intellectualization as a defense mechanism.","examples":[{"sentence":"He tends to intellectualize his problems rather than confronting them directly.","translation":"彼は問題に直接向き合うよりも、知性化する傾向があります。"},{"sentence":"She intellectualized her grief by researching the causes of death.","translation":"彼女は死因を研究することで、悲しみを理知化しました。"}],"collocations":["avoidance","coping mechanism","defense mechanism"],"synonyms":["rationalize","analyze","overthink"],"antonyms":["feel","experience","empathize"]}],"etymology":{"value":"The term 'intellectualizing' comes from the word 'intellectual,' referring to the intellect or reasoning abilities. The suffix '-ize' indicates the process of making something intellectual or using intellect.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntəˈlektʃuəlaɪzɪŋ/","syllables":"in-tel-lec-tu-al-iz-ing"},"inflection":{"verb_forms":{"present_participle":"intellectualizing","past_participle":"intellectualized","simple_past":"intellectualized","simple_present":["intellectualize","intellectualizes"]}},"usage_notes":{"explanation":"'Intellectualizing' is a psychological term that describes a defense mechanism where a person avoids uncomfortable emotions by focusing on intellectual aspects. It involves analyzing, rationalizing, and abstracting the emotional content of a situation. This can provide a temporary escape from painful feelings but may hinder genuine emotional processing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is intellectualizing, so he is very smart.","correct":"He is intellectualizing, which is his way of coping with stress.","note":"Intellectualizing is not simply being smart; it's a defense mechanism to avoid emotions."},{"incorrect":"Intellectualizing is always a good way to solve problems.","correct":"Intellectualizing can be helpful in some situations, but it's not always the best approach for dealing with emotions.","note":"While intellectualizing can provide distance, it may not be the most effective way to process emotions."}],"priority":"★★☆"},"related_words":{"derivatives":["intellectualize","intellectual","intellect","intellectualism"],"phrases":["defense mechanism","emotional regulation","cognitive distortion"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Intellectualizing' is a psychological term referring to a defense mechanism where individuals avoid uncomfortable emotions by focusing on intellectual aspects. It involves analyzing and rationalizing emotional content to create distance. This term is commonly used in psychology and related fields.","priority":"★★☆"},"example_sentences":[{"sentence":"She was intellectualizing the trauma by researching its psychological effects.","translation":"彼女はトラウマの心理的影響を研究することで、トラウマを知性化していました。","type":"verb","meaning_category":"理知化する"},{"sentence":"His intellectualizing served as a barrier to genuine emotional connection.","translation":"彼の知性化は、真の感情的なつながりの障壁となりました。","type":"noun","meaning_category":"知性化"}]}