{"word":"biblicism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"聖書主義、聖書原理主義","english_definition":"strict adherence to the literal interpretation of the Bible.","examples":[{"sentence":"His biblicism led him to reject scientific findings that contradicted the Bible.","translation":"彼の聖書主義は、聖書と矛盾する科学的発見を拒否させた。"},{"sentence":"Biblicism is often associated with conservative religious views.","translation":"聖書主義はしばしば保守的な宗教観と結び付けられる。"}],"collocations":["strict biblicism","literal biblicism","fundamentalist biblicism"],"synonyms":["scripturalism","fundamentalism","literalism"],"antonyms":["liberal theology","higher criticism"]}],"etymology":{"value":"From 'Bible' + '-ism'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɪblɪsɪzəm/","syllables":"bib-li-cism"},"inflection":{"noun_plural":"biblicisms"},"usage_notes":{"explanation":"Biblicism refers to the belief that the Bible is the literal word of God and should be interpreted as such. It is often associated with fundamentalist or conservative religious groups. It can also refer to the use of biblical language or references in literature or speech.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices biblicism in his daily life by reading other religious texts.","correct":"✓ He practices biblicism in his daily life by strictly adhering to the Bible's teachings.","note":"Biblicism is about adhering strictly to the Bible, not other religious texts."}],"priority":"★★☆"},"related_words":{"derivatives":["biblical (adjective)","biblicist (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Biblicism' is a term used to describe the belief that the Bible should be interpreted literally. It's often used in discussions about religion and how people understand religious texts. It's not a common word in everyday conversation, but you might encounter it in academic or theological contexts."},"example_sentences":[{"sentence":"The professor argued against a strict biblicism, advocating for a more nuanced interpretation of scripture.","translation":"教授は厳格な聖書主義に反対し、聖書のよりニュアンスのある解釈を提唱した。","type":"noun","meaning_category":"聖書主義"},{"sentence":"Her biblicism influenced her views on social issues.","translation":"彼女の聖書主義は、社会問題に対する彼女の見解に影響を与えた。","type":"noun","meaning_category":"聖書主義"}]}