{"word":"mouslingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"(rare) In a manner resembling a small mouse; timidly, quietly, or furtively.","english_definition":"In a manner resembling a small mouse; timidly, quietly, or furtively.","examples":[{"sentence":"The thief crept mouslingly through the dark house.","translation":"泥棒は小さなネズミのようにこっそりと暗い家の中を忍び寄った。"},{"sentence":"She spoke mouslingly, afraid of being overheard.","translation":"彼女は聞かれるのを恐れて、小さなネズミのようにひそやかに話した。"}],"collocations":["creep mouslingly","speak mouslingly","move mouslingly"],"synonyms":["timidly","quietly","furtively","stealthily","meekly"],"antonyms":["boldly","loudly","openly"]}],"etymology":{"value":"Derived from the adjective 'mousling' (resembling a small mouse), with the addition of the adverbial suffix '-ly'. 'Mousling' is formed from 'mouse' + '-ling' (a diminutive suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmaʊzlɪŋli/","syllables":"mous-ling-ly"},"inflection":{"notes":"Adverb - does not inflect"},"usage_notes":{"explanation":"The word 'mouslingly' is quite rare and not commonly used in modern English. It evokes an image of smallness, timidity, and quiet movement, similar to that of a mouse. It is often used to describe actions performed in a secretive or furtive manner.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He mouslingly ate the cheese.","correct":"✓ He quietly ate the cheese.","note":"While 'mouslingly' could technically describe someone eating quietly, it's more commonly used to describe movement or speech. 'Quietly' is a more natural and common choice in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["mousling (adjective: resembling a small mouse)","mouse (noun: the animal)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare (not found in common corpora)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Mouslingly' is a very rare and somewhat poetic word. It is formed by combining 'mousling' (resembling a small mouse) with the adverbial suffix '-ly'. Its meaning is relatively straightforward, describing actions done in a way that is timid, quiet, and furtive, like a small mouse. Due to its rarity, it is unlikely to be encountered in everyday language and is more likely to be found in literary or descriptive writing."},"example_sentences":[{"sentence":"The spy moved mouslingly through the shadows, careful not to be seen.","translation":"スパイは、見られないように注意しながら、影の中をネズミのようにこっそりと移動した。","type":"adverb","meaning_category":"furtively"},{"sentence":"She asked the question mouslingly, hoping not to draw attention to herself.","translation":"彼女は、自分に注意を向けないように、ネズミのようにひそやかに質問した。","type":"adverb","meaning_category":"timidly"}]}