{"word":"ascocarp","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"子嚢果（しのうか）：子嚢菌類において、子嚢（ascosporeを内包する袋状の構造）を保護する多細胞構造","english_definition":"The fruiting body (sporocarp) of an ascomycete fungus, containing asci.","examples":[{"sentence":"The ascocarp is a characteristic feature used to classify ascomycetes.","translation":"子嚢果は、子嚢菌を分類するために用いられる特徴的な構造である。"},{"sentence":"Different types of ascocarps include apothecia, perithecia, and cleistothecia.","translation":"子嚢果の異なるタイプには、子のう盤、子のう殻、閉子嚢殻が含まれる。"}],"collocations":["ascocarp development","ascocarp morphology","types of ascocarps","ascomycete ascocarp"],"synonyms":["fruiting body","sporocarp"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'askos' (bag or sac) and 'karpos' (fruit), referring to the fruit body containing the asci (sac-like structures).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæskoʊˌkɑːrp/","syllables":"as-co-carp"},"inflection":{"noun_plural":"ascocarps"},"usage_notes":{"explanation":"An ascocarp is a specialized structure in ascomycete fungi that encloses and protects the asci. It is a key feature used in the identification and classification of these fungi. Ascocarps vary in shape and structure, leading to different types such as apothecia (cup-shaped), perithecia (flask-shaped with a pore), and cleistothecia (completely closed).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ascocarp produces basidiospores.","correct":"✓ The ascocarp produces ascospores.","note":"Ascocarps are associated with ascomycetes, which produce ascospores, not basidiospores (which are produced by basidiomycetes)."},{"incorrect":"✗ Ascocarp is a unicellular structure.","correct":"✓ Ascocarp is a multicellular structure.","note":"Ascocarps are complex, multicellular structures, not unicellular."}],"priority":"★★☆"},"related_words":{"derivatives":["ascomycete","ascus","ascospore"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. A technical term used in mycology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ascocarp' is a technical term in mycology, referring to the fruiting body of ascomycete fungi. It's a multicellular structure that contains asci, which in turn contain ascospores. Understanding this term requires knowledge of fungal biology and reproduction. The term is primarily used in scientific contexts and is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The apothecial **ascocarp** of *Peziza* is cup-shaped and easily visible.","translation":"アミガサタケ属の**子嚢果**である子のう盤は、カップ状で容易に観察できる。","type":"noun","meaning_category":"structure"},{"sentence":"The type of **ascocarp** present is an important characteristic for identifying ascomycete species.","translation":"存在する**子嚢果**の種類は、子嚢菌種を識別するための重要な特徴である。","type":"noun","meaning_category":"classification"}]}