{"word":"Virtual-only","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"完全に仮想的な、仮想環境のみで行われる","english_definition":"Exclusively existing or taking place in a virtual environment; not involving physical presence or interaction.","examples":[{"sentence":"The conference this year will be virtual-only due to the pandemic.","translation":"今年の会議は、パンデミックのため、完全に仮想的なものになります。"},{"sentence":"They decided to make the training program virtual-only to reach a wider audience.","translation":"彼らは、より多くの聴衆にリーチするために、トレーニングプログラムを完全に仮想的なものにすることにしました。"},{"sentence":"The company is experimenting with a virtual-only office model.","translation":"その会社は、完全に仮想的なオフィスモデルを試しています。"}],"collocations":["virtual-only event","virtual-only conference","virtual-only meeting","virtual-only training","virtual-only office","virtual-only experience","virtual-only format"],"synonyms":["fully virtual","completely online","entirely digital","remote-only"],"antonyms":["in-person","physical","hybrid (virtual and in-person)"]}],"etymology":{"value":"A compound word formed by combining \"virtual\" (existing or occurring on computers or the Internet) with \"only\" (exclusively; solely).","priority":"★★★"},"pronunciation":{"ipa":"/ˈvɜːrtʃuəl ˈoʊnli/","syllables":"vir-tu-al-on-ly"},"inflection":{"notes":"This word does not inflect (no plural form, no comparative/superlative)."},"usage_notes":{"explanation":"\"Virtual-only\" is used to describe events, programs, or environments that exist solely in a digital or online space. It emphasizes the absence of any physical or in-person components. It is commonly used in the context of conferences, meetings, training programs, offices, and other activities that have transitioned from physical to digital formats.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The virtual-only event was very physical.","correct":"✓ The virtual-only event was very engaging.","note":"A \"virtual-only\" event cannot be physical by definition. Using \"engaging,\" \"interactive,\" or similar words would be more appropriate."},{"incorrect":"✗ The virtual-only office had a lot of in-person meetings.","correct":"✓ The virtual-only office had a lot of video conferences.","note":"A \"virtual-only\" office does not have in-person meetings. Use \"video conferences,\" \"virtual meetings,\" or similar phrases instead."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["virtual","online","remote","digital","hybrid","in-person","teleconference","webinar","virtual reality","augmented reality"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing due to the rise of remote work and online events.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term \"virtual-only\" describes something that exists or happens only in a digital or online environment, with no physical presence. For example, a \"virtual-only conference\" means the entire conference takes place online, with no physical location for attendees to gather. This term is often used to contrast with \"in-person\" or \"hybrid\" events that have both online and physical components. The word is relatively new, becoming more common with the rise of remote work and online events."},"example_sentences":[{"sentence":"Due to travel restrictions, the workshop will be a **virtual-only** event.","translation":"渡航制限のため、ワークショップは完全に仮想的なイベントとなります。","type":"adjective","meaning_category":"Completely virtual"},{"sentence":"The company adopted a **virtual-only** policy for all meetings.","translation":"その会社は、すべての会議に対して完全に仮想的なポリシーを採用しました。","type":"adjective","meaning_category":"Completely virtual"},{"sentence":"The **virtual-only** platform allowed participants from around the world to connect.","translation":"完全に仮想的なプラットフォームにより、世界中の参加者がつながることができました。","type":"adjective","meaning_category":"Completely virtual"}]}