{"word":"counterblows","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"反撃、逆襲","english_definition":"A retaliatory blow or action.","examples":[{"sentence":"The government launched a series of counterblows against the rebels.","translation":"政府は反乱軍に対して一連の反撃を開始した。"},{"sentence":"His speech was a series of counterblows to the accusations made against him.","translation":"彼の演説は、彼に対する告発への一連の反撃だった。"}],"collocations":["deliver counterblows","launch counterblows","a series of counterblows"],"synonyms":["retaliation","reprisal","revenge","reciprocity","response","comeback"],"antonyms":["surrender","submission","capitulation"]}],"etymology":{"value":"'Counter-' (against) + 'blow' (a hit or attack).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkaʊntərˌbloʊz/","syllables":"coun-ter-blows"},"inflection":{"noun_plural":"counterblows"},"usage_notes":{"explanation":"'Counterblows' refers to actions taken in response to an initial attack or action. It implies a direct reaction aimed at neutralizing or damaging the original aggressor. It is often used in contexts of conflict, politics, or competition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company received many counterblow.","correct":"✓ The company received many counterblows.","note":"'Counterblows' is typically used in the plural form, especially when referring to a series of retaliatory actions."},{"incorrect":"✗ He gave a counterblow with kindness.","correct":"✓ He responded with kindness.","note":"'Counterblows' usually implies a forceful or aggressive response. If the response is kind, a different word should be used."}],"priority":"★★☆"},"related_words":{"derivatives":["counterblow (singular noun)","counter (prefix)","blow (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Counterblows' is a relatively uncommon word, typically used in formal writing or speech to describe retaliatory actions in response to an initial attack or provocation. Understanding the word involves recognizing the combination of 'counter-' (meaning against or in response) and 'blow' (meaning a hit or attack). It is often used in contexts of conflict, politics, or competition to describe a series of retaliatory actions aimed at neutralizing or damaging the original aggressor."},"example_sentences":[{"sentence":"The boxer absorbed the initial punches before delivering a series of powerful counterblows.","translation":"ボクサーは最初のパンチを吸収した後、一連の強力な反撃を加えた。","type":"general"},{"sentence":"The economic sanctions were seen as counterblows to the nation's aggressive foreign policy.","translation":"経済制裁は、その国の攻撃的な外交政策への反撃と見なされた。","type":"politics"},{"sentence":"The company's innovative marketing campaign was a counterblow to its competitor's recent gains in market share.","translation":"その会社の革新的なマーケティングキャンペーンは、競合他社の最近の市場シェア拡大に対する反撃だった。","type":"business"}]}