{"word":"pseudoataxia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"偽性運動失調：運動失調に似た症状を示すが、小脳、脊髄、末梢神経系の障害によるものではない状態。","english_definition":"A condition resembling ataxia but not caused by cerebellar, spinal cord, or peripheral nerve damage. It may be due to sensory deficits, weakness, or other non-neurological factors.","examples":[{"sentence":"The patient presented with pseudoataxia due to severe muscle weakness in the legs.","translation":"患者は脚の重度の筋力低下により偽性運動失調を呈した。"},{"sentence":"Sensory neuropathy can sometimes lead to pseudoataxia.","translation":"感覚ニューロパチーは時に偽性運動失調を引き起こす可能性がある。"}],"collocations":["sensory pseudoataxia (感覚性偽性運動失調)","vestibular pseudoataxia (前庭性偽性運動失調)","muscle weakness-induced pseudoataxia (筋力低下による偽性運動失調)"],"synonyms":["sensory ataxia","simulated ataxia"],"antonyms":["ataxia"],"notes":"Pseudoataxia differs from true ataxia in that the underlying cause is not damage to the cerebellum or related neurological structures. It is often caused by sensory deficits, weakness, or other conditions that affect balance and coordination."}],"etymology":{"value":"\"Pseudo-\" (偽の) + \"ataxia\" (運動失調)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsjuːdoʊəˈtæksiə/","syllables":"pseu-do-a-tax-i-a"},"inflection":{"noun_plural":"pseudoataxias"},"related_words":{"derivatives":["pseudoatactic (形容詞: 偽性運動失調性の)"],"related_medical_terms":["ataxia","sensory neuropathy","muscle weakness","cerebellum","spinal cord","peripheral neuropathy"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"Pseudoataxia is a complex medical term referring to a condition that mimics ataxia (loss of coordination) but stems from different causes, such as sensory deficits or muscle weakness, rather than direct neurological damage to the cerebellum or related structures. Understanding this term requires a strong grasp of medical terminology and neurological concepts."},"example_sentences":[{"sentence":"The patient's gait disturbance was initially suspected to be ataxia, but further examination revealed it was pseudoataxia caused by severe peripheral neuropathy.","translation":"患者の歩行障害は当初、運動失調が疑われたが、さらなる検査により重度の末梢神経障害による偽性運動失調であることが判明した。","type":"medical","meaning_category":"diagnosis"},{"sentence":"Physical therapy can help improve balance and coordination in patients with pseudoataxia, even if the underlying cause cannot be fully resolved.","translation":"理学療法は、根本的な原因が完全に解決できない場合でも、偽性運動失調患者のバランスと協調性の改善に役立つ。","type":"medical","meaning_category":"treatment"}]}