{"word":"antonomasia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"換喩（かんゆ）、人名普通名詞化","english_definition":"The substitution of an epithet or title for a proper name (e.g., 'the Bard' for Shakespeare) or the substitution of a proper name for a quality associated with it (e.g., 'a Judas' for a traitor).","examples":[{"sentence":"Using 'the Iron Lady' instead of Margaret Thatcher is an example of antonomasia.","translation":"マーガレット・サッチャーの代わりに「鉄の女」を使うのは、換喩の一例である。"},{"sentence":"Calling someone 'a Romeo' implies they are a passionate lover, which is antonomasia.","translation":"誰かを「ロミオ」と呼ぶことは、彼らが情熱的な恋人であることを意味し、これは換喩である。"}],"collocations":["use antonomasia","an example of antonomasia"],"synonyms":["epithet","metonymy","nickname"],"antonyms":[]},{"part_of_speech":"noun","definition":"(より広義には)固有名詞の代わりに記述的な句を使用すること","english_definition":"More broadly, the use of a descriptive phrase in place of a proper name.","examples":[{"sentence":"Instead of saying 'the famous scientist', one might use antonomasia to say 'the mind that unlocked the secrets of the atom'.","translation":"「有名な科学者」と言う代わりに、「原子の秘密を解き明かした頭脳」と言うのは換喩の一種である。"}],"collocations":["descriptive antonomasia"],"synonyms":["circumlocution","periphrasis"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek ἀντονομασία (antonomasiā), meaning 'calling by a new name' or 'substitution of a name,' from ἀντί (anti, 'instead of') + ὀνομάζω (onomazō, 'I name').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntənəˈmeɪziə/","syllables":"an-to-no-ma-si-a"},"inflection":{"noun_plural":"antonomasias"},"usage_notes":{"explanation":"Antonomasia is a rhetorical device where a descriptive word or phrase replaces a person's name, or a person's name replaces a quality. It's often used to emphasize a particular characteristic or to create a more vivid image. The term is not commonly used in everyday conversation but is more prevalent in literary analysis and rhetoric.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a lot of metaphors, including antonomasia.","correct":"✓ I used several rhetorical devices, including antonomasia.","note":"Antonomasia is a specific type of rhetorical device, not a general term for all figures of speech like metaphor."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["metonymy","synecdoche","epithet"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antonomasia' is a term used in rhetoric to describe the substitution of a proper name with a descriptive phrase or vice versa. It's not a common word in everyday language, but it's useful for analyzing literature and speeches. Understanding this term helps in recognizing and appreciating the nuances of language used to create emphasis or vivid imagery."},"example_sentences":[{"sentence":"The use of 'the Great Emancipator' when referring to Abraham Lincoln is an example of antonomasia.","translation":"エイブラハム・リンカーンを指すときに「偉大な解放者」を使うのは、換喩の一例である。","type":"noun","meaning_category":"Substitution of title for name"},{"sentence":"Calling someone 'an Einstein' suggests they are highly intelligent, which is a form of antonomasia.","translation":"誰かを「アインシュタイン」と呼ぶことは、彼らが非常に知的なことを示唆し、これは換喩の一種である。","type":"noun","meaning_category":"Substitution of name for quality"}]}