{"word":"canonization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"列聖、聖人列福、正典化","english_definition":"the act by which a Christian church declares that a person who has died was a saint, upon which declaration the person is included in the canon, or list, of recognized saints; the process of establishing a text as authoritative or canonical.","examples":[{"sentence":"The canonization of Joan of Arc took place in 1920.","translation":"ジャンヌ・ダルクの列聖は1920年に行われた。"},{"sentence":"The process of canonization often involves a thorough investigation of the candidate's life and miracles.","translation":"列聖の過程には、候補者の生涯と奇跡の徹底的な調査がしばしば含まれる。"},{"sentence":"Scholars debate the canonization of certain texts within religious traditions.","translation":"学者たちは、宗教的伝統における特定のテキストの正典化について議論している。"}],"collocations":["papal canonization (教皇による列聖)","process of canonization (列聖の過程)","canonization ceremony (列聖式)","canonization of scripture (聖書の正典化)"],"synonyms":["beatification","sainthood","deification","authorization","validation","establishment"],"antonyms":["decanonization","desecration","rejection","disapproval"]}],"etymology":{"value":"Late Middle English: from Old French, or from ecclesiastical Latin canonizare, from canon 'rule, standard' (see canon).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkænənəˈzeɪʃən/","syllables":"ca-non-i-za-tion"},"inflection":{"noun_plural":"canonizations"},"usage_notes":{"explanation":"Canonization refers to two main processes: (1) the formal declaration by a church (primarily the Roman Catholic and Eastern Orthodox churches) that a deceased person is a saint, worthy of veneration; and (2) the process of establishing a text as authoritative or canonical, especially within religious or literary contexts. In the religious sense, it's a complex process involving investigation of the person's life, virtues, and miracles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The canonization happened very quick.","correct":"✓ The canonization happened very quickly.","note":"'Quick' is an adjective, while 'quickly' is an adverb. Since 'quickly' modifies the verb 'happened', the adverb form is needed."},{"incorrect":"✗ The canonization of the book was made by the author.","correct":"✓ The canonization of the book was decided by a panel of experts.","note":"The canonization of a text is not usually done by the author but rather by a group of experts or scholars who determine its authority and importance."}],"priority":"★★☆"},"related_words":{"derivatives":["canonize (verb)","canonized (adjective)","canon (noun)","canonical (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in religious or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Canonization' is a formal term primarily used in religious contexts, specifically within the Catholic and Orthodox Christian traditions. It refers to the process by which the church declares a deceased person to be a saint. It can also refer to the process of establishing a text as authoritative. Understanding this word requires familiarity with religious terminology and historical context. It is not a common word in everyday conversation."},"example_sentences":[{"sentence":"The Vatican carefully examines evidence before proceeding with canonization.","translation":"バチカンは列聖を進める前に証拠を慎重に検討する。","type":"noun","meaning_category":"Religious"},{"sentence":"The canonization of the author's works solidified his place in literary history.","translation":"その作家の作品の正典化は、文学史における彼の地位を確固たるものにした。","type":"noun","meaning_category":"Literary"},{"sentence":"The local church celebrated the recent canonization with a special mass.","translation":"地元の教会は最近の列聖を特別なミサで祝った。","type":"noun","meaning_category":"Religious"},{"sentence":"The canonization process can take many years, even centuries.","translation":"列聖の過程は何年も、場合によっては何世紀もかかることがある。","type":"noun","meaning_category":"Religious"}]}