{"word":"Remigration","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再移住、帰還移住","english_definition":"The act of migrating back to a place one has previously emigrated from.","examples":[{"sentence":"The remigration of skilled workers to their home countries is a growing trend.","translation":"熟練労働者の母国への再移住は、増加傾向にある。"},{"sentence":"Remigration can contribute to the economic development of the country of origin.","translation":"再移住は、出身国の経済発展に貢献する可能性がある。"}],"collocations":["voluntary remigration","forced remigration","economic remigration","social remigration"],"synonyms":["return migration","reverse migration","repatriation"],"antonyms":["emigration","immigration","migration"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning 'again' or 'back') to the word 'migration'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːmaɪˈɡreɪʃən/","syllables":"re-mi-gra-tion"},"inflection":{"noun_plural":"Remigrations"},"usage_notes":{"explanation":"'Remigration' specifically refers to the act of returning to a place one has previously left to live elsewhere. It is often used in the context of people who have emigrated from their home country for work or other opportunities, and then later decide to return.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The remigration of birds is a beautiful sight.","correct":"✓ The return migration of birds is a beautiful sight.","note":"While 'remigration' can technically be used for animals, 'return migration' is more common and natural in that context."}],"priority":"★★☆"},"related_words":{"derivatives":["remigrate (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'remigration' is a relatively uncommon term that describes the act of returning to a place where one previously lived after having emigrated from it. It is often used in academic or professional contexts when discussing migration patterns and trends. Understanding this word requires a good grasp of the prefixes and root words used in English vocabulary.","priority":"★★★"},"example_sentences":[{"sentence":"The government is encouraging the remigration of its citizens living abroad.","translation":"政府は海外在住の国民の再移住を奨励している。","type":"general","meaning_category":"general"},{"sentence":"Economic factors often play a significant role in decisions about remigration.","translation":"経済的要因は、再移住の決定において重要な役割を果たすことが多い。","type":"economic","meaning_category":"economic"},{"sentence":"The remigration process can be challenging, as individuals may need to readjust to their home country's culture and society.","translation":"再移住のプロセスは、個人が出身国の文化や社会に再適応する必要があるため、困難な場合があります。","type":"social","meaning_category":"social"}]}