{"word":"drooping-shouldered","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"肩を落とした、うなだれた","english_definition":"Having shoulders that tend to sag or droop; appearing dejected or lacking confidence.","examples":[{"sentence":"The drooping-shouldered figure walked slowly down the street.","translation":"肩を落とした姿が、ゆっくりと通りを歩いて行った。"},{"sentence":"He gave a drooping-shouldered sigh, indicating his disappointment.","translation":"彼は肩を落としてため息をつき、失望を示した。"},{"sentence":"The character was portrayed as a drooping-shouldered introvert.","translation":"そのキャラクターは、肩を落とした内向的な人物として描かれていた。"}],"collocations":["drooping-shouldered figure","drooping-shouldered sigh","drooping-shouldered posture"],"synonyms":["dejected","downcast","despondent","discouraged","crestfallen","listless","languid"],"antonyms":["upright","confident","assured","perky","energetic"]}],"etymology":{"value":"A compound adjective formed by combining 'drooping' (meaning hanging down or sagging) and 'shouldered' (referring to the shoulders). It describes someone whose shoulders are positioned in a way that suggests sadness, weariness, or lack of self-assurance.","priority":"Medium"},"pronunciation":{"ipa":"/ˈdruːpɪŋ ˈʃoʊldərd/","syllables":"droop-ing-shoul-dered"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"The adjective 'drooping-shouldered' is primarily descriptive, conveying a physical posture that often reflects an emotional state. It is most commonly used to depict characters in literature or to describe someone's appearance when they are feeling sad, tired, or defeated. The term implies a lack of energy and a sense of resignation.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He was drooping shouldered.","correct":"He was drooping-shouldered.","note":"The hyphen is important to connect the two words into a single adjective modifying the subject."}],"priority":"Low"},"related_words":{"derivatives":["droop (verb, noun)","shoulder (noun)"],"phrasal_verbs":[],"related_adjectives":["round-shouldered","broad-shouldered"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Rare","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Drooping-shouldered' is a descriptive adjective used to portray a person's posture, often indicative of their emotional state. It is not a commonly used word in everyday conversation, but more often found in literature or descriptive writing. Understanding the individual words ('drooping' and 'shouldered') helps in grasping the meaning of the compound adjective. It suggests a posture where the shoulders are slumped or sagging, which is often associated with feelings of sadness, dejection, or lack of confidence."},"example_sentences":[{"sentence":"The old man sat on the park bench, a drooping-shouldered silhouette against the setting sun.","translation":"その老人は公園のベンチに座り、肩を落としたシルエットが夕日に映し出されていた。","type":"descriptive","meaning_category":"dejected posture"},{"sentence":"Even his walk had become drooping-shouldered, reflecting his recent setbacks.","translation":"彼の歩き方さえ肩を落としたようになり、最近の挫折を反映していた。","type":"figurative","meaning_category":"emotional state"},{"sentence":"The artist captured the drooping-shouldered weariness of the factory workers in his painting.","translation":"その画家は、工場労働者の肩を落とした疲労感を絵に捉えた。","type":"artistic","meaning_category":"physical and emotional portrayal"}]}