{"word":"bailments","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"寄託（契約）","english_definition":"The act of delivering goods or personal property to another for some particular purpose, without transfer of ownership.","examples":[{"sentence":"The bailments agreement outlined the responsibilities of both parties.","translation":"寄託契約書には、両当事者の責任が明記されていました。"},{"sentence":"Common examples of bailments include leaving a car with a mechanic for repair or storing goods in a warehouse.","translation":"寄託の一般的な例としては、修理のために自動車を整備士に預けたり、商品を倉庫に保管したりすることが挙げられます。"}],"collocations":["create a bailment (寄託契約を締結する)","types of bailments (寄託の種類)","bailments agreement (寄託契約書)"],"synonyms":["deposit","entrustment","consignment"],"antonyms":["sale","transfer of ownership"]}],"etymology":{"value":"The term 'bailment' comes from the Old French word 'bailler,' meaning 'to deliver' or 'to entrust.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbeɪlmənts/","syllables":"bail-ments"},"inflection":{"noun_plural":"bailments"},"usage_notes":{"explanation":"'Bailments' refers to the legal relationship created when personal property is delivered by one person (the bailor) to another (the bailee) for a specific purpose, with the understanding that the property will be returned to the bailor or disposed of according to their instructions once the purpose is fulfilled. Ownership of the property does not transfer to the bailee.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He sold the bailments to the company.","correct":"✓ He bailed the goods to the company.","note":"'Bailments' is a noun referring to the legal relationship or the goods under that relationship, not something that can be sold. Use 'bailed' as a verb to indicate the act of entrusting goods."}],"priority":"★★☆"},"related_words":{"derivatives":["bailor (寄託者)","bailee (受寄者)","bail (保釈)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bailments' is a legal term referring to the act of entrusting goods or personal property to another party for a specific purpose without transferring ownership. It is commonly used in legal and business contexts to describe the relationship between the bailor (the one entrusting the property) and the bailee (the one receiving the property). Understanding this term is important in contracts and legal agreements involving the temporary transfer of possession of goods."},"example_sentences":[{"sentence":"The company specializes in managing bailments for high-value items.","translation":"その会社は、高額商品の寄託管理を専門としています。","type":"noun","meaning_category":"寄託（契約）"},{"sentence":"The terms of the bailments were clearly outlined in the contract.","translation":"寄託の条件は契約書に明確に記載されていました。","type":"noun","meaning_category":"寄託（契約）"}]}