{"word":"parent-management","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"親マネジメント (子供の行動や発達を促進するために、親が用いる戦略やスキル)","english_definition":"Strategies and skills used by parents to promote positive child behavior and development; encompasses monitoring, discipline, positive reinforcement, and problem-solving.","examples":[{"sentence":"Effective parent-management can significantly reduce behavioral problems in children.","translation":"効果的な親マネジメントは、子供の行動問題を大幅に軽減することができます。"},{"sentence":"Parent-management training programs teach parents how to set clear expectations and provide consistent consequences.","translation":"親マネジメントのトレーニングプログラムは、親が明確な期待を設定し、一貫した結果を提供する方法を教えます。"},{"sentence":"The therapist emphasized the importance of positive reinforcement in parent-management.","translation":"セラピストは、親マネジメントにおける肯定的な強化の重要性を強調しました。"}],"collocations":["parent-management training (親マネジメントトレーニング)","effective parent-management (効果的な親マネジメント)","parent-management skills (親マネジメントスキル)","implement parent-management (親マネジメントを実施する)","improve parent-management (親マネジメントを改善する)"],"synonyms":["positive parenting","behavioral parent training","family management"],"antonyms":["laissez-faire parenting","neglectful parenting"]}],"etymology":{"value":"'Parent' (親) と 'management' (管理) の組み合わせ。子供の行動や発達を管理・促進するという意味合いから。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpeərənt ˈmænɪdʒmənt/","syllables":"par-ent-man-age-ment"},"inflection":{"noun_plural":"parent-managements (複数形はあまり一般的ではない)"},"usage_notes":{"explanation":"「**parent-management**」は、子供の行動や発達を促進するために親が意識的に行う様々な戦略やスキルを指す用語です。これには、子供の行動の監視、明確なルールと期待の設定、一貫した規律の適用、肯定的な行動への報酬、問題解決スキルの指導などが含まれます。効果的な親マネジメントは、子供の行動問題の予防や改善に役立つと考えられています。心理学、教育学、社会福祉などの分野でよく用いられる概念です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Parent management is only about punishing bad behavior.","correct":"✓ Parent management involves both positive reinforcement and consistent discipline.","note":"親マネジメントは、罰を与えることだけではありません。肯定的な強化と一貫した規律の両方を含みます。"},{"incorrect":"✗ Parent management is the same as being an authoritarian parent.","correct":"✓ Parent management focuses on setting clear expectations and providing consistent support.","note":"親マネジメントは、権威主義的な親のスタイルとは異なり、明確な期待と一貫したサポートを提供することに重点を置いています。"}],"priority":"★★☆"},"related_words":{"derivatives":["parent-management training (親マネジメントトレーニング)","co-parenting (共同育児)","parenting style (育児スタイル)","child development (子供の発達)","behavioral therapy (行動療法)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (専門的な文脈で使用される)","frequency_google_ngram":"中頻度 (専門分野で使われるため、一般的な頻度は高くない)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**parent-management**」は、子供の行動や成長を助けるために親が使う方法や技術のことです。たとえば、子供が何をしているか見守ったり、ルールをきちんと教えたり、良いことをしたら褒めたり、困ったことがあれば一緒に解決したりします。この言葉は、心理学や教育の分野でよく使われます。親が子供を育てる上で大切なことを表す言葉だと覚えておきましょう。"},"example_sentences":[{"sentence":"The study investigated the effects of parent-management on adolescent substance use.","translation":"その研究では、親マネジメントが青年の薬物使用に与える影響を調査しました。","type":"noun","meaning_category":"親マネジメント"},{"sentence":"A key component of parent-management is teaching children problem-solving skills.","translation":"親マネジメントの重要な要素は、子供たちに問題解決スキルを教えることです。","type":"noun","meaning_category":"親マネジメント"},{"sentence":"The social worker recommended parent-management training to help the family cope with their child's ADHD.","translation":"ソーシャルワーカーは、家族が子供のADHDに対処するのを助けるために、親マネジメントトレーニングを勧めました。","type":"noun","meaning_category":"親マネジメント"}]}