{"word":"nutrition-blind","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a person, organization, or policy) failing to consider or understand the importance of nutrition.","english_definition":"Lacking awareness or understanding of the importance of nutrition.","examples":[{"sentence":"The government's agricultural policies are nutrition-blind, focusing solely on increasing crop yields without regard for nutritional value.","translation":"政府の農業政策は栄養を考慮しておらず、栄養価を考慮せずに作物の収量を増やすことだけに焦点を当てています。"},{"sentence":"Many food manufacturers are nutrition-blind, prioritizing profit over the health of consumers.","translation":"多くの食品メーカーは栄養を考慮せず、消費者の健康よりも利益を優先しています。"},{"sentence":"We need to educate people about healthy eating habits so they don't remain nutrition-blind.","translation":"栄養について無知なままでいられないように、健康的な食習慣について人々を教育する必要があります。"}],"collocations":["nutrition-blind policies","nutrition-blind approach","nutrition-blind food industry"],"synonyms":["uninformed about nutrition","ignorant of nutritional needs","lacking nutritional awareness"],"antonyms":["nutrition-conscious","nutrition-aware","nutrition-sensitive"]}],"etymology":{"value":"A compound word formed by combining 'nutrition' (the process of providing or obtaining the food necessary for health and growth) and 'blind' (lacking awareness, understanding, or judgment).","priority":"N/A"},"pronunciation":{"ipa":"/njuːˈtrɪʃənˌblaɪnd/","syllables":"nu-tri-tion-blind"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more nutrition-blind, most nutrition-blind), although these are less common."},"usage_notes":{"explanation":"'Nutrition-blind' is typically used to criticize or highlight a lack of consideration for nutritional value in decision-making, policies, or practices. It implies that the entity in question is neglecting an important aspect of health and well-being.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a nutrition-blind doctor.","correct":"✓ He is a doctor who is nutrition-blind. / ✓ He is a nutrition-unaware doctor.","note":"While 'nutrition-blind' is understandable, it's more common to say someone 'is nutrition-blind' rather than directly modifying the noun. Alternatively, using a synonym like 'nutrition-unaware' might sound more natural."}],"priority":"N/A"},"related_words":{"derivatives":["nutrition","blindness"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - This is a relatively uncommon term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Nutrition-blind' is a term used to describe someone or something that doesn't take nutrition into account. It's like being blind to the importance of healthy food. It's often used to criticize policies or companies that focus on things other than the nutritional value of food."},"example_sentences":[{"sentence":"The company's marketing strategy was nutrition-blind, focusing only on taste and convenience.","translation":"その会社のマーケティング戦略は栄養を考慮しておらず、味と利便性のみに焦点を当てていた。","type":"adjective","meaning_category":"Failing to consider nutrition"},{"sentence":"The city's food desert problem is exacerbated by nutrition-blind policies that prioritize fast food restaurants over grocery stores.","translation":"市のフードデザート問題は、食料品店よりもファストフードレストランを優先する、栄養を考慮しない政策によって悪化している。","type":"adjective","meaning_category":"Failing to consider nutrition"}]}