{"word":"kyat","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ミャンマーの通貨単位","english_definition":"The basic monetary unit of Myanmar.","examples":[{"sentence":"The price of rice has increased sharply in kyat terms.","translation":"米の価格はチャット建てで急騰している。"},{"sentence":"The official exchange rate for kyat is significantly different from the black market rate.","translation":"チャットの公定レートは闇市場のレートと大きく異なる。"}],"collocations":["Myanmar kyat","convert kyat","kyat exchange rate"],"synonyms":["Burmese kyat"],"antonyms":[]}],"etymology":{"value":"Derived from the ancient Burmese weight unit of the same name.","priority":"★★☆"},"pronunciation":{"ipa":"/kjɑːt/","syllables":"kyat"},"inflection":{"noun_plural":"kyats"},"usage_notes":{"explanation":"'Kyat' refers specifically to the currency of Myanmar. It's important to note the distinction between the official and unofficial (black market) exchange rates, which can vary significantly.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I exchanged dollars for kyats in the bank of Thailand.","correct":"✓ I exchanged dollars for kyats at a money changer in Myanmar.","note":"Kyat is the currency of Myanmar, not Thailand."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'kyat' is specific to the currency of Myanmar, so it is not a commonly used word outside of contexts related to Myanmar's economy or travel. Understanding the term is useful for those following international finance or planning to visit Myanmar."},"example_sentences":[{"sentence":"The local market sells goods priced in kyat.","translation":"地元の市場では、チャットで価格が付けられた商品が販売されています。","type":"noun","meaning_category":"Currency"},{"sentence":"Many tourists exchange their currency for kyat upon arrival in Myanmar.","translation":"多くの観光客は、ミャンマーに到着すると通貨をチャットに両替します。","type":"noun","meaning_category":"Currency"}]}