{"word":"numerosity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"数多さ、多数性、数量の感覚","english_definition":"The ability to quickly estimate the number of items in a set without counting them individually; also, the state of being numerous.","examples":[{"sentence":"Humans possess an innate sense of numerosity, allowing us to quickly assess quantities.","translation":"人間は生まれつき数多さの感覚を持っており、それによって数量を素早く評価することができる。"},{"sentence":"The numerosity of stars in the galaxy is staggering.","translation":"銀河に存在する星の数多さは驚くばかりだ。"},{"sentence":"Studies suggest that animals also have a basic understanding of numerosity.","translation":"研究によると、動物もまた数多さの基本的な理解を持っていることが示唆されている。"}],"collocations":["sense of numerosity (数多さの感覚)","approximate numerosity system (概算数システム)","perceive numerosity (数多さを認識する)","estimate numerosity (数多さを推定する)"],"synonyms":["abundance","multitude","profusion","quantity","count","number sense"],"antonyms":["scarcity","paucity","lack","singularity"]},{"part_of_speech":"noun","definition":"(心理学) 数量感、数覚","english_definition":"(Psychology) A cognitive approximation system that allows humans and animals to estimate the quantity of items in a set without counting.","examples":[{"sentence":"Numerosity is thought to be a fundamental cognitive ability.","translation":"数量感は基本的な認知能力であると考えられている。"},{"sentence":"The researchers investigated the neural basis of numerosity.","translation":"研究者たちは数量感の神経基盤を調査した。"},{"sentence":"Infants demonstrate an early sensitivity to numerosity.","translation":"幼児は数量感に対する初期の感受性を示す。"}],"collocations":["approximate numerosity system (概算数システム)","neural correlates of numerosity (数量感の神経相関)","development of numerosity (数量感の発達)","study numerosity (数量感を研究する)"],"synonyms":["number sense","quantity estimation","subitizing (for small numbers)"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word \"numerosus\", meaning \"numerous\" or \"abundant\", with the suffix \"-ity\" indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnjuːməˈrɒsɪti/","syllables":"nu-mer-o-si-ty"},"inflection":{"noun_plural":"numerosities"},"usage_notes":{"explanation":"\"Numerosity\" refers to the ability to quickly and approximately estimate the number of items in a set without counting each one individually. It's often used in the context of cognitive psychology and neuroscience to describe a fundamental cognitive ability shared by humans and animals. It can also refer more generally to the state of being numerous or abundant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The numerosity of the crowd was obvious. (less precise)","correct":"✓ The size of the crowd was obvious. (more common)","note":"While grammatically correct, using \"size\" is more common when referring to the magnitude of a crowd. \"Numerosity\" is more precise when discussing the cognitive ability to estimate quantity. "},{"incorrect":"✗ She had a good numerosity in math.","correct":"✓ She had a good number sense in math.","note":"In the context of mathematical ability, \"number sense\" is more commonly used than \"numerosity\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["numerous (adjective: many, abundant)","enumerate (verb: to count or list)","numerical (adjective: relating to numbers)"],"related_concepts":["subitizing (the ability to instantly recognize the number of objects in a small group, usually up to 3 or 4)","approximate number system (ANS) (the cognitive system that supports numerosity)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic and research contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Numerosity\" is a specialized term primarily used in psychology, neuroscience, and related fields. It refers to the cognitive ability to quickly estimate the quantity of items in a set without counting. While it can also refer to the state of being numerous, this usage is less common. Understanding this term requires familiarity with cognitive science concepts. "},"example_sentences":[{"sentence":"The study examined the relationship between numerosity and mathematical ability.","translation":"その研究では、数量感と数学的能力の間の関係を調べた。","type":"general","meaning_category":"数覚"},{"sentence":"Primates exhibit a sophisticated sense of numerosity.","translation":"霊長類は洗練された数多さの感覚を示す。","type":"general","meaning_category":"数多さ"},{"sentence":"The approximate numerosity system allows us to quickly compare quantities.","translation":"概算数システムによって、数量を素早く比較することができる。","type":"psychology","meaning_category":"数量感"},{"sentence":"Despite its vastness, the numerosity of the universe remains finite.","translation":"その広大さにもかかわらず、宇宙の数多さは有限のままである。","type":"general","meaning_category":"数多さ"}]}