{"word":"Parasecretion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"細胞が、自身ではなく、周囲の細胞に影響を与える物質を分泌する現象","english_definition":"The secretion of substances by a cell that affects neighboring cells rather than the cell itself.","examples":[{"sentence":"Parasecretion plays a crucial role in cell communication within tissues.","translation":"パラ分泌は、組織内の細胞間コミュニケーションにおいて重要な役割を果たします。"},{"sentence":"The growth factors released via parasecretion can stimulate proliferation in adjacent cells.","translation":"パラ分泌によって放出される成長因子は、隣接する細胞の増殖を刺激する可能性があります。"}],"collocations":["growth factor parasecretion","tumor microenvironment parasecretion"],"synonyms":["juxtacrine signaling","cell signaling","intercellular communication"],"antonyms":["autocrine signaling","endocrine signaling"]}],"etymology":{"value":"The term is formed by combining 'para-' (meaning 'beside' or 'near') with 'secretion'. It indicates that the secretion affects cells nearby.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəsɪˈkriːʃən/","syllables":"par-a-se-cre-tion"},"inflection":{"noun_plural":"parasecretions"},"usage_notes":{"explanation":"Parasecretion is a form of cell signaling where a cell secretes a substance that affects the behavior of neighboring cells. This is distinct from autocrine signaling (where the cell affects itself) and endocrine signaling (where the substance travels through the bloodstream to affect distant cells). Parasecretion is important in many biological processes, including tissue development, wound healing, and tumor growth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell is using autocrine signaling via parasecretion.","correct":"✓ The cell is using parasecretion to signal to neighboring cells.","note":"Parasecretion is a mechanism of secretion, not a type of signaling itself. Autocrine and parasecretion are different signaling mechanisms."}],"priority":"★☆☆"},"related_words":{"derivatives":["paracrine (adjective: relating to or denoting a hormone which has effect only in the vicinity of the gland secreting it.)","secretion (noun: The process by which substances are produced and discharged from a cell, gland, or organ for a particular function in the organism or for excretion.)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Parasecretion' refers to a biological process where cells release substances that affect nearby cells rather than themselves. It's a key method of cell communication in tissues, important for processes like tissue development and wound healing. This term is mainly used in advanced biology and medical contexts."},"example_sentences":[{"sentence":"The study investigated the role of parasecretion in the development of the tumor microenvironment.","translation":"その研究では、腫瘍微小環境の発生におけるパラ分泌の役割が調査されました。","type":"scientific research","meaning_category":"cell biology"},{"sentence":"Parasecretion of growth factors by fibroblasts promotes angiogenesis.","translation":"線維芽細胞による成長因子のパラ分泌は血管新生を促進します。","type":"scientific research","meaning_category":"cell biology"}]}