{"word":"forbiddenly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"禁じられたように、許されないように、禁制の態度で","english_definition":"in a manner that is prohibited or not allowed; in a way that suggests something is forbidden.","examples":[{"sentence":"He looked at the chocolate cake forbiddenly, knowing he was on a diet.","translation":"彼はダイエット中だとわかっていたので、チョコレートケーキを禁じられたように見た。"},{"sentence":"She glanced forbiddenly at the restricted area, her curiosity piqued.","translation":"彼女は好奇心をそそられ、立ち入り禁止区域を禁じられたようにちらっと見た。"},{"sentence":"The lovers met forbiddenly, their families disapproving of their relationship.","translation":"恋人たちは、家族が彼らの関係を良く思っていなかったので、禁じられたように会った。"}],"collocations":["look forbiddenly","glance forbiddenly","meet forbiddenly"],"synonyms":["prohibitedly","illegally","unlawfully","restrictedly","secretly"],"antonyms":["permissibly","legally","allowedly","openly"]}],"etymology":{"value":"The word is formed by adding the suffix '-ly' to the adjective 'forbidden'. 'Forbidden' itself comes from the past participle of the verb 'forbid', which originates from Old English 'forbēodan', meaning 'to prohibit, command against'.","priority":"★★☆"},"pronunciation":{"ipa":"/fərˈbɪdənli/","syllables":"for-bid-den-ly"},"inflection":{"notes":"As an adverb, 'forbiddenly' does not have different forms."},"usage_notes":{"explanation":"'Forbiddenly' describes actions or manners that suggest something is not allowed or is being done in secret because it is prohibited. It often implies a sense of desire or temptation associated with the forbidden act or object. The word is not very common and is mostly used in descriptive or literary contexts to add emphasis to the prohibited nature of something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He forbiddenly entered the building.","correct":"✓ He entered the building illegally. / ✓ He entered the building without permission.","note":"'Forbiddenly' is more about the *manner* of doing something, not just the fact that it's forbidden. Use 'illegally' or 'without permission' to describe the act itself. 'He looked forbiddenly at the building' would be correct to describe the *way* he looked at it."},{"incorrect":"✗ The book was written forbiddenly.","correct":"✓ The book was banned. / ✓ The book was written in secret.","note":"'Forbiddenly' is not used to describe the state of something being forbidden, but rather the manner in which an action is performed. Use 'banned' or 'written in secret' to describe the book."}],"priority":"★★☆"},"related_words":{"derivatives":["forbidden (adjective)","forbid (verb)","forbiddance (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR materials)","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Forbiddenly' is an uncommon adverb that describes doing something in a way that suggests it is prohibited or not allowed. It is used to describe the *manner* in which an action is performed, emphasizing the sense of secrecy, desire, or risk associated with doing something that is not permitted. Because it is not a common word, it is more likely to be encountered in advanced reading materials or literary contexts."},"example_sentences":[{"sentence":"She touched the antique vase forbiddenly, knowing she wasn't supposed to.","translation":"彼女は、触ってはいけないとわかっていながら、そのアンティークの花瓶を禁じられたように触った。","type":"adverb","meaning_category":"prohibited manner"},{"sentence":"They met forbiddenly in the dead of night, away from prying eyes.","translation":"彼らは詮索好きな目から離れて、真夜中に禁じられたように会った。","type":"adverb","meaning_category":"secretly"},{"sentence":"He glanced forbiddenly at the exam paper, tempted to cheat.","translation":"彼はカンニングしたい誘惑にかられ、試験用紙を禁じられたようにちらっと見た。","type":"adverb","meaning_category":"temptation"}]}