{"word":"nonextermination","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"絶滅させないこと、根絶しないこと","english_definition":"The act of not exterminating; the state of not being exterminated.","examples":[{"sentence":"The policy of nonextermination was adopted to preserve the endangered species.","translation":"絶滅させないという政策は、絶滅危惧種を保護するために採用された。"},{"sentence":"Their commitment to nonextermination saved the rare plant from disappearing.","translation":"彼らの絶滅させないというコミットメントが、その希少な植物を絶滅から救った。"}],"collocations":["policy of nonextermination (絶滅させない政策)","commitment to nonextermination (絶滅させないことへのコミットメント)"],"synonyms":["preservation","conservation","protection","safeguarding"],"antonyms":["extermination","eradication","annihilation","extinction"]}],"etymology":{"value":"\"non-\"（否定接頭辞）+ \"extermination\"（絶滅）","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnɪɡˌzɜːmɪˈneɪʃən/","syllables":"non-ex-ter-mi-na-tion"},"inflection":{"noun_plural":"nonexterminations"},"usage_notes":{"explanation":"\"Nonextermination\" is a relatively uncommon word, primarily used in contexts where the prevention of extinction or eradication is being emphasized. It often appears in discussions of conservation, environmental policy, and pest control where complete eradication is not the goal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonextermination of the virus was a success.","correct":"✓ The non-extermination policy regarding the virus was a success.","note":"Viruses are typically targeted for eradication, so 'nonextermination' would be unusual unless a specific policy or reason exists for not eradicating it. It's better to specify the policy."},{"incorrect":"✗ The nonextermination of the forest allowed it to thrive.","correct":"✓ The non-destruction of the forest allowed it to thrive.","note":"'Nonextermination' is usually used for living beings. For places or objects, 'non-destruction' or 'preservation' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["nonexterminating (adjective)"],"related_terms":["conservation","preservation","pest control","environmental policy"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'nonextermination' is a formal and technical term, primarily used in specialized contexts such as conservation biology, environmental science, and policy discussions. It is generally understood by experts in these fields but may not be familiar to the general public. The word is formed by adding the prefix 'non-' to 'extermination,' indicating the opposite action. Understanding this word requires a good grasp of both the prefix 'non-' and the root word 'extermination.'"},"example_sentences":[{"sentence":"The government's commitment to the nonextermination of native species is crucial for maintaining biodiversity.","translation":"政府の在来種の絶滅させないことへのコミットメントは、生物多様性を維持するために不可欠である。","type":"general"},{"sentence":"The nonextermination approach to pest management focuses on controlling populations rather than complete eradication.","translation":"害虫管理における絶滅させないアプローチは、完全な根絶ではなく、個体数の制御に焦点を当てている。","type":"technical"}]}