{"word":"denervation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"脱神経、神経除去","english_definition":"The removal of the nerve supply to an organ or part of the body; the state of having had a nerve supply removed.","examples":[{"sentence":"Denervation of the muscle leads to atrophy.","translation":"筋肉の脱神経は萎縮を引き起こす。"},{"sentence":"Surgical denervation can relieve pain in some cases.","translation":"外科的脱神経は、場合によっては痛みを軽減することができる。"},{"sentence":"The study investigated the effects of denervation on joint function.","translation":"その研究では、脱神経が関節機能に及ぼす影響を調査した。"}],"collocations":["muscle denervation (筋肉の脱神経)","surgical denervation (外科的脱神経)","partial denervation (部分的脱神経)","complete denervation (完全脱神経)","experimental denervation (実験的脱神経)"],"synonyms":["neurectomy","nerve ablation","nerve resection"],"antonyms":["reinnervation","nerve regeneration"]},{"part_of_speech":"noun","definition":"(医学)神経支配の喪失によって引き起こされる状態","english_definition":"The condition caused by loss of nerve supply.","examples":[{"sentence":"Denervation can result in muscle weakness and paralysis.","translation":"脱神経は、筋力低下や麻痺をもたらす可能性がある。"},{"sentence":"The symptoms of denervation include numbness and tingling.","translation":"脱神経の症状には、しびれやチクチク感などがある。"},{"sentence":"Prolonged denervation can lead to irreversible changes in the affected tissue.","translation":"長期にわたる脱神経は、罹患組織に不可逆的な変化をもたらす可能性がある。"}],"collocations":["denervation atrophy (脱神経性萎縮)","denervation hypersensitivity (脱神経過敏)","signs of denervation (脱神経の兆候)","effects of denervation (脱神経の影響)"],"synonyms":["nerve damage","neuropathy","nerve injury"],"antonyms":["nerve function","normal innervation"]}],"etymology":{"value":"From 'de-' (removal, reversal) + 'innervation' (supply of nerves).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːnərˈveɪʃən/","syllables":"de-ner-va-tion"},"inflection":{"noun_plural":"denervations"},"usage_notes":{"explanation":"'Denervation' refers to both the process of removing or disrupting the nerve supply to a body part and the resulting condition. It is commonly used in medical and scientific contexts to describe the effects of nerve damage or surgical procedures that intentionally interrupt nerve pathways.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The denervation was caused by a virus.","correct":"✓ The denervation was caused by nerve damage from a virus.","note":"It's important to specify that the denervation is a result of nerve damage or removal, not directly caused by the virus itself. The virus causes the nerve damage, which then leads to denervation."},{"incorrect":"✗ Denervation is a treatment for nerve pain.","correct":"✓ Denervation can be a treatment for nerve pain.","note":"While denervation can sometimes relieve pain, it's not a universal treatment and has potential side effects. It's more accurate to say it *can* be a treatment, rather than stating it as a definite solution."}],"priority":"★★☆"},"related_words":{"derivatives":["denervate (verb: to remove the nerve supply)","denervated (adjective: having had the nerve supply removed)","reinnervation (noun: the restoration of nerve supply)"],"antonyms":["innervation (noun: the supply of nerves to a body part)"],"related_medical_terms":["atrophy","muscle weakness","paralysis","neuropathy","nerve regeneration","nerve graft","neurotomy"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Denervation' is a technical term used in medicine to describe the process or condition where a body part, especially a muscle or organ, loses its nerve supply. This can happen due to injury, disease, or surgical intervention. The term is often used in discussions about muscle atrophy, nerve damage, and potential treatments for nerve-related conditions. Because it's a specialized term, it's more commonly encountered in medical texts and discussions rather than everyday language."},"example_sentences":[{"sentence":"Following the injury, the muscle showed signs of **denervation**.","translation":"怪我の後、その筋肉は脱神経の兆候を示した。","type":"noun","meaning_category":"神経除去"},{"sentence":"The surgeon performed a **denervation** procedure to alleviate the chronic pain.","translation":"外科医は慢性的な痛みを軽減するために脱神経手術を行った。","type":"noun","meaning_category":"神経除去"},{"sentence":"**Denervation** can lead to significant muscle atrophy if not addressed.","translation":"脱神経は、対処しないと著しい筋肉の萎縮につながる可能性がある。","type":"noun","meaning_category":"神経除去"},{"sentence":"The study focused on the effects of **denervation** on sensory perception.","translation":"その研究は、脱神経が感覚知覚に及ぼす影響に焦点を当てた。","type":"noun","meaning_category":"神経除去"}]}