{"word":"pigeon-berry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ハナミョウガ（花茗荷）","english_definition":"A plant of the species Rivina humilis, native to the Americas, bearing small red berries.","examples":[{"sentence":"The pigeon-berry plant is often used as an ornamental in gardens.","translation":"ハナミョウガは庭の観賞用としてよく使われます。"},{"sentence":"Birds are attracted to the red berries of the pigeon-berry.","translation":"鳥はハナミョウガの赤い実に引き寄せられます。"}],"collocations":["pigeon-berry plant","red pigeon-berry","grow pigeon-berry"],"synonyms":["rivina humilis"],"antonyms":[]},{"part_of_speech":"noun","definition":"ハナミョウガの果実","english_definition":"The small, bright red berry produced by the Rivina humilis plant.","examples":[{"sentence":"The pigeon-berry is poisonous if ingested in large quantities.","translation":"ハナミョウガの実は大量に摂取すると有毒です。"},{"sentence":"The vibrant color of the pigeon-berry makes it attractive to wildlife.","translation":"ハナミョウガの鮮やかな色は野生生物を引きつけます。"}],"collocations":["red pigeon-berry","pigeon-berry juice","pigeon-berry extract"],"synonyms":["rivina berry"],"antonyms":[]}],"etymology":{"value":"The name 'pigeon-berry' likely comes from the fact that pigeons and other birds are known to eat the berries.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪdʒənˌberi/","syllables":"pi-geon-ber-ry"},"inflection":{"noun_plural":"pigeon-berries"},"usage_notes":{"explanation":"'Pigeon-berry' typically refers to the plant *Rivina humilis* or its berries. It's important to note that while birds eat the berries, they can be toxic to humans if ingested in large amounts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a lot of pigeon-berries and felt fine.","correct":"✓ I ate a few pigeon-berries and felt fine. (Even a few can cause discomfort, so it's best to avoid eating them.)","note":"Pigeon-berries are toxic, so it's not advisable to eat them, even in small quantities."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pigeon-berry' is a relatively uncommon term referring to the plant *Rivina humilis* and its berries. The name is derived from the observation that birds, particularly pigeons, consume the berries. It's important to be aware that these berries are toxic to humans if ingested in significant quantities. The plant is sometimes grown as an ornamental. Due to its specialized nature, this term is not typically encountered in general English conversation or texts."},"example_sentences":[{"sentence":"The **pigeon-berry** adds a splash of color to the otherwise green garden.","translation":"ハナミョウガは、他の緑色の庭に色のアクセントを加えます。","type":"noun","meaning_category":"ハナミョウガ"},{"sentence":"Children should be warned not to eat the **pigeon-berries** they find in the yard.","translation":"子供たちは庭で見つけたハナミョウガの実を食べないように注意されるべきです。","type":"noun","meaning_category":"ハナミョウガの果実"}]}