{"word":"Ammoniumnitrate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"硝酸アンモニウム","english_definition":"A chemical compound with the formula NH₄NO₃. It is a white crystalline solid consisting of ions of ammonium and nitrate. It is used in agriculture as a high-nitrogen fertilizer and has also been used as an explosive.","examples":[{"sentence":"Ammonium nitrate is widely used as a fertilizer.","translation":"硝酸アンモニウムは肥料として広く使われています。"},{"sentence":"The explosion was caused by the detonation of a large quantity of ammonium nitrate.","translation":"爆発は大量の硝酸アンモニウムの爆発によって引き起こされました。"}],"collocations":["ammonium nitrate fertilizer","ammonium nitrate explosion","high-density ammonium nitrate"],"synonyms":["nitrate of ammonia","ammonium saltpeter"],"antonyms":[]}],"etymology":{"value":"From 'ammonium' (referring to the ammonium ion) and 'nitrate' (referring to the nitrate ion), the components of the compound.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈmoʊniəm ˈnaɪtreɪt/","syllables":"am-mo-ni-um ni-trate"},"inflection":{"noun_plural":"ammonium nitrates"},"usage_notes":{"explanation":"Ammonium nitrate is a chemical compound primarily known for its use as a fertilizer in agriculture due to its high nitrogen content. It's also notable for its potential to be used as an explosive, especially when mixed with fuel oil. Due to this dual nature, the storage and handling of ammonium nitrate are often subject to regulations to prevent misuse.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Ammonion nitrate is a dangerous chemical.","correct":"✓ Ammonium nitrate is a dangerous chemical.","note":"The correct spelling is 'ammonium nitrate', not 'ammonion nitrate'."},{"incorrect":"✗ Ammoniumnitrate are used in fertilizers.","correct":"✓ Ammonium nitrate is used in fertilizers.","note":"Ammonium nitrate is a singular noun, so it takes a singular verb ('is')."}],"priority":"★★☆"},"related_words":{"derivatives":["nitrate","ammonium","fertilizer","explosive"],"related_compounds":["ammonium sulfate","potassium nitrate"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in scientific or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ammonium nitrate' is a technical term referring to a specific chemical compound. It is most commonly encountered in discussions related to agriculture (as a fertilizer) or in the context of industrial accidents or explosives. Understanding this term requires some familiarity with basic chemistry concepts. The potential for misuse as an explosive means it is also sometimes mentioned in news reports concerning safety regulations and security measures."},"example_sentences":[{"sentence":"Farmers use ammonium nitrate to improve crop yields.","translation":"農家は収穫量を増やすために硝酸アンモニウムを使用します。","type":"general","meaning_category":"agriculture"},{"sentence":"The investigation focused on how the ammonium nitrate was stored.","translation":"調査は硝酸アンモニウムがどのように保管されていたかに焦点を当てました。","type":"general","meaning_category":"safety/accidents"},{"sentence":"Ammonium nitrate is a source of nitrogen for plants.","translation":"硝酸アンモニウムは植物の窒素源です。","type":"scientific","meaning_category":"chemistry"}]}