{"word":"conventionally-dressed","meanings":[{"part_of_speech":"adjective","definition":"慣習的な服装をしている、伝統的な服装をしている、型通りの服装をしている","english_definition":"wearing clothes that conform to traditional or widely accepted styles and norms.","examples":[{"sentence":"The job interview required all applicants to be conventionally-dressed.","translation":"その就職面接では、すべての応募者が慣習的な服装をすることが求められた。"},{"sentence":"Despite the casual atmosphere of the office, she always came to work conventionally-dressed.","translation":"オフィスのカジュアルな雰囲気にもかかわらず、彼女はいつも型通りの服装で出勤した。"},{"sentence":"He felt out of place at the party because he was conventionally-dressed while everyone else was in costume.","translation":"他の皆が仮装している中、彼だけが伝統的な服装をしていたので、パーティーで場違いな感じがした。"}],"collocations":["conventionally-dressed man","conventionally-dressed woman","conventionally-dressed for an interview","conventionally-dressed in a suit"],"synonyms":["formally-dressed","traditionally-dressed","conservatively-dressed","smartly-dressed","well-dressed"],"antonyms":["unconventionally-dressed","casually-dressed","informally-dressed","eccentrically-dressed","outlandishly-dressed"],"notes":"This term often implies a certain level of formality and adherence to social norms regarding clothing. It can also suggest a lack of originality or a preference for established styles."}],"etymology":{"value":"Combination of 'conventionally' (in a conventional manner) and 'dressed' (wearing clothes).","notes":"The term describes the manner in which someone is dressed, emphasizing adherence to established norms or conventions."},"pronunciation":{"ipa":"/kənˈvɛnʃənəli ˈdrɛst/","syllables":"con-ven-tion-al-ly dressed"},"inflection":{"notes":"Adjective, does not inflect"},"usage_notes":{"explanation":"'Conventionally-dressed' describes someone whose clothing choices align with established social norms and expectations for a particular context. It can imply a sense of formality, conservatism, or a lack of individual expression in their attire. The term is often used in contrast to someone who is dressed casually, unconventionally, or eccentrically.","priority":"2"},"common_mistakes":{"examples":[{"incorrect":"He was conventionally dressed, that's why he got the job.","correct":"He was conventionally-dressed, which is why he got the job.","note":"'Conventionally-dressed' is an adjective, so it needs to be used correctly to describe the person. The first sentence is grammatically awkward."},{"incorrect":"She is very conventionally dressed.","correct":"She is conventionally-dressed.","note":"The adjective 'conventionally-dressed' is already descriptive, so adding 'very' is often redundant. While grammatically correct, it's less common."}],"priority":"1"},"related_words":{"derivatives":["conventional","convention","dress","dressed"],"related_terms":["formally-attired","business attire","professional dress","smart casual"]},"level_frequency":{},"readability_explanation":{"level":"B2","text":"The term 'conventionally-dressed' is relatively straightforward. It means wearing clothes that are typical and expected for a certain situation. It's often used to describe someone who is dressed in a formal or professional manner, adhering to established norms rather than expressing individual style. Understanding the word requires knowledge of 'conventional' (typical, normal) and 'dressed' (wearing clothes)."},"example_sentences":[{"sentence":"The lawyers were all conventionally-dressed in dark suits.","translation":"弁護士たちは皆、慣習的な服装である濃い色のスーツを着ていた。","type":"example","meaning_category":"general"},{"sentence":"She felt overdressed because she was conventionally-dressed while everyone else was in jeans.","translation":"他の皆がジーンズ姿の中、彼女だけが型通りの服装をしていたので、服装が場違いだと感じた。","type":"example","meaning_category":"contrast"},{"sentence":"The company's dress code required employees to be conventionally-dressed during client meetings.","translation":"会社の服装規定では、従業員は顧客との会議中、伝統的な服装をすることが義務付けられていた。","type":"example","meaning_category":"requirement"}]}