{"word":"data-oriented","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"データ指向の、データを重視する","english_definition":"focused on or driven by data; designed or organized around data.","examples":[{"sentence":"The company is adopting a more data-oriented approach to decision-making.","translation":"その会社は、意思決定においてよりデータ指向のアプローチを採用している。"},{"sentence":"We need a data-oriented solution to this problem.","translation":"この問題には、データ指向の解決策が必要だ。"},{"sentence":"The new marketing strategy is data-oriented, relying on analytics to target customers effectively.","translation":"新しいマーケティング戦略はデータ指向であり、分析に基づいて顧客を効果的にターゲティングしている。"}],"collocations":["data-oriented architecture (データ指向アーキテクチャ)","data-oriented design (データ指向設計)","data-oriented programming (データ指向プログラミング)","data-oriented analysis (データ指向分析)","data-oriented approach (データ指向アプローチ)","data-oriented culture (データ指向文化)"],"synonyms":["data-driven","data-centric","evidence-based"],"antonyms":["intuition-based","opinion-based","subjective"],"notes":["Often used in the context of business, technology, and research."]}],"etymology":{"value":"Combination of \"data\" and \"oriented\". \"Data\" comes from Latin, meaning \"things given\". \"Oriented\" means directed or focused towards something.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdeɪtə ˌɔːriˌɛntɪd/","syllables":"da-ta-o-ri-en-ted"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"\"Data-oriented\" describes something that prioritizes data in its process, design, or decision-making. It implies a reliance on factual information and analysis rather than subjective opinions or assumptions. This term is commonly used in fields like computer science, business management, and scientific research where data plays a crucial role. It emphasizes objectivity and informed decision-making.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The project was data oriented.","correct":"✓ The project was data-oriented.","note":"Hyphenation is important for compound adjectives like \"data-oriented\". Without the hyphen, it may be misinterpreted."},{"incorrect":"✗ We are data-orientated.","correct":"✓ We are data-oriented.","note":"The correct form is \"data-oriented\", not \"data-orientated\"."}],"priority":"★★☆"},"related_words":{"derivatives":["data (noun)","orientation (noun)","oriented (adjective)"],"related_terms":["data analysis","data science","data mining","data management","data visualization","data analytics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in specific technical and business contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"data-oriented\" describes something focused on or driven by data. It's often used in technical or business contexts to indicate that decisions, designs, or processes are based on factual information and analysis rather than intuition or subjective opinions. Understanding this term requires familiarity with data-driven methodologies and analytical thinking."},"example_sentences":[{"sentence":"The company's data-oriented approach has led to significant improvements in efficiency.","translation":"その会社のデータ指向のアプローチは、効率の大幅な改善につながった。","type":"general"},{"sentence":"Data-oriented programming emphasizes the structure and organization of data.","translation":"データ指向プログラミングは、データの構造と組織化を重視する。","type":"technical"},{"sentence":"A data-oriented culture encourages employees to use data to support their ideas and decisions.","translation":"データ指向の文化は、従業員がアイデアや意思決定をサポートするためにデータを使用することを奨励する。","type":"business"}]}