{"word":"nulling","priority":"★★☆","meanings":[{"part_of_speech":"verb","definition":"(プログラミング) 変数やメモリ領域にnull値を代入すること、またはその処理","english_definition":"(programming) The act of assigning a null value to a variable or memory location; the process of setting something to null.","examples":[{"sentence":"The pointer was nulled after the object was deleted to prevent dangling pointers.","translation":"オブジェクトが削除された後、ダングリングポインタを防ぐためにポインタはnullに設定されました。"},{"sentence":"Nulling the array elements is a good practice before re-using the array.","translation":"配列を再利用する前に、配列の要素をnullに設定することは良い習慣です。"},{"sentence":"The function returns an error code if it fails, otherwise it returns a pointer; the pointer should be nulled after use.","translation":"関数は失敗するとエラーコードを返し、成功するとポインタを返します。ポインタは使用後、nullに設定する必要があります。"}],"collocations":["nulling a pointer (ポインタをnullにする)","nulling an object (オブジェクトをnullにする)","nulling a variable (変数をnullにする)","zeroing (ゼロクリア)"],"synonyms":["setting to null","clearing","resetting","zeroing"],"antonyms":["allocating","initializing","assigning a value"]},{"part_of_speech":"noun","definition":"(天文学) ヌリング干渉法、ヌリング干渉計 (特定の波長を打ち消し合うように光を干渉させ、特定の天体を観測する方法)","english_definition":"(astronomy) A type of interferometry in which light waves are made to interfere destructively to cancel out light from a particular object, allowing fainter objects nearby to be observed.","examples":[{"sentence":"Nulling interferometry is used to detect exoplanets by suppressing the light from their host stars.","translation":"ヌリング干渉法は、恒星からの光を抑制することによって、系外惑星を検出するために使用されます。"},{"sentence":"The telescope is equipped with a nulling interferometer to improve its ability to observe faint objects.","translation":"その望遠鏡は、微弱な天体を観測する能力を向上させるために、ヌリング干渉計を備えています。"},{"sentence":"The concept of nulling allows astronomers to see planets that would otherwise be lost in the glare of their parent stars.","translation":"ヌリングの概念により、天文学者は、そうでなければ親星のまぶしさで見えなくなる惑星を観測することができます。"}],"collocations":["nulling interferometry (ヌリング干渉法)","nulling interferometer (ヌリング干渉計)","exoplanet detection (系外惑星検出)","high-contrast imaging (高コントラストイメージング)"],"synonyms":["destructive interference","interferometric nulling"],"antonyms":["constructive interference"]}],"etymology":{"value":"The verb 'nulling' is derived from the word 'null', which comes from the Latin word 'nullus', meaning 'none' or 'not any'. In programming, 'null' represents the absence of a value or a reference that does not point to any object. In astronomy, 'nulling' refers to the process of canceling out light waves.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnʌlɪŋ/","syllables":"nul-ling"},"inflection":{"verb_forms":{"present_simple":["nulls"],"past_simple":"nulled","past_participle":"nulled","present_participle":"nulling"},"noun_plural":"nullings (rare, mostly in technical contexts)"},"usage_notes":{"explanation":"In programming, 'nulling' is a common practice to ensure that variables or pointers do not hold invalid or outdated references. This is especially important in languages like C and C++ where memory management is manual. In astronomy, 'nulling' is a sophisticated technique used to enhance the visibility of faint objects near bright ones, such as exoplanets near their host stars.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am nulling about what to do next.","correct":"✓ I am thinking about what to do next.","note":"'Nulling' is a technical term, not a general synonym for 'thinking' or 'considering'. Use it specifically in the context of setting something to null or in astronomical interferometry."},{"incorrect":"✗ The nulling was successful, and we could see the planet clearly.","correct":"✓ The nulling interferometry was successful, and we could see the planet clearly.","note":"When referring to the astronomical technique, it's more accurate to use the full term 'nulling interferometry' to avoid ambiguity."}],"priority":"★★☆"},"related_words":{"derivatives":["null (adjective, noun)","null pointer (noun)","null reference (noun)","null hypothesis (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (technical contexts only)","frequency_google_ngram":"Low (technical contexts only)","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'nulling' has two primary meanings, both technical. In programming, it refers to the act of setting a variable or pointer to 'null', indicating that it does not currently refer to any valid object or memory location. This is a common practice in software development to prevent errors. In astronomy, 'nulling' refers to a specific interferometry technique used to cancel out the light from a bright object, such as a star, in order to observe fainter objects nearby, like exoplanets. Both usages are specialized and require a technical understanding of the respective fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The programmer was careful about **nulling** pointers after deallocating memory.","translation":"プログラマーは、メモリを解放した後、ポインタをnullに設定することに注意を払っていました。","type":"verb","meaning_category":"Programming"},{"sentence":"**Nulling** interferometry is a promising technique for direct imaging of exoplanets.","translation":"ヌリング干渉法は、系外惑星の直接撮像のための有望な技術です。","type":"noun","meaning_category":"Astronomy"},{"sentence":"Failing to **null** the variable can lead to unexpected behavior in the program.","translation":"変数をnullに設定しないと、プログラムで予期しない動作が発生する可能性があります。","type":"verb","meaning_category":"Programming"},{"sentence":"The researchers used **nulling** to suppress the starlight and reveal the faint planet.","translation":"研究者たちは、恒星からの光を抑制し、微弱な惑星を明らかにするためにヌリングを使用しました。","type":"noun","meaning_category":"Astronomy"}]}