{"word":"deist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"理神論者","english_definition":"A person who believes that God created the universe but does not intervene in its workings.","examples":[{"sentence":"Many of the Founding Fathers of the United States were deists.","translation":"アメリカ合衆国の建国の父たちの多くは理神論者であった。"},{"sentence":"Deists typically reject organized religion and supernatural events.","translation":"理神論者は通常、組織化された宗教や超自然的な出来事を否定する。"}],"collocations":["become a deist","famous deists","enlightenment deists"],"synonyms":["rationalist","freethinker","agnostic"],"antonyms":["theist","believer","religious person"]}],"etymology":{"value":"Derived from the Latin word 'deus' meaning 'god'. The term 'deist' emerged in the 17th century to describe those who believed in God based on reason rather than revelation.","priority":"★★☆"},"pronunciation":{"ipa":"ˈdiːɪst","syllables":"de-ist"},"inflection":{"noun_plural":"deists"},"usage_notes":{"explanation":"Deism is a philosophical position that gained prominence during the Age of Enlightenment. Deists believe in a creator God but reject the idea of divine intervention, miracles, and revealed religions. They emphasize reason and natural law as the primary means of understanding the universe and God's existence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a theist, believing in no God.","correct":"He is an atheist, believing in no God.","note":"A theist believes in God, while an atheist does not."},{"incorrect":"Deism is a type of organized religion.","correct":"Deism typically rejects organized religion.","note":"Deism emphasizes individual reason over organized religious dogma."}],"priority":"★☆☆"},"related_words":{"derivatives":["deism (noun)","deistic (adjective)"],"related_terms":["theism","atheism","agnosticism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'deist' refers to a person who adheres to deism, a philosophical belief that posits the existence of a creator God who does not intervene in the universe. Deists rely on reason and natural law to understand the world, often rejecting organized religion and supernatural phenomena. This concept is more frequently encountered in discussions of philosophy, religious history, and the Enlightenment era."},"example_sentences":[{"sentence":"Thomas Jefferson was a well-known deist who valued reason and individual liberty.","translation":"トーマス・ジェファーソンは、理性と個人の自由を重んじた有名な理神論者であった。","type":"example","meaning_category":"general"},{"sentence":"Deists believe that God created the universe and then left it to operate according to natural laws.","translation":"理神論者は、神が宇宙を創造し、その後、自然法則に従って運営されるようにしたと信じている。","type":"example","meaning_category":"belief"},{"sentence":"The principles of deism influenced many political and intellectual movements during the Enlightenment.","translation":"理神論の原則は、啓蒙時代の多くの政治的および知的運動に影響を与えた。","type":"example","meaning_category":"influence"}]}