{"word":"nonlitigiousness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"訴訟を起こさないこと、訴訟を好まない性質","english_definition":"The quality of being disinclined to engage in lawsuits; an aversion to litigation.","examples":[{"sentence":"The company's nonlitigiousness has allowed it to resolve disputes amicably.","translation":"その会社の訴訟を好まない性質が、友好的な紛争解決を可能にしてきた。"},{"sentence":"His nonlitigiousness stems from a desire to avoid conflict.","translation":"彼の訴訟を好まない性質は、紛争を避けたいという願望から来ている。"}],"collocations":["demonstrate nonlitigiousness","promote nonlitigiousness","encourage nonlitigiousness"],"synonyms":["peaceableness","conciliation","amicability","compromise"],"antonyms":["litigiousness","belligerence","aggressiveness"]}],"etymology":{"value":"Derived from \"litigious\" (inclined to engage in lawsuits) with the prefix \"non-\" (not).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnlɪˈtɪdʒəsnəs/","syllables":"non-li-ti-gious-ness"},"inflection":{"noun_plural":"nonlitigiousnesses"},"usage_notes":{"explanation":"\"Nonlitigiousness\" describes a disposition or policy of avoiding lawsuits. It is often used in the context of business or personal relationships where there is a preference for resolving disputes through negotiation, mediation, or other non-legal means.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed nonlitigiousness by suing.","correct":"✓ He showed nonlitigiousness by settling out of court.","note":"Nonlitigiousness implies avoiding lawsuits, so suing is contradictory. Settling out of court is a better example."}],"priority":"★☆☆"},"related_words":{"derivatives":["litigious (adjective)","litigation (noun)","nonlitigious (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Nonlitigiousness\" is a formal term that describes the quality of avoiding lawsuits. It is the opposite of \"litigiousness,\" which means being prone to engaging in legal disputes. This word is typically used in legal, business, or academic contexts. Understanding the prefix \"non-\" and the root word \"litigious\" can help in comprehending its meaning."},"example_sentences":[{"sentence":"The company values nonlitigiousness and seeks to resolve conflicts through mediation.","translation":"その会社は訴訟を避けることを重視し、調停を通じて紛争を解決しようと努めている。","type":"general","meaning_category":"avoiding lawsuits"},{"sentence":"His inherent nonlitigiousness made him an excellent negotiator.","translation":"彼の生来の訴訟を好まない性質が、彼を優れた交渉者にした。","type":"personal trait","meaning_category":"avoiding lawsuits"},{"sentence":"Their policy of nonlitigiousness has saved them significant legal fees.","translation":"彼らの訴訟を避ける方針は、多額の弁護士費用を節約することにつながった。","type":"business policy","meaning_category":"avoiding lawsuits"}]}