{"word":"Momist","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"母親至上主義者、母親を過度に重視する人","english_definition":"A person who excessively values or prioritizes mothers or motherhood, often to the exclusion or detriment of other roles or individuals.","examples":[{"sentence":"Some critics argue that the media often portrays a 'momist' ideal, which puts undue pressure on women to prioritize motherhood above all else.","translation":"一部の批評家は、メディアがしばしば「母親至上主義」的な理想を描き、女性に他の何よりも母親であることを優先するように不当な圧力をかけていると主張しています。"},{"sentence":"She felt that her colleagues at work were 'momists' who didn't understand her dedication to her career.","translation":"彼女は職場の同僚たちが、彼女のキャリアへの献身を理解しない「母親至上主義者」だと感じていました。"}],"collocations":["momist ideology","momist perspective","momist bias","momist culture"],"synonyms":["motherhood idealist","pro-motherhood advocate"],"antonyms":["anti-natalist","child-free advocate"]},{"part_of_speech":"形容詞","definition":"母親至上主義的な、母親を過度に重視する","english_definition":"Relating to or characterized by an excessive emphasis on mothers or motherhood.","examples":[{"sentence":"The article criticized the 'momist' attitudes prevalent in society.","translation":"その記事は、社会に蔓延している「母親至上主義的」な態度を批判しました。"},{"sentence":"The company's policies were seen as 'momist', favoring mothers over other employees.","translation":"その会社の方針は、「母親至上主義的」であると見なされ、他の従業員よりも母親を優遇していました。"}],"collocations":["momist policies","momist views","momist stereotypes","momist assumptions"],"synonyms":["mother-centric","pro-motherhood"],"antonyms":["anti-motherhood","child-free"]}],"etymology":{"value":"A blend of 'mom' (or 'mother') and '-ist' (a suffix indicating an advocate or follower of a particular ideology).","priority":"中"},"pronunciation":{"ipa":"/ˈmɒmɪst/","syllables":"Mom-ist"},"inflection":{"noun_plural":"Momists","adjective_forms":{}},"usage_notes":{"explanation":"'Momist' is a relatively recent and somewhat pejorative term used to describe someone who places an excessive value on mothers and motherhood. It often implies a bias or preference for mothers over other individuals, or a belief that motherhood is the most important role for women. The term can be used to critique societal attitudes, policies, or media representations that reinforce this bias.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"She is a momist because she loves her children.","correct":"She is a loving mother who prioritizes her children's needs.","note":"Simply loving one's children does not make someone a 'momist.' The term implies an excessive or biased view of motherhood."},{"incorrect":"The company is momist because they offer maternity leave.","correct":"The company is family-friendly because they offer maternity leave.","note":"Offering maternity leave is not inherently 'momist.' It is a common and often legally required practice to support families."}],"priority":"中"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度","priority":"低"},"readability_explanation":{"level":"C1","text":"'Momist' is a relatively uncommon term used to describe someone who excessively values mothers or motherhood, often to the exclusion of other roles or individuals. It is often used critically to point out a bias or an overemphasis on motherhood in society or in specific contexts. The term is not widely recognized, so it is important to use it with care and provide context when necessary."},"example_sentences":[{"sentence":"The article argued that the media's portrayal of mothers often reinforces 'momist' stereotypes.","translation":"その記事は、メディアによる母親の描写がしばしば「母親至上主義的」な固定観念を強化していると主張しました。","type":"adjective","meaning_category":"母親至上主義的な"},{"sentence":"She accused her supervisor of being a 'momist' because he always gave preferential treatment to mothers.","translation":"彼女は、上司が常に母親を優遇するため、「母親至上主義者」だと非難しました。","type":"noun","meaning_category":"母親至上主義者"}]}