{"word":"carotenodermia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カロテノデルミア、柑皮症：カロテンの過剰摂取により皮膚が黄色くなる状態","english_definition":"A yellowing of the skin due to high levels of carotene in the blood, usually from eating too many carotene-rich foods.","examples":[{"sentence":"Carotenodermia is often seen in infants who are fed large amounts of pureed carrots or sweet potatoes.","translation":"カロテノデルミアは、ピューレ状のニンジンやサツマイモを大量に与えられた乳児によく見られます。"},{"sentence":"While carotenodermia can be alarming, it is generally harmless and resolves when carotene intake is reduced.","translation":"カロテノデルミアは驚くべきことですが、一般的には無害であり、カロテン摂取量を減らすと解消されます。"}],"collocations":["develop carotenodermia","carotenodermia in infants","dietary carotenodermia"],"synonyms":["xanthoderma (general yellowing of the skin)"],"antonyms":[]}],"etymology":{"value":"Derived from 'carotene' (a type of pigment), 'dermo-' (referring to the skin), and '-ia' (a condition).","priority":"★★☆"},"pronunciation":{"ipa":"/kəˌrɒtɪnoʊˈdɜːrmiə/","syllables":"ca-rot-e-no-der-mi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Carotenodermia is a condition characterized by yellowing of the skin, particularly noticeable on the palms of the hands, soles of the feet, and face. It is caused by elevated levels of carotene in the blood, typically due to excessive consumption of foods rich in beta-carotene, such as carrots, sweet potatoes, pumpkins, and squash. Unlike jaundice, the whites of the eyes (sclera) do not turn yellow in carotenodermia. The condition is generally benign and resolves with dietary modification. It's important to differentiate carotenodermia from other causes of jaundice or yellow skin discoloration.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Carotenodermia is a dangerous disease.","correct":"✓ Carotenodermia is a harmless condition.","note":"Carotenodermia is typically a benign condition that resolves with dietary changes."},{"incorrect":"✗ Carotenodermia causes the eyes to turn yellow.","correct":"✓ Carotenodermia does not cause the eyes to turn yellow.","note":"Unlike jaundice, carotenodermia does not affect the sclera (whites of the eyes)."}],"priority":"★★☆"},"related_words":{"derivatives":["carotene","carotenoid"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Carotenodermia' is a medical term referring to the yellowing of the skin due to high levels of carotene in the blood. This is usually caused by eating too many foods like carrots or sweet potatoes. It's generally harmless and goes away when you eat less of these foods. It's important to know that, unlike jaundice, the whites of your eyes don't turn yellow with carotenodermia."},"example_sentences":[{"sentence":"The pediatrician diagnosed the infant with carotenodermia due to excessive carrot consumption.","translation":"小児科医は、ニンジンの過剰摂取により、その乳児をカロテノデルミアと診断しました。","type":"noun","meaning_category":"medical condition"},{"sentence":"Reducing the amount of sweet potatoes in her diet helped to clear up the carotenodermia.","translation":"食事中のサツマイモの量を減らすことで、彼女のカロテノデルミアは治まりました。","type":"noun","meaning_category":"medical condition"}]}