{"word":"anachronize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"時代錯誤にする、時代錯誤的に表現する","english_definition":"to represent or regard (something) as belonging to a period other than that in which it exists, typically in order to make it seem old-fashioned or out of place.","examples":[{"sentence":"The film anachronizes the Victorian era by including modern slang.","translation":"その映画は現代のスラングを含めることで、ビクトリア時代を時代錯誤にしている。"},{"sentence":"The author was criticized for anachronizing the historical setting.","translation":"その作者は歴史的背景を時代錯誤的に表現したとして批判された。"}],"collocations":["anachronize a historical period","anachronize a character","anachronize a setting"],"synonyms":["misdate","misplace in time","chronologically misplace"],"antonyms":["modernize","update","synchronize"]}],"etymology":{"value":"\"anachronize\" comes from \"anachronism,\" which is derived from the Greek \"ana\" (against) + \"chronos\" (time) + \"ismos\" (a practice or system). Therefore, to anachronize is to treat something against its proper time.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈnækrənaɪz/","syllables":"a-nach-ro-nize"},"inflection":{"verb_forms":{"present_simple":["anachronize","anachronizes"],"past_simple":"anachronized","past_participle":"anachronized","present_participle":"anachronizing"}},"usage_notes":{"explanation":"\"Anachronize\" is the verb form of \"anachronism.\" It means to depict or treat something as if it belongs to a different time period than it actually does. This is often done intentionally for comedic or artistic effect. It can also be done unintentionally, resulting in historical inaccuracies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The author anachronized the future.","correct":"✓ The author anachronized the past.","note":"You can only anachronize something from the past, not the future."},{"incorrect":"✗ The movie was an anachronize.","correct":"✓ The movie was anachronistic.","note":"\"Anachronize\" is a verb. The adjective form is \"anachronistic.\""}],"priority":"★★☆"},"related_words":{"derivatives":["anachronism (名詞: 時代錯誤)","anachronistic (形容詞: 時代錯誤の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Anachronize\" means to present something as if it belongs to a different time period than it actually does. It's a relatively uncommon word, often used in discussions about historical accuracy in literature, film, and other media. Understanding the root word \"anachronism\" (something out of place in time) can help you grasp the meaning of \"anachronize.\" It is a formal word.","priority":"★★☆"},"example_sentences":[{"sentence":"The play anachronizes ancient Rome by having the characters use cell phones.","translation":"その劇は登場人物に携帯電話を使わせることで、古代ローマを時代錯誤にしている。","type":"verb","meaning_category":"時代錯誤にする"},{"sentence":"He was accused of anachronizing the events to fit his narrative.","translation":"彼は自分の物語に合わせるために出来事を時代錯誤的に表現したと非難された。","type":"verb","meaning_category":"時代錯誤的に表現する"}]}