{"word":"badgerlike","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"アナグマに似た、アナグマのような","english_definition":"Resembling a badger, especially in appearance or behavior.","examples":[{"sentence":"The old man had a badgerlike face, with grizzled hair and a stubborn expression.","translation":"その老人は、白髪交じりの髪と頑固そうな表情で、アナグマのような顔をしていた。"},{"sentence":"The dog's badgerlike markings made it easy to identify.","translation":"その犬のアナグマのような模様は、識別を容易にした。"},{"sentence":"His badgerlike tenacity made him a formidable opponent.","translation":"彼のアナグマのような粘り強さは、彼を恐るべき対戦相手にした。"}],"collocations":["badgerlike face (アナグマのような顔)","badgerlike markings (アナグマのような模様)","badgerlike tenacity (アナグマのような粘り強さ)","badgerlike behavior (アナグマのような行動)"],"synonyms":["stubborn","persistent","tenacious","grizzled","burrowing"],"antonyms":["gentle","docile","weak","yielding"]},{"part_of_speech":"adjective","definition":"しつこくせがむ、つきまとうような","english_definition":"Persistently annoying or harassing.","examples":[{"sentence":"His badgerlike questioning made everyone uncomfortable.","translation":"彼のアナグマのようなしつこい質問は、皆を不快にさせた。"},{"sentence":"She had a badgerlike way of getting what she wanted.","translation":"彼女はアナグマのように、欲しいものを手に入れるやり方を持っていた。"},{"sentence":"The reporter's badgerlike pursuit of the story paid off in the end.","translation":"その記者のアナグマのような物語の追求は、最終的に報われた。"}],"collocations":["badgerlike questioning (アナグマのような質問)","badgerlike pursuit (アナグマのような追求)","badgerlike persistence (アナグマのような粘り強さ)"],"synonyms":["harassing","nagging","pestering","importunate","dogged"],"antonyms":["agreeable","pleasant","easygoing"]}],"etymology":{"value":"The word \"badgerlike\" is formed by adding the suffix \"-like\" to the noun \"badger.\" The suffix \"-like\" means \"resembling\" or \"having the characteristics of.\" Therefore, \"badgerlike\" means resembling or having the characteristics of a badger.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbædʒərˌlaɪk/","syllables":"bad-ger-like"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more badgerlike, most badgerlike), although these are less common."},"usage_notes":{"explanation":"The adjective \"badgerlike\" is used to describe something that resembles a badger, either in its physical appearance or in its behavior. When describing appearance, it often refers to grizzled coloring or a stocky build. When describing behavior, it usually refers to persistence, tenacity, or a tendency to be annoying or harassing. The word can have both positive and negative connotations, depending on the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was badgerlike the witness.","correct":"✓ He was badgering the witness.","note":"\"Badgerlike\" is an adjective, not a verb. To describe the act of persistently questioning or harassing someone, use the verb \"badger.\""},{"incorrect":"✗ The badgerlike is a strong animal.","correct":"✓ The badger is a strong animal.","note":"\"Badgerlike\" is an adjective, so it must modify a noun. To refer to the animal itself, use the noun \"badger.\""}],"priority":"★★☆"},"related_words":{"derivatives":["badger (noun, verb)","badgering (noun, verb)"],"related_adjectives":["animalistic","feral","stubborn","persistent","tenacious"],"animal_names":["foxlike","wolflike","lionlike","bearlike"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"badgerlike\" is a relatively uncommon adjective used to describe something that resembles a badger in appearance or behavior. It often implies qualities such as stubbornness, persistence, or a grizzled appearance. Understanding the characteristics associated with badgers is helpful in interpreting the meaning of \"badgerlike.\" Because it's not a frequently used word, it's more likely to be encountered in advanced reading materials or specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The detective's badgerlike determination to solve the case never wavered.","translation":"その刑事の事件を解決するというアナグマのような決意は、決して揺るがなかった。","type":"adjective","meaning_category":"persistent"},{"sentence":"The old prospector had a badgerlike face, weathered by years of exposure to the elements.","translation":"その老いた探鉱者は、長年の風雨にさらされたアナグマのような顔をしていた。","type":"adjective","meaning_category":"appearance"},{"sentence":"The journalist's badgerlike questioning eventually uncovered the truth.","translation":"そのジャーナリストのアナグマのような質問は、最終的に真実を明らかにした。","type":"adjective","meaning_category":"annoying/harassing"},{"sentence":"Despite the setbacks, she showed a badgerlike resilience and refused to give up.","translation":"度重なる挫折にもかかわらず、彼女はアナグマのような回復力を示し、諦めることを拒否した。","type":"adjective","meaning_category":"tenacious"},{"sentence":"The dog had badgerlike markings, with a dark stripe down its back.","translation":"その犬は、背中に沿って暗い縞模様があるアナグマのような模様をしていた。","type":"adjective","meaning_category":"appearance"}]}