{"word":"hydrochloric","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"塩酸の、塩化水素の","english_definition":"relating to or containing hydrochloric acid.","examples":[{"sentence":"hydrochloric acid is a strong acid.","translation":"塩酸は強酸です。"},{"sentence":"The laboratory uses hydrochloric solutions for various experiments.","translation":"その研究室では、さまざまな実験に塩酸溶液を使用しています。"}],"collocations":["hydrochloric acid","hydrochloric solution"],"synonyms":["muriatic"],"antonyms":[]}],"etymology":{"value":"'Hydrochloric' is derived from 'hydro-' (relating to water) and 'chloric' (relating to chlorine). It refers to compounds containing hydrogen and chlorine, especially in aqueous solutions, forming hydrochloric acid.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪdrəˈklɔːrɪk/","syllables":"hy·dro·chlor·ic"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns."},"usage_notes":{"explanation":"'Hydrochloric' is primarily used to describe substances or processes involving hydrochloric acid, a strong, corrosive acid commonly used in various industrial and laboratory applications. It's important in chemistry and related fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I spilled hydochloric acid on my skin.","correct":"✓ I spilled hydrochloric acid on my skin.","note":"Correct spelling is crucial when referring to chemicals."}],"priority":"★★☆"},"related_words":{"derivatives":["hydrochloride (noun): a salt of hydrochloric acid"],"related_terms":["acid","chlorine","hydrogen chloride","solution"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, mainly used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hydrochloric' is a technical adjective used in chemistry and related fields to describe substances associated with hydrochloric acid. It's typically encountered in scientific or industrial contexts and may not be familiar to the general public. Understanding its meaning requires some knowledge of basic chemistry.","priority":"★★☆"},"example_sentences":[{"sentence":"The chemist carefully added hydrochloric acid to the titration.","translation":"化学者は滴定に塩酸を注意深く加えた。","type":"general","meaning_category":"descriptive"},{"sentence":"Hydrochloric acid is used in the production of many industrial chemicals.","translation":"塩酸は多くの工業用化学製品の製造に使用されている。","type":"technical","meaning_category":"industrial use"}]}