{"word":"Emancipist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)オーストラリアの植民地時代において、刑期を終えて自由の身になった囚人。","english_definition":"(historical, Australia) A former convict who has served their sentence and been granted freedom in colonial Australia.","examples":[{"sentence":"The emancipists sought to integrate into colonial society.","translation":"解放囚人たちは植民地社会に溶け込もうとした。"},{"sentence":"There was often tension between emancipists and those who had arrived as free settlers.","translation":"解放囚人と自由移民として到着した人々との間には、しばしば緊張があった。"}],"collocations":["former convict","colonial Australia","free settler"],"synonyms":["ex-convict","freed convict"],"antonyms":["pure merino","exclusive"],"notes":"The term 'emancipist' is specific to the historical context of colonial Australia.","etymology":{"value":"From 'emancipate', meaning to set free, plus the suffix '-ist', indicating a person associated with a particular belief or status.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈmænsɪpɪst/","syllables":"e-man-ci-pist"},"inflection":{"noun_plural":"emancipists"},"usage_notes":{"explanation":"'Emancipist' refers to a specific group of people in Australian history. It's important to understand the historical context to use the term correctly.","priority":"★★☆"},"related_words":{"derivatives":["emancipate (verb)","emancipation (noun)"],"related_terms":["convict","penal colony","free settler","pure merino"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in historical contexts related to Australia.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Emancipist' is a historical term related to colonial Australia. It refers to a former convict who has served their sentence and been granted freedom. Understanding the historical context of Australian penal colonies is essential to comprehend the meaning of this word."},"example_sentences":[{"sentence":"Many emancipists became successful farmers and businessmen.","translation":"多くの解放囚人が成功した農家や実業家になった。","type":"noun","meaning_category":"historical"},{"sentence":"The emancipist movement advocated for greater rights and social acceptance.","translation":"解放囚人運動は、より大きな権利と社会的受容を提唱した。","type":"noun","meaning_category":"historical"}]}]}