{"word":"bailieries","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)管区、代官の管轄区域","english_definition":"The plural form of 'bailiery', referring to the district or area of jurisdiction of a bailiff.","examples":[{"sentence":"The Channel Islands are divided into two bailieries: Jersey and Guernsey.","translation":"チャンネル諸島は、ジャージーとガーンジーの2つの管区に分かれています。"},{"sentence":"Each of the bailieries had its own court and legal system.","translation":"それぞれの管区は、独自の裁判所と法制度を持っていました。"}],"collocations":["Channel Islands bailieries","historical bailieries","bailieries of Jersey and Guernsey"],"synonyms":["district","jurisdiction","territory","area","region"],"antonyms":[]}],"etymology":{"value":"Derived from 'bailiery', which comes from the Old French 'baillie', meaning 'custody, charge, jurisdiction', from 'baillier' meaning 'to give, deliver, entrust'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbeɪlɪriz/","syllables":"bai-li-e-ries"},"inflection":{"noun_plural":"bailieries"},"usage_notes":{"explanation":"'Bailieries' is the plural form of 'bailiery', which refers to the area or district under the jurisdiction of a bailiff. A bailiff is a legal officer with various responsibilities, including serving warrants, making arrests, and managing property. The term is most commonly encountered in historical contexts or in reference to specific administrative divisions, such as the bailieries of the Channel Islands.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bailiery are responsible for enforcing the law.","correct":"✓ The bailieries are responsible for enforcing the law.","note":"'Bailieries' is plural, so it requires a plural verb ('are')."},{"incorrect":"✗ The bailieries is a small district.","correct":"✓ A bailiery is a small district. / ✓ The bailieries are small districts.","note":"When referring to a single district, use the singular form 'bailiery' with a singular verb ('is'). When referring to multiple districts, use the plural form 'bailieries' with a plural verb ('are')."}],"priority":"★★☆"},"related_words":{"derivatives":["bailiery (noun: the district or area of jurisdiction of a bailiff)","bailiff (noun: a legal officer with various responsibilities)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Relatively uncommon word, primarily used in specific historical or legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bailieries' is a relatively uncommon term that refers to the districts or areas of jurisdiction of a bailiff. A bailiff is a legal officer responsible for various duties, such as serving warrants and managing property. The term is primarily used in historical contexts or when discussing specific administrative divisions, such as the Channel Islands. Understanding this word requires familiarity with legal and administrative terminology."},"example_sentences":[{"sentence":"The two **bailieries** of the Channel Islands have different legal systems.","translation":"チャンネル諸島の2つの管区は、異なる法制度を持っています。","type":"noun","meaning_category":"管区"},{"sentence":"Historically, the **bailieries** were responsible for collecting taxes and enforcing laws.","translation":"歴史的に、管区は税金の徴収と法律の施行を担当していました。","type":"noun","meaning_category":"管区"}]}