{"word":"non-peptide","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非ペプチド性の","english_definition":"Not consisting of or relating to peptides.","examples":[{"sentence":"This compound is a non-peptide inhibitor of the enzyme.","translation":"この化合物は、その酵素の非ペプチド性阻害剤です。"},{"sentence":"We are developing non-peptide drugs to target this receptor.","translation":"我々はこの受容体を標的とする非ペプチド薬を開発している。"}],"collocations":["non-peptide drug","non-peptide inhibitor","non-peptide ligand"],"synonyms":["nonprotein","synthetic"],"antonyms":["peptide","protein"]}],"etymology":{"value":"Formed by combining the prefix 'non-' (meaning 'not') with the word 'peptide'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈpɛptaɪd/","syllables":"non-pep-tide"},"inflection":{"notes":"This word does not inflect (it has no plural form, and does not change based on tense, etc.)"},"usage_notes":{"explanation":"'Non-peptide' is used to describe molecules or substances that are not made up of amino acids linked together by peptide bonds. It is often used in the context of pharmaceuticals or biochemistry to distinguish between compounds that are peptide-based and those that are not.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ a nonpeptide","correct":"✓ a non-peptide","note":"It is more common to use a hyphen between 'non' and the word it modifies, especially when the combined word is not yet widely established."}],"priority":"★★☆"},"related_words":{"derivatives":["peptide","protein","amino acid"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Non-peptide' is a technical term used in chemistry and biology. It refers to substances that are not made of peptides, which are short chains of amino acids. This term is often used when discussing drugs or other molecules that interact with biological systems. Understanding this term requires knowledge of basic chemistry and biology concepts.","priority":"★★★"},"example_sentences":[{"sentence":"The researchers identified a novel non-peptide compound with antiviral activity.","translation":"研究者らは、抗ウイルス活性を持つ新規な非ペプチド性化合物を特定した。","type":"adjective","meaning_category":"chemistry"},{"sentence":"Many small molecule drugs are non-peptide in nature.","translation":"多くの低分子医薬品は、非ペプチド性である。","type":"adjective","meaning_category":"pharmaceuticals"}]}