{"word":"subvendee","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"再購入者、転売先、また貸し先","english_definition":"A person who buys something from a vendee (buyer) or a lessee; a subsequent purchaser.","examples":[{"sentence":"The subvendee acquired the property from the original buyer.","translation":"再購入者は元の買い手からその不動産を取得した。"},{"sentence":"The subvendee was unaware of the restrictions placed on the original sale.","translation":"再購入者は、最初の販売に課せられた制限を知らなかった。"}],"collocations":["original vendee","subsequent sale","property rights"],"synonyms":["second purchaser","transferee","assignee"],"antonyms":["original vendor","lessor"]}],"etymology":{"value":"Formed from 'sub-' (meaning 'under' or 'secondary') + 'vendee' (buyer).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌb.vɛnˈdiː/","syllables":"sub-ven-dee"},"inflection":{"noun_plural":"subvendees"},"usage_notes":{"explanation":"The term 'subvendee' is primarily used in legal and commercial contexts, particularly when discussing property rights, sales agreements, and leasing arrangements. It denotes a buyer who is not the original purchaser but acquires the item or property from a previous buyer (vendee).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The vendor sold the property to the subvendee directly.","correct":"✓ The vendor sold the property to the vendee, who then sold it to the subvendee.","note":"The subvendee is not the initial buyer from the vendor; they purchase from the vendee."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["vendor","vendee","sublease","assignment"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily a legal and commercial term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Subvendee' is a specialized term used in legal and commercial contexts to refer to someone who buys property or goods from a previous buyer (the vendee), rather than directly from the original seller (the vendor). Understanding this term requires familiarity with legal and business terminology related to sales and transfers of ownership."},"example_sentences":[{"sentence":"The rights of the subvendee are subject to the terms of the original contract.","translation":"再購入者の権利は、元の契約条件に従うものとする。","type":"general","meaning_category":"legal"},{"sentence":"As a subvendee, he had to pay the transfer tax.","translation":"再購入者として、彼は譲渡税を支払わなければならなかった。","type":"general","meaning_category":"financial"}]}