{"word":"Catcalling","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(男性が女性に対して行う)卑猥な言葉や性的な嫌がらせ","english_definition":"The action of shouting insulting, rude, or sexually suggestive comments at someone publicly.","examples":[{"sentence":"She was subjected to catcalling as she walked down the street.","translation":"彼女は通りを歩いているときに、卑猥な言葉を浴びせられた。"},{"sentence":"The city is trying to crack down on catcalling.","translation":"市は、卑猥な言葉による嫌がらせを取り締まろうとしている。"}],"collocations":["experience catcalling","report catcalling","crack down on catcalling"],"synonyms":["street harassment","sexual harassment","verbal abuse"],"antonyms":[]},{"part_of_speech":"verb","definition":"(男性が女性に対して)卑猥な言葉や性的な嫌がらせをする","english_definition":"To shout insulting, rude, or sexually suggestive comments at someone publicly.","examples":[{"sentence":"They were catcalling women who walked by.","translation":"彼らは通り過ぎる女性に卑猥な言葉を浴びせていた。"},{"sentence":"It's never okay to catcall someone.","translation":"誰かに卑猥な言葉を浴びせるのは決して許されることではない。"}],"collocations":["catcall at someone","catcall women"],"synonyms":["harass","verbally abuse","make unwanted advances"],"antonyms":[]}],"etymology":{"value":"The term combines 'cat' (referring to the sound or gesture) and 'call' (a shout or cry). The exact origin is debated, but it likely evolved from the idea of a loud, attention-seeking call, similar to how one might call a cat.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkætˌkɔːlɪŋ/","syllables":"cat-call-ing"},"inflection":{"verb_forms":{"present_participle":"catcalling","past_simple":"catcalled","past_participle":"catcalled","present_simple":["catcall","catcalls"]}},"usage_notes":{"explanation":"'Catcalling' is a form of street harassment and is widely considered to be a form of sexual harassment. It is often unwanted and can be intimidating or offensive. The term is most commonly used to describe men directing unwanted comments towards women, but it can also occur in other contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He catcalled to his friend across the street.","correct":"✓ He called to his friend across the street.","note":"'Catcalling' specifically refers to sexually suggestive or harassing comments, not just any call to someone."},{"incorrect":"✗ The cat was catcalling outside.","correct":"✓ The cat was meowing outside.","note":"'Catcalling' is a human action, not something a cat does."}],"priority":"★★☆"},"related_words":{"derivatives":["catcall (noun: a whistle or shout of disapproval, often in a theater or sports event; verb: to jeer or whistle at someone)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Catcalling' refers to the act of making unwanted, sexually suggestive, or harassing comments or sounds towards someone in public. It's a type of street harassment that is often considered offensive and disrespectful. The term is relatively modern and is used to describe a specific form of unwanted attention. It's important to understand that catcalling is not a compliment and is often experienced as a form of intimidation or abuse."},"example_sentences":[{"sentence":"The woman ignored the men who were **catcalling** her.","translation":"その女性は、彼女に卑猥な言葉を浴びせていた男性たちを無視した。","type":"verb","meaning_category":"嫌がらせをする"},{"sentence":"Many people consider **catcalling** to be a form of sexual harassment.","translation":"多くの人々は、卑猥な言葉による嫌がらせをセクシャルハラスメントの一種だと考えている。","type":"noun","meaning_category":"嫌がらせ"}]}