{"word":"Helotism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘイロータイ（古代スパルタにおける隷農制度）","english_definition":"The condition of being a helot; the system or practice of helotry.","examples":[{"sentence":"The Spartan society was characterized by helotism, where the helots were subjected to harsh treatment.","translation":"スパルタ社会はヘイロータイ制によって特徴づけられ、ヘイロータイは過酷な扱いを受けた。"}],"collocations":["Spartan helotism","practice of helotism"],"synonyms":["serfdom","slavery","subjugation"],"antonyms":["freedom","liberation"]}],"etymology":{"value":"Derived from 'helot,' referring to the state-owned serfs of ancient Sparta.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛlətɪzəm/","syllables":"hel-o-tism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Helotism' specifically refers to the system of helotry in ancient Sparta, where helots were a subjugated population bound to the land and subjected to harsh treatment. It is rarely used outside of historical contexts related to ancient Greece.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company's helotism of its employees led to low morale.","correct":"✓ The company's exploitation of its employees led to low morale.","note":"'Helotism' is specific to the historical context of ancient Sparta. In modern contexts, use terms like 'exploitation,' 'oppression,' or 'subjugation' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["helot (noun: a state-owned serf in ancient Sparta)","helotry (noun: the system of helots)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Helotism' is a specialized term referring to the system of helotry in ancient Sparta. It is rarely used outside of academic or historical discussions of ancient Greece. The concept involves a subjugated population bound to the land and subjected to harsh treatment by the ruling Spartan class. Understanding this term requires familiarity with ancient Greek history and social structures."},"example_sentences":[{"sentence":"The social structure of Sparta was built upon helotism, which allowed the Spartans to focus on military training.","translation":"スパルタの社会構造はヘイロータイ制の上に築かれており、それによってスパルタ人は軍事訓練に集中することができた。","type":"noun","meaning_category":"system of helotry"},{"sentence":"The study of helotism provides insights into the dynamics of power and oppression in ancient societies.","translation":"ヘイロータイ制の研究は、古代社会における権力と抑圧の力学への洞察を提供する。","type":"noun","meaning_category":"system of helotry"}]}