{"word":"asthenical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"虚弱な、無力な、衰弱した","english_definition":"Characterized by asthenia; weak; feeble.","examples":[{"sentence":"The patient presented with asthenical symptoms such as fatigue and muscle weakness.","translation":"患者は疲労や筋力低下などの衰弱症状を呈した。"},{"sentence":"His asthenical condition made it difficult for him to perform daily tasks.","translation":"彼の虚弱な状態は、彼が日常的なタスクを行うことを困難にした。"}],"collocations":["asthenical symptoms","asthenical condition","asthenical appearance"],"synonyms":["weak","feeble","debilitated","enervated","languid","frail"],"antonyms":["strong","robust","vigorous","healthy","energetic"]}],"etymology":{"value":"Derived from 'asthenia,' which comes from the Greek 'asthenes' meaning 'without strength.'","priority":"★★★"},"pronunciation":{"ipa":"/æsˈθɛnɪkəl/","syllables":"as-then-i-cal"},"inflection":{"notes":"Comparative and superlative forms are possible but rare: more asthenical, most asthenical."},"usage_notes":{"explanation":"'Asthenical' is a formal term, primarily used in medical contexts to describe a state of weakness or lack of energy. It is less commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He felt asthenic.","correct":"✓ He felt asthenical.","note":"While 'asthenic' and 'asthenical' both relate to weakness, 'asthenical' is more descriptive of a condition or symptoms, whereas 'asthenic' can describe a person's general state."}],"priority":"★★☆"},"related_words":{"derivatives":["asthenia (noun: abnormal physical weakness or lack of energy)","asthenic (adjective: relating to or suffering from asthenia)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in medical or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'asthenical' is a relatively uncommon and formal term used to describe a state of weakness or lack of energy, often in a medical context. It is derived from 'asthenia,' which refers to abnormal physical weakness or lack of energy. The term is more commonly encountered in medical literature or discussions related to health conditions. Understanding its meaning requires a strong vocabulary and familiarity with medical terminology."},"example_sentences":[{"sentence":"The patient's asthenical state was a cause for concern among the medical staff.","translation":"患者の衰弱状態は医療スタッフの間で懸念の原因となった。","type":"general","meaning_category":"weak"},{"sentence":"The asthenical appearance of the old building suggested years of neglect.","translation":"その古い建物の衰弱した外観は、長年の放置を示唆していた。","type":"descriptive","meaning_category":"weak"}]}