{"word":"Isocracies","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Plural form of isocracy; a system of government where all citizens have equal political power.","english_definition":"The plural form of isocracy, which is a system of government where all citizens possess equal political power.","examples":[{"sentence":"The ancient Greek city-states experimented with various forms of government, including isocracies.","translation":"古代ギリシャの都市国家は、イソクラシーを含む様々な形態の政府を試しました。"},{"sentence":"Some utopian societies are based on the principles of isocracies, ensuring every member has a voice.","translation":"いくつかの理想郷社会は、すべてのメンバーが発言権を持つことを保証する、イソクラシーの原則に基づいています。"}],"collocations":["establish isocracies","maintain isocracies","principles of isocracies","examples of isocracies"],"synonyms":["egalitarianism","democracy","republic"],"antonyms":["autocracy","oligarchy","aristocracy"]}],"etymology":{"value":"Derived from 'isocracy,' which combines the Greek words 'isos' (equal) and 'kratos' (power or rule).","priority":"★★★"},"pronunciation":{"ipa":"/aɪˈsɒkrəsiːz/","syllables":"I-soc-ra-cies"},"inflection":{"noun_plural":"Isocracies"},"usage_notes":{"explanation":"'Isocracies' refers to multiple instances or examples of isocracy, a theoretical or practical system where political power is equally distributed among all citizens. It is often used in political science and philosophy discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Isocracies is a good form of government.","correct":"✓ Isocracy is a good form of government.","note":"'Isocracies' is plural, so the singular form 'isocracy' should be used when referring to the concept in general."}],"priority":"★★★"},"related_words":{"derivatives":["isocracy","isocratic","isocratically"],"related_terms":["democracy","egalitarianism","republic","anarchy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Isocracies' is a plural noun referring to multiple instances of a political system where all citizens have equal power. It is a relatively rare term, primarily used in political science and philosophical discussions about governance. Understanding the root word 'isocracy' (equal power or rule) is key to comprehending its meaning.","priority":"★★★"},"example_sentences":[{"sentence":"The history books mentioned several ancient attempts at establishing isocracies.","translation":"歴史書には、イソクラシーを確立しようとした古代の試みがいくつか記載されていました。","type":"noun","meaning_category":"political systems"},{"sentence":"The failures of past isocracies serve as cautionary tales for modern political theorists.","translation":"過去のイソクラシーの失敗は、現代の政治理論家にとっての教訓となっています。","type":"noun","meaning_category":"political systems"}]}