{"word":"irrefrangibly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"破ることができないほどに、反論できないほどに、覆すことができないほどに","english_definition":"in a manner that cannot be broken, violated, or refuted; indisputably.","examples":[{"sentence":"The contract was irrefrangibly binding.","translation":"その契約は破ることができないほど拘束力があった。"},{"sentence":"His argument was irrefrangibly logical.","translation":"彼の議論は反論できないほど論理的だった。"}],"collocations":["irrefrangibly binding","irrefrangibly established","irrefrangibly proven"],"synonyms":["indisputably","unquestionably","irrefutably","incontrovertibly","unassailably","unbreakably"],"antonyms":["disputably","questionably","refutably","controvertibly"]}],"etymology":{"value":"\"Irrefrangibly\" is derived from \"irrefrangible,\" which comes from the Latin word \"irrefrangibilis,\" meaning \"unbreakable.\" This is formed from \"ir-\" (not) + \"refrangere\" (to break, shatter), from \"re-\" (back, again) + \"frangere\" (to break).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪrɪˈfrændʒɪbli","syllables":"ir-re-fran-gi-bly"},"inflection":{"notes":"As an adverb, it does not inflect."},"usage_notes":{"explanation":"\"Irrefrangibly\" is a formal and relatively rare adverb used to emphasize the absolute certainty or inviolability of something. It suggests that something is so firmly established or logically sound that it cannot be broken, violated, or refuted. It is often used in legal, philosophical, or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He irrefrangibly broke the law.","correct":"✓ The law was irrefrangibly applied.","note":"\"Irrefrangibly\" describes the manner in which something is done or the quality of something, not the action of breaking something. It's better used to describe the binding nature of a law or the logic of an argument, rather than the act of violating a law. "},{"incorrect":"✗ The glass was irrefrangibly.","correct":"✓ The glass was irrefrangible.","note":"\"Irrefrangibly\" is an adverb and modifies verbs, adjectives, or other adverbs. To describe the quality of the glass, use the adjective \"irrefrangible.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["irrefrangible (adjective)","irrefrangibility (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"irrefrangibly\" is a highly formal and uncommon word. It means in a way that cannot be broken, violated, or refuted. It is used to describe something that is absolutely binding or certain, often in legal or philosophical contexts. Because of its rarity and complexity, it is only appropriate for use in very formal writing or speech.","priority":"★☆☆"},"example_sentences":[{"sentence":"The evidence presented irrefrangibly proved his innocence.","translation":"提示された証拠は、彼の無実を覆すことができないほどに証明した。","type":"adverb","meaning_category":"unquestionably proven"},{"sentence":"The principles of mathematics are irrefrangibly true.","translation":"数学の原理は、反論の余地なく真実である。","type":"adverb","meaning_category":"unassailably true"}]}