{"word":"descent-based","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"血統に基づいた、系統に基づいた","english_definition":"Based on descent or ancestry; relating to or determined by lineage.","examples":[{"sentence":"The tribe's membership is descent-based, with individuals inheriting their status through their parents.","translation":"その部族のメンバーシップは血統に基づいており、個人は親を通じて地位を受け継ぎます。"},{"sentence":"Descent-based systems of social organization are common in many indigenous cultures.","translation":"血統に基づく社会組織システムは、多くの先住民族の文化において一般的です。"},{"sentence":"The inheritance laws in that country are descent-based, favoring direct descendants.","translation":"その国の相続法は血統に基づいており、直系の子孫を優遇しています。"}],"collocations":["descent-based society (血統に基づく社会)","descent-based membership (血統に基づくメンバーシップ)","descent-based inheritance (血統に基づく相続)","descent-based claim (血統に基づく主張)"],"synonyms":["lineage-based","ancestry-based","hereditary","familial","genealogical"],"antonyms":["achievement-based","merit-based","performance-based"]}],"etymology":{"value":"The term is formed by combining 'descent' (the act of moving down or the origin or lineage of a person or family) with '-based' (meaning 'having as its foundation or main ingredient').","priority":"N/A"},"pronunciation":{"ipa":"/dɪˈsɛntˌbeɪst/","syllables":"de-scent-based"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Descent-based' is used to describe systems, organizations, or claims that rely on a person's lineage or ancestry as the primary factor. It is often contrasted with systems based on achievement, merit, or other criteria. The term is commonly used in anthropology, sociology, and legal contexts.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The decision was decent-based.","correct":"✓ The decision was descent-based.","note":"'Decent' means respectable or appropriate, while 'descent' refers to ancestry or lineage. Ensure the correct spelling is used to convey the intended meaning."}],"priority":"N/A"},"related_words":{"derivatives":["descent (noun)","based (adjective)"],"related_terms":["lineage","ancestry","genealogy","kinship","heredity"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Descent-based' is a term used to describe something that is based on a person's family history or ancestry. It is often used in academic or formal contexts when discussing social structures, inheritance, or legal claims. Understanding this term requires familiarity with concepts related to genealogy and social organization."},"example_sentences":[{"sentence":"The kingdom's succession was determined by a descent-based system, ensuring that only members of the royal family could inherit the throne.","translation":"王国の王位継承は血統に基づくシステムによって決定され、王室のメンバーのみが王位を継承できるようになっていました。","type":"adjective","meaning_category":"血統に基づいた"},{"sentence":"Many traditional societies have descent-based rules for property ownership.","translation":"多くの伝統的な社会では、財産所有に関する血統に基づく規則があります。","type":"adjective","meaning_category":"系統に基づいた"}]}