{"word":"Psychidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ミノガ科（の蛾）","english_definition":"The family of bagworm moths.","examples":[{"sentence":"The Psychidae are known for the larval habit of living in silken cases covered with soil, sand, lichen, or other materials.","translation":"ミノガ科は、幼虫が土、砂、地衣類、またはその他の材料で覆われた絹のケースに住む習性で知られています。"}],"collocations":["bagworm moth","case moth"],"synonyms":["bagworm","case moth"],"antonyms":[]}],"etymology":{"value":"From the genus name *Psyche*, referring to the mythological figure Psyche, often depicted as a butterfly or moth, + *-idae*, a standard suffix used to form the names of zoological families.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsaɪkɪdiː/","syllables":"Psy-chi-dae"},"inflection":{"noun_plural":"Psychidae (used as a collective plural)"},"usage_notes":{"explanation":"*Psychidae* refers to the entire family of bagworm moths. The term is most often used in scientific or technical contexts. When referring to a single moth, one might say \"a psychid moth\" or \"a bagworm moth\".","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Psychidae in my garden.","correct":"✓ I saw a psychid moth in my garden. / ✓ I saw a bagworm moth in my garden.","note":"'Psychidae' is the family name. To refer to a single moth, use 'psychid moth' or 'bagworm moth'."}],"priority":"★☆☆"},"related_words":{"derivatives":["psychid (adjective, relating to Psychidae; noun, a moth of the Psychidae family)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Psychidae' is a scientific term referring to a specific family of moths, commonly known as bagworm moths. Understanding this term requires familiarity with biological classification and entomology. It is unlikely to be encountered outside of specialized contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The larvae of many Psychidae species construct elaborate protective cases.","translation":"多くのミノガ科の種の幼虫は、精巧な保護ケースを構築します。","type":"noun","meaning_category":"ミノガ科"},{"sentence":"Damage to trees is often caused by feeding Psychidae larvae.","translation":"樹木への被害は、多くの場合、ミノガ科の幼虫の摂食によって引き起こされます。","type":"noun","meaning_category":"ミノガ科"}]}