{"word":"parti-decorated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"部分的に装飾された、一部装飾が施された","english_definition":"Decorated in parts; having some decoration but not fully decorated.","examples":[{"sentence":"The room was parti-decorated for the event, with streamers in some areas but not others.","translation":"部屋はイベントのために部分的に装飾され、一部のエリアには飾り紐が施されていたが、他のエリアにはなかった。"},{"sentence":"The cake was parti-decorated, with frosting only on half of it.","translation":"ケーキは部分的に装飾され、半分だけにフロスティングが施されていた。"}],"collocations":["parti-decorated room","parti-decorated cake","parti-decorated wall"],"synonyms":["partially decorated","semi-decorated","partly ornamented"],"antonyms":["fully decorated","completely ornamented","over-decorated"]}],"etymology":{"value":"The word is formed by combining 'parti-' (meaning 'partly' or 'partially') with 'decorated' (meaning 'having decoration').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɑːrti ˈdɛkəˌreɪtɪd/","syllables":"par-ti-dec-o-rat-ed"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms by adding 'more' and 'most' before them, respectively (e.g., 'more parti-decorated')."},"usage_notes":{"explanation":"The term 'parti-decorated' is used to describe something that has decoration only in some areas or parts, rather than being fully or completely decorated. It implies an incomplete or selective application of decoration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The parti-decorated room was completely bare.","correct":"✓ The parti-decorated room had some decorations but was not fully decorated.","note":"'Parti-decorated' implies the presence of some decoration, so it cannot be completely bare."}],"priority":"★★☆"},"related_words":{"derivatives":["parti (adjective: divided into parts or sections)","decorate (verb: to adorn or embellish)","decoration (noun: something used to adorn or embellish)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency - not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Parti-decorated' is a relatively uncommon term used to describe something that is only partially decorated. It is formed by combining 'parti-' (meaning 'partly') with 'decorated'. This term is typically used in descriptive contexts where it is important to specify that the decoration is not complete or uniform. Understanding this term requires a good grasp of vocabulary related to decoration and the meaning of prefixes like 'parti-'."},"example_sentences":[{"sentence":"The set was parti-decorated to give the impression of a lived-in but unfinished space.","translation":"セットは、生活感がありながらも未完成な空間の印象を与えるために、部分的に装飾されていた。","type":"adjective","meaning_category":"partially decorated"},{"sentence":"The artist created a parti-decorated effect by leaving sections of the canvas unpainted.","translation":"アーティストは、キャンバスの一部を塗らずに残すことで、部分的に装飾された効果を生み出した。","type":"adjective","meaning_category":"partially decorated"}]}