{"word":"fustet","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A southern European shrub or small tree (Cotinus coggygria) with plume-like flower clusters and leaves that yield a yellow dye.","english_definition":"A shrub or small tree (Cotinus coggygria) native to southern Europe and Asia, cultivated for its plume-like flower clusters and foliage that yields a yellow dye.","examples":[{"sentence":"The fustet tree added a splash of color to the garden with its vibrant foliage.","translation":"フステットの木は、鮮やかな葉で庭に彩りを添えました。"}],"collocations":["fustet wood","fustet dye","cultivate fustet"],"synonyms":["smoke tree","Cotinus coggygria"],"antonyms":[]}],"etymology":{"value":"From the Old French word 'fustet', which referred to the plant and the dye derived from it.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfʌstɛt/","syllables":"fus-tet"},"inflection":{"noun_plural":"fustets"},"usage_notes":{"explanation":"'Fustet' is primarily used in botanical or historical contexts when discussing natural dyes. It is not a commonly used word.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["fustic (related yellow dye from a different plant)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'fustet' is a relatively obscure term referring to a specific plant species (Cotinus coggygria) and the dye derived from it. It is unlikely to be encountered outside of specialized botanical or historical texts. Understanding requires a high level of vocabulary and familiarity with niche topics."},"example_sentences":[{"sentence":"Historically, fustet was an important source of yellow dye for textiles.","translation":"歴史的に、フステットは織物の黄色染料の重要な供給源でした。","type":"noun","meaning_category":"plant/dye"},{"sentence":"The leaves of the fustet tree turn a brilliant red in the autumn.","translation":"フステットの木の葉は秋には鮮やかな赤色に変わります。","type":"noun","meaning_category":"plant"}]}