{"word":"wasteway","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"余水路、放水路、排水路","english_definition":"A channel or passage for carrying off excess water, especially from a canal, reservoir, or irrigation system.","examples":[{"sentence":"The wasteway was designed to prevent flooding during periods of heavy rainfall.","translation":"その余水路は、大雨の期間中の洪水を防ぐように設計されました。"},{"sentence":"Excess water from the reservoir is released through the wasteway.","translation":"貯水池からの余分な水は、放水路を通して放出されます。"},{"sentence":"The wasteway diverts water from the canal to the river.","translation":"その排水路は、運河から川へと水をそらします。"}],"collocations":["wasteway channel","wasteway gate","wasteway structure","discharge into wasteway"],"synonyms":["spillway","overflow","drain","sluice","channel"],"antonyms":["intake","supply channel"],"notes":"Wasteways are often engineered structures used in water management systems. They are crucial for controlling water levels and preventing damage to infrastructure."}],"etymology":{"value":"Derived from 'waste' (unwanted excess) + 'way' (channel, passage).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈweɪstˌweɪ/","syllables":"waste-way"},"inflection":{"noun_plural":"wasteways"},"usage_notes":{"explanation":"'Wasteway' specifically refers to a channel designed to carry away excess water, often to prevent flooding or damage to water management systems. It is commonly used in the context of canals, reservoirs, dams, and irrigation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The wasteway was used to transport drinking water.","correct":"✓ The wasteway was used to divert excess water.","note":"Wasteways are for carrying away excess water, not for transporting drinking water. Drinking water is transported through aqueducts or pipelines."},{"incorrect":"✗ The wasteway was blocked with sediment.","correct":"✓ The wasteway was clogged with sediment.","note":"'Clogged' is a more common and natural word choice when describing a blockage in a channel or pipe."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["spillway","drainage","irrigation","canal","reservoir","dam"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'wasteway' is a technical term primarily used in the context of water management and civil engineering. It refers to a channel designed to carry away excess water from a reservoir, canal, or other water body. Understanding this word requires some familiarity with water systems and infrastructure. It's not a common word in everyday conversation."},"example_sentences":[{"sentence":"The dam's wasteway is essential for managing water levels during the rainy season.","translation":"ダムの余水路は、雨季中の水位を管理するために不可欠です。","type":"noun","meaning_category":"余水路"},{"sentence":"Engineers inspected the wasteway for any signs of erosion or structural damage.","translation":"エンジニアは、浸食や構造的損傷の兆候がないか余水路を検査しました。","type":"noun","meaning_category":"放水路"},{"sentence":"The wasteway helps prevent the canal from overflowing and flooding nearby areas.","translation":"その排水路は、運河が氾濫して近隣地域を浸水させるのを防ぐのに役立ちます。","type":"noun","meaning_category":"排水路"}]}