{"word":"Casuists","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)ケースワーカー、ケーススタディ研究者、詭弁家","english_definition":"(plural) Those who practice or study casuistry; those who resolve cases of conscience by applying general rules of ethics or law; sometimes used pejoratively to refer to those who use subtle or specious reasoning to justify questionable actions.","examples":[{"sentence":"The casuists debated the morality of the action.","translation":"ケースワーカーたちはその行為の道徳性について議論した。"},{"sentence":"Some critics accused the theologians of being casuists.","translation":"一部の批評家は神学者たちを詭弁家だと非難した。"}],"collocations":["ethical casuists","moral casuists","legal casuists"],"synonyms":["sophists","equivocators","quibblers"],"antonyms":[]}],"etymology":{"value":"From the word 'casuist', which comes from the Latin 'casus' (case) + '-ist' (one who practices or studies).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæʒuɪsts/","syllables":"Ca-su-ists"},"inflection":{"noun_plural":"Casuists"},"usage_notes":{"explanation":"'Casuists' refers to individuals engaged in casuistry, a method of moral reasoning that involves applying general ethical principles to specific cases. The term can be neutral or pejorative, depending on whether the application of principles is seen as legitimate or as a form of sophistry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a casuists.","correct":"✓ He is a casuist.","note":"'Casuists' is the plural form; the singular form is 'casuist'."}],"priority":"★★☆"},"related_words":{"derivatives":["Casuist (singular noun)","Casuistic (adjective)","Casuistically (adverb)","Casuistry (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Casuists' are people who study and apply moral rules to specific situations. They try to figure out what is right or wrong in difficult cases by using general ethical principles. Sometimes, people use the word 'casuists' in a negative way to describe those who use clever but dishonest arguments to justify their actions."},"example_sentences":[{"sentence":"The group of casuists carefully considered the complex ethical dilemma.","translation":"そのケースワーカーのグループは、複雑な倫理的ジレンマを注意深く検討した。","type":"noun","meaning_category":"ケースワーカー"},{"sentence":"The article criticized the lawyers as casuists for twisting the law to suit their clients.","translation":"その記事は、弁護士たちが依頼人に合わせて法律をねじ曲げているとして、彼らを詭弁家だと批判した。","type":"noun","meaning_category":"詭弁家"}]}