{"word":"anti-Westerner","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"反欧米主義者、反西洋主義者","english_definition":"A person who opposes or is hostile to Western culture, values, or political systems.","examples":[{"sentence":"Some see him as an anti-Westerner due to his criticisms of American foreign policy.","translation":"彼のアメリカの外交政策に対する批判から、彼を反欧米主義者と見る人もいる。"},{"sentence":"The group is comprised of staunch anti-Westerners who advocate for a return to traditional values.","translation":"そのグループは、伝統的な価値観への回帰を主張する断固たる反欧米主義者で構成されている。"}],"collocations":["staunch anti-Westerner (断固たる反欧米主義者)","radical anti-Westerner (急進的な反欧米主義者)","vocal anti-Westerner (声高な反欧米主義者)"],"synonyms":["anti-Western","anti-globalist","traditionalist","nativist"],"antonyms":["Westernizer","pro-Western","globalist","modernist"]}],"etymology":{"value":"The term is formed by combining \"anti-\" (meaning against or opposed to) with \"Westerner\" (a person from the Western world, typically Europe and North America).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈwɛstərnər/","syllables":"an-ti-West-er-ner"},"inflection":{"noun_plural":"anti-Westerners"},"usage_notes":{"explanation":"The term \"anti-Westerner\" is often used in political and cultural contexts to describe individuals or groups who are critical of or opposed to Western values, such as individualism, democracy, capitalism, and secularism. It can also refer to those who oppose Western cultural influence or political dominance. The term can be pejorative, depending on the context and the speaker's perspective.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a anti-westerner.","correct":"✓ He is an anti-Westerner.","note":"Since \"anti-\" is pronounced with a vowel sound at the beginning, use the indefinite article \"an\" instead of \"a\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["anti-Western (adjective)","Westernization (noun)","Westernism (noun)"],"phrases":["anti-Western sentiment","anti-Western propaganda"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, used in specific political and academic discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"anti-Westerner\" refers to someone who is against Western culture, values, or political systems. It's often used in discussions about global politics, cultural conflicts, and the impact of Western influence on other parts of the world. Understanding this term requires a good grasp of political and cultural concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The politician was labeled an **anti-Westerner** after criticizing the United States' foreign policy.","translation":"その政治家は、アメリカの外交政策を批判した後、反欧米主義者というレッテルを貼られた。","type":"noun","meaning_category":"反欧米主義者"},{"sentence":"Many **anti-Westerners** believe that globalization is a form of cultural imperialism.","translation":"多くの反欧米主義者は、グローバリゼーションは文化帝国主義の一形態であると考えている。","type":"noun","meaning_category":"反欧米主義者"}]}