{"word":"telespectroscope","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"天体望遠鏡分光器：天体望遠鏡に取り付けて、天体の光をスペクトルに分解して観測・分析する装置。","english_definition":"An instrument attached to a telescope for producing and examining the spectra of celestial objects.","examples":[{"sentence":"The astronomer used a telespectroscope to analyze the light from distant stars.","translation":"天文学者は、遠い星からの光を分析するために天体望遠鏡分光器を使用した。"},{"sentence":"By using a telespectroscope, scientists can determine the chemical composition of stars.","translation":"天体望遠鏡分光器を使用することで、科学者は星の化学組成を決定できる。"}],"collocations":["attach a telespectroscope (天体望遠鏡分光器を取り付ける)","use a telespectroscope (天体望遠鏡分光器を使用する)","analyze with a telespectroscope (天体望遠鏡分光器で分析する)"],"synonyms":["spectroscope","spectrograph"],"antonyms":[]}],"etymology":{"value":"\"telescope\"（望遠鏡）と \"spectroscope\"（分光器）の合成語。","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɛlɪˈspɛktrəˌskoʊp/","syllables":"te-le-spec-tro-scope"},"inflection":{"noun_plural":"telespectroscopes"},"usage_notes":{"explanation":"A telespectroscope combines the light-gathering power of a telescope with the spectral analysis capabilities of a spectroscope. It allows astronomers to study the composition, temperature, density, and velocity of celestial objects by analyzing the light they emit or absorb.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ telespectroscope is a type of telescope.","correct":"✓ A telespectroscope is an instrument attached to a telescope.","note":"A telespectroscope is not a type of telescope itself but an instrument used with a telescope."}],"priority":"★★☆"},"related_words":{"derivatives":["telescopic","spectroscopic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'telespectroscope' refers to a specialized scientific instrument used in astronomy. It combines a telescope, which gathers light from distant objects, with a spectroscope, which separates that light into its component colors (a spectrum). By analyzing this spectrum, scientists can determine the chemical composition, temperature, and other properties of the object. This term is primarily encountered in scientific contexts related to astronomy and astrophysics."},"example_sentences":[{"sentence":"The telespectroscope revealed the presence of helium in the distant nebula.","translation":"その天体望遠鏡分光器は、遠い星雲の中にヘリウムが存在することを示した。","type":"general","meaning_category":"scientific analysis"},{"sentence":"Using a high-resolution telespectroscope, they were able to measure the star's radial velocity.","translation":"高解像度の天体望遠鏡分光器を使用して、彼らはその星の視線速度を測定することができた。","type":"technical","meaning_category":"astronomy"}]}