{"word":"Triquetral","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"手根骨の一つで、小指側にある豆状骨、有頭骨、有鈎骨に隣接する骨","english_definition":"A carpal bone located on the ulnar side of the wrist, articulating with the lunate, pisiform, and hamate bones.","examples":[{"sentence":"The triquetral bone is one of the eight carpal bones in the wrist.","translation":"三角骨は手首にある8つの手根骨のうちの1つです。"},{"sentence":"A fracture of the triquetral bone can occur from a fall onto an outstretched hand.","translation":"三角骨の骨折は、手を伸ばした状態での転倒によって起こることがあります。"}],"collocations":["triquetral fracture","triquetral ligament","carpal bones","wrist anatomy"],"synonyms":["cuneiform (historical)"],"antonyms":[]},{"part_of_speech":"adjective","definition":"三角骨に関する、三角骨の","english_definition":"Relating to or located in the region of the triquetral bone.","examples":[{"sentence":"The patient experienced pain in the triquetral region of the wrist.","translation":"患者は手首の三角骨領域に痛みを感じました。"},{"sentence":"Triquetral injuries are often associated with other carpal bone fractures.","translation":"三角骨の損傷は、他の手根骨骨折と関連していることが多いです。"}],"collocations":["triquetral region","triquetral injury","triquetral pain"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word \"triquetrus,\" meaning \"three-cornered\" or \"triangular,\" referring to the bone's shape.","priority":"★★☆"},"pronunciation":{"ipa":"/traɪˈkwɛtrəl/","syllables":"tri-quet-ral"},"inflection":{"noun_plural":"triquetrals"},"usage_notes":{"explanation":"The term \"triquetral\" is primarily used in medical and anatomical contexts to refer to the carpal bone in the wrist. It is important to use this term accurately in medical documentation and discussions. The bone is also historically known as the \"cuneiform\" bone, but \"triquetral\" is the preferred modern term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bone is triquetrum.","correct":"✓ The bone is triquetral.","note":"\"Triquetral\" is the correct adjective and noun form. \"Triquetrum\" is not commonly used."},{"incorrect":"✗ The triquetral bone is in the ankle.","correct":"✓ The triquetral bone is in the wrist.","note":"The triquetral bone is located in the wrist, not the ankle."}],"priority":"★★☆"},"related_words":{"derivatives":["triquetrally"],"phrasal_verbs":[],"related_terms":["carpal","lunate","pisiform","hamate","ulna","radius","wrist","bone","fracture","anatomy","orthopedics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized medical vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"triquetral\" is a specialized term used in anatomy and medicine to refer to a specific bone in the wrist. Understanding this term requires knowledge of human anatomy, particularly the structure of the carpal bones. It is not a commonly used word outside of these specialized fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor examined the patient's wrist for signs of a triquetral fracture.","translation":"医師は患者の手首を診察し、三角骨骨折の兆候がないか確認しました。","type":"noun","meaning_category":"Anatomy"},{"sentence":"Triquetral ligament injuries can cause chronic wrist pain.","translation":"三角骨靭帯の損傷は、慢性的な手首の痛みを引き起こす可能性があります。","type":"adjective","meaning_category":"Anatomy"},{"sentence":"The triquetral bone articulates with the lunate and pisiform bones.","translation":"三角骨は月状骨および豆状骨と関節しています。","type":"noun","meaning_category":"Anatomy"}]}