{"word":"redissolve","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再溶解する、再び溶かす","english_definition":"To dissolve again; to dissolve something that has previously been dissolved and then precipitated or solidified.","examples":[{"sentence":"The precipitate was redissolved in dilute acid.","translation":"その沈殿物は希酸に再溶解された。"},{"sentence":"To purify the compound, it was dissolved, precipitated, and then redissolved.","translation":"その化合物を精製するために、溶解、沈殿させ、その後再溶解した。"}],"collocations":["redissolve a precipitate","redissolve in acid","redissolve in water"],"synonyms":["dissolve again"],"antonyms":["precipitate","solidify"]}],"etymology":{"value":"The word 'redissolve' is formed by adding the prefix 're-' (meaning 'again' or 'anew') to the word 'dissolve'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːdɪˈzɒlv/","syllables":"re-dis-solve"},"inflection":{"verb_forms":{"present_simple":["redissolve","redissolves"],"past_simple":"redissolved","past_participle":"redissolved","present_participle":"redissolving"}},"usage_notes":{"explanation":"'Redissolve' is typically used in scientific or technical contexts, particularly in chemistry and related fields, to describe the process of dissolving a substance that was previously in solution but has since come out of solution through precipitation, evaporation, or another process. It implies a cycle of dissolving, separating, and then dissolving again.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I will re-dissolve the sugar.","correct":"✓ I will redissolve the sugar.","note":"The correct spelling is 'redissolve' (without a hyphen)."},{"incorrect":"✗ The salt was redissolved back into the water.","correct":"✓ The salt was redissolved in the water.","note":"The word 'back' is redundant in this context; 'redissolve' already implies that the substance was previously dissolved."}],"priority":"★★☆"},"related_words":{"derivatives":["redissolution (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'redissolve' is a technical term primarily used in chemistry and related scientific fields. It describes the process of dissolving a substance that was previously dissolved in a solvent, then separated out (e.g., by precipitation or evaporation), and is now being dissolved again in the same or a different solvent. Understanding this word requires familiarity with basic chemical concepts like dissolution, precipitation, and solvents."},"example_sentences":[{"sentence":"After the crystals formed, they were redissolved in a minimal amount of hot solvent.","translation":"結晶が形成された後、それらは最小量の熱い溶媒に再溶解された。","type":"verb","meaning_category":"再溶解する"},{"sentence":"The protein pellet was redissolved in buffer solution for further analysis.","translation":"タンパク質のペレットは、さらなる分析のために緩衝液に再溶解された。","type":"verb","meaning_category":"再溶解する"},{"sentence":"The chemist carefully redissolved the purified compound to ensure its homogeneity.","translation":"化学者は、精製された化合物が均一であることを確認するために、注意深く再溶解した。","type":"verb","meaning_category":"再溶解する"}]}