{"word":"nucleoplasmic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"核質の、核質の特性を持つ","english_definition":"Relating to or characteristic of nucleoplasm.","examples":[{"sentence":"The nucleoplasmic proteins are involved in DNA replication.","translation":"核質タンパク質はDNA複製に関与している。"},{"sentence":"Nucleoplasmic viscosity affects the movement of molecules within the nucleus.","translation":"核質の粘性は、核内の分子の動きに影響を与える。"}],"collocations":["nucleoplasmic proteins","nucleoplasmic viscosity","nucleoplasmic transport"],"synonyms":["nuclear","karyoplasmic"],"antonyms":["cytoplasmic"],"notes":"Used primarily in the context of cell biology and biochemistry."}],"etymology":{"value":"Formed from the combination of 'nucleo-' (referring to the nucleus) and 'plasmic' (referring to protoplasm or plasma).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnjuːkliəˈplæzmɪk/","syllables":"nu-cle-o-plas-mic"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'nucleoplasmic' is used to describe anything that is related to or found within the nucleoplasm, which is the fluid substance within the cell nucleus. It is often used in scientific literature to specify the location or properties of molecules and processes within the nucleus.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nucleoplasmic is important for cell division.","correct":"✓ The nucleoplasm is important for cell division.","note":"'Nucleoplasmic' is an adjective, so it needs to modify a noun. 'Nucleoplasm' is the noun referring to the substance itself."}],"priority":"★★☆"},"related_words":{"derivatives":["nucleoplasm (noun): The fluid substance within the cell nucleus, containing chromatin and other nuclear components."],"related_terms":["nucleus","cytoplasm","karyoplasm"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific and technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'nucleoplasmic' is a technical term used in cell biology and biochemistry. It describes something related to the nucleoplasm, which is the fluid inside the cell nucleus. Understanding this term requires a basic knowledge of cell structure and function."},"example_sentences":[{"sentence":"The nucleoplasmic reticulum plays a role in calcium storage within the nucleus.","translation":"核質網は、核内のカルシウム貯蔵において役割を果たす。","type":"general","meaning_category":"Location and function within the cell nucleus."},{"sentence":"The distribution of nucleoplasmic factors changes during the cell cycle.","translation":"細胞周期中に核質因子の分布は変化する。","type":"general","meaning_category":"Changes in the nucleus during cell processes."}]}