{"word":"Pro-cathedralist","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A supporter of the establishment or maintenance of a pro-cathedral.","english_definition":"A person who supports or advocates for the establishment or maintenance of a pro-cathedral.","examples":[{"sentence":"The pro-cathedralists argued that the new church would serve the community better than the old one.","translation":"仮司教座聖堂支持者たちは、新しい教会は古い教会よりも地域社会により良い奉仕をすると主張した。"},{"sentence":"The bishop relied on the pro-cathedralists to raise funds for the construction project.","translation":"司教は建設プロジェクトのための資金調達を仮司教座聖堂支持者たちに頼った。"}],"collocations":["strong pro-cathedralist","devout pro-cathedralist","local pro-cathedralist"],"synonyms":["pro-cathedral advocate","pro-cathedral supporter"],"antonyms":["anti-pro-cathedralist","pro-cathedral opponent"]},{"part_of_speech":"adjective","definition":"Supporting or advocating for the establishment or maintenance of a pro-cathedral.","english_definition":"Relating to or characteristic of support for the establishment or maintenance of a pro-cathedral.","examples":[{"sentence":"The pro-cathedralist movement gained momentum in the early 20th century.","translation":"仮司教座聖堂支持運動は20世紀初頭に勢いを増した。"},{"sentence":"The newspaper published a pro-cathedralist editorial.","translation":"その新聞は仮司教座聖堂支持の社説を掲載した。"}],"collocations":["pro-cathedralist views","pro-cathedralist policies","pro-cathedralist arguments"],"synonyms":["pro-pro-cathedral","supportive of pro-cathedrals"],"antonyms":["anti-pro-cathedralist","opposed to pro-cathedrals"]}],"etymology":{"value":"Derived from \"pro-cathedral\" (a church temporarily serving as a cathedral) with the suffix \"-ist\" (denoting a supporter or believer).","priority":"Medium"},"pronunciation":{"ipa":"/ˌproʊ kəˈθiːdrəlɪst/","syllables":"Pro-ca-the-dra-list"},"inflection":{"noun_plural":"pro-cathedralists"},"usage_notes":{"explanation":"The term \"pro-cathedralist\" is relatively rare and specific, referring to individuals or groups who actively support the establishment or maintenance of a pro-cathedral, which is a church that serves as a temporary or secondary cathedral.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"procathedralist","correct":"Pro-cathedralist","note":"The term is usually written with a hyphen to clearly separate \"pro\" from \"cathedralist\"."}],"priority":"Low"},"related_words":{"derivatives":["pro-cathedral","cathedral","diocese"],"related_concepts":["ecclesiastical architecture","religious administration"]},"level_frequency":{"frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"The term \"Pro-cathedralist\" is highly specialized and would primarily be encountered in contexts related to religious architecture, church administration, or historical discussions of ecclesiastical structures. Understanding requires familiarity with the concept of a \"pro-cathedral\" and the suffix \"-ist\" indicating support or advocacy."},"example_sentences":[{"sentence":"As a dedicated pro-cathedralist, she volunteered countless hours to the church's upkeep.","translation":"熱心な仮司教座聖堂支持者として、彼女は教会の維持のために数えきれないほどの時間をボランティアで費やした。","type":"noun","meaning_category":"Supporter of Pro-Cathedral"},{"sentence":"The pro-cathedralist faction within the diocese pushed for the renovation of the historic building.","translation":"教区内の仮司教座聖堂支持派は、歴史的建造物の改修を推進した。","type":"adjective","meaning_category":"Supporting Pro-Cathedral"}]}