{"word":"Pistillody","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The abnormal development of stamens, petals, or other floral parts into pistil-like structures.","english_definition":"The transformation of other floral organs into pistils.","examples":[{"sentence":"Pistillody can be observed in some varieties of roses.","translation":"雌ずい化はバラのいくつかの品種で見られることがある。"},{"sentence":"The study investigated the genetic factors leading to pistillody in Arabidopsis.","translation":"その研究は、シロイヌナズナにおける雌ずい化を引き起こす遺伝的要因を調査した。"}],"collocations":["floral pistillody","stamen pistillody"],"synonyms":["carpellody"],"antonyms":[]}],"etymology":{"value":"From 'pistil' (the female reproductive organ of a flower) and '-ody' (denoting resemblance or transformation).","priority":"★★★"},"pronunciation":{"ipa":"/pɪˈstɪlədi/","syllables":"pi-stil-lo-dy"},"inflection":{"noun_plural":"pistillodies"},"usage_notes":{"explanation":"Pistillody is a botanical term referring to the transformation of other floral organs, such as stamens or petals, into pistil-like structures. This is often due to genetic or environmental factors affecting floral development.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The flower showed pistillody of the leaves.","correct":"✓ The flower showed pistillody of the stamens.","note":"Pistillody specifically refers to the transformation of floral organs, not leaves, into pistil-like structures."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["stamen","pistil","petal","floral organ","carpel"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pistillody' is a specialized botanical term used to describe the transformation of floral organs into pistil-like structures. It is primarily encountered in scientific literature related to botany, plant morphology, and genetics. Understanding this term requires a background in plant biology."},"example_sentences":[{"sentence":"The plant exhibited complete pistillody, with all stamens converted into pistils.","translation":"その植物は完全な雌ずい化を示し、すべての雄しべが雌しべに変換されていた。","type":"scientific","meaning_category":"transformation of floral organs"},{"sentence":"Researchers are studying the molecular mechanisms underlying pistillody in crop plants.","translation":"研究者たちは、作物における雌ずい化の分子メカニズムを研究している。","type":"scientific","meaning_category":"genetic abnormality"}]}