{"word":"Leptite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"縞状構造を持つ変成岩の一種で、主に長石と石英から構成される。","english_definition":"A type of metamorphic rock with a banded structure, composed mainly of feldspar and quartz.","examples":[{"sentence":"The geology of the area is characterized by the presence of leptite.","translation":"その地域の地質は、レプタイトの存在によって特徴づけられる。"},{"sentence":"Leptite is often used in the construction of buildings and roads.","translation":"レプタイトは、しばしば建物や道路の建設に使用される。"}],"collocations":["leptite formation","leptite deposit","leptite quarry"],"synonyms":["felsite gneiss","quartz-feldspar gneiss"],"antonyms":[]}],"etymology":{"value":"スウェーデン語の 'leptit' に由来し、ギリシャ語の 'leptos' ( λεπτός )「細かい、薄い」から派生。これは、この岩石の細粒構造を指している。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛptaɪt/","syllables":"lep-tite"},"inflection":{"noun_plural":"leptites"},"usage_notes":{"explanation":"Leptite is a metamorphic rock, often fine-grained and banded. It's primarily composed of quartz and feldspar, and its name reflects its fine-grained nature. It's a geological term, not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was made of leptite rock.","correct":"✓ The building was constructed from leptite.","note":"'Made of' is used when referring to the substance the object is composed of, while 'constructed from' is used when referring to the material used in the building process."}],"priority":"★☆☆"},"related_words":{"derivatives":["leptitic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 地質学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Leptite' is a specialized geological term referring to a type of metamorphic rock characterized by its fine-grained, banded structure and composition primarily of feldspar and quartz. Due to its specific usage within geology, it is not commonly encountered in general language contexts. Understanding requires knowledge of basic geological concepts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The leptite samples were analyzed to determine their mineral composition.","translation":"レプタイトのサンプルを分析して、鉱物組成を決定した。","type":"noun","meaning_category":"変成岩"},{"sentence":"The area is known for its unique leptite formations.","translation":"その地域は独特なレプタイトの地層で知られている。","type":"noun","meaning_category":"変成岩"}]}