{"word":"implicature","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"含意、言外の意味、行間を読むこと","english_definition":"something which is implied though not plainly expressed (in language).","examples":[{"sentence":"His silence carried an implicature of disapproval.","translation":"彼の沈黙は、不承認の含意を含んでいた。"},{"sentence":"The speaker relied on implicature to convey his message subtly.","translation":"話し手は、メッセージを微妙に伝えるために含意に頼った。"},{"sentence":"Understanding implicature is crucial for effective communication.","translation":"含意を理解することは、効果的なコミュニケーションに不可欠である。"}],"collocations":["conversational implicature (会話の含意)","scalar implicature (スカラー含意)","conventional implicature (慣習的含意)","derive an implicature (含意を引き出す)","generate an implicature (含意を生み出す)","cancel an implicature (含意を取り消す)"],"synonyms":["suggestion","insinuation","hint","undertone","implication","connotation","hidden meaning"],"antonyms":["explicitness","direct statement","overt meaning","literal meaning"]},{"part_of_speech":"noun","definition":"(言語学で) 発話者が発話を通して伝えようとする意味のうち、文字通りの意味を超えた部分","english_definition":"(in linguistics) what is suggested in an utterance, even though neither expressed nor strictly implied; the unstated meaning.","examples":[{"sentence":"The theory of implicature explains how we understand more than what is literally said.","translation":"含意の理論は、私たちが文字通りに言われたこと以上のことをどのように理解するかを説明する。"},{"sentence":"Grice's theory of implicature is fundamental to pragmatics.","translation":"グライスの含意の理論は、語用論の基礎である。"},{"sentence":"Implicature allows for efficient communication by avoiding unnecessary details.","translation":"含意は、不必要な詳細を避けることによって効率的なコミュニケーションを可能にする。"}],"collocations":["Gricean implicature (グライスの含意)","flout a maxim to create an implicature (含意を作り出すために公理を破る)","calculate an implicature (含意を計算する)","recover an implicature (含意を回復する)","contextual implicature (文脈的含意)"],"synonyms":["unstated meaning","implied meaning","pragmatic meaning","inferred meaning","non-literal meaning"],"antonyms":["literal meaning","explicit meaning","denotation"]}],"etymology":{"value":"The word \"implicature\" was coined by the philosopher Paul Grice in his work on pragmatics. It is derived from the verb \"implicate,\" which comes from the Latin \"implicare,\" meaning \"to enfold, involve, entangle.\" The suffix \"-ure\" is added to form a noun.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪmplɪkətʃər/","syllables":"im-pli-ca-ture"},"inflection":{"noun_plural":"implicatures"},"usage_notes":{"explanation":"\"Implicature\" refers to what is suggested or implied by a speaker, as opposed to what is explicitly stated. It is a key concept in pragmatics, the study of how context contributes to meaning. Understanding implicature requires considering the speaker's intentions, the context of the conversation, and shared knowledge between the speaker and listener. It is often used to convey subtle messages, avoid directness, or add layers of meaning to communication.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The implicature was explicit in his statement.","correct":"✓ The implication was explicit in his statement. / ✓ The implicature was subtle in his statement.","note":"\"Implicature\" refers to implied meaning, so it cannot be explicit. If the meaning is explicit, use \"implication\" instead. If you want to emphasize that the implicature is not obvious, use \"subtle.\""},{"incorrect":"✗ He made an implicature to the crime.","correct":"✓ He made an implication about the crime.","note":"\"Implicature\" is about the implied meaning in communication, not about being involved in something. Use \"implication\" for being involved or suggesting involvement."},{"incorrect":"✗ She understood the literal meaning but missed the implicature.","correct":"✓ She understood the literal meaning but missed the implicature.","note":"This sentence is correct. It highlights the difference between understanding the literal meaning and grasping the implied meaning (implicature)."}],"priority":"★★☆"},"related_words":{"derivatives":["implicate (verb)","implication (noun)","implicit (adjective)","explicit (adjective)","pragmatics (noun)"],"phrases":["conversational implicature","scalar implicature","conventional implicature","flouting a maxim"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Implicature\" is a technical term used in linguistics, particularly in the field of pragmatics. It refers to what a speaker implies or suggests in their utterance, which goes beyond the literal meaning of the words used. Understanding implicature requires considering the context, the speaker's intentions, and the shared knowledge between the speaker and listener. This concept is often discussed in academic settings and is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"By saying he was 'busy', he created an **implicature** that he didn't want to come.","translation":"彼は「忙しい」と言うことで、来たくないという含意を作り出した。","type":"noun","meaning_category":"言外の意味"},{"sentence":"The **implicature** of her statement was that she disagreed with the proposal.","translation":"彼女の発言の含意は、彼女がその提案に反対しているということだった。","type":"noun","meaning_category":"含意"},{"sentence":"To fully grasp the message, you need to understand the **implicature** behind his words.","translation":"メッセージを完全に理解するには、彼の言葉の背後にある含意を理解する必要がある。","type":"noun","meaning_category":"言外の意味"},{"sentence":"The lawyer skillfully used **implicature** to cast doubt on the witness's testimony.","translation":"弁護士は巧みに含意を使って、証人の証言に疑念を投げかけた。","type":"noun","meaning_category":"言外の意味"},{"sentence":"Her seemingly innocent question carried a strong **implicature**.","translation":"彼女の何気ない質問は、強い含意を含んでいた。","type":"noun","meaning_category":"言外の意味"}]}