{"word":"Porge","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Star Wars) A bird-like creature native to the planet Ahch-To, featured in Star Wars: The Last Jedi.","english_definition":"A bird-like creature native to the planet Ahch-To, featured in Star Wars: The Last Jedi.","examples":[{"sentence":"The porgs on Ahch-To were quite curious about Rey.","translation":"惑星アク＝トにいるポーグたちはレイのことをとても知りたがっていた。"},{"sentence":"Many fans found the porgs to be adorable.","translation":"多くのファンはポーグを愛らしいと思った。"}],"collocations":["Porglet (baby porg)","Ahch-To (planet of origin)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Likely a newly coined word for the Star Wars universe.","priority":"★☆☆"},"pronunciation":{"ipa":"/pɔːrdʒ/","syllables":"Porge"},"inflection":{"noun_plural":"Porgs"},"usage_notes":{"explanation":"'Porge' is a proper noun referring to a specific fictional species within the Star Wars universe. It is primarily used by fans of the franchise when discussing the creatures or the movie 'The Last Jedi'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a porge in my backyard.","correct":"✓ I saw a bird in my backyard.","note":"Porgs are fictional and do not exist in the real world."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency outside of Star Wars contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Porge' is a highly specific term related to the Star Wars universe. Understanding and use of this word requires familiarity with the film 'Star Wars: The Last Jedi' and related fandom. It is not part of general English vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **porge** became an instant meme after the release of 'The Last Jedi'.","translation":"『最後のジェダイ』の公開後、ポーグはすぐにミームになった。","type":"noun","meaning_category":"creature"},{"sentence":"Chewbacca's interaction with the **porgs** is a memorable part of the film.","translation":"チューバッカとポーグの交流は、映画の記憶に残る部分だ。","type":"noun","meaning_category":"creature"}]}