{"word":"secta","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(スペイン語・ポルトガル語)宗派、分派、セクト","english_definition":"(Spanish/Portuguese) sect; a group of people with somewhat different religious beliefs (typically regarded as heretical) from those of a larger religion to which they belong.","examples":[{"sentence":"La secta fue fundada en el siglo XIX.","translation":"その宗派は19世紀に設立されました。"},{"sentence":"Algunos consideran que es una secta peligrosa.","translation":"危険なセクトだと考える人もいます。"}],"collocations":["secta religiosa (宗教宗派)","secta secreta (秘密結社)"],"synonyms":["facción","grupo","partido","escuela","herejía"],"antonyms":["religión principal","ortodoxia"],"related_words":["sectario (sectarian)","sectarismo (sectarianism)"]}],"etymology":{"value":"Del latín 'secta', derivado de 'sequi' (seguir).","priority":"N/A"},"pronunciation":{"ipa":"/ˈsekta/","notes":"Pronunciation varies slightly between Spanish and Portuguese, but the IPA is a general representation."},"inflection":{"notes":"Feminine noun in Spanish and Portuguese. Plural: sectas"},"usage_notes":{"explanation":"'Secta' is used in Spanish and Portuguese similarly to how 'sect' is used in English. It often carries a negative connotation, implying that the group's beliefs are unorthodox or even dangerous.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Es una secta de la iglesia católica.","correct":"Es una secta que se separó de la iglesia católica.","note":"Sects are usually considered separate from the main religion, so it's more accurate to say they separated from it."}],"priority":"N/A"},"level_frequency":{"frequency_google_ngram":"Moderate frequency in Spanish and Portuguese corpora.","priority":"N/A"},"readability_explanation":{"level":"Intermediate","text":"The word 'secta' is commonly used in news articles, academic texts, and general conversations in Spanish and Portuguese when discussing religious or political factions that deviate from mainstream beliefs."},"example_sentences":[{"sentence":"La policía investiga las actividades de la secta.","translation":"警察はそのセクトの活動を捜査している。","type":"general","meaning_category":"宗派"},{"sentence":"El líder de la secta fue arrestado.","translation":"そのセクトの指導者が逮捕された。","type":"general","meaning_category":"宗派"},{"sentence":"La secta tiene creencias muy extrañas.","translation":"そのセクトは非常に奇妙な信念を持っている。","type":"general","meaning_category":"宗派"}]}