{"word":"helioscope","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"太陽望遠鏡、太陽観測器","english_definition":"A telescope specially designed to observe the sun; an instrument for viewing the sun without damage to the eye.","examples":[{"sentence":"The astronomer used a helioscope to safely observe the solar flare.","translation":"天文学者は太陽フレアを安全に観測するために太陽望遠鏡を使用した。"},{"sentence":"Early helioscopes were simple devices that projected an image of the sun onto a screen.","translation":"初期の太陽望遠鏡は、太陽の画像をスクリーンに投影する単純な装置だった。"}],"collocations":["solar helioscope","portable helioscope","helioscope observation"],"synonyms":["solar telescope","sun viewer"],"antonyms":[]}],"etymology":{"value":"From Greek 'helios' (sun) + 'skopeō' (I view).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhiːliəˌskoʊp/","syllables":"he-li-o-scope"},"inflection":{"noun_plural":"helioscopes"},"usage_notes":{"explanation":"A helioscope is a specialized telescope or instrument used for observing the sun. It is designed to reduce the intensity of sunlight to a safe level for viewing, preventing damage to the observer's eyes. Modern helioscopes often incorporate filters and other technologies to enhance the viewing experience and allow for detailed observation of solar phenomena such as sunspots and solar flares.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a telescope to look directly at the sun.","correct":"✓ He used a helioscope to look at the sun safely.","note":"Looking directly at the sun with a regular telescope can cause severe eye damage. A helioscope is specifically designed for safe solar observation."}],"priority":"★☆☆"},"related_words":{"derivatives":["helioscopic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'helioscope' is a technical term primarily used in astronomy. It refers to a specialized telescope designed for safe observation of the sun. Due to its specific application, it is not a common word in everyday language."},"example_sentences":[{"sentence":"The observatory is equipped with a state-of-the-art helioscope.","translation":"その天文台には最新の太陽望遠鏡が備え付けられている。","type":"noun","meaning_category":"太陽望遠鏡"},{"sentence":"Researchers use helioscopes to study the sun's magnetic field.","translation":"研究者たちは太陽の磁場を研究するために太陽望遠鏡を使用する。","type":"noun","meaning_category":"太陽観測器"}]}