{"word":"system-installed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"システムに組み込まれてインストールされている、またはシステムの一部として最初からインストールされている","english_definition":"Installed as part of the operating system or a larger system; pre-installed.","examples":[{"sentence":"This application is system-installed and cannot be uninstalled by the user.","translation":"このアプリケーションはシステムに組み込まれてインストールされているため、ユーザーがアンインストールすることはできません。"},{"sentence":"System-installed fonts are available to all applications.","translation":"システムにインストールされたフォントは、すべてのアプリケーションで使用できます。"},{"sentence":"The device comes with several system-installed utilities.","translation":"このデバイスには、いくつかのシステムにインストールされたユーティリティが付属しています。"}],"collocations":["system-installed application","system-installed font","system-installed utility","system-installed software","system-installed component"],"synonyms":["pre-installed","built-in","integrated","default"],"antonyms":["user-installed","custom-installed","third-party"],"notes":"This term is commonly used in the context of computers, software, and electronic devices."}],"etymology":{"value":"A compound word formed from 'system' (referring to a computer or other operating system) and 'installed' (meaning to set up and make ready for use).","priority":"N/A"},"pronunciation":{"ipa":"/ˈsɪstəm ɪnˈstɔːld/","syllables":"sys-tem in-stalled"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'System-installed' typically describes software or components that are included with a device or operating system by the manufacturer. These items are usually essential for the device's basic functionality or are intended to provide a standard user experience.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The system installed the program.","correct":"✓ The program is system-installed.","note":"'System-installed' is an adjective, not a verb. Use it to describe something, not to describe an action."}],"priority":"N/A"},"related_words":{"derivatives":["system (noun)","install (verb)","installation (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The term 'system-installed' is used to describe software or hardware that is included as part of the initial setup of a device or operating system. It indicates that the software or hardware is not something the user added later but was already present when the device was first used. This term is most often encountered in technical contexts related to computers and electronics."},"example_sentences":[{"sentence":"The operating system includes several system-installed applications for basic tasks.","translation":"オペレーティングシステムには、基本的なタスクのためのいくつかのシステムにインストールされたアプリケーションが含まれています。","type":"adjective","meaning_category":"pre-installed"},{"sentence":"Unlike user-installed programs, system-installed components often have special permissions.","translation":"ユーザーがインストールしたプログラムとは異なり、システムにインストールされたコンポーネントには特別な権限があることがよくあります。","type":"adjective","meaning_category":"pre-installed"},{"sentence":"It's not possible to remove all system-installed software without rooting the device.","translation":"デバイスをルート化せずに、すべてのシステムにインストールされたソフトウェアを削除することはできません。","type":"adjective","meaning_category":"pre-installed"}]}