{"word":"bigender","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"バイジェンダーの、両性具有の","english_definition":"Identifying with or having both male and female genders.","examples":[{"sentence":"A bigender person may experience different gender identities at different times.","translation":"バイジェンダーの人は、異なる時点で異なるジェンダーアイデンティティを経験することがあります。"},{"sentence":"The model identifies as bigender and uses they/them pronouns.","translation":"そのモデルはバイジェンダーであると認識しており、they/themの代名詞を使用しています。"}],"collocations":["bigender identity","bigender person","bigender individual","identify as bigender","self-identify as bigender"],"synonyms":["genderfluid","genderqueer","androgynous"],"antonyms":["cisgender","binary gender"]},{"part_of_speech":"noun","definition":"バイジェンダーの人","english_definition":"A person who identifies with or has both male and female genders.","examples":[{"sentence":"Some bigenders may express both masculine and feminine traits.","translation":"バイジェンダーの人の中には、男性的な特徴と女性的な特徴の両方を表現する人もいます。"},{"sentence":"It's important to respect the pronouns of a bigender individual.","translation":"バイジェンダーの人の代名詞を尊重することが重要です。"}],"collocations":["a bigender person","a bigender individual","bigenders","bigender identity"],"synonyms":["genderfluid person","genderqueer person"],"antonyms":["cisgender person"]}],"etymology":{"value":"The word \"bigender\" is a combination of the prefix \"bi-\" (meaning two) and the word \"gender.\" It emerged in the late 20th century as part of the growing awareness and recognition of diverse gender identities.","priority":"★★☆"},"pronunciation":{"ipa":"/baɪˈdʒɛndər/","syllables":"bi-gen-der"},"inflection":{"notes":"The noun form is countable (bigenders). The adjective form does not change."},"usage_notes":{"explanation":"\"Bigender\" refers to individuals who identify with two genders, typically male and female, but not always simultaneously or consistently. Their gender expression and identity can fluctuate. It's crucial to respect their chosen pronouns and avoid making assumptions about their gender. The term is part of a broader understanding of gender diversity beyond the traditional binary.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Bigender people are hermaphrodites.","correct":"✓ Bigender people have a gender identity that encompasses both male and female genders.","note":"Bigender is a gender identity, while hermaphrodite (now more commonly referred to as intersex) refers to biological variations in sex characteristics."},{"incorrect":"✗ Bigender is the same as transgender.","correct":"✓ Bigender is a type of gender identity that falls under the transgender umbrella for some, but not all, bigender individuals.","note":"Transgender is an umbrella term for people whose gender identity differs from the sex they were assigned at birth. Bigender is a specific gender identity."},{"incorrect":"✗ All bigender people want surgery.","correct":"✓ Some bigender people may choose to undergo gender-affirming surgeries, but it is not a requirement for identifying as bigender.","note":"Gender-affirming care is a personal choice and not a defining characteristic of being bigender."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["gender identity","gender expression","genderfluid","genderqueer","non-binary","transgender","cisgender","gender dysphoria"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, but increasing in usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Bigender\" refers to a gender identity where a person identifies with two genders, often male and female. This identity can be experienced simultaneously or at different times. It's important to use respectful language and pronouns when referring to bigender individuals. The term is part of a broader understanding of gender diversity and is often discussed in the context of LGBTQ+ issues and gender studies."},"example_sentences":[{"sentence":"As a bigender person, Alex uses both he/him and she/her pronouns.","translation":"バイジェンダーであるアレックスは、彼/彼の代名詞と彼女/彼女の代名詞の両方を使用します。","type":"example","meaning_category":"identity"},{"sentence":"The conference included a workshop on understanding bigender identities.","translation":"会議には、バイジェンダーのアイデンティティを理解するためのワークショップが含まれていました。","type":"example","meaning_category":"understanding"},{"sentence":"Some bigender individuals may experience gender dysphoria.","translation":"バイジェンダーの人の中には、性別違和を経験する人もいます。","type":"example","meaning_category":"experience"}]}