{"word":"iconolatrous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"偶像崇拝の、偶像を崇拝する","english_definition":"Given to iconolatry; worshiping or venerating images or icons.","examples":[{"sentence":"The church was accused of being iconolatrous for its elaborate use of religious imagery.","translation":"その教会は、宗教的なイメージを大々的に使用したことで、偶像崇拝的であると非難された。"},{"sentence":"Some critics viewed the film as iconolatrous, given its reverence for past cinematic achievements.","translation":"一部の批評家は、過去の映画の業績に対する敬意から、その映画を偶像崇拝的であると見なした。"}],"collocations":["iconolatrous practices","iconolatrous tendencies","iconolatrous views"],"synonyms":["idol-worshiping","image-worshiping","icon-venerating"],"antonyms":["iconoclastic","anti-iconolatrous"]}],"etymology":{"value":"Derived from 'iconolatry,' which comes from the Greek words 'eikon' (image) and 'latreia' (worship).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaɪkɒnˈɒlətrəs/","syllables":"i-con-ol-a-trous"},"inflection":{"notes":"Adjective; comparative and superlative forms (more iconolatrous, most iconolatrous) exist but are rarely used."},"usage_notes":{"explanation":"'Iconolatrous' describes someone or something characterized by the worship or excessive veneration of images or icons. It often carries a negative connotation, suggesting that the veneration is excessive or misplaced. It is often used in religious or cultural contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an iconolatrous person who destroyed all the icons.","correct":"✓ He was an iconoclastic person who destroyed all the icons.","note":"'Iconolatrous' means worshiping icons, while 'iconoclastic' means destroying or rejecting them."}],"priority":"★★☆"},"related_words":{"derivatives":["iconolatry (noun): the worship of images or icons","iconolater (noun): one who practices iconolatry"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'iconolatrous' is a highly specialized term primarily used in religious studies, art history, and philosophical discussions concerning the role and veneration of images. It describes a tendency or practice of worshiping images or icons, often in a way that is seen as excessive or inappropriate by others. Due to its specific and academic usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The museum's collection showcased a variety of iconolatrous artifacts from ancient civilizations.","translation":"その美術館のコレクションは、古代文明からのさまざまな偶像崇拝的な工芸品を展示していた。","type":"adjective","meaning_category":"worship of images"},{"sentence":"Some scholars argue that certain forms of modern celebrity worship are essentially iconolatrous.","translation":"一部の学者は、現代の有名人崇拝のある形態は本質的に偶像崇拝的であると主張している。","type":"adjective","meaning_category":"veneration of images"}]}