{"word":"bombiccite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of sedimentary rock composed primarily of rounded volcanic fragments (bombs) cemented together.","english_definition":"A sedimentary rock consisting mainly of cemented volcanic bombs.","examples":[{"sentence":"The cliffs were made of bombiccite, a testament to ancient volcanic activity.","translation":"その崖はボンビサイトでできており、古代の火山活動の証であった。"},{"sentence":"The geologist identified the rock sample as bombiccite due to the presence of numerous volcanic bombs.","translation":"地質学者は、多数の火山弾の存在から、その岩石サンプルをボンビサイトと特定した。"}],"collocations":["volcanic bomb","sedimentary rock","volcanic activity","rock formation"],"synonyms":["agglomerate","volcanic breccia"],"antonyms":[]}],"etymology":{"value":"Derived from 'bomb' (referring to volcanic bombs) and the suffix '-iccite' (used in rock nomenclature).","priority":"★★☆"},"pronunciation":{"ipa":"/bɒmˈbɪksaɪt/","syllables":"bom-bic-cite"},"inflection":{"noun_plural":"bombiccites"},"usage_notes":{"explanation":"Bombiccite is a relatively rare type of rock, primarily of interest to geologists and volcanologists. It indicates a specific type of volcanic eruption where large fragments of molten rock were ejected and subsequently cemented together.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bombiccite was very quite.","correct":"✓ The bombiccite was quite interesting.","note":"Do not confuse 'bombiccite' (a rock type) with adverbs or adjectives used to describe it. Also, do not confuse 'quite' and 'quiet'."}],"priority":"★☆☆"},"related_words":{"derivatives":["bomb (volcanic)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bombiccite' is a highly specialized geological term. Understanding requires knowledge of volcanology and sedimentary rock formation. It is not commonly encountered outside of academic or professional contexts related to geology."},"example_sentences":[{"sentence":"The bombiccite formation provided valuable insights into the region's volcanic history.","translation":"そのボンビサイトの地層は、その地域の火山活動の歴史に関する貴重な洞察を提供した。","type":"noun","meaning_category":"geology"},{"sentence":"Analysis of the bombiccite revealed the composition of the magma during the eruption.","translation":"ボンビサイトの分析により、噴火時のマグマの組成が明らかになった。","type":"noun","meaning_category":"geology"}]}