{"word":"unkemptness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"だらしなさ、不潔さ、乱雑さ","english_definition":"the state or quality of being unkempt; disorder; untidiness.","examples":[{"sentence":"The unkemptness of his hair suggested he hadn't slept well.","translation":"彼の髪の乱れは、彼がよく眠れていないことを示唆していた。"},{"sentence":"The unkemptness of the garden was a clear sign that the house was abandoned.","translation":"庭の荒れ具合は、その家が放棄されていることを明確に示していた。"},{"sentence":"She was shocked by the unkemptness of the office.","translation":"彼女はオフィスの乱雑さに衝撃を受けた。"}],"collocations":["general unkemptness","obvious unkemptness","overall unkemptness"],"synonyms":["untidiness","disorder","messiness","slovenliness","shabbiness","squalor"],"antonyms":["neatness","tidiness","orderliness","cleanliness"]}],"etymology":{"value":"Derived from 'unkempt', which comes from 'un-' (not) + 'kempt' (well-groomed). 'Kempt' is an archaic past participle of 'to comb', so 'unkempt' literally means 'uncombed'. The suffix '-ness' turns the adjective into a noun.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈkɛmptnəs/","syllables":"un-kempt-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Unkemptness' refers to the state of being unkempt, which typically describes a person's appearance or a place that is messy and not well-maintained. It often implies a lack of care or attention to grooming and order. It is a more formal word than 'messiness' or 'untidiness'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The unkemptness was obvious on the floor.","correct":"The messiness was obvious on the floor.","note":"'Unkemptness' is better used to describe the state of a person's appearance or a place in general, not specific items like the floor. 'Messiness' is more appropriate in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["unkempt (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unkemptness' is a relatively uncommon noun that describes the state of being messy, untidy, or poorly groomed. It is often used in formal writing or when a more precise term than 'messiness' is desired. It implies a lack of care or attention to appearance or order. The word is derived from the adjective 'unkempt', which means not combed or groomed. Understanding the root adjective 'unkempt' helps in understanding the meaning of the noun 'unkemptness'."},"example_sentences":[{"sentence":"The unkemptness of the room suggested that no one had been there for weeks.","translation":"部屋の乱雑さは、何週間も誰もそこにいなかったことを示唆していた。","type":"noun","meaning_category":"乱雑さ"},{"sentence":"His unkemptness was a stark contrast to her meticulous appearance.","translation":"彼の身なりのだらしなさは、彼女の几帳面な外見とは対照的だった。","type":"noun","meaning_category":"だらしなさ"},{"sentence":"The general unkemptness of the property lowered its value.","translation":"その物件全体の荒れ具合が、その価値を下げた。","type":"noun","meaning_category":"不潔さ"}]}