{"word":"triad","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"三つ組、三位一体、三つ一組","english_definition":"a group or set of three connected people or things.","examples":[{"sentence":"The power in the country was held by a triad of influential families.","translation":"その国の権力は、影響力のある三つの家族の三つ組によって握られていた。"},{"sentence":"The novel explores the triad of love, loss, and redemption.","translation":"その小説は、愛、喪失、そして贖罪という三つ組を探求している。"},{"sentence":"He identified a triad of factors contributing to the problem.","translation":"彼はその問題に寄与する三つの要素の三つ組を特定した。"}],"collocations":["a triad of colors (三色の組み合わせ)","a triad of virtues (三つの美徳)","a ruling triad (支配的な三つ組)","form a triad (三つ組を形成する)"],"synonyms":["trinity","trio","triplet","trilogy","troika"],"antonyms":[],"notes":"しばしば、互いに関連または依存する3つの要素を指す。"},{"part_of_speech":"noun","definition":"(中国の)秘密結社、三合会","english_definition":"a Chinese organized crime syndicate.","examples":[{"sentence":"The police are investigating the triad's involvement in drug trafficking.","translation":"警察は、麻薬取引への三合会の関与を捜査している。"},{"sentence":"He was a member of a powerful triad in Hong Kong.","translation":"彼は香港の強力な三合会のメンバーだった。"},{"sentence":"Triads are known for their ruthless methods.","translation":"三合会は冷酷な手口で知られている。"}],"collocations":["triad activity (三合会の活動)","triad member (三合会のメンバー)","fight against triads (三合会と戦う)"],"synonyms":["Chinese mafia","organized crime syndicate"],"antonyms":[],"notes":"主に香港、マカオ、台湾、および東南アジアの華人社会で活動する犯罪組織を指す。"}],"etymology":{"value":"Late Middle English: from late Latin trias, triadis, from Greek trias, from treis ‘three’.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtraɪæd/","syllables":"tri-ad"},"inflection":{"noun_plural":"triads"},"usage_notes":{"explanation":"The word \"triad\" has two main meanings. The first is a general term for a group of three related things or people. The second, more specific meaning refers to Chinese organized crime syndicates. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was part of a trio of criminals.","correct":"✓ He was part of a triad of criminals.","note":"While \"trio\" can refer to any group of three, \"triad\" suggests a more structured or significant grouping, especially in the context of the first definition. In the context of Chinese organized crime, only \"triad\" is correct."}],"priority":"★★☆"},"related_words":{"derivatives":["triadic (adjective)"],"phrasal_verbs":[],"related_concepts":["trinity (三位一体)","triumvirate (三頭政治)"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"triad\" is used in two main contexts. In a general sense, it refers to any group of three related things or people. This usage often appears in academic or formal writing. More specifically, \"triad\" refers to Chinese organized crime syndicates. This usage is common in news reports or discussions about crime and international relations. Understanding the context is crucial to interpreting the intended meaning.","priority":"★★★"},"example_sentences":[{"sentence":"The success of the project depended on the triad of teamwork, communication, and dedication.","translation":"プロジェクトの成功は、チームワーク、コミュニケーション、献身という三つ組にかかっていた。","type":"noun","meaning_category":"三つ組 (general)"},{"sentence":"The police cracked down on the triad's illegal gambling operations.","translation":"警察は三合会の違法賭博活動を取り締まった。","type":"noun","meaning_category":"三合会 (Chinese organized crime)"},{"sentence":"Many ancient cultures revered the triad of sun, moon, and earth.","translation":"多くの古代文化は、太陽、月、地球の三つ組を崇拝していた。","type":"noun","meaning_category":"三つ組 (general)"}]}