{"word":"Hegelianism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヘーゲル主義","english_definition":"The philosophy of G. W. F. Hegel, which emphasizes the importance of reason and the dialectical process in understanding reality.","examples":[{"sentence":"Hegelianism had a profound influence on 19th-century thought.","translation":"ヘーゲル主義は19世紀の思想に深い影響を与えた。"},{"sentence":"Critics of Hegelianism argue that it is overly abstract and idealistic.","translation":"ヘーゲル主義の批判者たちは、それが過度に抽象的で理想主義的だと主張する。"}],"collocations":["influenced by Hegelianism","critics of Hegelianism","the principles of Hegelianism"],"synonyms":["Hegelian philosophy"],"antonyms":[]}],"etymology":{"value":"Formed from 'Hegelian' (relating to G. W. F. Hegel) + '-ism' (denoting a system of principles or ideology).","priority":"★★☆"},"pronunciation":{"ipa":"/heɪˈɡeɪliənɪzəm/","syllables":"He-ge-li-an-is-m"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hegelianism refers to the philosophical system developed by the German philosopher G. W. F. Hegel (1770-1831). Key concepts include the dialectic (thesis, antithesis, synthesis), the importance of reason, and the idea that history progresses through the unfolding of the 'Absolute Spirit' or 'Geist'. It has been influential in various fields including political philosophy, theology, and art.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Hegelianist.","correct":"✓ He is a Hegelian.","note":"'Hegelianist' is less common than 'Hegelian' to describe a follower or proponent of Hegelianism."}],"priority":"★★☆"},"related_words":{"derivatives":["Hegelian (adjective, noun)","neo-Hegelianism (noun)"],"phrases":["Hegelian dialectic","Hegelian idealism","Hegelian state"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. Primarily used in academic and philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hegelianism' is a term primarily encountered in philosophical and academic discussions. Understanding it requires familiarity with the basic tenets of Hegel's philosophy, including the dialectic, the concept of Geist, and the historical development of reason. It is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The young Hegelians were a group of radical thinkers who reinterpreted Hegelianism in a more revolutionary way.","translation":"青年ヘーゲル派は、ヘーゲル主義をより革命的な方法で再解釈した急進的な思想家集団だった。","type":"general","meaning_category":"general"},{"sentence":"Hegelianism posits that history is the unfolding of reason.","translation":"ヘーゲル主義は、歴史は理性の展開であると仮定する。","type":"general","meaning_category":"general"}]}