{"word":"Pyxes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)聖体容器、聖餐容器","english_definition":"(plural form of pyx) small, round containers used in the Catholic, Anglican, and Orthodox churches to carry the consecrated host (Eucharist) to the sick or those otherwise unable to come to church.","examples":[{"sentence":"The priest carefully placed the consecrated hosts into the pyxes.","translation":"司祭は注意深く聖別されたパンを聖体容器に入れた。"},{"sentence":"Pyxes are often made of precious metals like silver or gold.","translation":"聖体容器はしばしば銀や金のような貴金属で作られる。"}],"collocations":["carry the Eucharist in pyxes","store consecrated hosts in pyxes"],"synonyms":["ciborium","reliquary"],"antonyms":[]}],"etymology":{"value":"Derived from the singular form 'pyx,' which comes from the Greek word 'pyxos' meaning 'boxwood' or 'box.' Originally, pyxes were made of boxwood, but later they were crafted from other materials, including precious metals.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪksiːz/","syllables":"pyx-es"},"inflection":{"noun_plural":"Pyxes (already plural)"},"usage_notes":{"explanation":"'Pyxes' is the plural form of 'pyx.' A pyx is a small container used to transport the consecrated Eucharist, particularly to those who are ill or unable to attend church. The term is primarily used in Catholic, Anglican, and Orthodox Christian contexts. Because it refers to a specific religious object, it is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He carried the pyxes. It was one.","correct":"✓ He carried the pyx. It was one.","note":"'Pyx' is the singular form, used when referring to one container. 'Pyxes' is the plural form, used when referring to multiple containers."}],"priority":"★★☆"},"related_words":{"derivatives":["pyx (singular form)"],"phrases":[]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency - specialized religious term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Pyxes' is a specialized term primarily used within certain Christian denominations (Catholic, Anglican, Orthodox) to refer to the plural of 'pyx,' which are small containers for carrying the consecrated Eucharist. Due to its specific religious context, it is not a word commonly encountered in general English usage. Understanding requires familiarity with religious practices and vocabulary."},"example_sentences":[{"sentence":"The altar servers prepared the pyxes for distribution of communion to the homebound.","translation":"祭壇奉仕者は、自宅療養者への聖体拝領のために聖体容器を準備した。","type":"noun","meaning_category":"聖体容器"},{"sentence":"The priest ensured that the pyxes were properly cleaned and stored after each use.","translation":"司祭は、使用後、聖体容器が適切に清掃され保管されていることを確認した。","type":"noun","meaning_category":"聖体容器"}]}