{"word":"Oceania","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"オセアニア (太平洋の島々とその周辺地域を含む地理的・地政学的区分)","english_definition":"a geographical and geopolitical region consisting of numerous islands scattered throughout the Pacific Ocean, including Australia, New Zealand, Melanesia, Micronesia, and Polynesia.","examples":[{"sentence":"Australia and New Zealand are the largest countries in Oceania.","translation":"オーストラリアとニュージーランドはオセアニアで最も大きな国です。"},{"sentence":"Oceania is known for its diverse cultures and unique ecosystems.","translation":"オセアニアは多様な文化と独特な生態系で知られています。"},{"sentence":"Tourism is a major industry in many parts of Oceania.","translation":"観光業はオセアニアの多くの地域で主要な産業です。"}],"collocations":["Island nations of Oceania (オセアニアの島嶼国家)","Pacific region of Oceania (オセアニアの太平洋地域)","Culture and geography of Oceania (オセアニアの文化と地理)","Economy of Oceania (オセアニアの経済)","Biodiversity in Oceania (オセアニアの生物多様性)"],"synonyms":["South Pacific","Pacific Islands","Australasia (sometimes used, but not precisely equivalent)"],"antonyms":[]}],"etymology":{"value":"The name 'Oceania' was coined by the French geographer Conrad Malte-Brun around 1812, derived from the word 'ocean' (海). It was intended to encompass the islands of the Pacific Ocean and their surrounding regions.","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊʃiˈɑːniə/","syllables":"O-ce-a-ni-a"},"inflection":{"notes":"Oceania is a proper noun and generally does not have a plural form."},"usage_notes":{"explanation":"'Oceania' is a broad term that encompasses a vast area of the Pacific Ocean. Its precise boundaries can vary depending on the context. Generally, it includes Australia, New Zealand, Papua New Guinea, and the numerous island nations of Melanesia, Micronesia, and Polynesia. Sometimes, the term 'Australasia' is used to refer to Australia, New Zealand, and nearby islands, but it's not a perfect synonym for Oceania.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Oceania is a country.","correct":"✓ Oceania is a region.","note":"Oceania is a region comprising many countries and islands, not a single country. "},{"incorrect":"✗ Australia is the only country in Oceania.","correct":"✓ Australia is one of the largest countries in Oceania.","note":"Australia is a large part of Oceania, but many other countries and territories exist within the region."}],"priority":"★★☆"},"related_words":{"derivatives":["Oceanian (adjective: relating to Oceania; noun: a person from Oceania)"],"phrases":["Island nations of Oceania (オセアニアの島嶼国家)","Melanesia (メラネシア)","Micronesia (ミクロネシア)","Polynesia (ポリネシア)","Australasia (オーストララシア)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent in geographical and political contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Oceania' is a term used to describe a large region in the Pacific Ocean. It includes countries like Australia and New Zealand, as well as many smaller island nations. Understanding the term is important for geography and international studies. The word itself is not difficult, but knowing the scope of the region requires some background knowledge.","priority":"★★☆"},"example_sentences":[{"sentence":"The cultures of Oceania are incredibly diverse, reflecting the unique histories of each island group.","translation":"オセアニアの文化は非常に多様で、それぞれの島々のグループの独自の歴史を反映しています。","type":"general"},{"sentence":"Many of the island nations in Oceania are facing challenges due to climate change and rising sea levels.","translation":"オセアニアの多くの島嶼国家は、気候変動と海面上昇による課題に直面しています。","type":"environmental"},{"sentence":"The economy of Oceania is largely dependent on tourism, agriculture, and natural resources.","translation":"オセアニアの経済は、主に観光、農業、天然資源に依存しています。","type":"economic"},{"sentence":"Researchers are studying the unique biodiversity of Oceania to understand evolutionary processes.","translation":"研究者たちは、進化の過程を理解するために、オセアニアの独特な生物多様性を研究しています。","type":"scientific"}]}