{"word":"discerningly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"識別力をもって、見識をもって、鑑識眼をもって、明敏に","english_definition":"in a manner that shows good judgment, especially about style and quality; with discrimination and keen perception.","examples":[{"sentence":"She chose the wine discerningly, considering the flavors of each dish.","translation":"彼女は各料理の風味を考慮して、識別力をもってワインを選んだ。"},{"sentence":"He listened to the music discerningly, appreciating the nuances of each instrument.","translation":"彼は音楽を鑑識眼をもって聴き、各楽器のニュアンスを理解した。"},{"sentence":"The critic discerningly analyzed the film, pointing out both its strengths and weaknesses.","translation":"評論家は映画を明敏に分析し、その長所と短所の両方を指摘した。"}],"collocations":["choose discerningly","analyze discerningly","listen discerningly","judge discerningly","select discerningly","shop discerningly"],"synonyms":["perceptively","discriminatingly","judiciously","astutely","insightfully","sensitively","selectively"],"antonyms":["indiscriminately","undiscerningly","naively","foolishly","unselectively"]}],"etymology":{"value":"'Discerningly' is derived from the adjective 'discerning,' which comes from the verb 'discern.' 'Discern' originates from the Latin word 'discernere,' meaning 'to separate, distinguish, perceive.' The adverbial suffix '-ly' is added to 'discerning' to form 'discerningly.'","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈsɜːrnɪŋli/","syllables":"di-sern-ing-ly"},"inflection":{"notes":"As an adverb, 'discerningly' does not have different inflections."},"usage_notes":{"explanation":"'Discerningly' is used to describe actions or behaviors that demonstrate a high level of taste, judgment, and discrimination. It implies careful consideration and an ability to recognize subtle differences and qualities. It is often used in contexts related to art, culture, fashion, and personal taste.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He discerningly ate the food without tasting it.","correct":"✓ He ate the food discerningly, savoring each bite.","note":"'Discerningly' implies careful consideration and appreciation. Eating without tasting contradicts this meaning."},{"incorrect":"✗ She bought the dress discerningly without looking at the price.","correct":"✓ She bought the dress discerningly, carefully considering the style and fit.","note":"While 'discerningly' can involve considering value, it primarily focuses on quality, style, and appropriateness."}],"priority":"★★☆"},"related_words":{"derivatives":["discerning (adjective)","discern (verb)","discernment (noun)"],"phrases":["discerning eye","discerning taste","discerning palate","discerning customer","discerning buyer"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Discerningly' means doing something with a lot of good judgment and taste, especially when it comes to things like art, food, or fashion. It means you are careful and thoughtful in your choices and can tell the difference between good and bad quality. It's not a very common word, so you'll mostly find it in writing or when people are talking about things in a sophisticated way."},"example_sentences":[{"sentence":"The art collector viewed the paintings discerningly, appreciating the artist's technique and vision.","translation":"その美術コレクターは、画家の技法とビジョンを評価し、鑑識眼をもって絵画を鑑賞した。","type":"adverb","meaning_category":"鑑識眼をもって"},{"sentence":"She shopped discerningly, always seeking out high-quality, ethically sourced products.","translation":"彼女は常に高品質で倫理的に調達された製品を探し求め、識別力をもって買い物をした。","type":"adverb","meaning_category":"識別力をもって"},{"sentence":"The sommelier tasted the wine discerningly, identifying the subtle notes of fruit and spice.","translation":"ソムリエはワインを明敏にテイスティングし、果実とスパイスの微妙なノートを識別した。","type":"adverb","meaning_category":"明敏に"}]}