{"word":"hebephrenic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"破瓜型（解離型）の、破瓜病（解離症）の","english_definition":"Relating to or characteristic of hebephrenia (now classified as disorganized schizophrenia), a type of schizophrenia characterized by disorganized thought, speech, and behavior, and flat or inappropriate affect.","examples":[{"sentence":"The patient exhibited hebephrenic symptoms such as disorganized speech and inappropriate laughter.","translation":"その患者は、まとまりのない会話や不適切な笑いなど、破瓜型（解離型）の症状を示した。"},{"sentence":"Hebephrenic schizophrenia is characterized by a marked disturbance of affect.","translation":"破瓜型（解離型）統合失調症は、感情の著しい障害を特徴とする。"}],"collocations":["hebephrenic schizophrenia","hebephrenic symptoms","hebephrenic disorder"],"synonyms":["disorganized","schizophrenic"],"antonyms":[]}],"etymology":{"value":"From the German 'Hebephrenie', coined by Karl Kahlbaum in 1874, from Greek ἥβη (hḗbē, 'youth, prime of life') + φρήν (phrḗn, 'mind'). The term reflects the onset of the disorder typically during adolescence or early adulthood.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːbəˈfrɛnɪk/","syllables":"he-be-phren-ic"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Hebephrenic' is a term historically used to describe a subtype of schizophrenia characterized by disorganized thought, speech, and behavior, as well as flat or inappropriate affect. It is now largely replaced by the term 'disorganized schizophrenia' or simply classified under schizophrenia with specific symptom presentations. The term is less commonly used in modern psychiatric diagnosis but may still be encountered in older literature or discussions of the history of psychiatry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was hebephrenic with joy.","correct":"✓ He exhibited hebephrenic symptoms.","note":"'Hebephrenic' describes a specific set of symptoms related to a mental disorder, not general emotional states like joy. It should be used to describe disorganized thought, speech, or behavior."}],"priority":"★★☆"},"related_words":{"derivatives":["hebephrenia (noun)"],"related_medical_terms":["schizophrenia","disorganized schizophrenia","catatonia","psychosis","affective disorder"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Very specialized vocabulary, unlikely to be encountered outside of medical or psychiatric contexts)","frequency_google_ngram":"Extremely low frequency - Primarily used in medical or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'hebephrenic' is a highly specialized term primarily used in the fields of psychiatry and psychology, particularly in historical contexts. It refers to a specific subtype of schizophrenia characterized by disorganized thought, speech, and behavior, along with flat or inappropriate affect. Due to its specific and technical nature, it is unlikely to be encountered outside of professional or academic discussions related to mental health. The modern term 'disorganized schizophrenia' is more commonly used today."},"example_sentences":[{"sentence":"The patient's hebephrenic behavior made it difficult to conduct a coherent interview.","translation":"その患者の破瓜型（解離型）の行動のために、一貫性のあるインタビューを行うのが困難だった。","type":"adjective","meaning_category":"describing behavior"},{"sentence":"Historically, hebephrenic schizophrenia was considered a distinct subtype of the disorder.","translation":"歴史的に、破瓜型（解離型）統合失調症は、この疾患の明確な亜型と見なされていた。","type":"adjective","meaning_category":"historical context"}]}