{"word":"Velociman","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A person who travels quickly, especially on foot or by bicycle.","english_definition":"A person who travels quickly, especially on foot or by bicycle.","examples":[{"sentence":"The velociman sped through the forest, barely visible to the eye.","translation":"そのvelocimanは、ほとんど目に見えないほどの速さで森を駆け抜けた。"},{"sentence":"He was known as the town's fastest velociman, always delivering messages before anyone else.","translation":"彼は町で最も速いvelocimanとして知られており、常に誰よりも早くメッセージを配達していた。"}],"collocations":["fast velociman","skilled velociman","town velociman"],"synonyms":["runner","cyclist","messenger","courier","speedster"],"antonyms":["sluggard","slowpoke"]}],"etymology":{"value":"From Latin 'velox' (swift) + 'manus' (hand) + '-ian' (suffix denoting a person associated with). The 'manus' refers to the skill or ability, not literally 'hand'.","priority":"★★☆"},"pronunciation":{"ipa":"/vəˈlɒsɪmæn/","syllables":"ve-loc-i-man"},"inflection":{"noun_plural":"velocimen"},"usage_notes":{"explanation":"The word 'velociman' is quite rare and not commonly used in modern English. It is a somewhat archaic or jocular term for someone who is fast, especially in the context of running or cycling. It implies a skill or aptitude for speed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The velociman used a car to deliver the package.","correct":"✓ The velociman cycled to deliver the package.","note":"A velociman typically travels by foot or bicycle, not by car."},{"incorrect":"✗ She is a velociman in the library.","correct":"✓ She is a fast runner.","note":"'Velociman' refers to a fast traveler, not someone who works in a library."}],"priority":"★☆☆"},"related_words":{"derivatives":["velocity (noun: speed)","velocipede (noun: an early type of bicycle)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Velociman' is a rare and somewhat fanciful word, likely to be encountered only in specialized or historical contexts. Understanding its meaning requires knowledge of Latin roots and an appreciation for archaic language. Its usage is more for stylistic effect than practical communication."},"example_sentences":[{"sentence":"The legendary velociman was said to be able to outrun a horse.","translation":"伝説的なvelocimanは、馬よりも速く走ることができたと言われている。","type":"noun","meaning_category":"fast traveler"},{"sentence":"He trained to become a velociman, hoping to win the annual race.","translation":"彼は年次レースで優勝することを望んで、velocimanになるために訓練した。","type":"noun","meaning_category":"fast runner/cyclist"}]}