{"word":"Achen","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"痩果（そうか）：閉果の一種で、種子が果皮と融合せず、容易に分離できる小型の乾果。","english_definition":"A type of simple dry fruit produced by many species of flowering plants. Achenes are monocarpellate and indehiscent (they do not open naturally to release their seed). Achenes contain a single seed that nearly fills the pericarp, but is not attached to it.","examples":[{"sentence":"The sunflower seed is an achene.","translation":"ヒマワリの種は痩果です。"},{"sentence":"Buttercups produce achenes.","translation":"キンポウゲは痩果をつけます。"}],"collocations":["sunflower achene (ヒマワリの痩果)","strawberry achene (イチゴの痩果)","buttercup achene (キンポウゲの痩果)"],"synonyms":["dry fruit","seed","nutlet"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'achēnēs' meaning 'not gaping', referring to the fruit's indehiscent nature (not opening to release seeds).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeɪkiːn/","syllables":"A-chen"},"inflection":{"noun_plural":"achenes"},"usage_notes":{"explanation":"An achene is a specific type of dry, single-seeded fruit where the seed is separate from the fruit wall (pericarp), unlike a grain where the seed and fruit wall are fused. It's a botanical term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ An achene is a type of nut.","correct":"✓ An achene is a type of dry fruit.","note":"Achenes are dry fruits, but not all dry fruits are nuts. Nuts have a hard, stony shell, which achenes lack."},{"incorrect":"✗ Achenes open to release their seeds.","correct":"✓ Achenes do not open to release their seeds.","note":"Achenes are indehiscent, meaning they don't naturally open to release their seeds."}],"priority":"★★☆"},"related_words":{"derivatives":["achenial (adjective: relating to or resembling an achene)"],"phrases":["indehiscent fruit","pericarp","seed dispersal"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized botanical term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Achene' is a technical term used in botany to describe a particular type of dry fruit. It is most commonly encountered in scientific or academic contexts when discussing plant morphology or seed dispersal. The key characteristic of an achene is that it is a single-seeded fruit where the seed is not fused to the fruit wall and the fruit does not open on its own to release the seed. Examples include sunflower seeds and the fruits of buttercups."},"example_sentences":[{"sentence":"Botanists study the structure of the achene to understand seed dispersal mechanisms.","translation":"植物学者は、種子散布のメカニズムを理解するために痩果の構造を研究します。","type":"noun","meaning_category":"botany"},{"sentence":"The strawberry's 'seeds' are actually achenes on the surface of the fruit.","translation":"イチゴの「種」は、実際には果実の表面にある痩果です。","type":"noun","meaning_category":"botany"}]}