{"word":"light-inspired","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"光に触発された、光からインスピレーションを受けた","english_definition":"Inspired or influenced by light; deriving creative ideas or motivation from light.","examples":[{"sentence":"The artist's light-inspired paintings captured the ethereal beauty of the sunrise.","translation":"その画家の光に触発された絵画は、日の出の幽玄な美しさを捉えていた。"},{"sentence":"Her light-inspired designs brought a sense of optimism and brightness to the room.","translation":"彼女の光からインスピレーションを受けたデザインは、部屋に楽観主義と明るさをもたらした。"},{"sentence":"The architect created a light-inspired space using large windows and reflective surfaces.","translation":"建築家は、大きな窓と反射面を使用して、光に触発された空間を作り出した。"}],"collocations":["light-inspired art","light-inspired design","light-inspired architecture","light-inspired photography","light-inspired creativity"],"synonyms":["illuminated","radiant","luminescent","inspired by radiance","influenced by light"],"antonyms":["dark","shadowy","uninspired","dimly lit"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'light' (referring to electromagnetic radiation visible to the human eye) and 'inspired' (meaning to be filled with the urge or ability to do or feel something, especially creatively). The hyphen connects the two words to create a single adjective describing something that has been influenced or motivated by light.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlaɪtɪnˌspaɪərd/","syllables":"light-in-spired"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with compound adjectives like this."},"usage_notes":{"explanation":"'Light-inspired' is a descriptive adjective often used in artistic, design, and architectural contexts. It suggests that the subject has been significantly influenced by the properties, aesthetics, or symbolism of light. The term conveys a sense of creativity and positive energy derived from light. It's less common in everyday conversation and more frequently found in specialized or creative writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The light inspired artist.","correct":"✓ The light-inspired artist.","note":"The hyphen is essential to correctly form the compound adjective. Without it, the sentence can be grammatically incorrect or have a different meaning."},{"incorrect":"✗ The design was light inspired.","correct":"✓ The design was light-inspired.","note":"The hyphen is needed to link the two words to create a compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["inspiration","inspire","light","enlighten","illumination","radiance"],"phrases":["inspired by light","influenced by light","light and shadow","play of light","light effects"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - The term is relatively specialized and not commonly used in general conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'light-inspired' is a compound adjective used to describe something that has been influenced or motivated by light, often in a creative or artistic context. Because it's a specialized term, it's more likely to be encountered in writing related to art, design, or architecture. The hyphen is important to connect 'light' and 'inspired' and create a single adjective. Understanding the individual meanings of 'light' and 'inspired' helps in comprehending the combined meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The gallery featured a collection of light-inspired sculptures.","translation":"ギャラリーでは、光に触発された彫刻のコレクションが展示されていた。","type":"adjective","meaning_category":"art"},{"sentence":"The architect designed a light-inspired home with skylights and large windows.","translation":"建築家は、天窓と大きな窓を備えた、光からインスピレーションを受けた家を設計した。","type":"adjective","meaning_category":"architecture"},{"sentence":"The photographer's light-inspired portraits captured the subject's inner radiance.","translation":"写真家の光に触発されたポートレートは、被写体の内面の輝きを捉えていた。","type":"adjective","meaning_category":"photography"}]}