{"word":"Nonpaternal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非父性の、父親らしくない、父系でない","english_definition":"Not paternal; not characteristic of a father; not related through the father's side of the family.","examples":[{"sentence":"The child was raised in a nonpaternal environment.","translation":"その子供は父親のいない環境で育った。"},{"sentence":"The study focused on nonpaternal caregiving.","translation":"その研究は非父性的な介護に焦点を当てた。"},{"sentence":"The inheritance was determined by nonpaternal lineage.","translation":"相続は父系ではない血統によって決定された。"}],"collocations":["nonpaternal care","nonpaternal relative","nonpaternal influence","nonpaternal role","nonpaternal caregiver"],"synonyms":["unfatherly","non-filial","matrilineal"],"antonyms":["paternal","fatherly","filial"]}],"etymology":{"value":"'Non-' (否定の接頭辞) + 'paternal' (父の、父系の)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnpəˈtɜːrnl/","syllables":"non-pa-ter-nal"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"'Nonpaternal' is used to describe something that is not related to or characteristic of a father. It can refer to environments, relationships, or genetic lineages that do not involve the father's side of the family.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a nonpaternal attitude towards his children, always strict and demanding.","correct":"✓ He has a non-fatherly attitude towards his children, always strict and demanding.","note":"'Nonpaternal' refers to the absence of a fatherly role, not necessarily a negative fatherly attitude. 'Non-fatherly' is more appropriate to describe a negative attitude."},{"incorrect":"✗ The nonpaternal grandmother raised the child.","correct":"✓ The maternal grandmother raised the child.","note":"'Nonpaternal grandmother' is technically correct but less common. 'Maternal grandmother' is the standard term for the mother's mother."}],"priority":"★★☆"},"related_words":{"derivatives":["nonpaternally"],"related_terms":["paternal","paternity","matrilineal","patrilineal"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonpaternal' is a relatively uncommon and formal term. It is used to describe something that is not related to or characteristic of a father. It is often used in academic or technical contexts, such as in discussions of family structures, genetics, or social roles. Because it is not a common word, it is important to understand its meaning and usage before using it in writing or speech."},"example_sentences":[{"sentence":"The study examined the effects of nonpaternal care on child development.","translation":"その研究は、非父性的なケアが子供の発達に与える影響を調べた。","type":"general","meaning_category":"非父性のケア"},{"sentence":"She inherited the property through her nonpaternal grandmother.","translation":"彼女は父方の祖母ではない祖母を通して財産を相続した。","type":"general","meaning_category":"父系でない相続"},{"sentence":"The orphanage provided a nonpaternal environment for the children.","translation":"その孤児院は子供たちに父親のいない環境を提供した。","type":"general","meaning_category":"非父性の環境"}]}