{"word":"megaparsec","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"メガパーセク（天文学で使用される距離の単位で、約326万光年に相当）","english_definition":"a unit of distance used in astronomy, equal to one million parsecs, or approximately 3.26 million light-years.","examples":[{"sentence":"The galaxy is located several megaparsecs away from Earth.","translation":"その銀河は地球から数メガパーセク離れた場所に位置している。"},{"sentence":"Megaparsecs are often used to measure the distances between galaxies or clusters of galaxies.","translation":"メガパーセクは、銀河や銀河団間の距離を測定するためによく使用される。"}],"collocations":["distance in megaparsecs (メガパーセク単位の距離)","redshift at megaparsecs (メガパーセクでの赤方偏移)","nearby megaparsecs (近傍のメガパーセク範囲)"],"synonyms":["Mpc"],"antonyms":[]}],"etymology":{"value":"「mega-」（百万）+「parsec」（パーセク）の組み合わせ。パーセクは「parallax second」（年周視差秒）の短縮形であり、天体の年周視差が1秒角となる距離を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɛɡəˌpɑːrsɛk/","syllables":"me-ga-par-sec"},"inflection":{"noun_plural":"megaparsecs"},"usage_notes":{"explanation":"「**megaparsec**」は主に天文学の分野で使用される専門用語です。非常に大きな距離を扱う際に、メートルやキロメートルなどの日常的な単位では数値が大きくなりすぎるため、より適切な単位として用いられます。銀河や銀河団といった天体間の距離を表す際によく使用されます。記号としては「Mpc」と略されることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The distance is measured in megaparsecs, that is a very small distance.","correct":"✓ The distance is measured in megaparsecs, that is a very large distance.","note":"メガパーセクは非常に大きな距離の単位であり、「小さい」距離を表すものではありません。"},{"incorrect":"✗ He said the galaxy was about 1 megaparsec, but I think it's more like 1 light year.","correct":"✓ He said the galaxy was about 1 megaparsec, but I think it's more like 3.26 million light years.","note":"1メガパーセクは約326万光年です。光年とメガパーセクの単位の大きさを混同しないようにしましょう。"}],"priority":"★★☆"},"related_words":{"derivatives":["parsec","kiloparsec","gigaparsec"],"related_terms":["light-year","astronomical unit","redshift","cosmology","astronomy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 天文学の専門分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**megaparsec**」は、天文学で使われる距離の単位で、とても大きな距離を表します。1メガパーセクは約326万光年です。銀河と銀河の間の距離など、宇宙のスケールで距離を測るときに使われます。日常会話ではほとんど出てこない専門用語ですが、天文学の記事や研究論文を読むときには知っておくと便利です。"},"example_sentences":[{"sentence":"The Andromeda galaxy is located approximately 0.77 megaparsecs from the Milky Way.","translation":"アンドロメダ銀河は天の川銀河から約0.77メガパーセク離れた場所に位置している。","type":"example","meaning_category":"距離の単位"},{"sentence":"The size of the observable universe is estimated to be several gigaparsecs, which is thousands of megaparsecs.","translation":"観測可能な宇宙の大きさは数ギガパーセクと推定されており、これは数千メガパーセクに相当する。","type":"example","meaning_category":"宇宙論"}]}