{"word":"average-legged","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having legs of average length.","english_definition":"Having legs of a length that is neither unusually long nor unusually short; possessing legs that conform to the typical or expected length.","examples":[{"sentence":"The doll was average-legged, making it easy for children to dress.","translation":"その人形は平均的な長さの脚だったので、子供たちが着せ替えをするのが簡単だった。"},{"sentence":"He was an average-legged man, but his upper body was exceptionally muscular.","translation":"彼は平均的な長さの脚の男だったが、上半身は並外れて筋肉質だった。"},{"sentence":"The study compared the running speeds of average-legged and long-legged athletes.","translation":"その研究では、平均的な長さの脚と長い脚のアスリートの走行速度を比較した。"}],"collocations":["average-legged person","average-legged doll","average-legged athlete"],"synonyms":["medium-legged","normal-legged","regular-legged"],"antonyms":["long-legged","short-legged"]}],"etymology":{"value":"Formed by combining the adjective 'average' with the noun 'leg' and adding the suffix '-ed' to create an adjective describing someone or something with average-length legs.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈævərɪdʒˌleɡɪd/","syllables":"av-er-age-leg-ged"},"inflection":{"notes":"Adjective; does not have comparative or superlative forms."},"usage_notes":{"explanation":"The term 'average-legged' is used to describe someone or something whose legs are of typical or expected length, without being notably long or short. It is often used in comparative contexts or to provide a specific physical description.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is average legged.","correct":"✓ He is average-legged.","note":"The hyphen is important to connect the words and create a compound adjective."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'average-legged' is a descriptive adjective used to specify that someone or something has legs of a typical or expected length. It is a relatively uncommon term, likely to be encountered in detailed physical descriptions or comparative studies. Understanding the meaning requires familiarity with the base words 'average' and 'leg,' as well as the function of the '-ed' suffix in forming adjectives."},"example_sentences":[{"sentence":"The tailor needed the inseam measurement to determine if the customer was average-legged.","translation":"仕立て屋は、顧客が平均的な長さの脚かどうかを判断するために、股下の寸法を必要とした。","type":"descriptive","meaning_category":"physical description"},{"sentence":"The study aimed to identify if average-legged individuals experienced different joint stress compared to those with longer or shorter legs.","translation":"その研究は、平均的な長さの脚を持つ人が、より長いまたは短い脚を持つ人と比較して、異なる関節ストレスを経験するかどうかを特定することを目的とした。","type":"comparative","meaning_category":"comparative study"}]}