{"word":"office-dependent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"オフィスへの依存度が高い、オフィス勤務が不可欠な","english_definition":"Relating to or characterized by a high degree of reliance on working from a physical office space; requiring or strongly benefiting from in-person work.","examples":[{"sentence":"The company's culture is very office-dependent, with a strong emphasis on face-to-face collaboration.","translation":"その会社の文化はオフィスへの依存度が高く、対面での協調を強く重視しています。"},{"sentence":"Some roles are inherently office-dependent due to the need for specialized equipment or secure environments.","translation":"専門的な機器や安全な環境が必要なため、本質的にオフィス勤務が不可欠な職種もあります。"},{"sentence":"While many employees enjoy the flexibility of remote work, certain departments remain office-dependent for operational efficiency.","translation":"多くの従業員はリモートワークの柔軟性を享受していますが、特定の部門は業務効率のためにオフィスへの依存度が高いままです。"}],"collocations":["office-dependent culture (オフィス依存の文化)","office-dependent role (オフィス依存の役割)","office-dependent department (オフィス依存の部門)","become office-dependent (オフィス依存になる)","remain office-dependent (オフィス依存のままである)"],"synonyms":["office-centric","location-dependent","in-person-required","non-remote","physical-presence-required"],"antonyms":["remote-friendly","remote-first","location-independent","office-optional","hybrid-work"],"notes":"This term is often used in discussions about remote work, hybrid work models, and the future of work. It describes situations where working from a physical office is considered essential or highly advantageous."}],"etymology":{"value":"A compound word formed by combining 'office' (a place of business) and 'dependent' (relying on something).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɔːfɪs dɪˈpɛndənt/","syllables":"of-fice de-pen-dent"},"inflection":{"notes":"Adjectives do not inflect in English, but can be modified by adverbs (e.g., very office-dependent)."},"usage_notes":{"explanation":"'Office-dependent' is a relatively new term that has gained prominence with the rise of remote work. It describes jobs, companies, or aspects of work that are difficult or impossible to perform effectively without being physically present in an office. It often implies a reliance on in-person communication, specialized equipment, or a specific physical environment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The work is office-depend.","correct":"✓ The work is office-dependent.","note":"'Office-dependent' is an adjective, so it should be used to describe a noun. 'Office-depend' is not a recognized word."},{"incorrect":"✗ The company is very dependent of the office.","correct":"✓ The company is very dependent on the office. / ✓ The company is very office-dependent.","note":"The correct preposition to use with 'dependent' is 'on'. Alternatively, you can use the adjective 'office-dependent'."}],"priority":"★★☆"},"related_words":{"derivatives":["dependence (noun)","dependently (adverb)"],"related_concepts":["remote work","hybrid work","telecommuting","work from home (WFH)","distributed workforce","office culture","digital nomad"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - a relatively new and specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Office-dependent' is a term used to describe something that relies heavily on being in a physical office. It's often used when discussing whether a job or company can effectively operate with remote work options. If something is 'office-dependent,' it means it's difficult or impossible to do well without being in a traditional office setting. This might be because of the need for specific equipment, in-person collaboration, or a particular office culture. The opposite of 'office-dependent' would be something like 'remote-friendly' or 'location-independent.'"},"example_sentences":[{"sentence":"Manufacturing jobs are often more **office-dependent** than software development roles.","translation":"製造業の仕事は、ソフトウェア開発の仕事よりもオフィスへの依存度が高いことが多いです。","type":"adjective","meaning_category":"オフィス勤務が不可欠な"},{"sentence":"The shift to remote work has forced companies to re-evaluate which functions are truly **office-dependent**.","translation":"リモートワークへの移行により、企業はどの機能が本当にオフィスへの依存度が高いのかを再評価せざるを得なくなりました。","type":"adjective","meaning_category":"オフィス勤務が不可欠な"},{"sentence":"Some employees find that their productivity suffers when they are not in an **office-dependent** environment.","translation":"オフィス勤務が不可欠な環境にいないと、生産性が低下すると感じる従業員もいます。","type":"adjective","meaning_category":"オフィス勤務が不可欠な"}]}