{"word":"half-reactionary","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"部分的に反動的な、ある程度反動的な","english_definition":"Partially or somewhat reactionary; exhibiting some reactionary characteristics but not fully committed to reactionary principles.","examples":[{"sentence":"The politician's policies were described as half-reactionary, as they combined some progressive elements with conservative ones.","translation":"その政治家の政策は、進歩的な要素と保守的な要素を組み合わせているため、部分的に反動的であると評された。"},{"sentence":"The movement was labeled half-reactionary because it sought to restore certain traditions while embracing some modern reforms.","translation":"その運動は、特定の伝統を回復しようとしながら、いくつかの現代的な改革を受け入れているため、ある程度反動的であると見なされた。"}],"collocations":["half-reactionary policies","half-reactionary movement","half-reactionary views","half-reactionary approach"],"synonyms":["partly reactionary","somewhat conservative","moderately backward-looking"],"antonyms":["progressive","forward-thinking","revolutionary"]},{"part_of_speech":"noun","definition":"部分的な反動主義者、ある程度反動的な人","english_definition":"A person who is partially or somewhat reactionary; someone who exhibits some reactionary characteristics but is not fully committed to reactionary principles.","examples":[{"sentence":"He was considered a half-reactionary because he supported some traditional values but also advocated for certain modern reforms.","translation":"彼は、いくつかの伝統的な価値観を支持する一方で、特定の現代的な改革も提唱していたため、部分的な反動主義者と見なされた。"},{"sentence":"The group consisted of half-reactionaries who sought to balance traditional ideals with contemporary realities.","translation":"そのグループは、伝統的な理想と現代的な現実のバランスを取ろうとする、ある程度反動的な人々で構成されていた。"}],"collocations":["a group of half-reactionaries","a self-described half-reactionary"],"synonyms":["moderate conservative","partial traditionalist"],"antonyms":["progressive","revolutionary"]}],"etymology":{"value":"The term 'half-reactionary' is formed by combining 'half' (indicating partial or incomplete) with 'reactionary' (referring to a person or ideology that opposes progress and seeks to return to a previous state of affairs).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhæf.riˈæk.ʃən.ɛri/","syllables":"half-re-ac-tion-a-ry"},"inflection":{"noun_plural":"half-reactionaries","adjective_forms":{}},"usage_notes":{"explanation":"'Half-reactionary' is used to describe someone or something that exhibits some, but not all, characteristics of a reactionary ideology. It suggests a mixed or moderate stance, where traditional or conservative elements are combined with more progressive or modern ideas. This term is often used in political or ideological discussions to describe nuanced positions that don't fit neatly into traditional categories.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a half reactionary.","correct":"✓ He is a half-reactionary.","note":"The hyphen is important to connect 'half' and 'reactionary' when used as a compound adjective or noun."},{"incorrect":"✗ She has half reactionary ideas.","correct":"✓ She has half-reactionary ideas.","note":"Again, the hyphen is needed to form the compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["reactionary","reactionism","half-conservative","moderate conservative"],"phrasal_verbs":[],"related_concepts":["conservatism","traditionalism","progressivism","political ideology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'half-reactionary' is a nuanced descriptor used in political and ideological contexts. It indicates a position that is partially reactionary, meaning it combines elements of traditionalism or conservatism with more moderate or progressive views. Understanding this term requires familiarity with political ideologies and the ability to recognize nuanced positions beyond simple labels. It is not a commonly used term and is more likely to appear in academic or specialized discussions."},"example_sentences":[{"sentence":"The party's platform was seen as half-reactionary, as it advocated for some traditional values while supporting certain social reforms.","translation":"その政党の綱領は、いくつかの伝統的な価値観を提唱しながら、特定の社会改革を支持していたため、部分的に反動的であると見なされた。","type":"adjective","meaning_category":"partially reactionary"},{"sentence":"He described himself as a half-reactionary, believing that some aspects of the past should be preserved while others should be left behind.","translation":"彼は自身を部分的な反動主義者であると述べ、過去のある側面は保存すべきであり、他の側面は捨てるべきだと考えていた。","type":"noun","meaning_category":"partial reactionary"}]}