{"word":"semiperviness","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"The state or quality of being somewhat perverted or inappropriately interested in sexual matters; a mild or partial form of perversion.","english_definition":"A state of being mildly or partially perverted; inappropriate interest in sexual matters.","examples":[{"sentence":"His behavior showed a touch of semiperviness, with his inappropriate jokes.","translation":"彼の行動は、不適切なジョークなど、ややわいせつなところを示していた。"},{"sentence":"The movie's humor bordered on semiperviness, making some viewers uncomfortable.","translation":"その映画のユーモアはややわいせつなところに触れており、一部の視聴者を不快にさせた。"}],"collocations":["display semiperviness","a hint of semiperviness","border on semiperviness"],"synonyms":["mild perversion","inappropriate interest","suggestiveness","lewdness (to a lesser degree)"],"antonyms":["innocence","purity","wholesomeness"]}],"etymology":{"value":"Derived from 'semi-' (meaning 'partially' or 'somewhat') and 'perviness' (the state of being perverted).","priority":"Medium"},"pronunciation":{"ipa":"/ˌsɛmiˈpɜːrvɪnəs/","syllables":"sem-i-per-vi-ness"},"inflection":{"noun_plural":"None (uncountable noun)"},"usage_notes":{"explanation":"'Semiperviness' is used to describe behavior or attitudes that are suggestive or mildly inappropriate sexually, but not to the extent of full-blown perversion. It often implies a playful or teasing manner that is slightly off-color.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He showed semiperviness when he helped the old lady cross the street.","correct":"His behavior showed a hint of semiperviness when he made a suggestive comment.","note":"Semiperviness relates to inappropriate sexual interest, not general helpfulness."}],"priority":"Low"},"related_words":{"derivatives":["semiperverse (adjective)"],"phrasal_verbs":[]},"level_frequency":{"frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Semiperviness' is a nuanced term used to describe a mild or partial form of perversion, often involving suggestive or inappropriate sexual interest. It's less severe than 'perversion' but indicates questionable behavior. The word is relatively uncommon and may not be widely understood."},"example_sentences":[{"sentence":"The comedian's routine had a certain semiperviness that appealed to some audience members.","translation":"そのコメディアンのルーティンには、ある種のわいせつさがあり、一部の観客にアピールした。","type":"General","meaning_category":"Mild perversion"},{"sentence":"The character's semiperviness was portrayed as harmless and humorous.","translation":"そのキャラクターのややわいせつなところは、無害でユーモラスに描かれていた。","type":"General","meaning_category":"Mild perversion"}]}