{"word":"poucey","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(UK, slang) posh, upper-class, snobbish","english_definition":"(UK, slang) posh, upper-class, snobbish.","examples":[{"sentence":"He's gone all poucey since he moved to London.","translation":"彼はロンドンに引っ越してから、すっかり気取って上流階級ぶるようになった。"},{"sentence":"That's a very poucey accent you've got there.","translation":"それはとても気取ったアクセントですね。"}],"collocations":["poucey accent","poucey behaviour"],"synonyms":["posh","upper-class","snobbish","stuck-up","hoity-toity"],"antonyms":["common","working-class","down-to-earth"]}],"etymology":{"value":"Likely derived from 'pouce', an obsolete slang term for a policeman or someone in authority, implying a sense of superiority or self-importance.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈpaʊsi/","syllables":"pou-cey"},"inflection":{},"usage_notes":{"explanation":"'Poucey' is a British slang term, primarily used in the UK, to describe someone who is perceived as being posh, snobbish, or trying to act like they are from a higher social class. It's generally used in a derogatory or mocking way.","priority":"★★☆"},"common_mistakes":{},"related_words":{},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR levels)","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Poucey' is a slang term, primarily used in the UK, to describe someone who is perceived as being posh, snobbish, or trying to act like they are from a higher social class. It's generally used in a derogatory or mocking way. Due to its slang nature, it is not appropriate for formal contexts and may not be understood by non-native speakers or those unfamiliar with British slang."},"example_sentences":[{"sentence":"Don't be so poucey, just relax and have fun.","translation":"そんなに気取らないで、リラックスして楽しんで。","type":"adjective","meaning_category":"snobbish"},{"sentence":"She's got a poucey way of speaking that I find irritating.","translation":"彼女の気取った話し方が私にはイライラする。","type":"adjective","meaning_category":"posh"}]}