{"word":"redistributory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"再分配の、再分配的な","english_definition":"concerned with or designed to effect redistribution, especially of income or wealth.","examples":[{"sentence":"The government implemented redistributory policies to reduce income inequality.","translation":"政府は所得格差を是正するために再分配政策を実施した。"},{"sentence":"The proposed tax reforms have significant redistributory effects.","translation":"提案された税制改革は、大きな再分配効果をもたらす。"},{"sentence":"Redistributory measures are often debated in the context of social justice.","translation":"再分配措置は、社会正義の文脈で議論されることが多い。"}],"collocations":["redistributory policies","redistributory effects","redistributory measures","redistributory taxation","redistributory impact","redistributory mechanism"],"synonyms":["equalizing","reallocating","reapportioning","transferring","leveling"],"antonyms":["regressive","concentrating","accumulative"]}],"etymology":{"value":"The word 'redistributory' is formed by combining 'redistribute' (to distribute again or differently) with the suffix '-ory' (relating to or tending to). 'Redistribute' itself is formed from 're-' (again) and 'distribute' (to divide among several or many).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːdɪˈstrɪbjʊtəri/","syllables":"re-di-strib-u-to-ry"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Redistributory' is primarily used in political and economic contexts to describe policies, measures, or systems that aim to redistribute resources, typically income or wealth, from one group to another. It often implies a deliberate effort to reduce inequality or address social imbalances. The term is frequently used in discussions about taxation, welfare programs, and other government interventions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The policy is very redistributory.","correct":"✓ The policy has a strong redistributory effect.","note":"It's more common to describe the 'effect' or 'impact' as redistributory rather than directly describing the policy itself as 'very redistributory'. While grammatically correct, the latter sounds less natural."},{"incorrect":"✗ The redistributory is important.","correct":"✓ Redistribution is important.","note":"'Redistributory' is an adjective. The related noun is 'redistribution'."}],"priority":"★☆☆"},"related_words":{"derivatives":["redistribute (verb)","redistribution (noun)","redistributive (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Redistributory' is a specialized term primarily used in economics and political science. It describes something that aims to redistribute resources, especially wealth or income, from one group to another. It's often used when discussing government policies designed to reduce inequality. Because it's a technical term, it's more likely to appear in academic or professional contexts rather than everyday conversation."},"example_sentences":[{"sentence":"The proposed legislation includes several redistributory provisions.","translation":"提案された法律には、いくつかの再分配条項が含まれている。","type":"general","meaning_category":"general"},{"sentence":"Progressive taxation is a key tool for redistributory fiscal policy.","translation":"累進課税は、再分配的な財政政策の重要な手段である。","type":"economics","meaning_category":"economics"},{"sentence":"The redistributory impact of the program was assessed in a recent study.","translation":"そのプログラムの再分配効果は、最近の研究で評価された。","type":"social science","meaning_category":"social science"}]}