{"word":"smallpox","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"天然痘","english_definition":"An acute contagious disease caused by the variola virus; characterized by fever and pustules, and eradicated worldwide by 1980.","examples":[{"sentence":"Smallpox was a deadly disease that killed millions.","translation":"天然痘は何百万人もの命を奪った致命的な病気だった。"},{"sentence":"Vaccination was crucial in the eradication of smallpox.","translation":"天然痘の根絶にはワクチン接種が不可欠だった。"},{"sentence":"The last known case of naturally occurring smallpox was in 1977.","translation":"自然発生した天然痘の最後の症例は1977年だった。"}],"collocations":["eradication of smallpox","smallpox vaccination","smallpox virus","contract smallpox","die from smallpox","smallpox epidemic"],"synonyms":["variola","pox"],"antonyms":[]}],"etymology":{"value":"From Middle English *smal pokkes*, literally 'small pocks' or 'small pustules', to distinguish it from 'great pocks' (syphilis).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsmɔːlpɒks/","syllables":"small-pox"},"inflection":{"noun_plural":"smallpoxes (rare, usually used as an uncountable noun)"},"usage_notes":{"explanation":"Smallpox is a serious, highly contagious, and often fatal infectious disease. It is caused by the variola virus. The disease is characterized by a distinctive skin rash with characteristic pustules. Thanks to a global vaccination campaign led by the World Health Organization (WHO), smallpox was eradicated worldwide in 1980. However, samples of the virus are still kept in secure laboratories for research purposes. Due to the potential for misuse as a bioweapon, access to these samples is strictly controlled.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have smallpox vaccine.","correct":"✓ I have a smallpox vaccine. / ✓ I had a smallpox vaccination.","note":"'Vaccine' is a countable noun, so it requires an article ('a', 'the', etc.). 'Vaccination' is the act of being vaccinated."},{"incorrect":"✗ Smallpox are eradicated.","correct":"✓ Smallpox is eradicated.","note":"'Smallpox' is treated as a singular noun even though it refers to a disease characterized by multiple pustules."}],"priority":"★★☆"},"related_words":{"derivatives":["vaccination","vaccine","variola"],"phrases":["eradication","contagious disease","infectious disease","public health","global health"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (technical/historical context)","frequency_google_ngram":"Low frequency (currently, due to eradication, but high historically)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Smallpox' refers to a very serious and contagious disease that used to kill many people. It caused a rash with pus-filled bumps all over the body. Thanks to vaccines, it doesn't exist naturally anymore. You might see this word in history books or when people talk about diseases that have been wiped out. It's important to know that it's not a threat anymore because of successful vaccination programs.","priority":"★★☆"},"example_sentences":[{"sentence":"The global **smallpox** eradication campaign was a major public health success.","translation":"世界的な天然痘根絶キャンペーンは、公衆衛生における大きな成功だった。","type":"noun","meaning_category":"disease"},{"sentence":"Before the **smallpox** vaccine, the disease was a major cause of death.","translation":"天然痘ワクチン以前は、この病気は主要な死因だった。","type":"noun","meaning_category":"disease"},{"sentence":"Scientists are studying the **smallpox** virus to develop better vaccines.","translation":"科学者たちは、より良いワクチンを開発するために天然痘ウイルスを研究している。","type":"noun","meaning_category":"virus"}]}