{"word":"Cryobiological","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"低温生物学の、凍結保存生物学の","english_definition":"Relating to cryobiology; pertaining to the effects of low temperatures on biological systems.","examples":[{"sentence":"Cryobiological techniques are used to preserve cells and tissues.","translation":"低温生物学的手法は、細胞や組織の保存に用いられる。"},{"sentence":"Cryobiological research explores the limits of life at extremely low temperatures.","translation":"低温生物学的研究は、極低温における生命の限界を探求する。"}],"collocations":["cryobiological preservation","cryobiological storage","cryobiological research"],"synonyms":["cryopreservative","cryogenic","low-temperature biology"],"antonyms":["thermobiological","high-temperature biology"]}],"etymology":{"value":"The word is formed by combining 'cryo-' (from Greek 'κρύος' meaning 'icy cold'), 'bio-' (from Greek 'βίος' meaning 'life'), and '-logical' (relating to the study of).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkraɪoʊbaɪəˈlɒdʒɪkəl/","syllables":"Cry-o-bi-o-log-i-cal"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"'Cryobiological' is used to describe anything related to the study and preservation of biological materials at very low temperatures. It is often used in the context of preserving cells, tissues, and organs for future use.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ cryobiologic","correct":"✓ cryobiological","note":"The correct form is 'cryobiological', not 'cryobiologic'."}],"priority":"★★☆"},"related_words":{"derivatives":["cryobiology (noun): the study of the effects of low temperatures on biological systems.","cryopreservation (noun): the preservation of biological materials by cooling to very low temperatures.","cryoprotectant (noun): a substance that protects biological material from freezing damage."],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Cryobiological' is a specialized term used in scientific and medical contexts. It refers to the study and application of very low temperatures to biological systems, particularly for preservation. Understanding this term requires familiarity with scientific vocabulary and concepts related to biology and physics."},"example_sentences":[{"sentence":"The cryobiological properties of the cell membrane are crucial for successful cryopreservation.","translation":"細胞膜の低温生物学的特性は、凍結保存を成功させるために重要である。","type":"general","meaning_category":"scientific"},{"sentence":"Cryobiological engineering seeks to optimize methods for long-term storage of organs.","translation":"低温生物工学は、臓器の長期保存のための方法を最適化しようとする。","type":"research","meaning_category":"scientific"}]}