{"word":"non-allegorical","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"比喩的でない、寓意を含まない","english_definition":"Not allegorical; lacking allegorical meaning or interpretation.","examples":[{"sentence":"The painting was intended to be a straightforward depiction of the scene, completely non-allegorical in its approach.","translation":"その絵画は、その場面を率直に描写することを意図しており、そのアプローチは完全に比喩的ではありません。"},{"sentence":"His interpretation of the text was strictly literal and non-allegorical.","translation":"彼のテキストの解釈は厳密に文字通りで、比喩的ではありませんでした。"}],"collocations":["non-allegorical interpretation","non-allegorical depiction","purely non-allegorical"],"synonyms":["literal","factual","realistic","straightforward","unmetaphorical"],"antonyms":["allegorical","metaphorical","symbolic"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'allegorical'. 'Allegorical' comes from the Greek 'allegoria', meaning 'speaking otherwise' or 'veiled language'.","priority":"low"},"pronunciation":{"ipa":"/ˌnɒn ælɪˈɡɒrɪkəl/","syllables":"non-al-le-gor-i-cal"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms (which are rarely used for this word)."},"usage_notes":{"explanation":"'Non-allegorical' is used to describe something that should be taken at face value, without searching for hidden or symbolic meanings. It is often used in literary criticism, art history, and theology to distinguish between works that are meant to be understood literally and those that are intended to convey a deeper, symbolic message.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The story is non allegorical, so it's easy to understand.","correct":"The story is non-allegorical, so it's easy to understand.","note":"Correct spelling is crucial. Hyphenation is standard."}],"priority":"low"},"related_words":{"derivatives":["allegory","allegorical","allegorically"],"phrases":["literal interpretation","symbolic meaning","figurative language"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low","priority":"low"},"readability_explanation":{"level":"C1","text":"The word 'non-allegorical' is a technical term used in fields like literature and art. It means something is not an allegory, so it doesn't have a hidden or symbolic meaning. It's the opposite of 'allegorical,' which describes something with a deeper, symbolic level of meaning. If something is non-allegorical, it's meant to be understood literally. "},"example_sentences":[{"sentence":"The artist insisted that his landscape painting was a non-allegorical representation of nature.","translation":"その画家は、彼の風景画は自然の比喩的でない表現であると主張しました。","type":"adjective","meaning_category":"literal representation"},{"sentence":"A non-allegorical reading of the poem focuses on the surface narrative rather than any symbolic subtext.","translation":"その詩の比喩的でない解釈は、象徴的なサブテキストではなく、表面的な物語に焦点を当てています。","type":"adjective","meaning_category":"literal interpretation"}]}