{"word":"competence-enhancing","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"能力向上型の、コンピテンシー強化型の","english_definition":"Designed or having the effect of improving or increasing skills, abilities, or expertise.","examples":[{"sentence":"The company invested in competence-enhancing training programs for its employees.","translation":"その会社は、従業員向けの能力向上型研修プログラムに投資した。"},{"sentence":"Competence-enhancing technologies can lead to greater productivity.","translation":"能力向上型テクノロジーは、生産性の向上につながる可能性がある。"},{"sentence":"The new curriculum includes competence-enhancing activities to prepare students for the workforce.","translation":"新しいカリキュラムには、学生を労働力として準備するための能力向上型アクティビティが含まれている。"}],"collocations":["competence-enhancing training","competence-enhancing technology","competence-enhancing activities","competence-enhancing strategies","competence-enhancing measures","competence-enhancing innovation"],"synonyms":["skill-building","ability-improving","expertise-developing","capacity-enhancing","performance-boosting"],"antonyms":["competence-destroying","skill-reducing","ability-limiting","expertise-hindering"]}],"etymology":{"value":"The word is formed by combining 'competence' (the ability to do something successfully or efficiently), 'enhancing' (making something better or greater), and joining them with a hyphen to create a compound adjective.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɒmpɪtəns ɪnˈhænsɪŋ/","syllables":"com-pe-tence in-han-cing"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb or noun."},"usage_notes":{"explanation":"'Competence-enhancing' is typically used to describe programs, technologies, strategies, or activities that are designed to improve someone's skills, abilities, or expertise in a particular area. It is often used in the context of business, education, and technology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The program was competence enhance.","correct":"✓ The program was competence-enhancing.","note":"'Competence-enhancing' is an adjective, so it should be used to describe a noun. 'Competence enhance' is grammatically incorrect in this context."},{"incorrect":"✗ Competence enhancing is good.","correct":"✓ Competence-enhancing strategies are good.","note":"When using 'competence-enhancing' as an adjective, it should be followed by a noun it describes. Using it alone as a subject is grammatically incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["competence","enhance","enhancement"],"related_terms":["skill-enhancing","capacity-building","capability-enhancing","knowledge-enhancing","performance-improving"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, but used in specific contexts such as business, education, and technology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Competence-enhancing' is a compound adjective used to describe something that improves skills or abilities. It is often used in professional or academic contexts to describe training programs, technologies, or strategies that help people become more competent. The word is relatively complex and is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The new software offers competence-enhancing tools for data analysis.","translation":"新しいソフトウェアは、データ分析のための能力向上型ツールを提供する。","type":"general","meaning_category":"Technology"},{"sentence":"The university provides competence-enhancing workshops for its students.","translation":"その大学は、学生向けの能力向上型ワークショップを提供している。","type":"general","meaning_category":"Education"},{"sentence":"The company's competence-enhancing strategies have led to increased productivity.","translation":"その会社の能力向上型戦略は、生産性の向上につながった。","type":"general","meaning_category":"Business"}]}