{"word":"canonry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(キリスト教)参事会員の職、参事会員の地位","english_definition":"The office or position of a canon in a cathedral or collegiate church.","examples":[{"sentence":"He was appointed to a canonry at St. Paul's Cathedral.","translation":"彼は聖パウロ大聖堂の参事会員の職に任命された。"},{"sentence":"The income from the canonry helped support his family.","translation":"参事会員の地位からの収入は彼の家族を支えるのに役立った。"}],"collocations":["hold a canonry","receive a canonry","appoint to a canonry"],"synonyms":["prebend","stall"],"antonyms":[]}],"etymology":{"value":"From 'canon' (a member of a cathedral chapter) + '-ry' (suffix denoting office, condition, or place).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkænənri/","syllables":"can-on-ry"},"inflection":{"noun_plural":"canonries"},"usage_notes":{"explanation":"A 'canonry' refers specifically to the position or office held by a canon, a member of the clergy associated with a cathedral or collegiate church. It is often associated with certain duties and responsibilities within the church structure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a canon.","correct":"✓ He holds a canonry.","note":"'Canon' refers to the person; 'canonry' refers to the position. Use the correct term to describe the office."}],"priority":"★☆☆"},"related_words":{"derivatives":["canon (noun: a member of a cathedral chapter)","canonical (adjective: conforming to canon law)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'canonry' is a specialized term related to the ecclesiastical structure of certain Christian denominations, particularly within Anglican and Catholic churches. It refers to the position or office held by a canon, who is a member of the chapter of a cathedral or collegiate church. This term is not commonly used outside of contexts discussing church governance or history."},"example_sentences":[{"sentence":"The bishop conferred a canonry upon him in recognition of his service to the diocese.","translation":"司教は彼の教区への貢献を認め、彼に参事会員の職を授けた。","type":"noun","meaning_category":"参事会員の職"},{"sentence":"The duties of the canonry included preaching and administering the sacraments.","translation":"参事会員の職務には、説教と聖餐の執行が含まれていた。","type":"noun","meaning_category":"参事会員の職"}]}