{"word":"Sadr","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"サドル (人名、地名)","english_definition":"A surname and place name.","examples":[{"sentence":"Muqtada al-Sadr is an Iraqi Shia cleric and politician.","translation":"ムクタダ・アル＝サドルは、イラクのシーア派の聖職者であり政治家です。"},{"sentence":"Sadr City is a district of Baghdad, Iraq.","translation":"サドル市は、イラクのバグダッドの一地区です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name Sadr (صدر) is of Arabic origin, meaning \"chest,\" \"breast,\" \"forefront,\" \"presidency,\" or \"leadership.\" It is often used as a surname indicating lineage or status.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɑːdər/","syllables":"Sa-dr"},"inflection":{},"usage_notes":{"explanation":"'Sadr' is primarily encountered as a surname or part of a place name, particularly in Middle Eastern contexts. It is most notably associated with the al-Sadr family in Iraq, a prominent Shia religious and political dynasty. When referring to individuals or locations, it is crucial to maintain proper capitalization.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_names":["Muqtada al-Sadr"],"related_places":["Sadr City"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily in specific geopolitical contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Sadr' is a proper noun, primarily used to refer to a specific family name or a place name, particularly in the Middle East. Understanding its usage requires familiarity with Middle Eastern politics and history, specifically the al-Sadr family in Iraq. The word is not commonly used in general English conversation, making it more relevant for those studying or discussing related topics."},"example_sentences":[{"sentence":"The Sadr movement has a significant following in Iraq.","translation":"サドル運動はイラクで大きな支持を得ています。","type":"noun","meaning_category":"Surname/Political Movement"},{"sentence":"Sadr City faces numerous challenges related to infrastructure and security.","translation":"サドル市は、インフラと治安に関連する多くの課題に直面しています。","type":"noun","meaning_category":"Place Name"}]}