{"word":"affrayer","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(archaic) One who makes an affray; a brawler.","english_definition":"A person who engages in an affray; a brawler or participant in a public brawl.","examples":[{"sentence":"The affrayers were quickly apprehended by the town guard.","translation":"騒乱を起こした者たちはすぐに町の警備兵に逮捕された。"},{"sentence":"In those days, affrayers were often punished severely.","translation":"当時、騒乱を起こした者はしばしば厳しく罰せられた。"}],"collocations":["public affrayer","notorious affrayer"],"synonyms":["brawler","rioter","troublemaker","fighter"],"antonyms":["peacekeeper","peacemaker"]}],"etymology":{"value":"Derived from 'affray' (a public fight or disturbance) + '-er' (suffix denoting a person who does something).","priority":"★★☆"},"pronunciation":{"ipa":"/əˈfreɪər/","syllables":"af-fray-er"},"inflection":{"noun_plural":"affrayers"},"usage_notes":{"explanation":"'Affrayer' is an archaic term, meaning someone who participates in an affray. An affray is a public fight or disturbance that breaches the peace. The term is rarely used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an affrayer of the law.","correct":"✓ He was a breaker of the law.","note":"'Affrayer' refers to someone involved in a public brawl, not someone who breaks laws in general."}],"priority":"★☆☆"},"related_words":{"derivatives":["affray (noun: a public fight or disturbance)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Archaic term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Affrayer' is a rarely used, archaic term. It refers to someone who participates in a public fight or disturbance (an affray). Due to its infrequent use, it is typically encountered only in historical contexts or legal discussions concerning historical terms."},"example_sentences":[{"sentence":"The court records identified him as a known affrayer.","translation":"裁判所の記録では、彼は有名な騒乱者として特定された。","type":"noun","meaning_category":"brawler"},{"sentence":"The town was known to have many affrayers among its youth.","translation":"その町は若者の間に多くの騒乱者がいることで知られていた。","type":"noun","meaning_category":"brawler"}]}