{"word":"Brosy","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(Slang) Describes something as being overly masculine, often in a stereotypical or exaggerated way.","english_definition":"(Slang) Characterized by or exhibiting traits associated with a 'bro' subculture, such as a focus on sports, partying, and a casual, often insensitive, attitude.","examples":[{"sentence":"That bar is really brosy; it's full of guys in baseball caps and sports jerseys.","translation":"あのバーはすごくブロシーだ。野球帽をかぶってスポーツジャージを着た男たちでいっぱいだ。"},{"sentence":"I don't really like brosy comedies; they're usually just full of crude jokes.","translation":"私はブロシーなコメディはあまり好きじゃない。たいてい下品なジョークばかりだから。"}],"collocations":["brosy bar","brosy culture","brosy attitude","brosy comedy"],"synonyms":["macho","jockish","dudely","fratty"],"antonyms":["sensitive","refined","intellectual"]}],"etymology":{"value":"Likely derived from 'bro,' a slang term for 'brother' or a close male friend, with the addition of '-sy' or '-y' to form an adjective.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbroʊzi/","syllables":"Bro-sy"},"inflection":{"adjective_forms":{"comparative":"more brosy","superlative":"most brosy"}},"usage_notes":{"explanation":"'Brosy' is a slang term, often used pejoratively, to describe something associated with a particular type of young, often white, male subculture. It implies a focus on superficial aspects of masculinity, such as physical appearance, sports, and partying, often at the expense of intellectual or emotional depth. It can be used to describe places, events, or even attitudes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a very brosy person, so he's really kind and caring.","correct":"✓ He's a very brosy person, so he's really into sports and partying.","note":"'Brosy' typically implies a focus on superficial masculinity, not necessarily kindness or caring."},{"incorrect":"✗ This wine is very brosy.","correct":"✓ This beer is very brosy.","note":"'Brosy' is usually applied to things associated with a certain male subculture. While technically you could use it to describe something unexpected, it's more commonly used with things like bars, clothing, or activities."}],"priority":"★★☆"},"related_words":{"derivatives":["bro (noun)","bro-code (noun)","brogrammer (noun)"],"phrases":["bro culture","that's so bro"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (Slang)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Brosy' is a slang adjective used to describe something that embodies the stereotypical characteristics of a 'bro' – a young man often associated with a particular subculture focused on sports, partying, and a casual, sometimes insensitive, attitude. It's often used in a critical or humorous way. Because it's slang, it's not appropriate for formal contexts. Understanding the cultural associations of 'bro' is key to understanding 'brosy.'"},"example_sentences":[{"sentence":"The golf course had a really brosy vibe; everyone was wearing polo shirts and talking loudly about their scores.","translation":"そのゴルフコースはすごくブロシーな雰囲気だった。みんなポロシャツを着て、スコアについて大声で話していた。","type":"adjective","meaning_category":"Overly masculine and stereotypical"},{"sentence":"I tried to watch that movie, but it was too brosy for me; the jokes were just too crude.","translation":"あの映画を見ようとしたけど、私にはブロシーすぎた。ジョークがあまりにも下品だった。","type":"adjective","meaning_category":"Associated with 'bro' culture"},{"sentence":"He's got a really brosy attitude; he only talks about sports and girls.","translation":"彼はすごくブロシーな態度だ。スポーツと女の子のことしか話さない。","type":"adjective","meaning_category":"Exhibiting traits of a 'bro'"}],"kanji":"N/A","katakana":"ブロシー"}