{"word":"Pooka","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(アイルランドの伝承)プーカ：動物の姿に変身する妖精。通常は黒い馬、ヤギ、ウサギ、犬、猫の姿で現れる。","english_definition":"(Irish folklore) A creature, typically a shape-shifting fairy, that can assume a variety of animal forms. Usually appears as a black horse, goat, rabbit, dog, or cat.","examples":[{"sentence":"The children were warned to stay away from the forest at night, for the Pooka was said to roam there.","translation":"子供たちは夜に森に近づかないように警告された。プーカがそこを徘徊すると言われていたからだ。"},{"sentence":"Some say the Pooka is mischievous, while others believe it to be a helpful spirit.","translation":"プーカはいたずら好きだと言う人もいれば、役に立つ精霊だと信じている人もいる。"}],"collocations":["black Pooka (黒いプーカ)","shape-shifting Pooka (姿を変えるプーカ)","mischievous Pooka (いたずら好きなプーカ)","helpful Pooka (役に立つプーカ)"],"synonyms":["fairy","spirit","goblin","phantom"],"antonyms":[]}],"etymology":{"value":"アイルランド語の「púca」に由来し、その語源は不明。一部では古ノルド語の「púki」（妖精、悪魔）との関連性が示唆されている。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpuːkə/","syllables":"Poo-ka"},"inflection":{"noun_plural":"Pookas"},"usage_notes":{"explanation":"「**Pooka**」は、アイルランドの伝承に登場する妖精の名前です。様々な動物の姿に変身するとされ、特に黒い馬の姿で現れることが多いです。プーカは、いたずら好きで気まぐれな性格を持つとされていますが、時には人間に助けを与えることもあると伝えられています。ハロウィーン（アイルランドではサウィン祭）の時期に活発になるとも言われています。現代のファンタジー作品やゲームなどにも登場することがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a pooka in my garden, it was very small and green.","correct":"✓ I saw a fairy/goblin in my garden, it was very small and green. / ✓ I saw a Pooka in my garden, it was in the form of a black cat.","note":"プーカはアイルランドの伝承に特有の妖精であり、一般的な妖精とは異なります。また、プーカは通常、特定の動物の姿（特に黒い馬）で現れるとされています。"},{"incorrect":"✗ Pookas are always evil.","correct":"✓ Pookas are often mischievous, but not always evil.","note":"プーカはいたずら好きであるとされていますが、必ずしも悪意があるわけではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["banshee (バンシー)","leprechaun (レプラコーン)","fairy (妖精)","Irish folklore (アイルランドの伝承)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常に特殊な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - アイルランドの伝承に詳しい人以外には馴染みのない単語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Pooka**」は、アイルランドの伝承に登場する妖精の名前です。動物の姿に変身する能力を持ち、特に黒い馬の姿で現れることが多いとされています。いたずら好きで気まぐれな性格を持つとされていますが、時には人間に助けを与えることもあると伝えられています。アイルランドの文化や伝承に興味がある人にとっては馴染みのある言葉かもしれませんが、一般的な英語学習者にとっては高度な語彙です。"},"example_sentences":[{"sentence":"Local legends told of a **Pooka** who would offer cryptic advice to travelers.","translation":"地元の伝説では、旅人に謎めいた助言を与えるプーカについて語られていた。","type":"noun","meaning_category":"妖精"},{"sentence":"The farmer claimed to have seen a **Pooka** in the form of a black goat near his fields.","translation":"その農夫は、畑の近くで黒いヤギの姿をしたプーカを見たと言った。","type":"noun","meaning_category":"妖精"},{"sentence":"Some believed that leaving out a bowl of milk would appease the **Pooka**.","translation":"牛乳を一杯置いておくとプーカが機嫌を直すと信じられていた。","type":"noun","meaning_category":"妖精"}]}