{"word":"Repolymerization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"重合体の再重合、重合体の再形成","english_definition":"The process of forming a polymer again from its constituent monomers or smaller polymer fragments.","examples":[{"sentence":"The repolymerization of the degraded plastic was achieved through a novel catalytic process.","translation":"分解されたプラスチックの再重合は、新規な触媒プロセスによって達成された。"},{"sentence":"Repolymerization can be used to create new polymers with different properties.","translation":"再重合は、異なる特性を持つ新しいポリマーを作成するために使用できる。"}],"collocations":["catalytic repolymerization","thermal repolymerization","repolymerization process","repolymerization reaction"],"synonyms":["polymer reformation","polymer regeneration","re-polymerization"],"antonyms":["depolymerization","degradation","decomposition"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning again) to 'polymerization'. Polymerization itself comes from 'polymer', which is from the Greek 'poly' (many) and 'meros' (part).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːpəˌlɪmərɪˈzeɪʃən/","syllables":"re-pol-y-mer-i-za-tion"},"inflection":{"noun_plural":"repolymerizations"},"usage_notes":{"explanation":"Repolymerization is a chemical process that reverses the effects of depolymerization. It is often used in the context of recycling or upcycling polymers, where the original polymer has been broken down into smaller units and then reformed into a new polymer. The properties of the repolymerized material can be the same as or different from the original polymer, depending on the process used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The repolymerization was cause by the heat.","correct":"✓ The repolymerization was caused by the heat.","note":"'Cause' should be 'caused' to form the passive voice correctly."},{"incorrect":"✗ Repolymerization is a process to break down polymers.","correct":"✓ Repolymerization is a process to build up polymers.","note":"Repolymerization builds up polymers, while depolymerization breaks them down."}],"priority":"★★☆"},"related_words":{"derivatives":["repolymerize (verb)"],"phrasal_verbs":[],"related_terms":["polymerization","depolymerization","polymer","monomer","oligomer","catalyst"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Repolymerization' refers to the process of reforming a polymer from its constituent parts, often after it has been broken down. It's a technical term primarily used in chemistry and materials science. Understanding requires knowledge of basic polymer chemistry concepts like monomers, polymers, and the process of polymerization itself. The prefix 're-' indicates the repetition or reversal of the polymerization process."},"example_sentences":[{"sentence":"The efficiency of the catalytic repolymerization process significantly impacts the yield of the recycled material.","translation":"触媒再重合プロセスの効率は、リサイクル材料の収量に大きく影響する。","type":"noun","meaning_category":"重合体の再重合"},{"sentence":"Research is focused on developing sustainable methods for the repolymerization of waste plastics.","translation":"研究は、廃プラスチックの再重合のための持続可能な方法の開発に焦点を当てている。","type":"noun","meaning_category":"重合体の再重合"}]}