{"word":"sleepmarken","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, possibly archaic) A mark left on the skin by sleeping, especially when pressed against something.","english_definition":"A temporary mark or impression left on the skin after sleeping, typically caused by pressure from bedding or clothing.","examples":[{"sentence":"She woke up with sleepmarken on her cheek from the wrinkles in the pillowcase.","translation":"彼女は枕カバーのしわで頬に寝跡をつけて目を覚ました。"}],"collocations":["have sleepmarken","pillow sleepmarken","facial sleepmarken"],"synonyms":["sleep crease","sleep line","pressure mark"],"antonyms":[]}],"etymology":{"value":"Likely a compound word combining \"sleep\" and \"marken\" (a diminutive or variant of \"mark\"). The word is rare and its etymology is speculative.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈsliːpˌmɑːrkən/","syllables":"sleep-mar-ken"},"inflection":{"noun_plural":"sleepmarkens"},"usage_notes":{"explanation":"This word is very rare and may not be recognized by many native English speakers. It is more common to use phrases like \"sleep creases\" or \"marks from sleeping.\"","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a sleepmarken on my arm because I slept on it.","correct":"✓ I have sleep creases on my arm because I slept on it.","note":"It is more natural to use the plural \"sleep creases\" or a phrase like \"marks from sleeping\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["sleep","mark"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"This is a very rare and obscure word. It is unlikely to be encountered in everyday English. Understanding it requires knowledge of archaic word formation and a good vocabulary. It is more common to use descriptive phrases instead.","priority":"☆☆☆"},"example_sentences":[{"sentence":"He had sleepmarken on his face from sleeping on the airplane.","translation":"彼は飛行機で寝たせいで顔に寝跡がついていた。","type":"noun","meaning_category":"寝跡"}]}