{"word":"Buddhaship","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"仏陀の位、仏陀の境地、成仏","english_definition":"The state of being a Buddha; the attainment of enlightenment.","examples":[{"sentence":"He attained Buddhaship after years of meditation.","translation":"彼は長年の瞑想の末に成仏した。"},{"sentence":"The ultimate goal of Buddhist practice is Buddhaship.","translation":"仏教の実践の最終目標は成仏である。"},{"sentence":"Many bodhisattvas vow to postpone their own Buddhaship to help others.","translation":"多くの菩薩は、他人を助けるために自身の成仏を延期することを誓う。"}],"collocations":["attain Buddhaship (成仏する)","reach Buddhaship (成仏する)","achieve Buddhaship (成仏する)","the path to Buddhaship (成仏への道)","the goal of Buddhaship (成仏の目標)"],"synonyms":["enlightenment","nirvana","awakening","satori","bodhi"],"antonyms":["delusion","ignorance","suffering"]},{"part_of_speech":"noun","definition":"仏陀であることの性質や状態","english_definition":"The nature or condition of being a Buddha.","examples":[{"sentence":"Buddhaship is characterized by wisdom and compassion.","translation":"仏陀の境地は、智慧と慈悲によって特徴づけられる。"},{"sentence":"The concept of Buddhaship varies among different Buddhist traditions.","translation":"成仏の概念は、さまざまな仏教の伝統によって異なる。"}],"collocations":["the qualities of Buddhaship (成仏の資質)","the nature of Buddhaship (成仏の性質)"],"synonyms":["Buddha-nature","Buddha-essence","enlightened state"],"antonyms":["unenlightened state"]}],"etymology":{"value":"\"Buddha\" + \"-ship\". \"Buddha\" comes from Sanskrit \"buddha\" (awakened), the past participle of the verb \"budh-\" (to awaken, know, perceive). The suffix \"-ship\" denotes a state, condition, or office. Therefore, \"Buddhaship\" literally means \"the state of being awakened\" or \"the state of being a Buddha.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʊdəʃɪp/","syllables":"Bud-dha-ship"},"inflection":{"noun_plural":"Buddhaships (rarely used)"},"usage_notes":{"explanation":"\"Buddhaship\" refers to the ultimate goal in Buddhism, the state of complete enlightenment and liberation from suffering. It is a state of perfect wisdom, compassion, and understanding. The term is often used in the context of Buddhist teachings, practices, and philosophy. While technically a noun, it often functions as an abstract concept rather than a countable object.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He will Buddhaship soon.","correct":"✓ He will attain Buddhaship soon.","note":"\"Buddhaship\" is a noun, so it needs a verb such as \"attain,\" \"achieve,\" or \"reach\" to form a complete sentence. You cannot directly verb \"Buddhaship.\""},{"incorrect":"✗ Buddhaship is a person.","correct":"✓ Buddhaship is a state of being.","note":"\"Buddhaship\" is not a person but a state of enlightenment or the condition of being a Buddha. It is an abstract concept."}],"priority":"★★☆"},"related_words":{"derivatives":["Buddha","Buddhist","Buddhism","bodhisattva"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in religious or philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Buddhaship\" is a term primarily used in Buddhist contexts. It refers to the state of being a Buddha, which is the ultimate goal in Buddhism. This state is characterized by complete enlightenment, wisdom, and compassion. The term is often found in religious texts, philosophical discussions, and teachings related to Buddhism. It is not commonly used in everyday conversation. Understanding the concept requires familiarity with Buddhist principles and terminology."},"example_sentences":[{"sentence":"Through diligent practice, one can hope to achieve **Buddhaship**.","translation":"勤勉な実践を通して、人は成仏を達成することを願うことができる。","type":"noun","meaning_category":"成仏の境地"},{"sentence":"The teachings of the Buddha guide followers on the path to **Buddhaship**.","translation":"仏陀の教えは、信者を成仏への道へと導く。","type":"noun","meaning_category":"成仏の境地"},{"sentence":"Many believe that **Buddhaship** is the end of suffering and the beginning of true happiness.","translation":"多くの人は、成仏が苦しみの終わりであり、真の幸福の始まりであると信じている。","type":"noun","meaning_category":"成仏の境地"}]}