{"word":"quasi-cordially","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"表面上は友好的に、一見すると親しげに","english_definition":"in a seemingly cordial or friendly manner; outwardly appearing to be cordial but perhaps not genuinely so.","examples":[{"sentence":"He greeted her quasi-cordially, though he secretly resented her success.","translation":"彼は彼女の成功を内心では妬んでいたが、表面上は親しげに彼女に挨拶した。"},{"sentence":"The two leaders shook hands quasi-cordially for the cameras, despite their deep-seated political differences.","translation":"二人の指導者は根深い政治的意見の相違があったにもかかわらず、カメラの前では一見友好的に握手をした。"}],"collocations":["greet quasi-cordially","behave quasi-cordially","shake hands quasi-cordially"],"synonyms":["seemingly cordially","apparently cordially","outwardly cordially","superficially cordially","ostensibly cordially"],"antonyms":["genuinely cordially","sincerely cordially","truly cordially","heartily cordially"]}],"etymology":{"value":"The word is formed by combining \"quasi-\" (meaning \"resembling\" or \"seemingly\") with \"cordially\" (meaning \"in a cordial manner\"). \"Cordially\" comes from \"cordial,\" which is derived from the Latin word \"cor,\" meaning \"heart.\" Thus, \"quasi-cordially\" implies something that resembles being from the heart, but isn't truly so.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪˈkɔːrdiəli/","syllables":"quasi-cor-dial-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Quasi-cordially\" is used to describe actions or behaviors that appear friendly or cordial on the surface but may lack genuine warmth or sincerity. It suggests a pretense of cordiality, often masking underlying feelings of indifference, resentment, or animosity. The adverb is relatively rare and is typically used in formal or literary contexts to convey a nuanced understanding of social interactions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted quasi cordial.","correct":"✓ He acted quasi-cordially.","note":"The adverbial form \"quasi-cordially\" is required to modify the verb \"acted.\" The adjective \"cordial\" cannot be used directly in this context."},{"incorrect":"✗ She quasi-cordially felt about his success.","correct":"✓ She greeted him quasi-cordially because of his success.","note":"\"Quasi-cordially\" describes *how* an action is performed, not *what* is felt. It modifies verbs of action, not verbs of feeling."}],"priority":"★★☆"},"related_words":{"derivatives":["quasi (adverb/prefix: seemingly, almost)","cordial (adjective: warm and friendly)","cordiality (noun: sincere affection and kindness)"],"antonyms":["genuinely","sincerely","truly","heartily"],"synonyms":["apparently","seemingly","ostensibly","superficially"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"quasi-cordially\" is a sophisticated adverb used to describe an action performed in a manner that appears friendly or warm but lacks genuine sincerity. It's a relatively rare term, typically found in formal writing or speech, and requires a good understanding of both \"quasi-\" (meaning \"seemingly\" or \"almost\") and \"cordially\" (meaning \"warmly and sincerely\"). The word is best used when you want to convey a sense of superficial friendliness or a pretense of warmth. It is not a common word and is more likely to be encountered in literature or advanced academic texts."},"example_sentences":[{"sentence":"The host greeted his guests quasi-cordially, masking his exhaustion from the long day.","translation":"主催者は長い一日の疲れを隠し、表面上は親しげに客を迎えた。","type":"general"},{"sentence":"Despite their rivalry, the two athletes congratulated each other quasi-cordially after the match.","translation":"ライバル関係にもかかわらず、試合後、二人の選手は一見友好的に互いを祝福した。","type":"general"},{"sentence":"The politician smiled quasi-cordially at his opponent during the debate, though he disagreed with everything he said.","translation":"政治家は討論中、相手の発言全てに反対だったが、表面上は友好的な笑みを浮かべた。","type":"general"}]}