{"word":"interfertility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"異種交配性、異種交配可能度","english_definition":"The ability of different species or populations to interbreed and produce fertile offspring.","examples":[{"sentence":"The high interfertility between these two subspecies suggests they should be reclassified as a single species.","translation":"これら2つの亜種間の高い異種交配性は、それらが単一の種として再分類されるべきであることを示唆している。"},{"sentence":"Studies of interfertility can help determine evolutionary relationships between different groups of organisms.","translation":"異種交配性の研究は、異なる生物群間の進化的関係を決定するのに役立つ。"}],"collocations":["high interfertility","low interfertility","measure interfertility","assess interfertility","study interfertility","interspecific interfertility"],"synonyms":["cross-fertility","crossability","hybridization compatibility"],"antonyms":["reproductive isolation","sterility","incompatibility"]}],"etymology":{"value":"Formed from 'inter-' (between) + 'fertility' (the ability to reproduce).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərfərˈtɪləti/","syllables":"in-ter-fer-til-i-ty"},"inflection":{"noun_plural":"interfertilities"},"usage_notes":{"explanation":"'Interfertility' is a term used primarily in biology, genetics, and evolutionary studies. It describes the extent to which different populations or species can successfully breed with each other and produce viable, fertile offspring. High interfertility suggests a close evolutionary relationship, while low or absent interfertility indicates significant reproductive isolation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The interfertility of the two plants was sterile.","correct":"✓ The offspring of the two plants were sterile, indicating low interfertility.","note":"'Interfertility' refers to the *ability* to interbreed, not the state of the offspring. Use 'sterility' to describe the offspring's inability to reproduce."},{"incorrect":"✗ Interfertility is when two species look alike.","correct":"✓ Interfertility is the ability of two species to interbreed.","note":"Interfertility is about reproductive compatibility, not physical similarity."}],"priority":"★★☆"},"related_words":{"derivatives":["interfertile (adjective)"],"related_terms":["species","hybrid","fertility","reproductive isolation","speciation","evolution","genetics","crossbreeding","hybrid vigor","hybrid breakdown"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - a technical term used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Interfertility' is a specialized term used in biology to describe how easily different groups of organisms can breed together and have babies that can also have babies. If two groups have high 'interfertility,' it means they can breed together easily and their offspring are fertile. If they have low 'interfertility,' it means they either can't breed together or their offspring are infertile. This term is important for understanding how different species evolve and how closely related they are."},"example_sentences":[{"sentence":"The degree of **interfertility** between closely related plant species can provide insights into their evolutionary history.","translation":"近縁の植物種間の異種交配の程度は、それらの進化の歴史への洞察を提供することができる。","type":"general","meaning_category":"異種交配性"},{"sentence":"Researchers are investigating the **interfertility** of different strains of bacteria to understand horizontal gene transfer.","translation":"研究者たちは、水平遺伝子伝達を理解するために、さまざまな細菌株の異種交配性を調査している。","type":"scientific","meaning_category":"異種交配性"},{"sentence":"The successful creation of fertile hybrids demonstrates the **interfertility** between these two animal populations.","translation":"肥沃なハイブリッドの作成の成功は、これら2つの動物個体群間の異種交配性を示している。","type":"biological","meaning_category":"異種交配性"}]}