{"word":"steatomatous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"脂肪腫性の、脂肪腫に似た","english_definition":"Relating to or resembling a steatoma (a benign tumor of the sebaceous glands).","examples":[{"sentence":"The patient presented with a steatomatous cyst on his scalp.","translation":"患者は頭皮に脂肪腫性の嚢胞を呈した。"},{"sentence":"Histological examination revealed steatomatous changes in the tissue sample.","translation":"組織学的検査により、組織サンプルに脂肪腫性の変化が認められた。"}],"collocations":["steatomatous cyst","steatomatous tumor","steatomatous changes"],"synonyms":["sebaceous","lipomatous"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'steatoma' (στέατωμα), meaning 'tumor containing fat,' which comes from 'stear' (στέαρ), meaning 'hard fat' or 'tallow'. The suffix '-atous' indicates 'characterized by' or 'resembling'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌstiːætəˈməʊtəs/","syllables":"stee-at-o-ma-tous"},"inflection":{"notes":"This is an adjective, so it can have comparative and superlative forms, though they are rarely used: more steatomatous, most steatomatous."},"usage_notes":{"explanation":"'Steatomatous' is a medical term used to describe something that is related to or resembles a steatoma. It is typically used in the context of describing cysts, tumors, or tissue changes that have a fatty or sebaceous nature. It is a relatively uncommon word, primarily used within medical or scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The growth was steatoma.","correct":"✓ The growth was steatomatous.","note":"'Steatoma' is a noun (the tumor itself), while 'steatomatous' is the adjective describing something related to or resembling a steatoma."}],"priority":"★☆☆"},"related_words":{"derivatives":["steatoma (noun: a benign tumor of the sebaceous glands)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'steatomatous' is a highly specialized medical term. It is used to describe conditions or growths that are related to or resemble steatomas, which are benign tumors of the sebaceous glands. Due to its specific and technical nature, it is rarely encountered outside of medical literature or professional healthcare settings. Understanding the root word 'steatoma' and the suffix '-atous' can aid in deciphering its meaning."},"example_sentences":[{"sentence":"The dermatologist diagnosed the lesion as a steatomatous nevus.","translation":"皮膚科医はその病変を脂肪腫性の母斑と診断した。","type":"general","meaning_category":"medical"},{"sentence":"Microscopic analysis showed steatomatous proliferation within the cyst wall.","translation":"顕微鏡分析により、嚢胞壁内に脂肪腫性の増殖が認められた。","type":"technical","meaning_category":"medical"}]}