{"word":"cloakage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The charge for cloaking or keeping goods in a warehouse.","english_definition":"A charge or fee for storing goods, especially in a warehouse or similar facility.","examples":[{"sentence":"The cloakage fees were higher than expected due to the increased volume of goods.","translation":"商品の量が増えたため、倉庫保管料は予想以上に高くなった。"},{"sentence":"We need to factor in cloakage when calculating the total cost of distribution.","translation":"流通の総費用を計算する際には、倉庫保管料を考慮に入れる必要があります。"}],"collocations":["cloakage fees","warehouse cloakage","storage cloakage"],"synonyms":["storage fee","warehousing charge","storage charge"],"antonyms":[]}],"etymology":{"value":"Derived from 'cloak' (to cover or conceal) and '-age' (denoting a charge or service).","priority":"★★★"},"pronunciation":{"ipa":"ˈkləʊkɪdʒ","syllables":"clo-ak-age"},"inflection":{"noun_plural":"cloakages"},"usage_notes":{"explanation":"'Cloakage' specifically refers to the cost associated with storing goods, particularly in a warehousing context. It's a term often used in logistics, supply chain management, and accounting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cloakage was used to hide the goods.","correct":"✓ The cloakage fee was charged for storing the goods.","note":"'Cloakage' refers to the fee, not the act of hiding or covering goods."}],"priority":"★★★"},"related_words":{"derivatives":["cloak (verb/noun)","cloaked (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Cloakage' is a specialized term primarily used in business and logistics contexts to refer to the fees associated with storing goods in a warehouse or similar facility. Understanding this term requires familiarity with warehousing and supply chain operations."},"example_sentences":[{"sentence":"The company's annual report detailed the expenses for cloakage and transportation.","translation":"会社の年次報告書には、倉庫保管料と輸送費の詳細が記載されていた。","type":"noun","meaning_category":"Storage charge"},{"sentence":"Negotiating lower cloakage rates is crucial for reducing overall logistics costs.","translation":"倉庫保管料の引き下げ交渉は、全体的な物流コスト削減に不可欠である。","type":"noun","meaning_category":"Storage charge"}]}