{"word":"trienniality","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"3年ごとの発生、3年間隔","english_definition":"The state or quality of occurring every three years; a period of three years.","examples":[{"sentence":"The trienniality of the festival made it a much-anticipated event.","translation":"その祭りは3年ごとの開催だったので、非常に待ち望まれるイベントとなった。"},{"sentence":"The trienniality of the report allowed for a comprehensive review of long-term trends.","translation":"その報告書は3年ごとの発行だったので、長期的な傾向を包括的に見直すことができた。"}],"collocations":["trienniality of elections","trienniality of meetings","trienniality of reports"],"synonyms":["three-year interval","three-year cycle"],"antonyms":["annual","biennial"]}],"etymology":{"value":"Derived from 'triennial', which comes from the Latin 'triennium' (a period of three years), formed from 'tri-' (three) + 'annus' (year). The suffix '-ity' is added to form a noun denoting a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtraɪˌɛniˈæləti/","syllables":"tri-en-ni-al-i-ty"},"inflection":{"noun_plural":"triennialities"},"usage_notes":{"explanation":"'Trienniality' refers specifically to the characteristic of something happening every three years or the duration of three years. It is relatively uncommon compared to 'triennial' (the adjective).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The trienniality event was a success.","correct":"✓ The triennial event was a success.","note":"Use 'triennial' as an adjective to describe the event, not 'trienniality' (the noun)."},{"incorrect":"✗ He measured the trienniality of the project.","correct":"✓ He measured the duration of the project's triennial cycle.","note":"'Trienniality' describes the *quality* of being triennial, not the length of time directly. Use 'duration' or rephrase to emphasize the three-year cycle."}],"priority":"★★☆"},"related_words":{"derivatives":["triennial (adjective, noun)","triennially (adverb)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Trienniality' is a formal and rare word referring to the state or quality of occurring every three years. It is most often used in academic or formal contexts when discussing recurring events or cycles that happen on a three-year basis. Because of its specificity and low frequency, it is generally used by advanced English speakers in specialized fields."},"example_sentences":[{"sentence":"The university celebrated the trienniality of its research symposium with a special gala.","translation":"大学は研究シンポジウムの3年ごとの開催を記念して、特別な祝賀会を開催した。","type":"noun","meaning_category":"3年ごとの発生"},{"sentence":"The significance of the data was understood only after observing the trienniality of the climate patterns.","translation":"そのデータの重要性は、気候パターンの3年間隔を観察して初めて理解された。","type":"noun","meaning_category":"3年間隔"}]}