{"word":"Emagram","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"An aerological diagram used in meteorology to display the vertical profile of temperature and humidity in the atmosphere.","english_definition":"A type of thermodynamic diagram used by meteorologists to plot and analyze atmospheric soundings, displaying temperature and humidity as functions of pressure.","examples":[{"sentence":"The emagram showed a stable atmospheric layer.","translation":"エマグラムは安定した大気層を示していた。"},{"sentence":"Using the emagram, we can determine the convective available potential energy (CAPE).","translation":"エマグラムを使って、対流有効位置エネルギー（CAPE）を決定できます。"}],"collocations":["plot an emagram","analyze an emagram","stable emagram","unstable emagram"],"synonyms":["Skew-T log-P diagram","Stüve diagram","tephigram"],"antonyms":[]}],"etymology":{"value":"The term 'emagram' is derived from 'energy per mass diagram'.","priority":"★★★"},"pronunciation":{"ipa":"ˈeməˌɡræm","syllables":"E-ma-gram"},"inflection":{"noun_plural":"emagrams"},"usage_notes":{"explanation":"An emagram is a specific type of thermodynamic diagram used to assess atmospheric stability and potential for convection. It plots temperature and dew point temperature against pressure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a barometer instead of an emagram.","correct":"✓ I used an emagram to analyze the atmospheric conditions.","note":"An emagram is a type of diagram, not an instrument. A barometer measures atmospheric pressure."}],"priority":"★★☆"},"related_words":{"derivatives":["adiabatic","isotherm","sounding","convection"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"An emagram is a specialized meteorological tool used by professionals to analyze atmospheric conditions. Understanding it requires knowledge of thermodynamics and meteorology. It is not commonly used outside of these fields."},"example_sentences":[{"sentence":"The meteorologist used the emagram to predict thunderstorm development.","translation":"気象学者はエマグラムを使って雷雨の発生を予測した。","type":"noun","meaning_category":"aerological diagram"},{"sentence":"The emagram clearly showed a temperature inversion.","translation":"エマグラムは明らかに気温の逆転を示していた。","type":"noun","meaning_category":"aerological diagram"}]}