{"word":"Fagin","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(文学) チャールズ・ディケンズの小説『オリバー・ツイスト』に登場する、悪党の親玉であるユダヤ人の老人。転じて、子供たちを犯罪に利用するような悪賢い大人を指す。","english_definition":"(Literature) A character in Charles Dickens' novel *Oliver Twist*: an elderly Jewish criminal who is the leader of a gang of child thieves. By extension, a cunning and unscrupulous adult who exploits children for criminal purposes.","examples":[{"sentence":"Fagin is one of Dickens' most controversial characters.","translation":"フェイギンはディケンズの最も物議を醸すキャラクターの一人です。"},{"sentence":"The local gang leader was described as a modern-day Fagin.","translation":"地元のギャングのリーダーは、現代のフェイギンのようだと評された。"}],"collocations":["a modern-day Fagin (現代のフェイギンのような人)","Fagin-like (フェイギンのような)"],"synonyms":["exploiter","criminal mastermind"],"antonyms":[]}],"etymology":{"value":"チャールズ・ディケンズの小説『オリバー・ツイスト』に登場するキャラクター名に由来する。ディケンズは、このキャラクターを創造するにあたり、当時のロンドンの貧困層や犯罪組織の実態を反映させたとされる。","priority":"★★★"},"pronunciation":{"ipa":"/ˈfeɪɡɪn/","syllables":"Fa-gin"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"「**Fagin**」は、主に文学作品のキャラクター名として知られています。しかし、比喩的に、子供を犯罪に巻き込むような悪質な大人を指す言葉としても使われます。ただし、この言葉は、オリジナルのキャラクターがユダヤ人であったことから、人種差別的な意味合いを含む可能性があるため、使用には注意が必要です。文脈によっては、別の言葉で言い換える方が適切でしょう。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a fagin for money.","correct":"✓ He is greedy for money. / ✓ He is unscrupulous.","note":"`fagin` は人名由来の言葉であり、直接的な形容詞として「～に貪欲な」という意味では使われません。より一般的な形容詞や名詞で表現しましょう。"},{"incorrect":"✗ She is a fagin of children.","correct":"✓ She exploits children. / ✓ She uses children for her own gain.","note":"`fagin` は、子供を搾取する人を指す名詞として使われますが、直接的な所有関係を示す表現は不自然です。動詞を使って、搾取行為を具体的に表現する方が適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Fagin-like (形容詞: フェイギンのような、子供を搾取するような)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (文学作品に関する知識が必要)","frequency_google_ngram":"低頻度 (Low frequency) - 一般的な会話ではあまり使われない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Fagin**」は、チャールズ・ディケンズの小説『オリバー・ツイスト』に出てくる悪役の名前です。物語を知らない人には意味が通じにくいかもしれません。比喩として、子供を犯罪に利用するような悪い大人を指すこともありますが、差別的な意味合いを含む可能性があるので、使うときは注意が必要です。普段の会話ではあまり使いませんが、文学や社会問題を議論するときに出てくることがあります。"},"example_sentences":[{"sentence":"The journalist exposed the sweatshop owner as a modern-day **Fagin**.","translation":"そのジャーナリストは、搾取工場経営者を現代のフェイギンのように暴露した。","type":"noun","meaning_category":"比喩的な意味"},{"sentence":"The character of **Fagin** has been criticized for perpetuating anti-Semitic stereotypes.","translation":"フェイギンのキャラクターは、反ユダヤ主義的な固定観念を永続させているとして批判されてきた。","type":"noun","meaning_category":"キャラクター名"},{"sentence":"The movie adaptation toned down the more controversial aspects of **Fagin**'s character.","translation":"映画化にあたり、フェイギンのキャラクターの物議を醸す側面は弱められた。","type":"noun","meaning_category":"キャラクター名"}]}