{"word":"agglutinationist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"膠着主義者、膠着語を用いる人","english_definition":"A person who believes in or advocates agglutination, especially in linguistics.","examples":[{"sentence":"As an agglutinationist, he studied Turkish grammar extensively.","translation":"膠着主義者として、彼はトルコ語の文法を広範囲に研究した。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"膠着主義の、膠着語的な","english_definition":"Relating to or characterized by agglutination, especially in linguistics.","examples":[{"sentence":"The agglutinationist nature of the language made it easy to form new words.","translation":"その言語の膠着語的な性質は、新しい単語を簡単に形成することを可能にした。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'agglutination' (the process of sticking things together) + '-ist' (a suffix denoting a person who believes in or practices something).","priority":"★★★"},"pronunciation":{"ipa":"/əˌɡluːtɪˈneɪʃənɪst/","syllables":"ag-glu-ti-na-tion-ist"},"inflection":{"noun_plural":"agglutinationists"},"usage_notes":{"explanation":"The term 'agglutinationist' is primarily used in the field of linguistics to describe someone who studies or advocates for agglutinative languages. These are languages where words are formed by stringing together distinct morphemes (meaningful units), each with a clear function.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["agglutination","agglutinative"],"related_terms":["linguistics","morphology","morpheme"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'agglutinationist' is a specialized term primarily used within the field of linguistics. It refers to someone who studies or supports the concept of agglutination, which is a linguistic process where words are formed by combining morphemes (the smallest units of meaning) in a linear sequence. This term is not commonly used in everyday conversation and is more likely to appear in academic or technical contexts related to language studies."},"example_sentences":[{"sentence":"The professor, an avowed agglutinationist, dedicated his career to studying Uralic languages.","translation":"その教授は、自称膠着主義者であり、ウラル語族の研究にキャリアを捧げた。","type":"noun","meaning_category":"膠着主義者"},{"sentence":"The researcher presented an agglutinationist analysis of the verb conjugations in Quechua.","translation":"その研究者は、ケチュア語の動詞活用に関する膠着語的な分析を発表した。","type":"adjective","meaning_category":"膠着主義の"}]}