{"word":"Haulers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"運搬業者、輸送業者","english_definition":"Companies or individuals engaged in the business of transporting goods or materials.","examples":[{"sentence":"The construction company hired several haulers to transport the building materials.","translation":"建設会社は、建築資材を輸送するために数社の運搬業者を雇いました。"},{"sentence":"Waste haulers collect garbage and recycling from residential areas.","translation":"廃棄物運搬業者は、住宅地からゴミやリサイクル品を収集します。"}],"collocations":["waste haulers (廃棄物運搬業者)","freight haulers (貨物運搬業者)","bulk haulers (ばら積み運搬業者)"],"synonyms":["carriers","transporters","shippers","truckers"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'haul,' meaning to pull or drag with effort. The suffix '-er' is added to denote someone who performs the action of hauling.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɔːlər/","syllables":"haul-ers"},"inflection":{"noun_plural":"Haulers"},"usage_notes":{"explanation":"'Haulers' typically refers to businesses or individuals that specialize in the transportation of goods, often using trucks or other large vehicles. It can also refer to the vehicles themselves. The term is commonly used in industries such as construction, waste management, and logistics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hauler delivered the goods on foot.","correct":"✓ The hauler delivered the goods by truck.","note":"Haulers typically use vehicles for transportation, so specifying delivery on foot would be unusual."},{"incorrect":"✗ Haulers are only for small packages.","correct":"✓ Haulers can transport a wide range of goods, including large and heavy items.","note":"Haulers are often associated with transporting large or bulk items, not just small packages."}],"priority":"★★☆"},"related_words":{"derivatives":["haul (verb, noun)","hauling (gerund, participle)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Haulers' refers to companies or individuals that transport goods or materials as a business. It is often used in the context of industries like construction, waste management, and logistics. Understanding this term requires familiarity with business and transportation vocabulary.","example_sentences":[]},"example_sentences":[{"sentence":"Heavy equipment haulers are essential for moving machinery to construction sites.","translation":"重機運搬業者は、建設現場に機械を移動させるために不可欠です。","type":"noun","meaning_category":"運搬業者"},{"sentence":"The city contracts with several waste haulers to manage garbage collection.","translation":"市は、ゴミ収集を管理するために数社の廃棄物運搬業者と契約しています。","type":"noun","meaning_category":"運搬業者"}]}