{"word":"Buchmanism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"ブッフマン主義（道徳再武装運動（MRA）の前身）","english_definition":"The religious and political ideology founded by Frank Buchman in the early 20th century, emphasizing personal moral transformation as the key to societal change; a precursor to the Moral Re-Armament (MRA) movement.","examples":[{"sentence":"Buchmanism was controversial due to its emphasis on personal confession and its perceived association with right-wing political figures.","translation":"ブッフマン主義は、個人の告白を重視することと、右翼の政治家との関係があると思われたために、物議を醸した。"},{"sentence":"The core tenets of Buchmanism included the Four Absolutes: absolute honesty, absolute purity, absolute unselfishness, and absolute love.","translation":"ブッフマン主義の中核となる教義には、四つの絶対が含まれていた。絶対的な正直さ、絶対的な純粋さ、絶対的な無私無欲さ、そして絶対的な愛である。"}],"collocations":["Four Absolutes","Moral Re-Armament (MRA)","Frank Buchman","personal transformation","societal change"],"synonyms":["Moral Re-Armament (MRA) (later name)"],"antonyms":[]}],"etymology":{"value":"Named after its founder, Frank Buchman (1878-1961), an American evangelical Christian leader. The suffix '-ism' denotes a doctrine, principle, or ideology.","priority":"中"},"pronunciation":{"ipa":"/ˈbʊkmənɪzəm/","syllables":"Buck-man-i-sm"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Buchmanism is primarily of historical interest. It's important to note that the movement evolved into Moral Re-Armament (MRA), which is the more commonly known term. When discussing the period before the name change, or specifically referring to Buchman's original teachings, 'Buchmanism' is the appropriate term.","priority":"中"},"common_mistakes":{"examples":[],"priority":"低"},"related_words":{"derivatives":["Buchmanite (noun: a follower of Buchmanism)","Moral Re-Armament (MRA) (related movement)"],"priority":"中"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"低"},"readability_explanation":{"level":"C2","text":"The term 'Buchmanism' refers to a specific historical movement with complex religious and political implications. Understanding requires familiarity with 20th-century religious history and political ideologies. It is not a term commonly encountered in everyday language."},"example_sentences":[{"sentence":"Historians often debate the legacy of Buchmanism and its influence on post-war European politics.","translation":"歴史家は、ブッフマン主義の遺産と、戦後のヨーロッパ政治への影響についてしばしば議論する。"},{"sentence":"Critics of Buchmanism pointed to its simplistic solutions to complex social problems.","translation":"ブッフマン主義の批評家は、複雑な社会問題に対する単純すぎる解決策を指摘した。"}]}