{"word":"banian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ガジュマルの木","english_definition":"An Indian fig tree whose branches produce aerial roots that eventually become accessory trunks.","examples":[{"sentence":"The banian tree provided shade for the travelers.","translation":"ガジュマルの木は旅行者たちに日陰を提供した。"}],"collocations":["banian tree","Indian banian"],"synonyms":["banyan","Indian fig tree","Ficus benghalensis"],"antonyms":[]}],"etymology":{"value":"From Gujarati 'vaniyan', meaning 'merchant', from Sanskrit 'vanij', also meaning 'merchant'. Early European traders often met under the shade of these trees in India.","priority":"★★☆"},"pronunciation":{"ipa":"ˈbænjən/","syllables":"ban-yan"},"inflection":{"noun_plural":"banians"},"usage_notes":{"explanation":"The term 'banian' is primarily used to refer to the specific type of fig tree, Ficus benghalensis, known for its prop roots that descend from branches and eventually root into the soil to form additional trunks. These trees can grow to cover a very large area.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a lot of banians in the forest.","correct":"✓ I saw a lot of banyan trees in the forest.","note":"While 'banian' is technically correct, it's more common to say 'banyan tree' for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["banyan (alternative spelling)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Banian' refers to a specific type of fig tree, Ficus benghalensis, characterized by its aerial prop roots that develop into secondary trunks. Understanding the term requires some botanical knowledge. It's not a commonly used word outside of specific contexts related to botany or regions where these trees are prevalent."},"example_sentences":[{"sentence":"The ancient banian tree covered nearly an acre of land.","translation":"その古代のガジュマルの木は約1エーカーの土地を覆っていた。","type":"noun","meaning_category":"tree"},{"sentence":"Local villagers often gather under the banian for community meetings.","translation":"地元の村人たちは、コミュニティの会合のためにガジュマルの木の下に集まることが多い。","type":"noun","meaning_category":"tree"}]}