{"word":"non-dispersive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非分散性の","english_definition":"Not exhibiting dispersion; characterized by a lack of dispersion.","examples":[{"sentence":"The fiber optic cable is designed to be non-dispersive at a specific wavelength.","translation":"その光ファイバーケーブルは、特定の波長で非分散性になるように設計されています。"},{"sentence":"A non-dispersive medium allows waves to propagate without spreading or changing shape.","translation":"非分散媒質では、波は広がりや形状の変化なしに伝播できます."}],"collocations":["non-dispersive infrared (NDIR)","non-dispersive medium","non-dispersive element"],"synonyms":["uniform","homogeneous"],"antonyms":["dispersive"],"related_terms":["dispersion","refraction","wavelength"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'dispersive'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒn dɪˈspɜːsɪv/","syllables":"non-di-spen-sive"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'non-dispersive' is commonly used in physics, optics, and engineering to describe materials or systems where the speed of a wave (e.g., light or sound) is independent of its frequency or wavelength. This means that different frequency components of the wave will travel at the same speed, preventing the wave from spreading out or changing shape as it propagates.","priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Technical term.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Non-dispersive' is a technical term primarily used in physics and engineering. It describes a situation where waves travel through a medium without their different frequency components spreading out. Understanding this term requires some background knowledge of wave propagation and dispersion."},"example_sentences":[{"sentence":"The material is designed to be non-dispersive for terahertz radiation.","translation":"その材料は、テラヘルツ波に対して非分散性になるように設計されています。","type":"general","meaning_category":"physics"},{"sentence":"Non-dispersive infrared (NDIR) sensors are used for gas detection.","translation":"非分散型赤外線 (NDIR) センサーは、ガス検出に使用されます。","type":"specific","meaning_category":"engineering"}]}