{"word":"Assythment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(Scots law) Compensation due to the relatives of a murdered person, from the murderer.","english_definition":"In Scots law, the compensation due to the relatives of a murdered person from the murderer.","examples":[{"sentence":"The court ordered the murderer to pay assythment to the victim's family.","translation":"裁判所は殺人犯に、被害者の家族へのアセスメントの支払いを命じた。"},{"sentence":"Assythment aims to provide some financial redress for the loss suffered by the bereaved.","translation":"アセスメントは、遺族が被った損失に対して、いくらかの金銭的な補償を提供することを目的としている。"}],"collocations":["pay assythment","claim assythment","award assythment"],"synonyms":["compensation","reparation","damages"],"antonyms":[]}],"etymology":{"value":"From Scots *assythment*, from Middle English *assithen*, *assithenment* ('satisfaction, amends'), from *sithen* ('to reconcile, satisfy, make amends'), from Old English *siþian* ('to make amends, atone'), from Proto-Germanic *sōþijaną* ('to reconcile, appease').","priority":"★★☆"},"pronunciation":{"ipa":"/əˈsaɪθmənt/","syllables":"as-syth-ment"},"inflection":{"noun_plural":"assythments"},"usage_notes":{"explanation":"\"Assythment\" is a term specific to Scots law, referring to the monetary compensation payable to the relatives of a murder victim by the perpetrator. It is distinct from other forms of compensation and is intended to address the emotional and financial hardship caused by the loss of life. It is an archaic term and not commonly used in modern legal contexts outside of historical or academic discussions of Scots law.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company paid assythment for the accident.","correct":"✓ The company paid damages for the accident.","note":"Assythment specifically applies to murder cases under Scots law, not general accidents."}],"priority":"★★☆"},"related_words":{"derivatives":[],"legal_terms":["damages","reparation","solatium"],"related_concepts":["Scots law","murder","compensation"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - primarily found in legal texts related to Scots law.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Assythment\" is a highly specialized term within Scots law, referring to a specific type of compensation paid to relatives of a murder victim by the murderer. Understanding this term requires familiarity with Scots legal terminology and historical context. It is not part of common English vocabulary and is primarily encountered in legal documents or academic discussions of Scots law. Therefore, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"Historical records show that assythment was often negotiated between families rather than determined by the courts.","translation":"歴史的記録によると、アセスメントは裁判所によって決定されるよりも、家族間で交渉されることが多かった。","type":"noun","meaning_category":"compensation"},{"sentence":"The concept of assythment reflects a traditional emphasis on familial responsibility and reconciliation in Scots law.","translation":"アセスメントの概念は、スコットランド法における家族の責任と和解を重視する伝統を反映している。","type":"noun","meaning_category":"compensation"}]}