{"word":"unfiery","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"炎のように激しくない、情熱的でない、熱烈でない","english_definition":"Not fiery; lacking the characteristics of fire; not passionate or ardent.","examples":[{"sentence":"His unfiery speech failed to ignite the crowd's enthusiasm.","translation":"彼の情熱的でない演説は、群衆の熱意を燃え上がらせることはできなかった。"},{"sentence":"She gave an unfiery performance, lacking the intensity the role demanded.","translation":"彼女は情熱に欠けた演技をし、その役が要求する激しさがなかった。"},{"sentence":"The unfiery sunset lacked the vibrant colors of previous evenings.","translation":"その穏やかな夕焼けは、以前の夕暮れのような鮮やかな色がなかった。"}],"collocations":["unfiery speech","unfiery performance","unfiery sunset","unfiery temperament","unfiery debate"],"synonyms":["mild","calm","placid","gentle","subdued","lackluster","uninspired","apathetic","tepid"],"antonyms":["fiery","passionate","ardent","fervent","intense","zealous","spirited","enthusiastic"]},{"part_of_speech":"adjective","definition":"火の性質を持たない、燃えない","english_definition":"Not having the nature of fire; not flammable or combustible.","examples":[{"sentence":"The material was unfiery and safe to use near open flames.","translation":"その素材は不燃性で、裸火の近くで使用しても安全だった。"},{"sentence":"They chose an unfiery insulation for the walls of the building.","translation":"彼らは建物の壁のために不燃性の断熱材を選んだ。"}],"collocations":["unfiery material","unfiery insulation","unfiery substance","unfiery construction"],"synonyms":["nonflammable","incombustible","fireproof","flame-resistant"],"antonyms":["flammable","combustible","fiery"]}],"etymology":{"value":"接頭辞 un- (否定) + fiery (炎のような、情熱的な)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈfaɪəri/","syllables":"un-fi-er-y"},"inflection":{"adjective_forms":{"comparative":"more unfiery","superlative":"most unfiery"}},"usage_notes":{"explanation":"\"Unfiery\" is primarily used to describe something lacking the qualities associated with fire, such as heat, intensity, passion, or excitement. It can refer to both physical properties (e.g., a non-flammable material) and abstract qualities (e.g., a bland performance). The word is relatively uncommon and often used in contrast to something that is expected to be fiery.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unfiery food was bland.","correct":"✓ The bland food was unfiery.","note":"While unfiery can describe something lacking intensity, it's more commonly used to describe a lack of passion or fire-like qualities. \"Bland\" is a more direct way to describe tasteless food."},{"incorrect":"✗ He had an unfiery temper, always getting angry.","correct":"✓ He had a fiery temper, always getting angry.","note":"Unfiery means lacking fire or passion. A fiery temper means someone gets angry easily."}],"priority":"★★☆"},"related_words":{"derivatives":["unfire (verb - to remove fire from, archaic)","fiery (adjective - having the qualities of fire; passionate)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unfiery\" is a relatively uncommon word that means lacking the qualities of fire, such as passion, intensity, or heat. It is formed by adding the prefix \"un-\" to \"fiery.\" The word is used to describe something that is not exciting, passionate, or energetic. It can also describe materials that are not flammable. Because of its relative infrequency, it is more likely to be encountered in advanced texts or specialized contexts."},"example_sentences":[{"sentence":"The candidate delivered an unfiery speech, failing to connect with the audience.","translation":"候補者は熱意のない演説を行い、聴衆とのつながりを築くことができなかった。","type":"adjective","meaning_category":"情熱的でない"},{"sentence":"The unfiery colors of the painting created a calming effect.","translation":"その絵の穏やかな色彩は、落ち着いた雰囲気を作り出した。","type":"adjective","meaning_category":"炎のように激しくない"},{"sentence":"They used unfiery materials to construct the fireplace surround.","translation":"彼らは暖炉の周囲を構築するために不燃性の素材を使用した。","type":"adjective","meaning_category":"燃えない"}]}