{"word":"Hermetics","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘルメス主義、ヘルメス哲学","english_definition":"A religious, philosophical, and esoteric tradition based on writings attributed to Hermes Trismegistus.","examples":[{"sentence":"Hermetics influenced Renaissance thought and alchemy.","translation":"ヘルメス主義はルネサンス思想と錬金術に影響を与えた。"}],"collocations":["Hermetic philosophy","Hermetic texts","study of Hermetics"],"synonyms":["Hermeticism","Hermetic philosophy"],"antonyms":[]}],"etymology":{"value":"Derived from Hermes Trismegistus, a syncretic deity combining aspects of the Greek god Hermes and the Egyptian god Thoth.","priority":"★★☆"},"pronunciation":{"ipa":"/hərˈmɛtɪks/","syllables":"her-met-ics"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hermetics refers to a body of philosophical and religious beliefs and practices rooted in texts attributed to Hermes Trismegistus ('Thrice-Greatest Hermes'). These texts, primarily dating from the early centuries AD, cover a wide range of topics, including cosmology, astrology, alchemy, magic, and medicine. Hermetics emphasizes the interconnectedness of all things and the possibility of spiritual transformation through knowledge and understanding of divine principles. It had a significant impact on Western esotericism, particularly during the Renaissance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is studying Hermetic.","correct":"✓ He is studying Hermetics.","note":"'Hermetics' is generally used as a plural noun referring to the body of Hermetic teachings, even when referring to the study of it as a whole."}],"priority":"★☆☆"},"related_words":{"derivatives":["Hermetic (adjective: relating to Hermetics; sealed airtight)","Hermeticism (noun: synonym for Hermetics)","Hermes Trismegistus (noun: the purported author of the Hermetic texts)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily encountered in academic or esoteric contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hermetics' refers to a complex and esoteric philosophical and religious tradition. Understanding it requires familiarity with ancient Greek and Egyptian thought, as well as concepts in alchemy, astrology, and magic. The term is most often encountered in academic or specialized contexts related to the history of Western esotericism."},"example_sentences":[{"sentence":"The principles of Hermetics emphasize the interconnectedness of the microcosm and macrocosm.","translation":"ヘルメス主義の原則は、小宇宙と大宇宙の相互接続性を強調している。","type":"general"},{"sentence":"Renaissance scholars were deeply influenced by the texts of Hermetics.","translation":"ルネサンス期の学者たちは、ヘルメス主義の文献から深い影響を受けた。","type":"historical"}]}