{"word":"scalodo","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, technical) A type of Italian ice cream or sorbet, typically flavored with citrus or floral essences.","english_definition":"(rare, technical) A type of Italian ice cream or sorbet, typically flavored with citrus or floral essences.","examples":[{"sentence":"The chef prepared a refreshing scalodo with lemon and bergamot.","translation":"シェフはレモンとベルガモットを使った爽やかなスカロドを用意した。"}],"collocations":["lemon scalodo","bergamot scalodo","floral scalodo"],"synonyms":["sorbetto","granita","gelato"],"antonyms":[]}],"etymology":{"value":"Likely derived from a regional Italian dialect, possibly referencing the 'scaling' or scraping process used in making the frozen dessert. The exact origin is obscure.","priority":"★☆☆"},"pronunciation":{"ipa":"/skaˈlo.do/","syllables":"sca-lo-do"},"inflection":{"noun_plural":"scalodos"},"usage_notes":{"explanation":"'Scalodo' is a relatively obscure term, even within Italian culinary contexts. It's more likely to be encountered in specialized cookbooks or historical texts relating to Italian cuisine. It's often used interchangeably with 'sorbetto' or 'granita', although some sources may suggest subtle differences in texture or preparation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ordered a scalodo at the gelateria, but they didn't know what it was.","correct":"✓ I ordered a sorbetto at the gelateria.","note":"'Scalodo' is not a commonly recognized term, so 'sorbetto' would be a safer choice."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Scalodo' is a highly specialized culinary term. Understanding its meaning requires a deep knowledge of Italian cuisine and its regional variations. It is unlikely to be encountered in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The dessert menu featured a scalodo made with Sicilian oranges.","translation":"デザートメニューにはシチリア産オレンジを使ったスカロドが載っていた。","type":"noun","meaning_category":"Italian ice cream/sorbet"}]}