{"word":"sweetbriers","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"バラ科バラ属の植物、特にイヌバラ (Rosa rubiginosa) の複数形","english_definition":"plural form of sweetbrier; a prickly rose (Rosa rubiginosa) with fragrant leaves and pink flowers.","examples":[{"sentence":"The garden was filled with sweetbriers, their fragrance filling the air.","translation":"庭はスイートブライアーでいっぱいになり、その香りが空気を満たしていました。"},{"sentence":"Sweetbriers are known for their apple-scented foliage.","translation":"スイートブライアーは、リンゴの香りのする葉で知られています。"}],"collocations":["wild sweetbriers","fragrant sweetbriers","cultivated sweetbriers"],"synonyms":["Rosa rubiginosa","eglantine rose","brier rose"],"antonyms":[]}],"etymology":{"value":"'Sweet' + 'brier'. 'Brier' refers to a thorny bush, especially a rose.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈswiːtˌbraɪərz/","syllables":"sweet-bri-ers"},"inflection":{"noun_plural":"sweetbriers"},"usage_notes":{"explanation":"'Sweetbriers' is the plural form of 'sweetbrier', referring to plants of the species Rosa rubiginosa or similar fragrant, prickly roses. It is often used to describe a collection of these plants in a garden or natural setting.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a sweetbrier in the garden. They were beautiful.","correct":"✓ I saw sweetbriers in the garden. They were beautiful.","note":"Since 'they' is plural, the noun should also be plural."}],"priority":"★★☆"},"related_words":{"derivatives":["sweetbrier (singular form)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sweetbriers' refers to a specific type of rose, Rosa rubiginosa, known for its fragrant leaves. This term is not commonly used in everyday conversation but is more likely to appear in botanical contexts or descriptions of gardens and natural landscapes. Understanding the term requires some familiarity with plant names and botanical terminology."},"example_sentences":[{"sentence":"The hedgerow was thick with wild sweetbriers.","translation":"生け垣は野生のスイートブライアーで覆われていました。","type":"noun","meaning_category":"plant"},{"sentence":"She planted several sweetbriers along the fence for their beautiful flowers and scent.","translation":"彼女は美しい花と香りのために、フェンス沿いにいくつかのスイートブライアーを植えました。","type":"noun","meaning_category":"plant"}]}