{"word":"hebephrenia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"破瓜型精神分裂病（解体型統合失調症）","english_definition":"A type of schizophrenia characterized by disorganized thought, speech, and behavior, and flat or inappropriate affect.","examples":[{"sentence":"Hebephrenia is a subtype of schizophrenia that typically manifests in adolescence or early adulthood.","translation":"破瓜型精神分裂病は、通常、青年期または成人期早期に発症する統合失調症の一種です。"},{"sentence":"The patient's hebephrenia was evident in his disorganized speech and inappropriate laughter.","translation":"患者の破瓜型精神分裂病は、彼のまとまりのない会話と不適切な笑いから明らかでした。"}],"collocations":["disorganized schizophrenia","childhood-onset schizophrenia"],"synonyms":["disorganized schizophrenia"],"antonyms":[]},{"part_of_speech":"obsolete term","definition":"(廃語)思春期に発症する精神障害の一種","english_definition":"(historical) An obsolete term for a mental disorder occurring in adolescence, now largely encompassed by the diagnosis of schizophrenia, disorganized type.","examples":[{"sentence":"In the early 20th century, hebephrenia was considered a distinct form of adolescent insanity.","translation":"20世紀初頭、破瓜型精神分裂病は、思春期の精神異常の一つの明確な形態と考えられていました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Greek words 'hebe' (youth) and 'phren' (mind), reflecting its typical onset during adolescence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːbɪˈfriːniə/","syllables":"he-be-phre-ni-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hebephrenia is an older term, now largely replaced by 'disorganized schizophrenia' in the DSM-5. It refers to a subtype of schizophrenia characterized by prominent disorganized thought, speech, and behavior, along with a flat or inappropriate affect. The onset is typically during adolescence or early adulthood. While the term 'hebephrenia' is less commonly used in modern psychiatric practice, it may still be encountered in older literature or discussions of the history of psychiatry.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Hebephrenia is a personality disorder.","correct":"✓ Hebephrenia is a subtype of schizophrenia.","note":"Hebephrenia is a type of schizophrenia, not a personality disorder."}],"priority":"★★☆"},"related_words":{"derivatives":["hebephrenic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hebephrenia' is a specialized term in psychiatry, primarily of historical interest. It is largely superseded by the term 'disorganized schizophrenia'. Understanding its meaning requires familiarity with psychiatric terminology and the history of mental health diagnoses. The term is rarely used in general conversation or non-specialist contexts."},"example_sentences":[{"sentence":"The classic symptoms of hebephrenia include disorganized speech and inappropriate emotional responses.","translation":"破瓜型精神分裂病の典型的な症状には、まとまりのない会話と不適切な感情的反応が含まれます。","type":"definition","meaning_category":"symptoms"},{"sentence":"Historically, hebephrenia was considered a distinct form of early-onset psychosis.","translation":"歴史的に、破瓜型精神分裂病は早期発症の精神病の一つの明確な形態と考えられていました。","type":"historical context","meaning_category":"historical"}]}