{"word":"anti-natalist","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"反出生主義の、出生に反対する","english_definition":"opposed to procreation; believing that it is morally wrong to bring children into the world.","examples":[{"sentence":"The anti-natalist philosophy argues that life is inherently filled with suffering.","translation":"反出生主義の哲学は、人生は本質的に苦しみに満ちていると主張する。"},{"sentence":"Some anti-natalist thinkers believe that having children is harmful to the environment.","translation":"一部の反出生主義の思想家は、子供を持つことは環境に有害であると考えている。"}],"collocations":["anti-natalist philosophy","anti-natalist arguments","anti-natalist views"],"synonyms":["child-free","antinatal"],"antonyms":["pro-natalist"]},{"part_of_speech":"noun","definition":"反出生主義者、出生に反対する人","english_definition":"a person who opposes procreation; someone who believes that it is morally wrong to bring children into the world.","examples":[{"sentence":"The anti-natalist explained their reasons for not wanting to have children.","translation":"その反出生主義者は、子供を持ちたくない理由を説明した。"},{"sentence":"Anti-natalists often cite concerns about overpopulation and environmental degradation.","translation":"反出生主義者は、しばしば人口過多や環境悪化への懸念を理由に挙げる。"}],"collocations":["a committed anti-natalist","an outspoken anti-natalist"],"synonyms":["antinatalist","childfree advocate"],"antonyms":["pro-natalist"]}],"etymology":{"value":"'Anti-' (反対) + 'natal' (出生の) + '-ist' (主義者) から構成される。出生に反対する立場や人を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈneɪtəlɪst/","syllables":"an-ti-na-tal-ist"},"inflection":{"noun_plural":"anti-natalists"},"usage_notes":{"explanation":"'Anti-natalist' は、子供を産むこと（出生）に反対する思想や人を指す言葉です。この思想は、倫理的、環境的、または個人的な理由から、子供を産むことは道徳的に間違っているという信念に基づいています。反出生主義者は、人生には避けられない苦しみがあること、人口過多の問題、環境への影響などを理由として、子供を持つことを避けるべきだと主張することがあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a anti-natalist.","correct":"✓ She is an anti-natalist.","note":"'Anti-' で始まる単語の前では、不定冠詞は 'an' になります。"},{"incorrect":"✗ He supports anti-natalism, so he has many children.","correct":"✓ He supports anti-natalism, so he doesn't have any children.","note":"反出生主義は子供を持つことに反対する立場なので、多くの子供を持つことは矛盾します。"}],"priority":"★★☆"},"related_words":{"derivatives":["anti-natalism (名詞: 反出生主義)","natal (形容詞: 出生の、誕生の)","natal chart (出生図、ホロスコープ)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anti-natalist' is a term used to describe a philosophical position that assigns a negative value to birth. Anti-natalists typically argue that it is morally wrong to bring new people into existence, often citing the potential for suffering and the negative impacts on the environment. This is a relatively complex and specialized term, primarily encountered in philosophical or ethical discussions. It's important to understand the core concept of opposing birth to grasp the meaning of this word.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor presented a nuanced argument for anti-natalism, addressing common criticisms.","translation":"教授は、よくある批判を取り上げながら、反出生主義に対するニュアンスの富んだ議論を展開した。","type":"adjective","meaning_category":"反出生主義の"},{"sentence":"As an anti-natalist, she believes that adoption is a more ethical choice than having biological children.","translation":"反出生主義者として、彼女は養子縁組が実子を持つよりも倫理的な選択だと信じている。","type":"noun","meaning_category":"反出生主義者"},{"sentence":"The documentary explored the diverse perspectives within the anti-natalist movement.","translation":"そのドキュメンタリーは、反出生主義運動内の多様な視点を掘り下げた。","type":"adjective","meaning_category":"反出生主義の"}]}