{"word":"moribundity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"瀕死の状態、死にかけている状態、衰退","english_definition":"the state of being moribund; the state of approaching death; stagnation or decline.","examples":[{"sentence":"The moribundity of the old industry was evident in the abandoned factories.","translation":"その旧産業の瀕死の状態は、放棄された工場に明らかだった。"},{"sentence":"The patient's moribundity was a great concern to the medical staff.","translation":"患者の瀕死の状態は、医療スタッフにとって大きな懸念事項だった。"},{"sentence":"The organization was showing signs of moribundity, with dwindling membership and lack of innovation.","translation":"その組織は、会員数の減少と革新の欠如により、衰退の兆候を示していた。"}],"collocations":["signs of moribundity (衰退の兆候)","state of moribundity (瀕死の状態)"],"synonyms":["decline","decay","stagnation","death throes","terminal state"],"antonyms":["vitality","flourishing","thriving","growth"]}],"etymology":{"value":"Late Middle English: from late Latin *moribundus*, from Latin *mori* 'to die'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɒrɪˈbʌndɪti/","syllables":"mo-ri-bun-di-ty"},"inflection":{"noun_plural":"moribundities (rarely used)"},"usage_notes":{"explanation":"\"**Moribundity**\" refers to the state of being near death, either literally (in the context of a living organism) or figuratively (in the context of an organization, industry, or idea). It implies a lack of vitality and a state of decline from which recovery is unlikely. It is a relatively uncommon word, often used in formal or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The moribundity of the plant was caused by overwatering.","correct":"✓ The moribund state of the plant was caused by overwatering.","note":"While \"moribundity\" is technically correct, \"moribund state\" or \"moribund condition\" is more common and natural-sounding.  Using \"state\" or \"condition\" clarifies that you're describing a condition rather than a quality."},{"incorrect":"✗ The moribundity of the company led to increased profits.","correct":"✓ The moribund state of the company led to its closure.","note":"\"Moribundity\" implies decline and approaching death.  It cannot logically lead to increased profits.  The sentence should reflect a negative outcome."}],"priority":"★☆☆"},"related_words":{"derivatives":["moribund (adjective: 瀕死の、衰退している)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"**Moribundity**\" is a formal term indicating a state of being near death or in terminal decline. It's not commonly used in everyday conversation. You're more likely to encounter it in academic writing, business reports (when discussing failing companies), or medical contexts (describing a patient's condition). The word suggests that recovery is highly improbable. It's related to the adjective \"moribund,\" which is more frequently used."},"example_sentences":[{"sentence":"The **moribundity** of the theater district was reversed by the influx of new businesses.","translation":"その劇場街の衰退は、新しいビジネスの流入によって逆転された。","type":"noun","meaning_category":"衰退"},{"sentence":"The **moribundity** of the patient's vital signs indicated imminent death.","translation":"患者の生命維持兆候の瀕死の状態は、差し迫った死を示していた。","type":"noun","meaning_category":"瀕死の状態"},{"sentence":"The **moribundity** of the project was due to lack of funding and public interest.","translation":"そのプロジェクトの衰退は、資金不足と大衆の関心の欠如によるものだった。","type":"noun","meaning_category":"衰退"}]}