{"word":"handfasting","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ハンドファスティング：古代ケルトの伝統に由来する、1年と1日などの一定期間を定めて行われる婚約または結婚の儀式。期間満了後に正式な結婚に進むか、関係を解消するかを選択できる。現代では、異教徒やネオペイガンコミュニティで、法的拘束力のない結婚の誓いとして行われることもある。","english_definition":"A commitment ceremony or betrothal, originating in ancient Celtic traditions, where a couple declares their intent to marry and their hands are tied together. Traditionally, it lasts for a year and a day, after which the couple can choose to marry permanently or separate. In modern times, it is sometimes practiced in pagan and Neopagan communities as a non-legally binding wedding vow.","examples":[{"sentence":"They chose to have a handfasting ceremony to honor their Celtic heritage.","translation":"彼らはケルトの遺産を尊重するために、ハンドファスティングの儀式を行うことを選びました。"},{"sentence":"The handfasting lasted for a year and a day, after which they decided to get legally married.","translation":"ハンドファスティングは1年と1日続き、その後、彼らは正式に結婚することを決めました。"},{"sentence":"Many modern pagans incorporate handfasting into their wedding rituals.","translation":"現代の異教徒の多くは、ハンドファスティングを結婚の儀式に取り入れています。"}],"collocations":["perform a handfasting","have a handfasting ceremony","year and a day handfasting","Celtic handfasting","Neopagan handfasting"],"synonyms":["commitment ceremony","betrothal","pagan wedding","Celtic wedding"],"antonyms":["legal marriage","civil marriage","traditional wedding"]}],"etymology":{"value":"「handfast」という言葉は、古英語の「handfæst」に由来し、「約束によって拘束された」という意味を持つ。これは、「hand」（手）と「fæst」（しっかりとした、固定された）という要素から構成されている。動詞「handfast」は、「婚約する」または「結婚する」という意味で使用される。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhændˌfæstɪŋ/","syllables":"hand-fast-ing"},"inflection":{"noun_plural":"handfastings"},"usage_notes":{"explanation":"ハンドファスティングは、法的拘束力のある結婚とは異なり、精神的な絆を重視する儀式です。期間を定めて共同生活を送り、将来について考える時間を持つことを目的とします。現代では、宗教的な意味合いだけでなく、個性的な結婚の形を求めるカップルにも選ばれています。儀式の内容は様々で、カップルが自分たちの価値観や信念に合わせてカスタマイズすることが可能です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Handfasting is legally binding in most countries.","correct":"✓ Handfasting is not legally binding in most countries.","note":"ハンドファスティングは、ほとんどの国で法的な結婚とは認められていません。"},{"incorrect":"✗ Handfasting always results in a permanent marriage.","correct":"✓ Handfasting does not always result in a permanent marriage.","note":"ハンドファスティングは、必ずしも正式な結婚につながるわけではありません。期間満了後に、結婚するかどうかを選択できます。"}],"priority":"★★☆"},"related_words":{"derivatives":["handfast (verb, adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**handfasting**」は、古代ケルトの伝統に由来する結婚の儀式を指す言葉です。これは、カップルが一定期間（通常は1年と1日）一緒にいることを誓い、その期間の終わりに正式に結婚するかどうかを決定するものです。現代では、異教徒やネオペイガンコミュニティで、法的拘束力のない結婚の誓いとして行われることがあります。この言葉は、一般的な語彙ではなく、特定の文化や宗教的な文脈で使用されるため、馴染みがない人もいるかもしれません。"},"example_sentences":[{"sentence":"The couple decided to have a traditional Celtic **handfasting** ceremony.","translation":"そのカップルは伝統的なケルトのハンドファスティングの儀式を行うことに決めました。","type":"noun","meaning_category":"結婚の儀式"},{"sentence":"After their **handfasting**, they spent a year living together before deciding to marry.","translation":"ハンドファスティングの後、彼らは結婚を決める前に1年間一緒に暮らしました。","type":"noun","meaning_category":"結婚の儀式"},{"sentence":"The **handfasting** ceremony involved tying their hands together with ribbon.","translation":"ハンドファスティングの儀式では、彼らの手をリボンで結びました。","type":"noun","meaning_category":"結婚の儀式"}]}