{"word":"cathedratic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"司教座の、司教の職務に関する","english_definition":"pertaining to the office or dignity of a bishop; relating to the episcopal chair or cathedra.","examples":[{"sentence":"The cathedratic authority of the bishop was respected throughout the diocese.","translation":"司教の司教座の権威は教区全体で尊重された。"},{"sentence":"He delivered a cathedratic sermon on the importance of faith.","translation":"彼は信仰の重要性に関する司教座の説教を行った。"}],"collocations":["cathedratic authority","cathedratic sermon","cathedratic teaching"],"synonyms":["episcopal","pontifical","hierarchical"],"antonyms":["laic","secular"]}],"etymology":{"value":"Late Latin cathedraticus, from cathedra (chair, seat of a bishop), from Greek kathedra (seat), from kata- (down) + hedra (seat).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkæθɪˈdrætɪk/","syllables":"ca-the-dra-tic"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Cathedratic' is a relatively rare and formal term, primarily used in religious contexts, specifically within the Christian tradition. It refers to matters directly related to the authority, position, or teachings emanating from a bishop's seat (cathedra). It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cathedratic building was beautiful.","correct":"✓ The cathedral building was beautiful.","note":"'Cathedratic' refers to the office or authority of a bishop, not the physical building. Use 'cathedral' to describe the building."}],"priority":"★☆☆"},"related_words":{"derivatives":["cathedra (noun): the chair or seat of a bishop.","cathedral (noun): the principal church of a diocese, containing the bishop's throne."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cathedratic' is a highly specialized term primarily encountered in theological or historical texts related to the Christian church. Understanding requires familiarity with ecclesiastical structures and terminology. It is not suitable for general English learners."},"example_sentences":[{"sentence":"The bishop exercised his cathedratic functions with diligence.","translation":"司教は勤勉に司教座の職務を遂行した。","type":"adjective","meaning_category":"relating to a bishop's office"},{"sentence":"Cathedratic pronouncements are considered authoritative within the church.","translation":"司教座の宣言は教会内で権威があるとみなされる。","type":"adjective","meaning_category":"relating to a bishop's authority"}]}