{"word":"Malmesbury","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(イングランドの)マルムズベリー (ウィルトシャーにある町)","english_definition":"A market town in Wiltshire, England, known for its historic abbey and as one of the oldest boroughs in England.","examples":[{"sentence":"Malmesbury is a charming town with a rich history.","translation":"マルムズベリーは豊かな歴史を持つ魅力的な町です。"},{"sentence":"The abbey in Malmesbury is a popular tourist attraction.","translation":"マルムズベリーにある修道院は人気の観光名所です。"}],"collocations":["Malmesbury Abbey","Town of Malmesbury","Malmesbury resident"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name Malmesbury is believed to derive from 'Maeldufesburg', meaning 'the burh (fortified place) of Maelduf'. Maelduf was an Irish scholar who established a hermitage and school there in the 7th century.","priority":"★★☆"},"pronunciation":{"ipa":"ˈmɑːmzbəri","syllables":"Malms-bury"},"inflection":{},"usage_notes":{"explanation":"Malmesbury is primarily used as a proper noun to refer to the town in Wiltshire, England. It is often mentioned in historical contexts due to its long history and the presence of Malmesbury Abbey.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to visit the Malmesbury.","correct":"✓ I am going to visit Malmesbury.","note":"Malmesbury is a proper noun and does not require the definite article 'the' unless referring to a specific institution or landmark within the town (e.g., 'the Malmesbury Abbey')."},{"incorrect":"✗ Malmesbury is a city.","correct":"✓ Malmesbury is a town.","note":"Malmesbury is officially designated as a town, not a city."}],"priority":"★★☆"},"related_words":{"derivatives":["Malmesburian (adjective: relating to Malmesbury; noun: a resident of Malmesbury)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Proper noun)","frequency_google_ngram":"Relatively low frequency, primarily used in specific contexts related to Wiltshire, England.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"Malmesbury is a proper noun referring to a specific town in England. Its usage is generally limited to contexts discussing British geography, history, or tourism. Understanding its etymology and significance requires some familiarity with British history.","priority":"★★☆"},"example_sentences":[{"sentence":"William of Malmesbury was a prominent 12th-century historian.","translation":"マルムズベリーのウィリアムは、12世紀の著名な歴史家でした。","type":"noun","meaning_category":"Place"},{"sentence":"The architecture of Malmesbury Abbey is stunning.","translation":"マルムズベリー修道院の建築は素晴らしいです。","type":"noun","meaning_category":"Place"},{"sentence":"Malmesbury is located in the county of Wiltshire.","translation":"マルムズベリーはウィルトシャー州に位置しています。","type":"noun","meaning_category":"Place"}]}