{"word":"disownable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"否認できる、勘当できる、放棄できる","english_definition":"Capable of being disowned; able to be rejected or denied.","examples":[{"sentence":"The contract contained a disownable clause that allowed either party to terminate the agreement under certain conditions.","translation":"その契約には、特定の条件下でいずれかの当事者が合意を解除できる否認可能な条項が含まれていた。"},{"sentence":"His actions were so egregious that he became disownable by his family.","translation":"彼の行動は非常にひどかったので、家族から勘当されても仕方なかった。"}],"collocations":["disownable behavior","disownable clause","become disownable"],"synonyms":["rejectable","deniable","renounceable","abandonable"],"antonyms":["inalienable","irrevocable","unquestionable"]}],"etymology":{"value":"Derived from 'disown' (to deny ownership or association with) + '-able' (suffix indicating capability).","priority":"★★★"},"pronunciation":{"ipa":"/dɪˈsoʊnəbəl/","syllables":"di-sown-a-ble"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Disownable' is primarily used to describe something that can be rejected, denied, or renounced. It often implies a moral or legal justification for the act of disowning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was disownable because it was beautiful.","correct":"✓ The painting was disownable because it was a forgery.","note":"'Disownable' implies a negative reason for rejection, such as being false, harmful, or unacceptable."}],"priority":"★★☆"},"related_words":{"derivatives":["disown (verb)","disownment (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'disownable' is a relatively uncommon adjective that describes something capable of being disowned or rejected. It is typically used in formal or legal contexts to indicate that something can be legitimately denied or renounced due to its nature or circumstances. Understanding the root word 'disown' is essential for grasping the meaning of 'disownable'."},"example_sentences":[{"sentence":"The evidence was considered disownable in court due to its questionable origin.","translation":"その証拠は出所が疑わしいという理由で、裁判所では否認可能と判断された。","type":"general","meaning_category":"capable of being rejected"},{"sentence":"His scandalous behavior made him disownable by the conservative community.","translation":"彼のスキャンダラスな行動により、保守的なコミュニティから勘当されても仕方なかった。","type":"general","meaning_category":"capable of being rejected"}]}