{"word":"conchiolin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"コンキオリン（真珠層を構成する有機質）","english_definition":"An organic matrix of glycoproteins and fibrous proteins that forms the nacreous layer of mollusk shells and pearls.","examples":[{"sentence":"The pearl's luster comes from the interaction of light with the aragonite crystals and conchiolin layers.","translation":"真珠の光沢は、アラゴナイト結晶とコンキオリン層との光の相互作用から生まれます。"},{"sentence":"Conchiolin provides structural support to the calcium carbonate crystals in the shell.","translation":"コンキオリンは、貝殻内の炭酸カルシウム結晶に構造的な支持を与えます。"}],"collocations":["nacre and conchiolin","conchiolin matrix","conchiolin layer"],"synonyms":["pearl protein","shell matrix protein"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'konche' (shell) and the suffix '-in' (used to denote proteins or other organic compounds).","priority":"★★☆"},"pronunciation":{"ipa":"/kɒŋˈkaɪəlɪn/","syllables":"con-chi-o-lin"},"inflection":{"noun_plural":"conchiolins"},"usage_notes":{"explanation":"Conchiolin is a complex proteinaceous substance found in the shells of mollusks, especially in the nacreous layer (mother-of-pearl). It acts as a binding agent for the calcium carbonate crystals that make up the shell's structure.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["nacre","aragonite","mollusk"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Conchiolin is a technical term used in the context of marine biology, materials science, and gemology, specifically related to the study of mollusk shells and pearls. It is unlikely to be encountered in everyday language."},"example_sentences":[{"sentence":"Analysis of the conchiolin composition can provide insights into the mollusk's growth environment.","translation":"コンキオリンの組成分析は、軟体動物の成長環境に関する洞察を提供できます。","type":"noun","meaning_category":"organic matrix"},{"sentence":"The unique arrangement of aragonite platelets and conchiolin in nacre gives it exceptional strength and iridescence.","translation":"真珠層中のアラゴナイト血小板とコンキオリンの独特な配置が、真珠層に並外れた強度と虹色の光沢を与えます。","type":"noun","meaning_category":"organic matrix"}]}