{"word":"atrioventricular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"房室の、心房心室の","english_definition":"Relating to both the atria and ventricles of the heart.","examples":[{"sentence":"The atrioventricular node is a crucial part of the heart's electrical system.","translation":"房室結節は心臓の電気系統の重要な部分です。"},{"sentence":"Atrioventricular valves control blood flow between the atria and ventricles.","translation":"房室弁は心房と心室の間の血流を制御します。"}],"collocations":["atrioventricular valve","atrioventricular node","atrioventricular canal"],"synonyms":["AV"],"antonyms":[]}],"etymology":{"value":"Formed from the combination of 'atrio-' (relating to the atrium) and 'ventricular' (relating to the ventricle).","priority":"★★★"},"pronunciation":{"ipa":"/ˌeɪtri.oʊvɛnˈtrɪkjʊlər/","syllables":"a-tri-o-ven-tric-u-lar"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Atrioventricular' is a term used in anatomy and physiology to describe structures or functions related to both the atria (upper chambers) and ventricles (lower chambers) of the heart. It is commonly used in the context of the atrioventricular valves (tricuspid and mitral valves) and the atrioventricular node, which are essential for proper heart function.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ atrioventricularly","correct":"✓ atrioventricular","note":"'Atrioventricular' is an adjective, not an adverb. Therefore, it modifies nouns, not verbs."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["atrium","ventricle","valve","node","heart"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'atrioventricular' is a specialized medical term used to describe structures or functions related to both the atria and ventricles of the heart. It is typically encountered in medical or scientific contexts. Understanding this term requires knowledge of basic cardiac anatomy and physiology."},"example_sentences":[{"sentence":"The patient was diagnosed with an atrioventricular septal defect.","translation":"患者は房室中隔欠損症と診断されました。","type":"adjective","meaning_category":"medical condition"},{"sentence":"Proper function of the atrioventricular node is essential for maintaining a normal heart rhythm.","translation":"正常な心臓のリズムを維持するためには、房室結節の適切な機能が不可欠です。","type":"adjective","meaning_category":"physiology"}]}