{"word":"deaminating","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"脱アミノ（反応）させる、脱アミノ化する","english_definition":"To remove an amino group from a molecule.","examples":[{"sentence":"The enzyme is responsible for deaminating adenosine.","translation":"その酵素はアデノシンを脱アミノ化する役割を担っている。"},{"sentence":"Deaminating cytosine can lead to mutations in DNA.","translation":"シトシンを脱アミノ化すると、DNAに突然変異が生じる可能性がある。"}],"collocations":["deaminating adenosine","deaminating cytosine","deaminating guanine"],"synonyms":["deamination","amino group removal"],"antonyms":["amination"]},{"part_of_speech":"verb","transitivity":"vi","definition":"脱アミノ（反応）する、脱アミノ化される","english_definition":"To undergo deamination; to have an amino group removed.","examples":[{"sentence":"The amino acids are deaminating in the liver.","translation":"アミノ酸は肝臓で脱アミノ化されている。"},{"sentence":"Under certain conditions, proteins can start deaminating.","translation":"特定の条件下では、タンパク質が脱アミノ化を開始することがある。"}],"collocations":["amino acids deaminating","proteins deaminating"],"synonyms":["undergoing deamination"],"antonyms":["amination"]}],"etymology":{"value":"The word 'deaminating' is derived from 'deamination,' which comes from the prefix 'de-' (meaning removal) + 'amine' (referring to an amino group) + '-ation' (a suffix indicating a process or action).","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈæmɪneɪtɪŋ/","syllables":"de-am-i-nat-ing"},"inflection":{"verb_forms":{"present_simple":["deaminate","deaminates"],"past_simple":"deaminated","past_participle":"deaminated","present_participle":"deaminating"}},"usage_notes":{"explanation":"'Deaminating' refers to the process of removing an amino group (-NH2) from a molecule. This is a crucial biochemical reaction that occurs in various metabolic pathways, particularly in the breakdown of amino acids and nucleic acids. The process results in the release of ammonia (NH3), which is then converted to urea in mammals and excreted. 'Deaminating' can be used both transitively (deaminating a molecule) and intransitively (a molecule is deaminating).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The process of deaminating is simple.","correct":"✓ The process of deamination is simple.","note":"'Deaminating' is a verb form (present participle), while 'deamination' is the noun referring to the process itself."},{"incorrect":"✗ Deaminating occurs when amino acids are added.","correct":"✓ Deaminating occurs when amino groups are removed.","note":"'Deaminating' involves the removal, not the addition, of amino groups."}],"priority":"★★☆"},"related_words":{"derivatives":["deamination (noun): The removal of an amino group from a molecule.","deaminase (noun): An enzyme that catalyzes the removal of an amino group.","amino group (noun): A functional group consisting of a nitrogen atom attached by single bonds to hydrogen atoms or alkyl groups."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deaminating' is a technical term used in biochemistry and molecular biology, specifically referring to the process of removing an amino group from a molecule. This term is typically encountered in advanced scientific texts and discussions related to metabolism, enzyme function, and molecular processes. Understanding this term requires a strong foundation in chemistry and biology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The liver plays a key role in **deaminating** excess amino acids.","translation":"肝臓は過剰なアミノ酸を脱アミノ化する上で重要な役割を果たしている。","type":"verb","meaning_category":"Biochemistry"},{"sentence":"During starvation, the body starts **deaminating** proteins to produce energy.","translation":"飢餓状態の間、体はエネルギーを生産するためにタンパク質を脱アミノ化し始める。","type":"verb","meaning_category":"Metabolism"},{"sentence":"**Deaminating** agents can be used in certain chemical reactions to modify molecules.","translation":"脱アミノ化剤は、分子を修飾するために特定の化学反応で使用できる。","type":"verb","meaning_category":"Chemistry"}]}