{"word":"COEs","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"plural of COE (Certificate of Entitlement) in Singapore.","english_definition":"plural form of Certificate of Entitlement, a document issued by the Land Transport Authority of Singapore that allows the holder to register, own, and use a vehicle in Singapore for a period of 10 years.","examples":[{"sentence":"The prices of COEs have been increasing steadily in recent months.","translation":"シンガポールのCOEの価格はここ数ヶ月着実に上昇している。"},{"sentence":"Many Singaporeans complain about the high cost of COEs.","translation":"多くのシンガポール人はCOEの高コストについて不満を述べている。"},{"sentence":"The government regulates the number of COEs issued each year.","translation":"政府は毎年発行されるCOEの数を規制している。"}],"collocations":["COE prices (COE価格)","COE bidding (COE入札)","COE quota (COE割当)","renew COE (COEを更新する)","open COE (オープンCOE)"],"synonyms":["vehicle ownership certificate","car ownership permit"],"antonyms":[]}],"etymology":{"value":"Acronym for Certificate of Entitlement.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsiːˌoʊˈiːz/","syllables":"CEE-OH-EEZ"},"inflection":{"noun_plural":"COEs"},"usage_notes":{"explanation":"COE (Certificate of Entitlement) is a Singapore-specific term. It is a certificate that grants the legal right to own and use a vehicle for 10 years. Due to land scarcity, the Singaporean government uses COEs to control the number of vehicles on the road. The price of COEs can be very high, often exceeding the cost of the car itself. COEs are categorized by vehicle type (e.g., cars, motorcycles, commercial vehicles). The number of COEs available is determined by the government and allocated through a bidding system.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I want to buy a car but the COE is too expensive.","correct":"✓ I want to buy a car but COEs are too expensive.","note":"When referring to the general market price, use the plural form COEs."},{"incorrect":"✗ He has a COE for his motorcycle.","correct":"✓ He has a COE for his motorcycle.","note":"This is grammatically correct, but contextually, it's understood. No common mistake."}],"priority":"★★☆"},"related_words":{"derivatives":["COE (Certificate of Entitlement)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Singapore-specific term)","frequency_google_ngram":"Low (Singapore-specific)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'COEs' refers specifically to Certificates of Entitlement in Singapore, which are required to own and operate a vehicle. Understanding this term requires familiarity with Singaporean transportation policies. The price and availability of COEs significantly impact vehicle ownership costs in Singapore, making it a relevant topic for residents and those interested in Singaporean economics and transportation."},"example_sentences":[{"sentence":"The rising cost of COEs makes car ownership in Singapore increasingly expensive.","translation":"COEの価格高騰により、シンガポールでの車の所有はますます高価になっている。","type":"noun","meaning_category":"Certificate of Entitlement (plural)"},{"sentence":"Bidding for COEs is a complex process that many Singaporeans find frustrating.","translation":"COEの入札は多くのシンガポール人が不満に思う複雑なプロセスである。","type":"noun","meaning_category":"Certificate of Entitlement (plural)"},{"sentence":"The government's policy on COEs aims to manage the number of vehicles on the road.","translation":"政府のCOEに関する政策は、道路上の車両数を管理することを目的としている。","type":"noun","meaning_category":"Certificate of Entitlement (plural)"}]}