{"word":"Overdetermination","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学、心理学、社会学) 過剰決定：ある事象や結果が、単一の原因ではなく、複数の原因によって引き起こされること。それぞれの原因が単独でも結果を引き起こすのに十分な場合を指す。","english_definition":"(philosophy, psychology, sociology) The condition in which an event or outcome is caused by multiple factors, each of which would have been sufficient to cause the event on its own.","examples":[{"sentence":"The car accident was a case of overdetermination; the driver was speeding, the brakes were faulty, and the road was wet. Any one of these factors could have caused the crash.","translation":"その自動車事故は過剰決定の事例だった。運転手はスピードを出しすぎており、ブレーキは故障しており、道路は濡れていた。これらの要因のいずれか一つでも事故を引き起こす可能性があった。"},{"sentence":"In psychoanalysis, a dream is often seen as overdetermined, with multiple unconscious desires contributing to its content.","translation":"精神分析学では、夢はしばしば過剰決定されていると見なされ、複数の無意識的な欲求がその内容に寄与している。"},{"sentence":"Marxist theory suggests that social change is often overdetermined, resulting from the convergence of economic, political, and cultural factors.","translation":"マルクス主義理論は、社会変化はしばしば過剰決定されており、経済的、政治的、文化的要因の収束から生じると示唆している。"}],"collocations":["causal overdetermination (因果的過剰決定)","psychological overdetermination (心理学的過剰決定)","social overdetermination (社会的過剰決定)"],"synonyms":["multiple causation","redundant causation","causal redundancy"],"antonyms":["underdetermination","single causation"]},{"part_of_speech":"noun","definition":"(統計学、数学) 過剰決定系：未知数の数よりも方程式の数が多い連立方程式系。一般的には解が存在しないか、最小二乗法などを用いて近似解を求める。","english_definition":"(statistics, mathematics) A system of simultaneous equations in which there are more equations than unknowns. Generally, such a system has no solution, or an approximate solution is found using methods such as least squares.","examples":[{"sentence":"The data set resulted in an overdetermined system of equations, requiring us to use regression analysis to find the best fit.","translation":"そのデータセットは過剰決定系の方程式系をもたらし、最適な適合を見つけるために回帰分析を使用する必要があった。"},{"sentence":"In GPS positioning, having more satellite signals than necessary leads to an overdetermined system, which improves the accuracy of the location estimate.","translation":"GPS測位では、必要以上の衛星信号を持つことが過剰決定系につながり、位置推定の精度が向上する。"}],"collocations":["overdetermined system (過剰決定系)","overdetermined equations (過剰決定方程式)"],"synonyms":["redundant system"],"antonyms":["underdetermined system"]}],"etymology":{"value":"\"Over-\" (超過) + \"determination\" (決定) から構成される。ドイツ語の \"Überdetermination\" (Überdeterminierung) の翻訳借用である可能性が高い。この概念は、特に精神分析学やマルクス主義理論において重要であり、事象が単一の原因ではなく、複数の原因によって決定されるという考え方を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərˌdɪˌtɜːrmɪˈneɪʃən/","syllables":"o-ver-de-ter-mi-na-tion"},"inflection":{"noun_plural":"overdeterminations"},"usage_notes":{"explanation":"「**Overdetermination**」は、主に学術的な文脈で使用される専門用語です。哲学、心理学、社会学においては、ある事象が複数の原因によって引き起こされ、それぞれの原因が単独でもその事象を引き起こすのに十分である状態を指します。統計学や数学においては、未知数の数よりも方程式の数が多い連立方程式系を指します。文脈によって意味が異なるため、注意が必要です。日常会話ではあまり使われません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The problem was underdetermined because there were too many solutions.","correct":"✓ The problem was overdetermined because there were too many constraints.","note":"「Underdetermined」は解が一つに定まらない状態を指し、「overdetermined」は制約が多すぎる状態を指します。文脈に合わせて使い分けましょう。"},{"incorrect":"✗ The event was simply determined by one factor.","correct":"✓ The event was overdetermined by multiple factors.","note":"「Overdetermination」は複数の要因によって決定されることを意味します。単一の要因で決定される場合は、単に「determined」と表現します。"}],"priority":"★☆☆"},"related_words":{"derivatives":["overdetermine (動詞: 過剰決定する)","overdetermined (形容詞: 過剰決定された)"],"related_terms":["causation (因果関係)","determinism (決定論)","psychoanalysis (精神分析学)","Marxism (マルクス主義)","regression analysis (回帰分析)","simultaneous equations (連立方程式)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 学術的な文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Overdetermination**」は、主に哲学、心理学、社会学、統計学などの分野で使用される専門用語であり、日常会話ではほとんど使用されません。この単語は、ある事象や結果が単一の原因ではなく、複数の原因によって引き起こされる状態を指します。それぞれの原因が単独でも結果を引き起こすのに十分な場合を指します。統計学では、未知数の数よりも方程式の数が多い連立方程式系を指します。この単語を理解するには、それぞれの分野における文脈を考慮する必要があります。"},"example_sentences":[{"sentence":"The failure of the project was due to an **overdetermination** of factors, including poor planning, lack of resources, and insufficient communication.","translation":"プロジェクトの失敗は、計画の不備、資源の不足、コミュニケーション不足など、複数の要因が過剰決定した結果である。","type":"noun","meaning_category":"複数の原因による決定"},{"sentence":"The statistical model was **overdetermined**, leading to difficulties in interpreting the results.","translation":"その統計モデルは過剰決定されており、結果の解釈に困難が生じた。","type":"adjective (overdetermined)","meaning_category":"統計学における過剰決定系"},{"sentence":"The concept of **overdetermination** is central to understanding the complexities of social phenomena.","translation":"過剰決定の概念は、社会現象の複雑さを理解する上で重要である。","type":"noun","meaning_category":"哲学・社会学における概念"}]}