{"word":"smooth-bedded","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a river or stream) having a smooth bed; (geology) characterized by smooth, even layers of sediment.","english_definition":"Having a smooth bed, especially referring to a river or stream; geologically, describing rock formations with smooth, even layers.","examples":[{"sentence":"The smooth-bedded stream flowed gently through the valley.","translation":"滑らかな川底の小川が谷を静かに流れていた。"},{"sentence":"The geologist examined the smooth-bedded sandstone formation.","translation":"地質学者は、滑らかな層状の砂岩層を調べた。"}],"collocations":["smooth-bedded river","smooth-bedded sandstone","smooth-bedded rock"],"synonyms":["even-bedded","flat-bedded","laminar"],"antonyms":["rough-bedded","uneven-bedded","turbulent"],"notes":"Often used in geological descriptions."}],"etymology":{"value":"Combination of 'smooth' and 'bedded,' indicating a smooth surface or even layers.","priority":"N/A"},"pronunciation":{"ipa":"/ˈsmuːð ˈbɛdɪd/","syllables":"smooth-bed-ded"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"The term 'smooth-bedded' is most commonly used in geology and geography to describe sedimentary rock formations or riverbeds that exhibit a smooth, even surface or layering. It suggests a stable depositional environment with consistent sediment accumulation.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock was smooth-bedded and rough.","correct":"✓ The rock was either smooth-bedded or rough.","note":"'Smooth-bedded' and 'rough' are antonyms; a surface cannot be both simultaneously."}],"priority":"N/A"},"related_words":{"derivatives":["bedding (noun): layering in sedimentary rocks","smooth (adjective): having an even surface"],"related_terms":["cross-bedded (adjective): having layers that are inclined to each other","graded bedding (noun): a type of bedding in which particle size decreases upwards"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency; primarily used in specialized geological contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Smooth-bedded' is a technical term primarily used in geology and related fields. It describes a specific characteristic of sedimentary rocks or riverbeds, indicating even and consistent layering or a smooth surface. Understanding this term requires familiarity with basic geological concepts."},"example_sentences":[{"sentence":"The canyon walls revealed layers of smooth-bedded limestone.","translation":"峡谷の壁には、滑らかな層状の石灰岩が見られた。","type":"adjective","meaning_category":"geological description"},{"sentence":"The river was known for its smooth-bedded channel, making it ideal for canoeing.","translation":"その川は、川底が滑らかであることで知られており、カヌーに最適だった。","type":"adjective","meaning_category":"river description"}]}