{"word":"pro-neurodiversity","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"神経多様性を支持する、神経多様性肯定の","english_definition":"Supporting or advocating for neurodiversity, the idea that neurological differences like autism and ADHD are normal and valuable.","examples":[{"sentence":"The organization is actively pro-neurodiversity, promoting acceptance and inclusion of neurodivergent individuals.","translation":"その組織は積極的に神経多様性を支持しており、神経多様性を持つ人々の受容と包容を促進しています。"},{"sentence":"The school adopted a pro-neurodiversity approach, tailoring education to meet the diverse needs of all students.","translation":"その学校は神経多様性肯定のアプローチを採用し、すべての生徒の多様なニーズを満たすように教育を調整しました。"},{"sentence":"A pro-neurodiversity perspective challenges traditional views of neurological conditions as deficits.","translation":"神経多様性肯定の視点は、神経学的な状態を欠陥として捉える従来の考え方に異議を唱えます。"}],"collocations":["pro-neurodiversity movement (神経多様性運動)","pro-neurodiversity approach (神経多様性肯定のアプローチ)","pro-neurodiversity perspective (神経多様性肯定の視点)","pro-neurodiversity policies (神経多様性肯定の政策)","pro-neurodiversity education (神経多様性肯定の教育)","pro-neurodiversity advocacy (神経多様性肯定の擁護)"],"synonyms":["neurodiversity-affirming","neurodiversity-positive","neurodiversity-supportive"],"antonyms":["anti-neurodiversity","neurodiversity-denying"]}],"etymology":{"value":"A combination of 'pro-' (supporting, in favor of) and 'neurodiversity', indicating support for the concept of neurodiversity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊ.njʊ.roʊ.daɪˈvɜːr.sɪ.ti/","syllables":"pro-neu-ro-di-ver-si-ty"},"inflection":{"notes":"As an adjective, 'pro-neurodiversity' does not have different inflectional forms."},"usage_notes":{"explanation":"'Pro-neurodiversity' is used to describe individuals, organizations, policies, or approaches that actively support the neurodiversity paradigm. It implies a belief that neurological differences should be recognized, respected, and accommodated, rather than pathologized or treated as disorders to be cured. It is often used in contexts related to education, employment, healthcare, and social justice.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am very neurodiversity.","correct":"✓ I am pro-neurodiversity.","note":"'Neurodiversity' is a concept; 'pro-neurodiversity' is an adjective describing someone who supports the concept."},{"incorrect":"✗ He is a neurodiversity advocate.","correct":"✓ He is a pro-neurodiversity advocate.","note":"While 'neurodiversity advocate' is understandable, 'pro-neurodiversity advocate' more explicitly indicates support for the neurodiversity paradigm."}],"priority":"★★☆"},"related_words":{"derivatives":["neurodiversity","neurodivergent","neurotypical"],"phrases":["neurodiversity paradigm","neurodiversity movement","neurodiversity acceptance"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to growing awareness of neurodiversity.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pro-neurodiversity' is a term used to describe support for the idea that neurological differences, such as autism and ADHD, are normal variations of the human brain, rather than disorders. It is often used in discussions about inclusion, acceptance, and advocacy for neurodivergent individuals. Understanding this term requires familiarity with the concept of neurodiversity itself.","priority":"★★☆"},"example_sentences":[{"sentence":"The company's pro-neurodiversity hiring practices have attracted a diverse and talented workforce.","translation":"その会社の神経多様性肯定の採用慣行は、多様で才能のある労働力を引き付けています。","type":"adjective","meaning_category":"Supporting neurodiversity"},{"sentence":"As a pro-neurodiversity advocate, she speaks out against discrimination and promotes understanding.","translation":"神経多様性肯定の擁護者として、彼女は差別に対して声を上げ、理解を促進しています。","type":"adjective","meaning_category":"Supporting neurodiversity"},{"sentence":"The pro-neurodiversity movement seeks to create a more inclusive and equitable society for all.","translation":"神経多様性運動は、すべての人にとってより包容的で公平な社会を創造しようとしています。","type":"adjective","meaning_category":"Supporting neurodiversity"}]}