{"word":"Acetylacetone","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アセチルアセトン","english_definition":"A colorless liquid organic compound with the formula CH3COCH2COCH3. It exists in equilibrium with a keto form and an enol form and is used as a ligand in coordination chemistry and as a building block in organic synthesis.","examples":[{"sentence":"Acetylacetone is a versatile ligand in coordination chemistry.","translation":"アセチルアセトンは配位化学において汎用性の高い配位子です。"},{"sentence":"Acetylacetone can be used as a precursor for the synthesis of various organic compounds.","translation":"アセチルアセトンは、さまざまな有機化合物の合成のための前駆体として使用できます。"}],"collocations":["metal acetylacetonates","acetylacetone complexes","enol form of acetylacetone","keto form of acetylacetone"],"synonyms":["pentane-2,4-dione","2,4-pentanedione","AcAc"],"antonyms":[]}],"etymology":{"value":"The name 'acetylacetone' is derived from its chemical structure, indicating it is a diketone (two ketone groups) derived from acetone.","priority":"☆☆☆"},"pronunciation":{"ipa":"/əˌsɛtɪlˈæsɪtoʊn/","syllables":"a-cet-yl-a-ce-tone"},"inflection":{"notes":"It is a noun, so it has a plural form (acetylacetones)."},"usage_notes":{"explanation":"Acetylacetone is primarily used in chemistry, particularly in coordination chemistry and organic synthesis. It is important to note its chemical formula (CH3COCH2COCH3) and its ability to exist in both keto and enol forms.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Acetylacetone is a metal.","correct":"✓ Acetylacetone is an organic compound.","note":"Acetylacetone is an organic compound, not a metal."},{"incorrect":"✗ Acetylacetone only exists in keto form.","correct":"✓ Acetylacetone exists in equilibrium between keto and enol forms.","note":"Acetylacetone exists in equilibrium between keto and enol forms."}],"priority":"☆☆☆"},"related_words":{"derivatives":["acetylacetonate (noun): The anion formed by the deprotonation of acetylacetone, often used as a ligand."],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Acetylacetone' is a technical term used in chemistry, particularly in the context of organic and coordination chemistry. Understanding its properties and uses requires advanced knowledge in these fields. The term is not commonly encountered outside of specialized scientific contexts."},"example_sentences":[{"sentence":"The reaction of acetylacetone with metal salts yields metal acetylacetonates.","translation":"アセチルアセトンと金属塩との反応により、金属アセチルアセトナートが得られます。","type":"general","meaning_category":"chemical reaction"},{"sentence":"The enol form of acetylacetone is stabilized by intramolecular hydrogen bonding.","translation":"アセチルアセトンのエノール型は、分子内水素結合によって安定化されます。","type":"chemical property","meaning_category":"chemical property"}]}