{"word":"monotropies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(心理学) モノトロピー：人が最も強い愛着を抱く、または最も重要な愛着と考える単一の愛着対象に焦点を当てる傾向。","english_definition":"(psychology) The tendency for a person to focus on a single attachment figure, considered to be the most important attachment.","examples":[{"sentence":"Monotropies is a key concept in attachment theory.","translation":"モノトロピーは愛着理論における重要な概念です。"},{"sentence":"Some individuals may exhibit stronger monotropies than others.","translation":"人によっては、他の人よりも強いモノトロピーを示すことがあります。"}],"collocations":["attachment theory","attachment figure","single attachment","primary attachment"],"synonyms":["primary attachment","single attachment focus"],"antonyms":["multiple attachments","diffuse attachments"]}],"etymology":{"value":"The term 'monotropy' is derived from the Greek words 'monos' meaning 'single' or 'alone' and 'tropos' meaning 'turning' or 'direction'. In the context of attachment theory, it refers to the tendency to turn towards or focus on a single, primary attachment figure.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈnɒtrəpiːz/","syllables":"mo-no-tro-pies"},"inflection":{"noun_plural":"monotropies"},"usage_notes":{"explanation":"'Monotropies' is primarily used within the field of psychology, specifically in the context of attachment theory. It describes the idea that infants are biologically predisposed to form one special, close attachment with a caregiver, usually the mother. This concept suggests that this primary attachment is more important than any other. The plural form 'monotropies' is used to refer to the collection or manifestation of this tendency in different individuals or contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The monotropy is important for social development.","correct":"✓ Monotropy is important for social development.","note":"The singular form 'monotropy' should be used when referring to the general concept. 'Monotropies' is used to refer to multiple instances or manifestations of this tendency."}],"priority":"★★☆"},"related_words":{"derivatives":["monotropy (singular noun)","monotropic (adjective)"],"related_concepts":["attachment theory","attachment figure","Bowlby's attachment theory","internal working model"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monotropies' is a specialized term used in psychology, particularly within attachment theory. It refers to the idea that individuals have a primary attachment figure that is significantly more important than other attachments. This term is not commonly used outside of academic or professional discussions related to psychology. Understanding the concept requires familiarity with attachment theory and related psychological principles."},"example_sentences":[{"sentence":"Research suggests that strong monotropies in early childhood can influence later relationships.","translation":"研究によると、幼少期における強いモノトロピーは、その後の人間関係に影響を与える可能性があります。","type":"noun","meaning_category":"psychology"},{"sentence":"The concept of monotropies is central to understanding Bowlby's attachment theory.","translation":"モノトロピーの概念は、ボールビーの愛着理論を理解する上で中心となります。","type":"noun","meaning_category":"psychology"}]}