{"word":"nonagglutinating","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(言語学で)膠着性を持たない、膠着語でない","english_definition":"(of a language) not agglutinative; not characterized by agglutination (the process of word formation in which morphemes are strung together like beads on a string, with each morpheme representing a distinct grammatical meaning).","examples":[{"sentence":"English is a nonagglutinating language, as words are not typically formed by stringing together multiple affixes with distinct meanings.","translation":"英語は膠着語ではありません。なぜなら、単語は通常、明確な意味を持つ複数の接辞を連ねて形成されるわけではないからです。"}],"collocations":["nonagglutinating language","non-agglutinative language"],"synonyms":["isolating","analytic"],"antonyms":["agglutinating","agglutinative"]},{"part_of_speech":"adjective","definition":"(生物学、化学で)凝集しない","english_definition":"(in biology or chemistry) not undergoing or causing agglutination (the clumping together of particles, especially cells).","examples":[{"sentence":"The nonagglutinating antibodies did not cause the red blood cells to clump together.","translation":"非凝集性の抗体は、赤血球を凝集させませんでした。"}],"collocations":["nonagglutinating antibody","non-agglutinative antibody"],"synonyms":["non-clumping","non-coagulating"],"antonyms":["agglutinating","agglutinative","clumping","coagulating"]}],"etymology":{"value":"\"non-\" (not) + \"agglutinating\".  \"Agglutinating\" comes from the Latin \"agglutinare\" (to glue together).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.əˈɡluː.tɪ.neɪ.tɪŋ/","syllables":"non-ag-glu-ti-na-ting"},"inflection":{"notes":"Adjective; comparative and superlative forms are formed using 'more' and 'most', e.g., 'more nonagglutinating', 'most nonagglutinating'."},"usage_notes":{"explanation":"The term \"nonagglutinating\" is primarily used in linguistics to describe languages that do not rely on agglutination as a primary means of word formation.  It's also used in scientific contexts (biology, chemistry) to describe substances or processes that do not cause clumping or coagulation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The language is non-agglutinative, so it's very easy to learn.","correct":"✓ The language is non-agglutinative, so the word order is very important.","note":"Whether a language is agglutinative or not does not directly correlate with its ease of learning. Non-agglutinative languages often rely heavily on word order, which can be challenging for learners."}],"priority":"★☆☆"},"related_words":{"derivatives":["agglutinate (verb, noun)","agglutination (noun)","agglutinative (adjective)"],"related_terms":["isolating language","analytic language","fusional language","polysynthetic language"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonagglutinating\" is a technical term primarily used in linguistics and related scientific fields. In linguistics, it describes languages that do not form words by stringing together morphemes (meaningful units) in a linear fashion. Instead, these languages may rely on isolating individual words or using inflections (changes in word form) to convey grammatical information. In scientific contexts, it describes substances or processes that do not cause clumping or coagulation. Understanding this word requires a familiarity with linguistic and scientific terminology."},"example_sentences":[{"sentence":"Mandarin Chinese is a **nonagglutinating** language, relying heavily on word order and context to convey meaning.","translation":"標準中国語は膠着性を持たない言語であり、意味を伝えるために語順と文脈に大きく依存しています。","type":"adjective","meaning_category":"linguistics"},{"sentence":"The researcher used a **nonagglutinating** reagent to prevent the cells from clumping together during the experiment.","translation":"研究者は、実験中に細胞が凝集するのを防ぐために、非凝集性の試薬を使用しました。","type":"adjective","meaning_category":"biology/chemistry"}]}