{"word":"chelicerate","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"鋏角類（きょうかくるい）の動物","english_definition":"any arthropod of the subphylum Chelicerata, including spiders, scorpions, mites, ticks, and horseshoe crabs, characterized by the presence of chelicerae (pincers or fangs) near the mouth.","examples":[{"sentence":"Spiders are chelicerates.","translation":"クモは鋏角類です。"},{"sentence":"Chelicerates are a diverse group of arthropods.","translation":"鋏角類は多様な節足動物のグループです。"}],"collocations":["chelicerate arthropod","marine chelicerate","terrestrial chelicerate"],"synonyms":["arachnid (for spiders and related groups)"],"antonyms":[]},{"part_of_speech":"adjective","definition":"鋏角類に属する、鋏角類のような","english_definition":"relating to or belonging to the Chelicerata.","examples":[{"sentence":"Chelicerate morphology is characterized by the presence of chelicerae.","translation":"鋏角類の形態は、鋏角の存在によって特徴づけられます。"},{"sentence":"Chelicerate evolution is a complex topic.","translation":"鋏角類の進化は複雑なトピックです。"}],"collocations":["chelicerate morphology","chelicerate evolution","chelicerate characteristics"],"synonyms":["arachnidan"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'chele' (claw, pincer) and 'keras' (horn), referring to the characteristic chelicerae (pincers or fangs) of these arthropods.","priority":"★★★"},"pronunciation":{"ipa":"/kəˈlɪsəreɪt/","syllables":"che-li-ce-rate"},"inflection":{"notes":"The plural form of the noun is 'chelicerates'."},"usage_notes":{"explanation":"The term 'chelicerate' refers to a major group of arthropods distinguished by the presence of chelicerae, which are specialized appendages near the mouth used for grasping or piercing. This group includes familiar animals like spiders, scorpions, mites, ticks, and horseshoe crabs. The term is used both as a noun to refer to an individual animal belonging to this group and as an adjective to describe characteristics or features associated with the Chelicerata.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Chelicerates are insects.","correct":"✓ Chelicerates are arthropods.","note":"Chelicerates are a subphylum within the arthropods, but they are distinct from insects."},{"incorrect":"✗ Chelicerate only refers to spiders.","correct":"✓ Chelicerate refers to a broader group including spiders, scorpions, mites, ticks, and horseshoe crabs.","note":"While spiders are a prominent group within the Chelicerata, the term encompasses a wider range of animals."}],"priority":"★★☆"},"related_words":{"derivatives":["chelicera (noun: the chelicerate's characteristic mouthpart)","Chelicerata (noun: the subphylum containing chelicerates)"],"phrases":["chelicerate body plan","chelicerate nervous system"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized scientific vocabulary)","frequency_google_ngram":"Low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'chelicerate' is a scientific term used to describe a group of arthropods that possess chelicerae, which are specialized mouthparts. This group includes spiders, scorpions, mites, ticks, and horseshoe crabs. The term is primarily used in biology, zoology, and related scientific fields. Understanding this term requires a background in basic biological classification and arthropod anatomy."},"example_sentences":[{"sentence":"The fossil record provides insights into the evolution of **chelicerates**.","translation":"化石記録は、鋏角類の進化に関する洞察を提供します。","type":"noun","meaning_category":"鋏角類"},{"sentence":"**Chelicerate** arthropods are characterized by having two body segments: the prosoma and the opisthosoma.","translation":"鋏角類の節足動物は、前体と後体の2つの体節を持つことで特徴付けられます。","type":"adjective","meaning_category":"鋏角類の"}]}