{"word":"gneiss","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"片麻岩（へんまがん）","english_definition":"A coarse-grained, high-grade metamorphic rock with compositional banding.","examples":[{"sentence":"Gneiss is a common type of rock found in continental crust.","translation":"片麻岩は大陸地殻でよく見られる種類の岩石です。"},{"sentence":"The mountains are composed of granite and gneiss.","translation":"その山々は花崗岩と片麻岩で構成されています。"}],"collocations":["granite gneiss","augen gneiss","metamorphic gneiss"],"synonyms":["metamorphic rock"],"antonyms":[]}],"etymology":{"value":"The term \"gneiss\" comes from the German word \"Gneis,\" which was originally used by miners to describe various coarse-grained rocks. Its origin is uncertain, but it may be related to the Middle High German word \"gneist,\" meaning \"spark,\" possibly referring to the sparkling appearance of some gneiss varieties due to the presence of minerals like mica.","priority":"★★☆"},"pronunciation":{"ipa":"/naɪs/","syllables":"gneiss (1 syllable)"},"inflection":{"noun_plural":"gneisses"},"usage_notes":{"explanation":"Gneiss is a type of metamorphic rock, meaning it was formed from another type of rock (either sedimentary or igneous) that has been changed by extreme heat and pressure. It is characterized by its banded or foliated texture, where minerals are arranged in layers or bands. The composition of gneiss can vary, but it often contains minerals like quartz, feldspar, and mica.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gneiss were found near the river.","correct":"✓ The gneiss was found near the river.","note":"Although 'gneiss' can be pluralized to 'gneisses', in the example sentence, it refers to a mass of the rock, so the singular form is more appropriate. If referring to multiple distinct pieces of gneiss, the plural form would be correct."}],"priority":"★☆☆"},"related_words":{"derivatives":["gneissic (adjective: relating to or resembling gneiss)"],"phrases":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Gneiss is a geological term referring to a specific type of metamorphic rock characterized by its distinct banded appearance, known as foliation. This banding results from the alignment of mineral grains during metamorphism, typically under high temperature and pressure conditions. Understanding the formation and composition of gneiss requires knowledge of geological processes and mineralogy. While not a common term in everyday conversation, it is essential in geological studies and related fields."},"example_sentences":[{"sentence":"The geologist identified the rock sample as a type of banded gneiss.","translation":"地質学者はその岩石サンプルを縞状の片麻岩の一種だと特定した。","type":"noun","meaning_category":"岩石の種類"},{"sentence":"The countertop was made from a beautiful slab of gneiss.","translation":"カウンタートップは美しい片麻岩の一枚板で作られていた。","type":"noun","meaning_category":"岩石の種類"}]}