{"word":"Vindelici","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(複数形) ヴィンデリキ族：古代ローマ時代に現在のドイツ南部、バイエルン地方に居住していたケルト系の部族。","english_definition":"(plural noun) The Vindelici were a Celtic tribe who inhabited the region of present-day Southern Germany, Bavaria, during the Roman era.","examples":[{"sentence":"The Vindelici were conquered by the Roman emperor Augustus.","translation":"ヴィンデリキ族はローマ皇帝アウグストゥスによって征服された。"},{"sentence":"Archaeological findings suggest that the Vindelici had a rich culture.","translation":"考古学的発見は、ヴィンデリキ族が豊かな文化を持っていたことを示唆している。"}],"collocations":["Vindelici tribe (ヴィンデリキ族)","Roman conquest of the Vindelici (ヴィンデリキ族のローマによる征服)"],"synonyms":["N/A"],"antonyms":["N/A"]}],"etymology":{"value":"The name 'Vindelici' is believed to be of Celtic origin, possibly related to a term for 'white' or 'fair'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɪndɛˈlaɪsaɪ/","syllables":"Vin-de-li-ci"},"inflection":{"notes":"This is a plural noun. The singular form would be a hypothetical *Vindelicus*, but it is rarely used."},"usage_notes":{"explanation":"'Vindelici' refers specifically to this ancient tribe. It is primarily used in historical or archaeological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Vindelic (adjective: relating to the Vindelici)","Vindelicia (the region inhabited by the Vindelici)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vindelici' is a specialized term referring to an ancient Celtic tribe. Its use is generally limited to historical or archaeological discussions. Understanding requires familiarity with ancient history and tribal migrations in Europe.","priority":"★★☆"},"example_sentences":[{"sentence":"Roman sources describe the Vindelici as fierce warriors.","translation":"ローマの情報源は、ヴィンデリキ族を獰猛な戦士として記述している。","type":"noun","meaning_category":"ヴィンデリキ族"},{"sentence":"The Roman province of Raetia was formed after the defeat of the Vindelici.","translation":"ラエティア属州は、ヴィンデリキ族の敗北後に形成された。","type":"noun","meaning_category":"ヴィンデリキ族"}]}