{"word":"Psychostasy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代エジプトなどの宗教における)魂の重さの測定、魂の秤量","english_definition":"The weighing of souls; specifically, the weighing of a soul against a feather (representing Ma'at, truth and justice) in ancient Egyptian religion, to determine its worthiness to enter the afterlife. More generally, any similar judgment of a soul after death.","examples":[{"sentence":"In the Egyptian Book of the Dead, the psychostasy scene depicts Anubis weighing the heart of the deceased against the feather of Ma'at.","translation":"エジプトの『死者の書』では、プシュコスタシーの場面は、アヌビスが故人の心臓をマアトの羽根と天秤にかける様子を描いている。"},{"sentence":"The concept of psychostasy is present in various cultures, symbolizing the moral evaluation of a person's life after death.","translation":"プシュコスタシーの概念は様々な文化に存在し、死後の人の人生の道徳的評価を象徴している。"}],"collocations":["weighing of souls","judgment of souls","Egyptian psychostasy","Book of the Dead psychostasy"],"synonyms":["soul weighing","judgment of the dead","weighing of the heart"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ψυχοστασία (psukhostasis), from ψυχή (psukhē, “soul”) + στάσις (stasis, “a weighing”).","priority":"★★☆"},"pronunciation":{"ipa":"/saɪˈkɒstəsi/","syllables":"psy-chos-ta-sy"},"inflection":{"noun_plural":"psychostasies"},"usage_notes":{"explanation":"Psychostasy is a term primarily used in the context of ancient Egyptian religion and mythology, referring to the ritualistic weighing of the soul of a deceased person to determine their worthiness for the afterlife. The heart, believed to be the seat of the soul, was weighed against the feather of Ma'at, representing truth, justice, and cosmic balance. If the heart was lighter than or equal to the feather, the soul was deemed worthy; if heavier, it was condemned. The term can also be used more broadly to describe similar concepts of soul-weighing or judgment in other religious or mythological traditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The psychostasy was a physical process.","correct":"✓ The psychostasy was a symbolic process.","note":"Psychostasy is a symbolic representation of moral judgment, not a literal physical process."}],"priority":"★★☆"},"related_words":{"derivatives":["psychostasis (alternative spelling)"],"related_concepts":["Anubis","Ma'at","Egyptian Book of the Dead","afterlife","soul","judgment"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized term related to mythology and religious studies.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Psychostasy\" is a specialized term mainly encountered in the study of ancient religions, particularly ancient Egyptian religion. It refers to the symbolic weighing of a person's soul after death to determine their worthiness for the afterlife. The concept involves the heart of the deceased being weighed against the feather of Ma'at, representing truth and justice. This term is not commonly used in everyday language and is primarily found in academic or historical contexts related to mythology and religious studies."},"example_sentences":[{"sentence":"The scene of **psychostasy** in the tomb of Hunefer is a well-known depiction of the afterlife judgment.","translation":"フネフェルの墓にあるプシュコスタシーの場面は、死後の審判のよく知られた描写である。","type":"noun","meaning_category":"魂の秤量"},{"sentence":"The outcome of the **psychostasy** determined whether the deceased would be granted eternal life or face annihilation.","translation":"プシュコスタシーの結果は、故人が永遠の命を与えられるか、消滅に直面するかを決定した。","type":"noun","meaning_category":"魂の秤量"}]}