{"word":"Vertilinear","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"垂直線と水平線だけで構成された、直線的な","english_definition":"Characterized by straight lines, especially vertical and horizontal ones.","examples":[{"sentence":"The building's vertilinear design was stark and modern.","translation":"その建物の直線的なデザインは、むだなく近代的だった。"},{"sentence":"The artist favored vertilinear compositions in his paintings.","translation":"その芸術家は絵画において、垂直線と水平線を強調した構成を好んだ。"}],"collocations":["vertilinear design","vertilinear architecture","vertilinear pattern","vertilinear grid"],"synonyms":["rectilinear","linear","orthogonal"],"antonyms":["curvilinear","nonlinear"]},{"part_of_speech":"adjective","definition":"(写真レンズなどが)歪曲収差のない、直線が直線として写る","english_definition":"(of a photographic lens, etc.) free from distortion, so that straight lines in the subject appear straight in the image.","examples":[{"sentence":"A vertilinear lens is essential for architectural photography.","translation":"建築写真には、歪曲収差のないレンズが不可欠だ。"},{"sentence":"The vertilinear lens ensured that the building's lines remained straight in the photograph.","translation":"その歪曲収差のないレンズのおかげで、写真に写った建物の線はまっすぐだった。"}],"collocations":["vertilinear lens","vertilinear projection","vertilinear image"],"synonyms":["distortion-free","rectilinear"],"antonyms":["distorting","curvilinear"]}],"etymology":{"value":"Derived from the Latin words 'vertex' (meaning 'highest point' or 'vertical') and 'linea' (meaning 'line').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɜːrtɪˈlɪniər/","syllables":"Ver-ti-li-ne-ar"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more vertilinear' and 'most vertilinear' respectively."},"usage_notes":{"explanation":"'Vertilinear' is primarily used to describe designs, patterns, or architectural styles that heavily rely on straight lines, particularly vertical and horizontal ones. In photography, it refers to lenses or imaging systems that minimize or eliminate distortion, ensuring that straight lines in the real world are rendered as straight lines in the captured image. It is less common than 'rectilinear' but carries a similar meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building had a curvilinear design, with vertilinear accents.","correct":"✓ The building had a curvilinear design, with rectilinear accents.","note":"'Vertilinear' and 'curvilinear' are opposites. A design cannot be both at the same time, but can have elements of both."},{"incorrect":"✗ The vertilinear lens caused distortion in the image.","correct":"✓ The vertilinear lens prevented distortion in the image.","note":"A 'vertilinear' lens is designed to prevent distortion, not cause it."}],"priority":"★★☆"},"related_words":{"derivatives":["vertilinearity (noun)"],"synonyms":["rectilinear","linear","orthogonal","distortion-free"],"antonyms":["curvilinear","nonlinear","distorting"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vertilinear' is a technical term used to describe something composed of or characterized by straight lines, especially vertical and horizontal ones. It is often used in the context of architecture, design, and photography. Understanding the term requires familiarity with geometric concepts and technical vocabulary. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The cityscape was dominated by vertilinear skyscrapers.","translation":"その都市の景観は、直線的な超高層ビルが支配していた。","type":"adjective","meaning_category":"Architecture/Design"},{"sentence":"The vertilinear lens is crucial for capturing accurate architectural photographs.","translation":"歪曲収差のないレンズは、正確な建築写真を撮影する上で非常に重要だ。","type":"adjective","meaning_category":"Photography"}]}