{"word":"Street Fighter","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ストリートファイター（格闘ゲームのシリーズ名）","english_definition":"A popular fighting game franchise created by Capcom.","examples":[{"sentence":"Street Fighter is one of the most iconic fighting game series.","translation":"ストリートファイターは最も象徴的な格闘ゲームシリーズの一つです。"},{"sentence":"He is a big fan of Street Fighter and plays it every day.","translation":"彼はストリートファイターの大ファンで、毎日プレイしています。"}],"collocations":["Street Fighter II","Street Fighter V","play Street Fighter","Street Fighter character"],"synonyms":["fighting game","video game","arcade game"],"antonyms":[]}],"etymology":{"value":"The name of the video game franchise, originating from the original arcade game released in 1987.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstriːtˌfaɪtər/","syllables":"street-fight-er"},"inflection":{"noun_plural":"Street Fighters (referring to multiple games or characters)"},"usage_notes":{"explanation":"\"Street Fighter\" is primarily used as a proper noun to refer to the video game series. It can also be used more generally to describe a character within that series. When referring to multiple games or characters, the plural form \"Street Fighters\" is used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I like street fighter game.","correct":"✓ I like Street Fighter game.","note":"The name of the game is a proper noun and should be capitalized."},{"incorrect":"✗ He is a street fighter in real life.","correct":"✓ He is a street fighter.","note":"While the term could theoretically refer to someone who fights in the streets, it's overwhelmingly associated with the video game. If referring to an actual street fighter, context is crucial."}],"priority":"★★☆"},"related_words":{"derivatives":["Street Fighter II","Street Fighter Alpha","Street Fighter V","Hadoken","Shoryuken","Ryu","Ken","Guile","Chun-Li"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Proper noun, specific to gaming culture)","frequency_google_ngram":"Moderate (within gaming communities)","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"\"Street Fighter\" is a proper noun referring to a specific fighting video game series. It's widely recognized within gaming culture. While \"street fighter\" could theoretically describe someone who fights in the streets, it's almost always used to refer to the game.","priority":"★★☆"},"example_sentences":[{"sentence":"My favorite character in Street Fighter is Ryu.","translation":"ストリートファイターで一番好きなキャラクターはリュウです。","type":"noun","meaning_category":"格闘ゲームのキャラクター"},{"sentence":"The new Street Fighter game has amazing graphics.","translation":"新しいストリートファイターのゲームは素晴らしいグラフィックを持っています。","type":"noun","meaning_category":"格闘ゲームのシリーズ"}]}