{"word":"anoxaemia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"低酸素血症、血液中の酸素欠乏症","english_definition":"A deficiency of oxygen in the blood.","examples":[{"sentence":"Anoxaemia can lead to serious health problems.","translation":"低酸素血症は深刻な健康問題を引き起こす可能性があります。"},{"sentence":"The patient was diagnosed with anoxaemia due to a respiratory condition.","translation":"患者は呼吸器疾患による低酸素血症と診断されました。"}],"collocations":["cause anoxaemia","treat anoxaemia","severe anoxaemia","acute anoxaemia","chronic anoxaemia"],"synonyms":["hypoxemia","oxygen deficiency in blood"],"antonyms":["normoxemia","oxygen saturation"],"notes":"Anoxaemia is often used interchangeably with hypoxemia, although some sources distinguish them based on severity or specific causes."}],"etymology":{"value":"From Greek 'an-' (without), 'ox-' (oxygen), and 'haima' (blood).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænɒkˈsiːmiə/","syllables":"a-nox-ae-mi-a"},"inflection":{"noun_plural":"anoxaemias"},"usage_notes":{"explanation":"'Anoxaemia' refers specifically to a lack of oxygen in the arterial blood. It's a medical term often used in the context of respiratory or circulatory disorders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient had anoxia.","correct":"✓ The patient had anoxaemia.","note":"Anoxia refers to a complete lack of oxygen, while anoxaemia refers to a deficiency of oxygen in the blood. They are distinct conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["anoxic (adjective: relating to or characterized by anoxia)","hypoxia (noun: deficiency in the amount of oxygen reaching the tissues)","hypoxemic (adjective: relating to or characterized by hypoxemia)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anoxaemia' is a technical medical term referring to a deficiency of oxygen in the blood. It is primarily used in medical and scientific contexts. Understanding this term requires a background in biology or medicine. It is often used interchangeably with 'hypoxemia', although some sources may differentiate them based on severity or specific causes."},"example_sentences":[{"sentence":"High altitude can cause anoxaemia due to the reduced partial pressure of oxygen.","translation":"高地では酸素分圧が低下するため、低酸素血症を引き起こす可能性があります。","type":"medical","meaning_category":"cause"},{"sentence":"Treatment for anoxaemia typically involves oxygen therapy.","translation":"低酸素血症の治療は通常、酸素療法を伴います。","type":"medical","meaning_category":"treatment"},{"sentence":"Severe anoxaemia can lead to organ damage.","translation":"重度の低酸素血症は臓器損傷につながる可能性があります。","type":"medical","meaning_category":"severity"}]}