{"word":"interpleads","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(法律) (当事者間で所有権が争われている財産について) 裁判所に訴え、所有権の決定を求める","english_definition":"(law) to bring a lawsuit requesting a court to determine the rightful owner of property held by a stakeholder when two or more parties claim ownership.","examples":[{"sentence":"The bank interpleads the funds when multiple parties claim ownership.","translation":"複数の当事者が所有権を主張する場合、銀行は資金について裁判所に訴え、所有権の決定を求める。"},{"sentence":"The insurance company interpleaded the policy proceeds due to conflicting claims.","translation":"保険会社は、請求が競合するため、保険金の支払いについて裁判所に訴え、所有権の決定を求めた。"}],"collocations":["file an interpleader action","interplead funds","interplead proceeds"],"synonyms":["implead","sue","litigate"],"antonyms":[]},{"part_of_speech":"verb","transitivity":"vi","definition":"(法律) 裁判所に訴え、所有権の決定を求める","english_definition":"(law) to file an interpleader action.","examples":[{"sentence":"The stakeholder interpleads to avoid liability for wrongful distribution.","translation":"利害関係者は、不当な分配に対する責任を回避するために、裁判所に訴え、所有権の決定を求める。"}],"collocations":["interplead in court","interplead to avoid liability"],"synonyms":["file an interpleader","bring an interpleader action"],"antonyms":[]}],"etymology":{"value":"'Inter-' (between) + 'plead' (to argue a case in court). The word describes the act of a third party pleading on behalf of two or more claimants to property, asking the court to decide who is entitled to it.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərˈpliːdz/","syllables":"in-ter-pleads"},"inflection":{"verb_forms":{"present_simple":["interpleads"],"past_simple":"interpleaded","past_participle":"interpleaded","present_participle":"interpleading"}},"usage_notes":{"explanation":"'Interplead' is a legal term referring to a specific type of lawsuit. It is used when a party (the stakeholder) holds property that is claimed by two or more other parties, and the stakeholder does not know which party is entitled to the property. To avoid liability, the stakeholder can interplead, asking the court to determine the rightful owner.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He interpleaded with his friend.","correct":"✓ He interpleaded in court.","note":"'Interplead' is not used in general conversation. It is a legal term. It's not used to mean 'plead with someone'. Instead, it means to file a specific type of lawsuit."}],"priority":"★★☆"},"related_words":{"derivatives":["interpleader (noun): A legal action in which a party who holds property that is subject to conflicting claims asks a court to determine the rightful owner.","interpleaded (adjective): Having been subjected to an interpleader action."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Interplead' is a highly specialized legal term. It is rarely used outside of legal contexts. Understanding requires familiarity with legal procedures and terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"Because of the dispute, the escrow company **interpleads** the funds.","translation":"紛争のため、エスクロー会社は資金について裁判所に訴え、所有権の決定を求める。","type":"verb","meaning_category":"legal"},{"sentence":"The trustee **interpleads**, seeking direction from the court.","translation":"受託者は、裁判所からの指示を求めて訴えを起こす。","type":"verb","meaning_category":"legal"}]}