{"word":"non-refutability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"反論不可能性、反駁不可能性","english_definition":"The quality or state of not being able to be refuted or disproven.","examples":[{"sentence":"The non-refutability of the hypothesis made it difficult to test scientifically.","translation":"その仮説の反論不可能性は、科学的に検証することを困難にした。"},{"sentence":"Some philosophical arguments rely on non-refutability to maintain their validity.","translation":"いくつかの哲学的議論は、その妥当性を維持するために反論不可能性に依存している。"}],"collocations":["lack of refutability","principle of non-refutability"],"synonyms":["unfalsifiability","irrefutability","indisputability"],"antonyms":["refutability","falsifiability","disprovability"]}],"etymology":{"value":"Derived from 'refutability' (the ability to be refuted), with the addition of the prefix 'non-' indicating negation or absence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˌrɛfjuːtəˈbɪləti/","syllables":"non-re-fu-ta-bil-i-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Non-refutability' is often used in philosophical and scientific contexts to describe a statement or hypothesis that cannot be proven false. This can be a weakness in scientific theories, as testability and potential for falsification are important aspects of the scientific method. However, in some philosophical arguments, non-refutability might be seen as a strength.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The theory has a high non-refutability.","correct":"✓ The theory exhibits non-refutability.","note":"'Non-refutability' is a quality or state, so it's better to say a theory 'exhibits' or 'possesses' non-refutability rather than saying it 'has' a high non-refutability."}],"priority":"★★☆"},"related_words":{"derivatives":["refutable","refute","refutation","non-refutable"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-refutability' is a complex term primarily used in philosophy and science. It refers to the characteristic of a statement or theory that makes it impossible to disprove or refute through evidence or experimentation. This concept is often discussed in relation to the philosophy of science, particularly regarding the criteria for distinguishing between scientific and non-scientific claims. Understanding this term requires a grasp of abstract reasoning and familiarity with philosophical and scientific discourse."},"example_sentences":[{"sentence":"The claim's inherent non-refutability made it unsuitable for scientific inquiry.","translation":"その主張に内在する反論不可能性は、科学的探求には不向きなものにした。","type":"noun","meaning_category":"General"},{"sentence":"Critics argued that the theory's non-refutability rendered it meaningless.","translation":"批評家たちは、その理論の反論不可能性が無意味なものにしていると主張した。","type":"noun","meaning_category":"Criticism"}]}