{"word":"unspectrelike","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"幽霊らしくない、幽霊のようでない","english_definition":"Not resembling a specter or ghost; lacking the characteristics of a specter.","examples":[{"sentence":"The figure in the shadows was solid and unspectrelike, suggesting a living person rather than a ghost.","translation":"影の中の人物は実体があり幽霊らしくなく、幽霊というより生きている人間を示唆していた。"},{"sentence":"Despite the eerie setting, the atmosphere felt surprisingly unspectrelike.","translation":"不気味な設定にもかかわらず、雰囲気は驚くほど幽霊らしくなかった。"}],"collocations":["unspectrelike appearance","unspectrelike figure","unspectrelike quality"],"synonyms":["unghostly","non-spectral","corporeal","substantial","real"],"antonyms":["spectrelike","ghostly","spectral","ethereal","insubstantial"]}],"etymology":{"value":"\"un-\" (否定) + \"spectrelike\" (幽霊のような)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈspektrəˌlaɪk/","syllables":"un-spec-tre-like"},"inflection":{"adjective_forms":{"comparative":"more unspectrelike","superlative":"most unspectrelike"}},"usage_notes":{"explanation":"This word is used to describe something that does not have the qualities or appearance of a specter or ghost. It emphasizes the absence of spectral or ghostly characteristics. It is a relatively rare word, often used in descriptive or literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The room was unspectrelike of furniture.","correct":"✓ The room was devoid of furniture.","note":"\"Unspectrelike\" describes the absence of ghostly qualities, not the absence of objects. Use \"devoid of\" or \"lacking\" to describe the absence of furniture."},{"incorrect":"✗ He acted very unspectrelike.","correct":"✓ He acted very normally.","note":"\"Unspectrelike\" describes appearance or qualities, not behavior. Use \"normal\" or \"ordinary\" to describe behavior."}],"priority":"★★☆"},"related_words":{"derivatives":["specter","spectral","spectrally","spectrelike"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'unspectrelike' is a relatively rare and complex word. It is formed by adding the prefix 'un-' (meaning 'not') to 'spectrelike', which means 'resembling a specter or ghost'. Therefore, 'unspectrelike' means 'not resembling a specter or ghost'. This word is typically used in descriptive or literary contexts to emphasize the absence of ghostly or spectral qualities in something. Due to its rarity and complexity, it is more likely to be encountered by advanced English learners or native speakers in literature or specialized texts."},"example_sentences":[{"sentence":"The solid, unspectrelike form of the tree stood starkly against the moonlit sky.","translation":"その木の実体があり幽霊らしくない姿が、月明かりの空に際立って立っていた。","type":"adjective","meaning_category":"appearance"},{"sentence":"The atmosphere in the old house was surprisingly unspectrelike, lacking any sense of haunting or dread.","translation":"古い家の雰囲気は驚くほど幽霊らしくなく、取り憑かれたような感覚や恐怖感は全くなかった。","type":"adjective","meaning_category":"atmosphere"},{"sentence":"The detective dismissed the witness's claim, noting that the described figure was far too corporeal and unspectrelike to be a ghost.","translation":"刑事は目撃者の主張を退け、描写された人物があまりにも実体的で幽霊らしくなく、幽霊であるはずがないと述べた。","type":"adjective","meaning_category":"description"}]}