{"word":"Deflorescence","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"風化; (結晶の)風解","english_definition":"The process of losing moisture or water of hydration by a hydrate, which occurs when the aqueous vapor pressure of the hydrate is greater than the partial pressure of water in the atmosphere. Also, the formation of a powdery surface on concrete or masonry.","examples":[{"sentence":"The deflorescence of the mineral sample was evident after being left in the open air.","translation":"その鉱物標本は、外気にさらされた後、風解が明らかになった。"},{"sentence":"The white powdery deposit on the brick wall was a sign of deflorescence.","translation":"レンガの壁に見られる白い粉状の堆積物は、風化の兆候だった。"}],"collocations":["surface deflorescence","salt deflorescence","concrete deflorescence"],"synonyms":["efflorescence","weathering","desiccation"],"antonyms":["hydration","water absorption"]}],"etymology":{"value":"From Latin 'de-' (away from) + 'florescere' (to begin to blossom), referring to the loss of crystalline structure or surface appearance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːflɒˈrɛsəns/","syllables":"De-flo-res-cence"},"inflection":{"noun_plural":"Deflorescences"},"usage_notes":{"explanation":"'Deflorescence' refers specifically to the loss of water of hydration from a substance, often resulting in a powdery surface. It is commonly used in the context of mineralogy, chemistry, and construction (especially concerning concrete and masonry). It is distinct from 'efflorescence', although the two terms are sometimes used interchangeably; efflorescence more broadly refers to the migration of salts to a surface, where they form a coating.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The deflorescence caused the plant to grow faster.","correct":"✓ The deflorescence was observed on the mineral sample.","note":"Deflorescence is a process of losing moisture or water of hydration, not a cause of plant growth."},{"incorrect":"✗ Efflorescence is the opposite of deflorescence.","correct":"✓ Hydration is the opposite of deflorescence.","note":"Hydration is the opposite of deflorescence, while efflorescence is a related but distinct phenomenon involving salt migration."}],"priority":"★★☆"},"related_words":{"derivatives":["Deflorescent (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deflorescence' is a technical term primarily used in scientific and construction contexts to describe the process by which a hydrated substance loses water, often resulting in a powdery surface. Understanding this term requires familiarity with concepts from chemistry, mineralogy, or materials science. It is not a commonly used word in everyday language."},"example_sentences":[{"sentence":"The laboratory analysis confirmed the deflorescence of the hydrated salt crystals.","translation":"実験室での分析により、水和塩結晶の風解が確認された。","type":"noun","meaning_category":"風解"},{"sentence":"Deflorescence can weaken the structural integrity of concrete over time.","translation":"風化は時間の経過とともにコンクリートの構造的完全性を弱める可能性がある。","type":"noun","meaning_category":"風化"}]}