{"word":"spectrous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"幽霊のような、亡霊のような、幻影の","english_definition":"Resembling or characteristic of a specter; ghostly; spectral.","examples":[{"sentence":"The spectrous figure glided through the darkened halls.","translation":"幽霊のような姿が暗い廊下を滑るように通り抜けた。"},{"sentence":"A spectrous light flickered in the abandoned house.","translation":"廃屋の中で幽霊のような光がちらついた。"},{"sentence":"The forest took on a spectrous appearance in the thick fog.","translation":"濃い霧の中で、森は幻影のような様相を呈した。"}],"collocations":["spectrous apparition (幽霊の出現)","spectrous form (幽霊の姿)","spectrous glow (幽霊のような光)","spectrous image (幽霊のようなイメージ)","spectrous landscape (幽霊のような風景)"],"synonyms":["ghostly","spectral","phantom","wraithlike","ethereal","insubstantial"],"antonyms":["substantial","real","tangible","corporeal"]}],"etymology":{"value":"Derived from 'specter' (a visible incorporeal spirit, especially one of a terrifying nature; ghost; phantom) + '-ous' (having the quality of). 'Specter' comes from Latin 'spectrum' (an appearance, image, apparition, specter), from 'specere' (to look at).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspɛktrəs/","syllables":"spec-trous"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Spectrous' is primarily used in literary or descriptive contexts to evoke a sense of the supernatural, eeriness, or otherworldliness. It is often used to describe things that are vaguely defined, shadowy, or reminiscent of ghosts or phantoms. It is less common in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The spectrous material felt warm to the touch.","correct":"✓ The diaphanous material felt warm to the touch.","note":"'Spectrous' implies a ghostly or unreal quality, so it's not appropriate for describing tangible materials. Use words like 'diaphanous' or 'sheer' instead."},{"incorrect":"✗ He had a spectrous idea for a business.","correct":"✓ He had a visionary idea for a business.","note":"'Spectrous' relates to ghosts or phantoms, not to innovative or imaginative ideas. Use 'visionary' or 'innovative' in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["specter (名詞: 幽霊、亡霊)","spectral (形容詞: スペクトル的な、幽霊のような)","spectrum (名詞: スペクトル、範囲)"],"related_concepts":["apparition","phantom","ghost","haunting","supernatural"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'spectrous' is relatively uncommon and is primarily used in literary or descriptive contexts. It describes something that has the qualities of a specter or ghost, suggesting an eerie or supernatural atmosphere. Understanding this word requires a strong vocabulary and familiarity with literary language. It is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The old castle had a spectrous presence that sent shivers down her spine.","translation":"その古い城は、彼女の背筋をゾッとさせるような幽霊のような存在感を放っていた。","type":"adjective","meaning_category":"幽霊のような"},{"sentence":"In the dim light, the trees cast spectrous shadows on the ground.","translation":"薄暗い光の中で、木々は地面に幽霊のような影を落とした。","type":"adjective","meaning_category":"幻影の"},{"sentence":"The abandoned town had a spectrous silence that was both unsettling and intriguing.","translation":"その廃墟の町は、不安と興味をそそる幽霊のような静けさに包まれていた。","type":"adjective","meaning_category":"亡霊のような"}]}