{"word":"paymastership","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"会計長官の地位、会計長官の職務、会計長官の任期","english_definition":"The position or office of a paymaster; the tenure of a paymaster.","examples":[{"sentence":"He was appointed to the paymastership of the regiment.","translation":"彼は連隊の会計長官に任命された。"},{"sentence":"The paymastership is a responsible position requiring careful attention to detail.","translation":"会計長官の職は、細部への注意を要する責任ある地位である。"}],"collocations":["hold the paymastership","appointment to the paymastership","duties of the paymastership"],"synonyms":["treasurership","comptrollership","financial directorship"],"antonyms":[]}],"etymology":{"value":"'Paymaster' + '-ship'. The suffix '-ship' denotes a state, condition, office, or dignity. Thus, 'paymastership' signifies the office or state of being a paymaster.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpeɪˌmæstərʃɪp/","syllables":"pay-mas-ter-ship"},"inflection":{"noun_plural":"paymasterships"},"usage_notes":{"explanation":"'Paymastership' refers specifically to the role, responsibilities, and period of service of a paymaster. It is often used in formal or official contexts, particularly within military or governmental organizations. The term emphasizes the administrative and financial duties associated with managing payments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He applied for the paymaster.","correct":"He applied for the paymastership.","note":"'Paymaster' refers to the person, while 'paymastership' refers to the position or office."}],"priority":"★★☆"},"related_words":{"derivatives":["paymaster"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'paymastership' is a formal term referring to the role or position of a paymaster, who is responsible for managing payments, often within an organization or military context. It is a relatively uncommon word, primarily used in formal or official settings. Understanding the term requires knowledge of the role of a paymaster and the suffix '-ship', which denotes a position or office."},"example_sentences":[{"sentence":"The responsibilities of the paymastership included managing the payroll and disbursing funds.","translation":"会計長官の職務には、給与管理と資金の支払いが含まれていた。","type":"general","meaning_category":"職務"},{"sentence":"The candidate's experience made him a strong contender for the paymastership.","translation":"候補者の経験は、彼を会計長官の有力な候補者にした。","type":"general","meaning_category":"地位"}]}