{"word":"corticoid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"コルチコイド","english_definition":"A steroid hormone produced by the adrenal cortex or a synthetic analog with similar effects; used as an anti-inflammatory or immunosuppressant.","examples":[{"sentence":"Corticoids are often prescribed to treat inflammatory conditions.","translation":"コルチコイドは炎症性疾患の治療によく処方されます。"},{"sentence":"Long-term use of corticoids can have side effects.","translation":"コルチコイドの長期使用は副作用を伴うことがあります。"}],"collocations":["corticoid cream","oral corticoid","inhaled corticoid","topical corticoid","corticoid therapy","corticoid injection"],"synonyms":["steroid","glucocorticoid","mineralocorticoid"],"antonyms":[]}],"etymology":{"value":"From 'cortex' (referring to the adrenal cortex) + '-oid' (resembling).","priority":"★★☆"},"pronunciation":{"ipa":"ˈkɔːrtɪˌkɔɪd","syllables":"cor-ti-coid"},"inflection":{"noun_plural":"corticoids"},"usage_notes":{"explanation":"'Corticoid' generally refers to a class of steroid hormones, either those produced naturally by the adrenal cortex or synthetic versions. They are used medically for their anti-inflammatory and immunosuppressant properties. It is important to note that 'corticoid' is a general term, and specific types include glucocorticoids (like cortisol) and mineralocorticoids (like aldosterone).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Corticoids are a type of antibiotic.","correct":"✓ Corticoids are a type of steroid hormone.","note":"Corticoids are steroid hormones, not antibiotics."},{"incorrect":"✗ You can buy corticoids over the counter.","correct":"✓ Corticoids usually require a prescription.","note":"Most corticoids require a prescription due to their potential side effects."}],"priority":"★★☆"},"related_words":{"derivatives":["corticosteroid","glucocorticoid","mineralocorticoid"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Corticoid' is a technical term used in medicine to refer to steroid hormones produced by the adrenal cortex or synthetic analogs. Understanding this term requires a background in biology or medicine. It is often used in the context of discussing treatments for inflammatory conditions or immune disorders. The term is more common in medical literature and discussions among healthcare professionals.","example_sentences":[]},"example_sentences":[{"sentence":"The doctor prescribed a corticoid cream for my eczema.","translation":"医師は私の湿疹にコルチコイドクリームを処方しました。","type":"noun","meaning_category":"medication"},{"sentence":"Corticoid injections can provide temporary relief from joint pain.","translation":"コルチコイド注射は関節痛を一時的に緩和することができます。","type":"noun","meaning_category":"medication"},{"sentence":"Patients on long-term corticoid therapy need to be monitored for side effects.","translation":"コルチコイド療法を長期にわたって受けている患者は、副作用について監視する必要があります。","type":"noun","meaning_category":"medication"}]}