{"word":"exophasic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(言語学で)文脈依存的な、文脈によって意味が変化する","english_definition":"(linguistics) dependent on context for interpretation; having a meaning that varies according to context.","examples":[{"sentence":"The word 'bank' is exophasic because its meaning changes depending on whether you're talking about a river or a financial institution.","translation":"「bank」という単語は、川について話しているのか金融機関について話しているのかによって意味が変わるため、文脈依存的です。"},{"sentence":"Exophasic references require shared knowledge between the speaker and listener to be understood.","translation":"文脈依存的な言及は、理解されるためには話し手と聞き手の間の共有知識が必要です。"}],"collocations":["exophasic reference","exophasic expression","exophasic element"],"synonyms":["context-dependent","deictic","indexical"],"antonyms":["endophasic","context-free","self-explanatory"]}],"etymology":{"value":"The term 'exophasic' is derived from the Greek words 'exo-' meaning 'outside' and 'phasic' relating to 'phase' or 'expression'. It suggests that the meaning is determined by something outside the expression itself, namely the context.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛksoʊˈfeɪzɪk/","syllables":"ex-o-pha-sic"},"inflection":{"notes":"The word 'exophasic' is an adjective and does not have different inflectional forms."},"usage_notes":{"explanation":"'Exophasic' is a term primarily used in linguistics, particularly in the fields of semantics and pragmatics. It describes linguistic elements whose meaning cannot be fully understood without reference to the context in which they are used. This context can include the surrounding text, the speaker's intentions, and the shared knowledge between the speaker and listener.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The meaning of 'exophasic' is clear without any context.","correct":"✓ The meaning of 'exophasic' is not clear without context.","note":"By definition, 'exophasic' means that context is necessary for understanding the meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["exophora (noun): reference to something outside the text","endophasic (adjective): context-independent"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Exophasic' is a technical term used in linguistics to describe words or phrases that require contextual information for their interpretation. It's not a common word in everyday language and is primarily used in academic discussions of language and meaning. Understanding this term requires a solid grasp of linguistic concepts like semantics and pragmatics."},"example_sentences":[{"sentence":"Pronouns are often exophasic, as their meaning depends on who or what they refer to in the specific situation.","translation":"代名詞は、その意味が特定の状況で誰または何を参照するかに依存するため、多くの場合文脈依存的です。","type":"example","meaning_category":"linguistics"},{"sentence":"The interpretation of exophasic language elements is a key aspect of pragmatic analysis.","translation":"文脈依存的な言語要素の解釈は、語用論的分析の重要な側面です。","type":"example","meaning_category":"linguistics"}]}