{"word":"Brothership","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"兄弟関係、兄弟愛、兄弟の絆","english_definition":"The relationship between brothers; the bond of affection and loyalty between brothers; a sense of camaraderie and shared experience similar to that between brothers.","examples":[{"sentence":"The brothership between the soldiers was forged in the heat of battle.","translation":"兵士たちの兄弟愛は、激戦の中で育まれた。"},{"sentence":"The club promoted a strong sense of brothership among its members.","translation":"そのクラブは、メンバー間の強い兄弟意識を促進した。"},{"sentence":"Their brothership was tested by the challenges they faced together.","translation":"彼らの兄弟の絆は、共に直面した困難によって試された。"}],"collocations":["strong brothership","close brothership","foster brothership","maintain brothership","brothership and loyalty"],"synonyms":["brotherhood","camaraderie","fellowship","fraternity","comradeship","kinship","bond","unity"],"antonyms":["enmity","rivalry","discord","antagonism"]}],"etymology":{"value":"Derived from the word 'brother' combined with the suffix '-ship', which denotes a state, condition, or quality.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbrʌðərʃɪp/","syllables":"broth-er-ship"},"inflection":{"noun_plural":"brotherships"},"usage_notes":{"explanation":"'Brothership' emphasizes the emotional connection, loyalty, and shared experiences that characterize the relationship between brothers or a group of people who feel a similar bond. It is often used to describe a strong sense of camaraderie and mutual support. While 'brotherhood' is a more common and widely understood term, 'brothership' can add a more personal and intimate nuance to the relationship being described.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The brothership of the organization includes only women.","correct":"✓ The brotherhood of the organization includes only women.","note":"While 'brothership' can be used more generally, 'brotherhood' is traditionally associated with male-dominated groups or organizations. For mixed-gender or female-only groups, 'sisterhood', 'fellowship', or 'camaraderie' might be more appropriate."},{"incorrect":"✗ They have a brothership relationship.","correct":"✓ They have a brothership. / ✓ They have a brotherly relationship.","note":"'Brothership' itself implies a relationship, so adding 'relationship' is redundant. 'Brotherly relationship' is also correct but less concise."}],"priority":"★★☆"},"related_words":{"derivatives":["brother","brotherhood","brotherly","sisterhood","relationship","kinship"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency compared to 'brotherhood'.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Brothership' is a noun that describes the close and supportive relationship between brothers, or a similar bond between people who share strong camaraderie and loyalty. It's like saying they have a special connection, like family. While 'brotherhood' is more common, 'brothership' highlights the personal and emotional aspects of the bond. You might see it used to describe soldiers, teammates, or close friends who have been through a lot together. It emphasizes the feeling of being there for each other, no matter what."},"example_sentences":[{"sentence":"The brothership between the two friends grew stronger over the years.","translation":"その二人の友人の兄弟愛は、年月を経て強くなった。","type":"noun","meaning_category":"兄弟愛"},{"sentence":"The team's success was built on a foundation of brothership and mutual respect.","translation":"チームの成功は、兄弟愛と相互尊重の基盤の上に築かれた。","type":"noun","meaning_category":"兄弟の絆"},{"sentence":"He valued the brothership he shared with his fellow veterans.","translation":"彼は戦友たちと分かち合う兄弟愛を大切にした。","type":"noun","meaning_category":"兄弟関係"},{"sentence":"The organization aims to foster a sense of brothership among its members.","translation":"その組織は、メンバー間の兄弟愛を育むことを目指している。","type":"noun","meaning_category":"兄弟の絆"},{"sentence":"Their shared experiences created a deep brothership that transcended their differences.","translation":"彼らの共有した経験は、彼らの違いを超越した深い兄弟愛を生み出した。","type":"noun","meaning_category":"兄弟関係"}]}