{"word":"Anaerobes","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"嫌気性生物","english_definition":"Microorganisms that do not require oxygen for growth and may even be killed by it.","examples":[{"sentence":"Anaerobes are often found in soil, aquatic sediments, and the digestive tracts of animals.","translation":"嫌気性生物は、土壌、水生堆積物、動物の消化管によく見られます。"},{"sentence":"Some anaerobes are pathogenic and can cause serious infections.","translation":"一部の嫌気性生物は病原性であり、深刻な感染症を引き起こす可能性があります。"}],"collocations":["obligate anaerobes (偏性嫌気性菌)","facultative anaerobes (通性嫌気性菌)","anaerobic respiration (嫌気呼吸)","anaerobic bacteria (嫌気性細菌)"],"synonyms":["anaerobic organisms","anaerobic microorganisms"],"antonyms":["aerobes (好気性生物)"]},{"part_of_speech":"adjective","definition":"嫌気性の","english_definition":"Living, active, occurring, or existing in the absence of free oxygen.","examples":[{"sentence":"Anaerobic conditions are necessary for the growth of some bacteria.","translation":"一部の細菌の成長には嫌気的条件が必要です。"},{"sentence":"Anaerobic exercise is a type of exercise that does not require oxygen.","translation":"嫌気性運動は、酸素を必要としない運動の一種です。"}],"collocations":["anaerobic bacteria (嫌気性細菌)","anaerobic respiration (嫌気呼吸)","anaerobic digestion (嫌気性消化)","anaerobic environment (嫌気性環境)"],"synonyms":["non-aerobic"],"antonyms":["aerobic"]}],"etymology":{"value":"Derived from the Greek words 'an-' (not), 'aer' (air), and 'bios' (life), meaning 'living without air'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænəˈroʊbz/","syllables":"an-a-robes"},"inflection":{"noun_plural":"Anaerobes"},"usage_notes":{"explanation":"'Anaerobes' refers to organisms, especially microorganisms like bacteria, that can survive and grow in the absence of oxygen. They are classified based on their response to oxygen: obligate anaerobes are killed by oxygen, while facultative anaerobes can grow with or without oxygen. The term is also used adjectivally to describe conditions or processes that occur without oxygen, such as anaerobic respiration or anaerobic exercise.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Aerobes are organisms that don't need air.","correct":"✓ Anaerobes are organisms that don't need air.","note":"Aerobes require oxygen, while anaerobes do not."},{"incorrect":"✗ The process is aerobic because it doesn't use oxygen.","correct":"✓ The process is anaerobic because it doesn't use oxygen.","note":"Anaerobic processes occur without oxygen, while aerobic processes require it."}],"priority":"★★☆"},"related_words":{"derivatives":["anaerobic (adjective)","anaerobically (adverb)","anaerobiosis (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific or medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anaerobes' refers to organisms, particularly microorganisms, that thrive in environments devoid of oxygen. These organisms employ metabolic processes that don't require oxygen, distinguishing them from aerobes, which need oxygen to survive. The term is frequently encountered in scientific and medical contexts, specifically in discussions about microbiology, biochemistry, and infectious diseases. Understanding the distinction between anaerobes and aerobes is crucial in these fields.","priority":"★★★"},"example_sentences":[{"sentence":"The scientist studied the growth of anaerobes in a controlled environment.","translation":"科学者は、制御された環境下での嫌気性生物の成長を研究しました。","type":"noun","meaning_category":"嫌気性生物"},{"sentence":"Anaerobic digestion is used to treat organic waste.","translation":"嫌気性消化は、有機廃棄物の処理に使用されます。","type":"adjective","meaning_category":"嫌気性の"},{"sentence":"Some anaerobes are responsible for causing tetanus.","translation":"一部の嫌気性生物は破傷風の原因となります。","type":"noun","meaning_category":"嫌気性生物"},{"sentence":"Anaerobic conditions in the soil can lead to the production of methane.","translation":"土壌中の嫌気的条件は、メタンの生成につながる可能性があります。","type":"adjective","meaning_category":"嫌気性の"}]}