{"word":"Eskimoic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"エスキモー諸語の、エスキモー諸語に関する","english_definition":"Relating to the Eskimo languages.","examples":[{"sentence":"The Eskimoic languages are spoken in the Arctic regions of North America and Siberia.","translation":"エスキモー諸語は、北米とシベリアの北極圏で話されています。"}],"collocations":["Eskimoic language family","Eskimoic peoples"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"エスキモー諸語","english_definition":"A family of languages spoken by Inuit and Yupik peoples in the Arctic regions of North America and Siberia.","examples":[{"sentence":"Eskimoic includes languages such as Inuktitut and Yupik.","translation":"エスキモー諸語には、イヌクティトゥット語やユピック語などの言語が含まれます。"}],"collocations":["study of Eskimoic","dialects of Eskimoic"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'Eskimo' + '-ic'. The term 'Eskimo' itself has debated origins, possibly from an Algonquian language meaning 'eaters of raw meat'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛskɪˈmoʊɪk/","syllables":"Es-ki-mo-ic"},"inflection":{"notes":"Adjective: Eskimoic; Noun: Eskimoic (uncountable)"},"usage_notes":{"explanation":"The term 'Eskimoic' is primarily used in linguistics to refer to the language family. The term 'Eskimo' itself is considered offensive by some Inuit people, particularly in Canada, who prefer the term 'Inuit'. Therefore, when referring to the people, it is often more appropriate to use 'Inuit' or 'Yupik' depending on the specific group. When referring to the language family in a technical context, 'Eskimoic' is still commonly used, but sensitivity to the term 'Eskimo' should be considered.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Eskimoic people live in Alaska.","correct":"✓ Inuit and Yupik people live in Alaska.","note":"Use 'Inuit' or 'Yupik' when referring to the people, not 'Eskimoic'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Eskimo","Inuit","Yupik","Aleut"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Eskimoic' is a technical term primarily used in linguistics to refer to a family of languages spoken by Inuit and Yupik peoples. It's important to note that the term 'Eskimo' can be considered offensive, so it's generally better to use 'Inuit' or 'Yupik' when referring to the people themselves. 'Eskimoic' is mostly used in academic or technical contexts when discussing the language family.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Eskimoic languages are known for their polysynthetic nature.","translation":"エスキモー諸語は、抱合語的な性質で知られています。","type":"adjective","meaning_category":"Linguistic"},{"sentence":"Linguists study the Eskimoic language family to understand its historical development.","translation":"言語学者は、その歴史的発展を理解するために、エスキモー諸語族を研究しています。","type":"noun","meaning_category":"Linguistic"}]}