{"word":"angiocardiography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"血管心臓造影法（けっかんしんぞうぞうえいほう）：血管と心臓をX線で観察するために、造影剤を注入する医療処置","english_definition":"radiographic visualization of the heart and great vessels after intravenous injection of a radiopaque contrast medium","examples":[{"sentence":"Angiocardiography is used to diagnose congenital heart defects.","translation":"血管心臓造影法は、先天性心疾患の診断に用いられる。"},{"sentence":"The doctor recommended angiocardiography to assess the extent of the heart damage.","translation":"医師は心臓の損傷の程度を評価するために血管心臓造影法を推奨した。"}],"collocations":["perform angiocardiography (血管心臓造影法を行う)","undergo angiocardiography (血管心臓造影法を受ける)"],"synonyms":["cardioangiography"],"antonyms":[]}],"etymology":{"value":"'angio-' (血管), 'cardio-' (心臓), and '-graphy' (記録) の組み合わせ。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌændʒioʊˌkɑːrdioʊˈɡrɑːfi/","syllables":"an-gi-o-car-di-o-gra-phy"},"inflection":{"noun_plural":"angiocardiographies"},"usage_notes":{"explanation":"Angiocardiography is a medical imaging technique used to visualize the heart chambers, valves, and major blood vessels. It involves injecting a contrast dye into the bloodstream and then taking X-ray images to highlight these structures. While it was a common diagnostic tool in the past, it has largely been replaced by less invasive techniques such as echocardiography and cardiac MRI.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ angiocardiography is a simple procedure with no risks.","correct":"✓ angiocardiography, like any invasive procedure, carries some risks.","note":"While angiocardiography can provide valuable diagnostic information, it is an invasive procedure and carries potential risks such as allergic reactions to the contrast dye, bleeding, or infection."}],"priority":"★☆☆"},"related_words":{"derivatives":["angiocardiogram (血管心臓造影写真)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Angiocardiography is a complex medical term referring to a specific diagnostic procedure. Understanding this term requires familiarity with medical terminology and cardiovascular anatomy. It is primarily used in medical contexts and is not commonly encountered in general language. Due to its specialized nature, it is considered a high-level term.","priority":"★☆☆"},"example_sentences":[{"sentence":"The patient underwent angiocardiography to determine the cause of chest pain.","translation":"患者は胸痛の原因を特定するために血管心臓造影法を受けた。","type":"general","meaning_category":"medical procedure"},{"sentence":"Advances in non-invasive imaging have reduced the need for angiocardiography.","translation":"非侵襲的イメージングの進歩により、血管心臓造影法の必要性が減少した。","type":"general","meaning_category":"medical procedure"}]}