{"word":"pseudoreligiously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"宗教的でないのに宗教的なふりをして、見せかけの信仰心をもって","english_definition":"In a manner that falsely or superficially resembles religious behavior or belief.","examples":[{"sentence":"He pseudoreligiously attended church every Sunday to impress his neighbors.","translation":"彼は近所の人に良い印象を与えようと、宗教的でないのに毎週日曜日に教会に通っていた。"},{"sentence":"The politician pseudoreligiously invoked divine guidance in his speeches.","translation":"その政治家は演説で、見せかけの信仰心から神の導きを求めた。"}],"collocations":["act pseudoreligiously","invoke divine guidance pseudoreligiously"],"synonyms":["hypocritically","sanctimoniously","piously (insincere)"],"antonyms":["sincerely","genuinely","authentically"]}],"etymology":{"value":"The word is formed by combining \"pseudo-\" (meaning false or fake) with \"religiously\" (in a religious manner). It implies an insincere or superficial imitation of religious behavior.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːdoʊrɪˈlɪdʒəsli/","syllables":"pseu-do-re-li-gious-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"The term \"pseudoreligiously\" is used to describe actions or behaviors that mimic religious devotion but lack genuine faith or sincerity. It often carries a negative connotation, suggesting hypocrisy or manipulation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted pseudoreligious.","correct":"✓ He acted pseudoreligiously.","note":"'Pseudoreligiously' is an adverb, so it modifies a verb. 'Pseudoreligious' is an adjective and would modify a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudoreligious (adjective)","pseudoreligion (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'pseudoreligiously' is a complex adverb used to describe actions performed in a way that superficially resembles religious devotion but lacks genuine sincerity. It is typically used in formal or academic contexts to critique or analyze behavior that appears hypocritical or manipulative. Understanding the prefixes 'pseudo-' (false) and the root word 'religious' is essential to grasping its meaning. This word is not commonly encountered in everyday conversation."},"example_sentences":[{"sentence":"The cult leader pseudoreligiously preached about love and compassion while exploiting his followers.","translation":"そのカルト指導者は信者たちを搾取しながら、見せかけの信仰心から愛と慈悲について説教した。","type":"adverb","meaning_category":"insincere religious behavior"},{"sentence":"The company pseudoreligiously promoted environmental sustainability to improve its public image.","translation":"その会社は世間のイメージを良くするために、見せかけの信仰心から環境の持続可能性を推進した。","type":"adverb","meaning_category":"insincere promotion of values"}]}