{"word":"dermatotropic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"皮膚に向性のある、皮膚親和性のある","english_definition":"Having an affinity for or exerting its effect primarily on the skin.","examples":[{"sentence":"This virus is dermatotropic, causing skin lesions.","translation":"このウイルスは皮膚向性があり、皮膚病変を引き起こします。"},{"sentence":"Dermatotropic drugs are used to treat skin conditions.","translation":"皮膚向性の薬は皮膚疾患の治療に使用されます。"}],"collocations":["dermatotropic virus","dermatotropic drug","dermatotropic effect"],"synonyms":["dermotropic","skin-seeking"],"antonyms":["systemic"],"notes":"Often used in the context of viruses, drugs, or other agents that target the skin."}],"etymology":{"value":"From 'derma-' (skin) + '-tropic' (turning, changing, having an affinity for).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌdɜːrmətoʊˈtrɒpɪk/","syllables":"der-ma-to-tro-pic"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"'Dermatotropic' describes something that has a particular attraction to or effect on the skin. It is commonly used in medical and scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The disease is dermatotropic to the liver.","correct":"✓ The disease is hepatotropic. / ✓ The disease affects the liver.","note":"'Dermatotropic' specifically refers to the skin. If an agent affects the liver, use 'hepatotropic' or a more general description."}],"priority":"★☆☆"},"related_words":{"derivatives":["dermatotropism (noun: the tendency to affect the skin)"],"related_terms":["cutaneous","dermatology","tropic"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily found in medical or scientific literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Dermatotropic' is a specialized term primarily used in medical or scientific contexts to describe agents or substances that have a specific affinity for the skin. It is not commonly used in everyday language. Understanding this term requires a background in biology or medicine."},"example_sentences":[{"sentence":"The research focused on identifying dermatotropic viruses.","translation":"その研究は皮膚向性ウイルスの特定に焦点を当てていた。","type":"general","meaning_category":"skin affinity"},{"sentence":"Certain medications are designed to have a dermatotropic effect to minimize systemic side effects.","translation":"特定の薬は、全身性の副作用を最小限に抑えるために皮膚向性の効果を持つように設計されている。","type":"medical","meaning_category":"medical effect"}]}