{"word":"defogger","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(自動車などの)曇り止め装置、デフォッガー","english_definition":"A device or substance used to remove fog or condensation from a surface, especially a windshield or window.","examples":[{"sentence":"Turn on the defogger to clear the windshield.","translation":"フロントガラスをクリアにするためにデフォッガーをオンにしてください。"},{"sentence":"The car's rear defogger wasn't working.","translation":"車のリアデフォッガーが作動していなかった。"},{"sentence":"Use a defogger spray on your bathroom mirror to prevent it from fogging up.","translation":"浴室の鏡が曇るのを防ぐために、曇り止めスプレーを使用してください。"}],"collocations":["windshield defogger","rear defogger","defogger spray","turn on the defogger","use a defogger"],"synonyms":["demister","antifog","antifogging agent"],"antonyms":[]},{"part_of_speech":"noun","definition":"曇り止め剤","english_definition":"A chemical substance used to prevent the formation of fog or condensation.","examples":[{"sentence":"Apply defogger to your glasses before swimming.","translation":"水泳の前にメガネに曇り止めを塗ってください。"},{"sentence":"This defogger is effective for scuba diving masks.","translation":"この曇り止めはスキューバダイビングのマスクに効果的です。"}],"collocations":["apply defogger","defogger for glasses","defogger for masks"],"synonyms":["antifogging agent","antifog solution"],"antonyms":[]}],"etymology":{"value":"The word \"defogger\" is formed by combining the prefix \"de-\" (meaning to remove or reverse) with the word \"fogger\" (referring to something that causes fog or, in this case, the fog itself).","priority":"★☆☆"},"pronunciation":{"ipa":"/diːˈfɒɡər/","syllables":"de-fog-ger"},"inflection":{"noun_plural":"defoggers"},"usage_notes":{"explanation":"The term \"defogger\" is most commonly used in the context of automobiles to refer to the heating or ventilation system designed to clear condensation from the windshield or rear window. It can also refer to chemical solutions used to prevent fogging on surfaces like glasses, mirrors, or diving masks.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I put a defogger on the car's window.","correct":"✓ I used the defogger on the car's window.","note":"'Defogger' refers to the system or the chemical substance, not something you place on the window. You 'use' the defogger or 'apply' a defogger spray."}],"priority":"★☆☆"},"related_words":{"derivatives":["defog (verb): to remove fog from something"],"phrasal_verbs":[],"related_terms":["fog","foggy","condensation","demist"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"defogger\" is a compound word that is relatively straightforward to understand. It refers to something that removes fog. It is commonly used in the context of cars, referring to the system that clears the windshield. It can also refer to sprays or solutions used to prevent fogging on surfaces like glasses or mirrors. The word is not extremely common but is easily understood in the right context."},"example_sentences":[{"sentence":"The **defogger** quickly cleared the condensation from the windshield, improving visibility.","translation":"デフォッガーはすぐにフロントガラスの結露を取り除き、視界を改善しました。","type":"noun","meaning_category":"曇り止め装置"},{"sentence":"She applied **defogger** to her swimming goggles before entering the pool.","translation":"彼女はプールに入る前に水泳ゴーグルに曇り止めを塗りました。","type":"noun","meaning_category":"曇り止め剤"}]}