{"word":"Senecan","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"セネカの、セネカ風の","english_definition":"Of or relating to Seneca the Younger, his writings, or his philosophical style.","examples":[{"sentence":"The play was written in a Senecan style, full of dramatic irony and moralizing.","translation":"その劇はセネカ風のスタイルで書かれ、劇的なアイロニーと教訓に満ちていた。"},{"sentence":"Senecan tragedy is characterized by its violence and rhetorical speeches.","translation":"セネカ悲劇は、その暴力性と修辞的な演説によって特徴付けられる。"}],"collocations":["Senecan tragedy","Senecan style","Senecan drama","Senecan philosophy"],"synonyms":["Stoic","moralistic","rhetorical","tragic"],"antonyms":[]},{"part_of_speech":"noun","definition":"セネカ風の作家、セネカ風の作品","english_definition":"A writer or work in the style of Seneca the Younger.","examples":[{"sentence":"He was a Senecan, known for his dramatic and often violent plays.","translation":"彼はセネカ風の作家で、劇的でしばしば暴力的な劇で知られていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Seneca the Younger (c. 4 BC – AD 65), Roman Stoic philosopher, statesman, and dramatist, + -an.","priority":"★★★"},"pronunciation":{"ipa":"/sɪˈniːkən/","syllables":"Se-ne-can"},"inflection":{},"usage_notes":{"explanation":"'Senecan' refers to anything related to Seneca the Younger, a Roman philosopher, statesman, and dramatist. As an adjective, it describes a style characterized by moralizing, dramatic irony, violence, and rhetorical speeches, particularly in tragedy. As a noun, it refers to a writer or work that emulates Seneca's style.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a play that was very Senecan.","correct":"✓ He wrote a play in a Senecan style.","note":"It is more common to say \"in a Senecan style\" rather than just \"Senecan\" when describing the style of writing."}],"priority":"★★☆"},"related_words":{"derivatives":["Seneca"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'Senecan' is relatively uncommon and specific to literary and philosophical contexts. It requires knowledge of Seneca the Younger and his works. Understanding requires familiarity with Roman history, Stoic philosophy, and dramatic conventions of the time."},"example_sentences":[{"sentence":"The play's dark themes and violent imagery are characteristic of **Senecan** tragedy.","translation":"その劇の暗いテーマと暴力的なイメージは、セネカ悲劇の特徴である。","type":"adjective","meaning_category":"セネカ風の"},{"sentence":"As a **Senecan**, he believed in the importance of virtue and reason.","translation":"セネカ風の作家として、彼は美徳と理性の重要性を信じていた。","type":"noun","meaning_category":"セネカ風の作家"}]}