{"word":"Shard-born","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(ファンタジー)破片から生まれた、または破片に関連する","english_definition":"(Fantasy) Born from or related to a shard or splinter, often implying a connection to a powerful, broken entity or source of power.","examples":[{"sentence":"The shard-born warrior wielded a blade of pure crystal.","translation":"破片から生まれた戦士は、純粋な結晶の刃を振るった。"},{"sentence":"The prophecy spoke of a shard-born king who would unite the fractured lands.","translation":"予言は、分裂した土地を統一する破片から生まれた王について語った。"}],"collocations":["shard-born warrior","shard-born king","shard-born magic","shard-born power","shard-born artifact"],"synonyms":["splintered","fragmented","crystal-kin","shard-touched","shard-wrought"],"antonyms":["whole","complete","unified","unbroken"]}],"etymology":{"value":"The term is a compound word combining 'shard' (a fragment of a brittle substance) and 'born' (brought into life). It is often used in fantasy literature and games to describe characters or entities originating from or deeply connected to shards of a broken deity or powerful object.","priority":"★★☆"},"pronunciation":{"ipa":"/ʃɑːrd bɔːrn/","syllables":"Shard-born"},"inflection":{"notes":"This word is typically used as an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Shard-born' is primarily found in fantasy settings, particularly in works that feature a world where a powerful being or object has been shattered, and its fragments continue to exert influence. It suggests a character's origin is tied to this broken entity, granting them unique abilities or a specific destiny. The term carries connotations of both power and fragility, as the character is linked to something broken yet potent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was shardborned.","correct":"✓ He was shard-born.","note":"'Shard-born' is an adjective and does not take an '-ed' suffix to form a past tense. Instead, use a verb like 'was' or 'became' with the adjective."},{"incorrect":"✗ The shardborns attacked the city.","correct":"✓ The shard-born warriors attacked the city.","note":"'Shard-born' functions as an adjective, so it should be used to describe a noun (e.g., shard-born warrior, shard-born creature) rather than being used as a noun itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["shard","born"],"related_terms":["splinter","fragment","crystal","magic","fantasy","deity","entity"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in fantasy literature and gaming communities.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Shard-born' is a specialized term primarily used within the fantasy genre. It describes a character or entity whose origin is linked to fragments (shards) of a powerful broken object or being. Understanding the term requires familiarity with fantasy tropes and the concept of shattered deities or powerful artifacts. The term implies a connection to both power and fragility.","priority":"★☆☆"},"example_sentences":[{"sentence":"The shard-born sorceress drew power from the ancient crystals.","translation":"破片から生まれた魔女は、古代の結晶から力を引き出した。","type":"adjective","meaning_category":"Origin/Power Source"},{"sentence":"Only the shard-born knight could wield the legendary sword.","translation":"破片から生まれた騎士だけが、伝説の剣を振るうことができた。","type":"adjective","meaning_category":"Destiny/Ability"},{"sentence":"The shard-born creatures were both beautiful and dangerous.","translation":"破片から生まれた生き物は、美しくも危険だった。","type":"adjective","meaning_category":"Nature/Characteristics"}]}