{"word":"isodynamous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"等力線の、等力線を有する","english_definition":"Relating to or having equal force or energy; characterized by isodynamic lines.","examples":[{"sentence":"The isodynamous lines on the map showed areas of equal wind force.","translation":"地図上の等力線は、風力が等しい地域を示していた。"}],"collocations":[],"synonyms":["equipotential","isodynamic"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'isos' (equal) and 'dynamis' (force or power).","priority":"★★★"},"pronunciation":{"ipa":"/ˌaɪsoʊdaɪˈnæməs/","syllables":"i-so-dy-na-mous"},"inflection":{},"usage_notes":{"explanation":"This term is primarily used in scientific contexts, particularly in fields like meteorology and physics, to describe phenomena or maps where lines connect points of equal force or energy.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["isodynamy (noun)"],"related_terms":["isodynamic line (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'isodynamous' is a highly specialized term primarily used in scientific or technical contexts, particularly in fields like meteorology or physics. It describes something characterized by equal force or energy, often represented by isodynamic lines on a map or diagram. Due to its limited usage and technical nature, it is unlikely to be encountered in general conversation or writing. Understanding requires familiarity with scientific vocabulary and concepts related to force and energy."},"example_sentences":[{"sentence":"The isodynamous chart provided a clear visualization of the pressure distribution.","translation":"等力線図は、圧力分布を明確に視覚化した。","type":"adjective","meaning_category":"equal force"},{"sentence":"Researchers studied the isodynamous properties of the magnetic field.","translation":"研究者たちは、磁場の等力特性を研究した。","type":"adjective","meaning_category":"equal force"}]}