{"word":"Ergocalciferol","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"エルゴカルシフェロール、ビタミンD2","english_definition":"A form of vitamin D (vitamin D2) found in plants and yeast; used as a dietary supplement and to treat vitamin D deficiency.","examples":[{"sentence":"Ergocalciferol is often prescribed to treat rickets.","translation":"エルゴカルシフェロールは、しばしばくる病の治療に処方される。"},{"sentence":"Some fortified foods contain ergocalciferol.","translation":"一部の強化食品にはエルゴカルシフェロールが含まれている。"}],"collocations":["ergocalciferol supplementation","ergocalciferol deficiency","ergocalciferol treatment"],"synonyms":["vitamin D2","calciferol"],"antonyms":[]}],"etymology":{"value":"Derived from 'ergo-' (referring to its origin in ergosterol, a steroid in fungi) + 'calc-' (referring to calcium) + 'iferol' (indicating its vitamin D nature).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɜːrɡoʊkælˈsɪfəˌrɒl/","syllables":"er-go-cal-cif-er-ol"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Ergocalciferol is a specific form of vitamin D, known as vitamin D2. It is distinct from cholecalciferol (vitamin D3), which is produced in the skin of animals, including humans, upon exposure to sunlight. Ergocalciferol is obtained from plant and fungal sources and is often used in supplements and fortified foods.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Ergocalciferol is the same as vitamin D3.","correct":"✓ Ergocalciferol is vitamin D2, while cholecalciferol is vitamin D3.","note":"Ergocalciferol (vitamin D2) and cholecalciferol (vitamin D3) are different forms of vitamin D, although they both serve similar functions in the body."}],"priority":"★★☆"},"related_words":{"derivatives":["calciferol","cholecalciferol","vitamin D","vitamin D deficiency"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Ergocalciferol is a technical term referring to vitamin D2. It is mainly encountered in medical or nutritional contexts when discussing dietary supplements or treatments for vitamin D deficiency. Understanding this term is important for those in healthcare or related fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor prescribed ergocalciferol to correct her vitamin D deficiency.","translation":"医師は彼女のビタミンD欠乏症を改善するためにエルゴカルシフェロールを処方した。","type":"noun","meaning_category":"vitamin D supplement"},{"sentence":"Ergocalciferol is a synthetic form of vitamin D.","translation":"エルゴカルシフェロールは合成型のビタミンDである。","type":"noun","meaning_category":"vitamin D type"}]}