{"word":"geologer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"地質学者 (現在はあまり使われない古い言い方)","english_definition":"An older or less common term for a geologist. A scientist who studies the Earth, its structure, composition, origin, history, and the processes that shape it.","examples":[{"sentence":"The old geologer spent his life studying the rocks of the region.","translation":"その年老いた地質学者は、生涯をその地域の岩石の研究に費やした。"}],"collocations":[],"synonyms":["geologist"],"antonyms":[]}],"etymology":{"value":"'Geologer' is an older form of the word 'geologist'. It combines 'geo-' (from Greek 'gē' meaning 'earth') with '-loger' (someone who studies or is knowledgeable in a particular field). The suffix '-loger' has largely been replaced by '-logist' in modern English for scientific fields.","priority":"★★☆"},"pronunciation":{"ipa":"/dʒiˈɒlədʒər/","syllables":"ge-ol-o-ger"},"inflection":{"noun_plural":"geologers"},"usage_notes":{"explanation":"'Geologer' is an archaic term for 'geologist'. While technically correct, it is rarely used in modern English. 'Geologist' is the preferred and widely accepted term for a scientist who studies geology. Using 'geologer' might sound old-fashioned or suggest a lack of familiarity with current scientific terminology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I want to be a geologer when I grow up.","correct":"✓ I want to be a geologist when I grow up.","note":"Use 'geologist' instead of 'geologer' as it is the current standard term."}],"priority":"★★☆"},"related_words":{"derivatives":["geology","geological","geologist"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (archaic term)","frequency_google_ngram":"Very low frequency (archaic)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Geologer' is an outdated term for 'geologist'. It's understood but not used in contemporary English. If you encounter this word, recognize that it refers to the same profession as 'geologist' – someone who studies the Earth. Use 'geologist' in your own writing and speech. This word might appear in older texts or historical contexts."},"example_sentences":[{"sentence":"The geologer examined the rock samples carefully. (archaic)","translation":"その地質学者は岩石のサンプルを注意深く調べた。（古風な言い方）","type":"noun","meaning_category":"地質学者"}]}