{"word":"Pentapolitan","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"五都市同盟の、五都市連合の","english_definition":"Relating to or characteristic of a pentapolis (a group of five cities).","examples":[{"sentence":"The Pentapolitan League was formed to protect against invaders.","translation":"五都市同盟は侵略者から守るために結成された。"},{"sentence":"The region was known for its Pentapolitan structure.","translation":"その地域は五都市連合の構造で知られていた。"}],"collocations":["Pentapolitan League","Pentapolitan structure","Pentapolitan region"],"synonyms":["five-city","quinquecity"],"antonyms":[]}],"etymology":{"value":"Derived from \"pentapolis,\" which comes from the Greek \"penta\" (five) and \"polis\" (city).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɛntəˈpɒlɪtən/","syllables":"Pen-ta-pol-i-tan"},"inflection":{},"usage_notes":{"explanation":"The term \"Pentapolitan\" is relatively rare and specifically refers to something associated with a pentapolis, which is a group or league of five cities. It is most often used in historical contexts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["pentapolis (noun: a group of five cities)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"Pentapolitan\" is a specialized term used in historical or geographical contexts to describe something related to a pentapolis, a group of five cities. Due to its specific and infrequent use, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The ancient region was organized under a Pentapolitan system, fostering cooperation among its major urban centers.","translation":"古代の地域は五都市連合の制度の下で組織され、主要な都市中心部間の協力を促進した。","type":"adjective","meaning_category":"五都市連合の"},{"sentence":"Archaeological evidence suggests a strong Pentapolitan cultural identity during that period.","translation":"考古学的な証拠は、その時代に強い五都市連合の文化的アイデンティティがあったことを示唆している。","type":"adjective","meaning_category":"五都市連合の"}]}