{"word":"Fenian","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"フェニアン (19世紀のアイルランド独立運動の支持者)","english_definition":"A member or supporter of a 19th-century Irish republican organization (the Fenian Brotherhood) dedicated to achieving Irish independence from British rule.","examples":[{"sentence":"The Fenians sought to achieve Irish independence through armed rebellion.","translation":"フェニアンたちは武力蜂起によってアイルランドの独立を達成しようとした。"},{"sentence":"The Fenian Brotherhood was founded in the United States in 1858.","translation":"フェニアン同盟は1858年にアメリカ合衆国で設立された。"}],"collocations":["Fenian Brotherhood","Fenian raids","Fenian movement","Fenian conspiracy"],"synonyms":["Irish republican","nationalist","separatist"],"antonyms":["Unionist","loyalist"]},{"part_of_speech":"adjective","definition":"フェニアンの、フェニアン主義の","english_definition":"Relating to or characteristic of the Fenians or Fenianism.","examples":[{"sentence":"Fenian activities caused concern in British political circles.","translation":"フェニアンの活動はイギリス政界で懸念を引き起こした。"},{"sentence":"The Fenian tradition of Irish nationalism continues to influence some political groups today.","translation":"フェニアンのアイルランド民族主義の伝統は、今日でも一部の政治団体に影響を与え続けている。"}],"collocations":["Fenian tradition","Fenian sympathies","Fenian ideology"],"synonyms":["republican","nationalist","separatist"],"antonyms":["Unionist","loyalist"]}],"etymology":{"value":"The term \"Fenian\" is derived from \"Fianna,\" the name of a legendary band of Irish warriors in Gaelic mythology. The Fenian Brotherhood adopted this name to evoke a sense of Irish heroism and resistance against foreign rule.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfiːniən/","syllables":"Fee-ni-an"},"inflection":{"notes":"The noun has a plural form: Fenians. The adjective does not change form."},"usage_notes":{"explanation":"The term \"Fenian\" is primarily historical, referring to a specific movement in the 19th century. While the term is sometimes used more broadly to refer to Irish republicans, it can be considered offensive by some, particularly when used to describe contemporary political movements. It is important to be aware of the historical context and potential sensitivities when using this term.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Fenian in Northern Ireland today.","correct":"✓ He is an Irish republican/nationalist in Northern Ireland today.","note":"While someone might hold similar views to the Fenians, calling someone a \"Fenian\" in the present day is often inaccurate and potentially offensive. It's better to use terms like \"Irish republican\" or \"nationalist.\""}],"priority":"★★☆"},"related_words":{"derivatives":["Fenianism (noun: フェニアン主義)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary related to Irish history)","frequency_google_ngram":"Low frequency (relatively rare in general English usage)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Fenian\" refers to a specific historical movement in 19th-century Ireland that sought independence from British rule. It's a term primarily encountered in historical contexts or discussions about Irish nationalism. Using this word requires sensitivity, as it can carry strong political and historical connotations. It's crucial to understand the historical context before using the term, and it's generally best to avoid using it to describe contemporary political situations, as it can be seen as inaccurate or offensive."},"example_sentences":[{"sentence":"The **Fenian** rising of 1867 was quickly suppressed by British forces.","translation":"1867年のフェニアン蜂起は、イギリス軍によってすぐに鎮圧された。","type":"adjective","meaning_category":"フェニアンの"},{"sentence":"Many Irish immigrants in the United States supported the **Fenians**' cause.","translation":"アメリカ合衆国にいる多くのアイルランド移民は、フェニアンの主張を支持した。","type":"noun","meaning_category":"フェニアン"}]}