{"word":"torpidities","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 麻痺状態、不活発な状態、無気力","english_definition":"plural form of torpidity: the state of being torpid; inactivity resulting from lethargy and lack of vigor or energy.","examples":[{"sentence":"The torpidities of winter gave way to the vibrant energy of spring.","translation":"冬の麻痺状態は、春の活気に満ちたエネルギーに道を譲った。"},{"sentence":"He struggled to overcome the torpidities that plagued his creative process.","translation":"彼は創造的なプロセスを悩ませる無気力状態を克服しようと奮闘した。"}],"collocations":["winter torpidities (冬の不活発さ)","mental torpidities (精神的な無気力)"],"synonyms":["lethargy","inactivity","sluggishness","apathy","dormancy"],"antonyms":["activity","vigor","energy","animation"]}],"etymology":{"value":"Derived from 'torpidity', which comes from the Latin 'torpidus' meaning 'numb, sluggish'.","priority":"★★☆"},"pronunciation":{"ipa":"/tɔːrˈpɪdɪtiz/","syllables":"tor-pid-i-ties"},"inflection":{"noun_plural":"torpidities"},"usage_notes":{"explanation":"'Torpidities' is the plural form of 'torpidity', referring to multiple instances or aspects of a state of dormancy, sluggishness, or inactivity. It is often used to describe periods or conditions characterized by a lack of energy, enthusiasm, or activity, whether physical or mental.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The torpidities was evident in their slow movements.","correct":"✓ The torpidities were evident in their slow movements.","note":"'Torpidities' is a plural noun, so it requires a plural verb form ('were')."},{"incorrect":"✗ He suffered from torpidity, but also many torpidities.","correct":"✓ He suffered from torpidity. / ✓ He experienced several periods of torpidity.","note":"Use 'torpidity' for the general state and 'torpidities' to refer to multiple instances or aspects of the state."}],"priority":"★★☆"},"related_words":{"derivatives":["torpid (adjective: inactive, sluggish)","torpidly (adverb: in an inactive or sluggish manner)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Torpidities' is a relatively uncommon word that refers to multiple instances or aspects of a state of inactivity, sluggishness, or dormancy. It is often used in formal or academic contexts to describe periods or conditions characterized by a lack of energy, enthusiasm, or activity, whether physical or mental. Because it is a plural noun, it requires a plural verb form. It is derived from the adjective 'torpid,' which means inactive or sluggish, and the noun 'torpidity,' which refers to the state of being torpid."},"example_sentences":[{"sentence":"The long winter months were marked by the torpidities of the hibernating animals.","translation":"長い冬の間、冬眠する動物たちの麻痺状態が顕著だった。","type":"noun (plural)","meaning_category":"麻痺状態・不活発な状態"},{"sentence":"The economic torpidities of the recession led to widespread job losses.","translation":"景気後退による経済の停滞は、広範囲な失業につながった。","type":"noun (plural)","meaning_category":"麻痺状態・不活発な状態"},{"sentence":"She sought to overcome the mental torpidities that hindered her creativity.","translation":"彼女は創造性を妨げる精神的な無気力状態を克服しようとした。","type":"noun (plural)","meaning_category":"無気力"}]}