{"word":"Depositories","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 貯蔵庫、保管場所、預金取扱機関","english_definition":"Plural form of depository: a place where things are stored; a bank or other financial institution that accepts deposits.","examples":[{"sentence":"The museum has several depositories for its artifacts.","translation":"その博物館には、所蔵品のための貯蔵庫がいくつかある。"},{"sentence":"Financial depositories are regulated by the government.","translation":"金融預金取扱機関は政府によって規制されている。"},{"sentence":"The library's depositories contain rare manuscripts.","translation":"その図書館の貯蔵庫には貴重な写本が収められている。"}],"collocations":["art depositories (美術品貯蔵庫)","data depositories (データ貯蔵庫)","central depositories (中央預託機関)","secure depositories (安全な貯蔵庫)"],"synonyms":["storage facilities","warehouses","banks","financial institutions"],"antonyms":["emptiness","void"]}],"etymology":{"value":"The word \"depositories\" is the plural form of \"depository,\" which comes from the Latin word \"depositum,\" meaning \"something entrusted to another for care.\"","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈpɒzɪtɔːriz/","syllables":"de-pos-i-to-ries"},"inflection":{"noun_plural":"depositories"},"usage_notes":{"explanation":"\"Depositories\" refers to multiple locations or institutions that serve as storage or holding places. It can refer to physical storage spaces like warehouses or vaults, or to financial institutions that hold deposits of money. The specific meaning depends on the context in which it is used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The depository is full of depositories.","correct":"✓ The depository is full of items.","note":"Using \"depositories\" to describe the contents of a single \"depository\" is redundant. Use a more general term for the contents. "},{"incorrect":"✗ He deposited the money in the depositories.","correct":"✓ He deposited the money in the depository.","note":"If referring to a specific bank or financial institution, use the singular form \"depository\" unless referring to multiple institutions."}],"priority":"★☆☆"},"related_words":{"derivatives":["depository (noun: a place where things are stored or deposited)","deposit (verb: to put something somewhere; noun: an amount of money placed in a bank)","deposition (noun: the action of depositing something)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"depositories\" is a formal term generally used in professional or academic contexts. It refers to multiple places where items are stored or financial deposits are held. Understanding the context is crucial to correctly interpret its meaning, whether it pertains to physical storage or financial institutions."},"example_sentences":[{"sentence":"The national archives maintain several depositories for historical documents.","translation":"国立公文書館は、歴史的文書のためにいくつかの貯蔵庫を維持している。","type":"noun","meaning_category":"貯蔵庫"},{"sentence":"These financial depositories offer a range of banking services.","translation":"これらの金融預金取扱機関は、さまざまな銀行サービスを提供している。","type":"noun","meaning_category":"預金取扱機関"},{"sentence":"Art collectors often use secure depositories to protect their valuable pieces.","translation":"美術コレクターは、貴重な作品を保護するために、安全な貯蔵庫をよく利用する。","type":"noun","meaning_category":"貯蔵庫"}]}