{"word":"penetrating-gazed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"（視線が）鋭い、見透かすような、洞察力のある","english_definition":"Having a sharp, piercing, or insightful gaze.","examples":[{"sentence":"She gave him a penetrating-gazed look that made him uncomfortable.","translation":"彼女は彼を不安にさせるような、見透かすような視線を彼に向けた。"},{"sentence":"The detective had a penetrating-gazed stare that could uncover any lie.","translation":"その刑事はどんな嘘も見抜くような、鋭い視線をしていた。"}],"collocations":["penetrating-gazed stare","penetrating-gazed look","penetrating-gazed eyes"],"synonyms":["piercing","sharp","intense","searching","probing","insightful"],"antonyms":["vacant","blank","unfocused","dull"]},{"part_of_speech":"verb (past participle)","definition":"（視線が）鋭く見つめられた、見透かすように見られた","english_definition":"Having been looked at with a sharp, piercing, or insightful gaze.","examples":[{"sentence":"He felt penetrating-gazed by the interviewer, as if they could see right through him.","translation":"彼は面接官に見透かすように見つめられているように感じ、まるで自分の内面を見抜かれているようだった。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term is a compound adjective formed by combining \"penetrating\" (meaning sharp, piercing, or insightful) with \"gazed\" (meaning looked at steadily or intently). It describes a gaze that seems to see deeply or understand more than is apparent.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɛnɪˌtreɪtɪŋ ˈɡeɪzd/","syllables":"pen-e-trat-ing-gazed"},"inflection":{"notes":"As a compound adjective, it does not have separate inflections. It can be used to modify nouns directly."},"usage_notes":{"explanation":"\"Penetrating-gazed\" is used to describe a look or stare that is intense and seems to see beyond the surface. It often implies intelligence, understanding, or the ability to discern hidden truths. The term is relatively uncommon but can be effective in conveying a sense of unease or admiration, depending on the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a penetrating-gazed at the painting.","correct":"✓ He gazed penetratingly at the painting. / ✓ He had a penetrating gaze at the painting.","note":"\"Penetrating-gazed\" is an adjective, so it should modify a noun (e.g., gaze, look, eyes). To describe the act of gazing in a penetrating manner, use the adverb \"penetratingly\" or rephrase the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["penetrating (adjective)","gaze (noun/verb)","penetratingly (adverb)"],"phrasal_verbs":[],"related_adjectives":["intense","piercing","sharp","insightful"],"related_nouns":["gaze","look","stare"]},"level_frequency":{"CEFR":"N/A (uncommon)","frequency_google_ngram":"Low frequency - Not a common term in general usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"penetrating-gazed\" is a compound adjective used to describe a look or stare that is intense, sharp, and seems to see beyond the surface. It implies a high degree of intelligence, understanding, or the ability to discern hidden truths. Because it is a relatively uncommon term, it is more likely to be encountered in literary or descriptive contexts rather than everyday conversation. It requires a good understanding of both \"penetrating\" and \"gazed\" to fully grasp its meaning."},"example_sentences":[{"sentence":"The old woman gave the young man a penetrating-gazed look, as if she knew his deepest secrets.","translation":"老婆は若い男に、まるで彼の心の奥底にある秘密を知っているかのような、見透かすような視線を送った。","type":"adjective","meaning_category":"鋭い視線"},{"sentence":"The detective's penetrating-gazed eyes scanned the room, searching for any clues.","translation":"刑事の鋭い視線が部屋をくまなく見渡し、手がかりを探していた。","type":"adjective","meaning_category":"鋭い視線"}]}