{"word":"alkyl","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アルキル基：アルカンから水素原子を1つ取り除いた一価の官能基","english_definition":"A univalent radical consisting of carbon and hydrogen arranged in an open chain; derived from an alkane by removal of one hydrogen atom.","examples":[{"sentence":"Methyl is the simplest alkyl group.","translation":"メチル基は最も単純なアルキル基です。"},{"sentence":"Alkyl groups are commonly represented by the symbol 'R'.","translation":"アルキル基は一般的に記号「R」で表されます。"},{"sentence":"The alkyl chain length affects the properties of the molecule.","translation":"アルキル鎖の長さは分子の特性に影響を与えます。"}],"collocations":["alkyl group","alkyl chain","methyl","ethyl","propyl","butyl"],"synonyms":["hydrocarbon radical"],"antonyms":[]}],"etymology":{"value":"Derived from 'alkane' (a type of hydrocarbon) by replacing '-ane' with '-yl'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈælkɪl/","syllables":"al-kyl"},"inflection":{"noun_plural":"alkyls"},"usage_notes":{"explanation":"In chemistry, an alkyl group is a substituent consisting of only carbon and hydrogen atoms arranged in a chain. Alkyl groups are important building blocks in organic chemistry. They are often abbreviated as 'R' in chemical formulas. The name of an alkyl group is derived from the name of the corresponding alkane by replacing the suffix '-ane' with '-yl'. For example, methane (CH₄) becomes methyl (CH₃-).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ alkene group","correct":"✓ alkyl group","note":"Alkenes contain carbon-carbon double bonds, while alkyl groups are derived from alkanes (single bonds only)."},{"incorrect":"✗ The molecule has a alcohol group.","correct":"✓ The molecule has an alkyl group.","note":"'alcohol' and 'alkyl' are different chemical entities. Alcohols contain a hydroxyl (-OH) group, while alkyl groups are hydrocarbon chains."}],"priority":"★★☆"},"related_words":{"derivatives":["alkylation (名詞: アルキル化)","alkylated (形容詞: アルキル化された)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'alkyl' is a specialized term used in organic chemistry. It refers to a chemical group consisting of carbon and hydrogen atoms arranged in a chain, derived from an alkane. Understanding this term requires a background in basic organic chemistry concepts such as alkanes, hydrocarbons, and functional groups. It is typically encountered in advanced chemistry courses or research contexts."},"example_sentences":[{"sentence":"The reaction involves the addition of an alkyl group to the aromatic ring.","translation":"その反応は、芳香環へのアルキル基の付加を伴います。","type":"noun","meaning_category":"chemical substituent"},{"sentence":"The properties of the polymer are influenced by the size of the alkyl side chains.","translation":"ポリマーの特性は、アルキル側鎖のサイズによって影響を受けます。","type":"noun","meaning_category":"chemical substituent"},{"sentence":"The alkyl substituent increases the solubility of the compound in organic solvents.","translation":"アルキル置換基は、有機溶媒中の化合物の溶解度を高めます。","type":"noun","meaning_category":"chemical substituent"}]}