{"word":"radiances","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(radianceの複数形)輝き、光輝、明るさ、喜び、幸福感","english_definition":"(plural of radiance) the quality of being radiant; brilliant light; a glow; great joy, love, or health that can be seen in someone's face.","examples":[{"sentence":"The radiances of the sunset filled the sky.","translation":"夕焼けの輝きが空いっぱいに広がった。"},{"sentence":"Her radiances always brighten up the room.","translation":"彼女の輝きはいつも部屋を明るくする。"},{"sentence":"The radiances of their love were evident to everyone.","translation":"彼らの愛の輝きは誰の目にも明らかだった。"}],"collocations":["celestial radiances (天上の輝き)","inner radiances (内なる輝き)"],"synonyms":["brightnesses","glows","shines","brilliances","splendors"],"antonyms":["dullnesses","gloominesses","obscurities"]}],"etymology":{"value":"'Radiances' is simply the plural form of 'radiance'. 'Radiance' itself comes from the Latin word 'radians', the present participle of 'radiare', meaning 'to emit rays, shine'. This is further derived from 'radius', meaning 'ray, spoke of a wheel'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈreɪdiənsɪz/","syllables":"ray-di-an-ces"},"inflection":{"noun_plural":"radiances"},"usage_notes":{"explanation":"'Radiances' is the plural form of 'radiance', which refers to the quality of emitting light or a bright glow. It can also describe a feeling of great happiness, love, or health that is apparent in someone's face. While 'radiance' can be used to describe a single instance or a general quality, 'radiances' typically refers to multiple instances or sources of radiance. It is less commonly used than the singular form.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The radiance were beautiful.","correct":"✓ The radiances were beautiful.","note":"When referring to multiple sources of radiance, use the plural form 'radiances' with a plural verb ('were')."},{"incorrect":"✗ She had many radiance.","correct":"✓ She had many radiances.","note":"When referring to multiple instances of radiance, use the plural form 'radiances'."}],"priority":"★☆☆"},"related_words":{"derivatives":["radiance (noun: singular form)","radiant (adjective: emitting light; beaming with joy)","radiate (verb: to emit light or heat; to spread out from a central point)","radiation (noun: the emission of energy as electromagnetic waves or as moving subatomic particles)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Not commonly used in everyday language.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Radiances' is the plural form of 'radiance', which describes a bright, glowing light or a visible expression of joy or health. It's not a commonly used word, so it's more likely to appear in literature or descriptive writing. Understanding the singular form, 'radiance', is more important for general English comprehension. The plural form is used when referring to multiple instances or sources of such brightness or joy."},"example_sentences":[{"sentence":"The **radiances** from the fireworks lit up the night sky.","translation":"花火の輝きが夜空を照らした。","type":"noun","meaning_category":"輝き"},{"sentence":"The **radiances** of their smiles showed how happy they were.","translation":"彼らの笑顔の輝きは、彼らがどれほど幸せかを示していた。","type":"noun","meaning_category":"幸福感"},{"sentence":"The **radiances** emanating from the gemstones were mesmerizing.","translation":"宝石から放たれる輝きは魅惑的だった。","type":"noun","meaning_category":"光輝"}]}