{"word":"crossette","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築) 羽根付き迫石、迫石の張り出し部分","english_definition":"A projecting piece of stone or wood on the side of an architrave, jamb, or other architectural feature.","examples":[{"sentence":"The crossettes on the window frame added a touch of elegance.","translation":"窓枠のクロセット（羽根付き迫石）が優雅さを添えた。"}],"collocations":["window crossette","door crossette"],"synonyms":["ear","shoulder","ancon"],"antonyms":[]},{"part_of_speech":"noun","definition":"(花火) 十文字模様の花火","english_definition":"A firework that bursts into a cross shape.","examples":[{"sentence":"The finale included a beautiful crossette that lit up the night sky.","translation":"フィナーレには、夜空を照らす美しいクロセット（十文字模様の花火）が含まれていた。"}],"collocations":["firework crossette"],"synonyms":["star","burst"],"antonyms":[]}],"etymology":{"value":"語源はフランス語の \"croisette\" で、\"croix\"（十字架）の指小形。建築用語としては、張り出し部分が十字架のような形状に見えることに由来する。花火の用語としては、爆発した形が十字に見えることに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/kroʊˈsɛt/","syllables":"cro-sette"},"inflection":{"noun_plural":"crossettes"},"usage_notes":{"explanation":"\"crossette\" は、建築用語と花火の用語の2つの異なる意味を持つ単語です。建築用語としては、窓やドアなどの開口部の枠を構成する部材の一部を指し、装飾的な役割を果たします。花火の用語としては、空中で十字の形に炸裂する花火を指します。文脈によって意味が異なるため注意が必要です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The firework was a beautiful croissant.","correct":"✓ The firework was a beautiful crossette.","note":"\"croissant\"（クロワッサン）と \"crossette\"（クロセット）はスペルが似ていますが、全く異なる意味の単語です。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["architrave","jamb","firework","pyrotechnics"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Crossette\" is a relatively uncommon word with two distinct meanings. In architecture, it refers to a projecting element on the side of an architrave or jamb, often serving a decorative purpose. In pyrotechnics, it describes a type of firework that explodes in a cross-shaped pattern. Due to its specialized usage in these fields, it is not typically encountered in everyday conversation or writing. Understanding the context is crucial for correctly interpreting the meaning of \"crossette.\""},"example_sentences":[{"sentence":"The architect carefully designed the crossettes to complement the overall aesthetic of the building.","translation":"建築家は、建物の全体的な美観を引き立てるように、クロセット（羽根付き迫石）を注意深く設計した。","type":"noun","meaning_category":"建築"},{"sentence":"The grand finale of the fireworks display featured a stunning crossette that drew gasps from the audience.","translation":"花火大会のグランドフィナーレでは、観客から息をのむ声が上がるほど見事なクロセット（十文字模様の花火）が披露された。","type":"noun","meaning_category":"花火"}]}