{"word":"channel-shaped","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"溝形の、チャンネル状の、U字型の","english_definition":"Having the shape of a channel; resembling a channel in form; U-shaped.","examples":[{"sentence":"The roof tiles were designed with a channel-shaped profile to efficiently drain rainwater.","translation":"屋根瓦は、雨水を効率的に排水するために溝形の断面で設計されました。"},{"sentence":"The device uses a channel-shaped guide to direct the flow of liquid.","translation":"その装置は、液体の流れを誘導するためにチャンネル状のガイドを使用しています。"},{"sentence":"The river carved a channel-shaped path through the mountains over millions of years.","translation":"その川は何百万年もの間、山々をU字型に削りながら流れてきました。"}],"collocations":["channel-shaped groove (溝形の溝)","channel-shaped depression (溝形の凹み)","channel-shaped structure (溝形の構造)","channel-shaped profile (溝形の断面)"],"synonyms":["U-shaped","trough-shaped","grooved","concave"],"antonyms":["convex","flat","planar"]}],"etymology":{"value":"Formed by combining 'channel' (a long, narrow passage) and 'shaped' (having a particular form).","priority":"N/A"},"pronunciation":{"ipa":"/ˈtʃænl ʃeɪpt/","syllables":"chan-nel-shaped"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Channel-shaped' describes objects or features that resemble a channel, typically a long, narrow, and often U-shaped depression or passage. It is often used in technical or descriptive contexts to specify the form of something.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The water flowed through a canal-shaped path.","correct":"✓ The water flowed through a channel-shaped path.","note":"'Canal' refers to a man-made waterway, while 'channel' refers to a natural or artificial groove or passage. While similar, 'channel-shaped' is more general. 'Canal-shaped' could be used if the path specifically resembles a canal."}],"priority":"N/A"},"related_words":{"derivatives":["channel (noun)","shape (noun, verb)"],"phrases":["channel flow (溝流れ)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. This is a relatively specialized term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'channel-shaped' is a descriptive adjective used to indicate that something has the form of a channel, which is typically a long, narrow, and often U-shaped groove or passage. It is most often encountered in technical or scientific contexts where precise descriptions of shapes are necessary. Understanding the meaning of 'channel' is essential to comprehending 'channel-shaped.'"},"example_sentences":[{"sentence":"The metal component had a channel-shaped cross-section to provide structural support.","translation":"その金属部品は、構造的な支持を提供するために溝形の断面をしていました。","type":"descriptive","meaning_category":"shape"},{"sentence":"The irrigation system used channel-shaped pipes to distribute water evenly across the field.","translation":"灌漑システムは、畑全体に水を均等に分配するために溝形のパイプを使用しました。","type":"application","meaning_category":"use"},{"sentence":"The geologist observed channel-shaped formations in the rock layers, indicating ancient riverbeds.","translation":"地質学者は、岩層に溝形の構造を観察し、古代の川床を示唆していました。","type":"observation","meaning_category":"geology"}]}