{"word":"resolution-increasing","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"解像度を上げる、解像度を向上させる","english_definition":"Increasing the level of detail or clarity in an image, display, or other form of visual representation.","examples":[{"sentence":"This software has a resolution-increasing feature that makes old photos look sharper.","translation":"このソフトウェアには、古い写真をより鮮明にする解像度向上機能があります。"},{"sentence":"The new algorithm is resolution-increasing, allowing us to see finer details in the satellite imagery.","translation":"新しいアルゴリズムは解像度を向上させるため、衛星画像でより細かい詳細を見ることができます。"}],"collocations":["resolution-increasing algorithm","resolution-increasing technology","resolution-increasing software","resolution-increasing filter"],"synonyms":["upscaling","sharpening","detail-enhancing"],"antonyms":["resolution-decreasing","downscaling"]}],"etymology":{"value":"The term is formed by combining 'resolution' (the level of detail in an image), 'increase' (to make larger or greater), and '-ing' (indicating an ongoing process or characteristic).","priority":"★★★"},"pronunciation":{"ipa":"/ˌrezəˈluːʃən ɪnˌkriːsɪŋ/","syllables":"re-so-lu-tion in-creas-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms are possible (more resolution-increasing, most resolution-increasing), but not common."},"usage_notes":{"explanation":"'Resolution-increasing' is typically used to describe technologies, algorithms, or processes that improve the clarity or detail of an image or display. It often implies that the original image or data had a lower resolution, and the process enhances it.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The resolution-increase image looks much better.","correct":"✓ The resolution-increased image looks much better.","note":"'Resolution-increased' is the past participle form and is more appropriate when describing an image that has already undergone the process. 'Resolution-increasing' describes the process or technology itself."}],"priority":"★★☆"},"related_words":{"derivatives":["resolution","increase","upscaling","super-resolution"],"related_terms":["image processing","image enhancement","artificial intelligence","machine learning"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Resolution-increasing' is a technical term generally used in the context of image processing, computer graphics, and related fields. It describes something that improves the clarity or detail of an image or display. It is most likely to be encountered in technical documentation, research papers, or specialized articles."},"example_sentences":[{"sentence":"The company developed a new resolution-increasing technique for medical imaging.","translation":"その会社は、医療用画像の解像度を向上させる新しい技術を開発しました。","type":"adjective","meaning_category":"解像度を上げる"},{"sentence":"This is a resolution-increasing filter that can be applied to any digital photograph.","translation":"これは、あらゆるデジタル写真に適用できる解像度向上フィルターです。","type":"adjective","meaning_category":"解像度を向上させる"}]}