{"word":"bimetallist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"複本位論者","english_definition":"An advocate of bimetallism.","examples":[{"sentence":"The bimetallists argued that using both gold and silver would stabilize the economy.","translation":"複本位論者たちは、金と銀の両方を使うことが経済を安定させると主張した。"}],"collocations":["be a bimetallist","bimetallist argument","bimetallist policy"],"synonyms":["monetarist","economist"],"antonyms":["metallist","monometallist"],"notes":"Bimetallism is a monetary standard in which the value of a currency is defined as equivalent to certain quantities of two metals, typically gold and silver, creating a fixed rate of exchange between them."}],"etymology":{"value":"From 'bi-' (two) + 'metal' + '-ist' (one who advocates).","priority":"★★★"},"pronunciation":{"ipa":"/baɪˈmɛtəlɪst/","syllables":"bi-met-al-list"},"inflection":{"noun_plural":"bimetallists"},"usage_notes":{"explanation":"'Bimetallist' refers specifically to someone who supports the economic policy of bimetallism, which is the use of two metals (usually gold and silver) as legal tender at a fixed ratio. This term is most often encountered in historical contexts, particularly in discussions of 19th-century monetary policy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a bi-metalist.","correct":"✓ He is a bimetallist.","note":"The correct spelling is 'bimetallist,' not 'bi-metalist.'"},{"incorrect":"✗ Bimetallists believe in using only silver.","correct":"✓ Bimetallists believe in using both gold and silver.","note":"Bimetallism involves the use of two metals, typically gold and silver, not just one."}],"priority":"★★☆"},"related_words":{"derivatives":["bimetallism","bimetallic"],"related":["monometallism","metallism"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Historically relevant, but not commonly used in modern contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'bimetallist' is a specialized term related to economic history and monetary policy. It refers to someone who advocates for bimetallism, a system using two metals (usually gold and silver) as legal tender. Understanding this term requires knowledge of economic concepts and historical contexts, making it more suitable for advanced learners or those with a specific interest in economics."},"example_sentences":[{"sentence":"Many farmers in the late 19th century were bimetallists, hoping it would lead to inflation and ease their debt burden.","translation":"19世紀後半の多くの農民は、それがインフレにつながり、借金の負担を軽減することを期待して、複本位論者だった。","type":"noun","meaning_category":"複本位論者"},{"sentence":"The debate between bimetallists and gold standard advocates was a major issue in the 1896 US presidential election.","translation":"複本位論者と金本位制支持者の間の議論は、1896年の米国大統領選挙における主要な問題だった。","type":"noun","meaning_category":"複本位論者"}]}