{"word":"Wardour-Street","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(主に英国で、軽蔑的に)古風な、時代遅れの、わざと古めかしく作られた","english_definition":"(chiefly British, derogatory) affectedly archaic; deliberately made to appear old-fashioned.","examples":[{"sentence":"The novel was written in a Wardour-Street style, full of archaic language and contrived expressions.","translation":"その小説はワードアーストリート様式で書かれており、古風な言葉遣いとわざとらしい表現で満ちていた。"},{"sentence":"He criticized the film for its Wardour-Street dialogue, which sounded unnatural and forced.","translation":"彼はその映画のワードアーストリート調の台詞を批判し、不自然でわざとらしいと述べた。"}],"collocations":["Wardour-Street English","Wardour-Street language","Wardour-Street style"],"synonyms":["archaic","old-fashioned","contrived","artificial","affected","pseudo-archaic"],"antonyms":["modern","contemporary","natural","authentic"]}],"etymology":{"value":"ワードアーストリート（Wardour Street）は、ロンドンのソーホー地区にある通りの名前。かつては古美術商やアンティーク家具店が多く集まっていたことから、古めかしいもの、特にスタイルや言語において古風なものを指すようになった。","priority":"★★★"},"pronunciation":{"ipa":"/ˌwɔːrdər ˈstriːt/","syllables":"War-dour-Street"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「Wardour-Street」は、主にイギリス英語で使用される形容詞で、軽蔑的な意味合いを持ちます。スタイル、言語、または芸術作品などが、わざとらしく古めかしく作られている様子を指します。自然な古さではなく、見せかけだけの古風さを批判的に表現する際に用いられます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was Wardour-Street because it was very old.","correct":"✓ The building was old, but not necessarily Wardour-Street. Wardour-Street implies an affected, artificial oldness.","note":"単に古いだけでなく、わざと古めかしく作られている場合に「Wardour-Street」を使用します。"},{"incorrect":"✗ He spoke in a Wardour-Street manner, making it easy to understand.","correct":"✓ He spoke in a Wardour-Street manner, making it difficult to understand.","note":"「Wardour-Street」は、わざと難解な古語を使用しているため、理解を容易にするという状況には適しません。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"related_terms":["archaic","pseudo-archaic","affected","contrived"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (非常に特殊な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 特殊な文脈でのみ使用される語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Wardour-Street」は、非常に特殊な語彙であり、主に文学や芸術の批評において使用されます。この単語は、何かがわざと古めかしく作られていることを軽蔑的に示すために使われます。例えば、映画の台詞が不自然に古風な言葉遣いで書かれている場合、「Wardour-Street dialogue」と表現されることがあります。この単語は、英語のネイティブスピーカーでも知らない人が多いため、高度な語彙知識が必要です。"},"example_sentences":[{"sentence":"The play's dialogue was criticized for being too Wardour-Street, making it difficult for modern audiences to understand.","translation":"その劇の台詞はワードアーストリート調すぎると批判され、現代の観客には理解しにくかった。","type":"adjective","meaning_category":"古風な、時代遅れの"},{"sentence":"The author's Wardour-Street prose was filled with archaic words and convoluted sentences.","translation":"その作家のワードアーストリート調の散文は、古風な単語と複雑に入り組んだ文章で満ちていた。","type":"adjective","meaning_category":"古風な、時代遅れの"},{"sentence":"The film's set design, though historically accurate, had a slightly Wardour-Street feel to it.","translation":"その映画のセットデザインは、歴史的には正確だったものの、ややワードアーストリート調の雰囲気があった。","type":"adjective","meaning_category":"古風な、時代遅れの"}]}