{"word":"frogtongue","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学) スイレン科の植物、オモダカ属の植物 (Alisma plantago-aquatica) の別名","english_definition":"Another name for the plant Alisma plantago-aquatica, a species in the water plantain family (Alismataceae).","examples":[{"sentence":"Frogtongue is often found in shallow marshes and along the edges of ponds.","translation":"フロッグタンは浅い沼地や池の縁にしばしば見られる。"}],"collocations":["water plantain","Alisma plantago-aquatica"],"synonyms":["water plantain","alisma"],"antonyms":[]},{"part_of_speech":"noun","definition":"(建築) 蛙股 (かえるまた) の一種、特にゴシック建築における装飾的なアーチの形状","english_definition":"A type of spandrel, especially a decorative arch shape in Gothic architecture.","examples":[{"sentence":"The frogtongue arches in the cathedral are examples of intricate Gothic design.","translation":"その大聖堂のフロッグタン型のアーチは、複雑なゴシック様式のデザインの例である。"}],"collocations":[],"synonyms":["spandrel","frog crotch"],"antonyms":[]}],"etymology":{"value":"'Frog' + 'tongue', likely referring to the shape of the plant's leaves or the architectural feature's resemblance to a frog's tongue.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfrɒɡtʌŋ/","syllables":"frog-tongue"},"inflection":{"noun_plural":"frogtongues"},"usage_notes":{"explanation":"'Frogtongue' is a relatively uncommon term. In botany, it is a less frequently used synonym for 'water plantain' or 'Alisma plantago-aquatica'. In architecture, it refers to a specific type of spandrel, mainly in the context of Gothic design. Its usage is highly specialized depending on the field.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a frogtongue in my garden, it was hopping around.","correct":"✓ I saw a frog in my garden, it was hopping around.","note":"'Frogtongue' is a plant or an architectural term, not an actual frog. Use 'frog' for the animal."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["water plantain","alisma","spandrel","gothic architecture"]},"level_frequency":{"CEFR":"N/A (Very rare, specialized vocabulary)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Frogtongue' is a specialized term with limited usage. It is primarily encountered in botanical or architectural contexts. Understanding its meaning requires familiarity with these specific fields. Due to its rarity, it is not typically part of general English vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The botanical garden featured a variety of aquatic plants, including frogtongue.","translation":"植物園には、フロッグタンを含む様々な水生植物が展示されていた。","type":"noun","meaning_category":"植物学"},{"sentence":"The intricate frogtongue designs in the cathedral's arches showcased the skill of the medieval architects.","translation":"大聖堂のアーチの複雑なフロッグタンのデザインは、中世の建築家たちの技術を示していた。","type":"noun","meaning_category":"建築"}]}