{"word":"nonadjacent","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"隣接していない、隣り合っていない、近接していない","english_definition":"not adjacent; not next to or adjoining something.","examples":[{"sentence":"The two houses are nonadjacent.","translation":"その二つの家は隣接していない。"},{"sentence":"We need to select nonadjacent cells in the spreadsheet.","translation":"スプレッドシートで隣接していないセルを選択する必要があります。"},{"sentence":"Consider the nonadjacent vertices in the graph.","translation":"グラフ内の隣接していない頂点を考慮してください。"}],"collocations":["nonadjacent cells","nonadjacent vertices","nonadjacent elements","nonadjacent areas","nonadjacent regions"],"synonyms":["separate","disconnected","distant","apart","remote"],"antonyms":["adjacent","contiguous","neighboring","adjoining","proximate"]}],"etymology":{"value":"\"non-\" (not) + \"adjacent\".  \"Adjacent\" comes from Latin \"adjacēns\", present participle of \"adjacēre\" (to lie near, adjoin).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnəˈdʒeɪsənt/","syllables":"non-a-ja-cent"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"\"Nonadjacent\" is typically used in technical contexts, especially in mathematics, computer science, and geography, to describe elements or areas that are not directly next to each other. It emphasizes the lack of immediate proximity rather than just general distance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-adjacent houses were far away.","correct":"✓ The nonadjacent houses were separated by a park.","note":"\"Nonadjacent\" implies they are not directly next to each other, but doesn't necessarily mean they are far away. The corrected sentence is more specific about the reason for nonadjacency."},{"incorrect":"✗ The nonadjacent list of items.","correct":"✓ The list of nonadjacent items.","note":"The adjective \"nonadjacent\" should directly precede the noun it modifies. In this case, it's the items that are nonadjacent, not the list itself."}],"priority":"★★☆"},"related_words":{"derivatives":["nonadjacency (noun): the state of not being adjacent"],"antonyms":["adjacent","contiguous","neighboring"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonadjacent\" means \"not next to each other.\" It's used in situations where it's important to specify that things are not directly connected or touching. For example, you might talk about \"nonadjacent cells\" in a spreadsheet, meaning cells that are not right next to each other. It's a more formal and precise way of saying \"not neighboring\" or \"not adjoining.\""},"example_sentences":[{"sentence":"The study focused on the effects of pollution on nonadjacent communities.","translation":"その研究は、隣接していない地域社会への汚染の影響に焦点を当てた。","type":"general","meaning_category":"general"},{"sentence":"In graph theory, a stable set is a set of nonadjacent vertices.","translation":"グラフ理論では、安定集合は隣接していない頂点の集合である。","type":"technical","meaning_category":"technical"},{"sentence":"The algorithm efficiently identifies nonadjacent elements in the array.","translation":"そのアルゴリズムは、配列内の隣接していない要素を効率的に識別する。","type":"technical","meaning_category":"technical"}]}