{"word":"Colophonian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"古代イオニアの都市コロポンの住民","english_definition":"A native or inhabitant of Colophon, an ancient Ionian city.","examples":[{"sentence":"The Colophonians were known for their cavalry.","translation":"コロポンの住民は騎兵で知られていた。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"古代イオニアの都市コロポンに関する、またはコロポンに特有の","english_definition":"Relating to or characteristic of Colophon, an ancient Ionian city.","examples":[{"sentence":"Colophonian resin was highly valued in antiquity.","translation":"コロポンの樹脂は古代において非常に高く評価されていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the ancient city of Colophon in Ionia (modern-day Turkey).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɒləˈfoʊniən/","syllables":"Co-lo-pho-ni-an"},"inflection":{"noun_plural":"Colophonians"},"usage_notes":{"explanation":"The term 'Colophonian' is primarily historical, referring to the ancient city of Colophon and its inhabitants. It is rarely used in modern contexts except when discussing ancient history.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["colophony (noun): a type of resin, originally from Colophon"],"related_terms":["Ionian","Colophon"]},"level_frequency":{"frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Colophonian' is a highly specialized term primarily encountered in historical or academic contexts related to ancient Greece and Ionia. Its usage is infrequent in modern English. Understanding requires familiarity with ancient geography and history."},"example_sentences":[{"sentence":"Ancient sources mention the skill of Colophonian archers.","translation":"古代の情報源は、コロポンの射手の腕前について言及している。","type":"adjective","meaning_category":"古代イオニアの都市コロポンに関する"},{"sentence":"The Colophonians established a trade route through the Aegean Sea.","translation":"コロポンの住民はエーゲ海を通る交易路を確立した。","type":"noun","meaning_category":"古代イオニアの都市コロポンの住民"}]}