{"word":"Tarantulidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オオツチグモ科：大型で毛深いクモの一種","english_definition":"A family of large, hairy spiders (tarantulas).","examples":[{"sentence":"Tarantulidae are known for their large size and hairy bodies.","translation":"オオツチグモ科は、その大きな体と毛深い体で知られています。"},{"sentence":"Some species of Tarantulidae are popular as pets.","translation":"オオツチグモ科の一部の種はペットとして人気があります。"}],"collocations":["tarantula venom","tarantula bite","tarantula species","tarantula habitat"],"synonyms":["tarantula spider"],"antonyms":[]}],"etymology":{"value":"New Latin, from Tarantula, a town in Italy, + -idae (suffix indicating a zoological family). The spiders were once thought to be responsible for a form of hysteria known as tarantism.","priority":"★★☆"},"pronunciation":{"ipa":"/təˈræntjʊˌlaɪdiː/","syllables":"ta-ran-tu-li-dae"},"inflection":{"noun_plural":"Tarantulidae"},"usage_notes":{"explanation":"'Tarantulidae' refers to the scientific family name for tarantulas. The term 'tarantula' itself is often used more broadly to refer to any large, hairy spider, but scientifically, it specifically denotes members of this family.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Tarantulas are insects.","correct":"✓ Tarantulas are arachnids.","note":"Tarantulas are arachnids, not insects. Insects have six legs, while arachnids have eight."},{"incorrect":"✗ All tarantulas are deadly poisonous.","correct":"✓ Tarantula venom is generally not dangerous to humans.","note":"While tarantulas do possess venom, it is generally not considered dangerous to humans. Bites can be painful, but are rarely life-threatening."}],"priority":"★★☆"},"related_words":{"derivatives":["tarantula","spider","arachnid"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tarantulidae' is a scientific term referring to the family of spiders known as tarantulas. It is primarily used in scientific or zoological contexts. Understanding this term requires knowledge of biological classification systems."},"example_sentences":[{"sentence":"The classification of species within the Tarantulidae family is still under debate.","translation":"オオツチグモ科内の種の分類は、まだ議論の余地があります。","type":"general","meaning_category":"scientific classification"},{"sentence":"Many members of the Tarantulidae family are popular in the pet trade.","translation":"オオツチグモ科の多くのメンバーは、ペット取引で人気があります。","type":"general","meaning_category":"general"}]}