{"word":"Cabrillas","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A coastal area in Southern California, specifically near Point Loma in San Diego.","english_definition":"A geographical location referring to a coastal area, especially near Point Loma in San Diego, California.","examples":[{"sentence":"We went surfing at Cabrillas this morning.","translation":"今朝、カブリリャスでサーフィンに行きました。"},{"sentence":"The tide pools at Cabrillas are full of marine life.","translation":"カブリリャスの潮だまりは海洋生物でいっぱいです。"}],"collocations":["tide pools at Cabrillas","surfing at Cabrillas","coastal area of Cabrillas"],"synonyms":["Point Loma coastline","San Diego coast"],"antonyms":[]}],"etymology":{"value":"The name 'Cabrillas' is likely derived from Spanish, possibly referring to small goats (cabrilla is a diminutive of cabra, meaning goat). It may have been used by early Spanish explorers or settlers to describe the area.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈbriːjəs/","syllables":"Ca-bri-llas"},"inflection":{},"usage_notes":{"explanation":"'Cabrillas' is primarily used as a proper noun to denote a specific geographical area. It is not commonly used in general vocabulary. The term is mostly recognized by residents of Southern California, particularly those familiar with the San Diego region.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I live in Cabrillas, but it's far from the ocean.","correct":"✓ I live near Cabrillas, which is close to the ocean.","note":"Cabrillas refers to a coastal area, so living 'in' it implies proximity to the ocean."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_locations":["Point Loma","San Diego","Southern California"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Proper noun - geographical location)","frequency_google_ngram":"Low frequency - Primarily a local term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cabrillas' is a specific place name, referring to a coastal area near Point Loma in San Diego, California. It's not a commonly known word unless you are familiar with that region. The term is used in a geographical context and doesn't have broader applications. Understanding its meaning requires knowledge of Southern California geography."},"example_sentences":[{"sentence":"The views from the cliffs at Cabrillas are breathtaking.","translation":"カブリリャスの崖からの眺めは息をのむほどです。","type":"noun","meaning_category":"geographical location"},{"sentence":"Many tourists visit Cabrillas to explore the tide pools.","translation":"多くの観光客が潮だまりを探検するためにカブリリャスを訪れます。","type":"noun","meaning_category":"geographical location"}]}