{"word":"deculturation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"脱文化、文化喪失、文化変容","english_definition":"The process by which a person or group gives up their own culture and adopts another culture. It can also refer to the loss of cultural identity or traditions.","examples":[{"sentence":"The deculturation of indigenous populations is a tragic consequence of colonization.","translation":"先住民の脱文化は植民地化の悲劇的な結果である。"},{"sentence":"Forced assimilation policies often lead to deculturation.","translation":"強制的な同化政策はしばしば脱文化につながる。"},{"sentence":"The rapid globalization is causing deculturation in many traditional societies.","translation":"急速なグローバル化は多くの伝統社会で脱文化を引き起こしている。"}],"collocations":["cultural deculturation","forced deculturation","process of deculturation","lead to deculturation","result in deculturation"],"synonyms":["acculturation (when referring to adopting another culture)","assimilation","cultural loss","cultural erosion","cultural change"],"antonyms":["enculturation","cultural preservation","cultural revitalization"]}],"etymology":{"value":"Derived from 'de-' (meaning 'removal' or 'reversal') + 'culturation' (the process of cultural transmission or adoption).","priority":"★★☆"},"pronunciation":{"ipa":"/diːˌkʌltʃəˈreɪʃən/","syllables":"de-cul-tur-a-tion"},"inflection":{"noun_plural":"deculturations"},"usage_notes":{"explanation":"'Deculturation' refers to the process where an individual or group loses its own culture, often due to external pressures or prolonged contact with another culture. It can involve the loss of language, traditions, values, and social identity. It is often associated with negative consequences, such as cultural alienation and psychological distress. It is distinct from 'acculturation,' which refers to the adoption of a new culture while retaining aspects of the original culture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The deculturation was a positive experience for them.","correct":"✓ The acculturation was a positive experience for them.","note":"'Deculturation' typically implies a loss of one's original culture, which is often viewed negatively. If the experience is positive, 'acculturation' (adopting a new culture) is more appropriate."},{"incorrect":"✗ Deculturation is the same as multiculturalism.","correct":"✓ Deculturation is different from multiculturalism.","note":"'Deculturation' is the loss of one's culture, while 'multiculturalism' is the coexistence of multiple cultures."}],"priority":"★☆☆"},"related_words":{"derivatives":["deculturate (verb)","deculturated (adjective)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deculturation' is a formal term used in social sciences and anthropology to describe the process of losing one's culture. This often happens when a group or person is forced to adopt a new culture, leading to the disappearance of their original traditions, language, and values. It's different from 'acculturation,' where people adopt aspects of a new culture while still keeping their old one. 'Deculturation' is usually seen as a negative thing because it can lead to a loss of identity and cultural heritage."},"example_sentences":[{"sentence":"The school's policies led to the deculturation of many immigrant children.","translation":"その学校の政策は多くの移民の子供たちの脱文化につながった。","type":"general","meaning_category":"cultural loss"},{"sentence":"Deculturation can have a devastating impact on a community's sense of identity.","translation":"脱文化はコミュニティのアイデンティティに壊滅的な影響を与える可能性がある。","type":"general","meaning_category":"cultural loss"},{"sentence":"Some argue that globalization is a form of deculturation.","translation":"グローバル化は脱文化の一形態であると主張する人もいる。","type":"general","meaning_category":"cultural change"}]}