{"word":"object-centeredness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"対象中心性、客体中心性","english_definition":"The quality of being focused on objects or things, rather than on people or ideas.","examples":[{"sentence":"The design philosophy emphasizes object-centeredness, prioritizing functionality and aesthetics.","translation":"その設計思想は対象中心性を重視し、機能性と美学を優先しています。"},{"sentence":"Some critics argue that modern society suffers from excessive object-centeredness, leading to materialism and a lack of empathy.","translation":"現代社会は過度の客体中心性に苦しんでおり、物質主義と共感の欠如につながっていると批判する人もいます。"}],"collocations":["object-centered design (対象中心設計)","object-centered learning (対象中心学習)","cultural object-centeredness (文化的な対象中心性)"],"synonyms":["materialism","objectification","thing-orientation"],"antonyms":["person-centeredness","subject-centeredness","humanism"]},{"part_of_speech":"noun","definition":"(心理学)対象恒常性の発達","english_definition":"(psychology) A stage in cognitive development where a child understands that objects continue to exist even when they are out of sight.","examples":[{"sentence":"Object-centeredness is a crucial milestone in a child's cognitive development, typically achieved around 8 months of age.","translation":"対象中心性は、通常生後8ヶ月頃に達成される、子供の認知発達における重要なマイルストーンです。"},{"sentence":"The experiment tested the infant's understanding of object-centeredness by hiding a toy under a blanket.","translation":"その実験では、おもちゃを毛布の下に隠すことによって、乳児の対象中心性の理解度をテストしました。"}],"collocations":["develop object-centeredness (対象中心性を発達させる)","achieve object-centeredness (対象中心性を達成する)","test object-centeredness (対象中心性をテストする)"],"synonyms":["object permanence"],"antonyms":[]}],"etymology":{"value":"Derived from 'object-centered' + '-ness' (suffix indicating a state or quality). 'Object-centered' combines 'object' (a thing) with 'centered' (focused on).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈɒbdʒɪktˌsɛntərdnəs/","syllables":"ob-ject-cen-terd-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Object-centeredness' can refer to a philosophical or cultural emphasis on objects, or to the psychological concept of object permanence. Context is crucial to understanding the intended meaning.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The object-centeredness of the company led to innovative products.","correct":"The object-centered approach of the company led to innovative products.","note":"'Object-centeredness' is a state or quality; 'object-centered approach' is the method or strategy."}],"priority":"☆☆☆"},"related_words":{"derivatives":["object-centered (adjective)"],"phrases":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Object-centeredness' is a complex term with uses in philosophy, sociology, and psychology. Understanding requires familiarity with abstract concepts and specialized vocabulary. The term may not be widely understood outside of academic contexts."},"example_sentences":[{"sentence":"The museum's exhibit highlighted the object-centeredness of ancient cultures.","translation":"博物館の展示は、古代文化の対象中心性を強調していました。","type":"noun","meaning_category":"cultural emphasis"},{"sentence":"The child's development of object-centeredness allowed them to understand that their mother still existed even when she left the room.","translation":"子供の対象中心性の発達により、母親が部屋から出て行ってもまだ存在することを理解できるようになりました。","type":"noun","meaning_category":"psychological development"}]}