{"word":"twice-roused","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"awakened or stimulated to action or feeling on two separate occasions.","english_definition":"Having been awakened or stimulated to action or feeling two separate times.","examples":[{"sentence":"The twice-roused dragon was even more furious than before.","translation":"二度起こされたドラゴンは、以前よりもさらに激怒していた。"},{"sentence":"His twice-roused curiosity led him to investigate further.","translation":"彼の二度となく呼び起こされた好奇心は、彼をさらに調査へと導いた。"}],"collocations":["twice-roused anger","twice-roused interest","twice-roused suspicion"],"synonyms":["re-awakened","re-stimulated","double-aroused"],"antonyms":["unroused","dormant","quiescent"]}],"etymology":{"value":"A compound adjective formed from 'twice' (meaning two times) and 'roused' (past participle of 'rouse', meaning to awaken or stir up).","priority":"N/A"},"pronunciation":{"ipa":"/ˌtwaɪs ˈraʊzd/","syllables":"twice-roused"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative or superlative constructions with 'more' and 'most' respectively (e.g., 'more twice-roused')."},"usage_notes":{"explanation":"'Twice-roused' is a descriptive adjective used to indicate that something or someone has been awakened or stimulated to action or feeling on two separate occasions. It often implies a heightened state of emotion or activity due to the repeated stimulus.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He was twice rouse.","correct":"✓ He was twice-roused.","note":"The correct form is 'twice-roused' as it's the past participle acting as an adjective."}],"priority":"N/A"},"related_words":{"derivatives":["rouse (verb)","rousing (adjective)","twice (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - not a commonly used term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Twice-roused' is a relatively uncommon compound adjective. It describes something that has been awakened or stimulated on two separate occasions. The term is fairly self-explanatory, combining the adverb 'twice' with the past participle 'roused' to indicate a repeated state of arousal or stimulation. Due to its specific and somewhat literary nature, it is more likely to be encountered in advanced texts or creative writing. Understanding the individual components ('twice' and 'roused') is key to grasping the meaning of the compound word."},"example_sentences":[{"sentence":"The twice-roused bear charged with renewed ferocity.","translation":"二度起こされた熊は、新たな獰猛さで突進してきた。","type":"adjective","meaning_category":"awakened"},{"sentence":"Her twice-roused suspicion made her double-check the documents.","translation":"彼女の二度となく呼び起こされた疑念は、彼女に書類を再確認させた。","type":"adjective","meaning_category":"stimulated"}]}