{"word":"bombastically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"大げさに、仰々しく、誇張して","english_definition":"in a pompous and inflated manner; with excessive self-importance and grandiosity.","examples":[{"sentence":"He spoke bombastically about his achievements, exaggerating his role in the project.","translation":"彼はプロジェクトにおける自分の役割を誇張して、自分の業績について大げさに語った。"},{"sentence":"The politician bombastically declared his commitment to the people, but his actions proved otherwise.","translation":"その政治家は国民への献身を仰々しく宣言したが、彼の行動はそうではないことを証明した。"},{"sentence":"The actor delivered his lines bombastically, lacking sincerity and genuine emotion.","translation":"その俳優は誠実さや本物の感情を欠き、仰々しくセリフを言った。"}],"collocations":["speak bombastically","declare bombastically","deliver bombastically"],"synonyms":["pompously","grandiloquently","rhetorically","theatrically","ostentatiously","pretentiously"],"antonyms":["modestly","humbly","simply","unassumingly"]}],"etymology":{"value":"Derived from 'bombastic,' which comes from Middle French 'bombace' (cotton padding), referring to the inflated style of writing or speaking.","priority":"★★☆"},"pronunciation":{"ipa":"/bɒmˈbæstɪkli/","syllables":"bom-bas-ti-cal-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Bombastically' describes a way of speaking or writing that is excessively elaborate, self-important, and often insincere. It suggests an attempt to impress others through inflated language and exaggerated claims. The term carries a negative connotation, implying a lack of genuine substance behind the grandiose presentation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted bombastically in order to help people.","correct":"✓ He acted generously in order to help people.","note":"'Bombastically' is not used to describe good intentions, but rather a pompous and exaggerated manner of speaking or acting. Use a different adverb to describe positive actions."},{"incorrect":"✗ The bombastically room was decorated with gold.","correct":"✓ The lavishly decorated room was filled with gold.","note":"'Bombastically' is an adverb that describes how something is said or done, not an adjective to describe a noun. Use an adjective like 'lavish' or 'ornate' to describe a room."}],"priority":"★★☆"},"related_words":{"derivatives":["bombastic (adjective)","bombast (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'bombastically' is used to describe someone speaking or writing in a way that is overly grand, pompous, and often insincere. It suggests an attempt to impress others with exaggerated language rather than genuine content. This word is not commonly used in everyday conversation and is more likely to appear in formal writing or when describing someone's behavior critically."},"example_sentences":[{"sentence":"The general bombastically addressed the troops before the battle, promising them certain victory.","translation":"将軍は戦いの前に兵士たちに大げさに演説し、勝利を約束した。","type":"general"},{"sentence":"The lawyer bombastically presented his case to the jury, hoping to sway their opinion with dramatic flair.","translation":"弁護士は陪審員の意見を劇的な演出で揺さぶろうと、大げさに自分の主張を述べた。","type":"legal"},{"sentence":"The critic described the film as bombastically sentimental, lacking subtlety and emotional depth.","translation":"評論家はその映画を、繊細さや感情の深みがなく、大げさに感傷的だと評した。","type":"criticism"}]}