{"word":"zirconium","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ジルコニウム (元素記号: Zr)","english_definition":"A metallic chemical element with the symbol Zr and atomic number 40. It is a lustrous, grey-white, strong transition metal that closely resembles hafnium and, to a lesser extent, titanium.","examples":[{"sentence":"Zirconium is used in nuclear reactors because it does not readily absorb neutrons.","translation":"ジルコニウムは中性子を容易に吸収しないため、原子炉で使用されます。"},{"sentence":"Zirconium oxide is used in some ceramics.","translation":"酸化ジルコニウムは一部のセラミックスで使用されます。"}],"collocations":["zirconium oxide","zirconium alloy","zirconium dioxide","zirconium crucible"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'Zirkon,' the German name for zircon, which is the most important source of zirconium. The word 'Zirkon' is believed to be derived from the Persian word 'zargun' meaning 'gold-colored.'","priority":"★★☆"},"pronunciation":{"ipa":"/zərˈkoʊniəm/","syllables":"zir-co-ni-um"},"inflection":{"noun_plural":"zirconiums (rarely used)"},"usage_notes":{"explanation":"Zirconium is primarily used in industrial applications due to its resistance to corrosion and its ability to withstand high temperatures. It is also biocompatible, making it suitable for medical implants. The term is generally used in scientific or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Zirconium is a gas.","correct":"✓ Zirconium is a metal.","note":"Zirconium is a metal, not a gas."}],"priority":"★★☆"},"related_words":{"derivatives":["zirconia (ジルコニア)","zircon (ジルコン)"],"phrasal_verbs":[],"related_elements":["titanium (チタン)","hafnium (ハフニウム)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'zirconium' is a technical term primarily used in scientific, industrial, or engineering contexts. Understanding its properties and applications requires a background in chemistry or materials science. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The fuel rods in the nuclear reactor are clad in a zirconium alloy.","translation":"原子力原子炉の燃料棒はジルコニウム合金で覆われています。","type":"noun","meaning_category":"element"},{"sentence":"Zirconium is highly resistant to corrosion by many acids and alkalis.","translation":"ジルコニウムは多くの酸やアルカリによる腐食に対して高い耐性があります。","type":"noun","meaning_category":"element"}]}