{"word":"Assmannshausen","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アスマンスハウゼン：ドイツ、ヘッセン州リューデスハイム・アム・ライン地区にある村。赤ワインの産地として知られる。","english_definition":"Assmannshausen: A village in the Rheingau region of Germany, part of Rüdesheim am Rhein, Hesse. It is known for its red wine production, particularly Spätburgunder (Pinot Noir).","examples":[{"sentence":"We visited Assmannshausen to taste their famous red wine.","translation":"私たちは有名な赤ワインを味わうためにアスマンスハウゼンを訪れました。"},{"sentence":"Assmannshausen is a picturesque village on the Rhine river.","translation":"アスマンスハウゼンはライン川沿いの美しい村です。"}],"collocations":["Assmannshausen red wine","visit Assmannshausen","near Assmannshausen"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name Assmannshausen is derived from the personal name 'Asmann' and 'hausen,' meaning 'houses' or 'settlement.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈasmansˌhaʊzən/","syllables":"Ass-manns-hau-sen"},"inflection":{},"usage_notes":{"explanation":"Assmannshausen is primarily known as a geographical location, specifically a village famous for its red wine. It's often used in the context of travel, wine tasting, or describing the Rheingau region.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Rüdesheim am Rhein (リューデスハイム・アム・ライン)","Rheingau (ラインガウ)","Spätburgunder (シュペートブルグンダー、ピノ・ノワール)"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"Assmannshausen is a proper noun referring to a specific location in Germany. It is unlikely to be encountered in basic English conversation but may appear in travel guides, wine reviews, or geographical discussions related to Germany. Understanding its significance requires some knowledge of German geography and wine culture."},"example_sentences":[{"sentence":"The vineyards of Assmannshausen produce some of Germany's finest Pinot Noir.","translation":"アスマンスハウゼンのブドウ畑では、ドイツで最も優れたピノ・ノワールが生産されています。","type":"noun","meaning_category":"location"},{"sentence":"We took a boat trip from Rüdesheim to Assmannshausen.","translation":"私たちはリューデスハイムからアスマンスハウゼンまで船旅をしました。","type":"noun","meaning_category":"location"}]}