{"word":"pidginized","priority":"★★☆","meanings":[{"part_of_speech":"verb (past participle)","definition":"ピジン化された、ピジン言語に変化した","english_definition":"(of a language) having been simplified and altered to enable speakers of different languages to communicate.","examples":[{"sentence":"The English spoken in that region has become highly pidginized.","translation":"その地域で話されている英語は、非常にピジン化されている。"},{"sentence":"Over time, the trade language pidginized, incorporating elements from various local dialects.","translation":"時が経つにつれて、貿易言語はピジン化し、さまざまな地域の方言の要素を取り入れた。"}],"collocations":["highly pidginized","become pidginized","pidginized form","pidginized version"],"synonyms":["creolized (related, but implies further development)","simplified","hybridized","localized"],"antonyms":["standardized","formalized","pure","unadulterated"]},{"part_of_speech":"adjective","definition":"ピジン化された、ピジン言語の性質を持つ","english_definition":"exhibiting characteristics of a pidgin language; simplified and adapted for communication between speakers of different languages.","examples":[{"sentence":"The pidginized dialect was difficult for outsiders to understand fully.","translation":"そのピジン化された方言は、外部の人々が完全に理解するには難しかった。"},{"sentence":"A pidginized language often lacks the grammatical complexity of its parent languages.","translation":"ピジン化された言語は、しばしばその親言語の文法的な複雑さを欠いている。"}],"collocations":["pidginized English","pidginized French","pidginized form","pidginized speech"],"synonyms":["simplified","hybrid","creole-like"],"antonyms":["standard","formal","pure"]}],"etymology":{"value":"Derived from the verb 'pidginize,' which comes from 'pidgin,' referring to a simplified language used for communication between groups with different native languages. The suffix '-ed' indicates the past participle or adjective form.","priority":"★★☆"},"pronunciation":{"ipa":"ˈpɪdʒɪnaɪzd","syllables":"pi-dgin-ized"},"inflection":{"notes":"This is the past participle and adjective form of the verb 'pidginize.' The base verb 'pidginize' inflects regularly (pidginize, pidginizes, pidginized, pidginizing)."},"usage_notes":{"explanation":"'Pidginized' describes a language that has undergone simplification and modification to facilitate communication between speakers of different languages. It can refer to the process (verb form) or the state of the language (adjective form). A pidgin language is typically characterized by a reduced vocabulary, simplified grammar, and a reliance on context for meaning. It is important to note that while pidgin languages serve a vital communicative function, they are often viewed as less prestigious than standard languages.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The language was pidgin.","correct":"✓ The language was pidginized.","note":"'Pidgin' is a noun referring to the language itself. 'Pidginized' is the adjective describing the state of being transformed into a pidgin or having pidgin-like characteristics."},{"incorrect":"✗ He pidgin the language.","correct":"✓ He pidginized the language.","note":"The verb form is 'pidginize,' not 'pidgin'."}],"priority":"★★☆"},"related_words":{"derivatives":["pidgin (noun): A simplified language used for communication between groups with different native languages.","pidginize (verb): To simplify and adapt a language for communication between groups with different native languages.","pidginization (noun): The process of a language becoming pidginized.","creole (noun): A language that develops from a pidgin and becomes the native language of a community.","creolization (noun): The process of a pidgin language developing into a creole language."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1-C2 (specialized vocabulary)","frequency_google_ngram":"Relatively low frequency, used primarily in linguistics and sociolinguistics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pidginized' is a term used in linguistics to describe a language that has been simplified and modified to allow people who speak different languages to communicate. It's often used when discussing how languages evolve in areas where trade or other interactions bring different linguistic groups together. The word implies that the language has undergone a process of simplification and adaptation, resulting in a new, hybrid form of communication. It is a technical term, so it is more commonly found in academic or specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The **pidginized** form of English made it easier for tourists to communicate with the locals.","translation":"ピジン化された英語の形は、観光客が地元の人々とコミュニケーションをとるのを容易にした。","type":"adjective","meaning_category":"ピジン言語の性質を持つ"},{"sentence":"As trade increased, the local language became increasingly **pidginized**.","translation":"貿易が増加するにつれて、現地語はますますピジン化された。","type":"verb (past participle)","meaning_category":"ピジン言語に変化した"},{"sentence":"Linguists studied the **pidginized** speech patterns of the immigrant community.","translation":"言語学者は、移民コミュニティのピジン化された話し方のパターンを研究した。","type":"adjective","meaning_category":"ピジン言語の性質を持つ"},{"sentence":"The **pidginized** language served as a bridge between the two cultures.","translation":"そのピジン化された言語は、二つの文化の架け橋として機能した。","type":"adjective","meaning_category":"ピジン言語の性質を持つ"}]}