{"word":"hyperemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"充血、血管充満","english_definition":"An excess of blood in the vessels supplying an organ or other part of the body.","examples":[{"sentence":"Hyperemia of the conjunctiva is a common sign of eye irritation.","translation":"結膜の充血は、目の炎症の一般的な兆候です。"},{"sentence":"Reactive hyperemia occurs after a period of ischemia.","translation":"反応性充血は、虚血期間後に発生します。"}],"collocations":["reactive hyperemia","conjunctival hyperemia","pulmonary hyperemia"],"synonyms":["congestion","engorgement","plethora"],"antonyms":["ischemia","anemia"]}],"etymology":{"value":"From Ancient Greek ὑπέρ (hupér, \"over, above\") + αἷμα (haîma, \"blood\") + -ία (-ía, suffix indicating a condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpəˈriːmiə/","syllables":"hy·per·e·mi·a"},"inflection":{"noun_plural":"hyperemias"},"usage_notes":{"explanation":"Hyperemia refers to an increased blood flow to a particular tissue or organ. It can be active (due to increased arterial inflow) or passive (due to impaired venous outflow). It is a descriptive term and not a disease in itself, but rather a sign of an underlying condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor diagnosed him with hyperemia disease.","correct":"✓ The doctor noted hyperemia in the patient's lungs.","note":"Hyperemia is a condition, not a disease. It's more accurate to say that a doctor 'noted' or 'observed' hyperemia."}],"priority":"★★☆"},"related_words":{"derivatives":["hyperemic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hyperemia' is a technical term used in medicine to describe an increased amount of blood in a part of the body. It's not a common word in everyday conversation, but it is important in medical contexts. It can be active, resulting from increased blood flow, or passive, resulting from reduced blood outflow. Understanding this term is useful for comprehending medical reports or discussions about circulatory conditions."},"example_sentences":[{"sentence":"The redness of the skin was due to local hyperemia.","translation":"皮膚の赤みは局所的な充血によるものでした。","type":"noun","meaning_category":"充血"},{"sentence":"Exercise can cause transient hyperemia in muscles.","translation":"運動は筋肉に一過性の充血を引き起こす可能性があります。","type":"noun","meaning_category":"充血"},{"sentence":"Pulmonary hyperemia can be a sign of heart failure.","translation":"肺の充血は心不全の兆候である可能性があります。","type":"noun","meaning_category":"充血"}]}