{"word":"smirkly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"ニヤニヤしながら、したり顔で","english_definition":"In a manner characterized by a smug, conceited, or self-satisfied smile.","examples":[{"sentence":"He smirkly accepted the award, knowing he hadn't deserved it.","translation":"彼は自分がふさわしくないと知りながら、したり顔で賞を受け取った。"},{"sentence":"She smirkly watched as her opponent struggled.","translation":"彼女は対戦相手が苦戦するのをニヤニヤしながら見ていた。"}],"collocations":["smirkly smile","smirkly look","smirkly accept","smirkly observe"],"synonyms":["smugly","conceitedly","self-satisfiedly","complacently"],"antonyms":["humbly","modestly","unassumingly"]}],"etymology":{"value":"Derived from the adjective 'smirky' (characterized by a smirk) with the addition of the adverbial suffix '-ly'. The root word 'smirk' likely comes from Old English or Middle Dutch, related to words meaning 'to smile affectedly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsmɜːrkli/","syllables":"smirk-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Smirkly' describes an action performed with a smirk, implying smugness, self-satisfaction, or a sense of superiority. It's used to convey a negative connotation, suggesting the person is pleased with themselves, often at the expense of others. It is less common than 'smugly'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He smirkly was happy.","correct":"✓ He smirkly smiled.","note":"'Smirkly' describes the manner of an action, not a state of being. It should modify a verb that involves facial expression or behavior. You can't 'be smirkly', but you can 'smile smirkly'."}],"priority":"★★☆"},"related_words":{"derivatives":["smirk (noun, verb)","smirky (adjective)","smug (adjective)","smugly (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Smirkly' is an adverb that describes how an action is performed, specifically with a smug or self-satisfied smile. It implies a sense of superiority or pleasure at someone else's misfortune. The word is relatively uncommon and more sophisticated, suitable for advanced English learners who want to express nuanced meanings. It is important to use this word accurately, as it carries a negative connotation."},"example_sentences":[{"sentence":"The villain smirkly revealed his evil plan.","translation":"悪役はニヤニヤしながら自分の邪悪な計画を明らかにした。","type":"adverb","meaning_category":"ニヤニヤしながら"},{"sentence":"She smirkly glanced at her rival, knowing she had won.","translation":"彼女は自分が勝ったことを知り、したり顔でライバルをちらっと見た。","type":"adverb","meaning_category":"したり顔で"}]}