{"word":"unemasculatory","priority":"低","meanings":[{"part_of_speech":"adjective","definition":"去勢をしない、去勢的でない、男性らしさを損なわない","english_definition":"Not emasculating; not depriving of virility or vigor; not weakening or undermining masculinity.","examples":[{"sentence":"The movie's portrayal of male characters was praised for being unemasculatory.","translation":"その映画における男性キャラクターの描写は、男性らしさを損なわないものとして賞賛された。"},{"sentence":"He sought an unemasculatory approach to leadership, emphasizing strength and decisiveness.","translation":"彼はリーダーシップに対する去勢的でないアプローチを模索し、強さと決断力を強調した。"}],"collocations":["unemasculatory portrayal","unemasculatory approach","unemasculatory depiction"],"synonyms":["virile","masculine","manly","vigorous","empowering","strengthening"],"antonyms":["emasculatory","weakening","undermining","debilitating","castrating"]}],"etymology":{"value":"\"un-\" (否定) + \"emasculatory\" (去勢的な)","priority":"低"},"pronunciation":{"ipa":"/ˌʌnɪˈmæskjʊlətɔːri/","syllables":"un-e-mas-cu-la-to-ry"},"inflection":{"adjective_forms":{"comparative":"more unemasculatory","superlative":"most unemasculatory"}},"usage_notes":{"explanation":"\"Unemasculatory\" is used to describe something that does not diminish or weaken masculinity. It is often used in discussions about gender roles, media representation, and leadership styles. The word implies a positive affirmation of traditional masculine traits without being toxic or harmful.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ The unemasculatory man.","correct":"✓ The unemasculatory portrayal of the man.","note":"\"Unemasculatory\" typically describes a portrayal, approach, or depiction, rather than a person directly. It refers to the effect or quality of something rather than being a characteristic of an individual."}],"priority":"低"},"related_words":{"derivatives":["emasculate (verb, to deprive of virility or vigor; to weaken)","emasculation (noun, the act of emasculating)","masculinity (noun, the quality of being masculine)"],"priority":"中"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"低"},"readability_explanation":{"level":"C2","text":"\"Unemasculatory\" is a relatively rare and complex word. It is formed by adding the prefix \"un-\" to \"emasculatory,\" which means \"tending to deprive of virility or vigor.\" Therefore, \"unemasculatory\" means \"not tending to deprive of virility or vigor\" or \"not weakening masculinity.\" This word is typically used in academic or critical discussions about gender, media, and power dynamics. Understanding the root word \"emasculate\" is essential to grasp the meaning of \"unemasculatory.\""},"example_sentences":[{"sentence":"The film received praise for its unemasculatory depiction of male friendship.","translation":"その映画は、男性の友情を去勢的でない方法で描いたことで賞賛された。","type":"adjective","meaning_category":"男性らしさを損なわない"},{"sentence":"The leader adopted an unemasculatory style that empowered his team members.","translation":"そのリーダーは、チームメンバーを力づけるような、男性らしさを損なわないスタイルを採用した。","type":"adjective","meaning_category":"男性らしさを損なわない"}]}