{"word":"Enrollments","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"登録者数、入学[入会]者数","english_definition":"The number of people who have officially registered or enrolled in a course, program, school, or organization.","examples":[{"sentence":"The university saw a significant increase in enrollments this year.","translation":"その大学では今年、登録者数が大幅に増加した。"},{"sentence":"Enrollments for the summer program are now open.","translation":"夏季プログラムの入学受付が開始されました。"},{"sentence":"Due to low enrollments, the class was cancelled.","translation":"登録者数が少なかったため、そのクラスはキャンセルされました。"}],"collocations":["increase in enrollments (登録者数の増加)","decline in enrollments (登録者数の減少)","enrollments are open (登録受付中)","boost enrollments (登録者数を増やす)","enrollment figures (登録者数)"],"synonyms":["registrations","admissions","subscriptions","memberships"],"antonyms":["withdrawals","cancellations","dropouts"]}],"etymology":{"value":"The word \"enrollment\" comes from the verb \"enroll,\" which originated in the late 15th century. It is derived from the Old French word \"enroller,\" meaning \"to write in a roll or register.\" This, in turn, comes from \"en-\" (meaning \"in\") and \"roller\" (meaning \"roll\"). The \"roll\" refers to a list or register of names.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈroʊlmənts/","syllables":"en-roll-ments"},"inflection":{"noun_plural":"enrollments"},"usage_notes":{"explanation":"\"Enrollments\" is a plural noun that refers to the total number of people who have registered or signed up for something, typically a course, program, or institution. It is often used in an educational context to describe the number of students attending a school or university. The term can also be used in other contexts, such as membership in an organization or participation in a program.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The enrollment are high.","correct":"✓ The enrollments are high.","note":"\"Enrollments\" is a plural noun, so it requires a plural verb form (\"are\")."},{"incorrect":"✗ We need to increase enrollment.","correct":"✓ We need to increase enrollments.","note":"When referring to the total number of people enrolled, use the plural form \"enrollments.\" \"Enrollment\" (singular) refers to the act of enrolling."}],"priority":"★★☆"},"related_words":{"derivatives":["enroll (verb: 登録する、入学[入会]する)","enrollee (noun: 登録者、入学者[入会者])","enrolling (adjective: 登録している)"],"antonyms":["graduation (卒業)","termination (終了)"],"related_terms":["registration (登録)","admission (入学許可)","matriculation (入学)","student body (学生全体)","census (国勢調査)"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"enrollments\" refers to the number of people who have officially signed up for something, like a class or a program. It's often used in schools and universities to talk about how many students are attending. It's important to use the plural form \"enrollments\" when you're talking about the total number of people, not just the act of signing up. You might see this word in news articles or reports about education or membership in organizations."},"example_sentences":[{"sentence":"The college reported record enrollments this fall.","translation":"その大学は今秋、過去最高の登録者数を報告した。","type":"general"},{"sentence":"Enrollments in online courses have surged in recent years.","translation":"オンラインコースの登録者数は近年急増している。","type":"education"},{"sentence":"The organization is working to boost enrollments among young adults.","translation":"その組織は若年層の登録者数を増やすために活動している。","type":"membership"}]}