{"word":"Acinetaria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"太陽虫亜綱（放散虫類）","english_definition":"An obsolete taxonomic group of protozoans, now included in the Radiolaria (or sometimes Heliozoa), characterized by radiating pseudopodia used for capturing prey.","examples":[{"sentence":"Acinetaria were once classified as a distinct group of protozoa.","translation":"かつてアキネタリアは原生動物の独立したグループとして分類されていました。"},{"sentence":"The taxonomy of Acinetaria has been revised based on modern molecular data.","translation":"アキネタリアの分類は、最新の分子データに基づいて見直されました。"}],"collocations":["Acinetaria taxonomy","Acinetaria classification","Radiolaria and Acinetaria"],"synonyms":["Radiolaria","Heliozoa"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'acinetos' meaning 'immobile' or 'motionless', referring to their sessile lifestyle.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæsɪnɪˈteəriə/","syllables":"A-ci-ne-ta-ri-a"},"inflection":{"noun_plural":"Acinetaria (already plural)"},"usage_notes":{"explanation":"The term 'Acinetaria' is largely obsolete in modern taxonomy. Organisms formerly classified under this group are now generally considered to be part of Radiolaria or, in some cases, Heliozoa. When encountered, it usually refers to historical classifications in older scientific literature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Acinetaria is a type of bacteria.","correct":"✓ Acinetaria were a group of protozoa (now Radiolaria or Heliozoa).","note":"Acinetaria are not bacteria; they are/were protozoa."}],"priority":"★★☆"},"related_words":{"derivatives":["acinetos (Greek root)"],"phrases":["Radiolarian ooze (sediment containing Acinetaria remains)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized scientific term)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Acinetaria' is a highly specialized term primarily used in the context of historical classifications of protozoa, specifically within the fields of zoology and marine biology. Understanding its meaning requires knowledge of taxonomic classifications and the history of protozoan taxonomy. The term is rarely encountered outside of scientific literature and specialized academic discussions. Its usage is declining as modern molecular phylogenetics has led to reclassifications of these organisms. Therefore, it is a term best understood by experts in related fields."},"example_sentences":[{"sentence":"Older textbooks may still refer to Acinetaria as a distinct group.","translation":"古い教科書では、アキネタリアがまだ独立したグループとして言及されている場合があります。","type":"noun","meaning_category":"classification"},{"sentence":"The siliceous skeletons of Acinetaria contribute to marine sediments.","translation":"アキネタリアの珪酸質の骨格は、海洋堆積物に寄与しています。","type":"noun","meaning_category":"biology"}]}