{"word":"tomboy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"おてんば娘、男の子のような女の子","english_definition":"a girl who enjoys activities and interests that are traditionally considered masculine, such as playing sports or wearing boyish clothes.","examples":[{"sentence":"She was a tomboy when she was younger, always climbing trees and playing sports.","translation":"彼女は若い頃はおてんば娘で、いつも木に登ったりスポーツをしたりしていました。"},{"sentence":"Some people think it's just a phase, but she's always been a tomboy.","translation":"ただの一時的なものだと思う人もいますが、彼女はいつもおてんば娘でした。"},{"sentence":"She preferred playing with cars and trucks to dolls, and was considered a tomboy by her family.","translation":"彼女は人形よりも車やトラックで遊ぶのが好きで、家族からはおてんば娘だと思われていました。"}],"collocations":["typical tomboy","self-described tomboy","former tomboy","growing up as a tomboy","being a tomboy"],"synonyms":["rambunctious girl","spirited girl","boyish girl","athletic girl"],"antonyms":["girly-girl","feminine girl"]},{"part_of_speech":"adjective","definition":"おてんばな、男の子のような","english_definition":"(of a girl) having qualities or habits usually associated with boys.","examples":[{"sentence":"She had a tomboyish charm that attracted many friends.","translation":"彼女には多くの友人を惹きつけるおてんばな魅力がありました。"},{"sentence":"Her tomboyish style included wearing jeans and sneakers.","translation":"彼女のおてんばなスタイルには、ジーンズとスニーカーを履くことが含まれていました。"}],"collocations":["tomboyish style","tomboyish charm","tomboyish appearance"],"synonyms":["boyish","masculine (for a girl)","unfeminine"],"antonyms":["girlish","feminine"]}],"etymology":{"value":"The word 'tomboy' originated in the mid-16th century. 'Tom' was a common nickname for a boy, and the term initially referred to a boisterous or unruly boy. By the late 16th century, it was also applied to girls who behaved in a similar manner. The term has evolved over time, and while it can sometimes carry negative connotations, it is often used simply to describe a girl who enjoys activities and interests traditionally associated with boys.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɒmˌbɔɪ/","syllables":"tom-boy"},"inflection":{"noun_plural":"tomboys","adjective_forms":{}},"usage_notes":{"explanation":"The term 'tomboy' is used to describe girls who exhibit characteristics or behaviors that deviate from traditional gender norms. While some may view the term as outdated or even offensive, others see it as a neutral descriptor of a girl's personality and interests. It's important to be mindful of individual preferences when using this term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a tomboy.","correct":"She is a tomboy.","note":"'Tomboy' specifically refers to a girl, so it's incorrect to use it for a boy."},{"incorrect":"She is tomboyish boy.","correct":"She is a tomboyish girl.","note":"'Tomboyish' is an adjective that describes a girl, so it should be used with 'girl' or a similar noun."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["gender roles","gender stereotypes","gender identity"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"tomboy\" describes a girl who likes activities and clothes that are traditionally seen as suitable for boys. It's a fairly common word, but it can sometimes be seen as a bit old-fashioned. Some people might not like the word because they think it reinforces gender stereotypes. It's important to be aware of these potential sensitivities when using the word."},"example_sentences":[{"sentence":"Growing up, she was always a **tomboy**, preferring sports to dolls.","translation":"子供の頃、彼女はいつもおてんばで、人形よりもスポーツが好きでした。","type":"noun","meaning_category":"おてんば娘"},{"sentence":"Her **tomboyish** style included wearing baseball caps and oversized t-shirts.","translation":"彼女のおてんばなスタイルには、野球帽とオーバーサイズのTシャツを着ることが含まれていました。","type":"adjective","meaning_category":"おてんばな"},{"sentence":"She didn't care about traditional gender roles and embraced her **tomboy** identity.","translation":"彼女は伝統的な性別の役割を気にせず、おてんばな自分を受け入れました。","type":"noun","meaning_category":"おてんば娘"},{"sentence":"Some people found her **tomboyish** behavior refreshing and unique.","translation":"彼女のおてんばな振る舞いを、さわやかでユニークだと感じる人もいました。","type":"adjective","meaning_category":"おてんばな"},{"sentence":"She was a **tomboy** at heart, even though she sometimes wore dresses.","translation":"彼女はドレスを着ることもありましたが、心はおてんば娘でした。","type":"noun","meaning_category":"おてんば娘"},{"sentence":"Her **tomboyish** spirit made her a natural leader.","translation":"彼女のおてんばな精神が、彼女を生まれながらのリーダーにしました。","type":"adjective","meaning_category":"おてんばな"}]}