{"word":"woodwaxes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"木材用ワックス (複数形)","english_definition":"plural of woodwax: waxes used to polish and protect wooden surfaces.","examples":[{"sentence":"She applied woodwaxes to the antique furniture to restore its shine.","translation":"彼女はアンティーク家具に木材用ワックスを塗って、輝きを取り戻した。"}],"collocations":["apply woodwaxes","polish with woodwaxes"],"synonyms":["wood polish","furniture wax"],"antonyms":[]}],"etymology":{"value":"'wood' (木材) + 'waxes' (ワックスの複数形)","priority":"★★★"},"pronunciation":{"ipa":"/ˈwʊdwæksɪz/","syllables":"wood-wax-es"},"inflection":{"noun_plural":"woodwaxes"},"usage_notes":{"explanation":"'Woodwaxes' is the plural form of 'woodwax,' referring to various types of waxes used for finishing and protecting wood. It is generally used to describe a collection or variety of wood finishing products.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used woodwax on all the furniture.","correct":"✓ He used woodwax on all the furniture. (correct if referring to a single type of wax) / ✓ He used woodwaxes on all the furniture. (correct if referring to multiple types of wax)","note":"Use 'woodwax' for a single type of wax and 'woodwaxes' when referring to multiple types or a collection of waxes."}],"priority":"★★☆"},"related_words":{"derivatives":["woodwax (singular form)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'woodwaxes' refers to multiple types of wax products used to polish and protect wooden surfaces. It is a relatively specialized term used in the context of woodworking and furniture care. Understanding this term requires familiarity with the general concept of wood finishing products."},"example_sentences":[{"sentence":"The store offers a wide selection of woodwaxes for different types of wood.","translation":"その店では、さまざまな種類の木材に対応した幅広い木材用ワックスを取り扱っています。","type":"noun","meaning_category":"木材用ワックス (複数形)"}]}