{"word":"chrysopal","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"クリソプレーズ","english_definition":"A green variety of chalcedony, colored by nickel compounds.","examples":[{"sentence":"She wore a necklace adorned with chrysopal stones.","translation":"彼女はクリソプレーズの石で飾られたネックレスを身に着けていた。"},{"sentence":"The museum displayed a collection of rare chrysopal specimens.","translation":"博物館には珍しいクリソプレーズの標本が展示されていた。"}],"collocations":["chrysopal jewelry","green chrysopal","rare chrysopal","chrysopal stone","chrysopal specimen"],"synonyms":["chalcedony","agate","jasper"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'chrysos' (gold) and 'opalos' (opal), referring to its golden-green color and resemblance to opal.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɪsəpɔːl/","syllables":"chrys-o-pal"},"inflection":{"noun_plural":"chrysopals"},"usage_notes":{"explanation":"Chrysopal is primarily used to refer to the gemstone chrysoprase. It's not a very common word in everyday conversation but is recognized in gemology and jewelry contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a chrysopal ring, it was very expensive opal.","correct":"✓ I bought a chrysopal ring, it was a very expensive chrysoprase.","note":"Chrysopal is a type of chalcedony (cryptocrystalline silica), not a type of opal. Although its name contains 'opal', it is not related to opal in terms of mineral composition."}],"priority":"★★☆"},"related_words":{"derivatives":["chrysoprase (a more common synonym)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chrysopal' is a relatively uncommon term primarily used in gemology or jewelry contexts to refer to a green variety of chalcedony known as chrysoprase. Understanding requires familiarity with gemstone terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The artisan carefully polished the chrysopal to reveal its vibrant color.","translation":"職人はクリソプレーズの鮮やかな色を出すために注意深く磨いた。","type":"noun","meaning_category":"gemstone"},{"sentence":"Many believed that wearing chrysopal brought good luck and prosperity.","translation":"多くの人がクリソプレーズを身に着けることは幸運と繁栄をもたらすと信じていた。","type":"noun","meaning_category":"gemstone"}]}