{"word":"perpetuable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"永続させることができる、永続可能な","english_definition":"Capable of being perpetuated; able to be continued indefinitely.","examples":[{"sentence":"This myth is perpetuable because it serves a political purpose.","translation":"この神話は政治的な目的を果たすため、永続させることができる。"},{"sentence":"The system is perpetuable as long as there is sufficient funding.","translation":"十分な資金がある限り、そのシステムは永続可能である。"}],"collocations":["perpetuable system","perpetuable myth","perpetuable cycle"],"synonyms":["maintainable","sustainable","renewable","continuable"],"antonyms":["temporary","transient","ephemeral","finite"]}],"etymology":{"value":"From the verb 'perpetuate' + '-able'. 'Perpetuate' comes from Latin 'perpetuare' meaning 'to continue without interruption'.","priority":"★★★"},"pronunciation":{"ipa":"/pərˈpetʃuəbəl/","syllables":"per-pet-u-a-ble"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more perpetuable' and 'most perpetuable' respectively."},"usage_notes":{"explanation":"'Perpetuable' describes something that has the capacity to be continued or maintained indefinitely. It is often used in the context of systems, ideas, or myths that can be sustained over time. It implies a degree of inherent stability or the presence of conditions that allow for ongoing continuation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The perpetuable of the tradition is important.","correct":"✓ The perpetuation of the tradition is important.","note":"'Perpetuable' is an adjective; the noun form is 'perpetuation'."},{"incorrect":"✗ The perpetuable energy source.","correct":"✓ The renewable energy source.","note":"While 'perpetuable' means capable of being perpetuated, 'renewable' is more commonly used to describe energy sources that can be replenished."}],"priority":"★★☆"},"related_words":{"derivatives":["perpetuate (verb): to make (something, typically an undesirable situation or an unfounded belief) continue indefinitely.","perpetuation (noun): the act of causing something to continue.","perpetuity (noun): the state or quality of lasting forever.","perpetual (adjective): never ending or changing."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Perpetuable' is a relatively uncommon word that means something can be continued indefinitely. It's used to describe systems, ideas, or myths that have the ability to last for a very long time. Because it is not a common word, it is more likely to be encountered in academic or technical contexts. It is formed from the verb 'perpetuate', which means to cause something to continue, and the suffix '-able', which means capable of being done."},"example_sentences":[{"sentence":"The perpetuable nature of the rumor made it difficult to dispel.","translation":"その噂が永続する性質を持っていたため、払拭するのが困難だった。","type":"adjective","meaning_category":"永続可能な"},{"sentence":"A perpetuable business model is essential for long-term success.","translation":"長期的な成功のためには、永続可能なビジネスモデルが不可欠である。","type":"adjective","meaning_category":"永続可能な"},{"sentence":"The perpetuable cycle of poverty can be difficult to break.","translation":"貧困の永続的なサイクルを断ち切ることは難しい。","type":"adjective","meaning_category":"永続可能な"}]}