{"word":"un-Marxist","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非マルクス主義的な、マルクス主義に反する","english_definition":"Not adhering to or consistent with the principles of Marxism.","examples":[{"sentence":"His economic policies were criticized as un-Marxist.","translation":"彼の経済政策は非マルクス主義的だと批判された。"},{"sentence":"The party's shift towards individualism was seen as un-Marxist by some members.","translation":"党の個人主義への移行は、一部のメンバーによって非マルクス主義的だと見なされた。"}],"collocations":["un-Marxist policies","un-Marxist ideology","un-Marxist approach"],"synonyms":["anti-Marxist","non-Marxist"],"antonyms":["Marxist"]}],"etymology":{"value":"Prefix 'un-' (not) + 'Marxist' (relating to the ideas of Karl Marx).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈmɑːksɪst/","syllables":"un-Marx-ist"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Un-Marxist' is used to describe something that deviates from or contradicts the core tenets of Marxism, such as class struggle, historical materialism, and the abolition of private property. It often implies a rejection or modification of Marxist principles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is unmarxist.","correct":"✓ He is an un-Marxist.","note":"When referring to a person, it's better to use 'an un-Marxist' to clearly indicate they do not adhere to Marxist principles, rather than describing their inherent nature."}],"priority":"★★☆"},"related_words":{"derivatives":["un-Marxistically"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'un-Marxist' is a complex term used in political and academic discourse. It requires an understanding of Marxism to fully grasp its meaning. It is used to describe ideas, policies, or actions that are contrary to or diverge from Marxist principles. Due to its specialized nature, it is typically encountered in advanced texts and discussions related to political theory and economics."},"example_sentences":[{"sentence":"The government's privatization efforts were seen as fundamentally un-Marxist.","translation":"政府の民営化の取り組みは、根本的に非マルクス主義的だと見なされた。","type":"adjective","meaning_category":"Political Ideology"},{"sentence":"Some argue that social democracy is an un-Marxist adaptation of socialist ideals.","translation":"社会民主主義は、社会主義の理想の非マルクス主義的な適応であると主張する人もいる。","type":"adjective","meaning_category":"Political Theory"}]}