{"word":"elytrocele","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"鞘瘤（しょうりゅう）: 特に膣後壁のヘルニアで、膣と直腸の間に腸または腹腔内の他の組織が脱出するもの。","english_definition":"A hernia of the vagina, especially a posterior vaginal hernia in which the pouch of Douglas, containing intestine or other abdominal contents, protrudes between the vagina and the rectum.","examples":[{"sentence":"The patient was diagnosed with an elytrocele after experiencing pelvic pressure.","translation":"患者は骨盤の圧迫感を感じた後、鞘瘤と診断された。"},{"sentence":"Surgical intervention is often required to correct an elytrocele.","translation":"鞘瘤を矯正するためには、外科的介入が必要となることが多い。"}],"collocations":["vaginal elytrocele","posterior elytrocele","repair of elytrocele"],"synonyms":["vaginal hernia","posterior vaginal hernia"],"antonyms":[]}],"etymology":{"value":"The term 'elytrocele' comes from the Greek words 'elytron' (sheath) and 'kele' (hernia).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈlɪtroʊˌsiːl/","syllables":"e-ly-tro-cele"},"inflection":{"noun_plural":"elytroceles"},"usage_notes":{"explanation":"An elytrocele is a specific type of vaginal hernia where the pouch of Douglas (a space in the pelvic cavity) protrudes into the vagina. It's more common in women who have had multiple pregnancies or who have weakened pelvic floor muscles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said I have a cystocele, which is the same as elytrocele.","correct":"✓ The doctor said I have a cystocele, which is different from elytrocele.","note":"Cystocele (bladder prolapse) and elytrocele (hernia of the pouch of Douglas) are different types of pelvic organ prolapse."}],"priority":"★★☆"},"related_words":{"derivatives":["cystocele","rectocele","enterocele"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Elytrocele' is a medical term referring to a specific type of vaginal hernia. It is not commonly used outside of medical contexts. Understanding requires knowledge of anatomy and medical terminology related to pelvic organ prolapse."},"example_sentences":[{"sentence":"The gynecologist explained the elytrocele and the treatment options.","translation":"婦人科医は鞘瘤と治療の選択肢について説明した。","type":"medical","meaning_category":"vaginal hernia"},{"sentence":"Pelvic floor exercises can help manage the symptoms of a mild elytrocele.","translation":"骨盤底筋運動は、軽度の鞘瘤の症状を管理するのに役立つ。","type":"medical","meaning_category":"vaginal hernia"}]}