{"word":"Deracination","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"根絶、追放、民族的・文化的アイデンティティの喪失","english_definition":"the act of uprooting or displacing someone or something; eradication; alienation; the state of being uprooted from one's environment or culture.","examples":[{"sentence":"The deracination of indigenous populations from their ancestral lands has had devastating consequences.","translation":"先住民が祖先伝来の土地から根絶やしにされたことは、壊滅的な結果をもたらした。"},{"sentence":"Urbanization can lead to the deracination of rural communities.","translation":"都市化は農村コミュニティの根絶につながる可能性がある。"},{"sentence":"The author explores the theme of deracination in his novel, focusing on the protagonist's struggle to find belonging after being forced to leave his homeland.","translation":"著者は小説の中で、故郷を離れることを余儀なくされた主人公が帰属意識を見つけようと苦闘する姿を描き、根絶というテーマを探求している。"}],"collocations":["cultural deracination (文化的根絶)","social deracination (社会的根絶)","political deracination (政治的根絶)","experience deracination (根絶を経験する)","suffer deracination (根絶に苦しむ)","cause deracination (根絶を引き起こす)","prevent deracination (根絶を防ぐ)"],"synonyms":["uprooting","displacement","alienation","eradication","exile","dislocation","rootlessness","estrangement"],"antonyms":["establishment","integration","assimilation","rootedness","belonging","connection","affiliation"]}],"etymology":{"value":"From French *déracinement*, from *déraciner* 'to uproot', from *dé-* (from Latin *dis-* expressing reversal) + *racine* 'root' (from Latin *radix, radicis* 'root').","priority":"★★☆"},"pronunciation":{"ipa":"/diːˌræsɪˈneɪʃən/","syllables":"de-ras-i-na-tion"},"inflection":{"noun_plural":"deracinations"},"usage_notes":{"explanation":"*Deracination* refers to the act of displacing or uprooting something, often with negative consequences. It can describe the physical removal of people from their homes or lands, or the more abstract loss of cultural or social identity. The term often implies a sense of alienation and loss of belonging. It is frequently used in discussions of colonialism, migration, and social change.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The deracination caused a lot of happy.","correct":"✓ The deracination caused a lot of unhappiness.","note":"*Deracination* typically results in negative emotions or consequences, so it is usually associated with words like *unhappiness*, *suffering*, or *loss* rather than *happy* or *joy*."},{"incorrect":"✗ The deracination of the tree was easy.","correct":"✓ The uprooting of the tree was easy.","note":"While *deracination* can refer to the physical act of uprooting, it is more commonly used in a social or cultural context. For the physical act of uprooting a plant, *uprooting* is a more common and natural choice."}],"priority":"★★☆"},"related_words":{"derivatives":["deracinate (verb)","deracinated (adjective)"],"cross_references":["root (noun)","uproot (verb)","displace (verb)","alienate (verb)","eradicate (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. The word is relatively rare and mainly used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"*Deracination* is a relatively uncommon word that refers to the act of uprooting or displacing someone or something, often in a cultural or social sense. It implies a loss of connection to one's roots, culture, or environment. The word is often used in academic or political discussions about the impact of colonialism, migration, or social change on individuals or communities. Understanding the word requires a good vocabulary and an awareness of the social and political contexts in which it is typically used.","priority":"★☆☆"},"example_sentences":[{"sentence":"The forced deracination of the population led to widespread social unrest.","translation":"強制的な住民の根絶は、広範囲にわたる社会不安を引き起こした。","type":"general","meaning_category":"uprooting/displacement"},{"sentence":"Colonialism often resulted in the cultural deracination of colonized peoples.","translation":"植民地主義はしばしば、被植民地の人々の文化的根絶をもたらした。","type":"cultural","meaning_category":"loss of cultural identity"},{"sentence":"The rapid pace of globalization can contribute to a sense of deracination among those who feel disconnected from their local communities.","translation":"グローバル化の急速な進展は、地域社会とのつながりを感じられない人々の間で、根絶感を助長する可能性がある。","type":"social","meaning_category":"alienation"},{"sentence":"The novel explores the psychological effects of deracination on immigrants.","translation":"その小説は、移民に対する根絶の心理的影響を探求している。","type":"psychological","meaning_category":"loss of belonging"}]}