{"word":"air-lanced","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(土壌改良などで)エアランス処理する、圧縮空気を使って土壌をほぐす","english_definition":"To treat (soil) with an air lance, using compressed air to loosen and aerate it.","examples":[{"sentence":"The tree roots were carefully air-lanced to improve soil drainage.","translation":"土壌の排水を改善するために、木の根は注意深くエアランス処理された。"},{"sentence":"We air-lanced the compacted soil around the foundation to prevent water damage.","translation":"水の損傷を防ぐために、基礎周辺の固まった土壌をエアランス処理しました。"}],"collocations":["air-lance soil","air-lance tree roots","air-lance compacted soil"],"synonyms":["soil aeration","soil fracturing"],"antonyms":[]}],"etymology":{"value":"A combination of 'air' (referring to compressed air) and 'lance' (referring to the tool used to deliver the air).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛərˌlænst/","syllables":"air-lanced"},"inflection":{"verb_forms":{"present_simple":["air-lance","air-lances"],"past_simple":"air-lanced","past_participle":"air-lanced","present_participle":"air-lancing"}},"usage_notes":{"explanation":"'Air-lanced' is a relatively specialized term used in landscaping, arboriculture, and construction. It refers to a technique where compressed air is injected into the soil to break it up, improve drainage, and promote root growth. It's often used around trees and foundations where traditional digging methods could cause damage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gardener air-lanced the plant.","correct":"✓ The gardener air-lanced the soil around the plant.","note":"Air-lancing is typically applied to the soil, not directly to the plant."}],"priority":"★☆☆"},"related_words":{"derivatives":["air lance (noun: エアランス)","air-lancing (noun: エアランス処理)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Air-lanced' is a technical term related to soil treatment. It involves using a tool called an air lance to inject compressed air into the soil. This process helps to break up compacted soil, improve aeration, and facilitate root growth. It is commonly used in situations where traditional digging methods are not suitable, such as around tree roots or building foundations. Understanding this term requires some knowledge of landscaping or construction practices."},"example_sentences":[{"sentence":"The construction crew air-lanced the area before pouring the concrete.","translation":"建設作業員はコンクリートを流し込む前にその地域をエアランス処理した。","type":"verb","meaning_category":"土壌改良"},{"sentence":"Air-lanced soil allows for better water absorption.","translation":"エアランス処理された土壌は、より良い水の吸収を可能にする。","type":"adjective (participle)","meaning_category":"土壌改良"}]}