{"word":"champertous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(法律)シャンパーティー契約の、訴訟買取りの","english_definition":"(law) relating to or involving champerty, an illegal agreement in which a person with no prior interest in a lawsuit finances it with the understanding that they will receive a portion of any damages awarded.","examples":[{"sentence":"The agreement was deemed champertous and therefore unenforceable.","translation":"その合意はシャンパーティー契約とみなされ、したがって法的強制力がないとされた。"},{"sentence":"The lawyer was accused of engaging in champertous activities.","translation":"その弁護士は訴訟買い取り行為に関与していると非難された。"}],"collocations":["champertous agreement","champertous contract","champertous activities"],"synonyms":["barratrous","maintenance"],"antonyms":[]}],"etymology":{"value":"Derived from the noun 'champerty,' which comes from the Old French 'champert,' meaning 'field share.' This refers to the original practice where the champertor would receive a share of the land (field) won in the lawsuit.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃæmpərtəs/","syllables":"cham-per-tous"},"inflection":{"notes":"This word does not have common inflections as it is primarily an adjective."},"usage_notes":{"explanation":"The term 'champertous' is highly specific to legal contexts. It describes something related to or characterized by champerty, which is an illegal agreement to finance a lawsuit in return for a portion of the damages awarded. This practice is generally prohibited to prevent frivolous lawsuits and conflicts of interest.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The friendly agreement was champertous.","correct":"✓ The agreement was deemed champertous because it involved financing a lawsuit for a share of the proceeds.","note":"'Champertous' implies an illegal agreement, not just any friendly agreement."}],"priority":"★★☆"},"related_words":{"derivatives":["champerty (noun): the illegal agreement of financing a lawsuit in return for a portion of the damages awarded.","champertor (noun): a person who engages in champerty."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - primarily used in legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Champertous' is a specialized legal term describing agreements characterized by champerty. Understanding this word requires familiarity with legal concepts and vocabulary. It is rarely used outside of legal discussions and documents."},"example_sentences":[{"sentence":"The judge ruled the contract was champertous and therefore void.","translation":"裁判官はその契約はシャンパーティー契約であり、したがって無効であると判決を下した。","type":"adjective","meaning_category":"(法律)シャンパーティー契約の"},{"sentence":"His involvement in the case was considered champertous because he stood to gain a percentage of the settlement.","translation":"彼の事件への関与は、和解金の一部を得る立場にあったため、訴訟買い取りとみなされた。","type":"adjective","meaning_category":"(法律)訴訟買取りの"}]}