{"word":"Cyprid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(動物) カイアシ類の幼生の一種","english_definition":"A larva of certain crustaceans, especially barnacles, following the nauplius stage, having a bivalved carapace and six pairs of thoracic appendages.","examples":[{"sentence":"The cyprid larva is the final larval stage of barnacles before they settle and metamorphose into adults.","translation":"キプリス幼生は、フジツボが定着して成体に変態する前の最終幼生段階です。"}],"collocations":["cyprid larva","cyprid stage"],"synonyms":["cypris","barnacle larva"],"antonyms":[]}],"etymology":{"value":"Derived from *Cypris*, an obsolete genus name for ostracods (seed shrimp), which in turn comes from *Cypris*, the Greek name for Aphrodite, the goddess of love and beauty, alluding to the creature's perceived beauty or association with water.","priority":"★★☆"},"pronunciation":{"ipa":"ˈsɪprɪd","syllables":"Cy-prid"},"inflection":{"noun_plural":"cyprids"},"usage_notes":{"explanation":"The term *cyprid* refers specifically to a larval stage in the development of certain crustaceans, particularly barnacles and ostracods. It is characterized by a bivalved shell and is the stage at which the larva seeks a suitable substrate to settle on and metamorphose into its adult form.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["cypridiform (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term *cyprid* is a technical term used in zoology, specifically in the study of crustaceans. It refers to a particular larval stage in the development of certain species. Understanding this term requires a background in biology or zoology.","priority":"★★☆"},"example_sentences":[{"sentence":"The settlement of **cyprid** larvae is a crucial step in the life cycle of barnacles.","translation":"キプリス幼生の定着は、フジツボのライフサイクルにおける重要なステップです。","type":"noun","meaning_category":"animal larva"}]}