{"word":"blasty","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(informal) Characterized by or resembling a blast; explosive or forceful.","english_definition":"(informal) Resembling or characterized by a blast; explosive or forceful in nature.","examples":[{"sentence":"The blasty winds made it difficult to walk.","translation":"突風が吹いて歩くのが困難だった。"},{"sentence":"He had a blasty personality, always full of energy.","translation":"彼はいつもエネルギッシュで、爆発的な性格だった。"}],"collocations":["blasty winds","blasty personality"],"synonyms":["explosive","forceful","gusty","turbulent"],"antonyms":["calm","gentle","mild"]}],"etymology":{"value":"Likely derived from 'blast' (an explosion or a strong rush of air) with the addition of the adjective suffix '-y'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈblæsti/","syllables":"blas-ty"},"inflection":{"adjective_forms":{"comparative":"blastier","superlative":"blastiest"}},"usage_notes":{"explanation":"'Blasty' is an informal adjective, typically used to describe something that is characterized by strong gusts or explosions, or something that resembles a blast in its forceful nature. It's not a commonly used word and may be considered colloquial.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The weather was blasty and sunny.","correct":"✓ The weather was blasty and cold.","note":"'Blasty' usually implies turbulent or forceful conditions, which are less compatible with sunny weather. Cold or windy conditions are more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["blast (noun/verb)","blasting (adjective/gerund)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Uncommon word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Blasty' is an informal and uncommon adjective used to describe something that is explosive, forceful, or characterized by strong gusts. It is derived from the word 'blast' and is not typically used in formal contexts. Due to its informality and low frequency, it is more likely to be encountered in casual conversation or descriptive writing rather than academic or professional settings."},"example_sentences":[{"sentence":"The mountain pass was treacherous due to the blasty conditions.","translation":"その峠は、突風が吹く危険な状況のため、危険だった。","type":"adjective","meaning_category":"forceful"},{"sentence":"The blasty rain made it difficult to see while driving.","translation":"激しい雨のため、運転中に視界が悪くなった。","type":"adjective","meaning_category":"turbulent"}]}