{"word":"greatsword","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な)両手剣、グレートソード","english_definition":"A large two-handed sword, typically used in the late medieval and Renaissance periods.","examples":[{"sentence":"The knight wielded a greatsword with ease.","translation":"騎士はグレートソードを容易に操った。"},{"sentence":"Greatswords were often used by infantry to break through pike formations.","translation":"グレートソードはしばしば歩兵が槍衾を突破するために用いられた。"}],"collocations":["wield a greatsword (グレートソードを振るう)","a two-handed greatsword (両手持ちのグレートソード)","historical greatsword (歴史的なグレートソード)"],"synonyms":["zweihänder","claymore (スコットランドのグレートソード)"],"antonyms":[],"notes":"Greatswords are characterized by their size, requiring two hands to wield effectively. They were popular in Europe, particularly in Germany and Scotland. The German 'Zweihänder' and the Scottish 'Claymore' are well-known examples."}],"etymology":{"value":"From 'great' + 'sword'. The term reflects the sword's large size compared to other swords of the time.","priority":"★★★"},"pronunciation":{"ipa":"ˈɡreɪtˌsɔːrd/","syllables":"great-sword"},"inflection":{"noun_plural":"greatswords"},"usage_notes":{"explanation":"The term 'greatsword' generally refers to a large, two-handed sword used historically. It is often associated with medieval and Renaissance warfare. Although the term is sometimes used generically for any large sword, it specifically implies a sword designed for two-handed use, offering greater reach and power at the cost of maneuverability.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used greatsword with one hand.","correct":"✓ He used the greatsword with two hands.","note":"Greatswords are designed to be used with two hands due to their size and weight."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["longsword (片手または両手で使用できる剣)","broadsword (幅広の剣)","claymore (スコットランドのグレートソード)","zweihänder (ドイツのグレートソード)"],"priority":"★★★"},"level_frequency":{"CEFR":"Not typically included in CEFR vocabulary lists.","frequency_google_ngram":"Relatively low frequency, primarily used in historical or fantasy contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Greatsword' is a specialized term referring to a specific type of large, two-handed sword used historically. Understanding its usage requires familiarity with medieval and Renaissance weaponry. The word is most commonly encountered in historical fiction, fantasy literature, or discussions of historical martial arts. It is not part of everyday vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum displayed a collection of medieval weapons, including a massive greatsword.","translation":"博物館には、巨大なグレートソードを含む中世の武器のコレクションが展示されていた。","type":"example","meaning_category":"historical weaponry"},{"sentence":"In fantasy novels, heroes often wield greatswords in epic battles.","translation":"ファンタジー小説では、英雄はしばしば壮大な戦いでグレートソードを振るう。","type":"example","meaning_category":"fantasy literature"},{"sentence":"The size of the greatsword made it difficult to maneuver in close quarters.","translation":"グレートソードの大きさは、狭い場所での操作を困難にした。","type":"example","meaning_category":"characteristics"}]}