{"word":"diapyetic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(地質学) 貫入的な; 貫入作用によって形成された","english_definition":"(geology) characterized by or relating to diapirism; intrusive.","examples":[{"sentence":"The diapyetic structures are evident in the seismic data.","translation":"その貫入構造は地震データで明らかである。"},{"sentence":"Diapyetic processes can significantly alter the surrounding rock formations.","translation":"貫入作用は周囲の岩石構造を大きく変える可能性がある。"}],"collocations":["diapyetic structure","diapyetic process","diapyetic intrusion"],"synonyms":["intrusive"],"antonyms":["extrusive"]}],"etymology":{"value":"Derived from 'diapir', which comes from the Greek 'dia' (through) and 'peirein' (to pierce).","priority":"★★★"},"pronunciation":{"ipa":"/ˌdaɪəpaɪˈɛtɪk/","syllables":"di-a-py-et-ic"},"inflection":{"notes":"Adjective, no specific inflections beyond comparative/superlative forms (more diapyetic, most diapyetic)."},"usage_notes":{"explanation":"'Diapyetic' is a geological term primarily used to describe structures or processes related to diapirs. Diapirs are geological structures formed when a more mobile and ductile material (like salt or shale) intrudes into overlying, denser rocks. The term is relatively specialized and not commonly used outside of geological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The diapyetic feeling of the landscape was overwhelming.","correct":"✓ The rugged feeling of the landscape was overwhelming.","note":"'Diapyetic' specifically refers to geological processes and structures; it is not used to describe general feelings or landscapes in a non-technical sense."}],"priority":"★★☆"},"related_words":{"derivatives":["diapir (noun)","diapirism (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - specialized geological term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Diapyetic' is a highly specialized geological term. It describes features or processes associated with diapirs, which are intrusions of mobile rock (like salt or shale) into surrounding denser rock layers. Understanding this term requires a solid background in geology. It is not used in general language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The geologist identified several diapyetic features in the region.","translation":"地質学者はその地域でいくつかの貫入的な特徴を特定した。","type":"adjective","meaning_category":"Geological"},{"sentence":"The diapyetic salt structures have created significant hydrocarbon traps.","translation":"貫入作用によって形成された塩構造は、重要な炭化水素トラップを形成している。","type":"adjective","meaning_category":"Geological"}]}