{"word":"coderived","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(主に情報科学で)コードから派生した、コードによって生成された","english_definition":"(chiefly in information science) derived or generated from code.","examples":[{"sentence":"The coderived documentation was automatically created from the source code.","translation":"コードから派生したドキュメントは、ソースコードから自動的に作成されました。"},{"sentence":"These coderived classes inherit properties from the base class defined in the core library.","translation":"これらのコード派生クラスは、コアライブラリで定義された基底クラスからプロパティを継承します。"},{"sentence":"The coderived data structures are optimized for fast access and manipulation.","translation":"コードから生成されたデータ構造は、高速なアクセスと操作のために最適化されています。"}],"collocations":["coderived documentation","coderived classes","coderived data","coderived data structures","coderived functions","coderived methods","coderived variables","coderived code"],"synonyms":["generated","derived","synthesized","programmatically generated"],"antonyms":["handwritten","manual","original","source"],"notes":"主に技術的な文脈で使用されます。"}],"etymology":{"value":"\"code\" + \"derived\".  Indicates something that originates from or is produced by computer code.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊdiˈraɪvd/","syllables":"co-de-ri-ved"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"**coderived**\" is a technical term primarily used in computer science and software engineering. It describes something that is not created manually but is instead automatically generated or derived from existing code. This is often used to describe documentation, classes, data structures, or other artifacts that are produced by tools or scripts that process source code. It emphasizes the automated nature of the creation process and the direct link to the underlying code.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The coderived painting was beautiful.","correct":"✓ The digitally-generated painting was beautiful.","note":"\"coderived\" はコードから生成されたものにのみ使用します。絵画のような芸術作品には適していません。"},{"incorrect":"✗ He used coderived to write the program.","correct":"✓ He used code to write the program.","note":"\"coderived\" は名詞として使用できません。コードから派生した何かを説明する形容詞として使用します。"}],"priority":"★☆☆"},"related_words":{"derivatives":["code","derive","derivation","codegen (code generation)"],"related_terms":["generated code","derived data","source code","programmatically generated","automatically generated"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"**coderived**\" is a specialized term used in computer science and software development. It signifies that something, such as documentation or a data structure, has been automatically created or generated from computer code, rather than being manually written or designed. This term is most often encountered in technical documentation, API descriptions, and discussions about automated software development processes. Understanding this term requires familiarity with programming concepts and software engineering practices."},"example_sentences":[{"sentence":"The **coderived** API documentation ensures consistency with the latest code changes.","translation":"コードから生成されたAPIドキュメントは、最新のコード変更との一貫性を保証します。","type":"adjective","meaning_category":"コードから派生した (ドキュメント)"},{"sentence":"The compiler automatically generates **coderived** helper functions to simplify memory management.","translation":"コンパイラは、メモリ管理を簡素化するために、コードから生成されたヘルパー関数を自動的に生成します。","type":"adjective","meaning_category":"コードから派生した (関数)"},{"sentence":"These **coderived** configuration files are updated every time the application is rebuilt.","translation":"これらのコードから生成された構成ファイルは、アプリケーションがリビルドされるたびに更新されます。","type":"adjective","meaning_category":"コードから派生した (構成ファイル)"}]}