{"word":"redsear","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"(金属が)熱間脆性を示す、赤熱脆性を示す","english_definition":"To become brittle when heated to a red heat.","examples":[{"sentence":"This type of steel is known to redsear if worked at too high a temperature.","translation":"このタイプの鋼は、高温で加工すると赤熱脆性を示すことが知られています。"}],"collocations":["steel redsears","iron redsears"],"synonyms":["become hot-short"],"antonyms":[]}],"etymology":{"value":"From 'red' (referring to the color of the metal at high temperature) + 'sear' (meaning to dry up or wither, implying brittleness).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛdˌsɪər/","syllables":"red-sear"},"inflection":{"verb_forms":{"present_simple":["redsear","redsears"],"past_simple":"redseared","past_participle":"redseared","present_participle":"redsearing"}},"usage_notes":{"explanation":"\"Redsear\" is a technical term used in metallurgy to describe the phenomenon where a metal becomes brittle and unworkable when heated to a red heat. It is usually due to the presence of impurities in the metal. The term is relatively uncommon in general usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metal redseared because it was too cold.","correct":"✓ The metal redseared because it was too hot.","note":"Redsearing occurs at high temperatures, not low temperatures."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["hot-shortness","brittleness","metallurgy"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Redsear\" is a specialized term used in the field of metallurgy. It describes the property of a metal becoming brittle when heated to a high temperature (red heat). Understanding this term requires knowledge of materials science and metalworking processes. It is not commonly used outside of technical contexts."},"example_sentences":[{"sentence":"The blacksmith knew that this particular iron would redsear easily, so he had to work it carefully.","translation":"鍛冶屋はその特定の鉄が赤熱脆性を示しやすいことを知っていたので、慎重に加工する必要がありました。","type":"verb (vi)","meaning_category":"赤熱脆性を示す"}]}