{"word":"extra-junctional","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(解剖学, 生理学) 接合部外の、接合部から離れた","english_definition":"(anatomy, physiology) Situated or occurring outside of a junction, especially a neuromuscular junction.","examples":[{"sentence":"Extra-junctional acetylcholine receptors are found on muscle cells after denervation.","translation":"接合部外アセチルコリン受容体は、脱神経後の筋細胞に見られる。"},{"sentence":"The study investigated the properties of extra-junctional membrane in skeletal muscle.","translation":"その研究では、骨格筋における接合部外膜の特性が調査された。"}],"collocations":["extra-junctional receptors","extra-junctional membrane","extra-junctional region"],"synonyms":["non-junctional","perijunctional"],"antonyms":["junctional","synaptic"]},{"part_of_speech":"adjective","definition":"(細胞生物学) 細胞接合部外の","english_definition":"(cell biology) Located outside of or not directly involved in a cell junction.","examples":[{"sentence":"The protein was found to be associated with the cytoskeleton in the extra-junctional regions of the cell.","translation":"そのタンパク質は、細胞の接合部外領域の細胞骨格に関連していることが判明した。"}],"collocations":["extra-junctional protein","extra-junctional cytoskeleton"],"synonyms":[],"antonyms":["junctional"]}],"etymology":{"value":"Derived from 'extra-' (outside) and 'junctional' (relating to a junction).","priority":"Medium"},"pronunciation":{"ipa":"/ˌekstrədʒʌŋkʃənəl/","syllables":"ex-tra-junc-tion-al"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparative and superlative forms, which are not commonly used for this word."},"usage_notes":{"explanation":"The term 'extra-junctional' is primarily used in scientific contexts, particularly in anatomy, physiology, and cell biology, to describe structures or processes that are located or occur outside of a specific junction. In neuromuscular physiology, it refers to areas of the muscle cell membrane that are not part of the neuromuscular junction. In cell biology, it may refer to regions of the cell membrane that are not directly involved in cell-cell junctions.","priority":"Medium"},"common_mistakes":{"examples":[],"priority":"Low"},"related_words":{"derivatives":["junction (noun)","junctional (adjective)","extra- (prefix)"],"phrasal_verbs":[],"related_terms":["neuromuscular junction","cell junction","synapse"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"The term 'extra-junctional' is highly specialized and primarily used in advanced scientific and medical contexts. Understanding requires knowledge of anatomy, physiology, or cell biology, specifically the concept of junctions (e.g., neuromuscular junctions or cell-cell junctions). The prefix 'extra-' indicates 'outside of,' so the term describes something located or occurring outside of a junction. Due to its specialized nature, it is unlikely to be encountered outside of scientific literature or discussions."},"example_sentences":[{"sentence":"The distribution of extra-junctional sodium channels contributes to the excitability of denervated muscle fibers.","translation":"接合部外ナトリウムチャネルの分布は、脱神経された筋線維の興奮性に寄与する。","type":"adjective","meaning_category":"接合部外の"},{"sentence":"Researchers are studying the role of extra-junctional proteins in cell migration.","translation":"研究者たちは、細胞遊走における接合部外タンパク質の役割を研究している。","type":"adjective","meaning_category":"接合部外の"}]}