{"word":"Agitationist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"扇動者、煽動家","english_definition":"A person who tries to stir up public feeling about a controversial issue, especially for political purposes.","examples":[{"sentence":"He was labeled an agitationist for his inflammatory speeches.","translation":"彼は扇動的な演説をしたため、扇動者というレッテルを貼られた。"},{"sentence":"The government accused the labor leader of being an agitationist.","translation":"政府は労働組合のリーダーを扇動者だと非難した。"}],"collocations":["political agitationist","labor agitationist","radical agitationist"],"synonyms":["agitator","demagogue","rabble-rouser","incendiary","provocateur"],"antonyms":["peacemaker","conciliator","mediator"]}],"etymology":{"value":"'Agitationist' derives from 'agitation', which comes from the Latin 'agitatio', meaning 'a stirring up, disturbance'. The suffix '-ist' indicates a person who practices or is concerned with something. Therefore, an agitationist is someone who engages in or promotes agitation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌædʒɪˈteɪʃənɪst/","syllables":"a-gi-ta-tion-ist"},"inflection":{"noun_plural":"agitationists"},"usage_notes":{"explanation":"'Agitationist' is typically used in a political or social context to describe someone who actively promotes unrest or change through public speaking, writing, or other forms of communication. The term often carries a negative connotation, implying that the person is causing trouble or inciting violence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an agitation.","correct":"✓ He is an agitationist.","note":"'Agitation' is a noun referring to the act of stirring up public feeling, while 'agitationist' is a noun referring to the person who does it."},{"incorrect":"✗ She was accused of agitationism.","correct":"✓ She was accused of being an agitationist.","note":"'Agitationism' is a less common term referring to the practice or advocacy of agitation. It's more common to say someone is an 'agitationist'."}],"priority":"★☆☆"},"related_words":{"derivatives":["agitation (noun)","agitate (verb)","agitational (adjective)"],"phrases":["stir up trouble","incite unrest"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'agitationist' refers to someone who tries to create public excitement or anger about a political or social issue. It's not a very common word, and it's often used in a negative way to describe someone who is seen as causing trouble or stirring up conflict. You're more likely to encounter this word in news articles or academic texts about politics or social movements."},"example_sentences":[{"sentence":"The speaker was denounced as an agitationist for his divisive rhetoric.","translation":"その演説者は、分裂を招くようなレトリックを使ったため、扇動者として非難された。","type":"example"},{"sentence":"The newspaper described the activist as a dangerous agitationist.","translation":"その新聞は、その活動家を危険な扇動者だと報じた。","type":"example"}]}