{"word":"by-election","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"補欠選挙","english_definition":"an election held to fill a political office that has become vacant between regularly scheduled elections.","examples":[{"sentence":"A by-election was called after the resignation of the MP.","translation":"その国会議員の辞任後、補欠選挙が実施された。"},{"sentence":"The by-election result was a surprise victory for the Green Party.","translation":"その補欠選挙の結果は、緑の党にとって予想外の勝利だった。"},{"sentence":"Voter turnout was low in the recent by-election.","translation":"最近の補欠選挙では投票率が低かった。"}],"collocations":["call a by-election (補欠選挙を執行する)","win a by-election (補欠選挙で勝利する)","lose a by-election (補欠選挙で敗北する)","contest a by-election (補欠選挙に立候補する)","a snap by-election (急な補欠選挙)"],"synonyms":["special election"],"antonyms":["general election (総選挙)"],"related_terms":["candidate","constituency","electorate","polling station","vote","ballot"],"usage_notes":"By-elections are held when a seat in a legislative body becomes vacant due to death, resignation, or other reasons. They are often seen as a barometer of public opinion between general elections.","level_frequency":"C1","readability_explanation":"The term 'by-election' refers to a specific type of election that occurs outside the normal schedule. It's used when a representative's seat becomes vacant unexpectedly. Understanding this term is important for following political news and discussions.","example_sentences":[{"sentence":"The ruling party is facing a tough challenge in the upcoming by-election.","translation":"与党は次の補欠選挙で厳しい戦いに直面している。","type":"general"},{"sentence":"The candidate focused on local issues during the by-election campaign.","translation":"候補者は補欠選挙のキャンペーン中、地域の問題に焦点を当てた。","type":"general"}]}],"etymology":{"value":"'By-' in this context means 'secondary' or 'subsidiary'. The term indicates an election that is held outside of the regular, scheduled elections.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbaɪ ɪˌlekʃən/","syllables":"by-e-lec-tion"},"inflection":{"noun_plural":"by-elections"},"common_mistakes":{"examples":[{"incorrect":"The by-election will be held next year.","correct":"The by-election will be held next month.","note":"By-elections are held to fill unexpected vacancies, so they are not usually scheduled far in advance."}],"priority":"★★☆"}}