{"word":"esguince","priority":"★★☆","meanings":[{"part_of_speech":"noun","gender":"masculine","definition":"捻挫","english_definition":"sprain","examples":[{"sentence":"Me hice un esguince en el tobillo jugando al fútbol.","translation":"I sprained my ankle playing soccer."},{"sentence":"El médico me dijo que tenía un esguince leve.","translation":"The doctor told me I had a mild sprain."}],"collocations":["esguince de tobillo (ankle sprain)","esguince de muñeca (wrist sprain)","esguince cervical (whiplash)","sufrir un esguince (to suffer a sprain)","tener un esguince (to have a sprain)"],"synonyms":["torcedura","distensión"],"antonyms":[]}],"etymology":{"value":"The origin of the word \"esguince\" is uncertain, but it likely comes from a Vulgar Latin root. Some theories suggest a connection to words related to twisting or distortion.","priority":"★★★"},"pronunciation":{"ipa":"/esˈɣwinθe/ (Spain), /esˈɣwinse/ (Latin America)","syllables":"es-guin-ce"},"inflection":{"noun_plural":"esguinces"},"usage_notes":{"explanation":"The word \"esguince\" refers specifically to a sprain, which is an injury to ligaments. It is important to distinguish it from other types of injuries, such as fractures (fracturas) or dislocations (luxaciones).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Me rompí un esguince.","correct":"Me hice un esguince.","note":"The correct verb to use with \"esguince\" is \"hacerse\" (to get/suffer) rather than \"romperse\" (to break)."},{"incorrect":"Tengo un dolor en mi esguince.","correct":"Tengo dolor en el esguince.","note":"The possessive pronoun is unnecessary. Use the definite article \"el\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":["esguinzarse (verb - to sprain)"],"related_medical_terms":["ligamento (ligament)","inflamación (inflammation)","hielo (ice)","vendaje (bandage)","fisioterapia (physical therapy)"],"priority":"★★★"},"level_frequency":{"frequency_corpus":"Relatively common, especially in contexts related to sports and injuries.","priority":"★★☆"},"readability_explanation":{"level":"B1","text":"\"Esguince\" is a relatively common word, especially in contexts related to sports, physical activities, and injuries. It refers specifically to a sprain, an injury to the ligaments around a joint. If you talk about hurting your ankle or wrist, you might use this word. It's helpful to know if you're discussing injuries or health in Spanish."},"example_sentences":[{"sentence":"Después de la caída, tenía un fuerte esguince en la rodilla.","translation":"After the fall, I had a severe sprain in my knee.","type":"example"},{"sentence":"El tratamiento para un esguince incluye reposo, hielo, compresión y elevación (RICE).","translation":"Treatment for a sprain includes rest, ice, compression, and elevation (RICE).","type":"example"},{"sentence":"Es importante prevenir los esguinces calentando antes de hacer ejercicio.","translation":"It's important to prevent sprains by warming up before exercising.","type":"example"}]}