{"word":"turgescently","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"腫脹して、膨張して","english_definition":"In a turgescent manner; swollen or inflated.","examples":[{"sentence":"The plant cells appeared turgescently under the microscope after being placed in a hypotonic solution.","translation":"植物細胞は、低張液に置かれた後、顕微鏡下で腫脹して見えた。"},{"sentence":"His veins throbbed turgescently in his forehead as he strained to lift the heavy weight.","translation":"重いものを持ち上げようと力を入れると、彼の額の血管が腫脹して脈打った。"}],"collocations":["appear turgescently","throb turgescently"],"synonyms":["swollenly","inflatedly","distendedly","bloatedly"],"antonyms":["deflatedly","shrunkenly","collapsedly"]}],"etymology":{"value":"Derived from the adjective 'turgescent', which comes from the Latin 'turgescens', the present participle of 'turgescere' meaning 'to begin to swell', from 'turgere' meaning 'to swell'.","priority":"★★☆"},"pronunciation":{"ipa":"/tɜːrˈdʒesəntli/","syllables":"tur-ges-cent-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Turgescently' describes something that is swollen, inflated, or distended in a manner suggesting fullness or tension. It is often used in biological or medical contexts to describe cells, tissues, or organs that are swollen with fluid. It can also be used metaphorically to describe something that is pompous or bombastic, although this usage is less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The balloon filled turgescently with air.","correct":"✓ The balloon filled with air until it became turgescent.","note":"'Turgescently' describes the *manner* of being swollen, not the action of filling. It's better to use 'turgescent' as an adjective after the action is completed or to rephrase the sentence to emphasize the state of being swollen."}],"priority":"★★☆"},"related_words":{"derivatives":["turgescent (adjective)","turgescence (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Turgescently' is a highly specialized and uncommon word. It is typically used in scientific or medical contexts to describe something that is swollen or inflated. Due to its limited usage and technical nature, it is unlikely to be encountered in everyday language. Understanding the root word 'turgescent' and its Latin origin can aid in comprehending its meaning."},"example_sentences":[{"sentence":"The engorged tick clung turgescently to its host.","translation":"血を吸って膨れ上がったダニは、宿主に腫脹してしがみついていた。","type":"adverb","meaning_category":"腫脹して"},{"sentence":"The buds swelled turgescently with the promise of spring.","translation":"つぼみは春の兆しとともに腫脹して膨らんだ。","type":"adverb","meaning_category":"膨張して"}]}