{"word":"thrush","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(鳥類)ツグミ","english_definition":"a songbird of the family Turdidae, typically having a brown back and spotted breast.","examples":[{"sentence":"The wood thrush is known for its beautiful song.","translation":"アメリカムジツグミはその美しい歌で知られている。"},{"sentence":"We saw a thrush hopping around in the garden.","translation":"庭でツグミが飛び跳ねているのを見かけた。"}],"collocations":["wood thrush","hermit thrush","song thrush","mistle thrush"],"synonyms":["songbird"],"antonyms":[]},{"part_of_speech":"noun","definition":"(医学)鵞口瘡（がこうそう）","english_definition":"a fungal infection, typically of the mouth or throat, caused by Candida albicans and characterized by creamy white lesions.","examples":[{"sentence":"The baby developed thrush after taking antibiotics.","translation":"その赤ちゃんは抗生物質を服用後、鵞口瘡を発症した。"},{"sentence":"Thrush can be treated with antifungal medication.","translation":"鵞口瘡は抗真菌薬で治療できる。"}],"collocations":["oral thrush","esophageal thrush"],"synonyms":["candidiasis"],"antonyms":[]}],"etymology":{"value":"The bird name comes from Old English *þrūsc*, of Germanic origin; related to German Drossel. The medical term is of uncertain origin, possibly related to the bird name, referring to the white spots resembling a thrush's speckled breast.","priority":"★★☆"},"pronunciation":{"ipa":"/θrʌʃ/","syllables":"thrush"},"inflection":{"noun_plural":"thrushes"},"usage_notes":{"explanation":"The word \"thrush\" has two distinct meanings: one referring to a type of bird and the other to a fungal infection. The context usually makes it clear which meaning is intended. When referring to the bird, it is often used in combination with other words to specify the type of thrush, such as \"wood thrush\" or \"hermit thrush.\" When referring to the infection, it is often preceded by \"oral\" or \"esophageal\" to indicate the location of the infection.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a thrush in my throat.","correct":"✓ I had thrush in my throat.","note":"When referring to the fungal infection, use \"have thrush\" rather than \"see a thrush.\""},{"incorrect":"✗ The bird had thrushes.","correct":"✓ The bird was a thrush.","note":"When referring to multiple birds, use the plural \"thrushes.\" When referring to a single bird, use the singular \"thrush.\""}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but commonly used in specific contexts (birdwatching, medicine).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"thrush\" has two different meanings, which can make it confusing. The first meaning is a type of bird, a songbird with a brown back and spotted breast. The second meaning is a fungal infection, usually in the mouth or throat, that causes white patches. You can usually tell which meaning is intended from the context. If someone is talking about birds or nature, they probably mean the bird. If they are talking about health or medicine, they probably mean the infection.","priority":"★★☆"},"example_sentences":[{"sentence":"The **thrush** sang beautifully from the tree branch.","translation":"ツグミが木の枝から美しく歌った。","type":"noun","meaning_category":"bird"},{"sentence":"The doctor diagnosed her with oral **thrush**.","translation":"医師は彼女を口腔鵞口瘡と診断した。","type":"noun","meaning_category":"fungal infection"},{"sentence":"We identified the bird as a wood **thrush** by its distinctive song.","translation":"私たちはその鳥を、特徴的な鳴き声からアメリカムジツグミだと特定した。","type":"noun","meaning_category":"bird"},{"sentence":"The baby's **thrush** was treated with an antifungal cream.","translation":"赤ちゃんの鵞口瘡は抗真菌クリームで治療された。","type":"noun","meaning_category":"fungal infection"}]}