{"word":"Apgar","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アプガースコア（新生児の健康状態を評価する指標）","english_definition":"A system for assessing the condition of a newborn infant, based on heart rate, respiration, muscle tone, reflex irritability, and color.","examples":[{"sentence":"The baby had an Apgar score of 9 at one minute.","translation":"その赤ちゃんは生後1分でアプガースコアが9だった。"},{"sentence":"A low Apgar score doesn't always indicate long-term health problems.","translation":"低いアプガースコアが必ずしも長期的な健康問題を示すとは限らない。"}],"collocations":["Apgar score","one-minute Apgar","five-minute Apgar","low Apgar score","high Apgar score"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Virginia Apgar (1909-1974), an American anesthesiologist, who developed the scoring system in 1952. The name 'Apgar' is also a backronym for Appearance (skin color), Pulse (heart rate), Grimace response (reflexes), Activity (muscle tone), and Respiration.","priority":"★★★"},"pronunciation":{"ipa":"/ˈæpɡɑːr/","syllables":"Ap-gar"},"inflection":{},"usage_notes":{"explanation":"The Apgar score is typically assessed at one minute and five minutes after birth, and sometimes again at 10 minutes if the initial scores are low. Each of the five criteria is scored from 0 to 2, resulting in a maximum possible score of 10. A score of 7 or above is generally considered normal, while a lower score may indicate that the newborn requires medical attention.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["neonatology","pediatrics","newborn","infant","assessment","score"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'Apgar' refers to a specific medical scoring system used to evaluate the health of newborn infants. It's primarily used in medical contexts and may not be commonly encountered in everyday language. Understanding the term requires some familiarity with medical terminology and procedures related to childbirth and newborn care."},"example_sentences":[{"sentence":"The doctor quickly calculated the newborn's **Apgar** score.","translation":"医師はすぐに新生児のアプガースコアを計算した。","type":"noun","meaning_category":"アプガースコア"},{"sentence":"The **Apgar** test is a routine part of newborn care.","translation":"アプガー検査は新生児ケアのルーチンの一部である。","type":"noun","meaning_category":"アプガースコア"}]}