{"word":"denazifying","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"非ナチ化する、ナチスの影響を取り除く","english_definition":"to remove Nazi ideology and influence from (a country, institution, etc.).","examples":[{"sentence":"The Allied forces were tasked with denazifying Germany after World War II.","translation":"連合国軍は第二次世界大戦後、ドイツを非ナチ化する任務を課せられた。"},{"sentence":"The process of denazifying the education system was complex and controversial.","translation":"教育制度からナチスの影響を取り除くプロセスは複雑で議論を呼んだ。"}],"collocations":["denazifying Germany","denazifying institutions","denazifying the education system"],"synonyms":["depoliticizing","purging","cleansing"],"antonyms":["nazifying"]},{"part_of_speech":"verb","transitivity":"vi","definition":"非ナチ化される","english_definition":"to undergo the process of having Nazi ideology and influence removed.","examples":[{"sentence":"The country is denazifying after years of fascist rule.","translation":"その国は長年のファシスト支配の後、非ナチ化されている。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'denazify' + '-ing'. 'Denazify' is formed from the prefix 'de-' (meaning 'remove' or 'reverse') + 'Nazify' (to bring under Nazi control or influence).","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈnæziˌfaɪɪŋ/","syllables":"de-na-zi-fy-ing"},"inflection":{"verb_forms":{"present_simple":["denazifies"],"past_simple":"denazified","past_participle":"denazified","present_participle":"denazifying"}},"usage_notes":{"explanation":"'Denazifying' refers to the process of removing the ideology, symbols, organizations, and personnel associated with Nazism from a country or institution. It is most commonly associated with post-World War II Germany, but the term can be applied to any situation where there is an effort to eliminate Nazi influence. The term is often politically charged and can be used in propaganda.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They are denazifying the building with paint.","correct":"✓ They are renovating the building. / They are removing Nazi symbols from the building.","note":"'Denazifying' specifically refers to removing Nazi ideology and influence, not general renovation or cleaning. Use more appropriate terms if the context is not related to Nazism."}],"priority":"★☆☆"},"related_words":{"derivatives":["denazification (noun)","denazify (verb)"],"phrasal_verbs":[],"related_concepts":["de-Ba'athification","decommunization","de-Stalinization"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Denazifying' is a specialized term that refers to the process of removing Nazi ideology and influence from a society, institution, or country. It is most commonly associated with post-World War II Germany. The term is often used in political contexts and requires an understanding of historical events related to Nazism. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The museum is denazifying its collection by removing items with Nazi provenance.","translation":"その博物館は、ナチスの由来を持つ品々をコレクションから取り除くことで、非ナチ化を進めている。","type":"verb","meaning_category":"removing Nazi influence"},{"sentence":"The government implemented policies aimed at denazifying the civil service.","translation":"政府は公務員制度からナチスの影響を取り除くことを目的とした政策を実施した。","type":"verb","meaning_category":"removing Nazi influence"}]}