{"word":"locally-managed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"地域によって管理されている、地方自治体によって管理されている","english_definition":"controlled and run by people in a local area, rather than by a central authority.","examples":[{"sentence":"The school is locally-managed, giving parents more say in how it's run.","translation":"その学校は地域によって管理されており、保護者は学校運営についてより多くの発言権を持っています。"},{"sentence":"The project is locally-managed to ensure it meets the needs of the community.","translation":"そのプロジェクトは、地域社会のニーズを満たすように、地域によって管理されています。"},{"sentence":"A locally-managed healthcare system can be more responsive to local health issues.","translation":"地域によって管理される医療システムは、地域の健康問題により迅速に対応できます。"}],"collocations":["locally-managed school (地域管理の学校)","locally-managed project (地域管理のプロジェクト)","locally-managed healthcare (地域管理の医療)","locally-managed resources (地域管理の資源)","locally-managed services (地域管理のサービス)"],"synonyms":["community-run","decentralized","grassroots-led","regionally-controlled","community-based"],"antonyms":["centrally-managed","state-controlled","federally-managed","nationally-controlled"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'locally' (meaning 'in a local area') with 'managed' (meaning 'controlled or administered'). The combination indicates that the management or control is exercised at the local level.","priority":"N/A"},"pronunciation":{"ipa":"/ˈloʊkəli ˈmænɪdʒd/","syllables":"lo-cal-ly-man-aged"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with compound adjectives like 'locally-managed' due to their length and complexity. You might use 'more locally-managed' but it's less common."},"usage_notes":{"explanation":"'Locally-managed' emphasizes that the responsibility for running something lies with people or organizations within a specific geographic area, rather than with a larger, more distant entity. This often implies greater responsiveness to local needs and preferences, but can also present challenges in terms of resources and coordination.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The locally managed.","correct":"✓ The project is locally-managed.","note":"'Locally-managed' is an adjective and needs to be used with a noun or after a linking verb like 'is' or 'are'."},{"incorrect":"✗ locally managed school's","correct":"✓ locally-managed school's","note":"The hyphen is important to show that 'locally' modifies 'managed' rather than just 'school'."}],"priority":"N/A"},"related_words":{"derivatives":["local (adjective, noun)","locally (adverb)","manage (verb)","management (noun)","self-managed (adjective)","community-managed (adjective)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in specific contexts related to governance, development, and community initiatives.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Locally-managed' is a compound adjective describing something that is controlled and operated by people or entities within a specific geographic area. It's commonly used in discussions about governance, community development, and resource management, where the emphasis is on local control and decision-making. The term implies a decentralized approach, contrasting with centrally-managed or state-controlled systems. Understanding this term requires familiarity with concepts of local governance and community empowerment."},"example_sentences":[{"sentence":"The success of the conservation effort depends on a **locally-managed** approach.","translation":"保全活動の成功は、地域管理型のアプローチにかかっています。","type":"adjective","meaning_category":"地域管理"},{"sentence":"The **locally-managed** irrigation system has improved crop yields significantly.","translation":"地域管理の灌漑システムは、作物の収量を大幅に改善しました。","type":"adjective","meaning_category":"地域管理"},{"sentence":"A **locally-managed** fund was established to support small businesses in the area.","translation":"地域の中小企業を支援するために、地域管理の基金が設立されました。","type":"adjective","meaning_category":"地域管理"}]}