{"word":"griffin-winged","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"グリフィンの翼を持つ、グリフィンの翼のような","english_definition":"Having wings like those of a griffin; resembling the wings of a griffin.","examples":[{"sentence":"The griffin-winged statue stood guard at the entrance.","translation":"グリフィンの翼を持つ像が入り口で守護していた。"},{"sentence":"The artist depicted the angel with griffin-winged features.","translation":"その芸術家は天使をグリフィンの翼のような特徴で描いた。"}],"collocations":["griffin-winged statue","griffin-winged angel","griffin-winged creature"],"synonyms":["eagle-winged","falcon-winged","winged like a griffin"],"antonyms":["wingless"]},{"part_of_speech":"adjective","definition":"(比喩的に)力強く、威厳のある翼を持つ","english_definition":"(Figuratively) Having powerful and majestic wings.","examples":[{"sentence":"The griffin-winged ambition of the young entrepreneur was evident in his bold plans.","translation":"その若い起業家のグリフィンの翼のような野心は、彼の大胆な計画に明らかだった。"}],"collocations":["griffin-winged ambition","griffin-winged dreams","griffin-winged spirit"],"synonyms":["powerful","majestic","soaring","ambitious"],"antonyms":["feeble","grounded"]}],"etymology":{"value":"Derived from \"griffin\" (a mythical creature with the head and wings of an eagle and the body of a lion) and \"winged\" (having wings).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡrɪfɪnˌwɪŋd/","syllables":"grif-fin-winged"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"\"griffin-winged\" is primarily a descriptive adjective used to indicate that something has wings resembling those of a griffin, a mythical creature. It can also be used metaphorically to describe something powerful or majestic. It is not a commonly used word, but it is evocative and can add a sense of fantasy or grandeur to writing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The griffin winged creature soared through the sky.","correct":"✓ The griffin-winged creature soared through the sky.","note":"The correct form is \"griffin-winged,\" with a hyphen, as it is a compound adjective modifying \"creature.\""}],"priority":"★★☆"},"related_words":{"derivatives":["griffin","winged"],"phrases":["wings of a griffin"]},"level_frequency":{"CEFR":"N/A (Uncommon word)","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"griffin-winged\" is a relatively uncommon and specialized term. It is most likely to be encountered in fantasy literature, mythology, or art history contexts. Understanding the word requires familiarity with the mythical creature known as a griffin. The word functions as a descriptive adjective, indicating that something possesses wings similar to those of a griffin. Due to its specific and uncommon nature, it is best suited for advanced learners or those with a particular interest in mythology and fantasy. "},"example_sentences":[{"sentence":"The hero rode a griffin-winged steed into battle.","translation":"英雄はグリフィンの翼を持つ馬に乗って戦場へ向かった。","type":"descriptive","meaning_category":"mythical creature"},{"sentence":"The architect designed a griffin-winged gargoyle to adorn the cathedral.","translation":"建築家はグリフィンの翼を持つガーゴイルを設計して大聖堂を飾った。","type":"descriptive","meaning_category":"architecture"},{"sentence":"Her griffin-winged imagination allowed her to create fantastical worlds in her writing.","translation":"彼女のグリフィンの翼のような想像力は、彼女が空想的な世界を文章で創造することを可能にした。","type":"metaphorical","meaning_category":"imagination"}]}