{"word":"submediant","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(音楽)下中音：全音階の第6音。主音から下方3度、または属音から下方3度の音。","english_definition":"(music) The sixth degree of a diatonic scale. It is a third below the tonic, or a third below the dominant.","examples":[{"sentence":"The submediant chord often functions as a pre-dominant chord.","translation":"下中音のコードは、しばしば前属和音として機能する。"},{"sentence":"In C major, the submediant is A.","translation":"ハ長調では、下中音はイである。"}],"collocations":["submediant chord","submediant key","relative minor (often the submediant of the major key)"],"synonyms":["sixth degree","VI"],"antonyms":["tonic","dominant","mediant"]},{"part_of_speech":"adjective","definition":"(音楽)下中音の","english_definition":"(music) Of or relating to the submediant.","examples":[{"sentence":"The submediant harmony created a melancholic effect.","translation":"下中音のハーモニーは、憂鬱な効果を生み出した。"}],"collocations":["submediant cadence","submediant progression"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Sub-' (below) + 'mediant' (middle). It refers to the note that is a third below the tonic, or 'in the middle' between the dominant and the lower tonic.","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˈmiːdiənt/","syllables":"sub-me-di-ant"},"inflection":{"noun_plural":"submediants"},"usage_notes":{"explanation":"The term 'submediant' is primarily used in music theory to describe a specific scale degree and its associated chords. It is most commonly encountered in discussions of harmony and chord progressions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The submediant is always a major chord.","correct":"✓ The submediant can be either a major or minor chord, depending on the key and context.","note":"The quality of the submediant chord (major or minor) depends on the key and whether it's in a major or minor scale."}],"priority":"★☆☆"},"related_words":{"derivatives":["mediant","supertonic","subdominant","dominant","tonic"],"phrases":["diatonic scale","chord progression","harmonic function"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'submediant' is a music theory term referring to the sixth degree of a diatonic scale. Understanding this term requires familiarity with basic music theory concepts such as scales, degrees, and harmony. It is most relevant in the context of analyzing chord progressions and understanding the function of different chords within a key.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **submediant** is a crucial element in understanding tonal harmony.","translation":"下中音は、調性和声を理解する上で重要な要素である。","type":"noun","meaning_category":"下中音"},{"sentence":"A **submediant** chord can add color and complexity to a song's harmonic structure.","translation":"下中音のコードは、楽曲のハーモニー構造に彩りと複雑さを加えることができる。","type":"noun","meaning_category":"下中音"},{"sentence":"The song modulates to the relative minor, emphasizing the **submediant**.","translation":"その曲は平行調の短調に転調し、下中音を強調している。","type":"noun","meaning_category":"下中音"}]}