{"word":"refed","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(refed is the past tense and past participle of refeed) to feed again or anew; to provide food again.","english_definition":"(past tense and past participle of refeed) to feed again, especially after a period of starvation or restricted food intake.","examples":[{"sentence":"The rescued animals were carefully refed to help them regain their strength.","translation":"救助された動物たちは、体力を回復させるために注意深く再び給餌された。"},{"sentence":"After the surgery, the patient was slowly refed with a liquid diet.","translation":"手術後、患者は液状食でゆっくりと再び給餌された。"}],"collocations":["refed carefully","refed slowly","refed with nutrients"],"synonyms":["fed again","nourished again","replenished with food"],"antonyms":["starved","fasted"]}],"etymology":{"value":"Derived from 're-' (again) + 'feed'. Indicates the action of feeding again after a period of not feeding or underfeeding.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈfɛd/","syllables":"re-fed"},"inflection":{"verb_forms":{"present_simple":["refeed","refeeds"],"past_simple":"refed","past_participle":"refed","present_participle":"refeeding"}},"usage_notes":{"explanation":"'Refed' is primarily used in contexts where there has been a deliberate or unintentional period of food restriction, such as in medical settings, animal rescue, or after a period of fasting. It implies a careful and controlled reintroduction of food to avoid complications. The term is less commonly used in everyday contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The baby was refed after a short nap.","correct":"✓ The baby was fed after a short nap.","note":"'Refed' implies a longer period of food deprivation than a short nap would suggest. 'Fed' is more appropriate in this context."},{"incorrect":"✗ The plant was refed with water.","correct":"✓ The plant was watered again.","note":"'Refed' is typically used in the context of food, not water. For plants, 'watered again' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["refeed (verb - present tense)","refeeding (noun/verb - gerund or present participle)","refeeding syndrome (a potentially fatal metabolic disturbance that can occur when nutrition is reintroduced too quickly after a period of starvation)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in specialized contexts (medical, animal care).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Refed' is a relatively uncommon word that means to feed someone or something again, especially after a period of starvation or restricted food intake. It's often used in medical or veterinary contexts when discussing the careful reintroduction of food to patients or animals who have been malnourished. The term implies a deliberate and controlled process to avoid complications associated with rapid refeeding. It's important to distinguish 'refed' from simply 'fed,' as 'refed' carries the specific connotation of feeding after a period of deprivation."},"example_sentences":[{"sentence":"The malnourished child was carefully refed under medical supervision.","translation":"栄養失調の子供は、医療監督の下で注意深く再び給餌された。","type":"verb","meaning_category":"Feeding after starvation"},{"sentence":"The rescued dog was refed small portions of food to avoid digestive problems.","translation":"救助された犬は、消化器系の問題を避けるために、少量の食事が再び与えられた。","type":"verb","meaning_category":"Feeding after starvation"},{"sentence":"Patients recovering from anorexia are often refed gradually to prevent refeeding syndrome.","translation":"拒食症から回復中の患者は、リフィーディング症候群を防ぐために、徐々に再び給餌されることが多い。","type":"verb","meaning_category":"Feeding after starvation"}]}