{"word":"waybills","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)貨物運送状、貨物明細書","english_definition":"plural of waybill: a document issued by a carrier to acknowledge receipt of goods for transport.","examples":[{"sentence":"The clerk checked the waybills against the cargo.","translation":"事務員は貨物と貨物運送状を照合した。"},{"sentence":"All waybills must be signed upon delivery.","translation":"すべての貨物運送状は配達時に署名されなければならない。"}],"collocations":["check waybills","sign waybills","issue waybills"],"synonyms":["consignment note","freight bill","shipping document"],"antonyms":[]}],"etymology":{"value":"'Waybill' is a compound word: 'way' referring to the route of transport, and 'bill' referring to a list or invoice.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈweɪbɪlz/","syllables":"way-bills"},"inflection":{"noun_plural":"waybills"},"usage_notes":{"explanation":"'Waybills' is the plural form of 'waybill.' A waybill is a document that accompanies goods being shipped by a common carrier. It provides details about the shipment, such as the consignor, consignee, origin, destination, and description of the goods. It serves as a receipt for the shipment and is used for tracking purposes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He only had one waybill for all the packages.","correct":"✓ He only had one waybill for all the packages. (correct, but context may suggest multiple waybills)","note":"While grammatically correct, context may suggest multiple waybills if the packages are distinct. Consider 'He had a single waybill for all the packages' for clarity."},{"incorrect":"✗ The waybill are missing.","correct":"✓ The waybills are missing.","note":"'Waybills' is plural, so the verb must agree: 'are' not 'is'."}],"priority":"★★☆"},"related_words":{"derivatives":["waybill"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Waybills' refers to the plural form of 'waybill', a document used in the transportation of goods. It's a relatively specialized term, primarily encountered in logistics, shipping, and transportation contexts. Understanding requires familiarity with commercial shipping processes."},"example_sentences":[{"sentence":"The truck driver handed over the stack of waybills to the receiving clerk.","translation":"トラック運転手は受け付け係に貨物運送状の束を手渡した。","type":"noun","meaning_category":"貨物運送状"},{"sentence":"Customs officials inspected the waybills to verify the contents of the containers.","translation":"税関職員はコンテナの中身を確認するために貨物運送状を検査した。","type":"noun","meaning_category":"貨物運送状"},{"sentence":"The shipping company uses electronic waybills to track shipments in real-time.","translation":"その運送会社は貨物をリアルタイムで追跡するために電子貨物運送状を使用している。","type":"noun","meaning_category":"貨物運送状"}]}