{"word":"low-efficiency","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"低効率の、効率の低い","english_definition":"Not producing the desired effect or result without wasting time, energy, or materials; characterized by a poor ratio of output to input.","examples":[{"sentence":"The old furnace was a low-efficiency model, wasting a lot of energy.","translation":"その古い暖炉は低効率モデルで、多くのエネルギーを無駄にしていた。"},{"sentence":"The company's low-efficiency production methods were causing them to lose money.","translation":"その会社の低効率な生産方法は、彼らに損失をもたらしていた。"},{"sentence":"We need to replace these low-efficiency light bulbs with LEDs.","translation":"これらの低効率な電球をLEDに交換する必要があります。"}],"collocations":["low-efficiency furnace","low-efficiency engine","low-efficiency production","low-efficiency lighting","low-efficiency appliance"],"synonyms":["inefficient","wasteful","uneconomical","unproductive","poor-performing"],"antonyms":["high-efficiency","efficient","economical","productive","effective"]}],"etymology":{"value":"Combination of 'low' (having a small amount or degree) and 'efficiency' (the ability to avoid wasting materials, energy, efforts, money, and time in doing something or in producing a desired result).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌloʊ ɪˈfɪʃənsi/","syllables":"low-ef-fi-cien-cy"},"inflection":{"notes":"Adjective; does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Low-efficiency' describes something that does not convert input (such as energy, resources, or time) into output effectively. It implies that there is a significant waste or loss in the process. It is often used in contexts related to technology, manufacturing, and resource management.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The low efficiency of the car made it expensive to run.","correct":"✓ The low efficiency of the car made it expensive to run.","note":"Correct spelling is 'efficiency', not 'efficiency'."},{"incorrect":"✗ This machine is very low efficient.","correct":"✓ This machine is very low-efficiency. / ✓ This machine is very inefficient.","note":"'Low-efficiency' is an adjective. To modify it with 'very', you need to keep it as a compound adjective. Alternatively, you can use the synonym 'inefficient'."}],"priority":"★★☆"},"related_words":{"derivatives":["efficiency","inefficiency","efficient","inefficient"],"phrasal_verbs":[],"related_terms":["energy efficiency","resource efficiency","cost efficiency"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in technical and business contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Low-efficiency' means that something doesn't work very well and wastes resources like energy or time. It's used to describe things that don't produce much output compared to the amount of input they use. You'll often see it in discussions about technology, business, or environmental issues where people are trying to improve how things work and reduce waste."},"example_sentences":[{"sentence":"The government is offering incentives to encourage people to replace their low-efficiency appliances.","translation":"政府は、人々が低効率な家電製品を交換することを奨励するために、インセンティブを提供している。","type":"adjective","meaning_category":"efficiency"},{"sentence":"The study showed that the low-efficiency irrigation system was wasting a significant amount of water.","translation":"その研究は、低効率な灌漑システムがかなりの量の水を無駄にしていることを示した。","type":"adjective","meaning_category":"efficiency"},{"sentence":"The factory's low-efficiency processes were contributing to high production costs.","translation":"その工場の低効率なプロセスは、高い生産コストの一因となっていた。","type":"adjective","meaning_category":"efficiency"}]}