{"word":"pseudo-ethical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"倫理的であるかのように見せかけた、見せかけの倫理的な","english_definition":"appearing to be ethical but not genuinely so; falsely or superficially ethical.","examples":[{"sentence":"The company's pseudo-ethical marketing campaign was designed to appeal to environmentally conscious consumers, but it lacked real substance.","translation":"その会社の偽倫理的なマーケティングキャンペーンは、環境意識の高い消費者にアピールするように設計されましたが、実際の内容に欠けていました。"},{"sentence":"His pseudo-ethical arguments were merely a smokescreen to justify his self-serving actions.","translation":"彼の見せかけの倫理的な議論は、彼の自己中心的な行動を正当化するための単なる煙幕でした。"},{"sentence":"The politician's pseudo-ethical stance on the issue was seen as opportunistic and insincere.","translation":"その政治家の問題に対する見せかけの倫理的な態度は、日和見主義的で不誠実だと見なされました。"}],"collocations":["pseudo-ethical behavior (見せかけの倫理的な行動)","pseudo-ethical arguments (見せかけの倫理的な議論)","pseudo-ethical marketing (見せかけの倫理的なマーケティング)","pseudo-ethical justification (見せかけの倫理的な正当化)","pseudo-ethical stance (見せかけの倫理的な立場)"],"synonyms":["ostensibly ethical","superficially ethical","nominally ethical","purportedly ethical","ostensible","sham ethical","falsely ethical","insincerely ethical"],"antonyms":["genuinely ethical","truly ethical","authentically ethical","sincerely ethical","actually ethical","veritably ethical"]},{"part_of_speech":"adjective","definition":"倫理的な原則や基準を誤って適用した、誤った倫理観に基づいた","english_definition":"based on a misunderstanding or misapplication of ethical principles or standards.","examples":[{"sentence":"The pseudo-ethical framework they used to justify their actions was based on flawed reasoning and selective application of moral principles.","translation":"彼らが自分たちの行動を正当化するために使用した見せかけの倫理的枠組みは、欠陥のある推論と道徳的原則の選択的な適用に基づいていました。"},{"sentence":"Their pseudo-ethical approach to the problem led to unintended negative consequences.","translation":"問題に対する彼らの見せかけの倫理的なアプローチは、意図しない否定的な結果につながりました。"}],"collocations":["pseudo-ethical framework (見せかけの倫理的枠組み)","pseudo-ethical approach (見せかけの倫理的なアプローチ)","pseudo-ethical reasoning (見せかけの倫理的な推論)","pseudo-ethical justification (見せかけの倫理的な正当化)"],"synonyms":["misguidedly ethical","erroneously ethical","fallaciously ethical","incorrectly ethical","misapplied ethical"],"antonyms":["soundly ethical","correctly ethical","appropriately ethical","properly ethical"]}],"etymology":{"value":"The word \"pseudo-ethical\" is formed by combining the prefix \"pseudo-\" (from Greek ψευδής (pseudḗs) meaning \"false, lying\") with the word \"ethical\" (relating to moral principles or the branch of knowledge dealing with these). Therefore, it literally means \"falsely ethical\" or \"appearing to be ethical but not really so.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈɛθɪkəl/","syllables":"pseu-do-eth-i-cal"},"inflection":{"notes":"As an adjective, it has comparative and superlative forms (more pseudo-ethical, most pseudo-ethical), though these are less common."},"usage_notes":{"explanation":"The term \"pseudo-ethical\" is used to describe something that gives the impression of being ethical or morally correct, but upon closer examination, it is revealed to be insincere, misleading, or based on flawed reasoning. It is often used to critique actions, arguments, or policies that are presented as ethical but are actually motivated by self-interest, opportunism, or a misunderstanding of ethical principles. The term implies a deceptive or superficial quality to the purported ethical behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company claimed to be ethical, but their actions were pseudo-ethical.","correct":"✓ The company claimed to be ethical, but their actions were unethical. / ✓ The company's actions were pseudo-ethical.","note":"When contrasting with a claim of being ethical, \"unethical\" is often more direct. \"Pseudo-ethical\" is better used to describe the nature of the actions themselves, rather than directly contradicting a claim."},{"incorrect":"✗ He was a pseudo-ethical person.","correct":"✓ He displayed pseudo-ethical behavior. / ✓ His arguments were pseudo-ethical.","note":"It's more common to describe behavior, arguments, or actions as pseudo-ethical, rather than a person. Describing a person as pseudo-ethical implies that their entire character is falsely ethical, which is a strong claim."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudoethics (noun: the study or practice of pseudo-ethical behavior or principles)"],"antonyms":["ethical","moral","principled","virtuous","honorable","upright"],"related_terms":["virtue signaling","moral hypocrisy","ethical washing","greenwashing (when applied to environmental claims)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pseudo-ethical' is a complex term used to describe something that appears ethical on the surface but lacks genuine ethical substance or is based on flawed ethical reasoning. It suggests a deceptive quality, where actions or arguments are presented as morally sound but are actually motivated by self-interest or a misunderstanding of ethical principles. This term is often used in critical analysis of corporate behavior, political discourse, or philosophical discussions where ethical claims are scrutinized for their authenticity and validity."},"example_sentences":[{"sentence":"The politician's **pseudo-ethical** promises were seen as a cynical attempt to win votes.","translation":"その政治家の見せかけの倫理的な約束は、票を獲得するための皮肉な試みと見なされた。","type":"adjective","meaning_category":"見せかけの倫理的な"},{"sentence":"The company engaged in **pseudo-ethical** marketing by exaggerating its environmental efforts.","translation":"その会社は、環境への取り組みを誇張することによって、見せかけの倫理的なマーケティングを行った。","type":"adjective","meaning_category":"見せかけの倫理的な"},{"sentence":"His **pseudo-ethical** justification for his actions did not convince anyone.","translation":"彼の行動に対する見せかけの倫理的な正当化は、誰をも納得させなかった。","type":"adjective","meaning_category":"見せかけの倫理的な"},{"sentence":"The **pseudo-ethical** framework they used was based on a selective interpretation of moral principles.","translation":"彼らが使用した見せかけの倫理的枠組みは、道徳的原則の選択的な解釈に基づいていました。","type":"adjective","meaning_category":"誤った倫理観に基づいた"}]}