{"word":"Calyptrata","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A section or clade of flies (Diptera) within the suborder Brachycera, characterized by the presence of a calypter (a lobe at the base of the wing) that covers the halteres.","english_definition":"A taxonomic group of flies characterized by the presence of calyptrae, which are lobes or flaps at the base of the wings.","examples":[{"sentence":"The Calyptrata includes many familiar flies, such as house flies, blow flies, and flesh flies.","translation":"Calyptrataには、イエバエ、クロバエ、ニクバエなど、よく知られたハエが多く含まれています。"}],"collocations":["Calyptrata flies","Calyptrata species","Calyptrata taxonomy"],"synonyms":["Schizophora (partially overlapping, as Calyptrata is a subgroup of Schizophora)"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'calyptra,' meaning 'covering' or 'veil,' referring to the calypter structure covering the halteres.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkælɪpˈtreɪtə/","syllables":"Ca-lyp-tra-ta"},"inflection":{"notes":"Plural form is Calyptrata (same as singular). It is a taxonomic group name, often treated as singular."},"usage_notes":{"explanation":"'Calyptrata' is a term used in the classification of flies, specifically referring to a group within the Brachycera suborder. The key characteristic is the presence of calyptrae, which are significant for flight stability. This group includes many flies of medical, veterinary, and agricultural importance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Calyptrata is a type of butterfly.","correct":"✓ Calyptrata is a type of fly.","note":"Calyptrata are flies, not butterflies or other insects."}],"priority":"★★☆"},"related_words":{"derivatives":["calyptra (noun: the lobe covering the haltere)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized scientific vocabulary)","frequency_google_ngram":"Low frequency (scientific context)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Calyptrata' is a specialized term used in entomology (the study of insects) to classify a specific group of flies. Understanding this term requires familiarity with insect anatomy and taxonomic classification. It's primarily used in scientific literature and discussions among entomologists."},"example_sentences":[{"sentence":"The taxonomic classification of muscid flies places them within the Calyptrata.","translation":"イエバエの分類学的な分類では、それらはCalyptrataに分類されます。","type":"noun","meaning_category":"Taxonomy"},{"sentence":"Calyptrata are distinguished by their well-developed calyptrae.","translation":"Calyptrataは、よく発達したcalyptraeによって区別されます。","type":"noun","meaning_category":"Morphology"}]}