{"word":"automysophobia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己不潔恐怖症、自分が汚れていることへの恐怖症","english_definition":"The fear of being dirty.","examples":[{"sentence":"People with automysophobia may excessively wash their hands or avoid situations where they might get dirty.","translation":"自己不潔恐怖症の人は、過度に手を洗ったり、汚れる可能性のある状況を避けたりすることがあります。"},{"sentence":"Automysophobia is a specific phobia related to cleanliness and hygiene.","translation":"自己不潔恐怖症は、清潔さと衛生に関連する特定の恐怖症です。"}],"collocations":["suffer from automysophobia","have automysophobia","overcome automysophobia"],"synonyms":["fear of dirt","fear of being unclean"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'auto' (self), 'myso' (dirt, filth), and 'phobia' (fear).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːtoʊmaɪsoʊˈfoʊbiə/","syllables":"au-to-my-so-pho-bi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Automysophobia is a specific phobia characterized by an irrational and excessive fear of being dirty or unclean. It's more than just a concern for cleanliness; it's a debilitating fear that can significantly impact a person's daily life. Sufferers may experience anxiety, panic attacks, and compulsive behaviors related to cleanliness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am automysophobic with germs.","correct":"✓ I have automysophobia. / ✓ I am afraid of germs.","note":"Automysophobia is a phobia itself, so you 'have' it, or you are afraid of being dirty. You don't use 'with' in this context."},{"incorrect":"✗ He is automysophobia.","correct":"✓ He has automysophobia.","note":"Automysophobia is a noun, so you can't say \"He is automysophobia.\" You would say, \"He has automysophobia\" or \"He is automysophobic (although this adjective form is less common)\"."}],"priority":"★★☆"},"related_words":{"derivatives":["mysophobia (fear of germs)","phobia (fear)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Automysophobia' is a complex term referring to the specific phobia of being dirty. It is not a common word and is primarily used in psychological or medical contexts. Understanding the word requires knowledge of its Greek roots and an understanding of the concept of phobias. The word is more commonly explained than used directly in general conversation."},"example_sentences":[{"sentence":"Her automysophobia made it difficult for her to use public restrooms.","translation":"彼女の自己不潔恐怖症のために、公共のトイレを使うのが困難だった。","type":"general","meaning_category":"fear of being dirty"},{"sentence":"Treatment for automysophobia often involves therapy and, in some cases, medication.","translation":"自己不潔恐怖症の治療には、しばしばセラピーと、場合によっては薬物療法が含まれます。","type":"treatment","meaning_category":"fear of being dirty"}]}