{"word":"embattlement","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"胸壁、銃眼付き胸壁","english_definition":"A parapet or wall with alternating indentations and raised portions, originally for defense but often used for decoration.","examples":[{"sentence":"The castle's embattlement provided cover for the archers.","translation":"城の胸壁は射手たちに隠れる場所を提供した。"},{"sentence":"The embattlement of the tower added to its imposing appearance.","translation":"塔の胸壁はその堂々とした外観をさらに際立たせた。"},{"sentence":"The architect included an embattlement along the roofline for aesthetic purposes.","translation":"建築家は美的目的のために屋根線に沿って胸壁を設けた。"}],"collocations":["castle embattlement","tower embattlement","decorative embattlement"],"synonyms":["battlement","crenellation","parapet"],"antonyms":[]}],"etymology":{"value":"From Middle English *batelment*, from Anglo-Norman *batelment*, from Old French *bataille* (battle) + *-ment* (suffix forming nouns).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˈbætəlmənt/","syllables":"im-bat-tle-ment"},"inflection":{"noun_plural":"embattlements"},"usage_notes":{"explanation":"An \"embattlement\" is a specific type of defensive or decorative structure. It is characterized by alternating raised sections (merlons) and indentations (crenels or embrasures). The merlons provide protection, while the crenels allow for shooting or observation. While originally functional, they are now often used for aesthetic purposes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building had a beautiful battlement.","correct":"✓ The building had a beautiful embattlement.","note":"While 'battlement' and 'embattlement' are often used interchangeably, 'embattlement' is the more precise term for a parapet with alternating merlons and crenels."}],"priority":"★☆☆"},"related_words":{"derivatives":["embattled (adjective: prepared for battle; beset by problems)","battle (noun: a fight; verb: to fight)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (rare word)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"embattlement\" refers to a defensive wall or parapet, typically found on castles or fortifications, that has alternating raised sections (merlons) and open spaces (crenels). These structures were originally designed to provide protection for defenders while allowing them to shoot at attackers. Today, they are often used as decorative elements in architecture. It's a relatively uncommon word, so understanding its meaning requires a good vocabulary. It is often used in historical or architectural contexts."},"example_sentences":[{"sentence":"The archers took their positions behind the castle's **embattlement**.","translation":"射手たちは城の胸壁の後ろに陣取った。","type":"noun","meaning_category":"defensive structure"},{"sentence":"The **embattlement** of the ancient fortress offered a commanding view of the surrounding landscape.","translation":"古代要塞の胸壁は周囲の景観を一望できる見晴らしの良い場所だった。","type":"noun","meaning_category":"defensive structure"},{"sentence":"The architect incorporated a decorative **embattlement** into the design of the modern building.","translation":"建築家は現代的な建物のデザインに装飾的な胸壁を取り入れた。","type":"noun","meaning_category":"decorative element"}]}