{"word":"teatfish","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, derogatory) A weak, pathetic, or contemptible person.","english_definition":"(slang, derogatory) A weak, pathetic, or contemptible person.","examples":[{"sentence":"Don't be such a teatfish, stand up for yourself!","translation":"そんな弱虫になるな、自分のために立ち上がれ！"},{"sentence":"He's a complete teatfish, always complaining but never doing anything.","translation":"彼は全くの弱虫だ、いつも文句ばかり言って何も行動しない。"}],"collocations":["complete teatfish","total teatfish","utter teatfish"],"synonyms":["wimp","loser","pathetic person","contemptible person"],"antonyms":["strong person","leader","capable person"]}],"etymology":{"value":"Likely a blend of 'teat' (referring to weakness or dependence) and 'fish' (often used as a derogatory term). The exact origin is unclear, but it suggests someone who is helpless and clinging.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈtiːtfɪʃ/","syllables":"teat-fish"},"inflection":{"noun_plural":"teatfishes"},"usage_notes":{"explanation":"'Teatfish' is a highly informal and derogatory term. It's used to insult someone by implying they are weak, pathetic, and deserving of contempt. Use with extreme caution as it is offensive.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a teatfish, so he's very kind and helpful.","correct":"✗ This word is almost always used negatively.","note":"The word is derogatory, so using it in a positive context is incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (slang, very rare)","frequency_google_ngram":"Extremely rare","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Teatfish' is a slang term used to describe someone considered weak, pathetic, or contemptible. It's a highly offensive word and should be used with extreme caution, if at all. Due to its informal and derogatory nature, it's unlikely to appear in formal contexts. Understanding the term is more about recognizing its meaning when encountered rather than actively using it."},"example_sentences":[{"sentence":"Stop acting like a teatfish and take some responsibility!","translation":"弱虫みたいな真似はやめて、責任を取りなさい！","type":"noun","meaning_category":"derogatory term"}]}