{"word":"epibenthic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"底生生物の表面に生息する、または底生生物の表面近くに生息する","english_definition":"Living on or near the surface of the seabed.","examples":[{"sentence":"Epibenthic organisms are an important part of the marine food web.","translation":"底生生物表面に生息する生物は、海洋食物網の重要な部分である。"},{"sentence":"The epibenthic community includes a variety of species, such as crabs, starfish, and some types of worms.","translation":"底生生物群集には、カニ、ヒトデ、および一部の種類のワームなど、さまざまな種が含まれる。"}],"collocations":["epibenthic community","epibenthic sled","epibenthic habitat"],"synonyms":["benthic","demersal"],"antonyms":["pelagic"],"notes":"Often used in marine biology and ecology."}],"etymology":{"value":"Derived from the Greek words 'epi' (upon) and 'benthos' (the bottom of the sea).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛpɪˈbɛnθɪk/","syllables":"ep-i-ben-thic"},"inflection":{"notes":"Does not inflect."},"usage_notes":{"explanation":"'Epibenthic' describes organisms that live on the surface of the seabed or very close to it. These organisms are distinct from those that live within the sediment (infauna) or swim freely in the water column (pelagic organisms).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The epibenthic fish swims in the open ocean.","correct":"✓ The epibenthic fish lives near the seabed.","note":"Epibenthic organisms are associated with the seabed, not the open ocean."}],"priority":"★★☆"},"related_words":{"derivatives":["epibenthos (noun: The epibenthic organisms of a region.)"],"related_terms":["benthos","infauna","pelagic"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Epibenthic' is a technical term used in marine biology to describe organisms living on or near the seabed. It's a combination of 'epi-' (meaning 'upon') and 'benthic' (referring to the sea bottom). Understanding this term is essential for studying marine ecosystems and the distribution of species within them."},"example_sentences":[{"sentence":"The researchers used an epibenthic sled to collect samples from the seafloor.","translation":"研究者たちは、海底からサンプルを収集するために底生生物そりを使用した。","type":"example","meaning_category":"scientific research"},{"sentence":"Many commercially important fish species spend part of their lives in epibenthic habitats.","translation":"多くの商業的に重要な魚種は、その生活の一部を底生生物の生息地で過ごす。","type":"example","meaning_category":"marine biology"}]}