{"word":"atazir","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(rare) A type of traditional Yemeni dagger, often with a curved blade and ornate handle.","english_definition":"A type of traditional Yemeni dagger, often with a curved blade and ornate handle.","examples":[{"sentence":"The museum displayed a collection of atazir, showcasing the craftsmanship of Yemeni artisans.","translation":"博物館には、イエメンの職人の技を紹介するアタジルのコレクションが展示されていました。"}],"collocations":["Yemeni atazir","traditional atazir","silver atazir","gold atazir"],"synonyms":["jambiya","shibriya"],"antonyms":[]}],"etymology":{"value":"Likely from a local Arabic dialect in Yemen. The exact origin is not widely documented in standard etymological resources.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌætəˈzɪər/","syllables":"a-ta-zir"},"inflection":{"noun_plural":"atazirs"},"usage_notes":{"explanation":"The term 'atazir' is relatively rare and specific to Yemeni culture. It refers to a particular style of dagger, often associated with status and tradition. It is not a commonly used word in general English.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["jambiya","Yemen","dagger","knife"]},"level_frequency":{"CEFR":"N/A (Very rare)","frequency_google_ngram":"Extremely low frequency. Not commonly found in general text.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'atazir' is highly specialized and unlikely to be encountered except in specific contexts related to Yemeni culture, weaponry, or ethnographic studies. Understanding requires familiarity with regional terminology and cultural artifacts."},"example_sentences":[{"sentence":"He inherited an atazir from his grandfather, a symbol of their family's heritage.","translation":"彼は祖父からアタジルを受け継ぎました。それは家族の遺産の象徴です。","type":"noun","meaning_category":"traditional Yemeni dagger"},{"sentence":"The intricate silverwork on the atazir's handle was a testament to the skill of the Yemeni silversmith.","translation":"アタジルの柄の複雑な銀細工は、イエメンの銀細工職人の技術の証でした。","type":"noun","meaning_category":"traditional Yemeni dagger"}]}