{"word":"Punak","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A term used in 19th-century Hawaiʻi to refer to a person born of a union between a Hawaiian and a foreigner, especially a European or American.","english_definition":"(historical) A person in 19th-century Hawaiʻi who was the offspring of a Hawaiian and a foreigner, especially a European or American.","examples":[{"sentence":"The Punak were often seen as occupying a unique social position in Hawaiian society.","translation":"プナクはしばしばハワイ社会において独特な社会的地位を占めていると見なされていました。"},{"sentence":"Many Punak became influential figures in Hawaiian politics and business.","translation":"多くのプナクはハワイの政治やビジネスにおいて影響力のある人物になりました。"}],"collocations":["Punak identity","Punak heritage","Punak ancestry"],"synonyms":["hapa (contemporary term, though not precisely equivalent)","mixed-race (general term)"],"antonyms":["pure Hawaiian (though this term can be problematic)"]}],"etymology":{"value":"Likely derived from a Hawaiian word, but the exact origin is uncertain. Some sources suggest a connection to words related to 'mixed' or 'foreign'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpuːnɑːk/","syllables":"Pu-nak"},"inflection":{"noun_plural":"Punak or Punaks"},"usage_notes":{"explanation":"The term 'Punak' is primarily historical, referring to a specific social context in 19th-century Hawaiʻi. While it describes individuals of mixed Hawaiian and foreign ancestry, it's important to note that the term carries historical baggage and may not be universally accepted or used today. The contemporary term 'hapa' is often used to describe people of mixed Asian or Pacific Islander descent, but it is not a direct synonym for 'Punak'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is Punak, so he speaks only English.","correct":"✓ He is Punak, so he may speak both Hawaiian and English.","note":"Being Punak does not necessarily mean someone only speaks English. Many Punak were bilingual or primarily spoke Hawaiian."},{"incorrect":"✗ Punak are the same as hapa.","correct":"✓ Punak is a historical term for people of mixed Hawaiian and foreign ancestry, while hapa is a more general term for people of mixed Asian or Pacific Islander ancestry.","note":"While both terms relate to mixed ancestry, they are not entirely interchangeable. Punak has a specific historical and cultural context in Hawaiʻi."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["hapa","Hawaiian","foreigner","mixed-race","biracial"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Punak' requires an understanding of Hawaiian history and social dynamics. It's not a commonly used term in contemporary English, so familiarity with historical texts and discussions about Hawaiian identity is necessary to fully comprehend its meaning and significance. The term can also be sensitive, as it relates to issues of race, colonialism, and cultural identity."},"example_sentences":[{"sentence":"The diaries of Queen Liliuokalani mention several prominent Punak figures in her court.","translation":"リリウオカラニ女王の日記には、彼女の宮廷における著名なプナクの人物が何人か言及されています。","type":"historical context","meaning_category":"historical reference"},{"sentence":"Scholars have examined the role of the Punak in the development of modern Hawaiian society.","translation":"学者たちは、現代ハワイ社会の発展におけるプナクの役割を研究してきました。","type":"academic","meaning_category":"scholarly analysis"}]}