{"word":"technology-pessimist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"技術悲観主義者、技術に対して否定的な見方をする人","english_definition":"A person who believes that technology will have a negative impact on society.","examples":[{"sentence":"He is a technology-pessimist who believes that AI will lead to mass unemployment.","translation":"彼はAIが大量失業につながると信じている技術悲観主義者だ。"},{"sentence":"Many technology-pessimists are concerned about the potential for misuse of personal data.","translation":"多くの技術悲観主義者は、個人データの不正利用の可能性を懸念している。"}],"collocations":["technology pessimist view","technology pessimist perspective","become a technology pessimist"],"synonyms":["luddite","technophobe","contrarian"],"antonyms":["technology optimist","technophile","futurist"]},{"part_of_speech":"adjective","definition":"技術悲観的な、技術に対して否定的な見方をする","english_definition":"Having a negative view of the impact of technology on society.","examples":[{"sentence":"The author takes a technology-pessimist approach to the topic of social media.","translation":"著者はソーシャルメディアのトピックに対して技術悲観的なアプローチをとっている。"},{"sentence":"A technology-pessimist outlook can lead to resistance to innovation.","translation":"技術悲観的な見方は、イノベーションへの抵抗につながる可能性がある。"}],"collocations":["technology-pessimist view","technology-pessimist perspective","technology-pessimist approach"],"synonyms":["negative","skeptical","critical"],"antonyms":["optimistic","positive","hopeful"]}],"etymology":{"value":"\"Technology\" + \"pessimist\".","priority":"★★★"},"pronunciation":{"ipa":"/tɛkˈnɒlədʒi ˈpɛsɪmɪst/","syllables":"tek-nol-o-gy pes-si-mist"},"inflection":{"noun_plural":"technology-pessimists"},"usage_notes":{"explanation":"The term \"technology-pessimist\" is used to describe someone who is skeptical or negative about the impact of technology on society. They often express concerns about job displacement, privacy violations, social isolation, and other potential negative consequences of technological advancements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a technology pessimist person.","correct":"✓ He is a technology pessimist.","note":"\"Technology pessimist\" is already a noun describing a person, so adding \"person\" is redundant."},{"incorrect":"✗ Technology pessimists believe in no technology.","correct":"✓ Technology pessimists are skeptical about the overall positive impact of technology.","note":"Technology pessimists are not necessarily against all technology, but rather concerned about its potential negative consequences."}],"priority":"★★☆"},"related_words":{"derivatives":["pessimism","pessimist","technology"],"related_terms":["technology","optimist","luddite","technophobia"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"technology-pessimist\" is a compound word used to describe individuals who hold a negative or skeptical view about the impact of technology on society. They often express concerns about the potential downsides of technological advancements, such as job displacement, privacy violations, and social isolation. This term is commonly used in discussions about the ethical and societal implications of technology. It's important to note that technology-pessimists are not necessarily against all technology, but rather concerned about its potential negative consequences."},"example_sentences":[{"sentence":"As a technology-pessimist, she worries about the increasing reliance on social media for social interaction.","translation":"技術悲観主義者として、彼女は社会的な交流のためにソーシャルメディアへの依存度が高まっていることを心配している。","type":"noun","meaning_category":"技術悲観主義者"},{"sentence":"His technology-pessimist views made him hesitant to adopt new software at work.","translation":"彼の技術悲観的な見方は、職場で新しいソフトウェアを採用することをためらわせた。","type":"adjective","meaning_category":"技術悲観的な"}]}