{"word":"snouted","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"鼻口部のある、鼻口部が発達した","english_definition":"Having a snout, especially a prominent or elongated one.","examples":[{"sentence":"The snouted weevil is a common pest in gardens.","translation":"鼻口部のあるゾウムシは、庭によくいる害虫です。"},{"sentence":"The snouted dolphin is easily recognizable.","translation":"鼻口部のあるイルカは簡単に見分けられます。"}],"collocations":["snouted animal","snouted beetle","long-snouted"],"synonyms":["beaked","muzzled","proboscidate"],"antonyms":[]}],"etymology":{"value":"Derived from the noun 'snout', meaning the projecting nose and mouth of an animal, with the addition of the suffix '-ed', indicating possession or having the characteristic of.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsnaʊtɪd/","syllables":"snout-ed"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms are 'more snouted' and 'most snouted', respectively, though these are rarely used."},"usage_notes":{"explanation":"'Snouted' is primarily a descriptive adjective used in zoology or general descriptions of animals to highlight the presence and shape of their snout. It's not commonly used in everyday conversation but is more likely to appear in scientific or descriptive writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The snouted person looked strange.","correct":"The person with a prominent nose looked strange.","note":"'Snouted' is generally reserved for animals, not humans. Using it to describe a person would be unusual and potentially offensive."}],"priority":"★☆☆"},"related_words":{"derivatives":["snout (noun): The projecting nose and mouth of an animal.","snouty (adjective): Resembling or having a snout."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'snouted' is a relatively uncommon adjective used to describe animals that have a prominent snout. It is most often found in scientific or descriptive contexts, rather than in everyday conversation. Understanding the meaning of 'snout' is essential to understanding 'snouted'."},"example_sentences":[{"sentence":"The tapir is a snouted mammal native to South America.","translation":"バクは南米原産の鼻口部のある哺乳類です。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"The long-snouted pipefish blends in with the seagrass.","translation":"鼻口部の長いヨウジウオは、アマモに溶け込んでいます。","type":"adjective","meaning_category":"Descriptive"}]}