{"word":"non-affixable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not able to have affixes (prefixes or suffixes) added to it.","english_definition":"Describing a word or morpheme to which affixes (prefixes or suffixes) cannot be added.","examples":[{"sentence":"The word 'the' is generally considered non-affixable.","translation":"単語「the」は一般的に接辞を付加できないと考えられる。"},{"sentence":"Determining whether a morpheme is non-affixable often depends on the specific linguistic theory being applied.","translation":"形態素が接辞を付加できないかどうかを判断することは、適用されている特定の言語理論に依存することが多い。"}],"collocations":["non-affixable word","non-affixable morpheme"],"synonyms":["uninflectable","invariable"],"antonyms":["affixable","inflectable"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'affixable'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.əˈfɪks.ə.bəl/","syllables":"non-af-fix-a-ble"},"inflection":{"notes":"As an adjective, 'non-affixable' does not have different forms for gender or number."},"usage_notes":{"explanation":"'Non-affixable' is a term used in linguistics to describe words or morphemes that cannot be modified by adding prefixes or suffixes. This is often due to the word's grammatical function or its inherent structure. Function words like articles and prepositions are often non-affixable.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The word 'cat' is non-affixable because it's a noun.","correct":"The word 'cat' is affixable because we can add a suffix to make 'cats'.","note":"Nouns can often be made plural by adding a suffix, so they are not always non-affixable."}],"priority":"★☆☆"},"related_words":{"derivatives":["affix","affixation","prefix","suffix","morpheme"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-affixable' is a technical term used in linguistics. It describes a word or part of a word (morpheme) that cannot have prefixes or suffixes added to it. This is usually because adding an affix would not make sense grammatically or would change the word's fundamental meaning. It's a concept typically discussed in advanced language studies."},"example_sentences":[{"sentence":"Function words are often considered to be inherently non-affixable.","translation":"機能語は、本質的に接辞を付加できないと考えられることが多い。","type":"adjective","meaning_category":"linguistics"},{"sentence":"The professor explained why certain closed-class words are non-affixable in English.","translation":"教授は、英語で特定の閉鎖クラスの単語に接辞を付加できない理由を説明した。","type":"adjective","meaning_category":"linguistics"}]}