{"word":"Paramyotonia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学) 寒冷によって誘発される筋肉硬直を特徴とする、まれな遺伝性疾患","english_definition":"A rare inherited muscle disorder characterized by muscle stiffness induced by cold.","examples":[{"sentence":"Paramyotonia is often associated with mutations in the SCN4A gene.","translation":"先天性ミオトニアは、多くの場合、SCN4A遺伝子の変異と関連しています。"},{"sentence":"Symptoms of paramyotonia can include muscle stiffness and weakness that worsen with exposure to cold temperatures.","translation":"先天性ミオトニアの症状には、低温にさらされると悪化する筋肉のこわばりや脱力感などがあります。"}],"collocations":["paramyotonia congenita","SCN4A gene mutation","muscle stiffness","cold-induced paralysis"],"synonyms":["Eulenburg disease"],"antonyms":[]}],"etymology":{"value":"The term \"paramyotonia\" is derived from the Greek words \"para\" (beside, near), \"myo\" (muscle), and \"tonia\" (tone), indicating an abnormal muscle tone.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəˌmaɪəˈtoʊniə/","syllables":"par-a-my-o-to-ni-a"},"inflection":{"noun_plural":"paramyotonias"},"usage_notes":{"explanation":"Paramyotonia is a specific type of myotonia characterized by cold sensitivity. The muscle stiffness typically worsens with repeated movements (paradoxical myotonia). It is important to distinguish paramyotonia from other myotonic disorders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Paramyotonia is caused by a virus.","correct":"✓ Paramyotonia is a genetic disorder.","note":"Paramyotonia is a genetic condition, not caused by a virus or infection."}],"priority":"★★☆"},"related_words":{"derivatives":["myotonia","myotonic","congenita"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Paramyotonia is a rare genetic muscle disorder characterized by cold-induced muscle stiffness. Symptoms worsen with cold exposure and repeated movements. It's caused by mutations in genes like SCN4A. Diagnosis requires genetic testing and clinical evaluation to differentiate it from other myotonic conditions."},"example_sentences":[{"sentence":"The patient experienced severe muscle stiffness after exposure to cold, consistent with paramyotonia.","translation":"患者は寒さにさらされた後、重度の筋肉のこわばりを経験し、先天性ミオトニアと一致した。","type":"medical","meaning_category":"muscle disorder"},{"sentence":"Genetic testing confirmed the presence of the SCN4A mutation associated with paramyotonia congenita.","translation":"遺伝子検査により、先天性ミオトニアに関連するSCN4A変異の存在が確認された。","type":"genetic","meaning_category":"genetic disorder"}]}