{"word":"burrheaded","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having hair that is rough, bristly, or unkempt, resembling the texture of a burr.","english_definition":"Descriptive of hair that is rough, bristly, or unkempt, often compared to the texture of a burr.","examples":[{"sentence":"The boy had a burrheaded appearance after playing outside all day.","translation":"その少年は一日中外で遊んだ後、髪がぼさぼさになっていた。"},{"sentence":"He was described as a tough, burrheaded man.","translation":"彼はタフで、髪の毛がごわごわした男だと描写された。"}],"collocations":["burrheaded boy","burrheaded appearance","tough burrheaded man"],"synonyms":["bristly-haired","rough-haired","unruly-haired","unkempt-haired"],"antonyms":["sleek-haired","smooth-haired","well-groomed"],"notes":"This term is often used to describe a rugged or unrefined appearance."}],"etymology":{"value":"Derived from the combination of 'burr' (a prickly seed covering or rough projection) and 'headed' (having a head or hair). The term suggests a resemblance between the hair's texture and the prickly surface of a burr.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɜːrˌhɛdɪd/","syllables":"burr-head-ed"},"inflection":{"notes":"This word is an adjective and does not have different inflectional forms."},"usage_notes":{"explanation":"The term 'burrheaded' is not commonly used in modern English. It is somewhat archaic and might be found more frequently in older literature or regional dialects. It is descriptive and often implies a certain roughness or lack of refinement in appearance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a burrhead person.","correct":"He is a burrheaded person.","note":"The correct form is 'burrheaded,' not 'burrhead'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["burr","head"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The term is not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'burrheaded' is a relatively uncommon adjective used to describe hair that is rough, bristly, and unkempt, resembling the texture of a burr. It suggests a rugged or unrefined appearance. Due to its infrequent use, it is more likely to be encountered in older texts or regional dialects. Understanding the word requires familiarity with the term 'burr,' which refers to a prickly seed covering or rough projection."},"example_sentences":[{"sentence":"The farmer, a burrheaded old man, greeted us warmly.","translation":"その農夫は、髪の毛がごわごわした老人で、私たちを温かく迎えてくれた。","type":"adjective","meaning_category":"appearance"}]}