{"word":"Epeans","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(古代ギリシア) エペイオス人：古代ギリシアの地域であるエリスに住んでいた人々。ホメロスの叙事詩『イリアス』では、彼らはトロイア戦争に参加したギリシア軍の一部として言及されている。","english_definition":"(Ancient Greece) The people who inhabited Elis, a region in ancient Greece. In Homer's Iliad, they are mentioned as part of the Greek forces that participated in the Trojan War.","examples":[{"sentence":"The Epeans were known for their equestrian skills.","translation":"エペイオス人は馬術の技能で知られていた。"},{"sentence":"According to Homer, the Epeans sailed to Troy to fight alongside the other Greeks.","translation":"ホメロスによれば、エペイオス人は他のギリシア人と共に戦うためにトロイアへ航海した。"}],"collocations":["Epean warrior","Epean territory","Ancient Epeans"],"synonyms":["Elians"],"antonyms":[]}],"etymology":{"value":"The name 'Epeans' comes from 'Epeius' (Ancient Greek: Ἐπειός), a mythical king of Elis.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈpiːənz/","syllables":"E-pe-ans"},"inflection":{"noun_plural":"Epeans (always plural as it refers to a people)"},"usage_notes":{"explanation":"'Epeans' refers specifically to the ancient people of Elis. It is primarily encountered in historical or literary contexts related to ancient Greece, particularly when discussing the Trojan War as depicted in Homer's Iliad. The term is not commonly used in modern English outside of these specific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Epean is a citizen of Elis.","correct":"✓ An Epean was a citizen of Elis.","note":"'Epean' is almost exclusively used in the plural to refer to the people as a whole, not as a singular individual in modern English. When referring to an individual, use 'a person from Elis' or specify their role or name."}],"priority":"★★☆"},"related_words":{"derivatives":["Epeius (mythical king of Elis)","Elis (region in ancient Greece)"],"historical_terms":["Mycenaeans","Achaeans","Dorians","Ionians"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare - primarily historical/literary context)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 主に古代史関連の文献に登場。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Epeans' is highly specialized and primarily encountered in the context of ancient Greek history and literature, specifically when discussing the inhabitants of Elis and their role in events like the Trojan War as described by Homer. Due to its limited usage and historical specificity, it is not part of common vocabulary and requires a solid understanding of ancient Greek history to comprehend fully."},"example_sentences":[{"sentence":"The contingent of Epeans fought bravely at Troy.","translation":"エペイオス人の一団はトロイアで勇敢に戦った。","type":"historical context","meaning_category":"Trojan War"},{"sentence":"Archaeological evidence suggests the Epeans had a distinct culture.","translation":"考古学的証拠は、エペイオス人が独特の文化を持っていたことを示唆している。","type":"historical context","meaning_category":"Ancient Greece"}]}