{"word":"vice-marred","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a person, place, or thing) damaged or corrupted by vice; showing the negative effects of immoral or wicked behavior.","english_definition":"Damaged or spoiled by immoral or wicked behavior.","examples":[{"sentence":"The vice-marred city was a stark contrast to its former glory.","translation":"悪徳によって荒廃したその都市は、かつての栄光とは対照的だった。"},{"sentence":"His vice-marred soul was beyond redemption.","translation":"彼の悪徳に染まった魂は、もはや救いようがなかった。"},{"sentence":"The once beautiful painting was now vice-marred, reflecting the artist's descent into depravity.","translation":"かつては美しかった絵画は、今や悪徳に染まり、芸術家の堕落を反映していた。"}],"collocations":["vice-marred city","vice-marred soul","vice-marred society","vice-marred reputation","vice-marred character"],"synonyms":["corrupted","tainted","debased","degraded","spoiled","damaged","blemished","defiled"],"antonyms":["virtuous","pure","untarnished","unblemished","wholesome","moral","righteous"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"vice\" (immoral or wicked behavior) and \"marred\" (damaged or spoiled). The term suggests that the subject has been negatively affected or ruined by the presence or influence of vice.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvaɪsˌmɑːrd/","syllables":"vice-marred"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Vice-marred\" is a descriptive adjective used to convey that something has been negatively impacted or ruined by immoral or wicked behavior. It is often used in literature or formal writing to create a vivid and evocative image of decay, corruption, or moral degradation. The term is relatively uncommon in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The vice-marred is a bad thing.","correct":"✓ A vice-marred society is a bad thing.","note":"\"Vice-marred\" is an adjective and must be used to describe a noun. It cannot stand alone as a noun."},{"incorrect":"✗ He vice-marred the painting.","correct":"✓ The painting was vice-marred by his actions.","note":"\"Vice-marred\" is an adjective, not a verb. Use it to describe something that has been affected by vice, not as an action."}],"priority":"★★☆"},"related_words":{"derivatives":["vice (noun): immoral or wicked behavior","marred (adjective): damaged or spoiled"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - The term is not commonly used in everyday language.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"vice-marred\" is a sophisticated adjective used to describe something that has been damaged or corrupted by immoral or wicked behavior. It is not commonly used in everyday language and is more often found in literature or formal writing. Understanding the meaning of \"vice\" (immoral behavior) and \"marred\" (damaged) is essential to comprehending the term. Its usage often implies a strong negative judgment or a sense of moral decay."},"example_sentences":[{"sentence":"The city's vice-marred streets were filled with despair and hopelessness.","translation":"その都市の悪徳に染まった通りは、絶望と希望のなさで満たされていた。","type":"adjective","meaning_category":"corrupted"},{"sentence":"The politician's vice-marred reputation made it impossible for him to win the election.","translation":"その政治家の悪徳に染まった評判は、彼が選挙に勝つことを不可能にした。","type":"adjective","meaning_category":"tainted"},{"sentence":"The once-pristine forest was now vice-marred by illegal logging and pollution.","translation":"かつては手つかずだった森は、今や違法伐採と汚染によって荒廃していた。","type":"adjective","meaning_category":"damaged"}]}