{"word":"apogeic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"遠地点の、遠地点に関する","english_definition":"Relating to or situated at the apogee.","examples":[{"sentence":"The rocket reached its apogeic altitude.","translation":"ロケットは遠地点高度に達した。"}],"collocations":["apogeic altitude","apogeic point"],"synonyms":["apogean"],"antonyms":["perigeic"]},{"part_of_speech":"adjective","definition":"遠地点にある、最も遠い","english_definition":"At or near the apogee; farthest away.","examples":[{"sentence":"The satellite was in an apogeic position.","translation":"その衛星は遠地点の位置にあった。"}],"collocations":["apogeic position","apogeic distance"],"synonyms":["farthest","most distant"],"antonyms":["closest"]}],"etymology":{"value":"Derived from 'apogee' (the point in the orbit of the moon or a satellite at which it is furthest from the earth) with the addition of the suffix '-ic' (relating to).","priority":"★★★"},"pronunciation":{"ipa":"/ˌæpəˈdʒiːɪk/","syllables":"a-po-ge-ic"},"inflection":{"notes":"This is an adjective and does not inflect like a verb or noun."},"usage_notes":{"explanation":"'Apogeic' is a relatively uncommon term primarily used in the context of astronomy, astronautics, and related fields. It specifically describes something related to or located at the apogee, which is the point in an orbit farthest from the Earth (or another body being orbited). It is often used to describe altitudes, positions, or events occurring at or near the apogee.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The apogeic of the rocket was very high.","correct":"✓ The apogee of the rocket was very high.","note":"'Apogeic' is an adjective, so it should be used to describe something. 'Apogee' is the noun referring to the point itself."}],"priority":"★★☆"},"related_words":{"derivatives":["apogee"],"phrasal_verbs":[],"related_terms":["perigee","orbit","altitude","satellite"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'apogeic' is a technical term primarily used in fields such as astronomy and astronautics. It describes something related to or situated at the apogee, which is the point in an orbit farthest from the Earth. Understanding this term requires familiarity with orbital mechanics and related scientific concepts. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The spacecraft reached its apogeic point before initiating the engine burn.","translation":"宇宙船はエンジン燃焼を開始する前に遠地点に達した。","type":"general","meaning_category":"遠地点の"},{"sentence":"The apogeic altitude of the satellite's orbit was adjusted to improve coverage.","translation":"衛星軌道の遠地点高度は、カバレッジを向上させるために調整された。","type":"technical","meaning_category":"遠地点の"}]}