{"word":"polyharmonic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"多重調和の、多重倍音の","english_definition":"Relating to or characterized by multiple harmonics or harmonic relationships.","examples":[{"sentence":"The polyharmonic tones created a rich and complex sound.","translation":"多重倍音の音色が、豊かで複雑なサウンドを作り出した。"},{"sentence":"The composer explored polyharmonic textures in his latest symphony.","translation":"作曲家は最新の交響曲で多重調和のテクスチャを探求した。"}],"collocations":["polyharmonic sound","polyharmonic texture","polyharmonic analysis"],"synonyms":["multiharmonic","overtone-rich"],"antonyms":["monoharmonic"],"notes":"Often used in the context of music, acoustics, or signal processing."}],"etymology":{"value":"Derived from the Greek words 'poly' (meaning 'many') and 'harmonic' (relating to harmony or harmonics).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒlihɑːrˈmɒnɪk/","syllables":"pol-y-har-mon-ic"},"inflection":{"notes":"Does not inflect (only used as an adjective)."},"usage_notes":{"explanation":"The term 'polyharmonic' is used to describe sounds or systems that contain multiple harmonics or have complex harmonic relationships. It is often used in music theory to describe chords or passages that use multiple keys or tonal centers simultaneously. In physics and engineering, it can refer to signals or systems that contain multiple frequencies that are integer multiples of a fundamental frequency.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The polyharmonic function was easy to solve.","correct":"✓ The harmonic function was easy to solve.","note":"'Polyharmonic' is typically used to describe sounds or musical textures, not mathematical functions. Use 'harmonic' for functions related to harmonic analysis."}],"priority":"★☆☆"},"related_words":{"derivatives":["polyharmonicity (noun)"],"related_terms":["harmonic","harmonicity","overtone","fundamental frequency"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polyharmonic' is a technical term primarily used in music theory, acoustics, and signal processing. It describes something that involves multiple harmonics or harmonic relationships. Understanding this term requires familiarity with the concept of harmonics, which are frequencies that are integer multiples of a fundamental frequency. It is not a commonly used word in everyday language."},"example_sentences":[{"sentence":"The synthesizer was capable of generating complex polyharmonic waveforms.","translation":"そのシンセサイザーは複雑な多重倍音波形を生成することができた。","type":"general","meaning_category":"多重倍音の"},{"sentence":"The composer used polyharmonic techniques to create a sense of tonal ambiguity.","translation":"作曲家は多重調和の技法を用いて、調性の曖昧さを生み出した。","type":"music","meaning_category":"多重調和の"}]}