{"word":"stratig","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Geology) A stratigraphic unit.","english_definition":"A body of rock identified by its lithic properties or fossil content and position in relation to other rock strata.","examples":[{"sentence":"The stratig was identified as being from the Jurassic period.","translation":"その地層単位はジュラ紀のものと特定された。"}],"collocations":[],"synonyms":["stratum","layer","bed"],"antonyms":[]},{"part_of_speech":"adj","definition":"Pertaining to stratigraphy.","english_definition":"Relating to the branch of geology that studies rock layers (strata) and layering.","examples":[{"sentence":"The stratig analysis revealed important information about the region's geological history.","translation":"その層序学的分析は、その地域の地質学的歴史に関する重要な情報を明らかにした。"}],"collocations":[],"synonyms":["stratigraphic"],"antonyms":[]}],"etymology":{"value":"Likely a shortened or informal form of 'stratigraphic' or 'stratigraphy'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstrætɪɡ/","syllables":"stra-tig"},"inflection":{},"usage_notes":{"explanation":"'Stratig' is not a standard or widely recognized word in English. It appears to be an informal abbreviation of 'stratigraphic' (adjective) or a shortened form referring to a 'stratigraphic unit' (noun). Its usage is primarily within geological contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The stratig was very interesting, it had many layers.","correct":"✓ The stratigraphic analysis was very interesting, it revealed many layers.","note":"Use 'stratigraphic' as an adjective to describe the analysis, rather than using the abbreviated 'stratig'."}],"priority":"★★★"},"related_words":{"derivatives":["stratigraphy","stratigraphic","strata","stratum"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (not a standard word)","frequency_google_ngram":"Low","priority":"★★★"},"readability_explanation":{"level":"C2","text":"'Stratig' is a highly specialized term, primarily used within the field of geology. It is not a standard English word but rather an informal abbreviation. Understanding its meaning requires familiarity with geological concepts, particularly those related to stratigraphy and stratigraphic units. Therefore, its readability is limited to those with expertise in this area."},"example_sentences":[{"sentence":"The stratig unit showed a clear boundary.","translation":"その地層単位は明確な境界を示していた。","type":"noun","meaning_category":"Geology"},{"sentence":"We conducted a stratig study of the area.","translation":"我々はその地域の層序学的研究を行った。","type":"adjective","meaning_category":"Geology"}]}