{"word":"pathogeny","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"病原発生、病因論、発病機序","english_definition":"the origination and development of a disease.","examples":[{"sentence":"The pathogeny of the disease is still not fully understood.","translation":"その病気の病原発生はまだ完全には解明されていません。"},{"sentence":"Research into the pathogeny of cancer is ongoing.","translation":"癌の病原発生に関する研究が進行中です。"}],"collocations":["study of pathogeny (病原発生の研究)","understand the pathogeny (病原発生を理解する)"],"synonyms":["pathogenesis","etiology","disease development"],"antonyms":["health","wellness"]}],"etymology":{"value":"From Greek 'pathos' (suffering, disease) + 'genesis' (origin, creation).","priority":"★★★"},"pronunciation":{"ipa":"/pæˈθɒdʒəni/","syllables":"pa-thog-e-ny"},"inflection":{"noun_plural":"pathogenies"},"usage_notes":{"explanation":"'Pathogeny' refers to the biological mechanism or process that leads to the development of a disease. It is often used in medical and scientific contexts. It is closely related to 'pathogenesis', which is often used interchangeably, although 'pathogeny' can sometimes refer more specifically to the initial stages of disease development.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pathogeny is caused by a virus.","correct":"✓ The pathogeny is a process caused by a virus.","note":"'Pathogeny' is the process itself, not the cause. The cause is the pathogen or factor that initiates the process."}],"priority":"★★☆"},"related_words":{"derivatives":["pathogenic (adjective: 病原性の)","pathogenesis (noun: 病原発生)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pathogeny' is a technical term used in medicine and biology to describe how a disease develops. It's a complex concept that involves understanding the causes and mechanisms of disease. You'll typically encounter this word in scientific papers, medical textbooks, or discussions among healthcare professionals.","priority":"★★☆"},"example_sentences":[{"sentence":"Understanding the pathogeny of Alzheimer's disease is crucial for developing effective treatments.","translation":"アルツハイマー病の病原発生を理解することは、効果的な治療法を開発するために非常に重要です。","type":"general","meaning_category":"disease development"},{"sentence":"The study focused on the pathogeny of bacterial infections in immunocompromised patients.","translation":"その研究は、免疫不全患者における細菌感染の病原発生に焦点を当てました。","type":"medical","meaning_category":"disease development"}]}