{"word":"Monoptera","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A circular building with a single roof, supported by columns.","english_definition":"A circular building or structure, usually a pavilion, with a single roof supported by a circle of columns.","examples":[{"sentence":"The monoptera stood gracefully in the garden, offering shade and a focal point.","translation":"モノプテロスは庭園に優雅に立ち、日陰と焦点を提供していた。"}],"collocations":["classical monoptera","garden monoptera"],"synonyms":["tholos","rotunda","pavilion"],"antonyms":[]}],"etymology":{"value":"From Greek 'monos' (single) + 'pteron' (wing, feather, but here referring to a colonnade or surrounding columns).","priority":"★★☆"},"pronunciation":{"ipa":"/məˈnɒptərə/","syllables":"mo-nop-te-ra"},"inflection":{"noun_plural":"monopteras or monoptera"},"usage_notes":{"explanation":"A monoptera is typically a small, open structure and is often found in gardens or parks as a decorative element.  It differs from a tholos in that a tholos may have walls, while a monoptera is essentially just a roof supported by columns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The monoptera was full enclosed with walls.","correct":"✓ The monoptera is characterized by its open design without walls.","note":"Monopteras are defined by their lack of walls. A structure with walls would be a tholos or other type of building."}],"priority":"★★☆"},"related_words":{"derivatives":["monopteral (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monoptera' is a specialized architectural term referring to a circular structure with a roof supported by columns and no walls.  Understanding requires familiarity with architectural vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The architect designed a beautiful monoptera for the estate's landscaping.","translation":"建築家は、地所の景観のために美しいモノプテロスを設計した。","type":"noun","meaning_category":"architecture"},{"sentence":"Visitors often rested in the shade of the park's monoptera.","translation":"訪問者はしばしば公園のモノプテロスの日陰で休憩した。","type":"noun","meaning_category":"structure"}]}