{"word":"nonbookish","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"本好きでない、読書家でない、書斎的でない","english_definition":"Not devoted to reading or study; not characteristic of someone who is fond of books or learning.","examples":[{"sentence":"He had a nonbookish upbringing, spending more time outdoors than in libraries.","translation":"彼は本に親しむ環境で育たず、図書館よりも屋外で過ごす時間が多かった。"},{"sentence":"She preferred nonbookish pursuits like sports and socializing.","translation":"彼女はスポーツや社交など、読書以外の活動を好んだ。"},{"sentence":"The article described him as a nonbookish intellectual, more interested in practical matters than abstract theories.","translation":"その記事は彼を、抽象的な理論よりも実際的な問題に関心のある、書斎的でない知識人として描写した。"}],"collocations":["nonbookish activities","nonbookish interests","nonbookish person","nonbookish pursuits","nonbookish upbringing"],"synonyms":["unintellectual","unacademic","unstudious","unschooled","illiterate","unlearned","practical","pragmatic","active"],"antonyms":["bookish","studious","academic","intellectual","scholarly","learned","literate"]},{"part_of_speech":"adjective","definition":"本に出てこない、教科書的でない、形式ばらない","english_definition":"Not found in books; not formal or textbook-like.","examples":[{"sentence":"The guide offered nonbookish advice on how to navigate the city.","translation":"そのガイドは、街を歩き回るための教科書的でないアドバイスを提供した。"},{"sentence":"She used a nonbookish approach to teaching, focusing on hands-on activities.","translation":"彼女は実践的な活動に焦点を当て、教科書的でない教育方法を用いた。"},{"sentence":"The presentation included nonbookish examples to make the concepts more relatable.","translation":"プレゼンテーションには、概念をより身近に感じさせるために、形式ばらない例が含まれていた。"}],"collocations":["nonbookish advice","nonbookish approach","nonbookish examples","nonbookish language","nonbookish style","nonbookish methods"],"synonyms":["informal","unconventional","unorthodox","practical","real-world","experiential","hands-on","applied"],"antonyms":["formal","conventional","orthodox","theoretical","textbook","academic","bookish"]}],"etymology":{"value":"Formed by adding the prefix \"non-\" (meaning \"not\") to the word \"bookish.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈbʊkɪʃ/","syllables":"non-book-ish"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with 'nonbookish'."},"usage_notes":{"explanation":"\"Nonbookish\" is used to describe something or someone that is not related to books or formal learning. It can refer to a person who prefers activities other than reading or studying, or to a style or approach that is informal and practical rather than academic or theoretical. The word often implies a preference for real-world experience over book knowledge.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very non-bookish.","correct":"✓ He is very nonbookish.","note":"\"Nonbookish\" is an adjective and should be used to describe a noun. The article 'a' is not needed before the adjective when describing a quality of a person."},{"incorrect":"✗ nonbookish person is good for outdoor.","correct":"✓ A nonbookish person is good for outdoor activities.","note":"When referring to a general type of person, use the indefinite article 'a' or 'an' before the noun. Also, 'outdoor' should be 'outdoor activities' to be more specific."}],"priority":"★★☆"},"related_words":{"derivatives":["bookish (adjective)","book (noun)"],"antonyms":["bookish (adjective)","academic (adjective)","studious (adjective)","intellectual (adjective)","scholarly (adjective)","learned (adjective)"],"related_concepts":["practical intelligence","street smarts","experiential learning","hands-on experience"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonbookish\" is relatively uncommon and implies a contrast to someone or something that is associated with books, learning, or academic pursuits. It suggests a preference for practical experience, real-world knowledge, or activities that are not related to formal education. Understanding this word requires a good vocabulary and an ability to recognize the nuances of prefixes like \"non-\". It is more likely to be encountered in written texts or discussions about education, lifestyles, or personality traits."},"example_sentences":[{"sentence":"His nonbookish nature made him excel in hands-on trades.","translation":"彼の本好きでない性質が、実践的な職業で優れた能力を発揮させた。","type":"adjective","meaning_category":"本好きでない"},{"sentence":"She took a nonbookish approach to learning, preferring to learn by doing.","translation":"彼女は教科書的でない学習方法を取り、実践を通して学ぶことを好んだ。","type":"adjective","meaning_category":"教科書的でない"},{"sentence":"Despite his nonbookish background, he became a successful entrepreneur.","translation":"本好きでない経歴にもかかわらず、彼は成功した起業家になった。","type":"adjective","meaning_category":"本好きでない"},{"sentence":"The course offered a nonbookish alternative to traditional education.","translation":"そのコースは、伝統的な教育に代わる教科書的でない選択肢を提供した。","type":"adjective","meaning_category":"教科書的でない"}]}