{"word":"trapanner","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, historical) A person who uses a trepan (a surgical instrument with a drill-like action) to create a hole in the skull; a trepanner.","english_definition":"A person who performs trepanation.","examples":[{"sentence":"The ancient trapanner skillfully used flint tools to perform the delicate procedure.","translation":"古代の穿頭術者は、巧みに燧石の道具を使って、その繊細な手術を行った。"}],"collocations":["skilled trapanner","ancient trapanner"],"synonyms":["trepanner","trephiner"],"antonyms":[]}],"etymology":{"value":"Derived from 'trepan' (a surgical instrument for cutting out a round piece of the skull) + '-er' (suffix denoting a person who performs an action).","priority":"★★☆"},"pronunciation":{"ipa":"/trɪˈpænər/","syllables":"tra-pan-ner"},"inflection":{"noun_plural":"trapanners"},"usage_notes":{"explanation":"The term 'trapanner' is relatively rare. The more common term is 'trepanner'. Both refer to someone who performs trepanation, an ancient surgical procedure involving drilling or scraping a hole into the skull. The procedure was historically used for various reasons, including treating head injuries and mental disorders, but its efficacy is debated.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The trapanner used a trephine to trapan the skull.","correct":"✓ The trapanner used a trepan to trepan the skull.","note":"While 'trephine' is a related term, 'trepan' is the more common term for the instrument itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["trepanation (noun: the act of trepanning)","trepan (noun: the instrument used for trepanning; verb: to perform trepanation)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'trapanner' is a rare and historical term. Understanding it requires knowledge of the surgical procedure called trepanation and the instruments used in it. Due to its specialized nature and infrequent use, it is not typically encountered in general English texts."},"example_sentences":[{"sentence":"Archaeological evidence suggests that trapanners practiced their craft as early as the Neolithic period.","translation":"考古学的な証拠は、穿頭術者が新石器時代にはすでにその技術を実践していたことを示唆している。","type":"noun","meaning_category":"person performing trepanation"}]}