{"word":"raciality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"人種性、人種意識、人種的特性","english_definition":"The state of being racial; the condition of belonging to a particular race or ethnic group; awareness of race or racial identity; the quality of being racial.","examples":[{"sentence":"The study explored the impact of raciality on educational opportunities.","translation":"その研究は、人種性が教育機会に与える影響を調査した。"},{"sentence":"Her raciality was a significant part of her identity.","translation":"彼女の人種性は、彼女のアイデンティティの重要な部分だった。"},{"sentence":"The museum exhibit examined the construction of raciality throughout history.","translation":"その博物館の展示は、歴史を通しての人種性の構築を検証した。"}],"collocations":["impact of raciality","construction of raciality","awareness of raciality","experience of raciality"],"synonyms":["race","ethnicity","racial identity","racial consciousness"],"antonyms":["colorblindness","post-racialism"]}],"etymology":{"value":"Formed from 'racial' + '-ity'. 'Racial' comes from 'race' + '-al'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌreɪʃiˈæləti/","syllables":"ra-ci-al-i-ty"},"inflection":{"noun_plural":"racialities"},"usage_notes":{"explanation":"'Raciality' refers to the condition or quality of being racial. It encompasses the awareness, experience, and social construction of race. It is often used in academic and sociological contexts to analyze the impact of race on individuals and society. Unlike 'race,' which can refer to a specific group, 'raciality' emphasizes the state or quality of being racialized.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The raciality of the population is diverse races.","correct":"✓ The racial composition of the population is diverse.","note":"'Raciality' refers to the state of being racial, not the diversity of races. Use 'racial composition' or 'racial diversity' instead."},{"incorrect":"✗ He showed raciality towards his colleagues.","correct":"✓ He showed racial bias/prejudice towards his colleagues.","note":"'Raciality' isn't used to describe bias or prejudice. Use 'racial bias' or 'racial prejudice' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["racial","racialize","racialized"],"phrases":["racial identity","racial awareness","racial consciousness"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency compared to 'race' or 'ethnicity'. Primarily used in academic and sociological contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Raciality' is a term often used in academic and sociological discussions to describe the condition or quality of being racial. It involves understanding how race is constructed, experienced, and impacts individuals and society. It is a more abstract concept than 'race' itself, focusing on the state of being racial rather than simply identifying racial groups. Understanding this term is useful for analyzing social issues related to race and identity."},"example_sentences":[{"sentence":"The conference addressed the complexities of raciality in the 21st century.","translation":"その会議は、21世紀における人種性の複雑さを扱った。","type":"noun","meaning_category":"人種性"},{"sentence":"Scholars argue that raciality is a social construct rather than a biological reality.","translation":"学者たちは、人種性は生物学的な現実というよりも社会的な構築物であると主張している。","type":"noun","meaning_category":"人種性"},{"sentence":"The study examined the impact of perceived raciality on employment opportunities.","translation":"その研究は、認識された人種性が雇用機会に与える影響を調査した。","type":"noun","meaning_category":"人種性"}]}