{"word":"innovation-oriented","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"革新志向の、革新重視の、イノベーションを重視する","english_definition":"Focused on or driven by innovation; prioritizing the development and implementation of new ideas, methods, or products.","examples":[{"sentence":"The company is becoming increasingly innovation-oriented in its approach to product development.","translation":"その会社は、製品開発への取り組みにおいて、ますます革新志向になっている。"},{"sentence":"An innovation-oriented culture is crucial for staying competitive in today's market.","translation":"今日の市場で競争力を維持するためには、革新志向の文化が不可欠である。"},{"sentence":"The government is promoting innovation-oriented policies to boost economic growth.","translation":"政府は経済成長を促進するために、革新志向の政策を推進している。"}],"collocations":["innovation-oriented company (革新志向の会社)","innovation-oriented culture (革新志向の文化)","innovation-oriented policy (革新志向の政策)","innovation-oriented strategy (革新志向の戦略)","innovation-oriented approach (革新志向のアプローチ)"],"synonyms":["innovative","forward-thinking","progressive","cutting-edge","groundbreaking","pioneering"],"antonyms":["traditional","conservative","conventional","status quo-oriented"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'innovation' (the introduction of something new) and 'oriented' (directed toward or focused on).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪnəˈveɪʃən ˈɔːriˌentɪd/","syllables":"in-no-va-tion o-ri-en-ted"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms."},"usage_notes":{"explanation":"'Innovation-oriented' describes entities (companies, organizations, individuals, etc.) that actively seek out and prioritize innovation in their operations, strategies, and culture. It implies a proactive approach to developing and adopting new ideas, methods, and technologies to improve performance, gain a competitive advantage, or address emerging challenges. It is often used in business, technology, and policy contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is innovation oriented.","correct":"✓ The company is innovation-oriented.","note":"It's important to include the hyphen to correctly form the compound adjective. "},{"incorrect":"✗ He is a very innovation person.","correct":"✓ He is a very innovation-oriented person.","note":"'Innovation' is a noun. You need the adjective 'innovation-oriented' to describe the person."}],"priority":"★★☆"},"related_words":{"derivatives":["innovation (noun)","innovate (verb)","innovator (noun)","orientation (noun)"],"related_terms":["technology-oriented","market-oriented","customer-oriented","future-oriented"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in business and technology contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Innovation-oriented' is a term used to describe something that prioritizes or is focused on innovation. Innovation means introducing new ideas, methods, or products. So, if a company is 'innovation-oriented,' it means that they are actively trying to find new and better ways of doing things. This term is commonly used in business and technology to describe companies or strategies that are forward-thinking and focused on progress.","priority":"★★★"},"example_sentences":[{"sentence":"The university is striving to become more innovation-oriented in its research programs.","translation":"その大学は、研究プログラムにおいて、より革新志向になるよう努めている。","type":"adjective","meaning_category":"革新志向の"},{"sentence":"We need innovation-oriented leaders who can drive change within the organization.","translation":"組織内で変化を推進できる革新志向のリーダーが必要だ。","type":"adjective","meaning_category":"革新志向の"},{"sentence":"The fund supports innovation-oriented startups in the renewable energy sector.","translation":"そのファンドは、再生可能エネルギー分野の革新志向のスタートアップを支援している。","type":"adjective","meaning_category":"革新志向の"}]}