{"word":"shanksman","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(archaic, humorous) someone who travels on foot; a walker or pedestrian.","english_definition":"A person who travels on foot; a pedestrian. (Archaic or humorous)","examples":[{"sentence":"He preferred to be a shanksman and explore the countryside at his own pace.","translation":"彼は自分のペースで田舎を探索するために徒歩旅行者であることを好んだ。"},{"sentence":"In those days, many were shanksmen, as horses and carriages were expensive.","translation":"当時、馬や馬車は高価だったので、多くの人が徒歩旅行者だった。"}],"collocations":["go as a shanksman","travel as a shanksman"],"synonyms":["pedestrian","walker","foot traveler","hiker"],"antonyms":["motorist","rider"],"notes":"The term is somewhat archaic and humorous. It emphasizes the act of traveling by foot, often over long distances."}],"etymology":{"value":"Derived from \"shank\" (the part of the leg from the knee to the ankle) + \"-s-man\" (a suffix indicating a person associated with something). The term literally refers to someone who uses their shanks (legs) to travel.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃæŋksmən/","syllables":"shanks-man"},"inflection":{"noun_plural":"shanksmen"},"usage_notes":{"explanation":"The word 'shanksman' is not commonly used in modern English. It is considered archaic or humorous. When referring to someone who walks, 'pedestrian,' 'walker,' or 'hiker' are more common and neutral terms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He arrived by shanksman.","correct":"✓ He arrived on foot.","note":"It's more common to say 'He arrived on foot' rather than 'He arrived by shanksman' because the latter sounds archaic."}],"priority":"☆☆☆"},"related_words":{"derivatives":["shank (noun: the part of the leg from the knee to the ankle)"],"phrases":["shank's mare (one's own legs as a means of transport)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'shanksman' is an uncommon and somewhat archaic term for someone who travels on foot. It is not typically used in modern conversation or writing. More common terms like 'pedestrian' or 'walker' are generally preferred. Understanding this word is more for historical or literary context than for everyday use."},"example_sentences":[{"sentence":"The weary shanksman finally reached the village after a long day's journey.","translation":"疲れた徒歩旅行者は、長い一日の旅の後、ついに村に到着した。","type":"noun","meaning_category":"travel"},{"sentence":"He decided to be a shanksman for a week, exploring the countryside without relying on any vehicles.","translation":"彼は一週間徒歩旅行者になることを決意し、いかなる乗り物にも頼らずに田舎を探索した。","type":"noun","meaning_category":"travel"}]}