{"word":"Pharisaicalness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"偽善的な性質、形式主義、独善","english_definition":"The characteristic of being a Pharisee; hypocrisy; rigid adherence to the letter of the law without regard to its spirit; formalism; self-righteousness.","examples":[{"sentence":"His pharisaicalness was evident in his constant judgment of others.","translation":"彼の偽善的な性質は、他人を常に批判することで明らかだった。"},{"sentence":"The pharisaicalness of the religious leaders was criticized by Jesus.","translation":"宗教指導者たちの形式主義はイエスによって批判された。"},{"sentence":"She tried to avoid any appearance of pharisaicalness in her dealings with people.","translation":"彼女は人との付き合いにおいて、いかなる偽善的な外見も避けようとした。"}],"collocations":["religious pharisaicalness (宗教的な偽善)","moral pharisaicalness (道徳的な偽善)","avoid pharisaicalness (偽善を避ける)","condemn pharisaicalness (偽善を非難する)"],"synonyms":["hypocrisy","sanctimony","self-righteousness","formalism","dogmatism","bigotry"],"antonyms":["sincerity","genuineness","authenticity","humility","honesty"]}],"etymology":{"value":"Derived from 'Pharisaical,' which comes from 'Pharisee.' The Pharisees were a Jewish religious group known for their strict adherence to religious law. The suffix '-ness' turns the adjective into a noun.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfærɪˈseɪɪkəlnəs/","syllables":"Phar-i-sai-i-cal-ness"},"inflection":{"noun_plural":"None (uncountable noun)"},"usage_notes":{"explanation":"'Pharisaicalness' is a noun that describes the quality or state of being like a Pharisee in a negative sense, characterized by hypocrisy, strict adherence to outward forms of religion or morality without genuine inner conviction, and a tendency to judge others harshly. It is often used in religious or moral contexts to criticize those who appear righteous but lack true compassion or integrity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of pharisaicalness behavior.","correct":"✓ He showed a lot of pharisaicalness.","note":"'Pharisaicalness' is a noun, so it doesn't need 'behavior' after it. It already describes a type of behavior or quality. "},{"incorrect":"✗ Her pharisaicalness are obvious.","correct":"✓ Her pharisaicalness is obvious.","note":"'Pharisaicalness' is an uncountable noun, so it takes a singular verb ('is' instead of 'are')."}],"priority":"★★☆"},"related_words":{"derivatives":["Pharisee (名詞: パリサイ人)","Pharisaic (形容詞: パリサイ人の、形式主義の)","Pharisaical (形容詞: 偽善的な、形式主義的な)","Pharisaically (副詞: 偽善的に、形式的に)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare and specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pharisaicalness' is a complex and relatively rare word that describes the quality of being hypocritical or overly strict in following rules and rituals without genuine sincerity. It is derived from the Pharisees, a Jewish religious group known for their strict adherence to religious law. This word is typically used in advanced discussions about morality, religion, or ethics, and understanding it requires a strong vocabulary and comprehension of abstract concepts."},"example_sentences":[{"sentence":"The politician's pharisaicalness was exposed when his private actions contradicted his public statements.","translation":"政治家の偽善的な性質は、彼の私的な行動が公の声明と矛盾したときに暴露された。","type":"general","meaning_category":"hypocrisy"},{"sentence":"The novel critiques the pharisaicalness of the upper class.","translation":"その小説は上流階級の形式主義を批判している。","type":"literature","meaning_category":"formalism"},{"sentence":"The speaker warned against the dangers of pharisaicalness in religious practice.","translation":"講演者は宗教的実践における偽善の危険性について警告した。","type":"religion","meaning_category":"self-righteousness"}]}