{"word":"Rambo","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ランボー (映画の主人公)","english_definition":"A fictional character, a troubled and misunderstood Vietnam War veteran skilled in all forms of combat, who is the protagonist of the 'Rambo' film series.","examples":[{"sentence":"He's a real Rambo, always looking for a fight.","translation":"彼はまるでランボーだ、いつも喧嘩腰だ。"},{"sentence":"The character is often compared to Rambo because of his survival skills.","translation":"そのキャラクターはサバイバルスキルからランボーと比較されることが多い。"}],"collocations":["act like Rambo (ランボーのように振る舞う)","Rambo-style (ランボーのような)"],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"ランボーのような、攻撃的な、好戦的な","english_definition":"Resembling the character Rambo; aggressively macho or belligerent.","examples":[{"sentence":"The politician's speech was full of Rambo rhetoric.","translation":"その政治家の演説はランボーのようなレトリックに満ちていた。"},{"sentence":"He has a Rambo attitude towards problem-solving.","translation":"彼は問題解決に対してランボーのような姿勢を持っている。"}],"collocations":["Rambo rhetoric (ランボーのようなレトリック)","Rambo attitude (ランボーのような態度)"],"synonyms":["aggressive","macho","belligerent"],"antonyms":["peaceful","passive"]}],"etymology":{"value":"From the name of the main character, John Rambo, in the 1972 novel 'First Blood' by David Morrell, later adapted into the 'Rambo' film series. The name 'Rambo' is believed to be derived from the name of a variety of apple, 'Rambo apple'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈræmboʊ/","syllables":"Ram-bo"},"inflection":{"notes":"The word 'Rambo' is a proper noun when referring to the character, but can be used as a common noun or adjective with a lowercase 'r' to describe someone or something resembling the character."},"usage_notes":{"explanation":"'Rambo' is primarily used to refer to the fictional character. However, it's often used figuratively to describe someone who is overly aggressive, macho, or skilled in combat. When used as an adjective ('Rambo-like'), it carries a similar connotation. The term often implies a negative judgment, suggesting that the person is excessively violent or confrontational.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a rambo of peace.","correct":"✓ He is a Rambo-like warmonger.","note":"'Rambo' typically implies aggression, so using it in the context of peace is contradictory. It's better used to describe someone who is aggressive or enjoys conflict."}],"priority":"★★☆"},"related_words":{"derivatives":["Ramboesque (adjective: ランボーのような)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2 (depending on context and usage)","frequency_google_ngram":"Relatively low frequency, but recognizable due to the popularity of the film series.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Rambo' is a word that most people recognize due to the popular film series. It's used to describe someone who is very tough, aggressive, and skilled in combat, often in an exaggerated or unrealistic way. When you hear someone called 'Rambo,' it usually means they are seen as overly aggressive or macho. It can also be used to describe actions or rhetoric that are overly aggressive or confrontational."},"example_sentences":[{"sentence":"The soldier went on a Rambo-style rampage.","translation":"その兵士はランボーのような暴れっぷりを見せた。","type":"adjective","meaning_category":"攻撃的な"},{"sentence":"He's a real Rambo when it comes to video games.","translation":"彼はビデオゲームのことになるとまるでランボーだ。","type":"noun","meaning_category":"映画の主人公"},{"sentence":"The movie is about a Vietnam veteran who becomes a Rambo.","translation":"その映画はベトナム帰還兵がランボーになる話だ。","type":"noun","meaning_category":"映画の主人公"}]}