{"word":"Hydroxyurea","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヒドロキシ尿素：主として癌や鎌状赤血球貧血の治療に用いられる薬","english_definition":"A medication primarily used to treat cancer and sickle cell anemia.","examples":[{"sentence":"Hydroxyurea is used to treat sickle cell anemia by increasing fetal hemoglobin production.","translation":"ヒドロキシ尿素は、胎児ヘモグロビンの産生を増加させることによって、鎌状赤血球貧血の治療に使用されます。"},{"sentence":"The doctor prescribed hydroxyurea to manage her polycythemia vera.","translation":"医師は彼女の真性赤血球増加症を管理するためにヒドロキシ尿素を処方しました。"}],"collocations":["prescribe hydroxyurea","hydroxyurea treatment","side effects of hydroxyurea","administer hydroxyurea"],"synonyms":["Hydrea (brand name)","Droxia (brand name)"],"antonyms":[]}],"etymology":{"value":"The name is derived from its chemical structure, combining 'hydroxy' (referring to the hydroxyl group -OH) and 'urea' (referring to the organic compound urea).","priority":"★★☆"},"pronunciation":{"ipa":"/haɪˌdrɒksi.jʊˈriːə/","syllables":"hy-drox-y-u-re-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hydroxyurea is a cytotoxic drug, meaning it can kill cells, particularly rapidly dividing ones like cancer cells. It is also used to treat sickle cell anemia by stimulating the production of fetal hemoglobin, which reduces the sickling of red blood cells.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I take hydroxyurea for my headache.","correct":"✓ I take hydroxyurea for my sickle cell anemia.","note":"Hydroxyurea is not a general pain reliever; it's a specific medication for certain conditions."},{"incorrect":"✗ Hydroxyurea is a vitamin.","correct":"✓ Hydroxyurea is a medication.","note":"Hydroxyurea is a prescription medication, not a vitamin or supplement."}],"priority":"★★☆"},"related_words":{"derivatives":["hydroxy (prefix indicating the presence of a hydroxyl group)","urea (an organic compound)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Low frequency - primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Hydroxyurea is a technical term referring to a medication used to treat specific medical conditions like cancer and sickle cell anemia. Understanding its use requires knowledge of medical terminology and the conditions it treats. It is not a term commonly used in everyday conversation.","requires_background":"Requires medical knowledge to understand its use and implications."},"example_sentences":[{"sentence":"The patient experienced a significant reduction in sickle cell crises after starting hydroxyurea.","translation":"患者はヒドロキシ尿素の投与を開始後、鎌状赤血球クリーゼの大幅な減少を経験しました。","type":"general","meaning_category":"medical treatment"},{"sentence":"Hydroxyurea is often used as a first-line treatment for essential thrombocythemia.","translation":"ヒドロキシ尿素は、本態性血小板血症の第一選択薬としてよく使用されます。","type":"general","meaning_category":"medical treatment"}]}