{"word":"malleation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"展性、可鍛性：金属などが叩き延ばせる性質","english_definition":"The property of a substance, such as a metal, that allows it to be extended or shaped by hammering or pressure.","examples":[{"sentence":"Gold is known for its high malleation, making it ideal for creating thin sheets.","translation":"金は高い展性で知られており、薄いシートを作るのに理想的です。"},{"sentence":"The malleation of this alloy allows it to be formed into intricate shapes.","translation":"この合金の展性により、複雑な形状に成形することができます。"}],"collocations":["high malleation","good malleation","exhibit malleation","increase malleation","malleation process"],"synonyms":["ductility","extensibility","plasticity","pliability","workability"],"antonyms":["brittleness","rigidity","hardness"]}],"etymology":{"value":"From the Latin word 'malleus,' meaning 'hammer.' The suffix '-ation' is used to form nouns denoting an action, process, or result.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmæliˈeɪʃən/","syllables":"mal-le-a-tion"},"inflection":{"noun_plural":"malleations (rarely used)"},"usage_notes":{"explanation":"'Malleation' specifically refers to the ability of a material to deform under compressive stress, such as hammering, without fracturing. It's often used in materials science and engineering contexts. It is related to, but distinct from, 'ductility,' which refers to the ability to be drawn into a wire.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The malleation of water is low.","correct":"✓ Water has low malleability.","note":"Malleation is a property typically associated with metals. Using it for non-malleable substances is incorrect. Malleability is the more common term."},{"incorrect":"✗ Malleation is the same as ductility.","correct":"✓ Malleation is related to ductility, but refers specifically to the ability to be hammered into shape, while ductility refers to the ability to be drawn into a wire.","note":"While related, malleation and ductility are distinct properties. Malleation is specific to compressive forces (hammering), while ductility is specific to tensile forces (drawing)."}],"priority":"★★☆"},"related_words":{"derivatives":["malleable (adjective)","malleability (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Malleation' is a technical term used in materials science to describe the property of a material that allows it to be shaped by hammering or pressure. It is related to 'malleable,' which is more commonly used. Understanding this term requires knowledge of materials properties and engineering concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The blacksmith demonstrated the malleation of iron by hammering it into a thin sheet.","translation":"鍛冶屋は鉄を叩いて薄いシートにすることで、鉄の展性を示した。","type":"example","meaning_category":"展性を示す例"},{"sentence":"The high malleation of aluminum makes it suitable for forming complex shapes in manufacturing.","translation":"アルミニウムの高い展性は、製造業において複雑な形状を成形するのに適している。","type":"example","meaning_category":"展性の応用例"}]}