{"word":"jurisprudentially","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"法理的に、法解釈的に","english_definition":"In a manner relating to jurisprudence; from a jurisprudential perspective.","examples":[{"sentence":"The issue was analyzed jurisprudentially, considering various legal theories.","translation":"その問題は、様々な法理論を考慮して、法理的に分析された。"},{"sentence":"Jurisprudentially, the court's decision raises several important questions.","translation":"法解釈的に見ると、裁判所の決定はいくつかの重要な問題を提起している。"}],"collocations":["analyze jurisprudentially","consider jurisprudentially","view jurisprudentially","approach jurisprudentially"],"synonyms":["legally","judicially","theoretically (in a legal context)"],"antonyms":["factually","practically","empirically"]}],"etymology":{"value":"Derived from 'jurisprudential,' which comes from 'jurisprudence' (the theory or philosophy of law) + the adverbial suffix '-ly.' 'Jurisprudence' itself comes from Latin 'juris prudentia,' meaning 'knowledge of law' or 'skill in law.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒʊərɪsprʊˈdɛnʃəli/","syllables":"ju-ris-pru-den-tial-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Jurisprudentially' is a relatively rare adverb used in academic or legal contexts. It indicates that something is being considered or analyzed from the perspective of legal theory or the philosophy of law, rather than from a purely practical or factual standpoint. It emphasizes the theoretical underpinnings and legal reasoning behind an argument or analysis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The case was decided jurisprudentially based on the evidence.","correct":"✓ The case was decided based on the evidence, but the reasoning was jurisprudentially significant.","note":"'Jurisprudentially' refers to the *manner* of analysis or reasoning, not the basis of a decision. Decisions are based on evidence and law, but the *way* the law is interpreted can be jurisprudentially interesting."}],"priority":"★☆☆"},"related_words":{"derivatives":["jurisprudence (noun: the theory or philosophy of law)","jurisprudential (adjective: relating to jurisprudence)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'jurisprudentially' is a highly specialized term used primarily in legal and academic writing. It signifies an approach or analysis rooted in the theory and philosophy of law (jurisprudence). Understanding this word requires familiarity with legal theory and abstract reasoning. Its use is limited to contexts where the theoretical underpinnings of legal principles are being discussed.","priority":"★☆☆"},"example_sentences":[{"sentence":"The judge's opinion was jurisprudentially sound, even if controversial.","translation":"その判事の意見は、議論の余地があるとしても、法理的には健全だった。","type":"adverb","meaning_category":"法理的に"},{"sentence":"We must examine the issue jurisprudentially before considering its practical implications.","translation":"実際的な影響を考慮する前に、その問題を法理的に検討する必要がある。","type":"adverb","meaning_category":"法理的に"}]}