{"word":"tripersonality","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(心理学で)三つの異なる人格を持つ状態、またはその人。多重人格の一種。","english_definition":"(psychology) The condition of having three distinct personalities; a form of multiple personality disorder.","examples":[{"sentence":"The psychiatrist diagnosed her with tripersonality after observing her shifting between three distinct identities.","translation":"精神科医は、彼女が3つの異なるアイデンティティの間で変化するのを観察した後、彼女を三重複人格と診断した。"},{"sentence":"Cases of tripersonality are rare, but they highlight the complexity of dissociative disorders.","translation":"三重複人格の症例はまれだが、解離性障害の複雑さを浮き彫りにしている。"}],"collocations":["multiple personality disorder","dissociative identity disorder","split personality","alter ego"],"synonyms":["multiple personality","dissociative identity"],"antonyms":["single personality"],"notes":"This term is not as commonly used as 'multiple personality disorder' or 'dissociative identity disorder'."}],"etymology":{"value":"'Tri-' (three) + 'personality'. Formed by analogy with 'bipersonality' (two personalities).","priority":"★★☆"},"pronunciation":{"ipa":"/traɪˌpɜːrsəˈnæləti/","syllables":"tri-per-so-nal-i-ty"},"inflection":{"noun_plural":"tripersonalities"},"usage_notes":{"explanation":"The term 'tripersonality' is not a standard or widely recognized term in psychology. It is used to describe a specific instance of multiple personality disorder (now known as dissociative identity disorder) where an individual exhibits three distinct personalities. The more common and accepted terms are 'multiple personality disorder' or 'dissociative identity disorder', regardless of the number of personalities involved.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She has tripersonality, so she is three different people.","correct":"✓ She has dissociative identity disorder, and exhibits three distinct personalities.","note":"Using 'dissociative identity disorder' is more accurate and widely understood than 'tripersonality'."}],"priority":"★★☆"},"related_words":{"derivatives":["bipersonality","multiple personality","dissociative identity disorder"],"related_terms":["personality","identity","dissociation","psychology","psychiatry"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語に近い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'tripersonality' refers to a rare psychological condition where a person displays three distinct personalities. It's a specific type of multiple personality disorder, which is now more commonly known as dissociative identity disorder. This term is not frequently used in general conversation and is more likely to appear in psychological or psychiatric contexts. Understanding this word requires familiarity with basic concepts of psychology and mental health.","priority":"★★☆"},"example_sentences":[{"sentence":"The rare case of tripersonality presented unique challenges for the therapists involved.","translation":"そのまれな三重複人格の症例は、関与したセラピストにとって特有の課題を提示した。","type":"general","meaning_category":"General"},{"sentence":"In her research, she explored the cognitive differences between the three alters in a case of tripersonality.","translation":"彼女の研究では、三重複人格の症例における3つの交代人格間の認知的な違いを探求した。","type":"research","meaning_category":"Research"}]}