{"word":"episkotister","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who attempts to obscure or conceal their true nature or intentions.","english_definition":"One who tries to hide or conceal their true nature or intentions; a dissembler.","examples":[{"sentence":"The episkotister tried to blend in with the crowd, hoping no one would recognize him.","translation":"そのエピスコティスターは、誰にも気づかれないように群衆に溶け込もうとした。"},{"sentence":"Beware of the episkotister who offers false promises.","translation":"偽りの約束をするエピスコティスターに用心しなさい。"}],"collocations":["crafty episkotister","deceitful episkotister"],"synonyms":["dissembler","hypocrite","pretender","simulator"],"antonyms":["honest person","sincere person"]}],"etymology":{"value":"The word 'episkotister' is derived from the Greek word 'episkopeo', meaning 'to look upon, inspect, oversee, or watch over'. The suffix '-ister' denotes a person who performs the action.","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌpɪskəˈtɪstər/","syllables":"e-pis-ko-tis-ter"},"inflection":{"noun_plural":"episkotisters"},"usage_notes":{"explanation":"The word 'episkotister' is a relatively rare and somewhat obscure word. It describes someone who deliberately tries to hide their true self or intentions, often for deceptive purposes. It is similar to words like 'hypocrite' or 'dissembler' but carries a more specific connotation of actively trying to conceal one's true nature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a good episkotister.","correct":"✓ He was a skilled episkotister.","note":"Use 'skilled' or 'crafty' instead of 'good' to describe an episkotister, as the term implies deception, which is not typically considered a positive trait."}],"priority":"★☆☆"},"related_words":{"derivatives":["episkopic (adjective: relating to oversight or supervision)","episkopacy (noun: the office or position of a bishop)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'episkotister' is an uncommon and sophisticated term used to describe someone who intentionally conceals their true nature or intentions. It is not part of everyday vocabulary and is more likely to be encountered in literary or academic contexts. Understanding this word requires a strong grasp of vocabulary and an appreciation for nuanced language. The word is related to the concept of oversight or supervision, but in this context, it refers to someone who is actively trying to deceive others about their true self."},"example_sentences":[{"sentence":"The politician was revealed to be an episkotister, hiding his corrupt dealings behind a facade of integrity.","translation":"その政治家は、誠実さの仮面の後ろに隠された不正な取引を隠していたエピスコティスターであることが明らかになった。","type":"noun","meaning_category":"deceiver"},{"sentence":"The con artist was a master episkotister, easily manipulating his victims with his false charm.","translation":"その詐欺師は、偽りの魅力で簡単に被害者を操る、熟練したエピスコティスターだった。","type":"noun","meaning_category":"deceiver"}]}