{"word":"Eolotropic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"異方性の、方向によって性質が異なる","english_definition":"Having properties that vary according to the direction in which they are measured; anisotropic.","examples":[{"sentence":"Wood is an eolotropic material, as its strength differs along and across the grain.","translation":"木材は、木目に沿った方向と木目を横切る方向で強度が異なるため、異方性材料である。"},{"sentence":"The eolotropic nature of certain crystals makes them useful in optical devices.","translation":"特定の結晶の異方性により、それらは光学デバイスで有用である。"}],"collocations":["eolotropic material","eolotropic crystal","exhibit eolotropic behavior"],"synonyms":["anisotropic","heterogeneous","non-isotropic"],"antonyms":["isotropic","homogeneous"]},{"part_of_speech":"adjective","definition":"(まれ) 異方性を示すもの","english_definition":"(rare) Exhibiting anisotropy.","examples":[{"sentence":"This substance is eolotropic.","translation":"この物質は異方性を示す。"}],"collocations":[],"synonyms":["anisotropic"],"antonyms":["isotropic"]}],"etymology":{"value":"Derived from the Greek words 'aiolos' (varied, changeable) + 'tropos' (direction, manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌiːəˈlɒtrəpɪk/","syllables":"e-o-lo-trop-ic"},"inflection":{"notes":"Comparative and superlative forms are not commonly used for this word.","adjective_forms":{}},"usage_notes":{"explanation":"'Eolotropic' is a technical term primarily used in physics, materials science, and related fields to describe materials whose properties (such as strength, conductivity, or refractive index) differ depending on the direction in which they are measured. 'Anisotropic' is a more commonly used synonym.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The material is eolotropic in temperature.","correct":"✓ The material exhibits eolotropic behavior in its thermal conductivity.","note":"Eolotropic refers to the directional dependence of a property, not the property itself. Be specific about which property is eolotropic."}],"priority":"★☆☆"},"related_words":{"derivatives":["Eolotropy (noun): The property of being eolotropic; anisotropy."],"related_terms":["Anisotropy (noun): The property of being directionally dependent, synonymous with eolotropy in many contexts.","Isotropy (noun): The property of being directionally independent, the opposite of eolotropy."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Technical vocabulary)","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Eolotropic' is a highly specialized term primarily encountered in scientific and technical contexts, particularly in discussions of materials science, physics, and engineering. Its use indicates a sophisticated understanding of material properties and their directional dependence. Due to its limited application, it is not part of general vocabulary and is unlikely to be encountered outside of its specific technical domains."},"example_sentences":[{"sentence":"Fiberglass composites can be designed to be highly eolotropic, maximizing strength in specific directions.","translation":"繊維ガラス複合材は、特定の方向に強度を最大化するように、高度に異方性に設計することができる。","type":"general","meaning_category":"異方性"},{"sentence":"The eolotropic nature of the crystal affected the polarization of light passing through it.","translation":"結晶の異方性により、そこを通過する光の偏光が影響を受けた。","type":"technical","meaning_category":"異方性"}]}