{"word":"non-maskable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(割り込みが)マスク不能な、マスクできない","english_definition":"(of an interrupt) that cannot be masked or disabled.","examples":[{"sentence":"A non-maskable interrupt (NMI) cannot be ignored by the CPU.","translation":"マスク不能割り込み（NMI）はCPUによって無視することができません。"},{"sentence":"NMIs are typically used for critical system events.","translation":"NMIは通常、重要なシステムイベントに使用されます。"}],"collocations":["non-maskable interrupt (NMI) (マスク不能割り込み)"],"synonyms":["uninterruptible"],"antonyms":["maskable"]},{"part_of_speech":"adjective","definition":"(一般的に)マスクできない、隠せない","english_definition":"(generally) that cannot be masked or hidden.","examples":[{"sentence":"The issue is non-maskable and needs to be addressed immediately.","translation":"この問題は隠せないものであり、直ちに対処する必要があります。"}],"collocations":[],"synonyms":["unconcealable","unhideable"],"antonyms":["maskable","concealable"]}],"etymology":{"value":"The term is formed by adding the prefix 'non-' (meaning 'not') to 'maskable'. 'Maskable' refers to the ability to be masked or disabled, typically in the context of interrupts in computer systems.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈmæskəbəl/","syllables":"non-mask-a-ble"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'non-maskable' is most commonly used in the context of computer hardware and software, specifically referring to interrupts. A non-maskable interrupt (NMI) is a hardware interrupt that the CPU cannot ignore. It is typically reserved for critical system events such as hardware failures or memory errors. Outside of this technical context, 'non-maskable' can be used more generally to describe something that cannot be hidden or concealed, but this usage is less common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The maskable interrupt is non-maskable.","correct":"✓ The interrupt is non-maskable.","note":"The phrase 'maskable interrupt is non-maskable' is contradictory. An interrupt is either maskable or non-maskable, not both."}],"priority":"★★☆"},"related_words":{"derivatives":["maskable","mask","interrupt"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in technical documentation and discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"non-maskable\" is highly technical and primarily used in computer science and engineering. It describes a characteristic of interrupts in a computer system. An interrupt is a signal that tells the processor to stop what it's doing and handle something else. A \"maskable\" interrupt can be ignored by the processor under certain conditions, while a \"non-maskable\" interrupt (NMI) cannot be ignored and must be handled immediately. This is usually reserved for critical system errors or events that require immediate attention. Outside of this specific technical context, the term is rarely used.","priority":"★★☆"},"example_sentences":[{"sentence":"The system crashed due to a hardware failure, triggering a **non-maskable** interrupt.","translation":"ハードウェア障害によりシステムがクラッシュし、マスク不能割り込みがトリガーされました。","type":"adjective","meaning_category":"computer hardware"},{"sentence":"The operating system uses **non-maskable** interrupts to handle critical errors.","translation":"オペレーティングシステムは、重要なエラーを処理するためにマスク不能割り込みを使用します。","type":"adjective","meaning_category":"computer software"}]}