{"word":"preindebtedness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"債務を負う前の状態、債務がない状態","english_definition":"The state of not being in debt; the condition before incurring debt.","examples":[{"sentence":"The company was in a state of preindebtedness before taking out the loan.","translation":"その会社は融資を受ける前は債務がない状態だった。"},{"sentence":"Many people dream of reaching a state of preindebtedness.","translation":"多くの人が債務がない状態になることを夢見ている。"}],"collocations":["achieve preindebtedness (債務がない状態を達成する)","maintain preindebtedness (債務がない状態を維持する)"],"synonyms":["debt-free","unindebted","solvent"],"antonyms":["indebtedness","debt","liability"]}],"etymology":{"value":"\"pre-\" (～の前の) + \"indebtedness\" (債務)","priority":"★★★"},"pronunciation":{"ipa":"/priːɪnˈdetɪdnəs/","syllables":"pre-in-det-ed-ness"},"inflection":{"noun_plural":"preindebtednesses"},"usage_notes":{"explanation":"\"Preindebtedness\" is a relatively uncommon word, primarily used in financial or economic contexts to describe the state of an entity (individual, company, or even a country) before it has any debts or liabilities. It emphasizes the absence of financial obligations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is preindebted.","correct":"✓ He is in a state of preindebtedness.","note":"\"Preindebted\" is not commonly used as an adjective. It is more accurate to say someone is \"in a state of preindebtedness\" or \"debt-free.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["indebtedness","debt","pre-"],"related_concepts":["solvency","liability","assets","financial health"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Preindebtedness\" is a highly specialized term used in finance and economics. It describes the state of being free from debt, which is often a desirable but challenging financial position. The word is formed by adding the prefix \"pre-\" (meaning before) to \"indebtedness\" (the state of being in debt). Understanding this term requires a strong grasp of financial concepts and vocabulary."},"example_sentences":[{"sentence":"The goal of the financial plan was to return the family to a state of preindebtedness within five years.","translation":"その財務計画の目標は、5年以内に家族を債務がない状態に戻すことだった。","type":"noun","meaning_category":"債務がない状態"},{"sentence":"Maintaining preindebtedness can provide a significant competitive advantage for businesses.","translation":"債務がない状態を維持することは、企業にとって大きな競争上の優位性をもたらす可能性がある。","type":"noun","meaning_category":"債務がない状態"}]}