{"word":"cornea","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"角膜","english_definition":"the transparent layer forming the front of the eye.","examples":[{"sentence":"The cornea is responsible for focusing light as it enters the eye.","translation":"角膜は、眼に入る光を焦点を合わせる役割を担っています。"},{"sentence":"A corneal transplant can restore vision in some cases of corneal damage.","translation":"角膜移植は、角膜損傷のいくつかの症例で視力を回復させることができます。"},{"sentence":"The doctor examined the patient's cornea for any signs of infection.","translation":"医師は、感染の兆候がないか患者の角膜を検査しました。"}],"collocations":["corneal transplant (角膜移植)","corneal abrasion (角膜剥離)","corneal ulcer (角膜潰瘍)","corneal disease (角膜疾患)","corneal epithelium (角膜上皮)","artificial cornea (人工角膜)"],"synonyms":["tunica cornea (医学用語)"],"antonyms":[]}],"etymology":{"value":"Late Latin cornea tela, from Latin corneus 'horny' (from cornu 'horn') referring to its tough, translucent nature.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɔːrniə/","syllables":"cor-ne-a"},"inflection":{"noun_plural":"corneas"},"usage_notes":{"explanation":"The cornea is the clear, dome-shaped surface that covers the front of the eye. It is essential for focusing vision. Damage or disease affecting the cornea can significantly impair sight.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He scratched his cornea with his finger.","correct":"✓ He scratched his eye with his finger.","note":"While technically correct, it's more common to say 'eye' in general conversation, unless specifically discussing the cornea in a medical context."},{"incorrect":"✗ The cornea is in the back of the eye.","correct":"✓ The cornea is in the front of the eye.","note":"The cornea is the front part of the eye."}],"priority":"★★☆"},"related_words":{"derivatives":["corneal (adjective: 角膜の)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency in general text, higher in medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Cornea' refers to the transparent front part of the eye that helps focus light. It's a term mainly used in medical or scientific contexts. You'll encounter it when discussing eye health, vision correction, or eye injuries. Understanding this term is helpful for comprehending medical information related to the eyes.","priority":"★★★"},"example_sentences":[{"sentence":"The ophthalmologist checked the health of my **cornea** during the eye exam.","translation":"眼科医は眼の検査中に私の角膜の状態をチェックしました。","type":"noun","meaning_category":"anatomy"},{"sentence":"A **corneal** transplant can restore vision to people with damaged corneas.","translation":"角膜移植は、角膜が損傷した人々の視力を回復させることができます。","type":"related adjective","meaning_category":"medical procedure"},{"sentence":"Wearing safety glasses can protect your **cornea** from injury.","translation":"安全メガネをかけることで、角膜を怪我から守ることができます。","type":"noun","meaning_category":"protection"}]}