{"word":"metaleptical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"換喩的な、転義的な、メタレプシスを用いた","english_definition":"Relating to or characterized by metalepsis.","examples":[{"sentence":"The poem uses metaleptical language to create a sense of disorientation.","translation":"その詩は、方向感覚を失わせるためにメタレプシス的な言葉遣いを使用している。"},{"sentence":"The author's metaleptical approach blurs the lines between reality and fiction.","translation":"著者のメタレプシス的なアプローチは、現実とフィクションの境界線を曖昧にする。"}],"collocations":["metaleptical device","metaleptical narrative","metaleptical reference"],"synonyms":["transumptive","figurative","indirect"],"antonyms":["literal","direct"]},{"part_of_speech":"adjective","definition":"物語論において、物語のレベルを越境する、物語世界と現実世界を混同させる","english_definition":"(narratology) Transgressing the boundaries between narrative levels, blurring the distinction between the fictional world and the real world.","examples":[{"sentence":"The play is highly metaleptical, with characters addressing the audience directly.","translation":"その劇は非常にメタレプシス的で、登場人物が直接観客に語りかける。"},{"sentence":"The film employs a metaleptical twist at the end, revealing the director's presence in the story.","translation":"その映画は最後にメタレプシス的な仕掛けを用い、監督が物語の中に存在することを明らかにする。"}],"collocations":["metaleptical transgression","metaleptical twist","metaleptical narrative"],"synonyms":["self-referential","metafictional","boundary-crossing"],"antonyms":["realistic","conventional"]}],"etymology":{"value":"From metalepsis + -ical. Metalepsis originates from Greek μετάληψις (metalēpsis), meaning 'substitution, interchange', from μεταλαμβάνω (metalambanō) 'I take in turn, interchange', from μετά (meta) 'with, after' + λαμβάνω (lambanō) 'I take'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛtəˈlɛptɪkəl/","syllables":"met-a-lep-ti-cal"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more metaleptical' and 'most metaleptical' respectively."},"usage_notes":{"explanation":"'Metaleptical' is an adjective primarily used in literary and rhetorical analysis to describe something that employs metalepsis. Metalepsis is a figure of speech where a word or phrase is substituted for another that is related to it, often creating a chain of associations. In narratology, it refers to the blurring of boundaries between the fictional world and the real world, such as characters addressing the audience or the author intruding into the story.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The story was very metaphorical, using many metaleptical devices.","correct":"✓ The story was very metaleptical, using many metaphorical devices.","note":"'Metaleptical' and 'metaphorical' are related but distinct. 'Metaphorical' relates to metaphors, while 'metaleptical' relates to metalepsis, a more specific rhetorical device involving a chain of substitutions or boundary-crossing."},{"incorrect":"✗ The metaleptical structure of the building was impressive.","correct":"✓ The innovative structure of the building was impressive.","note":"'Metaleptical' is typically used in literary and rhetorical contexts, not for describing physical structures."}],"priority":"★☆☆"},"related_words":{"derivatives":["metalepsis"],"phrases":["metaleptically"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Metaleptical' is a specialized term primarily used in literary and rhetorical analysis. It describes something related to metalepsis, a figure of speech involving a chain of substitutions or boundary-crossing between narrative levels. Understanding this term requires familiarity with literary theory and rhetorical devices. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The novel's **metaleptical** structure challenges the reader's perception of reality.","translation":"その小説のメタレプシス的な構造は、読者の現実認識に挑戦する。","type":"adjective","meaning_category":"narratology"},{"sentence":"The politician's speech was filled with **metaleptical** references to historical events.","translation":"その政治家の演説は、歴史的出来事へのメタレプシス的な言及で満たされていた。","type":"adjective","meaning_category":"rhetoric"}]}