{"word":"voluntaryism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"自由意志主義、自由意思主義：政府や強制によらず、個人の自由意志に基づく自発的な協力や行動を重視する思想または原則","english_definition":"A philosophy that holds that all forms of human association should be voluntary as far as possible. It is the principle that individuals should be free to associate with whomever they choose, and that all forms of human association should be based on voluntary consent and mutual agreement, rather than coercion or compulsion.","examples":[{"sentence":"Voluntaryism advocates for a society where services like security and dispute resolution are provided by competing private entities, rather than a state.","translation":"自由意志主義は、治安や紛争解決などのサービスが、国家ではなく、競争的な民間団体によって提供される社会を提唱する。"},{"sentence":"Critics of voluntaryism often argue that it is impractical and would lead to a chaotic society.","translation":"自由意志主義の批判者は、それが非現実的であり、混沌とした社会につながると主張することが多い。"},{"sentence":"Voluntaryism is often associated with anarcho-capitalism and libertarianism.","translation":"自由意志主義は、しばしば無政府資本主義やリバタリアニズムと関連付けられる。"}],"collocations":["voluntary association (自発的結社)","voluntary action (自発的行動)","voluntary cooperation (自発的協力)","anarcho-voluntaryism (無政府自由意志主義)"],"synonyms":["libertarianism","anarcho-capitalism","individualist anarchism","market anarchism"],"antonyms":["statism","collectivism","compulsoryism","coercion"]},{"part_of_speech":"noun","definition":"ボランタリズム：ボランティア活動を推進する思想や運動","english_definition":"The principle of relying on voluntary action, especially in social services.","examples":[{"sentence":"Voluntaryism played a key role in the development of social welfare in the 19th century.","translation":"ボランタリズムは、19世紀の社会福祉の発展において重要な役割を果たした。"},{"sentence":"The organization relies heavily on voluntaryism to provide services to the community.","translation":"その組織は、地域社会へのサービス提供をボランタリズムに大きく依存している。"}],"collocations":["voluntary sector (ボランタリーセクター)","voluntary organization (ボランタリー団体)","voluntary work (ボランティア活動)"],"synonyms":["volunteerism","philanthropy","charity","civic engagement"],"antonyms":["compulsory service","mandatory service"]}],"etymology":{"value":"The term 'voluntaryism' is derived from 'voluntary,' emphasizing the importance of free will and choice.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈvɒləntəriɪzəm/","syllables":"vo-lun-ta-ry-ism"},"inflection":{"notes":"It is a noun and follows typical noun inflection rules (singular and plural)."},"usage_notes":{"explanation":"Voluntaryism has two primary meanings. The first, and more philosophical meaning, refers to a political philosophy emphasizing voluntary association and rejecting coercion, particularly from the state. The second, more common meaning, refers to the principle of relying on voluntary action, especially in social services and community work. Context is crucial to understanding which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Voluntaryism is when the government provides services.","correct":"✓ Voluntaryism is when individuals or private organizations provide services voluntarily.","note":"Voluntaryism emphasizes voluntary action, not government provision of services."},{"incorrect":"✗ Voluntaryism is the same as communism.","correct":"✓ Voluntaryism is different from communism, as it emphasizes individual freedom and voluntary association.","note":"Voluntaryism is often associated with individualist and libertarian ideologies, in contrast to collectivist ideologies like communism."}],"priority":"★☆☆"},"related_words":{"derivatives":["voluntary (adjective)","voluntarily (adverb)","volunteer (noun/verb)","volunteerism (noun)"],"related_concepts":["anarchism","libertarianism","individualism","self-ownership","free market","mutualism","agorism"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Voluntaryism' is a complex term with two primary meanings. In political philosophy, it refers to the idea that all human interaction should be voluntary and free from coercion, especially by the state. In a more general sense, it refers to the principle of relying on voluntary action, such as volunteering, to provide social services. Understanding the context is crucial to interpreting the intended meaning. It is often associated with political ideologies like anarcho-capitalism and libertarianism.","priority":"★☆☆"},"example_sentences":[{"sentence":"Voluntaryism promotes the idea that all interactions between people should be based on mutual consent.","translation":"自由意志主義は、人々の間のすべての相互作用が相互の同意に基づくべきであるという考えを推進する。","type":"noun","meaning_category":"Political Philosophy"},{"sentence":"The success of the charity depended on the voluntaryism of its supporters.","translation":"その慈善団体の成功は、支持者のボランタリズムに依存していた。","type":"noun","meaning_category":"Voluntary Action"},{"sentence":"Some proponents of voluntaryism believe that even essential services like law enforcement could be provided by private companies.","translation":"自由意志主義の支持者の中には、法執行のような不可欠なサービスさえも民間企業によって提供できると信じている人もいる。","type":"noun","meaning_category":"Political Philosophy"},{"sentence":"Voluntaryism is a key component of many libertarian philosophies.","translation":"自由意志主義は、多くのリバタリアン哲学の重要な要素である。","type":"noun","meaning_category":"Political Philosophy"}]}