{"word":"superposition","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"重ね合わせ、重ね合わせること、重ね合わせの状態","english_definition":"The state of being superimposed or placed on something else; the placement of one thing over another.","examples":[{"sentence":"The superposition of the images created a unique effect.","translation":"画像の重ね合わせがユニークな効果を生み出した。"},{"sentence":"In quantum mechanics, superposition refers to a state where a particle exists in multiple states simultaneously.","translation":"量子力学では、重ね合わせは、粒子が複数の状態に同時に存在することを指します。"}],"collocations":["linear superposition","quantum superposition","superposition principle"],"synonyms":["overlay","overlap","juxtaposition","superimposition"],"antonyms":["separation","isolation"]},{"part_of_speech":"noun","definition":"(地質学)累重、累重の法則","english_definition":"(Geology) The principle that in a series of stratified sedimentary rocks the lowest stratum is the oldest.","examples":[{"sentence":"The law of superposition helps geologists determine the relative ages of rock layers.","translation":"累重の法則は、地質学者が岩層の相対的な年代を決定するのに役立ちます。"}],"collocations":["law of superposition","principle of superposition"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin 'super-' (above, over) + 'position' (a placing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərpəˈzɪʃən/","syllables":"su·per·po·si·tion"},"inflection":{"noun_plural":"superpositions"},"usage_notes":{"explanation":"The term 'superposition' has different meanings depending on the field. In general, it refers to the act or state of placing one thing on top of another. In quantum mechanics, it has a specific meaning related to the existence of multiple states simultaneously. In geology, it refers to the principle that older rock layers are typically found below younger layers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The superposition of the two sounds created a dissonance.","correct":"✓ The superimposition of the two sounds created a dissonance.","note":"'Superimposition' is often used when referring to the physical act of placing one thing over another, especially in visual contexts. 'Superposition' is more general, and has specific meanings in science."}],"priority":"★★☆"},"related_words":{"derivatives":["superimpose","superposed"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Superposition' is a technical term used in various fields, primarily physics and geology. In physics, particularly quantum mechanics, it describes a state where a system exists in multiple states at once. In geology, it refers to the principle that in undisturbed rock sequences, the oldest layers are at the bottom. Understanding the context is crucial to interpreting the meaning of 'superposition' correctly."},"example_sentences":[{"sentence":"The **superposition** of the two waves resulted in constructive interference.","translation":"2つの波の重ね合わせが建設的な干渉をもたらした。","type":"noun","meaning_category":"重ね合わせ (physics)"},{"sentence":"According to the law of **superposition**, the lower layers are older.","translation":"累重の法則によれば、下の層ほど古い。","type":"noun","meaning_category":"累重 (geology)"},{"sentence":"The artist used **superposition** to create depth in the painting.","translation":"アーティストは重ね合わせを使って絵に奥行きを出した。","type":"noun","meaning_category":"重ね合わせ (general)"}]}