{"word":"epizootiologic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"動物の疾病の流行に関する、動物疫学的な","english_definition":"Relating to the study of the distribution and determinants of disease in animal populations.","examples":[{"sentence":"Epizootiologic studies are crucial for understanding the spread of diseases in livestock.","translation":"動物疫学的研究は、家畜における疾病の蔓延を理解するために不可欠です。"},{"sentence":"The epizootiologic data helped to identify the source of the outbreak.","translation":"動物疫学的なデータは、アウトブレイクの原因を特定するのに役立ちました。"}],"collocations":["epizootiologic study","epizootiologic data","epizootiologic investigation","epizootiologic surveillance"],"synonyms":["veterinary epidemiologic","animal epidemiologic"],"antonyms":[]}],"etymology":{"value":"'Epizootic' (disease affecting many animals) + '-o-' + 'logic' (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛpɪzuːˌɒtiˈɒlədʒɪk/","syllables":"ep-i-zoo-o-ti-o-log-ic"},"inflection":{"notes":"This is an adjective, so it does not inflect for number or tense."},"usage_notes":{"explanation":"'Epizootiologic' is a specialized term used in veterinary medicine and public health. It refers to the application of epidemiologic principles to the study of diseases in animal populations. It's often used in the context of investigating disease outbreaks, identifying risk factors, and developing control strategies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The epizootiologic is important for disease control.","correct":"✓ Epizootiologic research is important for disease control.","note":"'Epizootiologic' is an adjective, so it must modify a noun. Using it as a noun is incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["epizootiology","epizootic","epidemiology"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'epizootiologic' is a highly specialized term used in veterinary medicine and epidemiology. It describes something related to the study of how diseases spread and affect animal populations. Because of its technical nature, it is not commonly used outside of professional or academic contexts. Understanding this word requires familiarity with scientific and medical vocabulary."},"example_sentences":[{"sentence":"The researchers conducted an **epizootiologic** survey to determine the prevalence of avian influenza in wild birds.","translation":"研究者たちは、野生の鳥における鳥インフルエンザの有病率を特定するために、動物疫学的調査を実施しました。","type":"adjective","meaning_category":"動物の疾病の流行に関する"},{"sentence":"An **epizootiologic** analysis revealed that the disease was transmitted through contaminated feed.","translation":"動物疫学的分析により、その病気が汚染された飼料を介して伝染することが明らかになりました。","type":"adjective","meaning_category":"動物疫学的な"}]}