{"word":"kalathoi","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Greek mythology) A type of basket or container used by goddesses, particularly associated with Athena and Hephaestus.","english_definition":"A type of basket or container used by goddesses in Greek mythology, particularly associated with Athena and Hephaestus. It is often depicted as a vessel for holding wool or other materials used in weaving or crafting.","examples":[{"sentence":"Athena was often depicted with a kalathoi filled with wool.","translation":"アテナはしばしば羊毛で満たされたカラソイと共に描かれました。"},{"sentence":"The kalathoi was a symbol of feminine skill and craftsmanship.","translation":"カラソイは女性のスキルと職人技の象徴でした。"}],"collocations":["Athena's kalathoi","Hephaestus' kalathoi","wool in a kalathoi"],"synonyms":["basket","container","vessel"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek κάλαθος (kálathos), meaning 'basket'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkæləθɔɪ/","syllables":"ka-la-thoi"},"inflection":{"noun_plural":"kalathoi (or kalathos)"},"usage_notes":{"explanation":"The term 'kalathoi' is primarily used in the context of classical Greek art, mythology, and archaeology. It refers to a specific type of basket or container, often depicted in association with goddesses, particularly Athena (Minerva in Roman mythology), the goddess of wisdom, crafts, and warfare, and Hephaestus (Vulcan), the god of fire, metalworking, and crafts. The kalathoi is often associated with weaving, spinning, and other crafts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["kalathos (singular form)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'kalathoi' is a specialized term primarily encountered in the study of classical Greek mythology, art, and archaeology. It refers to a specific type of basket or container associated with certain Greek goddesses. Due to its niche usage, it is not a common word and would typically only be found in academic or specialized contexts."},"example_sentences":[{"sentence":"In ancient Greek vase paintings, Athena is frequently shown holding a kalathoi.","translation":"古代ギリシャの壺絵では、アテナがカラソイを持っている様子が頻繁に描かれています。","type":"noun","meaning_category":"basket"},{"sentence":"Archaeologists have discovered fragments of kalathoi at sites associated with ancient Greek textile production.","translation":"考古学者は、古代ギリシャの織物生産に関連する遺跡でカラソイの破片を発見しました。","type":"noun","meaning_category":"container"}]}