{"word":"intumescence","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"膨張、腫脹、肥大","english_definition":"the state of being swollen or enlarged; swelling.","examples":[{"sentence":"The intumescence of the injured area was significant.","translation":"負傷部位の腫脹は著しかった。"},{"sentence":"Intumescence is a common symptom of inflammation.","translation":"膨張は炎症の一般的な症状です。"},{"sentence":"The intumescence of the wood was caused by moisture absorption.","translation":"その木の膨張は水分吸収によって引き起こされた。"}],"collocations":["intumescence of tissue (組織の膨張)","intumescence of the skin (皮膚の膨張)","intumescence of the eye (眼の膨張)","intumescent coating (膨張性塗料)"],"synonyms":["swelling","enlargement","distension","tumefaction","protuberance"],"antonyms":["contraction","shrinkage","atrophy"]}],"etymology":{"value":"Derived from the Latin word \"intumescere,\" meaning \"to swell up,\" which is composed of \"in-\" (into) and \"tumescere\" (to begin to swell), from \"tumescere\" (to swell).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪn.tuːˈmɛsəns/","syllables":"in-tu-mes-cence"},"inflection":{"noun_plural":"intumescences"},"usage_notes":{"explanation":"\"Intumescence\" refers to the process or state of swelling or enlarging, often due to internal pressure or inflammation. It is frequently used in medical and scientific contexts to describe the swelling of tissues, organs, or other materials. In botany, it can refer to the swelling of plant parts. In materials science, it can describe the behavior of intumescent materials, which expand when exposed to heat, providing fire protection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intumescence was very pain.","correct":"✓ The intumescence was very painful.","note":"\"Intumescence\" is a noun (the swelling itself), while \"painful\" is an adjective (describing the swelling)."},{"incorrect":"✗ The intumescence is growing up.","correct":"✓ The intumescence is increasing. / ✓ The swelling is growing.","note":"\"Intumescence\" already implies an increase in size, so \"growing up\" is redundant. Use \"increasing\" or simply \"growing\" if you want to emphasize the process of enlargement. Alternatively, use \"swelling\" instead of intumescence."}],"priority":"★☆☆"},"related_words":{"derivatives":["intumescent (adjective: causing or characterized by swelling; capable of swelling when heated)"],"phrasal_verbs":[],"related_terms":["tumor","edema","inflammation","hypertrophy","hyperplasia"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - a technical or specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Intumescence\" is a relatively uncommon and technical term that refers to the act or state of swelling or enlarging. It is often used in medical, botanical, or materials science contexts. Because of its specialized usage, it is considered a high-level vocabulary word. Understanding its meaning requires familiarity with scientific or technical language. In simpler terms, it means 'swelling,' but it is used in more formal or technical writing."},"example_sentences":[{"sentence":"The engineer examined the intumescence of the fireproof coating after the test.","translation":"技師は試験後、耐火コーティングの膨張を調べた。","type":"noun","meaning_category":"膨張 (materials science)"},{"sentence":"The doctor noted the intumescence around the patient's ankle.","translation":"医師は患者の足首の周りの腫脹に注目した。","type":"noun","meaning_category":"腫脹 (medical)"},{"sentence":"Observe the intumescence of the buds as they prepare to bloom.","translation":"つぼみが開花に向けて準備する際の膨張を観察してください。","type":"noun","meaning_category":"肥大 (botany)"}]}