{"word":"gastrulae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(発生学) 原腸胚","english_definition":"The hollow, two-layered structure that is the result of gastrulation.","examples":[{"sentence":"Gastrulae are formed during early animal development.","translation":"原腸胚は動物の初期発生段階で形成される。"},{"sentence":"The gastrulae stage is characterized by the formation of germ layers.","translation":"原腸胚期は胚葉の形成によって特徴づけられる。"}],"collocations":["form gastrulae (原腸胚を形成する)","gastrulae stage (原腸胚期)","early gastrulae (初期原腸胚)"],"synonyms":["gastrula"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'gaster' meaning stomach or belly, referring to the primitive gut formed during gastrulation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡæstrələ/","syllables":"gas-tru-lae"},"inflection":{"noun_plural":"gastrulae"},"usage_notes":{"explanation":"'Gastrulae' is the plural form of 'gastrula.' It refers to the stage in embryonic development that follows the blastula stage and precedes the neurula stage. Gastrulation is the process where the single-layered blastula is reorganized into a multilayered structure known as the gastrula. These layers, called germ layers (ectoderm, mesoderm, and endoderm), will eventually give rise to the different tissues and organs of the developing organism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gastrula are a stage in plant development.","correct":"✓ The gastrula is a stage in animal development.","note":"Gastrulation and the formation of gastrulae are specific to animal development, not plant development."},{"incorrect":"✗ Gastrula is the plural of gastrulae.","correct":"✓ Gastrulae is the plural of gastrula.","note":"'Gastrula' is the singular form, and 'gastrulae' is the plural form."}],"priority":"★★☆"},"related_words":{"derivatives":["gastrula (singular form)","gastrulation (原腸形成)","gastrocoel (原腸腔)","blastula (胞胚)","neurula (神経胚)","ectoderm (外胚葉)","mesoderm (中胚葉)","endoderm (内胚葉)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gastrulae' is a technical term used in the field of developmental biology. It refers to a specific stage in the early development of animals, following the blastula stage. During gastrulation, the single-layered blastula transforms into a multi-layered structure called the gastrula. This stage is crucial because it establishes the three primary germ layers (ectoderm, mesoderm, and endoderm), which will eventually differentiate into the various tissues and organs of the organism. Understanding this term requires a background in biology, particularly embryology."},"example_sentences":[{"sentence":"The study examined the cellular movements during gastrulae formation in sea urchins.","translation":"その研究では、ウニの原腸胚形成中の細胞運動を調べた。","type":"noun","meaning_category":"原腸胚"},{"sentence":"Different species exhibit variations in their gastrulae development.","translation":"種によって原腸胚の発達に違いが見られる。","type":"noun","meaning_category":"原腸胚"}]}