{"word":"substandardly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"標準以下に、基準未満に、劣悪に","english_definition":"in a substandard manner; below the required or expected standard.","examples":[{"sentence":"The work was completed substandardly, requiring significant revisions.","translation":"その作業は標準以下の出来で、大幅な修正が必要だった。"},{"sentence":"The equipment performed substandardly, leading to production delays.","translation":"その装置は性能が基準未満で、生産の遅延につながった。"},{"sentence":"The food was prepared substandardly, resulting in numerous complaints.","translation":"その料理は劣悪な調理で、多くの苦情が出た。"}],"collocations":["perform substandardly","produce substandardly","complete substandardly","operate substandardly","function substandardly"],"synonyms":["poorly","badly","inferiorly","deficiently","inadequately","shoddily"],"antonyms":["excellently","superbly","outstandingly","satisfactorily","adequately"]}],"etymology":{"value":"Formed from 'substandard' (below the standard) and '-ly' (adverbial suffix). 'Substandard' itself is derived from 'sub-' (below) and 'standard' (a level of quality).","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˈstændərdli/","syllables":"sub-stan-dard-ly"},"inflection":{"notes":"As an adverb, it does not inflect (i.e., it does not have different forms for tense, number, etc.)."},"usage_notes":{"explanation":"'Substandardly' is used to describe actions or processes that do not meet the required or expected level of quality. It implies a deficiency or failure to achieve the necessary standards. It is often used in contexts involving performance, production, or quality control.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The substandardly product was rejected.","correct":"✓ The substandard product was rejected.","note":"'Substandardly' is an adverb and modifies a verb, not a noun. To describe a substandard product, use the adjective 'substandard'."},{"incorrect":"✗ He performed substandardly on the test because he was nervous.","correct":"✓ He performed poorly on the test because he was nervous.","note":"While 'substandardly' is correct, 'poorly' is a more common and natural-sounding alternative in everyday conversation."}],"priority":"★★☆"},"related_words":{"derivatives":["substandard (adjective: below the standard; noun: something below the standard)"],"phrases":["substandard performance","substandard quality","substandard work"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Substandardly' means doing something in a way that is below the expected or required level of quality. It's a formal word, often used in professional or technical contexts to describe performance, work, or products that don't meet the necessary standards. You would use it to say that something was done poorly or inadequately because it didn't reach the required level of quality.","priority":"★★☆"},"example_sentences":[{"sentence":"The repairs were completed substandardly, and the building failed inspection.","translation":"修理は標準以下の出来で、建物は検査に不合格となった。","type":"adverb","meaning_category":"標準以下に"},{"sentence":"The company was criticized for manufacturing its products substandardly.","translation":"その会社は製品を基準未満の品質で製造していると批判された。","type":"adverb","meaning_category":"基準未満に"},{"sentence":"The software functioned substandardly, causing frequent crashes and data loss.","translation":"そのソフトウェアは劣悪な動作をし、頻繁なクラッシュとデータ損失を引き起こした。","type":"adverb","meaning_category":"劣悪に"}]}