{"word":"voidability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"無効にできること、取り消しうる状態","english_definition":"The state of being capable of being declared void; the quality of being voidable.","examples":[{"sentence":"The voidability of the contract was debated in court.","translation":"その契約の取り消し可能性が法廷で議論された。"},{"sentence":"The agreement's voidability stemmed from a lack of proper consent.","translation":"その合意の取り消し可能性は、適切な同意の欠如に起因していた。"}],"collocations":["contract voidability","agreement voidability","transaction voidability"],"synonyms":["rescindability","cancellability","annullability"],"antonyms":["validity","enforceability"]}],"etymology":{"value":"The word 'voidability' is derived from 'voidable' by adding the suffix '-ity,' which transforms an adjective into a noun denoting a state or quality. 'Voidable' comes from 'void,' meaning empty or without legal effect, and the suffix '-able,' indicating capability or possibility.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɔɪdəˈbɪləti/","syllables":"voi-da-bil-i-ty"},"inflection":{"noun_plural":"voidabilities"},"usage_notes":{"explanation":"'Voidability' is a legal term that describes the status of an agreement or contract that can be cancelled or invalidated by one of the parties involved. This usually occurs when there is a defect in the formation of the agreement, such as fraud, misrepresentation, duress, undue influence, or lack of capacity. The contract is not automatically void but remains valid unless and until the party with the power to do so takes action to void it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The voidability was happened because of fraud.","correct":"✓ The voidability arose because of fraud.","note":"'Voidability' is a state or quality, so it doesn't 'happen.' Instead, it 'arises' or 'exists' due to a specific cause."},{"incorrect":"✗ He has voidability to cancel the contract.","correct":"✓ He has the right of voidability to cancel the contract.","note":"'Voidability' is a state or quality, not a power or right. The correct phrasing would be 'the right of voidability' or 'the right to void the contract'."}],"priority":"★★☆"},"related_words":{"derivatives":["voidable (adjective)","void (adjective, noun, verb)","avoid (verb)","avoidance (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Voidability' is a specialized legal term referring to the state of an agreement or contract that can be invalidated by one party due to specific defects like fraud or undue influence. It's important to understand that a voidable contract is valid until the affected party takes action to void it. This term is primarily used in legal contexts and is not common in everyday conversation."},"example_sentences":[{"sentence":"The plaintiff argued for the voidability of the settlement agreement.","translation":"原告は和解契約の取り消し可能性を主張した。","type":"general","meaning_category":"legal"},{"sentence":"The court considered the issue of voidability in light of the evidence presented.","translation":"裁判所は提出された証拠に照らして、取り消し可能性の問題を検討した。","type":"general","meaning_category":"legal"}]}