{"word":"prophetism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"預言者であること、預言者の職務、預言者による運動、預言の能力","english_definition":"The state, quality, or function of being a prophet; the doctrines or practices of prophets; a prophetic movement.","examples":[{"sentence":"The rise of prophetism in ancient Israel was closely linked to social and political upheaval.","translation":"古代イスラエルにおける預言者運動の台頭は、社会的、政治的激変と密接に関連していた。"},{"sentence":"Scholars debate the nature and extent of prophetism in early Christianity.","translation":"学者たちは、初期キリスト教における預言者運動の性質と範囲について議論している。"},{"sentence":"His prophetism was characterized by bold pronouncements and calls for social justice.","translation":"彼の預言者としての活動は、大胆な宣言と社会正義の呼びかけによって特徴づけられた。"}],"collocations":["religious prophetism","early prophetism","biblical prophetism","the spirit of prophetism"],"synonyms":["divination","prophecy","revelation","soothsaying"],"antonyms":["agnosticism","atheism","skepticism"]}],"etymology":{"value":"From 'prophet' + '-ism'. The suffix '-ism' denotes a doctrine, principle, or practice.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈprɒfɪtɪzəm/","syllables":"prof-et-i-zem"},"inflection":{"noun_plural":"prophetisms (rarely used)"},"usage_notes":{"explanation":"'Prophetism' refers to the phenomenon of prophets and their activities, often within a religious context. It can describe the role of a prophet, the messages they convey, or the broader movement associated with prophetic figures. It is often used in religious studies, history, and sociology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced prophetism as a hobby.","correct":"✓ He engaged in prophetic activities.","note":"'Prophetism' is not typically something one 'practices' as a hobby. It refers to the broader phenomenon or movement. Use 'prophetic activities' instead."},{"incorrect":"✗ The book is about prophetism in general.","correct":"✓ The book is about prophecy in general.","note":"'Prophecy' is more commonly used to refer to the act of making predictions or the content of those predictions. 'Prophetism' is more about the role and movement of prophets."}],"priority":"★☆☆"},"related_words":{"derivatives":["prophet","prophetic","prophetically","prophesy","prophecy"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Prophetism' is a relatively abstract and academic term used to describe the role, function, and movement associated with prophets, typically in a religious context. It is most often encountered in scholarly discussions of religion, history, or sociology. Understanding the term requires familiarity with the concept of a 'prophet' and the '-ism' suffix, which denotes a system of beliefs or practices."},"example_sentences":[{"sentence":"The study of ancient prophetism provides insights into the social and religious dynamics of the time.","translation":"古代の預言者運動の研究は、当時の社会的、宗教的力学への洞察を提供する。","type":"general"},{"sentence":"Some scholars argue that prophetism played a crucial role in the development of ethical monotheism.","translation":"一部の学者は、預言者運動が倫理的一神教の発展において重要な役割を果たしたと主張している。","type":"academic"},{"sentence":"The emergence of new forms of prophetism continues to shape religious landscapes in the modern world.","translation":"新しい形の預言者運動の出現は、現代世界の宗教的景観を形作り続けている。","type":"contemporary"}]}