{"word":"outguide","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に図書館で)案内表示、誘導標識","english_definition":"A guide card or sign used in libraries and other filing systems to direct users to the location of specific materials or information.","examples":[{"sentence":"The library uses outguides to indicate where a book has been temporarily removed from the shelves.","translation":"図書館では、本が一時的に棚から取り外されている場所を示すために、アウトガイドを使用しています。"},{"sentence":"Follow the outguides to find the section on local history.","translation":"アウトガイドに従って、地方史のセクションを見つけてください。"}],"collocations":["library outguide","filing system outguide","use outguides","follow the outguide"],"synonyms":["guide card","guide sign","locator card"],"antonyms":[]}],"etymology":{"value":"Derived from 'out' (indicating something removed or absent) and 'guide' (something that directs or leads).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaʊtɡaɪd/","syllables":"out-guide"},"inflection":{"noun_plural":"outguides"},"usage_notes":{"explanation":"An 'outguide' is primarily used in libraries and filing systems to show the temporary absence of an item (e.g., a book, a file) and to direct users to where the item can be found or who has it. It helps maintain order and prevents confusion when items are not in their usual place.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an outguide on the shelf, so I knew the book was out for repair.","correct":"✓ I saw an outguide on the shelf, so I knew the book was checked out by someone or in use.","note":"Outguides don't necessarily mean an item is being repaired; it usually means it's checked out or in use."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["guide card","locator","library signage","filing system"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency - primarily used in library and archival contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'outguide' is a specialized vocabulary primarily used in library science and archival management. It refers to a physical or digital marker indicating that a particular item (e.g., a book, a file) is not currently in its designated location. Understanding this term requires familiarity with library or archival practices."},"example_sentences":[{"sentence":"When a patron borrows a periodical, a staff member inserts an outguide in its place.","translation":"利用者が定期刊行物を借りると、職員は代わりにアウトガイドを挿入します。","type":"noun","meaning_category":"案内表示"},{"sentence":"The outguide indicated that the file was with Ms. Johnson.","translation":"アウトガイドは、ファイルがジョンソンさんの手元にあることを示していました。","type":"noun","meaning_category":"誘導標識"}]}