{"word":"Ridgely","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"A surname.","english_definition":"A surname of English origin.","examples":[{"sentence":"Mr. Ridgely is a well-respected member of the community.","translation":"リッジリーさんは地域社会で尊敬されている人物です。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"A place name, specifically a town in Maryland, USA.","english_definition":"A town in Caroline County, Maryland, United States.","examples":[{"sentence":"We drove through Ridgely on our way to the beach.","translation":"私たちはビーチへ行く途中でリッジリーを通り過ぎました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from an English surname, likely originating as a topographic name for someone who lived near a prominent ridge or clearing (Old English *hrycg* 'ridge' + *leah* 'wood, clearing').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɪdʒli/","syllables":"Ridge-ly"},"inflection":{},"usage_notes":{"explanation":"'Ridgely' is primarily encountered as a surname or a place name. When used as a surname, it follows typical surname conventions. As a place name, it refers to specific locations, most notably the town in Maryland.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_names":["Ridge","Ridgway","Ridgeway"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency as a given name; moderate as a surname and place name.","priority":"★☆☆"},"readability_explanation":{"level":"N/A","text":"'Ridgely' is generally straightforward to read and pronounce for English speakers. Its usage is largely limited to proper nouns, so understanding its context is key to interpreting its meaning.","note":"The name is more common in specific regions of the United States, particularly Maryland."},"example_sentences":[{"sentence":"The Ridgely family has a long history in the town.","translation":"リッジリー家はその町に長い歴史を持っています。","type":"proper noun","meaning_category":"surname"},{"sentence":"Ridgely, Maryland, is a small town with a rich history.","translation":"メリーランド州のリッジリーは、豊かな歴史を持つ小さな町です。","type":"proper noun","meaning_category":"place name"}]}