{"word":"duplicitous-looking","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"二面性があるように見える、腹黒そうに見える、欺瞞的な印象を与える","english_definition":"having an appearance that suggests deceitfulness or hypocrisy; giving the impression of being two-faced.","examples":[{"sentence":"The witness described the suspect as having a duplicitous-looking smile.","translation":"目撃者は、容疑者が二面性があるように見える笑顔をしていたと述べた。"},{"sentence":"He gave me a duplicitous-looking glance, which made me instantly distrust him.","translation":"彼は私に腹黒そうに見える視線を送ってきたので、私はすぐに彼を信用できなくなった。"},{"sentence":"The politician's duplicitous-looking demeanor made it difficult to trust his promises.","translation":"その政治家の欺瞞的な印象を与える態度は、彼の約束を信用することを困難にした。"}],"collocations":["duplicitous-looking smile (腹黒そうに見える笑顔)","duplicitous-looking eyes (腹黒そうに見える目)","duplicitous-looking demeanor (欺瞞的な印象を与える態度)","duplicitous-looking character (腹黒そうに見える性格)"],"synonyms":["deceptive-looking","two-faced-looking","insincere-looking","dishonest-looking","treacherous-looking","hypocritical-looking"],"antonyms":["honest-looking","sincere-looking","trustworthy-looking","genuine-looking","forthright-looking"]},{"part_of_speech":"adjective","definition":"(比喩的に) 外見が欺瞞的な、見かけ倒しの","english_definition":"(figuratively) having a deceptive or misleading appearance; appearing to be something other than what it is.","examples":[{"sentence":"The seemingly simple contract had duplicitous-looking clauses hidden within the fine print.","translation":"一見単純に見える契約書には、細かい文字の中に欺瞞的な条項が隠されていた。"},{"sentence":"The website's duplicitous-looking design tricked many users into sharing their personal information.","translation":"そのウェブサイトの見かけ倒しのデザインは、多くのユーザーを騙して個人情報を共有させた。"}],"collocations":["duplicitous-looking contract (欺瞞的な契約)","duplicitous-looking website (見かけ倒しのウェブサイト)","duplicitous-looking scheme (欺瞞的な計画)"],"synonyms":["misleading-looking","deceiving-looking","illusory-looking","false-looking","specious-looking"],"antonyms":["straightforward-looking","transparent-looking","clear-looking","unambiguous-looking"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"duplicitous\" (characterized by deceit or double-dealing) with \"looking\" (having a particular appearance). \"Duplicitous\" comes from \"duplicity,\" which originates from the Latin word \"duplex\" meaning \"double\" or \"twofold.\"","priority":"N/A"},"pronunciation":{"ipa":"/djuːˈplɪsɪtəs ˈlʊkɪŋ/","syllables":"du-plic-i-tous-look-ing"},"inflection":{"notes":"This is an adjective and does not have different inflectional forms."},"usage_notes":{"explanation":"\"Duplicitous-looking\" describes someone or something whose appearance suggests deceit or hypocrisy. It implies that the subject's outward appearance does not match their true nature or intentions, creating a sense of distrust or suspicion. It is often used to describe facial expressions, demeanor, or even the design of objects or systems intended to deceive. The term is relatively uncommon but can be effective in conveying a strong sense of unease or distrust.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a duplicitous looking.","correct":"✓ He had a duplicitous-looking face.","note":"\"Duplicitous-looking\" is an adjective that needs to modify a noun (e.g., face, smile, eyes). Using it alone as a noun is grammatically incorrect."},{"incorrect":"✗ The contract was duplicitous-look.","correct":"✓ The contract was duplicitous-looking.","note":"The correct form is \"duplicitous-looking,\" with the \"-ing\" ending to function as an adjective."},{"incorrect":"✗ She gave me a duplicitous look, which was duplicitous-looking.","correct":"✓ She gave me a duplicitous look, which made her seem duplicitous-looking.","note":"While both \"duplicitous look\" and \"duplicitous-looking\" can be used, avoid redundancy. Use \"duplicitous look\" as a noun phrase and \"duplicitous-looking\" to describe the appearance or impression created."}],"priority":"N/A"},"related_words":{"derivatives":["duplicitously (adverb)","duplicitousness (noun)"],"related_terms":["duplicity (noun)","deceptive (adjective)","hypocritical (adjective)","insincere (adjective)","two-faced (adjective)"],"priority":"N/A"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"\"Duplicitous-looking\" is a complex adjective that describes an appearance suggesting deceit or hypocrisy. It is not a common word and requires a good understanding of the base word \"duplicity,\" which means deceitfulness. The term is used to convey a strong sense of distrust based on someone's or something's outward appearance. It is more likely to be encountered in literature, formal writing, or sophisticated conversations.","priority":"N/A"},"example_sentences":[{"sentence":"The con artist had a duplicitous-looking charm that fooled many people.","translation":"その詐欺師は多くの人々を騙す、腹黒そうに見える魅力を持っていた。","type":"adjective","meaning_category":"deceptive appearance"},{"sentence":"The old house had a duplicitous-looking facade that hid its dilapidated interior.","translation":"その古い家は、荒廃した内部を隠す欺瞞的な外観をしていた。","type":"adjective","meaning_category":"misleading appearance"},{"sentence":"I couldn't shake the feeling that the new employee had a duplicitous-looking air about him.","translation":"私は、その新しい従業員がどこか腹黒そうに見えるという感覚を拭い去ることができなかった。","type":"adjective","meaning_category":"deceptive impression"}]}