{"word":"X-linked","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"X連鎖の、X染色体連鎖の","english_definition":"relating to a gene or characteristic that is carried on the X chromosome.","examples":[{"sentence":"X-linked recessive disorders are more common in males.","translation":"X連鎖劣性疾患は男性に多い。"},{"sentence":"Color blindness is an X-linked trait.","translation":"色覚異常はX連鎖の形質である。"}],"collocations":["X-linked inheritance (X連鎖遺伝)","X-linked recessive (X連鎖劣性)","X-linked dominant (X連鎖優性)"],"synonyms":["sex-linked","chromosome-linked"],"antonyms":["autosomal"]},{"part_of_speech":"adjective","definition":"X染色体に関連する、X染色体上に存在する","english_definition":"located on or associated with the X chromosome.","examples":[{"sentence":"This gene is X-linked.","translation":"この遺伝子はX染色体上に存在する。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'X-linked' is derived from the fact that the gene or trait is linked to the X chromosome, one of the two sex chromosomes in humans and many other organisms.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeksˌlɪŋkt/","syllables":"X-linked"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'X-linked' is primarily used in genetics and medicine to describe genes, traits, or disorders that are associated with the X chromosome. Because males have only one X chromosome (XY), they are more likely to express X-linked recessive traits, as they do not have a second X chromosome to potentially carry a dominant, non-disease-causing allele. Females (XX), on the other hand, have two X chromosomes, so they are less likely to express X-linked recessive traits unless they inherit the recessive allele on both X chromosomes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The disease is Y-linked, so women are affected.","correct":"✓ The disease is X-linked, so women can be carriers.","note":"Y-linked traits only affect males, as females do not have a Y chromosome. X-linked traits can affect both males and females, though the patterns of inheritance and expression differ."}],"priority":"★★☆"},"related_words":{"derivatives":["X chromosome","sex chromosome","gene","trait","inheritance","recessive","dominant"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'X-linked' is a technical term used in genetics to describe traits or diseases associated with genes located on the X chromosome. It is important to understand that males (XY) have only one X chromosome, making them more susceptible to X-linked recessive disorders, while females (XX) have two, providing a 'backup' copy. This term is primarily encountered in scientific literature, medical contexts, or discussions related to genetic inheritance.","priority":"★★☆"},"example_sentences":[{"sentence":"Duchenne muscular dystrophy is an example of an **X-linked** recessive condition.","translation":"デュシェンヌ型筋ジストロフィーは、X連鎖劣性疾患の一例です。","type":"adjective","meaning_category":"X連鎖の"},{"sentence":"The inheritance pattern of this disease suggests it is **X-linked**.","translation":"この病気の遺伝パターンは、X連鎖であることを示唆しています。","type":"adjective","meaning_category":"X連鎖の"},{"sentence":"Genetic testing can determine if a trait is **X-linked**.","translation":"遺伝子検査で、ある形質がX連鎖であるかどうかを判断できます。","type":"adjective","meaning_category":"X連鎖の"}]}