{"word":"Out-babylon","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(transitive, rare, humorous) To surpass or outdo Babylon (ancient city known for its splendor and excess) in some quality, especially extravagance or decadence.","english_definition":"To exceed or surpass Babylon in some quality, especially extravagance or decadence.","examples":[{"sentence":"The new resort aims to out-babylon anything seen before, with its gold-plated fixtures and diamond-encrusted swimming pools.","translation":"その新しいリゾートは、金メッキの備品やダイヤモンドをちりばめたスイミングプールなど、これまでに見られたものを凌駕することを目指している。"},{"sentence":"His lavish parties out-babylon even the most extravagant celebrations of the wealthy.","translation":"彼の贅沢なパーティーは、富豪たちの最も贅沢な祝賀会さえも凌駕する。"}],"collocations":["out-babylon anything","out-babylon the most extravagant"],"synonyms":["surpass","outdo","exceed","transcend"],"antonyms":["underwhelm","fall short"]}],"etymology":{"value":"Formed from \"out-\" (prefix meaning 'to surpass') + \"Babylon\" (ancient city known for its opulence and decadence). The term plays on the historical image of Babylon as a place of extreme luxury and excess.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊt ˈbæbɪlən/","syllables":"out-bab-y-lon"},"inflection":{"verb_forms":{"present_simple":["out-babylon","out-babylons"],"past_simple":"out-babyloned","past_participle":"out-babyloned","present_participle":"out-babyloning"}},"usage_notes":{"explanation":"The word \"Out-babylon\" is rare and often used humorously or sarcastically. It implies a level of extravagance or decadence that is almost unbelievable or absurd. It is typically used in contexts where someone or something is trying to be excessively luxurious or opulent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city out-babyloned of gold.","correct":"✓ The city out-babyloned in gold.","note":"When using 'out-babylon' to describe something adorned with a material, use 'in'. Alternatively, 'The city out-babyloned all other cities in its use of gold.'"},{"incorrect":"✗ He is out-babyloning.","correct":"✓ He is out-babyloning everyone.","note":"The verb typically requires an object, indicating what is being surpassed."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["Babylon","opulence","extravagance","decadence","luxury"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Out-babylon\" is a rare and sophisticated verb that means to surpass in extravagance or decadence, referencing the historical city of Babylon known for its opulence. Its use is typically humorous or satirical and requires a good understanding of the historical and cultural connotations of Babylon. Due to its rarity, it is not commonly encountered in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The hotel's decor out-babyloned anything I had ever seen, with solid gold toilets and walls lined with precious gems.","translation":"そのホテルの内装は、私が今まで見たことのあるどんなものよりも贅沢で、純金のトイレや宝石で覆われた壁があった。","type":"verb","meaning_category":"surpass in extravagance"},{"sentence":"Their wedding tried to out-babylon all previous celebrity weddings, but it ended up looking gaudy and tasteless.","translation":"彼らの結婚式は、これまでのすべての有名人の結婚式を凌駕しようとしたが、結局けばけばしく、趣味の悪いものになってしまった。","type":"verb","meaning_category":"surpass in extravagance"}]}