{"word":"bottomlands","priority":"3","meanings":[{"part_of_speech":"noun","definition":"低地、特に川沿いの肥沃な平地","english_definition":"Low-lying land along a river or stream, often fertile and subject to flooding.","examples":[{"sentence":"The bottomlands were ideal for growing corn.","translation":"その低地はトウモロコシの栽培に最適だった。"},{"sentence":"Heavy rains caused the bottomlands to flood.","translation":"大雨により、その低地は洪水に見舞われた。"},{"sentence":"Farmers in the region relied on the rich soil of the bottomlands.","translation":"その地域の農家は、低地の肥沃な土壌に頼っていた。"}],"collocations":["fertile bottomlands (肥沃な低地)","floodplain bottomlands (氾濫原の低地)","river bottomlands (川沿いの低地)","coastal bottomlands (沿岸の低地)"],"synonyms":["floodplain","lowlands","river flats","bottom ground","alluvial plain"],"antonyms":["uplands","highlands","hillside"],"related_words":["alluvium","riparian","flood"],"notes":"Bottomlands are typically very fertile due to the deposition of sediment during floods. They are often used for agriculture.","level_frequency":{"frequency_google_ngram":"relatively low","usage":"Primarily used in geographical or agricultural contexts."}}],"etymology":{"value":"Combination of 'bottom' (referring to the lowest part of a valley or river basin) and 'lands' (referring to areas of land).","notes":"The term reflects the geographical location of these lands in the lowest parts of a landscape, often near rivers or streams."},"pronunciation":{"ipa":"/ˈbɒtəmlændz/","syllables":"bot-tom-lands"},"inflection":{"noun_plural":"bottomlands"},"usage_notes":{"explanation":"'Bottomlands' refers specifically to the low-lying land alongside a river or stream. It's often used in discussions of agriculture, ecology, and flood management. The term implies a landscape feature that is both fertile and prone to flooding.","priority":"2"},"common_mistakes":{"examples":[{"incorrect":"The bottomlands were on top of the mountain.","correct":"The bottomlands were at the foot of the mountain, along the river.","note":"Bottomlands are always low-lying, not on high ground."},{"incorrect":"Bottomlands are usually dry and infertile.","correct":"Bottomlands are usually moist and fertile.","note":"Bottomlands are known for their fertility and moisture."}],"priority":"1"},"example_sentences":[{"sentence":"The deer often grazed in the bottomlands near the river.","translation":"鹿はよく川沿いの低地で草を食んでいた。","type":"general"},{"sentence":"Conservation efforts focused on protecting the bottomlands from development.","translation":"保護活動は、低地を開発から守ることに重点を置いていた。","type":"conservation"},{"sentence":"The annual flooding enriched the soil in the bottomlands.","translation":"毎年の洪水が低地の土壌を豊かにした。","type":"agriculture"}]}