{"word":"ghastfulness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"恐怖に満ちた様子、ぞっとする感じ、おぞましさ","english_definition":"A state of being filled with great fear or horror; a feeling of extreme shock or fright.","examples":[{"sentence":"The ghastfulness of the scene left her speechless.","translation":"その光景のおぞましさに、彼女は言葉を失った。"},{"sentence":"He couldn't shake off the ghastfulness he felt after watching the horror movie.","translation":"彼はそのホラー映画を見た後、感じた恐怖を振り払うことができなかった。"}],"collocations":["the ghastfulness of the situation","a feeling of ghastfulness","ghastfulness and dread"],"synonyms":["horror","terror","dread","appallment","frightfulness","atrocity"],"antonyms":["calmness","peace","serenity","tranquility"]}],"etymology":{"value":"\"Ghastfulness\" is derived from \"ghastful\", which combines \"ghast\" (an archaic word for 'to frighten') and the suffix \"-ful\" (meaning 'full of'). The suffix \"-ness\" is added to create the noun form, indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡæstfʊlnəs/","syllables":"ghast-ful-ness"},"inflection":{"noun_plural":"ghastfulnesses (rarely used)"},"usage_notes":{"explanation":"\"Ghastfulness\" is a relatively uncommon word, often used in literary or formal contexts to describe a profound sense of fear, horror, or shock. It emphasizes the intensity and overwhelming nature of the emotion. While \"horror\" or \"terror\" are more frequently used, \"ghastfulness\" can add a more archaic or dramatic flair to the description.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed ghastfulness when he won the lottery.","correct":"✓ He showed excitement when he won the lottery.","note":"\"Ghastfulness\" implies fear or horror, not positive emotions like excitement."},{"incorrect":"✗ The ghastfulness of the sunset was beautiful.","correct":"✓ The beauty of the sunset was breathtaking.","note":"\"Ghastfulness\" is associated with negative, frightening experiences, not beauty."}],"priority":"★★☆"},"related_words":{"derivatives":["ghast (verb: to frighten)","ghastly (adjective: shockingly frightful or dreadful; horrible)","aghast (adjective: struck with overwhelming shock or amazement)","ghastful (adjective: inspiring horror; dreadful)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (rarely used in everyday conversation)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Ghastfulness\" is a rare and sophisticated word used to describe a state of profound fear, horror, or shock. It's more commonly found in literature or formal writing than in everyday conversation. Understanding its meaning requires a good grasp of vocabulary related to intense emotions and archaic language. It is not a word typically encountered by English learners until they reach an advanced level.","priority":"★☆☆"},"example_sentences":[{"sentence":"The ghastfulness of the battlefield was overwhelming.","translation":"戦場の凄惨さは圧倒的だった。","type":"noun","meaning_category":"恐怖に満ちた様子"},{"sentence":"She recoiled in ghastfulness at the sight of the gruesome injury.","translation":"彼女はぞっとするような怪我を見て、恐怖に身を引いた。","type":"noun","meaning_category":"ぞっとする感じ"},{"sentence":"A wave of ghastfulness washed over him as he realized the danger they were in.","translation":"自分たちが置かれている危険に気づいたとき、彼はおぞましさに襲われた。","type":"noun","meaning_category":"おぞましさ"}]}