{"word":"Tetrazine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"テトラジン: 6員環の複素環式化合物で、4つの窒素原子と2つの炭素原子を含むもの。","english_definition":"A six-membered heterocyclic aromatic organic compound with the formula C₂H₂N₄, containing a ring of four nitrogen atoms and two carbon atoms.","examples":[{"sentence":"Tetrazines are used in various chemical applications, including as building blocks in organic synthesis.","translation":"テトラジンは、有機合成の構成要素として、さまざまな化学用途で使用されています。"}],"collocations":["s-tetrazine","asymmetric tetrazine","inverse electron demand Diels-Alder reaction"],"synonyms":["diazine","triazine","pyrimidine","pyridazine","pyrazine"],"antonyms":[]}],"etymology":{"value":"The name 'tetrazine' is derived from 'tetra-' (meaning four, referring to the four nitrogen atoms) and '-azine' (a suffix used for six-membered nitrogen-containing heterocyclic compounds).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛtrəziːn/","syllables":"tet-ra-zine"},"inflection":{"noun_plural":"tetrazines"},"usage_notes":{"explanation":"Tetrazines are a class of heterocyclic compounds that find use in various fields, including chemistry, materials science, and pharmaceuticals. They are often involved in click chemistry reactions, particularly inverse electron demand Diels-Alder reactions, due to their reactivity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Tetrazine is a element.","correct":"✓ Tetrazine is a compound.","note":"Tetrazine is a compound, not an element."}],"priority":"★★☆"},"related_words":{"derivatives":["tetrazinyl"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Tetrazine is a technical term in organic chemistry, referring to a specific type of heterocyclic compound. Understanding its properties and uses requires advanced knowledge in chemistry. It's not a word commonly encountered outside of scientific contexts."},"example_sentences":[{"sentence":"The synthesis of novel tetrazine derivatives was reported in the journal.","translation":"新規テトラジン誘導体の合成がその雑誌で報告されました。","type":"scientific","meaning_category":"chemical compound"},{"sentence":"Tetrazine-based dyes are used in some specialized applications.","translation":"テトラジンベースの染料は、いくつかの特殊な用途で使用されています。","type":"scientific","meaning_category":"chemical compound"}]}