{"word":"Coccidioides","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"コクシジオイデス属（真菌の一種で、コクシジオイデス症の原因となる）","english_definition":"A genus of fungi that can cause coccidioidomycosis (also known as Valley Fever) in humans and animals.","examples":[{"sentence":"Coccidioides immitis and Coccidioides posadasii are the two species in the genus Coccidioides that cause disease.","translation":"コクシジオイデス・イミティスとコクシジオイデス・ポサダシイは、コクシジオイデス属に属する2つの種であり、病気を引き起こします。"},{"sentence":"Infection with Coccidioides usually occurs by inhaling airborne spores.","translation":"コクシジオイデスへの感染は通常、空気中の胞子を吸入することによって起こります。"}],"collocations":["Coccidioides immitis","Coccidioides posadasii","Coccidioides infection","Coccidioidomycosis","Valley Fever"],"synonyms":["None (scientific name)"],"antonyms":["None (scientific name)"]}],"etymology":{"value":"The name Coccidioides is derived from the Greek words 'kokkos' (berry) and 'ides' (resembling), referring to the spherules formed by the fungus in host tissues.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒkˌsɪdiˈɔɪdiːz/","syllables":"coc-cid-i-oi-des"},"inflection":{"notes":"Plural form is Coccidioides (genus name)."},"usage_notes":{"explanation":"Coccidioides is a genus of fungi that includes two species, Coccidioides immitis and Coccidioides posadasii. These fungi are responsible for causing coccidioidomycosis, also known as Valley Fever or California Fever. The infection typically occurs through the inhalation of airborne spores found in soil, particularly in arid and semi-arid regions of the southwestern United States, parts of Mexico, and South America. While many infections are asymptomatic, some individuals may develop flu-like symptoms, pneumonia, or, in rare cases, disseminated disease affecting various organs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Coccidioides is a bacteria.","correct":"✓ Coccidioides is a fungus.","note":"Coccidioides is a type of fungus, not bacteria."},{"incorrect":"✗ Coccidioides only affects animals.","correct":"✓ Coccidioides can affect both humans and animals.","note":"Coccidioides can infect both humans and animals."}],"priority":"★★☆"},"related_words":{"derivatives":["Coccidioidomycosis","Valley Fever","Coccidioidin skin test"],"phrasal_verbs":["None"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Coccidioides' is a scientific term referring to a genus of fungi. It is primarily encountered in medical or scientific contexts when discussing coccidioidomycosis, also known as Valley Fever. Understanding this term requires familiarity with basic microbiology and medical terminology. The word's complexity stems from its scientific classification and association with a specific disease. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The patient was diagnosed with coccidioidomycosis after testing positive for Coccidioides.","translation":"患者はコクシジオイデスの検査で陽性反応が出た後、コクシジオイデス症と診断されました。","type":"noun","meaning_category":"Fungus"},{"sentence":"Coccidioides thrives in the arid soils of the southwestern United States.","translation":"コクシジオイデスはアメリカ南西部の乾燥した土壌で繁殖します。","type":"noun","meaning_category":"Fungus"}]}