{"word":"quasi-enforced","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"準強制的な、半ば強制的な","english_definition":"Enforced to some degree, but not fully or officially; resembling enforcement.","examples":[{"sentence":"The rule was quasi-enforced, with some teachers adhering to it strictly while others ignored it.","translation":"その規則は準強制的に施行され、厳格に従う教師もいれば、無視する教師もいた。"},{"sentence":"A quasi-enforced dress code led to a variety of interpretations among students.","translation":"準強制的な服装規定は、学生の間でさまざまな解釈を生んだ。"}],"collocations":["quasi-enforced regulation","quasi-enforced policy","quasi-enforced rule"],"synonyms":["partially enforced","partly enforced","semi-enforced","loosely enforced"],"antonyms":["fully enforced","strictly enforced","completely enforced"]},{"part_of_speech":"adjective","definition":"事実上強制された","english_definition":"Effectively enforced, though not by formal means.","examples":[{"sentence":"Although there was no official curfew, a quasi-enforced restriction kept students in their dorms after midnight.","translation":"公式な門限はなかったが、事実上強制された制限により、学生は真夜中以降は寮に留まっていた。"}],"collocations":["quasi-enforced restriction","quasi-enforced curfew"],"synonyms":["de facto enforced","virtually enforced","effectively enforced"],"antonyms":["unenforced","non-existent"]}],"etymology":{"value":"Combines \"quasi-\" (meaning \"resembling\" or \"somewhat\") with \"enforced\" (meaning \"compelled to observe\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪ ɪnˈfɔːrst/","syllables":"quasi-en-forced"},"inflection":{"notes":"Adjective; does not inflect for number or gender."},"usage_notes":{"explanation":"\"Quasi-enforced\" describes situations where a rule, law, or policy is not strictly or officially enforced, but there is still some level of compulsion or pressure to comply. This can occur due to social norms, informal agreements, or inconsistent application of the rules. The degree of enforcement can vary.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The quasi-enforced law was completely ignored by everyone.","correct":"✓ The quasi-enforced law was largely ignored by many.","note":"If a law is quasi-enforced, it cannot be completely ignored by everyone, as the \"quasi-\" prefix implies some degree of enforcement."},{"incorrect":"✗ The quasi-enforced rule was more enforced than the official one.","correct":"✓ The quasi-enforced rule was nearly as enforced as the official one.","note":"A quasi-enforced rule is typically less enforced than an official one. If it's more enforced, the term is inappropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["quasi (adverb, adjective)","enforce (verb)","enforcement (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"quasi-enforced\" is a relatively uncommon term that combines the prefix \"quasi-\" (meaning \"resembling\" or \"somewhat\") with the word \"enforced.\" It describes a situation where a rule or policy is not strictly or officially enforced, but there is still some degree of pressure or expectation to comply. Understanding this term requires familiarity with both the prefix \"quasi-\" and the concept of enforcement."},"example_sentences":[{"sentence":"The company had a quasi-enforced policy of casual Fridays, where some departments participated while others did not.","translation":"その会社には準強制的なカジュアルフライデーのポリシーがあり、参加する部署もあれば、そうでない部署もあった。","type":"adjective","meaning_category":"準強制的な"},{"sentence":"A quasi-enforced agreement among neighbors kept noise levels down after 10 PM.","translation":"近隣住民間の事実上強制された合意により、午後10時以降の騒音レベルは抑制された。","type":"adjective","meaning_category":"事実上強制された"}]}