{"word":"nongerminal","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"末端でない、終端でない、生殖細胞系列でない","english_definition":"Not located at the end or extremity; not relating to the germline.","examples":[{"sentence":"The mutation occurred in a nongerminal cell, so it is not heritable.","translation":"その変異は非生殖細胞で起こったため、遺伝しません。"},{"sentence":"Nongerminal deletions in the mitochondrial genome have been observed.","translation":"ミトコンドリアゲノムにおける非生殖細胞系列の欠失が観察されています。"},{"sentence":"The study focused on nongerminal mutations in cancer cells.","translation":"その研究は、がん細胞における非生殖細胞系列の変異に焦点を当てました。"}],"collocations":["nongerminal mutation","nongerminal cell","nongerminal tissue"],"synonyms":["non-terminal","internal","somatic"],"antonyms":["terminal","germinal"]},{"part_of_speech":"adjective","definition":"（言語学で）終端記号でない","english_definition":"(Linguistics) Not being a terminal symbol.","examples":[{"sentence":"The grammar contains both terminal and nongerminal symbols.","translation":"その文法は、終端記号と非終端記号の両方を含んでいます。"},{"sentence":"Nongerminal symbols can be further expanded by production rules.","translation":"非終端記号は、生成規則によってさらに展開できます。"},{"sentence":"The parser replaces nongerminal symbols with their corresponding productions.","translation":"パーサーは、非終端記号を対応する生成規則に置き換えます。"}],"collocations":["nongerminal symbol","nongerminal vocabulary"],"synonyms":["nonterminal"],"antonyms":["terminal"]}],"etymology":{"value":"From 'non-' (not) + 'germinal' (relating to germs or origin).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈdʒɜːrmɪnəl/","syllables":"non-ger-mi-nal"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparative/superlative forms, which are less common for this word."},"usage_notes":{"explanation":"The term 'nongerminal' is used in biology and linguistics. In biology, it refers to cells or mutations that are not part of the germline (reproductive cells) and therefore not heritable. In linguistics, it refers to symbols in a formal grammar that can be replaced by other symbols or terminals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nongerminal cell divided into two germinal cells.","correct":"✓ The somatic cell divided into two cells.","note":"Nongerminal cells do not become germinal cells. Somatic cells are the opposite of germinal cells."}],"priority":"★★☆"},"related_words":{"derivatives":["nongerminally"],"related":["germinal","germline","somatic","terminal"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nongerminal' is a technical term primarily used in the fields of biology (genetics) and linguistics (formal grammar). Its meaning is derived directly from its components: 'non-' (not) and 'germinal' (relating to the germline or reproductive cells, or relating to the beginning or origin). Therefore, in biology, it refers to something not related to the germline, and in linguistics, it refers to a symbol that is not a terminal symbol. Understanding the context is crucial for correct interpretation.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers investigated the effects of the drug on nongerminal cells.","translation":"研究者たちは、その薬物が非生殖細胞に及ぼす影響を調査しました。","type":"biology","meaning_category":"biology"},{"sentence":"The parser uses production rules to expand nongerminal symbols.","translation":"パーサーは、生成規則を使用して非終端記号を展開します。","type":"linguistics","meaning_category":"linguistics"}]}