{"word":"sociodrama","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"社会劇、社会構成劇：特定の社会問題や対人関係の問題を、即興劇を通して探求・解決しようとする心理療法の一種","english_definition":"A form of psychotherapy in which participants act out roles in a social situation in order to explore and resolve problems.","examples":[{"sentence":"Sociodrama can be a powerful tool for addressing issues like bullying and discrimination.","translation":"社会劇は、いじめや差別といった問題に取り組むための強力なツールとなりうる。"},{"sentence":"In the sociodrama session, participants explored different ways to handle conflict in the workplace.","translation":"社会劇のセッションで、参加者たちは職場での対立を処理するさまざまな方法を探求した。"},{"sentence":"The therapist used sociodrama to help the patient understand their role in the family dynamic.","translation":"セラピストは社会劇を用いて、患者が家族関係における自身の役割を理解するのを助けた。"}],"collocations":["conduct a sociodrama (社会劇を行う)","participate in a sociodrama (社会劇に参加する)","use sociodrama as therapy (社会劇を療法として用いる)","sociodrama session (社会劇セッション)","sociodrama technique (社会劇テクニック)"],"synonyms":["role-playing","psychodrama","group therapy","therapeutic drama"],"antonyms":[]}],"etymology":{"value":"\"socio-\" (社会の) + \"drama\" (劇) の合成語。社会的な状況や問題を劇を通して扱うことに由来する。","priority":"★★★"},"pronunciation":{"ipa":"/ˌsoʊsioʊˈdrɑːmə/","syllables":"so-ci-o-dra-ma"},"inflection":{"noun_plural":"sociodramas"},"usage_notes":{"explanation":"Sociodrama is a therapeutic technique used to explore social issues and interpersonal relationships through role-playing and improvisation. It differs from psychodrama in that it focuses on broader social contexts rather than individual psychological issues. Participants act out roles related to a specific social problem, allowing them to gain insight, develop empathy, and practice new behaviors. It is often used in group settings to address issues such as conflict resolution, prejudice, and social skills.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is doing a sociodramatic performance for the school play.","correct":"✓ He is participating in a sociodrama session to address bullying.","note":"Sociodrama is a therapeutic technique, not a performance for entertainment. It is used to explore and resolve social issues. The first sentence is more appropriate for describing a school play or theatrical performance."},{"incorrect":"✗ Sociodrama is only for people with severe mental illnesses.","correct":"✓ Sociodrama can be helpful for anyone facing social challenges or wanting to improve their interpersonal skills.","note":"Sociodrama is not limited to individuals with severe mental illnesses. It can be beneficial for anyone looking to understand and improve their social interactions and address social issues."}],"priority":"★★☆"},"related_words":{"derivatives":["sociodramatic (adjective: 社会劇の、社会構成劇的な)"],"phrasal_verbs":[],"related_terms":["psychodrama (心理劇)","role-playing (ロールプレイング)","group therapy (集団療法)","therapeutic theatre (セラピューティックシアター)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語に近い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Sociodrama\" is a specialized term used in psychology and therapy. It refers to a technique where people act out social situations to understand and work through problems. It's like role-playing, but it focuses on social issues rather than individual ones. This term is not commonly used in everyday conversation. Understanding its meaning requires some familiarity with psychological concepts and therapeutic practices."},"example_sentences":[{"sentence":"The teacher used **sociodrama** to help students understand different perspectives on the issue of immigration.","translation":"教師は社会劇を用いて、生徒たちが移民問題に対するさまざまな視点を理解するのを助けた。","type":"noun","meaning_category":"社会劇"},{"sentence":"The **sociodrama** session focused on improving communication skills in a diverse workplace.","translation":"その社会劇セッションは、多様な職場におけるコミュニケーションスキル向上に焦点を当てた。","type":"noun","meaning_category":"社会劇"},{"sentence":"Through **sociodrama**, the participants were able to explore the dynamics of power and privilege in their community.","translation":"社会劇を通して、参加者たちは地域社会における権力と特権の力学を探求することができた。","type":"noun","meaning_category":"社会劇"}]}