{"word":"centonism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(文学)既存の文章やフレーズを寄せ集めて作られた作品、特に意図的に新しい意味や文脈を作り出すために行われるもの。","english_definition":"A literary composition made up of passages from different authors or works, especially when intended to create a new meaning or context.","examples":[{"sentence":"The poem was a centonism, drawing lines from various classical poets to create a modern lament.","translation":"その詩は、様々な古典詩人からの引用を集めて現代的な哀歌を作り出した百家詩だった。"},{"sentence":"The artist's work could be described as a visual centonism, combining elements from different artistic styles and periods.","translation":"そのアーティストの作品は、異なる芸術様式や時代からの要素を組み合わせた視覚的な百家詩と表現できるだろう。"}],"collocations":["literary centonism","visual centonism","create a centonism","example of centonism"],"synonyms":["pastiche","collage","medley","potpourri","compilation"],"antonyms":[]}],"etymology":{"value":"ラテン語の \"cento\" (パッチワークの衣服) から派生。これはギリシャ語の \"κέντρων\" (kentron, 鋭利な道具、針) に由来し、縫い合わせるという概念に関連する。","priority":"★★☆"},"pronunciation":{"ipa":"ˈsɛn.tən.ɪzəm","syllables":"cen-ton-ism"},"inflection":{"noun_plural":"centonisms"},"usage_notes":{"explanation":"「centonism」は、既存の作品からの断片を再利用して新しい作品を創造する手法を指します。これは、文学、音楽、視覚芸術など、さまざまな分野で見られます。centonismの目的は、単に既存の要素を組み合わせるだけでなく、新しい意味や文脈を生み出すことです。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a centonism about the French Revolution using only his own words.","correct":"✓ He wrote a poem about the French Revolution, influenced by various historical accounts.","note":"centonismは既存のソースからの引用を伴うため、完全にオリジナルの作品はcentonismとは言えません。"},{"incorrect":"✗ The painting was a centonism, but it was completely original.","correct":"✓ The painting was inspired by various styles, creating a unique and innovative piece.","note":"centonismは既存の要素を再利用するため、「完全にオリジナル」とは矛盾します。"},{"incorrect":"✗ Centonism is the same as plagiarism.","correct":"✓ Centonism is a creative technique that reuses existing material to create something new, while plagiarism is the act of taking someone else's work and passing it off as your own.","note":"centonismは引用元を認識し、新しい文脈で再利用することを意図しますが、plagiarismは他人の作品を盗用し、自分のものとして発表する行為です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["centon (名詞: 百家詩)"],"related_terms":["pastiche","collage","bricolage","appropriation","intertextuality"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**centonism**」は、複数の既存の作品から引用やフレーズを意図的に集めて、新しい作品を作り出す文学的な手法を指します。この手法は、単に既存の要素を組み合わせるだけでなく、新しい意味や解釈を生み出すことを目的としています。例えば、詩人が異なる詩からの行を組み合わせて、新しい感情やテーマを表現する詩を作ることがあります。この単語は、学術的な文脈や文学批評でよく使用されます。"},"example_sentences":[{"sentence":"The novel employs centonism by weaving together quotes from classic literature to comment on contemporary society.","translation":"その小説は、古典文学からの引用を織り交ぜて現代社会について論評するという百家詩の手法を用いている。","type":"general","meaning_category":"文学"},{"sentence":"Her art installation was a centonism of found objects, each with its own history and significance.","translation":"彼女のアートインスタレーションは、それぞれ独自の歴史と意味を持つ拾得物で作られた百家詩だった。","type":"general","meaning_category":"芸術"},{"sentence":"The composer created a musical centonism by incorporating fragments of traditional folk songs into a modern symphony.","translation":"その作曲家は、伝統的な民謡の断片を現代的な交響曲に組み込むことで、音楽的な百家詩を作り出した。","type":"general","meaning_category":"音楽"}]}