{"word":"Prophloem","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学) 原生篩部（げんせいしぶ）: 維管束植物において、一次木部組織の分化に続いて形成される篩部組織。","english_definition":"(Botany) The primary phloem tissue that differentiates after the primary xylem tissue in vascular plants.","examples":[{"sentence":"The prophloem is responsible for the early transport of nutrients in the developing plant.","translation":"原生篩部は、発達中の植物における初期の栄養輸送を担う。"},{"sentence":"The cells of the prophloem are typically smaller and less specialized than those of the metaphloem.","translation":"原生篩部の細胞は、通常、後生篩部の細胞よりも小さく、専門化されていない。"}],"collocations":["prophloem cell (原生篩部細胞)","prophloem development (原生篩部発達)","primary phloem (一次篩部)","metaphloem (後生篩部)"],"synonyms":["primary phloem","protophloem"],"antonyms":["metaphloem"],"notes":"Prophloem is a part of the primary phloem, which also includes metaphloem. Prophloem develops first, followed by metaphloem.","images":[]}],"etymology":{"value":"Derived from the Greek words 'pro' (before) and 'phloem' (inner bark).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈproʊˌfloʊem/","syllables":"pro-phlo-em"},"inflection":{"noun_plural":"prophloems"},"usage_notes":{"explanation":"Prophloem is a term used specifically in botany to describe a type of plant tissue. It is not commonly used outside of scientific contexts. Understanding the difference between prophloem and metaphloem is important in plant anatomy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The prophloem is responsible for water transport.","correct":"✓ The prophloem is responsible for nutrient transport.","note":"Prophloem transports nutrients, while xylem transports water."}],"priority":"★★☆"},"related_words":{"derivatives":["phloem","xylem","vascular bundle","sieve element","companion cell"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Prophloem' is a technical term in plant biology referring to the early-developing part of the phloem, which transports nutrients in plants. It's more specialized than 'phloem' and typically appears in advanced biology texts. Understanding requires familiarity with plant anatomy and vascular tissue concepts."},"example_sentences":[{"sentence":"The **prophloem** differentiates early in the development of the vascular bundle.","translation":"原生篩部は、維管束の発達の初期に分化する。","type":"noun","meaning_category":"植物学"},{"sentence":"Nutrient transport begins with the **prophloem** and continues with the metaphloem as the plant matures.","translation":"栄養輸送は原生篩部から始まり、植物の成熟とともに後生篩部へと続く。","type":"noun","meaning_category":"植物学"}]}