{"word":"Rabbitberries","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of berry, specifically the fruit of the Shepherdia canadensis plant, also known as soapberry or buffaloberry.","english_definition":"The edible fruit of the Shepherdia canadensis plant, characterized by a bitter or soapy taste.","examples":[{"sentence":"Rabbitberries are a traditional food source for some indigenous peoples of North America.","translation":"ラビットベリーは、北米の先住民族にとって伝統的な食料源です。"},{"sentence":"The tart flavor of rabbitberries can be an acquired taste.","translation":"ラビットベリーの酸味のある風味は、慣れるまで時間がかかるかもしれません。"}],"collocations":["eat rabbitberries","harvest rabbitberries","rabbitberry jam","rabbitberry syrup"],"synonyms":["soapberry","buffaloberry","Shepherdia canadensis fruit"],"antonyms":[]}],"etymology":{"value":"The name likely comes from its association with areas where rabbits are found, or from a perceived resemblance of the berries to something rabbits might eat.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈræbɪtˌbɛriz/","syllables":"Rab-bit-ber-ries"},"inflection":{"noun_plural":"Rabbitberries"},"usage_notes":{"explanation":"Rabbitberries are typically found in North America. They are known for their somewhat bitter or soapy taste, which is due to the presence of saponins. They are often used in traditional foods, sometimes mixed with sweeter ingredients to balance the flavor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Rabbitberry is a type of rabbit.","correct":"✓ Rabbitberry is a type of berry.","note":"Rabbitberries are fruits, not animals."}],"priority":"★☆☆"},"related_words":{"derivatives":["None"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"Rabbitberries are the fruits of the Shepherdia canadensis plant, also known as soapberries or buffaloberries. These berries are native to North America and are known for their bitter or soapy taste due to the presence of saponins. They are traditionally used by indigenous peoples in various food preparations, often mixed with other ingredients to balance the flavor. The term is not commonly used in everyday conversation, so familiarity with it is more likely among those with an interest in botany, foraging, or North American indigenous cultures."},"example_sentences":[{"sentence":"The hikers foraged for rabbitberries along the trail.","translation":"ハイカーたちはトレイル沿いでラビットベリーを探した。","type":"noun","meaning_category":"berry"},{"sentence":"Shepherdia canadensis, or rabbitberry, is a shrub native to North America.","translation":"Shepherdia canadensis、すなわちラビットベリーは、北米原産の低木です。","type":"noun","meaning_category":"berry"}]}