{"word":"antieducationally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"反教育的に、教育に反して","english_definition":"in a manner that is opposed to or undermines education.","examples":[{"sentence":"The policy was implemented antieducationally, leading to a decline in student performance.","translation":"その政策は反教育的に実施され、生徒の成績低下につながった。"},{"sentence":"The program was designed antieducationally, failing to promote critical thinking skills.","translation":"そのプログラムは反教育的に設計され、批判的思考スキルを促進することができなかった。"}],"collocations":["act antieducationally","implement antieducationally","design antieducationally"],"synonyms":["counterproductively","detrimentally","harmfully"],"antonyms":["educationally","constructively","beneficially"]}],"etymology":{"value":"\"anti-\" (反対) + \"educationally\" (教育的に)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˌedʒuˈkeɪʃənəli/","syllables":"an-ti-ed-u-ca-tion-al-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"The adverb \"antieducationally\" describes actions or policies that have a negative impact on education or are contrary to its goals. It is often used to criticize approaches that undermine learning or fail to support educational development.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The new rules were antieducational.","correct":"✓ The new rules were antieducationally implemented. / ✓ The new rules were detrimental to education.","note":"\"Antieducational\" is an adjective, while \"antieducationally\" is an adverb. Use the adjective to describe something that opposes education, and the adverb to describe how something is done in a way that opposes education. If you want to use an adjective, consider using \"detrimental to education\" or \"antieducational\"."}],"priority":"★★☆"},"related_words":{"derivatives":["antieducational (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"antieducationally\" is an advanced term used to describe something done in a way that is harmful or contrary to the goals of education. It's not commonly used and is typically found in academic or critical discussions about educational policies or practices. Understanding this word requires a good grasp of the meaning of \"educationally\" and the prefix \"anti-\", which means against or opposite."},"example_sentences":[{"sentence":"The curriculum was revised antieducationally, resulting in a narrower range of subjects.","translation":"カリキュラムは反教育的に改訂され、科目の範囲が狭まった。","type":"adverb","meaning_category":"反教育的に"},{"sentence":"The school board acted antieducationally by cutting funding for arts programs.","translation":"教育委員会は芸術プログラムへの資金を削減することで反教育的に行動した。","type":"adverb","meaning_category":"教育に反して"}]}