{"word":"day-eased","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(rare) Made comfortable or relieved by a day's rest.","english_definition":"(rare) Having been made comfortable or relieved by a day's rest.","examples":[{"sentence":"After a day of rest, the patient felt day-eased and ready to resume their activities.","translation":"一日の休息の後、患者は楽になり、活動を再開する準備ができたと感じた。"}],"collocations":[],"synonyms":["rested","refreshed","relaxed","rejuvenated"],"antonyms":["fatigued","exhausted","weary"]}],"etymology":{"value":"Likely a compound word formed from \"day\" and \"eased\", suggesting a state of being relieved or made comfortable by a day's duration.","priority":"N/A"},"pronunciation":{"ipa":"/ˈdeɪ iːzd/","syllables":"day-eased"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs (e.g., very day-eased). It can also be used in comparative and superlative forms, though this is extremely rare and would sound unusual (e.g., more day-eased, most day-eased)."},"usage_notes":{"explanation":"The word \"day-eased\" is extremely rare and not commonly used in modern English. It is more likely to be encountered in older texts or as a neologism. Its meaning is generally understood to describe someone who feels better or more comfortable after a day of rest.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["ease (verb, noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"day-eased\" is not in common usage. If encountered, it should be understood as meaning 'rested' or 'refreshed' after a day of relaxation. Due to its rarity, it's best to avoid using this word in contemporary writing or conversation unless aiming for a specific archaic effect."},"example_sentences":[{"sentence":"The traveler, weary from their journey, felt remarkably day-eased after a night's sleep and a leisurely morning.","translation":"旅に疲れた旅行者は、一晩の睡眠とゆったりとした朝を過ごした後、驚くほど楽になったと感じた。","type":"adjective","meaning_category":"rested"}]}