{"word":"anabolism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"同化作用、合成代謝","english_definition":"The set of metabolic pathways that construct molecules from smaller units. These processes require energy.","examples":[{"sentence":"Anabolism is essential for growth and repair in living organisms.","translation":"同化作用は、生物の成長と修復に不可欠です。"},{"sentence":"During anabolism, simple molecules are assembled into complex ones.","translation":"同化作用中、単純な分子が複雑な分子へと組み立てられます。"}],"collocations":["protein anabolism","muscle anabolism","promote anabolism","support anabolism"],"synonyms":["biosynthesis","constructive metabolism"],"antonyms":["catabolism"]},{"part_of_speech":"noun","definition":"(医学、特にスポーツ医学)筋肉増強","english_definition":"(In medicine, especially sports medicine) The building up of muscle mass.","examples":[{"sentence":"He is taking supplements to promote anabolism and build muscle.","translation":"彼は同化作用を促進し、筋肉を増強するためにサプリメントを摂取しています。"},{"sentence":"Anabolic steroids are sometimes used to increase anabolism, but they have serious side effects.","translation":"アナボリックステロイドは、同化作用を高めるために使用されることがありますが、深刻な副作用があります。"}],"collocations":["anabolic steroids","anabolic state","anabolic window","increase anabolism","enhance anabolism"],"synonyms":["muscle growth","muscle building"],"antonyms":["muscle loss","muscle atrophy"]}],"etymology":{"value":"From Greek ἀναβολή (anabolē) 'a raising up', from ἀναβάλλειν (anaballein) 'to throw up, build up', from ἀνά (ana) 'up' + βάλλειν (ballein) 'to throw'.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈnæbəlɪzəm/","syllables":"a-nab-o-lism","audio_url":null},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Anabolism is one of the two major categories of metabolism, the other being catabolism. Anabolism involves building up complex molecules from simpler ones, requiring energy. It's crucial for growth, maintenance, and repair of tissues. In sports medicine, anabolism is often associated with muscle growth, and anabolic steroids are sometimes misused to enhance this process.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Anabolism is the breaking down of molecules.","correct":"✓ Anabolism is the building up of molecules.","note":"Anabolism is the building up, not the breaking down, of molecules. Catabolism is the breaking down process."},{"incorrect":"✗ Anabolic steroids are safe for muscle growth.","correct":"✓ Anabolic steroids have serious side effects and should be used with caution.","note":"Anabolic steroids have significant health risks and should not be considered a safe way to build muscle."}],"priority":"★★☆"},"related_words":{"derivatives":["anabolic (adjective)","anabolically (adverb)"],"phrasal_verbs":null,"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency in general use, more common in scientific and medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Anabolism' is a scientific term primarily used in biology and medicine. It refers to the process where the body builds complex molecules from smaller ones, requiring energy. This is essential for growth, repair, and maintenance of tissues. In sports, it's often associated with muscle growth. The word is not commonly used in everyday conversation but is important in scientific and medical contexts."},"example_sentences":[{"sentence":"The athlete focused on nutrition to maximize anabolism after workouts.","translation":"その運動選手は、ワークアウト後の同化作用を最大化するために栄養に焦点を当てました。","type":"noun","meaning_category":"同化作用"},{"sentence":"Increased anabolism leads to muscle hypertrophy.","translation":"同化作用の増加は、筋肉の肥大につながります。","type":"noun","meaning_category":"筋肉増強"},{"sentence":"Hormones play a critical role in regulating anabolism.","translation":"ホルモンは同化作用の調節において重要な役割を果たします。","type":"noun","meaning_category":"同化作用"}]}