{"word":"flush-decker","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"平甲板船 (へいかんぱんせん): 船首から船尾まで甲板が平らな船。","english_definition":"A vessel having a deck running the length of the ship from stem to stern, without any raised structures such as forecastles or poops.","examples":[{"sentence":"The old flush-decker sailed smoothly across the waves.","translation":"その古い平甲板船は波の上を滑らかに進んだ。"},{"sentence":"Flush-deckers were popular for their simplicity and ease of construction.","translation":"平甲板船はその単純さと建造の容易さから人気があった。"}],"collocations":["old flush-decker","small flush-decker"],"synonyms":["flat-decked vessel"],"antonyms":["raised-deck vessel"],"notes":"Flush-deckers are characterized by a clean, unobstructed deck, which can be advantageous for certain types of cargo or activities."}],"etymology":{"value":"The term 'flush-decker' comes from the description of the deck being 'flush,' meaning level or even, from one end of the ship to the other.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflʌʃˌdɛkər/","syllables":"flush-deck-er"},"inflection":{"noun_plural":"flush-deckers"},"usage_notes":{"explanation":"A flush-decker is a type of ship design where the main deck runs continuously from the bow to the stern at a single level. This design contrasts with ships that have raised forecastles, poops, or other structures that interrupt the continuity of the deck. Flush-deck designs were often favored for their simplicity and ease of construction, as well as for providing a clear, unobstructed working area on deck.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The flush-decker had a large forecastle.","correct":"✓ The flush-decker did not have a forecastle.","note":"A defining characteristic of a flush-decker is the absence of raised structures like forecastles or poops."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["forecastle","poop deck","deck","ship","vessel"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized maritime term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'flush-decker' refers to a specific type of ship design. Understanding this term requires some familiarity with nautical terminology. It is not a commonly used word in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The flush-decker was easy to navigate because of its simple design.","translation":"その平甲板船はシンプルな設計のため、操縦が容易だった。","type":"general","meaning_category":"description"},{"sentence":"Many fishing boats in the early 20th century were flush-deckers.","translation":"20世紀初頭の多くの漁船は平甲板船だった。","type":"historical","meaning_category":"example"}]}