{"word":"pinsetter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ボーリングの)ピンセッター、ピン並べ機","english_definition":"A machine that automatically resets bowling pins after they have been knocked down.","examples":[{"sentence":"The pinsetter malfunctioned, causing a delay in the game.","translation":"ピンセッターが故障し、ゲームが遅延した。"},{"sentence":"He works as a mechanic, repairing pinsetters at the bowling alley.","translation":"彼はボーリング場でピンセッターを修理する整備士として働いている。"}],"collocations":["automatic pinsetter","pinsetter malfunction","repair a pinsetter"],"synonyms":["automatic pinspotter"],"antonyms":[]}],"etymology":{"value":"Combination of 'pin' (referring to bowling pins) and 'setter' (one who sets or arranges).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪnˌsɛtər/","syllables":"pin-set-ter"},"inflection":{"noun_plural":"pinsetters"},"usage_notes":{"explanation":"The term 'pinsetter' is commonly used in the context of bowling to refer to the automated machine that replaces pins after each frame. It can also refer to a person who manually sets the pins, although this is less common in modern bowling alleys.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pinsetter is broken, so we have to set the pins by hand.","correct":"✓ The pinsetter is broken, so we have to set the pins manually.","note":"'By hand' is a more general term for doing something without a machine. 'Manually' specifically implies doing something by hand instead of by machine."}],"priority":"★★☆"},"related_words":{"derivatives":["pinspotter (synonym)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'pinsetter' is specific to the context of bowling. It refers to the machine that automatically sets up the pins after they have been knocked down. Understanding this term requires familiarity with the sport of bowling and its equipment. While not a common word in everyday conversation, it is essential for understanding discussions related to bowling.","priority":"★★☆"},"example_sentences":[{"sentence":"The bowling alley invested in new, more reliable **pinsetters**.","translation":"そのボーリング場は、より信頼性の高い新しいピンセッターに投資した。","type":"noun","meaning_category":"machine"},{"sentence":"The **pinsetter** arm got stuck, and the pins didn't reset correctly.","translation":"ピンセッターのアームが詰まって、ピンが正しくリセットされなかった。","type":"noun","meaning_category":"machine"}]}