{"word":"pro-worker","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"労働者擁護の、労働者に有利な、労働者寄りの","english_definition":"Supporting or advocating for the interests and rights of workers.","examples":[{"sentence":"The senator is known for his pro-worker stance on labor issues.","translation":"その上院議員は、労働問題に関する労働者擁護の姿勢で知られています。"},{"sentence":"The new legislation is designed to be pro-worker, providing better wages and benefits.","translation":"その新しい法律は、より良い賃金と福利厚生を提供し、労働者に有利になるように設計されています。"},{"sentence":"The union is pushing for pro-worker policies that will protect jobs and improve working conditions.","translation":"労働組合は、雇用を保護し、労働条件を改善する労働者寄りの政策を推進しています。"}],"collocations":["pro-worker policies (労働者擁護政策)","pro-worker legislation (労働者擁護法)","pro-worker agenda (労働者擁護アジェンダ)","pro-worker stance (労働者擁護の姿勢)","pro-worker attitude (労働者擁護の態度)","pro-worker candidate (労働者擁護の候補者)"],"synonyms":["labor-friendly","worker-oriented","employee-supportive","union-friendly"],"antonyms":["anti-worker","anti-union","pro-business","employer-friendly"]},{"part_of_speech":"noun","definition":"労働者擁護者、労働者支持者","english_definition":"A person who supports or advocates for the interests and rights of workers.","examples":[{"sentence":"She is a well-known pro-worker who has dedicated her career to fighting for fair labor practices.","translation":"彼女は、公正な労働慣行のために戦うことにキャリアを捧げてきた、有名な労働者擁護者です。"},{"sentence":"The rally was attended by many pro-workers who are demanding better treatment from their employers.","translation":"その集会には、雇用主からのより良い待遇を要求する多くの労働者支持者が参加しました。"},{"sentence":"As a pro-worker, he believes that all employees deserve a living wage and safe working conditions.","translation":"労働者支持者として、彼はすべての従業員が生活賃金と安全な労働条件に値すると信じています。"}],"collocations":["become a pro-worker (労働者擁護者になる)","support pro-workers (労働者擁護者を支援する)","a dedicated pro-worker (献身的な労働者擁護者)","a strong pro-worker (強力な労働者擁護者)"],"synonyms":["labor advocate","worker advocate","union supporter","employee champion"],"antonyms":["anti-worker advocate","employer advocate"]}],"etymology":{"value":"The term 'pro-worker' is a compound word formed by combining the prefix 'pro-' (meaning 'in favor of' or 'supporting') with the noun 'worker'. It indicates a position or stance that is supportive of workers and their interests.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊˈwɜːrkər/","syllables":"pro-work-er"},"inflection":{"notes":"As an adjective, it does not inflect. As a noun, the plural form is 'pro-workers'."},"usage_notes":{"explanation":"'Pro-worker' is used to describe policies, legislation, individuals, or organizations that actively support and promote the well-being, rights, and interests of workers. It often implies a focus on improving wages, benefits, working conditions, and job security for employees. The term is commonly used in political and economic contexts when discussing labor issues and reforms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pro worker.","correct":"✓ He is a pro-worker.","note":"The term is typically hyphenated, especially when used as an adjective before a noun."},{"incorrect":"✗ The policy is very pro workers.","correct":"✓ The policy is very pro-worker.","note":"When used as an adjective describing a policy, it should be singular, as it describes the nature of the policy."},{"incorrect":"✗ She supports pro-worker's rights.","correct":"✓ She supports pro-worker rights.","note":"'Pro-worker' functions as an adjective here, so it should not be possessive."}],"priority":"★★☆"},"related_words":{"derivatives":["pro (prefix meaning 'in favor of')","worker (noun)","anti-worker (adjective/noun - opposite of pro-worker)"],"phrases":["workers' rights","labor rights","fair labor practices","employee benefits","collective bargaining","union representation"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but commonly used in political and economic discussions.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Pro-worker' is a term used to describe someone or something that supports the rights and interests of workers. It's often used in discussions about politics, economics, and labor issues. For example, a 'pro-worker policy' is a policy that aims to improve the lives of workers, such as by increasing wages or providing better benefits. The term implies an advocacy for the well-being and fair treatment of employees.","priority":"★★☆"},"example_sentences":[{"sentence":"The candidate promised to implement pro-worker policies if elected.","translation":"その候補者は、当選した場合、労働者擁護政策を実施すると約束した。","type":"adjective","meaning_category":"労働者擁護の"},{"sentence":"She is a passionate pro-worker who fights for better wages and working conditions.","translation":"彼女は、より良い賃金と労働条件のために戦う情熱的な労働者擁護者です。","type":"noun","meaning_category":"労働者擁護者"},{"sentence":"The new law is seen as a major victory for pro-worker groups.","translation":"その新しい法律は、労働者擁護団体にとって大きな勝利と見なされています。","type":"adjective","meaning_category":"労働者擁護の"},{"sentence":"The organization is dedicated to supporting pro-workers and promoting fair labor practices.","translation":"その組織は、労働者擁護者を支援し、公正な労働慣行を促進することに専念しています。","type":"noun","meaning_category":"労働者擁護者"},{"sentence":"The government's pro-worker stance has been praised by labor unions.","translation":"政府の労働者擁護の姿勢は、労働組合から賞賛されています。","type":"adjective","meaning_category":"労働者擁護の"}]}