{"word":"Reconvertible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(通貨などが)再転換可能な","english_definition":"Capable of being converted again, especially of a currency being able to be exchanged back into another currency after having been converted from it.","examples":[{"sentence":"The government is considering making the currency reconvertible to attract foreign investment.","translation":"政府は、海外投資を呼び込むために、通貨を再転換可能にすることを検討しています。"}],"collocations":["reconvertible currency","reconvertible bond"],"synonyms":["exchangeable","redeemable"],"antonyms":["inconvertible"]}],"etymology":{"value":"The word 'reconvertible' is formed by adding the prefix 're-' (meaning again) to 'convertible' (capable of being converted).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːkənˈvɜːrtɪbl/","syllables":"re-con-vert-i-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than with comparative and superlative forms.","adjective_forms":{"comparative":"more reconvertible","superlative":"most reconvertible"}},"usage_notes":{"explanation":"'Reconvertible' is typically used in financial contexts, specifically when discussing currencies or financial instruments that can be converted back into their original form or into another form after a previous conversion. It implies a degree of flexibility and liquidity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reconvertible car.","correct":"✓ The convertible car.","note":"'Reconvertible' is typically used in the context of currency or financial instruments, not physical objects. A car whose top can be removed is a 'convertible' car."}],"priority":"★☆☆"},"related_words":{"derivatives":["convertible","convertibility","reconvertibility"],"related_terms":["currency conversion","exchange rate"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'reconvertible' is a specialized term primarily used in economics and finance. Understanding its meaning requires familiarity with concepts like currency exchange and financial instruments. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The central bank announced that the national currency would become fully reconvertible.","translation":"中央銀行は、自国通貨が完全に再転換可能になると発表しました。","type":"general","meaning_category":"currency"},{"sentence":"The reconvertible bonds offered investors a degree of flexibility not found in traditional fixed-income securities.","translation":"その再転換可能な債券は、従来の固定利付証券にはない柔軟性を投資家に提供しました。","type":"finance","meaning_category":"finance"}]}