{"word":"shockedly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"衝撃を受けて、驚愕して、呆然として","english_definition":"in a shocked or surprised manner; with a feeling of great surprise and dismay.","examples":[{"sentence":"She stared at the scene shockingly.","translation":"彼女はその光景を衝撃を受けて見つめた。"},{"sentence":"He shook his head shockingly.","translation":"彼は衝撃を受けて首を横に振った。"},{"sentence":"They listened shockingly to the news report.","translation":"彼らは衝撃を受けながらニュース報道を聞いた。"},{"sentence":"He looked at the damage shockingly.","translation":"彼は衝撃を受けてその損害を見た。"}],"collocations":["stared shockingly","shook head shockingly","listened shockingly","looked shockingly"],"synonyms":["astonishedly","dismayedly","appalledly","aghast","stunned","speechlessly"],"antonyms":["calmly","unmoved","indifferently"]}],"etymology":{"value":"The word \"shockedly\" is derived from the adjective \"shocked\" by adding the suffix \"-ly\" to form an adverb. \"Shocked\" comes from the verb \"shock,\" which originally meant \"to strike with force.\" The meaning evolved to describe a sudden, disturbing surprise or emotional upset.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɒkɪdli/","syllables":"shock-ed-ly"},"inflection":{"notes":"As an adverb, \"shockedly\" does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Shockedly\" describes the manner in which someone reacts to something that causes shock. It emphasizes the feeling of surprise, dismay, or disbelief. It is often used to describe a person's expression, actions, or how they listen to or observe something.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"She was shockingly when she heard the news.","correct":"She was shocked when she heard the news.","note":"\"Shockingly\" is an adverb and should be used to describe how an action is performed. \"Shocked\" is an adjective that describes a state of being. "},{"incorrect":"He looked shockingly, he couldn't believe it.","correct":"He looked shockingly; he couldn't believe it.","note":"Use a semicolon to connect two independent clauses when using \"shockingly\" to describe an action."}],"priority":"★★☆"},"related_words":{"derivatives":["shock (noun, verb)","shocking (adjective)","shockingness (noun)"],"phrasal_verbs":["None directly related, but 'shock' can be part of phrasal verbs like 'shock into action'"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shockedly' is an adverb that describes how someone does something when they are shocked. It means they are doing it in a way that shows they are very surprised and upset. It is not as common as the adjective 'shocking' or the verb 'shock.'"},"example_sentences":[{"sentence":"The audience gasped shockingly at the magician's sudden disappearance.","translation":"観客はマジシャンの突然の消失に衝撃を受けて息を呑んだ。","type":"adverb","meaning_category":"驚愕して"},{"sentence":"He stared shockingly at the wreckage of his car.","translation":"彼は衝撃を受けて自分の車の残骸を見つめた。","type":"adverb","meaning_category":"衝撃を受けて"},{"sentence":"She responded shockingly to the accusations, denying everything.","translation":"彼女は告発に衝撃を受けて、すべてを否定した。","type":"adverb","meaning_category":"呆然として"}]}