{"word":"sail-stretched","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a sailing vessel) having its sails fully extended and filled with wind, indicating a state of readiness or high speed.","english_definition":"Having the sails fully extended and filled with wind.","examples":[{"sentence":"The sail-stretched yacht sped across the bay.","translation":"帆をいっぱいに張ったヨットが湾を高速で横切った。"},{"sentence":"The ship, sail-stretched and heeling, raced towards the horizon.","translation":"帆をいっぱいに張り、傾きながら、その船は水平線に向かって突進した。"}],"collocations":["sail-stretched yacht","sail-stretched ship","sail-stretched and heeling"],"synonyms":["full-sailed","wind-filled","taut-sailed"],"antonyms":["idle","at anchor","becalmed"]}],"etymology":{"value":"Compound word formed by combining 'sail' (referring to the canvas used to catch wind) and 'stretched' (past participle of 'stretch,' indicating being extended or pulled taut). The combination describes the state of a sail when it is fully extended to catch the wind.","priority":"N/A"},"pronunciation":{"ipa":"/ˈseɪlˌstretʃt/","syllables":"sail-stretched"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"'Sail-stretched' is a descriptive adjective used to convey the image of a sailing vessel moving with speed and purpose, fully utilizing the wind's power. It is often used in nautical contexts or in literature to evoke a sense of adventure, urgency, or readiness.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The sail was stretch.","correct":"✓ The sail was stretched.","note":"'Stretched' is the past participle form and should be used to describe the state of the sail."}],"priority":"N/A"},"related_words":{"derivatives":["sail (noun)","stretched (verb)","sailing (noun/verb)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in nautical or descriptive writing.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'sail-stretched' is relatively uncommon and likely encountered in literature, particularly nautical fiction, or in specialized contexts related to sailing. Understanding requires familiarity with sailing terminology and the imagery of a vessel fully powered by the wind."},"example_sentences":[{"sentence":"The sail-stretched schooner cut through the waves with impressive speed.","translation":"帆をいっぱいに張ったスクーナーは、目覚ましい速さで波を切って進んだ。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"He envisioned the sail-stretched fleet racing towards the distant shore.","translation":"彼は、帆をいっぱいに張った艦隊が遠い海岸に向かって突進する光景を思い描いた。","type":"adjective","meaning_category":"Descriptive"}]}