{"word":"porencephalitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脳に孔（あな）ができる脳炎","english_definition":"Inflammation of the brain characterized by the presence of cavities in the brain substance.","examples":[{"sentence":"Porencephalitis is a rare neurological condition.","translation":"脳孔脳炎はまれな神経学的疾患です。"},{"sentence":"The symptoms of porencephalitis can vary depending on the location and size of the cysts.","translation":"脳孔脳炎の症状は、嚢胞の位置と大きさによって異なります。"}],"collocations":["congenital porencephalitis","acquired porencephalitis"],"synonyms":["encephalomalacia","cystic encephalopathy"],"antonyms":[]}],"etymology":{"value":"The term 'porencephalitis' is derived from the Greek words 'poros' (meaning pore or cavity), 'enkephalos' (meaning brain), and 'itis' (meaning inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɔːrənˌsɛfəˈlaɪtɪs/","syllables":"po-ren-ceph-a-li-tis"},"inflection":{"notes":"This is a noun and does not have typical inflectional forms."},"usage_notes":{"explanation":"Porencephalitis is a rare condition characterized by cysts or cavities within the brain. It can be congenital (present at birth) or acquired later in life due to injury, infection, or stroke. The condition can lead to various neurological deficits, depending on the location and size of the cysts. Diagnosis is typically made through neuroimaging techniques such as MRI or CT scans.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Porencephalitis is a type of cancer.","correct":"✓ Porencephalitis is a neurological condition characterized by cysts in the brain.","note":"Porencephalitis is not a type of cancer; it is a condition involving cysts or cavities in the brain tissue."}],"priority":"★☆☆"},"related_words":{"derivatives":["porencephaly (名詞: 脳に孔ができる状態)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized medical term)","frequency_google_ngram":"Very low frequency. This is a specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Porencephalitis is a complex medical term referring to a rare neurological disorder characterized by the presence of cysts or cavities within the brain tissue. It can result from various causes, including congenital factors, infections, or ischemic events. The clinical manifestations of porencephalitis are highly variable, depending on the location and extent of the brain lesions. Diagnosis typically involves advanced neuroimaging techniques. Due to its rarity and complexity, porencephalitis is primarily discussed within medical and scientific contexts."},"example_sentences":[{"sentence":"MRI imaging revealed evidence of porencephalitis in the patient's brain.","translation":"MRI画像検査で、患者の脳に脳孔脳炎の証拠が認められました。","type":"general","meaning_category":"definition"},{"sentence":"Congenital porencephalitis can result in significant developmental delays.","translation":"先天性脳孔脳炎は、重大な発達遅延を引き起こす可能性があります。","type":"general","meaning_category":"definition"}]}