{"word":"isophoria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"眼位正位、眼位平衡","english_definition":"A condition in which the eyes have no tendency to deviate when fusion is broken.","examples":[{"sentence":"The patient was diagnosed with isophoria after undergoing an eye examination.","translation":"患者は眼科検査の結果、眼位正位と診断された。"},{"sentence":"Isophoria is generally considered the ideal state of binocular vision.","translation":"眼位正位は一般的に両眼視の理想的な状態と考えられている。"}],"collocations":["binocular vision","eye examination","eye muscle balance"],"synonyms":["orthophoria"],"antonyms":["heterophoria","strabismus"]},{"part_of_speech":"noun","definition":"(より広義には) 潜在性斜視がない状態","english_definition":"A state of perfect muscular balance of the eyes.","examples":[{"sentence":"Isophoria ensures comfortable and efficient binocular vision.","translation":"眼位正位は快適で効率的な両眼視を保証する。"}],"collocations":["eye muscle balance","binocular vision"],"synonyms":["perfect eye alignment"],"antonyms":["heterophoria","phoria"]}],"etymology":{"value":"Derived from the Greek roots 'iso-' (equal) and 'phoria' (tendency, bearing), indicating an equal or balanced tendency of the eyes.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaɪsəˈfɔːriə/","syllables":"i-so-pho-ri-a"},"inflection":{"noun_plural":"isophorias"},"usage_notes":{"explanation":"Isophoria is a term used in ophthalmology and optometry to describe the ideal alignment of the eyes when binocular vision is disrupted. It indicates a lack of tendency for the eyes to deviate inward (esophoria) or outward (exophoria). While isophoria is considered the optimal state, it's relatively rare for individuals to maintain perfect eye alignment at all times.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has isophoria, so they need glasses.","correct":"✓ The patient has isophoria, so they likely don't need glasses.","note":"Isophoria indicates good eye alignment, so glasses are usually not required."},{"incorrect":"✗ Isophoria is a type of strabismus.","correct":"✓ Isophoria is not a type of strabismus; it's the absence of strabismus.","note":"Strabismus (squint) is a misalignment of the eyes, whereas isophoria is the absence of such misalignment."}],"priority":"★★☆"},"related_words":{"derivatives":["isophoric (adjective)"],"phrasal_verbs":[],"related_terms":["heterophoria","esophoria","exophoria","orthophoria","strabismus","binocular vision"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Isophoria' is a specialized term in eye care, referring to the ideal state of eye alignment where there's no natural tendency for the eyes to drift when not actively focusing. It's contrasted with conditions like heterophoria, where the eyes do have a resting misalignment. The term is primarily used by eye care professionals.","priority":"★☆☆"},"example_sentences":[{"sentence":"The ophthalmologist confirmed the patient's isophoria, indicating excellent eye muscle balance.","translation":"眼科医は患者の眼位正位を確認し、優れた眼筋バランスを示した。","type":"medical","meaning_category":"eye alignment"},{"sentence":"Maintaining isophoria is crucial for comfortable and efficient reading.","translation":"眼位正位を維持することは、快適で効率的な読書のために重要である。","type":"vision","meaning_category":"eye alignment"}]}