{"word":"non-pictorial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非絵画的な、絵画的でない、図解的でない","english_definition":"Not pictorial; not representing or pertaining to visual images or pictures.","examples":[{"sentence":"The abstract painting was entirely non-pictorial.","translation":"その抽象絵画は完全に非絵画的だった。"},{"sentence":"The book contained non-pictorial descriptions of the events.","translation":"その本には、出来事を図解的でない言葉で説明していた。"},{"sentence":"He preferred non-pictorial art that focused on form and color.","translation":"彼は、形と色彩に焦点を当てた非絵画的な芸術を好んだ。"}],"collocations":["non-pictorial art","non-pictorial representation","non-pictorial description"],"synonyms":["abstract","nonrepresentational","non-figurative"],"antonyms":["pictorial","representational","figurative"]}],"etymology":{"value":"'Non-' (not) + 'pictorial' (relating to pictures).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn pɪkˈtɔːriəl/","syllables":"non-pic-to-ri-al"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Non-pictorial' is used to describe something that does not rely on or contain images or pictures. It often refers to abstract art, written descriptions, or other forms of communication that do not use visual representation. It emphasizes the absence of recognizable imagery.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The non-pictorial book was full of illustrations.","correct":"The non-pictorial book was full of text.","note":"'Non-pictorial' means without pictures, so it cannot be full of illustrations."}],"priority":"★★☆"},"related_words":{"derivatives":["pictorial","picture","pictorially"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'non-pictorial' is a formal term used to describe something that does not involve or represent pictures. It's often used in discussions about art, literature, or design to distinguish between visual and non-visual forms of expression. Understanding this word requires a good vocabulary and familiarity with abstract concepts."},"example_sentences":[{"sentence":"The presentation included both pictorial and non-pictorial data.","translation":"そのプレゼンテーションには、絵画的なデータと非絵画的なデータの両方が含まれていた。","type":"general","meaning_category":"general"},{"sentence":"Some modern art movements embraced non-pictorial approaches to painting.","translation":"いくつかの現代美術運動は、絵画への非絵画的なアプローチを採用した。","type":"art","meaning_category":"art"},{"sentence":"The report provided a non-pictorial analysis of the market trends.","translation":"その報告書は、市場動向の非絵画的な分析を提供した。","type":"analysis","meaning_category":"analysis"}]}