{"word":"fission","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(原子核の)核分裂","english_definition":"the action of dividing or splitting something into two or more parts. In nuclear physics, it refers to the splitting of a heavy atomic nucleus, such as uranium, into two or more lighter nuclei, accompanied by a release of energy.","examples":[{"sentence":"Nuclear fission is used in nuclear power plants to generate electricity.","translation":"核分裂は原子力発電所で電気を生成するために使用されます。"},{"sentence":"The fission of uranium releases a tremendous amount of energy.","translation":"ウランの核分裂は莫大なエネルギーを放出します。"},{"sentence":"Controlled fission is essential for the safe operation of a nuclear reactor.","translation":"制御された核分裂は、原子炉の安全な運転に不可欠です。"}],"collocations":["nuclear fission (核分裂)","fission reaction (核分裂反応)","fission products (核分裂生成物)","fission bomb (核分裂爆弾)","spontaneous fission (自発核分裂)","induced fission (誘導核分裂)","chain reaction (連鎖反応)"],"synonyms":["nuclear disintegration","atomic splitting"],"antonyms":["fusion (核融合)"]},{"part_of_speech":"noun","definition":"(生物学)分裂、特に二分裂","english_definition":"(in biology) the division of a cell or organism into two or more parts, especially binary fission in bacteria.","examples":[{"sentence":"Bacteria reproduce by binary fission.","translation":"バクテリアは二分裂によって繁殖します。"},{"sentence":"Fission is a common form of asexual reproduction in microorganisms.","translation":"分裂は微生物における一般的な無性生殖の形態です。"},{"sentence":"The rate of fission can be affected by environmental factors.","translation":"分裂の速度は環境要因によって影響を受ける可能性があります。"}],"collocations":["binary fission (二分裂)","cell fission (細胞分裂)","asexual reproduction (無性生殖)"],"synonyms":["cell division","splitting","segmentation"],"antonyms":["sexual reproduction (有性生殖)"]}],"etymology":{"value":"From the Latin word 'fissio', meaning 'a cleaving, splitting', from the verb 'findere' meaning 'to cleave, split'. The term was first used in nuclear physics in the late 1930s to describe the splitting of atomic nuclei.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɪʃən/","syllables":"fis-sion"},"inflection":{"noun_plural":"fissions"},"usage_notes":{"explanation":"The term \"fission\" has two primary meanings: one in nuclear physics and one in biology. In nuclear physics, it refers to the splitting of a heavy atomic nucleus, which releases a large amount of energy and is the basis for nuclear power and atomic weapons. In biology, it refers to the division of a cell or organism into two or more parts, which is a form of asexual reproduction common in bacteria and other microorganisms. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Fusion is the opposite of fission because it combines atoms.","correct":"✓ Fusion is the opposite of fission because it combines atoms. Fission splits atoms.","note":"Fusion is the process of combining atomic nuclei, while fission is the process of splitting them. They are opposite processes. The mistake is not in the sentence itself, but in a potential misunderstanding of the concepts."},{"incorrect":"✗ The bacteria reproduced by fusion.","correct":"✓ The bacteria reproduced by fission.","note":"Bacteria reproduce primarily by binary fission, not fusion."}],"priority":"★★☆"},"related_words":{"derivatives":["fissionable (adjective: capable of undergoing fission)","fissioned (adjective: having undergone fission)"],"related_terms":["nuclear reactor (原子炉)","atomic bomb (原子爆弾)","radioactivity (放射能)","binary fission (二分裂)","chain reaction (連鎖反応)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"fission\" refers to the process of splitting something into two or more parts. It is most commonly used in two contexts: nuclear physics and biology. In nuclear physics, it describes the splitting of a heavy atomic nucleus, such as uranium, which releases a large amount of energy. This process is used in nuclear power plants and atomic weapons. In biology, fission refers to the division of a cell or organism into two or more parts, particularly in microorganisms like bacteria. Understanding the context is crucial to interpreting the meaning of \"fission\" correctly. It is a technical term, so familiarity with scientific concepts is helpful.","priority":"★★☆"},"example_sentences":[{"sentence":"The nuclear power plant uses the energy released from uranium **fission**.","translation":"その原子力発電所はウランの核分裂から放出されるエネルギーを利用しています。","type":"noun","meaning_category":"nuclear physics"},{"sentence":"**Fission** is a common method of reproduction for bacteria.","translation":"分裂はバクテリアにとって一般的な繁殖方法です。","type":"noun","meaning_category":"biology"},{"sentence":"Scientists are studying the **fission** products to understand the reaction better.","translation":"科学者たちは反応をより良く理解するために核分裂生成物を研究しています。","type":"noun","meaning_category":"nuclear physics"},{"sentence":"Binary **fission** allows bacteria to reproduce rapidly.","translation":"二分裂により、バクテリアは急速に繁殖することができます。","type":"noun","meaning_category":"biology"}]}