{"word":"Kubango","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"クバンゴ川 (アンゴラ、ナミビア、ボツワナを流れる川)","english_definition":"A river in Southern Africa that flows through Angola, Namibia, and Botswana.","examples":[{"sentence":"The Kubango River flows into the Okavango Delta.","translation":"クバンゴ川はオカバンゴデルタに流れ込む。"}],"collocations":[],"synonyms":["Okavango River"],"antonyms":[]}],"etymology":{"value":"The name 'Kubango' is derived from local African languages. The exact origin and meaning are debated, but it is believed to be related to the river's characteristics or the people living along its banks.","priority":"★★☆"},"pronunciation":{"ipa":"/kuːˈbæŋɡoʊ/","syllables":"Ku-ban-go"},"inflection":{},"usage_notes":{"explanation":"'Kubango' is primarily used as a geographical term to refer to the river. It's also sometimes used in the context of environmental studies, tourism, and regional development related to the river and its surrounding areas. The river is also known as the Okavango River, particularly in its lower reaches and in Botswana.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Okavango Delta (オカバンゴデルタ)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Kubango' is a proper noun referring to a specific river in Southern Africa. It is not a commonly used word outside of geographical, environmental, or regional contexts related to the area. Understanding its meaning requires knowledge of African geography.","priority":"★★☆"},"example_sentences":[{"sentence":"The Angolan highlands are the source of the Kubango River.","translation":"アンゴラの高地はクバンゴ川の源流である。","type":"geographical","meaning_category":"river source"},{"sentence":"Conservation efforts are crucial to protect the Kubango River basin.","translation":"クバンゴ川流域を保護するための保全活動が重要である。","type":"environmental","meaning_category":"conservation"},{"sentence":"Communities along the Kubango River rely on it for their livelihoods.","translation":"クバンゴ川沿いのコミュニティは生活のために川に頼っている。","type":"socioeconomic","meaning_category":"local communities"}]}