{"word":"cutinise","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"植物のクチクラ層を発達させる、クチクラ化する","english_definition":"To develop a cuticle; to become cutinized.","examples":[{"sentence":"The epidermal cells cutinise to form a protective layer.","translation":"表皮細胞はクチクラ化して保護層を形成する。"}],"collocations":[],"synonyms":["cuticularize"],"antonyms":[]}],"etymology":{"value":"From cutin + -ise.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkjuːtɪnaɪz/","syllables":"cu-ti-nise"},"inflection":{"verb_forms":{"present_simple":["cutinise","cutinises"],"past_simple":"cutinised","past_participle":"cutinised","present_participle":"cutinising"}},"usage_notes":{"explanation":"'Cutinise' is a technical term primarily used in botany to describe the process by which plant cells develop a cuticle, a waxy layer that protects the plant from water loss and other environmental stressors. It is relatively uncommon in everyday language.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["cutin (noun): A waxy, water-repellent substance constituting the plant cuticle.","cuticle (noun): A protective and waxy or hard layer covering the epidermis of a plant, or the outer layer of skin at the base of a nail.","cutinization (noun): The process of forming a cuticle.","cutinized (adjective): Having a cuticle.","cutinising (adjective): In the process of forming a cuticle."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'cutinise' is a highly specialized term primarily used within the field of botany. Understanding and use of this word requires advanced knowledge of plant biology and related scientific terminology. Due to its specific and technical nature, it is unlikely to be encountered in general English contexts."},"example_sentences":[{"sentence":"The leaves of the plant cutinise to reduce water loss in arid conditions.","translation":"その植物の葉は、乾燥した環境での水分損失を減らすためにクチクラ化する。","type":"verb","meaning_category":"植物学"}]}