{"word":"vizirial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"宰相の、大臣の、大臣級の","english_definition":"Of or pertaining to a vizier or viziers; relating to a high-ranking minister or official.","examples":[{"sentence":"The vizirial decree was met with widespread approval.","translation":"その宰相の布告は広範な承認を得た。"},{"sentence":"He held a vizirial position in the government.","translation":"彼は政府で大臣級の地位にあった。"}],"collocations":["vizirial decree","vizirial authority","vizirial powers","vizirial office"],"synonyms":["ministerial","official","governmental","executive"],"antonyms":["unofficial","private"]},{"part_of_speech":"adjective","definition":"宰相のような、大臣のような","english_definition":"Resembling or characteristic of a vizier or a high-ranking minister.","examples":[{"sentence":"His vizirial demeanor suggested a man of great power and influence.","translation":"彼の宰相のような物腰は、大きな力と影響力を持つ人物であることを示唆していた。"}],"collocations":["vizirial demeanor","vizirial bearing","vizirial presence"],"synonyms":["august","dignified","imposing","stately"],"antonyms":["humble","modest","unassuming"]}],"etymology":{"value":"From 'vizier' (a high-ranking political advisor or minister, especially in Muslim countries) + '-ial' (a suffix indicating relationship or belonging). The term 'vizier' ultimately comes from Arabic 'wazīr' (bearer of burden, helper).","priority":"★★☆"},"pronunciation":{"ipa":"/vɪˈzɪəriəl/","syllables":"vi-zir-i-al"},"inflection":{"notes":"Adjective; does not inflect for number or gender."},"usage_notes":{"explanation":"'Vizirial' is a relatively rare word, primarily used in historical or political contexts to describe something related to a vizier, who was a high-ranking official, similar to a prime minister or chief advisor, especially in Islamic countries. It can also be used figuratively to describe someone who has a powerful or influential presence, reminiscent of a vizier.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The vizirial was responsible for the economy.","correct":"✓ The vizier was responsible for the economy.","note":"'Vizirial' is an adjective, not a noun. Use 'vizier' as the noun referring to the official."},{"incorrect":"✗ He had a very vizirial house.","correct":"✓ He had a house with vizirial decoration.","note":"Avoid using 'vizirial' to describe physical objects unless they are directly related to a vizier or their office. Instead, describe the object as having 'vizirial decoration' or 'vizirial style'."}],"priority":"★★☆"},"related_words":{"derivatives":["vizier (noun): a high-ranking political advisor or minister, especially in Muslim countries"],"phrases":["vizirial authority","vizirial powers","vizirial office"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency - primarily found in historical or specialized texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Vizirial' is a sophisticated and rare term. It is best used in contexts where you are specifically referring to something related to a vizier, a high-ranking official in certain historical or political systems, particularly in Islamic countries. Due to its rarity, ensure your audience understands the historical and political context to avoid confusion. Using simpler terms like 'ministerial' or 'official' may be more appropriate in general usage."},"example_sentences":[{"sentence":"The vizirial court was known for its opulence and intrigue.","translation":"宰相の宮廷はその豪華さと陰謀で知られていた。","type":"adjective","meaning_category":"Relating to a vizier"},{"sentence":"The vizirial administration implemented several key reforms.","translation":"宰相の政権はいくつかの重要な改革を実施した。","type":"adjective","meaning_category":"Relating to a vizier's office"}]}