{"word":"Hui","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(中国の)回族","english_definition":"A member of a predominantly Muslim ethnic group in China.","examples":[{"sentence":"The Hui people are one of the largest ethnic minorities in China.","translation":"回族は中国最大の少数民族の一つです。"},{"sentence":"Many Hui people live in the Ningxia Hui Autonomous Region.","translation":"多くの回族の人々が寧夏回族自治区に住んでいます。"}],"collocations":["Hui Muslim","Hui Chinese","Ningxia Hui Autonomous Region"],"synonyms":["Chinese Muslim"],"antonyms":[]},{"part_of_speech":"adjective","definition":"回族の","english_definition":"Relating to the Hui people or their culture.","examples":[{"sentence":"Hui cuisine often features halal meat.","translation":"回族の料理はハラール肉を特徴とすることが多いです。"},{"sentence":"The Hui language is a dialect of Mandarin Chinese.","translation":"回族の言語は中国語の北京官話の方言です。"}],"collocations":["Hui culture","Hui cuisine","Hui language"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Mandarin Chinese 回 (huí), meaning 'return' or 'go back,' referring to their origins in foreign traders who settled in China.","priority":"★★☆"},"pronunciation":{"ipa":"/hweɪ/","syllables":"Hui"},"inflection":{"notes":"The word 'Hui' does not inflect."},"usage_notes":{"explanation":"'Hui' refers specifically to the Chinese-speaking Muslim ethnic group in China. It is important to distinguish them from other Muslim groups in China, such as the Uyghurs, who have a different language and culture. The Hui people are integrated into Chinese society, speaking Mandarin Chinese, but they maintain their Islamic faith and customs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Hui are Uyghurs.","correct":"✓ The Hui are a distinct ethnic group from the Uyghurs.","note":"The Hui and Uyghurs are distinct ethnic groups in China, with different languages and cultures."},{"incorrect":"✗ All Muslims in China are Hui.","correct":"✓ Not all Muslims in China are Hui; there are other Muslim ethnic groups like the Uyghurs.","note":"The Hui are one of several Muslim ethnic groups in China, but not all Muslims in China are Hui."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, specific to discussions about China.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Hui' refers to a specific ethnic group in China, the Hui people, who are predominantly Muslim and Chinese-speaking. Understanding this term requires knowledge of Chinese ethnic groups and cultural diversity within China. It's important to distinguish the Hui from other Muslim ethnic groups in China, such as the Uyghurs, who have different languages and cultural practices. The term is most likely to appear in discussions about Chinese culture, ethnicity, or religious demographics."},"example_sentences":[{"sentence":"The **Hui** people have a long history in China.","translation":"回族は中国で長い歴史を持っています。","type":"noun","meaning_category":"回族"},{"sentence":"Many **Hui** restaurants serve delicious halal food.","translation":"多くの回族のレストランでは美味しいハラール料理を提供しています。","type":"adjective","meaning_category":"回族の"},{"sentence":"The **Hui** community celebrates Eid al-Fitr.","translation":"回族のコミュニティはイード・アル＝フィトル（断食明けの祭り）を祝います。","type":"noun","meaning_category":"回族"}]}