{"word":"preempting","priority":"★★☆","meanings":[{"part_of_speech":"verb (present participle)","definition":"先んじて阻止する、出し抜く、横取りする、差し押さえる","english_definition":"Taking action to prevent something from happening; forestalling; superseding; seizing something before others can.","examples":[{"sentence":"The company decided to launch its product early, preempting the competition.","translation":"その会社は競争相手を出し抜くために、製品を早期に発売することを決定した。"},{"sentence":"The government preempted the strike by offering concessions to the union.","translation":"政府は労働組合に譲歩案を提示することで、ストライキを未然に防いだ。"},{"sentence":"She preempted my question by answering it before I could even ask.","translation":"私が質問する前に、彼女はそれに答えて私の質問を封じた（出し抜いた）。"},{"sentence":"The federal government's regulations are preempting state laws in this area.","translation":"連邦政府の規制がこの分野における州法に優先する（差し押さえる）。"}],"collocations":["preempt a strike (ストライキを阻止する)","preempt an attack (攻撃を未然に防ぐ)","preempt competition (競争相手を出し抜く)","preempt a question (質問を封じる)","preempt an argument (議論の余地をなくす)","federal law preempts state law (連邦法が州法に優先する)"],"synonyms":["forestall","prevent","obviate","avert","preclude","supersede","supplant","seize","appropriate"],"antonyms":["allow","permit","enable","facilitate","follow","yield"]},{"part_of_speech":"verb (gerund)","definition":"先んじて阻止すること、出し抜くこと、横取りすること、差し押さえること","english_definition":"The act of taking action to prevent something from happening; forestalling; superseding; seizing something before others can.","examples":[{"sentence":"Preempting the enemy's advance was crucial to our victory.","translation":"敵の進軍を阻止することが、我々の勝利にとって非常に重要だった。"},{"sentence":"His preempting of my ideas made me feel unheard.","translation":"彼が私のアイデアを横取りしたことで、私は自分の意見を聞いてもらえなかったように感じた。"},{"sentence":"The preempting of local control by the central government is a controversial issue.","translation":"中央政府による地方自治の差し押さえは、物議を醸す問題だ。"}],"collocations":["the preempting of (～の阻止、～の横取り)","preempting action (先制的な行動)"],"synonyms":["forestalling","prevention","obviation","preclusion","supersession","seizure","appropriation"],"antonyms":["allowing","permitting","enabling","facilitating","following","yielding"]}],"etymology":{"value":"Derived from the verb 'preempt,' which comes from the Latin 'prae-' (before) + 'emere' (to buy). Originally meant 'to buy beforehand' or 'to take possession of before others.' The meaning evolved to include preventing or forestalling an action.","priority":"★★☆"},"pronunciation":{"ipa":"/priˈɛmptɪŋ/","syllables":"pre-empt-ing"},"inflection":{"verb_forms":{"present_simple":["preempt","preempts"],"past_simple":"preempted","past_participle":"preempted","present_participle":"preempting"}},"usage_notes":{"explanation":"'Preempting' is the present participle and gerund form of the verb 'preempt.' It describes an action that is currently happening or an action that is being considered as a concept. The word often implies a proactive or strategic move to gain an advantage or avoid a negative outcome. In legal contexts, it can refer to the federal government's power to override state laws. The word can be used in both formal and informal settings.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was preempting by the other team.","correct":"✓ He was preempted by the other team.","note":"'Preempting' is the active form, meaning someone is doing the preempting. 'Preempted' is the passive form, meaning someone is being preempted. If someone is being preempted, use the passive form."},{"incorrect":"✗ The preempting of the meeting was a surprise.","correct":"✓ The preemption of the meeting was a surprise.","note":"While 'preempting' can function as a gerund (a verb acting as a noun), the noun form 'preemption' is often more appropriate when referring to the act of preempting itself."}],"priority":"★★☆"},"related_words":{"derivatives":["preempt (verb)","preemption (noun)","preemptive (adjective)","preemptively (adverb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but used in specific contexts (legal, business, political).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Preempting' means taking action to prevent something from happening, often to gain an advantage. It can also mean replacing or overriding something else. It's used in situations where someone is trying to get ahead or avoid a problem by acting first. The word is more common in formal writing and speech, especially in legal, business, and political contexts. It implies a strategic or proactive approach.","priority":"★★☆"},"example_sentences":[{"sentence":"By **preempting** the media's questions, the CEO controlled the narrative.","translation":"メディアの質問を先取りすることで、CEOは物語をコントロールした。","type":"verb (present participle)","meaning_category":"出し抜く"},{"sentence":"The company is **preempting** its competitors by releasing new products frequently.","translation":"その会社は新製品を頻繁に発売することで、競合他社を出し抜いている。","type":"verb (present participle)","meaning_category":"出し抜く"},{"sentence":"**Preempting** any potential problems, they conducted a thorough risk assessment.","translation":"起こりうる問題を未然に防ぐために、彼らは徹底的なリスク評価を実施した。","type":"verb (gerund)","meaning_category":"阻止する"},{"sentence":"The federal law is **preempting** state laws regarding immigration.","translation":"連邦法は移民に関する州法に優先する。","type":"verb (present participle)","meaning_category":"差し押さえる"},{"sentence":"His **preempting** of the discussion made it difficult for others to share their views.","translation":"彼が議論を遮ったことで、他の人が意見を共有することが困難になった。","type":"verb (gerund)","meaning_category":"出し抜く"}]}