{"word":"gyrostat","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ジャイロスタット、回転子","english_definition":"A device consisting of a spinning mass (rotor) whose orientation can be changed, but which resists changes to its orientation due to its angular momentum.","examples":[{"sentence":"The gyrostat is used for stabilization in spacecraft.","translation":"ジャイロスタットは宇宙船の安定化に使用されます。"},{"sentence":"The gyrostat maintains its orientation even when the outer frame is moved.","translation":"ジャイロスタットは、外側のフレームが動かされてもその向きを維持します。"}],"collocations":["stabilizing gyrostat","control gyrostat","high-speed gyrostat"],"synonyms":["gyroscope","rotor","spinning mass"],"antonyms":[]}],"etymology":{"value":"The term 'gyrostat' is derived from 'gyro-' (meaning 'circle' or 'rotation') and '-stat' (meaning 'something that maintains stability').","priority":"★★☆"},"pronunciation":{"ipa":"ˈdʒaɪrəˌstæt","syllables":"gy-ro-stat"},"inflection":{"noun_plural":"gyrostats"},"usage_notes":{"explanation":"A gyrostat is a type of gyroscope that is specifically designed to maintain stability or orientation. It's used in various applications, including spacecraft, satellites, and inertial navigation systems. The key principle behind its operation is the conservation of angular momentum.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The gyrostats are used for navigation in a car.","correct":"✓ Gyroscopes or inertial measurement units (IMUs) are used for navigation in a car.","note":"While gyroscopes are used in cars, the term 'gyrostat' is more commonly associated with high-precision applications like spacecraft. Cars typically use simpler gyroscope-based systems or IMUs."}],"priority":"★★☆"},"related_words":{"derivatives":["gyroscopic (adjective)","gyroscope (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A 'gyrostat' is a specialized type of gyroscope used to maintain stability or orientation, especially in spacecraft and other precision applications. It works based on the principles of angular momentum. While similar to a gyroscope, the term 'gyrostat' implies a more sophisticated and controlled application of the technology. It's not a commonly used term in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The satellite uses a gyrostat to maintain its orientation in space.","translation":"その衛星は、宇宙空間での向きを維持するためにジャイロスタットを使用しています。","type":"noun","meaning_category":"device"},{"sentence":"The engineer calibrated the gyrostat before the experiment.","translation":"エンジニアは実験前にジャイロスタットを校正しました。","type":"noun","meaning_category":"device"}]}