{"word":"Paleolatry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The worship of the past, or of ancient things.","english_definition":"Worship of the past, especially of ancient things.","examples":[{"sentence":"His writings were often criticized as being an exercise in paleolatry, glorifying a bygone era without acknowledging its flaws.","translation":"彼の著作は、過去の欠点を認めずに過ぎ去った時代を美化する、過去崇拝の行使であると批判されることが多かった。"},{"sentence":"The museum's collection seemed to encourage paleolatry, presenting ancient artifacts as inherently superior to modern creations.","translation":"博物館のコレクションは、古代の工芸品を現代の創造物よりも本質的に優れているものとして提示し、過去崇拝を助長しているようだった。"}],"collocations":["historical paleolatry","cultural paleolatry","intellectual paleolatry"],"synonyms":["archaism","antiquarianism","historicism"],"antonyms":["futurism","modernism","innovation"]}],"etymology":{"value":"From paleo- (ancient) + latry (worship).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpeɪlioʊˈlætrɪ/","syllables":"pay-lee-oh-la-tree"},"inflection":{"noun_plural":"paleolatries"},"usage_notes":{"explanation":"Paleolatry is often used in a critical context to describe an excessive or uncritical admiration for the past. It suggests a belief that things were better in the past simply because they are old.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The paleolatry was very pale.","correct":"✓ The paleolatry was evident in their reverence for old traditions.","note":"Paleolatry refers to the worship of the past, not something that is pale in color."}],"priority":"★★☆"},"related_words":{"derivatives":["paleolater (noun: one who practices paleolatry)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low Frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Paleolatry is a niche term used to describe the worship of the past. It is not commonly used in everyday conversation and is more likely to appear in academic or critical writing. Understanding the term requires familiarity with the prefixes 'paleo-' (ancient) and '-latry' (worship)."},"example_sentences":[{"sentence":"The author argued that the current political climate was suffering from a form of paleolatry, clinging to outdated ideologies.","translation":"著者は、現在の政治情勢が時代遅れのイデオロギーに固執し、過去崇拝の一形態に苦しんでいると主張した。","type":"noun","meaning_category":"Worship of the past"},{"sentence":"Some critics accused the film of engaging in paleolatry by romanticizing a historically oppressive regime.","translation":"一部の批評家は、その映画が歴史的に抑圧的な体制を美化することによって、過去崇拝に関与していると非難した。","type":"noun","meaning_category":"Worship of the past"}]}