{"word":"cracksman","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古風) 金庫破り、熟練した泥棒","english_definition":"(old-fashioned) a burglar, especially one who is skilled at opening safes.","examples":[{"sentence":"The police were on the lookout for a notorious cracksman.","translation":"警察は悪名高い金庫破りを捜索していた。"},{"sentence":"He was known as the best cracksman in the city.","translation":"彼はその街で最高の金庫破りとして知られていた。"}],"collocations":["skilled cracksman","notorious cracksman","professional cracksman"],"synonyms":["burglar","safe cracker","thief","robber"],"antonyms":["police officer","law enforcement"],"notes":"This term is considered old-fashioned and is rarely used in modern English. It specifically refers to someone who breaks into safes or secure places."}],"etymology":{"value":"The term 'cracksman' comes from the word 'crack,' referring to the act of breaking open a safe or other secure container. The suffix '-man' is added to denote a person who performs this action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkræksmən/","syllables":"cracks-man"},"inflection":{"noun_plural":"cracksmen"},"usage_notes":{"explanation":"'Cracksman' is an archaic term, primarily found in older literature or historical contexts. It specifically describes a burglar who specializes in opening safes or other secure containers. The term implies a level of skill and expertise beyond that of a typical burglar.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a cracksman of computers.","correct":"He is a computer hacker.","note":"'Cracksman' specifically refers to someone who breaks into physical safes, not computer systems. Use 'hacker' for computer-related intrusions."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["burglar","safe cracker","heist","burglary"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'cracksman' is an archaic term referring to a burglar who specializes in opening safes. It is rarely used in modern English and is more likely to be encountered in older literature or historical contexts. Understanding this word requires familiarity with older vocabulary and criminal terminology."},"example_sentences":[{"sentence":"The detective was determined to catch the elusive cracksman.","translation":"刑事はその掴みどころのない金庫破りを捕まえようと決意していた。","type":"general","meaning_category":"金庫破り"},{"sentence":"In the old movies, the cracksman always had a sophisticated set of tools.","translation":"昔の映画では、金庫破りはいつも洗練された道具一式を持っていた。","type":"historical","meaning_category":"金庫破り"}]}