{"word":"protocolar","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"儀礼的な、儀式ばった、プロトコルに関する","english_definition":"relating to or following protocol or etiquette; formal and ceremonial.","examples":[{"sentence":"The meeting was a protocolar event, with strict adherence to formal procedures.","translation":"その会議は儀礼的なイベントであり、正式な手順の厳守が求められた。"},{"sentence":"Protocolar duties are an important part of a diplomat's job.","translation":"儀礼的な任務は外交官の仕事の重要な部分である。"},{"sentence":"The protocolar arrangements for the state visit were meticulously planned.","translation":"国賓訪問のための儀礼的な手配は綿密に計画された。"}],"collocations":["protocolar event (儀礼的なイベント)","protocolar duties (儀礼的な任務)","protocolar arrangements (儀礼的な手配)","protocolar visit (儀礼的な訪問)","protocolar procedure (儀礼的な手順)","protocolar norms (儀礼的な規範)"],"synonyms":["ceremonial","formal","official","ritualistic","conventional","etiquette-related"],"antonyms":["informal","unceremonious","casual","unconventional"]},{"part_of_speech":"adjective","definition":"（特にラテンアメリカで）形式主義の、形式にこだわる","english_definition":"(especially in Latin America) excessively concerned with formalities and procedures.","examples":[{"sentence":"The organization was criticized for being too protocolar and bureaucratic.","translation":"その組織は形式主義的で官僚的すぎると批判された。"},{"sentence":"He found the protocolar nature of the company stifling.","translation":"彼は会社の形式主義的な性質が息苦しいと感じた。"}],"collocations":["protocolar behavior (形式主義的な行動)","protocolar approach (形式主義的なアプローチ)","protocolar attitude (形式主義的な態度)"],"synonyms":["formalistic","bureaucratic","pedantic","stuffy","rigid","inflexible"],"antonyms":["flexible","pragmatic","adaptive"]}],"etymology":{"value":"From 'protocol' + '-ar'. 'Protocol' comes from the Greek 'protokollon', meaning 'first sheet glued to a manuscript', hence the rules and procedures that govern interactions. The suffix '-ar' indicates relating to or of the nature of.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊtəˈkɒlər/","syllables":"pro-to-co-lar"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Protocolar' refers to something related to protocol, which is a set of rules or procedures, especially in formal situations such as diplomatic or governmental events. It can also imply an excessive adherence to formalities, particularly in Latin American contexts. The word is relatively formal and less common in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The protocolar of the meeting was very strict.","correct":"✓ The protocol of the meeting was very strict.","note":"'Protocol' is the noun (the set of rules), while 'protocolar' is the adjective (relating to protocol)."},{"incorrect":"✗ He acted very protocol.","correct":"✓ He acted very protocolarly.","note":"To describe how someone acts in a protocol-related manner, use the adverb 'protocolarly' (though it's rare), or rephrase the sentence. Alternatively, one can say, 'He acted according to protocol'."}],"priority":"★☆☆"},"related_words":{"derivatives":["protocol (noun)","protocolarly (adverb)"],"phrasal_verbs":[],"related_concepts":["etiquette","diplomacy","ceremony","formality","procedure","convention"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'protocolar' is a formal adjective that describes something related to or following protocol, which is a set of rules or procedures, especially in formal situations. It's often used in contexts involving diplomacy, government, or formal events. The word can also imply an excessive concern with formalities. Due to its specialized usage, it is more commonly found in formal writing and discussions rather than everyday conversation."},"example_sentences":[{"sentence":"The ambassador emphasized the importance of following protocolar guidelines.","translation":"大使は儀礼的なガイドラインに従うことの重要性を強調した。","type":"adjective","meaning_category":"儀礼的な"},{"sentence":"The company's protocolar approach to customer service was seen as outdated.","translation":"その会社の顧客サービスに対する形式主義的なアプローチは時代遅れだと見なされた。","type":"adjective","meaning_category":"形式主義の"},{"sentence":"The protocolar requirements for attending the state dinner were extensive.","translation":"国賓晩餐会に出席するための儀礼的な要件は広範囲に及んだ。","type":"adjective","meaning_category":"儀礼的な"}]}