{"word":"unipotence","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"単一の力、単一の支配力、単独の有効性","english_definition":"The state or quality of having only one power, controlling force, or effectiveness.","examples":[{"sentence":"The unipotence of the central government was challenged by regional movements.","translation":"中央政府の単一の支配力は、地方の運動によって挑戦された。"},{"sentence":"The scientist argued for the unipotence of a particular enzyme in catalyzing the reaction.","translation":"科学者は、その反応を触媒する特定の酵素の単独の有効性を主張した。"}],"collocations":["exercise unipotence","challenge unipotence","assert unipotence"],"synonyms":["singularity","uniqueness","sole power","exclusive control"],"antonyms":["multipolence","plurality","diversity of power"]}],"etymology":{"value":"From the Latin 'uni-' (one) + 'potentia' (power).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjuːnɪˈpoʊtəns/","syllables":"u-ni-po-tence"},"inflection":{"noun_plural":"unipotences"},"usage_notes":{"explanation":"'Unipotence' is a relatively rare term, often used in specialized contexts such as political science, biology, or philosophy to describe a situation where a single entity or factor has exclusive or dominant power or influence. It emphasizes the singularity and exclusivity of the power being described.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unipotence of opinions led to a divided society.","correct":"✓ The dominance of one opinion led to a divided society.","note":"'Unipotence' refers to a single power or force, not a single opinion. 'Dominance' is more appropriate in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["unipotent (adjective)"],"related_terms":["omnipotence","impotence","potential"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unipotence' is a specialized term rarely used in everyday language. It describes the state of having a single, unique power or controlling force. Because of its infrequent use and specific meaning, it is considered an advanced vocabulary word. Understanding its etymology (uni- + potence) can help in grasping its meaning."},"example_sentences":[{"sentence":"The dictator sought to establish the unipotence of his regime.","translation":"独裁者は、彼の政権の単一の支配力を確立しようとした。","type":"noun","meaning_category":"単一の支配力"},{"sentence":"The unipotence of this enzyme is crucial for the metabolic pathway.","translation":"この酵素の単独の有効性は、代謝経路にとって非常に重要である。","type":"noun","meaning_category":"単独の有効性"}]}