{"word":"TIA","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(医学) 一過性脳虚血発作","english_definition":"(medicine) Transient Ischemic Attack: a brief episode of neurological dysfunction caused by focal brain or retinal ischemia, with clinical symptoms typically lasting less than one hour, and without evidence of acute infarction.","examples":[{"sentence":"The doctor suspects she had a TIA.","translation":"医師は彼女が一過性脳虚血発作を起こした疑いがあると見ている。"},{"sentence":"TIAs are often warning signs of a future stroke.","translation":"一過性脳虚血発作は、将来の脳卒中の警告サインであることが多い。"}],"collocations":["have a TIA","experience a TIA","TIA symptoms","TIA diagnosis"],"synonyms":["mini-stroke","transient ischemic attack"],"antonyms":[]}],"etymology":{"value":"An acronym for Transient Ischemic Attack.","priority":"★★★"},"pronunciation":{"ipa":"/ˌtiː.aɪˈeɪ/","syllables":"tee-eye-ay"},"inflection":{"notes":"Plural: TIAs"},"usage_notes":{"explanation":"TIA is an abbreviation used in the medical field to refer to a Transient Ischemic Attack. It is important to seek medical attention if someone is suspected of having a TIA, as it can be a warning sign of a future stroke.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a TIA and now he's fine, so it's not a big deal.","correct":"✓ He had a TIA, which requires medical evaluation to assess the risk of a future stroke.","note":"Even though TIA symptoms are transient, it's crucial to seek medical evaluation to determine the cause and prevent future strokes."}],"priority":"★★☆"},"related_words":{"derivatives":["ischemia","stroke","neurology","cerebrovascular"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency outside of medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"TIA is a medical abbreviation that stands for Transient Ischemic Attack. It's a term used by medical professionals to describe a temporary disruption of blood flow to the brain, which can cause stroke-like symptoms. Although the symptoms are temporary, it's important to seek medical attention if you suspect someone has had a TIA, as it can be a warning sign of a future stroke. This term is primarily used in medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Prompt diagnosis and treatment after a TIA can significantly reduce the risk of a subsequent stroke.","translation":"一過性脳虚血発作後の迅速な診断と治療は、その後の脳卒中のリスクを大幅に軽減することができます。","type":"noun","meaning_category":"medical condition"},{"sentence":"The patient was admitted to the hospital for observation following a TIA.","translation":"患者は一過性脳虚血発作後、経過観察のために入院した。","type":"noun","meaning_category":"medical condition"}]}