{"word":"cyanosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"チアノーゼ、青色症","english_definition":"A bluish discoloration of the skin and mucous membranes due to insufficient oxygen in the blood.","examples":[{"sentence":"The baby showed signs of cyanosis shortly after birth.","translation":"その赤ちゃんは出生直後にチアノーゼの兆候を示した。"},{"sentence":"Cyanosis can be a symptom of heart or lung problems.","translation":"チアノーゼは心臓または肺の問題の兆候である可能性がある。"},{"sentence":"Peripheral cyanosis affects the extremities, such as fingers and toes.","translation":"末梢性チアノーゼは、指や足のつま先などの四肢に影響を与える。"}],"collocations":["central cyanosis (中枢性チアノーゼ)","peripheral cyanosis (末梢性チアノーゼ)","cause cyanosis (チアノーゼを引き起こす)","signs of cyanosis (チアノーゼの兆候)","severe cyanosis (重度のチアノーゼ)"],"synonyms":["blueness","dusky skin","blue skin"],"antonyms":["erythema","pink skin"],"medical_terms":["hypoxia","hypoxemia","respiratory distress","congenital heart defect"]}],"etymology":{"value":"Derived from the Greek word 'kyanos' (κυανός), meaning 'dark blue'. The suffix '-osis' indicates a condition or disease.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsaɪ.əˈnoʊ.sɪs/","syllables":"cy-a-no-sis"},"inflection":{"noun_plural":"cyanoses"},"usage_notes":{"explanation":"Cyanosis is a medical sign, not a disease itself. It indicates that there is a problem with oxygen delivery to the tissues. It's important to note whether the cyanosis is central (affecting the core of the body, such as the lips and tongue) or peripheral (affecting the extremities). Central cyanosis usually indicates a more serious underlying condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a cyanosis in his hand.","correct":"✓ He has cyanosis in his hand.","note":"'Cyanosis' is a condition, not a countable object. Therefore, it doesn't take an indefinite article ('a')."},{"incorrect":"✗ The cyanosis is caused by lack of oxygen.","correct":"✓ Cyanosis is caused by a lack of oxygen.","note":"While the first sentence is understandable, the second is more grammatically correct and common in medical contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["cyanotic (adjective: relating to or affected by cyanosis)"],"medical_specialties":["cardiology","pulmonology","neonatology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Technical/Medical vocabulary)","frequency_google_ngram":"Low frequency (relatively uncommon outside medical contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cyanosis' is a medical term referring to the bluish discoloration of the skin and mucous membranes. This condition arises due to a deficiency of oxygen in the blood. It's a sign of underlying health issues, especially those related to the heart or lungs. The term is primarily used in medical settings and may not be commonly encountered in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor noticed cyanosis around the patient's lips.","translation":"医師は患者の唇の周りのチアノーゼに気づいた。","type":"general","meaning_category":"symptom"},{"sentence":"Newborns with certain heart defects may exhibit cyanosis.","translation":"特定の心臓欠陥を持つ新生児はチアノーゼを示すことがある。","type":"medical","meaning_category":"cause"},{"sentence":"Prompt treatment is necessary to reverse cyanosis and improve oxygen levels.","translation":"チアノーゼを改善し、酸素レベルを改善するためには、迅速な治療が必要である。","type":"treatment","meaning_category":"treatment"}]}