{"word":"moonshining","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"密造酒製造、密造酒作り","english_definition":"The illegal production of alcohol, especially distilled spirits like whiskey or rum.","examples":[{"sentence":"Moonshining was a common practice in the Appalachian region during Prohibition.","translation":"密造酒作りは禁酒法時代のアパラチア地方で一般的な慣習でした。"},{"sentence":"The authorities discovered a large-scale moonshining operation hidden in the woods.","translation":"当局は森の中に隠された大規模な密造酒製造組織を発見しました。"}],"collocations":["moonshining operation","moonshining still","illegal moonshining"],"synonyms":["bootlegging","illicit distilling"],"antonyms":["legal distilling","licensed production"]},{"part_of_speech":"verb","definition":"密造酒を製造する (moonshine の現在分詞)","english_definition":"The act of illegally producing alcohol (present participle of moonshine).","examples":[{"sentence":"He was caught moonshining in his backyard.","translation":"彼は裏庭で密造酒を作っているところを捕まりました。"},{"sentence":"They suspected he'd been moonshining for years.","translation":"彼らは彼が何年も密造酒を作っていたのではないかと疑っていました。"}],"collocations":["caught moonshining","suspected of moonshining"],"synonyms":["bootlegging","illegally distilling"],"antonyms":["legally distilling","licensed production"]}],"etymology":{"value":"The term 'moonshining' comes from the practice of illegally distilling alcohol at night, under the cover of the moon, to avoid detection by authorities.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmuːnˌʃaɪnɪŋ/","syllables":"moon-shin-ing"},"inflection":{"noun_plural":null,"verb_forms":null},"usage_notes":{"explanation":"'Moonshining' refers specifically to the illegal production of distilled spirits, not just any illegal alcohol. It often carries a cultural connotation, particularly in the context of rural America and the Prohibition era.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He was moonshining beer in his basement.","correct":"He was illegally brewing beer in his basement.","note":"'Moonshining' typically refers to distilled spirits, not beer. Beer production is usually called 'illegal brewing'."}],"priority":"★☆☆"},"related_words":{"derivatives":["moonshine (noun: 密造酒)","moonshiner (noun: 密造酒製造者)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Moonshining' refers to the illegal production of distilled alcohol, typically in rural areas and often associated with historical periods like Prohibition. It implies a clandestine operation to avoid taxes and legal restrictions. The term is more specific than simply 'illegal alcohol production' and carries cultural and historical connotations."},"example_sentences":[{"sentence":"The old man was rumored to have made a fortune moonshining during the Depression.","translation":"その老人は大恐慌時代に密造酒作りで財を成したという噂があった。","type":"noun","meaning_category":"密造酒製造"},{"sentence":"Moonshining is a dangerous activity, both legally and physically.","translation":"密造酒作りは、法的にも肉体的にも危険な行為です。","type":"noun","meaning_category":"密造酒製造"},{"sentence":"The smell of the mash indicated that someone had been moonshining nearby.","translation":"マッシュの匂いは、誰かが近くで密造酒を作っていたことを示していた。","type":"verb","meaning_category":"密造酒を製造する"}]}