{"word":"Quietist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"静寂主義者、神秘主義の一派","english_definition":"A person who adheres to or advocates Quietism, a Christian mystical tradition emphasizing passive contemplation and detachment from worldly concerns.","examples":[{"sentence":"The Quietists believed that true communion with God could only be achieved through inner stillness.","translation":"静寂主義者たちは、神との真の交わりは内なる静寂を通してのみ達成できると信じていた。"}],"collocations":["Quietist movement","Quietist theology","spiritual Quietist"],"synonyms":["mystic","contemplative","recluse","ascetic"],"antonyms":["activist","pragmatist"]},{"part_of_speech":"adjective","definition":"静寂主義の、静寂主義的な","english_definition":"Relating to or characteristic of Quietism.","examples":[{"sentence":"The Quietist approach to prayer involves emptying the mind of all thoughts and desires.","translation":"祈りに対する静寂主義的なアプローチは、すべての思考と欲望から心を空っぽにすることを含む。"}],"collocations":["Quietist principles","Quietist practices","Quietist spirituality"],"synonyms":["contemplative","mystical","passive","meditative"],"antonyms":["active","engaged","involved"]}],"etymology":{"value":"From 'Quietism' + '-ist'. 'Quietism' is from French 'quiétisme', from Italian 'quietismo', from Latin 'quietus' (quiet).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkwaɪətɪst/","syllables":"qui-et-ist"},"inflection":{"noun_plural":"Quietists"},"usage_notes":{"explanation":"'Quietist' refers to a follower or proponent of Quietism, a Christian mystical tradition that emphasizes passivity, contemplation, and detachment from worldly concerns as the path to spiritual union with God. The term can also be used adjectivally to describe ideas, practices, or approaches associated with Quietism. It is often used in historical or theological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a quietist person, always talking.","correct":"✓ He was a quiet person, always listening.","note":"'Quietist' refers to a specific religious or philosophical belief, not simply a quiet personality. Use 'quiet' for someone who is generally reserved or soft-spoken."}],"priority":"★☆☆"},"related_words":{"derivatives":["Quietism","quietistic"],"related_terms":["mysticism","contemplation","passivity","detachment"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Quietist' is a specialized term referring to a person who practices or believes in Quietism, a form of Christian mysticism focused on passive contemplation and detachment from the world. It's a term typically encountered in discussions of religious history, philosophy, or theology. The adjective 'Quietist' describes things related to this belief system. It's not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The bishop condemned the Quietist doctrines as heretical.","translation":"司教は静寂主義の教義を異端として非難した。","type":"noun","meaning_category":"Religious Belief"},{"sentence":"Her spiritual journey led her to adopt a Quietist lifestyle, dedicated to prayer and solitude.","translation":"彼女の精神的な旅は、祈りと孤独に捧げられた静寂主義的なライフスタイルを採用することにつながった。","type":"adjective","meaning_category":"Lifestyle"}]}