{"word":"profanchise","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"To remove a franchise from a sports team or business, typically due to poor performance, scandal, or relocation issues.","english_definition":"To revoke or terminate a franchise agreement, especially in sports or business contexts.","examples":[{"sentence":"The league decided to profanchise the team after years of financial losses and fan dissatisfaction.","translation":"リーグは、長年の財政赤字とファンの不満の後、そのチームのフランチャイズ権を剥奪することを決定しました。"},{"sentence":"If the company fails to meet its obligations, we may have to profanchise them.","translation":"もし会社が義務を履行できない場合、彼らのフランチャイズ権を剥奪しなければならないかもしれません。"}],"collocations":["profanchise a team","profanchise a business","decision to profanchise","grounds to profanchise"],"synonyms":["revoke franchise","terminate franchise","rescind franchise"],"antonyms":["franchise","grant franchise","award franchise"]}],"etymology":{"value":"A blend of 'pro-' (meaning 'against' or 'removal') and 'franchise'. The 'pro-' prefix is used here in a similar sense to 'prohibit' or 'proscribe'.","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈfænˌtʃaɪz/","syllables":"pro-fan-chise"},"inflection":{"verb_forms":{"present_simple":["profanchise","profanchises"],"past_simple":"profanchised","past_participle":"profanchised","present_participle":"profanchising"}},"usage_notes":{"explanation":"'Profanchise' is a relatively rare and informal term, primarily used in sports and business contexts. It describes the act of taking away a franchise, which is the right or license to operate a business or sports team under a particular brand or within a specific territory. The term is often used when a team or business has failed to meet certain standards or has violated the terms of its franchise agreement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city profanchised the new stadium.","correct":"✓ The city profanchised the team because they wanted a new stadium.","note":"'Profanchise' applies to the *team* or *business*, not the physical location or asset. The stadium might be a *reason* for profanchising, but it is not what is being profanchised."},{"incorrect":"✗ He was profanchised from playing in the league.","correct":"✓ He was banned from playing in the league.","note":"'Profanchise' refers to the *team's* or *business'* franchise rights, not an individual's ability to participate. Use 'banned', 'suspended', or similar terms for individuals."}],"priority":"★★☆"},"related_words":{"derivatives":["profanchisement (noun): The act of profanchising or the state of being profanchised."],"related_concepts":["franchise","franchise agreement","relocation","team performance","financial performance","contract termination"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The term is not commonly used in formal writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Profanchise' is a specialized term primarily used in the context of sports or business. It means to revoke or terminate a franchise agreement, typically due to poor performance, scandal, or relocation issues. The term is relatively rare and is not commonly found in general writing. Understanding the concept requires familiarity with the meaning of 'franchise' and the context of business or sports agreements."},"example_sentences":[{"sentence":"The struggling hockey team was profanchised by the league due to consistent low attendance and financial losses.","translation":"経営難のホッケーチームは、一貫した観客動員数の低迷と財政赤字のため、リーグによってフランチャイズ権を剥奪されました。","type":"verb","meaning_category":"Franchise revocation in sports"},{"sentence":"The fast-food chain threatened to profanchise several of its locations for failing to meet quality control standards.","translation":"そのファストフードチェーンは、品質管理基準を満たしていないため、いくつかの店舗のフランチャイズ権を剥奪すると脅しました。","type":"verb","meaning_category":"Franchise termination in business"},{"sentence":"The decision to profanchise the team sparked controversy among fans and local businesses.","translation":"チームのフランチャイズ権を剥奪するという決定は、ファンや地元の企業の間で論争を引き起こしました。","type":"verb","meaning_category":"Controversial franchise decision"}]}