{"word":"nurse-mother","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"乳母（うば）","english_definition":"A woman employed to breastfeed and care for another's child.","examples":[{"sentence":"In the past, wealthy families often employed a nurse-mother to care for their infants.","translation":"昔、裕福な家庭では、乳児の世話をするために乳母を雇うことがよくありました。"}],"collocations":["hire a nurse-mother","employ a nurse-mother","wet nurse"],"synonyms":["wet nurse","nanny","caregiver"],"antonyms":[]}],"etymology":{"value":"The term combines 'nurse' (in the sense of caring for a child) and 'mother' (indicating the maternal role of providing nourishment).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnɜːrs ˌmʌðər/","syllables":"nurse-moth-er"},"inflection":{"noun_plural":"nurse-mothers"},"usage_notes":{"explanation":"The term 'nurse-mother' is somewhat archaic and less commonly used in modern English. The term 'wet nurse' is a more common synonym, specifically referring to the aspect of breastfeeding another's child.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a nurse mother in the hospital.","correct":"✓ She is a nurse at the hospital.","note":"'Nurse mother' specifically refers to a woman who breastfeeds another's child, not a nurse working in a hospital."}],"priority":"★☆☆"},"related_words":{"derivatives":["nurse","mother"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'nurse-mother' is relatively uncommon and may require some historical or cultural context to fully understand. It refers to a woman who breastfeeds and cares for another person's child, a practice more common in previous eras. Understanding the term requires a grasp of historical childcare practices."},"example_sentences":[{"sentence":"The novel featured a nurse-mother who played a significant role in the protagonist's upbringing.","translation":"その小説には、主人公の育成に重要な役割を果たした乳母が登場しました。","type":"noun","meaning_category":"乳母"},{"sentence":"Hiring a nurse-mother was a common practice among aristocratic families.","translation":"乳母を雇うことは、貴族の家族の間では一般的な慣習でした。","type":"noun","meaning_category":"乳母"}]}