{"word":"self-abandonment","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己放棄、自己犠牲、自分を顧みないこと","english_definition":"The act or state of relinquishing one's own needs, desires, or well-being for the sake of others or a cause; a lack of self-care or self-preservation.","examples":[{"sentence":"Her self-abandonment led to burnout and resentment.","translation":"彼女の自己犠牲は、燃え尽き症候群と恨みにつながった。"},{"sentence":"He practiced self-abandonment in his devotion to his family.","translation":"彼は家族への献身において自己犠牲を実践した。"},{"sentence":"The therapist warned her against self-abandonment and encouraged her to prioritize her own needs.","translation":"セラピストは彼女に自己放棄をしないように警告し、自分のニーズを優先するように促した。"}],"collocations":["complete self-abandonment (完全な自己放棄)","emotional self-abandonment (感情的な自己放棄)","path of self-abandonment (自己放棄の道)","tendency towards self-abandonment (自己放棄の傾向)","avoid self-abandonment (自己放棄を避ける)","encourage self-abandonment (自己放棄を奨励する)"],"synonyms":["self-sacrifice","self-neglect","self-denial","altruism (過度な場合)","martyrdom (過度な場合)"],"antonyms":["self-care","self-preservation","self-interest","egoism","narcissism"]},{"part_of_speech":"noun","definition":"(精神分析) 自己を失うこと、自己同一性の喪失","english_definition":"(Psychoanalysis) A state of losing one's sense of self or identity, often as a defense mechanism or in response to trauma.","examples":[{"sentence":"Self-abandonment can be a symptom of deeper psychological issues.","translation":"自己放棄は、より深刻な心理的問題の症状である可能性がある。"},{"sentence":"In therapy, she explored the roots of her self-abandonment and began to reclaim her identity.","translation":"セラピーで、彼女は自己放棄の根源を探求し、自己同一性を取り戻し始めた。"}],"collocations":["causes of self-abandonment (自己放棄の原因)","symptoms of self-abandonment (自己放棄の症状)","overcome self-abandonment (自己放棄を克服する)","therapy for self-abandonment (自己放棄のセラピー)"],"synonyms":["dissociation","depersonalization","identity crisis","loss of self"],"antonyms":["self-awareness","self-discovery","self-actualization"]}],"etymology":{"value":"The term is formed by combining \"self\" (referring to oneself) with \"abandonment\" (the act of giving up or relinquishing). It describes the act of giving up or neglecting one's own needs and desires.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌself əˈbændənmənt/","syllables":"self-a-ban-don-ment"},"inflection":{"notes":"This is a noun and does not have different inflections."},"usage_notes":{"explanation":"\"Self-abandonment\" describes a pattern of behavior where an individual consistently prioritizes the needs and desires of others over their own. This can stem from various factors, including low self-esteem, a desire for approval, or past trauma. While helping others is generally positive, self-abandonment becomes problematic when it leads to neglecting one's own well-being and a loss of personal identity. In a psychological context, it can also refer to a more profound sense of dissociation or loss of self.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is very self-abandoned.","correct":"✓ She practices self-abandonment.","note":"\"Self-abandonment\" is a noun, not an adjective. Use it with verbs like \"practice,\" \"engage in,\" or \"experience.\""},{"incorrect":"✗ Self-abandonment is always a good thing.","correct":"✓ Self-abandonment can be detrimental to one's well-being.","note":"While self-sacrifice can be admirable in certain situations, consistent self-abandonment is generally considered unhealthy. It's important to maintain a balance between caring for others and caring for oneself."}],"priority":"★☆☆"},"related_words":{"derivatives":["self-abandoned (adjective, rare)"],"phrasal_verbs":[],"related_concepts":["codependency","people-pleasing","low self-esteem","boundary issues","trauma","attachment theory"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. The term is more common in psychological and self-help contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Self-abandonment\" is a complex term that describes the act of consistently neglecting one's own needs and desires in favor of others. It's often associated with low self-esteem, a desire for approval, or past trauma. While helping others is generally positive, self-abandonment becomes problematic when it leads to neglecting one's own well-being and a loss of personal identity. The term is often used in psychological contexts to describe a deeper sense of dissociation or loss of self."},"example_sentences":[{"sentence":"His constant **self-abandonment** in his relationship left him feeling empty and resentful.","translation":"彼の絶え間ない自己犠牲的な関係は、彼を空虚で恨みがましく感じさせた。","type":"noun","meaning_category":"自己犠牲"},{"sentence":"She realized that her **self-abandonment** was a pattern learned in childhood.","translation":"彼女は、自分の自己放棄が子供の頃に学んだパターンであることに気づいた。","type":"noun","meaning_category":"自己犠牲"},{"sentence":"The therapist helped her identify the root causes of her **self-abandonment**.","translation":"セラピストは、彼女が自己放棄の根本的な原因を特定するのを助けた。","type":"noun","meaning_category":"自己犠牲"},{"sentence":"Overcoming **self-abandonment** requires setting healthy boundaries and prioritizing self-care.","translation":"自己放棄を克服するには、健全な境界線を設定し、セルフケアを優先する必要がある。","type":"noun","meaning_category":"自己犠牲"}]}