{"word":"canthoplasty","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"目尻切開術（がんかさいかいじゅつ）","english_definition":"A surgical procedure that repositions or reshapes the outer corner of the eye (lateral canthus).","examples":[{"sentence":"She underwent canthoplasty to achieve a more almond-shaped eye.","translation":"彼女はアーモンド型の目を実現するために目尻切開術を受けた。"},{"sentence":"Canthoplasty can be performed to correct drooping eyelids or to improve the overall appearance of the eyes.","translation":"目尻切開術は、まぶたのたるみを矯正したり、目の全体的な外観を改善するために行うことができる。"}],"collocations":["lateral canthoplasty","reconstructive canthoplasty","cosmetic canthoplasty"],"synonyms":["lateral canthal repositioning","eye corner surgery"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'kanthos' (corner of the eye) and 'plassein' (to mold or shape).","priority":"★★☆"},"pronunciation":{"ipa":"ˈkænθəˌplæsti","syllables":"can-tho-plas-ty"},"inflection":{"noun_plural":"canthoplasties"},"usage_notes":{"explanation":"Canthoplasty is a surgical procedure primarily used in cosmetic surgery to alter the shape and position of the outer corner of the eye. It may also be performed for reconstructive purposes, such as correcting eyelid malposition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Canthoplasty is a non-invasive procedure.","correct":"✓ Canthoplasty is a surgical procedure.","note":"Canthoplasty involves surgery and is not a non-invasive treatment."}],"priority":"★★☆"},"related_words":{"derivatives":["canthus (noun: outer or inner corner of the eye)","canthopexy (noun: a similar procedure that tightens the canthus without significantly altering its position)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Canthoplasty is a specialized surgical term referring to a procedure that alters the structure of the canthus, the outer corner of the eye. It's primarily used in cosmetic and reconstructive surgery. Due to its specific context within medicine and cosmetic procedures, it is not a common term in everyday language."},"example_sentences":[{"sentence":"The surgeon recommended canthoplasty to address the patient's lower eyelid laxity.","translation":"外科医は、患者の下まぶたの弛緩を改善するために目尻切開術を勧めた。","type":"medical","meaning_category":"surgical procedure"},{"sentence":"Canthoplasty can create a more youthful and refreshed appearance around the eyes.","translation":"目尻切開術は、目の周りのより若々しくリフレッシュされた外観を作り出すことができる。","type":"cosmetic","meaning_category":"surgical procedure"}]}