{"word":"Astogeny","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学)個体発生、個体発生学：個体の発生と発達の研究","english_definition":"(biology) The development of an individual organism or anatomical or histological feature from its earliest stage to maturity.","examples":[{"sentence":"Astogeny is a fundamental aspect of developmental biology.","translation":"個体発生は発生生物学の基本的な側面です。"},{"sentence":"The study of astogeny helps us understand how organisms grow and change over time.","translation":"個体発生の研究は、生物がどのように成長し、時間とともに変化するかを理解するのに役立ちます。"}],"collocations":["study of astogeny","process of astogeny","developmental astogeny"],"synonyms":["ontogeny","developmental biology","embryology"],"antonyms":["phylogeny"]}],"etymology":{"value":"Derived from the Greek words 'astron' (ἄστρον) meaning 'star' or 'origin' and 'genesis' (γένεσις) meaning 'origin' or 'creation'. The 'astro-' part is somewhat misleading as it doesn't directly relate to stars, but rather to the beginning or origin of something.","priority":"★★☆"},"pronunciation":{"ipa":"/æsˈtɒdʒəni/","syllables":"as-toj-e-ny"},"inflection":{"noun_plural":"astogenies"},"usage_notes":{"explanation":"'Astogeny' is often used interchangeably with 'ontogeny', although some sources suggest subtle differences. Generally, 'astogeny' may emphasize the entire life cycle development, while 'ontogeny' can focus more on the embryonic stages. However, this distinction is not always strictly observed. The term is primarily used in biological and developmental contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Astrogeny is the study of fossils.","correct":"✓ Paleontology is the study of fossils.","note":"Astogeny is about individual development, not fossils. Paleontology deals with fossils."},{"incorrect":"✗ Astogeny is the same as phylogeny.","correct":"✓ Astogeny is the development of an individual, while phylogeny is the evolutionary history of a species.","note":"Astogeny and phylogeny are related but distinct concepts. Astogeny focuses on individual development, while phylogeny focuses on the evolutionary history of a species."}],"priority":"★★☆"},"related_words":{"derivatives":["astogenetic (adjective): relating to astogeny"],"phrases":["developmental biology","ontogenetic development"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Astogeny' is a technical term used in biology to describe the development of an individual organism from its earliest stage to maturity. It is closely related to the term 'ontogeny,' and the two are often used interchangeably. Understanding 'astogeny' requires a background in developmental biology and a familiarity with scientific terminology. The term is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The astogeny of the sea urchin has been extensively studied.","translation":"ウニの個体発生は広範囲に研究されてきた。","type":"scientific","meaning_category":"individual development"},{"sentence":"Understanding the astogeny of a plant can help improve agricultural practices.","translation":"植物の個体発生を理解することは、農業技術の改善に役立つ。","type":"scientific","meaning_category":"individual development"}]}