{"word":"dimenhydrinate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ジメンヒドリナート：乗り物酔い、吐き気、めまいを治療するために使用される抗ヒスタミン薬","english_definition":"An antihistamine used to treat motion sickness, nausea, and dizziness.","examples":[{"sentence":"Dimenhydrinate is commonly found in over-the-counter motion sickness medications.","translation":"ジメンヒドリナートは、市販の乗り物酔い薬によく含まれています。"},{"sentence":"The doctor recommended dimenhydrinate for my seasickness.","translation":"医者は私の船酔いに対してジメンヒドリナートを勧めました。"}],"collocations":["take dimenhydrinate","dimenhydrinate tablet","dimenhydrinate side effects"],"synonyms":["Dramamine (商品名)"],"antonyms":[]}],"etymology":{"value":"Dimenhydrinate is a combination of diphenhydramine and 8-chlorotheophylline.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪmənˈhaɪdrɪneɪt/","syllables":"di-men-hy-dri-nate"},"inflection":{"notes":"単数形"},"usage_notes":{"explanation":"Dimenhydrinate is primarily used to prevent and treat motion sickness. It works by reducing the activity of the inner ear, which is responsible for balance. It can cause drowsiness, so caution is advised when driving or operating machinery.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I took a dimenhydrinate for my headache.","correct":"✓ I took dimenhydrinate for my motion sickness.","note":"Dimenhydrinate is specifically for motion sickness, nausea, and dizziness, not headaches."}],"priority":"★★☆"},"related_words":{"derivatives":["diphenhydramine","8-chlorotheophylline"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Dimenhydrinate is a medication used to prevent and treat nausea, vomiting, and dizziness caused by motion sickness. It is an antihistamine that affects the inner ear, reducing sensitivity to motion. Common side effects include drowsiness and dry mouth. It's important to follow dosage instructions carefully and avoid alcohol while taking this medication."},"example_sentences":[{"sentence":"She took a dimenhydrinate tablet before the long car ride.","translation":"彼女は長距離の車の移動の前にジメンヒドリナートの錠剤を飲みました。","type":"noun","meaning_category":"薬"},{"sentence":"Dimenhydrinate can cause drowsiness, so avoid driving after taking it.","translation":"ジメンヒドリナートは眠気を引き起こす可能性があるため、服用後の運転は避けてください。","type":"noun","meaning_category":"薬"}]}