{"word":"adoxography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"取るに足らない事柄や、重要でないテーマについて、見かけ上は真面目な文章を書くこと。または、重要でない事柄を弁護する文章。","english_definition":"writing about unimportant or trifling subjects in a seemingly serious manner; a defense of something trifling.","examples":[{"sentence":"His essay was a fine example of adoxography, praising the virtues of lint collecting.","translation":"彼の随筆は、糸くず集めの美徳を称賛する、見事なアドクソグラフィーの例だった。"},{"sentence":"The student's adoxography on the importance of paperclips earned him a surprising amount of attention.","translation":"ペーパークリップの重要性に関する学生のアドクソグラフィーは、彼に驚くほどの注目を集めた。"}],"collocations":["write an adoxography","an example of adoxography","a famous adoxography"],"synonyms":["paradoxography","trivialism","sophistry"],"antonyms":["serious treatise","important discourse"]}],"etymology":{"value":"ギリシャ語の *adoxos* (取るに足らない、奇妙な) + *graphia* (書くこと) に由来。*adoxos* は *a-* (否定) + *doxa* (意見、名声) から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌædəˈksɒɡrəfi/","syllables":"a-dox-og-ra-phy"},"inflection":{"noun_plural":"adoxographies"},"usage_notes":{"explanation":"アドクソグラフィーは、一見すると価値がない、または重要でないと思われるテーマについて、知的で洗練された議論を展開する文芸的な手法を指します。ユーモア、風刺、または単に知的な遊びとして用いられることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote an adoxography about the solar system.","correct":"✓ He wrote an adoxography about the importance of collecting stamps.","note":"アドクソグラフィーは、重要でないテーマについて書かれたものでなければなりません。太陽系のような重要なテーマは適切ではありません。"},{"incorrect":"✗ The adoxography was very serious and boring.","correct":"✓ The adoxography was witty and engaging, despite its trivial subject.","note":"アドクソグラフィーは、テーマが取るに足らないものであっても、知的で面白く、読者を惹きつけるものでなければなりません。"}],"priority":"★☆☆"},"related_words":{"derivatives":["adoxographical (形容詞: アドクソグラフィーの、アドクソグラフィー的な)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常にまれな単語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**adoxography**」は、非常に特殊な単語で、日常会話ではほとんど使われません。これは、重要でない事柄について、真面目なふりをして書くことを意味します。この単語は、文学や哲学の高度な議論で使われることがあります。例えば、誰かが「ボタンの重要性」について真剣なエッセイを書いた場合、それはアドクソグラフィーの例と言えるでしょう。"},"example_sentences":[{"sentence":"The professor assigned an adoxography, challenging students to defend the merits of procrastination.","translation":"教授はアドクソグラフィーを課題として出し、学生たちに先延ばしの利点を弁護させた。","type":"noun","meaning_category":"書くこと"},{"sentence":"His adoxography on the aesthetics of chewing gum was surprisingly insightful.","translation":"彼のチューインガムの美学に関するアドクソグラフィーは、驚くほど洞察力に富んでいた。","type":"noun","meaning_category":"書くこと"}]}