{"word":"shutterable","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Capable of being shuttered; able to be closed or covered with a shutter.","english_definition":"Capable of being closed or covered with a shutter.","examples":[{"sentence":"The windows are shutterable, providing privacy and protection from the storm.","translation":"その窓はシャッターで閉じることができ、プライバシーを確保し、嵐から保護します。"},{"sentence":"A shutterable skylight allows for control over the amount of sunlight entering the room.","translation":"シャッターで閉じることができる天窓は、部屋に入る日光の量を調整できます."}],"collocations":["shutterable windows","shutterable skylight","shutterable opening"],"synonyms":["closable","coverable","sealable"],"antonyms":["unshutterable","open","uncovered"]}],"etymology":{"value":"Derived from the word 'shutter' (a movable cover for a window or other opening) with the suffix '-able' (capable of being).","priority":"N/A"},"pronunciation":{"ipa":"/ˈʃʌtərəbəl/","syllables":"shut-ter-a-ble"},"inflection":{"adjective_forms":{"comparative":"more shutterable","superlative":"most shutterable"}},"usage_notes":{"explanation":"The word 'shutterable' is a descriptive adjective, indicating that something has the capability of being closed or covered by a shutter. It is not a commonly used word, but it is readily understood due to the familiarity of the base word 'shutter' and the common suffix '-able'. It is most often used to describe windows, skylights, or other openings that can be closed for privacy, security, light control, or weather protection.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The shutterable is broken.","correct":"✓ The shutter is broken.","note":"'Shutterable' is an adjective, not a noun. Use 'shutter' as the noun."},{"incorrect":"✗ The window is shuttered, but not shutterable.","correct":"✓ The window is shuttered, but the shutters are broken.","note":"'Shuttered' means 'closed with shutters'. 'Shutterable' means 'capable of being closed with shutters'."}],"priority":"N/A"},"related_words":{"derivatives":["shutter (noun)","shuttered (adjective)"],"phrasal_verbs":[],"related_terms":["shuttering"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - not a commonly used word.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Shutterable' is a relatively uncommon adjective that means 'capable of being closed or covered with a shutter'. It combines the familiar word 'shutter' with the common suffix '-able', making its meaning readily understandable even if unfamiliar. It is typically used in descriptive contexts, such as architectural or construction descriptions, to specify that a window, opening, or other feature can be closed or covered with a shutter. Due to its specialized usage, it is more likely to be encountered in written rather than spoken contexts."},"example_sentences":[{"sentence":"These are shutterable windows, so you can block out all the light.","translation":"これらはシャッターで閉じることができる窓なので、すべての光を遮断できます。","type":"adjective","meaning_category":"capable of being shuttered"},{"sentence":"The architect designed a shutterable roof for the greenhouse.","translation":"建築家は温室のためにシャッターで閉じることができる屋根を設計しました。","type":"adjective","meaning_category":"capable of being shuttered"}]}