{"word":"intrareligious","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"宗教内の、宗教内部の","english_definition":"existing or occurring within a single religion.","examples":[{"sentence":"The conference focused on intrareligious dialogue and understanding.","translation":"その会議は、宗教内の対話と理解に焦点を当てた。"},{"sentence":"Intrareligious diversity is often overlooked.","translation":"宗教内の多様性はしばしば見過ごされる。"},{"sentence":"The study examined intrareligious conflict.","translation":"その研究は、宗教内の紛争を調査した。"}],"collocations":["intrareligious dialogue","intrareligious conflict","intrareligious diversity","intrareligious understanding"],"synonyms":["intrafaithed","within-religion"],"antonyms":["interreligious","interfaith"]}],"etymology":{"value":"The word \"intrareligious\" is formed by combining the prefix \"intra-\" (meaning within) with the word \"religious\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntrərɪˈlɪdʒəs/","syllables":"in-tra-re-li-gious"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Intrareligious\" refers to something that exists or occurs within the boundaries of a single religion. It is used to describe aspects, discussions, or conflicts that take place among members, groups, or interpretations within the same religious tradition. It is often used in contrast to \"interreligious,\" which refers to interactions between different religions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The meeting was intrareligious, involving Christians and Muslims.","correct":"The meeting was interreligious, involving Christians and Muslims.","note":"Intrareligious refers to something within a single religion, while interreligious refers to something between different religions."}],"priority":"★★☆"},"related_words":{"derivatives":["intrareligion"],"related_terms":["religion","religious","interreligious","faith","theology"]},"level_frequency":{"priority":"☆☆☆","notes":"This term is relatively uncommon and is primarily used in academic or specialized contexts related to religious studies, sociology, and political science."},"readability_explanation":{"level":"C1","text":"The word \"intrareligious\" is a specialized term used in academic and scholarly discussions about religion. It refers to things that happen inside one particular religion. For example, different groups within Christianity having different beliefs would be an example of something \"intrareligious.\" This word is not commonly used in everyday conversation, but it is important for understanding academic writing about religion."},"example_sentences":[{"sentence":"The book explores the complexities of intrareligious debates on gender roles.","translation":"その本は、ジェンダー役割に関する宗教内議論の複雑さを探求している。","type":"general","meaning_category":"general"},{"sentence":"Scholars are increasingly interested in the dynamics of intrareligious identity formation.","translation":"学者たちは、宗教内アイデンティティ形成のダイナミクスにますます関心を持っている。","type":"academic","meaning_category":"academic"},{"sentence":"Intrareligious tensions can sometimes lead to schisms within a religious community.","translation":"宗教内の緊張は、時に宗教コミュニティ内の分裂につながることがある。","type":"general","meaning_category":"general"}]}