{"word":"myxospore","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"粘液胞子","english_definition":"A resting cell of myxobacteria, characterized by a thick cell wall and increased resistance to desiccation and heat.","examples":[{"sentence":"Myxospores are more resistant to environmental stress than vegetative cells.","translation":"粘液胞子は、栄養細胞よりも環境ストレスに対する耐性が高い。"},{"sentence":"The formation of myxospores is triggered by nutrient limitation.","translation":"粘液胞子の形成は、栄養制限によって引き起こされる。"}],"collocations":["form myxospores","germinate myxospores","Myxococcus xanthus myxospore"],"synonyms":["spore","resting cell"],"antonyms":["vegetative cell"]}],"etymology":{"value":"From 'myxo-' (referring to slime or mucus) + 'spore'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɪksəˌspɔːr/","syllables":"myx-o-spore"},"inflection":{"noun_plural":"myxospores"},"usage_notes":{"explanation":"Myxospores are specialized resting cells produced by myxobacteria, a group of social bacteria known for their complex life cycle. These spores are more resistant to environmental stresses, such as desiccation and heat, compared to vegetative cells. The formation of myxospores is a survival strategy triggered by unfavorable conditions, such as nutrient limitation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Myxospores are bacteria that live in water.","correct":"✓ Myxospores are resting cells of myxobacteria.","note":"Myxospores are not themselves bacteria, but rather specialized cells produced by myxobacteria."}],"priority":"★☆☆"},"related_words":{"derivatives":["myxobacteria","sporulation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Myxospore' is a technical term in microbiology referring to a specific type of resting cell produced by myxobacteria. Understanding it requires familiarity with bacterial life cycles and spore formation. The term is primarily used in scientific contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The drought conditions stimulated the myxobacteria to form resistant myxospores.","translation":"干ばつ状態は、粘液細菌が耐性のある粘液胞子を形成するのを刺激した。","type":"scientific","meaning_category":"biology"},{"sentence":"Myxospores can survive for extended periods until favorable conditions return.","translation":"粘液胞子は、好ましい条件が戻るまで長期間生存することができる。","type":"scientific","meaning_category":"biology"}]}