{"word":"prorecognition","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The state of being in favor of recognition, especially in a political or diplomatic context.","english_definition":"The state or condition of supporting or advocating for recognition, often in a political or diplomatic sense.","examples":[{"sentence":"The movement gained momentum due to its strong prorecognition stance.","translation":"その運動は、強力な承認支持の姿勢により勢いを増した。"},{"sentence":"The government's prorecognition policy led to improved relations with the breakaway region.","translation":"政府の承認支持政策は、分離地域との関係改善につながった。"}],"collocations":["prorecognition stance","prorecognition policy","prorecognition movement","prorecognition efforts"],"synonyms":["recognition support","advocacy for recognition","support for recognition"],"antonyms":["antirecognition","opposition to recognition"]}],"etymology":{"value":"Formed by combining the prefix 'pro-' (meaning 'in favor of') with the noun 'recognition'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊˌrɛkəɡˈnɪʃən/","syllables":"pro-rec-og-ni-tion"},"inflection":{"noun_plural":"prorecognitions"},"usage_notes":{"explanation":"'Prorecognition' is typically used in political science, international relations, and related fields to describe the attitude or actions of entities that support the formal recognition of a state, government, or other entity. It often implies active efforts to achieve such recognition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The prorecognition was evident in their statement.","correct":"✓ The prorecognition stance was evident in their statement.","note":"'Prorecognition' is a state or condition, not a direct action or statement. Use it with words like 'stance,' 'policy,' or 'efforts'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["recognition","diplomatic recognition","political recognition","state recognition"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Prorecognition' is a relatively uncommon term used in specific fields like political science and international relations. It describes the support for or advocacy of recognition, typically of a state or government. Understanding the term requires familiarity with the concept of 'recognition' in a political or diplomatic context."},"example_sentences":[{"sentence":"The senator expressed a prorecognition view regarding the newly formed nation.","translation":"上院議員は、新しく設立された国家に関して、承認を支持する見解を表明した。","type":"noun","meaning_category":"Favoring recognition"},{"sentence":"The prorecognition lobby actively campaigned for international support.","translation":"承認支持ロビーは、国際的な支持を得るために積極的に活動した。","type":"noun","meaning_category":"Favoring recognition"}]}