{"word":"Corticoline","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A hypothetical substance formerly believed to be produced by the cerebral cortex and to stimulate the activity of neurons.","english_definition":"A hypothetical substance formerly believed to be produced by the cerebral cortex and to stimulate the activity of neurons.","examples":[{"sentence":"Early neurochemical theories proposed the existence of corticoline to explain cortical function.","translation":"初期の神経化学理論では、皮質機能を説明するためにコルチコリンの存在が提唱されました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'cortex' (referring to the cerebral cortex) and the suffix '-ine' (commonly used to denote chemical substances).","priority":"★★★"},"pronunciation":{"ipa":"/kɔːrˈtɪkəliːn/","syllables":"cor-ti-co-line"},"inflection":{},"usage_notes":{"explanation":"The term 'corticoline' is largely historical. Modern neuroscience has not identified a single substance with the properties once attributed to corticoline. The concept is now primarily of historical interest in the context of the development of neurochemistry.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["cortical (adjective: relating to the cortex)","cortex (noun: the outer layer of an organ or structure, especially the brain)"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"'Corticoline' is a highly specialized term from the history of neuroscience. It is unlikely to be encountered outside of historical or theoretical discussions of early neurochemical theories. Understanding the term requires familiarity with the basic structure and function of the brain, as well as a background in the history of neuroscience.","priority":"★★★"},"example_sentences":[{"sentence":"The concept of corticoline played a role in early attempts to understand neurotransmission.","translation":"コルチコリンの概念は、神経伝達を理解するための初期の試みにおいて役割を果たしました。","type":"general","meaning_category":"historical context"}]}