{"word":"self-discrimination","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己差別、自虐","english_definition":"The act of discriminating against oneself, often due to internalized negative beliefs or feelings of inadequacy.","examples":[{"sentence":"Some people engage in self-discrimination due to low self-esteem.","translation":"自尊心の低さから自己差別をする人もいる。"},{"sentence":"Internalized racism can lead to self-discrimination within a minority group.","translation":"内面化された人種差別は、少数派グループ内での自己差別に繋がる可能性がある。"},{"sentence":"The constant criticism led her to practice self-discrimination.","translation":"絶え間ない批判が、彼女に自己差別をさせるようになった。"}],"collocations":["internalized self-discrimination","practice self-discrimination","engage in self-discrimination"],"synonyms":["self-deprecation","self-hatred","self-belittlement","self-rejection","self-oppression"],"antonyms":["self-acceptance","self-love","self-esteem","self-compassion"]}],"etymology":{"value":"A compound word formed from \"self\" (referring to oneself) and \"discrimination\" (treating a person or group differently, often negatively). The term implies that the discrimination is directed towards oneself.","priority":"★★★"},"pronunciation":{"ipa":"/ˌself dɪˌskrɪmɪˈneɪʃən/","syllables":"self-dis-crim-i-na-tion"},"inflection":{"noun_plural":"self-discriminations"},"usage_notes":{"explanation":"\"Self-discrimination\" refers to the act of treating oneself unfairly or negatively, often stemming from internalized prejudices, negative self-perception, or feelings of inadequacy. It can manifest in various ways, such as self-sabotage, negative self-talk, or avoiding opportunities due to a lack of self-belief. The term is often used in discussions of social justice and identity, particularly in relation to marginalized groups who may internalize societal biases.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is self-discriminated.","correct":"✓ He practices self-discrimination. / ✓ He is engaging in self-discrimination.","note":"\"Self-discrimination\" is a noun, so it's more accurate to use it with verbs like \"practice\" or \"engage in\" rather than as a verb itself. Using it as a verb requires rephrasing, such as \"He discriminates against himself.\""},{"incorrect":"✗ She suffered from discrimination because of her self-discrimination.","correct":"✓ She suffered from discrimination, which led to self-discrimination.","note":"The first part of the sentence implies external discrimination, which then results in internalized self-discrimination. The original sentence suggests she was discriminated against *because* she was self-discriminating, which is less common."}],"priority":"★★☆"},"related_words":{"derivatives":["discriminate","discrimination","self","self-esteem","self-worth"],"antonyms":["self-acceptance","self-love","self-compassion","self-affirmation"],"related_concepts":["internalized oppression","internalized racism","self-sabotage","negative self-talk","imposter syndrome"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"\"Self-discrimination\" is a complex term referring to the act of treating oneself unfairly due to internalized negative beliefs. It's often linked to societal biases and can manifest as self-sabotage or negative self-talk. Understanding it requires grasping concepts like internalized oppression and the impact of societal prejudices on self-perception. The term is more commonly encountered in academic or sociological contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Her feelings of inadequacy led to self-discrimination in her career choices.","translation":"彼女の不十分さの感情は、キャリアの選択における自己差別に繋がった。","type":"general","meaning_category":"General"},{"sentence":"The study examined the effects of internalized racism and self-discrimination within the community.","translation":"その研究は、地域社会における内面化された人種差別と自己差別の影響を調査した。","type":"academic","meaning_category":"Academic"},{"sentence":"Overcoming self-discrimination requires self-awareness and self-compassion.","translation":"自己差別を克服するには、自己認識と自己憐憫が必要だ。","type":"advice","meaning_category":"Advice"},{"sentence":"He realized that his constant self-criticism was a form of self-discrimination.","translation":"彼は、絶え間ない自己批判が自己差別の一形態であることに気づいた。","type":"personal","meaning_category":"Personal"}]}