{"word":"rectilinearness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"直線であること、直線性","english_definition":"The quality or state of being rectilinear; the property of being characterized by straight lines.","examples":[{"sentence":"The rectilinearness of the design gave it a modern, minimalist feel.","translation":"そのデザインの直線性が、モダンでミニマリストな雰囲気を与えた。"},{"sentence":"He valued the rectilinearness of the city's grid layout.","translation":"彼はその都市のグリッド状のレイアウトの直線性を評価した。"},{"sentence":"The artist emphasized the rectilinearness of the architecture in his painting.","translation":"その画家は、絵画の中で建築物の直線性を強調した。"}],"collocations":["high rectilinearness","perfect rectilinearness","emphasize rectilinearness","preserve rectilinearness"],"synonyms":["straightness","linearity","directness","alignment","regularity"],"antonyms":["curvilinearity","roundness","irregularity","nonlinearity"]}],"etymology":{"value":"Derived from 'rectilinear' (formed from Latin 'rectus' meaning 'straight' and 'linea' meaning 'line') + '-ness' (suffix indicating a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛktɪˈlɪniərnəs/","syllables":"rec-ti-lin-e-ar-ness"},"inflection":{"noun_plural":"rectilinearnesses (rarely used)"},"usage_notes":{"explanation":"'Rectilinearness' is a relatively uncommon noun that describes the degree to which something is composed of or characterized by straight lines. It is often used in contexts related to design, architecture, mathematics, and physics. It emphasizes the quality of being straight and composed of straight lines, rather than curves or other shapes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rectilinearness was very curve.","correct":"✓ The rectilinearness was very high.","note":"'Rectilinearness' refers to straightness, so it cannot be 'curve'. Use terms like 'high' or 'low' to describe the degree of rectilinearness."},{"incorrect":"✗ He measured the rectilinearness with a protractor.","correct":"✓ He measured the rectilinearness with a ruler or straightedge.","note":"A protractor measures angles, while a ruler or straightedge is used to assess straightness."}],"priority":"★☆☆"},"related_words":{"derivatives":["rectilinear (adjective: contained by, consisting of, or moving in straight lines)","rectilineal (adjective: same as rectilinear - less common)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rectilinearness' is a technical term that describes how much something is made of straight lines rather than curves. It's used in fields like architecture or design to talk about the straightness of shapes. It's not a common word, so you'll mostly find it in specialized or technical writing."},"example_sentences":[{"sentence":"The architect aimed for perfect rectilinearness in the building's facade.","translation":"建築家は、建物のファサードで完璧な直線性を目指した。","type":"general","meaning_category":"直線であること"},{"sentence":"The software corrected for any deviation from rectilinearness in the image.","translation":"そのソフトウェアは、画像の直線からのずれを修正した。","type":"technical","meaning_category":"直線性"},{"sentence":"The high rectilinearness of the laser beam is essential for precise measurements.","translation":"レーザービームの高い直線性は、精密な測定に不可欠である。","type":"scientific","meaning_category":"直線性"}]}