{"word":"Churchill","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"チャーチル（姓）: イギリスの著名な政治家、特にウィンストン・チャーチルを指す","english_definition":"A surname, most notably associated with Winston Churchill, a prominent British statesman.","examples":[{"sentence":"Winston Churchill was a significant figure in British history.","translation":"ウィンストン・チャーチルはイギリスの歴史において重要な人物でした。"},{"sentence":"The Churchill family has a long history in British politics.","translation":"チャーチル家はイギリス政治において長い歴史を持っています。"}],"collocations":["Winston Churchill","The Churchill War Rooms","Churchill's speeches","Churchill's leadership"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"チャーチル（地名）: カナダのマニトバ州にある町","english_definition":"A town in Manitoba, Canada, known for its polar bear population and beluga whale watching.","examples":[{"sentence":"Churchill is a popular destination for wildlife enthusiasts.","translation":"チャーチルは野生動物愛好家にとって人気の目的地です。"},{"sentence":"You can see polar bears in their natural habitat near Churchill.","translation":"チャーチルの近くでは、ホッキョクグマが自然の生息地で見られます。"}],"collocations":["Churchill, Manitoba","Polar bears in Churchill","Beluga whales in Churchill","Churchill River"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The surname Churchill is of English origin, derived from a place name meaning 'church on a hill'. The town in Manitoba is named after John Churchill, 1st Duke of Marlborough.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃɜːrtʃɪl/","syllables":"Church-hill"},"inflection":{"notes":"As a proper noun, it doesn't typically inflect. The plural form 'Churchills' can refer to multiple people with the Churchill surname or multiple instances of the place.","noun_plural":"Churchills"},"usage_notes":{"explanation":"'Churchill' primarily refers to Winston Churchill, the British Prime Minister during World War II. It can also refer to the town in Manitoba, Canada, famous for its polar bear watching. Context is crucial to determine the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I visited Churchhill to see the polar bears.","correct":"✓ I visited Churchill to see the polar bears.","note":"Correct spelling is crucial for proper nouns."},{"incorrect":"✗ Churchill was a president of England.","correct":"✓ Churchill was a Prime Minister of the United Kingdom.","note":"Winston Churchill was a Prime Minister, not a president, and he led the United Kingdom, not just England."}],"priority":"★★☆"},"related_words":{"derivatives":["Churchillian (adjective: relating to Winston Churchill or his policies)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (due to historical and geographical context)","frequency_google_ngram":"Relatively high, especially in historical or political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Churchill' is a proper noun that most commonly refers to Winston Churchill, a famous British leader during World War II. It can also refer to a town in Canada known for its polar bears. When you see 'Churchill', think about whether the context is about history/politics or about wildlife/geography to understand which meaning is intended."},"example_sentences":[{"sentence":"**Churchill** led Britain through World War II.","translation":"チャーチルは第二次世界大戦中、イギリスを率いました。","type":"noun (surname)","meaning_category":"British statesman"},{"sentence":"We took a tour in **Churchill** to see the polar bears.","translation":"ホッキョクグマを見るためにチャーチルでツアーに参加しました。","type":"noun (place name)","meaning_category":"Town in Manitoba"},{"sentence":"The **Churchillian** spirit of resilience inspired the nation.","translation":"チャーチル的な不屈の精神が国民を鼓舞しました。","type":"adjective","meaning_category":"Relating to Winston Churchill"}]}