{"word":"post-petroleum","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"脱石油の、石油後の","english_definition":"Relating to a time or society in which petroleum is no longer the dominant energy source or a major economic factor.","examples":[{"sentence":"The transition to a post-petroleum economy will require significant investment in renewable energy.","translation":"脱石油経済への移行には、再生可能エネルギーへの多大な投資が必要となるでしょう。"},{"sentence":"Many believe that a post-petroleum world is essential for mitigating climate change.","translation":"多くの人々は、気候変動を緩和するためには、脱石油の世界が不可欠だと信じています。"},{"sentence":"The post-petroleum era presents both challenges and opportunities for innovation.","translation":"脱石油時代は、革新にとっての課題と機会の両方をもたらします。"}],"collocations":["post-petroleum economy","post-petroleum society","post-petroleum world","transition to post-petroleum"],"synonyms":["beyond oil","after oil","non-petroleum"],"antonyms":["petroleum-based","oil-dependent"]}],"etymology":{"value":"'Post-' (after) + 'petroleum' (oil). Indicates a period or state following the dominance or heavy reliance on petroleum.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpoʊst pəˈtroʊliəm/","syllables":"post-pe-tro-le-um"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Post-petroleum' refers to a future or hypothetical state where petroleum is no longer a primary energy source or a significant economic driver. It's often used in discussions about sustainability, renewable energy, and the future of the global economy. The term implies a shift away from reliance on fossil fuels due to environmental concerns, resource depletion, or technological advancements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ post petroleum era","correct":"✓ post-petroleum era","note":"The hyphen is important to connect 'post' as a prefix to 'petroleum'."},{"incorrect":"✗ post-petroleums future","correct":"✓ post-petroleum future","note":"'Post-petroleum' functions as an adjective modifying the noun."}],"priority":"★★☆"},"related_words":{"derivatives":["post-carbon","renewable energy","sustainable energy","alternative energy"],"phrases":["peak oil","energy transition","green economy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency but increasing in recent years.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Post-petroleum' is a term used in discussions about the future of energy and the economy. It describes a time when oil is no longer the main source of energy. This term is often used in the context of climate change, sustainability, and the development of renewable energy sources. Understanding this term requires knowledge of global energy issues and environmental concerns."},"example_sentences":[{"sentence":"The government is investing heavily in research and development for a **post-petroleum** transportation system.","translation":"政府は脱石油の輸送システムの研究開発に多額の投資を行っています。","type":"adjective","meaning_category":"脱石油の"},{"sentence":"A **post-petroleum** society will require a fundamental shift in our consumption habits.","translation":"脱石油社会は、私たちの消費習慣の根本的な変化を必要とするでしょう。","type":"adjective","meaning_category":"脱石油の"},{"sentence":"The development of solar and wind power is crucial for a successful transition to a **post-petroleum** world.","translation":"太陽光発電と風力発電の開発は、脱石油世界への移行を成功させるために不可欠です。","type":"adjective","meaning_category":"脱石油の"}]}