{"word":"Tamazight","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"タマジクト語（ベルベル語の一種）","english_definition":"A group of related Berber languages spoken in Morocco and Algeria. It can also refer to the Berber language in general.","examples":[{"sentence":"He speaks Tamazight fluently.","translation":"彼はタマジクト語を流暢に話します。"},{"sentence":"Tamazight is an official language of Morocco.","translation":"タマジクト語はモロッコの公用語です。"}],"collocations":["speak Tamazight","learn Tamazight","Tamazight language","official Tamazight"],"synonyms":["Berber","Berber language"],"antonyms":[]},{"part_of_speech":"adjective","definition":"タマジクト語の、ベルベル語の","english_definition":"Relating to the Tamazight language or the Berber people.","examples":[{"sentence":"Tamazight culture is rich and diverse.","translation":"タマジクトの文化は豊かで多様です。"},{"sentence":"The Tamazight people have a long history.","translation":"タマジクトの人々には長い歴史があります。"}],"collocations":["Tamazight culture","Tamazight people","Tamazight music","Tamazight traditions"],"synonyms":["Berber"],"antonyms":[]}],"etymology":{"value":"The word Tamazight is derived from the Berber root 'mazigh', meaning 'free man' or 'noble'. It is the endonym used by many Berber people to refer to their language and culture.","priority":"★★★"},"pronunciation":{"ipa":"/ˌtæməˈziːt/","syllables":"Ta-ma-zight"},"inflection":{"notes":"Tamazight is both a noun and an adjective, so inflection is not applicable."},"usage_notes":{"explanation":"'Tamazight' can refer to a specific group of Berber languages or to the Berber language in general. It is often used politically and culturally to assert Berber identity and rights. While 'Berber' is a more widely known term in English, 'Tamazight' is preferred by many Berber speakers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I speak Berber, but I don't speak Tamazight.","correct":"✓ I speak Tamazight. (If referring to a Berber language)","note":"Tamazight is a type of Berber language, so saying you speak Berber implies you might speak Tamazight. If you speak a different Berber language, specify it."}],"priority":"★★☆"},"related_words":{"derivatives":["Amazigh (noun: a Berber person)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tamazight' is a term primarily used in academic or cultural contexts when discussing Berber languages and culture. It's important to understand that while 'Berber' is a more common term in English, 'Tamazight' is often preferred by Berber speakers themselves. The term carries cultural and political significance related to Berber identity. Understanding its usage requires some familiarity with the sociolinguistics of North Africa."},"example_sentences":[{"sentence":"The university offers courses in Tamazight language and literature.","translation":"その大学ではタマジクト語と文学の講座を提供しています。","type":"noun","meaning_category":"Language"},{"sentence":"She is a Tamazight activist fighting for cultural rights.","translation":"彼女は文化的な権利のために戦うタマジクトの活動家です。","type":"adjective","meaning_category":"Relating to Berber people"},{"sentence":"The film was made in Tamazight with subtitles in French and English.","translation":"その映画はタマジクト語で作られ、フランス語と英語の字幕が付いています。","type":"noun","meaning_category":"Language"}]}