{"word":"uncoverable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"覆い隠すことができない、隠蔽できない、暴露可能な","english_definition":"Not able to be covered; impossible to conceal or hide; capable of being exposed.","examples":[{"sentence":"The truth about the scandal was uncoverable, no matter how hard they tried to suppress it.","translation":"スキャンダルの真相は、彼らがどんなに隠蔽しようとしても、覆い隠すことができなかった。"},{"sentence":"Some secrets are simply uncoverable, lost to time or buried too deeply.","translation":"いくつかの秘密は、時の流れの中で失われたり、深くに埋もれてしまったりして、どうやっても暴露できない。"},{"sentence":"The evidence was so strong that the crime was uncoverable.","translation":"証拠が非常に強力だったため、犯罪を隠蔽することは不可能だった。"}],"collocations":["uncoverable truth (隠蔽できない真実)","uncoverable secret (隠せない秘密)","uncoverable crime (隠蔽できない犯罪)","uncoverable evidence (隠蔽できない証拠)"],"synonyms":["inescapable","inevitable","unavoidable","unconcealable","unsuppressible","uncoverable"],"antonyms":["coverable","concealable","suppressible","hidden","veiled","obscured"]}],"etymology":{"value":"The word 'uncoverable' is formed by adding the prefix 'un-' (meaning 'not') to the word 'coverable'. 'Coverable' itself is derived from the verb 'cover' with the suffix '-able' (meaning 'capable of being'). Therefore, 'uncoverable' literally means 'not capable of being covered'.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈkʌvərəbəl/","syllables":"un-cov-er-a-ble"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs (e.g., 'completely uncoverable') and can be used in comparative and superlative forms (though these are less common: 'more uncoverable', 'most uncoverable')."},"usage_notes":{"explanation":"'Uncoverable' is typically used to describe information, facts, truths, or situations that cannot be hidden or suppressed, and are likely to be revealed or exposed. It often implies a sense of inevitability or certainty that the concealed matter will come to light. It is stronger than 'difficult to cover' and suggests an inherent quality that prevents concealment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The furniture was uncoverable because it was too large.","correct":"✓ The furniture was un-coverable because it was too large.","note":"The intended meaning was that the furniture could not be covered with a cloth or sheet. In this case, use 'un-coverable' (meaning 'not able to be covered'). 'Uncoverable' implies something that cannot be concealed or hidden in a more abstract sense."},{"incorrect":"✗ The detective found the uncoverable clues.","correct":"✓ The detective found the clues that were uncoverable. / ✓ The detective uncovered the clues.","note":"'Uncoverable' describes the nature of something that cannot be hidden, not something that is being found. To describe the act of finding something hidden, use the verb 'uncover'."}],"priority":"★★☆"},"related_words":{"derivatives":["uncover (verb: to reveal, expose)","uncovering (noun: the act of revealing)","coverable (adjective: able to be covered)","covered (adjective: having a covering)"],"phrases":["the uncoverable truth (隠せない真実)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - This is a relatively uncommon word, used in specific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Uncoverable' is an adjective that means something cannot be hidden or concealed. It is used in situations where the truth or evidence is so strong that it will inevitably be revealed, despite efforts to keep it secret. This word is not commonly used in everyday conversation and is more likely to appear in formal writing or discussions about legal, ethical, or investigative matters. It is important to distinguish it from the literal sense of 'not able to be covered' (e.g., with a cloth), which would be expressed as 'un-coverable' (with a hyphen)."},"example_sentences":[{"sentence":"The details of the company's financial fraud were ultimately uncoverable.","translation":"その会社の金融詐欺の詳細は、最終的には隠蔽することができなかった。","type":"adjective","meaning_category":"unable to be concealed"},{"sentence":"Despite their best efforts, the evidence of his guilt was uncoverable.","translation":"彼らの最善の努力にもかかわらず、彼の有罪の証拠は隠蔽できなかった。","type":"adjective","meaning_category":"impossible to hide"},{"sentence":"The historical records made the true story uncoverable.","translation":"歴史的記録によって、真実の物語は隠蔽不可能になった。","type":"adjective","meaning_category":"certain to be revealed"},{"sentence":"The depth of his corruption made his actions uncoverable in the long run.","translation":"彼の腐敗の深さは、長期的には彼の行動を隠蔽不可能にした。","type":"adjective","meaning_category":"destined to be exposed"}]}