{"word":"deinstitutionalization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"脱施設化、施設解消","english_definition":"The process of releasing institutionalized individuals (such as psychiatric patients) from an institution for placement and care in the community.","examples":[{"sentence":"Deinstitutionalization aimed to integrate mentally ill individuals back into society.","translation":"脱施設化は、精神疾患を持つ人々を社会に統合することを目的としていました。"},{"sentence":"The deinstitutionalization movement led to the closure of many large mental hospitals.","translation":"脱施設化運動は、多くの大規模な精神病院の閉鎖につながりました。"},{"sentence":"Critics argue that deinstitutionalization has resulted in increased homelessness among the mentally ill.","translation":"批判者たちは、脱施設化が精神疾患を持つ人々のホームレス増加につながったと主張しています。"}],"collocations":["mental health deinstitutionalization","deinstitutionalization policy","effects of deinstitutionalization","deinstitutionalization movement"],"synonyms":["community placement","community care","normalization"],"antonyms":["institutionalization","commitment","confinement"]},{"part_of_speech":"noun","definition":"(より広義に) 組織や制度からの解放、依存からの脱却","english_definition":"(More broadly) The process of removing something from an established institution or system.","examples":[{"sentence":"The deinstitutionalization of education could involve more homeschooling and online learning.","translation":"教育の脱施設化は、より多くのホームスクーリングやオンライン学習を含む可能性があります。"},{"sentence":"Some advocate for the deinstitutionalization of marriage.","translation":"結婚制度からの脱却を唱える人もいます。"}],"collocations":[],"synonyms":["deregulation","privatization","liberalization"],"antonyms":["regulation","institutionalization"]}],"etymology":{"value":"Formed from 'de-' (reversal or removal) + 'institutionalization' (the process of establishing or maintaining within an institution).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːɪnˌstɪtuːʃənəlɪˈzeɪʃən/","syllables":"de-in-sti-tu-tion-al-i-za-tion"},"inflection":{"noun_plural":"deinstitutionalizations"},"usage_notes":{"explanation":"Deinstitutionalization primarily refers to the shift away from long-term inpatient care in mental hospitals to community-based services. It is often discussed in the context of mental health policy and its consequences, such as the availability of adequate community support and the potential for homelessness. The term can also be used more broadly to describe the removal of something from a traditional institutional setting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The deinstitutionalization was a success for all patients.","correct":"✓ Deinstitutionalization was intended to be a success for all patients, but it had mixed results.","note":"Deinstitutionalization is a complex issue with both positive and negative outcomes. It's important to avoid generalizations about its success or failure. "},{"incorrect":"✗ Deinstitutionalization means putting everyone in an institution.","correct":"✓ Deinstitutionalization means releasing people from institutions.","note":"Deinstitutionalization is the opposite of institutionalization."}],"priority":"★★☆"},"related_words":{"derivatives":["deinstitutionalize (verb)","institutionalization (noun)","institution (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency. Primarily used in academic and policy discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deinstitutionalization' is a complex term primarily used in the context of mental health and social policy. It refers to the process of moving individuals out of long-term institutional care (like mental hospitals) and into community-based services and support. Understanding this term requires familiarity with the history of mental health treatment and the debates surrounding community care. It can also be used more broadly to describe removing something from a traditional institutional setting, but this usage is less common."},"example_sentences":[{"sentence":"The **deinstitutionalization** of mental health care has had a profound impact on society.","translation":"精神医療の脱施設化は社会に大きな影響を与えてきました。","type":"noun","meaning_category":"脱施設化 (精神医療)"},{"sentence":"The **deinstitutionalization** process requires careful planning and adequate resources.","translation":"脱施設化のプロセスには、慎重な計画と十分な資源が必要です。","type":"noun","meaning_category":"脱施設化 (一般的なプロセス)"},{"sentence":"Many argue that **deinstitutionalization** has not been fully successful due to a lack of community support.","translation":"地域社会のサポート不足のため、脱施設化は完全には成功していないと多くの人が主張しています。","type":"noun","meaning_category":"脱施設化 (批判的視点)"}]}