{"word":"miraculist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"奇跡を行う人、奇跡論者","english_definition":"A person who performs miracles, or claims to be able to do so; a believer in miracles.","examples":[{"sentence":"The townspeople regarded him as a miraculist, attributing many unexplained events to his powers.","translation":"町の人々は彼を奇跡を行う人とみなし、多くの説明のつかない出来事を彼の力によるものだと考えた。"},{"sentence":"Skeptics often challenge the claims of miraculists, demanding proof of their abilities.","translation":"懐疑論者はしばしば奇跡論者の主張に異議を唱え、彼らの能力の証拠を要求する。"}],"collocations":["a traveling miraculist (旅回りの奇跡論者)","a self-proclaimed miraculist (自称奇跡論者)","a modern miraculist (現代の奇跡論者)"],"synonyms":["wonder-worker","thaumaturge","magician","healer"],"antonyms":["skeptic","disbeliever","rationalist"]}],"etymology":{"value":"From 'miracle' + '-ist'. 'Miracle' comes from Latin 'miraculum' (a wonder, marvel), from 'mirari' (to wonder). The suffix '-ist' denotes a person who practices or believes in something.","priority":"★★☆"},"pronunciation":{"ipa":"/mɪˈrækjʊlɪst/","syllables":"mi-rac-u-list"},"inflection":{"noun_plural":"miraculists"},"usage_notes":{"explanation":"The term 'miraculist' is often used with a degree of skepticism or irony, especially when referring to someone who claims to perform miracles. It can also refer to someone who strongly believes in the possibility of miracles, even if they do not claim to perform them themselves. The word is relatively uncommon in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a miraculist person.","correct":"✓ He is a miraculist.","note":"'Miraculist' is a noun, referring to a person. It does not function as an adjective to describe a person."},{"incorrect":"✗ The miraculist healed with magic.","correct":"✓ The miraculist healed through prayer. / ✓ The miraculist claimed to heal with magic.","note":"While miraculists are associated with supernatural abilities, specifying the method of their miracles (e.g., magic) depends on the specific context and claims being made. It's more common to associate them with prayer, faith, or divine intervention."}],"priority":"★★☆"},"related_words":{"derivatives":["miracle (noun: 奇跡)","miraculous (adjective: 奇跡的な)","miraculously (adverb: 奇跡的に)"],"related_concepts":["faith healing (信仰療法)","divine intervention (神の介入)","supernatural (超自然的な)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - not commonly used in everyday conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'miraculist' is a relatively uncommon and sophisticated term. It refers to someone who either performs miracles or strongly believes in them. Because the concept of miracles is often associated with religious or supernatural beliefs, the term is most likely to appear in discussions about religion, history, or skeptical investigations of paranormal claims. Understanding the word requires familiarity with the concept of miracles and the suffix '-ist,' which indicates a person who practices or believes in something."},"example_sentences":[{"sentence":"The villagers hoped the traveling miraculist could heal their sick child.","translation":"村人たちは、旅回りの奇跡論者が病気の子供を治してくれることを願った。","type":"noun","meaning_category":"奇跡を行う人"},{"sentence":"Many questioned whether the so-called miraculist was truly capable of supernatural feats.","translation":"多くの人々は、いわゆる奇跡論者が本当に超自然的な偉業を成し遂げることができるのか疑問に思った。","type":"noun","meaning_category":"奇跡を行う人"},{"sentence":"The book explored the lives of various miraculists throughout history and their impact on society.","translation":"その本は、歴史上の様々な奇跡論者の生涯と、彼らが社会に与えた影響を探求した。","type":"noun","meaning_category":"奇跡論者"}]}