{"word":"microradiography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"微小ラジオグラフィー、微細X線写真法","english_definition":"A technique for producing radiographs of very small objects or small areas of larger objects, typically using soft X-rays and requiring magnification to view the image.","examples":[{"sentence":"Microradiography is used to study the microstructure of bone.","translation":"微小ラジオグラフィーは骨の微細構造を研究するために用いられる。"},{"sentence":"The microradiography analysis revealed the presence of microcracks in the material.","translation":"微小ラジオグラフィー分析により、材料中の微小な亀裂の存在が明らかになった。"}],"collocations":["X-ray microradiography","quantitative microradiography","contact microradiography"],"synonyms":["microscopic radiography","X-ray microscopy"],"antonyms":[]}],"etymology":{"value":"The term 'microradiography' is derived from 'micro-' (small), 'radio-' (referring to radiation, specifically X-rays), and '-graphy' (a process of recording).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪkroʊˌreɪdiˈɒɡrəfi/","syllables":"mi-cro-ra-di-og-ra-phy"},"inflection":{"noun_plural":"microradiographies"},"usage_notes":{"explanation":"Microradiography is a specialized imaging technique used in materials science, biology, and medicine to examine the fine details of samples that are too small to be seen with the naked eye or conventional radiography. It often involves the use of specialized X-ray sources and detectors to achieve high resolution. The resulting images require magnification for detailed analysis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Microradiography are used for...","correct":"✓ Microradiography is used for...","note":"'Microradiography' is a singular noun referring to a technique, so it takes a singular verb."}],"priority":"★☆☆"},"related_words":{"derivatives":["microradiograph (noun: a microradiography image)","radiography (noun: general term for X-ray imaging)","microscopy (noun: general term for imaging small objects)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Microradiography is a specialized technique used to create detailed images of very small objects or areas using X-rays. It's like taking an X-ray, but on a microscopic scale. Because the objects are so small, the images need to be magnified to be seen properly. This method is used in fields like materials science and biology to study the structure of things at a very fine level of detail.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers used microradiography to examine the internal structure of the insect.","translation":"研究者たちは、昆虫の内部構造を調べるために微小ラジオグラフィーを使用した。","type":"general","meaning_category":"technique"},{"sentence":"High-resolution microradiography provides detailed information about the mineral content of bone.","translation":"高解像度の微小ラジオグラフィーは、骨のミネラル含有量に関する詳細な情報を提供する。","type":"specific","meaning_category":"application"}]}