{"word":"Harveyized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(主にインターネットスラング)（画像、テキストなどが）過剰に加工された、奇妙に歪められた、不気味なほど修正された","english_definition":"(Primarily Internet slang) Excessively processed, strangely distorted, or eerily modified (of images, text, etc.). Often implies a disturbing or unsettling effect.","examples":[{"sentence":"The image was Harveyized beyond recognition, with strange colors and distorted features.","translation":"その画像は、奇妙な色と歪んだ特徴で、認識できないほどハーベイ化されていた。"},{"sentence":"Some corners of the internet are filled with Harveyized memes and unsettling content.","translation":"インターネットの一部の隅には、ハーベイ化されたミームや不安を煽るコンテンツがあふれている。"},{"sentence":"Be careful when searching for certain topics online; you might stumble upon some Harveyized results.","translation":"オンラインで特定のトピックを検索するときは注意してください。ハーベイ化された結果に出くわすかもしれません。"}],"collocations":["Harveyized image","Harveyized meme","Harveyized text","deep-fried meme (類似の概念)"],"synonyms":["distorted","warped","altered","modified","processed","deep-fried (meme context)"],"antonyms":["unaltered","unmodified","original","untouched"]}],"etymology":{"value":"この用語は、画像やメディアを過剰に加工・修正することで知られるオンラインユーザー「Harvey」に由来すると考えられています。正確な起源は不明ですが、2010年代後半から2020年代初頭にかけて、特にインターネットミームやオンラインコミュニティで広まりました。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈhɑːrviˌaɪzd/","syllables":"Har-vey-ized"},"inflection":{"notes":"形容詞であり、比較級や最上級は通常ありません。"},"usage_notes":{"explanation":"「**Harveyized**」は、主にインターネットスラングとして使用され、画像、テキスト、またはその他のメディアが過剰に加工、修正、または歪められている状態を指します。多くの場合、その結果は奇妙で、不快で、または不気味なものになります。この用語は、特にインターネットミームやオンラインコミュニティで、過剰な加工や歪みを特徴とする特定のスタイルのコンテンツを説明するために使用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was Harveyized by the artist.","correct":"✓ The painting was intentionally distorted by the artist.","note":"「Harveyized」は通常、意図的な芸術的選択というよりは、過剰な加工や歪みを指すインターネットスラングです。よりフォーマルな文脈では、「distorted」や「altered」などの言葉が適切です。"},{"incorrect":"✗ The document was Harveyized to protect sensitive information.","correct":"✓ The document was redacted to protect sensitive information.","note":"機密情報を保護するために文書を修正する場合は、「redacted」という用語がより適切です。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["deep-fried meme (過剰に加工されたミームの一種)","shitpost (意図的に質の低いコンテンツ)","surreal meme (非現実的なミーム)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (インターネットスラング)","frequency_google_ngram":"低頻度 (Low frequency) - 主にインターネットコミュニティで使用されるスラング。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「**Harveyized**」は、主にインターネットスラングとして使われるため、一般的な英語の語彙には含まれていません。この言葉は、画像やテキストなどのコンテンツが過剰に加工され、歪められている状態を表し、しばしば不気味さや不快感を伴います。インターネットミームや特定のオンラインコミュニティに慣れていない人にとっては理解が難しいかもしれません。この言葉は、過剰な加工や修正によってコンテンツの元の形が大きく変わってしまった状態を強調する際に使われます。"},"example_sentences":[{"sentence":"The photograph had been so heavily edited that it looked completely **Harveyized**.","translation":"その写真は非常に強く編集されていたため、完全にハーベイ化されたように見えた。","type":"adjective","meaning_category":"過剰に加工された"},{"sentence":"Many modern memes are intentionally **Harveyized** to create a surreal and unsettling effect.","translation":"現代のミームの多くは、シュールで不安な効果を生み出すために意図的にハーベイ化されている。","type":"adjective","meaning_category":"奇妙に歪められた"},{"sentence":"The **Harveyized** version of the famous painting was both disturbing and strangely fascinating.","translation":"その有名な絵画のハーベイ化されたバージョンは、不気味でありながら奇妙に魅力的だった。","type":"adjective","meaning_category":"不気味なほど修正された"}]}