{"word":"Contraindication","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(医学)禁忌：特定の治療法や薬の使用が患者にとって有害であるか、効果がない可能性が高い状態。","english_definition":"(medicine) a condition or factor that serves as a reason to withhold a certain medical treatment due to the harm that it would cause the patient.","examples":[{"sentence":"Pregnancy is a contraindication for this medication.","translation":"妊娠はこの薬の禁忌です。"},{"sentence":"Allergies are important contraindications to consider before prescribing antibiotics.","translation":"抗生物質を処方する前に、アレルギーは考慮すべき重要な禁忌です。"},{"sentence":"The doctor checked for any contraindications before administering the vaccine.","translation":"医師はワクチンを投与する前に、禁忌がないか確認しました。"}],"collocations":["absolute contraindication (絶対的禁忌)","relative contraindication (相対的禁忌)","contraindication for use (使用禁忌)","check for contraindications (禁忌を確認する)"],"synonyms":["prohibition","restriction","inadvisability","warning"],"antonyms":["indication","recommendation","approval"]}],"etymology":{"value":"\"Contraindication\"は、ラテン語の\"contra-\"（反対の、対抗する）と\"indication\"（兆候、指示）から派生しています。これは、特定の治療法が適切でないことを示す兆候または状態を意味します。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒntrəɪndɪˈkeɪʃən/","syllables":"con-tra-in-di-ca-tion"},"inflection":{"noun_plural":"contraindications"},"usage_notes":{"explanation":"\"Contraindication\"は、医療の文脈で非常に重要な用語です。これは、特定の治療法、薬、または処置が患者に利益をもたらすよりも害を及ぼす可能性が高い状況を指します。禁忌は、絶対的（その治療法を絶対に避けるべき）または相対的（慎重に使用すべき）である場合があります。医療従事者は、治療を開始する前に患者の病歴、アレルギー、および既存の病状を評価し、禁忌がないか確認する必要があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor ignored the contraindication and prescribed the drug anyway.","correct":"✓ The doctor ignored the contraindication and prescribed the drug anyway. (This sentence is grammatically correct, but ethically questionable.)","note":"この文は文法的には正しいですが、禁忌を無視して薬を処方することは医療過誤につながる可能性があります。"},{"incorrect":"✗ The patient had a contraindication with the surgery.","correct":"✓ The patient had a contraindication to the surgery.","note":"手術に対する禁忌がある場合は、\"contraindication to\"を使用します。"},{"incorrect":"✗ The contraindication was obvious, but the nurse missed it.","correct":"✓ The contraindication was obvious, but the nurse missed it. (This sentence is grammatically correct, but highlights a serious error.)","note":"この文は文法的に正しいですが、禁忌を見逃すことは患者の安全を脅かす可能性があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["contraindicated (形容詞: 禁忌である)"],"phrases":["relative contraindication (相対的禁忌)","absolute contraindication (絶対的禁忌)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低い頻度 (Relatively low frequency) - 医学や薬学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Contraindication\"は、医学的な状況で使用される専門用語であり、特定の治療法や薬の使用が患者にとって不適切または有害である理由を指します。これは、患者の病歴、アレルギー、または現在の健康状態に関連する可能性があります。医療従事者は、治療を開始する前に禁忌を慎重に評価する必要があります。この用語は、一般的な会話ではあまり使用されませんが、医療分野では非常に重要です。"},"example_sentences":[{"sentence":"A history of liver disease is a contraindication for the use of this drug.","translation":"肝疾患の病歴は、この薬の使用に対する禁忌です。","type":"noun","meaning_category":"禁忌"},{"sentence":"The doctor carefully reviewed the patient's chart to identify any potential contraindications.","translation":"医師は潜在的な禁忌を特定するために、患者のカルテを注意深く見直しました。","type":"noun","meaning_category":"禁忌"},{"sentence":"The medication is contraindicated in patients with kidney failure.","translation":"この薬は腎不全の患者には禁忌です。","type":"adjective (contraindicated)","meaning_category":"禁忌である"}]}