{"word":"Conceptism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"概念主義：哲学において、普遍的な概念は心の中にのみ存在するとする学説。実念論と唯名論の中間に位置する。","english_definition":"(Philosophy) The doctrine that universals exist only as concepts in the mind; a position intermediate between realism and nominalism.","examples":[{"sentence":"Conceptism attempts to reconcile the views of realism and nominalism regarding the existence of universals.","translation":"概念主義は、普遍の存在に関する実念論と唯名論の立場を調和させようと試みる。"},{"sentence":"In conceptism, a universal is a concept formed by the mind from the observation of particular things.","translation":"概念主義において、普遍とは、個々の事物の観察から心が形成する概念である。"}],"collocations":["philosophical conceptism","medieval conceptism"],"synonyms":["conceptualism"],"antonyms":["realism","nominalism"]},{"part_of_speech":"noun","definition":"概念主義：文学や美術において、アイデアや概念を重視し、形式や表現よりも思考を優先する傾向。","english_definition":"(Literature, Art) An emphasis on ideas and concepts, prioritizing thought over form and expression.","examples":[{"sentence":"Conceptism in art often involves the use of text and diagrams to convey the artist's ideas.","translation":"美術における概念主義は、アーティストのアイデアを伝えるために、テキストや図表の使用を伴うことが多い。"},{"sentence":"Some literary critics have identified elements of conceptism in postmodern novels.","translation":"一部の文芸評論家は、ポストモダン小説に概念主義の要素を見出している。"}],"collocations":["artistic conceptism","literary conceptism"],"synonyms":["conceptual art","idea-based art"],"antonyms":["formalism","expressionism"]}],"etymology":{"value":"The term 'conceptism' is derived from the word 'concept,' combined with the suffix '-ism,' indicating a doctrine, principle, or theory.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈsɛptɪzəm/","syllables":"con-cep-tism"},"inflection":{"noun_plural":"conceptisms"},"usage_notes":{"explanation":"'Conceptism' refers to a philosophical doctrine concerning the existence of universals, asserting they exist only as mental concepts. It also describes a tendency in art and literature to prioritize ideas over form. The philosophical usage is more established, while the artistic usage is less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Conceptism believes that universals exist in reality.","correct":"✓ Conceptism believes that universals exist only as concepts in the mind.","note":"Conceptism posits that universals are mental constructs, not real entities. This distinguishes it from realism."},{"incorrect":"✗ Conceptism is the same as conceptual art.","correct":"✓ Conceptism is a philosophical doctrine, while conceptual art is an artistic movement.","note":"While related, conceptism is a broader philosophical term, and conceptual art is a specific artistic movement that emphasizes concepts."}],"priority":"★★☆"},"related_words":{"derivatives":["concept","conceptual","conceptualize","conceptualization","conceptualist"],"related_terms":["realism","nominalism","conceptual art","universal"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Conceptism' is a term primarily used in philosophy and art theory. In philosophy, it describes the view that universal concepts exist only in the mind, mediating between realism (universals exist independently) and nominalism (universals are just names). In art, it refers to prioritizing the idea or concept behind a work over its aesthetic qualities. Understanding requires familiarity with philosophical and art-historical contexts."},"example_sentences":[{"sentence":"Medieval philosophers debated the merits of conceptism as a solution to the problem of universals.","translation":"中世の哲学者たちは、普遍の問題に対する解決策として、概念主義の利点を議論した。","type":"noun","meaning_category":"Philosophy"},{"sentence":"Conceptual art often embodies the principles of conceptism by emphasizing the idea behind the artwork.","translation":"コンセプチュアル・アートは、作品の背後にあるアイデアを重視することで、概念主義の原則を具体化することが多い。","type":"noun","meaning_category":"Art"}]}