{"word":"Bohemia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ボヘミア (歴史的な地域名、現在のチェコ共和国の一部)","english_definition":"A historical region in Central Europe, corresponding to the western two-thirds of the modern Czech Republic.","examples":[{"sentence":"Prague is the capital of Bohemia.","translation":"プラハはボヘミアの首都です。"},{"sentence":"Bohemia was once a kingdom within the Holy Roman Empire.","translation":"ボヘミアはかつて神聖ローマ帝国内の王国でした。"}],"collocations":["Kingdom of Bohemia","Crown of Bohemia","History of Bohemia"],"synonyms":["Czechia (modern equivalent, though not precisely the same)"],"antonyms":[]},{"part_of_speech":"noun","definition":"ボヘミア (社会通念にとらわれない、自由奔放な生き方をする人々、芸術家などの集団)","english_definition":"A community of unconventional people, especially artists and writers, who live and work in a free-spirited way.","examples":[{"sentence":"The artist lived in a bohemian neighborhood.","translation":"その芸術家はボヘミアンな地区に住んでいた。"},{"sentence":"She embraced the bohemian lifestyle.","translation":"彼女はボヘミアンな生き方を受け入れた。"}],"collocations":["Bohemian lifestyle","Bohemian culture","Bohemian artist","Bohemian neighborhood"],"synonyms":["counterculture","avant-garde","artistic community"],"antonyms":["conventional","mainstream"]}],"etymology":{"value":"Derived from the Latin 'Bohemia', which comes from the Boii, a Celtic tribe that inhabited the region in ancient times. The second meaning arose in 19th-century France to describe the Romani people (erroneously believed to have come from Bohemia) and then extended to artists and intellectuals living unconventional lives.","priority":"★★★"},"pronunciation":{"ipa":"/boʊˈhiːmiə/","syllables":"Bo-he-mi-a"},"inflection":{"noun_plural":"Bohemias (less common for the geographical region)"},"usage_notes":{"explanation":"The word 'Bohemia' has two distinct meanings. The first refers to a specific geographical area in Central Europe, now part of the Czech Republic. The second refers to a lifestyle characterized by unconventionality, artistic expression, and freedom from social norms. The second meaning originated from the association of Romani people (who were mistakenly believed to have come from Bohemia) with a nomadic and unconventional way of life.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to Bohemia for vacation, it's a country.","correct":"✓ I'm going to the Czech Republic for vacation. Bohemia is a historical region within the Czech Republic.","note":"Bohemia is a historical region, not a country. The modern country is the Czech Republic (or Czechia)."},{"incorrect":"✗ He lived a very Bohemia life, following all the rules.","correct":"✓ He lived a very bohemian life, rejecting social norms.","note":"The 'bohemian' lifestyle is characterized by rejecting social norms and living an unconventional life."}],"priority":"★★☆"},"related_words":{"derivatives":["bohemian (adjective: relating to Bohemia or to the unconventional lifestyle; noun: a person with an unconventional lifestyle)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (for the historical region), C1 (for the lifestyle)","frequency_google_ngram":"Relatively low frequency, but recognizable.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Bohemia' can refer to a historical region in what is now the Czech Republic, or to a lifestyle that is unconventional and artistic. When talking about the region, it's important to remember it's not a country itself but a part of the Czech Republic. When talking about the lifestyle, 'bohemian' describes people who live freely and often artistically, outside of mainstream society's rules. Make sure to understand the context to know which meaning is intended."},"example_sentences":[{"sentence":"The novels are set in 19th-century Bohemia.","translation":"その小説は19世紀のボヘミアを舞台にしている。","type":"noun","meaning_category":"historical region"},{"sentence":"She dreamed of escaping her suburban life and joining the bohemia of artists in Paris.","translation":"彼女は郊外の生活から抜け出し、パリの芸術家たちのボヘミアに加わることを夢見ていた。","type":"noun","meaning_category":"unconventional lifestyle"},{"sentence":"He is a bohemian artist, living a life of freedom and creativity.","translation":"彼は自由と創造性に満ちた生活を送る、ボヘミアンな芸術家だ。","type":"adjective","meaning_category":"relating to the unconventional lifestyle"}]}