{"word":"PFG","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(abbreviation) Personal Flotation Garment","english_definition":"A garment designed to keep a person afloat in water; a life jacket or buoyancy aid.","examples":[{"sentence":"Make sure everyone on board has a properly fitted PFG.","translation":"乗船している全員が適切にフィットしたPFGを着用していることを確認してください。"},{"sentence":"The regulations require all boaters to carry a PFG for each person on board.","translation":"規則により、すべてのボートに乗る人は、乗船している人ごとにPFGを携帯する必要があります。"}],"collocations":["wear a PFG","life jacket","buoyancy aid"],"synonyms":["life vest","life preserver"],"antonyms":[]}],"etymology":{"value":"Acronym derived from 'Personal Flotation Garment'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌpiːˌɛfˈdʒiː/","syllables":"P-F-G"},"inflection":{},"usage_notes":{"explanation":"PFG is an abbreviation commonly used in boating, water sports, and safety contexts to refer to a personal flotation device. It is a more general term than 'life jacket' and can include various types of buoyancy aids.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a PFD instead of a PFG.","correct":"✓ He wore a PFG.","note":"While PFD (Personal Flotation Device) is a more common and general term, PFG specifically refers to a garment. Using PFD is not necessarily incorrect, but if you want to emphasize that it's a wearable garment, PFG is more accurate."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"B2","text":"PFG stands for Personal Flotation Garment. It's a piece of clothing that helps you float in water. It's often used when boating or doing water sports. It's important to wear one to stay safe in the water. It's similar to a life jacket or life vest. It is a technical term, so it is not commonly used in everyday conversations."},"example_sentences":[{"sentence":"The instructor demonstrated how to properly wear a PFG before the kayaking trip.","translation":"インストラクターは、カヤック旅行の前にPFGを適切に着用する方法を説明しました。","type":"noun","meaning_category":"safety equipment"}]}