{"word":"Tanaquil","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"An Etruscan woman, wife of Tarquinius Priscus, the fifth king of Rome.","english_definition":"A legendary Etruscan woman, the wife of Tarquinius Priscus, the fifth king of Rome. She is known for her prophetic abilities and influence in Roman history.","examples":[{"sentence":"Tanaquil persuaded her husband, Tarquinius Priscus, to move to Rome where he could achieve greater success.","translation":"タナキルは夫のタルクィニウス・プリスクスを説得してローマに移住させ、そこで彼はより大きな成功を収めることができた。"},{"sentence":"According to legend, Tanaquil interpreted an omen that predicted her husband's future kingship.","translation":"伝説によると、タナキルは夫の将来の王位を予言する兆候を解釈した。"}],"collocations":["Tanaquil and Tarquinius Priscus","Roman queens and notable women","Etruscan figures in Roman history"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin *Tanaquil*, from Etruscan. The meaning is uncertain, but it is a traditional Etruscan name.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtænəkwɪl/","syllables":"Ta-na-quil"},"inflection":{},"usage_notes":{"explanation":"Tanaquil is primarily known as a historical and legendary figure in early Roman history. She is often depicted as an ambitious and intelligent woman who played a key role in the rise of her husband to power. Her story is often used to illustrate the influence of Etruscan culture on early Rome.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Tarquinius Priscus (her husband)","Etruria (region of her origin)","Roman monarchy (historical context)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Appears mainly in historical texts or discussions of Roman history.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The name Tanaquil is encountered in historical texts or literature discussing ancient Rome and Etruscan civilization. Understanding the context requires familiarity with Roman history and mythology. The name itself is not commonly used in modern English outside of academic or historical discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"Livy recounts the story of Tanaquil and her husband's ascent to the Roman throne.","translation":"リウィウスは、タナキルとその夫がローマの王位に上り詰める物語を語っている。","type":"historical context","meaning_category":"Roman history"},{"sentence":"Tanaquil's wisdom and foresight were instrumental in Tarquinius Priscus becoming king.","translation":"タナキルの知恵と先見の明は、タルクィニウス・プリスクスが王になる上で重要な役割を果たした。","type":"character trait","meaning_category":"influence"}]}