{"word":"Jovicentrical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having a focus on or relating to the Serbian professional footballer Luka Jović.","english_definition":"Centered on or characterized by an emphasis on Luka Jović.","examples":[{"sentence":"The team's strategy became increasingly Jovicentrical after his arrival.","translation":"彼の加入後、チームの戦略はますますヨヴィッチ中心になっていった。"},{"sentence":"The article provides a Jovicentrical analysis of Real Madrid's attacking options.","translation":"その記事は、レアル・マドリードの攻撃オプションに関するヨヴィッチ中心の分析を提供している。"}],"collocations":["Jovicentrical tactics","Jovicentrical approach","Jovicentrical viewpoint"],"synonyms":["Jović-focused","Jović-centric"],"antonyms":["de-emphasizing Jović","non-Jovicentrical"]}],"etymology":{"value":"Formed by combining \"Jović\" (referring to Luka Jović) with \"-centrical\", indicating a focus or center.","priority":"★★★"},"pronunciation":{"ipa":"/ˌjoʊvɪˈsɛntrɪkəl/","syllables":"Jo-vi-cen-tri-cal"},"inflection":{"adjective_forms":{"comparative":"more Jovicentrical","superlative":"most Jovicentrical"}},"usage_notes":{"explanation":"This term is primarily used in sports commentary, analysis, and fan discussions to describe strategies, viewpoints, or team dynamics that heavily feature or revolve around Luka Jović. It is a niche term, not widely used outside of these contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The universe is Jovicentrical.","correct":"✓ The team's play is Jovicentrical.","note":"Avoid using this term in contexts unrelated to Luka Jović or sports. It is a specialized term. "},{"incorrect":"✗ Jovicentricality is the key to success.","correct":"✓ A Jovicentrical approach may improve the team's chances.","note":"The term is primarily an adjective; related noun forms are uncommon and may sound awkward."}],"priority":"★★☆"},"related_words":{"derivatives":["Jović (noun, referring to the player)"],"related_terms":["centric","-centrical","football","Real Madrid","Serbian football"]},"level_frequency":{"CEFR":"N/A (very specialized term)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Jovicentrical' is a highly specialized adjective used almost exclusively in sports contexts, particularly when discussing football (soccer). It describes something that is focused on or revolves around the player Luka Jović. Due to its niche usage, it is unlikely to be encountered outside of discussions related to Jović or his teams. Understanding requires familiarity with the player and sports analysis terminology."},"example_sentences":[{"sentence":"The coach's decision to play Jović as the main striker led to a more Jovicentrical attacking style.","translation":"監督がヨヴィッチをメインストライカーとして起用することを決定したことで、よりヨヴィッチ中心の攻撃スタイルになった。","type":"adjective","meaning_category":"focus on Luka Jović"},{"sentence":"Some critics argue that the team's Jovicentrical approach limits their tactical flexibility.","translation":"一部の批評家は、チームのヨヴィッチ中心のアプローチは戦術的な柔軟性を制限すると主張している。","type":"adjective","meaning_category":"focus on Luka Jović"}]}