{"word":"LPC","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(computing) Local Procedure Call; (chemistry) Lipid-protein complex; (linguistics) Linear Predictive Coding; (various) other meanings depending on context.","english_definition":"(computing) A mechanism in Windows operating systems for inter-process communication; (chemistry) A complex formed between lipids and proteins; (linguistics) A method used in speech processing and audio compression; (various) Acronym with different meanings depending on the specific field.","examples":[{"sentence":"The client-server application uses LPC for communication.","translation":"そのクライアントサーバーアプリケーションは、通信にLPCを使用しています。"},{"sentence":"The study investigated the role of LPC in cell membranes.","translation":"その研究は、細胞膜におけるLPCの役割を調査しました。"},{"sentence":"LPC is used to compress the audio signal.","translation":"LPCは、オーディオ信号を圧縮するために使用されます。"}],"collocations":["LPC mechanism","LPC communication","LPC analysis","LPC coefficients"],"synonyms":["Inter-Process Communication (IPC)","Lipoprotein","Linear Prediction"],"antonyms":[]},{"part_of_speech":"noun","definition":"Licensed Professional Counselor (US).","english_definition":"A mental health professional licensed to provide counseling services.","examples":[{"sentence":"She is a Licensed Professional Counselor specializing in family therapy.","translation":"彼女は家族療法を専門とする、資格のあるプロのカウンセラーです。"}],"collocations":["LPC license","LPC supervision","Become an LPC"],"synonyms":["Licensed Mental Health Counselor (LMHC)","Licensed Clinical Social Worker (LCSW)"],"antonyms":[]}],"etymology":{"value":"Acronym formed from the initial letters of the words in the full name of each term.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛlˌpiːˈsiː/","syllables":"el-pee-see"},"inflection":{"notes":"Plural: LPCs"},"usage_notes":{"explanation":"LPC is an acronym that can have different meanings depending on the context. It's important to know the field in which it's being used to understand its specific meaning. In computing, it refers to Local Procedure Call; in chemistry, it refers to Lipid-protein complex; and in linguistics, it refers to Linear Predictive Coding. It can also refer to Licensed Professional Counselor in the context of mental health.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used LPC to create a website.","correct":"✓ I used HTML, CSS, and JavaScript to create a website.","note":"LPC is not typically used in website development. It's more related to inter-process communication, chemistry, or speech processing."},{"incorrect":"✗ He is an LPC in computer science.","correct":"✓ He is an expert in computer science.","note":"LPC in the context of counseling is not related to computer science."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_acronyms":["IPC","LMHC","LCSW"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"LPC is an acronym with multiple meanings depending on the context. It can refer to Local Procedure Call in computing, Lipid-protein complex in chemistry, Linear Predictive Coding in linguistics, or Licensed Professional Counselor in mental health. Understanding the context is crucial for interpreting the correct meaning of LPC. Due to its technical nature and varied applications, it is generally encountered in specialized fields.","priority":"★★★"},"example_sentences":[{"sentence":"The performance of the system was improved by optimizing the LPC mechanism.","translation":"LPCメカニズムを最適化することにより、システムのパフォーマンスが向上しました。","type":"noun","meaning_category":"Local Procedure Call"},{"sentence":"The researchers analyzed the structure of the LPC in the sample.","translation":"研究者らは、サンプル中のLPCの構造を分析しました。","type":"noun","meaning_category":"Lipid-protein complex"},{"sentence":"The LPC technique is widely used in speech recognition systems.","translation":"LPC技術は、音声認識システムで広く使用されています。","type":"noun","meaning_category":"Linear Predictive Coding"},{"sentence":"The LPC provided counseling services to individuals and families.","translation":"LPCは、個人や家族にカウンセリングサービスを提供しました。","type":"noun","meaning_category":"Licensed Professional Counselor"}]}