{"word":"actional","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"行為に関する、行動的な、行動を伴う","english_definition":"Relating to actions or behavior; characterized by action or intended to produce action.","examples":[{"sentence":"The therapist used an actional approach to help the patient overcome their fears.","translation":"セラピストは、患者が恐怖を克服するのを助けるために、行動的なアプローチを用いました。"},{"sentence":"The report recommended actional steps to address the environmental issues.","translation":"報告書は、環境問題に対処するための行動を伴う段階を推奨しました。"},{"sentence":"The plan is actional and designed to achieve specific results.","translation":"その計画は行動的であり、特定の結果を達成するように設計されています。"}],"collocations":["actional plan (行動計画)","actional approach (行動的アプローチ)","actional steps (行動段階)","actional research (実践研究)"],"synonyms":["active","practical","pragmatic","behavioral","operative"],"antonyms":["theoretical","passive","inactive","speculative"]}],"etymology":{"value":"Derived from 'action' + '-al'. The suffix '-al' is used to form adjectives relating to the noun.","priority":"★★★"},"pronunciation":{"ipa":"/ˈækʃənəl/","syllables":"ac-tion-al"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms (e.g., more actional, most actional), which are less common for this word."},"usage_notes":{"explanation":"'Actional' is often used in contexts where practical steps or behavioral changes are emphasized, such as in therapy, research, or planning. It suggests a focus on doing rather than just thinking or theorizing. It is less common than 'active' or 'practical' but provides a specific nuance of being related to or prompting action.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The actional movie was very exciting.","correct":"✓ The action movie was very exciting.","note":"'Actional' is not typically used to describe movies or entertainment. Use 'action' as an adjective instead."},{"incorrect":"✗ He is a very actional person.","correct":"✓ He is a very active person.","note":"'Active' is more commonly used to describe a person who is energetic and does many things."}],"priority":"★★☆"},"related_words":{"derivatives":["action (noun)","actionable (adjective)","actionably (adverb)"],"related_terms":["behavioral","practical","pragmatic","operative"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Actional' is a relatively uncommon word, primarily used in specialized or technical contexts. It means 'relating to action' or 'characterized by action'. It is often found in academic or professional writing where a focus on practical steps or behavioral changes is emphasized. Understanding its meaning requires a good command of English vocabulary and the ability to infer meaning from context."},"example_sentences":[{"sentence":"The company needs to develop an actional strategy to improve its market share.","translation":"会社は市場シェアを改善するための行動的な戦略を開発する必要があります。","type":"adjective","meaning_category":"行動に関する"},{"sentence":"The research project aims to provide actional insights for policymakers.","translation":"その研究プロジェクトは、政策立案者に行動的な洞察を提供することを目指しています。","type":"adjective","meaning_category":"行動を伴う"},{"sentence":"The actional component of the training program involves hands-on exercises.","translation":"トレーニングプログラムの行動的な要素には、実践的な演習が含まれています。","type":"adjective","meaning_category":"行動的な"}]}