{"word":"vernacularism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"地方語主義、方言主義、自国語主義","english_definition":"The use of the vernacular; the use of the native language of a country or region, especially in literature; a local idiom or expression.","examples":[{"sentence":"The novel is rich in vernacularism, capturing the authentic voice of the region.","translation":"その小説は地方語主義に富んでおり、その地域の真の声を捉えている。"},{"sentence":"The author's use of vernacularism adds a layer of realism to the dialogue.","translation":"作者の地方語主義の使用は、対話にリアリズムの層を加えている。"}],"collocations":["local vernacularism","literary vernacularism","regional vernacularism"],"synonyms":["dialectalism","localism","regionalism","idiom","colloquialism"],"antonyms":["standard language","formal language","official language"]}],"etymology":{"value":"'Vernacular' + '-ism'. 'Vernacular' comes from the Latin 'vernaculus' meaning 'domestic, native, indigenous'. The suffix '-ism' denotes a principle, practice, or system.","priority":"★★☆"},"pronunciation":{"ipa":"/vərˈnækjʊlərɪzəm/","syllables":"ver-nac-u-lar-ism"},"inflection":{"notes":"Plural: vernacularisms"},"usage_notes":{"explanation":"Vernacularism refers to the use or advocacy of using the vernacular language, which is the native language or dialect of a specific population, especially when it contrasts with a standard or literary language. It can also refer to a specific instance of a vernacular expression or idiom.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The speaker used a lot of vernacularisms, so it was hard to understand his formal language.","correct":"✓ The speaker used a lot of vernacularisms, so it was hard to understand his meaning if you weren't familiar with the local dialect.","note":"Vernacularisms are, by definition, not formal language. The mistake here is the implication that vernacularisms are part of formal language."}],"priority":"★★☆"},"related_words":{"derivatives":["vernacular (noun, adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vernacularism' refers to the practice or principle of using the everyday language of ordinary people in a particular region or country, especially in writing. It's about valuing and incorporating local dialects and expressions rather than using a standard or formal language. This word is more common in academic or literary discussions about language and culture."},"example_sentences":[{"sentence":"The play's success lies in its authentic use of vernacularism, which resonates with the local audience.","translation":"その劇の成功は、地方語主義の本格的な使用にあり、それが地元の観客に共鳴している。","type":"noun","meaning_category":"地方語主義の使用"},{"sentence":"The linguist studied the vernacularism of the Appalachian region.","translation":"言語学者はアパラチア地方の地方語主義を研究した。","type":"noun","meaning_category":"地方語主義の研究"},{"sentence":"The poet's work is characterized by its embrace of vernacularism and rejection of formal literary conventions.","translation":"その詩人の作品は、地方語主義の受け入れと、形式的な文学的慣習の拒絶によって特徴づけられる。","type":"noun","meaning_category":"地方語主義の包含"}]}