{"word":"speech-only","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"音声のみの、音声専用の","english_definition":"Relating to or consisting only of speech, without visual or other sensory elements.","examples":[{"sentence":"The meeting was speech-only due to technical difficulties with the video conferencing system.","translation":"ビデオ会議システムの技術的な問題により、会議は音声のみで行われました。"},{"sentence":"The podcast is speech-only, so you can listen while you're driving.","translation":"このポッドキャストは音声のみなので、運転中に聴くことができます。"},{"sentence":"The presentation was designed to be speech-only, with no slides or visual aids.","translation":"プレゼンテーションは、スライドや視覚補助なしで、音声のみで行われるように設計されました。"}],"collocations":["speech-only communication","speech-only mode","speech-only interface","speech-only application","speech-only service"],"synonyms":["audio-only","voice-only","verbal-only"],"antonyms":["audiovisual","multimedia","visual"],"notes":"Often used to describe a mode or feature of a device or system that restricts input or output to speech."}],"etymology":{"value":"Combination of 'speech' and 'only'.","priority":"N/A"},"pronunciation":{"ipa":"/ˈspiːtʃ ˌoʊnli/","syllables":"speech-on-ly"},"inflection":{"notes":"Does not inflect as it is an adjective."},"usage_notes":{"explanation":"'Speech-only' is used to specify that something involves only spoken words, without any visual or other sensory components. It is often used in the context of technology or communication to describe a mode or feature that limits interaction to voice.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The speech-only is very clear.","correct":"The speech-only audio is very clear.","note":"'Speech-only' is an adjective and needs to modify a noun."}],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Speech-only' is a compound adjective that describes something that is limited to or consists only of spoken words. It is often used in technical contexts to specify a mode or feature that restricts input or output to voice. Understanding its meaning requires knowledge of both 'speech' and 'only' and the ability to combine them to form a new concept."},"example_sentences":[{"sentence":"The app has a speech-only mode for hands-free operation.","translation":"このアプリには、ハンズフリー操作のための音声のみモードがあります。","type":"adjective","meaning_category":"音声のみの"},{"sentence":"The customer service line is speech-only; there is no option for text-based support.","translation":"カスタマーサービスラインは音声のみで、テキストベースのサポートのオプションはありません。","type":"adjective","meaning_category":"音声専用の"}]}