{"word":"non-outsourcable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"外部委託できない、アウトソーシングできない","english_definition":"Not suitable or able to be outsourced; referring to a task, function, or process that cannot be effectively or appropriately delegated to an external provider.","examples":[{"sentence":"Due to the sensitive nature of the data, this task is non-outsourcable.","translation":"データの機密性のために、このタスクは外部委託できません。"},{"sentence":"Core competencies are typically considered non-outsourcable.","translation":"中核となる能力は通常、外部委託できないと考えられています。"},{"sentence":"The CEO emphasized that customer relations are non-outsourcable.","translation":"CEOは、顧客関係は外部委託できないと強調しました。"}],"collocations":["non-outsourcable task","non-outsourcable function","non-outsourcable process","considered non-outsourcable","deemed non-outsourcable"],"synonyms":["in-house","internal","not delegable","non-transferable"],"antonyms":["outsourcable","delegable","transferable"]}],"etymology":{"value":"The word is formed by adding the prefix \"non-\" (meaning \"not\") to the word \"outsourcable\", which itself is derived from \"outsource\" (to contract work out to an external provider) and the suffix \"-able\" (meaning \"capable of being\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈaʊtˌsɔːrsəbəl/","syllables":"non-out-sour-ca-ble"},"inflection":{"notes":"Adjective, no inflection for gender or number."},"usage_notes":{"explanation":"\"**Non-outsourcable**\" is used to describe tasks, functions, or processes within a company or organization that are considered unsuitable or inappropriate to be delegated to an external third-party provider. This is often due to factors such as data sensitivity, strategic importance, or the need for specialized internal expertise. The term implies that maintaining internal control and expertise is essential for these particular activities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This job is non outsource.","correct":"✓ This job is non-outsourcable.","note":"The correct form is \"non-outsourcable\", not \"non outsource\". It's important to include the \"-able\" suffix to indicate capability."},{"incorrect":"✗ The non-outsourcing task.","correct":"✓ The non-outsourcable task.","note":"Similar to the previous mistake, use \"non-outsourcable\" as the adjective to describe the task."}],"priority":"★★☆"},"related_words":{"derivatives":["outsourcable (adjective: 外部委託できる)","outsource (verb: 外部委託する)","outsourcing (noun: 外部委託)"],"related_concepts":["core competency","strategic importance","data security","internal control","vendor management"]},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Low frequency, primarily used in business and management contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"**non-outsourcable**\" is a specialized term primarily used in business and management contexts. It describes tasks or processes that an organization deems unsuitable for outsourcing to external providers, often due to strategic importance, data sensitivity, or the need for specialized internal expertise. Understanding this term requires familiarity with business concepts such as outsourcing, core competencies, and strategic decision-making."},"example_sentences":[{"sentence":"Data analysis involving personal information is often considered a **non-outsourcable** activity due to privacy regulations.","translation":"個人情報を含むデータ分析は、プライバシー規制のため、多くの場合、外部委託できない活動と見なされます。","type":"adjective","meaning_category":"外部委託できない"},{"sentence":"Maintaining the company's brand identity is a **non-outsourcable** responsibility of the marketing team.","translation":"会社のブランドアイデンティティを維持することは、マーケティングチームの外部委託できない責任です。","type":"adjective","meaning_category":"外部委託できない"},{"sentence":"Many companies consider research and development to be a **non-outsourcable** function.","translation":"多くの企業は、研究開発を外部委託できない機能と考えています。","type":"adjective","meaning_category":"外部委託できない"}]}