{"word":"automaticity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自動性、自動化、無意識的な行動","english_definition":"the ability to do things without occupying the mind with the low-level details required, allowing it to be an automatic response pattern or habit. It is usually the result of learning, repetition, and practice.","examples":[{"sentence":"Driving a car requires a high degree of automaticity.","translation":"車の運転には高度な自動性が求められる。"},{"sentence":"Through practice, the skill became an automaticity.","translation":"練習を通して、そのスキルは自動的な行動になった。"},{"sentence":"The automaticity of his movements allowed him to perform the task quickly.","translation":"彼の動きの自動性によって、彼はそのタスクを迅速に実行できた。"}],"collocations":["develop automaticity (自動性を発達させる)","achieve automaticity (自動性を達成する)","high degree of automaticity (高度な自動性)","cognitive automaticity (認知的な自動性)"],"synonyms":["habituation","automatism","muscle memory","procedural memory"],"antonyms":["conscious control","deliberate action","intentionality"]},{"part_of_speech":"noun","definition":"(心理学)意識的な努力をほとんどまたは全く必要としない認知プロセスまたは行動","english_definition":"(psychology) a cognitive process or behavior that requires little or no conscious effort.","examples":[{"sentence":"Automaticity in reading allows for faster comprehension.","translation":"読書における自動性は、より速い理解を可能にする。"},{"sentence":"The Stroop effect demonstrates the interference of automaticity in word recognition.","translation":"ストループ効果は、単語認識における自動性の干渉を示す。"},{"sentence":"Experts often rely on automaticity to perform complex tasks efficiently.","translation":"専門家は、複雑なタスクを効率的に実行するために、自動性に頼ることが多い。"}],"collocations":["cognitive automaticity (認知的な自動性)","reading automaticity (読解の自動性)","motor automaticity (運動の自動性)","develop automaticity (自動性を発達させる)"],"synonyms":["unconscious processing","implicit processing","non-conscious processing"],"antonyms":["controlled processing","conscious processing","effortful processing"]}],"etymology":{"value":"Formed from 'automatic' + '-ity'. 'Automatic' comes from Greek 'automatos' meaning 'self-moving'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːtəməˈtɪsɪti/","syllables":"au-to-ma-tic-i-ty"},"inflection":{"notes":"Plural: automaticities"},"usage_notes":{"explanation":"'Automaticity' refers to the ability to perform tasks with little or no conscious effort. It's often the result of extensive practice and learning. In psychology, it describes cognitive processes that occur without intentional control. It's important to note that while automaticity makes tasks efficient, it can also lead to errors if the situation changes unexpectedly.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a lot of automation in his work.","correct":"✓ He has a lot of automaticity in his work.","note":"'Automation' refers to the use of technology to perform tasks automatically, while 'automaticity' refers to a person's ability to perform tasks without conscious effort. They are related but distinct concepts."},{"incorrect":"✗ She performed the task automatically, showing her automaticity.","correct":"✓ She performed the task automatically, demonstrating her automaticity.","note":"'Automatically' is an adverb describing how something is done, while 'automaticity' is a noun referring to the ability to perform tasks automatically."}],"priority":"★★☆"},"related_words":{"derivatives":["automatic (adjective)","automatically (adverb)","automate (verb)","automation (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mostly used in academic or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Automaticity' is a term used to describe the ability to perform a task or cognitive process without conscious effort. It's often used in psychology and education to explain how skills become ingrained through practice and repetition. The word itself is derived from 'automatic,' meaning self-moving or self-operating. Understanding 'automaticity' helps explain how experts can perform complex tasks seemingly effortlessly, as their brains have developed efficient, automatic pathways for those tasks."},"example_sentences":[{"sentence":"The pianist's **automaticity** allowed him to play complex pieces without conscious thought.","translation":"ピアニストの自動性によって、彼は複雑な曲を意識せずに演奏することができた。","type":"noun","meaning_category":"無意識的な行動"},{"sentence":"Developing **automaticity** in basic math facts is crucial for success in algebra.","translation":"基本的な算数の事実における自動性を発達させることは、代数学で成功するために不可欠である。","type":"noun","meaning_category":"自動化"},{"sentence":"The soldier's **automaticity** in handling his weapon was a result of rigorous training.","translation":"兵士の武器の扱いにおける自動性は、厳しい訓練の結果だった。","type":"noun","meaning_category":"自動性"}]}