{"word":"ungentlewomanlike","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"淑女らしくない、上品でない、女性らしさに欠ける","english_definition":"Not befitting or characteristic of a gentlewoman; lacking in ladylike qualities or behavior; unrefined or unladylike.","examples":[{"sentence":"Her ungentlewomanlike behavior shocked the other guests at the tea party.","translation":"彼女の淑女らしくない振る舞いは、お茶会に来ていた他の客たちを驚かせた。"},{"sentence":"She found his ungentlewomanlike comments to be quite offensive.","translation":"彼女は彼の淑女らしくないコメントを非常に不快に感じた。"},{"sentence":"Despite her rough exterior, she possessed a hidden elegance that belied her ungentlewomanlike appearance.","translation":"彼女は粗野な外見にもかかわらず、淑女らしくない外見とは裏腹に、隠された優雅さを持ち合わせていた。"}],"collocations":["ungentlewomanlike behavior","ungentlewomanlike conduct","ungentlewomanlike manner","ungentlewomanlike remarks","ungentlewomanlike appearance"],"synonyms":["unladylike","unrefined","coarse","vulgar","improper","indecorous"],"antonyms":["ladylike","gentlewomanly","refined","elegant","decorous","proper"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to 'gentlewomanlike', which itself is derived from 'gentlewoman' (a woman of good breeding and social standing) and the suffix '-like' (meaning 'resembling' or 'characteristic of'). Thus, 'ungentlewomanlike' literally means 'not resembling or characteristic of a gentlewoman'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈdʒentəlwʊmənlaɪk/","syllables":"un-gen-tle-wo-man-like"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Ungentlewomanlike' is used to describe behavior, manners, or appearances that are considered inappropriate or unbecoming for a woman of high social standing or refined upbringing. It often implies a lack of grace, elegance, or decorum. The term can sometimes carry a judgmental or class-based connotation, as it relies on traditional notions of femininity and social expectations. It is less commonly used in modern English, as societal norms regarding gender roles have evolved.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She acted very ungentlemanlike.","correct":"✓ She acted very ungentlewomanlike.","note":"The word 'ungentlewomanlike' is specifically used to describe women. For men, the term would be 'ungentlemanly'."},{"incorrect":"✗ Her behavior was ungentlewomanlike, but I admired her.","correct":"✓ Her behavior was ungentlewomanlike, but I admired her spirit.","note":"While 'ungentlewomanlike' describes a lack of traditional feminine qualities, it doesn't necessarily imply a negative moral judgment. The sentence can be improved by clarifying what aspect of her behavior is being admired."}],"priority":"★★☆"},"related_words":{"derivatives":["gentlewoman (noun)","gentlewomanly (adjective)","ungentlemanly (adjective)","unladylike (adjective)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (The word is rare and not typically included in CEFR vocabulary lists.)","frequency_google_ngram":"Very low frequency - The word is not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ungentlewomanlike' is a relatively uncommon and complex word. It is used to describe behavior or characteristics that are considered inappropriate for a woman of high social standing or refined upbringing, according to traditional social norms. Understanding the word requires familiarity with the concept of a 'gentlewoman' and the qualities associated with that role. The word is more likely to be encountered in older literature or historical contexts. Due to its nuanced meaning and infrequent use, it is best suited for advanced learners of English."},"example_sentences":[{"sentence":"Her ungentlewomanlike outburst at the dinner table caused a stir among the guests.","translation":"彼女の夕食の席での淑女らしくない激しい感情の爆発は、客たちの間で騒ぎを引き起こした。","type":"adjective","meaning_category":"淑女らしくない振る舞い"},{"sentence":"The journalist described her as having an ungentlewomanlike disregard for social conventions.","translation":"ジャーナリストは彼女を、社会的な慣習を無視する淑女らしくない人物だと評した。","type":"adjective","meaning_category":"女性らしさに欠ける"},{"sentence":"Despite her ungentlewomanlike attire, she commanded respect with her intelligence and wit.","translation":"彼女は淑女らしくない服装にもかかわらず、知性と機知で尊敬を集めた。","type":"adjective","meaning_category":"上品でない"}]}