{"word":"Chandal","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(Historical, India) A person of mixed-caste parentage, traditionally considered untouchable and associated with menial or unclean occupations.","english_definition":"(Historical, India) A person of mixed-caste parentage, traditionally considered untouchable and associated with menial or unclean occupations.","examples":[{"sentence":"The chandal were relegated to the lowest rungs of society.","translation":"チャンダルは社会の最下層に追いやられていた。"}],"collocations":["untouchable caste","outcaste","Dalit"],"synonyms":["outcaste","untouchable","Dalit"],"antonyms":["Brahmin","Kshatriya","Vaishya","Shudra"]}],"etymology":{"value":"From Sanskrit चाण्डाल (cāṇḍāla), referring to an outcaste group.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃændəl/","syllables":"Chan-dal"},"inflection":{"noun_plural":"Chandals"},"usage_notes":{"explanation":"The term 'Chandal' is historically associated with the Indian caste system and carries significant social stigma. It is generally considered offensive and outdated. More appropriate and respectful terms include 'Dalit' or 'outcaste'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Chandal, so he must be poor.","correct":"✓ The caste system historically oppressed Dalits, leading to poverty.","note":"Avoid making generalizations or stereotypes based on caste. Focus on the historical oppression and its consequences."}],"priority":"★★☆"},"related_words":{"derivatives":["Chandalini (feminine form)"],"phrases":["caste system","untouchability","Dalit"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Chandal' refers to a historical social group in India considered to be of mixed caste and traditionally treated as untouchable. The term is considered offensive and outdated, and it's important to use more respectful terms like 'Dalit' when discussing this community. Understanding the historical and social context is crucial when encountering this word."},"example_sentences":[{"sentence":"The novel depicted the struggles faced by a Chandal family in rural India.","translation":"その小説は、インドの農村部でチャンダルの一家が直面する苦闘を描いていた。","type":"noun","meaning_category":"Historical caste"},{"sentence":"Historically, the Chandal were excluded from many aspects of social life.","translation":"歴史的に、チャンダルは社会生活の多くの側面から排除されていた。","type":"noun","meaning_category":"Historical caste"}]}