{"word":"meaul","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Scottish, obsolete) Meal; ground grain, especially oats.","english_definition":"(Scottish, obsolete) Meal; ground grain, especially oats.","examples":[{"sentence":"The cottar wives are at the meal, / The sowens are all away.","translation":"小作人の妻たちは食事をしており、/ スーエンス（オートミール粥）はすべてなくなった。","note":"This example uses 'meal' in the sense of a dish made from ground grain, which is closely related to the meaning of 'meaul'."}],"collocations":["oat meaul","make meaul","grind meaul"],"synonyms":["meal","flour","grain"],"antonyms":[]}],"etymology":{"value":"A Scottish variant of 'meal'.","priority":"★☆☆"},"pronunciation":{"ipa":"/miːl/","syllables":"meaul (1 syllable)"},"inflection":{"noun_plural":"meauls"},"usage_notes":{"explanation":"'Meaul' is an archaic Scottish term for 'meal', referring to ground grain, particularly oats. It is largely obsolete in modern usage but may be encountered in older Scottish literature or historical contexts. It's important to note that this word is specific to Scottish dialect and is not in common use in standard English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought some meaul to bake a cake.","correct":"✓ I bought some flour to bake a cake. / ✓ I bought some meal to make porridge.","note":"In modern standard English, 'flour' is generally used for baking cakes, while 'meal' might be used for making porridge or other dishes where a coarser texture is desired. 'Meaul' would not be used outside of a specific Scottish context."}],"priority":"★☆☆"},"related_words":{"derivatives":["meal","mealie"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (obsolete)","frequency_google_ngram":"Very low frequency (obsolete)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Meaul' is an archaic Scottish term for 'meal', referring to ground grain. Due to its obsolescence, it is unlikely to be encountered in contemporary texts outside of specific historical or dialectal contexts. Understanding this word requires familiarity with Scottish vocabulary and historical usage."},"example_sentences":[{"sentence":"The old recipe called for fine meaul made from freshly ground oats.","translation":"その古いレシピは、挽きたてのオート麦から作られた上質なミール（粉）を求めていた。","type":"noun","meaning_category":"ground grain"}]}