{"word":"underdrainer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(農業)暗渠排水管敷設機、地下排水工事人","english_definition":"A machine or person involved in laying underdrains (subsurface drains).","examples":[{"sentence":"The farmer hired an underdrainer to improve the field's drainage.","translation":"農家は畑の排水を改善するために暗渠排水工事人を雇った。"},{"sentence":"The underdrainer efficiently installed the drainage pipes.","translation":"暗渠排水管敷設機は効率的に排水管を設置した。"}],"collocations":["hire an underdrainer","use an underdrainer"],"synonyms":["drainage installer","subsurface drainage contractor"],"antonyms":[]}],"etymology":{"value":"The word 'underdrainer' is formed by combining 'underdrain' (a subsurface drain) with the suffix '-er' (denoting a person or thing that performs a specific action).","priority":"★★★"},"pronunciation":{"ipa":"ˌʌndərˈdreɪnər","syllables":"un-der-drain-er"},"inflection":{"noun_plural":"underdrainers"},"usage_notes":{"explanation":"The term 'underdrainer' is relatively specialized, primarily used in agricultural or civil engineering contexts related to water management and land improvement. It refers either to the equipment used for installing subsurface drainage systems or to the individual skilled in operating such equipment and performing the associated tasks.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good underdrain.","correct":"✓ He is a good underdrainer.","note":"'Underdrain' refers to the drain itself, not the person or machine installing it."}],"priority":"★★★"},"related_words":{"derivatives":["underdrain","drainage","drain"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'underdrainer' is a highly specialized term related to agriculture and civil engineering. It refers to either a machine used to install subsurface drainage systems or a person who operates such machinery and performs the installation. Understanding of this term requires familiarity with agricultural practices and water management techniques."},"example_sentences":[{"sentence":"The underdrainer was essential for preventing waterlogging in the field.","translation":"暗渠排水管敷設機は畑の湛水を防ぐために不可欠だった。","type":"noun","meaning_category":"machine"},{"sentence":"Experienced underdrainers are in high demand in regions with heavy rainfall.","translation":"経験豊富な暗渠排水工事人は降雨量の多い地域で需要が高い。","type":"noun","meaning_category":"person"}]}