{"word":"patency","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)開存性、開放性、(管状器官などの)通りが良い状態","english_definition":"The condition of being open and unobstructed, especially of a tube or duct in the body.","examples":[{"sentence":"The surgeon checked the patency of the artery after the bypass.","translation":"外科医はバイパス手術後、動脈の開存性を確認した。"},{"sentence":"Maintaining airway patency is crucial in emergency medicine.","translation":"救急医療において、気道の開存性を維持することは非常に重要である。"},{"sentence":"Poor patency of the Eustachian tube can lead to ear infections.","translation":"耳管の開存性が悪いと、耳の感染症につながる可能性がある。"}],"collocations":["airway patency (気道開存性)","vessel patency (血管開存性)","tube patency (管の開存性)","maintain patency (開存性を維持する)","check patency (開存性を確認する)"],"synonyms":["openness","permeability","perviousness","patent condition","unobstructedness"],"antonyms":["occlusion","obstruction","blockage","stenosis"]}],"etymology":{"value":"Derived from the word 'patent', meaning open or unobstructed, with the suffix '-cy' indicating a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"ˈpeɪtənsi","syllables":"pa-ten-cy"},"inflection":{"noun_plural":"patencies"},"usage_notes":{"explanation":"'Patency' is a technical term primarily used in medical contexts to describe the state of a bodily tube or duct being open and free from obstruction. It is crucial for proper physiological function.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The patency of the idea was obvious to everyone.","correct":"The validity/merit of the idea was obvious to everyone.","note":"'Patency' refers to physical openness, not the obviousness or validity of an idea."},{"incorrect":"The doctor ensured the patient's patency.","correct":"The doctor ensured the patient's airway patency.","note":"'Patency' requires specification of what is open (e.g., airway, vessel)."}],"priority":"★★☆"},"related_words":{"derivatives":["patent (adjective: open, unobstructed; noun: an exclusive right granted for an invention)","patentable (adjective: capable of being patented)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Patency' is a specialized term mainly used in medicine to describe the condition of a bodily tube or duct being open and unobstructed. It is not commonly used in everyday conversation. Understanding this word is important for comprehending medical texts and discussions.","priority":"★★★"},"example_sentences":[{"sentence":"The stent was placed to ensure long-term patency of the coronary artery.","translation":"ステントは冠動脈の長期的な開存性を確保するために留置された。","type":"medical","meaning_category":"openness of a vessel"},{"sentence":"Regular suctioning helps maintain patency of the tracheostomy tube.","translation":"定期的な吸引は、気管切開チューブの開存性を維持するのに役立つ。","type":"medical","meaning_category":"openness of a tube"},{"sentence":"The radiologist assessed the patency of the fallopian tubes using a hysterosalpingogram.","translation":"放射線科医は子宮卵管造影を用いて卵管の開存性を評価した。","type":"medical","meaning_category":"openness of a duct"}]}