{"word":"codpiece","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な)股間当て、男性用下着の一種","english_definition":"A pouch-like addition to men's clothing, covering the genitals, worn especially in the 15th and 16th centuries.","examples":[{"sentence":"The codpiece was a prominent feature of men's fashion during the Renaissance.","translation":"股間当てはルネサンス期における男性ファッションの顕著な特徴だった。"},{"sentence":"Some codpieces were elaborately decorated to emphasize masculinity.","translation":"股間当ての中には、男性らしさを強調するために精巧に装飾されたものもあった。"}],"collocations":["wear a codpiece","elaborate codpiece","Renaissance codpiece"],"synonyms":["braguette"],"antonyms":[]},{"part_of_speech":"noun","definition":"(比喩的に)男性器を強調するもの、男性らしさの象徴","english_definition":"(Figurative) Something that emphasizes masculinity or virility.","examples":[{"sentence":"The sports car was seen as a codpiece for the insecure man.","translation":"そのスポーツカーは、自信のない男性のための股間当て（男性らしさの象徴）と見なされた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Middle English: from cod + piece. 'Cod' referred to a bag or pouch.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒd.piːs/","syllables":"cod-piece"},"inflection":{"noun_plural":"codpieces"},"usage_notes":{"explanation":"The codpiece was a significant fashion item in European men's clothing, particularly during the 15th and 16th centuries. It evolved from a simple functional flap to a highly decorated and exaggerated symbol of masculinity. Today, the term is primarily used in historical contexts or as a figurative term to describe something that is seen as an ostentatious display of virility.","priority":"★★☆"},"common_mistakes":{},"related_words":[],"level_frequency":{"CEFR":"Not applicable (historical term)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'codpiece' refers to a historical garment, specifically a pouch worn by men in the 15th and 16th centuries to cover the genitals. It is not commonly used in modern conversation, and its usage is primarily limited to discussions of historical fashion or as a metaphorical reference to exaggerated displays of masculinity. Understanding the term requires some knowledge of historical fashion trends.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum displayed several examples of ornate codpieces from the Tudor period.","translation":"博物館には、テューダー朝時代の華やかな股間当ての例がいくつか展示されていた。","type":"noun","meaning_category":"historical garment"},{"sentence":"Some critics viewed the movie's excessive violence as a cinematic codpiece.","translation":"一部の批評家は、その映画の過剰な暴力を映画的な股間当て（男性らしさの誇示）と見なした。","type":"noun","meaning_category":"figurative"}]}