{"word":"unharangued","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(人)が、長広舌をふるわれることなく、説教されずに、非難されずに","english_definition":"Not subjected to a lengthy and aggressive speech or lecture.","examples":[{"sentence":"He remained unharangued, quietly observing the commotion.","translation":"彼は騒ぎを静かに観察し、長広舌をふるわれることはなかった。"},{"sentence":"The audience, expecting a fiery speech, was surprised to find themselves unharangued.","translation":"聴衆は激しい演説を期待していたが、説教されずに驚いた。"}],"collocations":["remain unharangued","find oneself unharangued"],"synonyms":["unlectured","unscolded","unreprimanded","unadmonished"],"antonyms":["harangued","lectured","scolded","reprimanded","admonished"]}],"etymology":{"value":"Derived from 'harangue' (a lengthy and aggressive speech) with the prefix 'un-' (not).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnhəˈræŋd/","syllables":"un-ha-rangued"},"inflection":{"notes":"This is the past participle form of the verb 'harangue' used as an adjective with the negative prefix 'un-'. It does not have standard comparative or superlative forms."},"usage_notes":{"explanation":"'Unharangued' is a relatively rare word, primarily used in formal or literary contexts. It describes the state of someone who has avoided being subjected to a 'harangue,' which is a long, forceful, and often critical speech. The word emphasizes the absence of such a verbal assault or lecture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unharangued speaker was pleased with the positive reception.","correct":"✓ The speaker, unharangued, was pleased with the positive reception.","note":"The speaker is not 'unharangued' in this context. Instead, the sentence should be rephrased to indicate that the speaker did not deliver a harangue. The corrected sentence uses 'unharangued' as a parenthetical adjective describing the state of the audience or a potential recipient of a harangue."}],"priority":"★☆☆"},"related_words":{"derivatives":["harangue (noun, verb)","haranguer (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unharangued' is a sophisticated word that describes someone who has not been subjected to a lengthy, critical, or aggressive speech. It's formed by adding the prefix 'un-' to 'harangued,' the past participle of 'harangue.' Understanding this word requires familiarity with 'harangue' and the function of negative prefixes. It is rarely used in everyday conversation and is more likely to appear in formal writing or literature."},"example_sentences":[{"sentence":"Despite the controversial topic, the panel discussion remained civil, and no participant was unharangued.","translation":"物議を醸すトピックにもかかわらず、パネルディスカッションは穏やかさを保ち、参加者は誰一人として長広舌をふるわれることはなかった。","type":"adjective","meaning_category":"Not subjected to a lengthy and aggressive speech"},{"sentence":"The new employee, nervous about his first presentation, was relieved to find himself unharangued by the senior management.","translation":"初めてのプレゼンテーションに緊張していた新入社員は、上級管理職から説教されずに安堵した。","type":"adjective","meaning_category":"Not subjected to a lengthy and aggressive speech"}]}