{"word":"Refugeeism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"難民問題、難民状態","english_definition":"The state or condition of being a refugee; issues related to refugees.","examples":[{"sentence":"The world is facing a growing crisis of refugeeism.","translation":"世界は難民問題の深刻化に直面している。"},{"sentence":"Refugeeism is a complex issue with no easy solutions.","translation":"難民問題は容易な解決策のない複雑な問題である。"}],"collocations":["global refugeeism (世界的な難民問題)","addressing refugeeism (難民問題への取り組み)","the causes of refugeeism (難民問題の原因)"],"synonyms":["refugee crisis","displacement","forced migration"],"antonyms":["repatriation","resettlement","integration"]}],"etymology":{"value":"The word is formed by adding the suffix '-ism' to 'refugee'. The term 'refugee' originates from the French word 'réfugié', which means 'one who seeks refuge'. The '-ism' suffix denotes a condition, state, or doctrine. Therefore, 'refugeeism' refers to the condition or state of being a refugee, or the issues surrounding refugees.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌrɛfjuˈdʒiːɪzəm/","syllables":"re-fu-gee-ism"},"inflection":{"noun_plural":"None (generally used as an uncountable noun)"},"usage_notes":{"explanation":"'Refugeeism' is a relatively uncommon term, but it is used to describe the phenomenon of mass displacement and the challenges faced by refugees and the international community in addressing their needs. It encompasses the social, political, and economic aspects of the refugee experience. It is often used in academic or policy discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The refugeeism is increasing.","correct":"✓ Refugeeism is increasing.","note":"'Refugeeism' is generally used as an uncountable noun, so it does not take the definite article 'the' unless referring to a specific instance. Also, it does not have a plural form."}],"priority":"★☆☆"},"related_words":{"derivatives":["refugee (noun: 難民)","refuge (noun: 避難、避難場所)","refugee camp (noun: 難民キャンプ)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Refugeeism' is a complex term referring to the state of being a refugee and the issues surrounding refugees, including displacement, humanitarian crises, and international responses. It is often used in academic and policy contexts. Understanding this term requires knowledge of global events, political science, and humanitarian efforts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The rise of conflict and persecution has led to increased refugeeism worldwide.","translation":"紛争と迫害の増加が、世界的な難民問題の深刻化につながっている。","type":"noun","meaning_category":"難民問題"},{"sentence":"International organizations are working to combat refugeeism by providing aid and seeking long-term solutions.","translation":"国際機関は、援助を提供し、長期的な解決策を模索することで、難民問題に取り組んでいる。","type":"noun","meaning_category":"難民問題"}]}