{"word":"un-Americanity","meanings":[{"part_of_speech":"noun","definition":"非アメリカ的な性質、反アメリカ的な性質","english_definition":"The quality or state of being un-American; characteristics or behaviors considered contrary to American values, principles, or ideals.","examples":[{"sentence":"The committee investigated the un-Americanity of certain political groups.","translation":"委員会は特定の政治団体の非アメリカ的な性質を調査した。"},{"sentence":"His views were criticized for their perceived un-Americanity.","translation":"彼の見解は、その認識された反アメリカ的な性質のために批判された。"},{"sentence":"The debate centered on the definition of un-Americanity in the modern context.","translation":"議論は現代の文脈における非アメリカ的な性質の定義を中心に展開された。"}],"collocations":["perceived un-Americanity","investigate un-Americanity","define un-Americanity","elements of un-Americanity"],"synonyms":["anti-Americanism","disloyalty","subversion","sedition"],"antonyms":["Americanism","patriotism","loyalty","nationalism"]}],"etymology":{"value":"Formed from \"un-\" (prefix meaning 'not'), \"American,\" and \"-ity\" (suffix denoting a state or quality). Thus, literally 'the state of being un-American.'","priority":"2"},"pronunciation":{"ipa":"/ˌʌnəˌmɛrɪkəˈnɪti/","syllables":"un-A-mer-i-ca-ni-ty"},"inflection":{"noun_plural":"un-Americanities"},"usage_notes":{"explanation":"The term \"un-Americanity\" is often used in political discourse to label ideas, actions, or beliefs that are seen as threatening to American identity or security. It can be a highly subjective and contentious term, as the definition of what constitutes \"American\" values is often debated. Historically, it has been used during periods of national anxiety or political polarization to suppress dissent or marginalize certain groups.","priority":"3"},"common_mistakes":{"examples":[{"incorrect":"The un-Americanity is a threat.","correct":"Un-Americanity is a threat.","note":"\"Un-Americanity\" is an abstract noun and generally doesn't require the definite article \"the\" unless referring to a specific instance."}],"priority":"2"},"related_words":{"derivatives":["un-American (adjective)"],"related_concepts":["McCarthyism","Red Scare","national security","civil liberties"],"priority":"2"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in political or historical contexts.","priority":"1"},"readability_explanation":{"level":"C2","text":"The word \"un-Americanity\" is a complex term typically found in advanced political or historical discussions. It refers to the abstract quality of being contrary to perceived American values or ideals. Understanding this term requires familiarity with American history, political discourse, and the nuances of national identity. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The senator condemned the un-Americanity of the proposed legislation.","translation":"上院議員は提案された法律の反アメリカ的な性質を非難した。","type":"general","meaning_category":"general"},{"sentence":"Critics argued that the policy infringed on civil liberties and represented a form of un-Americanity.","translation":"批評家たちは、その政策が市民的自由を侵害し、反アメリカ的な性質の一形態であると主張した。","type":"political","meaning_category":"political"},{"sentence":"The documentary explored the historical roots of un-Americanity in times of national crisis.","translation":"ドキュメンタリーは、国家危機の時代における反アメリカ的な性質の歴史的ルーツを探求した。","type":"historical","meaning_category":"historical"}]}