{"word":"Phantasmist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"幻影主義者、幻影研究家","english_definition":"One who deals in phantasms or illusions; a conjurer; one who believes in the reality of phantasms or apparitions.","examples":[{"sentence":"The phantasmist attempted to conjure a spirit from the other side.","translation":"その幻影主義者は、あの世から霊を呼び出そうと試みた。"},{"sentence":"Skeptics often challenge the claims of phantasmists regarding supernatural phenomena.","translation":"懐疑論者は、超自然現象に関する幻影主義者の主張にしばしば異議を唱える。"}],"collocations":["conjuring phantasms","debating with phantasmists","studying phantasms"],"synonyms":["illusionist","conjurer","spiritualist","apparitionist"],"antonyms":["skeptic","realist"]}],"etymology":{"value":"From 'phantasm' (a product of the imagination; an apparition) + '-ist' (a person who practices or is concerned with something).","priority":"★★☆"},"pronunciation":{"ipa":"/fænˈtæzmɪst/","syllables":"phan-tas-mist"},"inflection":{"noun_plural":"Phantasmists"},"usage_notes":{"explanation":"The term 'Phantasmist' is relatively rare and often associated with historical contexts related to spiritualism, magic, and the study of apparitions. It can refer to someone who creates illusions or someone who believes in the reality of phantasms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a famous phantasmist, so he must be a ghost.","correct":"✓ He is a famous phantasmist, known for creating illusions.","note":"A phantasmist is not a ghost but someone who deals with illusions or believes in phantasms."}],"priority":"★☆☆"},"related_words":{"derivatives":["phantasm (noun: a figment of the imagination; an illusion or apparition)","phantasmal (adjective: relating to or like a phantasm)","phantasmagoria (noun: a sequence of real or imaginary images like those seen in a dream)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Phantasmist' is a specialized term, primarily encountered in contexts relating to the history of spiritualism, magic, and the study of paranormal phenomena. It denotes either someone who creates illusions or someone who believes in the reality of apparitions and phantasms. Due to its specific and somewhat archaic usage, it is not commonly found in everyday language."},"example_sentences":[{"sentence":"The old theater was once home to a renowned phantasmist who captivated audiences with his elaborate illusions.","translation":"その古い劇場はかつて、手の込んだイリュージョンで観客を魅了した有名な幻影主義者の本拠地だった。","type":"noun","meaning_category":"幻影主義者"},{"sentence":"Many early 20th-century phantasmists claimed to be able to communicate with the deceased.","translation":"20世紀初頭の多くの幻影主義者は、死者とコミュニケーションできると主張していた。","type":"noun","meaning_category":"幻影研究家"}]}