{"word":"opsonifying","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(免疫学)オプソニン化する：抗体または補体などのオプソニンで細菌または他の細胞を覆い、食細胞による取り込みを促進する。","english_definition":"(immunology) To coat bacteria or other cells with opsonins, such as antibodies or complement, to promote uptake by phagocytes.","examples":[{"sentence":"The antibodies are opsonifying the bacteria, making them easier for the immune cells to engulf.","translation":"抗体が細菌をオプソニン化し、免疫細胞が飲み込みやすくしている。"},{"sentence":"Opsonifying pathogens is a key step in the immune response.","translation":"病原体をオプソニン化することは、免疫応答の重要なステップである。"}],"collocations":["opsonifying antibodies","opsonifying complement","opsonifying pathogens"],"synonyms":["tagging","marking","preparing for phagocytosis"],"antonyms":["preventing phagocytosis","inhibiting uptake"]}],"etymology":{"value":"'Opsonin' (1903) + '-fy'. 'Opsonin' from Greek 'opsōnein' meaning 'to cater, purchase provisions', from 'opsōn' meaning 'cooked food, provisions'.","priority":"★★☆"},"pronunciation":{"ipa":"ɒpˈsɒnɪfaɪɪŋ","syllables":"op-son-i-fy-ing"},"inflection":{"verb_forms":{"present_simple":["opsonifies"],"past_simple":"opsonified","past_participle":"opsonified","present_participle":"opsonifying"}},"usage_notes":{"explanation":"'Opsonifying' describes the process of making a cell or particle more susceptible to phagocytosis. It is a technical term primarily used in immunology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The drug is opsonifying the virus directly.","correct":"✓ The drug is promoting the opsonification of the virus.","note":"Drugs typically don't opsonize directly, but rather enhance the process of opsonification. The sentence should be rephrased to reflect this indirect action."}],"priority":"★☆☆"},"related_words":{"derivatives":["opsonin (noun): An antibody or other substance that binds to foreign microorganisms or cells making them more susceptible to phagocytosis.","opsonization (noun): The process of opsonizing."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Opsonifying' is a highly specialized term used in the field of immunology. It refers to the process of coating a pathogen with opsonins to enhance phagocytosis. Understanding this term requires advanced knowledge of immunology. It is rarely used outside of scientific contexts."},"example_sentences":[{"sentence":"The complement system plays a crucial role in opsonifying pathogens for destruction.","translation":"補体系は、破壊のために病原体をオプソニン化する上で重要な役割を果たす。","type":"verb","meaning_category":"immunology"},{"sentence":"By opsonifying the bacteria, the antibodies facilitate their engulfment by macrophages.","translation":"細菌をオプソニン化することにより、抗体はマクロファージによる貪食を促進する。","type":"verb","meaning_category":"immunology"}]}