{"word":"philhellenism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"親ギリシャ主義、ギリシャ愛好","english_definition":"Love of Greek culture and civilization. Support for the Greek cause or the Greek people.","examples":[{"sentence":"Philhellenism was a significant movement in the 19th century, particularly during the Greek War of Independence.","translation":"親ギリシャ主義は19世紀に重要な運動であり、特にギリシャ独立戦争中に顕著でした。"},{"sentence":"Lord Byron's philhellenism led him to fight and eventually die for Greek independence.","translation":"ロード・バイロンの親ギリシャ主義は、彼をギリシャ独立のために戦わせ、最終的には死に至らしめました。"}],"collocations":["romantic philhellenism (ロマン主義的親ギリシャ主義)","political philhellenism (政治的親ギリシャ主義)","support philhellenism (親ギリシャ主義を支持する)","demonstrate philhellenism (親ギリシャ主義を示す)"],"synonyms":["Hellenophilia","Greek enthusiasm","Greek revivalism"],"antonyms":["anti-Hellenism","Hellenophobia"]},{"part_of_speech":"noun","definition":"古代ギリシャ文化への傾倒","english_definition":"Admiration and emulation of ancient Greek culture, art, and philosophy.","examples":[{"sentence":"His philhellenism was evident in his extensive collection of Greek sculptures.","translation":"彼の親ギリシャ主義は、ギリシャ彫刻の広範なコレクションに明らかでした。"},{"sentence":"The university professor's philhellenism influenced his teaching and research.","translation":"その大学教授の親ギリシャ主義は、彼の教育と研究に影響を与えました。"}],"collocations":["classical philhellenism (古典的親ギリシャ主義)","artistic philhellenism (芸術的親ギリシャ主義)","intellectual philhellenism (知的親ギリシャ主義)"],"synonyms":["Hellenophilia","Greek revivalism","classicism"],"antonyms":["anti-classicism"]}],"etymology":{"value":"From the Greek words 'philos' (loving) and 'Hellene' (Greek).","priority":"★★★"},"pronunciation":{"ipa":"/fɪlˈhɛlənɪzəm/","syllables":"phil-hel-len-ism"},"inflection":{"noun_plural":"philhellenisms"},"usage_notes":{"explanation":"Philhellenism refers to the admiration, love, and support for Greek culture, the Greek people, or the Greek cause. It can manifest as an interest in ancient Greek history, philosophy, and art, or as support for modern Greek independence and national aspirations. The term is most commonly associated with the 19th-century movement that supported Greek independence from the Ottoman Empire.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a philhellene, he loves Italy.","correct":"✓ He is a philhellene, he loves Greece.","note":"Philhellenism specifically refers to love of Greece and Greek culture, not Italy."},{"incorrect":"✗ Philhellenism is about hating other cultures.","correct":"✓ Philhellenism is about loving Greek culture.","note":"Philhellenism is about love for Greece, not hatred for other cultures."}],"priority":"★★☆"},"related_words":{"derivatives":["philhellene (noun/adjective: a lover of Greek culture or supporter of the Greek cause)","philhellenic (adjective: relating to or characteristic of philhellenism)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Philhellenism' is a relatively uncommon word referring to the love and admiration of Greek culture, history, and the Greek people. It is often used in historical contexts, particularly when discussing the 19th-century movement supporting Greek independence. Understanding the word requires familiarity with Greek history and culture.","priority":"★★☆"},"example_sentences":[{"sentence":"The poet's philhellenism is evident in his many poems about ancient Greece.","translation":"その詩人の親ギリシャ主義は、古代ギリシャに関する彼の多くの詩に明らかです。","type":"general","meaning_category":"親ギリシャ主義"},{"sentence":"Many European intellectuals embraced philhellenism during the Greek War of Independence.","translation":"多くのヨーロッパの知識人が、ギリシャ独立戦争中に親ギリシャ主義を受け入れました。","type":"historical","meaning_category":"親ギリシャ主義"},{"sentence":"Her philhellenism led her to study classical Greek literature and philosophy.","translation":"彼女の親ギリシャ主義は、彼女に古典ギリシャ文学と哲学を研究させました。","type":"cultural","meaning_category":"親ギリシャ主義"}]}