{"word":"pseudoallelism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"偽アレル、擬似対立遺伝子","english_definition":"A condition in which two or more genes that produce similar phenotypes appear to be alleles of the same gene, but are actually located at different loci on the same chromosome.","examples":[{"sentence":"Pseudoallelism can be identified through complementation tests.","translation":"偽アレルは相補性テストによって識別できます。"},{"sentence":"The phenomenon of pseudoallelism is important in understanding gene organization.","translation":"偽アレル現象は遺伝子構造を理解する上で重要です。"}],"collocations":["exhibit pseudoallelism","demonstrate pseudoallelism","study pseudoallelism","pseudoallelism and complementation","pseudoallelism and genetic mapping"],"synonyms":["functional allelism","position effect pseudoallelism"],"antonyms":[]}],"etymology":{"value":"The term 'pseudoallelism' is derived from 'pseudo-' (false, deceptive) + 'allel(e)' + '-ism' (a condition or state). It reflects the deceptive appearance of allelic relationships between genes located at different loci.","priority":"★★☆"},"pronunciation":{"ipa":"ˌsjuːdoʊəˈliːlɪzəm","syllables":"pseu-do-al-le-lism"},"inflection":{"noun_plural":"pseudoallelisms"},"usage_notes":{"explanation":"Pseudoallelism describes a situation where multiple genes, located at closely linked but distinct loci, appear to behave as alleles of a single gene due to their similar phenotypic effects. This can be distinguished from true allelism through complementation testing and genetic mapping. Complementation tests can reveal that the mutations are in different genes, as the wild-type phenotype can be restored in trans heterozygotes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Pseudoallelism means the genes are located on different chromosomes.","correct":"✓ Pseudoallelism means the genes are located at different loci on the same chromosome.","note":"Pseudoallelism involves genes on the same chromosome, not different chromosomes."},{"incorrect":"✗ Pseudoallelism is the same as true allelism.","correct":"✓ Pseudoallelism mimics true allelism but is distinct due to the genes being at different loci.","note":"Pseudoallelism is not the same as true allelism; the genes are at different loci."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudoallele","pseudoallelic"],"phrasal_verbs":[],"related_terms":["complementation test","genetic locus","allele","gene","phenotype","cis configuration","trans configuration"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pseudoallelism' is a specialized term in genetics. It refers to a situation where two or more genes, located very close to each other on the same chromosome, appear to be alleles of the same gene because they produce similar observable traits (phenotypes). However, they are actually separate genes at different locations (loci). This is typically determined through complementation tests, which can show that the mutations are in different genes, even though they appear to be alleles.","priority":"★★☆"},"example_sentences":[{"sentence":"The phenomenon of pseudoallelism was first described in Drosophila.","translation":"偽アレル現象は最初にショウジョウバエで記述されました。","type":"general","meaning_category":"definition"},{"sentence":"Complementation analysis is crucial for distinguishing pseudoallelism from true allelism.","translation":"相補性分析は、偽アレルを真のアレルから区別するために重要です。","type":"technical","meaning_category":"identification"},{"sentence":"Pseudoallelism can complicate genetic mapping studies.","translation":"偽アレルは遺伝子マッピング研究を複雑にする可能性があります。","type":"application","meaning_category":"implication"}]}