{"word":"corycavine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"An isoquinoline alkaloid with various biological activities, including potential anticancer properties.","english_definition":"An isoquinoline alkaloid found in plants of the Corydalis genus, known for its diverse biological activities, including potential anticancer, analgesic, and anti-inflammatory effects.","examples":[{"sentence":"Corycavine is being studied for its potential use in cancer treatment.","translation":"コリカバインは、癌治療への応用の可能性について研究されています。"},{"sentence":"The plant extract containing corycavine showed promising results in preclinical trials.","translation":"コリカバインを含む植物抽出物は、前臨床試験で有望な結果を示しました。"}],"collocations":["corycavine treatment","corycavine derivative","corycavine extraction","corycavine synthesis"],"synonyms":["tetrahydroprotoberberine alkaloid"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name *Corydalis*, where it was first isolated, and the suffix '-ine', commonly used for alkaloids.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɔːriˈkæviːn/","syllables":"co-ry-ca-vine"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Corycavine is primarily used in scientific and medical contexts when discussing research related to its potential therapeutic applications. It's not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Corycavine is a type of vitamin.","correct":"✓ Corycavine is a type of alkaloid.","note":"Corycavine is an alkaloid, not a vitamin."}],"priority":"★★☆"},"related_words":{"derivatives":["corydalis (genus of plants)","alkaloid"],"related_compounds":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Corycavine' is a highly specialized term primarily encountered in scientific literature, specifically within the fields of phytochemistry, pharmacology, and medicinal chemistry. Understanding this term requires a background in organic chemistry and a familiarity with the nomenclature of alkaloids. It is unlikely to appear in general texts or everyday conversation."},"example_sentences":[{"sentence":"The effects of corycavine on tumor cell growth were examined in vitro.","translation":"腫瘍細胞の成長に対するコリカバインの影響をin vitroで調べました。","type":"scientific","meaning_category":"anticancer research"},{"sentence":"Researchers are investigating the analgesic properties of corycavine.","translation":"研究者たちはコリカバインの鎮痛特性を調査しています。","type":"scientific","meaning_category":"pharmacology"}]}