{"word":"Statesboy","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(slang, derogatory) An American, especially one who is perceived as being overly patriotic or naive about foreign affairs.","english_definition":"(slang, derogatory) An American, especially one who is perceived as being overly patriotic or naive about foreign affairs.","examples":[{"sentence":"He's such a statesboy, he thinks everyone in the world wants to be just like Americans.","translation":"彼は本当にアメリカかぶれで、世界中の人がアメリカ人のようになりたがっていると思っている。"},{"sentence":"Don't be such a statesboy; not every country is as free as America.","translation":"そんなアメリカかぶれにならないで。すべての国がアメリカほど自由なわけではない。"}],"collocations":["typical statesboy","ignorant statesboy"],"synonyms":["Yankee","American","nationalist","patriot"],"antonyms":["cosmopolitan","internationalist"]}],"etymology":{"value":"A blend of \"States\" (referring to the United States) and \"boy\" (often used pejoratively to imply naivete or lack of sophistication).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsteɪtsˌbɔɪ/","syllables":"States-boy"},"inflection":{"noun_plural":"Statesboys"},"usage_notes":{"explanation":"\"Statesboy\" is a derogatory term used to describe an American, particularly one who is seen as overly patriotic, nationalistic, or ignorant about the world outside of the United States. It implies a lack of sophistication or a naive belief in American exceptionalism. The term is often used critically to challenge such views.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a proud Statesboy and loves all countries equally.","correct":"✓ He's a proud American and loves his country.","note":"The term \"Statesboy\" is usually negative, so it doesn't fit with loving all countries equally. Use \"American\" instead if you want to express pride without the negative connotation."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Rare","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Statesboy\" is an informal and often derogatory term for an American, implying excessive patriotism or naivete. It's not a common word, so understanding its context and negative connotation is important. It's typically used in critical discussions about American identity or foreign policy.","priority":"★★★"},"example_sentences":[{"sentence":"The article criticized the senator for his statesboy attitude towards international relations.","translation":"その記事は、上院議員の国際関係に対するアメリカかぶれの態度を批判した。","type":"noun","meaning_category":"derogatory term for an American"},{"sentence":"He was accused of being a statesboy because he only bought American-made products.","translation":"彼はアメリカ製品しか買わないという理由で、アメリカかぶれだと非難された。","type":"noun","meaning_category":"derogatory term for an American"}]}