{"word":"cimicide","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(まれ) シラミ殺し、シラミ駆除剤","english_definition":"(rare) The killing of lice; a substance used to kill lice.","examples":[{"sentence":"The old remedy was a potent cimicide, though rather harsh on the skin.","translation":"その古い治療法は強力なシラミ駆除剤だったが、肌にはかなり刺激が強かった。"},{"sentence":"Cimicide is rarely discussed in modern medicine due to the availability of more effective and less toxic treatments.","translation":"より効果的で毒性の低い治療法が利用できるため、現代医学ではシラミ殺しについて議論されることはほとんどない。"}],"collocations":["potent cimicide","effective cimicide","use cimicide","apply cimicide"],"synonyms":["pediculicide","lice killer","lice treatment"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'cimex' (bedbug, insect) + '-cide' (killer). The word originally referred to killing bugs, but its use has narrowed to specifically killing lice.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪmɪsaɪd/","syllables":"cim-i-cide"},"inflection":{"noun_plural":"cimicides"},"usage_notes":{"explanation":"The term 'cimicide' is quite rare in modern English. 'Pediculicide' is the more common and accepted term for a substance that kills lice. 'Cimicide' might be encountered in older texts or in specialized contexts related to historical treatments for lice infestations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cimicide was used to kill all insects in the garden.","correct":"✓ The insecticide was used to kill all insects in the garden.","note":"'Cimicide' specifically refers to killing lice, not general insects. Use 'insecticide' for general insect killing."},{"incorrect":"✗ She ingested cimicide accidentally.","correct":"✓ She accidentally ingested the pediculicide.","note":"Use the more common and understandable term 'pediculicide' to avoid confusion."}],"priority":"★★☆"},"related_words":{"derivatives":["-cide (suffix indicating a killer or act of killing)","insecticide (insect killer)","pesticide (pest killer)","homicide (human killer)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cimicide' is a rare and specialized term, primarily encountered in historical or technical contexts related to pest control. Understanding the etymology (from Latin 'cimex' meaning insect or bug, and '-cide' meaning killer) is helpful, but in contemporary usage, 'pediculicide' is the preferred and more widely understood term for a substance that kills lice. It is important to distinguish 'cimicide' from more general terms like 'insecticide' or 'pesticide.'"},"example_sentences":[{"sentence":"The historical text described the use of a strong cimicide to eradicate lice from clothing.","translation":"その歴史的な文書は、衣服からシラミを根絶するために強力なシラミ駆除剤を使用することを記述していた。","type":"noun","meaning_category":"シラミ駆除剤"},{"sentence":"Early forms of cimicide often contained toxic chemicals.","translation":"初期のシラミ駆除剤には、しばしば有毒な化学物質が含まれていた。","type":"noun","meaning_category":"シラミ駆除剤"}]}