{"word":"Cashewbird","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A small, brightly colored bird found in South America, known for its association with cashew trees.","english_definition":"A colloquial name for certain birds, especially those observed near cashew trees, often referring to members of the Thraupidae family (tanagers).","examples":[{"sentence":"The local guides pointed out a Cashewbird flitting among the branches.","translation":"地元のガイド達は、枝の間をひらひらと飛ぶカシューバードを指し示した。"},{"sentence":"Cashewbirds are often seen feeding on insects and fruits around cashew plantations.","translation":"カシューバードは、カシューナッツ農園の周りで昆虫や果物を食べているのをよく見かける。"}],"collocations":["observe a Cashewbird","Cashewbird habitat","Cashewbird sighting"],"synonyms":["tanager (Thraupidae)","small South American bird"],"antonyms":[]}],"etymology":{"value":"The name is derived from the bird's frequent presence near cashew trees, where they often forage for food or nest. It is a descriptive term rather than a formal scientific classification.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæʃuːbɜːrd/","syllables":"cash-ew-bird"},"inflection":{"noun_plural":"Cashewbirds"},"usage_notes":{"explanation":"'Cashewbird' is not a formal scientific name but a colloquial term. It generally refers to small, colorful birds, particularly tanagers, that are commonly found near cashew trees in South America. The exact species referred to can vary depending on the region.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Cashewbird is a type of parrot.","correct":"✓ The Cashewbird is a type of tanager (or small South American bird).","note":"Cashewbirds are typically tanagers or other small passerine birds, not parrots."}],"priority":"★★☆"},"related_words":{"derivatives":["cashew (noun): the nut from the cashew tree)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - a relatively uncommon term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cashewbird' is a colloquial term, not a formal scientific classification. It is used to describe small, colorful birds, often tanagers, that are commonly seen near cashew trees in South America. The specific species can vary by region. Understanding this term requires some familiarity with South American birdlife and local naming conventions."},"example_sentences":[{"sentence":"We spotted several Cashewbirds while touring the cashew plantation.","translation":"カシューナッツ農園を見学している間、数羽のカシューバードを見つけました。","type":"noun","meaning_category":"bird"},{"sentence":"The bright plumage of the Cashewbird makes it easy to identify in the forest.","translation":"カシューバードの鮮やかな羽毛は、森林の中で識別しやすくしています。","type":"noun","meaning_category":"bird"}]}