{"word":"Gaons","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural only) A historical term referring to the heads of the major Jewish academies in Babylonia (present-day Iraq) during the Geonic period (roughly 6th-11th centuries CE).","english_definition":"(plural only) The heads of the major Jewish academies in Babylonia (present-day Iraq) during the Geonic period (roughly 6th-11th centuries CE).","examples":[{"sentence":"The Gaons held significant religious and legal authority within the Jewish community.","translation":"ガオンたちは、ユダヤ人コミュニティ内で重要な宗教的および法的権威を持っていた。"},{"sentence":"Many responsa (legal rulings) from the Gaons have been preserved and are studied to this day.","translation":"ガオンたちからの多くのレスポンサ（法的裁定）が保存されており、今日でも研究されている。"}],"collocations":["Geonic period","Jewish academies","responsa literature"],"synonyms":["Rabbanan Savorai"],"antonyms":[]}],"etymology":{"value":"From Hebrew גאונים (geonim), plural of גאון (gaon), meaning 'eminence, pride, excellence'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɡeɪˈoʊnz/","syllables":"Ge-ons"},"inflection":{"noun_plural":"Gaons (already plural)"},"usage_notes":{"explanation":"'Gaons' is a specific historical term referring to a group of religious leaders. It is almost exclusively used in historical or religious contexts when discussing Jewish history and law during the Geonic period. The singular form 'Gaon' refers to an individual leader.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was one of the Gaon.","correct":"✓ He was one of the Gaons.","note":"Since 'Gaons' is plural, it should be used with plural constructions like 'one of the Gaons'."},{"incorrect":"✗ The Gaons was powerful.","correct":"✓ The Gaons were powerful.","note":"'Gaons' is a plural noun and requires a plural verb."}],"priority":"★★☆"},"related_words":{"derivatives":["Gaon (singular form)","Geonic (adjective, relating to the Gaons or the Geonic period)","Geonim (Hebrew plural form)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily in academic or religious texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Gaons' is a specialized historical term. Understanding requires knowledge of Jewish history, specifically the Geonic period. The term is primarily encountered in academic texts, religious studies, or discussions related to Jewish law and history. Familiarity with Hebrew terminology is helpful for understanding the etymology and related terms.","priority":"★★☆"},"example_sentences":[{"sentence":"The decisions of the **Gaons** shaped Jewish law for centuries.","translation":"ガオンたちの決定は、何世紀にもわたってユダヤ法の形成に影響を与えた。","type":"noun","meaning_category":"historical religious leaders"},{"sentence":"The **Gaons** of Sura and Pumbedita were highly respected scholars.","translation":"スーラとプンベディタのガオンたちは、非常に尊敬された学者であった。","type":"noun","meaning_category":"historical religious leaders"}]}