{"word":"faltode","meanings":[{"part_of_speech":"noun","definition":"(Philippines, slang, derogatory) A person who acts or behaves as if they are of a higher social class, or who pretends to be rich or sophisticated when they are not; a pretentious person; a poser.","english_definition":"A person who pretends to be someone they are not, especially someone of a higher social class or with more wealth or sophistication.","examples":[{"sentence":"He's such a faltode, always showing off his fake designer clothes.","translation":"彼は本当に見栄っ張りで、いつも偽物のブランド服を見せびらかしている。"},{"sentence":"Don't be a faltode; just be yourself.","translation":"見栄を張るな。ありのままの自分でいなさい。"}],"synonyms":["poser","pretender","show-off","wannabe","social climber"],"antonyms":[],"related_words":["mayabang","mapagmataas"]}],"etymology":{"value":"Likely a portmanteau of the English word 'false' and the Tagalog word 'tudo' meaning 'all' or 'everything', suggesting someone who is 'all false' or 'completely fake'.","notes":"The etymology is speculative but plausible given the word's meaning and usage."},"pronunciation":{"ipa":"/falˈto.de/"},"usage_notes":{"explanation":"The term 'faltode' is a derogatory slang term primarily used in the Philippines to describe someone perceived as pretentious or trying too hard to appear wealthy or sophisticated. It carries a negative connotation and implies that the person is inauthentic or trying to deceive others about their true social status.","region":"Philippines"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in the Philippines."},"readability_explanation":{"level":"Advanced. Requires familiarity with Philippine slang and cultural context.","text":"The word 'faltode' is a slang term from the Philippines used to describe someone who is pretentious or trying to appear richer or more sophisticated than they actually are. Understanding this word requires knowledge of Philippine culture and slang."},"example_sentences":[{"sentence":"Stop acting like a faltode and just enjoy the simple things in life.","translation":"見栄を張るのはやめて、人生のささやかなことを楽しみなさい。","type":"example","meaning_category":"pretentious person"},{"sentence":"She was accused of being a faltode because she always bragged about her travels.","translation":"彼女はいつも旅行について自慢していたので、見栄っ張りだと非難された。","type":"example","meaning_category":"pretentious person"}]}