{"word":"headrooms","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 頭上空間、天井の高さ、余裕","english_definition":"(plural) The amount of space above the head; vertical clearance; figurative space or allowance for something.","examples":[{"sentence":"The low ceilings gave the room poor headrooms.","translation":"低い天井のせいで、部屋の頭上空間が狭かった。"},{"sentence":"The bridge has adequate headrooms for large trucks.","translation":"その橋には大型トラックが通れる十分な頭上空間がある。"},{"sentence":"The budget allows for some headrooms in case of unexpected expenses.","translation":"予算には、予期せぬ出費に備えてある程度の余裕が設けられている。"}],"collocations":["adequate headrooms (十分な頭上空間)","limited headrooms (限られた頭上空間)","vertical headrooms (垂直方向の頭上空間)","budget headrooms (予算の余裕)","design headrooms (設計上の余裕)"],"synonyms":["clearance","overhead space","vertical space","leeway","margin","buffer"],"antonyms":["cramped space","restriction","limitation"]},{"part_of_speech":"noun","definition":"(複数形, 写真・映像) 頭上余白、人物の上にある空間","english_definition":"(plural, photography/videography) The space between the top of a subject's head and the upper edge of the frame.","examples":[{"sentence":"The photographer framed the shot with generous headrooms.","translation":"写真家は被写体の頭上に十分な余白を取って撮影した。"},{"sentence":"Too little headrooms can make the subject feel cramped in the frame.","translation":"頭上余白が少なすぎると、被写体が窮屈に見える。"},{"sentence":"Proper headrooms is important for good composition.","translation":"適切な頭上余白は、良い構図のために重要だ。"}],"collocations":["generous headrooms (十分な頭上余白)","tight headrooms (狭い頭上余白)","negative headrooms (マイナスの頭上余白 - 頭がフレームからはみ出す)"],"synonyms":["top space","above-head space","framing space"],"antonyms":["chin space","lead room"]}],"etymology":{"value":"'Headroom' is a compound word formed from 'head' and 'room'. It literally refers to the space above one's head. The figurative sense of 'allowance' or 'margin' developed from the idea of having physical space to move or breathe freely.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛdˌruːmz/","syllables":"head-rooms"},"inflection":{"noun_plural":"headrooms"},"usage_notes":{"explanation":"The word 'headrooms' is the plural form of 'headroom'. It is used in two main contexts:\n\n1.  **Physical space:** Referring to the vertical distance between a person's head and the ceiling or any overhead structure. This is common in architecture, construction, and vehicle design.\n2.  **Figurative space/allowance:** Referring to a margin of safety or flexibility in a budget, plan, or design. This implies having extra resources or space to accommodate unexpected changes or errors.\n3. **Photography/Videography:** Referring to the space above the subject's head in a frame.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The car has a good headroom.","correct":"✓ The car has good headroom.","note":"'Headroom' is typically used as an uncountable noun when referring to the general concept of space. However, 'headrooms' can be used to emphasize multiple instances or types of headroom."},{"incorrect":"✗ We need more headrooms in the project plan.","correct":"✓ We need more headroom in the project plan.","note":"In the figurative sense of 'allowance' or 'margin', 'headroom' is often used as an uncountable noun. However, 'headrooms' can be used to emphasize multiple instances or types of headroom."}],"priority":"★★☆"},"related_words":{"derivatives":["headroom (singular form)"],"phrases":["give someone headrooms (to allow someone space or flexibility)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (architecture, photography).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Headrooms' is the plural form of 'headroom', which refers to the space above your head or a figurative allowance. It's used in contexts like architecture (the height of a ceiling) or photography (the space above a subject's head in a frame). It can also mean having extra space or flexibility in a plan or budget. The word is more common in technical or specialized discussions than in everyday conversation."},"example_sentences":[{"sentence":"The old building had very low headrooms.","translation":"その古い建物は天井がとても低かった。","type":"noun","meaning_category":"Physical space"},{"sentence":"We need to create more headrooms in the schedule to account for potential delays.","translation":"潜在的な遅延を考慮して、スケジュールにもっと余裕を持たせる必要がある。","type":"noun","meaning_category":"Figurative space"},{"sentence":"The photographer adjusted the camera to ensure proper headrooms in the portrait.","translation":"写真家は、ポートレートで適切な頭上余白を確保するためにカメラを調整した。","type":"noun","meaning_category":"Photography"}]}