{"word":"Azobisisobutyronitrile","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アゾビスイソブチロニトリル：有機化合物の一種で、ラジカル重合の開始剤として用いられる。","english_definition":"An organic compound, often abbreviated as AIBN, used as a radical initiator in polymerization reactions.","examples":[{"sentence":"Azobisisobutyronitrile decomposes upon heating to generate free radicals.","translation":"アゾビスイソブチロニトリルは加熱されると分解し、フリーラジカルを生成する。"},{"sentence":"AIBN is commonly used in the synthesis of polymers.","translation":"AIBNはポリマーの合成によく用いられる。"}],"collocations":["radical initiator","polymerization reaction","thermal decomposition"],"synonyms":["AIBN"],"antonyms":[]}],"etymology":{"value":"'Azo-' (アゾ基を持つことを示す接頭辞) + 'bis-' (二重であることを示す接頭辞) + 'isobutyronitrile' (イソブチロニトリルの構造を持つことを示す)","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌeɪzoʊˌbɪsˌaɪsoʊˌbjuːtɪroʊˈnaɪtrɪl/","syllables":"A-zo-bis-i-so-bu-ty-ro-ni-trile"},"inflection":{},"usage_notes":{"explanation":"Azobisisobutyronitrile (AIBN) is a chemical compound primarily used as a radical initiator in polymerization reactions. It decomposes upon heating, generating nitrogen gas and two free radicals, which can then initiate the polymerization of monomers. AIBN is favored due to its relatively stable nature at room temperature and predictable decomposition kinetics at elevated temperatures.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["polymerization","radical initiator","free radical"],"priority":"☆☆☆"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"Azobisisobutyronitrile is a technical term used in chemistry, specifically in the context of polymer synthesis. Understanding its function requires knowledge of organic chemistry and polymerization processes. The term is rarely encountered outside of scientific or technical contexts."},"example_sentences":[{"sentence":"The polymerization was initiated by the thermal decomposition of azobisisobutyronitrile.","translation":"重合はアゾビスイソブチロニトリルの熱分解によって開始された。","type":"noun","meaning_category":"ラジカル重合開始剤"},{"sentence":"A solution of AIBN in the monomer was heated to initiate the reaction.","translation":"モノマー中のAIBN溶液を加熱して反応を開始した。","type":"noun","meaning_category":"ラジカル重合開始剤"}]}