{"word":"Camella","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カメリア、ツバキ属の植物","english_definition":"A genus of flowering plants in the family Theaceae, commonly known as camellias.","examples":[{"sentence":"The garden was filled with beautiful Camella flowers.","translation":"庭は美しいカメリアの花でいっぱいでした。"}],"collocations":["Camella japonica (ヤブツバキ)","Camella sinensis (チャノキ)"],"synonyms":["tea plant (チャノキ)"],"antonyms":[]}],"etymology":{"value":"The name 'Camellia' was given by Linnaeus to honor the Moravian Jesuit botanist Georg Joseph Kamel (1661–1706), who worked in the Philippines and described some species of camellias.","priority":"★★★"},"pronunciation":{"ipa":"/kəˈmɛliə/","syllables":"ca-mel-li-a"},"inflection":{"noun_plural":"Camellias"},"usage_notes":{"explanation":"'Camella' refers to the genus of flowering plants, with various species known for their ornamental flowers and, in the case of Camella sinensis, for tea production. It is often used in botanical contexts or when discussing gardening and ornamental plants.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I like to drink Camella.","correct":"✓ I like to drink tea.","note":"'Camella' refers to the plant itself, not the beverage. If you mean tea, use 'tea'."}],"priority":"★★☆"},"related_words":{"derivatives":["camellias (plural noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Camella' is a botanical term referring to a genus of flowering plants. It is primarily used in contexts related to botany, gardening, or horticulture. The word itself is not commonly used in everyday conversation, but rather in specialized discussions about plants. Understanding its meaning requires some familiarity with botanical nomenclature."},"example_sentences":[{"sentence":"The 'Camella japonica' is a popular ornamental plant in many gardens.","translation":"ヤブツバキは多くの庭で人気のある観賞植物です。","type":"noun","meaning_category":"植物"},{"sentence":"'Camella sinensis' is cultivated for its leaves, which are used to make tea.","translation":"チャノキは葉を栽培され、お茶を作るために使われます。","type":"noun","meaning_category":"植物"}]}