{"word":"spectacleless","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"眼鏡をかけていない、眼鏡なしの","english_definition":"Not wearing spectacles; without spectacles.","examples":[{"sentence":"He squinted at the menu, his spectacleless eyes struggling to focus.","translation":"彼は眼鏡をかけない目でメニューをしかめながら、焦点を合わせようと苦労した。"},{"sentence":"The spectacleless professor peered over his notes.","translation":"眼鏡をかけていない教授は、ノートを覗き込んだ。"}],"collocations":["spectacleless eyes","spectacleless face"],"synonyms":["without glasses","unbespectacled"],"antonyms":["bespectacled","wearing spectacles"]}],"etymology":{"value":"\"spectacle\" + \"-less\". \"Spectacle\" comes from Latin \"spectaculum,\" meaning \"a public show, a sight,\" from \"spectare\" meaning \"to look at.\" The suffix \"-less\" means \"without.\"","priority":"★★☆"},"pronunciation":{"ipa":"ˈspektəkəlləs","syllables":"spec-ta-cle-less"},"inflection":{"notes":"Does not inflect."},"usage_notes":{"explanation":"\"Spectacleless\" is a relatively uncommon word used to describe someone who is not wearing eyeglasses. It emphasizes the absence of spectacles. It's often used in descriptive writing to highlight a character's appearance or to indicate a change in their usual look.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is spectacleless. He can't see well.","correct":"✓ He is spectacleless and can't see well.","note":"The first sentence is grammatically correct, but the second clarifies the consequence of not wearing spectacles. Using 'and' connects the two ideas more smoothly."}],"priority":"★☆☆"},"related_words":{"derivatives":["spectacle (noun)","spectacles (noun)","less (suffix)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"spectacleless\" is not commonly used. It means 'not wearing spectacles' or 'without spectacles.' It is more likely to be found in written texts, particularly in descriptive passages, than in everyday conversation. Because of its relative rarity, readers may need to infer its meaning from the context or consult a dictionary."},"example_sentences":[{"sentence":"The old man, spectacleless, struggled to read the small print.","translation":"その老人は、眼鏡をかけずに、小さな文字を読むのに苦労した。","type":"adjective","meaning_category":"眼鏡をかけていない"},{"sentence":"She felt strangely vulnerable without her spectacles, almost spectacleless in a world of clear vision.","translation":"彼女は眼鏡がないと奇妙に無防備に感じ、まるで明瞭な視界の世界で眼鏡なしになったようだった。","type":"adjective","meaning_category":"眼鏡なしの"}]}