{"word":"machine-defined","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"機械によって定義された、機械によって決定された","english_definition":"Defined or determined by a machine or automated process; relating to a definition provided by a machine learning model or algorithm.","examples":[{"sentence":"The algorithm uses machine-defined rules to categorize the data.","translation":"そのアルゴリズムは、機械によって定義されたルールを用いてデータを分類する。"},{"sentence":"The system relies on machine-defined parameters for optimal performance.","translation":"そのシステムは、最適なパフォーマンスのために機械によって定義されたパラメータに依存している。"},{"sentence":"The boundaries were machine-defined, based on the clustering of data points.","translation":"その境界は、データ点のクラスタリングに基づいて、機械によって定義された。"}],"collocations":["machine-defined rules","machine-defined parameters","machine-defined boundaries","machine-defined criteria","machine-defined features"],"synonyms":["algorithmically defined","automatically defined","computer-defined","AI-defined","data-driven definition"],"antonyms":["human-defined","manually defined","user-defined","expert-defined"],"notes":"This term is often used in the context of machine learning, artificial intelligence, and automated systems."}],"etymology":{"value":"A combination of \"machine\" (referring to a mechanical or electronic device) and \"defined\" (past participle of \"define,\" meaning to state or describe the exact meaning of something). The term implies that the definition is not created by a human but by a machine or an automated process.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈʃiːn dɪˈfaɪnd/","syllables":"ma-chine-de-fined"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'machine-defined' is used to describe something that has been defined or determined by an automated process, often involving machine learning or artificial intelligence. It emphasizes that the definition is not based on human input or expertise but rather on the analysis and processing of data by a machine.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The machine defined the word in the dictionary.","correct":"✓ The machine-defined parameters improved the system's performance.","note":"'Machine-defined' is an adjective, so it should be used to describe a noun. It doesn't mean a machine is defining a word in a dictionary."}],"priority":"★★☆"},"related_words":{"derivatives":["machine learning","machine intelligence","defined","definition","algorithm","automation"],"related_terms":["data-driven","AI-generated","automated","algorithmic"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - typically used in technical and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"machine-defined\" is used in technical fields like computer science and data analysis. It means that something, like a rule or a parameter, is determined by a computer program or algorithm rather than a person. It's important to understand this term when discussing automated systems or machine learning."},"example_sentences":[{"sentence":"The software uses machine-defined criteria to filter out irrelevant information.","translation":"そのソフトウェアは、機械によって定義された基準を用いて無関係な情報をフィルタリングする。","type":"general","meaning_category":"general"},{"sentence":"The machine-defined thresholds were adjusted to optimize the detection rate.","translation":"検出率を最適化するために、機械によって定義された閾値が調整された。","type":"technical","meaning_category":"technical"},{"sentence":"The model generates machine-defined categories based on patterns in the data.","translation":"そのモデルは、データ内のパターンに基づいて、機械によって定義されたカテゴリを生成する。","type":"machine learning","meaning_category":"machine learning"}]}