{"word":"sealant","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"シーラント、密封剤、充填剤","english_definition":"A substance used to block the passage of fluids through the surface or joints or openings in a material; a material used to make something airtight or watertight.","examples":[{"sentence":"Apply sealant to the cracks to prevent water damage.","translation":"水の浸入を防ぐために、ひび割れにシーラントを塗布してください。"},{"sentence":"The plumber used a silicone sealant to fix the leak.","translation":"配管工はシリコンシーラントを使って漏れを修理しました。"},{"sentence":"Dental sealants can help prevent cavities.","translation":"歯科用シーラントは虫歯予防に役立ちます。"}],"collocations":["apply sealant (シーラントを塗布する)","silicone sealant (シリコンシーラント)","dental sealant (歯科用シーラント)","joint sealant (ジョイントシーラント)","waterproof sealant (防水シーラント)"],"synonyms":["caulk","filler","adhesive","mastic","putty"],"antonyms":["none (opposite is a leak or opening)"]}],"etymology":{"value":"From 'seal' (to close tightly) + '-ant' (a suffix indicating a substance or agent).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsiːlənt/","syllables":"se-a-lant"},"inflection":{"noun_plural":"sealants"},"usage_notes":{"explanation":"A sealant is a material used to block the passage of fluids, air, or other substances through surfaces, joints, or openings. It is commonly used in construction, plumbing, automotive repair, and dentistry. Sealants can be made from various materials, including silicone, acrylic, polyurethane, and epoxy. The choice of sealant depends on the specific application and the properties required, such as flexibility, adhesion, and resistance to chemicals or temperature extremes. In dentistry, sealants are applied to the chewing surfaces of teeth to prevent cavities by creating a barrier against bacteria and food particles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to sealing the window.","correct":"✓ I need to seal the window. / ✓ I need to apply sealant to the window.","note":"'Sealing' is the act of applying sealant, or the present participle of the verb 'to seal'. The noun 'sealant' is the substance itself. To use 'sealant' correctly, you would say 'apply sealant' or 'use sealant'."},{"incorrect":"✗ The sealant is very liquidity.","correct":"✓ The sealant is very liquid.","note":"'Liquidity' refers to how easily an asset can be converted into cash. The correct adjective to describe a substance that flows easily is 'liquid'."}],"priority":"★★☆"},"related_words":{"derivatives":["seal (verb, noun)","sealed (adjective)","sealing (noun, adjective)"],"phrasal_verbs":["none (related phrasal verbs would use 'seal', e.g., 'seal off')"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent but commonly used in specific contexts (construction, dentistry, etc.)","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'sealant' refers to a substance used to prevent fluids or air from passing through a surface or joint. It's often used in construction, home repair, and dentistry. Understanding the term requires some familiarity with technical vocabulary related to these fields. The word itself is not overly complex, but its usage is typically found in more specialized contexts."},"example_sentences":[{"sentence":"The contractor used a high-quality **sealant** to weatherproof the building.","translation":"請負業者は、建物を耐候性にするために高品質のシーラントを使用しました。","type":"noun","meaning_category":"material"},{"sentence":"Applying a **sealant** to the bathtub prevents water from leaking into the floor below.","translation":"浴槽にシーラントを塗布すると、水が下の階に漏れるのを防ぎます。","type":"noun","meaning_category":"material"},{"sentence":"The dentist recommended a **sealant** for my child's molars to protect them from decay.","translation":"歯科医は、子供の奥歯を虫歯から守るためにシーラントを勧めました。","type":"noun","meaning_category":"material"}]}