{"word":"scouriness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(程度としての)ごしごし洗い、磨き、または研磨の状態。","english_definition":"The state or quality of being scoury; the degree to which something is scoured, scrubbed, or polished.","examples":[{"sentence":"The scouriness of the pot was evident after hours of scrubbing.","translation":"何時間もこすった後、鍋の磨かれた状態は明らかだった。"},{"sentence":"The metal surface was judged by its scouriness after the cleaning process.","translation":"洗浄工程後、金属表面は研磨度合いによって評価された。"}],"collocations":["degree of scouriness","surface scouriness","evaluate scouriness"],"synonyms":["abrasiveness","roughness","grittiness","cleanness","polish"],"antonyms":["smoothness","slickness","dullness"]}],"etymology":{"value":"Derived from the adjective 'scoury,' which comes from 'scour,' meaning to clean or rub vigorously. The suffix '-ness' is added to form a noun indicating a state or quality.","priority":"★★★"},"pronunciation":{"ipa":"/ˈskaʊriːnəs/","syllables":"scour-i-ness"},"inflection":{"noun_plural":"scourinesses (rarely used)"},"usage_notes":{"explanation":"'Scouriness' is a relatively uncommon noun, often used in technical or descriptive contexts to describe the texture or condition of a surface after it has been scoured. It is most frequently encountered in discussions of cleaning processes, material science, or surface finishing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scouriness made it shiny.","correct":"✓ The scouring made it shiny.","note":"'Scouriness' is a state or quality, not an action. Use 'scouring' to describe the action of cleaning."},{"incorrect":"✗ He added scouriness to the metal.","correct":"✓ He added a scoury texture to the metal.","note":"'Scouriness' is a quality that something possesses, not something that can be added directly. Describe the texture instead."}],"priority":"★★☆"},"related_words":{"derivatives":["scour (verb)","scoury (adjective)","scouring (noun/verb)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Scouriness' is a technical term used to describe how rough or abrasive a surface is after it has been cleaned or scoured. It's not a word you'd use in everyday conversation but might encounter in technical reports or detailed descriptions of materials and their properties."},"example_sentences":[{"sentence":"The level of scouriness on the steel indicated the effectiveness of the abrasive cleaner.","translation":"鋼の研磨度合いは、研磨剤クリーナーの有効性を示していた。","type":"noun","meaning_category":"degree of abrasion"},{"sentence":"The excessive scouriness of the cleaning pad damaged the delicate finish.","translation":"クリーニングパッドの過度の研磨性が繊細な仕上げを傷つけた。","type":"noun","meaning_category":"abrasive quality"}]}