{"word":"Neo-Impressionism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"新印象派","english_definition":"An art movement that developed in France in the late 19th century as a response to Impressionism. It is characterized by the use of pointillism, where small, distinct dots of color are applied in patterns to form an image.","examples":[{"sentence":"Seurat was a key figure in the Neo-Impressionism movement.","translation":"スーラは新印象派運動の重要な人物でした。"},{"sentence":"Neo-Impressionism sought to create more structured and scientific approach to painting.","translation":"新印象派は、絵画に対するより構造化され科学的なアプローチを創造しようとしました。"}],"collocations":["pointillism","divisionism","optical mixing","color theory","post-impressionism"],"synonyms":["Divisionism","Pointillism"],"antonyms":[]}],"etymology":{"value":"The term 'Neo-Impressionism' was coined by French art critic Félix Fénéon in 1886 to describe the style of painting developed by Georges Seurat and Paul Signac. It combines 'Neo' (new) with 'Impressionism' to indicate a development from and reaction to the earlier Impressionist movement.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌniːoʊ ɪmˈprɛʃənɪzəm/","syllables":"Ne-o-Im-pres-sion-ism"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"Neo-Impressionism is characterized by its scientific approach to color and light, contrasting with the more intuitive methods of the Impressionists. Pointillism, a technique of applying small dots of pure color that blend optically when viewed from a distance, is a hallmark of this style. Key artists include Georges Seurat, Paul Signac, and Camille Pissarro (for a period).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Neo-Impressionism is the same as Impressionism.","correct":"✓ Neo-Impressionism is a development of and reaction to Impressionism.","note":"Neo-Impressionism built upon but also reacted against Impressionism, using more structured and scientific techniques."},{"incorrect":"✗ All Impressionist painters used pointillism.","correct":"✓ Pointillism is a technique primarily associated with Neo-Impressionism.","note":"While some Impressionists experimented with similar techniques, pointillism is most strongly linked to Neo-Impressionism."}],"priority":"★★☆"},"related_words":{"derivatives":["Neo-Impressionist (adjective, noun)"],"other_related_terms":["Impressionism","Post-Impressionism","Pointillism","Divisionism","Georges Seurat","Paul Signac","Félix Fénéon","color theory","optical mixing"],"priority":"★★★"},"level_frequency":{"level":"C1-C2","frequency_google_ngram":"Relatively low frequency, primarily used in art historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Neo-Impressionism is a term used in art history to describe a late 19th-century movement that evolved from Impressionism. It's known for its scientific approach to painting, particularly the use of pointillism, where artists apply small dots of color that blend together when viewed from a distance. Understanding this term requires some knowledge of art history and movements. Key figures include Georges Seurat and Paul Signac. It's not a commonly used term outside of art-related discussions."},"example_sentences":[{"sentence":"The exhibition featured several works of Neo-Impressionism, showcasing the innovative use of color.","translation":"その展覧会では、革新的な色彩の使用法を示す新印象派の作品がいくつか展示されていました。","type":"example","meaning_category":"General"},{"sentence":"Neo-Impressionism artists sought to create a more systematic and scientific approach to painting compared to their Impressionist predecessors.","translation":"新印象派の芸術家は、印象派の先駆者と比較して、絵画に対するより体系的かつ科学的なアプローチを創造しようとしました。","type":"example","meaning_category":"Characteristics"},{"sentence":"Pointillism is a defining technique of Neo-Impressionism, characterized by the application of small, distinct dots of color.","translation":"点描は新印象派を定義する技法であり、小さく明確な色の点を適用することを特徴としています。","type":"example","meaning_category":"Technique"}]}