{"word":"pioted","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(slang, humorous) to be extremely drunk or intoxicated.","english_definition":"(slang, humorous) to be extremely drunk or intoxicated. This is a made-up word, likely a humorous alteration of 'pissed' or 'plastered'.","examples":[{"sentence":"After the party, he was completely pioted and couldn't even stand up.","translation":"パーティーの後、彼は完全に酔っ払って、立ち上がることさえできませんでした。"},{"sentence":"They got absolutely pioted at the bar last night.","translation":"彼らは昨夜、バーで完全に酔っ払いました。"}],"collocations":["get pioted","completely pioted","absolutely pioted"],"synonyms":["drunk","intoxicated","pissed","plastered","hammered","wasted","smashed","blotto"],"antonyms":["sober"],"notes":"This word is not standard English and is used humorously. It is likely a blend of other slang terms for being drunk."}],"etymology":{"value":"Likely a humorous blend of other slang terms for being drunk, such as 'pissed' or 'plastered'. There is no established etymology.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈpaɪətɪd/","syllables":"pi-o-ted"},"inflection":{"verb_forms":{"present_simple":["piot","piots"],"past_simple":"pioted","past_participle":"pioted","present_participle":"pioting"}},"usage_notes":{"explanation":"'Pioted' is a slang term, not found in standard dictionaries. It is used humorously to describe someone who is extremely drunk. Use with caution as it is not widely recognized.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He pioted the vase.","correct":"✓ He got pioted.","note":"'Pioted' is generally used as an intransitive verb (i.e., it doesn't take a direct object). It describes the state of being drunk, not an action performed on something else."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not a standard word)","frequency_google_ngram":"Very low frequency (likely a neologism or regional slang)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Pioted' is a slang term, likely humorous and not widely recognized. It's used to describe someone who is extremely drunk. Because it's not standard English, it should be used with caution and only in informal contexts where the meaning is clear. It is more likely to be understood if you are speaking to someone familiar with slang."},"example_sentences":[{"sentence":"After a few hours at the pub, he was completely pioted.","translation":"パブで数時間後、彼は完全に酔っ払っていました。","type":"verb","meaning_category":"intoxicated"},{"sentence":"She got absolutely pioted at her birthday party.","translation":"彼女は誕生日パーティーで完全に酔っ払いました。","type":"verb","meaning_category":"intoxicated"}]}