{"word":"Tarheel","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(アメリカ合衆国)ノースカロライナ州の住民、特にノースカロライナ大学チャペルヒル校の学生または卒業生","english_definition":"A resident of North Carolina, especially a student or alumnus of the University of North Carolina at Chapel Hill.","examples":[{"sentence":"He's a proud Tar Heel and always wears Carolina blue.","translation":"彼は誇り高きターヒールであり、いつもカロライナブルーを身につけている。"},{"sentence":"The Tar Heels won the national championship.","translation":"ターヒールズが全米選手権で優勝した。"}],"collocations":["a Tar Heel fan (ターヒールファン)","a Tar Heel basketball game (ターヒールズのバスケットボールの試合)","the Tar Heel state (ターヒールの州、ノースカロライナ州の愛称)"],"synonyms":["North Carolinian"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ノースカロライナ州の、またはノースカロライナ大学チャペルヒル校の","english_definition":"Of or relating to the state of North Carolina or the University of North Carolina at Chapel Hill.","examples":[{"sentence":"The Tar Heel spirit is strong in this town.","translation":"この町ではターヒールの精神が強い。"},{"sentence":"We visited the Tar Heel campus last summer.","translation":"私たちは昨年の夏にターヒールのキャンパスを訪れた。"}],"collocations":["Tar Heel pride (ターヒールの誇り)","Tar Heel tradition (ターヒールの伝統)"],"synonyms":["North Carolinian"],"antonyms":[]}],"etymology":{"value":"語源は諸説あり、はっきりとはわかっていない。有力な説としては、南北戦争中に、ノースカロライナの兵士が戦場で粘り強く戦い、まるで足にタールがついているかのように踏みとどまったことから、他州の兵士が彼らを「ターヒール」と呼んだというものがある。また、ノースカロライナがタール、ピッチ、テレピン油などの林産物の主要な生産地であったことに由来するという説もある。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɑːrhiːl/","syllables":"Tar-heel"},"inflection":{"notes":"名詞の複数形は Tar Heels"},"usage_notes":{"explanation":"「**Tar Heel**」は、主にノースカロライナ州民、特にノースカロライナ大学チャペルヒル校（UNC）の学生や卒業生を指す言葉です。UNCのスポーツチームの愛称としても使われ、特にバスケットボールチームは非常に有名です。ノースカロライナ州の愛称としても用いられます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Tarheeler from South Carolina.","correct":"✓ He is a Tar Heel from North Carolina.","note":"Tar Heel はノースカロライナ州民を指す言葉であり、サウスカロライナ州民には使いません。"},{"incorrect":"✗ She studies at Tar Heel University.","correct":"✓ She studies at the University of North Carolina at Chapel Hill.","note":"Tar Heel University という名前の大学はありません。ノースカロライナ大学チャペルヒル校を指す場合は、University of North Carolina at Chapel Hill と正式名称を使うか、略して UNC と言うのが一般的です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2 (地域特有の言葉のため、一般的な英語学習者には馴染みが薄い)","frequency_google_ngram":"中頻度 (地域的な言葉のため、一般的な英語に比べると頻度は低い)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"「**Tar Heel**」は、アメリカ合衆国ノースカロライナ州に関連する言葉で、特にノースカロライナ大学チャペルヒル校の学生や卒業生を指します。また、ノースカロライナ州民の愛称としても使われます。一般的な英語学習者には馴染みが薄いかもしれませんが、アメリカの大学スポーツやノースカロライナ州の文化について学ぶ際には重要な単語です。語源は諸説ありますが、南北戦争中のノースカロライナ兵の勇敢さや、同州が林産物の主要な生産地であったことに由来すると言われています。"},"example_sentences":[{"sentence":"The **Tar Heels** have a long and storied basketball history.","translation":"ターヒールズには長く輝かしいバスケットボールの歴史がある。","type":"noun","meaning_category":"ノースカロライナ大学チャペルヒル校のスポーツチーム"},{"sentence":"As a **Tar Heel**, she is passionate about supporting local businesses.","translation":"ターヒールとして、彼女は地元の企業を支援することに情熱を注いでいる。","type":"noun","meaning_category":"ノースカロライナ州民"},{"sentence":"The **Tar Heel** state is known for its beautiful beaches and mountains.","translation":"ターヒールの州は、美しいビーチと山々で知られている。","type":"adjective","meaning_category":"ノースカロライナ州の"}]}