{"word":"double-bodied","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"二つの体を持つ、または二つの体のように見える","english_definition":"Having two bodies or appearing to have two bodies.","examples":[{"sentence":"The mythical creature was described as double-bodied, with a lion's head at each end.","translation":"その神話上の生き物は、両端にライオンの頭を持つ二つの体を持つと記述されていました。"},{"sentence":"The double-bodied spacecraft was designed for deep-space exploration.","translation":"その二つの体を持つ宇宙船は、深宇宙探査のために設計されました。"}],"collocations":["double-bodied spacecraft","double-bodied creature","double-bodied design"],"synonyms":["bi-corporeal","two-bodied"],"antonyms":["single-bodied"]},{"part_of_speech":"adjective","definition":"（昆虫学で）腹部が二つの部分に分かれている","english_definition":"(Entomology) Having the abdomen divided into two distinct parts.","examples":[{"sentence":"The double-bodied wasp is a rare species found in tropical regions.","translation":"その腹部が二つに分かれているハチは、熱帯地域で見られる珍しい種です。"}],"collocations":["double-bodied wasp","double-bodied ant"],"synonyms":["segmented abdomen"],"antonyms":["single-bodied abdomen"]}],"etymology":{"value":"'Double' (二重の) + 'bodied' (体を持つ)","priority":"N/A"},"pronunciation":{"ipa":"/ˌdʌbəlˈbɒdid/","syllables":"dou-ble-bod-ied"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'double-bodied' is relatively rare and often used in specific contexts such as mythology, science fiction, or entomology. In mythology and science fiction, it describes creatures or objects with two distinct bodies or body-like structures. In entomology, it refers to insects with a segmented abdomen that appears as two separate parts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The double body creature was scary.","correct":"✓ The double-bodied creature was scary.","note":"Hyphenate 'double-bodied' when used as a compound adjective before a noun."}],"priority":"N/A"},"related_words":{"derivatives":["double","body"],"related_terms":["Siamese twins (結合双生児)","bicephalous (二頭の)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Double-bodied' is a specialized term primarily used in descriptive contexts related to mythical creatures, scientific designs, or entomology. It implies the presence of two distinct physical bodies or a body structure that appears as two separate entities. Understanding the context is crucial for accurate interpretation, as its usage is not common in everyday language."},"example_sentences":[{"sentence":"The artist depicted the alien as a double-bodied being with extraordinary powers.","translation":"そのアーティストは、そのエイリアンを並外れた力を持つ二つの体を持つ存在として描いた。","type":"general","meaning_category":"Mythology/Science Fiction"},{"sentence":"The entomologist identified the insect as a double-bodied species due to its unique abdominal structure.","translation":"その昆虫学者は、その昆虫を独特の腹部の構造から、腹部が二つに分かれている種であると特定した。","type":"specific","meaning_category":"Entomology"}]}