{"word":"thematically","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"テーマ的に、主題的に、主題に関して","english_definition":"with regard to themes or subjects; in terms of themes.","examples":[{"sentence":"The film is thematically complex, exploring issues of identity and belonging.","translation":"その映画はテーマ的に複雑で、アイデンティティと帰属意識の問題を探求している。"},{"sentence":"The exhibition is organized thematically, with each room focusing on a different aspect of the artist's work.","translation":"展覧会はテーマ別に構成されており、各部屋がアーティストの作品の異なる側面に焦点を当てている。"},{"sentence":"The novels are thematically linked by their exploration of social injustice.","translation":"これらの小説は、社会的不正の探求という点でテーマ的に関連付けられている。"}],"collocations":["thematically related","thematically organized","thematically similar","thematically consistent","thematically diverse","thematically connected"],"synonyms":["subjectively","conceptually","topically","ideologically"],"antonyms":["formally","structurally","chronologically"]}],"etymology":{"value":"\"thematic\" + \"-ally\". \"Thematic\" comes from Greek \"thema\" (subject, proposition).","priority":"★★★"},"pronunciation":{"ipa":"/θiˈmætɪkli/","syllables":"the-mat-i-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Thematically' is used to describe how something relates to or is organized around a central theme or subject. It's often used in discussions of art, literature, film, and other cultural works to analyze the underlying ideas and messages. It indicates that the connection or organization is based on shared themes rather than other factors like chronology or structure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Thematically, the movie was good, but the actors weren't.","correct":"✓ Thematically, the movie was good, but the acting wasn't.","note":"'Thematically' refers to the themes or subjects explored in a work. 'Acting' is more appropriate than 'actors' when discussing the quality of the performance."},{"incorrect":"✗ He spoke thematically about the importance of education.","correct":"✓ He spoke thematically about the importance of education, focusing on the key ideas and messages.","note":"While grammatically correct, 'thematically' implies a structured discussion of themes. Adding context clarifies the specific way in which the speaker addressed the topic."}],"priority":"★★☆"},"related_words":{"derivatives":["theme","thematic","theme song","thematize"],"phrases":["thematic analysis","thematic map","thematic unit"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in academic and critical writing.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'thematically' is used to describe something that is related to or organized by themes. It's often found in discussions about literature, art, and film, where people analyze the underlying ideas and messages. For example, a museum exhibition might be 'thematically organized,' meaning that the exhibits are grouped by subject or idea rather than by date or style. It's a more advanced word, so you'll typically see it in more complex texts and discussions."},"example_sentences":[{"sentence":"The artist's works are thematically linked by their exploration of nature.","translation":"そのアーティストの作品は、自然の探求という点でテーマ的に関連付けられている。","type":"general"},{"sentence":"The conference was thematically divided into sessions on sustainability, innovation, and social impact.","translation":"会議は、持続可能性、イノベーション、社会的影響に関するセッションにテーマ別に分けられた。","type":"general"},{"sentence":"The novel is thematically rich, dealing with issues of love, loss, and redemption.","translation":"その小説はテーマ的に豊かで、愛、喪失、そして贖罪の問題を扱っている。","type":"literature"},{"sentence":"The film's score is thematically tied to the protagonist's emotional journey.","translation":"その映画の音楽は、主人公の感情的な旅とテーマ的に結びついている。","type":"film"},{"sentence":"The curriculum is thematically designed to integrate different subjects.","translation":"カリキュラムは、異なる科目を統合するようにテーマ別に設計されている。","type":"education"}]}