{"word":"RN","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"Registered Nurse (正看護師)","english_definition":"A licensed health care professional who provides a wide range of patient care services, including administering medications, monitoring patients, educating patients and families, and coordinating care with other members of the health care team.","examples":[{"sentence":"She is an RN at the local hospital.","translation":"彼女は地元の病院で正看護師をしています。"},{"sentence":"The RN took my blood pressure and asked about my symptoms.","translation":"正看護師が私の血圧を測り、症状について尋ねました。"},{"sentence":"Becoming an RN requires completing a nursing program and passing a licensing exam.","translation":"正看護師になるには、看護プログラムを修了し、免許試験に合格する必要があります。"}],"collocations":["RN license","RN program","RN duties","RN responsibilities","travel RN","charge RN"],"synonyms":["registered nurse","nurse"],"antonyms":[],"related_terms":["LPN (Licensed Practical Nurse)","CNA (Certified Nursing Assistant)","BSN (Bachelor of Science in Nursing)","MSN (Master of Science in Nursing)"]}],"etymology":{"value":"An abbreviation for 'Registered Nurse'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɑːr ˈɛn/","syllables":"Ar-En"},"inflection":{"noun_plural":"RNs"},"usage_notes":{"explanation":"RN is a common abbreviation used in healthcare settings to refer to a Registered Nurse. It is widely understood and accepted in both spoken and written communication. It is important to note that the requirements and scope of practice for RNs may vary depending on the country or region.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"She is a RN nurse.","correct":"She is an RN.","note":"It is redundant to say 'RN nurse' because RN already stands for Registered Nurse."},{"incorrect":"He wants to be a RN when he grows up.","correct":"He wants to be an RN when he grows up.","note":"Use 'an' before RN because it starts with a vowel sound."}],"priority":"★★☆"},"related_words":{"acronyms":["BSN","MSN","LPN","CNA"],"professions":["physician","therapist","pharmacist","medical assistant"]},"level_frequency":{"level":"B2","frequency_google_ngram":"Common in medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term 'RN' is an abbreviation for 'Registered Nurse', a healthcare professional. It is commonly used in medical and professional settings. Understanding this abbreviation is important for anyone working in or interacting with the healthcare system. The term itself is not complex, but understanding the role and responsibilities of an RN requires more in-depth knowledge of the healthcare field."},"example_sentences":[{"sentence":"The doctor consulted with the RN about the patient's medication.","translation":"医師は患者の薬について正看護師に相談しました。","type":"noun","meaning_category":"healthcare"},{"sentence":"The RN provided compassionate care to the elderly patient.","translation":"正看護師は高齢の患者に思いやりのあるケアを提供しました。","type":"noun","meaning_category":"healthcare"},{"sentence":"She decided to pursue a career as an RN after volunteering at a hospital.","translation":"彼女は病院でボランティアをした後、正看護師としてのキャリアを追求することを決意しました。","type":"noun","meaning_category":"career"}]}