{"word":"metroscope","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A device for precisely measuring lengths, especially for calibrating or inspecting gauges and other measuring instruments.","english_definition":"An instrument for precise measurement of lengths, especially for calibrating or inspecting gauges and other measuring instruments.","examples":[{"sentence":"The metroscope is used in manufacturing to ensure parts meet exact specifications.","translation":"メトロスコープは、部品が正確な仕様を満たしていることを保証するために製造で使用されます。"},{"sentence":"The engineer calibrated the gauge using a metroscope.","translation":"エンジニアはメトロスコープを使用してゲージを校正しました。"}],"collocations":["use a metroscope","calibrate with a metroscope","precision metroscope","digital metroscope"],"synonyms":["length measuring instrument","precision measuring device","calibration instrument"],"antonyms":[]}],"etymology":{"value":"Derived from 'metro-' (referring to measurement) and '-scope' (an instrument for viewing or observing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɛtrəˌskoʊp/","syllables":"me-tro-scope"},"inflection":{"noun_plural":"metroscopes"},"usage_notes":{"explanation":"A metroscope is a specialized measuring instrument typically found in engineering and manufacturing settings. It is used where high precision and accuracy are required in length measurements.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a microscope to measure the length.","correct":"✓ He used a metroscope to measure the length.","note":"A microscope is for viewing very small objects, while a metroscope is for precisely measuring lengths."}],"priority":"★☆☆"},"related_words":{"derivatives":["metrology (the science of measurement)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'metroscope' is a technical term used in specialized fields such as engineering and manufacturing. Understanding its use requires familiarity with precise measurement and calibration processes. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The quality control department relies on the metroscope for accurate measurements.","translation":"品質管理部門は、正確な測定のためにメトロスコープに依存しています。","type":"noun","meaning_category":"measuring instrument"},{"sentence":"The technician adjusted the metroscope before starting the calibration process.","translation":"技術者は、校正プロセスを開始する前にメトロスコープを調整しました。","type":"noun","meaning_category":"measuring instrument"}]}