{"word":"unmarinated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"マリネされていない、下味が付いていない","english_definition":"not marinated; not soaked in a marinade.","examples":[{"sentence":"I prefer my steak unmarinated so I can taste the natural flavor of the beef.","translation":"牛肉本来の味を味わいたいので、ステーキはマリネされていないものが好きです。"},{"sentence":"The recipe calls for unmarinated chicken breasts.","translation":"レシピには、マリネされていない鶏むね肉を使うように書かれています。"},{"sentence":"She grilled the unmarinated vegetables with just a sprinkle of salt and pepper.","translation":"彼女はマリネされていない野菜を、塩とコショウを少し振っただけで焼きました。"}],"collocations":["unmarinated chicken","unmarinated beef","unmarinated tofu","unmarinated vegetables"],"synonyms":["plain","untreated","unseasoned"],"antonyms":["marinated","seasoned","flavored"]}],"etymology":{"value":"The word 'unmarinated' is formed by adding the prefix 'un-' (meaning 'not') to the word 'marinated'. 'Marinated' itself comes from the verb 'marinate,' which refers to the process of soaking food in a marinade.","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnˈmærɪneɪtɪd/","syllables":"un-mar-i-nat-ed"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns."},"usage_notes":{"explanation":"'Unmarinated' is used to describe food that has not undergone the marinating process. It is often used in contrast to 'marinated' to specify that the food is in its natural state or has not been treated with a marinade.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unmarinated is better.","correct":"✓ The unmarinated chicken is better.","note":"'Unmarinated' is an adjective and needs to be used with a noun to describe what is unmarinated."},{"incorrect":"✗ I unmarinated the chicken.","correct":"✓ I cooked the chicken unmarinated.","note":"'Unmarinated' is an adjective, not a verb. You can't 'unmarinate' something. You can cook something unmarinated."}],"priority":"★★☆"},"related_words":{"derivatives":["marinate (verb)","marinade (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'unmarinated' is relatively straightforward. It simply means that something has not been marinated. Marinating involves soaking food in a sauce or liquid mixture to add flavor or tenderize it. Therefore, 'unmarinated' describes food that has not undergone this process. It's commonly used in cooking contexts to specify that a particular ingredient should be used in its plain or natural state, without any prior flavoring from a marinade."},"example_sentences":[{"sentence":"She chose to grill the chicken unmarinated to control the sodium content.","translation":"彼女はナトリウムの量を調整するために、鶏肉をマリネせずに焼くことにしました。","type":"adjective","meaning_category":"not marinated"},{"sentence":"The chef recommended using high-quality, unmarinated fish for the sushi.","translation":"シェフは、寿司には高品質でマリネされていない魚を使うことを勧めました。","type":"adjective","meaning_category":"not marinated"},{"sentence":"For a simple salad, use unmarinated tofu cubes.","translation":"シンプルなサラダには、マリネされていない豆腐の角切りを使ってください。","type":"adjective","meaning_category":"not marinated"}]}