{"word":"pneumatophanic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"霊が現れた、霊の出現に関する","english_definition":"Relating to or characterized by the appearance or manifestation of a spirit or supernatural being.","examples":[{"sentence":"The church was said to be the site of a pneumatophanic event, with many witnesses claiming to have seen an apparition.","translation":"その教会は霊が現れる場所だと言われており、多くの目撃者が幻影を見たと主張している。"},{"sentence":"The artist's work explored pneumatophanic themes, depicting ethereal figures emerging from the mist.","translation":"その芸術家の作品は、霧の中から現れる幽玄な姿を描き、霊の出現に関するテーマを探求した。"}],"collocations":["pneumatophanic event","pneumatophanic vision","pneumatophanic experience"],"synonyms":["spiritual","supernatural","spectral","ethereal","ghostly"],"antonyms":["natural","physical","corporeal"]}],"etymology":{"value":"Derived from the Greek words 'pneuma' (πνεῦμα) meaning 'spirit' or 'breath' and 'phanein' (φαίνειν) meaning 'to show' or 'to appear'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnjuːmætəˈfænɪk/","syllables":"pneu-ma-to-phan-ic"},"inflection":{"notes":"This word is primarily used as an adjective and does not have common inflections."},"usage_notes":{"explanation":"The term 'pneumatophanic' is relatively rare and specialized, primarily used in religious, theological, or artistic contexts to describe phenomena related to the manifestation of spirits or supernatural entities. It is often used to lend a formal or academic tone to discussions of such events.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pneumatophanic energy filled the room.","correct":"✓ The pneumatophanic event filled the room with a sense of awe.","note":"'Pneumatophanic' describes the event or experience of a spirit appearing, not the energy itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["pneumatophany (noun): The appearance or manifestation of a spirit or supernatural being."],"related_terms":["apparition","specter","ghost","manifestation","theophany (the appearance of a god)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. This is a specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pneumatophanic' is a sophisticated term used to describe events or experiences involving the appearance of spirits or supernatural beings. Due to its specialized nature and etymological roots in Greek, it is not commonly encountered in everyday language and is more likely to appear in academic, theological, or artistic discussions. Understanding the term requires familiarity with concepts of spirituality and the supernatural. "},"example_sentences":[{"sentence":"The ancient text described a pneumatophanic encounter with an angel.","translation":"古代のテキストには、天使との霊の出現に関する出会いが記述されていた。","type":"adjective","meaning_category":"霊の出現に関する"},{"sentence":"The film depicted a pneumatophanic scene, with translucent figures floating across the screen.","translation":"その映画は、半透明の人物がスクリーンを漂う、霊が現れるシーンを描写した。","type":"adjective","meaning_category":"霊が現れた"}]}