{"word":"communism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"共産主義","english_definition":"a political theory advocating class war and leading to a society in which all property is publicly owned and each person works and is paid according to their abilities and needs.","examples":[{"sentence":"Communism was the dominant ideology in the Soviet Union.","translation":"共産主義はソビエト連邦における支配的なイデオロギーでした。"},{"sentence":"The fall of the Berlin Wall marked a significant decline in communism's influence.","translation":"ベルリンの壁の崩壊は、共産主義の影響力の著しい低下を示しました。"},{"sentence":"Some argue that true communism has never been achieved in practice.","translation":"真の共産主義は実際には達成されたことがないと主張する人もいます。"}],"collocations":["communist state (共産主義国家)","communist party (共産党)","the fall of communism (共産主義の崩壊)","Marxist communism (マルクス主義共産主義)"],"synonyms":["Marxism","socialism","collectivism","totalitarianism"],"antonyms":["capitalism","democracy","individualism"]},{"part_of_speech":"noun","definition":"共産主義体制","english_definition":"a system of social organization in which all economic and social activity is controlled by a totalitarian state dominated by a single and self-perpetuating political party.","examples":[{"sentence":"Life under communism could be very difficult.","translation":"共産主義体制下での生活は非常に困難なものでした。"},{"sentence":"The transition from communism to capitalism was a complex process.","translation":"共産主義から資本主義への移行は複雑なプロセスでした。"}],"collocations":["under communism (共産主義体制下で)","transition from communism (共産主義からの移行)"],"synonyms":["totalitarianism","authoritarianism","state socialism"],"antonyms":["free market economy","liberal democracy"]}],"etymology":{"value":"Derived from the French word 'communisme,' first used in the 1840s to describe a political and social system based on communal ownership. The term is related to 'commune,' meaning a collective or local self-governing community.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒmjʊnɪzəm/","syllables":"com-mu-nism"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"Communism is a complex and often misunderstood political ideology. In theory, it envisions a stateless, classless society where resources are distributed based on need. However, in practice, communist states have often been authoritarian, with the government controlling all aspects of life. The term is often used pejoratively, but it's important to understand its theoretical underpinnings and historical manifestations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a communist, so he must be evil.","correct":"✓ Some people associate communism with authoritarian regimes, but it's important to understand the nuances of the ideology.","note":"Avoid making generalizations about individuals based solely on their political beliefs. Communism is a complex ideology, and individuals may have varying interpretations of it."},{"incorrect":"✗ Communism is the same as socialism.","correct":"✓ Communism and socialism are related but distinct ideologies. Communism advocates for a stateless, classless society, while socialism allows for some degree of private ownership and market activity.","note":"While both ideologies advocate for social equality, they differ in their approaches and goals."}],"priority":"★★☆"},"related_words":{"derivatives":["communist (noun, adjective)","communal (adjective)","commune (noun)","communistic (adjective)"],"idioms_phrases":["Red Scare (赤狩り)","Iron Curtain (鉄のカーテン)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively frequent in historical and political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Communism' is a complex political and economic ideology that advocates for a classless society where the means of production are owned and controlled collectively. It's often associated with historical regimes that implemented authoritarian control in the name of communism. Understanding the term requires familiarity with political theory and historical context. It's important to distinguish between the theoretical ideals of communism and its practical implementations, which have often deviated significantly from the original vision."},"example_sentences":[{"sentence":"The government nationalized several industries in an attempt to move towards **communism**.","translation":"政府は共産主義への移行を試みるために、いくつかの産業を国有化しました。","type":"noun","meaning_category":"共産主義"},{"sentence":"The **communist** party held power for over 70 years.","translation":"共産党は70年以上にわたって権力を握っていました。","type":"related adjective","meaning_category":"共産主義の"},{"sentence":"Many people fled the country to escape the oppressive **communist** regime.","translation":"多くの人々が抑圧的な共産主義体制から逃れるために国を逃れました。","type":"related adjective","meaning_category":"共産主義の"},{"sentence":"The ideals of **communism** are based on the principles of equality and collective ownership.","translation":"共産主義の理想は、平等と集団所有の原則に基づいています。","type":"noun","meaning_category":"共産主義"}]}