{"word":"socionomics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"社会変動経済学：社会的な気分が経済、政治、文化などの社会現象を左右するという社会科学の理論。","english_definition":"A social science theory that claims that social mood drives social events, including economics, politics, and culture.","examples":[{"sentence":"Socionomics suggests that stock market trends are driven by changes in social mood.","translation":"社会変動経済学は、株式市場のトレンドが社会的な気分の変化によって左右されると示唆しています。"},{"sentence":"According to socionomics, social mood is endogenous and regulates social action.","translation":"社会変動経済学によれば、社会的な気分は内生的なものであり、社会的な行動を規制します。"}],"collocations":["social mood","stock market","financial markets","endogenous"],"synonyms":["behavioral economics","social psychology"],"antonyms":[]}],"etymology":{"value":"「socio-」（社会の）と「economics」（経済学）の組み合わせ。","priority":"★★★"},"pronunciation":{"ipa":"/ˌsoʊsiəˈnɒmɪks/","syllables":"so-ci-o-nom-ics"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"Socionomics is a controversial theory and is not widely accepted by mainstream economists. It posits that social mood, which is often unconscious and herding behavior, is the primary driver of social events, rather than rational economic factors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Socionomics is a branch of economy.","correct":"✓ Socionomics is a social science theory.","note":"Socionomics is a theory, not a branch of economics, although it relates to economics. It's considered a social science theory."}],"priority":"★★★"},"related_words":{"derivatives":["socionomic (形容詞)"],"phrases":["socionomic theory","socionomic analysis"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Socionomics is an advanced concept that suggests social mood, rather than traditional economic factors, drives economic and social trends. It's often discussed in academic or specialized financial contexts. Understanding requires familiarity with both sociology and economics.","priority":"★★☆"},"example_sentences":[{"sentence":"Some investors use socionomics to predict market movements.","translation":"一部の投資家は、社会変動経済学を使って市場の動きを予測します。","type":"general","meaning_category":"理論の応用"},{"sentence":"Critics of socionomics argue that it lacks empirical support.","translation":"社会変動経済学の批判者たちは、経験的な裏付けが不足していると主張します。","type":"general","meaning_category":"理論の批判"},{"sentence":"The principles of socionomics challenge conventional economic thinking.","translation":"社会変動経済学の原則は、従来の経済的思考に挑戦します。","type":"general","meaning_category":"理論の概要"}]}