{"word":"Marginating","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"(細胞などが)血管壁に沿って移動し、付着すること","english_definition":"(of cells, especially leukocytes) to move to the periphery of a blood vessel and adhere to the vessel wall.","examples":[{"sentence":"Leukocytes marginate along the endothelial lining of blood vessels during inflammation.","translation":"炎症の間、白血球は血管の内皮に沿って辺縁化する。"},{"sentence":"The marginating pool of neutrophils is readily available to respond to infection.","translation":"好中球の辺縁化プールは感染症に対応するためにすぐに利用できる。"}],"collocations":["leukocyte marginating","neutrophil marginating","marginating pool"],"synonyms":["adhering","pavementing"],"antonyms":["circulating"],"notes":"Often used in the context of immunology and hematology."}],"etymology":{"value":"Derived from 'margin,' referring to the edge or periphery.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɑːrdʒɪneɪtɪŋ/","syllables":"Mar-gin-at-ing"},"inflection":{"verb_forms":{"present_participle":"marginating","gerund":"marginating"}},"usage_notes":{"explanation":"'Marginating' specifically describes the process where cells, particularly leukocytes (white blood cells), move from the central flow of blood to the edges of the blood vessel and adhere to the vessel wall. This is a crucial step in the inflammatory response, allowing immune cells to exit the bloodstream and migrate into tissues to fight infection or injury.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The blood is marginating.","correct":"The leukocytes are marginating.","note":"'Marginating' refers to specific cells, not the blood itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["margination (noun)"],"related_terms":["diapedesis","extravasation","leukocyte adhesion cascade"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Marginating' is a specialized term used in biology and medicine, specifically in the fields of immunology and hematology. It describes the process by which cells, particularly leukocytes (white blood cells), move from the central flow of blood to the periphery of a blood vessel and adhere to the vessel wall. This process is essential for the immune system to function properly, allowing immune cells to leave the bloodstream and enter tissues to fight infection or injury. Understanding this term requires a background in biology and medicine."},"example_sentences":[{"sentence":"During inflammation, neutrophils begin **marginating** along the blood vessel walls.","translation":"炎症の間、好中球は血管壁に沿って辺縁化し始める。","type":"verb","meaning_category":"cell adhesion"},{"sentence":"The **marginating** leukocytes are ready to migrate into the infected tissue.","translation":"辺縁化している白血球は感染した組織に移動する準備ができている。","type":"adjective (participle)","meaning_category":"cell adhesion"}]}