{"word":"coinvestigators","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"共同研究者（複数形）","english_definition":"plural form of coinvestigator: individuals who collaborate on a research project or investigation.","examples":[{"sentence":"The project involved several coinvestigators from different universities.","translation":"そのプロジェクトには、異なる大学からの数名の共同研究者が関わっていた。"},{"sentence":"The coinvestigators met weekly to discuss the progress of the study.","translation":"共同研究者たちは、研究の進捗状況について議論するために毎週会合を開いた。"}],"collocations":["lead coinvestigator (主任共同研究者)","primary coinvestigator (主要な共同研究者)","senior coinvestigator (上級共同研究者)","junior coinvestigator (若手共同研究者)"],"synonyms":["collaborators","research partners","team members"],"antonyms":["principal investigator (単独研究者)"],"notes":"Usually used in the context of scientific, medical, or academic research."}],"etymology":{"value":"The word is formed by combining the prefix 'co-' (meaning 'together' or 'jointly') with 'investigators', indicating individuals working together on an investigation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊɪnˈvɛstɪˌɡeɪtərz/","syllables":"co-in-ves-ti-ga-tors"},"inflection":{"noun_plural":"coinvestigators"},"usage_notes":{"explanation":"'Coinvestigators' refers to multiple individuals who share responsibility and contribute to a research project or investigation. They work under the direction of a principal investigator (PI) or lead investigator but have significant roles in the study design, data collection, analysis, and reporting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a coinvestigator in the project.","correct":"✓ He is a coinvestigator on the project.","note":"The correct preposition to use is 'on' when referring to working on a project."},{"incorrect":"✗ The coinvestigator's role are important.","correct":"✓ The coinvestigators' roles are important.","note":"Ensure subject-verb agreement when using the plural form. Also, use the possessive apostrophe correctly."}],"priority":"★★☆"},"related_words":{"derivatives":["coinvestigator (singular form)","investigator","investigation","co-investigation"],"phrases":["principal investigator","research team","collaborative research"],"priority":"★★☆"},"level_frequency":{"level":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic and research contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Coinvestigators' is a term mainly used in academic and research settings to describe individuals who are working together on a research project. These individuals share responsibilities and contribute to various aspects of the study, such as design, data collection, and analysis. The term implies a collaborative effort, where multiple researchers contribute their expertise to achieve the project's objectives. It is important to understand that coinvestigators are not the lead researchers (principal investigators) but play significant supporting roles.","priority":"★★☆"},"example_sentences":[{"sentence":"The National Institutes of Health funded the study, which included three coinvestigators.","translation":"米国国立衛生研究所はその研究に資金を提供し、3名の共同研究者が含まれていた。","type":"general","meaning_category":"research project"},{"sentence":"As coinvestigators, they were responsible for data analysis and interpretation.","translation":"共同研究者として、彼らはデータ分析と解釈を担当していた。","type":"general","meaning_category":"research roles"},{"sentence":"The lead researcher acknowledged the contributions of all the coinvestigators in the published paper.","translation":"主任研究者は、発表された論文の中で全ての共同研究者の貢献を認めた。","type":"general","meaning_category":"acknowledgement"}]}