{"word":"Thespis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"テスピス：古代ギリシアの詩人。演劇の創始者の一人とされる。","english_definition":"Thespis: An ancient Greek poet, considered the originator of tragedy. He is said to have introduced the first actor separate from the chorus.","examples":[{"sentence":"Thespis is credited with inventing the role of the actor.","translation":"テスピスは役者の役割を発明したとされている。"},{"sentence":"Before Thespis, plays consisted only of choral performances.","translation":"テスピス以前は、劇は合唱パフォーマンスのみで構成されていた。"}],"collocations":["Thespis' cart","Thespis and tragedy","Thespis - father of tragedy"],"synonyms":["father of tragedy","first actor"],"antonyms":[]},{"part_of_speech":"noun","definition":"俳優、役者 (Thespisに由来する婉曲表現)","english_definition":"An actor or actress (euphemistic, derived from Thespis).","examples":[{"sentence":"She is a Thespis at heart, always performing.","translation":"彼女は根っからの役者で、いつも演技をしている。"},{"sentence":"The Thespis in the play was very talented.","translation":"劇中の役者はとても才能があった。"}],"collocations":["a Thespis at heart","talented Thespis"],"synonyms":["actor","actress","player"],"antonyms":[]}],"etymology":{"value":"The name Thespis comes from the ancient Greek poet of the same name, who is considered the first actor to step out of the chorus in a play.","priority":"★★★"},"pronunciation":{"ipa":"/ˈθɛspɪs/","syllables":"Thes-pis"},"inflection":{"notes":"単数形"},"usage_notes":{"explanation":"The name Thespis is primarily used to refer to the historical figure credited with being the first actor. However, it can also be used as a metaphorical or euphemistic term for an actor or actress, particularly in contexts where a sense of theatrical tradition or history is being invoked. The use of 'Thespis' to mean 'actor' is less common than the direct reference to the historical figure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Thespis was a play.","correct":"✓ Thespis was a person who created plays.","note":"Thespis was a person, not a play itself."},{"incorrect":"✗ He is a Thespis, so he writes plays.","correct":"✓ He is a Thespis, so he acts in plays.","note":"Thespis refers to an actor, not necessarily a playwright."}],"priority":"★☆☆"},"related_words":{"derivatives":["thespian (adjective: relating to drama or acting; noun: an actor or actress)","thespians (plural noun: actors or actresses)"],"phrases":["Thespis' cart"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Thespis' is a proper noun referring to a specific historical figure, an ancient Greek poet and actor. Its usage is generally limited to discussions of the history of theatre or in metaphorical contexts where 'Thespis' is used as a synonym for 'actor' or 'actress,' often implying a deep connection to theatrical tradition. Understanding requires knowledge of theatre history.","priority":"★☆☆"},"example_sentences":[{"sentence":"Thespis introduced the prologue and dialogue to Greek drama.","translation":"テスピスはギリシャ劇にプロローグと対話を導入した。","type":"noun","meaning_category":"historical figure"},{"sentence":"He considers himself a Thespis, always seeking the spotlight.","translation":"彼は自分自身を役者だと思っており、常に脚光を浴びようとしている。","type":"noun","meaning_category":"actor (metaphorical)"}]}