{"word":"galvanoplastic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"電気めっきの、電気鋳造の","english_definition":"Relating to or produced by electrodeposition, especially for making copies of objects.","examples":[{"sentence":"The museum displayed a galvanoplastic replica of the ancient artifact.","translation":"博物館では、古代の工芸品の電気鋳造レプリカが展示されていました。"},{"sentence":"Galvanoplastic techniques are used in the creation of detailed metal parts.","translation":"電気めっき技術は、詳細な金属部品の製造に使用されています。"}],"collocations":["galvanoplastic process","galvanoplastic replica","galvanoplastic coating"],"synonyms":["electroplated","electroformed","electrodeposited"],"antonyms":[]}],"etymology":{"value":"\"Galvano-\" (electricity) + \"plastic\" (capable of being shaped or molded). Coined in the 19th century when the process was developed.","priority":"★★☆"},"pronunciation":{"ipa":"/ɡælˌvænoʊˈplæstɪk/","syllables":"gal-va-no-plas-tic"},"inflection":{"notes":"Adjective; no plural form."},"usage_notes":{"explanation":"\"Galvanoplastic\" refers specifically to the process of electrodeposition to create a replica or coating on an object. It's often used in art, manufacturing, and conservation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sculpture was made of galvanoplastic.","correct":"✓ The sculpture was made using galvanoplastic techniques.","note":"Galvanoplastic is a process, not a material itself. The sculpture is made *using* the process."}],"priority":"★☆☆"},"related_words":{"derivatives":["galvanoplasty (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"galvanoplastic\" is a technical term related to electrochemistry and manufacturing. It describes a process where metal is deposited onto a mold or object using electrical current to create a replica or coating. Understanding this term requires familiarity with scientific and industrial contexts. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The jeweler used a galvanoplastic method to create an exact copy of the antique coin.","translation":"宝石商は、古代のコインの正確なコピーを作成するために電気めっき法を使用しました。","type":"adjective","meaning_category":"電気めっきの"},{"sentence":"The galvanoplastic coating protected the metal from corrosion.","translation":"電気めっきコーティングは金属を腐食から保護しました。","type":"adjective","meaning_category":"電気めっきの"}]}