{"word":"Indentee","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"見習い奉公人、年季奉公人","english_definition":"A person bound by indentures to service.","examples":[{"sentence":"The indentee worked for seven years to pay off his passage.","translation":"その年季奉公人は、渡航費を支払うために7年間働いた。"},{"sentence":"Indentured servants were common in the early colonies.","translation":"年季奉公人は初期の植民地では一般的だった。"}],"collocations":["indentured servant","indenture agreement"],"synonyms":["apprentice","bound servant"],"antonyms":["employer","freeman"]}],"etymology":{"value":"The word \"indentee\" comes from \"indenture,\" which refers to a formal agreement or contract. The term originates from the practice of creating duplicate contracts on a single sheet of parchment, which was then torn or cut in an irregular, or indented, line so that each party could prove possession of the true agreement by matching the edges.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪndɛnˈtiː/","syllables":"in-den-tee"},"inflection":{"noun_plural":"indentees"},"usage_notes":{"explanation":"An \"indentee\" is someone who is bound by an indenture, a type of contract, to work for another person for a specified period. This was a common practice historically, particularly in colonial times, where people would agree to work for a certain number of years in exchange for passage to a new country or to pay off debts. The term often carries historical connotations related to forms of coerced labor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an indentee of the company.","correct":"✓ He was an indentee to the company.","note":"The correct preposition is 'to'. An indentee is indentured *to* someone or some entity."},{"incorrect":"✗ Indentee is the act of being indentured.","correct":"✓ Indenture is the act of being indentured.","note":"'Indentee' refers to the person, while 'indenture' refers to the agreement or the state of being bound by such an agreement."}],"priority":"★☆☆"},"related_words":{"derivatives":["indenture (noun, verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"indentee\" refers to an individual who is bound by an indenture, a formal contract, to work for another person for a specific period. This term is most often encountered in historical contexts, particularly when discussing colonial labor practices. Understanding the word requires familiarity with the concept of indentured servitude, which was a system where individuals agreed to work in exchange for passage, debt repayment, or other benefits. The term is not commonly used in modern contexts outside of historical discussions."},"example_sentences":[{"sentence":"Many indentees sought freedom after their terms of service ended.","translation":"多くの年季奉公人は、奉公期間が終わった後に自由を求めた。","type":"noun","meaning_category":"年季奉公人"},{"sentence":"The indentee's contract outlined the terms of his labor and eventual freedom.","translation":"年季奉公人の契約には、彼の労働条件と最終的な自由が明記されていた。","type":"noun","meaning_category":"年季奉公人"}]}