{"word":"Brahmsite","priority":"low","meanings":[{"part_of_speech":"noun","definition":"A high-pressure polymorph of enstatite (MgSiO3) with a perovskite structure, found in shocked meteorites and thought to be a major component of the Earth's lower mantle.","english_definition":"A high-pressure polymorph of enstatite (MgSiO3) with a perovskite structure, found in shocked meteorites and thought to be a major component of the Earth's lower mantle.","examples":[{"sentence":"Brahmsite is an important mineral for understanding the Earth's deep interior.","translation":"ブラームス石は地球深部を理解する上で重要な鉱物です。"}],"collocations":["found in meteorites","lower mantle component"],"synonyms":["perovskite"],"antonyms":[]}],"etymology":{"value":"Named after the German composer Johannes Brahms, reflecting a tradition of naming high-pressure minerals after famous scientists and artists.","priority":"medium"},"pronunciation":{"ipa":"/ˈbrɑːmsaɪt/","syllables":"brahms-ite"},"inflection":{"noun_plural":"Brahmsites"},"usage_notes":{"explanation":"Brahmsite is a technical term used primarily in geology and mineralogy. It refers to a specific mineral with a particular crystal structure and chemical composition. Its significance lies in its presence in meteorites and its potential abundance in the Earth's lower mantle.","priority":"medium"},"common_mistakes":{"examples":[],"priority":"low"},"related_words":{"derivatives":["enstatite","perovskite"],"related_terms":["mineral","polymorph","high-pressure mineral","geology","mineralogy","mantle"],"priority":"medium"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - a specialized term.","priority":"low"},"readability_explanation":{"level":"C2","text":"Brahmsite is a highly specialized term used in the fields of geology and mineralogy. Understanding it requires knowledge of mineral structures, high-pressure mineralogy, and the composition of the Earth's mantle. It is unlikely to be encountered outside of scientific contexts.","priority":"low"},"example_sentences":[{"sentence":"The meteorite contained a significant amount of brahmsite, indicating it had experienced intense shock pressures.","translation":"その隕石はかなりの量のブラームス石を含んでおり、激しい衝撃圧力を受けたことを示しています。","type":"noun","meaning_category":"mineralogy"},{"sentence":"Scientists are studying the properties of brahmsite to better understand the dynamics of the Earth's lower mantle.","translation":"科学者たちは、地球のより下層のマントルのダイナミクスをより良く理解するために、ブラームス石の特性を研究しています。","type":"noun","meaning_category":"geology"}]}