{"word":"Philo-yankee","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"親米家、親米主義者","english_definition":"A person who is fond of or admires the United States and its culture.","examples":[{"sentence":"He was labeled a Philo-yankee because of his admiration for American literature and music.","translation":"彼はアメリカ文学と音楽への賞賛から親米家だとレッテルを貼られた。"},{"sentence":"The political commentator is often described as a Philo-yankee due to his positive views on American foreign policy.","translation":"その政治評論家は、アメリカの外交政策に対する肯定的な見解から、しばしば親米家と評される。"}],"collocations":["strong Philo-yankee sentiments","a known Philo-yankee","Philo-yankee leanings"],"synonyms":["Americanophile","pro-American","Yankeephile"],"antonyms":["Anti-American","Anti-yankee","Yankeephobe"]},{"part_of_speech":"adjective","definition":"親米的な","english_definition":"Having or showing fondness for the United States and its culture.","examples":[{"sentence":"The newspaper is known for its Philo-yankee stance on international affairs.","translation":"その新聞は国際問題に対する親米的な姿勢で知られている。"},{"sentence":"The politician's Philo-yankee speeches often resonate with certain segments of the population.","translation":"その政治家の親米的な演説は、しばしば国民のある層に共鳴する。"}],"collocations":["Philo-yankee attitude","Philo-yankee policy","Philo-yankee perspective"],"synonyms":["Americanophilic","pro-American","Yankeephilic"],"antonyms":["Anti-American","Anti-yankee"]}],"etymology":{"value":"Derived from 'philo-' (Greek for 'love of') + 'Yankee' (a term for a person from the United States, especially from the northern states).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfaɪloʊˈjæŋki/","syllables":"Phi-lo-Yan-kee"},"inflection":{"noun_plural":"Philo-yankees","adjective_forms":{}},"usage_notes":{"explanation":"'Philo-yankee' is used to describe someone who has a strong affinity for the United States, its culture, and its people. The term can be used in a neutral or positive way, but it can also be used pejoratively by those who are critical of the United States. It is the opposite of 'anti-Yankee' or 'anti-American'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Philo-yankee, so he hates all other countries.","correct":"✓ He is a Philo-yankee, so he admires the United States.","note":"Being a Philo-yankee means admiring the United States, not necessarily hating other countries."}],"priority":"★☆☆"},"related_words":{"derivatives":["Philo-Yankeeism (noun: the belief or attitude of being a Philo-yankee)"],"phrases":["Yankee (noun: a person from the United States)","Americanophile (noun: similar meaning to Philo-yankee)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The term is not commonly used in everyday conversation or writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Philo-yankee' is relatively uncommon and is used to describe someone who has a strong positive affinity for the United States and its culture. It is often used in political or cultural discussions to characterize a person's viewpoint or stance. Understanding the term requires familiarity with the prefix 'philo-' (meaning 'love of') and the term 'Yankee' (referring to people from the United States)."},"example_sentences":[{"sentence":"The professor's Philo-yankee views were evident in his lectures on American history.","translation":"その教授の親米的な見解は、アメリカ史に関する講義で明らかだった。","type":"adjective","meaning_category":"親米的な"},{"sentence":"As a Philo-yankee, she enjoyed celebrating American holidays and traditions.","translation":"親米家として、彼女はアメリカの祝日や伝統を祝うことを楽しんだ。","type":"noun","meaning_category":"親米家"}]}