{"word":"Metaldehyde","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"メタアルデヒド (殺虫剤として使用される化合物)","english_definition":"A polymeric form of acetaldehyde used as a molluscicide (slug and snail bait).","examples":[{"sentence":"Metaldehyde is used to control slugs and snails in gardens.","translation":"メタアルデヒドは庭のナメクジやカタツムリの駆除に使用されます。"}],"collocations":["slug bait","snail bait","molluscicide"],"synonyms":["acetaldehyde polymer"],"antonyms":[]}],"etymology":{"value":"Formed from 'metal-' (referring to a metallic element or compound, though not directly applicable here) and 'aldehyde' (referring to the chemical family of compounds). The 'metal' part likely refers to the cyclic tetramer structure.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈtæl.dəˌhaɪd/","syllables":"me-tal-de-hyde"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Metaldehyde is a chemical compound primarily used as a pesticide to control slugs and snails. It is toxic to these mollusks, causing them to dehydrate and die. However, it is also toxic to other animals, including pets and wildlife, so its use requires caution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I sprayed metaldehyde all over my vegetable garden without any protection.","correct":"✓ I used metaldehyde slug pellets sparingly and kept pets away from the treated area.","note":"Metaldehyde is toxic and should be used carefully, following the instructions on the label. Avoid widespread spraying and protect non-target animals."}],"priority":"★☆☆"},"related_words":{"derivatives":["acetaldehyde","aldehyde","pesticide","molluscicide"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Technical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Metaldehyde' is a technical term referring to a specific chemical compound used as a pesticide, particularly for controlling slugs and snails. Due to its specialized nature and limited use outside of scientific or agricultural contexts, it is considered advanced vocabulary. Understanding its properties, uses, and potential risks requires a strong grasp of chemistry and environmental science principles."},"example_sentences":[{"sentence":"The farmer applied **metaldehyde** to protect his crops from slug damage.","translation":"農家はナメクジの被害から作物を守るためにメタアルデヒドを散布した。","type":"noun","meaning_category":"pesticide"},{"sentence":"**Metaldehyde** poisoning can be fatal to dogs and cats.","translation":"メタアルデヒド中毒は犬や猫にとって致命的となる可能性がある。","type":"noun","meaning_category":"toxic compound"}]}