{"word":"Mimpei","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(身分を隠して行う)民間の不正行為、迷惑行為","english_definition":"Illegal or troublesome acts committed by civilians while concealing their identity.","examples":[{"sentence":"近年、巧妙な手口の民事介入暴力、いわゆる「民事介入型不当要求行為（民暴）」、「**民事不介入**」を逆手に取った「**民事型**」の**民事介入暴力**、「**民暴**」と称される不当要求行為が社会問題化しており、警察庁は、これらの行為を「**民事介入暴力**」と定義し、その対策を強化している。","translation":"In recent years, sophisticated forms of civil intervention violence, so-called \"civil intervention-type unjust demands (Minbou),\" and \"civil-type\" civil intervention violence that takes advantage of \"non-intervention in civil matters,\" have become social problems. The National Police Agency defines these acts as \"civil intervention violence\" and is strengthening measures against them."}],"collocations":["民事介入暴力 (minji kainyu bōryoku - civil intervention violence)","民暴 (minbō - abbreviation for civil intervention violence)","民事型 (minji-gata - civil-type)"],"synonyms":["不当要求 (futō yōkyū - unjust demand)","暴力団 (bōryokudan - organized crime group)","恐喝 (kyōkatsu - extortion)"],"antonyms":[]}],"etymology":{"value":"「民」は民間、「事」は事柄、「不」は否定、「介入」は関与を意味する。","priority":"☆☆☆"},"pronunciation":{"ipa":"/mĩmpeː/","syllables":"Mi-m-pei"},"inflection":{"notes":"Japanese nouns are generally not inflected for number or gender."},"usage_notes":{"explanation":"「民事不介入」の原則を悪用し、民事事件に紛れて不当な要求や暴力行為を行うことを指すことが多い。警察は原則として民事事件には介入しないため、この点を悪用する。","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"Difficult","text":"This term is specialized and related to legal and social issues in Japan. Understanding requires knowledge of the Japanese legal system and social context."},"example_sentences":[{"sentence":"**民事介入暴力**は、弁護士や司法書士を巻き込むケースも多い。","translation":"Civil intervention violence often involves lawyers and judicial scriveners.","type":"noun","meaning_category":"Illegal act"}]}