{"word":"referrers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ウェブサイトへの)参照元サイト、リファラー","english_definition":"(plural) Websites or sources that send traffic to a particular website.","examples":[{"sentence":"We analyzed the referrers to our website to understand where our traffic was coming from.","translation":"ウェブサイトへの参照元を分析して、どこからトラフィックが来ているのかを把握しました。"},{"sentence":"The report showed that Google was the top referrer, followed by Facebook.","translation":"レポートによると、Googleがトップのリファラーで、次いでFacebookでした。"}],"collocations":["top referrers","analyze referrers","referrer data","referrer spam","referrer URL"],"synonyms":["referring sites","traffic sources","incoming links"],"antonyms":["destination sites"],"notes":"'Referrers' is the plural form of 'referrer'. It is commonly used in web analytics and SEO (Search Engine Optimization)."}],"etymology":{"value":"Derived from the verb 'refer', meaning to direct attention or send someone or something to a particular place or person. In the context of websites, it refers to the source that directs a user to a specific website.","priority":"★☆☆"},"pronunciation":{"ipa":"/rɪˈfɜːrərz/","syllables":"re-fer-rers"},"inflection":{"noun_plural":"referrers"},"usage_notes":{"explanation":"'Referrers' is a technical term primarily used in the context of web analytics. It refers to the sources (usually websites) that send visitors to a particular website. Analyzing referrers helps website owners understand which sources are most effective in driving traffic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The website has many referrer.","correct":"✓ The website has many referrers.","note":"'Referrer' is a countable noun, so when referring to multiple sources, use the plural form 'referrers'."}],"priority":"★☆☆"},"related_words":{"derivatives":["refer (verb)","referrer (singular noun)","referral (noun)"],"related_terms":["web analytics","traffic analysis","SEO","backlinks","source code"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'referrers' is specialized vocabulary used in web analytics and digital marketing. It refers to the sources that send traffic to a website. Understanding this term requires familiarity with web technologies and online marketing concepts."},"example_sentences":[{"sentence":"Our marketing team tracks the top referrers to measure the success of our campaigns.","translation":"当社のマーケティングチームは、キャンペーンの成功を測るために、トップのリファラーを追跡しています。","type":"general"},{"sentence":"We need to block the spam referrers that are artificially inflating our traffic numbers.","translation":"トラフィック数を人為的に増やしているスパムリファラーをブロックする必要があります。","type":"technical"},{"sentence":"The analytics dashboard provides a detailed breakdown of all referrers over the past month.","translation":"分析ダッシュボードには、過去1か月間のすべてのリファラーの詳細な内訳が表示されます。","type":"technical"}]}