{"word":"greensauce","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"緑色のソース、ハーブを使った緑色のソース","english_definition":"A green-colored sauce, typically made with herbs.","examples":[{"sentence":"He served the fish with a generous dollop of greensauce.","translation":"彼は魚にたっぷりのグリーンソースを添えて出した。"},{"sentence":"Greensauce is a traditional accompaniment to boiled beef in some regions.","translation":"グリーンソースは、一部の地域では茹でた牛肉の伝統的な付け合わせです。"}],"collocations":["serve with greensauce","traditional greensauce","homemade greensauce"],"synonyms":["herb sauce","green sauce","pesto (similar, but specific ingredients)"],"antonyms":[]}],"etymology":{"value":"Combination of the words \"green\" and \"sauce\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡriːnˌsɔːs/","syllables":"green-sauce"},"inflection":{"noun_plural":"greensauces"},"usage_notes":{"explanation":"Greensauce is a general term for any sauce that is predominantly green in color, usually due to the inclusion of green herbs. The specific ingredients and preparation methods can vary widely depending on the region and the recipe. It is often used as a condiment or accompaniment to meat, fish, or vegetables.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ green sauce","correct":"✓ greensauce","note":"While \"green sauce\" is a valid description, \"greensauce\" is the specific word for it."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Greensauce' refers to any sauce that is green, usually because it contains green herbs. It's a fairly straightforward term, but not commonly used, so it's more likely to be encountered in recipes or culinary contexts. The specific ingredients can vary widely, so it's a general category rather than a specific recipe."},"example_sentences":[{"sentence":"The restaurant's signature dish is grilled chicken with a creamy greensauce.","translation":"そのレストランの看板料理は、クリーミーなグリーンソースをかけたグリルチキンです。","type":"noun","meaning_category":"緑色のソース"},{"sentence":"This greensauce recipe calls for parsley, chives, and dill.","translation":"このグリーンソースのレシピは、パセリ、チャイブ、ディルを使います。","type":"noun","meaning_category":"ハーブを使った緑色のソース"}]}