{"word":"preadmit","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(病院などが患者を)事前に入院させる、入院手続きを事前に行う","english_definition":"To admit (a patient) to a hospital or other medical facility in advance of the scheduled date of admission, typically for preliminary tests or administrative procedures.","examples":[{"sentence":"The hospital allows patients to preadmit a day before their surgery to complete paperwork and undergo initial assessments.","translation":"その病院では、患者が手術の前日に事前に入院して、書類手続きを済ませたり、初期評価を受けたりすることができる。"},{"sentence":"Preadmitting patients can help streamline the admission process and reduce wait times on the day of surgery.","translation":"患者を事前に入院させることは、入院手続きを効率化し、手術当日の待ち時間を短縮するのに役立つ。"}],"collocations":["preadmit a patient","preadmit for surgery","hospital preadmission","preadmission testing"],"synonyms":["pre-register","pre-enroll"],"antonyms":["discharge","release"]}],"etymology":{"value":"The word \"preadmit\" is formed by adding the prefix \"pre-\" (meaning \"before\" or \"in advance\") to the word \"admit\" (meaning \"to allow entry\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːədˈmɪt/","syllables":"pree-ad-mit"},"inflection":{"verb_forms":{"present_simple":["preadmit","preadmits"],"past_simple":"preadmitted","past_participle":"preadmitted","present_participle":"preadmitting"}},"usage_notes":{"explanation":"\"Preadmit\" is primarily used in a medical context, specifically referring to the process of admitting a patient to a hospital or medical facility before their scheduled treatment or procedure. This is often done to complete necessary paperwork, conduct preliminary tests, or provide pre-operative instructions. The term emphasizes the advance nature of the admission process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The school preadmits students based on their grades.","correct":"✓ The school preregisters students based on their grades.","note":"\"Preadmit\" is typically used in a medical context. For schools or other institutions, \"preregister\" or \"pre-enroll\" is more appropriate."}],"priority":"★★★"},"related_words":{"derivatives":["preadmission (noun): the act of preadmitting someone; the period before formal admission.","preadmittance (noun): (rare) the state of being preadmitted."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in medical or administrative contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"preadmit\" is a specialized term primarily used in healthcare settings. It refers to the process of admitting a patient to a hospital or clinic before their scheduled appointment or procedure. This is often done to handle paperwork, conduct preliminary tests, or provide instructions. Understanding this term is useful for those working in or interacting with the healthcare system."},"example_sentences":[{"sentence":"The hospital requires all patients to **preadmit** before undergoing elective surgery.","translation":"その病院では、選択手術を受けるすべての患者に事前入院を義務付けている。","type":"verb","meaning_category":"事前入院させる"},{"sentence":"**Preadmitting** patients helps the hospital manage its resources more efficiently.","translation":"患者を事前に入院させることは、病院がより効率的にリソースを管理するのに役立つ。","type":"verb","meaning_category":"事前入院させる"},{"sentence":"The **preadmission** process includes a review of the patient's medical history and current medications.","translation":"事前入院手続きには、患者の病歴と現在の薬のレビューが含まれる。","type":"noun (related word)","meaning_category":"事前入院手続き"}]}