{"word":"bolivar","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ボリバル（ベネズエラの通貨単位）","english_definition":"The basic monetary unit of Venezuela, named after Simón Bolívar.","examples":[{"sentence":"The official exchange rate of the bolivar is controlled by the government.","translation":"ボリバルの公定レートは政府によって管理されている。"},{"sentence":"Due to hyperinflation, the bolivar has significantly devalued.","translation":"ハイパーインフレのため、ボリバルの価値は大幅に下落した。"}],"collocations":["Venezuelan bolivar","bolivar fuerte","sovereign bolivar","exchange rate of the bolivar"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Simón Bolívar, a Venezuelan military and political leader who played a leading role in the establishment of Venezuela, Bolivia, Colombia, Ecuador, Peru, and Panama as sovereign states, independent of Spanish rule.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbɒlɪvɑːr/","syllables":"bo-li-var"},"inflection":{"noun_plural":"bolivares"},"usage_notes":{"explanation":"The bolivar is the official currency of Venezuela. It has undergone several revaluations and name changes due to hyperinflation. The 'bolivar fuerte' (strong bolivar) was introduced in 2008, and the 'sovereign bolivar' was introduced in 2018.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I exchanged my dollars for bolivars in Colombia.","correct":"✓ I exchanged my dollars for bolivars in Venezuela.","note":"Bolivars are the currency of Venezuela, not Colombia."}],"priority":"★☆☆"},"related_words":{"derivatives":["boliviano (Bolivia's currency)"],"phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'bolivar' refers to the currency of Venezuela and is typically encountered in discussions of economics, international finance, or South American politics. Understanding its context requires familiarity with Venezuelan history and economic conditions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The economic crisis in Venezuela has severely impacted the value of the **bolivar**.","translation":"ベネズエラの経済危機はボリバルの価値に深刻な影響を与えている。","type":"noun","meaning_category":"currency"},{"sentence":"Many Venezuelans are using US dollars instead of the **bolivar** for everyday transactions.","translation":"多くのベネズエラ人が日々の取引にボリバルの代わりに米ドルを使用している。","type":"noun","meaning_category":"currency"}]}