{"word":"Danu","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(ケルト神話) 豊穣、母性、知恵を司る女神。アイルランド神話におけるトゥアハ・デ・ダナーン神族の母神とされる。","english_definition":"(Celtic mythology) A mother goddess associated with fertility, motherhood, and wisdom. Considered the mother goddess of the Tuatha Dé Danann in Irish mythology.","examples":[{"sentence":"Danu is revered as the source of all life and abundance in Celtic traditions.","translation":"ダヌはケルトの伝承において、すべての生命と豊穣の源として崇拝されている。"},{"sentence":"The Tuatha Dé Danann are believed to be the children of Danu.","translation":"トゥアハ・デ・ダナーンは、ダヌの子供たちであると信じられている。"}],"collocations":["Mother Danu","Goddess Danu","Tuatha Dé Danann","Celtic mythology","Irish mythology"],"synonyms":["Ana","Anu"],"antonyms":[]}],"etymology":{"value":"語源は不明。古代ケルト語に遡ると考えられているが、確かな証拠はない。一部の研究者は、川や水を意味する言葉との関連性を指摘している。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈdɑːnuː/","syllables":"Da-nu"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"「**Danu**」は、主にケルト神話、特にアイルランド神話において重要な女神の名前です。豊穣、母性、知恵を象徴し、トゥアハ・デ・ダナーン神族の母神として知られています。現代のネオペイガニズムやケルト復興主義においても、重要な存在として認識されています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Danu was a god of the sea.","correct":"✓ Danu was a goddess of fertility and motherhood.","note":"Danuは女神であり、海の神ではありません。豊穣と母性の女神です。"},{"incorrect":"✗ Danu is a character in Greek mythology.","correct":"✓ Danu is a character in Celtic mythology, specifically Irish mythology.","note":"Danuはギリシャ神話ではなく、ケルト神話の登場人物です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Tuatha Dé Danann (トゥアハ・デ・ダナーン：アイルランド神話の神族)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Not applicable (神話上の名前のため)","frequency_google_ngram":"低頻度 (Low frequency) - 神話やケルト研究の文脈でのみ見られる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Danu**」は、ケルト神話に登場する女神の名前であり、一般的な語彙ではありません。アイルランド神話やケルト文化に関心のある人にとっては馴染み深い言葉かもしれませんが、そうでない場合は専門的な知識が必要となります。神話や宗教、歴史などの文脈で登場することが多く、一般的な日常会話ではほとんど使われません。関連する神話や文化背景を理解することで、より深く理解することができます。"},"example_sentences":[{"sentence":"The ancient Celts worshipped Danu as the source of life.","translation":"古代ケルト人は、ダヌを生命の源として崇拝した。","type":"noun","meaning_category":"神話"},{"sentence":"Danu's influence can be seen in many aspects of Irish folklore.","translation":"ダヌの影響は、アイルランドの民話の多くの側面に見られる。","type":"noun","meaning_category":"神話"}]}