{"word":"unmaidenlike","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"乙女らしくない、淑女らしくない","english_definition":"Not befitting a maiden or young woman; lacking the qualities traditionally associated with maidens, such as modesty, innocence, or gentleness.","examples":[{"sentence":"Her unmaidenlike behavior shocked the conservative society.","translation":"彼女の乙女らしくない振る舞いは保守的な社会に衝撃を与えた。"},{"sentence":"She displayed an unmaidenlike boldness in her pursuit of a career.","translation":"彼女はキャリアを追求する上で、乙女らしくない大胆さを見せた。"},{"sentence":"The novel described her as having an unmaidenlike strength of character.","translation":"その小説は彼女を乙女らしくない強い性格の持ち主として描いた。"}],"collocations":["unmaidenlike behavior","unmaidenlike conduct","unmaidenlike boldness","unmaidenlike strength"],"synonyms":["immodest","unladylike","unfeminine","indecorous","unbecoming"],"antonyms":["maidenlike","ladylike","feminine","modest","decorous"]}],"etymology":{"value":"\"un-\" (否定の接頭辞) + \"maidenlike\" (乙女のような)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnˈmeɪdənˌlaɪk/","syllables":"un-mai-den-like"},"inflection":{"adjective_forms":{"comparative":"more unmaidenlike","superlative":"most unmaidenlike"}},"usage_notes":{"explanation":"\"Unmaidenlike\" is used to describe behavior or characteristics that are considered inappropriate or unexpected for a young, unmarried woman, often based on traditional or outdated societal expectations. It implies a deviation from the expected norms of modesty, gentleness, or innocence. The term can be considered somewhat archaic or judgmental in modern usage, as societal expectations of women have evolved.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She acted unmaidenly.","correct":"✓ She acted in an unmaidenlike manner.","note":"While \"unmaidenly\" exists, \"unmaidenlike\" is more common. To use it as an adverbial phrase, use \"in an unmaidenlike manner.\""},{"incorrect":"✗ He found her unmaidenlike.","correct":"✓ He found her behavior unmaidenlike.","note":"It's generally used to describe behavior or qualities, not the person directly. It's more common to say \"He found her behavior unmaidenlike\" rather than \"He found her unmaidenlike.\""}],"priority":"★★☆"},"related_words":{"derivatives":["maiden (名詞: 乙女、未婚の女性)","maidenly (形容詞: 乙女らしい、淑女らしい)","maidenlike (形容詞: 乙女のような、淑女のような)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unmaidenlike\" is a relatively rare and formal term. It describes behavior or characteristics that are not considered typical or appropriate for a young, unmarried woman, according to traditional societal expectations. Because these expectations are often outdated or considered sexist, the word itself can be seen as judgmental or old-fashioned. Understanding the word requires knowledge of traditional gender roles and the ability to recognize how those roles are being challenged or subverted."},"example_sentences":[{"sentence":"Her unmaidenlike confidence impressed many, but also drew criticism from some.","translation":"彼女の乙女らしくない自信は多くの人に感銘を与えたが、一部からは批判も浴びた。","type":"adjective","meaning_category":"乙女らしくない振る舞い"},{"sentence":"The protagonist's unmaidenlike ambition drove her to defy societal norms.","translation":"主人公の乙女らしくない野心は、彼女を社会の規範に逆らうように駆り立てた。","type":"adjective","meaning_category":"乙女らしくない性格"},{"sentence":"Some considered her outspokenness to be unmaidenlike.","translation":"彼女の率直さは乙女らしくないと考える人もいた。","type":"adjective","meaning_category":"乙女らしくない態度"}]}