{"word":"not-self","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(仏教) 無我、非我","english_definition":"(Buddhism) The doctrine that there is in humans no permanent, underlying substance that can be called the soul.","examples":[{"sentence":"The concept of not-self is central to Buddhist philosophy.","translation":"無我の概念は仏教哲学の中心です。"},{"sentence":"Understanding not-self can lead to liberation from suffering.","translation":"無我を理解することは苦しみからの解放につながる可能性があります。"}],"collocations":["doctrine of not-self","realization of not-self","understanding of not-self"],"synonyms":["anatta (Pali)","anatman (Sanskrit)"],"antonyms":["self","ego","soul"]},{"part_of_speech":"adjective","definition":"(心理学、哲学) 自己とは異なる、自己に属さない","english_definition":"(Psychology, Philosophy) Not belonging to or part of the self.","examples":[{"sentence":"The individual must differentiate between self and not-self.","translation":"個人は自己と非自己を区別しなければなりません。"},{"sentence":"The immune system distinguishes between self and not-self antigens.","translation":"免疫システムは自己抗原と非自己抗原を区別します。"}],"collocations":["self and not-self","distinguishing self from not-self"],"synonyms":["other","external","foreign"],"antonyms":["self","internal","own"]}],"etymology":{"value":"A compound word formed by combining 'not' and 'self'. Reflects the philosophical concept of the absence of a permanent, independent self.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒtˈsɛlf/","syllables":"not-self"},"inflection":{"notes":"It functions as both a noun and an adjective, so inflection is minimal."},"usage_notes":{"explanation":"The term 'not-self' is primarily used in Buddhist philosophy to describe the concept of *anatta* or *anatman*, which denies the existence of a permanent, unchanging self or soul. In other contexts, such as psychology or immunology, it refers to anything that is not part of one's own identity or body. It is often used in contrast to 'self'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a not-self person.","correct":"✓ He embodies the concept of not-self.","note":"'Not-self' is typically used as a philosophical concept or in technical contexts, not as a general descriptor of a person."},{"incorrect":"✗ The not-self is important for understanding yourself.","correct":"✓ Understanding not-self is important for understanding the lack of a fixed self.","note":"Ensure the context aligns with the philosophical meaning, emphasizing the impermanence of self."}],"priority":"★★☆"},"related_words":{"derivatives":["self","ego","identity","anatta","anatman"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Primarily used in philosophical and academic contexts)","frequency_google_ngram":"Low frequency, primarily in philosophical and academic texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Not-self' is a term mainly found in Buddhist philosophy and some areas of psychology. In Buddhism, it refers to the idea that there is no unchanging, permanent 'self' or soul. Instead, what we think of as 'self' is a constantly changing collection of experiences and sensations. Outside of Buddhism, it can refer to anything that is not part of one's own body or identity, such as foreign substances recognized by the immune system. The term is abstract and requires some understanding of philosophical or psychological concepts to grasp fully."},"example_sentences":[{"sentence":"The meditation focused on observing the absence of a fixed 'self', exploring the concept of **not-self**.","translation":"瞑想は、固定された「自己」の不在を観察し、無我の概念を探求することに焦点を当てました。","type":"noun","meaning_category":"(Buddhism) 無我"},{"sentence":"The immune system must accurately distinguish between 'self' and '**not-self**' to prevent autoimmune reactions.","translation":"免疫システムは自己免疫反応を防ぐために、「自己」と「非自己」を正確に区別する必要があります。","type":"adjective","meaning_category":"(Immunology) 自己とは異なる"}]}