{"word":"retrials","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再審理、再試験","english_definition":"plural form of retrial: a new trial of a case that has already been decided, or a new attempt at a test or competition.","examples":[{"sentence":"The defendant faced retrials after the initial trial ended in a hung jury.","translation":"被告は、最初の裁判が評決不能に終わった後、再審理に直面した。"},{"sentence":"The athlete prepared for retrials after failing to qualify in the first attempt.","translation":"その選手は、最初の試みで資格を得られなかった後、再試験に備えた。"}],"collocations":["face retrials","order retrials","prepare for retrials"],"synonyms":["new trials","rehearings","second attempts"],"antonyms":[]}],"etymology":{"value":"'Retrials' is formed by adding the plural suffix '-s' to 'retrial'. 'Retrial' itself is formed by adding the prefix 're-' (meaning 'again' or 'anew') to 'trial'. 'Trial' comes from Old French 'trial,' meaning 'test' or 'tribunal'.","priority":"★★★"},"pronunciation":{"ipa":"/riːˈtraɪəlz/","syllables":"re-tri-als"},"inflection":{"noun_plural":"retrials"},"usage_notes":{"explanation":"'Retrials' refers to multiple instances of a new trial or test. It is used when discussing more than one instance of a case being re-tried or a test being re-attempted.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The retrial were ordered by the judge.","correct":"✓ The retrials were ordered by the judge.","note":"Since 'retrials' is plural, the verb must also be plural ('were' instead of 'was')."},{"incorrect":"✗ He is preparing for retrial.","correct":"✓ He is preparing for retrials.","note":"If the context implies multiple attempts or instances, use the plural form 'retrials' instead of the singular 'retrial'."}],"priority":"★★★"},"related_words":{"derivatives":["retrial (noun: a new trial)","trial (noun: a formal examination of evidence before a judge, typically with a jury, in order to decide guilt in a case of criminal or civil proceedings)","retry (verb: to try (a case) again)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Retrials' is a term primarily used in legal and competitive contexts. In a legal setting, it refers to multiple instances where a case is re-examined in court, often due to issues in the original trial. In competitive scenarios, it indicates multiple attempts to qualify or succeed in a test or competition. Understanding this term is essential for comprehending legal procedures and competitive processes where repeated attempts are common."},"example_sentences":[{"sentence":"The judge scheduled several retrials to address the inconsistencies in the evidence.","translation":"裁判官は、証拠の矛盾に対処するために、いくつかの再審理を予定した。","type":"noun","meaning_category":"再審理"},{"sentence":"After the initial failure, the team focused on preparing for the upcoming retrials.","translation":"最初の失敗の後、チームは今後の再試験の準備に集中した。","type":"noun","meaning_category":"再試験"}]}