{"word":"centration","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"集中、中心化、求心性","english_definition":"The act or process of concentrating or centralizing; the state of being centered. In psychology, especially in Piaget's theory, it refers to the tendency to focus on one aspect of a situation and neglect others.","examples":[{"sentence":"The centration of power in the hands of a few individuals can lead to corruption.","translation":"少数の個人への権力集中は、腐敗につながる可能性があります。"},{"sentence":"In Piaget's theory, centration is a characteristic of preoperational thinking.","translation":"ピアジェの理論では、集中化は前操作期思考の特徴です。"}],"collocations":["power centration (権力集中)","cognitive centration (認知集中)","centration error (集中化エラー)"],"synonyms":["concentration","centralization","focus","centering"],"antonyms":["decentralization","dispersion","diffusion"]}],"etymology":{"value":"Derived from the word 'center' with the suffix '-ation', indicating a process or state.","priority":"★★☆"},"pronunciation":{"ipa":"/sɛnˈtreɪʃən/","syllables":"cen-tra-tion"},"inflection":{"noun_plural":"centrations"},"usage_notes":{"explanation":"'Centration' refers to the act of focusing or centralizing something. In the context of psychology, particularly Piaget's theory of cognitive development, it describes a child's tendency to focus on only one aspect of a situation or problem, neglecting other relevant aspects. This limitation is characteristic of the preoperational stage of cognitive development.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city needs more centration.","correct":"✓ The city needs more centralization.","note":"In general use, 'centralization' is more common than 'centration' when referring to the organization of resources or power."}],"priority":"★☆☆"},"related_words":{"derivatives":["center","central","centralize","centralization"],"related_terms":["decentration (脱中心化)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Centration' is a relatively uncommon term, primarily used in academic or technical contexts, especially within the field of psychology. It refers to the act of focusing or centralizing something, or the state of being centered. In Piaget's theory, it describes a cognitive limitation in children where they can only focus on one aspect of a situation at a time. Understanding this term requires familiarity with psychological theories and abstract concepts."},"example_sentences":[{"sentence":"The company's restructuring involved the centration of decision-making at the headquarters.","translation":"会社の再編には、本社への意思決定の集中化が含まれていました。","type":"general","meaning_category":"集中化"},{"sentence":"Centration is a key limitation in preoperational children's ability to solve conservation problems.","translation":"集中化は、前操作期の子どもたちが保存の問題を解決する能力における重要な制限です。","type":"psychology","meaning_category":"心理学"}]}