{"word":"self-energy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己エネルギー (物理学)","english_definition":"(physics) The energy associated with the interaction of a particle or object with its own field.","examples":[{"sentence":"The self-energy of an electron is a fundamental concept in quantum electrodynamics.","translation":"電子の自己エネルギーは、量子電磁力学における基本的な概念です。"},{"sentence":"Calculating the self-energy of a particle often involves renormalization techniques.","translation":"粒子の自己エネルギーを計算するには、しばしば繰り込みの手法が用いられます。"}],"collocations":["calculate self-energy","renormalize self-energy","electron self-energy","electromagnetic self-energy"],"synonyms":["self-mass","interaction energy"],"antonyms":[]}],"etymology":{"value":"'Self-' + 'energy'.  The concept arose in classical electrodynamics and quantum field theory to describe the energy contribution from a particle's own electromagnetic field.","priority":"★★★"},"pronunciation":{"ipa":"/ˌself ˈenərdʒi/","syllables":"self-en-er-gy"},"inflection":{"noun_plural":"self-energies"},"usage_notes":{"explanation":"In physics, particularly in quantum field theory and condensed matter physics, self-energy refers to the energy shift of a particle due to its interaction with the surrounding field it generates. This interaction can be electromagnetic, strong nuclear force, or any other fundamental force. The self-energy is often divergent and requires renormalization to obtain physically meaningful results. It is a crucial concept in understanding the properties of particles and their interactions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The self energy is the same as potential energy.","correct":"✓ The self-energy is related to, but distinct from, potential energy.","note":"Self-energy arises from a particle's interaction with its own field, while potential energy is due to external forces or fields. They are not the same concept."}],"priority":"★★☆"},"related_words":{"derivatives":["self-mass","renormalization","quantum electrodynamics","quantum field theory"],"phrasal_verbs":[],"related_concepts":["Green's function","Feynman diagram","propagator"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な物理学の文脈)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency), 物理学の専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-energy' is a technical term used in physics, particularly in quantum field theory. It refers to the energy a particle possesses due to its interaction with its own field. This concept is complex and often requires advanced mathematical techniques like renormalization to handle infinities that arise in calculations. Understanding self-energy is essential for studying particle physics and condensed matter physics at an advanced level.","priority":"★★☆"},"example_sentences":[{"sentence":"The electron's **self-energy** contributes to its observed mass.","translation":"電子の自己エネルギーは、観測される質量に寄与します。","type":"general","meaning_category":"definition"},{"sentence":"The **self-energy** correction is an important part of the Lamb shift.","translation":"自己エネルギー補正は、ラムシフトの重要な部分です。","type":"specific","meaning_category":"application"},{"sentence":"Diagrammatic techniques are used to compute the **self-energy** in many-body systems.","translation":"図式的な手法は、多体系における自己エネルギーを計算するために使用されます。","type":"technical","meaning_category":"calculation"}]}