{"word":"star-of-Bethlehem","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ベツレヘムの星（ユリ科の植物）","english_definition":"a bulbous plant of the genus Ornithogalum, especially O. umbellatum, with white star-shaped flowers.","examples":[{"sentence":"The star-of-Bethlehem is a beautiful addition to any garden.","translation":"ベツレヘムの星はどんな庭にも美しい彩りを添えます。"}],"collocations":["plant star-of-Bethlehem","grow star-of-Bethlehem"],"synonyms":["Ornithogalum umbellatum"],"antonyms":[]}],"etymology":{"value":"The name refers to the biblical Star of Bethlehem, said to have guided the Magi to the infant Jesus. The star-like shape of the flower is reminiscent of this celestial body.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌstɑːr əv ˈbɛθlɪhɛm/","syllables":"star-of-Beth-le-hem"},"inflection":{"noun_plural":"stars-of-Bethlehem"},"usage_notes":{"explanation":"The term 'star-of-Bethlehem' typically refers to the plant *Ornithogalum umbellatum*. It is known for its delicate, star-shaped white flowers. The plant is sometimes considered invasive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Star of Bethlehem in the sky.","correct":"✓ I saw the Star of Bethlehem in the sky.","note":"When referring to the biblical star, capitalize 'Star of Bethlehem'. When referring to the flower, use lowercase unless at the beginning of a sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["Ornithogalum"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Star-of-Bethlehem' is a specific term for a type of flower. It is not a commonly used word, so familiarity with botanical terms is helpful. The name has religious connotations, referencing the biblical Star of Bethlehem. Understanding the context (gardening, botany, or religious discussion) is key to interpreting its use."},"example_sentences":[{"sentence":"She planted star-of-Bethlehem bulbs in her garden last fall.","translation":"彼女は昨年の秋に庭にベツレヘムの星の球根を植えました。","type":"noun","meaning_category":"plant"},{"sentence":"The star-of-Bethlehem's delicate white flowers bloom in the spring.","translation":"ベツレヘムの星の繊細な白い花は春に咲きます。","type":"noun","meaning_category":"plant"},{"sentence":"Some gardeners consider star-of-Bethlehem to be an invasive species.","translation":"一部の庭師はベツレヘムの星を侵略的な種と考えています。","type":"noun","meaning_category":"plant"}]}