{"word":"Eolith","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"暁新世（約5600万年前から3400万年前）またはそれ以前の地層から発見される、原始的な石器と主張されるもの。自然の力によって形成された可能性が高い。","english_definition":"A crude stone artifact claimed to be the earliest type of tool, dating from the Eocene or earlier, but now generally considered to be of natural origin.","examples":[{"sentence":"The eoliths found at the site were later determined to be geofacts.","translation":"その遺跡で発見された暁石器は、後に自然の作用によってできたものと判断された。"}],"collocations":["find an eolith","examine an eolith","classify an eolith"],"synonyms":["geofact"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「eos」（暁、始まり）+「lithos」（石）から。人類による最初の石器と考えられていたため、この名が付けられた。","priority":"★★☆"},"pronunciation":{"ipa":"ˈiːəˌlɪθ","syllables":"E-o-lith"},"inflection":{"noun_plural":"Eoliths"},"usage_notes":{"explanation":"「Eolith」は、かつては人類が作った最初の石器と考えられていましたが、現在では自然の力によって偶然に石が割れたり欠けたりした結果である可能性が高いと考えられています。考古学や地質学の分野で使われる専門用語です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used an eolith to hunt animals.","correct":"✓ He found what was thought to be an eolith.","note":"Eoliths are not considered to be tools used by humans, but rather naturally formed rocks that resemble tools."}],"priority":"★★☆"},"related_words":{"derivatives":["Eolithic (形容詞: 暁石器時代の)"],"phrases":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Eolith」は、考古学や地質学で使われる専門用語で、一般的にはほとんど使われません。これは、かつて人類が作った最初の石器と考えられていたものの、現在では自然の力でできた可能性が高いと考えられている石のことです。この単語を理解するには、考古学や地質学の基本的な知識が必要です。"},"example_sentences":[{"sentence":"Early archaeologists debated whether the chipped stones were true tools or simply eoliths.","translation":"初期の考古学者は、その欠けた石が本物の道具なのか、単なる暁石器なのかを議論した。","type":"noun","meaning_category":"石器"},{"sentence":"The discovery of more sophisticated tools led to the reclassification of many eoliths as geofacts.","translation":"より洗練された道具の発見により、多くの暁石器が自然の作用でできたものとして再分類された。","type":"noun","meaning_category":"石器"}]}