{"word":"willower","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"人または機械で、ヤナギの木を育てる人、またはヤナギの木を加工する人","english_definition":"A person or machine that grows or processes willow trees.","examples":[{"sentence":"The willower carefully pruned the branches to encourage growth.","translation":"ヤナギ職人は成長を促すために丁寧に枝を剪定した。"},{"sentence":"The willower harvested the willow rods for basket weaving.","translation":"ヤナギ職人は、かご編み用にヤナギの棒を収穫した。"}],"collocations":["willow cultivation","willow harvesting","basket willow","osier willow"],"synonyms":["willow grower","osier grower","basketmaker"],"antonyms":[]}],"etymology":{"value":"The word \"willower\" is derived from \"willow\" (the tree) + \"-er\" (a suffix indicating a person or thing associated with).","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɪləʊər/","syllables":"wil-low-er"},"inflection":{"noun_plural":"willowers"},"usage_notes":{"explanation":"The term \"willower\" is relatively uncommon. It specifically refers to someone involved in the cultivation or processing of willow trees, often for crafts like basket weaving. It is more specific than a general farmer or craftsman.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a good willower because he likes trees.","correct":"He is a good willower because he is skilled at growing and harvesting willow.","note":"Being a willower involves specific skills related to willow cultivation, not just liking trees."}],"priority":"★☆☆"},"related_words":{"derivatives":["willow","willowy","willowherb"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'willower' is a niche term. Understanding it requires knowledge of willow cultivation and its associated crafts. It's not a word typically encountered in everyday conversation or general reading material."},"example_sentences":[{"sentence":"The old willower taught his grandson the art of weaving willow baskets.","translation":"年老いたヤナギ職人は孫にヤナギのかごを編む技術を教えた。","type":"noun","meaning_category":"person who works with willows"},{"sentence":"The willower used a special tool to strip the bark from the willow rods.","translation":"ヤナギ職人は特別な道具を使ってヤナギの棒から樹皮を剥ぎ取った。","type":"noun","meaning_category":"person who works with willows"}]}