{"word":"Subsales","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(不動産)転売、再販売：不動産の売買契約が完了する前に、購入者が第三者にその権利を売却すること。","english_definition":"(Real Estate) The sale of a property by the original purchaser to a third party before the original purchase is completed.","examples":[{"sentence":"Subsales are common in rapidly appreciating property markets.","translation":"転売は、不動産市場が急速に価値を上げている場合に一般的です。"},{"sentence":"The government introduced measures to curb speculation in subsales.","translation":"政府は、転売における投機を抑制するための措置を導入しました。"},{"sentence":"He made a profit by engaging in subsales of apartments.","translation":"彼はアパートの転売に従事することで利益を得ました。"}],"collocations":["engage in subsales (転売を行う)","profit from subsales (転売で利益を得る)","curb subsales (転売を抑制する)","speculation in subsales (転売における投機)"],"synonyms":["assignment sale","nominee sale","pre-completion sale"],"antonyms":["original purchase","direct sale"],"notes":"Subsales are also known as 'assignment sales' or 'nominee sales'. This practice allows the original purchaser to avoid paying additional taxes and fees associated with completing the original purchase."}],"etymology":{"value":"\"Sub-\" (下位の、二次的な) + \"sales\" (販売) から構成される。不動産取引において、元の販売契約の下で行われる二次的な販売を意味する。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈsʌbˌseɪlz/","syllables":"sub-sales"},"inflection":{"noun_plural":"Subsales"},"usage_notes":{"explanation":"Subsales are most common in markets where property values are increasing rapidly, as the original purchaser can sell their rights to the property for a profit before the original transaction is finalized. However, subsales can also be risky, as the original purchaser may be liable for any losses if the third party defaults on the purchase.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He subsales the house.","correct":"✓ He engages in subsales of houses.","note":"\"Subsales\" is typically used as a noun. To describe the action, use \"engage in subsales.\""},{"incorrect":"✗ Subsale is a good investment.","correct":"✓ Subsales are a good investment.","note":"When referring to the practice in general, use the plural form \"subsales.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["subsale (単数形)"],"phrasal_verbs":[],"related_terms":["assignment (譲渡)","nominee (名義人)","real estate (不動産)","property market (不動産市場)","speculation (投機)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Subsales' refers to the practice of selling a property before the original purchase is completed. This is often done in rapidly appreciating markets where the original purchaser can make a profit by selling their rights to the property. It is a specialized term primarily used in the context of real estate and finance."},"example_sentences":[{"sentence":"The developer restricted subsales to prevent price manipulation.","translation":"開発業者は価格操作を防ぐために転売を制限しました。","type":"noun","meaning_category":"不動産"},{"sentence":"Subsales can be a risky investment strategy.","translation":"転売はリスクの高い投資戦略となる可能性があります。","type":"noun","meaning_category":"不動産"},{"sentence":"Many investors were involved in subsales during the property boom.","translation":"多くの投資家が不動産ブームの間に転売に関与していました。","type":"noun","meaning_category":"不動産"}]}