{"word":"nonadmissibly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"許容できない形で、受け入れられない形で","english_definition":"In a manner that is not admissible; in a way that cannot be allowed or accepted.","examples":[{"sentence":"The evidence was presented nonadmissibly, so the judge rejected it.","translation":"その証拠は許容できない形で提出されたため、裁判官はそれを却下した。"},{"sentence":"The data was obtained nonadmissibly, rendering it unusable for the research.","translation":"そのデータは受け入れられない方法で取得されたため、研究には使用できなくなった。"}],"collocations":["obtained nonadmissibly","presented nonadmissibly","used nonadmissibly"],"synonyms":["unacceptably","impermissibly","inappropriately","illegally"],"antonyms":["admissibly","acceptably","permissibly","appropriately","legally"]}],"etymology":{"value":"Derived from \"admissibly\" (in an admissible manner) with the addition of the prefix \"non-\" (not).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnədˈmɪsɪbli/","syllables":"non-ad-mis-si-bly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Nonadmissibly\" is primarily used in legal or formal contexts to describe something (like evidence or data) that has been obtained or presented in a way that violates rules or standards, making it unacceptable for use. It emphasizes the manner in which something was done, rather than simply stating that it is inadmissible.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The information was nonadmissible.","correct":"✓ The information was obtained nonadmissibly.","note":"\"Nonadmissible\" is an adjective, whereas \"nonadmissibly\" is an adverb. Use the adverb to describe how something was done, not to describe the thing itself."}],"priority":"★★☆"},"related_words":{"derivatives":["admissible (adjective)","admissibility (noun)","inadmissible (adjective)","inadmissibly (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nonadmissibly' is a formal adverb used to describe actions performed in a way that violates established rules or standards, particularly in legal or academic contexts. It implies that something was done improperly, rendering the results or evidence unacceptable. Due to its formal and specialized nature, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The confession was obtained nonadmissibly due to police coercion.","translation":"その自白は警察の強要により許容できない形で得られた。","type":"general","meaning_category":"manner of obtaining"},{"sentence":"The data was collected nonadmissibly, violating privacy regulations.","translation":"そのデータはプライバシー規制に違反し、受け入れられない方法で収集された。","type":"general","meaning_category":"manner of collecting"}]}