{"word":"astrocompass","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"天文コンパス、星コンパス：天体の位置（通常は太陽または特定の星）を使用して方向を決定する航海機器","english_definition":"A navigational instrument used to determine direction by reference to celestial bodies (usually the sun or certain stars).","examples":[{"sentence":"The astrocompass was essential for navigation in polar regions where magnetic compasses are unreliable.","translation":"天文コンパスは、磁気コンパスが信頼できない極地での航海に不可欠でした。"},{"sentence":"Early explorers relied on the astrocompass to chart new territories.","translation":"初期の探検家は、新しい領土を地図に記録するために天文コンパスに頼っていました。"}],"collocations":["use an astrocompass","navigate with an astrocompass","celestial navigation"],"synonyms":["celestial compass","solar compass","star compass"],"antonyms":[]}],"etymology":{"value":"'Astro-' (ギリシャ語の 'astron' = 星) + 'compass' (方向を示す機器)","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæstroʊˌkʌmpəs/","syllables":"as-tro-com-pass"},"inflection":{"noun_plural":"astrocompasses"},"usage_notes":{"explanation":"Astrocompasses are particularly useful in areas where magnetic compasses are affected by magnetic interference, such as polar regions or areas with high iron ore deposits. They require knowledge of the celestial body's position and time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a astrocompass to find north.","correct":"✓ I used an astrocompass to find north.","note":"'Astrocompass' starts with a vowel sound, so use 'an' instead of 'a' as the indefinite article."}],"priority":"★☆☆"},"related_words":{"derivatives":["astronomy","compass","navigation"],"phrases":["celestial navigation","solar navigation","star tracker"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'astrocompass' refers to a specialized navigational tool used primarily in situations where traditional magnetic compasses are unreliable. Understanding its function requires some knowledge of celestial navigation and the limitations of magnetic compasses in certain environments."},"example_sentences":[{"sentence":"The pilot used the astrocompass to maintain course over the Arctic ice.","translation":"パイロットは天文コンパスを使用して、北極の氷上でのコースを維持しました。","type":"noun","meaning_category":"航海機器"},{"sentence":"An astrocompass is a vital tool for explorers venturing into magnetically unstable regions.","translation":"天文コンパスは、磁気的に不安定な地域に冒険する探検家にとって不可欠なツールです。","type":"noun","meaning_category":"航海機器"}]}