{"word":"Froebelism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"フレーベル主義、フレーベルの教育思想","english_definition":"The educational principles and practices advocated by Friedrich Fröbel, emphasizing self-activity, play, and social interaction in early childhood education.","examples":[{"sentence":"Froebelism had a significant impact on the development of kindergarten education.","translation":"フレーベル主義は幼稚園教育の発展に大きな影響を与えた。"},{"sentence":"The kindergarten curriculum is based on the principles of Froebelism.","translation":"幼稚園のカリキュラムはフレーベル主義の原則に基づいている。"}],"collocations":["Froebelian kindergarten","Froebelian education","principles of Froebelism"],"synonyms":["Fröbel method","kindergarten method"],"antonyms":[]}],"etymology":{"value":"Derived from the name of Friedrich Fröbel (1782-1852), a German educator, combined with the suffix \"-ism\" indicating a doctrine or system of principles.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfroʊbəlɪzəm/","syllables":"Fro-e-bel-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Froebelism refers specifically to the educational philosophy and methods developed by Friedrich Fröbel, particularly his emphasis on the importance of play, creativity, and social interaction in early childhood education. It is closely associated with the development of the kindergarten system.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a follower of Froebel. He is a Froebel.","correct":"✓ He is a follower of Froebel. He is a Froebelian.","note":"The correct term for a follower of Froebel's ideas is 'Froebelian,' not 'Froebel.'"}],"priority":"★★☆"},"related_words":{"derivatives":["Froebelian (adjective, noun)","Fröbel (proper noun)","kindergarten (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Froebelism' is a specialized term related to the educational philosophy of Friedrich Fröbel, particularly concerning early childhood education and the development of the kindergarten system. Understanding this term requires familiarity with educational theories and the history of early childhood education."},"example_sentences":[{"sentence":"The teacher incorporated elements of Froebelism into her lesson plans.","translation":"先生は授業計画にフレーベル主義の要素を取り入れた。","type":"general","meaning_category":"Educational Philosophy"},{"sentence":"Critics of Froebelism argue that it can be overly idealistic.","translation":"フレーベル主義の批判者たちは、それが過度に理想主義的であると主張する。","type":"general","meaning_category":"Critiques"}]}