{"word":"topectomy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"前頭葉切除術（精神疾患の治療として行われた脳外科手術の一種で、前頭葉の一部を切除するもの）","english_definition":"A surgical procedure in which nerve fibers connecting different parts of the frontal lobes of the brain are severed; a type of psychosurgery formerly used to treat mental disorders.","examples":[{"sentence":"Topectomy, although now largely obsolete, was once considered a viable treatment for severe mental illnesses.","translation":"トペクトミーは、現在ではほとんど廃止されているが、かつては重度の精神疾患に対する実行可能な治療法と考えられていた。"}],"collocations":["undergo topectomy","perform topectomy","history of topectomy"],"synonyms":["frontal lobotomy","psychosurgery"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'topos' (place, region) and 'ektome' (excision).","priority":"★★☆"},"pronunciation":{"ipa":"/toʊˈpɛktəmi/","syllables":"to-pec-to-my"},"inflection":{"noun_plural":"topectomies"},"usage_notes":{"explanation":"Topectomy is a specific type of psychosurgery that involves the removal of a localized area of the prefrontal cortex. It is distinct from a standard lobotomy, which involves severing the connections more broadly. Topectomy is rarely performed in modern medicine due to ethical concerns and the availability of more effective and less invasive treatments for mental disorders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The topectomy was a simple procedure with no side effects.","correct":"✓ Topectomy was a controversial procedure with significant side effects.","note":"Topectomy was associated with a range of side effects and is considered controversial due to its impact on personality and cognitive function."}],"priority":"★☆☆"},"related_words":{"derivatives":["lobotomy","psychosurgery","prefrontal cortex"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Topectomy is a highly specialized medical term referring to a specific type of psychosurgery involving the removal of a portion of the frontal lobes of the brain. Due to its historical context and limited modern usage, the term is rarely encountered outside of medical or historical discussions. Understanding requires knowledge of neuroanatomy and the history of mental health treatments."},"example_sentences":[{"sentence":"The patient underwent a topectomy in an attempt to alleviate severe symptoms of schizophrenia.","translation":"その患者は、重度の統合失調症の症状を緩和するために、トペクトミーを受けた。","type":"medical","meaning_category":"surgical procedure"},{"sentence":"Historical records document the use of topectomy in the mid-20th century for treating various mental disorders.","translation":"歴史的記録は、20世紀半ばに様々な精神疾患の治療にトペクトミーが使用されていたことを記録している。","type":"historical","meaning_category":"historical practice"}]}