{"word":"asporulate","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(生物学) 胞子を形成しない、無胞子の","english_definition":"(biology) Not producing spores; lacking spores.","examples":[{"sentence":"The asporulate mutant was unable to reproduce sexually.","translation":"その無胞子変異体は有性生殖することができなかった。"},{"sentence":"Asporulate yeasts are used in some industrial processes.","translation":"無胞子酵母はいくつかの工業プロセスで使用されている。"}],"collocations":["asporulate mutant","asporulate yeast","asporulate bacteria"],"synonyms":["nonsporulating","nonsporeforming"],"antonyms":["sporulating","sporeforming"]}],"etymology":{"value":"'a-' (否定の接頭辞) + 'sporulate' (胞子を形成する)","priority":"★★★"},"pronunciation":{"ipa":"/eɪˈspɔːrjuːleɪt/","syllables":"a-spor-u-late"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"'Asporulate' is a technical term used primarily in biology, specifically when discussing microorganisms like bacteria, fungi, and yeasts. It describes organisms that do not produce spores, which are reproductive structures that allow the organism to survive harsh conditions or disperse to new locations. The term is often used to distinguish between different strains or mutants of a species, or to describe organisms that have lost the ability to sporulate due to genetic mutations or environmental factors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The asporulate bacteria was dangerous.","correct":"✓ The asporulate bacteria were dangerous.","note":"'Bacteria' is a plural noun, so it requires a plural verb ('were')."},{"incorrect":"✗ An asporulate is a spore.","correct":"✓ An asporulate organism does not produce spores.","note":"An asporulate organism is one that *lacks* spores, not a spore itself."}],"priority":"★★☆"},"related_words":{"derivatives":["asporulation (名詞: 無胞子状態)","sporulate (動詞: 胞子を形成する)","sporulation (名詞: 胞子形成)","spore (名詞: 胞子)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Asporulate' is a specialized term used in biology to describe organisms that do not form spores. Spores are reproductive structures that some bacteria, fungi, and plants use to spread or survive harsh conditions. If an organism is described as 'asporulate,' it means it lacks the ability to produce these spores. This term is most commonly found in scientific literature or discussions related to microbiology and genetics. Understanding this term requires a background knowledge of biology and the role of spores in reproduction and survival.","priority":"★★★"},"example_sentences":[{"sentence":"The researchers studied the growth of an asporulate strain of Bacillus subtilis.","translation":"研究者たちは枯草菌の無胞子株の成長を研究した。","type":"adjective","meaning_category":"生物学"},{"sentence":"The asporulate phenotype was confirmed through microscopic examination.","translation":"無胞子表現型は顕微鏡検査によって確認された。","type":"adjective","meaning_category":"生物学"},{"sentence":"Asporulate mutants are often used to study the mechanisms of sporulation.","translation":"無胞子変異体は、胞子形成のメカニズムを研究するためによく使用される。","type":"adjective","meaning_category":"生物学"}]}