{"word":"pathicism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学、心理学) 受動性、感受性、感情に支配される状態","english_definition":"(philosophy, psychology) The state of being passive, receptive, or dominated by emotions.","examples":[{"sentence":"Pathicism can be seen as the opposite of active agency.","translation":"受動性は、能動的な主体性の対極にあるものと見なすことができる。"},{"sentence":"The artist explored pathicism in their work by depicting figures overwhelmed by their feelings.","translation":"その芸術家は、感情に圧倒された人物を描くことによって、作品の中で受動性を探求した。"}],"collocations":["emotional pathicism","intellectual pathicism"],"synonyms":["passivity","receptivity","susceptibility","emotionality"],"antonyms":["agency","activity","control","willpower"]}],"etymology":{"value":"Derived from the Greek word 'pathos' (πάθος), meaning suffering, feeling, or emotion, combined with the suffix '-ism', indicating a state, condition, or doctrine.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpæθɪsɪzəm/","syllables":"path-i-cis-m"},"inflection":{"noun_plural":"pathicisms"},"usage_notes":{"explanation":"'Pathicism' is a relatively rare term, primarily used in philosophical and psychological contexts to describe a state of being acted upon rather than acting. It emphasizes the experience of being subject to external forces or internal emotions. It is often contrasted with concepts of agency, will, and self-control.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ His pathicism made him a great leader.","correct":"✓ His empathy made him a great leader.","note":"'Pathicism' is generally not a desirable trait in a leader. Empathy, the ability to understand and share the feelings of others, is a more appropriate quality."},{"incorrect":"✗ She showed great pathicism during the crisis.","correct":"✓ She showed great resilience during the crisis.","note":"In a crisis, resilience (the ability to recover quickly from difficulties) is usually a more valued trait than pathicism."}],"priority":"★★☆"},"related_words":{"derivatives":["pathetic","pathos","empathy","antipathy","sympathy"],"related_concepts":["affect","emotion","feeling","passivity","receptivity","subjectivity"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pathicism' is a specialized term primarily encountered in philosophical and psychological discussions. It refers to the state of being passive or receptive, often in relation to emotions or external influences. Understanding this term requires familiarity with abstract concepts and a nuanced vocabulary. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The philosopher argued that pathicism is a fundamental aspect of human experience.","translation":"その哲学者は、受動性は人間の経験の根本的な側面であると主張した。","type":"noun","meaning_category":"受動性"},{"sentence":"In the novel, the protagonist's pathicism leads to their ultimate downfall.","translation":"その小説では、主人公の受動性が最終的な破滅につながる。","type":"noun","meaning_category":"感情に支配される状態"}]}