{"word":"Readmissions","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(plural only) The act or an instance of admitting again; specifically, the return of a patient to a hospital within a specified period after discharge.","english_definition":"Instances of being admitted again, especially the return of a patient to a hospital within a specified period after discharge.","examples":[{"sentence":"High readmissions rates are a concern for hospitals.","translation":"高い再入院率は病院にとって懸念事項です。"},{"sentence":"Efforts are being made to reduce readmissions for heart failure patients.","translation":"心不全患者の再入院を減らすための取り組みが行われています。"},{"sentence":"The hospital is tracking readmissions to improve patient care.","translation":"病院は患者ケアを改善するために再入院を追跡しています。"}],"collocations":["hospital readmissions","reduce readmissions","prevent readmissions","track readmissions","30-day readmissions","high readmissions rates"],"synonyms":["re-entries","re-admittance","re-entries","re-enrollments"],"antonyms":["discharges","releases"]}],"etymology":{"value":"Derived from 'readmit,' which combines the prefix 're-' (again) with 'admit' (to allow entry). The addition of '-s' makes it plural, referring to multiple instances of readmitting.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːədˈmɪʃənz/","syllables":"re-ad-mis-sions"},"inflection":{"noun_plural":"Readmissions"},"usage_notes":{"explanation":"'Readmissions' is primarily used in medical contexts to refer to the return of patients to a hospital or healthcare facility after they have been discharged. It is often used as a metric to assess the quality of care and the effectiveness of discharge planning. High readmission rates can indicate issues with patient education, follow-up care, or the management of chronic conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The readmission was high.","correct":"✓ The readmissions rate was high.","note":"'Readmission' (singular) refers to a single instance, while 'readmissions' (plural) is used when discussing rates or trends. Using 'readmission' to describe a rate is grammatically incorrect."},{"incorrect":"✗ Readmissions are when a patient leaves the hospital.","correct":"✓ Readmissions are when a patient returns to the hospital after being discharged.","note":"'Readmissions' refers to patients returning to the hospital, not leaving it. The definition must include the return aspect."}],"priority":"★★☆"},"related_words":{"derivatives":["readmit (verb)","readmittance (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency outside of medical and healthcare contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Readmissions' refers to the plural instances of patients being readmitted to a hospital, typically within a specific timeframe after their initial discharge. This term is commonly used in healthcare settings to evaluate the effectiveness of treatments, discharge procedures, and patient care. High readmission rates often indicate areas needing improvement in healthcare delivery, such as patient education, follow-up care, or chronic disease management. Understanding this term is crucial for those working in or studying healthcare administration, policy, and clinical practice."},"example_sentences":[{"sentence":"The hospital is implementing new strategies to reduce 30-day **readmissions**.","translation":"病院は30日以内の再入院を減らすための新しい戦略を実施しています。","type":"noun","meaning_category":"再入院"},{"sentence":"Analysis of **readmissions** data helps identify areas for quality improvement.","translation":"再入院データの分析は、質の改善のための分野を特定するのに役立ちます。","type":"noun","meaning_category":"再入院"},{"sentence":"Preventing unnecessary **readmissions** is a key goal of the care coordination program.","translation":"不必要な再入院を防ぐことは、ケアコーディネーションプログラムの重要な目標です。","type":"noun","meaning_category":"再入院"}]}