{"word":"straked","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"縞模様の、筋のある","english_definition":"Marked with strakes or streaks; striped.","examples":[{"sentence":"The straked petals of the tulip were quite striking.","translation":"そのチューリップの縞模様の花びらは非常に印象的だった。"},{"sentence":"The straked appearance of the rock suggested layers of different minerals.","translation":"その岩の筋のある外観は、異なる鉱物の層を示唆していた。"}],"collocations":["straked petals","straked rock","straked appearance"],"synonyms":["striped","streaked","banded","lined"],"antonyms":["unmarked","plain","unpatterned"]}],"etymology":{"value":"Derived from the word 'strake,' which originally referred to a plank of timber running along the length of a boat or ship's hull. The '-ed' suffix indicates the presence of strakes or streaks.","priority":"★★☆"},"pronunciation":{"ipa":"/streɪkt/","syllables":"straked (1 syllable)"},"inflection":{"adjective_forms":{"comparative":"more straked","superlative":"most straked"}},"usage_notes":{"explanation":"'Straked' is primarily used to describe surfaces or objects that have linear markings or streaks. It is not a commonly used word in everyday conversation, but it is more frequently found in descriptive writing, particularly when detailing natural patterns or textures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The straked the wall with paint.","correct":"✓ They streaked the wall with paint.","note":"'Straked' is an adjective, not a verb. The verb form would be 'to streak.'"},{"incorrect":"✗ The straked is beautiful.","correct":"✓ The straked pattern is beautiful.","note":"'Straked' needs to modify a noun. You can't say 'The straked is beautiful' by itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["strake (noun: a long plank or plating running along the length of a boat or ship's hull; a streak or stripe)","streak (noun: a long, thin line or mark of a different substance or color from its surroundings; verb: to mark with streaks)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Straked' is a relatively uncommon adjective used to describe something marked with streaks or stripes. It is more likely to be encountered in descriptive texts, particularly those relating to natural formations or patterns. Understanding the word requires a familiarity with less common vocabulary and an ability to interpret descriptive language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The straked marble countertop added a unique touch to the kitchen.","translation":"縞模様の大理石のカウンタートップは、キッチンに独特の趣を添えた。","type":"adjective","meaning_category":"縞模様の"},{"sentence":"The geologist noted the straked formations in the canyon walls.","translation":"地質学者は、峡谷の壁に見られる縞模様の地層に注目した。","type":"adjective","meaning_category":"筋のある"},{"sentence":"The straked plumage of the bird provided excellent camouflage.","translation":"その鳥の縞模様の羽毛は、優れた迷彩効果をもたらした。","type":"adjective","meaning_category":"縞模様の"}]}