{"word":"clasmatocytic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"貪食細胞の、破砕細胞性の","english_definition":"Relating to or characterized by clasmatocytes; phagocytic.","examples":[{"sentence":"The tissue sample showed a clasmatocytic reaction.","translation":"その組織サンプルは貪食細胞性の反応を示した。"},{"sentence":"Clasmatocytic cells are involved in the removal of debris.","translation":"破砕細胞性の細胞は、細胞残骸の除去に関与している。"}],"collocations":["clasmatocytic reaction","clasmatocytic activity"],"synonyms":["phagocytic","histiocytic"],"antonyms":[]}],"etymology":{"value":"From 'clasmatocyte' (a type of histiocyte or macrophage) + '-ic' (suffix meaning 'relating to'). 'Clasmatocyte' itself is derived from Greek 'klasma' (fragment) + 'kytos' (cell).","priority":"★★★"},"pronunciation":{"ipa":"/ˌklæzmətoʊˈsɪtɪk/","syllables":"clas-ma-to-cyt-ic"},"inflection":{},"usage_notes":{"explanation":"'Clasmatocytic' is a technical term primarily used in histology and pathology to describe cells or processes related to clasmatocytes, which are a type of macrophage involved in phagocytosis (engulfing and digesting cellular debris and foreign material). It is relatively uncommon in general language.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["clasmatocyte","clasmatosis"],"related_terms":["histiocyte","macrophage","phagocytosis"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - a technical term used in specific scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'clasmatocytic' is highly specialized and primarily encountered in the fields of histology and pathology. Understanding its meaning requires familiarity with cell biology and the immune system, specifically the role of macrophages in phagocytosis. Due to its technical nature, it is not typically used in general communication."},"example_sentences":[{"sentence":"The presence of numerous clasmatocytic cells indicated active tissue remodeling.","translation":"多数の貪食細胞の存在は、活発な組織リモデリングを示していた。","type":"adjective","meaning_category":"貪食細胞の"},{"sentence":"Clasmatocytic activity is essential for clearing damaged cells from the site of injury.","translation":"破砕細胞性の活動は、損傷部位から損傷した細胞を除去するために不可欠である。","type":"adjective","meaning_category":"破砕細胞性の"}]}