{"word":"Amphigaea","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"(Greek mythology) A primordial goddess representing the shadowy earth, particularly the underworld. Also, a name sometimes used for Gaia, the earth goddess.","english_definition":"In Greek mythology, Amphigaea is a primordial goddess representing the shadowy earth, particularly the underworld. It is also a name sometimes used for Gaia, the earth goddess.","examples":[{"sentence":"Amphigaea is a lesser-known figure compared to Gaia in Greek mythology.","translation":"ギリシャ神話において、アムピガイアはガイアに比べてあまり知られていない存在です。"}],"collocations":["primordial goddess","underworld","earth goddess","Greek mythology"],"synonyms":["Gaia","Earth"],"antonyms":[]}],"etymology":{"value":"The name \"Amphigaea\" comes from Greek roots, with \"amphi-\" meaning \"around\" or \"on both sides\" and \"Gaea\" referring to the Earth. It suggests the all-encompassing nature of the Earth, including its hidden or shadowy aspects.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæmfɪˈdʒiːə/","syllables":"Am-phi-gae-a"},"inflection":{},"usage_notes":{"explanation":"Amphigaea is a relatively obscure figure in Greek mythology, often conflated with or considered an aspect of Gaia. The name emphasizes the darker, more mysterious aspects of the Earth, such as the underworld or the hidden forces within the planet.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Amphigean (adjective)"],"related_figures":["Gaia","Uranus","Tartarus"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Extremely low frequency - rare mythological term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Amphigaea is a specialized term from Greek mythology, referring to a primordial goddess associated with the shadowy aspects of the Earth. Understanding this term requires familiarity with Greek mythology and its complex pantheon of deities. It is not commonly used outside of academic or mythological contexts."},"example_sentences":[{"sentence":"Some scholars interpret Amphigaea as representing the chthonic or underworld aspect of the Earth, in contrast to Gaia's more life-giving role.","translation":"一部の学者は、アムピガイアを、ガイアの生命を与える役割とは対照的に、大地のクトニオス的または冥府的な側面を表すものとして解釈しています。","type":"mythological context","meaning_category":"underworld goddess"},{"sentence":"The name Amphigaea suggests the all-encompassing nature of the Earth, including both its visible and hidden realms.","translation":"アムピガイアという名前は、目に見える領域と隠された領域の両方を含む、地球のすべてを包含する性質を示唆しています。","type":"etymological explanation","meaning_category":"earth goddess"}]}