{"word":"specification-based","meanings":[{"part_of_speech":"adjective","definition":"仕様に基づいた、仕様書に基づいた","english_definition":"Based on or conforming to a set of explicit requirements or specifications.","examples":[{"sentence":"We use a specification-based testing approach to ensure the software meets all requirements.","translation":"ソフトウェアがすべての要件を満たしていることを保証するために、仕様に基づいたテストアプローチを使用します。"},{"sentence":"The design is specification-based, adhering strictly to the client's documented needs.","translation":"設計は仕様に基づいており、クライアントの文書化されたニーズに厳密に準拠しています。"},{"sentence":"Specification-based modeling helps to create accurate and reliable simulations.","translation":"仕様に基づいたモデリングは、正確で信頼性の高いシミュレーションを作成するのに役立ちます。"}],"collocations":["specification-based testing","specification-based design","specification-based modeling","specification-based approach","specification-based development"],"synonyms":["requirement-based","criteria-based","rule-based","standard-based","compliant"],"antonyms":["ad hoc","unspecified","unstructured","heuristic"],"notes":"Often used in the context of software engineering, manufacturing, and other technical fields where adherence to precise specifications is crucial."}],"etymology":{"value":"Derived from the combination of 'specification' (a detailed description of requirements) and 'based' (founded or reliant upon).","priority":"2"},"pronunciation":{"ipa":"/ˌspɛsɪfɪˈkeɪʃən beɪst/","syllables":"spe-ci-fi-ca-tion-based"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'specification-based' indicates that something is developed, designed, or evaluated according to a predefined set of specifications. These specifications outline the detailed requirements, standards, or criteria that must be met. It emphasizes a structured and systematic approach, ensuring consistency and adherence to established guidelines.","priority":"3"},"common_mistakes":{"examples":[{"incorrect":"The specification-based is important.","correct":"Specification-based design is important.","note":"'Specification-based' is an adjective and needs to modify a noun."}],"priority":"1"},"related_words":{"derivatives":["specification","specify","specified"],"related_terms":["requirements engineering","software specification","design specification","test specification"]},"level_frequency":{},"readability_explanation":{"level":"B2","text":"The term 'specification-based' is used in technical contexts to describe processes, designs, or tests that are created following a detailed set of rules or requirements. It's common in fields like software development, engineering, and manufacturing, where it's important to have clear guidelines to ensure that products or systems work correctly."},"example_sentences":[{"sentence":"The software underwent specification-based testing to ensure it met all the functional requirements.","translation":"そのソフトウェアは、すべての機能要件を満たしていることを確認するために、仕様に基づいたテストを受けました。","type":"general","meaning_category":"testing"},{"sentence":"The manufacturing process is specification-based, ensuring each product is identical.","translation":"製造プロセスは仕様に基づいており、各製品が同一であることを保証します。","type":"general","meaning_category":"manufacturing"},{"sentence":"A specification-based approach was used to develop the new API.","translation":"新しいAPIを開発するために、仕様に基づいたアプローチが使用されました。","type":"general","meaning_category":"development"}]}