{"word":"Christ-imitating","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Imitating Christ; striving to emulate the life and teachings of Jesus Christ.","english_definition":"Attempting to live in a way that reflects the life and teachings of Jesus Christ.","examples":[{"sentence":"The monastery encouraged a Christ-imitating lifestyle of prayer and service.","translation":"その修道院は、祈りと奉仕によるキリストに倣う生活様式を奨励していた。"},{"sentence":"Her Christ-imitating compassion led her to volunteer at the homeless shelter.","translation":"彼女のキリストに倣う思いやりの心から、ホームレスシェルターでボランティアをするようになった。"},{"sentence":"He believed that true discipleship involved a Christ-imitating commitment to justice and peace.","translation":"彼は、真の弟子道とは、正義と平和に対するキリストに倣う献身であると信じていた。"}],"collocations":["Christ-imitating life","Christ-imitating love","Christ-imitating virtue","Christ-imitating service","Christ-imitating compassion"],"synonyms":["Christlike","Christ-centered","Godly","devout","pious","exemplary"],"antonyms":["unchristian","ungodly","secular","worldly"]}],"etymology":{"value":"Formed by combining \"Christ\" with \"imitating.\" \"Christ\" derives from the Greek \"Christos,\" meaning \"anointed one.\" \"Imitating\" comes from the Latin \"imitari,\" meaning \"to copy, to follow.\"","priority":"Medium"},"pronunciation":{"ipa":"/ˌkraɪst ˈɪmɪteɪtɪŋ/","syllables":"Christ-im-i-tat-ing"},"inflection":{"notes":"Adjective; does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"The term \"Christ-imitating\" describes a conscious and deliberate effort to model one's life after the example of Jesus Christ, as presented in the Gospels. This includes adopting his values, virtues, and behaviors, such as love, compassion, humility, service, and forgiveness. It is often used in religious contexts, particularly within Christianity.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Christ-imitating.","correct":"✓ He is Christ-imitating. / ✓ He is a Christ-imitating person.","note":"\"Christ-imitating\" is an adjective, so it needs to modify a noun. You can't say \"He is a Christ-imitating\" by itself. You can say \"He is Christ-imitating\" to describe his actions or character, or \"He is a Christ-imitating person\" to use it as an adjective modifying \"person.\""},{"incorrect":"✗ She is very Christ-imitating than her sister.","correct":"✓ She is more Christ-imitating than her sister.","note":"While \"Christ-imitating\" is an adjective, it is not typically used with comparative or superlative degrees (more/most). It's better to rephrase the sentence to avoid using comparative or superlative forms, such as \"She imitates Christ more closely than her sister.\" However, the provided correction is grammatically correct, even if less common."}],"priority":"Low"},"related_words":{"derivatives":["imitation (noun)","imitator (noun)","Christlike (adjective)","Christian (adjective, noun)","discipleship (noun)"],"phrasal_verbs":["None commonly associated with this term."],"priority":"Low"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. The term is relatively uncommon in general usage, primarily found in religious or theological contexts.","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term \"Christ-imitating\" describes someone who tries to live their life like Jesus Christ. This means they try to be kind, compassionate, forgiving, and helpful to others, just as Jesus was. It's a term mainly used by Christians to describe a way of living that reflects their faith. It's not a very common word, but it's used to describe a specific type of behavior and belief.","priority":"Medium"},"example_sentences":[{"sentence":"The book explores the concept of Christ-imitating love in marriage.","translation":"その本は、結婚におけるキリストに倣う愛の概念を探求している。","type":"adjective","meaning_category":"Religious/Spiritual"},{"sentence":"Through acts of service, she demonstrated a Christ-imitating spirit.","translation":"奉仕活動を通して、彼女はキリストに倣う精神を示した。","type":"adjective","meaning_category":"Religious/Ethical"},{"sentence":"He sought to cultivate Christ-imitating virtues in his daily life.","translation":"彼は日常生活の中でキリストに倣う徳を培おうと努めた。","type":"adjective","meaning_category":"Religious/Personal"}]}