{"word":"embolismic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(天文学)挿入の、閏の","english_definition":"Relating to the insertion of days or months into a calendar to reconcile it with the solar year.","examples":[{"sentence":"The embolismic months in the Babylonian calendar were added irregularly.","translation":"バビロニア暦の閏月は不規則に追加された。"},{"sentence":"Embolismic cycles are used in lunisolar calendars to keep them synchronized with the seasons.","translation":"太陰太陽暦では、季節とのずれを調整するために閏周期が用いられる。"}],"collocations":["embolismic month","embolismic year","embolismic cycle"],"synonyms":["intercalary","intercalated","lunar intercalary"],"antonyms":[]}],"etymology":{"value":"From the Greek word 'embolismos', meaning 'insertion'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛmbəˈlɪzmɪk/","syllables":"em-bo-lis-mic"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms (more embolismic, most embolismic), but these are rarely used."},"usage_notes":{"explanation":"The term 'embolismic' is primarily used in the context of calendars, particularly lunisolar calendars, which attempt to synchronize with both the lunar cycle and the solar year. Embolismic months or days are added to correct for the discrepancy between these two cycles. It's a technical term not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The embolismic event caused a major shift in climate.","correct":"✓ The intercalary month helped align the calendar with the seasons.","note":"'Embolismic' refers specifically to calendar adjustments, not general events or climate shifts."}],"priority":"★☆☆"},"related_words":{"derivatives":["embolism (医学用語: 塞栓症) - 語源は異なる","intercalation (挿入)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Embolismic' is a specialized term primarily encountered in discussions of calendars, astronomy, and historical timekeeping systems. It describes the process of inserting extra days or months into a calendar to maintain alignment with the solar year. Understanding this term requires familiarity with calendrical systems and astronomical concepts. It is not part of everyday vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The ancient Greeks used an embolismic calendar to reconcile lunar months with the solar year.","translation":"古代ギリシャ人は、太陰月と太陽暦を調整するために閏年暦を使用した。","type":"adjective","meaning_category":"閏の"},{"sentence":"The addition of an embolismic month ensured that Passover would always occur in the spring.","translation":"閏月を追加することで、過越の祭りは常に春に開催されることが保証された。","type":"adjective","meaning_category":"閏の"}]}