{"word":"jurisdictionalism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"管轄権主義、裁判権主義：国家の管轄権または裁判権の範囲を強調する原則または理論。","english_definition":"The principle or theory that emphasizes the scope of a state's jurisdiction or judicial power.","examples":[{"sentence":"The debate revolved around jurisdictionalism and the extent to which one country's laws could apply in another.","translation":"議論は管轄権主義と、ある国の法律が別の国でどの程度適用されるかという範囲を中心に展開された。"},{"sentence":"Jurisdictionalism often comes into play in international law when determining which court has the authority to hear a case.","translation":"管轄権主義は、どの裁判所が事件を審理する権限を持つかを決定する際に、国際法においてしばしば問題となる。"}],"collocations":["international jurisdictionalism (国際管轄権主義)","assert jurisdictionalism (管轄権主義を主張する)","principles of jurisdictionalism (管轄権主義の原則)"],"synonyms":["legal jurisdiction","territorial jurisdiction","judicial authority"],"antonyms":["extraterritoriality","universal jurisdiction"]}],"etymology":{"value":"\"Jurisdictionalism\"は、\"jurisdictional\"（管轄の）に \"-ism\"（主義）を付けた言葉です。\"Jurisdictional\"は、ラテン語の\"jurisdictio\"（裁判権、管轄権）に由来し、\"jus\"（法律）+ \"dicere\"（言う、宣言する）から構成されています。したがって、\"jurisdictionalism\"は、法律や管轄権の範囲を重視する考え方を表します。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒʊərɪsˈdɪkʃənəlɪzəm/","syllables":"ju-ris-dic-tion-al-ism"},"inflection":{"noun_plural":"jurisdictionalisms"},"usage_notes":{"explanation":"\"Jurisdictionalism\"は、主に法律、政治学、国際関係の分野で使用される専門用語です。国家の主権と、その管轄権の範囲を強調する際に用いられます。この概念は、国際的な紛争解決や、国境を越えた犯罪の取り扱いにおいて重要な意味を持ちます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The jurisdictionalism of the case was clear.","correct":"✓ The jurisdiction in this case was clear.","note":"\"Jurisdictionalism\"は主義や理論を指す言葉であり、具体的な管轄権そのものを指す場合は、\"jurisdiction\"（管轄権）を使用します。"},{"incorrect":"✗ He advocated for jurisdictionalism over human rights.","correct":"✓ He advocated for national sovereignty over international human rights laws.","note":"\"Jurisdictionalism\"は管轄権の範囲を強調する概念であり、特定の政策や立場を直接的に支持するものではありません。人権などの具体的な問題に対して管轄権を主張する場合は、より具体的な表現を使用します。"}],"priority":"★☆☆"},"related_words":{"derivatives":["jurisdictional (形容詞: 管轄の)","jurisdiction (名詞: 管轄権、裁判権)"],"related_terms":["territoriality (領土権)","sovereignty (主権)","international law (国際法)","conflict of laws (抵触法)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Jurisdictionalism\" is a specialized term primarily used in legal, political science, and international relations contexts. It refers to the principle or theory that emphasizes the scope and authority of a state's jurisdiction or judicial power. Understanding this term requires familiarity with concepts such as sovereignty, territoriality, and international law. It is often discussed in the context of resolving international disputes or handling cross-border criminal activities. The term implies a focus on the boundaries and limits of legal authority, particularly as it relates to nation-states."},"example_sentences":[{"sentence":"The country's adherence to strict jurisdictionalism made international cooperation difficult.","translation":"その国が厳格な管轄権主義を固守したため、国際協力は困難になった。","type":"noun","meaning_category":"管轄権主義"},{"sentence":"Critics argue that an overemphasis on jurisdictionalism can hinder the pursuit of justice in cases involving human rights violations.","translation":"批判家たちは、管轄権主義を過度に強調することは、人権侵害に関わる事件における正義の追求を妨げると主張している。","type":"noun","meaning_category":"管轄権主義"}]}