{"word":"citrometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A device for measuring the acidity of citrus fruit juice.","english_definition":"An instrument for ascertaining the amount of citric acid in a solution, especially in citrus fruit juice.","examples":[{"sentence":"The citrometer indicated a high level of citric acid in the lemon juice.","translation":"シトロメーターは、レモンジュース中のクエン酸濃度が高いことを示しました。"}],"collocations":["citrometer reading","citrometer analysis"],"synonyms":["acidimeter","titrator"],"antonyms":[]}],"etymology":{"value":"Combination of 'citric' (referring to citrus fruits) and '-meter' (measuring device).","priority":"★★★"},"pronunciation":{"ipa":"/saɪˈtrɒmɪtər/","syllables":"ci-trom-e-ter"},"inflection":{"noun_plural":"citrometers"},"usage_notes":{"explanation":"The citrometer is a specialized instrument primarily used in the food and beverage industry to ensure the quality and consistency of citrus fruit products. It is less commonly used in general scientific research.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Use a pH meter instead of citrometer for measuring sugar content.","correct":"✓ Use a refractometer instead of citrometer for measuring sugar content.","note":"A citrometer measures acidity (citric acid), not sugar content. A refractometer is used for measuring sugar content."}],"priority":"★★☆"},"related_words":{"derivatives":["citric","citric acid","-meter"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'citrometer' refers to a specialized scientific instrument. Understanding its function requires knowledge of chemistry and food science. It is not a commonly used word and is primarily encountered in technical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The juice's acidity was determined using a calibrated citrometer.","translation":"そのジュースの酸度は、校正されたシトロメーターを用いて測定された。","type":"general","meaning_category":"measurement"},{"sentence":"The laboratory uses a citrometer to ensure quality control of citrus extracts.","translation":"その研究所では、シトラス抽出物の品質管理を確実にするためにシトロメーターを使用している。","type":"industrial","meaning_category":"quality control"}]}