{"word":"photokeratitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"光線角膜炎（紫外線による角膜の炎症）","english_definition":"Inflammation of the cornea caused by exposure to ultraviolet (UV) rays.","examples":[{"sentence":"He developed photokeratitis after skiing without goggles on a sunny day.","translation":"彼は晴れた日にゴーグルなしでスキーをした後、光線角膜炎を発症した。"},{"sentence":"Welders are at risk of photokeratitis if they don't use proper eye protection.","translation":"溶接工は適切な目の保護具を使用しない場合、光線角膜炎のリスクがある。"},{"sentence":"Photokeratitis is often referred to as 'snow blindness' when it occurs after exposure to reflected sunlight on snow.","translation":"光線角膜炎は、雪面で反射した日光にさらされた後に発生した場合、「雪眼」と呼ばれることが多い。"}],"collocations":["develop photokeratitis","treat photokeratitis","prevent photokeratitis","risk of photokeratitis","symptoms of photokeratitis"],"synonyms":["snow blindness","arc eye","welder's flash","ultraviolet keratitis"],"antonyms":[]}],"etymology":{"value":"The term 'photokeratitis' is derived from the Greek words 'photo' (light), 'kerato' (cornea), and 'itis' (inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfoʊtoʊˌkɛrəˈtaɪtɪs/","syllables":"pho-to-ker-a-ti-tis"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Photokeratitis is a painful condition that typically resolves within a few days. Prevention is key, and involves wearing appropriate eye protection when exposed to UV light sources such as the sun (especially at high altitudes or near reflective surfaces like snow or water) or welding arcs. Symptoms include pain, redness, blurred vision, tearing, and a gritty sensation in the eyes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He got photokeratosis from staring at the sun.","correct":"✓ He got photokeratitis from staring at the sun.","note":"Photokeratosis is a different condition involving skin damage. Use 'photokeratitis' for corneal inflammation."}],"priority":"★★☆"},"related_words":{"derivatives":["keratitis","cornea","ultraviolet","inflammation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency - Primarily used in medical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Photokeratitis' is a medical term referring to inflammation of the cornea caused by ultraviolet light exposure. It's most commonly associated with activities like welding without eye protection or skiing in bright sunlight without goggles. The condition is usually temporary but can be very painful. Prevention is key, involving the use of appropriate eye protection. The term is primarily used in medical and technical contexts, making it less common in everyday conversation."},"example_sentences":[{"sentence":"Prolonged exposure to UV radiation can cause **photokeratitis**.","translation":"紫外線への長時間の暴露は光線角膜炎を引き起こす可能性がある。","type":"general","meaning_category":"cause"},{"sentence":"The doctor diagnosed him with **photokeratitis** after examining his eyes.","translation":"医師は彼の目を診察した後、光線角膜炎と診断した。","type":"diagnosis","meaning_category":"diagnosis"},{"sentence":"Wearing sunglasses with UV protection helps prevent **photokeratitis**.","translation":"紫外線カットのサングラスをかけることは、光線角膜炎の予防に役立つ。","type":"prevention","meaning_category":"prevention"}]}