{"word":"palaeoceanography","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"古海洋学（過去の海洋の物理的、化学的、生物学的状態の研究）","english_definition":"The study of the history of the oceans in the geologic past with regard to circulation, chemistry, biology, geology and patterns of sedimentation and biological productivity.","examples":[{"sentence":"Palaeoceanography helps us understand past climate changes.","translation":"古海洋学は、過去の気候変動を理解するのに役立ちます。"},{"sentence":"The palaeoceanography of the Cretaceous period is a topic of intense research.","translation":"白亜紀の古海洋学は、集中的な研究テーマです。"}],"collocations":["palaeoceanographic data (古海洋学的データ)","palaeoceanographic research (古海洋学的研究)","reconstructing palaeoceanography (古海洋学を再構築する)"],"synonyms":["paleoceanography"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'palaios' (ancient), 'okeanos' (ocean), and 'graphia' (writing, description).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpælioʊˌoʊʃəˈnɒɡrəfi/","syllables":"pa-le-o-o-she-no-gra-phy"},"inflection":{"noun_plural":"palaeoceanographies"},"usage_notes":{"explanation":"Palaeoceanography is an interdisciplinary field that combines geology, chemistry, biology, and physics to reconstruct past ocean conditions. It relies on proxies such as sediment cores, microfossils, and geochemical signatures to infer past temperatures, salinity, circulation patterns, and biological productivity. The field is crucial for understanding long-term climate variability and the role of the oceans in the Earth system.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ paleo-oceanography","correct":"✓ palaeoceanography","note":"The correct spelling is 'palaeoceanography' (British English) or 'paleoceanography' (American English)."},{"incorrect":"✗ palaeoceanography is the study of current oceans.","correct":"✓ palaeoceanography is the study of past oceans.","note":"Palaeoceanography focuses on the study of past oceans, not current ones."}],"priority":"★★☆"},"related_words":{"derivatives":["palaeoceanographer (古海洋学者)","palaeoceanographic (古海洋学の)"],"related_fields":["geology (地質学)","climatology (気候学)","oceanography (海洋学)","geochemistry (地球化学)","paleontology (古生物学)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Palaeoceanography' is a specialized term referring to the scientific study of the history of the oceans. It involves examining past ocean conditions, such as temperature, salinity, and circulation patterns, using geological and biological evidence. This field is important for understanding long-term climate changes and the role of oceans in Earth's history. It is a complex topic typically encountered in advanced scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The analysis of sediment cores is a key method in palaeoceanography.","translation":"堆積物コアの分析は、古海洋学における重要な手法です。","type":"general","meaning_category":"method"},{"sentence":"Palaeoceanography helps us to understand the ocean's role in past climate changes.","translation":"古海洋学は、過去の気候変動における海洋の役割を理解するのに役立ちます。","type":"general","meaning_category":"purpose"},{"sentence":"Advances in palaeoceanography have improved our understanding of past sea-level changes.","translation":"古海洋学の進歩により、過去の海面変動に関する理解が深まりました。","type":"general","meaning_category":"advances"}]}