{"word":"Bijasal","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A large deciduous tree (Pterocarpus marsupium) found in India, Nepal, and Sri Lanka, known for its medicinal properties and durable timber.","english_definition":"A large deciduous tree (Pterocarpus marsupium) found in India, Nepal, and Sri Lanka, known for its medicinal properties and durable timber.","examples":[{"sentence":"The Bijasal tree is valued in Ayurveda for its use in treating diabetes.","translation":"ビジャサルは、糖尿病の治療における使用のためにアーユルヴェーダで評価されています。"},{"sentence":"Furniture made from Bijasal wood is known for its termite resistance.","translation":"ビジャサルの木で作られた家具は、防蟻性で知られています。"}],"collocations":["Bijasal wood","Bijasal extract","Bijasal tree"],"synonyms":["Indian Kino Tree","Malabar Kino Tree","Pterocarpus marsupium"],"antonyms":[]}],"etymology":{"value":"The name 'Bijasal' is derived from local Indian languages. 'Bija' refers to seed, and 'sal' is a common term for trees with durable wood.","priority":"★★★"},"pronunciation":{"ipa":"/biːˈdʒɑːsəl/","syllables":"Bi-ja-sal"},"inflection":{},"usage_notes":{"explanation":"Bijasal is primarily known as the name of a specific tree species. It is often used in the context of forestry, botany, traditional medicine (Ayurveda), and woodworking.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Kino (gum resin extracted from the tree)"],"related_species":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Bijasal' is a specialized term referring to a specific tree species, Pterocarpus marsupium. It is likely to be encountered in contexts related to botany, forestry, traditional Indian medicine (Ayurveda), or discussions of timber and woodworking in South Asia. Understanding the term requires some familiarity with these fields."},"example_sentences":[{"sentence":"The forest department is promoting the cultivation of Bijasal trees.","translation":"森林局はビジャサルの木の栽培を推進しています。","type":"noun","meaning_category":"tree"},{"sentence":"Studies have shown the efficacy of Bijasal extract in managing blood sugar levels.","translation":"研究により、ビジャサル抽出物が血糖値の管理に有効であることが示されています。","type":"noun","meaning_category":"tree"}]}