{"word":"flatteringly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"お世辞にも、追従的に、人に気に入られるように","english_definition":"in a way that praises someone excessively or insincerely, especially to win their favor; in a way that makes someone look or seem more attractive or appealing than they really are.","examples":[{"sentence":"She spoke flatteringly of his work, hoping to get a promotion.","translation":"彼女は昇進を期待して、彼（上司）の仕事を褒めそやした。"},{"sentence":"The dress fit her flatteringly, accentuating her figure.","translation":"そのドレスは彼女の体型を強調し、彼女を魅力的に見せた。"},{"sentence":"The lighting in the studio was designed to photograph the models flatteringly.","translation":"スタジオの照明は、モデルを魅力的に撮影するように設計されていた。"}],"collocations":["speak flatteringly","dress flatteringly","photograph flatteringly","fit flatteringly"],"synonyms":["complimentarily","appreciatively","obsequiously","sycophantically","attractively","becomingly","advantageously"],"antonyms":["unflatteringly","critically","disparagingly","unattractively"]}],"etymology":{"value":"The word 'flatteringly' is derived from the verb 'to flatter', which comes from the Old French 'flater' meaning 'to stroke, caress, or please'. The suffix '-ingly' turns it into an adverb, indicating the manner in which something is done.","priority":"★★★"},"pronunciation":{"ipa":"/ˈflætərɪŋli/","syllables":"flat-ter-ing-ly"},"inflection":{"notes":"As an adverb, 'flatteringly' does not have different forms."},"usage_notes":{"explanation":"'Flatteringly' is used to describe actions or qualities that either involve insincere praise to gain favor or enhance someone's appearance in a pleasing way. It has two main senses: one related to giving flattery and another related to enhancing attractiveness. The context usually clarifies which sense is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She looked very flatteringly.","correct":"✓ She looked very attractive. / ✓ The dress fit her flatteringly.","note":"'Flatteringly' describes *how* something is done or *how* something looks, not the state of a person. Use 'attractive' or a similar adjective to describe a person's appearance. 'Flatteringly' is used to describe the *effect* of something on a person's appearance."},{"incorrect":"✗ He complimented flatteringly to get a raise.","correct":"✓ He complimented her flatteringly to get a raise. / ✓ He used flattery to get a raise.","note":"'Flatteringly' is an adverb that modifies a verb. The sentence needs a verb that 'flatteringly' can modify, or you can rephrase the sentence to use the noun 'flattery'."}],"priority":"★★☆"},"related_words":{"derivatives":["flatter (verb)","flattery (noun)","flattering (adjective)","unflattering (adjective)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'flatteringly' is an adverb that describes something done in a way that is excessively complimentary, often insincerely, or in a way that enhances someone's appearance. It is not a common word, so it is more likely to be encountered in advanced texts or conversations. Understanding its nuances requires a good grasp of vocabulary and context. It's important to distinguish its use from simpler words like 'attractively' or 'complimentarily', as 'flatteringly' carries a more specific connotation of either insincerity or enhanced appearance.","priority":"★★☆"},"example_sentences":[{"sentence":"The designer spoke flatteringly of the actress's talent, hoping she would wear his clothes.","translation":"デザイナーは女優が自分の服を着てくれることを期待して、彼女の才能を褒めそやした。","type":"general","meaning_category":"Praising insincerely"},{"sentence":"The soft lighting in the restaurant made everyone look flatteringly young.","translation":"レストランの柔らかな照明は、誰もが若く見えるようにした。","type":"general","meaning_category":"Enhancing appearance"},{"sentence":"The article described the politician flatteringly, avoiding any mention of his scandals.","translation":"記事は政治家のスキャンダルには一切触れず、彼を褒めそやした。","type":"general","meaning_category":"Praising insincerely"},{"sentence":"The dress was cut flatteringly to accentuate her curves.","translation":"そのドレスは彼女の曲線を強調するように魅力的にカットされていた。","type":"general","meaning_category":"Enhancing appearance"}]}