{"word":"fumigatories","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 燻蒸剤、燻蒸消毒剤","english_definition":"Substances used in fumigation, the process of using gaseous pesticides to disinfect or exterminate pests in an enclosed space.","examples":[{"sentence":"The old house was filled with the smell of fumigatories after the pest control service had finished.","translation":"害虫駆除サービスが終わった後、古い家は燻蒸剤の匂いで満たされていた。"},{"sentence":"Fumigatories are often used in agriculture to protect crops from insects and other pests.","translation":"燻蒸剤は、農作物を昆虫やその他の害虫から保護するために、農業でよく使用される。"}],"collocations":["use fumigatories","apply fumigatories","fumigatories for pest control","types of fumigatories"],"synonyms":["fumigant","disinfectant","pesticide","insecticide"],"antonyms":[]}],"etymology":{"value":"Derived from 'fumigate,' which comes from the Latin 'fumigare,' meaning 'to smoke, to perfume with smoke.' The suffix '-tories' indicates substances or things related to the process of fumigation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfjuːmɪˈɡeɪtəriz/","syllables":"fu-mi-ga-to-ries"},"inflection":{"noun_plural":"fumigatories (already plural)"},"usage_notes":{"explanation":"'Fumigatories' is a plural noun referring to the actual substances used in fumigation. Fumigation is the process, while fumigatories are the materials. It is a relatively technical term, most commonly found in contexts related to pest control, agriculture, and public health.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fumigatory was very effective.","correct":"✓ The fumigatory substance was very effective. / ✓ The fumigatories were very effective.","note":"'Fumigatories' is a plural noun, so it requires a plural verb. If referring to a single substance, use 'fumigatory substance' or a similar construction."}],"priority":"★★☆"},"related_words":{"derivatives":["fumigate (verb: to disinfect with fumes)","fumigation (noun: the act of disinfecting with fumes)","fumigator (noun: a person or device that fumigates)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'fumigatories' is a technical term primarily used in contexts related to pest control, agriculture, and public health. It refers to the substances used in fumigation. Due to its specialized usage, it is not commonly encountered in everyday language. Understanding the root word 'fumigate' can aid in comprehending its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The warehouse was treated with strong fumigatories to eliminate the rodent infestation.","translation":"倉庫は、ネズミの大量発生を根絶するために、強力な燻蒸剤で処理された。","type":"noun","meaning_category":"燻蒸剤"},{"sentence":"Proper ventilation is crucial after the application of fumigatories to ensure safety.","translation":"安全を確保するために、燻蒸剤の適用後は適切な換気が不可欠である。","type":"noun","meaning_category":"燻蒸剤"}]}