{"word":"resentationally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"In a resentational manner; with resentment.","english_definition":"In a way that expresses or shows feelings of anger, bitterness, or indignation at having been treated unfairly.","examples":[{"sentence":"He spoke resentationally about his former boss, detailing all the ways he felt he had been mistreated.","translation":"彼は以前の上司について、不当な扱いを受けたと感じたすべての方法を詳しく述べ、恨みがましく語った。"},{"sentence":"She resentationally refused to help, making it clear she felt she had already done more than her fair share.","translation":"彼女は、自分はすでに自分の分け前以上に行ったと感じていることを明らかにし、恨みがましく助けを拒否した。"}],"collocations":["speak resentationally","refuse resentationally","act resentationally"],"synonyms":["bitterly","indignantly","angrily","acrimoniously","disgruntledly"],"antonyms":["happily","gratefully","willingly"]}],"etymology":{"value":"Derived from 'resentational,' which is formed from 'resent' (to feel bitterness or indignation about something) + '-ment' (a suffix indicating a state or condition) + '-al' (a suffix forming an adjective) + '-ly' (a suffix forming an adverb).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌrɪˌzɛnˈteɪʃənəli/","syllables":"re-sen-ta-tion-al-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Resentationally' describes actions or speech performed with a clear display of resentment. It indicates not just that someone is resentful, but that they are actively expressing that resentment in their behavior or words. The term is relatively uncommon and often replaced by more common synonyms like 'bitterly' or 'indignantly.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She resentationally smiled.","correct":"✓ She smiled resentfully.","note":"Smiling is generally associated with positive emotions. To convey a forced or insincere smile masking resentment, 'resentfully' is more appropriate. 'Resentationally' is better suited for describing speech or actions that directly express resentment."},{"incorrect":"✗ He felt resentationally.","correct":"✓ He felt resentful.","note":"'Resentationally' is an adverb and modifies verbs, adjectives, or other adverbs. To describe a feeling, use the adjective 'resentful.'"}],"priority":"★★☆"},"related_words":{"derivatives":["resent (verb)","resentment (noun)","resentful (adjective)","resentfully (adverb)","resentation (noun - rare)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Very rare and specialized vocabulary)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Resentationally' is a rare adverb that describes doing something in a way that shows you feel bitter or angry because you think you've been treated unfairly. It's not a common word, so you'll likely encounter it in formal writing or speech when someone wants to emphasize the expression of resentment. It's formed from the more common words 'resent' and 'resentment.'"},"example_sentences":[{"sentence":"The disgruntled employee resentationally submitted his resignation, detailing every grievance in a lengthy email.","translation":"不満を抱いた従業員は、長文のメールですべての不満を詳細に述べ、恨みがましく辞表を提出した。","type":"adverb","meaning_category":"expressing resentment"},{"sentence":"She resentationally recounted the events of the meeting, emphasizing the perceived slights and injustices.","translation":"彼女は、会議の出来事を恨みがましく語り、認識された侮辱と不正を強調した。","type":"adverb","meaning_category":"expressing resentment"}]}