{"word":"merohedric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(結晶学で)半面像を示す、部分的な対称性を持つ","english_definition":"(crystallography) Exhibiting only half the number of faces required by the highest symmetry of the crystal system. Having a crystal symmetry in which only some of the faces required by the full symmetry are present.","examples":[{"sentence":"Merohedric crystal forms can be difficult to identify due to the missing faces.","translation":"半面像の結晶形は、面が欠けているため、識別が難しいことがある。"},{"sentence":"The crystal structure was determined to be merohedric based on the X-ray diffraction pattern.","translation":"その結晶構造は、X線回折パターンに基づいて半面像であると判断された。"}],"collocations":["merohedric crystal","merohedric twinning","merohedric symmetry"],"synonyms":["hemimorphic","hemihedral"],"antonyms":["holohedric","euhedral"]}],"etymology":{"value":"Derived from the Greek words 'meros' (part, portion), 'hedra' (face), and '-ic' (pertaining to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪəroʊˈhiːdrɪk/","syllables":"me-ro-he-dric"},"inflection":{},"usage_notes":{"explanation":"'Merohedric' is a term used specifically in crystallography to describe crystals that do not exhibit the full symmetry expected for their crystal system. This means that some of the faces that would normally be present are missing, leading to a reduced or partial symmetry. Merohedric forms can arise due to various factors during crystal growth.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["merohedrism (noun)"],"related_terms":["crystal system","crystallography","symmetry","holohedric","twinning"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'merohedric' is a specialized term used in crystallography. It describes crystals that have a reduced symmetry compared to the ideal symmetry of their crystal system. Understanding this term requires knowledge of basic crystallography concepts such as crystal systems and symmetry elements."},"example_sentences":[{"sentence":"The presence of merohedric twinning complicated the analysis of the crystal structure.","translation":"半面像双晶の存在が、結晶構造の解析を複雑にした。","type":"adjective","meaning_category":"crystallography"},{"sentence":"Careful observation is needed to identify merohedric forms in mineral samples.","translation":"鉱物サンプル中の半面像を識別するには、注意深い観察が必要である。","type":"adjective","meaning_category":"crystallography"}]}