{"word":"Swadeshi","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"スワデーシー：インド独立運動における、自国産品の利用奨励および外国製品の排斥運動","english_definition":"Swadeshi: A political movement in India advocating the use of domestically produced goods and the boycott of foreign products, particularly British goods, to promote self-sufficiency and national independence.","examples":[{"sentence":"The Swadeshi movement played a crucial role in India's struggle for independence.","translation":"スワデーシー運動はインドの独立闘争において重要な役割を果たした。"},{"sentence":"Participants in the Swadeshi movement promoted the use of khadi, hand-spun cotton cloth.","translation":"スワデーシー運動の参加者は、手紡ぎの綿布であるカディの使用を奨励した。"}],"collocations":["Swadeshi movement (スワデーシー運動)","promote Swadeshi (スワデーシーを推進する)","boycott foreign goods (外国製品をボイコットする)","Indian independence movement (インド独立運動)"],"synonyms":["self-reliance","nationalism","economic independence","boycott"],"antonyms":["foreign goods","imported goods","dependence on foreign products"]},{"part_of_speech":"adjective","definition":"国産の、自国の","english_definition":"Of or relating to goods made in one's own country; indigenous.","examples":[{"sentence":"Swadeshi products were seen as a symbol of national pride.","translation":"国産品は国民の誇りの象徴と見なされた。"},{"sentence":"The government is encouraging the use of Swadeshi technology.","translation":"政府は国産技術の使用を奨励している。"}],"collocations":["Swadeshi goods (国産品)","Swadeshi technology (国産技術)","Swadeshi industry (国内産業)"],"synonyms":["domestic","indigenous","local","national"],"antonyms":["foreign","imported","international"]}],"etymology":{"value":"Sanskrit origin, from 'swa' (own) and 'desh' (country); literally meaning 'of one's own country'.","priority":"★★★"},"pronunciation":{"ipa":"/sʋəˈdeɪʃi/","syllables":"Swa-de-shi"},"inflection":{"notes":"It is a noun and adjective, so inflection is not applicable."},"usage_notes":{"explanation":"'Swadeshi' is a term deeply rooted in the Indian independence movement. It represents a commitment to self-sufficiency and the promotion of local industries while rejecting foreign dependence. It is often used in historical and political contexts related to India.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is wearing a foreign Swadeshi cloth.","correct":"✓ He is wearing a Swadeshi cloth.","note":"'Swadeshi' already implies that the cloth is domestically produced, so adding 'foreign' is contradictory."},{"incorrect":"✗ The Swadeshi movement is about importing more goods.","correct":"✓ The Swadeshi movement is about promoting domestic goods.","note":"The core principle of Swadeshi is to promote domestic production and boycott foreign goods."}],"priority":"★★☆"},"related_words":{"derivatives":["Swadeshi movement","Swadeshi goods"],"phrases":["Atma Nirbhar Bharat (Self-Reliant India)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to Indian history and politics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Swadeshi' is a term primarily used in the context of Indian history and politics, specifically referring to the movement promoting self-sufficiency and the use of domestically produced goods. It requires an understanding of Indian history to fully grasp its significance. It is not commonly used in general English conversation outside of discussions about India.","priority":"★★☆"},"example_sentences":[{"sentence":"The spirit of Swadeshi is still relevant in today's globalized world.","translation":"スワデーシーの精神は、今日のグローバル化した世界でも依然として重要である。","type":"noun","meaning_category":"Indian independence movement"},{"sentence":"The company is committed to producing Swadeshi products.","translation":"その会社は国産品の生産に力を入れている。","type":"adjective","meaning_category":"domestic"}]}