{"word":"unresectability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"切除不能性、手術不適応","english_definition":"The state or condition of being unresectable; the inability to be surgically removed.","examples":[{"sentence":"The unresectability of the tumor was determined by imaging studies.","translation":"腫瘍の切除不能性は画像検査によって判断された。"},{"sentence":"Due to its location near vital organs, the cancer was deemed to have unresectability.","translation":"重要な臓器の近くにあるため、その癌は切除不能と判断された。"}],"collocations":["tumor unresectability","cancer unresectability","surgical unresectability"],"synonyms":["inoperability","nonresectability"],"antonyms":["resectability","operability"]}],"etymology":{"value":"Derived from 'un-' (not), 'resectable' (able to be surgically removed), and '-ity' (state or condition).","priority":"☆☆☆"},"pronunciation":{"ipa":"ˌʌnrɪˈsɛktəˈbɪləti/","syllables":"un-re-sec-ta-bil-i-ty"},"inflection":{"noun_plural":"unresectabilities (rarely used)"},"usage_notes":{"explanation":"'Unresectability' is a medical term primarily used in oncology and surgery. It refers to the situation where a tumor or other abnormal tissue cannot be surgically removed, typically because it is too large, has spread to vital organs, or is located in an inaccessible area. The determination of unresectability is crucial for treatment planning, as it often necessitates alternative therapies such as chemotherapy, radiation therapy, or palliative care.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The doctor said the tumor had unresectable.","correct":"The doctor said the tumor had unresectability.","note":"'Unresectable' is an adjective, while 'unresectability' is a noun. Use the noun form to describe the state of being unresectable."}],"priority":"☆☆☆"},"related_words":{"derivatives":["unresectable (adjective)","resect (verb)","resection (noun)","resectable (adjective)"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Unresectability' is a highly specialized medical term. It is primarily encountered in professional medical contexts, such as oncology reports, surgical evaluations, and medical research papers. The word's complexity and specific usage make it unlikely to be found in general English texts or everyday conversation. Understanding this term requires a strong background in medical terminology.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The patient's advanced stage of pancreatic cancer indicated unresectability, making surgical intervention impossible.","translation":"患者の進行した膵臓癌の病期は切除不能性を示しており、外科的介入は不可能であった。","type":"general","meaning_category":"切除不能性"},{"sentence":"Factors contributing to the unresectability included encasement of major blood vessels and distant metastasis.","translation":"切除不能性の要因としては、主要血管の包み込みと遠隔転移が挙げられた。","type":"technical","meaning_category":"切除不能性"}]}