{"word":"Backwardation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(金融) 逆ザヤ、期近高、順鞘 (先物市場で、期近物の価格が期先物よりも高い状態)","english_definition":"(finance) a market situation in which the price of a commodity's forward or futures contract is trading below the expected spot price at contract maturity; also : the condition in which futures prices are progressively lower in the more distant delivery months.","examples":[{"sentence":"The oil market is currently experiencing backwardation, indicating strong immediate demand.","translation":"原油市場は現在、逆ザヤを経験しており、これは強い即時需要を示している。"},{"sentence":"Backwardation can be a sign of a supply shortage in the short term.","translation":"逆ザヤは、短期的な供給不足の兆候となり得る。"}],"collocations":["in backwardation (逆ザヤの状態)","experience backwardation (逆ザヤを経験する)","oil backwardation (原油の逆ザヤ)","market backwardation (市場の逆ザヤ)"],"synonyms":["inverted market","inverted yield curve"],"antonyms":["contango (順ザヤ)"],"notes":"Backwardation is the opposite of contango, where future prices are higher than spot prices."}],"etymology":{"value":"The term is derived from 'backward' + '-ation'. It describes a situation where the future price is 'backward' or lower than the spot price.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbækwərˈdeɪʃən/","syllables":"back-ward-a-tion"},"inflection":{"noun_plural":"backwardations"},"usage_notes":{"explanation":"'Backwardation' is a term primarily used in commodity and futures markets. It describes a situation where the current (spot) price of an asset is higher than its futures price. This typically happens when there is a high demand for the commodity right now, or concerns about short-term supply. It is the opposite of 'contango', where futures prices are higher than spot prices.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The market is in contango, which means it's backwardation.","correct":"✓ The market is in contango, which is the opposite of backwardation.","note":"Contango and backwardation are opposite market conditions. Don't confuse them."}],"priority":"★★☆"},"related_words":{"derivatives":["contango (順ザヤ)","futures contract (先物契約)","spot price (直物価格)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Backwardation' is a specialized term used in finance, particularly in commodity markets. It describes a situation where the price of a futures contract is lower than the expected spot price at the time of the contract's maturity. This is often driven by immediate demand or concerns about short-term supply. Understanding this term requires familiarity with financial markets and futures trading. It is the opposite of 'contango'. "},"example_sentences":[{"sentence":"The gold market moved into backwardation due to increased investor demand for physical gold.","translation":"金市場は、現物の金に対する投資家の需要増加により、逆ザヤに移行した。","type":"noun","meaning_category":"金融"},{"sentence":"Analysts believe the current backwardation in natural gas prices is temporary.","translation":"アナリストは、現在の天然ガス価格の逆ザヤは一時的なものだと考えている。","type":"noun","meaning_category":"金融"}]}