{"word":"paddywatch","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にアイルランド、軽蔑的) アイルランド人に対する差別的な監視や取り締まり","english_definition":"(chiefly Ireland, derogatory) discriminatory surveillance or policing directed against Irish people.","examples":[{"sentence":"The community accused the police of engaging in paddywatch tactics.","translation":"地域社会は警察がアイルランド人に対する差別的な監視戦術を行っていると非難した。"},{"sentence":"He claimed that the increased security measures were just another form of paddywatch.","translation":"彼は、強化された警備体制は、アイルランド人に対する差別的な監視の別の形にすぎないと主張した。"}],"collocations":["engage in paddywatch","paddywatch tactics","another form of paddywatch"],"synonyms":["discriminatory policing","racial profiling (in this specific context)"],"antonyms":[]},{"part_of_speech":"verb","definition":"(主にアイルランド、軽蔑的) アイルランド人に対して差別的な監視や取り締まりを行う","english_definition":"(chiefly Ireland, derogatory) to engage in discriminatory surveillance or policing directed against Irish people.","examples":[{"sentence":"They were accused of paddywatching the Irish community.","translation":"彼らはアイルランド人コミュニティを差別的に監視していると非難された。"},{"sentence":"The police denied that they were paddywatching anyone.","translation":"警察は誰かを差別的に監視していることを否定した。"}],"collocations":["paddywatch the community","paddywatch someone"],"synonyms":["racially profile (in this specific context)"],"antonyms":[]}],"etymology":{"value":"\"Paddy\" はアイルランド人を指す軽蔑的な言葉であり、\"watch\" は監視や取り締まりを意味する。この言葉は、アイルランド人に対する差別的な監視や取り締まりを指すために作られた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpædiˌwɒtʃ/","syllables":"pad-dy-watch"},"inflection":{"noun_plural":"paddywatches","verb_forms":{"present_simple":["paddywatch","paddywatches"],"past_simple":"paddywatched","past_participle":"paddywatched","present_participle":"paddywatching"}},"usage_notes":{"explanation":"\"paddywatch\" は非常に攻撃的な言葉であり、使用は避けるべきです。この言葉は、アイルランド人に対する差別的な行動を非難するために使われます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The security guard was just paddywatching.","correct":"✓ The security guard was engaging in racial profiling.","note":"\"paddywatch\" はアイルランド人に特有の言葉なので、他の人種や民族に対して使うのは不適切です。より一般的な言葉を使うべきです。"},{"incorrect":"✗ The police are paddywatching to keep the city safe.","correct":"✓ The police are patrolling to keep the city safe.","note":"\"paddywatch\" は差別的な意味合いを持つため、単に警備活動を説明するために使うのは不適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["racial profiling","discrimination","prejudice","bigotry","stereotyping"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"paddywatch\" is a derogatory term, primarily used in Ireland, to describe discriminatory surveillance or policing directed against Irish people. It is a highly offensive term and its use should be avoided. The word combines \"paddy,\" a disparaging term for Irish people, and \"watch,\" referring to surveillance. It is used to accuse authorities or individuals of unfairly targeting Irish individuals or communities. Due to its offensive nature and specific cultural context, this term is not commonly encountered outside of discussions about discrimination against the Irish."},"example_sentences":[{"sentence":"The human rights organization condemned the government's paddywatch policies.","translation":"人権団体は政府のアイルランド人に対する差別的な監視政策を非難した。","type":"noun","meaning_category":"discriminatory surveillance"},{"sentence":"Activists protested against what they saw as the police paddywatching the Irish neighborhood.","translation":"活動家たちは、警察がアイルランド人居住区を差別的に監視していると見なしたことに抗議した。","type":"verb","meaning_category":"discriminatory surveillance"}]}