{"word":"utterability","meanings":[{"part_of_speech":"noun","definition":"The quality of being utterable; pronounceability; the capability of being expressed or articulated.","english_definition":"The quality or state of being utterable; capability of being uttered or pronounced.","examples":[{"sentence":"The utterability of the word was questionable due to its complex phonetics.","translation":"その単語の発音の複雑さから、発音可能性が疑問視された。"},{"sentence":"The utterability of his feelings was limited by his lack of vocabulary.","translation":"彼の語彙の不足により、彼の感情を表現する能力は限られていた。"}],"synonyms":["pronounceability","articulateness","expressibility","speakability"],"antonyms":["unutterability","inexpressibility","unpronounceability"],"related_words":["utterable","utter","utterance"]}],"etymology":{"value":"Derived from 'utterable' (capable of being uttered) + '-ity' (suffix denoting a state or quality). 'Utterable' comes from 'utter' (to express audibly) + '-able' (capable of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌtərəˈbɪləti/","syllables":"ut-ter-a-bil-i-ty"},"inflection":{"noun_plural":"utterabilities"},"usage_notes":{"explanation":"'Utterability' refers to the inherent quality of something that allows it to be spoken, expressed, or articulated. It is often used in contexts discussing language, communication, and the ability to convey thoughts or feelings. The term is relatively uncommon in everyday conversation but is more frequently encountered in academic or technical discussions related to linguistics or rhetoric.","priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized or technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Utterability' is a relatively advanced term referring to the capability or quality of something being able to be spoken or expressed. It's not commonly used in everyday language but is more likely to appear in academic or technical contexts related to linguistics, phonetics, or communication studies. Understanding this word involves recognizing its connection to the verb 'utter' (to speak) and the suffix '-ability' (indicating capability)."},"example_sentences":[{"sentence":"The poem's success hinged on the utterability of its complex emotions.","translation":"その詩の成功は、その複雑な感情を表現できるかどうかにかかっていた。","type":"noun","meaning_category":"expressibility"},{"sentence":"The linguist studied the utterability of different sounds in various languages.","translation":"言語学者は、さまざまな言語におけるさまざまな音の発音可能性を研究した。","type":"noun","meaning_category":"pronounceability"}]}