{"word":"Orientalised","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"東洋風にされた、オリエンタリズムの影響を受けた","english_definition":"Past tense and past participle of 'Orientalise': to represent or view (something) in a stereotypically Eastern or Asian way; to bring under the cultural or political influence of the Orient.","examples":[{"sentence":"The painting depicted an Orientalised version of the Middle East.","translation":"その絵画は中東をオリエンタリズム的に表現していた。"},{"sentence":"The city's architecture became increasingly Orientalised during the colonial period.","translation":"植民地時代に、その都市の建築はますます東洋風になった。"}],"collocations":["Orientalised architecture (東洋風の建築)","Orientalised art (オリエンタリズムの影響を受けた芸術)","Orientalised view (オリエンタリズム的な見方)"],"synonyms":["exoticized","romanticized","Asianized"],"antonyms":["Westernized","Europeanized"]},{"part_of_speech":"adjective","definition":"東洋風にされた、オリエンタリズムの影響を受けた","english_definition":"Having been made Oriental in character or style; reflecting or embodying Orientalist stereotypes.","examples":[{"sentence":"The Orientalised decor of the restaurant created a specific atmosphere.","translation":"そのレストランのオリエンタリズム的な内装は、独特の雰囲気を作り出した。"},{"sentence":"The film presented an Orientalised narrative that perpetuated harmful stereotypes.","translation":"その映画は有害なステレオタイプを永続させるオリエンタリズム的な物語を提示した。"}],"collocations":["Orientalised decor (東洋風の内装)","Orientalised narrative (オリエンタリズム的な物語)","Orientalised imagery (オリエンタリズム的なイメージ)"],"synonyms":["exotic","romantic","Asian-inspired"],"antonyms":["Western","European"]}],"etymology":{"value":"Derived from 'Oriental' (relating to the Orient or East) and the suffix '-ise' (to make or become). The term often carries connotations of Edward Said's critique of Orientalism, referring to the Western construction of the East as 'other' and often inferior.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːriˈentəlaɪzd/","syllables":"O-ri-en-tal-ised"},"inflection":{"verb_forms":{"present_simple":["Orientalise","Orientalises"],"past_simple":"Orientalised","past_participle":"Orientalised","present_participle":"Orientalising"},"adjective_forms":{"comparative":null,"superlative":null}},"usage_notes":{"explanation":"'Orientalised' is often used critically to describe how Western cultures have represented Eastern cultures in a way that is stereotypical, exoticized, or based on inaccurate or biased perceptions. It is closely linked to the concept of Orientalism, which is the study and imitation of aspects of Eastern cultures by Western artists and designers. The term can also refer to the process of something actually becoming more Eastern in character, though this usage is less common and often still carries the implication of Western influence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was orientalized with traditional Japanese elements.","correct":"✓ The building was decorated with traditional Japanese elements. / ✓ The building incorporated traditional Japanese elements.","note":"While 'orientalized' can be used, it often carries negative connotations related to Orientalism. Using more neutral terms like 'decorated with' or 'incorporated' can be more appropriate. "},{"incorrect":"✗ The artist orientalized the landscape by adding pagodas.","correct":"✓ The artist depicted the landscape with pagodas, creating an exotic atmosphere.","note":"Again, be mindful of the connotations of 'orientalized'. Describing the specific elements added to create the effect can be more precise and less problematic."}],"priority":"★☆☆"},"related_words":{"derivatives":["Orientalism (名詞: オリエンタリズム)","Orientalist (名詞: オリエンタリスト、オリエンタリズム研究者；形容詞: オリエンタリズムの)","Oriental (名詞: 東洋人；形容詞: 東洋の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - relatively uncommon word, often used in academic or critical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Orientalised' is a complex term often used in academic and critical discussions about the representation of Eastern cultures by Western cultures. It implies that something has been made to appear stereotypically Eastern, often in a way that is exoticized, romanticized, or based on inaccurate or biased perceptions. The term is closely associated with the concept of Orientalism, which is a critical theory examining how the West has historically viewed and depicted the East. Understanding this word requires familiarity with postcolonial theory and critical cultural studies."},"example_sentences":[{"sentence":"The novel presented an **Orientalised** view of India, focusing on exotic customs and mystical elements.","translation":"その小説はインドをオリエンタリズム的に描き、異国情緒あふれる習慣や神秘的な要素に焦点を当てていた。","type":"adjective","meaning_category":"東洋風にされた、オリエンタリズムの影響を受けた"},{"sentence":"The director was criticised for **Orientalising** the culture of the region in his film.","translation":"その監督は、映画の中でその地域の文化をオリエンタリズム的に描いたとして批判された。","type":"verb","meaning_category":"東洋風にする、オリエンタリズムの影響を与える"},{"sentence":"The **Orientalised** garden featured pagodas, koi ponds, and meticulously arranged bonsai trees.","translation":"そのオリエンタリズム風の庭園には、塔、鯉の池、そして細心の注意を払って配置された盆栽の木々があった。","type":"adjective","meaning_category":"東洋風にされた、オリエンタリズムの影響を受けた"}]}