{"word":"seigneurialism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"領主制、荘園制度","english_definition":"The organization of rural economy and society in medieval Europe and elsewhere, characterized by the vesting of legal and economic power in a lord, who is supported economically from his own direct landholding and from the obligatory labor and contributions of a legally subject part of the peasant population.","examples":[{"sentence":"Seigneurialism was a dominant feature of medieval French society.","translation":"領主制は中世フランス社会の支配的な特徴でした。"},{"sentence":"The decline of seigneurialism led to significant social and economic changes.","translation":"領主制の衰退は、重要な社会的および経済的変化をもたらしました。"}],"collocations":["feudal seigneurialism","manorial seigneurialism","abolition of seigneurialism","decline of seigneurialism"],"synonyms":["feudalism","manorialism","lordship"],"antonyms":["capitalism","socialism","communism"]}],"etymology":{"value":"From 'seigneurial,' meaning 'of or relating to a seigneur or lord,' combined with '-ism,' a suffix denoting a system, principle, or ideology. 'Seigneurial' itself comes from the Old French 'seigneur,' meaning 'lord,' derived from the Latin 'senior,' meaning 'older' or 'elder.'","priority":"★★☆"},"pronunciation":{"ipa":"/seɪˌnjʊəriəˌlɪzəm/","syllables":"sei-gnu-ri-a-li-sm"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Seigneurialism refers to a specific type of feudal system where a lord (seigneur) holds significant legal and economic power over a territory and its inhabitants. It involves a hierarchical social structure with obligations and rights for both the lord and the peasants. While often used interchangeably with feudalism and manorialism, seigneurialism emphasizes the lord's direct control and exploitation of peasant labor and resources.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Seigneurialism is the same as capitalism.","correct":"✓ Seigneurialism is a form of feudalism.","note":"Seigneurialism is a type of feudal system, not a form of capitalism. They represent opposing economic and social structures."},{"incorrect":"✗ Seigneurialism only existed in England.","correct":"✓ Seigneurialism existed in various parts of Europe, including France and parts of Eastern Europe.","note":"While manorialism was prevalent in England, seigneurialism was more widespread across continental Europe."}],"priority":"★★☆"},"related_words":{"derivatives":["seigneurial (adjective)","seigneur (noun)","seignory (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency. A specialized term used in historical and academic contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Seigneurialism' is a complex historical term referring to the socio-economic system in medieval Europe where lords held significant power over peasants and land. It's similar to feudalism but emphasizes the lord's direct economic exploitation. Understanding it requires knowledge of medieval history and social structures. It is not a commonly used word outside of academic or historical discussions."},"example_sentences":[{"sentence":"The peasants under seigneurialism were obligated to provide labor and a portion of their harvest to the lord.","translation":"領主制下の農民は、労働と収穫の一部を領主に提供する義務がありました。","type":"general","meaning_category":"Definition"},{"sentence":"The French Revolution led to the dismantling of seigneurialism in France.","translation":"フランス革命は、フランスにおける領主制の解体につながりました。","type":"historical","meaning_category":"Historical Context"}]}