{"word":"smeariness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(液体・油状のものの)べたべたした状態、ねばねばした状態、(表面の)汚れ、染み、(性格・行動の)卑劣さ、下品さ","english_definition":"The state or quality of being smeary; a condition characterized by the presence of smears (streaks or marks of a greasy or sticky substance); also, the quality of being morally tainted or unpleasant.","examples":[{"sentence":"The smeariness of the old oil paint made it difficult to clean.","translation":"古い油絵の具のべたべたした感じが掃除を難しくした。"},{"sentence":"The smeariness of the politician's tactics was widely criticized.","translation":"その政治家の戦術の卑劣さは広く批判された。"}],"collocations":["smeariness of oil","smeariness of paint","moral smeariness"],"synonyms":["greasiness","oiliness","stickiness","dirtiness","filthiness","baseness","meanness"],"antonyms":["cleanliness","purity","honesty","decency"]}],"etymology":{"value":"Derived from the adjective 'smeary', which comes from 'smear' (verb or noun, meaning to spread a greasy or sticky substance, or a mark made by such a substance). The suffix '-ness' is added to form the noun, indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsmɪəriːnəs/","syllables":"smear-i-ness"},"inflection":{"noun_plural":"smearinesses (rarely used)"},"usage_notes":{"explanation":"'Smeariness' refers to the quality or state of being 'smeary'. It can describe a physical condition involving greasy or sticky substances, or a more abstract condition involving moral or ethical unpleasantness. The abstract sense is often used to criticize someone's behavior or tactics as being underhanded or dishonest.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The smeariness was evident on her face after eating the chocolate.","correct":"✓ The chocolate smear was evident on her face after eating the chocolate.","note":"Use 'smear' instead of 'smeariness' to describe a single instance of a smear. 'Smeariness' describes the general condition of being smeary."}],"priority":"★★☆"},"related_words":{"derivatives":["smear (verb, noun)","smeary (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Smeariness' is a relatively uncommon word that describes the state or quality of being smeary. It can refer to a physical state, such as the greasiness of a surface, or a more abstract state, such as the moral unpleasantness of someone's actions. Because it is not a common word, it is more likely to be encountered in formal writing or specialized contexts."},"example_sentences":[{"sentence":"The **smeariness** of the window made it difficult to see outside.","translation":"窓のべたべたした感じが外を見るのを難しくした。","type":"noun","meaning_category":"physical state"},{"sentence":"The **smeariness** of his political campaign turned many voters away.","translation":"彼の政治キャンペーンの卑劣さが多くの有権者を遠ざけた。","type":"noun","meaning_category":"moral quality"}]}