{"word":"unlanced","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(傷などが)切開されていない、膿を出されていない","english_definition":"Not having been lanced; not having had a surgical incision made to drain fluid, such as pus.","examples":[{"sentence":"The unlanced boil continued to swell, causing considerable pain.","translation":"切開されていないおできは腫れ続け、かなりの痛みを引き起こした。"},{"sentence":"An unlanced abscess can lead to further complications.","translation":"切開されていない膿瘍は、さらなる合併症を引き起こす可能性がある。"}],"collocations":["unlanced boil (切開されていないおでき)","unlanced abscess (切開されていない膿瘍)"],"synonyms":["unincised","undrained"],"antonyms":["lanced","incised","drained"]}],"etymology":{"value":"The word 'unlanced' is formed by adding the prefix 'un-' (meaning 'not') to the past participle 'lanced' of the verb 'to lance'. 'Lance' itself comes from the Old French word 'lance', referring to a spear, which was metaphorically used to describe the act of piercing or cutting something open.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈlænst/","syllables":"un-lanced"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Unlanced' is a relatively uncommon word, primarily used in medical contexts to describe a boil, abscess, or other collection of fluid that has not been surgically opened to allow drainage. It implies that the condition is still in its initial, untreated state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unlanced wound was cleaned thoroughly.","correct":"✓ The wound, which was unlanced, was cleaned thoroughly.","note":"While technically correct, 'unlanced wound' is less common. Usually, the focus is on boils or abscesses. Using a relative clause clarifies the meaning."},{"incorrect":"✗ He felt unlanced after the argument.","correct":"✗ He felt relieved after the argument.","note":"'Unlanced' refers specifically to a medical procedure. It cannot be used metaphorically to describe emotional relief."}],"priority":"★☆☆"},"related_words":{"derivatives":["lance (verb: to cut open with a lancet)","lancing (noun: the act of cutting open with a lancet)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'unlanced' is a technical term primarily used in medical contexts. It describes a condition, such as a boil or abscess, that has not been surgically opened to drain fluid. Understanding this word requires familiarity with medical terminology and procedures. It is not typically encountered in everyday language."},"example_sentences":[{"sentence":"The doctor recommended warm compresses for the unlanced cyst.","translation":"医師は切開されていない嚢胞に温湿布を推奨した。","type":"adjective","meaning_category":"medical"},{"sentence":"Due to the risk of infection, the unlanced wound required immediate attention.","translation":"感染のリスクがあるため、切開されていない傷は直ちに手当が必要だった。","type":"adjective","meaning_category":"medical"}]}