{"word":"Lupid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Fantasy slang) A portmanteau of \"lizard\" and \"stupid\", used as an insult.","english_definition":"A derogatory term, blending 'lizard' and 'stupid', used to insult someone, typically in fantasy settings or online communities.","examples":[{"sentence":"'You lupid! Why would you attack the dragon alone?'","translation":"「このルーピッド！なぜ一人でドラゴンを攻撃するんだ？」"},{"sentence":"'Don't be such a lupid, think before you act.'","translation":"「そんなルーピッドになるな、行動する前に考えろ。」"}],"collocations":["calling someone a lupid","being a lupid","stupid lizard"],"synonyms":["idiot","moron","fool","lizard-brain"],"antonyms":["genius","intelligent","wise"]}],"etymology":{"value":"A blend of the words 'lizard' and 'stupid', likely originating in online gaming or fantasy role-playing communities to create a unique and humorous insult.","priority":"★★★"},"pronunciation":{"ipa":"/ˈluːpɪd/","syllables":"Loo-pid"},"inflection":{"noun_plural":"Lupids"},"usage_notes":{"explanation":"'Lupid' is typically used as a lighthearted or humorous insult, often within the context of fantasy games, online communities, or role-playing scenarios. It is generally not considered a severe or offensive term, but its impact can vary depending on the context and the relationship between the individuals involved.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a very lupid person, I admire him.","correct":"✓ He's a very intelligent person, I admire him.","note":"'Lupid' is an insult, so it would not be used to describe someone you admire."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Lupid' is a niche slang term primarily used in specific online or gaming communities. Understanding its meaning requires familiarity with internet culture and the creation of portmanteau words. It is not part of standard English vocabulary."},"example_sentences":[{"sentence":"The goblin called the knight a 'lupid' for falling into the trap.","translation":"ゴブリンは罠に落ちた騎士を「ルーピッド」と呼んだ。","type":"noun","meaning_category":"insult"},{"sentence":"He acted like a complete lupid when he tried to cast the spell backwards.","translation":"彼は呪文を逆向きに唱えようとしたとき、完全なルーピッドのように振る舞った。","type":"noun","meaning_category":"insult"}]}