{"word":"chicken-hazard","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"チキンゲーム","english_definition":"A game in which two drivers drive towards each other on a collision course: one must swerve to avoid a crash, or both may die in one. The one who swerves is labelled a 'chicken'.","examples":[{"sentence":"The two companies were playing a dangerous game of chicken-hazard, each refusing to back down.","translation":"その二つの会社は危険なチキンゲームをしていた。どちらも引くことを拒否していた。"},{"sentence":"The negotiations felt like a game of chicken-hazard, with both sides pushing the limits.","translation":"交渉はチキンゲームのように感じられた。両者が限界を押し広げていた。"}],"collocations":["play chicken-hazard","a game of chicken-hazard"],"synonyms":["chicken game","brinkmanship"],"antonyms":[]},{"part_of_speech":"noun","definition":"危険な状況、瀬戸際","english_definition":"A situation where two or more parties engage in a risky or dangerous activity, each hoping the other will back down first.","examples":[{"sentence":"The country's economic policy was a chicken-hazard, risking a major recession.","translation":"その国の経済政策はチキンゲームであり、大規模な景気後退のリスクがあった。"},{"sentence":"Their relationship had become a chicken-hazard, with constant arguments and threats.","translation":"彼らの関係はチキンゲームになっていた。絶え間ない議論と脅し合いがあった。"}],"collocations":["a political chicken-hazard","an economic chicken-hazard"],"synonyms":["risky situation","dangerous game","brinkmanship"],"antonyms":[]}],"etymology":{"value":"The term 'chicken-hazard' is derived from the game of 'chicken', where two drivers drive towards each other, and the first to swerve is labeled the 'chicken' (coward). The 'hazard' part emphasizes the dangerous and risky nature of the game.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃɪkɪnˌhæzərd/","syllables":"chick-en-haz-ard"},"inflection":{"noun_plural":"chicken-hazards"},"usage_notes":{"explanation":"'Chicken-hazard' refers to a situation resembling the game of chicken, where two or more parties engage in a risky or dangerous activity, hoping the other will back down first. It is often used to describe political or economic situations where the stakes are high, and the consequences of not backing down could be severe.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The chicken-hazard was delicious.","correct":"✓ The situation was a chicken-hazard.","note":"'Chicken-hazard' refers to a dangerous game or situation, not a type of food."},{"incorrect":"✗ He played chicken-hazard with his life.","correct":"✓ He played chicken-hazard with the other driver.","note":"While you can metaphorically play chicken-hazard with your life by taking risks, the term typically refers to a game or situation between two or more parties."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["chicken (game)","brinkmanship","game theory"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chicken-hazard' is a term used to describe a situation where two or more parties engage in a risky or dangerous activity, hoping the other will back down first. It's often used in political or economic contexts to describe high-stakes situations where the consequences of not backing down could be severe. The term is derived from the game of 'chicken', where two drivers drive towards each other, and the first to swerve is labeled the 'chicken' (coward)."},"example_sentences":[{"sentence":"The two countries were engaged in a dangerous game of chicken-hazard over trade tariffs.","translation":"その二国は貿易関税をめぐって危険なチキンゲームを繰り広げていた。","type":"noun","meaning_category":"チキンゲーム"},{"sentence":"The company's aggressive expansion strategy was seen as a chicken-hazard, risking financial stability.","translation":"その会社の積極的な拡大戦略はチキンゲームと見なされ、財政の安定を脅かしていた。","type":"noun","meaning_category":"危険な状況"}]}