{"word":"recessional","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(教会での)退場賛美歌、退場聖歌","english_definition":"a hymn or piece of music played or sung as the clergy and choir leave the church at the end of a service.","examples":[{"sentence":"The organist began playing the recessional as the service concluded.","translation":"礼拝が終わると、オルガニストは退場賛美歌を演奏し始めた。"},{"sentence":"The recessional was a traditional hymn, chosen to reflect the solemnity of the occasion.","translation":"退場聖歌は伝統的な賛美歌で、その場の厳粛さを反映するように選ばれた。"}],"collocations":["play the recessional","sing the recessional","traditional recessional","organ recessional"],"synonyms":["closing hymn","postlude"],"antonyms":["processional"]},{"part_of_speech":"adjective","definition":"退場（の）、退場用の","english_definition":"relating to or used for a recessional.","examples":[{"sentence":"The recessional music was carefully selected.","translation":"退場用の音楽は慎重に選ばれた。"},{"sentence":"The recessional route was lined with flowers.","translation":"退場経路は花で飾られていた。"}],"collocations":["recessional hymn","recessional music","recessional route"],"synonyms":["closing","departing"],"antonyms":["processional"]}],"etymology":{"value":"From 'recession' (the act of withdrawing or going back) + '-al' (suffix forming adjectives or nouns). 'Recession' itself comes from Latin 'recessio', from 'recedere' (to go back, withdraw).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈsɛʃənəl/","syllables":"re-ces-sion-al"},"inflection":{"noun_plural":"recessionals"},"usage_notes":{"explanation":"The term 'recessional' is primarily used in a religious context, specifically within Christian church services. It refers to the hymn or music played as the clergy and choir leave the sanctuary after the service. As an adjective, it describes something related to this act of leaving or the music used for it. It is less commonly used outside of this specific context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The recessional was very processional.","correct":"✓ The recessional was very moving.","note":"'Recessional' and 'processional' are opposites. 'Recessional' refers to the music during the departure, while 'processional' is for the entrance. Do not confuse the two. Instead of describing the recessional as 'processional', use adjectives like 'moving', 'solemn', or 'beautiful' to describe its quality."}],"priority":"★★☆"},"related_words":{"derivatives":["recession (noun): a period of economic decline; the act of receding or withdrawing.","recede (verb): to go or move back or further away from a previous position.","processional (noun/adjective): the music or act of entering at the beginning of a service or ceremony; relating to a procession."],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Recessional' is a term primarily used in the context of church services, specifically referring to the music played during the departure of the clergy and choir at the end of a service. It can also be used as an adjective to describe something related to this departure. Due to its specific religious context, it is not a commonly used word in everyday conversation and is more likely to be encountered in formal or religious settings."},"example_sentences":[{"sentence":"The beautiful organ music served as the recessional, marking the end of the ceremony.","translation":"美しいオルガン音楽が退場聖歌として演奏され、式典の終わりを告げた。","type":"noun","meaning_category":"退場賛美歌"},{"sentence":"The recessional hymn was a familiar tune that everyone knew.","translation":"退場賛美歌は誰もが知っている馴染み深い曲だった。","type":"adjective","meaning_category":"退場用の"}]}