{"word":"menjenguk","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"mengunjungi (orang sakit, orang yang sedang dalam kesulitan, dsb.) untuk menghibur atau memberikan dukungan.","english_definition":"to visit (someone who is sick, in trouble, etc.) to comfort or give support.","examples":[{"sentence":"Setiap hari dia menjenguk ibunya yang sakit di rumah sakit.","translation":"Every day she visits her sick mother in the hospital.","english_translation":"Every day she visits her sick mother in the hospital."},{"sentence":"Kami akan menjenguk teman kami yang sedang mengalami musibah.","translation":"We will visit our friend who is experiencing a disaster.","english_translation":"We will visit our friend who is experiencing a disaster."},{"sentence":"Jangan lupa menjenguk kakek dan nenekmu di kampung.","translation":"Don't forget to visit your grandparents in the village.","english_translation":"Don't forget to visit your grandparents in the village."}],"collocations":["menjenguk orang sakit (visiting a sick person)","menjenguk teman (visiting a friend)","menjenguk keluarga (visiting family)"],"synonyms":["mengunjungi","melawat","bertandang"],"antonyms":[]}],"etymology":{"value":"Berasal dari kata dasar 'jenguk' yang berarti melihat atau menengok dengan cara memajukan kepala untuk melihat sesuatu. Kemudian mendapat awalan 'meN-' yang berfungsi sebagai pembentuk kata kerja.","priority":"★★☆"},"pronunciation":{"ipa":"[mənˈdʒɛŋʊk]","syllables":"me-njen-guk"},"inflection":{"notes":"Ini adalah kata kerja aktif. Bentuk pasifnya adalah 'dijenguk'."},"usage_notes":{"explanation":"'Menjenguk' digunakan secara khusus untuk mengunjungi seseorang yang sedang dalam keadaan tidak baik, seperti sakit, terkena musibah, atau sedang berada di penjara. Tujuannya adalah untuk memberikan dukungan moral dan menghibur.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Saya mau mengunjungi teman di kantor.","correct":"Saya mau menjenguk teman yang sakit.","note":"'Menjenguk' lebih tepat digunakan untuk orang yang sakit atau dalam kesulitan, bukan sekadar kunjungan biasa."}],"priority":"★★☆"},"related_words":{"derivatives":["jenguk (noun: a peek, a visit)","jengukan (noun: the act of visiting)","penjenguk (noun: visitor)"]},"level_frequency":{"frequency_corpus":"Cukup umum (fairly common)","priority":"★★☆"},"readability_explanation":{"level":"B1","text":"Kata 'menjenguk' berarti mengunjungi seseorang yang sedang sakit atau mengalami kesulitan untuk memberikan dukungan. Kata ini lebih spesifik daripada 'mengunjungi' yang bisa digunakan untuk kunjungan biasa."},"example_sentences":[{"sentence":"Para relawan secara rutin menjenguk korban banjir di pengungsian.","translation":"The volunteers routinely visit the flood victims in the evacuation center.","type":"verb","meaning_category":"visiting someone in need"},{"sentence":"Kami berencana menjenguk paman yang baru saja menjalani operasi.","translation":"We are planning to visit our uncle who just had surgery.","type":"verb","meaning_category":"visiting someone who is sick"}]}