{"word":"bigamizing","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(present participle of bigamize) committing bigamy; marrying one person while still legally married to another.","english_definition":"The act of entering into a marriage with one person while still legally married to another person.","examples":[{"sentence":"He was caught bigamizing when his first wife discovered the marriage certificate of his second wife.","translation":"彼が重婚していることが、最初の妻が二番目の妻の婚姻証明書を発見した時に発覚した。"}],"collocations":["caught bigamizing","accused of bigamizing"],"synonyms":["committing bigamy","remarrying illegally"],"antonyms":["remaining monogamous","divorcing before remarriage"]}],"etymology":{"value":"Derived from 'bigamy' (from Late Latin bigamia, from Late Greek bigamos 'twice married,' from bi- 'twice' + gamos 'marriage') + '-ize' (forming verbs).","priority":"N/A"},"pronunciation":{"ipa":"ˈbɪɡəmaɪzɪŋ","syllables":"bi-gam-iz-ing"},"inflection":{"verb_forms":{"present_simple":["bigamize","bigamizes"],"past_simple":"bigamized","past_participle":"bigamized","present_participle":"bigamizing"}},"usage_notes":{"explanation":"'Bigamizing' is the present participle of the verb 'bigamize,' which means to commit bigamy. It is used to describe the action of marrying someone while already married. The term is often used in legal contexts or when discussing moral issues related to marriage.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is bigamizing with two wives.","correct":"✓ He is bigamizing by marrying a second wife while still married to the first.","note":"The act of bigamy involves the illegal marriage itself, not simply 'being with' multiple partners. The sentence should clarify the act of marrying while already married."}],"priority":"N/A"},"related_words":{"derivatives":["bigamy (noun)","bigamist (noun)","bigamous (adjective)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Bigamizing' refers to the action of committing bigamy, which is the act of marrying one person while still legally married to another. This term is not commonly used in everyday conversation but may appear in legal or formal contexts when discussing the crime of bigamy. Understanding this word requires knowledge of legal and marital concepts."},"example_sentences":[{"sentence":"The man was arrested for bigamizing after his two marriages were discovered.","translation":"その男は二重婚が発覚し、重婚罪で逮捕された。","type":"verb","meaning_category":"committing bigamy"}]}