{"word":"chromaticity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"色度：色の質を、明るさ（輝度）とは独立して表す特性。色の三属性のうち、色相と彩度を合わせたもの。","english_definition":"The objective specification of the quality of a color regardless of its luminance, expressed in terms of two coordinates. It is the combination of hue and saturation, excluding brightness.","examples":[{"sentence":"Chromaticity is an important factor in color reproduction.","translation":"色度は、色の再現において重要な要素です。"},{"sentence":"The chromaticity coordinates of the display were carefully calibrated.","translation":"ディスプレイの色度座標は慎重に校正されました。"},{"sentence":"Different light sources can affect the chromaticity of objects.","translation":"異なる光源は、物体の色度に影響を与える可能性があります。"}],"collocations":["chromaticity diagram (色度図)","chromaticity coordinates (色度座標)","color chromaticity (色の色度)"],"synonyms":["color quality","color appearance","hue and saturation"],"antonyms":["luminance","brightness"]}],"etymology":{"value":"Derived from 'chromatic' (relating to color) and '-ity' (a suffix denoting a state or quality). 'Chromatic' comes from the Greek word 'chromatikos' meaning 'relating to color'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkroʊməˈtɪsɪti/","syllables":"chro·ma·tic·i·ty"},"inflection":{"noun_plural":"chromaticities"},"usage_notes":{"explanation":"Chromaticity is a technical term used in color science, physics, and related fields. It describes the color of an object or light source without considering its brightness. It's often represented on a chromaticity diagram, such as the CIE 1931 color space. The concept is crucial in applications like display technology, printing, and lighting design, where accurate color reproduction is essential.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The chromaticity is very bright.","correct":"✓ The luminance is very bright.","note":"Chromaticity refers to the color quality (hue and saturation), not the brightness. Use 'luminance' or 'brightness' to describe how bright something is."},{"incorrect":"✗ Chromaticity includes brightness.","correct":"✓ Chromaticity excludes brightness.","note":"By definition, chromaticity does not include brightness. It only describes the color's hue and saturation."}],"priority":"★★☆"},"related_words":{"derivatives":["chromatic (形容詞: 色の、色彩的な)","chromatics (名詞: 色彩学)","achromatic (形容詞: 無色の)"],"related_terms":["CIE color space (CIE 色空間)","colorimetry (測色法)","color rendering index (演色評価数)","metamerism (条件等色)"],"priority":"★★★"},"level_frequency":{"level":"C1","frequency_google_ngram":"Low frequency - technical term.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Chromaticity' is a technical term used to describe the color of something, but without considering how bright it is. Think of it as the 'pure' color, separate from its brightness. It's used in science and technology when talking about things like screens, lights, and paints, where getting the color right is important. It's not an everyday word, so you'll mostly see it in specialized contexts."},"example_sentences":[{"sentence":"The engineer adjusted the display's chromaticity to achieve more accurate color reproduction.","translation":"エンジニアは、より正確な色再現を実現するために、ディスプレイの色度を調整しました。","type":"general","meaning_category":"色度"},{"sentence":"The chromaticity diagram shows the range of colors that can be reproduced by the printer.","translation":"色度図は、プリンターで再現できる色の範囲を示しています。","type":"technical","meaning_category":"色度"},{"sentence":"The perceived chromaticity of the fabric changed under different lighting conditions.","translation":"生地の知覚される色度は、異なる照明条件下で変化しました。","type":"scientific","meaning_category":"色度"}]}