{"word":"tenantable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"居住に適した、賃貸できる","english_definition":"suitable for being lived in; fit for occupancy by a tenant.","examples":[{"sentence":"The landlord must ensure the property is tenantable before renting it out.","translation":"家主は物件を賃貸に出す前に、居住に適した状態であることを確認しなければならない。"},{"sentence":"The building was not tenantable due to the extensive damage from the fire.","translation":"その建物は火災による広範囲な損傷のため、居住に適した状態ではなかった。"},{"sentence":"They made the necessary repairs to make the apartment tenantable.","translation":"彼らはアパートを居住に適した状態にするために必要な修理を行った。"}],"collocations":["tenantable condition","tenantable repair","tenantable state","make tenantable","deem tenantable","consider tenantable"],"synonyms":["habitable","livable","inhabitable","occupiable","fit for habitation","suitable for occupancy","residential"],"antonyms":["uninhabitable","unlivable","unfit for habitation","non-residential"]},{"part_of_speech":"adjective","definition":"（古用法）賃貸可能な、賃借できる","english_definition":"(archaic) capable of being rented or leased.","examples":[{"sentence":"The land was tenantable at a reasonable rate.","translation":"その土地は手頃な料金で賃貸可能だった。"},{"sentence":"All the tenantable farms in the area were already occupied.","translation":"その地域の賃貸可能な農場はすべてすでに占有されていた。"}],"collocations":["tenantable land","tenantable farms","tenantable property","tenantable estate"],"synonyms":["leasable","rentable","lettable"],"antonyms":["unleasable","unrentable"]}],"etymology":{"value":"From 'tenant' + '-able'. 'Tenant' comes from Old French 'tenant,' present participle of 'tenir' (to hold), from Latin 'tenere' (to hold). '-able' is a suffix indicating capability or suitability. Thus, 'tenantable' literally means 'capable of being held or occupied by a tenant.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛnəntəbəl/","syllables":"ten-ant-a-ble"},"inflection":{"notes":"Adjective; no specific inflections beyond comparative and superlative forms (more tenantable, most tenantable), which are rarely used."},"usage_notes":{"explanation":"'Tenantable' typically refers to the condition of a property, indicating whether it meets the minimum standards for safe and comfortable living. It implies that the property is free from significant defects that would make it unsuitable for a tenant to occupy. Legal contexts often define specific requirements for a property to be considered tenantable. While 'habitable' is a more common synonym, 'tenantable' is often used in legal or formal contexts relating to rental agreements and property law.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tenantable of the house was excellent.","correct":"✓ The tenantability of the house was excellent.","note":"'Tenantable' is an adjective, so it describes a noun. The noun form is 'tenantability.'"},{"incorrect":"✗ The house is tenantable for a family.","correct":"✓ The house is tenantable by a family. / ✓ The house is tenantable for a family of four.","note":"'Tenantable by' is more common when referring to who can occupy it. 'Tenantable for' can be used if specifying the suitability for a particular type or size of family."}],"priority":"★★☆"},"related_words":{"derivatives":["tenantability (noun): the quality or state of being tenantable.","tenant (noun): a person who occupies land or property rented from a landlord."],"synonyms":["habitable","livable","inhabitable","occupiable","rentable","leasable"],"antonyms":["uninhabitable","unlivable","unrentable","unleasable"]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency. Primarily used in legal and real estate contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tenantable' is a relatively formal and specialized term used in the context of real estate and property law. It describes whether a property is in a condition suitable for a tenant to live in, meaning it meets basic standards of safety, sanitation, and repair. This word is not commonly used in everyday conversation and is more likely to appear in legal documents, rental agreements, or discussions about property management. It's important to understand this term if you're involved in renting, leasing, or managing properties."},"example_sentences":[{"sentence":"The apartment was deemed not **tenantable** until the mold was removed.","translation":"そのアパートはカビが除去されるまで居住に適さないと判断された。","type":"adjective","meaning_category":"居住に適した"},{"sentence":"The contract specified that the property must be maintained in a **tenantable** condition.","translation":"契約書には、物件は居住に適した状態に維持されなければならないと明記されていた。","type":"adjective","meaning_category":"居住に適した"},{"sentence":"The landlord is responsible for ensuring the property remains **tenantable** throughout the lease.","translation":"家主は、賃貸期間中、物件が居住に適した状態を維持する責任がある。","type":"adjective","meaning_category":"居住に適した"}]}