{"word":"amelanism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(動物学)メラニン色素欠乏症、無色素症","english_definition":"(zoology) the absence of melanin pigment in an animal, resulting in a white or pale appearance.","examples":[{"sentence":"Amelanism is a genetic condition that can occur in many species of animals.","translation":"メラニン色素欠乏症は、多くの動物種に起こりうる遺伝的疾患です。"},{"sentence":"The snake exhibited amelanism, resulting in a striking white and yellow coloration.","translation":"そのヘビはメラニン色素欠乏症を示し、印象的な白と黄色の体色になっていました。"}],"collocations":["exhibit amelanism (メラニン色素欠乏症を示す)","genetic amelanism (遺伝性のメラニン色素欠乏症)","complete amelanism (完全なメラニン色素欠乏症)","partial amelanism (部分的なメラニン色素欠乏症)"],"synonyms":["albinism","achromia"],"antonyms":["melanism","hyperpigmentation"]}],"etymology":{"value":"From 'a-' (absence of), 'melanin' (the pigment), and '-ism' (condition).","priority":"★★★"},"pronunciation":{"ipa":"/eɪˈmɛlənɪzəm/","syllables":"a-mel-a-nism"},"inflection":{"noun_plural":"amelanisms"},"usage_notes":{"explanation":"Amelanism is a specific type of hypopigmentation characterized by the complete absence of melanin. It's different from albinism, which involves a lack of melanin due to a defect in the enzyme tyrosinase. Amelanistic animals often have white or pale yellow coloration, and their eyes may retain some color. The condition can occur naturally through genetic mutation or be selectively bred in captive animals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The animal is albino because it has amelanism.","correct":"✓ The animal has amelanism, which is different from albinism.","note":"Amelanism and albinism are related but distinct conditions. Albinism is a specific type of amelanism caused by a defect in tyrosinase."}],"priority":"★★☆"},"related_words":{"derivatives":["amelanistic (adjective)"],"related_terms":["albinism","leucism","melanin","pigmentation","hypopigmentation","melanism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amelanism' is a scientific term describing the complete absence of melanin pigment in an animal. This condition results in a white or pale appearance. It is important to distinguish it from albinism, which is a specific type of amelanism caused by a defect in the enzyme tyrosinase. The term is primarily used in zoology and genetics contexts."},"example_sentences":[{"sentence":"The reptile breeder specialized in amelanistic morphs of various snake species.","translation":"その爬虫類ブリーダーは、様々なヘビ種のメラニン色素欠乏個体の繁殖を専門としていました。","type":"general","meaning_category":"general"},{"sentence":"Amelanism can make animals more vulnerable to predators due to their lack of camouflage.","translation":"メラニン色素欠乏症は、カモフラージュの欠如により、動物を捕食者に対してより脆弱にする可能性があります。","type":"general","meaning_category":"general"}]}