{"word":"floodways","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"放水路、洪水路","english_definition":"Channels designed to divert excess water from a river or other body of water to prevent flooding.","examples":[{"sentence":"The floodways were crucial in protecting the city from the rising river.","translation":"その放水路は、増水する川から都市を守る上で非常に重要だった。"},{"sentence":"Engineers are constantly monitoring the floodways to ensure they are functioning properly.","translation":"エンジニアたちは、放水路が適切に機能していることを確認するために、常に監視している。"}],"collocations":["floodway system","operate floodways","maintain floodways","design floodways"],"synonyms":["spillway","diversion channel","relief channel"],"antonyms":[]}],"etymology":{"value":"The term 'floodway' is a compound word formed from 'flood' and 'way,' indicating a designated path or channel for floodwaters.","priority":"★★☆"},"pronunciation":{"ipa":"ˈflʌdˌweɪz/","syllables":"flood-ways"},"inflection":{"noun_plural":"floodways"},"usage_notes":{"explanation":"'Floodways' are specifically engineered channels, often artificial, designed to carry excess water away from populated or vulnerable areas during times of high water levels. They are an important component of flood control systems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The floodway was full of flood.","correct":"✓ The floodway was full of water.","note":"'Flood' is the event, 'floodway' is the channel. The channel contains water, not the event itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["flood","way"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'floodways' refers to engineered channels designed to divert excess water and prevent flooding. It is a technical term commonly used in civil engineering, hydrology, and disaster management contexts. Understanding the term requires familiarity with flood control infrastructure and terminology."},"example_sentences":[{"sentence":"The construction of the floodways significantly reduced the risk of flooding in the low-lying areas.","translation":"その放水路の建設は、低地の洪水リスクを大幅に軽減した。","type":"noun","meaning_category":"Flood control infrastructure"},{"sentence":"During heavy rainfall, the floodways efficiently channeled the excess water away from the residential areas.","translation":"大雨の間、放水路は余分な水を効率的に住宅地から運び去った。","type":"noun","meaning_category":"Water management"},{"sentence":"Regular maintenance of the floodways is essential to ensure their effectiveness during flood events.","translation":"洪水イベント中の効果を確保するためには、放水路の定期的なメンテナンスが不可欠である。","type":"noun","meaning_category":"Infrastructure maintenance"}]}