{"word":"audacia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"大胆さ、勇敢さ、向こう見ずさ","english_definition":"boldness or daring, especially with confident or arrogant disregard for personal safety, legal and ethical constraints.","examples":[{"sentence":"His audacia in confronting the dictator was admired by many.","translation":"独裁者に立ち向かう彼の大胆さは多くの人に称賛された。"},{"sentence":"The company's audacia in launching the new product was a gamble that paid off.","translation":"その会社が新製品を発売した際の向こう見ずさは、成功を収めた賭けだった。"},{"sentence":"Her audacia sometimes bordered on recklessness.","translation":"彼女の大胆さは時々、無謀さの域に達していた。"}],"collocations":["display audacia (大胆さを示す)","remarkable audacia (注目すべき大胆さ)","unprecedented audacia (前例のない大胆さ)","sheer audacia (純粋な大胆さ)"],"synonyms":["boldness","daring","courage","bravery","intrepidity","temerity","effrontery","impudence","recklessness"],"antonyms":["cowardice","timidity","fearfulness","caution","prudence","circumspection"]}],"etymology":{"value":"Latin audācia, from audāx (\"bold, daring\"), from audēre (\"to dare\").","priority":"★★★"},"pronunciation":{"ipa":"/ɔːˈdeɪʃ(i)ə/","syllables":"Au-da-ci-a"},"inflection":{"noun_plural":"audacias"},"usage_notes":{"explanation":"\"Audacia\" is a relatively uncommon word in modern English, often used in formal or literary contexts. It carries a stronger connotation of boldness and daring than simple \"courage\" or \"bravery,\" often implying a disregard for risks or consequences. It can sometimes have a negative connotation, suggesting recklessness or impudence. The word is more frequently encountered in discussions of historical figures, military strategy, or philosophical concepts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great courage, it was audacia.","correct":"✓ He showed great courage; it was audacia. / ✓ His courage was audacia.","note":"Audacia is a noun, so it should be used as a subject or object in a sentence, not as an adjective modifying courage. A semicolon can be used to connect two related independent clauses. Alternatively, you can say \"His courage was audacia.\""},{"incorrect":"✗ Her audacia was very good.","correct":"✓ Her audacia was admirable. / ✓ Her audacia was remarkable.","note":"\"Good\" is a general term and doesn't capture the specific nuance of audacia. Use more descriptive adjectives like \"admirable\" or \"remarkable\" to convey the quality of the boldness."}],"priority":"★★☆"},"related_words":{"derivatives":["audacious (adjective)","audaciously (adverb)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Audacia\" is a relatively rare and sophisticated word that describes a specific type of boldness or daring. It's not just about being brave; it implies a confident, sometimes arrogant, disregard for risks or rules. You might encounter it in historical texts or discussions of leadership, where someone's bold actions are seen as both impressive and potentially risky. Understanding this word can add nuance to your comprehension of complex texts.","priority":"★★☆"},"example_sentences":[{"sentence":"The general's **audacia** led to a swift victory, but at a great cost.","translation":"将軍の大胆さは迅速な勝利をもたらしたが、大きな犠牲を伴った。","type":"noun","meaning_category":"boldness"},{"sentence":"The young artist's **audacia** in challenging established norms made her a controversial figure.","translation":"その若いアーティストが確立された規範に挑戦した大胆さは、彼女を物議を醸す人物にした。","type":"noun","meaning_category":"daring"},{"sentence":"Despite the risks, his **audacia** inspired others to take action.","translation":"リスクにもかかわらず、彼の大胆さは他の人々に立ち上がるよう促した。","type":"noun","meaning_category":"courage"}]}