{"word":"suited-legged","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(humorous) Wearing a suit jacket but no trousers or skirt, giving the impression of having legs that are suited.","english_definition":"(humorous) Describing someone who is wearing a suit jacket but no trousers or skirt, creating a visual effect of the legs being suited.","examples":[{"sentence":"During the video call, he was only visible from the chest up, appearing suited-legged to his colleagues.","translation":"ビデオ通話中、彼は胸から上しか見えなかったので、同僚にはスーツを着た足のように見えた。"},{"sentence":"She quickly adjusted the camera angle to avoid looking suited-legged during the online meeting.","translation":"彼女はオンライン会議中にスーツを着た足のように見えないように、カメラアングルを素早く調整した。"}],"collocations":["suited-legged appearance","suited-legged look","avoid looking suited-legged"],"synonyms":["partially dressed","inappropriately dressed (in a humorous context)"],"antonyms":["fully dressed","formally dressed"]}],"etymology":{"value":"A humorous neologism formed by combining \"suited\" (referring to wearing a suit jacket) and \"legged\" (having legs), implying the unusual combination of a formal top and informal or absent bottom clothing.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsuːtɪd ˈlɛɡɪd/","syllables":"suit-ed leg-ged"},"inflection":{"notes":"This is a compound adjective and does not have comparative or superlative forms."},"usage_notes":{"explanation":"The term \"suited-legged\" is primarily used humorously to describe the situation where someone is dressed formally from the waist up (typically wearing a suit jacket) but is not wearing trousers, a skirt, or any formal bottom clothing. This is often encountered during video calls or online meetings where only the upper body is visible. It's a relatively new term and is not typically used in formal contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was suited-legged for the wedding.","correct":"✓ He was only suited from the waist up.","note":"\"Suited-legged\" implies a humorous or inappropriate lack of formal bottom clothing, not formal attire. A wedding would require full formal attire."},{"incorrect":"✗ The suited-legged man looked very professional.","correct":"✓ The man looked professional from the waist up.","note":"The term inherently suggests a lack of professionalism due to the missing bottom clothing."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"related_terms":["waist-up","video call etiquette","Zoom meeting attire"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - a relatively new and uncommon term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"suited-legged\" is a humorous and relatively new expression used to describe someone who is formally dressed from the waist up (usually wearing a suit jacket) but is not wearing trousers, a skirt, or any appropriate bottom clothing. This is often seen during video calls where only the upper body is visible. The term is informal and should be used in appropriate contexts. It implies a contrast between formal appearance and informal or absent lower body attire."},"example_sentences":[{"sentence":"Many people admitted to being suited-legged during work-from-home video conferences.","translation":"多くの人が、在宅勤務中のビデオ会議でスーツを着た足の格好をしていたことを認めた。","type":"adjective","meaning_category":"humorous description of attire"},{"sentence":"The comedian joked about the new work-from-home dress code: suited-legged on top, pajama-bottomed below.","translation":"コメディアンは、新しい在宅勤務の服装規定について、上はスーツを着た足、下はパジャマのズボンだと冗談を言った。","type":"adjective","meaning_category":"humorous description of attire"}]}