{"word":"unpresumptively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"控えめに、出しゃばらずに、遠慮がちに、推定的でない方法で","english_definition":"In a manner that is not presumptuous; without unwarranted assumption or arrogance.","examples":[{"sentence":"He unpresumptively offered his assistance, careful not to overstep his bounds.","translation":"彼は自分の立場をわきまえ、出しゃばらないように注意しながら、控えめに援助を申し出た。"},{"sentence":"She unpresumptively presented her ideas, acknowledging that others might have different perspectives.","translation":"彼女は他の人が異なる視点を持っているかもしれないことを認めながら、遠慮がちに自分の考えを提示した。"},{"sentence":"The data was analyzed unpresumptively, allowing the results to speak for themselves without prior bias.","translation":"データは先入観なしに、結果がそれ自体を語るように、推定的でない方法で分析された。"}],"collocations":["act unpresumptively (控えめに振る舞う)","speak unpresumptively (遠慮がちに話す)","offer assistance unpresumptively (控えめに援助を申し出る)","analyze data unpresumptively (推定的でない方法でデータを分析する)"],"synonyms":["modestly","humbly","unassumingly","diffidently","reservedly","circumspectly"],"antonyms":["presumptuously","arrogantly","boldly","assertively","immodestly"]}],"etymology":{"value":"接頭辞 un-（否定）+ presumptive（推定的な）+ 接尾辞 -ly（副詞化）。presumptive は presume（推定する）に由来。つまり、「推定しないように」という意味合い。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnpriˈzʌmptɪvli/","syllables":"un-pre-sump-tive-ly"},"inflection":{"notes":"副詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**unpresumptively**」は、行動や態度が控えめで、出しゃばらず、相手の気持ちや立場を尊重する様子を表す言葉です。何かを主張したり、行動したりする際に、相手に不快感を与えないように配慮しているニュアンスが含まれます。学術的な文脈や、フォーマルな場面で使われることが多いです。日常会話では、より一般的な「modestly（謙虚に）」や「humbly（謙遜して）」といった言葉が使われることが多いでしょう。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unpresumptively assumed that he was right.","correct":"✓ He presented his argument unpresumptively, acknowledging other viewpoints.","note":"「unpresumptively」は、何かを「仮定する」という意味合いとは反対のニュアンスを持ちます。仮定せずに、控えめに意見を述べる様子を表す場合に適切です。"},{"incorrect":"✗ She acted unpresumptively, taking charge of the situation.","correct":"✓ She acted unpresumptively, carefully considering everyone's opinions before making a decision.","note":"「unpresumptively」は、積極的に主導権を握るような行動とは相容れません。周囲の意見を尊重し、控えめに行動する様子を表す場合に適切です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["unpresumptuous (形容詞: 控えめな、出しゃばらない)","presumptive (形容詞: 推定的な)","presume (動詞: 推定する)","presumption (名詞: 推定、憶測、厚かましさ)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (非常に高度な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 日常会話ではほとんど使われない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**unpresumptively**」は、非常にフォーマルで、使用頻度の低い単語です。意味は「出しゃばらずに」「控えめに」といったニュアンスで、自分の意見や行動を押し付けるのではなく、相手の立場や気持ちを尊重する態度を表します。学術論文や法律文書など、厳密な表現が求められる場面で使われることがあります。日常会話では、より平易な「modestly」や「humbly」といった言葉を使うのが一般的です。"},"example_sentences":[{"sentence":"The lawyer unpresumptively presented the evidence, allowing the jury to draw their own conclusions.","translation":"弁護士は陪審員が独自の結論を導き出せるように、控えめに証拠を提示した。","type":"adverb","meaning_category":"控えめに"},{"sentence":"He unpresumptively suggested an alternative solution, emphasizing that it was just one possibility among many.","translation":"彼はそれが多くの可能性の一つに過ぎないことを強調しながら、控えめに代替案を提案した。","type":"adverb","meaning_category":"遠慮がちに"},{"sentence":"The researcher approached the data unpresumptively, avoiding any preconceived notions that might bias the analysis.","translation":"研究者は分析に偏見を与える可能性のある先入観を避け、推定的でない方法でデータにアプローチした。","type":"adverb","meaning_category":"推定的でない方法で"}]}