{"word":"truth-mocking","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"嘲笑真実の、真実を嘲るような","english_definition":"Deriding or ridiculing truth; characterized by a cynical or dismissive attitude towards truth.","examples":[{"sentence":"The politician's speech was filled with truth-mocking statements, designed to mislead the public.","translation":"その政治家の演説は、大衆を欺くために作られた、真実を嘲るような発言で満ちていた。"},{"sentence":"His truth-mocking humor often offended those who valued honesty.","translation":"彼の真実を嘲るようなユーモアは、しばしば正直さを重んじる人々を怒らせた。"}],"collocations":["truth-mocking statements","truth-mocking humor","truth-mocking attitude","truth-mocking rhetoric"],"synonyms":["cynical","derisive","scornful","sarcastic","mocking","disrespectful","contemptuous"],"antonyms":["truthful","honest","sincere","respectful","reverent"],"notes":"This word is often used to describe rhetoric or behavior that deliberately distorts or dismisses facts."}],"etymology":{"value":"A compound word formed by combining 'truth' (referring to facts or reality) and 'mocking' (meaning to ridicule or deride). The combination describes something that actively ridicules or treats truth with contempt.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtruːθˌmɒkɪŋ/","syllables":"truth-mock-ing"},"inflection":{"notes":"As an adjective, it does not inflect."},"usage_notes":{"explanation":"'Truth-mocking' is a descriptive adjective often used to critique statements, attitudes, or behaviors that show a dismissive or cynical view of truth. It implies a deliberate distortion or disregard for facts, often with the intent to deceive or manipulate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was truth-mocking to his friend.","correct":"✓ He had a truth-mocking attitude towards his friend's beliefs.","note":"'Truth-mocking' is an adjective that describes a quality or characteristic, not an action directed at someone. Use it to describe an attitude, statement, or behavior."}],"priority":"★★☆"},"related_words":{"derivatives":["mocking (adjective, verb)","truth (noun)","mockery (noun)","truthfulness (noun)"],"related_terms":["cynicism","skepticism","relativism","post-truth"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. The term is relatively uncommon in general usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Truth-mocking' is a sophisticated term used to describe something that ridicules or treats truth with contempt. It's often used in discussions about politics, media, and ethics to critique statements or behaviors that deliberately distort or dismiss facts. Understanding this term requires a good grasp of abstract concepts and nuanced language.","priority":"★★☆"},"example_sentences":[{"sentence":"The comedian's truth-mocking jokes pushed the boundaries of acceptable humor.","translation":"そのコメディアンの真実を嘲るようなジョークは、許容範囲のユーモアの境界線を押し広げた。","type":"adjective","meaning_category":"嘲笑真実の"},{"sentence":"The article criticized the government's truth-mocking approach to environmental issues.","translation":"その記事は、政府の環境問題に対する真実を嘲るようなアプローチを批判した。","type":"adjective","meaning_category":"嘲笑真実の"},{"sentence":"In an era of misinformation, truth-mocking narratives can gain traction easily.","translation":"誤った情報が蔓延する時代において、真実を嘲るような物語は容易に支持を得る可能性がある。","type":"adjective","meaning_category":"嘲笑真実の"}]}