{"word":"Baining","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"バイニング族（ニューブリテン島に住む民族）","english_definition":"An indigenous people inhabiting the Baining Mountains of East New Britain, Papua New Guinea.","examples":[{"sentence":"The Baining people are known for their unique fire dance.","translation":"バイニング族は独特の火の踊りで知られています。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"バイニング族の、バイニング語の","english_definition":"Relating to the Baining people or their language.","examples":[{"sentence":"Baining culture is rich in traditions.","translation":"バイニング族の文化は伝統に富んでいます。"},{"sentence":"The Baining language is spoken in the mountains.","translation":"バイニング語は山岳地帯で話されています。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"バイニング語（ニューブリテン島で話される非オーストロネシア語族の言語）","english_definition":"A non-Austronesian language spoken in the Baining Mountains of East New Britain, Papua New Guinea.","examples":[{"sentence":"Baining is a language isolate.","translation":"バイニング語は孤立した言語です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Likely derived from the name of the region or the people themselves, with origins in local languages of East New Britain.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbaɪnɪŋ/","syllables":"Bai-ning"},"inflection":{},"usage_notes":{"explanation":"'Baining' refers to a specific ethnic group and their language in Papua New Guinea. It is important to use the term respectfully and accurately, especially when discussing their culture or language.","priority":"★☆☆"},"common_mistakes":{},"related_words":{},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Baining' is a specialized term referring to an ethnic group and their language in Papua New Guinea. It is unlikely to be encountered in general English conversation and is primarily used in anthropological, linguistic, or regional studies contexts. Understanding requires familiarity with the geography and cultural diversity of Papua New Guinea."},"example_sentences":[{"sentence":"The Baining of East New Britain have a rich cultural heritage.","translation":"東ニューブリテン島のバイニング族は豊かな文化遺産を持っています。","type":"noun","meaning_category":"民族"},{"sentence":"Linguistic research is being conducted on the Baining language.","translation":"バイニング語に関する言語学的研究が行われています。","type":"proper noun","meaning_category":"言語"},{"sentence":"Traditional Baining dances are performed during ceremonies.","translation":"伝統的なバイニング族の踊りは儀式の際に披露されます。","type":"adjective","meaning_category":"民族の、言語の"}]}