{"word":"Plinyism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学) プリニー式噴火：非常に爆発的な火山噴火の一種で、大量の火山灰、軽石、ガスが成層圏に放出される。","english_definition":"(geology) A Plinian eruption: a type of highly explosive volcanic eruption that ejects vast quantities of ash, pumice, and gas into the stratosphere.","examples":[{"sentence":"The eruption was characterized by Plinyism, sending ash clouds high into the atmosphere.","translation":"その噴火はプリニー式噴火を特徴とし、火山灰の雲を大気圏上層にまで噴き上げた。"},{"sentence":"Geologists studied the deposits to determine the extent of Plinyism during the ancient eruption.","translation":"地質学者たちは、古代の噴火におけるプリニー式噴火の規模を特定するために堆積物を調査した。"}],"collocations":["Plinian eruption","explosive Plinyism","volcanic Plinyism"],"synonyms":["Plinian eruption"],"antonyms":[]}],"etymology":{"value":"古代ローマの博物学者、大プリニウス (プリニウス・マヨル) に由来する。彼は西暦79年のヴェスヴィオ山の噴火を観察し、記録したが、自身もその噴火で命を落とした。この噴火の様子が、プリニー式噴火の特徴をよく表しているため、彼の名が冠された。","priority":"★★★"},"pronunciation":{"ipa":"ˈplɪniɪzəm","syllables":"Plin-i-ism"},"inflection":{"noun_plural":"Plinyisms"},"usage_notes":{"explanation":"「**Plinyism**」は、地質学の専門用語であり、一般的に日常会話で使用されることはありません。火山学の研究や報道などで用いられます。大プリニウスが記録したヴェスヴィオ山の噴火のような、大規模で爆発的な火山噴火を指す場合に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The small lava flow was an example of Plinyism.","correct":"✓ The large ash cloud was an example of Plinyism.","note":"プリニー式噴火は、大規模な火山灰の噴出を伴う爆発的な噴火を指します。小さな溶岩流はプリニー式噴火の特徴ではありません。"},{"incorrect":"✗ Plinyism is a type of earthquake.","correct":"✓ Plinyism is a type of volcanic eruption.","note":"プリニー式噴火は、地震ではなく、火山噴火の一種です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Plinian (形容詞: プリニウス式の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 地質学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Plinyism**」は、火山が爆発的に噴火し、大量の火山灰やガスを空高く噴き上げる現象を指す専門用語です。この名前は、古代ローマの学者である大プリニウスに由来します。彼は西暦79年のヴェスヴィオ火山の噴火を記録しましたが、その噴火で亡くなりました。プリニー式噴火は、非常に激しく、周囲に大きな被害をもたらす可能性があります。この言葉は、火山学の研究やニュース記事などで使われます。"},"example_sentences":[{"sentence":"The geological record shows evidence of past Plinyism in the region.","translation":"その地域の地質記録は、過去のプリニー式噴火の証拠を示している。","type":"noun","meaning_category":"プリニー式噴火"},{"sentence":"The Plinyism caused widespread ashfall, disrupting air travel.","translation":"プリニー式噴火は広範囲に火山灰を降らせ、航空機の運航を混乱させた。","type":"noun","meaning_category":"プリニー式噴火"}]}