{"word":"ametabolian","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"不変態の、無変態の (昆虫などが変態をしないこと)","english_definition":"(of an insect) having no metamorphosis; undergoing slight changes in form during development, with the young resembling the adult except in size and sexual maturity.","examples":[{"sentence":"Silverfish are ametabolian insects.","translation":"シミは不変態の昆虫です。"},{"sentence":"Ametabolian development is the most primitive form of insect development.","translation":"不変態の発生は、昆虫の発生の中で最も原始的な形態です。"}],"collocations":["ametabolian insect","ametabolian development"],"synonyms":["apterygote"],"antonyms":["hemimetabolous","holometabolous"]}],"etymology":{"value":"The word \"ametabolian\" comes from the Greek words \"a-\" (meaning \"not\"), \"meta-\" (meaning \"change\"), and \"-bolos\" (meaning \"throwing\"). So, it literally means \"not changing\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪˌmɛtəˈboʊliən/","syllables":"a-me-ta-bo-li-an"},"inflection":{},"usage_notes":{"explanation":"\"Ametabolian\" describes insects that undergo very little or no metamorphosis. The young insects, called nymphs, look very similar to the adults, only smaller and without fully developed reproductive organs. They simply grow larger and molt (shed their skin) several times until they reach their adult size. This is in contrast to insects that undergo incomplete metamorphosis (hemimetabolous) or complete metamorphosis (holometabolous), where the young stages look very different from the adults.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["ametabolism (noun)"],"related_terms":["hemimetabolous","holometabolous","metamorphosis","insect development"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term \"ametabolian\" is a specialized term used in entomology (the study of insects). It describes a type of insect development where the young insects closely resemble the adults, only differing in size and sexual maturity. This type of development is considered more primitive than hemimetabolous (incomplete metamorphosis) and holometabolous (complete metamorphosis). Understanding this term requires some background knowledge of insect biology and development.","priority":"★★☆"},"example_sentences":[{"sentence":"The bristletails are a classic example of an **ametabolian** insect.","translation":"トビムシは不変態昆虫の典型的な例です。","type":"adjective","meaning_category":"不変態の"},{"sentence":"In **ametabolian** insects, the nymphs and adults occupy the same ecological niche.","translation":"不変態昆虫では、幼虫と成虫は同じ生態的ニッチを占めています。","type":"adjective","meaning_category":"不変態の"}]}