{"word":"dispensatorily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"(形式的) 分配的に、配分的に、免除的に","english_definition":"In a dispensatory manner; by way of dispensation or distribution; in a way that grants exemption or special permission.","examples":[{"sentence":"The government acted dispensatorily, granting tax breaks to certain industries.","translation":"政府は分配的に行動し、特定の産業に税制上の優遇措置を与えた。"},{"sentence":"The rules were applied dispensatorily, with some students receiving exemptions.","translation":"規則は免除的に適用され、一部の学生は免除を受けた。"}],"collocations":["apply rules dispensatorily","act dispensatorily","treat someone dispensatorily"],"synonyms":["exemptively","liberally","permissively","conditionally"],"antonyms":["strictly","uniformly","consistently"]}],"etymology":{"value":"Derived from 'dispensatory,' which relates to dispensation or distribution. 'Dispensatory' comes from 'dispense,' meaning to distribute or administer. The suffix '-ly' turns it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈspɛnsəˌtɔːrɪli/","syllables":"di-spen-sa-to-ri-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Dispensatorily' is a formal adverb describing actions done in a way that distributes something or grants exemptions. It's often used in legal, governmental, or institutional contexts where rules or benefits are not applied uniformly. The term implies a degree of discretion or special treatment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He dispensatorily gave money to everyone.","correct":"✓ He gave money to everyone generously.","note":"'Dispensatorily' implies a structured distribution or granting of exemptions, not simply giving generously. Using 'generously' is more appropriate in this context."},{"incorrect":"✗ The teacher treated all students dispensatorily.","correct":"✓ The teacher treated some students dispensatorily, granting them extra time on the exam.","note":"'Dispensatorily' suggests not all are treated the same, but rather some are given special allowances. If all are treated the same, 'fairly' or 'equally' would be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["dispensatory (adjective)","dispensatory (noun)","dispensation (noun)","dispense (verb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dispensatorily' is a rare and formal adverb, used to describe actions that involve distribution or granting exemptions in a non-uniform manner. Its usage is typically limited to formal or technical contexts, such as legal or governmental discussions. Due to its low frequency and specialized meaning, it is considered an advanced vocabulary word.","priority":"★☆☆"},"example_sentences":[{"sentence":"The judge ruled that the law was being applied dispensatorily, favoring one group over another.","translation":"裁判官は、法律が一つのグループを他よりも優遇して、分配的に適用されていると判決を下した。","type":"adverb","meaning_category":"Distribution and Exemption"},{"sentence":"The funding was allocated dispensatorily, with certain projects receiving more support based on their perceived importance.","translation":"資金は、特定のプロジェクトがその重要性に基づいてより多くの支援を受けるように、配分的に割り当てられた。","type":"adverb","meaning_category":"Distribution and Exemption"}]}