{"word":"teindable","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(主にスコットランド法) 十分の一税を課税できる、または課税される","english_definition":"(chiefly Scots Law) Liable or subject to the payment of teinds.","examples":[{"sentence":"The teindable lands were assessed for their value.","translation":"十分の一税を課税できる土地はその価値に応じて評価された。"},{"sentence":"A teindable subject is one from which teinds are due.","translation":"十分の一税を課税できる対象とは、十分の一税が課されるものである。"}],"collocations":["teindable lands","teindable subject","teindable property"],"synonyms":["titheable","assessable","taxable"],"antonyms":["teind-free","exempt"],"notes":"This term is primarily used in the context of Scots Law, referring to the historical system of teinds (a form of tithe)."}],"etymology":{"value":"Derived from 'teind' (Scots Law term for tithe, ultimately from Old Norse 'tíund') + '-able' (suffix indicating capability or liability).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtiːndəbəl/","syllables":"teind-a-ble"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"In Scots law, 'teindable' refers to land or property that is subject to teinds, which were originally a tenth of the produce of the land paid to the church or other beneficiary. The term is primarily historical, as the system of teinds has been reformed over time.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["teind","teind-free","teinds"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - primarily a legal term related to Scots law.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Teindable' is a specialized term primarily encountered in the context of Scots law and historical discussions of land ownership and taxation. It signifies that a piece of land or property is subject to the payment of teinds, which were a form of tithe. Due to its specific legal and historical context, it is not a commonly used word and would primarily be understood by those with knowledge of Scots law or Scottish history."},"example_sentences":[{"sentence":"The old records indicated which farms were teindable and which were not.","translation":"古い記録は、どの農場が十分の一税を課税できるか、そうでないかを示していた。","type":"adjective","meaning_category":"taxable"}]}