{"word":"mysteriosophic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"神秘哲学的な、神秘主義的な知恵に関する","english_definition":"Relating to or characterized by mysterial wisdom or a combination of mysticism and philosophy.","examples":[{"sentence":"The text delved into mysteriosophic concepts, exploring the intersection of spiritual experience and rational thought.","translation":"そのテキストは、神秘哲学的な概念を掘り下げ、精神的な経験と合理的な思考の交差点を考察した。"},{"sentence":"His teachings were a blend of mysteriosophic insights and practical advice.","translation":"彼の教えは、神秘哲学的な洞察と実践的なアドバイスの融合だった。"}],"collocations":["mysteriosophic teachings","mysteriosophic concepts","mysteriosophic approach","mysteriosophic tradition"],"synonyms":["mystical","esoteric","philosophical","spiritual","occult"],"antonyms":["materialistic","rational","scientific","empirical"]}],"etymology":{"value":"A blend of 'mysterious' or 'mysticism' and 'philosophic' or 'philosophy'. The term suggests a combination of mystical or esoteric insights with philosophical inquiry.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪˌstɪri.oʊˈsɑːfɪk/","syllables":"mys-te-ri-o-so-phic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Mysteriosophic' is a relatively rare term, often used in academic or philosophical contexts to describe ideas or approaches that combine mystical or esoteric elements with philosophical reasoning. It suggests a search for wisdom that goes beyond purely rational or empirical methods, incorporating spiritual or intuitive insights.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mysteriosophic is easy to understand.","correct":"✓ Mysteriosophic ideas are often complex.","note":"'Mysteriosophic' is an adjective, so it needs to modify a noun. It cannot be used as a noun itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["mysteriosophy (noun: A system of thought combining mysticism and philosophy.)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Mysteriosophic' is a complex term used in specialized contexts, primarily in philosophy and religious studies. It describes something that combines mystical or esoteric ideas with philosophical inquiry. Understanding this word requires familiarity with both mystical and philosophical concepts."},"example_sentences":[{"sentence":"The scholar explored the mysteriosophic dimensions of ancient religious texts.","translation":"その学者は、古代宗教文書の神秘哲学的な側面を調査した。","type":"general","meaning_category":"general"},{"sentence":"Her art reflected a mysteriosophic understanding of the universe.","translation":"彼女の芸術は、宇宙に対する神秘哲学的な理解を反映していた。","type":"general","meaning_category":"general"}]}