{"word":"passementing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(装飾) パスマンタリー細工、トリミング細工、ブレード細工","english_definition":"Ornamentation or trimming made of braid, cord, beads, or other decorative elements; the art or craft of making such trimmings.","examples":[{"sentence":"The dress featured elaborate passementing around the neckline and cuffs.","translation":"そのドレスは、ネックラインと袖口に精巧なパスマンタリー細工が施されていました。"},{"sentence":"She studied passementing techniques at a specialized school.","translation":"彼女は専門学校でパスマンタリー細工の技術を学びました。"}],"collocations":["elaborate passementing","fine passementing","silk passementing","gold passementing"],"synonyms":["trimming","ornamentation","braiding","embellishment"],"antonyms":["plain","unadorned"]}],"etymology":{"value":"Derived from the French word 'passementerie,' which refers to ornamental edgings, braid, or trimming.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpæs.mən.tɪŋ/","syllables":"pas-men-ting"},"inflection":{"noun_plural":"passementings"},"usage_notes":{"explanation":"'Passementing' refers specifically to the application or creation of passementerie, which includes various types of ornamental trims. It is often used in the context of fashion, interior design, and historical costumes. The term emphasizes the process or the result of adding decorative trimmings.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She added many passementing to the cake.","correct":"✓ She added a lot of passementerie to the cake.","note":"Passementerie is the general term for the trimmings themselves. Passementing is the act of applying or creating them. Cakes are not typically decorated with passementerie."},{"incorrect":"✗ The passementing was very easy to do.","correct":"✓ The passementerie was very easy to apply.","note":"'Passementerie' refers to the actual trimmings, while 'passementing' refers to the act of applying or creating them."}],"priority":"★★☆"},"related_words":{"derivatives":["passementerie (noun: ornamental edgings, braid, or trimming)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Passementing' is a specialized term referring to the application or creation of ornamental trimmings, such as braids, cords, and beads, often used in fashion or interior design. It is derived from 'passementerie,' which refers to the trimmings themselves. Due to its niche usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The artisan demonstrated her skills in creating intricate passementing for historical garments.","translation":"職人は、歴史的な衣服のために複雑なパスマンタリー細工を作成する技術を実演しました。","type":"noun","meaning_category":"パスマンタリー細工"},{"sentence":"The interior designer incorporated passementing to add a touch of elegance to the curtains.","translation":"インテリアデザイナーは、カーテンに優雅さを加えるためにパスマンタリー細工を取り入れました。","type":"noun","meaning_category":"トリミング細工"}]}