{"word":"handlaid","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"手漉きの、手作業で配置された","english_definition":"Made or placed by hand, especially paper made by hand using a mould and deckle, or something carefully positioned by hand.","examples":[{"sentence":"This paper is handlaid, giving it a unique texture.","translation":"この紙は手漉きで、独特の風合いがあります。"},{"sentence":"The mosaic tiles were handlaid with great precision.","translation":"モザイクタイルは、非常に正確に手作業で配置されました。"}],"collocations":["handlaid paper","handlaid mosaic","handlaid bricks"],"synonyms":["handmade","handcrafted","hand-placed"],"antonyms":["machine-made","mass-produced"]},{"part_of_speech":"verb","definition":"handlayの過去形・過去分詞","english_definition":"Past tense and past participle of handlay.","examples":[{"sentence":"The cables were handlaid along the ocean floor.","translation":"ケーブルは海底に沿って手作業で敷設されました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Hand' + 'laid'. Refers to the manual process of making something or placing something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhændleɪd/","syllables":"hand-laid"},"inflection":{"notes":"Adjective: No comparative or superlative forms. Verb: Past tense and past participle of handlay."},"usage_notes":{"explanation":"'Handlaid' is often used to describe high-quality or artisanal products where the manual process is valued. It emphasizes the care and attention given to the creation or placement of something, as opposed to automated or mass-produced methods.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The machine was handlaid.","correct":"✓ The parts were handlaid.","note":"'Handlaid' implies a manual process, so it cannot be used to describe something made by a machine."}],"priority":"★☆☆"},"related_words":{"derivatives":["handlay"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Handlaid' describes something made or placed by hand, emphasizing the manual process and care involved. It's often used for artisanal or high-quality items like paper or mosaics. The word implies a contrast to machine-made or mass-produced items."},"example_sentences":[{"sentence":"The book was printed on expensive handlaid paper.","translation":"その本は高価な手漉き紙に印刷されました。","type":"adjective","meaning_category":"手漉きの"},{"sentence":"The bricks of the old fireplace were carefully handlaid.","translation":"古い暖炉のレンガは丁寧に手作業で配置されました。","type":"adjective","meaning_category":"手作業で配置された"},{"sentence":"The fiber optic cables were handlaid to ensure minimal disruption to the surrounding environment.","translation":"光ファイバーケーブルは、周辺環境への影響を最小限に抑えるため、手作業で敷設されました。","type":"verb","meaning_category":"手作業で配置された"}]}