{"word":"Denigrators","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"中傷する人、けなす人、名誉を傷つける人","english_definition":"People who criticize unfairly; disparage or belittle someone or something.","examples":[{"sentence":"The project had its denigrators, but it ultimately succeeded.","translation":"そのプロジェクトには中傷する人もいたが、最終的には成功した。"},{"sentence":"She ignored the denigrators and continued to pursue her dreams.","translation":"彼女は中傷する人を無視して、夢を追い続けた。"},{"sentence":"Despite the denigrators' efforts, the artist's work gained recognition.","translation":"中傷する人たちの努力にもかかわらず、そのアーティストの作品は認められるようになった。"}],"collocations":["online denigrators (ネット上で中傷する人たち)","political denigrators (政敵を中傷する人たち)","vocal denigrators (声高に中傷する人たち)"],"synonyms":["critic","detractor","belittler","disparager","slanderer","defamer"],"antonyms":["supporter","admirer","advocate","promoter"]}],"etymology":{"value":"The word 'denigrator' comes from the verb 'denigrate,' which originates from the Latin word 'denigrare,' meaning 'to blacken,' 'to darken,' or 'to defame.' This comes from 'niger,' meaning 'black.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɛnɪɡreɪtərz/","syllables":"De-ni-gra-tors"},"inflection":{"noun_plural":"denigrators"},"usage_notes":{"explanation":"'Denigrators' refers to people who actively attempt to diminish the reputation or value of someone or something. The term implies a degree of unfairness or malice in the criticism. It's stronger than a simple 'critic' and suggests a deliberate effort to discredit.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a denigrator of the company's success.","correct":"✓ He is a denigrator of the company.","note":"'Denigrator' refers to a person, not an action. So, someone is a denigrator *of* a person or entity (like a company), not of an abstract concept like 'success.'"},{"incorrect":"✗ The denigrators were very support of the project.","correct":"✓ The denigrators were very critical of the project.","note":"Denigrators are, by definition, critical, not supportive. This is a direct contradiction."}],"priority":"★★☆"},"related_words":{"derivatives":["denigrate (verb: to criticize unfairly; disparage)","denigration (noun: the act of denigrating)","denigratory (adjective: disparaging; belittling)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'denigrators' is a relatively advanced term referring to individuals who unfairly criticize or disparage someone or something. It implies a deliberate attempt to diminish the reputation or value of the subject. Understanding this word requires a good vocabulary and an appreciation for nuance in language. It's often used in formal writing or discussions about reputation, criticism, and opposition."},"example_sentences":[{"sentence":"The politician dismissed his denigrators as biased opponents.","translation":"その政治家は、自身を中傷する人々を偏った反対者として退けた。","type":"noun","meaning_category":"中傷する人"},{"sentence":"Despite the online denigrators, the film received positive reviews from critics.","translation":"ネット上で中傷する人がいるにもかかわらず、その映画は批評家から肯定的な評価を受けた。","type":"noun","meaning_category":"中傷する人"},{"sentence":"The author chose to ignore the denigrators and focus on the positive feedback.","translation":"その作家は、中傷する人を無視して、肯定的なフィードバックに集中することにした。","type":"noun","meaning_category":"中傷する人"}]}