{"word":"cannibally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"人食い的に、共食い的に","english_definition":"In a cannibalistic manner; relating to or involving cannibalism.","examples":[{"sentence":"The tribe was described as acting cannibally towards their enemies.","translation":"その部族は敵に対して人食い的な行為をしていたと記述された。"},{"sentence":"The spiders behaved cannibally, devouring their weaker siblings.","translation":"そのクモたちは共食い的に振る舞い、弱い兄弟をむさぼり食った。"}],"collocations":["act cannibally","behave cannibally","cannibally inclined"],"synonyms":["savagely","ferociously","predatorily"],"antonyms":["humanely","compassionately","altruistically"]}],"etymology":{"value":"Derived from the adjective 'cannibal' (meaning a person who eats human flesh) with the addition of the suffix '-ly' to form an adverb. The word 'cannibal' itself comes from the Spanish word 'Caníbales', a name for the Caribs, a West Indies tribe formerly believed to practice cannibalism.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkænɪbəli/","syllables":"can-ni-bal-ly"},"inflection":{"notes":"Adverb, does not inflect."},"usage_notes":{"explanation":"The adverb 'cannibally' describes an action or behavior that is characteristic of cannibalism, whether literal (involving the eating of human flesh) or figurative (involving the exploitation or destruction of one's own kind). Its usage is relatively rare, typically found in anthropological, zoological, or metaphorical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company was cannibally their own products.","correct":"✓ The company was cannibalizing their own products.","note":"'Cannibally' is an adverb, so it modifies a verb. 'Cannibalize' is the verb form meaning to take parts from (something) to use in the repair or construction of something else, or to take market share from an existing product."}],"priority":"★★☆"},"related_words":{"derivatives":["cannibal (noun)","cannibalistic (adjective)","cannibalism (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'cannibally' is an adverb that describes an action performed in a manner characteristic of cannibalism. It is a relatively rare word, typically used in specialized contexts such as anthropology or zoology, or metaphorically to describe destructive competition within a group. Due to its specialized and often disturbing connotations, it is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The praying mantis often behaves cannibally, especially after mating.","translation":"カマキリは特に交尾後、共食い的に振る舞うことが多い。","type":"descriptive","meaning_category":"共食い"},{"sentence":"The startup was accused of cannibally exploiting its interns.","translation":"そのスタートアップ企業はインターンを人食い的に搾取していると非難された。","type":"metaphorical","meaning_category":"搾取"}]}