{"word":"pinguefaction","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(病理学) 脂肪変性：組織が脂肪に変化する過程、特に死後の腐敗過程の一部として見られる現象。","english_definition":"(pathology) The conversion of tissue into fat, especially as part of the post-mortem putrefaction process.","examples":[{"sentence":"Pinguefaction is a process that occurs in the decomposition of organic matter.","translation":"脂肪変性は有機物の分解過程で起こる現象です。"},{"sentence":"The pathologist noted the presence of pinguefaction in the deceased's tissues.","translation":"病理医は、故人の組織に脂肪変性が認められると記録しました。"}],"collocations":["post-mortem pinguefaction (死後脂肪変性)","tissue pinguefaction (組織脂肪変性)"],"synonyms":["adipocere formation","saponification","lipolysis"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'pinguis' meaning 'fat' or 'grease' and 'facere' meaning 'to make'. The term describes the process of making something fatty.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɪŋɡwɪˈfækʃən/","syllables":"ping-gue-fac-tion"},"inflection":{"noun_plural":"pinguefactions"},"usage_notes":{"explanation":"Pinguefaction is a relatively rare term, primarily used in forensic pathology and related scientific fields. It refers specifically to the chemical transformation of tissues into a waxy, fatty substance, typically occurring after death in specific environmental conditions (e.g., moist environments). It is important to note that this term is distinct from 'pinguecula', which is a benign growth on the conjunctiva of the eye.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pinguefaction was treated with antibiotics.","correct":"✓ Pinguefaction is a post-mortem process and cannot be treated.","note":"Pinguefaction occurs after death and is not a condition that can be treated medically."},{"incorrect":"✗ Pinguefaction is a symptom of obesity.","correct":"✓ Pinguefaction is a post-mortem decomposition process, not related to obesity in living individuals.","note":"Pinguefaction is unrelated to the metabolic processes of living organisms."}],"priority":"★☆☆"},"related_words":{"derivatives":["pinguescent (adjective: becoming fatty)"],"related_terms":["adipocere","saponification","putrefaction","decomposition"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pinguefaction' is a highly technical term primarily encountered in forensic science, pathology, and related academic contexts. Understanding this term requires familiarity with biological and chemical processes related to decomposition. It is not part of general vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The advanced state of pinguefaction made identification of the body difficult.","translation":"脂肪変性の進行により、遺体の身元特定が困難になった。","type":"general","meaning_category":"decomposition process"},{"sentence":"Forensic scientists analyzed the extent of pinguefaction to estimate the time of death.","translation":"法科学者は、死亡時刻を推定するために脂肪変性の程度を分析した。","type":"forensic science","meaning_category":"decomposition process"}]}