{"word":"Airmanship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"航空術、操縦技術","english_definition":"The art, skill, and knowledge of piloting an aircraft safely and efficiently. It encompasses a broad range of abilities, including aircraft handling, navigation, decision-making, and risk management.","examples":[{"sentence":"Good airmanship is essential for flight safety.","translation":"優れた航空術は、飛行の安全に不可欠です。"},{"sentence":"The pilot demonstrated excellent airmanship in handling the emergency.","translation":"パイロットは緊急事態への対応において、優れた操縦技術を示した。"},{"sentence":"Airmanship includes not only flying skills but also sound judgment and decision-making.","translation":"航空術には、操縦技術だけでなく、健全な判断力と意思決定も含まれる。"}],"collocations":["demonstrate airmanship","good airmanship","poor airmanship","essential airmanship","professional airmanship"],"synonyms":["piloting skill","aviation skill","flight proficiency","aircraft handling","aviating"],"antonyms":["poor airmanship","careless flying","reckless flying"]}],"etymology":{"value":"The word 'airmanship' is formed by combining 'airman' (a member of an aircrew or a skilled aviator) with '-ship' (denoting skill, art, or quality, as in 'craftsmanship' or 'sportsmanship').","priority":"★★☆"},"pronunciation":{"ipa":"ˈɛərmənˌʃɪp","syllables":"air-man-ship"},"inflection":{"noun_plural":"airmanships (rarely used)"},"usage_notes":{"explanation":"'Airmanship' is a comprehensive term that goes beyond the basic ability to control an aircraft. It emphasizes the importance of safety, efficiency, and sound judgment in all aspects of flight operations. It is often used in the context of pilot training, aviation safety, and accident investigation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a good flymanship.","correct":"✓ He has good airmanship.","note":"'Airmanship' is the correct term for the skill and art of piloting. 'Flymanship' is not a standard word."},{"incorrect":"✗ Airmanship is only about flying the plane.","correct":"✓ Airmanship includes flying the plane, but also involves decision-making, navigation, and risk management.","note":"Airmanship encompasses a wide range of skills and knowledge, not just the physical act of flying."}],"priority":"★★☆"},"related_words":{"derivatives":["airman","aviator","pilot","aviation","aerospace"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Airmanship' is a specialized term primarily used in the context of aviation. It refers to the comprehensive skill, knowledge, and judgment required to operate an aircraft safely and efficiently. Understanding this term requires familiarity with aviation concepts and terminology."},"example_sentences":[{"sentence":"The accident was attributed to a lack of airmanship on the part of the pilot.","translation":"その事故は、パイロットの航空術の欠如が原因とされた。","type":"general","meaning_category":"航空術"},{"sentence":"The training program emphasizes the development of strong airmanship skills.","translation":"その訓練プログラムは、強力な航空術のスキル開発を重視している。","type":"general","meaning_category":"航空術"},{"sentence":"Airmanship is not just about technical skills; it also involves attitude and decision-making.","translation":"航空術は単なる技術的なスキルだけでなく、態度や意思決定も含まれる。","type":"general","meaning_category":"航空術"}]}