{"word":"doublewidth","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"倍幅の、全角の","english_definition":"Having twice the normal width, especially of characters in a computer font.","examples":[{"sentence":"The software supports doublewidth characters for Japanese and Chinese.","translation":"そのソフトウェアは日本語と中国語の全角文字をサポートしています。"},{"sentence":"Some older systems struggle to display doublewidth characters correctly.","translation":"古いシステムの中には、全角文字を正しく表示するのが難しいものもあります。"}],"collocations":["doublewidth character","doublewidth font","doublewidth space"],"synonyms":["fullwidth"],"antonyms":["halfwidth"],"notes":"Primarily used in the context of computing and typography, especially when dealing with East Asian languages."}],"etymology":{"value":"Combination of 'double' and 'width', indicating twice the standard width.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈdʌbəlˌwɪθ/","syllables":"dub-ble-width"},"inflection":{"notes":"Not applicable, as it's an adjective."},"usage_notes":{"explanation":"'Doublewidth' is commonly used to describe characters, fonts, or spaces that occupy twice the horizontal space of their standard counterparts. This is particularly relevant in computing when handling languages like Japanese, Chinese, and Korean, where doublewidth characters (also known as fullwidth characters) are frequently used alongside standard (halfwidth) characters.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doublewidth is too large.","correct":"✓ The doublewidth character is too large.","note":"'Doublewidth' functions as an adjective, so it needs to modify a noun."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_terms":["fullwidth","halfwidth","character width","monospace font"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Doublewidth' is a technical term primarily used in computing and typography. It refers to characters or fonts that are twice the width of standard characters. This is especially relevant when dealing with East Asian languages like Japanese, Chinese, and Korean, where both standard and doublewidth characters are used. Understanding this term is helpful when working with text encoding, font design, or software localization."},"example_sentences":[{"sentence":"The program automatically converts halfwidth characters to **doublewidth** for better readability in the Japanese version.","translation":"そのプログラムは、日本語版での読みやすさを向上させるために、半角文字を自動的に全角文字に変換します。","type":"adjective","meaning_category":"倍幅の・全角の"},{"sentence":"Using a **doublewidth** font can improve the layout of tables with mixed English and Japanese text.","translation":"全角フォントを使用すると、英語と日本語のテキストが混在するテーブルのレイアウトを改善できます。","type":"adjective","meaning_category":"倍幅の・全角の"}]}