{"word":"diamagnetism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"反磁性","english_definition":"A property of a substance that causes it to create an induced magnetic field in a direction opposite to an externally applied magnetic field, and therefore causes a repulsive force.","examples":[{"sentence":"Water exhibits diamagnetism.","translation":"水は反磁性を示す。"},{"sentence":"Diamagnetism is a fundamental property of all materials.","translation":"反磁性はすべての物質の基本的な性質である。"}],"collocations":["exhibit diamagnetism (反磁性を示す)","diamagnetic material (反磁性体)","diamagnetic susceptibility (反磁化率)"],"synonyms":["magnetic repulsion"],"antonyms":["ferromagnetism","paramagnetism"]}],"etymology":{"value":"Derived from the Greek prefix 'dia-' meaning 'through' or 'across', and 'magnetism'. It refers to the substance's behavior in relation to an applied magnetic field.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdaɪ.əˈmæɡnəˌtɪzəm/","syllables":"di-a-mag-ne-tism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Diamagnetism is a quantum mechanical effect that all materials exhibit when subjected to a magnetic field. However, it's usually a very weak effect, and is often overshadowed by paramagnetism or ferromagnetism. Diamagnetic materials are repelled by a magnetic field; an applied magnetic field creates an induced magnetic field in them in the opposite direction, causing a repulsive force.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Diamagnetism is a strong attraction to magnets.","correct":"✓ Diamagnetism is a weak repulsion from magnets.","note":"Diamagnetism is a repulsive force, not an attractive one."},{"incorrect":"✗ Only metals can exhibit diamagnetism.","correct":"✓ All materials can exhibit diamagnetism.","note":"While it is often overshadowed by other magnetic properties, all materials exhibit diamagnetism to some extent."}],"priority":"★★☆"},"related_words":{"derivatives":["diamagnetic (adjective, noun)"],"related_terms":["paramagnetism","ferromagnetism","magnetism","superconductivity"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, mainly used in scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Diamagnetism is a scientific term describing a fundamental property of all materials where they create an induced magnetic field opposing an external magnetic field, resulting in a repulsive force. While all materials exhibit this, it's often weak compared to other magnetic behaviors like paramagnetism or ferromagnetism. It's a term mainly used in physics, chemistry, and materials science contexts."},"example_sentences":[{"sentence":"The experiment demonstrated the diamagnetism of bismuth.","translation":"その実験はビスマスの反磁性を示した。","type":"general","meaning_category":"反磁性"},{"sentence":"Due to its diamagnetism, water is slightly repelled by magnets.","translation":"その反磁性のため、水は磁石によってわずかに反発される。","type":"general","meaning_category":"反磁性"},{"sentence":"The diamagnetic susceptibility of the material was measured using a SQUID magnetometer.","translation":"その材料の反磁化率は、SQUID磁力計を用いて測定された。","type":"technical","meaning_category":"反磁性"}]}