{"word":"Preppie","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(米国で)名門私立高校生、またはそのスタイルを真似る人","english_definition":"(in the US) a person who attends or has attended a preparatory school; a person who dresses and behaves in a way considered typical of students from wealthy private schools.","examples":[{"sentence":"He was a preppie from a wealthy family.","translation":"彼は裕福な家庭出身の名門私立高校生だった。"},{"sentence":"The store sells preppie clothing.","translation":"その店はプレッピーファッションの服を売っている。"}],"collocations":["preppie look","preppie style","preppie clothing"],"synonyms":["prep","yuppie"],"antonyms":[]},{"part_of_speech":"adjective","definition":"名門私立高校生風の、プレッピーの","english_definition":"relating to or characteristic of preppies or their style.","examples":[{"sentence":"She has a preppie look with her polo shirt and khakis.","translation":"彼女はポロシャツとカーキでプレッピースタイルだ。"},{"sentence":"The preppie style is back in fashion.","translation":"プレッピースタイルが再び流行している。"}],"collocations":["preppie fashion","preppie clothes","preppie lifestyle"],"synonyms":["preppy"],"antonyms":[]}],"etymology":{"value":"\"Preppie\" is derived from \"preparatory school,\" referring to private schools that prepare students for college. The term originated in the mid-20th century in the United States.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈprɛpi/","syllables":"prep-pie"},"inflection":{"noun_plural":"preppies","adjective_forms":{}},"usage_notes":{"explanation":"\"Preppie\" refers to students attending or alumni of preparatory schools, typically associated with wealth and high social status. The term also describes a specific fashion style characterized by classic, conservative clothing such as polo shirts, khakis, loafers, and blazers. While originally associated with elite private schools, the preppie style has become a broader cultural phenomenon.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a preppy, so he is rich always.","correct":"✓ He is a preppie, so he is often rich.","note":"Not all preppies are rich, although the style is associated with wealth. Using 'often' is more accurate."},{"incorrect":"✗ She dressed preppy, but she is not preppie.","correct":"✓ She dressed preppy, but she did not attend a preparatory school.","note":"'Preppy' can be an adjective describing the style, while 'preppie' as a noun refers to someone who attends/attended a preparatory school."}],"priority":"★★☆"},"related_words":{"derivatives":["prep (short for preparatory school)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"preppie\" refers to someone who attends or has attended a preparatory school, which is usually a private school that prepares students for college. It also describes a style of dress and behavior associated with these schools, often characterized by classic and conservative clothing. The term is more common in the United States and might not be widely understood in other cultures.","priority":"★★☆"},"example_sentences":[{"sentence":"The preppie look includes items like polo shirts, khakis, and loafers.","translation":"プレッピースタイルには、ポロシャツ、カーキ、ローファーなどのアイテムが含まれます。","type":"noun/adjective","meaning_category":"style"},{"sentence":"She sent her children to a prestigious preppie school.","translation":"彼女は子供たちを名門プレップスクールに通わせた。","type":"noun","meaning_category":"school"},{"sentence":"His preppie upbringing influenced his conservative views.","translation":"彼のプレッピーな育ちは、彼の保守的な見解に影響を与えた。","type":"adjective","meaning_category":"upbringing"}]}