{"word":"horologist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"時計職人、時計学研究者","english_definition":"A person skilled in the art or science of measuring time; a maker or repairer of clocks and watches; one who studies horology.","examples":[{"sentence":"The horologist carefully examined the intricate workings of the antique clock.","translation":"時計職人は、そのアンティーク時計の複雑な仕組みを注意深く調べた。"},{"sentence":"A skilled horologist can restore even the most damaged timepieces to their original condition.","translation":"熟練した時計職人なら、どんなに損傷した時計でも元の状態に修復できる。"},{"sentence":"The horologist's shop was filled with the ticking of countless clocks.","translation":"時計職人の店は、数えきれないほどの時計の時を刻む音で満たされていた。"}],"collocations":["skilled horologist","master horologist","antique horologist","watch horologist","clock horologist"],"synonyms":["watchmaker","clockmaker","timekeeper","chronometer specialist"],"antonyms":[]}],"etymology":{"value":"The word \"horologist\" comes from the Greek words \"hora\" (ὥρα), meaning \"hour\" or \"time,\" and \"logia\" (-λογία), meaning \"study of\" or \"science of.\" Thus, horology is the study of time, and a horologist is someone who studies or works with timekeeping devices.","priority":"★★☆"},"pronunciation":{"ipa":"/hɔˈrɒlədʒɪst/","syllables":"ho-rol-o-gist"},"inflection":{"noun_plural":"horologists"},"usage_notes":{"explanation":"A horologist is someone who has expertise in the field of horology, which is the study of time and timekeeping. This can include the design, construction, repair, and history of clocks, watches, and other timekeeping devices. The term is often used to describe skilled watchmakers and clockmakers, especially those who work with antique or complex timepieces.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a horology.","correct":"✓ He is a horologist.","note":"'Horology' is the study of timekeeping, while 'horologist' is the person who studies or practices it."},{"incorrect":"✗ Horologists fix cars.","correct":"✓ Horologists fix clocks and watches.","note":"Horologists specialize in timekeeping devices, not automobiles."}],"priority":"★☆☆"},"related_words":{"derivatives":["horology (noun: the study of the art or science of measuring time)","horological (adjective: relating to horology or horologists)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"horologist\" is a specialized term referring to someone who is skilled in the art and science of measuring time. This includes making, repairing, and studying clocks and watches. It is not a commonly used word in everyday conversation, but it is important in the context of watchmaking, clockmaking, and the history of timekeeping. Understanding this word requires a good vocabulary and an interest in technical or historical subjects."},"example_sentences":[{"sentence":"The museum hired a horologist to restore its collection of antique clocks.","translation":"博物館は、所蔵するアンティーク時計のコレクションを修復するために時計職人を雇った。","type":"general","meaning_category":"時計職人"},{"sentence":"As a horologist, she is fascinated by the intricate mechanisms of mechanical watches.","translation":"時計学研究者として、彼女は機械式時計の複雑な機構に魅了されている。","type":"general","meaning_category":"時計学研究者"},{"sentence":"The horologist used specialized tools to disassemble and clean the delicate parts of the watch.","translation":"時計職人は、時計の繊細な部品を分解して清掃するために特殊な道具を使った。","type":"general","meaning_category":"時計職人"}]}