{"word":"lichenised","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"地衣類化した、地衣類状の","english_definition":"(of a fungus) having formed a symbiotic association with an alga or cyanobacterium, resulting in a lichen.","examples":[{"sentence":"The lichenised fungi are able to survive in harsh environments.","translation":"地衣類化した菌類は、過酷な環境で生き残ることができる。"},{"sentence":"Many alpine plants are lichenised for increased nutrient uptake.","translation":"多くの高山植物は、栄養吸収を増やすために地衣類化している。"}],"collocations":["lichenised fungi","lichenised algae","lichenised plant"],"synonyms":["lichenized","symbiotic","composite"],"antonyms":["free-living","non-lichenised"]}],"etymology":{"value":"'Lichenised' is derived from the word 'lichen', referring to the composite organism formed from a symbiotic association between a fungus and an alga or cyanobacterium. The suffix '-ised' indicates the process of becoming or being like a lichen.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlaɪkənaɪzd/","syllables":"li-chen-ised"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Lichenised' is primarily used in scientific and botanical contexts to describe organisms, particularly fungi, that have undergone lichenization, forming a symbiotic relationship with algae or cyanobacteria. It emphasizes the state of being part of a lichen.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock was lichenised with moss.","correct":"✓ The rock was covered with lichens.","note":"'Lichenised' describes the state of an organism, not the covering of a surface. Use 'covered with lichens' instead."},{"incorrect":"✗ The lichenised is a plant.","correct":"✓ The lichen is a composite organism.","note":"'Lichenised' is an adjective. The noun form is 'lichen'."}],"priority":"★★☆"},"related_words":{"derivatives":["lichen (noun): 地衣類","lichenization (noun): 地衣類化","lichenology (noun): 地衣類学"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'lichenised' is a technical adjective used in biology, specifically in botany and mycology. It describes the state of a fungus that has formed a symbiotic relationship with an alga or cyanobacterium, resulting in a lichen. This term is typically encountered in scientific articles, textbooks, and specialized discussions related to ecology and plant biology. Understanding this term requires familiarity with symbiotic relationships and the characteristics of lichens."},"example_sentences":[{"sentence":"The **lichenised** fungus provides structural support for the alga.","translation":"地衣類化した菌類は藻類に構造的な支持を提供する。","type":"adjective","meaning_category":"descriptive"},{"sentence":"**Lichenised** communities are often the first colonizers of bare rock.","translation":"地衣類化した群落は、しばしば裸の岩の最初の定着者である。","type":"adjective","meaning_category":"ecological"},{"sentence":"The study focused on the diversity of **lichenised** species in the region.","translation":"その研究は、その地域の地衣類化種の多様性に焦点を当てた。","type":"adjective","meaning_category":"scientific"}]}