{"word":"cartisane","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(archaic) A courtesan; a prostitute.","english_definition":"(archaic) A prostitute, especially one with wealthy or upper-class clients.","examples":[{"sentence":"In the 18th century, a cartisane might have been a woman of considerable influence.","translation":"18世紀において、カルティザンはかなりの影響力を持つ女性であったかもしれない。"},{"sentence":"The novel depicted the life of a cartisane in Paris.","translation":"その小説はパリのカルティザンの生活を描写していた。"}],"collocations":["famous cartisane","wealthy cartisane"],"synonyms":["courtesan","prostitute","harlot","whore"],"antonyms":[]}],"etymology":{"value":"From the French word 'courtisane,' which itself comes from the Italian 'cortigiana,' meaning 'courtier.' This refers to a woman associated with a royal court, but who was also a prostitute.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɑːrtɪzæn/","syllables":"car-ti-sane"},"inflection":{"noun_plural":"cartisanes"},"usage_notes":{"explanation":"'Cartisane' is an archaic term, rarely used in modern English. It specifically refers to a high-class prostitute or courtesan, often associated with wealthy or aristocratic clients. The term carries historical connotations, particularly related to 18th and 19th century European society.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was a cartisane selling flowers on the street.","correct":"✓ She was a flower seller on the street.","note":"A cartisane was not a common street seller, but a high-class prostitute."}],"priority":"★☆☆"},"related_words":{"derivatives":["courtisane (French spelling)"],"phrases":["demi-monde (the world of courtesans and kept women)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency - largely confined to historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cartisane' is a very rare and archaic word. It is unlikely to be encountered outside of historical novels or academic texts dealing with the history of prostitution or European social history. Understanding the term requires knowledge of historical social structures and the role of courtesans in past societies."},"example_sentences":[{"sentence":"The memoirs detailed the lavish lifestyle of a famous cartisane.","translation":"その回顧録は、ある有名なカルティザンの贅沢なライフスタイルを詳述していた。","type":"noun","meaning_category":"prostitute"},{"sentence":"Many cartisanes were known for their wit and intelligence.","translation":"多くのカルティザンは、その機知と知性で知られていた。","type":"noun","meaning_category":"prostitute"}]}