{"word":"microseismology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"微小地震学：微小地震や人工的な振動を研究する地震学の一分野","english_definition":"The branch of seismology concerned with the study of microseisms and artificial vibrations.","examples":[{"sentence":"Microseismology is used to study the Earth's crust and upper mantle.","translation":"微小地震学は、地球の地殻と上部マントルの研究に用いられる。"},{"sentence":"Researchers are using microseismology to monitor volcanic activity.","translation":"研究者たちは、微小地震学を用いて火山活動を監視している。"},{"sentence":"Microseismology can help in the detection of underground explosions.","translation":"微小地震学は、地下爆発の検出に役立つ。"}],"collocations":["study of microseisms (微小地震の研究)","monitoring volcanic activity (火山活動の監視)","detection of underground explosions (地下爆発の検出)","Earth's crust and upper mantle (地球の地殻と上部マントル)"],"synonyms":["seismology","geophysics"],"antonyms":[]}],"etymology":{"value":"\"micro-\"（小さい）+ \"seismology\"（地震学）から構成される。微小な地震現象を扱う学問であることを示す。","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪkroʊsaɪzˈmɒlədʒi/","syllables":"mi-cro-seis-mol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Microseismology focuses on subtle seismic signals, often generated by natural phenomena like ocean waves or human activities such as traffic and construction. These signals, though small, can provide valuable information about subsurface structures and processes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Microseismology is the study of large earthquakes.","correct":"✓ Microseismology is the study of small earthquakes and vibrations.","note":"Microseismology deals with microseisms, which are small, continuous vibrations, not large earthquakes."}],"priority":"★★☆"},"related_words":{"derivatives":["microseism (微小地震)","seismology (地震学)","seismograph (地震計)","seismic (地震の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Microseismology is a specialized field within seismology that focuses on the study of very small seismic events, often imperceptible to humans. It is used to analyze the structure of the Earth's subsurface and monitor various activities. The term is formed by combining \"micro-\" (small) with \"seismology\" (the study of earthquakes)."},"example_sentences":[{"sentence":"**Microseismology** helps in understanding the structure of the Earth's crust.","translation":"微小地震学は、地球の地殻の構造を理解するのに役立つ。","type":"general","meaning_category":"General"},{"sentence":"Scientists use **microseismology** to monitor volcanic activity and predict eruptions.","translation":"科学者たちは、微小地震学を用いて火山活動を監視し、噴火を予測する。","type":"application","meaning_category":"Application"},{"sentence":"The data from **microseismology** studies can be used to improve earthquake early warning systems.","translation":"微小地震学の研究からのデータは、地震早期警報システムを改善するために使用できる。","type":"research","meaning_category":"Research"}]}