{"word":"unlatinized","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not latinized; not made to conform to Latin forms or characteristics.","english_definition":"Not having been made Latin in form or character.","examples":[{"sentence":"The text remained unlatinized, retaining its original script.","translation":"そのテキストはラテン語化されず、元の文字を保持していた。"},{"sentence":"An unlatinized version of the name was preferred by the author.","translation":"その名前の非ラテン語化されたバージョンが著者によって好まれた。"}],"collocations":["unlatinized text","unlatinized name","unlatinized form"],"synonyms":["non-latinized","un-romanized"],"antonyms":["latinized","romanized"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'latinized', which is the past participle of 'latinize' (to make Latin in form or character).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈlætɪnaɪzd/","syllables":"un-lat-in-ized"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can form comparative and superlative degrees with 'more' and 'most' respectively (e.g., more unlatinized, most unlatinized)."},"usage_notes":{"explanation":"'Unlatinized' is used to describe something that has not been adapted or changed to fit Latin conventions, especially in language or naming. It often implies a deliberate choice to retain the original form or character.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unlatinized language was difficult to understand.","correct":"✓ The unlatinized text was difficult to understand.","note":"'Unlatinized' typically refers to the form of text or names, not the language itself. A language is either related to Latin or not, but the *form* of a written word can be changed to be more or less Latin-like."}],"priority":"★★☆"},"related_words":{"derivatives":["latinize","latinization","latin"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unlatinized' is a relatively uncommon word used in academic or specialized contexts, particularly when discussing linguistics, history, or cultural studies. It describes something that has not been adapted to conform to Latin forms or conventions. Understanding the root word 'latinized' is essential to grasping the meaning of 'unlatinized.'"},"example_sentences":[{"sentence":"The scholar argued for preserving the unlatinized spellings of certain place names.","translation":"その学者は、特定の地名の非ラテン語化された綴りを保存することを主張した。","type":"adjective","meaning_category":"Not latinized"},{"sentence":"The manuscript contained several unlatinized terms that required further research.","translation":"その原稿には、さらなる研究が必要な、いくつかの非ラテン語化された用語が含まれていた。","type":"adjective","meaning_category":"Not latinized"}]}