{"word":"Snoke","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Supreme Leader Snoke: A fictional character in the Star Wars franchise. He is a powerful figure in the First Order, a military and political organization inspired by the Galactic Empire.","english_definition":"A fictional character in the Star Wars franchise. He is a powerful figure in the First Order, a military and political organization inspired by the Galactic Empire.","examples":[{"sentence":"Supreme Leader Snoke was a mysterious figure in the Star Wars sequel trilogy.","translation":"最高指導者スノークは、スター・ウォーズの続三部作における謎めいた人物だった。"}],"collocations":["Supreme Leader Snoke","First Order","Star Wars"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Snoke' was created by the writers of the Star Wars sequel trilogy. Its etymology is not explicitly stated within the Star Wars canon, but it is speculated to evoke a sense of menace and power.","priority":"★☆☆"},"pronunciation":{"ipa":"/snoʊk/","syllables":"Snoke"},"inflection":{},"usage_notes":{"explanation":"'Snoke' is primarily used as a proper noun to refer to the specific character in the Star Wars universe. It does not have common usage outside of this context.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_characters":["Kylo Ren","General Hux","The First Order"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency outside of Star Wars contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Snoke' is a proper noun referring to a specific character in the Star Wars franchise. Understanding the character requires familiarity with the Star Wars universe. The name itself doesn't have inherent meaning outside of this context.","priority":"★★☆"},"example_sentences":[{"sentence":"Snoke commanded Kylo Ren to bring Rey to him.","translation":"スノークはカイロ・レンにレイを連れてくるように命じた。","type":"noun","meaning_category":"Character in Star Wars"},{"sentence":"The death of Snoke was a pivotal moment in The Last Jedi.","translation":"スノークの死は『最後のジェダイ』における重要な瞬間だった。","type":"noun","meaning_category":"Character in Star Wars"}]}