{"word":"exergues","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(貨幣、メダルなどの)下部余白部、銘文欄","english_definition":"The space on a coin or medal below the main design, often used for inscriptions.","examples":[{"sentence":"The mint mark is usually found in the exergue of the coin.","translation":"造幣局のマークは通常、コインの下部余白部に見られる。"},{"sentence":"The date of issue is inscribed in the exergue.","translation":"発行日は銘文欄に刻まれている。"}],"collocations":["coin exergue","medal exergue","inscribe in the exergue"],"synonyms":["field","ground","area"],"antonyms":[]}],"etymology":{"value":"From French *exergue*, from Ancient Greek *ἐξ* (ex, “out of”) + *ἔργον* (érgon, “work”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛksɜːrɡz/","syllables":"ex-er-gues"},"inflection":{"noun_plural":"exergues"},"usage_notes":{"explanation":"The term *exergue* is primarily used in numismatics (the study or collection of coins and medals). It refers to a specific area on a coin or medal, typically below the main image, where inscriptions like dates, mint marks, or other identifying information are placed. It's a relatively technical term not commonly used in everyday conversation.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The exergue of the painting was damaged.","correct":"✓ The lower part of the painting was damaged.","note":"*Exergue* specifically refers to coins and medals, not paintings or other artworks."}],"priority":"★☆☆"},"related_words":{"derivatives":["exergual (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word *exergues* is a specialized term primarily used in the field of numismatics (the study and collection of coins and medals). It refers to the area on a coin or medal located below the main design, often used for inscriptions such as dates or mint marks. Due to its technical nature and limited application, it is not a commonly encountered word and is typically used by experts or enthusiasts in the field. Understanding this term requires familiarity with numismatic terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The designer cleverly incorporated the artist's signature into the coin's exergue.","translation":"デザイナーは、アーティストのサインをコインの下部余白部に巧妙に組み込んだ。","type":"noun","meaning_category":"(貨幣、メダルなどの)下部余白部、銘文欄"},{"sentence":"The exergue provides valuable information about the coin's origin and date.","translation":"下部余白部には、コインの起源と日付に関する貴重な情報が記載されている。","type":"noun","meaning_category":"(貨幣、メダルなどの)下部余白部、銘文欄"}]}