{"word":"isogamy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"同形配偶 (どうけいはいぐう): 配偶子の形態的な区別がない有性生殖の一形態","english_definition":"A form of sexual reproduction involving gametes that are morphologically indistinguishable.","examples":[{"sentence":"Isogamy is common in some algae and fungi.","translation":"同形配偶は、一部の藻類や菌類で一般的である。"},{"sentence":"In isogamy, fusion occurs between gametes of similar size and appearance.","translation":"同形配偶では、大きさや外観が類似した配偶子間で融合が起こる。"}],"collocations":["exhibit isogamy","undergo isogamy","primitive isogamy"],"synonyms":["homogamy"],"antonyms":["anisogamy","oogamy"]},{"part_of_speech":"noun","definition":"(より広義には)形態的に区別できない配偶子による有性生殖","english_definition":"(More broadly) Sexual reproduction by means of gametes that are morphologically indistinguishable.","examples":[{"sentence":"The evolution of anisogamy from isogamy is a major transition in sexual reproduction.","translation":"同形配偶から異形配偶への進化は、有性生殖における大きな転換期である。"}],"collocations":["evolution of isogamy","origin of isogamy"],"synonyms":[],"antonyms":["anisogamy"]}],"etymology":{"value":"Derived from the Greek words 'isos' (equal) and 'gamos' (marriage).","priority":"★★★"},"pronunciation":{"ipa":"/aɪˈsɒɡəmi/","syllables":"i-sog-a-my"},"inflection":{"noun_plural":"isogamies"},"usage_notes":{"explanation":"Isogamy refers to sexual reproduction where the gametes (sex cells) that fuse are similar in size and shape. This is in contrast to anisogamy (or heterogamy) where gametes differ in size (e.g., egg and sperm). Isogamy is considered a more primitive form of sexual reproduction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Isogamy involves the fusion of sperm and egg.","correct":"Isogamy involves the fusion of similar gametes.","note":"Isogamy does not involve sperm and egg, as these are characteristic of anisogamy. Isogamy involves gametes that are morphologically indistinguishable."}],"priority":"★★☆"},"related_words":{"derivatives":["isogamous (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Isogamy' is a technical term used in biology to describe a specific type of sexual reproduction. It's not commonly used outside of scientific contexts. Understanding requires knowledge of basic reproductive biology.","priority":"★★☆"},"example_sentences":[{"sentence":"Certain species of green algae reproduce through isogamy.","translation":"ある種の緑藻は同形配偶によって繁殖する。","type":"general","meaning_category":"同形配偶"},{"sentence":"The transition from isogamy to anisogamy is thought to have increased reproductive efficiency.","translation":"同形配偶から異形配偶への移行は、生殖効率を高めたと考えられている。","type":"evolutionary biology","meaning_category":"同形配偶"}]}