{"word":"descompromiso","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Lack of commitment; detachment; disengagement.","english_definition":"The state of not being committed or engaged; a lack of obligation or responsibility.","examples":[{"sentence":"Su descompromiso con la causa era evidente.","translation":"His lack of commitment to the cause was evident."},{"sentence":"El descompromiso de los jóvenes con la política es un problema creciente.","translation":"The disengagement of young people with politics is a growing problem."}],"collocations":["mostrar descompromiso (to show a lack of commitment)","sentir descompromiso (to feel disengaged)","actitud de descompromiso (an attitude of detachment)"],"synonyms":["indiferencia (indifference)","desapego (detachment)","falta de compromiso (lack of commitment)","negligencia (negligence)"],"antonyms":["compromiso (commitment)","dedicación (dedication)","interés (interest)","responsabilidad (responsibility)"]}],"etymology":{"value":"Formed by adding the prefix 'des-' (meaning 'lack of' or 'opposite of') to the word 'compromiso' (commitment).","priority":"N/A"},"pronunciation":{"ipa":"/des.kom.pɾoˈmi.so/","syllables":"des-com-pro-mi-so"},"inflection":{"noun_gender":"masculine","noun_plural":"descompromisos"},"usage_notes":{"explanation":"The term 'descompromiso' generally refers to a lack of emotional, social, or ethical commitment. It can describe a personal attitude or a broader social trend.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"El descompromiso es bueno en todas las situaciones.","correct":"El descompromiso puede ser perjudicial en muchas situaciones.","note":"While detachment can be beneficial in some contexts, it's generally understood that a lack of commitment has negative consequences in most situations."}],"priority":"N/A"},"related_words":{"derivatives":["descomprometer (to disengage, to release from a commitment)"],"phrases":["actitud de descompromiso (attitude of disengagement)"]},"level_frequency":{"CEFR":"B2-C1","frequency_google_ngram":"Moderate","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Descompromiso' refers to a lack of commitment or engagement, whether in personal relationships, social causes, or professional endeavors. It is often used in discussions about societal issues, such as political apathy or lack of civic engagement. The word carries a slightly negative connotation, implying a failure to fulfill expected responsibilities or obligations."},"example_sentences":[{"sentence":"El descompromiso de muchos ciudadanos con el proceso electoral es preocupante.","translation":"The disengagement of many citizens with the electoral process is concerning.","type":"noun","meaning_category":"Lack of commitment"},{"sentence":"El descompromiso emocional puede dañar una relación de pareja.","translation":"Emotional detachment can harm a romantic relationship.","type":"noun","meaning_category":"Detachment"}]}