{"word":"pawner","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"質入れする人、質屋に物を持ち込む人","english_definition":"A person who pledges or pawns an item as security for a loan.","examples":[{"sentence":"The pawner hoped to reclaim his watch once he had the money.","translation":"その質入れ人は、お金ができたら自分の時計を取り戻したいと願っていた。"},{"sentence":"Many pawnshops rely on pawners who need quick cash.","translation":"多くの質屋は、すぐに現金が必要な質入れ人に頼っている。"}],"collocations":["reclaim an item from the pawner (質入れ人から品物を取り戻す)","a frequent pawner (頻繁に質入れをする人)"],"synonyms":["pledger","depositor"],"antonyms":["pawnbroker","lender"]}],"etymology":{"value":"The word \"pawner\" is derived from the verb \"pawn,\" which comes from the Old French word \"pan,\" meaning \"pledge\" or \"security.\" The \"-er\" suffix indicates a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɔːnər/","syllables":"paw-ner"},"inflection":{"noun_plural":"pawners"},"usage_notes":{"explanation":"A \"pawner\" is the individual who brings an item to a pawnshop to obtain a loan. The item serves as collateral, and the pawner has the option to reclaim it by repaying the loan plus interest within a specified period. If the pawner fails to repay, the pawnbroker can sell the item to recover the loan amount.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pawner lent money to the shop.","correct":"✓ The pawner borrowed money from the shop.","note":"The pawner borrows money, while the pawnbroker lends it."},{"incorrect":"✗ The pawner bought items at the pawnshop.","correct":"✓ The pawner sold items at the pawnshop (as collateral). / ✓ The pawner pawned items at the pawnshop.","note":"The pawner brings items to the pawnshop to pawn them, not to buy them."}],"priority":"★★☆"},"related_words":{"derivatives":["pawn (noun, verb)","pawnshop (noun)","pawnable (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"pawner\" refers to the person who brings an item to a pawnshop to secure a loan. This is a relatively specialized term, primarily used in the context of pawnshops and financial transactions involving collateral. The pawner receives money from the pawnbroker in exchange for temporarily surrendering possession of the item, with the understanding that they can reclaim it by repaying the loan plus interest. Understanding this term requires familiarity with the concept of pawning and the role of pawnshops in providing short-term loans. It's not a commonly used word in everyday conversation but is relevant in discussions about finance, economics, or legal matters related to personal property.","example_sentences":[]},"example_sentences":[{"sentence":"The **pawner** carefully placed the antique guitar on the counter.","translation":"その質入れ人は、アンティークのギターを慎重にカウンターに置いた。","type":"noun","meaning_category":"質入れする人"},{"sentence":"As a **pawner**, he understood the risk of losing his valuables if he couldn't repay the loan.","translation":"質入れする人として、彼はローンを返済できなければ貴重品を失うリスクを理解していた。","type":"noun","meaning_category":"質入れする人"}]}