{"word":"allotropic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"同素体の、同素変態の","english_definition":"relating to or exhibiting allotropy.","examples":[{"sentence":"Diamond and graphite are allotropic forms of carbon.","translation":"ダイヤモンドとグラファイトは炭素の同素体です。"},{"sentence":"Oxygen and ozone are allotropic forms of the same element.","translation":"酸素とオゾンは同じ元素の同素体です。"}],"collocations":["allotropic form","allotropic modification","allotropic transformation"],"synonyms":["polymorphic"],"antonyms":[]}],"etymology":{"value":"From allo- (other, different) + tropic (turning, changing). The term refers to the ability of an element to exist in different forms.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæləˈtrɒpɪk/","syllables":"al-lo-trop-ic"},"inflection":{"notes":"This word does not have different inflections."},"usage_notes":{"explanation":"'Allotropic' describes the property of some chemical elements to exist in two or more different forms, known as allotropes, in the same physical state. These allotropes have different physical properties and chemical behaviors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The allotropic element changed color.","correct":"The allotropic form of the element changed color.","note":"It's more accurate to say the 'allotropic form' changes, not the element itself."}],"priority":"★★☆"},"related_words":{"derivatives":["allotropy (noun): the property of existing in allotropic forms"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'allotropic' is a scientific term used in chemistry and materials science. It describes the property of an element to exist in multiple forms with different physical properties. Understanding this term requires a background in chemistry."},"example_sentences":[{"sentence":"Sulfur exhibits several allotropic forms, including rhombic and monoclinic sulfur.","translation":"硫黄は、斜方硫黄や単斜硫黄など、いくつかの同素体を示します。","type":"adjective","meaning_category":"同素体の"},{"sentence":"The allotropic transformation of iron is important in steelmaking.","translation":"鉄の同素変態は、製鋼において重要です。","type":"adjective","meaning_category":"同素変態の"}]}