{"word":"granophyre","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"花崗斑岩（かこうはんがん）: 石英と長石が微晶質基質中に斑状晶として存在する火成岩","english_definition":"A volcanic rock with a porphyritic texture, containing phenocrysts of quartz and feldspar in a fine-grained groundmass.","examples":[{"sentence":"The granophyre showed a characteristic intergrowth of quartz and feldspar.","translation":"その花崗斑岩は石英と長石の独特な共生組織を示した。"},{"sentence":"Granophyre is often associated with shallow intrusions.","translation":"花崗斑岩はしばしば浅い貫入岩体に伴って産出する。"}],"collocations":["granophyre texture (花崗斑状組織)","quartz granophyre (石英花崗斑岩)"],"synonyms":["rhyolite","felsite"],"antonyms":[]}],"etymology":{"value":"\"grano-\" (花崗岩状の組織を示す接頭辞) + \"-phyre\" (斑岩)に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡrænəˌfaɪər/","syllables":"gra-no-phyre"},"inflection":{"noun_plural":"granophyres"},"usage_notes":{"explanation":"Granophyre is a type of igneous rock characterized by its porphyritic texture, where larger crystals (phenocrysts) of quartz and feldspar are embedded in a fine-grained matrix (groundmass). This texture is often the result of two stages of cooling: slow cooling at depth, which allows larger crystals to form, followed by rapid cooling near the surface, which results in the fine-grained groundmass. Granophyres are often associated with shallow intrusions and volcanic activity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The granophyre is a sedimentary rock.","correct":"✓ The granophyre is an igneous rock.","note":"Granophyre is an igneous rock, not a sedimentary rock."},{"incorrect":"✗ Granophyre only contains quartz.","correct":"✓ Granophyre contains quartz and feldspar.","note":"Granophyre contains both quartz and feldspar phenocrysts."}],"priority":"★☆☆"},"related_words":{"derivatives":["granitic (花崗岩質の)","porphyritic (斑状組織の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 地質学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Granophyre\" is a specialized geological term referring to a type of igneous rock. It is characterized by a specific texture called granophyric texture, where larger crystals (phenocrysts) of quartz and feldspar are embedded in a fine-grained groundmass. This texture indicates a specific cooling history. The term is primarily used in geology and related fields.","priority":"★☆☆"},"example_sentences":[{"sentence":"The geologist identified the rock sample as granophyre based on its texture.","translation":"地質学者は岩石標本の組織から、それが花崗斑岩であると特定した。","type":"noun","meaning_category":"岩石の種類"},{"sentence":"The granophyre intrusion altered the surrounding sedimentary rocks.","translation":"その花崗斑岩の貫入は周囲の堆積岩を変質させた。","type":"noun","meaning_category":"岩石の種類"}]}