{"word":"toddyize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"トディ（ヤシ酒）にする、またはトディを加える","english_definition":"To convert (something) into toddy, or to add toddy to (something).","examples":[{"sentence":"They toddyized the fruit punch for a stronger flavor.","translation":"彼らはフルーツポンチにトディを加えて風味を強くした。"},{"sentence":"The local villagers toddyize the palm sap to make a traditional drink.","translation":"地元の村人たちはヤシの樹液をトディにして伝統的な飲み物を作る。"}],"collocations":["toddyize palm sap (ヤシの樹液をトディにする)","toddyize fruit punch (フルーツポンチにトディを加える)"],"synonyms":["ferment","infuse with toddy"],"antonyms":[]}],"etymology":{"value":"\"toddy\" + \"-ize\".","priority":"★★★"},"pronunciation":{"ipa":"ˈtɒdiˌaɪz","syllables":"tod-dy-ize"},"inflection":{"verb_forms":{"present_simple":["toddyize","toddyizes"],"past_simple":"toddyized","past_participle":"toddyized","present_participle":"toddyizing"}},"usage_notes":{"explanation":"\"Toddyize\" is a relatively rare verb that means to convert something into toddy, which is a type of alcoholic drink made from palm sap, or to add toddy to something. It is often used in contexts related to traditional drinks or local customs in regions where toddy is produced.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I toddyized the water.","correct":"✓ I added toddy to the water.","note":"It is more natural to say \"add toddy to\" rather than \"toddyize\" when referring to adding toddy to a liquid like water, unless you are specifically referring to the process of fermentation to create toddy."}],"priority":"★★☆"},"related_words":{"derivatives":["toddy (noun): an alcoholic drink made from the sap of palm trees"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word \"toddyize\" is a niche term related to the process of making or adding toddy, a type of alcoholic beverage. Due to its specificity and limited usage, it is not commonly encountered in general English language contexts. Understanding the term requires familiarity with the concept of toddy and the process of fermentation or infusion. Therefore, it is more likely to be found in specialized texts or discussions related to regional drinks or cultural practices."},"example_sentences":[{"sentence":"They experimented with different fruits to toddyize, creating unique flavors.","translation":"彼らは様々な果物をトディ化する実験を行い、独特の風味を生み出した。","type":"verb","meaning_category":"トディにする"},{"sentence":"The chef decided to toddyize the dessert sauce for an exotic twist.","translation":"シェフはエキゾチックな風味を出すために、デザートソースにトディを加えることにした。","type":"verb","meaning_category":"トディを加える"}]}