{"word":"repraised","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"re-praise の過去形・過去分詞。再び褒める、再評価する。","english_definition":"Past tense and past participle of 're-praise'. To praise again; to re-evaluate something in a positive light.","examples":[{"sentence":"The artist's early works were initially criticized, but they have since been repraised by art historians.","translation":"その芸術家の初期の作品は当初批判されたが、その後、美術史家によって再評価された。"},{"sentence":"After further consideration, the manager repraised the employee's performance and gave them a higher rating.","translation":"さらに検討した結果、マネージャーは従業員のパフォーマンスを再評価し、より高い評価を与えた。"}],"collocations":["be repraised by","repraise someone's work"],"synonyms":["re-evaluate","reassess","reconsider","commend again"],"antonyms":["criticize","condemn","denounce"]}],"etymology":{"value":"'re-' (再び) + 'praise' (褒める)","priority":"★★★"},"pronunciation":{"ipa":"/riːˈpreɪzd/","syllables":"re-praised"},"inflection":{"verb_forms":{"present_simple":["repraise","repraises"],"past_simple":"repraised","past_participle":"repraised","present_participle":"repraising"}},"usage_notes":{"explanation":"'Repraised' is the past tense and past participle of the verb 'repraise,' which means to praise again or to re-evaluate something or someone in a positive way after a previous negative or neutral assessment. It suggests a change in perspective or new information that leads to a more favorable judgment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The song was repraised for its originality.","correct":"✓ The song was repraised because of its originality.","note":"'Repraised' requires a reason or cause for the re-evaluation. Using 'for' is grammatically incorrect in this context; 'because of' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["repraise (verb)","repraising (present participle)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Repraised' is a relatively uncommon word, meaning to praise again or to re-evaluate something positively after a previous negative or neutral assessment. It implies a change in perspective or new information that leads to a more favorable judgment. It is often used in academic or professional contexts when discussing the reassessment of art, performance, or ideas."},"example_sentences":[{"sentence":"The film, initially panned by critics, was later repraised for its innovative storytelling.","translation":"その映画は、当初批評家から酷評されたが、後にその革新的なストーリーテリングが再評価された。","type":"verb","meaning_category":"re-evaluate"},{"sentence":"Her contributions to the project were repraised after the team realized the impact of her work.","translation":"彼女の仕事の影響をチームが認識した後、プロジェクトへの彼女の貢献は再評価された。","type":"verb","meaning_category":"praise again"}]}