{"word":"cohesibility","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"凝集性、結合性、粘着性","english_definition":"The quality or state of being cohesible; the ability to stick together or cohere.","examples":[{"sentence":"The cohesibility of the clay made it easy to mold.","translation":"その粘土の凝集性のおかげで、成形が容易だった。"},{"sentence":"The cohesibility of the soil is important for preventing erosion.","translation":"土壌の凝集性は、侵食を防ぐために重要である。"},{"sentence":"The cohesibility of the paint ensures a smooth finish.","translation":"その塗料の粘着性により、滑らかな仕上がりが保証される。"}],"collocations":["high cohesibility","low cohesibility","soil cohesibility","material cohesibility"],"synonyms":["cohesion","adhesiveness","stickiness","tenacity","bondability"],"antonyms":["friability","separability","divisibility"]}],"etymology":{"value":"Derived from the word 'cohesible,' which comes from 'cohere' (to stick together) + '-ible' (capable of being).","priority":"★★☆"},"pronunciation":{"ipa":"/koʊˌhiːzəˈbɪləti/","syllables":"co-he-si-bi-li-ty"},"inflection":{"noun_plural":"cohesibilities"},"usage_notes":{"explanation":"'Cohesibility' refers to the degree to which a substance or material is capable of sticking together or forming a unified mass. It is often used in scientific and technical contexts to describe the properties of materials like clay, soil, paint, and adhesives.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cohesibility of the team was low, so they didn't work well together.","correct":"✓ The cohesion of the team was low, so they didn't work well together.","note":"'Cohesibility' refers to the physical property of a substance, while 'cohesion' refers to the unity or bond within a group. Use 'cohesion' when referring to a group of people working together."},{"incorrect":"✗ The cohesibility of the glue was not very good, it fell apart.","correct":"✓ The adhesiveness of the glue was not very good, it fell apart.","note":"While 'cohesibility' refers to the ability of a substance to stick to itself, 'adhesiveness' refers to the ability of a substance to stick to other things. Use 'adhesiveness' when referring to glue sticking to other surfaces."}],"priority":"★★☆"},"related_words":{"derivatives":["cohesible","cohesion","cohesive","coherently"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cohesibility' is a technical term used to describe the ability of a substance to stick together. It's often used in scientific or engineering contexts when discussing the properties of materials. It's not a commonly used word in everyday conversation, so it's more likely to be encountered in specialized texts or discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The high cohesibility of the polymer allowed it to form a strong, flexible film.","translation":"そのポリマーの高い凝集性により、強くて柔軟なフィルムを形成することができた。","type":"general","meaning_category":"凝集性"},{"sentence":"The cohesibility of the soil particles is crucial for maintaining slope stability.","translation":"土壌粒子の凝集性は、斜面の安定性を維持するために重要である。","type":"technical","meaning_category":"結合性"},{"sentence":"The cohesibility of the adhesive ensures that the parts remain firmly bonded.","translation":"その接着剤の粘着性により、部品がしっかりと接着された状態を維持できる。","type":"technical","meaning_category":"粘着性"}]}