{"word":"Hyraceum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ケープハイラックスの化石化した排泄物で、香水や伝統医学で使用される","english_definition":"The fossilized excrement of the Cape hyrax, used in perfumes and traditional medicine.","examples":[{"sentence":"Hyraceum is a valuable ingredient in some perfumes for its unique scent.","translation":"ハイラセウムは、その独特の香りのために、一部の香水において貴重な成分です。"},{"sentence":"Traditional healers in Africa sometimes use hyraceum for its purported medicinal properties.","translation":"アフリカの伝統的な治療師は、ハイラセウムが持つとされる薬効のために使用することがあります。"}],"collocations":["use of hyraceum","hyraceum in perfumes","traditional use of hyraceum"],"synonyms":["dassie dung","africa stone"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name *Hyrax* (referring to the animal) and the suffix *-eum* (often used to denote a substance or material).","priority":"★★☆"},"pronunciation":{"ipa":"/haɪˈreɪsiəm/","syllables":"hy-ra-ce-um"},"inflection":{"noun_plural":"hyraceums"},"usage_notes":{"explanation":"Hyraceum is a relatively rare and specialized term. It refers specifically to the fossilized excrement of the Cape hyrax, an animal native to Africa. Its use is primarily limited to discussions of perfumery, traditional medicine, or zoology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found some hyraceum in my backyard.","correct":"✓ I found some unusual droppings in my backyard.","note":"Hyraceum is a specific substance found in certain regions of Africa, not a common occurrence. It's unlikely to be found in a typical backyard."}],"priority":"★☆☆"},"related_words":{"derivatives":["Hyrax (genus name)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very specialized vocabulary)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Hyraceum is a highly specialized term primarily encountered in contexts related to perfumery, traditional African medicine, or zoological studies of the Cape hyrax. Due to its limited usage, it is not part of general vocabulary and is unlikely to be understood without specific knowledge of these fields. Understanding requires familiarity with scientific nomenclature and niche cultural practices."},"example_sentences":[{"sentence":"The perfume contained a hint of hyraceum, adding a complex animalic note.","translation":"その香水にはハイラセウムのほのかな香りが含まれており、複雑な動物的な香りを加えていました。","type":"noun","meaning_category":"perfumery"},{"sentence":"Some believe that hyraceum has healing properties when used in traditional medicine.","translation":"ハイラセウムは伝統医学で使用すると治癒特性があると信じられています。","type":"noun","meaning_category":"traditional medicine"}]}