{"word":"citationist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(通常、軽蔑的に)他人の言葉や考えを過度に引用することに頼る人、または引用を盲目的に受け入れる人","english_definition":"(usually derogatory) a person who relies excessively on citations of the words or thoughts of others, or who accepts citations uncritically.","examples":[{"sentence":"The professor was criticized for being a citationist, relying too heavily on the works of others without offering original analysis.","translation":"その教授は、独自の分析を提供せずに他者の著作に頼りすぎて、引用主義者であると批判された。"},{"sentence":"Some argue that modern academic writing has become overly citationist, prioritizing the appearance of scholarship over genuine insight.","translation":"現代の学術論文は過度に引用主義的になり、真の洞察よりも学問の外観を優先していると主張する人もいる。"}],"collocations":["overly citationist","become citationist","citationist approach","citationist tendencies"],"synonyms":["quotationist","bibliolater","pedant (sometimes, depending on context)"],"antonyms":["original thinker","innovator","independent scholar"],"notes":"The term often carries a negative connotation, suggesting a lack of originality or critical thinking."}],"etymology":{"value":"The word is formed by combining 'citation' (the act of quoting or referring to a source) with the suffix '-ist' (denoting a person who practices or is devoted to something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsaɪteɪˈʃənɪst/","syllables":"ci-ta-tion-ist"},"inflection":{"noun_plural":"citationists"},"usage_notes":{"explanation":"'Citationist' is typically used to describe someone whose arguments or writings are heavily dependent on the citations of others, often to the point where their own original thought is obscured. It can also refer to someone who accepts cited information without questioning its validity or relevance. The term is most often found in academic or intellectual contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good citationist because he always remembers to cite his sources.","correct":"✓ He is meticulous about citing his sources.","note":"While proper citation is important, 'citationist' implies excessive or uncritical reliance on citations, not simply good citation practices."}],"priority":"★☆☆"},"related_words":{"derivatives":["citation (noun)","cite (verb)"],"related_terms":["bibliolatry (excessive reverence for books)","textualism (strict adherence to the literal text)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The word is relatively uncommon, primarily used in academic or critical discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'citationist' describes someone who relies too much on quoting other people's work instead of coming up with their own ideas. It's often used in a negative way to suggest that someone isn't very original or doesn't think for themselves. You'll mostly find this word in discussions about academic writing or intellectual debates."},"example_sentences":[{"sentence":"The reviewer criticized the book for being overly **citationist**, lacking original insights.","translation":"レビュー担当者は、その本がオリジナルの洞察に欠け、過度に引用主義的であると批判した。","type":"noun","meaning_category":"relying excessively on citations"},{"sentence":"He accused his opponent of being a **citationist**, merely repeating arguments made by others.","translation":"彼は対戦相手を、他者の主張を繰り返すだけの引用主義者だと非難した。","type":"noun","meaning_category":"uncritically accepting citations"}]}