{"word":"Flamandization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ベルギーにおける)フラマン語化、フラマン化政策、フラマン語の影響","english_definition":"The process or policy of promoting the Flemish language and culture, especially in Belgium; the influence of the Flemish language.","examples":[{"sentence":"The Flamandization of Brussels is a contentious issue.","translation":"ブリュッセルのフラマン語化は議論の的となっている。"},{"sentence":"Some argue that Flamandization threatens the French-speaking community.","translation":"フラマン語化はフランス語を話すコミュニティを脅かすと主張する人もいる。"}],"collocations":["process of Flamandization","policy of Flamandization","cultural Flamandization"],"synonyms":["Flemishification"],"antonyms":[]}],"etymology":{"value":"Derived from 'Flanders' (the region in Belgium where Flemish is spoken) and the suffix '-ization' (the process of becoming).","priority":"★★★"},"pronunciation":{"ipa":"/ˌflæmənˈdaɪˈzeɪʃən/","syllables":"Flam-an-di-za-tion"},"inflection":{"noun_plural":"Flamandizations"},"usage_notes":{"explanation":"'Flamandization' refers specifically to the promotion or imposition of Flemish language and culture, often within a context where other languages (particularly French) are also present. It is most commonly used in discussions about Belgian politics and society.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Flemish (adjective, noun)","Flanders (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Flamandization' is a specialized term primarily used in the context of Belgian politics and language policy. It refers to the process of promoting the Flemish language and culture, often in areas where French is also spoken. Understanding this term requires familiarity with the linguistic and political landscape of Belgium."},"example_sentences":[{"sentence":"The debate over the Flamandization of the university continues.","translation":"大学のフラマン語化をめぐる議論は続いている。","type":"noun","meaning_category":"フラマン語化政策"},{"sentence":"The city's bilingual signs are a response to increasing Flamandization.","translation":"市の二言語標識は、フラマン語化の進展に対応したものである。","type":"noun","meaning_category":"フラマン語の影響"}]}