{"word":"underfeeder","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(人または動物に対して)十分な食事を与えない人、または動物","english_definition":"A person or animal that does not provide enough food to another person or animal.","examples":[{"sentence":"The farmer was accused of being an underfeeder because his animals were underweight.","translation":"その農家は、動物たちが体重不足だったため、十分な食事を与えていないと非難された。"},{"sentence":"She was labeled an underfeeder by her family because she didn't give her child enough to eat.","translation":"彼女は子供に十分な食事を与えなかったため、家族から十分な食事を与えない人だとみなされた。"}],"collocations":["child underfeeder","animal underfeeder"],"synonyms":["negligent feeder","inadequate provider"],"antonyms":["overfeeder","generous provider"]},{"part_of_speech":"noun","definition":"(機械工学)下部供給装置","english_definition":"A mechanical device that feeds material from below.","examples":[{"sentence":"This machine uses an underfeeder to supply coal to the furnace.","translation":"この機械は、下部供給装置を使用して石炭を炉に供給する。"}],"collocations":["coal underfeeder","material underfeeder"],"synonyms":["bottom feeder"],"antonyms":["top feeder"]}],"etymology":{"value":"The word \"underfeeder\" is formed by combining the prefix \"under-\" meaning \"not enough\" or \"below,\" with the noun \"feeder,\" which refers to someone or something that provides food or material.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌndərˌfiːdər/","syllables":"un-der-feed-er"},"inflection":{"noun_plural":"underfeeders"},"usage_notes":{"explanation":"The term \"underfeeder\" can have both literal and technical meanings. Literally, it describes someone who doesn't provide adequate nourishment. In a technical context, particularly in engineering, it refers to a mechanism that supplies material from underneath. The context usually clarifies the intended meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The underfeeder was very hungry.","correct":"✓ The underfed animal was very hungry.","note":"\"Underfeeder\" is the person or thing doing the feeding, not the one being fed. Use \"underfed\" to describe the state of being insufficiently fed."}],"priority":"★★☆"},"related_words":{"derivatives":["underfeed (verb)","underfed (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'underfeeder' is relatively uncommon. Its meaning is generally clear from its components: 'under-' implying insufficient or below, and 'feeder' referring to someone or something that provides nourishment or supplies material. It can be used in contexts relating to neglectful care or in technical descriptions of machinery. Understanding the context is key to interpreting its intended meaning."},"example_sentences":[{"sentence":"The neglected puppies were clearly victims of an **underfeeder**.","translation":"そのネグレクトされた子犬たちは明らかに、十分な食事を与えない人の犠牲者だった。","type":"noun","meaning_category":"Insufficient food provider"},{"sentence":"The automated system used an **underfeeder** to ensure a consistent supply of components.","translation":"その自動化システムは、部品の安定供給を確保するために下部供給装置を使用した。","type":"noun","meaning_category":"Mechanical device"}]}