{"word":"camagon","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A type of walking stick or staff made from a tough, dark wood, traditionally from the Philippines.","english_definition":"A walking stick or staff made of a hard, dark wood, originally from the Philippines.","examples":[{"sentence":"He carried a camagon on his hikes through the mountains.","translation":"彼は山をハイキングする際、カマゴン（材の杖）を携行していた。"},{"sentence":"The antique shop had a beautiful camagon with intricate carvings.","translation":"その骨董品店には、複雑な彫刻が施された美しいカマゴン（材の杖）があった。"}],"collocations":["carry a camagon","antique camagon","wooden camagon"],"synonyms":["walking stick","staff","cane"],"antonyms":[]}],"etymology":{"value":"Derived from the Tagalog word 'kamagong', referring to the ebony tree (Diospyros discolor) from which the wood is sourced.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈmɑːɡɒn/","syllables":"ca-ma-gon"},"inflection":{"noun_plural":"camagons"},"usage_notes":{"explanation":"The term 'camagon' specifically refers to walking sticks or staffs made from the wood of the kamagong tree. The wood is known for its hardness, durability, and dark color, making it ideal for such purposes. It's often associated with traditional Filipino culture and craftsmanship.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a camagon wood to build the house.","correct":"✓ He used kamagong wood to build the house.","note":"When referring to the wood itself, use 'kamagong wood'. 'Camagon' specifically refers to the walking stick or staff made from this wood."}],"priority":"★☆☆"},"related_words":{"derivatives":["kamagong (Tagalog word for the ebony tree)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Camagon' is a relatively rare word, primarily used in historical or cultural contexts related to the Philippines. It refers to a specific type of walking stick made from a particular type of dark, hard wood. Understanding this word requires familiarity with Filipino culture or historical artifacts."},"example_sentences":[{"sentence":"The old gentleman leaned heavily on his camagon as he walked.","translation":"その老紳士は歩くとき、カマゴン（材の杖）に大きく寄りかかっていた。","type":"noun","meaning_category":"walking stick"},{"sentence":"Camagons were prized for their strength and elegant appearance.","translation":"カマゴン（材の杖）は、その強度と優雅な外観で珍重されていた。","type":"noun","meaning_category":"walking stick"}]}