{"word":"Pro-Emersonian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"エマソン主義を支持する、エマソン主義的な","english_definition":"Supporting or relating to Emersonianism, the philosophy of Ralph Waldo Emerson.","examples":[{"sentence":"The author's later works show a pro-Emersonian stance, emphasizing individualism and self-reliance.","translation":"その作家の後の作品は、個人主義と自立を強調し、エマソン主義を支持する立場を示している。"}],"collocations":["pro-Emersonian ideals","pro-Emersonian philosophy","pro-Emersonian views"],"synonyms":["Emersonian","Transcendentalist"],"antonyms":["Anti-Emersonian"],"notes":"This term is used to describe someone or something that aligns with the philosophical and literary ideas of Ralph Waldo Emerson, particularly his emphasis on individualism, nature, and self-reliance."}],"etymology":{"value":"Formed by combining the prefix 'pro-' (meaning 'supporting' or 'in favor of') with 'Emersonian' (relating to Ralph Waldo Emerson or his philosophy).","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊ ɪˈmɜːrsəniən/","syllables":"Pro-E-mer-so-ni-an"},"inflection":{"notes":"Since it is an adjective, it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"'Pro-Emersonian' is used in academic or literary contexts to describe a viewpoint, work, or person that is sympathetic to or promotes the ideas of Ralph Waldo Emerson. It is relatively uncommon in general usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pro-Emersonian, so he dislikes nature.","correct":"✓ He is a pro-Emersonian, so he appreciates nature.","note":"Pro-Emersonians typically value nature, not dislike it."}],"priority":"★★☆"},"related_words":{"derivatives":["Emersonian","Emersonianism"],"related_terms":["Transcendentalism","Ralph Waldo Emerson","individualism","self-reliance","nature"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pro-Emersonian' is a specialized term primarily used in literary and philosophical discussions. Understanding requires familiarity with Ralph Waldo Emerson and Transcendentalism. The term is not commonly encountered outside of academic contexts."},"example_sentences":[{"sentence":"The essay presents a pro-Emersonian interpretation of Thoreau's work.","translation":"そのエッセイは、ソローの作品をエマソン主義的に解釈している。","type":"adjective","meaning_category":"supporting Emersonianism"},{"sentence":"Her pro-Emersonian beliefs influenced her decision to live off the grid.","translation":"彼女のエマソン主義的な信念は、社会から離れて暮らすという彼女の決断に影響を与えた。","type":"adjective","meaning_category":"supporting Emersonianism"}]}