{"word":"Smugglery","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"密輸、密輸行為","english_definition":"The act or practice of smuggling.","examples":[{"sentence":"The authorities were cracking down on smugglery along the coast.","translation":"当局は沿岸地域での密輸行為の取り締まりを強化していた。"},{"sentence":"He was involved in smugglery of precious stones.","translation":"彼は宝石の密輸に関与していた。"}],"collocations":["drug smugglery (麻薬密輸)","arms smugglery (武器密輸)","border smugglery (国境での密輸)"],"synonyms":["smuggling","contraband trade","bootlegging"],"antonyms":["legal trade","lawful commerce"]}],"etymology":{"value":"\"Smugglery\" is derived from \"smuggle,\" which originated in the 17th century. Its exact origins are uncertain, but it is thought to be related to Low German or Dutch words meaning 'to sneak' or 'to transport secretly.' The suffix \"-ery\" is added to form a noun indicating the practice or activity of smuggling.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsmʌɡləri/","syllables":"smug-gle-ry"},"inflection":{"noun_plural":"smuggeries"},"usage_notes":{"explanation":"\"Smugglery\" is a noun that refers to the practice or activity of smuggling, which involves illegally importing or exporting goods. It is less commonly used than the word \"smuggling,\" but it provides a more specific term for the overall operation or business of illegal trade.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The smugglery was caught by the police.","correct":"✓ The smugglers were caught by the police.","note":"\"Smugglery\" refers to the act, not the people involved. Use \"smugglers\" to refer to the people who engage in smuggling."},{"incorrect":"✗ He did a smugglery.","correct":"✓ He committed smugglery. / ✓ He engaged in smugglery.","note":"Use verbs like \"commit\" or \"engage in\" with \"smugglery\" to describe the action."}],"priority":"★★☆"},"related_words":{"derivatives":["smuggle (verb: 密輸する)","smuggler (noun: 密輸業者)","smuggled (adjective: 密輸された)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈や歴史的な記述で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Smugglery\" is a relatively uncommon word that refers to the practice or activity of smuggling goods illegally. It is a noun that describes the overall operation or business of illegal trade, rather than a specific instance of smuggling. This word is typically found in formal or historical contexts when discussing the organized crime of smuggling.","priority":"★★☆"},"example_sentences":[{"sentence":"The old port town was notorious for its history of smugglery.","translation":"その古い港町は、密輸の歴史で悪名高かった。","type":"noun","meaning_category":"密輸行為"},{"sentence":"The government implemented stricter measures to combat smugglery.","translation":"政府は密輸を取り締まるため、より厳格な措置を実施した。","type":"noun","meaning_category":"密輸"}]}