{"word":"torulaceous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ソーセージ状の、数珠状の、トルラ属に似た","english_definition":"Resembling a string of beads or sausages; having constrictions or swellings at intervals, like certain chains of cells in microorganisms, especially those of the genus Torula.","examples":[{"sentence":"The fungal hyphae exhibited a torulaceous appearance under the microscope.","translation":"その菌糸は顕微鏡下で数珠状の外観を示した。"},{"sentence":"The torulaceous chains of cells are characteristic of some yeast species.","translation":"数珠状の細胞鎖は、一部の酵母種に特徴的である。"}],"collocations":["torulaceous hyphae (数珠状菌糸)","torulaceous growth (数珠状成長)","torulaceous appearance (数珠状外観)"],"synonyms":["moniliform","beaded","sausage-shaped"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Torula' (a genus of yeasts) + '-aceous' (a suffix indicating resemblance or belonging to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɔːrjuˈleɪʃəs/","syllables":"to-ru-la-ce-ous"},"inflection":{"notes":"Adjective; no comparative or superlative forms."},"usage_notes":{"explanation":"'Torulaceous' is a descriptive term primarily used in microbiology, mycology, and related fields to describe the morphology of certain microorganisms, especially fungi and yeasts. It refers to a chain-like arrangement of cells that resemble beads on a string or a string of sausages, with constrictions or swellings between the cells. This term is not commonly used outside of scientific contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The bacteria were torulaceous in color.","correct":"✓ The bacteria exhibited a torulaceous morphology.","note":"'Torulaceous' describes the shape or arrangement, not the color."},{"incorrect":"✗ The smooth, cylindrical cells were torulaceous.","correct":"✓ The cells with constrictions were torulaceous.","note":"'Torulaceous' implies constrictions or swellings, not a smooth, cylindrical shape."}],"priority":"★★☆"},"related_words":{"derivatives":["Torula (genus name)","Torulopsis (related genus name - now reclassified)","Toruliform (similar meaning)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Torulaceous' is a highly specialized term used in scientific fields, particularly microbiology and mycology. It describes a specific morphological characteristic of certain microorganisms, namely a chain-like arrangement of cells resembling beads or sausages. Understanding this term requires a strong background in biology and familiarity with scientific terminology. It is unlikely to be encountered in general English contexts.","priority":"★★★"},"example_sentences":[{"sentence":"The microscopic examination revealed numerous fungal elements with a distinctly torulaceous morphology.","translation":"顕微鏡検査により、明確な数珠状形態を示す多数の真菌要素が明らかになった。","type":"scientific","meaning_category":"数珠状の"},{"sentence":"The isolate was identified based on its characteristic torulaceous growth pattern on the culture medium.","translation":"その分離株は、培養培地上の特徴的な数珠状成長パターンに基づいて同定された。","type":"scientific","meaning_category":"数珠状の"}]}