{"word":"pittings","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 小さなくぼみ、穴、腐食痕","english_definition":"(plural) small pits or depressions on a surface, often caused by corrosion or erosion.","examples":[{"sentence":"The metal surface showed signs of pittings due to exposure to salt water.","translation":"金属の表面は、塩水にさらされたことによる腐食痕を示していた。"},{"sentence":"The geologist examined the rock sample for pittings caused by acid rain.","translation":"地質学者は、酸性雨によってできた岩石試料の小さな穴を調べた。"},{"sentence":"The dentist noticed pittings on the enamel of the patient's teeth.","translation":"歯科医は、患者の歯のエナメル質の小さな穴に気づいた。"}],"collocations":["surface pittings","corrosion pittings","acid pittings","stress corrosion pittings"],"synonyms":["pits","depressions","cavities","indentations","erosions","corrosion marks"],"antonyms":["smooth surface","even surface"]}],"etymology":{"value":"The word 'pitting' comes from the verb 'to pit,' meaning to mark with small depressions or indentations. The suffix '-ing' is added to form a noun referring to the process or result of making pits. The plural 'pittings' refers to multiple such marks.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪtɪŋz/","syllables":"pit-tings"},"inflection":{"noun_plural":"pittings (already plural)"},"usage_notes":{"explanation":"'Pittings' refers specifically to multiple small depressions or pits on a surface. It is often used in technical or scientific contexts, such as materials science, geology, dentistry, and engineering, to describe surface damage or features. The term implies that the pits are relatively small and numerous.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pitting was visible on the metal.","correct":"✓ The pittings were visible on the metal.","note":"Since 'pittings' is plural, it should be used when referring to multiple pits. If referring to a single pit, use 'pit'."},{"incorrect":"✗ The pittings are caused by erosion, but it is not serious.","correct":"✓ The pittings are caused by erosion, but they are not serious.","note":"The pronoun should agree in number with the noun. Since 'pittings' is plural, use 'they' instead of 'it'."}],"priority":"★★☆"},"related_words":{"derivatives":["pit (noun: a hole or depression)","pitted (adjective: marked with pits)","pit (verb: to mark with pits)"],"related_terms":["corrosion","erosion","cavitation","fretting"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pittings' is a technical term used to describe small pits or depressions on a surface, often resulting from corrosion or erosion. It is most commonly encountered in scientific, engineering, or technical contexts. Understanding the term requires a familiarity with the processes that cause surface damage, such as corrosion or erosion. Due to its specialized usage, it is considered a higher-level vocabulary word."},"example_sentences":[{"sentence":"The engineer examined the pipeline for signs of corrosion pittings.","translation":"エンジニアは、パイプラインの腐食による小さな穴の兆候を調べた。","type":"noun","meaning_category":"Corrosion"},{"sentence":"Stress corrosion pittings can weaken the structural integrity of the metal.","translation":"応力腐食による小さな穴は、金属の構造的完全性を弱める可能性がある。","type":"noun","meaning_category":"Material Science"},{"sentence":"The dentist noted the presence of pittings on the occlusal surfaces of the molars.","translation":"歯科医は、臼歯の咬合面の小さな穴の存在に注目した。","type":"noun","meaning_category":"Dentistry"},{"sentence":"The geologist studied the pittings on the rock surface to determine its age.","translation":"地質学者は、岩石表面の小さな穴を調べてその年代を特定した。","type":"noun","meaning_category":"Geology"}]}