{"word":"scalages","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) Payments made by customary tenants to the lord of the manor, usually in the form of poultry or eggs.","english_definition":"Payments made by customary tenants to the lord of the manor, usually in the form of poultry or eggs.","examples":[{"sentence":"The historical records indicate that tenants paid scalages to the lord each year.","translation":"歴史的記録は、小作人が毎年領主にscalagesを支払っていたことを示しています。"}],"collocations":["pay scalages","collect scalages"],"synonyms":["tribute","rent","customary dues"],"antonyms":[]}],"etymology":{"value":"Derived from the Middle English word 'scale', referring to a dish or bowl, suggesting the payments were originally measured or presented in such containers.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskeɪlɪdʒɪz/","syllables":"sca-la-ges"},"inflection":{"noun_plural":"scalages"},"usage_notes":{"explanation":"'Scalages' is a historical term, primarily used in the context of feudal or manorial systems. It refers specifically to payments made by tenants to the lord, often in kind (goods rather than money). The term is not in common use today.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["scale (related to the original meaning of a dish or container)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - primarily a historical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Scalages' is a specialized historical term referring to payments made by tenants to a lord in a manorial system. It is not commonly used in modern English and would primarily be encountered in historical texts or academic discussions of feudalism."},"example_sentences":[{"sentence":"The manor court records detailed the amount of scalages due from each tenant.","translation":"荘園裁判所の記録には、各小作人から支払われるべきscalagesの金額が詳細に記載されていた。","type":"noun","meaning_category":"historical payment"}]}