{"word":"Semi-sadduceeism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"部分的サドカイ派主義、サドカイ派の教義の一部のみを受け入れる立場","english_definition":"A partial adherence to or acceptance of Sadducee doctrines, typically referring to selective adoption of some Sadducean beliefs while rejecting others.","examples":[{"sentence":"The scholar's position showed elements of Semi-sadduceeism in his rejection of the oral tradition while maintaining belief in resurrection.","translation":"その学者の立場は、口伝律法を拒否しながら復活の信仰を保持するという、半サドカイ派的要素を示していた。"}],"notes":"This is an extremely rare theological term used primarily in academic discussions of Second Temple Judaism and early Christian history. The hyphenated form emphasizes its status as a partial or modified version of Sadduceeism.","synonyms":["Partial Sadduceeism","Modified Sadducean views"],"antonyms":["Orthodox Sadduceeism","Pharisaism"]}],"etymology":{"value":"接頭辞「semi-」（半、部分的）＋「Sadduceeism」（サドカイ派の教義）。サドカイ派（Sadducees）は紀元前2世紀から紀元1世紀のユダヤ教の一派で、その名称はソロモン王時代の祭司ツァドク（Zadok）に由来するとされる。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛmɪˈsædʒʊsiːɪzəm/","syllables":"Sem-i-Sad-du-cee-ism"},"usage_notes":{"explanation":"この用語は非常に特殊な文脈で使用され、通常は以下の特徴を指します：\n1. サドカイ派の教義の一部（例えば口伝律法の拒否）を受け入れつつ、他の部分（例えば復活の否定）を拒否する立場\n2. 歴史的サドカイ派とファリサイ派の中間的な神学的立場\n3. 現代の学術的議論において、古代の宗教グループを分類するための造語\n実際の歴史的文献ではほとんど確認できないため、注意が必要です。","priority":"★★★"},"related_words":{"derivatives":["Sadducee (サドカイ派人)","Sadducean (サドカイ派の)","Phariseeism (ファリサイ派主義)"],"see_also":["Hellenistic Judaism","Second Temple Judaism","Karaites (カライ派 - 類似の聖書解釈をとる中世のユダヤ教分派)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Not applicable (専門用語)","frequency_google_ngram":"極めて低頻度 (Extremely low frequency) - 学術文献以外ではほとんど出現しない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Semi-sadduceeism**」は高度に専門的な神学用語で、紀元前後のユダヤ教におけるサドカイ派の教義を部分的に採用する立場を指します。通常の英語運用ではまず遭遇せず、宗教史や聖書学の専門文献で稀に使用される程度です。この概念を理解するには、サドカイ派（神殿祭司階級に支持されたグループで、口伝律法を否定し復活を信じなかった）とファリサイ派（口伝律法を重視し復活を信じた）の基本的な神学的相違についての知識が前提となります。"},"example_sentences":[{"sentence":"The sect's peculiar blend of beliefs demonstrated what modern scholars might term Semi-sadduceeism.","translation":"その分派の特異な信仰の混合は、現代の学者が半サドカイ派主義と呼ぶかもしれないものを示していた。","type":"noun","meaning_category":"部分的サドカイ派主義"},{"sentence":"His Semi-sadduceeism was evident in his acceptance of priestly authority while denying the resurrection of the dead.","translation":"死者の復活を否定しながら祭司の権威を受け入れる彼の立場には、半サドカイ派主義が明らかに見て取れた。","type":"noun","meaning_category":"選択的サドカイ派受容"}]}