{"word":"saccharometry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"糖度測定（法）、糖分定量（法）","english_definition":"the determination of the amount of sugar in a solution.","examples":[{"sentence":"Saccharometry is used in the food and beverage industry to measure sugar content.","translation":"糖度測定は、食品および飲料業界で糖度を測定するために使用されます。"}],"collocations":["use saccharometry","perform saccharometry","saccharometry analysis"],"synonyms":["sugar analysis","sugar determination","sugar measurement"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'saccharon' (meaning sugar) and 'metron' (meaning measure).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsækəˈrɒmətri/","syllables":"sac-cha-rom-e-try"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Saccharometry is a technique used to measure the concentration of sugar in a solution. It's commonly employed in industries such as food and beverage production, where precise sugar content is crucial for quality control and product consistency. The term encompasses various methods, including the use of saccharimeters, which measure the rotation of polarized light caused by sugar molecules.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Saccharometry is used to measure acidity.","correct":"✓ Saccharometry is used to measure sugar content.","note":"Saccharometry specifically measures sugar content, not acidity or other properties."}],"priority":"★☆☆"},"related_words":{"derivatives":["saccharometer (noun: an instrument for measuring the amount of sugar in a solution)","saccharic (adjective: relating to or derived from sugar)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Saccharometry' is a technical term used in chemistry and food science. It refers to the process of measuring the amount of sugar in a solution. This word is not commonly used in everyday language and is more likely to appear in scientific or technical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The laboratory uses saccharometry to ensure the consistency of its syrups.","translation":"その研究所では、シロップの一貫性を確保するために糖度測定を使用しています。","type":"general","meaning_category":"糖度測定"},{"sentence":"Saccharometry readings indicated a high sugar concentration in the sample.","translation":"糖度測定の結果、サンプル中の糖濃度が高いことが示されました。","type":"technical","meaning_category":"糖分定量"}]}