{"word":"unecclesiastical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非教会的な、教会の権威によらない、聖職者らしくない","english_definition":"Not ecclesiastical; not pertaining to the church or the clergy; secular.","examples":[{"sentence":"The unecclesiastical nature of the government's decision was criticized by religious leaders.","translation":"政府の決定の非教会的な性質は、宗教指導者たちによって批判された。"},{"sentence":"He adopted an unecclesiastical lifestyle, preferring worldly pleasures to religious devotion.","translation":"彼は聖職者らしくない生活様式を採用し、宗教的な献身よりも世俗的な喜びを好んだ。"}],"collocations":["unecclesiastical behavior","unecclesiastical activities","unecclesiastical dress","unecclesiastical views","unecclesiastical language"],"synonyms":["secular","lay","temporal","nonclerical","profane"],"antonyms":["ecclesiastical","clerical","religious","sacred"]}],"etymology":{"value":"From \"un-\" (not) + \"ecclesiastical\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnɪˌkliːziˈæstɪkəl/","syllables":"un-ec-cle-si-as-ti-cal"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"\"**unecclesiastical**\" is used to describe something that is not related to or approved by the church or clergy. It often implies a contrast with what is considered proper or traditional within a religious context. It can refer to actions, beliefs, or even styles of dress that are considered inappropriate or secular.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unecclesiastical building was used for church services.","correct":"✓ The secular building was used for community events.","note":"\"Unecclesiastical\" implies a lack of connection to the church. If the building is used for church services, it would not be described as unecclesiastical."},{"incorrect":"✗ His unecclesiastical behavior was praised by the bishop.","correct":"✓ His unconventional behavior was tolerated by the bishop.","note":"\"Unecclesiastical behavior\" is generally disapproved of by religious authorities. Praising it would be contradictory."}],"priority":"★☆☆"},"related_words":{"derivatives":["unecclesiastically (adverb)"],"related":["ecclesiastical (adjective)","clergy (noun)","secular (adjective)","theology (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"**unecclesiastical**\" is a formal term used to describe something that is not related to the church or clergy. It is the opposite of \"ecclesiastical,\" which means related to the church. This word is not commonly used in everyday conversation and is more likely to appear in academic or formal writing when discussing religion, history, or social issues. It implies a separation from or lack of adherence to religious norms and practices."},"example_sentences":[{"sentence":"The professor's unecclesiastical views on the origins of religion sparked a heated debate.","translation":"その教授の宗教の起源に関する非教会的な見解は、激しい議論を引き起こした。","type":"adjective","meaning_category":"non-religious views"},{"sentence":"The decision to hold the festival in a public park was seen as an unecclesiastical move by some.","translation":"公共の公園で祭りを開催するという決定は、一部の人々によって非教会的な動きと見なされた。","type":"adjective","meaning_category":"secular actions"},{"sentence":"His unecclesiastical attire raised eyebrows at the religious gathering.","translation":"彼の聖職者らしくない服装は、宗教的な集まりで眉をひそめられた。","type":"adjective","meaning_category":"non-clerical appearance"}]}