{"word":"Pseudo-pindaric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"擬似ピンダロス風の、ピンダロス風を模倣した","english_definition":"Imitating the style of Pindar, but with less formal structure; loosely Pindaric.","examples":[{"sentence":"The poem was written in pseudo-pindaric style.","translation":"その詩は擬似ピンダロス風のスタイルで書かれた。"}],"collocations":["pseudo-pindaric ode","pseudo-pindaric verse"],"synonyms":["irregular ode","free pindaric"],"antonyms":["pindaric","regular pindaric ode"]},{"part_of_speech":"noun","definition":"擬似ピンダロス詩、ピンダロス風を模倣した詩","english_definition":"A poem imitating the style of Pindar, but with less formal structure.","examples":[{"sentence":"His pseudo-pindaric is less structured than a true Pindaric ode.","translation":"彼の擬似ピンダロス詩は、真のピンダロス頌歌よりも構造が緩い。"}],"collocations":[],"synonyms":["irregular ode","free pindaric"],"antonyms":["pindaric ode","regular pindaric ode"]}],"etymology":{"value":"\"Pseudo-\" (偽の) + \"Pindaric\" (古代ギリシャの詩人ピンダロスの)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsjuːdoʊ pɪnˈdærɪk/","syllables":"pseu-do-pin-dar-ic"},"inflection":{},"usage_notes":{"explanation":"Pseudo-pindaric refers to a style of poetry that imitates the odes of the ancient Greek poet Pindar, but with a less rigid structure. Pindaric odes typically consist of a strophe, antistrophe, and epode, each with a specific meter and rhyme scheme. Pseudo-pindaric odes retain some of the characteristics of Pindaric odes, such as elevated language and praise of a particular subject, but they often abandon the strict metrical and stanzaic patterns.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Pindaric","ode","poem","verse"],"related_terms":["strophe","antistrophe","epode"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'Pseudo-pindaric' is a literary term referring to poetry that imitates the style of the ancient Greek poet Pindar but does not adhere to the strict structural rules of a Pindaric ode. This term is typically encountered in advanced literary studies or discussions of poetry. Understanding requires familiarity with classical poetic forms."},"example_sentences":[{"sentence":"Dryden's 'Alexander's Feast' is often cited as an example of a pseudo-pindaric ode.","translation":"ドライデンの『アレクサンダーの饗宴』は、擬似ピンダロス風頌歌の例としてよく引用される。","type":"example","meaning_category":"literary example"},{"sentence":"The poet experimented with pseudo-pindaric forms to achieve a more flexible and expressive style.","translation":"その詩人は、より柔軟で表現力豊かなスタイルを実現するために、擬似ピンダロス形式を試した。","type":"example","meaning_category":"poetic technique"}]}