{"word":"stipulative","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(定義が)規定的な、約束的な、取り決めの","english_definition":"(of a definition) assigning a meaning to a term, especially for the purposes of a specific argument or discussion; setting forth a specific meaning for a word or phrase.","examples":[{"sentence":"The author provided a stipulative definition of 'intelligence' for the purposes of their study.","translation":"著者は研究の目的のために、「知性」の規定的な定義を提供した。"},{"sentence":"A stipulative definition is not concerned with the existing usage of a word.","translation":"規定的な定義は、単語の既存の使用法には関心がない。"},{"sentence":"The term 'xylem' will have a stipulative meaning in this paper, referring only to the dead cells that transport water.","translation":"この論文では、「木部」という用語は、水を輸送する死んだ細胞のみを指す規定的な意味を持つものとする。"}],"collocations":["stipulative definition","stipulative meaning","offer a stipulative definition","provide a stipulative definition","adopt a stipulative definition"],"synonyms":["prescriptive","definitional","conventional","nominal"],"antonyms":["lexical","descriptive","reportive"]},{"part_of_speech":"adjective","definition":"(契約・合意などが)規定的な、約束的な、取り決めの","english_definition":"relating to or based on a specific agreement or condition.","examples":[{"sentence":"The contract included a stipulative clause regarding payment terms.","translation":"契約には、支払い条件に関する規定的な条項が含まれていた。"},{"sentence":"The agreement was stipulative, outlining the responsibilities of each party.","translation":"合意は規定的なもので、各当事者の責任を概説していた。"}],"collocations":["stipulative clause","stipulative agreement","stipulative condition","stipulative term"],"synonyms":["conditional","contractual","agreed","specified"],"antonyms":["unconditional","unspecified"]}],"etymology":{"value":"Derived from 'stipulate,' which comes from the Latin word 'stipulari,' meaning 'to demand or require (a promise) formally.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstɪpjələtɪv/","syllables":"sti-pu-la-tive"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"A 'stipulative definition' is a type of definition where someone explicitly states how they intend to use a term, regardless of its common or established meaning. This is often done to clarify terms within a specific context, such as a research paper or legal document. It's important to distinguish this from a 'lexical definition,' which describes how a word is commonly used. Stipulative definitions are not 'right' or 'wrong,' but rather useful or unhelpful for the purpose at hand.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The stipulative definition is the real meaning of the word.","correct":"✓ The stipulative definition is the meaning we are assigning to the word for this context.","note":"Stipulative definitions are not about the 'real' meaning, but about an assigned meaning for a specific purpose."},{"incorrect":"✗ Stipulative definitions are always correct.","correct":"✓ Stipulative definitions are useful or unhelpful, not correct or incorrect.","note":"The value of a stipulative definition lies in its utility, not its inherent correctness."}],"priority":"★★☆"},"related_words":{"derivatives":["stipulate (verb)","stipulation (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'stipulative' is a relatively advanced term, primarily used in academic, legal, or technical contexts. It refers to something that is based on a specific agreement, condition, or definition that has been explicitly stated or laid down. Understanding this word requires familiarity with formal language and abstract concepts. It's most often encountered when discussing definitions, contracts, or formal agreements where precise terms are important."},"example_sentences":[{"sentence":"The judge clarified the stipulative meaning of 'reasonable doubt' in the context of the trial.","translation":"裁判官は、裁判の文脈における「合理的な疑い」の規定的な意味を明確にした。","type":"adjective","meaning_category":"Definition"},{"sentence":"The researchers adopted a stipulative definition of 'success' that focused on long-term impact.","translation":"研究者たちは、長期的な影響に焦点を当てた「成功」の規定的な定義を採用した。","type":"adjective","meaning_category":"Definition"},{"sentence":"The stipulative terms of the treaty were carefully negotiated by both parties.","translation":"条約の規定的な条件は、両当事者によって慎重に交渉された。","type":"adjective","meaning_category":"Agreement"}]}