{"word":"superovulation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"過排卵","english_definition":"The release of multiple eggs during a single ovulation cycle, often induced artificially using fertility drugs.","examples":[{"sentence":"Superovulation is used in assisted reproductive technologies like IVF.","translation":"過排卵は体外受精のような生殖補助医療技術で用いられます。"},{"sentence":"The goal of superovulation is to increase the number of eggs available for fertilization.","translation":"過排卵の目的は、受精可能な卵子の数を増やすことです。"}],"collocations":["induce superovulation (過排卵を誘発する)","undergo superovulation (過排卵を受ける)","superovulation protocol (過排卵プロトコル)"],"synonyms":["controlled ovarian hyperstimulation"],"antonyms":[]}],"etymology":{"value":"'Super-' (above, beyond) + 'ovulation' (release of eggs from the ovary).","priority":"★★☆"},"pronunciation":{"ipa":"ˌsuːpərˌɒvjʊˈleɪʃən","syllables":"su-per-ov-u-la-tion"},"inflection":{"noun_plural":"superovulations"},"usage_notes":{"explanation":"Superovulation is a medical procedure used primarily in fertility treatments. It involves stimulating the ovaries to produce multiple eggs rather than the single egg typically released during a natural menstrual cycle. This is achieved through the administration of fertility drugs. The procedure is commonly used in in vitro fertilization (IVF) to increase the chances of successful fertilization and pregnancy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor recommended super ovulation.","correct":"✓ The doctor recommended superovulation.","note":"Superovulation is one word. Do not write as two words."}],"priority":"★☆☆"},"related_words":{"derivatives":["superovulate (verb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Superovulation' is a technical term used in the context of reproductive medicine. It refers to the process of stimulating the ovaries to release multiple eggs in a single cycle, typically through the use of fertility drugs. This is a common procedure in assisted reproductive technologies such as IVF. Understanding this term requires some background knowledge of biology and medical procedures.","priority":"★☆☆"},"example_sentences":[{"sentence":"The patient underwent superovulation as part of her IVF treatment.","translation":"患者は体外受精治療の一環として過排卵を受けました。","type":"general","meaning_category":"medical procedure"},{"sentence":"Superovulation can increase the chances of successful fertilization.","translation":"過排卵は受精成功の可能性を高めることができます。","type":"general","meaning_category":"medical benefit"}]}