{"word":"elutor","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"溶離剤、抽出器","english_definition":"A device or substance used to elute, i.e., to extract one material from another by washing with a solvent.","examples":[{"sentence":"The elutor was used to separate the proteins.","translation":"その溶離剤はタンパク質の分離に使われた。"},{"sentence":"A suitable elutor is needed for efficient extraction.","translation":"効率的な抽出には適切な溶離剤が必要である。"}],"collocations":["column elutor","gradient elutor"],"synonyms":["solvent","extractant"],"antonyms":[]}],"etymology":{"value":"From elute + -or. Elute comes from Latin eluere, meaning 'to wash out'.","priority":"★★★"},"pronunciation":{"ipa":"/iˈluːtər/","syllables":"e-lu-tor"},"inflection":{"noun_plural":"elutors"},"usage_notes":{"explanation":"An elutor is a substance or device used in the process of elution, where one material is extracted from another by washing with a solvent. It's commonly used in chemistry and biology for separating and purifying substances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The elutor was used to dilute the solution.","correct":"✓ The elutor was used to extract the desired compound from the mixture.","note":"Elutors are used for extraction, not dilution."}],"priority":"★★☆"},"related_words":{"derivatives":["elute","elution"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'elutor' is a technical term primarily used in scientific contexts, particularly in chemistry and biology. It refers to a substance or device employed to extract one material from another through washing with a solvent. Understanding this term requires familiarity with scientific processes like chromatography or extraction.","priority":"★★☆"},"example_sentences":[{"sentence":"The column elutor efficiently separated the different components of the sample.","translation":"カラム溶離剤は、サンプル中のさまざまな成分を効率的に分離した。","type":"noun","meaning_category":"溶離剤"},{"sentence":"Choosing the correct elutor is crucial for successful chromatography.","translation":"適切な溶離剤を選ぶことは、クロマトグラフィーを成功させるために非常に重要である。","type":"noun","meaning_category":"溶離剤"}]}