{"word":"halalah","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(イスラム法)離婚した女性が、元夫と復縁するために、一旦別の男性と結婚し、離婚すること。","english_definition":"(Islamic law) The practice of a divorced woman marrying another man, consummating the marriage, and then divorcing him, in order to be allowed to remarry her first husband.","examples":[{"sentence":"The practice of halalah is controversial in the Muslim world.","translation":"ハララの実践はイスラム世界で議論の的となっている。"},{"sentence":"Some scholars consider halalah to be a violation of the spirit of Islamic law.","translation":"一部の学者は、ハララをイスラム法の精神に反するものと見なしている。"}],"collocations":["perform halalah","engage in halalah","practice halalah","halalah marriage"],"synonyms":["tahlil"],"antonyms":[]}],"etymology":{"value":"アラビア語の حلال (ḥalāl) に由来し、「合法的な」「許された」という意味を持つ。ハララは、離婚した女性が元の夫と復縁するために、一時的に別の男性と結婚することを合法化しようとする行為であるため、この名称が用いられた。","priority":"★★☆"},"pronunciation":{"ipa":"/hæˈlɑːlə/","syllables":"ha-la-lah"},"inflection":{"noun_plural":"halalahs"},"usage_notes":{"explanation":"ハララは、イスラム法における離婚と復縁に関する複雑な問題に関連する用語です。イスラム法では、離婚を3回繰り返した夫婦は、女性が別の男性と結婚し、その結婚が解消されない限り、復縁することができません。ハララは、この要件を満たすために意図的に行われる一時的な結婚を指します。しかし、多くのイスラム法学者は、ハララをイスラム法の精神に反する行為であると批判しており、広く非難されています。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Halalah is a common practice in all Muslim countries.","correct":"✓ Halalah is a controversial practice and is not accepted in all Muslim countries.","note":"ハララは論争の的となる行為であり、すべてのイスラム諸国で受け入れられているわけではありません。"},{"incorrect":"✗ Halalah is always a valid way to remarry your ex-husband.","correct":"✓ Many Islamic scholars consider halalah to be invalid and against the spirit of Islamic law.","note":"多くのイスラム法学者は、ハララを無効であり、イスラム法の精神に反すると考えています。"}],"priority":"★★☆"},"related_words":{"derivatives":["tahlil (アラビア語: تحليل, ハララと同様の意味)","talaq (アラビア語: طلاق, 離婚)","nikah (アラビア語: نكاح, 結婚)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - イスラム法に関する文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**halalah**」は、イスラム法における離婚と復縁に関連する専門用語です。離婚した女性が元の夫と復縁するために、一時的に別の男性と結婚し、離婚することを指します。この行為は、多くのイスラム法学者によってイスラム法の精神に反すると批判されており、論争の的となっています。この用語は、イスラム法や社会に関する高度な議論においてのみ使用されます。"},"example_sentences":[{"sentence":"The religious court ruled that the halalah marriage was invalid.","translation":"宗教裁判所は、ハララの結婚は無効であると判決を下した。","type":"noun","meaning_category":"イスラム法におけるハララ"},{"sentence":"Many consider halalah to be a form of exploitation of women.","translation":"多くの人々は、ハララを女性に対する搾取の一形態であると考えている。","type":"noun","meaning_category":"イスラム法におけるハララ"},{"sentence":"The practice of halalah is often condemned by human rights organizations.","translation":"ハララの実践は、人権団体によってしばしば非難されている。","type":"noun","meaning_category":"イスラム法におけるハララ"}]}