{"word":"beauty-proof","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(主に化粧品について)美しさを損なわない、崩れにくい、美しい状態を保つ","english_definition":"(chiefly of cosmetics) resistant to smudging, fading, or other factors that would detract from its appearance; designed to maintain a beautiful appearance.","examples":[{"sentence":"This lipstick is beauty-proof, so it will last all day.","translation":"この口紅はbeauty-proofなので、一日中持ちます。"},{"sentence":"The foundation is beauty-proof and will not smudge even in humid weather.","translation":"このファンデーションはbeauty-proofで、湿気の多い天気でも崩れません。"}],"collocations":["beauty-proof makeup","beauty-proof lipstick","beauty-proof foundation","beauty-proof formula"],"synonyms":["long-lasting","smudge-proof","fade-resistant","durable","waterproof"],"antonyms":["non-durable","smudge-prone","easily-faded"]},{"part_of_speech":"adjective","definition":"(比喩的に)欠点がない、完璧な美しさを持つ","english_definition":"(figuratively) flawless; possessing beauty that is resistant to any negative influence or criticism.","examples":[{"sentence":"Her performance was beauty-proof; no one could find fault with it.","translation":"彼女のパフォーマンスはbeauty-proofで、誰も欠点を見つけられなかった。"},{"sentence":"The design of the building is beauty-proof, blending seamlessly with the natural landscape.","translation":"その建物のデザインはbeauty-proofで、自然の景観とシームレスに調和している。"}],"collocations":["beauty-proof design","beauty-proof performance","beauty-proof artwork"],"synonyms":["flawless","perfect","unassailable","impeccable","exquisite"],"antonyms":["flawed","imperfect","vulnerable"]}],"etymology":{"value":"The word \"beauty-proof\" is a compound word formed by combining \"beauty\" and \"proof.\" The term \"proof\" is used here in the sense of being resistant or impervious to something, similar to \"waterproof\" or \"childproof.\" The combination suggests a product or quality that maintains its beauty despite external factors or challenges.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbjuːtiˌpruːf/","syllables":"beau-ty-proof"},"inflection":{"notes":"Since it is an adjective, it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Beauty-proof\" is primarily used in the context of cosmetics to describe products that are designed to maintain their appearance and resist smudging, fading, or other factors that could detract from their beauty. It can also be used figuratively to describe something that is flawless or possesses beauty that is resistant to criticism or negative influences. The term emphasizes the durability and resilience of beauty.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The beauty-proof of the dress was amazing.","correct":"✓ The beauty of the dress was amazing.","note":"\"Beauty-proof\" is an adjective, so it should modify a noun, not be used as a noun itself. In this case, \"beauty\" is the appropriate noun."},{"incorrect":"✗ This product is beauty-proofed.","correct":"✓ This product is beauty-proof.","note":"\"Beauty-proof\" is an adjective and does not have a past participle or past tense form."}],"priority":"★★☆"},"related_words":{"derivatives":["beauty","proof","waterproof","smudge-proof","fade-resistant"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, primarily used in marketing and product descriptions.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Beauty-proof\" is a compound adjective that describes something designed to maintain its beauty and resist factors that could detract from its appearance. It is commonly used in the context of cosmetics to describe products that are long-lasting and resistant to smudging or fading. Figuratively, it can describe something flawless or possessing beauty that is resistant to criticism. The term combines the concepts of \"beauty\" and \"proof,\" suggesting durability and resilience.","example_sentences":[{"sentence":"The new line of beauty-proof mascaras promises to stay put all day.","translation":"新しいbeauty-proofマスカラのラインは、一日中落ちないと約束しています。","type":"adjective","meaning_category":"化粧品"},{"sentence":"The architect designed the building to be beauty-proof, ensuring it would remain aesthetically pleasing for years to come.","translation":"建築家は、建物がbeauty-proofになるように設計し、今後何年も美的に心地よい状態を保つようにしました。","type":"adjective","meaning_category":"比喩的"}]}}