{"word":"dyadically","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"二者関係的に、二者間で","english_definition":"In a dyadic manner; involving or relating to a dyad (a group of two).","examples":[{"sentence":"The interaction was analyzed dyadically, focusing on the communication between the two participants.","translation":"その相互作用は二者関係的に分析され、二人の参加者間のコミュニケーションに焦点が当てられた。"},{"sentence":"The relationship was understood dyadically, considering the influence each person had on the other.","translation":"その関係は二者関係的に理解され、それぞれの人物が相手に与える影響が考慮された。"}],"collocations":["analyze dyadically (二者関係的に分析する)","understand dyadically (二者関係的に理解する)","relate dyadically (二者関係的に関連付ける)"],"synonyms":["pairwise","bilaterally","in pairs"],"antonyms":["individually","singly","independently"]}],"etymology":{"value":"Derived from the adjective 'dyadic', which comes from the Greek word 'dyas' meaning 'two'. The suffix '-ally' is added to form the adverb.","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈædɪkli/","syllables":"dy-ad-i-cal-ly"},"inflection":{"notes":"Adverb, so it does not inflect."},"usage_notes":{"explanation":"'Dyadically' describes something done or considered in terms of a dyad, which is a pair or group of two. It's often used in social sciences, psychology, and communication studies to analyze interactions or relationships between two individuals.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The data was analyzed dyadic.","correct":"✓ The data was analyzed dyadically.","note":"'Dyadic' is an adjective, while 'dyadically' is an adverb. Use the adverb to modify a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["dyad (noun: 二人組、二つ一組)","dyadic (adjective: 二者関係の、二つ一組の)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in academic or specialized contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Dyadically' is an adverb used in academic or technical contexts, particularly in fields like psychology, sociology, and communication studies. It means 'in a way that relates to a pair or group of two.' If you encounter this word, it likely indicates a discussion about the relationship or interaction between two entities, often people."},"example_sentences":[{"sentence":"The mother-infant interaction was studied dyadically to understand the reciprocal influence.","translation":"母親と乳児の相互作用は、相互の影響を理解するために二者関係的に研究された。","type":"general","meaning_category":"二者関係的に"},{"sentence":"The therapist approached the couple's issues dyadically, focusing on their communication patterns.","translation":"セラピストはカップルの問題に二者関係的に取り組み、彼らのコミュニケーションパターンに焦点を当てた。","type":"general","meaning_category":"二者関係的に"}]}