{"word":"Temporalist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"時間的視点主義者、時間的価値を重視する人","english_definition":"A person who believes in temporalism, the philosophical doctrine that only present objects and events are real.","examples":[{"sentence":"As a temporalist, he believed that the past and future do not exist.","translation":"時間的視点主義者として、彼は過去と未来は存在しないと信じていた。"},{"sentence":"The debate between the temporalist and the eternalist is a central issue in metaphysics.","translation":"時間的視点主義者と永遠主義者の間の議論は、形而上学における中心的な問題である。"}],"collocations":["temporalist philosophy","temporalist view","temporalist perspective"],"synonyms":["presentist"],"antonyms":["eternalist","perdurantist"]},{"part_of_speech":"adjective","definition":"時間的視点主義の、時間的価値を重視する","english_definition":"Relating to or characteristic of temporalism.","examples":[{"sentence":"The temporalist approach to history emphasizes the importance of the present moment.","translation":"歴史に対する時間的視点主義のアプローチは、現在の瞬間の重要性を強調する。"},{"sentence":"Temporalist art often explores themes of transience and impermanence.","translation":"時間的視点主義の芸術は、しばしば一時性や儚さのテーマを探求する。"}],"collocations":["temporalist theory","temporalist interpretation","temporalist analysis"],"synonyms":["presentist"],"antonyms":["eternalist","perdurantist"]}],"etymology":{"value":"The word \"temporalist\" is derived from \"temporal,\" relating to time, and the suffix \"-ist,\" indicating a believer or follower of a particular doctrine or philosophy.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛmpərəlɪst/","syllables":"tem-po-ral-ist"},"inflection":{"noun_plural":"Temporalists"},"usage_notes":{"explanation":"The term \"temporalist\" is primarily used in philosophical contexts, specifically in discussions about the nature of time and existence. It refers to someone who adheres to temporalism, the belief that only the present is real, and that the past and future do not exist in the same way. The term is often contrasted with \"eternalist,\" who believes that all points in time (past, present, and future) are equally real.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a temporalist artist, focusing on space.","correct":"✓ He is a temporalist artist, focusing on time.","note":"Temporalism relates to time, not space. Ensure the context aligns with the concept of time and the present moment."},{"incorrect":"✗ Temporalist is the study of temperature.","correct":"✓ Temporalism is a philosophical view about the nature of time.","note":"Temporalism is a philosophical concept, not related to temperature."}],"priority":"★☆☆"},"related_words":{"derivatives":["temporalism (noun: the philosophical doctrine that only present objects and events are real)","temporality (noun: the state of existing in time)","temporal (adjective: relating to time)"],"phrases":["presentism (synonym for temporalism)","eternalism (antonym for temporalism)","philosophy of time"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in philosophical discourse.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"temporalist\" is a specialized term primarily used in philosophy, specifically within discussions about the nature of time. It refers to someone who adheres to temporalism, the philosophical view that only the present is real, and that the past and future do not exist in the same way. This term is typically encountered in advanced philosophical texts and discussions. Understanding the term requires familiarity with philosophical concepts related to metaphysics and the philosophy of time."},"example_sentences":[{"sentence":"The temporalist argues that statements about the future are not yet true or false.","translation":"時間的視点主義者は、未来についての記述はまだ真でも偽でもないと主張する。","type":"noun","meaning_category":"哲学"},{"sentence":"A temporalist ontology includes only what exists at the present moment.","translation":"時間的視点主義の存在論は、現在の瞬間に存在する物のみを含む。","type":"adjective","meaning_category":"哲学"}]}