{"word":"Franciscanism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"フランシスコ会主義、フランシスコ会の精神、フランシスコ会の教え","english_definition":"The religious ideals and practices of the Franciscans, emphasizing poverty, humility, and love of God and neighbor.","examples":[{"sentence":"Franciscanism emphasizes a life of simplicity and service to others.","translation":"フランシスコ会主義は、簡素な生活と他者への奉仕を重視します。"},{"sentence":"The core tenets of Franciscanism are poverty, chastity, and obedience.","translation":"フランシスコ会主義の中核となる教義は、清貧、貞潔、そして従順です。"}],"collocations":["live according to Franciscanism (フランシスコ会主義に従って生きる)","the spirit of Franciscanism (フランシスコ会主義の精神)","the principles of Franciscanism (フランシスコ会主義の原則)"],"synonyms":["Franciscan spirituality","Franciscan tradition","Franciscan ideals"],"antonyms":[]}],"etymology":{"value":"From 'Franciscan' (belonging to the order founded by St. Francis of Assisi) + '-ism' (denoting a system of principles or practices).","priority":"★★★"},"pronunciation":{"ipa":"/frænˈsɪskənɪzəm/","syllables":"Fran-cis-can-i-sm"},"inflection":{"notes":"単数形のみ (uncountable noun)"},"usage_notes":{"explanation":"'Franciscanism' refers to the set of beliefs, values, and practices associated with the Franciscan religious order, founded by St. Francis of Assisi. It emphasizes a life of poverty, humility, love, and service to others, inspired by the example of St. Francis. The term is often used in theological, historical, and cultural contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices Franciscan.","correct":"✓ He practices Franciscanism.","note":"'Franciscan' is an adjective or a noun referring to a member of the order. 'Franciscanism' is the correct noun to describe the system of beliefs and practices."}],"priority":"★★☆"},"related_words":{"derivatives":["Franciscan (adjective, noun)","Franciscan Order (noun)","Franciscan friar (noun)","Franciscan sister (noun)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency - primarily used in religious or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Franciscanism' is a term used to describe the religious and philosophical principles of the Franciscan Order. It is most often encountered in academic or religious texts dealing with the history of Christianity or the life and teachings of St. Francis of Assisi. The term implies a focus on poverty, humility, and service to others, reflecting the values of St. Francis."},"example_sentences":[{"sentence":"The architecture of the church reflected the values of Franciscanism, with its simple design and emphasis on natural materials.","translation":"その教会の建築は、簡素なデザインと自然素材の重視という点で、フランシスコ会主義の価値観を反映していた。","type":"general","meaning_category":"フランシスコ会主義の精神"},{"sentence":"Scholars of religion often study the influence of Franciscanism on medieval art and literature.","translation":"宗教学者は、中世の芸術や文学に対するフランシスコ会主義の影響を研究することが多い。","type":"academic","meaning_category":"フランシスコ会の教え"}]}