{"word":"extracalendar","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"カレンダーに記載されていない、またはカレンダーの範囲外の","english_definition":"Not listed in or pertaining to a calendar.","examples":[{"sentence":"Extracalendar activities are essential for a well-rounded education.","translation":"カレンダーに記載されていない活動は、バランスの取れた教育に不可欠です。"},{"sentence":"The conference organizers planned several extracalendar events for the attendees.","translation":"会議の主催者は、参加者のためにいくつかのカレンダー外のイベントを計画しました。"}],"collocations":["extracalendar activity","extracalendar event","extracalendar meeting"],"synonyms":["non-scheduled","unscheduled"],"antonyms":["scheduled","calendar"],"notes":"This term is often used in educational or organizational contexts to refer to events or activities that are not part of the regular, planned schedule."}],"etymology":{"value":"Derived from \"extra-\" (meaning outside or beyond) and \"calendar.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌekstrəkæˈlɛndər/","syllables":"ex-tra-cal-en-dar"},"inflection":{"notes":"Since it's an adjective, it can be used to modify nouns, but it doesn't have different forms like comparative or superlative."},"usage_notes":{"explanation":"The term 'extracalendar' is used to describe events or activities that are not part of a regular schedule or calendar. It's often used in academic or organizational settings to refer to optional or additional events.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The extracalendar is full of events.","correct":"✓ The schedule is full of extracalendar events.","note":"'Extracalendar' is an adjective, so it should modify a noun (like 'events' or 'activities')."}],"priority":"★★☆"},"related_words":{"derivatives":["extra-curricular"],"related_terms":["calendar","schedule","activity","event"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized or technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Extracalendar' is a relatively uncommon word used to describe things that are not part of a regular calendar or schedule. It's often used in academic or organizational contexts. Because it's not a common word, it's more likely to be encountered in written materials or formal settings rather than in everyday conversation."},"example_sentences":[{"sentence":"The museum offered an extracalendar tour for the visiting students.","translation":"博物館は訪問中の学生のためにカレンダーに記載されていないツアーを提供しました。","type":"example","meaning_category":"not listed in a calendar"},{"sentence":"Participation in extracalendar workshops is voluntary.","translation":"カレンダーに記載されていないワークショップへの参加は任意です。","type":"example","meaning_category":"not listed in a calendar"}]}