{"word":"swaggeringly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"横柄な態度で、尊大に、威張って","english_definition":"in a manner that shows an exaggerated sense of self-importance; arrogantly; pompously.","examples":[{"sentence":"He swaggeringly walked into the room, expecting everyone to admire him.","translation":"彼は、誰もが自分を称賛することを期待して、横柄な態度で部屋に入ってきた。"},{"sentence":"The CEO swaggeringly announced the company's record profits.","translation":"CEOは、会社の記録的な利益を威張って発表した。"},{"sentence":"She swaggeringly dismissed her opponent's arguments.","translation":"彼女は相手の議論を尊大に退けた。"}],"collocations":["walk swaggeringly","announce swaggeringly","dismiss swaggeringly"],"synonyms":["arrogantly","pompously","haughtily","conceitedly","ostentatiously","bombastically","vaingloriously","pretentiously"],"antonyms":["humbly","modestly","meekly","unassumingly"]}],"etymology":{"value":"The word is derived from the verb 'swagger', with the addition of the adverbial suffix '-ingly'. 'Swagger' itself has uncertain origins, possibly from a Scandinavian source or related to 'swag' (to walk with a swaying motion).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈswæɡərɪŋli/","syllables":"swag-ger-ing-ly"},"inflection":{"notes":"Adverb - no inflection"},"usage_notes":{"explanation":"'Swaggeringly' describes a manner of acting or speaking that is characterized by excessive pride and self-confidence, often to the point of being offensive or ridiculous. It implies a deliberate display of superiority. It is often used to describe someone's physical demeanor (e.g., walking, gesturing) or their way of speaking.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted swaggering.","correct":"✓ He acted swaggeringly.","note":"'Swaggering' is an adjective or a present participle. To describe how someone acts, use the adverb 'swaggeringly'."},{"incorrect":"✗ She said swaggeringly that she was the best.","correct":"✓ She said swaggeringly that she was the best.","note":"The sentence is correct. However, consider if 'arrogantly' or 'boastfully' might be a better fit depending on the specific nuance you want to convey."}],"priority":"★★☆"},"related_words":{"derivatives":["swagger (verb, noun)","swaggering (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'swaggeringly' is an advanced term used to describe behavior marked by excessive arrogance and self-importance. It's often used in literature or formal writing to depict a character's pompous or boastful actions. Understanding this word requires a good grasp of related concepts like arrogance, conceit, and ostentation."},"example_sentences":[{"sentence":"The victorious general swaggeringly addressed the troops.","translation":"勝利した将軍は、威張って部隊に演説した。","type":"general","meaning_category":"manner of speaking"},{"sentence":"He swaggeringly displayed his expensive watch to everyone at the party.","translation":"彼はパーティーで、みんなに自慢げに高価な腕時計を見せびらかした。","type":"general","meaning_category":"manner of displaying"},{"sentence":"She swaggeringly announced that she would be taking over the project.","translation":"彼女は、自分がプロジェクトを引き継ぐことを横柄に発表した。","type":"general","meaning_category":"manner of announcing"}]}