{"word":"Heterotopia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"異質な場所、ユートピアとは異なる現実の場所で、社会的に規定された空間の秩序を反映し、同時に逸脱する場所","english_definition":"A concept elaborated by Michel Foucault to describe certain cultural, institutional and discursive spaces that are somehow 'other': disturbing, intense, incompatible, contradictory or transforming. Heterotopias are worlds within worlds, mirroring and yet upsetting what is outside.","examples":[{"sentence":"A prison is a heterotopia, representing a space both within and outside of normal society.","translation":"刑務所はヘテロトピアであり、通常の社会の内側と外側の両方を表す空間である。"},{"sentence":"Foucault used the term heterotopia to describe places like ships, museums, and asylums.","translation":"フーコーはヘテロトピアという言葉を、船、博物館、精神病院のような場所を記述するために使用した。"}],"collocations":["spatial heterotopia","temporal heterotopia","heterotopia of crisis","heterotopia of deviation"],"synonyms":["counter-site","other space"],"antonyms":["utopia","homotopia"]}],"etymology":{"value":"Derived from the Greek words 'heteros' (ἕτερος) meaning 'other' or 'different,' and 'topos' (τόπος) meaning 'place.'","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɛtərəˈtoʊpiə/","syllables":"het-er-o-to-pi-a"},"inflection":{"noun_plural":"Heterotopias"},"usage_notes":{"explanation":"Heterotopia, as defined by Michel Foucault, is a real place that embodies several sites that are incompatible with each other. These spaces function in ways that disrupt or invert the common cultural codes and representations. Unlike utopias, which are idealized non-existent spaces, heterotopias are real places that operate according to different rules than the dominant culture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He described utopia as a heterotopia.","correct":"✓ He described a prison as a heterotopia.","note":"Heterotopias are real places, whereas utopias are idealized, non-existent places. Do not confuse the two."}],"priority":"★★☆"},"related_words":{"derivatives":["heterotopic (adjective)"],"related_concepts":["utopia","dystopia","space","place","Foucauldian theory"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Heterotopia' is an advanced concept used in philosophy, sociology, and cultural studies, primarily associated with the work of Michel Foucault. It refers to real places that function as counter-sites, representing both a mirroring and a contesting of the dominant social order. Understanding this term requires familiarity with theoretical frameworks and abstract thinking."},"example_sentences":[{"sentence":"The garden served as a heterotopia, a space where the normal rules of the city did not apply.","translation":"庭園はヘテロトピアとして機能し、都市の通常のルールが適用されない空間だった。","type":"general","meaning_category":"異質な場所"},{"sentence":"Foucault argued that a library could be considered a heterotopia because it contains all times and places within itself.","translation":"フーコーは、図書館はそれ自体の中にすべての時間と場所を含んでいるため、ヘテロトピアと見なすことができると主張した。","type":"academic","meaning_category":"異質な場所"}]}