{"word":"idiothermic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"自熱性の、自己発熱性の","english_definition":"Generating heat internally; capable of maintaining a constant body temperature by internal means.","examples":[{"sentence":"Idiothermic animals can survive in cold environments.","translation":"自熱性の動物は寒い環境でも生き残ることができます。"},{"sentence":"The idiothermic process allows the organism to maintain a stable internal temperature.","translation":"自熱性のプロセスにより、生物は安定した内部温度を維持することができます。"}],"collocations":["idiothermic animal","idiothermic process"],"synonyms":["endothermic","warm-blooded"],"antonyms":["ectothermic","cold-blooded"]}],"etymology":{"value":"From the Greek words 'idios' (own, self) + 'thermos' (heat).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪdiəˈθɜːrmɪk/","syllables":"i-di-o-ther-mic"},"inflection":{"notes":"Does not inflect; it is an adjective."},"usage_notes":{"explanation":"'Idiothermic' is a term primarily used in biology to describe organisms that can generate their own heat internally, allowing them to maintain a constant body temperature regardless of the external environment. It is often used interchangeably with 'endothermic' or 'warm-blooded'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is idiothermic.","correct":"✓ The plant is not idiothermic.","note":"Plants are generally not idiothermic; this term is mainly used for animals."},{"incorrect":"✗ Idiothermic animals don't need to regulate their body temperature.","correct":"✓ Idiothermic animals still need to regulate their body temperature, but they do so internally.","note":"Idiothermic animals regulate their body temperature, but they do it through internal mechanisms."}],"priority":"★★☆"},"related_words":{"derivatives":["endotherm","endothermic","homeotherm","homeothermic"],"related_terms":["thermogenesis","metabolism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Idiothermic' is a technical term used in biology to describe animals that can generate their own body heat internally. It's a less common synonym for 'endothermic' or 'warm-blooded'. You'll typically encounter this word in scientific texts or discussions about animal physiology."},"example_sentences":[{"sentence":"Mammals and birds are examples of idiothermic creatures.","translation":"哺乳類と鳥類は自熱性生物の例です。","type":"general","meaning_category":"biology"},{"sentence":"The idiothermic nature of the animal allows it to be active even in cold weather.","translation":"その動物の自熱性により、寒い気候でも活動することができます。","type":"general","meaning_category":"biology"}]}