{"word":"congregation-led","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"会衆主導の、信徒主導の","english_definition":"Describes a church or religious organization where the congregation (the members) has significant control and decision-making power, rather than being solely directed by clergy or a hierarchical structure.","examples":[{"sentence":"The church operates under a congregation-led model, where major decisions are voted on by the members.","translation":"その教会は会衆主導のモデルで運営されており、主要な決定は会員の投票によって行われます。"},{"sentence":"In a congregation-led church, the pastor's role is to guide and support the members in their decision-making process.","translation":"信徒主導の教会では、牧師の役割は、会員の意思決定プロセスを導き、支援することです。"},{"sentence":"The shift towards a congregation-led structure has empowered the members to take ownership of the church's mission.","translation":"会衆主導の構造への移行により、会員は教会の使命に対するオーナーシップを持つことができるようになりました。"}],"collocations":["congregation-led church","congregation-led governance","congregation-led decision-making","congregation-led model"],"synonyms":["member-led","grassroots-led","participatory","democratic"],"antonyms":["clergy-led","hierarchical","top-down","authoritarian"]}],"etymology":{"value":"Combination of 'congregation' (a gathering of people, especially for religious worship) and 'led' (past participle of 'lead', meaning to guide or direct). Indicates that the congregation is the entity doing the leading or directing.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒŋɡrɪˈɡeɪʃən ˈlɛd/","syllables":"con-gre-ga-tion-led"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"'Congregation-led' describes a specific type of organizational structure, primarily within religious contexts, where the power and authority rest with the members of the congregation, not solely with the religious leaders. This often involves voting on important matters, participating in committees, and having a direct say in the church's direction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The congregation-led was very successful.","correct":"✓ The congregation-led church was very successful.","note":"'Congregation-led' is an adjective and needs to modify a noun (e.g., church, organization, system)."},{"incorrect":"✗ The church is leading by the congregation.","correct":"✓ The church is congregation-led.","note":"The correct phrasing is 'congregation-led', not 'leading by the congregation' when used as an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["congregation","lead","leadership"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary, used in religious or organizational contexts)","frequency_google_ngram":"Low frequency (Relatively uncommon term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Congregation-led' is a compound adjective used to describe an organization, typically a church, where the members (the congregation) have the primary decision-making power. This means that major decisions are made through voting or other forms of participation by the members, rather than being dictated by leaders or a hierarchical structure. Understanding this term requires familiarity with concepts of organizational structure and religious governance."},"example_sentences":[{"sentence":"The new bylaws emphasized a more **congregation-led** approach to governance.","translation":"新しい定款は、ガバナンスに対するより会衆主導のアプローチを強調していました。","type":"adjective","meaning_category":"会衆主導の"},{"sentence":"They transitioned to a **congregation-led** model to encourage greater member involvement.","translation":"彼らは、会員のより大きな関与を促すために、会衆主導のモデルに移行しました。","type":"adjective","meaning_category":"信徒主導の"}]}