{"word":"customarily-haired","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having hair as is typical or conventional for a particular group, culture, or context.","english_definition":"Possessing hair in a manner that aligns with the usual or expected style, color, or presence within a specific group, culture, or situation.","examples":[{"sentence":"In that era, men were customarily-haired, favoring short, neat styles.","translation":"その時代、男性は慣習的に髪を生やしており、短く整ったスタイルが好まれていました。"},{"sentence":"The dolls were designed to be customarily-haired, reflecting the diverse hairstyles of the children who would play with them.","translation":"人形は、遊ぶ子供たちの多様なヘアスタイルを反映して、慣習的に髪を生やすように設計されました。"}],"collocations":["customarily-haired men","customarily-haired women","customarily-haired dolls","customarily-haired figures","customarily-haired population"],"synonyms":["traditionally-haired","conventionally-haired","typically-haired","normally-haired","ordinarily-haired"],"antonyms":["unconventionally-haired","untypically-haired","unusually-haired","abnormally-haired","untraditionally-haired"]}],"etymology":{"value":"Formed by combining \"customarily\" (in a customary manner) with \"haired\" (having hair).","priority":"N/A"},"pronunciation":{"ipa":"/ˌkʌstəˈmɛrɪli heərd/","syllables":"cus-to-mar-i-ly haired"},"inflection":{"adjective_forms":{"comparative":"more customarily-haired","superlative":"most customarily-haired"}},"usage_notes":{"explanation":"This adjective is used to describe someone or something that has hair in a way that is considered normal or expected within a specific context. It implies adherence to customary or conventional hairstyles or hair presence.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The customarily haired person was bald.","correct":"✓ The traditionally haired person had a wig.","note":"The term implies the presence of hair, so it cannot be used to describe someone who is bald."}],"priority":"N/A"},"related_words":{"derivatives":["customarily","haired"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The word \"customarily-haired\" is a complex adjective that describes someone or something having hair in a way that is typical or expected within a specific cultural or social context. Due to its complexity and specific usage, it is not commonly encountered and would be appropriate for advanced language users."},"example_sentences":[{"sentence":"The artist depicted the historical figures as customarily-haired, reflecting the styles of the period.","translation":"アーティストは、歴史上の人物を、その時代のスタイルを反映して、慣習的に髪を生やした姿で描きました。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"The dolls are designed to represent a customarily-haired population, showcasing a variety of common hairstyles.","translation":"人形は、一般的なヘアスタイルを様々に表現し、慣習的に髪を生やした人々を表現するように設計されています。","type":"adjective","meaning_category":"Descriptive"}]}