{"word":"disentailment","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)限定相続解除、不動産などの相続権限定の解除","english_definition":"The act or process of disentailing an estate; the conversion of an estate tail into a fee simple.","examples":[{"sentence":"The lawyer explained the process of disentailment to his client.","translation":"弁護士は、限定相続解除の手続きを依頼人に説明した。"},{"sentence":"Disentailment allowed the owner to sell the land freely.","translation":"限定相続解除によって、所有者は自由に土地を売却できるようになった。"}],"collocations":["legal disentailment","property disentailment"],"synonyms":["unfettering","freeing","liberation"],"antonyms":["entailment","restriction","limitation"]}],"etymology":{"value":"Derived from 'disentail,' which is formed by adding the prefix 'dis-' (meaning 'not' or 'opposite of') to 'entail.' 'Entail' comes from the Old French 'entailler,' meaning 'to cut in' or 'to carve,' referring to the cutting or limiting of inheritance rights.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdɪsənˈteɪlmənt/","syllables":"dis-en-tail-ment"},"inflection":{"noun_plural":"disentailments"},"usage_notes":{"explanation":"'Disentailment' is a legal term primarily used in historical contexts, particularly in countries with legal systems derived from English common law. It refers to the process by which an estate tail (a form of property ownership restricted to a specific line of heirs) is converted into a fee simple (absolute ownership). This allows the owner to sell, give away, or bequeath the property as they wish, without the restrictions of the entail.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The disentailment of the property caused it to become entailed.","correct":"✓ The disentailment of the property allowed it to be sold freely.","note":"Disentailment is the *opposite* of entailment. It *removes* restrictions, it does not create them."}],"priority":"★★☆"},"related_words":{"derivatives":["disentail (verb)","entailment (noun)","entail (verb)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (specialized legal term)","frequency_google_ngram":"Very low frequency - primarily found in legal texts and historical discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Disentailment' is a highly specialized legal term referring to the process of removing restrictions on the inheritance of property, specifically converting an 'estate tail' into a 'fee simple.' This term is rarely encountered outside of legal or historical contexts dealing with land ownership and inheritance laws. Understanding requires familiarity with legal concepts and historical property law.","priority":"★★☆"},"example_sentences":[{"sentence":"The act of disentailment was a significant step towards modernizing property law.","translation":"限定相続解除の行為は、財産法を近代化するための重要な一歩だった。","type":"noun","meaning_category":"legal"},{"sentence":"Through disentailment, the family was able to break free from the constraints of the old inheritance system.","translation":"限定相続解除によって、その家族は古い相続制度の制約から解放されることができた。","type":"noun","meaning_category":"historical"}]}