{"word":"uncontrolled-temperature","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"温度管理されていない、温度制御されていない","english_definition":"Not having its temperature regulated or maintained within specific limits.","examples":[{"sentence":"The medication must be stored in a controlled-temperature environment; leaving it in an uncontrolled-temperature area could degrade its effectiveness.","translation":"その薬は温度管理された環境で保管しなければなりません。温度管理されていない場所に置いておくと、効果が低下する可能性があります。"},{"sentence":"Food spoilage is more likely to occur in uncontrolled-temperature conditions.","translation":"食品の腐敗は、温度管理されていない状況でより起こりやすいです。"},{"sentence":"Storing sensitive materials in an uncontrolled-temperature warehouse can lead to damage and loss.","translation":"敏感な物質を温度管理されていない倉庫に保管すると、損傷や損失につながる可能性があります。"}],"collocations":["uncontrolled-temperature environment","uncontrolled-temperature storage","uncontrolled-temperature conditions","uncontrolled-temperature warehouse"],"synonyms":["unregulated temperature","non-temperature-controlled","ambient temperature"],"antonyms":["controlled-temperature","temperature-regulated","climate-controlled"]},{"part_of_speech":"noun","definition":"温度管理されていない状態","english_definition":"The state of not having temperature regulated or maintained within specific limits.","examples":[{"sentence":"Leaving the samples in uncontrolled-temperature for an extended period invalidated the experiment.","translation":"サンプルを温度管理されていない状態で長時間放置したため、実験が無効になりました。"},{"sentence":"The risk of damage due to uncontrolled-temperature is a major concern for perishable goods.","translation":"温度管理されていないことによる損傷のリスクは、生鮮食品にとって大きな懸念事項です。"}],"collocations":["damage due to uncontrolled-temperature","risk of uncontrolled-temperature","effects of uncontrolled-temperature"],"synonyms":["lack of temperature control","absence of temperature regulation"],"antonyms":["temperature control","temperature regulation"]}],"etymology":{"value":"The term is formed by adding the prefix 'un-' (meaning 'not') to 'controlled-temperature', indicating a lack of temperature regulation.","priority":"N/A"},"pronunciation":{"ipa":"/ˌʌnkənˈtroʊld ˈtɛmpərətʃər/","syllables":"un-con-trolled tem-per-a-ture"},"inflection":{"notes":"As an adjective, it can be used to describe nouns. As a noun, it refers to the state of lacking temperature control."},"usage_notes":{"explanation":"'Uncontrolled-temperature' refers to environments or conditions where the temperature is not actively managed or kept within a specific range. This is often critical for items sensitive to temperature fluctuations, such as medications, food, and certain chemicals.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The uncontrolled temperature room.","correct":"✓ The uncontrolled-temperature room.","note":"Hyphenation is important to correctly modify the noun. 'Uncontrolled temperature' without the hyphen can be grammatically ambiguous."},{"incorrect":"✗ The temperature was uncontrolled.","correct":"✓ The temperature was uncontrolled-temperature.","note":"While grammatically correct, 'The temperature was uncontrolled' is less specific. Using 'uncontrolled-temperature' as an adjective provides more context."}],"priority":"N/A"},"related_words":{"derivatives":["uncontrolled (adjective: not controlled or restrained)","temperature (noun: the degree or intensity of heat present in a substance or object)","control (verb/noun: the power to influence or direct people's behavior or the course of events)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. More commonly used in technical or specialized contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Uncontrolled-temperature' is a technical term used to describe a situation or environment where the temperature is not regulated or maintained within specific limits. It is often used in scientific, medical, or industrial contexts to indicate a potential risk or problem related to temperature-sensitive materials or processes. Understanding this term requires a good grasp of technical vocabulary and the ability to interpret complex concepts related to temperature regulation."},"example_sentences":[{"sentence":"The specimens were ruined due to prolonged exposure to uncontrolled-temperature conditions.","translation":"標本は、温度管理されていない状態に長時間さらされたため、台無しになりました。","type":"adjective","meaning_category":"Temperature regulation"},{"sentence":"The company implemented strict protocols to avoid any instances of uncontrolled-temperature during storage.","translation":"会社は、保管中に温度管理されていない状態が発生するのを避けるために、厳格なプロトコルを実施しました。","type":"noun","meaning_category":"Temperature regulation"}]}