{"word":"bonism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"世界は善が優勢であるという信念、または世界を可能な限り最高のものと見なす哲学","english_definition":"The belief that the world is predominantly good, or the philosophical view that the world is the best of all possible worlds.","examples":[{"sentence":"Leibniz's philosophy is often associated with bonism, as he argued that God created the best possible world.","translation":"ライプニッツの哲学は、神が可能な限り最高の世界を創造したと主張したため、しばしばボニズムと関連付けられます。"},{"sentence":"Some argue that embracing bonism can lead to complacency and a lack of motivation to improve the world.","translation":"ボニズムを受け入れることは、自己満足と世界を改善しようとする意欲の欠如につながる可能性があると主張する人もいます。"}],"collocations":["philosophical bonism","optimistic bonism","religious bonism"],"synonyms":["optimism","meliorism"],"antonyms":["pessimism","dysphemism","malism"]}],"etymology":{"value":"「bon-」はラテン語の「bonus」（良い）に由来し、「-ism」は信念や主義を表す接尾辞です。","priority":"★★☆"},"pronunciation":{"ipa":"ˈboʊnɪzəm","syllables":"bo-nism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"「**bonism**」は、世界が本質的に善である、あるいは可能な限り最高の状態であるという哲学的な信念を指します。この用語は、世界をできるだけ良いものにしようとする「meliorism（改良主義）」や、良い結果を期待する「optimism（楽観主義）」と関連付けられることがあります。しかし、ボニズムは、現状維持を正当化し、改善の努力を妨げる可能性があるという批判もあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced bonism by always being happy.","correct":"✓ He practiced bonism by always believing in the inherent goodness of the world.","note":"ボニズムは単に幸せであることではなく、世界の本質的な善を信じることです。"},{"incorrect":"✗ Bonism is the same as optimism.","correct":"✓ Bonism is related to optimism, but it specifically refers to the belief that the world is predominantly good or the best possible world.","note":"楽観主義は良い結果を期待することですが、ボニズムは世界が本質的に善であるという信念です。"}],"priority":"★★☆"},"related_words":{"derivatives":["bonist (名詞: ボニズムを信じる人)"],"phrasal_verbs":null,"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な哲学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**bonism**」は、世界が基本的に善である、または可能な限り最高の状態であるという哲学的な考え方を表す専門用語です。この言葉は、世界をより良くしようとする改良主義や、良い結果を期待する楽観主義と関連していますが、現状に甘んじて改善の努力を怠る可能性があるという批判もあります。哲学や倫理学の文脈で使われることが多く、日常会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The philosopher defended **bonism** by arguing that even suffering contributes to a greater good.","translation":"その哲学者は、苦しみさえもより大きな善に貢献すると主張して、ボニズムを擁護した。","type":"noun","meaning_category":"哲学"},{"sentence":"Critics of **bonism** point to the existence of evil and suffering as evidence against the idea of a fundamentally good world.","translation":"ボニズムの批判者たちは、悪と苦しみの存在を、根本的に善い世界という考えに反する証拠として指摘する。","type":"noun","meaning_category":"哲学"}]}