{"word":"amberoid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"圧縮された琥珀の模造品、または再生琥珀","english_definition":"A material made by compressing small pieces of amber into a solid mass, used as a substitute for amber.","examples":[{"sentence":"Amberoid is often used in jewelry as a more affordable alternative to natural amber.","translation":"アンベロイドは、天然の琥珀よりも手頃な代替品として、ジュエリーによく使用されます。"},{"sentence":"The antique comb was made of amberoid, not genuine amber.","translation":"そのアンティークの櫛は、本物の琥珀ではなく、アンベロイドで作られていました。"}],"collocations":["pressed amber","reconstituted amber","imitation amber"],"synonyms":["pressed amber","reconstituted amber"],"antonyms":[]}],"etymology":{"value":"'Amber' + '-oid' (resembling).","priority":"★★★"},"pronunciation":{"ipa":"ˈæmbərɔɪd","syllables":"am-ber-oid"},"inflection":{"noun_plural":"amberoids"},"usage_notes":{"explanation":"Amberoid is a man-made material. It's created by taking small pieces of amber, often waste or fragments, and compressing them under high pressure and heat. This process fuses the pieces together, creating a larger, solid piece that resembles natural amber. It's often used in jewelry, electrical insulation, and other applications where the appearance of amber is desired but the cost of natural amber is prohibitive. Because it's made from real amber, it retains some of the properties of natural amber, but it's generally less valuable.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ This is a real amberoid.","correct":"✓ This is amberoid. / ✓ This is a piece of amberoid.","note":"Amberoid is not 'real amber'; it's a substitute. So saying 'real amberoid' is contradictory."},{"incorrect":"✗ Amberoid is found naturally.","correct":"✓ Amberoid is manufactured.","note":"Amberoid is a man-made product, not a naturally occurring substance."}],"priority":"★★☆"},"related_words":{"derivatives":["amber"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amberoid' is a specialized term referring to a manufactured material made from compressed amber fragments. Understanding its meaning requires knowledge of materials science and the distinction between natural and synthetic substances. The term is not commonly encountered in everyday language, making it more suitable for advanced learners or those with specific interests in gemology or material science."},"example_sentences":[{"sentence":"The vintage radio featured knobs made of amberoid.","translation":"そのヴィンテージラジオは、アンベロイド製のつまみが特徴でした。","type":"noun","meaning_category":"material"},{"sentence":"Many inexpensive necklaces are made with amberoid beads.","translation":"多くの安価なネックレスは、アンベロイドのビーズで作られています。","type":"noun","meaning_category":"material"}]}