{"word":"unabsolved","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(人または罪が)赦されていない、免除されていない","english_definition":"not absolved; not forgiven or freed from blame, guilt, or sin.","examples":[{"sentence":"He died unabsolved of his crimes.","translation":"彼は罪を赦されないまま亡くなった。"},{"sentence":"The unabsolved sin weighed heavily on his conscience.","translation":"赦されない罪は彼の良心に重くのしかかった。"}],"collocations":["unabsolved of sin","unabsolved guilt"],"synonyms":["unforgiven","unpardoned","unexonerated","uncleared"],"antonyms":["absolved","forgiven","pardoned","exonerated","cleared"]}],"etymology":{"value":"\"un-\" (not) + \"absolved\". \"Absolved\" comes from Latin \"absolvere\" (to set free, acquit).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəbˈzɒlvd/","syllables":"un-ab-solved"},"inflection":{"notes":"Adjective; no comparative or superlative forms."},"usage_notes":{"explanation":"\"Unabsolved\" is a relatively rare word, typically used in formal or religious contexts to describe someone who has not been forgiven for their sins or wrongdoings. It carries a strong sense of guilt and lack of redemption.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unabsolved problem was difficult to solve.","correct":"✓ The unresolved problem was difficult to solve.","note":"Use \"unresolved\" for problems or issues that haven't been solved, and \"unabsolved\" specifically for guilt, sins, or crimes that haven't been forgiven."}],"priority":"★☆☆"},"related_words":{"derivatives":["absolve (verb): to free from guilt or blame.","absolution (noun): formal release from guilt or punishment."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unabsolved\" is a formal and uncommon term. It means that someone has not been forgiven for something they have done wrong. This word is often used in religious or legal contexts to describe a state of unforgiveness or lack of absolution."},"example_sentences":[{"sentence":"The ghost roamed the earth, forever unabsolved of its earthly sins.","translation":"その幽霊は、現世での罪を永遠に赦されないまま、地上を彷徨い続けた。","type":"adjective","meaning_category":"not forgiven"},{"sentence":"He felt unabsolved, even after confessing his wrongdoing.","translation":"彼は自分の悪事を告白した後でさえ、赦されていないと感じた。","type":"adjective","meaning_category":"not freed from guilt"}]}