{"word":"nonpredestination","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"予定説の否定、非予定説","english_definition":"The belief or doctrine that God does not predetermine all events and outcomes, including the salvation or damnation of individuals.","examples":[{"sentence":"Theological debates often revolve around the concepts of predestination and nonpredestination.","translation":"神学的な議論は、予定説と非予定説の概念を中心に展開されることが多い。"},{"sentence":"Some religious denominations adhere to a doctrine of nonpredestination, emphasizing free will.","translation":"一部の宗派は、自由意志を強調する非予定説の教義を支持している。"}],"collocations":["doctrine of nonpredestination","belief in nonpredestination","theological view of nonpredestination"],"synonyms":["free will","libertarian free will","conditional election"],"antonyms":["predestination","determinism","fatalism"]},{"part_of_speech":"noun","definition":"（一般的に）あらかじめ定められていないこと、運命によって決定されていないこと","english_definition":"The state or condition of not being predetermined or destined.","examples":[{"sentence":"His success was due to hard work and talent, not nonpredestination.","translation":"彼の成功は、非予定説ではなく、勤勉と才能によるものだった。"}],"collocations":["lack of predestination","absence of predetermination"],"synonyms":["indeterminacy","contingency","unpredictability"],"antonyms":["predetermination","destiny","fate"]}],"etymology":{"value":"\"non-\" (否定の接頭辞) + \"predestination\" (予定説)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌpriːˌdɛstɪˈneɪʃən/","syllables":"non-pre-des-ti-na-tion"},"inflection":{"noun_plural":"nonpredestinations"},"usage_notes":{"explanation":"\"Nonpredestination\" is primarily used in theological contexts to contrast with the doctrine of predestination. It emphasizes the role of free will and individual choice in determining one's fate, particularly in relation to salvation. Outside of theology, it can refer to the general idea that events are not predetermined.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He believed in non-predestination.","correct":"✓ He believed in nonpredestination.","note":"Hyphenation is generally avoided unless necessary for clarity. It's more common to write it as one word. However, using a hyphen is not grammatically incorrect, just less common."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["Arminianism","Calvinism","free will","determinism","theology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"nonpredestination\" is a complex theological term. It is formed by adding the prefix \"non-\" to \"predestination,\" which means the belief that God has predetermined all events, including who will be saved. Therefore, \"nonpredestination\" refers to the belief that God does not predetermine these events and that individuals have free will to choose their own path. This term is primarily used in religious and philosophical discussions and requires a strong understanding of theological concepts to fully grasp its meaning."},"example_sentences":[{"sentence":"The concept of nonpredestination allows for individual agency in spiritual matters.","translation":"非予定説の概念は、霊的な問題における個人の主体性を可能にする。","type":"general","meaning_category":"theology"},{"sentence":"A belief in nonpredestination often leads to a greater emphasis on personal responsibility.","translation":"非予定説を信じることは、しばしば個人的な責任をより重視することにつながる。","type":"general","meaning_category":"theology"}]}