{"word":"tunist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(まれ) 調律師、音律研究家","english_definition":"(rare) A person who tunes musical instruments; a person who studies musical tuning systems.","examples":[{"sentence":"He was known as a skilled tunist, able to coax the most beautiful sounds from any piano.","translation":"彼は熟練した調律師として知られ、どんなピアノからでも最も美しい音色を引き出すことができた。"},{"sentence":"The tunist meticulously adjusted each string to achieve perfect harmony.","translation":"調律師は完璧なハーモニーを実現するために、各弦を細心の注意を払って調整した。"},{"sentence":"As a tunist, she was fascinated by the mathematical ratios underlying musical scales.","translation":"音律研究家として、彼女は音階の根底にある数学的比率に魅了されていた。"}],"collocations":["piano tunist","organ tunist","instrument tunist"],"synonyms":["tuner","harmonist","musicologist"],"antonyms":[]}],"etymology":{"value":"'Tune' + '-ist'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtjuːnɪst/","syllables":"tu-nist"},"inflection":{"noun_plural":"tunists"},"usage_notes":{"explanation":"The word 'tunist' is relatively rare. The more common term for someone who tunes instruments is 'tuner'. 'Tunist' may be used to emphasize a deeper understanding or theoretical knowledge of tuning systems, rather than just the practical skill of tuning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a tunist of cars.","correct":"✓ He is a mechanic who tunes cars.","note":"'Tunist' refers to musical instruments, not engines."}],"priority":"★★☆"},"related_words":{"derivatives":["tune","tuning","tuner"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tunist' is a rare word, primarily used to describe someone who tunes musical instruments, especially with a deep understanding of musical tuning systems. It is less common than the word 'tuner.'"},"example_sentences":[{"sentence":"The old church relied on a traveling tunist to maintain its pipe organ.","translation":"その古い教会は、パイプオルガンを維持するために巡回調律師に頼っていた。","type":"noun","meaning_category":"調律師"},{"sentence":"As a dedicated tunist, he spent years researching historical temperament systems.","translation":"熱心な音律研究家として、彼は長年、歴史的な音律システムを研究した。","type":"noun","meaning_category":"音律研究家"}]}