{"word":"Chandrakhi","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of traditional Indian cap or hat, typically worn in Himachal Pradesh. It is known for its distinctive shape and decorative elements.","english_definition":"A traditional cap or hat worn in Himachal Pradesh, India, characterized by its unique design and embellishments.","examples":[{"sentence":"He wore a colorful Chandrakhi to the festival.","translation":"彼はお祭りにカラフルなチャンドラキをかぶって行った。"},{"sentence":"The Chandrakhi is an important part of the traditional attire in this region.","translation":"チャンドラキはこの地域の伝統的な服装の重要な一部です。"}],"collocations":["wear a Chandrakhi","traditional Chandrakhi","Himachali Chandrakhi"],"synonyms":["Himachali cap","Indian cap"],"antonyms":[]}],"etymology":{"value":"The name 'Chandrakhi' likely derives from the local language of Himachal Pradesh, possibly related to the moon ('Chandra' in Sanskrit) due to its shape or decorative elements.","priority":"★★☆"},"pronunciation":{"ipa":"/tʃʌn.drɑː.kiː/","syllables":"Chun-draa-khee"},"inflection":{"notes":"Noun, plural form is Chandrakhis or Chandrakhies."},"usage_notes":{"explanation":"The Chandrakhi is more than just a head covering; it's a cultural symbol in Himachal Pradesh. The design and ornamentation can vary by region and community, reflecting local traditions and craftsmanship. It is often worn during festivals, weddings, and other special occasions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a Chandrakhi on his feet.","correct":"✓ He wore a Chandrakhi on his head.","note":"Chandrakhi is a type of headwear, so it is worn on the head, not the feet."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Topi (general term for hat in Hindi/Urdu)","Pahari culture (culture of the Himalayan region)","Himachal Pradesh (Indian state where Chandrakhi is commonly worn)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specific cultural item)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chandrakhi' is a specialized term referring to a specific type of traditional headwear from Himachal Pradesh, India. Understanding its meaning requires cultural context related to the region's customs and attire. It is not a commonly used word outside of discussions about Himachali culture.","priority":"★★☆"},"example_sentences":[{"sentence":"The artisan carefully embroidered the Chandrakhi with intricate designs.","translation":"職人は複雑なデザインでチャンドラキを丁寧に刺繍した。","type":"general","meaning_category":"description"},{"sentence":"During the wedding procession, the groom proudly sported a Chandrakhi.","translation":"結婚式の行列の間、新郎は誇らしげにチャンドラキを身に着けていた。","type":"cultural","meaning_category":"usage"}]}