{"word":"Alsike","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"シロツメクサに似たマメ科の植物","english_definition":"A species of clover (Trifolium hybridum) resembling white clover, often grown as a forage crop.","examples":[{"sentence":"Alsike clover is often used in pasture mixes for livestock.","translation":"シロツメクサは、家畜用の牧草混合物によく使用されます。"},{"sentence":"Alsike can tolerate slightly acidic soils.","translation":"シロツメクサはわずかに酸性の土壌に耐えることができます。"}],"collocations":["alsike clover","trifolium hybridum","forage crop","pasture mix"],"synonyms":["Trifolium hybridum"],"antonyms":[]}],"etymology":{"value":"The name 'alsike' comes from the Swedish village of Alsike, where the plant was first cultivated.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈælsaɪk/","syllables":"Al-sike"},"inflection":{"noun_plural":"alsikes"},"usage_notes":{"explanation":"Alsike is primarily used in agricultural contexts when discussing forage or pasture crops. It is less commonly encountered in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted alsikes in my garden for decoration.","correct":"✓ I planted white clover in my garden for decoration.","note":"While alsike is a type of clover, white clover is more commonly used for decorative purposes in gardens."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Alsike' is a specialized term primarily used in agricultural or botanical contexts. Understanding its usage requires familiarity with farming practices and plant taxonomy. It is not typically encountered in general English conversation or texts."},"example_sentences":[{"sentence":"The farmer planted a mix of grasses and alsike to improve the pasture.","translation":"農家は牧草を改良するために草とシロツメクサの混合物を植えました。","type":"noun","meaning_category":"plant"},{"sentence":"Alsike is a good source of nectar for bees.","translation":"シロツメクサはミツバチにとって良い蜜源です。","type":"noun","meaning_category":"plant"}]}