{"word":"undertribe","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A subdivision of a tribe; a smaller group within a larger tribal structure.","english_definition":"A subdivision of a tribe; a smaller group within a larger tribal structure.","examples":[{"sentence":"The anthropologist studied the various undertribes within the Amazonian tribe.","translation":"人類学者は、アマゾンの部族内の様々な下位部族を研究した。"},{"sentence":"Each undertribe had its own distinct customs and traditions.","translation":"それぞれのサブ部族は、独自のはっきりとした慣習と伝統を持っていた。"}],"collocations":["belong to an undertribe","undertribe customs","undertribe traditions"],"synonyms":["subtribe","clan","sept"],"antonyms":["tribe"]}],"etymology":{"value":"Formed from 'under-' + 'tribe'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌndərˌtraɪb/","syllables":"un-der-tribe"},"inflection":{"noun_plural":"undertribes"},"usage_notes":{"explanation":"The term 'undertribe' is relatively rare and may not be widely recognized. 'Subtribe' is a more common synonym. It refers to a smaller, more specific group within a larger tribal organization, often based on kinship, geography, or shared customs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undertribe was larger than the main tribe.","correct":"✓ The undertribe was smaller than the main tribe.","note":"An undertribe is, by definition, a smaller subdivision of a tribe."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["tribe","subtribe","clan","sept","tribal","tribesman"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Rare)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'undertribe' is a specialized term primarily used in anthropology and related fields. Its meaning is relatively straightforward, indicating a subdivision within a larger tribal structure. Due to its infrequent usage, it's more likely to be encountered in academic texts or specialized discussions."},"example_sentences":[{"sentence":"The different undertribes often competed for resources within the tribal territory.","translation":"異なる下位部族は、部族の領土内で資源をめぐってしばしば競争した。","type":"noun","meaning_category":"subdivision of a tribe"},{"sentence":"Understanding the relationships between the undertribes is crucial for comprehending the tribe's social dynamics.","translation":"下位部族間の関係を理解することは、部族の社会力学を理解するために重要である。","type":"noun","meaning_category":"subdivision of a tribe"}]}