{"word":"Red-Polled","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(牛について)赤毛で角のない","english_definition":"(of cattle) having red coat and lacking horns.","examples":[{"sentence":"The farmer raises Red-Polled cattle because they are docile and produce good milk.","translation":"その農家は、おとなしくて良い牛乳を生産するため、赤毛で角のない牛を飼育している。"}],"collocations":["Red-Polled cattle","Red-Polled breed"],"synonyms":["hornless red","red and polled"],"antonyms":["horned","black-polled"]},{"part_of_speech":"noun","definition":"赤毛で角のない牛の品種","english_definition":"a breed of red, hornless beef cattle.","examples":[{"sentence":"The Red-Polled is a dual-purpose breed, used for both beef and dairy production.","translation":"赤毛で角のない牛は、牛肉と乳製品の両方に使用される兼用種です。"}],"collocations":["Red-Polled bull","Red-Polled cow"],"synonyms":["Red Polled breed"],"antonyms":[]}],"etymology":{"value":"'Red' refers to the color of the coat, and 'polled' means hornless or lacking horns.","priority":"★★★"},"pronunciation":{"ipa":"/ˌrɛdˈpoʊld/","syllables":"Red-Polled"},"inflection":{"notes":"The term 'Red-Polled' can function as both an adjective and a noun. When used as an adjective, it describes the characteristics of the cattle. When used as a noun, it refers to the breed of cattle."},"usage_notes":{"explanation":"'Red-Polled' is primarily used in the context of cattle farming and agriculture. It specifically describes a breed of cattle known for its red coat and lack of horns. The term is often used in agricultural literature, breed descriptions, and farming discussions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The red polled cow is black.","correct":"✓ The Red-Polled cow is red.","note":"Red-Polled cattle are characterized by their red coat color, so describing them as black would be incorrect."},{"incorrect":"✗ The Red-Polled cow has horns.","correct":"✓ The Red-Polled cow does not have horns.","note":"The term 'polled' means hornless, so stating that a Red-Polled cow has horns is contradictory."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["cattle","breed","polled","hornless","livestock","agriculture"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Red-Polled' is a specialized term used in the context of animal husbandry, specifically referring to a breed of cattle. Understanding this term requires some familiarity with agricultural vocabulary. It describes cattle that are both red in color and naturally hornless. This term is more likely to be encountered in texts related to farming, animal science, or breed descriptions.","priority":"★☆☆"},"example_sentences":[{"sentence":"Many farmers prefer Red-Polled cattle because they are easier to manage.","translation":"多くの農家は、管理が容易な赤毛で角のない牛を好む。","type":"adjective","meaning_category":"description"},{"sentence":"The Red-Polled is known for its high-quality beef.","translation":"赤毛で角のない牛は、高品質の牛肉で知られています。","type":"noun","meaning_category":"breed"}]}