{"word":"Manubaliste","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A type of large crossbow or ballista that was operated by hand or a lever.","english_definition":"A type of large crossbow or ballista that was operated by hand or a lever, used in ancient and medieval times.","examples":[{"sentence":"The Roman army used manubalistes to defend their fortifications.","translation":"ローマ軍は要塞を守るためにマヌバリストを使用した。"},{"sentence":"The manubaliste was more portable than larger siege engines.","translation":"マヌバリストは、より大型の攻城兵器よりも可搬性に優れていた。"}],"collocations":["operate a manubaliste","Roman manubaliste","medieval manubaliste"],"synonyms":["ballista","crossbow","siege engine"],"antonyms":[]}],"etymology":{"value":"From Latin *manus* (hand) + *ballista* (ballista, an ancient military engine).","priority":"★★☆"},"pronunciation":{"ipa":"/ma.ny.ba.list/","syllables":"ma-nu-ba-list"},"inflection":{"noun_plural":"manubalistes"},"usage_notes":{"explanation":"The term *manubaliste* is primarily used in historical contexts when discussing ancient or medieval warfare. It refers to a specific type of artillery that was smaller and more mobile than larger siege weapons but still capable of launching projectiles with significant force.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a manubalist to hunt deer.","correct":"✓ He used a crossbow to hunt deer.","note":"A manubaliste was a military weapon, not typically used for hunting. A crossbow is a more appropriate term for a hunting weapon."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word *manubaliste* is a specialized term related to ancient military history. It is unlikely to be encountered outside of academic or historical contexts. Understanding the term requires familiarity with Roman and medieval warfare tactics and technology."},"example_sentences":[{"sentence":"The archaeological dig uncovered fragments of a Roman manubaliste.","translation":"その考古学的発掘調査で、ローマのマヌバリストの破片が発見された。","type":"noun","meaning_category":"historical weapon"},{"sentence":"Illustrations from the period depict soldiers using a manubaliste to target enemy troops.","translation":"当時のイラストには、兵士がマヌバリストを使用して敵軍を標的にしている様子が描かれている。","type":"noun","meaning_category":"historical weapon"}]}