{"word":"sharkishly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"サメのように、またはサメを思わせる様子で","english_definition":"In a manner resembling a shark; in a predatory or menacing way.","examples":[{"sentence":"He grinned sharkishly, revealing a row of sharp teeth.","translation":"彼はサメのようにニヤリと笑い、鋭い歯並びを見せた。"},{"sentence":"The lawyer circled the witness sharkishly, ready to pounce on any inconsistency.","translation":"弁護士は証人の周りをサメのように回り込み、矛盾点があればすぐに食いつこうと待ち構えていた。"}],"collocations":["grin sharkishly","circle sharkishly","move sharkishly"],"synonyms":["predatorily","menacingly","aggressively","threateningly"],"antonyms":["gently","kindly","benignly"]}],"etymology":{"value":"The word \"sharkishly\" is derived from the word \"shark\" by adding the suffix \"-ish\" and then \"-ly\". The suffix \"-ish\" means \"resembling\" or \"having the characteristics of\", and the suffix \"-ly\" turns the adjective \"sharkish\" into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɑːrkɪʃli/","syllables":"shark-ish-ly"},"inflection":{"notes":"This is an adverb, so it does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Sharkishly\" is used to describe actions or behaviors that are reminiscent of a shark, typically in a negative way. It suggests a predatory, aggressive, or menacing manner. The word is relatively uncommon and is often used in descriptive writing to create a vivid image.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He swam sharkishly in the pool.","correct":"✓ He swam like a shark in the pool.","note":"While \"sharkishly\" can be used to describe movement, it's more commonly used to describe facial expressions or behaviors that imply predatory intent. Describing swimming style is better done with \"like a shark.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["shark (noun)","sharkish (adjective)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Word not commonly found in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"sharkishly\" is a relatively uncommon adverb used to describe actions or behaviors that resemble those of a shark, typically in a predatory or menacing way. It is most likely to be encountered in descriptive writing or literature. Understanding the meaning of \"shark\" and the function of the suffixes \"-ish\" and \"-ly\" is helpful in deciphering the word's meaning. "},"example_sentences":[{"sentence":"The CEO smiled sharkishly as he announced the company's record profits.","translation":"CEOはサメのようにニヤリと笑い、会社の記録的な利益を発表した。","type":"adverb","meaning_category":"predatory manner"},{"sentence":"The reporter questioned the politician sharkishly, searching for any sign of weakness.","translation":"記者は政治家にサメのように質問し、弱点を探していた。","type":"adverb","meaning_category":"menacing manner"}]}