{"word":"encyclopedism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"百科事典主義、百科全書主義：知識を体系的に網羅しようとする主義、または百科事典的な知識の広範さ","english_definition":"The principle or practice of systematically encompassing the whole circle of learning; comprehensive knowledge.","examples":[{"sentence":"The Renaissance was a period of great encyclopedism, with scholars attempting to master all fields of knowledge.","translation":"ルネサンスは偉大な百科事典主義の時代であり、学者たちは知識のあらゆる分野を習得しようと試みました。"},{"sentence":"His encyclopedism was evident in his ability to discuss a wide range of topics with expertise.","translation":"彼の百科事典主義は、幅広いトピックを専門知識を持って議論できる能力に明らかでした。"},{"sentence":"Modern encyclopedism is often facilitated by digital resources and collaborative platforms.","translation":"現代の百科事典主義は、デジタルリソースと共同プラットフォームによって促進されることが多いです。"}],"collocations":["display encyclopedism","pursue encyclopedism","digital encyclopedism","historical encyclopedism"],"synonyms":["polymathy","erudition","scholarship","omniscientism","universal knowledge"],"antonyms":["ignorance","specialization","narrowness","limited knowledge"]},{"part_of_speech":"noun","definition":"百科事典編纂、百科事典の作成","english_definition":"The compilation or production of encyclopedias.","examples":[{"sentence":"The project required years of encyclopedism to complete.","translation":"そのプロジェクトを完了するには、長年の百科事典編纂が必要でした。"},{"sentence":"Encyclopedism has evolved significantly with the advent of online encyclopedias.","translation":"百科事典編纂は、オンライン百科事典の出現により大きく進化しました。"},{"sentence":"The history of encyclopedism reflects changing attitudes towards knowledge and its organization.","translation":"百科事典編纂の歴史は、知識とその組織化に対する変化する態度を反映しています。"}],"collocations":["historical encyclopedism","modern encyclopedism","collaborative encyclopedism","online encyclopedism"],"synonyms":["lexicography","compilation","codification","documentation"],"antonyms":["disorganization","randomness","unsystematic"]}],"etymology":{"value":"Formed from \"encyclopedia\" (from Medieval Latin *encyclopaedia*, from Greek *enkyklios paideia* 'general education') + \"-ism\" (denoting a principle, practice, or system).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌsaɪkləˈpiːdɪzəm/","syllables":"en-cy-clo-pe-dism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Encyclopedism\" refers both to the pursuit of comprehensive knowledge across all fields and to the practice of creating encyclopedias. It can describe an individual's wide-ranging knowledge or the systematic effort to compile and organize knowledge in a comprehensive reference work. The term often implies a structured and organized approach to knowledge acquisition or presentation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a person of encyclopedistic.","correct":"✓ He is a person of encyclopedic knowledge.","note":"\"Encyclopedistic\" is an adjective, while \"encyclopedism\" is a noun. Use the adjective to describe knowledge and the noun to describe the principle or practice."},{"incorrect":"✗ Encyclopedism is only about reading encyclopedias.","correct":"✓ Encyclopedism involves a broad and systematic approach to acquiring knowledge, which may include reading encyclopedias but also encompasses other forms of learning.","note":"Encyclopedism is not merely about reading encyclopedias but about a broader pursuit of comprehensive knowledge."}],"priority":"★★☆"},"related_words":{"derivatives":["encyclopedic (adjective)","encyclopedist (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Encyclopedism\" is a term that describes the principle or practice of seeking comprehensive knowledge across all fields of learning, or the act of creating encyclopedias. It's a relatively uncommon word, often used in academic or intellectual contexts to describe a broad and systematic approach to knowledge. Understanding this term requires a good grasp of abstract concepts and a familiarity with the history of knowledge organization."},"example_sentences":[{"sentence":"His **encyclopedism** made him a valuable asset to the research team.","translation":"彼の百科事典主義は、彼を研究チームにとって貴重な財産にしました。","type":"noun","meaning_category":"comprehensive knowledge"},{"sentence":"The rise of digital media has greatly impacted the practice of **encyclopedism**.","translation":"デジタルメディアの台頭は、百科事典編纂の実践に大きな影響を与えました。","type":"noun","meaning_category":"encyclopedia creation"}]}