{"word":"almanac","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"暦、年鑑、便覧","english_definition":"an annual publication that includes weather forecasts, astronomical information (such as the rising and setting of the sun and moon, eclipses, tide tables), and other miscellaneous information.","examples":[{"sentence":"The farmer consulted the almanac for the best time to plant his crops.","translation":"農夫は作物を植える最適な時期を知るために暦を参考にした。"},{"sentence":"The Old Farmer's Almanac is a popular source of weather predictions.","translation":"オールド・ファーマーズ・アルマナックは、天気予報の一般的な情報源である。"},{"sentence":"The almanac provides a wealth of information on astronomical events.","translation":"その年鑑は、天文現象に関する豊富な情報を提供している。"}],"collocations":["farmers' almanac","nautical almanac","astronomical almanac","consult an almanac","check an almanac","use an almanac","The Old Farmer's Almanac"],"synonyms":["calendar","yearbook","annual","compendium","handbook","directory"],"antonyms":[]}],"etymology":{"value":"中世ラテン語の *almanachus* から派生し、おそらくアラビア語の *al-manākh* (الْمَنَاخ) 「気候」に由来すると考えられている。このアラビア語の単語は、動詞 *nākh* (ناخ) 「（ラクダが）ひざまずく」と関連しており、気候が安定して定住に適している場所を指すという説がある。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈælmənæk/","syllables":"al-ma-nac"},"inflection":{"noun_plural":"almanacs"},"usage_notes":{"explanation":"An **almanac** is primarily a reference book published annually, containing a variety of statistical, tabular, and general information. It often includes long-range weather predictions, astronomical data (such as sunrise and sunset times, moon phases, eclipses), tide tables, planting guides for farmers, and other useful facts. The information is typically organized by date. While some almanacs focus on general information, others specialize in particular fields, such as sports or finance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a calendar to predict the weather, not an almanac.","correct":"✓ He used an almanac to predict the weather, not a calendar.","note":"While both calendars and almanacs provide dates, almanacs contain much more detailed information, including weather forecasts and astronomical data. Calendars primarily display dates and holidays."},{"incorrect":"✗ I read the almanac on my phone.","correct":"✓ I read the almanac on my computer. / ✓ I read the online almanac.","note":"Traditionally, almanacs are printed books. However, many are now available online. Using 'phone' is not wrong, but less common than 'computer' or specifying 'online almanac'."}],"priority":"★★☆"},"related_words":{"derivatives":["almanack (archaic spelling)"],"idioms_phrases":[],"related_terms":["calendar","directory","handbook","yearbook"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"almanac\" refers to a specific type of reference book published every year. It's not something people use every day, so it's considered a B2 level word. Almanacs contain information like weather forecasts, astronomical data (sunrise, sunset, moon phases), and other facts that are useful for planning or reference. Think of it as a combination of a calendar, weather guide, and general information source all in one book. It's more detailed than a simple calendar."},"example_sentences":[{"sentence":"The sailors used a nautical **almanac** to navigate the ship.","translation":"船乗りたちは船を航海するために航海年鑑を使った。","type":"noun","meaning_category":"暦・年鑑"},{"sentence":"According to the **almanac**, there will be a full moon next week.","translation":"年鑑によると、来週満月になるそうだ。","type":"noun","meaning_category":"暦・年鑑"},{"sentence":"Farmers rely on the **almanac** to determine the best planting dates.","translation":"農家は最適な作付け時期を決定するために年鑑を頼りにしている。","type":"noun","meaning_category":"暦・年鑑"}]}