{"word":"gun-boat","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"砲艦","english_definition":"A small armed naval vessel, typically used for patrolling or riverine warfare.","examples":[{"sentence":"The gun-boat patrolled the river, ensuring the safety of the trade routes.","translation":"砲艦は河川を巡回し、交易路の安全を確保した。"},{"sentence":"The colonial powers used gun-boats to project their influence in distant territories.","translation":"植民地勢力は、遠隔地での影響力を誇示するために砲艦を使用した。"}],"collocations":["river gun-boat","coastal gun-boat","patrol gun-boat"],"synonyms":["armed vessel","warship","patrol boat"],"antonyms":[]}],"etymology":{"value":"Compound word formed from \"gun\" (referring to the vessel's armament) and \"boat\" (a small vessel).","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡʌnboʊt","syllables":"gun-boat"},"inflection":{"noun_plural":"gun-boats"},"usage_notes":{"explanation":"Gun-boats are typically small, maneuverable vessels equipped with one or more guns. They were historically used for coastal defense, river patrols, and projecting naval power in areas where larger warships could not operate effectively. The term is less commonly used today as naval technology has evolved.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gun-boat was a large battleship.","correct":"✓ The gun-boat was smaller than a battleship.","note":"Gun-boats are typically small vessels, not large battleships."}],"priority":"★☆☆"},"related_words":{"derivatives":["gunboat diplomacy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"gun-boat\" refers to a specific type of small, armed naval vessel used historically for patrolling and projecting power in coastal or riverine environments. Understanding the term requires some knowledge of naval history and terminology. The concept of \"gunboat diplomacy\" is also related, referring to the use of naval power to coerce or intimidate other nations."},"example_sentences":[{"sentence":"The old black and white film showed a gun-boat sailing up the Yangtze River.","translation":"昔の白黒映画には、砲艦が揚子江を航行する様子が映っていた。","type":"noun","meaning_category":"vessel"},{"sentence":"The small nation feared the arrival of the foreign power's gun-boat.","translation":"その小国は、外国勢力の砲艦の到着を恐れた。","type":"noun","meaning_category":"vessel"}]}