{"word":"Pityrogramma","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オシダ科の植物の一属","english_definition":"A genus of ferns in the family Pteridaceae, known for their powdery coating on the undersides of their fronds.","examples":[{"sentence":"Pityrogramma species are often found in disturbed or tropical environments.","translation":"Pityrogramma属の植物は、攪乱された環境や熱帯環境によく見られる。"}],"collocations":["Pityrogramma calomelanos (コガネシダ)","Pityrogramma argentea (silver fern)"],"synonyms":["silver fern","gold fern"],"antonyms":[]}],"etymology":{"value":"The name Pityrogramma comes from the Greek words 'pityron' meaning bran or scale and 'gramma' meaning writing, referring to the powdery coating on the fronds.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɪtɪˈroʊɡrəmə/","syllables":"Pit-y-ro-gram-ma"},"inflection":{"noun_plural":"Pityrogrammas"},"usage_notes":{"explanation":"Pityrogramma is a genus name used in scientific classification. When referring to a specific species, the genus name is followed by the species name (e.g., Pityrogramma calomelanos). It is most commonly used in botanical or horticultural contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Pityrogramma are a beautiful fern.","correct":"✓ Pityrogramma is a beautiful fern genus.","note":"Pityrogramma is a genus (group of species), so the singular form of the verb is more appropriate when referring to the genus as a whole. When referring to multiple species within the genus, the plural verb form may be used."}],"priority":"★★☆"},"related_words":{"derivatives":["Pteridaceae (オシダ科)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Pityrogramma' is a scientific term used in botany and horticulture. Understanding this term requires familiarity with biological classification systems and botanical terminology. The word itself is derived from Greek roots, and its usage is generally limited to academic or specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The golden powder on the underside of Pityrogramma fronds is a distinctive feature.","translation":"コガネシダの葉の裏側の金色の粉は特徴的な特徴です。","type":"noun","meaning_category":"plant genus"},{"sentence":"Several species of Pityrogramma are cultivated as ornamental plants.","translation":"Pityrogramma属のいくつかの種は観賞植物として栽培されています。","type":"noun","meaning_category":"plant genus"}]}