{"word":"sidebands","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(無線通信)側波帯","english_definition":"(in radio communication) a band of frequencies containing power, which are the result of the modulation process.","examples":[{"sentence":"The bandwidth of the signal is determined by the separation of the sidebands.","translation":"信号の帯域幅は、側波帯の分離によって決定されます。"},{"sentence":"Single-sideband modulation transmits only one sideband to conserve power and bandwidth.","translation":"単側波帯変調は、電力と帯域幅を節約するために、片方の側波帯のみを送信します。"}],"collocations":["upper sideband (USB)","lower sideband (LSB)","single sideband (SSB)","double sideband (DSB)","sideband frequency","sideband power"],"synonyms":["modulation products","frequency components"],"antonyms":["carrier frequency"],"notes":"Sidebands occur above and below the carrier frequency.","related_terms":["carrier wave","modulation","frequency","bandwidth","spectrum analyzer"]}],"etymology":{"value":"Formed from 'side' + 'band', referring to the bands of frequencies on either side of the carrier frequency in a modulated signal.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsaɪdˌbændz/","syllables":"side-bands"},"inflection":{"noun_plural":"sidebands"},"usage_notes":{"explanation":"'Sidebands' is a plural noun referring to the bands of frequencies that result from the modulation of a carrier wave. They are located on either side of the carrier frequency. The concept is primarily used in the context of radio communications and signal processing. The bandwidth and power distribution within the sidebands are important characteristics of a modulated signal.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sideband is important for modulation.","correct":"✓ The sidebands are important for modulation.","note":"'Sidebands' is typically used in the plural because there are usually two sidebands (upper and lower) resulting from modulation."},{"incorrect":"✗ Side band is above the carrier.","correct":"✓ Sidebands are above and below the carrier.","note":"Sidebands exist both above and below the carrier frequency, not just above."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["amplitude modulation (AM)","frequency modulation (FM)","phase modulation (PM)","spectrum","signal processing","radio frequency (RF)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sidebands' is a technical term used in the field of radio communication and signal processing. It refers to the bands of frequencies that appear on either side of the carrier frequency when a signal is modulated. Understanding sidebands requires knowledge of modulation techniques such as amplitude modulation (AM) and frequency modulation (FM). The concept is typically encountered in advanced electronics or telecommunications courses and literature.","priority":"★★☆"},"example_sentences":[{"sentence":"The spectrum analyzer showed strong sidebands indicating significant modulation.","translation":"スペクトラムアナライザは、顕著な変調を示す強い側波帯を示しました。","type":"noun","meaning_category":"無線通信"},{"sentence":"In amplitude modulation, the sidebands contain the information being transmitted.","translation":"振幅変調では、側波帯に送信される情報が含まれています。","type":"noun","meaning_category":"無線通信"},{"sentence":"Single-sideband transmission suppresses one sideband to improve efficiency.","translation":"単側波帯伝送は、効率を向上させるために一方の側波帯を抑制します。","type":"noun","meaning_category":"無線通信"}]}