{"word":"hiant","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(言語学)母音連続の、母音連結の","english_definition":"(linguistics) having a hiatus; characterized by hiatus.","examples":[{"sentence":"The word 'cooperate' is hiant.","translation":"'cooperate'という単語は母音連続である。"},{"sentence":"Hiant words are sometimes avoided in poetry.","translation":"母音連続の単語は詩では避けられることがある。"}],"collocations":["hiant sequence","hiant word","hiant pronunciation"],"synonyms":["vocalic","vowel-linked"],"antonyms":["non-hiant"],"notes":"Used in linguistics to describe words or sequences where two vowels come together without an intervening consonant."}],"etymology":{"value":"From Latin 'hians', present participle of 'hiare' meaning 'to gape, yawn, open wide'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhaɪənt/","syllables":"hi-ant"},"inflection":{"notes":"Adjective, so it has comparative and superlative forms (more hiant, most hiant), although they are rarely used."},"usage_notes":{"explanation":"The term 'hiant' is primarily used in linguistics, specifically phonetics and phonology, to describe the presence of a hiatus. A hiatus occurs when two vowel sounds appear consecutively in adjacent syllables, without an intervening consonant. This can sometimes be avoided in pronunciation through elision or the insertion of a glide.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sentence is hiant because it is long.","correct":"✓ The sentence contains a hiant word because two vowels are next to each other without a consonant.","note":"'Hiant' refers specifically to the presence of a vowel hiatus, not to the length of a sentence."}],"priority":"★☆☆"},"related_words":{"derivatives":["hiatus (noun): a pause or gap in a sequence, series, or process. In phonetics, it refers to the juxtaposition of two vowels without an intervening consonant."],"related_terms":["elision","glide","vowel","consonant","diphthong"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hiant' is a technical term used in linguistics to describe a specific phonetic phenomenon. It refers to the occurrence of two vowel sounds in sequence, without an intervening consonant, across syllable boundaries. This term is not commonly used outside of academic contexts related to phonetics and phonology."},"example_sentences":[{"sentence":"The pronunciation of 'naive' is often hiant.","translation":"'naive'の発音はしばしば母音連続である。","type":"adjective","meaning_category":"母音連続の"},{"sentence":"The hiant sequence in 'cooperate' can be resolved by inserting a glide.","translation":"'cooperate'の母音連続は、渡り音を挿入することで解消できる。","type":"adjective","meaning_category":"母音連続の"}]}