{"word":"Pseudoscorpionida","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カニムシ目","english_definition":"An order of arachnids known as pseudoscorpions, false scorpions or book scorpions. They are small arachnids with a flat, pear-shaped body and pincers that resemble those of scorpions, but they lack a tail and sting.","examples":[{"sentence":"Pseudoscorpionida are often found in leaf litter, under bark, or in books.","translation":"カニムシ目は落ち葉の中、樹皮の下、または本の中でよく見られる。"}],"collocations":["pseudoscorpion venom","pseudoscorpion habitat","pseudoscorpion taxonomy"],"synonyms":["false scorpions","book scorpions"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'pseudo' (false) and 'scorpion' referring to their scorpion-like appearance, and the suffix '-ida' which is commonly used to denote a taxonomic order.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊskɔːrˈpɪɒnɪdə/","syllables":"pseu-do-scor-pi-on-i-da"},"inflection":{"noun_plural":"Pseudoscorpionidas"},"usage_notes":{"explanation":"'Pseudoscorpionida' is the scientific name for the order of pseudoscorpions. When referring to a single pseudoscorpion, the term 'pseudoscorpion' is used. In scientific contexts, 'Pseudoscorpionida' is used to refer to the entire group.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Pseudoscorpionida in my garden.","correct":"✓ I saw a pseudoscorpion in my garden.","note":"Use 'pseudoscorpion' for a single individual, and 'Pseudoscorpionida' when referring to the order as a whole."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudoscorpion (noun: a single arachnid from the order Pseudoscorpionida)","arachnid (noun: a class of arthropods that includes spiders, scorpions, mites, and ticks)","order (noun: a taxonomic rank used in the classification of organisms)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pseudoscorpionida' is a scientific term used in biology and zoology to refer to the order of pseudoscorpions. This term is typically encountered in academic papers, textbooks, and scientific discussions related to arachnids and their classification. Understanding this term requires familiarity with biological taxonomy and scientific nomenclature."},"example_sentences":[{"sentence":"The order **Pseudoscorpionida** includes over 3,000 species of small arachnids.","translation":"カニムシ目は3,000種以上の小型のクモ形類を含む。","type":"noun","meaning_category":"Taxonomy"},{"sentence":"Research on **Pseudoscorpionida** focuses on their ecological roles and evolutionary relationships.","translation":"カニムシ目の研究は、彼らの生態学的役割と進化的関係に焦点を当てている。","type":"noun","meaning_category":"Zoology"}]}