{"word":"preterito-present","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(言語学) 過去現在動詞の","english_definition":"(linguistics) Describing a verb whose present tense form originates from the past tense form of a Proto-Indo-European perfect verb.","examples":[{"sentence":"Preterito-present verbs are a feature of Germanic languages.","translation":"過去現在動詞はゲルマン語派の特徴である。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Formed from the combination of 'preterite' (referring to the past tense) and 'present' (referring to the present tense).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɹɛtəˌɹiːtoʊ prɪˈzɛnt/","syllables":"pre-te-ri-to-pre-sent"},"inflection":{},"usage_notes":{"explanation":"The term 'preterito-present' describes a class of verbs, primarily in Germanic languages, that have an unusual historical development. The present tense forms of these verbs are derived from what were originally perfect (past tense) forms in Proto-Indo-European. Over time, the original perfect forms came to be interpreted as present tense, and new past tense forms were created, often with the addition of a dental suffix (like '-d' or '-t'). Examples include the English verbs 'can,' 'may,' 'shall,' and 'must.'","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["perfect verb","Germanic languages","Proto-Indo-European"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'preterito-present' is a technical term used in linguistics, specifically when discussing the historical development of verbs in Germanic languages. It refers to verbs whose present tense forms evolved from the past tense (perfect) forms of Proto-Indo-European verbs. Understanding this term requires some background knowledge in historical linguistics and Indo-European verb morphology."},"example_sentences":[{"sentence":"The verb 'can' is an example of a preterito-present verb in English.","translation":"英語の動詞 'can' は過去現在動詞の例である。","type":"example","meaning_category":"linguistics"}]}