{"word":"pignoratitious","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"質入れの、抵当の、担保の","english_definition":"Relating to or involving a pledge or mortgage; given or held as security.","examples":[{"sentence":"The agreement included a pignoratitious clause securing the loan.","translation":"その契約には、融資を担保するための質入れ条項が含まれていた。"},{"sentence":"The bank held a pignoratitious right over the property.","translation":"銀行はその不動産に対する抵当権を保有していた。"}],"collocations":["pignoratitious contract","pignoratitious security","pignoratitious loan","pignoratitious agreement"],"synonyms":["mortgaged","pledged","secured","hypothecated"],"antonyms":["unsecured","unpledged"]}],"etymology":{"value":"Derived from the Latin word 'pignus,' meaning 'pledge' or 'security.' The suffix '-atitious' indicates a relationship or connection to the root word.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɪɡnəˈreɪʃəs/","syllables":"pig-no-ra-ti-tious"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms, which are less common for this word."},"usage_notes":{"explanation":"'Pignoratitious' is a relatively rare and formal term, primarily used in legal or financial contexts to describe something related to a pledge or mortgage. It emphasizes the security aspect of a transaction where an asset is used as collateral.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pignoratitious feeling was overwhelming.","correct":"✓ The overwhelming feeling was related to the mortgage.","note":"'Pignoratitious' refers to a legal or financial arrangement, not a feeling. Use it to describe contracts, agreements, or rights, not emotions."}],"priority":"★★☆"},"related_words":{"derivatives":["pignus (Latin root, meaning 'pledge')","pledge","mortgage","collateral"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pignoratitious' is a highly specialized term primarily encountered in legal or financial documents. Understanding its meaning requires familiarity with concepts of pledges, mortgages, and secured transactions. Due to its rarity and specific context, it is not suitable for general use.","priority":"★★☆"},"example_sentences":[{"sentence":"The pignoratitious instrument detailed the terms of the security.","translation":"その質入れ証書には、担保の条件が詳細に記載されていた。","type":"adjective","meaning_category":"抵当の・担保の"},{"sentence":"The lender required a pignoratitious interest in the borrower's assets.","translation":"貸し手は、借り手の資産に対する抵当権を要求した。","type":"adjective","meaning_category":"質入れの・担保の"}]}