{"word":"myocardiograph","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"心筋運動記録計","english_definition":"An instrument for recording the movements of the heart muscle.","examples":[{"sentence":"The myocardiograph was used to assess the patient's heart function during exercise.","translation":"心筋運動記録計は、運動中の患者の心機能を評価するために使用されました。"}],"collocations":["use a myocardiograph","record with myocardiograph"],"synonyms":["cardiograph"],"antonyms":[]}],"etymology":{"value":"From 'myocardio-' (referring to the myocardium, the heart muscle) + '-graph' (an instrument for recording).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪoʊˈkɑːrdiəˌɡræf/","syllables":"my-o-car-di-o-graph"},"inflection":{"noun_plural":"myocardiographs"},"usage_notes":{"explanation":"A myocardiograph is a specialized medical instrument used to monitor and record the movements and activity of the heart muscle. It is primarily used in research and clinical settings to assess cardiac function and diagnose heart conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The doctor used a myocardiogram.","correct":"The doctor used a myocardiograph.","note":"A myocardiograph is the instrument, while a myocardiogram is the recording produced by the instrument."}],"priority":"★★☆"},"related_words":{"derivatives":["myocardiography (the process of recording heart muscle movements)","myocardium (the heart muscle)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Myocardiograph' is a highly specialized term used in cardiology and medical research. It refers to the instrument used to record the movements of the heart muscle. Understanding this term requires a strong background in medical terminology."},"example_sentences":[{"sentence":"The researchers employed a myocardiograph to analyze the contractile properties of the heart muscle.","translation":"研究者たちは心筋の収縮特性を分析するために心筋運動記録計を使用した。","type":"general","meaning_category":"Medical Instrument"},{"sentence":"The data obtained from the myocardiograph provided valuable insights into the patient's cardiac health.","translation":"心筋運動記録計から得られたデータは、患者の心臓の健康状態に関する貴重な洞察を提供した。","type":"general","meaning_category":"Medical Data Collection"}]}