{"word":"onchocerciasis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"オンコセルカ症（旋尾糸状虫症）","english_definition":"A disease caused by the parasitic worm Onchocerca volvulus, transmitted to humans through the bite of infected blackflies. It is characterized by skin nodules, itching, and visual impairment, including blindness (river blindness).","examples":[{"sentence":"Onchocerciasis is a major public health problem in many parts of Africa.","translation":"オンコセルカ症はアフリカの多くの地域で主要な公衆衛生上の問題となっています。"},{"sentence":"Mass drug administration programs are used to control onchocerciasis.","translation":"集団投薬プログラムがオンコセルカ症の制御に用いられています。"}],"collocations":["river blindness","blackfly vector","skin nodules","itching","visual impairment","mass drug administration"],"synonyms":["river blindness"," Robles disease"],"antonyms":[],"related_conditions":["lymphatic filariasis","loiasis"],"preventative_measures":["blackfly control","ivermectin treatment"]}],"etymology":{"value":"Derived from the genus name of the parasitic worm, Onchocerca, combined with the suffix '-iasis,' indicating a disease caused by a parasite. Onchocerca is from the Greek 'onkos' (hook, barb) and 'kerkos' (tail), referring to the hooked tail of the worm.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒŋkəsərˈsaɪəsɪs/","syllables":"on-cho-cer-ci-a-sis"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Onchocerciasis, commonly known as river blindness, is a parasitic disease caused by the filarial worm Onchocerca volvulus. It is transmitted to humans through the bite of infected blackflies that breed in fast-flowing rivers and streams. The disease is prevalent in parts of Africa, Latin America, and Yemen. Symptoms include severe itching, skin rashes, disfiguring skin lesions, and visual impairment, which can lead to permanent blindness. Control efforts focus on vector control (reducing blackfly populations) and mass drug administration of ivermectin, which kills the larval stages of the worm.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Onchocerciasis is caused by a bacteria.","correct":"✓ Onchocerciasis is caused by a parasitic worm.","note":"Onchocerciasis is caused by a parasitic worm, not bacteria."},{"incorrect":"✗ Onchocerciasis is transmitted by mosquitoes.","correct":"✓ Onchocerciasis is transmitted by blackflies.","note":"Blackflies, not mosquitoes, transmit onchocerciasis."}],"priority":"★★☆"},"related_words":{"derivatives":["onchocerca (genus of the parasitic worm)","onchocercoma (nodule containing adult worms)","ivermectin (medication used to treat onchocerciasis)"],"related_diseases":["lymphatic filariasis","loiasis","dracunculiasis"],"related_terms":["vector control","parasitic disease","filarial worm","blackfly","nodule","pruritus","blindness"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in medical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Onchocerciasis is a complex medical term referring to a specific parasitic disease. Understanding it requires knowledge of parasitic infections, vectors (blackflies), and related medical terminology. The term is mainly encountered in medical, public health, and scientific literature. Explanations often involve describing the disease's cause (Onchocerca volvulus worm), transmission (blackfly bites), symptoms (skin nodules, itching, visual impairment), and control measures (vector control, ivermectin treatment)."},"example_sentences":[{"sentence":"The World Health Organization is working to eliminate onchocerciasis in several African countries.","translation":"世界保健機関は、いくつかのアフリカ諸国でオンコセルカ症の撲滅に取り組んでいます。","type":"general","meaning_category":"disease eradication"},{"sentence":"Ivermectin is a key drug used in the treatment of onchocerciasis.","translation":"イベルメクチンは、オンコセルカ症の治療に用いられる重要な薬剤です。","type":"treatment","meaning_category":"medical treatment"},{"sentence":"Control of blackfly populations is essential for preventing the spread of onchocerciasis.","translation":"オンコセルカ症の蔓延を防ぐためには、ブユの個体数管理が不可欠です。","type":"prevention","meaning_category":"disease prevention"}]}