{"word":"shape-oriented","meanings":[{"part_of_speech":"adjective","definition":"形状重視の、形を重視する","english_definition":"Focused on or emphasizing shape; designed or evaluated primarily based on its shape.","examples":[{"sentence":"The design of the car is very shape-oriented, prioritizing aesthetics over practicality.","translation":"その車のデザインは非常に形状重視で、実用性よりも美しさを優先している。"},{"sentence":"The artist is known for his shape-oriented sculptures.","translation":"その芸術家は、形状重視の彫刻で知られている。"},{"sentence":"Shape-oriented programming languages focus on manipulating geometric forms.","translation":"形状指向プログラミング言語は、幾何学的形状の操作に焦点を当てている。"}],"collocations":["shape-oriented design","shape-oriented programming","shape-oriented art","shape-oriented architecture"],"synonyms":["form-focused","geometry-based","contour-conscious"],"antonyms":["function-oriented","performance-driven","practical"],"related_words":["shape","form","geometry","design","aesthetic"],"level_frequency":{"frequency_google_ngram":"Low frequency"},"usage_notes":{"explanation":"'Shape-oriented' describes something where the shape or form is a primary consideration. This can apply to design, art, programming, or any field where the visual or geometric aspect is emphasized. It often implies that other factors, such as function or practicality, may be secondary.","priority":"★★★"},"readability_explanation":{"level":"B2","text":"'Shape-oriented' is a compound adjective describing something that prioritizes shape. It is often used in the context of design, art, or technology where the visual form is a key consideration. Understanding this term requires familiarity with the concept of prioritizing certain attributes over others. "},"example_sentences":[{"sentence":"The architect created a shape-oriented building that was visually stunning.","translation":"その建築家は、視覚的に素晴らしい形状重視の建物を設計した。","type":"general","meaning_category":"design"},{"sentence":"The software library provides tools for shape-oriented image processing.","translation":"そのソフトウェアライブラリは、形状重視の画像処理のためのツールを提供する。","type":"technical","meaning_category":"technology"}]}],"etymology":{"value":"Compound word formed by combining 'shape' and 'oriented'. 'Shape' refers to the external form or appearance of something. 'Oriented' means directed toward or focused on.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃeɪp ˌɔːriˌɛntɪd/","syllables":"shape-o-ri-ent-ed"},"inflection":{"notes":"Adjectives do not typically inflect in English."}}