{"word":"Ceratopsian","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"角竜類：白亜紀に生息した、フリルと通常は角を持つ草食恐竜の一群。","english_definition":"A member of the Ceratopsia, an extinct group of herbivorous, beaked dinosaurs that thrived in the Cretaceous period, characterized by their frills and often horns.","examples":[{"sentence":"Triceratops is a well-known ceratopsian.","translation":"トリケラトプスはよく知られた角竜類です。"},{"sentence":"Ceratopsians are known for their elaborate head ornamentation.","translation":"角竜類は、その精巧な頭部の装飾で知られています。"}],"collocations":["ceratopsian dinosaur","ceratopsian skull","early ceratopsian","advanced ceratopsian"],"synonyms":["horned dinosaur"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'keras' (κέρας) meaning 'horn' and 'ops' (ὤψ) meaning 'face', combined with the taxonomic suffix '-ian'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛrəˈtɒpsiən/","syllables":"ce-ra-top-si-an"},"inflection":{"noun_plural":"Ceratopsians"},"usage_notes":{"explanation":"'Ceratopsian' refers specifically to members of the clade Ceratopsia. These dinosaurs are characterized by rostral bone (a beak-like structure), jugal horns (cheek horns), and a parietal-squamosal frill (a bony structure extending from the back of the skull). The size and shape of these features vary greatly among different species of ceratopsians.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Ceratopsians are carnivores.","correct":"✓ Ceratopsians are herbivores.","note":"Ceratopsians were herbivorous dinosaurs, not carnivores."},{"incorrect":"✗ All dinosaurs with horns are ceratopsians.","correct":"✓ Not all dinosaurs with horns are ceratopsians; the horns and frills are specific features of ceratopsians.","note":"While ceratopsians are known for their horns, not all horned dinosaurs are ceratopsians. The specific skull structure defines them."}],"priority":"★★☆"},"related_words":{"derivatives":["Ceratopsia (noun: the clade containing all ceratopsians)","Triceratops (noun: a specific genus of ceratopsian)","Protoceratops (noun: a specific genus of ceratopsian)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2-C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Ceratopsian' is a scientific term used in paleontology and zoology to refer to a specific group of dinosaurs. Understanding this term requires familiarity with biological classification and dinosaur anatomy. It is typically encountered in scientific literature, documentaries, or educational materials related to dinosaurs.","example_sentences":[]},"example_sentences":[{"sentence":"The paleontologists discovered a new species of ceratopsian in Montana.","translation":"古生物学者はモンタナで角竜類の新種を発見しました。","type":"noun","meaning_category":"角竜類"},{"sentence":"Fossil evidence suggests that ceratopsians lived in herds.","translation":"化石の証拠は、角竜類が群れで生活していたことを示唆しています。","type":"noun","meaning_category":"角竜類"}]}