{"word":"Repacification","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"平和回復、再平和化","english_definition":"The act or process of restoring peace, especially after a period of conflict or unrest.","examples":[{"sentence":"The government is focused on the repacification of the region after years of civil war.","translation":"政府は、長年の内戦の後、その地域の平和回復に力を入れています。"},{"sentence":"Repacification efforts include disarmament and reconciliation programs.","translation":"平和回復の取り組みには、武装解除と和解プログラムが含まれます。"}],"collocations":["repacification process","repacification efforts","regional repacification"],"synonyms":["pacification","peace restoration","reconciliation","appeasement"],"antonyms":["conflict","war","unrest"]}],"etymology":{"value":"The word 'repacification' is formed by adding the prefix 're-' (meaning 'again' or 'anew') to 'pacification'. 'Pacification' itself comes from the Latin word 'pacificus', meaning 'peaceful'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːpæsɪfɪˈkeɪʃən/","syllables":"re-pac-i-fi-ca-tion"},"inflection":{"noun_plural":"Repacifications"},"usage_notes":{"explanation":"'Repacification' is a relatively formal term often used in political science, international relations, and history. It specifically refers to the restoration of peace after a period where peace has been disrupted. It implies a deliberate and often organized effort to bring about peace.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The repacification was immediate.","correct":"✓ The repacification process was gradual.","note":"Repacification is usually a process, not an instantaneous event."},{"incorrect":"✗ They repacified the country by force.","correct":"✓ They aimed to repacify the country through negotiation.","note":"Repacification implies peaceful means, not force."}],"priority":"★☆☆"},"related_words":{"derivatives":["pacification","pacify","re-pacify"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Repacification' is a complex term that describes the process of re-establishing peace after conflict. It is not commonly used in everyday language and is more frequently found in academic or political contexts. Understanding the prefix 're-' and the root word 'pacification' helps to grasp its meaning. The term implies a deliberate effort to restore peace through various measures such as negotiation, disarmament, and reconciliation."},"example_sentences":[{"sentence":"The UN is playing a crucial role in the repacification of the war-torn country.","translation":"国連は、戦争で荒廃した国の平和回復において重要な役割を果たしています。","type":"noun","meaning_category":"平和回復"},{"sentence":"Successful repacification requires addressing the root causes of the conflict.","translation":"平和回復を成功させるには、紛争の根本原因に対処する必要があります。","type":"noun","meaning_category":"平和回復"},{"sentence":"The repacification strategy includes economic development initiatives to promote stability.","translation":"平和回復戦略には、安定を促進するための経済開発イニシアチブが含まれています。","type":"noun","meaning_category":"平和回復"}]}