{"word":"preachily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"説教臭く、教訓的に、道徳的に説き伏せるように","english_definition":"In a manner that involves giving moral advice in a way that is unwanted or annoying; in a didactic or moralizing way.","examples":[{"sentence":"He spoke preachily about the importance of hard work.","translation":"彼は勤勉の大切さについて説教臭く語った。"},{"sentence":"She preachily lectured her friends on their lifestyle choices.","translation":"彼女は友人たちのライフスタイルの選択について、説教臭く講釈を垂れた。"},{"sentence":"The article was written preachily, making it difficult to enjoy.","translation":"その記事は説教臭く書かれており、楽しむのが難しかった。"}],"collocations":["speak preachily","lecture preachily","write preachily","act preachily"],"synonyms":["didactically","moralistically","sanctimoniously","piously","righteously"],"antonyms":[],"related_words":["preachy (adjective)","preach (verb)","preacher (noun)"]}],"etymology":{"value":"Derived from the adjective 'preachy' by adding the suffix '-ly'. 'Preachy' comes from the verb 'preach', which originates from Old French 'prechier' and ultimately from Latin 'praedicare' meaning 'to proclaim, announce, declare publicly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpriːtʃɪli/","syllables":"preach-i-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Preachily' describes the manner in which someone speaks or behaves when they are trying to give moral advice in a way that is annoying or unwelcome. It often implies that the person is being self-righteous or condescending. The word carries a negative connotation, suggesting that the advice is unwanted and delivered in an irritating way.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"She acted preachily, but her intentions were good.","correct":"She acted with good intentions, but her behavior came across as preachy.","note":"It is better to describe the behavior as 'preachy' rather than using 'preachily' to describe the action of acting. The adverb 'preachily' is more commonly used to describe speaking or writing."}],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'preachily' is used to describe someone giving advice in a way that is annoying or unwanted. It implies the person is being self-righteous or moralizing. This word is not commonly used and is more likely to be found in formal writing or when describing someone's behavior critically."},"example_sentences":[{"sentence":"The politician spoke preachily about family values, but his own actions contradicted his words.","translation":"その政治家は家族の価値観について説教臭く語ったが、彼自身の行動は彼の言葉と矛盾していた。","type":"adverb","meaning_category":"moralizing"},{"sentence":"She wrote preachily in her blog about the dangers of social media.","translation":"彼女はブログでソーシャルメディアの危険性について説教臭く書いた。","type":"adverb","meaning_category":"didactic"},{"sentence":"He preachily corrected my grammar in front of everyone.","translation":"彼はみんなの前で私の文法を説教臭く訂正した。","type":"adverb","meaning_category":"annoying"}]}