{"word":"linearization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"線形化、線型化","english_definition":"The process of approximating a nonlinear system or function with a linear one.","examples":[{"sentence":"The linearization of the differential equation simplifies the analysis.","translation":"微分方程式の線形化は解析を単純化する。"},{"sentence":"Linearization is often used in control systems design.","translation":"線形化は制御システムの設計でよく用いられる。"}],"collocations":["linearization technique (線形化手法)","tangent linearization (接線線形化)","small-signal linearization (小信号線形化)"],"synonyms":["linear approximation","linear modelling"],"antonyms":["nonlinearization"]},{"part_of_speech":"noun","definition":"(自然言語処理において) 線形化、文の構造を一次元の文字列に変換すること","english_definition":"In natural language processing, the process of converting a sentence's structure into a one-dimensional string of words.","examples":[{"sentence":"Linearization is a key step in surface realization.","translation":"線形化は表層実現における重要なステップである。"},{"sentence":"Different linearization algorithms can produce different outputs.","translation":"異なる線形化アルゴリズムは異なる出力を生成することがある。"}],"collocations":["surface linearization (表層線形化)","tree linearization (木構造線形化)"],"synonyms":["string generation"],"antonyms":[]}],"etymology":{"value":"The term 'linearization' is derived from 'linear,' which comes from the Latin word 'linearis,' meaning 'belonging to a line.' The suffix '-ization' denotes the process of making something linear.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɪniərɪˈzeɪʃən/","syllables":"lin-e-ar-i-za-tion"},"inflection":{"noun_plural":"linearizations"},"usage_notes":{"explanation":"Linearization is a process used in various fields, including mathematics, physics, engineering, and natural language processing. In mathematics and engineering, it involves approximating a nonlinear system with a linear one, which simplifies analysis and computation. In natural language processing, it refers to the process of converting a hierarchical or graph-based representation of a sentence into a linear string of words. The specific meaning depends on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The linearization are used to solve the problem.","correct":"✓ Linearization is used to solve the problem.","note":"'Linearization' is an uncountable noun in this context, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["linear (adjective)","linearize (verb)","linearity (noun)","nonlinear (adjective)","nonlinearity (noun)"],"related_terms":["Taylor series","Jacobian matrix","surface realization","natural language generation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (technical contexts)","frequency_google_ngram":"Relatively low frequency, mainly used in technical and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Linearization' refers to making something linear, which means turning it into a straight line or a simple, direct form. This is often done to simplify complex problems in math, science, and computer science. For example, in math, a curved line might be approximated by a straight line to make calculations easier. In computer science, especially in natural language processing, it's about turning complex sentence structures into a simple string of words. It's a technical term, so you'll mostly see it in specialized contexts."},"example_sentences":[{"sentence":"The engineer used linearization to simplify the complex circuit model.","translation":"エンジニアは線形化を用いて複雑な回路モデルを単純化した。","type":"noun","meaning_category":"線形化 (工学)"},{"sentence":"The linearization process in NLP helps convert sentence structures into a single string.","translation":"NLPにおける線形化プロセスは、文構造を単一の文字列に変換するのに役立つ。","type":"noun","meaning_category":"線形化 (自然言語処理)"}]}