{"word":"Apodosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(文法)帰結節、主節","english_definition":"The main clause in a conditional sentence, which expresses the consequence of the condition stated in the protasis.","examples":[{"sentence":"In the sentence 'If it rains, I will stay home,' 'I will stay home' is the apodosis.","translation":"「もし雨が降れば、私は家にいるだろう」という文において、「私は家にいるだろう」が帰結節である。"},{"sentence":"The apodosis typically follows the protasis, but the order can be reversed for emphasis.","translation":"帰結節は通常、条件節の後に続くが、強調のために順序が逆になることがある。"}],"collocations":["apodosis of a conditional sentence","main clause","consequence clause"],"synonyms":["main clause","result clause","consequent clause"],"antonyms":["protasis"]}],"etymology":{"value":"Derived from the Greek word 'ἀπόδοσις' (apódosis), meaning 'giving back, return, restoration'. In grammar, it refers to the 'giving back' or 'returning' of the consequence after the condition is met.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈpɒdəsɪs/","syllables":"a-pod-o-sis"},"inflection":{"noun_plural":"apodoses"},"usage_notes":{"explanation":"The term 'apodosis' is primarily used in grammatical analysis, particularly when discussing conditional sentences. It is often contrasted with 'protasis,' which refers to the conditional clause (the 'if' clause). Understanding these terms is helpful for analyzing the structure and meaning of complex sentences.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The protasis is the main clause, and the apodosis is the if-clause.","correct":"✓ The protasis is the if-clause, and the apodosis is the main clause.","note":"It's important to remember that the protasis is the 'if' clause, and the apodosis is the main clause that expresses the result or consequence."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["protasis","conditional sentence","clause","grammar","syntax"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Apodosis' is a technical term used in grammar to describe the main clause in a conditional sentence that expresses the result or consequence. It is typically discussed in advanced language studies or linguistic analysis. It is often used in conjunction with 'protasis,' which refers to the 'if' clause that sets the condition. Understanding these terms is helpful for analyzing the structure of complex sentences."},"example_sentences":[{"sentence":"The **apodosis** of the sentence clearly states the outcome if the condition is met.","translation":"その文の帰結節は、条件が満たされた場合の結果を明確に述べている。","type":"noun","meaning_category":"grammar"},{"sentence":"In formal grammar, the **apodosis** is distinguished from the protasis by its function in the conditional statement.","translation":"形式文法では、帰結節は条件文におけるその機能によって条件節と区別される。","type":"noun","meaning_category":"grammar"}]}