{"word":"Majoristic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(historical theology) Relating to or characteristic of the teachings of Georg Major, a 16th-century German Lutheran theologian, particularly concerning the role of good works in salvation.","english_definition":"Relating to or characteristic of the teachings of Georg Major, a 16th-century German Lutheran theologian, particularly concerning the role of good works in salvation.","examples":[{"sentence":"The Majoristic controversy centered on whether good works were necessary for salvation.","translation":"マヨール派論争は、善行が救いのために必要かどうかを中心に展開された。"},{"sentence":"Majoristic theology was eventually rejected by orthodox Lutherans.","translation":"マヨール派神学は最終的に正統なルター派によって拒否された。"}],"collocations":["Majoristic controversy","Majoristic theology","Majoristic view"],"synonyms":["Synergistic (in a theological context)"],"antonyms":["Antinomian","Monergistic"],"notes":"Majoristic views were considered a deviation from strict Lutheran doctrine, which emphasizes salvation through faith alone (sola fide)."}],"etymology":{"value":"Derived from the name of Georg Major (1502-1574), a German Lutheran theologian.","priority":"★★★"},"pronunciation":{"ipa":"/məˌdʒɔːˈrɪstɪk/","syllables":"Ma-jor-is-tic"},"inflection":{"notes":"Adjective; no standard comparative or superlative forms."},"usage_notes":{"explanation":"The term 'Majoristic' is primarily used in the context of historical theology, specifically referring to the theological debates within Lutheranism in the 16th century. It is not a commonly used word outside of this specific academic context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He held a majoristic view on economics.","correct":"✓ He held a synergistic view on economics.","note":"'Majoristic' is specific to theological discussions about salvation and should not be used in other contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["Majorist (noun: a follower of Georg Major's teachings)"],"related_terms":["Philippist (related theological movement)","Gnesio-Lutheran (opponents of Majoristic views)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Majoristic' is a highly specialized term used in the field of historical theology. Understanding its meaning requires knowledge of the Reformation, Lutheran theology, and the specific debates surrounding the role of good works in salvation. It is unlikely to be encountered outside of academic or theological contexts."},"example_sentences":[{"sentence":"The Majoristic position, advocating for the necessity of good works, faced strong opposition from strict Lutherans.","translation":"善行の必要性を主張するマヨール派の立場は、厳格なルター派から強い反対を受けた。","type":"adjective","meaning_category":"Theological doctrine"},{"sentence":"Historians of theology often discuss the Majoristic controversy in the context of 16th-century Lutheranism.","translation":"神学史家は、16世紀のルター主義の文脈でマヨール派論争についてよく議論する。","type":"adjective","meaning_category":"Historical theology"}]}