{"word":"Recancellation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The act or process of cancelling something that was previously cancelled; the reversal of a cancellation.","english_definition":"The act of cancelling something that has already been cancelled.","examples":[{"sentence":"The recancellation of the event caused even more confusion than the initial cancellation.","translation":"イベントの再キャンセルは、最初のキャンセルよりもさらに混乱を引き起こした。"},{"sentence":"After the storm passed, the recancellation of the flight ban was announced.","translation":"嵐が過ぎ去った後、飛行禁止の再キャンセルが発表された。"},{"sentence":"The committee debated the recancellation of the funding cuts.","translation":"委員会は資金削減の再キャンセルについて議論した。"}],"collocations":["recancellation of a flight","recancellation of an order","recancellation of a meeting","recancellation of a policy"],"synonyms":["reinstatement","reversal of cancellation","undoing of cancellation"],"antonyms":["cancellation","affirmation of cancellation"]}],"etymology":{"value":"Formed by adding the prefix 're-' (again) to 'cancellation'. 'Cancellation' itself comes from 'cancel', which originates from the Latin word 'cancellare' (to cross out).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˌkænsəˈleɪʃən/","syllables":"re-can-cel-la-tion"},"inflection":{"noun_plural":"recancellations"},"usage_notes":{"explanation":"'Recancellation' is a relatively rare word, used to describe the act of reversing a previous cancellation. It implies that something was initially cancelled, and then that cancellation was itself cancelled, effectively reinstating the original state or plan. It's often used in formal or official contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The recancellation was cancelled again.","correct":"✓ The recancellation was implemented.","note":"Since 'recancellation' means the reversal of a cancellation, it cannot be cancelled itself. Instead, it would be implemented or take effect."},{"incorrect":"✗ He recancelled the meeting.","correct":"✓ He reversed the cancellation of the meeting.","note":"'Recancel' is not a standard verb. The correct way to express this action is to use a phrase like 'reverse the cancellation'."}],"priority":"★★☆"},"related_words":{"derivatives":["cancel","cancellation","re- (prefix)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not commonly listed in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Recancellation' is a complex word that is rarely used in everyday language. It is most often found in formal or technical contexts where precise language is needed to describe the reversal of a cancellation. Understanding the prefix 're-' and the root word 'cancellation' is crucial for comprehending its meaning. Due to its infrequent use, it is not typically encountered until advanced levels of English proficiency."},"example_sentences":[{"sentence":"The unexpected recancellation of the project's termination allowed the team to continue their work.","translation":"プロジェクトの終了の予期せぬ再キャンセルにより、チームは作業を継続することができた。","type":"noun","meaning_category":"reversal of cancellation"},{"sentence":"The board approved the recancellation of the previous decision to close the factory.","translation":"取締役会は、工場閉鎖の以前の決定の再キャンセルを承認した。","type":"noun","meaning_category":"reversal of cancellation"},{"sentence":"The recancellation of the concert was met with mixed reactions from fans.","translation":"コンサートの再キャンセルは、ファンから賛否両論の反応を受けた。","type":"noun","meaning_category":"reversal of cancellation"}]}