{"word":"anthracosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"炭粉沈着症、肺炭症","english_definition":"A condition caused by the accumulation of carbon deposits in the lungs, typically due to inhalation of smoke or coal dust.","examples":[{"sentence":"Anthracosis is common in urban populations due to air pollution.","translation":"炭粉沈着症は大気汚染のため都市部の住民によく見られる。"},{"sentence":"Miners are at high risk of developing anthracosis.","translation":"鉱山労働者は炭粉沈着症を発症するリスクが高い。"},{"sentence":"The autopsy revealed signs of anthracosis in the deceased's lungs.","translation":"検死の結果、故人の肺に炭粉沈着症の兆候が見られた。"}],"collocations":["pulmonary anthracosis (肺炭粉沈着症)","urban anthracosis (都市炭粉沈着症)","coal worker's anthracosis (石炭労働者の炭粉沈着症)"],"synonyms":["black lung disease","coal worker's pneumoconiosis"],"antonyms":[]},{"part_of_speech":"noun","definition":"(病理学)組織における炭素粒子の蓄積","english_definition":"(Pathology) The accumulation of carbon particles in a tissue or organ.","examples":[{"sentence":"Anthracosis can be observed in lymph nodes near the lungs.","translation":"炭粉沈着症は肺に近いリンパ節で見られることがある。"},{"sentence":"The pathologist identified anthracosis in the lung tissue sample.","translation":"病理医は肺組織のサンプルに炭粉沈着症を確認した。"}],"collocations":["lymph node anthracosis (リンパ節炭粉沈着症)","tissue anthracosis (組織炭粉沈着症)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ἀνθρακο- (anthrako-), combining form of ἄνθραξ (anthrax, “coal, charcoal”) + -ωσις (-osis, “condition, process, or increase”).","priority":"★★☆"},"pronunciation":{"ipa":"ˌænθrəˈkoʊsɪs","syllables":"an-thra-co-sis"},"inflection":{"noun_plural":"anthracoses"},"usage_notes":{"explanation":"Anthracosis is primarily a pathological term referring to the accumulation of carbon particles, especially in the lungs. It's often associated with environmental factors like air pollution or occupational hazards such as coal mining. The severity of anthracosis can vary, and in some cases, it may not cause significant health problems. However, in severe cases, it can contribute to respiratory issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Anthracosis is caused by a virus.","correct":"✓ Anthracosis is caused by inhaling carbon particles.","note":"Anthracosis is caused by the inhalation of carbon particles, not by a virus or bacteria."},{"incorrect":"✗ Anthracosis is a type of cancer.","correct":"✓ Anthracosis is a condition where carbon particles accumulate in the lungs.","note":"Anthracosis is not cancer, but a condition that can sometimes lead to other respiratory problems."}],"priority":"★★☆"},"related_words":{"derivatives":["anthracotic (adjective)"],"phrasal_verbs":[],"related_medical_terms":["pneumoconiosis","asbestosis","silicosis"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Anthracosis is a medical term referring to the accumulation of carbon particles in the lungs, often due to environmental or occupational exposure to pollutants like coal dust or smoke. It's a condition more commonly discussed in medical or environmental science contexts, and understanding it requires some background knowledge in these fields. The term is not typically encountered in everyday conversation."},"example_sentences":[{"sentence":"Long-term exposure to air pollution can lead to anthracosis.","translation":"長期的な大気汚染への暴露は炭粉沈着症を引き起こす可能性がある。","type":"general","meaning_category":"cause"},{"sentence":"The chest X-ray showed evidence of anthracosis in the patient's lungs.","translation":"胸部X線検査で、患者の肺に炭粉沈着症の証拠が見られた。","type":"medical","meaning_category":"diagnosis"},{"sentence":"Protective masks can help prevent anthracosis in coal miners.","translation":"保護マスクは、炭鉱労働者の炭粉沈着症の予防に役立つ。","type":"prevention","meaning_category":"prevention"}]}