{"word":"esurine","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Of or pertaining to a subfamily (Desmodontinae) of bats that feed on blood; vampire-like.","english_definition":"Relating to or characteristic of vampire bats or their subfamily Desmodontinae.","examples":[{"sentence":"The esurine bats are the only mammals that feed exclusively on blood.","translation":"吸血コウモリ亜科のコウモリは、血液のみを餌とする唯一の哺乳類です。"}],"collocations":["esurine bats","esurine characteristics"],"synonyms":["vampire-like","hematophagous"],"antonyms":[]}],"etymology":{"value":"Derived from the subfamily name 'Desmodontinae', which includes vampire bats. The name is based on Greek roots, with 'desmo-' referring to 'bond' or 'ligament' and 'odont' referring to 'tooth'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛsjʊˌraɪn/","syllables":"e-su-rine"},"inflection":{"notes":"Adjective, no standard inflections."},"usage_notes":{"explanation":"The term 'esurine' is relatively technical and primarily used in scientific or zoological contexts when discussing vampire bats or their characteristics. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The esurine is flying around.","correct":"✓ An esurine bat is flying around.","note":"'Esurine' is an adjective, not a noun. You need to use it to describe a noun, such as 'esurine bat'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Desmodontinae (noun: the subfamily of vampire bats)","vampire bat (noun: a bat that feeds on blood)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'esurine' is a highly specialized term used in zoology to describe characteristics related to vampire bats. Its use is restricted to scientific or technical contexts. Understanding the term requires familiarity with biological classification and terminology. Due to its limited use, it is unlikely to be encountered outside of specialized literature. "},"example_sentences":[{"sentence":"The esurine dentition is highly adapted for piercing skin and lapping blood.","translation":"吸血コウモリの歯は、皮膚を突き刺し、血液を舐め取るのに非常に適しています。","type":"adjective","meaning_category":"characteristic of vampire bats"},{"sentence":"Esurine bats are found primarily in Central and South America.","translation":"吸血コウモリは主に中南米に生息しています。","type":"adjective","meaning_category":"related to vampire bats"}]}