{"word":"Basis","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"基礎、根拠、基準、原理","english_definition":"The underlying support or foundation for an idea, argument, or process; the fundamental principles or facts that serve as a starting point.","examples":[{"sentence":"The judge dismissed the case on the basis of insufficient evidence.","translation":"裁判官は証拠不十分を理由に訴えを退けた。"},{"sentence":"What is the basis for your claim?","translation":"あなたの主張の根拠は何ですか？"},{"sentence":"We need to establish a solid basis for our research.","translation":"私たちは研究のための確固たる基礎を築く必要がある。"},{"sentence":"They were paid on a daily basis.","translation":"彼らは日給制で支払われた。"}],"collocations":["on the basis of (～に基づいて)","a solid basis (確固たる基礎)","a legal basis (法的根拠)","a daily basis (毎日)","a regular basis (定期的に)","a sound basis (健全な基礎)","factual basis (事実に基づいた根拠)","theoretical basis (理論的根拠)"],"synonyms":["foundation","base","ground","reason","principle","underpinning","rationale","justification"],"antonyms":["superstructure","derivative","secondary element"]},{"part_of_speech":"noun","definition":"(数学)基底","english_definition":"(Mathematics) A set of linearly independent vectors that span a vector space.","examples":[{"sentence":"The vectors (1,0) and (0,1) form a basis for the two-dimensional Euclidean space.","translation":"ベクトル(1,0)と(0,1)は、2次元ユークリッド空間の基底を形成する。"}],"collocations":["vector basis (ベクトル基底)","basis vector (基底ベクトル)","orthonormal basis (正規直交基底)"],"synonyms":["base","spanning set"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from late Latin, from Greek 'basis' ‘pedestal, base’, from 'bainein' ‘to go’.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbeɪsɪs/","syllables":"bay-sis"},"inflection":{"noun_plural":"bases"},"usage_notes":{"explanation":"The word \"basis\" refers to the foundation or support upon which something is built or established. It can refer to a reason, principle, or justification for an action, belief, or argument. In mathematics, it has a specific meaning related to vector spaces. The plural form is \"bases\". It's important to distinguish between \"basis\" (singular noun) and \"bases\" (plural noun).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The basis of the building are strong.","correct":"✓ The basis of the building is strong.","note":"\"Basis\" is singular, so it takes a singular verb (\"is\")."},{"incorrect":"✗ What are the basic of your argument?","correct":"✓ What is the basis of your argument?","note":"The word needed here is \"basis\" (foundation), not \"basic\" (fundamental)."},{"incorrect":"✗ The research was done on base of the data.","correct":"✓ The research was done on the basis of the data.","note":"The correct idiom is \"on the basis of\"."}],"priority":"★★☆"},"related_words":{"derivatives":["basic (adjective)","basically (adverb)","base (noun, verb)"],"phrases":["on a daily basis","on a regular basis","on the basis of"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"High frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'basis' is used to describe the foundation or reason behind something. It's often used in formal contexts, like academic writing or legal discussions. For example, you might say 'The decision was made on the basis of new evidence,' meaning the decision was based on that evidence. It's important to use 'basis' when you're talking about the underlying support or justification for something, rather than just a general reason."},"example_sentences":[{"sentence":"The company's success is built on the basis of hard work and innovation.","translation":"その会社の成功は、勤勉と革新を基礎として築かれている。","type":"noun","meaning_category":"基礎"},{"sentence":"The government justified the new policy on the basis of national security.","translation":"政府は国家安全保障を根拠に新政策を正当化した。","type":"noun","meaning_category":"根拠"},{"sentence":"We evaluate employee performance on a quarterly basis.","translation":"私たちは四半期ごとに従業員の業績を評価します。","type":"noun","meaning_category":"基準"},{"sentence":"The course provides a solid basis for understanding advanced physics.","translation":"このコースは、高度な物理学を理解するための確固たる基礎を提供する。","type":"noun","meaning_category":"基礎"},{"sentence":"The lawyer argued that there was no legal basis for the lawsuit.","translation":"弁護士は、訴訟の法的根拠がないと主張した。","type":"noun","meaning_category":"根拠"}]}