{"word":"ungraspable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"把握できない、理解できない、つかみどころのない","english_definition":"impossible to grasp, either physically or mentally; incomprehensible; elusive.","examples":[{"sentence":"The concept of infinity is ungraspable for many people.","translation":"無限という概念は多くの人々にとって把握できない。"},{"sentence":"The truth remained ungraspable, hidden behind layers of deception.","translation":"真実はつかみどころがなく、欺瞞の層の背後に隠されたままだった。"},{"sentence":"The sheer scale of the universe is almost ungraspable.","translation":"宇宙の途方もない規模はほとんど理解できない。"}],"collocations":["ungraspable concept (把握できない概念)","ungraspable idea (理解できない考え)","ungraspable truth (つかみどころのない真実)","ungraspable feeling (捉えどころのない感情)"],"synonyms":["incomprehensible","unfathomable","intangible","elusive","impalpable","abstract","abstracted","imperceptible","unintelligible","unreachable"],"antonyms":["graspable","comprehensible","understandable","tangible","palpable","concrete","intelligible","reachable"]}],"etymology":{"value":"\"Ungraspable\" is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"graspable,\" which itself comes from \"grasp\" (to seize or understand) + \"-able\" (capable of being).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈɡræspəbəl/","syllables":"un-grasp-a-ble"},"inflection":{"notes":"Adjectives in English do not inflect, but they can form comparative and superlative degrees (more ungraspable, most ungraspable)."},"usage_notes":{"explanation":"\"Ungraspable\" describes something that is difficult or impossible to understand or hold onto, either literally or figuratively. It often refers to abstract concepts, complex ideas, or elusive qualities. While \"incomprehensible\" focuses on the inability to understand, \"ungraspable\" can also suggest a sense of something being just out of reach, even if one has a partial understanding.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ungraspable object floated in the air.","correct":"✓ The intangible object floated in the air.","note":"If the object is physically present but cannot be touched, \"intangible\" is a better choice. \"Ungraspable\" is more often used for abstract concepts. If the object is physically present but difficult to hold, consider using \"slippery\" or \"unwieldy\"."},{"incorrect":"✗ He had an ungraspable feeling that something was wrong.","correct":"✓ He had an indefinable feeling that something was wrong.","note":"While \"ungraspable\" can be used for feelings, \"indefinable\" or \"inexplicable\" might be more common and natural-sounding choices."}],"priority":"★★☆"},"related_words":{"derivatives":["ungraspably (adverb)","grasp (verb, noun)","graspable (adjective)","grasping (adjective)"],"phrases":["beyond one's grasp (理解を超えて)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare, but may appear in academic or philosophical contexts)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Ungraspable\" is a relatively uncommon word that means something is very difficult or impossible to understand or hold onto, either in a physical or mental sense. It is often used to describe abstract ideas or complex concepts that are hard to define or comprehend fully. Because it's not a common word, it's more likely to appear in advanced texts or discussions."},"example_sentences":[{"sentence":"The artist tried to capture the ungraspable essence of beauty in her paintings.","translation":"その芸術家は絵画で美の把握できない本質を捉えようとした。","type":"adjective","meaning_category":"理解できない"},{"sentence":"The sheer complexity of the algorithm made it ungraspable to the average user.","translation":"そのアルゴリズムの複雑さゆえに、平均的なユーザーには理解できなかった。","type":"adjective","meaning_category":"把握できない"},{"sentence":"The feeling of déjà vu is often described as ungraspable and fleeting.","translation":"デジャヴの感覚は、しばしば捉えどころがなく、つかの間であると表現される。","type":"adjective","meaning_category":"つかみどころのない"}]}