{"word":"protoneuron","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(神経科学) 原ニューロン：昆虫などの無脊椎動物において、脳の初期の発生段階で形成される神経細胞。特定の感覚入力を処理し、より高次の神経回路に情報を伝達する。","english_definition":"(neuroscience) A protoneuron is a type of nerve cell found in invertebrates, such as insects, that is formed during the early stages of brain development. It processes specific sensory inputs and transmits information to higher-order neural circuits.","examples":[{"sentence":"The olfactory protoneuron in the insect brain plays a crucial role in odor recognition.","translation":"昆虫の脳における嗅覚原ニューロンは、臭いの認識において重要な役割を果たしている。"},{"sentence":"Studies on protoneurons have provided insights into the fundamental principles of neural circuit formation.","translation":"原ニューロンに関する研究は、神経回路形成の基本原理に関する洞察を提供してきた。"}],"collocations":["olfactory protoneuron (嗅覚原ニューロン)","visual protoneuron (視覚原ニューロン)","protoneuron development (原ニューロンの発達)","protoneuron circuit (原ニューロン回路)"],"synonyms":["primary neuron","first-order neuron"],"antonyms":["higher-order neuron","interneuron"]}],"etymology":{"value":"「proto-」（最初の、原始の）+ 「neuron」（ニューロン、神経細胞）の組み合わせ。初期に発生する神経細胞であることを示す。","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊtoʊˈnjʊərɒn/","syllables":"pro-to-neu-ron"},"inflection":{"noun_plural":"protoneurons"},"usage_notes":{"explanation":"「**protoneuron**」は、主に昆虫などの無脊椎動物の神経科学の研究で使用される専門用語です。脊椎動物の神経系とは異なる構造を持つため、無脊椎動物の神経回路の初期段階を理解する上で重要な概念となります。一般的には、特定の感覚受容体からの入力を直接受け取り、それを処理してより複雑な神経回路に伝える役割を担います。嗅覚系や視覚系における原ニューロンの研究が盛んです。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Protoneurons are found in the human brain.","correct":"✓ Protoneurons are primarily studied in invertebrate nervous systems, such as those of insects.","note":"原ニューロンは主に無脊椎動物で研究されており、ヒトの脳には直接的な相同構造はありません。"},{"incorrect":"✗ Protoneurons are the same as glial cells.","correct":"✓ Protoneurons are a type of neuron, distinct from glial cells, which provide support and insulation to neurons.","note":"原ニューロンは神経細胞の一種であり、グリア細胞（神経細胞をサポートする細胞）とは異なります。"}],"priority":"★★☆"},"related_words":{"derivatives":["protocerebrum (前大脳：昆虫の脳の主要な部分)","deutocerebrum (中大脳：昆虫の脳の一部で、触覚情報を処理する)","tritocerebrum (後大脳：昆虫の脳の一部で、消化器系を制御する)"],"related_terms":["neuron","synapse","neural circuit","invertebrate neuroscience","sensory processing"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な科学論文でのみ使用される)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な科学論文でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**protoneuron**」は、神経科学、特に無脊椎動物の神経系を研究する分野で使用される専門用語です。昆虫などの無脊椎動物の脳の初期発生段階で形成される特定のタイプの神経細胞を指します。これらの細胞は、感覚情報を処理し、より複雑な神経回路に情報を伝達する役割を果たします。この用語は、一般の人が日常的に使用するものではなく、専門的な科学論文や研究発表などで見られます。"},"example_sentences":[{"sentence":"The **protoneuron** receives direct input from sensory receptor cells.","translation":"原ニューロンは感覚受容細胞から直接入力される。","type":"scientific","meaning_category":"神経科学"},{"sentence":"Researchers are mapping the connections of the **protoneurons** in the fruit fly brain.","translation":"研究者たちはショウジョウバエの脳における原ニューロンの接続をマッピングしている。","type":"scientific","meaning_category":"神経科学"}]}