{"word":"ossuary","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"納骨堂、骨壺","english_definition":"A container or room in which the bones of dead people are placed.","examples":[{"sentence":"The family ossuary was located beneath the church.","translation":"家族の納骨堂は教会の地下にありました。"},{"sentence":"Archaeologists discovered an ancient ossuary containing inscriptions.","translation":"考古学者は碑文が刻まれた古代の骨壺を発見しました。"}],"collocations":["family ossuary","ancient ossuary","stone ossuary","bone ossuary"],"synonyms":["charnel house","bone box","reliquary"],"antonyms":[]}],"etymology":{"value":"From Late Latin ossuarium, from Latin os (bone).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɒsjuəri/","syllables":"os-su-ar-y"},"inflection":{"noun_plural":"ossuaries"},"usage_notes":{"explanation":"An ossuary is specifically a container or place for bones, often after the flesh has decomposed. It can refer to a small box or a larger room or building. The term is often used in archaeological or historical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cemetery was full of ossuaries.","correct":"✓ The cemetery had a section with ossuaries.","note":"While ossuaries can be found in cemeteries, they are not the same thing. A cemetery is a general burial ground, while an ossuary is specifically for bones."}],"priority":"★★☆"},"related_words":{"derivatives":["osseous (adjective: bony)","ossify (verb: to turn into bone)","ossification (noun: the process of turning into bone)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ossuary' is a specialized term referring to a container or place for bones, typically in a historical or archaeological context. It's not commonly used in everyday conversation. Understanding its meaning requires a relatively advanced vocabulary.","priority":"★★★"},"example_sentences":[{"sentence":"The ancient Jewish ossuaries provide valuable insights into burial practices.","translation":"古代ユダヤ人の骨壺は、埋葬の慣習に関する貴重な洞察を提供します。","type":"noun","meaning_category":"納骨堂・骨壺"},{"sentence":"The monks kept the remains of their predecessors in a communal ossuary.","translation":"修道士たちは先人の遺骨を共同の納骨堂に保管していました。","type":"noun","meaning_category":"納骨堂・骨壺"}]}