{"word":"twice-healed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having undergone healing twice, typically referring to a wound or injury that has healed and then been re-injured and healed again.","english_definition":"Having healed on two separate occasions, usually after an injury or wound that was reopened or re-injured after its initial healing.","examples":[{"sentence":"The archaeologist examined the skull and noted the twice-healed fracture, indicating a significant injury followed by a second trauma.","translation":"考古学者は頭蓋骨を調べ、二度治癒した骨折に注目した。これは、重大な負傷に続いて二度目の外傷があったことを示している。"},{"sentence":"The doctor explained that the scar tissue was complex due to the twice-healed nature of the wound.","translation":"医師は、傷跡組織が複雑なのは、その傷が二度治癒したことによるものだと説明した。"}],"collocations":["twice-healed fracture","twice-healed wound","twice-healed injury"],"synonyms":["re-healed","double-healed"],"antonyms":["unhealed","freshly injured"]}],"etymology":{"value":"The word is formed by combining 'twice' (meaning two times) with 'healed' (past participle of 'heal', meaning to become healthy or whole again). The hyphen connects the two words to form a compound adjective.","priority":"N/A"},"pronunciation":{"ipa":"/ˌtwaɪs ˈhiːld/","syllables":"twice-healed"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'twice-healed' is often used in medical or archaeological contexts to describe injuries that have a history of re-injury after initial healing. It indicates that the tissue or bone has undergone the healing process more than once, which can affect its structure and appearance.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["heal","healed","healing","twice"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized or technical term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'twice-healed' is relatively straightforward to understand, but its usage is limited to specific contexts, such as medicine or archaeology, where the history of an injury is relevant. It implies a more complex healing process than a simple, single instance of healing. Understanding the context in which it is used is crucial for proper interpretation."},"example_sentences":[{"sentence":"The X-ray revealed a twice-healed break in the tibia.","translation":"レントゲン写真で脛骨に二度治癒した骨折が見つかった。","type":"adjective","meaning_category":"Medical/Injury"},{"sentence":"Analysis of the ancient bones showed evidence of a twice-healed wound, suggesting repeated conflict.","translation":"古代の骨の分析により、二度治癒した傷の痕跡が見られ、繰り返された紛争を示唆していた。","type":"adjective","meaning_category":"Archaeological"}]}