{"word":"Hypotonicity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"低張性：細胞外液の浸透圧が細胞内の浸透圧よりも低い状態。細胞は水分を吸収し、膨張する可能性がある。","english_definition":"The state of having a lower osmotic pressure than another fluid, especially one in a cell or in blood. Cells in a hypotonic solution tend to swell due to water uptake.","examples":[{"sentence":"Hypotonicity can cause cells to swell and potentially burst.","translation":"低張性は細胞を膨張させ、破裂させる可能性がある。"},{"sentence":"The solution's hypotonicity caused the red blood cells to lyse.","translation":"その溶液の低張性により、赤血球が溶解した。"}],"collocations":["cause hypotonicity","induce hypotonicity","correct hypotonicity"],"synonyms":["hypoosmolarity","low osmotic pressure"],"antonyms":["hypertonicity","isotonicity"]}],"etymology":{"value":"'Hypo-' (低い) + 'tonicity' (張度) から構成される。浸透圧が低い状態を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊtəˈnɪsɪti/","syllables":"hy-po-to-nic-i-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hypotonicityは、細胞が置かれた環境の浸透圧が低い状態を指し、細胞内外の浸透圧の差によって細胞内に水が流入し、細胞が膨張する現象を引き起こす。医学、生物学、生理学の分野で重要。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The solution was hypotonic, so the cells shrunk.","correct":"✓ The solution was hypotonic, so the cells swelled.","note":"Hypotonic solutions cause cells to swell, not shrink."}],"priority":"★★☆"},"related_words":{"derivatives":["hypotonic (形容詞: 低張性の)"],"phrases":["hypotonic solution"],"priority":"★★★"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypotonicity' refers to a biological condition where a solution has a lower concentration of solutes compared to another. This causes water to move into cells, potentially causing them to swell. It's a term primarily used in scientific and medical contexts, particularly when discussing osmosis and cellular environments."},"example_sentences":[{"sentence":"The intravenous fluid was carefully formulated to avoid hypotonicity in the patient's blood.","translation":"その静脈内輸液は、患者の血液中の低張性を避けるように慎重に調合された。","type":"scientific","meaning_category":"medical"},{"sentence":"In freshwater environments, organisms must regulate their internal fluids to counteract hypotonicity.","translation":"淡水環境では、生物は低張性に対抗するために体液を調節しなければならない。","type":"biological","meaning_category":"biological"}]}