{"word":"fixed-weight","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"固定重量の、重量が固定された","english_definition":"Having a weight that is set and cannot be changed.","examples":[{"sentence":"This is a fixed-weight dumbbell, so you can't adjust the load.","translation":"これは固定重量のダンベルなので、負荷を調整できません。"},{"sentence":"Fixed-weight exercises are good for building strength in a controlled manner.","translation":"固定重量のエクササイズは、制御された方法で筋力をつけるのに適しています。"}],"collocations":["fixed-weight dumbbell","fixed-weight barbell","fixed-weight machine"],"synonyms":["non-adjustable weight","constant weight"],"antonyms":["adjustable weight","variable weight"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'fixed' (meaning unchangeable or stationary) and 'weight' (referring to the measure of heaviness).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɪkst ˈweɪt/","syllables":"fixed-weight"},"inflection":{"notes":"Since it is an adjective, it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Fixed-weight' is typically used to describe equipment or systems where the weight component is not designed to be altered by the user. This is common in some types of exercise equipment, industrial machinery, or scientific instruments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I prefer fixed weight than adjustable weight.","correct":"✓ I prefer fixed weights to adjustable weights.","note":"When comparing, use 'to' rather than 'than'. Also, 'weights' is often plural in this context."},{"incorrect":"✗ The machine has a fixed weight of 100.","correct":"✓ The machine has a fixed weight of 100 kg.","note":"Always include the unit of measurement (e.g., kg, lbs) when specifying a weight."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["weightlifting","strength training","dumbbell","barbell","resistance training"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency. Primarily used in specific contexts like fitness or engineering.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'fixed-weight' is a compound adjective used to describe something that has a weight that cannot be changed or adjusted. It is commonly used in the context of exercise equipment, such as dumbbells or barbells, where the weight is permanently set. It can also be used in other technical or engineering contexts where a component has a constant, non-adjustable weight. Understanding the term is straightforward, but its usage is limited to specific fields or discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"She prefers using fixed-weight barbells for her squats.","translation":"彼女はスクワットに固定重量のバーベルを使うのが好きです。","type":"adjective","meaning_category":"describing exercise equipment"},{"sentence":"The experiment requires a fixed-weight sample of the chemical compound.","translation":"その実験には、化学化合物の固定重量のサンプルが必要です。","type":"adjective","meaning_category":"describing scientific requirements"}]}