{"word":"Wollastonite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"珪灰石：カルシウムのケイ酸塩鉱物(CaSiO3)","english_definition":"A calcium inosilicate mineral (CaSiO3) that may contain small amounts of iron, magnesium, and manganese. It is usually white.","examples":[{"sentence":"Wollastonite is used in ceramics, plastics, and as a substitute for asbestos.","translation":"珪灰石はセラミックス、プラスチック、そしてアスベストの代替品として使用されます。"}],"collocations":["calcium silicate mineral","ceramic applications","plastic filler","asbestos substitute"],"synonyms":["calcium metasilicate"],"antonyms":[]}],"etymology":{"value":"Named after the English chemist and mineralogist William Hyde Wollaston (1766-1828).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwʊləstənaɪt/","syllables":"Woll-as-to-nite"},"inflection":{"noun_plural":"Wollastonites"},"usage_notes":{"explanation":"Wollastonite is a relatively common metamorphic mineral. It forms when impure limestone or dolomite is subjected to high temperature and pressure, sometimes in the presence of silica-bearing fluids. It is typically found in metamorphic rocks, especially in contact metamorphic zones where limestone has been altered by the intrusion of magma.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"Wollastonite is a technical term for a specific mineral, primarily used in geology, materials science, and related fields. Understanding requires familiarity with basic mineralogy and chemistry. The term is not commonly encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The sample was identified as wollastonite through X-ray diffraction.","translation":"そのサンプルは、X線回折によって珪灰石であると特定されました。","type":"scientific","meaning_category":"mineral identification"},{"sentence":"Wollastonite is added to the ceramic mixture to improve its strength and whiteness.","translation":"珪灰石は、強度と白色度を向上させるためにセラミック混合物に添加されます。","type":"industrial","meaning_category":"ceramic application"}]}