{"word":"telegrapher","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"電信技士、電信係","english_definition":"A person who operates a telegraph machine to send and receive messages.","examples":[{"sentence":"The telegrapher tapped out the message in Morse code.","translation":"電信技士はモールス信号でメッセージを打電した。"},{"sentence":"During the war, telegraphers played a crucial role in communication.","translation":"戦争中、電信技士は通信において重要な役割を果たした。"},{"sentence":"He worked as a telegrapher for the railroad company.","translation":"彼は鉄道会社で電信技士として働いていた。"}],"collocations":["railroad telegrapher","military telegrapher","skilled telegrapher","experienced telegrapher"],"synonyms":["telegraphist","wire operator"],"antonyms":[],"related_terms":["telegraph","Morse code","telegram"]}],"etymology":{"value":"From 'telegraph' + '-er'. The term 'telegraph' comes from the Greek words 'tele' (far off) and 'graphein' (to write).","priority":"★★☆"},"pronunciation":{"ipa":"/təˈlɛɡrəfər/","syllables":"te-leg-ra-pher"},"inflection":{"noun_plural":"telegraphers"},"usage_notes":{"explanation":"The term 'telegrapher' refers specifically to someone who operates a telegraph, a device used for transmitting messages over long distances using electrical signals. The role was particularly important in the 19th and early 20th centuries before the widespread adoption of telephones and other modern communication technologies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a telephone operator, not a telegrapher.","correct":"He is a telephone operator, not a telegrapher.","note":"Telegraphers use telegraphs, while telephone operators use telephones. They are distinct roles."}],"priority":"★☆☆"},"related_words":{"derivatives":["telegraphy","telegraphic"],"related_terms":["telegram","telegraph key","Morse code"]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. The term is less commonly used in modern contexts due to the decline of telegraphy.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'telegrapher' refers to someone who used to operate a telegraph machine to send and receive messages. Telegraphs were an early form of long-distance communication using electrical signals, especially common before telephones became widespread. Today, the term is less common as telegraphy is rarely used, but it might appear in historical contexts or discussions about the history of communication technology."},"example_sentences":[{"sentence":"The old **telegrapher** could send messages faster than anyone else in the station.","translation":"その年老いた電信技士は、駅の誰よりも速くメッセージを送ることができた。","type":"noun","meaning_category":"電信技士"},{"sentence":"During the Civil War, **telegraphers** were essential for relaying information between the front lines and headquarters.","translation":"南北戦争中、電信技士は前線と司令部の間で情報を伝達するために不可欠だった。","type":"noun","meaning_category":"電信技士"},{"sentence":"The **telegrapher** carefully transcribed the incoming message onto paper.","translation":"電信技士は入ってくるメッセージを注意深く紙に書き写した。","type":"noun","meaning_category":"電信技士"}]}