{"word":"indemonstrably","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"証明できないほどに、立証不可能に","english_definition":"in a manner that cannot be demonstrated or proven.","examples":[{"sentence":"The existence of God is often argued to be indemonstrably true or false.","translation":"神の存在はしばしば証明不可能であると議論される。"},{"sentence":"He claimed indemonstrably that he was the rightful heir to the throne.","translation":"彼は自分が王位の正当な後継者であると証明不可能に主張した。"},{"sentence":"The theory relies on assumptions that are indemonstrably valid.","translation":"その理論は、証明不可能な仮定に依存している。"}],"collocations":["indemonstrably true","indemonstrably false","indemonstrably valid","indemonstrably superior"],"synonyms":["unprovably","unsubstantiably","unverifiably","incontestably (ironically, sometimes used to mean the opposite)"],"antonyms":["demonstrably","provably","verifiably","substantiably"]}],"etymology":{"value":"'Indemonstrably' is formed by adding the prefix 'in-' (meaning 'not') to 'demonstrably'. 'Demonstrably' comes from 'demonstrate' which originates from Latin 'demonstrare' (to point out, show).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪndɪˈmɒnstrəbli/","syllables":"in-de-mon-stra-bly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Indemonstrably' is used to describe something that cannot be proven or shown to be true or false through evidence or logical argument. It often implies a fundamental limitation in our ability to know or prove something. It is frequently used in philosophical, scientific, or legal contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted indemonstrably.","correct":"✓ He acted irrationally.","note":"'Indemonstrably' describes the quality of something being impossible to prove, not the manner of someone's actions. Use 'irrationally' or another suitable adverb to describe how someone acted."},{"incorrect":"✗ The results were indemonstrably.","correct":"✓ The results were indemonstrable.","note":"'Indemonstrably' is an adverb; the adjective form is 'indemonstrable'."}],"priority":"★★☆"},"related_words":{"derivatives":["indemonstrable (adjective)","demonstrably (adverb)","demonstrate (verb)","demonstration (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Indemonstrably' means that something cannot be proven or shown to be true. It's a formal word often used in discussions about philosophy, science, or law when talking about ideas or claims that are impossible to verify with evidence or logic. For example, you might say that the existence of certain abstract concepts is 'indemonstrably' true or false because there's no way to prove it either way."},"example_sentences":[{"sentence":"The claim that one culture is indemonstrably superior to another is a dangerous oversimplification.","translation":"ある文化が他の文化よりも証明できないほど優れているという主張は、危険な単純化である。","type":"adverb","meaning_category":"unprovable"},{"sentence":"Whether consciousness exists independently of the brain remains indemonstrably established.","translation":"意識が脳とは独立して存在するかどうかは、依然として証明不可能である。","type":"adverb","meaning_category":"unprovable"},{"sentence":"The benefits of this policy are indemonstrably clear.","translation":"この政策の利点は、証明できないほど明らかである。","type":"adverb","meaning_category":"unprovable"}]}