{"word":"Leviticalness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality or state of being Levitical; adherence to or characteristic of the laws, customs, or traditions associated with the Levites in the Hebrew Bible.","english_definition":"The quality or state of being Levitical; adherence to or characteristic of the laws, customs, or traditions associated with the Levites in the Hebrew Bible.","examples":[{"sentence":"The strict Leviticalness of their community dictated every aspect of daily life, from dietary restrictions to ritual purity.","translation":"彼らのコミュニティの厳格なレビ的性質は、食事制限から儀式の清めまで、日常生活のあらゆる側面を決定づけた。"}],"collocations":["strict Leviticalness","religious Leviticalness","cultural Leviticalness"],"synonyms":["Leviticality","ritualism","legalism","orthodoxy"],"antonyms":["secularism","liberalism","heterodoxy"]}],"etymology":{"value":"Derived from 'Levitical' (relating to the Levites) + '-ness' (a suffix indicating a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/lɪˈvɪtɪkəlnəs/","syllables":"Li-vit-i-cal-ness"},"inflection":{"noun_plural":"Leviticalnesses (rarely used)"},"usage_notes":{"explanation":"'Leviticalness' is a relatively rare and formal term. It refers to the degree to which something embodies or adheres to the principles and practices outlined in the Book of Leviticus and associated with the Levite tribe in ancient Israel. It often implies a focus on ritual purity, adherence to religious law, and the specific duties assigned to the Levites.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Leviticalness was very kindness.","correct":"✓ The Leviticalness was characterized by strict adherence to religious law.","note":"'Leviticalness' is a quality or state, not a person or action. It should be used to describe the characteristics of something, not as a subject performing an action."}],"priority":"★★☆"},"related_words":{"derivatives":["Levitical (adjective)","Levite (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Leviticalness' is a complex and rare term primarily used in religious or historical contexts. Understanding requires familiarity with the Book of Leviticus and the role of the Levites in ancient Israel. Its usage often implies a scholarly or theological discussion. "},"example_sentences":[{"sentence":"The historian examined the degree of Leviticalness present in the ancient temple practices.","translation":"歴史家は古代の神殿の儀式に存在するレビ的性質の度合いを調べた。","type":"noun","meaning_category":"Quality of being Levitical"},{"sentence":"The community's Leviticalness was evident in its strict observance of dietary laws.","translation":"その共同体のレビ的性質は、食事に関する規則の厳格な遵守に明らかだった。","type":"noun","meaning_category":"Adherence to Levitical laws"}]}