{"word":"Egotheism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The belief that one is God, or behaves as if one is.","english_definition":"The belief that one is God, or behaves as if one is.","examples":[{"sentence":"His egotheism was evident in the way he demanded worship from his followers.","translation":"彼の自己神格化は、彼が信者からの崇拝を要求する方法に明らかだった。"},{"sentence":"The philosopher argued against egotheism, stating that no individual can truly embody divinity.","translation":"その哲学者は、自己神格化に反対し、いかなる個人も真に神性を体現することはできないと述べた。"}],"collocations":["suffer from egotheism","manifest egotheism","combat egotheism"],"synonyms":["megalomania","narcissism","delusions of grandeur"],"antonyms":["humility","self-deprecation"]}],"etymology":{"value":"The word 'Egotheism' is a combination of 'ego,' referring to the self, and 'theism,' referring to the belief in God or gods.","priority":"★★★"},"pronunciation":{"ipa":"/ˈiːɡoʊˌθiːɪzəm/","syllables":"e-go-the-ism"},"inflection":{"noun_plural":"Egotheisms"},"usage_notes":{"explanation":"Egotheism is a term used to describe the belief or behavior of someone who considers themselves to be God or acts as if they are. It is often associated with extreme narcissism or delusions of grandeur.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced egotheism by donating to charity.","correct":"✓ He practiced egotheism by demanding everyone praise him.","note":"Egotheism is about believing oneself to be God or acting as if one is, not simply doing good deeds."},{"incorrect":"✗ Egotheism is a form of religious worship.","correct":"✓ Egotheism is a belief in one's own divinity.","note":"Egotheism is not a form of religious worship but a belief in one's own divinity."}],"priority":"★★☆"},"related_words":{"derivatives":["egotheist (noun): A person who believes they are God.","egotheistic (adjective): Relating to or characterized by egotheism."],"related_terms":["theism","atheism","ego","narcissism"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Egotheism' is a complex term referring to the belief that one is God or behaves as if they are. It is often used in philosophical or psychological contexts to describe extreme narcissism or delusions of grandeur. Understanding this term requires a grasp of abstract concepts related to ego, divinity, and belief systems."},"example_sentences":[{"sentence":"His claims of being the savior of humanity reeked of egotheism.","translation":"彼の人類の救世主であるという主張は、自己神格化の臭いがした。","type":"general","meaning_category":"Belief in one's own divinity"},{"sentence":"The cult leader's egotheism led him to exploit his followers for personal gain.","translation":"そのカルト指導者の自己神格化は、彼が個人的な利益のために信者を利用することにつながった。","type":"general","meaning_category":"Belief in one's own divinity"}]}