{"word":"twice-sealed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"二重に封印された","english_definition":"Having been sealed two times.","examples":[{"sentence":"The document was kept in a twice-sealed envelope to ensure its confidentiality.","translation":"その書類は機密性を確保するために二重に封印された封筒に入れられて保管されていた。"},{"sentence":"The artifact was placed in a twice-sealed container to protect it from the elements.","translation":"その工芸品は風雨から保護するために二重に封印された容器に入れられた。"}],"collocations":["twice-sealed envelope","twice-sealed container","twice-sealed package"],"synonyms":["double-sealed"],"antonyms":["single-sealed","unsealed"]}],"etymology":{"value":"The word is formed by combining \"twice\" (meaning two times) with \"sealed\" (meaning closed or secured with a seal).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtwaɪs ˈsiːld/","syllables":"twice-sealed"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"\"Twice-sealed\" describes something that has undergone a sealing process on two separate occasions, usually for security or preservation. It implies a higher level of protection or security compared to something that is only sealed once. The term is often used in contexts where integrity and tamper-evidence are important.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The twice sealed box.","correct":"✓ The twice-sealed box.","note":"The hyphen is necessary to connect \"twice\" and \"sealed\" when used as a compound adjective before a noun."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'twice-sealed' is relatively straightforward in meaning, indicating something has been sealed on two separate occasions. It's most likely to appear in contexts where security, preservation, or tamper-evidence are important, such as describing packaging for sensitive items or documents. The hyphen connects 'twice' and 'sealed' to form a compound adjective modifying a noun."},"example_sentences":[{"sentence":"The evidence was stored in a twice-sealed bag to prevent contamination.","translation":"証拠品は汚染を防ぐために二重に封印された袋に保管された。","type":"adjective","meaning_category":"封印された"},{"sentence":"Only authorized personnel were allowed to open the twice-sealed vault.","translation":"許可された職員のみが二重に封印された金庫を開けることを許可された。","type":"adjective","meaning_category":"封印された"}]}