{"word":"nonsanctimonious","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"偽善的でない、独善的でない","english_definition":"Not sanctimonious; free from hypocrisy or excessive piousness.","examples":[{"sentence":"He offered nonsanctimonious advice based on his own experiences.","translation":"彼は自身の経験に基づいて、偽善的でないアドバイスをした。"},{"sentence":"The article presented a nonsanctimonious view of the issue.","translation":"その記事は、その問題について独善的でない見解を示した。"}],"collocations":["nonsanctimonious advice","nonsanctimonious approach","nonsanctimonious attitude"],"synonyms":["genuine","sincere","honest","unpretentious","unaffected"],"antonyms":["sanctimonious","hypocritical","self-righteous","pious"]}],"etymology":{"value":"'non-' (not) + 'sanctimonious' (making a show of being morally superior).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌsæŋktɪˈmoʊniəs/","syllables":"non-sanc-ti-mo-ni-ous"},"inflection":{"notes":"Adjectives do not inflect in English, but can be used in comparative and superlative forms (more nonsanctimonious, most nonsanctimonious)."},"usage_notes":{"explanation":"'Nonsanctimonious' is the opposite of 'sanctimonious.' It describes someone or something that is genuine, sincere, and free from any pretense of moral superiority. It is often used to praise someone for being authentic and down-to-earth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He gave a very sanctimonious speech, it was nonsanctimonious at all.","correct":"✓ He gave a very sanctimonious speech, it was not nonsanctimonious at all.","note":"The sentence structure is incorrect. The correct way to express the opposite is to say 'it was not nonsanctimonious at all' or 'it was very sanctimonious.'"},{"incorrect":"✗ The nonsanctimonious church.","correct":"✓ The genuine church.","note":"While 'nonsanctimonious' can be used, it is more common and natural to use words like 'genuine' or 'sincere' to describe a church that is not hypocritical."}],"priority":"★☆☆"},"related_words":{"derivatives":["sanctimonious (adjective)","sanctimony (noun)"],"phrases":["without sanctimony"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonsanctimonious' is a relatively uncommon word used to describe someone or something that is the opposite of 'sanctimonious.' Understanding this word requires familiarity with the meaning of 'sanctimonious' which means making a show of being morally superior. Therefore, 'nonsanctimonious' means genuine, sincere, and without any pretense of moral superiority. It is often used in formal writing or discussions. "},"example_sentences":[{"sentence":"The author's nonsanctimonious approach to the subject made the book very relatable.","translation":"著者によるその主題への独善的でないアプローチは、その本を非常に共感しやすいものにした。","type":"adjective","meaning_category":"genuine"},{"sentence":"We appreciated his nonsanctimonious honesty during the difficult conversation.","translation":"私たちは、困難な会話の中で見られた彼の偽善的でない正直さを高く評価した。","type":"adjective","meaning_category":"sincere"}]}