{"word":"white-featherism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"第一次世界大戦中に、徴兵を拒否した男性や従軍経験のない男性に対して、白い羽根（臆病者の象徴）を送りつける行為、またはその行為を支持する考え方。一般的に、愛国心や戦争支持の表明として行われた。","english_definition":"The practice, common during World War I, of presenting white feathers (a symbol of cowardice) to men who were not in military service or who had not enlisted, as a form of social shaming and pressure to enlist. More broadly, the ideology supporting this practice, often associated with jingoism and fervent support for the war effort.","examples":[{"sentence":"During World War I, many men received white feathers, often causing them significant distress and social ostracism.","translation":"第一次世界大戦中、多くの男性が白い羽根を受け取り、しばしば大きな苦痛と社会的排斥を引き起こした。"},{"sentence":"White-featherism reflected the intense social pressure to conform to patriotic expectations during wartime.","translation":"白い羽根主義は、戦時中の愛国的な期待に応えようとする強い社会的圧力を反映していた。"}],"collocations":["receive a white feather (白い羽根を受け取る)","a victim of white-featherism (白い羽根主義の犠牲者)","the spirit of white-featherism (白い羽根主義の精神)","social pressure of white-featherism (白い羽根主義の社会的圧力)"],"synonyms":["jingoism","chauvinism","war hysteria","patriotic fervor","social coercion"],"antonyms":["pacifism","conscientious objection","anti-war sentiment","tolerance","understanding"]},{"part_of_speech":"noun","definition":"(比喩的に) 特定の行動をしない人を臆病者扱いするような、社会的な圧力や非難。","english_definition":"(Figuratively) Any form of social pressure or condemnation that labels individuals as cowardly for not conforming to certain expectations, particularly in contexts involving perceived duty or patriotism.","examples":[{"sentence":"The criticism he faced for not supporting the controversial policy felt like a modern form of white-featherism.","translation":"彼が物議を醸す政策を支持しなかったことで受けた批判は、現代版の白い羽根主義のように感じられた。"},{"sentence":"She argued that the online shaming of people who didn't participate in the charity event was a kind of digital white-featherism.","translation":"彼女は、チャリティーイベントに参加しなかった人々に対するオンラインでの非難は、一種のデジタル白い羽根主義だと主張した。"}],"collocations":["modern white-featherism (現代の白い羽根主義)","digital white-featherism (デジタル白い羽根主義)","social white-featherism (社会的な白い羽根主義)"],"synonyms":["social pressure","peer pressure","shaming","ostracism","moral coercion"],"antonyms":["acceptance","tolerance","understanding","inclusivity","respect for individual choice"]}],"etymology":{"value":"「white feather (白い羽根)」は、闘鶏において、純粋な闘鶏種ではない鶏が持つとされる白い羽根が臆病さの象徴とされていたことに由来する。第一次世界大戦中に、女性たちが徴兵を拒否した男性や従軍経験のない男性に白い羽根を送りつける行為が広まり、「white-featherism」という言葉が生まれた。","priority":"★★★"},"pronunciation":{"ipa":"/ˌwaɪt ˈfɛðərɪzəm/","syllables":"white-feath-er-ism"},"inflection":{"notes":"名詞であり、複数形は通常ありません。"},"usage_notes":{"explanation":"「**white-featherism**」は、第一次世界大戦中に見られた、徴兵を拒否した男性や従軍経験のない男性を社会的圧力をかけて非難する行為を指す歴史的な用語です。白い羽根は臆病者の象徴とされ、これを送りつける行為は、愛国心や戦争支持の表明として行われました。現代では、比喩的に、特定の行動をしない人を臆病者扱いするような、社会的な圧力や非難を指すことがあります。この用語は、社会的な同調圧力や集団心理、そして個人の自由や良心の尊重といったテーマを議論する際に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a victim of white-featherism because he didn't like feathers.","correct":"✓ He was a victim of white-featherism because he was a conscientious objector during the war.","note":"「white-featherism」は、単に羽根が好きではないという理由で非難されることではなく、戦争への参加を拒否したことによって非難されることを指します。"},{"incorrect":"✗ White-featherism is a good way to encourage patriotism.","correct":"✓ White-featherism is a form of social coercion that can be harmful to individual liberties.","note":"「white-featherism」は、愛国心を奨励する良い方法とは見なされません。むしろ、個人の自由を侵害する可能性のある社会的な強制の一形態と見なされます。"}],"priority":"★☆☆"},"related_words":{"derivatives":["white feather (白い羽根)","feather (羽根)","jingoism (狂信的愛国主義)","chauvinism (排他的愛国主義)","social pressure (社会的圧力)","coercion (強制)"],"historical_context":["World War I (第一次世界大戦)","conscription (徴兵)","conscientious objector (良心的兵役拒否者)","patriotic fervor (愛国心の高揚)","social ostracism (社会的排斥)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (歴史的な文脈や専門的な議論で用いられる)","frequency_google_ngram":"低頻度 (Low frequency) - 一般的な会話ではあまり使われない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**white-featherism**」は、第一次世界大戦中に、徴兵を拒否した男性や従軍経験のない男性に対して、白い羽根を送りつける行為を指す言葉です。白い羽根は臆病者の象徴であり、この行為は、戦争に参加しない男性を社会的に非難し、圧力をかけるものでした。現代では、比喩的に、特定の行動をしない人を臆病者扱いするような、社会的な圧力や非難を指すことがあります。この言葉は、歴史的な文脈や、社会的な同調圧力、個人の自由といったテーマを議論する際に用いられます。理解するには、第一次世界大戦の歴史的背景や、白い羽根が持つ意味を理解する必要があります。"},"example_sentences":[{"sentence":"The campaign against those who refused to buy war bonds was seen by some as a form of **white-featherism**.","translation":"戦時国債の購入を拒否した人々に対するキャンペーンは、一部の人々によって白い羽根主義の一形態と見なされた。","type":"noun","meaning_category":"社会的圧力"},{"sentence":"During the war, many women actively participated in **white-featherism**, handing out feathers to men they deemed fit for service.","translation":"戦時中、多くの女性が白い羽根主義に積極的に参加し、従軍に適格と見なした男性に羽根を配った。","type":"noun","meaning_category":"歴史的な行為"},{"sentence":"The article criticized the online harassment as a type of **white-featherism** aimed at silencing dissenting voices.","translation":"その記事は、オンラインハラスメントを、異議を唱える声を封じ込めることを目的とした白い羽根主義の一種として批判した。","type":"noun","meaning_category":"比喩的な意味"}]}