{"word":"doline","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ドリーネ、石灰岩地域のすり鉢状の窪地","english_definition":"A sinkhole, typically funnel-shaped, found in karst landscapes.","examples":[{"sentence":"The hikers carefully navigated the doline-filled terrain.","translation":"ハイカーたちはドリーネでいっぱいの地形を注意深く進んだ。"},{"sentence":"Rainwater collected in the doline, creating a small pond.","translation":"雨水がドリーネに溜まり、小さな池を作った。"}],"collocations":["karst doline","collapse doline","solution doline"],"synonyms":["sinkhole","swallow hole","cenote","ponor"],"antonyms":[]}],"etymology":{"value":"The word 'doline' comes from the Slovenian word 'dolina', meaning valley.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdoʊliːn/","syllables":"do-line"},"inflection":{"noun_plural":"dolines"},"usage_notes":{"explanation":"Dolines are common features in karst landscapes, which are formed by the dissolution of soluble rocks such as limestone. They can range in size from a few meters to hundreds of meters in diameter.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":["uvala (a larger depression formed by the merging of several dolines)","karst (a landscape formed from the dissolution of soluble rocks)"],"priority":"★★☆"},"level_frequency":{"priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'doline' refers to a specific geological feature found in karst regions. Understanding this word requires familiarity with geological terminology and karst topography. It is not a commonly used word outside of geology or geography contexts."},"example_sentences":[{"sentence":"The geologist studied the formation of the doline in the limestone region.","translation":"地質学者は石灰岩地域におけるドリーネの形成を研究した。","type":"noun","meaning_category":"geology"},{"sentence":"The map indicated several dolines in the area, making navigation challenging.","translation":"地図はその地域にいくつかのドリーネがあることを示しており、ナビゲーションを困難にしていた。","type":"noun","meaning_category":"geography"}]}