{"word":"DNA-undetected","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"DNAが検出されない、DNAが検出不可能な","english_definition":"Not able to be detected by DNA analysis or testing.","examples":[{"sentence":"The suspect used specialized cleaning agents to make the crime scene DNA-undetected.","translation":"容疑者は特殊な洗浄剤を使って、犯罪現場からDNAが検出されないようにした。"},{"sentence":"The new stealth technology aims to make the vehicle DNA-undetected by forensic analysis.","translation":"その新しいステルス技術は、法医学的分析によって車両のDNAが検出されないようにすることを目的としている。"}],"collocations":["DNA-undetected sample","DNA-undetected material","make something DNA-undetected"],"synonyms":["undetectable","untraceable","unidentifiable"],"antonyms":["DNA-detectable","identifiable","traceable"]}],"etymology":{"value":"A compound word formed by combining \"DNA\" (deoxyribonucleic acid) with \"undetected,\" meaning not detected or discovered.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdiːˌɛnˈeɪ ʌndɪˈtektɪd/","syllables":"D-N-A un-de-tect-ed"},"inflection":{"notes":"Adjectives do not inflect in English, but can be used in comparative and superlative forms by adding 'more' and 'most' before the adjective, respectively (e.g., more DNA-undetected)."},"usage_notes":{"explanation":"The term \"DNA-undetected\" is often used in contexts related to forensics, crime scenes, or advanced technology where efforts are made to conceal or eliminate traces of DNA. It implies a deliberate attempt to avoid detection through standard DNA analysis methods.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The DNA was undetected.","correct":"✓ The DNA was undetected by standard methods.","note":"It is important to specify the method or technology that failed to detect the DNA, as it might be detectable with more advanced techniques."}],"priority":"★★☆"},"related_words":{"derivatives":["undetected (adjective: not detected)"],"phrasal_verbs":[],"related_terms":["DNA analysis","forensic science","crime scene","detection","trace evidence"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"DNA-undetected\" refers to something that cannot be found or identified using DNA analysis. This term is often used in discussions about crime scenes, forensic science, or advanced technologies aimed at concealing DNA evidence. Understanding this term requires a background in basic scientific concepts and an awareness of forensic techniques."},"example_sentences":[{"sentence":"The suspect's clothing was treated to be DNA-undetected, complicating the investigation.","translation":"容疑者の衣服はDNAが検出されないように処理されており、捜査を複雑にした。","type":"adjective","meaning_category":"Forensics"},{"sentence":"The research team is developing a new coating that will make surfaces DNA-undetected.","translation":"研究チームは、表面からDNAが検出されないようにする新しいコーティングを開発している。","type":"adjective","meaning_category":"Technology"},{"sentence":"The criminal meticulously cleaned the area to ensure it was DNA-undetected.","translation":"犯人はその場所をDNAが検出されないように入念に清掃した。","type":"adjective","meaning_category":"Crime Scene"}]}