{"word":"sabbatarian","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"安息日厳守主義者","english_definition":"a person who strictly observes the Sabbath, typically by refraining from secular activities.","examples":[{"sentence":"The sabbatarians in the community did not shop on Sundays.","translation":"そのコミュニティの安息日厳守主義者たちは日曜日に買い物をしなかった。"}],"collocations":["strict sabbatarian","observe the Sabbath"],"synonyms":["Sabbath keeper"],"antonyms":[]},{"part_of_speech":"adjective","definition":"安息日厳守の","english_definition":"relating to or characteristic of sabbatarians or their beliefs and practices.","examples":[{"sentence":"The town had a strong sabbatarian tradition.","translation":"その町には強い安息日厳守の伝統があった。"}],"collocations":["sabbatarian laws","sabbatarian principles"],"synonyms":["Sabbath-observing"],"antonyms":[]}],"etymology":{"value":"From 'Sabbath' + '-arian'. Refers to the strict observance of the Sabbath, typically Saturday or Sunday depending on the religious tradition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsæbəˈtɛəriən/","syllables":"sab-ba-tar-i-an"},"inflection":{"noun_plural":"sabbatarians"},"usage_notes":{"explanation":"'Sabbatarian' refers to individuals or beliefs centered on the strict observance of the Sabbath. The Sabbath is a day of rest and worship, and sabbatarians typically avoid secular activities on this day. The specific day of the Sabbath and the degree of observance can vary among different religious groups.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a sabbatarian because he likes Saturdays.","correct":"✓ He is a sabbatarian because he strictly observes the Sabbath according to his religious beliefs.","note":"Sabbatarianism is based on religious observance, not simply liking a particular day of the week."}],"priority":"★☆☆"},"related_words":{"derivatives":["Sabbath","Sabbatical"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'sabbatarian' is a specialized term related to religious practices. It refers to someone who strictly observes the Sabbath, a day of rest and worship. Understanding this word requires familiarity with religious concepts and traditions. It's not commonly used in everyday conversation but may appear in discussions about religion or history."},"example_sentences":[{"sentence":"The debate centered on whether the new law was a violation of sabbatarian principles.","translation":"その議論は、新しい法律が安息日厳守の原則に違反するかどうかに集中した。","type":"adjective","meaning_category":"安息日厳守の"},{"sentence":"Many early American colonies were founded by sabbatarians seeking religious freedom.","translation":"初期のアメリカの植民地の多くは、宗教的自由を求める安息日厳守主義者によって設立された。","type":"noun","meaning_category":"安息日厳守主義者"}]}