{"word":"de-seasonalize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"季節性をなくす、季節変動を取り除く","english_definition":"To remove the seasonal component from (data); to make (something) independent of the seasons.","examples":[{"sentence":"The company is trying to de-seasonalize its product line by introducing items that are not tied to specific holidays.","translation":"その会社は、特定の祝日に結びついていない商品を導入することで、製品ラインの季節性をなくそうとしています。"},{"sentence":"Economists often de-seasonalize economic data to better understand underlying trends.","translation":"経済学者は、根本的な傾向をより良く理解するために、経済データを季節調整することがよくあります。"}],"collocations":["de-seasonalize data (データを季節調整する)","de-seasonalize sales (売上の季節性をなくす)","de-seasonalize a product (製品の季節性をなくす)"],"synonyms":["seasonally adjust","deseasonalize","remove seasonality"],"antonyms":["seasonalize"],"related_words":["seasonality (名詞: 季節性)","seasonal (形容詞: 季節的な)"]}],"etymology":{"value":"接頭辞 \"de-\" (取り除く) + \"seasonalize\" (季節性を持たせる)","priority":"★★★"},"pronunciation":{"ipa":"/diːˈsiːzənəlaɪz/","syllables":"de-sea-son-al-ize"},"inflection":{"verb_forms":{"present_simple":["de-seasonalize","de-seasonalizes"],"past_simple":"de-seasonalized","past_participle":"de-seasonalized","present_participle":"de-seasonalizing"}},"usage_notes":{"explanation":"This term is commonly used in business, economics, and statistics to describe the process of removing the impact of seasonal variations from data. This allows for a clearer understanding of long-term trends and underlying patterns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company desezonalized their products.","correct":"✓ The company de-seasonalized their products.","note":"The correct spelling includes a hyphen between 'de' and 'seasonalized'."}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'de-seasonalize' is a technical term used to describe the process of removing the effects of seasonal changes from data. This is often done to analyze underlying trends in areas like economics or business. It's formed by adding the prefix 'de-' to 'seasonalize', indicating the reversal of the process. Understanding this word requires familiarity with statistical and analytical concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The retailer decided to de-seasonalize its clothing line to offer year-round options.","translation":"その小売業者は、年間を通して選択肢を提供するために、衣料品ラインの季節性をなくすことを決定しました。","type":"general"},{"sentence":"By de-seasonalizing the sales data, the marketing team could identify the impact of their new advertising campaign.","translation":"売上データを季節調整することで、マーケティングチームは新しい広告キャンペーンの影響を特定できました。","type":"business"},{"sentence":"The central bank uses de-seasonalized figures to assess the true state of the economy.","translation":"中央銀行は、経済の真の状態を評価するために、季節調整済みの数値を使用しています。","type":"economics"}]}