{"word":"Reformasi","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(インドネシア語)改革、刷新","english_definition":"(Indonesian) Reformation; a period of political and economic reform in Indonesia, particularly after the fall of Suharto in 1998.","examples":[{"sentence":"Era Reformasi dimulai setelah jatuhnya Soeharto.","translation":"Reformasi era began after the fall of Suharto.","english_translation":"The Reformasi era began after the fall of Suharto."},{"sentence":"Tuntutan Reformasi meliputi pemberantasan korupsi, kolusi, dan nepotisme.","translation":"Reformasi demands include the eradication of corruption, collusion, and nepotism.","english_translation":"The Reformasi demands include the eradication of corruption, collusion, and nepotism."}],"collocations":["Era Reformasi (Reformasi era)","Tuntutan Reformasi (Reformasi demands)","Gerakan Reformasi (Reformasi movement)"],"synonyms":["perubahan (change)","pembaruan (renewal)","revolusi (revolution)"],"antonyms":["status quo (status quo)","kemapanan (establishment)"]}],"etymology":{"value":"Derived from the Dutch word 'reformatie', which itself comes from the Latin 'reformatio' (renewal, restoration).","priority":"★★☆"},"pronunciation":{"ipa":"/re.forˈma.si/","syllables":"re-for-ma-si"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"'Reformasi' is a specific term in Indonesian history and politics, referring to the period of significant political and social change following the end of Suharto's rule. It encompasses demands for greater democracy, transparency, and an end to corruption. It is often capitalized to denote this specific historical period.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The reformation in Indonesia was peaceful.","correct":"✓ The Reformasi in Indonesia was largely peaceful.","note":"While the Reformasi period aimed for peaceful change, there were instances of unrest and violence. Using 'largely peaceful' provides a more accurate description."}],"priority":"★★☆"},"related_words":{"derivatives":["mereformasi (to reform)","reformis (reformer)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specific to Indonesian context)","frequency_google_ngram":"Moderate frequency within Indonesian texts related to politics and history.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reformasi' is a term deeply rooted in Indonesian political discourse. Understanding its significance requires knowledge of Indonesian history and the socio-political context of the late 1990s. While the word itself is relatively straightforward, grasping the full implications of the Reformasi era demands a more nuanced understanding of Indonesian society and its challenges during that period."},"example_sentences":[{"sentence":"Mahasiswa memainkan peran penting dalam gerakan Reformasi.","translation":"Students played an important role in the Reformasi movement.","english_translation":"Students played an important role in the Reformasi movement.","type":"noun","meaning_category":"Political Reform"},{"sentence":"Setelah Reformasi, banyak partai politik baru bermunculan.","translation":"After Reformasi, many new political parties emerged.","english_translation":"After Reformasi, many new political parties emerged.","type":"noun","meaning_category":"Political Reform"}]}