{"word":"discerpibility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に法律)契約を解除できる性質、解除可能性","english_definition":"The quality or state of being discerptible; the capability of being broken or dissolved; especially, the capability of having a contract broken or dissolved.","examples":[{"sentence":"The discerpibility of the contract was a key point in the legal proceedings.","translation":"その契約の解除可能性は、法的手続きにおける重要な点だった。"}],"collocations":[],"synonyms":["rescindability","cancellability","voidability"],"antonyms":["indissolubility","inseverability"]}],"etymology":{"value":"From discerptible + -ity. Discerptible is from Latin discerptus, past participle of discerpere (to tear apart, scatter).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˌsɜːrpɪˈbɪləti/","syllables":"di-serp-i-bil-i-ty"},"inflection":{"noun_plural":"discerpibilities"},"usage_notes":{"explanation":"'Discerpibility' is a relatively rare and formal term, primarily used in legal contexts. It refers to the characteristic of something, especially a contract or agreement, that allows it to be terminated or dissolved. It is closely related to the concept of rescindability or cancellability.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["discerptible"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Discerpibility' is a highly specialized term primarily encountered in legal and academic contexts. Understanding this word requires familiarity with legal terminology and abstract concepts related to contract law. Due to its limited usage and complex nature, it is considered an advanced vocabulary word.","note":"This word is not commonly used in everyday conversation and is mostly found in legal or academic texts."},"example_sentences":[{"sentence":"The judge considered the discerpibility of the clause before making a ruling.","translation":"裁判官は判決を下す前に、その条項の解除可能性を検討した。","type":"noun","meaning_category":"解除可能性"},{"sentence":"Due to unforeseen circumstances, the discerpibility of the agreement became a central issue.","translation":"予期せぬ事態により、合意の解除可能性が中心的な問題となった。","type":"noun","meaning_category":"解除可能性"}]}