{"word":"odalisks","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的に) オスマン帝国のハーレムにいた女性奴隷、または妾。特に、西洋美術において、オリエンタリズムの文脈で描かれた、横たわるまたはくつろぐ女性のヌードまたはセミヌードの姿。","english_definition":"(Historically) a female slave or concubine in the Ottoman harem. More specifically, in Western art, a reclining or lounging female nude or semi-nude figure, often depicted in an Orientalist context.","examples":[{"sentence":"The painting featured several odalisks in various poses.","translation":"その絵には、様々なポーズのオダリスクが何人か描かれていた。"},{"sentence":"Many 19th-century artists were fascinated by the exoticism of odalisks.","translation":"19世紀の多くの芸術家は、オダリスクのエキゾチズムに魅了された。"}],"collocations":["harem odalisks (ハーレムのオダリスク)","reclining odalisks (横たわるオダリスク)","exotic odalisks (エキゾチックなオダリスク)"],"synonyms":["concubine","slave girl","harem girl"],"antonyms":[]}],"etymology":{"value":"フランス語の「odalisque」から派生。トルコ語の「odalık」に由来し、「oda」（部屋）に関連する。つまり、「部屋付きの女性」を意味する。オスマン帝国のハーレムにおける女性奴隷の役割を示唆する。","priority":"★★☆"},"pronunciation":{"ipa":"ˈoʊdəlɪsks","syllables":"o-da-lisks"},"inflection":{"noun_plural":"odalisks (複数形)"},"usage_notes":{"explanation":"「**odalisks**」は、歴史的な文脈ではオスマン帝国のハーレムにいた女性奴隷を指しますが、現代では主に西洋美術におけるオリエンタリズムの表現として用いられることが多いです。特に、横たわるまたはくつろぐ女性のヌードやセミヌードの姿を描いた絵画や彫刻を指します。この言葉は、しばしばエキゾチックで官能的なイメージと結び付けられていますが、同時に、植民地主義的な視点や女性の客体化といった問題も孕んでいます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was an odalisks in the modern sense.","correct":"✓ She was a concubine in the Ottoman harem.","note":"現代的な意味での「odalisks」という言葉の使用は不適切です。歴史的な文脈で使用するか、美術作品の解説に限るべきです。"},{"incorrect":"✗ The odalisks were all powerful women in the Ottoman court.","correct":"✓ The odalisks were female slaves or concubines in the Ottoman harem.","note":"オダリスクは、オスマン帝国の宮廷で権力を持っていたわけではありません。彼女たちは奴隷または妾でした。"}],"priority":"★★☆"},"related_words":{"derivatives":["odalisque (単数形)","Orientalism (オリエンタリズム)","harem (ハーレム)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 美術史や歴史の文脈でのみ使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**odalisks**」は、美術史やオリエンタリズムの文脈で使われる専門的な単語です。オスマン帝国のハーレムにいた女性奴隷、特に西洋美術において、横たわるまたはくつろぐ女性のヌードやセミヌードの姿を描いた絵画や彫刻を指します。この言葉は、エキゾチックで官能的なイメージと結び付けられていますが、植民地主義的な視点や女性の客体化といった問題も孕んでいることを理解しておく必要があります。美術史や歴史に関する専門的な文章を読む際に遭遇する可能性があります。"},"example_sentences":[{"sentence":"Ingres's \"La Grande Odalisque\" is a famous example of Orientalist art.","translation":"アングルの「グランド・オダリスク」は、オリエンタリズム美術の有名な例である。","type":"noun","meaning_category":"美術作品の題材"},{"sentence":"The exhibition featured a collection of paintings depicting odalisks in various settings.","translation":"その展覧会では、様々な設定でオダリスクを描いた絵画のコレクションが展示されていた。","type":"noun","meaning_category":"美術作品の題材"},{"sentence":"The artist's portrayal of odalisks has been criticized for its objectification of women.","translation":"その芸術家によるオダリスクの描写は、女性の客体化として批判されている。","type":"noun","meaning_category":"美術作品の題材"}]}