{"word":"fixed-layout","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(主に電子書籍に関して)固定レイアウトの、固定配置の","english_definition":"(primarily in reference to ebooks) having a layout where the position of text and images is fixed and does not reflow to fit different screen sizes or orientations.","examples":[{"sentence":"This ebook is in fixed-layout format, so the text won't resize when you zoom in.","translation":"この電子書籍は固定レイアウト形式なので、拡大してもテキストのサイズは変わりません。"},{"sentence":"Fixed-layout ebooks are often used for children's books and comics to preserve the original design.","translation":"固定レイアウトの電子書籍は、元のデザインを維持するために、子供向けの本やコミックによく使用されます。"}],"collocations":["fixed-layout ebook","fixed-layout format","fixed-layout design"],"synonyms":["non-reflowable","static layout"],"antonyms":["reflowable","dynamic layout"]}],"etymology":{"value":"'fixed'（固定された）と 'layout'（レイアウト、配置）の複合語。電子書籍の登場とともに生まれた比較的新しい用語。","priority":"★★★"},"pronunciation":{"ipa":"/ˌfɪkst ˈleɪˌaʊt/","syllables":"fixed-lay-out"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**fixed-layout**」は、主に電子書籍の分野で使用される用語で、テキストや画像の配置が固定されており、画面サイズや向きに合わせて自動的にリフロー（再配置）されないレイアウト形式を指します。この形式は、特にデザインが重要なコンテンツ（子供向けの本、コミック、雑誌など）に適しています。ただし、文字サイズを変更したり、異なるデバイスで閲覧したりする際の柔軟性は低くなります。対義語は「reflowable layout」（リフローレイアウト）で、こちらはテキストが画面に合わせて自動的に調整されます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This website has a fixed-layout, so it's not responsive.","correct":"✓ This website has a fixed width layout, so it's not responsive.","note":"ウェブサイトの場合、'fixed-width layout'（固定幅レイアウト）という用語がより一般的です。'fixed-layout' は主に電子書籍に使われます。"},{"incorrect":"✗ The fixed layout is better because it's more flexible.","correct":"✓ The reflowable layout is better because it's more flexible. / ✓ The fixed layout is better because it preserves the design.","note":"固定レイアウトは柔軟性よりも、デザインの維持を重視します。柔軟性を求めるならリフローレイアウトが適しています。"}],"priority":"★★☆"},"related_words":{"derivatives":["fixed (形容詞: 固定された)","layout (名詞: レイアウト、配置)"],"phrasal_verbs":[],"related_terms":["reflowable layout","epub","mobi","kindle","ebook"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (専門用語)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 電子書籍関連の専門分野で使われる。","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"「**fixed-layout**」は、主に電子書籍で使われる言葉で、本の中の文字や絵の位置が固定されていることを意味します。画面の大きさを変えても、文字が自動的に並び変わることはありません。絵本や漫画など、デザインが重要な本によく使われます。ウェブサイトで同じような意味で使いたい場合は、「fixed-width layout（固定幅レイアウト）」という言葉を使う方が一般的です。"},"example_sentences":[{"sentence":"The artist preferred a **fixed-layout** for the digital version of his graphic novel.","translation":"そのアーティストは、自身のグラフィックノベルのデジタル版に固定レイアウトを選んだ。","type":"adjective","meaning_category":"固定レイアウトの"},{"sentence":"**Fixed-layout** ebooks can accurately replicate the look and feel of a printed book.","translation":"固定レイアウトの電子書籍は、印刷された本の見た目と雰囲気を正確に再現できる。","type":"adjective","meaning_category":"固定レイアウトの"},{"sentence":"Many interactive children's books are designed with a **fixed-layout** to maintain the placement of animations and sound effects.","translation":"多くの子ども向けのインタラクティブな本は、アニメーションや効果音の配置を維持するために固定レイアウトで設計されている。","type":"adjective","meaning_category":"固定レイアウトの"}]}