{"word":"endosarcode","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(細胞生物学)サルコメアのZ板に付着する、サルコメアの構造的および機能的完全性を維持するのに役立つタンパク質複合体。","english_definition":"(Cell Biology) A protein complex that attaches to the Z-discs of the sarcomere and helps maintain the structural and functional integrity of the sarcomere.","examples":[{"sentence":"The endosarcode plays a crucial role in muscle contraction.","translation":"エンドサルコードは筋肉の収縮において重要な役割を果たします。"},{"sentence":"Mutations in endosarcode components can lead to muscle diseases.","translation":"エンドサルコードの構成要素の変異は、筋肉疾患を引き起こす可能性があります。"}],"collocations":["endosarcode complex","endosarcode protein","muscle endosarcode"],"synonyms":["Z-disc protein complex"],"antonyms":[]}],"etymology":{"value":"The term 'endosarcode' is derived from 'endo-' (meaning 'within' or 'inner'), 'sarco-' (referring to muscle tissue), and '-code' (implying a structural or functional element).","priority":"N/A"},"pronunciation":{"ipa":"/ˌɛndoʊˈsɑːrkoʊd/","syllables":"en-do-sar-code"},"inflection":{"noun_plural":"endosarcode"},"usage_notes":{"explanation":"'Endosarcode' is a relatively specialized term used within the field of cell biology, specifically in the context of muscle cell structure and function. It refers to a complex of proteins associated with the Z-discs of sarcomeres, which are the fundamental contractile units of muscle cells.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["sarcomere","Z-disc","muscle fiber","myofibril"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Specialized scientific term.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Endosarcode' is a highly specialized term used in cell biology, specifically related to muscle cell structure. Understanding this term requires a background in biology and familiarity with the structure of sarcomeres within muscle fibers. It is not a term commonly encountered outside of scientific literature and advanced biology courses."},"example_sentences":[{"sentence":"The integrity of the endosarcode is essential for proper muscle function.","translation":"エンドサルコードの完全性は、適切な筋肉機能に不可欠です。","type":"noun","meaning_category":"Cell Biology"},{"sentence":"Researchers are studying the role of the endosarcode in various muscle disorders.","translation":"研究者たちは、さまざまな筋肉疾患におけるエンドサルコードの役割を研究しています。","type":"noun","meaning_category":"Cell Biology"}]}