{"word":"Dewali","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ディワリ (ヒンドゥー教の光の祭典)","english_definition":"Diwali, also known as Deepavali, is a major Hindu festival celebrated in India and other parts of the world. It symbolizes the victory of light over darkness, good over evil, and knowledge over ignorance.","examples":[{"sentence":"Dewali is a time for family gatherings and celebrations.","translation":"ディワリは家族が集まり、祝う時です。"},{"sentence":"Many people light diyas (oil lamps) during Dewali.","translation":"多くの人々がディワリの間にディヤ（オイルランプ）を灯します。"},{"sentence":"Sweets and gifts are exchanged during Dewali.","translation":"ディワリの間には、お菓子や贈り物が交換されます。"}],"collocations":["celebrate Dewali","Dewali festival","light diyas for Dewali","Dewali sweets","Dewali gifts"],"synonyms":["Deepavali","Festival of Lights"],"antonyms":[]}],"etymology":{"value":"The name 'Dewali' or 'Deepavali' is derived from the Sanskrit word 'Deepavali,' which means 'row of lights.'","priority":"★★★"},"pronunciation":{"ipa":"/dɪˈwɑːli/","syllables":"Di-wa-li"},"inflection":{"notes":"It is a noun and does not have plural forms in the same way as regular English nouns. You can say 'Dewali celebrations' to refer to multiple celebrations of Dewali."},"usage_notes":{"explanation":"'Dewali' refers to the Hindu festival of lights. It is a time of celebration, family gatherings, and religious observances. The festival is celebrated over several days, with each day having its own significance. It's important to note that while 'Dewali' and 'Deepavali' are often used interchangeably, 'Deepavali' is the more traditional Sanskrit name.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to a Dewali's party.","correct":"✓ I'm going to a Dewali party.","note":"Dewali is used as an adjective here, so it doesn't need an apostrophe."},{"incorrect":"✗ Dewali are celebrated in India.","correct":"✓ Dewali is celebrated in India.","note":"Dewali is the name of the festival, so it's treated as a singular noun."}],"priority":"★★☆"},"related_words":{"derivatives":["Diya (oil lamp)","Rangoli (colorful designs made on the floor)","Lakshmi Puja (worship of the goddess Lakshmi)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (depending on context; generally used when discussing cultural events)","frequency_google_ngram":"Moderate frequency, especially in contexts related to Indian culture and festivals.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Dewali' is a name for a big festival celebrated by Hindus. It's also called 'Deepavali.' It's a time when people light lamps and celebrate good things winning over bad things. Think of it like a holiday with lots of lights and fun for families.","priority":"★★★"},"example_sentences":[{"sentence":"We celebrate Dewali with our family every year.","translation":"私たちは毎年家族とディワリを祝います。","type":"general","meaning_category":"celebration"},{"sentence":"The streets are decorated with lights during Dewali.","translation":"ディワリの間、通りはライトで飾られます。","type":"general","meaning_category":"decoration"},{"sentence":"Lakshmi Puja is an important part of the Dewali celebrations.","translation":"ラクシュミープージャーはディワリのお祝いの重要な部分です。","type":"religious","meaning_category":"religious observance"}]}