{"word":"Unchristianliness","priority":"low","meanings":[{"part_of_speech":"noun","definition":"非キリスト教的な性質、不信心、不道徳","english_definition":"The quality or state of being unchristian; deviation from Christian principles or behavior.","examples":[{"sentence":"His unchristianliness was evident in his cruel actions.","translation":"彼の非キリスト教的な性質は、彼の残酷な行動に明らかだった。"},{"sentence":"The unchristianliness of their business practices was widely criticized.","translation":"彼らのビジネス慣行の不信心さは広く批判された。"}],"collocations":["display unchristianliness","act with unchristianliness","evidence of unchristianliness"],"synonyms":["impiety","immorality","irreligion","wickedness"],"antonyms":["Christianliness","piety","morality","righteousness"]}],"etymology":{"value":"Formed from 'unchristianly' (not conforming to Christian principles) + '-ness' (suffix denoting a state or quality).","priority":"low"},"pronunciation":{"ipa":"/ʌnˌkrɪstʃənliˈnɛs/","syllables":"un-chris-tian-li-ness"},"inflection":{"noun_plural":"Unchristianlinesses (rarely used)"},"usage_notes":{"explanation":"'Unchristianliness' is a relatively uncommon word used to describe behavior or qualities that are contrary to Christian teachings or values. It often implies a lack of compassion, morality, or ethical conduct.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of unchristianliness behavior.","correct":"✓ He showed a lot of unchristianliness.","note":"'Unchristianliness' is a noun and does not need to be followed by 'behavior' unless you want to emphasize the type of behavior."}],"priority":"low"},"related_words":{"derivatives":["unchristianly (adjective, adverb)","christianliness (noun)"],"priority":"low"},"level_frequency":{"CEFR":"NA","frequency_google_ngram":"Very low frequency","priority":"low"},"readability_explanation":{"level":"C2","text":"'Unchristianliness' is a complex and relatively rare word. It is formed by adding the prefix 'un-' and the suffix '-ness' to 'Christian.' It describes the state or quality of not being Christian-like, often implying a deviation from moral or ethical principles associated with Christianity. Due to its rarity and complexity, it is typically encountered in advanced texts or discussions. Understanding the root word 'Christian' and the functions of the prefix and suffix is essential for comprehending its meaning."},"example_sentences":[{"sentence":"The politician's ruthless tactics demonstrated a profound unchristianliness.","translation":"その政治家の冷酷な戦術は、深い非キリスト教的な性質を示していた。","type":"general","meaning_category":"Immorality"},{"sentence":"The community condemned the unchristianliness of the company's exploitative labor practices.","translation":"地域社会は、その企業の搾取的な労働慣行の不信心さを非難した。","type":"business/ethics","meaning_category":"Irreligion"},{"sentence":"His unchristianliness was apparent in his refusal to forgive his enemies.","translation":"彼の非キリスト教的な性質は、敵を許すことを拒否したことに明らかだった。","type":"moral","meaning_category":"Lack of Compassion"}]}