{"word":"phrenography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"骨相学の図解、骨相図","english_definition":"A description or delineation of the faculties of the mind, as indicated by the external form of the cranium; a phrenological chart or diagram.","examples":[{"sentence":"The phrenography showed a large bump in the area associated with ambition.","translation":"その骨相図は、野心に関連する領域に大きな隆起を示していた。"},{"sentence":"Early phrenography was used to attempt to classify individuals based on their skull shape.","translation":"初期の骨相図は、個人の頭蓋骨の形状に基づいて分類を試みるために使用された。"}],"collocations":["phrenological chart","phrenological diagram","study of phrenography"],"synonyms":["phrenological chart","craniography","phrenological map"],"antonyms":[]}],"etymology":{"value":"From phreno- (mind) + -graphy (writing, description).","priority":"★★★"},"pronunciation":{"ipa":"/frɪˈnɒɡrəfi/","syllables":"phre-nog-ra-phy"},"inflection":{"noun_plural":"phrenographies"},"usage_notes":{"explanation":"Phrenography is primarily a historical term related to phrenology, a pseudoscience that attempted to determine personality traits and mental abilities based on the shape of the skull. It is rarely used in modern contexts outside of historical discussions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used phrenography to cure his headache.","correct":"✓ He consulted a phrenologist for a phrenography.","note":"Phrenography is a chart or description, not a treatment. A phrenologist might create a phrenography. "},{"incorrect":"✗ Phrenography is a branch of modern psychology.","correct":"✓ Phrenography is related to the historical pseudoscience of phrenology.","note":"Phrenology and phrenography are not considered valid sciences today."}],"priority":"★★☆"},"related_words":{"derivatives":["phrenograph (noun: an instrument for measuring the skull)","phrenological (adjective: relating to phrenology)","phrenologist (noun: someone who practices phrenology)","phrenology (noun: the study of the skull to determine mental traits)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Phrenography' is a highly specialized and technical term related to the historical pseudoscience of phrenology. It refers to the description or charting of the skull's features to infer mental faculties. Due to its limited use and historical context, it is not commonly encountered in general language or even in most academic settings outside of the history of science or pseudoscience."},"example_sentences":[{"sentence":"The old book contained detailed phrenography of various historical figures.","translation":"その古い本には、様々な歴史上の人物の詳細な骨相図が含まれていた。","type":"noun","meaning_category":"図解"},{"sentence":"Phrenography was used to create detailed maps of the skull's surface.","translation":"骨相図は、頭蓋骨の表面の詳細な地図を作成するために使用された。","type":"noun","meaning_category":"図解"}]}