{"word":"rhetoricizing","priority":"★☆☆","meanings":[{"part_of_speech":"verb (present participle)","definition":"美辞麗句を弄する、修辞を凝らす、大げさに話す、空虚な言葉を並べる","english_definition":"To use rhetoric, especially in an insincere or bombastic way; to engage in empty or exaggerated speech.","examples":[{"sentence":"He was just rhetoricizing about the need for change, but he didn't offer any concrete solutions.","translation":"彼は変化の必要性について美辞麗句を弄していただけで、具体的な解決策は何も提示しなかった。"},{"sentence":"The politician spent most of his speech rhetoricizing rather than addressing the real issues.","translation":"政治家は演説のほとんどを、実際の問題に取り組むのではなく、美辞麗句を弄することに費やした。"},{"sentence":"Stop rhetoricizing and tell me what you really think.","translation":"美辞麗句を弄するのはやめて、本当に思っていることを教えて。"}],"collocations":["rhetoricizing about (～について美辞麗句を弄する)","rhetoricizing on (～について美辞麗句を弄する)","empty rhetoricizing (空虚な美辞麗句)"],"synonyms":["grandiloquence","bombast","oratory","declamation","pontificating","perorating"],"antonyms":["plain speaking","directness","honesty","sincerity"]}],"etymology":{"value":"The word is derived from 'rhetoric,' which comes from the Greek word 'rhētorikós' meaning 'skilled in oratory.' The suffix '-ize' indicates the act of doing or practicing something. 'Rhetoricizing' thus means engaging in the practice of rhetoric, often with a negative connotation of insincerity or exaggeration.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈtɒrɪsaɪzɪŋ/","syllables":"rhe-tor-i-ciz-ing"},"inflection":{"verb_forms":{"present_simple":["rhetoricize","rhetoricizes"],"past_simple":"rhetoricized","past_participle":"rhetoricized","present_participle":"rhetoricizing"}},"usage_notes":{"explanation":"'Rhetoricizing' typically carries a negative connotation, suggesting that the speaker is more interested in using impressive language than in conveying genuine meaning or offering practical solutions. It implies a focus on style over substance. It is often used to criticize politicians, public speakers, or writers who are perceived as being insincere or manipulative.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She was rhetoricizing the truth.","correct":"✓ She was distorting the truth with rhetoric.","note":"'Rhetoricizing' usually refers to the act of speaking or writing in a rhetorical manner, not directly manipulating the truth. One might *distort* the truth *using* rhetoric."},{"incorrect":"✗ He is a rhetoricizing person.","correct":"✓ He is a rhetorical person. / ✓ He is rhetoricizing.","note":"To describe someone who uses rhetoric frequently, use 'rhetorical' as an adjective. 'Rhetoricizing' is the present participle, describing the action of using rhetoric."}],"priority":"★★☆"},"related_words":{"derivatives":["rhetoric (名詞: 修辞、美辞麗句)","rhetorical (形容詞: 修辞的な、美辞麗句の)","rhetorician (名詞: 修辞家、弁論家)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rhetoricizing' means to use language in a way that is overly elaborate, insincere, or designed to impress rather than to communicate clearly. It often implies that the speaker is more concerned with the style of their speech than with the substance of what they are saying. This word is typically used in critical contexts to suggest that someone is being manipulative or dishonest through their use of language."},"example_sentences":[{"sentence":"The professor accused the student of rhetoricizing in his essay instead of providing evidence.","translation":"教授は学生に対し、エッセイで証拠を示す代わりに美辞麗句を弄していると非難した。","type":"verb (present participle)","meaning_category":"美辞麗句を弄する"},{"sentence":"The debate was filled with politicians rhetoricizing about their plans for the future.","translation":"討論会は、政治家たちが将来の計画について美辞麗句を弄することで埋め尽くされた。","type":"verb (present participle)","meaning_category":"大げさに話す"},{"sentence":"Instead of offering real solutions, he kept rhetoricizing about the importance of unity.","translation":"彼は現実的な解決策を提示する代わりに、団結の重要性について美辞麗句を弄り続けた。","type":"verb (present participle)","meaning_category":"空虚な言葉を並べる"}]}