{"word":"incameration","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)（教会財産などの）国家への編入、国有化","english_definition":"(law) the incorporation of ecclesiastical property into the state domain; nationalization of church property.","examples":[{"sentence":"The incameration of church lands was a significant event in the history of the country.","translation":"教会領の国家への編入は、その国の歴史において重要な出来事でした。"}],"collocations":["incameration of church property","incameration of ecclesiastical lands"],"synonyms":["nationalization","confiscation","expropriation"],"antonyms":["privatization","restoration"]}],"etymology":{"value":"Derived from the Italian word 'incamerare', meaning 'to incorporate into the Camera' (the state treasury). The term refers to the process of incorporating church or other institutional property into the state's financial holdings.","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˌkæməˈreɪʃən/","syllables":"in-cam-er-a-tion"},"inflection":{"noun_plural":"incamerations"},"usage_notes":{"explanation":"The term 'incameration' is primarily used in historical and legal contexts to describe the appropriation of church or institutional property by the state. It is often associated with periods of political upheaval or secularization.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The incameration was a voluntary act by the church.","correct":"✓ The incameration was a forced act by the state.","note":"Incameration is typically a forced seizure of property by the state, not a voluntary act."}],"priority":"★★☆"},"related_words":{"derivatives":["incamerate (verb): to incorporate into the state domain"],"related_terms":["secularization","nationalization","expropriation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Incameration' is a specialized term primarily used in historical and legal discussions concerning the appropriation of church or institutional property by the state. Due to its specific and infrequent usage, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The decree ordered the incameration of all monastic estates.","translation":"その法令は、すべての修道院の財産の国家への編入を命じた。","type":"noun","meaning_category":"国家への編入"},{"sentence":"The incameration significantly altered the balance of power between the church and the state.","translation":"国家への編入は、教会と国家の間の勢力均衡を大きく変えた。","type":"noun","meaning_category":"国家への編入"}]}