{"word":"Sarraceniaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"サラセニア科：北米原産の食虫植物の一科。","english_definition":"The pitcher plant family, native to North America.","examples":[{"sentence":"Sarraceniaceae are carnivorous plants that trap insects in their pitcher-shaped leaves.","translation":"サラセニア科は、筒状の葉の中に昆虫を閉じ込める食虫植物です。"}],"collocations":[],"synonyms":["pitcher plant family"],"antonyms":[]}],"etymology":{"value":"New Latin, from Sarracenia (the type genus) + -aceae (suffix denoting a family). Sarracenia is named after Dr. Michael Sarrazin, a French-Canadian physician and naturalist.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌsærəsɪˈniːeɪsiː/","syllables":"Sar-ra-ce-ni-a-ce-ae"},"inflection":{"noun_plural":"Sarraceniaceaes or Sarraceniaceae (though the latter is more common, as it's already a plural form in botanical nomenclature)"},"usage_notes":{"explanation":"Sarraceniaceae refers to the entire family of pitcher plants native to North America. Individual species are referred to by their genus and species names (e.g., Sarracenia purpurea).","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Sarracenia (genus)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Sarraceniaceae is a scientific term used in botany to refer to a specific family of carnivorous plants. Understanding this term requires a background in biology or botany. The word itself is derived from the genus name Sarracenia, which is named after a person, combined with a suffix that indicates a family in biological classification. It is not a word commonly used in everyday language."},"example_sentences":[{"sentence":"The bogs of the southeastern United States are home to many species of Sarraceniaceae.","translation":"アメリカ合衆国南東部の湿地帯には、多くのサラセニア科の植物が生息しています。","type":"noun","meaning_category":"Botanical Family"}]}