{"word":"psammophile","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"砂地を好む生物（植物または動物）","english_definition":"An organism (plant or animal) that prefers or thrives in sandy soils or environments.","examples":[{"sentence":"Many desert plants are psammophiles, adapted to survive in sandy conditions.","translation":"多くの砂漠植物は砂地を好む生物であり、砂地の環境で生き残るように適応している。"},{"sentence":"Certain species of beetles are psammophiles, living exclusively in sandy coastal regions.","translation":"ある種の甲虫は砂地を好む生物であり、砂地の海岸地域にのみ生息している。"}],"collocations":["desert psammophile","coastal psammophile","psammophile vegetation","psammophile beetle"],"synonyms":["arenophile"],"antonyms":[],"notes":"The term is often used in ecology and biology."}],"etymology":{"value":"Derived from the Greek words 'psammos' (ψάμμος) meaning 'sand' and 'philos' (φίλος) meaning 'loving' or 'fond of'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsæməfaɪl/","syllables":"psam-mo-phile"},"inflection":{"noun_plural":"psammophiles"},"usage_notes":{"explanation":"'Psammophile' is a relatively specialized term used in scientific contexts, particularly in ecology, botany, and zoology. It describes organisms that have specific adaptations that allow them to thrive in sandy environments, which are often nutrient-poor and subject to drought. These adaptations can include specialized root systems in plants or burrowing behaviors in animals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The psammophile is growing well in my garden.","correct":"✓ The plant, a psammophile, is growing well in sandy soil in my garden.","note":"'Psammophile' describes a type of organism, not a specific organism. It needs context (e.g., 'plant', 'animal') for clarity."},{"incorrect":"✗ Psammophiles are only found in deserts.","correct":"✓ Psammophiles can be found in various sandy environments, including deserts and coastal areas.","note":"Psammophiles are not limited to deserts; they can also be found in coastal dunes, sandy riverbanks, and other sandy habitats."}],"priority":"★☆☆"},"related_words":{"derivatives":["psammophilic (adjective)","psammophily (noun: the characteristic of being a psammophile)"],"phrases":["psammosere (a plant succession that originates in sand)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Psammophile' is a scientific term used to describe organisms that are adapted to live in sandy environments. It is derived from Greek roots and is typically encountered in ecological or biological contexts. The word implies specific adaptations to cope with the challenges of sandy habitats, such as water scarcity and nutrient-poor soil. Understanding this term requires a background in natural sciences."},"example_sentences":[{"sentence":"The beach morning glory is a classic example of a psammophile, with its long roots stabilizing the sand.","translation":"ハマヒルガオは砂地を好む生物の典型的な例であり、その長い根は砂を安定させる。","type":"noun","meaning_category":"砂地を好む生物"},{"sentence":"Psammophilic plants often have adaptations to reduce water loss.","translation":"砂地を好む植物は、しばしば水分損失を減らすための適応を持っている。","type":"adjective","meaning_category":"砂地を好む"}]}