{"word":"wheelbird","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Zoology) A bird with an unusual or deformed foot or leg that causes it to move in a wheel-like fashion.","english_definition":"A bird with an unusual or deformed foot or leg that causes it to move in a wheel-like fashion.","examples":[{"sentence":"The wheelbird hopped across the ground, its deformed foot making a circular motion.","translation":"そのwheelbirdは、変形した足が円を描くように動き、地面を飛び跳ねて進んだ。"}],"collocations":["observe a wheelbird","study wheelbirds","help a wheelbird"],"synonyms":["deformed bird","disabled bird"],"antonyms":[]}],"etymology":{"value":"Likely a descriptive term, combining \"wheel\" (referring to the circular motion) and \"bird\".","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈwiːlˌbɜːrd/","syllables":"wheel-bird"},"inflection":{"noun_plural":"wheelbirds"},"usage_notes":{"explanation":"This term is not widely recognized or used in formal ornithology. It is more likely a descriptive term used by individuals who have observed a bird with this particular type of deformity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a wheelbird flying high in the sky.","correct":"✓ I saw a wheelbird hopping on the ground.","note":"Wheelbirds are typically unable to fly due to their leg or foot deformity."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"wheelbird\" describes a bird with a physical deformity that causes it to move in a wheel-like manner. The term is not commonly used in formal scientific contexts but is descriptive. Understanding the term requires knowledge of both \"wheel\" and \"bird\" and the concept of physical deformities. The term is not likely to be encountered in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The nature documentary briefly showed a **wheelbird** struggling to find food.","translation":"その自然ドキュメンタリーでは、食べ物を探すのに苦労しているwheelbirdが一瞬映し出された。","type":"noun","meaning_category":"deformed bird"},{"sentence":"Researchers are studying the causes of leg deformities that lead to the development of **wheelbirds**.","translation":"研究者たちは、wheelbirdの発達につながる脚の変形の原因を研究している。","type":"noun","meaning_category":"deformed bird"}]}