{"word":"fixed-width","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"固定幅の、等幅の","english_definition":"having a constant width; especially, of a font, having all characters the same width.","examples":[{"sentence":"This report uses a fixed-width font for better readability.","translation":"このレポートでは、読みやすさを向上させるために固定幅フォントを使用しています。"},{"sentence":"A fixed-width font is often used for displaying code.","translation":"固定幅フォントは、コードを表示するためによく使用されます。"},{"sentence":"The data must be in a fixed-width format for processing.","translation":"データを処理するには、固定幅形式にする必要があります。"}],"collocations":["fixed-width font","fixed-width format","fixed-width character","fixed-width layout"],"synonyms":["monospaced","non-proportional"],"antonyms":["variable-width","proportional"],"notes":"Fixed-width fonts are also called monospaced fonts."}],"etymology":{"value":"The term is a compound adjective formed by combining 'fixed' (meaning constant or unchangeable) and 'width' (the measurement of something from side to side).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɪkstˈwɪdθ/","syllables":"fixed-width"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Fixed-width' refers to something that maintains a consistent width, most commonly used in the context of fonts where each character occupies the same amount of horizontal space. This is in contrast to variable-width fonts, where characters have different widths depending on their shape. Fixed-width formats are also used in data processing where each field occupies a predetermined number of characters.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Use a fixed width font for the title.","correct":"✓ Use a fixed-width font for the title.","note":"The hyphen is important to correctly form the compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["width","fixed"],"related_terms":["monospace","proportional font","variable width font","character width"]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, but common in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Fixed-width' is a technical term that describes something having a constant width. It is most often used to describe fonts in which every character takes up the same amount of space horizontally. This is useful for aligning text in columns, displaying code, and other situations where consistent spacing is important. If you see the term 'fixed-width,' think of something that is consistently the same size across its width."},"example_sentences":[{"sentence":"The old typewriter used a fixed-width font.","translation":"古いタイプライターは固定幅フォントを使用していました。","type":"adjective","meaning_category":"describing fonts"},{"sentence":"We need to convert the data into a fixed-width format before importing it.","translation":"データをインポートする前に、固定幅形式に変換する必要があります。","type":"adjective","meaning_category":"describing data formats"},{"sentence":"Using a fixed-width font makes it easier to read code.","translation":"固定幅フォントを使用すると、コードが読みやすくなります。","type":"adjective","meaning_category":"describing fonts and code"}]}