{"word":"unprostituted","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"(of a person, especially a woman) not having engaged in prostitution; pure; not corrupted or debased.","english_definition":"Not having engaged in prostitution; pure; not corrupted or debased.","examples":[{"sentence":"She remained unprostituted, despite the pressures of poverty.","translation":"彼女は貧困の圧力にもかかわらず、売春行為に染まらなかった。"},{"sentence":"His ideals remained unprostituted by political compromise.","translation":"彼の理想は政治的な妥協によって堕落することはなかった。"}],"collocations":["unprostituted woman","unprostituted ideals","unprostituted principles"],"synonyms":["pure","chaste","virtuous","incorrupt","undefiled","untainted"],"antonyms":["prostituted","corrupt","debased","tainted"]}],"etymology":{"value":"Formed from the prefix 'un-' (not) + 'prostituted', the past participle of 'prostitute'.","priority":"low"},"pronunciation":{"ipa":"/ˌʌnˈprɒstɪtjuːtɪd/","syllables":"un-pros-ti-tu-ted"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used predicatively with a linking verb (e.g., 'to be'). It has no comparative or superlative forms."},"usage_notes":{"explanation":"The word 'unprostituted' is primarily used to describe someone, especially a woman, who has not engaged in prostitution. Figuratively, it can describe something (like ideals or principles) that has not been corrupted or debased. It carries a strong moral connotation.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The unprostituted building stood tall.","correct":"The building remained unprostituted by commercial interests.","note":"'Unprostituted' is typically used for people or abstract concepts like ideals, not physical structures. Using it for a building would be unusual and likely require a figurative interpretation."}],"priority":"low"},"related_words":{"derivatives":["prostitute (noun, verb)","prostitution (noun)"],"related_concepts":["chastity","purity","virtue","corruption","debasement"]},"level_frequency":{"frequency_google_ngram":"Very low frequency. This word is not commonly used in modern English.","priority":"low"},"readability_explanation":{"level":"C2","text":"'Unprostituted' is a relatively rare and formal word. It is most often encountered in discussions of morality, social issues, or historical contexts. Understanding requires a grasp of the meaning of 'prostitute' and the function of the 'un-' prefix to negate that meaning. Due to its sensitive subject matter and infrequent use, it is best suited for advanced learners."},"example_sentences":[{"sentence":"She vowed to keep her artistic vision unprostituted by commercial demands.","translation":"彼女は商業的な要求によって自身の芸術的ビジョンを堕落させないことを誓った。","type":"adjective","meaning_category":"not corrupted"},{"sentence":"The author's unprostituted principles were evident in his unwavering commitment to social justice.","translation":"その作家の堕落しない原則は、社会正義への揺るぎないコミットメントに明らかだった。","type":"adjective","meaning_category":"not corrupted"},{"sentence":"Despite facing immense pressure, she remained unprostituted and true to her values.","translation":"多大なプレッシャーに直面したにもかかわらず、彼女は売春行為に染まらず、自身の価値観に忠実であり続けた。","type":"adjective","meaning_category":"not having engaged in prostitution"}]}