{"word":"leucogenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"白血球生成性の、白血球増加性の","english_definition":"Promoting the production of leukocytes (white blood cells).","examples":[{"sentence":"The drug has a leucogenic effect, stimulating the bone marrow to produce more white blood cells.","translation":"その薬は白血球生成効果があり、骨髄を刺激してより多くの白血球を生成させます。"}],"collocations":["leucogenic agent","leucogenic effect","leucogenic substance"],"synonyms":["leukopoietic","leukocytopoietic"],"antonyms":["leukopenic","leukocytopenic"]}],"etymology":{"value":"Derived from the Greek words 'leuco-' (λευκός) meaning 'white' and '-genic' meaning 'producing' or 'generating'.","priority":"★★☆"},"pronunciation":{"ipa":"ˌluːkəˈdʒɛnɪk","syllables":"lu-co-gen-ic"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more leucogenic' and 'most leucogenic', respectively."},"usage_notes":{"explanation":"The term 'leucogenic' is primarily used in medical and scientific contexts to describe substances, treatments, or conditions that stimulate the production of white blood cells. It is often used in discussions related to bone marrow stimulation, immune system support, and recovery from conditions that cause leukopenia (low white blood cell count).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The leucogenic food increased the red blood cells.","correct":"✓ The leucogenic food increased the white blood cells.","note":"Leucogenic specifically refers to the production of white blood cells (leukocytes), not red blood cells (erythrocytes)."},{"incorrect":"✗ Leucogenic is the opposite of carcinogenic.","correct":"✓ Leucopenic is the opposite of leucogenic.","note":"Leucogenic refers to white blood cell production, while carcinogenic refers to cancer-causing agents. Leucopenic (causing a decrease in white blood cells) is the antonym of leucogenic."}],"priority":"★★☆"},"related_words":{"derivatives":["leukocyte (white blood cell)","leukopoiesis (production of white blood cells)","leukemia (cancer of the blood or bone marrow characterized by an abnormal increase of leukocytes)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary used in medical contexts)","frequency_google_ngram":"Low frequency (primarily used in scientific and medical literature)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Leucogenic' is a specialized term used in medicine and biology. It describes something that promotes the production of white blood cells (leukocytes). This term is typically encountered in scientific articles, medical textbooks, or discussions related to hematology and immunology. Understanding this term requires a background in biology or medicine."},"example_sentences":[{"sentence":"The doctor prescribed a leucogenic medication to help boost the patient's immune system.","translation":"医師は患者の免疫システムを高めるために、白血球生成性の薬を処方しました。","type":"general","meaning_category":"medical"},{"sentence":"Certain growth factors have been shown to have leucogenic properties.","translation":"特定の成長因子は、白血球生成特性を持つことが示されています。","type":"scientific","meaning_category":"biological"}]}