{"word":"Attorneyism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The practices, methods, or characteristics associated with attorneys, especially in a negative or critical way; legalistic or overly technical behavior.","english_definition":"Practices, methods, or characteristics associated with attorneys, often in a negative or critical way; legalistic or overly technical behavior.","examples":[{"sentence":"The contract was filled with attorneyism, making it difficult for a layperson to understand.","translation":"その契約書は弁護士特有の専門用語で溢れており、素人には理解しにくかった。"},{"sentence":"His argument was dismissed as mere attorneyism, lacking substance.","translation":"彼の主張は、中身のない単なる弁護士的な詭弁として退けられた。"}],"collocations":["legal attorneyism","political attorneyism"],"synonyms":["legalism","quibbling","sophistry","caviling"],"antonyms":[]}],"etymology":{"value":"Derived from 'attorney' (a legal representative) with the suffix '-ism' (denoting a practice, principle, or ideology).","priority":"★★★"},"pronunciation":{"ipa":"/əˈtɜːrnizəm/","syllables":"At-tor-ney-ism"},"inflection":{"noun_plural":"Attorneyisms"},"usage_notes":{"explanation":"'Attorneyism' is often used pejoratively to describe legalistic or overly technical arguments or behaviors that are perceived as obstructive, evasive, or lacking in genuine substance. It implies a focus on technicalities rather than fairness or justice.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The attorneyism of the situation was overwhelming.","correct":"✓ The legalism of the situation was overwhelming.","note":"Use 'legalism' when referring to strict adherence to the law, rather than the specific practices of attorneys."}],"priority":"★★☆"},"related_words":{"derivatives":["attorney","legalism"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Attorneyism' is a relatively uncommon term used to describe practices or characteristics associated with attorneys, often in a critical or negative way. It typically refers to overly legalistic, technical, or evasive behavior. The term is not part of everyday vocabulary and is more likely to be encountered in discussions about law, politics, or ethics."},"example_sentences":[{"sentence":"The politician accused his opponent of using attorneyism to dodge the real issues.","translation":"その政治家は、対立候補が本当の問題を回避するために弁護士的な詭弁を使っていると非難した。","type":"noun","meaning_category":"Negative practices of attorneys"},{"sentence":"The contract was so dense with attorneyism that no one could understand it without legal help.","translation":"その契約書は弁護士特有の専門用語で非常に難解で、法律の助けなしには誰も理解できなかった。","type":"noun","meaning_category":"Legalistic language"}]}