{"word":"boddle","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(Scottish, Northern England dialect) to poke or prod gently; to handle clumsily; to make a mess of something.","english_definition":"(Scottish, Northern England dialect) to poke or prod gently; to handle clumsily; to make a mess of something.","examples":[{"sentence":"Stop boddling at your food and eat it properly.","translation":"食べ物をいじくり回さずに、きちんと食べなさい。"},{"sentence":"He's always boddling about with his tools, never actually fixing anything.","translation":"彼はいつも道具をいじくり回しているだけで、実際には何も直さない。"},{"sentence":"Don't boddle with that, you'll only make it worse.","translation":"それをいじくり回さないで、もっと悪くするだけだよ。"}],"collocations":["boddle about/around (いじくり回す)","boddle with (～をいじくり回す)"],"synonyms":["fiddle","mess","tamper","poke","prod"],"antonyms":[]}],"etymology":{"value":"Origin uncertain, possibly related to 'bodach' (a spirit or old man) suggesting clumsy handling.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbɒdəl/","syllables":"bod-dle"},"inflection":{"verb_forms":{"present_simple":["boddle","boddles"],"past_simple":"boddled","past_participle":"boddled","present_participle":"boddling"}},"usage_notes":{"explanation":"'Boddle' is primarily a dialectal term used in Scotland and Northern England. It implies a gentle but often clumsy or ineffective handling of something. It can also mean to poke or prod something lightly. The word often carries a negative connotation, suggesting that the action is not productive or may even be detrimental.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She boddled the problem and solved it quickly.","correct":"✓ She tackled the problem and solved it quickly.","note":"'Boddle' implies clumsy or ineffective handling, so it's not appropriate when something is solved quickly. Use 'tackle' or 'address' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (dialectal)","frequency_google_ngram":"Very low frequency (dialectal)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Boddle' is a dialectal word, mainly used in Scotland and Northern England. It means to handle something clumsily or to poke at it gently. It's not a common word in standard English, so it's unlikely to be encountered in everyday conversation unless you are in those specific regions. If you hear someone say 'boddle,' they probably mean that someone is messing around with something in a way that is not very effective or is making a mess."},"example_sentences":[{"sentence":"The child was boddling with the clay, making a mess of the table.","translation":"子供は粘土をいじくり回して、テーブルをめちゃくちゃにしていた。","type":"verb","meaning_category":"clumsy handling"},{"sentence":"He kept boddling at the loose wire, trying to fix it.","translation":"彼は緩んだ配線をいじくり回して、直そうとしていた。","type":"verb","meaning_category":"ineffective handling"},{"sentence":"Stop boddling about and get on with the job!","translation":"いじくり回すのはやめて、仕事に取り掛かりなさい！","type":"verb","meaning_category":"wasting time"}]}