{"word":"trafficway","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"交通路、交通路網","english_definition":"A route or network of routes used for transportation, especially by vehicles.","examples":[{"sentence":"The city's trafficway system is heavily congested during rush hour.","translation":"その都市の交通路網はラッシュアワー時に非常に混雑する。"},{"sentence":"New trafficways are being planned to alleviate the problem.","translation":"問題を緩和するために新しい交通路が計画されている。"},{"sentence":"The accident blocked the trafficway, causing major delays.","translation":"その事故は交通路を遮断し、大きな遅延を引き起こした。"}],"collocations":["major trafficway","highway trafficway","urban trafficway","rural trafficway","congested trafficway"],"synonyms":["roadway","thoroughfare","highway","freeway","artery","route","thoroughfare","street","avenue"],"antonyms":["dead end","cul-de-sac"]},{"part_of_speech":"noun","definition":"道路、幹線道路","english_definition":"A main road or highway designed to carry a large volume of traffic.","examples":[{"sentence":"The trafficway was lined with billboards.","translation":"その幹線道路は広告掲示板で埋め尽くされていた。"},{"sentence":"The new trafficway will connect the two cities.","translation":"新しい幹線道路が2つの都市を結ぶだろう。"},{"sentence":"Construction on the trafficway is expected to last two years.","translation":"その幹線道路の建設は2年間続くと予想されている。"}],"collocations":["main trafficway","major trafficway","busy trafficway","new trafficway","old trafficway"],"synonyms":["highway","main road","trunk road","expressway","freeway","arterial road","throughway"],"antonyms":["side street","back road","minor road"]}],"etymology":{"value":"The word \"trafficway\" is a compound word formed by combining \"traffic\" and \"way\". \"Traffic\" comes from the Old Italian word \"traffico\" meaning trade or transport. \"Way\" comes from the Old English word \"weg\" meaning road or path.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtræfɪkweɪ/","syllables":"traf-fic-way"},"inflection":{"noun_plural":"trafficways"},"usage_notes":{"explanation":"\"Trafficway\" is a general term that refers to any route used for transportation, especially by vehicles. It can refer to a single road or a network of roads. The term is often used in urban planning and transportation engineering contexts. It is less common in everyday conversation compared to terms like \"road,\" \"street,\" or \"highway.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The trafficway was very traffic.","correct":"✓ The trafficway had a lot of traffic.","note":"\"Traffic\" is a noun, so you can't use it as an adjective to describe a trafficway. Instead, use \"a lot of traffic\" or \"heavy traffic.\""},{"incorrect":"✗ The trafficway is very trafficed.","correct":"✓ The trafficway is very busy.","note":"While \"trafficked\" is a word, it has a different meaning (related to human trafficking). To describe a trafficway with a lot of traffic, use \"busy\" or \"congested.\""}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["traffic","way","roadway","highway","thoroughfare","transportation","infrastructure"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"trafficway\" is a more formal and technical term for a road or network of roads used for transportation. It's often used in planning and engineering contexts when discussing transportation infrastructure. While not as common in everyday conversation as \"road\" or \"highway,\" understanding its meaning can be helpful when reading about urban development or transportation projects. It's a compound word combining \"traffic\" and \"way,\" so its meaning is fairly intuitive."},"example_sentences":[{"sentence":"The new trafficway is designed to handle a large volume of vehicles.","translation":"新しい交通路は大量の車両を処理するように設計されている。","type":"noun","meaning_category":"道路"},{"sentence":"The city is investing in improving its trafficway infrastructure.","translation":"市は交通路のインフラ改善に投資している。","type":"noun","meaning_category":"交通路網"},{"sentence":"The trafficway was closed due to an accident.","translation":"事故のため、その交通路は閉鎖された。","type":"noun","meaning_category":"道路"},{"sentence":"The trafficway system needs to be upgraded to accommodate future growth.","translation":"将来の成長に対応するため、交通路網をアップグレードする必要がある。","type":"noun","meaning_category":"交通路網"},{"sentence":"The trafficway provides a direct route to the airport.","translation":"その交通路は空港への直接ルートを提供する。","type":"noun","meaning_category":"道路"}]}