{"word":"Touristdom","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"観光業界、観光客の世界、観光客が多い状態","english_definition":"The world of tourism; the state of being dominated by tourists.","examples":[{"sentence":"The small village was overwhelmed by touristdom during the summer months.","translation":"その小さな村は、夏の数ヶ月間、観光客の世界に圧倒された。"},{"sentence":"The government is trying to regulate touristdom to protect the local environment.","translation":"政府は、地元の環境を保護するために観光業界を規制しようとしている。"},{"sentence":"He wrote a book about the negative impacts of touristdom on traditional cultures.","translation":"彼は、観光業界が伝統文化に与える悪影響について本を書いた。"}],"collocations":["overwhelmed by touristdom (観光客に圧倒される)","regulate touristdom (観光業界を規制する)","impact of touristdom (観光業界の影響)"],"synonyms":["tourism","touristy area","tourist trap"],"antonyms":["undeveloped area","untouched nature"]},{"part_of_speech":"noun","definition":"観光客特有の行動や考え方","english_definition":"The behaviors and attitudes associated with tourists.","examples":[{"sentence":"She found the constant picture-taking and souvenir-buying to be typical of touristdom.","translation":"彼女は、絶え間ない写真撮影とお土産の購入が観光客特有の行動だと感じた。"},{"sentence":"He criticized the superficial engagement with local culture that he saw as characteristic of touristdom.","translation":"彼は、観光客特有の行動だと見なされる、地元文化との表面的な関わり方を批判した。"}],"collocations":["typical of touristdom (観光客特有の)","characteristic of touristdom (観光客特有の)"],"synonyms":["touristy behavior","tourist mentality"],"antonyms":["authentic experience","local immersion"]}],"etymology":{"value":"\"Tourist\" + \"-dom\" (suffix denoting a state, condition, or domain).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʊərɪstˌdɒm/","syllables":"tour-ist-dom"},"inflection":{"noun_plural":"Touristdoms (rarely used in plural form)"},"usage_notes":{"explanation":"\"Touristdom\" is a relatively uncommon word, often used critically to describe the negative aspects of mass tourism or the superficiality of tourist experiences. It can refer to the industry itself, the state of being overrun by tourists, or the behaviors and attitudes associated with tourists.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The touristdom is very busy in summer.","correct":"✓ Touristdom is very busy in summer.","note":"\"Touristdom\" is an uncountable noun, so it does not take the article \"the\" in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["tourist","tourism","touristy"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Touristdom\" is a less common word that refers to the world of tourism, especially when it is seen as overwhelming or negative. It can describe the industry, the state of being full of tourists, or the way tourists behave. It's often used when talking about the problems caused by too many tourists or when criticizing how tourists interact with local cultures."},"example_sentences":[{"sentence":"The island's economy is heavily dependent on touristdom.","translation":"その島の経済は観光業界に大きく依存している。","type":"noun","meaning_category":"観光業界"},{"sentence":"The city has tried to balance the benefits of touristdom with the needs of its residents.","translation":"その都市は、観光業界の利点と住民のニーズとのバランスを取ろうとしてきた。","type":"noun","meaning_category":"観光客が多い状態"},{"sentence":"He wrote an essay criticizing the superficiality of touristdom.","translation":"彼は観光客特有の行動の表面的さを批判するエッセイを書いた。","type":"noun","meaning_category":"観光客特有の行動や考え方"}]}