{"word":"screwbarrel","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(射撃) スクリューバレル：銃身の内側に螺旋状の溝（ライフリング）が刻まれた銃身。弾丸に回転を与え、安定させて命中精度を高める。","english_definition":"(firearms) A type of gun barrel that has a rifled bore, meaning it has spiral grooves cut into the interior surface. These grooves impart spin to a projectile, stabilizing it in flight and improving accuracy.","examples":[{"sentence":"The screwbarrel of a rifle is designed to make the bullet spin.","translation":"ライフルのスクリューバレルは、弾丸を回転させるように設計されています。"},{"sentence":"Early muskets were smoothbore, but later models often used screwbarrels for increased accuracy.","translation":"初期のマスケット銃は滑腔銃身でしたが、後のモデルでは精度を高めるためにスクリューバレルがよく使用されました。"}],"collocations":["rifled screwbarrel","screwbarrel rifle","screwbarrel musket"],"synonyms":["rifled barrel","rifled bore","grooved barrel"],"antonyms":["smoothbore barrel"]}],"etymology":{"value":"The term 'screwbarrel' likely arose from the visual impression of the rifling inside the barrel, resembling the threads of a screw.","priority":"N/A"},"pronunciation":{"ipa":"/ˈskruːˌbærəl/","syllables":"screw-bar-rel"},"inflection":{"noun_plural":"screwbarrels"},"usage_notes":{"explanation":"'Screwbarrel' is a somewhat archaic term, with 'rifled barrel' being the more common modern term. It specifically refers to a gun barrel with rifling.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["rifling (noun): the spiral grooves inside a gun barrel","bore (noun): the interior of a gun barrel"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'screwbarrel' is technical and relatively uncommon in modern usage. It refers to a specific type of gun barrel with rifling. Understanding requires familiarity with firearms terminology."},"example_sentences":[{"sentence":"The marksman carefully cleaned the screwbarrel of his antique rifle.","translation":"射手はアンティークライフルのスクリューバレルを注意深く清掃した。","type":"noun","meaning_category":"firearms"},{"sentence":"The invention of the screwbarrel significantly improved the range and accuracy of firearms.","translation":"スクリューバレルの発明は、銃器の射程と精度を大幅に向上させた。","type":"noun","meaning_category":"firearms"}]}