{"word":"pseudofaithful","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"見せかけの忠実な、偽りの忠実な","english_definition":"Appearing to be faithful or loyal, but not genuinely so; falsely or superficially faithful.","examples":[{"sentence":"The pseudofaithful servant betrayed his master for personal gain.","translation":"見せかけの忠実な召使いは、私利のために主人を裏切った。"},{"sentence":"Her pseudofaithful smile hid her true intentions.","translation":"彼女の偽りの忠実な笑顔は、彼女の真の意図を隠していた。"},{"sentence":"The regime relied on pseudofaithful propaganda to maintain control.","translation":"その政権は、支配を維持するために、見せかけの忠実なプロパガンダに頼っていた。"}],"collocations":["pseudofaithful servant","pseudofaithful follower","pseudofaithful ally","pseudofaithful representation","pseudofaithful adherence"],"synonyms":["insincere","hypocritical","deceitful","treacherous","disloyal","unfaithful","false","pretended"],"antonyms":["faithful","loyal","sincere","genuine","true"]}],"etymology":{"value":"The word 'pseudofaithful' is formed by combining the prefix 'pseudo-' (meaning false or pretending) with the adjective 'faithful' (meaning loyal and true).","priority":"★★☆"},"pronunciation":{"ipa":"ˌsjuːdoʊˈfeɪθfʊl/","syllables":"pseu-do-faith-ful"},"inflection":{"notes":"Comparative and superlative forms are 'more pseudofaithful' and 'most pseudofaithful'.","adjective_forms":{"comparative":"more pseudofaithful","superlative":"most pseudofaithful"}},"usage_notes":{"explanation":"'Pseudofaithful' is used to describe someone or something that outwardly appears to be loyal or faithful, but is not genuinely so. The prefix 'pseudo-' indicates that the faithfulness is fake or superficial. It implies a deceptive quality, where the appearance of loyalty is used to mask ulterior motives or a lack of true commitment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was pseudofaithful to the truth.","correct":"✓ He was unfaithful to the truth. / ✓ He presented a pseudofaithful account of the events.","note":"'Pseudofaithful' is typically used to describe people or representations, not abstract concepts like 'truth'. Use 'unfaithful' for abstract concepts, or rephrase to describe the representation as pseudofaithful."},{"incorrect":"✗ The pseudofaithful dog wagged its tail.","correct":"✓ The dog wagged its tail, appearing pseudofaithful. / ✓ The dog's wagging tail was pseudofaithful.","note":"While animals can display behaviors that might appear loyal, 'pseudofaithful' is usually reserved for situations involving conscious deception or pretense. It's more accurate to describe the *appearance* as pseudofaithful."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudofaithfully (adverb)","pseudofaithfulness (noun)"],"phrases":["false friend","wolf in sheep's clothing"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pseudofaithful' is a relatively uncommon and sophisticated term used to describe something that appears faithful but is not genuinely so. It is formed by combining 'pseudo-' (meaning false) with 'faithful' (meaning loyal). Understanding this word requires a grasp of abstract concepts like loyalty, deception, and superficiality. It's more likely to be encountered in formal writing or discussions about complex social or political situations.","priority":"★★☆"},"example_sentences":[{"sentence":"The spy adopted a pseudofaithful persona to infiltrate the enemy ranks.","translation":"スパイは敵の陣営に潜入するために、見せかけの忠実な人格を演じた。","type":"adjective","meaning_category":"deceptive loyalty"},{"sentence":"The politician's pseudofaithful promises were designed to win votes, not to be kept.","translation":"その政治家の偽りの忠実な約束は、守られるためではなく、票を獲得するために作られたものだった。","type":"adjective","meaning_category":"insincere commitment"},{"sentence":"The historian questioned the pseudofaithful accounts of the battle, suspecting propaganda.","translation":"歴史家は、プロパガンダを疑い、その戦いの見せかけの忠実な記録に疑問を呈した。","type":"adjective","meaning_category":"false representation"}]}