{"word":"Twice-depleted","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(核燃料に関して)二度再処理された、ウラン235の含有量が極めて低い","english_definition":"(of nuclear fuel) reprocessed twice, having a very low concentration of uranium-235.","examples":[{"sentence":"Twice-depleted uranium is not suitable for nuclear weapons.","translation":"二度再処理されたウランは核兵器には適していません。"},{"sentence":"The disposal of twice-depleted nuclear fuel is a significant environmental challenge.","translation":"二度再処理された核燃料の処分は、重大な環境問題です。"}],"collocations":["twice-depleted uranium","twice-depleted nuclear fuel"],"synonyms":["reprocessed uranium","low-enriched uranium (in this specific context)"],"antonyms":["enriched uranium","natural uranium"]}],"etymology":{"value":"The term is formed by combining \"twice\" (meaning two times) with \"depleted\" (meaning having had its uranium-235 content reduced through use in a nuclear reactor or reprocessing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtwaɪs dɪˈpliːtɪd/","syllables":"twice-de-plee-ted"},"inflection":{"notes":"This is an adjective, so it does not inflect for number or tense."},"usage_notes":{"explanation":"\"Twice-depleted\" specifically refers to nuclear fuel that has undergone reprocessing not just once, but twice. This results in a very low concentration of uranium-235, making it unsuitable for most nuclear applications, including weapons. It is often used in discussions about nuclear waste management and proliferation risks.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reactor uses twice-depleting uranium.","correct":"✓ The reactor uses twice-depleted uranium.","note":"The correct form is the adjective \"twice-depleted,\" not the present participle \"twice-depleting.\""}],"priority":"★★★"},"related_words":{"derivatives":["depleted uranium","reprocessed uranium","nuclear fuel","uranium enrichment"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"twice-depleted\" is highly specialized and technical, primarily used in the context of nuclear engineering and waste management. Understanding requires familiarity with nuclear fuel cycles, uranium enrichment, and reprocessing techniques. It is not commonly encountered outside of these specific fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The long-term storage of twice-depleted uranium poses unique challenges due to its radioactivity and chemical properties.","translation":"二度再処理されたウランの長期保管は、その放射能と化学的特性のために特有の課題をもたらします。","type":"adjective","meaning_category":"Nuclear Fuel"},{"sentence":"Research is being conducted on potential uses for twice-depleted uranium, such as in radiation shielding.","translation":"放射線遮蔽など、二度再処理されたウランの潜在的な用途に関する研究が行われています。","type":"adjective","meaning_category":"Nuclear Material"}]}