{"word":"slander-proof","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"中傷を受けにくい、名誉毀損訴訟を起こされにくい","english_definition":"Unlikely to be successfully sued for slander or libel; written or spoken in such a way as to avoid being defamatory.","examples":[{"sentence":"The book was carefully written to be slander-proof.","translation":"その本は名誉毀損訴訟を起こされないように注意深く書かれていた。"},{"sentence":"The comedian's routine was slander-proof, relying on satire rather than direct accusations.","translation":"そのコメディアンのルーティンは、直接的な告発ではなく風刺に頼っていたため、中傷訴訟を起こされにくいものだった。"}],"collocations":["slander-proof statement","slander-proof language","slander-proof material"],"synonyms":["defamation-proof","libel-proof","non-defamatory"],"antonyms":["defamatory","libelous","slanderous"]}],"etymology":{"value":"The word is formed by combining 'slander' (false and malicious spoken statement) with '-proof' (resistant to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈslændərˌpruːf/","syllables":"slan-der-proof"},"inflection":{"notes":"Adjective, no inflection"},"usage_notes":{"explanation":"'Slander-proof' describes something, typically a statement or piece of writing, that has been carefully crafted to avoid being considered defamatory. This often involves using indirect language, satire, or relying on facts that can be substantiated. It's a term often used in legal contexts or when discussing media and journalism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building is slander-proof.","correct":"✓ The statement is slander-proof.","note":"'Slander-proof' is usually applied to statements, writings, or other forms of communication, not physical objects."},{"incorrect":"✗ He is a slander-proof person.","correct":"✓ His speech was slander-proof.","note":"It describes the nature of the communication, not the person."}],"priority":"★★☆"},"related_words":{"derivatives":["slander (noun/verb)","proof (noun/adjective)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Slander-proof' is a specialized term, often used in legal or media contexts. It means that something is designed or written in a way that makes it very difficult to successfully sue for slander (spoken defamation) or libel (written defamation). The term implies a careful and deliberate effort to avoid making statements that could be proven false and damaging to someone's reputation. Understanding this word requires knowledge of legal concepts related to defamation. "},"example_sentences":[{"sentence":"The lawyer advised the author to make the manuscript slander-proof before publishing it.","translation":"弁護士は著者に、出版前に原稿を中傷訴訟を起こされないようにするように助言した。","type":"adjective","meaning_category":"中傷を受けにくい"},{"sentence":"The article was carefully worded to be slander-proof, avoiding any direct accusations.","translation":"その記事は、直接的な非難を避けるために、中傷訴訟を起こされないように注意深く言葉が選ばれていた。","type":"adjective","meaning_category":"中傷を受けにくい"}]}