{"word":"twice-appropriated","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(文化、アイデアなどが)二重に流用された、二度転用された","english_definition":"Having been appropriated or borrowed twice; having undergone two instances of cultural appropriation or re-contextualization.","examples":[{"sentence":"The artwork features a twice-appropriated image, initially taken from indigenous art and then re-used in a commercial context.","translation":"そのアート作品は、もともと先住民の芸術から取られたイメージを二重に流用したもので、その後商業的な文脈で再利用されました。"},{"sentence":"The musical piece is a complex layering of influences, including a twice-appropriated melody that adds to its unique character.","translation":"その楽曲は、その独特な性格を際立たせる二重に流用されたメロディーを含む、影響の複雑な重ね合わせです。"}],"collocations":["twice-appropriated image","twice-appropriated melody","twice-appropriated symbol","twice-appropriated cultural element"],"synonyms":["re-appropriated","recontextualized","borrowed twice","doubly appropriated"],"antonyms":["original","unappropriated","unborrowed"]}],"etymology":{"value":"Derived from the combination of 'twice' (meaning two times) and 'appropriated' (meaning taken or borrowed without permission or proper acknowledgement). The term suggests a process where something is taken from its original context, and then taken again from a subsequent context.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtwaɪs əˈproʊpriˌeɪtɪd/","syllables":"twice-ap-pro-pri-a-ted"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than forming comparative and superlative degrees (though this is uncommon for longer words like this)."},"usage_notes":{"explanation":"The term 'twice-appropriated' is often used in discussions of cultural appropriation, art, and intellectual property. It highlights the complex layers of influence and ownership that can occur when an element is borrowed or re-used multiple times. It often carries a negative connotation, suggesting that the original source is further obscured or exploited.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The twice-appropriated is good.","correct":"✓ The twice-appropriated image is good.","note":"'Twice-appropriated' is an adjective and needs to modify a noun."}],"priority":"★★★"},"related_words":{"derivatives":["appropriation","re-appropriation","cultural appropriation"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. The term is relatively specialized.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'twice-appropriated' describes something that has been taken or borrowed, and then taken or borrowed again. This is often used in discussions about art, culture, or ideas that have been re-used in different contexts, sometimes without proper credit to the original source. It's a complex concept that requires understanding of cultural appropriation and intellectual property.","priority":"★★☆"},"example_sentences":[{"sentence":"The design featured a **twice-appropriated** motif from ancient Egyptian art, further complicated by its use in a modern advertising campaign.","translation":"そのデザインは、古代エジプト美術からの二重に流用されたモチーフを特徴としており、現代の広告キャンペーンでの使用によってさらに複雑化していた。","type":"adjective","meaning_category":"Cultural Appropriation"},{"sentence":"The academic paper analyzed the ethical implications of using a **twice-appropriated** narrative in contemporary literature.","translation":"その学術論文は、現代文学において二重に流用された物語を使用することの倫理的影響を分析した。","type":"adjective","meaning_category":"Ethics and Literature"}]}