{"word":"cantillation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（ユダヤ教のシナゴーグにおける）聖書朗読の旋律、詠唱","english_definition":"the ritual chanting of passages from the Hebrew Bible in synagogue services.","examples":[{"sentence":"The cantillation of the Torah was performed by the rabbi.","translation":"トーラーの詠唱はラビによって行われた。"},{"sentence":"He studied the ancient tradition of cantillation for many years.","translation":"彼は長年、詠唱の古代からの伝統を研究した。"}],"collocations":["Torah cantillation","cantillation mark","chant cantillation"],"synonyms":["chant","intonation","recitation","melodic recitation"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from Old French, or from late Latin cantillatio(n-), from cantillare ‘to chant softly’, diminutive of cantare ‘to sing’.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkæntɪˈleɪʃən/","syllables":"can-til-la-tion"},"inflection":{"noun_plural":"cantillations"},"usage_notes":{"explanation":"Cantillation refers specifically to the traditional chanting of the Hebrew Bible in Jewish religious services. It involves a set of melodic formulas that vary depending on the specific text being read and the liturgical tradition of the community. The melodies are indicated by a system of symbols called 'cantillation marks' or 'tropes' which guide the reader in the proper intonation and phrasing of the text.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cantillation was played on the piano.","correct":"✓ The cantillation was sung/chanted.","note":"Cantillation is a form of chanting or singing, not typically played on an instrument."},{"incorrect":"✗ Cantillation is a type of musical composition.","correct":"✓ Cantillation is a method of reciting sacred texts.","note":"Cantillation is primarily a method of reciting text, not a musical composition in the conventional sense."}],"priority":"★★☆"},"related_words":{"derivatives":["cantillate (verb): to chant or recite in a cantillation style"],"phrases":["Nusach (related term referring to the specific melodic tradition used in cantillation)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Cantillation refers to the traditional way of chanting or reciting sacred texts, especially in Jewish religious services. It involves specific melodic patterns and symbols that guide the reader in how to intone the text. This term is most often used in the context of religious studies, musicology, or Jewish culture.","priority":"★★☆"},"example_sentences":[{"sentence":"The beauty of the service was enhanced by the skilled cantillation of the Psalms.","translation":"礼拝の美しさは、熟練した詩篇の詠唱によって高められた。","type":"noun","meaning_category":"詠唱"},{"sentence":"Learning the proper cantillation is an important part of becoming a Bar Mitzvah.","translation":"適切な詠唱を学ぶことは、成人式（バル・ミツワー）を迎える上で重要な部分である。","type":"noun","meaning_category":"詠唱"},{"sentence":"The ancient melodies of cantillation have been passed down through generations.","translation":"詠唱の古代の旋律は、何世代にもわたって受け継がれてきた。","type":"noun","meaning_category":"詠唱"}]}