{"word":"Evaniidae","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A family of ensign wasps.","english_definition":"A family of wasps, known as ensign wasps, characterized by their small size and distinctive behavior of raising and lowering their metasoma (abdomen) like a flag. They are parasitoids of cockroach oothecae (egg cases).","examples":[{"sentence":"The Evaniidae are beneficial insects as they help control cockroach populations.","translation":"オオクロバチ科はゴキブリの個体数を抑制するため、有益な昆虫である。"}],"collocations":["Evaniidae species","Evaniidae identification","Evaniidae parasitoid"],"synonyms":["ensign wasps"],"antonyms":[]}],"etymology":{"value":"From the genus name 'Evania', which is derived from Greek origins, combined with the suffix '-idae', which is used to denote a zoological family.","priority":"N/A"},"pronunciation":{"ipa":"/ˌɛvəˈnaɪɪdiː/","syllables":"E-va-ni-i-dae"},"inflection":{"noun_plural":"Evaniidae (This is already a plural form referring to the family.)"},"usage_notes":{"explanation":"'Evaniidae' refers to the family of ensign wasps. They are known for their parasitic behavior towards cockroach eggs, making them ecologically significant. The term is primarily used in entomology and scientific contexts.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Evania (genus)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Evaniidae' is a scientific term used in entomology to refer to a specific family of wasps known as ensign wasps. Understanding this term requires familiarity with biological classification and entomological terminology. It is not commonly used outside of scientific contexts.","priority":"N/A"},"example_sentences":[{"sentence":"Studies on Evaniidae have revealed their complex host-parasite interactions with cockroaches.","translation":"オオクロバチ科の研究により、ゴキブリとの複雑な寄生関係が明らかになった。","type":"scientific","meaning_category":"description"}]}