{"word":"pamphysical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(哲学) 全物理的なものに関する、またはそれらを含む","english_definition":"(philosophy) relating to or encompassing all physical things","examples":[{"sentence":"The pamphysical theory attempts to explain the fundamental nature of reality.","translation":"全物理的な理論は、現実の根本的な性質を説明しようと試みます。"}],"collocations":["pamphysical theory","pamphysical world","pamphysical universe"],"synonyms":["material","physical","corporeal"],"antonyms":["nonphysical","immaterial","spiritual"]}],"etymology":{"value":"Derived from the Greek words 'pan' (all) and 'physical' (relating to matter or energy).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæmfɪˈzɪkəl/","syllables":"pam-phy-si-cal"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns."},"usage_notes":{"explanation":"The term 'pamphysical' is primarily used in philosophical contexts, especially when discussing theories that relate to the entirety of the physical world. It is often used to distinguish concepts or theories that encompass all physical aspects from those that are limited to specific physical phenomena.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pamphysical concept is easy to understand.","correct":"✓ The pamphysical concept requires a deep understanding of physics and philosophy.","note":"The term is technical and often used in complex philosophical discussions."}],"priority":"★☆☆"},"related_words":{"derivatives":["panpsychism (汎心論)"],"related_concepts":["physicalism (物理主義)","materialism (唯物論)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized philosophical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pamphysical' is a specialized term primarily used in philosophy to describe concepts or theories related to all physical things. It is not commonly used in everyday language and requires a background in philosophy to fully understand its implications. The term is often used in discussions about the nature of reality and the relationship between the physical and non-physical worlds."},"example_sentences":[{"sentence":"The philosopher proposed a pamphysical model of the universe.","translation":"その哲学者は、宇宙の全物理的なモデルを提案しました。","type":"adjective","meaning_category":"全物理的なものに関する"},{"sentence":"The pamphysical approach seeks to unify all physical phenomena under a single framework.","translation":"全物理的なアプローチは、すべての物理現象を単一の枠組みの下に統合しようとします。","type":"adjective","meaning_category":"全物理的なものを含む"}]}