{"word":"lactoserum","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"乳清、ホエイ","english_definition":"The serum or watery part of milk that remains after the curd has formed, especially in the process of making cheese.","examples":[{"sentence":"Lactoserum is a byproduct of cheese production.","translation":"乳清はチーズ製造の副産物です。"},{"sentence":"Some athletes use lactoserum protein supplements.","translation":"運動選手の中には乳清タンパク質のサプリメントを使用する人もいます。"}],"collocations":["whey protein","lactoserum protein","cheese production","dairy industry"],"synonyms":["whey"],"antonyms":[]}],"etymology":{"value":"From Latin 'lac' (milk) + 'serum' (whey).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlæktoʊˈsɪərəm/","syllables":"lac-to-se-rum"},"inflection":{"noun_plural":"lactoserums"},"usage_notes":{"explanation":"Lactoserum, commonly known as whey, is the liquid remaining after milk has been curdled and strained. It is a byproduct of the manufacture of many cheeses and casein. Whey protein is a popular dietary supplement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I drink lactoserum for breakfast every day.","correct":"✓ I drink whey protein for breakfast every day.","note":"'Whey protein' is the common term for dietary supplements. 'Lactoserum' is more of a technical or scientific term."}],"priority":"★★☆"},"related_words":{"derivatives":["lactoserum protein","whey protein concentrate","whey protein isolate"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lactoserum' is a technical term primarily used in the context of dairy science, nutrition, and food production. It refers to the liquid component of milk that remains after the milk has been curdled and strained during cheese or casein manufacturing. While 'whey' is the more commonly used term, 'lactoserum' may appear in scientific literature or detailed product descriptions. Understanding this term requires familiarity with dairy processing and nutritional science.","note":"This word is not commonly used in everyday conversation and is more likely to be encountered in specialized contexts."},"example_sentences":[{"sentence":"The dairy industry is exploring new uses for lactoserum.","translation":"酪農産業は乳清の新しい用途を模索しています。","type":"noun","meaning_category":"乳清"},{"sentence":"Lactoserum contains valuable proteins and minerals.","translation":"乳清には貴重なタンパク質とミネラルが含まれています。","type":"noun","meaning_category":"乳清"}]}