{"word":"nonfugitiveness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of not being a fugitive; the condition of not fleeing or attempting to evade justice or capture.","english_definition":"The state or quality of not being a fugitive.","examples":[{"sentence":"The suspect's nonfugitiveness was a factor in the judge's decision to grant bail.","translation":"容疑者が逃亡しないことは、裁判官が保釈を認める判断をする際の要素となった。"},{"sentence":"His nonfugitiveness demonstrated his willingness to cooperate with the authorities.","translation":"彼の逃亡しない態度は、当局に協力する意思を示すものだった。"}],"collocations":["demonstrate nonfugitiveness","assess nonfugitiveness","consider nonfugitiveness"],"synonyms":["law-abidingness","compliance","presence","availability"],"antonyms":["fugitiveness","elusiveness","evasion","flight"]}],"etymology":{"value":"Formed by adding the prefix \"non-\" (meaning \"not\") to the word \"fugitiveness\". \"Fugitiveness\" itself comes from \"fugitive\", which originates from the Latin word \"fugitivus\", meaning \"fleeing\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈfjuːdʒɪtɪvnəs/","syllables":"non-fu-gi-tive-ness"},"inflection":{"noun_plural":"nonfugitivenesses (rare)"},"usage_notes":{"explanation":"The term \"nonfugitiveness\" is relatively uncommon and primarily used in legal or formal contexts. It describes the characteristic of an individual who does not attempt to flee or evade legal processes. It can be a significant factor in legal proceedings, such as bail hearings or sentencing, as it indicates a willingness to cooperate with the authorities. The opposite of \"nonfugitiveness\" is \"fugitiveness\", which describes the state of being a fugitive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonfugitiveness of the bird was surprising.","correct":"✓ The bird's tameness was surprising.","note":"\"Nonfugitiveness\" is generally used for humans in a legal context, not for animals. Use \"tameness\" or a similar word instead."},{"incorrect":"✗ She showed nonfugitiveness by staying at home.","correct":"✓ She showed her willingness to cooperate by staying at home.","note":"\"Nonfugitiveness\" implies a legal context. If there's no legal issue, use a phrase like \"willingness to cooperate\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["nonfugitive (adjective, noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonfugitiveness\" is a formal and relatively rare term. It is primarily used in legal or official contexts to describe the quality of someone who does not attempt to flee from justice or evade capture. Understanding this word requires a good grasp of prefixes like \"non-\" and the base word \"fugitive\". It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The defendant's attorney argued that his client's nonfugitiveness should be considered when determining bail.","translation":"被告の弁護士は、依頼人の逃亡しないことが保釈を決定する際に考慮されるべきだと主張した。","type":"noun","meaning_category":"state of not being a fugitive"},{"sentence":"The police took into account the suspect's nonfugitiveness when deciding whether to issue an arrest warrant.","translation":"警察は、逮捕状を発行するかどうかを決定する際に、容疑者の逃亡しないことを考慮に入れた。","type":"noun","meaning_category":"state of not being a fugitive"}]}