{"word":"scattersite","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(astronomy) A trans-Neptunian object (TNO) that has been gravitationally scattered by Neptune into a highly eccentric and inclined orbit.","english_definition":"A trans-Neptunian object (TNO) that has been gravitationally scattered by Neptune into a highly eccentric and inclined orbit.","examples":[{"sentence":"Eris is a well-known example of a scattersite.","translation":"エリスは散乱円盤天体の有名な例です。"}],"collocations":["scattered disc object","trans-Neptunian object","orbital resonance"],"synonyms":["scattered disc object"],"antonyms":[]}],"etymology":{"value":"A combination of \"scattered\" (referring to the gravitational scattering by Neptune) and \"site\" (referring to the location of these objects).","priority":"N/A"},"pronunciation":{"ipa":"/ˈskætərˌsaɪt/","syllables":"scat-ter-site"},"inflection":{"notes":"Plural: scattersites"},"usage_notes":{"explanation":"The term \"scattersite\" is primarily used in the field of astronomy to describe a specific type of trans-Neptunian object (TNO). These objects are characterized by their highly eccentric and inclined orbits, which are believed to be the result of gravitational interactions with Neptune. Scattersites are distinct from other TNOs, such as Kuiper Belt objects, which have more stable and less eccentric orbits.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["scattered disc","trans-Neptunian object","Kuiper Belt"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Specialized astronomical term.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"\"Scattersite\" is a specialized term used in astronomy to describe trans-Neptunian objects (TNOs) that have been gravitationally influenced by Neptune, resulting in highly eccentric and inclined orbits. Understanding this term requires knowledge of celestial mechanics and the structure of the outer solar system. It's not a commonly used word outside of astronomical contexts."},"example_sentences":[{"sentence":"The scattersite's orbit takes it far beyond the Kuiper Belt.","translation":"その散乱円盤天体の軌道は、カイパーベルトをはるかに超えて広がっています。","type":"noun","meaning_category":"astronomy"},{"sentence":"Researchers are studying the distribution of scattersites to better understand the early solar system.","translation":"研究者たちは、初期の太陽系をより良く理解するために、散乱円盤天体の分布を研究しています。","type":"noun","meaning_category":"astronomy"}]}