{"word":"shootboard","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(木工) 突き当て定規、シュートボード：手押し鉋で木口を正確に削るための治具","english_definition":"A jig used in woodworking to accurately trim end grain with a hand plane.","examples":[{"sentence":"He used a shootboard to square the end of the board.","translation":"彼はシュートボードを使って板の端を直角に削った。"},{"sentence":"The shootboard helps to keep the plane aligned for a clean cut.","translation":"シュートボードは、鉋を正しい位置に保ち、きれいな切断面を作るのに役立つ。"}],"collocations":["use a shootboard","make a shootboard","shootboard plane"],"synonyms":["shooting board"],"antonyms":[]}],"etymology":{"value":"\"Shoot\" (to plane) + \"board\".","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈʃuːtˌbɔːrd/","syllables":"shoot-board"},"inflection":{"noun_plural":"shootboards"},"usage_notes":{"explanation":"A shootboard is a woodworking tool used to create perfectly square or angled edges on pieces of wood, especially end grain. It consists of a flat surface with a fence against which the wood is held, and a track or channel for a hand plane to run along.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["shooting plane"],"related_terms":["hand plane","woodworking jig","end grain"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term \"shootboard\" refers to a specialized woodworking tool used to create precise edges on wood. Understanding this term requires familiarity with woodworking techniques and tools, making it more suitable for advanced English speakers or those with a specific interest in woodworking."},"example_sentences":[{"sentence":"The craftsman carefully adjusted the wood in the **shootboard** before making the final pass with the plane.","translation":"職人は鉋で最後の仕上げをする前に、シュートボードの中で木材を注意深く調整した。","type":"example","meaning_category":"general"},{"sentence":"Using a **shootboard** ensures that the end grain is perfectly square.","translation":"シュートボードを使用することで、木口が完全に直角になることが保証される。","type":"example","meaning_category":"function"}]}