{"word":"anisoiconia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不同像視：両眼で見た像の大きさが異なる状態。","english_definition":"A condition in which there is a significant difference in the perceived size of the images formed in the two eyes.","examples":[{"sentence":"Anisoiconia can cause headaches and eye strain.","translation":"不同像視は、頭痛や眼精疲労を引き起こす可能性があります。"},{"sentence":"The patient was diagnosed with anisoiconia after complaining of double vision.","translation":"患者は、物が二重に見えると訴えた後、不同像視と診断されました。"}],"collocations":["corrected anisoiconia","induced anisoiconia","symptoms of anisoiconia"],"synonyms":["size lens distortion","optical size difference"],"antonyms":[]}],"etymology":{"value":"From Greek 'an-' (not), 'iso-' (equal), 'icon' (image), and '-ia' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænɪsaɪkəˈnoʊniə/","syllables":"an-i-so-i-co-ni-a"},"inflection":{"notes":"Plural form is anisoiconias."},"usage_notes":{"explanation":"Anisoiconia is a visual condition where the perceived size of an image differs significantly between the two eyes. This difference in size can lead to discomfort, headaches, and difficulties with depth perception. It is often caused by differences in refractive error, retinal distortion, or neurological issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Anisoconia is the same as anisometropia.","correct":"✓ Anisoiconia is different from anisometropia.","note":"Anisoiconia refers to a difference in image size, while anisometropia refers to a difference in refractive power between the two eyes."}],"priority":"★★☆"},"related_words":{"derivatives":["aniseikonia (alternative spelling)","aniseikonic (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Anisoiconia is a technical term used in ophthalmology and optometry to describe a condition where the perceived size of an image differs significantly between the two eyes. This difference can cause visual discomfort and difficulties with depth perception. The condition is often diagnosed through specialized eye exams and can be managed with corrective lenses or other visual therapies.","priority":"★★☆"},"example_sentences":[{"sentence":"Spectacle lenses can be designed to correct anisoiconia.","translation":"眼鏡レンズは、不同像視を矯正するように設計できます。","type":"general","meaning_category":"treatment"},{"sentence":"Severe anisoiconia can lead to suppression of vision in one eye.","translation":"重度の不同像視は、片眼の視力抑制につながる可能性があります。","type":"general","meaning_category":"effects"}]}