{"word":"quizzability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"クイズに適していること、クイズにできる性質","english_definition":"The quality of being suitable for use in a quiz; the extent to which something can be quizzed.","examples":[{"sentence":"The quizzability of this topic makes it perfect for our trivia night.","translation":"このテーマのクイズへの適性は、私たちのトリビアの夜に最適です。"},{"sentence":"We need to increase the quizzability of our training materials to make them more engaging.","translation":"トレーニング教材をもっと魅力的にするために、クイズへの適性を高める必要があります。"}],"collocations":["high quizzability","low quizzability","assess quizzability","increase quizzability"],"synonyms":["testability","suitability for trivia","quiz potential"],"antonyms":["unsuitability for quizzes","lack of quiz potential"]}],"etymology":{"value":"Derived from 'quizzable' (capable of being quizzed) + '-ity' (a suffix forming nouns expressing state or condition). 'Quizzable' comes from 'quiz' (a test of knowledge) + '-able' (capable of).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌkwɪzəˈbɪləti/","syllables":"quiz-za-bil-i-ty"},"inflection":{"noun_plural":"quizzabilities (rarely used)"},"usage_notes":{"explanation":"'Quizzability' is a relatively uncommon word, primarily used in contexts where the suitability of information or a topic for use in a quiz is being assessed. It is often used in educational or entertainment settings where quizzes are a common activity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The quizzability is very important for the exam.","correct":"✓ The testability is very important for the exam.","note":"'Quizzability' is more specific to the context of quizzes, whereas 'testability' is a more general term for exams or assessments."}],"priority":"★☆☆"},"related_words":{"derivatives":["quizzable","quiz"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not commonly found in CEFR-aligned materials)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Quizzability' is a specialized term used to describe how well something lends itself to being turned into a quiz question or a quiz topic. It's not a common word, so you'd typically only encounter it in contexts where quizzes are being discussed or designed, such as in education or entertainment."},"example_sentences":[{"sentence":"The high quizzability of historical events makes them a popular choice for trivia nights.","translation":"歴史的出来事のクイズへの適性の高さが、トリビアの夜の人気のある選択肢となっています。","type":"noun","meaning_category":"suitability for quizzes"},{"sentence":"We evaluated the quizzability of each chapter to ensure the review questions were engaging.","translation":"レビューの質問が魅力的であることを保証するために、各章のクイズへの適性を評価しました。","type":"noun","meaning_category":"suitability for quizzes"}]}