{"word":"transplanetary","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"惑星間（の）、惑星間旅行の","english_definition":"Traveling or existing between planets; relating to or involving travel between planets.","examples":[{"sentence":"Transplanetary travel is currently beyond our technological capabilities.","translation":"惑星間旅行は現在、私たちの技術的能力を超えています。"},{"sentence":"The mission aims to study the feasibility of transplanetary colonization.","translation":"そのミッションは、惑星間植民の実現可能性を研究することを目的としています。"},{"sentence":"Scientists are developing new propulsion systems for transplanetary missions.","translation":"科学者たちは、惑星間ミッションのための新しい推進システムを開発しています。"}],"collocations":["transplanetary mission","transplanetary travel","transplanetary colonization","transplanetary spacecraft","transplanetary trajectory"],"synonyms":["interplanetary","interstellar"],"antonyms":["intraplanetary"],"notes":"Often used in the context of space exploration and science fiction."}],"etymology":{"value":"Derived from the prefix 'trans-' (across, beyond) and 'planetary' (relating to planets).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtrænzˈplænɪˌteri/","syllables":"trans-plan-i-tar-y"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"'Transplanetary' refers to something that exists or occurs between planets, especially in the context of space travel. It emphasizes movement or existence across planetary boundaries. It is often used in scientific and technical contexts related to space exploration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The transplanetary system.","correct":"✓ The interplanetary system.","note":"'Transplanetary' refers to travel or existence between planets, not the system of planets itself. Use 'planetary system' or 'interplanetary system' instead."},{"incorrect":"✗ Transplanetary is easy.","correct":"✓ Transplanetary travel is difficult.","note":"'Transplanetary' is an adjective and needs a noun to modify. 'Transplanetary travel' or 'transplanetary missions' are correct usages."}],"priority":"★★☆"},"related_words":{"derivatives":["transplanet (noun, rare): A hypothetical planet beyond our solar system that can be reached by transplanetary travel.","planetary (adjective): Relating to or resembling a planet."],"related_terms":["interplanetary (adjective): Existing or occurring between planets.","interstellar (adjective): Existing or occurring between stars.","exoplanetary (adjective): Relating to planets outside our solar system."]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Transplanetary' is a specialized term primarily used in the context of space exploration and science fiction. It refers to anything involving travel or existence between planets. Due to its specific usage and relatively low frequency, it is considered an advanced vocabulary word. Understanding the prefixes 'trans-' (across) and 'planetary' (relating to planets) can help in deciphering its meaning."},"example_sentences":[{"sentence":"The development of advanced propulsion systems is crucial for future **transplanetary** missions.","translation":"将来の**惑星間**ミッションには、高度な推進システムの開発が不可欠です。","type":"adjective","meaning_category":"惑星間の"},{"sentence":"Scientists are studying the challenges of sustaining life during long-duration **transplanetary** voyages.","translation":"科学者たちは、長期間の**惑星間**航海中に生命を維持することの課題を研究しています。","type":"adjective","meaning_category":"惑星間の"},{"sentence":"The concept of **transplanetary** colonization raises ethical and logistical questions.","translation":"**惑星間**植民の概念は、倫理的および物流的な問題を提起します。","type":"adjective","meaning_category":"惑星間の"}]}