{"word":"song-oriented","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"楽曲重視の、歌を重視した","english_definition":"Focusing on the quality and structure of songs, rather than other aspects like instrumental improvisation or extended jams.","examples":[{"sentence":"The band's new album is more song-oriented than their previous work.","translation":"そのバンドの新しいアルバムは、以前の作品よりも楽曲重視になっている。"},{"sentence":"He prefers song-oriented music with strong melodies and catchy hooks.","translation":"彼は強いメロディーとキャッチーなフックのある、楽曲重視の音楽を好む。"}],"collocations":["song-oriented album","song-oriented approach","song-oriented band"],"synonyms":["melody-driven","pop-oriented","lyrically focused"],"antonyms":["jam-oriented","instrumental-oriented","experimental"],"notes":"Often used to describe music that prioritizes concise, well-crafted songs over extended instrumental sections or avant-garde experimentation."}],"etymology":{"value":"A compound word formed by combining 'song' and 'oriented'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈsɔŋˌɔːriˌɛntɪd/","syllables":"song-o-ri-ent-ed"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Song-oriented' describes music where the song itself is the primary focus, emphasizing elements like melody, lyrics, and structure. It's often used in contrast to music that is more focused on instrumental improvisation or sonic experimentation. The term is frequently used to describe pop, rock, and other genres where the song is the central element.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The band is song-orientated.","correct":"The band is song-oriented.","note":"The correct spelling is 'oriented', not 'orientated'."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_terms":["album-oriented rock (AOR)","pop song","songwriting"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'song-oriented' is used to describe music that emphasizes the importance of well-crafted songs with strong melodies and lyrics, as opposed to music that focuses on improvisation or instrumental experimentation. It's a term used in music criticism and discussion to differentiate between different approaches to making music."},"example_sentences":[{"sentence":"Their earlier albums were more experimental, but this one is decidedly song-oriented.","translation":"彼らの以前のアルバムはより実験的でしたが、これは明らかに楽曲重視です。","type":"general","meaning_category":"general"},{"sentence":"The producer wanted to make sure the album was song-oriented and radio-friendly.","translation":"プロデューサーは、アルバムが楽曲重視でラジオ向きであることを確認したかった。","type":"general","meaning_category":"general"}]}