{"word":"embolisms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"塞栓症（そくせんしょう）","english_definition":"The blockage of an artery, typically by a blood clot or air bubble.","examples":[{"sentence":"Pulmonary embolisms are a serious medical condition.","translation":"肺塞栓症は深刻な病状です。"},{"sentence":"The patient developed embolisms after the surgery.","translation":"患者は手術後に塞栓症を発症しました。"}],"collocations":["pulmonary embolism (肺塞栓症)","air embolism (空気塞栓症)","blood clot embolism (血栓塞栓症)"],"synonyms":["occlusion","blockage","obstruction"],"antonyms":[]}],"etymology":{"value":"The word \"embolism\" comes from the Greek word \"embolos,\" meaning \"plug\" or \"stopper.\" The suffix \"-ism\" denotes a condition or process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛmbəlɪzəmz/","syllables":"em-bo-lismz"},"inflection":{"noun_plural":"embolisms"},"usage_notes":{"explanation":"\"Embolism\" refers to the condition where an embolus (a detached intravascular solid, liquid, or gaseous mass) blocks a blood vessel. The plural form, \"embolisms,\" refers to multiple instances of this condition or multiple emboli causing blockage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a embolism in his lung.","correct":"✓ He had an embolism in his lung.","note":"Use the indefinite article \"an\" before \"embolism\" because it starts with a vowel sound."},{"incorrect":"✗ Embolisms is a dangerous condition.","correct":"✓ Embolisms are a dangerous condition.","note":"Use the plural verb \"are\" with the plural noun \"embolisms.\""}],"priority":"★★☆"},"related_words":{"derivatives":["embolus (塞栓子)","embolic (塞栓性の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"embolisms\" is a medical term referring to the condition of having multiple emboli blocking blood vessels. It is typically used in medical contexts and may not be commonly encountered in everyday language. Understanding this term requires some knowledge of medical terminology."},"example_sentences":[{"sentence":"The autopsy revealed multiple fat embolisms in the patient's lungs.","translation":"検死の結果、患者の肺に複数の脂肪塞栓症が見つかりました。","type":"medical","meaning_category":"塞栓症"},{"sentence":"Deep vein thrombosis can lead to pulmonary embolisms if a blood clot travels to the lungs.","translation":"深部静脈血栓症は、血栓が肺に移動すると肺塞栓症を引き起こす可能性があります。","type":"medical","meaning_category":"塞栓症"}]}