{"word":"midbrain","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"中脳","english_definition":"The small central part of the brainstem, developing from the middle of the primitive or embryonic brain.","examples":[{"sentence":"The midbrain is responsible for motor movement, particularly movements of the eye, and auditory and visual processing.","translation":"中脳は、運動、特に眼球運動、および聴覚および視覚処理を担っています。"},{"sentence":"Damage to the midbrain can result in problems with movement, vision, and hearing.","translation":"中脳の損傷は、運動、視力、聴覚の問題を引き起こす可能性があります。"}],"collocations":["midbrain lesion (中脳病変)","midbrain tegmentum (中脳被蓋)","superior colliculus (上丘 - 中脳の一部)","inferior colliculus (下丘 - 中脳の一部)"],"synonyms":["mesencephalon"],"antonyms":[]}],"etymology":{"value":"'Mid-' (middle) + 'brain'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɪdˌbreɪn/","syllables":"mid-brain"},"inflection":{"noun_plural":"midbrains"},"usage_notes":{"explanation":"The midbrain is a relatively small part of the brainstem located between the forebrain and the hindbrain. It plays a crucial role in motor control, vision, hearing, arousal, and temperature regulation. It contains important nuclei such as the substantia nigra and the red nucleus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The midbrain is in the front of the brain.","correct":"✓ The midbrain is in the middle of the brainstem.","note":"The midbrain is not in the front of the brain, but rather in the middle of the brainstem."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["forebrain","hindbrain","brainstem","substantia nigra","red nucleus","superior colliculus","inferior colliculus"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"midbrain\" refers to a specific anatomical region of the brainstem. Understanding this term requires a basic knowledge of neuroanatomy. It is typically encountered in advanced biology, neuroscience, or medical contexts. The midbrain is a relatively small structure but plays a vital role in various functions, including motor control, sensory processing, and alertness.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient's symptoms suggested a possible lesion in the **midbrain**.","translation":"患者の症状は、中脳の病変の可能性を示唆していた。","type":"general","meaning_category":"anatomy"},{"sentence":"The **midbrain** plays a crucial role in relaying auditory and visual information.","translation":"中脳は、聴覚および視覚情報を伝達する上で重要な役割を果たしている。","type":"function","meaning_category":"physiology"},{"sentence":"Researchers are studying the effects of certain drugs on the activity of neurons in the **midbrain**.","translation":"研究者たちは、特定薬物が中脳のニューロンの活動に及ぼす影響を研究している。","type":"research","meaning_category":"neuroscience"}]}