{"word":"kininogenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"キニンを生成する、またはキニン生成を促進する","english_definition":"Capable of generating kinins or promoting kinin production.","examples":[{"sentence":"Kallikrein is a kininogenic enzyme.","translation":"カリクレインはキニン生成酵素です。"},{"sentence":"Certain inflammatory stimuli can have kininogenic effects.","translation":"特定の炎症性刺激はキニン生成効果を持つことがあります。"}],"collocations":["kininogenic activity","kininogenic enzyme","kininogenic effect"],"synonyms":["kinin-generating","kinin-producing"],"antonyms":["kinin-inhibiting"]},{"part_of_speech":"adjective","definition":"キニンに関連する、またはキニンによって引き起こされる","english_definition":"Relating to or caused by kinins.","examples":[{"sentence":"The kininogenic properties of this substance are under investigation.","translation":"この物質のキニン生成特性が調査されています。"}],"collocations":["kininogenic properties","kininogenic response"],"synonyms":["kinin-related"],"antonyms":[]}],"etymology":{"value":"'Kinin' + '-o-' + '-genic' (producing). Kinin refers to a group of polypeptides that cause vasodilation and smooth muscle contraction. '-genic' indicates producing or causing.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɪnɪnoʊˈdʒɛnɪk/","syllables":"ki-ni-no-gen-ic"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms, which are rarely used for this word."},"usage_notes":{"explanation":"The term 'kininogenic' is primarily used in biochemistry, pharmacology, and related fields to describe substances or processes that are involved in the production or action of kinins. Kinins are important mediators of inflammation, pain, and blood pressure regulation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The drug is kininogenic, so it lowers blood pressure.","correct":"✓ The drug has kininogenic effects, so it lowers blood pressure.","note":"It's more accurate to say a drug 'has kininogenic effects' rather than saying the drug 'is kininogenic,' unless it directly produces kinins."}],"priority":"★★☆"},"related_words":{"derivatives":["kinin","kininogen","kallikrein"],"phrases":["kinin system"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'kininogenic' is a technical term used in scientific contexts, particularly in biochemistry and pharmacology. It refers to the ability to produce or cause the production of kinins, which are peptides involved in inflammation and blood pressure regulation. Understanding this term requires knowledge of these scientific fields."},"example_sentences":[{"sentence":"The researchers studied the kininogenic activity of the bacterial enzyme.","translation":"研究者たちは、その細菌酵素のキニン生成活性を研究した。","type":"adjective","meaning_category":"キニンを生成する"},{"sentence":"Inflammation can trigger a kininogenic response in the affected tissues.","translation":"炎症は、影響を受けた組織においてキニン生成反応を引き起こす可能性がある。","type":"adjective","meaning_category":"キニンに関連する"}]}