{"word":"readhesion","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"再接着、再付着、再癒着","english_definition":"The act or process of adhering again; the state of being adhered again.","examples":[{"sentence":"The readhesion of the skin graft was successful.","translation":"皮膚移植の再接着は成功した。"},{"sentence":"The surgeon worked to prevent readhesion of the tissues after the operation.","translation":"外科医は手術後、組織の再癒着を防ぐために尽力した。"},{"sentence":"The readhesion strength of the adhesive was tested.","translation":"接着剤の再接着強度が試験された。"}],"collocations":["prevent readhesion","successful readhesion","readhesion strength","tissue readhesion","skin readhesion"],"synonyms":["re-adherence","re-attachment","reunion","rejoining"],"antonyms":["separation","detachment","delamination"]}],"etymology":{"value":"The word \"readhesion\" is formed by adding the prefix \"re-\" (meaning again) to the word \"adhesion\" (the act or state of adhering or sticking fast to a surface or object).","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːədˈhiːʒən/","syllables":"re-ad-he-sion"},"inflection":{"noun_plural":"readhesions"},"usage_notes":{"explanation":"\"Readhesion\" refers to the process where something that was previously adhered or attached becomes adhered or attached again. It is often used in medical contexts to describe the rejoining of tissues or skin grafts, or in industrial contexts to describe the re-bonding of materials.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The readhesion was good, so the patient was happy.","correct":"✓ The readhesion was successful, so the patient was happy.","note":"Using \"successful\" provides more specific information about the quality of the readhesion."},{"incorrect":"✗ Readhesion of the glue was poor.","correct":"✓ The readhesion of the glue was poor.","note":"Adding the article \"The\" makes the sentence more grammatically correct and specific."}],"priority":"★★☆"},"related_words":{"derivatives":["adhesion","adhesive","re-adhere"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"readhesion\" is a technical term, primarily used in medical or industrial contexts. It describes the process of something adhering or sticking together again after being separated. Understanding the prefix \"re-\" and the base word \"adhesion\" is key to understanding its meaning. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The goal of the surgery was to promote the readhesion of the torn muscle fibers.","translation":"手術の目的は、断裂した筋肉繊維の再接着を促進することだった。","type":"noun","meaning_category":"再接着 (medical)"},{"sentence":"The readhesion of the coating to the metal substrate improved the product's durability.","translation":"コーティングの金属基板への再付着により、製品の耐久性が向上した。","type":"noun","meaning_category":"再付着 (industrial)"},{"sentence":"Efforts were made to minimize readhesion of the scar tissue.","translation":"瘢痕組織の再癒着を最小限に抑えるための努力が払われた。","type":"noun","meaning_category":"再癒着 (medical)"}]}