{"word":"untwinned","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"双晶でない、双晶構造を持たない","english_definition":"Not twinned; lacking a twinned structure. (In mineralogy, crystallography, etc., a crystal is twinned when two or more intergrown single crystals are related by a symmetry operation.)","examples":[{"sentence":"The untwinned crystal showed clear optical properties.","translation":"その双晶でない結晶は、明瞭な光学特性を示した。"},{"sentence":"Untwinned calcite is rare in this formation.","translation":"この地層では、双晶でない方解石は珍しい。"}],"collocations":["untwinned crystal","untwinned calcite","untwinned structure"],"synonyms":["single crystal","non-twinned"],"antonyms":["twinned"],"notes":"Primarily used in scientific contexts, especially mineralogy and crystallography."}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the word 'twinned'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnˈtwɪnd/","syllables":"un-twinned"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Untwinned' is a technical term used in the fields of mineralogy and crystallography to describe a crystal that does not exhibit twinning. Twinning refers to the intergrowth of two or more crystals in a symmetrical manner. An untwinned crystal is therefore a single, individual crystal without this type of intergrowth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The untwinned babies were healthy.","correct":"✓ The single baby was healthy.","note":"'Untwinned' refers to crystals, not human twins. Use 'single' in the context of a single birth."}],"priority":"★☆☆"},"related_words":{"derivatives":["twin","twinned","twinning"],"related_terms":["crystal","mineral","crystallography","symmetry"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Untwinned' is a specialized term primarily used in scientific fields like mineralogy and crystallography. It describes a crystal that does not exhibit twinning, which is the intergrowth of two or more crystals in a symmetrical way. Due to its technical nature, it is not a common word and is mainly encountered in scientific literature or discussions related to crystal structures."},"example_sentences":[{"sentence":"The researcher examined the untwinned quartz sample under a microscope.","translation":"研究者は顕微鏡で双晶でない石英のサンプルを調べた。","type":"adjective","meaning_category":"Describing a crystal"},{"sentence":"The absence of twinning in the crystal structure simplified the analysis.","translation":"結晶構造における双晶の欠如は、分析を簡素化した。","type":"adjective","meaning_category":"Describing a crystal structure"}]}