{"word":"nonconnivance","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"黙認しないこと、見て見ぬふりをしないこと、共謀しないこと","english_definition":"The state or quality of not conniving; failure to connive; refusal to cooperate or secretly assist in wrongdoing.","examples":[{"sentence":"His nonconnivance with the corrupt officials led to his dismissal.","translation":"彼が汚職役人たちを黙認しなかったことが、彼の解雇につながった。"},{"sentence":"The investigation revealed a culture of nonconnivance within the department.","translation":"調査によって、その部署内には黙認しない文化があることが明らかになった。"},{"sentence":"She was praised for her nonconnivance in the face of pressure to compromise her principles.","translation":"彼女は、自身の原則を妥協するよう圧力をかけられた際に、それを黙認しなかったことで称賛された。"}],"collocations":["evidence of nonconnivance (黙認していない証拠)","policy of nonconnivance (黙認しない方針)","culture of nonconnivance (黙認しない文化)","demonstrate nonconnivance (黙認しないことを示す)"],"synonyms":["opposition","resistance","disapproval","non-cooperation","refusal to condone"],"antonyms":["connivance","collusion","complicity","acquiescence","condoning"]}],"etymology":{"value":"\"non-\" (否定) + \"connivance\" (黙認、共謀)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnkəˈnaɪvəns/","syllables":"non-con-ni-vance"},"inflection":{"noun_plural":"nonconnivances (まれ)"},"usage_notes":{"explanation":"\"Nonconnivance\" is a formal term that describes the act of refusing to secretly cooperate with or condone wrongdoing. It emphasizes a stance of opposition to unethical or illegal activities. It is often used in legal, ethical, or organizational contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed nonconnivance to the plan.","correct":"✓ He showed nonconnivance with the plan.","note":"The preposition \"with\" is typically used to indicate what one is not conniving with."},{"incorrect":"✗ The nonconnivance was evident.","correct":"✓ The lack of connivance was evident. / ✓ Their nonconnivance was evident.","note":"While grammatically correct, it's often more natural to specify whose nonconnivance is being discussed or to use \"lack of connivance\"."}],"priority":"★★☆"},"related_words":{"derivatives":["connivance (黙認、共謀)","connive (黙認する、共謀する)"],"antonyms":["collusion (共謀)","complicity (共犯)","acquiescence (黙認)"]},"level_frequency":{"frequency_google_ngram":"Low frequency (低い頻度) - 専門的な文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonconnivance\" is a relatively uncommon and formal word that means a refusal to secretly cooperate with or condone wrongdoing. It's essentially the opposite of \"connivance,\" which means secretly allowing something wrong to occur. You'll typically find \"nonconnivance\" used in legal, ethical, or organizational contexts where there's a need to emphasize a stance against unethical behavior. It's a more sophisticated way of saying someone didn't turn a blind eye to something wrong.","priority":"★★☆"},"example_sentences":[{"sentence":"The whistleblower's nonconnivance with the company's fraudulent practices ultimately led to a federal investigation.","translation":"内部告発者が会社の不正行為を黙認しなかったことが、最終的に連邦政府の調査につながった。","type":"general","meaning_category":"refusal to condone"},{"sentence":"The auditor's report highlighted the importance of maintaining a culture of nonconnivance within the organization.","translation":"監査報告書は、組織内で黙認しない文化を維持することの重要性を強調した。","type":"organizational","meaning_category":"organizational ethics"},{"sentence":"The judge commended the witness for their nonconnivance, stating that it was essential for upholding justice.","translation":"裁判官は、証人の黙認しない姿勢を称賛し、それが正義を維持するために不可欠であると述べた。","type":"legal","meaning_category":"legal context"}]}