{"word":"lapstreaked","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having overlapping planks or plates, as in the construction of a boat or siding.","english_definition":"Constructed with overlapping planks or plates.","examples":[{"sentence":"The lapstreaked hull of the boat glistened in the sun.","translation":"その船の重ね板構造の船体は太陽の下で輝いていた。"},{"sentence":"Lapstreaked siding is a traditional feature of many New England homes.","translation":"重ね板構造の外壁は、ニューイングランドの多くの家の伝統的な特徴です。"}],"collocations":["lapstreaked hull","lapstreaked siding","lapstreaked construction"],"synonyms":["clinker-built","overlap-planked"],"antonyms":[]}],"etymology":{"value":"A combination of 'lap' (referring to the overlapping of edges) and 'streaked' (implying a linear arrangement or pattern).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlæpstriːkt/","syllables":"lap-streak-ed"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms, though they are not commonly used: more lapstreaked, most lapstreaked."},"usage_notes":{"explanation":"'Lapstreaked' specifically describes a construction method where planks or plates overlap each other, creating a distinctive ridged or stepped appearance. This is most commonly used in boatbuilding and siding construction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The siding was lapstreak.","correct":"✓ The siding was lapstreaked.","note":"'Lapstreak' is not the correct form; the adjective is 'lapstreaked'."}],"priority":"★☆☆"},"related_words":{"derivatives":["lapstrake (noun): A method of boat building in which the planks overlap each other.","clinker (noun): A type of lapstrake construction."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lapstreaked' is a specialized term primarily used in the context of boat building and construction. It describes a specific technique where planks or plates overlap, creating a distinctive pattern. Understanding this term requires familiarity with construction and nautical terminology."},"example_sentences":[{"sentence":"The museum displayed a beautifully preserved lapstreaked Viking longship.","translation":"博物館には、美しく保存された重ね板構造のバイキングのロングシップが展示されていた。","type":"adjective","meaning_category":"construction"},{"sentence":"The craftsman carefully fitted each plank of the lapstreaked canoe.","translation":"職人は重ね板構造のカヌーの各板を慎重に取り付けた。","type":"adjective","meaning_category":"boatbuilding"}]}