{"word":"nonmonogamously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"非一夫一婦制で、非独占的に","english_definition":"In a nonmonogamous manner; in a way that does not adhere to the principles or practice of having only one sexual partner at a time.","examples":[{"sentence":"They decided to explore their relationship nonmonogamously.","translation":"彼らは自分たちの関係を非一夫一婦制で探求することに決めた。"},{"sentence":"She practices ethical nonmonogamy and dates multiple people nonmonogamously.","translation":"彼女は倫理的な非一夫一婦制を実践しており、複数の人と非独占的にデートをしている。"}],"collocations":["date nonmonogamously","live nonmonogamously","practice nonmonogamy nonmonogamously"],"synonyms":["openly","polyamorously","ethically nonmonogamously"],"antonyms":["monogamously","exclusively","faithfully"]}],"etymology":{"value":"Derived from 'nonmonogamous' (not practicing monogamy) + '-ly' (adverbial suffix). 'Non-' is a prefix meaning 'not,' 'mono-' means 'one,' 'gamy' relates to marriage or sexual relationships, and '-ous' is an adjectival suffix.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.məˈnɒɡ.ə.məs.li/","syllables":"non-mo-nog-a-mous-ly"},"inflection":{"notes":"Adverb, does not inflect."},"usage_notes":{"explanation":"'Nonmonogamously' describes how something is done in relation to nonmonogamy, which is the practice of having multiple consensual sexual or romantic relationships at the same time. It often implies openness, honesty, and consent among all partners involved. The term is often associated with ethical nonmonogamy or polyamory, where all participants are aware and agree to the arrangement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They are nonmonogamously.","correct":"✓ They are dating nonmonogamously.","note":"'Nonmonogamously' is an adverb and modifies a verb. It cannot be used as a predicate adjective to describe a person."},{"incorrect":"✗ nonmonogamouslly","correct":"✓ nonmonogamously","note":"Correct spelling is essential as this is a relatively new and specific term."}],"priority":"★★☆"},"related_words":{"derivatives":["nonmonogamous (adjective)","nonmonogamy (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'nonmonogamously' is a complex term related to relationships and sexuality. It means doing something in a way that does not follow the traditional idea of having only one romantic or sexual partner. This word is mostly used in discussions about different types of relationships, such as ethical non-monogamy or polyamory, where everyone involved knows and agrees to have multiple partners. Because it's a specialized term, it's not commonly used in everyday conversation and is more likely to appear in academic or specialized contexts."},"example_sentences":[{"sentence":"The couple openly discussed their needs and decided to approach their relationship nonmonogamously.","translation":"そのカップルはお互いのニーズを率直に話し合い、自分たちの関係を非一夫一婦制で進めることに決めた。","type":"adverb","meaning_category":"非一夫一婦制で"},{"sentence":"She navigates the dating world nonmonogamously, prioritizing honesty and communication with all her partners.","translation":"彼女はデートの世界を非一夫一婦制で進めており、すべてのパートナーとの誠実さとコミュニケーションを重視している。","type":"adverb","meaning_category":"非独占的に"}]}