{"word":"isoimmunization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"同種免疫、同種免疫化","english_definition":"The development of antibodies by an individual against antigens from another individual of the same species.","examples":[{"sentence":"Isoimmunization can occur during pregnancy when fetal red blood cells enter the mother's circulation.","translation":"同種免疫は、胎児の赤血球が母親の血液循環に入るときに妊娠中に起こることがあります。"},{"sentence":"Rh isoimmunization is a condition where a pregnant woman develops antibodies against her baby's Rh-positive blood cells.","translation":"Rh同種免疫は、妊娠中の女性が赤ちゃんのRh陽性血液細胞に対する抗体を生成する状態です。"}],"collocations":["Rh isoimmunization","prevent isoimmunization","maternal isoimmunization","fetal isoimmunization"],"synonyms":["alloimmunization"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek prefix 'iso-' meaning 'equal' or 'same', combined with 'immunization', referring to the process of becoming immune.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaɪsoʊˌɪmjunɪˈzeɪʃən/","syllables":"i-so-im-mu-ni-za-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Isoimmunization typically refers to the immune response that occurs when an individual is exposed to foreign antigens from another individual of the same species. This is particularly relevant in the context of pregnancy, where the mother can develop antibodies against fetal blood cells if they are incompatible.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Isoimmunization only affects the mother.","correct":"✓ Isoimmunization can affect both the mother and the fetus.","note":"While the mother develops the antibodies, these antibodies can cross the placenta and affect the fetus."}],"priority":"★☆☆"},"related_words":{"derivatives":["isoimmune (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Isoimmunization is a complex medical term that refers to the process where an individual's immune system reacts against antigens from another individual of the same species. This is most commonly discussed in the context of pregnancy, specifically when a mother develops antibodies against her fetus's red blood cells due to Rh incompatibility. Understanding this term requires a background knowledge of immunology and reproductive health."},"example_sentences":[{"sentence":"The doctor explained the risks of isoimmunization during the prenatal appointment.","translation":"医師は出生前検診で同種免疫のリスクについて説明しました。","type":"general","meaning_category":"general"},{"sentence":"RhoGAM is administered to prevent Rh isoimmunization in Rh-negative mothers.","translation":"RhoGAMは、Rh陰性の母親におけるRh同種免疫を予防するために投与されます。","type":"medical","meaning_category":"prevention"}]}