{"word":"underfit","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(機械学習において)学習不足である、過小適合する","english_definition":"(in machine learning) to fail to capture the underlying trend of the data; to be too simple to accurately model the data.","examples":[{"sentence":"The model underfits the data because it's not complex enough.","translation":"モデルが十分に複雑でないため、データに過小適合している。"},{"sentence":"If your model is underfitting, you need to add more features or use a more complex algorithm.","translation":"モデルが過小適合している場合は、より多くの特徴を追加するか、より複雑なアルゴリズムを使用する必要があります。"}],"collocations":["model underfits","underfit the data","avoid underfitting"],"synonyms":["not generalize well","poorly fit","low accuracy"],"antonyms":["overfit","generalize well"]},{"part_of_speech":"adjective","definition":"(機械学習において)学習不足の、過小適合の","english_definition":"(in machine learning) describing a model that fails to capture the underlying trend of the data; too simple to accurately model the data.","examples":[{"sentence":"An underfit model will perform poorly on both the training and test sets.","translation":"過小適合のモデルは、トレーニングセットとテストセットの両方でパフォーマンスが低い。"},{"sentence":"The underfit model had a high bias.","translation":"過小適合のモデルは高いバイアスを持っていた。"}],"collocations":["underfit model","underfit data","underfit curve"],"synonyms":["poorly fitted","not well-generalized","low complexity"],"antonyms":["overfit","well-fitted"]}],"etymology":{"value":"Derived from 'under-' (meaning 'not enough' or 'below') and 'fit' (meaning 'to be suitable or appropriate'). In the context of machine learning, it describes a model that is not complex enough to 'fit' the data well.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈfɪt/","syllables":"un-der-fit"},"inflection":{"verb_forms":{"present_simple":["underfit","underfits"],"past_simple":"underfitted","past_participle":"underfitted","present_participle":"underfitting"},"adjective_forms":{}},"usage_notes":{"explanation":"'Underfit' is primarily used in the context of machine learning and statistics. It describes a model that is too simple to capture the underlying patterns in the data. This results in poor performance on both the training data and unseen data.  It is the opposite of 'overfit', where the model is too complex and fits the training data too closely, leading to poor generalization.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The clothes underfit me.","correct":"✓ The clothes don't fit me well. / ✓ The clothes are too big/small for me.","note":"'Underfit' in machine learning refers to a model's performance, not the fit of clothing. Use 'don't fit well', 'too big', or 'too small' for clothing. "},{"incorrect":"✗ The model is underfitting because it has a lot of data.","correct":"✓ The model is underfitting because it is too simple.","note":"Underfitting is caused by a model being too simple, not by having too much data. Having too much data might reveal the underfitting more clearly, but is not the cause."}],"priority":"★★☆"},"related_words":{"derivatives":["underfitting (noun)"],"synonyms":["low bias","high bias","low variance"],"antonyms":["overfit","overfitting","high variance"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency (specific to technical domains)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'underfit' is highly specific to the field of machine learning. It describes a situation where a model is too simple to capture the underlying patterns in the data. This means the model will perform poorly, even on the data it was trained on. Understanding this term requires familiarity with basic machine learning concepts such as model complexity, bias, and variance. It's often discussed in contrast to 'overfitting', where the model is too complex and memorizes the training data, leading to poor performance on new, unseen data."},"example_sentences":[{"sentence":"The linear regression model was clearly **underfitting** the non-linear data.","translation":"線形回帰モデルは明らかに非線形データに過小適合していた。","type":"verb","meaning_category":"学習不足である"},{"sentence":"An **underfit** model is characterized by high bias and low variance.","translation":"過小適合のモデルは、高いバイアスと低い分散によって特徴付けられる。","type":"adjective","meaning_category":"学習不足の"},{"sentence":"To address **underfitting**, consider using a more complex model or adding more relevant features.","translation":"過小適合に対処するには、より複雑なモデルを使用するか、より関連性の高い特徴を追加することを検討してください。","type":"verb","meaning_category":"学習不足である"}]}