{"word":"Baedeker","priority":"低","meanings":[{"part_of_speech":"noun","definition":"旅行案内書、特に詳細で信頼できるものとして知られるもの。また、そのような案内書を発行したドイツの出版社。","english_definition":"A guidebook, especially one known for its detail and reliability. Also, the German publishing firm that produced such guidebooks.","examples":[{"sentence":"We consulted our Baedeker before visiting the museum.","translation":"博物館を訪れる前に、バエデカー（旅行案内書）に相談しました。"},{"sentence":"The city was 'Baedekerized,' meaning it was heavily touristed.","translation":"その都市は「バエデカー化」され、観光客で溢れかえっていた。"}],"collocations":["Baedeker guide","consult a Baedeker","Baedeker edition"],"synonyms":["guidebook","travel guide","itinerary"],"antonyms":[]},{"part_of_speech":"verb","definition":"(都市や場所)をバエデカー化する：観光地として発展させ、多くの観光客を引き寄せる。","english_definition":"To 'Baedekerize' (a city or place): to develop it as a tourist destination, attracting many tourists.","examples":[{"sentence":"The town was Baedekered after the film was shot there.","translation":"その町は映画の撮影後、バエデカー化された（観光地として発展した）。"}],"collocations":["Baedekerize a town","Baedekerize a region"],"synonyms":["touristify","develop for tourism"],"antonyms":[]}],"etymology":{"value":"Karl Baedeker (1801-1859), a German publisher who produced detailed and reliable travel guidebooks. His name became synonymous with high-quality travel guides.","priority":"高"},"pronunciation":{"ipa":"/ˈbeɪdɪkər/","syllables":"Bay-de-ker"},"inflection":{"noun_plural":"Baedekers","verb_forms":{}},"usage_notes":{"explanation":"The term 'Baedeker' is often used generically to refer to any detailed and reliable travel guidebook, even if it's not actually published by the Baedeker firm. The verb 'Baedekerize' is less common but describes the process of turning a place into a popular tourist destination, often with a focus on historical or cultural sites.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"I read a Baedeker about France, written by Michelin.","correct":"I read a guidebook about France, written by Michelin.","note":"'Baedeker' refers to a specific type of guidebook, not just any guidebook. If it's not a Baedeker publication, use a more general term like 'guidebook'."}],"priority":"低"},"related_words":{"derivatives":["Baedekerized (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低","priority":"低"},"readability_explanation":{"level":"C2","text":"The word 'Baedeker' is relatively uncommon today. It's most likely to be encountered in historical contexts or when discussing travel literature. Understanding the etymology (its origin from a specific publisher) is key to grasping its meaning. The verb 'Baedekerize' is even rarer and is primarily used in academic or specialized writing.","priority":"中"},"example_sentences":[{"sentence":"The old Baedeker guide provided invaluable information about the historical sites.","translation":"古いバエデカーのガイドブックは、史跡に関する貴重な情報を提供してくれた。","type":"noun","meaning_category":"旅行案内書"},{"sentence":"The city council hoped to Baedekerize the waterfront area to attract more visitors.","translation":"市議会は、より多くの観光客を誘致するために、ウォーターフロントエリアをバエデカー化することを望んでいた。","type":"verb","meaning_category":"観光地化する"}]}