{"word":"Jeremiah","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"エレミヤ (人名: 旧約聖書の預言者)","english_definition":"A Hebrew prophet of the Old Testament; the book containing his prophecies. Also used as a male given name.","examples":[{"sentence":"Jeremiah was a major prophet in the Hebrew Bible.","translation":"エレミヤはヘブライ語聖書における主要な預言者の一人でした。"},{"sentence":"The Book of Jeremiah contains prophecies about the destruction of Jerusalem.","translation":"エレミヤ書には、エルサレムの滅亡に関する預言が含まれています。"},{"sentence":"Jeremiah is a popular name in some Christian communities.","translation":"エレミヤは一部のキリスト教コミュニティで人気のある名前です。"}],"collocations":["Book of Jeremiah (エレミヤ書)","Prophet Jeremiah (預言者エレミヤ)"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"悲観論者、悲嘆に暮れる人","english_definition":"A person who is pessimistic or given to lamenting; a wailing or mournful complaint.","examples":[{"sentence":"Don't be such a Jeremiah; things aren't as bad as you think.","translation":"そんなに悲観的にならないで。物事はあなたが思っているほど悪くはない。"},{"sentence":"His speech was full of Jeremiads about the decline of society.","translation":"彼の演説は社会の衰退についての悲嘆に満ちていた。"}],"collocations":["Jeremiad (悲嘆、哀歌)"],"synonyms":["pessimist","doomsayer","prophet of doom"],"antonyms":["optimist"]}],"etymology":{"value":"From Hebrew יִרְמְיָהוּ (yirm'yāhū), meaning \"God will exalt\" or \"God loosens (from the womb)\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒɛrəˈmaɪə/","syllables":"Je-re-mi-ah"},"inflection":{"notes":"Proper noun, typically not inflected. Plural form 'Jeremiahs' can refer to multiple people named Jeremiah or multiple instances of pessimistic complaints."},"usage_notes":{"explanation":"'Jeremiah' primarily refers to the biblical prophet and the book attributed to him. Figuratively, 'Jeremiah' can describe someone who is habitually pessimistic or expresses mournful complaints. The term 'Jeremiad' specifically refers to a long, mournful complaint or lamentation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I read the book of Jeremia.","correct":"✓ I read the Book of Jeremiah.","note":"The correct name of the biblical book is 'Jeremiah', not 'Jeremia'."},{"incorrect":"✗ He is a real jeremiah, always seeing the worst.","correct":"✓ He is a real Jeremiah, always seeing the worst.","note":"When used as a figurative noun to describe a pessimistic person, 'Jeremiah' is often capitalized."}],"priority":"★★☆"},"related_words":{"derivatives":["Jeremiad (noun: a long, mournful complaint or lamentation)"],"phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (for understanding references to the biblical figure or the figurative usage)","frequency_google_ngram":"Relatively low frequency, but recognizable due to biblical significance.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Jeremiah' is a proper noun referring to a significant figure in the Old Testament. Understanding its meaning requires familiarity with biblical contexts. Figuratively, it describes a pessimistic person or a mournful complaint, which is less common but important to recognize in literature or formal speech."},"example_sentences":[{"sentence":"The prophet **Jeremiah** warned the people of Judah about their impending doom.","translation":"預言者エレミヤは、ユダの人々に差し迫った破滅について警告しました。","type":"noun","meaning_category":"Biblical Prophet"},{"sentence":"The preacher delivered a long **Jeremiad** about the moral decay of society.","translation":"その牧師は、社会の道徳的崩壊について長々と悲嘆を述べた。","type":"noun","meaning_category":"Pessimistic Complaint"},{"sentence":"My grandfather, a devout Christian, named his eldest son **Jeremiah**.","translation":"敬虔なクリスチャンである私の祖父は、長男をエレミヤと名付けました。","type":"noun","meaning_category":"Given Name"}]}