{"word":"non-marketized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"市場化されていない、商品化されていない","english_definition":"Not subjected to market forces or commercialization; not treated as a commodity to be bought and sold.","examples":[{"sentence":"The preservation of cultural heritage should remain a non-marketized activity.","translation":"文化遺産の保護は、市場化されない活動として維持されるべきである。"},{"sentence":"Access to clean water should be a right, not a non-marketized service.","translation":"きれいな水へのアクセスは権利であるべきで、市場化されたサービスであるべきではない。"},{"sentence":"The organization aims to promote non-marketized solutions to environmental problems.","translation":"その組織は、環境問題に対する非市場化された解決策を推進することを目指している。"}],"collocations":["non-marketized sector","non-marketized goods","non-marketized services","non-marketized approach","non-marketized economy"],"synonyms":["uncommodified","decommodified","non-commercial","non-profit","public"],"antonyms":["marketized","commodified","commercialized","privatized"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'marketized,' which is the past participle of 'marketize' (to subject to market forces or commercialization).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈmɑːrkɪtaɪzd/","syllables":"non-mar-ke-tized"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Non-marketized' describes something that is deliberately kept outside the realm of market economics. This can be due to ethical, social, or cultural reasons. It often implies a conscious decision to provide something as a public good or service, rather than as a commodity to be bought and sold for profit. The term is frequently used in discussions about healthcare, education, cultural heritage, and other areas where there is concern that market forces may undermine important values or principles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-marketized is important for society.","correct":"✓ Non-marketized services are important for society.","note":"'Non-marketized' is an adjective and needs to be followed by a noun. Using it as a noun is grammatically incorrect."},{"incorrect":"✗ We need to marketize non-marketized goods.","correct":"✓ We need to find a way to distribute non-marketized goods.","note":"The phrase 'marketize non-marketized goods' is contradictory. If something is non-marketized, it is, by definition, not subjected to market forces."}],"priority":"★★☆"},"related_words":{"derivatives":["marketize (verb)","marketization (noun)","de-marketize (verb)","de-marketization (noun)"],"antonyms":["market-based","for-profit","commercial"],"related_concepts":["public goods","public services","social welfare","decommodification","market failure"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, primarily used in academic and policy discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'non-marketized' is a technical term used in economics, sociology, and political science. It describes goods, services, or activities that are not subject to market forces, meaning they are not bought and sold for profit. Understanding this term requires familiarity with concepts like public goods, commodification, and market failure. It is most often encountered in academic or policy-related contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Healthcare should be a right, not a non-marketized commodity.","translation":"医療は権利であるべきで、市場化された商品であるべきではない。","type":"adjective","meaning_category":"Not subjected to market forces"},{"sentence":"The government provides non-marketized housing for low-income families.","translation":"政府は低所得者層のために、市場化されていない住宅を提供している。","type":"adjective","meaning_category":"Not treated as a commodity"},{"sentence":"The organization advocates for non-marketized solutions to climate change.","translation":"その組織は、気候変動に対する非市場化された解決策を提唱している。","type":"adjective","meaning_category":"Not subjected to market forces"}]}