{"word":"Analgene","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(薬学) アナルゲン：解熱鎮痛剤の一種。ピラゾロン系薬剤。","english_definition":"(Pharmacology) Analgin: A type of non-opioid analgesic and antipyretic medication, a pyrazolone derivative.","examples":[{"sentence":"Analgene is used to relieve pain and reduce fever.","translation":"アナルゲンは、痛みを和らげ、熱を下げるために使用されます。"},{"sentence":"The doctor prescribed Analgene for my headache.","translation":"医者は私の頭痛にアナルゲンを処方しました。"}],"collocations":["take Analgene (アナルゲンを服用する)","Analgene tablet (アナルゲン錠)","Analgene injection (アナルゲン注射)"],"synonyms":["dipyrone","metamizole","novalgin"],"antonyms":[]}],"etymology":{"value":"'Analgene' is a proprietary or brand name, likely derived from chemical components or intended therapeutic effects. The exact etymology may not be publicly available.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈænælˌdʒiːn/","syllables":"An-al-gene"},"inflection":{"notes":"単数形: Analgene"},"usage_notes":{"explanation":"'Analgene' is a specific brand or generic name for a pharmaceutical drug, primarily used as an analgesic (pain reliever) and antipyretic (fever reducer). It is a pyrazolone derivative. Its use varies by country due to concerns about potential side effects, such as agranulocytosis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I took analgene for my cold.","correct":"✓ I took Analgene for my cold.","note":"'Analgene' is a proper noun (brand name), so it should be capitalized. Also, it's important to consult a doctor before taking any medication."}],"priority":"★☆☆"},"related_words":{"derivatives":["analgin (alternative spelling)","metamizole (INN - International Nonproprietary Name)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Technical/Medical Vocabulary)","frequency_google_ngram":"Low frequency (医薬分野でのみ使用)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Analgene' is a technical term in pharmacology, specifically referring to a medication used to relieve pain and reduce fever. It is a pyrazolone derivative. Understanding its use requires knowledge of medical terminology and pharmacology. It is not a common word in everyday conversation.","note":"This word is specific to medical contexts and requires specialized knowledge."},"example_sentences":[{"sentence":"The patient was given an Analgene injection to alleviate the post-operative pain.","translation":"患者は術後の痛みを和らげるためにアナルゲン注射を投与された。","type":"noun","meaning_category":"解熱鎮痛剤"},{"sentence":"Analgene is contraindicated in patients with a history of agranulocytosis.","translation":"アナルゲンは、無顆粒球症の病歴のある患者には禁忌である。","type":"noun","meaning_category":"解熱鎮痛剤"}]}