{"word":"disaffiliation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"離脱、所属解除、提携解消","english_definition":"The act of disaffiliating; the state of being disaffiliated. Severing ties with or ceasing to be associated with an organization or group.","examples":[{"sentence":"The union's disaffiliation from the national federation was a major blow.","translation":"その労働組合の全国連盟からの離脱は大きな打撃だった。"},{"sentence":"The church voted for disaffiliation after a long period of internal conflict.","translation":"教会は長期間にわたる内部紛争の後、提携解消を投票で決定した。"},{"sentence":"Disaffiliation can be a complex process with significant legal and financial implications.","translation":"離脱は複雑なプロセスであり、重大な法的および財政的影響を伴う可能性がある。"}],"collocations":["union disaffiliation (労働組合の離脱)","church disaffiliation (教会の離脱)","political disaffiliation (政治的離脱)","complete disaffiliation (完全な離脱)","formal disaffiliation (正式な離脱)"],"synonyms":["separation","secession","withdrawal","detachment","severance"],"antonyms":["affiliation","association","connection","membership","alliance"]}],"etymology":{"value":"Formed from 'dis-' (expressing negation or reversal) and 'affiliation'. Essentially, it means the opposite of affiliation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪsəˌfɪliˈeɪʃən/","syllables":"dis-af-fil-i-a-tion"},"inflection":{"noun_plural":"disaffiliations"},"usage_notes":{"explanation":"'Disaffiliation' refers to the formal process or act of ending a connection or membership with an organization. It often implies a deliberate decision to separate due to disagreement, policy changes, or other significant factors. The term is frequently used in contexts involving political groups, religious organizations, and labor unions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He disaffiliated to the party.","correct":"✓ He disaffiliated from the party.","note":"The correct preposition to use with 'disaffiliate' is 'from'. It indicates separation from something."},{"incorrect":"✗ The disaffiliation was very affect to the group.","correct":"✓ The disaffiliation had a significant effect on the group.","note":"'Affect' is a verb meaning to influence, while 'effect' is a noun meaning a result or consequence. The sentence requires the noun form."}],"priority":"★★☆"},"related_words":{"derivatives":["disaffiliate (verb): to formally end a connection with an organization.","disaffiliated (adjective): having ended a connection with an organization."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Relatively uncommon word, mostly used in formal or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Disaffiliation' is a formal term that describes the process of formally ending a connection or membership with an organization. It is often used in the context of political, religious, or labor organizations when a group or individual decides to separate due to disagreements or changing circumstances. Understanding this word requires a good grasp of formal vocabulary and the ability to understand complex organizational relationships."},"example_sentences":[{"sentence":"The local chapter's **disaffiliation** from the national organization caused considerable controversy.","translation":"地方支部が全国組織から離脱したことは、かなりの論争を引き起こした。","type":"noun","meaning_category":"離脱"},{"sentence":"The reasons for the **disaffiliation** were outlined in a detailed statement.","translation":"離脱の理由は詳細な声明で概説された。","type":"noun","meaning_category":"離脱"},{"sentence":"The university's **disaffiliation** with the research program raised concerns about funding.","translation":"大学がその研究プログラムとの提携を解消したことは、資金調達に関する懸念を引き起こした。","type":"noun","meaning_category":"提携解消"}]}