{"word":"glycyrize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"甘草で風味をつける、甘草抽出物を加える","english_definition":"To flavor with licorice; to add licorice extract to.","examples":[{"sentence":"The candy was glycyrized to give it a unique flavor.","translation":"そのキャンディは独特の風味を出すために甘草で風味付けされた。"},{"sentence":"They glycyrize the tobacco to enhance its sweetness.","translation":"彼らはタバコの甘さを引き立てるために甘草抽出物を加える。"}],"collocations":["glycyrize candy","glycyrize tobacco","glycyrize food"],"synonyms":["flavor with licorice","add licorice extract","licorice-flavor"],"antonyms":[]}],"etymology":{"value":"Derived from 'glycyrrhiza,' the botanical name for licorice, combined with the suffix '-ize,' indicating the act of treating or flavoring with the substance.","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡlɪsəˌraɪz","syllables":"gly-cy-rize"},"inflection":{"verb_forms":{"present_simple":["glycyrize","glycyrizes"],"past_simple":"glycyrized","past_participle":"glycyrized","present_participle":"glycyrizing"}},"usage_notes":{"explanation":"'Glycyrize' specifically refers to the process of adding licorice or licorice extract to something, typically food or tobacco, to impart its characteristic flavor. It is a relatively uncommon word, primarily used in culinary or industrial contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The chef glycyrized the dish with sugar.","correct":"✓ The chef glycyrized the dish with licorice.","note":"'Glycyrize' specifically refers to the use of licorice, not sugar or other sweeteners."}],"priority":"★☆☆"},"related_words":{"derivatives":["glycyrrhiza (甘草)","glycyrrhizic acid (グリチルリチン酸)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical vocabulary)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Glycyrize' is a specialized term that means to add licorice flavor to something. It is not a common word and is primarily used in contexts related to food production or flavoring. Understanding the term requires familiarity with the ingredient licorice and the process of flavoring or treating substances. Due to its specific and technical nature, it is not typically encountered in general English usage."},"example_sentences":[{"sentence":"The manufacturer decided to glycyrize the cough drops to soothe sore throats.","translation":"製造業者は、のどの痛みを和らげるために咳止めドロップに甘草で風味を付けることを決定した。","type":"verb","meaning_category":"甘草で風味をつける"},{"sentence":"Many traditional candies are glycyrized for their distinctive taste.","translation":"多くの伝統的なキャンディは、その独特の味のために甘草で風味付けされている。","type":"verb","meaning_category":"甘草抽出物を加える"}]}