{"word":"conscionably","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"良心的に、道理にかなって、正当に","english_definition":"in a manner that is consistent with one's conscience; reasonably or justly.","examples":[{"sentence":"He could not conscionably accept the award, knowing that others deserved it more.","translation":"彼は、他の人の方がもっとふさわしいと知っていたので、良心的にその賞を受け取ることができなかった。"},{"sentence":"She conscionably refused to participate in the unethical experiment.","translation":"彼女は良心的に、その非倫理的な実験への参加を拒否した。"},{"sentence":"The company acted conscionably in addressing the environmental concerns.","translation":"その会社は、環境問題に対処するにあたり、良心的に行動した。"}],"collocations":["act conscionably","behave conscionably","conscionably object","conscionably refuse","conscionably accept"],"synonyms":["ethically","morally","righteously","justly","honestly","scrupulously"],"antonyms":["unconscionably","unethically","immorally","unjustly","dishonestly"]}],"etymology":{"value":"Derived from 'conscionable,' which comes from 'conscience' (Latin 'conscientia', meaning 'knowledge within' or 'moral sense') + '-able' (capable of). The adverbial form is created by adding '-ly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒnʃənəbli/","syllables":"con-scion-a-bly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Conscionably' describes actions or decisions made in accordance with one's moral principles or conscience. It implies a sense of ethical responsibility and doing what is right, even when it may be difficult or unpopular. It is often used to emphasize that someone acted with integrity and a strong sense of moral obligation. The opposite, 'unconscionably,' means acting without regard for conscience or what is right.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He conscionably felt bad about lying.","correct":"✓ He felt conscionably bad about lying. / ✓ He felt bad because of his conscience.","note":"The adverb 'conscionably' modifies the verb 'felt' in terms of how the feeling was experienced (i.e., in accordance with conscience). However, it is more common to say that the person felt bad *because* of their conscience, or rephrase the sentence. 'Conscionably' typically modifies actions or decisions, not feelings directly."},{"incorrect":"✗ The conscionably person did the right thing.","correct":"✓ The conscientious person did the right thing.","note":"'Conscionably' is an adverb, so it modifies a verb. 'Conscientious' is the adjective that describes a person who is guided by their conscience."}],"priority":"★★☆"},"related_words":{"derivatives":["conscience (noun): the inner sense of what is right or wrong in one's conduct or motives.","conscientious (adjective): wishing to do one's work or duty well and thoroughly.","unconscionable (adjective): not right or reasonable.","unconscionably (adverb): in an unconscionable manner."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Conscionably' is an advanced word that means acting in a way that agrees with your conscience or moral principles. It's about doing what you believe is right, even if it's difficult. You might see it used to describe someone who refuses to participate in something unethical or who makes a decision based on their strong sense of right and wrong. It's not a common word, but it's useful for expressing a high level of moral integrity."},"example_sentences":[{"sentence":"The lawyer could not **conscionably** defend a client he knew to be guilty.","translation":"その弁護士は、有罪だと知っている依頼人を良心的に弁護することができなかった。","type":"adverb","meaning_category":"良心的に"},{"sentence":"She **conscionably** objected to the proposed changes, citing ethical concerns.","translation":"彼女は、倫理的な懸念を理由に、提案された変更に良心的に異議を唱えた。","type":"adverb","meaning_category":"道理にかなって"},{"sentence":"The company acted **conscionably** by recalling the defective product.","translation":"その会社は、欠陥のある製品をリコールすることで、良心的に行動した。","type":"adverb","meaning_category":"正当に"}]}