{"word":"presuspicion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A suspicion formed beforehand; a preconceived or preliminary suspicion.","english_definition":"A suspicion formed beforehand; a preconceived or preliminary suspicion.","examples":[{"sentence":"The investigation was tainted by presuspicion, leading to a biased outcome.","translation":"その調査は予断によって汚染され、偏った結果につながった。"},{"sentence":"The judge warned against acting on presuspicion rather than concrete evidence.","translation":"裁判官は、具体的な証拠ではなく、予断に基づいて行動することに警告した。"}],"collocations":["tainted by presuspicion","act on presuspicion","warn against presuspicion"],"synonyms":["preconceived suspicion","prejudgment","preconception"],"antonyms":["afterthought","hindsight","evidence-based judgment"]}],"etymology":{"value":"Formed from the prefix 'pre-' (before) and 'suspicion'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːsəˈspɪʃən/","syllables":"pre-su-spi-cion"},"inflection":{"noun_plural":"presuspicions"},"usage_notes":{"explanation":"'Presuspicion' is a relatively rare word, often used in legal or academic contexts to describe a bias or preconceived notion that influences judgment or investigation. It implies a lack of objectivity due to a prior suspicion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The detective had a presuspicion about the case before any evidence was collected. This is a good thing.","correct":"✓ The detective had a presuspicion about the case before any evidence was collected. This is problematic, as it could lead to biased investigation.","note":"Having a presuspicion is generally considered negative because it can lead to biased investigations or judgments."}],"priority":"★★☆"},"related_words":{"derivatives":["presuspect (verb: to suspect beforehand)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Presuspicion' is a rare and sophisticated term. It is best understood by those with advanced English vocabulary and a familiarity with legal or academic discourse. The concept itself is relatively straightforward (a suspicion held in advance), but the word's infrequent usage makes it more challenging for non-native speakers."},"example_sentences":[{"sentence":"The media's presuspicion of the politician influenced public opinion before the trial even began.","translation":"メディアの政治家に対する予断は、裁判が始まる前から世論に影響を与えた。","type":"example","meaning_category":"preconceived notion"},{"sentence":"The audit was criticized for being based on presuspicion rather than a thorough examination of the financial records.","translation":"監査は、財務記録の徹底的な調査ではなく、予断に基づいているとして批判された。","type":"example","meaning_category":"biased judgment"}]}