{"word":"stage-bleed","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(オーディオ)ステージ・ブリード、チャンネル・ブリード、音漏れ","english_definition":"(audio engineering) The unwanted leakage of sound from one microphone or instrument channel into another during a recording or live performance.","examples":[{"sentence":"The drum kit's sound was heavily affected by stage-bleed from the guitar amps.","translation":"ドラムキットの音は、ギターアンプからのステージ・ブリードによって大きく影響を受けた。"},{"sentence":"Careful microphone placement can minimize stage-bleed.","translation":"慎重なマイクの配置は、ステージ・ブリードを最小限に抑えることができる。"},{"sentence":"Excessive stage-bleed can muddy the mix.","translation":"過剰なステージ・ブリードはミックスを濁らせる可能性がある。"}],"collocations":["minimize stage-bleed (ステージ・ブリードを最小限に抑える)","reduce stage-bleed (ステージ・ブリードを減らす)","control stage-bleed (ステージ・ブリードを制御する)","manage stage-bleed (ステージ・ブリードを管理する)","eliminate stage-bleed (ステージ・ブリードを排除する)","excessive stage-bleed (過剰なステージ・ブリード)"],"synonyms":["crosstalk","leakage","spill"],"antonyms":["isolation","separation"]}],"etymology":{"value":"'Stage' referring to the performance stage, and 'bleed' referring to the unwanted sound leaking or 'bleeding' into other channels.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsteɪdʒˌbliːd/","syllables":"stage-bleed"},"inflection":{"noun_plural":"stage-bleeds"},"usage_notes":{"explanation":"'Stage-bleed' is a common issue in live sound and recording environments. It refers to the unwanted sound of one instrument or sound source being picked up by a microphone intended for another. This can cause problems with clarity, mixing, and overall sound quality. Techniques to minimize stage-bleed include careful microphone placement, using directional microphones, and employing sound barriers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The stage bleed was very loud.","correct":"✓ The stage-bleed was very loud.","note":"'Stage-bleed' is typically written as a hyphenated compound noun."},{"incorrect":"✗ We need to bleed the stage less.","correct":"✓ We need to reduce stage-bleed.","note":"'Bleed' is used as a verb in the context of sound leakage, but 'stage-bleed' itself is a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["bleed (verb: to leak sound)"],"phrasal_verbs":[],"related_concepts":["microphone technique","sound isolation","acoustic treatment","mixing","audio engineering"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stage-bleed' is a technical term used in audio engineering and live sound production. It describes the phenomenon where sound from one source (e.g., a guitar amplifier) is picked up by a microphone intended for another source (e.g., a vocal microphone). This can lead to a less clean and defined sound in recordings or live performances. Understanding and managing stage-bleed is important for audio professionals.","priority":"★★☆"},"example_sentences":[{"sentence":"The engineer worked to reduce stage-bleed from the drums into the vocal mics.","translation":"エンジニアは、ドラムからボーカルマイクへのステージ・ブリードを減らすように努めた。","type":"noun","meaning_category":"音漏れ"},{"sentence":"Proper microphone placement is crucial for minimizing stage-bleed in live recordings.","translation":"適切なマイク配置は、ライブ録音でのステージ・ブリードを最小限に抑えるために重要である。","type":"noun","meaning_category":"音漏れ"},{"sentence":"The use of isolation shields helped to decrease stage-bleed during the session.","translation":"アイソレーションシールドの使用は、セッション中のステージ・ブリードを減らすのに役立った。","type":"noun","meaning_category":"音漏れ"}]}