{"word":"pseudozealot","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who pretends to be zealous or enthusiastic, but is not genuinely so.","english_definition":"Someone who outwardly displays excessive enthusiasm or commitment to a cause or belief, but whose actions or motivations suggest insincerity or a lack of genuine conviction.","examples":[{"sentence":"He presented himself as a passionate advocate for the policy, but his colleagues saw him as a pseudozealot seeking personal gain.","translation":"彼はその政策の熱心な擁護者として振る舞ったが、同僚たちは彼を個人的な利益を求める偽善者だと見ていた。"},{"sentence":"The internet is full of pseudozealots who loudly proclaim their beliefs but rarely take meaningful action.","translation":"インターネットには、自分の信念を大声で主張するものの、意味のある行動をほとんど起こさない偽善者があふれている。"},{"sentence":"Don't be fooled by his fiery rhetoric; he's just a pseudozealot trying to impress the boss.","translation":"彼の熱烈なレトリックに騙されてはいけない。彼はただ上司に印象を与えようとしている偽善者だ。"}],"collocations":["political pseudozealot","religious pseudozealot","internet pseudozealot","corporate pseudozealot"],"synonyms":["hypocrite","poser","pretender","charlatan","fake","impostor"],"antonyms":["zealot","true believer","sincere advocate","genuine enthusiast"]}],"etymology":{"value":"Formed by combining 'pseudo-' (meaning false or pretended) with 'zealot' (a person who is fanatical and uncompromising in pursuit of their religious, political, or other ideals).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈzɛlət/","syllables":"pseu-do-zeal-ot"},"inflection":{"noun_plural":"pseudozealots"},"usage_notes":{"explanation":"The term 'pseudozealot' is used to describe someone whose outward display of enthusiasm or commitment is not genuine. It implies a level of insincerity or ulterior motives, suggesting that the person is acting for personal gain, social approval, or other reasons that are not aligned with the cause they claim to support. The word carries a negative connotation, implying deception or a lack of integrity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is a zealot, not a pseudozealot; he truly believes in his cause.","correct":"He is a zealot, not a pseudozealot; he truly believes in his cause.","note":"A zealot is genuinely enthusiastic, while a pseudozealot is not."},{"incorrect":"Pseudozealots are always effective leaders because they know how to motivate people.","correct":"Pseudozealots are not always effective leaders because their insincerity can be detected.","note":"Pseudozealotry often undermines leadership effectiveness."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudozealous (adjective)","pseudozealotry (noun)"],"phrases":["false zeal","insincere enthusiasm","pretended commitment"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pseudozealot' is a relatively uncommon term used to describe someone who pretends to be enthusiastic or committed to a cause but is not genuinely so. It is formed by combining 'pseudo-' (false) with 'zealot' (a fanatic). Understanding this word requires a good grasp of vocabulary and the ability to recognize subtle nuances of meaning. It is typically used in formal writing or discussions where there is a need to express skepticism or cynicism about someone's motives.","example_sentences":[]}}