{"word":"interlineations","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"行間書き、行間挿入","english_definition":"The action of interlining; the insertion of something between lines of a text; something interlined.","examples":[{"sentence":"The manuscript was full of interlineations in a different handwriting.","translation":"その原稿は、別の筆跡による行間書きでいっぱいだった。"},{"sentence":"The editor made several interlineations to clarify the meaning of the passage.","translation":"編集者は、文章の意味を明確にするためにいくつかの行間挿入を行った。"}],"collocations":["manuscript with interlineations","text with interlineations","editorial interlineations"],"synonyms":["annotations","insertions","additions","glosses","marginalia"],"antonyms":["deletions","erasures"]}],"etymology":{"value":"From interlineate + -ion. Interlineate is from inter- + lineate.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərˌlɪniˈeɪʃənz/","syllables":"in-ter-li-ne-a-tions"},"inflection":{"noun_plural":"interlineations"},"usage_notes":{"explanation":"'Interlineations' refers specifically to text or notes inserted *between* the lines of an existing text. It is often used in the context of manuscripts, legal documents, or scholarly works where clarification, corrections, or additions are made directly onto the original document. It implies a physical insertion of text rather than a separate annotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The interlineations were written on a separate sheet of paper.","correct":"✓ The interlineations were written between the lines of the text.","note":"Interlineations, by definition, are *within* the lines, not on a separate sheet."}],"priority":"★★★"},"related_words":{"derivatives":["interlineate (verb)","interlinear (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Interlineations' is a relatively uncommon word referring to text added *between* the lines of an existing document. It's often found in academic or legal contexts. Understanding the word requires a good vocabulary and familiarity with document analysis."},"example_sentences":[{"sentence":"Careful examination of the manuscript revealed numerous interlineations made by the author.","translation":"その写本を注意深く調べたところ、著者によって書かれた多数の行間書きが明らかになった。","type":"example","meaning_category":"general"},{"sentence":"The contract contained several suspicious interlineations that needed to be clarified.","translation":"その契約書には、明確にする必要のあるいくつかの疑わしい行間挿入が含まれていた。","type":"example","meaning_category":"legal"},{"sentence":"Scholars studied the interlineations to understand the evolution of the text.","translation":"学者たちは、テキストの進化を理解するために行間書きを研究した。","type":"example","meaning_category":"academic"}]}