{"word":"discontinuously","priority":"★★★","meanings":[{"part_of_speech":"adverb","definition":"不連続に、途切れ途切れに、断続的に","english_definition":"in a way that is not continuous; with interruptions or breaks.","examples":[{"sentence":"The signal was transmitted discontinuously due to interference.","translation":"妨害のために、信号は不連続に送信された。"},{"sentence":"The data was collected discontinuously over several years.","translation":"データは数年にわたって断続的に収集された。"},{"sentence":"The machine operated discontinuously, stopping every few minutes.","translation":"機械は不連続に作動し、数分ごとに停止した。"}],"collocations":["operate discontinuously","collect data discontinuously","transmit discontinuously","vary discontinuously","change discontinuously"],"synonyms":["intermittently","sporadically","irregularly","periodically","brokenly","fragmentarily"],"antonyms":["continuously","uninterruptedly","seamlessly","smoothly"]}],"etymology":{"value":"The word \"discontinuously\" is formed by adding the suffix \"-ly\" to the adjective \"discontinuous.\" \"Discontinuous\" comes from the prefix \"dis-\" (meaning \"not\") and \"continuous,\" which is derived from the Latin word \"continuus,\" meaning \"joined together, uninterrupted.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪskənˈtɪnjuəsli/","syllables":"dis-con-tin-u-ous-ly"},"inflection":{"notes":"As an adverb, \"discontinuously\" does not have different inflections."},"usage_notes":{"explanation":"\"Discontinuously\" describes actions or processes that do not occur without interruption. It implies a series of starts and stops, or gaps in time or space. It is often used in technical or scientific contexts to describe data collection, signal transmission, or machine operation. The opposite of \"discontinuously\" is \"continuously,\" which means without interruption.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The water flowed discontinuously from the tap. (when it's a constant drip)","correct":"✓ The water dripped discontinuously from the tap.","note":"Use 'dripped discontinuously' when the water is dripping with pauses, not flowing steadily."},{"incorrect":"✗ He worked discontinuously on the project every day. (when he worked on it a bit each day)","correct":"✓ He worked intermittently on the project.","note":"'Intermittently' or 'sporadically' might be better if he worked on it a little each day, but not constantly. 'Discontinuously' implies longer breaks or more significant interruptions."}],"priority":"★★☆"},"related_words":{"derivatives":["discontinuous (adjective)","discontinuity (noun)"],"phrases":["discontinuous function","discontinuous process","discontinuous data"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"discontinuously\" means \"not in a continuous way; with breaks or interruptions.\" It's used to describe something that doesn't happen steadily or smoothly. For example, if a machine operates \"discontinuously,\" it means it stops and starts, rather than running all the time. This word is more common in technical or academic writing."},"example_sentences":[{"sentence":"The light flickered discontinuously, making it difficult to see.","translation":"光が不連続にちらつき、見えにくかった。","type":"general","meaning_category":"intermittent flickering"},{"sentence":"The archaeological dig revealed layers of occupation that occurred discontinuously over centuries.","translation":"考古学的発掘調査により、数世紀にわたって不連続に発生した居住層が明らかになった。","type":"academic","meaning_category":"intermittent occupation"},{"sentence":"The artist created the mural by applying paint discontinuously, resulting in a textured effect.","translation":"アーティストは、絵の具を不連続に塗ることで壁画を作成し、テクスチャ効果を生み出した。","type":"artistic","meaning_category":"intermittent application"}]}