{"word":"esterase","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"エステラーゼ（エステルを加水分解する酵素の総称）","english_definition":"Any enzyme that catalyzes the hydrolysis of esters into an acid and an alcohol.","examples":[{"sentence":"Acetylcholinesterase is a type of esterase that breaks down acetylcholine.","translation":"アセチルコリンエステラーゼは、アセチルコリンを分解するエステラーゼの一種です。"},{"sentence":"Esterases play a crucial role in the metabolism of many drugs.","translation":"エステラーゼは、多くの薬物の代謝において重要な役割を果たします。"},{"sentence":"The activity of esterases can be measured to assess liver function.","translation":"エステラーゼの活性は、肝機能を評価するために測定できます。"}],"collocations":["acetylcholinesterase","cholinesterase","carboxylesterase","esterase activity","serum esterase"],"synonyms":["lipase","phosphatase","protease","hydrolase"],"antonyms":[]}],"etymology":{"value":"'Ester' + '-ase' (suffix used to denote an enzyme).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɛstəreɪz/","syllables":"es-ter-ase"},"inflection":{"noun_plural":"esterases"},"usage_notes":{"explanation":"Esterases are a broad class of enzymes that catalyze the hydrolysis of ester bonds. They are involved in a wide range of biological processes, including digestion, detoxification, and signal transduction. Different types of esterases exhibit specificity for different ester substrates.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Esterase is a type of bacteria.","correct":"✓ Esterase is a type of enzyme.","note":"Esterase is an enzyme, not a bacterium."},{"incorrect":"✗ Esterase breaks down proteins.","correct":"✓ Esterase breaks down esters.","note":"Esterases break down esters, while proteases break down proteins."}],"priority":"★★☆"},"related_words":{"derivatives":["esterification","hydrolysis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Esterase' is a technical term used in biochemistry and medicine to refer to a class of enzymes that break down esters. Understanding its function requires some background knowledge in these fields. The term is more commonly encountered in scientific literature or medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The level of serum esterase can indicate certain liver diseases.","translation":"血清エステラーゼのレベルは、特定の肝疾患を示す可能性があります。","type":"general","meaning_category":"medical"},{"sentence":"Some insecticides work by inhibiting the activity of esterases in insects.","translation":"一部の殺虫剤は、昆虫のエステラーゼの活性を阻害することによって作用します。","type":"general","meaning_category":"biochemistry"},{"sentence":"Esterase enzymes are crucial for the breakdown of fats in the digestive system.","translation":"エステラーゼ酵素は、消化器系における脂肪の分解に不可欠です。","type":"general","meaning_category":"biology"}]}