{"word":"decanonization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"正典からの除外、聖人列福の取り消し、権威または正当性の剥奪","english_definition":"The act of removing someone or something from a canon or list of recognized or authoritative figures or works; the reversal of canonization (in a religious context); the stripping of authority or legitimacy.","examples":[{"sentence":"The decanonization of certain historical figures is a complex process involving re-evaluation of their actions and beliefs.","translation":"特定の歴史上の人物の正典からの除外は、彼らの行動と信念の再評価を含む複雑なプロセスです。"},{"sentence":"The church undertook the decanonization of a saint after new evidence emerged.","translation":"教会は新たな証拠が出てきた後、ある聖人の聖人列福の取り消しに着手しました。"},{"sentence":"Some scholars advocate for the decanonization of certain literary works that no longer resonate with contemporary values.","translation":"一部の学者は、現代の価値観に共鳴しなくなった特定の文学作品の権威の剥奪を提唱しています。"}],"collocations":["decanonization of a saint","decanonization of a literary work","decanonization of a historical figure"],"synonyms":["delisting","derecognition","removal from canon","disestablishment","discrediting"],"antonyms":["canonization","recognition","establishment","validation"]}],"etymology":{"value":"Formed by adding the prefix 'de-' (meaning 'removal' or 'reversal') to 'canonization'. Canonization itself comes from 'canon,' referring to a list or standard, especially in religious contexts.","priority":"★★☆"},"pronunciation":{"ipa":"/diːˌkænənɪˈzeɪʃən/","syllables":"de-can-on-i-za-tion"},"inflection":{"noun_plural":"decanonizations"},"usage_notes":{"explanation":"'Decanonization' is used in various contexts, including religious, literary, and historical discussions. In a religious context, it refers to the rare and controversial process of reversing the canonization of a saint. More broadly, it can refer to the removal of something from a position of authority or recognition. The term implies a deliberate act of re-evaluation and rejection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The decanonization was happened suddenly.","correct":"✓ The decanonization happened suddenly.","note":"'Decanonization' is a noun, so it does not take the auxiliary verb 'was' in this context. Use the past tense of 'happen' directly."},{"incorrect":"✗ They decanonized the saint.","correct":"✓ They undertook the decanonization of the saint.","note":"While grammatically correct, 'decanonize' as a verb is less common. It is more typical to say 'They undertook the decanonization of...' or 'They reversed the canonization of...'."}],"priority":"★★☆"},"related_words":{"derivatives":["decanonize (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Decanonization' is a specialized term primarily used in academic or religious contexts. It refers to the process of removing something from a position of authority or recognition, often after a period of acceptance. Understanding this term requires familiarity with the concept of 'canon' and the processes of establishing and challenging authority. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The university's decision led to the decanonization of the professor's work from the curriculum.","translation":"大学の決定により、その教授の作品はカリキュラムから除外されることになった。","type":"noun","meaning_category":"権威または正当性の剥奪"},{"sentence":"The Vatican faced controversy after considering the decanonization of a controversial figure.","translation":"バチカンは物議を醸す人物の聖人列福の取り消しを検討した後、論争に直面した。","type":"noun","meaning_category":"聖人列福の取り消し"},{"sentence":"The museum's re-evaluation of its collection led to the decanonization of several previously celebrated artists.","translation":"博物館のコレクションの再評価により、以前は称賛されていた数人のアーティストが正典から除外されることになった。","type":"noun","meaning_category":"正典からの除外"}]}