{"word":"pseudoclassicism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"擬似古典主義、偽古典主義：古典主義を模倣するが、その精神や原則を理解せずに表面的な特徴だけを真似た芸術や文学の傾向。","english_definition":"An artistic or literary movement that superficially imitates classicism without understanding its true spirit or principles.","examples":[{"sentence":"The architecture of the building is an example of pseudoclassicism, with its purely decorative columns.","translation":"その建物の建築は、純粋に装飾的な柱を備えた、擬似古典主義の一例です。"},{"sentence":"Many critics dismissed the play as pseudoclassicism because it lacked the depth and moral seriousness of true classical drama.","translation":"多くの批評家は、その劇が真の古典劇の深みと道徳的な真剣さに欠けているため、偽古典主義だと一蹴しました。"}],"collocations":["architectural pseudoclassicism","literary pseudoclassicism","artistic pseudoclassicism"],"synonyms":["neoclassical imitation","false classicism","sham classicism"],"antonyms":["classicism","neoclassicism"]}],"etymology":{"value":"\"pseudo-\"（偽の、似非の）+ \"classicism\"（古典主義）から構成される。古典主義を装っているが、本質を理解していないことを示す。","priority":"★★★"},"pronunciation":{"ipa":"/ˌsuːdoʊˈklæsɪsɪzəm/","syllables":"pseu-do-clas-si-cism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Pseudoclassicism\" は、古典主義の形式や様式を模倣するものの、その根本的な価値観や精神を欠いている芸術や文学を指す際に用いられる。しばしば、表面的な装飾や形式主義に偏り、深みや革新性に欠けると批判される。Neoclassicism（新古典主義）とは異なり、古典古代の原則を深く理解し、それを現代的な文脈で再解釈しようとするものではない。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movement was a true representation of classicism, not pseudoclassicism.","correct":"✓ The movement was a true representation of classicism, not pseudoclassicism.","note":"この文は正しいです。pseudoclassicismとclassicismの違いを明確にしています。"},{"incorrect":"✗ Pseudoclassicism is better than classicism because it is more modern.","correct":"✓ Pseudoclassicism is not necessarily better than classicism; it is merely a superficial imitation.","note":"Pseudoclassicismは、必ずしもclassicismより優れているわけではありません。単に表面的な模倣である場合があります。"}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudoclassical (adjective)"],"phrasal_verbs":null,"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Pseudoclassicism\" is a term used to describe art or literature that imitates classical styles superficially, without truly understanding or embodying the core principles of classicism. It is often seen as lacking depth and originality, focusing instead on surface-level imitation. Understanding this term requires a good grasp of both classicism and the nuances of artistic criticism."},"example_sentences":[{"sentence":"The play was criticized for its pseudoclassicism, lacking the moral depth of true classical tragedy.","translation":"その劇は、真の古典悲劇の道徳的な深みに欠ける擬似古典主義であると批判された。","type":"general","meaning_category":"擬似古典主義の例"},{"sentence":"The building's pseudoclassical facade was merely a decorative veneer, with no structural basis in classical architecture.","translation":"その建物の擬似古典主義的なファサードは、単なる装飾的な化粧であり、古典建築における構造的な基礎はなかった。","type":"general","meaning_category":"擬似古典主義の例"}]}