{"word":"faradaic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ファラデーの法則に関する、またはファラデーの法則に従う","english_definition":"Relating to or following Faraday's laws of electrolysis or electromagnetic induction.","examples":[{"sentence":"The faradaic current is directly proportional to the rate of the electrochemical reaction.","translation":"ファラデー電流は、電気化学反応の速度に正比例する。"},{"sentence":"Faradaic processes involve the transfer of charge across an interface.","translation":"ファラデー過程は、界面を横切る電荷の移動を伴う。"}],"collocations":["faradaic current","faradaic process","faradaic efficiency","faradaic impedance"],"synonyms":["electrolytic","electrochemical"],"antonyms":["non-faradaic"]}],"etymology":{"value":"Named after Michael Faraday, the British scientist who discovered electromagnetic induction and formulated the laws of electrolysis. The term 'faradaic' is formed by adding the suffix '-ic' to 'Faraday' to indicate 'relating to' or 'characteristic of' Faraday's work.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfærəˈdeɪɪk/","syllables":"far-a-da-ic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Faradaic' is a technical term primarily used in electrochemistry and related fields. It describes phenomena, processes, or quantities that are governed by Faraday's laws. These laws relate the amount of chemical change produced during electrolysis to the quantity of electricity passed through the electrolyte. It's important to distinguish faradaic processes, which involve charge transfer, from non-faradaic processes, which do not.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reaction was faradayic.","correct":"✓ The reaction was faradaic.","note":"'Faradaic' is the correct adjective form. 'Faradayic' is not a standard term."}],"priority":"★★★"},"related_words":{"derivatives":["Faraday (noun: unit of electrical charge)","Faraday's law (noun: law of electrolysis or electromagnetic induction)","non-faradaic (adjective: not related to Faraday's laws)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (highly specialized vocabulary)","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'faradaic' is highly specialized and primarily used within the context of electrochemistry and physics. Understanding the term requires familiarity with Faraday's laws of electrolysis and electromagnetic induction. It's crucial to distinguish between faradaic processes, which involve charge transfer, and non-faradaic processes, which do not. This term is unlikely to be encountered outside of scientific or technical literature related to these fields."},"example_sentences":[{"sentence":"The **faradaic** current is a key parameter in electrochemical analysis.","translation":"ファラデー電流は、電気化学分析における重要なパラメータである。","type":"adjective","meaning_category":"ファラデーの法則に関する"},{"sentence":"The **faradaic** efficiency of the cell was found to be close to 100%.","translation":"そのセルのファラデー効率は、100％に近いことがわかった。","type":"adjective","meaning_category":"ファラデーの法則に従う"}]}