{"word":"Kefti","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of meatball or minced meat dish, common in North African, Middle Eastern, and Balkan cuisines.","english_definition":"A dish consisting of spiced ground meat, often formed into patties or meatballs, and typically grilled or fried.","examples":[{"sentence":"We ordered kefti and couscous at the Moroccan restaurant.","translation":"モロッコ料理店でケフティとクスクスを注文しました。"},{"sentence":"My grandmother makes the best kefti with a secret blend of spices.","translation":"私の祖母は秘密のスパイスを混ぜて最高のケフティを作ります。"}],"collocations":["kefti kebab","kefti tagine","spiced kefti","grilled kefti","homemade kefti"],"synonyms":["kofta","kufteh","ćevapi"],"antonyms":[]}],"etymology":{"value":"The word 'kefti' is derived from the Arabic word 'kufta' (كفتة), which means 'pounded' or 'minced'. This term has spread through various languages and cultures in the Middle East, North Africa, and the Balkans.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkefti/","syllables":"Kef-ti"},"inflection":{"noun_plural":"keftis"},"usage_notes":{"explanation":"'Kefti' refers to a broad category of ground meat dishes. The exact preparation, spices, and cooking methods can vary significantly depending on the region and local traditions. It is often served with bread, rice, or couscous, and accompanied by various sauces or salads.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a kefta yesterday.","correct":"✓ I ate kefti yesterday.","note":"'Kefti' is often used as a mass noun, especially when referring to the dish in general. However, using 'a kefti' to refer to a single piece (e.g., a meatball) is also acceptable, particularly in informal contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"'Kefti' is a culinary term referring to a type of spiced ground meat dish common in Middle Eastern, North African, and Balkan cuisines. It's similar to meatballs or patties and can be grilled, fried, or cooked in a tagine. The specific ingredients and preparation methods vary regionally. While not a common word in everyday English, it's often encountered in discussions of international cuisine or when dining at restaurants specializing in these cuisines."},"example_sentences":[{"sentence":"The restaurant's kefti was seasoned with cumin and coriander.","translation":"そのレストランのケフティはクミンとコリアンダーで味付けされていた。","type":"noun","meaning_category":"Food"},{"sentence":"She learned to make kefti from her mother's traditional recipe.","translation":"彼女は母親の伝統的なレシピからケフティの作り方を学んだ。","type":"noun","meaning_category":"Food"}]}