{"word":"steradian","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ステラジアン (立体角の単位)","english_definition":"The SI unit of solid angle. One steradian is the solid angle subtended at the center of a sphere by an area on the surface equal to the square of the radius.","examples":[{"sentence":"The solid angle of a sphere is 4π steradians.","translation":"球の立体角は4πステラジアンです。"},{"sentence":"The light source emits 0.5 candelas per steradian.","translation":"その光源は1ステラジアンあたり0.5カンデラの光度を発する。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'stereo-' (referring to three-dimensionality) and 'radian'.","priority":"★★☆"},"pronunciation":{"ipa":"/stəˈreɪdiən/","syllables":"ste-ra-di-an"},"inflection":{"noun_plural":"steradians"},"usage_notes":{"explanation":"A steradian is a unit of solid angle, analogous to the radian which measures plane angles. It is defined as the solid angle subtended at the center of a sphere by an area on its surface equal to the square of the sphere's radius. The symbol for steradian is 'sr'. A complete sphere subtends a solid angle of 4π steradians.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★☆"},"related_words":{"derivatives":["radian","solid angle"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Steradian' is a unit used to measure solid angles, similar to how radians measure regular angles. Imagine a sphere; a steradian is the amount of 'angle' that a certain area on the sphere's surface covers, relative to the center. Specifically, if that area is equal to the square of the sphere's radius, then the solid angle it covers is one steradian. It's a term mainly used in physics and engineering, particularly in fields dealing with light and radiation.","priority":"★★☆"},"example_sentences":[{"sentence":"The LED emits light into a cone with a solid angle of 0.2 steradians.","translation":"そのLEDは0.2ステラジアンの立体角を持つ円錐の中に光を放出する。","type":"scientific","meaning_category":"measurement"},{"sentence":"The detector has a field of view of 1 steradian.","translation":"その検出器は1ステラジアンの視野を持つ。","type":"technical","meaning_category":"measurement"}]}