{"word":"segregatedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"分離して、隔離して、差別的に","english_definition":"in a segregated manner; separately; in a way that keeps different groups apart, especially because of race, religion, etc.","examples":[{"sentence":"The students were taught segregatedly based on their academic abilities.","translation":"生徒たちは学力別に分離して教えられた。"},{"sentence":"Historically, black and white people were forced to live segregatedly in many parts of the United States.","translation":"歴史的に、アメリカ合衆国の多くの地域で、黒人と白人は分離して暮らすことを強制された。"}],"collocations":["live segregatedly","teach segregatedly","treat segregatedly"],"synonyms":["separately","apart","discriminatorily","exclusively","isolatedly"],"antonyms":["together","integratedly","inclusively","collectively"]}],"etymology":{"value":"\"Segregatedly\" is derived from the adjective \"segregated,\" which comes from the verb \"segregate.\" \"Segregate\" originates from the Latin word \"segregatus,\" the past participle of \"segregare,\" meaning \"to set apart, separate from the flock.\" This is composed of \"se-\" (aside, apart) and \"grex\" (flock, herd). The suffix \"-ly\" is added to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈseɡrɪɡeɪtɪdli/","syllables":"seg-re-ga-ted-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Segregatedly\" describes actions or states that involve separation or division, often with negative connotations related to discrimination. It emphasizes the manner in which something is done, highlighting the act of keeping groups or things apart. It is often used in historical or social contexts to describe discriminatory practices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The data was analyzed segregated.","correct":"✓ The data was analyzed segregatedly.","note":"Use the adverb form \"segregatedly\" to modify the verb \"analyzed.\" The adjective \"segregated\" can be used, but it would need a different sentence structure (e.g., \"The data was segregated and analyzed.\")."},{"incorrect":"✗ They lived segregated.","correct":"✓ They lived segregatedly.","note":"To describe how they lived, use the adverb \"segregatedly.\" The adjective \"segregated\" would imply a state of being (e.g., \"They were segregated.\")."}],"priority":"★★☆"},"related_words":{"derivatives":["segregate (verb)","segregation (noun)","segregated (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Segregatedly\" is an adverb that describes something done in a way that keeps groups separate, often due to race, religion, or other characteristics. It's not a common word, and you'll mostly find it in discussions about history, social issues, or legal contexts where separation and discrimination are being discussed. Because it's related to complex social issues, understanding the word also requires understanding the context in which it's used."},"example_sentences":[{"sentence":"The patients were treated segregatedly to prevent the spread of infection.","translation":"感染拡大を防ぐため、患者たちは隔離して治療された。","type":"adverb","meaning_category":"分離して"},{"sentence":"In the past, schools were often segregatedly organized by race.","translation":"過去には、学校は人種によって分離して組織されることが多かった。","type":"adverb","meaning_category":"差別的に"},{"sentence":"The information was presented segregatedly, making it difficult to see the connections between the different topics.","translation":"情報は分離して提示されたため、異なるトピック間のつながりを見るのが難しかった。","type":"adverb","meaning_category":"分離して"}]}