{"word":"declinability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（語の）屈折性、活用性","english_definition":"The quality or state of being declinable; the capability of a word to be inflected for grammatical categories such as case, number, and gender.","examples":[{"sentence":"Latin nouns exhibit a high degree of declinability.","translation":"ラテン語の名詞は高い屈折性を示す。"},{"sentence":"The declinability of adjectives in German affects their agreement with nouns.","translation":"ドイツ語の形容詞の屈折性は、名詞との一致に影響を与える。"},{"sentence":"English has limited declinability compared to languages like Latin or Greek.","translation":"英語は、ラテン語やギリシャ語のような言語と比較して、屈折性が限られている。"}],"collocations":["degree of declinability","high declinability","limited declinability","noun declinability","verb declinability","adjective declinability"],"synonyms":["inflection","conjugation (for verbs)","mutation"],"antonyms":["indeclinability"]}],"etymology":{"value":"Derived from 'declinable' (capable of being declined) + '-ity' (suffix denoting a state or quality). 'Declinable' comes from the verb 'decline', ultimately from Latin 'declinare' (to bend away, inflect).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˌklaɪnəˈbɪləti/","syllables":"de-clin-a-bil-i-ty"},"inflection":{"noun_plural":"declinabilities"},"usage_notes":{"explanation":"'Declinability' refers specifically to the ability of words (primarily nouns, pronouns, adjectives, and verbs) to change form to indicate grammatical function. It is a key feature of inflected languages. The term is most often used in the context of linguistic analysis or language teaching.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The declinability of the word is high, so it's hard to learn.","correct":"✓ The declinability of the word is high, so there are many forms to learn.","note":"The high declinability of a word means there are many forms, not necessarily that it's 'hard' to learn, although it can contribute to difficulty."},{"incorrect":"✗ Declinability is only for verbs.","correct":"✓ Declinability applies to nouns, pronouns, adjectives, and verbs, though verbs are often described using the term 'conjugation'.","note":"While 'conjugation' is typically used for verbs, 'declinability' is a broader term that includes the inflection of nouns, adjectives, and pronouns as well."}],"priority":"★★☆"},"related_words":{"derivatives":["declinable","decline","declension","indeclinable"],"related_concepts":["inflection","conjugation","case","gender","number","agreement"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Declinability' is a technical term used in linguistics to describe how words change their form to show different grammatical roles (like subject, object, etc.). It's mainly used when talking about languages that have lots of these changes, like Latin or German. It's not a common word in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The high declinability of Old English nouns made the language more complex than modern English.","translation":"古英語の名詞の高い屈折性は、現代英語よりも言語を複雑にした。","type":"noun","meaning_category":"屈折性"},{"sentence":"The lack of declinability in some word classes simplifies sentence structure.","translation":"一部の品詞における屈折性の欠如は、文の構造を単純化する。","type":"noun","meaning_category":"屈折性"},{"sentence":"Understanding declinability is crucial for mastering inflected languages.","translation":"屈折性を理解することは、屈折言語を習得するために重要である。","type":"noun","meaning_category":"屈折性"}]}