{"word":"resterilize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再滅菌する、再び滅菌処理を行う","english_definition":"To sterilize again; to subject to a second sterilization process.","examples":[{"sentence":"The equipment was resterilized before the next procedure.","translation":"その機器は次の処置の前に再滅菌された。"},{"sentence":"Due to contamination, the instruments had to be resterilized.","translation":"汚染のため、器具を再滅菌する必要があった。"}],"collocations":["resterilize equipment","resterilize instruments","resterilize medical supplies"],"synonyms":["re-sterilize","re-sanitize","re-disinfect"],"antonyms":["contaminate","infect"]}],"etymology":{"value":"The word \"resterilize\" is formed by adding the prefix \"re-\" (meaning \"again\" or \"anew\") to the word \"sterilize.\" Sterilize comes from the French word \"stérile\" and ultimately from the Latin word \"sterilis,\" meaning \"barren\" or \"infertile.\" In a medical context, \"sterilize\" means to make something free from bacteria or other living microorganisms.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈstɛrɪlaɪz/","syllables":"re-ster-i-lize"},"inflection":{"verb_forms":{"present_simple":["resterilize","resterilizes"],"past_simple":"resterilized","past_participle":"resterilized","present_participle":"resterilizing"}},"usage_notes":{"explanation":"\"Resterilize\" is used primarily in medical, scientific, and industrial contexts where maintaining a sterile environment is crucial. It indicates that an item or substance has undergone a sterilization process more than once, often due to potential contamination or a need to ensure complete sterility.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The water was resterilized for drinking.","correct":"✓ The water was purified for drinking.","note":"While resterilizing water is possible, the more common term for making water safe to drink is \"purify\" or \"disinfect,\" as sterilization is typically reserved for items that need to be completely free of all microorganisms."},{"incorrect":"✗ I resterilized the food.","correct":"✓ I reheated the food.","note":"\"Resterilize\" is not typically used for food. Reheating food is a more common practice to kill bacteria, but it doesn't necessarily sterilize it."}],"priority":"★☆☆"},"related_words":{"derivatives":["resterilization (noun)"],"phrasal_verbs":[],"related_terms":["sterilize","sterilization","disinfect","disinfection","sanitize","aseptic","antiseptic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'resterilize' is a technical term primarily used in medical, scientific, and industrial contexts. It means to sterilize something again. Understanding this word requires familiarity with the concept of sterilization and the prefix 're-,' which indicates repetition. Due to its specific usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"All surgical instruments must be resterilized between operations.","translation":"すべての外科用器具は手術の合間に再滅菌しなければならない。","type":"general","meaning_category":"medical"},{"sentence":"The lab technician resterilized the petri dishes after the experiment.","translation":"実験後、実験室の技術者はペトリ皿を再滅菌した。","type":"general","meaning_category":"scientific"},{"sentence":"The factory resterilized the packaging materials to ensure product safety.","translation":"工場は製品の安全性を確保するために、包装材を再滅菌した。","type":"general","meaning_category":"industrial"}]}