{"word":"retling","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, neologism) A person who frequently or habitually retweets content on social media, especially Twitter.","english_definition":"A person who frequently or habitually retweets content on social media, especially Twitter.","examples":[{"sentence":"He's such a retling; his entire feed is just other people's posts.","translation":"彼は本当にリツイートばかりする人だ。彼のフィードは他の人の投稿ばかりだ。","usage_notes":"This term is often used pejoratively to suggest a lack of original content or thought."}],"collocations":["social media retling","Twitter retling","habitual retling"],"synonyms":["retweeter"],"antonyms":[]}],"etymology":{"value":"A blend of \"retweet\" and the suffix \"-ling\" (used to form nouns denoting a person or thing of a specified kind, often with a diminutive or pejorative connotation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛtlɪŋ/","syllables":"ret-ling"},"inflection":{"noun_plural":"retlings"},"usage_notes":{"explanation":"\"Retling\" is a relatively rare and informal term. It's often used in a slightly derogatory way to describe someone who excessively retweets content, implying they don't create much original content themselves. The suffix \"-ling\" contributes to this slightly negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is retling all day.","correct":"✓ He is retweeting all day.","note":"\"Retling\" is a noun, not a verb. The verb form is \"retweet\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["retweet","retweeted","retweeting"]},"level_frequency":{"frequency_google_ngram":"Low frequency - a relatively new and uncommon word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Retling\" is a neologism, meaning it's a newly coined word. It's used to describe someone who spends a lot of time retweeting things on social media, especially on Twitter. It's not a very common word, and it's often used in a slightly negative way, suggesting that the person doesn't create their own content. If you see someone called a \"retling,\" it means they retweet a lot!"},"example_sentences":[{"sentence":"Don't be just a retling; create your own content!","translation":"ただリツイートばかりする人になるな。自分のコンテンツを作れ！","type":"noun","meaning_category":"person who retweets frequently"},{"sentence":"The article criticized social media users who are nothing but retlings.","translation":"その記事は、リツイートばかりしているソーシャルメディアユーザーを批判した。","type":"noun","meaning_category":"person who retweets frequently"}]}