{"word":"Tetrapturus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"バショウカジキ属","english_definition":"A genus of billfishes in the family Istiophoridae, containing several species of marlin.","examples":[{"sentence":"The genus Tetrapturus includes species such as the white marlin and shortbill spearfish.","translation":"バショウカジキ属には、シロカジキやフウライカジキなどの種が含まれます。"}],"collocations":["Tetrapturus audax (マカジキ)","Tetrapturus albidus (シロカジキ)","Tetrapturus belone (地中海バショウカジキ)","Tetrapturus georgii (丸カジキ)","Tetrapturus pfluegeri (フウライカジキ)"],"synonyms":["marlin","spearfish","billfish"],"antonyms":[]}],"etymology":{"value":"The name Tetrapturus is derived from the Greek words 'tetra' (four), 'pteron' (wing or fin), and 'ouros' (tail), referring to the four fins near the tail of these fish.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɛtræpˈtʊərəs/","syllables":"Te-trap-tu-rus"},"inflection":{"noun_plural":"Tetrapturuses or Tetrapturus"},"usage_notes":{"explanation":"Tetrapturus is a scientific genus name, primarily used in ichthyology (the study of fish) and marine biology. It refers to a specific group of large, predatory fish known for their elongated bills.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Tetrapturus in the aquarium.","correct":"✓ I saw a marlin/spearfish in the aquarium.","note":"While technically correct, using the common name (marlin, spearfish) is more natural in general conversation."}],"priority":"★☆☆"},"related_words":{"derivatives":["Istiophoridae (カジキ科)","billfish (カジキ)","marlin (マカジキ)","spearfish (フウライカジキ)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Scientific Term)","frequency_google_ngram":"Low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tetrapturus' is a scientific term used in biology to classify a specific genus of fish known as billfishes, including marlins and spearfish. This term is primarily encountered in scientific literature, academic studies, or specialized discussions related to marine biology and ichthyology. Understanding this term requires familiarity with biological nomenclature and classification systems."},"example_sentences":[{"sentence":"Scientists are studying the migration patterns of Tetrapturus audax in the Pacific Ocean.","translation":"科学者たちは、太平洋におけるマカジキの回遊パターンを研究している。","type":"scientific","meaning_category":"マカジキ属"},{"sentence":"The Tetrapturus genus is characterized by its elongated bill and streamlined body.","translation":"バショウカジキ属は、細長い吻（ふん）と流線型の体型によって特徴付けられる。","type":"scientific","meaning_category":"マカジキ属の特徴"}]}