{"word":"sedentarily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"座りがちに、ほとんど運動せずに","english_definition":"in a way that involves little physical activity; in a sedentary manner.","examples":[{"sentence":"He lived sedentarily after retirement, spending most of his time reading.","translation":"彼は退職後、ほとんど運動せずに座りがちに生活し、ほとんどの時間を読書に費やした。"},{"sentence":"Many office workers live sedentarily during the week and try to make up for it on the weekends.","translation":"多くのオフィスワーカーは、平日は座りがちに生活し、週末にそれを補おうとする。"},{"sentence":"Living sedentarily can increase the risk of various health problems.","translation":"座りがちな生活は、さまざまな健康問題のリスクを高める可能性がある。"}],"collocations":["live sedentarily","work sedentarily","spend time sedentarily"],"synonyms":["inactively","immobilely","motionlessly","desk-bound"],"antonyms":["actively","energetically","dynamically"]}],"etymology":{"value":"Derived from the adjective 'sedentary' (characterized by or requiring a sitting posture) and the suffix '-ly' (forming adverbs). 'Sedentary' comes from the Latin 'sedentarius' (sitting), from 'sedēre' (to sit).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛdəˈtɛrɪli/","syllables":"se-den-tar-i-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Sedentarily' describes how an action is performed, indicating a lack of physical activity or movement. It is often used to describe lifestyles or work habits that involve prolonged sitting. It emphasizes the lack of exercise and potential health consequences associated with such behavior.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is sedentarily.","correct":"✓ He lives sedentarily.","note":"'Sedentarily' is an adverb and modifies a verb, not a noun or pronoun. Therefore, it should be used with an action verb like 'live', 'work', or 'spend time' rather than a linking verb like 'is'."},{"incorrect":"✗ Sedentarily life is unhealthy.","correct":"✓ A sedentary life is unhealthy. / ✓ Living sedentarily is unhealthy.","note":"'Sedentarily' is an adverb and cannot directly modify the noun 'life'. Use the adjective 'sedentary' to describe the noun, or use the gerund 'living sedentarily' as the subject of the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["sedentary (adjective)","sedentariness (noun)"],"phrasal_verbs":[],"related_concepts":["inactivity","lack of exercise","desk job","sitting disease"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'sedentarily' is used to describe doing something in a way that involves a lot of sitting and not much physical activity. It's often used to talk about lifestyles or jobs where people spend a lot of time sitting down. It's not a very common word, so you'll mostly find it in more formal writing or discussions about health and lifestyle."},"example_sentences":[{"sentence":"She spent her days sedentarily, working long hours at her computer.","translation":"彼女は一日中座りがちに、長時間コンピューターに向かって仕事をした。","type":"adverb","meaning_category":"lack of physical activity"},{"sentence":"The study showed that people who live sedentarily have a higher risk of heart disease.","translation":"その研究は、座りがちに生活する人は心臓病のリスクが高いことを示した。","type":"adverb","meaning_category":"health implications"},{"sentence":"Modern technology has contributed to many people living more sedentarily.","translation":"現代のテクノロジーは、多くの人がより座りがちに生活する一因となっている。","type":"adverb","meaning_category":"lifestyle"}]}