{"word":"Plexiglas","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"プレキシグラス (透明なアクリル樹脂の商品名)","english_definition":"A transparent plastic material, polymethyl methacrylate (PMMA), known for its strength and shatter resistance, often used as a lightweight or shatter-resistant alternative to glass.","examples":[{"sentence":"The aquarium was made of thick Plexiglas.","translation":"水槽は厚いプレキシグラスで作られていた。"},{"sentence":"We used Plexiglas to create a protective barrier.","translation":"保護バリアを作るためにプレキシグラスを使った。"}],"collocations":["Plexiglas sheet","Plexiglas window","Plexiglas display case"],"synonyms":["acrylic glass","PMMA","acrylic sheet","perspex"],"antonyms":["glass"],"notes":"Plexiglas is a brand name, but it's often used generically to refer to acrylic sheets."}],"etymology":{"value":"A proprietary name, from German 'Plexiglas', a blend of 'plex(ig)' (from 'plexen', to braid or interweave, referring to the polymer structure) + 'Glas' (glass).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈplɛksɪˌɡlæs/","syllables":"Plex-i-glas"},"inflection":{"noun_plural":"Plexiglas (uncountable, typically)"},"usage_notes":{"explanation":"'Plexiglas' is a brand name for acrylic sheet, similar to how 'Kleenex' is a brand name for facial tissue. While technically a specific product, it's often used as a generic term to refer to any clear acrylic sheet. It's known for being lighter and more shatter-resistant than glass, making it suitable for applications like windows, displays, and protective barriers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to buy a Plexiglas's sheet.","correct":"✓ I need to buy a Plexiglas sheet.","note":"Plexiglas is often used as an attributive noun (modifying another noun), so possessive forms are generally avoided."},{"incorrect":"✗ Plexiglas are very strong.","correct":"✓ Plexiglas is very strong.","note":"Plexiglas is usually treated as an uncountable noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["acrylic","acrylic resin","polymethyl methacrylate (PMMA)"],"phrasal_verbs":[],"related_terms":["Lexan (another brand of transparent plastic, polycarbonate)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Plexiglas' is a specific type of clear plastic, often used instead of glass because it's stronger and doesn't break as easily. Think of it like a special kind of plastic that looks like glass but is more durable. It's used for things like windows in airplanes or protective shields. While it's a brand name, people often use 'Plexiglas' to refer to any similar clear plastic sheet.","priority":"★★★"},"example_sentences":[{"sentence":"The museum used **Plexiglas** to protect the valuable artifacts.","translation":"博物館は貴重な工芸品を保護するためにプレキシグラスを使用した。","type":"noun","meaning_category":"material"},{"sentence":"She replaced the broken window with a sheet of **Plexiglas**.","translation":"彼女は壊れた窓をプレキシグラスのシートで交換した。","type":"noun","meaning_category":"material"},{"sentence":"The display case was made of **Plexiglas** to provide a clear view of the items inside.","translation":"展示ケースは中のアイテムをはっきりと見せるためにプレキシグラスで作られていた。","type":"noun","meaning_category":"material"}]}