{"word":"sniffiness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"気取り、鼻持ちならなさ、見下した態度","english_definition":"The quality of being sniffy; an attitude of disdain or superiority.","examples":[{"sentence":"Her sniffiness towards those she considered less sophisticated was quite irritating.","translation":"彼女の、自分より洗練されていないと見なす人々に対する気取りは、非常にイライラさせられた。"},{"sentence":"There was a certain sniffiness in his tone when he spoke about their humble origins.","translation":"彼が彼らの質素な出自について話すとき、その口調にはある種の鼻持ちならなさが感じられた。"}],"collocations":["a tone of sniffiness","an air of sniffiness","show sniffiness","detect sniffiness"],"synonyms":["condescension","disdain","scorn","haughtiness","superciliousness","airs","superiority"],"antonyms":["humility","modesty","respect","admiration"]}],"etymology":{"value":"Derived from 'sniffy,' which is formed from 'sniff' (to draw air audibly through the nose, often expressing disapproval) + '-y' (forming adjectives). The addition of '-ness' turns the adjective into a noun.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsnɪfiniːs/","syllables":"snif-fi-ness"},"inflection":{"noun_plural":"sniffinesses (rarely used)"},"usage_notes":{"explanation":"'Sniffiness' describes a specific kind of negative attitude characterized by a sense of superiority and disdain. It often implies a subtle or overt expression of disapproval, as if the person is 'sniffing' at something they find distasteful or beneath them. The term is typically used to critique or describe someone's behavior rather than to express one's own feelings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed sniffiness for her hard work.","correct":"✓ He showed sniffiness towards her hard work.","note":"'Sniffiness' is usually directed 'towards' something or someone. The preposition 'for' is not typically used in this context."},{"incorrect":"✗ The sniffiness of the air made me cough.","correct":"✓ The stuffiness of the air made me cough.","note":"'Sniffiness' refers to an attitude, not a physical quality of the air. Use 'stuffiness' or another appropriate word to describe air quality."}],"priority":"★★☆"},"related_words":{"derivatives":["sniffy (adjective)","sniff (verb, noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sniffiness' is a relatively uncommon word used to describe an attitude of disdain or superiority. It suggests that someone looks down on something or someone else, often in a subtle or indirect way. Because it is not a frequently used word, understanding its meaning and usage requires a strong vocabulary. The word is often used in formal writing or sophisticated conversation to describe a character's behavior or a social dynamic."},"example_sentences":[{"sentence":"The art critic's sniffiness towards modern art was well-known.","translation":"その美術評論家の現代アートに対する気取りはよく知られていた。","type":"noun","meaning_category":"気取り"},{"sentence":"I couldn't help but detect a hint of sniffiness in her voice when she mentioned my old car.","translation":"彼女が私の古い車について言及したとき、彼女の声に鼻持ちならなさを感じずにはいられなかった。","type":"noun","meaning_category":"鼻持ちならなさ"},{"sentence":"His sniffiness made it difficult to have a productive conversation with him.","translation":"彼の見下した態度のため、彼と生産的な会話をすることが難しかった。","type":"noun","meaning_category":"見下した態度"}]}