{"word":"Adonic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アードーニス（Adonis）の、アードーニス風の","english_definition":"Relating to Adonis; resembling Adonis, especially in beauty.","examples":[{"sentence":"The young man possessed an Adonic physique.","translation":"その若者はアードーニスのような体格をしていた。"}],"collocations":["Adonic verse","Adonic beauty"],"synonyms":["beautiful","handsome","attractive"],"antonyms":["unattractive","ugly"]},{"part_of_speech":"noun","definition":"アードーニス詩（Adonic verse）","english_definition":"A verse consisting of a dactyl and a spondee or trochee, especially as the concluding verse of a Sapphic stanza.","examples":[{"sentence":"The poem ends with a beautiful Adonic.","translation":"その詩は美しいアードーニス詩で終わる。"}],"collocations":["Sapphic stanza","Adonic meter"],"synonyms":["verse","poem"]}],"etymology":{"value":"From Latin Adonius, from Greek Adōnios, relating to Adonis, a figure of masculine beauty in Greek mythology.","priority":"★★★"},"pronunciation":{"ipa":"/əˈdɒnɪk/","syllables":"A-don-ic"},"inflection":{"notes":"Adjective and noun. Plural of the noun is Adonics."},"usage_notes":{"explanation":"The word 'Adonic' is primarily used in literary or artistic contexts to describe something related to or reminiscent of Adonis, a figure from Greek mythology known for his exceptional beauty. As an adjective, it describes physical attractiveness, while as a noun, it refers to a specific type of verse.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was very adonic.","correct":"✓ He had an Adonic physique.","note":"It's more common to use 'Adonic' to describe specific features or qualities rather than directly describing a person."}],"priority":"★☆☆"},"related_words":{"derivatives":["Adonis"],"related_terms":["Greek mythology","Sapphic verse"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Adonic\" is a relatively rare word primarily encountered in literary or classical contexts. It refers to Adonis, a figure from Greek mythology known for his beauty, or to a specific type of verse. Its usage is typically limited to those with a strong background in literature or classical studies."},"example_sentences":[{"sentence":"The sculptor aimed to capture the Adonic grace of the athlete.","translation":"彫刻家は、その運動選手の持つアードーニスのような優美さを捉えようとした。","type":"adjective","meaning_category":"beauty"},{"sentence":"The Sapphic stanza concluded with a poignant Adonic.","translation":"サッポー詩節は、痛切なアードーニス詩で締めくくられた。","type":"noun","meaning_category":"verse"}]}