{"word":"give-uppers","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"(plural only) People who easily give up or quit; those lacking perseverance or determination.","english_definition":"(plural only) People who tend to give up easily; those who lack persistence or determination to complete a task or achieve a goal.","examples":[{"sentence":"The coach doesn't want any give-uppers on the team; he needs players who will fight until the end.","translation":"コーチはチームにすぐに諦める選手は要らない。最後まで戦う選手が必要だ。"},{"sentence":"She doesn't associate with give-uppers because she finds their lack of motivation discouraging.","translation":"彼女はすぐに諦める人と付き合わない。彼らのモチベーションの欠如が気が滅入るからだ。"},{"sentence":"The project failed because too many people involved were give-uppers and didn't see it through.","translation":"プロジェクトは失敗した。関わった人の多くがすぐに諦めるタイプで、最後までやり遂げなかったからだ。"}],"collocations":["avoid being a give-upper","identify give-uppers","overcome being a give-upper"],"synonyms":["quitters","deserters","defeatists","waverers","fainthearted","weaklings"],"antonyms":["achievers","go-getters","perseverers","determined","persistent","tenacious"]}],"etymology":{"value":"Derived from the phrasal verb 'give up' + the suffix '-er' (denoting a person who does something).","priority":"Medium"},"pronunciation":{"ipa":"/ˈɡɪvˌʌpərz/","syllables":"giv-up-pers"},"inflection":{"noun_plural":"give-uppers (always plural)"},"usage_notes":{"explanation":"'Give-uppers' is typically used in informal contexts to describe individuals who are perceived as lacking resilience or commitment. It often carries a negative connotation, implying a lack of strength or resolve. It's almost exclusively used in the plural form.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He is a give-upper.","correct":"He is a give-up. / He is someone who gives up easily.","note":"While 'give-upper' is understood, it's almost exclusively used in the plural. Singular usage is less common and can sound awkward."},{"incorrect":"She has a give-upper attitude.","correct":"She has a give-up attitude. / She has a defeatist attitude.","note":"'Give-upper' is usually reserved for describing people, not attitudes. Using 'give-up' as an adjective works better, or you can use synonyms like 'defeatist'."}],"priority":"Low"},"related_words":{"derivatives":["give up (verb)","give-up (noun/adjective)"],"phrasal_verbs":["give up"],"priority":"Medium"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR materials)","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"B2","text":"'Give-uppers' is an informal term for people who easily quit or lack determination. It is derived from the phrasal verb 'give up,' meaning to stop trying. The term is typically used in casual conversation or writing to negatively describe individuals who don't persevere through challenges. It is almost always used in the plural form."},"example_sentences":[{"sentence":"The coach warned against being give-uppers when the game got tough.","translation":"コーチは試合が厳しくなった時にすぐに諦めるなと警告した。","type":"noun","meaning_category":"People who give up easily"},{"sentence":"Successful entrepreneurs aren't give-uppers; they learn from their failures and keep going.","translation":"成功した起業家はすぐに諦める人ではない。失敗から学び、前進し続ける。","type":"noun","meaning_category":"People who give up easily"},{"sentence":"We need team members who are resilient, not give-uppers.","translation":"私たちに必要なのは、すぐに諦める人ではなく、回復力のあるチームメンバーだ。","type":"noun","meaning_category":"People who give up easily"}]}