{"word":"short-circuiter","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(電気工学)短絡回路を作る人、または短絡させる装置","english_definition":"A person or device that causes a short circuit.","examples":[{"sentence":"The technician was a short-circuiter when he accidentally connected the wrong wires.","translation":"その技術者は、誤って間違った配線を接続した際に短絡回路を作る人だった。"},{"sentence":"The device acted as a short-circuiter, protecting the main circuit from overvoltage.","translation":"その装置は短絡回路を作る装置として機能し、主回路を過電圧から保護した。"}],"collocations":["accidental short-circuiter","intentional short-circuiter","circuit short-circuiter"],"synonyms":["shorting device","circuit breaker (in some contexts)"],"antonyms":["insulator","open circuit"]},{"part_of_speech":"noun","definition":"(比喩的に)計画やプロセスを妨害する人","english_definition":"(Figurative) Someone who disrupts a plan or process.","examples":[{"sentence":"He was a short-circuiter of the project, always finding reasons why things wouldn't work.","translation":"彼はプロジェクトの妨害者で、常に物事がうまくいかない理由を見つけていた。"},{"sentence":"Her constant negativity made her a short-circuiter in the team's brainstorming sessions.","translation":"彼女の絶え間ない否定的な態度は、チームのブレインストーミングセッションにおいて妨害者となった。"}],"collocations":["project short-circuiter","plan short-circuiter","team short-circuiter"],"synonyms":["saboteur","disruptor","spoiler","underminer"],"antonyms":["facilitator","supporter","promoter"]}],"etymology":{"value":"Derived from 'short circuit' + '-er' (agent noun suffix). 'Short circuit' refers to an unintended low-resistance connection in an electrical circuit, leading to a high current flow. The figurative sense extends this idea to describe someone who disrupts or prematurely ends a process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʃɔːrt ˈsɜːrkɪtər/","syllables":"short-cir-cuit-er"},"inflection":{"noun_plural":"short-circuiters"},"usage_notes":{"explanation":"The term 'short-circuiter' is relatively uncommon. It's more frequently used in technical contexts related to electrical engineering. The figurative sense is less common but can be used to describe someone who consistently undermines or disrupts plans. The term carries a negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a short-circuiter because he is short.","correct":"✓ He is a short-circuiter because he always disrupts our plans.","note":"The term 'short-circuiter' has nothing to do with physical height. It refers to someone who causes disruptions, either literally in electrical circuits or figuratively in plans and processes."}],"priority":"★☆☆"},"related_words":{"derivatives":["short circuit (noun)","short-circuit (verb)"],"phrasal_verbs":[],"related_concepts":["electrical engineering","circuitry","sabotage","disruption"]},"level_frequency":{"CEFR":"C2 (technical context), C2 (figurative context)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'short-circuiter' refers to someone or something that causes a short circuit, either literally in an electrical context or figuratively by disrupting plans. It's a relatively uncommon term, especially in its figurative sense. Understanding requires familiarity with the concept of a 'short circuit' in electrical engineering, which is an unintended connection that allows current to flow along an unintended path with very low electrical impedance. In a figurative sense, a 'short-circuiter' is someone who undermines or sabotages a plan or process, causing it to fail prematurely."},"example_sentences":[{"sentence":"The faulty wiring made him a potential short-circuiter, risking a fire.","translation":"欠陥のある配線は彼を潜在的な短絡回路を作る人とし、火災の危険を冒した。","type":"noun","meaning_category":"Electrical Engineering"},{"sentence":"As a project manager, he hated dealing with anyone who was a short-circuiter, constantly derailing progress.","translation":"プロジェクトマネージャーとして、彼は常に進捗を妨害する妨害者に対処するのが嫌いだった。","type":"noun","meaning_category":"Figurative"}]}