{"word":"tachycardia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"頻脈","english_definition":"An abnormally rapid heart rate, usually defined as greater than 100 beats per minute in adults.","examples":[{"sentence":"The patient presented with symptoms of dizziness and palpitations due to tachycardia.","translation":"患者は頻脈によるめまいと動悸の症状を呈した。"},{"sentence":"Tachycardia can be caused by various factors, including stress, anxiety, or underlying heart conditions.","translation":"頻脈は、ストレス、不安、または基礎となる心臓の状態を含む様々な要因によって引き起こされる可能性がある。"}],"collocations":["sinus tachycardia (洞性頻脈)","supraventricular tachycardia (上室性頻脈)","ventricular tachycardia (心室頻脈)","paroxysmal tachycardia (発作性頻脈)"],"synonyms":["rapid heart rate","accelerated heart rate"],"antonyms":["bradycardia (徐脈)"]}],"etymology":{"value":"From the Greek words 'tachys' (fast) and 'cardia' (heart).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtækɪˈkɑːrdiə/","syllables":"ta-chy-car-di-a"},"inflection":{"noun_plural":"tachycardias"},"usage_notes":{"explanation":"Tachycardia refers specifically to an abnormally fast heart rate. It is a medical term used in the context of heart conditions and diagnostics. Different types of tachycardia exist, classified by the origin of the rapid heart rate within the heart.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has tachycardia in his leg.","correct":"✓ He has tachycardia.","note":"Tachycardia specifically refers to the heart rate, not other parts of the body."},{"incorrect":"✗ Tachycardia is when your heart beats slowly.","correct":"✓ Tachycardia is when your heart beats too fast.","note":"Tachycardia is a fast heart rate, not a slow one. Bradycardia is the term for a slow heart rate."}],"priority":"★★☆"},"related_words":{"derivatives":["tachycardic (adjective)"],"medical_terms":["electrocardiogram (ECG/EKG)","arrhythmia","palpitation","atrial fibrillation","heart rate","cardiology"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tachycardia' is a medical term referring to a heart rate that is abnormally fast. It is typically used in medical settings or when discussing health-related issues. Understanding this term is more relevant for those in healthcare or those with specific heart conditions. It's important to distinguish it from general terms related to excitement or anxiety, which might cause a temporarily elevated heart rate but not necessarily to the level defined as tachycardia."},"example_sentences":[{"sentence":"The doctor diagnosed her with sinus tachycardia after reviewing her ECG.","translation":"医師は心電図を確認した後、彼女を洞性頻脈と診断した。","type":"medical","meaning_category":"diagnosis"},{"sentence":"During the panic attack, he experienced a bout of tachycardia.","translation":"パニック発作中、彼は頻脈の発作を経験した。","type":"symptom","meaning_category":"symptom"},{"sentence":"Treatment for tachycardia depends on the underlying cause and may include medication or lifestyle changes.","translation":"頻脈の治療は根本的な原因によって異なり、薬物療法や生活習慣の改善が含まれる場合がある。","type":"treatment","meaning_category":"treatment"}]}