{"word":"non-burnables","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"燃えないごみ、不燃ごみ","english_definition":"Non-combustible waste; waste that cannot be burned.","examples":[{"sentence":"Please separate your trash into burnables and non-burnables.","translation":"ゴミを燃えるゴミと燃えないゴミに分別してください。"},{"sentence":"The city provides different collection days for burnable and non-burnable waste.","translation":"市は燃えるゴミと燃えないゴミで異なる収集日を設けています。"},{"sentence":"Glass and metal are typically classified as non-burnables.","translation":"ガラスや金属は通常、燃えないゴミに分類されます。"}],"collocations":["non-burnable waste","non-burnable garbage","separate non-burnables","dispose of non-burnables"],"synonyms":["incombustible waste","non-combustible garbage","unburnable waste","unburnable garbage"],"antonyms":["burnables","combustible waste","burnable garbage"]}],"etymology":{"value":"The term is a direct combination of the prefix 'non-' (meaning 'not') and the word 'burnable' (meaning 'capable of being burned'). It is commonly used in waste management contexts to categorize materials that cannot be incinerated.","priority":"N/A"},"pronunciation":{"ipa":"/ˌnɒnˈbɜːrnəbəlz/","syllables":"non-bur-na-bles"},"inflection":{"noun_plural":"non-burnables (already plural)"},"usage_notes":{"explanation":"'Non-burnables' is a common term used in countries with advanced waste management systems, particularly in Japan and other East Asian countries, where waste separation is strictly enforced. It refers to items that cannot be effectively or safely incinerated and must be disposed of through other means, such as landfill or recycling. The specific items classified as non-burnable can vary depending on local regulations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I threw the plastic bottle in the non-burnables.","correct":"✓ I threw the plastic bottle in the recyclables.","note":"Plastic bottles are often recyclable, not non-burnable. Check your local guidelines."},{"incorrect":"✗ Is paper a non-burnable?","correct":"✓ Is paper a burnable?","note":"Paper is generally considered burnable."}],"priority":"★★☆"},"related_words":{"derivatives":["non-burnable (adjective)"],"phrasal_verbs":[],"related_terms":["burnables","recyclables","hazardous waste","waste separation","incineration","landfill"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in specific contexts related to waste management.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Non-burnables' refers to trash that cannot be burned safely in an incinerator. This term is often used in areas with strict recycling and waste disposal rules. Examples of non-burnables include glass, metal, and certain types of plastics. It's important to know what is considered non-burnable in your local area to properly sort your trash.","priority":"★★★"},"example_sentences":[{"sentence":"The old frying pan should be disposed of as **non-burnables**.","translation":"古いフライパンは燃えないゴミとして処分すべきです。","type":"noun","meaning_category":"waste disposal"},{"sentence":"Make sure to check the city's guidelines for sorting **non-burnables**.","translation":"必ず市のガイドラインを確認して、燃えないゴミの分別を行ってください。","type":"noun","meaning_category":"waste management"},{"sentence":"The **non-burnables** collection is on the third Wednesday of each month.","translation":"燃えないゴミの収集は毎月第3水曜日です。","type":"noun","meaning_category":"waste collection"}]}