{"word":"unprizable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"価値をつけられない、評価できない、非常に貴重で値踏みできない","english_definition":"Impossible to estimate the value of; too valuable to be appraised.","examples":[{"sentence":"The antique was unprizable due to its unique historical significance.","translation":"その骨董品は、その独特の歴史的意義のために、価値をつけることができなかった。"},{"sentence":"Her contribution to the project was unprizable.","translation":"彼女のプロジェクトへの貢献は評価できないほど貴重だった。"},{"sentence":"The memories are unprizable.","translation":"その思い出は非常に貴重で値踏みできない。"}],"collocations":["unprizable asset","unprizable contribution","unprizable memory"],"synonyms":["invaluable","priceless","immeasurable","inestimable","beyond price","irreplaceable"],"antonyms":["valuable","worthwhile","replaceable","measurable"]}],"etymology":{"value":"\"Un-\" (否定の接頭辞) + \"prizable\" (価値をつけられる)","priority":"★☆☆"},"pronunciation":{"ipa":"/ʌnˈpraɪzəbəl/","syllables":"un-pri-za-ble"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"Unprizable\" is a relatively rare word that means something is so valuable or unique that it's impossible to put a price on it. It suggests that the item or contribution is beyond monetary value and is often associated with sentimental or historical significance. It is stronger than \"valuable\" or \"priceless\".","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was unprizable, so we sold it cheaply.","correct":"✓ The painting was invaluable, so we kept it safe.","note":"Unprizable means the opposite of cheap. If something is unprizable, it's too valuable to sell cheaply."},{"incorrect":"✗ The unprizable information was leaked to the press.","correct":"✓ The confidential information was leaked to the press.","note":"Unprizable is usually used for tangible or intangible things that have value, not for information that is secret."}],"priority":"★☆☆"},"related_words":{"derivatives":["prize (名詞、動詞)","prizable (形容詞)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unprizable\" is a sophisticated term used to describe something of such great value that it cannot be accurately measured or assigned a price. It's often used in contexts where the worth of something is far beyond monetary terms, such as historical artifacts, unique works of art, or deeply personal memories. Understanding this word requires a grasp of abstract concepts related to value and appreciation."},"example_sentences":[{"sentence":"The family heirloom was considered unprizable due to its emotional significance.","translation":"その家宝は、その感情的な重要性から、価値をつけられないと考えられていた。","type":"adjective","meaning_category":"価値をつけられない"},{"sentence":"The artist's early works are now unprizable.","translation":"その芸術家の初期の作品は、今では非常に貴重で値踏みできない。","type":"adjective","meaning_category":"非常に貴重で値踏みできない"},{"sentence":"The experience of witnessing such a rare event was unprizable.","translation":"そのような珍しい出来事を目の当たりにする経験は、非常に貴重で値踏みできない。","type":"adjective","meaning_category":"非常に貴重で値踏みできない"}]}