{"word":"Sainthoods","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"聖人の地位、聖人であること","english_definition":"The state of being a saint; the condition of being recognized as a saint by a church.","examples":[{"sentence":"The church is considering her for sainthood.","translation":"教会は彼女を聖人にするかどうか検討している。"},{"sentence":"He lived a life of such virtue that his sainthood was almost assured.","translation":"彼は非常に徳の高い生活を送ったので、彼が聖人になることはほぼ確実だった。"}],"collocations":["achieve sainthood","be considered for sainthood","seek sainthood","deny sainthood"],"synonyms":["canonization","sanctity","holiness"],"antonyms":["sinfulness","wickedness"]}],"etymology":{"value":"'Sainthood' is derived from the word 'saint', combined with the suffix '-hood', which denotes a state or condition. 'Saint' comes from the Latin word 'sanctus', meaning holy or sacred.","priority":"★★★"},"pronunciation":{"ipa":"/ˈseɪntˌhʊdz/","syllables":"saint-hoods"},"inflection":{"noun_plural":"sainthoods"},"usage_notes":{"explanation":"'Sainthood' refers to the recognition by a church (typically the Roman Catholic or Orthodox Church) that a deceased person lived a life of exceptional holiness and virtue, and is therefore worthy of public veneration. It is a formal process involving investigation and often requires the verification of miracles attributed to the person's intercession. The plural 'sainthoods' is rarely used, but can refer to multiple instances or considerations of achieving sainthood.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He achieved a sainthood.","correct":"✓ He achieved sainthood.","note":"'Sainthood' is generally used as an uncountable noun, so the article 'a' is usually omitted."},{"incorrect":"✗ She is a saint because she has sainthood.","correct":"✓ She is a saint because she is recognized for her exceptional holiness.","note":"Having 'sainthood' means that one is recognized as a saint. The sentence should focus on the qualities that led to that recognition."}],"priority":"★★☆"},"related_words":{"derivatives":["saint","saintly","sanctify","sanctification"],"phrases":["cause for sainthood","road to sainthood"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'sainthood' is a relatively uncommon term that refers to the state or condition of being recognized as a saint by a church. It is most often used in the context of religious discussions, particularly within Catholicism and Orthodox Christianity. Understanding this word requires familiarity with religious concepts and vocabulary. The plural form 'sainthoods' is even less common and typically used in specific contexts when referring to multiple instances or considerations of achieving sainthood."},"example_sentences":[{"sentence":"The Vatican is investigating her life for possible **sainthood**.","translation":"バチカンは彼女の生涯を調査し、聖人になる可能性を調べている。","type":"noun","meaning_category":"聖人の地位"},{"sentence":"Many believe that Mother Teresa deserves **sainthood**.","translation":"多くの人が、マザー・テレサは聖人になるに値すると信じている。","type":"noun","meaning_category":"聖人の地位"},{"sentence":"The process of achieving **sainthood** can take many years.","translation":"聖人の地位を得るプロセスには何年もかかることがある。","type":"noun","meaning_category":"聖人の地位"}]}