{"word":"pyelonephrosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"腎盂腎症","english_definition":"Distension of the renal pelvis and calyces with urine, usually due to obstruction of the ureter.","examples":[{"sentence":"Pyelonephrosis can lead to kidney damage if left untreated.","translation":"腎盂腎症は、放置すると腎臓の損傷につながる可能性があります。"}],"collocations":["acute pyelonephrosis (急性腎盂腎症)","chronic pyelonephrosis (慢性腎盂腎症)"],"synonyms":["hydronephrosis"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'pyelo-' (referring to the renal pelvis), 'nephro-' (referring to the kidney), and '-osis' (denoting a condition or disease).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaɪɪləʊnɪˈfroʊsɪs/","syllables":"py-e-lo-ne-phro-sis"},"inflection":{"noun_plural":"pyelonephroses"},"usage_notes":{"explanation":"'Pyelonephrosis' is a medical term specifically referring to the distension of the renal pelvis and calyces due to urine accumulation, often caused by a blockage. It is closely related to 'hydronephrosis', which is a more general term for swelling of the kidney due to urine buildup. 'Pyelonephritis', on the other hand, refers to an infection of the kidney.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient was diagnosed with pyelonephritis, which turned out to be pyelonephrosis.","correct":"✓ The patient was initially suspected of having pyelonephritis, but the diagnosis was later confirmed as pyelonephrosis.","note":"Ensure the correct term is used based on the presence of infection. Pyelonephrosis is distension without infection, while pyelonephritis involves infection."}],"priority":"★★☆"},"related_words":{"derivatives":["pyelonephritic (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency (specialized medical term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pyelonephrosis' is a highly specialized medical term referring to the distension of the renal pelvis and calyces with urine. It is typically encountered in medical contexts, such as diagnoses, medical literature, and discussions among healthcare professionals. Understanding this term requires a background in medical terminology and anatomy. It is important to differentiate it from similar terms like 'pyelonephritis' (kidney infection) and 'hydronephrosis' (general kidney swelling due to urine buildup)."},"example_sentences":[{"sentence":"The ultrasound revealed severe pyelonephrosis in the patient's left kidney.","translation":"超音波検査で、患者の左腎に重度の腎盂腎症が認められた。","type":"medical diagnosis","meaning_category":"kidney condition"},{"sentence":"Treatment for pyelonephrosis often involves relieving the urinary obstruction.","translation":"腎盂腎症の治療には、尿路の閉塞を解消することがしばしば含まれる。","type":"medical treatment","meaning_category":"kidney condition"}]}