{"word":"Bibliographies","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"参考文献一覧、参考文献目録","english_definition":"A list of the books, articles, and other sources used in a piece of writing.","examples":[{"sentence":"The book includes extensive bibliographies at the end of each chapter.","translation":"その本には、各章の終わりに詳細な参考文献一覧が含まれています。"},{"sentence":"She consulted several bibliographies to find relevant research papers.","translation":"彼女は関連する研究論文を見つけるために、いくつかの参考文献一覧を調べました。"},{"sentence":"The bibliography should be arranged alphabetically by author's last name.","translation":"参考文献一覧は、著者の姓のアルファベット順に並べる必要があります。"}],"collocations":["create a bibliography (参考文献一覧を作成する)","compile a bibliography (参考文献一覧を編集する)","consult a bibliography (参考文献一覧を参照する)","include a bibliography (参考文献一覧を含める)","annotated bibliography (注釈付き参考文献一覧)"],"synonyms":["reference list","works cited","sources","citations"],"antonyms":[]}],"etymology":{"value":"The word \"bibliography\" comes from the Greek words \"biblion\" (book) and \"graphia\" (writing). It originally referred to the writing or copying of books but later evolved to mean a list of books.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbɪbliˈɒɡrəfiz/","syllables":"bib-li-og-ra-phies"},"inflection":{"singular":"bibliography"},"usage_notes":{"explanation":"\"Bibliographies\" is the plural form of \"bibliography.\" A bibliography is a list of sources (books, articles, websites, etc.) that you have used in your research. It is usually placed at the end of a book, article, or research paper. The purpose of a bibliography is to give credit to the authors whose work you have used and to allow readers to find those sources for themselves. Different citation styles (e.g., MLA, APA, Chicago) dictate how entries in a bibliography should be formatted.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The bibliography are at the end of the book.","correct":"✓ The bibliography is at the end of the book. / ✓ The bibliographies are at the end of the book.","note":"\"Bibliography\" is singular, so it takes a singular verb. \"Bibliographies\" is plural, so it takes a plural verb."},{"incorrect":"✗ I used many bibliography for my research.","correct":"✓ I used many bibliographies for my research.","note":"\"Bibliography\" is a countable noun, so you need to use the plural form \"bibliographies\" when referring to more than one."}],"priority":"★★☆"},"related_words":{"derivatives":["bibliographic (adjective: relating to bibliography)","bibliographer (noun: a person who compiles bibliographies)","bibliography (singular noun: 参考文献一覧)"],"phrases":["annotated bibliography (注釈付き参考文献一覧)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in academic writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"bibliographies\" refers to lists of sources (books, articles, etc.) used in academic writing. It's a plural noun, with the singular form being \"bibliography.\" It's most often encountered in scholarly contexts, such as research papers, theses, and academic books. The purpose of a bibliography is to give credit to the sources used and to allow readers to find those sources themselves. Understanding the term is important for academic reading and writing. Different citation styles (MLA, APA, Chicago, etc.) have specific rules for formatting bibliographies."},"example_sentences":[{"sentence":"The professor required all students to submit their bibliographies along with their research papers.","translation":"教授はすべての学生に、研究論文とともに参考文献一覧を提出することを義務付けた。","type":"noun","meaning_category":"参考文献一覧"},{"sentence":"She spent hours compiling the bibliographies for her dissertation.","translation":"彼女は学位論文のために参考文献一覧を編集するのに何時間も費やした。","type":"noun","meaning_category":"参考文献一覧"},{"sentence":"The bibliographies in this book are very comprehensive.","translation":"この本の参考文献一覧は非常に包括的である。","type":"noun","meaning_category":"参考文献一覧"}]}