{"word":"non-associativity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非結合性：ある演算において、演算の順序を変えると結果が変わる性質。","english_definition":"The property of an operation where changing the grouping of the operands affects the result. In other words, (a * b) * c is not necessarily equal to a * (b * c).","examples":[{"sentence":"Subtraction is a common example of non-associativity, as (5 - 3) - 2 ≠ 5 - (3 - 2).","translation":"引き算は非結合性の一般的な例であり、(5 - 3) - 2 ≠ 5 - (3 - 2)です。"},{"sentence":"Exponentiation is also non-associative, since (2^3)^2 ≠ 2^(3^2).","translation":"指数関数も非結合的であり、(2^3)^2 ≠ 2^(3^2)です。"},{"sentence":"The lack of associativity in certain mathematical operations has significant implications in various fields.","translation":"特定の数学演算における結合性の欠如は、さまざまな分野で重要な意味を持ちます。"}],"collocations":["non-associative operation (非結合的な演算)","lack of non-associativity (非結合性の欠如)","demonstrate non-associativity (非結合性を示す)","prove non-associativity (非結合性を証明する)"],"synonyms":["non-associative property"],"antonyms":["associativity"],"related_terms":["associative","commutative","distributive","operation","mathematics"],"usage_notes":{"explanation":"Non-associativity refers to the property of a mathematical operation where the order in which the operation is performed matters. In simpler terms, if you have an operation denoted by '*' and you're calculating 'a * b * c', it makes a difference whether you calculate '(a * b) * c' or 'a * (b * c)'. If the results are different, the operation is non-associative. Common examples include subtraction, division, and exponentiation. Understanding non-associativity is crucial in fields like algebra, computer science, and physics, where the order of operations can drastically change the outcome.","priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in technical or mathematical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-associativity' is a term used in mathematics and computer science to describe operations where the order of calculations matters. Imagine you have a calculation like 'A * B * C'. If it makes a difference whether you calculate '(A * B) * C' first or 'A * (B * C)' first, then the operation '*' is non-associative. This is different from associative operations like addition and multiplication, where the order doesn't change the result. Examples of non-associative operations include subtraction, division, and exponentiation. Understanding this concept is important for advanced math and programming.","priority":"★★☆"}}],"etymology":{"value":"Formed by adding the prefix 'non-' to 'associativity'. 'Associativity' itself comes from 'associate', reflecting the property of associating or grouping elements in an operation.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌnɒn.əˌsoʊ.ʃi.əˈtɪv.ɪ.ti/","syllables":"non-as-so-ci-a-tiv-i-ty"},"inflection":{"notes":"This is a noun and does not have different inflections."}}