{"word":"antiphony","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"交唱、交唱聖歌、応答歌","english_definition":"A responsive alternation between two groups, especially singers.","examples":[{"sentence":"The choir performed an impressive antiphony.","translation":"聖歌隊は印象的な交唱を披露した。"},{"sentence":"The antiphony created a rich and layered sound.","translation":"交唱は豊かで重層的なサウンドを生み出した。"},{"sentence":"Antiphony is a common feature in many religious traditions.","translation":"交唱は多くの宗教的伝統において一般的な特徴である。"}],"collocations":["perform an antiphony","sing in antiphony","antiphony between choirs","antiphonal singing"],"synonyms":["responsorial","call and response"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from late Latin antiphonia, from Greek antiphōnia, from antiphōnos ‘sounding in response’, from anti ‘opposite’ + phōnē ‘sound’.","priority":"★★☆"},"pronunciation":{"ipa":"/ænˈtɪfəni/","syllables":"an-tiph-o-ny"},"inflection":{"noun_plural":"antiphonies"},"usage_notes":{"explanation":"Antiphony refers to a musical texture where two or more groups of singers or instrumentalists alternate phrases or sections of music. This creates a call-and-response effect, adding depth and interest to the performance. It is commonly found in religious music, particularly in Christian liturgical traditions, but can also be used in other genres. The term can also refer to a specific type of liturgical chant.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The antiphony was very visual.","correct":"✓ The antiphony was very audible.","note":"Antiphony is a musical term, so it relates to sound, not visuals."},{"incorrect":"✗ He played the antiphony on the piano.","correct":"✓ He accompanied the antiphony on the piano.","note":"Antiphony is a style of singing, not a piece of music that can be played on an instrument. An instrument can accompany an antiphony."}],"priority":"★★☆"},"related_words":{"derivatives":["antiphonal (adjective: relating to or resembling antiphony)","antiphon (noun: a short sentence or verse sung by a choir in response during a religious service)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"antiphony\" refers to a specific musical technique where two groups of singers or instruments alternate in a call-and-response manner. It's often used in religious music, especially in Christian traditions. Think of it as a conversation between two musical groups. The word itself comes from Greek, meaning 'sounding in response.' You're unlikely to encounter this word frequently outside of discussions about music or religious practices."},"example_sentences":[{"sentence":"The church choir performed a beautiful **antiphony** during the service.","translation":"教会の聖歌隊は礼拝中に美しい交唱を披露した。","type":"noun","meaning_category":"交唱"},{"sentence":"The use of **antiphony** added a dynamic element to the composition.","translation":"交唱の使用は、作曲にダイナミックな要素を加えた。","type":"noun","meaning_category":"交唱"},{"sentence":"The two choirs engaged in a lively **antiphony**, their voices echoing through the cathedral.","translation":"2つの聖歌隊は活発な交唱を行い、彼らの声は大聖堂に響き渡った。","type":"noun","meaning_category":"交唱"}]}