{"word":"undrillable","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(of rock formations, etc.) not able to be drilled; too hard or otherwise unsuitable for drilling.","english_definition":"Not capable of being drilled, typically due to hardness or geological composition.","examples":[{"sentence":"The shale formation was considered undrillable with conventional methods.","translation":"その頁岩層は、従来の方法では掘削不可能とみなされた。"},{"sentence":"Due to the extreme hardness of the rock, the area was deemed undrillable.","translation":"岩石の極端な硬さのため、その地域は掘削不可能と判断された。"}],"collocations":["undrillable rock","undrillable formation","undrillable area"],"synonyms":["impenetrable","unboreable","non-drillable"],"antonyms":["drillable","penetrable"],"related_words":["drilling","drill","drillability"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the word 'drillable'.","priority":"Medium"},"pronunciation":{"ipa":"/ʌnˈdrɪləbəl/","syllables":"un-drill-a-ble"},"inflection":{},"usage_notes":{"explanation":"The term 'undrillable' is primarily used in geology, mining, and oil and gas industries to describe materials or formations that cannot be effectively or economically drilled using available technologies.","priority":"Medium"},"common_mistakes":{},"level_frequency":{},"readability_explanation":{"level":"Difficult","text":"'Undrillable' means something cannot be drilled. It's used in technical contexts like geology or engineering when talking about rock or other materials that are too hard or unsuitable to drill through."},"example_sentences":[{"sentence":"The basalt layer proved to be undrillable, forcing the team to change their approach.","translation":"玄武岩の層は掘削不可能であることが判明し、チームはアプローチを変更せざるを得なくなった。","type":"General","meaning_category":"Inability to be drilled"},{"sentence":"New technologies are being developed to make previously undrillable formations accessible.","translation":"以前は掘削不可能だった地層にアクセスできるように、新しい技術が開発されている。","type":"General","meaning_category":"Inability to be drilled"}]}