{"word":"Tuberculid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"結核疹：皮膚にできる結核性の病変。結核菌に対する過敏反応によって引き起こされる。","english_definition":"A skin lesion caused by a hypersensitivity reaction to Mycobacterium tuberculosis.","examples":[{"sentence":"The dermatologist suspected a tuberculid based on the appearance of the rash.","translation":"皮膚科医は発疹の外観から結核疹を疑った。"},{"sentence":"Tuberculids are often associated with underlying tuberculosis infection.","translation":"結核疹はしばしば基礎にある結核感染症と関連している。"}],"collocations":["papular tuberculid","lichen scrofulosorum","tuberculid reaction"],"synonyms":["papular eruption","skin tuberculosis"],"antonyms":[]}],"etymology":{"value":"'tubercul(o)-' (結核に関連する) + '-id' (特定の状態や性質を示す接尾辞)","priority":"★☆☆"},"pronunciation":{"ipa":"/tjuːˈbɜːrkjʊlɪd/","syllables":"tu-ber-cu-lid"},"inflection":{"noun_plural":"tuberculids"},"usage_notes":{"explanation":"Tuberculids are skin eruptions that occur as a result of the body's immune response to tuberculosis bacteria. They are not caused by direct infection of the skin by the bacteria, but rather by an allergic or hypersensitivity reaction. Diagnosis often involves ruling out other skin conditions and testing for tuberculosis infection.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tuberculid was caused by direct contact with the bacteria.","correct":"✓ The tuberculid was caused by an immune response to the bacteria.","note":"Tuberculids are caused by an immune reaction, not direct infection."}],"priority":"★☆☆"},"related_words":{"derivatives":["tuberculosis","tubercle","tuberculous"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tuberculid' is a specialized medical term referring to a skin condition resulting from the body's immune response to tuberculosis, rather than direct infection. Understanding this term requires knowledge of medical terminology and immunology. It is not a commonly used word outside of medical contexts."},"example_sentences":[{"sentence":"The patient presented with a papular tuberculid on their face.","translation":"患者は顔面に丘疹状の結核疹を呈した。","type":"medical","meaning_category":"結核疹"},{"sentence":"Diagnosis of a tuberculid requires careful examination and testing to rule out other conditions.","translation":"結核疹の診断には、他の疾患を除外するための注意深い検査と検査が必要である。","type":"medical","meaning_category":"結核疹"}]}