{"word":"Elaterid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"コメツキムシ","english_definition":"A beetle of the family Elateridae, characterized by a mechanism that allows them to flip into the air to right themselves.","examples":[{"sentence":"Elaterids are known for their ability to 'click' and jump.","translation":"コメツキムシは「カチッ」と音を立ててジャンプする能力で知られています。"},{"sentence":"The elaterid larva can be a pest in agricultural fields.","translation":"コメツキムシの幼虫は農地で害虫となることがあります。"}],"collocations":["wireworm (コメツキムシの幼虫)","click beetle (コメツキムシの一般的な呼び方)"],"synonyms":["click beetle"],"antonyms":[]}],"etymology":{"value":"Derived from the family name Elateridae, which comes from the Greek word 'elater' meaning 'driver' or 'beater', referring to the beetle's ability to spring or 'drive' itself into the air.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈlætərɪd/","syllables":"e-lat-er-id"},"inflection":{"noun_plural":"Elaterids"},"usage_notes":{"explanation":"'Elaterid' is the scientific or formal name for beetles in the family Elateridae, commonly known as click beetles. The term is most often used in scientific or technical contexts, whereas 'click beetle' is more common in general conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an elaterid on the garden, it was clicking.","correct":"✓ I saw an elaterid in the garden; it was clicking.","note":"'On' is used for surfaces, 'in' is used for enclosed spaces like a garden."}],"priority":"★☆☆"},"related_words":{"derivatives":["Elateridae (family name)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Elaterid' is a scientific term referring to beetles in the Elateridae family, commonly known as click beetles. It's primarily used in entomology or scientific contexts. Understanding the term helps in identifying and discussing these beetles in a formal or technical setting."},"example_sentences":[{"sentence":"The entomologist studied the elaterid specimens collected from various regions.","translation":"昆虫学者は様々な地域から収集されたコメツキムシの標本を研究した。","type":"noun","meaning_category":"コメツキムシ"},{"sentence":"Elaterid beetles are known for their unique jumping mechanism.","translation":"コメツキムシはその独特な跳躍機構で知られている。","type":"noun","meaning_category":"コメツキムシ"}]}