{"word":"self-weight","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自重","english_definition":"The weight of an object or structure itself, without considering any additional loads or forces.","examples":[{"sentence":"The self-weight of the bridge is a critical factor in its structural design.","translation":"橋の自重は、構造設計において重要な要素です。"},{"sentence":"The engineer calculated the self-weight of the concrete beam to be 500 kilograms.","translation":"技師はコンクリート梁の自重を500キログラムと計算しました。"},{"sentence":"The self-weight of the roof must be supported by the walls.","translation":"屋根の自重は壁によって支えられなければなりません。"}],"collocations":["calculate self-weight (自重を計算する)","consider self-weight (自重を考慮する)","support self-weight (自重を支える)","self-weight loading (自重負荷)"],"synonyms":["dead load","intrinsic weight"],"antonyms":["imposed load","live load","external load"]}],"etymology":{"value":"The term is a compound word formed by combining \"self\" (referring to the object itself) and \"weight\" (the force of gravity acting on the object's mass).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˈweɪt/","syllables":"self-weight"},"inflection":{"noun_plural":"self-weights"},"usage_notes":{"explanation":"\"Self-weight\" is primarily used in engineering, construction, and physics to refer to the weight of a structure or object itself. It is a crucial consideration in structural design, as the structure must be able to support its own weight in addition to any other loads it may experience. It is often contrasted with \"live load\" or \"imposed load,\" which refers to external forces or weights acting on the structure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The self-weight is not important.","correct":"✓ The self-weight is important.","note":"In structural engineering, self-weight is almost always a significant factor. The incorrect example implies it can be ignored, which is usually false."},{"incorrect":"✗ Self-weight is the same as live load.","correct":"✓ Self-weight is different from live load.","note":"Self-weight refers to the weight of the structure itself, while live load refers to external loads. They are distinct concepts."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["dead load","live load","imposed load","structural load","load bearing","stress","strain","structural analysis","finite element analysis"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"self-weight\" is a technical term primarily used in engineering and physics. It refers to the weight of a structure or object itself, as opposed to any external loads. Understanding this term requires a basic understanding of physics and structural mechanics. It is commonly used in contexts where structural integrity and load-bearing capacity are important considerations."},"example_sentences":[{"sentence":"The structural engineer carefully calculated the self-weight of the steel beams.","translation":"構造エンジニアは、鋼鉄製の梁の自重を注意深く計算しました。","type":"noun","meaning_category":"自重"},{"sentence":"The foundation must be strong enough to support the self-weight of the building.","translation":"基礎は、建物の自重を支えるのに十分な強度が必要です。","type":"noun","meaning_category":"自重"},{"sentence":"Ignoring the self-weight of the materials can lead to catastrophic structural failure.","translation":"材料の自重を無視すると、壊滅的な構造的欠陥につながる可能性があります。","type":"noun","meaning_category":"自重"}]}