{"word":"off-corn","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of livestock) fed on food other than corn.","english_definition":"(of livestock) fed on food other than corn.","examples":[{"sentence":"The off-corn fed cattle produced a different flavor of beef.","translation":"トウモロコシ以外の飼料で育てられた牛は、異なる風味の牛肉を生産した。"}],"collocations":["off-corn fed","off-corn diet"],"synonyms":["non-corn fed"],"antonyms":["corn-fed"]}],"etymology":{"value":"Combination of \"off\" (meaning not based on) and \"corn\" (referring to maize, especially as feed for livestock).","priority":"N/A"},"pronunciation":{"ipa":"/ˌɔfˈkɔːrn/","syllables":"off-corn"},"inflection":{"notes":"Adjective, no inflection"},"usage_notes":{"explanation":"This term is primarily used in agricultural contexts to describe animals whose diet does not consist primarily of corn. It is often used to differentiate the quality or flavor of meat produced by these animals.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"The term 'off-corn' is specific to agricultural contexts, particularly in discussions about livestock feeding practices. It is used to indicate that an animal's diet does not primarily consist of corn, which can affect the quality and flavor of the meat produced. Understanding this term requires familiarity with agricultural terminology and livestock management practices."},"example_sentences":[{"sentence":"The farmer decided to switch to an off-corn diet for his pigs to improve the meat quality.","translation":"農家は肉質を改善するために、豚の飼料をトウモロコシ以外のものに切り替えることにした。","type":"adjective","meaning_category":"diet"},{"sentence":"Off-corn beef is often marketed as a healthier alternative to traditional corn-fed beef.","translation":"トウモロコシ以外の飼料で育てられた牛肉は、従来のトウモロコシ飼育牛肉よりも健康的な代替品として販売されることが多い。","type":"adjective","meaning_category":"beef"}]}