{"word":"Akinesis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"無動、運動不能","english_definition":"loss or impairment of voluntary movement.","examples":[{"sentence":"Akinesis is a common symptom of Parkinson's disease.","translation":"無動はパーキンソン病によく見られる症状です。"},{"sentence":"The patient exhibited akinesis in his left arm.","translation":"患者は左腕に無動を示した。"}],"collocations":["exhibit akinesis","akinesis and rigidity"],"synonyms":["immobility","hypokinesia","motor paralysis"],"antonyms":["hyperkinesis","dyskinesia"]}],"etymology":{"value":"From Greek ἀ- (a-, “not”) + κίνησις (kínēsis, “movement”).","priority":"★★★"},"pronunciation":{"ipa":"/ˌeɪkɪˈniːsɪs/","syllables":"A-ki-ne-sis"},"inflection":{"noun_plural":"akinesias"},"usage_notes":{"explanation":"Akinesis refers to the loss or impairment of the power of voluntary movement. It is often associated with neurological disorders such as Parkinson's disease. It differs from paralysis, which is a complete loss of muscle function. Akinesis is more about the difficulty in initiating movement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient had akinesia in his leg, so he couldn't feel anything.","correct":"✓ The patient had akinesis in his leg, so he had difficulty moving it.","note":"Akinesis is a motor problem, not a sensory one. The patient can still feel, but has difficulty moving."}],"priority":"★★☆"},"related_words":{"derivatives":["akinetic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Akinesis' is a technical term used in medicine to describe the loss or impairment of voluntary movement. It's typically encountered in the context of neurological disorders, such as Parkinson's disease, where patients experience difficulty initiating movement. Understanding this term requires a background in medical terminology or neurology."},"example_sentences":[{"sentence":"The doctor noted the patient's akinesis during the neurological examination.","translation":"医師は神経学的検査中に患者の無動に気づいた。","type":"medical","meaning_category":"loss of movement"},{"sentence":"Severe akinesis can significantly impair a person's ability to perform daily tasks.","translation":"重度の無動は、人が日常のタスクを実行する能力を著しく損なう可能性がある。","type":"medical","meaning_category":"impairment of movement"}]}