{"word":"commissaryship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(特に軍隊・刑務所などの)購買部管理官の地位、職務","english_definition":"The position or office of a commissary; the duties of a commissary.","examples":[{"sentence":"He held the commissaryship for several years.","translation":"彼は数年間、購買部管理官の地位にあった。"},{"sentence":"The responsibilities of the commissaryship include managing supplies and provisions.","translation":"購買部管理官の職務には、物資と食料の管理が含まれる。"}],"collocations":["hold a commissaryship","the duties of a commissaryship"],"synonyms":["stewardship","management","superintendence"],"antonyms":[]}],"etymology":{"value":"'Commissary' + '-ship'. 'Commissary' comes from the Latin 'commissarius', meaning 'one to whom something is entrusted'. The suffix '-ship' denotes a state, condition, office, or dignity.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɒmɪˈseriˌʃɪp/","syllables":"com-mis-sar-y-ship"},"inflection":{"noun_plural":"commissaryships"},"usage_notes":{"explanation":"The term 'commissaryship' refers specifically to the role or position of a commissary, often within a military or institutional context. It emphasizes the responsibilities and duties associated with managing supplies, provisions, and sometimes the overall operation of a commissary store.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is working as commissaryship.","correct":"✓ He is working as a commissary.","note":"'Commissaryship' is a noun referring to the position itself, not the person. The person holding the position is a 'commissary'."}],"priority":"★★☆"},"related_words":{"derivatives":["commissary (noun: 購買部、購買部管理者)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'commissaryship' is a specialized term, primarily used in contexts related to military or institutional supply management. It refers to the position or role of a 'commissary,' who is responsible for managing supplies and provisions. Due to its specific usage, it is not commonly encountered in everyday language and is more likely to appear in formal or professional settings related to logistics and administration."},"example_sentences":[{"sentence":"The audit revealed several irregularities during his tenure of the commissaryship.","translation":"監査により、彼の購買部管理官在任中にいくつかの不正が明らかになった。","type":"noun","meaning_category":"position"},{"sentence":"She was appointed to the commissaryship due to her exceptional organizational skills.","translation":"彼女はその並外れた組織力により、購買部管理官に任命された。","type":"noun","meaning_category":"position"}]}