{"word":"outcheated","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人を)出し抜いて不正行為をする、(人を)不正行為で上回る","english_definition":"To surpass someone in cheating; to cheat someone more effectively than they cheat you.","examples":[{"sentence":"He thought he could cheat on the exam, but someone outcheated him and got a better score.","translation":"彼は試験で不正行為ができると思ったが、誰かが出し抜いて不正行為をし、より良い点を取った。"},{"sentence":"The company outcheated its competitors by using illegal accounting practices.","translation":"その会社は違法な会計処理を用いて競合他社を出し抜いた。"}],"collocations":["outcheat someone in a game (ゲームで誰かを出し抜く)","outcheat the system (システムを出し抜く)"],"synonyms":["deceive","defraud","swindle","trick","outsmart"],"antonyms":["be honest","play fair"]}],"etymology":{"value":"Derived from the verb 'cheat' with the prefix 'out-', indicating surpassing or exceeding in a particular action.","priority":"★★★"},"pronunciation":{"ipa":"/ˌaʊtˈtʃiːtɪd/","syllables":"out-cheat-ed"},"inflection":{"verb_forms":{"present_simple":["outcheat","outcheats"],"past_simple":"outcheated","past_participle":"outcheated","present_participle":"outcheating"}},"usage_notes":{"explanation":"'Outcheated' implies not only cheating but doing it better or more successfully than someone else. It suggests a competitive element in the act of cheating.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He outcheated to win the game.","correct":"✓ He outcheated his opponent to win the game.","note":"'Outcheat' is a transitive verb, so it requires a direct object (the person being cheated)."},{"incorrect":"✗ She was outcheated by the system.","correct":"✓ She was outcheated by him.","note":"'Outcheated' requires a person as the subject and a person as the object. If a system is involved, it is usually the object of the cheating, not the agent doing the cheating."}],"priority":"★★☆"},"related_words":{"derivatives":["outcheating (noun/adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - not a common word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Outcheated' is a relatively uncommon word that means to cheat someone more effectively than they cheat you. The word is formed by adding the prefix 'out-' to the verb 'cheat', indicating that the action of cheating is done to a greater degree or more successfully than someone else. This word is typically used in contexts where there is a competition or rivalry, and someone gains an unfair advantage by cheating more effectively than their opponent. Because it is not a common word, it is more likely to be encountered in advanced or specialized texts."},"example_sentences":[{"sentence":"The experienced gambler outcheated the novice at every turn.","translation":"その経験豊富なギャンブラーは、あらゆる場面で初心者を出し抜いて不正行為をした。","type":"verb","meaning_category":"不正行為で上回る"},{"sentence":"Despite his best efforts, he was outcheated by a more cunning player.","translation":"彼の最善の努力にもかかわらず、彼はより狡猾なプレイヤーに出し抜かれた。","type":"verb","meaning_category":"不正行為で上回る"}]}