{"word":"non-transitioning","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(人について)性別移行を行っていない、または完了していない","english_definition":"(of a person) not undergoing or having completed gender transition.","examples":[{"sentence":"The organization provides support for both transitioning and non-transitioning transgender individuals.","translation":"その組織は、性別移行中のトランスジェンダーの人々と、性別移行を行っていないトランスジェンダーの人々の両方を支援しています。"},{"sentence":"Some non-transitioning trans people choose not to undergo medical or surgical interventions.","translation":"性別移行を行わないトランスジェンダーの人の中には、医学的または外科的介入を受けないことを選択する人もいます。"},{"sentence":"It's important to respect the identities and choices of all transgender people, whether they are transitioning or non-transitioning.","translation":"性別移行しているか否かにかかわらず、すべてのトランスジェンダーの人々のアイデンティティと選択を尊重することが重要です。"}],"collocations":["non-transitioning trans person","non-transitioning transgender individual","non-transitioning trans community"],"synonyms":["pre-transition","not transitioning","non-operative"],"antonyms":["transitioning","post-transition"],"notes":"This term is often used within the transgender community to describe individuals who identify as transgender but do not wish to undergo medical or surgical transition, or who are not yet in the process of transitioning.  It is important to use this term respectfully and avoid making assumptions about a person's identity or experiences."}],"etymology":{"value":"Formed by adding the prefix \"non-\" (meaning \"not\") to the word \"transitioning\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.trænˈzɪʃənɪŋ/","syllables":"non-tran-si-tion-ing"},"inflection":{"notes":"This is an adjective, so it does not have typical verb inflections. It can be used to modify nouns."},"usage_notes":{"explanation":"The term \"non-transitioning\" is used to describe transgender individuals who do not pursue medical or surgical interventions to align their physical appearance with their gender identity. This can be for various reasons, including personal preference, financial constraints, health concerns, or lack of access to appropriate medical care. It's crucial to recognize that being non-transitioning does not make someone any less transgender. Their gender identity is valid regardless of whether they undergo any physical changes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ All transgender people are transitioning.","correct":"✓ Some transgender people are transitioning, while others are non-transitioning.","note":"It's a harmful stereotype to assume that all transgender people want to or are able to transition medically or surgically. Many factors influence an individual's decision to transition or not. "},{"incorrect":"✗ Non-transitioning trans people are not 'real' trans people.","correct":"✓ Non-transitioning trans people are just as valid as transitioning trans people.","note":"A person's gender identity is valid regardless of whether they transition or not. This is a common misconception that needs to be addressed."}],"priority":"★★☆"},"related_words":{"derivatives":["transitioning","transgender","gender identity","gender expression","gender dysphoria"],"phrases":["gender affirming care","medical transition","surgical transition","social transition"],"priority":"★★☆"},"level_frequency":{"notes":"This term is relatively new and specific to discussions within the transgender community and related fields. It is not a common word in general English usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"non-transitioning\" refers to a person who identifies as transgender but does not undergo medical or surgical procedures to change their physical characteristics to align with their gender identity. This term is often used in discussions about transgender issues and is important to understand in the context of respecting diverse experiences within the transgender community. It is crucial to avoid making assumptions about a person's identity or experiences based on whether they are transitioning or not.","priority":"★★☆"},"example_sentences":[{"sentence":"Many non-transitioning trans individuals still experience gender dysphoria.","translation":"性別移行を行わない多くのトランスジェンダーの人々も、依然として性別違和を経験しています。","type":"adjective","meaning_category":"性別移行を行っていない"},{"sentence":"Support groups can be beneficial for both transitioning and non-transitioning members of the trans community.","translation":"サポートグループは、トランスコミュニティの性別移行しているメンバーと性別移行していないメンバーの両方にとって有益です。","type":"adjective","meaning_category":"性別移行を行っていない"},{"sentence":"Respecting the choices of non-transitioning trans people is essential for creating a more inclusive society.","translation":"性別移行を行わないトランスジェンダーの人々の選択を尊重することは、より包括的な社会を創造するために不可欠です。","type":"adjective","meaning_category":"性別移行を行っていない"}]}