{"word":"sonometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"音波の周波数を測定する装置。張力、長さ、および既知の密度を持つ弦またはワイヤーの振動周波数と音速の関係を研究するためにも使用される。","english_definition":"An apparatus for studying the relationship between the frequency of a vibrating string or wire and its tension, length, and density. It is also used to measure the frequency of sound waves.","examples":[{"sentence":"The student used a sonometer to determine the speed of sound in the wire.","translation":"学生はソノメーターを使用して、ワイヤー内の音速を測定した。"},{"sentence":"By adjusting the tension on the sonometer, we can observe how the frequency changes.","translation":"ソノメーターの張力を調整することで、周波数がどのように変化するかを観察できる。"}],"collocations":["use a sonometer","adjust the sonometer","sonometer experiment"],"synonyms":["frequency meter","vibration apparatus"],"antonyms":[]}],"etymology":{"value":"'sono-' (sound) + '-meter' (measuring device)","priority":"★★★"},"pronunciation":{"ipa":"/səˈnɒmɪtər/","syllables":"so-nom-e-ter"},"inflection":{"noun_plural":"sonometers"},"usage_notes":{"explanation":"A sonometer is a scientific instrument used to demonstrate the relationships between frequency, tension, length, and mass per unit length in a vibrating string. It's often used in physics education.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sonometer measures volume.","correct":"✓ The sonometer measures frequency.","note":"A sonometer measures the frequency of sound waves or vibrating strings, not volume."}],"priority":"★★☆"},"related_words":{"derivatives":["sonometry (noun: the use of a sonometer)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sonometer' refers to a specialized physics instrument. Understanding its function requires knowledge of acoustics and wave mechanics, making it suitable for advanced learners. The concept involves manipulating variables like tension and length to observe changes in frequency, which is a complex scientific principle."},"example_sentences":[{"sentence":"The physics lab had a sonometer for acoustic experiments.","translation":"物理学の研究室には、音響実験用のソノメーターがあった。","type":"noun","meaning_category":"apparatus"},{"sentence":"The sonometer allowed precise measurement of the string's vibrational frequency.","translation":"ソノメーターにより、弦の振動周波数を正確に測定できた。","type":"noun","meaning_category":"apparatus"}]}