{"word":"non-viscosifiable","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"Not capable of being made viscous; not able to have its viscosity increased.","english_definition":"Describing a substance or mixture that cannot be thickened or made more viscous.","examples":[{"sentence":"This particular oil is non-viscosifiable, even with the addition of polymers.","translation":"この特定のオイルは、ポリマーを添加しても粘性を高めることができません。"},{"sentence":"The solution remained watery and non-viscosifiable despite our efforts.","translation":"私たちの努力にもかかわらず、その溶液は水っぽいままで、粘性を高めることができませんでした。"}],"collocations":["non-viscosifiable liquid","non-viscosifiable oil","non-viscosifiable solution"],"synonyms":["unthickenable","non-thickening"],"antonyms":["viscosifiable","thickenable"],"related_terms":["viscosity","viscous","viscosify"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'viscosifiable'. 'Viscosifiable' is derived from 'viscosity' (the state of being thick, sticky, and semifluid in consistency, due to internal friction) and the suffix '-able' (meaning 'capable of').","priority":"medium"},"pronunciation":{"ipa":"/nɒnˌvɪskɒsɪˈfaɪəbəl/","syllables":"non-vis-cos-i-fi-a-ble"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Non-viscosifiable' is a technical term primarily used in chemistry, food science, and engineering to describe substances that resist thickening. It indicates an inherent property of the material that prevents an increase in viscosity through typical methods such as adding thickeners or changing temperature.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"The water is nonviscosifiable.","correct":"The water is non-viscosifiable.","note":"Hyphen is needed for clarity."}],"priority":"low"},"level_frequency":{"frequency_google_ngram":"Very low frequency - primarily used in technical contexts.","priority":"low"},"readability_explanation":{"level":"C2","text":"The term 'non-viscosifiable' is a highly specialized term, primarily encountered in scientific or technical contexts related to chemistry, food science, or engineering. Understanding this term requires familiarity with the concept of viscosity and the ability to interpret complex scientific vocabulary. It is unlikely to be encountered in general usage."},"example_sentences":[{"sentence":"The new formulation was designed to be non-viscosifiable at high temperatures.","translation":"その新しい製剤は、高温で粘性を高めることができないように設計されました。","type":"technical","meaning_category":"incapable of thickening"},{"sentence":"The solvent's non-viscosifiable nature made it ideal for cleaning sensitive equipment.","translation":"その溶媒の粘性を高めることができない性質により、デリケートな機器の洗浄に最適でした。","type":"technical","meaning_category":"incapable of thickening"}]}