{"word":"stanged","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(古語) (過去形・過去分詞) stang (棒) で打つ、罰として棒に縛り付ける","english_definition":"(archaic) past tense and past participle of 'stang': to beat with a stang; to punish by tying to a stang.","examples":[{"sentence":"He was stanged for his crimes.","translation":"彼は罪を犯したため、棒に縛り付けられて罰せられた。"}],"collocations":[],"synonyms":["beaten","flogged","punished"],"antonyms":[]}],"etymology":{"value":"'Stanged' is the past tense and past participle of the verb 'stang', which is derived from the noun 'stang', an old English word for a pole or rod. The verb 'stang' meant to beat or punish someone using a pole.","priority":"★★★"},"pronunciation":{"ipa":"/stæŋd/","syllables":"stanged (1 syllable)"},"inflection":{"verb_forms":{"present_simple":["stang"],"past_simple":["stanged"],"past_participle":["stanged"],"present_participle":["stanging"]}},"usage_notes":{"explanation":"The word 'stanged' is an archaic form, meaning it is no longer in common use. It is primarily encountered in historical contexts or literature that seeks to evoke a sense of the past. The verb relates to a specific form of punishment involving a 'stang', which was a pole or rod.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["stang (noun): a pole or rod","stanging (noun): the act of punishing with a stang"],"related_terms":[]},"level_frequency":{"CEFR":"N/A (archaic)","frequency_google_ngram":"Extremely low frequency - an archaic term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Stanged' is an archaic term, rarely used in modern English. It refers to the act of punishing someone by tying them to a 'stang' (a pole or rod) and beating them. Due to its historical and specialized usage, it is unlikely to be encountered outside of specific historical or literary contexts."},"example_sentences":[{"sentence":"In the old village, offenders were often stanged publicly.","translation":"古い村では、違反者はしばしば公衆の面前で棒に縛り付けられて罰せられた。","type":"verb","meaning_category":"罰する"}]}