{"word":"EUNET","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"European Unix Network (ヨーロッパのUnixネットワーク)","english_definition":"A defunct wide area network in Europe based on the Unix operating system. It was one of the first large-scale computer networks in Europe, predating the widespread adoption of the Internet.","examples":[{"sentence":"EUNET played a significant role in the development of the Internet in Europe.","translation":"EUNETはヨーロッパにおけるインターネットの発展に重要な役割を果たしました。"},{"sentence":"Before the Internet, many European researchers relied on EUNET for communication and data transfer.","translation":"インターネット以前は、多くのヨーロッパの研究者がEUNETを通信やデータ転送に利用していました。"}],"collocations":["EUNET connection","EUNET mail","EUNET infrastructure"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'EUNET' is an abbreviation of 'European Unix Network', reflecting its focus on Unix-based systems and its geographical scope.","priority":"★★★"},"pronunciation":{"ipa":"ˈjuːnɛt","syllables":"EU-NET"},"inflection":{},"usage_notes":{"explanation":"EUNET is primarily a historical term referring to a specific network that existed in the early days of computer networking in Europe. It is not commonly used in contemporary contexts except when discussing the history of the Internet.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Usenet (a similar network that predated EUNET)","Internet"],"related_networks":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (historical context only)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"EUNET is a historical term referring to an early European computer network based on Unix. Understanding its significance requires knowledge of the history of the Internet and computer networking. It is not a commonly used term in modern contexts.","requires_background_knowledge":true},"example_sentences":[{"sentence":"EUNET provided a crucial infrastructure for early email communication in Europe.","translation":"EUNETはヨーロッパにおける初期の電子メール通信に不可欠なインフラを提供しました。","type":"descriptive","meaning_category":"historical context"},{"sentence":"The transition from EUNET to the Internet involved significant upgrades to network infrastructure.","translation":"EUNETからインターネットへの移行には、ネットワークインフラの大幅なアップグレードが必要でした。","type":"historical","meaning_category":"transition"}]}