{"word":"Colonisationist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"植民地主義者、植民地拡張論者","english_definition":"A supporter or advocate of colonisation; someone who believes in or promotes the establishment of colonies.","examples":[{"sentence":"The colonisationists argued that establishing colonies would bring economic benefits to the mother country.","translation":"植民地主義者たちは、植民地を設立することが本国に経済的利益をもたらすと主張した。"},{"sentence":"Many colonisationists were motivated by a desire to spread their culture and religion.","translation":"多くの植民地主義者は、自らの文化や宗教を広めたいという願望に動機づけられていた。"}],"collocations":["colonisationist policies","colonisationist ideology","become a colonisationist"],"synonyms":["imperialist","expansionist","colonialist"],"antonyms":["anti-colonialist","decolonisationist"]}],"etymology":{"value":"The word 'colonisationist' is derived from 'colonisation' (the act of establishing a colony) + '-ist' (a suffix denoting a person who supports or practices something).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɒlənaɪˈzeɪʃənɪst/","syllables":"co-lo-ni-sa-tion-ist"},"inflection":{"noun_plural":"Colonisationists"},"usage_notes":{"explanation":"The term 'colonisationist' is often used critically, particularly in historical contexts, to describe individuals who supported or participated in the establishment and maintenance of colonial empires. It is important to note that the term carries negative connotations due to the exploitative and oppressive nature of colonialism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a strong supporter of colonisation, so he was a colonist.","correct":"✓ He was a strong supporter of colonisation, so he was a colonisationist.","note":"A 'colonist' is someone who lives in a colony, while a 'colonisationist' is someone who supports the idea of colonisation."}],"priority":"★★☆"},"related_words":{"derivatives":["colonisation","colonise","colonist","colonial"],"related_concepts":["colonialism","imperialism","decolonisation"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'colonisationist' is a relatively uncommon term used to describe someone who supports the practice of colonisation. It is most frequently encountered in historical or political discussions about colonialism and its legacy. The word carries negative connotations due to the historical exploitation and oppression associated with colonisation."},"example_sentences":[{"sentence":"The colonisationist believed that European powers had a right to control other territories.","translation":"その植民地主義者は、ヨーロッパ列強が他の領土を支配する権利を持っていると信じていた。","type":"noun","meaning_category":"supporter of colonisation"},{"sentence":"Historians often debate the motivations of colonisationists in the 19th century.","translation":"歴史家はしばしば、19世紀の植民地主義者の動機について議論する。","type":"noun","meaning_category":"supporter of colonisation"}]}