{"word":"cold-conducting","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"熱伝導性の低い、断熱性の高い","english_definition":"Having low thermal conductivity; insulating against heat.","examples":[{"sentence":"The material is cold-conducting, making it ideal for use in refrigerators.","translation":"その素材は熱伝導性が低いため、冷蔵庫での使用に最適です。"},{"sentence":"Cold-conducting materials are used to prevent heat loss in buildings.","translation":"断熱性の高い素材は、建物内の熱損失を防ぐために使用されます。"}],"collocations":["cold-conducting material","cold-conducting property"],"synonyms":["heat-insulating","thermally insulating","non-conducting"],"antonyms":["heat-conducting","thermally conductive"],"notes":"This term is less common than 'heat-insulating' or 'thermally insulating', but it is used to describe materials that do not conduct heat well, effectively keeping the cold in or the heat out."}],"etymology":{"value":"Derived from 'cold' and 'conducting', indicating a material's ability to conduct cold (or rather, its inability to conduct heat).","priority":"N/A"},"pronunciation":{"ipa":"/ˌkoʊld kənˈdʌktɪŋ/","syllables":"cold-con-duct-ing"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Cold-conducting' is used to describe materials that are poor conductors of heat. It is often used interchangeably with 'heat-insulating' or 'thermally insulating'. The term emphasizes the material's ability to prevent heat transfer, rather than its ability to conduct cold.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The metal is cold-conducting.","correct":"The metal is heat-conducting.","note":"Metals are generally good conductors of heat, not insulators. Therefore, 'heat-conducting' would be more appropriate."}],"priority":"N/A"},"related_words":{"derivatives":["conductivity (名詞: 伝導性)","conductive (形容詞: 伝導性の)","insulator (名詞: 絶縁体)","insulation (名詞: 絶縁)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Cold-conducting' describes materials that are poor conductors of heat, meaning they prevent heat from flowing through them easily. It's a less common way to say 'heat-insulating' or 'thermally insulating'. You would use this term when discussing the properties of materials used to keep things cold, like in refrigerators or in building insulation."},"example_sentences":[{"sentence":"The walls are made of a cold-conducting material to keep the house cool in the summer.","translation":"壁は断熱性の高い素材でできているので、夏でも家の中を涼しく保つことができます。","type":"adjective","meaning_category":"断熱性"},{"sentence":"This cold-conducting foam is used in coolers to maintain a low temperature.","translation":"この断熱フォームは、クーラーボックス内で低温を維持するために使用されます。","type":"adjective","meaning_category":"断熱性"}]}