{"word":"self-suggested","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"自己暗示による、自己暗示的な","english_definition":"Suggested or originating from one's own mind; resulting from self-suggestion.","examples":[{"sentence":"Her confidence seemed self-suggested, as if she had convinced herself of her abilities.","translation":"彼女の自信は自己暗示によるもののように見えた。まるで自分の能力を信じ込ませたかのようだった。"},{"sentence":"The calmness he displayed was self-suggested, a way to cope with the stressful situation.","translation":"彼が見せた冷静さは自己暗示によるもので、ストレスの多い状況に対処する方法だった。"}],"collocations":["self-suggested idea","self-suggested calmness","self-suggested confidence"],"synonyms":["autosuggestive","self-induced","internally generated"],"antonyms":["externally suggested","other-suggested","imposed"]}],"etymology":{"value":"Formed by combining \"self-\" (referring to oneself) and \"suggested\" (past participle of \"suggest,\" meaning to put forward for consideration). Thus, \"self-suggested\" means suggested by oneself to oneself.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌself.səˈdʒestɪd/","syllables":"self-sug-gest-ed"},"inflection":{"notes":"Adjective; does not have comparative or superlative forms."},"usage_notes":{"explanation":"\"Self-suggested\" typically describes an idea, feeling, or behavior that originates within a person's own mind, often through a process of self-persuasion or autosuggestion. It implies that the individual has actively influenced their own mental state or actions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a self-suggested dream.","correct":"✓ He had a vivid dream. / ✓ He had a dream that felt very real.","note":"Dreams are not typically described as self-suggested. Use alternative phrasing. 'Self-suggested' implies a conscious effort to influence one's own mind, which doesn't usually apply to dreams."},{"incorrect":"✗ The problem was self-suggested by the computer.","correct":"✓ The computer identified the problem itself.","note":"'Self-suggested' applies to conscious beings. Use 'identified' or similar verbs for inanimate objects."}],"priority":"★★☆"},"related_words":{"derivatives":["self-suggestion (noun: the act of suggesting something to oneself)","suggest (verb: to put forward for consideration)","suggestion (noun: an idea or plan put forward for consideration)"],"phrasal_verbs":[],"related_concepts":["autosuggestion","self-hypnosis","affirmation","positive thinking"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"self-suggested\" is relatively uncommon and is used to describe something that originates from one's own mind through a process of self-influence or autosuggestion. It is most frequently found in psychological or philosophical contexts. Understanding the meaning of \"self-\" and \"suggested\" is key to grasping the term's meaning."},"example_sentences":[{"sentence":"The artist claimed that the inspiration for his painting was entirely self-suggested.","translation":"その芸術家は、彼の絵のインスピレーションは完全に自己暗示によるものだと主張した。","type":"adjective","meaning_category":"Originating from one's own mind"},{"sentence":"Her optimistic outlook was largely self-suggested, helping her overcome challenges.","translation":"彼女の楽観的な見方は主に自己暗示によるもので、困難を乗り越えるのに役立った。","type":"adjective","meaning_category":"Resulting from self-suggestion"}]}