{"word":"Meltons","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of thick, dense wool fabric, often used for coats.","english_definition":"A heavily felted, plain woven cloth of wool or wool blend, napped and sheared to produce a smooth, close face.","examples":[{"sentence":"The coat was made of fine Meltons wool.","translation":"そのコートは上質なメルトンウールで作られていた。"}],"collocations":["Meltons cloth","Meltons wool coat"],"synonyms":["wool","heavy cloth"],"antonyms":[]}],"etymology":{"value":"Named after Melton Mowbray, a town in Leicestershire, England, known for its hunting and riding attire, where the fabric was first produced.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɛltənz/","syllables":"Mel-tons"},"inflection":{"noun_plural":"Meltons (plural form is rarely used, as it usually refers to the fabric in general.)"},"usage_notes":{"explanation":"'Meltons' refers to the fabric itself, not necessarily multiple items. It's similar to saying 'cottons' when referring to multiple types of cotton fabric, but it's less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a Meltons.","correct":"✓ I bought some Meltons fabric. / ✓ I bought a Meltons coat.","note":"'Meltons' is a fabric, so you would buy 'Meltons fabric' or an item made of Meltons, like a coat."}],"priority":"★★☆"},"related_words":{"derivatives":["Melton (singular form)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Meltons' refers to a specific type of durable wool fabric. It is a niche term, primarily used in the context of clothing manufacturing or textile discussions. Understanding this word requires some familiarity with fabrics and their properties."},"example_sentences":[{"sentence":"The tailor recommended using Meltons for its durability.","translation":"仕立て屋はその耐久性からメルトンを使うことを勧めた。","type":"noun","meaning_category":"fabric"},{"sentence":"This winter, I plan to purchase a warm Meltons coat.","translation":"この冬は暖かいメルトンコートを買う予定だ。","type":"noun","meaning_category":"fabric"}]}