{"word":"neurorthopterous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(昆虫学) アミメカゲロウ目に属する","english_definition":"(entomology) Belonging or pertaining to the order Neuroptera.","examples":[{"sentence":"A neurorthopterous insect has delicate, net-veined wings.","translation":"アミメカゲロウ目の昆虫は、繊細な網状の翅を持つ。"}],"collocations":["neurorthopterous insect","neurorthopterous wing"],"synonyms":["neuropteran"],"antonyms":[]}],"etymology":{"value":"From the combination of 'neuro-' (referring to nerves or veins), 'ortho-' (meaning straight or aligned), and '-pterous' (meaning winged). This refers to the net-veined wings characteristic of insects in the order Neuroptera.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnjʊərɔːrˈθɒptərəs/","syllables":"neu-ror-thop-ter-ous"},"inflection":{"notes":"Adjective, no plural form"},"usage_notes":{"explanation":"The term 'neurorthopterous' is primarily used in entomology to describe insects belonging to the order Neuroptera, which includes lacewings, antlions, and mantidflies. These insects are characterized by their delicate, net-veined wings. The term is relatively technical and not commonly used outside of scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The neurorthopterous is flying.","correct":"✓ A neurorthopterous insect is flying.","note":"'Neurorthopterous' is an adjective, so it must be used to describe a noun, such as 'insect'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Neuroptera (noun: the order of insects to which neurorthopterous insects belong)","neuropteran (noun/adjective: a member of or pertaining to the order Neuroptera)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (scientific vocabulary)","frequency_google_ngram":"Very low frequency - primarily used in scientific literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'neurorthopterous' is a highly technical adjective used in the field of entomology to describe insects belonging to the order Neuroptera. Due to its specialized nature, it is unlikely to be encountered outside of scientific or academic contexts related to insect biology. Understanding this term requires familiarity with entomological terminology and the classification of insects.","priority":"★☆☆"},"example_sentences":[{"sentence":"The scientist studied the neurorthopterous insects in the rainforest.","translation":"科学者は熱帯雨林に生息するアミメカゲロウ目の昆虫を研究した。","type":"adjective","meaning_category":"descriptive"},{"sentence":"Neurorthopterous wings are characterized by their intricate vein patterns.","translation":"アミメカゲロウ目の翅は、複雑な翅脈のパターンによって特徴づけられる。","type":"adjective","meaning_category":"descriptive"}]}