{"word":"non-gelling","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ゲル化しない、ゼリー状にならない","english_definition":"Not forming a gel; remaining in a liquid state.","examples":[{"sentence":"This type of starch is non-gelling, making it suitable for certain applications.","translation":"このタイプのデンプンはゲル化しないため、特定の用途に適しています。"},{"sentence":"The non-gelling properties of the solution prevent it from solidifying.","translation":"その溶液の非ゲル化特性により、固化を防ぎます。"}],"collocations":["non-gelling starch (ゲル化しないデンプン)","non-gelling solution (ゲル化しない溶液)"],"synonyms":["non-solidifying","liquid","fluid"],"antonyms":["gelling","solidifying","gelatinous"]}],"etymology":{"value":"\"non-\" (否定) + \"gelling\" (ゲル化する)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈdʒɛlɪŋ/","syllables":"non-gel-ling"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"Non-gelling\" describes a substance that does not form a gel under normal conditions. This property is often desirable in certain food products, cosmetics, and industrial applications where a liquid or fluid consistency is required. The term is the opposite of \"gelling,\" which describes a substance that does form a gel.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-gelling is used in this recipe.","correct":"✓ A non-gelling agent is used in this recipe.","note":"\"Non-gelling\" is an adjective and needs to be used to describe a noun.  It cannot stand alone as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["gel (名詞/動詞: ゲル、ゲル化する)","gelling (形容詞: ゲル化する)","gelatin (名詞: ゼラチン)","gelatinous (形容詞: ゼラチン質の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Non-gelling\" is a technical term used to describe substances that do not form a gel. It's often used in scientific or industrial contexts, such as food science or chemistry. If you encounter this word, it's likely in a discussion about the properties of a specific material or substance.","priority":"★★☆"},"example_sentences":[{"sentence":"The modified starch was specifically designed to be **non-gelling** even at high concentrations.","translation":"その加工デンプンは、高濃度でもゲル化しないように特別に設計されました。","type":"adjective","meaning_category":"ゲル化しない"},{"sentence":"The **non-gelling** nature of the polymer makes it suitable for use as a lubricant.","translation":"そのポリマーの非ゲル化性により、潤滑剤として使用するのに適しています。","type":"adjective","meaning_category":"ゲル化しない"}]}