{"word":"Confucian-sympathetic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"儒教に共感的な、儒教に理解を示す","english_definition":"Having or showing sympathy or understanding towards Confucianism.","examples":[{"sentence":"The scholar was known for his Confucian-sympathetic views on governance.","translation":"その学者は、政治に対する儒教に共感的な見解で知られていた。"},{"sentence":"The government adopted a Confucian-sympathetic approach to social issues.","translation":"政府は社会問題に対して儒教に理解を示すアプローチを採用した。"}],"collocations":["Confucian-sympathetic scholar","Confucian-sympathetic government","Confucian-sympathetic policy"],"synonyms":["pro-Confucian","Confucian-leaning","Confucian-friendly"],"antonyms":["anti-Confucian","Confucian-opposed","Confucian-critical"]}],"etymology":{"value":"Combination of \"Confucian\" (relating to Confucius or Confucianism) and \"sympathetic\" (feeling, showing, or expressing sympathy).","priority":"☆☆☆"},"pronunciation":{"ipa":"/kənˌfjuːʃən sɪmˈpæθɛtɪk/","syllables":"con-fu-cian sym-pa-thet-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term \"Confucian-sympathetic\" is used to describe individuals, groups, or policies that demonstrate a favorable attitude towards Confucianism. This can involve supporting Confucian values, principles, or practices.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Confucian sympathetic.","correct":"✓ He is Confucian-sympathetic.","note":"\"Confucian-sympathetic\" is an adjective and should be used to modify a noun. The article 'a' is not needed before the adjective unless it is followed by a noun."}],"priority":"☆☆☆"},"related_words":{"derivatives":["Confucianism","sympathy","sympathetic"],"related_terms":["Neo-Confucianism","Legalism","Taoism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Confucian-sympathetic\" is a niche term used in academic or specialized contexts to describe someone or something that aligns with or supports Confucian principles. Understanding requires familiarity with Confucianism."},"example_sentences":[{"sentence":"The emperor's policies were largely Confucian-sympathetic, emphasizing filial piety and social harmony.","translation":"皇帝の政策は概ね儒教に共感的であり、孝と社会の調和を重視していた。","type":"adjective","meaning_category":"Showing sympathy towards Confucianism"},{"sentence":"The modern interpretation of Confucianism is often Confucian-sympathetic, adapting traditional values to contemporary society.","translation":"現代の儒教の解釈は、伝統的な価値観を現代社会に適応させる、儒教に共感的なものであることが多い。","type":"adjective","meaning_category":"Understanding towards Confucianism"}]}