{"word":"sub-man","priority":"low","meanings":[{"part_of_speech":"noun","definition":"(SFなどで)人間以下の存在、劣等人種、下等人間","english_definition":"(science fiction) a being considered less than human, often due to genetic mutation or social status; an inferior human being.","examples":[{"sentence":"The dictator viewed certain ethnic groups as sub-men.","translation":"その独裁者は特定の民族集団を劣等人種とみなした。"},{"sentence":"In the dystopian novel, the sub-men were forced to live in the sewers.","translation":"そのディストピア小説では、下等人間は下水道に住むことを強制された。"}],"collocations":["sub-man society","sub-man species","genetic sub-man"],"synonyms":["inferior being","underling","lesser human","degenerate"],"antonyms":["superman","superior being","elite"],"usage_notes":"This term is often used in science fiction or dystopian literature to describe a dehumanized group. It can also be used in a derogatory way to refer to people considered socially or intellectually inferior. Due to its potential for misuse and association with discriminatory ideologies, it should be used with caution.","etymology":"The term is formed by combining the prefix \"sub-\" (meaning \"below\" or \"less than\") with the noun \"man.\" It implies a being that is below the standard of what is considered fully human.","level_frequency":{"frequency_google_ngram":"Very low frequency","CEFR":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'sub-man' is rarely used in contemporary English outside of specific literary or philosophical contexts. Its usage often carries negative connotations, particularly in discussions of social hierarchy or eugenics. As such, it is important to approach this term with sensitivity and awareness of its potential to offend."}}],"pronunciation":{"ipa":"/ˈsʌbˌmæn/","syllables":"sub-man"},"inflection":{"noun_plural":"sub-men"},"common_mistakes":{"examples":[{"incorrect":"He is a subman in the company.","correct":"He is a subordinate in the company.","note":"'Sub-man' is not a common term for a subordinate. Use 'subordinate' instead."}]},"related_words":{"derivatives":["subhuman","superman"]}}