{"word":"homospecific","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"同じ種に特有の、同種間の","english_definition":"Relating to or characteristic of members of the same species.","examples":[{"sentence":"Homospecific aggression is common in many animal species.","translation":"同種間の攻撃性は多くの動物種において一般的である。"},{"sentence":"Homospecific interactions can be cooperative or competitive.","translation":"同種間の相互作用は協調的または競争的でありうる。"}],"collocations":["homospecific competition","homospecific interaction","homospecific aggression","homospecific mating"],"synonyms":["intraspecific"],"antonyms":["heterospecific"]},{"part_of_speech":"adjective","definition":"（免疫学において）同じ種由来の抗原または抗体に対する","english_definition":"(Immunology) Directed against antigens or antibodies from the same species.","examples":[{"sentence":"The homospecific antibody reacted strongly with the human cells.","translation":"その同種特異的抗体はヒト細胞と強く反応した。"}],"collocations":["homospecific antibody","homospecific antigen"],"synonyms":[],"antonyms":["heterospecific"]}],"etymology":{"value":"'Homo-' (same) + 'specific' (relating to a species).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhoʊmoʊspəˈsɪfɪk/","syllables":"ho-mo-spe-ci-fic"},"inflection":{"notes":"Does not inflect; adjective only."},"usage_notes":{"explanation":"'Homospecific' refers to something that is specific to or occurs within the same species. It is commonly used in biology, ecology, and immunology to describe interactions, behaviors, or reactions that occur between members of the same species. It is the opposite of 'heterospecific,' which refers to interactions or reactions between different species.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The homospecific group consisted of different species.","correct":"The homospecific group consisted of the same species.","note":"'Homospecific' means 'same species,' so the group must consist of members of the same species."}],"priority":"★★☆"},"related_words":{"derivatives":["homospecifically"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Homospecific' is a technical term used in scientific contexts, particularly in biology and ecology. It describes something that is specific to, or occurs between, members of the same species. Understanding this term requires familiarity with scientific vocabulary and concepts related to species interactions and classifications. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The study examined the effects of homospecific competition on plant growth.","translation":"その研究では、植物の成長に対する同種間競争の影響を調べた。","type":"general","meaning_category":"ecology"},{"sentence":"The homospecific antibodies were used to identify the target cells.","translation":"その同種特異的抗体は、標的細胞を特定するために使用された。","type":"immunology","meaning_category":"immunology"}]}