{"word":"soon-sated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"すぐに満足する、すぐに飽きる","english_definition":"easily satisfied or quickly bored; having a short attention span or low threshold for stimulation.","examples":[{"sentence":"The soon-sated child quickly lost interest in the new toy.","translation":"すぐに飽きる子供は、新しいおもちゃにすぐに興味を失った。"},{"sentence":"He was a soon-sated traveler, always seeking new and exciting destinations.","translation":"彼はすぐに飽きる旅行者で、常に新しく刺激的な目的地を探していた。"},{"sentence":"The critic described the audience as soon-sated, demanding constant novelty.","translation":"評論家は、聴衆をすぐに飽きる、常に目新しさを求める人々と評した。"}],"collocations":["soon-sated appetite (すぐに満たされる食欲)","soon-sated desire (すぐに満たされる欲求)","soon-sated interest (すぐに薄れる興味)","soon-sated consumer (すぐに飽きる消費者)"],"synonyms":["fickle","restless","easily bored","discontented","insatiable (ironically, in the sense of needing constant novelty)","unfulfilled"],"antonyms":["easily pleased","content","satisfied","fulfilled","patient"],"notes":"This word implies a lack of staying power or a need for constant stimulation to maintain interest."}],"etymology":{"value":"A compound word formed from 'soon' (quickly) and 'sated' (satisfied to the point of boredom or surfeit).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsuːnˌseɪtɪd/","syllables":"soon-sa-ted"},"inflection":{"notes":"This is an adjective and follows standard adjective inflection rules (e.g., more soon-sated, most soon-sated), though comparative and superlative forms are rare."},"usage_notes":{"explanation":"'Soon-sated' is used to describe someone or something that quickly loses interest or becomes bored after initial satisfaction. It often carries a slightly negative connotation, suggesting a lack of depth or patience.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The soon-sated meal left him hungry.","correct":"✓ The small meal left him hungry.","note":"'Soon-sated' describes the person's tendency to become bored or satisfied quickly, not the quality of the meal itself. A small meal would be a more appropriate description."},{"incorrect":"✗ She was soon-sated with success.","correct":"✓ She quickly grew tired of success. / ✓ She was soon bored with success.","note":"While 'soon-sated' can be used in this context, it's more common to say 'quickly grew tired of' or 'was soon bored with' to describe someone losing interest in success."}],"priority":"★☆☆"},"related_words":{"derivatives":["sate (verb: to satisfy fully)","sated (adjective: fully satisfied)","unsated (adjective: not satisfied)"],"related_concepts":["hedonic adaptation (the tendency to return to a stable level of happiness despite major positive or negative events or life changes)","novelty seeking (a personality trait associated with the tendency to actively seek out new experiences)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - not a common word in general usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Soon-sated' is a relatively uncommon and somewhat sophisticated term. It describes the characteristic of being easily or quickly satisfied to the point of boredom, often implying a need for constant novelty or stimulation. The word is more likely to appear in formal writing or discussions about consumer behavior, psychology, or cultural trends."},"example_sentences":[{"sentence":"Modern audiences are often described as soon-sated, demanding increasingly spectacular entertainment.","translation":"現代の聴衆は、すぐに飽きるため、ますます壮大なエンターテイメントを求めているとよく言われる。","type":"general","meaning_category":"easily bored"},{"sentence":"His soon-sated curiosity led him to constantly switch between different hobbies.","translation":"彼のすぐに満たされる好奇心は、彼を常に異なる趣味の間で切り替えさせた。","type":"personal characteristic","meaning_category":"easily bored"},{"sentence":"The company struggled to retain customers in a market filled with soon-sated consumers.","translation":"その会社は、すぐに飽きる消費者が多い市場で、顧客を維持するのに苦労した。","type":"consumer behavior","meaning_category":"easily satisfied"}]}