{"word":"wiliest","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"最もずる賢い、最も狡猾な","english_definition":"most crafty or cunning; most full of deceitful cunning or stratagems.","examples":[{"sentence":"He was the wiliest negotiator I had ever encountered.","translation":"彼は私が今まで出会った中で最もずる賢い交渉人だった。"},{"sentence":"The wiliest of the foxes always avoided the traps.","translation":"最もずる賢いキツネは常に罠を避けた。"}],"collocations":["the wiliest of the group","the wiliest plan","the wiliest scheme"],"synonyms":["most cunning","most crafty","most sly","most shrewd","most artful"],"antonyms":["most honest","most straightforward","most naive","most ingenuous"]}],"etymology":{"value":"'Wiliest' is the superlative form of 'wily.' 'Wily' comes from Middle English 'wili,' from Old English 'wīl' meaning trick or stratagem. The suffix '-y' indicates a quality or characteristic. Therefore, 'wily' means full of tricks or stratagems.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwaɪliɪst/","syllables":"wi-li-est"},"inflection":{"adjective_forms":{"comparative":"wilier","superlative":"wiliest"}},"usage_notes":{"explanation":"'Wiliest' is used to describe someone or something that possesses the highest degree of cunning, craftiness, and deceptiveness. It implies a skillful use of tricks and strategies to achieve a goal, often at the expense of others. This word is not commonly used in everyday conversation but appears more frequently in literature or formal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is the wiliest person I know, he always tells the truth.","correct":"✓ He is the wiliest person I know, he always gets what he wants.","note":"'Wiliest' implies deceit and cunning, so it contradicts honesty. A 'wiliest' person is more likely to be manipulative to achieve their goals."},{"incorrect":"✗ She is wiliest than her brother.","correct":"✓ She is wilier than her brother.","note":"When comparing two things, use the comparative form 'wilier,' not the superlative 'wiliest.'"}],"priority":"★☆☆"},"related_words":{"derivatives":["wile (noun: a trick or stratagem meant to deceive or ensnare)","wily (adjective: crafty, cunning, full of deceitful tricks)","wiliness (noun: the quality of being wily; craftiness)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'wiliest' is the superlative form of 'wily,' meaning the most cunning, crafty, and full of deceitful tricks. It's not a commonly used word in everyday speech, making it more suitable for advanced English speakers who are comfortable with less frequent vocabulary. Understanding its meaning requires grasping the nuances of cunning and deception. It is typically found in literature or formal writing.","priority":"★☆☆"},"example_sentences":[{"sentence":"The wiliest politician always seemed to stay one step ahead of his opponents.","translation":"最もずる賢い政治家は常に相手の一歩先を行っているようだった。","type":"adjective","meaning_category":"cunning"},{"sentence":"She devised the wiliest plan to get the promotion.","translation":"彼女は昇進を得るために最も狡猾な計画を考案した。","type":"adjective","meaning_category":"crafty"},{"sentence":"The wiliest lawyer in the firm was known for his ability to win even the most difficult cases.","translation":"事務所で最もずる賢い弁護士は、最も難しい事件でさえ勝つ能力で知られていた。","type":"adjective","meaning_category":"shrewd"}]}