{"word":"involuntariness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不随意性、無意識、無自覚","english_definition":"The state or quality of being involuntary; lack of control or intention.","examples":[{"sentence":"The involuntariness of his reaction surprised him.","translation":"彼の反応が無意識だったことに彼は驚いた。"},{"sentence":"The defense argued the involuntariness of the defendant's actions.","translation":"弁護側は被告の行動が不随意であったと主張した。"},{"sentence":"The involuntariness of the movement suggested a neurological issue.","translation":"その動きが無意識であったことは、神経学的な問題を暗示していた。"}],"collocations":["lack of control","lack of intention","unconscious action","reflex action"],"synonyms":["unconsciousness","unintentionality","compulsion","constraint","necessity"],"antonyms":["voluntariness","intentionality","deliberateness","willfulness"]}],"etymology":{"value":"Formed from 'involuntary' + '-ness'. 'Involuntary' comes from Latin 'involuntarius', meaning 'not willing'.","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪnˌvɒlənˈtɛərɪnəs/","syllables":"in-vo-lun-tair-i-ness"},"inflection":{"noun_plural":"involuntarinesses (rare)"},"usage_notes":{"explanation":"'Involuntariness' refers to the state or quality of something being done without conscious control or intention. It is often used in legal, medical, or philosophical contexts to describe actions or movements that are not the result of a person's will. It's the abstract noun form of the adjective 'involuntary'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He claimed involuntariness for his decision, but it seemed planned.","correct":"✓ He claimed involuntariness for his actions, but it seemed planned.","note":"'Involuntariness' typically applies to actions or movements, not decisions. Decisions are usually considered deliberate, so claiming involuntariness for a decision is less common and can sound odd."},{"incorrect":"✗ The involuntariness was obvious in his face.","correct":"✓ The involuntary reaction was obvious in his face.","note":"'Involuntariness' is an abstract noun. To describe a specific reaction, use the adjective 'involuntary'."}],"priority":"★★☆"},"related_words":{"derivatives":["involuntary (adjective)","involuntarily (adverb)"],"phrases":["act of involuntariness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Involuntariness' is a relatively uncommon and abstract noun that describes the state of something being done without conscious control or intention. It is often used in formal or technical contexts, such as legal or medical discussions. Understanding this word requires a good grasp of abstract concepts and the ability to recognize its use in specialized fields."},"example_sentences":[{"sentence":"The doctor noted the involuntariness of the patient's muscle spasms.","translation":"医師は患者の筋肉の痙攣が無意識であることを記録した。","type":"noun","meaning_category":"無意識"},{"sentence":"The lawyer focused on the involuntariness of the defendant's confession.","translation":"弁護士は被告の自白が不随意であったことに焦点を当てた。","type":"noun","meaning_category":"不随意性"},{"sentence":"The involuntariness of the reflex made it difficult to suppress.","translation":"反射が無意識であるため、それを抑制することは困難だった。","type":"noun","meaning_category":"無自覚"}]}