{"word":"non-contender","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"競争相手ではない人、優勝の見込みがない人、取るに足らない人","english_definition":"someone who is not likely to win a competition or election; someone who is not considered a serious threat or worthy of attention.","examples":[{"sentence":"The team was a non-contender from the start of the season.","translation":"そのチームはシーズン当初から優勝の見込みがなかった。"},{"sentence":"He was considered a non-contender in the presidential race.","translation":"彼は大統領選では取るに足らない存在だと見なされていた。"},{"sentence":"Despite their efforts, they remained non-contenders in the market.","translation":"彼らの努力にもかかわらず、彼らは市場では取るに足らない存在のままだった。"}],"collocations":["be a non-contender","remain a non-contender","dismiss as a non-contender"],"synonyms":["outsider","underdog","long shot","also-ran","no-hoper"],"antonyms":["contender","frontrunner","favorite","challenger"]}],"etymology":{"value":"\"Non-\" (否定の接頭辞) + \"contender\" (競争者) から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnkənˈtendər/","syllables":"non-con-tend-er"},"inflection":{"noun_plural":"non-contenders"},"usage_notes":{"explanation":"\"Non-contender\" は、競争や選挙などの文脈で、勝利の見込みが低い、または全くない個人やグループを指す言葉です。しばしば、軽蔑的なニュアンスを含むことがあります。ビジネスや政治の世界で、競争力を欠く企業や候補者を表現する際にも用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non contender for the job.","correct":"✓ He is a non-contender for the job.","note":"ハイフンが必要です。"},{},{}],"priority":"★☆☆"},"related_words":{"derivatives":["contender","contend","contention"],"related_terms":["dark horse","underdog","long shot"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Non-contender\" is a term used to describe someone or something that is not considered a serious competitor or threat in a particular situation, such as a race, election, or business competition. It implies a lack of ability or resources to win or succeed. The word is formed by adding the prefix \"non-\" to \"contender,\" indicating the opposite of being a contender. It is often used in news reports, political commentary, and business analysis."},"example_sentences":[{"sentence":"The small startup was seen as a non-contender against the established tech giants.","translation":"その小さなスタートアップ企業は、確立された巨大テクノロジー企業に対する競争力がないと見られていた。","type":"noun","meaning_category":"競争相手ではない人"},{"sentence":"After a series of losses, the boxer became a non-contender in the championship rankings.","translation":"一連の敗北の後、そのボクサーは選手権ランキングで優勝の見込みがないと見なされるようになった。","type":"noun","meaning_category":"競争相手ではない人"},{"sentence":"The candidate's low poll numbers suggested they were a non-contender in the upcoming election.","translation":"その候補者の低い支持率から、次の選挙では当選の見込みがないことが示唆された。","type":"noun","meaning_category":"競争相手ではない人"}]}