{"word":"supervenience","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"上位性、随伴性：ある性質の集合が別の性質の集合を決定するという哲学的関係。あるレベルの性質（例えば、精神的な性質）が別のレベルの性質（例えば、物理的な性質）に依存していることを指す。","english_definition":"(philosophy) The relationship between sets of properties where a set of properties determines another set. It is a dependency of one set of properties (e.g., mental properties) on another set of properties (e.g., physical properties).","examples":[{"sentence":"The concept of supervenience is central to many debates in the philosophy of mind.","translation":"上位性の概念は、心の哲学における多くの議論の中心である。"},{"sentence":"Mental states are said to supervene on physical states.","translation":"精神状態は物理状態に随伴すると言われる。"},{"sentence":"Ethical properties are sometimes argued to supervene on descriptive properties.","translation":"倫理的性質は、記述的性質に随伴すると主張されることがある。"}],"collocations":["global supervenience","local supervenience","strong supervenience","weak supervenience","property supervenience","nomological supervenience"],"synonyms":["dependence","determination","entailment","grounding"],"antonyms":["independence","autonomy"]}],"etymology":{"value":"\"super-\"（上に）+ \"venire\"（来る）からなるラテン語の \"supervenire\"（追加して来る、起こる）に由来。英語では19世紀に哲学的な意味で使用されるようになった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərˈviːniəns/","syllables":"su-per-ve-ni-ence"},"inflection":{"noun_plural":"superveniences"},"usage_notes":{"explanation":"\"Supervenience\"は哲学、特に心の哲学、倫理学、形而上学で用いられる専門用語です。あるレベルの性質が別のレベルの性質によって決定されるという関係を表します。例えば、精神的な性質が物理的な性質に随伴するといった場合、物理的な状態が同じであれば、精神的な状態も同じでなければならないということを意味します。しかし、随伴される側の性質が、随伴する側の性質を必要とするわけではありません。つまり、同じ精神状態が異なる物理状態によって実現される可能性があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The supervenience of the mental state caused the physical state.","correct":"✓ The mental state supervenes on the physical state.","note":"上位性は、上位の性質が下位の性質に依存するという関係を表します。因果関係とは異なります。"},{"incorrect":"✗ Supervenience means identity.","correct":"✓ Supervenience does not necessarily mean identity.","note":"上位性は同一性を意味しません。上位性は依存関係を示しますが、二つの性質が同一であることを意味するわけではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["supervene (verb)","supervenient (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 哲学分野で限定的に使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**supervenience**」は哲学の専門用語で、ある種類の性質が別の種類の性質に依存していることを表します。たとえば、心（精神的な性質）が体（物理的な性質）に依存しているという考え方を説明する際に使われます。この言葉は、あるレベルの性質（例えば、心の状態）が、別のレベルの性質（例えば、脳の状態）によって完全に決定されるが、同一ではないという微妙な関係を示すために使われます。この概念を理解するには、哲学的な背景知識が必要となるため、一般的には高度な読解力が必要とされます。"},"example_sentences":[{"sentence":"The aesthetic value of a painting is said to supervene on its physical properties.","translation":"絵画の美的価値はその物理的特性に随伴すると言われる。","type":"noun","meaning_category":"哲学"},{"sentence":"If two objects are exactly alike in all physical respects, then they must also be exactly alike in all mental respects, according to the principle of supervenience.","translation":"もし二つの物体がすべての物理的な点で全く同じであるならば、上位性の原則によれば、それらはすべての精神的な点でも全く同じでなければならない。","type":"noun","meaning_category":"哲学"},{"sentence":"The debate centers on whether moral properties supervene on natural properties.","translation":"その議論は、道徳的性質が自然的性質に随伴するかどうかに焦点を当てている。","type":"noun","meaning_category":"哲学"}]}