{"word":"Phalangistine","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的に) スペインのファランヘ党の党員","english_definition":"A member of the Falange Española Tradicionalista y de las JONS, a Spanish political organization that supported a form of national syndicalism.","examples":[{"sentence":"He was a staunch Phalangistine during the Spanish Civil War.","translation":"彼はスペイン内戦中、筋金入りのファランヘ党員だった。"}],"collocations":[],"synonyms":["Falangist"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ファランヘ党の、またはファランヘ党に関連する","english_definition":"Relating to the Falange Española Tradicionalista y de las JONS or its ideology.","examples":[{"sentence":"The Phalangistine ideology emphasized national unity and authoritarian rule.","translation":"ファランヘ党のイデオロギーは、国民の団結と権威主義的な支配を強調した。"}],"collocations":[],"synonyms":["Falangist"],"antonyms":[]}],"etymology":{"value":"From Spanish *falangista*, from *Falange Española*, the name of the political party.","priority":"★★☆"},"pronunciation":{"ipa":"/fəˈlændʒɪstiːn/","syllables":"fa-lan-gis-tine"},"inflection":{"noun_plural":"Phalangistines"},"usage_notes":{"explanation":"The term 'Phalangistine' refers specifically to members or ideologies associated with the Falange Española Tradicionalista y de las JONS, a Spanish political party active primarily during the Spanish Civil War and the Franco regime. It is often used in historical contexts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Falange","Falangism"],"related_concepts":["Francoism","National Syndicalism"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Phalangistine' is a term primarily encountered in historical contexts related to the Spanish Civil War and the Franco regime. Understanding its meaning requires familiarity with 20th-century Spanish history and political ideologies, specifically national syndicalism and the Falange Española Tradicionalista y de las JONS."},"example_sentences":[{"sentence":"Many Phalangistines fought on the Nationalist side during the Spanish Civil War.","translation":"多くのファランヘ党員がスペイン内戦中、ナショナリスト側で戦った。","type":"noun","meaning_category":"党員"},{"sentence":"The government adopted several Phalangistine policies after the war.","translation":"政府は戦後、いくつかのファランヘ党の政策を採用した。","type":"adjective","meaning_category":"関連する"}]}