{"word":"strengths-based","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"強みに基づいた、強みを生かす","english_definition":"An approach or system that focuses on identifying and developing individual or organizational strengths rather than weaknesses.","examples":[{"sentence":"The company adopted a strengths-based approach to employee development.","translation":"その会社は従業員育成に強みに基づいたアプローチを採用した。"},{"sentence":"Strengths-based leadership focuses on maximizing the potential of each team member.","translation":"強みに基づいたリーダーシップは、各チームメンバーの潜在能力を最大限に引き出すことに焦点を当てている。"},{"sentence":"A strengths-based curriculum helps students discover and cultivate their talents.","translation":"強みに基づいたカリキュラムは、学生が自分の才能を発見し、育成するのに役立つ。"}],"collocations":["strengths-based approach","strengths-based leadership","strengths-based education","strengths-based development","strengths-based practice","strengths-based intervention"],"synonyms":["strength-focused","positive psychology-based","asset-based"],"antonyms":["deficit-based","weakness-focused","problem-oriented"]}],"etymology":{"value":"The term is derived from the combination of 'strengths' (referring to positive attributes or capabilities) and 'based' (meaning founded or grounded on). It reflects the idea of building upon existing strengths rather than solely addressing weaknesses.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstrɛŋθsˌbeɪst/","syllables":"strengths-based"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Strengths-based' is commonly used in fields such as psychology, education, management, and social work. It represents a shift in focus from identifying and fixing problems to recognizing and leveraging existing strengths. This approach is often associated with positive psychology and aims to promote well-being, engagement, and performance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The strengths based program was very effective.","correct":"✓ The strengths-based program was very effective.","note":"The correct spelling includes the hyphen to indicate that it is a compound adjective."},{"incorrect":"✗ We should focus on strengths than weaknesses.","correct":"✓ We should focus on strengths rather than weaknesses.","note":"The correct idiom is 'rather than', not 'than' when making a comparison."}],"priority":"★★☆"},"related_words":{"derivatives":["strength","strengths","base","based"],"phrases":["positive psychology","asset-based community development","appreciative inquiry"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'strengths-based' is a specialized adjective used to describe approaches or systems that prioritize the identification and development of strengths. It is commonly found in academic or professional contexts related to psychology, education, or management. Understanding the term requires familiarity with the concept of focusing on positive attributes rather than deficits."},"example_sentences":[{"sentence":"The therapist used a **strengths-based** approach to help the client build confidence.","translation":"セラピストは、クライアントが自信を築くのを助けるために、強みに基づいたアプローチを使用した。","type":"adjective","meaning_category":"強みを生かす"},{"sentence":"Our organization is committed to providing **strengths-based** training for all employees.","translation":"私たちの組織は、すべての従業員に強みに基づいたトレーニングを提供することに尽力している。","type":"adjective","meaning_category":"強みに基づいた"},{"sentence":"The **strengths-based** assessment identified her key talents and skills.","translation":"強みに基づいた評価は、彼女の主要な才能とスキルを特定した。","type":"adjective","meaning_category":"強みに基づいた"}]}