{"word":"Indistractable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"集中を妨げられない、気を散らされない","english_definition":"Not easily distracted; able to maintain focus and attention.","examples":[{"sentence":"He's become indistractable since he started using the new productivity system.","translation":"彼は新しい生産性システムを使い始めてから、集中を妨げられなくなった。"},{"sentence":"To be a successful writer, you need to be indistractable.","translation":"成功する作家になるには、集中を妨げられないことが必要だ。"},{"sentence":"She trained herself to be indistractable during her study sessions.","translation":"彼女は勉強中に集中を妨げられないように訓練した。"}],"collocations":["become indistractable","remain indistractable","indistractable focus","indistractable mind"],"synonyms":["focused","unwavering","resolute","determined","attentive","concentrated"],"antonyms":["distractable","easily distracted","inattentive","scatterbrained"]}],"etymology":{"value":"The word \"indistractable\" is formed by adding the prefix \"in-\" (meaning \"not\") to the word \"distractable.\" \"Distractable\" comes from the verb \"distract,\" which means to draw someone's attention away from something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪndɪˈstræktəbəl/","syllables":"in-di-strac-ta-ble"},"inflection":{"notes":"Adjective; comparative: more indistractable, superlative: most indistractable"},"usage_notes":{"explanation":"\"Indistractable\" describes the quality of being able to maintain focus and resist distractions. It is often used in the context of productivity, time management, and achieving goals. The word emphasizes the ability to control one's attention and prevent external or internal stimuli from disrupting concentration.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is indistractible to noise.","correct":"✓ He is indistractable.","note":"\"Indistractable\" is an absolute adjective, meaning it doesn't require a preposition like \"to\" to specify what someone is not distracted by. You can say \"He is indistractable when he's working.\""},{"incorrect":"✗ She has indistractibility.","correct":"✓ She has the ability to be indistractable.","note":"While \"indistractibility\" could be understood, it's not a commonly used noun. It's better to say \"the ability to be indistractable\" or use a related noun like \"focus\" or \"concentration.\""}],"priority":"★★☆"},"related_words":{"derivatives":["distract (verb)","distraction (noun)","distractable (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"indistractable\" is a relatively uncommon but useful adjective. It describes someone who is very good at focusing and not letting anything interrupt their concentration. It's a more advanced way of saying someone is \"very focused\" or \"not easily distracted.\" Understanding the prefix \"in-\" (meaning \"not\") and the word \"distract\" can help you understand its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The key to deep work is to become truly indistractable.","translation":"ディープワークの鍵は、本当に集中を妨げられないようになることだ。","type":"adjective","meaning_category":"集中を妨げられない"},{"sentence":"She developed an indistractable focus that allowed her to complete the project ahead of schedule.","translation":"彼女は集中を妨げられない集中力を養い、予定より早くプロジェクトを完了させることができた。","type":"adjective","meaning_category":"集中を妨げられない"},{"sentence":"In today's world, being indistractable is a valuable skill.","translation":"今日の社会では、集中を妨げられないことは貴重なスキルである。","type":"adjective","meaning_category":"集中を妨げられない"}]}