{"word":"Podsnappery","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（特に道徳的な問題に関して）偽善的で狭量な態度、自己満足的な愛国心、または独善的な見解。","english_definition":"Hypocritical narrow-mindedness, self-satisfied patriotism, or smugly complacent views, especially on moral issues.","examples":[{"sentence":"The politician's speech was full of Podsnappery, with its simplistic views and moral posturing.","translation":"その政治家の演説は、単純化された見解と道徳的なポーズで、ポッズナッペリーに満ちていた。"},{"sentence":"The article criticized the newspaper's Podsnappery, accusing it of ignoring complex issues in favor of easy moral judgments.","translation":"その記事は、新聞のポッズナッペリーを批判し、複雑な問題を無視して安易な道徳的判断に傾倒していると非難した。"}],"collocations":["moral Podsnappery","political Podsnappery","cultural Podsnappery"],"synonyms":["hypocrisy","sanctimony","smugness","self-righteousness","bigotry","narrow-mindedness"],"antonyms":["sincerity","open-mindedness","tolerance","humility"]}],"etymology":{"value":"チャールズ・ディケンズの小説『我らの共通の友』（Our Mutual Friend, 1864-65）に登場するキャラクター、ヴェヌス・ポッズナップ（Mr. Podsnap）に由来する。ポッズナップは、自己満足的で狭量な考えを持ち、自国の文化や道徳を絶対的に正しいと信じている人物として描かれている。","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɒdsnæpəri/","syllables":"Pod-snap-per-y"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"「**Podsnappery**」は、特定のキャラクターに由来する言葉であり、日常会話で頻繁に使われるわけではありません。主に、文学、社会評論、政治的な議論などで、特定の種類の偽善的で狭量な態度を批判的に表現するために用いられます。この単語を使うことで、単なる偽善や独善だけでなく、自己満足的な愛国心や文化的な優越意識といったニュアンスを含んだ批判をすることができます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of Podsnappery by donating to charity.","correct":"✓ He showed a lot of Podsnappery by condemning others for not donating to charity while secretly avoiding taxes himself.","note":"Podsnapperyは単なる道徳的な行動ではなく、偽善的な態度を指します。慈善団体への寄付自体はPodsnapperyではありません。"},{"incorrect":"✗ The Podsnappery of the situation was overwhelming.","correct":"✓ The hypocrisy of the situation was overwhelming.","note":"Podsnapperyは特定の種類の偽善を指すため、単に「偽善」を意味する場合は、より一般的な「hypocrisy」を使う方が適切です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Podsnapian (形容詞: ポッズナップ的な、ポッズナップの性格を持つ)"],"related_characters":["Mr. Podsnap (ヴェヌス・ポッズナップ)"],"related_works":["Our Mutual Friend (我らの共通の友)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 文学や専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Podsnappery**」は、チャールズ・ディケンズの小説に登場するキャラクターにちなんで名付けられた、非常に特殊な単語です。この言葉は、特に道徳的な問題に関して、狭量で自己満足的な態度を指します。これは、自分の国や文化が他のものよりも優れていると信じ、他の視点を受け入れないような考え方です。この単語は、文学的な議論や、そのような態度を批判する際に使われることがあります。日常会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The editorial was a clear example of Podsnappery, praising the nation's virtues while ignoring its flaws.","translation":"その社説は、国の美徳を称賛する一方で欠点を無視しており、ポッズナッペリーの明確な例だった。","type":"noun","meaning_category":"偽善的で狭量な態度"},{"sentence":"He accused his opponent of Podsnappery for taking a moral high ground while engaging in questionable business practices.","translation":"彼は、疑わしい商慣習に関与しながら道徳的に優位な立場を取っているとして、対戦相手をポッズナッペリーで非難した。","type":"noun","meaning_category":"自己満足的な愛国心"},{"sentence":"The play satirized the Podsnappery of Victorian society, with its rigid social conventions and moral hypocrisy.","translation":"その劇は、厳格な社会慣習と道徳的偽善を伴う、ビクトリア朝社会のポッズナッペリーを風刺した。","type":"noun","meaning_category":"独善的な見解"}]}