{"word":"Stilbella","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of fungi in the family Cordycipitaceae.","english_definition":"A genus of fungi in the family Cordycipitaceae, characterized by synnemata (bundles of conidiophores) bearing slimy conidia.","examples":[{"sentence":"Species of Stilbella are known to be entomopathogenic, meaning they are parasitic on insects.","translation":"Stilbella属の種は昆虫病原性を持つことが知られており、昆虫に寄生することを意味します。"}],"collocations":["Stilbella aciculosa","Stilbella annulata","entomopathogenic Stilbella"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'stilla' (a drop) and 'bella' (beautiful), referring to the appearance of the conidia in a drop-like mass on the synnema.","priority":"★★★"},"pronunciation":{"ipa":"/stɪlˈbɛlə/","syllables":"Stil-bel-la"},"inflection":{"noun_plural":"Stilbellas"},"usage_notes":{"explanation":"'Stilbella' is a scientific term used in mycology (the study of fungi). It specifically refers to a genus of fungi with characteristic synnemata. Its usage is primarily within scientific literature and discussions among mycologists.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Stilbella is a type of bacteria.","correct":"✓ Stilbella is a type of fungus.","note":"Stilbella is a genus of fungi, not bacteria."}],"priority":"★☆☆"},"related_words":{"derivatives":["stilbaceous (adjective, relating to Stilbella or similar fungi)","synnema (noun, the characteristic structure of Stilbella)"],"related_taxa":["Cordycipitaceae (family)","Cordyceps (related genus)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - primarily found in scientific texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stilbella' is a technical term used in mycology. Understanding it requires familiarity with fungal morphology, specifically the concept of synnemata and conidia. It is unlikely to be encountered outside of specialized scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The entomopathogenic fungus, Stilbella, was isolated from the infected insect.","translation":"昆虫病原性菌であるStilbellaが、感染した昆虫から分離された。","type":"scientific","meaning_category":"fungus"},{"sentence":"Microscopic examination revealed the characteristic synnemata of Stilbella.","translation":"顕微鏡検査により、Stilbellaの特徴的なシンネマが明らかになった。","type":"scientific","meaning_category":"fungus"}]}