{"word":"coauthorship","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"共著、共同執筆","english_definition":"The state or fact of being a coauthor; the act of writing something jointly with another person or people.","examples":[{"sentence":"The book was a result of coauthorship between the two professors.","translation":"その本は二人の教授の共著の結果である。"},{"sentence":"Coauthorship is common in scientific publications.","translation":"共著は科学出版物では一般的である。"},{"sentence":"The researchers agreed on coauthorship for the paper.","translation":"研究者たちはその論文の共著に合意した。"}],"collocations":["establish coauthorship (共著関係を確立する)","seek coauthorship (共著を求める)","offer coauthorship (共著を申し出る)","joint coauthorship (共同共著)","coauthorship agreement (共著契約)","scientific coauthorship (科学的な共著)"],"synonyms":["collaboration","joint authorship","partnership","co-creation"],"antonyms":["sole authorship","independent work","single authorship"]}],"etymology":{"value":"'co-' (共に) + 'authorship' (著作者であること) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌkoʊˈɔːθərʃɪp/","syllables":"co-au-thor-ship"},"inflection":{"noun_plural":"coauthorships"},"usage_notes":{"explanation":"'Coauthorship' refers to the situation where two or more individuals contribute to the creation of a written work, such as a book, article, or paper. It implies a shared responsibility and credit for the work's content. The order of authors listed in a coauthored work often reflects the relative contributions of each author, though conventions can vary by field.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The co-authorship was write by them.","correct":"✓ The coauthorship was a collaboration between them. / ✓ They engaged in coauthorship.","note":"'Coauthorship' is a noun referring to the state or act of being a coauthor, not the act of writing itself. Use a verb like 'collaborate' or rephrase the sentence."},{"incorrect":"✗ He is a coauthorship of the book.","correct":"✓ He is a coauthor of the book.","note":"'Coauthorship' is a noun. The correct term for a person who coauthors is 'coauthor'."}],"priority":"★★☆"},"related_words":{"derivatives":["coauthor (noun: 共著者、verb: 共著する)"],"phrasal_verbs":[],"related_terms":["author","authorship","collaborate","collaboration","joint work","publication","paper","article","book"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低い (Relatively low frequency) - 学術的な文脈でよく使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Coauthorship' is a term used in academic and professional contexts to describe the situation where a piece of work, usually a written document like a research paper or a book, is created by more than one author. It implies that each author has contributed to the content and shares responsibility for it. Understanding this term is important in fields where collaboration is common, such as scientific research and academic publishing. The level of contribution and the order in which authors are listed can have implications for career advancement and recognition within the field."},"example_sentences":[{"sentence":"The scientists celebrated their successful coauthorship with a joint presentation.","translation":"科学者たちは共同発表で彼らの共著の成功を祝った。","type":"noun","meaning_category":"共著"},{"sentence":"The guidelines for coauthorship were clearly defined by the university's research ethics committee.","translation":"共著に関するガイドラインは、大学の研究倫理委員会によって明確に定義された。","type":"noun","meaning_category":"共著"},{"sentence":"Disputes about coauthorship can sometimes arise in collaborative projects.","translation":"共著に関する紛争は、共同プロジェクトで時々発生することがある。","type":"noun","meaning_category":"共著"},{"sentence":"The project resulted in a coauthorship between the two research groups.","translation":"そのプロジェクトは、2つの研究グループ間の共著という結果になった。","type":"noun","meaning_category":"共著"},{"sentence":"The coauthorship allowed for a broader range of expertise to be included in the study.","translation":"共著によって、より広範な専門知識を研究に含めることができた。","type":"noun","meaning_category":"共著"}]}