{"word":"Way-god","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(神話)道祖神","english_definition":"(Mythology) Dōsojin; a Japanese deity believed to protect travelers, roads, and village boundaries.","examples":[{"sentence":"The Way-god is often depicted as a phallic stone statue.","translation":"道祖神はしばしば男根の形をした石像として描かれる。"},{"sentence":"Villagers pray to the Way-god for safe journeys.","translation":"村人たちは旅の安全を願って道祖神に祈る。"}],"collocations":["Dōsojin statue","roadside Way-god","village Way-god"],"synonyms":["Dōsojin","Sai no Kami"],"antonyms":[]}],"etymology":{"value":"Combination of \"way\" (road, path) and \"god\" referring to a deity. It is a direct translation/description of the Japanese deity Dōsojin.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈweɪ.ɡɒd/","syllables":"Way-god"},"inflection":{"noun_plural":"Way-gods"},"usage_notes":{"explanation":"\"Way-god\" is a descriptive term for the Japanese deity Dōsojin. It is not as commonly used as the original Japanese term, especially within Japan. It is more likely to be used in English-language discussions about Japanese folklore or mythology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a way-god in the temple.","correct":"✓ I saw a Dōsojin in the temple.","note":"While technically correct, it's more common to use the Japanese term Dōsojin, especially when referring to a specific statue or deity within Japan."}],"priority":"★★☆"},"related_words":{"derivatives":["Dōsojin","Sai no Kami"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"\"Way-god\" is a term used to describe the Japanese deity Dōsojin in English. Understanding this term requires familiarity with Japanese mythology and religious practices. It is not a commonly used term, so it is more likely to be encountered in academic or specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Many small villages in Japan have statues of the Way-god at the edge of the settlement.","translation":"日本の多くの小さな村では、集落の端に道祖神の像がある。","type":"noun","meaning_category":"Deity"},{"sentence":"The Way-god is believed to protect travelers from harm.","translation":"道祖神は旅人を危害から守ると信じられている。","type":"noun","meaning_category":"Deity"}]}