{"word":"nontragedies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A plural form of 'nontragedy', referring to events or stories that are not tragedies; situations lacking the elements of a tragedy.","english_definition":"Plural form of nontragedy: events or stories that are not tragedies.","examples":[{"sentence":"The book included both tragedies and nontragedies to provide a balanced view of human experience.","translation":"その本は、人間の経験のバランスの取れた見方を提供するために、悲劇と非悲劇の両方を含んでいた。"},{"sentence":"While many plays focus on tragic events, there are also nontragedies that explore lighter themes.","translation":"多くの劇が悲劇的な出来事に焦点を当てている一方で、より軽いテーマを探求する非悲劇も存在する。"}],"collocations":["a collection of nontragedies","explore nontragedies","focus on nontragedies"],"synonyms":["comedies","light stories","non-tragic events"],"antonyms":["tragedies","catastrophes","disasters"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'tragedies'. 'Tragedies' comes from 'tragedy', which originates from the Greek word 'tragōidia', meaning 'goat song'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈtrædʒɪdiz/","syllables":"non-trag-e-dies"},"inflection":{"noun_plural":"nontragedies"},"usage_notes":{"explanation":"'Nontragedies' is used to describe situations or narratives that do not possess the characteristics of a tragedy. This can include stories with happy endings, comedies, or events that lack the serious and somber tone of a tragedy. The term is relatively uncommon and is often used in academic or literary contexts to contrast with tragedies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was a nontragedy, so it was very sad.","correct":"✓ The movie was a nontragedy, so it was uplifting and happy.","note":"A nontragedy is not sad; it is the opposite of a tragedy, which is typically uplifting or comedic."}],"priority":"★★☆"},"related_words":{"derivatives":["nontragedy (singular noun)","tragic (adjective)","tragedy (noun)"],"antonyms":["tragedy","disaster","catastrophe"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nontragedies' is a more advanced term used to describe stories or events that are not tragedies. It's formed by adding 'non-' to 'tragedies,' indicating the absence of tragic elements. This word is typically found in literary analysis or academic discussions rather than everyday conversation. Understanding the root word 'tragedy' is essential to grasp the meaning of 'nontragedies.'"},"example_sentences":[{"sentence":"The anthology featured a mix of tragedies and nontragedies, showcasing the full spectrum of human storytelling.","translation":"そのアンソロジーは、人間の物語の全範囲を示すために、悲劇と非悲劇の混合を特徴としていた。","type":"noun","meaning_category":"Stories that are not tragedies"},{"sentence":"Critics often overlook the value of nontragedies, focusing instead on works with more dramatic and sorrowful themes.","translation":"批評家はしばしば非悲劇の価値を見落とし、代わりに、より劇的で悲しいテーマを持つ作品に焦点を当てている。","type":"noun","meaning_category":"Stories that are not tragedies"}]}