{"word":"Stakhanov","priority":"低","meanings":[{"part_of_speech":"noun","definition":"スタハノフ (人); スタハノフ運動の支持者","english_definition":"A follower of Stakhanovism; a highly productive worker.","examples":[{"sentence":"He was hailed as a Stakhanovite for exceeding his production quota.","translation":"彼は生産ノルマを超過したことでスタハノフ運動の支持者として称えられた。"}],"collocations":["Stakhanovite worker (スタハノフ運動の労働者)","Stakhanovite movement (スタハノフ運動)"],"synonyms":["model worker","high achiever"],"antonyms":["underachiever"]},{"part_of_speech":"proper noun","definition":"スタハノフ (人名); ソ連の炭鉱労働者、スタハノフ運動の象徴","english_definition":"A Soviet coal miner, Aleksei Grigorievich Stakhanov (1906-1977), who became a symbol of the Stakhanovite movement.","examples":[{"sentence":"The Stakhanovite movement was named after Aleksei Stakhanov.","translation":"スタハノフ運動はアレクセイ・スタハノフにちなんで名付けられた。"}],"collocations":["Aleksei Stakhanov","Stakhanovite movement"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Aleksei Grigorievich Stakhanov, a Soviet coal miner who was publicized as a model of productivity.","priority":"★★☆"},"pronunciation":{"ipa":"/stəˈkɑːnəf/","syllables":"Sta-kha-nov"},"inflection":{"notes":"単数形、複数形ともに Stakhanovites"},"usage_notes":{"explanation":"The term 'Stakhanov' and 'Stakhanovite' are primarily historical references to the Stakhanovite movement in the Soviet Union, which promoted increased labor productivity. It can sometimes be used ironically to describe someone who is excessively enthusiastic about work.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Stakhanov of our company.","correct":"✓ He is a Stakhanovite in our company.","note":"Use 'Stakhanovite' to refer to a follower of the movement, not 'Stakhanov' directly."}],"priority":"★☆☆"},"related_words":{"derivatives":["Stakhanovism (名詞: スタハノフ運動)","Stakhanovite (形容詞: スタハノフ運動の、スタハノフ的な)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stakhanov' refers to Aleksei Grigorievich Stakhanov, a Soviet coal miner who became famous for his high productivity levels. The term is primarily used in a historical context to refer to the Stakhanovite movement, which aimed to increase labor productivity in the Soviet Union. It may also be used to describe someone who is extremely dedicated to their work, sometimes with a hint of irony. Understanding the historical context is essential to correctly interpret the meaning of this term."},"example_sentences":[{"sentence":"The factory celebrated its Stakhanovites with awards and recognition.","translation":"工場はスタハノフ運動の支持者たちを賞と表彰で祝福した。","type":"noun","meaning_category":"スタハノフ運動の支持者"},{"sentence":"Stakhanov's record-breaking coal extraction inspired the Stakhanovite movement.","translation":"スタハノフの記録的な石炭採掘はスタハノフ運動を鼓舞した。","type":"proper noun","meaning_category":"人名"}]}