{"word":"recension","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(文献学における)校訂版、改訂版、批評版","english_definition":"A critical revision or emendation of a text; a text established as the result of such revision.","examples":[{"sentence":"The scholar produced a new recension of the ancient manuscript.","translation":"その学者は古代原稿の新しい校訂版を作成した。"},{"sentence":"This recension incorporates the latest findings in textual criticism.","translation":"この批評版は、文献批評における最新の知見を取り入れている。"}],"collocations":["critical recension","textual recension","establish a recension","produce a recension"],"synonyms":["edition","revision","version","emendation","collation"],"antonyms":[]}],"etymology":{"value":"From Latin recensio (“review, examination”), from recensere (“to review, examine”), from re- (“again”) + censere (“to assess, value”).","priority":"★★☆"},"pronunciation":{"ipa":"/ɹɪˈsɛnʃən/","syllables":"re-cen-sion"},"inflection":{"noun_plural":"recensions"},"usage_notes":{"explanation":"'Recension' is a term primarily used in textual criticism and scholarly contexts. It refers to a critically revised version of a text, often involving collation and emendation of multiple sources. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a recension about the movie.","correct":"✓ He wrote a review about the movie.","note":"'Recension' is not a general term for a review. Use 'review' for opinions about books, movies, etc."}],"priority":"★★☆"},"related_words":{"derivatives":["recense (verb)","recensor (noun)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'recension' is highly specialized, primarily used within academic fields such as textual criticism and classical studies. It denotes a scholarly edition of a text that has been critically revised and emended, often based on a comparison of multiple manuscript sources. Due to its technical nature, it is unlikely to be encountered outside of these specific contexts."},"example_sentences":[{"sentence":"The new **recension** of the play aims to restore the author's original intent.","translation":"その戯曲の新しい校訂版は、作者の本来の意図を復元することを目指している。","type":"noun","meaning_category":"校訂版"},{"sentence":"Scholars debated the merits of each **recension** of the ancient text.","translation":"学者たちは古代テキストの各批評版の長所について議論した。","type":"noun","meaning_category":"批評版"}]}