{"word":"Greenheart","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物)グリーンハート：南米原産のクスノキ科の常緑高木。非常に硬く耐久性のある木材として知られる。","english_definition":"A tall evergreen tree (Chlorocardium rodiei) of the laurel family, native to South America, noted for its extremely hard and durable timber.","examples":[{"sentence":"Greenheart is used in marine construction because of its resistance to marine borers.","translation":"グリーンハートは、船喰い虫に対する耐性があるため、海洋構造物に使用される。"},{"sentence":"The wood of the greenheart tree is highly valued for its strength and durability.","translation":"グリーンハートの木材は、その強度と耐久性で高く評価されている。"}],"collocations":["greenheart wood (グリーンハート材)","greenheart timber (グリーンハート材)","marine construction (海洋構造物)","resistant to marine borers (船喰い虫に対する耐性)"],"synonyms":["Chlorocardium rodiei"],"antonyms":[]},{"part_of_speech":"noun","definition":"(木材)グリーンハート材：グリーンハートの木から取れる木材。非常に硬く、重く、耐久性があり、水中で腐りにくい。","english_definition":"The timber of the greenheart tree, valued for its hardness, density, durability, and resistance to decay in water.","examples":[{"sentence":"Greenheart is a popular choice for docks and piers.","translation":"グリーンハートは、ドックや桟橋の材料として人気がある。"},{"sentence":"Greenheart was once widely used in shipbuilding.","translation":"グリーンハートはかつて造船に広く使用されていた。"}],"collocations":["docks and piers (ドックと桟橋)","shipbuilding (造船)","resistant to decay (腐りにくい)","hardwood (広葉樹)"],"synonyms":["demerara greenheart"],"antonyms":[]}],"etymology":{"value":"'Green' + 'heart', referring to the greenish color of the heartwood (the central core of the tree).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡriːnˌhɑːrt/","syllables":"green-heart"},"inflection":{"noun_plural":"greenhearts"},"usage_notes":{"explanation":"'Greenheart' refers both to the tree species (Chlorocardium rodiei) and the timber obtained from it. The wood is particularly valued for its resistance to marine borers and decay in water, making it suitable for marine construction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The green heart tree is used for building houses.","correct":"✓ Greenheart is used in marine construction.","note":"While strong, greenheart is primarily used in marine applications due to its water resistance, not typically in general house construction."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["hardwood","timber","marine construction","Chlorocardium rodiei"]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Greenheart' is a specialized term primarily encountered in contexts related to botany, forestry, and marine construction. Understanding its meaning requires familiarity with these fields. The term refers to both a specific tree species and the durable timber derived from it, which is particularly valued for its resistance to decay in aquatic environments."},"example_sentences":[{"sentence":"The old dock was constructed with **greenheart** to withstand the harsh marine environment.","translation":"古いドックは、過酷な海洋環境に耐えるためにグリーンハートで建設された。","type":"noun","meaning_category":"木材"},{"sentence":"**Greenheart** trees are native to the Guyana Shield region of South America.","translation":"グリーンハートの木は、南米のギアナ高地地域が原産である。","type":"noun","meaning_category":"植物"}]}