{"word":"in-office-required","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"オフィス勤務必須の、出社義務のある","english_definition":"(of a job or position) requiring the employee to work primarily or exclusively from the employer's physical office location, rather than remotely.","examples":[{"sentence":"This is an in-office-required position; remote work is not an option.","translation":"これはオフィス勤務必須のポジションであり、リモートワークは選択肢ではありません。"},{"sentence":"The job description clearly states that the role is in-office-required.","translation":"職務記述書には、この役割はオフィス勤務必須であることが明記されています。"},{"sentence":"Due to the nature of the work, an in-office-required presence is necessary for collaboration and security.","translation":"業務の性質上、コラボレーションとセキュリティのために、オフィス勤務が必須となります。"}],"collocations":["in-office-required position","in-office-required role","in-office-required presence","full-time in-office-required","strictly in-office-required"],"synonyms":["on-site","office-based","non-remote","in-person"],"antonyms":["remote","remote-optional","hybrid","telecommuting","work-from-home (WFH)"]},{"part_of_speech":"noun","definition":"オフィス勤務必須、出社義務","english_definition":"The state or requirement of a job or position being primarily or exclusively performed at the employer's physical office location.","examples":[{"sentence":"The company's policy is a strict in-office-required for all new employees.","translation":"会社のポリシーは、すべての新入社員に対して厳格なオフィス勤務必須です。"},{"sentence":"Many employees are pushing back against the in-office-required, preferring a hybrid or fully remote model.","translation":"多くの従業員はオフィス勤務必須に反発しており、ハイブリッドまたは完全リモートモデルを好んでいます。"},{"sentence":"The benefits of in-office-required include improved collaboration and team cohesion.","translation":"オフィス勤務必須の利点には、コラボレーションの改善とチームの結束力の強化が含まれます。"}],"collocations":["strict in-office-required","full in-office-required","return to in-office-required","mandate in-office-required","enforce in-office-required"],"synonyms":["on-site work","office-based work","non-remote work","in-person work"],"antonyms":["remote work","telecommuting","work-from-home (WFH)","remote-first","hybrid work"]}],"etymology":{"value":"A compound term formed from \"in-office\" (referring to being physically present in the office) and \"required\" (meaning necessary or mandatory). The term emerged with the rise of remote work to specifically denote positions that do not offer remote work options.","priority":"★☆☆"},"pronunciation":{"ipa":"/ɪn ˈɔfɪs rɪˈkwaɪərd/","syllables":"in-of-fice-re-quired"},"inflection":{"notes":"As a compound adjective and noun, it generally does not inflect. The noun form may occasionally be pluralized as \"in-office-requireds\" but this is rare."},"usage_notes":{"explanation":"The term \"in-office-required\" is a relatively new term that has gained prominence with the increase in remote work options. It is used to clearly specify that a job or position necessitates physical presence in the office. It's often used in job descriptions, company policies, and discussions about work arrangements. The opposite of \"in-office-required\" would be \"remote,\" \"remote-optional,\" or \"hybrid.\"","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This position is require in-office.","correct":"✓ This position is in-office-required.","note":"The correct phrasing is \"in-office-required\" as a compound adjective. Using \"require in-office\" is grammatically incorrect."},{"incorrect":"✗ The company is in-office required.","correct":"✓ The company has an in-office-required policy.","note":"When referring to a company's policy, use \"in-office-required policy\" rather than saying the company itself is \"in-office required.\""}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["remote work","hybrid work","telecommuting","work-from-home (WFH)","return to office (RTO)","office-based","on-site","in-person"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - term is relatively new and specific.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"in-office-required\" is used to describe jobs that need to be done at the office, not from home or another place. It's a way of saying that you have to be physically present at the company's location to do the work. This term is often used when companies are talking about their policies for remote work or when they are hiring for positions that can't be done remotely. It's the opposite of \"remote work,\" where you can do your job from anywhere.","priority":"★★☆"},"example_sentences":[{"sentence":"The advertisement stated it was an **in-office-required** role.","translation":"広告には、オフィス勤務必須の役割だと記載されていました。","type":"adjective","meaning_category":"オフィス勤務必須の"},{"sentence":"They implemented an **in-office-required** mandate for all departments.","translation":"彼らはすべての部署に対してオフィス勤務必須の義務を課しました。","type":"noun","meaning_category":"オフィス勤務必須"},{"sentence":"The company is transitioning back to an **in-office-required** model.","translation":"会社はオフィス勤務必須のモデルに移行しつつあります。","type":"adjective","meaning_category":"オフィス勤務必須の"},{"sentence":"Many employees prefer remote work over **in-office-required**.","translation":"多くの従業員はオフィス勤務必須よりもリモートワークを好みます。","type":"noun","meaning_category":"オフィス勤務必須"}]}