{"word":"colorbreed","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に馬の)毛色を固定するために品種改良されたもの、またはその品種","english_definition":"A breed developed to produce specific coat colors or patterns, especially in horses.","examples":[{"sentence":"The Palomino is a colorbreed known for its golden coat and white mane and tail.","translation":"パロミノは、黄金色の毛並みと白いたてがみと尾で知られるカラーブリードです。"},{"sentence":"Some argue that colorbreeds prioritize aesthetics over other important traits like temperament or athleticism.","translation":"カラーブリードは、気質や運動能力といった他の重要な特性よりも、美観を優先していると主張する人もいます。"}],"collocations":["Palomino colorbreed","Pinto colorbreed","Appaloosa colorbreed"],"synonyms":["coat color breed"],"antonyms":[]},{"part_of_speech":"verb","definition":"(主に馬の)毛色を固定するために品種改良する","english_definition":"To breed animals, especially horses, for specific coat colors or patterns.","examples":[{"sentence":"They colorbreed their horses to produce striking and unique coat patterns.","translation":"彼らは、印象的でユニークな毛並みを生み出すために、馬をカラーブリードしています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"A combination of \"color\" and \"breed,\" reflecting the focus on coat color in the selection and development of these breeds.","priority":"★☆☆"},"pronunciation":{"ipa":"ˈkʌlərˌbriːd","syllables":"col-or-breed"},"inflection":{"verb_forms":{"present_simple":["colorbreed","colorbreeds"],"past_simple":"colorbred","past_participle":"colorbred","present_participle":"colorbreeding"},"noun_plural":"colorbreeds"},"usage_notes":{"explanation":"The term \"colorbreed\" is most often used in the context of horses, but can also apply to other animals where coat color is a primary breeding goal. The term can sometimes be controversial, as some breeders and breed registries prioritize other characteristics over color.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The colorbreed horse was very temperament.","correct":"✓ The colorbreed horse had a good temperament.","note":"\"Temperament\" is a noun, so it needs an article and a verb like \"had\"."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"colorbreed\" refers to a breed of animal, most commonly horses, that has been specifically developed to produce certain coat colors or patterns. This means that breeders focus on selecting animals with the desired colors and breeding them together to ensure that their offspring inherit those traits. While color is a key characteristic of these breeds, it's important to note that other traits like temperament, conformation, and athleticism can also be considered. The term can sometimes be controversial, as some argue that prioritizing color can lead to a neglect of other important qualities."},"example_sentences":[{"sentence":"The Appaloosa is a popular colorbreed known for its distinctive spotted coat.","translation":"アパルーサは、特徴的な斑点模様で知られる人気のカラーブリードです。","type":"noun","meaning_category":"品種"},{"sentence":"They carefully colorbreed their dogs to maintain the unique merle pattern.","translation":"彼らは、独特のマール模様を維持するために、犬を注意深くカラーブリードしています。","type":"verb","meaning_category":"品種改良する"}]}