{"word":"mastoids","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"乳様突起 (にゅうようとっき)","english_definition":"plural of mastoid: the conical prominence of the temporal bone behind the ear, containing air spaces that communicate with the middle ear cavity.","examples":[{"sentence":"The mastoids are located behind the ears.","translation":"乳様突起は耳の後ろに位置しています。"},{"sentence":"Inflammation of the mastoids is called mastoiditis.","translation":"乳様突起の炎症は乳様突起炎と呼ばれます。"}],"collocations":["mastoid process (乳様突起)","mastoid air cells (乳様蜂巣)","mastoiditis (乳様突起炎)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'mastos' meaning breast, and 'eidos' meaning form or resemblance. The term refers to the breast-like shape of the mastoid process.","priority":"★★★"},"pronunciation":{"ipa":"ˈmæstɔɪdz","syllables":"mas-toids"},"inflection":{"noun_plural":"mastoids"},"usage_notes":{"explanation":"'Mastoids' is the plural form of 'mastoid', which refers to the bony prominence located behind the ear. It is part of the temporal bone and contains air cells that connect to the middle ear. Inflammation of the mastoid bone is known as mastoiditis and can be a serious complication of middle ear infections.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has pain in his mastoid.","correct":"✓ He has pain in his mastoids.","note":"Since there are two mastoid processes (one behind each ear), using the plural form 'mastoids' is more accurate when referring to the general area or both sides."},{"incorrect":"✗ Mastoid is inflamed.","correct":"✓ The mastoid is inflamed. / ✓ The mastoids are inflamed.","note":"When referring to a specific mastoid process, use 'the mastoid'. When referring to both, use 'the mastoids'."}],"priority":"★★☆"},"related_words":{"derivatives":["mastoid (noun singular)","mastoiditis (noun: inflammation of the mastoid)","mastoidectomy (noun: surgical removal of the mastoid air cells)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mastoids' refers to the plural form of 'mastoid', which are bony structures located behind each ear. They are part of the temporal bone and contain air cells connected to the middle ear. Understanding the term is essential in medical contexts, particularly when discussing conditions like mastoiditis, an inflammation of the mastoid air cells. The singular form, 'mastoid', refers to one of these bony structures.","priority":"★★☆"},"example_sentences":[{"sentence":"The CT scan showed inflammation in both mastoids.","translation":"CTスキャンで両方の乳様突起に炎症が見られました。","type":"noun","meaning_category":"anatomy"},{"sentence":"The doctor examined the patient's mastoids for signs of infection.","translation":"医師は感染の兆候がないか患者の乳様突起を診察しました。","type":"noun","meaning_category":"medical examination"},{"sentence":"Mastoiditis can develop as a complication of otitis media, affecting the mastoids.","translation":"乳様突起炎は中耳炎の合併症として発症し、乳様突起に影響を与えることがあります。","type":"noun","meaning_category":"disease"}]}