{"word":"Polypore","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"サルノコシカケ（多孔菌）","english_definition":"A fungus of a large group of Basidiomycetes, mainly wood-decay fungi, characterized by a fruiting body (basidiocarp) with pores on the underside.","examples":[{"sentence":"The forest floor was littered with fallen branches covered in polypores.","translation":"森の地面はサルノコシカケに覆われた落ちた枝で散らかっていた。"},{"sentence":"Some polypores are edible, while others are poisonous.","translation":"サルノコシカケの中には食用になるものもあれば、有毒なものもある。"}],"collocations":["wood-decay polypore","bracket polypore","medicinal polypore"],"synonyms":["bracket fungus","shelf fungus","pore fungus"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'poly' meaning 'many' and 'poros' meaning 'pore', referring to the many pores on the underside of the fruiting body.","priority":"★★☆"},"pronunciation":{"ipa":"ˈpɒlɪpɔːr","syllables":"Pol-y-pore"},"inflection":{"noun_plural":"polypores"},"usage_notes":{"explanation":"'Polypore' refers to a diverse group of fungi rather than a single species. They play an important ecological role in breaking down dead wood. Some species are used in traditional medicine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The polypore are growing on the tree.","correct":"✓ The polypores are growing on the tree.","note":"'Polypore' is a countable noun, so use the plural form 'polypores' when referring to multiple fungi. If referring to a single fungus, use 'a polypore'."}],"priority":"★★☆"},"related_words":{"derivatives":["polyporaceae (サルノコシカケ科)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Polypore' is a technical term used in mycology (the study of fungi). It refers to a specific group of fungi characterized by their porous fruiting bodies. Understanding this term requires some familiarity with biology and ecology."},"example_sentences":[{"sentence":"The old log was covered in colorful polypores.","translation":"古い丸太は色とりどりのサルノコシカケで覆われていた。","type":"noun","meaning_category":"fungus"},{"sentence":"Researchers are studying the medicinal properties of certain polypores.","translation":"研究者たちは特定のサルノコシカケの薬効を研究している。","type":"noun","meaning_category":"fungus"}]}