{"word":"hydrometeorology","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"水文気象学、水文気象","english_definition":"The branch of meteorology that deals with the hydrologic cycle, the water budget, and the rainfall statistics of storms.","examples":[{"sentence":"Hydrometeorology is essential for predicting floods and droughts.","translation":"水文気象学は、洪水や干ばつを予測するために不可欠です。"},{"sentence":"The hydrometeorology data helped in managing water resources effectively.","translation":"水文気象学のデータは、水資源を効果的に管理するのに役立ちました。"}],"collocations":["applied hydrometeorology","operational hydrometeorology","hydrometeorology data","hydrometeorology research"],"synonyms":["hydroclimatology","water resources meteorology"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hydro' (water), 'meteor' (atmospheric phenomena), and 'logy' (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪdroʊˌmiːtiəˈrɒlədʒi/","syllables":"hy-dro-me-te-o-rol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hydrometeorology is an interdisciplinary field that combines meteorology and hydrology to study the transfer of water and energy between the Earth's surface and the lower atmosphere. It is crucial for understanding and predicting various weather-related phenomena that impact water resources.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hydrometeorology is the study of only rainfall.","correct":"✓ Hydrometeorology is the study of the water cycle and related weather phenomena, including rainfall.","note":"Hydrometeorology encompasses more than just rainfall; it includes the entire water cycle and its interactions with the atmosphere."}],"priority":"★☆☆"},"related_words":{"derivatives":["hydrometeorological (adjective)"],"phrasal_verbs":[],"related_fields":["hydrology","meteorology","climatology","environmental science"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Hydrometeorology is a specialized term referring to the study of the atmospheric and hydrological cycles. It involves understanding how water moves through the atmosphere and across the Earth's surface, and how these processes are influenced by weather patterns. This term is primarily used in scientific and technical contexts related to water resource management, weather forecasting, and climate studies."},"example_sentences":[{"sentence":"Advances in hydrometeorology have improved our ability to forecast extreme weather events.","translation":"水文気象学の進歩により、異常気象現象を予測する能力が向上しました。","type":"general","meaning_category":"general"},{"sentence":"The course covers topics in both theoretical and applied hydrometeorology.","translation":"このコースでは、理論水文気象学と応用水文気象学の両方のトピックを取り扱います。","type":"academic","meaning_category":"academic"}]}