{"word":"proconviction","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A bias or predisposition in favor of finding a defendant guilty in a criminal trial.","english_definition":"A leaning or tendency to believe in the guilt of a defendant before all evidence is presented in a trial.","examples":[{"sentence":"The judge instructed the jury to avoid proconviction and to remain impartial throughout the trial.","translation":"裁判官は陪審員に対し、有罪判決への偏見を避け、裁判を通じて公平性を保つよう指示した。"},{"sentence":"Some critics argue that media coverage can create a proconviction atmosphere, influencing potential jurors.","translation":"批評家の中には、メディアの報道が有罪判決を支持する雰囲気を作り出し、潜在的な陪審員に影響を与える可能性があると主張する者もいる。"}],"collocations":["avoid proconviction","proconviction bias","proconviction atmosphere","overcome proconviction"],"synonyms":["bias toward guilt","presumption of guilt","prejudgment of guilt"],"antonyms":["presumption of innocence","impartiality","neutrality"]}],"etymology":{"value":"Formed by combining the prefix 'pro-' (meaning 'in favor of') with the noun 'conviction' (meaning 'a formal declaration that someone is guilty of a criminal offense').","priority":"N/A"},"pronunciation":{"ipa":"/ˌproʊkənˈvɪkʃən/","syllables":"pro-con-vic-tion"},"inflection":{"noun_plural":"proconvictions"},"usage_notes":{"explanation":"'Proconviction' is a term primarily used in legal contexts, particularly when discussing potential biases in the judicial system. It refers to a mindset or tendency to assume guilt rather than innocence, which can undermine the fairness of a trial. It is often discussed in relation to jury selection, media influence, and judicial impartiality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lawyer argued for proconviction of his client.","correct":"✓ The lawyer argued against proconviction of his client.","note":"Lawyers typically argue *against* proconviction, as it implies bias against their client."},{"incorrect":"✗ Proconviction is a good thing in the justice system.","correct":"✓ Proconviction is a detrimental bias in the justice system.","note":"Proconviction is generally considered a negative trait in the justice system, as it opposes the principle of presumed innocence."}],"priority":"★★☆"},"related_words":{"derivatives":["conviction","prejudice","bias","impartiality","presumption of innocence"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'proconviction' is a specialized term primarily used in legal and academic contexts. It describes a bias or predisposition towards believing in the guilt of a defendant before all the evidence has been presented in a trial. Understanding this term requires familiarity with legal concepts such as due process, presumption of innocence, and the role of impartiality in the justice system. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The defense attorney worried about the proconviction sentiment among potential jurors.","translation":"弁護士は、潜在的な陪審員の間にある有罪判決を支持する感情を懸念した。","type":"noun","meaning_category":"bias"},{"sentence":"The study aimed to identify factors contributing to proconviction in criminal trials.","translation":"その研究は、刑事裁判における有罪判決への偏見に寄与する要因を特定することを目的とした。","type":"noun","meaning_category":"bias"}]}