{"word":"nondecadency","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of not being decadent; absence of decadence.","english_definition":"The state or quality of not being decadent; absence of decadence.","examples":[{"sentence":"The society valued nondecadency and upheld traditional values.","translation":"その社会は非退廃を重んじ、伝統的な価値観を支持した。"},{"sentence":"The artist's work reflected a commitment to nondecadency and moral purity.","translation":"その芸術家の作品は、非退廃と道徳的純粋さへのコミットメントを反映していた。"}],"collocations":["promote nondecadency","value nondecadency","maintain nondecadency"],"synonyms":["moral purity","wholesomeness","uprightness","virtue","integrity"],"antonyms":["decadence","corruption","degeneration"]}],"etymology":{"value":"Formed by adding the prefix \"non-\" (meaning \"not\") to the word \"decadency\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.dɪˈkeɪ.dən.si/","syllables":"non-de-cay-den-cy"},"inflection":{"noun_plural":"nondecadencies"},"usage_notes":{"explanation":"\"Nondecadency\" is a relatively rare and formal term. It is used to describe a state or quality that is the opposite of decadence, emphasizing moral or cultural purity and the absence of decline.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nondecadency of the building was impressive.","correct":"✓ The simplicity and functionality of the building were impressive.","note":"\"Nondecadency\" refers to a moral or cultural state, not a physical attribute. Use terms like \"simplicity,\" \"functionality,\" or \"unadorned\" to describe a building's lack of ornamentation."}],"priority":"★★☆"},"related_words":{"derivatives":["nondecadent (adjective)"],"antonyms":["decadence","decadent"],"related_concepts":["asceticism","puritanism","moralism"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"nondecadency\" is a formal and abstract term, rarely used in everyday language. It refers to the absence of decadence, which is a state of moral or cultural decline characterized by excessive indulgence and luxury. Understanding this word requires a strong grasp of abstract concepts and a wide vocabulary. It is more likely to be encountered in academic or philosophical discussions."},"example_sentences":[{"sentence":"The philosopher argued that a return to nondecadency was essential for societal health.","translation":"その哲学者は、社会の健全さには非退廃への回帰が不可欠であると主張した。","type":"general","meaning_category":"absence of decadence"},{"sentence":"The leader promoted policies aimed at fostering nondecadency and traditional values.","translation":"その指導者は、非退廃と伝統的価値観を育成することを目的とした政策を推進した。","type":"political","meaning_category":"absence of decadence"}]}