{"word":"tender-bodied","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having a delicate or fragile body; easily injured or hurt.","english_definition":"Having a body that is delicate, fragile, or easily injured; lacking physical toughness.","examples":[{"sentence":"The newborn foal was tender-bodied and needed careful handling.","translation":"生まれたばかりの子馬は体が弱く、慎重な扱いが必要だった。"},{"sentence":"She was always a tender-bodied child, prone to illness.","translation":"彼女はいつも体が弱く、病気にかかりやすい子供だった。"},{"sentence":"The plant has tender-bodied stems that are easily broken.","translation":"その植物は茎が弱く、簡単に折れてしまう。"}],"collocations":["tender-bodied child","tender-bodied plant","tender-bodied animal"],"synonyms":["fragile","delicate","weak","frail","vulnerable","susceptible"],"antonyms":["robust","sturdy","tough","hardy","resilient"]}],"etymology":{"value":"The word is a compound of 'tender' (meaning delicate, soft, or easily damaged) and 'bodied' (having a body of a particular type).","priority":"N/A"},"pronunciation":{"ipa":"ˈtendərˌbɒdid","syllables":"ten-der-bod-ied"},"inflection":{"notes":"This is an adjective and does not have plural forms."},"usage_notes":{"explanation":"'Tender-bodied' describes something or someone with a physique that is not resilient. It implies a lack of physical strength or resistance to injury. It is often used to describe young animals, children, or plants.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The tender-bodied car crashed.","correct":"✓ The fragile car crashed.","note":"'Tender-bodied' is usually reserved for living things or plants, not inanimate objects like cars. Use 'fragile' instead."}],"priority":"N/A"},"related_words":{"derivatives":["tenderness","body"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'tender-bodied' describes something that has a delicate or fragile body. It's not a very common word, so it's more likely to be found in writing than in everyday conversation. If you see this word, it means that whatever is being described is easily hurt or injured because it lacks physical strength or toughness."},"example_sentences":[{"sentence":"The tender-bodied chicks huddled together for warmth.","translation":"体の弱い雛たちは暖を求めて身を寄せ合った。","type":"adjective","meaning_category":"fragile"},{"sentence":"The tender-bodied seedlings needed protection from the harsh sun.","translation":"体の弱い苗は強い日差しから保護する必要があった。","type":"adjective","meaning_category":"delicate"}]}