{"word":"microdensitometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"微小濃度計、微小面積濃度計","english_definition":"An instrument for measuring the optical density of very small areas, typically on photographic film or plates.","examples":[{"sentence":"The microdensitometer was used to analyze the X-ray diffraction patterns.","translation":"微小濃度計は、X線回折パターンを分析するために使用されました。"},{"sentence":"The instrument is a scanning microdensitometer.","translation":"その装置は走査型微小濃度計です。"}],"collocations":["scanning microdensitometer","use a microdensitometer","analyze with a microdensitometer"],"synonyms":["densitometer","microphotometer"],"antonyms":[]}],"etymology":{"value":"'micro-' (small) + 'densitometer' (an instrument for measuring optical density).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪkroʊdɛnˈsɪtəmɪtər/","syllables":"mi-cro-den-si-tom-e-ter"},"inflection":{"noun_plural":"microdensitometers"},"usage_notes":{"explanation":"A microdensitometer is a specialized densitometer designed to measure the optical density (degree of darkness) of very small areas, often on the order of micrometers. It is commonly used in scientific and industrial applications where precise measurements of density variations are required.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The microdensitometer measures density of large areas.","correct":"✓ The microdensitometer measures density of small areas.","note":"Microdensitometers are specifically designed for small areas."}],"priority":"★★☆"},"related_words":{"derivatives":["densitometry"],"related_terms":["optical density","photographic film","spectrophotometer"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'microdensitometer' refers to a scientific instrument used for precise measurement of optical density in very small areas. It is typically encountered in technical or scientific contexts, such as materials science, astronomy, or photography analysis. Understanding requires familiarity with basic concepts of optics and measurement techniques."},"example_sentences":[{"sentence":"The **microdensitometer** provided precise measurements of the film's density variations.","translation":"微小濃度計は、フィルムの濃度変化の正確な測定値を提供しました。","type":"general"},{"sentence":"Using a **microdensitometer**, we analyzed the spectral lines on the photographic plate.","translation":"微小濃度計を用いて、写真乾板上のスペクトル線を分析しました。","type":"scientific"}]}