{"word":"Anti-Trinitarianism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"反三位一体説","english_definition":"The theological position that rejects the doctrine of the Trinity – the belief that God is three distinct persons (Father, Son, and Holy Spirit) who are one in essence.","examples":[{"sentence":"Anti-Trinitarianism has existed in various forms throughout Christian history.","translation":"反三位一体説は、キリスト教の歴史を通じて様々な形で存在してきた。"},{"sentence":"Some modern religious movements hold Anti-Trinitarian views.","translation":"現代の宗教運動の中には、反三位一体の立場をとるものもある。"}],"collocations":["Anti-Trinitarian belief","Anti-Trinitarian theology","historical Anti-Trinitarianism","modern Anti-Trinitarianism"],"synonyms":["Non-Trinitarianism","Unitarianism (sometimes)"],"antonyms":["Trinitarianism"]}],"etymology":{"value":"The term 'Anti-Trinitarianism' is formed from 'anti-' (against), 'Trinitarian' (relating to the Trinity), and '-ism' (a doctrine or belief system).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˌtrɪnɪˈtɛəriənɪzəm/","syllables":"An-ti-Tri-ni-TAR-i-an-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Anti-Trinitarianism encompasses a range of beliefs that reject the traditional Christian doctrine of the Trinity. These beliefs may include the view that Jesus is subordinate to God the Father, or that the Holy Spirit is not a distinct person. It is important to note that Anti-Trinitarianism is not a single, unified movement, but rather a collection of diverse theological positions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Anti-Trinitarianism believe in one God in three persons.","correct":"✓ Anti-Trinitarianism rejects the belief in one God in three persons.","note":"Anti-Trinitarianism, by definition, rejects the Trinity, which is the belief in one God in three persons."}],"priority":"★★☆"},"related_words":{"derivatives":["Anti-Trinitarian (adjective, noun)","Trinitarianism (noun)","Trinitarian (adjective, noun)"],"phrasal_verbs":null,"priority":"★★☆"},"level_frequency":{"level":null,"frequency_google_ngram":"Low frequency - Primarily used in theological discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Anti-Trinitarianism' is a complex theological term referring to the rejection of the Christian doctrine of the Trinity. Understanding this term requires familiarity with Christian theology and the historical debates surrounding the nature of God. It is primarily used in religious studies and theological contexts."},"example_sentences":[{"sentence":"The history of Anti-Trinitarianism is complex and varied, with different groups holding distinct beliefs.","translation":"反三位一体説の歴史は複雑かつ多様であり、異なるグループがそれぞれ異なる信念を持っていた。","type":"noun","meaning_category":"Rejection of the Trinity"},{"sentence":"Early forms of Anti-Trinitarianism can be traced back to the first centuries of Christianity.","translation":"初期の反三位一体説は、キリスト教の最初の数世紀に遡ることができる。","type":"noun","meaning_category":"Rejection of the Trinity"}]}