{"word":"keterjangkauan","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"affordability, accessibility","english_definition":"The extent to which something is affordable or accessible to a particular group of people.","examples":[{"sentence":"Pemerintah berupaya meningkatkan keterjangkauan layanan kesehatan bagi seluruh warga negara.","translation":"The government is trying to improve the accessibility of healthcare services for all citizens."}],"collocations":["keterjangkauan harga (price affordability)","keterjangkauan layanan (service accessibility)","meningkatkan keterjangkauan (increase affordability/accessibility)","tingkat keterjangkauan (level of affordability/accessibility)"],"synonyms":["kemampuan (ability)","aksesibilitas (accessibility)","kemudahan (ease of access)"],"antonyms":["ketidakmampuan (inability)","ketidakaksesibilitasan (inaccessibility)"]}],"etymology":{"value":"Derived from the Indonesian word 'terjangkau' which means 'affordable' or 'reachable'. The prefix 'ke- -an' is added to form a noun indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/kə.tər.d͡ʒɑŋˈkau̯.an/","syllables":"ke-ter-jang-kau-an"},"inflection":{"noun_plural":"keterjangkauan (unchanged)"},"usage_notes":{"explanation":"'Keterjangkauan' is a noun that refers to the quality or state of being affordable or accessible. It is commonly used in discussions about economics, social services, and public policy. The term can refer to both the financial affordability of something (like housing or education) and the physical accessibility of something (like transportation or healthcare).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Keterjangkauan adalah sangat penting.","correct":"✓ Keterjangkauan sangat penting.","note":"The word 'adalah' (is) is often unnecessary in Indonesian sentences, especially when the subject is a noun."},{"incorrect":"✗ Dia punya keterjangkauan untuk membeli mobil.","correct":"✓ Dia memiliki kemampuan untuk membeli mobil.","note":"'Keterjangkauan' refers to the quality of being affordable, not the ability of a person to afford something. Use 'kemampuan' (ability) instead."}],"priority":"★★☆"},"related_words":{"derivatives":["terjangkau (affordable, reachable)","menjangkau (to reach, to afford)"],"phrases":["daya beli (purchasing power)","harga terjangkau (affordable price)","akses mudah (easy access)"],"priority":"★★★"},"level_frequency":{"frequency_corpus":"Common in formal contexts such as news articles, government reports, and academic papers.","priority":"★☆☆"},"readability_explanation":{"level":"Intermediate","text":"'Keterjangkauan' is a formal Indonesian word that means 'affordability' or 'accessibility'. It is used to describe how easy or difficult it is for people to obtain something, usually because of its price or location. You will often see this word in news articles or reports about social issues, such as housing, healthcare, or education."},"example_sentences":[{"sentence":"Pemerintah sedang mencari cara untuk meningkatkan keterjangkauan perumahan bagi masyarakat berpenghasilan rendah.","translation":"The government is looking for ways to increase housing affordability for low-income communities.","type":"general"},{"sentence":"Keterjangkauan transportasi umum sangat penting bagi pekerja yang tinggal di pinggiran kota.","translation":"The accessibility of public transportation is very important for workers who live in the suburbs.","type":"general"},{"sentence":"Program ini bertujuan untuk meningkatkan keterjangkauan pendidikan tinggi bagi siswa dari keluarga kurang mampu.","translation":"This program aims to increase the affordability of higher education for students from underprivileged families.","type":"specific"}]}