{"word":"leprously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"らい病のように、らい病患者のように","english_definition":"In a manner resembling leprosy or a person afflicted with leprosy.","examples":[{"sentence":"The old walls were leprously stained with damp.","translation":"古い壁は湿気でらい病のように染まっていた。"},{"sentence":"He was treated leprously by his peers after the scandal.","translation":"スキャンダルの後、彼は同僚かららい病患者のように扱われた。"}],"collocations":["leprously stained","treat someone leprously"],"synonyms":["diseasedly","contagiously","repulsively","outcastly"],"antonyms":["healthily","cleanly","attractively"]}],"etymology":{"value":"\"leprous\" + \"-ly\". \"Leprous\" comes from Old French \"lepreus\" (having leprosy), from Latin \"leprosus\" (scaly, leprous), from \"lepra\" (leprosy), from Greek \"lepros\" (scaly, rough-skinned), from \"lepos\" (scale, rind).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛprəsli/","syllables":"lep-rous-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"The word \"leprously\" is generally used to describe something that resembles the effects or appearance of leprosy. It can also be used metaphorically to describe how someone is treated as an outcast or pariah, similar to how people with leprosy were historically treated. Because of the historical stigma associated with leprosy, use of this word can be considered offensive or insensitive in some contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The paint peeled leprously from the wall, revealing a fresh coat underneath.","correct":"✓ The paint peeled in flakes from the wall, revealing a fresh coat underneath.","note":"While \"leprously\" can describe peeling or flaking, it carries a strong negative connotation. Using a more neutral term like \"in flakes\" is often preferable."}],"priority":"★☆☆"},"related_words":{"derivatives":["leprous (adjective)","leprosy (noun)"],"related_terms":["leper (noun)","contagious (adjective)","outcast (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"leprously\" is a rare and highly specific term. It describes something resembling leprosy, a chronic infectious disease causing skin lesions and nerve damage. Due to the historical stigma associated with leprosy, the term can be considered offensive, especially when used metaphorically to describe people or situations. It is important to be aware of the potential negative connotations before using this word."},"example_sentences":[{"sentence":"The abandoned building was leprously covered in graffiti.","translation":"その廃墟は、らい病のように落書きで覆われていた。","type":"adverb","meaning_category":"resembling leprosy"},{"sentence":"The politician was leprously avoided by his colleagues after the scandal broke.","translation":"スキャンダルが発覚した後、その政治家は同僚かららい病患者のように避けられた。","type":"adverb","meaning_category":"treated as an outcast"}]}