{"word":"esthesiometry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"知覚閾値測定法、感覚閾値測定法","english_definition":"The measurement of tactile sensibility or cutaneous sensation.","examples":[{"sentence":"Esthesiometry is used to assess nerve damage.","translation":"知覚閾値測定法は神経損傷の評価に用いられる。"},{"sentence":"The doctor performed esthesiometry to determine the extent of the patient's sensory loss.","translation":"医師は患者の感覚喪失の程度を判断するために知覚閾値測定法を実施した。"}],"collocations":["perform esthesiometry","tactile esthesiometry","cutaneous esthesiometry"],"synonyms":["sensory threshold measurement","tactile sensibility testing"],"antonyms":[]}],"etymology":{"value":"From Greek 'aisthesis' (sensation) + '-metry' (measurement).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛsθiːziˈɒmɪtri/","syllables":"es-the-si-om-e-try"},"inflection":{"noun_plural":"esthesiometries"},"usage_notes":{"explanation":"Esthesiometry is a medical technique used to measure the sensitivity of the skin to touch, pressure, or other stimuli. It is often used to diagnose nerve damage or other conditions that affect sensory perception.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Esthesiometry is a treatment for nerve damage.","correct":"✓ Esthesiometry is a diagnostic tool for nerve damage.","note":"Esthesiometry is a diagnostic procedure, not a treatment."}],"priority":"★☆☆"},"related_words":{"derivatives":["esthesiometer"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Esthesiometry is a specialized medical term referring to the quantitative measurement of cutaneous or tactile sensibility. It's primarily encountered in medical contexts, specifically neurology or physical medicine, where assessing sensory nerve function is crucial. The term's complexity and specific application make it unlikely to appear in general English discourse."},"example_sentences":[{"sentence":"Quantitative esthesiometry revealed a significant decrease in tactile sensitivity in the affected limb.","translation":"定量的な知覚閾値測定法により、患肢の触覚感受性の著しい低下が明らかになった。","type":"noun","meaning_category":"知覚閾値測定法"},{"sentence":"The study utilized Semmes-Weinstein monofilaments for esthesiometry testing on diabetic patients.","translation":"その研究では、糖尿病患者の知覚閾値測定法検査にSemmes-Weinsteinモノフィラメントを使用した。","type":"noun","meaning_category":"知覚閾値測定法"}]}