{"word":"milkstone","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"牛乳石、乳石","english_definition":"A deposit of calcium and other minerals, proteins, and fats that forms on dairy equipment due to inadequate cleaning.","examples":[{"sentence":"Milkstone can harbor bacteria and reduce the efficiency of heat transfer in dairy processing equipment.","translation":"牛乳石は細菌の温床となり、乳製品加工装置における熱伝達の効率を低下させる可能性があります。"},{"sentence":"Regular cleaning with appropriate detergents is essential to prevent the formation of milkstone.","translation":"牛乳石の形成を防ぐためには、適切な洗剤で定期的に洗浄することが不可欠です。"},{"sentence":"The presence of milkstone can affect the flavor and quality of milk products.","translation":"牛乳石の存在は、牛乳製品の風味と品質に影響を与える可能性があります。"}],"collocations":["remove milkstone","prevent milkstone formation","milkstone deposit","dairy equipment milkstone","acid cleaner for milkstone"],"synonyms":["dairy scale","milk scale"],"antonyms":[]},{"part_of_speech":"noun","definition":"(比喩的に)牛乳石のようにこびり付いたもの、除去困難な汚れ","english_definition":"(Figuratively) Something that is difficult to remove or get rid of, like milkstone.","examples":[{"sentence":"Years of neglect had left a milkstone of apathy in the community.","translation":"長年の放置は、地域社会に牛乳石のような無関心をもたらした。"},{"sentence":"The old prejudices had become a milkstone on their thinking.","translation":"古い偏見は、彼らの考えに牛乳石のようにこびり付いていた。"}],"collocations":[],"synonyms":["encrustation","sediment","residue"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'milk' and 'stone', referring to the hard, stone-like deposit formed from milk residue.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɪlkˌstoʊn/","syllables":"milk-stone"},"inflection":{"noun_plural":"milkstones"},"usage_notes":{"explanation":"'Milkstone' refers specifically to the buildup on dairy equipment. In technical contexts, it's crucial to use the term accurately to describe this specific type of deposit.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The farmer used regular soap to clean the milkstone.","correct":"✓ The farmer used an acid cleaner to remove the milkstone.","note":"Milkstone requires specialized acid cleaners for effective removal, not regular soap."}],"priority":"★★☆"},"related_words":{"derivatives":["milky","stone","scale"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in specialized contexts related to dairy farming and food processing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Milkstone' is a technical term primarily used in the dairy industry. Understanding its meaning requires knowledge of dairy equipment and cleaning processes. The figurative use requires a good grasp of metaphorical language.","priority":"★★☆"},"example_sentences":[{"sentence":"Acid cleaners are effective in removing **milkstone** from stainless steel surfaces.","translation":"酸性洗剤は、ステンレス鋼の表面から牛乳石を除去するのに効果的です。","type":"noun","meaning_category":"牛乳石"},{"sentence":"The accumulation of **milkstone** can lead to unsanitary conditions in dairy processing plants.","translation":"牛乳石の蓄積は、乳製品加工工場における非衛生的な状態につながる可能性があります。","type":"noun","meaning_category":"牛乳石"},{"sentence":"Proper sanitation practices are crucial to prevent the formation of **milkstone** on milking equipment.","translation":"適切な衛生管理は、搾乳装置への牛乳石の形成を防ぐために重要です。","type":"noun","meaning_category":"牛乳石"}]}