{"word":"untwirled","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(巻かれたものを)ほどく、ほどいて広げる","english_definition":"to unwind or uncoil something that was twirled or coiled.","examples":[{"sentence":"She untwirled the ribbon from the gift.","translation":"彼女は贈り物からリボンをほどいた。"},{"sentence":"He carefully untwirled the wire to straighten it.","translation":"彼はワイヤーをまっすぐにするために注意深くほどいた。"}],"collocations":["untwirl a ribbon","untwirl a wire","untwirl a coil"],"synonyms":["unwind","uncoil","unravel","straighten"],"antonyms":["twirl","coil","wind","wrap"]}],"etymology":{"value":"\"Untwirled\" is formed by adding the prefix \"un-\" (meaning 'not' or 'opposite of') to the past participle of the verb \"twirl.\" \"Twirl\" comes from Middle English, possibly related to \"thirl\" (to pierce or drill), suggesting a turning or twisting motion.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈtwɜːrld/","syllables":"un-twirled"},"inflection":{"verb_forms":{"present_simple":["untwirl","untwirls"],"past_simple":"untwirled","past_participle":"untwirled","present_participle":"untwirling"}},"usage_notes":{"explanation":"\"Untwirled\" is the past tense and past participle of \"untwirl,\" which means to undo something that has been twirled or coiled. It describes the action of reversing the twisting motion. This word is relatively uncommon and is often used in descriptive or narrative contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He untwirled the rope around the tree.","correct":"✓ He unwound/untied the rope around the tree.","note":"If the rope is simply wrapped around the tree, \"unwound\" or \"untied\" might be more appropriate. \"Untwirled\" implies a twisting or coiling motion that is being undone."}],"priority":"★☆☆"},"related_words":{"derivatives":["untwirl (verb - to undo a twirl)","twirl (verb - to spin quickly; noun - a spinning motion)","twirling (adjective - describing something that is twirling)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Untwirled\" is a relatively uncommon word that describes the action of undoing something that has been twisted or coiled. It is formed by adding the prefix \"un-\" to \"twirled,\" indicating the reversal of the twirling action. This word is more likely to be found in descriptive writing or specialized contexts where the specific action of untwisting is relevant. Understanding the root word \"twirl\" is helpful in comprehending the meaning of \"untwirled.\""},"example_sentences":[{"sentence":"The magician untwirled the silk scarf, revealing a dove.","translation":"マジシャンはシルクのスカーフをほどき、ハトを現れさせた。","type":"verb","meaning_category":"ほどく"},{"sentence":"She gently untwirled the yarn from the tangled ball.","translation":"彼女は絡まったボールから優しく糸をほどいた。","type":"verb","meaning_category":"ほどく"}]}