{"word":"organelle","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"細胞小器官","english_definition":"A specialized subunit within a cell that has a specific function, and is usually separately enclosed within its own membrane.","examples":[{"sentence":"Mitochondria are organelles responsible for energy production in the cell.","translation":"ミトコンドリアは、細胞内のエネルギー産生を担う細胞小器官です。"},{"sentence":"The nucleus is the largest organelle in most eukaryotic cells.","translation":"核は、ほとんどの真核細胞において最大の細胞小器官です。"},{"sentence":"Organelles work together to carry out the cell's functions.","translation":"細胞小器官は協力して細胞の機能を実行します。"}],"collocations":["cell organelle","membrane-bound organelle","major organelle","specific organelle","organelle function","organelle structure"],"synonyms":["cellular component","cell structure"],"antonyms":[]}],"etymology":{"value":"From 'organ' (referring to a body part with a specific function) + '-elle' (a diminutive suffix, indicating something small). Coined in the late 19th century to describe the functional units within cells.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɔːrɡəˈnel/","syllables":"or-ga-nelle"},"inflection":{"noun_plural":"organelles"},"usage_notes":{"explanation":"'Organelle' refers specifically to the functional subunits within a cell, analogous to organs in a body. It's a term primarily used in biology, cell biology, and related fields. The key characteristic of an organelle is that it performs a specific function necessary for the cell's survival and operation. Many, but not all, organelles are membrane-bound.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Organelles are only found in prokaryotic cells.","correct":"✓ Organelles are primarily found in eukaryotic cells.","note":"While some structures exist in prokaryotic cells that perform similar functions, the term 'organelle' is most commonly associated with the membrane-bound structures found in eukaryotic cells."},{"incorrect":"✗ The cell wall is an organelle.","correct":"✓ The cell wall is a cell structure, but not an organelle (in plant cells).","note":"The cell wall, while an important part of the cell, is not typically classified as an organelle, especially in plant cells. It's considered a cell structure or component."}],"priority":"★★☆"},"related_words":{"derivatives":["organ (related to the function of organelles)","cellular (related to cells)","cytoplasm (the fluid within a cell where organelles are located)"],"phrases":["membrane-bound organelle (an organelle enclosed by a membrane)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'organelle' is a specialized term used in cell biology. It refers to distinct structures within a cell that perform specific functions, similar to how organs function within a body. Understanding the concept requires familiarity with basic cell biology concepts, including the differences between prokaryotic and eukaryotic cells, and the functions of key organelles like mitochondria and the nucleus. Because it's a technical term, it's primarily encountered in scientific literature and educational contexts related to biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The endoplasmic reticulum is an **organelle** involved in protein synthesis and transport.","translation":"小胞体は、タンパク質合成と輸送に関与する細胞小器官です。","type":"general","meaning_category":"function"},{"sentence":"Different types of cells contain different sets of **organelles**, depending on their function.","translation":"細胞の種類によって、その機能に応じて異なる種類の細胞小器官が含まれています。","type":"general","meaning_category":"types"},{"sentence":"The study focused on the role of a specific **organelle** in cellular aging.","translation":"その研究は、細胞老化における特定の細胞小器官の役割に焦点を当てていました。","type":"research","meaning_category":"research"}]}