{"word":"nephrocyte","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(昆虫などの)腎細胞","english_definition":"A specialized cell in insects and some other invertebrates that functions in filtration and excretion, similar to a kidney cell.","examples":[{"sentence":"Nephrocytes play a crucial role in the detoxification process in insects.","translation":"腎細胞は昆虫の解毒過程において重要な役割を果たします。"},{"sentence":"The structure of nephrocytes allows them to efficiently filter hemolymph.","translation":"腎細胞の構造は、それらが効率的に血リンパを濾過することを可能にします。"}],"collocations":["pericardial nephrocyte","filtration by nephrocytes","insect nephrocyte"],"synonyms":["pericardial cell","excretory cell"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'nephros' (kidney) and 'kytos' (cell).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnɛfroʊˌsaɪt/","syllables":"neph-ro-cyte"},"inflection":{"noun_plural":"nephrocytes"},"usage_notes":{"explanation":"Nephrocytes are specialized cells found in insects and some other invertebrates. They function similarly to kidney cells in vertebrates, playing a role in filtration and excretion. These cells are particularly important for removing toxins and maintaining homeostasis in the hemolymph (insect blood).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Nephrocytes are found in vertebrates.","correct":"✓ Nephrocytes are found in invertebrates, such as insects.","note":"Nephrocytes are characteristic of invertebrates, not vertebrates."}],"priority":"★☆☆"},"related_words":{"derivatives":["nephric","nephridium","nephrology"],"related_terms":["hemolymph","excretion","filtration","invertebrate"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nephrocyte' is a technical term used in biology, specifically in the context of invertebrate zoology and physiology. It refers to a specific type of cell that functions in excretion and filtration, similar to a kidney cell in vertebrates. This term is typically encountered in scientific literature or advanced biology courses. Understanding requires familiarity with basic biological concepts such as cells, excretion, and invertebrate anatomy."},"example_sentences":[{"sentence":"The researchers studied the role of nephrocytes in heavy metal detoxification in Drosophila melanogaster.","translation":"研究者たちは、ショウジョウバエにおける重金属解毒における腎細胞の役割を研究しました。","type":"scientific research","meaning_category":"excretion"},{"sentence":"Electron microscopy revealed the complex structure of the nephrocyte filtration apparatus.","translation":"電子顕微鏡は、腎細胞濾過装置の複雑な構造を明らかにしました。","type":"scientific research","meaning_category":"filtration"}]}