{"word":"Petrarchize","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"ペトラルカ風の詩を書く、ペトラルカ風の表現を用いる","english_definition":"To write in the style of Petrarch, especially concerning love poetry.","examples":[{"sentence":"He began to Petrarchize, writing sonnets to his beloved Laura.","translation":"彼はペトラルカ風の詩を書き始め、愛するラウラにソネットを捧げた。"},{"sentence":"Many poets Petrarchized during the Renaissance.","translation":"ルネサンス期には多くの詩人がペトラルカ風の詩を書いた。"}],"collocations":["Petrarchize about love","Petrarchize in sonnets"],"synonyms":["write sonnets","imitate Petrarch","use Petrarchan conceits"],"antonyms":[]},{"part_of_speech":"verb","transitivity":"vt","definition":"（女性を）ペトラルカ風に理想化する、美化する","english_definition":"To idealize or romanticize (a woman) in the manner of Petrarch.","examples":[{"sentence":"He Petrarchized her, describing her beauty in exaggerated terms.","translation":"彼は彼女をペトラルカ風に理想化し、彼女の美しさを誇張した表現で描写した。"},{"sentence":"The poet Petrarchized his muse, attributing to her every virtue.","translation":"その詩人はミューズをペトラルカ風に美化し、彼女にあらゆる美徳を帰した。"}],"collocations":["Petrarchize a woman","Petrarchize a lover"],"synonyms":["idealize","romanticize","idolize","deify"],"antonyms":["realistically portray"]}],"etymology":{"value":"From the name of the Italian poet Petrarch (Francesco Petrarca, 1304-1374), known for his love sonnets to Laura. The suffix '-ize' indicates the act of imitating or following the style of Petrarch.","priority":"★★★"},"pronunciation":{"ipa":"/pɪˈtrɑːrkaɪz/","syllables":"Pe-trar-chize"},"inflection":{"verb_forms":{"present_simple":["Petrarchize","Petrarchizes"],"past_simple":"Petrarchized","past_participle":"Petrarchized","present_participle":"Petrarchizing"}},"usage_notes":{"explanation":"'Petrarchize' refers to the act of writing or expressing oneself in the style of Petrarch, particularly in the context of love poetry. It often involves idealizing the beloved and using elaborate metaphors and conceits. The term can also describe the act of idealizing a woman in a romanticized, often unrealistic, manner.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He Petrarchized the building's architecture.","correct":"✓ He admired the building's architecture.","note":"'Petrarchize' is typically used in the context of love poetry or the idealization of a person, not inanimate objects like buildings."},{"incorrect":"✗ She Petrarchized the historical events.","correct":"✓ She romanticized the historical events.","note":"While 'Petrarchize' involves romanticization, it is specifically linked to the style of Petrarch, especially in love poetry. For general romanticization, 'romanticize' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["Petrarchan (adjective: relating to Petrarch or his style)","Petrarchism (noun: the style or influence of Petrarch)"],"phrases":["Petrarchan sonnet (noun: a sonnet form popularized by Petrarch)","Petrarchan conceit (noun: an elaborate metaphor or simile in the style of Petrarch)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Petrarchize' is a relatively uncommon word that refers to writing or expressing oneself in the style of Petrarch, particularly in love poetry. It often involves idealizing the beloved and using elaborate metaphors. This word is most likely to be encountered in the context of literary studies or discussions of Renaissance poetry."},"example_sentences":[{"sentence":"The young poet tried to Petrarchize his feelings for her in a series of sonnets.","translation":"その若い詩人は、一連のソネットで彼女への気持ちをペトラルカ風に表現しようとした。","type":"verb","meaning_category":"ペトラルカ風の詩を書く"},{"sentence":"Critics accused him of merely Petrarchizing his subject, rather than offering a genuine portrayal.","translation":"批評家たちは、彼が対象を単にペトラルカ風に美化しているだけで、本物の描写を提供していないと非難した。","type":"verb","meaning_category":"（女性を）ペトラルカ風に理想化する"}]}