{"word":"Daitya","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(インド神話)ダイティヤ：カシュヤパ仙とディティ女神の間に生まれたアスラの種族。神々と敵対する。","english_definition":"(Hindu mythology) A race of Asuras, the offspring of Kashyapa and Diti, who are in constant conflict with the gods.","examples":[{"sentence":"The Daityas were known for their immense power and fierce battles against the Devas.","translation":"ダイティヤ族は、その強大な力と神々（デーヴァ）との激しい戦いで知られていた。"}],"collocations":["Daitya army (ダイティヤ軍)","Daitya king (ダイティヤ王)","fight against Daityas (ダイティヤとの戦い)"],"synonyms":["Asura","Rakshasa"],"antonyms":["Deva"],"notes":"Often depicted as powerful and malevolent beings."}],"etymology":{"value":"From Sanskrit 'diti' (दিতি), the name of their mother, with the patronymic suffix '-ya' (य).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdaɪtjə/","syllables":"Dai-tya"},"inflection":{"noun_plural":"Daityas"},"usage_notes":{"explanation":"'Daitya' refers specifically to the descendants of Diti, distinguishing them from other Asuras who may have different origins. The term is primarily used in the context of Hindu mythology and religious texts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Daityas are gods.","correct":"✓ Daityas are anti-gods or demons.","note":"Daityas are generally considered to be anti-gods or demons, not gods."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["Deva (神々)","Asura (阿修羅)","Hindu mythology (ヒンドゥー教神話)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily found in religious or mythological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Daitya' is a specialized term primarily encountered in the context of Hindu mythology. Understanding requires familiarity with Hindu religious narratives and the roles of various beings within those stories. It is not a word commonly used in everyday conversation or general literature.","priority":"★★☆"},"example_sentences":[{"sentence":"In the ancient scriptures, the battle between the Devas and the Daityas is a recurring theme.","translation":"古代の経典では、神々（デーヴァ）とダイティヤの間の戦いが繰り返し語られるテーマとなっている。","type":"general","meaning_category":"mythology"},{"sentence":"The Daitya king sought to conquer the heavens and overthrow the reign of Indra.","translation":"ダイティヤ王は天界を征服し、インドラの支配を覆そうとした。","type":"narrative","meaning_category":"mythology"}]}