{"word":"noncorporate","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"企業的でない、企業に属さない、企業らしくない","english_definition":"Not relating to or characteristic of a corporation; independent of corporate influence or control.","examples":[{"sentence":"The restaurant has a noncorporate atmosphere, with local art on the walls.","translation":"そのレストランは、壁に地元の芸術が飾られており、企業的でない雰囲気を持っている。"},{"sentence":"We prefer to support noncorporate businesses whenever possible.","translation":"私たちは可能な限り、企業に属さないビジネスを支援することを好む。"},{"sentence":"The event was organized by a noncorporate group of volunteers.","translation":"そのイベントは、企業に属さないボランティアグループによって組織された。"}],"collocations":["noncorporate business","noncorporate entity","noncorporate organization","noncorporate culture","noncorporate environment"],"synonyms":["independent","small-business","unaffiliated","grassroots","localized"],"antonyms":["corporate","commercial","businesslike","institutional"],"notes":["Often used to describe businesses, organizations, or environments that are independent, locally owned, and not part of a large corporation."]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'corporate'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈkɔːrpərət/","syllables":"non-cor-po-rate"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"'Noncorporate' is used to describe something that is not associated with large corporations. It often implies a more personal, community-oriented, or independent approach. It can refer to businesses, organizations, or even styles and atmospheres.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-corporate said they were independent.","correct":"✓ The noncorporate business said they were independent.","note":"'Noncorporate' is an adjective, so it needs to modify a noun. It cannot stand alone as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["noncorporation (noun): An entity that is not a corporation."],"related_terms":["small business","independent business","local business","mom-and-pop shop"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, but usage is increasing in certain contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Noncorporate' is a word used to describe something that is not related to or controlled by a large company. It suggests a more independent, local, or personal approach. You might see it used to describe a small business, a community event, or a style that is not mass-produced or standardized."},"example_sentences":[{"sentence":"The festival featured food from noncorporate vendors.","translation":"そのフェスティバルでは、企業に属さない業者からの食べ物が提供された。","type":"general","meaning_category":"企業的でない"},{"sentence":"Many people prefer the noncorporate feel of a locally owned coffee shop.","translation":"多くの人々は、地元経営のコーヒーショップの企業的でない雰囲気を好む。","type":"general","meaning_category":"企業らしくない"},{"sentence":"The organization is committed to supporting noncorporate artists.","translation":"その組織は、企業に属さないアーティストの支援に尽力している。","type":"general","meaning_category":"企業に属さない"}]}