{"word":"Nilometer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ナイルメーター：ナイル川の水位を測るための古代の構造物。水位を記録し、洪水の予測や税金の計算に利用された。","english_definition":"An ancient structure used for measuring the height of the Nile River's water level. It was used to record the water level, predict floods, and calculate taxes.","examples":[{"sentence":"The ancient Egyptians used the Nilometer to predict the annual flooding of the Nile.","translation":"古代エジプト人はナイルメーターを使ってナイル川の毎年の洪水を予測した。"},{"sentence":"The readings from the Nilometer were crucial for determining the agricultural prosperity of the region.","translation":"ナイルメーターの測定値は、その地域の農業の繁栄を決定するために非常に重要だった。"}],"collocations":["measure the Nile (ナイル川を測る)","predict floods (洪水を予測する)","calculate taxes (税金を計算する)","ancient Egypt (古代エジプト)"],"synonyms":["Nile gauge","Nile water level measurer"],"antonyms":[]}],"etymology":{"value":"「Nile」（ナイル川）と「-meter」（測定器）の組み合わせ。","priority":"★★☆"},"pronunciation":{"ipa":"/naɪˈlɒmɪtər/","syllables":"Ni-lom-e-ter"},"inflection":{"noun_plural":"Nilometers"},"usage_notes":{"explanation":"ナイルメーターは、古代エジプト文明において非常に重要な役割を果たしました。ナイル川の氾濫は農業に不可欠であり、その水位を正確に把握することは、作物の収穫量を予測し、税金を公平に徴収するために必要でした。ナイルメーターは、井戸や階段、柱など、さまざまな形状で存在しました。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Nilometer measures the temperature of the Nile.","correct":"✓ The Nilometer measures the water level of the Nile.","note":"ナイルメーターはナイル川の水位を測るものであり、水温を測るものではありません。"},{"incorrect":"✗ Nilometers are still in use today for irrigation.","correct":"✓ Nilometers were primarily used in ancient times for predicting floods and calculating taxes.","note":"ナイルメーターは主に古代に使用され、現代の灌漑には現代的な測定技術が用いられます。"}],"priority":"★★☆"},"related_words":{"derivatives":["Nilotic (形容詞：ナイル川の、ナイル川流域の)"],"phrases":["Ancient Egyptian agriculture","Flood prediction","Tax assessment"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 歴史的な文脈でのみ使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Nilometer」は、古代エジプトでナイル川の水位を測るために使われた歴史的な構造物を指す専門用語です。この単語は、古代エジプトの歴史や水利技術に関する文脈で現れる可能性が高く、一般的な会話ではあまり使われません。理解するには、古代エジプト文明におけるナイル川の重要性と、ナイル川の氾濫が農業や経済に与える影響についての知識があると役立ちます。"},"example_sentences":[{"sentence":"The **Nilometer** at Roda Island is one of the most famous examples of this ancient technology.","translation":"ローダ島のナイルメーターは、この古代技術の最も有名な例の一つです。","type":"noun","meaning_category":"ナイルメーター"},{"sentence":"By observing the **Nilometer**, priests could determine whether the upcoming harvest would be bountiful or meager.","translation":"ナイルメーターを観察することで、神官たちは今後の収穫が豊作になるか不作になるかを判断することができました。","type":"noun","meaning_category":"ナイルメーター"}]}