{"word":"polypsychism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"多魂説：一人の人間が複数の魂を持つという哲学または宗教上の信念","english_definition":"The belief, in philosophy or religion, that a single human being possesses multiple souls.","examples":[{"sentence":"Some ancient cultures held beliefs aligned with polypsychism, attributing different aspects of a person's being to separate souls.","translation":"古代文化の中には多魂説に沿った信念を持ち、人の存在の異なる側面を別々の魂に帰属させるものもあった。"}],"collocations":["belief in polypsychism","ancient polypsychism","philosophical polypsychism"],"synonyms":["multiple souls","plural souls","composite soul"],"antonyms":["monopsychism (単魂説)","single soul"],"notes":"Polypsychism is a relatively rare concept, often found in discussions of comparative religion or philosophy of mind."}],"etymology":{"value":"Derived from the Greek words 'poly' (many) and 'psyche' (soul, mind).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒlɪˈsaɪkɪzəm/","syllables":"pol-y-sy-chi-sm"},"inflection":{"noun_plural":"polypsychisms"},"usage_notes":{"explanation":"Polypsychism is a concept primarily encountered in philosophical and religious contexts. It posits that a person's consciousness, personality, and various functions are governed by multiple distinct souls or spirits, rather than a single, unified soul. This contrasts with monopsychism, the more common belief in a single soul.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Polypsychism is the belief in one soul.","correct":"✓ Polypsychism is the belief in multiple souls.","note":"Polypsychism refers to multiple souls, not a single one."}],"priority":"★★★"},"related_words":{"derivatives":["polypsychic (adjective)"],"related_concepts":["monopsychism","soul","spirit","dualism","philosophy of mind","religious beliefs"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - a specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polypsychism' is a complex term used in philosophy and religious studies to describe the belief that a person has more than one soul. It's not a common word, so you'll mostly find it in academic discussions about the nature of the soul and consciousness."},"example_sentences":[{"sentence":"The anthropologist studied cultures with beliefs in polypsychism to understand their views on the afterlife.","translation":"人類学者は、死後の世界に対する彼らの見方を理解するために、多魂説の信念を持つ文化を研究した。","type":"general"},{"sentence":"Philosophical debates on polypsychism often explore the implications for personal identity and moral responsibility.","translation":"多魂説に関する哲学的議論では、しばしば個人のアイデンティティと道徳的責任への影響が探求される。","type":"philosophical"}]}