{"word":"Italo-Greek","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"イタリア・ギリシャの、イタリアとギリシャの文化が混ざった","english_definition":"Relating to both Italy and Greece, or to a culture that is a mixture of Italian and Greek elements.","examples":[{"sentence":"The Italo-Greek community in Southern Italy has a unique cultural heritage.","translation":"南イタリアのイタリア・ギリシャ人コミュニティは、独特の文化遺産を持っています。"},{"sentence":"Italo-Greek art flourished during the Byzantine period.","translation":"イタリア・ギリシャ美術はビザンチン時代に繁栄しました。"}],"collocations":["Italo-Greek culture","Italo-Greek community","Italo-Greek art","Italo-Greek history"],"synonyms":["Greco-Italian"],"antonyms":[]},{"part_of_speech":"noun","definition":"イタリア・ギリシャ人、イタリアとギリシャの血を引く人","english_definition":"A person of both Italian and Greek descent.","examples":[{"sentence":"My grandfather was Italo-Greek, so I have roots in both countries.","translation":"私の祖父はイタリア・ギリシャ人だったので、私は両方の国にルーツがあります。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Combination of \"Italo-\" (prefix referring to Italy) and \"Greek\" (referring to Greece).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪtæloʊˈɡriːk/","syllables":"I-ta-lo-Greek"},"inflection":{"notes":"The word does not change form for pluralization."},"usage_notes":{"explanation":"\"Italo-Greek\" refers to something or someone related to both Italy and Greece, often indicating a cultural or historical connection between the two regions. It's commonly used to describe communities, art, or aspects of history where Italian and Greek influences are intertwined.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Italo Greek","correct":"✓ Italo-Greek","note":"The hyphen is important to connect the two words and show they are a single concept."}],"priority":"★★☆"},"related_words":{"derivatives":["Italo-Byzantine"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Italo-Greek\" is a compound word used to describe something that combines elements of both Italian and Greek culture, history, or people. It is most often used in academic or historical contexts to refer to specific communities or artistic styles that arose from the interaction between Italian and Greek influences. It is not a commonly used term in everyday conversation."},"example_sentences":[{"sentence":"Many Italo-Greek churches in Calabria preserve Byzantine architectural features.","translation":"カラブリアの多くのイタリア・ギリシャ教会は、ビザンチン建築の特徴を保持しています。","type":"adjective","meaning_category":"イタリア・ギリシャの"},{"sentence":"The Italo-Greek population in Reggio Calabria maintains unique traditions.","translation":"レッジョ・カラブリアのイタリア・ギリシャ人住民は、独自の伝統を維持しています。","type":"noun","meaning_category":"イタリア・ギリシャ人"}]}