{"word":"Dispassionateness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"冷静さ、公平さ、客観性、感情に左右されないこと","english_definition":"The state or quality of being dispassionate; freedom from passion or emotion; coolness; impartiality.","examples":[{"sentence":"The judge's dispassionateness allowed for a fair trial.","translation":"裁判官の冷静さによって公正な裁判が行われた。"},{"sentence":"Scientists must approach their work with dispassionateness.","translation":"科学者は感情に左右されず、冷静に研究に取り組む必要がある。"},{"sentence":"He spoke about the tragedy with surprising dispassionateness.","translation":"彼はその悲劇について驚くほど冷静に語った。"}],"collocations":["with dispassionateness (冷静に)","show dispassionateness (冷静さを示す)","maintain dispassionateness (冷静さを保つ)","objective dispassionateness (客観的な冷静さ)"],"synonyms":["objectivity","impartiality","detachment","coolness","composure","equanimity","neutrality"],"antonyms":["passion","emotion","bias","partiality","subjectivity","zeal"]}],"etymology":{"value":"Derived from 'dispassionate' (adj.), which combines the prefix 'dis-' (meaning 'not') with 'passionate'. 'Passionate' comes from Late Latin 'passionatus', past participle of 'passionare' ('to affect strongly with feeling'), from Latin 'passio' ('suffering, enduring'). Thus, 'dispassionateness' literally means 'the state of not being affected strongly by feeling'.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈpæʃənətnəs/","syllables":"dis-pash-uh-nate-ness"},"inflection":{"noun_plural":"(uncountable noun)"},"usage_notes":{"explanation":"'Dispassionateness' refers to the quality of being free from strong emotions or personal bias. It is often considered a virtue in situations where objectivity and fairness are important, such as in legal proceedings, scientific research, or decision-making. While it suggests an absence of strong feelings, it does not necessarily imply a lack of empathy or understanding, but rather an ability to consider matters rationally and impartially.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a great dispassionateness for the victims.","correct":"✓ He showed a great dispassionateness in his handling of the situation.","note":"'Dispassionateness' is not usually directed 'for' someone, but rather 'in' how a situation is handled or approached. It refers to a manner of action or thought, not a feeling towards a person."},{"incorrect":"✗ The dispassionateness of the robot was unsettling.","correct":"✓ The lack of emotion in the robot was unsettling.","note":"While 'dispassionateness' describes a lack of strong emotion, it is typically used in the context of human behavior. For robots or inanimate objects, it's more appropriate to describe a 'lack of emotion' or 'lack of feeling'."}],"priority":"★★☆"},"related_words":{"derivatives":["dispassionate (adj.)","dispassionately (adv.)"],"phrasal_verbs":[],"related_concepts":["objectivity","impartiality","neutrality","rationality","fairness","detachment"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - A relatively uncommon word, primarily used in formal or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dispassionateness' is a formal term that describes the quality of being free from strong emotions or personal biases. It's often used in contexts where objectivity and fairness are important, such as in law, science, or decision-making. The word implies an ability to consider matters rationally and impartially, without being swayed by feelings. It's a relatively uncommon word, so you're more likely to encounter it in formal writing or academic discussions."},"example_sentences":[{"sentence":"Her **dispassionateness** during the negotiation allowed her to reach a favorable agreement.","translation":"交渉中の彼女の冷静さのおかげで、有利な合意に達することができた。","type":"noun","meaning_category":"冷静さ・公平さ"},{"sentence":"The historian approached the controversial topic with scholarly **dispassionateness**.","translation":"歴史家はその論争の的となっている話題に学術的な冷静さで取り組んだ。","type":"noun","meaning_category":"客観性"},{"sentence":"The mediator's **dispassionateness** helped the parties find common ground.","translation":"調停者の冷静さが、当事者たちが共通点を見つけるのに役立った。","type":"noun","meaning_category":"感情に左右されないこと"}]}