{"word":"Beastliness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"獣性、獣のような性質、残忍性、極度の不快さ、不道徳さ","english_definition":"The quality or state of being like a beast; brutal or depraved behavior; extreme unpleasantness.","examples":[{"sentence":"The beastliness of the crime shocked the entire nation.","translation":"その犯罪の獣性は国全体に衝撃を与えた。"},{"sentence":"He was disgusted by the beastliness of the living conditions.","translation":"彼は生活環境の極度の不快さにうんざりした。"},{"sentence":"The novel explores the beastliness that can exist within human nature.","translation":"その小説は、人間の本性の中に存在する獣性を探求している。"}],"collocations":["sheer beastliness","utter beastliness","inhuman beastliness","animalistic beastliness"],"synonyms":["brutality","savagery","depravity","inhumanity","atrocity","wickedness","vileness","repulsiveness","horrendousness"],"antonyms":["humanity","kindness","gentleness","civility","decency","pleasantness","agreeableness"]}],"etymology":{"value":"Derived from 'beastly' (adjective), which comes from 'beast' (noun) + '-ly' (suffix indicating a quality or characteristic). The word 'beast' comes from Old French 'beste', from Latin 'bestia' (animal, beast).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbiːstlinəs/","syllables":"beast-li-ness"},"inflection":{"noun_plural":"Beastlinesses (rarely used)"},"usage_notes":{"explanation":"'Beastliness' refers to behavior or conditions that are extremely unpleasant, cruel, or immoral, resembling the actions or nature of a wild animal. It often implies a lack of humanity or civilization. While it can describe literal animalistic behavior, it is more frequently used to condemn human actions that are considered particularly savage or depraved. The term is relatively uncommon in everyday conversation but may be found in literature, historical accounts, or formal discussions of morality and ethics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The beastliness was running in the forest.","correct":"✓ A beast was running in the forest.","note":"'Beastliness' is an abstract noun referring to a quality or state, not a concrete entity. Use 'beast' to refer to an animal. "},{"incorrect":"✗ She showed beastliness to her friend.","correct":"✓ She showed brutality/cruelty to her friend.","note":"While 'beastliness' can describe someone's actions, it's often used to describe a general state or condition. 'Brutality' or 'cruelty' are more direct synonyms for cruel actions."}],"priority":"★★☆"},"related_words":{"derivatives":["beast (noun): an animal, especially a large or wild one.","beastly (adjective): unpleasant; like a beast; cruel.","beastlike (adjective): resembling a beast.","bestial (adjective): relating to beasts; savage.","bestiality (noun): sexual relations between a person and an animal."],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (uncommon, literary or formal usage)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Beastliness' is a relatively uncommon word that describes the quality of being like a beast, especially in a cruel, savage, or depraved way. It's often used to describe human behavior that is considered extremely immoral or inhumane. The word is more likely to be encountered in literature, historical texts, or formal discussions about ethics and morality, rather than in everyday conversation. It suggests a lack of humanity and a descent into animalistic or brutal behavior."},"example_sentences":[{"sentence":"The concentration camp was a scene of unimaginable beastliness.","translation":"その強制収容所は想像を絶する獣性の光景だった。","type":"noun","meaning_category":"残忍性・非道さ"},{"sentence":"He condemned the beastliness of the war and its devastating impact on civilians.","translation":"彼は戦争の獣性と、それが一般市民に与える壊滅的な影響を非難した。","type":"noun","meaning_category":"残忍性・非道さ"},{"sentence":"The squalor and beastliness of the slums were a stark reminder of social inequality.","translation":"スラムの不潔さと極度の不快さは、社会的不平等の厳しい現実をまざまざと示していた。","type":"noun","meaning_category":"極度の不快さ"}]}