{"word":"faience","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ファイアンス焼き、彩釉陶器","english_definition":"glazed earthenware, especially with a delicate pale blue glaze, originally associated with ancient Egypt.","examples":[{"sentence":"The museum has a large collection of Egyptian faience.","translation":"その博物館はエジプトのファイアンス焼きのコレクションを多数所蔵している。"},{"sentence":"Faience beads were often used in ancient jewelry.","translation":"ファイアンスのビーズは古代の宝石によく使われた。"}],"collocations":["Egyptian faience","faience beads","faience pottery","faience amulet"],"synonyms":["glazed earthenware","tin-glazed pottery","majolica","delftware"],"antonyms":[]},{"part_of_speech":"noun","definition":"（一般的に）彩釉を施した陶器、ガラス質の釉薬をかけた陶器","english_definition":"(more generally) glazed ceramic ware, especially with a vitreous glaze.","examples":[{"sentence":"The artist experimented with different colors of faience.","translation":"その芸術家はさまざまな色の彩釉陶器を試した。"},{"sentence":"The faience tiles decorated the walls of the palace.","translation":"彩釉タイルが宮殿の壁を飾っていた。"}],"collocations":["faience tiles","faience figures","faience vessels"],"synonyms":["glazed ceramic","enameled pottery"],"antonyms":[]}],"etymology":{"value":"フランス語の「faïence」（ファイアンス焼き）に由来し、イタリアの都市「Faenza」（ファエンツァ）から来ている。ファエンツァは、ルネサンス期にマヨリカ焼き（錫釉陶器）の重要な生産地であった。マヨリカ焼きは、イスラム世界を経由してスペインに伝わり、その後イタリアに広まった。当初、エジプトの彩釉陶器との関連性は薄かったが、類似の製法や外観から、後に古代エジプトの彩釉陶器も「faience」と呼ばれるようになった。","priority":"★★☆"},"pronunciation":{"ipa":"/faɪˈɑːns/","syllables":"fa-i-ence"},"inflection":{"noun_plural":"faiences"},"usage_notes":{"explanation":"「**faience**」は、特に古代エジプトの青色の彩釉陶器を指すことが多いですが、より一般的には、ガラス質の釉薬をかけた陶器全般を指します。古代エジプトのファイアンスは、宗教的な意味合いを持つ装飾品やアミュレット（魔除け）として用いられました。現代では、博物館や考古学の文脈でよく使われる言葉です。フランス語起源の単語であり、イタリアのファエンツァという都市名に由来します。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a beautiful piece of faience at the flea market, it was made of porcelain.","correct":"✓ I bought a beautiful piece of faience at the flea market.","note":"Faience is a type of earthenware, not porcelain. Porcelain is a different type of ceramic with a distinct composition and firing process."},{"incorrect":"✗ The faience was very expensive because it was made of gold.","correct":"✓ The faience was very expensive because it was very old and rare.","note":"Faience is made of a composite material including silica, not gold. Its value comes from its age, rarity, and historical significance."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["earthenware","ceramics","pottery","glaze","majolica","delftware"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**faience**」は、特に古代エジプトで作られた、明るい青色のガラス質の釉薬をかけた陶器を指す専門用語です。より一般的には、同様の製法で作られた彩釉陶器全般を指すこともあります。考古学、美術史、博物館学などの分野でよく用いられます。日常会話ではほとんど使われません。フランス語に由来し、イタリアの都市ファエンツァが語源です。"},"example_sentences":[{"sentence":"The ancient Egyptians used faience to create intricate jewelry and amulets.","translation":"古代エジプト人は、ファイアンスを使って複雑な宝石やアミュレットを作った。","type":"noun","meaning_category":"彩釉陶器"},{"sentence":"The museum's collection includes a wide range of faience objects from different periods.","translation":"その博物館のコレクションには、さまざまな時代のファイアンスの品々が幅広く含まれている。","type":"noun","meaning_category":"彩釉陶器"},{"sentence":"The distinctive blue glaze of Egyptian faience is due to the presence of copper compounds.","translation":"エジプトのファイアンス独特の青い釉薬は、銅化合物が含まれているためである。","type":"noun","meaning_category":"彩釉陶器"}]}