{"word":"Laurvikite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ラブラドル長石を含む閃長岩の一種で、ノルウェーのラルヴィク地方で産出される。青色または灰色のシラー効果を示すことが特徴。","english_definition":"A type of syenite containing labradorite, found in the Larvik region of Norway, characterized by its blue or grey schiller effect.","examples":[{"sentence":"The countertop was made of beautiful laurvikite.","translation":"カウンタートップは美しいラブラドル長石で作られていた。"},{"sentence":"Laurvikite is often used as a decorative stone.","translation":"ラブラドル長石は装飾用の石としてよく使われる。"}],"collocations":["laurvikite countertop (ラブラドル長石のカウンタートップ)","laurvikite slab (ラブラドル長石のスラブ)","laurvikite monument (ラブラドル長石の記念碑)"],"synonyms":["blue granite","bird's eye granite"],"antonyms":[]}],"etymology":{"value":"ノルウェーのラルヴィク (Larvik) 地方にちなんで命名。接尾辞「-ite」は、鉱物や岩石を示すために用いられる。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɔːrvɪkaɪt/","syllables":"Laur-vi-kite"},"inflection":{"noun_plural":"laurvikites"},"usage_notes":{"explanation":"Laurvikite is primarily used as a decorative stone due to its attractive iridescence. It's often seen in countertops, facing stone, and monuments. The schiller effect, caused by light interference within the labradorite crystals, gives the stone its distinctive appearance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a laurvikite rock on the beach.","correct":"✓ I saw a laurvikite boulder on the beach.","note":"Laurvikite is a type of rock, so using \"rock\" is redundant. Using \"boulder\" specifies a large rock. However, it is more common to say that you saw a piece of laurvikite, or a laurvikite stone."}],"priority":"★☆☆"},"related_words":{"derivatives":["labradorite (ラブラドル長石)","syenite (閃長岩)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 地質学や石材関連の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Laurvikite**」は、ノルウェーのラルヴィク地方で産出される、青色または灰色のシラー効果が特徴的な閃長岩の一種です。主に建築材料や装飾石材として利用されます。地質学や石材に関する専門的な文脈で使われることが多く、一般的な日常会話ではほとんど使用されません。鉱物学や地学に興味がある人にとっては、興味深い単語かもしれません。"},"example_sentences":[{"sentence":"The building's facade was clad in polished laurvikite.","translation":"その建物のファサードは研磨されたラブラドル長石で覆われていた。","type":"noun","meaning_category":"岩石"},{"sentence":"Laurvikite is a popular choice for kitchen countertops due to its durability and unique appearance.","translation":"ラブラドル長石は、耐久性と独特の外観から、キッチンのカウンタートップとして人気があります。","type":"noun","meaning_category":"岩石"}]}