{"word":"emphyteusis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"永代小作権、地上権に類似する権利","english_definition":"(Roman law) A perpetual or long-term lease of land, often agricultural, in return for a fixed rent or payment. A right similar to a long-term leasehold or a form of land tenure.","examples":[{"sentence":"The farmer held the land under emphyteusis, paying a yearly rent to the landowner.","translation":"その農民は永代小作権に基づいて土地を所有し、地主に年間の地代を支払っていた。"},{"sentence":"Emphyteusis allowed the tenant to improve the land and pass it on to their heirs.","translation":"永代小作権は、小作人が土地を改良し、それを相続人に引き継ぐことを認めていた。"}],"collocations":["grant emphyteusis","hold land under emphyteusis","emphyteutic lease"],"synonyms":["long-term lease","perpetual lease","leasehold","tenancy"],"antonyms":["fee simple","outright ownership"]}],"etymology":{"value":"From Late Latin *emphyteusis*, from Ancient Greek *ἐμφύτευσις* (emphýteusis, “implantation”), from *ἐμφυτεύω* (emphytéūō, “I implant”), from *ἐν* (en, “in”) + *φυτεύω* (phytéūō, “I plant”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛmfɪˈtjuːsɪs/","syllables":"em-phy-teu-sis"},"inflection":{"noun_plural":"emphyteuses"},"usage_notes":{"explanation":"*Emphyteusis* is a term primarily used in legal and historical contexts, particularly when discussing Roman law or systems derived from it. It refers to a specific type of long-term or perpetual leasehold, often involving agricultural land. The tenant (emphyteuta) has significant rights, including the ability to improve the land and pass it on to heirs, in exchange for a fixed rent or payment. The term is relatively rare in modern general usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had an emphyteusis on his car.","correct":"✓ He had a lease on his car.","note":"Emphyteusis specifically refers to land, not movable property like cars."},{"incorrect":"✗ Emphyteusis means owning the land outright.","correct":"✓ Emphyteusis means having a long-term lease on the land.","note":"Emphyteusis is a form of leasehold, not outright ownership."}],"priority":"★★☆"},"related_words":{"derivatives":["emphyteutic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized legal and historical contexts)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Emphyteusis' is a highly specialized legal term referring to a type of long-term land lease originating from Roman law. Understanding this term requires familiarity with legal and historical contexts, particularly those related to land tenure and property rights. Due to its limited usage, it is primarily encountered in academic or legal texts dealing with these specific topics."},"example_sentences":[{"sentence":"Under Roman law, emphyteusis provided a mechanism for cultivating public lands.","translation":"ローマ法の下では、永代小作権は公有地を耕作するための仕組みを提供した。","type":"noun","meaning_category":"永代小作権"},{"sentence":"The emphyteutic lease allowed the tenant to make substantial improvements to the property.","translation":"永代小作権契約により、小作人はその不動産に大幅な改良を加えることができた。","type":"noun","meaning_category":"永代小作権"}]}