{"word":"juration","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 宣誓供述書への署名と宣誓の行為、またはその証明","english_definition":"(law) the act of signing and swearing to an affidavit, or the certificate thereof.","examples":[{"sentence":"The juration was properly administered by a notary public.","translation":"宣誓供述は公証人によって適切に実施された。"},{"sentence":"The document lacked a proper juration, rendering it inadmissible in court.","translation":"その文書には適切な宣誓供述の証明がなく、法廷で証拠として認められなかった。"}],"collocations":["administer a juration","proper juration","valid juration","defective juration"],"synonyms":["affidavit","oath","sworn statement","verification","attestation"],"antonyms":[]}],"etymology":{"value":"Late Latin *juratio*, from Latin *jurare* (to swear).","priority":"★★☆"},"pronunciation":{"ipa":"/dʒʊˈreɪʃən/","syllables":"ju-ra-tion"},"inflection":{"noun_plural":"jurations"},"usage_notes":{"explanation":"'Juration' is a legal term referring specifically to the clause at the end of an affidavit where the affiant swears to the truthfulness of the statement in front of an authorized officer (e.g., a notary public). It is distinct from the affidavit itself, which is the written statement of facts. The juration is the certification by the officer that the oath was duly administered.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The juration is the entire document.","correct":"✓ The juration is the clause at the end of the document where the oath is administered.","note":"The juration is not the entire document, but specifically the part where the oath is certified."}],"priority":"★☆☆"},"related_words":{"derivatives":["jurat (noun: the clause in an affidavit certifying when, where, and before whom it was sworn)","adjure (verb: to charge, bind, or command earnestly and solemnly, often under oath)","jury (noun: a body of people sworn to give a verdict in a legal case on the basis of evidence submitted to them)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Juration' is a technical legal term. Understanding its meaning requires familiarity with legal procedures, particularly those involving affidavits and oaths. It is not commonly used outside of legal contexts."},"example_sentences":[{"sentence":"The notary public stamped the juration on the affidavit.","translation":"公証人は宣誓供述書に宣誓供述の証明の印を押した。","type":"noun","meaning_category":"legal"},{"sentence":"Without a proper juration, the affidavit may be challenged in court.","translation":"適切な宣誓供述の証明がない場合、宣誓供述書は法廷で異議を申し立てられる可能性がある。","type":"noun","meaning_category":"legal"}]}