{"word":"selfhood","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"自己、自己意識、個性、独自性","english_definition":"the state of being an individual or a person; individuality; the quality that constitutes one's individual self.","examples":[{"sentence":"The search for selfhood is a common theme in literature.","translation":"自己探求は文学における共通のテーマです。"},{"sentence":"Losing his memory threatened his sense of selfhood.","translation":"記憶を失うことは彼の自己意識を脅かした。"},{"sentence":"She struggled to maintain her selfhood in the face of societal pressures.","translation":"彼女は社会的な圧力に直面しながらも、自己の独自性を維持しようと奮闘した。"},{"sentence":"The development of selfhood is a crucial part of growing up.","translation":"自己の確立は成長において重要な部分です。"}],"collocations":["sense of selfhood (自己意識)","develop selfhood (自己を確立する)","maintain selfhood (自己を維持する)","explore selfhood (自己を探求する)","threaten selfhood (自己を脅かす)"],"synonyms":["individuality","identity","personality","ego","self","being","existence"],"antonyms":["conformity","sameness","collectivism"]}],"etymology":{"value":"'Self' + '-hood'. The suffix '-hood' indicates a state, condition, or quality. Therefore, 'selfhood' refers to the state or quality of being oneself.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈselfhʊd/","syllables":"self-hood"},"inflection":{"noun_plural":"selfhoods (rarely used)"},"usage_notes":{"explanation":"'Selfhood' is a relatively abstract and philosophical term. It refers to the condition of being an individual, with a distinct identity and consciousness. It is often used in discussions about personal identity, psychology, and philosophy. While grammatically correct, the plural form 'selfhoods' is rarely used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lost his selfhood after the accident, becoming a completely different person.","correct":"✓ He lost his sense of selfhood after the accident, becoming a completely different person.","note":"It is more common to refer to the 'sense of selfhood' rather than simply 'selfhood' when discussing the feeling of personal identity."}],"priority":"★★☆"},"related_words":{"derivatives":["self (noun, adjective, pronoun)","-hood (suffix indicating state or condition)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Selfhood' is a relatively advanced and abstract term that refers to the state of being an individual with a distinct identity and consciousness. It is often used in philosophical, psychological, and literary contexts to discuss the nature of personal identity and the process of becoming a self-aware individual. The term is not commonly used in everyday conversation, but understanding its meaning can be helpful for comprehending more complex texts and discussions about the self."},"example_sentences":[{"sentence":"The novel explores the protagonist's journey to discover her own **selfhood**.","translation":"その小説は、主人公が自分自身の自己を確立するための旅を描いています。","type":"noun","meaning_category":"自己探求"},{"sentence":"The loss of his memories threatened his sense of **selfhood**.","translation":"彼の記憶喪失は、彼の自己意識を脅かしました。","type":"noun","meaning_category":"自己意識"},{"sentence":"She fought to maintain her **selfhood** in a society that demanded conformity.","translation":"彼女は、同調を求める社会の中で、自己の独自性を維持するために戦いました。","type":"noun","meaning_category":"独自性"},{"sentence":"The concept of **selfhood** is central to many philosophical discussions about identity.","translation":"自己という概念は、アイデンティティに関する多くの哲学的議論の中心です。","type":"noun","meaning_category":"自己"}]}