{"word":"recovery-dependent","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"回復に依存する、回復に左右される","english_definition":"Relying on or contingent upon recovery; the extent or success of something is determined by the process of recovery.","examples":[{"sentence":"The project's success is recovery-dependent; if the economy doesn't recover, it will likely fail.","translation":"プロジェクトの成功は回復に左右される。もし経済が回復しなければ、失敗する可能性が高い。"},{"sentence":"The patient's long-term prognosis is recovery-dependent, requiring intensive rehabilitation.","translation":"患者の長期的な予後は回復に依存しており、集中的なリハビリテーションが必要である。"},{"sentence":"The company's financial stability is recovery-dependent, hinging on increased sales and reduced debt.","translation":"会社の財政安定は回復に依存しており、売上増加と負債削減にかかっている。"}],"collocations":["recovery-dependent growth (回復に依存する成長)","recovery-dependent economy (回復に依存する経済)","recovery-dependent prognosis (回復に依存する予後)","recovery-dependent system (回復に依存するシステム)"],"synonyms":["contingent on recovery","dependent on recuperation","reliant on healing"],"antonyms":["independent of recovery","recovery-agnostic"]},{"part_of_speech":"adjective","definition":"(特に医療において)回復の程度によって治療方針や予後が決定される","english_definition":"(Especially in medicine) Where the treatment plan or prognosis is determined by the degree of recovery.","examples":[{"sentence":"This is a recovery-dependent treatment protocol; we will adjust the medication based on the patient's response.","translation":"これは回復依存型の治療プロトコルです。患者の反応に基づいて薬を調整します。"},{"sentence":"The rehabilitation program is recovery-dependent, progressing as the patient regains strength and mobility.","translation":"リハビリプログラムは回復依存型であり、患者が体力と可動性を回復するにつれて進行します。"}],"collocations":["recovery-dependent treatment (回復依存型治療)","recovery-dependent rehabilitation (回復依存型リハビリ)","recovery-dependent assessment (回復依存型評価)"],"synonyms":["response-driven","adaptive","iterative"],"antonyms":["fixed","static"]}],"etymology":{"value":"The term is formed by combining \"recovery\" (the process of regaining health, strength, or something lost) with \"dependent\" (relying on or determined by something else).","priority":"★☆☆"},"pronunciation":{"ipa":"/rɪˈkʌvəri dɪˈpɛndənt/","syllables":"re-cov-er-y di-pen-dent"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"\"Recovery-dependent\" describes situations where the outcome or further action is determined by the process or degree of recovery. It is often used in medical contexts to describe treatment plans that are adjusted based on a patient's progress. It can also be used in economic or project management contexts to indicate that success is contingent on a successful recovery from a downturn or setback.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The success is depend on recovery.","correct":"✓ The success is recovery-dependent. / ✓ The success depends on recovery.","note":"\"Recovery-dependent\" is an adjective, so it should be used to describe a noun.  The phrase \"depends on recovery\" is a verb phrase expressing the same idea."}],"priority":"★☆☆"},"related_words":{"derivatives":["dependency (名詞: 依存)","dependent (形容詞: 依存している)","recover (動詞: 回復する)","recovery (名詞: 回復)"],"phrases":["contingent on","subject to","reliant on"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized or technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Recovery-dependent\" is a term used to describe something that relies on or is determined by the process of recovery. It's often used in medical or economic contexts. For example, a patient's treatment plan might be \"recovery-dependent,\" meaning it will change based on how well the patient is recovering. Similarly, a business's success might be \"recovery-dependent\" if it relies on the economy recovering. It indicates that the outcome is not fixed but changes based on the progress of recovery."},"example_sentences":[{"sentence":"The government's economic policy is highly recovery-dependent, assuming a rapid return to pre-crisis levels of activity.","translation":"政府の経済政策は回復に大きく依存しており、危機前の水準への急速な回復を前提としている。","type":"adjective","meaning_category":"Economic Policy"},{"sentence":"The surgical procedure has a recovery-dependent outcome, with the patient's lifestyle choices significantly impacting the healing process.","translation":"外科手術の手順は回復に依存する結果をもたらし、患者のライフスタイルの選択が治癒過程に大きく影響する。","type":"adjective","meaning_category":"Medical Procedure"},{"sentence":"The effectiveness of the new software is recovery-dependent, requiring users to adapt their workflows to fully utilize its features.","translation":"新しいソフトウェアの有効性は回復依存型であり、ユーザーがその機能を最大限に活用するためにワークフローを適応させる必要がある。","type":"adjective","meaning_category":"Software Effectiveness"},{"sentence":"The success of the conservation project is recovery-dependent; the ecosystem must regenerate for the project to be deemed a success.","translation":"保護プロジェクトの成功は回復依存型であり、プロジェクトが成功と見なされるためには、生態系が再生されなければならない。","type":"adjective","meaning_category":"Conservation Project"}]}