{"word":"topswarm","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A swarm of bees that leaves a hive with the old queen, typically the first swarm of the season.","english_definition":"The first swarm to leave a hive in a season, usually accompanied by the old queen.","examples":[{"sentence":"The beekeeper was surprised to see a topswarm emerge so early in the spring.","translation":"養蜂家は、春の初めにトップスワームが現れたのを見て驚いた。"}],"collocations":["catch a topswarm","observe a topswarm","prevent topswarming"],"synonyms":["prime swarm","first swarm"],"antonyms":["cast swarm","secondary swarm"]}],"etymology":{"value":"Combination of 'top' (referring to the first or primary) and 'swarm' (a group of bees leaving the hive).","priority":"N/A"},"pronunciation":{"ipa":"/ˈtɒpswɔːrm/","syllables":"top-swarm"},"inflection":{"noun_plural":"topswarms"},"usage_notes":{"explanation":"'Topswarm' specifically refers to the initial swarm of bees that leaves a hive, usually with the original queen. This is distinct from later swarms (cast swarms or secondary swarms) that occur after a new queen has emerged in the hive.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The topswarm was smaller than the afterswarm.","correct":"✓ The topswarm was larger than the afterswarm.","note":"Topswarms are typically larger than subsequent swarms."}],"priority":"N/A"},"related_words":{"derivatives":["swarming","swarm"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Topswarm' is a specialized term used in beekeeping to describe the first swarm of bees to leave a hive in a season, usually with the old queen. Understanding this term requires some familiarity with beekeeping practices."},"example_sentences":[{"sentence":"The beekeeper carefully collected the topswarm to start a new colony.","translation":"養蜂家は新しいコロニーを始めるために、トップスワームを注意深く集めた。","type":"noun","meaning_category":"swarm of bees"}]}