{"word":"stock-size","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"標準サイズの、規格サイズの","english_definition":"of a standard or commonly available size.","examples":[{"sentence":"We only carry stock-size doors; custom sizes must be special ordered.","translation":"当店では標準サイズのドアのみを取り扱っており、カスタムサイズは特注となります。"},{"sentence":"The stock-size frame didn't quite fit the picture, so I had to trim it.","translation":"標準サイズのフレームは写真にぴったり合わなかったので、トリミングする必要がありました。"},{"sentence":"Are these stock-size screws or do I need to find something different?","translation":"これは標準サイズのネジですか、それとも別のものを見つける必要がありますか？"}],"collocations":["stock-size door","stock-size window","stock-size frame","stock-size paper","stock-size item"],"synonyms":["standard-size","regular-size","off-the-shelf","ready-made","prefabricated"],"antonyms":["custom-size","made-to-order","bespoke","tailor-made"],"notes":["Often used in the context of building materials, clothing, and paper products."]}],"etymology":{"value":"Combination of 'stock' (referring to a supply of goods kept on hand) and 'size' (referring to dimensions).","priority":"★★★"},"pronunciation":{"ipa":"/ˈstɒk saɪz/","syllables":"stock-size"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"'Stock-size' refers to items that are manufactured in commonly used or standard dimensions, making them readily available for purchase without needing to be custom-made. This term is frequently used in contexts where custom options are also available, highlighting the convenience and lower cost of the standard option.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a stock size of this.","correct":"✓ I need a stock-size of this. / ✓ I need a stock-size version of this.","note":"'Stock-size' is an adjective, so it needs to modify a noun. You can say 'a stock-size version' or rephrase to use 'stock' as a noun, e.g., 'I need this in stock size.'"},{"incorrect":"✗ This is very stock-size.","correct":"✓ This is a stock-size item. / ✓ This is standard-size.","note":"Avoid using 'stock-size' as a standalone description. It should modify a noun or be replaced with a synonym like 'standard-size'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["stock (noun)","size (noun)","standard (adjective)","custom (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but common in specific contexts like construction or retail.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Stock-size' is a compound adjective used to describe something that is made in a standard or common size. It is often used when contrasting with custom-made or non-standard sizes. Understanding this term is useful in contexts such as shopping for building materials, clothing, or office supplies, where you might need to choose between a stock-size item and a custom-made one.","priority":"★★☆"},"example_sentences":[{"sentence":"The stock-size cabinet fit perfectly in the space.","translation":"標準サイズのキャビネットはそのスペースにぴったり収まりました。","type":"example","meaning_category":"standard size"},{"sentence":"Stock-size paper is cheaper than buying custom sizes.","translation":"標準サイズの紙は、カスタムサイズを購入するよりも安いです。","type":"example","meaning_category":"standard size"},{"sentence":"Do you have this shirt in a stock-size large?","translation":"このシャツの標準サイズのLはありますか？","type":"example","meaning_category":"standard size"}]}