{"word":"Aulacodus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アフリカに生息するネズミの一種、オニネズミ属","english_definition":"A genus of African rodents, commonly known as grasscutters or cane rats.","examples":[{"sentence":"Aulacodus are large rodents found in Africa.","translation":"オニネズミ属はアフリカに生息する大型の齧歯類です。"},{"sentence":"The meat of Aulacodus is a popular source of protein in some African countries.","translation":"オニネズミ属の肉は、一部のアフリカ諸国で一般的なタンパク源です。"}],"collocations":["Aulacodus farming","Aulacodus meat","Aulacodus biology","Aulacodus reproduction"],"synonyms":["grasscutter","cane rat"],"antonyms":[]}],"etymology":{"value":"Aulacodus derives from the Greek words 'aulax' (furrow) and 'odous' (tooth), referring to the grooved structure of their teeth.","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːˈlækoʊdəs/","syllables":"Au-la-co-dus"},"inflection":{"noun_plural":"Aulacodus (usually refers to the genus, so pluralization is rare)"},"usage_notes":{"explanation":"Aulacodus is the scientific name for a genus of rodents, commonly referred to as grasscutters or cane rats. These animals are important in African ecosystems and are also farmed for their meat. The term is primarily used in scientific or agricultural contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an Aulacodus in my garden in Europe.","correct":"✓ I saw a rodent in my garden.","note":"Aulacodus are native to Africa, so seeing one in Europe would be highly unlikely."}],"priority":"★☆☆"},"related_words":{"derivatives":["Aulacorhynchus (a genus of toucans, unrelated but shares a similar prefix)"],"species":["Aulacodus swinderianus (Greater Cane Rat)","Aulacodus hughi (Lesser Cane Rat)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Very low frequency - primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Aulacodus' is a scientific term referring to a genus of African rodents known as grasscutters or cane rats. It is primarily used in scientific or agricultural contexts. Understanding this term requires a familiarity with biological nomenclature and African fauna. Due to its specialized nature, it is not commonly encountered in general English usage."},"example_sentences":[{"sentence":"The study focused on the reproductive biology of Aulacodus swinderianus.","translation":"その研究は、オニネズミ（Aulacodus swinderianus）の繁殖生物学に焦点を当てていた。","type":"scientific","meaning_category":"zoology"},{"sentence":"Aulacodus farming is becoming increasingly popular as a sustainable source of protein in West Africa.","translation":"オニネズミの養殖は、西アフリカで持続可能なタンパク源としてますます人気が高まっている。","type":"agricultural","meaning_category":"agriculture"}]}