{"word":"AIH","meanings":[{"part_of_speech":"noun","definition":"Abbreviation for Artificial Insemination by Husband.","english_definition":"A type of artificial insemination where the sperm used comes from the woman's partner.","examples":[{"sentence":"The couple decided to try AIH after struggling to conceive naturally.","translation":"その夫婦は自然妊娠が難しかったため、AIHを試すことに決めた。"}],"collocations":["undergo AIH","try AIH","AIH treatment","AIH success rate"],"synonyms":["Artificial Insemination by Husband"],"antonyms":[]}],"etymology":{"value":"Acronym formed from the initial letters of Artificial Insemination by Husband.","priority":"★★★"},"pronunciation":{"ipa":"ˌeɪ.aɪˈeɪtʃ","syllables":"A-I-H"},"inflection":{"noun_plural":"AIHs"},"usage_notes":{"explanation":"AIH is a medical procedure used to help couples conceive. It involves collecting sperm from the male partner and placing it directly into the woman's uterus or cervix. This increases the chances of fertilization. AIH is typically considered when there are issues with sperm motility or other factors that make natural conception difficult.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"AIH is the same as IVF.","correct":"AIH is a simpler procedure than IVF. IVF involves fertilizing the egg outside the body, while AIH involves placing sperm into the uterus.","note":"AIH is less invasive and less expensive than IVF."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["artificial insemination","IUI (Intrauterine Insemination)","IVF (In Vitro Fertilization)","fertility treatment","infertility"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency; primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"AIH is a specialized medical term related to fertility treatments. It is primarily used in medical and scientific contexts. Understanding this term requires some familiarity with reproductive biology and assisted reproductive technologies."},"example_sentences":[{"sentence":"After several unsuccessful attempts at IUI, the couple decided to explore AIH as an alternative.","translation":"IUIを数回試しても成功しなかったため、その夫婦は代替手段としてAIHを検討することにした。","type":"noun","meaning_category":"Medical procedure"},{"sentence":"The doctor explained the AIH procedure in detail, including the potential risks and benefits.","translation":"医師はAIHの手順について、潜在的なリスクと利点を含めて詳しく説明した。","type":"noun","meaning_category":"Medical procedure"}]}