{"word":"itineracy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"巡回、旅行、遍歴；巡回[遍歴]生活","english_definition":"the state of traveling from place to place, especially working or providing a service in different places.","examples":[{"sentence":"His itineracy as a traveling salesman took him to many different towns.","translation":"旅行販売員としての彼の巡回生活は、彼を多くの異なる町へと連れて行った。"},{"sentence":"The itineracy of the preacher allowed him to spread his message far and wide.","translation":"その牧師の遍歴生活は、彼がメッセージを広範囲に広めることを可能にした。"}],"collocations":["begin an itineracy","embrace itineracy","end an itineracy","life of itineracy"],"synonyms":["wandering","roaming","traveling","migration","peregrination"],"antonyms":["settled life","sedentariness","permanence"]},{"part_of_speech":"noun","definition":"（特に聖職者の）巡回[派遣]制度","english_definition":"a system of pastoral appointment in which ministers are assigned to different churches or regions on a rotating basis.","examples":[{"sentence":"The Methodist Church has a long tradition of itineracy, with ministers moving to new appointments every few years.","translation":"メソジスト教会には、数年ごとに牧師が新しい任命先に移動するという、巡回制度の長い伝統がある。"}],"collocations":["Methodist itineracy","circuit itineracy","pastoral itineracy"],"synonyms":["circuit riding","rotating assignment","pastoral rotation"],"antonyms":["fixed appointment","permanent post"]}],"etymology":{"value":"From 'itinerant' + '-cy'. 'Itinerant' comes from the Latin 'itinerari', meaning 'to travel'.","priority":"★★☆"},"pronunciation":{"ipa":"/aɪˈtɪnərəsi/","syllables":"i-tin-er-a-cy"},"inflection":{"noun_plural":"itineracies"},"usage_notes":{"explanation":"'Itineracy' refers to the state or condition of being itinerant, that is, traveling from place to place. It can describe a lifestyle, a job, or a system of assigning duties. It is often used in religious contexts to describe the practice of ministers or preachers moving between different congregations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The itineracy was very tired after a long day of traveling.","correct":"✓ The itinerant worker was very tired after a long day of traveling.","note":"'Itineracy' is a state or system, not a person. Use 'itinerant' to describe a person who travels."}],"priority":"★★☆"},"related_words":{"derivatives":["itinerant (adjective, noun)"],"related_terms":["itinerary (noun)","migrate (verb)","nomad (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Itineracy' is a relatively uncommon word that describes the state of traveling from place to place, particularly for work or religious service. It's often used in historical or sociological contexts when discussing nomadic lifestyles or the practices of certain religious groups. The word implies a lack of permanent residence and a constant state of movement.","priority":"★☆☆"},"example_sentences":[{"sentence":"The historian studied the itineracy of early circuit riders in the American West.","translation":"歴史家は、アメリカ西部における初期の巡回牧師の遍歴生活を研究した。","type":"general","meaning_category":"巡回生活"},{"sentence":"The company's success depended on the itineracy of its sales team.","translation":"会社の成功は、営業チームの巡回活動にかかっていた。","type":"business","meaning_category":"巡回活動"},{"sentence":"The preacher's itineracy took him to remote villages and bustling cities alike.","translation":"その牧師の遍歴生活は、彼を遠隔地の村々や賑やかな都市へと連れて行った。","type":"religious","meaning_category":"遍歴生活"}]}