{"word":"dry-shave","priority":"★★★","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(電気シェーバーなどで) 乾いた状態でひげを剃る","english_definition":"To shave (the face, legs, etc.) without using water or shaving cream, typically with an electric razor.","examples":[{"sentence":"He dry-shaved every morning before going to work.","translation":"彼は毎朝仕事に行く前にドライシェーブをした。"},{"sentence":"I prefer to dry-shave because it's quicker.","translation":"私はドライシェーブの方が早いので好きです。"}],"collocations":["dry-shave one's face","dry-shave one's legs"],"synonyms":["electric shave"],"antonyms":["wet-shave"]},{"part_of_speech":"noun","definition":"(電気シェーバーなどによる) 乾いた状態でのひげ剃り","english_definition":"The act of shaving without water or shaving cream, typically using an electric razor.","examples":[{"sentence":"He opted for a dry-shave to save time.","translation":"彼は時間を節約するためにドライシェーブを選んだ。"},{"sentence":"A dry-shave can sometimes irritate the skin.","translation":"ドライシェーブは時に肌を刺激することがある。"}],"collocations":["get a dry-shave","have a dry-shave"],"synonyms":["electric shave"],"antonyms":["wet shave"]}],"etymology":{"value":"A compound word formed from \"dry\" (meaning without water) and \"shave\" (the act of removing hair with a razor). The term arose with the advent of electric razors which allowed shaving without the need for water or shaving cream.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdraɪˌʃeɪv/","syllables":"dry-shave"},"inflection":{"verb_forms":{"present_simple":["dry-shave","dry-shaves"],"past_simple":"dry-shaved","past_participle":"dry-shaved","present_participle":"dry-shaving"},"noun_plural":"dry-shaves"},"usage_notes":{"explanation":"The term \"dry-shave\" specifically refers to shaving without the use of water, soap, shaving cream, or any other lubricant. It is most commonly associated with the use of electric razors, which are designed for this purpose. While convenient, dry-shaving can sometimes cause more skin irritation compared to wet-shaving.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I dry shave with a regular razor.","correct":"✓ I dry-shave with an electric razor.","note":"Dry-shaving is typically done with an electric razor, not a regular razor. A regular razor requires water and shaving cream for a wet shave."},{"incorrect":"✗ He dry-shaved his head.","correct":"✓ He shaved his head.","note":"Dry-shaving is typically used for facial hair or legs. Shaving the head is usually just referred to as shaving the head."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["wet-shave","shave","electric razor","razor","shaving cream","aftershave","pre-shave lotion"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but understood in context.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"dry-shave\" is relatively straightforward. It refers to the act of shaving without water or shaving cream, usually with an electric razor. It's a compound word that combines \"dry\" and \"shave,\" making its meaning fairly intuitive. While not a very common term, it is easily understood when encountered.","priority":"★★☆"},"example_sentences":[{"sentence":"For a quick grooming routine, he often chooses to dry-shave.","translation":"手早く身だしなみを整えるために、彼はしばしばドライシェーブを選ぶ。","type":"verb","meaning_category":"shaving"},{"sentence":"A dry-shave is convenient but can sometimes cause skin irritation.","translation":"ドライシェーブは便利だが、時に肌荒れの原因となることがある。","type":"noun","meaning_category":"shaving"},{"sentence":"She found that dry-shaving was much faster than wet-shaving.","translation":"彼女はドライシェーブの方がウェットシェーブよりもずっと早いことに気づいた。","type":"verb","meaning_category":"shaving"},{"sentence":"He prefers a dry-shave because it doesn't require any preparation.","translation":"彼は準備が不要なのでドライシェーブを好む。","type":"noun","meaning_category":"shaving"}]}