{"word":"Tyndallmeter","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"チンダルメーター：コロイド溶液の混濁度を測定する装置","english_definition":"An instrument for measuring the turbidity of a colloidal solution by means of the Tyndall effect.","examples":[{"sentence":"The tyndallmeter is used to determine the concentration of particles in the suspension.","translation":"チンダルメーターは、懸濁液中の粒子の濃度を決定するために使用されます。"},{"sentence":"Using a tyndallmeter, the scientist was able to precisely measure the degree of light scattering.","translation":"科学者はチンダルメーターを使用することで、光散乱の程度を正確に測定することができました。"}],"collocations":["use a tyndallmeter","measure with a tyndallmeter","tyndallmeter reading","calibrate a tyndallmeter"],"synonyms":["turbidimeter","nephelometer"],"antonyms":[]}],"etymology":{"value":"Named after the 19th-century scientist John Tyndall, who first described the Tyndall effect. The term combines 'Tyndall' with '-meter', indicating a measuring device.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtɪndəlˌmiːtər/","syllables":"Tyn-dal-me-ter"},"inflection":{"noun_plural":"tyndallmeters"},"usage_notes":{"explanation":"A tyndallmeter is a scientific instrument specifically designed to quantify the Tyndall effect, which is the scattering of light by particles in a colloid or suspension. The device measures the intensity of the scattered light, which is directly related to the concentration and size of the particles. It is used in various fields, including chemistry, environmental science, and food science, to analyze the turbidity and stability of colloidal systems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The scientist used a tyndallmeter to measure the pH of the solution.","correct":"✓ The scientist used a pH meter to measure the pH of the solution.","note":"A tyndallmeter measures turbidity, not pH. A pH meter is used to measure pH."},{"incorrect":"✗ Tyndallmeter is used for measuring the color of the solution.","correct":"✓ Spectrophotometer is used for measuring the color of the solution.","note":"A tyndallmeter measures turbidity, not color. A spectrophotometer is used to measure the color of the solution."}],"priority":"★★☆"},"related_words":{"derivatives":["Tyndall effect","turbidity","colloid","suspension"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"A Tyndallmeter is a specialized scientific instrument used to measure the turbidity (cloudiness) of liquids, especially colloidal solutions. It works by quantifying the Tyndall effect, which is the scattering of light by particles in the liquid. This instrument is primarily used in scientific and technical contexts, such as chemistry, environmental science, and materials science, to analyze the properties of suspensions and colloids. Because of its specific application, the term is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The laboratory technician used a tyndallmeter to assess the water quality.","translation":"検査技師はチンダルメーターを使用して水質を評価しました。","type":"general","meaning_category":"measurement"},{"sentence":"The tyndallmeter indicated a high level of particulate matter in the sample.","translation":"チンダルメーターは、サンプル中の高レベルの粒子状物質を示しました。","type":"general","meaning_category":"result"},{"sentence":"The accuracy of the tyndallmeter was verified using standard reference materials.","translation":"チンダルメーターの精度は、標準参照物質を使用して検証されました。","type":"technical","meaning_category":"calibration"}]}