{"word":"Flyball","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"フライボール（犬の競技の一種）","english_definition":"A dog sport in which teams of dogs race against each other over a line of hurdles to retrieve a ball from a spring-loaded box.","examples":[{"sentence":"My dog loves competing in flyball tournaments.","translation":"私の犬はフライボールの大会に出場するのが大好きです。"},{"sentence":"Flyball is a fast-paced and exciting sport for dogs and their owners.","translation":"フライボールは犬とその飼い主にとって、ペースが速くエキサイティングなスポーツです。"}],"collocations":["flyball team","flyball tournament","compete in flyball","train for flyball"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term \"flyball\" is a combination of \"fly\" (referring to the dog's speed and agility) and \"ball\" (referring to the object retrieved).","priority":"★★☆"},"pronunciation":{"ipa":"ˈflaɪbɔːl","syllables":"Fly-ball"},"inflection":{"noun_plural":"Flyballs"},"usage_notes":{"explanation":"Flyball is a team sport for dogs that involves racing over hurdles to retrieve a tennis ball from a box. It's a popular and energetic activity that promotes teamwork and canine athleticism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ My dog plays fly ball.","correct":"✓ My dog plays flyball.","note":"Flyball is one word, not two separate words."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"Flyball is a dog sport where teams of dogs race against each other. Each dog runs over hurdles, triggers a box to release a ball, catches the ball, and runs back. It's a fast and exciting sport that requires training and teamwork."},"example_sentences":[{"sentence":"Our team is practicing for the upcoming flyball competition.","translation":"私たちのチームは、間近に迫ったフライボールの競技会に向けて練習しています。","type":"noun","meaning_category":"犬の競技"},{"sentence":"Flyball is a great way to exercise your dog and build a strong bond.","translation":"フライボールは、あなたの犬を運動させ、強い絆を築くための素晴らしい方法です。","type":"noun","meaning_category":"犬の競技"},{"sentence":"The flyball box releases the ball when the dog steps on the trigger.","translation":"フライボールのボックスは、犬がトリガーを踏むとボールを放出します。","type":"noun","meaning_category":"犬の競技"}]}