{"word":"omnisexual","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"全性愛の、全性愛者の","english_definition":"Sexually, romantically, or emotionally attracted to all genders and sexes.","examples":[{"sentence":"She identifies as omnisexual.","translation":"彼女は自身のことを全性愛者だと認識している。"},{"sentence":"Omnisexual people are attracted to all genders.","translation":"全性愛者は全ての性別に惹かれます。"},{"sentence":"Omnisexuality is often confused with pansexuality.","translation":"全性愛はしばしば汎性愛と混同されます。"}],"collocations":["identify as omnisexual (全性愛者であると認識する)","omnisexual attraction (全性愛的な魅力)","omnisexual identity (全性愛のアイデンティティ)"],"synonyms":["pansexual","bisexual","polysexual"],"antonyms":["heterosexual","homosexual","asexual"]},{"part_of_speech":"noun","definition":"全性愛者","english_definition":"A person who is sexually, romantically, or emotionally attracted to all genders and sexes.","examples":[{"sentence":"As an omnisexual, he is attracted to people regardless of their gender.","translation":"全性愛者として、彼は相手の性別に関わらず人に惹かれます。"},{"sentence":"Omnisexuals may have preferences, but are open to relationships with any gender.","translation":"全性愛者は好みを持ちうるが、どんな性別との関係も受け入れます。"}],"collocations":["a proud omnisexual (誇り高い全性愛者)","an openly omnisexual person (公然と全性愛者である人)"],"synonyms":["pansexual","bisexual"],"antonyms":["heterosexual","homosexual","asexual"]}],"etymology":{"value":"\"Omni-\" (all) + \"sexual\" (relating to sexuality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒmniˈsekʃuəl/","syllables":"om-ni-sex-u-al"},"inflection":{"notes":"The word can function as both an adjective and a noun. As an adjective, it does not inflect. The plural form of the noun is 'omnisexuals'."},"usage_notes":{"explanation":"Omnisexuality is a sexual orientation characterized by attraction to all genders and sexes. It is often confused with pansexuality, but there are subtle differences. Some people define omnisexuality as attraction to all genders with a preference, while pansexuality is attraction regardless of gender. However, these definitions can vary. It's important to respect how individuals choose to identify.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Omnisexual means being attracted to only one gender.","correct":"✓ Omnisexual means being attracted to all genders.","note":"Omnisexual means attraction to all genders, not just one."},{"incorrect":"✗ Omnisexual and bisexual are the same thing.","correct":"✓ Omnisexual and bisexual are different sexual orientations.","note":"While both involve attraction to more than one gender, they are distinct. Bisexual typically refers to attraction to both men and women, while omnisexual refers to attraction to all genders."}],"priority":"★★☆"},"related_words":{"derivatives":["omnisexuality (noun)"],"phrasal_verbs":[],"related_terms":["pansexual","bisexual","polysexual","heterosexual","homosexual","asexual","gender","sexuality","sexual orientation"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Omnisexual' refers to being attracted to all genders and sexes. It's similar to 'pansexual,' but some people use 'omnisexual' to mean they have preferences among genders, while 'pansexual' means attraction regardless of gender. It's a term used in discussions about sexual orientation and identity, so understanding it helps in being inclusive and respectful.","note":"The term is relatively new and may not be widely understood."},"example_sentences":[{"sentence":"Many people in the LGBTQ+ community identify as omnisexual.","translation":"LGBTQ+コミュニティの多くの人々が、自身を全性愛者であると認識しています。","type":"general","meaning_category":"general"},{"sentence":"Understanding the nuances between omnisexual and pansexual can promote inclusivity.","translation":"全性愛と汎性愛のニュアンスの違いを理解することで、包括性を促進できます。","type":"general","meaning_category":"general"},{"sentence":"The conference included a workshop on omnisexual identities and experiences.","translation":"その会議には、全性愛のアイデンティティと経験に関するワークショップが含まれていました。","type":"general","meaning_category":"general"}]}