{"word":"vanidad","priority":"★★☆","meanings":[{"part_of_speech":"noun","gender":"feminine","definition":"虚栄心、うぬぼれ、自惚れ","english_definition":"excessive pride in or admiration of one's own appearance or achievements.","examples":[{"sentence":"La vanidad es un defecto común.","translation":"虚栄心はよくある欠点だ。"},{"sentence":"Su vanidad le impide ver sus errores.","translation":"彼のうぬぼれは、彼が自分の誤りを見ることを妨げている。"},{"sentence":"Gastó mucho dinero en cosas de vanidad.","translation":"彼女は虚栄のためにたくさんのお金を使った。"}],"collocations":["alimentar la vanidad (虚栄心をくすぐる)","herir la vanidad (虚栄心を傷つける)","pecado de vanidad (虚栄の罪)","artículos de vanidad (化粧品、装飾品)"],"synonyms":["orgullo","arrogancia","presunción","jactancia","engreimiento","petulancia"],"antonyms":["humildad","modestia"]},{"part_of_speech":"noun","gender":"feminine","definition":"虚しさ、無意味さ、空虚さ","english_definition":"the state of being worthless or futile.","examples":[{"sentence":"La vanidad de la vida es un tema recurrente en la literatura.","translation":"人生の虚しさは、文学における繰り返しのテーマである。"},{"sentence":"Comprendió la vanidad de sus esfuerzos.","translation":"彼は自分の努力の無意味さを理解した。"}],"collocations":["vanidad de la vida (人生の虚しさ)","la vanidad del mundo (世界の空虚さ)"],"synonyms":["futilidad","inutilidad","vaciedad","insignificancia"],"antonyms":["importancia","significado","valor"]}],"etymology":{"value":"Del latín *vanĭtas*, -ātis, derivado de *vanus* (vacío, vano).","priority":"★★★"},"pronunciation":{"ipa":"/baniˈdad/","syllables":"va-ni-dad"},"inflection":{"notes":"単数形のみ。複数形はあまり使われません。"},"usage_notes":{"explanation":"La palabra \"**vanidad**\" tiene dos significados principales en español:\n\n1.  **Exceso de orgullo o admiración por uno mismo:** Este es el significado más común y se refiere a la persona que se preocupa demasiado por su apariencia, sus logros o su imagen pública. Implica una valoración exagerada de las propias cualidades y una necesidad de reconocimiento por parte de los demás.\n\n2.  **Vaciedad o falta de valor:** En un sentido más filosófico o religioso, \"vanidad\" se refiere a la naturaleza efímera y sin sentido de las cosas materiales o terrenales. Se utiliza para expresar la idea de que la vida es pasajera y que las posesiones o logros no tienen un valor duradero.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Él tiene mucha vanidad. (refiriéndose a humildad)","correct":"Él tiene poca vanidad. / Él es muy humilde.","note":"\"Vanidad\" significa lo opuesto a humildad. Si se quiere expresar que alguien es humilde, se debe usar la palabra \"humildad\" o decir que tiene \"poca vanidad\"."},{"incorrect":"La vanidad de la casa es muy bonita. (refiriéndose al mueble del baño)","correct":"El tocador del baño es muy bonito. / El mueble del baño es muy bonito.","note":"En algunos países de Latinoamérica, \"vanidad\" puede referirse al mueble del baño con espejo. Sin embargo, este uso es regional y no es el significado principal de la palabra. Es mejor usar \"tocador\" o \"mueble del baño\" para evitar confusiones."}],"priority":"★★☆"},"related_words":{"derivatives":["vanidoso/a (adjective: vain, conceited)","vanilocuencia (noun: boastfulness, bragging)"],"idioms_phrases":["ser todo vanidad (to be all vanity)","vivir de la vanidad (to live on vanity)"],"priority":"★★☆"},"level_frequency":{"level":"B2","frequency_corpus":"Aparece con frecuencia moderada en textos literarios y ensayos.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"La palabra \"**vanidad**\" se usa para describir a alguien que se preocupa demasiado por su apariencia o logros, mostrando un orgullo excesivo. También puede referirse a la falta de valor o sentido de las cosas materiales. Es importante entender el contexto para saber a cuál de estos significados se refiere. Por ejemplo, \"Su vanidad le impide escuchar a los demás\" se refiere al orgullo excesivo, mientras que \"La vanidad de la riqueza es que no dura para siempre\" se refiere a la falta de valor duradero de la riqueza."},"example_sentences":[{"sentence":"Su **vanidad** era evidente en cada uno de sus gestos.","translation":"His vanity was evident in each of his gestures.","type":"noun","meaning_category":"excessive pride"},{"sentence":"La **vanidad** de la vida terrenal es un tema recurrente en la filosofía.","translation":"The vanity of earthly life is a recurring theme in philosophy.","type":"noun","meaning_category":"futility"},{"sentence":"No permitas que la **vanidad** te ciegue ante la verdad.","translation":"Don't let vanity blind you to the truth.","type":"noun","meaning_category":"excessive pride"},{"sentence":"La **vanidad** de sus esfuerzos se hizo evidente cuando no logró alcanzar sus metas.","translation":"The futility of his efforts became evident when he failed to achieve his goals.","type":"noun","meaning_category":"futility"}]}