{"word":"pitchblende","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"閃ウラン鉱","english_definition":"A massive, black, non-crystalline form of uraninite, a uranium-rich mineral; a major ore of uranium.","examples":[{"sentence":"Pitchblende is a primary source of uranium.","translation":"閃ウラン鉱はウランの主要な源です。"},{"sentence":"Marie Curie extracted radium from pitchblende.","translation":"マリー・キュリーは閃ウラン鉱からラジウムを抽出しました。"}],"collocations":["uranium ore","radioactive mineral","extract radium from pitchblende"],"synonyms":["uraninite"],"antonyms":[]}],"etymology":{"value":"From German *Pechblende*, from *Pech* (“pitch”) + *Blende* (“blende, zinc ore”). So named because its black color resembles pitch, and because it was thought to be a type of blende (sphalerite, zinc sulfide), which was known to be deceptive in that it did not contain the metal it appeared to.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪtʃˌblɛnd/","syllables":"pitch-blende"},"inflection":{"noun_plural":"pitchblendes"},"usage_notes":{"explanation":"Pitchblende is primarily a historical and geological term. It is less commonly used now, with 'uraninite' being the preferred scientific term. It is mainly encountered in contexts related to the history of radioactivity or in geological descriptions of uranium deposits.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Pitchblende is a type of metal.","correct":"✓ Pitchblende is a type of mineral.","note":"Pitchblende is a mineral, specifically a uranium-rich form of uraninite, not a metal itself."},{"incorrect":"✗ Pitchblende is safe to handle.","correct":"✓ Pitchblende is radioactive and should be handled with care.","note":"Pitchblende is a radioactive material and poses health risks if handled improperly."}],"priority":"★★☆"},"related_words":{"derivatives":["uraninite","uranium","radioactive"],"phrasal_verbs":[]},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily found in geological or historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pitchblende' is a specialized term used in geology and nuclear physics. It refers to a specific type of uranium ore. Understanding its meaning requires knowledge of mineralogy and radioactivity. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The old mine was known for its rich deposits of pitchblende.","translation":"その古い鉱山は、閃ウラン鉱の豊富な鉱床で知られていました。","type":"noun","meaning_category":"mineralogy"},{"sentence":"Early researchers used pitchblende to isolate radioactive elements.","translation":"初期の研究者たちは、放射性元素を分離するために閃ウラン鉱を使用しました。","type":"noun","meaning_category":"history of science"}]}