{"word":"weatherfishes","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"(Zoology) plural of weatherfish. A small, elongated freshwater fish of the genus Misgurnus, known for its ability to sense changes in barometric pressure.","english_definition":"Plural form of weatherfish: A slender freshwater fish of the genus Misgurnus, known for its sensitivity to changes in atmospheric pressure.","examples":[{"sentence":"The pet store had a tank full of weatherfishes.","translation":"ペットショップにはたくさんのドジョウが水槽に入っていた。"},{"sentence":"Some people keep weatherfishes as pets because they are said to predict the weather.","translation":"ドジョウは天気を予測すると言われているため、ペットとして飼う人もいる。"}],"collocations":["keep weatherfishes as pets","a tank of weatherfishes"],"synonyms":["loaches","Misgurnus fish"],"antonyms":[]}],"etymology":{"value":"From 'weather' referring to the fish's supposed ability to predict weather changes, and 'fish'.","priority":"Medium"},"pronunciation":{"ipa":"/ˈwɛðərˌfɪʃɪz/","syllables":"weath-er-fish-es"},"inflection":{"noun_plural":"weatherfishes"},"usage_notes":{"explanation":"'Weatherfish' is a common name for fish in the genus *Misgurnus*, particularly *Misgurnus anguillicaudatus* (the Dojo loach). They are called weatherfish because they become more active when the atmospheric pressure drops, supposedly indicating an approaching storm.","priority":"Medium"},"common_mistakes":{"examples":[],"priority":"Low"},"related_words":{"derivatives":["weatherfish"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"None","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'weatherfishes' is simply the plural form of 'weatherfish,' referring to a type of fish known for its sensitivity to changes in atmospheric pressure. It's not a commonly used word, so understanding its meaning relies on knowing what a 'weatherfish' is."},"example_sentences":[{"sentence":"The children were fascinated by the wriggling weatherfishes in the aquarium.","translation":"子供たちは水槽の中でうごめくドジョウに魅了された。","type":"noun","meaning_category":"plural of weatherfish"},{"sentence":"We bought a dozen weatherfishes to keep in our pond.","translation":"私たちは池に飼うために1ダースのドジョウを買った。","type":"noun","meaning_category":"plural of weatherfish"}]}