{"word":"paternalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"家父長主義、温情主義、パターナリズム","english_definition":"the policy or practice on the part of people in positions of authority of restricting the freedom and responsibilities of those subordinate to them in the subordinates' supposed best interest.","examples":[{"sentence":"Some critics argue that the government's policies are based on paternalism.","translation":"政府の政策は家父長主義に基づいていると批判する人もいる。"},{"sentence":"The company's paternalism extended to providing housing and healthcare for its employees.","translation":"その会社の温情主義は、従業員に住宅や医療を提供することにまで及んだ。"},{"sentence":"Paternalism can be seen as both benevolent and oppressive.","translation":"パターナリズムは、慈愛的であると同時に抑圧的であるとも見なされうる。"}],"collocations":["benevolent paternalism (慈愛的パターナリズム)","corporate paternalism (企業パターナリズム)","medical paternalism (医療パターナリズム)","state paternalism (国家パターナリズム)"],"synonyms":["authoritarianism","patronage","condescension","paternalistic attitude"],"antonyms":["autonomy","independence","self-determination","freedom"]},{"part_of_speech":"noun","definition":"(比喩的に)父親のような態度、保護者的態度","english_definition":"the attitude or actions of a person who treats others in a way that resembles that of a father governing his children.","examples":[{"sentence":"His paternalism towards his employees was appreciated by some, but resented by others.","translation":"彼の従業員に対する父親のような態度は、感謝する人もいれば、反感を持つ人もいた。"},{"sentence":"She disliked the manager's paternalism, feeling that she was capable of making her own decisions.","translation":"彼女は、マネージャーの保護者的態度を嫌い、自分で決断できると感じていた。"}],"collocations":["exhibit paternalism (パターナリズムを示す)","perceive paternalism (パターナリズムを感じる)"],"synonyms":["patronizing","condescending","fatherly (sometimes with negative connotations)"],"antonyms":["egalitarianism","respectful","non-interference"]}],"etymology":{"value":"「paternal」(父親の) + 「-ism」(主義、行動) に由来。ラテン語の「paternus」(父親の) から派生。元々は父親が家族を統治するような、上位者が下位者を保護・指導するという意味合いが強い。","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈtɜːrnəlɪzəm/","syllables":"pa-ter-na-lism"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"「**paternalism**」は、権力を持つ者が、相手のためを思って行動すると主張しながら、相手の自由や責任を制限する行為や態度を指します。しばしば、政府、企業、医療などの分野で見られます。肯定的な側面としては、弱者を保護したり、社会全体の利益を促進したりすることが挙げられますが、否定的な側面としては、個人の自律性や意思決定能力を軽視し、支配や抑圧につながる可能性があります。文脈によっては、「温情主義」や「家父長主義」と訳されることもあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The paternalism of the company made the employees very happy.","correct":"✓ Some employees appreciated the company's paternalism, while others resented it.","note":"パターナリズムは、必ずしも良い意味合いを持つとは限りません。従業員が常に喜ぶとは限らず、自由や自律性の侵害と捉えられることもあります。"},{"incorrect":"✗ Paternalism is always a good thing.","correct":"✓ Paternalism can be beneficial in some situations, but it can also be harmful.","note":"パターナリズムは状況によって評価が異なります。一方的な善意の押し付けになる可能性もあるため、常に良いとは限りません。"}],"priority":"★★☆"},"related_words":{"derivatives":["paternalistic (形容詞: 家父長主義的な、温情主義的な)","paternally (副詞: 父方から、父親らしく)"],"idioms_phrases":["paternalistic intervention (パターナリズム的介入)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"中頻度 (Moderate frequency) - 一般的な会話よりも、政治、社会、倫理に関する議論でよく使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**paternalism**」は、権力のある人が、相手のためを思って、その人の自由や責任を制限することを言います。例えば、会社が従業員の健康のために、特定の行動を強制したり、政府が国民の安全のために、個人の自由を制限するような場合です。一見すると良いことのように思えるかもしれませんが、相手の自主性や判断力を尊重していないと批判されることもあります。そのため、「paternalism」は、良い意味でも悪い意味でも使われることがあります。"},"example_sentences":[{"sentence":"The government's ban on smoking in public places is an example of paternalism.","translation":"公共の場での喫煙禁止は、政府のパターナリズムの一例である。","type":"noun","meaning_category":"家父長主義的な政策"},{"sentence":"Some argue that mandatory seatbelt laws are a form of paternalism.","translation":"シートベルト着用義務は、パターナリズムの一形態であると主張する人もいる。","type":"noun","meaning_category":"個人の自由の制限"},{"sentence":"The doctor's paternalism led him to make decisions for the patient without fully consulting her.","translation":"医師のパターナリズムにより、彼は患者に十分な相談をせずに、患者のために決定を下してしまった。","type":"noun","meaning_category":"医療における温情主義"},{"sentence":"While some appreciated the company's paternalism, others felt it stifled their creativity.","translation":"会社の温情主義を評価する人もいたが、創造性を抑圧すると感じる人もいた。","type":"noun","meaning_category":"企業における温情主義"}]}