{"word":"magnetogram","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"磁力線図、磁場強度図","english_definition":"A visual representation of the magnetic field of a celestial body, typically the Sun, showing the strength and polarity of the magnetic field.","examples":[{"sentence":"The magnetogram showed a complex pattern of magnetic activity on the Sun's surface.","translation":"磁力線図は、太陽表面の複雑な磁気活動のパターンを示していた。"},{"sentence":"Scientists use magnetograms to study solar flares and coronal mass ejections.","translation":"科学者たちは、磁力線図を使って太陽フレアやコロナ質量放出を研究している。"}],"collocations":["solar magnetogram (太陽磁力線図)","full-disk magnetogram (全面円盤磁力線図)","longitudinal magnetogram (経度磁力線図)","vector magnetogram (ベクトル磁力線図)"],"synonyms":["magnetic map","magnetic field map"],"antonyms":[]}],"etymology":{"value":"\"magneto-\" (磁気) + \"-gram\" (図、記録) から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/mæɡˈniːtəˌɡræm/","syllables":"mag-ne-to-gram"},"inflection":{"noun_plural":"magnetograms"},"usage_notes":{"explanation":"A magnetogram is a specialized image that depicts the magnetic field strength and polarity of a celestial object, most commonly the Sun. These images are crucial for understanding solar activity and its effects on Earth. The different colors or shades in a magnetogram represent the direction and intensity of the magnetic field lines.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The magnetogram shows the temperature of the sun.","correct":"✓ The magnetogram shows the magnetic field of the sun.","note":"Magnetograms display magnetic field information, not temperature."}],"priority":"★★☆"},"related_words":{"derivatives":["magnetograph (磁力計)","magnetometry (磁気測定法)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A magnetogram is a highly specialized term used in astrophysics and solar physics. It refers to a visual representation of the magnetic field on the surface of a star, typically the Sun. Understanding magnetograms requires knowledge of magnetic fields, solar activity, and image processing techniques. This term is rarely encountered outside of scientific contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The high-resolution magnetogram revealed intricate details of the sunspot's magnetic structure.","translation":"高解像度の磁力線図は、黒点の複雑な磁気構造の詳細を明らかにした。","type":"noun","meaning_category":"磁力線図"},{"sentence":"By analyzing magnetograms, scientists can predict the likelihood of solar flares.","translation":"磁力線図を分析することで、科学者たちは太陽フレアの可能性を予測できる。","type":"noun","meaning_category":"磁力線図"}]}