{"word":"lodgerdom","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"下宿人の世界、下宿人の状態、下宿人全体","english_definition":"The world of lodgers; the state of being a lodger; lodgers collectively.","examples":[{"sentence":"He wrote extensively about the hardships and peculiarities of lodgerdom in Victorian London.","translation":"彼はビクトリア朝時代のロンドンの下宿人の苦難と特異性について広範囲に書いた。"},{"sentence":"Lodgerdom is a transient and often lonely existence.","translation":"下宿人の世界は、一時的で、しばしば孤独な生活である。"},{"sentence":"The landlord's actions affected the entire lodgerdom of the building.","translation":"家主の行動は、建物全体の下宿人たちに影響を与えた。"}],"collocations":["life in lodgerdom","the realities of lodgerdom","the world of lodgerdom"],"synonyms":["tenancy","boarding","rooming"],"antonyms":["landownership","homeownership"]}],"etymology":{"value":"Formed from 'lodger' (one who rents a room in someone else's house) + '-dom' (suffix denoting a state, condition, or domain).","priority":"★★★"},"pronunciation":{"ipa":"ˈlɒdʒərdəm","syllables":"lod-ger-dom"},"inflection":{"noun_plural":"lodgerdoms (rarely used)"},"usage_notes":{"explanation":"'Lodgerdom' is a relatively uncommon word, often used in historical or literary contexts to describe the collective experience or social sphere of people living as lodgers. It can refer to the physical spaces they inhabit, their social interactions, or the economic and social conditions that define their lives.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He enjoyed the lodgerdom with his family.","correct":"✓ He experienced lodgerdom when he lived alone in the city.","note":"'Lodgerdom' typically refers to the state of living as a lodger, often alone or in a transient situation, rather than a family setting."},{"incorrect":"✗ The lodgerdom was very expensive in that area.","correct":"✓ Lodging was very expensive in that area.","note":"Use 'lodging' or 'rent' to describe the cost of accommodation, rather than 'lodgerdom'."}],"priority":"★☆☆"},"related_words":{"derivatives":["lodger","lodging","landlord","tenant"],"related_terms":["boarding house","rooming house"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - primarily found in older texts or specific historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lodgerdom' is a niche word used to describe the collective experience or social sphere of people living as lodgers. It's not commonly used in everyday conversation and is more likely to be found in historical or literary contexts. Understanding its meaning requires familiarity with the term 'lodger' and the suffix '-dom,' which denotes a state or domain. Due to its infrequent use and specific context, it is considered a more advanced vocabulary word."},"example_sentences":[{"sentence":"The novel depicted the harsh realities of lodgerdom in 19th-century London.","translation":"その小説は19世紀のロンドンの下宿人の厳しい現実を描写していた。","type":"noun","meaning_category":"下宿人の世界"},{"sentence":"He found himself thrust into the unfamiliar world of lodgerdom after losing his job.","translation":"彼は失業後、不慣れな下宿人の世界に放り込まれた。","type":"noun","meaning_category":"下宿人の状態"},{"sentence":"The new regulations aimed to improve the living conditions for lodgerdom across the city.","translation":"新しい規制は、市内の下宿人全体の生活環境を改善することを目的としていた。","type":"noun","meaning_category":"下宿人全体"}]}