{"word":"siphonoglyph","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(腔腸動物の) 溝状繊毛帯: イソギンチャクなどの動物の咽頭にある繊毛に覆われた溝で、水流を作り、呼吸と体腔への水の取り込みを助ける。","english_definition":"A ciliated groove in the pharynx of sea anemones and some other anthozoans that helps circulate water for respiration and inflation of the gastrovascular cavity.","examples":[{"sentence":"The siphonoglyph helps the sea anemone maintain its shape.","translation":"溝状繊毛帯はイソギンチャクがその形を維持するのを助ける。"},{"sentence":"Water is drawn into the anemone's body cavity through the siphonoglyph.","translation":"水は溝状繊毛帯を通ってイソギンチャクの体腔に引き込まれる。"}],"collocations":["ciliated siphonoglyph","prominent siphonoglyph","single siphonoglyph","double siphonoglyph"],"synonyms":["none"],"antonyms":["none"]}],"etymology":{"value":"ギリシャ語の「siphon」(管) + 「glyphe」(彫刻)に由来する。これは、溝状繊毛帯が管状で、表面に特徴的な模様があるように見えることに由来する。","priority":"★★★"},"pronunciation":{"ipa":"/saɪˈfɒnəˌɡlɪf/","syllables":"si-pho-no-glyph"},"inflection":{"noun_plural":"siphonoglyphs"},"usage_notes":{"explanation":"Siphonoglyphs are a key anatomical feature in many sea anemones and some other anthozoans. The presence and number of siphonoglyphs (one or two) are important characteristics used in the classification of these animals.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The siphonoglyph is used for feeding.","correct":"✓ The siphonoglyph is used for water circulation and respiration.","note":"While indirectly related, the siphonoglyph's primary function is not feeding, but rather water circulation which aids in respiration and maintaining body shape."}],"priority":"★★☆"},"related_words":{"derivatives":["siphon (noun: サイフォン)","glyph (noun: 象形文字)"],"related_terms":["anthozoa (noun: 花虫綱)","sea anemone (noun: イソギンチャク)","pharynx (noun: 咽頭)","cilia (noun: 繊毛)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"siphonoglyph\" is a specialized term used in marine biology, specifically when discussing the anatomy of sea anemones and related anthozoans. It refers to a ciliated groove in the pharynx of these animals that helps circulate water. Due to its specific use in a scientific context, it is not a commonly encountered word.","priority":"★★☆"},"example_sentences":[{"sentence":"The presence of a siphonoglyph is a key characteristic in identifying certain species of sea anemones.","translation":"溝状繊毛帯の存在は、特定のイソギンチャクの種を識別する上で重要な特徴である。","type":"scientific","meaning_category":"anatomy"},{"sentence":"The siphonoglyph ensures a constant flow of oxygenated water through the anemone's gastrovascular cavity.","translation":"溝状繊毛帯は、イソギンチャクの胃血管腔への酸素化された水の絶え間ない流れを保証する。","type":"scientific","meaning_category":"function"}]}