{"word":"anakinetic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"運動抑制の、運動不能の","english_definition":"Characterized by or relating to a lack of movement or an inhibition of movement.","examples":[{"sentence":"The patient exhibited anakinetic symptoms after the stroke.","translation":"患者は脳卒中後、運動抑制の症状を示した。"},{"sentence":"Anakinetic mutism is a rare neurological disorder.","translation":"無動性無言はまれな神経疾患である。"}],"collocations":["anakinetic mutism","anakinetic symptoms"],"synonyms":["akinetic","hypokinetic","immobile"],"antonyms":["hyperkinetic","hypermobile"],"notes":"Often used in a medical context to describe neurological conditions."}],"etymology":{"value":"Derived from the Greek words 'an-' (without), 'kineo' (to move), and '-tic' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænəkɪˈnɛtɪk/","syllables":"an-a-ki-net-ic"},"inflection":{"notes":"The word 'anakinetic' is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Anakinetic' is primarily used in medical and neurological contexts to describe conditions or symptoms related to a lack of movement or an inhibition of movement. It is often used to describe a state where a person has difficulty initiating or performing movements.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The child was anakinetic and full of energy.","correct":"✓ The child was hyperkinetic and full of energy.","note":"'Anakinetic' means a lack of movement, so it's contradictory to say someone is both anakinetic and full of energy. 'Hyperkinetic' would be more appropriate to describe excessive movement."}],"priority":"★★☆"},"related_words":{"derivatives":["akinesia (noun: loss or impairment of the power of voluntary movement)","hypokinesia (noun: decreased bodily movement)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anakinetic' is a technical term primarily used in medical and neurological contexts. It describes a condition characterized by a lack of movement or an inhibition of movement. Understanding this term requires a background in medical terminology or a strong vocabulary. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The patient's anakinetic state made it difficult for them to perform simple tasks.","translation":"患者の運動抑制状態により、簡単な作業を行うことが困難になった。","type":"adjective","meaning_category":"lack of movement"},{"sentence":"Anakinetic mutism is a rare condition where patients are unable to speak or move despite being awake.","translation":"無動性無言は、患者が覚醒しているにもかかわらず、話したり動いたりすることができないまれな状態である。","type":"adjective","meaning_category":"inhibition of movement"}]}