{"word":"selectionism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"選択説：進化における自然選択の重要性を強調する理論。","english_definition":"The theory that natural selection is the primary mechanism of evolutionary change.","examples":[{"sentence":"Selectionism posits that organisms evolve through the differential survival and reproduction of individuals with advantageous traits.","translation":"選択説は、有利な特性を持つ個体の生存と繁殖の差を通して生物が進化すると仮定する。"},{"sentence":"Critics of selectionism argue that other factors, such as genetic drift and developmental constraints, also play significant roles in evolution.","translation":"選択説の批判者たちは、遺伝的浮動や発生的制約などの他の要因も進化において重要な役割を果たすと主張する。"}],"collocations":["natural selection","evolutionary theory","genetic drift","developmental constraints"],"synonyms":["adaptationism","Darwinism"],"antonyms":["neutralism","mutationism"]}],"etymology":{"value":"\"selection\"（選択）+ \"-ism\"（主義、学説）から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/sɪˈlɛkʃənɪzəm/","syllables":"se-lec-tion-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Selectionism\" は、進化生物学において、自然選択が進化の主要な原動力であると主張する理論を指します。この用語は、自然選択の重要性を強調する一方で、遺伝的浮動や発生的制約など、他の進化メカニズムの役割を軽視していると批判されることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Selectionism is the process of random genetic changes.","correct":"✓ Selectionism emphasizes the role of natural selection, not random changes.","note":"選択説はランダムな遺伝的変化ではなく、自然選択の役割を強調する。"},{"incorrect":"✗ Selectionism only applies to animal evolution.","correct":"✓ Selectionism applies to all organisms, including plants and microorganisms.","note":"選択説は動物だけでなく、植物や微生物を含むすべての生物に適用される。"}],"priority":"★★☆"},"related_words":{"derivatives":["selectionist (選択説者)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Selectionism\" is a term used in evolutionary biology to describe the belief that natural selection is the most important factor in evolution. It's often used in academic discussions about how different factors contribute to the changes seen in living things over time. This word is more common in scientific writing and discussions rather than everyday conversation."},"example_sentences":[{"sentence":"The debate between selectionism and neutralism continues to shape our understanding of evolutionary processes.","translation":"選択説と中立説の間の議論は、進化の過程に対する私たちの理解を形成し続けている。","type":"general","meaning_category":"evolutionary theory"},{"sentence":"Selectionism suggests that complex adaptations arise through a gradual process of natural selection acting on heritable variation.","translation":"選択説は、複雑な適応が遺伝可能な変異に作用する自然選択の漸進的な過程を通して生じると示唆する。","type":"general","meaning_category":"evolutionary theory"}]}