{"word":"burn-prone","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"燃えやすい、焼けやすい、日焼けしやすい","english_definition":"Easily or likely to catch fire; easily damaged by fire; easily sunburned.","examples":[{"sentence":"This fabric is burn-prone, so keep it away from open flames.","translation":"この生地は燃えやすいので、直火から遠ざけてください。"},{"sentence":"She has burn-prone skin and needs to wear sunscreen at all times.","translation":"彼女は日焼けしやすい肌なので、常に日焼け止めを塗る必要があります。"},{"sentence":"The dry grass made the area burn-prone during the summer months.","translation":"乾燥した草のため、その地域は夏の間、火災が発生しやすかった。"}],"collocations":["burn-prone fabric (燃えやすい生地)","burn-prone skin (日焼けしやすい肌)","burn-prone area (火災が発生しやすい地域)"],"synonyms":["flammable","combustible","easily sunburned","susceptible to burning"],"antonyms":["fire-resistant","fireproof","sun-resistant"]}],"etymology":{"value":"The word is formed by combining \"burn\" (to be damaged or destroyed by fire or heat) and \"prone\" (likely to suffer from, do, or experience something, typically something regrettable or unwelcome).","priority":"N/A"},"pronunciation":{"ipa":"/ˈbɜːrn proʊn/","syllables":"burn-prone"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be modified by adverbs (e.g., very burn-prone)."},"usage_notes":{"explanation":"The term \"burn-prone\" is used to describe something that has a high likelihood of being burned, either by fire or by the sun. It is often used in the context of materials, skin types, or geographic areas.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The burn-prone was high that summer.","correct":"✓ The fire risk was high that summer.","note":"\"Burn-prone\" is an adjective, so it should modify a noun. Use \"fire risk\" or \"fire danger\" instead."}],"priority":"N/A"},"related_words":{"derivatives":["prone (adjective: likely to experience or suffer from something)","burn (verb: to be damaged or destroyed by fire or heat; noun: an injury caused by heat or fire)"],"phrasal_verbs":["N/A"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"\"Burn-prone\" is a compound adjective that describes something easily damaged by fire or the sun. It combines the words \"burn\" and \"prone,\" where \"prone\" means likely to experience something. It is used to describe materials that catch fire easily, skin that sunburns easily, or areas where fires are likely to occur. It's a relatively uncommon term, but its meaning is straightforward based on its component words."},"example_sentences":[{"sentence":"The old wooden building was extremely burn-prone.","translation":"その古い木造の建物は非常に燃えやすかった。","type":"adjective","meaning_category":"燃えやすい"},{"sentence":"People with fair skin are more burn-prone.","translation":"色白の人は日焼けしやすい。","type":"adjective","meaning_category":"日焼けしやすい"},{"sentence":"Due to the drought, the forest became burn-prone.","translation":"干ばつのため、その森林は火災が発生しやすくなった。","type":"adjective","meaning_category":"焼けやすい"}]}