{"word":"Tontine","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"生存者給付年金、トンチン年金","english_definition":"A joint investment plan, popular in the 17th and 18th centuries, under which subscribers share income from the pool of capital until the last member dies, at which point that member receives all of the assets.","examples":[{"sentence":"The old men were all part of a tontine, hoping to outlive each other.","translation":"その老人たちは皆、トンチン年金に加入しており、互いよりも長生きすることを願っていた。"},{"sentence":"The tontine was a popular way to raise capital for public works projects.","translation":"トンチン年金は、公共事業プロジェクトのための資金調達の一般的な方法だった。"}],"collocations":["set up a tontine (トンチン年金を設立する)","invest in a tontine (トンチン年金に投資する)","tontine scheme (トンチン年金制度)","participate in a tontine (トンチン年金に参加する)"],"synonyms":["annuity","investment pool","joint investment"],"antonyms":[]}],"etymology":{"value":"17世紀のイタリアの銀行家ロレンツォ・トンティ（Lorenzo Tonti）にちなんで名付けられた。トンティがこの年金制度を考案したとされる。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɒntiːn/","syllables":"ton-tine"},"inflection":{"noun_plural":"tontines"},"usage_notes":{"explanation":"A tontine is a specific type of investment plan where a group of people pool their money, and the income or assets are distributed among the surviving members over time. Eventually, the last surviving member receives all the remaining assets. Tontines are less common today due to regulatory and ethical concerns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He invested in a tontine for his retirement, but it was not ethical.","correct":"✓ He invested in a tontine for his retirement, but tontines are often viewed as unethical today.","note":"Tontines themselves are not inherently unethical, but they raise ethical concerns due to the incentive to outlive other members. The correction clarifies this point."}],"priority":"★☆☆"},"related_words":{"derivatives":["tontinier (noun: トンチン年金加入者)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語に近い。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Tontine**」は、17世紀から18世紀にかけて人気があった共同投資計画の一種を指す専門用語です。加入者は資本プールからの収入を共有し、最後の生存者がすべての資産を受け取ります。今日では規制や倫理的な懸念から一般的ではありません。歴史的な文脈や金融に関する議論で登場することがあります。"},"example_sentences":[{"sentence":"The historical society discussed the use of tontines in early American finance.","translation":"歴史協会は、初期のアメリカ金融におけるトンチン年金の利用について議論した。","type":"noun","meaning_category":"生存者給付年金"},{"sentence":"The novel featured a plot centered around a group of people invested in a tontine.","translation":"その小説は、トンチン年金に投資した人々のグループを中心としたプロットを特徴としていた。","type":"noun","meaning_category":"生存者給付年金"}]}