{"word":"Evacuants","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Substances that promote evacuation, especially of the bowels; laxatives or purgatives.","english_definition":"Agents that promote evacuation, especially of the bowels; laxatives or purgatives.","examples":[{"sentence":"The doctor prescribed evacuants to relieve his constipation.","translation":"医者は彼の便秘を和らげるために下剤を処方した。"},{"sentence":"Certain foods can act as natural evacuants.","translation":"特定の食品は天然の下剤として作用する可能性がある。"}],"collocations":["bowel evacuants","natural evacuants","prescribed evacuants"],"synonyms":["laxatives","purgatives","cathartics"],"antonyms":["anti-diarrheals"]}],"etymology":{"value":"Derived from the verb 'evacuate,' meaning to empty or clear out. The suffix '-ant' indicates an agent or substance that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈvækjʊənts/","syllables":"e-vac-u-ants"},"inflection":{"noun_plural":"Evacuants"},"usage_notes":{"explanation":"'Evacuants' is a technical term, primarily used in medical contexts to refer to substances that aid in emptying the bowels. It is less commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The evacuants caused him to evacuate the building.","correct":"✓ The evacuants helped him to evacuate his bowels.","note":"'Evacuants' refers to substances that aid bowel movements, while 'evacuate' (verb) means to leave a place."}],"priority":"★★☆"},"related_words":{"derivatives":["evacuate","evacuation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'evacuants' is highly specialized and primarily encountered in medical or pharmaceutical contexts. It refers specifically to substances that promote bowel evacuation. Understanding of this term requires a strong vocabulary in health-related fields."},"example_sentences":[{"sentence":"The patient was given evacuants prior to the colonoscopy.","translation":"患者は大腸内視鏡検査の前に下剤を投与された。","type":"noun","meaning_category":"Laxatives or purgatives"},{"sentence":"Certain herbal remedies are known to act as gentle evacuants.","translation":"特定のハーブ療法は、穏やかな下剤として作用することが知られている。","type":"noun","meaning_category":"Laxatives or purgatives"}]}