{"word":"Morphotropism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(結晶学)結晶の形状と化学組成の関係の研究。化学組成のわずかな変化が結晶構造に大きな影響を与える現象。","english_definition":"(Crystallography) The study of the relationship between crystal shape and chemical composition; the phenomenon where small changes in chemical composition can have a significant impact on crystal structure.","examples":[{"sentence":"Morphotropism is crucial in understanding the properties of certain minerals.","translation":"モルフォトロピズムは、特定の鉱物の特性を理解する上で重要である。"},{"sentence":"The morphotropism of perovskite materials is actively researched for new electronic applications.","translation":"ペロブスカイト材料のモルフォトロピズムは、新しい電子応用に向けて活発に研究されている。"}],"collocations":["exhibit morphotropism (モルフォトロピズムを示す)","study morphotropism (モルフォトロピズムを研究する)","morphotropic phase boundary (モルフォトロピック相境界)"],"synonyms":["crystal morphology","crystal chemistry"],"antonyms":[]}],"etymology":{"value":"「morpho-」(形) + 「-tropism」(方向、変化)に由来。結晶の形状が化学組成によって変化する傾向を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/mɔːrˈfɒtrəpɪzəm/","syllables":"mor-pho-tro-pi-sm"},"inflection":{"noun_plural":"morphotropisms"},"usage_notes":{"explanation":"モルフォトロピズムは、結晶学、鉱物学、材料科学などの分野で用いられる専門用語です。特に、ペロブスカイト構造を持つ材料の研究において重要な概念となっています。化学組成のわずかな変化が、結晶の電気的、磁気的特性に大きな影響を与えるため、新しい機能性材料の開発に応用されています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The morphotropism is when the crystal is big.","correct":"✓ Morphotropism is the relationship between crystal shape and chemical composition.","note":"モルフォトロピズムは、結晶の大きさそのものではなく、結晶の形状と化学組成の関係を指します。"},{"incorrect":"✗ Morphotropism only affects organic crystals.","correct":"✓ Morphotropism can affect both organic and inorganic crystals.","note":"モルフォトロピズムは有機結晶だけでなく、無機結晶にも影響を与えます。"}],"priority":"★☆☆"},"related_words":{"derivatives":["morphotropic (形容詞: モルフォトロピックな)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Morphotropism**」は、結晶の形（morphology）が化学組成の変化に応じて変わる現象を指す専門用語です。これは特に、特定の材料の特性を理解し、新しい材料を設計する際に重要になります。例えば、ペロブスカイトという構造を持つ材料では、わずかな化学組成の変化が、その電気的な性質に大きな影響を与えることがあります。この単語は、結晶学、材料科学、鉱物学などの分野で使われます。"},"example_sentences":[{"sentence":"The researchers investigated the morphotropism in barium titanate crystals.","translation":"研究者たちは、チタン酸バリウム結晶のモルフォトロピズムを調査した。","type":"noun","meaning_category":"結晶学"},{"sentence":"Understanding morphotropism is essential for designing new piezoelectric materials.","translation":"モルフォトロピズムを理解することは、新しい圧電材料を設計するために不可欠である。","type":"noun","meaning_category":"材料科学"}]}