{"word":"unornamented-legged","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Having legs that are not decorated or adorned.","english_definition":"Describing something (usually furniture) that has legs lacking any decorative features or embellishments.","examples":[{"sentence":"The unornamented-legged table suited the minimalist decor of the room.","translation":"装飾のない脚のテーブルは、部屋のミニマリストな内装に合っていた。"},{"sentence":"She preferred the simple, unornamented-legged chairs to the more elaborate ones.","translation":"彼女は、より手の込んだ椅子よりも、シンプルで装飾のない脚の椅子を好んだ。"}],"collocations":["unornamented-legged chair","unornamented-legged table","simple unornamented-legged design"],"synonyms":["plain-legged","simple-legged","unadorned-legged","unembellished-legged"],"antonyms":["ornamented-legged","decorated-legged","adorned-legged","embellished-legged"]}],"etymology":{"value":"Formed by combining 'unornamented' (not decorated) and 'legged' (having legs).","priority":"Medium"},"pronunciation":{"ipa":"ʌnˈɔːrnəˌmɛntɪd lɛɡd","syllables":"un-or-na-men-ted-legged"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"This term is most commonly used to describe furniture, particularly tables and chairs, where the legs lack any carving, painting, or other decorative elements. It implies a simple, functional design.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The unornamented-legged cat sat on the mat.","correct":"The cat with unornamented legs sat on the mat.","note":"This term typically describes inanimate objects, not animals. If referring to an animal, rephrase to describe the animal's legs in a simple, direct way."}],"priority":"Low"},"related_words":{"derivatives":["unornamented","legged"],"phrases":["simple design","minimalist furniture"]},"level_frequency":{"frequency_google_ngram":"Very Low - This is a niche descriptive term.","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'unornamented-legged' is a compound adjective used to describe furniture or other objects with legs that lack any decoration or embellishment. It is a relatively uncommon term, likely encountered in contexts discussing design, furniture styles, or interior decorating. Its meaning is straightforward, combining the concept of being 'unornamented' with the attribute of having 'legs'."},"example_sentences":[{"sentence":"The craftsman specialized in creating sturdy, unornamented-legged stools.","translation":"その職人は、丈夫で装飾のない脚のスツールを作ることを専門としていた。","type":"adjective","meaning_category":"description of furniture"},{"sentence":"The stark white room featured only an unornamented-legged desk and a single chair.","translation":"殺風景な白い部屋には、装飾のない脚の机と椅子が1脚だけがあった。","type":"adjective","meaning_category":"description of furniture"}]}