{"word":"cooperatively-created","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"共同で作成された、協力して作り上げられた","english_definition":"Created or produced by means of cooperation; involving collaborative effort.","examples":[{"sentence":"This website is a cooperatively-created resource for language learners.","translation":"このウェブサイトは、言語学習者のための共同作成リソースです。"},{"sentence":"The project resulted in a cooperatively-created artwork.","translation":"そのプロジェクトは、協力して作り上げられたアート作品を生み出しました。"},{"sentence":"The cooperatively-created document reflected the diverse perspectives of the team.","translation":"その共同作成された文書は、チームの多様な視点を反映していました。"}],"collocations":["cooperatively-created content","cooperatively-created platform","cooperatively-created environment","cooperatively-created project","cooperatively-created learning materials"],"synonyms":["collaboratively-created","jointly-developed","collectively-produced","team-built","collaborative"],"antonyms":["individually-created","independently-developed","solely-produced","single-authored"]}],"etymology":{"value":"The word is formed by combining 'cooperatively' (acting or working together willingly for a common purpose) with 'created' (brought into existence). It emphasizes the collaborative nature of the creation process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊˈɑːpərətɪvli kriˈeɪtɪd/","syllables":"co-op-er-a-tive-ly cre-a-ted"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Cooperatively-created' is used to describe something that is the result of people working together in a collaborative and cooperative manner. It highlights the shared effort and joint contribution involved in the creation process. It is often used in contexts where the process of creation is as important as the final product.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cooperatively created.","correct":"✓ The cooperatively-created project.","note":"'Cooperatively-created' is an adjective and needs to modify a noun. It cannot stand alone as a noun or verb."},{"incorrect":"✗ cooperatively created project","correct":"✓ cooperatively-created project","note":"When used as a compound adjective before a noun, it is usually hyphenated."}],"priority":"★★☆"},"related_words":{"derivatives":["cooperatively (adverb)","cooperation (noun)","create (verb)","creation (noun)"],"phrasal_verbs":[],"related_terms":["collaborative","collaboratively","jointly","collectively","teamwork","partnership","alliance"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. More common in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'cooperatively-created' is a relatively advanced term indicating that something was made through a collaborative effort. It's more common in professional or academic settings where the process of creation is emphasized. Understanding this term requires a good grasp of both 'cooperatively' and 'created' and the ability to combine them conceptually."},"example_sentences":[{"sentence":"The students developed a cooperatively-created presentation on climate change.","translation":"学生たちは、気候変動に関する共同作成のプレゼンテーションを作成しました。","type":"adjective","meaning_category":"共同で作成された"},{"sentence":"The cooperatively-created curriculum was designed to meet the needs of all learners.","translation":"その共同作成されたカリキュラムは、すべての学習者のニーズを満たすように設計されました。","type":"adjective","meaning_category":"協力して作り上げられた"},{"sentence":"The success of the project was due to the cooperatively-created atmosphere of trust and respect.","translation":"プロジェクトの成功は、信頼と尊敬の共同作成された雰囲気のおかげでした。","type":"adjective","meaning_category":"共同で作成された"}]}