{"word":"Meridion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(天文学、測地学)子午環、トランシット","english_definition":"(astronomy, geodesy) A telescope mounted so as to rotate around a single horizontal axis, used for precise measurement of the times at which stars cross the local meridian.","examples":[{"sentence":"The astronomer used the Meridion to track the movement of stars.","translation":"天文学者はMeridionを使って星の動きを追跡した。"}],"collocations":["Meridion telescope","Meridion observation"],"synonyms":["transit instrument","transit circle"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'meridies,' meaning 'midday' or 'south.' The instrument is named so because it is used to observe celestial objects as they cross the meridian, the imaginary line in the sky that passes from north to south through the zenith.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈrɪdiən/","syllables":"Me-rid-i-on"},"inflection":{"noun_plural":"Meridions"},"usage_notes":{"explanation":"'Meridion' refers specifically to a type of telescope designed for precise measurements of celestial objects as they cross the meridian. It is primarily used in astronomy and geodesy for determining the exact time of transit and the positions of stars.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a beautiful Meridion in the sky last night.","correct":"✓ I saw a beautiful star in the sky last night.","note":"'Meridion' is not a celestial object itself but rather a scientific instrument used to observe them."}],"priority":"★★☆"},"related_words":{"derivatives":["meridian (子午線)"],"related_terms":["zenith","transit","celestial sphere"]},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Meridion' is a specialized term used in astronomy and geodesy. It refers to a specific type of telescope used for precise measurements of celestial objects as they cross the local meridian. Understanding this term requires familiarity with astronomical concepts and instrumentation."},"example_sentences":[{"sentence":"The old observatory still houses a classic Meridion.","translation":"その古い天文台には、今でも古典的なMeridionが設置されている。","type":"noun","meaning_category":"astronomy instrument"},{"sentence":"Using the Meridion, they accurately determined the star's right ascension.","translation":"Meridionを使って、彼らはその星の赤経を正確に決定した。","type":"noun","meaning_category":"astronomy instrument"}]}