{"word":"Photoscope","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A device for viewing photographs, especially stereoscopic ones, often involving lenses or mirrors to enhance the image.","english_definition":"An apparatus for viewing photographs, especially stereoscopic photographs, often using lenses or mirrors to create an enhanced or three-dimensional effect.","examples":[{"sentence":"The antique photoscope allowed viewers to experience the stereoscopic images in a new way.","translation":"そのアンティークのフォトスコープは、鑑賞者に立体画像を新しい方法で体験させることを可能にした。"},{"sentence":"Using a photoscope, the old photographs seemed to come to life.","translation":"フォトスコープを使うと、古い写真が生き生きとして見えるようだった。"}],"collocations":["antique photoscope","stereoscopic photoscope","viewing with a photoscope"],"synonyms":["stereoscope","viewer"],"antonyms":[]}],"etymology":{"value":"The word 'photoscope' is a combination of 'photo' (from photograph) and 'scope' (from Greek 'skopeō' meaning 'to see' or 'to examine'). It literally means 'an instrument for seeing photographs'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfoʊtoʊˌskoʊp/","syllables":"pho-to-scope"},"inflection":{"noun_plural":"photoscopes"},"usage_notes":{"explanation":"A photoscope is primarily a historical or specialized term referring to devices used to view photographs, particularly stereoscopic ones. It is not a commonly used word in modern English, with 'stereoscope' or simply 'viewer' being more prevalent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a photoscope to take the picture.","correct":"✓ I used a camera to take the picture.","note":"A photoscope is for viewing, not taking, pictures."}],"priority":"★☆☆"},"related_words":{"derivatives":["photoscopic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'photoscope' is relatively uncommon. It refers to a device used for viewing photographs, particularly stereoscopic images, often employing lenses or mirrors to enhance the viewing experience. The word itself combines 'photo' and 'scope,' indicating its function as an instrument for seeing photographs. While not frequently encountered in modern usage, understanding the term provides insight into historical methods of image viewing.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum displayed a rare photoscope from the 19th century.","translation":"博物館には19世紀の珍しいフォトスコープが展示されていた。","type":"noun","meaning_category":"device for viewing photographs"},{"sentence":"He adjusted the lenses of the photoscope to get a clearer view of the stereoscopic image.","translation":"彼は立体画像をより鮮明に見るために、フォトスコープのレンズを調整した。","type":"noun","meaning_category":"device for viewing photographs"}]}